{"id":20228,"no":30,"title":"The \"Revenge\"","content":"In the days of Queen Elizabeth, English sailors first began to find their way across the seas to new lands, from which they brought home many strange, and rich, and beautiful things. The Spaniards sailed across the seas too, to fetch gold and silver from the mines in Mexico, which belonged to the King of Spain. Sometimes the English ships met the Spanish ones, and robbed them of their gold, for it was thought quite right and fair in those days to take every chance of doing harm to the enemies of England. Of course the Spaniards hated the English for this, and whenever they met English ships which were weaker than theirs they attacked them, and robbed them, killing the sailors, or taking them prisoners.\n\u003cbr\u003e \n\u003cbr\u003e Once, a small ship, called the Revenge, was sailing home to England, when it met with fifty great Spanish vessels. The captain of the Revenge was Sir Richard Grenville, and he had a great many sick men on board. There was no time to escape from the Spanish ships, which soon surrounded the little Revenge. So there were only two courses which Sir Richard could take. One was to give up his ship to the Spaniards; the other was to fight with them till his men were all killed, or his ship sank.\n\u003cbr\u003e \n\u003cbr\u003e Some of the sailors wished him to take the first course, but the others, and all the sick men, said: \"Nay, let us fall into the hands of God, and not into the hands of Spain.\" This they said because they thought it better to die, than to be made prisoners by the cruel Spaniards.\n\u003cbr\u003e \n\u003cbr\u003e Sir Richard made up his mind to fight. It was after[Pg 74] noon when the firing began, and all night long, until daylight came, the little English ship kept the fifty Spanish vessels at bay. Then it was found that all the powder was gone, and all the English were dead or dying. And then only was the flag of the Revenge pulled down, to show that she surrendered to her enemies.\n\u003cbr\u003e \n\u003cbr\u003e The brave Sir Richard was taken on board a Spanish ship, where he soon died of his wounds.\n\u003cbr\u003e \n\u003cbr\u003e These were his last words: \"Here die I, Richard Grenville, with a joyful and quiet mind, for I have ended my life as a good soldier ought. I have fought for my country and my queen, for honour, and for God.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2154/60909.html","bookId":596,"creation":"Aug 2, 2019 11:35:23 AM","modification":"Aug 2, 2019 11:35:23 AM"}
