{"id":85971,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJake nods. \"Center. Got it. Where will you be?\"\u003c/p\u003e\n\u003cp\u003e\"Nowhere special.\"\u003c/p\u003e\n\u003cp\u003e\"Nowhere special\" is a pretty apt description of the boys\u0027 changing room. Its rows of orange- painted lockers and square windows that filter weak rays of real light into the room--real light that\u0027s promptly swallowed by the fluorescent lights overhead.\u003c/p\u003e\n\u003cp\u003eAnd it smells bad.\u003c/p\u003e\n\u003cp\u003eChris is sitting on the bench closest to the door when I sneak in. There\u0027s a binder resting beside him--math homework. At least it better be.\u003c/p\u003e\n\u003cp\u003e\"What if someone comes in?\" My voice echoes around the room.\u003c/p\u003e\n\u003cp\u003eChris stands, drags the bench to the tiny alcove where the door is and wedges it in such a way that no one should be able to get in. There was definitely a time when he wouldn\u0027t have cared if anyone caught us in here--and we\u0027d been caught a few times--but now he\u0027s with Becky and those days are dead.\u003c/p\u003e\n\u003cp\u003e\"So.\" I clear my throat. \"How many pages of math will this be worth?\"\u003c/p\u003e\n\u003cp\u003eHe nods to the bench. I sit. He sits beside me.\u003c/p\u003e\n\u003cp\u003eThis is the skankiest thing I\u0027ve ever done.\u003c/p\u003e\n\u003cp\u003eI try to ignore how it starts with his hands carefully coming up past my cheeks and around my neck until his fingers are in my hair. He doesn\u0027t kiss me then, but he brings his face close, forehead against mine, and breathes me in because he wants me to feel guilty, I think. I think maybe it\u0027s working.\u003c/p\u003e\n\u003cp\u003eI haven\u0027t thought about the money in a long time.\u003c/p\u003e\n\u003cp\u003eHis lips get excruciatingly close to mine and he pauses.\u003c/p\u003e\n\u003cp\u003e\"Do you even miss me?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I say.\u003c/p\u003e\n\u003cp\u003eHe finally kisses me, presses his lips lightly against mine. I know what he\u0027s doing. He\u0027s teasing me and I won\u0027t have it. I make him really kiss me, full on the mouth, and force his lips apart with my own.\u003c/p\u003e\n\u003cp\u003eAnd then he stops.\u003c/p\u003e\n\u003cp\u003e\"What about everything you felt about me? Where does that go?\" He leans in again and stops before anything can happen. \"I would\u0027ve stuck it out. You wouldn\u0027t let me help you.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t need your help.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, you did. You do. Everyone got through it together but you. You\u0027re so perfect, you just couldn\u0027t handle it--\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re as bad as Jake,\" I say. \"You talk too much. Shut up and forget it because it\u0027s not worth your homework for me to sit here and listen to you nitpick the past.\"\u003c/p\u003e\n\u003cp\u003eThat kills it. After a second, he presses his binder into my hands.\u003c/p\u003e\n\u003cp\u003e\"Take it,\" he says, before I can ask. \"Have it back to me by tomorrow morning.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, come on. Afraid you won\u0027t respect yourself afterward?\" I study him. His cheeks are pink. \"I\u0027m not going to tell Becky.\"\u003c/p\u003e\n\u003cp\u003e\"I just wanted to kiss you again.\"\u003c/p\u003e\n\u003cp\u003e\"Stop it.\"\u003c/p\u003e\n\u003cp\u003e\"You could\u0027ve said no,\" he says, standing. He pulls the bench out. \"You know I\u0027m not over you. You could\u0027ve said no and done the homework yourself, but you didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right,\" I say. \"You know what? You\u0027re absolutely right. Call it a momentary lapse of sanity.\"\u003c/p\u003e\n\u003cp\u003eHe opens the door.\u003c/p\u003e\n\u003cp\u003e\"Or maybe you just wanted to kiss me again, too.\"\u003c/p\u003e\n\u003cp\u003eI roll my eyes.\u003c/p\u003e\n\u003cp\u003eEIGHT\u003c/p\u003e\n\u003cp\u003eBailey\u0027s developed this weird attachment to me. He follows me from room to room, lays at my feet under the dinner table and stands guard in the living room for the two hours it takes me to copy Chris\u0027s math homework. My parents can\u0027t shut up about how cute it is, so three guesses for how I feel about it, and the first two don\u0027t count.\u003c/p\u003e\n\u003cp\u003e\"Maybe you could take him for a walk, now that your foot is better.\"\u003c/p\u003e\n\u003cp\u003eMom says it in a voice that tells me it\u0027s less of a suggestion and more of a command. I go along with it because I want out. I throw my coat on, attach Bailey to the leash--his tail wags back and forth excitedly--and escape.\u003c/p\u003e\n\u003cp\u003e\"Hey, Parker!\"\u003c/p\u003e\n\u003cp\u003eI\u0027ve been walking a good forty minutes when I hear my name. Somehow I took a turn that landed me on Victoria Street, where the traffic is kind of heavy and I cross the paths of more people than I normally like to do. I cock my head to the side. Nothing. Maybe I didn\u0027t hear it after all. I keep walking.\u003c/p\u003e\n\u003cp\u003e\"Parker!\"\u003c/p\u003e\n\u003cp\u003eDamn. I turn in the direction of the voice and spot Jake emerging from the video store, holding a plastic DVD case in his hand. He jogs over.\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t figure I\u0027d see you before tomorrow,\" he says.\u003c/p\u003e\n\u003cp\u003e\"That makes two of us.\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s this?\"\u003c/p\u003e\n\u003cp\u003eJake crouches down and gives Bailey a vigorous head petting. He scratches Bailey behind his ears, under his chin, the works.\u003c/p\u003e\n\u003cp\u003e\"This is Bailey. Bailey, this is Jake Gardner.\"\u003c/p\u003e\n\u003cp\u003e\"Hi, Bailey,\" Jake says, patting his nose. Bailey loves the attention. His eyes half close and his tongue hangs out, but his tongue always does that. I realize it\u0027s been thirty seconds and I haven\u0027t said anything mean to Jake.\u003c/p\u003e\n\u003cp\u003eJake smiles at me. \"I think Bailey likes me.\"\u003c/p\u003e\n\u003cp\u003e\"Bailey doesn\u0027t have very discriminating taste,\" I warn him. \"He adored his last owner and his last owner used to beat him, so it doesn\u0027t really say much about you.\"\u003c/p\u003e\n\u003cp\u003eStill got it.\u003c/p\u003e\n\u003cp\u003eJake gives Bailey one last pat on the head and stands.\u003c/p\u003e\n\u003cp\u003e\"So why did you run away from home?\"\u003c/p\u003e\n\u003cp\u003e\"How many minutes a day do you spend thinking about me?\" I ask. \"Like, do you have anything else to live for?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your own fault,\" he replies. \"The less you want me to know about you, the more I want to find out. Especially if it bothers you.\"\u003c/p\u003e\n\u003cp\u003e\"Nice. What gives you the right?\"\u003c/p\u003e\n\u003cp\u003e\"You kind of set the precedent when we met, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Bailey, attack!\"\u003c/p\u003e\n\u003cp\u003eI give his leash a sharp tug. He only stares at us happily.\u003c/p\u003e\n\u003cp\u003eJake laughs. \"So cute.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, well, I don\u0027t know about you, but I\u0027m walking now.\" \"Wow, that\u0027s practically an invitation coming from you.\"\u003c/p\u003e\n\u003cp\u003eSo we walk.\u003c/p\u003e\n\u003cp\u003e\"Got any more ideas for our project?\" he asks.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m supposed to be thinking of ideas?\" I ask back. \"I wonder if Norton knows how dumb this assignment is. Do you think he does? Think he\u0027s just fucking with us?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, maybe. So why did you run away from home?\"\u003c/p\u003e\n\u003cp\u003e\"Okay, Jake?\" I stop; he stops. \"I\u0027m going to tell you something and I want you to listen carefully and then every time you want to ask me a personal question, you can just refer back to this answer. Are you ready?\"\u003c/p\u003e\n\u003cp\u003eHe nods and his hair falls into his eyes. He brushes it away.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m really fucked up,\" I tell him. \"And I don\u0027t like people.\"\u003c/p\u003e\n\u003cp\u003e\"Got it,\" he says. \"But why?\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t matter why. I don\u0027t give the people I know valuable insight into my psyche. You\u0027re the new kid. You have no chance.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going try to have a conversation with you anyway. Are you ready?\"\u003c/p\u003e\n\u003cp\u003eI think if I roll my eyes any more this year, they might get stuck in my head, so I refrain. But not rolling my eyes leaves me with an anxious feeling, so I hand Jake Bailey\u0027s leash and start snapping my fingers.\u003c/p\u003e\n\u003cp\u003e\"So, Parker,\" he begins. \"How are you?\"\u003c/p\u003e\n\u003cp\u003e\"Oh my God.\" I give in to the eye roll. \"I\u0027m fine, Jake. How are you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m good. Getting used to St. Peter\u0027s and stuff.\"\u003c/p\u003e\n\u003cp\u003e\"Why bother? You\u0027ll just be leaving soon anyway.\"\u003c/p\u003e\n\u003cp\u003e\"I believe in making the most of my time,\" he says. We head farther down the street. \"It hasn\u0027t been easy. I used to go to a public school and now I\u0027m stuck in your stupid uniforms. And the praying drives me crazy.\"\u003c/p\u003e\n\u003cp\u003e\"You and everyone else.\" I stop snapping my fingers and cross my arms. It\u0027s chilly out. \"Do you know how much harder it is to become popular when you have to wear a uniform? You can\u0027t rely on being fashionable to help you climb the social ladder. Becky and Jessie and I had a hell of a time working our way up in those uniforms.\"\u003c/p\u003e\n\u003cp\u003e\"Tragedy,\" Jake says.\u003c/p\u003e\n\u003cp\u003e\"Definitely,\" I agree. \"Were you popular at your old school?\"\u003c/p\u003e\n\u003cp\u003e\"Would you like me less depending on my answer?\"\u003c/p\u003e\n\u003cp\u003e\"Jake, I don\u0027t think I could like you any less,\" I assure him. \"Besides, I know you were. Popular people give off pheromones only other popular people can pick up on. Chris really took a liking to you, so I put two and two together.\"\u003c/p\u003e\n\u003cp\u003e\"My best friend was the most popular guy in my old school,\" Jake admits. \"His name was Adam Jenkins.\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t say anything.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t necessarily want it,\" he adds, like that\u0027ll make me think more of him. \"Why did you want to be popular?\"\u003c/p\u003e\n\u003cp\u003e\"Who says I wanted to be popular?\"\u003c/p\u003e\n\u003cp\u003e\"Please. You just said you worked your way to the top. Why?\"\u003c/p\u003e\n\u003cp\u003e\"Why does it matter?\" \"I\u0027m curious.\"\u003c/p\u003e\n\u003cp\u003e\"You should really do something about that.\" I take Bailey\u0027s leash back. \"I thought it would be easier.\"\u003c/p\u003e\n\u003cp\u003eJake nods like he understands, but popularity is always different for guys--way less maintenance involved. It really is easier for them. And besides, I\u0027m totally lying anyway. I didn\u0027t want to be popular because it was easier; I wanted to be popular because in high school that\u0027s the best thing you can be: perfect. Everything else is shit.\u003c/p\u003e\n\u003cp\u003eWe keep walking and I wish he\u0027d leave. Being on this street feels wrong. All these people, the cars flying back and forth--it\u0027s like a scene out of a movie and I belong to it with Jake and the dog. It probably looks perfect to someone watching from the outside, but it really freaks me out, so I keep glancing up and down the street, hoping for an opportunity to ditch him. And that\u0027s when I spot this familiar face outside Al\u0027s Convenience Store and everything stops. Like time. Everything.\u003c/p\u003e\n\u003cp\u003eHe looks terrible, gaunt. A male anorexic. Even from across the road, I can see the hollows of his cheekbones, and he\u0027s slouched over and pale and his hair\u0027s longer than he\u0027d ever let it grow last year, like really long, like hanging-in-his-eyes long, and I don\u0027t understand why he\u0027s back. Why is he back and how soon before he leaves again? \u003c/p\u003e","sourceLink":"https://allnovel.net/cracked-up-to-be/page-11.html","bookId":1897,"creation":"Oct 5, 2019 5:10:51 PM","modification":"Oct 5, 2019 5:10:51 PM"}
