{"id":85989,"no":29,"title":"Page 29","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe blinks. \"Through the living room, down the hall,\" he says, pointing. \"It\u0027s the second door on the right.\"\u003c/p\u003e\n\u003cp\u003eI wander through his living room, which is sort of quaint and cozy, and down the narrow strip of hall with doors that offshoot into bedrooms, closets and bathrooms. The room opposite the bathroom catches my attention. It\u0027s unmistakably Jake\u0027s room, from the clothes piled on the floor to the unmade bed. I check to see if he\u0027s watching me from the kitchen. He\u0027s not.\u003c/p\u003e\n\u003cp\u003eI cross the hall and enter his room.\u003c/p\u003e\n\u003cp\u003eYou can tell a lot about a person from their personal space, go figure. The posters on the wall make Jake\u0027s homesickness more evident than he ever would. There are no declarations of love for a particular band or movie, only shots of buildings in a city by the sea. I move to the bulletin board hanging over his desk and study the photographs tacked to it. Jake is in every single photo, naturally, and he\u0027s always surrounded by people and he always looks happy. I lean forward and peer at a photo of him wedged between two people who I\u0027m guessing are his parents, pre-divorce.\u003c/p\u003e\n\u003cp\u003eHe looks a lot like his mom.\u003c/p\u003e\n\u003cp\u003e\"My yearbooks are on the bookshelf, if you\u0027re curious. And, uh, that\u0027s my underwear drawer over there and of course there\u0027s my closet. Snoop away.\"\u003c/p\u003e\n\u003cp\u003eI try not to let on he\u0027s startled me.\u003c/p\u003e\n\u003cp\u003e\"Nice room,\" I say.\u003c/p\u003e\n\u003cp\u003e\"It does the job.\" He\u0027s right behind me, really close. \"You never answered my question.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you ever get tired of asking me questions?\"\u003c/p\u003e\n\u003cp\u003e\"Have to fill the moment somehow,\" he says.\u003c/p\u003e\n\u003cp\u003eI turn. We\u0027re close. Like, I Could Kiss Him close. I skirt around him and sit on the bed. He sits beside me and clears his throat.\u003c/p\u003e\n\u003cp\u003e\"I just wonder what you\u0027re punishing yourself for, that\u0027s all,\" he says.\u003c/p\u003e\n\u003cp\u003e\"I...\" I clench my right hand, my fingernails digging into my palm. \"I did something really wrong and I knew it was really wrong while I was doing it and I did it anyway.\"\u003c/p\u003e\n\u003cp\u003e\"It happens.\"\u003c/p\u003e\n\u003cp\u003e\"Not to me.\"\u003c/p\u003e\n\u003cp\u003eMy eyes hurt and my throat is tight. But I don\u0027t want to cry in front of Jake because there\u0027s nothing in it for me.\u003c/p\u003e\n\u003cp\u003e\"Oh hey,\" Jake says, alarmed, when the first tear gets by me. \"I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003eGoddammit.\u003c/p\u003e\n\u003cp\u003e\"You should be.\"\u003c/p\u003e\n\u003cp\u003eIf my life were a movie, this would be the scene where I start blubbering and tell Jake to stay away from me or he\u0027ll just end up hurt or dead and, I don\u0027t know, maybe we\u0027d kiss and try it anyway. But as fast as the tears come, they stop.\u003c/p\u003e\n\u003cp\u003e\"Was it when--\" He clears his throat. \"Was it when you tried to kill yourself?\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t say anything.\u003c/p\u003e\n\u003cp\u003e\"I mean... what was that like?\"\u003c/p\u003e\n\u003cp\u003eI snort. \"Well, it was obviously a very happy period in my life.\"\u003c/p\u003e\n\u003cp\u003e\"Why are you doing that?\"\u003c/p\u003e\n\u003cp\u003e\"Doing what?\"\u003c/p\u003e\n\u003cp\u003e\"Snapping your fingers.\" I look down. Sure enough, I\u0027m snapping. He reaches over and grabs my hand. Holds it. I try to act like it doesn\u0027t bother me.\u003c/p\u003e\n\u003cp\u003e\"I shouldn\u0027t have asked,\" he says.\u003c/p\u003e\n\u003cp\u003eIt\u0027s just getting more and more awkward. There are hours until tomorrow.\u003c/p\u003e\n\u003cp\u003e\"I stole a few hundred dollars from Chris and I got the hell out of Corby,\" I say after a minute. I\u0027ve never talked about it like this before. \"And I got a big bottle of booze and a big bottle of sleeping pills. And I downed both. And then I got found. And then I got my stomach pumped.\"\u003c/p\u003e\n\u003cp\u003e\"How close were you?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eNot close enough.\u003c/p\u003e\n\u003cp\u003eThe phone rings from some other room. Jake clears his throat and the moment is over. I wonder how people lived with each other before they could learn to count on these types of inconveniences.\u003c/p\u003e\n\u003cp\u003e\"I should get that,\" he says.\u003c/p\u003e\n\u003cp\u003eHe leaves the room and a minute later his voice wafts into the bedroom from the kitchen and I can\u0027t think of anything to do, so I start rifling through his nightstand. I wouldn\u0027t do it if I knew he\u0027d have a problem with it. Or maybe I would. Cough drops, condoms, old movie stubs and loose change. By the time Jake gets back, my hands are folded in my lap. He stands in the doorway, a silhouette.\u003c/p\u003e\n\u003cp\u003e\"Parker, why are you here?\" he asks.\u003c/p\u003e\n\u003cp\u003e\"Do you want me to go?\"\u003c/p\u003e\n\u003cp\u003e\"No, no. It\u0027s--\" He steps into the room and sits back down beside me. \"I was just wondering why you\u0027re here. I mean, I\u0027m glad you\u0027re here, but--\"\u003c/p\u003e\n\u003cp\u003eI kiss him then, not to shut him up, but because I want to and because no one says things like I\u0027m glad you\u0027re here to me anymore, which is mostly my fault, and I don\u0027t know, I don\u0027t want to keep coming back to him because it\u0027s better if I don\u0027t.\u003c/p\u003e\n\u003cp\u003eSo I should get this part over with.\u003c/p\u003e\n\u003cp\u003eJake kisses back. His lips are soft. My fingertips drift over his cheeks and I want this and I\u0027m so caught up in how nice he feels and how nice he smells and the way he\u0027s touching me, I can almost pretend it\u0027s okay that I want this.\u003c/p\u003e\n\u003cp\u003eIt\u0027s okay to want this. Everything\u0027s...\u003c/p\u003e\n\u003cp\u003eHis mouth moves from my lips to my neck. I close my eyes.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad I\u0027m here,\" I murmur.\u003c/p\u003e\n\u003cp\u003e\"What?\" His voice tickles my skin. He heard it. I know he did.\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" I say, and his lips are on mine again.\u003c/p\u003e\n\u003cp\u003eI don\u0027t remember lying down, but we\u0027re lying down.\u003c/p\u003e\n\u003cp\u003eHis hand slides up my shirt. He hesitates and I like the way his fingers dance around my skin, unsure, before his hands are all over me and mine are all over him and I half-expect to check out, but I\u0027m really there for it. It\u0027s not like at the dance, angry and forced. It\u0027s terrible in its gentleness and he\u0027s just wasting it on me.\u003c/p\u003e\n\u003cp\u003eTWENTY-ONE\u003c/p\u003e\n\u003cp\u003e\"Leaving?\"\u003c/p\u003e\n\u003cp\u003eJake sounds disappointed and I don\u0027t turn around because I don\u0027t want to see it on his face. I finish off my glass of orange juice and set it in the sink.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t skip,\" I say. \"The school will call my parents, my parents will find out I lied about where I was, there will be a freakout of epic proportions from both parties and I won\u0027t be able to graduate. You know how it is.\"\u003c/p\u003e\n\u003cp\u003e\"You could\u0027ve woken me up,\" he says. \"I don\u0027t have time to catch the bus now.\"\u003c/p\u003e\n\u003cp\u003e\"You should enjoy your day off,\" I say. \"You planned it.\"\u003c/p\u003e\n\u003cp\u003eI finally turn around. Jake stands there, rumpled and sleepy eyed, hair sticking up at all sides. He smiles at me, crosses the room and gives me a kiss on the cheek and then the mouth. I count until it\u0027s over. It doesn\u0027t last very long. I mean, I\u0027m not moving my lips or anything, so Jake can tell something\u0027s wrong.\u003c/p\u003e\n\u003cp\u003e\"What?\" he asks, pulling away.\u003c/p\u003e\n\u003cp\u003e\"Nothing.\"\u003c/p\u003e\n\u003cp\u003eHe studies me.\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t going to end well, is it?\"\u003c/p\u003e\n\u003cp\u003e\"Well, now that you mention it...\"\u003c/p\u003e\n\u003cp\u003eBut I can\u0027t think of what else to say. I want to be biting about this, but it\u0027s harder once you\u0027ve had sex with a person. Twice.\u003c/p\u003e\n\u003cp\u003e\"Just say it,\" he says.\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t change anything,\" I tell him. \"What we did.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, it does.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, it does. But not the way you want it to.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, come on, Parker,\" he scoffs.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want a...\" I struggle with the words. \"I don\u0027t want to be with you.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because. I don\u0027t want be with you,\" I repeat slowly, making sure to look him in the eyes. \"Especially not now that I\u0027ve been with you.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s the best I can do. He swallows. He\u0027s probably not taking it the way I mean it, and the way I mean it is that last night, after the first time we did it and I let him hold me, I knew I could ruin him. And I know I\u0027m ruining him now, but it\u0027s different.\u003c/p\u003e\n\u003cp\u003eIt\u0027s less.\u003c/p\u003e\n\u003cp\u003e\"Is that it?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, that\u0027s it.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll miss the bus,\" he says.\u003c/p\u003e\n\u003cp\u003eHe pads out of the room and I feel empty and kind of surprised that for once in my life things would go the way I want them to. Because this is what I want, isn\u0027t it.\u003c/p\u003e\n\u003cp\u003eOn my walk to the bus stop, I pass a dog stretched out on a lawn. It stares at me sort of accusingly.\u003c/p\u003e\n\u003cp\u003eIt looks exactly like Bailey.\u003c/p\u003e\n\u003cp\u003eTWENTY-TWO\u003c/p\u003e\n\u003cp\u003eI\u0027m avoiding Jake and Chris, and Mom and Dad have decided to send me to a real live shrink. Like, they\u0027ve set up an appointment and everything, even though I still do my homework and I haven\u0027t missed one goddamn day of school. I can\u0027t figure it out. It\u0027s not like I binged on crystal meth, went crazy and shaved my head.\u003c/p\u003e\n\u003cp\u003eI cut my hair and our dog died.\u003c/p\u003e\n\u003cp\u003eSo I trail Evan through the halls because I want to know how he does it. I\u0027m not fooled for a second, not even with the haircut. The guy\u0027s practically dying in plain sight and everyone leaves him alone. I want that.\u003c/p\u003e\n\u003cp\u003eIt takes three days for him to realize he\u0027s being shadowed. It all comes to a spectacular end when he makes a rough left turn and a sudden stop in the middle of the hall and I crash into him and my history books scatter all over the floor. The jig is up.\u003c/p\u003e\n\u003cp\u003e\"Why are you following me?\" he asks, bending down to retrieve my books. I rip them out of his hands. \"Why have you been following me?\"\u003c/p\u003e\n\u003cp\u003e\"I--\"\u003c/p\u003e\n\u003cp\u003eWish I had liquid courage. My heart thuds in my chest and I can\u0027t even do that neat thing where I make myself get angry instead of anxious.\u003c/p\u003e\n\u003cp\u003eHe stares at me, wary and expectant.\u003c/p\u003e\n\u003cp\u003e\"Why are you back?\" I finally manage.\u003c/p\u003e\n\u003cp\u003e\"Why do you care?\"\u003c/p\u003e\n\u003cp\u003eThe only thing I can think to do is shake my head at him, and he\u0027s not interested in letting me waste his time, so he turns and goes the other way and I\u0027ve got more pride than to chase after him, so I head back the way I came and crash right into someone--second time today my history books go flying.\u003c/p\u003e\n\u003cp\u003e\"Jesus.\"\u003c/p\u003e\n\u003cp\u003eNot Jesus. Jake. He bends down and grabs my books.\u003c/p\u003e\n\u003cp\u003e\"Great, thanks,\" I mutter, avoiding his eyes. Figures now all that anxiety would turn straight to rage. \"What were you doing, following me? Were you just waiting for the opportunity to--\"\u003c/p\u003e\n\u003cp\u003eHe holds out my books without a word.\u003c/p\u003e\n\u003cp\u003eI grab them, but he doesn\u0027t let go. \u003c/p\u003e","sourceLink":"https://allnovel.net/cracked-up-to-be/page-29.html","bookId":1897,"creation":"Oct 5, 2019 5:10:51 PM","modification":"Oct 5, 2019 5:10:51 PM"}
