{"id":103094,"no":19,"title":"Page 19","content":"\u003cp\u003eXVIII\u003c/p\u003e\n\u003cp\u003eMY DEAR WORMWOOD,\u003c/p\u003e\n\u003cp\u003eEven under Slubgob you must have learned at college the routine technique of sexual temptation, and since, for us spirits, this whole subject is one of considerable tedium (though necessary as part of our training) I will pass it over. But on the larger issues involved I think you have a good deal to learn.\u003c/p\u003e\n\u003cp\u003eThe Enemy\u0027s demand on humans takes the form of a dilemma; either complete abstinence or unmitigated monogamy. Ever since our Father\u0027s first great victory, we have rendered the former very difficult to them. The latter, for the last few centuries, we have been closing as a way of escape. We have done this through the poets and novelists by persuading he humans that a curious, and usually short-lived, experience which they call \"being in love\" is the only respectable ground for marriage; that marriage can, and ought to, render this excitement permanent; and that a marriage which does not do so is no longer binding. This idea is our parody of an idea that came from the Enemy.\u003c/p\u003e\n\u003cp\u003eThe whole philosophy of Hell rests on recognition of the axiom that one thing is not another thing, and, specially, that one self is not another self. My good is my good and your good is yours. What one gains another loses. Even an inanimate object is what it is by excluding all other objects from the space it occupies; if it expands, it does so by thrusting other objects aside or by absorbing them. A self does the same. With beasts the absorption takes the form of eating; for us, it means the sucking of will and freedom out of a weaker self into a stronger. \"To be\" means \"to be in competition\".\u003c/p\u003e\n\u003cp\u003eNow the Enemy\u0027s philosophy is nothing more nor less than one continued attempt to evade this very obvious truth. He aims at a contradiction. Things are to be many, yet somehow also one. The good of one self is to be the good of another. This impossibility He calls love, and this same monotonous panacea can be detected under all He does and even all He is - or claims to be. Thus He is not content, even Himself, to be a sheer arithmetical unity; He claims to be three as well as one, in order that this nonsense about Love may find a foothold in His own nature. At the other end of the scale, He introduces into matter that obscene invention the organism, in which the parts are perverted from their natural destiny of competition and made to co-operate.\u003c/p\u003e\n\u003cp\u003eHis real motive for fixing on sex as the method of reproduction among humans is only too apparent from the use He has made of it. Sex might have been, from our point of view, quite innocent. It might have been merely one more mode in which a stronger self preyed upon a weaker - as it is, indeed, among the spiders where the bride concludes her nuptials by eating her groom. But in the humans the Enemy has gratuitously associated affection between the parties with sexual desire. He has also made the offspring dependent on the parents and given the parents an impulse to support it - thus producing the Family, which is like the organism, only worse; for the members are more distinct, yet also united in a more conscious and responsible way. The whole thing, in fact, turns out to be simply one more device for dragging in Love.\u003c/p\u003e\n\u003cp\u003eNow comes the joke. The Enemy described a married couple as \"one flesh\". He did not lay \"a happily married couple\" or \"a couple who married because they were in love\", but you can make the humans ignore that. You can also make them forget that the man they call Paul did not confine it to married couples. Mere copulation, for him, makes \"one flesh\". You can thus get the humans to accept as rhetorical eulogies of \"being in love\" what were in fact plain descriptions of the real significance of sexual intercourse. The truth is that wherever a man lies with a woman, there, whether they like it or not, a transcendental relation is set up between them which must be eternally enjoyed or eternally endured. From the true statement that this transcendental relation was intended to produce, and, if obediently entered into, too often will produce, affection and the family, humans can be made to infer the false belief that the blend of affection, fear, and desire which they call \"being in love\" is the only thing that makes marriage either happy or holy. The error is easy to produce because \"being in love\" does very often, in Western Europe, precede marriages which are made in obedience to the Enemy\u0027s designs, that is, with the intention of fidelity, fertility and good will; just as religious emotion very often, but not always, attends conversion. In other words, the humans are to be encouraged to regard as the basis for marriage a highly-coloured and distorted version of something the Enemy really promises as its result. Two advantages follow. In the first place, humans who have not the gift of continence can be deterred from seeking marriage as a solution because they do not find themselves \"in love\", and, thanks to us, the idea of marrying with any other motive seems to them low and cynical. Yes, they think that. They regard the intention of loyalty to a partnership for mutual help, for the preservation of chastity, and for the transmission of life, as something lower than a storm of emotion. (Don\u0027t neglect to make your man think the marriage-service very offensive.) In the second place any sexual infatuation whatever, so long as it intends marriage, will be regarded as \"love\", and \"love\" will be held to excuse a man from all the guilt, and to protect him from all the consequences, if marrying a heathen, a fool, or a wanton. But more of this in my next,\u003c/p\u003e\n\u003cp\u003eYour affectionate uncle\u003c/p\u003e\n\u003cp\u003eSCREWTAPE \u003c/p\u003e","sourceLink":"https://allnovel.net/the-screwtape-letters/page-19.html","bookId":2637,"creation":"Oct 5, 2019 10:21:06 PM","modification":"Oct 5, 2019 10:21:06 PM"}
