{"id":103082,"no":6,"title":"Page 6","content":"\u003cp\u003eV\u003c/p\u003e\n\u003cp\u003eMY DEAR WORMWOOD,\u003c/p\u003e\n\u003cp\u003eIt is a little bit disappointing to expect a detailed report on your work and to receive instead such a vague rhapsody as your last letter. You say you are \"delirious with joy\" because the European humans have started another of their wars. I see very well what has happened to you. You are not delirious; you are only drunk. Reading between the lines in your very unbalanced account of the patient\u0027s sleepless night, I can reconstruct your state of mind fairly accurately. For the first time in your career you have tasted that wine which is the reward of all our labours - the anguish and bewilderment of a human soul - and it has gone to your head. I can hardly blame you. I do not expect old heads on young shoulders. Did the patient respond to some of your terror-pictures of the future? Did you work in some good self-pitying glances at the happy past? - some fine thrills in the pit of his stomach, were there? You played your violin prettily did you? Well, well, it\u0027s all very natural. But do remember, Wormwood, that duty comes before pleasure. If any present\u003c/p\u003e\n\u003cp\u003eself-indulgence on your part leads to the ultimate loss of the prey, you will be left eternally thirsting for that draught of which you are now so much enjoying your first sip. If, on the other hand, by steady and cool-headed application here and now you can finally secure his soul, he will then be yours forever - a brim-full living chalice of despair and horror and astonishment which you can raise to your lips as often as you please. So do not allow any temporary excitement to distract you from the real business of undermining faith and preventing the formation of virtues. Give me without fail in your next letter a full account of the patient\u0027s reactions to the war, so that we can consider whether you are likely to do more good by making him an extreme patriot or an ardent pacifist. There are all sorts of possibilities. In the meantime, I must warn you not to hope too much from a war.\u003c/p\u003e\n\u003cp\u003eOf course a war is entertaining. The immediate fear and suffering of the humans is a legitimate and pleasing refreshment for our myriads of toiling workers. But what permanent good does it do us unless we make use of it for bringing souls to Our Father Below? When I see the temporal suffering of humans who finally escape us, I feel as if I had been allowed to taste the first course of a rich banquet and then denied the rest. It is worse than not to have tasted it at all. The Enemy, true to His barbarous methods of warfare, allows us to see the short misery of His favourites only to tantalise and torment us - to mock the incessant hunger which, during this present phase of the great conflict, His blockade is admittedly imposing. Let us therefore think rather how to use, than how to enjoy, this European war. For it has certain tendencies inherent in it which are, in themselves, by no means in our favour. We may hope for a good deal of cruelty and unchastity. But, if we are not careful, we shall see thousands turning in this tribulation to the Enemy, while tens of thousands who do not go so far as that will nevertheless have their attention diverted from themselves to values and causes which they believe to be higher than the self. I know that the Enemy disapproves many of these causes. But that is where He is so unfair. He often makes prizes of humans who have given their lives for causes He thinks bad on the monstrously sophistical ground that the humans thought them good and were following the best they knew. Consider too what undesirable deaths occur in wartime. Men are killed in places where they knew they might be killed and to which they go, if they are at all of the Enemy\u0027s party, prepared. How much better for us if all humans died in costly nursing homes amid doctors who lie, nurses who lie, friends who lie, as we have trained them, promising life to the dying, encouraging the belief that sickness excuses every indulgence, and even, if our workers know their job, withholding all suggestion of a priest lest it should betray to the sick man his true condition! And how disastrous for us is the continual remembrance of death which war enforces. One of our best weapons, contented worldliness, is rendered useless. In wartime not even a human can believe that he is going to live forever.\u003c/p\u003e\n\u003cp\u003eI know that Scabtree and others have seen in wars a great opportunity for attacks on faith, but I think that view was exaggerated. The Enemy\u0027s human partisans have all been plainly told by Him that suffering is an essential part of what He calls Redemption; so that a faith which is destroyed by a war or a pestilence cannot really have been worth the trouble of destroying. I am speaking now of diffused suffering over a long period such as the war will produce. Of course, at the precise moment of terror, bereavement, or physical pain, you may catch your man when his reason is temporarily suspended. But even then, if he applies to Enemy headquarters, I have found that the post is nearly always defended,\u003c/p\u003e\n\u003cp\u003eYour affectionate uncle\u003c/p\u003e\n\u003cp\u003eSCREWTAPE \u003c/p\u003e","sourceLink":"https://allnovel.net/the-screwtape-letters/page-6.html","bookId":2637,"creation":"Oct 5, 2019 10:21:06 PM","modification":"Oct 5, 2019 10:21:06 PM"}
