{"id":69045,"no":1,"title":"Page 1","content":"\u003cp\u003eTo all the editors, whose careers\u003c/p\u003e\n\u003cp\u003eat one time or another,\u003c/p\u003e\n\u003cp\u003ehave intersected my own -\u003c/p\u003e\n\u003cp\u003egood fellows, every one.\u003c/p\u003e\n\u003cp\u003eIn THE EARLY ASIMOV I mentioned the fact that there were eleven stories that I had never succeeded in selling.What\u0027s more, said I in that book, all eleven stories nolonger existed and must remain forever in limbo.\u003c/p\u003e\n\u003cp\u003eHowever, Boston University collects all my papers with an assiduity and determination worthy of a far better cause, and when they first began to do so back in 1966, I handed them piles and piles of manuscript material I didn\u0027t look through.\u003c/p\u003e\n\u003cp\u003eSome eager young fan did, though. Boston University apparently allows the inspection of its literary collections for research purposes, and this young fan, representing himself as a literary historian, I suppose, got access to my files. He came across the faded manuscript of Big Game, a thousand-word short-short which I had listed inTHE EARLY ASIMOVas the eleventh and last of my lost rejections.\u003c/p\u003e\n\u003cp\u003eHaving read THE EARLY ASIMOV, the fan recognized the value of the find. He promptly had it reproduced and sent me a copy. And I promptly saw to it that it got into print. It appeared in BEFORE THE GOLDEN AGE.\u003c/p\u003e\n\u003cp\u003eWhen I read the manuscript of Big Game, however, I discovered that, in a way, it bad never been lost. I had salvaged it. Back in early 1950, Robert W. Lowndes, then publishing several science fiction magazines for Columbia Publications, and reveling in the science fiction boom of the period, asked me for a story. I must have remembered Big Game, written eight years earlier, for I produced DAY OF THE HUNTERS,which was an expanded version of the earlier story, and Had published it in the November 1950 issue of Future Combined with Science Fiction Stories.\u003c/p\u003e","sourceLink":"https://allnovel.net/buy-jupiter-and-other-stories/page-1.html","bookId":1732,"creation":"Oct 5, 2019 10:12:21 AM","modification":"Oct 5, 2019 10:12:21 AM"}
