{"id":67092,"no":10,"title":"Page 10","content":"\u003cp\u003e\"True.\" Roy was well aware of that, but Samuels\u0027s military record was impeccable. And he lived on the East Coast. His whereabouts were accounted for during the time around Maxwell Russell\u0027s death. To be on the safe side, Roy had checked into the weeks shortly after Dan Sherman\u0027s disappearance, but Samuels had been in Europe, on a NATO assignment.\u003c/p\u003e\n\u003cp\u003eCorrie poured a second mug of coffee, black, and sat in the chair across from Roy\u0027s desk. \"Linnette phoned this morning.\" Their twenty-five-year-old daughter had recently graduated as a physician\u0027s assistant.\u003c/p\u003e\n\u003cp\u003eRoy brightened. He adored Linnette and felt close to her. She was bright, beautiful and a source of pride. Her brother was another story. Roy and Mack were frequently at odds.\u003c/p\u003e\n\u003cp\u003eLinnette had done well in school and Mack, to put it bluntly, hadn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s applying for a job in Montana, of all places.\"\u003c/p\u003e\n\u003cp\u003eWith the majority of physicians choosing to work in big cities, many small towns were left without medical professionals. Although she\u0027d grown up in Seattle, Linnette had always been drawn to rural areas, so Roy wasn\u0027t surprised by her decision. She\u0027d be filling a critical need and living in the sort of place she liked.\u003c/p\u003e\n\u003cp\u003e\"Did you hear me, Roy? Montana?\"\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t sure what had upset Corrie so much. When Linnette had entered the medical program, they\u0027d both known she wouldn\u0027t settle down in Seattle.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want her moving two states away!\"\u003c/p\u003e\n\u003cp\u003e\"Corrie—\"\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t allowed to finish.\u003c/p\u003e\n\u003cp\u003e\"Linnette doesn\u0027t know a soul in Montana. There\u0027s plenty of small towns in WashingtonState that need physician\u0027s assistants.\"\u003c/p\u003e\n\u003cp\u003eRoy made an effort to hold back his amusement. \"It\u0027s time to cut the apron strings, Mother.\"\u003c/p\u003e\n\u003cp\u003eEvidently not a successful effort. Corrie cast him an exasperated look. \"This is our daughter we\u0027re talking about.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, dear.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t use that tone of voice with me, Roy McAfee.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, dear.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not funny. You know that, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eRoy resisted answering, although it was a struggle. \"Where would you be comfortable having Linnette find a job?\"\u003c/p\u003e\n\u003cp\u003eCorrie bit her bottom lip and didn\u0027t answer him.\u003c/p\u003e\n\u003cp\u003e\"I have the feeling you\u0027d like her to move right here to Cedar Cove,\" he joked.\u003c/p\u003e\n\u003cp\u003eAt that his wife\u0027s head snapped up and her eyes widened. She set down her coffee, then leapt out of her chair, raced around the desk and kissed him soundly.\u003c/p\u003e\n\u003cp\u003e\"What was that all about?\" Roy asked, pleasantly surprised.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s because you, my wonderful husband, are much smarter than I give you credit for.\"\u003c/p\u003e\n\u003cp\u003eBewildered, Roy watched her fly out of his office.\u003c/p\u003e\n\u003cp\u003eTen\u003c/p\u003e\n\u003cp\u003eGrace thrust her hands decisively into her garden gloves, ready to head out to the back garden to plant Martha Washington geraniums. It wasn\u0027t the way she wanted to spend Friday evening, but she refused to mope around the house. Buttercup waited for her at the kitchen door, tail wagging.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll plant these now and see what we can find at the Farmers\u0027 Market tomorrow morning. That sounds like a plan, doesn\u0027t it?\" The fact that Grace had begun to carry on whole conversations with her golden retriever had to be a sign of how lonely she was.\u003c/p\u003e\n\u003cp\u003eThe Farmers\u0027 Market had started the first Saturday of May, and although there were only a few homegrown vegetables available this early in the season, Grace enjoyed going there each week. She almost always ran into a few friends. One or both of her daughters was likely to show up, as well.\u003c/p\u003e\n\u003cp\u003eThe phone rang, startling Grace. She pulled off her right-hand glove and reached for the wall-mounted receiver.\u003c/p\u003e\n\u003cp\u003e\"Hello.\" She forced a cheerful note into her voice, hoping with all her heart that it was Cliff. He\u0027d weighed heavily on her mind since their chance encounter at the restaurant earlier in the week. Her hope was that he\u0027d been thinking about her, too.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Stanley Lockhart, Grace. How are you?\"\u003c/p\u003e\n\u003cp\u003eGrace felt an immediate stab of disappointment. \"Hello, Stan.\" She kept her voice cool, not wanting to encourage Olivia\u0027s ex-husband. \"I\u0027m fine.\"\u003c/p\u003e\n\u003cp\u003e\"Me, too. Listen, would you like to go to dinner tonight?\"\u003c/p\u003e\n\u003cp\u003eShe glanced over at the can of clam chowder that was slated to be her evening meal. Still, she preferred to eat soup alone over a three-course meal with Stan Lockhart.\u003c/p\u003e\n\u003cp\u003e\"Sorry, I already have plans.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t change them?\" He didn\u0027t bother to hide his displeasure.\u003c/p\u003e\n\u003cp\u003e\"No.\" How like Stan to expect her to alter her evening because he needed a dinner companion.\u003c/p\u003e\n\u003cp\u003e\"What if 1 stop by later?\" His enthusiasm was back. \"It\u0027s important.\"\u003c/p\u003e\n\u003cp\u003e\"That won\u0027t work, either.\" She couldn\u0027t imagine what he had to tell her that was so urgent. Grace sincerely hoped he got the message, but the subtle approach wasn\u0027t always successful with Stan. Inbred politeness prevented her from being rude and telling him outright that she wanted to avoid him.\u003c/p\u003e\n\u003cp\u003eThe line went quiet as he contemplated her refusal. \"I see,\" he said, sounding depressed. \"Gracie, listen, I hate to be a pest but I\u0027d like to talk to you if we can manage it.\"\u003c/p\u003e\n\u003cp\u003eGracie. From the time she was in grade school, Grace had detested that nickname. She gritted her teeth. Stan hadn\u0027t been in touch since that one dinner. Now this. She couldn\u0027t even guess what he wanted.\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you tell me what you need to see me about?\"\u003c/p\u003e\n\u003cp\u003eHe hesitated. \"It\u0027s better if I do it in person. Is there anyplace we can meet? Drinks? Coffee? You say when and where, and I\u0027ll be there.\" His tone took on a pleading quality. Grace knew that Stan\u0027s second marriage had recently failed; he still seemed to be shaken. She sympathized, but she didn\u0027t want to get involved with him.\u003c/p\u003e\n\u003cp\u003e\"It won\u0027t take much of your time, I promise.\"\u003c/p\u003e\n\u003cp\u003eShe hesitated, fearing that he\u0027d hound her until she gave in. \"I plan to be at the Farmers\u0027 Market in the morning.\"\u003c/p\u003e\n\u003cp\u003e\"Perfect.\" He leaped on the suggestion. \"I\u0027ll see you there. What time?\"\u003c/p\u003e\n\u003cp\u003e\"It opens at nine.\"\u003c/p\u003e\n\u003cp\u003e\"Make it later. Nine\u0027s a little early for me.\"\u003c/p\u003e\n\u003cp\u003eSo now he expected her to change her Saturday schedule to suit his? What sympathy she felt for him quickly evaporated. \"I\u0027ll be there at nine, Stan. If I see you then, that\u0027ll be fine and if I don\u0027t, I don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"All right, all right. I\u0027ll get there as close to nine as I can. Just remember I\u0027m coming over from Seattle.\"\u003c/p\u003e\n\u003cp\u003eShe\u0027d forgotten that, but decided it didn\u0027t matter; he was the one who considered it so important that they meet.\u003c/p\u003e\n\u003cp\u003eSaturday morning, Grace loaded Buttercup into her car and drove to the Farmers\u0027 Market. Buttercup was a well-behaved dog who loved being around people. The animal shelter had set up an adoption center in the market. Every Saturday the shelter brought down homeless cats and kittens; once a month, Grace took her turn running their booth, which was popular with children and adults alike.\u003c/p\u003e\n\u003cp\u003eButtercup strained against her leash in a hurry to view the kittens, and Grace sharply commanded her to heel. She\u0027d been thinking about adopting a cat herself, since she felt bad about leaving Buttercup alone all day and a cat would be company for her.\u003c/p\u003e\n\u003cp\u003e\"Mom.\"\u003c/p\u003e\n\u003cp\u003eGrace turned to find Maryellen pushing Katie in her stroller. \"I wondered if I\u0027d see you here.\" The back section of the stroller was already full.\u003c/p\u003e\n\u003cp\u003eGrace bent down and kissed Katie, who gurgled and waved her arms. Maryellen positively glowed with happiness, and Grace was delighted. Maryellen was more confident and relaxed, more carefree somehow, than she\u0027d ever been. And—equally important—Katie would have the benefit of growing up with two parents.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re out and about early,\" she said conversationally.\u003c/p\u003e\n\u003cp\u003e\"Jon\u0027s working and won\u0027t be home until late afternoon.\"\u003c/p\u003e\n\u003cp\u003eThat meant her son-in-law was somewhere in western Washington photographing trees or birds. Or something.\u003c/p\u003e\n\u003cp\u003e\"I love married life,\" Maryellen burst out. \"Oh, Mom, how could I have been so foolish? Jon is a wonderful husband and father.\"\u003c/p\u003e\n\u003cp\u003e\"Honey, I\u0027m thrilled for you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d better get back to the house. I bought three pounds of fresh clams and I need to get them into the refrigerator.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t think you liked clams.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t, but Jon does.\"\u003c/p\u003e\n\u003cp\u003eIt seemed to Grace that if Jon indulged Maryellen, as she often claimed, her daughter catered to Jon just as much.\u003c/p\u003e\n\u003cp\u003eGrace bought a pound of clams herself and ajar of marmalade from Carol, the lady who sold homemade jelly. She glanced around and didn\u0027t see Stan and figured that was for the best. After strolling down the other aisles, she made her way toward the parking lot.\u003c/p\u003e\n\u003cp\u003e\"Grace,\" Stan called, waving vigorously. He stood on the marina walkway. \"Over here.\"\u003c/p\u003e\n\u003cp\u003eWith Buttercup trotting beside her, Grace walked to the marina area.\u003c/p\u003e\n\u003cp\u003e\"Seth suggested I sleep in his boat,\" Stan explained. He looked like he was ready for a tennis date, wearing white shorts and a white cable-knit sweater with a red-and-blue border.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s it going?\" he asked, striking a relaxed pose, studying her as if he wasn\u0027t quite sure where to start.\u003c/p\u003e\n\u003cp\u003e\"Good.\" She didn\u0027t elaborate, preferring to skip the small talk. \"What can I do for you?\"\u003c/p\u003e\n\u003cp\u003eHis smile was strained. \"You know, since Marge and I split and Olivia married that newsman, I\u0027ve been at loose ends.\"\u003c/p\u003e\n\u003cp\u003eGrace didn\u0027t like the sound of this. She wondered if he was leading up to asking her out again, and if that was the case, she simply wasn\u0027t interested. She had to tell him before he went any further.\u003c/p\u003e\n\u003cp\u003e\"Stan, I realize you must be lonely—\"\u003c/p\u003e\n\u003cp\u003e\"Lonely,\" he repeated and shook his head, a puzzled expression on his face. \"No, no, it isn\u0027t that. I heard about the Dog and Bachelor Auction.\"\u003c/p\u003e\n\u003cp\u003eIt took Grace a moment to put two and two together—and then she upbraided herself for being so dense.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to volunteer to be one of the bachelors,\" Stan said eagerly.\u003c/p\u003e\n\u003cp\u003eShe should\u0027ve known. Stan had always enjoyed being the center of attention. The idea of women bidding on him... That would be the ultimate. In all fairness, he\u0027d do a good job as someone\u0027s date for an evening, provided whoever won him knew what to expect.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s for charity, right?\"\u003c/p\u003e\n\u003cp\u003e\"To raise funds for the animal shelter,\" she told him.\u003c/p\u003e\n\u003cp\u003e\"Well, you know how I feel about animals.\" He nodded sagely and she nodded, too, although she\u0027d never noticed any particular liking for animals. \"I\u0027m willing to do my part,\" he went on, \"and since I\u0027m available, well, why not?\" He cast her a practiced smile. \"I imagine I could bring in a few dollars for a worthy cause.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t live in Cedar Cove, remember?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right, but I did at one time and people here know me. Really, volunteering is the least I can do to help out, and 1 understand you\u0027re the person to talk to.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, two other women are gathering bachelors\u0027 names, but I\u0027d be happy to suggest yours.\u003c/p\u003e\n\u003cp\u003eStan grinned. \"Thanks.\" Gratitude radiated from him. \"I knew I could count on you.\"\u003c/p\u003e\n\u003cp\u003eButtercup wagged her tail and looked up, anticipating Stan\u0027s attention. However the animal lover didn\u0027t so much as glance in the dog\u0027s direction.\u003c/p\u003e\n\u003cp\u003e\"Have you already been to the market?\" Stan asked.\u003c/p\u003e\n\u003cp\u003eThe bags in her hands should be evidence that she had.\u003c/p\u003e\n\u003cp\u003e\"How about if I buy you a cup of coffee and you can fill me in on the details about the auction? Maybe you could help me come up with a strategy.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-10.html","bookId":1944,"creation":"Oct 5, 2019 10:03:49 AM","modification":"Oct 5, 2019 10:03:49 AM"}
