{"id":67096,"no":14,"title":"Page 14","content":"\u003cp\u003eHer husband stared at her long and hard. Seconds later the book fell out of his hands and toppled onto the carpet. He didn\u0027t bother to pick it up. \"Cecilia?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"What exactly are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"What do you think?\"\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t amusing.\" He sat up straighter, sliding as far against the headboard as possible, as if he wanted to escape her. Yet at the same time, his gaze didn\u0027t waver from hers. His eyes seemed twice their normal size and that encouraged her.\u003c/p\u003e\n\u003cp\u003eTaking two steps toward her husband, she slowly removed the sheer black dressing gown. It took her a bit of time and she loved the way her husband swallowed convulsively as he watched.\u003c/p\u003e\n\u003cp\u003e\"You like it?\" She kept her voice low and sexy.\u003c/p\u003e\n\u003cp\u003eIan didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003e\"I think you do,\" she purred seductively, unfastening the bra-style top—which revealed more than it concealed.\u003c/p\u003e\n\u003cp\u003eIan groaned and closed his eyes. Knowing she was about to succeed she leaned over him and turned off the light. The instant she was close, he reached for her and pulled her down onto the bed.\u003c/p\u003e\n\u003cp\u003eCecilia slipped her arms around his neck and their mouths joined in an urgent kiss. They were twisting against each other, unable to give enough or take enough. It was as though Ian had held back every bit of passion he felt for her until that moment. Their kisses grew even wilder, even fiercer. Cecilia relished his passion, which fed her own.\u003c/p\u003e\n\u003cp\u003eMoaning, she showed him in every way she knew how that she loved him and needed him and had desperately missed his touch. Ian lowered himself onto her and after the necessary adjustments to his clothing, entered her quickly. Cecilia was ready, more than ready. At their joining, they both cried out at the pure sensation, the overwhelming pleasure.\u003c/p\u003e\n\u003cp\u003eThey fell asleep in each other\u0027s arms, sated and content. Once in the night, Ian woke her again and she turned willingly into his embrace. His need was as intense as it had been earlier. With their fingers locked together, he kissed Cecilia, then held her arms above her head as he sank into her. She whimpered at the beauty of their lovemaking, exulted in her husband and cried out when she reached her own fulfillment.\u003c/p\u003e\n\u003cp\u003eIn the morning it was a different story. Cecilia woke to find Ian sitting on the edge of the bed with his back to her. \"You did that on purpose,\" he said gruffly when he realized she was awake.\u003c/p\u003e\n\u003cp\u003eCecilia sat up, clutching the sheet to her bare breasts. \"Yes.\" She wasn\u0027t going to lie to him.\u003c/p\u003e\n\u003cp\u003e\"You seduced me.\"\u003c/p\u003e\n\u003cp\u003e\"If you want to look at it like that. I wanted my husband to make love to me.\" She leaned over and caressed his back with her fingertips. \"I\u0027ve missed you, Ian.\"\u003c/p\u003e\n\u003cp\u003eHe stood rather than endure her touch. \"You want a baby and because I don\u0027t, you took matters into your own hands.\"\u003c/p\u003e\n\u003cp\u003eOn that point he was wrong. \"I didn\u0027t stop you from using protection, Ian.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t remind me, either.\"\u003c/p\u003e\n\u003cp\u003e\"Is that my job or yours?\" she asked, keeping her voice as level as she could make it.\u003c/p\u003e\n\u003cp\u003eHer husband whirled around and glared at her. \"You made sure I forgot all about it!\"\u003c/p\u003e\n\u003cp\u003eDespite the seriousness of their conversation, Cecilia smiled. \"You\u0027re right, I didn\u0027t remind you. But at the time I had other things on my mind.\"\u003c/p\u003e\n\u003cp\u003e\"A baby,\" he said angrily, accusing her with his eyes.\u003c/p\u003e\n\u003cp\u003e\"Well, yes,\" she admitted. \"But you know that.\"\u003c/p\u003e\n\u003cp\u003eIan\u0027s eyes narrowed. \"I just hope to God you don\u0027t get pregnant, Cecilia.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s n-not fair,\" she stammered, shocked by his vehemence.\u003c/p\u003e\n\u003cp\u003e\"Fair or not, I don\u0027t know how I\u0027m going to feel about any child conceived out of your deception.\"\u003c/p\u003e\n\u003cp\u003eWith that, he stormed out of the bedroom.\u003c/p\u003e\n\u003cp\u003eFourteen\u003c/p\u003e\n\u003cp\u003eRoy McAfee waited until late afternoon to call Hannah Russell. He\u0027d tried earlier and learned the young woman\u0027s phone had been disconnected. When he mentioned that to Beldon, Bob had supplied him with Hannah\u0027s cell number. Apparently, for whatever reason, she\u0027d kept in touch with the Beldons.\u003c/p\u003e\n\u003cp\u003eHe dialed, leaning back in his office chair.\u003c/p\u003e\n\u003cp\u003e\"Hello?\" a tentative voice answered.\u003c/p\u003e\n\u003cp\u003e\"Hannah?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, this is Hannah Russell.\" Her response was a bit more confident now. \"Who\u0027s this?\"\u003c/p\u003e\n\u003cp\u003e\"Roy McAfee from Cedar Cove. We met at the Beldons\u0027 Bed and Breakfast when you came to collect your father\u0027s ashes.\"\u003c/p\u003e\n\u003cp\u003eShe hesitated again as if she was having trouble placing him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, I don\u0027t recall meeting you.\"\u003c/p\u003e\n\u003cp\u003eRoy could understand her lapse in memory. It had been a traumatic visit for the young woman. He didn\u0027t envy her the task of dealing with her father\u0027s death and, more than that, the mystery surrounding it.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a private detective. I was at the house during your visit,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Oh, yes, I remember now. The Beldons hired you to find out what you could about my father\u0027s murder.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s correct.\"\u003c/p\u003e\n\u003cp\u003eRoy felt her warm up a bit. \"What can I do for you?\" she asked.\u003c/p\u003e\n\u003cp\u003eHe straightened and glanced down at his list of questions. \"Is this a convenient time to talk?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I\u0027m not doing much of anything at the moment.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"In Oregon. I suppose the Beldons told you I\u0027ve sold everything. I decided to move. The problem is, I\u0027m not sure where I\u0027m moving. I suppose that sounds odd. I loaded my car with everything that was important to me and took off. I\u0027m hoping to make a fresh start somewhere.\"\u003c/p\u003e\n\u003cp\u003e\"Bob did say something along those lines.\" Roy sympathized with the girl\u0027s need to escape the horrors of the past year or two. Briefly he wondered about friends and acquaintances but didn\u0027t want to distract her with personal questions when there were other, more pressing ones.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to ask you about your father.\"\u003c/p\u003e\n\u003cp\u003eA short silence followed. \"All right. I\u0027m not sure what I can tell you, though.\"\u003c/p\u003e\n\u003cp\u003e\"You can help me verify some facts.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll try, but I\u0027m as much in the dark about this as everyone else. I didn\u0027t even know he was going to Cedar Cove, let alone why. Then when he died like that...\" She choked up for a moment. \"That was a shock but learning he was murdered—that was so much worse. I don\u0027t know anyone who\u0027d want my father dead.\"\u003c/p\u003e\n\u003cp\u003e\"I appreciate your willingness to help. I promise I\u0027ll do everything in my power to find out who did this.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" she said, her voice quavering with emotion.\u003c/p\u003e\n\u003cp\u003eWhile doing investigative work, Roy had discovered that family members often held crucial answers but were unaware of it. The key to solving a mystery was asking the right questions.\u003c/p\u003e\n\u003cp\u003e\"What would you like to know?\" Hannah murmured, recovering quickly.\u003c/p\u003e\n\u003cp\u003e\"First, tell me about your father\u0027s relationship with Stewart Samuels.\"\u003c/p\u003e\n\u003cp\u003eAgain there was a pause, as though she required time to formulate her thoughts. \"Really, there\u0027s not much to tell. I never heard my father mention his name until after the car accident. Dad was badly burned and was in the hospital for quite a while. His medical insurance was limited. When it became obvious that he was going to require extensive plastic surgery, he asked me to get in touch with Colonel Samuels. Dad said Colonel Samuels owed him, but he didn\u0027t say why.\"\u003c/p\u003e\n\u003cp\u003eRoy made a notation indicating when Russell had contacted Samuels. He\u0027d assumed the two men had been in communication since Vietnam, but apparently not.\u003c/p\u003e\n\u003cp\u003e\"What were you supposed to ask the colonel?\"\u003c/p\u003e\n\u003cp\u003e\"Dad seemed to think Colonel Samuels would be able to help him get into a veterans\u0027 hospital. Which he did.\"\u003c/p\u003e\n\u003cp\u003e\"How responsive was Colonel Samuels to your call?\"\u003c/p\u003e\n\u003cp\u003e\"He was... helpful.\" It seemed she was about to add something, but changed her mind. He\u0027d question her later about her impression of Samuels; he had more important matters to discuss first.\u003c/p\u003e\n\u003cp\u003e\"Was there anyone else your father asked you to contact?\"\u003c/p\u003e\n\u003cp\u003e\"No one. My father was a private person. I don\u0027t think he would\u0027ve gone to Colonel Samuels if there\u0027d been any other way.\"\u003c/p\u003e\n\u003cp\u003e\"Did your father ever explain why he felt Colonel Samuels owed him?\"\u003c/p\u003e\n\u003cp\u003e\"No. He never said.\"\u003c/p\u003e\n\u003cp\u003eRoy made another note.\u003c/p\u003e\n\u003cp\u003e\"Did you ever personally meet Samuels?\" Roy asked.\u003c/p\u003e\n\u003cp\u003e\"No, but I spoke to him by telephone a number of times. He was able to get my father into the local veterans\u0027 hospital. The sad part is that it was all for nothing....\" She let the rest fade.\u003c/p\u003e\n\u003cp\u003eRoy was afraid she was about to dissolve into tears, but she managed to keep her composure.\u003c/p\u003e\n\u003cp\u003e\"The thing is...\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Roy encouraged when she paused.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think Colonel Samuels helped willingly. I probably shouldn\u0027t even be saying this, but whenever Dad talked to the colonel, he was upset afterward. I remember once the nurse had to give him a sedative. I was just grateful Dad would receive the necessary medical treatment.\"\u003c/p\u003e\n\u003cp\u003eThis was interesting. Perhaps Samuels wasn\u0027t everything Roy had been led to believe. Sheriff Davis felt that Samuels wasn\u0027t involved in the murder, and Roy had confidence in his instincts, but things weren\u0027t adding up the way they should.\u003c/p\u003e\n\u003cp\u003e\"Anything else you can remember about Samuels and your father?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Not really... They only spoke a few times, which was probably for the best, seeing the effect he had on my father. I think—no, wait.\" She stopped abruptly. \"I do remember something. It was several months after Dad was released from the hospital. Colonel Samuels phoned the house late one afternoon. Dad took the call and immediately lowered his voice. I realized he didn\u0027t want me listening in, so I made an excuse to leave the room.\" She seemed to be reviewing her memories. \"I went into the kitchen, but I could still hear part of the conversation.\"\u003c/p\u003e\n\u003cp\u003e\"What do you remember?\"\u003c/p\u003e\n\u003cp\u003e\"I found it all rather odd. I don\u0027t know if this is any help, but as I remember it, Dad said to Colonel Samuels that he\u0027d never told anyone. I\u0027m not sure what he never told, but my father was very firm about this secret being safe with him.\" She finished in a rush. \"I\u0027m just wondering if I heard him correctly,\" she murmured. \"I tried to forget it because it wasn\u0027t for my ears, if you know what I mean.\"\u003c/p\u003e\n\u003cp\u003e\"I do.\" And Roy also had a very good idea what Russell had been talking about. Apparently he hadn\u0027t discussed the incident in Vietnam with his daughter. It wasn\u0027t Roy\u0027s job to enlighten her about her father\u0027s past.\u003c/p\u003e\n\u003cp\u003e\"Describe the last time you saw your father.\"\u003c/p\u003e\n\u003cp\u003e\"Alive, you mean?\" Her voice rocked with emotion. \"This is all so strange. Dad and I talked every day, and I was sure he\u0027d tell me about any trips. He didn\u0027t go out a lot after the accident, and when he did he always wore a hat. He said he didn\u0027t want people staring at him, but really, it wasn\u0027t necessary. The surgery was extremely successful. Anyway, for Dad just to leave and not mention his plans was unusual.\u003c/p\u003e\n\u003cp\u003e\"I happened to stop by the house to check on him and was surprised to see he had a suitcase packed. I asked him where he was going, but all he said was that he\u0027d made arrangements to be away for a few days. I asked again, but...\"\u003c/p\u003e\n\u003cp\u003e\"He still wouldn\u0027t tell you?\"\u003c/p\u003e\n\u003cp\u003e\"No. Anytime I had a question he didn\u0027t want to answer, he pretended not to hear me.\"\u003c/p\u003e\n\u003cp\u003e\"Can you remember what he took with him?\"\u003c/p\u003e\n\u003cp\u003e\"I.. .I didn\u0027t see him drive off, so I don\u0027t. He had the one suitcase. That much I know. And his coat and hat, of course. Like I said, he was self-conscious about his scars.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-14.html","bookId":1944,"creation":"Oct 5, 2019 10:03:49 AM","modification":"Oct 5, 2019 10:03:49 AM"}
