{"id":67105,"no":23,"title":"Page 23","content":"\u003cp\u003eIan expelled his breath. \"I\u0027m trying. Give me a chance to adjust to it, okay?\"\u003c/p\u003e\n\u003cp\u003eHer tears moistened his shoulder.\u003c/p\u003e\n\u003cp\u003e\"Cecilia, please, don\u0027t cry.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t help it.\"\u003c/p\u003e\n\u003cp\u003eHe kissed the tears from her face. Soft kisses, gentle kisses that eventually brought his lips to her mouth. \"It\u0027ll be all right,\" he said and hoping to reassure her, kissed her again and again.\u003c/p\u003e\n\u003cp\u003e\"This is our baby,\" she whispered, and hiccupped on a sob. \"I want you to be happy.... I want you to love our baby.\"\u003c/p\u003e\n\u003cp\u003e\"I will.\" He closed his eyes and struggled with his conflicting emotions.\u003c/p\u003e\n\u003cp\u003e\"But you don\u0027t now?\"\u003c/p\u003e\n\u003cp\u003eHe dragged in a deep breath. \"I\u0027m trying. That\u0027s all I can do.\"\u003c/p\u003e\n\u003cp\u003eCecilia broke free and rolled onto her side, turning away from him.\u003c/p\u003e\n\u003cp\u003e\"Honey, please, do you want me to lie?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Then give me time.\" He cuddled her spoon fashion and slipped his arm around her middle. From pure habit, his palm cupped her breast. Many a night aboard ship, he\u0027d dreamed of doing exactly this, cuddling his wife, loving her and enjoying the feel of her body so close to his own.\u003c/p\u003e\n\u003cp\u003eA sigh shuddered through Cecilia and she shifted her little butt closer to his growing arousal. She seemed to take delight in moving seductively against him. \"Ian?\" she whispered.\u003c/p\u003e\n\u003cp\u003eHe squeezed his eyes shut and didn\u0027t respond.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a nice thing about me being pregnant.\"\u003c/p\u003e\n\u003cp\u003eHe wanted to know what it was, but at the moment the blood flow in his body wasn\u0027t headed in the direction of his brain.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to wait until I\u0027m asleep to come to bed anymore.\"\u003c/p\u003e\n\u003cp\u003eHe smiled to himself. With a soft growl, he urged her onto her back. Sighing in surrender and welcome, she slid her arms around his neck and guided his mouth to hers.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to be all right,\" she promised him. \"We really are.\"\u003c/p\u003e\n\u003cp\u003eIan so badly wanted to believe her. \"I know.\" But anything else he might have said was lost as he buried his fears in his wife\u0027s embrace.\u003c/p\u003e\n\u003cp\u003eTwenty-Four\u003c/p\u003e\n\u003cp\u003eCharlotte Jefferson couldn\u0027t stop smiling. She placed a cherry pie in the oven and set the timer, then turned to her knitting.\u003c/p\u003e\n\u003cp\u003e\"Wipe that silly grin off your face,\" she chided Harry, her black cat, who sat on the arm of the sofa and studied her with a bemused look. \"I know, I know, but this is just so wonderful I can\u0027t believe it\u0027s really happening.\"\u003c/p\u003e\n\u003cp\u003eWhen the doorbell chimed, Charlotte carefully put her knitting aside and hurried to answer it. She checked the peephole—one could never be too cautious—and saw that it was her daughter. After unbolting the locks, she opened the front door.\u003c/p\u003e\n\u003cp\u003e\"What took you so long?\" Olivia sputtered as she barreled past Charlotte. She was halfway into the kitchen before she stopped. Whirling around, she marched back into the living room and then sank abruptly onto the sofa, as though all her energy had drained away.\u003c/p\u003e\n\u003cp\u003e\"Olivia, what\u0027s gotten into you?\" Charlotte asked, concerned by her daughter\u0027s odd behavior.\u003c/p\u003e\n\u003cp\u003eOlivia bolted to her feet and almost immediately sat down again. She covered her face with both her hands. \"I think I\u0027ve made a terrible mistake.\"\u003c/p\u003e\n\u003cp\u003e\"What mistake?\"\u003c/p\u003e\n\u003cp\u003eOlivia dropped her hands and stared forlornly out the living-room window, her shoulders sagging. She looked close to tears. \"It\u0027s Jack and me.\"\u003c/p\u003e\n\u003cp\u003eCharlotte gasped. \"My goodness, you\u0027ve been married less than three months!\"\u003c/p\u003e\n\u003cp\u003e\"You think I don\u0027t know that? Lately... lately it\u0027s like we can\u0027t even talk.\"\u003c/p\u003e\n\u003cp\u003e\"You and Jack? Why? What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Mom, I feel so awful. We\u0027re just so different and we irritate one another and... and...\"\u003c/p\u003e\n\u003cp\u003e\"There, there now,\" Charlotte cooed softly. Things must be bad for her daughter to show up on her doorstep in this condition. In all the years Olivia had been married to Stan, never once had she run home after an argument or sought her parents\u0027 advice.\u003c/p\u003e\n\u003cp\u003e\"I love Jack so much.\"\u003c/p\u003e\n\u003cp\u003e\"Of course you do.\" Olivia\u0027s feelings for him were apparent months before she admitted she was in love.\u003c/p\u003e\n\u003cp\u003eOlivia\u0027s face crumpled as she struggled to hold back tears. \"I love him, but he... he\u0027s a slob. And I can\u0027t stand it.\"\u003c/p\u003e\n\u003cp\u003e\"You have to compromise, sweetie.\"\u003c/p\u003e\n\u003cp\u003e\"You think I haven\u0027t tried?\" Olivia shook her head. \"I hate myself for nagging him to pick up his dirty clothes, but really, why should I follow him around and clean up after him?\"\u003c/p\u003e\n\u003cp\u003e\"Wait here,\" Charlotte murmured. \"I\u0027m making a pot of tea.\" The most serious discussions required tea. For some reason, everything made more sense over a shared cup of strong tea. And whatever had happened between Olivia and Jack appeared to be serious, indeed.\u003c/p\u003e\n\u003cp\u003eLess than ten minutes later, Charlotte was back. She carried in the tray, complete with a large ceramic pot, two china cups and a plate of homemade cookies. Olivia sat on the edge of the sofa with a wadded tissue in her hands.\u003c/p\u003e\n\u003cp\u003e\"Start at the beginning,\" Charlotte said as she poured. She handed the first cup and saucer to Olivia, then poured her own. Olivia set the cup on the coffee table, her composure shaky.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m...I\u0027m not sure how this whole thing began, but tonight when I came home and saw the mess in the bathroom, I lost it. I realize Jack doesn\u0027t care about tidiness and order the way I do, but that\u0027s no excuse for leaving wet towels on the floor. He didn\u0027t so much as pick up his dirty underwear.\"\u003c/p\u003e\n\u003cp\u003eCharlotte sighed.\u003c/p\u003e\n\u003cp\u003e\"Maybe I shouldn\u0027t have said anything but I did, and then Jack yelled at me and...\" Her lower lip trembled. \"We both said things we shouldn\u0027t have. He left and then I left, and now I feel so bad.\"\u003c/p\u003e\n\u003cp\u003e\"Of course you do,\" Charlotte said with warm sympathy.\u003c/p\u003e\n\u003cp\u003e\"When we returned from Hawaii, he made an effort to keep the house neat, but it didn\u0027t take him long to slip back into his old habits.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a man for you,\" Charlotte said. \"With your father and me, what we quarreled about was his tendency never to throw anything out. I\u0027d get annoyed and put ten-year-old bills in the trash and then he\u0027d get annoyed....\" She sighed again, remembering. It seemed such a small thing now.\u003c/p\u003e\n\u003cp\u003e\"I know I have irritating habits, too,\" Olivia said. \"Mother, do you think I\u0027m compulsive?\"\u003c/p\u003e\n\u003cp\u003eCharlotte wasn\u0027t about to answer but it didn\u0027t matter; Olivia barreled on.\u003c/p\u003e\n\u003cp\u003e\"Just because I insist the cap be on the toothpaste and the towels hung evenly on the rack—that doesn\u0027t make me a neat freak, does it?\"\u003c/p\u003e\n\u003cp\u003e\"Everyone has a certain, uh, comfort level,\" Charlotte said, hoping to sidestep the issue. She\u0027d come across that useful term in a magazine article a while ago.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe I\u0027m running to my mother with this,\" Olivia cried. \"It\u0027s just that I never thought Jack and I would argue so...so horribly.\"\u003c/p\u003e\n\u003cp\u003e\"Olivia, every couple argues. It\u0027s healthy to clear the air.\"\u003c/p\u003e\n\u003cp\u003eOlivia nodded. \"I know.... But we were both so adamant in what we said and now I think Jack\u0027s sorry he ever married me.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure that\u0027s not true.\"\u003c/p\u003e\n\u003cp\u003e\"He told me he\u0027d had it with this diet I\u0027d put him on and that if he saw another chunk of tofu he was dumping it in the garbage. But Mom, his diet is atrocious! He thinks I\u0027m picking on him because I want him to lose a few pounds. All I want is for him to make healthier food choices.\"\u003c/p\u003e\n\u003cp\u003e\"Of course you want him to eat properly, but—\"\u003c/p\u003e\n\u003cp\u003e\"He said we got along a lot better when we lived apart.\"\u003c/p\u003e\n\u003cp\u003eCharlotte was stunned. \"He didn\u0027t mean it.\"\u003c/p\u003e\n\u003cp\u003eOlivia covered her face again. \"I think he did, because right after that he left. I wasn\u0027t letting him walk out on me, so I left, too. Can you believe I\u0027d do anything so childish?\"\u003c/p\u003e\n\u003cp\u003eCharlotte had to admit she was somewhat amused. This must have been a humdinger of an argument.\u003c/p\u003e\n\u003cp\u003eOlivia had hated fighting when she was a little girl, too. It used to upset her to the point that she\u0027d make herself sick.\u003c/p\u003e\n\u003cp\u003e\"What should I do now?\" Olivia pleaded. \"Should I just go back to the house and pretend nothing happened?\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" Charlotte said, gently patting her daughter\u0027s shoulder. \"First of all, I\u0027m sure Jack is feeling just as bad as you are. You both need to remember that you were single for a lot of years. Marriage is a major adjustment. Perhaps it would be best if you bought two tubes of toothpaste.\"\u003c/p\u003e\n\u003cp\u003e\"I did\" she said indignantly. \"But Jack can\u0027t remember which one is his. Half the time he can\u0027t find it, and mine\u0027s handy, so he uses it.\" She reached for her cup of tea and took a sip. \"Then he gets upset when I say something. According to Jack, it shouldn\u0027t make any difference.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t possibly know. The other night I found an open jar of peanut butter on the kitchen counter. The knife was still in it.\"\u003c/p\u003e\n\u003cp\u003eCharlotte dropped her jaw as though shocked.\u003c/p\u003e\n\u003cp\u003e\"Apparently Jack got up in the middle of the night and made himself a sandwich.\"\u003c/p\u003e\n\u003cp\u003e\"I take it peanut butter isn\u0027t on his diet?\" Charlotte tried hard not to smile.\u003c/p\u003e\n\u003cp\u003e\"No, and Jack knows that. It\u0027s for his own good.\"\u003c/p\u003e\n\u003cp\u003e\"Ob, dear.\"\u003c/p\u003e\n\u003cp\u003eOlivia raised her head at the sound of a car and she vaulted to her feet, dashing to the window. \"Jack just pulled up out front.\" She squared her shoulders and looked back at Charlotte. Then, as if she were making a court decree, she declared, \"Tell him I\u0027m not here.\"\u003c/p\u003e\n\u003cp\u003e\"Olivia, you\u0027re being ridiculous. Your car\u0027s parked in ray driveway. I\u0027m not going to lie to your husband.\"\u003c/p\u003e\n\u003cp\u003e\"Look at me, Mother! Just look at me. I\u0027m a sensible adult, or at least I was until I married Jack Griffin. Overnight I\u0027m back to being a teenager. I\u0027ve never come running to my mother in my life and now—now just look at me. I\u0027m a mess! I\u0027ll talk to Jack once I\u0027ve had a chance to compose myself.\"\u003c/p\u003e\n\u003cp\u003eThe doorbell chimed. Olivia heaved in a breath. \"I need to freshen my makeup.. .and I don\u0027t want him to know... Oh, just tell him whatever you want.\"\u003c/p\u003e\n\u003cp\u003eCharlotte frowned.\u003c/p\u003e\n\u003cp\u003eOlivia disappeared and Charlotte went to the front door. Jack didn\u0027t seem surprised when she answered before he\u0027d even knocked. He had on his light raincoat, rumpled as usual, hands deep in his pockets.\u003c/p\u003e\n\u003cp\u003e\"Hello, Jack.\"\u003c/p\u003e\n\u003cp\u003eA scowl darkened his face. He nodded. \"Hello, Charlotte.\"\u003c/p\u003e\n\u003cp\u003e\"What can I do for you?\"\u003c/p\u003e\n\u003cp\u003e\"Do you have a minute?\"\u003c/p\u003e\n\u003cp\u003eCharlotte hesitated, then gestured him in. \"Of course. Come inside.\"\u003c/p\u003e\n\u003cp\u003eHe stepped into the house and glanced around. Charlotte noticed that his gaze lingered on the two teacups, but he didn\u0027t comment on the fact that Olivia was obviously at the house.\u003c/p\u003e\n\u003cp\u003e\"I heard a rumor this afternoon and wanted to see if it was true.\"\u003c/p\u003e\n\u003cp\u003e\"Sit down,\" Charlotte invited soberly, trying to hide her amusement at both Olivia and Jack. They were acting like kids—and as Olivia had said, even when she was a kid, she hadn\u0027t acted like this. Still, amused or not, Charlotte was worried; immature behavior could escalate and end in drastic consequences. This was a good marriage in the ways that counted. She hoped they\u0027d give it the chance it deserved.\u003c/p\u003e\n\u003cp\u003eHe chose the wing chair and stroked Harry\u0027s head as he walked past the cat. Harry remained unruffled by all these dramatics. She envied him a little.\u003c/p\u003e\n\u003cp\u003e\"What did you hear?\" Charlotte asked as she sat down again. She picked up her knitting, hoping it would calm her. \u003c/p\u003e","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-23.html","bookId":1944,"creation":"Oct 5, 2019 10:03:49 AM","modification":"Oct 5, 2019 10:03:49 AM"}
