{"id":67123,"no":41,"title":"Page 41","content":"\u003cp\u003eHe was going home.\u003c/p\u003e\n\u003cp\u003eForty-Three\u003c/p\u003e\n\u003cp\u003eMaryellen stepped out of the shower, hair still wet. It was the afternoon of Charlotte and Ben\u0027s wedding. She\u0027d mentioned the ceremony to Jon, but they weren\u0027t exactly on good terms. The one time she\u0027d asked, he refused to attend the wedding with her.\u003c/p\u003e\n\u003cp\u003eHe also refused to discuss his parents. He remained civil, but distant and guarded. Every night they slept side by side without touching, without talking. Her beautiful home felt like a prison and Maryellen couldn\u0027t bear it.\u003c/p\u003e\n\u003cp\u003eBeing pregnant didn\u0027t help. She hadn\u0027t told Jon yet. She\u0027d planned to, knowing she should, but as time went on and his attitude didn\u0027t change, she realized it was a hopeless situation.\u003c/p\u003e\n\u003cp\u003eAfter dressing and blow-drying her hair, she got out an overnight bag and packed as much as it would hold. She added several extra pieces of clothing to Katie\u0027s diaper bag, as well. When she was finished, she carried both to the car.\u003c/p\u003e\n\u003cp\u003eMaryellen was on the verge of tears. She loved Jon and hoped they would be able to resolve their problems, but she\u0027d begun to fear that wasn\u0027t possible. Her husband no longer trusted her. He felt she\u0027d betrayed him. He couldn\u0027t understand or accept that she\u0027d only been trying to help him reconcile with his family—for his own sake and his daughter\u0027s.\u003c/p\u003e\n\u003cp\u003eWith a sleeping Katie over her shoulder, Maryellen gently tapped on the door of the darkroom where Jon was developing film. Whenever he was in the house at the same time as she was, he found a way to avoid her. If she was upstairs, he had some reason to linger downstairs. Meals were a painful experience. They sat across from each other and made polite conversation, but Maryellen simply couldn\u0027t connect with him.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" Jon called impatiently.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m leaving for Charlotte\u0027s wedding now.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003eMaryellen hesitated. \"Are you sure you can\u0027t come with us?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" Disappointment settled heavily on her shoulders.\u003c/p\u003e\n\u003cp\u003e\"Give the newly weds my best.\"\u003c/p\u003e\n\u003cp\u003e\"I will.\" Maryellen swallowed painfully. \"Listen, Jon, I\u0027m thinking I won\u0027t come back after the wedding.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"I talked to Mom earlier, and Katie and I are going to spend the night with her.\"\u003c/p\u003e\n\u003cp\u003e\"Hold on a minute,\" he said and opened the door.\u003c/p\u003e\n\u003cp\u003eMaryellen stepped back nervously as Jon\u0027s gaze held hers. \"You\u0027re going to your mother\u0027s place for the night?\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eMaryellen shrugged. \"I need time to think.\"\u003c/p\u003e\n\u003cp\u003e\"About what?\" he challenged.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t live like this,\" she whispered, breaking eye contact.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t respond.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Jon, sorrier than you know.\" Her voice cracked, and she turned away and left the house.\u003c/p\u003e\n\u003cp\u003eTo her surprise, he followed her to the car. When she\u0027d placed Katie in the car seat, she straightened. Jon stood with his hands in his pockets, staring down at the ground.\u003c/p\u003e\n\u003cp\u003e\"Are you coming back tomorrow?\" he asked as she walked around to the driver\u0027s seat.\u003c/p\u003e\n\u003cp\u003e\"Do you want me to?\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003e\"That says it all, doesn\u0027t it?\" She climbed in the car, started the engine and drove to the end of the driveway. Her heart was about to break. Hands clenching the steering wheel hard, she lowered her forehead and drew in a deep breath.\u003c/p\u003e\n\u003cp\u003eThe minute Maryellen arrived at her mother\u0027s house, Grace knew something was wrong. \"You\u0027d better tell me,\" her mother said as Maryellen carried in her bags.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll discuss everything after the wedding,\" Maryellen insisted, managing a smile. \"It\u0027s all right, Mom. Everything\u0027s going to be fine.\"\u003c/p\u003e\n\u003cp\u003eHer mother looked as if she didn\u0027t believe her, and rightly so. Maryellen didn\u0027t believe it herself.\u003c/p\u003e\n\u003cp\u003eThe wedding was lovely. Standing beside her mother, Maryellen battled tears. Only five months earlier, she\u0027d stood before Pastor Flemming and vowed to love Jon for the rest of her life. It had only taken her five months to screw up her second marriage. Five months. That had to be some kind of record outside of Hollywood.\u003c/p\u003e\n\u003cp\u003eThe church was nearly full. Charlotte\u0027s dearest friends crowded the front pews, wearing red hats and purple boas. Olivia and her family took up two pews. So many people had wanted to share in the couple\u0027s happiness. Unfortunately, neither of Ben\u0027s sons had been able to come; both he and Charlotte must have been disappointed.\u003c/p\u003e\n\u003cp\u003eDespite the jubilant mood, Maryellen felt a sense of hopelessness and inner turmoil. The church seemed to get hot and stuffy and the room began to sway. Maryellen sat down, taking several deep breaths, fearing she was about to faint.\u003c/p\u003e\n\u003cp\u003e\"Maryellen?\" Grace sat down beside her.\u003c/p\u003e\n\u003cp\u003eShe offered her mother a feeble smile. \"I\u0027m pregnant.\"\u003c/p\u003e\n\u003cp\u003eHer mother smiled from ear to ear and squeezed her hand.\u003c/p\u003e\n\u003cp\u003e\"Jon doesn\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"I think it\u0027s time for you to tell him, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eMaryellen couldn\u0027t answer.\u003c/p\u003e\n\u003cp\u003eThe music started then, and Pastor Flemming came to the front of the church. Charlotte and Ben joined him and gazed up at each other with such adoration that Maryellen had to blink back tears.\u003c/p\u003e\n\u003cp\u003eShe heard footsteps behind her and hope leapt into her heart. She turned around, thinking, hoping, desperately wanting the late arrival to be Jon. Instead, Cliff Harding slipped into the pew beside her mother. She watched as they looked tenderly at each other and then Cliff tucked her mother\u0027s arm in the crook of his elbow and smiled over at Maryellen and Katie.\u003c/p\u003e\n\u003cp\u003eSomehow Maryellen made it through the rest of the day. The reception at The Lighthouse was elegant, with vintage wines and the best champagne—neither of which she touched—and a selection of delicious hors d\u0027oeuvres. Several people asked about Jon, and Maryellen invented a convenient excuse. He was busy with a photographic commission and couldn\u0027 t come; he sent his best wishes. He had, in fact, given the newly weds a framed photograph of the lighthouse, one that Charlotte had long admired.\u003c/p\u003e\n\u003cp\u003eKnowing her mother wanted to spend time with Cliff, Maryellen drove back to the house on Rosewood Lane\u003c/p\u003e\n\u003cp\u003e. Katie was cranky and hungry by then, so Maryellen hurriedly heated her dinner. She was giving Katie a bath when she felt the first painful spasm. The sharpness of it caught her unawares and she nearly doubled over.\u003c/p\u003e\n\u003cp\u003eKneeling on the floor in front of the bathtub, she watched as her daughter splashed joyfully, unconscious of the turmoil in Maryellen. No, please God, not the baby. Nothing else happened and she breathed easier.\u003c/p\u003e\n\u003cp\u003eAfter a few minutes, Maryellen lifted Katie from the tub. The pain shot through her and she gasped as the blood rushed between her legs. Holding Katie against her, Maryellen sank to the floor.\u003c/p\u003e\n\u003cp\u003eThe front door opened a moment later and Maryellen sagged with relief. \"Mom...help...oh, Mom.\"\u003c/p\u003e\n\u003cp\u003eGrace was in the bathroom in an instant; Cliff was with her. Her mother\u0027s eyes were wide with alarm.\u003c/p\u003e\n\u003cp\u003eMaryellen was weeping by then. Katie was screaming.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve lost the baby... I\u0027ve lost the baby,\" she wailed in grief and pain, sobbing openly now.\u003c/p\u003e\n\u003cp\u003eAfter that, everything happened so quickly, Maryellen had trouble making sense of it. The next thing she knew, she was at the hospital in Bremerton and a doctor was telling her she\u0027d suffered a miscarriage. As if she hadn\u0027t figured that out for herself. Maryellen barely heard a word he said, crying as hard as she was. He asked about her husband, but she shook her head. Jon didn\u0027t even know she was pregnant.\u003c/p\u003e\n\u003cp\u003eIt was decided she should spend the night in the hospital and after the D\u0026amp;C, she was wheeled into a private room. A lone figure stood in the shadows. Jon. Apparently her mother had called him. Or perhaps Cliff had; it didn\u0027t matter. He was with her.\u003c/p\u003e\n\u003cp\u003eMaryellen looked at him and fresh tears coursed down her cheeks. She turned her head away.\u003c/p\u003e\n\u003cp\u003e\"Maryellen,\" he whispered, moving to the bedside. \"Why didn\u0027t you tell me?\"\u003c/p\u003e\n\u003cp\u003eShe had no answer for him.\u003c/p\u003e\n\u003cp\u003e\"I am so sorry.\" Each word was carefully enunciated.\u003c/p\u003e\n\u003cp\u003eDeeply depressed, Maryellen could only shake her head. She was sorry, too. Sorry about everything.\u003c/p\u003e\n\u003cp\u003eJon sat down beside her and after a moment, reached for her hand and kissed it. She realized then that his eyes were bright with tears.\u003c/p\u003e\n\u003cp\u003eShe started to sob again and stretched out her arms. Jon wrapped her in his embrace and together, with their arms securely around each other, they wept.\u003c/p\u003e\n\u003cp\u003eForty-Four\u003c/p\u003e\n\u003cp\u003eRoy McAfee always checked his answering machine when he arrived at the office. There\u0027d been a number of hang-ups recently. In light of the mysterious postcard he\u0027d received a few weeks back, these hang-ups troubled him. He expected a few occasionally—any business got its share of wrong numbers—but his office had received more disconnected calls than usual in the last six weeks.\u003c/p\u003e\n\u003cp\u003eCorrie was making coffee after collecting the day\u0027s mail on her way into the office. Sitting down, Roy opened the drawer on the left-hand side of his desk and pulled out the cryptic postcard. He still didn\u0027t know what to make of it.\u003c/p\u003e\n\u003cp\u003eHe heard Corrie moving around the outer office and realized she was about to deliver his coffee and the mail. Not wanting her to fuss over the postcard, he slipped it back inside his desk drawer.\u003c/p\u003e\n\u003cp\u003eSure enough, Corrie entered his office, handing him a fresh mug of coffee. \"There wasn\u0027t much mail this morning,\" she said as she placed a stack on the corner of his desk.\u003c/p\u003e\n\u003cp\u003eUsually she was the one who stopped at the post office.\u003c/p\u003e\n\u003cp\u003eIt was pure coincidence that Roy had collected the mail the day that postcard arrived.\u003c/p\u003e\n\u003cp\u003eCorrie remained standing on the other side of his desk; she seemed to be waiting for something.\u003c/p\u003e\n\u003cp\u003eRoy anticipated a comment that didn\u0027t come. \"Anything else?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Look it over,\" she said, gesturing to the few pieces of mail.\u003c/p\u003e\n\u003cp\u003eRoy reached for them and leaned back in his chair while he shuffled dirough the usual flyers, bills and—he hesitated when he caught sight of the postcard. He stared at the picture of the Space Needle.\u003c/p\u003e\n\u003cp\u003e\"Read it,\" Corrie said.\u003c/p\u003e\n\u003cp\u003eRoy turned it over. The message was in the same block lettering as the first one. Only this time it read: THE PAST HAS A WAY OF CATCHING UP WITH THE PRESENT.\u003c/p\u003e\n\u003cp\u003e\"What does it mean?\"\u003c/p\u003e\n\u003cp\u003eRoy stared at the card, as perplexed by this message as he was by the first. \"I haven\u0027t got a clue.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no signature.\"\u003c/p\u003e\n\u003cp\u003eRoy set the card down on his desk. \"People who send these kinds of messages generally don\u0027t sign their names.\"\u003c/p\u003e\n\u003cp\u003eCorrie walked over to the far side of the room and looked out the window. \"This isn\u0027t the first one, is it?\"\u003c/p\u003e\n\u003cp\u003eAt times Roy swore Corrie should be the private investigator. She had real instincts about people, and a reliable sense of what was true and what wasn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"Is it?\" she demanded, turning to face him.\u003c/p\u003e\n\u003cp\u003eRoy reluctantly shook his head. Slowly opening the drawer, he brought out the other postcard.\u003c/p\u003e\n\u003cp\u003eCorrie walked quickly to his desk and picked it up.\u003c/p\u003e\n\u003cp\u003eHe watched her read the short, cryptic message and saw that she was as mystified as he was.\u003c/p\u003e\n\u003cp\u003e\"When did this arrive?\"\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t recall exactly. \"A few weeks ago.\"\u003c/p\u003e\n\u003cp\u003e\"Why didn\u0027t you say anything?\" she cried, throwing down the postcard. \"I\u0027m your wife. I have a right to know.\"\u003c/p\u003e\n\u003cp\u003eRoy shrugged halfheartedly. \"What was the point? Why should you worry because someone\u0027s getting their kicks mailing me silly postcards?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re being threatened and you don\u0027t feel it\u0027s important to let me know?\" She raised her voice. \"I\u0027m not only your wife, I\u0027m your business partner!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-41.html","bookId":1944,"creation":"Oct 5, 2019 10:03:49 AM","modification":"Oct 5, 2019 10:03:49 AM"}
