{"id":67128,"no":46,"title":"Page 46","content":"\u003cp\u003eHe shook his head vehemently.\u003c/p\u003e\n\u003cp\u003e\"You must feel a real sense of justification and righteousness knowing how badly they wronged you—and knowing that you\u0027re punishing them now.\"\u003c/p\u003e\n\u003cp\u003eHis eyes blazed, but he held his tongue.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think I\u0027ll ever fully understand the full extent of your pain. Your family betrayed you. They chose your brother over you and you\u0027re angry.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re damned straight I am.\"\u003c/p\u003e\n\u003cp\u003e\"You have every right to be. Perhaps they don\u0027t deserve your forgiveness, but don\u0027t you see what this bitterness has done to you? Don\u0027t you understand that until you can let go of this pain, you\u0027re incapable of experiencing real joy?\"\u003c/p\u003e\n\u003cp\u003eShe could tell he wanted to argue with her, but she didn\u0027t give him the opportunity.\u003c/p\u003e\n\u003cp\u003e\"Now you\u0027re angry with me,\" she said, \"and I admit it was wrong to go behind your back. But you let me walk away because that sense of righteous indignation was more valuable to you than your love for me.\"\u003c/p\u003e\n\u003cp\u003eHe opened his mouth to challenge her, but apparently changed his mind. He paced, his steps speeding up, then slowing as he went through some internal argument. \"What should I do?\"\u003c/p\u003e\n\u003cp\u003e\"Look in your heart. Work on your attitude, your unwillingness to release all this pain.\"\u003c/p\u003e\n\u003cp\u003eJon shook his head, hopelessly this time, as if she was asking the impossible. \"You make it sound so easy.\"\u003c/p\u003e\n\u003cp\u003e\"I know it can\u0027t be.\"\u003c/p\u003e\n\u003cp\u003eHe sighed deeply and his shoulders sagged in defeat. \"You\u0027re welcome to keep in touch with them if you want.\"\u003c/p\u003e\n\u003cp\u003e\"What about you?\"\u003c/p\u003e\n\u003cp\u003eHis jaw tightened. \"I\u0027ll wait a while, but I\u0027ll try, Maryellen. For you and Katie, I\u0027ll try.\"\u003c/p\u003e\n\u003cp\u003eIn that moment, the cloud of depression that had hung over her since the miscarriage lifted. She held open her arms to Jon and was quickly engulfed in his embrace, with Katie between them.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t ask for more than that,\" she whispered.\u003c/p\u003e\n\u003cp\u003eFifty\u003c/p\u003e\n\u003cp\u003eBob had been prepared to dislike Stewart Samuels, but in the days since he\u0027d arrived in Cedar Cove, he\u0027d had ample opportunity to gain a healthy respect for the other man.\u003c/p\u003e\n\u003cp\u003eBecause of a meeting with some old friends from the police academy, Roy had been out of town. As soon as Corrie notified him that Samuels was in Cedar Cove, Roy had altered his travel plans and was due to get back late Monday morning.\u003c/p\u003e\n\u003cp\u003eBy unspoken agreement, Stewart Samuels and Bob didn\u0027t discuss Maxwell Russell. For the most part, Hannah had stayed out of sight during Stewart\u0027s visits to the house. When Bob asked Peggy about it, his wife was eager to make excuses for her. For some reason, Samuels frightened the girl, but that didn\u0027t really surprise Bob. He supposed it was because of Hannah\u0027s wariness around men. She preferred her own company and often stayed in her room, where she read or watched television. Peggy was the only one with whom she seemed to feel comfortable.\u003c/p\u003e\n\u003cp\u003eRoy arrived a little after one on Monday afternoon, and to Bob\u0027s surprise Troy Davis, the local sheriff, showed up with him. Stewart Samuels was already at the house when Bob answered the door. He led the two other men into the living room.\u003c/p\u003e\n\u003cp\u003e\"Sit down,\" Bob instructed everyone when the introductions had been made. Peggy quickly distributed coffee, then sat down next to Bob. He took her hand and they entwined their fingers.\u003c/p\u003e\n\u003cp\u003eRoy reached inside his pocket, pulling out a small notebook. \"I have a couple of questions, if you don\u0027t mind?\" He looked at the sheriff as if seeking his approval.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll answer them if I can,\" Samuels assured him, leaning forward slightly.\u003c/p\u003e\n\u003cp\u003eRoy nodded, his pen poised. \"Tell me about the first time you met Russell after his accident.\"\u003c/p\u003e\n\u003cp\u003e\"We didn\u0027t meet. Everything was handled over the phone.\"\u003c/p\u003e\n\u003cp\u003e\"That can\u0027t be,\" Peggy said and then instantly shrank back as if she wanted to retrieve the words. \"I\u0027m sorry. Go on.\"\u003c/p\u003e\n\u003cp\u003eSamuels shrugged, obviously a little puzzled at the outburst. \"I\u0027m sure I\u0027m right about this, Peggy. Max had the physician contact me to ask for my assistance in getting him into a veterans\u0027 facility. He needed extensive plastic surgery. Apparently he had only limited health insurance.\"\u003c/p\u003e\n\u003cp\u003e\"You never went out to California to see him following the surgery?\"\u003c/p\u003e\n\u003cp\u003e\"Never.\" Samuels was adamant. \"I did speak to him a few times, however.\"\u003c/p\u003e\n\u003cp\u003e\"When was that?\" Troy asked.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t recall the exact dates, but it was after he\u0027d undergone surgery, which I understand was successful.\"\u003c/p\u003e\n\u003cp\u003e\"What did he want to know when he phoned?\"\u003c/p\u003e\n\u003cp\u003e\"Actually I was the one who called him,\" the colonel explained. \"The hospital social worker reported on his progress and suggested Max get some counseling. He suffered from post-traumatic stress syndrome. I urged him to sign up for the sessions.\"\u003c/p\u003e\n\u003cp\u003e\"Did he agree?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. The doctor told me later that Max had a number of appointments and they seemed to be going well. I was encouraged the next time I talked to Max himself. I only spoke with his counselor once, but she seemed pleased with his progress.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know of any reason he\u0027d want to visit Cedar Cove?\"\u003c/p\u003e\n\u003cp\u003e\"None, except...\" He hesitated and gazed down at his folded hands. \"It might\u0027ve had something to do with the therapy sessions—some desire to reconcile himself to what happened in Nam.\" Samuels paused. \"As I recall, he was tight with Dan Sherman back then.\"\u003c/p\u003e\n\u003cp\u003e\"Did he mention that he intended to visit Dan?\" Roy asked.\u003c/p\u003e\n\u003cp\u003e\"No. Like I said, I only talked to him two or three times.\"\u003c/p\u003e\n\u003cp\u003eThe sheriff spoke next. \"When did you learn he\u0027d been murdered?\"\u003c/p\u003e\n\u003cp\u003e\"When Mr. McAfee contacted me,\" Samuels said, nodding toward Roy. \"I\u0027ve received intermittent communications since then, from Mr. McAfee and from you.\" .\u003c/p\u003e\n\u003cp\u003e\"Peggy,\" Troy began, turning to her. \"You said something earlier.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head nervously. \"I\u0027m sure I misunderstood.\"\u003c/p\u003e\n\u003cp\u003e\"Misunderstood what?\" he pressed.\u003c/p\u003e\n\u003cp\u003e\"Hannah,\" she said, rubbing her index finger over her cuticles. \"We were discussing her father recently, and she told me she saw Colonel Samuels talking to Max shortly before he left California.\"\u003c/p\u003e\n\u003cp\u003e\"That isn\u0027t possible,\" Samuels told her. \"I was in WashingtonD.C. on assignment nearly all of last year. The only trips I made were to England and Belgium.\"\u003c/p\u003e\n\u003cp\u003e\"That would be easy enough to verify,\" Roy said to Davis.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s do it right now,\" Samuels insisted. \"If you have a specific date in mind, I can have my assistant pull up my calendar and we\u0027ll go through it online.\"\u003c/p\u003e\n\u003cp\u003eTroy Davis accompanied the colonel into the other room, where Bob kept a computer on his desk. Bob had already turned it on, since he\u0027d been using a bookkeeping program earlier. Now, as they waited, Roy sipped his coffee. Bob loosened his hold on Peggy\u0027s hand. This wasn\u0027t nearly as intimidating or awkward as he\u0027d feared.\u003c/p\u003e\n\u003cp\u003e\"Is Hannah here?\" Roy asked.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s in her room,\" Peggy said, \"but I\u0027d like to keep her out of this as much as possible. Anytime someone mentions her father, she gets upset.\"\u003c/p\u003e\n\u003cp\u003eRoy looked from Peggy to Bob. \"We\u0027ll need her to verily the facts.\"\u003c/p\u003e\n\u003cp\u003ePeggy still seemed uncertain. \"She\u0027s been through so much already, I hate to drag her into this. As you can imagine, Hannah\u0027s easily upset, especially when it involves anything to do with her parents.\"\u003c/p\u003e\n\u003cp\u003e\"In the long run, this will help her,\" Roy said.\u003c/p\u003e\n\u003cp\u003ePeggy turned to Bob. \"I agree with Roy,\" he said. \u0027The only reason she\u0027s living with us is because we want to help her. This discussion might put some ghosts to rest for her.\"\u003c/p\u003e\n\u003cp\u003ePeggy left and returned to the living room before Troy and Stewart Samuels came back. Hannah resembled a frightened child about to be called to task. She stayed close to Peggy\u0027s side, her head bowed. After a brief nod in Bob\u0027s direction, Hannah sat on the ottoman beside Peggy. In a gesture of reassurance and comfort, Peggy placed her hand on Hannah\u0027s shoulder.\u003c/p\u003e\n\u003cp\u003e\"You never told us that your father was in counseling,\" Roy said, speaking to Hannah.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure I did. Didn\u0027t I?\" she asked Peggy.\u003c/p\u003e\n\u003cp\u003ePeggy shrugged. \"I\u0027m sorry, I don\u0027t recall if you did or not.\"\u003c/p\u003e\n\u003cp\u003eHannah laughed weakly. \"What\u0027s the big deal? He saw a counselor.\"\u003c/p\u003e\n\u003cp\u003e\"You said he often carried false identification, too,\" Bob added.\u003c/p\u003e\n\u003cp\u003e\"We certainly could have used that information earlier,\" Troy muttered, straightening.\u003c/p\u003e\n\u003cp\u003e\"My father was never able to hold down a job for long,\" Hannah rushed to explain. Her eyes darted between the sheriff and Roy. \"He... he sometimes used a different name in a different town.\"\u003c/p\u003e\n\u003cp\u003e\"That isn\u0027t what you told me before,\" Troy said. \"When I asked you about it, you claimed you couldn\u0027t imagine your father doing such a thing.\"\u003c/p\u003e\n\u003cp\u003e\"I... I was in shock,\" Hannah whispered, staring at the carpet. \"I can\u0027t remember everything you asked me. I\u0027d just learned that my father was dead and that he might\u0027ve been murdered.\" She buried her face in her hands and Peggy gently patted her back, glaring at the sheriff as if he were purposely intimidating the poor girl.\u003c/p\u003e\n\u003cp\u003e\"Sheriff Davis, is this necessary?\" she asked when Hannah started to sob.\u003c/p\u003e\n\u003cp\u003e\"This is a murder investigation, Peggy.\"\u003c/p\u003e\n\u003cp\u003e\"You think I murdered my own father?\" Hannah cried, leaping to her feet. \"He was the only person I had in the world! Why would I want him dead?\" She gestured wildly at Samuels. \"He\u0027s the one who\u0027s up for some important promotion—he\u0027s the one who led those men into that village and killed all those women and children.\"\u003c/p\u003e\n\u003cp\u003ePeggy gasped. \"How... how did you know?\"\u003c/p\u003e\n\u003cp\u003e\"My dad told me all about it while he was in counseling. He was a murderer, and so are Bob and him.\" She pointed a shaking finger at the colonel. \"I think he killed my father, too.\"\u003c/p\u003e\n\u003cp\u003e\"I was in Europe at the time of your father\u0027s death,\" Stewart Samuels said evenly.\u003c/p\u003e\n\u003cp\u003e\"Sure you were—he was drugged, remember?\" she said viciously. \"You came to the house and gave him that water bottle and then you left.\"\u003c/p\u003e\n\u003cp\u003e\"The dates of Colonel Samuels\u0027s travel record state otherwise, Hannah,\" Sheriff Davis said calmly. \"If anyone was with your father before he decided to drive to Cedar Cove, it was you.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head in denial. \"I didn\u0027t even know he was leaving.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not what you told me,\" Roy said.\u003c/p\u003e\n\u003cp\u003e\"Then... then there\u0027s been some misunderstanding.\" Hannah began to back away, easing toward the kitchen one small step at a time.\u003c/p\u003e\n\u003cp\u003e\"Stop hounding the girl,\" Peggy insisted. \"Can\u0027t you see you\u0027re frightening her?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve always found it curious that the drug used to kill Maxwell Russell is commonly seen in date rape situations,\" Roy said. \"It\u0027s generally considered a young person\u0027s drug.\"\u003c/p\u003e\n\u003cp\u003eThe room went quiet as everyone stared at Hannah.\u003c/p\u003e\n\u003cp\u003e\"I first noticed the inconsistencies in your answers the afternoon I spoke with you on the phone, Hannah,\" Roy continued. \"I talked it over with the colonel and was able to verify his statements, but not yours. Perhaps you can explain yourself.\"\u003c/p\u003e\n\u003cp\u003e\"Of course I can,\" Hannah said.\u003c/p\u003e\n\u003cp\u003e\"You said your father was a good man.\"\u003c/p\u003e\n\u003cp\u003e\"He was,\" Hannah cried.\u003c/p\u003e\n\u003cp\u003e\"But he couldn\u0027t hold down a job?\"\u003c/p\u003e\n\u003cp\u003e\"He tried....\" \u003c/p\u003e","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-46.html","bookId":1944,"creation":"Oct 5, 2019 10:03:49 AM","modification":"Oct 5, 2019 10:03:49 AM"}
