{"id":67129,"no":47,"title":"Page 47","content":"\u003cp\u003e\"He abused your mother?\"\u003c/p\u003e\n\u003cp\u003e\"Yes!\" the young woman screamed. \"Nothing was ever good enough for him. I hated him. I loved him.\" Her face twisted into a mask of pain and fear. She stood with her hands in tight fists. \"He deserved to die. He should\u0027ve been the one killed in the accident, not Mom.\"\u003c/p\u003e\n\u003cp\u003e\"Hannah.\" Peggy was instantly at her side. \"You don\u0027t know what you\u0027re saying.\"\u003c/p\u003e\n\u003cp\u003eShoving Peggy aside, Hannah faced the others. \"You\u0027re all alike, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"What happened to your mother?\" Troy asked.\u003c/p\u003e\n\u003cp\u003e\"She died. My father was the one who was supposed to be killed, not my mother. I paid my friend Davey to put air in the steering column of Dad\u0027s car. He\u0027d lose control of the car and it would crash. It was supposed to be so easy, but then Mom decided to go with him.\u003c/p\u003e\n\u003cp\u003e\"I tried to get her to stay home, but she wouldn\u0027t listen. Dad wanted her to come along and she refused him nothing.\" The words were spat out with such anger that her face was contorted. Bob had never witnessed anything like it.\u003c/p\u003e\n\u003cp\u003e\"He suffered, you know. That was good. It made everything better when I saw how badly he\u0027d been burned. Still, it wasn\u0027t enough. I could have killed him in the hospital. I wanted to, but when I saw that he was in agony, I thought death was too good for him.\"\u003c/p\u003e\n\u003cp\u003e\"Hannah,\" Peggy cried, \"don\u0027t say any more. You don\u0027t mean any of this.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I do,\" she cried. \"I mean every single word. My father was a bastard and I hated him for what he did to my mother and me. I could never have friends, bring them to the house. Every time I had a friend we moved. Dad would lose his job again or the neighbors would hear him beating on Mom. He broke my arm when I was six, you know.\" Her eyes narrowed. \"No, you don\u0027t know because no one knew. I couldn\u0027t tell the doctors what really happened. I was supposed to have fallen down the stairs.\" She shook her head, her voice rising. \"I made him pay for that, too. Davey helped me. He bought me the roofies and told me how to do it. He said I wouldn\u0027t get caught!\"\u003c/p\u003e\n\u003cp\u003e\"Hannah Russell, you have the right to remain silent,\" Troy said, standing. He advanced toward her slowly. \"Anything you say can and will be used against you in a court of law.\"\u003c/p\u003e\n\u003cp\u003e\"Shut up,\" she screamed so loudly it hurt Bob\u0027s ears.\u003c/p\u003e\n\u003cp\u003e\"Hannah, please,\" Peggy pleaded.\u003c/p\u003e\n\u003cp\u003e\"No... not this time,\" she screeched. \"Then Dad started talking to that shrink and he changed. He wanted to start his life over and be happy. I couldn\u0027t let him be happy, not after the hell he\u0027d put me through. He deserved to die. I wanted him dead. Dead,\" she shouted. \"Dead and burned and gone forever.\"\u003c/p\u003e\n\u003cp\u003eTroy walked over to Hannah with a pair of handcuffs and when she realized she was about to be arrested, she fell to her knees and broke into deep sobs.\u003c/p\u003e\n\u003cp\u003ePeggy moved to comfort Hannah, but Bob stopped her. Hannah had murdered her own father. All these weeks, they\u0027d been housing the killer and not known it. Peggy turned to Bob, burying her face in his shoulder.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s over now,\" he whispered soothingly.\u003c/p\u003e\n\u003cp\u003e\"Did you know?\" she asked, looking up at him.\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003eDavis led a sobbing Hannah out to his patrol car. The young woman glanced over her shoulder at Peggy as if silently pleading for help. Peggy held her hand over her mouth. This was difficult for her, Bob knew, but she stood silently beside him.\u003c/p\u003e\n\u003cp\u003eThen Hannah let loose with a string of swearwords that shocked them all. Even from inside they could hear her clearly. The room went completely still after Troy had driven off.\u003c/p\u003e\n\u003cp\u003eRoy left soon afterward and only Peggy, Bob and Stewart Samuels remained.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry it came to this,\" Stewart said. \"Sorry I didn\u0027t confront the past sooner and deal with these issues.\"\u003c/p\u003e\n\u003cp\u003e\"We each buried that day as deep as we could,\" Bob said. \"Now it\u0027s been unearthed....\"\u003c/p\u003e\n\u003cp\u003e\"And now maybe the two of us can get on with our lives.\"\u003c/p\u003e\n\u003cp\u003eFor the first time since he\u0027d returned from Vietnam, Bob felt that was possible. There would always be guilt, but perhaps he could find a way to expiate his sins.\u003c/p\u003e\n\u003cp\u003eFifty-One\u003c/p\u003e\n\u003cp\u003eThe aerobics class seemed easier this Wednesday evening, despite the sweat Grace could feel on her brow. Lunging left, then right as the loud music vibrated through the room, she followed the instructor\u0027s lead, using every ounce of energy she had.\u003c/p\u003e\n\u003cp\u003ePerhaps this surplus of vigor was due to her mood. She was still furious with Will Jefferson. She hadn\u0027t seen or heard from Cliff in a week. Once again, his faith in her had been shaken, and somehow she doubted she\u0027d hear from him again. Will\u0027s express purpose was to destroy any possibility that Grace might find happiness with another man, but she refused to let him succeed. She didn\u0027t understand any of it—his willingness to betray his wife, his insistence on a relationship with Grace or his apparent vindictiveness at her rejection. But, dammit, she wasn\u0027t letting him ruin her chances with Cliff!\u003c/p\u003e\n\u003cp\u003e\"Good luck, buster,\" she muttered under her breath and with a burst of energy finished the program. She hadn\u0027t come this close only to lose Cliff without a fight. If he didn\u0027t call her soon, she\u0027d go back to sending him notes and e-mails.\u003c/p\u003e\n\u003cp\u003e\"What was that you just said?\" Olivia gasped as the music ended. Her reddened face glistened with sweat.\u003c/p\u003e\n\u003cp\u003e\"Never mind,\" Grace whispered. The cool-down exercises started, her least favorite part of the workout. Grace retrieved her mat from the corner of the room, and placed it next to Olivia\u0027s. Perhaps it was her age, but it was becoming increasingly difficult to do some of these stretches. Especially the one in which she had to bend one leg and cross it over the other and then turn to the side. She always seemed to be facing in the wrong direction.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve been in a bad mood all night,\" Olivia said when they\u0027d completed the class and walked to the dressing room. \"What\u0027s gotten into you?\"\u003c/p\u003e\n\u003cp\u003eGrace shrugged.\u003c/p\u003e\n\u003cp\u003e\"Cliff?\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t answer. \"Do you have time for coffee?\" she asked instead.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t,\" Olivia said regretfully. \"Jack\u0027s still at work, and I know if I don\u0027t literally drag him out of that office, he\u0027ll be there half the night.\"\u003c/p\u003e\n\u003cp\u003e\"Poor Jack.\"\u003c/p\u003e\n\u003cp\u003e\"Poor Jack nothing. I feel like a widow! We should still be in our honeymoon phase,\" Olivia complained. \"I wish the management would let him hire an assistant editor.\"\u003c/p\u003e\n\u003cp\u003e\"They should,\" Grace agreed.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re telling me.\" Olivia reached for her towel and wiped her face. \"I can\u0027t apologize enough for my brother. I\u0027m so angry with him.\"\u003c/p\u003e\n\u003cp\u003eGrace dismissed her friend\u0027s concern. Olivia wasn\u0027t responsible for Will\u0027s behavior. Neither was Charlotte. The best excuse or explanation they\u0027d come up with was some kind of midlife crisis, but neither she nor Olivia had much sympathy with that.\u003c/p\u003e\n\u003cp\u003e\"What are you doing Saturday?\" Olivia asked. \"Maybe we can go to brunch or the movies or something?\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t we go to an afternoon show?\" She was working at the animal shelter in the morning, and planning to have dinner with Kelly and Paul that evening.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re on,\" Olivia said as she headed to the showers. \"I\u0027ll call you later and we can pick a movie.\"\u003c/p\u003e\n\u003cp\u003eGrace smiled in agreement.\u003c/p\u003e\n\u003cp\u003eStill feeling out of sorts, Grace returned to the house. Buttercup, ever faithful, was waiting for her when Grace unlocked the door. She turned on the lights and found Sherlock curled up nose to tail, sleeping on her sofa.\u003c/p\u003e\n\u003cp\u003e\"Hello to you, too,\" she chided as she brought her exercise gear to the laundry room.\u003c/p\u003e\n\u003cp\u003eThe blinking light on her answering machine caught her attention, and she grabbed a pen and paper, then pushed the Play button. At the sound of Cliff\u0027s voice, a huge smile broke across her face. She hadn\u0027t heard the whole message before she punched out his number.\u003c/p\u003e\n\u003cp\u003eCliff answered on the second ring. His hello was gruff, which was typical.\u003c/p\u003e\n\u003cp\u003e\"Hi,\" Grace said. \"I wondered if I\u0027d hear from you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been busy.\"\u003c/p\u003e\n\u003cp\u003e\"I know. Me too. How are you?\"\u003c/p\u003e\n\u003cp\u003e\"Okay. You?\"\u003c/p\u003e\n\u003cp\u003e\"Better now that I\u0027ve heard from you.\" Even over the phone line, Grace felt his smile.\u003c/p\u003e\n\u003cp\u003e\"Lisa called this afternoon. She wanted an update on what\u0027s happening between us.\"\u003c/p\u003e\n\u003cp\u003e\"What did you tell her?\" Grace carried the phone into the living room, sat on the sofa and moved Sherlock into her lap. The cat didn\u0027t like being disturbed, but settled down quickly enough.\u003c/p\u003e\n\u003cp\u003e\"The truth.\"\u003c/p\u003e\n\u003cp\u003e\"Which is?\" Grace asked, stroking glossy black fur.\u003c/p\u003e\n\u003cp\u003e\"That I can\u0027t seem to stop loving you, despite my best efforts.\"\u003c/p\u003e\n\u003cp\u003eGrace felt tears prick her eyes. \"I can\u0027t seem to stop loving you, either.\"\u003c/p\u003e\n\u003cp\u003eCliff exhaled softly. \"I know it\u0027s a little early, but I was hoping you could join me for Thanksgiving again this year.\"\u003c/p\u003e\n\u003cp\u003e\"Are you flying out to be with Lisa and her family?\"\u003c/p\u003e\n\u003cp\u003e\"No. Since I spent time with her this summer I\u0027ll probably just stay here.\"\u003c/p\u003e\n\u003cp\u003e\"Alone?\"\u003c/p\u003e\n\u003cp\u003eHe sighed. \"Not if I can help it.\"\u003c/p\u003e\n\u003cp\u003e\"Would you like to have dinner with me and the girls?\" Grace didn\u0027t know yet what her daughters\u0027 plans were, but it would be easy enough to find out.\u003c/p\u003e\n\u003cp\u003e\"Can I invite Cal, too?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\" Grace remembered that Cal was one of the bachelors who\u0027d been on the auction block. \"Speaking of Cal, has he gone out with Linnette McAfee yet?\"\u003c/p\u003e\n\u003cp\u003e\"Nope. I don\u0027t think she\u0027s too thrilled with her mother setting this up,\" Cliff said wryly. \"And Cal\u0027s blaming me, since I encouraged him to participate.\"\u003c/p\u003e\n\u003cp\u003e\"Is Linnette already living in Cedar Cove?\" Grace had been too busy to keep up with the latest regarding the clinic. She knew Linnette had accepted the job of physician\u0027s assistant. The lot had been cleared and the structure was going up so fast, it was hard to believe that just a few weeks earlier there\u0027d been absolutely nothing in that location.\u003c/p\u003e\n\u003cp\u003e\"Not yet. I gather she\u0027ll be moving here next month to help set things up. According to Charlotte, the clinic should be in full operation by the first of the year.\"\u003c/p\u003e\n\u003cp\u003e\u0027That\u0027s great. And I guess it means Cal will have his date soon.\"\u003c/p\u003e\n\u003cp\u003e\"Seems that way,\" Cliff said. \"Frankly I think it\u0027ll do him good.\"\u003c/p\u003e\n\u003cp\u003e\"I think so, too.\"\u003c/p\u003e\n\u003cp\u003e\"Will I see you before Thanksgiving?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Probably.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take that as a yes.\"\u003c/p\u003e\n\u003cp\u003e\"Do you want to come out here Friday afternoon after work?\"\u003c/p\u003e\n\u003cp\u003e\"I think that can be arranged,\" Grace said.\u003c/p\u003e\n\u003cp\u003eThey spoke for a few more minutes and by the time Grace hung up, she felt more hopeful than she had in days.\u003c/p\u003e\n\u003cp\u003eButtercup walked over to the sofa to receive her share of attention. Sherlock, still reclining on Grace\u0027s lap, lazily opened one eye but didn\u0027t object to Buttercup\u0027s presence. Grace stroked her dog\u0027s head, smiling. She\u0027d worked hard to regain Cliff\u0027s trust and was determined never to give him reason to doubt her again. This was one lesson she\u0027d learned and learned well.\u003c/p\u003e\n\u003cp\u003eFifty-Two\u003c/p\u003e\n\u003cp\u003eCorrie McAfee looked up from the playing cards in her hand and sighed as she tried to remember which suit went with which. Giving up, she stared helplessly across the table at Peggy, sending her a silent plea.\u003c/p\u003e\n\u003cp\u003eThe two couples had spent a delightful evening together and after dinner had decided to play pinochle. Corrie hadn\u0027t played in years, so her skills were weak, and unfortunately Roy took such games far too seriously. Peggy had been more than willing to be her partner, although Corrie could tell her friend\u0027s mind wasn\u0027t on the game. For that matter, neither was hers. \u003c/p\u003e","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-47.html","bookId":1944,"creation":"Oct 5, 2019 10:03:49 AM","modification":"Oct 5, 2019 10:03:49 AM"}
