{"id":67130,"no":48,"title":"Page 48","content":"\u003cp\u003e\"What\u0027s your bid?\" Roy helped himself to a pretzel as he studied his own hand. Her husband and Bob Beldon had walked away with the first three games and gloried in their triumph a little too much.\u003c/p\u003e\n\u003cp\u003e\"You guys have already won three in a row,\" Corrie said. \"I think Peggy and I could use a break.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, it\u0027s just getting good,\" Bob protested.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll make some popcorn,\" Corrie said, hoping the two men would be willing to put the game aside for that long.\u003c/p\u003e\n\u003cp\u003e\"All right, all right,\" Roy muttered, not concealing his disappointment. He could be so competitive sometimes.\u003c/p\u003e\n\u003cp\u003ePeggy followed Corrie into the kitchen and leaned against the counter as Corrie set up the hot air popcorn popper. She took a stick of butter from the fridge and cut a generous cube to melt in the microwave. \"I can\u0027t bear to eat popcorn without real butter,\" she explained. With the machine making its usual racket, Corrie joined her friend at the counter.\u003c/p\u003e\n\u003cp\u003e\"I still can\u0027t believe it...\" Peggy let the words fade.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re in shock about Hannah, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003ePeggy nodded. \"Not for even a second did I suspect she was capable of murder.\"\u003c/p\u003e\n\u003cp\u003e\"Have you been to see her at the jail?\"\u003c/p\u003e\n\u003cp\u003ePeggy shook her head. \"She\u0027s refused all visitors, including me.\"\u003c/p\u003e\n\u003cp\u003eThat must be hurtful to Peggy, Corrie thought as she dumped the popcorn in a large bowl and poured on the melted butter.\u003c/p\u003e\n\u003cp\u003e\"I talked to Troy Davis earlier in the week and he told me Hannah\u0027s decided to take a plea bargain. Once all the legalities have been dealt with, she\u0027ll be transferred to the women\u0027s prison in Purdy.\"\u003c/p\u003e\n\u003cp\u003e\"I can only imagine how difficult this must be for you,\" Corrie said sympathetically. Peggy had grown close to Hannah over the last few weeks. The horror of learning that the young woman was responsible for her parents\u0027 deaths had, needless to say, distressed her. At this stage, Peggy couldn\u0027t influence the girl\u0027s situation at all. The authorities in California had been notified and were in the process of arresting the friend who\u0027d tampered with her father\u0027s car and bought her the drug. Extradition papers would be filed against Hannah soon. Unless a deal could be made, she\u0027d stand trial in her home state of California.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so sorry,\" Corrie whispered, touching her friend\u0027s arm.\u003c/p\u003e\n\u003cp\u003e\"I know. I am, too. She\u0027s ruined her entire life.\" Peggy bowed her head for a moment, then looked up. \"What I want to know is when Roy and the sheriff figured it out.\"\u003c/p\u003e\n\u003cp\u003eNot sure what to tell her, Corrie shrugged. \"I can\u0027t answer that. Although we work in the same office, my husband usually keeps his suspicions to himself. Half the time I don\u0027t have a clue what\u0027s going through that thick head of his. What I can tell you is that he and Troy discussed the case now and then and compared notes.\"\u003c/p\u003e\n\u003cp\u003ePeggy\u0027s expression was pained, as if she was reliving the moment of Hannah\u0027s arrest.\u003c/p\u003e\n\u003cp\u003e\"My guess is that Roy and the sheriff went over their ideas together and came to the same conclusion,\" Corrie said.\u003c/p\u003e\n\u003cp\u003e\"Are you talking about me and my brilliant mind again?\" Roy asked as he stepped into the kitchen, Bob directly behind him.\u003c/p\u003e\n\u003cp\u003e\"Obviously we\u0027ve so outplayed you women that you\u0027re ready to admit defeat,\" Bob said smugly.\u003c/p\u003e\n\u003cp\u003e\"We could always put on a DVD,\" Roy suggested, scooping up a handful of buttered popcorn. \"Nothing goes better with popcorn than a movie.\"\u003c/p\u003e\n\u003cp\u003eBob yawned. \"I don\u0027t know if we should. It\u0027s getting to be the witching hour for me.\"\u003c/p\u003e\n\u003cp\u003e\"Me, too,\" Peggy said reluctantly. She turned to Corrie. \"Dinner was wonderful. An evening out was just what Bob and I needed to get our minds off this mess.\"\u003c/p\u003e\n\u003cp\u003e\"It was our pleasure,\" Roy said. He slipped his arm around Corrie\u0027s waist and they accompanied their friends to the front door. When Corrie had retrieved their jackets from the hall closet, Roy politely held Peggy\u0027s for her.\u003c/p\u003e\n\u003cp\u003e\"Look,\" Peggy said when they opened the door. \"Someone left you a gift.\"\u003c/p\u003e\n\u003cp\u003eA beautifully arranged fruit basket stood on the porch. Filled with apples, oranges, bananas, grapes and a variety of nuts and chocolate, it was wrapped in silvery cellophane and decorated with a large plaid bow.\u003c/p\u003e\n\u003cp\u003e\"Who would send us something like this?\" Corrie asked, surprised and pleased, but when she bent to reach for it, Roy stopped her.\u003c/p\u003e\n\u003cp\u003e\"A more important question is who\u0027d drop it off without ringing our doorbell?\" His arm restrained her from lifting the basket. \"Leave it where it is,\" he said, frowning.\u003c/p\u003e\n\u003cp\u003eCorrie stared at her husband. \"Do you think it\u0027s the same person who mailed us those postcards?\" she asked, her voice low.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"It looks like there\u0027s a card with the fruit,\" Peggy said.\u003c/p\u003e\n\u003cp\u003eBefore Roy could object, Peggy pulled it from the basket. Corrie blinked, half-afraid something might explode in her friend\u0027s face. She sighed with relief when nothing happened.\u003c/p\u003e\n\u003cp\u003e\"Maybe it\u0027s an early Thanksgiving gift.\" Peggy handed the card to Roy. \"We\u0027d better go.\"\u003c/p\u003e\n\u003cp\u003eBob nodded and after another round of thank-yous and farewells, they headed toward their car.\u003c/p\u003e\n\u003cp\u003e\"Open it,\" Corrie said even before the Beldons had pulled away from the curb.\u003c/p\u003e\n\u003cp\u003e\"In a minute,\" Roy muttered. He stepped into the house and Corrie followed him. Roy examined the envelope. It was addressed to the McAfees at 50 Harbor Street\u003c/p\u003e\n\u003cp\u003e, so the fruit had been delivered to the right house. Roy held the small envelope up to a light before he tore it open.\u003c/p\u003e\n\u003cp\u003eInside was a single piece of typed paper.\u003c/p\u003e\n\u003cp\u003e\"What does it say?\" Corrie asked urgently. She didn\u0027t want Roy hiding anything from her. It was only by chance that she\u0027d learned about the postcards.\u003c/p\u003e\n\u003cp\u003eRoy scanned the letter and gave it to her.\u003c/p\u003e\n\u003cp\u003eI don\u0027t mean you any ill will. I just want you to think about what you did. Don\u0027t you have a single regret?\u003c/p\u003e\n\u003cp\u003eCorrie quickly read the note and looked up at her husband with frightened eyes. \"What does this mean?\" she asked.\u003c/p\u003e\n\u003cp\u003eRoy shook his head. \"I have no idea. I guess we\u0027ll have to wait for the next message.\"\u003c/p\u003e\n\u003cp\u003eHe placed his arm around Corrie\u0027s waist. He didn\u0027t have the answer yet, but he would soon. He\u0027d cleared too many cases not to succeed at solving this one.\u003c/p\u003e\n\u003cp\u003eWhoever was doing this, it was personal. Sending the fruit basket to 50 Harbor Street\u003c/p\u003e\n\u003cp\u003ehad breached the sanctity of his home. But he\u0027d find out who\u0027d done this.\u003c/p\u003e\n\u003cp\u003eHis instincts still told him that he and Corrie weren\u0027t in physical danger. But there were other dangers, less obvious ones, and Roy knew they could cause just as much harm.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t prepared to let anyone risk the haven he and Corrie had found in Cedar Cove. \u003c/p\u003e","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-48.html","bookId":1944,"creation":"Oct 5, 2019 10:03:49 AM","modification":"Oct 5, 2019 10:03:49 AM"}
