{"id":67090,"no":8,"title":"Page 8","content":"\u003cp\u003e\"Out of sight, out of mind?\"\u003c/p\u003e\n\u003cp\u003e\"Not exactly,\" he said with a chuckle.\u003c/p\u003e\n\u003cp\u003eMaryellen took his advice and decided to start in the master bedroom. The kitchen could wait; besides, that area was Jon\u0027s domain. He was the cook in the family, although she was willing to do her share of meal preparation. Marriage to her was a partnership, and Maryellen had every intention of being a good wife. If that meant chopping pounds of onions, well.. .she\u0027d do it. In fact, she\u0027d do anything to make her marriage as strong and healthy as possible.\u003c/p\u003e\n\u003cp\u003eShe climbed the stairs to the bedroom, then paused in the doorway, hands on her hips, as she surveyed the room where she\u0027d soon be sleeping. The photograph Jon had taken of her months earlier hung on the wall by the bed. It showed her in a rocking chair nursing Katie when their daughter was a newborn. He\u0027d managed to capture the wonder and awe and love she felt, holding this tiny being in her arms. She\u0027d hardly been conscious of Jon\u0027s presence at the time, so absorbed was she by Katie.\u003c/p\u003e\n\u003cp\u003eIt gave her immeasurable joy to place her clothes in the closet next to Jon\u0027s. She carefully pushed his shirts aside and her hand lingered there. In two days\u0027 time, she would be Jon Bowman\u0027s wife. She felt a renewed sense of anticipation— and a surge of love for the man who\u0027d fathered her child.\u003c/p\u003e\n\u003cp\u003eShe opened the dresser drawers and started rearranging his things and making room for her own. That was when she found the letters. Tucked in with old receipts, maps and loose change were a number of envelopes. Most had been opened but a few remained sealed. Curiosity got the better of her and she pulled out a sheet, but then she paused. She refused to begin her marriage with an act of deception— snooping through letters that were addressed to Jon, not to her. Unsure what to do, she stacked them in a neat pile and set them to one side.\u003c/p\u003e\n\u003cp\u003eShe heard the front door open and Jon calling up the stairs. \"I\u0027m ready for a break. How about you?\"\u003c/p\u003e\n\u003cp\u003eShe walked out of the bedroom to stand at the railing and looked down. \"Be with you in a minute. I\u0027m just finishing up here.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"I found a bunch of letters in a drawer. Is there any place you want me to put them?\"\u003c/p\u003e\n\u003cp\u003eHe frowned, hesitated and then shrugged. \"Toss \u0027em.\"\u003c/p\u003e\n\u003cp\u003e\"In the garbage?\"\u003c/p\u003e\n\u003cp\u003eNodding, he turned and walked into the kitchen.\u003c/p\u003e\n\u003cp\u003e\"Who are they from?\"\u003c/p\u003e\n\u003cp\u003e\"No one important,\" he shouted back.\u003c/p\u003e\n\u003cp\u003e\"An old girlfriend?\" she pressed.\u003c/p\u003e\n\u003cp\u003eHe snickered loudly enough for her to hear him all the way up the stairs. \"Hardly. Just get rid of the whole bunch.\"\u003c/p\u003e\n\u003cp\u003eMaryellen dumped the letters into the plastic garbage bag, but then she couldn\u0027t resist. She plucked out the top one and looked at the return address. It was from the small coastal town of Seal Beach, Oregon. Years ago Maryellen had driven through it along Highway 1. She\u0027d stopped for gas and lunch, and for some reason she\u0027d never forgotten the town.\u003c/p\u003e\n\u003cp\u003e\"Who do you know in Seal Beach?\" she called down, reluctant to drop the matter. She began to descend the stairs, still clutching the letters.\u003c/p\u003e\n\u003cp\u003eJon stepped out of the kitchen. \"You aren\u0027t going to let this rest, are you?\"\u003c/p\u003e\n\u003cp\u003eShe slid her hand down the smooth oak banister as she walked. \"I can\u0027t help being curious. You\u0027d feel the same if it was me.\"\u003c/p\u003e\n\u003cp\u003eJon shook his head, scowling. \"I should\u0027ve ditched those a long time ago. They\u0027re from my parents.\"\u003c/p\u003e\n\u003cp\u003e\"Some of them haven\u0027t even been opened.\"\u003c/p\u003e\n\u003cp\u003eHe stared up at her. \"My father and stepmother are out of my life, Maryellen. They made their choice and I made mine. I want nothing more to do with either of them. Now, please just get rid of those letters, and don\u0027t mention them again.\"\u003c/p\u003e\n\u003cp\u003e\"But—\"\u003c/p\u003e\n\u003cp\u003e\"Maryellen, please.\"\u003c/p\u003e\n\u003cp\u003e\"If you insist.\" And this time she buried the letters in the bottom of the bag.\u003c/p\u003e\n\u003cp\u003eAn hour later, her clothes hung next to Jon\u0027s in the big closet. The dresser drawers were full. At first glance it seemed as if she\u0027d always lived with Jon, always been part of his home and his life. That gave her a feeling of contentment and somehow made their coming marriage even more real.\u003c/p\u003e\n\u003cp\u003eThey ate dinner together, and sipped wine on the upstairs balcony that overlooked the water. Completely at ease, Maryellen laid her head against his shoulder. Jon\u0027s arm was around her, his long legs stretched out in front of him. The moment was so tranquil, she didn\u0027t immediately realize Jon had fallen asleep.\u003c/p\u003e\n\u003cp\u003eIt was just as well. She needed to get back to her mother\u0027s house, spend some time with Katie. By now her daughter would be cranky, and Maryellen didn\u0027t want to take advantage of her mother\u0027s generosity.\u003c/p\u003e\n\u003cp\u003eKissing Jon on the cheek, she slipped out of his arms and sneaked down the stairs, making as little noise as possible. She hated to leave, but in two days she\u0027d be with Jon forever....\u003c/p\u003e\n\u003cp\u003eJust as she\u0027d predicted, Katie was difficult and unreasonable that night, and her mother was exhausted. As soon as Maryellen reached for Katie, the baby settled against her shoulder, put her thumb in her mouth and promptly fell asleep. Maryellen rocked her for a few minutes, gently rubbing Katie\u0027s back.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe one tiny baby could have so much energy.\" Grace sat down in her favorite chair, head thrown back, eyes closed. Opening them again, she said, \"You look at peace.\"\u003c/p\u003e\n\u003cp\u003e\"I am at peace, and so much in love.\"\u003c/p\u003e\n\u003cp\u003eGrace\u0027s eyes grew moist. \"I hope you\u0027ll always be as happy as you are now.\"\u003c/p\u003e\n\u003cp\u003eMaryellen lowered her gaze.\u003c/p\u003e\n\u003cp\u003eHer mother understood her perfectly. \"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"Jon. I found a stack of letters, several of which he hadn\u0027t even bothered to open.\"\u003c/p\u003e\n\u003cp\u003e\"Letters? From whom?\"\u003c/p\u003e\n\u003cp\u003e\"His parents. I badly wanted to read them but I didn\u0027t. Jon told me to throw them out.\" Her mother knew about Jon\u0027s situation and the way his parents had betrayed him.\u003c/p\u003e\n\u003cp\u003e\"Did you?\"\u003c/p\u003e\n\u003cp\u003eMaryellen nodded. \"1 didn\u0027t want to start our marriage off by being dishonest.\"\u003c/p\u003e\n\u003cp\u003e\"It seems to me that if Jon has no feelings for his family, he wouldn\u0027t have saved those letters.\"\u003c/p\u003e\n\u003cp\u003e\"I felt the same thing.\" Maryellen gnawed on her lower lip. \"I didn\u0027t need to read them to know what they said. Jon\u0027s their only family now and they want his forgiveness. They want their son back.\"\u003c/p\u003e\n\u003cp\u003e\"They have a granddaughter they don\u0027t know anything about.\"\u003c/p\u003e\n\u003cp\u003e\"Yes...\"\u003c/p\u003e\n\u003cp\u003e\"And you, Maryellen. They\u0027ll be your in-laws.\"\u003c/p\u003e\n\u003cp\u003eIt hurt her to think of Jon rejecting his parents\u0027 attempts at reconciliation—less for their sake than for his. Jon would never be free of the past until he could find a way to forgive his parents.\u003c/p\u003e\n\u003cp\u003eHer mother seemed deep in thought. \"I couldn\u0027t bear the idea of anyone keeping me from my grandchildren,\" she said softly.\u003c/p\u003e\n\u003cp\u003eThat was another point she should consider. Jon might not want anything to do with his family, but his parents had a right to know about Katie. And Katie had a right to know her grandparents.\u003c/p\u003e\n\u003cp\u003eThat evening, Maryellen wrote Jon\u0027s family. The letter was brief. She\u0027d memorized the post office box number and the zip code, and that was all she needed. She included a picture of her and Katie and a short message about how well Jon\u0027s career was going. Wanting to be sensitive to her husband\u0027s feelings, she stated that it would be best if they didn\u0027t contact her. She did promise, however, to send them occasional photographs of their granddaughter.\u003c/p\u003e\n\u003cp\u003eThe next morning as Maryellen drove to the post office, she wondered if she was doing the right thing. On the one hand, she knew Jon would disapprove; on the other, she felt his parents deserved some compassion. And what about Katie? What about her future happiness?\u003c/p\u003e\n\u003cp\u003eThe letter slid into the mailbox slot, and whether she was right or wrong remained undecided. Either way, it was too late.\u003c/p\u003e\n\u003cp\u003eEight\u003c/p\u003e\n\u003cp\u003eThe Dog and Bachelor Auction had already generated a lot of interest in Cedar Cove. Grace Sherman displayed a large notice in the library and Janet had asked her to deliver posters to the businesses around town. Thursday afternoon, the first week of June, Grace dedicated her lunch hour to making sure the community had all the relevant details.\u003c/p\u003e\n\u003cp\u003eThe Lighthouse Restaurant was her first stop. She waited at the hostess\u0027s desk for the young woman to return from seating a couple. Staring out the large windows she admired the view of the water and the Bremerton shipyard on the other side of the cove. Several people were in line ahead of her, but Grace wasn\u0027t really in a rush. She needed to speak to either Seth or Justine to confirm that she could place the large poster in the front window and to finalize some details concerning the special menu being created for the event. For now, she was simply enjoying the vista of sea and vibrant blue sky, with the snow-capped Olympic Mountains in the background. Seth and Justine had done an impressive job of reflecting their surroundings in the architecture and decor of the restaurant.\u003c/p\u003e\n\u003cp\u003eThe door opened behind her, but Grace was so absorbed in the view that she didn\u0027t pay attention.\u003c/p\u003e\n\u003cp\u003e\"Hello, Grace.\"\u003c/p\u003e\n\u003cp\u003eHer heart leapt into her throat as she turned to greet Cliff Harding. \"Hello, Cliff.\" He was as attractive as ever, with his broad shoulders and dark eyes. He wore jeans and a tan jacket with one button fastened. His cowboy hat rested slightly forward, shading his face.\u003c/p\u003e\n\u003cp\u003eThey stared at each other as if neither knew what else to say. Grace wanted to talk, but her tongue felt as if it had grown twice its normal size and refused to cooperate. It\u0027d been weeks since she\u0027d last seen Cliff. In that time she\u0027d grown accustomed to being alone. Accustomed to filling her days and nights with charity projects and anything that kept her mind off what she\u0027d done to destroy their relationship.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re looking well,\" he said after an awkward moment.\u003c/p\u003e\n\u003cp\u003e\"You, too.\"\u003c/p\u003e\n\u003cp\u003eHe smiled regretfully. \"So Maryellen and Jon were married last weekend.\"\u003c/p\u003e\n\u003cp\u003eMoisture found its way into Grace\u0027s mouth and she nodded. \"Yes. The ceremony was lovely. They held the wedding on Jon\u0027s property. My daughter was a beautiful bride.\" These slightly stilted, staccato sentences were the best she could do.\u003c/p\u003e\n\u003cp\u003e\"I wish them both my very best.\"\u003c/p\u003e\n\u003cp\u003eGrace knew he did. \"Katie didn\u0027t make a sound the entire time.\"\u003c/p\u003e\n\u003cp\u003eCliff slid his gaze past her. \"Please thank Maryellen for the invitation.\"\u003c/p\u003e\n\u003cp\u003eGrace didn\u0027t realize her daughter had sent him one.\u003c/p\u003e\n\u003cp\u003eHe removed his hat and held it with both hands. \"I didn\u0027t attend for... obvious reasons.\"\u003c/p\u003e\n\u003cp\u003eGrace looked away.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t want to do anything to make you feel ill-at-ease,\" he explained. \u0027This was a happy day for you, as well as for Maryellen and Jon. I thought it might be uncomfortable for us both if I showed up.\"\u003c/p\u003e\n\u003cp\u003eHe was right, of course. \"That was thoughtful of you,\" she murmured.\u003c/p\u003e\n\u003cp\u003eThe silence stretched between them. Then, as if she\u0027d suddenly remembered the reason she was at The Lighthouse, she said brightly, perhaps too brightly, \"I understand you\u0027re going to be part of the Dog and Bachelor Auction.\"\u003c/p\u003e\n\u003cp\u003eCliff shifted his weight. \"I was approached but I declined.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" His name had been the first one mentioned. She wondered how long it would be before she could tolerate the thought of Cliff with another woman. Not anytime soon. The ache in the pit of her stomach told her that.\u003c/p\u003e\n\u003cp\u003eWas it her imagination or did his color heighten at her question? \"I didn\u0027t see much point in making a bigger fool of myself than I normally do.\"\u003c/p\u003e\n\u003cp\u003e\"But Cliff, it\u0027s for charity.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/44-cranberry-point-cedar-cove-4/page-8.html","bookId":1944,"creation":"Oct 5, 2019 10:03:49 AM","modification":"Oct 5, 2019 10:03:49 AM"}
