{"id":37554,"no":32,"title":"CHAPTER XXXII. SHOWING THAT THE AGE OF MAGIC AND MAGICIANS IS NOT YET OVER.","content":"\u0026nbsp;While speaking or rather hissing those words, the boon companion underwent much such a change as one reads of in fairy-books. Out of old materials sprang a new creature. Cadmus glided into the snake. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The cosmopolitan rose, the traces of previous feeling vanished; looked steadfastly at his transformed friend a moment, then, taking ten half-eagles from his pocket, stooped down, and laid them, one by one, in a circle round him; and, retiring a pace, waved his long tasseled pipe with the air of a necromancer, an air heightened by his costume, accompanying each wave with a solemn murmur of cabalistical words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meantime, he within the magic-ring stood suddenly rapt, exhibiting every symptom of a successful charm—a turned cheek, a fixed attitude, a frozen eye; spellbound, not more by the waving wand than by the ten invincible talismans on the floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Reappear, reappear, reappear, oh, my former friend! replace this hideous apparition with thy blest shape, and be the token of thy return the words, \u0027My dear Frank.\u0027\" [283]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My dear Frank,\" now cried the restored friend, cordially stepping out of the ring, with regained self-possession regaining lost identity, \"My dear Frank, what a funny man you are; full of fun as an egg of meat. How could you tell me that absurd story of your being in need? But I relish a good joke too well to spoil it by letting on. Of course, I humored the thing; and, on my side, put on all the cruel airs you would have me. Come, this little episode of fictitious estrangement will but enhance the delightful reality. Let us sit down again, and finish our bottle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"With all my heart,\" said the cosmopolitan, dropping the necromancer with the same facility with which he had assumed it. \"Yes,\" he added, soberly picking up the gold pieces, and returning them with a chink to his pocket, \"yes, I am something of a funny man now and then; while for you, Charlie,\" eying him in tenderness, \"what you say about your humoring the thing is true enough; never did man second a joke better than you did just now. You played your part better than I did mine; you played it, Charlie, to the life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You see, I once belonged to an amateur play company; that accounts for it. But come, fill up, and let\u0027s talk of something else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" acquiesced the cosmopolitan, seating himself, and quietly brimming his glass, \"what shall we talk about?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, anything you please,\" a sort of nervously accommodating.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, suppose we talk about Charlemont?\" [284]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Charlemont? What\u0027s Charlemont? Who\u0027s Charlemont?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You shall hear, my dear Charlie,\" answered the cosmopolitan. \"I will tell you the story of Charlemont, the gentleman-madman.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2833/78349.html","bookId":1238,"creation":"Aug 5, 2019 8:02:31 AM","modification":"Aug 5, 2019 8:02:31 AM"}
