{"id":37530,"no":8,"title":"CHAPTER VIII. A CHARITABLE LADY.","content":"\u0026nbsp;If a drunkard in a sober fit is the dullest of mortals, an enthusiast in a reason-fit is not the most lively. And this, without prejudice to his greatly improved understanding; for, if his elation was the height of his madness, his despondency is but the extreme of his sanity. Something thus now, to all appearance, with the man in gray. Society his stimulus, loneliness was his lethargy. Loneliness, like the sea breeze, blowing off from a thousand leagues of blankness, he did not find, as veteran solitaires do, if anything, too bracing. In short, left to himself, with none to charm forth his latent lymphatic, he insensibly resumes his original air, a quiescent one, blended of sad humility and demureness. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ere long he goes laggingly into the ladies\u0027 saloon, as in spiritless quest of somebody; but, after some disappointed glances about him, seats himself upon a sofa with an air of melancholy exhaustion and depression.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At the sofa\u0027s further end sits a plump and pleasant person, whose aspect seems to hint that, if she have any weak point, it must be anything rather than her excellent [67] heart. From her twilight dress, neither dawn nor dark, apparently she is a widow just breaking the chrysalis of her mourning. A small gilt testament is in her hand, which she has just been reading. Half-relinquished, she holds the book in reverie, her finger inserted at the xiii. of 1st Corinthians, to which chapter possibly her attention might have recently been turned, by witnessing the scene of the monitory mute and his slate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The sacred page no longer meets her eye; but, as at evening, when for a time the western hills shine on though the sun be set, her thoughtful face retains its tenderness though the teacher is forgotten.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meantime, the expression of the stranger is such as ere long to attract her glance. But no responsive one. Presently, in her somewhat inquisitive survey, her volume drops. It is restored. No encroaching politeness in the act, but kindness, unadorned. The eyes of the lady sparkle. Evidently, she is not now unprepossessed. Soon, bending over, in a low, sad tone, full of deference, the stranger breathes, \"Madam, pardon my freedom, but there is something in that face which strangely draws me. May I ask, are you a sister of the Church?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why—really—you—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In concern for her embarrassment, he hastens to relieve it, but, without seeming so to do. \"It is very solitary for a brother here,\" eying the showy ladies brocaded in the background, \"I find none to mingle souls with. It may be wrong—I know it is—but I cannot force myself to be easy with the people of the world. [68] I prefer the company, however silent, of a brother or sister in good standing. By the way, madam, may I ask if you have confidence?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really, sir—why, sir—really—I—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Could you put confidence in me for instance?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really, sir—as much—I mean, as one may wisely put in a—a—stranger, an entire stranger, I had almost said,\" rejoined the lady, hardly yet at ease in her affability, drawing aside a little in body, while at the same time her heart might have been drawn as far the other way. A natural struggle between charity and prudence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Entire stranger!\" with a sigh. \"Ah, who would be a stranger? In vain, I wander; no one will have confidence in me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You interest me,\" said the good lady, in mild surprise. \"Can I any way befriend you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No one can befriend me, who has not confidence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I—I have—at least to that degree—I mean that——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nay, nay, you have none—none at all. Pardon, I see it. No confidence. Fool, fond fool that I am to seek it!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are unjust, sir,\" rejoins the good lady with heightened interest; \"but it may be that something untoward in your experiences has unduly biased you. Not that I would cast reflections. Believe me, I—yes, yes—I may say—that—that——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That you have confidence? Prove it. Let me have twenty dollars.\" [69]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Twenty dollars!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There, I told you, madam, you had no confidence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The lady was, in an extraordinary way, touched. She sat in a sort of restless torment, knowing not which way to turn. She began twenty different sentences, and left off at the first syllable of each. At last, in desperation, she hurried out, \"Tell me, sir, for what you want the twenty dollars?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And did I not——\" then glancing at her half-mourning, \"for the widow and the fatherless. I am traveling agent of the Widow and Orphan Asylum, recently founded among the Seminoles.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And why did you not tell me your object before?\" As not a little relieved. \"Poor souls—Indians, too—those cruelly-used Indians. Here, here; how could I hesitate. I am so sorry it is no more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Grieve not for that, madam,\" rising and folding up the bank-notes. \"This is an inconsiderable sum, I admit, but,\" taking out his pencil and book, \"though I here but register the amount, there is another register, where is set down the motive. Good-bye; you have confidence. Yea, you can say to me as the apostle said to the Corinthians, \u0027I rejoice that I have confidence in you in all things.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2833/78325.html","bookId":1238,"creation":"Aug 5, 2019 8:02:30 AM","modification":"Aug 5, 2019 8:02:30 AM"}
