{"id":72870,"no":10,"title":"Page 10","content":"\u003cp\u003eThe family honor now rested in Jason’s hands.\u003c/p\u003e\n\u003cp\u003eJason.\u003c/p\u003e\n\u003cp\u003e“Rich.” Jamie’s voice cut into his thoughts. “Don’t worry, I’ll have a witness.”\u003c/p\u003e\n\u003cp\u003eRich got dressed in a hurry, his movements filled with purpose.\u003c/p\u003e\n\u003cp\u003eHe grabbed his raincoat on his way out the door and found himself whistling once more as he unlocked his car. He checked his watch and realized he had plenty of time. More time than he knew what to do with.\u003c/p\u003e\n\u003cp\u003eHe drove to his brother’s veterinary hospital in the south end of Seattle. There he saw three people in the waiting room. Two in the section marked Dogs and one little old lady clinging tightly to her cat on the other side of the room.\u003c/p\u003e\n\u003cp\u003e“Is Jason in?” he asked the receptionist.\u003c/p\u003e\n\u003cp\u003e“He’s with a Saint Bernard, but he’ll be out soon.”\u003c/p\u003e\n\u003cp\u003eSure enough, Jason appeared five minutes later. He wore a white lab coat, but underneath, Rich knew he had on jeans and a T-shirt.\u003c/p\u003e\n\u003cp\u003e“Rich, what are you doing here?”\u003c/p\u003e\n\u003cp\u003e“Can you take an hour off later today?”\u003c/p\u003e\n\u003cp\u003e“You buying me lunch?” Jason asked.\u003c/p\u003e\n\u003cp\u003e“No. I need you to be the best man at my wedding.”\u003c/p\u003e\n\u003cp\u003eFive\u003c/p\u003e\n\u003cp\u003eJamie was at the courthouse at the agreed-upon time, pacing the corridor outside Judge Webster’s chambers. Ten to two.\u003c/p\u003e\n\u003cp\u003eShe was there, but Rich wasn’t.\u003c/p\u003e\n\u003cp\u003eIf he left her standing at the altar—so to speak—she’d personally see to his tar and feathering.\u003c/p\u003e\n\u003cp\u003eShe called his cell phone. No answer.\u003c/p\u003e\n\u003cp\u003eFor the tenth time, she checked her watch.\u003c/p\u003e\n\u003cp\u003eSeven minutes late. The man would pay for this.\u003c/p\u003e\n\u003cp\u003eA woman Jamie assumed was the judge’s secretary stepped into the hallway. “It’s almost two. The judge can see you now.”\u003c/p\u003e\n\u003cp\u003e“Ah…hello,” Jamie said, giving the middle-aged woman her brightest smile. “My… The man I’m going to marry seems to have been detained. I’m sure he’ll be here any second.”\u003c/p\u003e\n\u003cp\u003e“I see.” She glanced at her watch as though to say the judge was a busy man.\u003c/p\u003e\n\u003cp\u003e“I’m sure he’ll be here,” she repeated. A slow death would be too good for Rich Manning if he wasn’t. “I was wondering…when Rich does arrive, would it be possible for you to be my witness?” She shouldn’t have left it to the last minute like this, but she hadn’t known who to ask.\u003c/p\u003e\n\u003cp\u003e“Of course.” The gray-haired woman returned Jamie’s smile. “Let me know as soon as your young man shows up.”\u003c/p\u003e\n\u003cp\u003e“I will, thank you.”\u003c/p\u003e\n\u003cp\u003eJamie tried his cell again, and again he didn’t answer. She resumed her pacing. She’d made the mistake of asking for the whole day off. If she’d only taken half a day, she wouldn’t have all this time to contemplate what she was doing. In the last five minutes she’d vacillated between thinking marriage was the best solution and feeling convinced that it was the most foolish decision she’d ever made.\u003c/p\u003e\n\u003cp\u003e“Jamie.” Breathless, Rich came around the corner at a half run.\u003c/p\u003e\n\u003cp\u003e“Where have you been?” she cried, her voice cracking under the strain. She was caught halfway between abject relief and total fury. Halfway between hope and despair, trapped in a world of nagging questions and second thoughts.\u003c/p\u003e\n\u003cp\u003eRich pulled her into his arms and hugged her close. His breathing was labored, as though he’d raced up several flights of stairs. “I got stuck in traffic.”\u003c/p\u003e\n\u003cp\u003eJamie was about to chastise him for not allowing enough time, but she swallowed her irritation. What did it matter? He was there now. Suddenly she felt a relief so great all she wanted to do was wrap her arms around him and weep.\u003c/p\u003e\n\u003cp\u003e“Judge Webster’s secretary said we should go into his office as soon as you arrived,” she said, composing herself.\u003c/p\u003e\n\u003cp\u003e“Just a minute. We have to wait for my witness,” Rich said, smiling down at her. His beautiful blue gaze was filled with a teasing light.\u003c/p\u003e\n\u003cp\u003e“You actually brought someone with you? Who?”\u003c/p\u003e\n\u003cp\u003e“Me,” Jason Manning said, hurrying around the same corner Rich had a moment earlier. He, too, was out of breath. “Rich left me to park the car,” he said, pressing his hand over his heart. “Said if he was late for his wedding, you’d skin him alive.”\u003c/p\u003e\n\u003cp\u003e“He was right, too.”\u003c/p\u003e\n\u003cp\u003eJamie’s gaze flew to Rich, whose expression was both tender and amused. He’d brought family! They’d discussed the subject at length and had agreed not to let any of their immediate relatives in on their plans. Not until it was necessary, which they’d calculated would be when Jamie entered the fifth or sixth month of her pregnancy.\u003c/p\u003e\n\u003cp\u003e“Bringing Jason seemed like a good idea at the time,” Rich said with a chagrined look. “He spent half the morning arguing with me. According to Jason, we’re both candidates for the loony bin.”\u003c/p\u003e\n\u003cp\u003e“We weren’t going to tell anyone, remember?” They’d decided that the fewer people who were in on this, the better. But at the rate Rich was telling people, Jamie wouldn’t be surprised to see her picture splashed across the front of a grocery-store tabloid.\u003c/p\u003e\n\u003cp\u003e“Don’t worry,” Jason inserted smoothly, “I’ve been sworn to secrecy.”\u003c/p\u003e\n\u003cp\u003e“I’ll explain everything later,” Rich promised in a low voice. He draped his arm over her shoulder and inhaled noisily, as though he still needed to catch his breath. “But right now, we’ve got a wedding to attend.”\u003c/p\u003e\n\u003cp\u003eJamie knew the ceremony itself wouldn’t last more than a few minutes; she’d taken comfort in that. They’d be in and out of the judge’s chambers in five minutes, ten at the most.\u003c/p\u003e\n\u003cp\u003eThey stood before Judge Webster, their backs stiff and straight. The judge attempted to reassure them with a smile.\u003c/p\u003e\n\u003cp\u003eJamie needed to be reassured. Her knees were shaking, her hands trembled and she wasn’t sure she’d be able to go through with this.\u003c/p\u003e\n\u003cp\u003eWhen it came time to repeat her vows, she hesitated and raised her eyes to Rich. How could she promise to love him and honor him for the rest of their lives, knowing full well their marriage wouldn’t last the year?\u003c/p\u003e\n\u003cp\u003eRich must have read her confusion and her fears. Some unfathomable emotion flickered in his eyes, and she wondered if he was experiencing the same doubts. When his hold on her hand tightened, Jamie was grateful. She felt the need to be close to him. She didn’t know why, any more than she understood the reason she’d agreed to go through with this wedding ceremony.\u003c/p\u003e\n\u003cp\u003eWhen she spoke, her voice shook, then steadied and grew strong. Her heart was pounding, then gradually returned to a normal, even beat. She realized that the calmness she felt, the serenity, had come from Rich. His eyes didn’t leave her, and his own voice was confident and sure.\u003c/p\u003e\n\u003cp\u003eThey exchanged rings, his hand holding hers as he slipped the delicate diamond that had belonged to his grandmother onto Jamie’s finger. He revealed no hesitation. Once the ring was secure, her gaze slowly traveled up to his face. She stopped at his eyes, so blue and clear. They were just as steady as his hand.\u003c/p\u003e\n\u003cp\u003eThe judge pronounced them husband and wife, and with a naturalness Jamie didn’t question, Rich drew her into his embrace. Her hands gripped his shoulders as he lowered his mouth to hers. To the best of Jamie’s memory, this was the first time they’d kissed, really kissed.\u003c/p\u003e\n\u003cp\u003eRich made it worth the wait.\u003c/p\u003e\n\u003cp\u003eHis mouth slid possessively over hers, coaxing open her lips. His own were warm and moist, gentle and teasing, giving and demanding.\u003c/p\u003e\n\u003cp\u003eJamie was overwhelmed by the variety of sensations he evoked. She felt light-headed and giddy. Appreciated and adored. It seemed that her entire world had been inadvertently turned upside down and she was groping to find her balance.\u003c/p\u003e\n\u003cp\u003eShe shouldn’t feel this way, she told herself. She shouldn’t be feeling any of these sensations. Rich didn’t love her—not like this. Nothing like this. One kiss, and he made her feel as though she’d never been kissed before, as though she’d never experienced love before.\u003c/p\u003e\n\u003cp\u003eMaybe she hadn’t. Maybe this was all in her imagination, her mind creating a warm romantic fantasy in order to appease her conscience. Maybe this was a subconscious effort to wipe out the ambivalence she’d felt during the ceremony.\u003c/p\u003e\n\u003cp\u003eThe sound of Rich’s older brother clearing his throat brought Jamie back to reality. Rich—her husband—reluctantly let her go and just as reluctantly turned his attention to Judge Webster. The two men exchanged handshakes.\u003c/p\u003e\n\u003cp\u003e“Thank you so much for being my witness,” Jamie said to Judge Webster’s secretary. She never did catch the woman’s name.\u003c/p\u003e\n\u003cp\u003e“I was pleased to do it,” the secretary told her. She stepped forward and gave Jamie an impulsive hug. “The judge marries a number of couples every year, but I have a good feeling about you and your young man. I think you two are going to be just fine.”\u003c/p\u003e\n\u003cp\u003eJamie didn’t know what to say. She felt like the biggest phony who’d ever lived. It was happening already—the very thing she’d tried to warn Rich about. The feeling of connection. She’d sensed it during the ceremony and even more so with his kiss. But their marriage wasn’t supposed to be about any kind of spiritual or emotional connection. It was supposed to be a convenience, a legal shortcut to giving Jamie what she wanted—a child.\u003c/p\u003e\n\u003cp\u003eThey were making a mockery of everything marriage was meant to be. Jamie had never felt more like crying in her life.\u003c/p\u003e\n\u003cp\u003eShe’d tried to convince herself they were doing the right thing. Rich was so confident, so certain, and she believed him because…because she’d always believed him.\u003c/p\u003e\n\u003cp\u003eBut if they were doing what was right, why was her stomach in knots? Why did she feel as though she was going to burst into tears? And why, oh why, had Rich kissed her the way a husband kisses his wife—the most cherished wife in the world?\u003c/p\u003e\n\u003cp\u003e“Congratulations,” Jason said, moving toward her.\u003c/p\u003e\n\u003cp\u003eShe tried to smile, but her mouth started quivering and tears fell from the corners of her eyes, running down the sides of her face.\u003c/p\u003e\n\u003cp\u003e“Jamie?” Jason asked, giving her a hug. “Are you okay?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eJamie didn’t know how Jason managed it, but within minutes they were out of Judge Webster’s chambers and Rich was at her side, his arm around her middle.\u003c/p\u003e\n\u003cp\u003e“All right,” he said gently, guiding her down the hall, “why the tears?”\u003c/p\u003e\n\u003cp\u003eJamie rubbed her hand across her cheeks, suspecting she’d smeared mascara over her face in the process. She’d dressed so carefully in her new pale pink suit. Like a romantic fool, she’d had her hair styled and nails manicured—and for what? So she could stand before God and man and say vows they’d never be able to keep.\u003c/p\u003e\n\u003cp\u003e“You honestly want to know what’s wrong?” she wailed, snapping open her purse and rummaging around for a tissue. She found one, tucked her handbag under her arm and noisily blew her nose. “You mean you haven’t guessed?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“I … I feel dreadful.”\u003c/p\u003e\n\u003cp\u003e“Why?” Rich looked completely bewildered.\u003c/p\u003e\n\u003cp\u003e“Because I just lied.”\u003c/p\u003e\n\u003cp\u003e“Lied?”\u003c/p\u003e\n\u003cp\u003e“So did you!”\u003c/p\u003e\n\u003cp\u003e“Me?” He sounded even more confused.\u003c/p\u003e\n\u003cp\u003e“How can you justify what we did? We stood before Judge Webster and said vows. Vows! Vows are serious. We made promises to each other, promises neither one of us intends to keep.” \u003c/p\u003e","sourceLink":"https://allnovel.net/marriage-of-inconvenience-those-manning-men-1/page-10.html","bookId":1981,"creation":"Oct 5, 2019 10:25:58 AM","modification":"Oct 5, 2019 10:25:58 AM"}
