{"id":72878,"no":18,"title":"Page 18","content":"\u003cp\u003eRich couldn’t hold back his smile. “You’re full of surprises, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Did I ever mention the karate lessons I took? I learned how to disarm a man in three easy moves. Don’t tempt me, Manning.”\u003c/p\u003e\n\u003cp\u003e“You tempt me.” Rich didn’t know what made him say it, but now that it was out, he wasn’t sorry. Jamie went still at his side, unmoving in the dim light from the street lamp. Rich raised his hand and glided his fingertips over her face. Her eyes drifted shut.\u003c/p\u003e\n\u003cp\u003e“I …don’t think this is a good idea….”\u003c/p\u003e\n\u003cp\u003eHe stopped her, tracing the outline of her lips with his index finger. He circled once, twice, three times….\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003eHer eyes remained closed, and she swayed toward him. Rich reached for her, pressing her close.\u003c/p\u003e\n\u003cp\u003e“There…was something I wanted to say,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Oh.” He buried his face in her hair, inhaling its sweet scent. Rich didn’t know how they could be at odds with each other when the attraction between them was this strong.\u003c/p\u003e\n\u003cp\u003e“You…you shouldn’t distract me.”\u003c/p\u003e\n\u003cp\u003e“Do you want me to stop?” His lips grazed the underside of her jaw. She tilted her head.\u003c/p\u003e\n\u003cp\u003e“Not yet….”\u003c/p\u003e\n\u003cp\u003e“Should I kiss you?”\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003eIt was all the encouragement he needed. He brought his mouth to hers and wrapped his arms around her, nearly lifting her from the sidewalk. Her arms crept up his chest, pausing at his shoulders. The kissing was even better than it had been before, something Rich hadn’t thought possible.\u003c/p\u003e\n\u003cp\u003eHis mouth moved hungrily over hers, and when she sighed and parted her lips, he swept her mouth with his tongue. Jamie reacted with a swift intake of breath, winding her arms around his neck.\u003c/p\u003e\n\u003cp\u003eRich had never intended to kiss her like this. Not on a public street half a block from where they’d attended school. He wanted her soft and yielding in his arms. And in his bed. Soon.\u003c/p\u003e\n\u003cp\u003eThe salty taste of tears shocked him. She was crying. He pulled his mouth from hers. “Jamie, what’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Everything…nothing.” She kissed him back, her open mouth over his. It was as sensuous as anything he’d ever known.\u003c/p\u003e\n\u003cp\u003e“You’re crying.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because you’re making everything so difficult.”\u003c/p\u003e\n\u003cp\u003e“How am I doing that?” She remained in his embrace, his hand pressing the small of her back.\u003c/p\u003e\n\u003cp\u003e“Kissing me… You weren’t supposed to do that.”\u003c/p\u003e\n\u003cp\u003e“I’m not?”\u003c/p\u003e\n\u003cp\u003e“No…but don’t stop.”\u003c/p\u003e\n\u003cp\u003e“I don’t plan to.” Rich didn’t need further encouragement. His kiss was urgent, filled with unleashed desire. They’d wasted precious days, hiding behind their fears. All along, they could’ve been rejoicing in the discovery of their love.\u003c/p\u003e\n\u003cp\u003e“Rich…”\u003c/p\u003e\n\u003cp\u003eReluctantly, he broke off the kiss, his chest heaving. He took her hand, folding it in his own, and started back toward The Cookie Jar. “Let’s get out of here.”\u003c/p\u003e\n\u003cp\u003e“I …suppose we should.”\u003c/p\u003e\n\u003cp\u003e“It’s either that or make love to you in the middle of the street.”\u003c/p\u003e\n\u003cp\u003e“Make love to me?”\u003c/p\u003e\n\u003cp\u003eSurely it was what she expected. A man didn’t kiss a woman like that without her knowing what he had in mind, especially if that woman was his wife!\u003c/p\u003e\n\u003cp\u003e“But…we need to talk.”\u003c/p\u003e\n\u003cp\u003e“Later.” His steps were brisk. The sooner he got back to his apartment, the sooner he could kiss her again. He didn’t want to give her the opportunity to change her mind.\u003c/p\u003e\n\u003cp\u003e“There’s something we should talk over first.”\u003c/p\u003e\n\u003cp\u003e“What? Can’t it wait?\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I would’ve said it earlier…. I planned to, but then you suggested the walk and…we started kissing and now I’m more confused than ever.”\u003c/p\u003e\n\u003cp\u003eHe stopped at his car, unlocked the passenger door, then turned to face her. Resting his hands on her shoulders, he met her gaze, relieved to see the hunger in her eyes. “All right, Jamie, tell me whatever it is.”\u003c/p\u003e\n\u003cp\u003eShe brushed the tears from her cheeks, and drew in a deep, steadying breath. “Because of Friday night.”\u003c/p\u003e\n\u003cp\u003eThat again! “Yes?”\u003c/p\u003e\n\u003cp\u003e“I was thinking you might want to…you know?”\u003c/p\u003e\n\u003cp\u003eRich thought he did. She was about to suggest what he’d been considering for the last few days—that they take this marriage seriously and move in together.\u003c/p\u003e\n\u003cp\u003e“If it’s what you want, it’s what I want,” he said, brushing the hair from her face, his fingers lingering on the softness of her skin.\u003c/p\u003e\n\u003cp\u003eHer eyes closed, and she bit her trembling lower lip. “I don’t know what I want anymore…and I don’t think you do, either.”\u003c/p\u003e\n\u003cp\u003e“Sure I do,” he countered. He wanted her.\u003c/p\u003e\n\u003cp\u003e“I think we should give serious consideration to…”\u003c/p\u003e\n\u003cp\u003e“To what?”\u003c/p\u003e\n\u003cp\u003e“A divorce.”\u003c/p\u003e\n\u003cp\u003eNine\u003c/p\u003e\n\u003cp\u003eRich jerked away from her as though he’d received an electric shock.\u003c/p\u003e\n\u003cp\u003e“A divorce!” he bellowed.\u003c/p\u003e\n\u003cp\u003eIt wasn’t what Jamie preferred, but she felt honor-bound to offer Rich the option. They’d broken their agreement, the promises they’d made to each other before the wedding.\u003c/p\u003e\n\u003cp\u003eThe decision to make love had been mutual; nevertheless everything had changed, and they couldn’t continue pretending it hadn’t. Their lovemaking was so powerful, so moving, Jamie would treasure the memory all her life. Every time she thought about falling asleep, nestled against Rich, she went weak.\u003c/p\u003e\n\u003cp\u003e“A divorce,” Rich repeated.\u003c/p\u003e\n\u003cp\u003eJamie shuddered. He’d never know what it had cost her to make the offer. Jamie prayed Rich would give her some indication that Friday night had been as meaningful and as beautiful for him as it had been for her.\u003c/p\u003e\n\u003cp\u003e“So you want a divorce?” he said, slamming the passenger door of his car.\u003c/p\u003e\n\u003cp\u003e“I … I didn’t say it’s what I wanted.”\u003c/p\u003e\n\u003cp\u003e“Then why did you suggest it?”\u003c/p\u003e\n\u003cp\u003e“Because…well, because things are different now.”\u003c/p\u003e\n\u003cp\u003e“You’re right about that,” he muttered. “I don’t even know you anymore.”\u003c/p\u003e\n\u003cp\u003eJamie chose to ignore his outburst. “We’d agreed this was to be a marriage of convenience.”\u003c/p\u003e\n\u003cp\u003e“You didn’t exactly fight me off, you know.”\u003c/p\u003e\n\u003cp\u003eJamie’s cheeks exploded with scalding color. “No… I didn’t, but it doesn’t alter the fact that we breached our agreement—and before we go on with our plans, I feel we should reevaluate our options and our commitment.”\u003c/p\u003e\n\u003cp\u003e“You sound just like a banker. Cold and calculating. What’s the matter? Are you afraid of a little emotion?” His eyes were seething with anger.\u003c/p\u003e\n\u003cp\u003eIf Jamie thought he was furious when he’d confronted her with Floyd, his anger on Friday night paled in comparison to the fury she saw now.\u003c/p\u003e\n\u003cp\u003e“We’re not teenagers anymore,” she said as calmly as her voice would allow. “We’re responsible, mature adults who can make decisions based on something other than hormones.”\u003c/p\u003e\n\u003cp\u003e“So Friday night was nothing more than a roll in the hay for you?”\u003c/p\u003e\n\u003cp\u003e“I didn’t say that.” Jamie was growing angry herself. “You’re purposely misconstruing everything I’ve said. Friday night happened. Good or bad, it happened. We can’t pretend it didn’t.”\u003c/p\u003e\n\u003cp\u003e“I had no intention of forgetting it or ignoring it or anything else.”\u003c/p\u003e\n\u003cp\u003e“Then why did it take you until Monday afternoon to call me?” she cried. “Why did you sneak away in the middle of the night without a word? I woke up feeling like…like a one-night stand.”\u003c/p\u003e\n\u003cp\u003e“You aren’t the only one who was disappointed,” Rich said loudly. “It wouldn’t have hurt you to call me.”\u003c/p\u003e\n\u003cp\u003e“You abandoned me.”\u003c/p\u003e\n\u003cp\u003e“I made you feel like a one-night stand?” Rich paced the sidewalk. He rammed his fingers through his hair. “A one-night stand? That’s ridiculous. We’re married!”\u003c/p\u003e\n\u003cp\u003e“No, we’re not,” she argued. “Not really. I don’t…”\u003c/p\u003e\n\u003cp\u003e“I’ve got the papers to prove it. Talk about denial! A wedding is a wedding, so don’t try to add a list of qualifiers to it now.”\u003c/p\u003e\n\u003cp\u003e“Those qualifiers were added before the ceremony.”\u003c/p\u003e\n\u003cp\u003e“So you want out.” He turned toward her, his face contorted with anger, his blue eyes piercing.\u003c/p\u003e\n\u003cp\u003e“I’m simply giving you the option. Our relationship has changed, and we can’t act as if it hasn’t.”\u003c/p\u003e\n\u003cp\u003e“And I am?”\u003c/p\u003e\n\u003cp\u003e“Yes!” she shouted. “If I hadn’t said anything we’d be halfway to your place by now. We both know I would’ve ended up spending the night, and then what?”\u003c/p\u003e\n\u003cp\u003eShe didn’t let him answer. “Then tomorrow morning,” she resumed, answering her own question, “everything would be awkward again and there wouldn’t be time to say or do anything because we’d both need to get to work.”\u003c/p\u003e\n\u003cp\u003eAlready Jamie could picture the scene. They’d be rushing around dressing, embarrassed and uncomfortable with each other, the way they’d been when Rich had phoned her Monday afternoon. There wouldn’t be time to talk, but they’d exchange polite pleasantries while he drove her back to Forty-third Street so she could pick up her car. Then she’d have to dash home and change clothes again before going to work.\u003c/p\u003e\n\u003cp\u003e“It wouldn’t have to be that way.”\u003c/p\u003e\n\u003cp\u003e“But it would’ve been.” After a few kisses neither one of them would want to talk, not when they were so eager to make love. There wouldn’t be any discussion, no clear exchange of views; that was predictable. And their embarrassment the next morning would’ve been inevitable.\u003c/p\u003e\n\u003cp\u003e“What I don’t understand is why you’re throwing a divorce in my face now.”\u003c/p\u003e\n\u003cp\u003eIt all made sense to Jamie. “We were planning a divorce anyway, after the baby’s born. There were certain stipulations, agreements we made before the wedding. That’s all changed. If you’re going to have second thoughts, the time is now.”\u003c/p\u003e\n\u003cp\u003e“Is it me or you who’s having regrets?” he demanded harshly.\u003c/p\u003e\n\u003cp\u003e“We weren’t talking about me.”\u003c/p\u003e\n\u003cp\u003e“Maybe we should.”\u003c/p\u003e\n\u003cp\u003e“Oh, Rich, please don’t.”\u003c/p\u003e\n\u003cp\u003e“Don’t what?”\u003c/p\u003e\n\u003cp\u003e“Try to turn everything I say around. I didn’t mean to hurt or offend you. I just want this to be as clear as we can make it. Having a baby is too important a decision. We can’t mix it up with egos.”\u003c/p\u003e\n\u003cp\u003e“Easy to say when my ego’s the one that’s getting battered.”\u003c/p\u003e\n\u003cp\u003e“I told you, I’m not doing it intentionally. All I want is for us to be honest with each other. If you decide you’d rather forget the whole thing, then I’ll understand. Look what’s happened so far! We’ve nearly destroyed the marriage, not to mention our friendship, and we haven’t been married six weeks. This isn’t going to be as simple as we thought.”\u003c/p\u003e\n\u003cp\u003eRich rubbed his hand down his face, looking confused.\u003c/p\u003e\n\u003cp\u003eA divorce wasn’t what Jamie wanted, but she felt she had to give him the opportunity to end their plans now, before the relationship was further complicated by a child. \u003c/p\u003e","sourceLink":"https://allnovel.net/marriage-of-inconvenience-those-manning-men-1/page-18.html","bookId":1981,"creation":"Oct 5, 2019 10:25:58 AM","modification":"Oct 5, 2019 10:25:58 AM"}
