{"id":72884,"no":24,"title":"Page 24","content":"\u003cp\u003eShe didn’t seem particularly concerned about what she was doing to his ego, either.\u003c/p\u003e\n\u003cp\u003eAll right, so maybe his attitude toward Jamie’s mother wasn’t the best, but no way was he going to sit there wearing a frown and pretending this pregnancy was some unthinkable disaster. So he’d taken a lighter approach. If Jamie wanted to fault him for that, then fine. Guilty as charged.\u003c/p\u003e\n\u003cp\u003eHe had a sense of humour. He liked to tease. Always had. A fact that Jamie delighted in reminding him. Leave it to a woman to reach back thirteen years to their high school days to dig up something they could fight about.\u003c/p\u003e\n\u003cp\u003eRich walked across the living room, loosening his tie as he moved. So, Jamie still regretted their marriage. No wonder she’d been so eager to offer him the option of a divorce.\u003c/p\u003e\n\u003cp\u003eHe lowered himself into his favorite chair, raised his feet onto the ottoman and leaned his head against the back, closing his eyes. He needed to clear his thoughts, erase any trace of pride and negative emotion. Deal with the issues facing him.\u003c/p\u003e\n\u003cp\u003eWhat were the issues?\u003c/p\u003e\n\u003cp\u003eJamie was pregnant. Apparently she was as thrilled at the prospect as he was himself, but for different reasons. He was a means to the end, and now that he’d accomplished what she wanted, he was of no use to her.\u003c/p\u003e\n\u003cp\u003eHe felt a painful tightening in his chest. Over the years he’d met a lot of women. Women who used him, wanted him, manipulated him. He would never have believed Jamie was one of them. It was more than obvious that she was trying to push him out of her life. There wasn’t much Rich could do.\u003c/p\u003e\n\u003cp\u003eHe couldn’t force her to love him.\u003c/p\u003e\n\u003cp\u003eRich must have fallen asleep because the next thing he knew the phone was ringing. His eyes shot open, and he stood abruptly, awkwardly, and walked across the room. He prayed with everything in him it would be Jamie, but it wasn’t his headstrong wife.\u003c/p\u003e\n\u003cp\u003e“Rich?”\u003c/p\u003e\n\u003cp\u003eThis questioning, bewildered tone was one he’d rarely heard in his mother’s voice. “Hello, Mom.”\u003c/p\u003e\n\u003cp\u003e“I just had the most…surprising phone call from Doris Warren.”\u003c/p\u003e\n\u003cp\u003eRich groaned inwardly. “Oh?”\u003c/p\u003e\n\u003cp\u003e“She’s Jamie Warren’s mother.”\u003c/p\u003e\n\u003cp\u003e“I know who she is.”\u003c/p\u003e\n\u003cp\u003e“She told me about you and Jamie being married?” She made the statement into a question, as if she expected Rich to immediately deny everything.\u003c/p\u003e\n\u003cp\u003e“She told you that?” Circumstances being what they were, Rich chose to answer his mother’s question with one of his own.\u003c/p\u003e\n\u003cp\u003e“She also said Jamie’s pregnant?”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Is it true?” Like Jamie, his mother had plenty of experience dealing with his stall tactics. When he didn’t immediately respond, she raised her voice and asked him again. “Is it?”\u003c/p\u003e\n\u003cp\u003eRich wearily rubbed his face, hoping that would help clear his mind. “Part of it.”\u003c/p\u003e\n\u003cp\u003e“Which part?” His mother’s voice was quickly advancing toward hysteria. Rich knew his father wasn’t there, otherwise Eric Manning would’ve made the call. His mother had a tendency to get excited over the smallest details. For that matter, so did his father.\u003c/p\u003e\n\u003cp\u003eWhen his parents learned Taylor had married Russ Palmer in Reno, all hell had broken loose. They hadn’t been thrilled to learn Christy had married Cody Franklin on the sly, either. Rich could only guess what their reaction would be when they learned he was married to Jamie. Like his two sisters, he’d married without a family wedding.\u003c/p\u003e\n\u003cp\u003e“Rather than explain everything over the phone, I suggest Jamie and I drop in tomorrow evening,” Rich said. “We can discuss everything then.”\u003c/p\u003e\n\u003cp\u003e“Tomorrow?”\u003c/p\u003e\n\u003cp\u003e“I should be able to get away from the office around six. I’ll check with Jamie to make sure that time is convenient for her, as well.”\u003c/p\u003e\n\u003cp\u003e“Just answer one question. Are you and Jamie Warren married or not?”\u003c/p\u003e\n\u003cp\u003eRich hesitated. “Yes and no,” he finally said.\u003c/p\u003e\n\u003cp\u003e“That doesn’t tell me a thing,” Elizabeth cried.\u003c/p\u003e\n\u003cp\u003e“I know.” Rich couldn’t argue with his mother about that. But he couldn’t tell her what he didn’t know himself.\u003c/p\u003e\n\u003cp\u003eWhen he’d finished the conversation, Rich stared down at the phone for a moment. He didn’t have any choice; he had to call her. Swallowing his pride left a bitter taste in his mouth, but there was no avoiding it. He reached for the receiver and punched out her number.\u003c/p\u003e\n\u003cp\u003eJamie answered on the second ring. Rich didn’t bother with any greetings. “I just got a call from my mother. She apparently talked to yours.”\u003c/p\u003e\n\u003cp\u003eJamie released a slow, frustrated sigh. “I was afraid that would happen. What did you tell her?”\u003c/p\u003e\n\u003cp\u003e“As little as I could. Naturally she didn’t understand, so I told her we’d come by after work tomorrow, around six, and explain.” Rich tried to keep the inflection in his voice to a minimum, tried not to let any of his emotions rise to the surface.\u003c/p\u003e\n\u003cp\u003e“Tomorrow,” Jamie repeated.\u003c/p\u003e\n\u003cp\u003e“If it’s inconvenient, then I’ll let you call and tell her that.”\u003c/p\u003e\n\u003cp\u003e“No… I’ll be there.”\u003c/p\u003e\n\u003cp\u003e“I’ll see you then.” He knew he sounded stiff and formal, but Rich couldn’t help it. A man’s pride could take only so much abuse.\u003c/p\u003e\n\u003cp\u003eWhen he’d hung up, Rich sauntered into his kitchen. He hadn’t eaten since early afternoon, but he wasn’t hungry. Scanning the contents of his refrigerator, he reached for a cold pop.\u003c/p\u003e\n\u003cp\u003eOn his way out of the kitchen, he paused in front of the phone. Before he could question his actions, he dialed Jason’s number and waited two long rings before his older brother answered.\u003c/p\u003e\n\u003cp\u003e“Tomorrow night at six,” Rich announced without preamble. He wasn’t in the mood to exchange pleasantries.\u003c/p\u003e\n\u003cp\u003e“What’s happening tomorrow?” Jason demanded, clearly confused.\u003c/p\u003e\n\u003cp\u003e“I’m telling Mom and Dad I’m married.”\u003c/p\u003e\n\u003cp\u003eJason’s hesitation was only slight. “What brought this on?”\u003c/p\u003e\n\u003cp\u003e“Jamie’s pregnant.”\u003c/p\u003e\n\u003cp\u003e“But I thought she canceled the appointment with—”\u003c/p\u003e\n\u003cp\u003e“She did.” Rich realized he sounded abrupt and disagreeable. Hey, he was abrupt and disagreeable. But Jason had asked to be present when Rich told their parents about his marriage.\u003c/p\u003e\n\u003cp\u003e“If Jamie canceled the doctor’s appointment, then how…”\u003c/p\u003e\n\u003cp\u003e“This baby was conceived in the traditional way.”\u003c/p\u003e\n\u003cp\u003eJason was silent for a moment. “You don’t sound happy about it.”\u003c/p\u003e\n\u003cp\u003e“I am happy,” Rich snapped. “Real happy.”\u003c/p\u003e\n\u003cp\u003eBut it didn’t seem a fair exchange. He wanted the baby, but nothing was happening the way he would’ve liked. According Rich’s plan, he and Jamie would’ve been in bed together right this minute. They would’ve been in each other’s arms, her face nestled on his shoulder. When they kissed, it would’ve been a leisurely exploration of their need and appreciation for each other. His restless hands would be roaming at will over her body, and he’d spread his palm over her flat stomach, communicating his feelings to his unborn child. When they made love, it would’ve been a celebration of her pregnancy.\u003c/p\u003e\n\u003cp\u003eBut Jamie didn’t need him any longer.\u003c/p\u003e\n\u003cp\u003eRich had served his purpose.\u003c/p\u003e\n\u003cp\u003eRich had trouble keeping his mind on his work the following afternoon. Every ten minutes or so, he found himself looking at his watch. Each time, he mentally calculated how long it would be before he’d be confronting his parents with the truth.\u003c/p\u003e\n\u003cp\u003eA few minutes after five, he was sitting at his desk, reviewing some figures, when there was a polite knock at his door. He grumbled a reply, and the door slowly creaked open.\u003c/p\u003e\n\u003cp\u003eJamie stood before him, dressed in a pretty pink suit. “Is this a bad time?”\u003c/p\u003e\n\u003cp\u003eThe last person Rich expected to see waltzing through his office door was his pregnant wife.\u003c/p\u003e\n\u003cp\u003e“No,” he said, rolling back his chair, “you’re not disturbing a thing.” Maybe his equilibrium…and his heart. But precious little else. “Sit down.” He gestured toward the chair on the other side of his desk.\u003c/p\u003e\n\u003cp\u003eJamie sat down, and he saw that her gaze fell to her clenched hands.\u003c/p\u003e\n\u003cp\u003e“What brings you here?”\u003c/p\u003e\n\u003cp\u003e“I—I thought we should discuss what we’re going to tell your parents.”\u003c/p\u003e\n\u003cp\u003e“What do you suggest?” He hoped to give the impression that whatever they decided didn’t matter one way or the other to him. He leaned against the back of the chair and locked his fingers behind his head.\u003c/p\u003e\n\u003cp\u003e“Do they know I’m pregnant?”\u003c/p\u003e\n\u003cp\u003e“Yes. Your mother told mine.”\u003c/p\u003e\n\u003cp\u003e“I thought she must have,” Jamie said, with a sigh. “I feel like such a fool.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eShe shrugged, still avoiding eye contact. “For telling her. I’ve complicated the whole situation.”\u003c/p\u003e\n\u003cp\u003eRich didn’t agree or disagree. It seemed that every time he opened his mouth, he said the wrong thing.\u003c/p\u003e\n\u003cp\u003e“How much do you think we have to explain?” Jamie asked, risking a glance in his direction.\u003c/p\u003e\n\u003cp\u003eRich hadn’t decided. “Everything,” he said without giving it any thought.\u003c/p\u003e\n\u003cp\u003e“A-all of it?”\u003c/p\u003e\n\u003cp\u003e“I can’t see any reason to hold any of it back.” Some of the disappointment and lingering animosity from their argument from the day before seeped into his words.\u003c/p\u003e\n\u003cp\u003e“I thought we might want them to assume the baby—”\u003c/p\u003e\n\u003cp\u003e“No,” Rich said forcefully.\u003c/p\u003e\n\u003cp\u003eJamie’s startled gaze connected with his. “You didn’t even let me finish.”\u003c/p\u003e\n\u003cp\u003e“I already knew what you were going to say. You want my parents to assume this baby was conceived artificially. I won’t be a party to that.”\u003c/p\u003e\n\u003cp\u003e“That isn’t what I meant.”\u003c/p\u003e\n\u003cp\u003eRich’s phone rang just then. He reached for it, although he would’ve preferred to ignore it.\u003c/p\u003e\n\u003cp\u003e“Engineering,” he responded automatically. “Rich Manning.”\u003c/p\u003e\n\u003cp\u003e“It’s Paul,” his eldest brother said. “I just got done talking to Mom. What’s going on with you and Jamie Warren?”\u003c/p\u003e\n\u003cp\u003e“Nothing.” So Mom was calling in the big guns. Paul was the responsible one in the family, or at least that was his reputation and his role. When it came to family problems, his parents tended to lean on Paul for support.\u003c/p\u003e\n\u003cp\u003e“That’s not what I heard,” Paul said. “I got a call from Mom no more than ten minutes ago with some crazy rumor about you being married.”\u003c/p\u003e\n\u003cp\u003e“It’s no rumor.”\u003c/p\u003e\n\u003cp\u003e“Jamie Warren?”\u003c/p\u003e\n\u003cp\u003e“Jamie Warren Manning,” Rich answered without thinking. He had to stop saying that. She’d never be a Manning. Rich could feel her stare, but he avoided glancing in her direction, refusing to give her the power to disconcert him.\u003c/p\u003e\n\u003cp\u003e“Mom says Jamie’s pregnant.”\u003c/p\u003e\n\u003cp\u003e“She is.” Rich had no intention of hiding it. In a few months, Jamie’s condition would become obvious, and while she might want to hide the truth, he had no interest in colluding with her.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you tell anyone?” Paul asked.\u003c/p\u003e\n\u003cp\u003e“That’s a long story.”\u003c/p\u003e\n\u003cp\u003e“Well, I hope you tell it tonight.” Paul’s disapproval was all too evident.\u003c/p\u003e\n\u003cp\u003eRich rubbed his eyes. Thanks to Jamie, he hadn’t slept well the night before. His dreams had been troubling, and he’d tossed restlessly until morning. \u003c/p\u003e","sourceLink":"https://allnovel.net/marriage-of-inconvenience-those-manning-men-1/page-24.html","bookId":1981,"creation":"Oct 5, 2019 10:25:58 AM","modification":"Oct 5, 2019 10:25:58 AM"}
