{"id":60766,"no":1010,"title":"Chapter 1008 - Immeasurable Mountain","content":"\u003cp\u003eTang Xinlian tilted her head slightly to the side, revealing her exquisite and beautiful sharp chin. Soon after, she looked towards Lin Dong whose eyes were slightly narrowed as he stared in the direction that Hua Chen had disappeared in. She said, “Although you have a deep enmity with him, his first opponent will be me. I will not hand him over to you.”\u003c/p\u003e\n\u003cp\u003eLin Dong withdrew his gaze and looked at Tang Xinlian.\u003c/p\u003e\n\u003cp\u003e“I am not looking down on you. If you think that my words have hurt your pride, all I can do is apologise.”\u003c/p\u003e\n\u003cp\u003eTang Xinlian’s bright eyes did not avoid Lin Dong as she spoke in an earnest manner, “That Hua Chen is no saint, moreover, there will no friendly sparring during this competition but true life or death battles.”\u003c/p\u003e\n\u003cp\u003e“Moreover, master has said that we definitely cannot allow Hua Chen and Xu Xiu to obtain the Thunderbolt Ancestral Symbol. Hence, I will do everything I can to stop them.”\u003c/p\u003e\n\u003cp\u003eTang Xinlian was aware that Lin Dong was quite strong. Although the latter was only at the perfect Profound Life stage, he was able to kill an initial Profound Death stage expert. However, Hua Chen and Xu Xiu had both long since stepped into the advance Profound Death stage. Moreover, both of them were mysterious and unfathomable. They possessed numerous techniques and it would not be easy to deal them.\u003c/p\u003e\n\u003cp\u003e“Go ahead if you wish to fight first.”\u003c/p\u003e\n\u003cp\u003eLin Dong smiled faintly. He did not argue with Tang Xinlian at such a time. He had no intention to obtain any glory. All he wished for, was to complete Mo Luo’s instructions and retrieve the thunderbolt essence that originally belonged to him. If Tang Xinlian or Zhou Ze were able to finish off Hua Chen and Xu Xiu in this competition, it would save Lin Dong the trouble of doing so…\u003c/p\u003e\n\u003cp\u003eTang Xinlian stared at Lin Dong for a moment before a smile blossomed on her face. She glanced at Huang Ling’s group behind them and said, “Let’s go, Immeasurable Mountain is only a short distance away.”\u003c/p\u003e\n\u003cp\u003eTang Xinlian did not delay any longer after her voice sounded. Her beautiful hair was swung as her enchanting body turned into a ray of red light that shot forth. Lin Dong led Mu Lingshan and followed closely behind.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThey did not meet any obstructions along the way. Within a short ten minutes, Lin Dong could sense that the dense forest had started to withdraw as his view swiftly widened. Soon after, a towering mountain that pierced through the clouds and stood like a pillar that supported the sky entered his eyes.\u003c/p\u003e\n\u003cp\u003e“So this is Immeasurable Mountain huh…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s toes landed on a thick branch. He quickly raised his head and looked at the seemingly endless majestic mountain before him. Thick clouds lingered at the mid-section of the mountain, causing one to be unable to clearly see its peak. However, through the Thunderbolt Ancestral Symbol within his body, Lin Dong was still able to detect a familiar power beckoning him from the peak of the mountain.\u003c/p\u003e\n\u003cp\u003eIt was the thunderbolt essence extracted from the Thunderbolt Ancestral Symbol.\u003c/p\u003e\n\u003cp\u003eAt this moment, the foot of the mountain was already filled with people. Their eyes were full of excitement as they fixed their eyes upon this towering mountain.\u003c/p\u003e\n\u003cp\u003eThis was the final battleground.\u003c/p\u003e\n\u003cp\u003eThe appearance of Lin Dong’s group immediately attracted several pairs of eyes. Of course, most of them paused on Tang Xinlian at the front. Fear and awe filled their eyes.\u003c/p\u003e\n\u003cp\u003e“Ha ha, you are rather late.” A soft laughter was transmitted over. Subsequently, a figure rushed over from nearby. It was the Little Elephant King Zhou Ze.\u003c/p\u003e\n\u003cp\u003e“We met Hua Chen along the way and briefly exchanged blows.” Tang Xinlian explained.\u003c/p\u003e\n\u003cp\u003e“Oh?” Zhou Ze’s eyes hardened. “How is he?”\u003c/p\u003e\n\u003cp\u003e“Very strong.” A grave expression flashed across Tang Xinlian’s face. She was clearly aware of just how powerful her attack was. However, it was easily dispelled by Hua Chen. Evidently, this person from the Eastern Xuan Region’s Yuan Gate was quite powerful.\u003c/p\u003e\n\u003cp\u003eZhou Zu nodded slightly. Someone whom could be described as very strong by Tang Xinlian was likely extremely powerful…\u003c/p\u003e\n\u003cp\u003e“There are many strong individuals here…” Lin Dong looked towards this area at the foot of the mountain as surprise flashed across his eyes. He could sense many strong presences in this place.\u003c/p\u003e\n\u003cp\u003e“Those who can arrive in this place without being eliminated all possess some skills. Although the rookie list does have its weight, it is unable to fully take into account all the young and powerful individuals in the Chaotic Demon Sea. Some of these dark horses cannot be estimated.” Zhou Ze said.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded. He was about to speak when he felt cold aura emerge from within Mu Lingshan’s body. Startled, he turned his head, only to find that this little girl was staring at certain spot in the distance with an exceptionally ugly expression.\u003c/p\u003e\n\u003cp\u003eLin Dong followed her line sight, only to see two figures standing on a hill. One of them was well built and completely exposed both of his arms. His face had a thick and manly pair eyebrows but had a rather evil look. A glowing symbol was present on his brow which had the appearance of a ferocious blood shark.\u003c/p\u003e\n\u003cp\u003eBeside the man with exposed arms was a delicate and petite young lady. She was rather pretty but there was a haughtiness that could not be hidden on her face.\u003c/p\u003e\n\u003cp\u003eThe auras of this duo were quite powerful. This was especially the case for the man with the evil look. Even if his strength had not reached the advance Profound Death stage, it was likely extremely close.\u003c/p\u003e\n\u003cp\u003eThe two of them had also detected Lin Dong’s gaze and quickly looked over. That bare arm man glanced at Lin Dong before turning towards Mu Lingshan by his side. Soon after, his mouth parted into a grin that was filled with a sinisterly evil aura.\u003c/p\u003e\n\u003cp\u003eThe young lady, on the other hand, curled her mouth and had a look of disdain.\u003c/p\u003e\n\u003cp\u003e“Who are they?” Lin Dong slightly frowned and asked.\u003c/p\u003e\n\u003cp\u003e“Two bastards from the Blood Demon Shark clan.” Mu Lingshan gnashed her teeth. Her tone was filled with fury. Clearly, she had a grudge with those two.\u003c/p\u003e\n\u003cp\u003e“So they are members of the Blood Demon Shark clan…” Lin Dong suddenly understood. This clan had quite a deep enmity with the Immortal Sage Whale clan, and it was likely that Mu Linshan had even met them in the past. From the looks of it, they were definitely not friends.\u003c/p\u003e\n\u003cp\u003e“That man is called Sha Li while that woman is called Sha Ling. They are direct disciples of the Blood Demon Shark clan and are also quite well known amongst the younger generation of the Blood Demon Shark clan…” Tang Xinlian also turned her attention to the two in the distance and spoke.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded. He could see quite a rich enmity from the eyes of those two. This kind of ill intent was likely directed at Mu Lingshan.\u003c/p\u003e\n\u003cp\u003eLin Dong gently rubbed Mu Lingshan’s tiny head with his hand and smiled at her. Although that ill intent did not target him, Lin Dong would definitely not idly stand by the side and watch if those two planned to do anything to Mu Lingshan.\u003c/p\u003e\n\u003cp\u003e“Um.”\u003c/p\u003e\n\u003cp\u003eMu Lingshan nodded. Her large eyes glared viciously at the young lady as the corners of her mouth curled downwards, causing her to appear to be full of disdain.\u003c/p\u003e\n\u003cp\u003e“Little girl, you are asking to die!”\u003c/p\u003e\n\u003cp\u003eThe young lady’s small face became icy when she saw this. Her small hand clenched and blood light surged. It directly turned into a blood arrow that shot towards Mu Lingshan at lightning speed.\u003c/p\u003e\n\u003cp\u003eLin Dong’s face became cold when he saw the viciousness of this young lady. He waved his sleeve and wind swept forth. It altered the direction of the blood arrow before the it shot back at the young lady in an even more ruthless manner.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe bare arm man grabbed with his hand when the blood arrow appeared in front of the young lady, forcefully dispersing the force. Next, he lifted his head and stared at Lin Dong with a sinister expression. “You wish to die?”\u003c/p\u003e\n\u003cp\u003e“Both of you are after all members of the Blood Demon Shark clan. How can you be so ill mannered?” Lin Dong replied with a cold voice.\u003c/p\u003e\n\u003cp\u003eThe small face of the young lady had turned green from anger upon hearing this. At the same time, murderous intent gushed in the eyes of the bare arm man while blood light surged on the surface of his body.\u003c/p\u003e\n\u003cp\u003eThe surrounding experts were startled by the sudden clash between the two parties. However, they did not speak. Both sides were not ordinary and it would be good if they ended up fighting each other...\u003c/p\u003e\n\u003cp\u003e“The ten peaks of Immeasurable Mountain are about to open. Take the mountain seal first before settling other matters.” Tang Xinlian softly said.\u003c/p\u003e\n\u003cp\u003e“Understood.” Lin Dong slightly nodded.\u003c/p\u003e\n\u003cp\u003eLight suddenly poured down from the majestic huge mountain not long after Tang Xinlian’s voice sounded. After which, the clouds shook as ten large peaks appeared in front of everyone’s eyes. Light flickered on those peaks and it was possible to vaguely see a light seal.\u003c/p\u003e\n\u003cp\u003eAn uproar broke out at the foot of the mountain as the eyes of many turned red with excitement.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, one peak per person. Whether anyone will be able to obtain a mountain seal will depend on your own ability.” Tang Xinlian stared at the light seals on the peaks and said.\u003c/p\u003e\n\u003cp\u003e“Aye.”\u003c/p\u003e\n\u003cp\u003e“Let’s go!”\u003c/p\u003e\n\u003cp\u003eTang Xilian softly shouted as her body took the lead and charged forward. It directly shot towards one of the peaks.\u003c/p\u003e\n\u003cp\u003eSwoosh swoosh swoosh!\u003c/p\u003e\n\u003cp\u003eMany experts at the foot of the foot of the mountain also swept forth after Tang Xinlian moved. Immediately, rushing wind sounds appeared in a hurried fashion.\u003c/p\u003e\n\u003cp\u003e“Lingshan, why don’t you choose a peak too?” Lin Dong looked towards Mu Lingshan and said.\u003c/p\u003e\n\u003cp\u003e“Um.” Mu Lingshan excitedly nodded. After which, she hugged the Life Death Coffin Cover and charged towards a peak.\u003c/p\u003e\n\u003cp\u003eLin Dong grinned upon seeing this. He also chose a peak and headed straight for it.\u003c/p\u003e\n\u003cp\u003e“Brother Sha Li, I will go and tear off that little girl’s mouth!” Sha Ling’s face was frosty as she looked at Mu Lingshan, who had charged towards a peak, and said.\u003c/p\u003e\n\u003cp\u003e“Leave that fellow to me... I will make him pay the price for the words that he has said.” The bare arm man spoke in a eerie manner.\u003c/p\u003e\n\u003cp\u003eBoth of them exchanged a glance after they spoke. After which, they swiftly separated and rushed towards two peaks.\u003c/p\u003e\n\u003cp\u003eMany experts swarmed upwards from the foot of the mountain, shattering the silence of Immeasurable Mountain. The final battle had finally arrived at this final battleground…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1007\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1009\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1008","bookId":1514,"creation":"Sep 10, 2019 7:28:55 AM","modification":"Sep 10, 2019 7:28:55 AM"}
