{"id":60809,"no":1053,"title":"Chapter 1051 - Qin Gang and Meng Shan","content":"\u003cp\u003e“Tribute?”\u003c/p\u003e\n\u003cp\u003eLin Dong was slightly startled for a moment before he came to a sudden comprehension. This place was the junction between Hundred Beast Ridge and Deep Lightning Mountain. Therefore, in order for the Nine-tail tribe to live here peacefully, they naturally had to pay a tribute to these two factions.\u003c/p\u003e\n\u003cp\u003e“Why are all of you hiding?”\u003c/p\u003e\n\u003cp\u003e“The women of our Nine-tail tribe are all extremely beautiful. Hence, it is very easy for us to attract trouble. If we catch the eye of those who come to collect tributes, there will be a great deal of trouble.” Xin Qing’s eyes were dim. Perhaps being beautiful would bring a lot of benefits if one was born someplace else. However, it was extremely dangerous in a place like this. In fact, one could even end up implicating one’s entire tribe if one was careless.\u003c/p\u003e\n\u003cp\u003eLin Dong was quiet. The nine-tail tribe was extremely beautiful, but they did not have the ability to protect their beauty.\u003c/p\u003e\n\u003cp\u003e“Previously, there was someone called Qin Gang from Hundred Beast Ridge, who came to collect the tribute. Sister Xin Qing caught his eye and he insisted on taking her as a concubine. In order to protect her, the chief asked her to temporarily leave the Beast War Region. Subsequently, our Nine-tail tribe had to pay quite a hefty price before Qin Gang reluctantly let this matter go to rest…” A young lady angrily said.\u003c/p\u003e\n\u003cp\u003e“Qin Gang?” Lin Dong glanced at Xin Qing who was gently biting her small mouth.\u003c/p\u003e\n\u003cp\u003e“He is one of the nine warriors of Hundred Beast Ridge and is extremely powerful. His strength is not inferior to that of Cao Ying from Blood Python City.” Xin Qing said. In the face of such oppressive force, she had no means of retaliating besides fleeing.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded slightly. He turned his eyes and looked outside the village. This place was quite secluded. Coincidentally, it was also possible to see the scenery in the distance. At this moment, there were thick clouds of dust rising in that direction, while the thundering sound of galloping horses could be faintly heard.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Haha, members of the Nine-tail tribe, hand over this year’s tribute!”\u003c/p\u003e\n\u003cp\u003eAs the dust scattered, a loud laughter immediately reverberated over the village like thunder. Following this, the dust settled and one could see a black mass of people appearing outside the village. Their evil and ferocious auras caused even dark clouds to gather in the sky.\u003c/p\u003e\n\u003cp\u003e“This voice…”\u003c/p\u003e\n\u003cp\u003eThe expressions of Xin Qing’s group changed drastically after hearing this loud laughter.\u003c/p\u003e\n\u003cp\u003e“Is that Qin Gang?” Lin Dong came to a comprehension when he saw this.\u003c/p\u003e\n\u003cp\u003e“Ah, dammit, why is he the one who is collecting tribute from our Nine-tail tribe…” Xin Qing gently bit her lips while uneasiness surged in her eyes.\u003c/p\u003e\n\u003cp\u003eLin Dong slightly narrowed his eyes. He looked outside and saw a burly man standing in front of the group. This man was baring his upper body, while the surface of his body gave off the lustre of black rock. A brutal and ferocious aura spread from him\u003c/p\u003e\n\u003cp\u003eAt this moment, this figure was riding a huge blood red bat as he smiled and looked at the Nine-tail village.\u003c/p\u003e\n\u003cp\u003eThe light barrier covering the nine-tail village rippled soon after the loud laughter sounded as Aunt Xin led some experts from the Nine-tail village and stepped out.\u003c/p\u003e\n\u003cp\u003e“Haha, Chief Xin, it is time to hand over the tribute. I believe that there is no need for me to tell you the amount, am I right?” The man seated on the blood bat, smilingly looked at Aunt Xin and spoke in a lazy manner.\u003c/p\u003e\n\u003cp\u003e“Oh, it is Lord Qin Gang…” Aunt Xin nodded. She waved her hand before a Qiankun bag flew towards the man called Qin Gang. “There are ten million Xuan Yuan Pills inside.”\u003c/p\u003e\n\u003cp\u003eQin Gang grabbed the Qiankun Bag. He casually glanced at it before tossing it to his subordinate behind and laughed, “Chief Xin is really easy to talk to.”\u003c/p\u003e\n\u003cp\u003e“My Nine-tail tribe still requires the protection of the Hundred Beast Ridge. It is only natural that we offer this tribute.” Aunt Xin lowered her head and said.\u003c/p\u003e\n\u003cp\u003e“Does Chief Xin really think so?” Qin Gang asked playfully.\u003c/p\u003e\n\u003cp\u003eAunt Xin stiffened slightly before quickly nodding.\u003c/p\u003e\n\u003cp\u003e“Where is that girl Xin Qing? Why didn’t she come to visit me now that she has returned?” Qin Gang smiled and asked.\u003c/p\u003e\n\u003cp\u003eAunt Xin’s expression changed. She hurriedly said, “Lord Qin Gang, my daughter is training in the outside world and has yet to return.”\u003c/p\u003e\n\u003cp\u003e“Do you really think that my Hundred Beast Ridge is blind?” Qin Gang laughed cold as he stared at Aunt Xin and said, “You should know how I feel about Xin Qing. If she comes with me, your Nine-tail tribe will be able to enjoy the complete protection of my Hundred Beast Ridge. Moreover, there is no need to hand over such a large tribute every year. Can’t you recognise the benefits?”\u003c/p\u003e\n\u003cp\u003eAunt Xin’s expression fluctuated.\u003c/p\u003e\n\u003cp\u003e“I will be waiting here today. If you don’t allow that girl to come out, I can only lead some of my men into the village and search for her.” Qin Gang crossed his hands over his chest and spoke indifferently.\u003c/p\u003e\n\u003cp\u003eThe expressions of Aunt Xin and the elders of the Nine-tail Village became extremely ugly. However, they did not dare to show their anger. This lead to a stalemate between the two parties for a time.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Qin Gang knows that you have returned.” Lin Dong, who was observing the area outside of the village, suddenly turned his head towards Xin Qing, who had been peeping outside, and said.\u003c/p\u003e\n\u003cp\u003eXin Qing’s pretty face changed upon hearing this. She involuntarily cried out indignantly, “That persistent and hateful fellow!”\u003c/p\u003e\n\u003cp\u003e“Those fellows refuse to leave…”\u003c/p\u003e\n\u003cp\u003eA young lady glanced at Xin Qing in a somewhat worried manner. Things would likely worsen once those men ran out of patience. Although they could not enter the village if they activated the Nine-tail village formation, they would definitely offend Qin Gang. Their Nine-tail village might be at the junction between Hundred Beast Ridge and Deep Lightning Mountain, but they did not belong to either side. Hence, Deep Lightning Mountain would not help them if Hundred Beast Ridge caused them trouble.\u003c/p\u003e\n\u003cp\u003eThe young lady secretly glanced at Lin Dong as she spoke. She was about to speak when Xin Qing by the side glared at her. All she could do was to shut her mouth.\u003c/p\u003e\n\u003cp\u003eWhen Xin Qing saw this situation, she secretly sighed. She was clearly aware of Lin Dong’s character. If they were to open their mouths and beg, the latter would definitely lend them a hand. However, Qin Gang was not Cao Ying. Even if he could defeat Qin Gang, what about the aftermath? It would undoubtedly be a declaration of war on Hundred Beast Ridge. That huge faction… How could Lin Dong oppose them all by himself?\u003c/p\u003e\n\u003cp\u003eAt that time, Lin Dong would undoubtedly find himself in great danger.\u003c/p\u003e\n\u003cp\u003e“More people are arriving…” Lin Dong looked outside of the village. It was as if he did not detect the exchange of glances between those girls behind him, as he spoke in a faint voice.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eXin Qing’s group was startled upon hearing this. They lifted their heads and heard rumbling sounds transmitted from another direction.\u003c/p\u003e\n\u003cp\u003e“Could it be members from the Deep Lightning Mountain? They actually came at the same time...”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eRumble!\u003c/p\u003e\n\u003cp\u003eThe ground shook as dust surged. A large group of people rapidly approached from a great distance away. Finally, they arrived at the Nine-tail village under the stunned eyes of Aunt Xin’s group. It was possible to see a fluttering flag with the word mountain within the group.\u003c/p\u003e\n\u003cp\u003e“It is the Mountain General from Deep Lightning Mountain, Meng Shan…”\u003c/p\u003e\n\u003cp\u003eQin Gang frowned as he looked at the group that had arrived. Clearly, he did not expect to meet members of Deep Lightning Mountain.\u003c/p\u003e\n\u003cp\u003e“Qin Gang? It is surprising that you are here too.” When Qin Gang discovered the leader of this group, the latter had also noticed his presence. The latter was startled as he curled the corner of his mouth and said.\u003c/p\u003e\n\u003cp\u003eThe person who had arrived had a skinny figure. His skin was dark yellow in colour. If one was to look carefully, one would discover a layer of yellowish tiny scales that appeared somewhat mysterious.\u003c/p\u003e\n\u003cp\u003e“Lord Meng Shan… it isn’t time for Deep Lightning Mountain to collect their tribute, is it?” Aunt Xin Qing looked at Meng Shan and asked.\u003c/p\u003e\n\u003cp\u003e“Hehe, I am not here to collect tribute from your Nine-tail village.” Meng Shan glanced at Aunt Xin and laughed. After which, he threw his somewhat shady eyes towards the Nine-tail village.\u003c/p\u003e\n\u003cp\u003e“I am here to look for a human. He is called Lin Dong… You should know.”\u003c/p\u003e\n\u003cp\u003eAunt Xin’s expression slightly altered. She said, “We do not know…”\u003c/p\u003e\n\u003cp\u003e“Hehe, Chief Xin, please don’t lie to him. Based on what I know, Blood Python City spent a great fortune to cause trouble for Lin Dong. Clearly, he is hired by them.” Qin Gang laughed strangely. He really wanted the Nine-tail tribe to offend Deep Lightning Mountain. At that time, the Nine-tail tribe will have no choice but to cede to his demands.\u003c/p\u003e\n\u003cp\u003eAunt Xin clenched her hands tightly. Her eyes were deeply worried. It was likely that she did not expect things to develop like this...\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Oh, it seems that I have been dragged into this matter…” In the village, Lin Dong suddenly smiled as he stood up.\u003c/p\u003e\n\u003cp\u003e“Sir Lin Dong, why don’t you leave from the back?” Xin Qing suddenly grabbed Lin Dong’s clothes as she spoke with red eyes. She was aware of how troublesome it would be if he got dragged into the matter.\u003c/p\u003e\n\u003cp\u003e“Although I don’t like trouble…” Lin Dong rubbed Xin Qing’s small head and smiled. However, his pitch black eyes contained an extremely sharp expression.\u003c/p\u003e\n\u003cp\u003e“I am not afraid of it .”\u003c/p\u003e\n\u003cp\u003e“In this world, if one choose to hide when faced with trouble, there will come a time when one can no longer hide. Instead of that… it is best to get rid of the root of the problem right from the beginning.”\u003c/p\u003e\n\u003cp\u003e“But that is Deep Lightning Mountain. They are much stronger than Blood Python City.” Xin Qing hurriedly said.\u003c/p\u003e\n\u003cp\u003e“Relax.”\u003c/p\u003e\n\u003cp\u003eLin Dong comforted her. His body moved and turned into a light figure that hurried out of the village.\u003c/p\u003e\n\u003cp\u003eXin Qing could only stomp her feet gently upon seeing this. After which, she lifted her head and looked outside of the village. A large group of people had already completely surrounded her entire village. The atmosphere inside the Nine-tail village became a little uneasy due to this.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA distance away from the Nine-tail village, the land beneath suddenly trembled, as Lin Dong exited the village. A black torrent surged past just like floodwater. This group was rather stealthy as they swiftly travelled. The dark red eyes were like ferocious beasts. Given the aura of this group, they could be considered as an army…\u003c/p\u003e\n\u003cp\u003eThat almost corporeal ferocious aura was far superior compared to those people from the Blood Python City!\u003c/p\u003e\n\u003cp\u003eA black flag swayed with the wind amongst this black army. There was a huge bloody word on it. It looked like an absolute, ferocious tiger that was about to break free from the flag.\u003c/p\u003e\n\u003cp\u003eThat word was… Yan.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1050\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1052\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1051","bookId":1514,"creation":"Sep 10, 2019 7:28:55 AM","modification":"Sep 10, 2019 7:28:55 AM"}
