{"id":60848,"no":1092,"title":"Chapter 1090: Fighting the Samsara stage","content":"\u003cp\u003eChapter 1090: Fighting the Samsara stage\u003c/p\u003e\n\u003cp\u003eCountless practitioners on Divine Item Mountain Range could faintly see the craziness gathering in Lin Dong’s eyes. All of their expressions were rather interesting. It was impossible for them to imagine just where the latter got the courage to fight back against three great Samsara stage experts…\u003c/p\u003e\n\u003cp\u003eSuch resistance was undoubtedly akin to striking a stone with an egg. He had courage, but this was too reckless.\u003c/p\u003e\n\u003cp\u003e“Ha ha, what an interesting fellow.”\u003c/p\u003e\n\u003cp\u003eThe Ghost Condor Demon Commander softly chuckled. His eyes were filled with interest as he stared at Lin Dong. It was likely that this was the first time he had seen someone who dared to utter such words in front of three Samsara stage super experts with the strength of the initial Profound Death stage.\u003c/p\u003e\n\u003cp\u003e“What an unyielding individual.” The Golden Ape Demon Commander also nodded. If it was not because the Divine Item Treasury was far too important, he might feel some admiration for Lin Dong’s actions.\u003c/p\u003e\n\u003cp\u003e“He has always been this arrogant.”\u003c/p\u003e\n\u003cp\u003eThe Heaven Dragon Demon Commander frowned. His eyes were icy and filled with ridicule as he stared at Lin Dong, like a cat teasing a mouse. “I can only say that you have terrible luck to end up in this situation.”\u003c/p\u003e\n\u003cp\u003eDeep Lightning Mountain did indeed possess some strength and Blood Dragon Hall would have to pay a price in order to destroy it. Unfortunately, the other two great Demon Commanders had joined in. In this way, the destruction of Deep Lightning Mountain was basically set in stone.\u003c/p\u003e\n\u003cp\u003eIf the three great Demon Commanders truly wanted to join hands and eliminate something from the Beast War Region, no other outcome was possible.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were ice-cold as he slowly stepped forward in the face of the shockingly powerful pressure from the three great Demon Commanders. After which, his black eyes looked towards the Heaven Dragon Demon Commander as his lips parted into a smile. “Come on Heaven Dragon Demon Commander. Haven’t you been itching to deal with me for quite some time?”\u003c/p\u003e\n\u003cp\u003e“I will let you die without any resentment.” The Heaven Dragon Demon Commander’s expression was dark and solemn while murderous intent surged within his eyes. Lin Dong was right. He had been holding back for a long time…\u003c/p\u003e\n\u003cp\u003e“Little Flame, the puppet will stop one of the Demon Commanders. I’ll leave the other one to you.” Lin Dong turned his head and looked towards Little Flame. After which, he pointed at the Sky Devouring Corpse beside him.\u003c/p\u003e\n\u003cp\u003e“Okay, I will attack together with the Tiger Devouring Army.” Little Flame nodded in a serious manner. He did not possess Lin Dong’s many techniques, hence he needed to borrow the power of the Tiger Devouring Army in order to make up for the enormous gap.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded. He pondered for a while before waving his hand. A black light shot out from his sleeve and flew towards Little Flame.\u003c/p\u003e\n\u003cp\u003e“What is this?”\u003c/p\u003e\n\u003cp\u003eLittle Flame grabbed it and felt his arm suddenly sink. His eyes hardened as power circulated in his body, allowing him to stably hold it. He looked over and saw a giant black hammer in his hand. Extremely complex and obscure symbols covered the giant hammer while a heavy feeling spread from it. It was as though the surrounding air had become viscous.\u003c/p\u003e\n\u003cp\u003eLittle Flame’s eyes were burning while the strength within his body was circulated to the limits. After which, the hammer was swung downwards and everyone was dumbstruck as an incomparably huge crack extended on the ground like a giant python at lightning speed. It directly split a distant mountain into two!\u003c/p\u003e\n\u003cp\u003e“Excellent weapon!”\u003c/p\u003e\n\u003cp\u003eLittle Flame grinned. This divine hammer was incomparably heavy and just happened to suit his strong and tyrannical body.\u003c/p\u003e\n\u003cp\u003e“All warriors of Deep Lightning Mountain. You will all be rewarded if we are able to successfully return.” Lin Dong looked at Chen Tong’s group and said.\u003c/p\u003e\n\u003cp\u003eUpon hearing these words, Chen Tong and the rest looked at the giant black hammer that was giving off frightening ripples in Little Flame’s hands before they firmly nodded. Something like a divine object was too far fetch for them. Given their capabilities, they would likely only be able to dream about owning one in their lifetimes. Yet, the current Lin Dong had the ability to fulfil his words.\u003c/p\u003e\n\u003cp\u003eThe pupils of the many surrounding experts shrunk upon seeing this and the greed in their eyes intensified. Everyone could tell that the giant black hammer in Little Flame’s hand was definitely an ancient divine object that was ranked on the Ancient Divine Object Ranking!\u003c/p\u003e\n\u003cp\u003e“Looks like you have indeed gained quite a lot.”\u003c/p\u003e\n\u003cp\u003eThe Heaven Dragon Demon Commander trio’s eyes were burning with excitement as they stared at the giant black hammer in Little Flame’s hand. They could detect a familiar fluctuation from the giant hammer that allowed them to recognise that this was the item they had ultimately failed to obtain earlier.\u003c/p\u003e\n\u003cp\u003e“Want it? Let’s see if you have the ability to take it!” Lin Dong sneered. His words were as sharp as blades. Since they had already fallen out with each other, there was no longer a need to be act polite.\u003c/p\u003e\n\u003cp\u003e“Leave this brat to me.” The Heaven Dragon Demon Commander spoke in an eerie voice. His desire to murder Lin Dong had already reached the point where he could no longer restrain himself.\u003c/p\u003e\n\u003cp\u003e“In that case, leave that General Yan to me.” The Golden Ape Demon Commander looked at Little Flame and spoke in a faint voice.\u003c/p\u003e\n\u003cp\u003e“I shall see just how strange this puppet is.” The Ghost Condor Demon Commander looked at the Sky Devouring Corpse with a peculiar expression in his eyes. It was likely that this was the first time he had seen such a powerful puppet.\u003c/p\u003e\n\u003cp\u003eThe three great Demon Commanders did not use the battle power of their subordinates. Although they understood that this would save them a lot of trouble, they were after all the three strongest factions in the Beast War Region. The three of them alone were already able to suppress practically any opponent, hence, there was no need to use their subordinates.\u003c/p\u003e\n\u003cp\u003eLin Dong stared at the mocking face of the Heaven Dragon Demon Commander. His body slowly rose into the air as the Yuan Power within it was circulated to the limit. Rich green light spread around his body while a vague dragon sounded from within it.\u003c/p\u003e\n\u003cp\u003e“I will let you understand just how foolish it is to offend a Samsara stage expert.”\u003c/p\u003e\n\u003cp\u003eThe Heaven Dragon Demon Commander indifferently looked at Lin Dong. Soon after, he lifted his hand and waves of black white energy rapidly gathered at his fingertips. Rich life and death power merged together, emitting an extremely terrifying ripple.\u003c/p\u003e\n\u003cp\u003eThis was the power that approached reincarnation, its mysteriousness connected heaven and earth.\u003c/p\u003e\n\u003cp\u003e“Roar!”\u003c/p\u003e\n\u003cp\u003eA hundred green dragon light tattoos suddenly whistled out from within Lin Dong’s body. His expression was indifferent and he had no intentions of warming up. A hundred dragon soared and a punch was thrown.\u003c/p\u003e\n\u003cp\u003eHe clearly understood that even with his current strength, he must use his full power when facing a Samsara stage expert!\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA hundred green dragon light tattoos gathered together. They flew through the sky like a green comet, causing the faces of many powerful individuals to turn somewhat grave. Even those perfect Profound Death stage experts did not dare to directly receive an attack of this level.\u003c/p\u003e\n\u003cp\u003e“Do you still believe that I am the demonic spiritual body from a month ago?”\u003c/p\u003e\n\u003cp\u003eUpon seeing this, the Heaven Dragon Demon Commander sneered. Black white energy gathered on his fingertips, turning into a palm sized black white scale. The scale was covered all over by densely packed sawteeth while an extremely sharp feeling seeped out from it. It was as though space itself could be severed.\u003c/p\u003e\n\u003cp\u003e“On account of how you have helped retrieve all the divine objects from the Divine Item Treasury, I shall let you witness the power of a Samsara stage expert.”\u003c/p\u003e\n\u003cp\u003e“Life and Death Scale.”\u003c/p\u003e\n\u003cp\u003eThe Heaven Dragon Demon Commander flicked his finger and that black white scale shot forward. It was extremely quick. Cracks were formed in space as it shot past. Soon after, everyone saw the black white light collide against the green comet.\u003c/p\u003e\n\u003cp\u003eCh!\u003c/p\u003e\n\u003cp\u003eNo overly loud sound was emitted. Everyone could only see the green light disintegrate while the tiny black white light charged forward like a hot knife through butter, directly cutting through the green light formed by a hundred green dragon light tattoos.\u003c/p\u003e\n\u003cp\u003eA Samsara stage expert was indeed frightening!\u003c/p\u003e\n\u003cp\u003eBlack white light tore through the green light. Its momentum was not reduced as it mercilessly shot towards Lin Dong.\u003c/p\u003e\n\u003cp\u003eClang!\u003c/p\u003e\n\u003cp\u003eHowever, a large scarlet red cauldron appeared when the black white light was about to hit Lin Dong. A metallic sound appeared and the large cauldron was immediately blown away. A deep dent had appeared on the hard cauldron surface.\u003c/p\u003e\n\u003cp\u003eLin Dong looked at the dent on the Burning Sky Cauldron as his eyes hardened and graveness rose within his heart. Only after truly fighting against an expert of this level did he realise just how terrifyingly powerful they were.\u003c/p\u003e\n\u003cp\u003e“Eight Level Burning Sky Gate!”\u003c/p\u003e\n\u003cp\u003eThe expression in Lin Dong’s eyes changed rapidly. With an icy shout, eight scarlet red light rays suddenly whizzed out from the Burning Sky Cauldron, turning into eight scarlet red doors in the sky. Energy spluttered out from them, transforming into a giant volcano, which descended towards the Heaven Dragon Demon Commander.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eLightning flashed in Lin Dong’s hand and the Lightning Emperor Scepter appeared. Nine lightning dragons rushed out from it while thunder filled the sky.\u003c/p\u003e\n\u003cp\u003eLin Dong used all sorts of techniques right from the beginning in the face of such an opponent. His attacks were overwhelming, causing rich surprise to surface in the eyes of the countless experts around them. This was the first time they had seen an initial Profound Death stage expert that possessed such formidable battle power…\u003c/p\u003e\n\u003cp\u003e“Insignificant tricks!”\u003c/p\u003e\n\u003cp\u003eHowever, the Heaven Dragon Demon Commander merely laughed in the face of these ferocious attacks. His body did not move. Only when the attacks were about to fall upon him did black white light gather outside of his body and turn into circular black white light barrier.\u003c/p\u003e\n\u003cp\u003eBang bang!\u003c/p\u003e\n\u003cp\u003eA volcano and lightning dragons ruthlessly struck the black white light barrier, but he remained as steady as a rock. Black white light flowed like the fusion of life and death, and nothing could shake it.\u003c/p\u003e\n\u003cp\u003eThe energy ripples gradually faded. Everyone gazed at the Heaven Dragon Demon Commander, who was completely safe under the protection of the black white light barrier, as they quietly shook their heads. The gap between the two was far too humongous...\u003c/p\u003e\n\u003cp\u003e“You are indeed very powerful…” Lin Dong gently lowered his hands upon seeing this scene, while an emotional sigh flitted across his black eyes. The Samsara stage was indeed very powerful. However, compared to the helplessness he felt a year ago, the him of now was overflowing with battle intent.\u003c/p\u003e\n\u003cp\u003e“You should stop struggling if you have given up. It will be easier on you.” The Heaven Dragon Demon Commander smiled. His smile sent a chill straight into one’s bone.\u003c/p\u003e\n\u003cp\u003e“Given up?”\u003c/p\u003e\n\u003cp\u003eLin Dong raised his head and stared at the Heaven Dragon Demon Commander. Subsequently, mockery appeared from the corners of his mouth. He had not given up when he was so weak back then in Unique Devil City. Even less needed to be said about the current situation.\u003c/p\u003e\n\u003cp\u003e“Don’t you wish to know what I obtained from the Divine Item Treasury?”\u003c/p\u003e\n\u003cp\u003eLin Dong laughed. He slowly lifted his hand as five different colored lights gathered within it. At the same time, an extremely frightening ripple emanated from the five color light. It seemed as though the Yuan Power in the area had suddenly started to rebel at this very moment.\u003c/p\u003e\n\u003cp\u003e“Since you wish to know… I shall show you.”\u003c/p\u003e\n\u003cp\u003eA soft voice faded as the five color light condensed. Under the converging Yuan Power, a palm sized mini ancient palace appeared in Lin Dong’s palm.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1089\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1091\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1090","bookId":1514,"creation":"Sep 10, 2019 7:28:55 AM","modification":"Sep 10, 2019 7:28:55 AM"}
