{"id":60872,"no":1116,"title":"Chapter 1114: Helper","content":"\u003cp\u003eChapter 1114: Helper\u003c/p\u003e\n\u003cp\u003eThe area in the vicinity of the Dragon Transformation Pool was in an uproar. Numerous gazes on the surrounding mountains looked at the churning Dragon Transformation Pool in astonishment.\u003c/p\u003e\n\u003cp\u003eAll the members of the Dragon tribe were well aware that the energy within this Dragon Transformation Pool had reached a terrifyingly high amount. Hence, the water in the pool was so viscous that it was practically unable to move. Yet, raging waves had now emerged in the Dragon Transformation Pool, which would not form even the slightest ripple even if a mountain was thrown into it.\u003c/p\u003e\n\u003cp\u003e“What is happening?”\u003c/p\u003e\n\u003cp\u003eSome of the younger generation from the Dragon tribe looked to each other. They were clearly unaware of the hidden bone burial ground in the Dragon Transformation Pool. Additionally, they had only been able to glean a minimal amount of information about the Six Finger Sage Dragon Emperor from ancient texts. Nevertheless, it was sufficient to cause their hearts to churn. After all, in the many years of Demonic Beast World history, only the Six Finger Sage Dragon Emperor alone had managed to unite all the powerful tribes within the Demonic Beast World!\u003c/p\u003e\n\u003cp\u003e“This is…”\u003c/p\u003e\n\u003cp\u003eThe extremely ancient elders around Yuan Qian no longer had their earlier indifference. Shock covered their aged faces. Given their identities, they were naturally somewhat aware of the bone burial ground. However, ordinarily speaking, only those fated individuals could enter that place…\u003c/p\u003e\n\u003cp\u003e“These fluctuations belong to ancestor.” Yuan Qian’s expression was grave as he looked at the other elders and said, “Someone has entered the bone burial hall. Moreover, he has come into contact with the will of the ancestor.”\u003c/p\u003e\n\u003cp\u003e“Who?” An elder asked anxiously. Not everyone who entered the Dragon Transformation Pool could enter the bone burial hall. Only those fated ones with great determination could succeed. Moreover, once one entered, one would have a certain chance to obtain the Ancient Dragon Bone. If successful, it would be a relatively important matter to their Dragon tribe.\u003c/p\u003e\n\u003cp\u003e“I am not sure yet.”\u003c/p\u003e\n\u003cp\u003eYuan Qian gently shook his head. His eyes were excited as he watched the churning Dragon Transformation Pool. However, Lin Dong’s face suddenly flashed across his mind. He quickly shook his head. It’s… unlikely, right?\u003c/p\u003e\n\u003cp\u003e“If it is Lin Dong, the Ancient Dragon Bone he manages to obtain…” An elder by the side spoke in a low voice. The Ancient Dragon Bone was an extremely important treasure of their Dragon tribe. As long as an Ancient Dragon Bone was obtained, it would be possible to create a tribe member with shocking potential. If Lin Dong was to obtain one, they would lose one set. Moreover, the thing that gave them all a headache was that Lin Dong did not belong to the Dragon tribe. He did not even have the slightest bit of Dragon tribe bloodline in his body.\u003c/p\u003e\n\u003cp\u003e“Let’s observe the situation first.” Yuan Qian suppressed the indescribable expressions of the elders from the Dragon tribe and sighed helplessly in his heart.\u003c/p\u003e\n\u003cp\u003eThe disturbance in the Dragon Transformation Pool grew increasingly intense with the flow of time. Around half an hour later, two whirlpools suddenly formed within the Dragon Transformation Pool. After which, two figures shot out under the attention of numerous gazes.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eEveryone’s eyes shot towards the two figures that were shooting towards the sky and exclamations quickly sounded.\u003c/p\u003e\n\u003cp\u003e“It is Yan Feng and Yuan Xin. Both of them have succeeded.”\u003c/p\u003e\n\u003cp\u003e“Base on these ripples, they should have top grade Dragon Bones. How impressive.”\u003c/p\u003e\n\u003cp\u003eLight scattered in the sky, revealing Yuan Xin and Yan Feng. At this moment, their bodies appeared a little straighter and their eyes contained sharp and bright glints while black light seemingly flowed under their skin.\u003c/p\u003e\n\u003cp\u003e“Top grade Dragon Bones.”\u003c/p\u003e\n\u003cp\u003eThe sharp elders identified the grade of the Dragon Bones obtained by the two with a glance. Immediately, they exchanged glances and smiled bitterly. If this was some other time, having two young members of the tribe obtain top grade Dragon Bones was already rather good news. However, they were currently unable to feel any joy.\u003c/p\u003e\n\u003cp\u003eSince the Yuan Xin duo had already exited the Dragon Transformation Pool, only Lin Dong was left inside it. It was obvious that the person who had entered the bone burial hall and came into contact with the will of the ancestor was him.\u003c/p\u003e\n\u003cp\u003e“Aih, this was also the case with Qing Zhi back then. However, at least he still possess the bloodline of our Dragon tribe. Now however, this is someone with no bloodline connection at all.” An elder of the Dragon tribe sighed helplessly.\u003c/p\u003e\n\u003cp\u003eThe other elders also had strange expressions on their faces. If Lin Dong possessed even the tiniest bit of dragon bloodline, they would perhaps all start dancing in excitement. Unfortunately… this person was a true blue human. Moreover, he was a human who was completely unrelated to them.\u003c/p\u003e\n\u003cp\u003e“Tribe leader... “ All the elders looked at Yuan Qian. Clearly, this matter had given them a headache.\u003c/p\u003e\n\u003cp\u003e“Let’s watch how the situation develops. Although Lin Dong has entered the bone burial hall, it does not mean that he will be able to obtain the Ancient Dragon Bone… moreover, even if he does, it is not a big deal. Perhaps, it is time for the some of the pedantic rules of our Dragon tribe to change.” Yuan Qian placed both of his hands behind him. His eyes were burning with excitement as he looked at the Dragon Transformation Pool and muttered.\u003c/p\u003e\n\u003cp\u003e“Lin Dong… if you have the ability, my Dragon tribe can make an exception for you this one time!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA monstrous pressure suddenly spread in the ancient wildlands as a purplish gold dragon claw seemed to tear apart space itself. It ruthlessly swatted at a figure that was giving off an astonishing aura with extremely terrifying speed.\u003c/p\u003e\n\u003cp\u003eA low and deep sound appeared and the figure shot downwards in a miserable manner. Finally, it smashed into the ground like a cannonball, creating a giant ten thousand feet deep hole.\u003c/p\u003e\n\u003cp\u003e“Cough.”\u003c/p\u003e\n\u003cp\u003eA miserable figure coughed intensely within the large pit. His body was drenched in blood while the originally brilliant green light had dimmed significantly.\u003c/p\u003e\n\u003cp\u003eThis figure naturally belonged to Lin Dong, who had challenged the Six Finger Sage Dragon Emperor. However, his challenge had the same powerless feeling as a mayfly attempting to shake a tree in the face of this once terrifying person.\u003c/p\u003e\n\u003cp\u003eEven though all that remained of this peak expert, who was once on par with the eight ancient masters, was a mere fragment of his will, he was still extremely powerful.\u003c/p\u003e\n\u003cp\u003e“Your strength and your courage do not match.” The Six Finger Sage Dragon Emperor was seated on a lotus stone base in the sky. His eyes were indifferent as he looked at the miserable figure below and spoke in a faint voice.\u003c/p\u003e\n\u003cp\u003e“Your current self cannot obtain my recognition. Therefore, you should give up.”\u003c/p\u003e\n\u003cp\u003eIn the deep pit, Lin Dong wiped off the trace of blood at the corner of his mouth and lifted his head. Those pitch-black eyes were filled with a wild desire to fight as he stared at the Six Finger Sage Dragon Emperor. He did not refute the latter’s words. Instead, he suddenly stepped forward as surging green light emerged once again. A dragon roar subsequently reverberated across the sky as the green light wrapped around his body and he gradually transformed into a ten thousand feet large green dragon.\u003c/p\u003e\n\u003cp\u003eThe green dragon coiled on the ground as battle desire rose within those dragon eyes. An iciness and boldness flickered on the green dragon scales all over its body, making it seem as if it was made from metal.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eThe green dragon jerked and suddenly transformed into a flash of green light that swept forth. A frightening shock wave accompanied it as it charged directly towards the Six Finger Sage Dragon Emperor in the sky. A trail of green light seemed to remain wherever he passed.\u003c/p\u003e\n\u003cp\u003e“Oh? What a familiar fluctuation. Someone who practiced this martial art seems to have come here before…” The Six Finger Sage Dragon Emperor looked at the green dragon that was rushing over, but merely smiled and slowly shook his head. “However, this is still not enough.”\u003c/p\u003e\n\u003cp\u003eHe extended his long jade like hand after his voice sounded. With a gentle wave, his hand instantly swelled and grew a hundred thousand feet in size. It blotted out the sun and ruthlessly swatted the body of the rapidly approaching green dragon.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eBlood splattered in the sky and the green dragon was torn apart an inch at a time. It let out a sorrowful roar towards the heavens. However, the seemingly huge force did not even shake the giant hand. Instead, it was once again smashed downwards, creating another hundred thousand feet gorge on the vast ground below.\u003c/p\u003e\n\u003cp\u003eGreen light dimmed and disappeared as the green dragon once again turned back into a human. Lin Dong’s expression was deathly pale while blood continuously to dripped from his pores. His appearance was exceptionally wretched.\u003c/p\u003e\n\u003cp\u003e“The person who had practiced this martial art back then had a much greater attainment in it than yourself. However, even he ended up failing. You should be related to him, right?” The Six Finger Sage Dragon Emperor faintly smiled and said.\u003c/p\u003e\n\u003cp\u003eLin Dong bitterly smiled. Had elder Qing Zhi also come to this place? It was unexpected that even someone as strong as the latter had returned in defeat. Could it be that it was impossible for him to obtain this strongest ‘Primal Dragon Bone’?\u003c/p\u003e\n\u003cp\u003eHe was truly unwilling to accept this.\u003c/p\u003e\n\u003cp\u003e“It is not completely impossible.” Yan’s faint voice was emitted at this moment.\u003c/p\u003e\n\u003cp\u003e“Do you have a solution?” Lin Dong licked off the trace of blood at the corner of his mouth.\u003c/p\u003e\n\u003cp\u003e“This Six Finger Sage Dragon Emperor is merely a remnant will. You must defeat this will if you wish to beat him… however, with your current strength, you are completely no match for it.”\u003c/p\u003e\n\u003cp\u003e“Therefore, you need a helper.”\u003c/p\u003e\n\u003cp\u003e“Helper? You?’ Lin Dong was taken aback.\u003c/p\u003e\n\u003cp\u003e“Presently, even I cannot beat him…”\u003c/p\u003e\n\u003cp\u003eYan lazily said. “You possess the Devouring Ancestral Symbol with you. Due to the death of the Devouring Master, there should be a remnant will of the Devouring Master in the Devouring Ancestral Symbol. If you can communicate with this lingering will, you might perhaps be able to summon the Devouring Master. Only then will you be able to defeat the Six Finger Sage Dragon Emperor in this willpower domain.”\u003c/p\u003e\n\u003cp\u003eLin Dong was quiet after hearing this. He sat down and shut both of his eyes and all undulations around him gradually disappeared.\u003c/p\u003e\n\u003cp\u003eThe Six Finger Sage Dragon Emperor in the sky raised his eyebrow upon seeing this and stared at Lin Dong with some interest. He really wished to see just what other techniques this young man was going to bring out…\u003c/p\u003e\n\u003cp\u003eThe wildlands sunk into a strange silence because of this.\u003c/p\u003e\n\u003cp\u003eThis silence continued for three full days. The Six Finger Sage Dragon Emperor did not disturb Lin Dong during these three days. All he did was look down at this skinny figure with an unchanging expression.\u003c/p\u003e\n\u003cp\u003eAs a previous king like figure in the Demonic Beast World, he gave off a proud and unyielding aura despite being a mere lingering will.\u003c/p\u003e\n\u003cp\u003eHowever, it was obvious that this Six Finger Sage Dragon Emperor did not intend to continue this meaningless wait. Hence, he finally turned his eyes downwards on the third day as his faint voice resounded in the sky.\u003c/p\u003e\n\u003cp\u003e“Little one, your time is almost up. If you wish to select a Dragon Bone, you should go and try your luck with the others.”\u003c/p\u003e\n\u003cp\u003eHe waved his sleeve after his voice sounded and a purplish gold light pillar shot out before enveloping Lin Dong.\u003c/p\u003e\n\u003cp\u003eBuzz!\u003c/p\u003e\n\u003cp\u003eHowever, the space in front of Lin Dong suddenly split apart just as the purplish gold light pillar was about to hit him. It reached out like a giant mouth of darkness and instantly swallowed the purplish gold light pillar.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eThis sudden scene caused the Six Finger Sage Dragon Emperor to be startled. Both of his eyes stared intently at the area behind Lin Dong. The space there slowly distorted and a figure stepped out from the end of the distorted space.\u003c/p\u003e\n\u003cp\u003e“Ha ha, you bizarre six fingered dragon. You are already dead, yet you still bully the younger generation. Aren’t you ashamed?” A clear laughter resounded across the sky when the human figure slowly walked out from the distorted space.\u003c/p\u003e\n\u003cp\u003eThe pupils of the usually calm Six Finger Sage Dragon Emperor finally tightened when this voice was emitted. Soon after, his low voice contained some bewilderment as it sounded.\u003c/p\u003e\n\u003cp\u003e“Devouring… Master?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1113\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1115\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1114","bookId":1514,"creation":"Sep 10, 2019 7:28:55 AM","modification":"Sep 10, 2019 7:28:55 AM"}
