{"id":60885,"no":1129,"title":"Chapter 1127: Intense Fight With Luo Tong","content":"\u003cp\u003eChapter 1127: Intense Fight With Luo Tong\u003c/p\u003e\n\u003cp\u003eRoar!\u003c/p\u003e\n\u003cp\u003eA clear dragon roar erupted from within Lin Dong’s body. Subsequently, it reverberated across the sky. Bright green light enveloped around the surface of his body, before a powerful pressure radiated from him.\u003c/p\u003e\n\u003cp\u003e“Dragon tribe martial arts?\u003c/p\u003e\n\u003cp\u003eA slight tinge of shock flashed across Luo Tong’s eyes after he heard that dragon roar. Promptly, he shook his head. It’s no wonder this brat was so arrogant. He had actually learnt Dragon tribe martial arts. However, did he really think that he could act haughtily in front of him because of this?\u003c/p\u003e\n\u003cp\u003e“Even if a genuine Dragon tribe elder is standing in front of me today, he would not dare to be as arrogant as you. You are only a human who has learnt Dragon tribe martial arts. What gives you the qualifications to act so haughtily?”\u003c/p\u003e\n\u003cp\u003eLuo Tong let out a cold ridicule. His eyes were dense and cold. Soon after, he clenched his large hand. Immediately, brilliant Yuan Power gathered in the sky like floodwaters. In a few breaths’ time, they transformed into a huge brilliant pair of glowing wings. The edge of these wings were covered with sawteeth and even the space itself began to tremble as the light flowed.\u003c/p\u003e\n\u003cp\u003eLuo Tong curled his finger. His brilliant glowing wings, which were filled with danger, whistled forward. In a flash, it penetrated through space and ruthlessly shot explosively towards Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eLin Dong snorted coldly in his heart after he saw Luo Tong unleashing his attack. Stomping his foot onto the ground, the stage promptly shook. Following which, resplendent green light swept forth and it was possible to see many green dragon light tattoos emerging from within his body.\u003c/p\u003e\n\u003cp\u003eThree hundred!\u003c/p\u003e\n\u003cp\u003eThe green dragon light tattoos rose. Shockingly, in the blink of an eye, there were three hundred of them. It turns out that Lin Dong’s Green Heaven Materialized Dragon Skill was upgraded as his strength improved. Right now, Lin Dong was able to rely on his own strength to form three hundred green dragon light tattoos. When he fought with the Hua Chen duo back at the Flame Divine Hall, Lin Dong had to rely on the strength of his Great Desolation Scripture in order to form three hundred green dragon light tattoos...\u003c/p\u003e\n\u003cp\u003eLin Dong did not dare to underestimate Luo Tong, a troublesome opponent, whose strength had far surpassed that of Hua Chen. After all, the latter’s strength far exceeded his regardless of how one puts it. Hence, he had to go all out in order to defeat the latter.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eThree hundred green dragon light tattoos came whistling forth. Lin Dong did not make any unnecessary movements as he merely took a step forward. Soon after, he threw a punch. This was an ordinary punch. All it contained was a terrifying force, which could easily destroy an entire mountain.\u003c/p\u003e\n\u003cp\u003eThe air across the sky exploded due to the terrifying pressure from the energy. Three hundred green dragon light tattoos gathered together to form a ferocious green light dragon, which tore through the sky. Finally, it ruthlessly collided against the sharp and unusually bright glowing wings.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA terrifying loud sound reverberated before a powerful assault wave spread. It was just like a hurricane blew through the world, as layers of soil on the ground were blown away.\u003c/p\u003e\n\u003cp\u003eCountless pairs of eyes turned to look. Their eyes were filled with a grave expression. Such a fight was indeed frightening.\u003c/p\u003e\n\u003cp\u003e“I shall return you the favour!”\u003c/p\u003e\n\u003cp\u003eThe bright light that enveloped the stage gradually disappeared. Lin Dong, whose body was wrapped within a green light, slowly appeared. He stared at Luo Tong, who was standing in front of him, before he laughed coldly. After which, his fist smashed ruthlessly against the ground.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA ten thousand feet large crack extended like a huge python and it reached Luo Tong’s feet instantly. Subsequently, green light erupted forth like a volcano eruption. Then, a green light large dragon attempted to devour Luo Tong.\u003c/p\u003e\n\u003cp\u003e“This favour is far too insignificant.” Luo Tong’s eyes were icy cold. Without making any visible movements, a brilliant assault light wave rose from within his body and shattered the large green light dragon. A Samsara stage expert was indeed extraordinary. Even though Lin Dong had became much stronger, his formidable attacks could still be easily dealt with by the latter.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eHowever, a phantom like figure appeared in front of Luo Tong just as the large green light dragon collapsed. A thunder sounded before a long spear with lightning flickering over it, pierced towards Luo Tong’s throat in an extremely ruthless fashion.\u003c/p\u003e\n\u003cp\u003e“Humph.”\u003c/p\u003e\n\u003cp\u003eHowever, Luo Tong simply let out a cold snort when up against this swift attack. He pressed his finger forward before a brilliant light spread. It once again turned into a glowing feather that blocked that piercing lightning spear attack.\u003c/p\u003e\n\u003cp\u003e“Swoosh swoosh swoosh!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s body moved after his attack was blocked and he actually transformed into many afterimages. His spear danced before many sharp spear shadows, which could easily kill a perfect Profound Death stage expert, enveloped every lethal spot on Luo Tong’s body.\u003c/p\u003e\n\u003cp\u003e“Clang clang clang!”\u003c/p\u003e\n\u003cp\u003eClear noises continuously reverberated across the stage. Everyone could only see a blurry figure circling Luo Tong like a whirlwind. Countless sharp spear shadows came piercing forward. However, brilliant glowing feathers would appear to block these attacks each time they were about to touch Luo Tong’s body.\u003c/p\u003e\n\u003cp\u003eOne of them was continuously raining down blows like a thunderstorm, while the other was as stable as a mountain. Every attack was intercepted by him without a single movement.\u003c/p\u003e\n\u003cp\u003e“Are your attacks merely of this standard? You can’t even break my defences, yet you dare to challenge me?” Luo Tong stared at the many afterimages as the smirk on his face grew increasingly intense.\u003c/p\u003e\n\u003cp\u003eLin Dong acted as though he did not hear Luo Tong’s ridicule as his attacks became increasingly fearsome. However, no one realized that as Lin Dong became increasingly focused, the bones within his body also began to wiggle. It looked as though an ancient dragon, which had been in a slumber for ten thousand years, was finally awakening.\u003c/p\u003e\n\u003cp\u003e“Clang!”\u003c/p\u003e\n\u003cp\u003eAnother clear sound appeared. Luo Tong extended his fingers before he directly grabbed the tip of the spear. A brilliant light flickered on the tip of his fingers, preventing the long spear from moving.\u003c/p\u003e\n\u003cp\u003e“An arrogant fool that does not know his limits.” Luo Tong gripped that long spear, while his eyes were filled with a cold ridicule as he stared at the human on the other end of the spear. However, all he saw were a pair of deep dark eyes, with a purple-gold luster rising within them. That luster was filled with a frightening and icy cold sensation.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eThose eyes with a purple-gold glint stared back at Luo Tong in an icy cold fashion. In the next moment, Lin Dong’s body shook. Following which, he directly approached Luo Tong’s body and slammed his palm forward.\u003c/p\u003e\n\u003cp\u003eRoar!\u003c/p\u003e\n\u003cp\u003eThe Primal Dragon Bone in Lin Dong’s body suddenly shook after he threw his palm forward. After which, vast and mighty energy surged forth.\u003c/p\u003e\n\u003cp\u003eThree hundred dragon light tattoos came whistling out from within Lin Dong’s body. However, the color of these dragon light tattoos had changed from green to purple-gold this time around.\u003c/p\u003e\n\u003cp\u003eThree hundred purple-gold dragon light tattoos came whistling forth. They roared towards the sky and the pressure radiating from them was several times more frightening than that of the green dragon light tattoos that Lin Dong had in the past!\u003c/p\u003e\n\u003cp\u003eThis was the transformation after his bones were replaced by the Primal Dragon Bone!\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe space in front of Lin Dong split apart and formed a huge black crack line. Meanwhile, Luo Tong’s expression finally changed at this moment. This attack from Lin Dong was several times more powerful compared to his previous attacks.\u003c/p\u003e\n\u003cp\u003e“Nine Phoenix Sky Feather Shield!”\u003c/p\u003e\n\u003cp\u003eA low and deep cry suddenly escaped Luo Tong’s mouth. Bright light surged and rapidly turned into a feather shield, that was formed by countless glowing feathers. A rich Life Death Qi lingered over his shield and there was a shockingly sturdy strength spreading from it.\u003c/p\u003e\n\u003cp\u003eHowever, Lin Dong’s attack did not pause because of this. In fact, the purple-gold glint in his eyes became even more intense. Many roars erupted from within the Primal Dragon Bone in his body. The roars reverberated within Lin Dong’s body, before they finally turned into a vast and mighty force, which surged onto Lin Dong’s palm.\u003c/p\u003e\n\u003cp\u003eThe color of the three hundred purple-gold dragon light tattoos became deeper and purer.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eThe dragon palm, which was nearly completely purple-gold in color, solemnly smashed against the feather shield. When they made contact, everyone could feel their hearts pounding intensely. Soon after, an indescribable energy assault wave swept out from within the square. The stage, which was tens of thousands of feet in size, collapsed instantly.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe assault wave swept over while countless pairs of eyes stared firmly at the source. Soon after, an onlooker’s pupils suddenly shrunk. Following which, one could hear a clear cracking sound being emitted, before a figure shot out miserably over ten thousand feet from the source of the energy assault wave. However, the figure forcefully steadied himself just as he was about to make contact with the ground.\u003c/p\u003e\n\u003cp\u003eClamor.\u003c/p\u003e\n\u003cp\u003eMany pairs of eyes looked at the figure, who had nearly crashed onto the ground. Promptly, waves of uproars suddenly erupted, while their eyes held great disbelief. This was because the person, who had nearly crashed onto the ground in defeat, was actually Luo Tong!\u003c/p\u003e\n\u003cp\u003eLin Dong had actually broken Luo Tong’s defences during the previous clash!\u003c/p\u003e\n\u003cp\u003e“What a formidable fellow!”\u003c/p\u003e\n\u003cp\u003eSome onlookers exchanged glances with each other. They could see the shock in each other’s eyes. For a peak advance Profound Death stage practitioner to break the defences of a Samsara stage expert in a head on clash, just how terrifying must that attack be?\u003c/p\u003e\n\u003cp\u003eThese two individuals from the Deep Lightning Mountain were indeed extraordinary.\u003c/p\u003e\n\u003cp\u003eBam.\u003c/p\u003e\n\u003cp\u003eLin Dong’s body slowly appeared in midair. The color of the light present on his body had changed from green to purple-gold. The light gathered behind him and seemed to form a huge purple-gold dragon, which stretched on endlessly. The large dragon lowered its head while its icy cold eyes overlooked every living creature. Its frightening pressure caused the breathing of countless experts to become ragged.\u003c/p\u003e\n\u003cp\u003eNo one had expected that this unique pressure, which was only possessed by a member of the Dragon tribe, would show up on a human. Moreover, the purity of this pressure had even far exceeded those top experts in the Dragon tribe!\u003c/p\u003e\n\u003cp\u003eTeng Feng’s group had an extremely solemn expression on their faces at this moment. Clearly, they detected a whiff of danger from Lin Dong’s body.\u003c/p\u003e\n\u003cp\u003e“Cough.”\u003c/p\u003e\n\u003cp\u003eA soft cough sounded from the horizon. A miserable looking Luo Tong, who had nearly crashed onto the ground, extended his hand before he slowly wiped off a trace of blood on the corner of his lips. Subsequently, he lifted his head. His eyes stared at the distant Lin Dong, before he parted his lips. However, his smile was filled with a brutal killing intent.\u003c/p\u003e\n\u003cp\u003e“I have already thought highly of you. Yet, I still end up suffering…”\u003c/p\u003e\n\u003cp\u003e“However… I will no longer give you such an opportunity.”\u003c/p\u003e\n\u003cp\u003eA brilliant light gradually rose in Luo Tong’s eyes after his words sounded. Immediately, a frightening murderous intent swept out from him. Soon after, he clenched his hand abruptly. After which, the bodies of the Teng Feng’s group suddenly jerked, before four light pillars whistled out and landed beside Luo Tong. The Four Divine Beast Immortal Suppression Pillars were now completely under his control!\u003c/p\u003e\n\u003cp\u003eClearly, Luo Tong was finally planning to unleash his signature killing move.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1126\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1128\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1127","bookId":1514,"creation":"Sep 10, 2019 7:28:55 AM","modification":"Sep 10, 2019 7:28:55 AM"}
