{"id":59885,"no":129,"title":"Chapter 129: End of the Show","content":"\u003cp\u003e\u003cstrong\u003eChapter 129: End of the Show\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWei Tong was dead.\u003c/p\u003e\n\u003cp\u003eAs they gazed at the body that slowly fell to the ground, everyone understood that the leader of the Blood Cloth Sect had indeed met his end in this duel arena. Furthermore, the one he had fallen to was a young man who was not even twenty years of age.\u003c/p\u003e\n\u003cp\u003eIn the arena, Lin Dong’s taut nerves finally relaxed. A sweetness rose up his throat but was forcefully swallowed by Lin Dong.\u003c/p\u003e\n\u003cp\u003eThe might of the advanced Yuan Dan stage had somewhat exceeded Lin Dong’s expectations. Armed with his initial Yuan Dan stage strength and the Mental Energy that could match up with a third seal Symbol Master, Lin Dong had originally thought that it would not be too difficult to dispatch Wei Tong. Yet, this duel still ended up a little thrilling.\u003c/p\u003e\n\u003cp\u003e“If the advanced Yuan Dan stage is already such a pain to take care of, then how problematic would a perfect Yuan Dan Stage expert be?”\u003c/p\u003e\n\u003cp\u003eLin Dong pursed his lips, his gaze suddenly shifting towards the stands. There, Yue Shan’s expression was ugly to the max, his fists were tightly clenched, clearly showing the rage and murderous intent inside his heart. He had also never expected that Lin Dong would so ruthlessly and cleanly deal the killing blow.\u003c/p\u003e\n\u003cp\u003e“Good, good!”\u003c/p\u003e\n\u003cp\u003eAtop the viewing platform, Yue Shan’s eyes were very dark as he somewhat venomously stared at Lin Dong while spitting out these two words, his voice dripping with killing intent. Yue Shan then waved his sleeve and turned away, anyone could tell that the sect leader of the Blood Wolf Gang and also this rather famous expert in Yan City was extremely resentful towards the fact that Lin Dong had killed Wei Tong.\u003c/p\u003e\n\u003cp\u003eAnd when a figure of this calibre was resentful, the situation would very likely develop to become a blood fest.\u003c/p\u003e\n\u003cp\u003eAt these thoughts, some of the factions atop the viewing platforms could not help but cast some sympathetic gazes towards Lin Dong. This time, he had thoroughly offended the Blood Wolf Gang.\u003c/p\u003e\n\u003cp\u003eYet, as he faced these gazes, Lin Dong retained his calm expression. Yue Shan had long ago treated Lin Dong as an eyesore, thus such actions would not be strange. As for Wei Tong, he was someone Lin Dong certainly had to kill because he understood in his heart that if he did not finish off Wei Tong today, that savage brute would definitely make sure to retaliate with all his might. Stupidly asking for trouble was one of the things Lin Dong would not do. Even if the price was offending Yue Shan and the Blood Wolf gang, it still had to be done!\u003c/p\u003e\n\u003cp\u003eWhile Yue Shan turned around, still giving out a murderous aura, the judge also once again appeared in the arena. He inspected Wei Tong’s wounds for a moment before turning his somewhat shocked gaze towards Lin Dong as he secretly said in his heart: “What a ruthless kid.”\u003c/p\u003e\n\u003cp\u003eLin Dong’s final strike had directly caused a fist-sized hole through Wei Tong’s throat. No one would be able to save Wei Tong from such a fatal wound.\u003c/p\u003e\n\u003cp\u003eAfter confirming that Wei Tong as dead, the judge announced in a low voice: “For this duel, Lin Dong from the Lin Family has emerged victorious!”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThis battle in the duel arena had undoubtedly become one of the most popular topics in Yan City. This kind of surprising outcome had also caused the Lin Family and Lin Dong’s reputation to spread within Yan City. Many people started to recognize this Family which hailed from Qingyang Town.\u003c/p\u003e\n\u003cp\u003eNot long after the deathmatch was over, as many had expected, the Blood Cloth Sect became rather chaotic due to internal strife. Although the Blood Wolf Gang tried to suppress this strife, the Blood Cloth Sect still fell apart due to the anxiousness of their members. Not long later, the once rather well-known Blood Cloth Sect dissipated and their territories were excitedly divided up among the other factions.\u003c/p\u003e\n\u003cp\u003eThe Blood Wolf gang was furious with this outcome, yet they could do nothing about it but rely on the influence as one of the top three factions to forcefully retake some territories. Yet, in the end, they were still unable to remedy the Blood Cloth Sect’s disbanding.\u003c/p\u003e\n\u003cp\u003eCompared to the split up and scattered Blood Cloth Sect, the Lin Family instead made use of this situation. Currently, they had not only borrowed Lin Dong’s hard earned reputation to stabilize themselves in Yan City, but also build some relations with one of the top factions, the Thousand Gold Association, and a top tier expert like grandmaster Yan. Over this period of time, the wind blowed extremely in their favor.\u003c/p\u003e\n\u003cp\u003eYet, though a favorable wind blew for them, Lin Zhentian and the rest did not lose their rationality due to the excitement but instead very quickly became clear-headed again. They tried to maintain a low profile as much as possible, Yan City was not like Qingyang Town, there were many more factions here and without enough strength, the favorable wind from this meteoric reputation would perhaps directly overturn them instead.\u003c/p\u003e\n\u003cp\u003eAs a whole, though the current Lin Family’s strength was considered enough to establish themselves in Yan City, they were after all a new comer and being careful plus keeping a low-profile would definitely be good for them. Especially since they had offended a bigger faction like the Blood Wolf Gang after resolving the problem of the Blood Cloth Sect...\u003c/p\u003e\n\u003cp\u003eOf course, though they were low-key, Lin Zhentian and the rest also secretly recruited quite a number of experts. The manpower and resources in Yan City far exceeded that of Qingyang Town. So long as one had enough money, even a Yuan Dan stage expert could be bought to your service.\u003c/p\u003e\n\u003cp\u003eWith regards to money, the Lin Family was fairly confident in themselves. After all, with the constant contributions from the Yang Yuan stone mining lode, the Lin Family managed to recruit almost ten Heavenly Yuan stage experts in a mere half a month. As for those with Earthly Yuan strength, dozens were recruited.\u003c/p\u003e\n\u003cp\u003eThis level of power was not outdone by the Blood Cloth Sect from before, and from certain angles, it could be considered even greater. After all, the Lin Family still had Lin Dong who was able to take the head of Wei Tong!\u003c/p\u003e\n\u003cp\u003eIt was also during this short half a month that an earth-shattering change occurred to the Lin Family’s strength. Although this kind of change was a huge financial burden for them, the situation from before had enlightened the Lin Family that without enough strength, you would only end up toiling for others.\u003c/p\u003e\n\u003cp\u003eIf the Lin Family possessed this level of strength before, how would Wei Tong have dared to be so unbridled?\u003c/p\u003e\n\u003cp\u003eIf Lin Dong had not used a delaying tactic that day, how could the Lin Family have survived till today? After learning from these past mistakes, Lin Zhentian and the rest now understood that strength was the most important!\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eA manor stood within a district in the northern part of Yan City. There were quite a few guards who stood rooted like stakes at the entrance of the manor. This was the Lin Family’s new residence in Yan City. Since they had already planned to move their core operations to Yan City, a place like this was naturally a necessity. Therefore, after spending quite a huge sum, the name of this manor had been changed to Lin.\u003c/p\u003e\n\u003cp\u003eThere was a small secluded courtyard located deep in the manor. This was Lin Dong’s personal lodging, his position in the Lin Family had become increasingly important such that it was now able to match up to Lin Zhentian’s. Thus no one would complain if Lin Dong received this level of treatment, after all, if it was not for Lin Dong, their Lin Family would perhaps continued to be suppressed by the tiny Lei and Xie Families.\u003c/p\u003e\n\u003cp\u003eIn the grassy courtyard, Lin Dong sat on a stone block with both his eyes tightly shut. Around him, the Yuan Power of heaven and earth heaved and surged before finally transforming into threads of Yuan Power that swiftly poured into his body.\u003c/p\u003e\n\u003cp\u003eAfter over half a month of secret training, the twenty two channels of the ‘Tri Sun Art’ had been completely unblocked by Lin Dong. The power of this art was not weak when he used it and was several times stronger than the ‘Qingyuan Art’ of the past.\u003c/p\u003e\n\u003cp\u003eNot long ago, Lin Dong had also given this ‘Tri Sun Art’ to Lin Zhentian. After all, the Lin Family’s ‘Qingyuan Art’ was definitely too shameful, given their current status, it was natural for them to swap it out. Of course, the ‘Tri Sun Art’ that Lin Dong handed over could only open fifteen channels, he did not mention about the version he had as it was related to the mysterious Stone Talisman. Given his cautiousness, ever since he had been warned by the small marten, he had kept this secret in his heart, not daring to leak any information.\u003c/p\u003e\n\u003cp\u003eAfter replacing the Lin Family’s main Secret Art with the ‘Tri Sun Art’, Lin Dong also secretly gave a ‘Yin Yang Pearl’ to his father, Lin Xiao. The current Lin Xiao was already at the Heavenly Yuan late stage and his talent was also far superior to Lin Ken and Lin Mang. Lin Xiao was definitely the one who had the highest chance of advancing to the Yuan Dan stage, thus, this ‘Yin Yang Pearl’ would achieve the greatest effect if it was used by Lin Xiao.\u003c/p\u003e\n\u003cp\u003e“Phew…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s cultivation had lasted for a full two hours before his closely shut eyes slowly opened as a ball of white Qi was spit out from his mouth. Soon after, he extended both his arms as light seemed to twinkle at the center of his palms. A split moment later, these lights actually transformed into two fist-sized Yuan Power balls of light. A faint golden glow could be seen within these balls of light.\u003c/p\u003e\n\u003cp\u003eThe surface of the balls of light seemed to flicker as a rather intimidating Yuan Power undulation spread out from within.\u003c/p\u003e\n\u003cp\u003eThese balls of lights were the ‘Tri Sun balls’ from the ‘Tri Sun Art’. After studying for half a month, Lin Dong had successfully condensed two ‘Tri Sun balls’ inside his Dantian. Although he had never tested its full power before, Lin Dong could gauge the killing power of these things. If he had been able to condense them before his clash with Wei Tong, it was likely that Lin Dong would have won more easily.\u003c/p\u003e\n\u003cp\u003eLin Dong stared at the two ‘Tri Sun balls’, only when he sensed the frantic undulations within them did he finally nod his head in satisfaction. With a flick of his hand, they were returned to his Dantian.\u003c/p\u003e\n\u003cp\u003eOver this half a month period, Lin Dong did not slow his cultivation because he had defeated Wei Tong. The matter this time had thoroughly offended the Blood Wolf Gang, in the light of Yue Shan’s character, he would not so easily let this matter rest. Even though the Thousand Gold Association currently restrained him, if he found a chance, he would definitely make his move without the slightest hesitation. Under this pressure, Lin Dong naturally could not take it easy in his cultivation.\u003c/p\u003e\n\u003cp\u003eHe was able to kill the advanced Yuan Dan stage Wei Tong, yet he was not certain of being able to prevail over the perfect Yuan Dan stage Yue Shan. Though there was only one word of difference between the cultivation stages of these two individuals, there was a huge gap between their strengths. This point was further emphasized by the fact that there were less than ten perfect Yuan Dan stage practitioners even in the whole Yan City.\u003c/p\u003e\n\u003cp\u003eLin Dong massaged his temple and could only temporarily worry about this matter in his heart as he whistled.\u003c/p\u003e\n\u003cp\u003eBefore the whistle could fade, a red shadow swiftly burst into the courtyard. In the blink of an eye, it dashed to Lin Dong’s side, the aura that it brought with it caused even Lin Dong to involuntarily raise an eyebrow.\u003c/p\u003e\n\u003cp\u003eThis red shadow was naturally Little Flame, who had been brought over from Qingyang Town by Lin Zhentian and the rest. After being apart for a few months, though Little Flame’s body had not grown much, the fur on its body had grown increasingly scarlet red, as if it was about to condense into a layer of crystal armor, an extremely exotic sight.\u003c/p\u003e\n\u003cp\u003eLin Zhentian and the rest did not know why this changed had occurred to Little Flame, however, they knew that a common Fire Python Tiger would not transform in such a way...\u003c/p\u003e\n\u003cp\u003eFurthermore, what caused them to be truly shocked was that the current Little Flame had entered into a deep sleep one month after Lin Dong had left. And after it awoke from its sleep, Lin Zhentian and the rest had found that Little Flame’s strength had once again skyrocketed. They predicted that Little Flame would even dare to challenge an initial Yuan Dan stage practitioner now.\u003c/p\u003e\n\u003cp\u003eLin Zhentian and the rest were at a loss with regards to Little Flames change, however, Lin Dong was able to guess that this was likely related to the Demonic Crystal Little Flame had swallowed in the cavern within the mining lode that day...\u003c/p\u003e\n\u003cp\u003e“Young master Lin Dong, grandmaster Yan sent someone to tell us that you have been invited over to his place.”\u003c/p\u003e\n\u003cp\u003eJust as Lin Dong was rubbing Little Flame’s red fur with a smile on his face, a servant girl suddenly appeared in the vicinity of the courtyard and respectfully reported.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eLin Dong was stunned upon hearing these words. This was the first time he had received an invitation from grandmaster Yan. Since he had always deeply respected the latter, he immediately nodded his head.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-128\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-130\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-129","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
