{"id":61100,"no":1344,"title":"Chapter 33: Xie Ting","content":"\u003cp\u003eWDQK Chapter 33: Xie Ting\u003c/p\u003e\n\u003cp\u003e“We were originally here to have some fun. However we encountered those bastards from the Xie Family. Lin Xia-jie wanted to buy a little trinket but those bastards intentionally caused a ruckus. In the end, Lin Xia was so angry that she could no longer bear it and started a fight…”\u003c/p\u003e\n\u003cp\u003e“However, the ring leader of that Xia Family bunch was the wretched Xie Ting. She is Xie Yingying’s younger sister and currently has the strength of Tempered Layer 7th Layer. Plus they had more people…in the chaos, that woman took the opportunity to give Lin Xia-jie a slap.”\u003c/p\u003e\n\u003cp\u003eThe three swiftly ran towards the wide building. Lin Shan had explained everything that had happened in detail, as he was explaining, his fists clenched tightly, the extreme anger in his heart very evident for all to see.\u003c/p\u003e\n\u003cp\u003eLin Dong slightly frowned, these members of the younger generation from the Xie Family were really a little too unbridled. After all, Lin Xia-jie was a girl, hitting her face was crossing the line.\u003c/p\u003e\n\u003cp\u003e“People from the Xie Family are indeed very loathsome.” To one side, Qing Tan fumed. No matter what, as a member of the Lin Family, they must now show a united front.\u003c/p\u003e\n\u003cp\u003e“Let us make a little more haste.” Lin Dong nodded in agreement as he once again accelerated.\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eDeep in the building was a wide area littered with bits of rubble. Surrounding it were some rather popular stores. All kinds of elixirs, weapons, armors and even martial arts manuals and crystals were on display.\u003c/p\u003e\n\u003cp\u003eThis place counted as one of the more high-end districts in the bazaar. Those who came here were mostly people of a certain level of status in Qingyang Town. And at this moment, there were many people crowding around a spot on the fringe of the open space, gazing at the two groups within.\u003c/p\u003e\n\u003cp\u003eThe members from both parties were quite young, yet the atmosphere that they exuded appeared especially intense.\u003c/p\u003e\n\u003cp\u003eThe Xie and Lin Families were both considered as major factions in Qingyang Town. However, most people also knew that Lei and Xie Family were constantly trying to undermine the Lin Family. Therefore, there were hardly surprised to see their younger generation clash.\u003c/p\u003e\n\u003cp\u003e“Lin Xia, hand over the fox crystal necklace, or else, I will not let you off.” Standing at the head of the Xie Family’s younger generation, an elegantly dressed young lady proudly stood as she remarked with a hint of ridicule on her fair oval face. Together with her thin lips, she gave off a harsh aura.\u003c/p\u003e\n\u003cp\u003e“Give it to you?” Lin Xia snorted as she faced the young lady opposite her. On her cheek, was a faint red hand-print, which had been left by that b*tch when she had been struggling with the others.\u003c/p\u003e\n\u003cp\u003eLin Xia immediately ripped the snow white necklace apart. She understood that this was merely an accessory and based on Xie Ting’s status, she could hardly care for such an item. Rather, she was just intentionally stirring up trouble.\u003c/p\u003e\n\u003cp\u003eJust as Lin Xia expected, after witnessing her rip the necklace apart, Xie Ting’s eyebrows lifted as she snickered: “You are really a stubborn one. Looks like I will have to deal with you today.”\u003c/p\u003e\n\u003cp\u003e“Xie Ting, don’t be too overbearing.” Lin Hong, who was standing behind Lin Xia, hollered. He looked rather ragged, as if he had just been through a fight.\u003c/p\u003e\n\u003cp\u003e“What can you guys do? If it was not for the magnanimity of our Xie Family, do you think the Lin Family can survive in Qingyang Town?” Upon hearing these words, the corners of Xie Ting’s mouth curled up as she ridiculed them.\u003c/p\u003e\n\u003cp\u003e“Hehe, let us teach them a lesson. In the future, they will know who is the master.”Standing beside Xie Ting, a young man dressed in yellow clothes chuckled in a strange manner.\u003c/p\u003e\n\u003cp\u003e“Yes.” Just as the yellow-clothed youngster finished his sentence, another youngster standing beside immediately nodded his head with a smile. It seems like the two of them had some pull among the younger generation in the Xie Family.\u003c/p\u003e\n\u003cp\u003eLin Hong’s expression darkened upon hearing their conversation. He knew that on his side, only him and Lin Xia were at Tempered Body 7th Layer, while on the other side, they had three people at Tempered Body 7th Layer. If they really clashed together, they would definitely lose out.\u003c/p\u003e\n\u003cp\u003e“Good, let’s teach them a lesson and put them in their place, a foreigner family can never compare to the local one” Like a little demon, Xie Ting smiled as she stared viciously at Lin Xia.\u003c/p\u003e\n\u003cp\u003eSeeing that Xie Ting was in agreement, the younger generation members of the Xie Family started to get excited as they stared maliciously at Lin Xia and company.\u003c/p\u003e\n\u003cp\u003e“Attack!”\u003c/p\u003e\n\u003cp\u003eImmediately, a light glow exploded on the bodies of Xie Ting and the two other youngsters. The three of them immediately dashed towards Lin Xia and Lin Hong as the rest of the Xie Family’s younger generation members also rushed forward and intercepted the rest of the Lin Family’s members.\u003c/p\u003e\n\u003cp\u003eLin Hong and Lin Xia’s expression became pained as they saw the three of them dashing towards them. Two against three, they knew that they were bound to suffer.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eHowever, right before the trio reached Lin Xia and Lin Hong, a sound suddenly echoed from the side. The three of them hurriedly dodged as three pieces of rock were heavily slammed into a nearby post, releasing deep thuds.\u003c/p\u003e\n\u003cp\u003e“Who is that?!”\u003c/p\u003e\n\u003cp\u003eThe trio furrowed their eyebrows as they witnessed this unexpected development. As they turned to look, they saw three figures hurriedly rushing over. Leading the pack, was Lin Shan, who had previously ran away after a harsh beating.\u003c/p\u003e\n\u003cp\u003e“Lin Dong!”\u003c/p\u003e\n\u003cp\u003eLin Xia and Lin Hong gasped in unison as they saw the figure behind Lin Shan. Instantly, delight filled their eyes.\u003c/p\u003e\n\u003cp\u003e“Are you alright?” Lin Dong asked as he led the other two towards the crowd. As he glanced at Lin Xia, his eyebrows tightly knitted together after he saw the red hand-print on the latter’s cheek.\u003c/p\u003e\n\u003cp\u003e“Lin Dong? You are that fellow that suddenly emerged from the Lin Family?” Xie Ting said as her eyes darted across Lin Dong’s body, the corner of her mouth pulling downwards.\u003c/p\u003e\n\u003cp\u003e“Why are you here?” After a moment of delight, Lin Xia was a little worried again. Even if Lin Dong arrived, it would only lead to a stalemate now.\u003c/p\u003e\n\u003cp\u003e“We came here to enjoy ourselves and happened to run into Lin Shan.” Lin Dong replied with a smile. Up till now, he had yet to look at that haughty Xie Ting, much less reply to any of her questions.\u003c/p\u003e\n\u003cp\u003eLin Dong’s actions inadvertently enraged Xie Ting. She was not used to being treated as air. Just as rage clouded her mind, suddenly a person beside her muttered something to her ears.\u003c/p\u003e\n\u003cp\u003e“Chey, I thought he was somebody. Turns out he is the son of the disabled Lin Xiao.”\u003c/p\u003e\n\u003cp\u003eXie Ting sneered. Lin Dong’s body clearly froze before he turned firstly to look at Xie Ting’s face and then letting out a laugh. He lifted his foot and walked towards Xie Ting.\u003c/p\u003e\n\u003cp\u003e“Be careful.” Seeing his actions, Lin Xia hastily warned. The opponent was after all three Tempered Body 7th Layer practitioners.\u003c/p\u003e\n\u003cp\u003e“Heh heh, let me test how good this so called Lin Family genius really is.” Eyeing Lin Dong as he walked over, the yellow clothed youngster could not help but sneer before quickly stepping forward as a weak glow rapidly condensed at the center of his palm.\u003c/p\u003e\n\u003cp\u003e“Thump!”\u003c/p\u003e\n\u003cp\u003eAs the youngster in yellow charged at Lin Dong, a low sound thud immediately followed as a figure flew backwards under the astonished gazes of the crowd before finally landing heavily onto the ground.\u003c/p\u003e\n\u003cp\u003eAs they gazed at the sorry figure of the youngster in yellow, many of them were startled. Even the surrounding onlookers also cast astonished gazes at Lin Dong who had so easily defeated a Tempered Body 7th Layer practitioner. Looks like this newly risen genius from the Lin Family did have some skills.\u003c/p\u003e\n\u003cp\u003e“Xie Zhen!”\u003c/p\u003e\n\u003cp\u003eXie Ting and the rest of the Xie Family younger generation members expressions rapidly changed after seeing Lin Dong sweeping away the yellow clothed youngster with a single swipe of his palm.\u003c/p\u003e\n\u003cp\u003e“You dare to attack a member of our Xie Family, you’re just courting death!” The other Tempered Body 7th Layer youngster rushed forward, slightly unable to believe what had happened as a hot anger burned in his eyes. Likewise, his figure was straight away blown away by Lin Dong with a thrust of his palm.\u003c/p\u003e\n\u003cp\u003e“Hsss…”\u003c/p\u003e\n\u003cp\u003eThis time, quite a few people gasped. The first time might have been luck but the second time was definitely not a fortunate coincidence…\u003c/p\u003e\n\u003cp\u003e“Tempered Body 8th Layer…”\u003c/p\u003e\n\u003cp\u003eLin Xia, Lin Hong and the rest foolishly stared at Lin Dong’s back. So easily beating a Tempered Body 7th Layer opponent can only mean that Lin Dong’s strength had stepped into the 8th Layer!\u003c/p\u003e\n\u003cp\u003e“You…what do you plan on doing? My sister and her gang are also here. If you don’t want to get beaten, then bring your people and get out of here!”\u003c/p\u003e\n\u003cp\u003eGazing at how effortlessly Lin Dong had dispatched the two and then started closing the distance between them, Xie Ting’s face finally turned pale. Yet she still raised her head and coldly looked at Lin Dong. She did not believe that Lin Dong would dare to hit her!\u003c/p\u003e\n\u003cp\u003eFaced with the pale oval-shaped face before him, Lin Dong laughed as an icy light shined in his eyes. He lifted his palm.\u003c/p\u003e\n\u003cp\u003e“Stop!”\u003c/p\u003e\n\u003cp\u003eIn the instant that Lin Dong raised his hand, a sharp and clear voice urgently sounded out. Next, a strong wind shot straight at Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Pa!”\u003c/p\u003e\n\u003cp\u003eRight before the shout could fade away, Lin Dong’s expression slightly darkened. Under everyone’s gazes of disbelief, his palm swiftly jerked before finally slapping fiercely on Xie Ting’s face. This loud and clear slap caused the entire area to lapse into silence.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-32\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-34\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-33","bookId":1514,"creation":"Sep 10, 2019 7:28:55 AM","modification":"Sep 10, 2019 7:28:55 AM"}
