{"id":61140,"no":1384,"title":"Chapter 73: An Enraged Lin Zhentian","content":"\u003cp\u003eWDQK Chapter 73: An Enraged Lin Zhentian\u003c/p\u003e\n\u003cp\u003eEven though the situation with the Black Dragon Stockade has been resolved, Lin Ken still invited the Raging Blade Dojo members into the manor as a show of hospitality. However, because the current Steel Wood Manor reeked of blood, it was unwise to stay for long. Therefore, Luo Cheng and the rest did not linger for too long. After a while, they took the initiative to say their farewells before taking off.\u003c/p\u003e\n\u003cp\u003eLikewise, Lin Ken did not try to stop Luo Cheng and the rest as they left,. Personally escorting them to the front gate, Lin Ken thanked them once again before bidding them goodbye.\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eAfter half a day of cleanup, the Steel Wood Manor was no longer as distraught as before. However, the smell of blood still lingered. In this confrontation, the Lin Family had also suffered several casualties. Thus, tieing up the loose ends would not be easy.\u003c/p\u003e\n\u003cp\u003eAs the sun gradually set, a large caravan once again appeared on the main road. When the guards on the manor wall saw the familiar fleet, they immediately exclaimed in delight.\u003c/p\u003e\n\u003cp\u003e“Haha, I never expected this trip to be so smooth sailing. It seems like the Black Dragon Stockade did not dare to make a move.” At the front of the convoy, Lin Mang gazed at the manor that appeared in his line of sight and involuntarily chuckled as he said.\u003c/p\u003e\n\u003cp\u003eTo one side, Lin Xiao also smiled. Just as he was about to reply, his facial expression suddenly changed drastically. He had smelt the thick bloody smell lingering in the air.\u003c/p\u003e\n\u003cp\u003e“Something is wrong!”\u003c/p\u003e\n\u003cp\u003eWhen Lin Zhentian smelt the metallic tang of blood, he also reached the same conclusion. His aged face instantly turned incomparably ominous as he quickly whipped his horse and hurriedly dashed towards the Steel Wood Manor.\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e“Black Dragon Stockade! If I do not personally wipe all of you off the face of this Earth, I will no longer have any standing in this Qingyang Town!”\u003c/p\u003e\n\u003cp\u003eWithin the Steel Wood Manor, some of the guards heard Lin Zhentian’s furious roar and involuntarily gulped in response. It seems like Lin Zhentian was truly enraged this time.\u003c/p\u003e\n\u003cp\u003eIn the large hall, all the tables and furniture had already transformed to bit and pieces that littered the floor. Both Lin Mang and Lin Xiao’s were black faced as a vicious killing intent overflowed from their eyes. They finally understood why their trip had gone so smoothly: it was because the Black Dragon Stockade had directly attacked the manor!\u003c/p\u003e\n\u003cp\u003e“Father, we cannot treat this matter lightly. However, please calm down for now. After all, Elder Brother managed to successfully defend the manor, denying the Black Dragon Stockade the chance to wreck it.” Lin Xiao took a deep breath as he advised in a low voice.\u003c/p\u003e\n\u003cp\u003eLin Zhentian’s chest violently rose up and down for a while before he slowly sat down as his anger slightly subsided. Indeed, it seems like they had managed to avert a huge disaster.\u003c/p\u003e\n\u003cp\u003e“Lin Ken, you have done very well this time.”\u003c/p\u003e\n\u003cp\u003eUpon hearing Lin Zhentian’s complement, Lin Ken let out a bitter laugh. He abruptly pointed towards Lin Dong, who was sitting at a corner, and said: “Father, this time round, the credit does not solely belong to me. If Lin Dong had not managed to defeat Wu Sha, I am afraid that our Steel Wood Manor would have been doomed.”\u003c/p\u003e\n\u003cp\u003e“Defeat Wu Sha?”\u003c/p\u003e\n\u003cp\u003eAfter hearing these words, Lin Zhentian, Lin Xiao and the rest were all dazed, as if they could not understand what they had just heard.\u003c/p\u003e\n\u003cp\u003e“Father, congratulations. From now on, our Lin Family will have another Heavenly Yuan Stage expert.” Lin Ken gently smiled as he continued.\u003c/p\u003e\n\u003cp\u003eSilence, total silence.\u003c/p\u003e\n\u003cp\u003eThe tense atmosphere from before, that was brought about by Lin Zhentian’s anger, seemed to have frozen in place. The entire hall was in absolute silence.\u003c/p\u003e\n\u003cp\u003e“What… can you say that again?” Lin Zhentian had a ridiculous expression on his face as he stared at Lin Ken and muttered.\u003c/p\u003e\n\u003cp\u003e“Lin Dong has advanced to the Heavenly Yuan Stage.”\u003c/p\u003e\n\u003cp\u003eAs he gazed at the utter disbelief on the trio’s faces, Lin Ken felt rather helpless as he repeated his words.\u003c/p\u003e\n\u003cp\u003e“Sss!”\u003c/p\u003e\n\u003cp\u003eIn the large hall, the three of them simultaneously sucked in a breath of cold air. Then, three pairs of eyes were instantly glued onto Lin Dong. Promptly, Lin Zhentian stood up and in a flash, he was appeared in front of Lin Dong. With a wrinkled yet firm hand, he grabbed onto Lin Dong’s wrist.\u003c/p\u003e\n\u003cp\u003eAs he grabbed\u0026nbsp; Lin Dong’s wrist, Lin Zhentian could clearly feel traces of Yang Energy contained within Lin Dong’s Yuan Power. It was the defining mark of a Heavenly Yuan Stage Expert!\u003c/p\u003e\n\u003cp\u003e“Hahahaha, excellent! Excellent!”\u003c/p\u003e\n\u003cp\u003eAn unrestrainable delight immediately exploded on Lin Zhentian’s wrinkled face. Eventually, he began to laugh maniacally. The previous gloomy mood that was caused by the Black Dragon Stockade incident had instantly turned light hearted again.\u003c/p\u003e\n\u003cp\u003e“Father, is this true?” Upon seeing Lin Zhentian’s reaction, Lin Xiao and Lin Mang asked in astonishment.\u003c/p\u003e\n\u003cp\u003e“It’s indeed Heavenly Yuan Stage!” Lin Zhentian suppressed the wild excitement in his heart as he solemnly nodded his head.\u003c/p\u003e\n\u003cp\u003eObserving Lin Zhentian and the rest’s reactions, Lin Dong could only force a smile as he shook his head. Did they have to be so dramatic every time? (TL Note: LOLOLOLOL)\u003c/p\u003e\n\u003cp\u003eTo one side, Lin Ken chuckled as he related the events that had occurred today. When they heard how Lin Dong had managed to defeat Wu Sha while at Earthly Yuan Later Stage and even took the opportunity to make a break through to Heavenly Yuan Stage, Lin Zhentian and the rest were faintly moved. Even though they had not witnessed the battle firsthand, they guessed that it must have been exceedingly thrilling.\u003c/p\u003e\n\u003cp\u003e“Lin LangTian of the Lin Clan had advanced to Heavenly Yuan Stage when he was fifteen years old. Heh, compared to Dong-er who managed to advance when he was sixteen years old, Lin Dong definitely does not lose out by much to him. A world-class genius has finally emerged from my Lin Family!”\u003c/p\u003e\n\u003cp\u003eAfter hearing Lin Zhentian talk about the most famous person in the Lin Clan, Lin Dong’s eyes slightly narrowed as he slowly tightened his fist. That was the first person that he had hated ever since he was young, and he would never forget that name even if he died.\u003c/p\u003e\n\u003cp\u003e“You have just advanced to Heavenly Yuan Stage, therefore your powers are not stable yet. During this period of time, you should avoid going out and instead stay in the manor while training.” Lin Zhentian said as he patted Lin Dong’s shoulder.\u003c/p\u003e\n\u003cp\u003e“Yes.” At these words, Lin Dong also nodded his head.\u003c/p\u003e\n\u003cp\u003e“Tomorrow, gather all the men. I will not let my Lin Family members die in vain!”\u003c/p\u003e\n\u003cp\u003eLin Zhentian smiled gently at Lin Dong before he turned around. Immediately, a cold and harsh look surfaced on his aged face.\u003c/p\u003e\n\u003cp\u003e“Father, the bandits from the Black Dragon Stockade are cunning and devious. After they were repelled by us today, they would surely have hidden themselves.” Lin Xiao furrowed his eyebrows as he said.\u003c/p\u003e\n\u003cp\u003e“When they escaped today, I already secretly sent men to tail them.” Lin Ken indifferently smiled. He had long anticipated that Lin Zhentian would never drop this matter, thus he had already made some preparations.\u003c/p\u003e\n\u003cp\u003e“Father, it is highly likely that a mastermind is behind this attack by the Black Dragon Stockade.” Lin Xiao reasoned. Given the Lin Family’s strength, if the Black Dragon Stockade did not have someone’s backing, they would not have dared to make their move against the Lin Family.\u003c/p\u003e\n\u003cp\u003eLin Zhentian nodded his head. Seated on his chair, a fierce look surfaced on his face. In this whole QingYan Town, who else could have masterminded this attack besides the Lei and Xie Families?\u003c/p\u003e\n\u003cp\u003e“Tomorrow, I will wipe the Black Dragon Stockade off the face of this Earth. After enduring silently for so many years, it’s time to let others know that our Lin Family is not such a pushover!”\u003c/p\u003e\n\u003cp\u003e“If anyone wants to mess around with us, they should be prepared to pay a hefty price!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-72\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-74\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-73","bookId":1514,"creation":"Sep 10, 2019 7:28:55 AM","modification":"Sep 10, 2019 7:28:55 AM"}
