{"id":59897,"no":141,"title":"Chapter 141: Manifestation Symbol Array","content":"\u003cp\u003e\u003cstrong\u003eChapter 141: Manifestation Symbol Array\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOutside the Symbol Master Tower, when one of the two specks of light at the seventh level disappeared, the originally somewhat noisy space turned absolutely silent in an instant.\u003c/p\u003e\n\u003cp\u003eThis strange silence lasted for a split moment before it was broken by a frantic clamouring.\u003c/p\u003e\n\u003cp\u003e“The speck of light disappeared!”\u003c/p\u003e\n\u003cp\u003e“Someone has entered the eighth floor!”\u003c/p\u003e\n\u003cp\u003e“How is this possible? Even third seal Symbol Masters would find it exceedingly difficult to enter, who could have done it?”\u003c/p\u003e\n\u003cp\u003e“Who is it? Zhou Tong or Lin Dong?”\u003c/p\u003e\n\u003cp\u003e“I think it should most likely be Zhou Tong…”\u003c/p\u003e\n\u003cp\u003e“Nonsense, Lin Dong does not lose out to that Zhou Tong…”\u003c/p\u003e\n\u003cp\u003e“……”\u003c/p\u003e\n\u003cp\u003eAs he heard the hubbub and quarrels that practically broke out in a split second, grandmaster Yan, who was originally seated on a stone chair, suddenly stood up. His gaze was rigidly fixed on the eighth level of the Symbol Master Tower. Now, there was indeed a speck of light in the place which no one had stepped into for many years.\u003c/p\u003e\n\u003cp\u003e“Who is it? Could it really be Lin Dong?”\u003c/p\u003e\n\u003cp\u003eAt this time, even with grandmaster Yan’s temperament, an uncontainable nervousness and excitement surfaced in his eyes. He was well aware of how difficult it was to enter the eighth floor, according to his original expectations, although Lin Dong’s and Zhou Tong’s abilities were not weak, they should definitely be unable to advance to the eighth floor. Yet, the reality that appeared before his eyes told him that he had predicted wrongly!\u003c/p\u003e\n\u003cp\u003eHowever, at this moment, even he was unsure of who exactly had successfully charged into the eighth level. Would it be Lin Dong or Zhou Tong? No one knew exactly what had happened inside over this period of time...\u003c/p\u003e\n\u003cp\u003eOriginally, they had thought victory would be determined perhaps only after a period of time. After all, the duo were both at the seventh level, since this was so, they needed to see who was able to endure longer. But, the most recent turn of events had directly shattered these thoughts.\u003c/p\u003e\n\u003cp\u003eAccording to the rules of the Tower Battle, no matter how long you stayed in a lower level, as long as someone was able to move to a higher level than you, even if he only stayed there for a few minutes, he would still be crowned the victor. And this was also why Lin Dong and Zhou Tong had intended to risk their lives. As long as one of them was able to ascend to the eighth floor, the outcome would be decided!\u003c/p\u003e\n\u003cp\u003eYet, what caused grandmaster Yan the the rest to be puzzled about now was: who exactly had stepped into the eighth level.\u003c/p\u003e\n\u003cp\u003eIf it was Zhou Tong, Yan City would have completely lost this time and the owner of the Symbol Master Tower would change. But, if it was Lin Dong, this Symbol Master Tower would belong to Yan City like before!\u003c/p\u003e\n\u003cp\u003eWhile grandmaster Yan worried, to one side, Han Yun’s fists also tightly clenched within his sleeves. However, his expression was a little ugly. He knew Zhou Tong extremely well, if they said that the latter was able to endure at the seventh floor for some time, he would believe it firmly without any doubt, but, if they talked about entering the eighth floor, the chances of that was extremely extremely low.\u003c/p\u003e\n\u003cp\u003eWhich is to say, the one who had successfully entered the eighth level was very likely that exceedingly unremarkable boy, Lin Dong!\u003c/p\u003e\n\u003cp\u003eAt these thoughts, the corners of Han Yun’s eyes involuntarily twitched. He had never expected that because of Lin Dong, an unforeseen event had now occurred and upset the victory that was originally in his grasp.\u003c/p\u003e\n\u003cp\u003e“It is only a guess, it might not turn out to be true. Maybe Zhou Tong suddenly broke through and by some chance entered the eighth level. That brat Lin Dong didn’t look any capable, how could he possible enter the eighth level…”\u003c/p\u003e\n\u003cp\u003eAt this time, Han Yun could only console himself in his heart. He did not know why, but, as he consoled himself, the unease in his heart grew increasingly stronger.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eWhile the heavens seemed to have overturned outside the Symbol Master Tower, as the main topic of their quarrels, Lin Dong was currently a little at loss.\u003c/p\u003e\n\u003cp\u003eThe eighth floor of the Symbol Master Tower was slightly smaller than the floor below it. Although this area was not considered large, the Mental Energy pressure here was terrifying strong. However, what was unusual about this situation was that: the Mental Energy pressure that was enough to crush his life did not feel very strong to the current Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Is this because of the Destiny Soul Symbol…”\u003c/p\u003e\n\u003cp\u003eLin Dong considered for a while before his understood that it was most likely due to the two Destiny Soul Symbols within his Niwan Palace. Soon after, he gently closed his eyes as his mind sunk into the Niwan Palace. Sure enough, he found that the two Destiny Soul Symbols had already automatically transformed into two Soul Symbol vortexes.\u003c/p\u003e\n\u003cp\u003eWhat caused Lin Dong the greatest shock was that the Destiny Soul Symbols were actually gulping down the surrounding viscous-liquid-like Mental Energy pressure.\u003c/p\u003e\n\u003cp\u003e“This Soul Symbol is truly odd…”\u003c/p\u003e\n\u003cp\u003eIn response to this situation, Lin Dong was stunned for a moment. He could only bitterly smile as he shook his head, he understood that the reason why he was able to charge through the Mental Energy barrier before, was due to the special power of the Soul Symbol. Or else, even if he was able to walk to the Mental Energy barrier, he would absolutely be unable to successfully pass through.\u003c/p\u003e\n\u003cp\u003e“I was rather reckless…” As he recalled the events of the past, Lin Dong, who had already recovered his level-headedness, could not help but feel a little frightened. If it were not for the change in the Destiny Soul Symbol at that final moment, he would definitely be grievously wounded now.\u003c/p\u003e\n\u003cp\u003eHowever, there was no other way. If he did not try to break through and Zhou Tong managed to charge in by some fluke chance, Yan City would have essentially lost this Tower Battle. Thus, it can be said that he was also forced to risk his life to that extent...\u003c/p\u003e\n\u003cp\u003e“I still need to find that so-called Qi grade Secret Spirit Skill first…” After letting out a bitter laugh, Lin Dong lifted his gaze. With the Destiny Soul Symbol protecting his body, he did not really need to fear the Mental Energy pressure that had threatened his life previously. Since this was so, he should first go and find the reward he had been promised.\u003c/p\u003e\n\u003cp\u003eThe eighth floor was not large, and there were very few things within. Thus, after Lin Dong’s gaze swept one round around the place, it stopped somewhere just ahead of his current position. There, a towering stone tablet stood.\u003c/p\u003e\n\u003cp\u003eLin Dong slowly walked towards the stone tablet. Due to the Destiny Soul Symbol, walking was not as challenging as before, thus, he quickly appeared before the stone tablet.\u003c/p\u003e\n\u003cp\u003eThe stone tablet was several feet tall there were not too many weird points about it. However, Lin Dong still sensed a minute Mental Energy undulation on the surface of the stone tablet.\u003c/p\u003e\n\u003cp\u003eAs he stared at the stone tablet, Lin Dong hesitated for a while before gently closing his eyes and stretching out his finger to touch the stone tablet.\u003c/p\u003e\n\u003cp\u003e“Buzz!”\u003c/p\u003e\n\u003cp\u003eJust as Lin Dong’s finger touched the stone tablet, the Mental Energy undulation that clothed it immediately spread out. Soon after, it formed a large and mysterious pattern which orbited in mid-air. Within it, one could see some floating Mental Energy characters which faintly seemed like an array.\u003c/p\u003e\n\u003cp\u003e“Manifestation Symbol Array…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s gaze was glued onto the floating Mental Energy characters. Soon after, happiness surfaced in his eyes. Grandmaster Yan had not lied to him, there was indeed a Qi grade Secret Spirit Skill on the eighth level.\u003c/p\u003e\n\u003cp\u003eFrom the characters, one could tell that this Secret Spirit Skill was incomparable to the superficial Secret Spirit Skills he had obtained before.\u003c/p\u003e\n\u003cp\u003eWithout making a single mistake, Lin Dong read the whole phrase before muttering to himself for a moment. He then beckoned with his palm as the Mental Energy that had transformed into the mysterious array flew down and poured into his mind.\u003c/p\u003e\n\u003cp\u003eWhen this array entered Lin Dong’s mind, a picture of the symbol array that was almost ten feet wide appeared in his mind. This symbol array was extremely cryptic and profound, Lin Dong already felt his head ache a little after taking a single look. But at the same time, he was also able to sense that if this symbol array was successfully constructed, the power that it possessed would definitely outclass an Essence grade Secret Spirit Skill like ‘Piercing Helicity’.\u003c/p\u003e\n\u003cp\u003eLin Dong shut his eyes and studied the ‘Manifestation Symbol Array’ that he had just obtained. This continued for almost an hour before he gently opened his eyes and mumbled to himself for a while. With a thought, lines of Mental Energy gushed out from his Niwan Palace before constructing itself into strange figures before him. From the looks of it, it seemed to be the ‘Manifestation Symbol Array’.\u003c/p\u003e\n\u003cp\u003e“Chi!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s drawing did not last for long before a tiny mistake appeared. Immediately, the entire array quickly dissipated.\u003c/p\u003e\n\u003cp\u003eUpon seeing this outcome, Lin Dong could not help but let out a bitter laugh. This thing was indeed incomparable to an Essence grade Secret Spirit Skill, it was already several times more difficult to practise it.\u003c/p\u003e\n\u003cp\u003e“One step at a time. I don’t believe that I will be unable to learn you after obtaining you!”\u003c/p\u003e\n\u003cp\u003eThe first failure was not out of Lin Dong’s expectations. After tidying up a little, he once again fully concentrated, restraining his mind as he very carefully manipulated his Mental Energy to draw the odd Mental Energy Symbol Array.\u003c/p\u003e\n\u003cp\u003eThere was a huge difference between the cleansing effect of the eighth level and the seventh level below it. Thus, at all times, Lin Dong’s Mental Energy was slowly upgrading. In addition, his Destiny Soul Symbols were constantly gulping down the Mental Energy pressure here, causing his speed to be even more remarkable.\u003c/p\u003e\n\u003cp\u003eThe effect of staying here for one day was several times more potent than normal!\u003c/p\u003e\n\u003cp\u003eAs for the ninth level above, Lin Dong did not recklessly try to enter. Though he had the aid of the Destiny Soul Symbol, he had already achieved victory and even obtained a Qi grade Secret Spirit Skill, thus, he was in no hurry to endanger himself.\u003c/p\u003e\n\u003cp\u003eTherefore, after successive and extremely intensive ascending, Lin Dong finally calmed down as he started to enjoy the various benefits the eighth floor brought...\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe most intense Tower Battle had ended and the entire Symbol Master Tower seemed to have become much quieter. Everyone started to make the most of their time, after the Symbol Master Tower opened, the Mental Energy pressure within will grow stronger each day, until it finally expelled everyone. Only then would the curtain to this Tower Battle finally fall.\u003c/p\u003e\n\u003cp\u003eThis type of peace was rather torturous for grandmaster Yan and the rest who waited outside the tower. Till now, they had yet to find out who was the one who had successfully stepped onto the eighth floor...\u003c/p\u003e\n\u003cp\u003eUnder this torturous wait, time passed by. Each day, many young Symbol Masters would grudgingly walk out from the Symbol Master Tower. As the Mental Energy pressure within grew increasingly stronger, they were no longer able to endure.\u003c/p\u003e\n\u003cp\u003eAfter these Symbol Masters exited the Symbol Master Tower, they were startled by grandmaster Yan’s and the rest’s serious expressions. Initially, they had thought that some accident had occurred, but after asking about, the looked up in shock as their gazes concentrated on the eighth floor. For many years, no one had stepped into that place, did someone finally manage to reach it this year?\u003c/p\u003e\n\u003cp\u003eBut...who exactly was that person?\u003c/p\u003e\n\u003cp\u003eThe crowd looked at each other in dismay. Within their shock, traces of curiosity and doubt could be seen.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-140\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-142\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-141","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
