{"id":61173,"no":1417,"title":"Chapter 106: Xuan Su","content":"\u003cp\u003eChapter 106: Xuan Su\u003c/p\u003e\n\u003cp\u003e“Master Ruo, what happened?”\u003c/p\u003e\n\u003cp\u003eThe woman known as Xuan Su was first shocked when she saw the normally calm old man lose his composure before she promptly asked.\u003c/p\u003e\n\u003cp\u003e“It’s actually him…”\u003c/p\u003e\n\u003cp\u003eGrandmaster Ruo’s eyes were full of astonishment as he gazed at that figure. It was as if a raging tsunami had crashed into the land known as his heart. He had recognized this person; the one who was wantonly purchasing Elixirs turned out to be the youngster whom he first met in Yan city and to whom he had given the first three parts of “Spiritual Movement Chapter” to.\u003c/p\u003e\n\u003cp\u003eAt the time he first saw Lin Dong, the latter was only at the Earthly Yuan Stage and his Mental Energy was, likewise, at the most basic of levels. Due to the fact that Grandmaster Ruo treasured Mental Energy talent, he had taken the initiative to pass the first three parts of “Spiritual Movement Chapter” to Lin Dong. Yet, Grandmaster Ruo had never expected that the youth who was unable to even sense Mental Energy when they first met had now grown to such a level.\u003c/p\u003e\n\u003cp\u003eIn that brief moment of probing from before, Grandmaster Ruo’s Mental Energy had interacted with Lin Dong’s Mental Energy. In that instance, the former could clearly feel how powerful the latter’s Mental Energy had become. It was very likely that the latter had already unlocked his own Niwan Palace!\u003c/p\u003e\n\u003cp\u003eBased on Master Ruo’s current strength, unlocking one’s Niwan Palace, or even a 1st Seal or 2nd Seal Symbol Master would be nothing for him to be astonished about. However, Lin Dong was different. Just months before, he was someone who had no inkling of what Mental Energy was and yet, in a few months, this novice had transformed into a true Symbol Master. This insane rate of progress caused even a renowned person like Grandmaster Ruo to be shocked. After all, even he took several years to finally cross over to that stage that Lin Dong had taken less than one-tenth of that time to reach!\u003c/p\u003e\n\u003cp\u003eHis talent was simply out of the world.\u003c/p\u003e\n\u003cp\u003e“Master Ruo knows this person?” To one side, a beautiful, yet somewhat indifferent lady dressed in green asked in a surprised tone. Like the other lady, it was the first time she had seen this old man lose his composure.\u003c/p\u003e\n\u003cp\u003e“Mm, I do…” At that moment, Grandmaster Ruo slowly regained his composure as he stared at that figure in the auction area with a peculiar glint in his eyes and softly said: “The current him should be a true-blue Symbol Master.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eAfter hearing this, the lady in green slightly lifted her eyebrows before she promptly lost some of her initial interest. Though there was not an overabundance of ordinary Symbol Masters in the Thousand Gold Association, there were still quite a number of them. Therefore, such a revelation was really not very noteworthy. Furthermore, although this person seemed talented, it was likely that he had just recently unlocked his Niwan Palace, someone who could not even be considered as a 1st Seal Symbol Master. In fact, he would probably be unable to beat even a Heavenly Yuan Early Stage expert.\u003c/p\u003e\n\u003cp\u003e“Haha, Master Ruo, is there anything special about this Symbol Master?” The red clad Xuan Su gently smiled as she asked. She was clearly a highly insightful individual as she knew that an ordinary Symbol Master could not possibly cause Grandmaster Ruo to lose himself in such a way.\u003c/p\u003e\n\u003cp\u003e“An ordinary Symbol Master is indeed nothing to be amazed about. However, just a few months ago, that brat did not even know what a Symbol Master was…” Master Ruo smiled in an indifferent manner as he said.\u003c/p\u003e\n\u003cp\u003e“He had only been training his Mental Energy for a few months…”\u003c/p\u003e\n\u003cp\u003eWhen they heard these words, Xuan Su and the lady in green understood. They were rather knowledgeable about Symbol Masters, yet they had never heard of anyone who managed to advance from a newbie to a true Symbol Master in such a short time.\u003c/p\u003e\n\u003cp\u003e“When I first met this fellow at Mysterious Objects Mall, I wanted him to be my disciple, however, I was turned down.” Grandmaster Ruo laughed. He had seldom been rejected, therefore when he mentioned this fact, his expression turned slightly sour.\u003c/p\u003e\n\u003cp\u003eOf course, besides his expression, even Xuan Su and the lady in green were surprised. In Yan City, countless Symbol Masters were dying to become Grandmaster Ruo’s discipline. Yet this person actually dared to reject him. One wonders if he had an extraordinary background or if he was just a fool…\u003c/p\u003e\n\u003cp\u003e“When he left, I passed him the first three parts of “Spiritual Movement Chapter”. Judging by his talent, I had thought at first that he would probably take at least a year before he could unlock his Niwan Palace. However, right now, it seems like he had already reached that step…” Grandmaster Ruo somewhat regretfully said.\u003c/p\u003e\n\u003cp\u003e“Based on Master Ruo’s words, it seems like this person is a rather good seedling.” Xuan Su was full of interest as she spoke. She was one who preferred to take the long-term perspective into account when handling matters. If that person below was as talented as Grandmaster Ruo claimed, he would become a legendary figure in the future. If they could rope such a figure into their Thousand Gold Association, he would perhaps become a huge help.\u003c/p\u003e\n\u003cp\u003e“Who knows? There are so many talented individuals in this world. It is not so easy for them to reach their full potential. Aunt Su, don’t tell me you plan to recruit him?” The lady dressed in green pursed her fair lips, openly showing a trace of haughtiness.\u003c/p\u003e\n\u003cp\u003e“Girl, you are too proud and arrogant. Don’t be so quick to look down on others. If you keep thinking that way, you will eventually lose out.” Xuan Su rolled her eyes at the lady in green before she gently flicked the latter’s forehead with her slim fingers as she said in a resigned manner.\u003c/p\u003e\n\u003cp\u003e“Haha, Xuan Su, regarding the battle over the Celestial Pool, does our Thousand Gold Association still lack a member?” Grandmaster Ruo stared at the auction area before him as he suddenly chuckled and said.\u003c/p\u003e\n\u003cp\u003e“Yes, we still lack a member. At first, we planned to give that position to Song Qing. However, that girl Zhilan would rather be beaten to death than cooperate with that fellow.” Xuan Su replied as she nodded her head. Promptly, a glint flashed in her eyes as she inquired: “Grandmaster Ruo means to let that person take the position?”\u003c/p\u003e\n\u003cp\u003e“Aunt Xu, that battle for the Celestial Pool is very important. You can’t pick anyone who will just end up dragging us down! Besides, that person had only just unlocked his Niwan Palace, hence his powers are limited.” When she heard these words, the lady in green hastily interjected.\u003c/p\u003e\n\u003cp\u003e“Then shall we let Song Qing be your partner?” Xuan Su had a small smile on her lips as she said.\u003c/p\u003e\n\u003cp\u003e“No way! I would rather go solo than be partnered with that bastard!” When she heard Song Qing’s name, the lady dressed in green, who had been called Zhilan, immediately frowned as undisguised disgust surfaced in her eyes.\u003c/p\u003e\n\u003cp\u003e“Haha, don’t worry Zhilan. This old man has good judgement. The talent displayed by that fellow is definitely the top three among all the talented youths I have seen over the years. He should be capable enough. Besides, the battle for the Celestial Pool is fast approaching and since you refuse to work with Song Qing, we can only make do.” Grandmaster Ruo laughed as he said.\u003c/p\u003e\n\u003cp\u003e“Since Grandmaster Ruo says so, lets invite this gentleman over for a chat? If he is willing to represent our Thousand Gold Association for this Celestial Pool battle, we will definitely reward him lavishly.” Xuan Su slightly smiled and suggested as she gently pulled at the sulking Zhilan,\u003c/p\u003e\n\u003cp\u003e“Agreed.” Grandmaster Ruo stroked his beard as he lightly nodded.\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eInside the auction area, Lin Dong had been feeling a little uneasy ever since he realized that his looks had been scanned by that thread of Mental Energy. After lingering at the auction area for a while and he not finding any items that appealed to him, he immediately got up and walked towards the auction area’s exit.\u003c/p\u003e\n\u003cp\u003eHowever, just as Lin Dong was about to leave the auction area, an arm suddenly extended from one side as a slightly scrawny looking middle-aged man approached him with a smile: “Sir, may we trouble you for some of your time, our manager has invited you over.”\u003c/p\u003e\n\u003cp\u003eAs he gazed at the middle-aged man standing before him, Lin Dong slightly furrowed his eyebrows. He stealthily scanned his surroundings and realized that a dozen other men were slowly approaching. These men had strong auras and their footsteps were very steady. Evidently, they were all rather skilled.\u003c/p\u003e\n\u003cp\u003e“Lead the way.”\u003c/p\u003e\n\u003cp\u003eLin Dong’s gaze slightly flashed before he calmly nodded. Based on this welcome, it seems like the person that wanted to meet him was fairly reputable. These elite bodyguards were much more powerful than the Blood Cloth Sect members. Furthermore, after that thread of Mental Energy probed him previously, he had vaguely guessed who he would be meeting.\u003c/p\u003e\n\u003cp\u003eWhen he saw that Lin Dong did not resist, the smile on that middle-aged man’s face turned kinder. Promptly, he swiftly turned and to lead Lin Dong.\u003c/p\u003e\n\u003cp\u003eLin Dong followed behind as they passed through a corridor before finally entering a lavishly decorated room. Immediately, as he had expected, the smiling face of an elderly grey robed man appeared before his eyes.\u003c/p\u003e\n\u003cp\u003e“Haha, my friend, we meet again…” When he saw Lin Dong enter the room, Grandmaster Ruo slightly smiled as he said.\u003c/p\u003e\n\u003cp\u003e“It seems like I was found out in the end.”\u003c/p\u003e\n\u003cp\u003eUpon hearing what was said, Lin Dong involuntarily could not help but let out a bitter laugh. He removed the straw hat from his head and faced the elderly man as he clasped his hands together: “Lin Dong respectfully greets the grandmaster!”\u003c/p\u003e\n\u003cp\u003e“Hehe, this brat is indeed a remarkable youth. At this age, he has already become a Symbol Master. It seems like he has a bright future ahead.” In the room, a woman dressed in red curiously sized up Lin Dong before she charmingly smiled and commented.\u003c/p\u003e\n\u003cp\u003eBeside her, Zhilan glanced at Lin Dong before she withdrew her gaze with a trace of laziness.\u003c/p\u003e\n\u003cp\u003e“Could I inquire as to why these three esteemed individuals have summoned a youngster such as me?” Lin Dong knew that these three individuals before him were all of significant status in Yan City. Thus, without further ado, he immediately asked them.\u003c/p\u003e\n\u003cp\u003e“Lin Dong my friend, you should have mastered the first three parts of ‘Spiritual Movement Chapter’ that I passed to you right?” Grandmaster Ruo had a smile on his as he asked.\u003c/p\u003e\n\u003cp\u003e“Indeed.”\u003c/p\u003e\n\u003cp\u003eLin Dong humbly scratched his head and nodded. He had already fully mastered the first three parts of “Spiritual Movement Chapter” months ago…\u003c/p\u003e\n\u003cp\u003e“This person is the manager of the Thousand Gold Auction House. You can call her Manager Su. She is the one in charge of the whole auction house. This other lady is of utmost importance to the president of the Thousand Gold Association, Xia Zhilan.” Master Ruo introduced the other two to Lin Dong.\u003c/p\u003e\n\u003cp\u003eLin Dong lightly nodded his head. However, he did not lose his composure. First, he had already suspected that these two were of a prominent background. Second, they did not have much relation to him. Thus after he glanced at them, he turned back to look at Grandmaster Ruo. After all, he knew that these people did not approach him for no reason.\u003c/p\u003e\n\u003cp\u003eTowards Lin Dong’s undisturbed expression, Xuan Su did not mind much and only sweetly laughed in response. While the lady in green’s eyebrows slightly knitted together.\u003c/p\u003e\n\u003cp\u003e“The reason we invited you over was because we have a request.”\u003c/p\u003e\n\u003cp\u003eAfter Grandmaster Ruo finished with his pleasantries, he returned to the main topic. He looked towards Lin Dong, smiling as he said: “My friend, currently, you should have unlocked your Niwan Palace right? If you agree to help us, I can aid you in condensing a Destiny Symbol.”\u003c/p\u003e\n\u003cp\u003eWhen he heard these words, Lin Dong’s facial expression turned a little strange. After he considered how to reply for a while, he softly said: “Grandmaster Ruo, even though I don’t know what exactly is your request. However,… with regards to the Destiny Symbol, I have already condensed it…”\u003c/p\u003e\n\u003cp\u003eInside the room, that youngster’s voice gently echoed out as the smiles on Grandmaster Ruo’s, Xuan Su’s and Zhilan’s face immediately turned stiff…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-105\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-107\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-106","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
