{"id":61181,"no":1425,"title":"Chapter 114: Entering the Celestial Dan Pool","content":"\u003cp\u003eChapter 114: Entering the Celestial Dan Pool\u003c/p\u003e\n\u003cp\u003eWhen the judges’ voices echoed out on the mountain peak, both factions momentarily fell silent. Immediately, cheers erupted from the Thousand Gold Association’s side.\u003c/p\u003e\n\u003cp\u003eThis outcome had surpassed everyone’s expectations!\u003c/p\u003e\n\u003cp\u003eNo one had ever imagined that even after Jiang Li used “Blood Conversion Art” to forcefully upgrade his power to Initial Yuan Dan Stage, he would still be defeated by Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Xuan Su, your judgement is great as always. Even though Lin Dong’s innate\u0026nbsp; Yuan Power isn’t extremely strong, his Mental Energy is exceptionally powerful. Based on that Secret Spirit Art that he displayed at the end, he has probably advanced to the 2nd Seal Symbol Master level.” Xia Wanjin’s face was plastered with pride and joy over this unexpected victory as he turned to Xuan Su and smiled.\u003c/p\u003e\n\u003cp\u003eUpon hearing these words, Xuan Su gently smiled in response. Her beautiful face seemed calm, however in the sea of her heart, waves were raging.\u003c/p\u003e\n\u003cp\u003eAccording to Master Ruo, Lin Dong had only begun training his Mental Energy for a short period of time. However, the current him had already reached a level similar to a 2nd Seal Symbol Master. His progress… was simply incredulous!\u003c/p\u003e\n\u003cp\u003e“This boy’s talent probably far exceeds Master Ruo’s expectations. His achievements in the future will definitely be extremely terrifying…” A glint flashed in Xuan Su’s beautiful eyes. Right now, Lin Dong’s strength could not be considered top-tier in Yan City, however his potential was simply unmatched!\u003c/p\u003e\n\u003cp\u003eEven if they could not recruit him, they definitely must not offend him.\u003c/p\u003e\n\u003cp\u003eXuan Su had always been fairly confident in her judgement.\u003c/p\u003e\n\u003cp\u003e“This fellow has hidden himself so well.” Xia Zhilan glanced at the ragged figure of Jiang Li, before she turned to look at the young man, who emitted a strong pressure while standing in the middle of the arena as her face involuntarily turned slightly red.\u003c/p\u003e\n\u003cp\u003eOf course, this was not a sign of affection. Rather, Xia Zhilan had recalled all the harsh words that she had spoken to Lin Dong, such as ‘boasting about the two consecutive victories’ and ‘emphasizing that he was merely a stand in…’\u003c/p\u003e\n\u003cp\u003eAs she observed the situation now and recalled her words, Xia Zhilan’s face began to feel slightly warm. In fact, it was almost like she had slapped her own face rather soundly.\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003e“We lost…”\u003c/p\u003e\n\u003cp\u003eWhile the Thousand Gold Association was rejoicing, over at Blood Wolf Gang, it suddenly became extremely quiet. Meanwhile, Yue Shan and the rest’s faces turned exceedingly grim.\u003c/p\u003e\n\u003cp\u003eOriginally, they thought that they would easily win this round. However, the final outcome had completely surprised them!\u003c/p\u003e\n\u003cp\u003e“Seems like that kid is the real trump card of the Thousand Gold Association.” Beside Yue Shan, a hideous looking elderly man let out a bitter laugh as he muttered softly.\u003c/p\u003e\n\u003cp\u003e“Where did that kid come from?”\u003c/p\u003e\n\u003cp\u003eYue Feng furrowed his eyebrows as he asked, a hint of coldness in his voice. In Yan City, he could be considered as one of the elite younger generation members. However, even he did not have the confidence that he could defeat an Initial Yuan Dan Stage practitioner. Yet, Lin Dong, who looked even younger, was able to accomplish such a feat. This caused a hint of resentment and jealousy to surface in his heart.\u003c/p\u003e\n\u003cp\u003e“I do not know. He is very unfamiliar. Perhaps, he is not from our Yan City.”\u003c/p\u003e\n\u003cp\u003eUpon hearing Yue Feng’s conversation, Yue Shan narrowed his eyes as he stared at Lin Dong. Meanwhile, a cold glint flashed in his pupils.\u003c/p\u003e\n\u003cp\u003e“Sect leader Yue Shan, now that the results have been announced. Thank you.” When he saw Yue Shan staring at Lin Dong, Xia Wanjin casually smiled as he cupped his hands and said.\u003c/p\u003e\n\u003cp\u003e“Heh heh, President Xia seems to have found a good helper.” Yue Shan chuckled.\u003c/p\u003e\n\u003cp\u003e“Likewise to you. However, now that our Thousand Gold Association has achieved two out of three victories, this ‘Celestial Dan Pool’ belongs to our faction. With regards to this fact, Sect leader Yue should have no objections right?” Xia Wanjin smiled as he said.\u003c/p\u003e\n\u003cp\u003eWhen he heard these words, Yue Shan and the rest involuntarily clenched their fists. Yue Feng and Yue Ling were even more disgruntled. After all, this Celestial Dan Pool was exceedingly useful for Heavenly Yuan Late Stage practitioners like them. If they could absorb the energy within, then the time needed for them to advance to Yuan Dan Stage will shrink by several times!\u003c/p\u003e\n\u003cp\u003eWhen they saw the actions of the Blood Wolf Sect, several experts at the Thousand Gold Association began to tense up as their hands slowly extended to the weapons strapped at their waist.\u003c/p\u003e\n\u003cp\u003e“What? Sect Leader Yue Shan does not want to admit his loss? Today’s matter is well-known among Yan City’s factions. If news of this event spread out, it might hurt the Blood Wolf Gang’s reputation. That’s not good at all.” Xia Wanjin’s face remained calm as he stared at Yue Shan and casually said.\u003c/p\u003e\n\u003cp\u003eYue Shan’s facial expression was in a constant flux. Moments later, he chuckled and said: “Worry not, my Blood Wolf Gang can afford this loss.”\u003c/p\u003e\n\u003cp\u003e“Father!” When he heard these words, Yue Feng yelled out unhappily.\u003c/p\u003e\n\u003cp\u003e“Leave!”\u003c/p\u003e\n\u003cp\u003eAs Yue Shan commanded in an unwavering voice he waved his hand and instructed two men to support the ragged Jiang Li. Then, he immediately led the rest of his troops and headed down the mountain. Just as he passed by Lin Dong, he suddenly stopped and turned to look at the latter. Suddenly, with a smile, he said: “This young man is indeed powerful. Our Blood Wolf Gang deserves this loss. In the future, if you are interested, you are welcome to come to our Blood Wolf Gang. I will definitely treat you with the utmost respect!”\u003c/p\u003e\n\u003cp\u003e“Thank you for the offer, Sect Leader Yue Shan.”\u003c/p\u003e\n\u003cp\u003eFaced with this elite practitioner from Yan City, Lin Dong did not dare to be slow as he quickly cupped his hands and smiled. When his gaze met Yue Shan’s, he felt his heart shiver. From the latter’s eyes, he could detect a hint of coldness. It seems like contrary to this appearance, this Yue Shan was not as savage as he seemed. In fact, this man was quite cunning.\u003c/p\u003e\n\u003cp\u003eAfter he made this customary greeting, Yue Shan could not be bothered to speak any further. He lifted his leg and left. Behind him, Yue Feng and the rest turned to glare at Lin Dong before they also left.\u003c/p\u003e\n\u003cp\u003eWith regards to their stares, Lin Dong chose to ignore them. Even though his actions may have offended the Blood Wolf Gang, that was the price to pay to obtain the “Celestial Dan Pool”. In fact, he could also use this opportunity to improve his relationship with Thousand Gold Association. Therefore, his overall gains probably exceed his losses.\u003c/p\u003e\n\u003cp\u003eAs the Blood Wolf Gang left the mountain like a flood, the mountain peak suddenly became much emptier.\u003c/p\u003e\n\u003cp\u003e“Hehe, for this Celestial Pool Battle, we must sincerely thank this young one, Lin Dong, for your assistance.” After the Blood Wolf Gang withdrew, Xia Wanjin walked over and said with a smile. His attitude was undoubtedly much better than before.\u003c/p\u003e\n\u003cp\u003e“It is my duty after all.” Lin Dong smiled as he said.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, since we have agreed to let you absorb the energy from the Celestial Dan Pool, we will not go back on it.” Xuan Su gently stepped forward as she smiled and said.\u003c/p\u003e\n\u003cp\u003eWhen he heard her words, Xia Wanjin was slightly taken aback. In the end, he did not speak any further. After all, the strength that Lin Dong had displayed indicated that he was a worthy member for them to recruit.\u003c/p\u003e\n\u003cp\u003eXuan Su led the group as they approached the small pool near the mountain walls. As they were approaching, Lin Dong could clearly feel a potent Yin and Yang Energy floating over the pool.\u003c/p\u003e\n\u003cp\u003e“When I first discovered this Celestial Dan Pool, there was an extremely powerful Demonic Beast guarding it. After a gruelling battle, not only was I unable to defeat it, but that Yue Shan also discovered it and rushed over. Finally, after the two of us joined forces, we were able to injure that Demonic Beast and chase it away. However, that was also the reason why we were forced to hold this Celestial Pool Battle.” Xia Wanjin stood beside the Celestial Dan Pool as he softly sighed.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eUpon hearing these words, Lin Dong was slightly moved. What Demonic Beast was so powerful such that it actually required two Perfect Yuan Dan experts to force it to retreat.\u003c/p\u003e\n\u003cp\u003e“I have already measured the amount of energy in this Celestial Dan Pool and it should be sufficient for four people. Since Xuan Su has already promised Lin Dong, then naturally we will keep our word. How about this, the four people shall be Zhilan, Liu Yi, Lin Dong and Xia Shi.” As he stared at the Celestial Dan Pool, Xia Wanjin contemplated for a moment before he made his decision.\u003c/p\u003e\n\u003cp\u003eThe first three people nominated had took part in the competition. For the last member, he was a fairly well-reputed member of Thousand Gold Association.\u003c/p\u003e\n\u003cp\u003eWith regards to Lin Dong’s appointment, most of them did not object. After all, if Lin Dong had not managed to pull an upset and defeat Jiang Li, the ones who were departing now would probably be their Thousand Gold Association.\u003c/p\u003e\n\u003cp\u003eTherefore, even Xia Zhilan did not dare to speak up. Evidently, she had acknowledged Lin Dong’s strength and contributions.\u003c/p\u003e\n\u003cp\u003e“”The four of you can enter the Celestial Dan Pool together. Though it is not a large pool, it is exceedingly deep and cold in the deeper parts. It is best not to venture deeply. During this period of time, if any mishaps happen, we will be around to protect all of you.”\u003c/p\u003e\n\u003cp\u003e“With regards to how much energy you can absorb from this Celestial Dan Pool, it will depend on yourself.”\u003c/p\u003e\n\u003cp\u003eWhen they heard Xia Wanjin’s words, the four of them nodded their heads. Then, with a slightly feverish look, they stared at the Yin and Yang energy rising from the pool.\u003c/p\u003e\n\u003cp\u003e“Haha, now that you have been informed, let’s begin…” Xia Wanjin gently smiled before he sat down on a rock nearby. The rest of the Thousand Gold Association’s troops began to disperse themselves as they stood guard nearby.\u003c/p\u003e\n\u003cp\u003e“Splash!”\u003c/p\u003e\n\u003cp\u003eThe person who entered the pool first was naturally Xia Zhilan. Yuan Power undulated around her body, like a thin protective layer, before she immediately lept into the Celestial Dan Pool.\u003c/p\u003e\n\u003cp\u003eWhen Xia Zhilan jumped into the pool, a vortex immediately formed on the water’s surface as streams of pure Yin and Yang Energy quickly gathered together. Evidently, the former had already begun absorbing the energy.\u003c/p\u003e\n\u003cp\u003eWhen they witnessed this sight, Liu Yi and that burly man known at Xia Shi immediately leapt into the pool. After all, the energy in the pool was\u0026nbsp; limited and they did not want to lose out, that would be a tragedy.\u003c/p\u003e\n\u003cp\u003eWhen he saw their actions, Lin Dong involuntarily laughed. Then, following Xia Zhilan’s example, he let Yuan Power spread out across his body before he leapt into the pool.\u003c/p\u003e\n\u003cp\u003e“Splash.”\u003c/p\u003e\n\u003cp\u003eAs Lin Dong and the rest jumped in, that vortex on the Celestial Dan Pool began to grow as the sound of water churning began to spread out…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-113\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-115\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-114","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
