{"id":61199,"no":1443,"title":"Chapter 132: Say it again","content":"\u003cp\u003e\u003cstrong\u003eChapter 132: Say it again\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eTowards Zi Yue’s almost expressionless face and indifferent tone, Lin Dong did not turn and leave in a petty manner. Previously, when he took part in the Celestial Dan Pool battle, Xia Zhilan had also mostly maintained such an attitude, however, compared to Xia Zhilan, this Zi Yue before him seemed even more unreasonable.\u003c/p\u003e\n\u003cp\u003eIf Xia Zhilan was compared to Zi Yue, the former would actually be considered fairly gentle.\u003c/p\u003e\n\u003cp\u003eGrandmaster Yan let out a dry cough as he forced a smile and said: “Girl, you still have such a temper. Don’t worry, Lin Dong’s Mental Energy is not inferior to yours.”\u003c/p\u003e\n\u003cp\u003eUpon hearing these words, Zi Yue’s pretty eyes suddenly flashed. Without moving, a strong Mental Energy wave was as swift as lightning as it ruthless shot towards Lin Dong.\u003c/p\u003e\n\u003cp\u003eLin Dong had yet to speak ever since she had entered the room. And just as this Mental Energy wave shot towards him, his eyebrow finally slightly raised. With a thought, Mental Energy that did not lose to hers gushed out of his Niwan Palace before moving to obstruct that Mental Energy wave.\u003c/p\u003e\n\u003cp\u003e“Swish!”\u003c/p\u003e\n\u003cp\u003eZi Yue also sensed Lin Dong’s defense, her beautiful eyes flickered as that Mental Energy wave weirdly split into ten different parts, by passing Lin Dong’s defence and once again dashing towards the latter.\u003c/p\u003e\n\u003cp\u003eThe control Zi Yue had over Mental Energy somewhat exceeded Lin Dong’s expectations. As expected, someone who was able to be regarded by grandmaster Yan indeed had some ability.\u003c/p\u003e\n\u003cp\u003eIn response to the Mental Energy wave that made a beeline for him, Lin Dong did not try to obstruct it again. With a wave of his sleeve, the Mental Energy that was avoided by Zi Yue seemingly did not have any intention of returning as it directly condensed into a long Mental Energy needle and ruthlessly stabbed towards Zi Yue’s forehead.\u003c/p\u003e\n\u003cp\u003eThe two Mental Energies respectively rushed towards the two with the intention to harm. Although the scene looked calm, if they were hit by the attacks, both parties would be injured.\u003c/p\u003e\n\u003cp\u003eThe long Mental Energy needle rapidly grew bigger before Zi Yue’s eyes, she frostily stared at Lin Dong who was seated on the ground, still as a statue, before letting out a snort and dispersing the attacking Mental Energy wave. At the same time, another portion of Mental Energy gushed out from her Niwan Palace and smashed into the long Mental Energy needle.\u003c/p\u003e\n\u003cp\u003e“Snap!”\u003c/p\u003e\n\u003cp\u003eIn the instance the two forces collided, the long Mental Energy needle shattered but did not dissipate as Zi Yue had expected. Instead, it transformed into numerous short fragments which swiftly shot towards Zi Yue.\u003c/p\u003e\n\u003cp\u003e“Humph!”\u003c/p\u003e\n\u003cp\u003eZi Yue clearly did not expect that Lin Dong’s control of Mental Energy had actually reached this level. Immediately, she once again snorted as she waved her lily-white hand. Mental Energy rapidly condensed before her and in the blink of an eye, it took the shape of an invisible Mental Energy shield.\u003c/p\u003e\n\u003cp\u003e“Clang clang clang!”\u003c/p\u003e\n\u003cp\u003eThe Mental Energy fragments hit the Mental Energy shield, causing it to ripple. However, they did not seem to achieve any significant effect.\u003c/p\u003e\n\u003cp\u003e“A defensive type Secret Spirit Art…”\u003c/p\u003e\n\u003cp\u003eAs he gazed at the Mental Energy shield that had formed in front of Zi Yue, astonishment flitted across Lin Dong’s eyes. Soon after, he inwardly sighed, being alone, he had to strive to get his own skills...\u003c/p\u003e\n\u003cp\u003eAfter blocking Lin Dong’s counter attack, the Mental Energy shield before Zi Yue also dissipated. Beautiful yet cold eyes took one look at Lin Dong before finally speaking to him for the first time: “Decently skilled.”\u003c/p\u003e\n\u003cp\u003eAlthough it was only a preliminary exchange, Zi Yue was able to sense that Lin Dong indeed had some ability, thus, the frostiness in her voice was slightly milder. After all, strength was the swiftest way to gain recognition, though Lin Dong did not care about her recognition.\u003c/p\u003e\n\u003cp\u003e“Haha, if you don’t fight you won’t get to understand each other…” At this time, the spectator, grandmaster Yan chuckled as he spoke.\u003c/p\u003e\n\u003cp\u003eLin Dong rolled his eyes at him before sighing: “When does the Tower Battle start?”\u003c/p\u003e\n\u003cp\u003e“In two days.”\u003c/p\u003e\n\u003cp\u003eGrandmaster Yan smiled as he replied: “However, some Symbol Masters from other cities have already rushed here today, since you are still new to the Symbol Master Guild, it just happens that Zi Yue can bring you around.”\u003c/p\u003e\n\u003cp\u003eLin Dong was stunned, just as he was about to reject, Zi Yue had already nodded her head in a mechanical manner: “Yes, teacher.”\u003c/p\u003e\n\u003cp\u003eYet, after she said these words, she made no indication to move. Lin Dong looked at her and without saying anything, he stood up first and brought Little Flame out of the bamboo house.\u003c/p\u003e\n\u003cp\u003eGazing at the man and tiger as they walked out of the door, Zi Yue’s lily-white hand brushed away a strand of fine black hair across her forehead as her shapely eyebrows knitted together before speaking: “Teacher does not trust me?”\u003c/p\u003e\n\u003cp\u003e“*Sigh*, you little girl, what are you thinking again. With your strength, there is a high chance of victory this time. Teacher only did this as an addition form of insurance. After all, our Yan City Symbol Master Guild has already lost twice. If we lose again this time, the Symbol Master Tower would be relocated to Sky Fire City. This matter is of utmost importance, I cannot be careless.” Grandmaster Yan helplessly explained.\u003c/p\u003e\n\u003cp\u003e“If I am no good, that person will also be useless.” Zi Yue was silent for a while before she replied. In their previous exchange, she had sensed that there was not much difference between them. If even she were to fail, then Lin Dong would not fare any better.\u003c/p\u003e\n\u003cp\u003e“It’s hard to say…”\u003c/p\u003e\n\u003cp\u003eHowever, grandmaster Yan slowly shook his head as he earnestly said: “You should know that just a year before, Lin Dong did not even know anything about Mental Energy. Yet, in a mere year, he was able to reach the same level as you. This level of Mental Energy talent is extremely overwhelming.”\u003c/p\u003e\n\u003cp\u003e“Perhaps he had a miraculous encounter.” Zi Yue softly said. It must be said that a woman’s intuition was very terrifying.\u003c/p\u003e\n\u003cp\u003e“Perhaps. However, luck is also a type of strength.”\u003c/p\u003e\n\u003cp\u003eGrandmaster Yan lightly nodded, soon after, he spoke in a low voice: “Plus, even if your Mental Energy is not weaker than his, if you truly fought, your chance of losing would likely be greater. This is because Lin Dong’s ways are more ruthless than yours. Not only against an enemy, but also to himself…”\u003c/p\u003e\n\u003cp\u003e“From the previous exchange, he was clearly able to withdraw and take defensive measures, yet, he still chose to take the risk to attack, this ability to fight as if his life was on the line is one where you are lacking compared to him. Therefore, in the end, you still chose to return and defend.”\u003c/p\u003e\n\u003cp\u003e“Do not underestimate Lin Dong. Although he is not even twenty years of age, even Gu Ying and a crafty fox like Wei Tong met their ends at his hand. This little brat would definitely be something when he grows up in the future.” Grandmaster Yan sincerely said.\u003c/p\u003e\n\u003cp\u003eZi Yue was silent, no one knew if these words had managed to reach her.\u003c/p\u003e\n\u003cp\u003e“Haha, you do not need to think too much. First go and bring Lin Dong around, other than that, make sure you are amply prepared over these two days. No matter what, we must not lose again to Sky Fire City in the Tower Battle this time!”\u003c/p\u003e\n\u003cp\u003e“Yes!”\u003c/p\u003e\n\u003cp\u003eZi Yue nodded her head before bowing. Only then did she gracefully withdraw from the bamboo house.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eZi Yue walked out of the room and gazed at Lin Dong, who was standing at the door, as her indifferent voice sounded out. She then proceeded to lead him, the latter could only grimace, he had originally wanted to say that he had some matters to attend to and had to make a move first. However, Zi Yue did not give him this chance.\u003c/p\u003e\n\u003cp\u003eSince he had come, he should make the most of it. Lin Dong followed behind Zi Yue as they walked in the seemingly ordinary yet extremely important and spacious courtyard in Yan City. Along the way, he saw quite a few Symbol Masters, who cast some astonished gazes towards the fact that he was following behind Zi Yue.\u003c/p\u003e\n\u003cp\u003eAs they walked, he could tell that Zi Yue had a rather substantial reputation here. When some Symbol Masters saw her, they seemed to become ‘yes-men’. This caused Lin Dong to be somewhat surprised, even though this ice queen was quite powerful, others need not be afraid of her to this extent right?\u003c/p\u003e\n\u003cp\u003eWhile the two travelled, there was not much interaction between them. Zi Yue did not seem even the slightest bit like a guide and Lin Dong could only feel a deep sense of helplessness towards this. This kind of woman was truly a headache.\u003c/p\u003e\n\u003cp\u003eAfter walking for about ten minutes, the two finally reached the deeper part of the courtyard. At this moment, Lin Dong suddenly lifted his head to gaze at a nearby ash-colored tower as his expression turned a little serious. From that tower, he could sense an extremely frightening Mental Energy. This Mental Energy was by far greater than even grandmaster Yan’s.\u003c/p\u003e\n\u003cp\u003e“That is the Symbol Master Tower. It was condensed with the Mental Energy of numerous past Symbol Masters and is the holy land of our Yan City Symbol Masters.”\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong was still mind-blown at the terrifying Mental Energy from within the tower, Zi Yue finally opened her mouth and spoke.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded his head. This Symbol Master Tower was indeed somewhat mystical, no wonder grandmaster Yan regarded it so importantly.\u003c/p\u003e\n\u003cp\u003eAfter saying those few words, Zi Yue once again continued to walk. After journeying for a few minutes, her footsteps suddenly came to a halt as her beautiful eyes gazed at the plaza that had appeared before her. Currently, there were quite a few people in the plaza and what amazed Lin Dong was that all of these people were Symbol Masters.\u003c/p\u003e\n\u003cp\u003eZi Yue walked along one of the paths at the side of the plaza and stared arrogantly at the plaza. Her fine, long and shapely eyebrows slightly knitted together.\u003c/p\u003e\n\u003cp\u003eLin Dong stood at her side and took a look at the plaza. Currently, there were two people competing in the plaza while a many people crowded around them, yelling and cheering.\u003c/p\u003e\n\u003cp\u003eLin Dong’s gaze also scanned the scene as a trace of astonishment flitted across his eyes. He had found that the white clothed man inside the plaza had actually reached the second seal Symbol Master level! Yet his opponent was only a first seal Symbol Master, clearly, there was nothing exciting about such a match.\u003c/p\u003e\n\u003cp\u003eAs Lin Dong had expected, nothing of interest occurred in their competition. In a few rounds, the first seal Symbol Master was quickly defeated as gasps sounded out from the surroundings.\u003c/p\u003e\n\u003cp\u003e“The Yan City Symbol Master Guild is indeed sloppy and ordinary. Looks like the Symbol Master Tower will soon belong to our Sky Fire City.” The white clothed man evidently had a rather wild character. Instead of being humble, he heartily laughed as he declared.\u003c/p\u003e\n\u003cp\u003eHis laughter immediately drew some furious gazes, however, he payed no attention to them as took a step forward and sneered: “If anyone disagrees, feel free to step up. Truth be told, I am only one of the higher ranking members in Sky Fire City’s Symbol Master Guild. If all of you are unable to beat even me, I think it would be better to just do away with this time’s Tower Battle. It would save you guys the trouble!”\u003c/p\u003e\n\u003cp\u003e“Third senior is right!”\u003c/p\u003e\n\u003cp\u003eThe white clothed man’s words also drew the support of some of the Symbol Masters from Sky Fire City. After hearing these words, some of the Yan City Symbol Masters turned red with anger, however, there was after all quite a gap between them and the former while the elites of their faction were not here. For a time, no one dared to speak up.\u003c/p\u003e\n\u003cp\u003e“Oh...this person has become a second seal Symbol Master and is only one of the better few in Sky Fire City. Looks like Sky Fire City indeed has many capable talents.” On the walkway, Lin Dong stroked his chin, appearing as if he had something on his mind.\u003c/p\u003e\n\u003cp\u003eJust as these words were said, he suddenly felt a frosty gaze staring at him. Immediately, he coughed, feeling that something bad was about ot happen, he straightaway opened his mouth and said: “Miss Zi Yue, I still have some matters to attend to at home, I’ll have to take my leave first…”\u003c/p\u003e\n\u003cp\u003eHowever, Zi Yue ignored his words. Her beautiful eyes were fixed on Lin Dong as a dazzling and breathtaking smile suddenly appeared on her ice-cold face.\u003c/p\u003e\n\u003cp\u003e“As a Yan City Symbol Master, you have the duty to protect the prestige of our city’s Symbol Masters. You can deal with this arrogant guy.”\u003c/p\u003e\n\u003cp\u003eThough her tone was one of inquiry, just as her words were spoken, Lin Dong felt a portion of Mental Energy gush out from behind him before directly pushing him into the plaza, coincidentally landing right before the white clothed man...\u003c/p\u003e\n\u003cp\u003e“Good, very courageous!”\u003c/p\u003e\n\u003cp\u003e“As expected of our Yan City Symbol Masters.”\u003c/p\u003e\n\u003cp\u003eLin Dong’s movement initially caused the some of the Symbol Masters from Yan City to be stunned, but quickly after, waves of cheers exploded out. Although they did not know if Lin Dong had the ability, his courage was praise worthy.\u003c/p\u003e\n\u003cp\u003eAfter hearing the surrounding cheers, Lin Dong rolled his eyes.\u003c/p\u003e\n\u003cp\u003e“Heh, Yan City sure has some over prideful guys. However, this is also good, I’ve yet to have fulfill myself today!”\u003c/p\u003e\n\u003cp\u003e“Sorry, I went to the wrong place…”\u003c/p\u003e\n\u003cp\u003eYet, in response to these words, Lin Dong merely shrugged his shoulders and spoke a sentence that caused the surrounding audience to become dumbstuck. Before his words could fade, he planned to turn and leave, although he was not afraid, he did not want to engage in fights that were not of his own initiative.\u003c/p\u003e\n\u003cp\u003eOn the pathway, Zi Yue was also stunned by Lin Dong’s actions. Soon after, her long and shapely eyebrows almost became vertical in anger.\u003c/p\u003e\n\u003cp\u003e“Cowardly trash.”\u003c/p\u003e\n\u003cp\u003eThe white clothed man pursed his lips as he shook his head and sneered.\u003c/p\u003e\n\u003cp\u003e“Huu…”\u003c/p\u003e\n\u003cp\u003eJust as Lin Dong turned, he suddenly stopped before raising his head and lightly breathing out. He once gain turned around, the smile on his face was particularly wide.\u003c/p\u003e\n\u003cp\u003e“Can you say that again?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-131\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-133\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-132","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
