{"id":61283,"no":1527,"title":"Chapter 216: Eagle Martial Dojo","content":"\u003cp\u003e\u003cstrong\u003eChapter 216: Eagle Martial Dojo\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSeated on the cart, Lin Dong’s eyes turned to observe the crowd around him, as they attentively surveyed their surroundings. From the solemn expressions on their faces, he could deduce that during this period of time, they had been attacked several times by Demonic Beasts. This fact puzzled him slightly. Usually, even though Demonic Beast were savage, they would not pursue their targets incessantly. One wonders what the Eagle Martial Dojo had done in order to draw such hostility.\u003c/p\u003e\n\u003cp\u003e“Haha, little brother Lin Dong, drink some water.”\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong was deep in thought, a laugher suddenly sounded out. Promptly, he stretched his arms out and grabbed onto a water bag, before lifting his head to smile at the person who had tossed him the water bag.\u003c/p\u003e\n\u003cp\u003eThe latter was a middle-aged man known as Wuzhen, and his age, he could be considered an old man in the Eagle Martial Dojo. Also, he was a perfect Yuan Dan stage practitioner, and had some prestige in the Eagle Martial Dojo. Lin Dong had a rather favourable impression of this outspoken and straightforward man, who was somewhat similar to Jiang Lei.\u003c/p\u003e\n\u003cp\u003e“Thank you, old brother Wu.” Lin Dong smiled, before he drank from the water bag. Instantly, his face flushed as he realized that contained within that bag was not water, but instead strong liquor.\u003c/p\u003e\n\u003cp\u003e“Haha.”\u003c/p\u003e\n\u003cp\u003eWhen they saw Lin Dong’s flushed face, the crew from the Eagle Martial Dojo could not help but laugh.\u003c/p\u003e\n\u003cp\u003e“Haha, old Wu. Don’t bully Lin Dong because he is young!” Leading the pack, Jiang Lei was drawn by the laughter.\u003c/p\u003e\n\u003cp\u003eLin Dong helplessly shook his head, before he threw that liquor bag towards Wuzhen. He knew that they did not mean to insult him, and honestly, he rather enjoyed this feeling. Perhaps they were influenced by Jiang Lei’s forthright character, as most of the Eagle Martial Dojo members were rather likeable. After he spent nearly half a year in these old woods, Lin Dong was quite glad to be part of these jovial teasing.\u003c/p\u003e\n\u003cp\u003eOf course, there was one exception...\u003c/p\u003e\n\u003cp\u003eLin Dong lifted his head to look at Jiang Xue, who had unknowingly came by. In his heart, he knew that this women remained reluctant to accept a foreign person like him. In her eyes, he found caution and suspicion.\u003c/p\u003e\n\u003cp\u003e“From time to time, our Eagle Martial Dojo will venture into the Mist Forest to hunt Demonic Beasts, gather Demonic Crystals and search for Elixirs.” Jiang Xue who was seated beside Lin Dong suddenly muttered casually.\u003c/p\u003e\n\u003cp\u003e“However, it was different this time. When one of our crew members was gathering Elixirs, he attracted a young beast and ended up killing it… Later, when we were being attacked by these Demonic Beasts, we realized that the young beast was the cub of the Mist Leopard Alligator King.”\u003c/p\u003e\n\u003cp\u003e“The Mist Leopard Alligator King is a fairly renowned and vicious Demonic Beast in the Mist Forest. One male and one female, if they were to combined forces, they could match up to an advanced Form Creation stage practitioner. During this period of time, the reason why we have been continuously attacked was likely due to their orders. Tomorrow, we will leave the Mist Forest. Based on their cunning and vicious characters, they will definitely strike tonight.”\u003c/p\u003e\n\u003cp\u003eWhen he heard her words, Lin Dong finally realized why the atmosphere in this troop was slightly odd. It turned out that they were being hunted. If what Jiang Xue said was true, this so-called male and female Leopard Alligator King must have teamed up. At that time, if they brought along other Demonic Beasts to kill them, they people would likely be doomed.\u003c/p\u003e\n\u003cp\u003e“I did not approve of you joining us, because I felt that you would drag us down at that time.” Jiang Xue’s words were extremely direct. Lin Dong was younger than her and he seemed like a youthful brat. It was already a stretch for their current crew to protect little Yinyin and the rest. With the addition of Lin Dong, they would have to use more manpower.\u003c/p\u003e\n\u003cp\u003e“Oh, at that time, don’t worry about me.” Lin Dong rubbed his face, which was burning red from the alcohol, as he chuckled.\u003c/p\u003e\n\u003cp\u003eJiang Xue’s beautiful eyes stared at Lin Dong, before she suddenly said: “However, father told me that you are not as simple as you look.”\u003c/p\u003e\n\u003cp\u003eLin Dong was slightly taken aback and declined to comment.\u003c/p\u003e\n\u003cp\u003e“Even though I do not fully believe him, however… I hope that you will not plot against our dojo. Furthermore, if the situation worsens tonight… please take care of little Yinyin.” Jiang Xue’s voice gradually turned gentle. After she spoke, she floated off along with a whiff of fragrance.\u003c/p\u003e\n\u003cp\u003e“This woman…” As he stared at Jiang Xue’s beautiful departing figure, Lin Dong helplessly shook his head.\u003c/p\u003e\n\u003cp\u003e“Haha, little brother Lin Dong, pay no heed to her. That brat Xue-er cares deeply for this dojo and she does not want anything to happen to it. Honestly, she has a really good heart. The food that you ate today was specifically delivered to you as per her instructions.” Wuzhen walked over and said with a smile.\u003c/p\u003e\n\u003cp\u003e“It’s alright.” Lin Dong gently smiled.\u003c/p\u003e\n\u003cp\u003e“Be careful tonight. You are a truly unlucky fellow to stumble upon us…” Wuzhen patted Lin Dong’s shoulder as he sighed.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded his head. He could see the highly worried look in the middle of Wuzhen’s eyebrows. It seems like he was constantly worrying about the potential trouble tonight.\u003c/p\u003e\n\u003cp\u003eAfter conversing with Lin Dong for a short while, Wuzhen turned and left. Staring at the solemn expressions on their faces, Lin Dong softly sighed.\u003c/p\u003e\n\u003cp\u003e“Big brother, will we be alright?” Little Yinyin jutted out from the cart, carrying Little Flame in her hands, as her large eyes stared at Lin Dong and asked.\u003c/p\u003e\n\u003cp\u003e“Haha, it will be fine. Just some stupid wild beasts, there is nothing to fear…” Lin Dong gently smiled as he patted little Yinyin’s head and softly consoled her.\u003c/p\u003e\n\u003cp\u003e...\u003c/p\u003e\n\u003cp\u003eAs the crew continuously travelled forward, the sky gradually began to darken. Meanwhile, the atmosphere among the crew began to turn increasingly tensed as everyone tightly gripped onto their weapons. After all, they understood that tonight was going to be the most challenging night for them.\u003c/p\u003e\n\u003cp\u003e“Set up camp!”\u003c/p\u003e\n\u003cp\u003eStanding in front, Jiang Lei suddenly stopped, and took a look the sky, as he suddenly said in a low voice.\u003c/p\u003e\n\u003cp\u003eWhen they heard his command, the Eagle Martial Dojo members began to get busy. In a short period of time, a campsite emerged on this empty woodlands. Next, a variety of simple defensive structures were built as well. It seems like this Eagle Martial Dojo was fairly experienced in dealing with these Demonic Beasts.\u003c/p\u003e\n\u003cp\u003eWith regards to these matters, Lin Dong could provide little assistance. Therefore, he could only sit on the cart as he watched them work.\u003c/p\u003e\n\u003cp\u003e“Little brother Lin Dong, be careful tonight. If we can endure through the night, we will be fine.” After they finished preparing, Jiang Lei walked over and spoke with a smile.\u003c/p\u003e\n\u003cp\u003e“Yea.” Lin Dong gently smiled as he nodded his head.\u003c/p\u003e\n\u003cp\u003e“Also… Little brother Lin Dong, if possible, please take care of little Yinyin tonight.” Jiang Lei looked at Yinyin, who was standing beside Lin Dong, before he suddenly asked in sincerity.\u003c/p\u003e\n\u003cp\u003e“Old brother Jiang, don’t worry. Nothing will happen to her.” Lin Dong smiled.\u003c/p\u003e\n\u003cp\u003e“Thank you!” Jiang Lei softly heaved a sigh of relief, before he solemnly cupped his fist at Lin Dong. Even though he could sense that Lin Dong was no ordinary individual, he did not ask him to assist them. After all, he was keenly aware that right now, both of them did not have a deep relationship yet. Therefore, since they helped to guide Lin Dong, asking him to protect little Yinyin was already a fair deal.\u003c/p\u003e\n\u003cp\u003eUnder the tensed gazes of the crowd, nighttime finally quietly arrived. During the night, the visibility inside the Mist Forest dropped even further. Even with lit torches, their visibility was restricted to a certain radius.\u003c/p\u003e\n\u003cp\u003eThe crowds hurriedly ate some food to fill their bellies, before they went on alert. Sharp wooden spikes were set-up along the perimeter of the camp, while dozens of individuals sat in the center as they gripped onto their weapons. Contained within their eyes, were a tensed expression as well as a vicious one. After being attacked by these Demonic Beasts for so many days, they were evidently outraged as well.\u003c/p\u003e\n\u003cp\u003eThe entire campsite turned eerily silent and only the crackling sound from the fire-pit could be heard.\u003c/p\u003e\n\u003cp\u003eLin Dong was seated the in the middle of the crowd. Beside him, was little Yinyin and several injured members. He was the only one who remained calm amongst the crowd. After training by himself for half a year in the woods, he had encountered all sorts of dangerous situations. In fact, he nearly lost his life several times. Hence, he did not consider the current situation dangerous at all.\u003c/p\u003e\n\u003cp\u003eA thick mist shrouded the woodlands. Suddenly, a faint bloody smell stealthily emerged.\u003c/p\u003e\n\u003cp\u003e“They’ve come…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s palm gently patted Yinyin’s head, as he muttered to himself in a voice that was audible only to him.\u003c/p\u003e\n\u003cp\u003eSsha Ssha!\u003c/p\u003e\n\u003cp\u003eAfter he spoke, a rumbling sound suddenly echoed out inside the woods. Suddenly, pairs of somewhat bloody-red animal eyes appeared within the mist.\u003c/p\u003e\n\u003cp\u003e“Clang clang!”\u003c/p\u003e\n\u003cp\u003eWhen they saw that those fellow had indeed arrived, the faces of the Eagle Martial Dojo members turned ice-cold, as they slowly stood up. Meanwhile, the grips on their weapons slowly tightened.\u003c/p\u003e\n\u003cp\u003eAs time passed by, more and more Demonic Beast began to gather around. In approximately ten minutes, over a hundred had already gathered, and from the looks of it, it seems like their numbers were still increasing.\u003c/p\u003e\n\u003cp\u003eAs he stared at the numerous Demonic Beasts, a look of awe flashed across Lin Dong’s eyes. It seems like this so-called Leopard Alligator King had a fairly strong sway inside this Mist Forest.\u003c/p\u003e\n\u003cp\u003eBeside Lin Dong, when little Yinyin saw such a number of vicious Demonic Beasts, her tiny face turned slightly pale, as her hand tightly gripped onto Lin Dong’s shirt.\u003c/p\u003e\n\u003cp\u003e“Bang bang!”\u003c/p\u003e\n\u003cp\u003eNot long after these Demonic Beast emerged, the ground suddenly shook. Immediately, two extremely vicious aura emerged from the mist.\u003c/p\u003e\n\u003cp\u003e“Mist Leopard Alligator King!”\u003c/p\u003e\n\u003cp\u003eWhen they detected these two vicious auras, the faces of the Eagle Martial Dojo members finally turned pale. In fact, even Jiang Lei’s eyes began to darken a little.\u003c/p\u003e\n\u003cp\u003eTheir giant shadows became increasingly clear amidst the mist, before eventually, two large and hideous Demonic Beasts emerged under the glow of the torches.\u003c/p\u003e\n\u003cp\u003eAs they stared at the bloody and vicious eyes of these two Demonic Beasts, every Eagle Martial Dojo member’s heart began to jump violently. Standing in front, Jiang Xue’s beautiful figure also began to tremble a little.\u003c/p\u003e\n\u003cp\u003eThe biggest problem had indeed arrived in the end...\u003c/p\u003e\n\u003cp\u003e“Is this the Leopard Alligator King…”\u003c/p\u003e\n\u003cp\u003eLin Dong turned to look at that two vicious and hideous-looking Demonic Beasts, as his fingers gently rubbed his thighs. They did look a little savage...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-215\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-217\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-216","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
