{"id":61288,"no":1532,"title":"Chapter 221: Thrashing","content":"\u003cp\u003e\u003cstrong\u003eChapter 221: Thrashing\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Lin Dong!”\u003c/p\u003e\n\u003cp\u003eGazing at Lin Dong’s back, Jiang Xue was slightly taken aback as she held onto little Yinyin. She wanted to say something, but could only swallow the words in her mouth when she heard Lin Dong’s calm voice. After all, she understood that though this young man before her eyes seemed practically harmless, when he was angry, he would become extremely terrifying.\u003c/p\u003e\n\u003cp\u003e“Trying to be a hero?”\u003c/p\u003e\n\u003cp\u003eLuo Shan slightly leaned his head to one side, and stared maliciously at Lin Dong, who was slowly walking over. Promptly, he laughed and said: “Brat, you must be a newcomer at the Eagle Martial Dojo right? Previously, there was a perfect Yuan Dan stage practitioner from your dojo that tried to oppose us. However, in the end, I believe that unlucky fellow lost an arm?”\u003c/p\u003e\n\u003cp\u003e“Heh heh, it was all thanks to the generosity of young dojo master. Else, that fellow can give up on all thoughts of living.” Beside Luo Shan, a man, whose whole entire body gave off a strong Yuan Power vibration, smiled as he said.\u003c/p\u003e\n\u003cp\u003e“This time, cripple two of his arms. There is no need to take his life.” A slight smile emerged on Luo Shan’s face, and contained within the smile was a cruel glint.\u003c/p\u003e\n\u003cp\u003e“Yes!”\u003c/p\u003e\n\u003cp\u003eWhen they heard his command, the dozen or so subordinates at Luo Shan’s side immediately responded in a respectful tone. Soon after, they turned and stared maliciously at Lin Dong. This time, they had two perfect Yuan Dan stage practitioners, as well as several advanced Yuan Dan stage practitioners. With a lineup like this, they believed that they could easily cripple this ignorant brat before their eyes!\u003c/p\u003e\n\u003cp\u003eThis was evidently not the first time that these fellows had used their numbers to their advantage. Hence, they seemed exceptionally experienced as they slowly spread out and surrounded Lin Dong. At the same time, several varying Yuan Power gushed forth.\u003c/p\u003e\n\u003cp\u003eThis place was just outside the Great Eagle City bazaar, hence, the traffic in this area was quite high. Therefore, this event immediately attracted several onlookers, and several curious glances were directed towards Lin Dong. The Bloody Vulture Martial Dojo had a pretty terrible reputation in Great Eagle City, however, one could not dispute their strength. Previously, most people who dared to challenge them would not end up with a pleasant fate. Thus, most of them did not expect that today, a youngster who was barely twenty years old would actually have this kind of courage...\u003c/p\u003e\n\u003cp\u003eHowever, the outcome due to this courage would likely be an unfortunate one. An impulsive kid… that was what most people thought of Lin Dong right now...\u003c/p\u003e\n\u003cp\u003eLuo Shan did not seem to mind the surrounding crowd. They were used to acting in a flashy manner. Even though the Great Desolate Province was considered to be part of the Great Yan Empire’s territory, there were simply too many factions in this area, and even the prestigious name of the Great Yan Empire was greatly reduced in this area. Therefore, killing someone in the streets was hardly a noteworthy matter.\u003c/p\u003e\n\u003cp\u003eGently waving the fan in his hand while a gentle smile hung upon his face, Luo Shan somewhat gave off the aura of nobility. He lightly smiled as he turned to look at his subordinates, who were charging towards Lin Dong like a pack of evil wolves, while emitting vigorous Yuan Power, and the smile on his face grew even wider.\u003c/p\u003e\n\u003cp\u003eBang bang bang!\u003c/p\u003e\n\u003cp\u003eA low noise sounded out. Under the astonished gazes of the crowd, several sturdy-looking bodies were now bent like a shrimps, while pained expressions filled their faces, and they violently vomited mouthfuls of blood.\u003c/p\u003e\n\u003cp\u003eThe smile on his face turned a little stiff as Luo Shan stared at the calm man walking towards him step by step. Furthermore, every time the latter took a step forward, two of his subordinates would vomit blood before they fell to the ground. Immediately, his eyelids began to twitch.\u003c/p\u003e\n\u003cp\u003e“Kill him!”\u003c/p\u003e\n\u003cp\u003eIn less than a minute, only the two perfect Yuan Dan stage practitioners remained standing. However, the malicious expression on their faces had turned into a look of shock. Promptly, they glanced at each other, before they gritted their teeth and delivered an all-out punch.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s palm gently wrapped around the fists of the two perfect Yuan Dan stage practitioners. With a gently squeezed, the sounds of bones crunching instantly echoed out, next, wiithout blinking, he flung the two of them a dozen meters away like garbage. When they landed on the ground, they had already turned into two piles of dirt.\u003c/p\u003e\n\u003cp\u003eIn less than a minute, all the Bloody Vulture Martial Dojo members had become like the mud on the ground. Meanwhile, the surrounding crowds had turned much more silent. Right now, they finally understood that this young man… actually possessed such formidable strength.\u003c/p\u003e\n\u003cp\u003e“You are somewhat skilled. However, if you dare to touch me, the Bloody Vulture Martial Dojo will definitely hunt you down. If you turn around and walk away now, I can pretend that nothing had happened.”\u003c/p\u003e\n\u003cp\u003eLuo Shan stared at Lin Dong, who was right before him. Though the fan in his hand was now trembling a little, his voice remained somewhat firm. Of course, he was trying his best to remain cool. He had never expected that the two perfect Yuan Dan stage practitioners would be so easily dispatched by Lin Dong...\u003c/p\u003e\n\u003cp\u003eThe fact that he could accomplish such a feat made it very clear that the Lin Dong before his eyes should have already advanced to the Form Creation stage. This level was far from what an advanced Yuan Dan stage practitioner like him could match up against.\u003c/p\u003e\n\u003cp\u003e“So generous?” Lin Dong looked at Luo Shan, as a shocked expression mockingly emerged on his face.\u003c/p\u003e\n\u003cp\u003eLuo Shan naturally heard the sarcasm in Lin Dong’s voice. Immediately, a reluctant smile appeared on his face. Promptly, his eyes darkened before he suddenly opened his mouth. A hair like microscopic light beam swept forth and shot towards Lin Dong’s forehead.\u003c/p\u003e\n\u003cp\u003e“Ding!”\u003c/p\u003e\n\u003cp\u003eThe tiny light-beam was lightning quick as it struck Lin Dong’s forehead. However, it did not penetrate through as expected. Instead, it was deflected away as if it had hit solid bronze.\u003c/p\u003e\n\u003cp\u003eAfter his attack failed, Luo Shan’s felt a chill in his heart, as his figure hastily backed away. However, just as his body moved, an emotionless Lin Dong appeared in front of him like a ghost. As he raised his hand, a bronze-like glow faintly flashed.\u003c/p\u003e\n\u003cp\u003e“Smack!”\u003c/p\u003e\n\u003cp\u003eWith a tremendous amount of force, a palm viciously swung out, and under Luo Shan’s shocked gaze, the hand unceremoniously slapped his face.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThat force behind that blow was enough to destroy a mountain boulder. Hence, Luo Shan’s face immediately turned blood red, as all of the teeth in his mouth was shattered to dust, while fresh blood mixed with saliva was violently spat out. Moreover, under the shocked stares of the crowd, his body somersaulted several times in mid-air, before landing heavily on the ground, rolling dozens of times before finally coming to a stop.\u003c/p\u003e\n\u003cp\u003eAs they stared at that bloody and greenish-purple swelling face that was revealed when Luo Shan flipped over, the crowd’s faces began to twitch. Soon after, they turned to stare peculiarly at Lin Dong. That slap was truly vicious, though Luo Shan would at least keep his life, his face was probably ruined.\u003c/p\u003e\n\u003cp\u003e“However, isn’t this fellow afraid of retribution from the Bloody Vulture Martial Dojo…” Some people were now muttering to themselves in their heart. Luo Shan was the son of the Bloody Vulture Martial Dojo master. Once he found out that Luo Shan had been beaten up so badly, he would definitely not let Lin Dong off so easily.\u003c/p\u003e\n\u003cp\u003eJiang Xue’s lily-white hands covered little Yinyin’s eyes. She was similarly shocked by how vicious Lin Dong was. Even though she was pleased that this fellow, whom totally disgusted her, had been beaten into such a sorry state, she quickly thought of the following consequences… the troubles that would come from Bloody Vulture Martial Dojo...\u003c/p\u003e\n\u003cp\u003e“Forget it, since we are already at loggerheads with the Bloody Vulture Martial Dojo, I might as well take this opportunity to relieve my anger…” At this juncture, Jiang Xue had no choice but to console herself.\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eLin Dong closed and opened his palm a few times, before he turned and told Jiang Xue. He could tell that the latter was somewhat worried, however, he did not speak any further. Right now, even if the Bloody Vulture Martial Dojo truly possessed an advanced Form Creation stage practitioner, he had no reason to fear. After all, he should be able to handle an opponent at that level...\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eWhen she heard Lin Dong’s words, Jiang Xue nodded her head as she grabbed little Yinyin’s hand. The three of them turned and left free and at ease, leaving behind a bunch of half-dead fellows on the ground...\u003c/p\u003e\n\u003cp\u003e...\u003c/p\u003e\n\u003cp\u003eWhen they returned to the Eagle Martial Dojo, Lin Dong went back to his room, while Jiang Xue went to find Jiang Lei with a heavy matter in her heart.\u003c/p\u003e\n\u003cp\u003eIn the study room, Jiang Xue stared at Jiang Lei, who seemed to have aged overnight. Her eyes turned slightly red as she softly said: “Father, the Bloody Vulture Martial Dojo has issued a challenge to us?”\u003c/p\u003e\n\u003cp\u003e“Yes.” Jiang Lei sighed, before he continued: “In two day, I will duel Luo Ying at the martial arts arena. If I lose, take little Yinyin and leave Great Eagle City. As for the Eagle Martial Dojo, I am afraid that it won’t be able to survive.”\u003c/p\u003e\n\u003cp\u003eAs he spoke, Jiang Lei’s heart was evidently in turmoil. The Eagle Martial Dojo was the fruits of his labour over all these years. However, right now, it was crumbling at his hands.\u003c/p\u003e\n\u003cp\u003e“Father, it is said that Luo Ying has made a breakthrough to the advanced Form Creation stage. He will definitely kill you on the martial arts arena…” Teardrops were swirling in Jiang Xue’s eyes as she spoke.\u003c/p\u003e\n\u003cp\u003e“There is no way I can refuse this challenge. If I refuse, the Eagle Martial Dojo will have no way to continue on in Great Eagle City. Furthermore, even at that time, the Bloody Vulture Martial Dojo will still refuse to let us off…” Jiang Lei replied.\u003c/p\u003e\n\u003cp\u003e“But father is no match for Luo Ying!”\u003c/p\u003e\n\u003cp\u003eJiang Lei was silent, not knowing how to reply. In the past, he was at most evenly matched with Luo Ying. However, now that the latter had ranked up, the possibility of him being defeated was indeed much larger.\u003c/p\u003e\n\u003cp\u003e“Father, can we look for a helper?” Jiang Xue suddenly bit softly into her red lips as she softly asked.\u003c/p\u003e\n\u003cp\u003e“There is no one who can contend against Luo Ying in Great Eagle City.” Jiang Lei sighed.\u003c/p\u003e\n\u003cp\u003e“What about… Lin Dong?” Jiang Xue’s lily-white hands gently tightened, as she softly asked.\u003c/p\u003e\n\u003cp\u003e“Lin Dong…” When he heard her words, Jiang Lei was taken aback. Moments later, he finally shook his head and said: “Lin Dong’s strength indeed surpasses mine. However, I am not certain if he can match up against Luo Shan. Furthermore, we do not have a deep relationship with Lin Dong. It would be inappropriate for us to ask for such a favour. In fact, we may end up putting him in a difficult spot and invoke his displeasure.”\u003c/p\u003e\n\u003cp\u003e“Forget it, don’t worry about it. Father will handle everything. Go and rest first.” Jiang Lei waved his hand, as he tiredly spoke.\u003c/p\u003e\n\u003cp\u003eJiang Xue gently nodded her head, and slowly withdrew from the room. However, just as she shut the door, a determined glint flashed across her beautiful eyes.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-220\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-222\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-221","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
