{"id":61321,"no":1565,"title":"Chapter 254: Annihilation","content":"\u003cp\u003e\u003cstrong\u003eChapter 254: Annihilation\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Rumble rumble!”\u003c/p\u003e\n\u003cp\u003eSand waves swept forth before this sector of the woodlands nearly crumbled in an instant. As dirt filled the horizons, it seemed just like a raging sandstorm.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eAmidst that sandstorm, a deep echo, that caused one’s scalp to turn numb, swiftly followed. Soon after, a hideous figure flew out from within, before he directly ripped a near hundred meter long ditch on the ground.\u003c/p\u003e\n\u003cp\u003eWhile the sandstorm raged on, Lin Dong’s figure was still maintaining the same pose after he executed his punch. Meanwhile, drops of fresh blood continuously dripped off his fist before it dyed the ground below blood-red.\u003c/p\u003e\n\u003cp\u003e“Squeak.”\u003c/p\u003e\n\u003cp\u003eLin Dong kept this pose for a while, before he finally somewhat stiffly lifted his head and stared coldly at Hua Zong, who had been blown away by his punch. At the same time, his heart began to pound violently. This was the first time he had used that so-called Yuan Essence energy, and it’s terrifying destructive potential has filled his heart with awe.\u003c/p\u003e\n\u003cp\u003eIts destructive power was so strong that even a high ranked Soul Treasure could not defend against it!\u003c/p\u003e\n\u003cp\u003e“Squeak!”\u003c/p\u003e\n\u003cp\u003eJust as Lin Dong was in awe over the might of his Yuan Essence Energy, Hua Zong, whose body had crumpled at a distance away, began to vomit out mouthfuls of fresh blood. Promptly, his eyes were filled with shock as he turned to look at his Mysterious Earth Armour, only to see that right now, there was actually a solid punch mark left behind, while cracks began to slowly emerge from that mark.\u003c/p\u003e\n\u003cp\u003eEven though his Mysterious Earth Armour possessed a such strong defensive abilities, it was still nearly destroyed by one punch from Lin Dong!\u003c/p\u003e\n\u003cp\u003eThough his Mysterious Earth Armour was not completely shattered, a majority of the force behind Lin Dong’s punch still seeped in through the cracks and left Hua Zong severely injured.\u003c/p\u003e\n\u003cp\u003e“How is this possible?!”\u003c/p\u003e\n\u003cp\u003eAs he felt that intense pain originating from his chest area, Hua Zong involuntarily shouted out hideously. Even those elite practitioners from Great Devil Sect, who possessed extremely tough bodies, were unable to destroy a high-grade soul treasure with one punch alone. Hence, how could a mere Lin Dong accomplish it?\u003c/p\u003e\n\u003cp\u003eHowever, regardless of how Hua Zong complained, he could not alter the facts. Therefore, after he angrily grumbled, he quickly regained some of his senses. Then, as he stared at Lin Dong’s icy cold expression, his eyes glimmered before he slapped against the ground and swiftly retreated away using his Mental Energy.\u003c/p\u003e\n\u003cp\u003eRight now, since he had suffered such a severe injury and his Mysterious Earth Armour had been reduced to such a sorry state, if Lin Dong delivered a similar punch from before, this would probably be his final resting spot.\u003c/p\u003e\n\u003cp\u003e“Bastard, shit has gotten real this time. I never expected this kid to be so strong!”\u003c/p\u003e\n\u003cp\u003eAs he bitterly endured his injuries, Hua Zong’s figure swiftly retreated while he cursed angrily inside his heart. He had never expected that Lin Dong was actually this powerful. Even though he was only at initial Form Creation stage, he was nearly able to destroy the Mysterious Earth Armour, which had thwarted most advanced Form Creation stage practitioners.\u003c/p\u003e\n\u003cp\u003eAt this juncture, the only thing he could do was to retreat first. After all, there were several elite practitioners in Ghastly Puppet Cult. In fact, in the worst case scenario, he could ask his dad for help. Since he was at advanced Qi Creation stage, it would be a simple matter for him to kill Lin Dong.\u003c/p\u003e\n\u003cp\u003eWith this thought in mind, Hua Zong did not dare to linger any further. In fact, he did not even bother recalling his Symbol Puppet before he directly ran off.\u003c/p\u003e\n\u003cp\u003e“Since you decided to come, then don’t leave now!”\u003c/p\u003e\n\u003cp\u003eHowever, even though he wanted to leave, Lin Dong would not let him off so easily. Lin Dong was very clear of his personality and he knew that if he did not finish him off now, then he would definitely become a major threat in the future. Therefore, he could let him off if nothing happened between them, however, once he made his move, then he must be completely ruthless!\u003c/p\u003e\n\u003cp\u003eRight now, as he stared at Hua Zong, who was frantically running away, Lin Dong coldly snorted. Then, he stomped his foot against the ground before he transformed into a blurry figure and dashed forth. In a blink of an eye, he had caught up to that heavily wounded Hua Zong, whose speed had been severely reduced due to his injuries.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, my father is an elder of Ghastly Puppet Cult. If you dare to harm me, there will be nowhere to hide in this entire Great Desolate Province!” When he heard a formidable breaking wind sound coming from behind, Hua Zong’s facial expression changed drastically as he shouted.\u003c/p\u003e\n\u003cp\u003e“Fool!”\u003c/p\u003e\n\u003cp\u003eAs he faced Hua Zong’s shout, Lin Dong chuckled as he shook his head. Tightly clenching his fist, a golden glow emerged before he directly punched at Hua Zong’s head. Right now, Hua Zong, who had lost the protection of his Mysterious Earth Armour, was unable to withstand a single blow from him.\u003c/p\u003e\n\u003cp\u003eWith regards to his current situation, that Hua Zong was evidently aware of it. Instantly, his eyes turned blood red, before several greyish Mental Energy blade manically hacked at Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eAs he faced Hua Zong’s frantic counter attack, the bronze-green glint on Lin Dong’s skin turned increasingly dark. As he punched forth, golden Yuan Power gushed out and forcibly blew apart those Mental Energy blades. The strength behind his punch caused the surrounding air to explode, just like a highly pressured air cannon. Hence, before his fist arrived, that force wind had already viciously rained down on Hua Zong’s body.\u003c/p\u003e\n\u003cp\u003e“Squeak!”\u003c/p\u003e\n\u003cp\u003eWhen that formidable force wind gushed over, Hua Zong vomited another mouthful of fresh blood. Promptly, a maniacal glint flashed across his eyes, as he understood that Lin Dong was truly intent on killing him...\u003c/p\u003e\n\u003cp\u003e“It’s not going to be so easy to kill me!” Hua Zong roared like a wild beast. Then, waves of powerful Mental Energy gushed out before it directly transformed into a several meters tall greyish skull!\u003c/p\u003e\n\u003cp\u003e“Major Ghoul Techniques, Mental Corroding Skull!”\u003c/p\u003e\n\u003cp\u003eA formidable shout echoed out from Hua Zong’s thorat. Then, two balls of Mental Energy fire suddenly appeared in the hollow eyes of that greyish skull, that was forged from Mental Energy.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eWhen that Mental Energy fire appeared in the eyes of the greyish skull, a peculiar swooshing noise instantly sounded out from its mouth. Then, that skull opened its mouth, before a greyish swirl emerged from within, while a powerful suction force emerged!\u003c/p\u003e\n\u003cp\u003eThat suction force did not have much impact on physical objects. However, instantly, Lin Dong could feel that all the Mental Energy was being drained from his Niwan Palace and sucked into that skull.\u003c/p\u003e\n\u003cp\u003e“Donate to me all of your Mental Energy!”\u003c/p\u003e\n\u003cp\u003eHua Zong’s face was hideous as he desperately spat out a mouthful of essence blood. When that skull was covered with his blood, its suction force violently increased.\u003c/p\u003e\n\u003cp\u003e“These Ghastly Puppet Cult members are truly peculiar.” Lin Dong was taken aback by Hua Zong’s endless artifices. Promptly, a cold glint flashed across his eyes. Then, with a flick of his mind, the four Destiny Soul Symbols in his Niwan palace began to contort, before they instantly turned into four Destiny Swirls.\u003c/p\u003e\n\u003cp\u003e“How about you donate to me instead!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s large hands suddenly stretched out, before it grabbed onto that greyish skull. Then, a terrifying suction force violently emerged. Promptly, awe filled that Hua Zong’s face. That was because he realized that the Mental Energy inside that greyish skull was being rapidly sucked away by Lin Dong!\u003c/p\u003e\n\u003cp\u003e“You can actually directly consume Mental Energy?!” Hua Zong was shocked as he shouted out. Though their Ghastly Puppet Cult were able to perform the same peculiar feat, they could only accomplish it via various secretive ways. However, none of them were able to directly suck out one’s Mental Energy like Lin Dong. Furthermore, what shocked him the most was that after consuming other’s Mental Energy, Lin Dong did not suffer any backlash. Rather, the glow in his eyes grew increasingly resplendent.\u003c/p\u003e\n\u003cp\u003e“Break!”\u003c/p\u003e\n\u003cp\u003eThat greyish skull swiftly dimmed under Lin Dong’s maniacal suction force, before it was directly crushed by him. Promptly, his icy-cold eyes turned to look at Hua Zong.\u003c/p\u003e\n\u003cp\u003e“You devil!” Right now, Hua Zong’s face was completely filled with terror. The various abilities that Lin Dong possessed were completely out of this world.\u003c/p\u003e\n\u003cp\u003eLin Dong’s face was stone cold. After he swallowed that greyish skull forged from Mental Energy, he could clearly feel that the Mental Energy inside his Niwan palace had grown much stronger. Though it was slightly forceful and demonic to snatch away others’ Mental Energy, it was indeed a very effective move.\u003c/p\u003e\n\u003cp\u003e“Since you have decided to hunt after me, you should be prepared for this outcome…”\u003c/p\u003e\n\u003cp\u003eLin Dong gently smiled at Hua Zong. Then, his palm suddenly landed on the latter’s head before a suction force violently emerged and directly swallowed all of the latter’s Mental Energy inside his Niwan Palace.\u003c/p\u003e\n\u003cp\u003e“Bastard, the Ghastly Puppet Cult will hunt you down. Your outcome will be a hundred times worse than mine! Just wait and see! My father will torture you till you beg for your own death!” As he felt his Mental Energy swiftly dissipating, Hua Zong began to turn desperate, as he stared venomously at Lin Dong and cursed viciously.\u003c/p\u003e\n\u003cp\u003e“I will bear my own consequences!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were stone cold before he violently pressed against Hua Zong’s head. A stealthy force violently gushed out before it directly shattered the latter’s skull, and brought an end to this intense battle.\u003c/p\u003e\n\u003cp\u003eFresh blood gushed out from his head. Hua Zong’s face was frozen between hatred and fear while he slowly crumbled onto the ground. A major player in Great Puppet City had been completely annihilated right here...\u003c/p\u003e\n\u003cp\u003eAs Hua Zong’s aura dissipated, Lin Dong plopped down on the ground, before he stared at a distance away. At that area, Hua Zong’s Symbol Puppet had turned stiff as well after Hua Zong’s demise.\u003c/p\u003e\n\u003cp\u003e“Huff…”\u003c/p\u003e\n\u003cp\u003eLin Dong lowered his head as he violently panted. This intense battle had took quite a toll on him as that fellow simply had too many treasures with him. In the end, if he had not utilized Yuan Essence Energy to destroy his Mysterious Earth Armour, Lin Dong may not have been able to do much damage to him.\u003c/p\u003e\n\u003cp\u003e“Since you have killed this fellow, you should be in for quite a lot of trouble.” Little Marten suddenly appeared at this juncture, before it spoke.\u003c/p\u003e\n\u003cp\u003e“Even if I let him off, I would still be in trouble…” Lin Dong shook his head. This Hua Zong was a vengeful individual. Hence, if he let him off, he would definitely utilize his Ghastly Puppet Cult’s influence and hunt after him. Therefore, it would be best for him to finish him off now.\u003c/p\u003e\n\u003cp\u003e“However, this time, the rewards are quite substantial…”\u003c/p\u003e\n\u003cp\u003eLin Dong lifted his head as he stared at that motionless Symbol Puppet. Then, he forcefully ripped the Mysterious Earth Armour off Hua Zong’s body. Even though it was slightly damaged, once he fixed it, this high-grade Soul Treasure would be as good as new.\u003c/p\u003e\n\u003cp\u003eAfter he tore off that Mysterious Earth Armour, a black Qiankun bag that was hidden within landed into Lin Dong’s arms. As he stared at this gloomy looking Qiankun bag, a slightly smile emerged on Lin Dong’s face.\u003c/p\u003e\n\u003cp\u003eIt seems like this Hua Zong has delivered several sorely needed treasures to Lin Dong.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-253\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-255\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-254","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
