{"id":61325,"no":1569,"title":"Chapter 258: Caught","content":"\u003cp\u003e\u003cstrong\u003eChapter 258: Caught \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThere was a glittering glow on the calm surface of the lake. On top of a boulder in the middle of that lake, a figure that resembled a statue was seated there. He did not move an inch while his body temperature had even fallen to freezing point. Meanwhile, his breathing turn exceedingly faint.\u003c/p\u003e\n\u003cp\u003eHowever, Little Marten, who was now hovering in mid-air, knew that this was a critical breakthrough moment for Lin Dong. If he was able to replace the bronze-green hue on his skin with that warm jade-like glow, then Lin Dong would be able to successfully master Jade Thunder Body. At that time, his strength would surely surge.\u003c/p\u003e\n\u003cp\u003e“Hmm?”\u003c/p\u003e\n\u003cp\u003eIn the middle of that serene lake, Little Marten was constantly keeping close tabs on Lin Dong. However, suddenly its expression froze, before it quickly turned its head and turned to look towards a distance away. A dramatic change occurred in its eyes, as it sensed an exceedingly powerful aura that was dashing towards them from that direction.\u003c/p\u003e\n\u003cp\u003e“This aura… does not seem friendly!”\u003c/p\u003e\n\u003cp\u003eLittle Marten eyes glimmered, before his expression turned increasingly solemn as it clearly detected just how formidable that aura was. Judging from the current situation, it seems like the latter was evidently headed for them.\u003c/p\u003e\n\u003cp\u003e“They are indeed skilled. They actually managed to track us down so quickly.”\u003c/p\u003e\n\u003cp\u003eJust as Little Marten’s expression was in flux, Little Flame, who was hovering in mid-air, also managed to detect that powerful aura that was headed for them. Immediately, it released a tiger roar, before lightning sparks emerged and hovered around its body.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eUnder the undivided attention of one tiger and one marten, a glowing flash quickly emerged from the distant horizons, before it transformed into an elder dressed in grey robes, who was hovering on a large bone spear. That elder’s face was grim, while his eyes stared directly at the lake in the valley. Then, his words filled with a thick killing intent sounded out.\u003c/p\u003e\n\u003cp\u003e“Little Bastard, after you killed my son, do you think that you can escape?”\u003c/p\u003e\n\u003cp\u003e“Indeed…”\u003c/p\u003e\n\u003cp\u003eWhen it sensed the thick killing intent contained in the elder’s tone, Little Marten’s heart sunk. It had never expected that this old fellow could hunt them down so quickly. Furthermore, right now Lin Dong was at the most critical juncture in his training and he must not be disrupted.\u003c/p\u003e\n\u003cp\u003e“Growl!”\u003c/p\u003e\n\u003cp\u003eJust as Little Marten’s eyes glimmered,, Little Flame had already roared ferociously at that individual, which had disrupted Lin Dong’s training. As it opened its tiger mouth, a lightning ball emerged before it viciously flew towards that elder, who was hovering on a bone spear.\u003c/p\u003e\n\u003cp\u003eThat elder dressed in grey robes, was hovering on his giant bone spear. His old and wrinkled face stared coldly at that figure, who was seated in the middle of a lake. With regards to Little Flame’s attack, even before it reached his body, it was already deflected by a invisible shield.\u003c/p\u003e\n\u003cp\u003e“It seems like this little bastard is at a critical juncture in his cultivation. Oh well, that will save me some effort. Let me capture you first and hack off all your limbs, before I display your body in Great Puppet City for ten days!” That grey robed elder’s eyesight was sharp and venomous. He immediately detected that Lin Dong was currently unable to retaliate. Therefore, he immediately chuckled, before his hands stretched forth and transformed into a greyish giant Mental Energy hand and immediately swiped at Lin Dong’s head.\u003c/p\u003e\n\u003cp\u003e“Pfft!”\u003c/p\u003e\n\u003cp\u003eWhen he saw that grey robed elder make his move, Little Marten’s eyes turned cold before it coldly snorted. Immediately, it waves its claws before streaks of dark purple light flew forth and stuck itself onto that giant Mental Energy hand. Then, it\u0027s terrifying corrosive property instantly reduced that giant Mental Energy hand into nothing.\u003c/p\u003e\n\u003cp\u003e“Oh?” Little Marten’s move had evidently far exceeded that grey robed elders expectations, as he immediately exclaimed in shock. His eyes glanced callously at Little Marten, before his pupils suddenly shrunk: “Oh, it\u0027s actually a Demon Soul. Heh, judging from your abilities, you should have been extremely powerful when you had a physical body. Unfortunately, right now, you are nothing in front of me!”\u003c/p\u003e\n\u003cp\u003e“Get lost!”\u003c/p\u003e\n\u003cp\u003eAfter he shouted, greyish air current instantly erupted from the elder’s robes. These air currents were extremely cold and vicious. After they somersaulted in mid-air, they immediately swept viciously towards Little Marten just like a blizzard.\u003c/p\u003e\n\u003cp\u003eAs it faced that grey robed elder’s attack, Little Marten hurriedly waved its claws. Then, dark purple rings immediately emerged, before they turned into glowing halos and protected its body.\u003c/p\u003e\n\u003cp\u003e“Bang bang bang!”\u003c/p\u003e\n\u003cp\u003eThat greyish air current heavily slammed against the dark purple glowing halos around Little Marten’s body, before they released an earth-shattering noise. Meanwhile, Little Marten’s body was continuously blown back. Evidently, based on its current strength, it was unable to match up against Hua Gu, who was at advanced Qi Creation stage.\u003c/p\u003e\n\u003cp\u003e“Growl!”\u003c/p\u003e\n\u003cp\u003eWhile Little Marten was continuously pushed back by Hua Gu, Little Flame released an enraged roar. Lightning glow undulated around its body, before it directly flapped its lighting wings and charged towards Hua Gu.\u003c/p\u003e\n\u003cp\u003e“Get lost!”\u003c/p\u003e\n\u003cp\u003eHua Gu’s expression was venomous. Then, the greyish bone spear beneath his feet was just like a baseball bat, before it flew forth and viciously smacked Little Flame with a tremendous force.\u003c/p\u003e\n\u003cp\u003e“Growl!”\u003c/p\u003e\n\u003cp\u003eAfter it was viciously smacked by that bone spear, Little Flame’s body was immediately blown away as it released a series of pained squeals. Then, its massive body heavily slammed against a mountain boulder, before it blew that boulder apart.\u003c/p\u003e\n\u003cp\u003eThough it suffered a heavy blow, Little Flame’s eyes turned increasingly blood-red. A lightning glow sparkled while every hair on its body stood up. Then, it once again fearlessly charged towards Hua Gu.\u003c/p\u003e\n\u003cp\u003eBoom! Boom!\u003c/p\u003e\n\u003cp\u003eHowever, based on Little Flame’s current strength, it was naturally unable to match up against Hua Gu. Therefore, each time it charged forward, the final outcome remained the same as it continued to be coldly beaten up by Hua Gu. Right now, it seemed extremely hideous.\u003c/p\u003e\n\u003cp\u003e“You son of a bitch!” When it saw how Hua Gu was tormenting Little Flame, an intense rage unknowingly surfaced within Little Marten’s eyes. Promptly, it sucked in a deep breath, before it viciously pointed its claws. Then, it opened its mouth and spat out a large amount of dark purple light beams.\u003c/p\u003e\n\u003cp\u003eWhen these dark purple light beams emerged, they swiftly gathered together before they transformed into a glowing dark purple swirling blade. That swirling blade was filled with a powerful aura, that cannot be described with words alone. It seems like it was powerful enough to rip apart the heavens.\u003c/p\u003e\n\u003cp\u003e“Heaven Ripping Magic Wheel!”\u003c/p\u003e\n\u003cp\u003eWhen that glowing dark purple swirling blade appeared, Little Marten’s eyes slightly dimmed. Then, its claws pointed towards Hua Gu, who was hovering in mid-air. Promptly, the glowing blade trembled, before it disappeared in the next instance.\u003c/p\u003e\n\u003cp\u003eHowever, the instance that glowing dark purple swirling blade disappeared, Hua Gu, who was hovering in mid-air, began to feel a heart-palpitating sensation. His countless years of life and death battle experience evidently served a useful purpose. Immediately, he gripped his hand, before that giant bone spear immediately appeared in his hand. Then, mighty Yuan Power gushed forth just like a tidal wave. Instantly, bone shadows filled the horizons, before it directly transformed into bone walls and protected Hua Gu’s entire body.\u003c/p\u003e\n\u003cp\u003e“Heavenly Bone Wall!”\u003c/p\u003e\n\u003cp\u003eDense bone shadows, real or fake, surrounded Hua Gu’s entire body. It seems like instantly, the entire sky was being filled with white bone shadows.\u003c/p\u003e\n\u003cp\u003e“Clang clang clang!”\u003c/p\u003e\n\u003cp\u003eJust as these bone shadows formed, a dark purple glow suddenly emerged out from nowhere before it instantly blew apart countless bone shadows. Even though the bone shadow’s defensive ability was quite powerful, it seems like that glowing dark purple blade was the sharpest object in the world, as it directly ripped through the bone walls.\u003c/p\u003e\n\u003cp\u003e“Swosh!”\u003c/p\u003e\n\u003cp\u003eIn a blink of an eye, the bone shadows that filled the horizons had been thoroughly destroyed. As he stared at that dark purple glow that was growing rapidly in his eyes, a tinge of shock fleeted across Hua Gu’s face. Immediately, the Yuan Power inside his body unceremoniously erupted forth, before the glow on his bone spear turned increasingly resplendent. Finally, with a terrifying force, he slowly pointed it against that glowing dark purple swirling blade.\u003c/p\u003e\n\u003cp\u003e“Cling!”\u003c/p\u003e\n\u003cp\u003eA crisp sound echoed out in mid-air. Then, at the next instance, an exceedingly formidable energy shockwave erupted forth in mid-air!\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eDozens of water column directly erupted from the lake below, as they shot towards the heavens, before they finally crashed down. It was an exceedingly magnificent sight.\u003c/p\u003e\n\u003cp\u003e“What a pity…” Little Marten stared at Hua Gu, who had been forced to retreat several dozen steps by its attack, before it secretly sighed. At its peak, if it executed this attack, this entire mountain range would likely be split apart. However, right now, it could not even finish off a Qi creation stage old tortoise.\u003c/p\u003e\n\u003cp\u003eJust as Little Marten sighed, Hua Gu, who was hovering in mid-air, was completely shocked. He lowered his head to look at that tiger, before he turned to look at Little Marten, with an exceedingly solemn expression. For that previous attack, if he had reacted even a little slower, he would have likely died. It seems like that Demon Soul bastard was quite skilled.\u003c/p\u003e\n\u003cp\u003e“Judging from the fact that you have been dead for a while, you probably can’t execute such a powerful attack consecutively?” Hua Gu stared at Little Marten’s eyes, which had evidently dimmed, before a sinister laughter appeared on his wrinkled face.\u003c/p\u003e\n\u003cp\u003eLittle Marten eyes glimmered. Its previous attack was enough to kill an advanced Qi Creation stage practitioner. However, the toll that it took on its body was extremely heavy. Therefore, in a short period of time, it was indeed unable to use it again.\u003c/p\u003e\n\u003cp\u003e“If that’s the case, I shall kill you first!”\u003c/p\u003e\n\u003cp\u003eHua Gu laughed venomously. His hand gripped tightly onto his bone spear, while his face looked just like a devil. Then, he tapped his foot and palm against the skies, before his figure immediately dashed forth. That bone spear brought forth a terrifying chill, before a formidable hurricane formed at the tip of that spear. Finally, it lightning-quick flew towards Little Marten, that was located below. Based on the strength of his attack, it seems like Hua Gu was evidently wary of Little Marten.\u003c/p\u003e\n\u003cp\u003eWhen it saw that it had been targeted by Hua Gu, Little Marten expression changed. As it frantically waved its claws, dark purple light beams quickly gathered ahead of it and transformed into a dark purple glowing shield.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eThe instance that glowing shield formed, that bone spear arrived before a hurricane-like force swept forth. In an instance, that glowing shield immediately exploded.\u003c/p\u003e\n\u003cp\u003eWhen that glowing shield exploded, Little Marten’s body was thoroughly exposed to that bone spear!\u003c/p\u003e\n\u003cp\u003e“Growl!”\u003c/p\u003e\n\u003cp\u003eNearby, though Little Flame was heavily injured, when it saw that Little Marten was in danger, it immediately released an enraged roar. Then, it fluttered its lightning-wings as it tried to assist it.\u003c/p\u003e\n\u003cp\u003e“God damnit, I have yet to exact my revenge!”\u003c/p\u003e\n\u003cp\u003eAt this juncture, Little Marten seemed somewhat helpless. However, judging from the cold glint glimmering in its eyes, it had evidently not given up yet. Just as it was about to make its last stand, an eruption suddenly occurred at the lake below, before countless water columns shot towards the heavens.\u003c/p\u003e\n\u003cp\u003e“Ding!”\u003c/p\u003e\n\u003cp\u003eWhile those water columns shot towards the heavens, a resplendent golden glow that was as bright as sunlight erupted forth. Then, it flew forth at a speed, that was barely discernable to the naked eye, before it directly zipped past Little Marten and solidly rammed against that bone spear!\u003c/p\u003e\n\u003cp\u003eWhen it saw that ancient halberd whizz past, Little Marten heaved a deep sigh of relief. It’s eyes glanced to the side, before it faintly saw an extremely powerful energy shock wave emerging from a jade-like figure.\u003c/p\u003e\n\u003cp\u003e“Has that kid… finally succeeded…”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-257\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-259\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-258","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
