{"id":61357,"no":1601,"title":"Chapter 290 Inheriting Martial Arts","content":"\u003cp\u003e\u003cstrong\u003eChapter 290 Inheriting Martial Arts\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Great Desolate Imprisoning Heavenly Finger, tch tch, such a tyrannical name! Lin Dong, looks like you’ve found an awesome treasure this time.” As it stared at the huge finger which towered within the nothingness, astonishment surfaced in Little Marten’s eyes, before it chuckled and remarked.\u003c/p\u003e\n\u003cp\u003eLin Dong’s face was likewise filled with excitement. Although he did not know just how powerful this so-called ‘Great Desolate Imprisoning Heavenly Finger’ was, based on how mighty its appearance was, it was clearly not weaker than all the previous Manifestation Martial Arts he had seen.\u003c/p\u003e\n\u003cp\u003eLin Dong took two steps forward, as he stared fervently at that huge finger. Just as he was about to reach out with his Mental Energy to obtain the martial art cultivation method, he was stopped by a wave of Little Marten’s claw.\u003c/p\u003e\n\u003cp\u003e“Are you courting death? There are clearly quite a few remnant imprints on this huge finger. Given your current strength, just a tiny touch will likely blast you into bits.”\u003c/p\u003e\n\u003cp\u003eWhen he heard Little Marten’s words, Lin Dong was stunned. His eyes gazed at that huge finger and sure enough, he sensed that there seemed to be quite a number of imprints below the huge finger’s countless patterns. These imprints originated from ancient times, and though he did not know who they came from, at the very least, with Lin Dong’s power, he would definitely be unable to dispel them.\u003c/p\u003e\n\u003cp\u003e“Then what should we do?” Lin Dong furrowed his eyebrows. The feeling of being able to see it yet unable to touch it was really frustrating.\u003c/p\u003e\n\u003cp\u003e“This martial art is likely very renowned in ancient times, or else, it will not be so cautiously guarded. Even Nirvana stage practitioners will find dispelling these imprints especially troublesome.” Little Marten said.\u003c/p\u003e\n\u003cp\u003e“Troublesome to dispel even for Nirvana stage practitioners…” Lin Dong’s expression slightly changed. Wouldn’t this mean that he had no chance?\u003c/p\u003e\n\u003cp\u003e“Don’t worry, even though you don’t have Nirvana stage strength, you have the stone talisman.” As if it knew of Lin Dong’s worry, Little Marten let out a laugh before continuing: “You can borrow the stone talisman’s power and wash away the numerous imprints on the huge finger.”\u003c/p\u003e\n\u003cp\u003e“The stone talisman is this powerful?” Upon hearing this, Lin Dong was a little taken aback. The stone talisman was actually able to wipe away imprints that originated from ancient times?\u003c/p\u003e\n\u003cp\u003e“Heh, before the stone talisman, the manifestation ancient tablet is rubbish. If this thing was as useless as you thought, do you think that grandfather marten would become like this because of it?” Little Marten rolled its eyes and replied.\u003c/p\u003e\n\u003cp\u003eLin Dong spread out his hands and did not speak any further. With a thought, another milky white light slowly spread out from the center of his palm before finally curling around the huge pitch-black finger.\u003c/p\u003e\n\u003cp\u003e“Bang bang bang!”\u003c/p\u003e\n\u003cp\u003eAs the milky white light spread, a series of low explosions instantly sounded out from the huge pitch-black finger. The imprints that even Nirvana stage practitioners could do nothing about actually crumbled under the shine of the light.\u003c/p\u003e\n\u003cp\u003eIn a short few minutes, the imprints on the huge finger had completely dissipated. As the imprints faded, the huge finger slowly started to squirm. Black light gushed about before finally transforming into a somewhat illusionary ancient black book which quietly floated in mid-air.\u003c/p\u003e\n\u003cp\u003eAs he stared at the black martial art book, Lin Dong deeply inhaled. A thread of Mental Energy floated out, and slowly floated the former over. In the end, as if it was an incorporeal object, it directly penetrated Lin Dong’s forehead and entered his brain.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eWhen the illusionary book entered Lin Dong’s head, his body suddenly trembled as an overwhelming amount of information exploded in his mind. Move after move of extremely powerful martial art moves flickered like light as they flashed across his mind at an astonishing speed.\u003c/p\u003e\n\u003cp\u003eThis speed was so fast that even one’s thoughts could not keep up, but they gave Lin Dong the feeling of being deeply engraved into his mind. With a thought, they would appear extremely clearly!\u003c/p\u003e\n\u003cp\u003eAccompanying this martial art were numerous cultivation experiences related to this martial art. Evidently, the ancient sect practitioners had also passed on their understanding of this martial art to Lin Dong.\u003c/p\u003e\n\u003cp\u003eThis was martial arts inheritance!\u003c/p\u003e\n\u003cp\u003eWhat was passed on was not only the martial art, but at the same time, also various valuable martial art cultivation experiences. To Lin Dong, this was undoubtedly the true treasure!\u003c/p\u003e\n\u003cp\u003eLin Dong’s figure silently sat within the nothingness, while faintly discernable white light tunneled out from his palm, lingering around his body, appearing especially radiant within the dark nothingness.\u003c/p\u003e\n\u003cp\u003e......\u003c/p\u003e\n\u003cp\u003eOn the plaza surrounding the Manifestation Martial Tablet, countless gazes were unblinkingly fixed on the ten figures atop the stone platform. Ever since the light had appeared from the martial tablet, the figures on the stone platform had not moved for half an hour...\u003c/p\u003e\n\u003cp\u003eSome people were not unfamiliar to this situation. They knew that these ten people had already entered the Manifestation Martial Tablet to obtain a martial art. The only thing they did not know was what level the martial arts obtained this time would be.\u003c/p\u003e\n\u003cp\u003e“Buzz!”\u003c/p\u003e\n\u003cp\u003eWhile the crowd was waiting in anticipation, a sudden movement appeared on the stone platform. They watched as the practitioner from the ‘Green Wood Sect’ opened his eyes while eight light pillars abruptly erupted from the Manifestation Martial Tablet, before interweaving above the practitioner\u0027s head.\u003c/p\u003e\n\u003cp\u003e“Grade eight martial art!”\u003c/p\u003e\n\u003cp\u003eThe plaza erupted into an uproar as the crowd gazed at the eight interweaving light pillars while envy appeared many people’s eyes. Grade eight martial art. This was already considered as rather good.\u003c/p\u003e\n\u003cp\u003eWith regards to this, the ‘Greed Wood Sect’ practitioner was rather unsatisfied, but he could do nothing about it. He could only stand up and fly off the stone platform, returning to the Green Wood Sect area.\u003c/p\u003e\n\u003cp\u003eSoon after the ‘Green Wood Sect’ practitioner obtained a martial art, the ‘Bliss Valley’ practitioner also opened his eyes. Meanwhile, eight light pillars once again shot out from the Manifestation Martial Tablet. Evidently, this person had also obtained an upper category grade eight martial art.\u003c/p\u003e\n\u003cp\u003eThe following time had clearly reached the most eye-catching phase. Everyone’s gazes were concentrated on the eight figures on the stone platform, with all kinds of emotions in their eyes.\u003c/p\u003e\n\u003cp\u003e“Buzz buzz!”\u003c/p\u003e\n\u003cp\u003eUnder the crowd’s stares, in less than five minutes, Mu Qianqian, Wu Ci, and Teng Lei simultaneously opened their eyes. Immediately, the Manifestation Martial Tablet burst into light, transforming into nine light pillars which gathered in the air above the trio’s heads.\u003c/p\u003e\n\u003cp\u003e“Grade nine martial art!”\u003c/p\u003e\n\u003cp\u003eGasps sounded out in the plaza when they saw the nine light pillars. Clearly, they had never expected that three grade nine martial arts would appear all at once.\u003c/p\u003e\n\u003cp\u003eYet, just as their gasps sounded out, on the stone platform, Wang Yan, Huangpu Jing and Qin Shi also opened their eyes. Light flashed and also transformed into nine pillars of light.\u003c/p\u003e\n\u003cp\u003e“Six grade nine martial arts!”\u003c/p\u003e\n\u003cp\u003eAs they stared at the resplendent light pillars, envy appeared in the eyes of many people in the plaza. Even in factions like the great four clans, a grade nine martial art would be treated as top tier martial arts to be kept carefully. To think that six grade nine martial arts would actually appear in an instant, this number caused the onlookers heart to beat without end.\u003c/p\u003e\n\u003cp\u003e“It’s a pity that no Manifestation martial art has appeared yet!”\u003c/p\u003e\n\u003cp\u003e“What’s the rush, there are still two people. Lin Langtian is known as a genius that comes every hundred years in the Lin Clan, and his martial art talent is extremely shocking. It is very likely that he will obtain a Manifestation martial art.”\u003c/p\u003e\n\u003cp\u003e“*Chuckles*, Lin Dong also seems to be from a branch family of the Lin Clan. Compared to Lin Langtian, I wonder who will be the better one this time?”\u003c/p\u003e\n\u003cp\u003e“Although Lin Dong appears strong, when compared to someone like Lin Langitan, he is still rather lacking. I believe that he will at best obtain a grade nine martial art.”\u003c/p\u003e\n\u003cp\u003e“...”\u003c/p\u003e\n\u003cp\u003eAs the outcomes for Wang Yan and the rest were revealed, the gazes in the plaza swiftly turned to the remaining two figures on the stone platform. For a time, various whispers gushed forth like a tide.\u003c/p\u003e\n\u003cp\u003eCurrently, only Lin Langtian and Lin Dong remained on the stone platform. From a certain point of view, the two could be considered as members of the Lin Clan. Yet, one was a favored son of heaven, while the other was a lowly branch family member. From their statuses, the two were clearly not on the same level.\u003c/p\u003e\n\u003cp\u003eHence, many people were eager to find out the outcome between the two of them. Many of them were curious to find out who would emerge victorious in this unique battle.\u003c/p\u003e\n\u003cp\u003e“Seems interesting.”\u003c/p\u003e\n\u003cp\u003eOver at the Lin Clan faction, Lin Fan and the other Lin Clan elders straightened their backs, while their eyes glimmered as they stared at the stone arena. Among the younger generation Lin Clan members, Lin Langtian’s reputation definitely towered over the rest. In fact, many Lin Clan members believed that a talent like Lin Langtian would not emerge for at least twenty more years. This was indeed the belief held by Lin Fan and the rest before they met Lin Dong...\u003c/p\u003e\n\u003cp\u003eHowever, when they finally met Lin Dong and witnessed how he defeated Wang Yan, they understood in their hearts that perhaps there was someone who could match up to Lin Langtian among the Lin Clan younger generation members.\u003c/p\u003e\n\u003cp\u003eIn their opinion, Lin Dong was also a genius from the younger generation members. Even though there was still a gap between him and Lin Langtian, it was not an unbreachable one.\u003c/p\u003e\n\u003cp\u003eTwo geniuses, one was a elite main clan member, while the other was a lowly branch family member. They were about to have their first battle in front of this Manifestation Martial Tablet!\u003c/p\u003e\n\u003cp\u003eEven though this battle was pretty unique, it did not dampen the enthusiasm inside the crowd’s hearts. They were all eager to know who would emerge victorious in this battle!\u003c/p\u003e\n\u003cp\u003eA gentle breeze filled with an ancient smell swept across the arena. The originally chaotic arena had unknowingly quietened down. Pairs of eyes stared right at the two figures, who were seated frozen on top of the stone arena. Most of them didn’t even want to blink their eyes.\u003c/p\u003e\n\u003cp\u003eUnder the watchful crowd, a commotion finally emerged on the stone arena. Then, that slim and elegant figure began to slowly open his eyes.\u003c/p\u003e\n\u003cp\u003e“Buzz!”\u003c/p\u003e\n\u003cp\u003eThe instant Lin Langtian opened his eyes, the gigantic Manifestation Martial Tablet began to vibrate vigorously under the crowd’s watchful stares. Then, countless resplendent light columns manically gushed out that martial tablet before they filled the entire horizon!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-289\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-291\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-290","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
