{"id":61423,"no":1667,"title":"Chapter 356 All Cards Revealed","content":"\u003cp\u003e\u003cstrong\u003eChapter 356 All Cards Revealed\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe land seemed to shake at that very moment as all the Yuan Power in the area boiled madly. Shock registered on the faces of some experts who could feel the Yuan Power within their bodies churning vigorously. What martial art was this powerful?\u003c/p\u003e\n\u003cp\u003eJust from this extraordinary phenomenon alone, this martial art was clearly superior even to the Great Heavenly Phoenix Seal displayed by Lin Langtian. Many among the crowd could not help but suck in a breath of cold air. Who would have thought that such a horrifying card lay in the possession of Lin Dong - a member of a tiny branch family?\u003c/p\u003e\n\u003cp\u003eUpon the golden seats, the expressions on the elders’ faces changed drastically. From the seething of the heavens and earth, they discerned a scent of danger. That is to say that this stroke by Lin Dong posed a threat even to them!\u003c/p\u003e\n\u003cp\u003eRumble rumble!\u003c/p\u003e\n\u003cp\u003eYuan Power seethed, forming Yuan Power vortexes each several thousand feet wide in the air above Lin Dong. Looking from afar, the vortexes covered the skies, densely filling the air above the entire arena.\u003c/p\u003e\n\u003cp\u003eLin Dong’s body hovered high up in the air. His face was cold while thick killing intent flashing in his pupils. With the battle evolving to such intensity, he could no longer afford to withhold any cards. No matter what, he had to defeat this high and mighty chap today!\u003c/p\u003e\n\u003cp\u003eKilling intent flooded Lin Dong’s heart. His hand flipped and the Spirit Accumulation Praying Mat appeared in a flash. Lin Dong’s hands moved into seals and immediately, a majestic wave of Yuan Power came, roaring and gushed into the praying mat from the skies.\u003c/p\u003e\n\u003cp\u003eAs Yuan Power gushed into the mat, Lin Dong’s tyrannical mental energy zipped in as well.\u003c/p\u003e\n\u003cp\u003e“Buzz buzz!”\u003c/p\u003e\n\u003cp\u003eWith the sheer amount of Yuan Power and mental energy gushing into the praying mat, it began to tremble. A beam of light composed of Yuan essence energy shot out from it into the skies like a pillar. Inside that pillar of light was an undulation that horrified experts in the initial and even advanced Manifestation stage.\u003c/p\u003e\n\u003cp\u003e“Great Desolate Imprisoning Heavenly Finger, Imprisoning The World With One Finger!”\u003c/p\u003e\n\u003cp\u003e“Shredding Mountains And Rivers With Two Fingers!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s deep growl reverberated across the skies like peals of rumbling thunder. Immediately, the pillar of light was divided into two, forming two giant fingers!\u003c/p\u003e\n\u003cp\u003eUpon the giant fingers were extremely ancient lines, while an immensely ancient scent instantly permeated the horizon.\u003c/p\u003e\n\u003cp\u003eAll the Yuan Power in the area seethed and raged in an even greater frenzy in the presence of these two giant fingers formed purely of Yuan essence energy, which hung in the sky like a sword of damocles - apocalyptic strength ready to explode from within.\u003c/p\u003e\n\u003cp\u003e“What a terrifying martial art!”\u003c/p\u003e\n\u003cp\u003eCountless gazes fell upon the giant fingers of destruction - all were shocked beyond their wits. This martial art was absolutely more tyrannical and stronger than Lin Langtian’s Great Heavenly Phoenix Seal!\u003c/p\u003e\n\u003cp\u003e“Lin Langtian, I’ll show you today what a real Manifestation martial art is!” Lin Dong’s figure appeared before the two giant fingers, his sharp gaze falling on Lin Langtian from afar. Lin Dong’s arm shot forth with force, and immediately, heaven and earth shook. The two giant fingers penetrated the clouds as they shot towards Lin Langtian, carrying limitless destructive power.\u003c/p\u003e\n\u003cp\u003eBoom boom boom!\u003c/p\u003e\n\u003cp\u003eEven before the giant fingers reached him, Lin Langtian’s clothes fluttered loudly all around him in the face of their incoming force. Streams of energy wandered indefinitely all over the surface of his skin like worms.\u003c/p\u003e\n\u003cp\u003eHe stared straight at the giant fingers roaring towards him, red light sparkling in his pupils. His face was eerily cold. Taking in a deep breath, he replied with a thick voice, “Very well… Let’s see what’s so remarkable about your Manifestation martial art!”\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eAs his voice fell, Lin Langtian’s body shook forcefully. Torrents of Yuan Power surged forth and a oppressive power rapidly emanated from him. His right hand reached into the air before him as five streams of essence blood shot forth from his fingertips.\u003c/p\u003e\n\u003cp\u003eLin Langtian growled as the five streams of essence blood shot into the torrent of Yuan Power and was enveloped by it. The Yuan Power undulated madly. In that instant, a similarly ancient power undulated outwards.\u003c/p\u003e\n\u003cp\u003eTch tch!\u003c/p\u003e\n\u003cp\u003eThe torrent of Yuan Power squirmed before forming into a titanic palm under countless stares. The old yellow palm carried a hint of red within it and was covered with numerous ancient symbols. Faintly, the atmosphere of the arrival of a ruler descended upon the crowd.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eUnder such an atmosphere, the seething Yuan Power that had rushed to Lin Langtian turned still in that instant, as if it was subdued by the ancient palm.\u003c/p\u003e\n\u003cp\u003eOne could see that the Manifestation martial art obtained by Lin Lantian in the ancient tablet was fairly tyrannical as well!\u003c/p\u003e\n\u003cp\u003eThe ancient palm solidified and Lin Langtian’s expression turned solemn. Staring at the giant fingers roaring towards him, his palm shot forth forcefully as a deep roar resounded across the skies.\u003c/p\u003e\n\u003cp\u003e“Hand of the Universal Emperor, Master All Existence!”\u003c/p\u003e\n\u003cp\u003eUp in the sky, the titanic ancient palm quaked suddenly, before shooting towards the two giant fingers in a rage, tearing the skies in its wake.\u003c/p\u003e\n\u003cp\u003e“Bam!”\u003c/p\u003e\n\u003cp\u003eUnder countless alarmed stares, two spectacular Manifestation martial arts collided in the sky. The land trembled in that instant while waves of terrible Yuan Power storms radiated outwards in a frenzy.\u003c/p\u003e\n\u003cp\u003eIn the epicentre of that Yuan Power storm, two giant fingers and an ancient palm smashed together, both corroding each other incessantly. Yuan Power charged against Yuan Power, causing earthshaking explosions.\u003c/p\u003e\n\u003cp\u003eBoth martial arts seemed evenly matched at that moment!\u003c/p\u003e\n\u003cp\u003e“Hmph”\u003c/p\u003e\n\u003cp\u003eYet, before such a stalemate, Lin Dong snorted coldly. With a thought, the Yuandan within his body spinned rapidly, pouring forth thick Yuan Power and mental energy into the praying mat once again. Thereafter, an even more intense pillar of Yuan essence energy rushed towards the heavens from the praying mat!\u003c/p\u003e\n\u003cp\u003eLin Dong’s move attracted many alarmed gazes. Who would think that Lin Dong still possessed such abundant Yuan Power even after displaying a Manifestation martial art of such calibre!\u003c/p\u003e\n\u003cp\u003eLin Dong’s hand seals changed and the pillar of light began to wriggle in a frenzy. In the blink of an eye, it had condensed into an even more majestic and gigantic ancient finger. The undulations produced by this giant finger was of an entirely different level than the previous two!\u003c/p\u003e\n\u003cp\u003eWith the formation of the third finger, Lin Dong’s face turned visibly pale. A Manifestation martial art was naturally highly Yuan Power-consuming. Moreover, Lin Dong executed three fingers one after another, which was akin to him displaying a Manifestation martial art several times at one go. If it was anyone else, not even an Advanced Manifestation stage expert could afford such a consumption!\u003c/p\u003e\n\u003cp\u003eYet, while such consumption was enormous, the might of Lin Dong’s third finger was truly heaven shaking and earth shattering. He had not displayed this third finger even in his fight with Teng Sha previously - but he was forced to use it today.\u003c/p\u003e\n\u003cp\u003e“Great Desolate Imprisoning Heavenly Finger, Exterminating All Life With Three Fingers!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s finger pointed outwards in the air at a gradual and slow pace. That titanic ancient finger rent the skies like a meteorite cutting across the horizon, and barbarically smashed into the deadlocked Yuan Power storm below.\u003c/p\u003e\n\u003cp\u003e“Rumble rumble!”\u003c/p\u003e\n\u003cp\u003eThe whole earth trembled. The Yuan Power storm was ripped apart in that moment and Lin Langtian’s “Hand of the Universal Emperor” was blown to bits with great force!\u003c/p\u003e\n\u003cp\u003eWith the Hand of the Universal Emperor broken, a deep grunt came from Lin Langtian’s throat and his body shot several miles backwards under the gaping stares of many clan disciples.\u003c/p\u003e\n\u003cp\u003eThe stalemate was broken in a flash, with Lin Langtian falling into a disadvantageous position instantly!\u003c/p\u003e\n\u003cp\u003e“Let me see you receive this finger!”\u003c/p\u003e\n\u003cp\u003eYet the Lin Dong of this moment did not show any intention to stop. His eyes were cold as his finger pointed forward. The third finger flew forth once more from the Yuan Power storm, ripping the skies apart as it pressed lightning-quick towards Lin Langtian!\u003c/p\u003e\n\u003cp\u003e“Boom boom!”\u003c/p\u003e\n\u003cp\u003eWith the shooting forth of the third finger, all Yuan Power surrounding Lin Langtian froze in place, trapping him within!\u003c/p\u003e\n\u003cp\u003eWatching the entrapped Lin Langtian, many spectators rose involuntarily, tension gripping their hearts. If Lin Langtian was unable to dodge this move, he would definitely be defeated with severe injuries!\u003c/p\u003e\n\u003cp\u003eUnder countless stares, Lin Langtian’s face turned dark, his palms quivering. He had not expected the situation to take such a turn.\u003c/p\u003e\n\u003cp\u003e“A mere ant having delusions of defeating me, dream on!”\u003c/p\u003e\n\u003cp\u003eA shocking Yuan Power undulation rippled towards Lin Langtian. However, his eyes flashed with deviousness and his hands formed new hand seals rapidly. His mouth opened wide and a ray of blinding light spewed forth from it.\u003c/p\u003e\n\u003cp\u003eThe ray of light expanded in the air before turning into a giant black hexagonal mirror. On that mirror, mysterious light rippled across the surface and a unique and formidable undulation rippled outwards from it.\u003c/p\u003e\n\u003cp\u003e“That’s… an Earthly Soul Treasure?!”\u003c/p\u003e\n\u003cp\u003eAt the sudden appearance of the black hexagonal mirror, the great arena exploded with shouts of shock as countless greedy stares fell on it. That undulation far surpassed that of the high grade soul treasure by a thousand times. Such an undulation was possessed only by an Earthly Soul Treasure!\u003c/p\u003e\n\u003cp\u003eNone expected that Lin Langtian actually possessed such a rare treasure!\u003c/p\u003e\n\u003cp\u003eAt that very same moment, the elders upon the golden seats looked on with shock. They were alarmed, however, not at that Lin Langtian possessed an Earthly Soul Treasure, but rather that Lin Dong had pressed Lin Langtian into such a corner...\u003c/p\u003e\n\u003cp\u003eAt the very least, they were clear that among those that were present, apart from the Grand Elder and a handful of others, none had that ability. That was to say that Lin Dong’s strength had very possibly already surpassed theirs!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-355\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-357\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-356","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
