{"id":61465,"no":1709,"title":"Chapter 398 Entering The Ancient Battlefield!","content":"\u003cp\u003e\u003cstrong\u003eChapter 398 Entering The Ancient Battlefield!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eFor the next five days, Lin Dong stayed in his room and he did not come out at all. Since he had just completed refining the Heavenly Crocodile Bone Spear, he had to refine it for a period of time. This would allow him to bring out the weapon’s formidable power fluidly during a battle.\u003c/p\u003e\n\u003cp\u003eDuring these five days, Lin Langtian indeed did not tell Lin Fan about the incident in the Sacred Spirit Pool. After all, there was nothing about this issue that he was proud of. Furthermore, there was a mysterious Yuan Spirit residing in his body too, hence, he was not really that innocent as well. Therefore, he would not be so stupid to use this incident to stir trouble for Lin Dong.\u003c/p\u003e\n\u003cp\u003eThus, these five days passed peacefully in the blink of an eye.\u003c/p\u003e\n\u003cp\u003eOn the fifth day, as dawn cracked through the sky, Lin Dong, whose his eyes had been shut tightly, opened them up gradually. Deep within his eyes, there was a strong surge of solemnity and hope.\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eLin Dong muttered to himself. Without further hesitation, he stood up and pushed open the door and left the room. As he stepped out of his room, he could feel that the courtyard’s atmosphere was tensing up. He walked out of the courtyard in quickly before he saw Lin Fan and his counterparts, who had been waiting for a long time, at the front yard.\u003c/p\u003e\n\u003cp\u003eThere was a solemn look on the faces of the Lin Clan’s elites waiting in the front yard. Everyone knew that today is the day that Lin Dong and Lin Langtian will enter the Ancient Battlefield. These two men’s achievements in the Ancient Battlefield would determine Lin Clan’s future...\u003c/p\u003e\n\u003cp\u003e“Go!”\u003c/p\u003e\n\u003cp\u003eAfter his gaze lingered on Lin Dong and Lin Langtian for quite a while, Lin Fan then let out a deep breath. With a wave of his palm, he turned around without hesitation and led the entourage directly to the Imperial Palace!\u003c/p\u003e\n\u003cp\u003e...\u003c/p\u003e\n\u003cp\u003eIn the inner sanctum of the Imperial Palace, there was a huge towering mountain. The mountain’s peak reached a height of several thousand metres and pierce right through the clouds. In the Great Yan Empire, this mountain was called the Sacred War Peak. It was considered a forbidden area as it contained the passageway to the Ancient Battlefield.\u003c/p\u003e\n\u003cp\u003eAt this moment, there was an entourage waiting silently on the peak of the mountain. These people were the members of the Imperial Family - Mo Jingtian, Mo Ling and their counterparts. Apparently, they were the first ones to reach this place.\u003c/p\u003e\n\u003cp\u003eNot far away from Mo Jingtian and his counterparts, there was a huge stone formation. Numerous magical symbols were being carved onto these huge stones. Waves of terrifying energy emitted continuously from these symbols and this caused the surrounding Yuan Power to seethe.\u003c/p\u003e\n\u003cp\u003eMo Jingtian stared silently at the ancient stone formation with his chest slightly raised. This let everyone knows that his state of mind was not as calm as it seemed on the surface.\u003c/p\u003e\n\u003cp\u003e“Ling-er, I’m afraid various fighters have already gathered at the Ancient Battlefield now. You have to be extremely careful when you enter the battlefield. The Great Yan Empire is not considered as a powerful empire in the East Xuan Region. All the geniuses from the other empires are valiant individuals. Hence, you should try your best to keep a low profile before successfully attaining the Nirvana Stage. You can protect yourself only if you have attained the Nirvana Stage. Otherwise, you are just a stepping stone for others!” Mo Jingtian said in a deep tone while waiting for the other entourages to arrive.\u003c/p\u003e\n\u003cp\u003e“Yes!” Mo Ling nodded his head slightly after he heard Mo Jingtian’s words.\u003c/p\u003e\n\u003cp\u003e“In addition, when you are in the Ancient Battlefield, try your best to maintain a good relationship with Lin Clan’s Lin Dong. That lad is not a simple individual. I have done some research on him. Three years ago, he had a brush with Lin Langtian. At that time, he couldn’t even withstand Lin Langtian’s aura. However, within a short period of two years’ time, like what you had said, he was able to subdue Lin Langtian to such extent in the Sacred Spirit Pool,” Mo Jingtian said slowly.\u003c/p\u003e\n\u003cp\u003e“This lad’s strength appear to be of only Initial Manifestation Stage and he can be considered the weakest link among the five of you. However, his fighting capabilities and numerous tricks are able to make up for this deficiency and even help him to surpass all of you. For some reasons, I feel that the moves he have displayed so far are not his best moves.”\u003c/p\u003e\n\u003cp\u003eUpon hearing these words, Mo Ling was slightly alarmed. Apparently, he had never expected Mo Jingtian to think so highly of Lin Dong.\u003c/p\u003e\n\u003cp\u003e“It’s better not to become enemies with this kind of people. It will be much more beneficial for you if you are to become his friend,” Mo Jingtian warned after a moment of silence.\u003c/p\u003e\n\u003cp\u003eMo Ling nodded his head once again. All along, he had no intentions of becoming enemies with Lin Dong. Even though the latter was a member of branch family, Mo Ling did not really care about it. After all, heroes could be from anywhere. What Mo Ling cared about the most was Lin Dong’s capabilities, not his background. In the Ancient Battlefield, no matter what your background is, you still have to experience numerous massacres amongst the chaos. What really matters there is strength, not background...\u003c/p\u003e\n\u003cp\u003e“However, there are deep grudges between Lin Dong and Lin Langtian. In the Great Yan Empire, with the presence of Lin Fan, everything is still okay. But once they enter the Ancient Battlefield, they may break out into a fight. When that moment comes…” Mo Ling suddenly said.\u003c/p\u003e\n\u003cp\u003eThis kind of issue proved to be a headache for them. That was because no matter which side you helped, the other side would be offended. However, if you helped neither sides and maintained a neutral position, you would not be able to develop a strong relationship with either sides.\u003c/p\u003e\n\u003cp\u003eIf it really came down to a life or death battle between Lin Dong and Lin Langtian, Mo Ling would choose to help Lin Dong. And because of this, he would definitely obtain Lin Dong’s true friendship, but at the same time, he would offend Lin Langtian...\u003c/p\u003e\n\u003cp\u003eUpon hearing Mo Ling’s words, Mo Jingtian furrowed his brows. After a moment, he then looked at Mo Ling and slowly said two words, “Lin Dong.”\u003c/p\u003e\n\u003cp\u003eMo Ling’s heart shivered slightly. He knew that, between the two geniuses of the Lin Clan, Mo Jingtian ultimately still felt that Lin Dong would surpass Lin Langtian...\u003c/p\u003e\n\u003cp\u003e“Got it,” Mo Ling nodded his head slightly. Honestly speaking, he was not surprised with Mo Jingtian’s decision. In terms of innate talents, Lin Dong did not lose out to Lin Langtian. More importantly, Lin Dong did not need to depend on any factions’ support. Even though he used to be an ant, he was able to climb step by step to his current position in the Great Yan Empire. Conversely, Lin Langtian had massive support from the Lin Clan’s resources. The difference between these two individuals was obvious.\u003c/p\u003e\n\u003cp\u003eAfter all, resources might be important, but without an unyielding tenacity, there was no way one could become a true elite!\u003c/p\u003e\n\u003cp\u003e“They have arrived…” A smile appeared on Mo Jingtian’s face as his gaze shifted to a particular mountain road.\u003c/p\u003e\n\u003cp\u003eJust as Mo Jingtian finished his sentence, a deafening sound resounded from the mountain road. Several silhouettes appeared on the mountain peak with a lightning speed. They were the entourages from the Lin Clan and Heavenly Luo Sect.\u003c/p\u003e\n\u003cp\u003eLin Dong was standing behind Lin Fan. As the former stopped in his tracks, his gaze shifted to the huge stone formation which was not too far away. His eyes then surged with intense astonishment. Even ordinary Nirvana Stage practitioners could not have set up such a powerful formation...\u003c/p\u003e\n\u003cp\u003e“When the Great Yan Empire was just established, we spent a huge amount of money to invite an elite from a super sect to build this teleporting formation to the Ancient Battlefield. There are countless empires in the East Xuan Region and many small empires do not have the qualification and ability to possess such a teleporting formation. As such, these small empires can only borrow other empires’ teleporting formations, which is kind of disgraceful…” Lin Fan explained to Lin Dong.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded his head. It appeared that this teleporting formation was like an qualification test. If an empire did not even have a teleporting formation, there was no reason for it to enter the Hundred Empire War. Even if it did attend the war, it would be just throwing its participants’ lives away.\u003c/p\u003e\n\u003cp\u003e“Everyone, the Ancient Battlefield is an land that have existed since ancient times. Now, it has been used as an arena for the Hundred Empire War by those super sects. There are countless treasures and even ancient inheritances hidden in that piece of land. However, it also depends one’s affinity as to whether he or she can obtain these treasures. Of course, these treasures will be frought with dangers as well.”\u003c/p\u003e\n\u003cp\u003eMo Jingtian’s gaze then swept across everyone and landed lastly on Lin Dong. The former then spoke in a deep tone, “ This period of time, I guess all of you understand the Hundred Empire War’s degree of cruelty. Hence, I shall not repeat myself. In short, no matter which clans you are representing, you better curb your attitudes after you entered the Ancient Battlefield. In the Great Yan Empire, you are considered exceptional talents. However, once you are inside… each of you is just an ordinary individual. Let me tell all of you, if you are arrogant and despotic inside the Ancient Battlefield, your corpse might not even make it back here!”\u003c/p\u003e\n\u003cp\u003eLin Dong nodded his head in silence. Other than dealing with Lin Langtian and those members of the Lin Clan who despised him, Lin Dong usually would not put up an insolent front. Therefore, he would not enter the Ancient Battlefield with such an attitude.\u003c/p\u003e\n\u003cp\u003e“Next, we will activate the formation. I guess everyone knows about the rules. To activate the formation, fifty thousand Nirvana pills will be needed. This time around, since there are two participants from the Lin Clan this time around, the Lin Clan will have to provide twenty thousand Nirvana pills…” Mo Jingtian explained while looking at Lin Fan and his counterparts.\u003c/p\u003e\n\u003cp\u003e“Fifty thousand Nirvana pills?” Upon hearing this, Lin Dong’s face cramped and looked unbelievably at the huge formation. It was hard for him to believe that such a terrifying amount of Nirvana pills was needed to activate the formation.\u003c/p\u003e\n\u003cp\u003eLin Fan and his counterparts were not surprised at this rule. However, Lin Dong could see that Lin Fan’s face was squirming with pain. Twenty thousand Nirvana pills were not a small amount to the Lin Clan...\u003c/p\u003e\n\u003cp\u003e“Sigh, Lin Dong, Lin Langtian, Lin Clan’s future will depend on your accomplishments in the Ancient Battlefield…” Lin Fan sighed. Then, with a swipe of his palm, a Qiankun bag flew towards Mo Jingtian.\u003c/p\u003e\n\u003cp\u003eAt the other side, Heavenly Luo Sect and Barbarian King Sect had each thrown a Qiankun bag too. It seemed that they had long prepared the Nirvana pills.\u003c/p\u003e\n\u003cp\u003eAs Mo Jingtian took the Qiankun bags, he took a sweeping glance and nodded his head slightly. With a snap of his finger, numerous Nirvana pills, accompanied by vigorous energy, whizzed towards the centre of the huge stone formation...\u003c/p\u003e\n\u003cp\u003e“Buzz! Buzz!”\u003c/p\u003e\n\u003cp\u003eAs the huge amount of Nirvana pills flew in, the gigantic stone formation began to tremble. The symbols on the formation started to give off resplendent radiance. Then, a light pillar began to form in the centre of the formation.\u003c/p\u003e\n\u003cp\u003e“Mo Ling, Lin Dong and the three of you, faster enter the formation!” Mo Jingtian yelled as he saw the light pillar augmented.\u003c/p\u003e\n\u003cp\u003e“Yes!”\u003c/p\u003e\n\u003cp\u003eThe five persons answered in the same time. Without further ado, and under the nervous gazes of Lin Fan and his counterparts, they became five silhouettes and flew directly into the light pillar.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eAs the five of them entered the light pillar, a bright lustre erupted like a brilliant sun from the pillar. After a long period of time, it began to fade slowly.\u003c/p\u003e\n\u003cp\u003eAs the light pillar faded, the five silhouettes had already disappeared...\u003c/p\u003e\n\u003cp\u003e“Whatever accomplishments you attain in that land will have to depend on your individual capabilities…” Mo Jingtian, Lin Fan and their counterparts muttered as they looked at the empty stone formation.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-397\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-399\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-398","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
