{"id":61517,"no":1761,"title":"Chapter 450 Lady Dressed In Red","content":"\u003cp\u003e\u003cstrong\u003eChapter 450 Lady Dressed In Red\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAlthough the bundle of light’s appearance was very sudden, there was no one in the place who did not have keen senses. Thus, the instant the light bundle appeared, numerous gazes immediately swept over, before everyone’s pupils abruptly shrunk.\u003c/p\u003e\n\u003cp\u003eThe bundle of light squirmed. Within it, an exquisite mysterious key was faintly discernable. A unique undulation spread outwards, causing one’s heart to tremble.\u003c/p\u003e\n\u003cp\u003eMysterious Ancient Key!\u003c/p\u003e\n\u003cp\u003eA spark flashed in everyone’s minds. In the next moment, practically everyone suddenly rushed forth and ferociously grabbed at the light bundle, ignoring the relentlessly chasing Nirvana Nest Stone Statues.\u003c/p\u003e\n\u003cp\u003eUpon seeing this, Lin Dong coldly chuckled. He was the one who had solved the puzzle, how could he let these fellows enjoy the final reward?\u003c/p\u003e\n\u003cp\u003ePreviously, when that soft noise rang out, Lin Dong had already swiftly dashed forward. He was the person nearest to the light bundle, hence, he was naturally the first to grab it.\u003c/p\u003e\n\u003cp\u003e“Kid, you plan on dying?”\u003c/p\u003e\n\u003cp\u003eWhen the fastest person, Chen Mu, saw the light bundle that was just about to be his snatched away by Lin Dong, a vicious look immediately surfaced on his stern face as he shouted.\u003c/p\u003e\n\u003cp\u003eFrom his point of view, Lin Dong was practically not even worth talking about. If the latter did not possess a Soul Puppet, Chen Mu would have taken action long ago and directly shred Lin Dong into pieces. However, Chen Mu never imagined that after Lin Dong offended their Devil Cliff Empire, not only did he not flee for his life, he instead still dared to snatch away food from the jaws of a tiger. His actions undoubtedly totally pissed off Mu Chen.\u003c/p\u003e\n\u003cp\u003eHowever, his vicious threat clearly had no effect on Lin Dong. If he was truly afraid of the Devil Cliff Empire, he would not fight over the Heaven Symbol Spirit Tree. Since there was already enmity between them, why would it matter if he deepened it a little?\u003c/p\u003e\n\u003cp\u003eThus, the corners of Lin Dong’s curled in response to Chen Mu’s shout as he firmly grabbed the light bundle.\u003c/p\u003e\n\u003cp\u003eCh!\u003c/p\u003e\n\u003cp\u003eThe instant Lin Dong’s hand touched the light bundle, it abruptly shivered before a formidable energy exploded, directly blowing away Chen Mu and the rest who were about to arrive. In contrast, Lin Dong did not feel any impact at all.\u003c/p\u003e\n\u003cp\u003eA pillar of light extended from the light bundle, quickly enveloping Lin Dong. In the next moment, Lin Dong’s figure had strangely disappeared under Chen Mu and the rest’s alarmed and furious gazes.\u003c/p\u003e\n\u003cp\u003eBuzz buzz.\u003c/p\u003e\n\u003cp\u003eAs Lin Dong’s figure disappeared, the light pillar started to shrink at a speed which can be seen with the naked eye. Upon seeing this, Chen Mu and the rest’s expressions immediately changed as they abruptly raised their speed to the limit, intent on charging into the pillar of light.\u003c/p\u003e\n\u003cp\u003eInside the large hall, countless splitting wind noises echoed out, as several figures dashed towards that shrinking light pillar. However, the rate at which the pillar shrunk accelerated and it seemed like the crowds were not going to be fast enough.\u003c/p\u003e\n\u003cp\u003eSwish!\u003c/p\u003e\n\u003cp\u003eUnder the stares of the crowd, just as that light pillar was about to disappear, a beautiful phantom-like figure suddenly shot out from within the crowd, before it headed into the light pillar and disappeared.\u003c/p\u003e\n\u003cp\u003eAfter that mysterious beautiful figure leapt into that light pillar, that light pillar finally vanished completely. Following which, Chen Mu and the rest, who were dashing over were all left empty-handed, as they stared at that empty large hall, before their expression turned grim.\u003c/p\u003e\n\u003cp\u003eHua Yun and the rest had a slightly ugly expression on their face. However, it was not as twisted as Chen Mu as they only glanced in disappointment at this sight. Evidently, this light pillar must have transported Lin Dong and that beautiful mysterious figure to the Mysterious Ancient Key location. Since they had just advanced to Nirvana stage, they knew that it was impossible for them to track them down. Therefore, this trip ended up as a failure.\u003c/p\u003e\n\u003cp\u003e“I am going to wait right here. I don’t believe that you won’t show up again!”\u003c/p\u003e\n\u003cp\u003eChen Mu’s eyes were blood-red and he looked just like a desperate gambler that had lost. His face was twisted while his words were filled with potent killing intent, and it caused one’s hair to stand.\u003c/p\u003e\n\u003cp\u003eThe instant his body disappeared, Lin Dong felt a dizzy sensation emerged from deep within his brain. At the same time, his eyes blacked out.Though this sudden development took him by surprise, it did not last for a long while, before the darkness in front of his eyes were shattered and replaced by the dim glow of light.\u003c/p\u003e\n\u003cp\u003eThere was an extremely vast arena right in front of Lin Dong. That arena was forged from black granite rocks and it gave off an ancient yet sturdy sensation. However, Lin Dong’s attention was not wavered by this surroundings. Instead, he focused right on the central spot of that arena. At that spot, he saw a figure seated down.\u003c/p\u003e\n\u003cp\u003eThe sudden appearance of another person caused Lin Dong to tense up. However, he promptly realize that there was no trace of life in that figure. Evidently, it was only a corpse.\u003c/p\u003e\n\u003cp\u003eLin Dong’s figure flashed before he appeared in front of that corpse. After he quickly took a glance at it, he was promptly shocked to realize that corpse was still completely intact. If it were not for the fact that there were no traces of life within, anyone would have mistaken it for a live human. Nonetheless, this was not what shocked Lin Dong the most. Instead, he found out that the corpse’s appearance was actually identical to the stone statues in that large hall.\u003c/p\u003e\n\u003cp\u003e“This man must be the owner of the stone hall.” Lin Dong’s eyes glimmered, before he looked down. Then, he saw that there was actually an old yellow key in that corpse’s palms. That key could be held by two palms and it looked like it was made from a rather unique material. It looked like wood, yet it was not wood. At the same time, there were several peculiar tattoos inscribed on it. Faintly, a heart palpitating sensation emerged from it.\u003c/p\u003e\n\u003cp\u003e“Mysterious Ancient Key!”\u003c/p\u003e\n\u003cp\u003eWhen Lin Dong saw that ancient wooden key, his eyes lit up immediately. Even though he had already seen a strange key in that stone hall previously, when this key appeared, he immediately knew that he had seen the real deal.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were burning red. This time around, he did not hesitate at all as he directly reached for that mysterious ancient key.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eHowever, the instant Lin Dong stretched out his arm, a powerful shock wind emerged from behind him. This sudden development caused Lin Dong to be shocked. However, he promptly jerked his hand, before a red glow shot out from within his palm and transformed into a sturdy figure before it shielded his back.\u003c/p\u003e\n\u003cp\u003eClang!\u003c/p\u003e\n\u003cp\u003eA crisp sound echoed out, while an alarming shockwind swept forth and it actually caused Lin Dong to retreat several steps. Finally, he lifted his head up solemnly and glanced towards the distance. Immediately, his expression froze.\u003c/p\u003e\n\u003cp\u003eThat was because the person he saw was not Chen Mu, Hua Yun or the rest like he had expected. Instead, it was a lady dressed in a red skirt.\u003c/p\u003e\n\u003cp\u003eThat lady had a slim and alluring figure and she looked extremely elegant. Her overflowing ink-like black hair and her beautiful face that looked just like a cherry blossom gave off a seductive tinge. Together with her beautiful and alluring eyes, she caused one’s heart to flutter.\u003c/p\u003e\n\u003cp\u003eThis was the first time Lin Dong saw such a beautiful lady at the ancient battlefield.\u003c/p\u003e\n\u003cp\u003e“Haha, this little brother, this sister is also after the mysterious ancient key. How about you let me have it?” That lady dressed in red smiled as she looked at Lin Dong. Her voice was extremely playful and seductive. Therefore, even though her request was completely outlandish, it was difficult for anyone to be angry at her.\u003c/p\u003e\n\u003cp\u003eWhen he heard her words, Lin Dong released a dry smile. Thankfully, he was not a man who would completely lose his senses after meeting a beautiful lady. Furthermore, he was clearly aware that his lady was no simple pushover.\u003c/p\u003e\n\u003cp\u003eThe fact that she could surpass a practitioner like Chen Mu and head into this area indicated that she possessed extraordinary skills. Furthermore, Lin Dong failed to detect her presence during that chaotic battle before. Evidently, this lady was secretly concealing herself and watching the show. Her abilities and intellect far exceeds that of any ordinary woman.\u003c/p\u003e\n\u003cp\u003e“Since this sister sounds so magnanimous, how about you don’t snatch my tool? This does not fit your image as a classy lady.” Lin Dong smiled as his eyes glanced at that mysterious ancient key in the hands of that corpse.\u003c/p\u003e\n\u003cp\u003e“This sister is no saint, therefore I do not have to act like a classy lady. In fact, I prefer to be an unreasonable bitch.” That lady dressed in red smiled coyly. Promptly, she gently gripped her soft jade-like hands before a fiery-red whip immediately appeared. As she gently swung her whip, it seemed like it was even able to forcefully blow apart the surrounding air. Meanwhile, the vibrations emitted from it caused Lin Dong’s pupils to shrink. It seems like this lady was even more powerful than Chen Mu.\u003c/p\u003e\n\u003cp\u003eThat lady dressed in red grinned as she stared right at Lin Dong. Meanwhile, her fiery-red whip was just like a snake as it deftly coiled around her body. At the same time, a formless pressure emerged from her body and caused Lin Dong’s body to feel sluggish.\u003c/p\u003e\n\u003cp\u003eThis woman is not going to be easy to deal with.\u003c/p\u003e\n\u003cp\u003e“Heh heh, Chen Mu and the rest are definitely still outside waiting. Even if you obtain the Ancient Mysterious Key, you will still be unable to leave.” Lin Dong’s gaze swivelled as he spoke.\u003c/p\u003e\n\u003cp\u003e“Chen Mu? Demonic Cliff Empire?” When she heard his words, that lady dressed in red gently pursed her lips and revealed a tinge of pride and nonchalance. However, she did not elaborate. Instead, she stared at Lin Dong before she smiled and said: “Little brother, do you want to abandon it or do you want to play with this big sister? I believe based on your Soul Puppet alone, it would be a little difficult to stop this sister…”\u003c/p\u003e\n\u003cp\u003e“Since you want that mysterious ancient key so much, I would not be a gentleman if I continued to fight with you.” Lin Dong shrugged his shoulders. The words that he spoke caused that lady in red clothes to smile. However, she promptly disposed Lin Dong in her heart. She did not like men who backed off so easily.\u003c/p\u003e\n\u003cp\u003e“Then, let me thank this little brother…”\u003c/p\u003e\n\u003cp\u003eOf course, this lady dressed in red clothes would not express her true intentions. Instead, she coyly smiled, before she jerked the whip in her hand and targeted the mysterious ancient key in the palm of that corpse.\u003c/p\u003e\n\u003cp\u003e“Pi!”\u003c/p\u003e\n\u003cp\u003eHowever, the instant that whip lashed out, that Blood Soul Puppet, that was quietly standing still, suddenly shot out, before its vicious fist wind unceremoniously slammed against that lady.\u003c/p\u003e\n\u003cp\u003eSince she had already lashed out her whip, it was not possible to recall it to defend herself. Nonetheless, this lady dressed in red clothes was fairly skilled and she only took a few steps back before she managed to deftly avoid the Blood Soul Puppet’s attack. At the same time, the whip in her hand missed its target and landed on the ground beside the corpse and left a crack on it.\u003c/p\u003e\n\u003cp\u003eJust as that whip landed on the ground, Lin Dong’s figure lightning-quick appeared beside that corpse. Then, he stared at that lady dressed in red clothes, whose beautiful eyes were now burning in rage, before he softly said.\u003c/p\u003e\n\u003cp\u003e“My apologizes, in my opinion, the mysterious ancient key is more attractive than you.”\u003c/p\u003e\n\u003cp\u003eAfter he spoke, his palm immediately grabbed onto that mysterious ancient key.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-449\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-451\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-450","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
