{"id":61532,"no":1776,"title":"Chapter 465 Fat Lamb","content":"\u003cp\u003e\u003cstrong\u003eChapter 465 Fat Lamb\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA light breeze blew across the lush woodlands, causing ripples to spread outwards on the sea of green that extended all the way till the end of one’s vision.\u003c/p\u003e\n\u003cp\u003eA humongous, square-shaped canopy of darkness towered silently over centre of the lush woodlands. The darkness was completely still, so still that it made one’s heart shiver.\u003c/p\u003e\n\u003cp\u003eThe area a dozen feet around the canopy of darkness was in a state of semi-darkness. Even the rays of light that shot down from the sky were devoured by the canopy of darkness. From afar, the canopy of darkness was like a terrifying bottomless pit.\u003c/p\u003e\n\u003cp\u003eLin Dong silently stood outside the four-cornered canopy of darkness. He raised his head and looked at his masterpiece, amazement surging in his eyes.\u003c/p\u003e\n\u003cp\u003e“How is it? This is one of the abilities of the Devouring Ancestral Symbol, Devouring World. As long as one is within it, his or her Yuan Power and Mental Energy will be gradually devoured. You are the master of this space. As long as you can keep the battle in this place, the more you fight, the more ferocious you will become. On the other hand, your opponents will grow increasingly weaker till the point they are completely exhausted.” Little Marten appeared on Lin Dong’s shoulder and beamed while looking at the Devouring World in front of them. Its words were said with a rather pleased tone.\u003c/p\u003e\n\u003cp\u003e“However, you are still too weak. If you were a little stronger, the Devouring World would be even more terrifying. So much so that even someone like Lei She, who only has that bit of skill, will have his Yuan Power drained within seconds. Unlike now where we are currently so doggedly waiting.”\u003c/p\u003e\n\u003cp\u003e“Furthermore, if you can master the Devouring Ancestral Symbol in future, you will be able to devour not only Yuan Power and Mental Energy, but one’s life force as well.”\u003c/p\u003e\n\u003cp\u003e“Life force?” Upon hearing these words, Lin Dong was finally a little moved.\u003c/p\u003e\n\u003cp\u003e“I once read in ancient texts about a practitioner who obtained the Devouring Ancestral Symbol in the distant past. Heh, once that practitioner activated the Devouring World, he was able to sever the life of all living things within a thousand miles with a single thought,” Little Marten’s eyes were filled with a little admiration. Clearly, even Little Marten was envious of that kind of power.\u003c/p\u003e\n\u003cp\u003e“Does the Devouring World have no weaknesses?” Lin Dong could not help but ask. If there was no way to stop the Devouring World once it was activated, it would really be too much of a cheat.\u003c/p\u003e\n\u003cp\u003e“In this world, there is nothing that is absolutely invincible. The Devouring World might be powerful, but it has its limits too. I might not know about other weaknesses but with the current way you have activated the Devouring World, if you really want to kill those practitioners that have passed the Nirvana Tribulation, there will be some difficulties.”Little Marten replied while shaking its head.\u003c/p\u003e\n\u003cp\u003eAt this moment, Lin Dong then came to a sudden realization. He clearly understood how powerful those practitioners who had passed through the Nirvana Tribulation were. Naturally, he would not fantasize about killing such practitioners.\u003c/p\u003e\n\u003cp\u003e“Of course, even though you can’t trap to death Nirvana stage practitioners who have passed the Nirvana Tribulation like what you did to Lei She and his counterparts, those practitioners still need to use an extremely huge amount of strength to break out of the Devouring World. If you encounter such troublesome foes in future, as long as you activate the Devouring World, making an escape won’t be a problem.”\u003c/p\u003e\n\u003cp\u003eLin Dong slowly nodded his head, slightly excited in his heart. This degree of power had already surpassed his expectations. He knew that there were definitely some Nirvana stage practitioners who had passed the Nirvana Tribulation in the Devil Cliff Empire. Since he had completely offended them, he had to prepare more tricks to deal future troubles.\u003c/p\u003e\n\u003cp\u003e“It’s about time...”\u003c/p\u003e\n\u003cp\u003eLin Dong raised his head and looked at the Devouring World before them. He could feel that the auras in the dark space were already extremely weak. With a smile, Lin Dong waved his hand as numerous ripples swept across the Devouring World. The black light started to undulate before gradually fading.\u003c/p\u003e\n\u003cp\u003eAs the Devouring World began to fade, the canopy of darkness that drove fear into one’s heart started to dissipate rapidly. Soon after, numerous groans could be heard as ten sorry figures fell from mid-air and weakly landing atop the sea of trees.\u003c/p\u003e\n\u003cp\u003eNaturally, the ten figures were Lei She and his counterparts, who were previously trapped in the Devouring World. However, their faces were currently deathly pale and even their auras were extremely faint. The vigorous Yuan Power undulations that they gave off before had now completely disappeared.\u003c/p\u003e\n\u003cp\u003eThe abrupt withdrawal of the darkness was clearly something that Lei She and his counterparts could not adapt to so quickly. Ordinary sunlight caused them to squint their eyes while they were panted heavily. while their faces still displayed fear and shock. Clearly, they had suffered a lot in the Devouring World.\u003c/p\u003e\n\u003cp\u003eLin Dong was very clear about the dark and dull atmosphere created by the Devouring Power. At that time, when he was trapped in the Devouring Ancestral Symbol, he almost went insane. Even though Lei She and his counterparts were only trapped for about ten minutes, it was enough to leave a scar in their minds. It could be assumed that they would not dare to enter any dark places anymore in the future.\u003c/p\u003e\n\u003cp\u003eLin Dong looked smilingly at the devastated Lei She and his counterparts and then laughed indifferently, “It appears that the Devil Cliff Empire has to lose some of their men again.”\u003c/p\u003e\n\u003cp\u003eUpon hearing Lin Dong’s voice, a shudder went down Lei She’s heart. A tinge of chilliness gushed through Lei She’ mind as he raised his head quickly and looked at the sneering Lin Dong. He really could not understand why would Lin Dong possess so many incredible tricks. The previously executed Devouring World was simply not a move that an ordinary Heaven Symbol Master could execute!\u003c/p\u003e\n\u003cp\u003eAt this moment, Lei She finally came to realise that their Devil Cliff Empire had encountered a serious foe this time around.\u003c/p\u003e\n\u003cp\u003e“Retreat.”\u003c/p\u003e\n\u003cp\u003eAs Lei She saw Lin Dong’s mocking and indifferent gaze, the former’s hair stood on end. However, Lei She was still able to make a firm decision. Given the current situation, they were in no condition to fight Lin Dong. Even though there were many of them, their current fighting capabilities were less than ten percent of their usual fighting form. Clearly, if they wanted to contend against Lin Dong now, it would akin to throwing an egg against a rock.\u003c/p\u003e\n\u003cp\u003eUpon hearing Lei She’s words, Chen Mu and his counterparts’ facial expressions changed drastically. Soon after, they clenched their teeth and activated the last bit of Yuan Power in their bodies and flew away in every directions.\u003c/p\u003e\n\u003cp\u003eEven at this moment, Lei She and his men were able to retreat in a calm and systematic way. This certainly shocked Lin Dong. Undoubtedly, the Devil Cliff Empire was indeed a high rank empire. This kind of discipline far exceeded those mid-ranked and low-ranked empires. However, Lin Dong would not allow Lei She and his counterparts to escape after taking great pains to set up this trap. Right now, he needed Nirvana pills urgently and these people were the big fishes. How could he let them off easily?\u003c/p\u003e\n\u003cp\u003e“I’m afraid it’s a bit too late to run now.”\u003c/p\u003e\n\u003cp\u003eAs Lin Dong saw those figures scattering in fear, he laughed. With a jolt of his mind, boundless Mental Energy gushed out and became ten huge Mental Energy-formed hands which pounced on that ten escaping figures.\u003c/p\u003e\n\u003cp\u003eBang bang bang!\u003c/p\u003e\n\u003cp\u003eLei She and his counterparts were terrified when they saw the ten incoming, huge Mental Energy-formed hands. They then mobilized the Yuan Power in their bodies and tried to carry out an attack. However, those huge hands were not even bothered by their weak attacks.\u003c/p\u003e\n\u003cp\u003e“Come back!”\u003c/p\u003e\n\u003cp\u003eWith a swipe from Lin Dong’s huge hands, those escaping figures were recaptured and thrown ruthlessly to the ground. The shock from that tremendous amount of force were able to make them spewed out blood violently.\u003c/p\u003e\n\u003cp\u003eLei She was the last one to be recaptured. Undeniably, this fellow was indeed capable. Even in this situation, Lin Dong had to exert much efforts to recapture him.\u003c/p\u003e\n\u003cp\u003eThump!\u003c/p\u003e\n\u003cp\u003eFollowing which, Lei She’s body was being thrown alongside with his men in a devastated state. They then looked at the smiling Lin Dong, who had just landed in front of them, with a pale-white face. At this moment, their minds were in a state of shock. Not too long ago, they were still in an advantageous position. However, in less than half an hour, all of them had become Lin Dong’s preys.\u003c/p\u003e\n\u003cp\u003e“What do you want?” Lei She’s face was pale. Apparently, he did not expect themselves to fall into such dire situation even when they were so well-prepared this time around.\u003c/p\u003e\n\u003cp\u003e“Hand over your Qiankun bags and I don’t wish to hear any nonsense. At the same time, I hope I don’t need to do it myself.” Lin Dong smiled. His smiled certainly struck fear into Lei She and his counterparts’ hearts.\u003c/p\u003e\n\u003cp\u003eDue to Lin Dong’s smile, Lei She’s swallowed the stubborn words that he had been wanting to say. The look in Lei She’s eyes changed and he could only accept this cruel reality. Right now, they did not have the rights to reject at all.\u003c/p\u003e\n\u003cp\u003e“Take it!”\u003c/p\u003e\n\u003cp\u003eLei She took out a Qiankun bag from his shirt and threw it fiercely with his trembling hands. Upon seeing this, Chen Mu and his counterparts could only bear with their heartaches and took out their Qiankun bags as well.\u003c/p\u003e\n\u003cp\u003eAfter Lin Dong took over the ten Qiankun bags, he focused his Mental Energy on them. After a short while, a overjoy look then appeared on his face. The total number of Nirvana pills in these ten Qiankun bags amounted to approximately three hundred thousand. This was considered a hefty reward to Lin Dong.\u003c/p\u003e\n\u003cp\u003eOther than Nirvana pills, there were some valuable Demonic Crystals as well. Moreover, Lin Dong was able to find three Nirvana stage beasts’ Demonic Crystals in Lei She’s Qiankun bag. The vigorous Nirvana Qi from these Demonic Crystal was worth ten to twenty thousand Nirvana pills.\u003c/p\u003e\n\u003cp\u003e“Not bad, there are around three hundred thousand Nirvana pills.”\u003c/p\u003e\n\u003cp\u003eWithout any trace of courtesy, Lin Dong kept these Nirvana pills into his own Qiankun bag. Then, he furrowed his eyebrows. He did not want to attack the Nirvana stage carelessly before preparing an abundant amount of Nirvana pills. His targeted amount of Nirvana pills was at least a few millions.\u003c/p\u003e\n\u003cp\u003e“Hehe, it’s not difficult to get more Nirvana pills. These fellows are actually living Nirvana pills,” Just as Lin Dong was furrowing his brows, Little Marten’s voice rang across his mind.\u003c/p\u003e\n\u003cp\u003e“Nirvana stage practitioners are extremely important to any high-ranked empires. Some of these people are in quasi-Nirvana stage. In the future, they might have to chance to attain the Nirvana stage as well. If these people are killed, the Devil Cliff Empire will suffer a devastating blow.”\u003c/p\u003e\n\u003cp\u003e“Therefore, I think that the Devil Cliff Empire will pay a large sum of Nirvana pills in exchange for these people’s lives.”\u003c/p\u003e\n\u003cp\u003eUpon hearing Little Marten’s words, Lin Dong was startled momentarily. Following which, his mouth began to form into a shape of an arc, which in turn sent a gush of chilliness through Lei She and his counterparts’ bodies. Lin Dong then muttered in a low voice, “Kidnapping and blackmailing seems to be an interesting business.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-464\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-466\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-465","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
