{"id":61575,"no":1819,"title":"Chapter 508: Nirvana Demon Flame","content":"\u003cp\u003e\u003cstrong\u003eChapter 508: Nirvana Demon Flame\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe Nirvana Demon Flame was kind of flame that had been formed from Nirvana Qi. However, it was several times more powerful than any ordinary Nirvana Flame.\u003c/p\u003e\n\u003cp\u003eThis kind of flame was not scorching hot but it possessed an usual melting ability. Under the wrap of that flame, even the powerful Nirvana Golden Body would be melted into a puddle of blood.\u003c/p\u003e\n\u003cp\u003eNormally speaking, this kind of Nirvana Demon Flame would only appear after one experience three Nirvana Tribulation. Such a flame was born from within. If one was careless, one would be stealthy melted down by it. At that time, other people might not see any change from the outside but the interior of one’s body would likely become completely empty and one’s flesh and bones would cease to exist. It was an extremely frightening and strange fate.\u003c/p\u003e\n\u003cp\u003eSuch a thing was an existence that would cause those experts, who had the qualification to attempt the third Nirvana Tribulation, to change their expressions instantly. It was also the reason why Lin Dong’s face would suddenly appear so ugly after seeing the Nirvana Demon Flame appearing in front of him.\u003c/p\u003e\n\u003cp\u003eThe black-coloured Nirvana Demon Flame was suspended in front of Lin Dong. It’s black fire seed rose slowly, while it repeatedly changed its shape, appearing just like a demon baring their fangs, causing one’s heart to turn cold.\u003c/p\u003e\n\u003cp\u003eLin Dong’s expression was solemn. He did not dare to move his body. He knew that the instant he moved, the Nirvana Demon Flame in front of him would immediately pounce towards him. Furthermore, there was no guarantee that he would be able to endure the melting strength of this Nirvana Demon Flame with his current strength…\u003c/p\u003e\n\u003cp\u003e“You are really unlucky…” Little Marten, who was on Lin Dong’s shoulder, looked at this cluster of black coloured flame and whispered.\u003c/p\u003e\n\u003cp\u003eBehind Lin Dong, Little Flame also acted as though it had met a great enemy. Faint black-coloured energy flowed over the surface of his body, while it’s eyes cautiously stared at the Nirvana Demon Flame that was floating unsteadily.\u003c/p\u003e\n\u003cp\u003e“Now is not the time to pass such sarcastic remarks…” The corner of Lin Dong’s mouth was pulled as his voice was consciously soft. His eyes were cautiously staring at the Nirvana Demon Flame, which was wiggling.\u003c/p\u003e\n\u003cp\u003e“It is unexpected that this kind of Nirvana Demon Flame has actually been created within this Nirvana Burning Sky Array. Heh, this thing might be dangerous but it is also a treasure. If you are able to control it, it will definitely become another ace up your sleeve.” Little Marten suddenly said as it stared at that Nirvana Demon Flame.\u003c/p\u003e\n\u003cp\u003eLin Dong’s face involuntarily twitched when he heard this, before he immediately let out a dry laughter. If this Nirvana Demon Flame was something that was so easy to control, it was likely that those experts who had the qualification the third Nirvana Tribulation and beyond, would not turn so fearful when they heard its name...\u003c/p\u003e\n\u003cp\u003eEven Lin Dong, who possessed the Devouring Ancestral Symbol did not dare to carelessly swallow this thing. It should be known that this thing would not completely disintegrate. If a little bit of it was allowed to enter Lin Dong’s body, it was likely that the interior of his body would be melted until nothing was left. At that time, one would suffer a fate worse than death...\u003c/p\u003e\n\u003cp\u003eOf course, if this thing could really be controlled like Little Marten had mentioned, it would indeed be considered a killing move. After all, this was something that even experts like Liu Bai were extremely wary of.\u003c/p\u003e\n\u003cp\u003e“It is true that this thing cannot be subdued with the Devouring Ancestral Symbol. However, you have more than a single legendary item like the Devouring Ancestral Symbol...” Little Marten laughed. The Devouring Ancestral Symbol might be powerful but Lin Dong was still too weak after all. Therefore, he was unable to unleash its true strength.\u003c/p\u003e\n\u003cp\u003e“You mean, the Mysterious Stone Talisman?” Lin Dong was startled momentarily before recovering immediately. The only god-like items that he had were the Devouring Ancestral Symbol and the mysterious Stone Talisman...\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eLittle Martern nodded. Its claws immediately moved before a warm white glow flew out from Lin Dong’s palm. It was the Mysterious Stone Talisman.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eAt the moment that Little Marten summoned the Mysterious Stone Talisman, the Nirvana Demon Flame in front seemed to have sensed something. Immediately, the flame curled and suddenly rushed out. It charged towards Lin Dong’s side with a lightning-like speed.\u003c/p\u003e\n\u003cp\u003eCold perspiration appeared on Lin Dong’s forehead the moment he saw the action of the Nirvana Demon Flame. A thought passed through his mind before his majestic Mental Energy rushed out. It swiftly formed a tough Mental Energy barrier in front of him.\u003c/p\u003e\n\u003cp\u003eChi chi!\u003c/p\u003e\n\u003cp\u003eHowever, this Mental Energy barrier that could block a powerful explosion from a one Yuan Nirvana Stage expert, was as weak as beancurd in front of that cluster of black coloured flame. The latter had just made contact when the Mental Energy barrier before it disappeared at a shockingly speed, appearing just like snow that had met with a flame.\u003c/p\u003e\n\u003cp\u003eLin Dong finally sensed the frightening ability of this Nirvana Flame at this moment. No wonder those experts, who had the ability to attempt the third Nirvana Stage, were so afraid of it.\u003c/p\u003e\n\u003cp\u003e“Little Martern, are you done?”\u003c/p\u003e\n\u003cp\u003eLin Dong’s body hurriedly withdrew. His Mental Energy rushed out and repeatedly blocked the Nirvana Demon Flame that was charging over. However, regardless of what tactic he used, that Nirvana Demon Flame still swiftly charged over in an overwhelming manner and continuously reduced the gap between the both of them. All Lin Dong could do was to hurriedly cry towards Little Marten.\u003c/p\u003e\n\u003cp\u003eLittle Martern ignored Lin Dong’s cry. Instead, its eyes were solemn as it continued to activate the Stone Talisman. It only waved its claws when Lin Dong was running around in circles, thanks to the cluster of Nirvana Demon Flame. A symbol that was agglomerated from cream-coloured warm light suddenly shot out from within the Stone Talisman.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eThe white symbol glow flashed past. Just like a net, it dashed towards that Nirvana Demon Flame and completely wrapped itself around it.\u003c/p\u003e\n\u003cp\u003eChi chi!\u003c/p\u003e\n\u003cp\u003eThe two collided with each other in an instant. However, the domineering manner that the Nirvana Demon Flame had displayed earlier, did not appear again when they made contact. That white coloured symbol was flickering repeatedly as it strangely stopped the momentum of the Nirvana Demon Flame.\u003c/p\u003e\n\u003cp\u003eSeal!\u003c/p\u003e\n\u003cp\u003eLittle Marten’s eyes flashed the moment it saw the situation. Its claws danced and the white glow symbol spread swiftly. It became just like a seal that firmly wrapped around that cluster of Nirvana Demon Flame.\u003c/p\u003e\n\u003cp\u003eWhen that Nirvana Demon Flame was wrapped by the white glowing symbol, the wild fluctuation that was originally present on it strangely calmed down gradually. Clearly, the energy of this Stone Talisman was actually able to suppress the melting strength of the Nirvana Demon Flame.\u003c/p\u003e\n\u003cp\u003eLittle Marten beckoned with its claw. The Nirvana Demon Flame, which was wrapped by the white glowing symbol, slowly descended. Finally, it was suspended in front of Lin Dong’s cautious eyes.\u003c/p\u003e\n\u003cp\u003eLin Dong stared at this cluster of black coloured flame in front of him. Only after seeing that it did not react strangely did he quietly sigh in relief. Immediately, a joyous expression surged onto his face. The process of subduing this Nirvana Demon Flame had clearly went smoother than he had expected.\u003c/p\u003e\n\u003cp\u003e“This Stone Talisman seal is sufficient to suppress this Nirvana Demon Flame. You use it in the future when fighting with others. It is likely that even Liu Bai would wound up in quite a sorry state.” Little Marten proudly stated.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded. This thing would only appear after having attempted the third Nirvana Tribulation. Therefore, there was no question that it was extremely dangerous. If it was used appropriately, it would indeed be a killing move.\u003c/p\u003e\n\u003cp\u003eThere would definitely be some extremely troublesome opponents in the upcoming fights. Examples include the mysterious Yan Sen and the others. If one wanted to fight with these people, one would likely be eaten alive unless one possessed some special tactics.\u003c/p\u003e\n\u003cp\u003eLin Dong fiddled with the Nirvana Demon Flame that had been sealed by the stone talisman seal. He immediately flicked his finger and saw a wisp of black coloured flame being separated from it.\u003c/p\u003e\n\u003cp\u003eHua!\u003c/p\u003e\n\u003cp\u003eThis wisp of black coloured flame had just appeared when the Nirvana flame that permeated the surroundings suddenly rose in an increasingly intense. Lin Dong’s body actually vaguely showed signs of merging with this sea of fire.\u003c/p\u003e\n\u003cp\u003e“Let’s go!”\u003c/p\u003e\n\u003cp\u003eLin Dong smiled. He manoeuvred this wisp of Nirvana Demon Flame and wrapped it around himself and Little Flame. Immediately, they appeared to have merged with this sea of flame as they quietly hurried through it. Their speed was several times faster than before.\u003c/p\u003e\n\u003cp\u003eThis was a Nirvana fire sea while this Nirvana Demon Flame was an existence that was even stronger than the Nirvana fire. With its presence, the ripples which could ignite the Nirvana Qi in one’s body was also completely isolated outside Lin Dong’s body. Moreover, there was even a merger between the two. This allowed Lin Dong to be just like a fish in water. He swiftly swam through it in a completely silent manner. It was likely that he would not be detected by others even if he was to pass by them.\u003c/p\u003e\n\u003cp\u003eMoreover, the most important thing was that with the isolation from the Nirvana Demon Flame, the many Fire Thunder and other hidden attacks that filled the sea of fire was completely ineffective against Lin Dong. The current Lin Dong seemed to have transformed into a flame within the sea of fire…\u003c/p\u003e\n\u003cp\u003eWith Lin Dong’s speed, the sea of fire was swiftly channelled behind him. Lin Dong could sense that the heat surrounding him seemed to have weakened. Immediately, Lin Dong’s spirits were lifted. He knew that he was about to pass through this Nirvana Burning Sky Array…\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003eTwo figures which were wrapped by fire swiftly rushed past this sea of fire. Suddenly, the flame shook a little. A haze shot out from within it and looked towards their left. A vacuum had actually appeared within the sea of fire at that spot. There was a black figure stepping on empty space within that vacuum.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes looked towards the figure that had actually formed a vacuum within this Nirvana Burning Sky Array. His eyes had shrunk into the size of a pinhole especially after he sensed the vague fluctuation from the body.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, be careful.”\u003c/p\u003e\n\u003cp\u003eLittle Martern let out a low surprised voice that suddenly sounded within Lin Dong’s heart. That voice actually contained a rare solemness that had never appeared before.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-507\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-509\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-508","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
