{"id":61586,"no":1830,"title":"Chapter 519: Pill Room","content":"\u003cp\u003e\u003cstrong\u003eChapter 519: Pill Room\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eNumerous figures swiftly arrived at this enormous Pill Grounds from every direction. After which, their breathing became a little heavy. Clearly, all of them were shocked by the amount of Nirvana Pills in this place.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eNumerous eyes contained a crimson colour. In the next instant, those Pill Rooms that stored Nirvana Pills were directly and brutally destroyed. A bright red Nirvana Pill tide surged forth with a rumbling sound. The shocking Nirvana Qi had basically formed a sort of substance like structure.\u003c/p\u003e\n\u003cp\u003eEveryone violently swallowed a mouthful of saliva as they looked at the wave of pills that had surged out like floodwater from within those Pill Rooms. They directly began snatch them frantically.\u003c/p\u003e\n\u003cp\u003eIt was natural for some huge scuffles to erupt during this kind of snatching. Most of those who had arrived at this place had lost their mind in the face of this frightening amount of Nirvana Pills. Nirvana Pills were crucial to any Nirvana Stage expert. Only by possessing sufficient Nirvana Qi, would they be able to continuously refine their bodies and Yuan Power and reach the point where they could endure the next Nirvana Tribulation.\u003c/p\u003e\n\u003cp\u003eThe amount of Nirvana Qi that one could absorb during one’s usual training was only a small amount. Hence, if one wanted to increase one’s training speed, these Nirvana Pills was something that one must have. Hence, it was not unusual for one to lose some sense of reasoning because of this event.\u003c/p\u003e\n\u003cp\u003eWhile fighting took place, Lin Dong did not stay behind. His gaze looked towards the deep regions of the Pill Grounds and was locked onto a large Pill Room at the deepest part of the Pill Grounds.\u003c/p\u003e\n\u003cp\u003eAlthough Lin Dong also coveted after those Nirvana Pills, he knew the importance of other matters. As long as he could obtain the Samsara pill, Little Marten would be able to recover its physical body and its strength would soar. At that time, with a genuine expert like Little Marten guarding him, the benefits that Lin Dong would gain would definitely far surpass those Nirvana Pills which he could snatch!\u003c/p\u003e\n\u003cp\u003eAdditionally, just based on the relationship between the two of them, Lin Dong also had sufficient reason to abandon those Nirvana Pills.\u003c/p\u003e\n\u003cp\u003eIn his eyes, Little Marten was clearly more important than even tens of millions of Nirvana Pills!\u003c/p\u003e\n\u003cp\u003eThis Pill Ground was extremely large. Even with Lin Dong speed, he only managed to reach the Pill Room located at the deepest part of the Pill Ground, after several minutes.\u003c/p\u003e\n\u003cp\u003eThis Pill Room appeared even more ancient than any other part of the Pill Ground. Its yellowish main gain vaguely contained some ancient symbols and lines. There was a faint energy fluctuation spreading from it.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes contained some joy as he looked at this ancient Pill Room. He did not say anything as Yuan Power whizzed out from within his body. Finally, a punch ruthlessly landed onto the main door.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eThe ancient large door did not crumble as expected, despite absorbing the full force of Lin Dong’s attack. Instead, Lin Dong directly rebounded from it. He took a couple of quick steps on the ground before stabilizing his body. A somewhat dumbfounded expression appeared on his face.\u003c/p\u003e\n\u003cp\u003e“This is a kind of protected door. It is impossible to forcefully break it. No matter how powerful your attack is, it will be reflected by the door unless you can completely blast it apart.” Little Marten flashed and appeared. It stared at the door for a moment before suddenly speaking.\u003c/p\u003e\n\u003cp\u003e“Use the Devouring Ancestral Symbol against it! Its defences might be strong but it must have been eroded over many years. It should not be too difficult to get rid of it.”\u003c/p\u003e\n\u003cp\u003eLin Dong knew that he was pressed for time and quickly stepped forward without any hesitation. His hand was pressed gently on the ancient door. After which, a devouring force erupted, eroding the many ancient symbols on the main door an inch at a time.\u003c/p\u003e\n\u003cp\u003eSizzle sizzle!\u003c/p\u003e\n\u003cp\u003eWith the surge of this devouring force, the numerous ancient symbols began to gradually turned faint. A moment later, they completely disappeared.\u003c/p\u003e\n\u003cp\u003eThis door suddenly decayed at a shockingly rapid speed when those ancient symbols disappeared. Finally, it emitted a crack sound and crumbled in front of Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eWith the crumbling of the main door, waves of frightening Pill Qi from within the Pill Room behind suddenly erupted like a volcano that had been sealed for a millenia.\u003c/p\u003e\n\u003cp\u003eThe Pill Qi was like a real substance as it shot out from the Pill Room. Even Lin Dong was forced back by it. After which, the Pill Qi rose into the air, appearing just like a plume that could be clearly seen within a fifty kilometre radius.\u003c/p\u003e\n\u003cp\u003e“Damnit!”\u003c/p\u003e\n\u003cp\u003eLin Dong involuntarily let out a furious curse when he saw the activity created after opening this Pill Room. With this commotion, it was likely that many experts would hurry over to this place.\u003c/p\u003e\n\u003cp\u003e“Go, enter quickly!” Lin Dong waved his hand towards Little Flame. After which, he entered that Pill Room like a rabbit.\u003c/p\u003e\n\u003cp\u003eThe light within the Pill Room did not appear dim and it was like a gentle warm glow. However, the Pill Qi that lingered within it caused one’s vision to be slightly hindered.\u003c/p\u003e\n\u003cp\u003eHowever, this kind of hindrance could be easily overcame after getting used to it. Lin Dong raised his eyes and swept over it. Immediately, he involuntarily inhaled a harsh breath of cold air.\u003c/p\u003e\n\u003cp\u003eThe size of this Pill Room was quite large. Numerous large rock pillars stood within it. Moreover, various different coloured medicinal pills were suspended over these rock pillars. Waves after waves of shocking Pill Qi continuously spread from these medicinal pills. Just by basing one’s judgement of the Pill Qi, it was possible to tell that these medicinal pills were extraordinary items.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes carried a slightly shaken expression as he swept over the place. A moment later, his eyes suddenly focused on a silver coloured round medicinal pill. His entire person trembled violently. He muttered, “This is the Crossing Disaster Pill?”\u003c/p\u003e\n\u003cp\u003eThis so-called Crossing Disaster Pill was also known as the Crossing Tribulation Pill. It was basically a precious medicinal pill that every Nirvana Stage experts dreamed of. Everyone knew that the Nirvana Stage experts were most fearful of the Nirvana Tribulation and many Nirvana Stage experts had died because of it. However, this Crossing Disaster Pill could dramatically increase the chances of successfully surviving the Nirvana Tribulation!\u003c/p\u003e\n\u003cp\u003eIf an ordinary person possess the Crossing Disaster Pill, they would have a seventy percent chance of surviving one Nirvana Tribulation. Although this might be a slight overestimation, it showed just how powerful this medicinal pill was.\u003c/p\u003e\n\u003cp\u003eConsequently, Lin Dong was actually startled for a moment when he saw this ‘Crossing Disaster Pill’, which he had only rumours of, appearing in this place.\u003c/p\u003e\n\u003cp\u003eLin Dong was similarly afraid of the Nirvana Tribulation. He might possess the mysterious Stone Talisman that protected his body, but each of the Nirvana Nine Tribulations would become increasingly terrifying. He had only just endured through the first tribulation. There was no telling whether he would be able to smoothly survive every tribulation in the future. If he possessed this Crossing Disaster Pill, he would undoubtedly be much safer. Lin Dong licked his lips. His eyes could not hide the fiery heat in them. In the next instant, his body directly rushed forward and grabbed at the Crossing Disaster Pill above a rock pillar. He must obtain that item!\u003c/p\u003e\n\u003cp\u003eLin Dong’s body was extremely quick. In a flash, he had already appeared in front of the Crossing Disaster Pill. Powerful Yuan Power surged out, transforming into a large palm that grabbed towards the Crossing Disaster Pill.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eHowever, just as Lin Dong was about to grab hold of the medicinal pill, the latter suddenly shook. A shocking Pill Qi surged out. It vaguely seemed to form an illusory figure that blocked Lin Dong’s large palm.\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003eThe counter attack by the Crossing Disaster Pill caused Lin Dong to be startled. Clearly, he did not expect that even a medicinal pill was actually able to retaliate. However, his dullness clearly only lasted for an instant before he immediately recovered. He emitted a laughter as he curled his palm and a circular black hole spread out.\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eThat powerful Pill Qi had just made contact with the black hole when it was completely swallowed. Lin Dong once again extended his hand and finally grabbed this Crossing Disaster Pill within it.\u003c/p\u003e\n\u003cp\u003eA boiling hot temperature spread the moment the medicinal pill fell into Lin Dong’s hands. The latter could vaguely sense the enormous strange energy contained within it.\u003c/p\u003e\n\u003cp\u003e“Is this the Crossing Disaster Pill?” Lin Dong could not resist the curiosity in his heart as he observed this extremely renown medicinal pill. The medicinal pill was silver in colour. Pill lines encircled it, appearing just like the stars. Its luster and other features were all top notch.\u003c/p\u003e\n\u003cp\u003eIf this thing was to be taken out and auctioned, it would at the very least be worth over three million Nirvana Pills. Moreover, it was a situation where there was demand but no supply. Countless number of Nirvana Stage experts would fight over this medicinal pill until they bled.\u003c/p\u003e\n\u003cp\u003eLin Dong flipped his hand and stored this Crossing Disaster Pill into his Qiankun bag. After which, his eyes looked at the other medicinal pills on the rock pillars with a fiery hot expression. The medicinal pills in this place were all clearly extraordinary.\u003c/p\u003e\n\u003cp\u003e“Little Flame, just go ahead and take as many as you can!”\u003c/p\u003e\n\u003cp\u003eLin Dong urged Little Flame. They relied on their fast speed to be the first to arrive at this place. They should quickly act while there was no one competing with them.\u003c/p\u003e\n\u003cp\u003eLittle Flame was unceremonious after hearing Lin Dong’s words. He directly rushed forward. A black light whizzed out from his palm and swept towards those medicinal pills.\u003c/p\u003e\n\u003cp\u003eThe two of them whistled through this Pill Room. They did not care about what medicinal pill it was as they simply took all that they could. After all, it was not everyday that one could find such a place.\u003c/p\u003e\n\u003cp\u003eThe two of them might have quite a fast speed but they were still unable to sweep the entire Pill Room. Around a few minutes later, Lin Dong had heard some hurried rushing wind sound that were emitted from behind him. Numerous figures entered this Pill Room with lightning-like speed.\u003c/p\u003e\n\u003cp\u003eHiss!\u003c/p\u003e\n\u003cp\u003eThese people also noticed the many extraordinary exquisite medicinal pills on the rock pillars after they had appeared. Some of those sharp-eyed individuals immediately inhaled a harsh but deep breath of cool air. In an instant, they seemed to have sensed blood boiling within their bodies.\u003c/p\u003e\n\u003cp\u003e“Have they caught up?”\u003c/p\u003e\n\u003cp\u003eLin Dong also sensed the motion behind him. He immediately narrowed his eyes. At this moment, he had already reached the middle of the Pill Room. He raised his head and his eyes were focused towards the centre spot.\u003c/p\u003e\n\u003cp\u003eThere was a black coloured ancient rock pillar located at that spot. A black and white medicinal pill that seemed to be the mixture of Yin and Yang were quietly suspended over the top of the rock pillar.\u003c/p\u003e\n\u003cp\u003eA vague feeling of life and death spread around it.\u003c/p\u003e\n\u003cp\u003e“Samsara Pill!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s mouth immediately turned dry at this instant. Little Marten’s aura from within the stone talisman also contained a sort of uncontrollable ripple.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-518\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-520\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-519","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
