{"id":61623,"no":1867,"title":"Chapter 556: Intervention","content":"\u003cp\u003e\u003cstrong\u003eChapter 556: Intervention\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA wild and violent Yuan Power explosion suddenly sounded on the main road between some lush green trees. The enormous trees collapsed and a figure shot backwards in a miserable manner. That figure rubbed on the ground, forming a scar that was dozens of metres long. Only then did he violently collided onto an enormous tree. Immediately, a trace of blood flowed down the corner of his mouth.\u003c/p\u003e\n\u003cp\u003e“Big brother!”\u003c/p\u003e\n\u003cp\u003eThat figure landed on the ground in a miserable manner. Two figures hurriedly flew over to the fallen man, with an anxious expression on their face.\u003c/p\u003e\n\u003cp\u003e“Liu Ya, protect little Rou and go!” That man, who was forced back in a miserable manner, suddenly recollected himself. At this moment, his face appeared quite pale. He forced himself to stand up and shouted at the two women beside him.\u003c/p\u003e\n\u003cp\u003eThe two people standing beside him were naturally Su Rou and Liu Ya. They looked at the injuries on Su Wang. Their pretty faces were a little pale as they did so.\u003c/p\u003e\n\u003cp\u003e“Haha, I have wasted quite a lot of time dealing with you. Everything will likely end today.” However, a soft laughter suddenly sounded within these woods, just when Su Wang cried out. Immediately, numerous sound of wind being torn apart were emitted from around the place. Five black shadows appeared on a large tree in front of Su Wang’s group in a ghost like manner. Their eyes looked down from above, appearing to contain a teasing expression like that of a cat playing with a mouse.\u003c/p\u003e\n\u003cp\u003e“Yan Mo, you should not be too overbearing!” Su Wang’s expression immediately changed intensely as he cried out, after seeing the five figures that had appeared.\u003c/p\u003e\n\u003cp\u003e“You can only blame yourself for taking something that you should not take. How can a mere middle rank empire enjoy such an inheritance?” A man in black robes, who appeared quite cold, was at the front of the five black shadows. He smilingly stared at the furious Su Wang as he laughed sinisterly.\u003c/p\u003e\n\u003cp\u003e“Hand over your sister and we might grant you an easy death.” That man who was called Yan Mo spoke indifferently.\u003c/p\u003e\n\u003cp\u003e“In your dreams!” Su Wang clenched his teeth. He endured the intense pain being emitted from his body as he maneuvered his Yuan Power. Su Rou’s beautiful large eyes hurriedly became teary, upon seeing this manner of Su Wang. She knew that the strength of the five people in front were extremely strong. Amongst them there were three people who had advanced into the three Yuan Nirvana Stage. With Su Wang’s strength alone, he was definitely no match for them. He would really be killed by this group if he continued to act brave.\u003c/p\u003e\n\u003cp\u003e“You’ve got backbone. However, such a person is destined to have a short life!”\u003c/p\u003e\n\u003cp\u003eA ferocious smile was slowly lifted on Yan Mo’s face. In the next instant, his body wildly rushed forward. Fierce and uncontrolled palm wind directly covered Su Wang, appearing just like a storm.\u003c/p\u003e\n\u003cp\u003eSu Wang hurriedly slammed his palm on Su Rou’s body beside him after seeing that Yan Mo did not show any mercy. He pushed the later away before his Yuan Power swelled. A fist was thrown forward, colliding head on with that Yan Mo.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eYuan Power violently overflowed from the point, where the palms made contact. The fallen tree leaves on grounds around them were instantly blasted into powder. Wild and violent wind directly forced back both Su Rou and Liu Ya by the side.\u003c/p\u003e\n\u003cp\u003eThe already pale face of Su Wang became even uglier as the wind swept. Their footsteps stumbled backwards as they spat out a mouthful of fresh blood. Clearly, their injuries were quite serious.\u003c/p\u003e\n\u003cp\u003eYan Mo did not show the slightest trace of stopping, even after having injured Su Wang. A killing intent flashed across his eyes as mighty Yuan Power agglomerated at the tip of his finger. It appeared just like a sharp sword that penetrated towards Su Wang’s throat with lightning like speed.\u003c/p\u003e\n\u003cp\u003e“Big brother!”\u003c/p\u003e\n\u003cp\u003eSu Rou’s pretty face changed a little upon seeing this scene. Her small lovely body actually rushed out in a flash and directly blocked in front of Su Wang. She was quite strong but her character was a little delicate. Hence, her aura was halved when she saw the ferocious expression of Yan Mo.\u003c/p\u003e\n\u003cp\u003e“What a touching scene. However, I do not know how to treat a girl nicely!”\u003c/p\u003e\n\u003cp\u003eYan Mo merely smiled in a dense manner upon seeing that Su Rou had courageously stepped forward. His eyes did not contain even the slightest mercy. Instead, it held a kind of perverted joy. The Yuan Power on the tip of his finger became increasingly sharp as they pierced towards Su Rou’s beautiful face.\u003c/p\u003e\n\u003cp\u003e“Little Rou, get out of the way!” Su Wang hurriedly shouted from behind upon seeing this scene. His expression immediately changed drastically.\u003c/p\u003e\n\u003cp\u003eSu Rou’s small lovely body trembled slightly. Her large eyes contained a fear that could not be hidden. She merely bit her lips as she focused intently on the increasingly close sharp finger wind. In the next instant, an extremely majestic Yuan Power suddenly erupted from her body. The offensive ripple that was created by the Yuan Power directly send Yan Mo flying. However, this kind of strength was clearly not something that Su Rou was able to completely control. Her entire body had trembled intensely after unleashing and withdrawing it.\u003c/p\u003e\n\u003cp\u003e“Is that the power that you have obtained from the sealed territory? It is indeed very strong. It is really wasted on you!” Yan Mo’s toes pressed gently in the air. Only then was he able to resolve the impact. His eyes contained a fiery hot greed as he stared at Su Rou. He immediately waved his hand. “Attack together. Capture this girl!”\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eYan Mo’s cry had just sounded when the eyes of the four, who had yet to attack, instantly turned cold. They did not utter even the slightest nonsense as their bodies rushed out. Their attack was well coordinated as their aura surged and directly sealed the retreat path of Su Rou. Vast and mighty ruthless Yuan Power swept towards Su Rou like floodwaters.\u003c/p\u003e\n\u003cp\u003eSu Rou’s face became even paler as she watched the fierce and ruthless attacks that came pouring down like a storm. The actual strength of her body was merely at two Yuan Nirvana Stage level. Other than on some occasions, the great strength within her body was also beyond her control. Therefore, she really had nowhere to run in the face of the combined attacks by these five people.\u003c/p\u003e\n\u003cp\u003eThe eyes of Su Wang behind immediately turned red upon seeing the predicament that Su Rou was in. His heart wanted to charge forward but the churning blood within his body caused the Yuan Power within his body to circulate extremely slowly. All he could do was to watch the numerous merciless attacks approaching Su Rou.\u003c/p\u003e\n\u003cp\u003eJust as those sharp attacks were about to pour over Su Rou’s lovely body, however, an ear piercing rushing wind sound suddenly appeared. A black shadow rushed out from the forest in a ghost like manner. After which, he appeared in front of Su Rou. Bright golden glow erupted at this moment, transforming into a circular golden light barrier.\u003c/p\u003e\n\u003cp\u003eBoom boom boom!\u003c/p\u003e\n\u003cp\u003eWild and violent attacks ruthlessly smashed onto the golden light barrier, forming numerous rapid ripples. The wind swept apart in an untamed manner. However, no matter how intense the ripple was, the gold coloured light barrier still firmly guarded the two figures who were within it.\u003c/p\u003e\n\u003cp\u003eThe glaring golden light caused Su Rou’s beautiful large eyes to narrow involuntarily. Soon after, she saw the figure that was standing in front of her.\u003c/p\u003e\n\u003cp\u003eUnder the shining golden light, this back did not appear to be very strong. However, it contained a pine like straightness. That manner was as though this backbone would be able to endure it even if the sky was to collapse.\u003c/p\u003e\n\u003cp\u003eThis was the first time in so many years that Su Rou had discovered a straight and firm back that was similar to that of her big brother, who had been protecting her. However, why was it that this back appeared a little familiar?\u003c/p\u003e\n\u003cp\u003eThe golden glow gradually become dim. Finally, it completely disappeared. That young figure finally turned his head over and smiled towards the young lady behind. His tone was warm, “Are you alright?”\u003c/p\u003e\n\u003cp\u003e“Big brother Lin Dong?”\u003c/p\u003e\n\u003cp\u003eSu Rou was startled as she looked at the gentle brilliant face. Immediately, she nodded in a helpless manner. Her large eyes turned aside in panic and her face became much redder almost instantly.\u003c/p\u003e\n\u003cp\u003eThe light became dimmer as Yan Mo’s group watched. Their eyes immediately turned cold when they saw Lin Dong, who had appeared in front of Su Rou. Their tone was dense as they spoke, “Where did this ignorant fool come from? He actually dares to intervene in our matter?”\u003c/p\u003e\n\u003cp\u003e“So many people bullying a little girl. One’s face should not be this thick, right?” Lin Dong raised his head,looked at Yan Mo’s group and spoke with a faint smile.\u003c/p\u003e\n\u003cp\u003eYan Mo’s eyes were deep as he stared at Lin Dong. The corner of his mouth twitched slightly as he slowly said, “This friend. Perhaps you ought to inquire about the background of our Wind Cloud Empire before you think about being a hero and trying to rescue a beauty, no?”\u003c/p\u003e\n\u003cp\u003e“A super empire huh?”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyebrows were lifted for a moment upon hearing this name. Clearly, he was a little surprised.\u003c/p\u003e\n\u003cp\u003e“Brother Lin Dong, this Wind Cloud Empire is extremely strong. We are already extremely grateful that you are willing to lend us a hand. I, Su Wang, do not wish for anything else. I only beg that you can bring little Rou and leave. Your big favour is something that I will never forget. I will block these people!” Su Wang hurriedly cried out. He was also surprised that Lin Dong had intervened.\u003c/p\u003e\n\u003cp\u003eThese people in front of them were all quite strong. Moreover, he was aware of Lin Dong’s strength. However, as long as he could get Su Rou to escape alive, it was worthwhile to Su Wang even if he was to end up dead in this place.\u003c/p\u003e\n\u003cp\u003e“I do not wish to leave. Big brother Lin Dong, thank you. However, you should all leave. These people are very strong!” Su Rou shook her head and said.\u003c/p\u003e\n\u003cp\u003e“I have never done anything meaningless.” Lin Dong smiled as he flicked a finger on Su Rou’s clean forehead. After which, he turned his head and looked at Yan Mo’s group. He said, “Sorry, but it is likely that I will have to take these three people away with me today.”\u003c/p\u003e\n\u003cp\u003e“Are you certain that you possess this qualification?” Yan Mo parted his mouth and spoke in a dense manner.\u003c/p\u003e\n\u003cp\u003eLin Dong gave a half smile as he stared at Yan Mo. He slowly nodded, “I think that I do…”\u003c/p\u003e\n\u003cp\u003eYan Mo’s eyes instantly turned cold upon hearing this. When he was about to attack, however, he suddenly felt his heart turn cold. He could only see two figures on a large tree behind Lin Dong. These two figures were looking down from above. Their eyes contained a fierceness and playfulness as they stared at Yan Mo’s group. That kind of gazes was no different from how they looked at Su Wang’s group earlier.\u003c/p\u003e\n\u003cp\u003e“Finish them off…”\u003c/p\u003e\n\u003cp\u003eLin Dong smiled as he looked towards Yan Mo. Within Lin Dong’s eyes, a cold light gradually gathered. Soon after, his hand fell as he softly said. Immediately, killing intent spread outwards.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-555\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-557\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-556","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
