{"id":61711,"no":1955,"title":"Chapter 642: Reward","content":"\u003cp\u003e\u003cstrong\u003eChapter 642: Reward\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDesolate Hall is situated in the southwest corner of Dao Sect. A dozen over giant peaks that touched the heavens, formed a circle. On top of these giant peaks, streams of silver-like waterfalls poured down. A loud rumbling sound ricocheted across the entire domain.\u003c/p\u003e\n\u003cp\u003eOn top of these large peaks, one could see numerous large halls. Meanwhile, countless number of figures were just like ants as they traversed across it. It released a vibrant and prosperous atmosphere.\u003c/p\u003e\n\u003cp\u003eSurrounding these large peaks, was a several thousand mile long river that swept across it. It looked just like a river in heaven. When one got near to it, one could actually realize that this enormous river was actually formed from Nirvana Qi!\u003c/p\u003e\n\u003cp\u003eA genuine Pill River!\u003c/p\u003e\n\u003cp\u003eThe resources of these super sects evidently did not lose out much to those ancient sects.\u003c/p\u003e\n\u003cp\u003eWhen Lin Dong saw that hovering Pill River, that was the first thought that flashed past his mind. Promptly, he was secretly excited by it. He had previously experienced the benefits from cultivating in a Pill River. However, due to time constraints in the Ancient Battlefield, he could not linger on and he only briefly enjoyed it before he left regretfully. Therefore, when he saw that there was actually a Pill River in Desolate Hall, his heart was naturally filled with joy.\u003c/p\u003e\n\u003cp\u003e“In Desolate Hall, there are three thousand disciples and three hundred direct disciples. All of them are excellent members who have been through the most stringent tests. On the outskirts, there are tens of thousands of branch disciples. If they are able to pass the tests, they are always welcome to become full fledged disciples of Desolate Hall.” Standing beside Lin Dong, Wu Dao pointed at several dozen large peaks. There was a tinge of pride in his tone.\u003c/p\u003e\n\u003cp\u003e“Three hundred direct disciples, three thousand disciples, tens of thousands of branch disciples…”\u003c/p\u003e\n\u003cp\u003eWhen Lin Dong heard the figures, he was instantly shocked. He was clearly aware that in order to become a direct disciple of a super sect, according to the Hundred Empire War’s rules, one must step into the Nirvana Golden Ranking. However, right now, just the number of direct disciples of Desolate Hall, already stands at three hundred.\u003c/p\u003e\n\u003cp\u003eThe three hundred of them were obviously the elite and they must be top geniuses just like Lanying and the rest.\u003c/p\u003e\n\u003cp\u003eEven after adding together the total number of Nirvana Golden Ranking members in the current Hundred Empire War, there was less than half of this number. Based on this, it seems like these super empires truly had many other avenues to recruit members.\u003c/p\u003e\n\u003cp\u003eLin Dong did not inquire about the three other halls. However, with just a rough gauge, he was able to deduce that their numbers surely exceed the Desolate Hall.\u003c/p\u003e\n\u003cp\u003eIt seems like the total strength of the Dao Sect was truly terrifying. This also allowed Lin Dong to clearly witness the terror of a super sect. By possessing such strength, in the Eastern Xuan Region, how could any empire compete with such a monstrous beast.\u003c/p\u003e\n\u003cp\u003eWith these terrifying disciples as a foundation, one’s sect would definitely become powerful.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, based on your performance, you naturally possess the qualifications to become a direct disciple. However, there is something that this old man must mention. Even in the Desolate Hall, you will face intense competition. Therefore, if you want to enjoy preferential treatment, you must prove yourself. Else, you will be quickly replaced.” Wu Dao’s expression was solemn as he stared at Lin Dong and said.\u003c/p\u003e\n\u003cp\u003e“This type of competition is also a way to train our disciples. Therefore, we will not easily intervene in fights between disciples. If you want to continue to enjoy your privileges, the only thing you require is the ability to assert your right.”\u003c/p\u003e\n\u003cp\u003e“You are the current champion of the Hundred Empire War and you have recruited many disciples for our Dao Sect. We will naturally have to reward you for it. However, whether you have the ability to enjoy this reward, will still depend your own abilities…”\u003c/p\u003e\n\u003cp\u003e“What reward?” Lin Dong smiled as he curiously asked.\u003c/p\u003e\n\u003cp\u003e“Pill River Head Immersion.”\u003c/p\u003e\n\u003cp\u003eWu Dao gently smiled as he pointed to that massive Pill River and leisurely said: “In the deep region of the Pill River, there will be some extremely pure Nirvana Qi generated each year. We term it as the Nirvana Golden Qi. That stuff is extremely beneficial for Nirvana stage practitioners.”\u003c/p\u003e\n\u003cp\u003e“At that time, the hall master and I will personally manipulate the Nirvana Golden Qi to temper your body and your internal Yuan Power. If you are able to handle it, your strength would surely surge.”\u003c/p\u003e\n\u003cp\u003e“Sounds pretty good.” Lin Dong’s eyes gently lit up. Something that required the combined efforts of both hall master must be pretty good.\u003c/p\u003e\n\u003cp\u003e“Of course it is. This Nirvana Golden Qi is originally reserved for Desolate Hall’s top disciple. If it was not for the fact that you have performed a service of great merit, you will not be able to enjoy it.” Wu Dao rolled his eyes at Lin Dong and said.\u003c/p\u003e\n\u003cp\u003e“Who is the strongest disciple in Desolate Hall now?” Lin Dong gently smiled and asked.\u003c/p\u003e\n\u003cp\u003e“The four senior direct disciples. All of them are at seven Yuan Nirvana stage and they are no pushovers.” With his hands behind his back, Wu Dao sadistically teased.\u003c/p\u003e\n\u003cp\u003e“Seven Yuan Nirvana stage huh.” Lin Dong’s eyes gently hardened. Promptly, he slowly nodded his head before he softly said: “They are powerful indeed. However, it is not difficult to overtake them.”\u003c/p\u003e\n\u003cp\u003eWith Lin Dong’s current strength, he could fight evenly with a six Yuan Nirvana stage expert. Therefore, if he continued to improve, he could most likely contend with a seven Yuan Nirvana stage expert. Right now, he had just entered the Desolate Hall. Therefore, he should have time to slowly catch up with those seniors.\u003c/p\u003e\n\u003cp\u003eWhen he saw Lin Dong’s smiling face, Wu Dao secretly nodded his head. He had personally witnessed Lin Dong’s rise during the Ancient Battlefield. For a young man from a low rank empire to stand out in the battlefield, was already a miracle by itself.\u003c/p\u003e\n\u003cp\u003e“If you want the obtain the qualifications to learn the Great Desolate Scripture, you must defeat them. However, that is for later.”\u003c/p\u003e\n\u003cp\u003e“With regards to the Pill River Head Immersion that we promised, there are only a few rare individuals in Desolate Hall that have enjoyed this treatment. Since you are only a new disciple, there are bound to be some disciples who feel disgruntled. With regards to this issue, you would have rely on your own abilities. We will not intervene.” Wu Dao casually said.\u003c/p\u003e\n\u003cp\u003e“Understood.” Lin Dong gently smiled as he nodded his head.\u003c/p\u003e\n\u003cp\u003e“Besides, what do your two other friends plan to do?” Wu Dao’s eyes suddenly turned towards Little Marten and Little Flame, before he asked.\u003c/p\u003e\n\u003cp\u003eHe was clearly aware of their true identities. Therefore, he understood that Little Marten would not join Dao Sect.\u003c/p\u003e\n\u003cp\u003e“In two day’s time, I will depart together with Little Flame.” Little Marten casually said.\u003c/p\u003e\n\u003cp\u003e“Depart?” When Lin Dong heard his words, he was instantly shocked.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, I will take him out for a spin. There is a place in Eastern Xuan Region which is extremely beneficial for him. It is best for him to train over there.” Little Marten smiled as he said.\u003c/p\u003e\n\u003cp\u003e“Big brother, second brother said that I will be able to improve rapidly at that place. Let me follow him first. If you face any problems, use the Yuan Spirit to send a message to second brother. We will come immediately. Little Flame scratched his head while he grinned.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, with me around, nothing will happen.” Little Marten smiled at Lin Dong.\u003c/p\u003e\n\u003cp\u003eWhen he saw the situation, Lin Dong hesitated for a moment. Promptly, he chose not to dwell on this issue. The reason why Little Marten chose to follow Lin Dong was because he was worried for him. Now that he had joined the Dao Sect, as long as no accidents occur, he should be in safe hands. In that case, Little Marten could enjoy more freedom.\u003c/p\u003e\n\u003cp\u003eFurthermore, Lin Dong knew that Little Marten had many secrets. Since the latter did not wish to tell him, he did not want to ask him as well. Right now, he was still not powerful enough. Therefore, Little Marten’s knowledge was of little use to him.\u003c/p\u003e\n\u003cp\u003e“Alright, we have reached the Desolate Hall. All of you will take the rest of the day to recuperate. Tomorrow, we will head to the Pill River stage. At that time, we will perform the Pill River Head Immersion for you.” Wu Dao led the crowd to a huge mountain. With a wave of his arm, several disciples immediately leapt forth. Following which, he looked at Lin Dong and the rest before he spoke.\u003c/p\u003e\n\u003cp\u003e“Yes!”\u003c/p\u003e\n\u003cp\u003eWhen they heard his words, the crowds responded respectfully.\u003c/p\u003e\n\u003cp\u003eWu Dao gently nodded his head. Promptly, a smile appeared on his face: “Besides, congratulations on becoming official disciples of Desolate Hall. This can be considered as your home in the future.”\u003c/p\u003e\n\u003cp\u003eWhen they heard his words, a grateful expression surfaced on Liu Bai and the rest’s faces. After a long and arduous journey, they had finally became disciples of a super sect.\u003c/p\u003e\n\u003cp\u003eJust like the spot where Lin Dong and the rest reached, in the eastern side of Dao Sect, there was also towering mountains. The atmosphere here was actually more majestic than the Desolate Hall.\u003c/p\u003e\n\u003cp\u003eThis was the place where the Sky Hall was located.\u003c/p\u003e\n\u003cp\u003eIn the sky above the Sky Hall, there was also a hovering Pill River. Furthermore, this Pill River was larger than the one at Desolate Hall. At a cursory glance, you could see no end to it and could only feel that rich and potent Nirvana Qi drifting off from the river. It even caused its surroundings to warp.\u003c/p\u003e\n\u003cp\u003eUpon closer inspection, one could see several floating platform above the Pill River. Seated above the platform, were several disciples quiety training. Streams of powerful vibrations continuously emerged from within their bodies.\u003c/p\u003e\n\u003cp\u003eMost of these platform were scattered around the surroundings of the Pill River. Nonetheless, typically speaking, the closer it go to the center of the Pill River, the less platforms there were. Meanwhile, the number of disciples seated above also decreased.\u003c/p\u003e\n\u003cp\u003eSwoosh.\u003c/p\u003e\n\u003cp\u003eA splitting wind sound suddenly rang out above the Pill River. Faintly, it was accompanied by the crisp sound of a instrument, which sounded just like a teana. That noise caused several disciples to open their eyes to stare at that alluring figure flashing past the horizon. Meanwhile, they seemed to be intoxicated by that sound.\u003c/p\u003e\n\u003cp\u003eThe alluring figure in the sky did not bother about their glances as she directly headed to the deepest spot in the Pill River. Finally, she landed above the final platform.\u003c/p\u003e\n\u003cp\u003eWhen that alluring figure landed, her red dress swayed. It was actually Ying Huanhuan, who had previously bickered with Lin Dong.\u003c/p\u003e\n\u003cp\u003eWhen she landed on that platform, she immediately looked in front. At the edge of that platform, was a lady quietly seated down. Meanwhile, rich and potent Nirvana Qi swiveled around her.\u003c/p\u003e\n\u003cp\u003eThat lady was dressed in black ceremonial robes and she had a slim figure. Her soft green hair was casually tied up by a green lace and the tip was faintly curved at a sharp angle. Her hands were placed on her knees and there was a seal on her jade fingers. Above her handseal, a green longsword was placed between two seals, while a faint sword aura slowly emerged. It actually forcefully split apart the surrounding Nirvana Qi.\u003c/p\u003e\n\u003cp\u003e“Sis.”\u003c/p\u003e\n\u003cp\u003eWhen Ying Huanhuan saw the lady dressed in black ceremonial robes, she involuntarily pouted her tiny mouth.\u003c/p\u003e\n\u003cp\u003eThe lady in front of her was actually the number one younger generation member in Dao Sect, the Big Sister of Sky Hall, Ying Xiaoxiao.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-641\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-643\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-642","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
