{"id":61728,"no":1972,"title":"Chapter 659: Forming a Desolate Seed","content":"\u003cp\u003e\u003cstrong\u003eChapter 659: Forming a Desolate Seed\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eHumm Humm!\u003c/p\u003e\n\u003cp\u003eA seemingly boundless grey energy violently swelled within Lin Dong’s bodies akin to tidewaters. The places that it visited, even including the meridian, showed signs of withering. The corrosive power of the Desolate Force was obviously extremely terrifying.\u003c/p\u003e\n\u003cp\u003eLin Dong clearly realized this fact as his gaze immediately grew more and more solemn. Although it must be said that he was not afraid of the overbearing Desolate Force since he could rely on the Devouring Ancestral Symbol within his body as a seal, it is never a bad idea to be a little extra cautious…\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eAt this moment, with a thought of his mind, wisps of green light started to scatter from within Lin Dong’s body. Under the envelopment of this green light, those meridian which were showing signs of withering due to the corrosion by the Desolate Force, started to regenerate rapidly. Having practiced the Green Heaven Materialized Dragon Skill, Lin Dong’s muscles and skin were not only resilient, even his organs and viscera also possessed the same formidable defensive power.\u003c/p\u003e\n\u003cp\u003e“Devour all of them!”\u003c/p\u003e\n\u003cp\u003eLin Dong revolved the Green Heaven Materialized Dragon Skill to block the corrosion by the Desolate Force. At the same time, vigourous Devouring Force erupted from his body without restraint and completely devoured those waves of Desolate Force invading his body, before condensing them in his Dantian.\u003c/p\u003e\n\u003cp\u003eUnder the continuous influx of Desolate Force, within his Dantian, the grey mist started to condense faster. Gradually there were signs of the condensation taking shape within his Dantian.\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong was trying his best to defend against the vast amount of Desolate Force trying to rush into his body, many gazes from the surroundings stayed unblinking on his body. All those gazes were filled with some degree of shock. They could see that the withering signs originally present on Lin Dong’s body, had actually began to gradually halt...\u003c/p\u003e\n\u003cp\u003eLin Dong actually managed to resist the frightening Desolate Force that was invading his body!\u003c/p\u003e\n\u003cp\u003eThe blind old man used his ashen-grey eyes to stare at the youth beside the Desolate Stone. His tense body started to gradually relax. He could feel large quantities of Desolate Force continuously flowing from the Desolate Stone into Lin Dong’s body. What made him feel quite shocked was that there was no uncomfortable expression on Lin Dong’s face when handling the the vast amount of Desolate Force.\u003c/p\u003e\n\u003cp\u003e“Within his body… it seems like there is something that is able to contend with the Desolate Force…”\u003c/p\u003e\n\u003cp\u003eThe blind old man muttered to himself. Although he could not see, his other senses were extremely keen. From his other senses, he could vision that Lin Dong’s thin body was akin to a bottomless pit. No matter how hard he tried to probe, he still could not fathom its depths...\u003c/p\u003e\n\u003cp\u003e“At this rate, it would take no more than half a day for him to condense a Desolate Seed. This rate is much faster than that fellow Zhou Tong. If Chen Zhen or Wu Dao knew about this, they would probably be totally dumbfounded…”\u003c/p\u003e\n\u003cp\u003e“It looks like another outstanding person has joined the Desolate Hall this time…”\u003c/p\u003e\n\u003cp\u003eDi!\u003c/p\u003e\n\u003cp\u003eLin Dong was obviously unable to sense the shocked gazes originating from his surroundings, as he was totally focused on the massive foreigner that was invading his body...\u003c/p\u003e\n\u003cp\u003eAs more and more Desolate Force invaded his body, Lin Dong could gradually feel that there was a mysterious type of fluctuation being emitted from within the enormous Desolate Stone.\u003c/p\u003e\n\u003cp\u003e“This sensation…”\u003c/p\u003e\n\u003cp\u003eLin Dong had obviously felt before this kind of mysterious fluctuation before. He faintly frowned, however, without giving him much time to think, the fluctuations suddenly grew increasingly violent. Increasingly savage Desolate Force unexpectedly erupted forth and violently rushed towards him.\u003c/p\u003e\n\u003cp\u003eThe Desolate Force this time around was several times more violent than before. Furthermore, their offensive intention was extremely clear. It felt as if someone was controlling the Desolate Stone and launching an attack at him!\u003c/p\u003e\n\u003cp\u003eLin Dong suddenly opened his eyes. His eyes sparkled as he stared at that enormous Desolate Stone. He was a disciple of the Desolate Hall and under normal circumstances, there should not be anyone that would create difficulties for him by manipulating the Desolate Stone. In that case, that attack should have been launched by the Desolate Stone itself...\u003c/p\u003e\n\u003cp\u003e“Soul Treasure huh…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s gaze sparkled before he promptly took a deep breath of air, while a shocked expression fluttered across his eyes. This Desolate Stone was actually a soul treasure. Furthermore, it was a soul treasure that had some degree of consciousness!\u003c/p\u003e\n\u003cp\u003e“Pure Yuan Treasure!”\u003c/p\u003e\n\u003cp\u003eLin Dong tugged at the corners of his mouth. A soul treasure that was able to possess such frightening energy was absolutely something that any ordinary Heavenly Soul Treasure could not compare with. Then, there was obviously only one possibility left. That means that the Desolate Stone was actually a Pure Yuan Treasure, similar to the “Heavenly Sealing Array” that those people from the West Xuan Region used!\u003c/p\u003e\n\u003cp\u003eRoar!\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong was secretly feeling shocked by the status of the Desolate Stone in front of him, a murky grey light suddenly erupted from the surface of the Desolate Stone. The light start wriggling before congealing lighting quick into a grey beam. It snaked on the surface of the stone like lighting, before attacking Lin Dong.\u003c/p\u003e\n\u003cp\u003eClang.\u003c/p\u003e\n\u003cp\u003eThe sudden move by the Desolate Stone immediately caused many startled whooshing sounds from the surroundings. Many disciples stood up on the platform and looked at this scene in shock. Obviously this was the first time over so many years, that they had seen the Desolate Stone take the initiative to launch an attack...\u003c/p\u003e\n\u003cp\u003eAt the same time, Lin Dong obviously discovered the intention of the Desolate Stone as he immediately frowned. Immediately, he did not dare to underestimate it as boundless green light erupted from the heart of his palm. The green light rushed towards the grey light and viciously slammed against it\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA low and deep impact sound resounded out from the surface of the Desolate Stone. A shocking quantity of energy fluctuations erupted out, causing all the surrounding air to be blasted away.\u003c/p\u003e\n\u003cp\u003e“Hmph.”\u003c/p\u003e\n\u003cp\u003eLin Dong’s body violent trembled a few times before a snorting noise came out of his throat. His finger, which was in contact with the Desolate Stone, turned numb. However, what truly frustrated him was that the Desolate Stone actually withdrew the Desolate Force. From its actions, it was as if it was unwilling to let Lin Dong absorb such a large quantity of Desolate Force.\u003c/p\u003e\n\u003cp\u003eLin Dong’s gazed turned solemn. His Desolate Seed was about to take shape and he naturally wanted to complete it in a single try. If he was to give up now, it was obviously not going to be possible.\u003c/p\u003e\n\u003cp\u003eWith a thought, he spread open his palms and pressed all five fingers against the Desolate Stone. At every spot where his fingers touched the Desolate Stone, five stream of Devouring Force congealed in a black ray of light and directly shot straight into the Desolate Stone, before rapidly drilling into the deeper sections.\u003c/p\u003e\n\u003cp\u003eHumm! Humm!\u003c/p\u003e\n\u003cp\u003eWhen those black rays of light drilled into the Desolate Stone, the stone obviously felt what had happened. Immediately, wave after wave of incomparably violent Desolate Force surged forth and easily blocked Lin Dong’s attack.\u003c/p\u003e\n\u003cp\u003e“He actually aroused the ire of the Desolate Stone…” mutter the blind old man. A somewhat intrigued expression appeared on his face. This scene was almost identical to what happened to that fellow back then.\u003c/p\u003e\n\u003cp\u003e“Dammit!”\u003c/p\u003e\n\u003cp\u003eAfter sensing the rejection from the Desolate Stone, Lin Dong could not help but curse while clenching his teeth. If he was able to fully exhibit the power of the Devouring Ancestral Symbol, he would not be afraid of the Desolate Stone. However under the gazes of many people, he was unwilling to expose the secret within his body.\u003c/p\u003e\n\u003cp\u003eThe Desolate Stone obviously sensed the hopelessness and hesitation from Lin Dong. It immediately turned rampant and launched wave after wave of Desolate Force, which directly impacted and suppressed the five rays of black light back into Lin Dong’s body. It then proceeded to flaunt its prowess to force Lin Dong to back away.\u003c/p\u003e\n\u003cp\u003eLin Dong frowned. He had obviously never expected that his all-out absorption of the Desolate Force would provoke such a violent reaction by the Desolate Stone. This put him in a dilemma.\u003c/p\u003e\n\u003cp\u003eLin Dong’s fingers which were in contact with the Desolate Stone, violently trembled as waves of repulsive force spread out from within the Desolate Stone. It was attempting to push his fingers off.\u003c/p\u003e\n\u003cp\u003eLin Dong’s facial expression turn slightly ugly as glanced over at his fingers, which were being gradually repulsed by the Desolate Stone. Was he going to fall short of his goal in the end? If he was unable to condense a Desolate Seed, he would obviously be unable to practise the Desolate martial arts.\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eOne by one, Lin Dong’s fingers were shaken and repulsed by the Desolate Stone. Regardless of how hard he struggled, he was still unable to resist the repulsive energy coming from the Desolate Stone. He had finally experienced first-hand the frightening strength of a Pure Yuan Treasure...\u003c/p\u003e\n\u003cp\u003e“Fuck you!”\u003c/p\u003e\n\u003cp\u003eWhen he saw his last finger being pushed off, Lin Dong grew angry and could not resist, resulting in a curse escaping from his mouth. At this moment however, he suddenly felt something in his body starting to violently shake. Before he even realized what was happening, a temperate white glow directly shot out of his last remaining finger and flew straight inside the Desolate Stone viciously.\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eA faint penetration sound rang out from within the Desolate Stone as that temperate white glow directly slammed against layers of Desolate Force within the Desolate Stone. After which, it broke through countless layers with a speed akin to snapping bamboo.\u003c/p\u003e\n\u003cp\u003eChi Chi Chi Chi!\u003c/p\u003e\n\u003cp\u003eUnder the dumbfounded observation by Lin Dong, the temperate white glow pierced through all the defensive layers of the Desolate Stone within a short span of ten seconds, before it finally reached the deepest part of the stone. At that moment, a peculiar fluctuation start to spread out. When this fluctuation appeared, Lin Dong was shocked to find out that the fluctuation within the depths of the Desolate Stone was actually beginning to tremble.\u003c/p\u003e\n\u003cp\u003e“Roar Roar!”\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong was still in shock, waves of extremely vigourous Desolate Force rushed out of the Desolate Stone akin to the bursting of flood waters. With a frightening speed, they rushing into the depths of Lin Dong’s body before pouring into his dantian.\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eDue to the arrival of the seemingly crazy amount of Desolate Force, the grey mist within the Dantian started to condense. With a sudden tremble, it finally condensed into a fist sized grey coloured bead!\u003c/p\u003e\n\u003cp\u003eAt this moment, Lin Dong had finally condensed a Desolate Seed!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-658\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-660\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-659","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
