{"id":61751,"no":1995,"title":"Chapter 682: Retreat","content":"\u003cp\u003e\u003cstrong\u003eChapter 682: Retreat\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe black-clothed figure on the mountaintop slowly appeared in front of the crowd. His black robe covered his face while an icy cold ripple faintly spread stealthily.\u003c/p\u003e\n\u003cp\u003e“Yao Ling?”\u003c/p\u003e\n\u003cp\u003eSome members of the crowd were stunned and exclaimed in shock when this person appeared. This name possessed quite a strong reputation in Blood Rock Grounds. Since he was the fourth on the sects’ wanted list, this was enough to cause many fearsome individuals to feel wary of him.\u003c/p\u003e\n\u003cp\u003eLuo Yi and Xiao Tian’s expressions also changed at this moment. Their eyes were filled with cautiousness when they looked at this black clothed figure. Although they were only ranked a little lower than Yao Ling, they understood that in a real fight, the both of them together would likely be no match against Yao Ling.\u003c/p\u003e\n\u003cp\u003e“Ha, even this fellow has appeared. It seems like the Devil Seal Mass really wants the Immortal Yuan Ancient Seed at any cost…” Luo Yi’s eyes were dark and cold as he laughed softly. He glanced at the distant Lin Dong with vicious eyes. In his heart, he was secretly gloating because of the latter’s predicament. However, he also felt somewhat unhappy. After all, he still felt a little displeased to see the Immortal Yuan Ancient Seed fall into the hands of Yao Ling’s group in front of his eyes.\u003c/p\u003e\n\u003cp\u003e“Chief.”\u003c/p\u003e\n\u003cp\u003eSu Lei’s group had faces filled with joy because of Yao Ling’s appearance. They swiftly rushed over. Following which, they looked at Lin Dong’s group in a sadistic manner.\u003c/p\u003e\n\u003cp\u003e“Yao Ling…”\u003c/p\u003e\n\u003cp\u003eYing Huanhuan, Yuan Fang, Jiang Kun and the others’ expressions gradually turned ugly when Yao Ling appeared. Although they knew that Yao Ling would definitely appear, their hearts still involuntarily sunk a little when they saw him in flesh.\u003c/p\u003e\n\u003cp\u003eThey were clearly well informed about this fellow, who was ranked fourth on the sects’ wanted list. Nine Yuan Nirvana Stage was sufficient to oppress everyone here.\u003c/p\u003e\n\u003cp\u003eYao Ling was once a deacon of the Yuan Gate and his status surpassed disciples like them. With his strength, one could count the number of disciples in Dao Sect who could fight evenly with him on one hand…\u003c/p\u003e\n\u003cp\u003eMoreover, this fellow was not alone. His subordinates were also a group of extremely fearsome people with notorious reputations.\u003c/p\u003e\n\u003cp\u003e“The leader of Devil Seal Mass huh…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes also stared intently at the figure that was completely wrapped in a black robe. His eyes were incomparably grave. From the latter’s body, he could sense a rich feeling of danger.\u003c/p\u003e\n\u003cp\u003eLin Dong might not be afraid of Luo Yi. However, at this moment, even he felt some uneasiness bubbling within his heart.\u003c/p\u003e\n\u003cp\u003eAfter all, given his current strength, there was simply too large of a gap when compared with nine Yuan Nirvana Stage…\u003c/p\u003e\n\u003cp\u003e“You are called Lin Dong, right? The champion of the Hundred Empire War. Haha, how unexpected. The champion of the Hundred Empire War this time around actually chose to join Dao Sect.”\u003c/p\u003e\n\u003cp\u003eStanding on top of the mountain, Yao Ling gently raised his head before he revealed his pale and shady face. A pair of indifferent eyes were locked onto Lin Dong from under the black robes as he laughed faintly.\u003c/p\u003e\n\u003cp\u003eLin Dong focused his eyes. Clearly, he did not expect that Yao Ling would actually be able to recognise him immediately…\u003c/p\u003e\n\u003cp\u003e“Yao Ling, this Immortal Yuan Ancient Seed is discovered by our Dao Sect first. We have already transmitted the news back. Soon, experts from our Dao Sect will arrive. This is not something that you can touch!” Yuan Fang cried out in a deep voice.\u003c/p\u003e\n\u003cp\u003e“Haha, it doesn’t matter. All I need to do is finish all of you off before the experts from Dao Sect arrive.” Yao Ling smiled slightly and spoke in a casual manner.\u003c/p\u003e\n\u003cp\u003e“You should also stop using the Dao Sect to intimidate me. Others might be afraid of your Dao Sect but I, Yao Ling, don’t give a damn…”\u003c/p\u003e\n\u003cp\u003e“You!”\u003c/p\u003e\n\u003cp\u003eYuan Fang became furious. However, she immediately suppressed her fury forcefully and laughed coldly, “You can gloat now. However, you will definitely regret it in the future.”\u003c/p\u003e\n\u003cp\u003eLin Dong knitted his brows tightly. Earlier, he had taken much pains to use the Desolate Demon Eye to force Luo Yi back and intimidate the rest. However, it was all for nought now that Yao Ling appeared…\u003c/p\u003e\n\u003cp\u003e“Lin Dong, await my orders and prepare to retreat.”\u003c/p\u003e\n\u003cp\u003eYing Huanhuan’s soft voice suddenly resounded beside Lin Dong’s ear while this thought lingered his heart.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes shrunk upon hearing this before he nodded quietly. Currently, it was unwise for them to stay on any further. Once Yao Ling appeared, they lost any advantage they previously had. Hence, they could only choose to retreat.\u003c/p\u003e\n\u003cp\u003eHowever, would Yao Ling allow them to withdraw peacefully? Lin Dong’s eyes flashed while he sighed quietly in his heart.\u003c/p\u003e\n\u003cp\u003eYao Ling extended his hand while he stood on the distant mountaintop. He slowly pulled off the black robe that covered his face. After which, he revealed his pale white middle-aged face. His eyes were deep and his gaze was so sharp that they appeared like blades, cutting painfully into one’s skin.\u003c/p\u003e\n\u003cp\u003e“Friends, this Immortal Yuan Ancient Seed is something that my Yuan Gate desires. Therefore, I hope that everyone can stand by idly today. My Yuan Gate will definitely reward everyone in the future.”\u003c/p\u003e\n\u003cp\u003eYao Ling’s eyes swept over this entire place first. After which, he cupped his hands together towards these people and laughed faintly.\u003c/p\u003e\n\u003cp\u003eYao Ling had directly mentioned Yuan Gate when he spoke. As the strongest sect in Eastern Xuan Region, the weight of his words was extraordinary. Hence, the expressions of quite a number of people changed when his voice sounded out. However, no one dared to object.\u003c/p\u003e\n\u003cp\u003eThis was because both the strength of Yao Ling and the might of Yuan Gate were things that they could not afford to offend.\u003c/p\u003e\n\u003cp\u003eA smile was revealed on Yao Ling’s face when he saw this silent atmosphere. Immediately he turned his head and stared at Lin Dong’s group. He extended his hand and said with a smile, “Hand that thing over. All of you should be aware of my character. I have never shown mercy in the past and I will not start doing it now. If it is really necessary, I do not mind turning this place into a bloody river.”\u003c/p\u003e\n\u003cp\u003eYing Huanhuan and the rest’s eyes shrunk slightly when they heard this while their expressions were in flux. Promptly, they took two steps forward, while a desperate expression appeared to flash across their faces. However, just as Yao Ling thought that they were about to give in, a chillness suddenly surged within Ying Huanhuan’s eyes. Her icy cold cry resounded over the place, “Run!”\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eThe moment her voice sounded, Ying Huanhuan’s hand suddenly landed on her emerald-like zither. After which, her zither strings vibrated swiftly. A bright green sonic wave swept out like a great ocean wave. This sonic wave did not appear to possess a strong offensive strength. However, it caused anyone who heard it to be momentarily stunned.\u003c/p\u003e\n\u003cp\u003eIt was this short instant that the Dao Sect’s disciples below scattered apart at the same time. After which, they became just like a locust as they rushed off in all directions.\u003c/p\u003e\n\u003cp\u003eThis event took place so suddenly. No one expected a hundred Dao Sect’s disciples would scatter so decisively.\u003c/p\u003e\n\u003cp\u003eBy the time some people recovered their senses, most Dao Sect’s disciples had already rushed into the forest and swiftly disappeared. Their speed involuntarily caused some people to be stunned.\u003c/p\u003e\n\u003cp\u003e“Go!”\u003c/p\u003e\n\u003cp\u003eHovering in mid-air, Ying Huanhuan, Jiang Kun and the other core disciples also took off at the same time. However, they did not scatter. This was because they clearly understood that while ordinary disciples would be able to retreat easily, they would definitely be targeted by Yao Ling’s group.\u003c/p\u003e\n\u003cp\u003e“Today, I want to see where all of you can flee to!”\u003c/p\u003e\n\u003cp\u003eYao Ling had also completely recovered at this moment. His eyes were dark and cold as he glared at Ying Huanhuan, Lin Dong and the rest who had rushed off. A ferocious smile immediately appeared on his face.\u003c/p\u003e\n\u003cp\u003e“Follow them. The Immortal Yuan Ancient Seed is with them.” Yao Ling waved his hand and laughed coldly.\u003c/p\u003e\n\u003cp\u003e“Yes!”\u003c/p\u003e\n\u003cp\u003eSu Lei and the rest also replied with a savage smile when they heard Yao Ling’s cold laughter. After which, their bodies rushed out. They directly carried a rushing wind sound before they chased after Lin Dong’s group.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eYao Ling’s body also disappeared at this moment. His body turned into a bright light that rushed outwards.\u003c/p\u003e\n\u003cp\u003eSwoosh swoosh swoosh!\u003c/p\u003e\n\u003cp\u003eAfter the people from the Devil Seal Mass gave chase, the surrounding observers also swiftly moved. Although the Immortal Yuan Ancient Seed was currently being targeted by Yao Ling, they were unwilling to give up so easily…\u003c/p\u003e\n\u003cp\u003eUnder the whistling of the large scale number of people that covered the sky, the sound of rushing wind appeared one after another. All the natural Yuan Power appeared to boil at this moment.\u003c/p\u003e\n\u003cp\u003e...\u003c/p\u003e\n\u003cp\u003eA couple of humans rushed over the sky of the mountain range, while they were accompanied by a hurried rushing wind sound. Their eyes would occasionally sweep over the area behind them. All of them had grave expressions on their faces.\u003c/p\u003e\n\u003cp\u003e“We will not be able to shake them off if this continues…” Yuan Fang clenched her teeth and said.\u003c/p\u003e\n\u003cp\u003eLin Dong also nodded slightly. He could sense that Yao Ling’s aura was getting increasingly close to them.\u003c/p\u003e\n\u003cp\u003eJiang Kun and the rest was silent, while the expression in their eyes were a little gloomy. Being chased truly felt unpleasant.\u003c/p\u003e\n\u003cp\u003eYing Huanhuan hugged her emerald-like zither. Her eyes were lowered and a glow flashed over it. Promptly, her body suddenly paused. She clenched her silver teeth and said, “I will stop them. All of you should go.”\u003c/p\u003e\n\u003cp\u003eJiang Kun, Yuan Fang and the rest’s expressions changed when they heard this. They were just about to object when Ying Huanhuan glared at them. Promptly, her tone became much calmer: “Do anyone of you possesses the ability to stop Yao Ling’s group?”\u003c/p\u003e\n\u003cp\u003eJiang Kun and the rest were at a loss for words. The gap between them and Yao Ling was too large. Even if they risked their lives to stop him, it was likely difficult for them to accomplish much.\u003c/p\u003e\n\u003cp\u003e“If you think that there is still time to continue chatting, you can continue to do so.”\u003c/p\u003e\n\u003cp\u003eYing Huanhuan turned around and sat down on a stone. Her emerald zither was placed in front of her. After which, she extended her hand and gently swept past those dark black horse tail strings. Immediately, green threads poured down. They became like a waterfall as they slowly danced in the wind.\u003c/p\u003e\n\u003cp\u003eJiang Kun and the others involuntarily clenched their fists when they saw the alluring young lady figure.\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes stared deeply at the figure. However, contrary to expectations, he did not speak up at all. Instead, he turned around and left. Jiang Kun and the rest’s expressions changed for a moment before they finally clenched their teeth, turned around and left.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, bring the seed back…”\u003c/p\u003e\n\u003cp\u003eYing Huanhuan’s hands gently pressed her zither when she sensed the group leaving swiftly. A red glow gradually surged within her clear eyes, while a soft cry was also quietly being emitted.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-681\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-683\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-682","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
