{"id":61775,"no":2019,"title":"Chapter 706: Violence","content":"\u003cp\u003e\u003cstrong\u003eChapter 706: Violence\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOn the enormous platform, the expression of the black-clothed man called Huo Zhen darkened due to Lin Dong’s words. Immediately, the corners of his mouth parted as he ridiculed, “I don’t have any upbringing? I’m afraid that you are unqualified to utter such words.”\u003c/p\u003e\n\u003cp\u003e“Is that so?”\u003c/p\u003e\n\u003cp\u003eA smile also appeared on Lin Dong’s face. He slowly took a step forward, his fists slowly clenching as he laughed, “In that case, do you want to give it a try?”\u003c/p\u003e\n\u003cp\u003e“This fight is not something that any ordinary disciple can participate in. You should first ask your Dao Sect’s elders.” Huo Zhen glanced at Lin Dong and mocked.\u003c/p\u003e\n\u003cp\u003eHowever, his laughter had just sounded when he suddenly heard a deafening laughter from the surrounding Dao Sect disciples. He immediately knitted his brows and shifted his gaze, only to see the Dao Sect disciples staring at him with mocking faces. They looked as though they had heard something extremely comical.\u003c/p\u003e\n\u003cp\u003eYing Huanhuan also quietly grabbed her zither and stood up beside Lin Dong. Her black hair scattered in front of her chest like a waterfall. At this moment, her appearance actually possessed a rather quiet and gentle beauty, causing Lin Dong to be stunned momentarily when he saw her.\u003c/p\u003e\n\u003cp\u003e“I thought that you would never show up.”\u003c/p\u003e\n\u003cp\u003eHowever, this quietness merely continued for a moment before Ying Huanhuan rolled her eyes at Lin Dong and softly snorted.\u003c/p\u003e\n\u003cp\u003eLin Dong involuntarily turned speechless when he saw the young lady’s lovely and pretty face. She had been purposefully avoiding him during this period of time. In the end, she actually claimed that it was his fault instead. It was indeed difficult to deal with women.\u003c/p\u003e\n\u003cp\u003e“Since you have appeared, the final round will be left to you. However, on behalf of every disciple of the Dao Sect, let me seriously warn you. If you lose the battle today, you can forget about having a peaceful life in the future!’” Ying Huanhuan’s eyes formed the shape of a crescent when she saw Lin Dong’s speechless appearence. Immediately, her hand patted Lin Dong’s shoulder as she coyly spoke.\u003c/p\u003e\n\u003cp\u003eLin Dong also smiled when he heard this. His eyes stared at the nearby Huo Zhen and softly said, “Since someone has delivered himself to my doorstep, he will surely be unhappy if I do not step on him a little.”\u003c/p\u003e\n\u003cp\u003e“Hehe, well said, I like it.”\u003c/p\u003e\n\u003cp\u003eYing Huanhuan laughed secretly but immediately sensed that the dual meaning behind his words. Her face immediately reddened a little. However, she quickly recovered to herself when Lin Dong’s eyes looked over. She waved her hand as though nothing had happened and said, “I will leave it to you…”\u003c/p\u003e\n\u003cp\u003eAfter her voice faded, Ying Huanhuan swiftly exited from the arena and returned to the area where the Dao Sect disciples were. After which, she gently patted her somewhat heated face.\u003c/p\u003e\n\u003cp\u003eLin Dong smilingly shook his head. His eyes glanced towards the nearby Huo Zhen, whose expression had turned a little ugly because of the ridicule from the Dao Sect disciples. After which, he turned to the other side where Chen Zhen and other elders of the Dao Sect were located. He laughed, “Teacher-uncle Chen Zhen, shall this disciple represent the sect in the fifth round?”\u003c/p\u003e\n\u003cp\u003e“Alright.”\u003c/p\u003e\n\u003cp\u003eChen Zhen smiled faintly. Immediately, he looked towards the two grey-clothed elders from the Great Precipice Cave and said, “This is a disciple of my Desolate Hall, Lin Dong.”\u003c/p\u003e\n\u003cp\u003eAt first, there was a slightly mockful expression on the faces of those two grey-clothed elders. After all, they could tell that Lin Dong was merely at six Yuan Nirvana stage and there was too much of a gap when compared to Huo Zhen. However, that ridicule instantly disappeared when they heard his name. Instead, shock took its place.\u003c/p\u003e\n\u003cp\u003e“Lin Dong? That Lin Dong, who is rumoured to have fought with the leader of the Devil Seal Mass, Yao Ling, until both of them were seriously injured?” A grey-clothed elder from the Great Precipice Cave stared at Lin Dong with shocked eyes as he spoke.\u003c/p\u003e\n\u003cp\u003eThe previous Blood Rock Grounds incident had stirred quite a great commotion. In the end, the Dao Sect had dispatched quite a number of experts to capture and kill the criminals who had attacked the Dao Sect disciples. Due to this, it caused news of the matter to spread rather quickly. Perhaps, even Lin Dong himself was unaware how much his reputation had spread while he was holed up in the Dao Sect...\u003c/p\u003e\n\u003cp\u003e“Ha ha, such a matter did indeed occur.” Chen Zhen laughed faintly.\u003c/p\u003e\n\u003cp\u003eThat grey-clothed old man’s eyes flashed for a moment. Immediately, they paused on Lin Dong and laughed, “This young man only appears to be at six Yuan Nirvana stage. Based on the rumours, he had to swallow a large amount of mysterious fruits back then in order to boost his strength and reach the stage where he could contend with Yao Ling…”\u003c/p\u003e\n\u003cp\u003eWhen his words reached this point, his voice paused for a moment before continuing, “However, I think that this young friend will not get to use such a method for today’s contest, am I right?”\u003c/p\u003e\n\u003cp\u003eChen Zhen and Wu Dao frowned a little when they heard these words. Just as they were about to speak, Lin Dong had already cupped his hands towards the grey-clothed elders before he laughed, “Elders, you can be rest assured that there is likely no need to use that method today.”\u003c/p\u003e\n\u003cp\u003eThe two grey-clothed elders were startled because of Lin Dong’s words. Immediately, their expressions became a little ugly. Clearly, they understood the meaning behind Lin Dong’s words. Although they were a little displeased by Lin Dong’s arrogance, it was impossible for them to lower their status and argue with a disciple. All they could do was to quietly throw an icy cold gaze towards Huo Zhen. The latter also smiled coldly and nodded in understanding.\u003c/p\u003e\n\u003cp\u003e“Cough.”\u003c/p\u003e\n\u003cp\u003eHowever, their displeasure caused the corners of Chen Zhen’s and Wu Dao’s mouths to reveal a smile. After which, they coughed softly and reprimanded Lin Dong a little. Only then did they wave their hands and speak, “You shall represent us in this final match.”\u003c/p\u003e\n\u003cp\u003eLin Dong cupped his hands together towards Wu Dao. He immediately turned around and smilingly looked at Huo Zhen, whose smile had now turned a little dark, before speaking, “Senior brother Huo Zhen, please.”\u003c/p\u003e\n\u003cp\u003e“Haha, junior brother Lin Dong please be careful. Fists and legs do not have eyes. Please forgive me if you are injured.” Huo Zhen smilingly said.\u003c/p\u003e\n\u003cp\u003e“Likewise, senior brother Huo Zhen.” The smile on Lin Dong’s face was equally bright.\u003c/p\u003e\n\u003cp\u003e“Hypocrites.”\u003c/p\u003e\n\u003cp\u003eNearby, when Ying Huanhuan saw their actions, she involuntarily curled her mouth. Couldn’t the two of them tell how fake the smiles on their faces were?\u003c/p\u003e\n\u003cp\u003e“This fellow is purposefully agitating the other party.” Beside her, Mo Ling chuckled.\u003c/p\u003e\n\u003cp\u003eYing Huanhuan looked at Huo Zhen when she heard this. She discovered that the smile on the latter’s face had indeed become a little stiff, and immediately laughed. They truly disliked Huo Zhen. Upon witnessing Lin Dong silence Huo Zhen in this manner, it allowed them to relieve some of the frustration within their hearts.\u003c/p\u003e\n\u003cp\u003e“In order to deal with a person like Huo Zhen, only someone like Lin Dong can deal a blow to him both physically and mentally.”\u003c/p\u003e\n\u003cp\u003e“Junior brother Lin Dong’s sharp wit is in no way inferior to your fame …”\u003c/p\u003e\n\u003cp\u003eHuo Zhen slowly stepped forward. The smile on his face had an extra trace of gloominess. He stared at Lin Dong and laughed faintly, “I wonder how you will perform this time around without the opportunity to use those mysterious fruits?”\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eHou Zhen suddenly stepped forward after his voice sounded. Soon after, a wave of extremely vigorous Yuan Power suddenly swept out from within his body. After which, it transformed into rumbling pressure that covered Lin Dong.\u003c/p\u003e\n\u003cp\u003eHuo Zhen displayed quite an outstanding strength. It was evident that he was much stronger than the Song Yan from before.\u003c/p\u003e\n\u003cp\u003eThe surrounding Dao Sect disciples had quite a solemn expression because of this. Although they were extremely confident in Lin Dong, Huo Zhen was no ordinary individual. In order to become the most outstanding younger generation member of the Great Preciple Cave, the latter definitely had the skills to back it.\u003c/p\u003e\n\u003cp\u003eLin Dong curled both of his hands, while his body was as straight as a spear. He did not move regardless of how strong the Yuan Power pressure from Huo Zhen was. Only a faint chill flashed across his narrowed eyes.\u003c/p\u003e\n\u003cp\u003e“Allow me to see how powerful you are, the man who was able to fight Yao Ling until both parties were seriously injured!”\u003c/p\u003e\n\u003cp\u003eA dark and stern expression flashed across Huo Zhen’s eyes. Immediately, he took a step forward. Wild and violent Yuan Power whizzed out from within his body like a great ocean wave. His body transformed into a black shadow as he rushed out. In a flash, he appeared in front of Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Half Mountain Cave!”\u003c/p\u003e\n\u003cp\u003eHuo Zhen did not show any mercy as he threw a punch forward. Yuan Power immediately gathered wildly on it. His punch was powerful enough to penetrate a mountain.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe wild and violent fist contained astonishing strength as it was thrown forward explosively. It was also swift as lightning. In the span of a breath, it had already arrived in front of Lin Dong’s chest. Sharp rushing wind sounds spread on the platform in a deafening manner.\u003c/p\u003e\n\u003cp\u003e“Bam!”\u003c/p\u003e\n\u003cp\u003eThe wild and violent fist suddenly froze in the next moment, while Huo Zhen’s pupils instantly shrunk. That was because he saw Lin Dong block his fist with a single palm. His powerful attack, which could penetrate a mountain, was actually directly blocked by Lin Dong.\u003c/p\u003e\n\u003cp\u003e“This tiny bit force is not enough.”\u003c/p\u003e\n\u003cp\u003eLin Dong parted his mouth and smiled at Huo Zhen. However, his smile was exceptionally chilling. In the next moment, he suddenly gripped his palm while his entire arm also began to squirm. Green dragon scales swiftly surged out. Within a short couple of breaths, it had transformed into a ferocious and frighteningly ice-cold dragon arm.\u003c/p\u003e\n\u003cp\u003eLin Dong’s current green dragon arm appeared even more majestic and muscular than before. Waves of light surged on the scales. An indescribable energy ripple spread out in a partially visible manner.\u003c/p\u003e\n\u003cp\u003eHuo Zhen’s heart gradually sunk when he saw this scene. He finally realized that he had underestimated Lin Dong…\u003c/p\u003e\n\u003cp\u003eUnderestimating a foe during a battle would undoubtedly have a price. Therefore, the Yuan Power within Huo Zhen’s body immediately began to circulate wildly when he saw the ice-cold smile that slowly emerged on Lin Dong’s face. Bright golden light erupted from within Hou Zhen’s body.\u003c/p\u003e\n\u003cp\u003eThe golden light surged, but Lin Dong did not move. His green dragon arm grabbed Huo Zhen’s arm and viciously flung itself through the air, directly grabbing the latter and heavily smashed him onto the ground like a whip.\u003c/p\u003e\n\u003cp\u003eBang! Bang! Bang!\u003c/p\u003e\n\u003cp\u003eThe entire ground trembled violently at this moment. When everyone turned to look at Lin Dong, who had become an avatar of violence, they were instantly petrified…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-705\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-707\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-706","bookId":1514,"creation":"Sep 10, 2019 7:28:56 AM","modification":"Sep 10, 2019 7:28:56 AM"}
