{"id":61806,"no":2050,"title":"Chapter 737: An Unforeseen Development","content":"\u003cp\u003eChapter 737: An Unforeseen Development\u003c/p\u003e\n\u003cp\u003e“What arrogant words. After so many years, you are the first person who dares utter such words in front of me.”\u003c/p\u003e\n\u003cp\u003eA mocking smile involuntarily surfaced on Shen Yun’s face when he heard Lin Dong’s words. He had an extraordinary status amongst the disciples in Yuan Gate. Normally, when others saw that he was one of the eight soul generals, even if they did not immediately respect and fear him, no one dared to claim that they would beat him to death like a dog.\u003c/p\u003e\n\u003cp\u003eLin Dong remained indifferent. However, the ferocity within his eyes swiftly accumulated. This unexpected development caused him to be a little fearful. At first, he had already felt that it was inappropriate to bring Ying Huanhuan along. After all, if anything were to happen to her, Lin Dong did not know how to answer to either Ying Xuanzi or Ying Xiaoxiao.\u003c/p\u003e\n\u003cp\u003e“Lin Dong? That Lin Dong who defeated Yao Ling? You guys are from Dao Sect?” Shen Yun appeared to find this name a little familiar. He frowned slightly, before his eyes narrowed as he looked towards the skinny figure.\u003c/p\u003e\n\u003cp\u003e“Ha, no wonder this little beauty has such a terrible attitude. It turns out you guys are those small frys from Dao Sect…” The corners of Shen Yun’s mouth contained a mocking manner as he laughed.\u003c/p\u003e\n\u003cp\u003e“There is no need to leave the Demon Sound Mountain today.” Lin Dong lifted his head, as his lips parted into a smile as he said.\u003c/p\u003e\n\u003cp\u003e“Brat, don’t think that you possess the qualification to be so arrogant in front of me just because you defeated Yao Ling. Your name does possess some reputation within my Yuan Gate. It’s just as well. I will capture you and bring you back to Yuan Gate to allow my Yuan Gate disciples to have a good look at you!” Shen Yun laughed coldly.\u003c/p\u003e\n\u003cp\u003e“Distance yourself from this here and be careful.” Lin Dong turned his head and spoke to Ying Huanhuan.\u003c/p\u003e\n\u003cp\u003e“Yes…” Ying Huanhuan nodded. She was just about to pull back when her expression suddenly changed. Her eyes looked towards the distant forest. A rushing wind sound was suddenly emitted from that spot. A human figure rushed over and appeared at Shen Yun’s side in a couple of flashes.\u003c/p\u003e\n\u003cp\u003e“Eh? You have actually yet to succeed? What is the background of that brat?” The black clothed man, who had just appeared, swept his eyes over Lin Dong and Ying Huanhuan before lifting his brows and asking smilingly.\u003c/p\u003e\n\u003cp\u003e“Heh heh, he is that Lin Dong who defeated Yao Ling. It is rumoured that he is quite an outstanding individual amongst the Dao Sect younger generation members.” Shen Yun replied.\u003c/p\u003e\n\u003cp\u003e“Oh?” The black clothed man seemed to be a little surprised. After which, he laughed, “The disciples of Dao Sect huh. Enemies really cross paths frequently. Although Yao Ling is someone who was expelled from Yuan Gate, it is not up to your Dao Sect to deal with him.”\u003c/p\u003e\n\u003cp\u003eLin Dong observed the black clothed man in front of him. This man had a tall figure and some traces of blood remained on his body. This caused Lin Dong to shift his eyes. He glanced at the surroundings of the Demon Sound Mountain. It seems like those people who had fled from the Demon Sound Mountain previously had all been finished off…\u003c/p\u003e\n\u003cp\u003e“Another eight soul general huh. Yuan Gate has actually dispatched two top disciples from the eight divisions this time around…”\u003c/p\u003e\n\u003cp\u003eThis black clothed man’s aura was not weaker than the white clothed man. Clearly, they were on the same level. From the looks of it, he was definitely also one of the eight soul generals.\u003c/p\u003e\n\u003cp\u003eTwo nine Yuan Nirvana stage experts that were comparable to Yao Ling. This lineup was definitely quite powerful. It was likely that even Lin Dong would find it quite troublesome to deal with them.\u003c/p\u003e\n\u003cp\u003eYing Huanhuan was also clearly aware of this point. Therefore, her body, which was originally planning on pulling back, came to a stop after the black clothed man appeared. She clenched her silver teeth slightly before her hand landed on her Heavenly Phoenix Zither. An unusual dark red light surged deep within her bright alluring eyes.\u003c/p\u003e\n\u003cp\u003e“Finish him off. One each?” The black clothed man smilingly watched the Lin Dong duo and said.\u003c/p\u003e\n\u003cp\u003e“Alright.”\u003c/p\u003e\n\u003cp\u003eShen Yun smiled darkly and nodded. His gaze was sinister as he stared at Lin Dong. “Leave him to me. I will make him understand that regardless of how great his reputation is within the Dao Sect, he is still nothing in the eyes of our Yuan Gate.”\u003c/p\u003e\n\u003cp\u003e“I shall take this little beauty then.”\u003c/p\u003e\n\u003cp\u003eThe black clothed man laughed. His body moved before he rushed explosively towards Ying Huanhuan.\u003c/p\u003e\n\u003cp\u003e“Little Flame!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were icy cold as a deep cry was suddenly emitted from his mouth.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eAn intense rushing wind sound was transmitted over at the same time. A huge stone was ruthlessly swung out from the Demon Sound Mountain. After which, it smashed towards the black clothed man.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eThe black clothed man threw a punch. A powerful force blasted the large stone. After which, his eyes turned cold when he saw a tower-like figure with a fearsome aura appear in front of Ying Huanhuan. His scarlet eyes made one tremble.\u003c/p\u003e\n\u003cp\u003e“Protect her.” Lin Dong pulled back, appeared beside Little Flame and softly said.\u003c/p\u003e\n\u003cp\u003e“Big brother, you can be rest assured that no one will be able to hurt her.” Little Flame grinned. A monstrously ferocious aura swept from within his body. The skin on his body also vaguely showed signs of turning black. Looking from a distance, it appeared as though he was made of metal. Both of his large fists collided gently against each other and actually emitted a metallic ‘clang’ sound.\u003c/p\u003e\n\u003cp\u003e“A mere Demonic Beast. Yet you actually dare to utter such nonsense in front of my Yuan Gate?”\u003c/p\u003e\n\u003cp\u003eAn elderly voice suddenly resounded over the midair in an indifferent manner when Little Flame’s voice had just sounded. Lin Dong and Little Flame’s expressions immediately changed. Lifting their heads, they saw the space above distorting before a brown robed elder slowly appeared.\u003c/p\u003e\n\u003cp\u003eLittle Flame’s eyes stared cautiously at the brown robed elder. He could sense a rich danger from the latter’s body. Immediately, the black colour undulated on his body turned denser. His body tensed up, appearing like a tiger about to pounce on its prey.\u003c/p\u003e\n\u003cp\u003eLin Dong’s expression was a little gloomy. Clearly, he did not expect that Yuan Gate had not only dispatched two of the eight soul generals, but that there was actually also a powerful old man following them.\u003c/p\u003e\n\u003cp\u003eBased on his aura, this old man had definitely reached the Profound Life Stage. He might have even reached the advanced Profound Life Stage...\u003c/p\u003e\n\u003cp\u003eThis situation had really changed a little too quickly…\u003c/p\u003e\n\u003cp\u003e“Where did this old fart come from? You actually dare to act mightily in front of us three brothers? Do you think Grandpa Marten is just a decoration?”\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong’s expression was rapidly changing, a muffled thunder like cry also rumbled from the sky. Immediately, storm clouds surged in the sky before Little Marten appeared in midair in a ghost-like manner. His eyes were ruthlessly staring at the brown robed elder.\u003c/p\u003e\n\u003cp\u003eThe brown robed elder’s eyes also looked at Little Marten, who had just appeared. Promptly, that elder’s face trembled slightly. Clearly, he had also sensed just how difficult it was going to be to deal with the latter.\u003c/p\u003e\n\u003cp\u003e“Elder Jiang, all of you are finally here!”\u003c/p\u003e\n\u003cp\u003eThe miserable looking Yellow Golden Ghost Owl, who was covered in blood, arose into the sky from behind. He immediately rejoiced when he saw the brown robed elder and the rest. Gritting his teeth, he said, “Elder Jiang, this fellow has the strength of an advanced Profound Life Stage expert. He is similar to you. If we join forces, we will definitely be able to kill him!”\u003c/p\u003e\n\u003cp\u003eThe eyes of that old man called Elder Jiang had a dark expression flashing over. However, a smile of agreement surfaced on his face. He laughed, “This time around, this old man has arrived a little late. This caused your Demon Sound Mountain to suffer great losses. However, it is fortunate that we did not allow these villains to escape. Let’s join forces and quickly subdue them.”\u003c/p\u003e\n\u003cp\u003eYing Huanhuan observed the situation before her expression gently changed. If Elder Jiang from Yuan Gate was added into the mix, wouldn’t the other party possess two Profound Life Stage experts?\u003c/p\u003e\n\u003cp\u003e“Little Marten, can you handle it?”\u003c/p\u003e\n\u003cp\u003eA cold light flowed within Lin Dong’s eyes. His eyes looked towards Little Marten, whose handsome face had a dense cold smile hanging on it, and said.\u003c/p\u003e\n\u003cp\u003e“Although it is a little troublesome, it shouldn’t be much of a problem. However, it seems like we can’t even allow one person to escape today.”\u003c/p\u003e\n\u003cp\u003eThe corner of Little Marten’s mouth was lifted. His handsome devil like face had a bloodthirstiness flashing over it. Although he had only only recuperated his powers till the advanced Profound Life Stage, his foundation far exceeded the two in front of him. Hence, once he unleashed his skills, he should stand a good chance of obtaining victory.\u003c/p\u003e\n\u003cp\u003e“Of course, we cannot let them off…”\u003c/p\u003e\n\u003cp\u003eA ferocious glint flashed across Lin Dong’s eyes. He was not a merciful person. Since they were going to fight, he was naturally not going to show any mercy. If one of them were to escape, it would likely cause them an endless amount of trouble in the future.\u003c/p\u003e\n\u003cp\u003e“What an arrogant tone.”\u003c/p\u003e\n\u003cp\u003eElder Jiang smiled in a dense manner. He was also at advanced Profound Life Stage. Now that a ghost owl was added to the mix, he did not believe that Little Marten would be able to stir any trouble.\u003c/p\u003e\n\u003cp\u003e“Shen Yun, Xia Yan, finish them off.”\u003c/p\u003e\n\u003cp\u003e“Martial uncle, please be rest assured.” The Shen Yun duo, who were facing off against Lin Dong and Little Flame, immediately laughed in a dense manner. A murderous desire spread within their eyes.\u003c/p\u003e\n\u003cp\u003e“Can you take care of one?” Lin Dong turned his head, looked at Little Flame and asked faintly.\u003c/p\u003e\n\u003cp\u003e“No problem.”\u003c/p\u003e\n\u003cp\u003eLittle Flame parted his mouth and smiled. His tower like body shook slightly before a tiger roar was seemingly emitted from within his body. Although Little Flame was currently only at eight Yuan Nirvana Stage, his Heavenly Devil Tiger bloodline allowed his fighting strength to be comparable with a nine Yuan Nirvana Stage expert. In fact, the other great general from Demon Sound Mountain earlier was being forcefully ripped into two by him.\u003c/p\u003e\n\u003cp\u003e“In that case…”\u003c/p\u003e\n\u003cp\u003eLin Dong smiled slightly before his eyes suddenly turned dark and cold. Vast and mighty wild Yuan Power fluctuation swept out like a storm in an uncontrolled manner from within his body.\u003c/p\u003e\n\u003cp\u003e“Let’s fight!”\u003c/p\u003e\n\u003cp\u003eAfter his low voice sounded out, it immediately detonated the tensed atmosphere in this place!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-736\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-738\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-737","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
