{"id":61826,"no":2070,"title":"Chapter 757: Does He Want To Die","content":"\u003cp\u003e\u003cstrong\u003eChapter 757: Does He Want To Die\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe middle aged man atop the stone was obviously startled by Lin Dong’s question. Shortly after , his line of sight fluttered to the dull red damaged copper cauldron in Lin Dong’s hands before he asked with a faint smile, “Oh? Why are you interested in it?”\u003c/p\u003e\n\u003cp\u003e“I gained an interest while browsing.”\u003c/p\u003e\n\u003cp\u003eLin Dong chuckled. He naturally knew everyone here was extremely experienced. Although they did not know exactly what every item fished out from Unique Devil Region did, they were very vigilant. Afterall, there were cases where items which looked broken, actually turned out to be invaluable treasures.\u003c/p\u003e\n\u003cp\u003eHearing Lin Dong’s reply, the middle aged man narrowed his eyes a little, before sending his penetrating gaze towards the dull red damaged cauldron. Only after quite a long while did he slowly retract his gaze. He had already done a lot of research, and only after he failed to uncover anything unique about them, did he choose to hawk these items. This was especially the case for the bronze cauldron as there was not the single bit of fluctuation within. Therefore, it was definitely not a Pure Yuan Treasure which had its brilliance concealed.\u003c/p\u003e\n\u003cp\u003e“Do you know what it is?”\u003c/p\u003e\n\u003cp\u003eAs the middle aged man was wrinkling his forehead, Lin Dong waved the bronze cauldron in his hand, before asking him this question.\u003c/p\u003e\n\u003cp\u003e“If I knew, perhaps I wouldn’t even sell it.” said the middle aged man with a smile\u003c/p\u003e\n\u003cp\u003e“How much is it?” asked Lin Dong once again in a soft voice.\u003c/p\u003e\n\u003cp\u003eThe middle aged man hesitated for a while. Promptly, his eyes faintly sparkled before he replied, “ Ten million Nirvana Pills.”\u003c/p\u003e\n\u003cp\u003eAfter he spoke, an uproar emerged among the Dao Sect disciples behind Lin Dong, as they stared at the middle aged man in anger. This fellow did not even know anything about this item, yet he actually dared to quote such an outrageous price.\u003c/p\u003e\n\u003cp\u003e“Sir, aren’t you a little too greedy?’ asked Lin Dong while he faintly wrinkled his brows.\u003c/p\u003e\n\u003cp\u003e“The prices of the items that we sell here, especially those of unknown origin, are quite high. That is because we have to shoulder the burden if a seemingly useless item turns out to be an invaluable treasure…”\u003c/p\u003e\n\u003cp\u003eThe middle aged man shrugged his shoulders and replied, “You have to consider my point of view as well. If this item truly turns out to be a gem, how much blood will I vomit then?”\u003c/p\u003e\n\u003cp\u003e“As if there are so many invaluable dirt covered treasures covered in this world.” said Lin Dong casually. He did not wish to say anything more. After hesitating for a moment, he took out a Qiankun bag. However, after he took out his Qiankun bag, his hand stiffened as he suddenly recalled something. All his Nirvana pills were used by Little Marten to deploy the great array...\u003c/p\u003e\n\u003cp\u003eAlthough Ying Huanhuan had also volunteered her Nirvana Pills, Little Marten only took enough pills from her to supplement the quantity that Lin Dong lacked. Therefore, the current Lin Dong was basically broke.\u003c/p\u003e\n\u003cp\u003eJust as Lin Dong’s body stiffened and he started to feel awkward, a jade-like hand gave a soft wave, throwing a Qiankun Bag at the middle aged man dressed in grey atop of the stone.\u003c/p\u003e\n\u003cp\u003eReceiving the Qiankun Bag, the middle aged man gave it a glance before looking at the slender and elegant young lady standing behind Lin Dong. Following that, he sent a smile towards Lin Dong and said, “You have good luck with women young man.”\u003c/p\u003e\n\u003cp\u003eLin Dong tilted his head and looked towards Ying Huanhuan as he smiled, “Thanks.”\u003c/p\u003e\n\u003cp\u003e“Proper behaviour is based on reciprocity.” replied Ying Huanhuan casually. Her big eyes shot a glance at Lin Dong before retracting. From the looks of it, the young lady seemed a little upset.\u003c/p\u003e\n\u003cp\u003eLin Dong gawked faintly before replying with a single “oh”. Standing up, he conveniently kept the dull red damaged bronze cauldron into his Qiankun bag, before smiling at Ying Xiaoxiao and the rest, “We should leave too.”\u003c/p\u003e\n\u003cp\u003eAfter saying that, he took the lead by turning around to walk away. At his back, the Dao Sect disciples also flocked and followed behind.\u003c/p\u003e\n\u003cp\u003eYing Huanhuan looked at Lin Dong’s back before her pearly teeth bit her lips. A sliver of complain seemingly flashed past her eyes, however, it was at this moment that she was dragged along by Ying Xiaoxiao.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eWhen Lin Dong and the rest returned to their inn, they saw Qi Lei, Chen Zhen and the other two hall masters standing there with stern expressions on their faces. Behind them were quite a number of Dao Sect disciples. Upon realizing that Lin Dong and the rest had returned, all of them clearly heaved a sigh of relief.\u003c/p\u003e\n\u003cp\u003e“Did you guys clash with members from Yuan Gate?” asked Qi Lei in a low voice with a frown as he stared at Lin Dong, Ying Xiaoxiao and the rest.\u003c/p\u003e\n\u003cp\u003eLin Dong helplessly nodded his head and was just about to speak when Qi Lei opened his mouth again, “I heard that you managed to force Lei Qian to back off?”\u003c/p\u003e\n\u003cp\u003eLin Dong gawked. This piece of news has travelled really fast. Slightly hesitating, he nodded his head again and said, “I used a little trick.”\u003c/p\u003e\n\u003cp\u003e“Haha, just like I told you. How can this brat be that easy to deal with. He has a belly filled with tricks and even Lei Qian would not be able to easily deal with him.” Right after Lin Dong replied, Chen Zhen could not resist and started to laugh. His laughter contained an unconcealable satisfaction.\u003c/p\u003e\n\u003cp\u003eLin Dong and the rest stared in astonishment at the four headmasters who had suddenly started chuckling. Looking at their appearance, it truly seemed like they were not here to lecture them...\u003c/p\u003e\n\u003cp\u003e“Well done. Although you have to consider the big picture sometimes, those despicable scoundrels do need to be taught a lesson.” said Qi Lei with a smile as he rubbed his chin.\u003c/p\u003e\n\u003cp\u003eIn response to this scene, the only thing Lin Dong could do was to dryly laugh twice.\u003c/p\u003e\n\u003cp\u003e“The Great Sect Competition has yet to begin, yet you guys have already clashed with Yuan Gate. If you think about it, when you guys meet again in Unique Devil Region, there will definitely be quite a few clashes. At that time, all of you will have to be careful.” said Chen Zhen as his face started to turn serious after laughing.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eLin Dong, Ying Xiaoxiao and the rest all nodded their heads. They knew that there was a deep grudge between them and Yuan Gate. In addition to today’s incident, the number of conflicts that would arise when they met in the future would definitely increase.\u003c/p\u003e\n\u003cp\u003e“Ok, you should all go and have a rest now. The Great Sect Competition will start in two days. During these two days, you all should restrain yourselves and not cause any further problems. Unique Devil City is a chaotic place filled with all sorts of individuals. Don’t cause any unnecessary trouble.” said Qi Lei with a smile as he waved his hands.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eUpon hearing his words, all of the disciples nodded their heads before scattering.\u003c/p\u003e\n\u003cp\u003e“This brat is truly full of surprises. Lei Qian’s body has likely begun to produce Life Qi already. However, he was still forced to back off by Lin Dong…” looking at the direction which Lin Dong and the rest had scattered, Qi Lei could not help but mumble his thoughts.\u003c/p\u003e\n\u003cp\u003e“This little fellow has quite a few tricks up his sleeves. It is not so easy to deal with him.” said Chen Zhen with a smile.\u003c/p\u003e\n\u003cp\u003e“However, we cannot be complacent. Lei Qian is the weakest amongst the three little kings of Yuan Gate. The Little Yuan King and Little Spirit King are the more problematic ones. Before the Great Sect Competition begins, we should warn Lin Dong and the rest to be more careful.” said Qi Lei while shaking his head.\u003c/p\u003e\n\u003cp\u003eUpon hearing his words, the smiles on the faces of Chen Zhen and the other two hall masters turned slightly restrained before sighing softly. The three little kings of Yuan Gate were indeed formidable opponents. They did not know whether Lin Dong and the rest would be able to handle them if they were to encounter them in Unique Devil Region...\u003c/p\u003e\n\u003cp\u003eThey could only hope that they would not suffer the same disastrous loss as they did in the previous Great Sect Competition...\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eNight fell and gradually enveloped the enormous Unique Devil City. Meanwhile, the clamor during the day gradually started to die down under the cooling night breeze.\u003c/p\u003e\n\u003cp\u003eIn another corner of the city was a expansive courtyard with quite a few individuals shuttling back and forth. This was the lodging area for Yuan Gate in Unique Devil City.\u003c/p\u003e\n\u003cp\u003eCurrently, there were three figures within a quiet courtyard located deep in the large compound. One of them was the Little Thunder King, Lei Qian that had crossed blows with Lin Dong previously.\u003c/p\u003e\n\u003cp\u003eIn front of Lei Qian, a handsome man dressed in white robes reclined on a patch of grass with a leaf hanging out of his mouth. With his hands placed behind his head, he lazily watched the night sky. After a long while, his gaze fluttered before he shot a glance at Lei Qian and said, “I heard that you were forced to run with your tail between your legs by a new Dao Sect disciple in the Treasure Seeking District?”\u003c/p\u003e\n\u003cp\u003e“I was merely careless and was hit by that brat. In a real fight, I’ll crush all of the bones in that brat’s body within ten moves!” Lei Qian frowned before he coldly chuckled.\u003c/p\u003e\n\u003cp\u003e“Heh, you are the only one capable of losing a sure bet, am I right boss?” said the man in white with a grin on his, face before tilting his head to look behind. There was man dressed in green sitting quiet with his legs crossed.\u003c/p\u003e\n\u003cp\u003eIf one was to talk about appearances, he would definitely not be as elegant as the man in white. However, he was well worth a second look. His pair of eyes were prominently long and narrow, giving him a very favourable look.\u003c/p\u003e\n\u003cp\u003eAt this time, his head was bent downwards as he slowly wiped the iron sword in his hand. It was as if he did not have any interest in the dispute between Lei Qian and the man in white.\u003c/p\u003e\n\u003cp\u003e“ If you feel that you have been disrespected, go and take back your face by yourself during the Great Sect Competition. You will meet him there eventually.” said the man in green while focusing on the iron sword in his hand, before giving a faint smile. His smile looked like the edge of a sword.\u003c/p\u003e\n\u003cp\u003e“The debt will naturally be claimed!”\u003c/p\u003e\n\u003cp\u003eSaid Lei Qian with gloom filling his eyes. He suddenly said, “In addition, that brat called Lin Dong seemed to have met up with Ling Qingzhu today. From the looks of it, they seem to be quite close.”\u003c/p\u003e\n\u003cp\u003eRight after he said those words, a smile that was not a smile appeared on the man dressed in white, before he tilted his head and looked towards the man dressed in green who was wiping his iron sword.\u003c/p\u003e\n\u003cp\u003eThe speed at which he wiped the iron sword subtly slowed down, before he faintly wrinkled his eyebrows. In the next moment, he raised his head and looked at Lei Qian. As if he was talking to himself, he muttered, “ Does he… want to die?”\u003c/p\u003e\n\u003cp\u003eAfter his soft voice rang out, a gale suddenly swept across the courtyard. Instantly, the ground was sliced to pieces by dozens of deep slashes which depths cannot be measured.\u003c/p\u003e\n\u003cp\u003eWhen they saw this scene, Lei Qian and the man dressed in white looked at each other, before they shrugged their shoulders. It seems like the Dao Sect will suffer a bloodbath during the upcoming Great Sect Competition...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-756\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-758\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-757","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
