{"id":61831,"no":2075,"title":"Chapter 762: Mysterious Life Bone Beads","content":"\u003cp\u003e\u003cstrong\u003eChapter 762: Mysterious Life Bone Beads\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe land shook and continued to collapse. Those man-sized black monsters surged out like floodwaters. Sharp claws and teeth flickered with a cold glint that caused one’s heart to feel fear. A vague but extremely powerful energy fluctuation was emitted. These monsters clearly possessed an extremely great power.\u003c/p\u003e\n\u003cp\u003eHowever, those from Dao Sect were clearly not the only ones who were attacked by these monsters called Devil Ants. Soon after the commotion here, some exclamations were also heard from a distance away. After which, some miserable screams sounded out. It was likely that someone had already been killed.\u003c/p\u003e\n\u003cp\u003eIn an instant, this area of the black desolated plains had become extremely chaotic.\u003c/p\u003e\n\u003cp\u003eBang bang!\u003c/p\u003e\n\u003cp\u003eLin Dong held the black tree in his hand. Fierce and violent force unfurled as it danced. It directly slammed into the charging Devil Ants till the bones all over their bodies were broken. Although his attack was ferocious, the Devil Ants were also unafraid of death. They continued to charge over from all directions. Their numbers caused Lin Dong to frown deeply.\u003c/p\u003e\n\u003cp\u003eAfter their initial panic, the Dao Sect disciple began to display the strength of a super sect. They cooperated with each other and blocked the Devil Ants’ attacks. However, some people still ended up being injured. Fortunately, their lives were not threatened.\u003c/p\u003e\n\u003cp\u003e“These Devil Ants are great in numbers. Moreover, their flesh is extremely thick and hard. If we drag it out with them here, it is likely that we will be eaten by them once our Yuan Power is exhausted!”\u003c/p\u003e\n\u003cp\u003eYing Xiaoxiao knitted her umber black brows when she spoke of this point. She muttered, “However, why have they appeared in the outer parts of Unique Devil Region? Normally, Devil Ants will only appear in the more central middle areas…”\u003c/p\u003e\n\u003cp\u003e“It is very difficult to break free…”\u003c/p\u003e\n\u003cp\u003eLin Dong watched the densely packed black sea of ants and felt a headache. It was unexpected that they would end up encountering such a troublesome situation the moment they entered Unique Devil Region. The dangers of Unique Devil Region did indeed live up to its reputation. If he was alone, it would naturally not be difficult to escape. However, he clearly needed to protect the other Dao Sect disciples.\u003c/p\u003e\n\u003cp\u003eYing Xiaoxiao and Wang Yan also frowned. Their eyes flickered as they continued to think of a plan to escape.\u003c/p\u003e\n\u003cp\u003e“These damn things. Why are all of them heading my way!” While they were frowning in deep thought, Ying Huanhuan shouted as her small face turned a little green.\u003c/p\u003e\n\u003cp\u003eThe eyes of Lin Dong’s group drifted over when they heard this. Sure enough, they discovered that those Devil Ants seemed to be continuously charging towards Ying Huanhuan’s location. The sharp claws and teeth that could easily tear the Nirvana Golden Armour of a six Yuan Nirvana stage expert were aimed at all vital points from all directions.\u003c/p\u003e\n\u003cp\u003e“This…”\u003c/p\u003e\n\u003cp\u003eLin Dong was slightly startled. Soon after, his eyes faintly flickered. These Devil Ants did not possess great intelligence. However, their target was unusually clear. Ying Huanhuan was not the strongest within this group of theirs. Yet, why were these fellows so fixated on killing her? Could it be that through their instincts, they had sensed that Ying Huanhuan was the most dangerous in this group?\u003c/p\u003e\n\u003cp\u003eLin Dong knitted his brows. Although Ying Huanhuan was a Reincarnator, she had clearly yet to awaken. He did not believe that these low intelligence beings could discover this extremely hidden identity of hers…\u003c/p\u003e\n\u003cp\u003eHowever, if it was not because of her status as a Reincarnator, then what was the reason?\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes flickered rapidly. In the next moment, his pupils suddenly shrunk.\u003c/p\u003e\n\u003cp\u003eOther than her Reincarnator identity, Ying Huanhuan seemed to possess something that they did not… it was her sonic attack capabilities!\u003c/p\u003e\n\u003cp\u003e“Huanhuan, use your sonic wave attack to hypnotise them!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s body moved and appeared beside Ying Huanhuan. The black tree was swung violently, smashing a couple of Devil Ants into slime. At the same time, he spoke in a low voice.\u003c/p\u003e\n\u003cp\u003e“My sonic wave hypnosis can be completely ignored as long as one’s Mental Energy is a little stronger!” Ying Huanhuan was startled momentarily as she replied.\u003c/p\u003e\n\u003cp\u003e“These things do not possess any Mental Energy. They might be terrible beasts to others but they do not possess any ability to defend against you.” Lin Dong said. When he smashed these Devil Ants into pieces earlier, he was able to sense they did not possess even the slightest bit of Mental Energy within their bodies.\u003c/p\u003e\n\u003cp\u003eYing Huanhuan hesitated for a moment before finally nodding her head. Immediately, she waved her hand gently. An emerald like ancient jade green zither appeared with a flash. Her fingers gently plucked the strings and gentle zither music swiftly spread while accompanied by a strange fluctuation.\u003c/p\u003e\n\u003cp\u003eBam bam bam bam!\u003c/p\u003e\n\u003cp\u003eJust as the zither music appeared, Lin Dong and the rest immediately saw that those originally fiercely attacking Devil Ants had slowed down. In the end, they directly fainted with a crashing sound.\u003c/p\u003e\n\u003cp\u003eEveryone was momentarily stunned as they watched the ant tide that had originally caused them to fall into a dangerous situation, become so helpless against the zither sound. It was indeed true that everything in the world had something that counteracted and neutralized each other. Who could imagine that this ant tide, which Lin Dong and the rest did not dare to get entangled with and could only retreat in response, would actually be completely defeated by Ying Huanhuan’s zither music…\u003c/p\u003e\n\u003cp\u003e“Go!”\u003c/p\u003e\n\u003cp\u003eLin Dong, Ying Xiaoxiao and the rest sighed in relief. The latter let out a soft cry and led the group to quickly leave this dangerous place.\u003c/p\u003e\n\u003cp\u003e“Big sis, there seems to be something underground!” However, Ying Huanhuan suddenly spoke hesitatingly just as they were planning to use this opportunity to leave this place.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eLin Dong, Ying Xiaoxiao and Wang Yan were momentarily startled. Their footsteps also slowed. After which, they threw their uncertain eyes towards Ying Huanhuan.\u003c/p\u003e\n\u003cp\u003eYing Huanhuan knitted her brows slightly. Her hand suddenly swept pass the zither strings as a sonic wave directly erupted from it. After which, everyone watched as the black ant tide that had surged out from underground acted like a large hand being opened, revealing the black soil below.\u003c/p\u003e\n\u003cp\u003eThe ant tide separated, revealing a large brown rock deep within the ground. At this moment, there were a couple of figures seated on the rock.\u003c/p\u003e\n\u003cp\u003e“Those are…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s group was startled as they gazed at the figures seated underground. After a closer inspection, they discovered that they appeared to be some mummified corpses.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, look at the Dantian of those corpses!” Ying Xiaoxiao softly said.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes looked over. Immediately, his pupils shrunk. He could see a cluster of white light at the Dantian of those corpses. Within these white lights, there seemed to be a pill like object steathily rotating. A kind of majestic Life Qi that caused one’s expression to be slightly altered was emitted from it.\u003c/p\u003e\n\u003cp\u003e“This is… the Mysterious Life Bone Bead? Damn, these mummified corpses were likely experts at the advance Mysterious Life stage or even the perfect Mysterious Life stage!” Emotions also rushed out on Wang Yan’s face at this moment. His low voice contained rich shock.\u003c/p\u003e\n\u003cp\u003eMysterious Life Bone Beads. It would only be gradually formed when the life force within the body of an advance Mysterious Life stage or perfect Mysterious Life stage practitioner did not scatter after dying. It contained a rather vigorous Life Qi within it and possessed a great allure for those who are at the peak of the nine Yuan Nirvana stage. If one was lucky enough, one might even be able to use it to touch the door of the Mysterious Life stage!\u003c/p\u003e\n\u003cp\u003eThis thing would definitely be extremely rare in the outside world. Unexpectedly, they had come across it after having only just entered Unique Devil Region.\u003c/p\u003e\n\u003cp\u003eEven Lin Dong’s eyes had a fiery hot expression surging within it when faced with such a treasure.\u003c/p\u003e\n\u003cp\u003e“No wonder an ant sea of such a scale had appeared in this place. They were here for the Mysterious Life Bone Beads…” Ying Xiaoxiao came to a sudden understanding.\u003c/p\u003e\n\u003cp\u003e“Shall we take them?” Wang Yan looked towards Lin Dong and Ying Xiaoxiao. The latter two exchanged glances, before lightly gritting their teeth and nodding. Since they had found such treasures, there was no reason to easily give them up.\u003c/p\u003e\n\u003cp\u003eYing Huanhuan watched the three excited individuals, and hesitated for a moment. As those large eyes of hers observed the corpses, unease flashed across them for some unknown reason.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eHowever, just when the Lin Dong trio had made up their mind and were preparing to take action, an extremely deafening sword whistling sound suddenly appeared in the distant. After which, everyone from Dao Sect was startled. They saw a bright light surging in the distance. The light directly transformed into an enormous light sword, while an ear-piercing sword whistle spread outwards. Immediately, it tore through the sea of ants with shocking speed and appeared in the air above Lin Dong’s group.\u003c/p\u003e\n\u003cp\u003e“Members of the Sword Sect?”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes immediately narrowed when he saw the light sword that had suddenly appeared.\u003c/p\u003e\n\u003cp\u003e“Ha ha, I was wondering why a sea of ants of such scale had appeared in the outer parts of Unique Devil Region. Turns out that it is not without reason…”\u003c/p\u003e\n\u003cp\u003eThe light sword in the air gradually dimmed, revealing a large group of people. A gray clothed man smilingly looked at Lin Dong’s group from the front of the group. After which, he rotated his eyes and stared at the corpses on the brown rock with fiery hot eyes.\u003c/p\u003e\n\u003cp\u003eThe many Dao Sect disciples also revealed a cautious expression in their eyes due to the arrival of the Sword Sect disciples. A mighty Yuan Power fluctuation faintly emerged.\u003c/p\u003e\n\u003cp\u003eThe gray clothed man looked at Lin Dong’s group. His eyes flickered before laughing, “I am Xue Ling of Sword Sect. Haha, friends from Dao Sect, shall we divide these Mysterious Life Bone Beads equally?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-761\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-763\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-762","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
