{"id":59967,"no":211,"title":"Chapter 211: Massive Surge in Strength","content":"\u003cp\u003e\u003cstrong\u003eChapter 211: Massive Surge in Strength\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eA figure silently sat on a boulder in the quiet mountain cave. An ice-cold bronze color covered every part of his body, while giving off a cold and bold aura of strength.\u003c/p\u003e\n\u003cp\u003eConcealed under this bronze color seemed to be the patterns of power!\u003c/p\u003e\n\u003cp\u003eWhile power gushed about under that bronze layer, another invisible power slowly spread out from the figure and filled the entire mountain cave. This was Mental Energy.\u003c/p\u003e\n\u003cp\u003eEvidently, while Lin Dong’s Yuan Power started to grow stronger, a revolutionary change was also occurring in his Niwan Palace.\u003c/p\u003e\n\u003cp\u003eThree Destiny Soul Symbols floated within his Niwan Palace, as they took in and spit out vigorous Mental Energy. There was already a deep crack on the Soul Symbol in the middle. This was a sign that it was splitting into a fourth seal!\u003c/p\u003e\n\u003cp\u003e“Crack crack!”\u003c/p\u003e\n\u003cp\u003eTraces of lightning flickered in the Niwan Palace, as the crack on the Destiny Soul Symbol grew increasingly larger, while the rate at which the Soul Symbol vibrated intensified.\u003c/p\u003e\n\u003cp\u003e“Buzz buzz!”\u003c/p\u003e\n\u003cp\u003eDuring this splitting process, his entire Niwan Palace began to vibrate gently. Meanwhile, the Mental Energy brewing within began to grow rapidly!\u003c/p\u003e\n\u003cp\u003e“Crack!”\u003c/p\u003e\n\u003cp\u003eThe vibrations did not continue for long. Suddenly, an extremely clear sound softly echoed out inside his Niwan Palace. Soon after, Lin Dong saw the crack had finally extend to the limit, before his Soul Symbol split into two Soul Symbols and gently drifted apart.\u003c/p\u003e\n\u003cp\u003eThe fourth seal!\u003c/p\u003e\n\u003cp\u003eThe fourth Destiny Soul Symbol had finally emerged after splitting!\u003c/p\u003e\n\u003cp\u003e“Buzz!”\u003c/p\u003e\n\u003cp\u003eWhen the fourth seal emerged, a storm seemingly erupted inside his Niwan Palace, as invisible Mental Energy, filled electrical sparks, swiftly gathered together and formed into a mini Mental Energy hurricane. As the hurricane howled, an extremely formidable Mental Energy shockwave frantically spread forth.\u003c/p\u003e\n\u003cp\u003eThis time, the Mental Energy inside Lin Dong’s Niwan Palace had increased by at least five fold. Hence, he could now finally be called a proper fourth seal Symbol Master!\u003c/p\u003e\n\u003cp\u003eJust as this huge revolution occurred in his Niwan Palace, the situation in Lin Dong’s body did not fall behind. As streams of potent Great Sun Thunder Yuan poured into his Dantian, his originally walnut-sized dark golden Yuan Dan became increasingly shiny. Meanwhile, its size had grown to that of a baby’s fist and the Yuan Power contained within was totally incomparable to before!\u003c/p\u003e\n\u003cp\u003eThe golden Yuan Dan hovered inside his Dantian, as it continuously swirled at a steady rate. As it slowly swirled, the powerful Great Sun Thunder Yuan inside his Dantian was just like a tidal wave, howling around like a resplendent rainbow!\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eWhen that howling Yuan Power and the Mental Energy shockwave from his Niwan Palace brewed till a certain point, they suddenly erupted just like a volcano that had lain dormant for a long time!\u003c/p\u003e\n\u003cp\u003eAn extremely deep roar violently exploded forth from Lin Dong’s body. Inside the cave, his tightly shut eyes suddenly opened, as a tyrannical and formidable golden glow shimmered within his eyes.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eAn invisible shockwave erupted from his body, causing some of the rocks surrounding him to be instantly reduced into dust. In fact, it even caused several arm-sized cracks to form on the cave walls.\u003c/p\u003e\n\u003cp\u003e“Phew…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes scanned his surroundings, as an extremely formidable aura slowly spread out from his body. Compared to before, his aura was now several times stronger!\u003c/p\u003e\n\u003cp\u003e“Form Creation stage!”\u003c/p\u003e\n\u003cp\u003eAn unconcealable joy surfaced in Lin Dong’s eyes. This step… thanks to the thunder source, he had finally accomplished it!\u003c/p\u003e\n\u003cp\u003eBased on Lin Dong’s original speed, if he wanted to breakthrough from perfect Yuan Dan stage and reach Form Creation stage, it would take him several month’s time. However, this thunder source, which he had stumbled upon, managed to shrink this time dramatically.\u003c/p\u003e\n\u003cp\u003eLin Dong slowly extended his hand, before he suddenly clenched his fist. Promptly, golden Great Yuan Thunder Yuan gushed out from his palm before quickly gathering in front of him. In a flash, they actually formed a giant golden beast. Based on its appearance, it was a Thunder Crystal Beast!\u003c/p\u003e\n\u003cp\u003eHowever, this Thunder Crystal Beast that was created from Yuan Power only possessed the form and not the essence of the real beast. If one wanted to create a realistic Yuan Power object, one would need to advance to the Qi Creation stage.\u003c/p\u003e\n\u003cp\u003eOf course, despite this, the ‘Thunder Crystal Beast’ formed by Yuan Power had a strong attacking power. Creating objects to attack was the trademark and signature move of a Creation stage expert!\u003c/p\u003e\n\u003cp\u003eLin Dong was extremely excited as he manipulated his Yuan Power to create all sorts of objects. With regards to creating these objects, Lin Dong had a substantial advantage over other ordinary Form Creation stage practitioners. This was because he also possessed powerful Mental Energy which increased his proficiency in manipulating Yuan Power.\u003c/p\u003e\n\u003cp\u003e“Is this the power of the Creation stage…”\u003c/p\u003e\n\u003cp\u003eLin Dong stared at that ever-changing Yuan Power that he was manipulating, as an excited glint flashed across his eyes. In the past, he could only create objects by borrowing the ability of the Ancient Heavenly Scales Halberd. That was also the only way for him to fully maximize the strength of his halberd. However, now that he had finally advanced to the Form Creation stage, in the future, even if he lost his Ancient Heavenly Scales Halberd, he could still execute the Ancient Heavenly Scales Halberd techniques!\u003c/p\u003e\n\u003cp\u003eAfter playing around for a while, Lin Dong finally recalled that ball of Yuan Power into his body. As he lowered his head to look at his body, a look of shock flashed across his eyes. Right now, his body seemed like a copper statue which was cold and solid upon contact.\u003c/p\u003e\n\u003cp\u003e“Creak!”\u003c/p\u003e\n\u003cp\u003eLin Dong slowly clenched his fist, as he clearly felt the formidable force gathering in his palm. Right now, he had every confidence that he could defeat a perfect Yuan Dan stage practitioner with a single punch even without using Yuan Power. In fact, even if a Form Creation stage practitioner took the hit, he would likely suffer as well.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eLin Dong lowered his head before he viciously punched a two man tall boulder. His fist was just like a knife slicing through tofu, as his entire arm easily penetrated the rock. As he jerked his arm, a stealthy force exploded inside the boulder, as it shattered to pieces with a loud bang.\u003c/p\u003e\n\u003cp\u003e“Such a powerful force!”\u003c/p\u003e\n\u003cp\u003eAs he felt the powerful force surging below his skin, Lin Dong’s breathing involuntarily turned a little ragged. This Bronze Thunder Body was truly formidable. With this thing protecting his body, even an ordinary Soul Treasure would be unable to hurt him!\u003c/p\u003e\n\u003cp\u003e“Form Creation stage! Fourth seal Symbol Master, Bronze Thunder Body!”\u003c/p\u003e\n\u003cp\u003eLin Dong slowly stretched his arms. Right now, his Yuan Power, Mental Energy and the power of his body, was several times stronger compared to the time when he had just left Yan City. It seems like his decision to embark on this training trip was the right one!\u003c/p\u003e\n\u003cp\u003e“Little Flame is still in a deep slumber.” The bronze colour on Lin Dong’s body slowly faded away as his naked body was revealed. Taking out the clothes from his Qiankun bag, he put them on before he turned to look at a lightning cocoon beside him. Right now, the surface of this cocoon seemed more solid than before, while electrical sparks flickered around. Furthermore, thanks to his surge in Mental Energy, Lin Dong could clearly feel that the life-force within was still extremely vigorous. It seems like Little Flame’s training was not yet complete.\u003c/p\u003e\n\u003cp\u003e“Kid, this time you have truly struck gold…” Little Marten emerged from the stone talisman embedded inside Lin Dong’s palm, before it looked at the latter in awe. Evidently, it was also truly awed by the progress that he had made.\u003c/p\u003e\n\u003cp\u003e“That thunder source was indeed something good.”\u003c/p\u003e\n\u003cp\u003eLin Dong softly chuckled. If it was not for the thunder source, it would be impossible for his strength to grow by leaps and bounds in just a few day.\u003c/p\u003e\n\u003cp\u003e“Even though you have just advanced to the Form Creation stage, if it is a one-to-one fight, you should be able to defeat an initial Form Creation stage practitioner.” Little Marten said.\u003c/p\u003e\n\u003cp\u003e“Defeat one eh…”\u003c/p\u003e\n\u003cp\u003eWhen he heard these words, the corners of Lin Dong’s lips twitched a little as a golden glow shimmered in his eyes and revealing the formidable aura of his Great Sun Thunder Yuan. His ambition was evidently greater than that.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eAs the golden glow flashed across Lin Dong’s eyes, an loud earth-shattering sound suddenly echoed out. Promptly, a huge crack emerged in the entire cave, as boulders began to fall. Evidently, this cave was about to collapse.\u003c/p\u003e\n\u003cp\u003e“Heh, those fellows have finally shown up…”\u003c/p\u003e\n\u003cp\u003eWhen it saw this situation, Little Marten could not help but smile: “Two initial Form Creation practitioners. How about it, can you handle it?”\u003c/p\u003e\n\u003cp\u003e“Just leave it to me…”\u003c/p\u003e\n\u003cp\u003eWhen he heard these words, Lin Dong softly chuckled, as the golden glow in his eyes turned increasingly resplendent.\u003c/p\u003e\n\u003cp\u003e...\u003c/p\u003e\n\u003cp\u003eOutside the mountain cave were numerous figures. The Di and Liu Family troops had thoroughly surrounded the place. Meanwhile, Di Teng and Liu Kui were both standing atop a giant tree, as they coldly stared at that mountain cave that was about to collapse. After searching for several days, they had finally confirmed that Lin Dong was hiding there.\u003c/p\u003e\n\u003cp\u003e“This time, I want to see how that little bastard can escape!”\u003c/p\u003e\n\u003cp\u003eAs they gazed at the surrounding troops, the killing intent inside the Di Teng duo’s eyes intensified.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eUnder the stares of the crowd, that mountain cave finally collapsed. However, just as the crowd planned to make their move, the falling giant boulders suddenly stopped in mid-air, as if time had come to a stand still.\u003c/p\u003e\n\u003cp\u003e“Swish!”\u003c/p\u003e\n\u003cp\u003eWhile quite a number of people were shocked by this sight, those giant boulders suddenly flew forth. With a wind sound, they viciously slammed into the troops, causing them to dodge hurriedly like frantic chickens and dogs.\u003c/p\u003e\n\u003cp\u003e“Mental Energy!”\u003c/p\u003e\n\u003cp\u003eWhen they saw that giant boulder that suddenly flew forth, a cold glint flashed across Di Teng’s and Liu Kui’s eyes. Immediately, both of them simultaneously attacked, as vigorous Yuan Power directly turned the giant boulders to dust.\u003c/p\u003e\n\u003cp\u003e“Little bastard, come out now!” Di Teng’s expression was dark, as he shouted menacingly.\u003c/p\u003e\n\u003cp\u003e“Haha, my old friend Di Teng, why are you in such a hurry. You guys have brought so many troops along. Could you still afraid that I will escape?”\u003c/p\u003e\n\u003cp\u003eA light laughter sounded out from the collapse mountain cave, as a figure stepping on a blade slowly emerged in front of Di Teng and the rest. However, just as he appeared, an exceedingly powerful aura exploded forth from his body like a typhoon!\u003c/p\u003e\n\u003cp\u003e“Form Creation Stage!”\u003c/p\u003e\n\u003cp\u003eAs they sensed the formidable aura from Lin Dong’s body, Di Teng’s and Liu Kui’s facial expressions finally turned exceedingly grim.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-210\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-212\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-211","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
