{"id":61870,"no":2114,"title":"Chapter 801 - Yuan Cang’s Spirit Emblem","content":"\u003cp\u003eMonstrous Yuan Power surged in the distant sky. Two light figures tore through the sky while accompanied by an extremely fierce and aggressive undulation. Finally, they collided with a loud bang before countless onlooking eyes that were filled with emotion.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eA sudden clap of thunder rumbled the moment they collided. Wave after wave of Yuan Power ripples, which were visible to the naked eyes, spread apart. Two figures shot backwards, their feet stepping on the air, before they finally stabilized themselves.\u003c/p\u003e\n\u003cp\u003eYuan Cang waved his sleeve, completely eliminating the force within his body. His eyes looked at Chen Gui in the distance as he faintly smiled, “It has been a long time since we have exchanged blows, but you have indeed improved quite a bit.”\u003c/p\u003e\n\u003cp\u003e“Likewise.” Chen Gui clenched his hand. Grayish-black Yuan Power shuttled and gathered on his palm. He glanced indifferently at Yuan Cang before speaking in an indifferent voice.\u003c/p\u003e\n\u003cp\u003e“It seems that the Dao Sect disciples are no match for our Yuan Gate…” Yuan Cang smilingly watched the area below. It was obvious that Yuan Gate had obtained the upper hand in the chaotic battle between the two parties.\u003c/p\u003e\n\u003cp\u003eChen Gui frowned slightly. He looked to where Qingtan was located. Worry involuntarily flashed across his eyes when he saw that the latter was actually facing two nine Yuan Nirvana stage experts on her own. Although he was clearly aware of some techniques of this junior of his, he would likely be severely scolded by their master if anything were to happen to her here.\u003c/p\u003e\n\u003cp\u003e“Looks like… I’ll have to defeat you first.” Chen Gui’s eyes flickered as he slowly said. The Yuan Gate’s morale would definitely take a huge hit if he defeated Yuan Cang.\u003c/p\u003e\n\u003cp\u003e“Are you certain that you can do it?” A playful smile surfaced on Yuan Cang\u0027s lips as he laughed.\u003c/p\u003e\n\u003cp\u003eChen Gui did not speak. He merely slowly rolled up his sleeve. Soon after, strange black threads seeped out from under his skin. In a split second, they caused both of his arms to become pitch-black as ink. His sharp fingernails were suffused with a black light, while vaguely emitting a strange chill.\u003c/p\u003e\n\u003cp\u003eYuan Cang’s eyes narrowed as he watched this from afar. The cold look in his eyes became even colder.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003ePang Tong’s expression was ferocious. His Yuan Power covered fist viciously smashed into the chest of a Yuan Gate disciple. The fierce and violent strength directly caused the latter’s chest to sink in. That Yuan Gate disciple spat out a mouthful of fresh blood as he feebly collapsed.\u003c/p\u003e\n\u003cp\u003e“Senior brother Pang, be careful!”\u003c/p\u003e\n\u003cp\u003eA cry suddenly sounded behind him when Pang Tong dealt the fatal blow to the Yuan Gate disciple in front of him with a punch. Quickly after, his heart shivered as his body suddenly shifted to the left.\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eA sharp sword glow rushed pass and directly traced across Pang Tong’s arm, forming a deep bloody wound that made his bone visible. Fresh blood immediately gushed out.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eWhen the sword glow failed to strike Pang Tong’s fatal spot, that Yuan Gate disciple immediately strided forward with a dark look on his face. The sword in his hand was like a viper that intended to strike at Pang Tong’s throat.\u003c/p\u003e\n\u003cp\u003eClang clang!\u003c/p\u003e\n\u003cp\u003eA figure strided forward from behind Pang Tong just as the sword glow was about to shoot out. A huge blade was swung like a windmill and directly blocked the sword glow of that Yuan Gate disciple. Soon after, the blade jolted and that Yuan Gate disciple ended up vomiting blood as he retreated.\u003c/p\u003e\n\u003cp\u003e“Senior brother Pang, are you alright?’ Jiang Hao stood back to back with Pang Tong. He wiped off the blood on his face as he asked.\u003c/p\u003e\n\u003cp\u003e“I’m fine, thanks.” Pang Tong shook his head. He circulated his Yuan Power and halted the blood gushing from his arm. His eyes swept around, and his expression sank. The difference in the strength of both parties had begun to show as the bloody battle dragged on. Some of the Dao Sect disciples were already beginning to show signs of having Yuan Power exhaustion.\u003c/p\u003e\n\u003cp\u003e“The situation is not good.” Jiang Hao’s expression was grim as he commented in a deep voice. Even the more outstanding disciples like them were already injured at this moment. It was likely that the injuries of the other disciples were even more severe.\u003c/p\u003e\n\u003cp\u003ePang Tong nodded. Yet, both parties had already fought to the point of losing control and there was no way to stop.\u003c/p\u003e\n\u003cp\u003e“If Lin Dong still doesn’t hurry up and return, it is likely that we will really be unable to endure any longer! Senior sister Xiaoxiao and senior brother Wang Yan can barely stop Ling Zhen and Lei Qian!” Jiang Hao said.\u003c/p\u003e\n\u003cp\u003e“Stop uttering such nonsense. Junior brother Lin Dong will reach in time.” Pang Tong frowned and chided. He was just about to attack again, when his expression suddenly changed. He abruptly lifted his head, and he looked at the highest spot in the sky. An enormous fluctuation was emitted from that spot.\u003c/p\u003e\n\u003cp\u003eThat ripple was extremely majestic. Hence, it had immediately attracted countless gazes. After which, all of them saw that Chen Gui’s black arms were emitting rays of black light amidst the grayish-black Yuan Power in the sky.\u003c/p\u003e\n\u003cp\u003e“What a powerful ripple… Chen Gui is planning to deliver a deadly blow.”\u003c/p\u003e\n\u003cp\u003e“Looks like he intends to quickly defeat his opponent. However, Yuan Cang is no pushover...”\u003c/p\u003e\n\u003cp\u003eAll eyes were gathered at the highest spot in the sky. They knew that the battle there would determine the victor of this great battle between both parties. Regardless of whether it was Chen Gui or Yuan Cang who was defeated, it would result in a great blow towards the morale of their side.\u003c/p\u003e\n\u003cp\u003e“Bang bang!”\u003c/p\u003e\n\u003cp\u003eMonstrous black light gathered behind Chen Gui. In the next instant, his eyes abruptly became sharp as he stepped forward while his hand was curled into a claw. Subsequently, it grabbed at Yuan Cang across the distant space.\u003c/p\u003e\n\u003cp\u003e“Great Darkness Heavenly Ghost Claw!”\u003c/p\u003e\n\u003cp\u003eA deep voice emerged from Chen Gui’s mouth at this moment. Soon after, countless piercing ghost like screeches rang out in the sky. Monstrous grayish-black light agglomerated and actually turned into a hundred feet large darkness ghost claw. A sinister wind blew from this ghost claw.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe darkness ghost claw directly penetrated through the empty space. It contained a frighteningly dark and formidable fluctuation as it viciously clawed at Yuan Cang.\u003c/p\u003e\n\u003cp\u003e“Haha, is this the martial art that you, Chen Gui, are most proud of? Just as well, today I shall completely break this martial art of yours in front of everyone!”\u003c/p\u003e\n\u003cp\u003eYuan Cang watched the arriving ghost claw that was accompanied by a terrifying fluctuation. He did not dodge, but instead laughed heartily. At the same time, monstrous Yuan Power whistled like a giant wave behind him.\u003c/p\u003e\n\u003cp\u003e“Yuan God Codex, Heavenly Yuan Hand!” Yuan Cang extended his hand and suddenly clenched it as it fell while laughing loudly.\u003c/p\u003e\n\u003cp\u003eRumble!\u003c/p\u003e\n\u003cp\u003eAn unusually vast and mighty Yuan Power whistled out from behind him. It turned into a titanic Yuan Power hand that was hundreds of feet large before countless stunned eyes. A frightening force that could shake the world seemed to be gathered on that titanic hand.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe moment that titanic Yuan Power hand, which blotted out the sun, was formed, it viciously slapped out. In the next instant, it violently collided with the darkness ghost claw in front of numerous eyes.\u003c/p\u003e\n\u003cp\u003eBang bang bang!\u003c/p\u003e\n\u003cp\u003eA thunderous noise was frantically echoed at the moment of impact. The ghost claw and titanic hand continued to emit berserk undulations in the sky in an attempt to destroy the other party.\u003c/p\u003e\n\u003cp\u003eAt this moment however, it was clear that the strength of both parties were similar. Hence, regardless of how wild and violent the fluctuation was, neither of the attacks could gain an obvious advantage.\u003c/p\u003e\n\u003cp\u003e“A draw huh…” Everyone involuntarily muttered as they watched the stalemate in the sky.\u003c/p\u003e\n\u003cp\u003eIn the sky, Yuan Cang seemed to have heard the numerous mutters. Immediately, a sneer flashed in his eyes. The strange smile on his lips grew increasingly wider.\u003c/p\u003e\n\u003cp\u003e“Chen Gui, I have said that you will regret it!”\u003c/p\u003e\n\u003cp\u003eYuan Cang looked at Chen Gui from afar. He laughed softly and both of his hands rapidly formed an unusual set of seals. Following the transformation of his hand seals, a mysterious symbol faintly appeared on Yuan Cang’s forehead.\u003c/p\u003e\n\u003cp\u003e“Spirit emblem?”\u003c/p\u003e\n\u003cp\u003eChen Gui immediately noticed the symbol on Yuan Cang’s forehead. Immediately, his pupils suddenly shrunk as a shaken expression surfaced on his face. He never imagined that this Yuan Cang had actually obtained a spirit emblem!\u003c/p\u003e\n\u003cp\u003e“Have you discovered it…”\u003c/p\u003e\n\u003cp\u003eYuan Cang gazed at the drastic change in Chen Gui’s expression. The strange smile of his now had an additional ferocity within it. Immediately, the symbol on his forehead suddenly flickered, while Yuan Cang’s aura abruptly soared the moment it did so!\u003c/p\u003e\n\u003cp\u003e“Bang bang!”\u003c/p\u003e\n\u003cp\u003eAs Yuan Cang’s aura soared, the titanic Yuan Power hand immediately became stronger. Its size swelled and it tightly grabbed the darkness ghost claw. Frightening strength was unleashed, and cracks immediately surfaced on the darkness ghost claw.\u003c/p\u003e\n\u003cp\u003e“Shatter!”\u003c/p\u003e\n\u003cp\u003eYuan Cang suddenly cried out coldly. Soon after, everyone could hear a clear sound ring in the air. The darkness ghost claw was forcibly crushed.\u003c/p\u003e\n\u003cp\u003eUrgh.\u003c/p\u003e\n\u003cp\u003eChen Gui emitted a muffled moan from his throat when the darkness ghost claw broke. A pale look flashed across his face.\u003c/p\u003e\n\u003cp\u003e“I have given you a choice to live, but you refused to take it. Do not blame me for being merciless!” Ferociousness flashed across Yuan Cang’s eyes after he gained the upper hand in the exchange. He took a step forward and the titanic Yuan Power hand directly tore through space and viciously swatted at Chen Gui.\u003c/p\u003e\n\u003cp\u003eIts shadow blocked all of Chen Gui’s retreat paths in an instant. After which, the titanic hand mercilessly smashed into his body in front of countless stunned eyes.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA low and deep sound caused everyone’s heart to tremble violently. A black light shot down from the sky, and in the end, it crashed into the ground. The terrifying force directly caused an enormous deep pit to be formed on the ground. Chen Gui’s expression was deathly pale as he lay within the pit. His mask had cracked apart, revealing his pale face. Blood also flowed from his body. Clearly, his injuries were not light.\u003c/p\u003e\n\u003cp\u003eYuan Cang’s face was sinisterly cold as he watched Chen Gui being injured by his strike. With a sinister laugh, a black metal sword appeared as he clenched his hand. Subsequently, a sharp sword glow shot towards Chen Gui’s head. It was obvious that he intended to kill the latter.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eHowever, zither music suddenly appeared when this sword glow was still a hundred feet from Chen Gui. At the same time, a crimson sonic wave rushed over from the distance and blocked the sword glow.\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eYuan Cang’s eyes became cold when he saw this sudden hindrance. He shifted his gaze, only to see a crimson glow rising from a short distance away. A young lady holding a crimson zither was icily meeting his gaze. Two Yuan Gate spirit generals had already collapsed weakly on the ground below. Clearly, their combined force had been defeated by Ying Huanhuan, who was holding the Heavenly Phoenix Zither. Having advanced to the nine Yuan Nirvana stage, Ying Huanhuan was clearly far more powerful than before.\u003c/p\u003e\n\u003cp\u003e“Pure Yuan treasure huh?”\u003c/p\u003e\n\u003cp\u003eYuan Cang glanced at the Heavenly Phoenix Zither in Ying Huanhuan’s hands. Soon after, he sneered, “Do you think that you can fight with me by relying on that item?”\u003c/p\u003e\n\u003cp\u003eYing Huanhuan rose into the sky. She gazed at the seriously injured Chen Gui, and clenched her pearly white teeth. An icy blue luster flashed deep within her large eyes. Finally, she sat down in the sky. From the looks of it, she intended to stop Yuan Cang.\u003c/p\u003e\n\u003cp\u003e“Haha, does the Dao Sect really has no one else? Even a little girl has to step up?” Yuan Cang involuntarily shook his head and ridiculed when he saw this scene.\u003c/p\u003e\n\u003cp\u003e“There’s also myself!”\u003c/p\u003e\n\u003cp\u003eYuan Cang’s voice had just sounded when an icy cold shout suddenly rang out. Soon after, everyone watched a young lady in black with a black sickle in her hands rush over. After which, she appeared beside Ying Huanhuan. That slender figure was Qingtan, who had also defeated the other two spirit generals.\u003c/p\u003e\n\u003cp\u003eThe two ladies might be young, but the battle achievements that they had obtained were quite extraordinary.\u003c/p\u003e\n\u003cp\u003e“Another Pure Yuan treasure?” Yuan Cang’s eyes were slightly icy as he looked at Qingtan. His pupils shrunk slightly as they swept over the black sickle in her hand.\u003c/p\u003e\n\u003cp\u003eAcross the entire area, countless gazes watched this scene in astonishment. They clearly did not expect that the ones who had stepped forward to stop Yuan Cang would actually be these two beautiful young ladies…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-800\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-802\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-801","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
