{"id":61915,"no":2159,"title":"Chapter 846: Each Displaying Their Skills","content":"\u003cp\u003e\u003cstrong\u003eChapter 846: Each Displaying Their Skills\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eBang bang!\u003c/p\u003e\n\u003cp\u003eSeveral formidable attacks descended from the sky once again. Subsequently, they smashed ruthlessly onto the three-headed Demon Snake’s large body. A low and deep muffled sound appeared, as the surrounding lake water exploded, causing a hundred feet large wave to form.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eHowever, that three-headed Demon Snake remained extremely ferocious even though it was surrounded on all sides by numerous attacking practitioners. Berserk energy whizzed out, as a dozen water snakes took shape around its body, before sweeping outwards. Immediately, a dozen experts were struck, causing them to vomit blood as they withdrew in a miserable fashion.\u003c/p\u003e\n\u003cp\u003eThis three-headed Demon Snake was indeed very powerful. If it was a one on one fight, even Lin Dong would have to experience a bitter battle in order to emerge victorious. However, the current situation was such that those experts present were all extremely experienced individuals. Moreover, they were all relatively strong. Hence, the might of the three-headed Demon Snake began to show signs of weakening as it continued to be entangled in this battle.\u003c/p\u003e\n\u003cp\u003eThis sign was undoubtedly like a tonic that strengthened everyone. Immediately, the storm like attacks became increasingly frenzied…\u003c/p\u003e\n\u003cp\u003eRoar!\u003c/p\u003e\n\u003cp\u003eThe three-headed Demon Snake became increasingly irritated when faced with this situation. However, it was after all one with great intelligence. Its scarlet red snake eyes flickered for a moment, before its enormous body abruptly began to sink. In the end, it once again sunk into the lake of an unknown depth. From the looks of it, the snake seemed to have given up.\u003c/p\u003e\n\u003cp\u003eHuu.\u003c/p\u003e\n\u003cp\u003eMany experts hovered in the air. They were a little out of breath as they stared at the three-headed Demon Snake, which had been forced back into the lake, while joy flashed across their eyes. It seemed that the strength from their large numbers was indeed quite great. Otherwise, it would basically be impossible for them to force the three-headed Demon Snake to withdraw today.\u003c/p\u003e\n\u003cp\u003e“It has simply retreated in this matter?”\u003c/p\u003e\n\u003cp\u003eLin Dong looked at the surface of the lake, which had gradually regained its calm. His eyes did not contain any joy. Instead, he frowned slightly. The three-headed Demon Snake clearly possessed a great battle power. This retreat was clearly not because it was afraid of them, but instead more akin to temporarily avoiding their attacks…\u003c/p\u003e\n\u003cp\u003e“What a cunning fellow. It is planning to wait for the people here to fight each other for the Life Mysterious Spirit Fruit, before coming out and reaping the benefits from the infighting.” Gu Yan commented in a low voice.\u003c/p\u003e\n\u003cp\u003eThis three-headed Demon Snake clearly understood that it would not last for long in such a situation. However, these people were clearly not united. Under the temptation of the Life Mysterious Spirit Fruit, the so called cooperation between them would quickly crumble. At that time, these people would begin to kill each other without its intervention…\u003c/p\u003e\n\u003cp\u003e“It is likely that many people here are aware of this logic… however, no one will be able to prevent it.”\u003c/p\u003e\n\u003cp\u003eLin Dong nodded slightly. His eyes swept over the sky. After which, he felt the atmosphere become a little strange. Light flickered in the eyes of some people. Those who were originally in close proximity also began to cautiously keep their distance.\u003c/p\u003e\n\u003cp\u003e“Rustle rustle!”\u003c/p\u003e\n\u003cp\u003eWhile the atmosphere was strange, the Life Mysterious Spirit Fruit on the small island was gently blown by the wind, causing a faint rustling sound. Those six Life Mysterious Spirit Fruits on it flickered with a tempting luster.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eThe strange atmosphere did not last for long as greed gathered within the eyes of many people. A\u003c/p\u003e\n\u003cp\u003emoment later, a dozen figures suddenly turned around and directly rushed towards the small island.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eHowever, they had barely moved when a sharp densely cold force erupted over their heads. Immediately, a couple of them were blasted away as they spit out blood before landing in the lake.\u003c/p\u003e\n\u003cp\u003eThe strange atmosphere also completely collapsed at this moment. The earlier cooperating relationship had also instantly shattered. Scarlet surged in everyone’s eyes as they rushed simultaneously forward.\u003c/p\u003e\n\u003cp\u003e“Move!” Lin Dong’s eyes hardened upon seeing this as he cried out in a deep voice.\u003c/p\u003e\n\u003cp\u003eHis body had already swept out the moment his cry sounded, while Gu Yan and the others behind him quickly followed. Their eyes were cautiously staring at the chaotic surroundings.\u003c/p\u003e\n\u003cp\u003eBang bang bang!\u003c/p\u003e\n\u003cp\u003eAt this moment, they sky had already fallen into complete chaos. The various factions had become a little crazed under the temptation of the Life Mysterious Spirit Fruit. Ferocious attacks would immediately be launched against anyone who was from a different faction.\u003c/p\u003e\n\u003cp\u003eThe so called cooperation had become incomparably fragile and laughable under the temptation from the Life Mysterious Spirit Fruit.\u003c/p\u003e\n\u003cp\u003eLin Dong was extremely quick. He dodged many formidable attacks along the way as he made a beeline for the small island. However, a couple of sinister wind forces came rushing over from his right when he was a short distance away from the small island.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes turned slightly cold. He turned around and threw a punch, which directly shattered the incoming wind. After which, he turned his head, and saw four figures staring at him with unfriendly eyes.\u003c/p\u003e\n\u003cp\u003e“It’s you fellows who just won’t disappear again.” Lin Dong gazed at the four individuals, as the coldness in his eyes intensified. This was because these four people were from the Black Dragon Pirates, who had lured two Demonic Beasts towards them previously.\u003c/p\u003e\n\u003cp\u003e“Heh, this fellow is a rather tough one.” The four people from the Black Dragon Pirates laughed in a strange manner. Their expressions had changed a little after seeing Lin Dong blast apart their coordinated attack with a single punch.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were indifferent as he stared at the four of them. A ferocious glint suddenly flashed across them in the next instant. His body moved and turned into an afterimage as it bolted forward.\u003c/p\u003e\n\u003cp\u003e“Careful!”\u003c/p\u003e\n\u003cp\u003eThe faces of these four Black Dragon Pirates changed upon seeing this. Clearly, they did not expect that Lin Dong would be this decisive. However, they were clearly people with rich battle experience. Majestic Yuan Power surged, and they threw a punch forward. Their Yuan Power gathered together and struck at Lin Dong with ferocious momentum.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eResplendent green light erupted from Lin Dong’s body. He quickly swung his leg out. Green light gathered over it, causing it to appear like a green dragon’s tail.\u003c/p\u003e\n\u003cp\u003e“Bam!”\u003c/p\u003e\n\u003cp\u003eThe wind from Lin Dong’s leg blasted apart even the air itself. Immediately, the kick collided head on against the combined attacks of the four Black Dragon Pirates.\u003c/p\u003e\n\u003cp\u003e“You’re courting death!”\u003c/p\u003e\n\u003cp\u003eSavage smiles rose on the faces of the four Black Dragon Pirates after they saw that Lin Dong actually dared to take all four of them on alone. However, these smiles had yet to spread, when they suddenly froze. This was because, they could sense a terrifying force suddenly sweeping out from the point of contact.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe combined attacks of the four instantly collapsed!\u003c/p\u003e\n\u003cp\u003eUrgh!\u003c/p\u003e\n\u003cp\u003eA frightening force seeped into the bodies of the four individuals without any reservation. Immediately, their expressions paled, as they spat out a mouthful of fresh blood. After which, their bodies flew backwards in a miserable fashion in front of many shocked eyes, before finally shooting into the lake below like cannonballs.\u003c/p\u003e\n\u003cp\u003e“What a powerful person!”\u003c/p\u003e\n\u003cp\u003eAlthough the sky was currently unusually chaotic, the eyes of some people involuntarily showed fear after seeing Lin Dong’s formidable attack.\u003c/p\u003e\n\u003cp\u003eThey might have already seen Lin Dong fight at the foot of the mountain, but these four Black Dragon Pirates were all at the peak nine Yuan Nirvana stage. Each and every one of them was not weaker than Lu Jian. If they were to join hands, they would even be able to fight against a half step into Profound Life stage expert. Despite this, they were still directly sent flying by a single kick from Lin Dong. This forced many people to begin treating this mere nine Yuan Nirvana stage Lin Dong in an extremely serious manner…\u003c/p\u003e\n\u003cp\u003e“This brat…”\u003c/p\u003e\n\u003cp\u003eWei Song also saw this scene from nearby. His expression sunk slightly, but soon after, he released a cold laughter. His body turned, and he hurried to the small island at lightning speed.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eHowever, Wei Song had just rushed out, when an extremely sharp blade aura suddenly fell from the sky, forcing him to hastily retreat. After which, his expression was gloomy as he lifted his head, only to find the one arm Mo Zhan watching him with indifferent eyes.\u003c/p\u003e\n\u003cp\u003e“Since brother Mo has the time, I shall also play with you.”\u003c/p\u003e\n\u003cp\u003eWei Song laughed faintly. He clenched his hand, and a long spear appeared within it. His body moved and charged at Mo Zhan. Unceasing attacks were unleashed, holding Mo Zhan back in the process.\u003c/p\u003e\n\u003cp\u003eRumble!\u003c/p\u003e\n\u003cp\u003eThe chaos in the sky continued. However, anyone who entered the area within a hundred feet radius of the small island would immediately meet attacks from all directions. In this way, no one dared to easily step into that area. Such a sight was rather bizarre.\u003c/p\u003e\n\u003cp\u003e“Hee hee, since no one can reach the Life Mysterious Spirit Fruits, I will have no choice but to enjoy them by myself.”\u003c/p\u003e\n\u003cp\u003eA soft laughter was suddenly emitted from the air amidst this stalemate. After which, the lake around the small island was blasted apart. A somewhat transparent figure shot out at lightning speed and dashed towards the Life Mysterious Spirit Tree.\u003c/p\u003e\n\u003cp\u003e“Mental Energy Spiritual Body?”\u003c/p\u003e\n\u003cp\u003e“Divine Symbol Master?”\u003c/p\u003e\n\u003cp\u003eEveryone in the air had a change in expression upon seeing this scene. Their eyes were hurriedly thrown towards the Wei clan group. The black robed person’s hand was currently extended, as wave after wave of mighty Mental Energy swiftly erupted from him.\u003c/p\u003e\n\u003cp\u003eMental Energy Spiritual Body. Normally speaking, one could only form it after reaching the Divine Symbol Master level. From a certain point of view, it was an existence that was a little similar to the Yuan Spirit. However, when compared to the Yuan Spirit, this Mental Energy Spiritual Body appeared a little ethereal and strange.\u003c/p\u003e\n\u003cp\u003eSwish!\u003c/p\u003e\n\u003cp\u003eThe Mental Energy Spiritual Body was extremely quick. It approached the Life Mysterious Spirit Tree in a flash. However, the corners of Lin Dong’s mouth lifted to form a cold smile when the Mental Energy Spiritual Body was about to proceed.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eThe surface of the lake around the small island exploded, as a flash of golden light shot out at lightning speed. Finally, a sharp golden ring darted forward, and ruthlessly shot towards the Mental Energy Spiritual Body.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-845\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-847\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-846","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
