{"id":61950,"no":2194,"title":"Chapter 881 - Green Dragon Battles Asura","content":"\u003cp\u003eRoar!\u003c/p\u003e\n\u003cp\u003eAs the dragon roar resounded, bright and resplendent green light suddenly exploded from Lin Dong’s body. This only lasted for an instant, before rapidly withdrawing at the speed of lightning. In the end, it adhered to the surface of his body, green light circulating within it...\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eWide green dragon wings shot open on Lin Dong’s back, like the sharp edges of a blade. Although the dragon wings were now smaller than they were previously, they were obviously more refined. Along the edges of the dragon wings were extremely sharp, and sawtooth shaped, like the teeth of giant dragons.\u003c/p\u003e\n\u003cp\u003eThe dragon scale armour on Lin Dong’s body was not as thick as before. Thin scale armor covered the entirety of his body. As it extended, it gave off a feeling of abundant power. This feeling made him feel as if every action he made possessed the strength of a giant dragon.\u003c/p\u003e\n\u003cp\u003eAs the dragon scales condensed on Lin Dong’s arms and legs, some of them transformed into extremely sharp spikes, which were covered with serrated teeth. An aura that reeked of blood was faintly discernible, as it radiated out. With a glance, one could tell that it possessed extremely astonishing killing power.\u003c/p\u003e\n\u003cp\u003eThe current form of Lin Dong’s Green Heaven Materialised Dragon Skill was even more agile and nimble when compared to before. At the same time, its ferocity and attacking power had also increased.\u003c/p\u003e\n\u003cp\u003eObviously, as he grew stronger, the might of the Green Heaven Materialised Dragon Skill was gradually revealing itself bit by bit.\u003c/p\u003e\n\u003cp\u003e“Creak.”\u003c/p\u003e\n\u003cp\u003eLin Dong’s scale covered hand slowly clenched, as the air within was squeezed till it exploded. The originally pitch-black eyes were now brimming with green glint, as a dragon occupied the depths of his pupils.\u003c/p\u003e\n\u003cp\u003e“Your body enhancing martial art isn’t bad.”\u003c/p\u003e\n\u003cp\u003eShentu Jue’s gaze revealed a strange light, as he observed Lin Dong’s transformation. He was able to feel that the ferocity of Lin Dong’s aura had instantly multiplied.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eGreen light surged within Lin Dong’s eyes as he watched Shentu Jue. In the next instant, he suddenly stepped forward. One could only hear the sound of air exploding, as a figure appeared in front of Shentu Jue in the blink of an eye. Subsequently, a simple yet violent fist rumbled out.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eThe air in front was compressed to the point of exploding. Everyone could see faint distortions in the space where the fist had passed through.\u003c/p\u003e\n\u003cp\u003eClank!\u003c/p\u003e\n\u003cp\u003eHowever, Shentu Jue merely grinned in the face of such violent fist winds, and showed no indications of retreating. A fist suffused with jet black light similarly rumbled out ferociously, smashing head on against Lin Dong’s fist.\u003c/p\u003e\n\u003cp\u003eAt the instant of collision, a piercing metallic sound immediately rang out. A circular wind ripple swept out, causing the air in a hundred feet radius to instantaneously explode.\u003c/p\u003e\n\u003cp\u003eAfter clashing directly against Lin Dong’s fist, a battle maniac smile appeared at the corners of Shentu Jue’s mouth. With a hearty chuckle, two of his fingers curled, transforming into two jet black rays. The rays tore through the air, lightning fast as they stabbed towards Lin Dong’s eyes at an extremely crafty turning arc.\u003c/p\u003e\n\u003cp\u003eClink!\u003c/p\u003e\n\u003cp\u003eLin Dong arm jerked. Sharp scale blades sparkled with green light as they raised up, blocking those two swift and fierce grey lights. Quickly after, his body leaned forward, as a flurry of fists were thrown. His assault poured out in torrents like a storm, enveloping Shentu Jue.\u003c/p\u003e\n\u003cp\u003e“Ha ha, delightful!”\u003c/p\u003e\n\u003cp\u003eIn response to Lin Dong’s ferocious onslaught, the fire in Shentu Jue’s eyes burned with a greater fury, as he clenched his hands tightly into fists. Jet black light gushed out from all over his body, as he relied on his powerful physical body, and met Lin Dong head on.\u003c/p\u003e\n\u003cp\u003eClang clang clang!\u003c/p\u003e\n\u003cp\u003eMetallic sounds frantically erupted in the limestone square. Accompanying the sounds were waves of terrifying energy ripples. The violent power contained within these ripples caused several people’s scalps to turn numb. They were truly somewhat unable to imagine, that with just the power of their bodies, the two men in the square were able to reach such astonishing levels.\u003c/p\u003e\n\u003cp\u003e“He’s actually able to contend with Shentu Jue to such a degree with just his physical body…”\u003c/p\u003e\n\u003cp\u003eAt the Shentu Jue seats, as the Shentu Clan members watched the two men duking it out in close physical combat, their gazes gradually turned grave. They were exceedingly clear about how tyrannical Shentu Jue’s physical body was. However, Lin Dong was unexpectedly not inferior at all in this aspect...\u003c/p\u003e\n\u003cp\u003eAs the black clothed Shentu Rong watched the two figures, who were locked in a violent exchange like to two ferocious lions, her expression started to change. Even she felt her heart thud in alarm at the low and deep sounds that rang out when a punch landed on a body...\u003c/p\u003e\n\u003cp\u003eAt the Gu Clan area, Gu Shou, Gu Mengqi and the rest all had anxious faces, as they watched the two figures which were locked in combat. All of their eyes contained unconcealable graveness.\u003c/p\u003e\n\u003cp\u003eThe fight before them was really too ferocious. Compared to this, the fights yesterday seemed somewhat mundane...\u003c/p\u003e\n\u003cp\u003e“Elder Gu Shou, who has a higher chance of winning?” Gu Yan could not help but ask.\u003c/p\u003e\n\u003cp\u003eGu Shou stared at the square, and hesitated for while, before shaking his head as he replied, “Lin Dong’s physical body is more tyrannical than I had thought. In this aspect, he’s not inferior to Shentu Jue. However… the latter has yet to use his advantage.”\u003c/p\u003e\n\u003cp\u003eGu Mengqi bit her red lips. Shentu Jue was a true blue advance Profound Life stage expert, and his Yuan power was definitely much more abundant than Lin Dong’s. Currently, they were battling with just their physical bodies, and although Lin Dong was not losing out, once Shentu Jue regained his clarity from this battle rush, he would definitely choose to use his advantage. To use his vigorous Yuan Power to suppress Lin Dong.\u003c/p\u003e\n\u003cp\u003eThis was not a favourable battle.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA fist brimming with jet black light violently slammed against Lin Dong’s elbow. Upon landing, green light sparkled maniacally, continuously defending against the frightening force that was invaded.\u003c/p\u003e\n\u003cp\u003eCrack!\u003c/p\u003e\n\u003cp\u003eMinute cracking noises rang out from Lin Dong’s shoulder. Obviously, under Shentu Jue’s ferocious force, the bones in his shoulder had been injured. At the same time, this force also sent Lin Dong flying backwards.\u003c/p\u003e\n\u003cp\u003eSwish!\u003c/p\u003e\n\u003cp\u003eHowever, just as Lin Dong’s body flew backwards, his leg suddenly split apart the air. A sharp scale blade carried swift and fierce green light, and slashed past Shentu Jue’s chest at an astonishing speed.\u003c/p\u003e\n\u003cp\u003eAs the green light swept past, the clothes on Shentu Jue’s chest was slashed apart. A glaring wound appeared on the chest that was radiating with jet black light.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eLin Dong’s feet pushed off on empty air, as his body hovered in the air. At this time, many of the green dragon scales that covered his entire body were already broken, and there were even faint traces of blood. Naturally, there were also quite a few wounds on the Shentu Jue’s body, which was suffused with jet black light. It was evident that the two had been truly engaged in an extremely vicious and cruel bare-bodied battle.\u003c/p\u003e\n\u003cp\u003eDue to this bare-bodied battle, several wounds had appeared on both of their bodies.\u003c/p\u003e\n\u003cp\u003eAround the square, everyone was inwardly speechless when they saw the two’s appearances. They were very clear that if a normal peak initial Profound Life Stage expert were to substitute for either of the two, that unlucky fellow would have already been directly beaten into meat paste...\u003c/p\u003e\n\u003cp\u003eBeing able to withstand such terrifying force and not be killed, perhaps only the two monsters in the square could do such a thing...\u003c/p\u003e\n\u003cp\u003eShentu Jue used his hand to feel the wound on his chest, before smearing the fresh blood on his lips. The dark red colour made him seem even more fiendish. His chest gently raised and fell. From the looks of it, the slightly crazed combat session earlier had also consumed quite a bit of his strength.\u003c/p\u003e\n\u003cp\u003e“Being able to force me to this state with just your physical body, even those two fellows are unable to do so…”\u003c/p\u003e\n\u003cp\u003eShentu Jue raised his head and stared at Lin Dong with eyes brimming with jet black light. Soon after, he grinned, revealing his sinisterly white teeth, which were smudged with blood, making him look exceedingly terrifying.\u003c/p\u003e\n\u003cp\u003eLin Dong took a deep breath. Green light frantically rushed about his body, continuously repairing the internal wounds caused by the force of Shentu Jue’s blows. His gaze was exceeding grave. Shentu Jue’s physical body was the strongest he had seen within the younger generation. This was also the first time he had encountered someone that could compete with him, who had trained in the Green Heaven Materialised Dragon Skill, in terms of physical prowess...\u003c/p\u003e\n\u003cp\u003e“No wonder why you could defeat the Wei Zhen trio. Compared to you, they’re indeed wastrels.”\u003c/p\u003e\n\u003cp\u003eA smile was still present on Shentu Jue’s face. However, the bloodthirsty glint in his eyes had slowly disappeared. Following its disappearance, Lin Dong’s eyes faintly narrowed. He could feel exceedingly dangerous fluctuations radiating from within Shentu Jue’s body.\u003c/p\u003e\n\u003cp\u003eA man who only knew how to rely on brute force was not frightening. What was truly frightening, was a man who was able to perfectly display such power.\u003c/p\u003e\n\u003cp\u003eThe current Shentu Jue had clearly started to recover from his previously barbaric state.\u003c/p\u003e\n\u003cp\u003e“This warm up should be enough… I’ve heard that you used a single move to defeat the Wei Zhen trio yesterday... now, I’ll do the same.”\u003c/p\u003e\n\u003cp\u003eShentu Jue chuckled. Next, monstrous jet black light maniacally swept out from his body like a storm. Instantly, this stretch of world turned dark and gloomy, as a baleful aura quietly spread.\u003c/p\u003e\n\u003cp\u003eJet black light filled the area, as Shentu Jue slowly extended his hand. Pointing it towards Lin Dong, he suddenly clenched his fist and swung it downwards. At the same time, a low hoarse voice, carrying with it a baleful aura that blotted the sky, swept out from his mouth.\u003c/p\u003e\n\u003cp\u003e“Asura Earthly Demonic Prison.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-880\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-882\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-881","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
