{"id":61965,"no":2209,"title":"Chapter 896 - Power of the Ancient Divine Flame Tablet","content":"\u003cp\u003eClash.\u003c/p\u003e\n\u003cp\u003eHundreds of scarlet red chains pierced through the sky like a fire dragons. After which, they twisted around the grey light that seemingly covered the sky as it arrived.\u003c/p\u003e\n\u003cp\u003eThis unexpected turn of events clearly caused the Nefarious Bone old man to be momentarily startled. However, he quickly let out a cold snort. Both of his hands were curled into a claw shape, as they violently tore downwards. Ten dark black lights swept forth, and directly cut those scarlet red chains that were surrounding him into pieces.\u003c/p\u003e\n\u003cp\u003e“Bang bang!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were ice-cold. Both of his hands were in contact with the ground, as wave after wave of powerful Yuan Power continuously surged into the ground. Immediately, the land continued to crack apart. Countless scarlet red chains continued to break out of the ground, and endlessly attacked the Nefarious Bone old man.\u003c/p\u003e\n\u003cp\u003eIn the face of Lin Dong’s attacks, the Nefarious Bone old man stood in the air, as sharp claw winds filled the air. Not a single chain was able to approach his body.\u003c/p\u003e\n\u003cp\u003e“You plan on trapping me with just this? You must be dreaming!” The Nefarious Bone old man mockingly looked at Lin Dong below and sneered.\u003c/p\u003e\n\u003cp\u003eLin Dong completely ignored his ridicule. A thought passed through his mind, and another dozen scarlet red chains broke out from the ground. They curled around the Nefarious Bone old man at lightning speed.\u003c/p\u003e\n\u003cp\u003e“Useless actions.”\u003c/p\u003e\n\u003cp\u003eThe Nefarious Bone old man swung his claw shaped hand, and sharp winds once again sliced the dozen chains. However, a cold smile rose from the corners of Lin Dong’s mouth the moment the chains were cut.\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eA dozen smaller chains rushed out in a strange fashion from where the chains had been cut. After which, they snaked through the air like vipers, and curled around the Nefarious Bone old man’s body and limbs.\u003c/p\u003e\n\u003cp\u003e“Break!”\u003c/p\u003e\n\u003cp\u003eThe eyes of the Nefarious Bone old man turned cold as the chains wrapped around his body. Majestic Yuan Power suddenly exploded from within his body in an attempt to break these chains.\u003c/p\u003e\n\u003cp\u003eCrack crack crack!\u003c/p\u003e\n\u003cp\u003eHowever, the Nefarious Bone old man did not manage to easily break them like he had managed to did earlier. While his Yuan Power surged, black light also surged on those black chains. Although the chains were pushed at until they creaked, they stubbornly bound the Nefarious Bone old man’s body this time around.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eUnable to escape, the Nefarious Bone old man’s expression finally changed somewhat for the first time. His eyes were filled with disbelief. He was really unable to imagine, that he would actually be unable to break free from these seemingly tiny black metal chains despite his strength.\u003c/p\u003e\n\u003cp\u003e“Old bastard, it seems that you were ultimately still a little too careless.” Lin Dong raised his head, and looked at the Nefarious Bone old man, who had been bound by the black chains. Devouring Power was hidden within these chains, hence, they could not be compared to those scarlet red chains from earlier. Even though this Nefarious Bone old man was powerful, he would still require a great deal of effort to escape.\u003c/p\u003e\n\u003cp\u003e“Brat, it is too early for you to be happy. Even though I am unable to move, it is still extremely easy for me to kill you!” The Nefarious Bone old man stared at Lin Dong with sinisterly cold eyes. Immediately, his foot suddenly stomped on the empty air. A thousand feet large Yuan Power pillar shot out, and viciously blasted at Lin Dong.\u003c/p\u003e\n\u003cp\u003eSwoosh swoosh swoosh.\u003c/p\u003e\n\u003cp\u003eScarlet red chains danced in the sky, and turned into a giant web above Lin Dong. At the same time, it also received that Yuan Power pillar.\u003c/p\u003e\n\u003cp\u003e“Old bastard, if you’re done playing, you should come and try the feast that I have prepared for you.”\u003c/p\u003e\n\u003cp\u003eScarlet red chains broke apart and descended from the sky. Lin Dong lifted his head and stared at the Nefarious Bone old man. The smile on the corners of his mouth was somewhat ferocious.\u003c/p\u003e\n\u003cp\u003e“What arrogant words…”\u003c/p\u003e\n\u003cp\u003eThe Nefarious Bone old man’s pupils shrunk slightly, as he stared intently at Lin Dong. That tone of his was eerie, but for some unknown reason, unease suddenly rose from deep within his heart. All of Lin Dong’s actions today seemed to have been planned in advance…\u003c/p\u003e\n\u003cp\u003eLin Dong grinned, and did not speak any further. It was not easy for him to trap this old fellow, and this was the only opportunity he had to unleash his great killing move.\u003c/p\u003e\n\u003cp\u003eHu.\u003c/p\u003e\n\u003cp\u003eA cluster of white vapour was spat out from Lin Dong’s mouth. Quickly after, he clenched his hand. An ancient scarlet red flame like tablet appeared in his hand. It was the Ancient Divine Flame Tablet.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were searing hot as he stared at the ancient tablet in his hands. A thought passed through his mind, and the tablet slowly rose. While it rose, strands of scarlet red flames started to burn from within it.\u003c/p\u003e\n\u003cp\u003eThe surrounding space began to become distorted as this flame burned, as a frightening temperature was quietly emitted, causing the Yuan Power in the area to boil a little.\u003c/p\u003e\n\u003cp\u003e“This…”\u003c/p\u003e\n\u003cp\u003eThe Nefarious Bone old man looked at the rising ancient tablet, as his expression became ugly. The burning flame on the ancient tablet caused even him to feel some fear within his heart.\u003c/p\u003e\n\u003cp\u003e“Grug.”\u003c/p\u003e\n\u003cp\u003eSeveral mouthfuls of essence blood containing pure Yuan Power was directly spat out from Lin Dong’s mouth. Finally, they landed on the Ancient Divine Flame Tablet. At the same time, the Yuan Power within his body also surged out, and poured into it.\u003c/p\u003e\n\u003cp\u003eA trace of paleness spread on Lin Dong’s face, as his aura began to weaken at a shocking speed. Clearly, activating this Ancient Divine Flame Tablet had almost exhausted all of his strength.\u003c/p\u003e\n\u003cp\u003eHowever, the scarlet red flame on the Ancient Divine Flame tablet also became increasingly deeper in colour amidst this exhaustion of his. In the end, it actually became like the colour of fresh blood.\u003c/p\u003e\n\u003cp\u003e“Universe Incinerating Flame Arrow!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were searing hot as they looked at this ancient tablet that was burning with a bloody flame. Soon after, the seal formed by his hands changed, as a low voice was emitted from his throat.\u003c/p\u003e\n\u003cp\u003eBuzz buzz!\u003c/p\u003e\n\u003cp\u003eAfter his voice sounded, the blood red flame immediately rushed into the sky from the Ancient Divine Flame Tablet. After which, it transformed into a long blood coloured arrow.\u003c/p\u003e\n\u003cp\u003eThe long arrow was around ten feet or so in length, while the flames that rose from it were just like fresh blood that continued to drip downwards. As the flames danced, an annihilation like fluctuation quietly spread.\u003c/p\u003e\n\u003cp\u003eEven the pupils of the Nefarious Bone old man shrunk instantly in the face of this fluctuation, as horror surged out from deep within his eyes. He was really unable to imagine that Lin Dong would actually be able to summon such a frightening attack…\u003c/p\u003e\n\u003cp\u003eLin Dong gazed at the Nefarious Bone old man, whose expression had changed, while the savage expression on his pale face became even more intense. Quickly after, he made the motion of pulling a bow. His eyes instantly turned ice-cold in the next instant, as his finger was suddenly released.\u003c/p\u003e\n\u003cp\u003eSwish!\u003c/p\u003e\n\u003cp\u003eThe moment Lin Dong’s finger was released, the long arrow that burned with a blood red flame emitted a deafening screech. Even space itself was forcefully shattered due to this screech. Immediately, the long arrow arrived in a flash. It seemed to have penetrated through the obstructions of space, and shot directly towards the head of the Nefarious Bone old man.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe hairs all over the Nefarious Bone old man’s body stood up at this moment, as a horrified expression appeared on his grim old face. Monstrous Yuan Power wildly swept out from within his body. This time around, he had finally broken the black chains that were restraining him. Without any hesitation, his body began to hurry backwards. He had sensed the threat of death from that long blood coloured arrow.\u003c/p\u003e\n\u003cp\u003e“I’m afraid it is too late for you to leave now!”\u003c/p\u003e\n\u003cp\u003eLin Dong icily laughed as he looked at the Nefarious Bone old man, whose body was about to retreat backwards. Even with all his power, this attack could only be used once. Moreover, he would end up in a weakened state for a period of time after using it. If this Nefarious Bone old man managed to avoid it, Lin Dong would no longer have any strength left to fight.\u003c/p\u003e\n\u003cp\u003eHence, this arrow must not miss!\u003c/p\u003e\n\u003cp\u003eBoth of Lin Dong’s hands rapidly formed a series of seals, as majestic Mental Energy wildly swept out from within his Niwan Palace. A low ice-cold voice was emitted from his mouth, “Stop!”\u003c/p\u003e\n\u003cp\u003eA mysterious fluctuation spread out in the sky at lightning speed. After which, that Nefarious Bone old man was shocked to discover that his body had frozen for an instant!\u003c/p\u003e\n\u003cp\u003eThis stillness was practically almost undetectable, but it genuinely existed. Normally, no one would pay any attention to such a short instant. However, such an instant was currently fatal!\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eThe long arrow burning with a blood red flame pierced through the air at this moment. In the end, it mercilessly shot into the body of the Nefarious Bone old man under the latter’s horrified gaze.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eMonstrous blood coloured flames unfurled the moment that it struck, while the entire space within the cauldron began to tremble crazily…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-895\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-897\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-896","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
