{"id":61972,"no":2216,"title":"Chapter 903 - Striking First","content":"\u003cp\u003eLin Dong and the dozen Blood Demon Shark clan experts faced off in the sky above the sea. The atmosphere was extremely tense, and iciness flowed in all their eyes.\u003c/p\u003e\n\u003cp\u003eThese experts from the Blood Demon Shark clan were usually extremely overbearing. It was impossible to count just how many lives had been taken by their hands. Hence, all of them were extremely violent and ferocious. However, Lin Dong was no saint either. Not long ago, he had beaten a half step Profound Death stage expert until the latter almost became a human baton. The ruthlessness within his bones could only be greater than these members of the Blood Demon Shark clan.\u003c/p\u003e\n\u003cp\u003eA clash between two parties who would undoubtedly not give in to each other.\u003c/p\u003e\n\u003cp\u003e“Brat, are you certain that you wish to become an enemy of my Blood Demon Shark clan? Trust me, this is an extremely foolish act.” Commander Xia’s expression turned dark and solemn. However, his tone was clearly a little better compared to earlier. It seemed that after the brief exchange earlier, he also understood that it was not as easy as he had imagined to finish off this Lin Dong.\u003c/p\u003e\n\u003cp\u003e“I do not wish to be enemies with others. However, I also do not wish to be bullied by others.”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes stared at the gloomy looking commander Xia. The cold glint in his eyes seemed to have weakened slightly, “I have naturally heard of the great name of your noble clan. I do not wish to know just what mission you are currently undertaking now. However, please do not disturb my travels. I also have some urgent matters to attend to.”\u003c/p\u003e\n\u003cp\u003e“Why don’t we do it this way. We will not bother each other and take a step back. Each of us will mind our own business. What do you say?”\u003c/p\u003e\n\u003cp\u003eCommander Xia’s eyes narrowed. Those dark red eyes appeared rather terrifying. He met Lin Dong’s gaze as his eyes flickered slightly. A moment later, the fiendish aura that covered his body greatly diminished, as a smile appeared on his dark and solemn face, “This friend is right. We were indeed a little reckless earlier. From the looks of it, you are likely not the person we are looking for,”\u003c/p\u003e\n\u003cp\u003eA somewhat friendly smile surfaced on Lin Dong’s face as he heard this. However, there was an additional trace of caution in his heart. This change in commander Xia was indeed a little too strange.\u003c/p\u003e\n\u003cp\u003e“Can I leave now?” Lin Dong smiled as he asked.\u003c/p\u003e\n\u003cp\u003e“Please do.”\u003c/p\u003e\n\u003cp\u003eCommander Xia grinned and nodded. After which, he waved his hand. Those Blood Demon Shark clan experts around him hesitated for a moment, before withdrawing their malicious aura.\u003c/p\u003e\n\u003cp\u003e“Many thanks.”\u003c/p\u003e\n\u003cp\u003eLin Dong cupped his hands together. Without further ado, his body moved and transformed into a green light that shot towards the distance. However, a cold glint flickered in his eyes as his back faced commander Xia. He was aware that the sudden change in this commander Xia definitely meant that the latter had some schemes up his sleeve…\u003c/p\u003e\n\u003cp\u003eHowever, Lin Dong was currently unable to tell just what this commander Xia was thinking. His body turned into a flash of green light that swiftly disappeared into the distance.\u003c/p\u003e\n\u003cp\u003e“Commander Xia, are we simply going to let him go?” A Blood Demon Shark clan experts could not help but ask after Lin Dong had disappeared into the distance.\u003c/p\u003e\n\u003cp\u003e“Let him go?” Commander Xia’s face immediately revealed a sinister aura upon hearing those words. He laughed in a dark and cold voice, “The first time that this brat met us is seven days ago. Yet, he is still here after seven days. This part of the sea is barren. Why would he remain in this damned deserted place for seven days? Don’t tell me that it is for fun?”\u003c/p\u003e\n\u003cp\u003e“Commander Xia means that…”\u003c/p\u003e\n\u003cp\u003e“The one who rescued Mu Lingshan is most likely him!” Commander Xia’s eyes were venomous as he said.\u003c/p\u003e\n\u003cp\u003e“The why did you let him go?” A person asked in surprise.\u003c/p\u003e\n\u003cp\u003e“It is because I have no confidence in retaining him.” Commander Xia replied in an indifferent voice. His eyes looked in the direction where Lin Dong was heading and said, “Although that fellow might appear to be a mere initial Profound Life stage practitioner, his fighting strength is comparable to an advance Profound Life stage practitioner. Even if I go all out and attack him, I would not be able to keep him here even if I emerge victorious.”\u003c/p\u003e\n\u003cp\u003e“What should we do next?”\u003c/p\u003e\n\u003cp\u003e“Heh, trying to escape from my Blood Demon Shark clan in the sea is not going to be easy. I have already used the Blood Shark Seeking Technique on him. He will not be able to escape…”\u003c/p\u003e\n\u003cp\u003e“Additionally, immediately dispatch this information to the other section leaders. Ask them to hurry over. I will only have the absolute confidence to capture this person after they arrive.”\u003c/p\u003e\n\u003cp\u003e“Understood!”\u003c/p\u003e\n\u003cp\u003eThe surrounding Blood Demon Shark clan experts immediately replied after hearing commander Xia’s orders. After which, their bodies submerged into the water. Soon after, many sonic waves quietly spread at lightning speed in the water.\u003c/p\u003e\n\u003cp\u003e“Fool who does not know his limits. How dare you interfere in the matters of my Blood Demon Shark clan. Next, I will let you know just who you cannot afford to offend within this Chaotic Demon Sea.”\u003c/p\u003e\n\u003cp\u003eCommander Xia’s eyes looked in the direction where Lin Dong had headed towards while he muttered. A cruel expression flashed across his eyes.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eA green light shot through the sky. However, Lin Dong’s expression did not appear relaxed. Instead, it was a little grim. He glanced at the area behind him as he gently clenched his hand, “That fellow… could it he really have let me off like this?”\u003c/p\u003e\n\u003cp\u003e“You are being followed.” Yan replied in a faint voice.\u003c/p\u003e\n\u003cp\u003e“What?” Lin Dong was immediately alarmed upon hearing this. His eyes swept around him, but did not see any human figures or sensed any presences.\u003c/p\u003e\n\u003cp\u003e“It should be a unique tracking method of the Blood Demon Shark clan. They are at the bottom of the sea.” Yan cautioned.\u003c/p\u003e\n\u003cp\u003eLin Dong lowered his head, as green light surged within his eyes. It seemed as though his sight had directly penetrated through the sea. He could see an extremely blurry bloody light that was swiftly swimming in his direction at the bottom of the sea.\u003c/p\u003e\n\u003cp\u003e“That fellow should have sensed your strength. He does not have the confidence to capture you alone. This act of his is merely an attempt to make you let down your guard. He will surround and capture you once reinforcements arrive.” Yan said.\u003c/p\u003e\n\u003cp\u003eA cold glint surged within Lin Dong’s eyes. He was aware that besides commander Xia, this Blood Demon Shark clan unit had ten other experts who had reached the initial Profound Life stage. If they were to join hands, it would indeed result in an extremely troublesome predicament for Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Can you remove the thing that is allowing them to follow us?” Lin Dong asked.\u003c/p\u003e\n\u003cp\u003e“It will be quite troublesome. The Blood Demon Shark clan tracking technique has its own unique aspects.” Yan replied.\u003c/p\u003e\n\u003cp\u003eLin Dong pursed his lips, as a fierce glint flashed across his eyes. If this was the case, it seemed that he could only act and eliminate them…\u003c/p\u003e\n\u003cp\u003e“Brother Lin Dong, you are being followed by them.” Mu Lingshan’s voice suddenly emerged from the Burning Sky Cauldron, while Lin Dong was conversing with Yan in his mind. Since Lin Dong did not block her senses, she was able to sense everything that was happened in the outside world.\u003c/p\u003e\n\u003cp\u003e“Aye.”\u003c/p\u003e\n\u003cp\u003eLin Dong nodded. Mu Lingshan was from the Sea Demon tribe. It was not strange for her to be able to detect the Blood Demon Shark clan tracking them, even though Lin Dong had failed to do so.\u003c/p\u003e\n\u003cp\u003e“Since we cannot escape from them, we can only attack.” Lin Dong softly stated.\u003c/p\u003e\n\u003cp\u003eMu Lingshan, who was inside the Burning Sky Cauldron, was quiet for a moment. She was aware that she seemed to have brought some trouble to Lin Dong. Her voice was once again emitted a moment later, “Brother Lin Dong. If you wish to fight with them, I can lend you my ‘Life Death Coffin Cover’.”\u003c/p\u003e\n\u003cp\u003eLin Dong could sense the Burning Sky Cauldron in his sleeve tremble after her words sounded. Soon after, a black light came rushing out. It turned into an extremely thick black coffin cover in front of Lin Dong. An extremely frightening ripple emerged from the coffin cover.\u003c/p\u003e\n\u003cp\u003eLin Dong looked at the Life Death Coffin Cover before him, and was a little stunned. He never expected that this Mu Lingshan had such great trust in him. If such a treasure was revealed, it would end up drawing the attacks of countless crazed experts…\u003c/p\u003e\n\u003cp\u003e“Aye.”\u003c/p\u003e\n\u003cp\u003eHowever, Lin Dong did not hesitate. He was clearly aware that he would be a pain to face an advance Profound Life stage expert and ten initial Profound Life stage experts. However, if he had the Life Death Coffin Cover aiding him, things would undoubtedly be much easier.\u003c/p\u003e\n\u003cp\u003e“Since that is the case…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s hand touched the Life Death Coffin Cover. He could clearly sense a resistance being emitted from within it when he extended his hand. However, a thought was quickly emitted from within the Burning Sky Cauldron, which removed this resistance. Clearly, Mu Lingshan had intervened.\u003c/p\u003e\n\u003cp\u003eLin Dong’s hand touched the Life Death Coffin Cover. After which, he lifted it up and placed it on his back. His mouth parted into a smile, a smile that was malicious and filled with ferocity.\u003c/p\u003e\n\u003cp\u003e“In that case, we should attack first before they have the opportunity to gather.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-902\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-904\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-903","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
