{"id":62019,"no":2263,"title":"Chapter 950 - Implicated","content":"\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eAn astonishing energy wave unfurled from the bottom of the lake with shocking momentum. Countless human figures and silver light seemed to interweave together. Each time they clashed, a low and deep sound would be emitted. Occasionally, someone would be sent flying backwards while vomiting blood. Most of the time however, it was the silver figures that gradually crumbled one by one…\u003c/p\u003e\n\u003cp\u003eThe silver corpses finally began to show signs of being defeated in the face of the treasure seekers that endlessly streamed in to join the battle at the bottom of the lake. It seemed that there was finally a conclusion to this sudden outbreak of silver corpses.\u003c/p\u003e\n\u003cp\u003eDong!\u003c/p\u003e\n\u003cp\u003eLin Dong’s body was just like a ghost as he approached a silver corpse. His hand was as quick as lightning as it imprinted onto its chest. White light flashed at his fingertips and swiftly burrowed into the body of the silver corpse.\u003c/p\u003e\n\u003cp\u003eAfter the invasion of the white light the silver corpse immediately stiffened while the black aura leaping within its eyes also began to diminish bit by bit. At the same time, a lightning glow began to gather on its body. Fortunately, it did not show any signs of crumbling this time.\u003c/p\u003e\n\u003cp\u003e“Lucky.” Lin Dong smiled slightly upon seeing this.\u003c/p\u003e\n\u003cp\u003eLightning flashed. After which, it swiftly gathered. In a short span of time, a thunderbolt core was successfully formed in front of the many greedy eyes around him.\u003c/p\u003e\n\u003cp\u003eLin Dong made a grabbing motion with his hand when the thunderbolt core was successfully formed. After which, he swiftly kept it into his Qiankun Bag.\u003c/p\u003e\n\u003cp\u003e“Brother Lin Dong, how many thunderbolt cores have you collected?” Mu Lingshan hurried over at this moment and smilingly asked.\u003c/p\u003e\n\u003cp\u003e“Eight. Adding those that I obtained earlier, it is a total of seventeen thunderbolt cores.” Lin Dong laughed.\u003c/p\u003e\n\u003cp\u003e“I have twenty!” Mu Lingshan was extremely pleased with herself as her two pigtails seemed to bounce on her head. Together with her exquisite porcelain doll like face, she appeared extremely cute.\u003c/p\u003e\n\u003cp\u003eLin Dong could not resist stroking Mu Lingshan’s small head. Twenty thunderbolt cores was indeed quite a shocking number. After all, there were far too many experts at the bottom of the lake at this moment. Many of them did not even have a single thunderbolt core in their hands…\u003c/p\u003e\n\u003cp\u003e“Be careful of those people from the Nine Serene Gate. They have been staring at us since the beginning.” Lin Dong softly said.\u003c/p\u003e\n\u003cp\u003eHis eyes glanced towards a certain direction as he spoke where experts from the Nine Serene Gate had gathered together. Their leader was Pang Hao. The latter also seemed to have detected Lin Dong’s gaze at this moment. He turned his head and met Lin Dong’s gaze. After which, he smiled. The smile was filled with playfulness.\u003c/p\u003e\n\u003cp\u003e“Hateful fellows who just don’t disappear.”\u003c/p\u003e\n\u003cp\u003eMu Lingshan clenched her teeth as her small hands involuntarily grasped the Life Death Coffin Cover tighter. If it was not because she was aware of just how powerful and large in numbers the group was, it was likely that she would been unable to resist slamming the Life Death Coffin Cover at them.\u003c/p\u003e\n\u003cp\u003eLin Dong smiled. However, that smile of his was exceptionally frosty. There were indeed many experts from the Nine Serene Gate. However, if Pang Hao thought that Lin Dong was a soft persimmon that he could squash, he would be making a huge mistake.\u003c/p\u003e\n\u003cp\u003eAs time flowed, the chaotic fighting at the bottom of the lightning lake gradually came to an end. Those few remaining silver corpses were swiftly destroyed under the combined attacks from many experts. After the final silver corpse vanished, the area gradually descended into a temporarily silence.\u003c/p\u003e\n\u003cp\u003eFresh blood spread within the lightning liquid, causing the silver lightning liquid to turn a little red. There were also many experts who had lost their lives in the earlier fight. Some of this was caused by the attacks of the silver corpses, however, many were also a result of a cold dagger in their backs…\u003c/p\u003e\n\u003cp\u003eAll the experts who had come to this place were extremely ruthless individuals. If there was an opportunity, they would naturally not hesitate to eliminate other competitors.\u003c/p\u003e\n\u003cp\u003e*Pant*.\u003c/p\u003e\n\u003cp\u003eMany experts slowly panted after the fighting came to a halt. The surging Yuan Power around them was quite chaotic. Some of the experts had excited faces because of their gains. However, their eyes were extremely cautious as they watched the surrounding experts. Clearly, they were worried that someone would suddenly attack and snatch the thunderbolt cores they had staked their lives to obtain.\u003c/p\u003e\n\u003cp\u003eFor a time, the atmosphere at the bottom of the lightning lake, which had just seen an end to a bitter battle, had become tense and strange. The experts who were battling side by side earlier began to quietly back away from each other while caution climbed into their eyes.\u003c/p\u003e\n\u003cp\u003e“Hehe.”\u003c/p\u003e\n\u003cp\u003ePang Hao from the Nine Serene Gate suddenly laughed softly amidst this tense atmosphere. He drew the many gazes present towards him.\u003c/p\u003e\n\u003cp\u003ePang Hao ignored those gazes. His playful eyes had already landed on Lin Dong. The latter’s eyes were currently staring back at him in an ice-cold fashion. It seemed that he wished to see just what game the former intended to play.\u003c/p\u003e\n\u003cp\u003e“Brother Lin Dong likely has quite a haul right? I believe that there should be nearly thirty thunderbolt cores in your hands?” Pang Hao’s face was full of smiles as he spoke in a friendly manner.\u003c/p\u003e\n\u003cp\u003eCrash.\u003c/p\u003e\n\u003cp\u003eThese words of his immediately stirred a commotion at the lake bottom. The eyes of some of the experts had immediately become a lot redder. They were only able to obtain two to three thunderbolt cores after fighting with all their might. Yet, Lin Dong was actually in possession of at least a shocking amount of thirty?\u003c/p\u003e\n\u003cp\u003eMany gazes that were tinged with red stealthily shifted. With a woosh, they paused on the Lin Dong duo.\u003c/p\u003e\n\u003cp\u003eFrom a distance away, Liu Xiangxuan and the members of the Mysterious Sky Hall also watched this scene. She was naturally able to tell that Pang Hao was intentionally targeting Lin Dong. However, she did not say anything. She did not have any relation with Lin Dong, hence it was naturally impossible that she would intervene.\u003c/p\u003e\n\u003cp\u003e“That little fellow is rather unlucky. Although they are both rather powerful, they are ultimately not a large faction like us. It is difficult for them to deter the other experts. Currently, he is in possession of nearly thirty thunderbolt cores. It will be difficult for them to not attract the attention of others.” A faint voice was emitted from behind Liu Xiangxuan. It was from a seemingly inconsequential skinny middle aged man.\u003c/p\u003e\n\u003cp\u003e“Does teacher uncle Tao think that we should intervene?” Liu Xiangxuan merely nodded slightly and smiled after hearing the words spoken by this middle aged man.\u003c/p\u003e\n\u003cp\u003e“Let’s sit back and watch. We have also obtained many thunderbolt cores. There is no need to be overly anxious. Moreover, that lad is no ordinary person. It will not be easy for Pang Hao to force him into a desperate state.” The middle aged man softly replied.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eLiu Xiangxuan nodded her head gently. Her pretty eyes looked towards Lin Dong with some curiosity. She could be considered to have exchanged blows with Lin Dong earlier. The latter was indeed quite strong. However, could he really remain this calm when faced with this den of wolves?\u003c/p\u003e\n\u003cp\u003e“This person…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s expression darkened slightly after seeing the many greedy eyes look over. This Pang Hao was quite vicious.These few words had placed Lin Dong in a position where many was against him. The thirty thunderbolt cores were sufficient to cause the hearts of many to be ready to cause trouble.\u003c/p\u003e\n\u003cp\u003e“Bastard.” Mu Lingshan’s small face had turned completely red because of anger. She lifted her sleeve and was prepared to swing the coffin cover at someone. However, she was stopped by Lin Dong’s extended hand.\u003c/p\u003e\n\u003cp\u003e“It is likely that you people from the Nine Serene Gate also possess dozens of thunderbolt cores right?” Lin Dong looked at Pang Hao and suddenly grinned.\u003c/p\u003e\n\u003cp\u003ePang Hao lifted his brow and gave a noncommittal shrug. So what if they had so many thunderbolt cores in their hands? With their great strength and numbers, would there be any experts who would dare target them?\u003c/p\u003e\n\u003cp\u003e“Since brother Pang Hao has paid such close attention to the thunderbolt cores in my hands, why don’t the both of us engage in a bet. Both of us will fight one on one. If I lose, I will distribute all the thunderbolt cores in my hands to everyone present. If you lose, you will hand over all your thunderbolt cores. I will take half while the remaining half will be distributed to all the friends here. What do you say?” Lin Dong smilingly asked.\u003c/p\u003e\n\u003cp\u003eThe commotion around swelled almost instantly after Lin Dong’s words sounded. Many were a little stunned. Soon after, surprise rose within their eyes as their gazes began to shoot towards the nearby Pang Hao.\u003c/p\u003e\n\u003cp\u003e“Ha ha, truly bold. He actually dares to challenge Pang Hao!”\u003c/p\u003e\n\u003cp\u003e“Staking thirty thunderbolt cores. How bold. I wonder if Pang Hao dares to accept.”\u003c/p\u003e\n\u003cp\u003ePang Hao’s expression had become a little ugly due to the many gazes that had turned towards him and the deliberately loud noises created by the crowd. He did not expect that Lin Dong would act be so vicious and directly dragged him into the matter. Moreover, the stakes of the bet he proposed was shocking.\u003c/p\u003e\n\u003cp\u003e“What a cunning fellow…” The middle aged man behind Liu Xiangxuan laughed softly.\u003c/p\u003e\n\u003cp\u003eLiu Xiangxuan nodded gently. In this way, Lin Dong had directly dragged Pang Hao into the most eye-catching position. This person was really sufficiently ruthless. He knew that he might end up being attacked by some greedy individuals if this continued. Immediately, he unhesitatingly dragged Pang Hao down with him.\u003c/p\u003e\n\u003cp\u003e“You wish to challenge me.”\u003c/p\u003e\n\u003cp\u003eThe smile on Pang Hao’s face disappeared bit by bit as a dark and solemn fury replaced it. He did not expect that Lin Dong would be even more cunning than himself. A simple sentence and he had been implicated too.\u003c/p\u003e\n\u003cp\u003eIf he was to shrink back at this moment, it was likely that his name as the leader of the four demon generals from the Nine Serene Gate would become a joke.\u003c/p\u003e\n\u003cp\u003eMurderous intent surged out from Pang Hao’s eyes. Soon after, he clenched his hand as a sinister ten feet long black long whip appeared in his hand. Waves of shocking aura suddenly spread along with a dark and cold voice.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, I’m afraid that you have chosen the wrong target to act tough against this time around!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-949\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-951\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-950","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
