{"id":62021,"no":2265,"title":"Chapter 952 - Vicious","content":"\u003cp\u003eRoar!\u003c/p\u003e\n\u003cp\u003eA low and deep dragon roar suddenly resounded at the bottom of the lightning lake. As the sound waves spread outwards, the surrounding lightning liquid exploded outwards instantly, causing terrifying bolts of lighting to flash as they frantically cackled around.\u003c/p\u003e\n\u003cp\u003eThis dragon roar was different from before. Mixed within that dragon roar, was a thick and intimidating pressure. This pressure caused the expressions of several experts to faintly change, before shocked gazes were cast at a young man.\u003c/p\u003e\n\u003cp\u003eAt this moment, there was a total of twenty green dragon light tattoos dancing and revolving around Lin Dong’s body. Under their illumination, his originally jet black eyes began to glimmer. The current Lin Dong was just like a genuine high ranked dragon clan practitioner, and the pressure and energy fluctuations radiating out of him caused the hearts of several people to palpitate.\u003c/p\u003e\n\u003cp\u003e“What terrifying body tempering martial art is this? Such tyranny, he is actually able to give off the same pressure as those elites from the dragon clan!”\u003c/p\u003e\n\u003cp\u003e“That fellow is truly formidable.”\u003c/p\u003e\n\u003cp\u003eAs surrounding experts felt the astonishing fluctuations radiating from Lin Dong’s body, all their expressions faintly changed. It was likely because it was a rare sight to witness an individual, that was able to temper his body till it was able to emit a pressure comparable to that of an elite dragon clan practitioner.\u003c/p\u003e\n\u003cp\u003e“Such powerful energy.”\u003c/p\u003e\n\u003cp\u003eSeeing Lin Dong in the distance with twenty green dragon light tattoos swivelling around him, while an aura akin to that of a giant dragon radiated out of him, a sliver of graveness flashed across Liu Xiangxuan’s beautiful eyes before she softly commented.\u003c/p\u003e\n\u003cp\u003e“His body refining martial art, is rather unique...perhaps it’s not the slightest bit weaker than our Mysterious Sky Hall’s supreme body refining martial art, the Heavenly Saint Physique Body!” astonishment streaked across the eyes of the middle-aged man behind Liu Xiangxuan as he said.\u003c/p\u003e\n\u003cp\u003e“Such a powerful body refining martial art can’t be easily obtained by any ordinary individual…This brat...might have a startling background.”\u003c/p\u003e\n\u003cp\u003eAs she pondered over this fact, Liu Xiangxuan faintly wrinkled her black brows. They truly knew too little about Lin Dong. This person did not have the slightest bit of fame within the Chaotic Demon Sea and had popped up all of a sudden. Not only did he cause a massive upheaval in the Heavenly Wind Sea Region, he even snatched the silver tower key from the hands of the Demonic Wind Cave, who had paid an exorbitant price for it...\u003c/p\u003e\n\u003cp\u003eMost people simply assumed that Lin Dong was a lone wolf and the formidable martial arts in his possession were likely acquired by chance. However, from the looks of it now, they may have been mistaken...\u003c/p\u003e\n\u003cp\u003e“Regardless, Pang Hao is about to unleash his killing moves…”\u003c/p\u003e\n\u003cp\u003eLiu Xiangxuan raised her head faintly and turned her head towards Pang Hao. At the moment, black light that overflowed throughout the sky had condensed around the latter body. The Sky Splitting Ghost Halberd within his hands trembled continuously, causing ear piercing screeches to ring out, as though it wanted to fly out of his hands.\u003c/p\u003e\n\u003cp\u003eThe fluctuations radiating out from Pang Hao’s body was rather ominous. Obviously, the head of the four demon generals of Nine Serene Gate, was about to use his signature move to end this confrontation.\u003c/p\u003e\n\u003cp\u003e“It’s no wonder you dare to challenge me. Turns out, you’ve been keeping aces up your sleeve.”\u003c/p\u003e\n\u003cp\u003eEncased within the black light that flooded the skies, Pang Hao’s figure appeared akin to a demon god. While his jet black eyes stared at Lin Dong, a fierce and chilling intent surfaced as he sinisterly laughed.\u003c/p\u003e\n\u003cp\u003e“Likewise.”\u003c/p\u003e\n\u003cp\u003eSuffused with green light, Lin Dong also stared back at Pang Hao, while replying with a gentle smile. With a gentle grasp, his muscles faintly tightened up, causing a dragon-like power to rapidly erupt from all the meridians and bones within his body. As of now, Lin Dong had a vague feeling, as though he could destroy anything that stood in front of him with a single punch!\u003c/p\u003e\n\u003cp\u003eTwenty green dragon light tattoos!\u003c/p\u003e\n\u003cp\u003eThere was only a total of twenty three green dragon light tattoos within Lin Dong’s body. Of the twenty three, ten of them were personally refined by him. For the remaining thirteen, they could only be used once and Lin Dong had never used them. However, right now, they were being activated.\u003c/p\u003e\n\u003cp\u003eThis power was indeed quite frightening.\u003c/p\u003e\n\u003cp\u003e“I know that you’ve managed to make a name for yourself in Heavenly Wind Sea Region. However, I’ll let you know that just because you can create chaos, it doesn’t mean that you have the qualifications to dominate the Chaotic Demon Sea!”\u003c/p\u003e\n\u003cp\u003eOminous aura started to creep up sliver by sliver onto Pang Hao’s handsome face. Clenching the shivering long black halberd tightly in his hand, the blood thirsty fluctuations radiating from him grew increasingly rich and strong.\u003c/p\u003e\n\u003cp\u003e“One move. I will finish you off!”\u003c/p\u003e\n\u003cp\u003eThe corner of Pang Hao’s mouth opened, revealing a malevolent smirk. Suddenly, he unclenched his hands, causing a black light to howl forth instantaneously, blotting the skies. In the next instant, transforming into a streak of black light, his long black halberd shot forth. In a flash, a gigantic lightning bolt, approximately hundreds of metres long, rumbled out. An extremely fearsome fluctuation began to crazily pour forth.\u003c/p\u003e\n\u003cp\u003eBang Bang Bang!\u003c/p\u003e\n\u003cp\u003eAs the black lightning bolt shot forth, the lightning liquid within a mile radius started to flare intensely, causing giant lava-like waves to continuously churn.\u003c/p\u003e\n\u003cp\u003e“Heaven Splitter!”\u003c/p\u003e\n\u003cp\u003ePang Hao’s finger instantaneously pointed at Lin Dong as a thunder-like roar rumbled and rang out at the bottom of the lightning lake.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eAs his roar rang out, the hundred plus metre long black lightning bolt paused for a second, before shooting out explosively in the next instant. The split second it occurred, the lightning liquid at the bottom of the lightning lake were seemingly being pressed down. As the black lightning bolt hurled forwards, the space around it started to distort.\u003c/p\u003e\n\u003cp\u003eUpon seeing such an astonishing attack, horror and shock overwhelmed numerous experts in the surroundings. Pang Hao’s attack was definitely able to kill an expert at perfect Profound Life stage!\u003c/p\u003e\n\u003cp\u003e“I wonder if Lin Dong is able to handle that attack!”\u003c/p\u003e\n\u003cp\u003eThis thought flashed within the minds of observer, while the black lightning bolt had already arrived in front of Lin Dong. Without the slightest bit of hesitation, it carried along a devastating force as it violently rumbled towards Lin Dong.\u003c/p\u003e\n\u003cp\u003eAs the gigantic black lighting bolt grew rapidly larger in Lin Dong field of view, the twenty green dragon light tattoos twisting around his body had seemingly sensed the incoming danger before them, as all of them faced the sky and roared.\u003c/p\u003e\n\u003cp\u003e“Let’s see who will have the final laugh!”\u003c/p\u003e\n\u003cp\u003eA similar chilling intent crept up from the corner of Lin Dong’s mouth. The spark within his eyes were as sharp as the edge of a blade. In the next instant, he actually showed no intention of retreating. Clenching his fingers tightly, he took a deep breath before he formed a strange seal with his hands.\u003c/p\u003e\n\u003cp\u003e“Green Dragon Heavenly Seat Seal!”\u003c/p\u003e\n\u003cp\u003eAs Lin Dong’s fist rumbled out, the twenty green dragon light tattoos around his body instantly wrapped around his arm. Amidst a chorus of dragon roars, a bright and resplendent green light gushed out.\u003c/p\u003e\n\u003cp\u003eHumm!\u003c/p\u003e\n\u003cp\u003eEveryone was forced to faintly narrow their eyes due to that resplendent green light. In the next instant, they saw Lin Dong’s fist, wrapped with green light, violently smashing against the gigantic black lightning bolt without the slightest bit of gaudiness.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eA earsplitting explosion instantly resounded out before everyone promptly felt a terrifying shockwave swept forth. As these fluctuations swept out, everyone hastily activated their Yuan Power defences. However, for some of them, they were still blown away and landed in a rather miserable state.\u003c/p\u003e\n\u003cp\u003eHowever, at the moment, they did not care about such matters. After stabilising themselves, they immediately turned their attention towards the spot where the green light had clashed with the black rays of brilliance. All their eyes were filled with shock and astonishment.\u003c/p\u003e\n\u003cp\u003eThey were able to see a thin figure, enveloped by a green light, standing like a mountain under the crazy impact of that black lightning bolt. Furthermore, that figure was just like a mountain; regardless of how violent the winds were, he would not budge at all.\u003c/p\u003e\n\u003cp\u003e“Break!”\u003c/p\u003e\n\u003cp\u003eAs their gazes converged at that location, a low and deep voice rang out from within the green light. The voice was not loud, but it carried an irresistible and authoritative tone.\u003c/p\u003e\n\u003cp\u003eRoar!\u003c/p\u003e\n\u003cp\u003eAs the voice rang out, a dragon roar suffused with thick pressure furiously resounded out. In the next instant, everyone noticed those green dragon light tattoos rapidly condensing together. Forming into a helix, they violently smashed against the black lightning bolt.\u003c/p\u003e\n\u003cp\u003eHumm!\u003c/p\u003e\n\u003cp\u003eThe terrifying impact immediately caused the black lightning bolt to tremble. Faintly, a miserable whimper could be discerned as it rang out from within. In an extremely overbearing fashion, the helical green light ripped apart the black lightning bolt.\u003c/p\u003e\n\u003cp\u003eWhoosh!\u003c/p\u003e\n\u003cp\u003eAs the black lighting bolt was shattered, a black light shot out, before turning into a long black halberd. Without any energy left, it flew back out, while the original brilliance that undulated on its body became abnormally dim at this moment.\u003c/p\u003e\n\u003cp\u003ePuff!\u003c/p\u003e\n\u003cp\u003eAs the long black halberd flew out, a flushed shade erupted on Pang Hao’s face, before blood spurted out from mouth. At the moment, thick horror as well as an incredulous expression gushed from within his eyes.\u003c/p\u003e\n\u003cp\u003eHe could not believe that his overbearing attack was actually crushed by Lin Dong!\u003c/p\u003e\n\u003cp\u003eVictory and defeat was decided by a single move!\u003c/p\u003e\n\u003cp\u003eAs the green light scattered, Lin Dong stared coldly at Pang Hao, whose aura was rapidly declining. Killing intent flashed within his eyes, before he shot out explosively. In a flash, he appeared in front of the latter, before sending a palm violently down on latter’s crown, under the shocked expression of the crowd.\u003c/p\u003e\n\u003cp\u003eThis fellow actually dared to kill Pang Hao?!\u003c/p\u003e\n\u003cp\u003eA few people sucked in a mouthful of cold air. He actually dared to kill Pang Hao in front of the Nine Serene Gate’s elites.\u003c/p\u003e\n\u003cp\u003eHow vicious! Gutsy indeed!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-951\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-953\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-952","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
