{"id":62037,"no":2281,"title":"Chapter 968 - Previous Generation of the Yuan Gate’s Three Little Kings","content":"\u003cp\u003eIn the large hall, while the expression on the grey haired old man’s face was gloomy and in turmoil, the clamoring and noisy hall quieted down. Initially, those surrounding experts, whose eyes were filled with greed, started to furrow their brows. Evidently, the combat prowess displayed by Lin Dong caused them to become extremely wary of him.\u003c/p\u003e\n\u003cp\u003e“Kid, you are pretty skilled indeed. However, do you really believe that you have the qualifications to challenge our Nine Serene Gate? You ought to know that once you leave the Heavenly Lightning Sea Region, our Nine Serene Gate will pursue you till you’ve nowhere left to run, and no corner to hide!”\u003c/p\u003e\n\u003cp\u003e“Since I dare to steal from the Sinister Wind Cave, you should know that these types of threats do not work on me.” Grasping the Lightning Emperor Scepter in his hand, Lin Dong hovered in mid-air before he replied casually, with a faint smile draped across his face.\u003c/p\u003e\n\u003cp\u003eA chilling intent flashed across the grey haired old man’s eyes. Promptly, he intentionally spoke at a slower pace: “If you hand over the Lightning Emperor Scepter, I’ll personally guarantee that all our past grudges shall be erased!”\u003c/p\u003e\n\u003cp\u003e“I believe that there shouldn’t be anyone in the world, who wants to become enemies with a powerful faction, am I right?”\u003c/p\u003e\n\u003cp\u003eHearing those words, the expression on Pang Hao’s face changed immediately. However, just as he was able to speak up, the grey haired old man extended his hand to stop him. With that, he could only clench his teeth in indignation.\u003c/p\u003e\n\u003cp\u003eHearing those words, Lin Dong gave a smile before shaking his head while he replied, “ I do not wish to provoke anyone. However...there are only two words I have to anyone that wants me to surrender the treasures in my hands.”\u003c/p\u003e\n\u003cp\u003e“Piss off!”\u003c/p\u003e\n\u003cp\u003e“You!”\u003c/p\u003e\n\u003cp\u003eWhen he saw that Lin Dong refused to give him face, killing intent finally erupted uncontrollably from the grey haired old man’s eyes. Evidently, he was extremely outraged.\u003c/p\u003e\n\u003cp\u003eUpon witnessing this sight, not a slightest shred of dread appeared on Lin Dong’s face. With a wave of his sleeve, his Heavenly Devouring Corpse reappeared beside him, while his Lightning Emperor Scepter began to sparkle with lightning once again.\u003c/p\u003e\n\u003cp\u003eWhen the grey haired elder saw the Heavenly Devouring Corpse that appeared beside Lin Dong, his body turned sluggish immediately. Previously, he had fought with that strange puppet and he was completely thwarted by the latter. Any attacks that he unleashed seemed to have no impact at all...\u003c/p\u003e\n\u003cp\u003e“You’ll regret this!”\u003c/p\u003e\n\u003cp\u003eThe expression of the grey haired old man turned gloomy as he roared out in rage. At the moment, Lin Dong was no weaker than them. Thus, if they were to forcefully clash with him, it might tempt the surrounding onlookers to take advantage of them.\u003c/p\u003e\n\u003cp\u003eLin Dong still remained unmoved. However, the faint sparkle in his eyes started to glow. Even though he had obtained the Lightning Emperor Scepter, it was not his only goal. He still wanted to enter the Thunder World and obtain the treasure that he had been salivating over for several years, the Thunderbolt Ancestral Symbol!\u003c/p\u003e\n\u003cp\u003eHowever, in order to enter the Thunder World, he would need the two other silver tower keys. Although his current strength has surged substantially, it would still be a stretch for him to fight against the numerous elites from the Nine Serene Gate as well as the Mysterious Sky Hall, ...\u003c/p\u003e\n\u003cp\u003eHe had to find another way to get those two silver tower keys!\u003c/p\u003e\n\u003cp\u003eAs Lin Dong was silently thinking of a solution, some of the experts in the great hall were finally unable to suppress the greed within their hearts. Since they could not get the Lightning Emperor Scepter, the only thing they could do was to hunt for other treasures in this place...\u003c/p\u003e\n\u003cp\u003eWith this thought in mind, some of them started to scatter in an attempt to obtain the treasures above the stone pillar.\u003c/p\u003e\n\u003cp\u003eLin Dong completely ignored their actions. That was because he realized that the Nine Serene Gate, Mysterious Sky Hall, the three members of Yuan Gate, as well as some experts with exceeding powerful auras have not budged an inch. However, their eyes, which were sparkling faintly, seemed to imply that they were after something…\u003c/p\u003e\n\u003cp\u003e“Haha, everyone. Based on what I know, there are items of higher rarity located in this Thunder Hall…”\u003c/p\u003e\n\u003cp\u003eAt this moment, the strange and bizarre atmosphere was suddenly broken by a burly man with a whip in his hand. This burly man’s arms were scarlet red, making them look extremely peculiar and strange. In addition, the aura radiating out from him appeared extremely tyrannical. Although he had yet to step into the Profound Death stage, he was clearly at perfect Profound Life stage.\u003c/p\u003e\n\u003cp\u003eUpon hearing his words, Lin Dong was immediately jolted. It seems like he was not the only one who knew about the existence of the Thunder World...\u003c/p\u003e\n\u003cp\u003e“It’s said that there’s a special space in the Thunder Hall. If one wanted to open this space, one would require all three silver tower keys…” At this moment, the man from the Yuan Gate with drooping hair, butted in. Turning his head around, his eyes landed on Lin Dong, Pang Hao and Liu Xiangxuan, before a smile surfaced on his face.\u003c/p\u003e\n\u003cp\u003eUpon hearing his words, those surrounding experts proceeded to turn and look at Lin Dong, Pang Hao and Liu Xiangxuan. That was because the three of them held the silver tower keys.\u003c/p\u003e\n\u003cp\u003e“The three of you, at this juncture, please stop hiding? Could it be that the three of you plan to monopolize that space all for yourselves?” The man with drooping hair spoke with a sneer on his face.\u003c/p\u003e\n\u003cp\u003e“May I know who you are?” The grey haired old man asked with a gloomy expression on his face, as he stared at the man with drooping hair. He was able to sense a sliver of a dangerous radiating from the latter’s body.\u003c/p\u003e\n\u003cp\u003e“Eastern Xuan Region, Yuan Gate Huo Yuan.” The man with drooping hair replied with a faint smile. “These two are my fellow younger martial brothers, Chen Ling and Li Lei.”\u003c/p\u003e\n\u003cp\u003eUpon hearing those three names, Lin Dong instantly gawked. Promptly, as though he suddenly thought of something, his eyes turned gloomy and frosty, as he slowly said, “The three of you… are the previous three small kings from the Yuan Gate?”\u003c/p\u003e\n\u003cp\u003eWith a smile, Huo Yuan nodded his head. Leaving his gaze on Lin Dong, he replied, “Looks like the three of us are quite well known amongst your Dao Sect’s disciples. I never imagined that there would still be disciples who remembered our names after such a long time.”\u003c/p\u003e\n\u003cp\u003e“How can I forget. During the previous great sect competition, the elder senior sister from our Sky Hall was killed by the three of you.” Lin Dong replied with a faint twitch of his eyelids.\u003c/p\u003e\n\u003cp\u003e“Oh... are you talking about that lady...Haha yes indeed. She was killed by us.” Huo Yuan replied with a laugh, before continuing “ However, we cannot hold a torch to you. Hundreds of elite disciples from our Yuan Gate were directly massacred by you. You are...tsk tsk, truly vicious.”\u003c/p\u003e\n\u003cp\u003eAn indifferent expression remained on Lin Dong’s face. Staring tightly at Huo Yuan and the other two, he nodded his head faintly before saying in a soft voice, “If there’s a chance, I’ll take your lives too.”\u003c/p\u003e\n\u003cp\u003e“Bold...as a matter of fact, the three of us are also planning on killing you, before sending your corpse back to the Dao Sect.” beside Huo Yuan, the silver haired Li Lie grinned as he said.\u003c/p\u003e\n\u003cp\u003eUpon hearing this conversation, some of the surrounding experts in the gawked for a moment, before understanding in a flash. It’s no wonder. Both of them came from the Eastern Xuan Region...\u003c/p\u003e\n\u003cp\u003e“It’s no wonder. Lin Dong comes from the Dao Sect in the Eastern Xuan Region. It’s said that Dao Sect is a super sect and they are not the slightest bit weaker than our Mysterious Sky Hall…” Shock and astonishment filled Liu Xiangxuan’s beautiful eyes as she stared at Lin Dong. Never did she imagine that the latter would have such a background. Nonetheless, that did not really affect her. After all, even though the Dao Sect was powerful, they were unable to interfere in the Chaotic Demon Sea.\u003c/p\u003e\n\u003cp\u003e“You’re pretty famous now within the Eastern Xuan Region. Haha, even the three great sect masters of our Yuan Gate weren’t able to kill you. That’s why you’re able to create quite a commotion in a short period of time after you entered the Chaotic Demon Sea.” Huo Yuan spoke out.\u003c/p\u003e\n\u003cp\u003eAfter he spoke, the atmosphere in the great hall froze in a flash. This time around, shock and astonishment filled Liu Xiangxuan’s beautiful eyes. Three great sect masters attacked simultaneously. However, they could not restrain Lin Dong?\u003c/p\u003e\n\u003cp\u003eAlthough she did not know how powerful the three great sect masters of Yuan Gate were, they should not be inferior to their own sect masters. That meant three top experts at Samsara Stage. Who in world would dare to disrespect such a lineup? However, right now... the person before them, Lin Dong, who was only at advance Profound Life stage, was actually able to escape from them?\u003c/p\u003e\n\u003cp\u003e“This fellow…who is he?” An extremely solemn look erupted from the eyes of Liu Xiangxuan and the experts from the Mysterious Sky Hall. Looking once again at a indifferent Lin Dong, they now felt that he had became even more mysterious. At the same time, the dread that was present within their hearts grew deeper as a result.\u003c/p\u003e\n\u003cp\u003e“Haha. We don’t plan to attack you now. Our current goal is the Thunder World. Therefore… could the three of you please take out your silver tower keys and open the Thunder World.” Huo Yuan spoke out while gesturing with his hand.\u003c/p\u003e\n\u003cp\u003eStaring at Huo Yuan, Lin Dong gave a smile, before nodding his head, “As of now, opening the Thunder World should take priority indeed.”\u003c/p\u003e\n\u003cp\u003eHe was keenly aware that the current situation was rather delicate. The experts from the various factions were mutually guarding against each other. In this situation and with his current strength, it was clear that he could not forcefully snatch the remaining two silver tower keys. In that case, why not open up the Thunder World first? After which, it would depend on one’s ability to acquire the keys in order to enter...\u003c/p\u003e\n\u003cp\u003eAt least, during that chaotic battle, Lin Dong won’t have to fear anyone so long as he wasn’t being teamed up on.\u003c/p\u003e\n\u003cp\u003eAfter he spoke, with a clench of his hand, his silver tower appeared in a flash. Faintly, muffled peals of lightning started to ring out.\u003c/p\u003e\n\u003cp\u003eUpon seeing that, a faint sparkle flashed within the eyes of Liu Xiangxuan and Pang Hao. Exchanging gazes with the people behind them, they finally nodded their heads, flipping their palms over before their silver towers appeared in a flash.\u003c/p\u003e\n\u003cp\u003eAs the three silver towers appeared, lightning suddenly extended out from their bodies. In the next instant, the silver towers flew forth, before floating in mid-air within the great hall. As lightning sparkled around them, they gradually fused together...\u003c/p\u003e\n\u003cp\u003eHumm!\u003c/p\u003e\n\u003cp\u003eThe instant the silver towers fused together, a bolt of lightning shot out all of a sudden. Furthermore, the direction that the lightning bolt was heading towards, was the Lightning Emperor stone statue.\u003c/p\u003e\n\u003cp\u003eChi Chi!\u003c/p\u003e\n\u003cp\u003eAfter the lightning bolt struck the stone statue, a silver glow instantly appeared on that statue. Following which, the space behind its chest started to slowly distort, before a spatial vortex gradually took shape.\u003c/p\u003e\n\u003cp\u003eThe instant the spatial vortex appeared, Lin Dong’s gaze turned fiery hot. He knew...\u003c/p\u003e\n\u003cp\u003eThe Thunder World was definitely within that space!\u003c/p\u003e\n\u003cp\u003eThis meant that the Thunderbolt Ancestral Symbol was definitely within it!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-967\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-969\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-968","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
