{"id":62075,"no":2319,"title":"Chapter 1006 - Encounter","content":"\u003cp\u003eTwo figures swiftly traversed through a forest. They were extremely fast and even if one was to observe carefully, when one saw their figures shuttling through the dense forest, one could only see the rustling leaves and branches, while the duo had already completely disappeared into the distance...\u003c/p\u003e\n\u003cp\u003e“Big brother Lin Dong, those guys are so weak, they hardly live up to their fearsome reputation.”\u003c/p\u003e\n\u003cp\u003eMu Lingshan followed beside Lin Dong as she muttered. Originally, she had expected a huge battle previously. However, she did not expect that the strength of those six people from the Blood Decapitation Guard would actually diminish tremendously after they were separated.\u003c/p\u003e\n\u003cp\u003e“It is just as well. Otherwise, we will end up wasting too much time. The truly capable ones are all hurrying towards Immeasurable Mountain and no one wants to be delayed during their journey. There will naturally be a huge battle once we arrive at the foot of Immeasurable Mountain.” Lin Dong smiled and said.\u003c/p\u003e\n\u003cp\u003e“Moreover, our efforts in fighting with them previously did not go to waste. Didn’t you realise that the number of people obstructing us has diminished…”\u003c/p\u003e\n\u003cp\u003eMu Lingshan tilted her head and mused for a moment. She realised that this was indeed the case. Along the way, some individuals, who originally had ill intent within their eyes, withdrew their emotions. When they met two groups engaging in an intense fight previously, both parties had actually halted their battle and allowed the two of them to pass through the battleground. In fact, not a single one of them dared to attack…\u003c/p\u003e\n\u003cp\u003eThis was clearly related to the fact that the two of them had defeated the Blood Decapitation Guard earlier.\u003c/p\u003e\n\u003cp\u003e“In that case, we should increase our speed. I really wish to see what powerful individuals are gathered at the foot of Immeasurable Mountain.” Mu Lingshan chuckled.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded. His toes pressed on a delicate branch that was extended out from within the dense forest. After which, his body shot forward like an eagle…\u003c/p\u003e\n\u003cp\u003eAs they journeyed on, although the number of powerful individuals around them decreased, the strength of their auras left shock in Lin Dong’s heart. However, at the same time, those experts also revealed a great fear within their eyes when they saw the Lin Dong duo. Upon establishing eye contact, they would quickly flee into the distance. Clearly, they were afraid that the Lin Dong duo would attack them…\u003c/p\u003e\n\u003cp\u003eLin Dong involuntarily laughed in his heart when he realised this. Promptly, he shook his head and ignored them, before he led Mu Lingshan and increased their travelling speed.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eLin Dong’s body was like an agile monkey as he shuttled through the forest. He lifted his head to look afar. At their current speed, they should arrive at the foot of Immeasurable Mountain in approximately half an hour’s time…\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eLin Dong suddenly focused his pupils as his body flashed passed. Promptly, he waved his hand gently. Behind him, Mu Lingshan hurriedly caught up and asked, “What happened?”\u003c/p\u003e\n\u003cp\u003eLin Dong gradually slowed down before he landed on a large tree. His eyes looked at the open plot of land in front of him. At that spot, a bloody aura radiated from it. Over a dozen corpses were on the ground, dying the ground into a bloody red colour.\u003c/p\u003e\n\u003cp\u003e“They were all killed…” Mu Lingshan frowned as she stared at this scene. Everyone who entered the Immeasurable Mirror had a spiritual seal in their hands and they were able to escape by breaking it. Yet, these people were actually killed… Clearly, the murderer did not even give them the time to shatter their spiritual seal.\u003c/p\u003e\n\u003cp\u003eHis strength and technique were abnormal and vicious.\u003c/p\u003e\n\u003cp\u003eLin Dong lowered his body and landed in front of those corpses. Using his finger to touch the blood, he activated his Devouring Power at the same time. A trace of extremely faint black Qi emerged from within their blood.\u003c/p\u003e\n\u003cp\u003e“It’s Yimo Qi…”\u003c/p\u003e\n\u003cp\u003eLin Dong remarked in a faint voice, “The person who killed them is a Yimo… If I am not mistaken, this should be done by either Xu Xiu or Hua Chen…”\u003c/p\u003e\n\u003cp\u003eThese people were all quite powerful. However, none of them could put up much of a resistance before their deaths. Obviously, only a handful of people participating in this competition could accomplish a feat like this. Additionally, the Yimo was related. Hence, one could easily decipher who the perpetrator was without even thinking...\u003c/p\u003e\n\u003cp\u003e“They are using this path as well?” Mu Lingshan exclaimed in surprise. They should be meeting such troublesome opponents at the end...\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eLin Dong lifted his head and looked afar. Both his eyes narrowed before his body hurried forward.\u003c/p\u003e\n\u003cp\u003eLin Dong once again discovered a few similar sights during his subsequent journey. Those experts were all killed before they could shatter the spiritual seal in their hands. This caused Lin Dong’s eyes to turn icy. That fellow was truly ruthless. It was obvious that there was no need to kill in a place like this. Yet, he still murdered everyone he met.\u003c/p\u003e\n\u003cp\u003e“There is something going on in front. Be careful.” Lin Dong’s eyes were slightly cold as he stared deep into the forest. At that spot, he once again detected a frightening ripple.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003eA couple of miserable human were gathered together on an empty space deep within the forest. At this moment, their eyes contained some horror as they stared at a man standing on a tree branch in front of them.\u003c/p\u003e\n\u003cp\u003eThe three leaders of the group were not unfamiliar faces. They were Huang Ling, Chen Qing and Li Lin, who had a conflict with Lin Dong back at the welcoming pavilion.\u003c/p\u003e\n\u003cp\u003eMoreover, the most shocking thing was that even with three powerful people, who were on the top ten on the rookie list, gathered together, they were actually reduced into such a miserable state. Just how powerful must the person who forced them into such a miserable state be?\u003c/p\u003e\n\u003cp\u003eRight now, the Huang Ling trio’s eyes were staring intently at the area in front of there. There was a black clothed man standing on a tree branch. The man looked ordinary and unremarkable, while the corner of his lips had a smile. His smile however, appeared like the smile of a grim reaper in the eyes of Huang Ling’s group. It caused a dense chill to rise in their hearts.\u003c/p\u003e\n\u003cp\u003ePreviously, the three of them could not even last for a single exchange against this person, despite joining forces. His terrifying strength left them in a state of disbelief.\u003c/p\u003e\n\u003cp\u003e“The rookie list of the Chaotic Demon Sea is hardly worth mentioning…” The black clothed man laughed softly. He looked at the miserable looking Huang Ling trio and laughed.\u003c/p\u003e\n\u003cp\u003e“You!”\u003c/p\u003e\n\u003cp\u003eHuang Ling was furious. He was just about to cry out angrily when he was stopped by Chen Qing beside him. “This person is extremely mysterious. His strength is probably comparable to Tang Xinlian and Zhou Ze. We are no match for him. Let’s leave!”\u003c/p\u003e\n\u003cp\u003eHuang Ling’s expression changed slightly upon hearing this. His face appeared extremely unwilling. It was far too embarrassing to flee now.\u003c/p\u003e\n\u003cp\u003e“Oh, if you are thinking of leaving now… perhaps you are overthinking.” The black clothed man smilingly said.\u003c/p\u003e\n\u003cp\u003eThe expression in the eyes of the Chen Qing was altered upon hearing these words. He hurriedly opened his hand, only to discover that the spirit seal in his hand had vanished mysteriously. A strange black line remained on their hands.\u003c/p\u003e\n\u003cp\u003e“What have you done?” Chen Qing’s eyes shrunk as he cried out in a stern manner.\u003c/p\u003e\n\u003cp\u003e“I do not like to leave survivors behind when I do things.” The black clothed man laughed. A merciless expression rose from deep within his eyes. “Hence, all of you should remain here.”\u003c/p\u003e\n\u003cp\u003eThe black clothed man grabbed forward after his voice sounded. Majestic evil black Qi came sweeping over. It directly turned into a large hand, which ruthlessly swiped against the Huang Ling’s group.\u003c/p\u003e\n\u003cp\u003eBang bang bang!\u003c/p\u003e\n\u003cp\u003eHuang Ling’s group was naturally unwilling to simply surrender. Powerful Yuan Power erupted. However, their seemingly sharp and powerful martial arts vanished after striking against the huge black Qi palm.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eThe shock within the eyes of Huang Ling’s group deepened after they saw that their attacks were ineffective. Where did the guy in front of them come from? He was actually this mysterious? After all, they had never heard of such an individual in the Chaotic Demon Sea.\u003c/p\u003e\n\u003cp\u003e“Time to die.”\u003c/p\u003e\n\u003cp\u003eThe man with a black aura smiled. His hand flashed and appeared above the head of Huang Ling’s group. However, before his palm could smash downwards, a thunder roar suddenly sounded in this forest. A lightning dragon shot into the dense forest from outside. After which, it ruthlessly collided against the huge palm.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eWild and violent air wave spread apart. Huang Ling and the rest were forced backwards. While they were in a state of confusion, two figures shuttled through the dense forest and landed in front of them.\u003c/p\u003e\n\u003cp\u003e“Lin Dong?”\u003c/p\u003e\n\u003cp\u003eHuang Ling’s group looked at the two figures who had appeared in front of them. Promptly, they were completely startled. Eventually, their expressions turned complicated. They did not expect that the ones who had intervened and rescued them, would actually be Lin Dong, whom they had a conflict with.\u003c/p\u003e\n\u003cp\u003eHowever, the current Lin Dong did not care about them. Instead, his eyes stared intently at the mysterious black clothed man in front of him. The latter clearly did not look like the faceless person, Xu Xiu, who was ranked first on the rookie list.\u003c/p\u003e\n\u003cp\u003e“Ah, I have finally met you…” The black clothed man looked at Lin Dong, who had appeared. He was slightly startled before laughing softly.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were sharp. He looked at the black clothed man and slowly said, “You are Hua Chen from Yuan Gate, am I right?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1005\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1007\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1006","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
