{"id":62126,"no":2370,"title":"Chapter 1057 - Ancestral Soul Hall","content":"\u003cp\u003eLin Dong stood on the branch of a tree as his gaze looked forward where an empty plot of land in the Nine-tail village was located. At this moment, almost everyone from the Nine-tail tribe was gathered here, and the atmosphere appeared somewhat sad.\u003c/p\u003e\n\u003cp\u003eEarlier, Aunt Xin had already mentioned that Xin Qing wanted to attempt the Ancestral Soul Hall. This naturally caused a commotion in the tribe. Unexpectedly, no one objected to it. Some of the young ladies were rather sorrowful. It was likely that this life of living on tenterhooks had caused them to feel a sense of hopelessness…\u003c/p\u003e\n\u003cp\u003eLin Dong sighed helplessly as he observed this atmosphere. Soon after, he asked in his mind, “Yan, is what you said to me yesterday true?”\u003c/p\u003e\n\u003cp\u003eWhen Lin Dong declared that he would accompany Xin Qing to the Ancestral Soul Hall last night, the usually nowhere to be found Yan had suddenly appeared. After which, the latter told him some information about the Nine-tail tribe of ancient times…\u003c/p\u003e\n\u003cp\u003e“In that ancient times, the Nine-tail tribe was also an overlord tribe in the Demonic Beast World. At that time, there were a total of three Reincarnation stage peak experts in their tribe… Their powers were comparable to the Nine Phoenix, Kun Peng and other overlord tribes.” Yan explained in an unhurried manner.\u003c/p\u003e\n\u003cp\u003e“Three Reincarnation stage experts…” Lin Dong’s eyes widened. Such power was indeed terrifying.\u003c/p\u003e\n\u003cp\u003e“During the great world calamity back then, the Nine-tail tribe followed by my master’s side and made significant contributions in the world war. However, the Nine-tail tribe was also targeted by the Yimo because of this. The top experts in the tribe were killed until barely any were left. In the final battle, the last Nine-tail spirit fox of their tribe sacrificed her life to seal and suppress three Yimo kings…”\u003c/p\u003e\n\u003cp\u003e“Suppressing three Yimo kings…”\u003c/p\u003e\n\u003cp\u003eOne could tell from Lin Dong’s eyes that he was strongly affected by this information. Back at Fiery Flame City, not only was Qing Zhi forced to use the King Destroying Heavenly Plate, but he also needed the support of four Ancestral Symbols in order to destroy an Yimo king. Even so, the other Yimo king eventually managed to escape with some of the former\u0027s essence blood. Yet, the ancestor of the Nine-tail tribe had relied on her own strength to suppress three Yimo king. Although she paid for it with her life, this was still quite terrifying.\u003c/p\u003e\n\u003cp\u003e“I suspect that the reason the Nine-tail tribe never managed to recover is because of this.” Yan mused.\u003c/p\u003e\n\u003cp\u003eLin Dong narrowed his eyes.\u003c/p\u003e\n\u003cp\u003e“You should indeed make a trip to the Ancestral Soul Hall and find out what is going on…” Yan said. However, Lin Dong could sense something strange from his words.\u003c/p\u003e\n\u003cp\u003e“Is there anything else you want to say?” Lin Dong was meticulous and immediately voiced his suspicions.\u003c/p\u003e\n\u003cp\u003e“Heh heh, this ancestor of the Nine-tail tribe was deeply in love with the Devouring Master in the ancient times… As an inheritor of the Devouring Ancestral Symbol, you might be able to reap some benefits.”\u003c/p\u003e\n\u003cp\u003eLin Dong was stunned. There was actually such a matter? It seemed like the previous owner of the Devouring Ancestral Symbol was quite charming indeed. He was even able to subdue an ancestor of the Nine-tail tribe.\u003c/p\u003e\n\u003cp\u003e“Are you certain that the Devouring Master did not let that person down back then?” Lin Dong involuntarily asked. He did not wish to receive terrible treatment due to the Devouring Ancestral Symbol when the time came.\u003c/p\u003e\n\u003cp\u003e“What romance could there be back then. If we lost the world war, everything in this world would suffer under the Yimo’s cruelty… Who wasn’t risking their lives in the fight to protect their loved ones.” Yan said.\u003c/p\u003e\n\u003cp\u003eLin Dong slowly nodded. At such a time, even personal grudges would completely disappear…\u003c/p\u003e\n\u003cp\u003e“Young brother Lin Dong.”\u003c/p\u003e\n\u003cp\u003eA voice was suddenly transmitted from nearby while Lin Dong and Yan were conversing. He saw Aunt Xin, Xin Qing and some Nine-tail tribe’s elders looking at him.\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eLin Dong nodded upon seeing this. His body moved and he appeared beside them.\u003c/p\u003e\n\u003cp\u003e“Young brother Lin Dong, are you sure about this? The Ancestral Soul Hall is extremely dangerous. No one has been able to come out alive for so many years…” Aunt Xin watched Lin Dong and could not help but warn.\u003c/p\u003e\n\u003cp\u003e“Aunt Xin, please lead the way.” Lin Dong smiled and did not say anything else.\u003c/p\u003e\n\u003cp\u003eAunt Xin sighed softly after seeing this. Without further ado, she turned around and led the way, heading straight for the depths of the Nine-tail village.\u003c/p\u003e\n\u003cp\u003e“Relax, everything will be fine.” Lin Dong grinned at Xin Qing who had been staring at him since the beginning. The latter slightly pursed her tiny mouth and nodded slightly.\u003c/p\u003e\n\u003cp\u003eThe group followed behind Aunt Xin and headed towards the deeper parts of the Nine-tail village. This continued for around half an hour, before some ruins appeared deep within the dense depths of the forest. There was a huge altar at the centre of the ruins.\u003c/p\u003e\n\u003cp\u003eAunt Xin led the group as they walked up the altar. A stone platform was located at the middle of the altar. With a clench of her fist, a palm sized bronze statue appeared.\u003c/p\u003e\n\u003cp\u003eThe bronze statue was a blood red fox. However, there were nine tails dancing behind it. Although this statute was not real, Lin Dong was still able to detect a monstrous demonic aura from it.\u003c/p\u003e\n\u003cp\u003eLooks like the most important thing of the Ancestral Soul Hall was this bronze fox statue. The altar should be some kind of support for it.\u003c/p\u003e\n\u003cp\u003e“Are the both of you ready?” Aunt Xin looked at Lin Dong and Xin Qing as she asked.\u003c/p\u003e\n\u003cp\u003e“Yes.” Both of them deeply inhaled and nodded.\u003c/p\u003e\n\u003cp\u003eAunt Xin also nodded upon seeing this. She placed the bronze statue on the stone platform and flickered her finger. A ball of blood appeared with a flash which gave off a rich bloody scent.\u003c/p\u003e\n\u003cp\u003e“This is the blood of all the tribe members of our Nine-tail tribe… and it is only possible to open the Ancestral Soul Hall through this method. However… each time the Ancestral Soul Hall is opened, it would exhaust a great amount of the bronze statue’s energy. This is likely the last time that we can open it. After which, the bronze statue will shatter…” Xin Qing softly explained beside Lin Dong.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded slightly. It seemed that this was the final chance for her Nine-tail tribe.\u003c/p\u003e\n\u003cp\u003e“Buzz buzz.”\u003c/p\u003e\n\u003cp\u003eThe blood coloured Nine-tail spirit fox seemed to have been revived when the ball of blood landed on the bronze statue, and actually let loose a long howl towards the sky. Dark clouds churned in the sky at this moment and the blood ball turned into a ray of blood red light that was absorbed into the mouth of the Nine-tail fox.\u003c/p\u003e\n\u003cp\u003eAo!\u003c/p\u003e\n\u003cp\u003eThis ancient howl contained a bleak feeling as it reverberated across the land. The Nine-tail spirit fox on the altar seemed to glance at Lin Dong and the others, before a blood light erupted from its mouth. The light turned into a huge blood red door in front of them.\u003c/p\u003e\n\u003cp\u003e“Please enter. This is the Ancestral Soul Hall.” Aunt Xin’s hands were tightly clenched as she softly said.\u003c/p\u003e\n\u003cp\u003e“Sir Lin Dong, you must enter with me. Otherwise, you will be expelled.” Xin Qing glanced at Lin Dong before extended her delicate small hand. Lin Dong hesitated for a moment before grabbing it. An icy cool feeling appeared in his hand, indicating the unease and anxiety in the young lady’s heart.\u003c/p\u003e\n\u003cp\u003e“Let’s go.”\u003c/p\u003e\n\u003cp\u003eLin Dong grinned at her. Without any hesitation, he opened his stride, pulling Xin Qing as they walked into the blood red door.\u003c/p\u003e\n\u003cp\u003eBuzz.\u003c/p\u003e\n\u003cp\u003eThe blood red door rippled as light swept across those two. Subsequently, the door shuddered and the Lin Dong duo vanished…\u003c/p\u003e\n\u003cp\u003eAunit Xin and the rest watched as the two disappeared. Soon after, they gently clenched their hands and continuously mumbled, “Ancestor, please protect the final hope of our Nine-tail tribe.”\u003c/p\u003e\n\u003cp\u003eWhile they were sofly muttering, no one noticed that the Nine-tail fox statue on the altar was watching the blood red door with a faint sadness in its eyes.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eWhen he stepped into the blood red door, Lin Dong was able to detect an extremely powerful spatial fluctuation. After which, the blood light before his eyes suddenly brightened before rapidly diming. Lin Dong’s sight also quickly recovered as Yuan Power began to swiftly circulate within his body.\u003c/p\u003e\n\u003cp\u003eLin Dong glanced around but found that there was no danger like he had anticipated. An incomparably vast blood red sea entered his eyes. At this moment, they were standing on a path above this huge ocean and there seemed to be a relatively large square at the end of this path.\u003c/p\u003e\n\u003cp\u003eXin Qing’s clear eyes gazed at the huge square at the end of the path. She quickly released Lin Dong’s hand and swiftly walked towards it. She could sense a beckoning call that seemed to originate from the ancient times from there.\u003c/p\u003e\n\u003cp\u003eLin Dong followed closely behind Xin Qing. His eyes continued to sweep across this blood red realm while slivers of black light and lightning arcs quietly flashed and danced on his hands within his sleeves.\u003c/p\u003e\n\u003cp\u003eThe both of them quickly arrived at the square. After which, Lin Dong saw a hundred thousand feet large stone statue standing at that centre of the square. The stone statue seemed to be a Nine-tail spirit fox. However, its aura was many times stronger than the bronze statue from earlier. Even though Lin Dong was looking at it from a great distance, he could still feel his heart beat faster.\u003c/p\u003e\n\u003cp\u003e“This is our ancestor…” Xin Qing looked at the stone statue as a feverish look rose in her eyes.\u003c/p\u003e\n\u003cp\u003e“This is the ancestor’s skeleton.”\u003c/p\u003e\n\u003cp\u003eLin Dong was slightly startled. It turned out that this was not a stone statue. Instead, it was a skeleton of a true Nine-tail spirit fox… no wonder it possessed such a terrifying aura.\u003c/p\u003e\n\u003cp\u003eXin Qing quickened her pace. After which, she stopped when she was still ten thousand feet from the Nine-tail spirit fox skeleton and knelt down. Both of her hands formed a rather unique posture as three fluffy tails extended from her back.\u003c/p\u003e\n\u003cp\u003eLin Dong stood behind her and quietly watched this scene.\u003c/p\u003e\n\u003cp\u003eAn ancient and desolate song was suddenly emitted from Xin Qing’s mouth after she displayed this posture. This ancient song reverberated across the realm and in that moment, they appeared to have returned to ancient times.\u003c/p\u003e\n\u003cp\u003eBuzz buzz!\u003c/p\u003e\n\u003cp\u003eAs the song reverberated. Lin Dong could sense that the Yuan Power in the area begin to ripple. After which, bits of blood light began to gather on the bones of the Nine-tail spirit fox.\u003c/p\u003e\n\u003cp\u003eThe blood light rapidly gathered and very quickly transformed into a human figure. A lady figure of light appeared after the light scattered. The lady was wearing gorgeous clothes and her appearance was extremely seductive. Every frown and smile of hers seemed to make the world appear a little dimmer.\u003c/p\u003e\n\u003cp\u003e“Ancestor…”\u003c/p\u003e\n\u003cp\u003eXin Qing looked at the incomparably seductive light figure as tears involuntarily flowed from her eyes.\u003c/p\u003e\n\u003cp\u003e“My tribe member…”\u003c/p\u003e\n\u003cp\u003eThe female light figure’s eyes were gentle as she looked at Xin Qing below. Next, she gently extended her fair and slender hand. That gentle voice of hers was filled with a shocking bewitchment.\u003c/p\u003e\n\u003cp\u003e“Receive my inheritance. I have waited a very long time for you…”\u003c/p\u003e\n\u003cp\u003eXin Qing slowly extended her small hand as she looked at this light figure. However, just as she was about to make contact with the light figure, a hand was suddenly reached out from behind and grabbed her hand.\u003c/p\u003e\n\u003cp\u003eXin Qing was startled because of this. She quickly looked towards the grave looking Lin Dong with lost eyes. “Sir Lin Dong…”\u003c/p\u003e\n\u003cp\u003eLin Dong ignored her. All he did was stare firmly at the incomparably enchanting lady. After which, he pulled Xin Qing as they slowly withdrew. A voice which caused Xin Qing’s body to suddenly turn ice-cold was emitted from his mouth.\u003c/p\u003e\n\u003cp\u003e“You are not a Nine-tail spirit fox…”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1056\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1058\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1057","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
