{"id":62128,"no":2372,"title":"Chapter 1059 - Inheritance","content":"\u003cp\u003eWarm white light shot down from the light array and wrapped around the enchanting woman. Although the white light was gentle, it was clearly extremely deadly against the Yimo. White light shuttled around her body as wisps of black Qi were rapidly forced out…\u003c/p\u003e\n\u003cp\u003e“Ah!”\u003c/p\u003e\n\u003cp\u003eSharp miserable screeches continued to reverberate, however, Lin Dong did not sway. A thought passed through his mind and the formation rotated faster and faster.\u003c/p\u003e\n\u003cp\u003e“Ah, I am really resentful. Just a little more blood and flesh and we would have been able to rebuild our body…”\u003c/p\u003e\n\u003cp\u003eThe enchanting woman let out a long and piercing howl. The howl was filled with fury and resentment. They had finally saw some hope after tens of thousands of years. However, this hope had now been completely destroyed.\u003c/p\u003e\n\u003cp\u003e“Since you are already dead… stop causing trouble. Disappear obediently from this world.”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were indifferent as he completely ignored her resentful roar. A solemn expression flashed across those pitch-black eyes of his as the density of the white light pillar swiftly increased. In the end, it turned into two fingers, one thick and the other thin. Like a white light thorn, they ruthlessly shot into the forehead of the enchanting woman with a ‘swoosh’ sound, penetrating her body!\u003c/p\u003e\n\u003cp\u003eHowever, no blood flowed from this hole. Wisps of black Qi surged out from within her body in a frightened manner before disappearing with a bang.\u003c/p\u003e\n\u003cp\u003eCrack,\u003c/p\u003e\n\u003cp\u003eThe faint sound of something breaking stealthily echoed from within the body of the enchanting woman.\u003c/p\u003e\n\u003cp\u003e“Ah!”\u003c/p\u003e\n\u003cp\u003eThe mournful shrieking gradually faded at this moment as those bewitching eyes slowly shut themselves. The devil Qi that filled the place had completely vanished.\u003c/p\u003e\n\u003cp\u003eLin Dong looked the bewitching woman who was floating in the sky with shut eyes. He beckoned with his hand and the Ancestral Stone flew back into his hand before it finally disappeared with a flash.\u003c/p\u003e\n\u003cp\u003e“Sir Lin Dong, what happened?” Xin Qing hurriedly asked from the side.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were tightly focused on the bewitching woman. The spinning thunderbolts and black light above his head did not show any signs of dispersing. Although the Ancestral Stone possessed the ability to purify Yimo Qi, no one knew if the Yimo king’s consciousness in her body had really been completely removed…\u003c/p\u003e\n\u003cp\u003eA couple of minutes passed while Lin Dong’s observation continued. Light suddenly gushed out from the body of the enchanting woman once again. However, this time around, it was not an evil aura. Instead, it was a somewhat pink radiance.\u003c/p\u003e\n\u003cp\u003eThe pink light spread and the tightly shut eyes of the enchanting woman slowly opened. She looked at the Lin Dong duo and smiled. Her smile contained a frightening bewitchment.\u003c/p\u003e\n\u003cp\u003e“Nine-tail spirit fox?” Lin Dong looked at the enchanting woman who had once again opened her eyes as his brows raised a little. The feeling that the latter gave him was completely different from earlier.\u003c/p\u003e\n\u003cp\u003e“Is she finally free…”\u003c/p\u003e\n\u003cp\u003eThe enchanting woman lowered her head to look at her long and slender hands. A complicated expression filled her bewitching eyes. After which, she glanced at Lin Dong and nodded gently, “This young friend… thank you.”\u003c/p\u003e\n\u003cp\u003eAlthough her consciousness had been suppressed, she was clearly aware of what was going on outside.\u003c/p\u003e\n\u003cp\u003eLin Dong quietly sighed in relief. If the Nine-tail spirit fox’s consciousness was erased, it would be meaningless for Xin Qing to come to this Ancestral Soul Hall.\u003c/p\u003e\n\u003cp\u003e“Ancestor…”\u003c/p\u003e\n\u003cp\u003eXin Qing’s eyes reddened once again as she gazed upon the Nine-tail spirit fox. The ripples from the latter’s body caused her to feel a great reliance towards the latter.\u003c/p\u003e\n\u003cp\u003e“My tribe member…”\u003c/p\u003e\n\u003cp\u003eThe Nine-tail spirit fox gently descended from the air. Her eyes contained gentleness and guilt as she looked at Xin Qing. After which, she extended her arms and embraced the latter as she mumbled, “Ancestor has let all of you down…”\u003c/p\u003e\n\u003cp\u003e“You should be aware of what happened here, right?” Lin Dong asked.\u003c/p\u003e\n\u003cp\u003eA gloomy expression flashed across the eyes of the Nine-tail spirit fox as she slowly nodded and said, “Back then, I ignited my demonic spirit to suppress three king rank Yimo. I originally intended to die along with them, but I underestimated the strong life force of those creatures. Although our physical bodies degraded over time, the consciousness of those three continued to be tightly entwined with my own. Finally, they invaded my consciousness and suppressed me…”\u003c/p\u003e\n\u003cp\u003e“The reason the Nine-tail tribe remained ordinary for so many years should also be related to this, right?” Lin Dong frowned slightly.\u003c/p\u003e\n\u003cp\u003eThe Nine-tail spirit fox nodded in a bitter manner. She stroked Xin Qing’s long hair and said, “There is a blood link between the members of the Nine-tail tribe. Through my body, those three fellows used some insidious methods to interfere with the bloodline of the tribe. This caused all the members of the tribe to be unable to reach the highest cultivation stage…”\u003c/p\u003e\n\u003cp\u003e“While the tribe members were at their wits end, they thought of going to the Ancestral Soul Hall to seek answers. However, my spiritual body had already been taken over by those three fellows. All I could do over the years was to watch the members of the tribe come here and end up being tricked by them into entering the sea of blood and turning into blood energy…”\u003c/p\u003e\n\u003cp\u003eThe voice of the Nine-tail spirit fox was filled with grief. This helpless feeling of watching while being powerless to stop them had tormented her greatly.\u003c/p\u003e\n\u003cp\u003eXin Qing deeply bit into her lips while tears gathered within her large eyes.\u003c/p\u003e\n\u003cp\u003e“I know that the lives of my tribe members have been extremely bitter over these years… This is my fault.” The Nine-tail spirit fox softly said.\u003c/p\u003e\n\u003cp\u003e“Ancestor is not at fault… Those Yimo are far too malicious.” Xin Qing shook her head and said.\u003c/p\u003e\n\u003cp\u003e“Elder is a virtuous person.” Lin Dong spoke in a deep voice. He had great admiration for this act of self-sacrifice by the Nine-tail spirit fox.\u003c/p\u003e\n\u003cp\u003e“Virtuous? Ha ha, a little lass like me cannot shoulder such words… It is just that everyone will suffer when disaster strikes. No one could hide from the world war.”\u003c/p\u003e\n\u003cp\u003eThe Nine-tail spirit fox smiled faintly. She glanced at the Devouring Ancestral Symbol floating above Lin Dong’s head before a complicated feeling flashed across her eyes. She said, “Moreover, that fellow loves to cause trouble… He even dared to cross the crack between the planes and charge into the Yimo tribe… I merely accompanied him during his adventures.”\u003c/p\u003e\n\u003cp\u003eLin Dong was slightly startled. Immediately, he understood that she was referring to the Devouring Master. It seemed like the latter was a ferocious individual. To think that he actually dared to cross the crack between the planes…\u003c/p\u003e\n\u003cp\u003e“Elder, will the Nine-tail tribe regain its glory?”\u003c/p\u003e\n\u003cp\u003e“Now that I am no longer being suppressed of those three fellows, their interference will also disappear…”\u003c/p\u003e\n\u003cp\u003eThe Nine-tail spirit fox lifted her head and looked at the sea of blood as she softly said, “This sea of blood is created from the experts of the Nine-tail tribe that have come in the past tens and thousands years. It also contains the pure energy from the three Yimo kings. Young friend, when you leave this place, please tell the current tribe members to activate the formation that I left behind and completely seal the mountain. I will return the energy here to them…”\u003c/p\u003e\n\u003cp\u003eLin Dong was a little surprised. The energy here was far too frightening. Just how many experts would be created if it was returned to the current Nine-tail tribe? Looks like the Nine-tail tribe truly had the hope of rising again.\u003c/p\u003e\n\u003cp\u003eLin Dong smiled on top of feeling surprised. He lowered his head to look at Xin Qing and said, “From now on, all of you no longer need to beg anyone else to protect you.”\u003c/p\u003e\n\u003cp\u003eHe understood that once the Nine-tail tribe emerged from their sealed mountain status, this former overlord tribe of the Demonic Beast World would once again stand at the top of the Demon Region. They would no longer need to worry about anyone having ill thoughts towards them.\u003c/p\u003e\n\u003cp\u003e“Sir Lin Dong… you are the benefactor of our Nine-tail tribe. Even if the Nine-tail tribe regains its previous glory, we will assist you like how our ancestor assisted the Devouring Master.”\u003c/p\u003e\n\u003cp\u003eXin Qing glanced at Lin Dong. A special ripple flashed within her eyes. She suddenly turned around and put both hands on her forehead. Her three fluffy tail leaned against her back, appearing just like a small fox that was paying respect to the moon as she gently knelt toward Lin Dong.\u003c/p\u003e\n\u003cp\u003eA slightly stunned expression flashed across the Nine-tail spirit fox’s eyes when she saw Xin Qing’s kneeling posture. She took another glance at Lin Dong and her mouth moved as if she wanted to say something, before she finally choose to remain silent.\u003c/p\u003e\n\u003cp\u003eShe did not inform Lin Dong that this was the highest grace of the Nine-tail tribe… only the Nine-tail tribe chief and successor had the qualifications to use it. This was because it represented the entire Nine-tail tribe.\u003c/p\u003e\n\u003cp\u003eSuch a formality had only appeared twice in the Nine-tail tribe. The first was when she used it on the Devouring Master. The second was occurring right before her eyes...\u003c/p\u003e\n\u003cp\u003e“Devouring Master, Devouring Ancestral Symbol…”\u003c/p\u003e\n\u003cp\u003eThe Nine-tail spirit fox softly sighed in her heart as she smiled bitterly. Does my Nine-tail tribe truly owe you? It seems that we will never able to cut the ties between us.\u003c/p\u003e\n\u003cp\u003eLin Dong was unfamiliar with such formality. Naturally, he did not understand what it represented. He merely squatted and smiled gently as he rubbed Xin Qing’s small head.\u003c/p\u003e\n\u003cp\u003e“This girl is extremely talented…” The Nine-tail spirit fox glanced at Xin Qing with a small smile and said, “Are you willing to receive my inheritance?”\u003c/p\u003e\n\u003cp\u003eShe quickly approached Xin Qing. Using a soft voice that only the both of them could hear, she said, “Only by becoming strong, will one have the qualifications to pursue the person that one likes…”\u003c/p\u003e\n\u003cp\u003eXin Qing’s small face reddened a little. Immediately, she slowly shook her head under the Nine-tail spirit fox surprised eyes and softly said, “I am merely a little girl… however, I require the ancestor’s inheritance. It will be alright as long I am able to help like ancestor helped the Devouring Master back then…”\u003c/p\u003e\n\u003cp\u003eThe Nine-tail spirit fox once again smiled bitterly. This was a scene that she was extremely familiar with…\u003c/p\u003e\n\u003cp\u003eTheir voices were extremely soft and Lin Dong naturally did not have any intention of trying to eavesdrop. Hence, he stood by the side and occasionally glanced over in an innocent manner, only to see the Nine-tail spirit fox secretly staring at him. He quickly laughed dryly. Could it be that she was treating him as the Devouring Master in her heart?\u003c/p\u003e\n\u003cp\u003e“This little girl will stay here and receive my inheritance.”\u003c/p\u003e\n\u003cp\u003eThe Nine-tail spirit fox stood up in an elegant manner and said, “This might require a rather long time. Of course, the process will also be quite painful. Are you sure about this?”\u003c/p\u003e\n\u003cp\u003eXin Qing slowly nodded. Her eyes were filled with determination.\u003c/p\u003e\n\u003cp\u003eThe Nine-tail spirit fox turned around. She waved her hand and the hundred thousand feet large Nine-tail skeleton slowly melted. Subsequently, it turned into liquid, forming a bone pool that was filled with viscous dark red liquid.\u003c/p\u003e\n\u003cp\u003e“Enter.”\u003c/p\u003e\n\u003cp\u003eXin Qing nodded and slowly stood up. Those eyes of hers looked at Lin Dong as an enchanting was revealed on her small face, “Sir Lin Dong, I will not be a burden the next time I appear before you.”\u003c/p\u003e\n\u003cp\u003e“When that time comes, I hope that you don’t think of me as a burden instead.”\u003c/p\u003e\n\u003cp\u003eLin Dong softly chuckled. He did not know just how strong Xin Qing would become after completely receiving the inheritance. However, it was likely not an ordinary level.\u003c/p\u003e\n\u003cp\u003eXin Qing covered her mouth and laughed softly. Without any hesitation, she lifted her head and looked at the bone pool. Soon after, she deeply inhaled a mouthful of air and rushed forward. With a splash, she landed in the bone pool. No ripples were formed…\u003c/p\u003e\n\u003cp\u003eLin Dong gazed at the bone pool. He could detect the terrifying energy gathering within it. It was as though something was brewing inside...\u003c/p\u003e\n\u003cp\u003e“It is finally settled.” Lin Dong stretched his waist. He had finally resolved this matter that he had been worrying about.\u003c/p\u003e\n\u003cp\u003e“You are called Lin Dong right?” The Nine-tail spirit fox gently smiled as she looked at him before asking.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eLin Dong nodded.\u003c/p\u003e\n\u003cp\u003eThe Nine-tail spirit fox thought for a moment before asking, “Do you wish to receive the inheritance of the Devouring Master?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1058\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1060\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1059","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
