{"id":62138,"no":2382,"title":"Chapter 1069 - Gone Crazy","content":"\u003cp\u003eRoar!\u003c/p\u003e\n\u003cp\u003eThe ten thousand feet large giant tiger released an extended roar towards the sky. A dreadful sound wave spread, causing the land to crumble. Even dark clouds had gathered in the sky because of the terrifying fiendish aura. The giant tiger was like a like the destroyer of the world while its giant scarlet eyes were filled with a frightening murderous intent.\u003c/p\u003e\n\u003cp\u003eThe numerous floating figures in the nearby sky hurriedly withdrew. They would surely die if they were implicated in a fight of this level.\u003c/p\u003e\n\u003cp\u003e“He has actually pushed Xu Zhong to such an extent…”\u003c/p\u003e\n\u003cp\u003eThe expressions on several people’s faces were quite amazed as they pulled back. Xu Zhong was from the Dark Abyss Tiger tribe, hence his fighting strength was extremely astonishing. This final combat form was usually only used to deal with Demon Commander level opponents. Yet…\u003c/p\u003e\n\u003cp\u003eSome looked towards the skinny figure in the distance. Even though he appeared extremely tiny in the face of Xu Zhong’s ten thousand feet large body, no one dared to underestimate him. Even Xu Zhong… had ceased doing so.\u003c/p\u003e\n\u003cp\u003eThe battle before their eyes was a rare sight seen even in the Beast War Region…\u003c/p\u003e\n\u003cp\u003e“He has even pulled out his Dark Abyss Heavenly Tiger Body…”\u003c/p\u003e\n\u003cp\u003eQin Shi, who was hard pressed by the Sky Devouring Corpse, glanced over. Soon after, his eyes quickly hardened. There was a grave expression and shock in his eyes as he looked at Lin Dong from afar.\u003c/p\u003e\n\u003cp\u003e“That brat… is he really so strong… what an abnormal existence.”\u003c/p\u003e\n\u003cp\u003eQin Shi was similarly one of the eight great Demon Commanders. Conflicts frequently broke out between Hundred Beast Ridge and Deep Lightning Mountain and both of them had also clashed before. Hence, he was well aware of how powerful Xu Zhong was after activating this Dark Abyss Heavenly Tiger body. Only a handful of people in the entire Beast War Region could forced him to use this technique…\u003c/p\u003e\n\u003cp\u003e“Just where did this fellow come from? Not only does he possess such a powerful dragon tribe body tempering technique, he even has a puppet that is so difficult to deal with…”\u003c/p\u003e\n\u003cp\u003eQin Shi’s eyes flickered. Regret had already started to rise within his heart. He had only agreed to intervene because he heard that they were only dealing with Little Flame. Who could have foreseen that a ferocious individual like Lin Dong would pop out from nowhere.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eLin Dong lifted his head and looked at the enormous and terrible beast that could crush a mountain. He could detect an extremely dangerous sensation from the latter\u0027s body. Evidently, the current Xu Zhong had already pushed his battle power to the limit.\u003c/p\u003e\n\u003cp\u003eThe Demon Commander did indeed live up to his reputation.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, its is an honour for you to die at the hands of this king’s Dark Abyss Heavenly Tiger Body!”\u003c/p\u003e\n\u003cp\u003eThe giant tiger lowered its head as those blood red eyes stared at Lin Dong. In the next instant , it opened its mouth and an energy ripple, which caused one’s scalp to turn numb, gathered, before a ray of gray light immediately shot forth.\u003c/p\u003e\n\u003cp\u003eThe gray light beam directly penetrated through empty space. Everyone could only see a gray light flash in the sky. Subsequently, a light beam that contained destructive fluctuations mercilessly blasted Lin Dong’s body.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA deep sound appeared as the land instantly crumbled. The skinny figure flew backwards, shattering a couple of mountains along the way. He only came to a stop after slamming into the tenth mountain.\u003c/p\u003e\n\u003cp\u003eEveryone looked at the row of mountains that had been blown apart while the skin on their heads felt as if it was about to burst. Was this Xu Zhong’s power after unleashing the Dark Abyss Heavenly Tiger Body? It had actually reached such terrifying levels. The previous blow would likely instantly seriously injure even an ordinary perfect Profound Death Stage expert to the point where the latter would lose all ability to fight.\u003c/p\u003e\n\u003cp\u003e“I wonder if that Lin Dong is still alive…”\u003c/p\u003e\n\u003cp\u003eAll eyes gathered on the ruins of a certain mountain. A moment later, they saw a hand was extend from within the boulders. It pushed aside the surrounding boulders as a somewhat ragged figure appeared.\u003c/p\u003e\n\u003cp\u003e“As expected of the Dark Abyss Tiger tribe…”\u003c/p\u003e\n\u003cp\u003eLin Dong lifted his head in front of the many stunned pairs of eyes. A trace of blood had appeared at the corner of his mouth while a human head size scarlet red cauldron floated above his shoulder. There was a fist sized dent on the cauldron.\u003c/p\u003e\n\u003cp\u003e“He used that cauldron to block that certain kill strike huh…” Several people looked at the scarlet red light cauldron as surprise flashed across their eyes.\u003c/p\u003e\n\u003cp\u003e“But… it is not as overwhelming as I imagined!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s black eyes suddenly turned serious. His body moved and he rushed forward like a phantom. With a clench of his hand, the Lightning Emperor Scepter appeared once again as thunder clouds quickly whistled over in the sky.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eLightning surged on the Lightning Emperor Scepter as nine lightning dragons separated from the top of the scepter as if they had been revived. They rushed forward with lightning speed and ruthlessly smashed into the giant dull gray tiger.\u003c/p\u003e\n\u003cp\u003eBang bang bang!\u003c/p\u003e\n\u003cp\u003eThe lightning dragons exploded and lightning danced all over Xu Zhong’s giant body. However, it appeared to be unable to break that layer of mysterious dull gray scales.\u003c/p\u003e\n\u003cp\u003e“You think you can break this king’s Dark Abyss Armour with an attack of this level?!”\u003c/p\u003e\n\u003cp\u003eA mocking laughter was emitted from Xu Zhong’s huge mouth. Immediately, his tiger eyes turned cold. Another black light ray shot out with lightning speed and ruthlessly smashed towards Lin Dong.\u003c/p\u003e\n\u003cp\u003eLin Dong rapidly retreated when he saw this as the Burning Sky Cauldron immediately swelled in front of him. This attack of Xu Zhong’s was indeed quite powerful. Even Lin Dong did not dare to casually received it with his body.\u003c/p\u003e\n\u003cp\u003eClang!\u003c/p\u003e\n\u003cp\u003eA metallic sound reverberated across the place and the Burning Sky Cauldron was immediately sent flying backwards. Another dent appeared on its surface, causing Lin Dong’s eyes to narrow. He was well aware of the defensive strength of the Burning Sky Cauldron. It was not a simple feat to leave such a mark on it.\u003c/p\u003e\n\u003cp\u003eBam.\u003c/p\u003e\n\u003cp\u003eLin Dong grasped the Lightning Emperor Scepter as his toes suddenly pushed off the Burning Sky cauldron. In a flash, he appeared above Xu Zhong. The Lightning Emperor Scepter in his hand turned into an extremely powerful scepter shadow as it smashed onto the latter’s giant body like a storm.\u003c/p\u003e\n\u003cp\u003eGreen dragon light tattoos circled around each scepter shadow. These attacks were exceptionally fierce.\u003c/p\u003e\n\u003cp\u003eClang clang!\u003c/p\u003e\n\u003cp\u003eSparks spluttered on Xu Zhong’s huge body. However, his dull gray scale armour did not budge. It was as though it was the strongest defence in the world.\u003c/p\u003e\n\u003cp\u003e“Ha ha, the current you is as comical as a clown!” Xu Zhong laughed loudly. The bone wings on his back were so sharp that they seemed to be capable of cutting space as they whizzed forward and ruthlessly sliced at Lin Dong.\u003c/p\u003e\n\u003cp\u003eNumerous gazes watched the situation start to change again as they involuntarily smacked their lips together.\u003c/p\u003e\n\u003cp\u003e“What a frightening defence Xu Zhong has…”\u003c/p\u003e\n\u003cp\u003e“The strongest techniques of the Dark Abyss Tiger tribe are the Dark Abyss Heavenly Tiger Body and the Dark Abyss Armour… if Lin Dong is unable to break this defence, it will be impossible for him to hurt Xu Zhong and it will be meaningless to continue fighting”\u003c/p\u003e\n\u003cp\u003e“It is not easy to break the Dark Abyss Armour. When Qin Shi and Xu Zhong exchanged blows back then, the former spent an entire day wildly smashing Xu Zhong’s Dark Abyss Armour to no avail. Finally, their fight ended in a draw…”\u003c/p\u003e\n\u003cp\u003e“This Lin Dong is really out of luck. However, it was not easy for him to push Xu Zhong to such an extent.”\u003c/p\u003e\n\u003cp\u003e“……”\u003c/p\u003e\n\u003cp\u003e“Clang!”\u003c/p\u003e\n\u003cp\u003eThe Lightning Emperor Scepter ruthlessly smashed onto Xu Zhong’s huge body. A shocking force spread back towards him, causing his arm to feel somewhat numb. His expression was also a little grave. It was evidently not as easy to deal with Xu Zhong as he had expected.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eSharp bone wings rushed at him with lightning speed while Lin Dong quickly retreated. However, a strand of hair was still cut by that sharp aura. After activating the Dark Abyss Heavenly Tiger Body, Xu Zhong’s offence and defence had risen substantially.\u003c/p\u003e\n\u003cp\u003e“What a troublesome Dark Abyss Armour…”\u003c/p\u003e\n\u003cp\u003eLin Dong withdrew as he observed Xu Zhong below, who appeared to be covered in a turtle shell like armour, and muttered.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, are you going to give up like this?” Xu Zhong’s tiger eyes contained ridicule as they stared at Lin Dong. The way the latter had jumped and fled like an ant caused him to be extremely pleased in his heart.\u003c/p\u003e\n\u003cp\u003eLin Dong looked at Xu Zhong and frowned slightly as he spoke in a flat voice, “It is too early for you to be happy.”\u003c/p\u003e\n\u003cp\u003e“Is that so?” Xu Zhong heartily laughed towards the sky. “You can’t even break my defence. What else can you do?”\u003c/p\u003e\n\u003cp\u003eLin Dong slightly narrowed his eyes. Soon after, his gaze swept across Xu Zhong’s enormous body, which was covered by the Dark Abyss Armour. Without replying, essence blood flew out from the tip of his finger as a mysterious light formation quickly appeared in his palm…\u003c/p\u003e\n\u003cp\u003eThe essence blood entered the light formation and rumbling was emitted from it. Soon after, everyone watched the light formation expand at a frightening speed. Within a short period, it had reached ten thousand feet in size. It covered the sky and looked extremely astonishing.\u003c/p\u003e\n\u003cp\u003eXu Zhong lifted his head to look at the huge formation as bewilderment flashed in his eyes.\u003c/p\u003e\n\u003cp\u003e“Ancient Universe Formation. The universe is the heaven and earth. Universe reversal, split heaven and earth!”\u003c/p\u003e\n\u003cp\u003eThe seals formed by Lin Dong’s hands changed like lightning while the light formation in the sky began to rotate in the reverse direction. Waves of unique fluctuations began to gather like a storm within it.\u003c/p\u003e\n\u003cp\u003e“Buzz!”\u003c/p\u003e\n\u003cp\u003eThe light formation shook. Soon after, a huge light pillar came raging downwards. Subsequently, it enveloped Xu Zhong’s giant body.\u003c/p\u003e\n\u003cp\u003eThe light pillar covered him. Soon after, everyone’s pupils shrunk. They could see that the layer of Dark Abyss Armour covering Xu Zhong’s body, which could block the fully powered attacks of any perfect Profound Death Stage expert, was actually being disintegrated at a frightening pace at this moment…\u003c/p\u003e\n\u003cp\u003eMoreover, while the Dark Abyss Armour was being disintegrated, the thick baleful aura around Xu Zhong also rapidly disappeared.\u003c/p\u003e\n\u003cp\u003e“How can this be?” Everyone were alarmed.\u003c/p\u003e\n\u003cp\u003e“How is this possible?!”\u003c/p\u003e\n\u003cp\u003eXu Zhong was also greatly startled. Under the light pillar, he felt as though even the Yuan Power within his body was gradually being disintegrated…\u003c/p\u003e\n\u003cp\u003e“Let me see just what you can use to block me now!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s face had suddenly turned ferocious at this moment. His body charged forward and he clenched his hand while a hundred green dragon light tattoos gathered. Following which, a punch was ruthlessly thrown at Xu Zhong’s body, which had lost the protection of the Dark Abyss Armour.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA low and deep sound spread and Xu Zhong immediately released a sharp and miserable screech. His ten thousand feet large body directly flew backwards, smashing many mountains in the process.\u003c/p\u003e\n\u003cp\u003eThe light array rotated in the sky and the light pillar once again enveloped Xu Zhong.\u003c/p\u003e\n\u003cp\u003e“Weren’t you extremely arrogant just now?”\u003c/p\u003e\n\u003cp\u003eLin Dong’s body appeared behind Xu Zhong in a ghost like fashion. His leg wiggled and turned into a green dragon claw that violently whipped at Xu Zhong.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe huge tiger was kicked and sent flying again. Boiling hot blood sprinkled onto the ground like bloody rain.\u003c/p\u003e\n\u003cp\u003e“Come on, scream for me again?”\u003c/p\u003e\n\u003cp\u003eLin Dong bathed within the blood that filled the sky as his mouth cracked upon to form a grin. Those sinisterly white teeth made others feel a chill in their hearts. Soon after, his body moved and he lifted a huge mountain. He held it with both of his hands, holding the tip of the mountain as he ruthlessly smashed it down onto Xu Zhong’s huge body like a giant hammer…\u003c/p\u003e\n\u003cp\u003eBang bang bang!\u003c/p\u003e\n\u003cp\u003eLow and deep sounds echoed and the atmosphere of the entire area froze. Everyone watched as the mountain ruthlessly smashed onto Xu Zhong’s body again and again, while miserable tiger screams continuously emerged, cursing the young man. At this moment, their faces… were completely blank.\u003c/p\u003e\n\u003cp\u003e“Going to keep screaming?”\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003e“Still going to scream again?”\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eChen Tong’s group was petrified as they watched this scene from far away.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1068\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1070\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1069","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
