{"id":62155,"no":2399,"title":"Chapter 1086: Inside the Mysterious Divine Palace","content":"\u003cp\u003eChapter 1086: Inside the Mysterious Divine Palace\u003c/p\u003e\n\u003cp\u003eBuzz buzz!\u003c/p\u003e\n\u003cp\u003eA golden band of light shot straight into the golden light circle and the end of the light band firmly grabbed that cluster of black light. The black light cluster frantically resisted like it usually did. This frightening resistance caused even faint signs of distortion to appear in the space around the light band.\u003c/p\u003e\n\u003cp\u003e“Creak.”\u003c/p\u003e\n\u003cp\u003eThe band of light was stretched taut. Anyone could feel the wild and violent tearing force that was acting upon it.\u003c/p\u003e\n\u003cp\u003eLin Dong’s hand tightly grabbed the band of light. His expression was a little grave. Only after personally feeling it did he understand the intensity of the black light cluster’s resistance. No wonder even the Heaven Dragon Demon Commander trio had failed previously.\u003c/p\u003e\n\u003cp\u003eMany pairs of eyes were glued onto Lin Dong. They wanted to see just what could Lin Dong do to succeed where the three great Demon Commanders had failed.\u003c/p\u003e\n\u003cp\u003eCrack.\u003c/p\u003e\n\u003cp\u003eLin Dong’s body suddenly trembled under the many watching eyes, and he was even forced to take a step forward. Clearly, he was somewhat unable to endure the terrifying force.\u003c/p\u003e\n\u003cp\u003eThe Heaven Dragon Demon Commander smiled coldly as he watched this scene. This resistance would only become increasingly powerful. If Lin Dong continued to persevere in this manner, it was likely that he would be directly dragged into the golden light circle and be torn to pieces by the extremely wild and violent forces within it.\u003c/p\u003e\n\u003cp\u003eLin Dong stared at the golden light circle while the warm white glow deep within his eyes grew increasingly dense. In the next instant, his feet pushed off the ground and his body flew forward, allowing the wild and violent suction force to drag him into the golden light circle.\u003c/p\u003e\n\u003cp\u003eAh.\u003c/p\u003e\n\u003cp\u003eThis scene immediately caused an uproar to erupt on Divine Object Mountain Range. Many people wore expressions of pity. They clearly understood what one’s fate would be if one was sucked into the golden light circle. When the treasury opened in the past, there were also some unlucky fellows who had been sucked into it. Their bodies had burst into bloody foam the moment they came into contact with the golden light circle...\u003c/p\u003e\n\u003cp\u003e“Lord Lin Dong!” Chen Tong’s group turned pale with fright.\u003c/p\u003e\n\u003cp\u003eLittle Flame’s expression slightly altered upon seeing this. However, he calmly waved his hand, stopping Chen Tong’s group. He had clearly remembered what Lin Dong had said earlier.\u003c/p\u003e\n\u003cp\u003eLin Dong’s body seemed to rush forward in an out of control fashion. In the end, he crashed into the golden light circle in front of countless pairs of eyes. Surprisingly, not only did Lin Dong’s body not explode upon contact with the golden light circle, it had instead charged into the circle in a strange manner…\u003c/p\u003e\n\u003cp\u003eThe area outside of the golden light circle turned completely silent. Everyone quietly watched this mysterious scene in a rather dazed manner…\u003c/p\u003e\n\u003cp\u003e“How did this happen? He actually entered?”\u003c/p\u003e\n\u003cp\u003eThis silence continued for a long time, before someone finally cried out in disbelief. This was the first time that they had seen someone charging into the circle since the Divine Item Treasury had\u003c/p\u003e\n\u003cp\u003eappeared.\u003c/p\u003e\n\u003cp\u003eThe Heaven Dragon Demon Commander’s originally coldly smiling face stiffened at this moment, while his eyes flickered rapidly. A moment later, his body suddenly shot out and charged towards the golden light circle.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eHowever, a wild and violent force suddenly erupted when his body came into contact with the golden light circle. Subsequently, it sent the Heaven Dragon Demon Commander flying.\u003c/p\u003e\n\u003cp\u003eThe Heaven Dragon Demon Commander landed on the ground in a somewhat miserable fashion. His expression was terrifyingly dark. By the side, the Ghost Condor Demon Commander and the Golden Ape Demon Commander frowned. Their eyes also flickered as they looked at the rapidly rotating golden light circle.\u003c/p\u003e\n\u003cp\u003eEveryone gazed at the Heaven Dragon Demon Commander, who had been forced back by the circle, while being shaken inside. Even a Samsara stage expert could not enter this golden light circle. How did Lin Dong manage to do so?\u003c/p\u003e\n\u003cp\u003eWho exactly was that fellow?\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe current Lin Dong clearly did not have the time to bother about those shaken people outside. The moment his body came into contact with the golden light circle, he sensed a white light that almost impossible to detect with the naked eye appear around his body. Subsequently, the wild and violent force that could tear his body to pieces quietly scattered.\u003c/p\u003e\n\u003cp\u003eA radiant palace appeared in front of Lin Dong when his narrowed eyes widened once again. The palace seemed to stretch on endlessly while countless light rays flew within it. Each of these lights enveloped treasures of various shapes.\u003c/p\u003e\n\u003cp\u003e“This is the interior of the Mysterious Divine Palace.”\u003c/p\u003e\n\u003cp\u003eYan’s voice sounded. After which, a light figure drifted out from Lin Dong’s body and floated in front of him.\u003c/p\u003e\n\u003cp\u003eLin Dong could not help but observed the area around him with great curiosity after hearing this. He extended his hand and a light ray slowed down in front of him. A long sword gently swayed within the light. It gave off an unusually sharp ripple while helix shaped symbols covered it. On a whole, it looked rather unique.\u003c/p\u003e\n\u003cp\u003eThis long sword was clearly a powerful divine object. It was undoubtedly much stronger than those that had flown out earlier.\u003c/p\u003e\n\u003cp\u003e“There are so many divine objects…”\u003c/p\u003e\n\u003cp\u003eLin Dong looked at the shooting star like rays of light as shock flashed across his eyes. Any one of these divine objects would spark a bloody slaughter amongst those in the Divine Item Mountain Range. Won’t everyone go insane if everything here was taken out?\u003c/p\u003e\n\u003cp\u003eHumm humm!\u003c/p\u003e\n\u003cp\u003eCountless divine objects within the palace suddenly emitted a humming sound while Lin Dong was feeling shocked. Soon after, Lin Dong was stunned to see the divine objects suddenly turn around. They were like arrows as they shot towards him from all directions. The density of the attack caused his scalp to feel somewhat numb.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eHowever, a ray of white light shot out from Lin Dong’s body just as those divine objects were about to arrive. Yan waved his hand and a ripple was emitted. The divine objects suddenly stopped and shook with a buzzing sound while a human like feeling of respect and fear was transmitted over.\u003c/p\u003e\n\u003cp\u003eYan casually stopped the divine objects. After which, he threw Lin Dong a faint smile. “Relax, those fellows won’t be able to enter.”\u003c/p\u003e\n\u003cp\u003e“The Mysterious Divine Palace is ranked tenth on the Ancient Divine Object Ranking after all. It also possess a proud battle accomplishments in killing Yimo kings during the great world war back then. Those Samsara stage experts do not have the qualifications to enter.”\u003c/p\u003e\n\u003cp\u003eLin Dong nodded. His eyes contained some fear as he glanced at the divine objects that seemed to cover the sky. It would truly be terrible if so many terrifying attacks rained down upon him.\u003c/p\u003e\n\u003cp\u003e“What was the black cluster of light earlier?” Lin Dong eyes swept around and suddenly asked curiously. He was also relatively interested in the divine object that the Heaven Dragon Demon Commander trio had failed to obtain.\u003c/p\u003e\n\u003cp\u003e“It is another famous ancient divine object on the Ancient Divine Object Ranking.”\u003c/p\u003e\n\u003cp\u003eYan smiled and quickly extended his hand. After which, Lin Dong saw a black light shoot over from deep within the large palace. Finally, it appeared in front of Lin Dong.\u003c/p\u003e\n\u003cp\u003eYan appeared just like the master of this place. He freely commanded the divine objects here.\u003c/p\u003e\n\u003cp\u003eLin Dong eyes focused and saw a relatively ancient giant hammer within the black light. The giant hammer was entirely black and various types of cauldron symbols were carved on the hammer. It gave off an extremely heavy feeling.\u003c/p\u003e\n\u003cp\u003eWaves of extremely heavy ripples were emitted from the giant hammer. Lin Dong could feel his body grow heavier just from being close to it and even his speed had slowed.\u003c/p\u003e\n\u003cp\u003e“This is?”\u003c/p\u003e\n\u003cp\u003e“Nine Cauldron Divine Hammer, ranked twenty third on the Ancient Divine Object Ranking.”\u003c/p\u003e\n\u003cp\u003eYan faintly chuckled and continued, “It belonged to one of the Reincarnation experts from ancient times. He was known as the Cauldron Emperor and was extremely powerful. However, it is regretful that he died under the combined forces of three Yimo Kings.”\u003c/p\u003e\n\u003cp\u003e“Nine Cauldron Divine Hammer...”\u003c/p\u003e\n\u003cp\u003eLin Dong mumbled to himself. Soon after, his hand reached out and gently passed through the black light as it grabbed the giant hammer. Once it entered his hand, Lin Dong’s arm started to drop and he hastily activated the Green Heaven Materialized Dragon Skill. Only then was he able to hold it.”\u003c/p\u003e\n\u003cp\u003e“This Nine Cauldron Divine Hammer possess a unique gravity power. Anyone it strikes will be slowed down, however, the user’s speed will also be influenced by its gravity power.” Yan explained.\u003c/p\u003e\n\u003cp\u003eLin Dong slowly nodded and gently swung the giant hammer in his hand. His pupils shrunk slightly as he saw the space in front of him explode. A huge depression in space appeared as an invisible force shot forth like a cannonball. It sent many divine objects wrapped in light clusters flying.\u003c/p\u003e\n\u003cp\u003e“What a frightening power…”\u003c/p\u003e\n\u003cp\u003eLin Dong was secretly astonished. Soon after, he licked his lips and said, “However, it is not very suitable for myself.”\u003c/p\u003e\n\u003cp\u003eMost opponents Lin Dong encountered were far more powerful than himself, and speed was one of his best attributes. This Nine Cauldron Divine Hammer might possess an extremely powerful strength, but it would reduce one’s speed.\u003c/p\u003e\n\u003cp\u003e“However, it is very suitable for Little Flame.”\u003c/p\u003e\n\u003cp\u003eLin Dong shook his head and temporarily released the ‘Nine Cauldron Divine Hammer’. Subsequently, he glanced at Yan and laughed. There was no need to voice his thoughts. This Mysterious Divine Palace did possess many divine objects. Moreover, it did not lack powerful items. However, the thing that truly interested Lin Dong was… the Mysterious Divine Palace itself.\u003c/p\u003e\n\u003cp\u003eThis was a super powerful divine object ranked tenth on the Ancient Divine Object Ranking!\u003c/p\u003e\n\u003cp\u003e“Let’s go, I also wish to meet this old friend whom I have not seen for many years…”\u003c/p\u003e\n\u003cp\u003eYan glanced at the depths of the palace and laughed. His body drifted forward while Lin Dong quickly followed.\u003c/p\u003e\n\u003cp\u003eAt the end of the palace was an ancient stone door that was covered in light symbols. Lin Dong looked over and his eyes immediately hardened. He could detect wisps of extremely faint black light from within the light symbols.\u003c/p\u003e\n\u003cp\u003eThose wisps of light might appear extremely weak but it was not unfamiliar to Lin Dong. It was the Yimo Qi…\u003c/p\u003e\n\u003cp\u003eLin Dong turned his head and looked at Yan as the latter frowned slightly. It was likely that he had also detected that traces of extremely faint Yimo Qi.\u003c/p\u003e\n\u003cp\u003e“Come here.”\u003c/p\u003e\n\u003cp\u003eLin Dong quickly moved aside while Yan also did not bother with any pleasantries. He waved his hand and a warm white light shined on the ancient stone door. The light symbols on the stone door began to fade bit by bit, while the slivers of black Qi were rapidly purified under the white light.\u003c/p\u003e\n\u003cp\u003eCrack.\u003c/p\u003e\n\u003cp\u003eThe ancient stone door slowly opened after the light symbols gradually disappeared. The sound of a heavy door being opened reverberated across the palace.\u003c/p\u003e\n\u003cp\u003eThe Yuan Power within Lin Dong’s body circulated as he entered into an alert state. Black light and a lightning glow flashed deep within his eyes. Soon after, he looked upon the scene behind the stone doors…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1085\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1087\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1086","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
