{"id":62315,"no":2559,"title":"Chapter 1246: Return to the Unique Devil Region","content":"\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter the sneak attack from the Seventh Seat King, Darkness City had clearly beefed up its security. However, Lin Dong and the rest understood that such defences had little effect against someone as powerful as the Seventh Seat King. Ultimately, they still had to rely on their own strength.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThankfully, they were able to stop the sneak attack by the Seventh Seat King. Moreover, the latter was also seriously injured. According to what the Thunderbolt Master said, it was likely that Devil Prison would not dare to do anything more in the meantime. After all, though Devil Prison was powerful, the current situation in the world was uncertain. Therefore, without absolute confidence, they would not dare to act wantonly.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLin Dong and the rest stayed for a day in Darkness City. Meanwhile, Qingtan had finally subjugated the hearts of everyone within Darkness Palace. Therefore, Darkness Palace was considered to be completely under her control and no one would ever dare to rebel against her.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHence, at this juncture, he could finally take this little girl back to the Eastern Xuan Region.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e　　……\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThere was a spatial formation slowly distorting the sky above an empty square in Darkness City. Meanwhile, waves of wild and violent spatial strength were being emitted from it.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Palace master, the spatial teleportation formation has been set up. You can use it anytime you want.” A black robed elder looked at the teleportation formation that was set up, before he lifted his head and spoke respectfully to the black dressed girl standing beside him.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eQingtan nodded gently upon hearing this. Then, she said, “Elder Chen, during this period of time where I am gone, you will take my place and oversee the entire Darkness Palace. If any major incidents occur, shatter the communication talisman that I gave you and I will hurry back immediately.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Understood.” That black robed elder replied respectfully after hearing this.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter giving her orders, Qingtan nodded her small face. After which, her delicate figure moved before she appeared on a platform, that was located at a short distance away. Subsequently, a sweet smile appeared on her small face, which had a stern-looking expression previously, before she hugged Lin Dong’s arm and smilingly said, “Big brother Lin Dong, we can go now.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLin Dong smiled and nodded upon hearing this. Then, he turned to look at Ling Qingzhu before he said, “Let’s go.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAfter he spoke, he swung his sleeve before the three of them appeared within the teleportation formation. Meanwhile, there were countless experts from Darkness Palace kneeling respectfully below them.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Goodbye palace master.” Orderly and respectful voices sounded at this moment.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eQingtan nodded gently to everyone below. After which, she waved her small hand, before she activated the spatial teleportation formation. Immediately, an extremely violent spatial fluctuation spread. Then, resplendent silver light surged and wrapped around the three of them.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Buzz.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThat resplendent light erupted, forcing the crowd to narrow their eyes immediately. When they once again opened their eyes, the three people in the sky had already vanished. The only thing left, was a distortion in that empty space.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e　　……\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBy the time the Lin Dong trio tore through space and arrived in the Eastern Xuan Region, it was already three days later. Nonetheless, this method was clearly several times more efficient compared to when he first headed over. Moreover, if he wished to travel back to that location in the future, he could use the spatial stamp that he left behind. Therefore, there was no longer a need to travel through the tens of thousands of large mountains.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLin Dong walked out from within the distorted space. Then, his eyes swept across his surroundings before he turned and looked towards the north. Promptly, a strange expression flashed across his eyes before he asked, “Where is that?”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLing Qingzhu looked in that direction. Then, she immediately glanced at Lin Dong before she softly said, “That is where the Unique Devil Region is located.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Unique Devil Region…”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLin Dong involuntarily sighed softly after he heard the name of that place, which had left a deep impression on his mind. Back then, he and his two brothers were forced to flee miserably by Yuan Gate in that place.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Since we are here, let’s head to the Unique Devil Region.” Lin Dong said. He still remembered that back in the Unique Devil Region, there was an elder called old man Fen Tian whom he was indebted to. However, that elder ended up sacrificing his physical body in order to suppress a Yimo general.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBack then, Lin Dong thought that a Yimo general was an unbeatable foe. However, as of now, it was likely that he could easily kill numerous Yimo generals with the flip of a palm.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLing Qingzhu and Qingtan naturally did not object to his suggestion. Immediately, they nodded their heads. When he saw this, Lin Dong stopped hesitating. Then, he waved his hand before the three of them transformed into rays of light and streaked across the sky.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eIn a couple of minutes, they had already travelled thousands of miles. Following which, a massive city appeared within Lin Dong’s sight. As he looked at this somewhat familiar looking city, a look of reminiscence appeared in his eyes. Back then, he and his two brothers experienced a bloody fight with Yuan Gate at this location. However, it was not a good ending for them.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLin Dong looked at Unique Devil City standing in front of him. It was a long while later before he moved. In the next moment, they were already standing outside the Unique Devil Region. Following which, the space in front of them gently trembled, before an ancient formation became vaguely visible. This was a formation passed down from the ancient times and it was used to seal the demonic aura within the Unique Devil Region. Back then, Lin Dong had to wait for the seal to weaken in order to enter this place. However, as of now, he no longer had to do so. With a wave of his sleeve, the empty space was split apart. Then, their bodies moved before they entered directly.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAs they entered the Unique Devil Region, there were many adventurous experts below, who were eagerly waiting for the Unique Devil Region to open up. When they saw the powerful techniques unleashed by the Lin Dong trio, all of them were stunned.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eNaturally, Lin Dong did not care about these little details. After he entered the Unique Devil Region, he immediately surveyed his surroundings. It has been a few years since he came, but there was still faint demonic aura lingering over the Unique Devil Region. Looking afar, this place looked ancient and desolate. Meanwhile, there were many large gullies on the ground, indicating that a frightening big battle had occured in this place back in the past.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe Lin Dong trio did not linger here for long, as they directly headed towards the deepest part of the Unique Devil Region. With their current strength, what was once the forbidden grounds of the Eastern Xuan Region obviously posed no hindrance to them. Therefore, in less than ten minutes, they had already reached the deepest part of the Unique Devil Region. Relying on his memories from three years ago, Lin Dong soon came to a stop. Then, his eyes looked into the distance. There was a huge crimson volcano standing at that spot and it was even possible for him to vaguely spot a statue like figure on top of that volcano.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLin Dong slowly drifted towards that volcano. Meanwhile, that figure looked just like a stone statue and his body was covered with dust. Furthermore, that lava volcano was also emitting a powerful energy wave, preventing anyone from approaching it. However, that energy wave was completely useless against Lin Dong.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“Elder.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLin Dong bowed towards that human statue, who had died. Although his strength had likely far surpassed that of old man Fen Tian, the latter used all of his remaining lifeforce to form a pill just before he died. After which, he gave that pill to Lin Dong. Over the years, Lin Dong had always kept this favor in mind.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“This elder has already died. Is it still possible to rescue him?” Ling Qingzhu used her bright eyes to look at that human figure, who was covered with dust, before she softly said. Back then, she was also present when that incident occurred. Therefore, she naturally knew that Lin Dong had received many favors from this elder.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“His situation is a little unique. He has not completely died. In the past, in order to suppress that Yimo general, he turned himself into a zombie, allowing him to live forever in order to suppress that Yimo general. Therefore, from a certain point of view, old man Fen Tian has not completely died.” Lin Dong shook his head and said.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eBack then, before he left, he once asked old man Fen Tian about it. The latter said that if Lin Dong wanted to rescue him, he should return only after he had understood Reincarnation. As of now, although Lin Dong had yet to advance to the Reincarnation stage, he had indeed touched Reincarnation. Moreover, his Mental Energy had also reached the Supreme Symbol Master level and even an ordinary Reincarnation stage expert was no match for him.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003e“This elder turned himself into a zombie. However, his body is currently filled with Death Qi and he has lost all his Life Qi. This is also the reason why he died. If we can provide him with sufficient Life Qi, it should be possible to wake him up.” Qingtan used her large eyes to observe this person, who had died. Then, she pondered for a moment before she said.\u0026nbsp;\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLin Dong nodded in agreement. Then, he smiled at that figure and said, “Elder Fen Tian, back then, you gave me all the Life Qi within your body. Today, I shall return the favor.”\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLin Dong extended his hand after he spoke. Immediately, monstrous Yuan Power swept forward. Meanwhile, Life and Death Qi were perfectly merged within his Yuan Power. Then, a thought passed through his mind before a dense white light was segregated from within his Yuan Power. Moreover, that white light was filled with extremely pure Life Qi.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eAs that Life Qi spread, Lin Dong flicked one finger before that vast and mighty Life Qi transformed into a huge swirl. Meanwhile, in the middle of the swirl, was the body of old man Fen Tian.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eLife Qi spread. After which, it continuously surged towards that figure. In fact, the amount of Life Qi present caused some greenery to emerge on the top of this volcano.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe Death Qi within the body of old man Fen Tian was extremely dense. In fact, even a Reincarnation stage expert would face some difficulties if he wanted to balance the Life Qi and Death Qi within old man Fen Tian’s body. Thankfully, Lin Dong was completely different from before and the amount of Yuan Power within his body was as vast as an ocean. Moreover, with his Mental Energy assisting him, old man Fen Tian’s skin, which previously looked like dried tree bark, gradually turned soft after half a day. After which, a faint Life Qi began to seep out from within his body.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eWhile Lin Dong channeled his Yuan Power, his mind shook gently. After which, some of the Reincarnation Will that he inherited from the Devouring Master merged with his Life Qi. Finally, the Life Qi, that permeated the sky, transformed into a cream white pill before it directly flowed into old man Fen Tian’s body through his head.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eOld man Fen Tian was a top expert who had touched Reincarnation and he was only one step away from the Reincarnation stage. Back then, he failed to make a breakthrough. Currently, with the help of the Reincarnation Will from the Devouring Master, he might be able to break into the Reincarnation stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eThe moment that white pill entered the body of old man Fen Tian, his seemingly dead body suddenly trembled gently. After which, a vibrant red colour appeared on his elderly face, before he slowly opened his eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp dir\u003d\"ltr\"\u003e\u003cspan style\u003d\"color: rgb(0, 0, 0); background-color: transparent; font-weight: 400; font-style: normal; font-variant: normal; text-decoration: none; vertical-align: baseline; white-space: pre-wrap\"\u003eHe was in a daze as he opened his eyes. After which, he saw a smiling young face.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1245\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-1247\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-1246","bookId":1514,"creation":"Sep 10, 2019 7:28:57 AM","modification":"Sep 10, 2019 7:28:57 AM"}
