{"id":60015,"no":259,"title":"Chapter 259: Fending off Advanced Qi Creation Stage","content":"\u003cp\u003e\u003cstrong\u003eChapter 259: Fending off Advanced Qi Creation Stage \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Cling!”\u003c/p\u003e\n\u003cp\u003eA clear and crisp noise erupted in mid-air before an extremely formidable shock wave swept forth...\u003c/p\u003e\n\u003cp\u003eAt the epicenter of the collision, the ancient halberd and bone spear were releasing a golden and greyish glow respectively, while a terrifying energy shockwave spread forth. In fact, even the surrounding air was forcefully blown apart.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThe air-waves swept forth before the ancient halberd and bone spear were both blown back. As Little Marten was too close to the collision, it’s body was directly blown away by the impact. Promptly, a hand appeared behind it’s back and stabilized its body.\u003c/p\u003e\n\u003cp\u003e“Kid, if you were a second later, I would have to risk my life again!” Little Marten’s figure became slightly illusionary due to those air-waves. Then, it tilted its head and looked at the figure behind, before it heaved a sigh of relief and said.\u003c/p\u003e\n\u003cp\u003eBehind Little Marten, was a figure hovering on a blade shadow. That figure’s body was straight like a pencil, while a formidable and domineering aura emerging from his body. Of course, this figure was naturally Lin Dong, who had just emerged from his cultivation. Right now, the bronze-green hue on his skin had completely dissipated. In it’s place, was a warm jade-like glow, which caused his skin to seem just like a solid and translucent metal.\u003c/p\u003e\n\u003cp\u003eThis was the second stage in Great Sun Thunder Yuan, Jade Thunder Body!\u003c/p\u003e\n\u003cp\u003eIt seems like this time, with aid from the Thousand Beast Fruit, Lin Dong was finally able to advance Bronze Thunder Body to Jade Thunder Body. As a result, his battle ability would have surged to a completely different level.\u003c/p\u003e\n\u003cp\u003eFurthermore, the Yuan Power vibrations that seeped out from Lin Dong’s body, was several times more powerful than before. Evidently, right now, his Yuan Power cultivation had once again broken through to advanced Form Creation stage.\u003c/p\u003e\n\u003cp\u003eAfter completing his cultivation, Lin Dong had practically undergone a revolutionary transformation!\u003c/p\u003e\n\u003cp\u003eLin Dong’s feet stepped onto his blade shadow, while a warm jade-like glow glimmered on his body. His eyes stared coldly at Hua Gu, who was at a distance away, before he turned to look at Little Flame, who was now riddled with injuries. Promptly, rage flashed across his eyes.\u003c/p\u003e\n\u003cp\u003e“I never expected that a little bastard like you can actually successfully breakthrough at such a critical juncture!” Hua Gu’s venomous eyes were just like sharp knives, as they swept across Lin Dong’s body, while he coldly spoke.\u003c/p\u003e\n\u003cp\u003eThough he spoke callously, a small storm was raging inside Hua Gu’s heart. In their previous short exchange, he could sense Lin Dong’s formidable strength. His strength far exceeds that of an ordinary Form Creation stage practitioner. It seems like the reason why that fellow could kill Hua Gu, was because he was pretty skilled.\u003c/p\u003e\n\u003cp\u003e“Old fart, your son tried to snatch my ancient halberd. He deserves what he had got!” Lin Dong’s coldly said.\u003c/p\u003e\n\u003cp\u003e“Even if my son killed you, he would still be righteous. Just like how it is completely justified for me to kill you now.” Hua Gu’s words were extremely forceful and domineering. In his opinion, it seems like if Hua Zong wanted to snatch Lin Dong’s ancient halberd, then even if he killed Lin Dong, he would still be justified!\u003c/p\u003e\n\u003cp\u003e“Indeed it seems like that young dog is similar to his papa dog!” When he heard Hua Gu’s words, Lin Dong was extremely infuriated.\u003c/p\u003e\n\u003cp\u003e“Little bastard, swear all you want now. Later, when I capture you, you will think that death is a luxury!” Hua Gu’s old and wrinkly face was extremely hideous as he stared at Lin Dong. He did not bother to speak with him anymore because there was no way he could ever forgive his son’s killer. Therefore, there was only one possible outcome. That was to capture and torment Lin Dong, in order to avenge Hua Zong’s death!\u003c/p\u003e\n\u003cp\u003e“Soul Destruction Bone Spear!”\u003c/p\u003e\n\u003cp\u003eThat Hua Gu was indeed vicious. Immediately, formidable Yuan Power gushed out, before an extremely icy-cold grey glow erupted on his bone spear. Then, the greyish glow gathered forth, before the bone spear was viciously flung towards Lin Dong, with a force that was enough to instantaneously destroy an advanced Form Creation stage elite practitioner.\u003c/p\u003e\n\u003cp\u003eWhen he saw Hua Gu instantly attack, a solemn expression fleeted across Lin Dong’s face. Advanced Qi Creation stage was one entire cultivation stage above his. Even though he possessed many tricks up his sleeves, he did not dare to be negligent at all!\u003c/p\u003e\n\u003cp\u003e“Demonic Ape Transformation!”\u003c/p\u003e\n\u003cp\u003eA deep roar sounded out from Lin Dong’s throat, before his body promptly swelled by several times. Right now, he looked just like a giant jade statue. In fact, this time, there was a golden glow shimmering at Lin Dong’s forehand. Faintly, it seems like a golden dragon horn that was similar to the Ancient Dragon Ape’s.\u003c/p\u003e\n\u003cp\u003e“He is actually able to use the Ancient Dragon Ape’s bloodlines to such an extent.” When it saw the golden horn on Lin Dong’s forehead, a tinge of shock flashed across Little Marten’s eyes.\u003c/p\u003e\n\u003cp\u003e“Heavenly Scales Halberd techniques, python scale halberd!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s body surged several times, while a majestic strength, that was able to uproot mountains, gushed out from his body just like a tidal wave. His palm tightly gripped onto the Ancient Heavenly Scale Halberd, which had also grown by several times. Then, a resplendent golden glow gushed forth, before it transformed into a giant python shadow and directly clashed against that bone spear with a terrifying force.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eA loud and deafening noise erupted in mid-air, before giant water columns once again erupted from the lake below.\u003c/p\u003e\n\u003cp\u003eWhen that Yuan Power shock wave swept forth, Lin Dong’s body hurriedly retreated several steps in mid-air, before he managed to stabilize himself. Then, as he stared at Hua Gu, who was also being forced to retreat several steps, he involuntarily laughed out loud. Right now, based on his current strength, in addition to Demonic Ape Transformation and Jade Thunder Body, he was able to match up against an advanced Qi Creation stage elite practitioner!\u003c/p\u003e\n\u003cp\u003e“Haha, old fart, you don’t have the qualifications to kill me!”\u003c/p\u003e\n\u003cp\u003eLin Dong laughed heartily, before he gripped his palm. Then, a large and resplendent golden platform instantly formed above his head. Promptly, he stretched his arm out before his fingers penetrated deep within the golden platform. One hand held onto his halberd, while the other grabbed onto his golden platform. While that golden glow flowed, he seemed just like the God of War, filled with an extremely formidable and menacing aura.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eWith a glimmering golden glow, Lin Dong directly dashed forth. Streaks of formidable halberd shadows were formed from his ancient halberd, while an extremely domineering shock wind accompanied his golden platform, before they were both lightning-quick flung towards Hua Gu.\u003c/p\u003e\n\u003cp\u003eClang clang clang!\u003c/p\u003e\n\u003cp\u003eAs he faced Lin Dong’s somewhat maniacal attack, Hua Gu’s face turned slightly steely-green. He immediately pushed out every bit of formidable Yuan Power, that was only available to an advanced Qi Creation stage elite practitioner. Then, the bone spear in his hands was filled with an gloomy and chilling cold, before it viciously collided against the halberd shadows and golden platform.\u003c/p\u003e\n\u003cp\u003eTheir battle was extremely intense. Two figures were flashing in mid-air and each time they collided, a terrifying series of shock waves would erupt forth and cause waves to emerge in the lake below. Everything within a hundred meters radius was thoroughly wrecked by them.\u003c/p\u003e\n\u003cp\u003e“By stacking his Jade Thunder Body and Demonic Ape Transformation, together with his keen Mental Energy sensors, this kid has became incredibly powerful. In fact, he is even able to match up against an advanced Qi Creation stage practitioner!”\u003c/p\u003e\n\u003cp\u003eAs it stared at that intense battle in mid-air, shock flashed across Little Marten’s eyes. After all, Lin Dong and Hua Gu’s cultivation levels differed by one entire level.\u003c/p\u003e\n\u003cp\u003e“However, there is a time limit for Demonic Ape Transformation and Jade Thunder Body. When that time comes, Lin Dong would probably lose out to Hua Gu.” Little Marten’s eyes glimmered. It was keenly aware of Lin Dong’s weaknesses. Even though Lin Dong was extremely powerful, he could not sustain it for a long time. Therefore, if this fight dragged on, his advantage will gradually dwindle.\u003c/p\u003e\n\u003cp\u003e“Little Bastard, once your physical enhancing Martial Arts wears off, I will make you beg for your own death!” Of course, with regards to this weakness, not only did Little Marten know about it, but Lin Dong’s current opponent, Hua Gu also knew about it. After all, in this whole world, there were no physical enhancing Marital Arts that did not possess a time limit. Therefore, while he waved his bone spear and defended against Lin Dong’s formidable attacks, a venomous smile emerged on his lips as he chuckled.\u003c/p\u003e\n\u003cp\u003e“I am afraid you won’t have the opportunity to!”\u003c/p\u003e\n\u003cp\u003eWhen he heard those words, Lin Dong smiled before his eyes promptly turned icy-cold. Then, he viciously flung the golden platform in his hands towards Hua Gu directly.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eHua Gu’s old and wrinkled face was icy cold. Then, his bone spear transformed into a greyish shadow before it dashed forth and directly penetrated through the golden platform. With a jolt of Yuan Power, he directly blew away that golden platform.\u003c/p\u003e\n\u003cp\u003eWhen his golden platform was blown away, Lin Dong’s figure swiftly retreated. As he retreated back, he gripped his palm before his Spirit Accumulation Praying Mat instantly emerged. Immediately, an extremely formidable Yuan Power and Mental Energy gushed inside it.\u003c/p\u003e\n\u003cp\u003e“Wroom!”\u003c/p\u003e\n\u003cp\u003eWhen these two powerful energy sources gushed into the Spirit Accumulation Praying Mat, a golden glow emerged on the praying mat, before an extremely rich and potent “Yuan Essence Energy” emerged.\u003c/p\u003e\n\u003cp\u003e“Heavenly Scales Halberd techniques, heavenly dragon halberd!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s face was solemn. As he jerked the ancient halberd in his hand, a resplendent golden glow gushed forth, while that ball of “Yuan Essence Energy” also gushed onto the tip of his halberd.\u003c/p\u003e\n\u003cp\u003e“Growl!”\u003c/p\u003e\n\u003cp\u003eGolden glow filled the horizons, before a gigantic golden dragon shadow was directly formed from the golden glow. A gentle yet peculiar pressure immediately swept forth, causing the Yuan Power inside Hua Gu’s body to seem somewhat lacking.\u003c/p\u003e\n\u003cp\u003e“That little bastard actually knows such a powerful Martial Arts!”\u003c/p\u003e\n\u003cp\u003eAs he stared at that golden dragon shadow emerging from within golden glow, even an elite practitioner like Hua Gu, sucked in a breath of cold air. A tinge of shock flashed across his old and wrinkly face, before his body began to promptly retreat, while streams of rich Yuan Power continuously erupted from his body.\u003c/p\u003e\n\u003cp\u003e“Thousand Bone Chilling Armour!”\u003c/p\u003e\n\u003cp\u003eThick and greyish Yuan Power swirled, before they swiftly gathered together. In mere seconds, they had transformed into a gigantic white bone-armour, which wrapped itself around Hua Gu’s entire body.\u003c/p\u003e\n\u003cp\u003eOn top of those white bones, a greyish glow glimmered giving the armour an indestructible feel!\u003c/p\u003e\n\u003cp\u003e“Old dog, watch me turn you into a dead dog in one move!”\u003c/p\u003e\n\u003cp\u003eLin Dong stood within the golden glow, while his eyes stared coldly at Hua Gu, who was wrapped by his white bone-armour. This was the most powerful attack that he could execute currently. Since he knew that he could not allow this fight to drag on, he must end it in one blow!\u003c/p\u003e\n\u003cp\u003e“Growl!”\u003c/p\u003e\n\u003cp\u003eAfter Lin Dong shouted, that giant golden shadow once again released an earth-shattering dragon roar, that caused one’s soul to shiver, before it flew towards that white bone-armour with a formidable force that could even terrify a Qi Creation stage elite practitioner!\u003c/p\u003e\n\u003cp\u003eThat golden dragon flew across the horizons with a terrifying speed, before it viciously slammed against that white bone-armour. Instantly, an earthquake seemingly erupted in this mountain peak, as it began to vibrate maniacally...\u003c/p\u003e\n\u003cp\u003eLin Dong’s attack was actually this terrifying!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-258\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-260\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-259","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
