{"id":60019,"no":263,"title":"Chapter 263: Teng Lei","content":"\u003cp\u003e\u003cstrong\u003eChapter 263: Teng Lei \u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAs the Ghastly Puppet Cult group arrived, a big empty circle quickly formed around them. Given their status as a top tier faction in the Great Desolate Province plus the fact that they were a local tyrant, no faction dared to clash with them in front of the Great Wastelands Ancient Tablet.\u003c/p\u003e\n\u003cp\u003eLin Dong’s gaze swept across the Ghastly Puppet Cult group, before he realized that there were actually two initial Qi Creation stage practitioners, besides the man in blood red clothes. Immediately,he was slightly taken aback. It seems like the reason why Ghastly Puppet Cult was able to become a top tier faction in the Great Desolate Province, was because their strength was not weak at all.\u003c/p\u003e\n\u003cp\u003eOf course, those two initial Qi Creation stage practitioners did not pose much of a threat towards the current Lin Dong. Among the Ghastly Puppet Cult group, the most dangerous one was still that man wearing blood red clothes. The latter’s Mental Energy was extremely bloodthirsty and ruthless, just like a wild beast.\u003c/p\u003e\n\u003cp\u003eAfter a little observation, Lin Dong withdrew his gaze and pulled back his body, before he hid himself within the crowds. Although he was not afraid of the Ghastly Puppet Cult, the Great Desolate Wastelands Tablet seal was now weakening, and it would be slightly troublesome if he tangled with them.\u003c/p\u003e\n\u003cp\u003eThe Ghastly Puppet Cult group directly occupied a rather good spot while they enjoyed the respectful and fearful gazes of the crowd. Only the blood red clothed man in the middle was expressionless, as his eyes silently stared at the distant Great Wastelands Ancient Tablet.\u003c/p\u003e\n\u003cp\u003eHe continued to stare for a while, before the blood red clothed man’s eyebrows slightly furrowed. His Mental Energy emitted a unique undulation, and soon after, an indifferent voice softly sounded out from his mouth: “Hua Zong obtained his Symbol Puppet from me. Though you have already gotten rid of the mark within the Symbol Puppet, if you remain so close to me, you will still be unable to escape my senses…”\u003c/p\u003e\n\u003cp\u003eThe man in blood red’s words were extremely mysterious, such that even some of the Ghastly Puppet Cult disciples beside him were taken aback. However, they two initial Qi Creation stage practitioners quickly regained their wits, as their expressions turned cold, swiftly sweeping the surroundings like blades, while they shouted angrily: “Lin Dong, show yourself!”\u003c/p\u003e\n\u003cp\u003eThe Ghastly Puppet Cult’s strange actions drew quite a few astonished gazes, and when they heard the shouts, several people suddenly had a flash of realization. Recently, news of the conflict between Lin Dong and the Ghastly Puppet Cult had spread like wildfire in the Great Desolate Province, especially after a seriously injured Hua Gu returned to Great Puppet City, Lin Dong’s name had unknowingly spread around.\u003c/p\u003e\n\u003cp\u003e“Is it actually Lin Dong? The one that killed Hua Zong and injured Hua Gu?”\u003c/p\u003e\n\u003cp\u003e“To think that he still dared to come here, is he not afraid of being ripped to pieces by the Ghastly Puppet Cult…”\u003c/p\u003e\n\u003cp\u003e“......”\u003c/p\u003e\n\u003cp\u003eWhispers swiftly spread out in the crowd, as many people looked around, intending to uncover the identity of the man who had recently became famed throughout Great Desolate Province.\u003c/p\u003e\n\u003cp\u003eWhile gazes looked all around, the blood red clothed man indifferently lifted his head. Without speaking, his sleeve waved as a blood red Mental Energy swiftly swept forth, viciously shooting towards a certain area in the crowd.\u003c/p\u003e\n\u003cp\u003eUpon seeing the blood red clothed man’s attack flying over, the crowd in that area hastily spread out. In the blink of an eye, a single figure was left standing in place.\u003c/p\u003e\n\u003cp\u003eAs the area cleared in an instant, Lin Dong’s eyebrows furrowed. He did not expect that the blood red clothed man was able to accurately sense Symbol Puppets, and actually discover his location.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eWhile his eyebrows furrowed, Mental Energy also burst forth from Lin Dong’s Niwan Palace, and collided against the blood red clothed man’s attack, causing a Mental Energy shock wave to swiftly spread out from the epicenter of the collision.\u003c/p\u003e\n\u003cp\u003eWhen they saw that Lin Dong had appeared, the Ghastly Puppet Cult troops’ expressions turned vicious, while Yuan Power and Mental Energy began to stir...\u003c/p\u003e\n\u003cp\u003e“I am rather interested in you. Besides, before I left, elder Hua Zong entrusted me with a task. That is, if I meet you, I’ll have to bring your body back for him to make a Symbol Puppet…” The blood red clothed man’s tone was apathetic and his voice did not contain the slightest bit of emotion. He stared at Lin Dong, as if he was talking about an ordinary matter.\u003c/p\u003e\n\u003cp\u003eAfter hearing his words, the surrounding Ghastly Puppet Cult members and some people who knew this person immediately cast pitying gazes at Lin Dong. In the Great Desolate Province, as long as Teng Lei was interested in someone, no matter if this person was a man or woman, his or her fate would be quite tragic...\u003c/p\u003e\n\u003cp\u003e“Are you going to fight by yourself or all together?” Lin Dong chuckled, his laughter likewise tinged with a cold blade-like feeling. Even though he felt a trace of danger from the blood red clothed youth before him, if they really fought, Lin Dong did not fear the latter at all.\u003c/p\u003e\n\u003cp\u003e“I alone am enough.”\u003c/p\u003e\n\u003cp\u003eAs the blood red clothed man’s detached voice sounded out, the atmosphere instantly turned hostile, while excited gazes were cast over from all around. Blood hand Teng Lei was extremely renowned in the Great Desolate Province, and he was also known as the most outstanding talent among the Ghast Puppet Cult’s younger generation. Together with the Great Devil Sect’s Mu Qianqian and the Martial Alliance’s Wu Ci, the trio were the most outstanding amongst the Great Desolate Province’s younger generation.\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong did not have such fame, his recent actions allowed others to understand that he was no weakling. Though many did not believe that Lin Dong had relied on his own strength to defeat and injure Hua Gu, this did not stop Lin Dong’s name from spreading.\u003c/p\u003e\n\u003cp\u003eLin Dong and Teng Lei could both be considered as well-known younger generation members. Hence, quite a number of people wanted to see who would come out on top in a fight between the two.\u003c/p\u003e\n\u003cp\u003eThe hostile atmosphere did not last for long, before Teng Lei ferociously stepped forward, his body transforming into a blood red shadow, which swiftly flew forward.\u003c/p\u003e\n\u003cp\u003eJust as the blood red clothed man’s figure charged forward, a huge blood red Mental Energy palm swiftly took shape above Lin Dong’s head. It gave off a bloody stench and emitted a low wind noise as it viciously slammed down towards Lin Dong.\u003c/p\u003e\n\u003cp\u003eIn response to Teng Lei’s formidable attack, Lin Dong’s expression turned cold, as powerful Mental Energy gushed out of his Niwan Palace, also transforming into a huge Mental Energy palm and smashed against the huge blood colored palm.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eA violent Mental Energy shock wave unfurled from the epicenter of the clash. When Teng Lei saw that Lin Dong actually dared to clash against him with Mental Energy, a sneer involuntarily flitted across his eyes. His hand clenched, as traces of bloody Qi swiftly oozed out from the huge blood colored palm!\u003c/p\u003e\n\u003cp\u003e“Chi chi!”\u003c/p\u003e\n\u003cp\u003eWhen that strange bloody Qi made contact with Lin Dong’s huge Mental Energy palm, waves of white mist instantly erupted. An extremely strong corrosive effect caused Lin Dong’s huge Mental Energy palm to scatter substantially.\u003c/p\u003e\n\u003cp\u003e“To think that this guy’s Mental Energy actually has such an effect!”\u003c/p\u003e\n\u003cp\u003eUpon seeing that the blood red clothed man’s Mental Energy actually possessed a corrosive ability, Lin Dong’s expression turned a little icey. Soon after, he sneered while a unique undulation quickly spread out from his Niwan Palace.\u003c/p\u003e\n\u003cp\u003e“Devour it!”\u003c/p\u003e\n\u003cp\u003eShockwaves emerged, before a suction force immediately emerged from Lin Dong’s giant Mental Energy palm, before it forcefully sucked away that bloody Qi.\u003c/p\u003e\n\u003cp\u003e“Crush!”\u003c/p\u003e\n\u003cp\u003eAfter he devoured that bloody Qi, which possessed a corrosive ability, Lin Dong gripped his palm, before he directly ripped apart Teng Lei’s giant Mental Energy palm.\u003c/p\u003e\n\u003cp\u003e“It seems like just you alone is not enough!” After he forcefully ripped his Mental Energy palm, Lin Dong stared formidably at Teng Lei, before he chuckled.\u003c/p\u003e\n\u003cp\u003e“Wow!”\u003c/p\u003e\n\u003cp\u003eWhen they saw that Lin Dong had actually gained the upper-hand in their duel, the surrounding crowd immediately began to exclaim in surprise. Meanwhile, bewildered stares continuously swept across Lin Dong’s body. It seems like the strength that the former had displayed, had truly astounded them.\u003c/p\u003e\n\u003cp\u003e“Not bad indeed.” Though his attack was blown apart, that Teng Lei was not angry. Instead, a peculiar glint flashed across his eyes. Staring right at Lin Dong, his palm swirled before an exceedingly huge blood-red Mental Energy, slowly emerged from his body just like a typhoon. Based on his expression, it seems like Lin Dong’s counter attack had thoroughly piqued the interest of this Ghastly Puppet Cult pervert.\u003c/p\u003e\n\u003cp\u003eWhen he saw that Teng Lei was still planning to attack, Lin Dong’s eyes twinkled. Meanwhile, Great Sun Thunder Yuan began to slowly flow within his inner channels. Faintly, the sound of thunder could be heard.\u003c/p\u003e\n\u003cp\u003e“Haha, this place is really crowded. Lin Dong, just like how I told you, that pervert will surely be interested in you.” Just as the two of them were gathering your Yuan Power and Mental Energy, a hearty laughter suddenly echoed out. Then, a large group of people emerged from behind them. The one leading the pack, was actually the black-clothed teenager that Lin Dong met a few days before.\u003c/p\u003e\n\u003cp\u003eRight now, that black-clothed teenager was leading several men as they walked right ahead. Finally, he looked cheerfully at Lin Dong and an expressionless Teng Li, while he swung his black metal bar.\u003c/p\u003e\n\u003cp\u003eWhen he saw this man, Lin Dong was slightly taken aback. Promptly, he turned to look at the men following behind him, before he realized that several of them were Form Creation stage practitioners. Then, he finally understood that these men were probably from the Martial Alliance...\u003c/p\u003e\n\u003cp\u003e“Haha, are you guys fighting? Else, you can always fight with me.” Wu Ci jokingly said, while his eyes stared somewhat fervently at Lin Dong and Teng Lei.\u003c/p\u003e\n\u003cp\u003e“Haha, Wu Ci, you brought your men along while you lurk at them. Teng Lei is naturally fearful. However, Teng Lei, right now the seal on the Great Wastelands Ancient Tablet is about to weaken, if you battle with Lin Dong now and both of you end up injured, you would probably have to head home…”\u003c/p\u003e\n\u003cp\u003eWhen Wu Ci’s laughter ended, a delicate and bewitching soft laughter sound appeared. Then, the crowds split apart, before a bewitching and seductive-looking Mu Qianqian, who was dressed in a black dress, slowly walked out. Standing behind her, were a large number of men as well. Evidently, they were elite practitioners from Great Devil Sect.\u003c/p\u003e\n\u003cp\u003eThe sudden emergence of these two factions immediately caused the atmosphere to turn somewhat peculiar. Great Devil Sect, Martial Alliance and Ghastly Puppet Cult were the top three factions in Great Desolate Province. Though they seemed harmonious on the surface, they had constantly conflicted in the dark while they jostled with each other. Therefore, when they appeared, even that Teng Lei’s eyes started to glimmer, while his previous formidable aura seemed to have dissipate. Just as Mu Qianqian said, Lin Dong was quite skilled. Hence, if he fought with him now, he would probably lose several of his men and that was not good news for them.\u003c/p\u003e\n\u003cp\u003e“Consider yourself lucky, you get to live a littler longer. If you are smart, you should leave this place now. Perhaps you can save yourself.” Teng Lei coldly stared at Lin Dong before he said.\u003c/p\u003e\n\u003cp\u003eLin Dong cast a glance at him, while he silently chuckled inside his heart. The number of elite practitioners that had been attracted by the Great Wastelands Ancient Tablet was truly tremendous. Furthermore, some of them were exceptionally skilled. Therefore, if one wish to obtain the treasures inside Great Wastelands Ancient Tablet, then even a faction as powerful at Ghastly Puppet Cult or Great Devil Sect would face quite a challenging time. Right now, since they were outside, others may still fear them. However, once they enter into the Great Wastelands Ancient Tablet, under the allure of the treasures, even the Ghastly Puppet Cult may be attacked in a fit of jealousy. At that time, he would find an opportunity to make these guys suffer.\u003c/p\u003e\n\u003cp\u003eWhen the Great Devil Sect and Marital Alliance arrived, the intense battle that was about to erupt suddenly ended. This caused several people in the crowd to sigh in regret, before their attention turned towards the Great Wastelands Ancient Tablet, as they waited for the moment whereby the seal weakens...\u003c/p\u003e\n\u003cp\u003e“Swish!”\u003c/p\u003e\n\u003cp\u003eWhile the crowds waited in anticipation, suddenly, a splitting wind sound emerged from behind the crowds. Then, giant patches of glowing shadows flew from the skies, before they caused the crowds to gasp in awe.\u003c/p\u003e\n\u003cp\u003e“It’s the four Great Clans!”\u003c/p\u003e\n\u003cp\u003eSeated on a large boulder, Lin Dong suddenly heard the gasps from behind. Immediately, his eyes opened up while he slowly clenched his fist!\u003c/p\u003e\n\u003cp\u003eFinally, we shall meet again!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-262\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-264\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-263","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
