{"id":60054,"no":298,"title":"Chapter 298 Black Symbol","content":"\u003cp\u003e\u003cstrong\u003eChapter 298 Black Symbol\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe sky encompassing storm rumbled as wave after wave of strong winds blew while terrifying Yuan Power undulations tore at the plains below. This astonishing sight caused fear to fill one’s heart.\u003c/p\u003e\n\u003cp\u003eWithin the storm, the mysterious skeleton was already slowly floating nearby not far from Lin Dong. As he stared at the ash gray skeleton and the dim red light flickering in its eyes, Lin Dong swallowed a mouthful of saliva, while urging the Yuan Power in his body to the maximum as the Heavenly Scales martial technique flashed in his hands.\u003c/p\u003e\n\u003cp\u003e“Roar!”\u003c/p\u003e\n\u003cp\u003eLittle Flame was also able to sense how terrifying this thing was. Immediately, it let loose a low roar, the blood colored wings on its body slightly raising, forming a protective screen, safeguarding Lin Dong behind it.\u003c/p\u003e\n\u003cp\u003e“What do we do now?” Lin Dong’s scalp was numb as he asked Little Marten on his shoulder. There seemed to be no way to escape now.\u003c/p\u003e\n\u003cp\u003e“If it’s truly not possible, first throw the Qiankun bag.” Little Marten helplessly replied.\u003c/p\u003e\n\u003cp\u003e“You stupid marten, you usually brag about how awesome you are, can you be at least a little useful at critical moments!” Lin Dong gritted his teeth and retorted.\u003c/p\u003e\n\u003cp\u003eUpon hearing this, Little Marten could not help but become somewhat embarrassed: “God damnit, this thing is no ordinary foe, when I was at my peak…”\u003c/p\u003e\n\u003cp\u003eWhen he heard that this fellow was going to talk about its peak period again, Lin Dong could not help but be speechless. His hand tightly gripped the Ancient Heavenly Scales Halberd, too lazy to waste any more words on that fellow. Even if he threw away the Qiankun bag now, the mysterious skeleton might still not easily let him go. Since that was so, he could only give his all.\u003c/p\u003e\n\u003cp\u003e“Hey hey, stop looking as if your parents had died. Although grandpa marten cannot beat this ghastly thing, escaping while bringing you along is still possible. Though the price will be extremely high.” Little Marten grinned as it very helplessly said.\u003c/p\u003e\n\u003cp\u003e“I hope so.” Now, Lin Dong did not plan on placing his hopes on this unreliable fellow. His gaze was tightly fixed on the mysterious skeleton. From the Yuan Power that suddenly turned violent around the latter’s body, he knew that this ghastly thing was about to make its move.\u003c/p\u003e\n\u003cp\u003e“Thieves will be killed without pardon!”\u003c/p\u003e\n\u003cp\u003eThe mysterious skeleton stood on the tornado while its eyes flickered with red light. A exceptionally coarse voice slowly spread out from its mouth. The voice seemed to bring with it an endless killing intent that could change even the color of the land.\u003c/p\u003e\n\u003cp\u003eAs the coarse voice sounded out, the mysterious skeleton’s ash gray hand abruptly reached out. Quickly, the Yuan Power of the land screamed and actually directly condensed into a huge earth-shattering Yuan Power bone hand in the air. The bone hand slapped downwards, directly exploding the air, and immediately furiously slapping down onto Lin Dong. With its power, even a mountain would be instantly shattered to bits.\u003c/p\u003e\n\u003cp\u003eIn the face of this attack, a pale look surfaced on Lin Dong’s face. In the next instant, a fierce light abruptly flickered in his eyes. Since he had no way out, he could only desperately fight!\u003c/p\u003e\n\u003cp\u003e“Let me see exactly how capable a guardian like you are!” Lin Dong bellowed. Soon after, his hands suddenly formed extremely abstruse seals in succession. As the seals changed, the surrounding Yuan Power started to boil, so much so that even surrounding Yuan Power of the land also gave signs of being drawn in.\u003c/p\u003e\n\u003cp\u003e“Boom boom!”\u003c/p\u003e\n\u003cp\u003eWaves of Yuan Power from the land strangely gathered around Lin Dong, faintly, giving off a powerful aura. The astonishing thing was that utilising the Yuan Power of the land was an ability Nirvana stage practitioners had. Yet, it was now done by a Lin Dong who had just reached the Qi Creation stage. If this scene was seen by Wang Tong and the rest, they would definitely piss in their pants.\u003c/p\u003e\n\u003cp\u003e“If you want to kill me, I’ll have to give you a taste of this Great Desolate Imprisoning Heavenly Finger!”\u003c/p\u003e\n\u003cp\u003eYuan Power screamed as a vicious look surfaced in Lin Dong’s eyes. He stepped forward and pointed at the sky!\u003c/p\u003e\n\u003cp\u003eAs Lin Dong’s finger thrust forth, the strong winds in the sky seemed to become quiet in this moment and the billowing black clouds were quickly ripped apart. Yuan Power gathered as a huge pitch-black finger that was about several hundred meters large cut open the sky like an enormous black meteorite, bringing along a unique desolate aura and viciously shooting towards the mysterious skeleton.\u003c/p\u003e\n\u003cp\u003eGreat Desolate Imprisoning Heavenly Finger. This was the Manifestation martial art Lin Dong had obtained from the Manifestation Martial Tablet. He did not expect that his usage of it would be able to automatically gather the Yuan Power of the land. Furthermore, when the Great Desolate Imprisoning Heavenly Finger pointed towards the mysterious skeleton, the surrounding Yuan Power of the land behind the latter strangely froze, as there was a prison that trapped the mysterious skeleton within, making it unable to move.\u003c/p\u003e\n\u003cp\u003eOf course, with Lin Dong’s current strength, even if he used the Great Desolate Imprisoning Heavenly Finger, he was clearly unable to truly bind the mysterious skeleton. Thus, the frozen Yuan Power only lasted for two blinks of an eye before it was directly jolted apart by the mysterious skeleton. With a wave of its bone hand, a humongous white bone palm print clashed with the enormous pitch-black finger, causing a loud boom to sound out.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eAt the moment of impact, the land instantly shook as incomparable Yuan Power storms unfurled. The black clouds and strong winds in the sky were practically completely obliterated in a split second!\u003c/p\u003e\n\u003cp\u003eYuan Power storms rippled across the ground. Immediately, huge waves of sand appeared on the plains, reaching hundreds of meters in height as they unfurled in a ring-shape, sweeping away in all directions. In that instant, the entire plains became a mess.\u003c/p\u003e\n\u003cp\u003eAt the epicenter of the Yuan Power storms, the bone palm and enormous pitch-black finger frantically released terrifying ripples and storms. In the end, they both exploded with a huge bang.\u003c/p\u003e\n\u003cp\u003eLin Dong was actually able to rely on his Qi Creation stage strength to forcibly withstand the terrifying mysterious skeleton’s blow!\u003c/p\u003e\n\u003cp\u003e“Plop!”\u003c/p\u003e\n\u003cp\u003eHowever, although he withstood this attack, Lin Dong’s expression instantly turned deathly pale. A mouthful of fresh blood wildly spewed from his mouth, and even the traces of blood were forcefully jolted out from the pores all over his body. In a split second, he had entirely become a blood person.\u003c/p\u003e\n\u003cp\u003eAfter spitting out a mouthful of fresh blood, Lin Dong unsteadily stepped back about a hundred steps before his somewhat sorry figure stabilized. Currently, the Yuan Power in his body was completely used up due to the previous attack!\u003c/p\u003e\n\u003cp\u003e“That god damned thing is a little too frightening…” Lin Dong wiped the blood from the corner of his mouth as he felt the injuries in his body and could not help but let out a bitter laugh. Though he barely managed to withstand the other party’s attack, the cost to him was truly not small.\u003c/p\u003e\n\u003cp\u003e“Invaders will be killed without pardon!”\u003c/p\u003e\n\u003cp\u003eRed light flickered in the mysterious skeleton’s eyes as an emotionless voice slowly sounded out. Soon after, a bone palm stamped on the sky as frightening Yuan Power once again condensed above its head. In a short few moments, ten enormous Yuan Power bone palms which were even bigger than before were formed as a terrifying shockwave spread out from them.\u003c/p\u003e\n\u003cp\u003eUpon seeing this scene, Lin Dong’s vision involuntarily turned a little dark. Enduring one bone palm had already cost him his full power, against ten of them, there would likely not even be dust left of him.\u003c/p\u003e\n\u003cp\u003e“You’re really too impetuous you brat, actually daring to directly face off against this ghastly thing!” Little Marten flashed onto Lin Dong’s shoulders while Little Flame also dashed out and guarded Lin Dong from the front as it released a furious roar at the mysterious skeleton.\u003c/p\u003e\n\u003cp\u003e“What do we do now?” Lin Dong deeply inhaled. This was truly a life or death moment, if there was no longer any way, they would likely all die here.\u003c/p\u003e\n\u003cp\u003e“Relax, you will not die!” Little Marten shook its head. Within its gaze was a little hesitation and struggle. Moments later, it finally sighed as it stretched out two claws and put them on Lin Dong’s and Little Flame’s bodies as if it wanted to do something.\u003c/p\u003e\n\u003cp\u003e“Boom boom!”\u003c/p\u003e\n\u003cp\u003eThe mysterious skeleton’s palm prints moved and soon after it suddenly stretched out a bone hand. Immediately, the world changed color as the ten sky-covering huge bone palms furiously slapped down onto Lin Dong. Under this level of attack, the space a thousand meters around Lin Dong was completely destroyed while Lin Dong’s body was made completely immobile by the berserk Yuan Power.\u003c/p\u003e\n\u003cp\u003eThis was not a fight of the same level!\u003c/p\u003e\n\u003cp\u003eAs he stared at the bone palms which were speedily enlarging in his eyes, Lin Dong deeply inhaled. Now, he could only see if Little Marten had any methods, or else, the Great Wastelands Ancient Tablet would truly become his grave today.\u003c/p\u003e\n\u003cp\u003eLittle Marten’s eyes were tightly fixed on the sky. At its claws, purplish black lift swiftly gushed out. Within this purplish light was a faint sliver of purplish gold. As that purple glow erupted, Little Marten’s eyes gradually turned deep black. One could tell that it was forcibly trying to display something.\u003c/p\u003e\n\u003cp\u003eThe purplish black lustre grew increasingly rich as the bone palms which was full of destructive power arrived. Before they landed, the several tens of meters of the plain had already crumbled as if it had become an enormous basin.\u003c/p\u003e\n\u003cp\u003e“Ch ch!”\u003c/p\u003e\n\u003cp\u003ePurplish black light swiftly wrapped around Lin Dong and Little Flame, however, just as Little Marten prepared its final struggle against the mysterious skeleton, a unique undulation suddenly spread out from Lin Dong’s body!\u003c/p\u003e\n\u003cp\u003e“Buzz buzz!”\u003c/p\u003e\n\u003cp\u003eTowards this undulation, Lin Dong had a face full of shock. Before he could regain his wits, a black light suddenly swept out from his Qiankun bag, transforming into a black symbol which floated above his head.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThe black symbol quietly hovered above Lin Dong’s head, not giving off any energy undulations, but, the ten bone palms full of destructive power suddenly froze at this instant!\u003c/p\u003e\n\u003cp\u003eAt the same time, the rebelling Yuan Power of the land and... the floating mysterious skeleton likewise froze in place.\u003c/p\u003e\n\u003cp\u003eThe mysterious skeleton’s eyes locked onto the black symbol, red light flickering. In the end, under Lin Dong’s astonished gaze, it slowly bent down in the sky and kneeled down on one knee towards the black symbol...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-297\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-299\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-298","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
