{"id":60062,"no":306,"title":"Chapter 306: Retreating Safely","content":"\u003cp\u003e\u003cstrong\u003eChapter 306: Retreating Safely\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“How is that possible?!”\u003c/p\u003e\n\u003cp\u003eAs he stared at his gigantic blood python that was crushed by that huge golden finger, a tinge of shock flashed across Cao Zhen’s face. Promptly, his figure swiftly retreated while his fists danced before they transformed into gigantic Yuan Power fists. Then, he viciously thrust it towards Lin Dong.\u003c/p\u003e\n\u003cp\u003e“You shall break!”\u003c/p\u003e\n\u003cp\u003eWhen he saw that Cao Zhen was still resisting, Lin Dong’s eyes turned cold. Promptly, he suddenly pressed his palm down, while his giant golden finger exploded and all the Yuan Power fists were instantly destroyed in an domineering fashion Then, it viciously slammed against the former’s Yuan Power shield that was in front of him.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eAfter that finger attack, the Yuan Power defences that were plastered over Cao Zhen’s body were instantly dissipated. Then, with an unstoppable force, it tore through his defences and heavily slammed against his body.\u003c/p\u003e\n\u003cp\u003eAfter a deep sounding explosion, Cao Zhen’s body was directly blown back several hundred miles. Meanwhile his body tore through several tall buildings along the way, before he was able to stabilize his body hideously.\u003c/p\u003e\n\u003cp\u003e“Buzz buzz!”\u003c/p\u003e\n\u003cp\u003eAfter he stabilized his body, Cao Zhen’s face was pale and green. Finally, he could no longer resist and he involuntarily vomitted a mouthful of blood. Even though he was a half-step-to Manifestation practitioner, he was still unable to withstand the force behind Lin Dong’s finger attack.\u003c/p\u003e\n\u003cp\u003e“Cao Zhen was actually defeated!”\u003c/p\u003e\n\u003cp\u003eAs they stared at that visibly weakened Cao Zhen, who was vomiting blood, exclamations immediately erupted from within Great Puppet City. Numerous pairs of eyes stared with shock and fear right at that young figure in mid-air.\u003c/p\u003e\n\u003cp\u003eRight now, the golden glow across the horizon had not completely dissipated. Under the cover of the golden glow, that figure seemed just like a unstopped battle deity!\u003c/p\u003e\n\u003cp\u003eOver at the Great Devil Sect and Marital Alliance division, all of their elite practitioners were also stunned by this sight. Mu Qianqian, Wu Ci and the rest involuntarily sucked in a breath of cold air. None of them have expected that Lin Dong could actually defeat a half-step-to Manifestation practitioner!\u003c/p\u003e\n\u003cp\u003e“How is that possible!” Teng Lei and the other Ghastly Puppet Cult elite practitioners were also so alarmed by this sight till they turned pale. Some elite practitioner even shrieked involuntarily. This outcome caused everyone to be taken by surprise. None of them expected that based on Cao Zhen’s halfway-step-to Manifestation ability, how could he lose to Lin Dong, who was only at initial Qi Creation stage!\u003c/p\u003e\n\u003cp\u003eUnder countless distraught stares from the crowd, Cao Zhen’s face was extremely grim. He had evidently underestimated the power of Lin Dong’s Manifestation Martial Arts. This time, he had truly thrown his face.\u003c/p\u003e\n\u003cp\u003e“You want to learn my Manifestation Martial Arts? Based on your current ability, you still dare to utter such words!” In mid-air, Lin Dong hovered in mid-air and stared at Cao Zhen, whose face was in flux, as he chuckled.\u003c/p\u003e\n\u003cp\u003eCao Zhen’s face was grim, as he viciously swiped off the blood on his lips. Then, he lifted his head and stared at that golden glowing figure, before he shouted: “Manifestation Martial Arts is indeed powerful. However, kid, based on your Qi Creation stage ability, how many times can you execute your previous attack?”\u003c/p\u003e\n\u003cp\u003eCao Zhen was indeed a half-step-to Manifestation elite practitioner. Even though Lin Dong had injured him, he did not lose his battle ability. In fact, he understood that even though Manifestation Martial Arts are indeed powerful, it took a huge toll to execute them. Therefore, based on Lin Dong’s current ability, it was difficult for him to execute it consecutively.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were twinkling. His strength was indeed much lacking compared to Cao Zhen. Even though he was able to rely on his Great Desolate Imprisoning Heavenly Finger to defeat him, he knew that he was unable to kill him. Nonetheless, Great Desolate Imprisoning Heavenly Finger was not the only trick up his sleeve!\u003c/p\u003e\n\u003cp\u003e“Haha, after today’s fight, I have already caused you lose all your reputation. Blood Slaughter Hand Cao Zhen is merely so!” Lin Dong coldly chuckled as he said.\u003c/p\u003e\n\u003cp\u003eWhen he heard his words, Cao Zhen’s facial expression changed, while his eyes filled with thick killing intent darkened.\u003c/p\u003e\n\u003cp\u003e“Uncle Cao Zhen, it is no big deal to make a mishap once in awhile, all you need to do is delay that brat for a while. I have already secretly crushed our Mental Energy Talisman Signal and informed the headquarters about this incident. They will surely send out elite practitioners immediately. At that time, even if that kid possess Manifestation Martial Arts, he will not be able to escape!” Just as Cao Zhen was enraged, standing nearby, Teng Lei suddenly shouted out.\u003c/p\u003e\n\u003cp\u003e“Haha, great!” When he heard his words, Cao Zhen was first taken aback. Promptly, he laughed out heartily, before he stared coldly at Lin Dong. Regardless of how powerful the latter was, once reinforcements from headquarter arrives, the latter would definitely not be able to escape alive. After all, regardless of how powerful one person is, one is unable to fight against an entire sect!\u003c/p\u003e\n\u003cp\u003eWhen he heard Teng Lei’s shout, Lin Dong’s eyes darkened. Those fellows are truly courting death...\u003c/p\u003e\n\u003cp\u003e“Since you want to stop me, then I shall slaughter all of you!”\u003c/p\u003e\n\u003cp\u003eAfter Lin Dong chuckled, his figure flashed and he actually took the initiative and dashed towards Cao Zhen. Meanwhile, the potent Yuan Power surrounding his body began to spread out.\u003c/p\u003e\n\u003cp\u003eWhen he saw Lin Dong dashing towards him, that Cao Zhen was shocked. After he previously suffered at the hands of Lin Dong, he was now wary of Lin Dong. Therefore, he chose not to fight directly against him and actually decided to retreat instead. Since he had already made up his mind, instead of battling directly against Lin Dong, all he needed to do was to stall the latter. Then, once reinforcements arrive, he will join them and slaughter Lin Dong!\u003c/p\u003e\n\u003cp\u003e“Heh!” However, just as Cao Zhen quickly retreated, Lin Dong suddenly made a u-turn as he directly abandoned his target and turned towards Teng Lei. Turns out his target was not Cao Zhen, but Teng Lei instead!\u003c/p\u003e\n\u003cp\u003eAfter all, the reason why Lin Dong came to Great Puppet City, was to first establish his dominance, and second, to capture someone important in Great Puppet Cult and obtain information from him regarding the “Devouring Ancient Symbol”. Now that he had already established his dominance, it was time for him to capture someone!\u003c/p\u003e\n\u003cp\u003eFor most of the people here, even though Cao Zhen’s status was quite high, he was still a half-step-to Manifestation practitioner. Hence it was quite difficult to capture him. In that case, Teng Lei was the next best option available, since he held quite a high status in Ghastly Puppet Cult. Furthermore, right now, he posed no threat to Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Stop him!”\u003c/p\u003e\n\u003cp\u003eWhen he saw Lin Dong dashing towards him, Teng Lei’s facial expression changed as he hurriedly shouted out. When they heard his shouts, the three elite Qi Creation practitioners nearby quickly executed powerful Martial Arts and tried to push Lin Dong back.\u003c/p\u003e\n\u003cp\u003e“Get lost!”\u003c/p\u003e\n\u003cp\u003eHowever, as he faced those three obstructing Qi Creation stage practitioners, Lin Dong coldly shouted out. Then, he gripped his palm, before he immediately materialized a golden giant platform and viciously flung it towards the three of them.\u003c/p\u003e\n\u003cp\u003e“Bang bang!”\u003c/p\u003e\n\u003cp\u003eThat gigantic golden platform howled forth and directly bulldozed through the trio’s martial arts. Then, without a drop in pace, it viciously slammed against the three Ghastly Puppet Cult practitioner. Immediately, the three of them flew off just like cannonballs, while they vomited blood along the way.\u003c/p\u003e\n\u003cp\u003eAfter he forcefully blew away the three elite Ghastly Puppet Cult practitioner, Lin Dong’s figure flashed before he quickly chased after Teng Lei, who was fleeing for his life. Yuan Power undulated on his gigantic palm while he directly swiped at the latter.\u003c/p\u003e\n\u003cp\u003e“Major Ghoul Techniques, Ghastly Demonic Howl!”\u003c/p\u003e\n\u003cp\u003eWhen he saw Lin Dong dashed over, Teng Lei’s facial expression changed drastically. Promptly, he quickly executed his secret techniques. Immediately, a piercing Mental Energy soundwave erupted forth and quickly swept towards Lin Dong.\u003c/p\u003e\n\u003cp\u003eAs he stared at Teng Lei’s last minute resistance, Lin Dong involuntarily chuckled. With a flick of his mind, an equally vicious Mental Energy sonic boom echoed forth and viciously slammed against Teng Lei’s sonic boom.\u003c/p\u003e\n\u003cp\u003e“Boom boom boom!”\u003c/p\u003e\n\u003cp\u003eAfter their sonic boom collided, a series of explosive noises immediately erupted forth. Promptly, a deep sonic boom explosion quickly emerged from the latter’s bodies.\u003c/p\u003e\n\u003cp\u003e“You want to fight with me based on your current strength. Dream on!” After that sonic boom, golden glow gathered on Lin Dong’s palm, before he directly passed through that thick sonic boom and directly grabbed onto Teng Lei’s head. Promptly, a stealthy force erupted forth and directly caused Teng Lei to faint.\u003c/p\u003e\n\u003cp\u003eLin Dong’s move was like a flash in the pan. The crowds only saw that he was planning to make a move on Cao Zhen, before instantly, three Ghastly Puppet Cult members, and even Teng Lei were instantly grabbed by him, just like a couple of dead dogs.\u003c/p\u003e\n\u003cp\u003e“You bastard, release Teng Lei!” Right now, Cao Zhen finally recovered his senses. Instantly, his face turned steely green. If Lin Dong captured Teng Lei in front of all these Ghastly Puppet Cult members, then their Ghastly Puppet Cult would have lost all honor today.\u003c/p\u003e\n\u003cp\u003eAs he shouted out, that Cao Zhen once again dashed forth. Meanwhile, a bloody glow undulated on his arms, before he directly punched at Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Haha!”\u003c/p\u003e\n\u003cp\u003eHowever, with regards to Cao Zhen’s attack, Lin Dong did not pay any heed towards it. Immediately, his figure flashed before he swiftly retreated. Then, he waved his palm, before his Symbol Puppet immediately appeared beside him. Immediately, he directly poured ten thousand pure Yuan Pills into it, before that Symbol Puppet dashed forth and gallantly clashed against Cao Zhen.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eA powerful energy shockwave erupted causing both parties to be blown back. In fact, that Cao Zhen did not have an inch of advantage at all.\u003c/p\u003e\n\u003cp\u003e“High-grade Symbol Puppet?!”\u003c/p\u003e\n\u003cp\u003eAs he stared at that Symbol Puppet, Cao Zhen’s pupils shrunk as he solemnly shouted.\u003c/p\u003e\n\u003cp\u003e“Haha, it seems like the Ghastly Puppet Cult is merely so. Today’s battle was quite satisfying. Goodbye!”\u003c/p\u003e\n\u003cp\u003eLin Dong dragged an unconscious Teng Lei, as he laughed. Then, he released a whistle, before Little Flame instantly transformed into a red flash and headed over. After he mounted on it, it flapped its bloody wings and lighting-quick dashed out of Great Puppet City. In mere seconds, he had disappeared across the horizon, under the stares from the crowd.\u003c/p\u003e\n\u003cp\u003eEven after Lin Dong fled, the Great Puppet City was silent, while everyone stared at an enraged Cao Zhen hovering in mid-air. After all, everyone knew that from today onwards, Lin Dong’s name would resound across the entire Great Desolate Province...\u003c/p\u003e\n\u003cp\u003eHe had actually provoked the entire Ghastly Puppet Cult on his own and even managed to defeat a half-step-to Manifestation elite practitioner. In the end, not only did he escape safely, he was even able to capture one of them. His accomplishments, regardless of whether one witnessed it personally or merely heard of it, was enough to astound anyone...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-305\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-307\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-306","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
