{"id":60074,"no":318,"title":"Chapter 318: Nowhere to hide","content":"\u003cp\u003e\u003cstrong\u003eChapter 318: Nowhere to hide\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhen they heard Lin Dong’s derisive laugh, several elite practitioners surrounding the Mysterious Black Yin Crevice were both slightly stunned. Evidently, they had never expected that even at such a crucial moment, Lin Dong still showed no intention of retreating. Instead, his tone got increasingly rude.\u003c/p\u003e\n\u003cp\u003e“Haha, so charming. However, I wonder if you will still be this arrogant after this sect leader capture you and break off your limbs?” Teng Sha was so infuriated till he laughed. Meanwhile, an extremely cruel glint flashed across his eyes.\u003c/p\u003e\n\u003cp\u003e“Everyone from Ghastly Puppet Cult listen up, spread out and surround him. If anyone lets him slip away, he shall be severely punished!”\u003c/p\u003e\n\u003cp\u003e“Yes!”\u003c/p\u003e\n\u003cp\u003eWhen they heard Teng Sha’s solemn and cold voice, all the elite Ghastly Puppet Cult practitioners hurriedly shouted out, before they swiftly dispersed. Every spot was filled with Ghastly Puppet Cult troops. Against such a formation, Lin Dong literally had nowhere to run!\u003c/p\u003e\n\u003cp\u003e“Everyone here, today’s matter is between my Ghastly Puppet Cult and Lin Dong. Whoever intervenes shall be the enemy of my Ghastly Puppet Cult and we will never forgive him for life!” After he successfully surrounded him, Teng Sha suddenly turned his head before he turned and look at the crowds of elite practitioners, before he coldly shouted out.\u003c/p\u003e\n\u003cp\u003eAs they stared at a venomous Teng Sha, the eyes of the surrounding elite practitioners glimmered. Finally, they all chose to nod their heads silently. Ghastly Puppet Cult was simply too powerful. Now that Teng Sha had reached advanced Manifestation stage, based on his current strength, even Mu Lei and Wu Zong did not dare to offend him lightly. Furthermore, based on the current situation, Ghastly Puppet Cult had evidently seized control of the situation. Based on Lin Dong’s strength, regardless of how he struggled, he would not be able to escape from Teng Sha. Hence, if they chose to intervene now, they would undoubtedly invite a deadly reaction from Ghastly Puppet Cult...\u003c/p\u003e\n\u003cp\u003eAfter intimidating all the surrounding heros with his words, the look on Teng Sha’s face turning increasingly venomous. Then, he suddenly took a step forward, before potent Yuan Power manically swept forth from within his body just like a hurricane. Then, it extended across the horizons and directly caused all the surrounding elite practitioners to hurriedly back off.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, besides death, there is no other option left for you!”\u003c/p\u003e\n\u003cp\u003eTeng Sha’s face was hideous. Then, he waved his hand before streams of Yuan Power directly transformed into a gigantic black seal in mid-air. Countless black mists were surrounding that black seal, while various skeletal structures materialized around the black seal, as painful screams continuously echoed out, causing headaches to the various elite practitioners nearby. Evidently, this was a pretty powerful upper-tier martial arts.\u003c/p\u003e\n\u003cp\u003e“Thousand Devil Bone Eroding Seal!”\u003c/p\u003e\n\u003cp\u003eThat black seal enshrouded the horizons, before Teng Sha violently flung his palm. That black seal immediately tore through the night sky, before it exploded towards Lin Dong with an unstoppable pace. It seems like that Teng Sha did not plan to test him but he truly intended to kill Lin Dong with a single palm attack. Based on the current situation, he understood that he must swiftly kill Lin Dong in order to recover the treasure. Else, unnecessary complications may arise.\u003c/p\u003e\n\u003cp\u003e“Wu Wu!”\u003c/p\u003e\n\u003cp\u003eThat black seal tore through the heavens with a terrifying Yuan Power shockwave contained within and it caused everyone to be alarmed. In fact, some of the formidable Demonic Beasts in the deeper regions of the mountain rage continuously growled out in rage as well.\u003c/p\u003e\n\u003cp\u003e“Little Marten, help me!”\u003c/p\u003e\n\u003cp\u003eLin Dong stared solemnly at that black seal swiftly flying towards him. From its surface, he could sense an extremely dangerous aura. If he was hit by it, even though his body was strengthened by Thunder Jade Body and Demonic Ape Transformation, he would still be killed instantly. That Teng Sha evidently planned to murder him!\u003c/p\u003e\n\u003cp\u003e“Yeah!”\u003c/p\u003e\n\u003cp\u003eLittle Marten also understood the current situation. Without further ado, it\u0027s figure flashed before it directly flew into Lin Dong’s body. Instantly, a peculiar dark purple glow gushed into the latter’s eyes.\u003c/p\u003e\n\u003cp\u003e“Boom boom!’\u003c/p\u003e\n\u003cp\u003eWith Little Marten’s assistance, Lin Dong’s aura seemed to swelled up violently at this moment. Then, his hands formed a series of extremely complicated hand-seals. Just as those hand-seals were formed, dark storm clouds immediately emerged in the sky. In fact, even the Yuan Power in between Heaven and Earth started to vibrate vigorously, before they gathered on top of Lin Dong’s head rapidly.\u003c/p\u003e\n\u003cp\u003e“Such a powerful vibration. Could Lin Dong actually invoke such a peculiar sight?”\u003c/p\u003e\n\u003cp\u003e“That aura… seems like a Manifestation Martial Arts! Lin Dong is about to execute his Manifestation Martial Arts to fight against Teng Sha!”\u003c/p\u003e\n\u003cp\u003e“Such a peculiar sight can only be invoked by a Manifestation Martial Arts. However, Lin Dong is still too weak. Even with a powerful tool like Manifestation Martial Arts, he is still not a match for Teng Sha!”\u003c/p\u003e\n\u003cp\u003e“......”\u003c/p\u003e\n\u003cp\u003eAs they stared at the Yuan Power rapidly gathering above Lin Dong, a series of whispers continuously echoed out in the mountain range.\u003c/p\u003e\n\u003cp\u003e“Great Desolate Imprisoning Heavenly Finger, one finger imprison the heavens!”\u003c/p\u003e\n\u003cp\u003eUnder countless bewildered stares from the crowd, Lin Dong stepped on Little Flame’s broad back, while his hand-seals continuously changed, just like a dragon and snake squirming and it seemed extremely peculiar. Then, a cold roar filled with a unique majestic aura rumbled forth in mid-air.\u003c/p\u003e\n\u003cp\u003eAs Lin Dong’s loud roar spread out, the storm clouds in the skies rumbled, before an extremely gigantic golden finger slowly emerged from within.\u003c/p\u003e\n\u003cp\u003eWhen this giant finger appeared, all of the Yuan Power in this domain started to rage and countless people’s faces were alarmed. It was indeed a Manifestation Martial Arts and it actually possessed such a terrifying aura. However, some exceptionally sharp elite practitioners gently furrowed their eyebrows. Even though Manifestation Martial Arts was extremely overpowering, based on its aura, it was still unable to match up against Teng Sha’s attack...\u003c/p\u003e\n\u003cp\u003e“Huff!”\u003c/p\u003e\n\u003cp\u003eLin Dong stepped on his tiger’s back as he deeply exhaled a puff of white air. Based on his own body’s ability, even if he used Great Desolate Imprisoning Heavenly Finger, he could only match up against a half-step-to Manifestation practitioner. Therefore, even with Little Marten assisting him, he was still unable to defeat Teng Sha, who was at advanced Manifestation stage!\u003c/p\u003e\n\u003cp\u003eHowever, Great Desolate Imprisoning Heavenly Finger was no ordinary Manifestation Martial Arts. Even when the ancient sect was at its peak, it was still considered as a top tier Manifestation Martial Arts. When it was completely executed, its power could even shock the heavens.\u003c/p\u003e\n\u003cp\u003e“Little Marten, assist me!”\u003c/p\u003e\n\u003cp\u003eA deep roar echoed out inside Lin Dong’s heart. A dark purple glow manically swirled in his eyes, just like a whirlpool, before he suddenly took a step forward, while his hand seals continued to change.\u003c/p\u003e\n\u003cp\u003e“Rumble, tumble tumble!”\u003c/p\u003e\n\u003cp\u003eAs Lin Dong’s hand-seals continuously changed, thunder roars instantly ricocheted in mid-air, before a terrifying Yuan Power shockwave once again emerged.\u003c/p\u003e\n\u003cp\u003e“He had not finished yet? Don’t tell me that this Manifestation Martial Arts is not fully executed yet?” A commotion once again emerged in mid-air causing everyone’s faces to change. Promptly, they felt somewhat amazed. A Manifestation Martial Arts shouldn’t be this powerful!\u003c/p\u003e\n\u003cp\u003e“Teng Sha, it is not so easy to kill me!” Lin Dong’s eyes were cold like knives as he stared right at a hideous Teng Sha. Then, his hand-seals changed before his cold voice ricocheted across the horizons.\u003c/p\u003e\n\u003cp\u003e“Great Desolate Imprisoning Heavenly Finger, two fingers crush the mountains and rivers!”\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThe layers of storm clouds crumbled, before an exceedingly terrifying shockwave manically extended from within the storm clouds. Soon after, the crowds saw a gigantic dark purple finger slowly emerged from within the storm clouds before it stood next to the gigantic golden finger.\u003c/p\u003e\n\u003cp\u003eIn terms of size and energy shockwave, that dark purple giant finger was far more powerful than that golden finger. There were countless strange symbols plastered across that giant finger, just like Heaven’s tattoos. They seemed extremely deep and complicated.\u003c/p\u003e\n\u003cp\u003e“Die!”\u003c/p\u003e\n\u003cp\u003eThose two fingers towered over the earth, just like pillars that were holding up the sky. A thick cold glint flowed within Lin Dong’s eyes. As he pointed his finger, under countless bewildered stares from the crowd, those two gigantic fingers tore through the horizons, before they solidly slammed against that gigantic black seal!\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eHeaven and Earth seemed to have turned silent instantly. Then, an indescribable Yuan Power hurricane violently erupted in mid-air, before every giant tree within a thousand meters radius were instantly ruptured into dust. Some of the elite Ghastly Puppet Cult practitioners nearby were directly blown away, while some unlucky one continually vomited out fresh blood, leaving one to wonder if they were dead or alive.\u003c/p\u003e\n\u003cp\u003eIn mere seconds, everything within a thousand miles radius was in tatters. Numerous figures hurriedly retreated, while their eyes stared in alarm at this earth-shattering sight...\u003c/p\u003e\n\u003cp\u003e“Teng Sha’s black seal was blown apart!”\u003c/p\u003e\n\u003cp\u003eCountless pairs of eyes stared at the spot where they collided, before shocked screams suddenly echoed out. Then, the crowds began to saw that the giant seal materialized by Teng Sha was actually forcefully blown away by those two gigantic fingers. Then, it continued to swept towards Teng Sha with a similarly violent shock wave!\u003c/p\u003e\n\u003cp\u003e“Manifestation Mountain Wall!”\u003c/p\u003e\n\u003cp\u003eTeng Sha’s face was grim as he stared at that incoming gigantic finger that was ripping through the horizons. Then, he violently stomped his foot, before potent Yuan Power swiftly materialized into a several hundred meters tall Yuan Power shield. The shape of a mountain faintly emerged on that shield and gave it an exceedingly sturdy sensation.\u003c/p\u003e\n\u003cp\u003eTeng Sha’s advanced Manifestation stage ability was thoroughly showcased now. With a flick of his hand, he had materialized an object using Yuan Power that could even be termed as Yuan Power Creation, and it was extremely formidable. If Lin Dong did not possess such a powerful Manifestation Martial Arts like Great Desolate Imprisoning Heavenly Finger, he would be unable to move it at all.\u003c/p\u003e\n\u003cp\u003e“Boom boom!”\u003c/p\u003e\n\u003cp\u003eThe giant fingers slammed against that Yuan Power shield before an earth-shattering noise instantly erupted forth. Then, a series of energy shockwaves quickly swept froth, before cracks started to emerge.\u003c/p\u003e\n\u003cp\u003eHowever, just as cracks emerged on that Yuan Power shield, those two gigantic fingers began to dim. Evidently, thanks to this stalemate, they were slowly being worn down.\u003c/p\u003e\n\u003cp\u003e“Ka chak!”\u003c/p\u003e\n\u003cp\u003eAs more and more cracks appeared, eventually, that Yuan Power shield exploded with a loud thud. Then, a terrifyingly shock wind brushed across Teng Sha’s body, causing his hair to be blown in tatters.\u003c/p\u003e\n\u003cp\u003eAfter destroying that Yuan Power shield, the two gigantic fingers completely disappeared moments before they were about to reach Teng Sha’s head...\u003c/p\u003e\n\u003cp\u003eWhen those gigantic fingers disappeared, that peculiar natural phenomenon instantly dissipated. However, shock was still filled in the eyes of countless individuals. Obviously, they never expected that not only could Lin Dong block an advanced Manifestation practitioner’s attack, he could even counter attack!\u003c/p\u003e\n\u003cp\u003e“Manifestation Martial Arts is indeed powerful. However, can you use it again?” Silence sunk in on this domain, before a dishevelled Teng Sha slowly lifted his head. His eyes stared venomously at Lin Dong just like poisonous snakes, while he slowly spoke.\u003c/p\u003e\n\u003cp\u003e“If you can’t… Then this sect leader shall claim your life!”\u003c/p\u003e\n\u003cp\u003eTeng Sha slowly lifted his palm, before he pointed it at Lin Dong. Then, terrifying Yuan Power quickly gathered once again on his palm.\u003c/p\u003e\n\u003cp\u003eHe had never expected that even after borrowing Little Marten’s strength and executing the second stage of Great Desolate Imprisoning Heavenly Finger, he was still unable to completely defeat Teng Sha...\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes was grim as he stared at Teng Sha. That attack was already his most powerful counter attack. However, it failed to achieve his intended outcome. Regardless, the difference in strength between him and Teng Sha was simply too large.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, what do we do?” Little Marten’s solemn voice suddenly echoed out inside Lin Dong’s heart.\u003c/p\u003e\n\u003cp\u003eAfter he sucked in a deep breath, Lin Dong suddenly turned around and saw at that bottomless Mysterious Black Yin Crevice. After a brief struggle, a vicious glint finally flashed across his eyes.\u003c/p\u003e\n\u003cp\u003e“Go, let\u0027s go into that Mysterious Black Yin Crevice!”\u003c/p\u003e\n\u003cp\u003eLin Dong waved his palm, before he directly steered around Little Flame’s body. As it flutted its bloody wings, under countless bewildered stares, it dashed into that death-trap Mysterious Black Yin Crevice!\u003c/p\u003e\n\u003cp\u003e“Haha, Teng Sha, if you have enough guts, chase after this young master!”\u003c/p\u003e\n\u003cp\u003eWhen they heard Lin Dong’s hearty laughter, everyone’s eyes shrunk while the same thought flashed across their hearts, that fellow is insane...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-317\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-319\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-318","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
