{"id":60092,"no":336,"title":"Chapter 336 Blood Soul Puppet","content":"\u003cp\u003e\u003cstrong\u003eChapter 336 Blood Soul Puppet\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe top of the Mysterious Black Yin mountain was a mess. Although there were the Great Devil Sect, Martial Alliance and other factions to uphold order, below was Ghastly Puppet City and news of the changes above naturally swiftly spread down, immediately causing riots in the city. Some of the more vicious characters directly started to rob the Ghastly Puppet Cult’s various stores. Since the Ghastly Puppet Cult was completely finished, if they did not act now, when else would they act?\u003c/p\u003e\n\u003cp\u003eMu Lei and the rest did not have any solutions to this chaos. After all, there were too many people in the city, and the troops they brought along was not very numerous. Hence, they did not have any way to maintain order, and thus could only close an eye to the situation.\u003c/p\u003e\n\u003cp\u003eIn any case, it was already completely over for the Ghastly Puppet Cult, what they needed to think about was how to split the Ghastly Puppet Cult’s territory.\u003c/p\u003e\n\u003cp\u003e...\u003c/p\u003e\n\u003cp\u003eWhile the entire mountain was in upheaval, Lin Dong entered deep into the Mysterious Black Yin mountain alone. Beside him, Little Flame closely followed. Previously, Lin Dong had given this fellow over ten thousand Pure Yuan pills, the vigorous energy allowing Little Flame’s wounds to swiftly recover by quite a lot.\u003c/p\u003e\n\u003cp\u003e“There seems to be something strange in this Mysterious Black Yin mountain.” Little Marten appeared on Lin Dong’s shoulder. The deeper they penetrated, the more it seemed to sense something.\u003c/p\u003e\n\u003cp\u003e“Yea, there is indeed a special area within this Mysterious Black Yin mountain in Teng Sha’s memories.” Lin Dong smiled a little while quickly following the secret path into the mountain. This used to be an important place to the Ghastly Puppet Cult, and even some elders were not allowed to enter. Yet, now that Teng Sha had died, the guards here naturally dispersed, thus nothing hindered Lin Dong as he entered the cave like tunnel.\u003c/p\u003e\n\u003cp\u003eA man and two beasts walked in the somewhat dark tunnel, while waves of gloomy and cold qi continuously gushed out from the cave. However, this kind of cold qi clearly was of no threat towards the Lin Dong and Little Flame who had spent a long time in the Mysterious Black Yin crevice. Hence, they did not stop as they followed the tunnel and continued to penetrate deeper into the enormous mountain.\u003c/p\u003e\n\u003cp\u003eThis silent journey lasted for several tens of minutes. The Mysterious Black Yin mountain was extremely extensive, and according to their estimation, Lin Dong and gang should be gradually reaching the center of the Mysterious Black Yin mountain.\u003c/p\u003e\n\u003cp\u003e“We’re here…”\u003c/p\u003e\n\u003cp\u003eSome light suddenly appeared in the passage ahead of them as Lin Dong’s feet stopped and the Yuan Power in his body swiftly started to churn. He had a cautious nature and would naturally not be careless in this kind of place.\u003c/p\u003e\n\u003cp\u003e“Roar!”\u003c/p\u003e\n\u003cp\u003eLittle Flame also released a low roar as scarlet light flickered on its body. The scarlet python on its back also lifted its body as a formidable cold qi gathered at its mouth.\u003c/p\u003e\n\u003cp\u003eAfter finishing all their preparations, Lin Dong once again lifted his foot. Soon after, the space before his eyes suddenly widened, the narrow tunnel disappearing as an incomparably humongous stone cave took its place.\u003c/p\u003e\n\u003cp\u003eThe surface area of this stone cave was extremely tremendous, and measured at least a thousand meters. Compared to the plaza on the mountaintop, it was several times more spacious. Countless night light pearls were embedded in the walls of the stone cave as a gentle light enveloped the place.\u003c/p\u003e\n\u003cp\u003eLin Dong’s gaze swept across the stone cave before pausing at the center where an enormous pitch-black cave lay. Jets of astonishing Yin qi shot out from within like a fountain. These cold qi rose up in the air before finally escaping through some of the holes above.\u003c/p\u003e\n\u003cp\u003e“So it turns out that the Ghastly Puppet Cult’s natural cold qi protective screen is formed from the cold qi here.” Upon seeing this scene, astonishment instantly flashed across Lin Dong’s eyes.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, there seems to be something inside the black hole…” Little Marten looked towards the pitch-black cave that seemed to connect to the underground and said.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded his head. The top of his foot pushed off the ground and he landed on the edge of the humongous black hole, his pupils instantly tightening as he cast a glance inside.\u003c/p\u003e\n\u003cp\u003eDarkness filled the humongous cave, but this kind of darkness was of no use towards Lin Dong. Thus, the scene within was clearly taken in by his eyes.\u003c/p\u003e\n\u003cp\u003eThe first things that entered his eyes were giant chains that were even larger than a human’s body. These chains were attached to the surrounding cave walls and there were rows of strange symbols on them. Due to the existence of these symbols, the chains immediately became somewhat peculiar as thin rays of light shuttled back and forth on the chains, as if they possessed some form of intelligence.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes paused on these giant chains for several seconds before he suddenly turned towards the place where all the chains interweaved, only to find a completely red figure seated in the darkness. The figure’s four limbs and neck were firmly bounded by the chains, and every time the lights on the chains flowed to the blood colored figure’s body, the latter’s body would slightly tremble...\u003c/p\u003e\n\u003cp\u003e“This is…”\u003c/p\u003e\n\u003cp\u003eLin Dong stared in shock at the blood colored figure which had been bounded tightly by the giant symbol chains. It was hard to imagine that there was actually such a strange sight within the Mysterious Black Yin mountain.\u003c/p\u003e\n\u003cp\u003eAlthough he had obtained some of Teng Sha’s memories, that fellow seemed to especially fearful of this scene, resulting in Lin Dong being unable to acquire these memories.\u003c/p\u003e\n\u003cp\u003eThe figure’s body appeared blood red in color, as if it had been dyed in endless fresh blood. Although it did not move, a ruthless and fiendish sky shattering aura faintly spread out.\u003c/p\u003e\n\u003cp\u003e“Such terrifying power!”\u003c/p\u003e\n\u003cp\u003eAs he felt the terrifying fiendish aura that circled around the figure, Lin Dong’s expression abruptly changed. Who exactly was this blood figure? Why was it trapped here? Could this have been done by the Ghastly Puppet Cult?\u003c/p\u003e\n\u003cp\u003e“That’s not a person, it\u0027s a Symbol Puppet!” However, just as Lin Dong’s gaze flickered, Little Marten suddenly exclaimed.\u003c/p\u003e\n\u003cp\u003e“Symbol Puppet?” Upon hearing these words, Lin Dong instantly shivered. What kind of Symbol Puppet could be so terrifying? Compared to this blood figure, even his high class Symbol Puppet would be akin to ordinary goods.\u003c/p\u003e\n\u003cp\u003e“This is a Soul Puppet.” In Little Marten’s eyes was a hint of shock. Evidently, it was somewhat astonished that a Soul Puppet would appear in this place.\u003c/p\u003e\n\u003cp\u003e“Soul Puppet?” Lin Dong was stunned. Soon after, his expression started to fluctuate a little. He had known that there were the even stronger Soul Puppets above the high class Symbol Puppet, but that grade of Symbol Puppet was not easily created. It was said that a true Soul Puppet possessed its own consciousness and was practically like another type of life form, and absolutely not an emotionless puppet!\u003c/p\u003e\n\u003cp\u003eAlthough Lin Dong had never personally seen a Soul Puppet before and did not know exactly how powerful it would be, he now knew that at least under the Nirvana stage, no one would be a Soul Puppet’s match...\u003c/p\u003e\n\u003cp\u003e“How can the Ghastly Puppet Cult possess a Soul Puppet? If it was truly so, couldn’t Teng Sha have just directly summoned it?” Lin Dong asked in a low voice.\u003c/p\u003e\n\u003cp\u003e“Heh, this Soul Puppet does not belong to the Ghastly Puppet Cult. How can a tiny Ghastly Puppet Cult put together such a powerful formation. This Soul Puppet should already have existed before the Ghastly Puppet Cult appeared, it was likely merely Teng Sha’s good luck to have established the sect here. Possibly, that fellow chose this spot because he knew of the Soul Puppet’s existence, and planned on finding a chance to subdue it for his use.” Little Marten let out a strange laughter as it explained.\u003c/p\u003e\n\u003cp\u003e“Oh?” Lin Dong was a little taken aback as he lowered his head and took a closer look at the dark hole. Only then did he discover that not only were there symbols on the chains, even the walls were covered in rows of symbols. These symbols should have existed for a rather long time because some of them had already become much dimmer.\u003c/p\u003e\n\u003cp\u003eAlthough the symbols were dim, Lin Dong could still sense the great power contained within them. Given the Ghastly Puppet Cult’s strength, they were indeed unable to set up this kind of sealing formation. Looks like it was truly as Little Marten had said, this mysterious Soul Puppet had existed even before the Ghastly Puppet Cult.\u003c/p\u003e\n\u003cp\u003e“Why did those people want to seal this Soul Puppet? It would be a great aid after all…”\u003c/p\u003e\n\u003cp\u003eLittle Marten stared at the blood figure seated in the darkness and was silent for a while before suddenly answering: “Because it is a Blood Soul Puppet.”\u003c/p\u003e\n\u003cp\u003e“Blood Soul Puppet?” Lin Dong was taken aback.\u003c/p\u003e\n\u003cp\u003e“There are many ways to create a Symbol Puppet. One of the most cruel ways is to directly refine a live person. This method is vicious but the Symbol Puppets created this way are mostly filled with overflowing anger and will very likely devour its master, this is a Blood Soul Puppet. Look at the blood color on this Soul Puppet, it should be composed from concentrated blood. Tch tch, how many people could this Soul Puppet have killed to become like this?” Little Marten clicked its tongue and said.\u003c/p\u003e\n\u003cp\u003e“If let loose, this thing will go on a killing rampage. It’s practically a disaster, hence, being sealed here is logical.”\u003c/p\u003e\n\u003cp\u003e‘So dangerous...”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes turned serious. If that was true, this Blood Soul Puppet was indeed too dangerous. If it was really let loose, the Great Desolate Province will be in a terrible situation.\u003c/p\u003e\n\u003cp\u003eLin Dong did not doubt that this Blood Soul Puppet’s strength was enough to sweep the entire Great Desolate Province.\u003c/p\u003e\n\u003cp\u003e“No wonder Teng Sha did not dare to do anything. He must be afraid that if this thing was let loose, he would be the first to be killed…”\u003c/p\u003e\n\u003cp\u003eLin Dong softly sighed and felt a somewhat regretful. If he could subdue this terrifying thing, it would truly be akin to having a protective amulet for himself. At that time, even if wanted to take on existences on the level of four great clans by himself, he would not have much to fear.\u003c/p\u003e\n\u003cp\u003e“Let’s go, we need to destroy the passageway, or else, it will be troublesome if other people enter.” Lin Dong shook his head, intending to turn and leave.\u003c/p\u003e\n\u003cp\u003e“Wait.”\u003c/p\u003e\n\u003cp\u003eHowever, Little Marten waved its claws. When it saw the puzzled gaze Lin Dong shot at it, it let out a strange laugh and said: “Isn’t it a pity to let go of this super fighter that was practically sent to our doorstep.”\u003c/p\u003e\n\u003cp\u003e“You have a way to subdue this Blood Soul Puppet?” Upon hearing Little Marten’s words, delight suddenly gushed up in Lin Dong’s eyes.\u003c/p\u003e\n\u003cp\u003e“I do not, but, it has.”\u003c/p\u003e\n\u003cp\u003eLittle Marten’s claws suddenly pointed towards Lin Dong’s palm, or one might say the mysterious stone talisman embedded within...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-335\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-337\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-336","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
