{"id":60123,"no":367,"title":"Chapter 367: Initial Manifestation Stage","content":"\u003cp\u003e\u003cstrong\u003eChapter 367: Initial Manifestation Stage\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThat black “Heavy Prison Peak” sat quietly on Lin Dong’s palm. From time to time, a black glow flowed across its surface while it gave off an exceedingly solid sensation.\u003c/p\u003e\n\u003cp\u003e“Let’s test how powerful this object is.” Little Marten somewhat curiously stared at the “Heavy Prison Peak” on Lin Dong’s palm, before it eagerly asked.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eLin Dong also nodded his head. Then, with a flick of his mind, a mixed-color “Essence Yuan Power” appeared before it gushed into that “Heavy Prison Peak”. This Soul Treasure was extremely peculiar and one could not activate it with Yuan Power or Mental Energy. Instead, one had to use “Essence Yuan Power” to activate it. Thankfully, Lin Dong possessed the “Spirit Accumulation Praying Mat”. Else, he would not be able to do anything with this “Heavy Prison Peak”.\u003c/p\u003e\n\u003cp\u003e“Buzz!”\u003c/p\u003e\n\u003cp\u003eWhen his “Essence Yuan Power” gushed into that Heavy Prison Peak, the latter suddenly shook, before it directly transformed into a black light beam. Promptly, it shook in mid-air, before it suddenly expanded. Then, Lin Dong was pleasantly surprised when he saw it transform into a near thousand feet hill in mere seconds!\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThat Heavy Prison Peak swirled as it slowly grew. Then, it suddenly descended before it slammed against that large stone arena with a loud thud.\u003c/p\u003e\n\u003cp\u003eThis stone arena was evidently protected by a formation. Furthermore, thanks to its unique physical properties, even Lin Dong could not destroy it with a punch alone. However, right now, under the shadow of the Heavy Prison Peak, it seemed just like an ant. When its shadow descended, the entire clan trove shook violently just like an earthquake had occurred. Then, that large stone arena was instantly ruptured into dust.\u003c/p\u003e\n\u003cp\u003e“What a heavy mountain peak!”\u003c/p\u003e\n\u003cp\u003eWhen Lin Dong saw that the stone arena had been ruptured into dust and that Heavy Prison Peak had even sunk several dozen feet into the ground, awe gushed into his eyes. Though that Heavy Prison Peak did not possess much unique abilities, it was made up of a magical material. Therefore, all of its unique properties can be summed up into one word.\u003c/p\u003e\n\u003cp\u003eHeavy!\u003c/p\u003e\n\u003cp\u003eThis Heavy Prison Peak was just like a heavy mystical object that could even suppress the world. In fact, even the entire earth could not withstand its terrifying weight.\u003c/p\u003e\n\u003cp\u003e“Hehe, if you tossed this object, it is enough to squash even an initial Manifestation practitioner!” A tinge of shock flashed across Little Marten’s eyes as it said.\u003c/p\u003e\n\u003cp\u003eLin Dong was all smiles as he nodded his head. This “Heavy Prison Peak” pleased him immensely. In fact, the other four Soul Treasures seem to have lost their luster.\u003c/p\u003e\n\u003cp\u003e“You are one lucky fellow. I believe that many people should have guessed that this “Heavy Prison Peak” was no ordinary object. However, since they did not possess Essence Yuan Power, even if they knew, they could not activate it.” Little Marten said. It was as if this Heavy Prison Peak was specially tailored for Lin Dong. In fact, Lin Dong was truly fortunate to have obtained the “Spirit Accumulation Praying Mat”. Therefore, he was able to create “Essence Yuan Power” and successfully control it.\u003c/p\u003e\n\u003cp\u003eLin Dong smiled. The Lin Clan were filled with wise individuals. Even Lin Langtian must have stopped by the clan trove several times. Furthermore, with his ability, he must have known that this Heavy Prison Peak was an extraordinary Soul Treasure. Nonetheless, regardless of what tricks that fellow used, without Essence Yuan Power, it was all for naught.\u003c/p\u003e\n\u003cp\u003eAs he recalled this point, Lin Dong smiled at his misfortune while he shook his head. Then, he waved his palm, before that Heavy Prison Peak once again shrunk. Finally, it transformed into a black light before it flew into Lin Dong’s mouth. Earthly Soul Treasures are filled with spiritual energy and they were able to directly incubate in one’s body. Thanks to this incubation, the chemistry between man and Soul Treasure would grow, until eventually, one would be able to activate it easily.\u003c/p\u003e\n\u003cp\u003e“Now that I have gotten the Soul Treasure, I plan to take advantage of the potent Yuan Power inside the clan trove to officially breakthrough to initial Manifestation stage!” As he stared at the Yuan Power mist that permeated the clan trove, Lin Dong lifted his head as he spoke with a smile.\u003c/p\u003e\n\u003cp\u003eThe Yuan Power inside was extremely potent. If he trained in here, he would definitely be able to accelerate his training. Therefore, if he gave up on this opportunity, it would simply be too much of a waste.\u003c/p\u003e\n\u003cp\u003e“Yes, let me set up a defensive formation. I believe that those old guys would not dare to barge in lightly.” Little Marten nodded his head. Now that Lin Langtian had broken through to advance Manifestation stage, it was time for Lin Dong to upgrade himself.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded his head. Without further ado, his figure flashed before he leapt into mid-air and sat down. While his hands gently twirled, a black hole swiftly extended from behind him.\u003c/p\u003e\n\u003cp\u003e“Wu Wu!”\u003c/p\u003e\n\u003cp\u003eWhen that black hole appeared, an exceedingly formidable Devouring Power immediately swept forth. Instantly, all the Yuan Power mist that permeated the clan trove quickly gathered around, before they were devoured by the black hole and flowed into Lin Dong’s body continuously.\u003c/p\u003e\n\u003cp\u003e“Hua la la!”\u003c/p\u003e\n\u003cp\u003eThe Yuan Power within the clan trove was extremely potent. Therefore, when they were being absorbed by the black hole, a crisp water-flowing sound actually faintly echoed out!\u003c/p\u003e\n\u003cp\u003eAs the Yuan Power gushed in, Lin Dong could clearly feel potent streams of Yuan Power quickly coursing through his body and extending across his limbs, before they finally gushed into his Dan Tian and Yuan Dan.\u003c/p\u003e\n\u003cp\u003eRight now, inside his Dan Tian, streams of potent Yuan Power gushed in just like tidal waves. A palm-size golden Yuan Dan slowly swirled as it completely absorbed all of these Yuan Power.\u003c/p\u003e\n\u003cp\u003eBeside his Yuan Dan, another black small hill was slowly swirling. It was the “Heavy Prison Peak” that Lin Dong had just obtained. Right now, this small hill was also releasing black glows as it attracted the potent Yuan Power, which then wrapped themselves around the hill.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eThose Yuan Power continuously brushed across the “Heavy Prison Peak” just like tidal waves. As it was slowly being cleansed, the color of Heavy Prison Peak turned increasingly dark and solid...\u003c/p\u003e\n\u003cp\u003eThanks to his Devouring Power, Lin Dong’s training was able to progress at a domineering rate. All the Yuan Power inside this clan trove was forcefully devoured by him alone and not one bit was left for anyone else!\u003c/p\u003e\n\u003cp\u003eInside the clan trove, Little Marten stared at the dissipating Yuan Power mist while awe filled his eyes. Devouring Ancestral Symbol was indeed extremely domineering. Without its Devouring Power, it would be impossible for him to absorb Yuan Power so quickly!\u003c/p\u003e\n\u003cp\u003eEven though the Devouring Ancestral Symbol did not give Lin Dong extraordinary powers straight away, it carved a shortcut for him on his route to becoming stronger!\u003c/p\u003e\n\u003cp\u003e“At this rate, it will not be long before he can officially advance to initial Manifestation stage…” As Little Marten sensed Lin Dong’s growing aura, it muttered to itself. Lin Dong was originally at the peak of half-step-to Manifestation. With a little progress, he would be able to make a breakthrough. Right now, with help from the potent Yuan Power within the clan trove, it was no difficult task for him to take the final step.\u003c/p\u003e\n\u003cp\u003e“Heh, the Lin Clan clan trove is filled with such potent Yuan Power. However, in the end, it was all swallowed by the glutton Lin Dong!” Little Marten chuckled, before it hopped onto the stone arena and silently awaited for Lin Dong to complete his training.\u003c/p\u003e\n\u003cp\u003eAs it waited on, half a month’s time passed. In this half a month’s time, nearly all the potent Yuan Power in the clan trove was completely consumed until there was hardly a trace of Yuan Power mist left in the clan trove. In fact, even the glow of the various treasures started to dim.\u003c/p\u003e\n\u003cp\u003eLin Dong’s Devouring Power was too domineering. As it devoured, it not only devoured Yuan Power, but it even damaged the spiritual energy of those Soul Treasures. Thankfully, Lin Dong did not target them, else, after his training, most of the Soul Treasures here would turn into scrap metal...\u003c/p\u003e\n\u003cp\u003eAfter devouring so much Yuan Power, it undoubtedly provided a huge boost to Lin Dong. Meanwhile, light beams formed from potent Yuan Power slowly squirmed around his body. At the same time, an exceedingly formidable aura faintly extended from within his body.\u003c/p\u003e\n\u003cp\u003eSeated on the stone arena in front of Lin Dong, Little Marten suddenly stood up. When it sensed Lin Dong’s aura, it gradually nodded it\u0027s head before it muttered to itself: “Based on his aura, it’s about time for him to wake up.”\u003c/p\u003e\n\u003cp\u003eAs if he was replying to Little Marten, after it spoke, the figure seated in mid-air suddenly shook. Then, an exceedingly formidable aura swept forth from his body just like a hurricane!\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThe surrounding stone arena was directly blown apart by that aura. In fact, even some Soul Treasures were forcefully blown apart.\u003c/p\u003e\n\u003cp\u003e“Buzz!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s tightly shut eyes violently opened up. A golden glow flowed inside his pupils, before they finally shot out, just like they were real. Half a moment later, it finally weakened till it completely dissipated.\u003c/p\u003e\n\u003cp\u003eWhen the golden glow in Lin Dong’s eyes dissipated, that powerful aura slowly calmed down. Then, Lin Dong’s figure slowly descended from mid-air. As he glanced at the suddenly emptier clan trove, he involuntarily smiled. Thanks to the potent Yuan Power inside, he had finally made the final step. Right now, he had successfully advanced to Manifestation stage!\u003c/p\u003e\n\u003cp\u003e“Let’s go, it’s time to take revenge on that old bastard Lin Zhi…”\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes swept across his surroundings, before he waved at Little Marten. Then, without any hesitation, he turned and walked out of the clan trove. As he walked out, an icy-cold killing intent faintly emerged from his body.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-366\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-368\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-367","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
