{"id":59797,"no":41,"title":"Chapter 41: Luo Cheng","content":"\u003cp\u003eWDQK Chapter 41: Luo Cheng\u003c/p\u003e\n\u003cp\u003eAround the monster arena were tens of thousands of stone seats. Today, none of these seats were empty, as the whole place was choked full of people. The mass of black heads bobbing up and down, extended all the way down one’s line of sight. This massive crowd was indeed worthy of the biggest event in Qingyang Town.\u003c/p\u003e\n\u003cp\u003eThe Lin Family followed Lin Zhentian to enter the central area of the monster arena. This area had the best view, as not only could you look down upon the dense forests, you could also clearly see anything that happened atop the giant stage.\u003c/p\u003e\n\u003cp\u003eHowever, only the factions that held substantial power were allowed into this area. Since the Lin Family had maintained good relations with these other factions, as they entered, quite a few people came forward to exchange greetings with them, while Lin Zhentian replied them all in kind with a cheery smile on his face.\u003c/p\u003e\n\u003cp\u003eAfter exchanging pleasantries, Lin Zhentian brought his group to sit in one area. Nearby, were the Xie and Lei Families. Yet, they only glanced once at the Lin Family before turning away. No matter how calm they appeared on the outside, in their hearts, they still held some contempt for the “foreign” Lin Family.\u003c/p\u003e\n\u003cp\u003eOf course, since he was being slighted by them, Lin Zhentian obviously chose to ignore them as well. Over the years, they had fought both openly and covertly, and if he had not employed various tactics and strategies, the Lin Family would have long been chased out of Qingyang Town like dogs. Thus, even though both Lei and Xie Families disliked the Lin Family, the hatred in Lin Zhentian’s heart far exceeded the realms of mere hostility.\u003c/p\u003e\n\u003cp\u003eAfter the Lin Family group seated themselves, many other influential people continued to appear one after another, causing the atmosphere to become even more lively.\u003c/p\u003e\n\u003cp\u003eLin Dong was seated on a stone chair at one corner. As he looked downwards at the dense forests, he could faintly hearing the roars of wild beasts from time to time.\u003c/p\u003e\n\u003cp\u003eHowever, Lin Dong was not worried about the wild beasts within the forest. With his current strength, as long as he did not encounter a Demonic Beast, he knew that any ordinary beasts were of little threat towards him.\u003c/p\u003e\n\u003cp\u003eDemonic Beasts were creatures that was even more terrifying than the normal ferocious beasts. In fact, even the lowest tier Demonic Beast was able to easily tear apart a Tempered Body 7th Layer and lower practitioner. Moreover, a higher tier Demonic Beast would possess both intelligence and energy wielding capabilities. An exceptionally frightening killing machine.\u003c/p\u003e\n\u003cp\u003eThankfully, Demonic Beasts were generally found hidden deep in the large mountains. Since there were so many people here, it was highly unlikely that any Demonic Beasts would appear. Therefore, the biggest worry in this “Hunt” was still the other participants. After all, in order seize another competitor’s tag, these participants would stoop to any level.\u003c/p\u003e\n\u003cp\u003eOf course, any petty tricks were insignificant in the face of true power. The current Lin Dong had earned his qualification to maintain this level of self-confidence.\u003c/p\u003e\n\u003cp\u003eAs Lin Dong was sizing up the topography of the forest, he suddenly felt the atmosphere in the monster arena change slightly. He quickly turned his head just in time to see a huge troupe of people entering his particular area. On their chests, a same picture was sewn.\u003c/p\u003e\n\u003cp\u003e“Raging Blade Dojo.”\u003c/p\u003e\n\u003cp\u003eThe faction that had expanded the swiftest in Qingyang Town. Raging Blade Dojo’s appearance undoubtedly attracted countless gazes.\u003c/p\u003e\n\u003cp\u003eLikewise, Lin Dong also swept his gaze over the group from the Raging Blade Dojo before stopping at the figure at the front. The figure turned out to be a somewhat lean man, with an expressionless face. On his face, were countless blade scars crisscrossing\u0026nbsp; giving him a menacing aura. Strapped on his waist, a long blade-shaped object was wrapped up in black cloth.\u003c/p\u003e\n\u003cp\u003e“That is the master of the Raging Blade Dojo, Mad Lightning Blade Luo Cheng. The reason why Raging Blade Dojo was able to rise rapidly, was largely due to him. If I am not mistaken, he is also a Heavenly Yuan Level expert. In fact, he has probably already reached the later stage of Heavenly Yuan Level. From there, it is only one more step to achieve the Yuan Dan Level. Hence, in the entire Qingyang Town, there are probably less than than five people who could match up to him.” Lin Xiao whispered to Lin Dong.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded in surprise, as he had never expected that Luo Cheng would actually be so powerful.\u003c/p\u003e\n\u003cp\u003e“When he first arrived at Qingyang Town and planned to establish the Raging Blade Dojo, the Lei and Xie Families both tried to interfere. Hence he directly went to challenge Lei Bao. In the end, though he ate three of Lei Bao’s palm attacks, he left a blade wound on Lei Bao’s chest. His ferocity and willingness to risk his life caused the Lei and Xie Families to burst out in goosebumps. Thus they could only withdraw.”\u003c/p\u003e\n\u003cp\u003e“Heh heh, Luo Cheng is extremely fierce and pays a lot of attention to any shortcomings. Now, even the Lei and Xie Families do not dare to be too overbearing towards the Raging Blade Dojo. After all, these fellows are all a bunch of stubborn rogues.”\u003c/p\u003e\n\u003cp\u003eLin Dong nodded his head in silence. Luo Cheng and Lin Zhentian could both be considered as founders who built up their own factions from scratch. It was just that they took different paths to reach their current positions, and\u0026nbsp; they had different temperaments. Luo Cheng was unyielding, cold and strict while Lin Zhentian was the type to conceal his true strength, while secretly developing it. However, in the end, the two were very capable men.\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong and Lin Xiao were speaking in hushed tones, the Raging Blade Dojo crowd approached them. Lin Zhentian stood up as he smiled, clasping his hands together, he respectfully greeted Luo Cheng. In response, a somewhat rigid smile appeared on Luo Cheng’s usually expressionless face. As both of their factions were despised by the Lei and Xie Families, this helped the Raging Blade Dojo and Lin Family to bond closer together, and hence they had a friendly relationship.\u003c/p\u003e\n\u003cp\u003e“Heh, as expected, you’ve joined in the Hunt this time.” As Luo Cheng and Lin Zhentian exchanged greetings, a figure emerged before Lin Dong. That figure was Wu Yun, the same man he had met at the bazaar.\u003c/p\u003e\n\u003cp\u003eLin Dong had some positive feelings towards Wu Yun, thus he a smile immediately formed on his face as his nodded.\u003c/p\u003e\n\u003cp\u003e“When the hunt starts, if possible, we should cooperate. After all, Lei Li and Xie Yingying would definitely join hands, and one against two would definitely be troublesome.” Wu Yun chuckled.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded in agreement upon hearing Wu Yun’s suggestion.\u003c/p\u003e\n\u003cp\u003e“Is this Lin Dong, the person who you mentioned could successfully receive a blow from Lei Li?” To one side, Luo Cheng, who was conversing with Lin Zhentian, suddenly turned his head to look at Lin Dong and inquire.\u003c/p\u003e\n\u003cp\u003e“Lin Dong greets the Master of the Raging Blade Dojo.” Lin Dong humbly scratched head before he respectfully greeted.\u003c/p\u003e\n\u003cp\u003eLuo Cheng’s sharp gaze carefully swept across Lin Dong’s body before he nodded and remarked: “This is a good seedling, the Lin Family is fortunate.”\u003c/p\u003e\n\u003cp\u003eUpon hearing these words, Lin Zhentian stroked his beard as a bright smile surfaced. After all, he knew that Luo Cheng was picky and had rather high standards. Thus, he would not give such positive evaluations lightly.\u003c/p\u003e\n\u003cp\u003eLuo Cheng was clearly a man of few words. After a short chat, he said goodbye and led the Raging Blade Dojo members to another area to take up their seats.\u003c/p\u003e\n\u003cp\u003eFrom start to end, he did not even look at the Lei and Xie Families at all, nor did he have show any intention to greet them. This was something that even Lin Zhentian could only do occasionally, yet Luo Cheng had no qualms in doing it.\u003c/p\u003e\n\u003cp\u003eWith the arrival of the Raging Blade Dojo, the four major factions in Qingyang Town were now all present. Thus, as the sun gradually rose to its zenith, Lei Bao also stood up, as he swept his sunken eyes across the entire place. Under his chilly gaze, the racket in the monster arena slightly toned down, a testament to the influence that the Lei Family held.\u003c/p\u003e\n\u003cp\u003e“Everyone, today is the busiest day in Qingyang Town. Simply put, for the rules of the hunt, as long as one obtains ten tags, he would obtain the right to enter this giant stage. At there, the true champion of the hunt will be born.”\u003c/p\u003e\n\u003cp\u003eAmplified by Yuan Power, Lei Bao’s voice reverberated around the entire monster arena, causing every single person to be able to hear each and every word clearly.\u003c/p\u003e\n\u003cp\u003e“The tags have already been collected by the various families. Next, distribute these tags to the younger generation participants from your respective families. Finally, all participants shall enter the monster arena and the hunt will begin!”\u003c/p\u003e\n\u003cp\u003e“Dong-er, take this tag and be extra careful.” Lin Xiao glanced at Lin Zhentian, awaiting his signal. Only when the latter nodded, did Lin Xiao retrieve a black and yellow wooden tile from his clothes. On the wooden tile, was the word ‘Lin’ and some other complicated diagrams.\u003c/p\u003e\n\u003cp\u003eUnder the envious gazes of some Lin Family members, Lin Dong solemnly received the tag. The fact that Lin Zhentian handed the tag over to Lin Xiao first, showed that the former had already decided to allow Lin Dong to participate in the hunt and fight for the Lin Family.\u003c/p\u003e\n\u003cp\u003eStuffing the wooden tile securely into his clothes, Lin Dong silently nodded. Without further ado, he looked at the other figures, which were leaping down into the forests from the monster arena. Taking a deep breath, he took two steps forward and positioned himself at the edge of the high platform.\u003c/p\u003e\n\u003cp\u003eAs Lin Dong prepared to leave, nearby, Lei Li and Xie Yingying also strolled forward. As he smiled, Lei Li stared at Lin Dong before he suddenly stuck out a thumb and lightly jabbed it downwards at the latter. Meanwhile, his lips were mouthing out some words.\u003c/p\u003e\n\u003cp\u003eAlthough no voice could be heard, Lin Dong recognized the words that were mouthed. Lei Li had said: “Time to repay your debts.”\u003c/p\u003e\n\u003cp\u003eLooking back at Lei Li, Lin Dong likewise smiled, as his lips also mouthed out some words before he turned to jump off the high platform and descend into the monster arena.\u003c/p\u003e\n\u003cp\u003eGazing at Lin Dong’s back, Lei Li’s eye’s slanted his eyes. With a light chuckle, a chilly light flitted across his eyes. He had also understood Lin Dong’s unspoken words.\u003c/p\u003e\n\u003cp\u003eLin Dong had said: “I’ll be waiting for you.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-40\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-42\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-41","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
