{"id":60166,"no":410,"title":"Chapter 410: A Complete Massacre","content":"\u003cp\u003e\u003cstrong\u003eChapter 410: A Complete Massacre\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAll the Yuan Power in this domain raged, while streams of potent Yuan Power continuously gathered above Lin Dong’s head. Thanks to that terrifying shockwave, even the heavens began to tremble.\u003c/p\u003e\n\u003cp\u003eSuch a formidable attack caused everyone to be in awe. It was very hard for them to imagine how Lin Dong could use his advanced Manifestation stage ability to execute such a terrifying attack!\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eLin Dong jutted out his finger, while fresh blood continuously dripped off his finger tip. Based on this sight, it seems like even Lin Dong’s powerful physical body could not withstand the might of this finger!\u003c/p\u003e\n\u003cp\u003eAs fresh blood dripped down, the space above Lin Dong’s head was suddenly ripped apart. Immediately, a large finger slowly broke through the air.\u003c/p\u003e\n\u003cp\u003eWhen that large finger appeared, an ancient and vicissitude aura immediately permeated the entire domain.\u003c/p\u003e\n\u003cp\u003eCountless pairs of eyes stared in bewilderment at that giant finger that was breaking through the air. Compared to the previous four fingers, this one seemed even more refined. In fact, there were no traces of savage Yuan Power ripples undulated on its surface.\u003c/p\u003e\n\u003cp\u003eThis large finger gave off a lifelike appearance.The sensation was as if it was not formed from Yuan Power, but rather a genuine finger that came from the past!\u003c/p\u003e\n\u003cp\u003eThat giant finger was approximately several hundred meters wide and it was considered massive to most ordinary people. However, for no particular reason, when this giant finger appeared, everyone felt something missing in their hearts.\u003c/p\u003e\n\u003cp\u003eAfter they furrowed their brows and contemplated for a moment, they finally realized that this large finger was not complete. In fact, accurately speaking, it was only half a finger!\u003c/p\u003e\n\u003cp\u003eIt was in fact half a finger that came from the past!\u003c/p\u003e\n\u003cp\u003eRight now, even though it was only half a finger, when it appeared, the entire heavens seemed to tremble. It seems like its aura instantly exceeds the Sacred Light Large Formation set up by Li Sheng and the rest.\u003c/p\u003e\n\u003cp\u003e“I bear no grudges against you. If you do not offend me, I shall not offend you. However, if anyone offends me, I will make you pay a hundred times in return!”\u003c/p\u003e\n\u003cp\u003eLin Dong stared coldly at Li Sheng and the rest, whose facial expression had also changed. Then, his icy-cold roar ricocheted across the entire domain just like thunder.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eJust as Lin Dong spoke his final word, he viciously swung his finger down. Instantly, the skin on his fingertips tore apart, while fresh blood spurted forth. However, at the same time, that half-finger that came from an ancient land suddenly descended!\u003c/p\u003e\n\u003cp\u003eBang! Bang! Bang!\u003c/p\u003e\n\u003cp\u003eWhen this half-finger descended, the ground below seemed to crumble instantaneously. Several large cracks quickly extended out. Its aura was extremely terrifying.\u003c/p\u003e\n\u003cp\u003eMeanwhile, that large half-finger directly flew towards that powerful Sacred Light Glowing Pillar. This Sacred Light attack was filled with Li Sheng and the seven other’s full strength and there was hardly anyone below Nirvana stage that could counter against it. However, just because there was hardly anyone doesn’t mean that there is no one...\u003c/p\u003e\n\u003cp\u003eEveryone near the citywall watched tensely, while they sucked in a breath of deep air. Eventually, two extremely destructive attacks finally slammed together, just like two meteors.\u003c/p\u003e\n\u003cp\u003e“Dong!”\u003c/p\u003e\n\u003cp\u003eThe instant that collided, the entire universe seemed to have started trembling, while an extremely resplendent glow erupted forth and directly lit up the entire area within a hundred mile radius!\u003c/p\u003e\n\u003cp\u003eEveryone was enduring the blinding light shining in their eyes, as they stared at point of impact. However, the stalemate that they expected did not materialize. Instead, all they saw was a near unstoppable destructive force!\u003c/p\u003e\n\u003cp\u003eIn front of that god-like finger that came from an ancient land, even Li Sheng and the rest’s combined attack could not threaten that life-like half finger at all.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eThat clash lasted for mere seconds, before that powerful Sacred Light Glowing Column began to crumble as the crowd stared in awe.\u003c/p\u003e\n\u003cp\u003eWhen they saw those cracks emerging, terror finally gushed into Li Sheng and the rests’ faces. They had never expected that even after combining seven advanced Manifestation practitioner’s strength and having a peak Manifestation practitioner launch the attack, it was actually swiftly destroyed by Lin Dong.\u003c/p\u003e\n\u003cp\u003eRight now, Li Sheng finally understood that this peasant that he callously claimed to be from a tiny empire, was actually this terrifying powerful!\u003c/p\u003e\n\u003cp\u003eHowever, right now, it was already too late...\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThat gigantic Sacred Light Glowing Pillar was unable to withstand the terrifying shockwave contained within that half-finger, as it directly blew apart in front of the crowd’s eyes.\u003c/p\u003e\n\u003cp\u003eA a terrifying energy shock wave swept forth, a storm raged in this domain. Dust and rubbles flew everywhere and even that sturdy citywall was shaken by this impact. Everyone standing on top of the citywall quickly activated their Yuan Power as they tried to stabilize their body.\u003c/p\u003e\n\u003cp\u003e“Buzz Chh!”\u003c/p\u003e\n\u003cp\u003eThat energy hurricane swept forth, while Li Sheng and the rest, who were right in front, instantly turned pale, before they vomited out mouthfuls of fresh blood. Their aura seemed to have dropped to its lowest point.\u003c/p\u003e\n\u003cp\u003e“Don’t do it. We are members of the Sacred Light Empire. If you kill us, it will lead to severe problems in the future!”\u003c/p\u003e\n\u003cp\u003e“Our Big Senior is in Yang City and he is far more powerful than Senior Li. He is an enemy that you cannot defeat!”\u003c/p\u003e\n\u003cp\u003eAt this juncture, all the overbearing elite Sacred Light Empire practitioner were finally crying out in fear under the threat of death.\u003c/p\u003e\n\u003cp\u003e“It’s too late to say those words now!”\u003c/p\u003e\n\u003cp\u003eLin Dong was hardly moved by their words. After all, he could barely form this fifth finger and he was not certain if he could call it back. Furthermore, even if he could do so, he would not bother. All these trainings over the years made him understood that if he spared those fellows, they could continuously cause trouble for him in the future.\u003c/p\u003e\n\u003cp\u003eIf he wanted to completely solve this problem, he must be cruel and vicious. A kind-hearted man would not survive in this ancient battlefield!\u003c/p\u003e\n\u003cp\u003e“If you want to blame someone, blame the fact that you followed a useless Senior!”\u003c/p\u003e\n\u003cp\u003eAs that giant finger filled with destructive force solemnly descended, the entire ground seemed to crumble. When they saw that Lin Dong had no intention of sparing them, Li Sheng and the rests’ expressions drastically changed. Promptly, they quickly activated the remaining Yuan Power in their body and formed a glowing shield.\u003c/p\u003e\n\u003cp\u003e“Stopping a car with a bug’s hand!” When he saw this situation, Lin Dong chuckled. After that giant finger descended, that glowing shield seemed to have no impact at all as it completely disintegrated. Meanwhile, the terrifying force contained in that giant finger finally descended upon Li Sheng and the rest.\u003c/p\u003e\n\u003cp\u003eBang! Bang! Bang!\u003c/p\u003e\n\u003cp\u003eThanks to that terrifying force, two advanced Manifestation practitioners were instantly ruptured into a bloody mist!\u003c/p\u003e\n\u003cp\u003e“Lin Dong, you will definitely regret this. How dare you kill members from the Sacred Light Empire. In the future, your outcome will be worse than a dog!” Fresh blood seeped out from Li Sheng’s pores as he venomously growled.\u003c/p\u003e\n\u003cp\u003e“Big Senior will not let you go. You can’t escape and your outcome will be several hundred times worse than ours!”\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eJust as Li Sheng’s venomous growl descended, his entire body was unable to withstand that terrifying force as it blew up with a loud bang.\u003c/p\u003e\n\u003cp\u003eThe entire earth seemed to have turned silent instantly. Everyone stared at the elite Sacred Light Empire practitioners who had all been blown up into a bloody mist, before they started to tremble uncontrollably. With one finger alone, a peak Manifestation practitioner as well as seven advanced Manifestation practitioner were blown up till their corpses did not remain...\u003c/p\u003e\n\u003cp\u003eTheir expressions were filled with respect and fear as they stared at that figure hovering in mid-air. His actions let everyone to understand that the man in front of them was no kind-hearted Buddha. If you offend him, no matter what your background is, he would show no mercy at all.\u003c/p\u003e\n\u003cp\u003eMo Ling and the rest stared at that dent on the ground, while they involuntarily gulped. After all, all the elite Sacred Light Empire practitioner were blown into a bloody mist right in front of their eyes...\u003c/p\u003e\n\u003cp\u003eOn the citywall, when Lin Langtian saw this sight, his expression turned exceedingly grim. He knew that even if it were him, if he faced Lin Dong’s fifth finger, even though he had help from the mysterious Yuan Spirit inside his body, he would still be severely wounded.\u003c/p\u003e\n\u003cp\u003eRight now, Lin Dong’s battle potential had completely exceeded his. When he thought of this point, the killing intent in Lin Langtian’s heart swelled up. Currently, after such a massive battle, Lin Dong was spent and it was the best time for him to make a move!\u003c/p\u003e\n\u003cp\u003eJust as a killing intent flowed in Lin Langtian’s heart, in mid-air, a slightly pale Lin Dong waved his palm, before a suction force immediately gushed out. Instantly, eight Qiankun bags flew towards him. Since these guys came from Sacred Light Empire, they must have pretty decent possessions. Therefore, Lin Dong was naturally going to keep those as his battle spoils.\u003c/p\u003e\n\u003cp\u003eAfter he snatched away all their Qiankun bags, Lin Dong’s attention turned towards the citywall. When they saw him turning to look at them, the crowd on the citywall immediately retreated. It seems like no one wanted to be targeted by him.\u003c/p\u003e\n\u003cp\u003eAs the crowd retreated, one figure stood still. However, his expression was exceedingly grim while a rich killing intent flowed in his eyes.\u003c/p\u003e\n\u003cp\u003e“Lin Langtian, there is no need to hold back. Even if you do not make a move tonight, I will not let you go.”\u003c/p\u003e\n\u003cp\u003eAs he stared at that figure, a similar killing intent flowed in Lin Dongs’ eyes. With regards to this opportunistic bastard, he hated Lin Langtian much more than the Sacred Light Empire’s practitioners!\u003c/p\u003e\n\u003cp\u003eRegardless, tonight, he must get rid of this thorn in his heart!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-409\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-411\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-410","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
