{"id":60212,"no":456,"title":"Chapter 456 Showing Up","content":"\u003cp\u003e\u003cstrong\u003eChapter 456 Showing Up\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe noisy arena quietened down instantly as everyone turned to stare at the figure hovering in mid-air. The eyes of those who recognized the figure, such as Liu Yuan and the rest, gradually widened in disbelief. Evidently, none of them expected that Lin Dong would actually show up.\u003c/p\u003e\n\u003cp\u003e“Lin, Lin Dong.”\u003c/p\u003e\n\u003cp\u003eInside the steel cage, Mo Tei and the rest’s eyes abruptly widened. Promptly, their bodies gently trembled as they stared at the figure with a complicated expression in their eyes. Even though they knew that Lin Dong was partially responsible for the predicament they were in, none of them genuinely blamed him. That was because from the start, all of them had planned to borrow Lin Dong’s strength in order to enter Thunder Granite Valley, and Lin Dong had indeed fulfilled their wishes and brought them in, while even allowing them to reap plentiful rewards.\u003c/p\u003e\n\u003cp\u003eThis was a mutually beneficial partnership and having benefitted, they would naturally have to pay a price as well. Therefore, even though they were secretly disappointed deep in their hearts by Lin Dong’s absence in the past month, they did not hate him. All of them knew that if there were in Lin Dong’s shoes, they would absolutely not dare to show up at all. After all, the Devil Cliff Empire was no kind-hearted buddha. Based on how they operated, once Lin Dong showed up, his life would immediately be in danger.\u003c/p\u003e\n\u003cp\u003eThis meant certain death, hence, unless he was a fool, no one would expect him to show up for some acquaintances…...\u003c/p\u003e\n\u003cp\u003eHowever, what shook Mo Tei and the rest to the very core was that Lin Dong showed up in the end.\u003c/p\u003e\n\u003cp\u003eIt was difficult to explain how great a blow had been dealt to Mo Tei and the rest’s hearts when they saw the rather wiry figure appear. Yet, one could deduce the state of their hearts by the redness in the eyes of these men that were as tough as nails.\u003c/p\u003e\n\u003cp\u003eBadump! Badump!\u003c/p\u003e\n\u003cp\u003eThe figure that sudden appeared also drew the attention of the elite Devil Cliff Empire practitioners. Immediately, streams of potent Yuan Power erupted as all of them turned their vigilant and cold gazes towards the intruder.\u003c/p\u003e\n\u003cp\u003eHowever, in the face of these imposing Devil Cliff Empire practitioners, Lin Dong did not display the slightest bit of emotion. He looked at the steel cages in front of him as he slowly stretched out his hand and clenched.\u003c/p\u003e\n\u003cp\u003e“Crack!”\u003c/p\u003e\n\u003cp\u003eAs Lin Dong clenched his fist, the black steel cage slowly started to squirm. Evidently, this steel cage was made from a rather unique material as it emitted a faint glow while trying to struggle against his massive strength. However, in the end, it finally exploded with a loud bang.\u003c/p\u003e\n\u003cp\u003eAfter he casually destroyed the steel cage, Lin Dong’s somewhat cold eyes finally shifted to Li Pan, who was standing in the middle of the arena, before a flat voice sounded out, “Be a good boy and ask Chen Mu to step out.”\u003c/p\u003e\n\u003cp\u003eFrom start to finish, Lin Dong had never paid any attention to Li Pan. This total disregard first caused Li Pan to be stunned, before his face slowly became twisted.\u003c/p\u003e\n\u003cp\u003e“Hehe, you would risk yourself for your friends. Tch, even I can’t help but feel touched by your righteousness…” While his face twitched, Li Pan stared venomously at Lin Dong before laughing in a weird manner.\u003c/p\u003e\n\u003cp\u003e“Nonetheless, you must pay a hefty price in return for your righteousness. That’s fine as well. Since you have shown up, you’ll have to stay. I will prepare a special steel cage for you.”\u003c/p\u003e\n\u003cp\u003eLin Dong glanced at him before turning to look at Mo Tei and the rest and asked, “Are you alright?”\u003c/p\u003e\n\u003cp\u003e“Brother Lin Dong, thanks.” Mo Tei cupped his fist before he solemnly bowed at Lin Dong, while rich gratitude gushed into his eyes. Standing aside, Tang Xuan and Liu Xuan’s expression were complicated as they cupped their fists and bowed at Lin Dong. The fact that Lin Dong was willing to show up in order to save them had vastly exceeded their expectations. After all, they were keenly aware of the risks that the latter would be taking.\u003c/p\u003e\n\u003cp\u003e“The Mo Ling trio did not return to Yang City after you disappeared. They must have detected the hostility from Devil Cliff Empire and chose to leave secretly.”\u003c/p\u003e\n\u003cp\u003eAfter he heard Mo Tei’s words, Lin Dong secretly heaved a sigh of relief. As long as they were no in the hands of the Devil Cliff Empire, that was good news. Furthermore, based on their current strength, they had the ability to protect themselves in the ancient battlefield. Therefore, it was not completely bad news for them to leave on their own.\u003c/p\u003e\n\u003cp\u003e“Brother Lin Dong, we are very grateful that you are willing to show up. However, the Devil Cliff Empire is no ordinary faction and if a battle occurs later on, we will duke it out with them. If there is an opportunity, please leave on your own. After you have grown stronger, you can always come back for revenge.” Mo Tei solemnly said.\u003c/p\u003e\n\u003cp\u003eWhen he heard his words, Lin Dong smiled before he patted Mo Tei’s shoulders and said: “Since I have shown up, I will naturally ensure that all of you can leave peacefully as well. Leave everything else up to me.”\u003c/p\u003e\n\u003cp\u003eAs he spoke, Lin Dong slowly walked forward. His eyes scanned across his surroundings. However, when he failed to detect Chen Mu’s presence, he immediately furrowed his brows.\u003c/p\u003e\n\u003cp\u003e“No need to bother. Senior Chen Mu is not in Yang City and I am running this place.” As if he knew who Lin Dong was looking for, Li Pan gently smiled before he said: “You should be thankful that Senior Chen Mu is not here. Else, you would not even have the guts to stand there.”\u003c/p\u003e\n\u003cp\u003e“I know you have other trump cards besides your Soul Puppet. It’s fine with me. Today, I have the time to play with your Soul Puppet. However, you will have to deal with four half-step-to Nirvana stage practitioners on your own?” Li Pan smiled at Lin Dong. Behind him, four figures slowly walked out as they looked down on Lin Dong. Their auras were evidently at half-step-to Nirvana stage and they were much more powerful than Mo Tei and the rest, who were also at half-step-to Nirvana stage. Evidently, they had a more powerful cultivation base.\u003c/p\u003e\n\u003cp\u003e“I will leave him to you guys.”\u003c/p\u003e\n\u003cp\u003eLi Pan sat down on his stone chair, before he started sadistically at Lin Dong. His expression looked just like a cat that was teasing a mouse. He was curious to find out what other tricks Lin Dong had up his sleeves.\u003c/p\u003e\n\u003cp\u003e“Crack.”\u003c/p\u003e\n\u003cp\u003eThose four half-step-to Nirvana stage practitioners released an odd laugh, before they cracked their knuckles. Without further ado, their feet stomped against the ground, before their powers gushed out. Then, four figures flashed across the sky like arrows before they flew towards Lin Dong.\u003c/p\u003e\n\u003cp\u003eWhen those four half-step-to Nirvana stage practitioners flew over, a vicious glint flashed across Mo Tei and the rest’s eyes. However, just as they were about to make a move, standing in front of them, Lin Dong calmly stretched out his palm before he swiped his palm.\u003c/p\u003e\n\u003cp\u003ePa!Pa!Pa!Pa!\u003c/p\u003e\n\u003cp\u003eFour crisp noises suddenly echoed out in mid-air. Then, the crowds were shocked when they saw that those four menacing half-step-to Nirvana stage practitioner’s were all blown away, just as if they had encountered an immovable barrier. Meanwhile, there was a blood-red palm print on all of their faces.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eWhen those four figures slammed hideously against the ground, all of them immediately vomited a mouthful of freshblood, while their auras dimmed down significantly. Evidently, all of them had suffered severe injuries.\u003c/p\u003e\n\u003cp\u003eThe atmosphere seemed to have frozen in this instant. Regardless Mo Tei or Liu Yuan, everyone’s faces froze. Moments later, exclaims sounded out.\u003c/p\u003e\n\u003cp\u003eNone of them had expected that Lin Dong was actually able to send four half-step-to Nirvana stage practitioner flying with a single slap. Furthermore, what bewildered them the most was that Lin Dong did not use a tinge of Yuan Power.\u003c/p\u003e\n\u003cp\u003eThis sight was truly peculiar.\u003c/p\u003e\n\u003cp\u003e“Mental Energy…”\u003c/p\u003e\n\u003cp\u003eLi Pan, who had just sat down on a stone chair in anticipation of a good show, finally revealed a solemn expression on his hideous face. As he stared at Lin Dong, his words slowly echoed out...\u003c/p\u003e\n\u003cp\u003ePerhaps others failed to recognize it. However, when Lin Dong previously swiped his palm, he could clearly feel an extremely formidable Mental Energy, that was powerful enough to suffocate a person, gushing out from within his body.\u003c/p\u003e\n\u003cp\u003eHis Mental Energy shockwaves have far exceeded that of an ordinary Soul Symbol Master.\u003c/p\u003e\n\u003cp\u003e“Have you advanced to Heavenly Symbol Master?” Li Pan’s voice suddenly turned coarse, as he stared grimly at Lin Dong and asked.\u003c/p\u003e\n\u003cp\u003eIn this instance, he had finally realized why Lin Dong actually dared to show up. That was because he had absolute confidence in himself. After all, a Heavenly Symbol Master is an existence that could rival a Nirvana stage practitioner!\u003c/p\u003e\n\u003cp\u003eHis originally playful and sadistic heart began to slowly sink. It seems like this situation was slowly spinning out of control...\u003c/p\u003e\n\u003cp\u003e“Heavenly Symbol Master?!”\u003c/p\u003e\n\u003cp\u003eLi Pan did not try to conceal his words. Therefore, everyone around him clearly heard what he said. Immediately, all of their pupils shrunk.\u003c/p\u003e\n\u003cp\u003eAfter all, everyone in this arena was clearly aware of what that rank indicates. It indicated that Lin Dong possessed the qualifications to rival a Nirvana stage practitioner.\u003c/p\u003e\n\u003cp\u003eIn a manner of speaking, he could be considered as a Nirvana stage practitioner!\u003c/p\u003e\n\u003cp\u003eWhen they thought of his point, Mo Tei, Liu Yuan and the rest felt slightly nauseous. In merely a month’s time, Lin Dong’s strength had undergone a revolutionary change.\u003c/p\u003e\n\u003cp\u003eAs they stared at that lean figure, everyone’s heart was filled with admiration and respect. This was their respect towards power.\u003c/p\u003e\n\u003cp\u003eUnknowingly, it seems like this teenager, who was merely at advanced Manifestation stage when he first arrived at Yang City, had actually stealthily left them eating his dust...\u003c/p\u003e\n\u003cp\u003eHe must be destined to shine in this ancient battlefield.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-455\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-457\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-456","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
