{"id":60330,"no":574,"title":"Chapter 574: The Final Victor","content":"\u003cp\u003e\u003cstrong\u003eChapter 574: The Final Victor\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eEvery gaze in the auction house almost simultaneously turned and gathered on Song Tai’s body. Every single gaze was filled with shock, a rather spectacular sight sight.\u003c/p\u003e\n\u003cp\u003eEveryone could imagine that any person would vie for this Crossing Disaster Pill. However, they had never expected that the even the guardian of Wanxiang City, the man who came from a super sect, Song Tai, would take part as well..\u003c/p\u003e\n\u003cp\u003eSince this man’s first appearance, he had maintained neutral position and merely observed the infighting between different empires. At this juncture, it seemed like he could no longer maintain that neutrality...\u003c/p\u003e\n\u003cp\u003eFeng Cang, Mu Lin and the rest’s faces were similarly bewildered. Promptly, the latter shook his head regretfully. Since Song Tai has spoken, notwithstanding whether they could match up to his offer, even if they could do so, one would not be so foolish. At the end of the day, Song Tai held the highest authority in this city and he did not care which super empire you came from. As a member of a super sect, the authority of a super empire was childsplay.\u003c/p\u003e\n\u003cp\u003eOf course, in contrast to the regret on Mu Lin’s face, Feng Cang’s expression was rather grim. If others attempted to buy Lin Dong’s Crossing Disaster Pill, he could perhaps use the reputation of his Wind Cloud Empire to intimidate them. However, the one who had bid was Song Tai.\u003c/p\u003e\n\u003cp\u003eA commotion broke out in the auction. Even though many people were extremely unhappy with the fact that Song Tai had directly bought all three precious Crossing Disaster Pills, none of them dared to express any displeasure. Moreover, they could not afford to match Song Tai’s price.\u003c/p\u003e\n\u003cp\u003eAmidst the commotion, Lin Dong gradually recovered from his stupor. When he saw Song Tai looking at him, a smile immediately surfaced on his face as he cupped his fist and said, “Since Master Song has spoken, Lin Dong will naturally not disobey. If not for the unique circumstances that we are in, giving a Crossing Disaster Pill to Master Song is merely a trivial issue.”\u003c/p\u003e\n\u003cp\u003eOnce Lin Dong’s slick words left his mouth, several people immediately praised him silently in his heart. This fellow truly knows how to talk...\u003c/p\u003e\n\u003cp\u003eWhile the crowds secretly praised him, a smile slowly appeared on Song Tai’s calm face. Regardless of the sincerity of Lin Dong’s words, they did sound extremely pleasing.\u003c/p\u003e\n\u003cp\u003eAfter wishing him well, Lin Dong did not delay any further. With a wave of his hand, three Crossing Disaster Pills flew towards Song Tai. He did not have to worry that Feng Cang would intervene. At this juncture, if he even dared to speak up and interfere, Song Tai would probably not let him off.\u003c/p\u003e\n\u003cp\u003eAfter Song Tai received the three Crossing Disaster Pills, he carefully observed them for a while as the smile on his face grew wider. He had previously seen the Crossing Disaster Pill being sold in some larger auctions held in the Eastern Xuan region. However, they were quite rare and he had always failed to buy them. Nonetheless, he never expected that he would find them today.\u003c/p\u003e\n\u003cp\u003e“Here are twenty four million Nirvana Pills.”\u003c/p\u003e\n\u003cp\u003eAfter he kept the Crossing Disaster Pills, Song Tai waved his hands as a golden Qiankun bag flew towards Lin Dong. Faintly, an extremely potent Nirvana Qi emerged.\u003c/p\u003e\n\u003cp\u003eSong Tai evidently had quite a background. Else, it would be impossible for him to casually splurge twenty four million Nirvana Pills. In fact, even some lower or mid rank empires were unable to afford such a lavish sum even if they exhausted all their resources.\u003c/p\u003e\n\u003cp\u003eLin Dong caught the Qiankun bag. Without even bothering to look at it, he lifted it in the air, turning to look at a grim Feng Cang as he smiled and said, “Do I have the qualifications now?”\u003c/p\u003e\n\u003cp\u003e“Twenty four million. I want this Heavenly Soul Treasure.” Lin Dong chuckled while he gently waved the Qiankun bag in his hand. As he stared right at Feng Cang, he smiled and said, “This is also everything that I have. If you can defeat me, the Heavenly Soul Treasure shall be yours.”\u003c/p\u003e\n\u003cp\u003eFeng Cang’s face turned increasingly grim. Based on his expression , it seemed like he was dying to swallow the latter alive.\u003c/p\u003e\n\u003cp\u003e“Master Song.” Lin Dong ignored Feng Cang’s venomous expression, turning instead to smile at Song Tai, who was standing on the auction stage.\u003c/p\u003e\n\u003cp\u003e“Feng Cang, if you cannot pay a higher price than Lin Dong, this Heavenly Soul Treasure will naturally belong to him.” Song Tai gently smiled. When you gain something from others, you will naturally think well of them. Since Lin Dong had given him three Crossing Disaster Pills, he naturally warmed up to the former. In fact, there was a smile on his previous uncaring face.\u003c/p\u003e\n\u003cp\u003eFeng Cang’s eyes flickered as he slowly clenched his fist.\u003c/p\u003e\n\u003cp\u003eIn the auction house, the crowds started in awe at this scene. Evidently, none of them had expected that Lin Dong would actually overshadow all four super empires in the auction.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, you are indeed good… However, don’t celebrate too early.”\u003c/p\u003e\n\u003cp\u003eJust as Song Tai was about to announce who would obtain the Heavenly Soul Treasure, Feng Cang’s grim voice slowly sounded out as he lifted his head. His expression was venomous beyond words.\u003c/p\u003e\n\u003cp\u003e“Do you really think I have ran out of tricks?” Feng Cang’s lips cracked open as a cold glint flashed.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes narrowed. Promptly, he saw Feng Cang suddenly turn to the nearby Forest Kingdom, before he stretched out his hand and coldly shouted, “Wu Kuo. Hand me your fifteen million Nirvana Pills!”\u003c/p\u003e\n\u003cp\u003eOnce he spoke, everyone was startled as they stared in bewilderment at this sight. The Forest Empire and Wind Cloud Empire were not close allies. Therefore, how could the former be willing to give such a large number of Nirvana Pills to Wind Cloud Empire? Did Feng Cang lose his mind due to anger?\u003c/p\u003e\n\u003cp\u003eHowever, just as the crowds were in shock, Wu Kuo from Forest Empire smiled as he stood up. Finally, while the crowds stared in disbelief, he tossed over a Qiankun bag.\u003c/p\u003e\n\u003cp\u003e“Wu Kuo, you!”\u003c/p\u003e\n\u003cp\u003eMu Lin and Mo Feng were startled when they saw Wu Kuo’s actions. Promptly, it hit them. It turns out that the Wind Cloud Empire and Forest Empire had secretly formed an alliance under their noses...\u003c/p\u003e\n\u003cp\u003eOriginally, the four super empires in Thousand Empire City were at loggerheads. Their relationship was not cordial and there was no way for them to cooperate. That was because, all of them knew that they would end up competing.\u003c/p\u003e\n\u003cp\u003eHowever, while they assumed so, they suddenly realized that the Wind Cloud Empire and Forest Empire had formed an alliance. In that way, it would not be good news for the Lone Moon Empire and Lihuo Empire..\u003c/p\u003e\n\u003cp\u003e“Feng Cang, remember the reward you promised.” After he tossed the Qiankun bag, Wu Kuo casually smiled as he said under the stares of the crowd.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, I will not forget about you!” Feng Cang coldly snorted. Promptly, his somewhat venomous eyes turned to look at a frowning Lin Dong, before he venomously laughed, “To be able to force my Wind Cloud Empire till such an extent, you are skilled indeed. However, you will not be the last one laughing!”\u003c/p\u003e\n\u003cp\u003e“Nobody can stop my Wind Cloud Empire from getting what we want!”\u003c/p\u003e\n\u003cp\u003e“Since you offer twenty four million pills, I will offer thirty million pills. Trying to challenge me. Who do you think you are?!”\u003c/p\u003e\n\u003cp\u003eFeng Cang’s face was hideous and it looked a little twisted. It seemed like he was completely furious. This price had totally exceeded his expectations. Thirty million Nirvana Pills to buy a Heavenly Soul Treasure was indeed a hefty price. However, at this juncture, he was forced into a corner by Lin Dong.\u003c/p\u003e\n\u003cp\u003eLin Dong frowned his brows when he saw this sight. He had never expected that Feng Cang actually had this ace up his sleeve. Based on his financial standing, it was clearly impossible for him to fight against two allied super empires. Immediately, he suavely waved his hands and said with a smile: “In that case, congratulations.”\u003c/p\u003e\n\u003cp\u003eWhen he heard Lin Dong’s laughter, Feng Cang’s pale face turned even paler. He did not feel any joy from this victory. In fact, his heart was so enraged that his body began to tremble.\u003c/p\u003e\n\u003cp\u003eA situation that should have been controlled by him was now disrupted due to Lin Dong’s appearance. This auction price was simply too expensive.\u003c/p\u003e\n\u003cp\u003e“Master Song, announce the results.”\u003c/p\u003e\n\u003cp\u003eAfter taking in two deep breaths, Feng Cang’s voice was so cold that it seemed like it originated from hell. Everyone could feel the raging killing intent contained within his voice.\u003c/p\u003e\n\u003cp\u003eSong Tai furrowed his brows before he glanced regretfully at Lin Dong. Even though he liked Lin Dong far more than Feng Cang, he could not manipulate the situation. Else, if news reached the super sects, he would be placed in a tough spot.\u003c/p\u003e\n\u003cp\u003e“Black Dragon Sky Roaring Seal. Final auction price, thirty million Nirvana Pills!”\u003c/p\u003e\n\u003cp\u003eAfter the final announcement came out of Song Tai’s mouth, the curtain finally fell on this exciting show.\u003c/p\u003e\n\u003cp\u003eThe Qiankun bag containing thirty million Nirvana Pills was viciously flung towards Song Tai. When the latter saw the situation, he could only wave his hands. Promptly, that black steel seal transformed into a black glow, before it was somewhat manically caught by Feng Cang.\u003c/p\u003e\n\u003cp\u003eOnce he obtained the Heavenly Soul Treasure, Feng Cang’s expression instantly turned incomparably malicious. He immediately turned around, staring daggers at Lin Dong, while a savage Yuan Power manically swept forth.\u003c/p\u003e\n\u003cp\u003e“Lin Dong you filth, today I will make you beg for your own death!”\u003c/p\u003e\n\u003cp\u003eFeng Cang’s enraged roar mixed with a venomous killing intent caused the expression of everyone in the auction house to change drastically. It looked like this fellow could hardly wait once he got hold of the Heavenly Soul Treasure. He must have been truly enraged by Lin Dong.\u003c/p\u003e\n\u003cp\u003e“It is forbidden to fight in the auction house.”\u003c/p\u003e\n\u003cp\u003eHowever, just as Feng Cang was about to lose control and attack him, Song Tai suddenly spoke out from the auction stage.\u003c/p\u003e\n\u003cp\u003eHis killing intent stopped as Feng Cang tightly clenched his fist. As he venomously glared at Song Tai, his figure moved to exit the auction area.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, come out now. Since we cannot fight in the auction house, I shall slaughter you outside!”\u003c/p\u003e\n\u003cp\u003eHowever, just as Feng Cang’s roar resounded across the city, Song Tai spoke casually again from the auction stage, “I’m sorry. I am not in a good mood today. Hence, there fighting is forbidden in the entire Wanxiang City.”\u003c/p\u003e\n\u003cp\u003eUrgh!\u003c/p\u003e\n\u003cp\u003eWhen Feng Cang, who was about to head out of the auction house, heard those words, he was finally so outraged that he vomited out a mouthful of blood.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-573\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-575\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-574","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
