{"id":60339,"no":583,"title":"Chapter 581: Kick off (Begin)","content":"\u003cp\u003e\u003cstrong\u003eChapter 581: Kick off (Begin)\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe fierce and uncontrollable energy ripple that had spread throughout the sky quietly scattered at this moment. However, silence remained in the air as far as the eye could see. No one from even the super empires dared to make any noise as everyone’s hearts were currently filled with shock.\u003c/p\u003e\n\u003cp\u003e“This world is going to change.” The Lihou Empire’s Mo Fen finally regained his senses a moment later. He felt some lingering fear as he gazed at the two icy cold corpses while attempting to utter a joke to calm his heart a little.\u003c/p\u003e\n\u003cp\u003e“The Lin Dong trio… they are from a low rank empire…”\u003c/p\u003e\n\u003cp\u003eThe following words from Mo Fen were basically inaudible and faintly contained a bitter feeling. As someone from a super empire, he would inevitably feel superior when facing the competitors from low rank, mid rank and even high rank empires. After all, they were easily able to accomplish feats that other people needed to put in a great amount of effort in order to achieve. Their starting point far exceeded the rest and that allowed them to be able to take the lead in this Hundred Empire War in an extremely easy manner and tower over everyone else.\u003c/p\u003e\n\u003cp\u003eYet, at this moment, a low rank empire, which he viewed to be as insignificant as an ant, had actually produced three troublesome or even monstrous individuals.\u003c/p\u003e\n\u003cp\u003eThe frightening divide between a low rank empire and a super empire had been forcefully crossed by them at this moment.\u003c/p\u003e\n\u003cp\u003e“Wu Ta, looks like your eyes are extremely terrible.” Mu Lin turned his head at this moment and glanced at the rigid face of Wu Ta as he mocked with a smile.\u003c/p\u003e\n\u003cp\u003eOriginally, Wu Ta had planned to join forces with the Wind Cloud Empire. Amidst this, it was possible that Wu Ta harboured some ill thoughts towards them. However, now that the Wind Cloud Empire had been destroyed by Lin Dong’s hands, Wu Ta’s intention to join forces was also shattered.\u003c/p\u003e\n\u003cp\u003e“That ten million Nirvana Pills that you have loaned out… looks like it has all come to naught.” Mo Fen laughed out loud. His voice was clearly a gloating one.\u003c/p\u003e\n\u003cp\u003e“Haha, what are the two you talking about?” Wu Ta’s expression was unsightly as he let out a dry laughter. His eyes watched Lin Dong’s group with some fear. However, his heart involuntarily cursed. He was not cursing Lin Dong’s group… instead, he was cursing that useless Feng Cang. A super empire which possessed three four Yuan Nirvana stage experts had actually been finished off the moment they entered the core region. This was truly a disgrace.\u003c/p\u003e\n\u003cp\u003eAlthough he cursed in his heart, he clearly understood that if it were his Forest Empire instead, the speed at which they would be crushed… would be even swifter.\u003c/p\u003e\n\u003cp\u003eThe combat strength that Lin Dong’s group displayed had already surpassed that of his Forest Empire!\u003c/p\u003e\n\u003cp\u003eIn his opinion, it was likely that only those existences which were ranked amongst the top super empires would be able to deal with Lin Dong’s group.\u003c/p\u003e\n\u003cp\u003eWith regards to the large amount of Nirvana Pills that he had loaned to the Wind Cloud Empire, he could only clench his teeth and bitterly swallow down the grudge right now. The other party was already dead, who would he look for to repay him? Although he coveted the Heavenly Soul Treasure that had fallen into Lin Dong’s hands, he was clearly not foolish enough to stupidly attempt to demand that soul treasure from Lin Dong after having witnessed the fate of Feng Cang’s group.\u003c/p\u003e\n\u003cp\u003e“Useless swindlers…”\u003c/p\u003e\n\u003cp\u003eWu Ta looked at the sky in a speechless manner. His heart was aching but all he could do was to curse furiously in his heart.\u003c/p\u003e\n\u003cp\u003eLin Dong ignored the countless number of gazes that contained thick respect from around him as he directly sat on the ground. The intense pain that spread all over his body caused him to part his mouth.\u003c/p\u003e\n\u003cp\u003eThis fight could be considered to be the most intense one since Lin Dong had entered the Ancient Battlefield. It must be said that Feng Cang was indeed extremely strong. Not to mention the Heavenly Soul Treasure he wielded. Even though Lin Dong had quite a number of trump cards, he had still been forced into such a situation.\u003c/p\u003e\n\u003cp\u003eAlthough it had been a bitter battle, so much so that Lin Dong had even unleashed the Heavenly Dragon Aura hidden within his Dantain towards the end and ended up suffering serious injuries. However, he was able to sense that after his body had been pushed beyond its limits, he was now better able to adapt to the Heavenly Dragon Aura. This would be very useful in helping him to master ‘Green Heaven Materialized Dragon Skill’.\u003c/p\u003e\n\u003cp\u003eIt was obvious that the potential of one’s body would increase after experiencing this kind of fight that pushed one to one’s limits.\u003c/p\u003e\n\u003cp\u003eLittle Marten squatted by the side. His hand also contained a golden Nirvana Seal as Luo Tong clearly possessed the qualification to own a Heavenly Grade Nirvana Seal after having advanced to the four Yuan Nirvana stage. Now that this Nirvana Seal was absorbed by Little Marten, it had clearly allowed the latter’s Nirvana Seal rise in rank.\u003c/p\u003e\n\u003cp\u003e“Big brother Lin Dong, our Nirvana Seals have also changed quite a bit.”\u003c/p\u003e\n\u003cp\u003eTo one side, Su Rou and Su Kui also extended their hands. Their palms had a shiny silver Nirvana Seal. Moreover, the Nirvana Seals seemed to contain a trace of gold.\u003c/p\u003e\n\u003cp\u003eThe five three Yuan Nirvana stage experts, who had been defeated by them earlier, all possessed an Earth Grade Nirvana Seals. Moreover, they were all rank near the top. Now, their Nirvana Seals had been divided between Su Rou and Su Kui. Although the two of them did not leap to the Heavenly Grade Nirvana Seal, their progress was still rather good.\u003c/p\u003e\n\u003cp\u003e“Haha, I have ridden on the coattails of little Rou.” Su Kui laughed. He knew that with his own strength, dealing with any one of the five from before was his limit. If he fought the five of them alone, he would definitely end up losing. Snatching the other party’s Nirvana Seal was something that he did not even need to think of.\u003c/p\u003e\n\u003cp\u003e“Looks like we had a rather bountiful harvest.” Lin Dong grinned a little. He unceremoniously extended his hand and took the Qiankun bags from the corpses of Feng Cang and Meng Lie before stuffing both of them into his sleeves. If he did not gain any battle spoils after such an intense battle, he would really be letting himself down.\u003c/p\u003e\n\u003cp\u003e“Haha, congratulations brother Lin Dong. Currently, the Wind Cloud Empire merely exist in name. It will not be long before brother Lin Dong’s name will spread across the entire core region, and it is likely that you will even gradually be watched by those super sects.” A short distance away, Mu Lin and the rest drifted over as they cupped their hands together towards Lin Dong and said.\u003c/p\u003e\n\u003cp\u003eBehind Mu Lin, Mo Fen from the Lihuo Empire and Wu Ta from the Forest empire also followed. The three super empires were all gathered together, an extremely eye-catching sight.\u003c/p\u003e\n\u003cp\u003e“If my reputation spreads, I’m afraid that I will only end up attracting even more trouble.” Lin Dong laughed. His gaze calmly drifted over Wu Ta. The latter shrunk his neck under this gaze from Lin Dong while his face was filled with an awkward smile.\u003c/p\u003e\n\u003cp\u003eAlthough Lin Dong and Little Flame currently looked as though they were covered in wounds and were not in good condition, Wu Ta did not dare to slight these two even a little. Moreover, beside the two of them was a smiling Little Marten, who had managed to subdue the four Yuan Nirvana stage Luo Tong without even a single wound on his body.\u003c/p\u003e\n\u003cp\u003eWu Ta knew that amongst these three, the one who appeared to be the most handsome young man was the who had concealed himself the deepest…\u003c/p\u003e\n\u003cp\u003eWu Ta involuntarily felt as though he wanted to cry and smile the moment he thought of this. Just what kind of monsters were these? Each of them was even more monstrous than the other.\u003c/p\u003e\n\u003cp\u003e“With the strength of brother Lin Dong’s group, it is likely that only the super empires who are rank close to the top, have the qualification to fight with you. It seems that the Nirvana Golden Ranking of this Hundred Empire War will definitely have places for the three of you.” Mu Lin laughed. The friendliness within his voice could not be hidden.\u003c/p\u003e\n\u003cp\u003eLin Dong merely smiled in the face of this flattery from Mu Lin. The core region had at least ten cities that were similar to a great city like the Wanxiang City, and in comparison, those great cities were only stronger than the Wanxiang City, hence the competition would be even more intense. Although Lin Dong’s group had defeated the Wind Cloud Empire, it was a little overboard to say that they could roam unhindered throughout the entire core region.\u003c/p\u003e\n\u003cp\u003eMu Lin had clearly saw the perfunctory manner of Lin Dong and his caution. Immediately, he ceased talking about this matter. He knew that he did not give Lin Dong any substantial help in his fight with the Wind Cloud Empire since the beginning. Now that Lin Dong had succeeded, his attempt to show his goodwill would have difficulty gaining much effect.\u003c/p\u003e\n\u003cp\u003eMoreover, they were currently in the core region and were all considered competitors. Each of them were eyeing the Nirvana Seal in each other’s hands in order to be able to ascend the Nirvana Golden Ranking. Therefore, it was clearly impossible for them to get Lin Dong, who was not in a good condition, to reveal too much warmth to them.\u003c/p\u003e\n\u003cp\u003e“Haha, now that the Hundred Empire War has begun. Brother Lin Dong should quickly recuperate from your injuries. My Lone Moon Empire also plans to get moving. Hopefully, brother Lin Dong will show mercy the next time we meet.” Mu Lin joked with a smile.\u003c/p\u003e\n\u003cp\u003eIt must be said that this Mu Lin was indeed something. At this moment, he was actually able to relax and joke with Lin Dong. This caused Lin Dong to regard him from a new light.\u003c/p\u003e\n\u003cp\u003e“What is brother Mu saying. I will not offend others if they don’t offend me. If the Wind Cloud Empire did not view me as a thorn in their side, I would not have planned on crossing blows with them.” Lin Dong said.\u003c/p\u003e\n\u003cp\u003eMu Lin smiled upon hearing this. After which, he cupped his hands towards Lin Dong before leading Mu Hanyue and the rest to leave in a free and easy fashion. Mu Hanyue’s pretty eyes involuntarily paused for an instant on Lin Dong’s body. The latter did not appear tall or mighty and his battered and bloody body even caused him to appear a little miserable. However, his appearance made Mu Hanyue gently bite her red lips. She hesitated for a moment before removing out a jade bottle from her sleeves. A gentleness that was a little different from her cold self was revealed before Lin Dong.\u003c/p\u003e\n\u003cp\u003e“This should be of some help to your injuries. If you think that I am purposefully trying to get into your good books, you can toss it aside after I leave.”\u003c/p\u003e\n\u003cp\u003eUnder Lin Dong’s astonished gaze, Mu Hanyue spoke out in an indifferent manner before turning around. The figure molded by her snow white clothes drew out the desire in the surrounding gazes.\u003c/p\u003e\n\u003cp\u003e“Pfft, the ice queen is finally touched...” Little Marten curled his mouth and laughed in a strange manner.\u003c/p\u003e\n\u003cp\u003eLin Dong helplessly shook his head. With a flip of his hand, he stored the jade bottle in his sleeves. After which, he also stood up and softly said, “There are many eyes here. Let’s us leave first. The Heavenly Grade Nirvana Seals in our hands are very alluring to the eyes of others.”\u003c/p\u003e\n\u003cp\u003eLin Dong turned around and headed in another direction after uttering those words as Little Marten and the rest swiftly followed. Finally, they disappeared into the wild forest amidst many eyes that had not seen enough of the show.\u003c/p\u003e\n\u003cp\u003eThe curtain of the Hundred Empire War appeared to have been formally opened the moment Lin Dong’s group stepped into this region\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-580\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-582\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-581","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
