{"id":60364,"no":608,"title":"Chapter 606: Swallowing and Devouring","content":"\u003cp\u003e\u003cstrong\u003eChapter 606: Swallowing and Devouring\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe large black beast carried a monstrous like fierceness as it arose in the sky. Waves after waves of black ripples spread apart, causing the surrounding Yuan Power to fluctuate intensely.\u003c/p\u003e\n\u003cp\u003eFierce Beast Taotie!\u003c/p\u003e\n\u003cp\u003eNumerous eyes contained traces of shock when they saw that giant black beast in the sky. Its enormous black hole like mouth was extremely eye-catching. It is rumoured that its huge mouth could swallow everything in this world. Anything that lands within it would forever sink into darkness.\u003c/p\u003e\n\u003cp\u003eMany people had only heard of this renowned fearsome beast that existed in prehistoric times and had never saw it. Hence, when they saw that Song Zhen was actually able to summon the Taotie fierce spirit, everyone felt unusually shocked.\u003c/p\u003e\n\u003cp\u003eFrom the Taotie fierce spirit, they could sense a shockingly fierce and violent strength!\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eSong Zhen stood on top of the large head of that Taotie fierce spirit. His gaze contained a cold smile as he looked down at Lin Dong. The Taotie fierce spirit that he had summoned was not merely an illusionary thing. Instead, it genuinely possessed a trace of Taotie fierce beast aura. Although this aura became extremely faint with the flow of time, in Song Zhen’s opinion, it was clearly sufficient to deal with Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Brat, I will let you taste what is called despair!”\u003c/p\u003e\n\u003cp\u003eSong Zhen’s smiled viciously. Immediately, his eyes completely became dense as his hand seal changed in a lightning like fashion. Immediately, two scarlet red appears appeared on Taotie’s fierce beast dark body. Finally, its eyes were locked onto Lin Dong.\u003c/p\u003e\n\u003cp\u003eSuo!\u003c/p\u003e\n\u003cp\u003eLin Dong’s expression changed slightly when its two scarlet eyes locked onto him. He could sense the surrounding natural Yuan Power beginning to dissipate at this moment.\u003c/p\u003e\n\u003cp\u003eThat Taotie fierce spirit had actually swallowed all the surrounding Yuan Power. By doing so, even if Lin Dong used martial arts, its strength would weaken due to the lack of natural Yuan Power around him.\u003c/p\u003e\n\u003cp\u003e“Skilled indeed.”\u003c/p\u003e\n\u003cp\u003eLin Dong softly muttered himself. Taotie sect was indeed worthy of being the leader of the four great demon sects. The so called swallowing strength was actually this overbearing. If it was an ordinary person, that person would definitely feel restrained in this kind of environment and end up falling into a disadvantage in a fight.\u003c/p\u003e\n\u003cp\u003e“Howl!”\u003c/p\u003e\n\u003cp\u003eThe Taotie fierce spirit howled towards the sky. Black ripples crazily emerged from within its black hole like big mouth. A suction force surged out before the large rocks and trees around were immediately uprooted. Finally, they were all absorbed until no traces of them remained.\u003c/p\u003e\n\u003cp\u003eThose surrounding observers had a drastic change in expression upon seeing this indiscriminate attack. Their bodies hurriedly withdrew, fearing that they would be absorbed into the Taotie fierce spirit’s large mouth.\u003c/p\u003e\n\u003cp\u003eLanying and Feng Qing had somewhat grave expressions as they stood on a large rock and looked at the enormous Taotie fierce spirit that had been formed. Even they could sense a dangerous aura from the latter’s enormous body.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eThe large body of the Taotie fierce spirit suddenly stomped on the ground and rose. The land rumbled and its large body immediately transformed into an enormous black light pillar that descended from the sky, covering a hundred feet radius around Lin Dong.\u003c/p\u003e\n\u003cp\u003eThe black light pillar wiggled in a wild manner. Finally, it directly transformed into an incomparably enormous large mouth. The enormous mouth was just like a black hole of unfathomable depth, causing one to feel fearful when looking at it.\u003c/p\u003e\n\u003cp\u003e“Tao Zong fierce spirit, Heavenly Swallowing Mouth!”\u003c/p\u003e\n\u003cp\u003eSong Zhen cried out ferociously towards the sky while a rich savage expression surged up his face. He looked at Lin Dong, who was already locked onto by Taotie before a cruel expression appeared in his eyes.\u003c/p\u003e\n\u003cp\u003e“Lin Dong. Once you are swallowed by the Taotie fierce spirit, you will forever descend into its stomach of darkness. At that time, you will suffer a fate worse than death!” A vast and might pressure fell from the sky. It appeared lifelike as it covered a hundreds of feet radius around Lin Dong. All the large rocks within this area were forcefully pressured into powder and even the entire area had been forcefully pressured until it cave in by half a foot. Numerous crack lines began to wildly spread out in every direction like a spider web.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were a little solemn as he stared at the dark huge mouth that had basically blocked off all of his retreat paths. There appeared to be a black hole filled with a cold and strange darkness hidden within its enormous mouth.\u003c/p\u003e\n\u003cp\u003e“Swoosh swoosh!”\u003c/p\u003e\n\u003cp\u003eThe bone spear within Lin Dong’s hand flew out explosively before spear afterimages permeated the sky. Finally, they became like a storm as they struck at the enormous mouth.\u003c/p\u003e\n\u003cp\u003eHowever, these seemingly sharp spear afterimages were directly swallowed the instant they came into contact with the dark huge mouth and they did not even affect it at all. It was just like a bug’s arm trying to stop a car.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes immediately narrowed upon seeing this scene.\u003c/p\u003e\n\u003cp\u003e“Haha, what a naive fellow.”\u003c/p\u003e\n\u003cp\u003eSong Zhen laughed out loud. Right now, it looked like victory was in grasp. After all, even five Yuan Nirvana Stage experts had an unusually difficult time defending against his Heaven Swallowing Mouth. Therefore, how could Lin Dong block it with just the strength of his four Yuan Nirvana Stage.\u003c/p\u003e\n\u003cp\u003e“It’s over!”\u003c/p\u003e\n\u003cp\u003eThe dark huge mouth whizzed down. Finally, it looked just like black ink was pouring down. It directly engulfed Lin Dong in front of numerous horrified eyes.\u003c/p\u003e\n\u003cp\u003eSizzle!\u003c/p\u003e\n\u003cp\u003eThe strange black ink poured down and a large deep pit quietly appeared on the ground within a hundred feet radius from where Lin Dong stood. Lin Dong and that ground had all disappeared at this moment…\u003c/p\u003e\n\u003cp\u003e“Has he been swallowed?”\u003c/p\u003e\n\u003cp\u003eQuite a number of individuals inhaled a breath of cold air upon seeing the pouring black ink and the enormous pit on the ground. It appeared as though nothing could exist amidst the black light of the Taotie fierce beast swallowing strength…\u003c/p\u003e\n\u003cp\u003eSong Zhen’s body flashed and appeared in the air above the large pit. His eyes revealed a cold smile as he looked at the black coloured light cluster that was continuously wiggling. Regardless of what it was, as long as it was swallowed into its dark stomach, there was no way it could escape. Lin Dong would be digested at that place until nothing remained.\u003c/p\u003e\n\u003cp\u003e“The battle is over.”\u003c/p\u003e\n\u003cp\u003eSong Zhen stretched his lazy waist. His warm smile from before once again appeared on his face. With Lin Dong’s death, it was likely that the morale on their side would also surge greatly. Seems like they would be the ones who will have the last laugh in this battle.\u003c/p\u003e\n\u003cp\u003e“Has Lin Dong been finished off?” Qing Feng was a little surprised as he looked at the wiggling black coloured light cluster and asked.\u003c/p\u003e\n\u003cp\u003eLanying knitted her eyebrows. She was clearly aware of just how powerful the Taotie fierce beast that Song Zhen had unleashed was. Moreover, the most frightening thing of the Taotie fierce beast was its swallowing ability. Anything that was swallowed by its mouth would definitely not come out alive. Although the Taotie fierce spirit that Song Zhen had summoned merely had a trace of the original form’s aura, it was still incomparably frightening.\u003c/p\u003e\n\u003cp\u003e“He should be…” Lanying was quiet for a moment. She was just about to speak when her eyes suddenly shrunk. Her gaze immediately turned towards the cluster of black light and muttered, “Not finished off?”\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eAt the moment Lanying’s eyes were focusing intently on it, the black light cluster that was wiggling strangely suddenly began to tremble intensely. Ripples continuously spread on its surface. It was as though a great change had occurred.\u003c/p\u003e\n\u003cp\u003eSong Zhen also experienced a drastic change in expression because of this scene. The smile on his face swiftly disappeared. Taking its place was a dense shocked expression. He was simply unable to believe that Lin Dong would actually be able to block the terrifying swallowing strength of the fierce beast Taotie…\u003c/p\u003e\n\u003cp\u003eHowever, regardless of how much disbelief he felt, the subsequent scene caused a paleness to surge up his face.\u003c/p\u003e\n\u003cp\u003e“Sizzle sizzle!”\u003c/p\u003e\n\u003cp\u003eThe black light cluster wiggled swiftly and began to shrink with a speed visible to the naked eye before disappearing. That manner was as though its energy was being forcefully snatched away by something.\u003c/p\u003e\n\u003cp\u003eSong Zhen’s face trembled upon seeing this. This black light was the inheritance that he had obtained from the Taotie sect. He had relied on this to unleash the swallowing strength of the fierce beast Taotie. If it was to disappear in this baffling manner, he would suffer a heavy blow. Hence, he quickly refocused his mind in an attempt to retrieve that black light.\u003c/p\u003e\n\u003cp\u003eHowever, just as he was about to act, his expression turned even uglier. This was because he discovered that the connection between him and the black light was actually completely severed.\u003c/p\u003e\n\u003cp\u003e“What is the matter?”\u003c/p\u003e\n\u003cp\u003eA drop of cold perspiration drip down from Song Zhen’s forehead. This strange scene had clearly exceeded his expectations.\u003c/p\u003e\n\u003cp\u003e“Sizzle sizzle!”\u003c/p\u003e\n\u003cp\u003eThe black light also grew increasingly dim when Song Zhen’s expression changed. Immediately, a human figure slowly appeared within that black light. The rays of black light converged. Finally, they completely fell into the hands of that human figure.\u003c/p\u003e\n\u003cp\u003e“Lin Dong!”\u003c/p\u003e\n\u003cp\u003eSong Zhen looked at the human figure that surfaced within the black light. His eyes shrunk into the size of a pinhole almost instantly. A furious and shocked emotion surged into his voice.\u003c/p\u003e\n\u003cp\u003eHe could not believe that not only was Lin Dong not digested by the swallowing strength of the fierce beast Taotie, but he had instead absorbed that swallowing strength into his body.\u003c/p\u003e\n\u003cp\u003eThis scene really caused Song Zhen to feel as though his whole body was drenched in cold perspiration.\u003c/p\u003e\n\u003cp\u003eLin Dong, who was below, also raised his head in front of Song Zhen’s shocked eyes, before he smiled at the latter. However, his white glittering teeth caused Song Zhen to feel a chillness surge up from under his feet.\u003c/p\u003e\n\u003cp\u003e“Taotie lives up to its reputation. It taste quite good…”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-605\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-607\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-606","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
