{"id":60374,"no":618,"title":"Chapter 616: Cooperation","content":"\u003cp\u003e\u003cstrong\u003eChapter 616: Cooperation\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eLin Langtian walked into the arena and stood at a spot not far from Lin Dong. Soon after, he tilted his head a little and and gazed at the latter in a strangely sinister manner with eyes like a viper.\u003c/p\u003e\n\u003cp\u003eA faint yet similarly powerful ripple surrounded Lin Langtian. However, there seemed to be something a little off about this ripple. Compared to the Lin Langtian of before, it was as different as black and white. As he stared at Lin Dong, a cruel smile suddenly formed from the corners of his lips. He extended his hand and cut at Lin Dong’s throat from a distance. The motive and provocation behind this action was clear as day.\u003c/p\u003e\n\u003cp\u003eThe surrounding crowd was slightly startled by this action of his. Immediately, their eyes swept back and forth between Lin Langtian and Lin Dong. From the looks of it, these two people, who had come from the same empire, were at odds with each other.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were calm as he watched this scene, and no anger could be seen on his face. He could feel that the current Lin Langtian had become much stranger after merging with the Yuan Spirit. However, no matter how this fellow changed, the hatred that had taken root deep within his soul had not changed at all. Instead, it had been festered and was now even more twisted.\u003c/p\u003e\n\u003cp\u003eTherefore, Lin Dong did not care whether this body was controlled by Lin Langtian or the Yuan Spirit. He only knew one thing; if he allowed Lin Langtian to successfully join a super sect, it would cause Lin Dong countless sleepless nights...\u003c/p\u003e\n\u003cp\u003e“Heh, kid…”\u003c/p\u003e\n\u003cp\u003eWhile killing intent surged in Lin Dong’s heart, an elderly voice was suddenly transmitted into Lin Dong’s ears. This stunned him for a moment before he promptly lifted his head, turning his gaze towards the old man from the Dao Sect. The voice from before was clearly from that old man…\u003c/p\u003e\n\u003cp\u003eThe old man looked at Lin Dong for a while, however, his mouth did not move. Yet, a voice was transmitted over, “Little fellow, are you interested in cooperating with this old man?”\u003c/p\u003e\n\u003cp\u003e“Cooperating?”\u003c/p\u003e\n\u003cp\u003eLin Dong was stunned once again. He was truly unable to understand what kind of game this great one from the Dao Sect was playing.\u003c/p\u003e\n\u003cp\u003e“It’s very simple. I don’t care how you do it but do not allow Tianyuan Empire to become the champion.” The old man’s jovial voice was quickly transmitted over.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyelids twitched. From the looks of it, the Dao Sect and Yuan Gate were at odds with each other. The Tianyuan Empire was a subordinate faction of the Yuan Gate. If Qin Tian failed to win, it would naturally reflect poorly on the Yuan Gate...\u003c/p\u003e\n\u003cp\u003eIt didn’t seem good for him to get involved in this feud between the two super sects.\u003c/p\u003e\n\u003cp\u003e“What benefits will I get?”\u003c/p\u003e\n\u003cp\u003eEven with this thought in mind, Lin Dong’s mouth still moved. However, no voice was emitted. There were the experts from super sects stationed in the air. The old man could transmit his voice without being discovered by others, but Lin Dong did not possess that ability. Therefore, he could only mouth his words. However, given the old man’s ability, he would likely be able to read Lin Dong’s lips.\u003c/p\u003e\n\u003cp\u003e“Hehe, little fellow, there is a Celestial Demon Marten at your side. Hence, you can forget about joining the Yuan Gate. Should this fact be discovered after entering the Yuan Gate, you won’t have any chance to escape. However, it is different for my Dao Sect. We do not have any enmity with the Celestial Demon Marten tribe. Therefore, you will definitely not face such issues.”\u003c/p\u003e\n\u003cp\u003e“Moreover, I understand your character quite well. I believe that the Dao Sect is quite suitable for you. These are not empty words. You will understand this in the future.”\u003c/p\u003e\n\u003cp\u003e“Therefore, if you are able to prevent the Tianyuan Empire from becoming the champion of the Hundred Empire War, this old man will allow you to join the Dao Sect. Of course, my Dao Sect will not mistreat someone like you, who has performed some act of merit for us.”\u003c/p\u003e\n\u003cp\u003eLin Dong rubbed his chin upon hearing the words that were transmitted from the old man. An expression of deep thought flashed across his eyes. Currently, he had gained some basic understanding of the eight super sects in Eastern Xuan Region. Truth be told, he was indeed the most interested in the Dao Sect. The old man before him was also to his liking. After some consideration, it was likely that joining the Dao Sect would be quite a wise decision.\u003c/p\u003e\n\u003cp\u003eMoreover, if he was to join the Dao Sect, it would be fine for him to offend the Yuan Gate. In any case, he would not need to rely on them when the time comes. Moreover, the old man was surely not one to make empty promises. In that case…\u003c/p\u003e\n\u003cp\u003eLin Dong smiled when his thoughts reached this point. He nodded slightly towards the old man from the Dao Sect. Immediately, his lips moved again, “It is possible for me to cooperate. However, I want your help as well.”\u003c/p\u003e\n\u003cp\u003e“Oh? Go ahead and speak?” The old man smiled and transmitted his voice.\u003c/p\u003e\n\u003cp\u003e“I want to be in the same group as Lin Langtian in the subsequent Nirvana Golden Ranking battle.” Lin Dong curled his lips and slowly said.\u003c/p\u003e\n\u003cp\u003eThe old man was startled upon hearing this. His eyes looked towards Lin Langtian and mused for a moment before nodding. He transmitted his voice, “Alright. I can secretly make it happen. However, that fellow does not seem to be quite right. Are you sure that nothing will go wrong?”\u003c/p\u003e\n\u003cp\u003eWith the old man’s eyes, he had naturally sensed the faint Yuan Spirit fluctuation from Lin Langtian’s body, causing him to feel a little perplexed. After all, only the experts who had experienced at least seven Nirvana Tribulations would be able to possess a Yuan Spirit. However, it had appeared within Lin Langtian’s body. How could this not cause him to feel a little perplexed?\u003c/p\u003e\n\u003cp\u003e“The grudge between the both of us is very deep. We must resolve it here.” Lin Dong nodded slightly, while a cold glint flickered in his eyes.\u003c/p\u003e\n\u003cp\u003e“Sure, it will be as you requested.” The old man was extremely decisive and agreed immediately.\u003c/p\u003e\n\u003cp\u003e“It’s a deal then. I will also give my all.” Lin Dong exchanged a glance with the old man. Their eyes smiled with a common understanding. After which, they turned their gazes away at the same time without any prior agreement.\u003c/p\u003e\n\u003cp\u003e“Heh, given your performance, it is likely that all the eight great super sects will want you. You will not gain much from this agreement.” Beside him, Little Marten suddenly laughed strangely after Lin Dong withdrew his eyes. He was similarly very capable. Moreover, the old man did not purposefully conceal his voice when he transmitted it towards Lin Dong. Therefore, Little Marten was able to catch wind of their conversation.\u003c/p\u003e\n\u003cp\u003e“I am also quite interested in this Dao Sect. Since they have a request, it will naturally be beneficial if I am able to help them to fulfill it. I will likely gain some advantage when I enter the Dao Sect in the future.” Lin Dong smiled and said.\u003c/p\u003e\n\u003cp\u003eLittle Marten spread his hands outwards and did not say anything in response. He did not have any ill intent towards this Dao Sect. Therefore, he did not have much objection towards Lin Dong’s choice.\u003c/p\u003e\n\u003cp\u003eNumerous figures stood like shadows on the large arena in the middle of the Hundred Empire Mountain top. Every individual possessed a shockingly powerful aura. They were all powerful individuals who had stepped into the Nirvana Golden Ranking and all the top experts that remained standing.\u003c/p\u003e\n\u003cp\u003eLiu Tong looked down, before he promptly nodded slightly. With a wave of his sleeves, an extremely powerful Yuan Power spread across the sky. In the end, everyone watched as space become distorted and numerous large light barriers that were formed from Yuan Power appeared in the sky.\u003c/p\u003e\n\u003cp\u003eQuite a number of people were shocked when they saw so many Yuan Power light barriers formed in the air. Such a feat was sufficient to make them to hold him in high regard.\u003c/p\u003e\n\u003cp\u003eLiu Tong once again clenched his fist after creating these light barrier, which were to be used for battles. A bright light ball appeared in his hand. Within it. one could faintly see lots of light.\u003c/p\u003e\n\u003cp\u003e“All the light lots are divided into Yin and Yang sides. Those who holds the Yin side will be the opponent of the Yang side. The light lot will direct all of you to your respective light barrier battle stages.”\u003c/p\u003e\n\u003cp\u003eLiu Tong’s voice had barely faded when the light ball in his hand suddenly exploded. Numerous flashing light lots immediately fell onto the ground below like rain from light from all over the sky.\u003c/p\u003e\n\u003cp\u003eSwoosh swoosh swoosh!\u003c/p\u003e\n\u003cp\u003eThe light rain fell as the experts below immediately rushed out. All of them used their skills to grab the light lots from the air.\u003c/p\u003e\n\u003cp\u003eLin Dong did not move when he saw this scene. Instead, he threw his gaze towards Lin Langtian a short distance away. The latter’s eyes looked at him in a dark and cold manner. After which, his body rushed out as he grabbed a light lot from amongst the raining light in the sky.\u003c/p\u003e\n\u003cp\u003eThe old man on the light chair from the Dao Sect narrowed his eyes slightly when he saw this.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eLin Dong’s body also rushed out at this moment. His hand was extended into the raining light but did not grab any light lot. Instead, he waited for a moment and saw a light lot quietly rushing over by itself before finally landing in his hand.\u003c/p\u003e\n\u003cp\u003e“Such exquisite control…”\u003c/p\u003e\n\u003cp\u003eLin Dong grabbed the light lot and landed on the ground. His eyebrows gently raised. He could sense a powerful Yuan Power ripple on the light lot. It was impossible for Lin Dong and the others to enter it. However, the old man from the Dao Sect was able to find the precise light lot from these light lots that permeated the sky in a split second and deliver it into his hands. This ability… he was indeed worthy of being a member of the super sect.\u003c/p\u003e\n\u003cp\u003eSizzle sizzle!\u003c/p\u003e\n\u003cp\u003eAs the light lots landed into the various practitioners’ hands, countless pairs of eyes turned towards the light lot. After which, they directly flew towards the light barrier battle stages in the sky one after another.\u003c/p\u003e\n\u003cp\u003eA ray of light also shot out from the light lot in Lin Dong’s hand at this moment and connected with a light barrier battle stage in the sky. Meanwhile, another light shot out and connected to the other side of the same light barrier battle stage.\u003c/p\u003e\n\u003cp\u003eLin Dong turned his slightly tilted his head. His eyes followed the ray of light and sure enough, he saw a dark and cold faced Lin Langtian.\u003c/p\u003e\n\u003cp\u003eLin Langtian was clearly startled after realizing the other ray of light was actually connected to Lin Dong. However, an excitement and ferocity, that could not be hidden, immediately appeared on his face.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, looks like you are really unlucky. It is unexpected for you and me to meet in the first round…” Lin Langtian stared at Lin Dong and involuntarily let out a cold laugh.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes were indifferent as he stared back. However, he did not utter any unnecessary words. His body moved and flew towards the light barrier battle stage.\u003c/p\u003e\n\u003cp\u003e“Lin Langtian, I do not care what you are now. However, I will not allow our grudge to continue beyond the Ancient Battlefield. This place shall be our final battle ground!”\u003c/p\u003e\n\u003cp\u003e“Tsk tsk, it is just as I have intended!”\u003c/p\u003e\n\u003cp\u003eLin Langtian’s expression was savage. His body rushed out and directly charged into the interior of the light barrier battle stage. A monstrous and unrestrained killing intent spread outwards.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, you will definitely die this time around!”\u003c/p\u003e\n\u003cp\u003eKilling intent permeated the sky. Lin Langtian’s eyes were scarlet and exceptionally cruel as he stared at Lin Dong.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-615\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-617\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-616","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
