{"id":60383,"no":627,"title":"Chapter 625: Cao Yu","content":"\u003cp\u003e\u003cstrong\u003eChapter 625: Cao Yu\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eDozens of figures rushed out from the black cloud in the sky, before slowly coming to a halt some distance away from the Hundred Empire mountaintop. Their eyes contained a playful glint as they stared at the crowd atop the mountain.\u003c/p\u003e\n\u003cp\u003e“There doesn’t seem to be anything special about these geniuses from the Eastern Xuan Region…” A somewhat feminine looking young man at the front smilingly gazed at the mountaintop before curling his mouth and remarking.\u003c/p\u003e\n\u003cp\u003e“Haha, once we have moved this realm to the Western Xuan Region, all of these so called geniuses will likely end up as prisoners…” Behind the feminine looking young man, another man laughed heartily.\u003c/p\u003e\n\u003cp\u003e“Haha.”\u003c/p\u003e\n\u003cp\u003eA wave of laughter immediately erupted in the sky when the others heard this. It was as though they were completely looking down on these so called geniuses.\u003c/p\u003e\n\u003cp\u003eFury surfaced in the eyes of everyone on the mountain top when they heard their mocking laughter. All of those present were prideful individuals. Hence, how could they endure being mocked so openly.\u003c/p\u003e\n\u003cp\u003eAlthough they were raging in their hearts, none of them dared to speak up impulsively at this moment. The current situation was such that even those experts from the super sects were trapped. Could it be that they were the ones who had to act in this situation?\u003c/p\u003e\n\u003cp\u003eSome turned to each other, before their gazes immediately turned away. Most of their gazes were thrown towards Qin Tian, who was at the center. At the end of the day, Tianyuan Empire was the strongest empire within the Eastern Xuan Region. Moreover, they had the backing of the Yuan Gate. At this time, it seemed only natural that everyone placed their hopes on him.\u003c/p\u003e\n\u003cp\u003eAs the focal point of so many gazes, a very tiny smile formed at the corners of Qin Tian’s mouth, while his spine unknowingly straightened. He glanced at Lin Dong’s direction from the corner of his eyes. It appeared as though he was very pleased to be the center of attention.\u003c/p\u003e\n\u003cp\u003eQin Tian’s action might be extremely minute but it did not escape Lin Dong’s eyes, to which he could not resist but smile a little. This fellow was actually able to think about such nonsense at this time…\u003c/p\u003e\n\u003cp\u003eThe people before them were no ordinary foes.\u003c/p\u003e\n\u003cp\u003e“Everyone, it is not wise to act so arrogantly in our Eastern Xuan Region, no?” Under the gazes of the crowd, the now straight backed Qin Tian looked towards the dozen powerful figures in the sky and spoke with a mighty voice.\u003c/p\u003e\n\u003cp\u003e“Who do you think you are?” The feminine looking man stared at Qin Tian with a half smile and replied in an indifferent manner.\u003c/p\u003e\n\u003cp\u003e“I am Qin Tian from the Tianyuan Empire, a disciple of the Yuan Gate!” Qin Tian’s eyes were furious as he coldly said.\u003c/p\u003e\n\u003cp\u003e“Qin Tian? I have never heard of such a person amongst the younger generation of the Yuan Gate.” The feminine man ridiculed.\u003c/p\u003e\n\u003cp\u003e“Haha, big brother Chang Wei, this fellow has clearly yet to enter the Yuan Gate. How could you possibly have heard of him?” A loud laughter sounded out behind the feminine man.\u003c/p\u003e\n\u003cp\u003e“So he is merely a phony showoff.” The feminine man known as Chang Wei softly chuckled, completely ignoring the now green-faced Qin Tian.\u003c/p\u003e\n\u003cp\u003e“Alright Chang Wei, there is no need for any more unnecessary words.” A man in dark red robes right at very front finally waved his hand, silencing the mocking laughter behind him.\u003c/p\u003e\n\u003cp\u003e“Yes big brother Cao.”\u003c/p\u003e\n\u003cp\u003eThis man clearly possessed a rather high position. Hence, even Chang Wei smiled and nodded after the former spoke, ceasing his mockery.\u003c/p\u003e\n\u003cp\u003eThe man in dark red robes slowly lowered his head after putting a stop to the group’s mockery. His eyes were cold and indifferent as he looked towards the crowd. A faintly discernible and strong Yuan Power vaguely spreading from his body, causing everyone’s heart to suddenly tightened. This ripple was even a little stronger than Qin Tian’s…\u003c/p\u003e\n\u003cp\u003e“Who is Lin Dong?” The dark red robe man’s eyes swept over the crowd. His eyes merely paused on Qin Tian for a moment before demanding in a faint voice.\u003c/p\u003e\n\u003cp\u003eEveryone was startled when they heard these words. Immediately, their eyes shifted towards a tall and thin figure to the back. Clearly, they did not expect his name to be called.\u003c/p\u003e\n\u003cp\u003eLin Dong also frowned slightly at this moment. He stared at the man and spoke in a calm tone, “Yes?”\u003c/p\u003e\n\u003cp\u003e“You should remember him?” The man in dark red robes waved his hand. After which, a person from behind him stepped forward. He venomously stared at Lin Dong. From the looks of it, it was the Death Spirit General who had fled after being seriously injured by Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Hee hee, Lin Dong, do you still remember the words I said back then? I said that you will regret it!” The Death Spirit General stared at Lin Dong and laughed in a malicious manner.\u003c/p\u003e\n\u003cp\u003e“Alive as expected, what an unpleasant fellow…” Lin Dong glanced at the Death Spirit General and indifferently smiled.\u003c/p\u003e\n\u003cp\u003e“Keep acting tough. Once this realm is transferred to the Western Xuan Region, I will let you experience a fate worse than death!” The Death Spirit General wore a ferocious expression as he retorted.\u003c/p\u003e\n\u003cp\u003e“Why? Lin Dong, do you know them?” Qin Tian suddenly opened his mouth and spoke when his saw this scene. Clearly, he was did not wish for the limelight to be snatched away by Lin Dong.\u003c/p\u003e\n\u003cp\u003e“I have met these people some time ago and exchanged blows with them…” Lin Dong casually replied.\u003c/p\u003e\n\u003cp\u003e“You are aware that they are after this realm? Why didn’t you report this sooner?” Qin Tian frowned, a slightly interrogative tone in his voice.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes narrowed slightly upon hearing this, feeling a little wronged. However, his tone did not fluctuate much when he replied, “If you randomly met someone on the way who tells you that they intend to snatch this realm from the hands of the Eastern Xuan Region’s super sects, would you believe him?”\u003c/p\u003e\n\u003cp\u003eQin Tian was stunned. He had been rendered completely speechless.\u003c/p\u003e\n\u003cp\u003e“Qin Tian, now is not the time to talk about this. We must stop them from establishing the formation. Otherwise, once they transfer this realm to the Western Xuan Region, we will end up deep within the wolves’ lair.” Lan Ying suddenly said from the side.\u003c/p\u003e\n\u003cp\u003eQin Tian turned his head after hearing Lan Ying’s words, looking towards the man in dark red robes as he said, “There is no need to be overly worried. After all, there are quite a number of us. Their seal is unable to trap sir Liu Tong and the rest for long. Leave this person to me.”\u003c/p\u003e\n\u003cp\u003eQin Tian stepped forward while he uttered these words. Immediately, a powerful Yuan Power ripple swept outwards. That degree of strength caused the expressions of quite a number of people to change.\u003c/p\u003e\n\u003cp\u003e“Six Yuan Nirvana stage?!”\u003c/p\u003e\n\u003cp\u003e“He is indeed worthy of being someone from the Tianyuan Empire, to think that he has actually broken through to the six Yuan Nirvana stage.” Shocked expressions were revealed in the eyes of the many experts from the various empires on the mountaintop upon witnessing this scene, while also causing them to rejoice a little. Right now, the stronger Qin Tian was, the more reassured they felt.\u003c/p\u003e\n\u003cp\u003e“As expected, six Yuan Nirvana stage…” Lin Dong’s eyebrows raised a little. This Qin Tian did indeed possess some actual ability. Six Yuan Nirvana stage. If nothing went wrong, the Hundred Empire War champion title would likely fall into his hands.\u003c/p\u003e\n\u003cp\u003eHowever, Lin Dong was naturally happy to have Qin Tian fight on their behalf at such a time. He immediately withdrew and stood beside Little Marten.\u003c/p\u003e\n\u003cp\u003e“This fellow is no match for that person. Moreover, he would likely lose rather miserably…” Little Marten lazily said.\u003c/p\u003e\n\u003cp\u003e“Oh?” Lin Dong was startled. He took a second look at the dark red robe man in the sky. This person did indeed seem to be a little stronger than Qin Tian. However, a miserable defeat would be unlikely right?\u003c/p\u003e\n\u003cp\u003eLittle Marten’s face had a playful smile hanging on it. Without explaining, he folded his arms across his chest as he observed the battleground.\u003c/p\u003e\n\u003cp\u003e“Six Yuan Nirvana stage is quite decent…” The dark red robe man in the sky was also a little surprised as he stared at Qin Tian. Soon after, he shook his head slightly and softly said, “There are indeed quite a number of you but all of you are merely weaklings. Although those on our side are not the strongest due to the limitations of our scheme, it is more than enough to deal with all of you.”\u003c/p\u003e\n\u003cp\u003e“Set up the formation.”\u003c/p\u003e\n\u003cp\u003eWithout any more unnecessary words, he waved his hand and spoke in a faint voice.\u003c/p\u003e\n\u003cp\u003e“Understood!”\u003c/p\u003e\n\u003cp\u003eThe dozen figures behind him immediately cried out in unison upon hearing his voice. They swung their hands as clusters of black light balls appeared. Soon after, numerous black light lines suddenly rushed out. These light lines directly penetrated through the emptiness, as if they penetrated through this space…\u003c/p\u003e\n\u003cp\u003e“Qin Tian, stop them. Whoever destroys the formation will be the champion of this Hundred Empire War!”\u003c/p\u003e\n\u003cp\u003eLiu Tong’s furious roar was suddenly heard from the prison formed by the black seal when those black light lines penetrated through space.\u003c/p\u003e\n\u003cp\u003e“Humph, I’m afraid that you have found the wrong opponent if you wish to behave so atrociously in our Eastern Xuan Region!”\u003c/p\u003e\n\u003cp\u003eQin Tian’s eyes also became cold upon hearing Liu Tong’s cry. Majestic Yuan Power swept out, directly transforming into a light figure that rushed towards the dark red robe man at lightning speed.\u003c/p\u003e\n\u003cp\u003e“Attack!”\u003c/p\u003e\n\u003cp\u003eBehind Qin Tian, the experts who had stepped into the Nirvana Golden Ranking also revealed stern expression as they closely followed.\u003c/p\u003e\n\u003cp\u003e“Things that do not know your limits…”\u003c/p\u003e\n\u003cp\u003eThe dark red robe man watched Qin Tian rush over with indifferent eyes. He slowly extended his hand and clenched it gently.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eAfter the hand fell, the space in front of him suddenly became distorted. An unusual black light directly shot out from the empty space, smashing into Qin Tian at lightning speed.\u003c/p\u003e\n\u003cp\u003eUrgh!\u003c/p\u003e\n\u003cp\u003eThe black light struck Qin Tian as golden light wildly flickered on his body. The next instant, the golden light dimmed as a mouthful of fresh blood was spat out and his body flew backwards in a miserable manner. Finally, he landed violently onto the ground.\u003c/p\u003e\n\u003cp\u003eThe Nirvana Golden Ranking experts who were just about to charge forward were halted almost instantly. Every single one of them had shocked expressions on their faces. Clearly, they did not expect that even Qin Tian, who had stepped into the six Yuan Nirvana stage, would be defeated in a single move.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes slowly became grave at this moment. This fellow was really powerful.\u003c/p\u003e\n\u003cp\u003eThe dark red robed man looked down upon everyone from the sky. His tone was indifferent, while ridiculing expression flashed across his mouth.\u003c/p\u003e\n\u003cp\u003e“Do you still wish to fight?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-624\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-626\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-625","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
