{"id":60413,"no":657,"title":"Chapter 655: Objection from Jiang Hao","content":"\u003cp\u003e\u003cstrong\u003eChapter 655: Objection from Jiang Hao\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eOn the spacious platform, the atmosphere became much quieter due to his sudden outburst. Quite a few Desolate Hall disciples stared at each other in dismay. However, they closed their mouths shut and kept quiet. All of them understood Jiang Hao’s character. Since Lin Dong had seized Tong Chuan’s spot for the Pill River Head Immersion, even if this matter did not occur, he would not easily let a new disciple that had spent less than a month in the Desolate Hall become a senior direct disciple…\u003c/p\u003e\n\u003cp\u003eAt the three other directions, the other senior direct disciples Tong Pang, Fang Yun and Song Zhou did not voice out like Jiang Hao did. However, there was a hint of doubt in their eyes. They had all expended great effort to achieve their status as senior direct disciples during the past years. However, as of now, Lin Dong was still a newbie.\u003c/p\u003e\n\u003cp\u003eAlthough it had to be said that Lin Dong achieved a terrifying result, this does not mean that he would immediately receive their approval.\u003c/p\u003e\n\u003cp\u003eMo Ling and the others frowned and looked at Lin Dong with concerned expressions. They had an extremely good relationship with him and they were naturally happy to see Lin Dong’s status within the Desolate Hall rise. However looking at the current situation where Jiang Hao had voiced his opposition, they all felt quite hopeless. Regardless, Jiang Hao’s power prestige and fame exceeded Lin Dong’s…\u003c/p\u003e\n\u003cp\u003eHowever, under the gaze of Mo Ling and the others, Lin Dong remained calm and collected without a trace of anger. His current disposition gained some admiration from Mo Ling and the rest. Ever since their first meeting, the fellow right in front of them could always maintain a calm and collected composure when facing any thorny situation, before settling everything in the end.\u003c/p\u003e\n\u003cp\u003eIn mid-air, Chen Zhen and Wu Dao shot a look at Jiang Hao while frowning. However, there was no sense of surprise within their eyes as if they had long expected this to happen.\u003c/p\u003e\n\u003cp\u003e“Jiang Hao, what do you have to say?” said Chen Zhen slowly.\u003c/p\u003e\n\u003cp\u003e“Senior uncle Chen Zhen, a senior direct disciple is the role model and pride of the disciples in the Desolate Hall. Not only would one need to have outstanding strength, one would need to gain everyone’s trust and respect. Although this junior brother is quite talented, wouldn’t it be a bit too quick to promote him to a senior direct disciple right now?” said Jiang Hao solemnly as he bowed at Chen Zhen.\u003c/p\u003e\n\u003cp\u003eAn ordinary disciple would need to address Chen Zhen and Wu Dao as hall master. However since Jiang Hao was a senior direct disciple, he could address Chen Zhen as senior uncle. From this, it could be seen that a senior direct disciple’s status is quite high.\u003c/p\u003e\n\u003cp\u003eChen Zhen frowned and replied: “Jiang Hao, there are always exceptions. If we were to follow the rules and rot without any change, the Desolate Hall would forever remain as the last amongst the four halls!”\u003c/p\u003e\n\u003cp\u003e“It’s true that there can be exceptions…” replied Jiang Hao. Narrowing his eyes and looking towards Lin Dong, he casually added on: “However I do not believe this junior brother has obtained the qualification for an exception to be made.”\u003c/p\u003e\n\u003cp\u003eThe instant this statement was made, quite a few disciples below the platform pulled at their mouths, as it was slightly cruel.\u003c/p\u003e\n\u003cp\u003eA trace of anger swept past Mo Ling and the others after hearing what Jiang Hao said. Unknowingly, they had already regarded Lin Dong as their unofficial leader. At this moment, Lin Dong was being ridiculed. Therefore, they naturally felt displeased.\u003c/p\u003e\n\u003cp\u003eHowever, although they were feeling discontented within their hearts, they did not dare to carelessly chip in with their comments. After all, this was the Dao Sect and Jiang Hao’s status and strength within the Desolate hall were way above them…\u003c/p\u003e\n\u003cp\u003eTherefore, the gazes of Mo Ling and the others once again landed on Lin Dong, whose expressionless face now had a faint trace of a smile. Under the numerous gazes, he turned his body around and looked straight at Jiang Hao without a single trace of fear in his eyes.\u003c/p\u003e\n\u003cp\u003eAfter noticing Lin Dong’s vision, Jiang Hao slightly curled his lip and crossed his hands in front of his chest. An imposing aura rushed out of him and started to oppress the former. Possessing the cultivation level of Seven Yuan Nirvana Stage was sufficient for him to look down on Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Senior brother Jiang Hao, would you clarify the boundaries of the qualifications you speak of?” questioned Lin Dong as he stared at Jiang Hao and gave a faint smile.\u003c/p\u003e\n\u003cp\u003e“The degree of respect and your strength,” said Jiang Hao casually.\u003c/p\u003e\n\u003cp\u003e“It has been only a short while since I entered the Desolate Hall, so it’s plausible that most of the seniors here are not familiar with me. Thus, on the degree of respect, I truly do not have an edge. However, I can certainly tell everyone here that our Desolate Hall would not be ranked last in the next hall competition!” Lin Dong’s gentle and relaxed words resounded across the platform, causing quite a few disciple to gawk.\u003c/p\u003e\n\u003cp\u003eThese words were relatively rampant, as the strength of the Desolate Hall was greatly lacking compared to the other three halls in Dao Sect. Trying to move up the rankings was not a simple task.\u003c/p\u003e\n\u003cp\u003e“On what basis do you dare to utter such arrogant words?” said Jiang Hao coldly.\u003c/p\u003e\n\u003cp\u003e“Based on the fact that I endured under the pill river for eleven days.” said Lin Dong casually while giving a faint smile.\u003c/p\u003e\n\u003cp\u003eJiang Hao stagnated for a brief moment before flinging his sleeves and replied with cold laughter: “That does not mean anything. The current you only has a cultivation level of Five Yuan Nirvana Stage, where is your courage coming from?”\u003c/p\u003e\n\u003cp\u003e“ If junior brother Lin Dong really has the ability to help our Desolate Hall break free from the last rank, it would not be a big issue to make an exception for your promotion.” said a slightly famous disciple standing on the platform suddenly in a solemn voice.\u003c/p\u003e\n\u003cp\u003e“Yes, if you can achieve what you have just said, there’s no problem with granting you an exception.”\u003c/p\u003e\n\u003cp\u003eAfter the statement was made by the disciple, a few other direct disciples added in their opinions. Although Jiang Hao was cunning with his words, all of them knew the potential of being able to endure under the bottom of the pill river for eleven days represented. If Lin Dong was truly able to achieve what he had said and elevate their Desolate Hall from the last rank, this would be an extremely prideful matter for all the Desolate Hall disciples.\u003c/p\u003e\n\u003cp\u003eAfter all, for so many years, their Desolate Hall has always been mocked by the disciples of the three other halls. That feeling was truly unpleasant.\u003c/p\u003e\n\u003cp\u003e“Hmph.”\u003c/p\u003e\n\u003cp\u003eAfter witnessing the sudden change, Jiang Hao felt somewhat angry and shouted: “You all can’t be that naive right? It doesn’t matter how terrifying his talent is, how can a new disciple like him possibly compete with the top disciples who have comprehended the three other great mysterious scriptures?”\u003c/p\u003e\n\u003cp\u003e“If he can’t achieve it, does that mean that senior brother Jiang Hao can?” a voice rang from the platform refuted.\u003c/p\u003e\n\u003cp\u003eJiang Hao’s facial expression turned somewhat ugly. The three great mysterious scriptures were extremely strong. If they were that easily to contend against, why would the Desolate Hall end up in such a pitiful state for so many years?\u003c/p\u003e\n\u003cp\u003e“Senior brother Jiang Hao, I presume that the current level of respect should suffice, right?” asked Lin Dong with a smile.\u003c/p\u003e\n\u003cp\u003eJiang Hao took a deep breath and replied while flames of anger surged within his eyes: “ Such eloquence! However, you can’t thoroughly convince all the disciple here just based on that!”\u003c/p\u003e\n\u003cp\u003e“I understand.”\u003c/p\u003e\n\u003cp\u003eLin Dong faintly nodded his head and instantly and took a slight step forward. Stretching out his right hand towards Jiang Hao, a soft and relaxed voice rang across the platform: “Senior brother Jiang Hao, please guide me!”\u003c/p\u003e\n\u003cp\u003eLin Dong was clearly aware that it did not matter what he said. Jiang Hao would never be willing to let this go, thus the only way to resolve it was very simple, fight!\u003c/p\u003e\n\u003cp\u003e“He has guts.”\u003c/p\u003e\n\u003cp\u003eOn the other three areas of the platform, the three senior direct disciples Tong Pang, Fang Yun and Song Zhou all narrowed their eyes after seeing Lin Dong’s reply. They secretly smiled in their hearts as they thought, did he really treat Jiang Hao as a “kid”?”\u003c/p\u003e\n\u003cp\u003eAlthough they had previously seen Lin Dong undergoing the Fifth Nirvana Stage Tribulation, there was still an extremely large disparity when compared to Jiang Hao. Furthermore, the latter’s combat prowess was not something an ordinary Seven Yuan Nirvana Stage expert could compare with...\u003c/p\u003e\n\u003cp\u003eLow murmuring voices could be heard spreading out from the platform. There were quite a few people that frowned. As disciples of the Desolate Hall, they were extremely clear on how powerful Jiang Hao really was. Although it had to be said that they had seen Lin Dong’s frightening combat prowess, Jiang Hao was not a “kid”. He was one of the four senior direct disciples of the Desolate Hall!\u003c/p\u003e\n\u003cp\u003e“He is just like an adolescent bull which does not fear a tiger.”\u003c/p\u003e\n\u003cp\u003eThe corners of Jiang Hao’s mouth cracked open slightly and revealed a slight crescent that was either sneering or appreciation. Raising his head and looking towards Chen Zhen, he said: “Senior uncles, do you think I should accept this challenge? Please feel relaxed, I would show ample discretion. I am clearly aware of this junior brother’s talent and would not let any serious injuries to befall him. However, since he is now in the Desolate Hall, he has to understand our rules. In the future, I believe he would understand the pained heart of being a senior brother like me.”\u003c/p\u003e\n\u003cp\u003eAfter hearing that, both Chen Zhen and Wu Dao had a wrinkle on their forehead. A brief hint of hesitation flashed past their eyes. Lin Dong directly challenging Jiang Hao had slightly exceeded their expectations as they had presumed that Lin Dong would exercise forbearance. No matter what, the former was one of the four senior direct disciples. Being the hall masters of the Desolate Hall, they were very clear about the various successes of Jiang Hao.\u003c/p\u003e\n\u003cp\u003e“Since Lin Dong has taken the initiative and challenged you, you naturally have the right to accept it. However it would not be held now, instead, it would be held five days later. Coincidentally it is also the date of the monthly competition. At the appointed time, the both of you can fight to your heart’s content.”\u003c/p\u003e\n\u003cp\u003eChen Zhen contemplated silently for a moment, before finally flinging his hand and uttering those words solemnly. He understood that passing this obstruction created by Jiang Hao was essential to their plans to grant an exception for Lin Dong to become a senior direct disciple.\u003c/p\u003e\n\u003cp\u003e“However, Lin Dong, you have just entered the Desolate Hall and have yet to learn the Desolate Hall martial arts. After today, you can visit the Desolate Hall Martial Arts Hall and observe and chose any martial arts in there.”\u003c/p\u003e\n\u003cp\u003eLin Dong was faintly startled! It seems like Chen Zhen was not favouring his odds in a fight between him and Jiang Hao. Therefore, he bought him five days’ time to learn the martial arts in Desolate Hall.\u003c/p\u003e\n\u003cp\u003e“Haha, let’s proceed with whatever senior uncle Chen Zhen has said.”\u003c/p\u003e\n\u003cp\u003eJiang Hao gave a casual laugh as he obviously understood Chen Zhen’s hidden intentions. Shooting a look at Lin Dong, he flung his sleeves before he said with a smile: “Junior brother Lin Dong, you have to make the best out of these five days. I am certainly not biased against you. If you had entered the Desolate Hall for at least half a year to a year, I would not even mention half a word. However, currently”\u003c/p\u003e\n\u003cp\u003eSpeaking until this point, Jiang Hao shook his head and stopped speaking. However, the meaning behind his words was very clear. He did not believe the current Lin Dong had the qualifications to become a senior direct disciple of the Desolate Hall\u003c/p\u003e\n\u003cp\u003eLin Dong faintly smile without a tinge of fear. A gentle chuckle, that was meant to oppose him, slowly spread out.\u003c/p\u003e\n\u003cp\u003e“Thank you, senior brother, Jiang Hao, for the reminder. Then let’s meet again after five days.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-654\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-656\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-655","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
