{"id":60416,"no":660,"title":"Chapter 658 The Desolate Stone","content":"\u003cp\u003e\u003cstrong\u003eChapter 658 The Desolate Stone\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThud thud.\u003c/p\u003e\n\u003cp\u003eSubtle sound of footsteps resounded quietly throughout the platform. A skinny figure was walking on the platform. Under numerous shocking gazes, the figure walked with an unhurried pace, getting closer to the gigantic Desolate Stone in the middle of the platform.\u003c/p\u003e\n\u003cp\u003e“This fellow…”\u003c/p\u003e\n\u003cp\u003eAt this moment, a lot of disciples furrowed their eyebrows. Among these disciples, there were some who tried to get closer to the Desolate Stone. After all, the closer one got to the Desolate Stone, the more Desolate Force one could absorb and this was highly beneficial to their cultivation of the ‘Desolation Skill’. However, the person who was able to do it had yet to appear. Even the four current senior direct disciples could only make it to fifty feet within the Desolate Stone at best. If they were to get any closer, their bodies would be corroded by the overbearing Desolate Force, drying up in the process.\u003c/p\u003e\n\u003cp\u003eHow could Lin Dong achieve such a feat when even the four senior direct disciples were unable to do so?\u003c/p\u003e\n\u003cp\u003eHowever, even though there were a lot of people doubting Lin Dong’s reckless move, they did not try to dissuade him from doing so. After Lin Dong’s exceptional result in the Pill River, nobody in Desolate Hall dared to treat him as an ordinary disciple.\u003c/p\u003e\n\u003cp\u003eUnder the numerous attentive gazes from the onlookers, Lin Dong’s figure moved increasingly closer to the Desolate Stone.\u003c/p\u003e\n\u003cp\u003eBuzz buzz!\u003c/p\u003e\n\u003cp\u003eAs Lin Dong moved closer to the stone, he could feel the terrifying energy wave that was coming at him head-on. The Desolate Force around this area was up to ten times stronger than where it was a few hundred feet away.\u003c/p\u003e\n\u003cp\u003eThe Desolate Force that pervaded the air pierced through Lin Dong’s body from all directions. Under such corrosion, the color of Lin Dong’s robe started to fade. Eventually, his robe started to show signs of drying up, appearing like a piece of barren land.\u003c/p\u003e\n\u003cp\u003e“The Desolate Force is rather overbearing.”\u003c/p\u003e\n\u003cp\u003eLin Dong reached out his palms. At this moment, the skin of his palms had become rather dry and dull. A surprised look swept across his face. It seemed like the so-called Desolate Force was able to enervate anything, including the Yuan Power in his body.\u003c/p\u003e\n\u003cp\u003eIf he was any other ordinary individual that encountered such overbearing Desolate Force, it would pose an intractable problem. However, for Lin Dong, it did not seem too much of a bother.\u003c/p\u003e\n\u003cp\u003e“Devour.”\u003c/p\u003e\n\u003cp\u003eA gentle voice rang across Lin Dong’s mind. Following which, traces of Devouring Power started to extend outward from his body silently.\u003c/p\u003e\n\u003cp\u003eTcch tchh!\u003c/p\u003e\n\u003cp\u003eThe Devouring Power quickly twined around the traces of Desolate Force that had invaded Lin Dong’s body. Without the slightest bit of hesitation, those traces of Desolate Force were being devoured at once.\u003c/p\u003e\n\u003cp\u003eWhile the devouring was taking place, a fine sound could be heard from Lin Dong’s body. It sounded like someone was crunching a bunch of dried leaves.\u003c/p\u003e\n\u003cp\u003eAt this point in time, Lin Dong’s shrivelled palms were recovering slowly. The Desolate Force that invaded his body had been completely finished off by the Devouring Power.\u003c/p\u003e\n\u003cp\u003eAs Lin Dong felt what was going on in his body, a smile appeared upon his face. Under the numerous startled looks from the onlookers, Lin Dong cracked his neck gently and quickened his pace.\u003c/p\u003e\n\u003cp\u003e“He’s actually alright...”\u003c/p\u003e\n\u003cp\u003e“How can it be? The Desolate Force has no effect on him?”\u003c/p\u003e\n\u003cp\u003eWhen everyone saw Lin Dong moving as though he was flying, commotions broke out in the surroundings. Everyone was flabbergasted at this scene. They could not believe that Lin Dong was actually able to withstand the boundless and dreadful Desolate Force.\u003c/p\u003e\n\u003cp\u003eUnder the platform, in front of the stone tablet, the blind old man stared silently in the direction of Lin Dong with his pupil-less eyes. His face did not show any emotions. However, his wizened hands that were holding the broom tightly clenched unconsciously.\u003c/p\u003e\n\u003cp\u003e“Buzz buzz!”\u003c/p\u003e\n\u003cp\u003eWith his quickened pace, Lin Dong rushed into ten feet within the Desolate Stone in less than ten seconds. The Desolate Force in this area had reached a rather terrifying level. Even the ground began to dry up and crack at this moment. When Lin Dong’s feet stepped onto the ground, the ground sunk and revealed a heap of ash.\u003c/p\u003e\n\u003cp\u003eAfter Lin Dong entered ten feet within the Desolate Stone, he finally felt an immense pressure. If not for the fact that the Devouring Power was channeling through his body, his life force would have been corroded by the Desolate Force to the point that he died.\u003c/p\u003e\n\u003cp\u003eOnce again, Lin Dong recalled the technique to practising the Desolation Skill in his mind and took in a deep breath of air. Then, a series of profound and cryptic chant flowed through his mind.\u003c/p\u003e\n\u003cp\u003eTcch tcch!\u003c/p\u003e\n\u003cp\u003eAs the chant flowed through his mind, the unique yet vigorous Desolate Force rapidly entered Lin Dong’s body as if it was being attracted by something.\u003c/p\u003e\n\u003cp\u003eWhen the Desolate Force entered Lin Dong’s body, it did not have a single chance to create chaos. Instead, it was manipulated by the domineering Devouring Power and forcefully directed towards Lin Dong’s Dantian.\u003c/p\u003e\n\u003cp\u003eIf he was an ordinary individual that was practising the Desolation Skill, no matter how strong his physical body was, he would still need some time to adapt before allowing traces of Desolate Force to be absorbed into his body and form the Desolate seedling.\u003c/p\u003e\n\u003cp\u003eClearly, Lin Dong was able to skip these insignificant steps. The Desolate Force might be domineering, but the Devouring Power was far more domineering and powerful. With the suppression from his Devouring Power, the Desolate Force was not able to pose any threat.\u003c/p\u003e\n\u003cp\u003eAlong with the series of cryptic chant in Lin Dong’s mind, the grey-colored Desolate Force flowed steadily into his body. In Lin Dong’s Dantian, a stream of grey-colored air began to form. However, it had yet to reach the level of forming a Desolate seed.\u003c/p\u003e\n\u003cp\u003e“Too slow…”\u003c/p\u003e\n\u003cp\u003eLin Dong furrowed his eyebrows and said something that would cause those disciples to spurt out blood if they were to hear it. The first time they practised the Desolation Skill, it took them one or two days to successfully form a trace of Desolate Force in their bodies. However, Lin Dong was still not satisfied with the absurd speed that he was going at right now.\u003c/p\u003e\n\u003cp\u003eOf course, Lin Dong did not care about what other people think. All he wanted was to become stronger, so much so that the next time he met Ling Qingzhu, he did not have to hang his head low anymore. As such, he would not give up on any opportunities to become stronger.\u003c/p\u003e\n\u003cp\u003eTherefore, when Lin Dong finished his sentence, he continued walking forward despite receiving numerous horrified gazes from the Desolate Hall’s disciples.\u003c/p\u003e\n\u003cp\u003eHiss!\u003c/p\u003e\n\u003cp\u003eAs Lin Dong continued walking forward, the disciples surrounding the platform took in a deep breath of cold air. Could it be that this fellow wanted to hug the Desolate Stone and practise the skill? He surely knew that, within ten feet of the Desolate Stone, every step he took would increase the strength of the Desolate Force by upteen times, right?\u003c/p\u003e\n\u003cp\u003eAt this point of time, the broom in the blind old man’s hands began to tremble slightly. A glint seemed to flash across his ash-grey eyes.\u003c/p\u003e\n\u003cp\u003eUnder numerous attentive gazes, Lin Dong walked forward step-by-step. He could feel the rising pressure in his surroundings. Soon after, a faint green glow encircled his body.\u003c/p\u003e\n\u003cp\u003eOne step… two steps… five steps… nine steps...\u003c/p\u003e\n\u003cp\u003eThud!\u003c/p\u003e\n\u003cp\u003eWhen Lin Dong took the final step forward, everyone’s eyes were wide-open. Their eyes were filled with disbelief.\u003c/p\u003e\n\u003cp\u003eUnder those incredulous gazes, Lin Dong raised his arm slowly and tapped his finger on the Desolate Stone.\u003c/p\u003e\n\u003cp\u003eAs Lin Dong’s slender finger fell on the Desolate Stone, a coarse feeling that was accompanied by a chilliness extended through his finger. Following which, an indescribable yet terrorizing energy wave gushed out from the Desolate Stone like a volcanic eruption. Eventually, the energy surged into Lin Dong’s body mercilessly.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eAt this moment, Lin Dong’s body trembled fiercely. Even his bones gave off cracking sounds. A dark-grey color extended through his finger all the way up to his arm with an astonishing speed.\u003c/p\u003e\n\u003cp\u003eSnap! Crack!\u003c/p\u003e\n\u003cp\u003eThe dark-grey color moved extremely fast. Within seconds, it had extended throughout Lin Dong’s body. Even his face started to show signs of shrivelling up, appearing like a stone statue that was smashed in the face.\u003c/p\u003e\n\u003cp\u003eWhen the surrounding disciples saw this scene, their facial expression changed drastically. This fellow finally tasted the consequences of being reckless. Did he really think that anyone could endure the Desolate Force that was contained in the Desolate Stone?\u003c/p\u003e\n\u003cp\u003e“He can’t endure it, huh”\u003c/p\u003e\n\u003cp\u003eIn front of the stone tablet, the already wrinkle-filled face of the blind old man shrivelled up even more. His hands were holding the broom tightly. After a moment, he finally shook his head and took a step forward, preparing to make a move.\u003c/p\u003e\n\u003cp\u003e“Elder, this disciple can still handle it,”\u003c/p\u003e\n\u003cp\u003eJust when the blind old man took a step forward, a soft voice that was sent through a trace of Mental Energy echoed into his ears silently.\u003c/p\u003e\n\u003cp\u003eThe blind old man was startled before he gradually retracted his footstep. With his ash-grey eyes, he looked at the distant figure that was touching the Desolate Stone. A confused look appeared on his wizened face...\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-657\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-659\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-658","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
