{"id":59824,"no":68,"title":"Chapter 68: Black Dragon Stockage","content":"\u003cp\u003eWDQK Chapter 68: Black Dragon Stockage\u003c/p\u003e\n\u003cp\u003e“It is inevitable that this journey will not go as smoothly as the previous one. Based on my sources, this batch of Yang Yuan Stones have attracted some hungry wolves…” In a large hall within the Steel Wood Manor, Lin Zhentian solemnly said with a serious look on his face as he gazed at Lin Xiao and the rest.\u003c/p\u003e\n\u003cp\u003e“Oh? Could it be that the Lei Family has decided to make their move?” After hearing his words, Lin Xiao and the rest’s facial expressions slightly changed.\u003c/p\u003e\n\u003cp\u003e“Heh, that cunning old fox Lei Bao will not make a move so lightly. Based on my information, the ones who are eyeing our current batch of Yang Yuan Stones should be from the “Black Dragon Stockage”.” Lin Zhentian chuckled grimly as he said.\u003c/p\u003e\n\u003cp\u003e“Black Dragon Stockage?”\u003c/p\u003e\n\u003cp\u003eOnce this name entered their ears, even Lin Dong, who was standing beside, could not help but furrow his eyebrows. There were several bandit groups located within a thirty mile radius of Qingyang Town, and the “Black Dragon Stockage” was one of the most infamous among them. These group of bandits were reputed to be vicious and heartless and the two leaders in “Black Dragon Stockage” were reportedly at Heavenly Yuan Stage. Therefore, the duo’s names struck considerable fear throughout Qingyang Town.\u003c/p\u003e\n\u003cp\u003e“How does the Black Dragon Stockage know that we are transporting a large shipment of Yang Yuan Stones? They should also know that our Lin Family are tough adversaries.” said Lin Xiao. In the past, their Lin Family had not crossed paths with these bandit groups. Why did the Black Dragon Stockage suddenly decide to target them?\u003c/p\u003e\n\u003cp\u003e“Heh heh, I suspect that the Lei Family may be involved in this matter. Our recent activities seemed to have aroused their suspicion…” Lin Zhentian chuckled as he replied.\u003c/p\u003e\n\u003cp\u003e“Father, so what you mean is that the Black Dragon Stockage is likely being urged on by the Lei Family?” To one side, Lin Ken and Lin Mang’s expressions darkened as they said.\u003c/p\u003e\n\u003cp\u003e“Based on my understanding Lei Bao, this is likely the case.”\u003c/p\u003e\n\u003cp\u003eLin Zhentian lightly nodded his head, however, his gaze gradually turned chilly before he muttered: “I will personally take charge of this trip like before. Lin Xiao and Lin Mang will tag along while Lin Ken will stay to guard the Steel Wood Manor. I want to see for myself if this Black Dragon Stockage truly dares to make a move against my Lin Family!”\u003c/p\u003e\n\u003cp\u003e“Yes!” After hearing his commands, Lin Xiao and Lin Mang immediately responded.\u003c/p\u003e\n\u003cp\u003e“Dong-er, you should not follow us for this journey. Just stay still at Steel Wood Manor.” After finishing his instructions, Lin Zhentian told Lin Dong. A potentially big battle might break out during this trip and even though the current Lin Dong had the strength to protect himself, it would be safer for him to stay in the Steel Wood Manor.\u003c/p\u003e\n\u003cp\u003eUpon hearing Lin Zhentian’s instructions, Lin Dong could only nod his head.\u003c/p\u003e\n\u003cp\u003e“Time is of the essence, I want the two of you to immediately gather up the rest of the forces!”\u003c/p\u003e\n\u003cp\u003e“Yes!”\u003c/p\u003e\n\u003cp\u003eLin Xiao and Lin Mang nodded their heads again before they stood up and left. Soon after, rumbling sounds of horses hooves could be heard. The low echos sounded akin to the arrival of a thunderstorm.\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eAtop the manor wall, Lin Dong gazed at that massive entourage leaving the manor. Under the watchful eyes of the guards, a flurry of yellow dust was stirred up as they sped towards the main road.\u003c/p\u003e\n\u003cp\u003e“I hope that you will all return safe and sound.”\u003c/p\u003e\n\u003cp\u003eLin Dong gently sighed. He could feel the tensed atmosphere in his Lin Family. Due to that tension, even the younger generation members became more solemn.\u003c/p\u003e\n\u003cp\u003e“Fear not, with Grandpa personally leading the way, I doubt that Black Dragon Stockage will dare to attack them!” As if he knew his nephew’s worries, to one side, Lin Ken smiled as he consoled Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Today, Lin Xia and Lin Hong are both at the Steel Wood Manor. You should go and play with them. Don’t worry about these matters, the adults will take care of them.” Lin Ken patted Lin Dong’s shoulder before he turned and instructed: “I want everyone to be on high alert. Even if it might just be the wind blowing a blade of grass, sound the alarm immediately! Under no circumstances do you let allow any suspicious-looking persons into the premises!”\u003c/p\u003e\n\u003cp\u003e“Yes sir!”\u003c/p\u003e\n\u003cp\u003eAfter Lin Ken shouted his orders, several replies from the crowd on the tall manor walls sounded out in response. As the sparkling rays of the sunlight shined downwards, the entire manor went into high-alert.\u003c/p\u003e\n\u003cp\u003eLin Dong lept off the manor wall, before he walked to a training arena within the manor. There, were Lin Xia, Lin Hong and other younger generation members while some of them were currently dueling with each other.\u003c/p\u003e\n\u003cp\u003e“Lin Dong-ge.”\u003c/p\u003e\n\u003cp\u003eAs they saw Lin Dong walk over, everyone straightened their waist as they excitedly greeted him. Right now, Lin Dong held a significant status in their hearts.\u003c/p\u003e\n\u003cp\u003e“Humph, you are really impressive now.” In front of Lin Dong, Lin Xia stood with her hands on her slim waist as she pouted and said.\u003c/p\u003e\n\u003cp\u003e“Lin Xia-jie, please don’t tease me.” As he looked at the elegant young lady before him, Lin Dong helpless replied with a pained smile.\u003c/p\u003e\n\u003cp\u003e“Heh.” As she saw Lin Dong’s reaction, Lin Xia involuntarily laughed. Then she waved her snow-white tiny hands and proceeded to seat herself on a rock nearby before she continued: “Alright, alright. I won’t tease you anymore. Do you think Grandpa and the rest will encounter much trouble this time?”\u003c/p\u003e\n\u003cp\u003eAs she finished her question, a look of anxiety surfaced on the young lady’s cheeks. She could definitely feel the tense atmosphere in the manor and even though she had always been living under the protection of the family, she clearly knew how vicious these power struggles could be.\u003c/p\u003e\n\u003cp\u003eLin Zhentian and the rest were the backbone of their Lin Family. If anything happened to them, this family would definitely fall apart. At that time, it would be difficult for them to seek even the slightest bit of peace.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, it’s going to be fine.”\u003c/p\u003e\n\u003cp\u003eLin Dong sighed in his heart. He stared at the anxious faces on Lin Xia and the rest of the younger generation members and involuntarily bit his lips. If the current Lin Family possessed a Yuan Dan practitioner, they would definetly not have these worries. Simply put, true power was still the most secure currency.\u003c/p\u003e\n\u003cp\u003eAfter she heard Lin Dong’s comforting words, Lin Xia’s complexion became slightly better. Promptly, she began to tell Lin Dong about some of the events that had occurred in Qingyang Town recently.\u003c/p\u003e\n\u003cp\u003eAfter they chatted merrily for quite a while, Lin Hong, who was nearby, suddenly walked over. He looked at Lin Dong and hesitated for a moment, before he finally said: “Lin Dong biao-di, when I was practising a martial arts, I ran into some difficulties. Do you think you could help me out?”\u003c/p\u003e\n\u003cp\u003eAfter hearing his request, both Lin Dong and Lin Xia were stunned as they looked at Lin Hong in disbelief. This fellow had always been a prideful individual, therefore they did not expect him to take the initiative and ask Lin Dong for help.\u003c/p\u003e\n\u003cp\u003e“Of course, we are one family. Helping each other is only natural.” Just as Lin Xia was worried that Lin Dong may reject Lin Hong because of their history, Lin Dong smiled as he gently nodded his head.\u003c/p\u003e\n\u003cp\u003eUpon hearing Lin Dong’s good-natured reply, Lin Hong was also slightly taken aback as his face turned red. He was evidently ashamed about his childish acts in the past.\u003c/p\u003e\n\u003cp\u003e“Lin Hong biao-ge, display the martial arts that you are practising now.”\u003c/p\u003e\n\u003cp\u003eLin Hong hurriedly nodded his head. Taking a step back, he had just positioned himself into fight stance when the seated Lin Dong suddenly stood up. Just moments ago, he was wearing a bright smile, but now his face has turned dark and fearsome.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, what’s the matter?” As she saw his sudden change, to one side, Lin Xia was also shocked as she asked.\u003c/p\u003e\n\u003cp\u003e“Trouble…”\u003c/p\u003e\n\u003cp\u003eLin Dong sucked in a deep breath. Without bothering to explain, he immediately turned and swiftly ran towards the entrance of the manor, before finally jumping onto the manor wall. As he stared into the far horizon, he could see that at the end of that large road, a huge storm of yellow dust was suddenly swept up. Thunderous sounds of horse hooves spread out like a wave towards them.\u003c/p\u003e\n\u003cp\u003e“What is that?”\u003c/p\u003e\n\u003cp\u003eBehind him, Lin Xia, Lin Hong, and even Qing Tan followed. However, as they stared at that yellow dust storm, a look of alarm immediately flashed on their faces.\u003c/p\u003e\n\u003cp\u003e“It’s the men from Black Dragon Stockage. We have been tricked. Their target was not the Yang Yuan Stones that Grandpa was delivering but rather… the Steel Wood Manor!”\u003c/p\u003e\n\u003cp\u003eTo one side, Lin Dong had a dark look on his face as he clenched his fists so tightly that crunching sounds could be heard. This time, if things were not managed well, their Lin Family would suffer tremendously!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-67\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-69\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-68","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
