{"id":60438,"no":682,"title":"Chapter 680: Fighting the Butcher","content":"\u003cp\u003e\u003cstrong\u003eChapter 680: Fighting the Butcher\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the sky, countless pairs of eyes congealed on Lin Dong’s body, while a shady expression appeared on Luo Yi’s face. Obviously, the latter had developed a rich killing intent towards him after his previous action. From his point of view, since he was at eight Yuan Nirvana stage, killing Lin Dong was going to be as simple as flipping his palm.\u003c/p\u003e\n\u003cp\u003e“If you want to steal, use your own hands. Don’t waste your time doing these stupid things and stop being so wishy-washy!”\u003c/p\u003e\n\u003cp\u003eHowever, while the crowd stared at him, the chilliness on Lin Dong’s face grew increasingly richer. He proceeded to stare at Luo Yi and chuckled.\u003c/p\u003e\n\u003cp\u003eWoah.\u003c/p\u003e\n\u003cp\u003eThe moment Lin Dong’s words sounded out, an uproar immediately erupted in the entire sky. Quite a few people stared at Lin Dong with a strange expression on their faces. They truly could not imagine how a brat merely at five Yuan Nirvana Stage, would actually dare to utter such words to Luo Yi, who was at eight Yuan Nirvana Stage. Did he really think that the latter would be intimidated just because he was a disciple of Dao Sect?\u003c/p\u003e\n\u003cp\u003e“Heh, the disciples of Dao Sect are truly getting more and more egotistical. Does that brat know who Luo Yi is? Does he really believe that his reputation of butcher is unwarranted?”\u003c/p\u003e\n\u003cp\u003e“Since he provoked Luo Yi, this matter would not be settled so easily.”\u003c/p\u003e\n\u003cp\u003e“Truly an arrogant and foolish brat... ”\u003c/p\u003e\n\u003cp\u003eOne whisper after another containing ridicule and sneer started to spread across the sky while quite a few people started to point at Lin Dong. Their expressions looked as if they enjoyed taking joy in other people’s misfortune.\u003c/p\u003e\n\u003cp\u003eBehind Lin Dong, Ying Huanhuan and the rest looked at each other in dismay after hearing Lin Dong’s words. However, they knew a little about Lin Dong’s character and understood that the latter was not a hot-headed individual. Since he dared to utter those words, it was likely that he had confidence in himself. However…\u003c/p\u003e\n\u003cp\u003eThat fellow is a vicious individual that is ranked sixth on the sects’ wanted list...\u003c/p\u003e\n\u003cp\u003e“Haha…”\u003c/p\u003e\n\u003cp\u003eAmidst the uproar that filled the skies, the shady grin already present on Luo Yi’s face became even more quiet, gloomy and cold. His eyes stared maliciously at Lin Dong. However, he did not fly into a rage as he chuckled instead. Nonetheless, his laughter truly caused one’s hair to stand.\u003c/p\u003e\n\u003cp\u003e“Nowadays, it seems like the number of stupid blockheads who do not fear death have increased…” Luo Yi smirked as he shot a smile at Lin Dong from the corner of his mouth and revealed a set of sparkling white teeth. However, from within his pupils, shot forth an exceptionally ruthless luster instead.\u003c/p\u003e\n\u003cp\u003e“This friend, if you are still able to say those words later, I will truly admire your courage.”\u003c/p\u003e\n\u003cp\u003eA faint voice filled with gentle laughter rang out from Luo Yi’s mouth. A gloomy and cold murderous aura that made one’s skin crawl started to quietly pervate and spread in the air.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eHowever, the moment Luo Yi spoke, a malevolent expression suddenly appeared on his face. Taking a step forward, his figure suddenly disappeared.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, be careful!”\u003c/p\u003e\n\u003cp\u003eThe moment Luo Yi’s figure disappeared, Ying Huanhuan, Jiang Kun and the rest realized it as well. There was a faint change in their facial expressions as they quickly warned him.\u003c/p\u003e\n\u003cp\u003eHovering in mid air, Lin Dong had already spread out his Mental Energy. Immediately, his pupils hardened, before he took a half a left step.\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eA palm filled with scarlet blood Qi carrying the sharpest palm blade flashed past Lin Dong’s shoulder with a lightning-like speed. As the palm wind flashed past, it sliced off a strand of Lin Dong’s hair.\u003c/p\u003e\n\u003cp\u003e“Snort!”\u003c/p\u003e\n\u003cp\u003eAfter his attack failed, Luo Yi’s body appeared in a flash. With a cold laugh, his arm turned into weapon, while his palm turned into a blade. Facing Lin Dong, he sent a slash towards his throat.\u003c/p\u003e\n\u003cp\u003ePing!\u003c/p\u003e\n\u003cp\u003eWhile Luo Yi slashed towards Lin Dong’s throat, Lin Dong’s palm also exploded forth. Green coloured scales rapidly covered his palm, before he viciously grabbed Luo Yi’s palm.\u003c/p\u003e\n\u003cp\u003eSqueak! Squeak!\u003c/p\u003e\n\u003cp\u003eA sharp and powerful force crazily rushed towards Lin Dong’s palm in an attempt to corrode it. However, when it came into contact with that layer of green coloured scales, it exploded instead and created dazzling sparks.\u003c/p\u003e\n\u003cp\u003eLin Dong’s face had also turned icy-cold. Promptly, with a thought, vigorous amounts of Desolate Energy directly flowed through his arm and erupted out of his palm. Following which, they flew rapidly towards Luo Yi’s palm and started to corrode it.\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eUnder the corrosion from the Desolate Energy, Luo Yi’s bloody palm actually showed some signs of withering.\u003c/p\u003e\n\u003cp\u003e“Desolate Force? Snort, with such little ability, you actually dare to counterattack?”\u003c/p\u003e\n\u003cp\u003eLuo Yi’s vision congealed for while before he gave a cold laugh. With a thought, boundless amount of violent Yuan Power howled and erupted from his body. Following that, the blood Qi on his palm welled up crazily and actually directly scattered the Desolate Energy. With a grasp of his palm, the blood Qi immediately congealed into a serrated great blade. Grasping the blade, he chopped down viciously at Lin Dong’s head with a lighting speed.\u003c/p\u003e\n\u003cp\u003eLuo Yi’s move was extremely ruthless. Together with his blood Qi, it made his attack extremely powerful and imposing. It was obvious that he was experienced in combat.\u003c/p\u003e\n\u003cp\u003eLin Dong’s gaze was frosty and cold. He knew that he was naturally unable to compete with Luo Yi, who was at eighth Yuan Nirvana Stage, in terms of Yuan Power. Nonetheless, he had no intention of going all out. Flicking his ten fingers, green light rushed out and transformed into green coloured scales which clashed against that serrated great blade.\u003c/p\u003e\n\u003cp\u003eDing Ding Dong Dong!\u003c/p\u003e\n\u003cp\u003eSparks crazily shot out and scattered around. The power of the serrated great blade was extremely forceful and it actually directly split apart Lin Dong’s green coloured scales. However, with this slight obstruction, Lin Dong was able to drift away and leave the attack radius of the serrated great blade.\u003c/p\u003e\n\u003cp\u003eA ridiculing voice floated over, “How, brat? Where did your arrogance go now?” After his attack failed, the coldness and ruthlessness on Luo Yi’s face turn even more thick and dense.\u003c/p\u003e\n\u003cp\u003eLin Dong shot a glance at him as the coldness within his eyes suddenly grew stronger and more rigorous. Currently, although the surrounding people were being very subtle, they were all lusting after the Ancient Immortal Yuan Tree seed. However, the presence of Dao Sect made them indecisive. If he was defeated by Luo Yi now, perhaps the hesitation within their hearts might subside. Furthermore, there will also be a few who would let the greed within their hearts overwhelm their rationality…\u003c/p\u003e\n\u003cp\u003eThat was the scenario that Lin Dong truly did not want to see. For the past few years, he had experienced quite a few harrowing events. Therefore, he was naturally aware that the opponents in front of him were all ruthless people with blood on their hands. So long as he revealed the slightest fear, they would likely become even more cruel and vicious and they will likely rush forth and devour them till not a single bone is left.\u003c/p\u003e\n\u003cp\u003eTherefore, any sign of weakness must not be revealed. Even if the fellow in front was ranked sixth on the sect’s wanted list!\u003c/p\u003e\n\u003cp\u003e“If you want to steal something from me, you will have to leave something behind!”\u003c/p\u003e\n\u003cp\u003eAbruptly halting his retreat, an ominous glint appeared within Lin Dong’s eyes. He took a deep breath before his hands rapidly weaved seal after seal with lighting speed.\u003c/p\u003e\n\u003cp\u003eFollowing the fluctuations of the seals, the grey line on his forehead started to pulsate once again before splitting open. The demonic eye brimming with fiendishness slowly appeared once again.\u003c/p\u003e\n\u003cp\u003e“Chi!”\u003c/p\u003e\n\u003cp\u003eAfter his Desolate Demon Eye opened up, a grey light beam shot explosively towards Luo Yi.\u003c/p\u003e\n\u003cp\u003eAs the grey light beam shot over, Luo Yi’s malevolent face turned sluggish for a while before a rich shock filled his eyes. It was obvious that he felt a grave threat from the light beam.\u003c/p\u003e\n\u003cp\u003e“Good brat, he has some mettle after all!”\u003c/p\u003e\n\u003cp\u003eLuo Yi gave a cold laugh before raising his serrated great blade. At this moment, a low roar was transmitted out of his throat, before boundless Yuan Power bubbled up and a blade chopped down with fury.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eA teen feet blood Qi blade glow that reeked of blood erupted from Luo Yi’s great blade, before he viciously hacked the incoming grey light beam.\u003c/p\u003e\n\u003cp\u003eAt the moment of impact, wild and violent energy waves erupted outwards crazily. This caused astonishment to appear in the eyes of quite a few people. It was obvious that they had never imagined that Lin Dong, who was at five Yuan Nirvana Stage, could actually unleash such a formidable attack.\u003c/p\u003e\n\u003cp\u003e“Did he block it…”\u003c/p\u003e\n\u003cp\u003eLin Dong looked at Luo Yi and narrowed his eyes. This was the first time that his Desolate Demon Eye attack was blocked. Seems like the gap between Luo Yi and him was quite a large one…\u003c/p\u003e\n\u003cp\u003e“This brat...such a strange attack!”\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong was still reeling over the shock, a turmoil also appeared within Luo Yi’s heart. Although he managed to destroy the strange grey light beam, at the moment, his palms were secretly numb.\u003c/p\u003e\n\u003cp\u003e“There is something strange about this brat. I must finish him off quickly.”\u003c/p\u003e\n\u003cp\u003eLuo Yi took a look at the demonic eye on Lin Dong’s forehead and secretly felt uneasy. Instantly, his vision turned cold before his body suddenly exploded forward. The savage Yuan Power of an eight Yuan Nirvana Stage expert fully erupted forth. It was obvious that he wanted to kill Lin Dong as quickly as possible.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, hurry and dodge it!”\u003c/p\u003e\n\u003cp\u003eWhen Jiang Kun and the rest saw Luo Yi’s move, their facial expression changed before they frantically tried to warn Lin Dong. Although Lin Dong’s Desolate Demon Eye was indeed very powerful, the gap between him and Luo Yi was too great. If they were to really fight, Lin Dong would most likely suffer.\u003c/p\u003e\n\u003cp\u003eHowever, when Lin Dong heard their warning, he gently shook his head instead. At this juncture, if he were to show any weakness, perhaps it might overwhelm the rationality of those who were still struggling with the greed in their hearts…\u003c/p\u003e\n\u003cp\u003e“I want to see how strong an eight Yuan Nirvana Stage expert is!”\u003c/p\u003e\n\u003cp\u003eWith a frosty glint in his eyes, Lin Dong’s hand seals suddenly changed. Promptly, a strange blood trial actually seeped out from the demonic eye on his forehead while grey Qi started to bubble out. Faintly, a frightening primordial roar travelled through time and descended on this land.\u003c/p\u003e\n\u003cp\u003e“Desolate Demon Eye, Spirit of the Desolate Beast!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-679\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-681\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-680","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
