{"id":60445,"no":689,"title":"Chapter 687: Swallowing the Ancient Immortal Yuan Fruits","content":"\u003cp\u003e\u003cstrong\u003eChapter 687: Swallowing the Ancient Immortal Yuan Fruits\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eGlup.\u003c/p\u003e\n\u003cp\u003eFive bright red Ancient Immortal Yuan Fruits emitted a gulp sound as they moved down Lin Dong’s throat and were swallowed into his stomach.\u003c/p\u003e\n\u003cp\u003e“Ancient Immortal Yuan Fruit?”\u003c/p\u003e\n\u003cp\u003eWhen Yao Ling saw this scene, there was not a tinge of shock in his eyes. Instead, he shook his head somewhat pitifully as he said, “Ignorant fool. Looks like you have never seen an Ancient Immortal Yuan Fruit before. Do you know how fierce and violent the energy contained within a fruit is? Swallowing five at the same time… forget about you, it is likely that even I would not be able digest all of them…”\u003c/p\u003e\n\u003cp\u003e“You might think that your action is fearsome but it is merely just a foolish and rash act. What a stupid brat.”\u003c/p\u003e\n\u003cp\u003eYao Ling’s face had a cold smile as he stared at Lin Dong. Given the current situation, it was likely that he did not even need to take action. In fact, Lin Dong would likely be tormented by that wild and violent energy until he end up suffering a fate worse than death.\u003c/p\u003e\n\u003cp\u003eSu Lei, Luo Yi and the rest beside him were also looking at Lin Dong in a mocking manner. It was as if they were looking forward to see just how miserable the latter would be after this.\u003c/p\u003e\n\u003cp\u003e“Is that so?”\u003c/p\u003e\n\u003cp\u003eHowever, Lin Dong, who had swallowed all five Ancient Immortal Yuan Fruits in front of their gloating eyes, slowly raised his head. A mocking expression flashed across his eyes, which had a faint green glow flowing within it.\u003c/p\u003e\n\u003cp\u003e“This energy is indeed violent. However, it is not enough to do anything to me, Lin Dong. Therefore, all of you may be disappointed…”\u003c/p\u003e\n\u003cp\u003eLin Dong pressed his hands together. Following which, he placed his fingers together before numerous dazzling palm movements occurred. Soon after, a low and deep cry was emitted from his throat.\u003c/p\u003e\n\u003cp\u003e“Buzz buzz!”\u003c/p\u003e\n\u003cp\u003eWaves after waves of shockingly frightening energy fluctuation suddenly swept out from Lin Dong’s body the moment his cry sounded. Even Lin Dong’s skin turned red under this sweeping energy.\u003c/p\u003e\n\u003cp\u003e“I look forward to watching you die!” The cold smile in Yao Ling’s eyes became richer when he saw this.\u003c/p\u003e\n\u003cp\u003e“Suppress!”\u003c/p\u003e\n\u003cp\u003eThe seal formed by Lin Dong’s hands changed in a lightning like fashion. A low and deep voice also resounded within his heart.\u003c/p\u003e\n\u003cp\u003eHis voice was just like thunder that rumbled within his body. After which, the “Ancient Universe Formation” that was suspended over his Dantian started to tremble. Traces of light scattered from the ancient formation. It was just like an enormous net that directly covered the incomparably wild and violent crimson energy within Lin Dong’s body.\u003c/p\u003e\n\u003cp\u003eBang bang!\u003c/p\u003e\n\u003cp\u003eThe floodwater like crimson energy collided ruthlessly onto the large net. However, the latter did not even move a little as it firmly trapped it, causing the energy to be unable to escape or wreck havoc.\u003c/p\u003e\n\u003cp\u003e“Quieten down!”\u003c/p\u003e\n\u003cp\u003eAnother warm light erupted. It transformed into a stone talisman that was suspended above the majestic energy. Numerous light poured down. Immediately, the violence that was within the majestic energy was also swiftly washed away.\u003c/p\u003e\n\u003cp\u003e“Swallow!”\u003c/p\u003e\n\u003cp\u003eAnother low and deep cry sounded before a black ancient symbol appeared in a flash. monstrous Devouring Power erupted like a black hole.\u003c/p\u003e\n\u003cp\u003eCrash!\u003c/p\u003e\n\u003cp\u003eThe majestic bright red energy began pour into the black hole continuously. After which, it swallowed all the violence that was within it. Only then, did it transform into a vigorous energy that followed Lin Dong’s inner channels and began circulating across his body.\u003c/p\u003e\n\u003cp\u003eWith the help of the Ancient Universe Formation, the Mysterious Stone Talisman and the Devouring Ancestral Symbol, Lin Dong had basically perfectly suppressed all the savage energy within the five Ancient Immortal Yuan Fruits!\u003c/p\u003e\n\u003cp\u003eOf course, successfully suppressing it did not mean he could completely absorb them. Currently, Lin Dong was indeed unable to perform this step. What he wanted to do was not to use those five Ancient Immortal Yuan Fruits to raise his strength. Instead, he merely wanted a temporarily boost in strength.\u003c/p\u003e\n\u003cp\u003eWith this boost, he would possess fighting strength that was comparable to Yao Ling’s group!\u003c/p\u003e\n\u003cp\u003eHowever, it was extremely easy for this frightening energy that suddenly erupted, to exceed the limit that one’s body could endure. Once Lin Dong physical body was unable to endure the assault from such an enormous energy, it would become just like a balloon and explode with a “bang”.\u003c/p\u003e\n\u003cp\u003eThe vast and mighty energy was like a torrent as it surged towards all of Lin Dong’s limbs. Waves after waves of frightening energy also swiftly rose. Lin Dong could sense a piercing pain being emitted from within his veins…\u003c/p\u003e\n\u003cp\u003e“Green Heaven Materialized Dragon Skill!”\u003c/p\u003e\n\u003cp\u003eLin Dong inhaled a deep breath of air as he sensed the activity within his meridians. An unusual green light suddenly surged out from deep within his eyes.\u003c/p\u003e\n\u003cp\u003eThe green light spread towards every part of Lin Dong’s body. While the green light spread, some green scales actually quietly appeared on the inner walls within Lin Dong’s body.\u003c/p\u003e\n\u003cp\u003eThese scales were just like a defensive layer that protected Lin Dong meridians. After these scales appeared, the painful bursting sensation from his meridians was immediately halved.\u003c/p\u003e\n\u003cp\u003eCreak.\u003c/p\u003e\n\u003cp\u003eLin Dong’s hands slowly clenched tightly. An excited arc appeared onto Lin Dong’s face as he sensed the unprecedented formidable strength surging within his body.\u003c/p\u003e\n\u003cp\u003eWith the help of the three divine items within his body along with the superb strength of the Green Heaven Materialized Dragon Skill, the frightening strength generated by five Ancient Immortal Yuan Fruits was now completely under his control!\u003c/p\u003e\n\u003cp\u003eAlthough this would only last temporarily, Lin Dong would possess an unusually powerful strength during this period of time!\u003c/p\u003e\n\u003cp\u003e“Everyone, are you ready?”\u003c/p\u003e\n\u003cp\u003eLin Dong raised his eyes. Green light lingered within them as he stared at Yao Ling group, parted his mouth and smiled.\u003c/p\u003e\n\u003cp\u003e“This bastard…”\u003c/p\u003e\n\u003cp\u003eYao Ling’s group watched Lin Dong with gloomy expressions. The fluctuation around Lin Dong’s body had soared several times. Meanwhile, there was also a rich disbelief under this gloominess. They were truly unable to believe that Lin Dong was actually able to suppress the energy from five Ancient Immortal Yuan Fruits.\u003c/p\u003e\n\u003cp\u003eYao Ling’s eyes were dark and cold and some fear actually rose within his heart. The various feats done by Lin Dong caused him to feel uneasy. If this abnormally perverse fellow was allowed to keep growing, it was likely that he would become a major source of trouble in the future…\u003c/p\u003e\n\u003cp\u003eYao Ling looked at the young face of Lin Dong, which was filled with a fearsome expression. For some unknown reason, he suddenly remembered that other Dao Sect disciple. That person was a truly vicious person who once charged up to Yuan Gate alone and killed three great Elders…\u003c/p\u003e\n\u003cp\u003e“He must not be allowed to live!”\u003c/p\u003e\n\u003cp\u003eWhen he thought of this point, Yao Ling’s heart was suddenly filled with chillness. His eyes flashed before the killing intent within his eyes flared. After which, his body moved and disappeared in a peculiar fashion.\u003c/p\u003e\n\u003cp\u003eLin Dong stepped on the empty air. A greyish glow surged within the Demonic Eye between his eyebrows. He looked at Yao Ling, who had disappeared, before the corner of his mouth immediately parted. Both his arms suddenly shook before green light surged. His hands swiftly shook before finally transforming two icy cold fearsome-looking green dragon arms. Waves after waves of frightening energy were currently being channeled through both of his arms.\u003c/p\u003e\n\u003cp\u003eLin Dong’s dragon hand gripped the Immortal Yuan Ancient Tree. In the next instant, he took a step forward and directly brandished the ancient tree. It violently smashed at the area in front of him.\u003c/p\u003e\n\u003cp\u003eSqueak!\u003c/p\u003e\n\u003cp\u003eThe ancient tree tore through the air and emitted a sharp ear-piercing sound. That strength was almost lifelike...\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA fist that was wrapped around by a bright golden light also penetrated through the air and appeared in an unusual manner at the spot where the ancient tree was violently smashing towards. Finally, it carried an incomparably ferocious ripple before it clashed head on with the ancient tree.\u003c/p\u003e\n\u003cp\u003eA muffled thunder like sound spread apart in the sky. Wild and violent hurricane like energy ripple swept apart in a crazy manner before the surrounding mountains immediately cracked. Large rocks continuously rolled downwards.\u003c/p\u003e\n\u003cp\u003eChi!\u003c/p\u003e\n\u003cp\u003eTwo human figures pulled back from the energy fluctuating point. It looked as if the two were of equal strength!\u003c/p\u003e\n\u003cp\u003eWith the help of the five Ancient Immortal Yuan Fruits, the current Lin Dong was actually able to fight head on with Yao Ling!\u003c/p\u003e\n\u003cp\u003e“Worthy of being a nine Yuan Nirvana Stage expert.”\u003c/p\u003e\n\u003cp\u003eLin Dong steadied his body. He raised his head and smiled towards Yao Ling. During the head on collision, he finally understood the strength of a nine Yuan Nirvana Stage expert. If it was not because of the five Ancient Immortal Yuan Fruits’ energy supporting him, it was likely that Lin Dong would not be able to fight head on with Yao Ling.\u003c/p\u003e\n\u003cp\u003e“It is a little too early to celebrate now. Brat, I will allow you to truly witness the strength of a nine Yuan Nirvana Stage expert!”\u003c/p\u003e\n\u003cp\u003eYao Ling smiled in a dense manner before he clenched his fist. Vast and mighty Yuan Power gathered and directly formed a golden long spear. The spear was emitting an extremely fierce and brutal fluctuation.\u003c/p\u003e\n\u003cp\u003e“Chi chi!”\u003c/p\u003e\n\u003cp\u003eYao Ling rushed out with a lightning like speed. The long spear within his hand transformed into numerous spear shadows that covered Lin Dong in a storm like manner.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eHowever, just when his spear shadow was about to reach Lin Dong’s body, the latter suddenly moved and disappeared.\u003c/p\u003e\n\u003cp\u003e“Ah!”\u003c/p\u003e\n\u003cp\u003eYao Ling heard a sharp miserable screech from behind him when Lin Dong’s figure had just disappeared. He hurriedly turned his head, only to see a seven Yuan Nirvana Stage expert from the Devil Seal Mass being smashed by Lin Dong’s ancient tree. Thanks to his frightening strength, he had actually directly smashed both of his hands into a blood pulp.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eAfter having swung the ancient tree explosively towards one of them, Lin Dong raised his head and revealed a ferocious smile towards Yao Ling. After which, he rushed towards another seven Yuan Nirvana Stage expert.\u003c/p\u003e\n\u003cp\u003eLin Dong did not plan to be entangled with Yao Ling from the beginning. After his strength surged explosively, the current him could kill all these seven Yuan Nirvana Stage experts. Since this was the case, he would naturally need to clear the place. He wanted to kill all these people until not even their souls remain!\u003c/p\u003e\n\u003cp\u003eA horrified expression surfaced in the eyes of the other seven Yuan Nirvana Stage expert when he saw Lin Dong charging over towards him. However, he was also a ruthless individual and he did not retreat. Instead, he held a large blade in his hand. With a stern cry, a sharp blade glow violently hacked towards Lin Dong.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eThe black large tree danced and directly shattered the blade glow. After which, it was accompanied by an enormous shadow as it violently smashed towards the seven Yuan Nirvana Stage expert’s head. Immediately, his brains were blown apart.\u003c/p\u003e\n\u003cp\u003eA bloody rain danced over the sky. Luo Yi, Su Lei and the rest looked at the young man, who was bathing in the bloody rain, with a shaken expression. At this moment, even they felt a chillness surging within their hearts…\u003c/p\u003e\n\u003cp\u003e“Little bastard. Your father will tear you into tens of thousands of pieces today!”\u003c/p\u003e\n\u003cp\u003eYao Ling watched two of his subordinates being finished off by Lin Dong within the blink of an eyes, before his eyes immediately became bloody red. After which, a roar that was filled with fury and churning murderous intent resounded in the sky.\u003c/p\u003e\n\u003cp\u003eThis ruthless person, who was ranked fourth on the sect wanted list had finally completely erupted in fury at this moment because of Lin Dong!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-686\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-688\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-687","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
