{"id":59826,"no":70,"title":"Chapter 70: Mind-blowing","content":"\u003cp\u003eWDQK Chapter 70: Mind-blowing\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eVigorous Yuan Power burst out from within Wu Sha’s body as he thrust out his palm, causing the Lin Family guard before him to spit out a mouthful of blood, while being thrown backwards. Wu Sha once again laughed maliciously as he lifted his leg and ferociously stomped down at another terrified guard’s head. If this attack went through, the guard’s brains would be splattered on the spot.\u003c/p\u003e\n\u003cp\u003e“Swoosh!”\u003c/p\u003e\n\u003cp\u003eHowever, just as Wu Sha was moments away from stomping down, a whistling noise suddenly sounded out. His hand quickly moved as he caught the broken spear that came hurtling towards him. Wu Sha lifted his head, only to see a thin figure of a youngster calmly standing at a distance away. That boy’s eyes were tightly locked onto Wu Sha.\u003c/p\u003e\n\u003cp\u003e“Heh heh, this Lin Family is truly pathetic. To think that they’d send a brat who is still wet behind the ears. Did they think that I would be merciful towards children?” Casually tossing aside the broken spear, Wu Sha kicked away the guard at his feet before he turned and smiled maliciously at Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Young master Lin Dong!”\u003c/p\u003e\n\u003cp\u003eThe surrounding Lin Family guards hastily shouted out upon seeing this scene. Qin Ying, who had accompanied Lin Dong several times, swiftly charged forward with some men to stand in front of Lin Dong, and block Wu Sha away from him .\u003c/p\u003e\n\u003cp\u003e“Leave quickly young master Lin Dong, Wu Sha is at Heavenly Yuan Early Stage, we will not be able to hold him off for long!”\u003c/p\u003e\n\u003cp\u003eA small smile formed on Lin Dong’s lips as he looked at the Lin Family Guards in front of him. They were willing to risk their lives to ensure his safety. Yet, he did not comply with Qin Ying’s words. Instead, he stepped forward and said: “Uncle Qin Ying, bring your men to deal with the other Black Dragon Stockade bandits. I will stop Wu Sha.”\u003c/p\u003e\n\u003cp\u003eUpon hearing these words, Qin Ying and the rest of the Lin Family guards immediately turned pale with fright. Though they wanted to try and dissuade him, they suddenly saw waves of vigorous Yuan Power start to bubble forth from within Lin Dong’s body.\u003c/p\u003e\n\u003cp\u003e“Earthly Yuan Late Stage!”\u003c/p\u003e\n\u003cp\u003eAs they felt this vigorous Yuan Power, Qin Ying and the rest were once again shocked. They never thought that Lin Dong had actually managed to reach this stage in less than a year.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, I won’t intentionally seek my own demise…”\u003c/p\u003e\n\u003cp\u003eLin Dong smiled at Qin Ying and the rest, then, without further ado, he strode forward and stopped right in front of that big and burly Wu Sha.\u003c/p\u003e\n\u003cp\u003eIt was definitely not easy to advance from Earthly Yuan Stage to Heavenly Yuan Stage. Even after three months of tough training, Lin Dong had yet to feel any signs of a breakthrough.\u003c/p\u003e\n\u003cp\u003eHowever, although he had not reached Heavenly Yuan Stage, it did not mean that Lin Dong was completely powerless before Wu Sha, even though the latter was already at Heavenly Yuan Early Stage. That was because Lin Dong had absorbed the special Yin Energy from Qing Tan’s body, hence the Yuan Power in his body was incomparable to a normal person’s. Together with his proficiency in martial arts, matching up against a Heavenly Yuan Early Stage expert was not an impossible feat.\u003c/p\u003e\n\u003cp\u003e“Earthly Yuan Late Stage?”\u003c/p\u003e\n\u003cp\u003eAstonishment flashed across Wu Sha’s sinister face, as he gazed at the youngster before him. He never expected that this youngster in front of him could advance to such a level. It seems like a genius was unexpectedly hidden within this Lin Family.\u003c/p\u003e\n\u003cp\u003e“According to this brat’s growth, it would only take one or two years at most for him to reach Heavenly Yuan Stage. It is also possible that he might even become a Yuan Dan practitioner in the future…” A malicious glint flickered in Wu Sha’s eyes as a murderous intent gushed in his heart. Since the Black Dragon Stockade completely turned the Lin Family into their enemies today, if the Lin Family produced a Yuan Dan Stage practitioner in the future, it would undoubtedly be a disaster for them.\u003c/p\u003e\n\u003cp\u003eIt would be best to eliminate the possibility of such a disaster as soon as possible.\u003c/p\u003e\n\u003cp\u003eWith these thoughts in mind, the sinister look on Wu Sha’s face turned even uglier. He looked at Lin Dong with a grotesque smile as he muttered: “Though I’ve killed many people, I have yet to try killing a genius like you. I wonder what it will feel like?”\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eBarely after these words left his mouth, Wu Sha’s body violently charged forward. Vigorous Yuan Power condensed in the hollow of his palm as he ferociously swiped at Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Chun Yuan Finger!”\u003c/p\u003e\n\u003cp\u003eFaced with Wu Sha’s attack, Lin Dong’s expression turned serious as the Yuan Power in his Dan Tian rapidly converged. Finally, his two fingers slightly curled and like a resplendent ray of light, they forcefully jabbed towards Wu Sha’s palm.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eFinger and palm clashed together, emitting a wave of Yuan Power which spread out like a ripple, blowing the crushed and broken rocks on the ground away.\u003c/p\u003e\n\u003cp\u003e“Deng deng!”\u003c/p\u003e\n\u003cp\u003eThough the contact only lasted a split second, Lin Dong rapidly took a few steps backwards before forcefully stabilizing himself. On the other hand, Wu Sha was only pushed half a step back. The superiority of Heavenly Yuan Stage was clear as day.\u003c/p\u003e\n\u003cp\u003e“There’s something weird about this brat!”\u003c/p\u003e\n\u003cp\u003eThough he was only forced to take half a step back, Wu Sha’s expression gradually turned somewhat worried. In the brief exchange earlier, he had distinctly felt an extremely cold Yin presence within the other party’s Yuan Power. That thread of cold Yin had penetrated into his body, corroding it from within. If he had not already assimilated Yang Energy in his body, Wu Sha would have been caught unprepared and end up slightly disadvantaged.\u003c/p\u003e\n\u003cp\u003e“Something unexpected may happen if I wait, it’s best to finish him off immediately!”\u003c/p\u003e\n\u003cp\u003eAn icy light flashed in Wu Sha’s eyes, his already huge hands unexpectedly expanded as Vigorous Yuan Power swiftly bubbled out. Then, the sole of his foot pushed off the ground, the strong force directly causing a crack to form on the ground, as his body borrowed the resulting momentum to arrive in front of Lin Dong in a flash!\u003c/p\u003e\n\u003cp\u003e“Wind Ripping Hand!”\u003c/p\u003e\n\u003cp\u003eWu Sha’s massive body practically eclipsed Lin Dong as the dreadful power in the former’s right palm abruptly exploded forth. In that instance, it was as if the air had been ripped into two. The sharp sonic boom spread out with a “wu wu” sound, causing the surrounding onlookers’ expression to change drastically.\u003c/p\u003e\n\u003cp\u003eThe ear-piercing sound reverberated in Lin Dong’s eardrum. At this moment, he sensed extreme danger. Both his eyes were glued onto the palm that was rapidly enlarging as he frantically pulled out the Yuan Power that was stored in his Dan Tian and directed it towards both his palms.\u003c/p\u003e\n\u003cp\u003eIn response to Lin Dong’s frantic actions, the Yuan Power in his Dan Tian was quickly exhausted.\u003c/p\u003e\n\u003cp\u003e“It’s not enough!”\u003c/p\u003e\n\u003cp\u003eUpon sensing this, a slight madness crept into Lin Dong’s eyes as he gritted his teeth and let loose a low roar in his heart. The two Yang Yuan Pills which were previously hidden beneath his tongue were straightaway swallowed into his body\u003c/p\u003e\n\u003cp\u003eAs the two Yang Yuan Pills entered into his body, a pure medicine power speedily proliferated throughout his body. At the same time, Lin Dong also increased the output of QingYuan Art to continuously absorb the Yuan Power between Heaven and Earth.\u003c/p\u003e\n\u003cp\u003eWith this two pronged approach, the undulating Yuan Power at Lin Dong’s palms grew more and more violent as his hands quickly formed a series of seals in succession.\u003c/p\u003e\n\u003cp\u003eWonder Gate Seal First Chapter, Second Chapter!\u003c/p\u003e\n\u003cp\u003eWhen the seals reached the Second Chapter, a fierce look flashed across Lin Dong’s eyes. Without stopping, the seals once again continued to change!\u003c/p\u003e\n\u003cp\u003e“Die brat!”\u003c/p\u003e\n\u003cp\u003eThe dreadful force contained within the palm had almost reached Lin Dong. In that instance, Lin Dong also lifted his head, as the changing seals came to a halt. Then, his hands maintained a mysterious seal position as they generated an exceptionally vigorous Yuan Power to forcefully clash against Wu Sha’s palm, under the horror and amazement of the surrounding onlookers.\u003c/p\u003e\n\u003cp\u003eWonder Gate Seal, Third Chapter!\u003c/p\u003e\n\u003cp\u003e“Lin Dong!”\u003c/p\u003e\n\u003cp\u003eNearby, Lin Xia and the rest shrieked as they saw this scene, their faces deathly white.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eA screech rang out as a powerful gale originated from their point of contact, causing a layer of broken rocks to be forcefully swept up and violently shot outwards.\u003c/p\u003e\n\u003cp\u003eSuch a violent clash straightaway caused the entire chaotic scene to lapse into silence. Even the intense battle between Lin Ken and Yan Kuo on the manor wall came to a halt, as each party withdrew a few steps back and turned their gazes towards the commotion.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eAs their gazes darted over, a figure was suddenly thrown backwards out of the dust cloud before heavily crashing to the ground, smearing an unsightly trail of blood in his path.\u003c/p\u003e\n\u003cp\u003e“Heh!”\u003c/p\u003e\n\u003cp\u003eA mouthful of blood sprayed out from the figure’s mouth as he landed on the ground. Everyone’s gazes instantly concentrated on his body, the entire chaotic scene turning deathly still in that moment. Disbelief coloured their eyes.\u003c/p\u003e\n\u003cp\u003eThis was because the seriously injured and hideous person lying on the ground was not Lin Dong, but rather the second in command of the Black Dragon Stockade, Wu Sha!\u003c/p\u003e\n\u003cp\u003eQingyang Town’s infamous Heavenly Yuan Stage expert had unexpectedly lost to Lin Dong!\u003c/p\u003e\n\u003cp\u003eOne could do nothing but admit that this outcome was way too mind-blowing!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-69\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-71\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-70","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
