{"id":60473,"no":717,"title":"Chapter 715: Clash of the Top","content":"\u003cp\u003e\u003cstrong\u003eChapter 715: Clash of the Top\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAn uproar rapidly spread across the mountain top, and in the end, innumerable gazes instantly turned fiery hot. With a swishing noise, all of them turned towards the area where Lin Dong and Qing Ye were.\u003c/p\u003e\n\u003cp\u003eThe two that were about to battle had extremely high prestige within the Dao Sect. Qing Ye was no doubt the the number one person in the Earth Hall. Even within the younger generation of the Dao Sect, he was known as a genius that was second only to Ying Xiaoxiao. As such, one could tell just how talented he was.\u003c/p\u003e\n\u003cp\u003eSimilarly, although Lin Dong might fall short of Qing Ye based on seniority, the various miracles he had brought about were enough to let anyone forgot his status as newcomer. His success in comprehending the Great Desolation Scripture cemented his title as the number one person of the Desolate Hall, and even Pang Tong and the rest had no objections.\u003c/p\u003e\n\u003cp\u003eThe two of them were the finest younger generation members of the Dao Sect. Their fight was basically a battle between the best of the two halls, and might even decide the rankings of the halls after this Hall Competition.\u003c/p\u003e\n\u003cp\u003eAs for who would become the eventual victor, everyone was obviously extremely curious to find out...\u003c/p\u003e\n\u003cp\u003eAt the Earth Hall area, Qing Ye had his hands behind his back, and his face was as calm as still water. The gaze he sent towards Lin Dong was dark and gloomy. As long as he could end Lin Dong’s legend, Lin Dong would likely no longer be intertwined with Ying Huahuan.\u003c/p\u003e\n\u003cp\u003e“Go for it senior brother Qing Ye!”\u003c/p\u003e\n\u003cp\u003eThe expressions of the Earth Hall disciples behind Qing Ye were filled with excitement as they cheered in loud voices. Although Lin Dong’s prestige was currently at its peak, as Earth Hall disciples, they clearly still had more confidence in Qing Ye.\u003c/p\u003e\n\u003cp\u003eQing Ye gave a faint smile, before he flew towards the stage. Upon reaching, he lifted his head and looked directly at Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Junior brother Lin Dong, this will be a hard battle. From what I’ve heard, this Qing Ye had attempted the Nine Yuan Nirvana stage before the Hall Competition. Although he failed in the end, his strength has already far surpassed ordinary peak Eight Yuan Nirvana stage practitioners. Coupled with his successful mastery of one of the four great mysterious scriptures, ‘Earth Emperor’s Scripture’, his combat capabilities will be extraordinary. You have to be more careful.” Pang Tong cautioned Lin Dong after looking at Qing Ye with a serious expression.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eLin Dong faintly nodded his head. He naturally knew that Qing Ye was not easy to deal with. Truth be told, his combat capabilities would certainly far exceed Huo Zhen of the Great Precipice Cave. When facing such an opponent, even he would not harbor any thoughts of contempt.\u003c/p\u003e\n\u003cp\u003e“Senior brother Lin Dong, it’s all up to you! You have the full support of all of us Desolate Hall disciples!”\u003c/p\u003e\n\u003cp\u003eThe surrounding Desolate Hall disciples felt somewhat emotional as they shouted out in unison. The current Lin Dong had already become the symbol of their Desolate Hall. This battle would become the deciding factor on whether they would finally be able to happily celebrate after being stuck as last place for so long…\u003c/p\u003e\n\u003cp\u003eTheir Desolate Hall had always ended up last place for every Hall Competition over the past few years. With such results, some mockery was naturally unavoidable. Although the Desolate Hall disciples were extremely angry due to this, they did not have any solution. Though the Great Desolation Scripture was known as the strongest martial art within the Dao Sect, it was way too difficult, causing it to become more akin to an ornament. If it could not be comprehended, it would not matter how powerful it was.\u003c/p\u003e\n\u003cp\u003eThis undoubtedly caused the top Desolate Hall disciples to suffer gigantic losses when matched against their counterparts from the other halls that had successfully comprehended the other three great mysterious scriptures. Therefore, the Desolate Hall always ended up last amongst the four halls. Although they were not resigned to being suppressed in such a manner, they could do nothing about it.\u003c/p\u003e\n\u003cp\u003eHowever, the appearance of Lin Dong had broken this endless loop. The Great Desolation Scripture had once again appeared, and this roused the hearts of all of the Desolate Hall disciples. His appearance had once again given them the confidence to challenge the rankings…\u003c/p\u003e\n\u003cp\u003eAs he felt the numerous earnest gazes from his surroundings, Lin Dong breathed out lightly, before giving a faint nod towards Pang Tong and the rest. With a flash of his body, he dashed onto the stage in the same fashion as Qing Ye under the many watching eyes of the crowd.\u003c/p\u003e\n\u003cp\u003eOn the stage, the two figures stood facing the other. As their gazes intersected, sparks seemed to appear. Although they had yet to begin, the Yuan Power around them had already started to boil.\u003c/p\u003e\n\u003cp\u003eAt this moment, this particular stage had no doubt turned into the focal point of the entire place. Even Ying Xuanzi and the four hall masters atop the taller platform had shifted their gazes over.\u003c/p\u003e\n\u003cp\u003e“Big sis, who is more likely to win among the two of them?”\u003c/p\u003e\n\u003cp\u003eYing Huanhuan had finally recovered from her previously humiliated and angry state. As she gazed at the two people on stage who both gave off formidable auras, she could not resist and asked.\u003c/p\u003e\n\u003cp\u003e“It’s hard to say.”\u003c/p\u003e\n\u003cp\u003eThere were some traces of seriousness within Ying Xiaoxiao’s pupils while she stared at the two people on the stage, as she continued in a soft voice, “Although Lin Dong has successfully comprehended the Great Desolation Scripture, his Yuan Power is after all inferior to Qing Ye’s. Although the latter failed to breakthrough to the Nine Yuan Nirvana stage, his strength far exceeds ordinary peak Eight Yuan Nirvana stage experts. Moreover, although Lin Dong has the Great Desolation Scripture, Qing Ye also has the Earth Emperor Scripture… therefore, it is still somewhat early to decide who the eventual victor will be.”\u003c/p\u003e\n\u003cp\u003e“However… who do you want to win?” Ying Xiaoxiao suddenly asked as she playfully stared at Ying Huanhuan.\u003c/p\u003e\n\u003cp\u003eYing Huanhuan was stunned for a while by the sudden question that had come out of nowhere. If it was before, her relationship with Qing Ye was not bad, and she would clearly lean towards him. After all, the two of them had known each other for many years, and their relationship was better than ordinary friends. However, she suddenly found that she was unexpectedly unable to quickly give a definite answer now.\u003c/p\u003e\n\u003cp\u003eShe was obviously extremely angry due to Lin Dong’s earlier actions. However, when such a moment came, she realized that her desire to see Lin Dong fail was not as intense as she had expected.\u003c/p\u003e\n\u003cp\u003e“I… I don’t know.”\u003c/p\u003e\n\u003cp\u003eThe young lady’s gaze turned evasive for a while, before she mumbled her reply.\u003c/p\u003e\n\u003cp\u003eYing Xiaoxiao looked deeply into the young lady’s evasive eyes, and did not speak any further about the topic. Instead, she said, “Then continue watching. There will be a victor in the end.”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eOn the stage where everyone’s gazes were focused, Qing Ye calmly gazed at Lin Dong and spoke in an indifferent manner, “You did not disappoint me after all. I had originally believed that you would not be able to reach this stage.”\u003c/p\u003e\n\u003cp\u003eLin Dong frowned a little at Qing Ye’s tone. He knew that Qing Ye detested him due to certain reasons related to Ying Huanhuan. However he had never imagined that it would reach such a degree.\u003c/p\u003e\n\u003cp\u003e“Many thanks for the concern senior brother Qing Ye, however, I believe that my journey will not end here.” Since Qing Ye’s words were so hostile, Lin Dong decided not to be overly polite and immediately retorted.\u003c/p\u003e\n\u003cp\u003e“Haha, perhaps it is not up to you to make such a decision.”\u003c/p\u003e\n\u003cp\u003eQing Ye smiled faintly, while a formidable glint flashed in his eyes. He slowly took a step forward, as an aura that was several times more vigorous than Huo Zhen’s slowly unfurled from his body like floodwaters.\u003c/p\u003e\n\u003cp\u003e“Lin Dong, if you lose this match, reduce your interactions with Huanhuan.”\u003c/p\u003e\n\u003cp\u003eA violent and ferocious aura coalesced into an oppressive force that enveloped Lin Dong while Qing Ye’s lips moved, and a faint voice was transmitted into Lin Dong’s ears.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyebrows were tightly knitted together. He stared at Qing Ye, as he slowly replied, “First, let me inform you that she and I are only friends. Moreover, if this is how you express your feelings for someone, I can only say that it is really disappointing.”\u003c/p\u003e\n\u003cp\u003eQing Ye’s complexion became interlaced with green and white due to Lin Dong’s words. Moments later, fury gushed up in his eyes as he spoke in a low voice, “I don’t need you to teach me how I should do things. Since you’re refuse to listen, don’t blame me for ending your miraculous journey here!”\u003c/p\u003e\n\u003cp\u003eLin Dong shook his head. Looks like Qing Ye was too deeply infatuated with Ying Huanhuan. However, his ways were somewhat extreme.\u003c/p\u003e\n\u003cp\u003eIt was obvious that anything Lin Dong said would be useless due to Qing Ye’s present state. Therefore, Lin Dong did not bother speaking any further. He stared at Qing Ye and deeply breathed in as a thick green glow started to surge on his body. Green dragon scales were now faintly discernible on his skin.\u003c/p\u003e\n\u003cp\u003e“Start the match!”\u003c/p\u003e\n\u003cp\u003eAfter seeing such a situation, the deacon that was hovering above the stage faintly nodded his head. Soon after, a low and deep voice echoed downwards.\u003c/p\u003e\n\u003cp\u003e“I’ve already given you a chance, yet you refuse to grasp it. As such, I can only use my way to let you know that you should back off. I’ll defeat you in front of her!”\u003c/p\u003e\n\u003cp\u003eThe instant Qing Ye’s voice faded, his eyes darkened substantially. With a grasp of his hand, boundless Yuan Power swept out without reservation from his body, and with a stamp of his foot, his body tore through the air and appeared in front of Lin Dong. A vicious punch blasted apart the air, bringing with it an astonishing might as it approached Lin Dong at lighting speed.\u003c/p\u003e\n\u003cp\u003eThe hostile atmosphere on the stage had finally exploded at this moment!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-714\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-716\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-715","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
