{"id":60476,"no":720,"title":"Chapter 718: Dragon Wings","content":"\u003cp\u003eCountless pairs of eyes were directed to the sky, where an enormous blood seal earth sphere was floating. Wave after wave of extremely frightening fluctuations continuously scattered from the earth sphere, causing one’s heart to tremble.\u003c/p\u003e\n\u003cp\u003eThe atmosphere around the stage was somewhat quiet, while many people looked to each other. Based on the scene in front of them, it seemed as if Lin Dong had lost?\u003c/p\u003e\n\u003cp\u003e“Junior brother Lin Dong, if you admit defeat now, I will let you out. However, if you continue to resist, not only will you fail to change the final outcome, it will only hurt you further.” Qing Ye stared at his earth sphere, while his indifferent voice reverberated over the area.\u003c/p\u003e\n\u003cp\u003eHowever, the earth sphere remained silent after Qing Ye spoke. There was no reply at all.\u003c/p\u003e\n\u003cp\u003e“In that case, do not blame me for forcing you to admit defeat!”\u003c/p\u003e\n\u003cp\u003eQing Ye’s eyes darkened a little when he saw this. Promptly, he extended his hand. Just as he was about to clench his fist, the earth sphere hovering in the sky suddenly shook intensely. A low and deep muffled sound echoed from within.\u003c/p\u003e\n\u003cp\u003eThis sudden and unexpected change caused Qing Ye to frown slightly. He spoke in a cold voice, “Are you still unwilling to admit defeat even until now?”\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eAnother low and deep muffled sound was emitted from within the earth sphere. The round surface of the sphere appeared to vaguely protrude a little.\u003c/p\u003e\n\u003cp\u003e“Humph.”\u003c/p\u003e\n\u003cp\u003eQing Ye’s expression darkened slightly, while his eyes flickered for a moment. For some unknown reason, unease gushed out from within his heart. Immediately, he stepped forward, as his hand pointed at the earth ball and viciously clenched it.\u003c/p\u003e\n\u003cp\u003eBuzz buzz!\u003c/p\u003e\n\u003cp\u003eWhen Qing Ye clenched his hand, the blood symbols on the earth ball immediately spread apart like a spider web. Numerous blood lines firmly wrapped the earth sphere like a web.\u003c/p\u003e\n\u003cp\u003eBang! Bang! Bang!\u003c/p\u003e\n\u003cp\u003eHowever, after Qing Ye completed these steps, the low and muffled sound from within the earth sphere did not weaken. Instead, it became increasingly stronger and hurried. The sound seemingly had the magical ability to stir one’s heart, causing the faces of quite a number of people to turn pale.\u003c/p\u003e\n\u003cp\u003eQing Ye’s expression was somewhat dark and gloomy when he saw this scene. Clearly, the situation had not unfolded the way he had expected…\u003c/p\u003e\n\u003cp\u003e“Something is wrong…”\u003c/p\u003e\n\u003cp\u003eYing Xiaoxiao’s expression was also a little grave as she stared at the earth sphere that was trembling continuously in the sky. There was an additional trace of surprise in her voice.\u003c/p\u003e\n\u003cp\u003eYing Huanhuan similarly felt that something was not quite right. Her large eyes stared intently at the sky, some anxiety was present within her eyes.\u003c/p\u003e\n\u003cp\u003eBang bang!\u003c/p\u003e\n\u003cp\u003eThe low and deep sounds from within the blood seal earth sphere became increasingly hurried. It shook the entire earth sphere until the sphere started to tremble violently. The blood symbols on the surface of the earth ball also quietly dimmed because of this commotion.\u003c/p\u003e\n\u003cp\u003eThe unusual scene in the sky was being sensed by an increasing number of people. Immediately, low exclamations sounded out continuously and quite a number of disciples stood up. Their eyes were shocked as they watched this change.\u003c/p\u003e\n\u003cp\u003e“Dong!”\u003c/p\u003e\n\u003cp\u003eAnother extremely fierce muffled sound appeared. Some sharper individuals saw a crack appear on the surface of the earth sphere.\u003c/p\u003e\n\u003cp\u003e“Senior brother Qing Ye’s Earth Dragon Divine Sealing Palm is actually unable to seal Lin Dong…”\u003c/p\u003e\n\u003cp\u003eShock involuntarily surfaced within the eyes of some Dao Sect disciples when they saw a crack appear. They truly did not know how Lin Dong was able to break the Earth Dragon Divine Sealing Palm when his Yuan Power was being suppressed.\u003c/p\u003e\n\u003cp\u003eQing Ye’s expression turned exceptionally grim at this moment. The rate at which his hand seal changed increased in an attempt to control the blood coloured symbols and stabilize the seal.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eHowever, his attempts at salvaging the situation did not have much of an impact. As the low and deep sound continuously sounded out, the cracks on the earth sphere also began to spread rapidly. Finally, they spread across the entire earth sphere, making it look like a porcelain ball that was about to burst.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eCracks spread rapidly. In the end, green light suddenly appeared, shooting out from within the cracks, like the sharp spikes of a hedgehog, covering the earth sphere.\u003c/p\u003e\n\u003cp\u003e“The seal is about to break…” Several onlookers’ eyelids twitched rapidly upon seeing this scene. Their eyes were filled with a rich disbelief.\u003c/p\u003e\n\u003cp\u003eCries of shock rang out as the green lights that erupted from the earth sphere abruptly reached their peak. After which, like an erupting volcano that had been suppressed for a long time, the green light exploded.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eA thunderous sound rumbled and spread across the sky. After which, everyone watched as the earth sphere was finally completely blasted to pieces.\u003c/p\u003e\n\u003cp\u003eEveryone’s attention was focused on the spot where the green light gathered. A human figure became increasingly clear as the green light vanished. Finally, it clearly appeared under everyone’s gazes…\u003c/p\u003e\n\u003cp\u003eHiss!\u003c/p\u003e\n\u003cp\u003eWhen that figure gradually became clear, a series of gasps sounded out across the entire mountaintop…\u003c/p\u003e\n\u003cp\u003eGreen light gathered in the sky. A figure, which was twice as large as before, slowly walked out. This figure was naturally Lin Dong, who had broken free from the seal. However, this time around, in addition to his two green dragon arms, the surface of his body was also covered by green scales. Of course, the most eye-catching part was the pair of extremely large green dragon wings on his back.\u003c/p\u003e\n\u003cp\u003eThe dragon wings were several feet long and were covered in green scales. A sharp bone extended from the edge of each wing, while an intensely cold light faintly flashed on its surface.\u003c/p\u003e\n\u003cp\u003eThe dragon wings gently spread apart. With a gentle flap, violent gales gathered as a piercing wind sound continuously sounded out.\u003c/p\u003e\n\u003cp\u003eLin Dong’s present appearance could be described as powerful and fearsome. As he spread the pair of green dragon wings on his back, it looked as if an ancient dragon had descended.\u003c/p\u003e\n\u003cp\u003eLin Dong had been practicing the Green Heaven Materialized Dragon Skill for quite some time. As his physical body grew increasingly powerful, the amount of Heaven Dragon aura that he could absorb also increased. This allowed more and more parts of his body to turn into that of a dragon. Currently, dragon wings had appeared and this was undoubtedly a joyous occasion for Lin Dong.\u003c/p\u003e\n\u003cp\u003eQing Ye looked at Lin Dong, whose body had became much larger, as panic flashed across his eyes. This unexpected development had totally left him dumbfounded. After all, he had never imagined that he would be unable to defeat Lin Dong even after using such a powerful killing move…\u003c/p\u003e\n\u003cp\u003eWhile Qing Ye’s expression was changing in a volatile manner, Lin Dong slowly lowered his head. Green light lingered in his eyes as they locked onto the former.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eThe green dragon wings on Lin Dong’s back flapped gently. An afterimage remained in the sky while Lin Dong’s body strangely disappeared.\u003c/p\u003e\n\u003cp\u003e“Fast!”\u003c/p\u003e\n\u003cp\u003eQing Ye’s pupils abruptly tightened, while his expression became extremely ugly. He had been unable to sense how Lin Dong had disappeared. It seemed like the latter was much faster than before!\u003c/p\u003e\n\u003cp\u003eQing Ye’s eyes flashed. However, he was still someone with ample experience. In the next moment, he suddenly sensed a slight ripple from his left. Immediately, his hand seals changed. Vigorous Yuan Power surged out and transformed into an extremely thick yellow earth shield on his left.\u003c/p\u003e\n\u003cp\u003eThe earth shield that was agglomerated from Yuan Power had just taken shape when Qing Ye saw a shadow appear from the corner of his eyes. However, just as he was about to sigh in relief, he saw a cold arc on Lin Dong’s face. Immediately, Lin Dong’s figure emitted a swoosh sound as he disappeared again.\u003c/p\u003e\n\u003cp\u003eThe instant Lin Dong disappeared, the corners of Qing Ye’s eyes darted. Immediately, he saw a fist that was covered by green dragon scales. It was accompanied by an extremely wild and violent force as it tore through the air from another angle and violently punched towards him.\u003c/p\u003e\n\u003cp\u003eIn that split second, Lin Dong relied on his phantom-like speed to change the direction of his attack, causing Qing Ye’s defences to be rendered completely useless.\u003c/p\u003e\n\u003cp\u003e“Earth Emperor Armour!”\u003c/p\u003e\n\u003cp\u003eHowever, just as Lin Dong’s fist was about to land on Qing Ye’s body, a yellow glow flashed from within it, and an ancient looking armour suddenly appeared. The rather powerful ripple it gave off indicated that it was a Heavenly Soul Treasure.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eLin Dong’s dragon fist landed ruthlessly on the armour as a low and deep sound echoed forth. Immediately, the ground where they were at exploded, as numerous cracks spread out at lightning-like speed.\u003c/p\u003e\n\u003cp\u003eA frightening strength wildly poured onto Qing Ye’s body. Even with the protection of his ‘Earth Emperor Armour’, he was still forced to retreat over a dozen steps due to this single punch from Lin Dong. Promptly, a muffled voice emerged from his throat.\u003c/p\u003e\n\u003cp\u003e“Earth Core Heavenly Yuan Hand!”\u003c/p\u003e\n\u003cp\u003eQing Ye’s expression turned red after being forced back. Promptly, his hands suddenly pressed onto the ground. A large deep yellow hand broke out from the cracked ground. It was accompanied by an increasingly violent force as it furiously swatted at Lin Dong.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eWhen Lin Dong saw the large hand that rapidly magnified in his eyes, he did not retreat at all. His foot stomped onto the ground as his body shot forward explosively. When they were about to make contact, his right leg suddenly swelled and transformed into a large green dragon foot, which kicked out like a whip.\u003c/p\u003e\n\u003cp\u003eHis leg had barely left the ground, but the ground beneath had already split open, leaving behind a deep crack that was a dozen feet long.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eGreen light overflowed from Lin Dong’s dragon leg, and it seemed as if a faint dragon roar was emitted from within the green light. Soon after, his leg viciously landed on the giant deep yellow hand. A terrifying strength poured out, directly destroying the giant deep yellow hand.\u003c/p\u003e\n\u003cp\u003eQing Ye’s expression changed drastically when he saw this scene, and he once again retreated rapidly.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eHowever, his body was just about to retreat when Lin Dong appeared in front of him like a ghost. With a cold look in his eyes, the frightening green dragon leg drew numerous afterimages that landed on Qing Ye’s body.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eQing Ye’s body flew backwards in front of countless pairs of eyes. The ‘Earth Emperor Armour’ on his body also disappeared after flickering a few times.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eIn the end, Qing Ye’s body sorrily landed outside of the stage. His body smashed into the ground, causing a low and deep sound. This caused the eyes of quite a number of people to twitch rapidly. Meanwhile, his face was also filled with rich disbelief.\u003c/p\u003e\n\u003cp\u003eOut of bounds. Defeat.\u003c/p\u003e\n\u003cp\u003eLin Dong’s direct and efficient fighting method had completely obliterated Qing Ye’s defences and attacks in a few rounds. It was relatively quiet on the mountain top. Countless pairs of eyes were gathered on the figure atop the stage. A respectful expression gradually climbed out from within their eyes. Soon after, a thunderous cheer suddenly resounded across the skies above the mountaintop!\u003c/p\u003e\n\u003cp\u003eThe fight between the strongest disciples from two different halls had finally concluded.\u003c/p\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cbr\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-717\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-719\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-718","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
