{"id":59832,"no":76,"title":"Chapter 76: Mysterious Beast Bones","content":"\u003cp\u003eWDQK Chapter 76: Mysterious Beast Bones\u003c/p\u003e\n\u003cp\u003e“Yang Energy?”\u003c/p\u003e\n\u003cp\u003eThis discovery caused Lin Dong to be instantly taken back, however his eyebrows promptly furrowed. He had realized that this Yang Energy seemed extraordinarily berserk and savage. If one absorbed too much of this substance, it would wreck havoc on one’s mind and body.\u003c/p\u003e\n\u003cp\u003e“This place used to be a volcano. Therefore, it is not strange that such a potent Yang Energy exists here. However, it’s a pity…”\u003c/p\u003e\n\u003cp\u003eNaturally, it was a pity that there were berserk elements contained within the Yang Energy inside the crevice. After all, who would dare to absorb such a savage Yang Energy?\u003c/p\u003e\n\u003cp\u003eAs Lin Dong poked about at the crevice entrance, a disappointed expression surfaced on his face. After half a month of searching for this kind of special Yang Energy, he was very reluctant to give up so easily now that he had finally found such a unique Yang Energy.\u003c/p\u003e\n\u003cp\u003e“Uncle Qin Ying, stand guard here with everyone else. Do not let anyone enter. I will go in and have a look.” Lin Dong tilted his head towards Qin Ying and said.\u003c/p\u003e\n\u003cp\u003eUpon hearing that Lin Dong wanted to personally enter the crevice, Qin Ying was alarmed. He instinctively wanted to stop Lin Dong, however, once Qin Ying recalled that Lin Dong’s strength had far surpassed him, he deliberated for a moment before he nodded his head.\u003c/p\u003e\n\u003cp\u003eAfter giving out instructions, Lin Dong immediately entered into the crevice. A few steps later, he found that Little Flame had also followed behind him. Looks like it did not mind the scorching heat inside the area.\u003c/p\u003e\n\u003cp\u003eAt this situation, Lin Dong heaved a sigh of relief in his heart as he quickened his pace. Two to three minutes later, the narrow passage suddenly became very spacious as a layer of blazing red filled his vision.\u003c/p\u003e\n\u003cp\u003eWhat had appeared in front of Lin Dong was an area filled with blazing red-hot rocks. From a distance, the heat that was rising from the surface caused the surrounding air to become slightly distorted, making it seem like lava was flowing.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes carefully scanned this blazing red-hot rocky area. Suddenly, he stopped and concentrated on the central area only to find a pile of tens of feet high white beast bones!\u003c/p\u003e\n\u003cp\u003eSuch massive bones indicated that this was probably the largest beast that Lin Dong had ever encountered. Even though all that remained of the beast were its bones, Lin Dong could still sense an extraordinary pressure from these bones. One could only conclude that this was definitely not an ordinary Demonic Beast. However, how exactly the Demonic Beast turned to bones and was left here remained unknown.\u003c/p\u003e\n\u003cp\u003eJust as Lin Dong was feeling puzzled, every hair on Little Flame, who was standing nearby, suddenly stood up. Immediately, it transformed into a red shadow as it dashed towards that pile of white beast bones.\u003c/p\u003e\n\u003cp\u003eUpon witnessing this sight, Lin Dong’s facial expression changed immediately. This area was too strange and he did not dare to venture too deep. However, he never expected that Little Flame would ignore him and actually dash in head-first.\u003c/p\u003e\n\u003cp\u003e“This naughty creature!”\u003c/p\u003e\n\u003cp\u003eAfter cursing in a low voice, Lin Dong gritted his teeth as he quickly followed behind. As he stepped on the blazing red-hot rocks, he felt like he was stepping on burning charcoal. Immediately, he utilized the Yuan Power in his body to protect his feet, only then was somewhat relieved.\u003c/p\u003e\n\u003cp\u003eA human and a beast rapidly dashed across this blazing red-hot rocky area. Their pace finally slowing when they neared the beast bones.\u003c/p\u003e\n\u003cp\u003eNext to the beast bones, Little Flame’s originally grand and magnificent body now far paled in comparison. As it lifted its head to look at that mysterious carcass, suddenly, to the bewilderment of Lin Dong, it jumped up and climbed up the piles of bones. Within a few breaths, it swiftly reached the skull of that beast.\u003c/p\u003e\n\u003cp\u003e“What is that fellow trying to do?”\u003c/p\u003e\n\u003cp\u003eWhen he saw Little Flame’s strange actions, a little confusion arose in Lin Dong’s mind.\u003c/p\u003e\n\u003cp\u003eUnder Lin Dong’s puzzled gaze, Little Flame lifted up its sharp tiger claws and immediately swiped down as it unceremoniously stomped on the skull that had already turned brittle with age.\u003c/p\u003e\n\u003cp\u003eThat giant skull fell as it broke apart to form a pile of debris on the ground. Little Flame then leapt down and after rummaging for a moment, it abruptly used its large mouth to grab onto a fiery-red object.\u003c/p\u003e\n\u003cp\u003eLin Dong sharp eyes immediately caught sight of that fiery-red object. Upon closer inspection, it was actually a fist-sized and perfectly round fiery-red pearl. However, perhaps because of the heat, that fiery-red pearl seemed to look a little like a tiny infant.\u003c/p\u003e\n\u003cp\u003eEven though it was quite a distance away, the exceptionally astute Lin Dong sensed that the strange pill was particularly dangerous.\u003c/p\u003e\n\u003cp\u003e“Gulp!”\u003c/p\u003e\n\u003cp\u003eUnder Lin Dong’s vigilant glaze, Little Flame curled its tongue as it quickly swallowed that fiery-red pearl.\u003c/p\u003e\n\u003cp\u003e“Growl!”\u003c/p\u003e\n\u003cp\u003eAs that fiery-red pearl entered its body, vigorous flames suddenly erupted from Little Flame’s body, while its body also started to bulge little by little. It’s deep growls caused the large cave to shake and shudder.\u003c/p\u003e\n\u003cp\u003eLittle Flame expanded at a terrifying rate before Lin Dong’s eyes as he gulped and slowly moved back.\u003c/p\u003e\n\u003cp\u003eHowever, this growth only lasted for a short while. Moments later, when Little Flame was nearly as large as a small tower, its body started to shrink again before it eventually\u0026nbsp; returned to its original size.\u003c/p\u003e\n\u003cp\u003e“Little Flame?”\u003c/p\u003e\n\u003cp\u003eUpon seeing Little Flame return to its original size, Lin Dong heaved a sigh of relief in his heart before he cautiously called out.\u003c/p\u003e\n\u003cp\u003e“Growl!”\u003c/p\u003e\n\u003cp\u003eAfter it heard Lin Dong’s call, Little Flame instantly lifted its head and swiftly ran to his side, rubbing its giant head against his body.\u003c/p\u003e\n\u003cp\u003eAs he realized that Little Flame did not go astray and turn violent, Lin Dong stealthily wiped off the cold sweat on his forehead. Only then could he carefully inspect the current Little Flame.\u003c/p\u003e\n\u003cp\u003eLittle Flame’s originally fiery-red fur had now become even more fiery and vibrant. It looked as if it was burning. Furthermore, its tiger paws now seem exceptionally sharp as they penetrated deep into the ground. No one would doubt their killing ability now.\u003c/p\u003e\n\u003cp\u003eLin Dong carefully scanned Little Flame’s body, before his gaze finally stopped at the python tail on Little Flame’s behind.\u003c/p\u003e\n\u003cp\u003eCurrently, the unique python tail was perched on Little Flame’s back. There seemed to be a small lump on the head of that python tail, as if something was about to burst out.\u003c/p\u003e\n\u003cp\u003eLin Dong was at a complete loss with regards to the changes that had occurred to Little Flame. After all, he never had much knowledge regarding Demonic Beasts. The only thing he knew now was that the changes occurring in Little Flame were related to that mysterious fiery-red pearl that it just swallowed.\u003c/p\u003e\n\u003cp\u003e“Could that pearl be the Demonic Crystal belonging to that beast? Why is it different from other Demonic Crystals?” Lin Dong muttered to himself.\u003c/p\u003e\n\u003cp\u003e“This place is weird, I should not stay for long.”\u003c/p\u003e\n\u003cp\u003eAs this thought flashed across Lin Dong’s mind, he decided to leave the area. Just as he was about to leave with Little Flame, it suddenly dashed towards a certain place as it released a series of deep growls.\u003c/p\u003e\n\u003cp\u003eUpon witnessing this scene, Lin Dong was stunned as he turned to look, only to see that behind the beast bones, was an area filled with rocks that were condensed from molten lava. Right now, on top of these molten rocks, was a beautiful and seductive crimson red flower that was surrounded by a faint mist…\u003c/p\u003e\n\u003cp\u003eGazing at that bewitching crimson red flower, Lin Dong abruptly turned and looked at the bones, only to discover that the skull of that beast seemed to be directed towards that crimson red flower.\u003c/p\u003e\n\u003cp\u003e“That mysterious demonic beast must have wanted to eat the crimson red flower…”\u003c/p\u003e\n\u003cp\u003eThis thought struck Lin Dong like a flash of lightning.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-75\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-77\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-76","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
