{"id":59833,"no":77,"title":"Chapter 77: The Bewitching Flower","content":"\u003cp\u003eWDQK Chapter 77: The Bewitching Flower\u003c/p\u003e\n\u003cp\u003eThe crimson red flower stood all alone atop a rock. In contrast with its dry and barren surroundings, its vibrant and lively demeanor made it look especially exotic.\u003c/p\u003e\n\u003cp\u003eAfter taking one glance at that bewitching crimson red flower, Lin Dong’s instincts immediately warned him that the flower was hardly ordinary. Of course, this was an obvious conclusion. The fact that this flower was able to bloom in such a harsh and challenging environment clearly indicated that it was something special.\u003c/p\u003e\n\u003cp\u003eWhile Little Flame slowly approached that pile of molten rocks, it periodically growled at that bewitching flower. However, in the end Little Flame did not dare to rush towards it.\u003c/p\u003e\n\u003cp\u003eAs Lin Dong stood below the steaming rocks, he looked hesitantly towards that bewitching flower. After a long deliberation, he finally gritted his teeth and climbed up the rocks.\u003c/p\u003e\n\u003cp\u003e“Buzz Buzzz!”\u003c/p\u003e\n\u003cp\u003eUpon contact with the rocks, Lin Dong’s palm immediately released a sizzling sound. Streams of cold Yin Yuan Power from his Dan Tian swiftly gushed out as they enveloped his body and protected him from being burnt by the heat.\u003c/p\u003e\n\u003cp\u003eLin Dong quickly climbed up that pile of giant rocks as he realized that there was a tiny black tunnel about the size of a head was at the top of the pile of giant rocks. The tunnel seemed to extend all the way down into the ground and an exceptional heat constantly erupted from it.\u003c/p\u003e\n\u003cp\u003e“Oh, so all the Yang Energy here originated from this deep hole.”\u003c/p\u003e\n\u003cp\u003eAfter witnessing this sight, Lin Dong finally realized this fact. Soon after, he turned to look at the bewitching flower that was situated nearby that dark tunnel.\u003c/p\u003e\n\u003cp\u003eAs if it could feel that someone was gazing at it, that bewitching flower suddenly started to sway lightly. The faint mist surrounding it floated off and stealthily wrapped around Lin Dong’s body.\u003c/p\u003e\n\u003cp\u003eWhen that mist surrounded Lin Dong’s body, he suddenly felt his consciousness fade away as a sensation of extreme exhaustion emerged from his body. It was almost as if the life force within his body him was being forcefully sucked away.\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong’s consciousness gradually slipped away, that bewitching crimson red flower seemed to become even more vibrant and alluring.\u003c/p\u003e\n\u003cp\u003eAs he faced this unexpected danger, Lin Dong’s right hand violently shook. A powerful force was generated as the mysterious mist that was surrounding Lin Dong’s head was forcibly dispersed.\u003c/p\u003e\n\u003cp\u003eJust as that mist was forcibly dispersed, Lin Dong suddenly woke up. He stared at the crimson red flower with a terrified look and without further ado, he immediately attempted to retreat.\u003c/p\u003e\n\u003cp\u003eHowever, just as he was planning to leave this strange place, a mysterious suction force suddenly exploded from his right palm. Its target this time, was actually that bewitching flower!\u003c/p\u003e\n\u003cp\u003eThanks to that violent suction force, the bewitching flower was forcibly uprooted and it directly flew towards his right palm under the astonished gaze of Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Buzz buzz!”\u003c/p\u003e\n\u003cp\u003eIn the instant when that bewitching flower collided with Lin Dong’s palm, streams of light shot out from his palm. Moments later, that bewitching flower was reduced to a blob of gooey crimson red liquid.\u003c/p\u003e\n\u003cp\u003eWhen that blob of crimson red liquid emerged, the Mental Energy inside Lin Dong’s mind suddenly began to undulate. That undulations directly caused Lin Dong’s temple to become agitated.\u003c/p\u003e\n\u003cp\u003e“What is going on?”\u003c/p\u003e\n\u003cp\u003eJust as shock emerged in his heart, Lin Dong saw that the blob of gooey liquid had suddenly tunneled into his palm.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eAs that blob of gooey liquid penetrated into Lin Dong’s palm, he immediately heard an explosion go off in his head. He could no longer hear any sounds from his surroundings. All he could feel now was an exceptionally powerful and unique energy rapidly coursing through his body. Finally, like a wild beast, it forcefully broke into his mind.\u003c/p\u003e\n\u003cp\u003e“Ahhhh!”\u003c/p\u003e\n\u003cp\u003eA painful scream abruptly rang out in the quiet cave as Lin Dong’s body fell down from that giant bolder and frantically rolled around on the ground. Right now, his head felt like it was about to swell and explode. The extreme pain caused Lin Dong’s entire face to turn extremely hideous and twisted.\u003c/p\u003e\n\u003cp\u003eAs Little Flame saw Lin Dong frantically rolling around on the floor, it released an anxious roar. However, it did not dare to approach Lin Dong at this moment. It’s acute senses told it that an exceptionally powerful force was currently coursing through Lin Dong’s body and this force was potent enough to kill.\u003c/p\u003e\n\u003cp\u003ePainful screams constantly echoed about the mountain cave. Currently, veins had popped up all over Lin Dong’s face as they wriggled like earthworms. He could clearly feel the Mental Energy within his mind rapidly fusing with that extremely powerful force. As the two forces harmonized, it was as if there was\u0026nbsp; a catalyst that allowed his Mental Energy to grow extremely rapidly.\u003c/p\u003e\n\u003cp\u003eWhile his Mental Energy strengthened at a great speed, that acute pain grew more and more intense. If this situation continued, Lin Dong’s mind would definitely be forcefully blown apart by that rapidly growing Mental Energy!\u003c/p\u003e\n\u003cp\u003eUnder the threat of death, Lin Dong’s mind became slightly clearer. His body continuously trembled as he forced himself to endure that unbearable pain while he desperately tried come up with a solution.\u003c/p\u003e\n\u003cp\u003eThanks to his persistent personality that was forged into him since young, Lin Dong was able to endure this pain as he desperately thought of a plan to save himself. Anyone else would surely have long been driven insane by this pain.\u003c/p\u003e\n\u003cp\u003eAn insane glint flashed in Lin Dong’s eyes as he suddenly recited a chant in his heart.\u003c/p\u003e\n\u003cp\u003e“Spirit is split into Yin and Yang. Spiritual Movement begins with life…”\u003c/p\u003e\n\u003cp\u003eThis chant was from “Spiritual Movement Chapter”. The current Lin Dong was like a drowning man holding on to the last stalk of grass. Without thinking it over, he quickly recited the chants from the two other parts of “Spiritual Movement Chapter”.\u003c/p\u003e\n\u003cp\u003eThe “Spiritual Movement Chapter” that Master Ruo from Yan City had given to Lin Dong was split into three different parts. Over these few months, Lin Dong had successfully mastered the first part. However, with regards to the two remaining sections, he had made scant progress.\u003c/p\u003e\n\u003cp\u003eHowever, at this moment, he found that the slow progress that he used to make had suddenly sped up. As he recited the chants, Lin Dong could vividly feel the violent Mental Energy within his mind gradually being tamed.\u003c/p\u003e\n\u003cp\u003ePresently, Lin Dong’s body had stopped trembling. He sat down on the floor and began to recite the “Spiritual Movement Chapter” chants in his head.\u003c/p\u003e\n\u003cp\u003eThe formless yet powerful Mental Energy was now raging about inside Lin Dong’s mind.\u003c/p\u003e\n\u003cp\u003eIn mere minutes, this powerful Mental Energy was quickly sucked dry as Lin Dong successfully mastered the remaining two parts of the “Spiritual Movement Chapter”.\u003c/p\u003e\n\u003cp\u003eIf Master Ruo knew how Lin Dong had managed to master the 2nd and 3rd parts of Spiritual Movement Chapter in a short few minutes, one could only imagine his expression…\u003c/p\u003e\n\u003cp\u003eAs Lin Dong successfully mastered the third part of “Spiritual Movement Chapter”, he could sense that something seemed to have broken open up in his mind. Immediately, he could feel the Mental Energy within his mind begin to rapidly gush towards that location in the middle of his head.\u003c/p\u003e\n\u003cp\u003e“NiWan Palace has opened!”\u003c/p\u003e\n\u003cp\u003eAs he became aware of this situation, Lin Dong was slightly taken aback. Based on his interpretation of “Spiritual Movement Chapter”, he knew that one of the most important steps in training Mental Energy was opening NiWan Palace.\u003c/p\u003e\n\u003cp\u003eIt was said that there are nine palaces in the head, corresponding to the nine heavens. The palace in the middle was termed as NiWan Palace!\u003c/p\u003e\n\u003cp\u003eThis was the greenhouse for cultivating Mental Energy, akin to a Dan Tian for Yuan Power!\u003c/p\u003e\n\u003cp\u003eMental Energy gushed into his NiWan Palace like a tidal wave and when that last bit of Mental Energy finally entered, the aching sensation in his head instantly vanished, at which Lin Dong’s tightly shut eyes also opened!\u003c/p\u003e\n\u003cp\u003eAs he opened his eyes, an uncontrollable whistling sound burst out from Lin Dong’s mouth. Just as that whistle rang out, a powerful formless Mental Energy violently gushed out from Lin Dong’s NiWan Palace!\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThe enormous mountain cave immediately shook as a formless shock wave instantly emerged with Lin Dong at the epicenter. On the ground, layers of rock fragments were instantly blown away before they finally collided with the cave walls and caused the cave to tremble.\u003c/p\u003e\n\u003cp\u003e“Huff…”\u003c/p\u003e\n\u003cp\u003eLin Dong hurriedly caught his breath as he lifted up his head to witness the damage that he had done. Shock filled his eyes.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-76\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-78\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-77","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
