{"id":60540,"no":784,"title":"Chapter 782: Cauldron","content":"\u003cp\u003eChapter 782: Cauldron\u003c/p\u003e\n\u003cp\u003eA monstrous black fog swept out from the bottom of the altar and spread outwards. An unusually dark, cold and evil aura scattered around.\u003c/p\u003e\n\u003cp\u003e“What is it?”\u003c/p\u003e\n\u003cp\u003eLing Qingzhu’s eyes were grave as she watched the black fog spread. The dark cold evilness within it caused her expression to change involuntarily. That evilness was something that she had never encountered before...\u003c/p\u003e\n\u003cp\u003eShe was also aware that some special cultivation methods would cause such a fluctuation to appear. Compared to this however, there was an inherent difference. This fluctuation appeared to be completely out of tune with this world. Moreover, it seemed to be attempting to completely remove any form of life in this world…\u003c/p\u003e\n\u003cp\u003e“The main culprit behind the ancient great world war… from the looks of it, it was not completely destroyed back then, and this fellow was sealed here. Currently, it is trying to make use of this opportunity to escape.” Lin Dong’s eyes were grim as he spoke.\u003c/p\u003e\n\u003cp\u003e“The main culprit behind the ancient great world war…”\u003c/p\u003e\n\u003cp\u003eLing Qingzhu knitted her brows and softly asked, “What should we do now?”\u003c/p\u003e\n\u003cp\u003eLin Dong laughed bitterly. How would he know what to do? This creature was not something that they could deal with…\u003c/p\u003e\n\u003cp\u003e“What are they planning to do?” Lin Dong suddenly heard Ling Qingzhu\u0027s startled voice while he was laughing bitterly. He hurriedly lifted his head and saw the Yuan Cang trio approaching the monstrous black fog.\u003c/p\u003e\n\u003cp\u003eAs they approached, majestic Yuan Power ferociously swept out from within their bodies. After which, it transformed into a triangular shaped light curtain that enveloped the black fog. From the looks of it, they were thinking of capturing the black fog creature.\u003c/p\u003e\n\u003cp\u003e“Idiots!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s expression immediately changed drastically when he saw this scene. He directly grabbed Ling Qingzhu’s wrist and suddenly withdrew explosively.\u003c/p\u003e\n\u003cp\u003eWhile the Lin Dong duo was withdrawing, the triangular light curtain in the sky had already slammed heavily onto the monstrous black fog.\u003c/p\u003e\n\u003cp\u003e“Tsk tsk, even ants like you actually dare to attack this general? You are indeed despicable creatures!”\u003c/p\u003e\n\u003cp\u003eThe black fog surged as an unusually deafening strange evil laughter was immediately emitted. The black fog cleared and the three faces of the triangular light curtain, which contained powerful Yuan Power, emitted a sizzling sound and disappeared the moment it touched the black fog. It had no effect at all.\u003c/p\u003e\n\u003cp\u003eThe Yuan Cang trio’s expressions underwent some changes when they saw that their attack was completely useless against this strange creature. Soon after, their bodies hurriedly shot backwards.\u003c/p\u003e\n\u003cp\u003e“*Sneer*!”\u003c/p\u003e\n\u003cp\u003eWhile they shot backwards, a large hand made of black fog from the black fog creature immediately grabbed at the three of them.\u003c/p\u003e\n\u003cp\u003eBang bang!\u003c/p\u003e\n\u003cp\u003eMajestic Yuan Power hurriedly whistled out when the three of them saw this. However, their attacks were automatically eroded and annihilated the moment they touched the large black fog hand. It looked as if their attacks were completely ineffective against it.\u003c/p\u003e\n\u003cp\u003eLin Dong, who had withdrawn to a distance, had a cold and indifferent expression as he watched the three miserable figures being attacked by the black fog creature. It was their own fault for getting into this mess.\u003c/p\u003e\n\u003cp\u003e“Release your hand.”\u003c/p\u003e\n\u003cp\u003eA cold yet soft voice was suddenly emitted from beside Lin Dong. Only then did he discover that he was still tightly grabbing Ling Qingzhu’s wrist. Immediately, he let out a soft cough and casually released his hand.\u003c/p\u003e\n\u003cp\u003e“This creature seems to be extremely difficult to deal with.” Ling Qingzhu gently rubbed at the spot where Lin Dong had forcefully grabbed earlier. Her voice was still cold. However, her eyes no longer looked at Lin Dong when she spoke. There was a slight ripple in her tone.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded slightly. Immediately, he frowned tightly. Although it was quite pleasing to see the Yuan Cang trio being bullied by the black fog creature, he was also aware that once this thing refocused its attention, it would not let off anyone who was trapped in this place. At that time, it would be impossible for them to stop this creature with their strength…\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eThe eyes of the tightly frowning Lin Dong suddenly became focused as he abruptly raised his head and looked at the bright red sky. An extremely powerful fluctuation had suddenly emerged from that spot.\u003c/p\u003e\n\u003cp\u003eLing Qingzhu also raised her head when she saw Lin Dong’s action. She softly commented, “There’s something going on over there…”\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eAn extremely melodious ‘gong’ sound suddenly spread from the bright red sky after her voice sounded out.\u003c/p\u003e\n\u003cp\u003eA bright red ripple began to sweep downwards from the vast sky at a speed visible to the naked eye following the ‘gong’ sound. As the ripple travelled, Lin Dong immediately discovered that the distortions in the area had actually began to disappear. Soon after, Lin Dong sensed countless powerful auras emerging in this domain.\u003c/p\u003e\n\u003cp\u003e“The formation appears to have been lifted...” Ling Qingzhu said. Clearly, she had also sensed the emergence of those auras. These auras were likely from those who had entered the Burning Sky Ancient Stash with them.\u003c/p\u003e\n\u003cp\u003eLin Dong nodded, but his eyes fixed onto the sky. The space there fluctuated and became distorted. In the end, an indescribably large cauldron seemed to have appeared, while they… seemed to be within this cauldron.\u003c/p\u003e\n\u003cp\u003e“It seems like… we were not trapped in the Burning Sky Array. Instead, we have been trapped in this object’s stomach…” Lin Dong pointed at the enormous cauldron that had appeared in the distorted space. Soon after, he inhaled a deep breath of air. His eyes were a little shocked. The Burning Sky Ancient Stash that they had barged into was actually a cauldron....\u003c/p\u003e\n\u003cp\u003e“It should be an extremely powerful Pure Yuan treasure.” Ling Qingzhu’s eyes were grave as she looked at the inner wall of the cauldron within the distorted space and softly commented.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes focused. He had seen the Heavenly Phoenix Zither in Ying Huanhuan’s hands. Though it was extremely powerful, this cauldron which could actually create its own realm and swallow all of them into it, was clearly even more powerful. Such a treasure should be considered top tier even amongst Pure Yuan treasures, right?\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eAt this moment, a monstrous bright red light suddenly swept down from the cauldron that was so large that it seemingly covered the entire realm. Moreover, the direction that it was surging towards was where they were located.\u003c/p\u003e\n\u003cp\u003eThe bright red light directly formed an extremely huge light array in the sky when it swept downwards. Soon after, a curtain of light descended and enveloped the black fog creature.\u003c/p\u003e\n\u003cp\u003eBang bang bang!\u003c/p\u003e\n\u003cp\u003eThe black fog struck at the light array. However, it was no longer able to easily break free like before. However, that enormous force still shook the light array until it trembled continuously.\u003c/p\u003e\n\u003cp\u003e“This cauldron seems to be controlled by someone?” A surprised look involuntarily flashed across Lin Dong’s eyes as he spoke after seeing this scene.\u003c/p\u003e\n\u003cp\u003eLing Qingzhu nodded slightly. Her eyes were filled with surprise. It was likely that the strange situations unfolding before her caused even her to have difficulty maintaining a cool and collected state of mind.\u003c/p\u003e\n\u003cp\u003e“Damned old ghost Fen Tian. You have already died yet you still continue to linger around!”\u003c/p\u003e\n\u003cp\u003eThe black fog creature struck wildly against the light array. A deafening sound rumbled and spread over the area.\u003c/p\u003e\n\u003cp\u003e“It seems like the light array will not be able to hold for long…”\u003c/p\u003e\n\u003cp\u003eLin Dong watched the light array that was turning increasingly unsteady from the strikes. His heart involuntarily pounded. If this array was broken and that creature broke free, there was no telling just how many people would die.\u003c/p\u003e\n\u003cp\u003eBuzz buzz!\u003c/p\u003e\n\u003cp\u003eWhile Lin Dong worried, a bright red fluctuation suddenly unfurled in the sky. This ripple had just spread when Lin Dong suddenly sensed a great resistance emitted from the space around him. Immediately, the space behind him began to twist and was actually trying to suck him in.\u003c/p\u003e\n\u003cp\u003e“What is going on?” Ling Qingzhu asked with a frown because of this scene.\u003c/p\u003e\n\u003cp\u003eLin Dong’s eyes flickered for a moment. He quickly said, “Do not resist. It seems like the cauldron wants to spit us out.”\u003c/p\u003e\n\u003cp\u003eLin Dong gave up all resistance after his voice sounded out. He allowed the rejection force from the space to pull his body into the distorted space behind him. After which, everything quickly turned dark.\u003c/p\u003e\n\u003cp\u003eThis darkness did not last for long before Lin Dong sensed a bright red light shooting into his eyes. His vision was quickly restored. The scene that appeared before his eyes was no longer a crimson land. Instead, it was a bright red mountain range. At this moment, a bright red cauldron that was thousands of feet in size quietly stood in the air above these mountains, while wave after wave of scorching ripples were continuously emitted by it.\u003c/p\u003e\n\u003cp\u003eLin Dong stared at the bright red cauldron that was suspended in the sky, before he exhaled gently. He knew that the place they had been trapped in earlier should be the stomach of this cauldron that was now before them.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-781\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-783\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-782","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
