{"id":60549,"no":793,"title":"Chapter 791: Martial Emperor Law","content":"\u003cp\u003e\u003cstrong\u003e791: Martial Emperor Law\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Heh heh, the kids these days are getting more and more insolent. Kid, I don’t care where you come from. Once you come to a place like this, no matter who you are, if you lose your life, no one would know who did it.” Atop the cliff wall, the older brother Yang Zhan looked towards Lin Dong, who had floated up into the air, and could not help but mock with a sneer.\u003c/p\u003e\n\u003cp\u003e“Brat, if you’re smart, you should hurry up and scram. If you anger me, the 2nd master of the Yang family, you will be begging for your death!” added Yang Wei with a malevolent smile.\u003c/p\u003e\n\u003cp\u003eIndifference filled Lin Dong’s eyes as he looked towards the two sneering men. Ignoring their words, the scarlet cauldron in his palm suddenly started give off an intense scarlet luster. In the next instance, the cauldron grew dramatically in size, transforming into a gigantic cauldron that was dozens of feet large.\u003c/p\u003e\n\u003cp\u003eThis cauldron was naturally the Burning Sky Cauldron that Lin Dong had obtained from old man Fen Tian. It was a genuine Pure Yuan treasure and Lin Dong had personally witnessed its formidable power back then. Even the black fog lifeform had been destroyed by it. Of course, the current Lin Dong was unable to bring out the terrifying might of the cauldron that old man Fen Tian had displayed. Therefore, the cauldron’s size was far from being able to reach the size it had back then.\u003c/p\u003e\n\u003cp\u003eNonetheless, when the scarlet cauldron expanded in size, astonishing hot fluctuations still erupted unceasingly from within. In an instant, the temperature of the area increased substantially.\u003c/p\u003e\n\u003cp\u003eSwish!\u003c/p\u003e\n\u003cp\u003eWith a wave of his sleeve, boundless Yuan Power immediately poured into the Burning Sky Cauldron. Flames seemed to rise from within it as the cauldron gave off increasingly irritable fluctuations.\u003c/p\u003e\n\u003cp\u003eWhen old man Fen Tian passed the Burning Sky Cauldron to Lin Dong, he had erased all his brands within it. Hence, Lin Dong was able to control it with ease. Although he was not able to reach old man Fen Tian’s level of mastery, the ability he displayed could not be considered unproficient.\u003c/p\u003e\n\u003cp\u003eStartled expressions appeared on the Yang brothers’ faces due to the fluctuations radiating out from the Burning Sky Cauldron. Soon after, thick greed gushed out from their eyes.\u003c/p\u003e\n\u003cp\u003e“It’s a Pure Yuan treasure!”\u003c/p\u003e\n\u003cp\u003eThe brothers licked their lips. The fire within their eyes was now much more intense compared to before when they were looking at Ling Qingzhu. They had been in Unique Devil Region for many years and their eyes were naturally extraordinary. Therefore, with one look, they could tell that the Burning Sky Cauldron within Lin Dong’s hand was definitely no ordinary treasure.\u003c/p\u003e\n\u003cp\u003e“Such a lucky brat. He actually got his hands on such a precious treasure. No wonder he dares to act so rampant in front of us. Heh heh, however, since you’ve revealed your treasure, there’s no need for you to leave now...” said Yang Zhan with a grin.\u003c/p\u003e\n\u003cp\u003eYang Wei released a strange laugh, as exceptionally boundless Yuan Power slowly started to swell and sweep out from his body. Ill intent filled his eyes as he stared at Lin Dong.\u003c/p\u003e\n\u003cp\u003e“Want to steal my treasure… let’s see whether you guys have the ability to do so.”\u003c/p\u003e\n\u003cp\u003eIt was clear that Lin Dong had spotted the sudden rise in greed within their eyes. With a laugh, Lin Dong’s eyes turned all the more cold and chilling.\u003c/p\u003e\n\u003cp\u003e“Brat, let’s see if your mouth will still be so sharp later on! ” sneered Yang Zhan. The brothers shot a look at each other, before turning into black shadows as they shot forward simultaneously. Two fists rumbled through the air, causing it to explode as two violent gales enveloped Lin Dong.\u003c/p\u003e\n\u003cp\u003eThe Yang brothers had no intention of sounding out Lin Dong. In addition, they did not underestimate him just because he was at the eight Yuan Nirvana stage. The two had joined forces and attacked together. After mixing around in Unique Devil Region for all these years, they have seen too many cases of people underestimating their opponents which resulted in them getting blindsided.\u003c/p\u003e\n\u003cp\u003eSuch opponents were the toughest to deal with… therefore, after Lin Dong saw this scene, an additional feeling of seriousness appeared within his eyes. Although this duo was loathsome, their attitude towards battle forced him to become even more wary.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eThe green dragon wings on Lin Dong’s back extended. With a sudden jolt, his figure rapidly retreated, while his hands started to form a seal. A scarlet column of fire spurted out of the Burning Sky Cauldron, and smashed head on against the fist gale created by the brothers.\u003c/p\u003e\n\u003cp\u003e“Such a powerful attack!”\u003c/p\u003e\n\u003cp\u003eWhen they saw that Lin Dong was actually able to block their attack with such ease by using the Burning Sky Cauldron and his eight Yuan Nirvana stage strength, a feeling of astonishment flashed within their eyes. However, what came after that flash of astonishment was an even thicker feeling of greed.\u003c/p\u003e\n\u003cp\u003e“Let\u0027s go!”\u003c/p\u003e\n\u003cp\u003eWith a shout, the two brothers instantly shot forwards. In a flash, they appeared on Lin Dong’s left and right. A vicious glint filled their eyes as they sent their fists rumbling forth.\u003c/p\u003e\n\u003cp\u003e“Soul Breaking Palm!”\u003c/p\u003e\n\u003cp\u003eBoundless and sinisterly cold Yuan Power crazily gathered in their palms, bringing along an extremely fierce and chilling force, as they instantly enveloped every vital point on Lin Dong’s body.\u003c/p\u003e\n\u003cp\u003eGreen light erupted from within Lin Dong’s body as green dragon scales rapidly appeared. Lin Dong’s arms and legs wiggled and expanded. In the next instant, with a grasp of his dragon fist, the Yuan Power within his body roared and exploded out without restraint.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eWithout any indication of backing off, the malevolent and cold green dragon fist smashed head on against the swift and fierce palm force from the two brothers.\u003c/p\u003e\n\u003cp\u003eAt the instant of impact, violent winds swept outwards as Lin Dong explosively retreated a dozen steps. The green light on his body flickered, completely blocking the force that was invading his body.\u003c/p\u003e\n\u003cp\u003e“Delightful!”\u003c/p\u003e\n\u003cp\u003eAfter forcefully receiving the brothers’ palms, Lin Dong could not help but raise his head towards the sky, as he laughed heartily. After having advanced to the eight Yuan Nirvana stage, the strength of his physical body was growing more and more powerful. With his tough physical body tempered by the Green Heaven Materialized Dragon Skill, he was now able to fight evenly with opponents at the half-step to Profound Life stage.\u003c/p\u003e\n\u003cp\u003e“This brat has such a formidable physical body!”\u003c/p\u003e\n\u003cp\u003eAfter this exchange, there a was slight change of emotions within the brothers’ eyes. It was obvious that they had become aware of Lin Dong’s formidable physical body.\u003c/p\u003e\n\u003cp\u003e“Don’t waste time, finish him off quickly!”\u003c/p\u003e\n\u003cp\u003eYang Zhan and Yang Wei’s gazes met. Soon after, cold glints gushed in their eyes. When taking action within the deeper areas of Unique Devil Region, one has to end the fight as quickly as possible. If not, the battle will attract the attention of powerful demons. When these creatures show up, it would become rather troublesome.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eBoundless dark grey Yuan Power simultaneously swelled and erupted from the duo’s bodies. Indistinctly, it transformed into a gigantic dark grey shadow behind them. After its appearance, an astonishing fluctuation was faintly emitted.\u003c/p\u003e\n\u003cp\u003e“Heh heh, brat. After entering the ancient treasury back then, us brothers managed to obtain a few ancient martial arts. You are truly fortunate to be able to experience it. Even if you die, it won’t be a waste!” as the grey shade behind them start to condense and solidify, an extremely boundless energy fluctuation started radiating faintly from it.\u003c/p\u003e\n\u003cp\u003e“This…”\u003c/p\u003e\n\u003cp\u003eSensing this fluctuation, Lin Dong’s pupils faintly contracted. At this very moment, he could feel a faint sensation of stabbing pain originating from his dragon scale covered body. Obviously, the martial art that the Yang brothers had unleashed was definitely extraordinary.\u003c/p\u003e\n\u003cp\u003e“Never would I have thought that these two fellows actually possess such a formidable martial art. I wonder where did they obtain it from?” Lin Dong’s eyes sparkled as this thought continued to circulate within his mind.\u003c/p\u003e\n\u003cp\u003eThe majestic grey shade finally solidified behind the Yang brothers. In the next moment, a low shout suddenly rang out from their mouths, “Martial Emperor Law, Destruction Fist!”\u003c/p\u003e\n\u003cp\u003eAs the shout rang out, an ancient fist suddenly rumbled out from the majestic grey shade. The fist that appeared was covered all over by ancient looking patterns. As the fist rumbled forward, a strange and peculiar fluctuation started to faintly radiate from it.\u003c/p\u003e\n\u003cp\u003eThe force generated by the fist directly tore apart space, locking all of Lin Dong’s possible escape routes. Its power and momentum was extremely terrifying and dreadful.\u003c/p\u003e\n\u003cp\u003eLin Dong\u0027s expression was grim as he watched the ancient fist that had penetrated through space and was heading towards him. Soon after, majestic green light suddenly screamed out from his body, transforming into a gigantic green dragon. With a fling of its green dragon tail, it viciously smashed against the ancient fist.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eWild Yuan Power swept everywhere in a berserk fashion as Lin Dong instantly retreated explosively. His body violently smashed against the mountain cliff, as a gigantic fissure started to spread from the point of impact.\u003c/p\u003e\n\u003cp\u003eLooking extremely miserable as he stabilised his body, Lin Dong suddenly raised his head. Eyes burning with fire, he stared at the Yang brothers and grinned, “ Good, I’ll help the both of you keep this Martial Emperor Law!”\u003c/p\u003e\n\u003cp\u003eAs he said those words, Lin Dong changed his hand seals, causing the Burning Sky Cauldron floating in midair to suddenly start rotating. Soon after, a flaming light array instantly spewed out, enveloping the Yang brothers within. At the same time, a terrifying fluctuation started to spread from the light array.\u003c/p\u003e\n\u003cp\u003eSensing this fluctuation, a dreadful expression rushed forth on their faces.\u003c/p\u003e\n\u003cp\u003eThis array technique, was the Burning Sky Array of the Burning Sky Cauldron!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-790\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-792\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-791","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
