{"id":60577,"no":821,"title":"Chapter 819: 1v6","content":"\u003cp\u003e\u003cstrong\u003eChapter 819: 1v6\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eIn the sky filled by boundless Yuan Power, the faces of Shi Dong and the other five turned extremely ugly as they gazed at Little Marten in the distance, while rage erupted from their eyes. Their reputation within the Eastern Xuan Region was considered pretty good. Over the years, there was no one that dared to look down on them.\u003c/p\u003e\n\u003cp\u003e“Isn’t your boasting a little too much? Aren’t you afraid of choking to death on these words?” Shi Dong said with a gloomy face.\u003c/p\u003e\n\u003cp\u003e“Choke grandpa marten to death? You trash sure think too highly of yourselves.” Little Marten mockingly replied with a smile while shaking his head.\u003c/p\u003e\n\u003cp\u003e“Heh. Good, I’m really interested to find out just what kind of abilities you have to take on all six of us by yourself!”\u003c/p\u003e\n\u003cp\u003eShi Dong’s expression was frosty as he chuckled. He could feel how tyrannical Little Marten was, therefore he did not try to show off and do something like a one on one fight. Since Little Marten had said such boastful and crazy words, Shi Dong would be happy to help fulfill his wish.\u003c/p\u003e\n\u003cp\u003eAs his words rang out, Shi Dong cast a chilling gaze at the five people beside him, before faintly nodding his head. In the next instant, boundless Yuan power simultaneously swept out, and six extremely violent Yuan Power torrents gushed out, crafty and vicious as they rumbled towards Little Marten in the distance.\u003c/p\u003e\n\u003cp\u003eFloating in the sky, Little Marten looked at the attacks of the six people as the lips on his handsome face faintly curled. With a wave of his sleeve, purplish black flames spread outwards, transforming into a fiery barrier around his entire body.\u003c/p\u003e\n\u003cp\u003eBang Bang!\u003c/p\u003e\n\u003cp\u003eThe Yuan Power torrents were swift and violent as they arrived, before finally impacting against the fiery barrier. However, only a few muffled sounds rang out, before they dissipated like fleeting snow that had met a raging inferno.\u003c/p\u003e\n\u003cp\u003e“Is that all?”Little Marten grinned as he looked towards the grim Shi Dong and the other five and asked.\u003c/p\u003e\n\u003cp\u003eSeeing that their combined attacks were unexpectedly unable to shake Little Marten at all, the expressions of Shi Dong and the others could not help but change somewhat, as they felt disbelief in their hearts. When the six of them joined forces, even a perfect Profound Life stage expert would not dissolve their attacks so easily. Who exactly was this handsome youth in front of them, who was actually so strong...\u003c/p\u003e\n\u003cp\u003e“So strong…” Upon seeing this spectacle, graveness filled Qi Lei’s eyes as he said in a deep voice. Even some Profound Life stage experts of Yuan Gate would perhaps fall short of the power that Little Marten had displayed.\u003c/p\u003e\n\u003cp\u003eBeside him, Chen Zhen faintly nodded his head. He knew some fuzzy details about Little Marten’s identity, therefore, when the latter displayed that astonishing combat ability, it did not seem exceptionally astonishing.\u003c/p\u003e\n\u003cp\u003e“If this is all you have, get ready to scram…”\u003c/p\u003e\n\u003cp\u003eIn the sky, Little Marten seemed rather unsatisfied with the combined might of Shi Dong and the other five. Purplish black flames danced on his slender hand. Soon after, he shot a look at the six and said with an indifferent tone.\u003c/p\u003e\n\u003cp\u003e“Don’t be an intolerable bully!”\u003c/p\u003e\n\u003cp\u003eShi Dong and the other five were clearly angered by the heedless attitude of Little Marten. They were currently being watched by countless gazes in this Unique Devil Region. If it spread that even the six of them were unable to shake a person when they joined forces, where could they possibly show their old faces in future?\u003c/p\u003e\n\u003cp\u003e“Heaven Covering Yuan Array!”\u003c/p\u003e\n\u003cp\u003eA deep voice containing rage emerged from Shi Dong’s mouth. Instantly, the other five started a series of profound footwork. Surging Yuan Power converged to form a light pillar, which suddenly shot out and transformed into a light array, enveloping the five within.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eBoundless Yuan Power fluctuations radiated crazily from within the light array. Being an array created by the combined strength of six advance Profound Life stage experts, its might was obviously rather terrifying. The fluctuations that radiated from it caused the expressions of several people in the city to change.\u003c/p\u003e\n\u003cp\u003eWithin the enveloping light array, boundless Yuan Power light pillars whizzed out. However, they did not disperse. Instead, they converged towards Shi Dong’s location at an astonishing speed.\u003c/p\u003e\n\u003cp\u003eAs this Yuan Power gathered, Shi Dong’s aura rapidly multiplied in power. Contrary to him, the auras of the other five rapidly weakened. From the looks of it, the other five individuals had evidently delivered their Yuan Power to Shi Dong for a short duration.\u003c/p\u003e\n\u003cp\u003e“That’s the Yuan Gate’s Heaven Covering Yuan Array... it can temporarily graft the Yuan power of others to one’s body. Although the one that accepts the Yuan Power would suffer injuries, his strength would reach an astonishing level for a short period of time.” As he watched this spectacle, Qi Lei’s eyes turned a little more grave while he explained.\u003c/p\u003e\n\u003cp\u003e“The merging of six people’s Yuan Power. This requires an extremely high level of understanding between them. These few old fellows do indeed have some ability…” Chen Zhen added while nodding his head.\u003c/p\u003e\n\u003cp\u003e“However, that friend of Lin Dong’s is also not someone who is easy to deal with. It would not be easy for these old fellows to defeat him even having used their final trump card…”\u003c/p\u003e\n\u003cp\u003eYuan Power that blotted the skies rippled around Shi Dong like an ocean. Feeling the extreme surge of power within his body, a dark and cold expression appeared on his aged face. His gaze locked onto Little Marten in the distance. With a cold laugh, his hand seal suddenly change as a cold roar resounded.\u003c/p\u003e\n\u003cp\u003e“Heaven Subduing Seal!”\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eBoundless Yuan Power surged out like a flood at this instant , rapidly transforming into a gigantic light seal several hundreds of feet large in the sky. Above the light seal, ripples started to scatter outwards, and even the land seemed to tremble slightly at this moment.\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eThe light seal was formed, and without the slightest trace of stopping, it whizzed out with a bright and resplendent light tail akin to a comet, and rumbled towards Little Marten under the innumerable shocked gazes below.\u003c/p\u003e\n\u003cp\u003e“Now this is something slightly worth seeing… however, that’s all there is to it”\u003c/p\u003e\n\u003cp\u003eLittle Marten watched the gigantic seal shooting towards him. With a laugh, he slowly started to clench those slender hands, causing purplish black flames to sweep out. Under the stunned gazes of everyone, it transformed into a pair of gigantic purplish black flaming bat wings that were nearly a thousand feet wide.\u003c/p\u003e\n\u003cp\u003eThe flaming bat wings faintly flapped, causing gales to erupt across the sky and land, while space immediately started to warp and distort.\u003c/p\u003e\n\u003cp\u003e“Swish!”\u003c/p\u003e\n\u003cp\u003eAfter the flaming bat wings had formed, it gave a sudden flap. In that instant, it seemingly ripped apart space, and violently slapped against the gigantic light seal under the attention of numerous watching gazes,\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eAn enormous sound mixed with extremely wild and violent fluctuations crazily dispersed in the skies. A few who were standing close to the fight were immediately swept and thrown away, causing them to appear extremely miserable.\u003c/p\u003e\n\u003cp\u003eCrack!\u003c/p\u003e\n\u003cp\u003eAs the ripples spread outwards, everyone could see that cracks had suddenly appeared on the surface of the gigantic light seal. With a final ‘crack’, the light seal formed by the full powers of six advance Profound Life Advanced stage experts, shattered apart with a loud bang.\u003c/p\u003e\n\u003cp\u003eUrgh!\u003c/p\u003e\n\u003cp\u003eAs the light seal shattered, muffled groans rang out of the throats of Shi Dong and the other five, as paleness surfaced on their faces. At this moment, terror finally flashed within their eyes...\u003c/p\u003e\n\u003cp\u003e“The people of Yuan Gate are unable to withstand even a single blow.”\u003c/p\u003e\n\u003cp\u003eThe Little Marten gazed indifferently at Shi Dong and the rest, whose expressions had changed drastically. A cold glint flashed within his eyes, and a faint tremor shook his body. The incomparably gigantic flaming bat wings shattered space again, and appeared above them in a flash, before ruthlessly slapping downwards.\u003c/p\u003e\n\u003cp\u003eBang Bang!\u003c/p\u003e\n\u003cp\u003eFrightening purplish black flames carried berserk power and smashed against the bodies of Shi Dong and the other five, who were unable to evade, at lightning speed. Low and deep muffled sounds rang out, as the six shot down miserably, while continuously spurting blood on the way down. Their auras rapidly weakened, indicating that they had obviously suffered pretty serious injuries.\u003c/p\u003e\n\u003cp\u003eComplete defeat.\u003c/p\u003e\n\u003cp\u003eUpon seeing this, a series of gasps sounded out in the city. Six advance Profound Life stage experts had joined hands, however, they unexpectedly still suffered complete defeat at the hands of this handsome man...\u003c/p\u003e\n\u003cp\u003e“Don’t be too pleased with yourself, you’ve offended our Yuan Gate. In this Eastern Xuan Region, there will definitely be no safe place for you. Although the six of us are not your opponents, our Yuan Gate has as many experts as the clouds in the skies. You’ll regret it sooner or later!” Shi Dong wiped the blood from the corner of his mouth, before shouting in a stern voice.\u003c/p\u003e\n\u003cp\u003e“Too noisy.”\u003c/p\u003e\n\u003cp\u003eLittle Marten’s gaze turned a little frosty, as killing intent flashed within his eyes. Like a sharp flaming wing blade, the flaming bat wings shattered space again. They contained extremely swift and fierce gales, as they slashed at the six. From the looks of it, he was actually planning to kill all of them.\u003c/p\u003e\n\u003cp\u003e“You!”\u003c/p\u003e\n\u003cp\u003eUpon discovering the sudden swift and fierce attack unleashed by Little Marten and the murderous aura within, the faces of Shi Dong and the other five were overwhelmed with horror. They had obviously never imagined that Little Marten would actually dare to unleash a killing blow on them.\u003c/p\u003e\n\u003cp\u003e“Retreat quickly!”\u003c/p\u003e\n\u003cp\u003eA panicked voice emerged from Shi Dong’s mouth. However, their faces turned deathly pale as they discovered that the space surrounding them had been locked at this moment. They could only raise their heads, and look with wide eyes at the flaming bat wings descending upon them at lightning speed.\u003c/p\u003e\n\u003cp\u003eLin Dong watched the spectacle playing before him. However, in the next instant, his pupils suddenly contracted. He had noticed that the space in front of Shi Dong and the other five had suddenly started distorting. In the next instant, a slender and fair hand reached out from within it. With a flick, an invisible fluctuation scattered outwards, and directly forced back Little Marten’s flaming bat wings.\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003eAs the bat wings were forced back, a grave look finally appeared on Little Marten’s handsome face. His eyes were tightly fixed on the distorted space before Shi Dong and the five, as he shouted in a deep voice.\u003c/p\u003e\n\u003cp\u003e“Ha ha… when did my Eastern Xuan Region become a territory of the Celestial Demon Martens… don’t you think that you are looking down too greatly on my Yuan Gate…”\u003c/p\u003e\n\u003cp\u003eAn indifferent laugh slowly rang out from the distorted space. In the next moment, everyone saw a figure slowly step out from within. The instant he appeared, the sky and earth seemed to have suddenly darkened. An invisible fluctuation radiated out, causing people to feel an impulse to kneel down.\u003c/p\u003e\n\u003cp\u003e“That is…”\u003c/p\u003e\n\u003cp\u003eWithin the pavilion, Ling Qingzhu gazed at the figure that had walked out from empty space. Even with her temperament, she could not help but gasp.\u003c/p\u003e\n\u003cp\u003e“One of the three great sect masters of Yuan Gate… Ren Yuanzi.”\u003c/p\u003e\n\u003cp\u003eBeside her, the jadelike hands of the beautiful woman were clenched tight, while she grimly muttered with some difficulty.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-818\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-820\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-819","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
