{"id":60635,"no":879,"title":"Chapter 877 - Initial Contact","content":"\u003cp\u003eLin Dong’s soft voice unhurriedly rang out through the silence. At the same time, it caused the numerous people, who were immersed in shock, to gradually regain their senses.\u003c/p\u003e\n\u003cp\u003e“He actually won…”\u003c/p\u003e\n\u003cp\u003eMany people looked at one another, and saw the great shock and astonishment that filled all their faces. Even though they had personally witnessed what had happened, they were still unable to accept the shocking reality for a time.\u003c/p\u003e\n\u003cp\u003eThose were three peak initial Profound Life stage experts! Among them, Wei Zhen and Chen Luo even possessed the strength to break through to the advance Profound Life stage!\u003c/p\u003e\n\u003cp\u003eHowever, even though those three powerful people had joined hands, they had still been defeated at Lin Dong’s hands in a single round.\u003c/p\u003e\n\u003cp\u003eThis spectacle was undoubtedly extremely shocking.\u003c/p\u003e\n\u003cp\u003eIn the air, the Shentu Clan referee stared somewhat dumbfoundedly at the scene before him, before gradually regaining his senses a short while later. He looked towards the thin figure standing high in the sky, as graveness gushed out in his eyes. With Lin Dong’s previous performance, he clearly had the qualifications of challenging the heaven-blessed prodigy of their Shentu Clan, Shentu Jue...\u003c/p\u003e\n\u003cp\u003e“Asura Method, Lin Dong’s victory! The Gu Clan wins!”\u003c/p\u003e\n\u003cp\u003eWhen the referee’s deep and low roar rang out within the sky, waves of noise emerged. This ending had really exceeded everyone’s expectations.\u003c/p\u003e\n\u003cp\u003eIn the Wei Clan direction, the faces of the older generation were all ashen. This was an originally a definite win, however, it had been completely reversed. Such a contrast was truly unbearable and hard to accept.\u003c/p\u003e\n\u003cp\u003e“That bastard! Where exactly did he come from?” A Wei Clan older generation exclaimed hatefully while clenching his teeth.\u003c/p\u003e\n\u003cp\u003e“I’ve never heard of him before. I believe that he should not be from the Heaven Wind Sea Region. If not, it won’t be possible for him to be without any fame and reputation.” Another person replied gloomily.\u003c/p\u003e\n\u003cp\u003e“He dares to go against our Wei Clan! Truly a reckless one!” A person exclaimed with a gloomy and sinister expression.\u003c/p\u003e\n\u003cp\u003e“Find out the origins of that brat…”\u003c/p\u003e\n\u003cp\u003eAs many of the older generation at the Wei Clan’s side were flying into a rage, the Gu Clan’s side was instantly enveloped with thunderous cheers of joy and happiness. Every Gu Clan member, even a steady and calm elder like Gu Shou, could not resist the emotion in their hearts, and stood up. Their hands gently hung at their sides, as they continuously nodded their heads.\u003c/p\u003e\n\u003cp\u003e“Such a formidable fellow…”\u003c/p\u003e\n\u003cp\u003eGu Yuntian exhaled deeply, while his eyes filled with admiration. He knew that if he were the one who needed to challenge the Asura Method, he would absolutely not have the courage to do so.\u003c/p\u003e\n\u003cp\u003eGu Mengqi smiled faintly and sweetly, a smile that was gentle and alluring. Her eyes were sparkling with extraordinary splendour, as she looked towards the thin figure in the sky.\u003c/p\u003e\n\u003cp\u003eIn the air, Lin Dong turned around and descended to the Gu Clan seats under the countless watching gazes around him. Upon landing, a fragrance swept towards him, as he saw a smiling Gu Mengqi standing before him. With a gentle voice, she asked, “Are you alright?”\u003c/p\u003e\n\u003cp\u003eLin Dong looked at Gu Mengqi and her alluring smile, as he shook his head. He was indeed unaccustomed to such a gentle tone from the latter. Although she was normally gentle, her gentleness had something that made it difficult for people to get close to her. However, at this moment, that feeling seemed to have vanished completely.\u003c/p\u003e\n\u003cp\u003e“How much longer before we can challenge the Shentu Clan?” Lin Dong ask while looking towards Gu Shou.\u003c/p\u003e\n\u003cp\u003e“Ha ha, don’t worry now. You’ve fought in consecutive battles today, and should be exceptionally tired. Take a rest first for today. Tomorrow, we’ll head up the mountain and commence the final fight.” Gu Shou replied with a smile, while shaking his head. His tone had turned exceptionally good-natured, as Lin Dong had became more and more pleasing to his eye.\u003c/p\u003e\n\u003cp\u003e“After tomorrow\u0027s fight, we’ll be able to decide who the quotas for the Chaotic Tower goes to, right?” Lin Dong asked softly.\u003c/p\u003e\n\u003cp\u003e“Yes.” Gu Shou replied while nodding his heading, before continuing, “After tomorrow, if our Clan is able to obtain the quotas for the Chaotic Tower, you’ll be able to enter the Chaotic Tower.”\u003c/p\u003e\n\u003cp\u003e“Ha ha, I see that little friend Lin Dong here seems to be alone. It just happens that the clan is currently lacking a sinecure. If you are able to stay in the Gu Clan temporarily, I think that you’ll also be able to obtain the quota to enter the Chaotic Tower next year. This should be extremely beneficial to your training.” Gu Shou’s eyes rotated, before suddenly speaking towards Lin Dong with a smile on his face. His words were thick with the intent of enticing Lin Dong. After personally witnessing Lin Dong’s fight today, it was evident that he was extremely moved. Possessing such talent at this age, Lin Dong would indeed be comparable with the Shentu Clan’s Shentu Jue in future.\u003c/p\u003e\n\u003cp\u003eLin Dong shot a look at Gu Shou. Smiling, he shook his head and replied, “I’m sorry elder Gu Shou. I have matters to attend to, and perhaps I will have to leave after handling this matter. Therefore, I’m afraid that I’m unable to stay here for long.”\u003c/p\u003e\n\u003cp\u003eHearing his reply, a sliver of disappointment flashed past Gu Shou’s old face. However, there was nothing else he could say or do, but nod his head and say, “Since that is the case, I won’t force you…”\u003c/p\u003e\n\u003cp\u003eAfter Gu Shou spoke, an old man dressed in blue rose into the sky from where the Shentu Clan was situated. His gaze swept in all directions, before it sparkled swiftly and fiercely, and finally came to a rest on Lin Dong’s body. His gaze was somewhat grave. Obviously, the usually haughty Shentu Clan felt somewhat threatened by Lin Dong.\u003c/p\u003e\n\u003cp\u003e“That’s the Shentu Clan elder, Shentu Tao…” Gu Shou said in a soft voice.\u003c/p\u003e\n\u003cp\u003e“According to the results, the Gu Clan has won today’s martial gathering. They now possess the qualifications to challenge the Shentu Clan. If they’re able to win again, this year’s quotas for entering the Chaotic Tower will be given to the Gu Clan.”\u003c/p\u003e\n\u003cp\u003eThe blue robed elder’s vigorous voice swept across the area, as strong Yuan Power drummed within, causing people’s eardrums to feel a piercing pain.\u003c/p\u003e\n\u003cp\u003e“What will the format for tomorrow’s fight for the tower be?” After listening to the vigorous voice, Lin Dong posed his question.\u003c/p\u003e\n\u003cp\u003e“There aren’t much limitations. As long as you’re able to defeat the tower’s defender, Shentu Jue, that will be it... naturally, we can also send three people.” Gu Shou replied.\u003c/p\u003e\n\u003cp\u003e“Three people, huh…” Lin Dong muttered to himself, before slowly shaking his head, “In fights like this, having more people present will instead make it more complicated...”\u003c/p\u003e\n\u003cp\u003eAlthough Lin Dong had yet to cross hands with Shentu Jue, he was already able to sense how powerful he was, and how difficult it would be to deal with him. He was indeed much stronger compared to Wei Zhen and Chen Luo. Facing such an opponent, simply relying on a numbers may result in failing to achieve the expected advantage.\u003c/p\u003e\n\u003cp\u003e“You mean that…” Gu Shou’s gaze sharpened, before looking at Lin Dong, “You’re going to continue fighting solo?”\u003c/p\u003e\n\u003cp\u003eLin Dong nodded his head. It was not that he wanted to boast, but he did not wish for teammates without prior chemistry to disrupt his attacks, as that would instead reduce his battle power. He knew that the battle with Shentu Jue would be a hard one. However, for the sake of entering the Chaotic Tower, it was absolutely impossible for him to stop here.\u003c/p\u003e\n\u003cp\u003eGu Shou hesitated for a while, before finally nodding his head as he said, “Since you insist, we’ll follow your wishes. However, you have to be more careful. Shentu Jue… is very strong.”\u003c/p\u003e\n\u003cp\u003eAlthough Gu Shou wished to say that Shentu Jue was someone that people like Wei Zhen could not match up to, he now knew that the youth in front of him was also no ordinary individual. Lin Dong’s performance today had practically won everyone over, and at the same time, had cleared all the doubts and suspicions placed on him.\u003c/p\u003e\n\u003cp\u003eUpon hearing Gu Shou’s grave tone, Lin Dong nodded his head faintly. How could a figure, that was dreaded by all the geniuses within the four great clans, be dealt with so easily?\u003c/p\u003e\n\u003cp\u003eIn the distance, the Shentu Clan elder turned around and left after his final announcement. The countless experts in the area gradually scattered, as they prepared to return to the city at the foot of the mountain.\u003c/p\u003e\n\u003cp\u003eUpon seeing this, Lin Dong also prepared to leave with the Gu Clan members. However, just as he took a step forward, his expression suddenly turned serious as he abruptly turned his head around, and looked towards the summit of the mountain. Above the peak, a figure was standing upright in midair. A heavy aura, which made one feel difficulty breathing, was faintly discernible as it slowly radiated out.\u003c/p\u003e\n\u003cp\u003e“That is…”\u003c/p\u003e\n\u003cp\u003eIn the surrounding area, everyone who was originally leaving stopped in their tracks, as their stunned gazes looked towards the figure at the mountain peak. Subsequently, their expressions turned grave, as they sensed the pressure from the formidable aura.\u003c/p\u003e\n\u003cp\u003e“Iron Asura Shentu Jue!”\u003c/p\u003e\n\u003cp\u003eCries of shock and alarm suddenly rang out, followed by an uproar. Many of those present were quite familiar with this name.\u003c/p\u003e\n\u003cp\u003e“That’s Shentu Jue, huh…” Lin Dong muttered as eyes slightly trembled.\u003c/p\u003e\n\u003cp\u003eUnder the attention of countless gazes, the gaze of the figure at the mountain summit skipped over the massive crowd, before coming to a rest on Lin Dong’s body.\u003c/p\u003e\n\u003cp\u003eBang!\u003c/p\u003e\n\u003cp\u003eAs that gaze shot over, solemness suddenly flashed within Lin Dong’s eyes. In the next instant, he felt the Yuan Power in the sky in front of him frantically gather. It condensed into a Yuan Power mountain peak, which viciously fell downwards.\u003c/p\u003e\n\u003cp\u003eLin Dong raised his head, and looked towards the descending Yuan Power mountain peak. With a flick of his finger, a scarlet red flash of light shot out, transforming into a giant cauldron, that directly clashed with the Yuan Power mountain peak!\u003c/p\u003e\n\u003cp\u003eClang!\u003c/p\u003e\n\u003cp\u003eA clear ringing sound rang out, as the Yuan Power mountain peak instantly crumbled. The giant cauldron was sent shooting backwards, before finally tunnelling back into Lin Dong’s body.\u003c/p\u003e\n\u003cp\u003eLin Dong raised his head, and looked at the figure with a stern gaze, while slowly saying, “Do you wish to bring the match forward?”\u003c/p\u003e\n\u003cp\u003e“Ha ha…”\u003c/p\u003e\n\u003cp\u003eThe figure at the mountain summit seemed to chuckle softly. Subsequently, everyone could hear a low muttering voice ring out, “You’re truly an interesting fellow. Go take a good night’s rest. With your current condition, I’m afraid you aren’t capable of such a feat…”\u003c/p\u003e\n\u003cp\u003e“Tomorrow, I’ll wait for you in front of the Chaotic Tower.”\u003c/p\u003e\n\u003cp\u003eAs those words appeared, the figure slowly descended, and finally disappeared.\u003c/p\u003e\n\u003cp\u003eLin Dong looked towards the place where the figure had disappeared. His eyes gradually narrowed into a somewhat dangerous arc.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-876\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-878\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-877","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
