{"id":60652,"no":896,"title":"Chapter 894 - Leave","content":"\u003cp\u003e“You\u0027re leaving tomorrow?”\u003c/p\u003e\n\u003cp\u003eGu Mengqi’s pretty face was clearly extremely stunned after hearing Lin Dong utter such words. Her eyebrows were knitted slightly, as she looked at the young man in front of her and said, “That Nefarious Bone old man will attack you once you leave Martial Gathering Island…”\u003c/p\u003e\n\u003cp\u003eAlthough Lin Dong’s victory over Shentu Jue previously had already allowed others to understand his strength, the Nefarious Bone old man was clearly not someone whom a younger generation member like Shentu Jue could compare with.\u003c/p\u003e\n\u003cp\u003e“Continuing to remain here is also not a solution. I will think of a way to deal with that Nefarious Bone old man.” Lin Dong smiled and replied.\u003c/p\u003e\n\u003cp\u003eAfter the discussion with the Ancestor Stone, his fear towards the Nefarious Bone old man had diminished somewhat. Moreover, he also clearly understood that he would not be able to avoid this problem known as the Nefarious Bone old man, if he wished to successfully leave Martial Gathering Island.\u003c/p\u003e\n\u003cp\u003eGu Mengqi’s umber black brows were tightly bunched together, while her pupils firmly stared at Lin Dong. She was really unable to understand where Lin Dong’s confidence came from. He actually felt that he was able to deal with a seasoned expert like the Nefarious Bone old man, who was quite well known within the Heavenly Wind Sea Region.\u003c/p\u003e\n\u003cp\u003eLin Dong smiled as he met Gu Mengqi’s gaze. This continued for a moment, before the latter helplessly turned her gaze away and said, “Since you have already made up your mind, it will not do for me to force you. However, if the situation develops beyond your control, you are always welcome to return to Martial Gathering Island anytime you wish. Our Gu clan will definitely protect you.”\u003c/p\u003e\n\u003cp\u003e“Many thanks.”\u003c/p\u003e\n\u003cp\u003eLin Dong sincerely replied. Although the Gu Clan and him were merely cooperating to further their own ends in the beginning, this protection afforded by the latter had made a good impression on him.\u003c/p\u003e\n\u003cp\u003e“Additionally, if you wish to obtain the sea maps of unknown sea regions, you can perhaps go and visit the Sky Merchant Region. It is the most flourishing region in the vicinity, and an extremely large sky merchant auction occurs every half a year. You should be able to gain something in that place.” Gu Mengqi said.\u003c/p\u003e\n\u003cp\u003e“Sky Merchant Region? Sky Merchant Auction…” Lin Dong was startled. Immediately, joy surged in his eyes. The most important thing for him to do now was to search for those unknown sea region maps. Such sea maps could only be found a large scale auction like this…\u003c/p\u003e\n\u003cp\u003e“There is still around a month until the next Sky Merchant Auction. I’ve helped you mark out the path on the Chaotic Demon Sea sea map.” Gu Mengqi said in an attentive manner.\u003c/p\u003e\n\u003cp\u003e“Thank you.” Lin Dong thanked her once again. His expression was filled with gratitude.\u003c/p\u003e\n\u003cp\u003e“It is also an investment for me. I feel that you will sooner or later become a renowned expert in this Chaotic Demon Sea. The reason I am giving you all these benefits now, is because I wish to establish some early connections with you.” Gu Mengqi smiled sweetly and replied.\u003c/p\u003e\n\u003cp\u003eLin Dong grinned and nodded heavily. He said, “Miss Mengqi, please be reassured that as long as it is within my ability, I will definitely do my best to help you.”\u003c/p\u003e\n\u003cp\u003eGu Mengqi laughed softly. Soon after, she lifted her head. Her pretty eyes observed that young face with distinct features, and softly said, “Take care.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eLin Dong smiled and nodded. He turned his head towards another direction on Martial Gathering Island, as a chilling light steadily surfaced in his eyes.\u003c/p\u003e\n\u003cp\u003eOld ghost, since you wish to take my life, let’s see if you have the qualifications to do so…\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eJust as the sunlight tore through the clouds the next morning, a light figure rushed out from the Gu Clan. After which, it raised its speed to the limit, and flew out of the island.\u003c/p\u003e\n\u003cp\u003eAt a certain area in the Gu Clan, Gu Shou lifted his head and watched the swiftly disappearing figure. He fondled his beard, and sighed after a long while, as he muttered, “Little friend Lin Dong, you are really too reckless…”\u003c/p\u003e\n\u003cp\u003e“He has always been very cautious. It is likely that he has his own considerations for him to act in this manner.” Gu Mengqi softly remarked from behind.\u003c/p\u003e\n\u003cp\u003e“That Nefarious Bone old man is an expert at the half a step to the Profound Death stage… regardless of what kind of tricks Lin Dong has, don’t tell me that he can really fight with the latter?” Gu Shou shook his head and replied.\u003c/p\u003e\n\u003cp\u003eGu Mengqi became silent. She only lifted her head a moment later, and muttered to herself, “Such a thing… who knows…”\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003e“Ah, is he finally unable to endure any longer,,,”\u003c/p\u003e\n\u003cp\u003eThe Nefarious Bone old man, who was chatting with an elder of the Wei Clan in the courtyard of the Wei manor, suddenly raised his head the moment Lin Dong moved. His eyes looked in the direction that Lin Dong had fled towards, as a dark and cold smile surfaced on his elderly face.\u003c/p\u003e\n\u003cp\u003e“Master, has that brat fled?” Behind the Nefarious Bone old man, Chen Luo’s mouth parted into a smile as he asked.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eThe Nefarious Bone old man nodded. He stood up with the bone walking stick in his hand and said, “You will remain here. I will go and finish off that brat first.”\u003c/p\u003e\n\u003cp\u003e“Ha ha, in that case, we will be waiting for your good news here.” That elder from the Wei Clan smiled faintly. Lin Dong had caused their Wei Clan to lose a great amount of face during the martial gathering. He was naturally extremely willing to enjoy the show now that Lin Dong was in trouble.\u003c/p\u003e\n\u003cp\u003e“He is but someone from the younger generation.”\u003c/p\u003e\n\u003cp\u003eThe Nefarious Bone old man casually remarked. Without further ado, he waved his sleeve, and his body turned into a grey light that charged to the sky. After which, it hurried in the direction Lin Dong had fled towards with shocking speed.\u003c/p\u003e\n\u003cp\u003eChen Luo and Wei Zhen watched the figure of the Nefarious Bone old man, and could not help but smile at each other. A gloating expression filled their smiles. If Lin Dong really planned to continue hiding within this Martial Gathering Island, things would likely become a little troublesome. This move of Lin Dong to leave was undoubtedly suicidal in their eyes.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eSwoosh!\u003c/p\u003e\n\u003cp\u003eA light figure hurried over the vast and endless sea at a shocking speed. This speed not only tore the air apart, but also left behind a deep water scar on the surface of the sea.\u003c/p\u003e\n\u003cp\u003eThis light figure was naturally Lin Dong, who had came from Martial Gathering Island. At this moment, he had already summoned the green dragon wings on his back. Clearly, he had raised his speed to the limit.\u003c/p\u003e\n\u003cp\u003eA salty wind blew at Lin Dong, causing his clothes to flutter. He lifted his eyes and looked at the seemingly endless ocean. Finally, he inhaled a deep breath and asked in his mind, “Is everything prepared?”\u003c/p\u003e\n\u003cp\u003e“Yes.” The Ancestor Stone Spirit replied in a faint voice. However, there was excitement in his voice.\u003c/p\u003e\n\u003cp\u003e“Ancestor Stone, do you have a name?” Lin Dong suddenly asked.\u003c/p\u003e\n\u003cp\u003e“Name?” The Ancestor Stone Spirit was clearly startled by this sudden question of Lin Dong. It was a long while later before he replied, “My previous owner calls me ‘Yan’.”\u003c/p\u003e\n\u003cp\u003e“Yan…” Lin Dong muttered softly. He immediately nodded, as his eyes glanced at the distant rear. A heroic feeling suddenly surged within his heart. So what if you are at the half step to Profound Death stage? As long as this old ghost dared to chase him today, he would definitely make this old ghost to pay the price!\u003c/p\u003e\n\u003cp\u003e“There is an uninhabited island in northwest of us. Let’s head there. We are already very far from Martial Gathering Island.” Yan once again reminded.\u003c/p\u003e\n\u003cp\u003e“Additionally, that Nefarious Bone old man has also given chase. He should catch up to you in another hour.”\u003c/p\u003e\n\u003cp\u003e“Noted.”\u003c/p\u003e\n\u003cp\u003eLin Dong nodded, as the green dragon wings on his back suddenly flapped. Immediately, a dragon roar was emitted from within his body. Green light surged over his body, as he directly turned into a green ray of light that shot across the sky and rushed in the north west direction at a shocking speed.\u003c/p\u003e\n\u003cp\u003eThis flight continued for another ten minutes, before an island appeared before Lin Dong’s eyes on the distant sea surface. However, this island did not have any human figures. Clearly, it was an uninhabited island.\u003c/p\u003e\n\u003cp\u003eLin Dong’s gaze scanned this small island. Immediately, his body landed on a mountain top on this small island. After which, he sat down and inhaled deeply, however, traces of excitement surged in his eyes. He flipped his hand, and the Burning Sky Cauldron appeared within it. Bright red light surged, appearing just like a rising flame.\u003c/p\u003e\n\u003cp\u003e“Nefarious Bone old ghost… even the three great sect chiefs of the Yuan Gate have failed to take my life. What right do you, as a half step to Profound Death stage expert have to do so?”\u003c/p\u003e\n\u003cp\u003e“Since you wish to fight, I shall fight with you until the end!”\u003c/p\u003e\n\u003cp\u003eLin Dong lifted his gaze. He looked at the distant sky, as a ferocious expression surged within his pupils.\u003c/p\u003e\n\u003cp\u003eThis wait continued for over ten minutes. Soon after, a rushing wind sound appeared in the distance, and Lin Dong abruptly lifted his head. A grey light had appeared within his sight. Finally, this light tore through the air, and appeared in the sky above the small island. The light disappeared, revealing an old man with a white bone walking stick in his hand. It was the Nefarious Bone old man.\u003c/p\u003e\n\u003cp\u003eThe Nefarious Bone old man stood in the air. His face revealed a mocking expression as he looked at Lin Dong below. After which, his eyes swept around, and he spoke indifferently, “You have chosen a good burial site…”\u003c/p\u003e\n\u003cp\u003eLin Dong once again inhaled a deep breath of the salty air. The scarlet red intensified, as he parted his mouth and laughed, “Nefarious Bone old ghost, I’ve chosen this place for you.”\u003c/p\u003e\n\u003cp\u003eThe Burning Sky Cauldron in Lin Dong’s hand suddenly swelled after his voice sounded. It turned into a large cauldron that was thousands of feet in size. The cauldron hovered in the sky, as wave after wave of shocking fluctuations swept apart.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-893\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-895\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-894","bookId":1514,"creation":"Sep 10, 2019 7:28:54 AM","modification":"Sep 10, 2019 7:28:54 AM"}
