{"id":60680,"no":924,"title":"Chapter 922 - Strike","content":"\u003cp\u003e\u003cspan\u003eLin Dong’s expression was grave as he looked at old demon Mo Xie from the air. His lips pursed slightly. The appearance of the latter had somewhat exceeded his expectations. He had never imagined that there would actually be a true top expert, who had stepped into the Profound Death stage, at Xie Yan’s side… \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe strength of this old demon Mo Xie was clearly even greater than the Nefarious Bone old man.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“This is a little troublesome…” Lin Dong frowned. With this, the development of the situation was clearly not as smooth as he had imagined.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Lin Dong, why? You seem to be extremely surprise, right?” Xie Yan saw the slight change in Lin Dong’s expression, and involuntarily let out a cold laugh. He spoke in a sinister voice, “I have already warned you that there are some people whom you cannot afford to offend. Now, you will have to pay the price for your foolishness.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“It is a little too early for you to celebrate.” Lin Dong looked at Xie Yan, whose mood seemed to have soared in an instant, and could not help but sneer in response.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Do you think that you will be able to escape today?” Xie Yan mocked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Who says that I am going to escape?” Lin Dong smiled in a strange fashion. Soon after, he stared at old demon Mo Xie as he laughed, “Aren’t you very curious to know how I beat up the Nefarious Bone old man to such a state? I will give you an answer now.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Swoosh!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Dong waved his sleeve after his voice sounded. A scarlet red glow shot out from his sleeve, and transformed into a large crimson cauldron that was suspended itself in the air. Wave after wave of shocking ripples continued to sweep out from within the Burning Sky Cauldron.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Pure Yuan treasure?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOld demon Mo XIe gazed at the Burning Sky Cauldron, as the expression in his eyes fluctuated a little. Soon after, he let out a strange laughter, “It is unexpected that you are actually in possession of such a treasure.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe eyes of this old demon Mo Xie were extremely sharp. He instantly saw that this Burning Sky Cauldron of Lin Dong seemed to be of the high grade level. A Pure Yuan treasure of this grade could be considered a top tier treasure even in the Demonic Wind Cave. It was indeed a little believable that Lin Dong had managed to use this thing to catch the Nefarious Bone old man off-guard.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“However, this kind of treasure is not something that a brat like you can control. You should leave it in this elder’s care.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOld demon Mo Xie laughed strangely. His voice was dripping with greed. A high grade Pure Yuan Treasure was something that even he did not possess. If he was able to snatch this Burning Sky Cauldron today, it was likely that he would not need to have much to fear even when encountering a top expert at the perfect Profound Death stage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“You should show me your ability if you wish to snatch my possession.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Dong’s mouth parted, and smiled strangely towards old demon Mo Xie. After which, he turned his head and spoke towards Mu Lingshan beside him, “I will deal with this old ghost. The rest will be left to you. What do you say?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“No problem.” Mu Lingshan nodded in excitement. Currently, she had already recovered her strength, and had reached the perfect Profound Life stage. That Xie Yan was merely at the peak of the advance Profound Life stage. It was extremely difficult for him to pose much of a threat towards her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Dong chuckled upon seeing this. His eyes suddenly turned ice-cold after turning his head. The seals formed by his hands changed, and a scarlet red light pillar immediately erupted from the Burning Sky Cauldron and covered old demon Mo Xie.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Tsk tsk, this elderly self will not be as arrogant as that Nefarious Bone old man.” However, old demon Mo Xie’s body moved in a ghost like fashion after seeing the light pillar shot over, and avoided it. He was a cautious and paranoid person. Since he knew that the Nefarious Bone old man had been wounded by the Burning Sky Cauldron, it was only natural that he would not easily allow Lin Dong to suck him in.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Whether or not you enter will not be up to you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eHowever, Lin Dong merely laughed coldly as he looked at old demon Mo Xie, whose body drifted in a ghost like fashion. If this was before the Burning Sky Cauldron had the eight Burning Sky Gates, he might perhaps be unable to forcefully suck this old demon Mo Xie into the Burning Sky Cauldron. However, it was a completely different now… \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBang!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Dong’s hand seals changed at lightning speed. The Burning Sky Cauldron immediately shook and actually vanished into nothingness.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Huh?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eAs his body rapidly pulled back, old demon Mo Xie’s expression changed. However, before he could react, a shadow suddenly descended from the sky at an indescribable speed. Scarlet red light flashed, and swallowed him in a single movement like a mouth of a strange beast.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Lingshan, attack quickly and snatch the silver tower!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Dong immediately cried out in a stern voice when he saw old demon Mo Xie swallowed into the Burning Sky Cauldron. His body moved and immediately rushed into it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“This brat…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eXie Yan gazed at the Burning Sky Cauldron which had swallowed old demon Mo Xie, as his expression changed a little. However, he quickly laughed coldly, “You overestimate yourself. Do you think that you can trap elder Mo Xie by simply relying on a Pure Yuan treasure? He is a genuine Profound Death stage expert, and is many times stronger than the Nefarious Bone old man!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Hey, are you going to hand over the silver tower, or do I have to do it?” Mu Lingshan’s small and petite body drifted in front of Xie Yan. Her smiling appearance was extremely cute.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“You foolish little thing. Do you really think I am someone who would go easy on a girl? Kill her!” Xie Yan’s eyes were dark and cold. He was already extremely angry at Mu Lingshan since back then at the auction ground. It was only natural that he was filled with hatred now that they had met.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Understood!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eA couple of people behind him immediately cried out after hearing his command. Mighty Yuan Power erupted. The sharp longswords in their hands drew a sharp arcs, before ruthlessly attacking Mu Lingshan.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eMu Lingshan frowned a little upon seeing this. After which, she clenched her tiny hand tightly and threw a punch forward.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eRumble!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eYuan Power appeared to have turned into a large wave in front of her as the punch was thrown. Blue light surged and a huge whale appeared. It was accompanied by a vast and mighty force, as it ruthlessly struck the attackers.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBang bang!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe enormous whale ferociously collided into the attacks of those few individuals. After which, their attacks immediately fell apart. The longswords wrapped in Yuan Power in their hands also crumbled to pieces an inch at a time. A tremendous force struck, causing the chests of those individuals to cave in. Several mouthful of fresh blood were spat out wildly, and their body were pushed along the ground, creating long scars… \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eXie Yan had an ugly expression as he watched his subordinates being sent flying with one punch from Mu Lingshan. Astonishment gradually surged in his eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“It is your turn.” Mu Lingshan smilingly looked at Xie Yan and said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Underworld King Sky Shattering Technique!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eXie Yan expression was grim. He quickly stepped forward. Immediately, monstrous dark Qi swept out from within his body. There was an evil aura vaguely present. It appeared to have transformed into an enormous illusionary figure behind him, as a powerful pressure unfurled.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“You do have some ability.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eMu Lingshan’s large eyes contained some surprise, as she looked at Xie Yan. With a laugh, both of her hands hugged the air, and the Life Death Coffin Cover, which was twice her size, appeared in a flash. Immediately, her toes pushed off the empty space, and her petite body drew past the air. The Life Death Coffin Cover in her hand emitted layers of black light, as it ruthlessly swatted at Xie Yan.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e　　……\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eWithin the Burning Sky Cauldron.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOld demon Mo Xie’s expression was slightly gloomy as he watched Lin Dong floating in the air in front of him. His eyes swept over the space within the cauldron, as he laughed in a strange manner, “I must say that you do possess some skills. However, what can you do to me even if you manage to get me into this cauldron?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“I have my own means to finish you off.” Lin Dong grinned and said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Is that so?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe eyes of old demon Mo Xie turned chilly. He took a step forward, and his body strangely disappeared. In the next instant, he appeared beside Lin Dong. After which, a sharp claw with black light circling around it grabbed at Lin Dong’s back.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eSizzle!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eA black corpse flashed and appeared in a ghost like fashion just as the attack was about to land on Lin Dong’s body. It did not appear to do anything. All it did was simply stand behind Lin Dong like a meat shield that forcefully received that strike.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBang!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOld demon Mo Xie’s attack heavily landed on the Sky Devouring Corpse. However, there was not much of an effect. A low and deep muffled sound appeared, and the Sky Devouring Corpse jerked slightly, as that ripple with a Death Qi completely vanished.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“What?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eA stunned expression flashed across the elderly face of old demon Mo Xie, after seeing that his attack was unable to do even the slightest damage to the Sky Devouring Corpse.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“I might be difficult to last even a couple of exchanges against you in a direct fight. However, you will not be able to even touch my body in this place.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Dong floated backwards as he gave old demon Mo Xie a strange grin. Immediately, his hand seals changed. Fluctuations suddenly appeared in the sky. Soon after, eight enormous scarlet red gates emerged in the air.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eBang bang!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eThe energy within the Burning Sky Cauldron quickly became violent after these eight gates appeared. It seemed as if flames were sweeping across the sky.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eOld demon Mo Xie lifted his head to look at the eight scarlet red gates that had appeared in the sky. His face finally became extremely grave and frightened after sensing the frightening ripples from them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Originally, this was planned to be enjoyed by the Nefarious Bone old man. However, since you have come first, I will let you have a taste of it!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003eLin Dong grinned at old demon Mo Xie. His eyes quickly became solemn, as a low cry resounded.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan\u003e“Eight level Burning Sky Formation, Moving Sky Gates!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-921\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-923\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-922","bookId":1514,"creation":"Sep 10, 2019 7:28:55 AM","modification":"Sep 10, 2019 7:28:55 AM"}
