{"id":59853,"no":97,"title":"Chapter 97: Kill!","content":"\u003cp\u003eChapter 97: Kill!\u003c/p\u003e\n\u003cp\u003eFrom start to end, Lin Dong’s actions did not carry even the slightest hint of hesitation. Even Gu Ying did not expect that this immature looking youngster could be so ruthless and not the least bit sloppy when he finally executed the killing blow.\u003c/p\u003e\n\u003cp\u003eThe sharp pain from his throat caused Gu Ying to be unable to make any noise as blood continuously overflowed from his mouth. His eyes were staring at that youth’s face with a hint of fear. No matter what, he was still the deputy head of Yan City’s Blood Cloth Sect. Therefore, he had thought that even if any mishaps occur, the Lin Family would not dare to harm him due to his status. However, the cold reality made him understand that this time, he had overextended himself…\u003c/p\u003e\n\u003cp\u003eIf he had brought along some experts, how could he have ended up in such a sorry state?\u003c/p\u003e\n\u003cp\u003eAs his vision rapidly darkened, his hands defiantly latched onto Lin Dong’s arms. With bloody foam bubbling out from his mouth, his barely understandable voice was tinged with hatred and resentment as it sounded out in Lin Dong’s ears: “The Blood Cloth Sect will not let this matter rest!”\u003c/p\u003e\n\u003cp\u003eLin Dong’s facial expression did not change. In this short period of time, he understood that Gu Ying was someone who would definitely seek vengeance even for the most pettiest of grievances. If they merely repelled him this time, he would definitely be a major threat in the future. Since he had his eye on the Lin Family’s Yang Yuan Lode, the next time he returned, he would probably bring along every expert in the Blood Cloth Sect…\u003c/p\u003e\n\u003cp\u003eEven though Lin Dong was still young, he clearly knew the consequences of releasing a tiger back into the mountains. Therefore, it was best to finish off a person like Gu Ying right now. After all, once he returned, the Lin Family would definitely face an even graver danger than today.\u003c/p\u003e\n\u003cp\u003eAs he extracted the Shattered Yuan Shrapnel from Gu Ying’s throat, Lin Dong promptly extended his arm into Gu Ying’s clothes. Moments later, he actually pulled out a Qian Kun Bag and unceremoniously kept it. Then, with a jerk of his arm, Gu Ying’s corpse slowly began to slump.\u003c/p\u003e\n\u003cp\u003e“Thud!”\u003c/p\u003e\n\u003cp\u003eThe sound of the corpse falling was not distinct in the chaotic hall. However, at this moment, several people’s minds seemed to have received a jolt as gazes were involuntarily directed towards his direction.\u003c/p\u003e\n\u003cp\u003eWhen these gazes found Gu Ying’s corpse, the air in the large hall seemed to freeze up. Even the war cries from outside the hall seemed to have stealthily faded away…\u003c/p\u003e\n\u003cp\u003e“Gu Ying died?”\u003c/p\u003e\n\u003cp\u003eEveryone’s hearts were in turmoil as they gazed at the wide-eyed staring corpse of Gu Ying looking as if he had died with grievances. They were evidently unable to associate the current him with that majestic look of a 2nd Seal Symbol Master that he had before.\u003c/p\u003e\n\u003cp\u003eThese gazes lingered on Gu Ying’s corpse for a while before they violently turned towards the youth nearby. When they saw that bloodied Shattered Yuan Shrapnel in that boy’s hand, a sudden chill ran through their bodies.\u003c/p\u003e\n\u003cp\u003e2nd Seal Symbol Master. Even in Yan City, a person like this would be treated as a VIP by every faction. However, right now, this “VIP” was actually killed by a mere sixteen or seventeen years old youngster.\u003c/p\u003e\n\u003cp\u003eThis scene was too mind-blowing, so mind-blowing that one could hardly believe it.\u003c/p\u003e\n\u003cp\u003e“The Lin Family is going to be victorious…”\u003c/p\u003e\n\u003cp\u003eWhen they gradually recovered their senses, this thought flashed across several people’s minds. The strength that the Lin Family had displayed today vastly exceeded all of their expectations. This strength was something that even the Lei and Xie Family alliance could not hope to match up against.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eIn the middle of the large hall, two figures were sweeping across it like a hurricane. No one dared to obstruct their passage. Even the mere aftershocks of a battle between two Initial Yuan Dan practitioners was not something that a Heavenly Yuan Expert could handle.\u003c/p\u003e\n\u003cp\u003eLin Zhentian and Lei Bao had fought bitterly for a while. However, since they were both at Initial Yuan Dan Stage, it was impossible for them to settle this duel in a short period of time.\u003c/p\u003e\n\u003cp\u003eNonetheless, after a long duel, numerous traces of injuries had appeared all over their bodies and their powers seemed to have weakened. Having tangled for so long, it was expected that they had expended much of their energy.\u003c/p\u003e\n\u003cp\u003e“Gu Ying is dead!”\u003c/p\u003e\n\u003cp\u003eWhen this alarmed cry rang out in the giant hall. The two figures, which were originally stable, suddenly staggered. Immediately, their eyes turned towards the same direction as an ice-cold corpse on the ground appeared in their visions.\u003c/p\u003e\n\u003cp\u003e“Gulp…”\u003c/p\u003e\n\u003cp\u003eWhen they two of them saw the corpse, they almost simultaneously gulped. Meanwhile, Lei Bao’s face turned a chilling white. After all, he had never expected that Gu Ying would not only fail to kill Lin Dong, but instead end up killed by the latter.\u003c/p\u003e\n\u003cp\u003eOf course, besides Lei Bao, even Lin Zhentian, whom always had quite a lot of faith in Lin Dong, had to violently suck in two breaths before he could accept this dream-like scenario that had occurred.\u003c/p\u003e\n\u003cp\u003eAt first, he thought that Lin Dong would only be able to delay Gu Ying. However… he never expected that Lin Dong would directly chose the most efficient method.\u003c/p\u003e\n\u003cp\u003e“Gu Ying, your trump card is no more!” Lin Zhentian slowly said.\u003c/p\u003e\n\u003cp\u003eA dark expression hung on Lei Bao’s face as he stared at Lin Zhentian. Suddenly, he released an eerie laugh as he muttered: “ Old Ghost Lin, you should not be celebrating so soon. Gu Ying is the deputy head of the Blood Cloth Sect and since he died at the hands of Lin Dong. Hehe, the Blood Cloth Sect will definitely pursue this matter. At that time, your Lin Family will all be slaughtered until no chickens or dogs are left!”\u003c/p\u003e\n\u003cp\u003e“I have said this before, my Lin Family is like a solid piece of bone. Whoever wants to take a bite out of us must be prepared for their teeth to crack. This is what happened to your Lei Family and the same will happen to the Blood Cloth Sect!” Lin Zhentian icily chuckled. Since the situation had already evolved to this stage, no further words were necessary. After all, even if they did not kill Gu Ying, the latter was probably not going to drop this matter so easily. Therefore, it was better to directly finish him off.\u003c/p\u003e\n\u003cp\u003e“Once I destroy your old bones, the Lin Family will naturally crumble!” Lei Bao eerilylaughed as he said. After all, the Lin Family’s base was still weak and their core member was Lin Zhentian. Hence, once he fell, the Lin Family would have no reason to exist.\u003c/p\u003e\n\u003cp\u003e“If you want to destroy this old man’s bones, I am afraid you don’t have the ability!” Lin Zhentian arrogantly laughed as he said.\u003c/p\u003e\n\u003cp\u003e“We shall see!”\u003c/p\u003e\n\u003cp\u003eLei Bao chuckled as a powerful Pure Yuan Gang Energy swiftly gathered on his arms. Its bright glow was akin to an electricity as it swiftly spread out with a deep roar. That stance was the Lei Family’s Grade 4 Martial Arts, Dashing Lightning Ball. However, in the hands of Lei Bao, this Grade 4 Martial Arts looked like a thousand lightning bolts gathering together, extremely terrifying.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eLei Bao’s leg viciously stomped on the ground. His body was just like a fluttering mass of light as he rapidly dashed towards Lin Zhentian. As he dashed forward, the floor on the giant hall was forcefully split apart causing several inches deep cracks to appear.\u003c/p\u003e\n\u003cp\u003eWhen he saw Lei Bao practically using his full might to attack, Lin Zhentian did not even plan to retreat for a moment. He gripped his hands together as he began to form a series of hand-seals.\u003c/p\u003e\n\u003cp\u003eThese hand seals were rather familiar. Upon closer inspection, one would realize that this was the Lin Family’s Wonder Gate Seal. However, when Lin Zhentian reached the end of the incomplete chapter, he did not stop. Instead, he continued to execute different hand seals. This was because Lin Dong had long imparted the third chapter of Wonder Gate Seal to Lin Zhentian and the rest. Therefore, right now, this Wonder Gate Seal was no longer incomplete!\u003c/p\u003e\n\u003cp\u003eA strong and solid Pure Yuan Gang Energy swiftly condensed between Lin Zhentian’s hand and his rapidly changing hand seals finally ended when he finished the third chapter. At that moment, a glaringly bright seal crystallized!\u003c/p\u003e\n\u003cp\u003eWhen that glowing seal crystallized, Lin Zhentian lifted his head. As he faced the figure of light that was rapidly growing larger in his eyes, without a moment’s hesitation, he immediately launched his fist. In the next instance, a deep sonic boom sound echoed from that glowing seal as it viciously slammed against that glowing mass!\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eA powerful shockwave exploded in the middle of the large hall, as every door in the hall was instantly reduced to dust. A powerful wind emerged from the epicenter and even the sorry figures of Heavenly Yuan Stage experts were forcefully blown out of the large hall and into the courtyard.\u003c/p\u003e\n\u003cp\u003e“Bang!”\u003c/p\u003e\n\u003cp\u003eJust as everyone was blown out of the large hall, the pillars of the large hall began to collapse. In just a few seconds, amidst a loud commotion, the entire giant hall was reduced to a pile of rubble…\u003c/p\u003e\n\u003cp\u003eThe open area outside the hall quickly became extremely chaotic. When forces on both sides landed on the ground, they immediately turned to look at that pile of rubble. After all, everyone knew that this battle was the decisive one.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eAmidst the gazes of the crowd a bloodied figure was violently ejected from the middle of that dust cloud hovering above the rubble before he awkwardly landed on the ground, his bloodied body on the verge of collapse.\u003c/p\u003e\n\u003cp\u003e“Father!”\u003c/p\u003e\n\u003cp\u003eWhen they saw the identity of the figure, Lin Xiao and the rest were instantly delighted.\u003c/p\u003e\n\u003cp\u003eHowever, before their happiness could fully take shape on their faces, nearby, a figure suddenly violently dashed forward. Meanwhile, a sharp dagger in his hand was violently directed towards the stumbling Lin Zhentian.\u003c/p\u003e\n\u003cp\u003e“Xie Qian!”\u003c/p\u003e\n\u003cp\u003eThis sudden development caused Lin Xiao and the rest’s facial expression to change drastically. When they saw the identity of that perpetrator, shouts immediately rang out.\u003c/p\u003e\n\u003cp\u003eHowever, Xie Qian chose to disregard their shouts. He was keenly aware of how important Lin Zhentian was to the Lin Family. If he could take that man’s life, the Lin Family will surely fall apart!\u003c/p\u003e\n\u003cp\u003eRight now, their Lei and Xie Families were definitely at a disadvantaged position. If Lin Zhentian survived, they would be doomed forever!\u003c/p\u003e\n\u003cp\u003e“Time to die old ghost!’\u003c/p\u003e\n\u003cp\u003eXie Qian’s speed was terrifying quick. In a flash, he appeared in front of the extremely weak Lin Zhentian. Meanwhile, under the horrified gazes of Lin Xiao and the rest, the dagger violently arced towards the latter’s throat.\u003c/p\u003e\n\u003cp\u003e“Shlick!’\u003c/p\u003e\n\u003cp\u003eThe deep sound of blade cutting flesh echoed out as fresh blood spluttered out. Xie Qian’s arm suddenly stopped as he slowly lowered his head only to see that mysteriously, a handle less blade had penetrated his chest. He immediately spat out a mouthful of fresh blood.\u003c/p\u003e\n\u003cp\u003eWhen he fell to the ground, he saw a young man’s figure unhurriedly emerging from within that dusty rubble. Promptly, two gradually icy cold corpses were gently cast aside.\u003c/p\u003e\n\u003cp\u003eGu Ying, Lei Bao.\u003c/p\u003e\n\u003cp\u003eThe entire crowd instantly turned quiet in that instance as all of them stared, wide-eyed, at the corpses. Right now everyone knew…\u003c/p\u003e\n\u003cp\u003eThe Lei Family was finished…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-96\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/wu-dong-qian-kun/wdqk-chapter-98\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/wu-dong-qian-kun/wdqk-chapter-97","bookId":1514,"creation":"Sep 10, 2019 7:28:53 AM","modification":"Sep 10, 2019 7:28:53 AM"}
