{"id":96351,"no":12,"title":"Page 12","content":"\u003cp\u003eThat night all I thought about was Brandon. I wondered what would have happened if Ivy hadn\u0027t interrupted us. Would I have gotten to talk to him more? I didn\u0027t know anything about him. Why did he move to Legend\u0027s Run? Did he really live with his grandparents? And most important, now that I was apart from Nash, would he ever kiss me?\u003c/p\u003e\n\u003cp\u003eI imagined what that moment would have been like gazing up at him as the stars glimmered behind him. I\u0027d ask about his wound and he\u0027d assure me it was nothing, all the while knowing that he was hiding his pain from me. And while no one was watching, he\u0027d lean into me and kiss me so intensely I\u0027d feel dizzy.\u003c/p\u003e\n\u003cp\u003eIt was time to officially thank Brandon. I\u0027d been putting it off perhaps for the wrong reasons\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;Nash, school, or just being shy. Brandon hadn\u0027t hesitated to save me, and I needed to move beyond any more hesitating in thanking him.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know much about Brandon, but I knew he liked Jeeps and the WWF.\u003c/p\u003e\n\u003cp\u003eThe next day, I scanned the internet for images of pro wrestlers. When I found one I thought was beefy enough, I printed it out and glued it to card stock. I folded the card and wrote inside, Thanks for wrestling the wolves. You are a true hero.\u003c/p\u003e\n\u003cp\u003eI struggled with how to sign it. Sincerely? Best? Love? XOXO?\u003c/p\u003e\n\u003cp\u003eJust to be safe, I simply wrote Celeste. Before I put it in the envelope, I sprayed it with sweet perfume and stuck it into my purse.\u003c/p\u003e\n\u003cp\u003eI ran downstairs to check on the brownies I had baking in the oven. I took the hot dessert out and was sprinkling powdered sugar over it when Juliette and my mom entered the kitchen. It was cool to have my sister home for a few days, even if was just because my mom glowed having her two girls under her roof again.\u003c/p\u003e\n\u003cp\u003e\"Why are you baking more desserts when we have pecan and pumpkin pies coming out of our ears?\" Juliette said.\u003c/p\u003e\n\u003cp\u003e\"Those smell delicious,\" my mom said.\u003c/p\u003e\n\u003cp\u003e\"Why are you doing that to me?\" Juliette complained. \"You know I\u0027m on a diet.\"\u003c/p\u003e\n\u003cp\u003e\"You are always on a diet,\" I said to my stick-thin sister.\u003c/p\u003e\n\u003cp\u003e\"Well, I have a date,\" she said, hugging my mom. \"See you later.\"\u003c/p\u003e\n\u003cp\u003e\"In the middle of the day?\" I charged.\u003c/p\u003e\n\u003cp\u003e\"The university is having a fund-raiser. And I\u0027m helping Dan out.\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s Dan?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t keep them straight either,\" my mom said as Juliette flew out the back door.\u003c/p\u003e\n\u003cp\u003e\"Are you taking those to the nursing home?\" she asked. \"Are they for Mr. Worthington? You might want to get it approved first. I think the residents there are on a strict diet.\"\u003c/p\u003e\n\u003cp\u003e\"In that case, it sounds like Juliette is years ahead of her time,\" I said, and followed my sister out the door.\u003c/p\u003e\n\u003cp\u003e\"So much for having my girls home,\" I heard my mom say as the door closed.\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t sure where Brandon lived, but I did know someone who might. Even though it was winter, snowflakes and cold temperatures didn\u0027t keep the die-hard skaters from their outdoor skate.\u003c/p\u003e\n\u003cp\u003eI pulled into the lot and headed over to the ramps. Piles of snow lined the fences, but the ramps and rails were clear. Several skaters were flying down the half-pipe as if they were performing for a competition.\u003c/p\u003e\n\u003cp\u003eHayley Phillips appeared as surprised to see me arrive as one could imagine.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know you skated,\" she said. A few of the other skaters gathered around her.\u003c/p\u003e\n\u003cp\u003eI was only partially intimidated.\u003c/p\u003e\n\u003cp\u003eBut it did look like fun. The skaters appeared as if nothing in the world mattered to them as each one sped down the ramps or did one-eighties at the top of them.\u003c/p\u003e\n\u003cp\u003e\"Can you tell me where Brandon Maddox lives?\" I asked. \"It\u0027s around here somewhere and I figured you might know.\"\u003c/p\u003e\n\u003cp\u003e\"Because we live in Riverside, you mean? We must all eat together and breed together?\"\u003c/p\u003e\n\u003cp\u003e\"No. Because I\u0027ve seen you talking to him,\" I said in a nonconfrontational tone. \"That\u0027s all.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t think your type would be seen in our parts,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have a type.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s this about?\"\u003c/p\u003e\n\u003cp\u003e\"Something for school. Can you help me?\" I asked sincerely.\u003c/p\u003e\n\u003cp\u003eHayley popped her skateboard with her back foot and caught it with one hand.\u003c/p\u003e\n\u003cp\u003e\"That was cool,\" I said.\u003c/p\u003e\n\u003cp\u003eHayley wasn\u0027t softening or coughing up any information.\u003c/p\u003e\n\u003cp\u003e\"Well, if you aren\u0027t all alike, then why would you think we are, too?\" I asked. \"I guess you might not be so different from the snobs you think I hang out with.\"\u003c/p\u003e\n\u003cp\u003eI began to leave.\u003c/p\u003e\n\u003cp\u003e\"She was the one who had Nash invite Brandon to his party,\" I heard one of the other skaters say. \"She\u0027s the one who stuck up for him.\"\u003c/p\u003e\n\u003cp\u003e\"Hey - \" Hayley called.\u003c/p\u003e\n\u003cp\u003eI heard the sound of a skateboard rolling up behind me.\u003c/p\u003e\n\u003cp\u003e\"Follow this road to the stop sign,\" Hayley said. \"Turn left. It\u0027s the third house on the right. It has a private drive.\"\u003c/p\u003e\n\u003cp\u003eI drove through Riverside and along a curvy side street. The homes were spread apart farther than on my street, with room for a few houses in between. When I saw a sign marked PRIVATE DRIVE, I knew it had to be Brandon\u0027s. Nervously, I turned into it. The tree-lined road was narrow and bumpy and passed a frozen pond. The front yard was several acres long. The modest-looking house appeared historic\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;likely built when the town was founded, but recently restored. The white paint glistened against the black shutters. Patches of gray shingles poked through the snow-covered roof. A six-foot metal windmill gently spun with the chilly wind. Several wooden snowmen welcomed guests. A white railing enclosed the front porch, and a wooden swing made it seem cozy. I was hoping to leave the package on the front porch and disappear before I was spotted.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t plan on their dog. It barked so loudly from inside the house I thought it would alert all of Legend\u0027s Run. At first I thought it was a wolf snapping at me from the front window, but as I approached the door, I realized it was a husky.\u003c/p\u003e\n\u003cp\u003eI gingerly placed the package and card on the porch. I didn\u0027t dare knock, ring the bell, or holler. All I wanted to do was show my appreciation and run.\u003c/p\u003e\n\u003cp\u003eI tiptoed down the wooden steps. I snuck a look behind the house. There was land for miles. Between the front yard and the back, Brandon\u0027s family must have owned all of Riverside. There was a huge backyard leading to a tree-filled hilltop, bird feeders of every type, a small guesthouse, and Brandon\u0027s parked Jeep.\u003c/p\u003e\n\u003cp\u003eIt was then I saw the sticker more closely. WWF\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;World Wildlife Fund\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;not World Wrestling Federation! Now I was truly embarrassed. Brandon liked animals in the wild, not the ones in the ring. What was I thinking?\u003c/p\u003e\n\u003cp\u003eThe screen door squeaked opened. Brandon was trying to calm down his dog. I pretended not to notice and continued walking to my car when I heard the screen door close.\u003c/p\u003e\n\u003cp\u003e\"Hey... Celeste?\" Brandon called.\u003c/p\u003e\n\u003cp\u003eI did my best to pretend not to hear.\u003c/p\u003e\n\u003cp\u003e\"Celeste!\" he called again.\u003c/p\u003e\n\u003cp\u003eI had no choice but to turn around. It would have been rude not to.\u003c/p\u003e\n\u003cp\u003eBrandon caught up to me. He was handsome in his chestnut-colored thermal shirt and jeans. It appeared as if he\u0027d been working in the house.\u003c/p\u003e\n\u003cp\u003eHe held the tray of brownies in his hand. \"What\u0027s this for?\"\u003c/p\u003e\n\u003cp\u003e\"I just wanted to officially thank you\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;for that day in the woods. But it\u0027s nothing really... just a small token.\"\u003c/p\u003e\n\u003cp\u003e\"No\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;this is great.\" Brandon seemed so pleased with my gesture. \"Thank you. Would you like to come in and have one?\"\u003c/p\u003e\n\u003cp\u003eI wondered how many students Brandon had invited into his house since he\u0027d arrived in Legend\u0027s Run. Were his grandparents home? Perhaps I was the first and only one to visit him. His house seemed so different from mine\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;with so much more character and charm. I was sure it was highly decorated on the inside, and I was more than curious to see how he lived. However, I wanted to exit the enormous property before Brandon saw my silly wrestling card.\u003c/p\u003e\n\u003cp\u003e\"Thank you anyway. I really have to go.\"\u003c/p\u003e\n\u003cp\u003e\"Always leaving me,\" he teased.\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t help but break a smile. \"I should be getting back home,\" I told him.\u003c/p\u003e\n\u003cp\u003e\"You can at least wait until I open the card.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay - \"\u003c/p\u003e\n\u003cp\u003eBefore I could retreat, he was trying to slit the top of the envelope but was struggling with his wounded hand.\u003c/p\u003e\n\u003cp\u003eI took the envelope, opened it, and handed it back to him.\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" he said. His gaze lingered a bit on my face, then he read the card.\u003c/p\u003e\n\u003cp\u003e\"Wow\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;this is so nice. You made it?\"\u003c/p\u003e\n\u003cp\u003eI nodded, embarrassed.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think anyone has ever made me a card before. Thank you!\"\u003c/p\u003e\n\u003cp\u003eI pointed to the bumper sticker on his car. \"I thought it was for World Wrestling Federation,\" I confessed.\u003c/p\u003e\n\u003cp\u003eHe laughed and then I did, too. There was something special about Brandon. His eyes were seductive.\u003c/p\u003e\n\u003cp\u003eThere was a silence, and then I said, \"Did you see a doctor?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I had to get stitches.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so sorry - \"\u003c/p\u003e\n\u003cp\u003e\"No\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;don\u0027t be sorry. That\u0027s not why I told you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have to bake you more brownies now.\" We both laughed again.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s fine. Really,\" he said.\u003c/p\u003e\n\u003cp\u003e\"That must have hurt.\"\u003c/p\u003e\n\u003cp\u003e\"Nah,\" he said. \"I\u0027m a big boy.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry about Nash\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;that he gives you a hard time.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it\u0027s nice to have someone stick up for me, especially someone as pretty as you.\"\u003c/p\u003e\n\u003cp\u003eI blushed. So much so that I could feel my whole body redden.\u003c/p\u003e\n\u003cp\u003e\"Wow\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;you have your own pond,\" I said. \"You can go ice-skating.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, as if everyone had their own frozen pond. \"Would you like to?\"\u003c/p\u003e\n\u003cp\u003e\"Like to what?\"\u003c/p\u003e\n\u003cp\u003e\"Skate? It\u0027s very shallow, so it\u0027s already frozen solid.\"\u003c/p\u003e\n\u003cp\u003e\"You skate?\" I asked quizzically.\u003c/p\u003e\n\u003cp\u003e\"I played ice hockey at school. When I was growing up I came here during winter break and I got to practice. It was really cool.\"\u003c/p\u003e\n\u003cp\u003e\"That does sound amazing.\"\u003c/p\u003e\n\u003cp\u003e\"So, would you like to try?\"\u003c/p\u003e\n\u003cp\u003e\"I have plans this weekend....\"\u003c/p\u003e\n\u003cp\u003e\"I mean now.\"\u003c/p\u003e\n\u003cp\u003eThe thought of doing something spontaneously was unusual for me, to say the least.\u003c/p\u003e\n\u003cp\u003e\"Now? I don\u0027t have any skates.\"\u003c/p\u003e\n\u003cp\u003eHe sized up my boots.\u003c/p\u003e\n\u003cp\u003e\"You might be able to use my grandmother\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"She plays hockey?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He smiled. \"But she has a pair of figure skates hanging on the wall.\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t want to use her decoration.\"\u003c/p\u003e\n\u003cp\u003e\"They aren\u0027t plastic. They\u0027re real. She used them herself. Besides, she\u0027d insist.\"\u003c/p\u003e\n\u003cp\u003eBefore I could say no, Brandon was on his way into his house. A few moments later, he came out with two pairs of skates.\u003c/p\u003e\n\u003cp\u003eBrandon handed me a tiny vintage pair of worn white dainty leather skates. His were in sharp contrast\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;sturdy, bold, and black.\u003c/p\u003e\n\u003cp\u003eHe wiped off snow from the bench of the picnic table with his glove and offered me a seat. We sat down and removed our boots.\u003c/p\u003e\n\u003cp\u003e\"I think these are a little big,\" I said, trying one on.\u003c/p\u003e\n\u003cp\u003eBrandon pulled my skate-wearing foot up onto his lap. \"You just need to tighten them.\"\u003c/p\u003e\n\u003cp\u003eI loved how Brandon took charge\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;not in a bossy or controlling way but in a confident manner. I sat back as he tugged on the laces. I was mesmerized that he was being so attentive to me. \"Now the other,\" he said.\u003c/p\u003e\n\u003cp\u003e\"A girl could get used to this,\" I said. I continued to stare at him until he was finished.\u003c/p\u003e\n\u003cp\u003eIt had been a few years since I\u0027d put on a pair of skates. I was shaky when we stood, but Brandon handled himself like a pro.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s easy, just relax.\" He threw his other glove onto the table and extended his hand. I grasped it in mine. Even though I had stretchy gloves on, I could feel the power and warmth from his grip. I wobbled on the grass until we reached the frozen pond. I was a bit nervous, imagining myself lying flat on my back within seconds.\u003c/p\u003e\n\u003cp\u003eBrandon smiled and helped me onto the ice. It took me several moments to balance. \"It\u0027s like riding a bike, right?\" he said.\u003c/p\u003e\n\u003cp\u003e\"Only on ice,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Yes, I guess there is that,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Now, let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003e\"We have to move, too?\"\u003c/p\u003e\n\u003cp\u003eBrandon began to glide, taking me with him. My legs quaked underneath me. Brandon was as confident skating on frozen ice as he\u0027d be if he was walking on the ground.\u003c/p\u003e\n\u003cp\u003e\"You are thinking too much,\" he said. \"Let your mind and body relax.\"\u003c/p\u003e\n\u003cp\u003eHow could I not think? If I fell, I\u0027d be smacking myself on a freezing pond, not to mention the embarrassment I\u0027d feel in front of him.\u003c/p\u003e\n\u003cp\u003e\"Here. Look into my eyes.\" He took both of my hands and we faced each other. I stared up into his warm and brilliant gaze as he began to slowly skate backward, pulling me forward.\u003c/p\u003e\n\u003cp\u003eMy legs became like Jell-O and I clenched his hands. I wanted to take off my gloves so I could feel his skin against mine, but I was afraid he\u0027d feel how nervous I really was.\u003c/p\u003e\n\u003cp\u003e\"Now talk to me,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I have to talk, too?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said. \"What are your favorite things to do?\" I still struggled to keep my gait relaxed; the more I tried the more I tensed up.\u003c/p\u003e\n\u003cp\u003e\"Uh... I like to skate, but obviously I don\u0027t do it very often. I like to do things in the outdoors, but I really never get the chance to. So I mostly go to the mall, talk on the phone, hang with my friends.\"\u003c/p\u003e\n\u003cp\u003e\"I see you writing in your notebooks. But you aren\u0027t taking notes. What are you writing?\"\u003c/p\u003e\n\u003cp\u003e\"Uh... nothing.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t seem like nothing. You always seem very focused.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t tell him that I was writing down his name next to lips and hearts. I also couldn\u0027t tell him the other things I wrote for fear he\u0027d laugh.\u003c/p\u003e\n\u003cp\u003eAs we continued to skate, my legs relaxed and I began to gain confidence.\u003c/p\u003e\n\u003cp\u003e\"So what are you writing?\" he repeated.\u003c/p\u003e\n\u003cp\u003e\"Just silliness. Stories and poems.\"\u003c/p\u003e\n\u003cp\u003e\"What kind of stories?\"\u003c/p\u003e\n\u003cp\u003e\"One of the stories is about a guy who saves a girl from a pack of wolves.\"\u003c/p\u003e\n\u003cp\u003e\"I hope it has a happy ending,\" he said.\u003c/p\u003e\n\u003cp\u003e\"It does,\" I said.\u003c/p\u003e\n\u003cp\u003e\"And what happens to the girl?\"\u003c/p\u003e\n\u003cp\u003e\"She becomes a nurse so she can help others.\"\u003c/p\u003e\n\u003cp\u003e\"And the guy?\"\u003c/p\u003e\n\u003cp\u003e\"Well... he\u0027s bitten by the wolves,\" I said, thinking. \"And it\u0027s underneath a full moon... so I suppose he could become a werewolf.\"\u003c/p\u003e\n\u003cp\u003e\"Ah...\" he said. \"I like it. But couldn\u0027t he become a professional hockey player instead?\"\u003c/p\u003e\n\u003cp\u003eI smiled. \"Sure, I guess.\"\u003c/p\u003e\n\u003cp\u003e\"And what happens to the guy and the girl?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know what to say, but I knew what I wanted to say\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;that he falls in love with her. But what I wanted to say and what I could admit to him were very different things.\u003c/p\u003e\n\u003cp\u003eJust then my cell went off. It rang a funky ring. It was Ivy.\u003c/p\u003e\n\u003cp\u003e\"You can get that,\" he said as we continued skating. He let my right hand go and I answered my phone.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" my best friend asked.\u003c/p\u003e\n\u003cp\u003eIf I said holding hands with Brandon Maddox and skating on his pond, she wouldn\u0027t believe me. Nor did I really want her to.\u003c/p\u003e\n\u003cp\u003e\"You sound out of breath,\" she continued. \"I\u0027m on my way to pick you up.\"\u003c/p\u003e\n\u003cp\u003e\"Uh... I\u0027m not home,\" I said, alarmed.\u003c/p\u003e\n\u003cp\u003eBrandon and I continued to skate as I talked.\u003c/p\u003e\n\u003cp\u003e\"Then where are you? I\u0027ll come get you.\" Ivy sounded impatient. \"We have to work on our papers. You are the one who usually reminds me.\"\u003c/p\u003e\n\u003cp\u003e\"Uh... give me a little while and I\u0027ll meet you at my house,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Fine, I\u0027ll see you there.\"\u003c/p\u003e\n\u003cp\u003eWe hung up.\u003c/p\u003e\n\u003cp\u003e\"You have to go?\" Brandon asked with a hint of disappointment.\u003c/p\u003e\n\u003cp\u003eNeither one of us put on the brakes as we continued to coast around the pond.\u003c/p\u003e\n\u003cp\u003e\"Not yet. What about you?\" I asked. \"Tell me something. Why did you move to Legend\u0027s Run?\"\u003c/p\u003e\n\u003cp\u003e\"My father was transferred to Europe, so I came here to stay with my grandparents.\"\u003c/p\u003e\n\u003cp\u003e\"What does your father do?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a scientist.\"\u003c/p\u003e\n\u003cp\u003e\"Wow\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;that is cool.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, it is, except when his job takes him out of the country.\"\u003c/p\u003e\n\u003cp\u003e\"What about your mother?\"\u003c/p\u003e\n\u003cp\u003e\"She hasn\u0027t been in the picture for years.\"\u003c/p\u003e\n\u003cp\u003eMy heart plummeted. I felt so sorry for Brandon, being without his mother and now his father.\u003c/p\u003e\n\u003cp\u003e\"So your father is from Legend\u0027s Run?\"\u003c/p\u003e\n\u003cp\u003e\"Both of my parents are. My dad\u0027s parents stayed here, and I heard my mom\u0027s family all moved on. I really wouldn\u0027t know. Since my mom left years ago, we haven\u0027t kept in touch with her side.\"\u003c/p\u003e\n\u003cp\u003eHe let go of my hands and skidded to a stop as I kept on gliding, alone. He watched like a handsome instructor proud of his pupil.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;keep going,\" he encouraged.\u003c/p\u003e\n\u003cp\u003eI soaked up the crisp air. It felt good to be so free\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;of books, of cramped buses and crowded hallways, free from worrying about what my friends or Nash thought. The snow-covered trees were majestic. The birds flying in the overcast sky and the smell of smoke from the neighbors\u0027 fireplaces were invigorating.\u003c/p\u003e\n\u003cp\u003eIt might have been just minutes of gliding, but to me it felt like hours. It was exhilarating to be skating solo and having Brandon watching me. I skated circles around the pond until I grew fatigued. Then I headed straight for him.\u003c/p\u003e\n\u003cp\u003eI used to know how to stop by spinning around. I decided to attempt it, but when I placed my blades at right angles, I spun off balance. I began to tumble and he caught me in his arms.\u003c/p\u003e\n\u003cp\u003eWe laughed a deep laugh, so hard my stomach hurt. Brandon was so magnetic. I wasn\u0027t sure if he was going to kiss me, but I knew I wanted him to.\u003c/p\u003e\n\u003cp\u003eWe locked eyes. He softly touched my frozen and flushed cheek. His hands were like a fiery stove, heating up my skin. He leaned into me and then my cell phone beeped with a text message.\u003c/p\u003e\n\u003cp\u003e\"You are popular,\" he said, pulling away.\u003c/p\u003e\n\u003cp\u003eThe mood was broken. I knew it would take courage for Brandon to kiss me. He saw me every day with the star of the football and basketball teams. He was new to school and already ostracized. The romantic moment was ruined.\u003c/p\u003e\n\u003cp\u003eI looked at the text message. \"It\u0027s Ivy. She\u0027s almost at my house.\"\u003c/p\u003e\n\u003cp\u003eReluctantly, we headed to the picnic tables and replaced our skates with our shoes.\u003c/p\u003e\n\u003cp\u003e\"Hey, thanks for the brownies,\" he said, walking me to my car.\u003c/p\u003e\n\u003cp\u003e\"Thanks for the skate.\" This was a moment when Brandon could kiss me. But his dog was barking, we were in plain view of his house, and I noticed a woman with brown hair peeking out from the front curtain. Then my cell phone rang again. I silenced it.\u003c/p\u003e\n\u003cp\u003eHe opened the door for me. \"Thanks for coming out to the sticks,\" he teased.\u003c/p\u003e\n\u003cp\u003e\"This place is great,\" I assured him. \"You have your own ice-skating rink. No one I know can say that.\"\u003c/p\u003e\n\u003cp\u003eAs I drove off, Brandon stood by the driveway with two pairs of skates in his hand. I watched him, reflected in my rearview mirror, until I turned the corner away from his house and he was out of view. \u003c/p\u003e","sourceLink":"https://allnovel.net/once-in-a-full-moon-full-moon-1/page-12.html","bookId":2148,"creation":"Oct 5, 2019 6:21:03 PM","modification":"Oct 5, 2019 6:21:03 PM"}
