{"id":96367,"no":28,"title":"Page 28","content":"\u003cp\u003eThe next few nights I continued to secure Brandon at sunset and free him in the morning before school. As much as I hated for him to be locked away, I did enjoy waking up, rushing over to Riverside, and seeing him first thing in the morning. He was always so gorgeous. His hair was messy like a model\u0027s, and his eyes always glistened like the moon. I had never woken up so happy in my life.\u003c/p\u003e\n\u003cp\u003eAt night, though, it was different. I felt a huge pain in my soul whenever Brandon closed his door. My friends insisted I attend the basketball games or go out with them and Nash. I had to admit I was torn. There was nothing I enjoyed more than being with my friends except for one thing\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;being with Brandon. And if Brandon hadn\u0027t entered the picture, I\u0027m sure I\u0027d still be content sipping hot chocolate on the bleachers with my friends and watching the basketball being passed back and forth by the hot athletes at Legend\u0027s Run High. Nash being interested in me was flattering. But now I saw another side of Legend\u0027s Run that no other Eastsider saw. And it\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;or, rather, he\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;was hard to forget.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know how I was ever going to tell my best friends I favored a fingerless-glove-wearing Westsider over their best friend, a popular all-star. Not only would I be disappointing the two girls who mattered most to me, but I\u0027d be upsetting the balance of popularity that they strove so hard to achieve.\u003c/p\u003e\n\u003cp\u003eBut Brandon\u0027s plan was working and he seemed pleased with the results: The werewolf spottings decreased immediately.\u003c/p\u003e\n\u003cp\u003eI wondered if he\u0027d have to be locked away inside his guesthouse forever.\u003c/p\u003e\n\u003cp\u003eOne morning after I opened Brandon\u0027s door, I noticed several dogs snooping around the grass by the birdbath. One was a golden retriever.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know your grandparents had so many dogs,\" I said. \"I only saw the husky in the window.\"\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t. We only have one dog.\"\u003c/p\u003e\n\u003cp\u003e\"But there\u0027s, like, three over there by the birdbath. And one looks just like Pumpkin, Abby\u0027s dog that\u0027s missing.\"\u003c/p\u003e\n\u003cp\u003e\"You think it might be?\" Brandon asked. \"My grandma was telling me she keeps finding stray dogs in the yard.\"\u003c/p\u003e\n\u003cp\u003eI walked behind the main house and noticed a white terrier, a Great Dane, a poodle, and several mutts scurrying around, barking and playing.\u003c/p\u003e\n\u003cp\u003eI raced over to the golden retriever and examined the dog\u0027s left ear. Behind some dirt and a few pieces of brush was a white circle. \"This is Pumpkin. She has a white mark on her ear!\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know where they came from, but they are always here in the morning. Every few days a new dog. My grandmother has already called a few owners and they\u0027ve come for them. But a few days later, new ones arrive. If they don\u0027t have tags, we\u0027ve been taking care of them. But it\u0027s been weird. I feel like they are...\"\u003c/p\u003e\n\u003cp\u003e\"Following you?\" I asked. \"Like the wolves?\"\u003c/p\u003e\n\u003cp\u003eHe smiled as he looked at his brood of furry admirers.\u003c/p\u003e\n\u003cp\u003e\"I knew you weren\u0027t destroying people\u0027s pets. Instead you were taking caring of them.\"\u003c/p\u003e\n\u003cp\u003eBrandon beamed.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t believe this, Brandon! You found Pumpkin!\" I petted my friend\u0027s dog and snuggled her cute canine face against mine. \"She\u0027s been missing for a week. We posted signs all over town.\"\u003c/p\u003e\n\u003cp\u003e\"All over town? I didn\u0027t see any.\"\u003c/p\u003e\n\u003cp\u003e\"Well, along the Eastside.\" I felt ashamed. \"I think we\u0027ve learned a lesson here. But I have to tell Abby!\" I said excitedly. I pulled my phone out from my purse and called my friend.\u003c/p\u003e\n\u003cp\u003e\"Guess who I have?\" I asked in a playful tone.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Abby said in a groggy voice. \"It\u0027s too early for jokes.\"\u003c/p\u003e\n\u003cp\u003e\"It starts with a P,\" I hinted.\u003c/p\u003e\n\u003cp\u003eThere was silence on the other end.\u003c/p\u003e\n\u003cp\u003eI took a picture of Pumpkin and sent it to Abby\u0027s phone. I could almost hear her screams coming from the east side of town.\u003c/p\u003e\n\u003cp\u003eWhen I arrived at English class, Abby came in and gave me another hug. She\u0027d been squeezing me all morning long, and since she was so toned, I was starting to cave in.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m getting bruises,\" I said.\u003c/p\u003e\n\u003cp\u003eNash, Jake, and Dylan were hanging out by our desks.\u003c/p\u003e\n\u003cp\u003e\"Abby told me Brandon Maddox found her,\" Ivy said.\u003c/p\u003e\n\u003cp\u003e\"He did,\" I said.\u003c/p\u003e\n\u003cp\u003e\"How did he find her\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;and more important, how did you find out?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Nash said, \"how did you find that out from Brandon?\"\u003c/p\u003e\n\u003cp\u003e\"Uh...\" I was going to tell them the same story I told Abby. \"I saw Brandon with Pumpkin. And he told me that if we had put signs on the Westside, she would have been returned sooner.\"\u003c/p\u003e\n\u003cp\u003e\"Are you sure he didn\u0027t steal her?\" Nash asked.\u003c/p\u003e\n\u003cp\u003e\"Why would he? He already has a dog.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know that?\" Ivy asked skeptically.\u003c/p\u003e\n\u003cp\u003eJust then Brandon walked into class. We all turned to him. Abby rose and went straight over to him.\u003c/p\u003e\n\u003cp\u003e\"I want to thank you so much for finding my dog,\" she said sweetly.\u003c/p\u003e\n\u003cp\u003eThen she did the unimaginable. Abby Kensington leaned over and hugged Brandon Maddox in front of the entire English class.\u003c/p\u003e\n\u003cp\u003eDylan folded his arms. Ivy gasped. I high-fived the air. Nash shook his head.\u003c/p\u003e\n\u003cp\u003eBrandon appeared more surprised than any of us as Abby returned to her seat.\u003c/p\u003e\n\u003cp\u003e\"See, I told you he\u0027s not so bad,\" I said to my friends. Brandon passed and gave me a quick smile before taking his seat. Nash gave me a stern glare, and he and his teammates sat down.\u003c/p\u003e\n\u003cp\u003e\"He is handsome underneath all those layers of hair,\" Ivy said, obviously not wanting Abby to show her up.\u003c/p\u003e\n\u003cp\u003eThe bell rang and Mrs. Clark called the names of those who were to share a brief synopsis of their essay with the class. My stomach sank when I heard her say \"Celeste Parker.\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t crazy about speaking in front of others. I had participated in some school plays but never as the lead. Most of the students were nice, but I liked when everyone stared at the teacher and not at me.\u003c/p\u003e\n\u003cp\u003eNash seemed proud of me, standing in front of the class. For the first time, I was the star instead of him. It made me feel empowered that he seemed so pleased. I saw Ivy and Abby, who were smiling at me and both giving me the thumbs-up. Then I caught sight of Brandon and my paper shook slightly in my hand.\u003c/p\u003e\n\u003cp\u003e\"Werewolves,\" I said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a timely subject,\" Mrs. Clark said.\u003c/p\u003e\n\u003cp\u003e\"In many centuries and societies, people swear they\u0027ve seen a man who takes the form of a wolf. Others insist the werewolf, like the unicorn, is a figment of man\u0027s imagination.\u003c/p\u003e\n\u003cp\u003e\"Throughout time, werewolves have been part of many different cultures\u0027 folklore. That might be a kind of mythology to explain abnormal behavior if one is not behaving appropriately for their community. But others believe that the werewolf is not folklore or fiction. I even interviewed a man who claims one of his ancestors was a werewolf.\u0027\u003c/p\u003e\n\u003cp\u003eThe students perked up.\u003c/p\u003e\n\u003cp\u003e\"He told me that the bite of a wolf can transform a human into a werewolf and that the affliction can be carried through man\u0027s blood from one generation to another. The person with the link to the wolves can transform once under a full moon. He says there is truth in the stories of the Legend\u0027s Run Werewolf.\"\u003c/p\u003e\n\u003cp\u003e\"Oooh!\" I heard someone say.\u003c/p\u003e\n\u003cp\u003e\"I saw him,\" Abby shouted out. Other classmates shushed her.\u003c/p\u003e\n\u003cp\u003e\"Many students believe they\u0027ve seen him,\" I continued. \"And I think I\u0027ve seen him, too.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have pictures?\" someone asked.\u003c/p\u003e\n\u003cp\u003eMrs. Clark tapped her desk with her pencil.\u003c/p\u003e\n\u003cp\u003e\"But I\u0027d like to put forth one theory that isn\u0027t popular among the rumors. Just because one takes the lycan form doesn\u0027t mean that they prey on others. They, too, might have a soul. When the full moon is over, they might want to be treated just like you or me.\"\u003c/p\u003e\n\u003cp\u003eMy class applauded me, and as I sat down Brandon gave me an approving wink.\u003c/p\u003e\n\u003cp\u003e\"Someone has footage of the werewolf,\" my mom called from the family room before dinner. \"It\u0027s going to be on the five o\u0027clock news.\"\u003c/p\u003e\n\u003cp\u003eI raced downstairs. If Brandon was in seclusion, this couldn\u0027t be him. Did he break out?\u003c/p\u003e\n\u003cp\u003e\"It\u0027s going to be on in a minute,\" my mom said when I plopped down on the floor in front of the TV.\u003c/p\u003e\n\u003cp\u003eMegan Crumley, our local news reporter, was standing outside Penny for Your Thoughts. \"Channel Eleven has just learned that Dr. Camille Meadows from Riverside Township has discovered a werewolf and captured it on film,\" she began. \"As you may have heard, many residents have been claiming they\u0027ve witnessed an unusual creature roaming Legend\u0027s Run at night, and many are calling this creature the Wolfman.\u003c/p\u003e\n\u003cp\u003e\"With all the werewolf sightings, no one has been able to prove its existence,\" she continued.\u003c/p\u003e\n\u003cp\u003eDr. Meadows had warned me if I didn\u0027t bring Brandon to her, she\u0027d go to him. But why wouldn\u0027t she tell me she found him? Why would she go to our local news station first?\u003c/p\u003e\n\u003cp\u003e\"How were you able to find him?\" the reporter asked.\u003c/p\u003e\n\u003cp\u003e\"I sensed it,\" Dr. Meadows said. \"I have paranormal abilities and I used them to guide me. I finally got this last week.\"\u003c/p\u003e\n\u003cp\u003eMy heart plummeted. All along, Dr. Meadows had been trying to use Brandon for her own gain.\u003c/p\u003e\n\u003cp\u003e\"Is that the psychic you spent your allowance on?\" my mom asked.\u003c/p\u003e\n\u003cp\u003eI held my breath and covered my mouth.\u003c/p\u003e\n\u003cp\u003eThe film was grainy and dark at best. It looked like it had been filmed with a phone as opposed to a high-end video camera. At first it was out of focus. There was the sound of rustling in the woods. A figure lurked behind a tree; wild and long black hair covered its face. It howled like a wolf. Then the figure dashed out of view. The camera followed, shining its light on several bare trees. Suddenly a sturdy hand swung at the camera. There was scrambling as we could hear heavy breathing and the camera pointed to the ground as Dr. Meadows ran away.\u003c/p\u003e\n\u003cp\u003e\"Well, that certainly looks like something to me,\" the anchor said. \"What, I\u0027m not sure, but you can decide. Click on our website and tell us your thoughts. Wolfman or Prankman?\"\u003c/p\u003e\n\u003cp\u003e\"Replay that,\" I said. \"I want to see something.\"\u003c/p\u003e\n\u003cp\u003eI grabbed the remote and rewound the clip. I played it slowly, examining it closely.\u003c/p\u003e\n\u003cp\u003e\"What are you looking for?\" my mom asked.\u003c/p\u003e\n\u003cp\u003eThe figure swiped at the camera with its right hand. However, when I reviewed it, there wasn\u0027t a scar. No sign of a wolf bite to be seen. It wasn\u0027t Brandon. But that realization raised as many questions as it answered. \u003c/p\u003e","sourceLink":"https://allnovel.net/once-in-a-full-moon-full-moon-1/page-28.html","bookId":2148,"creation":"Oct 5, 2019 6:21:03 PM","modification":"Oct 5, 2019 6:21:03 PM"}
