{"id":96344,"no":5,"title":"Page 5","content":"\u003cp\u003eIt was mid-November, and a few weeks had passed since my friends and I were circled around a campfire in the woods and Nash had told us his frightening werewolf story. Footballs, goalposts, and grass were replaced with basketballs, hoops, and hardwood floors. The red, gold, and orange autumn leaves had fallen or been blown away and now many trees stood naked. The temperatures fell, too. There was just a dusting of snow on the ground.\u003c/p\u003e\n\u003cp\u003eI loved the first fresh snow when it blanketed the town and closed the schools, or a weekend snowfall when it accumulated enough for us to stay indoors with a cozy comforter, a good book, and tasty hot chocolate. I loved the sound of the snow crunching underneath my boots or the ultralight snowfall on a silent street. I loved magical moments when the only impressions in the snow were the tiny footprints of a bird. And I cherished the memories of when Juliette and I were younger and dragged our sleds to Hillside or another nearby slope.\u003c/p\u003e\n\u003cp\u003eWe hadn\u0027t had a major snowfall yet, however, only cold weather and occasional flurries. Snow wasn\u0027t nearly as great when it wasn\u0027t enough to close school. Then it was just inconvenient and messy to trudge through, soaking the hallways, and leaving me crossing my frozen fingers that I wouldn\u0027t wipe out and land on my backside in front of the entire student body.\u003c/p\u003e\n\u003cp\u003eAbby, Ivy, their beaux, and Nash and I were in library study hall keeping warm. In our English class we were studying American folklore and had been assigned a paper on the subject. I kept thinking about Mr. Worthington\u0027s werewolf story. I decided werewolves would be a good subject for my essay. It was one thing to have Nash tell a campfire story to scare us, but I was even more intrigued that Mr. Worthington seemed impassioned by the tale himself. And besides, I could use him as a resource for my paper. Nash\u0027s story was exhilarating and frightening because of the thought a werewolf could be living among us. Though I didn\u0027t believe in their existence, I could only imagine that the early settlers had felt alone like we had been in the woods.\u003c/p\u003e\n\u003cp\u003eI went to the stacks, scanning the aisles for anything werewolf. I picked up several books. The Encyclopedia of Monsters and Myths and Mysteries. I found The Book of Werewolves and was pulling it off the shelf when it slipped from my hand.\u003c/p\u003e\n\u003cp\u003eAs I bent down to pick it up, someone was already handing it to me. It was Brandon Maddox.\u003c/p\u003e\n\u003cp\u003eFor the past few months I\u0027d only had brief encounters with Brandon or passed him on the way to class. We were in a few classes together but he sat in the back, his head buried underneath his wavy locks. He always ate lunch by himself. I\u0027d never admit to my friends that I thought Brandon was handsome. He had deep, royal blue eyes that shined through his short, shaggy dark hair. If he were an Eastsider, he\u0027d surely be one of the most popular guys in school. But since fate led him to be on the Westside, he was greatly ignored.\u003c/p\u003e\n\u003cp\u003eBrandon didn\u0027t say anything. I sensed it was not because he was afraid to but because he was the kind of person who chose his words carefully.\u003c/p\u003e\n\u003cp\u003eI wanted to say thank you. But as he continued to gaze into my eyes, my words escaped me.\u003c/p\u003e\n\u003cp\u003e\"Celeste! Get over here,\" Ivy called. \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003eI headed over to my friends, feeling slightly more flushed than I had when I\u0027d left them.\u003c/p\u003e\n\u003cp\u003e\"Werewolves?\" Nash asked when he saw me holding my stack of books.\u003c/p\u003e\n\u003cp\u003e\"I thought I could ask you to tell the class the Legend\u0027s Run Werewolf legend. I could score some extra points,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Is this my paper or yours? I\u0027m not working on two,\" he said, and buried his head in Sports Illustrated. \"Besides, I was hoping to buy my paper off the internet.\"\u003c/p\u003e\n\u003cp\u003e\"Nash!\" I said, horrified by his plan.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just kidding, Parker,\" he said to me. \"Lighten up.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m considering quilting,\" Ivy said proudly.\u003c/p\u003e\n\u003cp\u003e\"Quilting?\" Jake asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, many people told stories through narrative quilting.\"\u003c/p\u003e\n\u003cp\u003e\"Boring!\"\u003c/p\u003e\n\u003cp\u003e\"Of course it would be boring to you,\" Ivy said. \"If it doesn\u0027t involve cheerleaders, you don\u0027t want to hear about it.\"\u003c/p\u003e\n\u003cp\u003e\"Were there naked quilters?\" Jake asked. \"Now, that would be interesting!\"\u003c/p\u003e\n\u003cp\u003eIvy playfully hit her boyfriend.\u003c/p\u003e\n\u003cp\u003e\"I was thinking of investigating witches,\" Abby proudly announced.\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t have to go far to investigate that,\" Dylan said.\u003c/p\u003e\n\u003cp\u003e\"Well, thanks,\" Abby said sarcastically.\u003c/p\u003e\n\u003cp\u003e\"No\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;I mean you can ask Dr. Meadows,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Who?\" Ivy asked.\u003c/p\u003e\n\u003cp\u003e\"That witch doctor in Riverside,\" Dylan replied. \"My mom went there for acupuncture and said she sells books on everything. I\u0027m sure she has information on witches.\"\u003c/p\u003e\n\u003cp\u003eAbby appeared skeptical.\u003c/p\u003e\n\u003cp\u003e\"While you\u0027re there, maybe you can get your fortune told,\" Dylan continued. \"See if I\u0027m getting any action from you this weekend.\"\u003c/p\u003e\n\u003cp\u003e\"You want me to go to the Westside and talk to a witch doctor?\" Abby said. \"Are you crazy?\"\u003c/p\u003e\n\u003cp\u003e\"Are you chicken?\" Dylan challenged.\u003c/p\u003e\n\u003cp\u003e\"Of course not!\" Abby replied.\u003c/p\u003e\n\u003cp\u003e\"Going to Riverside,\" he taunted. \"Afraid you\u0027ll want to move in?\"\u003c/p\u003e\n\u003cp\u003e\"No. It\u0027s just I have volleyball practice.\" Abby wasn\u0027t one to be pushed around; she had her reputation to uphold.\u003c/p\u003e\n\u003cp\u003e\"I dare you,\" Jake said.\u003c/p\u003e\n\u003cp\u003e\"Dare?\" Abby asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, dare!\" he repeated.\u003c/p\u003e\n\u003cp\u003e\"Fine,\" Abby said, shaking his hand. \"Ivy, Celeste, and I will get our fortunes told by Dr. Meadows.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t believe you,\" Dylan said. \"You, in Riverside? I\u0027m not sure they\u0027ll let you in.\"\u003c/p\u003e\n\u003cp\u003e\"They better,\" she said. \"And I\u0027ll prove it to you. I\u0027ll get a reading and then a receipt.\"\u003c/p\u003e\n\u003cp\u003e\"Whatever you say,\" Dylan said with a laugh.\u003c/p\u003e\n\u003cp\u003e\"And when I do,\" Abby continued, \"you\u0027ll have to be our servants for a day.\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t we already?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"And if you don\u0027t, then you\u0027ll have to be ours.\" Jake smiled.\u003c/p\u003e\n\u003cp\u003e\"I guarantee that won\u0027t be happening,\" I said.\u003c/p\u003e\n\u003cp\u003eMy friends cuddled and studied with their boyfriends as I imagined what my fortune might be.\u003c/p\u003e\n\u003cp\u003eI gazed outside. I could see the moon hanging in the cloudless blue sky. It looked lonely, staring back at me. I wondered if it thought the same of me. \u003c/p\u003e","sourceLink":"https://allnovel.net/once-in-a-full-moon-full-moon-1/page-5.html","bookId":2148,"creation":"Oct 5, 2019 6:21:03 PM","modification":"Oct 5, 2019 6:21:03 PM"}
