{"id":96348,"no":9,"title":"Page 9","content":"\u003cp\u003eI wasn\u0027t excited about the weekend. Normally, I\u0027d take advantage of the two days off catching up on homework, chores, and, most of all, texting, calling, and hanging out with Ivy and Abby. Nash had an away game, so we weren\u0027t going to have a date night. I was so eager to go back to school and see Brandon, I spent most of my hours not accomplishing anything and dreaming about him.\u003c/p\u003e\n\u003cp\u003eI tried to snap myself out of my pining for Brandon, so I threw myself into the research for my folklore paper. Werewolves were subjects of Greek mythology and European and Early American folklore. In most of the traditions, lycanthropes were scary, deadly creatures to be feared. No one wanted to become a werewolf, and no one wanted to encounter one. I\u0027d been holed up all day when I thought it might be good to get some new perspective. Mr. Worthington seemed to know more than anyone about the legends, and I knew he\u0027d be happy to tell me about them.\u003c/p\u003e\n\u003cp\u003e\"I want to talk about werewolves,\" I said when I found him reading a magazine in the lobby at Pine Tree Village later that day. \"I\u0027m doing a paper on folklore and thought you\u0027d be the perfect person to interview.\"\u003c/p\u003e\n\u003cp\u003eHe paused, taking an extra moment to examine me. Then he closed his magazine.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s me, Celeste,\" I said, confused at his expression.\u003c/p\u003e\n\u003cp\u003e\"I know who you are...\" he said cheekily. \"But you seem different....\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s an extra twinkle in your eye.\"\u003c/p\u003e\n\u003cp\u003eI blushed. Could he see I\u0027d been obsessed about Brandon?\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure what you mean,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Are you sure there isn\u0027t anything new? Did you do something different to your hair?\"\u003c/p\u003e\n\u003cp\u003e\"Same old me,\" I said. I felt funny about girl talking and gushing about a guy I couldn\u0027t get out of my mind to an eighty-nine-year-old man.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get it out of you eventually,\" he said. \"Something about you... but I can\u0027t put my finger on it. I haven\u0027t been around for all these years without seeing things.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that is what I want to talk to you about.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m doing a paper on werewolf folklore and was hoping you could tell me more about the Legend\u0027s Run werewolf.\"\u003c/p\u003e\n\u003cp\u003eMr. Worthington perked up.\u003c/p\u003e\n\u003cp\u003e\"Please, come sit down.\"\u003c/p\u003e\n\u003cp\u003eI sat on the sofa next to him. I pulled out my notebook and opened it on my lap. \"I read that a person could become a werewolf if they wear a pelt or skin from a wolf,\" I said, \"or if they\u0027re bitten by a werewolf. And of course one of the cures is a silver bullet.\"\u003c/p\u003e\n\u003cp\u003e\"Go on,\" he said.\u003c/p\u003e\n\u003cp\u003e\"And some can shape-shift.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"But that\u0027s all basic stuff. I want to know\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;what do you know about the Legend\u0027s Run werewolf?\"\u003c/p\u003e\n\u003cp\u003e\"What do I know?\" he said with a mischievous laugh.\u003c/p\u003e\n\u003cp\u003e\"Yes. Anything you can tell me would be great.\"\u003c/p\u003e\n\u003cp\u003e\"Well, let\u0027s see,\" Mr. Worthington began. \"He was first spotted in the last century, soon after the town was founded. But his transformation didn\u0027t come from a werewolf bite or a pelt of skin worn around his human body. It came from the bite of a wolf.\"\u003c/p\u003e\n\u003cp\u003e\"Wow...\" I said.\u003c/p\u003e\n\u003cp\u003e\"He was a regular man\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;in fact, a good man\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;one of the early settlers who were helping build the community. A loved and respected man.\" Mr. Worthington recited his tale as if it were fact. \"He was building a house when a pack of rabid wolves stole the basket his child was resting in. The man fought for his son\u0027s life. In the struggle, the man was left bloody and fighting for his life. The following full moon, the man was missing from his home. It was very unusual, as he was always protective of his family and community.\"\u003c/p\u003e\n\u003cp\u003e\"Did they find him?\"\u003c/p\u003e\n\u003cp\u003e\"No one knew where he was. But then bad things began to happen in the town. Animals suddenly went missing and people feared the dark. A frightening creature, half man, half wolf, was spotted prowling in the woods, and townspeople heard howling throughout the night.\"\u003c/p\u003e\n\u003cp\u003eI hung on to his every word. \"Creepy.\"\u003c/p\u003e\n\u003cp\u003e\"But the terror didn\u0027t happen just once a month. The moon can appear full for several evenings. And during that time, no one is safe when there is a werewolf among us.\"\u003c/p\u003e\n\u003cp\u003e\"Wow\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;you know more than Nash did. This is great.\"\u003c/p\u003e\n\u003cp\u003e\"I was just at the beginning.\"\u003c/p\u003e\n\u003cp\u003e\"The beginning? What happened to the man?\"\u003c/p\u003e\n\u003cp\u003eNurse Bridget interrupted our conversation.\u003c/p\u003e\n\u003cp\u003e\"Hi, Celeste, I didn\u0027t know you were scheduled today.\"\u003c/p\u003e\n\u003cp\u003e\"Uh... I wasn\u0027t. I just came over to interview Mr. Worthington for a paper I\u0027m working on for school.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m afraid it\u0027s time for Charlie\u0027s physical therapy. I hope it isn\u0027t something due tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not due till the next full moon,\" I said to Mr. Worthington with a wink.\u003c/p\u003e\n\u003cp\u003eI\u0027d been so enthralled with Mr. Worthington\u0027s story, I didn\u0027t even write anything down in my notebook. I transcribed all my memories into my computer when I arrived home. If Mr. Worthington was only at the beginning of his story, what more did he know?\u003c/p\u003e\n\u003cp\u003eAs I finished editing my interview, I remembered Dr. Meadows\u0027s prediction. If we hadn\u0027t gone to Penny for Your Thoughts in the first place, then I wouldn\u0027t have gotten lost in the woods and Brandon wouldn\u0027t have been bitten. Was her reading correct? The idea that Dr. Meadows predicted exactly what happened plagued my mind. But then again, I convinced myself that any person could have said those things, psychic or not. Maybe she had heard the weather forecast. Maybe she knew that wolves were inhabiting the Westside woods. Or any client could interpret events to match their psychic\u0027s words.\u003c/p\u003e\n\u003cp\u003eBut, if in fact she had truthfully warned me, was I the one to blame for Brandon\u0027s injury? If only I\u0027d not been so skeptical and listened to her, he wouldn\u0027t have put himself in harm\u0027s way and have gotten hurt.\u003c/p\u003e\n\u003cp\u003eEither way, I felt guilty for putting him in a position that led to his getting wounded.\u003c/p\u003e\n\u003cp\u003eAnd what did Dr. Meadows mean by Beware of a kiss under the full moon. It can change your life forever. Perhaps she was talking about the paper I was currently writing? Maybe writing this paper would change me. And did she mean kisses I might receive from Nash or wanted to receive from Brandon? For some reason, or many (getting to know more about Mr. Worthington and investigating the paranormal), I felt it already had.\u003c/p\u003e\n\u003cp\u003eI shut down my computer. I was so excited the weekend was over and school was going to be in session tomorrow. As I lay in bed, I jotted the memories down in my notebook as I replayed them in my head: Brandon suddenly appearing out of the snow, like a firefighter coming out of the flames, his royal blue eyes melting me and the snow and ice around us, our hands touching as if we\u0027d never let go.\u003c/p\u003e\n\u003cp\u003eI closed my notebook and held it to my heart as I fell asleep. \u003c/p\u003e","sourceLink":"https://allnovel.net/once-in-a-full-moon-full-moon-1/page-9.html","bookId":2148,"creation":"Oct 5, 2019 6:21:03 PM","modification":"Oct 5, 2019 6:21:03 PM"}
