{"id":42639,"no":12,"title":"CHAPTER XII. JULIUS IN LUCK.","content":"\u0026nbsp;A light wagon was standing outside for Julius and his new guardian. \n\u003cdiv\u003e\n “Jump in, Julius,” said Mr. Taylor.\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero did not need a second command. He was quickly in his seat, and looked wistfully at his companion, who held the reins.\n\u003c/div\u003e \n\u003cdiv\u003e\n “May I drive?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you accustomed to driving?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you never got a chance in the city?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir. Jack didn’t keep a horse,” said Julius, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who was Jack?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was the man I lived with.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was he in any business?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; but it wasn’t a very good kind of business. Jack used to break into houses, and take anything he could find. He tried pickin’ pockets one while, but he was too clumsy, and got caught too often. Marlowe could do that better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were those the two men you spoke of to Mr. O’Connor, as you were coming away?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did you happen to be in charge of such a man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s more than I knows of. When I was a little chap, four or five years old, I lived with Jack; but he never told me where he got me from.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think you are his son?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I know I’m not. When Jack got drunk he used to tell me I wa’n’t no child of his, and he’d send me out to shift for myself if I didn’t do jest as he told me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he often get drunk?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He used to drink when he got a chance, but he’d only get reg’lar drunk about once a week.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he ever offer you anything to drink?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” answered Julius, laughing; “he wanted it all himself. But I wouldn’t have took it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t like it. Besides, I didn’t want to lay round drunk like Jack. I didn’t see that there was any fun in it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are right there. There is very little fun, as you call it, in getting drunk. It appears to me you were brought up under bad influences.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I was,” said Julius, in a matter-of-fact manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Many would be afraid to take into their houses a boy who had been reared by a thief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe they would,” said Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They might be afraid that he had been trained to steal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Julius; “but what’s the good of stealin’ when you got a good home?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Quite right; but that isn’t the highest view to take of stealing. It is wrong in the sight of God.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s what they told us at the Lodgin’ House.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you believe it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir, I believe it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And if ever you are tempted to take anything that doesn’t belong to you, think first that it will be displeasing to God. After that, you may consider that it is bad policy also.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was bad for Jack and Marlowe. They was in prison half the time. They’re in Sing Sing now, hammerin’ stone, I expect.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may be thankful that you are out of their reach. But you said you wanted to drive.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said Julius, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take the reins, and I’ll show you how to do it. You will have to learn to harness and unharness the horse also.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’ll be bully,” said our hero, in a tone of satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad you like the idea. I am going to make a Western farmer of you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s what I want.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Taylor gave Julius some practical directions about driving, and had an illustration of the boy’s quickness in his immediate comprehension and acting upon them. They soon came in sight of a gate, on the other side of which was a lane.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jump out and open the gate,” said Mr. Taylor. “That lane leads to my house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They soon came in sight of a substantial farm-house of good appearance. A man in overalls, and without a coat, came up to meet the carriage.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Abner,” said Mr. Taylor, “you may take out the horse, and put him in the barn.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall I go with him?” asked Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not now. I will take you into the house, and introduce you to Mrs. Taylor, who will show you where you are to sleep.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He entered the house, followed by Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come in here,” said Mr. Taylor, throwing open the door of a comfortable sitting-room. It was furnished in ordinary, yet tasteful, style; and to Julius, bred in the street and never having known anything better than a bare and cheerless apartment in a shabby tenement house, it seemed like a palace. In front of a fire sat a pleasant and comely woman of thirty-five, sewing. She looked up as Mr. Taylor entered, and her eyes rested with interest on the boy who followed him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Emma,” said her husband, “this is the boy I spoke to you about.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to see you,” said Mrs. Taylor, with a cordial smile, extending her hand, which Julius took bashfully. He was not diffident in the presence of men, but he was not accustomed to ladies, and felt awkward in their presence. “You have come a long journey,” said Mrs. Taylor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir—I mean ma’am,” stammered Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You come from New York?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, ma’am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you will like Brookville. It isn’t much like the great city you have left.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I like it a great deal better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is your name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Julius.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are the first Julius that I ever met. And your other name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I haven’t got none.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The lady looked surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What was your father’s name. Surely he had one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe he did, but I never had the pleasure of his acquaintance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is really singular, Ephraim,” said his wife. “How can he get along with but one name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He can take ours.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How would you like to take the name of Taylor?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tiptop,” said Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you can call yourself Julius Taylor. I suppose that will be all the formality required. Emma, where are you going to put him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will show him his room,” said Mrs. Taylor. “Is his trunk outside?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I haven’t got no trunk,” said Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then where do you keep your clothes?” asked Mrs. Taylor, in some surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suspect,” said her husband, “Julius carries his clothes on his back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve got some in this bundle,” said our hero, displaying a paper parcel.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will have to buy him some, Ephraim,” said his wife. “He will need a supply of underclothes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I leave that matter in your hands, my dear. You will know more about his needs than I.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Julius followed Mrs. Taylor upstairs to a small back chamber on the second floor, which was neatly furnished, with a bedstead, table, bureau, washstand, two chairs, and adorned, moreover, by three prints cheaply framed, and hung upon the walls.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This will be your room Julius,” said Mrs. Taylor.\n\u003c/div\u003e \n\u003cdiv\u003e\n To the boy, with the recollections of his street life fresh in his memory, it seemed hardly credible that this sumptuous chamber, as it seemed to him, could really be his.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you like it?” asked Mrs. Taylor, noticing that he remained silent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t I?” he answered, drawing a long breath. “Is this goin’ to be my room?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, you are to sleep here regularly. That bureau is for your clothes. You can put your bundle inside now, and in a few days you shall have some more to put in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s stavin’,” ejaculated Julius, rapturously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not familiar with that word,” Mrs. Taylor said, “but I suppose it means that the room suits you. You will find some water in the pitcher, if you want to wash. When you have got through, you may come downstairs. We shall have dinner directly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Left to himself, Julius sat down on the bed, and tried to realize the situation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What would Jack say if he should see me now?” he said to himself. “I didn’t expect I was goin’ to set up as a gentleman so quick. Ain’t this a jolly bed? I’ll sleep like a top on it. It’s a blamed sight better than lyin’ on the floor in Jack’s room, or sleepin’ in old wagons, or on the piers. I feel as if one of them magician chaps had shaken his stick at me and changed me from a bootblack into a prince, like he did in that play at the Old Bowery. So I’m Julius Taylor now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Julius arose from the bed, and proceeded to wash his face and hands, though, under ordinary circumstances, he would scarcely have thought it necessary. But he reflected that he had ascended in the social scale, and it was only proper to adapt himself to his new position. When he had completed his ablutions, to use an expression which he would not yet have understood, he heard a bell ring below.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s for grub!” he said to himself. “I guess I can do my share.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2985/82285.html","bookId":341,"creation":"Aug 11, 2019 6:09:32 AM","modification":"Aug 11, 2019 6:09:32 AM"}
