{"id":42640,"no":13,"title":"CHAPTER XIII. THE NEW DOLL.","content":"\u0026nbsp;Julius had been unusually fortunate in obtaining a home in Mr. Taylor’s family. His new guardian was a man of wealth; indeed, he was the wealthiest man in Brookville. He owned shares in banks and mining companies, and could have lived handsomely had his farm yielded no income. He had a taste for agriculture, however, though he personally carried on but a small part of his extensive farm. His wife had been born and brought up in an Eastern city, was well educated, and, though she superintended the affairs of her household, did comparatively little work herself, having the aid of two stout, capable girls in the kitchen, who relieved her of all the drudgery, and, being competent for their positions, required very little looking after. It will be seen, therefore, that Mr. Taylor’s household is not presented as that of an average Western farmer. Though, as a class, our Western farmers are intelligent, they lack the refinement and cultivation which Mr. and Mrs. Taylor derived from their early advantages. \n\u003cdiv\u003e\n I must now explain how they came to take Julius into their family. Though they had been married twelve years, they had but one child, a little girl of five, a pretty and attractive child. Having no son, it occurred to them to receive into their household a boy, who would be company for little Carrie, and whom, if found worthy, they might hereafter adopt and provide for. A boy of the age of Julius can always make himself useful on a Western farm, but it was only partially with a view to this consideration that he was received.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Taylor resolved to give him a good education, and increase his advantages, if he showed himself to possess capability and willingness to learn.\n\u003c/div\u003e \n\u003cdiv\u003e\n Comparatively few of the boys who are sent to the West can hope to obtain such homes; but though their privileges and opportunities may be less, they will in most cases obtain a decent education, good treatment, and a chance to rise.\n\u003c/div\u003e \n\u003cdiv\u003e\n While Julius was upstairs, Mr. Taylor asked his wife:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Emma, what do you think of the boy I have brought home?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He looks bright, but I judge that he has not had much education.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Quite right; it will be for us to remedy that. He has been brought up in the streets of New York, but I don’t think he has any bad faults.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He described his room as ‘stavin’,” said Mrs. Taylor, smiling. “I never heard the word before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is an emphatic word of approval among boys. I have heard it among those who are not street boys. They use it where girls would say a thing was ‘perfectly lovely’.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I never had much to do with boys, Ephraim. You know I had no brothers, so I am ignorant of their dialect.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I presume Julius will enlighten your ignorance before long.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hardly think I shall adopt it. Suppose I should tell Mrs. Green that her dress was ‘stavin’?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably she would stare. Seriously, I hope our young waif may do credit to our training. He will have a great deal to learn, and much to unlearn; but he looks bright, and I have good hopes of success.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Here little Carrie entered, and at once monopolized attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you think I have brought home for you, Carrie?” asked her father, taking her in his arms and kissing her.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know, papa. What is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s a doll—a big doll.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How big?” asked Carrie, seriously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bigger than Carrie.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, how nice!” said the child. “Where is it?” and she looked around.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It will soon come in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did you get it, papa?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It came all the way from New York.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How nice of you, papa!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what do you think, Carrie? It can walk all by itself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Really, papa?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, and it can talk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can it talk like me?” asked the unsuspecting child.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; and a great deal louder.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It must be a funny doll,” said the child, reflectively? “What does it look like?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Like a boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it a boy doll?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad of that. All my dolls are girls.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, this is a boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you pay a great deal for it, papa?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Taylor laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I expect it will cost me a great deal before I get through with it; for I forgot to tell you one thing, Carrie—this doll I am speaking to you about, eats.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does it eat dinner?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall I have to feed it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think it will prefer to feed itself, Carrie,” said her father, compelled to laugh by the serious, wondering face of the little girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n At that moment Julius entered the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There it is now,” said Mr. Taylor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is a boy,” said Carrie, looking somewhat disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I told you it was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you said it was a doll. Are you a doll?” she asked, sliding from her father’s knee, and running up to Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m a pretty big one,” said Julius, amused.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There, papa, you were only funning,” said the little girl, reproachfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t I tell you the truth? Can’t he eat, and talk, and walk?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but he isn’t a doll.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Isn’t he better than a doll? A doll couldn’t play with you; Julius can.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is your name Julius?” asked the little girl, looking up to our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s your other name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Taylor,” answered Julius, with a glance at her father.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, that’s our name.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then he must be of our family,” said her father. “Do you want him to stay, and live with us? He can play with you, and tell you stories, and you can have plenty of good times together.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I should like to have him stay. Will you, Julius?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, if you want me to,” answered our hero; and he felt strongly attracted to the sweet little girl, who had mistaken him for a doll.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you may lead him out to dinner, Carrie,” said Mr. Taylor, as Jane, one of the servants, opened the door and announced that dinner was ready. “Perhaps you will have to feed him, as he is a doll, you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now you are funning again, papa,” said Carrie, shaking her curls. “Will you sit by me, Julius?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to, Carrie,” said our hero; and hand in hand with the little girl he walked into the next room, where a table was neatly spread for dinner.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a new experience to Julius. He had never had a sister. Those girls with whom he had been brought in contact had been brought up as he had been, and, even where their manners were not rough, possessed little of the grace and beauty of this little child of fortune. She seemed to the eyes of our young plebeian a being of a higher type and superior clay, and, untutored as he was, he could appreciate in a degree, her childish beauty and grace.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. and Mrs. Taylor were pleased to find that the little girl’s happiness was likely to be increased by this accession to their household.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think, Carrie,” said her mother, “you like Julius better than if he were a doll.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, mamma, I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you don’t,” said Julius, “I’ll turn myself into a big doll with pink eyes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can’t,” said Carrie, seriously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe I can’t myself, but I might get a big magician to do it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that a fairy,” asked the little girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The difference is,” said her father, “that magicians are men, but fairies are women.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t want you to,” said Carrie, “for then you couldn’t talk to me, and play with me. Please stay a boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will as long as you want me to,” said Julius, gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero did not feel wholly at his ease, for he was not used to dining in company. In the cheap eating houses which he had been accustomed to patronize, when he was in luck, very little ceremony prevailed. The etiquette in vogue was of the loosest character. If a patron chose to sit with his hat on, or lean his elbows on the table, there was nothing to prevent. But Julius was observing, and carefully observed how Mr. and Mrs. Taylor ate, being resolved to imitate them, and so make no mistakes. He found it difficult, however, to eat with his fork, instead of his knife, as he had always done hitherto, and privately thought it a very singular and foolish custom. His attempts were awkward, and attracted the attention of his new guardians; but they were encouraged by it to believe that he would lay aside other habits springing from his street life, and, after a while, shape his manners wholly to his new position.\n\u003c/div\u003e \n\u003cdiv\u003e\n When dinner was over, Mr. Taylor said: “Julius, would you like to go out with me and see the farm?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said our hero, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you were going to play with me,” said little Carrie, disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Julius can’t play with you all the time, my dear,” said her mother. “After supper perhaps he will.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall I change him into a doll?” asked her father. “Then he’ll have to stay in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Carrie; “I like a boy better.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2985/82286.html","bookId":341,"creation":"Aug 11, 2019 6:09:32 AM","modification":"Aug 11, 2019 6:09:32 AM"}
