{"id":42629,"no":2,"title":"CHAPTER II. THE “GRAND DUKE’S OPREA HOUSE.”","content":"\u0026nbsp;Some minutes before eight, Julius reached the “Grand Duke’s Oprea House.” It is very eligibly located on Baxter Street not far from the famous Five Points. Perhaps in consequence of the filthy condition of the streets in the immediate neighborhood, visitors are not expected to appear in full dress, and nothing is more common than for the young gentlemen who patronize it to dispense with coat or vest, or both. As for kid gloves, these are not tolerated at the Oprea House, and a fellow who indulged in them would be regarded as “puttin’ on airs,” and probably be hustled out unceremoniously, as guilty of a gross insult to the rest of the spectators. \n\u003cdiv\u003e\n The entrance to the Grand Duke theatre is not imposing. In fact, the visitor is obliged to descend a shaky staircase into a cellar about ten feet below the level of the sidewalk.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s like goin’ down into a coal mine,” remarked Julius to Pat Riley, who was acting as his guide.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s so,” said Pat; “but we have jolly fun when we get there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Reaching the bottom of the flight of steps, Julius found himself confronted by the ticket seller who was looking out of a square hole, over which were marked the prices of admission.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s where yer pay,” said Pat. “I go in free, coz I’m one of the actors.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five cents,” said the keeper of the box office.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There it is,” said Julius, who had come provided with the right change.\n\u003c/div\u003e \n\u003cdiv\u003e\n The treasurer pulled a cord connecting with the door of entrance, and Julius entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Oprea House proved to consist of a room twenty feet by thirty, and six and a half feet high. A portion of this was set apart as a stage, in front of which hung a curtain of turkey-red calico, four breadths wide. On one side was a lofty pillar with a scroll, on which was written the ambitious name of this temple of the muses, “Grand Duke’s Oprea House.” In place of the customary footlights was a kerosene lamp, which with the aid of a concave reflector illuminated the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do yer think of it, Julius?” asked Pat, with justifiable pride.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s bully.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ain’t it? Do yer see that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Pat pointed to a large broadside of brown packing paper, on which was rudely scrawled:\n\u003c/div\u003e \n\u003cdiv\u003e\n “BENEFIT\n\u003c/div\u003e \n\u003cdiv\u003e\n OF\n\u003c/div\u003e \n\u003cdiv\u003e\n Miles O’Reilly,\n\u003c/div\u003e \n\u003cdiv\u003e\n The Great Nigger Komedian\n\u003c/div\u003e \n\u003cdiv\u003e\n AND\n\u003c/div\u003e \n\u003cdiv\u003e\n Jig Dancer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s me!” said Pat, with professional pride. “It looks big, don’t it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Julius, admiringly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s lots of chaps would give all they could make on shines in a week, to hev their names put up there,” said Pat, confidentially.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d like it myself,” said Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ef you wos goin’ to stay in the city, I’d learn you some jigs,” said Pat, “and see what you was made of. It isn’t every feller that can make a good jig dancer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you, Miles?” said a large boy, slapping Pat on the shoulder. “I guess you’ll have a good house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope I will. Dave, this is a friend of mine. He ain’t been to the Oprea House before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Glad to see yer,” said David Conroy, with dignified affability. “Hope yer’ll get yer money’s worth.”\n\u003c/div\u003e \n\u003cdiv\u003e\n To this Julius made a suitable reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dave is stage manager,” said Pat. “He kin do anything, kin Dave. He painted the sceneries; you’ll see ’em bimeby, and he’s the best actor we’ve got. He’s captain of the Mulligans. There ain’t nothin’ that feller can’t do,” concluded Pat, with unmistakable admiration expressed in his tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where do you get your plays from, Pat?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Call me Miles while we are in the Oprea House. That’s my name here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Miles, then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dave fixes ’em up out of plays at the Theatre Comique, and some of the songs we gits from Tony Pastor’s. If there was time I’d take you behind the sceneries. But it’s most time to begin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Miles O’Reilly is wanted,” was heard from behind the curtain, and the great comedian left our hero and hurried behind the scenes.\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time the cellar was nearly full of boys, varying in age from five to twenty, who were crowded together in such near proximity as the limited size of the auditorium rendered imperatively necessary. The front row was close up to the curtain, and here Julius was fortunate enough to secure a place.\n\u003c/div\u003e \n\u003cdiv\u003e\n The stiffness and reserve which characterize the spectators at other theatres was dispensed with at the free and easy “Grand Duke’s Oprea House.” Cheerful and jocose remarks were interchanged, spiced with genial humor, and occasionally tinged with sarcastic remarks of a personal character. But all was taken in good part. At last, however, the patrons became impatient, and calls were heard, such as, “What yer waitin’ fur?” “Hurry up de overture!” “Have yer gone ter sleep behind there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n At last the manager responded to the flattering impatience of his patrons. The curtain arose and displayed the orchestra consisting of two musicians, a performer on an accordeon and a bone-player. The overture was made up of pieces skillfully selected by the manager to suit the tastes of the audience. Choice gems from “Norma,” “Trovatore,” and “Faust” would not have satisfied the fastidious tastes of the Grand Duke’s patrons. Instead of these, such choice airs as “Squeeze me, Joe,” and “Up in Avenue A,” afforded unmistakable pleasure, and the whole closed with “The Campbells Are Coming,” which was rendered with spirit and general acceptance.\n\u003c/div\u003e \n\u003cdiv\u003e\n Next came the comedy, “Laughing Gas,” in which the gas is administered to a variety of patients, who are differently affected, one laughing, another dancing, another combative, and so on. The acting was rude, but lively, and the piece was rapturously applauded. In this applause Julius bore his full part. Though he is my hero I have no desire to represent him as more refined or better educated than the majority of his companions. The classic drama or the opera, as brought out at the Academy, would have been far less attractive to him than this rude performance.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was no less pleased with the next piece, in which two boys, representing Tom King and Dick Turpin, appear on the stage with dark lanterns, and attempt the robbery of a house, but become panic-stricken, and exhibit more alarm than the occupants of the house. This, of course, amuses the spectators.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It ’minds me of Jack and Marlowe,” said Julius to his next neighbor, “when they was robbin’ the house on Madison Avenue.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was you there?” asked the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but I knew all about it. I lived with Jack.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You did!” repeated the other, with something like awe at finding his neighbor to have been intimate with so illustrious a criminal. “How did you like him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jack wa’n’t a bad sort,” said Julius, “except when he was sprung. I like him better than Marlowe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They was took by the cops, wasn’t they?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, they was took,” said Julius, shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n His own agency in the affair he didn’t care to mention, chiefly because in the class to which he belonged it was considered a point of honor to make common cause against the cops, that is, against the conviction of those who transgress the laws, and our hero felt that the revelation of his agency in entrapping his associates would not increase his popularity. Nor would he have taken the part he did but for the gratitude he felt to Paul, and the fear that he would suffer harm.\n\u003c/div\u003e \n\u003cdiv\u003e\n Later in the evening the beneficiary, the great Miles O’Reilly, appeared in a jig, which was very creditably danced. His appearance was the signal for a noisy ovation; due partly to his general popularity, and partly to his position as the beneficiary of the evening.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good for yer, Miles!” expressed the general appreciation of his efforts. Space will not permit us to enlarge on the other features in the programme of the evening. Evidently “The Mulligan Guards” was most popular, being received with tremendous applause. To gratify the curiosity of such of my readers as are not familiar with this celebrated local song, the first verse is here introduced:\n\u003c/div\u003e \n\u003cdiv\u003e\n “We crave your condescension,\n\u003c/div\u003e \n\u003cdiv\u003e\n We’ll tell you what we know\n\u003c/div\u003e \n\u003cdiv\u003e\n Of marching in the Mulligan Guard,\n\u003c/div\u003e \n\u003cdiv\u003e\n From Sligoward below.\n\u003c/div\u003e \n\u003cdiv\u003e\n Our captain’s name was Hussey,\n\u003c/div\u003e \n\u003cdiv\u003e\n A Tipperary man,\n\u003c/div\u003e \n\u003cdiv\u003e\n He carried his sword like a Russian duke,\n\u003c/div\u003e \n\u003cdiv\u003e\n Whenever he took command.\n\u003c/div\u003e \n\u003cdiv\u003e\n Chorus.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We shouldered guns, and marched and marched away,\n\u003c/div\u003e \n\u003cdiv\u003e\n From Baxter Street we marched to Avenue A;\n\u003c/div\u003e \n\u003cdiv\u003e\n With drums and fifes how sweetly they did play,\n\u003c/div\u003e \n\u003cdiv\u003e\n As we marched, marched, marched in the Mulligan Guard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The effect of the song is heightened by the marching of the Guards, the roll of the drum, and presenting arms, which the young actors went through very creditably.\n\u003c/div\u003e \n\u003cdiv\u003e\n At the close, Miles was summoned before the curtain, and a speech was called for. As the recipient of the benefit the eminent actor could not very well decline. He presented himself with a low bow, and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Boys, I’m glad to welcome yez here this evening. I don’t care so much for the stamps.” (“Oh, no! course yer don’t!” came in ironical accents from some one in the audience.) “That’s so, Jim Blin, and you know it. I’m glad yez like my dancin’! I won’t say no more, ’cause I ain’t used to makin’ speeches, but, with the kind permission of the manager, I’ll give yez anuther jig, and wish you good-night!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Here the speaker bowed, the music struck up, and, to the satisfaction of all, the beneficiary repeated his performance. Then there was a rush for the door and in five minutes the “Grand Duke’s Oprea House” was silent and deserted.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2985/82275.html","bookId":341,"creation":"Aug 11, 2019 6:09:31 AM","modification":"Aug 11, 2019 6:09:31 AM"}
