{"id":42647,"no":20,"title":"CHAPTER XX. MR. SLOCUM’S PANIC.","content":"\u0026nbsp;Had Mr. Slocum become in after years a distinguished man, and in due time a biography had been called for, some one of the scholars who had the great privilege of receiving his instructions would have been admirably qualified, so far as information went, to perform the task of writing it; for, as we have seen, the teacher took frequent occasion to illustrate points that came up in the day’s lessons by narratives drawn from his own personal experience. One day, for instance, when in the class in geography a certain locality was spoken of as abounding in bears, Mr. Slocum indulged in a reminiscence. \n\u003cdiv\u003e\n Laying down the book on his desk, he said: “I myself once had an adventure with a bear, which I will narrate for your entertainment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Slocum’s stories were always listened to with close attention, in the confident expectation that they would be found to redound greatly to his credit. So the boys looked up, and exhibited a gratifying interest on the part of the class.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must know,” said the teacher, “that we have extensive forests in Maine, in some of which wild animals are to be found. One day, when a mere boy, I wandered into the woods with some of my school companions. We were hunting for squirrels. All at once an immense bear walked around from behind a tree, and faced us, not more than fifty feet away. Most of the boys were frightened, for we had no guns with us. We knew that if we climbed the trees the bear could climb after us. So, as they looked upon me as a leader, they turned to me, and said, ‘Theophilus, what shall we do? The bear will kill us,’ and one of the smallest boys began to cry. But I was not frightened,” continued Mr. Slocum, impressively. “I was always noted for my presence of mind even as a boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Don’t be frightened, boys,’ I said, ‘I will save you.’\n\u003c/div\u003e \n\u003cdiv\u003e\n “I had heard that nearly all beasts are afraid of the human eye. So I advanced slowly toward the savage beast, fixing my eye sternly upon him all the while.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Here Mr. Slocum glared upon the boys, by way of illustrating the manner in which he regarded the bear.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The result was what I expected. The bear tried to sustain my steady gaze, but in vain. Slowly he turned, and sought the solitudes of the forest, leaving us in safety. When my companions found that they were saved, they crowded around me, and said, with tears in their eyes, ‘Theophilus, you have saved our lives!’ When we returned home,” Mr. Slocum added, complacently, “the fame of my bravery got about, and the parents of the boys clubbed together, and bought a gold medal, which they presented to me out of gratitude for what I had done.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you got it with you, sir?” asked one of the class.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry to say that I have not,” answered the teacher. “I was afraid I might lose it, and so I left it on deposit in a bank, before I left Maine for the West.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you believe that bear story, John?” asked Julius, of John Sandford, when they were walking home from school together.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor do I.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The fact is, Mr. Slocum is the biggest blower I ever met with. I don’t believe half the stories that he tells about himself. If they were true, he would be, I think, one of the most remarkable men that ever lived. I don’t believe he’s as brave as he pretends.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose we find out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How can we?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has he ever seen your bear?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think he has. We never let it out into the road.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t we manage to have him fall in with the bear some evening, John?” asked Julius. “It would be fun to see him try to stare the old fellow out of countenance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s a splendid idea, Julius. I’m in for it, but I don’t see exactly how we can manage it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell you. He goes by your house sometimes in the evening, doesn’t he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. He told me once he walked in order to commune with Nature.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I propose that he shall commune with the bear once, by way of variety.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me what to do, and I will do it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have the bear close by, and just after he has passed let him out—the bear, I mean. Then run by Mr. Slocum, appearing to be in a great fright, and tell him there’s a bear after him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good!” said John, shaking with laughter. “But you must help me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I will.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It will be easier for one reason,” said John. “I have taught the bear to run after me, and as soon as he sees me ahead he will begin to run too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let it be to-morrow evening. What time does Mr. Slocum go by?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About seven o’clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll be around at your house then at half-past six.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you tell the rest of the boys?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not till afterward. If they come around, and there is a crowd, we may not be able to carry out our plan.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’ll be mad with us when he finds out our game.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let him be mad. We’ll look him in the eye, and he’ll turn tail and flee.”\n\u003c/div\u003e \n\u003cdiv\u003e\n * * * * * * * * *\n\u003c/div\u003e \n\u003cdiv\u003e\n The next evening two boys might have been seen crouching behind the wall bordering a large field belonging to Mr. Sandford. The bear was peacefully reclining beside them. From time to time the boys took observations, with a view to discover whether the enemy was in sight.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid he isn’t coming,” said Julius. “That would be a joke on us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He can’t be so mean, when we have made such preparations to receive him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he would if he only knew what they are.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush! there he is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In the distance the stately figure of the teacher was seen, walking with dignified composure. Mr. Theophilus Slocum always walked as if he felt that the eyes of the world were upon him. He realized that he was a personage of no little importance, and that it behooved him to shape his walk and conversation accordingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n The hearts of the boys beat high with anticipation. At length they heard the teacher go by.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now for it!” said Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now is the time to try men’s soles!” said John. “Can you run?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll see.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Through an opening they emerged into the road, followed by the bear. Mr. Slocum was now about fifty feet in advance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now scream!” said Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys uttered a shriek, and began to run at the top of their speed. The bear, as he had been trained, tried to keep up with them. Mr. Slocum turned around, and saw the fleeing boys, and behind them the huge, unwieldy bear getting rapidly over the ground. He knew it was a bear, for he had once seen one at a menagerie.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Mr. Slocum, save us!” implored Julius, appearing greatly frightened.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s a bear after us,” chimed in John. “Don’t let him kill us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Now the teacher had never heard of Mr. Sandford’s bear. He was not aware that one was kept in the village. He supposed that this one had strayed from the forest, and was dangerous. Alas! that I should record it—instead of bravely turning, and facing the animal, Theophilus turned pale with terror, and exerting his long limbs to the utmost, fled incontinently, shooting ahead of the boys, whom he didn’t pause to rescue, coattails flying, and, having lost his hat in his flight, with his red hair waving in the wind.\n\u003c/div\u003e \n\u003cdiv\u003e\n When John and Julius saw the tall figure speeding before them, and saw the panic into which their eminent instructor had been thrown through their mischievous means, a sense of the ridiculous so overcame them that they sank down in the path, convulsed with laughter. But Mr. Slocum didn’t see this, for he never stopped till he had run half a mile, when he bolted into the village store, panting and out of breath, and answered the eager inquiries of the men who were congregated there, by giving an alarming account of a ferocious bear which had closely pursued him for two miles.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it Sandford’s bear?” asked one of his auditors.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does Mr. Sandford keep a bear?” asked Theophilus.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; he has a large one. But it is quite tame. It wouldn’t hurt a child.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why,” said the teacher, bewildered, “Mr. Sandford’s son, John, was running away from him. Julius Taylor was with him. They told me that a bear was after them, and asked me to save them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Slocum was hardly prepared for the laugh which followed. The joke was understood at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think, Mr. Slocum,” said the storekeeper, “that the boys were playing a trick upon you. They probably let out the bear just after you passed by. You didn’t stop to save them, did you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” stammered Theophilus, beginning to look foolish, for he, too, understood the joke now, and saw that it would be hard to reconcile his conduct this evening with his bravery as a boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n For almost the first time in his life he had absolutely nothing to say. He left the store, and retraced his steps in the hope of finding his hat. In this he was successful, but neither John, Julius, nor the bear was visible. The boys were in Mr. Sandford’s barn, laughing over the joke, and beginning to wonder whether Mr. Slocum would say anything about it in school the next day.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2985/82293.html","bookId":341,"creation":"Aug 11, 2019 6:09:32 AM","modification":"Aug 11, 2019 6:09:32 AM"}
