{"id":42652,"no":25,"title":"CHAPTER XXV. JULIUS BECOMES A CAPTIVE.","content":"\u0026nbsp;Julius was still wandering about in uncertainty, holding Carrie by the hand, when the Indian came in sight of him. Stealthily creeping up, he seized our hero by the shoulder before he realized that the enemy was upon him. He had no time to draw his pistol, nor did he deem it prudent to do so now, as the Indian could easily wrest it from him, and turn it against him. \n\u003cdiv\u003e\n “Me got you!” exclaimed the savage, in accents of fierce exultation.\n\u003c/div\u003e \n\u003cdiv\u003e\n Little Carrie uttered a dismal cry when she looked up and saw that her dreaded captor was near.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t be frightened, Carrie,” said Julius, soothingly, though, to tell the truth, he felt rather uncomfortable himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you want?” he demanded, putting a bold face on.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Want little girl,” answered the Indian.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am taking her home. Her father sent me for her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No matter; no go,” said the Indian, frowning.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What good will it do you to keep her?” asked Julius, though he suspected argument would be of no avail.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No matter; come!” said the savage, and he seized Carrie by the hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Julius, don’t let him carry me off,” said Carrie, beginning to cry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We must go, Carrie,” said our hero, in a low voice. “Perhaps he will let us go after a while.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I want to go to mamma!” said the little girl, piteously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No go. Mother bad,” said the Indian.\n\u003c/div\u003e \n\u003cdiv\u003e\n “She isn’t bad,” said Carrie, forgetting her fear in her indignation. “She’s good. You are bad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush, Carrie!” said Julius, who foresaw that it would not be prudent to provoke the savage.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You come, too,” said the Indian to Julius. “What for you steal little girl?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Julius felt that he might with great propriety have put this question to his companion, but he forebore. He was trying to think of some way of escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian plunged into the thick wood, holding Carrie by the hand. Julius followed close after him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So it seems,” he said to himself, “instead of recovering Carrie I am caught myself. I wish Mr. Taylor and Abner would come along. We should be too much for the Indian, then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This gave him an idea. He took a piece of paper quietly from his pocket, and wrote on it:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am with Carrie and the Indian. He is leading us into the middle of the wood. I will drop pieces of paper here and there on the way.\n\u003c/div\u003e \n\u003cdiv\u003e\n Julius.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This he dropped casually in the path, without the knowledge of the Indian.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There,” he said to himself; “if either of them comes this way, it may be the means of saving us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But though John did not observe this, he did notice the pieces of paper which Julius dropped, and he was sharp enough to detect his motive for doing this.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What for drop paper?” he demanded, seizing Julius roughly by the shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n Julius knew that it would be of no use to equivocate, and he answered, manfully. “To let Mr. Taylor know where we are.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Umph!” grunted the Indian. “Pick up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Julius was forced to pick up all the bits of paper he had scattered, but the original one containing the message he left where it lay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian made Julius go in front, and the three went on till they reached the pile of leaves where Carrie and the Indian had rested before.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian resumed his reclining position, and made Julius and Carrie sit down also. Our hero, who still had the pistol, was in doubt whether to use it, but a moment’s reflection satisfied him that it would be of no use. If he wounded the Indian, the latter in his rage might kill them both. Another idea came to him. He had heard from Mrs. Taylor that the Indian had demanded money, and had probably taken offense because it was not given him. He had two dollars in his pocket. If he should give this to their captor, he would probably be eager to invest it in “fire water,” and this would make it necessary to go to the village. While he was absent Carrie and he could start again on their way home.\n\u003c/div\u003e \n\u003cdiv\u003e\n Upon this hint he spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us go,” he said, “and I will give you money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he drew four silver half-dollars from his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Give me,” said the Indian, his dull eye lighting up.\n\u003c/div\u003e \n\u003cdiv\u003e\n Julius surrendered them, but said, “Can we go home?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No go,” said the Indian. “Stay here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero expected nothing better. Still he felt disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n By and by the anticipated effect was produced. The Indian was eager to exchange the money for drink, but he did not want his captives to escape.\n\u003c/div\u003e \n\u003cdiv\u003e\n He arose to his feet, and approached Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n He took the wondering boy by the shoulder, and placed his back against a tree.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is he going to do?” thought our hero, rather alarmed.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was not long left in uncertainty.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian drew from some hiding place in his raiment a stout cord, and proceeded dexterously to tie Julius to the tree.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t hurt him!” exclaimed Carrie, terrified, thinking that something dreadful was going to be done to Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Indian did not deign to reply, but proceeded to perform his task so thoroughly that Julius felt uncomfortably cramped.\n\u003c/div\u003e \n\u003cdiv\u003e\n When it was accomplished, the Indian turned to go.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go ’way,” he said. “Soon come back. Stay here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Julius felt that he was likely to obey the command, as there was not much chance of his breaking his bonds. But there was one hope yet that somewhat encouraged him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Feel in my pocket, Carrie,” he said, “and see if I have a knife.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Carrie obeyed, but the search was unavailing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How unlucky!” said Julius. “I usually have it with me, but I remember leaving it in my other pants. If I only had it, you could cut the string, and we could escape.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think he will keep us always, Julius?” asked Carrie, disconsolately.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Carrie; I will find a way to get you home, before long,” said Julius in a tone that expressed more cheerfulness than he felt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s provoking,” he thought, “to be tied up here, when there is such a good chance to escape. I’ll never go without a knife again. I didn’t think how much good it might do me.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2985/82298.html","bookId":341,"creation":"Aug 11, 2019 6:09:32 AM","modification":"Aug 11, 2019 6:09:32 AM"}
