{"id":42653,"no":26,"title":"CHAPTER XXVI. THE RESCUE.","content":"\u0026nbsp;Meanwhile Mr. Taylor and Abner had pursued the search in vain. From opposite directions they met at the entrance to the wood. \n\u003cdiv\u003e\n “Have you found no traces of Carrie, Abner?” asked the father, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” said Abner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you met Julius?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I, too, have been unsuccessful; but I am impressed with the belief that my dear child is somewhere in this wood.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very likely, sir. It would be nat’ral for an Indian to make for the woods; that is, if he’s got her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid there is no doubt of that,” sighed Mr. Taylor. “Do you think he would hurt her, Abner?” he asked, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I reckon not. He’d keep her to get money out of you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would rather give half my fortune than lose my darling.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It won’t be necessary to go as high as that, Mr. Taylor. Most likely he’s got her in here somewhere. If we go together, we’ll be too much for the red rascal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come on, then, and may God speed us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So they entered the wood, and plunged deeper and deeper into its gloom. By and by Abner’s attention was drawn to a white fragment of paper, half concealed in the grass. Elsewhere it would not have been noticed, but in the woods it must evidently have been dropped by some one.\n\u003c/div\u003e \n\u003cdiv\u003e\n He picked it up, and glanced at it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hurrah!” he shouted. “It’s the boy’s hand-writing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What boy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Julius.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Give it to me, quick,” said Mr. Taylor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Read it out loud,” said Abner, almost equally interested.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Taylor read:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am with Carrie and the Indian. He is leading us into the middle of the wood. I will drop pieces of paper here and there on the way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bully for Julius!” said Abner. “We’ve got the Indian now, sure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad he is with Carrie. She would be so frightened,” said Mr. Taylor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s true. She thinks a heap of Julius.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is a good boy—quick-witted, too, or he wouldn’t have thought of the paper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t see the scraps of paper he told about,” said Abner, who had been very anxiously peering about him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It may be that he was afraid to drop them, lest it should attract the Indian’s attention,” said Mr. Taylor, coming very near the truth.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe so. There is another way we can track them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Noticing where the grass and sticks are trodden over. That’s the Indian way. We’ll fight the red man in his own way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well thought of, Abner. Your eyes are better than mine. Lead the way, and I will follow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Abner was sharp-sighted, nor was he wholly ignorant of the Indians and their ways; and thus it was that he led the anxious father almost directly to the place where Carrie and Julius were waiting in fear and anxiety for the Indian’s return.\n\u003c/div\u003e \n\u003cdiv\u003e\n Abner spied them first.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There they are!” he exclaimed, “and the Indian isn’t with them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Unable to control his impatience, Mr. Taylor, with a cry of joy, rushed to the spot, and in a moment his beloved little daughter, Carrie, was in his arms.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear little girl,” he said, kissing her again and again, “I thought I had lost you altogether. Were you very much frightened?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was so frightened, papa, till Julius came. I didn’t mind it so much then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Abner was loosening the cord by which our hero was tied.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I s’pose the redskin did this,” said he. “Looks like his work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; he liked my company so much he didn’t want to let me go,” said Julius.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gone to the village to buy rum, I expect.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did he get his money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I offered him money to let Carrie and me go, but he took it, and then tied me up here. That’s what I call mean.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So do I,” said Abner; “but he’ll find the bird flown when he gets back, I reckon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The birds, you mean.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Julius,” said Mr. Taylor, grasping the hand of our hero, now released from his uncomfortable situation, “you have earned my heartfelt gratitude. But for you my darling would still be in the power of that miserable Indian.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t do much,” said Julius, modestly. “I only managed to get taken, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was the paper which you had the forethought to drop that led us here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you find it?” asked Julius, eagerly. “Then it did some good after all. I was afraid it wouldn’t. The Indian saw me dropping bits of paper, and he was sharp enough to know what it meant. He made me pick them up, but I left the paper with writing on it. He didn’t see that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s the way I thought it was,” said Mr. Taylor. “I told Abner you were prevented from giving us the clew, as you promised.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, it’s all right now,” said Julius. “Our copper-colored friend will have to dispense with our company to-night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We must be getting home,” said Mr. Taylor. “Your mother is terribly anxious about you, Carrie. Are you tired?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, papa; the Indian made me walk so fast.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will take you in my arms, my poor child. He shan’t get hold of you again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll take her part of the time, Mr. Taylor,” said Abner.\n\u003c/div\u003e \n\u003cdiv\u003e\n But the glad father did not seem to feel the weight of his recovered treasure. Quickly they retraced their steps, and when they came near the house Mrs. Taylor ran out to meet them, clasping Carrie to her bosom with grateful joy. It was a day of thanksgiving, for the lost had been found.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2985/82299.html","bookId":341,"creation":"Aug 11, 2019 6:09:32 AM","modification":"Aug 11, 2019 6:09:32 AM"}
