{"id":16136,"no":1,"title":"About Tarkington:","content":"Newton Booth Tarkington (July 29, 1869 – May 19, 1946) was an American novelist and dramatist best known for his Pulitzer Prize-winning novels The Magnificent Ambersons and Alice Adams. Booth Tarkington was born in Indianapolis, the son of John S. Tarkington and Elizabeth Booth Tarkington. He was named after his maternal uncle Newton Booth, then the governor of California. He first attended Purdue University but graduated from Princeton University in 1893. While at Princeton he was editor of the Nassau Literary Magazine and formed the Princeton Triangle Club. He was also voted the most popular man in his class. When Tarkington\u0027s class graduated in 1893 he lacked sufficient credits for a degree at Princeton, where he attended classes for two years. His later achievements, however, won him an honorary A.M. in 1899 and an honorary Litt.D. in 1918. He was one of the most popular American novelists of his time, with The Two Vanrevels and Mary\u0027s Neck appearing on the annual best-seller lists nine times. Tarkington\u0027s best known work today is The Magnificent Ambersons, due in part to its famous treatment by Orson Welles in 1942 and its frequently favored listing on the Modern Library\u0027s list of top-100 novels. It was the second volume in Tarkington\u0027s Growth trilogy, which traced the growth of the United States through the decline of the once-powerful and aristocratic Amber-son family dynasty, contrasted against the rise of industrial tycoons and \"new money\" families in the economic boom years after the Civil War leading up to World War I. Tarkington donated substantially to Purdue University and has been recognized for his philanthropy. Tarkington Hall, an all-men\u0027s residence hall at Purdue, is named in honor of him.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1677/49421.html","bookId":1175,"creation":"Aug 2, 2019 7:32:01 AM","modification":"Aug 2, 2019 7:32:01 AM"}
