{"id":105180,"no":6,"title":"Page 6","content":"\u003cp\u003eI read it and whistled the Moldau.\u003c/p\u003e\n\u003cp\u003eI had finished the pamphlet and was midway through a book called Czechoslovakia: A Nation in Name Alone when someone knocked at the door. I got off the bed and opened the door.\u003c/p\u003e\n\u003cp\u003e“Herr Tanner?”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“I am Greta.”\u003c/p\u003e\n\u003cp\u003eI found this quite impossible to believe. If that crippled dwarf had combined with a sickly little woman to produce this blonde goddess, then all theories of heredity had been permanently repealed. She was tall, almost my height, and her long blonde hair melted over her shoulders. Her eyes were a deep, vivid blue. Her body was long and leggy and yet more than abundantly curved. An old Norseman would have carved her on the prow of his ship; whatever his skill, he could not possibly have improved on the original.\u003c/p\u003e\n\u003cp\u003e“You are staring at me.”\u003c/p\u003e\n\u003cp\u003e“I am sorry.”\u003c/p\u003e\n\u003cp\u003e“I am not. I do not mind.” She licked her lips. “My father told me all about you. But he did not tell me you were young. I expected someone his age. I am not disappointed.”\u003c/p\u003e\n\u003cp\u003e“Uh-”\u003c/p\u003e\n\u003cp\u003e“You must be hungry. Come downstairs. I will fix you some lunch and we will talk. My father said that you had many interesting things to say about the question of race. I would be interested to hear your views.”\u003c/p\u003e\n\u003cp\u003eI followed her downstairs. Her bottom swayed leisurely from side to side as she walked. Her father had said that the Jews had lusted after her. I did not find this at all difficult to believe. I was suddenly certain that she was devoutly lusted after by Jews and Czechs and Slovaks and Germans and Russians and Hindi and Thais and Sumatrans. Anyone who saw her was likely to have the same reaction. It was not simply beauty, which, when all is said and done, may be a chilly asset. She had beauty in abundance, but she also had a special primitive quality that left one with no doubts concerning her obvious function in life.\u003c/p\u003e\n\u003cp\u003eShe was not to talk with, she was not to cook, she was not to produce children. She was not to knit sweaters, to write plays, to dig ditches, to sing songs. She had been placed on earth for the singular purpose of lovemaking. That was what she was there for, that and nothing else.\u003c/p\u003e\n\u003cp\u003e“Some fried ham, Herr Tanner? And a stein of beer?”\u003c/p\u003e\n\u003cp\u003e“That would be fine, Fräulein Neumann.”\u003c/p\u003e\n\u003cp\u003e“Oh, not so formal, please. Call me Greta.”\u003c/p\u003e\n\u003cp\u003e“Greta.”\u003c/p\u003e\n\u003cp\u003e“And I will call you what?”\u003c/p\u003e\n\u003cp\u003e“Evan.”\u003c/p\u003e\n\u003cp\u003e“Evan. That is an unusual name, is it not? I do not think I have ever heard it before.”\u003c/p\u003e\n\u003cp\u003e“It’s not uncommon in America.”\u003c/p\u003e\n\u003cp\u003eShe brought the food and watched in silence while I ate. The ham was good, perhaps a little too salty but otherwise fine. The beer, according to the label, had been bottled right there in Pisek. It tasted very much like the Prague beer I had had now and then in New York. There is none better in the world.\u003c/p\u003e\n\u003cp\u003eWhen I finished she took my arm. “Now,” she said, “we must talk. We will go to your room. It is quieter there.”\u003c/p\u003e\n\u003cp\u003eWe walked arm in arm up the stairs. Now and then her body brushed lightly but purposefully against me. My eyes kept stealing over to look into the front of her dress.\u003c/p\u003e\n\u003cp\u003eShe was a Nazi, I told myself reasonably, and it was loathsome enough to rescue a Nazi, let alone make love to one. On top of that, she had a fiercely jealous father who was presently vital to the success of my rotten mission. And, if a third reason was needed, there was the fact that my mission to Prague was hazardous enough without the unnecessary complication of a romp in the hay with an Aryan maiden.\u003c/p\u003e\n\u003cp\u003eWe entered my room, and she kicked the door neatly shut. She seated herself on my bed, and I looked around the room for a chair, and there wasn’t one. I sat on the bed beside her. She yawned and stretched and sighed, and I tried to keep my eyes away from her chest with the approximate success of a moth trying to pay no attention to a flame.\u003c/p\u003e\n\u003cp\u003e“How old are you, Evan?”\u003c/p\u003e\n\u003cp\u003e“Thirty-four.”\u003c/p\u003e\n\u003cp\u003e“Thirty-four! And I am only twenty-two. Do you realize what that means?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“You are old enough to be my” – she licked her lips – “my lover.”\u003c/p\u003e\n\u003cp\u003eAs soon as she left the room – assuming she ever did leave the room – I would have to take a cold shower. That was supposed to help. I wondered if they had a shower. I wondered if they had cold water. I wondered if it would really help.\u003c/p\u003e\n\u003cp\u003e“My father says that I will go to Prague with you, Evan.”\u003c/p\u003e\n\u003cp\u003e“I don’t think so.”\u003c/p\u003e\n\u003cp\u003e“But of course I will!” She turned toward me, serious now, the gush of sex momentarily stanched. “You cannot go alone. Have you ever been to Prague? Do you know the city?”\u003c/p\u003e\n\u003cp\u003e“No, but-”\u003c/p\u003e\n\u003cp\u003e“I have been there. I know the town well. And I can help you. And you can trust me, and whom else can you trust in this country? My father could find friends of his, friends who might go with you, but I would not trust them. The government has spies everywhere, you know. Even in our own Bund there are undoubtedly spies. Why would you not want me to help?”\u003c/p\u003e\n\u003cp\u003e“It’s a dangerous job for a woman.”\u003c/p\u003e\n\u003cp\u003e“Is it less dangerous for a man?” She shook her head violently. “No, no, it is settled. We will go together. Papa will learn what there is to be learned, and we will make our plans, and we will leave for Prague tomorrow night after the meeting. Then-”\u003c/p\u003e\n\u003cp\u003e“What meeting?”\u003c/p\u003e\n\u003cp\u003e“Our local Bund. The Sudetendeutsche Bund of Pisek. After you address the meeting, we will-”\u003c/p\u003e\n\u003cp\u003e“After I what?”\u003c/p\u003e\n\u003cp\u003e“Address the meeting. It was Papa’s idea.”\u003c/p\u003e\n\u003cp\u003e“I just bet it was.”\u003c/p\u003e\n\u003cp\u003e“Will you listen, please? The government police know you are in the country, right? But they do not know why. Tomorrow you will appear at the meeting. You will give them the usual inspiring speech about the need to annex the Sudetenland once again to the Fatherland. We have heard it often enough, but it is a message we never tire of listening to. There will be spies at the meeting, of course. Throughout the country there are spies. They will report you to the authorities, and the authorities will guess that you are traveling through Czechoslovakia trying to stir up German communities. They will not like this.”\u003c/p\u003e\n\u003cp\u003e“Can you blame them?”\u003c/p\u003e\n\u003cp\u003e“You don’t understand. They will know that you are in Czechoslovakia, but they will miss the point of your visit. Right now they suspect you are here to liberate a Slovak. This may make them unsure. They will still want to catch you, to arrest you, but perhaps they will be less certain that you will turn up in Prague. And, while they comb this area for you, you and I will go to Prague tomorrow night and make our plans to get the Slovak out of jail.”\u003c/p\u003e\n\u003cp\u003eI didn’t say anything. She watched me, her eyes anxious. There was a certain amount of lunacy in old Neumann’s idea, but at the same time it might have a grain of merit to it as well. Any sort of false trail might make the game easier when we got to Prague.\u003c/p\u003e\n\u003cp\u003e“You will do it?”\u003c/p\u003e\n\u003cp\u003eA bloody Nazi speech to a batch of Sudetenland fanatics. How on earth could I manage to get the words out? I thought about this, and even as I did so I felt the old phrases coming automatically to mind. Just the same old pap they had been listening to for years, that was all it would have to be. And why shouldn’t I be able to do it?\u003c/p\u003e\n\u003cp\u003e“All right,” I said.\u003c/p\u003e\n\u003cp\u003e“Oh, good,” she said, and she turned to look directly into my eyes, and the ice-blue of her own eyes turned suddenly to the hot blue of a gas flame, and all at once she lunged at me and wrapped her arms around me and tumbled me down onto the bed. Her breasts pressed against my chest and her hips bounced merrily and her mouth was hungry.\u003c/p\u003e\n\u003cp\u003eShe’s a Nazi, I kept telling myself. Forget how her mouth tastes, forget how her body feels. Forget she’s a woman. And forget that two and two is four, and that the sky is blue. And-\u003c/p\u003e\n\u003cp\u003eShe drew slowly away from me. “There is no time now,” she said. “No time at all.”\u003c/p\u003e\n\u003cp\u003eI didn’t say anything.\u003c/p\u003e\n\u003cp\u003e“My father will be home any moment now. He is always furious when he catches me with a man. Do you know what he does when he catches me?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“He whips me. Do you know where he whips me?” She picked up one of my hands and touched the appropriate parts of her body. “Here,” she said, “and here, and once even here. Can you imagine?”\u003c/p\u003e\n\u003cp\u003eI couldn’t stop imagining.\u003c/p\u003e\n\u003cp\u003eShe arose reluctantly from the bed; she stepped languorously to the door of the room. “My father will not come to Prague with us,” she said. “We will be alone.”\u003c/p\u003e\n\u003cp\u003eI did not say anything.\u003c/p\u003e\n\u003cp\u003e“You’ll take me to Prague with you, won’t you? Even if I am a woman?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Perhaps especially because I am a woman?”\u003c/p\u003e\n\u003cp\u003e“Perhaps.”\u003c/p\u003e\n\u003cp\u003e“Aryan men and women must labor together to rebuild the Fatherland,” she said. It had the air of a memorized speech. Perhaps I would deliver it to the Bund the next night. “You’re a nice Aryan man. And I’m an Aryan woman. I think we might enjoy… laboring together.”\u003c/p\u003e\n\u003cp\u003e“It might not even seem like labor.”\u003c/p\u003e\n\u003cp\u003eShe giggled. The door opened, and she vanished, and the door closed behind her. I rolled over on the bed and told myself again that she was a Nazi. The thought did not seem to have retained its earlier impact. I tried to invent my speech for the Bund and had worlds of difficulty concentrating on it. I opened the windows and tried to air her scent from the room. It lingered persistently. She had not been wearing perfume; it was the sweet smell of Greta herself that clung to my bedspread.\u003c/p\u003e\n\u003cp\u003eI went into the bathroom and took a cold shower. It didn’t do a damned bit of good.\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003e“So it is settled,” Neumann said at dinner. “You and Greta will go to Prague together.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“And you will speak tomorrow night at our meeting.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I’m sure you will be an inspiration to our membership, Herr Tanner.” He sighed. “You are an activist, you see. And what are we? Passive sympathizers, if the truth be known, and little more than that. We shout out ‘Heil Hitler!’ We pledge ourselves to the cause of Anschluss with Greater Germany. But what is it that we do? We do nothing.”\u003c/p\u003e\n\u003cp\u003e“Papa, that’s not true!”\u003c/p\u003e\n\u003cp\u003eHe turned to her. “Oh? But it is true, my little one.” His little one was a foot and a half taller than he was. “What do we do? We make speeches and listen to others make speeches. We read pamphlets and books. We contribute money when it is needed, but never give so much that we impoverish ourselves. And beneath it all we live our comfortable middle-class lives. We drink our beer and eat our schnitzels and sausages. We vow that we would die for Germany, but you see few of us dying. Lip service, that is all it is.”\u003c/p\u003e\n\u003cp\u003eA word from me seemed called for. “People like you and your daughter,” I said, “are the backbone of our movement.”\u003c/p\u003e\n\u003cp\u003e“You are good to say so.”\u003c/p\u003e\n\u003cp\u003e“It is the truth.”\u003c/p\u003e\n\u003cp\u003e“Perhaps. But how can we be at the backbone, we who have so little in the way of backbone ourselves?” He broke off sharply, pushed his chair back from the table, jumped to his feet. “It shall be different in the future,” he pledged, his back as straight as possible, his chest out and his chin in. “Heil Hitler!” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-canceled-czech-evan-tanner-2/page-6.html","bookId":1531,"creation":"Oct 5, 2019 10:44:28 PM","modification":"Oct 5, 2019 10:44:28 PM"}
