{"id":70233,"no":13,"title":"Page 13","content":"\u003cp\u003eNo more than thirty seconds had passed when David announced his presence to Noelle with a shout so she wouldn\u0027t accidentally shoot him. As he swung the door open, his weapon was pointed at the ceiling and he kept to one side of the doorway to reduce the size of target he made.\u003c/p\u003e\n\u003cp\u003eNoelle was barricaded behind the table with the business end of the borrowed weapon pointed right at his head.\u003c/p\u003e\n\u003cp\u003eSmart girl.\u003c/p\u003e\n\u003cp\u003eDavid couldn\u0027t help but grin at the fierce expression she wore, which made her look like some sort of warrior maiden. She might be a peaceful brainiac, but she wasn\u0027t a coward.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re getting out of here,\" he stated as he pulled her to her feet by one hand, keeping an eye on the doorway.\u003c/p\u003e\n\u003cp\u003eShe stumbled against him, all warm and soft and frightened. Had things been different, he might have just pulled her into his arms and held her for about half a year. But things weren\u0027t different and the gunfire wasn\u0027t slowing down.\u003c/p\u003e\n\u003cp\u003eHe had only thirty-eight seconds left before Monroe would order his men to lay down cover fire.\u003c/p\u003e\n\u003cp\u003eDavid tucked her against his body making sure her head was low against his chest. That way he could shield her by positioning his body between her and the enemy. He took the weapon from her hands and pushed her down into a low crouch as they worked their way toward the rear exit of the old house. By his mental count, they had seven seconds left. David used that time to give Noelle a one-armed hug of comfort.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t let them take me alive,\" she whispered against his neck.\u003c/p\u003e\n\u003cp\u003eDavid knew what she was saying. She\u0027d rather die than be taken by the Swarm. She was braver than he\u0027d thought she would be, considering that she had no training or experience in combat. He respected her for that. There wasn\u0027t time for him to explain that he\u0027d die before he let her get hurt and that it was likely that every other man here would do the same. She was valuable and every man here knew it.\u003c/p\u003e\n\u003cp\u003eBut rather than try to explain that to her, he just gave her another squeeze and said, \"I\u0027m not going to let them take you at all. Come on.\"\u003c/p\u003e\n\u003cp\u003eA loud volley of cover fire began and David urged Noelle forward with his body.\u003c/p\u003e\n\u003cp\u003eDavid still had keys to the Buick, so he tossed them to another agent on his way out, guessing that there would be at least one or two more vehicles leaving at the same time as a diversion.\u003c/p\u003e\n\u003cp\u003eHe pushed Noelle in through the driver\u0027s door of the Bronco and had the vehicle careening down the gravel drive in seconds.\u003c/p\u003e\n\u003cp\u003eBehind him, the intensity of gunfire increased, and two other decoy vehicles were right on his bumper.\u003c/p\u003e\n\u003cp\u003e\"Stay down,\" he ordered, and drove north as if Satan himself were on their trail.\u003c/p\u003e\n\u003cp\u003eCHAPTER NINE\u003c/p\u003e\n\u003cp\u003eThey\u0027d been driving for hours when David finally pulled off the highway. Noelle had no idea where they were and the added cloak of night made her feel vulnerable and edgy.\u003c/p\u003e\n\u003cp\u003e\"Are we close?\" she asked him. They were the first words either one of them had spoken in hours. David had been concentrating on driving, checking the rearview mirror often for bad guys, and Noelle had been content to be quiet and let him do his job.\u003c/p\u003e\n\u003cp\u003eDavid\u0027s eyes flicked back to the mirror for the millionth time. \"A few more miles.\"\u003c/p\u003e\n\u003cp\u003e\"Are we being followed?\"\u003c/p\u003e\n\u003cp\u003eHis big hands tightened around the steering wheel and his jaw muscles bunched in frustration. \"Probably.\"\u003c/p\u003e\n\u003cp\u003eNoelle turned around in her seat and peered into the darkness stretching out behind them. There were a few houses along this stretch of pitted road. Most of them were set way back, hidden by thick stands of frees. This far out, night was somehow thicker and more ominous without the cheerful glow of streetlights to break up the gloom.\u003c/p\u003e\n\u003cp\u003eOf course, that ominous feeling could have been due to the fact that David seemed certain they were being followed no matter how empty the road behind them looked to Noelle.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see anyone,\" she told him.\u003c/p\u003e\n\u003cp\u003e\"Neither do I, but my gut tells me they\u0027re out there, and I\u0027ll trust it over my eyes any day.\"\u003c/p\u003e\n\u003cp\u003eNoelle settled back in her seat so she could watch him without looking like she was. The faint glow from the dashboard lights highlighted the masculine angularity of his features and deepened the weary circles under his eyes.\u003c/p\u003e\n\u003cp\u003eEven though he looked tired, nothing in his motions gave away even a hint of fatigue. Every movement was smooth, confident, controlled.\u003c/p\u003e\n\u003cp\u003eNoelle stifled a yawn and checked the clock. It was after midnight and she felt wrung out. And she\u0027d slept last night\u003c/p\u003e\n\u003cp\u003e—at least a little. As far as she knew, David hadn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"You want me to take over driving for a while?\" she asked.\u003c/p\u003e\n\u003cp\u003eHis eyes slid sideways and settled on her for a moment. Even though his glance was brief, she had the disconcerting feeling that she\u0027d been measured, weighed and inventoried by the time he looked away. \"No, thanks.\u003c/p\u003e\n\u003cp\u003eYon should try to get some sleep if you can. We\u0027ll be there within the hour.\"\u003c/p\u003e\n\u003cp\u003e\"Be where?\"\u003c/p\u003e\n\u003cp\u003e\"Another safe house.\"\u003c/p\u003e\n\u003cp\u003eNoelle rolled her eyes. \"Great. Do you think this safe house will actually be safe?\"\u003c/p\u003e\n\u003cp\u003e\"For a while.\"\u003c/p\u003e\n\u003cp\u003e\"How long is a while? Days? Hours?\"\u003c/p\u003e\n\u003cp\u003e\"Get some sleep and let me worry about that part.\"\u003c/p\u003e\n\u003cp\u003e\"Easier said than done,\" she muttered.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry I can\u0027t give you any guarantees. I wish to hell I could.\"\u003c/p\u003e\n\u003cp\u003eNoelle sighed and leaned her head back against the seat. \"I don\u0027t mean to sound ungrateful for your help, it\u0027s just that this whole thing sucks some serious ass.\"\u003c/p\u003e\n\u003cp\u003eA small grin lifted one side of his mouth. \"I\u0027ll second that.\"\u003c/p\u003e\n\u003cp\u003e\"I mean, there I am, living my nice, quiet little life, perfectly content to be doing so, then suddenly, everything gets blown to hell. I didn\u0027t do anything to deserve this, unless you count being stupid enough to pick up a hobby in cryptology.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe you should consider collecting stamps in the future.\"\u003c/p\u003e\n\u003cp\u003e\"Here\u0027s to hoping that I\u0027ll get the chance.\"\u003c/p\u003e\n\u003cp\u003eHe turned his head and gave her his full attention for just a second. His glacier blue eyes flared with determination.\u003c/p\u003e\n\u003cp\u003e\"You will, Noelle. I\u0027m going to get you through this alive.\"\u003c/p\u003e\n\u003cp\u003eHis focus went back to the road, leaving Noelle feeling jarred. She didn\u0027t know David very well, but one thing was for certain—he meant every word he said.\u003c/p\u003e\n\u003cp\u003eAfter a long, quiet moment, she laid her hand on his shoulder. He flinched so slightly that she wasn\u0027t even sure it happened. Heat from his body sank into her chilled fingers and it was all she could do not to tighten her grip and feel the steely strength of his muscles beneath her palm. \"Thanks,\" she whispered.\u003c/p\u003e\n\u003cp\u003eHis focus remained on the rutted road. \"For what?\"\u003c/p\u003e\n\u003cp\u003e\"Just for being here.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged the shoulder she was still touching, reminding her to move her hand away. \"It\u0027s my job.\"\u003c/p\u003e\n\u003cp\u003e\"Then thanks for showing up at work today.\"\u003c/p\u003e\n\u003cp\u003eThe truck slowed and he turned onto a road that was little more than a gravel trail. Brush scraped the sides of the Bronco, squealing like nails on a chalkboard.\u003c/p\u003e\n\u003cp\u003eDavid turned off the headlights and slowed down to keep the wheels on the road as it was plunged into darkness.\u003c/p\u003e\n\u003cp\u003eNoelle tensed, but remained silent, letting him navigate the big vehicle. In the distance, she could see a thick clump of trees and inside them, the perpendicular lines of a man-made structure.\u003c/p\u003e\n\u003cp\u003eDavid stopped the truck right outside the back door, close enough that there was just room to open the driver\u0027s door without hitting the house.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going inside to check things out,\" he said, unfastening his seat belt and pulling out one of his guns. With expert movements, he checked the weapon, clicked the safety off and surveyed the surrounding area. \"Get behind the wheel, and if you see anyone besides me, drive away as fast as you can.\" He pulled a cell phone out of his jacket pocket along with a crumpled envelope. \"Speed dial one and talk to Colonel Monroe and only Monroe. He\u0027ll tell you where to go.\"\u003c/p\u003e\n\u003cp\u003eNoelle took the phone and envelope, clutching them in shaking hands. \"I\u0027m not going to drive off and leave you here just because I see someone. What if it\u0027s just some kid here to make out with his girlfriend?\"\u003c/p\u003e\n\u003cp\u003e\"It won\u0027t be. And don\u0027t argue with me. If you see anyone, assume they\u0027re here to kill you.\"\u003c/p\u003e\n\u003cp\u003eThe thought made her stomach clench painfully and she tried to shove it aside. \"And what about you?\"\u003c/p\u003e\n\u003cp\u003e\"I can take care of myself.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t leave you here to die.\"\u003c/p\u003e\n\u003cp\u003eHe reached out and cupped her chin in his hand, forcing her to look at him. His fingers were warm and as unyielding as his eyes. \"This is not about me, Noelle. You\u0027re the one they\u0027re after. If you don\u0027t stay alive long enough to crack thatjsode, a lot of innocent people are going to die. I can\u0027t let that happen. So, you\u0027re going to do exactly what I just said and stop arguing before you get us both killed. Do you understand?\"\u003c/p\u003e\n\u003cp\u003eNoelle gave a tiny nod, but it was apparently enough to satisfy David.\u003c/p\u003e\n\u003cp\u003e\"Lock the doors behind me,\" he said as his fingers slid away from her face, releasing her.\u003c/p\u003e\n\u003cp\u003eDavid\u0027s focus shifted abruptly to his surroundings. He slid out of the car and disappeared around the corner of the house and Noelle scrambled into his seat, adjusting it so she could reach the pedals if she needed them.\u003c/p\u003e\n\u003cp\u003eShe prayed that she wouldn\u0027t because she truly wasn\u0027t sure if she was strong enough to leave David here to die while she ran away. Without his presence, she felt exposed. Vulnerable. Her hands gripped the steering wheel until her knuckles ached.\u003c/p\u003e\n\u003cp\u003eMinutes slithered by slowly, forcing her to concentrate on remembering to breathe. Her body was shaking and breaking out into a cold sweat as she stared wide-eyed into the darkness.\u003c/p\u003e\n\u003cp\u003eWhere the hell was he? Why was this taking so long?\u003c/p\u003e\n\u003cp\u003eNoelle strained to hear over the sound of the idling engine. She even cracked open the window, but heard only the wind singing through the nearly bare trees.\u003c/p\u003e\n\u003cp\u003eAfter what felt like half of forever, David reappeared inside the house, opening the back door for her.\u003c/p\u003e\n\u003cp\u003eRelief swamped Noelle, and she smiled at him even as her body urged her to crumple under the strain. Or run into his arms and hug him.\u003c/p\u003e\n\u003cp\u003eHe motioned for her to come inside, and Noelle gladly turned off the engine, pocketed the keys and hurried back to David\u0027s side, where she felt at least some small measure of safety.\u003c/p\u003e\n\u003cp\u003eDavid shut and locked the door behind her, casting them into blackness. Noelle instinctively reached out toward him, collided with the hard, warm flesh of his arm, and wrapped her hands around it. She didn\u0027t care that it wasn\u0027t proper for her to be groping at him. All she cared about was knowing he was still right there with her.\u003c/p\u003e\n\u003cp\u003e\"Easy,\" he said in a low, quiet voice. \"I\u0027m not going anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"Then you won\u0027t mind if I just hold on, will you?\"\u003c/p\u003e\n\u003cp\u003eHe gave an amused grunt. \"I\u0027m going to give you a flashlight, but you need to make sure you keep the beam away from the windows, okay? There are blinds on the windows, but if your beam hits them, it will show through to the outside.\"\u003c/p\u003e\n\u003cp\u003e\"Got it.\"\u003c/p\u003e\n\u003cp\u003eHe peeled one of her hands away from his arm \"and guided her fingers around the slim body of a penlight. His fingers showed her where the switch was, and when it was safely pointed toward the floor, he slid the switch on. A faint stream of light pooled on the vinyl floor, seeming bright in the relative darkness.\u003c/p\u003e\n\u003cp\u003eDavid pulled his hands away from hers and took a step backward. \"I\u0027ve got some work to do to make sure this place stays safe. I want you to get some sleep if you can. Use the couch in the next room.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/no-regrets-delta-force-1/page-13.html","bookId":2374,"creation":"Oct 5, 2019 10:16:09 AM","modification":"Oct 5, 2019 10:16:09 AM"}
