{"id":70254,"no":34,"title":"Page 34","content":"\u003cp\u003eThat thought made David remember just how tight and slick she\u0027d been when he\u0027d taken her last night against the tree. He cleared his throat and focused on the conversation before he became physically uncomfortable. \"Maybe you should get a variety, just in case.\"\u003c/p\u003e\n\u003cp\u003e\"I can do that.\"\u003c/p\u003e\n\u003cp\u003e\"And some condoms.\"\u003c/p\u003e\n\u003cp\u003eCaleb did smile now. \"Do you want those in size small, too?\"\u003c/p\u003e\n\u003cp\u003eDavid shook his head. \"Fuck you, Stone.\"\u003c/p\u003e\n\u003cp\u003e\"Not even on your best day.\"\u003c/p\u003e\n\u003cp\u003eNoelle closed her laptop and straightened the chaotic pile of notes on the scarred table. It was after dark, and she could hear men\u0027s voices out on the porch, joking and laughing together. She could pick out David\u0027s voice, and every time he laughed, it made her smile.\u003c/p\u003e\n\u003cp\u003eIt was a wonderful sound. One that she wasn\u0027t going to be able to hear for much longer. She was nearly done. A few more lines of code to debug, and she was sure her program would work.\u003c/p\u003e\n\u003cp\u003eAfter that, she knew David would take her back to Monroe and he\u0027d go back to his life without her.\u003c/p\u003e\n\u003cp\u003eIt was a bleak thought and one that she refused to dwell on right now. She had too much responsibility to let any part of her brain be occupied by borrowed trouble. David was still here and she would use what little time she had to make plenty of memories she could keep with her even after he was gone.\u003c/p\u003e\n\u003cp\u003eShe poured four mugs of coffee and carried them outside, using an old cutting board as a tray.\u003c/p\u003e\n\u003cp\u003eAs she pushed through the door, the men fell silent and all six eyes were on her. \"What?\" she demanded, squirming under all that masculine attention.\u003c/p\u003e\n\u003cp\u003e\"We just didn\u0027t expect to see you detach yourself from your work,\" said Grant.\u003c/p\u003e\n\u003cp\u003eDavid stood and took the mugs from her, handing them out. \"Everything okay? Are you stuck again?\"\u003c/p\u003e\n\u003cp\u003eNoelle shook her head. \"I\u0027m just at a sensitive point and if I start wading through my code without a clear head, I\u0027ll end up doing more damage than good. I\u0027ll start again in the morning when my mind is fresh.\"\u003c/p\u003e\n\u003cp\u003eDavid sipped his coffee, staring at her over the rim of his mug. \"That sounds suspiciously like you\u0027re planning on actually going to sleep tonight. And not at the table, either,\"\u003c/p\u003e\n\u003cp\u003eNoelle offered him a shy smile. What was it about the way he looked at her that made her go all syrupy inside? \"I thought I\u0027d give the sleeping bag another try. I\u0027m less likely to fall off it than I am the stool.\"\u003c/p\u003e\n\u003cp\u003eOut of the corner of her eye, she saw Caleb nudge Grant with one thick arm. \"We should get going,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Uh, yeah,\" stammered Grant. \"We\u0027ve got a lot to do tonight. You know, building a fire and ... stuff.\"\u003c/p\u003e\n\u003cp\u003eCaleb shook his head at Grant\u0027s fumbled he and finished off his coffee. \"Night, Captain. Noelle.\"\u003c/p\u003e\n\u003cp\u003eGrant set his mug on the porch and followed Caleb back into the tree line, where they had camped last night.\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t they stay in the cabin with us? They\u0027ve got to be freezing out there.\"\u003c/p\u003e\n\u003cp\u003eDavid stood and offered her his hand. \"I promise you they don\u0027t even feel chilly. We\u0027ve been cold before, and this isn\u0027t close. Besides, they don\u0027t want to intrude on us.\"\u003c/p\u003e\n\u003cp\u003eNoelle\u0027s cheeks warmed. \"Oh.\"\u003c/p\u003e\n\u003cp\u003e\"But if it will make you feel better, I\u0027ll go get them and order them to sleep inside. They won\u0027t like it, but they\u0027ll do it.\"\u003c/p\u003e\n\u003cp\u003e\"Uh, no. That\u0027s okay.\"\u003c/p\u003e\n\u003cp\u003eHe was staring down at her, his blue eyes dark in the dim light of the porch. Only the soft glow from the lantern inside lit the space. He still held her hand, and he was standing close enough to her that she could smell his skin. He was just watching her, waiting for her to do something.\u003c/p\u003e\n\u003cp\u003eIf she were a seductress, this is where she\u0027d say something sexy and pull him in for a kiss. But she wasn\u0027t and she didn\u0027t really know how to tell him that she wanted to be with him again before they parted ways. She thought that he still wanted her. He was looking at her with hungry eyes, and he wasn\u0027t moving away. But he wasn\u0027t moving closer, either.\u003c/p\u003e\n\u003cp\u003eHe was letting her make the next move. If this had been chess, she\u0027d already have him naked, sliding inside her.\u003c/p\u003e\n\u003cp\u003eCheckmate. But this wasn\u0027t something she knew, and her insecurity was driving her batty.\u003c/p\u003e\n\u003cp\u003eNoelle refused to be shy or girly about this. She knew what she wanted, and even if she wasn\u0027t sure how to go about taking it, she would at least let him know what she wanted so there would be no question. \"David,\" she began, then faltered.\u003c/p\u003e\n\u003cp\u003e\"Yes, honey?\"\u003c/p\u003e\n\u003cp\u003eThe sweet endearment made her shiver with warmth and gave her courage. \"If you\u0027re not too busy and if you wouldn\u0027t mind terribly, I think I\u0027d like it if we could go back into the cabin and make love.\"\u003c/p\u003e\n\u003cp\u003eA masculine smile curved his lips and Noelle found herself staring at them. Wanting. \"I don\u0027t suppose I\u0027m too busy right at the moment.\"\u003c/p\u003e\n\u003cp\u003e\"No?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head slowly. \"And as far as minding terribly, well, you tell me.\" He pressed her palm along the ridge in his jeans, the hard, unmistakable proof that he wanted her.\u003c/p\u003e\n\u003cp\u003eNoelle\u0027s insecurity vanished. He wanted her. And she wanted him. She wrapped her arms around his neck, rose up onto her toes and kissed him. His lips were warm and firm and he tasted of sweet coffee.\u003c/p\u003e\n\u003cp\u003eHis hands slid around her waist, gripping her, holding her close. She could feel his erection hard against her soft belly and it made her insides liquefy.\u003c/p\u003e\n\u003cp\u003eHer tongue played along the slick inside of his bottom lip, her teeth grabbing gently and tugging on his mouth.\u003c/p\u003e\n\u003cp\u003eDavid groaned and cradled her head so he could kiss her more deeply. Noelle\u0027s head swam with sensation and she just let herself float in the midst of it. Nothing else mattered right now except David—his mouth on hers, his body pressed firm and hot against her.\u003c/p\u003e\n\u003cp\u003eSuddenly, he pulled away his eyes dark and hot on her mouth. His hands flexed, one against her scalp, the other along her hip. \"Are you sure about this?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never been more sure of anything in my life. I need you David. Want you.\"\u003c/p\u003e\n\u003cp\u003eHis nostrils flared as if pulling in her scent and his jaw bunched with tension. \"God, I love hearing you say that.\"\u003c/p\u003e\n\u003cp\u003eShe offered him a smile of feminine approval. \"Let\u0027s go inside.\"\u003c/p\u003e\n\u003cp\u003eNoelle took his hand and led him through the door. David watched her as he stripped out of his jacket and vest, then continued undressing. Noelle watched with complete attention as he shed his boots, socks, jeans and shirt. He stood before her completely naked and aroused, completely immodest. His chest was covered with a dark swath of hair that narrowed as it led down his body. In the dim light, the muscles in his arms and legs were accentuated with deep shadows, making her fingers itch to slide over the masculine contours. His penis jutted out from a nest of dark hair, pointing proudly toward the ceiling, its tip glistening in anticipation.\u003c/p\u003e\n\u003cp\u003eNoelle\u0027s mouth watered at the sight of him.\u003c/p\u003e\n\u003cp\u003eDavid\u0027s voice was low and rough with arousal. \"Look your fill, because as soon as I get you naked, we\u0027ll be pressed too close together for you to see anything.\"\u003c/p\u003e\n\u003cp\u003eHe reached for her, but Noelle stepped back, dodging his hand. \"Let me,\" she said, wanting to give him the same thrilling show he\u0027d just given her. \"I\u0027m no professional stripper, but you\u0027ll have to forgive my lack of experience.\"\u003c/p\u003e\n\u003cp\u003eA low rumble of approval sounded from his throat and his eyes fastened on her fingers, which were opening the buttons of the flannel shirt she\u0027d borrowed from him to keep warm.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take enthusiasm over experience any day.\"\u003c/p\u003e\n\u003cp\u003eShe shed her layers of clothing, her hands shaking with excitement. Never once did David\u0027s eyes move away from her. He stood there, his feet braced apart, his hands fisted at his sides as if he was trying to keep himself from reaching for her. As she watched him, his body tensed, his erection twitched and Noelle stared in amazement.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s enough of a show,\" rasped David as he closed the distance between them and pulled her mostly nude body into his arms. Only her panties and socks remained, and when their bodies met, the silky brush of his body hair against her skin lit every one of her nerves on fire. His heat enveloped her, making her feel boneless, melting.\u003c/p\u003e\n\u003cp\u003e\"Kiss me,\" she demanded, and he obeyed with a triumphant smile.\u003c/p\u003e\n\u003cp\u003eNoelle opened her mouth to his passionate onslaught, sighing as she tasted him once again. His arms were hot bands around her body, holding her upright in spite of her wobbly legs. The world tilted and Noelle relaxed, trusting David to carry her safely down to the cushion of the sleeping bags laid out on the floor.\u003c/p\u003e\n\u003cp\u003eThe air was cold, but it didn\u0027t chill her, not while she was being held in the furnace of David\u0027s body heat. With the slippery sleeping bag at her back and David lying atop her, blanketing her body with his own, Noelle felt utterly safe and protected and wanted. It was a heady combination, one she relished with every bit of conscious thought that remained.\u003c/p\u003e\n\u003cp\u003eHer body thrummed, vibrating wherever his hands stroked. Noelle wanted to slow down so she could savor every moment, but her body had other plans. She ached with emptiness, knowing the only thing that could ease that ache was David. She shifted her legs, parting them in eagerness, but David didn\u0027t take the hint. He moved to her side, pulling away from her mouth with an audible kiss. \"I want to watch you this time,\" he said.\u003c/p\u003e\n\u003cp\u003eNoelle had no idea what he meant. He always watched her. She cursed her lack of experience but refused to give up the heat building between them. She reached for him, trying to pull him back atop her, but, he didn\u0027t budge.\u003c/p\u003e\n\u003cp\u003e\"Like this,\" he said, and shifted her body until she was straddling his thighs.\u003c/p\u003e\n\u003cp\u003eNoelle looked down at the marvelous expanse of man beneath her. He was laid out like a sacrifice, and Noelle wanted nothing more than to take what he offered. But instead, she held still, forcing herself to slow down. This was probably the last time they\u0027d ever make love, and she wanted it to last.\u003c/p\u003e\n\u003cp\u003eThe hair on his legs tickled the sensitive insides of her thighs, which were spread wide to reach either side of his body. She splayed her fingers over his ribs and leaned forward to reach his mouth. She wasn\u0027t quite tall enough to reach, so she settled for kissing his neck instead. Bis penis pressed hot and hard against her stomach, and the contact made David moan. Noelle\u0027s tongue swept out to taste his skin, dipping into the hollow of his throat in a wet kiss. She felt the sinuous length of the thin gold chain around his neck, but she didn\u0027t let herself think about why it was there.\u003c/p\u003e\n\u003cp\u003e\"Mmmm.\" She made a humming noise, enjoying the salty taste of aroused man. \"Do you taste this good all over?\"\u003c/p\u003e\n\u003cp\u003eShe felt him tense and reveled in the knowledge of her feminine power. Her lips trailed over one thick shoulder and she sank her teeth delicately in the hard pad of muscle.\u003c/p\u003e\n\u003cp\u003eDavid hissed, and Noelle gave a dark smile against his shoulder. \"You liked that.\"\u003c/p\u003e\n\u003cp\u003e\"God, woman! You\u0027re driving me out of my mind.\"\u003c/p\u003e\n\u003cp\u003e\"Want me to stop?\"\u003c/p\u003e\n\u003cp\u003e\"Hell, no.\"\u003c/p\u003e\n\u003cp\u003e\"Then you don\u0027t mind if I enjoy you? Explore you?\"\u003c/p\u003e\n\u003cp\u003eShe felt his chest move in a low chuckle. \"I\u0027ve never known a man who died from lust, but if I do, at least I\u0027ll die happy.\"\u003c/p\u003e\n\u003cp\u003eNoelle took that as consent and let her hands and mouth wander over his chest, down his abdomen. She loved the texture of his hair and the smooth heat of his skin beneath. He smelled like the forest at sunset, beautiful and wild and clean. The hardness of his body intrigued her as much as it excited her. She\u0027d never known what such power felt like until his steely strength was flexed under her palms. \u003c/p\u003e","sourceLink":"https://allnovel.net/no-regrets-delta-force-1/page-34.html","bookId":2374,"creation":"Oct 5, 2019 10:16:09 AM","modification":"Oct 5, 2019 10:16:09 AM"}
