{"id":70258,"no":38,"title":"Page 38","content":"\u003cp\u003e\"If they\u0027d killed her, they would have left her here and just taken her work. I\u0027m sure they took her out alive.\"\u003c/p\u003e\n\u003cp\u003eAlive. Thank God.\u003c/p\u003e\n\u003cp\u003e\"Noelle saved you when you got hit. She used her shirt to tie off your wound. She\u0027s one heck of a smart lady. If she hadn\u0027t stopped the bleeding, you\u0027d be in bad shape by now.\"\u003c/p\u003e\n\u003cp\u003eDavid cursed. \"Smart enough that she had to get tangled up in this mess to begin with. Maybe it\u0027s better to be stupid.\"\u003c/p\u003e\n\u003cp\u003eAcross the cabin, Grant was on the phone, speaking in quiet tones.\u003c/p\u003e\n\u003cp\u003eCaleb crouched, squeezing his bulk into a fairly small package. David noticed there was blood on Caleb\u0027s clothes.\u003c/p\u003e\n\u003cp\u003eLots of blood. It was smeared all over him in splotchy patches, some that were already drying. \"Did you get wounded?\" asked David.\u003c/p\u003e\n\u003cp\u003eCaleb\u0027s jaw tightened. \"It\u0027s not my blood.\"\u003c/p\u003e\n\u003cp\u003eThank God.\u003c/p\u003e\n\u003cp\u003e\"Did you see or hear anything that might tell us where they\u0027ve taken her?\" asked Caleb.\u003c/p\u003e\n\u003cp\u003eDavid concentrated on remembering what happened. It was hard to push aside his grinding emotional response to Noelle\u0027s danger—his fear for her, his guilt that he\u0027d let this happen. She was so vulnerable, and if the Swarm did to her what they did to Mary ...\u003c/p\u003e\n\u003cp\u003e\"Focus, Wolfe,\" barked Caleb, giving David a little shake of his shoulders. \"You\u0027ve got to pull it together.\"\u003c/p\u003e\n\u003cp\u003eDavid knew Caleb was right. If he didn\u0027t start thinking with his head instead of his heart, Noelle didn\u0027t have a chance.\u003c/p\u003e\n\u003cp\u003eDavid pulled in a deep breath and tried to recaffthe last thing he could remember. \"I was talking to Monroe about getting some more information. Noelle figured out what the text said, but it was incomplete.\"\u003c/p\u003e\n\u003cp\u003e\"Grant\u0027s on the phone with Monroe right now. Do you remember anything else?\"\u003c/p\u003e\n\u003cp\u003eDavid felt something swirling in his memory. A kiss, so sweet it nearly brought tears to his eyes. Noelle had kissed him before she\u0027d been taken.\u003c/p\u003e\n\u003cp\u003eAnd she\u0027d said something—something about the first time they made love ...\u003c/p\u003e\n\u003cp\u003eDavid uttered an acidic curse. How could he have let this happen? How could he have let them take her?\u003c/p\u003e\n\u003cp\u003eCaleb\u0027s strong hand settled on David\u0027s shoulder in a comforting grip. \"I know you\u0027re hurting now, but she needs you. You\u0027ve got to think. What was she doing while you were talking to Monroe?\"\u003c/p\u003e\n\u003cp\u003eDavid\u0027s head throbbed harder as he tried to remember. \"She said something about needing the coordinates of where they\u0027d found the text. She thought it might be the missing info. Monroe had just given them to me so I told Monroe to hold on and gave her the coordinates ...\"\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"And she typed them in and...\" David could see the look of triumph on her face, the way she smiled at him so happy it made his heart sing.\u003c/p\u003e\n\u003cp\u003e\"She ran the program and brought up the coordinates on her screen.\"\u003c/p\u003e\n\u003cp\u003e\"Do you remember the coordinates?\"\u003c/p\u003e\n\u003cp\u003eDavid shook his head as frustration burst through him. \"We\u0027ve got to figure it out before they do. I\u0027m sure that\u0027s got to be where they\u0027re taking her. They won\u0027t kill her until they have the weapons and know they\u0027re done using her. We have to get there first and ambush them.\"\u003c/p\u003e\n\u003cp\u003e\"How are we going to figure out where to go?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" spat David. \"Her work is gone. She\u0027s gone!\"\u003c/p\u003e\n\u003cp\u003eCaleb turned to Grant. \"How long before our ride arrives?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re closing in now,\" said Grant. \"I\u0027ve got the helo pilot on the phone. I\u0027m going to go outside and guide him in.\"\u003c/p\u003e\n\u003cp\u003eDavid rose to his feet, being cautious so he wouldn\u0027t pass out again. Noelle needed him, and he had to do everything in his power to make sure he was able to help her.\u003c/p\u003e\n\u003cp\u003eInside his shirt, he felt something slide down along his chest. He reached inside and pulled out a shiny disk smudged with two small, bloody fingerprints. Noelle\u0027s.\u003c/p\u003e\n\u003cp\u003eA spark of hope lit deep in David\u0027s heart.\u003c/p\u003e\n\u003cp\u003e\"Is that what I think it is?\" asked Caleb.\u003c/p\u003e\n\u003cp\u003eDavid nodded and a feral smile touched his mouth. He was going to find her. \"I don\u0027t know how she managed to pull it off, but I\u0027m damn glad she did.\"\u003c/p\u003e\n\u003cp\u003eOutside, David could hear the faint thrumming of a helicopter flying closer.\u003c/p\u003e\n\u003cp\u003eDavid grabbed his weapon and his duffel bag and stepped out onto the porch, ignoring his pain, silently urging the pilot to hurry the hell up.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-SIX\u003c/p\u003e\n\u003cp\u003eNoelle woke up on some sort of military aircraft. The hard metal plates under her feet vibrated with the roar of the jet engines. Her ankles were tied to the frame of the seat she occupied. A harness-style seat belt was pulled snug against her torso and her wrists were tied together with flexible plastic handcuffs.\u003c/p\u003e\n\u003cp\u003eHer head felt like it was going to fly apart and her mouth tasted like it had been cleaned out with dead rat carcasses.\u003c/p\u003e\n\u003cp\u003eShe recognized this feeling—the aftereffects of the tranquilizer they\u0027d shot her with—but this time it was different.\u003c/p\u003e\n\u003cp\u003eDavid wasn\u0027t here to take care of her.\u003c/p\u003e\n\u003cp\u003eNoelle stifled her tears as she remembered David lying on the floor of the cabin, bleeding. Was he here? Was he still alive?\u003c/p\u003e\n\u003cp\u003eNeeding to know, Noelle cracked her eyelids a little . wider, gritting her teeth against the painful effects of the dim light filling the aircraft. For a moment, she would have welcomed her head actually exploding it hurt so much. She shut her eyes again and concentrated on not throwing up.\u003c/p\u003e\n\u003cp\u003eSlowly, the pain subsided to merely excruciating, and she tried again to look around her.\u003c/p\u003e\n\u003cp\u003eThe plane was about twenty feet wide, filled with crates and electronic equipment, and she could only guess about their function. There were half a dozen men wearing black military clothing, but without any flags or symbols to give away their loyalties. They spoke in quiet voices she couldn\u0027t hear over the roar of the jet engines, so language was no help.\u003c/p\u003e\n\u003cp\u003eAll she knew was that David was nowhere in sight, which meant she was on her own.\u003c/p\u003e\n\u003cp\u003eOne of the men turned and saw she was awake. He was tall and blond and would have been handsome if not for the horrific burn scar that claimed half of his face.\u003c/p\u003e\n\u003cp\u003eHe took a bottle of water from a compartment and came to stand beside her.\u003c/p\u003e\n\u003cp\u003e\"Are you thirsty?\" he asked in an accent that belonged somewhere in Wisconsin.\u003c/p\u003e\n\u003cp\u003eNoelle looked at the water bottle, which was still sealed. She nodded.\u003c/p\u003e\n\u003cp\u003eThe man opened the bottle and held it to her mouth so she could drink.\u003c/p\u003e\n\u003cp\u003eHe flipped open a small box he\u0027d taken from his pocket and dumped out a couple of pills. \"These will help with the headache.\"\u003c/p\u003e\n\u003cp\u003eNoelle turned her head, refusing the pills. She didn\u0027t trust these men, and she wasn\u0027t about to make it easy for them to kill her.\u003c/p\u003e\n\u003cp\u003eHe gave a low, amused chuckle. \"Suit yourself.\"\u003c/p\u003e\n\u003cp\u003e\"Who are you?\"\u003c/p\u003e\n\u003cp\u003e\"You can call me Owen. We\u0027ll be spending a lot of time together, you and I.\"\u003c/p\u003e\n\u003cp\u003eSomething in the way he said it made the hair on the back of Noelle\u0027s neck stand on end. \"What do you want with me?\" she croaked, making her throat feel like it was going to split open.\u003c/p\u003e\n\u003cp\u003e\"What a foolish question from such an intelligent woman.\" He capped the water bottle and shoved it into the space between her thigh and the side of the seat.\u003c/p\u003e\n\u003cp\u003eHe placed one hand on each arm of her seat and leaned down so she could see directly into his pale green eyes.\u003c/p\u003e\n\u003cp\u003eThere was no warmth there, no compassion. Only greed.\u003c/p\u003e\n\u003cp\u003eIt was then that Noelle realized she was a dead woman. Maybe not yet, but as soon as they had what they wanted from her, he\u0027d dispose of her without remorse.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to tell us what the Russian text said, and you\u0027re going to do it now.\"\u003c/p\u003e\n\u003cp\u003eNoelle\u0027s only chance was to stall them. As soon as David found the disk, he\u0027d figure out how to find her. He\u0027d find a way to stop these madmen. She was sure of it. \"I don\u0027t know if I can. There was a power surge and my laptop started throwing off sparks. Have you checked to see if it\u0027s still working?\"\u003c/p\u003e\n\u003cp\u003eHe slapped her hard across the face. Noelle was so shocked it took her a minute before she even realized what had happened. The blow was hard enough that she could already feel her cheek swelling and taste the blood from her split lip.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think you fully grasp the magnitude of your situation, Dr. Blanche.\" He grabbed the back of her hair and jerked her head so she was staring straight up at him. The ugly scar on his face had darkened to an angry red. \"We know everything about you. We know who your friends are. We have men watching your family. Do you really want them to suffer for your stubbornness?\"\u003c/p\u003e\n\u003cp\u003eHer sister Lilly\u0027s face crystallized in Noelle\u0027s mind, and she couldn\u0027t help the tears that slid silently down her cheeks. \"I can\u0027t.\" She didn\u0027t explain that she couldn\u0027t risk the lives of others so that one person could live. Not even her beloved sister. Lilly had been raised the same way—never compromise your principles, no matter what. They\u0027d both been taught that at their father\u0027s knee. They both knew the responsibility they carried because they were smart.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see,\" he said, and turned to retrieve a metal box that looked like a toolbox. From inside the box he pulled a syringe and a vial full of liquid.\u003c/p\u003e\n\u003cp\u003eNoelle trembled, unable to fight back the terror that swelled in her chest. What the hell was that stuff and what was it going to do to her?\u003c/p\u003e\n\u003cp\u003eHe filled the syringe and casually injected it into her arm without worrying about disinfectant. It was just one more sign that they didn\u0027t care if she lived long-term.\u003c/p\u003e\n\u003cp\u003eHeat flew along her veins, making her shiver. After a few seconds, the plane seemed to swell and shrink repeatedly, throbbing with each beat of her heart. For some reason, that didn\u0027t seem strange.\u003c/p\u003e\n\u003cp\u003eThe man stared at her, and then shined a small light into each of her eyes. \"Don\u0027t worry,\" he said, his voice oily with a mockery of compassion. He stroked her hair with a gentle sweep of his hand. \"It won\u0027t be long now.\"\u003c/p\u003e\n\u003cp\u003eDavid was nearly insane with impotent rage and frustration. He paced the room while the tech-heads worked to break the password protection on the disk Noelle had given him.\u003c/p\u003e\n\u003cp\u003eGeneral Monroe watched him from the corner. Grant and Caleb had their heads bent together in a quiet conversation over a map on the other side of the sterile white room.\u003c/p\u003e\n\u003cp\u003eThis small government-contracted lab was the closest place they could go with any sort of technical support— the only place nearby where they might be able to figure out where Noelle had been taken. Specialists were flying in to help, but they wouldn\u0027t be here for several more hours.\u003c/p\u003e\n\u003cp\u003eThe white room was littered with wires and the entrails of open computer cases. Fluorescent lights hummed overhead while the muted clicking of keyboard strokes filled one side of the space. Three young men were frantically working to get to the information on that disk.\u003c/p\u003e\n\u003cp\u003eDavid wanted to put a gun to their heads to help encourage them to work faster, but he resisted the urge. Barely.\u003c/p\u003e\n\u003cp\u003eMonroe pushed to his feet, using a cane to help him balance. He\u0027d taken a bullet to the leg during the firefight at the safe house, and although he would recover, he was getting old enough that he no longer bounced back like he used to.\u003c/p\u003e\n\u003cp\u003eHe looked tired. Old.\u003c/p\u003e\n\u003cp\u003e\"Have you thought of anything, Captain?\" asked Monroe.\u003c/p\u003e\n\u003cp\u003eDavid scrubbed at his face with his hand, trying to rid his eyes of the grit of fatigue. He\u0027d had enough coffee to burn a hole in his stomach, but it didn\u0027t help. \"There\u0027s something she said right before she left, but I don\u0027t remember what it was.\"\u003c/p\u003e\n\u003cp\u003e\"What do you remember?\"\u003c/p\u003e\n\u003cp\u003eDavid shoved some cables aside and leaned against the edge of a workbench lined with a blue electrostatic discharge protective coating. \"It\u0027s, uh, personal, sir.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/no-regrets-delta-force-1/page-38.html","bookId":2374,"creation":"Oct 5, 2019 10:16:09 AM","modification":"Oct 5, 2019 10:16:09 AM"}
