{"id":91513,"no":18,"title":"Page 18","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt’s what I do, he reminded her silently.\u003c/p\u003e\n\u003cp\u003eEspecially where there was such an abundance of colors. And since they weren’t deep, the sunlight penetrated beautifully. He had shot and filmed in so many exotic places. And yet, his own backyard offered some of the most enchanting underwater locations around.\u003c/p\u003e\n\u003cp\u003eHe saw something in the sand and headed down, touching the granules to find a little ray nestled there, happy to move, even sit in his hand and puff as Katie joined him. He shot the little ray, and Katie’s finger just brushed a wing. But then her attention was diverted.\u003c/p\u003e\n\u003cp\u003eAnd it was while they were there, kneeling in the sand at about forty feet, that Katie suddenly made one of her startling and frightening changes again.\u003c/p\u003e\n\u003cp\u003eShe was touching the little ray…\u003c/p\u003e\n\u003cp\u003eThen she was frozen.\u003c/p\u003e\n\u003cp\u003eStaring wide-eyed.\u003c/p\u003e\n\u003cp\u003eAnd she wasn’t breathing. No bubbles were escaping from her regulator.\u003c/p\u003e\n\u003cp\u003eHe dropped his camera and the ray and gripped her shoulder. Her eyes met his. He couldn’t begin to understand what he was seeing in them. And those eyes of hers, framed and huge behind the lenses of her mask…\u003c/p\u003e\n\u003cp\u003eShe didn’t appear to be afraid of him.\u003c/p\u003e\n\u003cp\u003eIn fact…\u003c/p\u003e\n\u003cp\u003eShe wasn’t afraid at all.\u003c/p\u003e\n\u003cp\u003eShe suddenly looked as if she were about to cry.\u003c/p\u003e\n\u003cp\u003eHe tapped her chest. She inhaled; her bubbles began again.\u003c/p\u003e\n\u003cp\u003eHe signaled that they go topside. She shook her head, but he was firm. She lowered her head, and then she nodded.\u003c/p\u003e\n\u003cp\u003eHe crawled up the stern ladder first, doffing his flippers and then, once up, his tank. She removed her flippers and threw them over and he reached to help her up with the weight of her tank. She stripped off her dive skin and accepted the bottle of water he gave her. He studied her, and waited for her to speak.\u003c/p\u003e\n\u003cp\u003eShe sat in the cushioned seat behind the helm and said nothing.\u003c/p\u003e\n\u003cp\u003e“Katie.”\u003c/p\u003e\n\u003cp\u003e“Hmm?” She looked at him and smiled.\u003c/p\u003e\n\u003cp\u003e“Katie, what the hell is going on with you?” he asked.\u003c/p\u003e\n\u003cp\u003eShe looked out at the water. She started to speak, hesitated, then didn’t. Then she looked at him. “Do you…do you believe in dreams, or hunches, or…I don’t know, the mind trying to tell us things that maybe we just can’t really understand logically?”\u003c/p\u003e\n\u003cp\u003eLike seeing an image in the sea of Tanya trying to communicate?\u003c/p\u003e\n\u003cp\u003eHe shook his head. “Katie…no. Not really.”\u003c/p\u003e\n\u003cp\u003e“Experts know that our dreams reflect our lives,” she said defensively.\u003c/p\u003e\n\u003cp\u003e“I’m lost, Katie. What are you talking about?”\u003c/p\u003e\n\u003cp\u003eHe didn’t want to be lost. Her hair was tousled and soaked and flying around her head, and she was just curled on the cushion, staring off. She was still beautiful. He wanted to reach out, touch her, tell her that whatever it was, it was okay.\u003c/p\u003e\n\u003cp\u003eHer legs were endless, muscled and lean, her breasts were full against the bathing-suit top. She had a belly-button ring, a little dangling silver dolphin, and it made her belly seem like the most desirable stretch of bronzed flesh ever imagined…\u003c/p\u003e\n\u003cp\u003e“I just had a dream last night, that’s all,” she said.\u003c/p\u003e\n\u003cp\u003e“Good dream, bad dream?” he asked her.\u003c/p\u003e\n\u003cp\u003e“Good dream.”\u003c/p\u003e\n\u003cp\u003e“Are you going to tell me about it?” he asked. It wouldn’t explain what had happened in the water, but it might lead to an explanation.\u003c/p\u003e\n\u003cp\u003e“I don’t want you to laugh at me-or hate me,” she turned her gaze from the sea to stare at him.\u003c/p\u003e\n\u003cp\u003e“All right. I swear, I won’t laugh at you. And,” he added, hearing his own voice grow huskier, “I won’t hate you.”\u003c/p\u003e\n\u003cp\u003eShe spoke quickly, suddenly. “I dreamed about Tanya.”\u003c/p\u003e\n\u003cp\u003eHe started to move; the words made him want to bolt, no matter what he had said.\u003c/p\u003e\n\u003cp\u003e“It was a good dream,” Katie said. Her hand fell on his knee.\u003c/p\u003e\n\u003cp\u003eHis knee had never felt so naked. Nor had he had ever known that a kneecap could suddenly be such an erogenous zone.\u003c/p\u003e\n\u003cp\u003e“Tell me,” he said. His voice was tight.\u003c/p\u003e\n\u003cp\u003e“She didn’t know who had killed her in the dream. She did know that you didn’t do it.”\u003c/p\u003e\n\u003cp\u003e“Great. We can put that in the newspaper.”\u003c/p\u003e\n\u003cp\u003eShe flushed. She looked as if she would have walked away from him-if she could have walked away.\u003c/p\u003e\n\u003cp\u003e“Look, I’m sorry,” he said. “I just don’t really believe in that kind of thing. I mean, maybe dreams are a reflection of our lives. You don’t want me to be guilty, and since I swear to God I’m not, I’m grateful that you feel that way. But…” He leaned toward her. A mistake. She still smelled faintly of her intoxicating cologne, even though she was drenched in salt water. She seemed to emit an aura of warmth that lured him closer, or made him want to drown in touching her.\u003c/p\u003e\n\u003cp\u003eHe eased back. “Katie, last night was scary. And freezing like that when you’re diving, well, that’s damned scary. Why did you freeze in the water?”\u003c/p\u003e\n\u003cp\u003eShe looked away again and chewed on a thumbnail. She shook her head. “It won’t happen again,” she told him.\u003c/p\u003e\n\u003cp\u003e“Katie-”\u003c/p\u003e\n\u003cp\u003e“Sorry. I believe in dreams. And it’s nice. She loved you-in my dream. She knows that you’re innocent-in my dream.”\u003c/p\u003e\n\u003cp\u003e“She’s dead,” he said bluntly.\u003c/p\u003e\n\u003cp\u003e“Yes, she is. But I dreamed about her.” She inhaled. “And then I saw her in the water. Not in a bad way. She’s trying to help.”\u003c/p\u003e\n\u003cp\u003e“What?” David said sharply. What was this? Was she taunting him somehow? Torturing him. Foolish, it was long ago. His heart had hardened.\u003c/p\u003e\n\u003cp\u003eNot enough, maybe.\u003c/p\u003e\n\u003cp\u003eShe wasn’t taunting him. Maybe it was worse. Maybe she was just crazy. He didn’t want her to be crazy. He cared about her…far too quickly, and far too deeply. He needed to remain rational.\u003c/p\u003e\n\u003cp\u003e“Katie, I am a big believer in the power of suggestion. And with everything going on…”\u003c/p\u003e\n\u003cp\u003eHe let his voice trail with its own logical suggestion.\u003c/p\u003e\n\u003cp\u003e“Yes, that’s it, of course. It’s nice, though, that this kind of power of suggestion is a good one-the images I’m seeing in my crazy little suggestible mind seem fond of you, hurt for you.”\u003c/p\u003e\n\u003cp\u003e“Katie, look, I didn’t mean anything by what I said.”\u003c/p\u003e\n\u003cp\u003eShe looked at her watch, all business all of a sudden. “Oh, Lord, I’m so sorry. It’s gotten so late. We need to head back-I have to get to work. I ruined your diving day. I’m so, so sorry.” She was sincere and contrite. And she didn’t seem to be really angry with him.\u003c/p\u003e\n\u003cp\u003e“Don’t be sorry. I’m not,” he told her softly. And he did touch her. He touched her cheek, and he met her eyes, and he realized that whatever it was that made a man attracted to one woman and not another, he had just found it in Katie. He wasn’t just attracted. He was entwined.\u003c/p\u003e\n\u003cp\u003eHe stood. “Grab a few of the sandwiches. We’ll eat while we motor back in.”\u003c/p\u003e\n\u003cp\u003eShe nodded; he pulled in the flag and the anchor while she went about pulling food from the ice chest. He chewed on a ham-and-cheese-on-wheat while she stood next to him, facing the wind and the spray while they motored back in to the dock. He slowed his speed and followed the markers until they reached the dock. Katie jumped out with the ties.\u003c/p\u003e\n\u003cp\u003e“Hey, I’ll start rinsing equipment,” she called to him.\u003c/p\u003e\n\u003cp\u003e“No, go on. It’s nothing-I’ve got it. Get cleaned up for work,” he told her.\u003c/p\u003e\n\u003cp\u003eShe stood on the dock, looking down at him. Now, she was just in her bikini. It wasn’t a super-string thing or anything like that, just hip-hugging bottoms and a bra top.\u003c/p\u003e\n\u003cp\u003eLord, but she was beautifully built. Athletic, curved, lean…\u003c/p\u003e\n\u003cp\u003e“It’s all right, Katie. You’re working. I’m not. Get going.”\u003c/p\u003e\n\u003cp\u003eShe still stared.\u003c/p\u003e\n\u003cp\u003e“I’ll see you at O’Hara’s later,” he told her.\u003c/p\u003e\n\u003cp\u003eShe smiled.\u003c/p\u003e\n\u003cp\u003eIt seemed a fire started in his chest. Or his loins. He couldn’t really tell. It was just burning everywhere.\u003c/p\u003e\n\u003cp\u003eHe handed up the rest of her belongings, watched her slide into her oversize shirt and shorts and then turn and start home.\u003c/p\u003e\n\u003cp\u003eHe plowed into the ice chest for a beer, and sat on the chest then for a moment, puzzled, staring after her.\u003c/p\u003e\n\u003cp\u003eIt was still fairly early, afternoon. Daylight. Sun was streaming down on the island.\u003c/p\u003e\n\u003cp\u003eBut he was worried. About Katie.\u003c/p\u003e\n\u003cp\u003eHe forgot the equipment and the boat. Or, they were there, in the back of his mind. But they would wait.\u003c/p\u003e\n\u003cp\u003eHe slid into his deck shoes and leapt to the dock and went racing after her.\u003c/p\u003e\n\u003cp\u003eThe streets were crowded today. Sunday. People were shopping, taking dive-and-snorkel and party boats, Jet Skis and more. They were eating and drinking, and buzzing slowly around on scooters.\u003c/p\u003e\n\u003cp\u003eHe raced from the wharf to Front Street. He could see Katie turning off, right before Two Friends bar and restaurant. He followed.\u003c/p\u003e\n\u003cp\u003eHe reached her in time to see her enter her house and close the door behind her.\u003c/p\u003e\n\u003cp\u003eHe stood still on the street, wondering about her earlier words.\u003c/p\u003e\n\u003cp\u003eHe could see no one who seemed to be paying the least attention to him.\u003c/p\u003e\n\u003cp\u003eHe looked up to the windows in the old Victorian and Deco houses around him. No one seemed to be peeking down from behind shutters or curtains.\u003c/p\u003e\n\u003cp\u003eAnd yet, he could swear that he was being watched. He was being watched because…\u003c/p\u003e\n\u003cp\u003eKatie had been followed.\u003c/p\u003e\n\u003cp\u003e7\u003c/p\u003e\n\u003cp\u003eStella Martin woke in the late afternoon. It was late, and she was startled to have slept so long. She bolted up, looked around and smiled.\u003c/p\u003e\n\u003cp\u003eThe night hadn’t started out well. She’d not been able to resist the temptation to pick a jerk’s pocket up on Duval. She’d seen the commotion that had followed. She’d felt bad for the kid who was accused-so she’d followed him.\u003c/p\u003e\n\u003cp\u003eShe’d seen his brother leave him, taking off with a pathetically sluttish rich girl who’d sauntered out of the Irish bar. So much for heading back to their rooms as they’d been told!\u003c/p\u003e\n\u003cp\u003eShe’d managed to snare the kid-who knew that she’d ripped off the other guy. It was a great joke between them. She laughed with him, got to know him and arranged to meet him back at his hotel room after her shift. The kid had been to the ATM machine and was rich. If not rich, Mommy and Daddy were very well off. The two brothers weren’t even sharing a room. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-shadow-bone-island-trilogy-1/page-18.html","bookId":2286,"creation":"Oct 5, 2019 5:51:16 PM","modification":"Oct 5, 2019 5:51:16 PM"}
