{"id":91514,"no":19,"title":"Page 19","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThey’d had a number of drinks. Now he was still sleeping. Snoring. Usually, she hated men who snored. But this kid probably was barely twenty-one. He had long dark hair that fell over his forehead and eyes now as he slept, and he was kind of cute. He’d actually been fun, too. No finesse, but he could fuck like the proverbial bunny. She hadn’t even been tempted to charge him more for going at it again and again. It had been fantastic. Most of the time she was exhausted in an hour, trying to coax a middle-aged drunk asshole into getting it up.\u003c/p\u003e\n\u003cp\u003eAh, the kid was cute. Thanks to him and his room, she’d eluded all the cops.\u003c/p\u003e\n\u003cp\u003eA smile curved into her features. A few of them, she was certain, would always let her go on purpose. They really wouldn’t want to have her talking to them down at the station.\u003c/p\u003e\n\u003cp\u003eShe slipped out of bed and gathered her clothing quickly-she was just as good at dressing quickly as she was at undressing slowly. His wallet was sitting on the dresser, and she had to pause. She wouldn’t take all his money. Just fifty-the kid would still have over a hundred bucks on him. He probably had no idea of how much money he had left anyway. She also took his credit card. She saw his ID. She smiled. Touching. He was an art major at U of M. Silly kids. They came from other states, and they couldn’t wait to get down to the decadence of Duval Street. It was such a bizarre place. She worked one of the strip clubs. Eighteen-year-olds could walk into any strip club. They couldn’t drink, which meant they couldn’t go into a few of the bars that offered karaoke. Stella found that ironic. Kids could watch strippers, but they couldn’t sing. Well, it worked for her.\u003c/p\u003e\n\u003cp\u003eShe counted the money she’d stuffed into her pocket from the night before. It had been so easy to lift the wallet off that big bruiser-and funny, too, to see the idiot attack the guys walking behind him. What an oaf.\u003c/p\u003e\n\u003cp\u003eBut, thanks to the oaf and the kid, she’d had one hell of a good night. She counted her hundreds, smiled and slipped out the door.\u003c/p\u003e\n\u003cp\u003eLuckily, he’d been staying at one of the inns right off Duval that had a back entrance. There was a stone wall, but it was low, and she scrambled over it quickly. Coming along the sidewalk, she turned onto Duval Street.\u003c/p\u003e\n\u003cp\u003eThere were a couple of mounted cops down the street, so she slid into a bar. She ordered a beer quickly, and turned her back to the street.\u003c/p\u003e\n\u003cp\u003eThe mounted cops went by.\u003c/p\u003e\n\u003cp\u003eStella finished her beer, paid and tipped-she always tipped well-and started out on Duval again.\u003c/p\u003e\n\u003cp\u003eShe swore when she walked right into him.\u003c/p\u003e\n\u003cp\u003e“Stella,” he said.\u003c/p\u003e\n\u003cp\u003eHe was one of her few johns who wasn’t married. He was a creep. She knew it. Maybe other people didn’t.\u003c/p\u003e\n\u003cp\u003e“Hey.”\u003c/p\u003e\n\u003cp\u003e“You smell like stale sex, Stella. Bad booze, bad money and stinky, old sex.”\u003c/p\u003e\n\u003cp\u003e“Fuck you,” she said, and pushed by him.\u003c/p\u003e\n\u003cp\u003eHer heart thundered for a minute. He could do bad things if he wanted. But it was broad daylight. Hell, it didn’t matter what the light was.\u003c/p\u003e\n\u003cp\u003eShe quickened her pace, but when she turned around, he wasn’t there. She kept on moving, and passed the church.\u003c/p\u003e\n\u003cp\u003eShe heard the sound of a siren. Damn, the cops!\u003c/p\u003e\n\u003cp\u003eThe ice-cream parlor was right ahead.\u003c/p\u003e\n\u003cp\u003eShe ran inside it, her back to the street.\u003c/p\u003e\n\u003cp\u003eShe winced. Danny, yeah, Danny was supposed to be here!\u003c/p\u003e\n\u003cp\u003eIt didn’t matter; she just needed to stand here for a minute. She set her hands on the counter. It was sticky. She shoved her hands into her pockets, making a face.\u003c/p\u003e\n\u003cp\u003eThe cop car was passing.\u003c/p\u003e\n\u003cp\u003eThen Danny was back. With that way that he looked at her.\u003c/p\u003e\n\u003cp\u003e“Ice cream? Really, Stella?”\u003c/p\u003e\n\u003cp\u003eThe way that he looked at her…\u003c/p\u003e\n\u003cp\u003eHe was sad, he was angry.\u003c/p\u003e\n\u003cp\u003e“Danny-”\u003c/p\u003e\n\u003cp\u003eThe cop car was gone.\u003c/p\u003e\n\u003cp\u003e“Danny-oh, whatever!” she said.\u003c/p\u003e\n\u003cp\u003eShe turned away, and decided that she really had to get off the main streets. She hurried outside and around the church. She could hear a car, and she started running, paranoid now.\u003c/p\u003e\n\u003cp\u003eShe cut through one of the yards. Damn it-she knew too many men in this town. Knew them too intimately.\u003c/p\u003e\n\u003cp\u003eMaybe he was in a car. He might have gotten his car, and he could be following her in it now.\u003c/p\u003e\n\u003cp\u003eNo. Why on earth would he do that?\u003c/p\u003e\n\u003cp\u003eTo harass her.\u003c/p\u003e\n\u003cp\u003eHe was a creep.\u003c/p\u003e\n\u003cp\u003eShe cut into a yard and crawled through palms and crotons that grew heavily there. She looked at the street. No car.\u003c/p\u003e\n\u003cp\u003eShe started to turn around, aware of a sound behind her.\u003c/p\u003e\n\u003cp\u003eShe wasn’t able to turn. Something came over her head. A plastic bag. She grabbed at it, incredulous. Hands wound around her neck. The world began to grow black.\u003c/p\u003e\n\u003cp\u003eIt couldn’t be happening…\u003c/p\u003e\n\u003cp\u003eShe was vaguely aware of sirens. She tried to fight; to live. Help was coming. The sirens came closer, closer…\u003c/p\u003e\n\u003cp\u003eAnd the sound moved away. Help might be coming for someone, but not for her.\u003c/p\u003e\n\u003cp\u003eAnd the blackness swamped over her.\u003c/p\u003e\n\u003cp\u003e“You’re falling apart-you are simply falling apart,” Bartholomew said. “I’d slap you across the cheek to wake you up and make you see clearly-if I could,” he added sternly.\u003c/p\u003e\n\u003cp\u003eThey were just inside the house, and he was clearly agitated.\u003c/p\u003e\n\u003cp\u003e“All this time, I keep asking you about the lady in white. She ignores you, you ignore her. Now you have this new ghost appearing and disappearing, and you’ve gone straight to pieces.”\u003c/p\u003e\n\u003cp\u003e“She’s not just any ghost,” Katie said. “And you saw her last night.”\u003c/p\u003e\n\u003cp\u003e“I didn’t see her today.”\u003c/p\u003e\n\u003cp\u003e“You weren’t with me down there when I was diving with David. You’re afraid of the water!” Katie accused him.\u003c/p\u003e\n\u003cp\u003e“I’m not afraid of it. I can swim,” he argued indignantly. “I can’t see why I should go down getting soaked and wet when there’s no reason for it.”\u003c/p\u003e\n\u003cp\u003e“Would you really get wet?” she asked. “I mean, do ghosts get wet?”\u003c/p\u003e\n\u003cp\u003e“It’s the thought and the memory,” he said, and shuddered. “You swim when your boat sinks, when you’re under attack, when it’s your only recourse. Not for the pleasure of it!”\u003c/p\u003e\n\u003cp\u003e“Wow. How dirty and icky were you?” Katie asked.\u003c/p\u003e\n\u003cp\u003e“I bathed!” he protested. “When possible. I wasn’t repulsive in the least. I had amazing hygiene habits for my day and you are getting completely off the subject here. Katie, you must stop being so hypnotized by this ghost!”\u003c/p\u003e\n\u003cp\u003e“You don’t understand. It’s a true pity that you don’t go into water for the pleasure of it, and you didn’t follow David and me down on that dive. Then you’d understand. The ghost is Tanya. She’s trying to communicate with me-she just doesn’t know how. It’s very bizarre, really. She’s trying so hard to reach out. But…I understand her a bit because…there’s something in her eyes. She can materialize, but she fades so quickly. I can see her try to whisper, but she’s so hard to hear. Maybe she hasn’t been a ghost long enough-”\u003c/p\u003e\n\u003cp\u003e“Ten years,” Bartholomew noted.\u003c/p\u003e\n\u003cp\u003e“And the lady in white, the one who fascinates you? She doesn’t know how to communicate and she’s been a ghost for nearly two hundred years, I’d reckon.”\u003c/p\u003e\n\u003cp\u003eBartholomew plopped down on the sofa in the parlor. “You be careful, or they will lock you up. I don’t enjoy jails-modern or otherwise-and I know that I wouldn’t at all enjoy a mental hospital.”\u003c/p\u003e\n\u003cp\u003e“Oh, that’s just great-coming from you. Bartholomew, Tanya was in my bed this morning.”\u003c/p\u003e\n\u003cp\u003e“Very rude,” he said. “I would never dream of disturbing the sanctity of your private quarters!”\u003c/p\u003e\n\u003cp\u003eKatie ignored his words. She hurried on. “And then in the water. Bartholomew, I told you, you had to have been there. She appeared slowly in the sea dust, as if she gained her image from the particles of plankton and microscopic debris… She formed right behind him, and she looked so, so sad, and she touched his shoulder and his cheek. I could have sworn that there were tears in her eyes.”\u003c/p\u003e\n\u003cp\u003e“In the water?” Bartholomew mocked.\u003c/p\u003e\n\u003cp\u003e“She looked sad, as if she was crying-yes, in the water! She wants me to know, even if she can’t tell me who did do it, that he didn’t.”\u003c/p\u003e\n\u003cp\u003e“That’s ridiculous. She was murdered. If she knows who did do it, she needs to tell you.”\u003c/p\u003e\n\u003cp\u003e“Maybe she doesn’t know. Her attacker might have struck from the back.”\u003c/p\u003e\n\u003cp\u003e“Then if she doesn’t know who did do it, how does she know that it wasn’t David Beckett?” Bartholomew demanded.\u003c/p\u003e\n\u003cp\u003e“She might have known where he was at the time of her death-and if he was nowhere near her, it couldn’t have been him.”\u003c/p\u003e\n\u003cp\u003e“Well, you do need to stop running about in a trance. He will think that you’re as daft as a loon!”\u003c/p\u003e\n\u003cp\u003e“I will. I have it under control. Now.”\u003c/p\u003e\n\u003cp\u003e“I certainly hope so,” he said. He looked at his pocket watch. “Time’s a-wasting, my dear.”\u003c/p\u003e\n\u003cp\u003eShe spun on him and started up the stairs.\u003c/p\u003e\n\u003cp\u003eDavid washed down his equipment, rinsed himself off and headed back to the house for a real shower. After that, he went out to find Danny Zigler.\u003c/p\u003e\n\u003cp\u003eHe was serving ice cream. He grinned at David. “Hey.”\u003c/p\u003e\n\u003cp\u003e“Hey.”\u003c/p\u003e\n\u003cp\u003e“Ice cream?”\u003c/p\u003e\n\u003cp\u003e“You know what, I’ll take a shake. Vanilla.”\u003c/p\u003e\n\u003cp\u003e“Cool.”\u003c/p\u003e\n\u003cp\u003eDavid paid him, adding a handsome tip.\u003c/p\u003e\n\u003cp\u003e“Hey, thanks, David, you don’t have to go overboard. I’m not a charity case, you know. I keep working.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I see that. I was so surprised to see you at O’Hara’s last night. I thought you were doing the ghost tours. And, hell, the crowds on weekends are huge. Didn’t think you could take time off like that.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I miss doing the weekend tours. Thing is, all the companies out there have hired on too many people. Most can work weekends, around their other jobs, you know? I can work weeknights, and to be honest, I don’t like an overcrowded tour. I like to be able to tell the stories good, you know? And when there are too many people, half of ’em don’t hear you, and when you repeat all kinds of stuff, you lose the whole effect,” Danny said. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-shadow-bone-island-trilogy-1/page-19.html","bookId":2286,"creation":"Oct 5, 2019 5:51:16 PM","modification":"Oct 5, 2019 5:51:16 PM"}
