{"id":91517,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSex. Just sex. First sex. Awkward when the clothing was strewn and the pinnacle reached…\u003c/p\u003e\n\u003cp\u003eBut it wasn’t. He came up on an elbow, and his smile was deep. His features were really masculine and beautiful, rugged, never pretty, and yet…beautiful.\u003c/p\u003e\n\u003cp\u003e“Umm. You were well worth waiting for,” she whispered.\u003c/p\u003e\n\u003cp\u003e“We didn’t wait that long,” he said, smiling at her.\u003c/p\u003e\n\u003cp\u003e“Seems like forever,” she said softly.\u003c/p\u003e\n\u003cp\u003e“Thank you. And…obviously, the point now is not to instantly jump your bones, so I suppose it will be all right if I tell you you are really amazingly beautiful and certainly, anyone could wait a lifetime for you.”\u003c/p\u003e\n\u003cp\u003eShe laughed. It was easy being with him. Naked and panting, it was still easy. “Did you get to Ireland in your travels?” She teased. “Kiss the Blarney stone?”\u003c/p\u003e\n\u003cp\u003eHe stroked her hair, looked into her eyes. “Never,” he assured her. He held her against him, still studying her face. “Sean’s little sister. You did grow up well.”\u003c/p\u003e\n\u003cp\u003e“You’ve really got to quit referring to me as Sean’s little sister.”\u003c/p\u003e\n\u003cp\u003e“I do, absolutely. I don’t intend to feel guilty a moment when I see Sean. You are, beyond a doubt, very grownup. And out. In all the right places.”\u003c/p\u003e\n\u003cp\u003e“Thank you, again.” She laughed, and then her breath caught, and suddenly they were clinging to one another again, and rolling on the bed, passionately touching and teasing, and once again, making love wildly, desperately reaching at moments, smiling at others, laughing…and then climaxing again. The world seemed to have no end. They talked about music and coming home from school and finding a way to make it all work. He talked about lighting and photography, getting into underwater film, loving the world beneath the sea, and she reminded him that Key West had some of the most fantastic sunsets in the world.\u003c/p\u003e\n\u003cp\u003eWhen she slept that night, it was deeply.\u003c/p\u003e\n\u003cp\u003eWhen she woke, the woman was back.\u003c/p\u003e\n\u003cp\u003eNot Tanya, the other woman. The dark-haired woman. She was seated across the room in the dressing-room chair, and she was looking at Katie forlornly.\u003c/p\u003e\n\u003cp\u003eKatie bit her lip and turned her head slightly, glad to see that she and David were both decently covered beneath the coolness of the air-conditioning.\u003c/p\u003e\n\u003cp\u003eShe stared at the girl in her room, and she moved her lips without a whisper. “Not here! Never in my room.”\u003c/p\u003e\n\u003cp\u003eThe ghost frowned, blinked and then nodded. She stood, and glided sadly toward the door, and disappeared through it.\u003c/p\u003e\n\u003cp\u003e8\u003c/p\u003e\n\u003cp\u003eKatie woke up early. Lazy, smiling, she’d turned to David, and it seemed the most natural thing in the world that he was there with her. They made love again, slowly, leisurely, feeling the heat of the day grow and glow upon them as the sun rose.\u003c/p\u003e\n\u003cp\u003eWhen she drifted off again, David left her a note, telling her that he’d be at his grandfather’s house.\u003c/p\u003e\n\u003cp\u003eHe still couldn’t call the place his own.\u003c/p\u003e\n\u003cp\u003eHe wanted to spend more of his time with the files Liam had left for him. The police reports were filled with sheets on the detectives’ door-to-door questioning of neighbors. No one had seen anyone enter the museum other than the Becketts and tourists.\u003c/p\u003e\n\u003cp\u003eMany neighbors saw him.\u003c/p\u003e\n\u003cp\u003eThere were the statements, sworn by his grandfather and others, that he had worked at the museum until midnight, and then been at home and with his family until the next morning, when he had left to go to the museum once again.\u003c/p\u003e\n\u003cp\u003eDanny Zigler had been questioned; he was one of the few people with a key to the museum. But a set of keys had hung just inside the kitchen door of the Beckett house, and many people knew that they were there. It had been determined that there hadn’t been a break-in, so someone had come in with a key. There hadn’t been an alarm system, despite the expense that had been poured into the place over the years.\u003c/p\u003e\n\u003cp\u003eForensics had yielded little other than the fact that Tanya had been strangled; an injury to her knee was at least a week old. She had apparently skinned it. The autopsy report noted that Tanya Barnard had not been tortured-a small blessing.\u003c/p\u003e\n\u003cp\u003eDavid dragged his fingers through his hair, and began drawing a chart of the timeline. First, time of death. Second, time in which to get into the museum. It had been open until midnight the night before. That meant her body had been elsewhere for several hours, then moved into the museum. Whoever had put her in the museum either had a key, or knew where the keys were kept. Many people knew about the key. But the Becketts had all been home and together after midnight on the night of the murder. Which meant, David thought, that it had been planned. Meticulously planned. Days before, someone had to have taken the key and had it reproduced. He had a key, there was a key they kept in the house, Danny Zigler had a key and Liam had a key.\u003c/p\u003e\n\u003cp\u003eDavid drummed his fingers on the table.\u003c/p\u003e\n\u003cp\u003eIt hadn’t been a random killing. Tanya had been targeted, and the display of her body had been planned ahead of time. Likely, it was someone who had come and gone from the Beckett house. Himself, Liam. Danny Zigler, any member of Tanya’s family, his friends at the time, his grandfather’s friends…\u003c/p\u003e\n\u003cp\u003eHe was going over the names, trying to think of anyone else. Craig Beckett had been smart, but he’d also had an open heart. They’d welcomed underprivileged kids in for tea, supported the police, the firefighters and every poor wretch who stumbled upon their family. The house had been an open highway.\u003c/p\u003e\n\u003cp\u003eSam Barnard thought that Danny was shady. David had a hard time accepting the fact that he might be guilty of murder.\u003c/p\u003e\n\u003cp\u003eWho then? Who had been around? Himself, Liam, Sam, Jamie O’Hara…no, they said that he hadn’t left his bar that night, not until the wee hours of the morning. Still, he could have hidden the body-but he hadn’t been gone between the hours of seven and nine.\u003c/p\u003e\n\u003cp\u003eShe had last been seen at O’Hara’s.\u003c/p\u003e\n\u003cp\u003eThere had to be something in the files.\u003c/p\u003e\n\u003cp\u003eThere were pictures. Bizarre pictures, still barely real. He rubbed his finger over one of the photographs, touching Tanya’s cheek. Had she been targeted and killed because someone wanted to punish her?\u003c/p\u003e\n\u003cp\u003eFor being free and loose, for finding a new lover while she’d still been engaged?\u003c/p\u003e\n\u003cp\u003eHe read more of the interview notes and realized that there was a small notation next to the name Mike Sanderson. Itvw b p; subject oos. What the hell did that mean?\u003c/p\u003e\n\u003cp\u003eHe frowned. They were a policeman’s notes to himself. Guy Levy. He was still a cop; he’d gotten transferred over to investigation from being a beat cop. Guy had at least ten years with the force now.\u003c/p\u003e\n\u003cp\u003eInterview by phone; subject out of state?\u003c/p\u003e\n\u003cp\u003eDavid pulled out his cell phone and called the station, asking for Guy. To his surprise, he reached him immediately.\u003c/p\u003e\n\u003cp\u003e“David! Saw you at the station the other day but you were gone before I could say hello. How are you doing? Dumb question. We hear about-and see-your success all the time. It’s good that you’re back.”\u003c/p\u003e\n\u003cp\u003e“Thanks. Hey, Guy, I wanted to ask you a question about Tanya’s case.”\u003c/p\u003e\n\u003cp\u003eThere was silence, and then a groan. “Hey, you know, I wasn’t really in on the case. I wasn’t an official investigator. I was just doing interviews.”\u003c/p\u003e\n\u003cp\u003e“I know, I was just curious. Did you go up and see Mike Sanderson, Tanya’s new boyfriend?”\u003c/p\u003e\n\u003cp\u003e“No, no. I interviewed him by phone. He was gone, you know.”\u003c/p\u003e\n\u003cp\u003e“Right. So I heard. Where was he when you spoke to him?”\u003c/p\u003e\n\u003cp\u003e“Uh-home?”\u003c/p\u003e\n\u003cp\u003e“You sure?”\u003c/p\u003e\n\u003cp\u003e“Well, he’d left Key West, you know. Like a day or two before the murder. I didn’t talk to him until the following Monday. I’m sure he could have reached Ohio by then.”\u003c/p\u003e\n\u003cp\u003e“Did you speak to him on a landline?”\u003c/p\u003e\n\u003cp\u003e“I spoke to him on the only number I had. He was all broken up. Said he wasn’t surprised when he didn’t hear from her right away-he’d been afraid that once she’d seen you, she’d change her mind.”\u003c/p\u003e\n\u003cp\u003eSloppy work, David thought. Well, they’d dragged in patrolmen. Men who did what they were told, and didn’t think to hunt down the man and talk to him in person.\u003c/p\u003e\n\u003cp\u003eHe didn’t tell Guy that someone should have really traced Mike Sanderson’s movements; he could have been hiding out somewhere in the Keys. He could have surprised Tanya. She wouldn’t have fought him. She would have never suspected that he wanted to do her harm.\u003c/p\u003e\n\u003cp\u003eHe thanked Guy and clicked the end button on his phone. He needed to get Liam going through official channels to draw credit-card receipts and find out if Mike Sanderson had really left the island.\u003c/p\u003e\n\u003cp\u003eThe crime-scene photos were not good. The murder had been just ten years ago; the photos should have been better, more extensive. He turned on a high-powered light and ruffled through the desk for a magnifying glass.\u003c/p\u003e\n\u003cp\u003eThere was something he hadn’t noticed before. Spots. He tried to rub them off the photos. They didn’t rub off. Was it poor photography? No, he thought. There was something there. Something that looked like light blue bruising on her nose and her lips.\u003c/p\u003e\n\u003cp\u003eHe pulled out the autopsy photos and report. There was no mention of the bruising on the face.\u003c/p\u003e\n\u003cp\u003eMaybe it had been so light at the time that the coroner hadn’t seen it?\u003c/p\u003e\n\u003cp\u003eImpossible to tell at this late date, and it wasn’t evident until now, until he took out the magnifying glass.\u003c/p\u003e\n\u003cp\u003eDeath was officially suffocation by strangling. The bruises on the neck were evident. There had been nothing beneath her nails. Tanya hadn’t fought her attacker. She had been taken completely by surprise.\u003c/p\u003e\n\u003cp\u003eThat suggested someone strong, and, probably, an assault from behind.\u003c/p\u003e\n\u003cp\u003eHe closed his eyes and tried to imagine someone coming up behind her, someone with the strength to encircle her neck with his hands and choke the life out of her before she could put her hands up to resist. It would have been natural for her hands to dig into the hands that were on her, for her nails to have curled into flesh.\u003c/p\u003e\n\u003cp\u003eNot if her attacker was wearing gloves, and not if he stole her air so quickly she couldn’t scream or do more than lift her hands.\u003c/p\u003e\n\u003cp\u003eHis phone started ringing and vibrating on the desk. He picked it up and checked his caller ID before answering it.\u003c/p\u003e\n\u003cp\u003ePete. Lieutenant Pete Dryer.\u003c/p\u003e\n\u003cp\u003e“I thought I’d call you right away,” Pete said. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-shadow-bone-island-trilogy-1/page-22.html","bookId":2286,"creation":"Oct 5, 2019 5:51:16 PM","modification":"Oct 5, 2019 5:51:16 PM"}
