{"id":91529,"no":34,"title":"Page 34","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Oh, good Lord! Go watch the cats,” Katie cried out.\u003c/p\u003e\n\u003cp\u003eMike Sanderson hadn’t uttered a word. David was staring at him as if he could manifest daggers and press them into the man’s heart.\u003c/p\u003e\n\u003cp\u003e“Let’s get out of here!” she said.\u003c/p\u003e\n\u003cp\u003eShe grabbed both men by the elbows, hating the fact that to get out of the crowd, she was going to have to get through the busy streets.\u003c/p\u003e\n\u003cp\u003eWalking arm in arm with Robert the Doll.\u003c/p\u003e\n\u003cp\u003eBut Clarinda had reached them by then, and Jonas was right behind her. Neither of them had the least idea of what was going on, but Clarinda was always intuitive in any situation. “We can go right down Front Street, past the Old Customs House and the Westin, and then duck into Jonas’s place. Follow me.”\u003c/p\u003e\n\u003cp\u003eKatie felt absurdly like a college professor, struggling with fighting young adults. But after the first few seconds, there was no resistance from either man. When Mike Sanderson did stop suddenly, he explained himself quickly. “I have a boxful of money back there-I need it.” He blushed. “I’m supposed to be on a sales trip.”\u003c/p\u003e\n\u003cp\u003e“I’ll get it,” Jonas told them.\u003c/p\u003e\n\u003cp\u003e“You pretend to be on a sales trip-and you come here to pretend to be Robert the Doll?” David demanded.\u003c/p\u003e\n\u003cp\u003e“Fantasy Fest, every year,” Mike Sanderson admitted sheepishly.\u003c/p\u003e\n\u003cp\u003e“How long have you been doing this?” David asked.\u003c/p\u003e\n\u003cp\u003e“Since I left. Well, not exactly. I finished college, and then, since then…”\u003c/p\u003e\n\u003cp\u003e“Why?” Katie asked.\u003c/p\u003e\n\u003cp\u003e“I love it. I love Fantasy Fest. I always have. My wife hates it. So I pretend I’m on a sales trip.”\u003c/p\u003e\n\u003cp\u003e“How can you love this place-when Tanya died here?” David demanded.\u003c/p\u003e\n\u003cp\u003eMike Sanderson stopped walking. He was rock-solid; Katie almost tripped when as she had been leading him along, he then pulled her back.\u003c/p\u003e\n\u003cp\u003e“I didn’t kill Tanya!” Sanderson said angrily. “And don’t kid yourself-I know exactly who you are, and I know that she stayed here just because she wanted to talk to you. I don’t think she was ever coming with me. Not once you had come back. But I didn’t kill her.”\u003c/p\u003e\n\u003cp\u003e“I really think we should get inside for this discussion,” Clarinda said. “That’s Jonas’s place, there.”\u003c/p\u003e\n\u003cp\u003e“It’s an inn,” David said.\u003c/p\u003e\n\u003cp\u003e“Yes, yes, but go up the stairs, he keeps the whole second floor of the main house for himself.”\u003c/p\u003e\n\u003cp\u003eAs she spoke, Jonas came running back up to them, Mike’s donation hat in his hands. “Amazing, isn’t it? Crowd like that-not a soul touched his money. Sometimes, human beings are decent.”\u003c/p\u003e\n\u003cp\u003eNo one answered him. He cleared his throat. “Okay, let’s get upstairs,” he said.\u003c/p\u003e\n\u003cp\u003eThe outer door was open; it led to hallways with signs that indicated room numbers and pointed to cottages outside. They hurried up the stairs; the door in the hallway was locked and Jonas quickly opened it for them. They piled in.\u003c/p\u003e\n\u003cp\u003eMike Sanderson moved first, striding across the room, tearing off the Velcro that held his Robert the Doll sailor outfit together in the back. He was wearing the costume over a pair of cutoff jeans and a simple white T-shirt. He folded it and put it at his feet. Katie realized that David was still holding the man’s cloth mask and sailor hat when Sanderson reached out to him. “Do you mind? I don’t intend to press charges, but I do make good money at this gig.”\u003c/p\u003e\n\u003cp\u003e“You make good money, standing in Mallory Square, pretending to be Robert the Doll?” Clarinda said incredulously.\u003c/p\u003e\n\u003cp\u003e“Four hundred bucks already tonight,” Sanderson said. “Beats selling vacuums, which I do to keep the family going.”\u003c/p\u003e\n\u003cp\u003e“But-you were supposed to be a big-shot football player at Ohio State!” Katie said.\u003c/p\u003e\n\u003cp\u003e“Knee injury. They loved me before it-I was yesterday’s news afterward,” Sanderson said.\u003c/p\u003e\n\u003cp\u003eShe studied him. He was a big fellow with sandy-blond hair, light brown eyes and a pretty-boy face that seemed to be getting just a little fleshy at the edges now, as if he were a man who liked his booze.\u003c/p\u003e\n\u003cp\u003e“The police down here want to talk to you,” David told him.\u003c/p\u003e\n\u003cp\u003e“Yeah, I know, my wife called me,” he said.\u003c/p\u003e\n\u003cp\u003e“So why didn’t you come into the police station?” David asked him.\u003c/p\u003e\n\u003cp\u003e“I’m not supposed to be here,” Sanderson said with a sigh of impatience. “Don’t you get it? No one knows I do this. Hell, what, everyone’s life turns out to be what they want? I come down here. I see all the naked painted boobs for Fantasy Fest. I don’t go with any lowlifes, I don’t pick up any sexual diseases, I just do a lot of looking and drinking, and I make money to bring home by putting on a Robert the Doll costume and scaring people in the square. It’s a personal thing. What the hell is wrong with you, and what the hell business is it of yours that I do this?”\u003c/p\u003e\n\u003cp\u003e“It’s police business because you lied when they questioned you a decade ago,” David said. “And it’s police business because another woman was murdered.”\u003c/p\u003e\n\u003cp\u003e“Look-I do this for the money! I’m not hung up on Key West legend,” Sanderson said. “I loved Tanya! I wouldn’t have hurt her for the world. I was young. I waited for her-then I figured that she’d chosen you over me. When I heard about the murder, I panicked, and I got the hell out!”\u003c/p\u003e\n\u003cp\u003e“You will have to tell that story to the police,” David said.\u003c/p\u003e\n\u003cp\u003eSanderson straightened where he sat. “Sure. I’ll be happy to do so.”\u003c/p\u003e\n\u003cp\u003e“When did you get here?” he asked.\u003c/p\u003e\n\u003cp\u003eSanderson shook his head and winced. “Last Friday,” he said.\u003c/p\u003e\n\u003cp\u003e“Before Stella Martin was murdered,” David pointed out.\u003c/p\u003e\n\u003cp\u003eSanderson stood, pointing hard at David. “Look, you bastard, you were the jilted lover. You owned the damned museum. You’re a fucking conch, for God’s sake-you’re the one all into the history and legend of Key West. They would have locked your ass up if you weren’t David Beckett!”\u003c/p\u003e\n\u003cp\u003eTo David’s credit, he completely controlled his temper. He stood dead still without speaking for long seconds.\u003c/p\u003e\n\u003cp\u003eSanderson took a step back from him. “Look, maybe you didn’t do it. But I know this much-I didn’t do it and you can haul me down to the station anytime you want.”\u003c/p\u003e\n\u003cp\u003eDavid looked over at Jonas. “Want to take a ride?”\u003c/p\u003e\n\u003cp\u003e“I-uh-sure,” Jonas said.\u003c/p\u003e\n\u003cp\u003e“What the hell? The sun has been down a long time now,” Clarinda said. “What a lovely evening out with friends!”\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eThe night sergeant on duty was ready to bring them in. David had called Liam, and Liam, who had just left for the evening, called Pete Dryer, who had left just a bit earlier, and the result was that both men would be returning to the station.\u003c/p\u003e\n\u003cp\u003eClarinda sat in the waiting area, shaking her head at Katie. “I feel as if I’ve just been brought in on some kind of a sting. Look around, will you?”\u003c/p\u003e\n\u003cp\u003eThere was an odd assortment of people in the station that night. There was a drunk who was crying in the arms of another drunk.\u003c/p\u003e\n\u003cp\u003eA junkie.\u003c/p\u003e\n\u003cp\u003eA belligerent fellow being held on a drunk-driving charge.\u003c/p\u003e\n\u003cp\u003eIt was hopping.\u003c/p\u003e\n\u003cp\u003eFantasy Fest was all but here.\u003c/p\u003e\n\u003cp\u003eLiam Beckett came back through the door first. His white polo shirt bore a police insignia and he was in neat work khakis. He was totally professional, shaking hands with Mike Sanderson and thanking him for coming in on a voluntary basis. Pete came through the doorway just a minute later, looking worn-as he should. One of the city’s most important and biggest festivals was on the way, and a murderer was loose in the city.\u003c/p\u003e\n\u003cp\u003ePete nodded at David. “Thanks. Thanks for talking this fellow into coming in. We can take this from here, David.”\u003c/p\u003e\n\u003cp\u003eFor a moment, David looked as if he didn’t want to move. Then he nodded. “Of course,” he said.\u003c/p\u003e\n\u003cp\u003eBut as they started out, he held back for a minute. “Hang on, I just have to catch Liam quickly.”\u003c/p\u003e\n\u003cp\u003eHe went back in before Katie could try to stop him.\u003c/p\u003e\n\u003cp\u003e“Oh, Lord-is he coming back out, do you think?” Clarinda asked.\u003c/p\u003e\n\u003cp\u003e“I think,” Katie said.\u003c/p\u003e\n\u003cp\u003e“Umm, maybe not,” Jonas said after a minute.\u003c/p\u003e\n\u003cp\u003eJust when Katie was about to give up, David came out. He was smiling. He slipped an arm around her shoulders and one around Clarinda’s shoulders. “Where shall we go for dinner?” he asked.\u003c/p\u003e\n\u003cp\u003e“Umm-anywhere,” Jonas said.\u003c/p\u003e\n\u003cp\u003e“I’m not so sure we can get in anywhere,” Clarinda said. “The city is teeming.”\u003c/p\u003e\n\u003cp\u003e“O’Hara’s,” Katie said dryly. “I can always get in there.”\u003c/p\u003e\n\u003cp\u003eClarinda laughed. “My night off! But that’s all right-I do know they have good food.”\u003c/p\u003e\n\u003cp\u003e“And we can park in back there, too. I know the owner,” Katie pointed out.\u003c/p\u003e\n\u003cp\u003eThe evening ended, oddly enough, on a good note. Jonas was fascinated with photography, and David talked about different places he had been. Jonas pointed out that with all that David did, now was the time for him to go back and do some shots and film work in his own backyard. “My God, think about it. We’ve got more wildlife and shipwrecks than a dog has fleas,” Jonas pointed out.\u003c/p\u003e\n\u003cp\u003e“You know, that’s odd,” Clarinda noted. “David, you and Sean wound up going into just about the same thing. You’ve been very successful with your still work and Sean’s usually doing video or film or whatever. Do you ever work with video?”\u003c/p\u003e\n\u003cp\u003eDavid nodded. “I love both. Still life is capturing a single moment with the subject, light and characters just right. But film is great-it’s life in motion, or dust motes moving through the air. Last year, I did some work in Australia, filming oceanographers searching for one of the really well-preserved wrecks recently discovered there.”\u003c/p\u003e\n\u003cp\u003e“But have you and Sean worked together?” Jonas asked.\u003c/p\u003e\n\u003cp\u003eDavid shook his head. “I haven’t seen Sean in ten years,” he said. “We keep up with e-mail now and then, but we’ve never worked on the same project.”\u003c/p\u003e\n\u003cp\u003eJon Merrillo, Jamie O’Hara’s main manager in his absence, stopped by the table. He was about forty, and hadn’t been in the Keys very long. He had taken to the area like a native; he loved it, and never wanted to go back North. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-shadow-bone-island-trilogy-1/page-34.html","bookId":2286,"creation":"Oct 5, 2019 5:51:16 PM","modification":"Oct 5, 2019 5:51:16 PM"}
