{"id":91540,"no":45,"title":"Page 45","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“No way to know-he’s far too bloated. Got to get him to the morgue.”\u003c/p\u003e\n\u003cp\u003e“Katie,” Liam said. “What happened? Witnesses said that you just came to the effigy and started tearing at it. How did you know that Danny was in it?”\u003c/p\u003e\n\u003cp\u003e“What?” she asked, blinking.\u003c/p\u003e\n\u003cp\u003e“How did you know that Danny had been stuffed into the effigy?” Liam persisted.\u003c/p\u003e\n\u003cp\u003e“I-I, umm, well, I saw someone. Out the door-the doors at O’Hara’s are open, of course, you know. And I saw someone dressed in a Robert the Doll costume, and then the giant Robert the Doll effigy was right behind him, and I remembered the-the odor-and it seemed as if it was coming right in the bar and I…” She let her voice trail away. “I guess that I freaked out a bit, Liam. I’m so sorry, I just couldn’t take the smell and I suddenly realized it was coming from the effigy.”\u003c/p\u003e\n\u003cp\u003e“What about the manufacturer-how did Danny wind up in the doll?” David asked.\u003c/p\u003e\n\u003cp\u003e“The doll was up before Danny disappeared,” Liam said, glancing at his notes. “The manufacturer is local, just up on Stock Island. They’ve done these dozens of times. And the effigy was set up by the salsa club right there, and they’re baffled and mystified-again, they said that the doll was in perfect shape from the manufacturer when they assembled it.”\u003c/p\u003e\n\u003cp\u003e“So someone killed Danny Zigler and stuffed his body into a giant-size effigy of another Key West legend,” David said.\u003c/p\u003e\n\u003cp\u003e“That’s what it looks like so far,” Liam said.\u003c/p\u003e\n\u003cp\u003eThe medical examiner and police photographers gave the word and the corpse was lifted into a body bag-oozing liquids-to be taken to the M.E.’s office.\u003c/p\u003e\n\u003cp\u003eThe owners of the salsa bar argued with the police; that area of the street would have to remain cordoned off until it had been thoroughly inspected and cleared by crime scene. It was Fantasy Fest. What was the city going to do about the amount of money they were going to lose?\u003c/p\u003e\n\u003cp\u003eKatie had felt ridiculously frozen and weak. Paralyzed. Horrified.\u003c/p\u003e\n\u003cp\u003eBut she was suddenly angry. It wasn’t a shock; she had seen Danny’s ghost. When she had looked out the door and seen him, then the costumed Robert the Doll performer, she had known. Danny had been showing her where he could be found. Poor Danny. He would have been so horrified. He loved Key West.\u003c/p\u003e\n\u003cp\u003eNow, he was part of Key West. Part of the stories and lore that would be told to generations from now until eternity.\u003c/p\u003e\n\u003cp\u003e“Am I free to go?” she asked Liam suddenly.\u003c/p\u003e\n\u003cp\u003e“Of course, Katie. But-” Liam began.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she told him.\u003c/p\u003e\n\u003cp\u003eShe made her way through the gaping crowd on the street and back to O’Hara’s. Her brother was there, looking aggravated, but managing to put up a stream of pirate songs with singers, music and words intact. He was startled when he saw her arrive.\u003c/p\u003e\n\u003cp\u003e“Katie, you just found the corpse of an old friend. Get David to take you home,” Sean said. “Or leave David. I’ll take you home. Hell, Jamie would close this place down and take you home.”\u003c/p\u003e\n\u003cp\u003e“No,” Katie said angrily. “No, everyone is acting like Danny is something disgusting in the street, as if he’s an annoyance, ruining a pirate parade.”\u003c/p\u003e\n\u003cp\u003eShe took the microphone. “Folks, everyone knows that something terrible just happened. Everyone tried to get close, to find out what happened. Well, I’ll tell you. A friend of ours disappeared a few days ago. People were mad at him-they thought that he’d sloughed off work. In fact, it was even suspected that he had killed a woman. But he didn’t. He was murdered himself. He wasn’t an odor in the street-he was a good guy, a true conch, a real part of Key West. His name was Danny Zigler. He didn’t need a lot of money. He loved Key West, and he loved the simple things in life. This is for him. Honor him with me, if you will.”\u003c/p\u003e\n\u003cp\u003eShe went to the computer and set “Danny Boy” to play. There was a dead silence at first.\u003c/p\u003e\n\u003cp\u003e“Danny Zigler was Irish?” Someone asked with confusion.\u003c/p\u003e\n\u003cp\u003e“Everyone’s Irish on St. Patrick’s day,” a drunk sloshed out in reply.\u003c/p\u003e\n\u003cp\u003e“Sing along, a good fellow is gone and departed!” someone else said.\u003c/p\u003e\n\u003cp\u003eWhen it was over, she felt David at her side. “Katie, come on. We’re going.”\u003c/p\u003e\n\u003cp\u003e“We can’t go,” she said dully.\u003c/p\u003e\n\u003cp\u003e“We can. Sean and Clarinda can handle your system. And it will thin out early-even in the middle of Fantasy Fest, a dead man means something, Katie.”\u003c/p\u003e\n\u003cp\u003eShe let him drag her away. She had known that Danny was dead. He hadn’t been her best friend, but he had been a fixture in her life. He had always been there.\u003c/p\u003e\n\u003cp\u003eDavid took her home. She wondered that he was with her, and she felt a little numb, and a little awed. He probably wanted to be haunting the police station. He’d want to know what happened to Danny Zigler. He had to be noting the fact that all the deaths were coupled with Key West legends.\u003c/p\u003e\n\u003cp\u003eAt her house, she ran up and showered the minute they were inside. The smell of death had seemed to permeate her. She scrubbed her hair several times. At last she emerged and wrapped into her terry robe.\u003c/p\u003e\n\u003cp\u003eDavid had evidently decided to use her brother’s shower-the scent of decay and death had been too much for him, too. He was out of his pirate garb and in Sean’s clothing, something she was certain he would explain and Sean would understand. He had made her something hot.\u003c/p\u003e\n\u003cp\u003e“Tea-with a good dose of whiskey,” he told her, handing her the cup.\u003c/p\u003e\n\u003cp\u003e“I’m all right. I’m really all right. I knew that Danny was dead. It was just that it was so horrible-seeing him, like that. I’ve seen the dead before, I’ve been to funerals…but that!”\u003c/p\u003e\n\u003cp\u003e“Death is seldom gentle,” he told her.\u003c/p\u003e\n\u003cp\u003eShe sipped the tea, and noted that it was very strongly laced with whiskey. She carried it out to the parlor and saw that Bartholomew was seated on the sofa, watching her with sorrowful eyes. “I wish I had realized, Katie. I can’t really…I don’t get scents and odors anymore. I would have stopped you. I tried to stop you, and you didn’t even see me.”\u003c/p\u003e\n\u003cp\u003e“It’s all right,” she murmured.\u003c/p\u003e\n\u003cp\u003eDavid had come behind her. He set his hands on her shoulders. “Go on up to bed, Katie. Try to sleep.”\u003c/p\u003e\n\u003cp\u003e“I can’t.”\u003c/p\u003e\n\u003cp\u003e“You will. I’ll be here.”\u003c/p\u003e\n\u003cp\u003eShe nodded after a moment, draining the tea. The whiskey washed through her, warm and soothing. “All right.”\u003c/p\u003e\n\u003cp\u003eShe gave him the cup and headed for the stairs. She heard him make a startled sound. On the first step, she turned back.\u003c/p\u003e\n\u003cp\u003eDavid was still standing in the middle of the parlor, holding her cup.\u003c/p\u003e\n\u003cp\u003eHe was staring at the table.\u003c/p\u003e\n\u003cp\u003eThe ledger, the Beckett family ledger was moving.\u003c/p\u003e\n\u003cp\u003eBartholomew was pushing it toward him, of course. He didn’t see Bartholomew.\u003c/p\u003e\n\u003cp\u003eBut he had to see the ledger moving.\u003c/p\u003e\n\u003cp\u003eShe went on up the stairs. As he had said, despite all that was haunting her mind-or perhaps because of it-she slept.\u003c/p\u003e\n\u003cp\u003eHe’d had one beer. One damned beer.\u003c/p\u003e\n\u003cp\u003eAnd it seemed that the ledger on the table was moving. It was open.\u003c/p\u003e\n\u003cp\u003eHe was tired. So damned tired. And more disturbed than ever. When Katie had gone on into the pub, Liam had told him that the police had gone into Danny Zigler’s house at last.\u003c/p\u003e\n\u003cp\u003eThere had been no sign of books about the history of Key West.\u003c/p\u003e\n\u003cp\u003eThere had been no money.\u003c/p\u003e\n\u003cp\u003e“You’re sure it’s what you saw, David?” Liam had asked him.\u003c/p\u003e\n\u003cp\u003e“Yes, I’m a photographer. I have pictures,” David told him.\u003c/p\u003e\n\u003cp\u003e“Then someone else let themselves into Danny’s apartment. Hell, David, I may have to let Pete know that you were in there.”\u003c/p\u003e\n\u003cp\u003e“Liam, don’t do anything just yet. Give me a little more time before I get arrested myself, thrown off the island, or until Pete decides he’s not letting me move out the door.”\u003c/p\u003e\n\u003cp\u003e“David, I’m feeling pretty damned slimy right now,” Liam told him.\u003c/p\u003e\n\u003cp\u003e“Pretend I never trusted you. Just give me a little more time. I don’t know why-I’m feeling that I can almost touch the last piece of the puzzle.”\u003c/p\u003e\n\u003cp\u003eHe hated what he was asking Liam to do. But he also knew that someone out there was wearing a facade of complete normalcy-and killing people under that cover.\u003c/p\u003e\n\u003cp\u003eThe ledger had been moving. In his mind’s eye, anyway. It was subconsciously telling him that the answers were right in front of him-he had to find them.\u003c/p\u003e\n\u003cp\u003eHe set Katie’s empty teacup down and walked toward the ledger. It was open to a page filled with elaborate script that was somewhat difficult to read. But he knew the book; it had been in the family forever. Craig had told him that Alice and Esther had decided that their role in life was to preserve family history. They had recorded births and deaths, and events that had occurred in Key West during their lives.\u003c/p\u003e\n\u003cp\u003eBefore Alice and Esther had recorded in the book, the task had been taken on by Josiah Beckett, his great-grandfather. Before that, it had been Helena, youngest daughter of the first Craig Beckett. And before that, it had been Beckett himself who had kept the records.\u003c/p\u003e\n\u003cp\u003eNone of that mattered. The book was open to a page that recorded when the territory of Florida had become a state, and when David Porter had brought down his Mosquito Squadron, and piracy had been brought to an end.\u003c/p\u003e\n\u003cp\u003eHe read over and over the part about the assault on the ship, the death of Victoria and the lynching of Bartholomew. He read about his ancestor’s fury and insistence that an innocent man had been hanged, and that a guilty man must be brought to justice. And how he had watched at the hanging tree himself while Smith had met with his end. Craig Beckett had stood there while Smith had cursed his family, something that hadn’t disturbed him in the least. He believed in men, in justice and in God-he did not believe in curses.\u003c/p\u003e\n\u003cp\u003eHe definitely hadn’t been cursed, David thought. The first Craig Beckett had lived out a long and prosperous life.\u003c/p\u003e\n\u003cp\u003eThe key turned in the outside lock and Sean O’Hara came in. David glanced at his watch. It was nearly 5:00 a.m. He should have been sleeping himself.\u003c/p\u003e\n\u003cp\u003eSean came into the parlor. “Katie?” he asked.\u003c/p\u003e\n\u003cp\u003e“She went to bed several hours ago,” David said. \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-shadow-bone-island-trilogy-1/page-45.html","bookId":2286,"creation":"Oct 5, 2019 5:51:16 PM","modification":"Oct 5, 2019 5:51:16 PM"}
