{"id":91546,"no":51,"title":"Page 51","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe hanging tree.\u003c/p\u003e\n\u003cp\u003eThey heard the door open.\u003c/p\u003e\n\u003cp\u003e“What the hell is going on in here?” Pete Dryer demanded in his husky, authoritative voice.\u003c/p\u003e\n\u003cp\u003e“Thank God!” Sean breathed. “Pete, we found this bastard lurking around in here,” Sean said.\u003c/p\u003e\n\u003cp\u003e“Is that a fact?” Pete demanded. “What are you, some kind of a sicko? You killed your own sister, and now you’re back at the scene of the crime?”\u003c/p\u003e\n\u003cp\u003e“No!” Sam cried out. “Get this jerk off me, for God’s sake.”\u003c/p\u003e\n\u003cp\u003eSean stood. Pete pulled out his cuffs. “Time to pay the piper, you little snot-nose creep!” Pete said.\u003c/p\u003e\n\u003cp\u003ePete was here. It was all under control.\u003c/p\u003e\n\u003cp\u003e“Whether he killed anyone or not, Pete, he was breaking and entering here,” Katie said.\u003c/p\u003e\n\u003cp\u003e“Oh, what, it’s your place because you’re sleeping with Beckett?” Sam demanded. “That asshole-my sister dies over him and he’s still out there poking everything in a skirt!”\u003c/p\u003e\n\u003cp\u003eKatie ignored him. “I have to run upstairs for just a minute. It’s important. Pete, you’ve got Sam, right? Sean, you can fill Pete in? I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eShe didn’t give them a chance to answer. Danny was beckoning, and he looked worried, as if speed might be of the essence.\u003c/p\u003e\n\u003cp\u003e“I’m calling it in,” Pete said, “but I’ll drag the little goon in myself. Tell me exactly what happened, Sean.”\u003c/p\u003e\n\u003cp\u003e“Katie, what the hell…?” Sean demanded angrily.\u003c/p\u003e\n\u003cp\u003e“I’ll be right back down!” she swore.\u003c/p\u003e\n\u003cp\u003eShe wasn’t afraid. Her brother was there, and Pete had Sam Barnard-he’d be cuffed any minute, and safe.\u003c/p\u003e\n\u003cp\u003eShe came out upstairs. The auxiliary lights had come on, giving her a footpath to follow. In the very strange orange-and-purple light that filtered in from the sky of the dying day, figures rose all around her. Pirates, smugglers, scalawags. Navy men and soldiers, Union soldiers, Confederate soldiers. They posed, ready to speak, ready to move.\u003c/p\u003e\n\u003cp\u003eShe made her way to the hanging tree.\u003c/p\u003e\n\u003cp\u003eThe figure there was posed with its back to her as it dangled from the tree. She stepped up. There was a large plaque on the floor, noting the tree, telling its present location, stating its grim utility as a means of execution.\u003c/p\u003e\n\u003cp\u003eOn the wall, closer to the exhibit, was a small handwritten explanation. Craig Beckett had lovingly written up small wall plaques when the place had been younger, when no velvet ropes had barred visitors from getting too close.\u003c/p\u003e\n\u003cp\u003e“The hanging of Eli Smith,” the plaque read. “Justice was hard; another man hanged for his crimes, lynched by a mob. But truth caught up with a reckless killer.”\u003c/p\u003e\n\u003cp\u003eUnderneath it Craig Beckett had noted that Smith still had descendants living in the city today. He had left behind a daughter.\u003c/p\u003e\n\u003cp\u003eThe cursive handwriting was difficult to read. Katie leaned closer.\u003c/p\u003e\n\u003cp\u003eAs she did so, there was a tremendous thud from down below.\u003c/p\u003e\n\u003cp\u003eThe auxiliary lights went out.\u003c/p\u003e\n\u003cp\u003eAs they did so, her mind comprehended Craig’s cursive handwriting, and she gasped as the room fell into a shadow land of darkness.\u003c/p\u003e\n\u003cp\u003eShe knew the killer.\u003c/p\u003e\n\u003cp\u003eAnd she knew he was in the museum with her.\u003c/p\u003e\n\u003cp\u003eHe already had Sean.\u003c/p\u003e\n\u003cp\u003e17\u003c/p\u003e\n\u003cp\u003e“Everything is fine,” Liam assured David, snapping his phone shut.\u003c/p\u003e\n\u003cp\u003e“What the hell do you mean, fine?”\u003c/p\u003e\n\u003cp\u003e“I guess there was some trouble-and that you might have been right.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Sam Barnard was at the museum. Sean and Katie heard him, and there was a major tussle, I guess between Sam and Sean. But Katie had gotten through to Pete Dryer and he arrested Sam. Katie might have lost her phone, what with everything going on. Anyway, she’s supposed to be at work now. Should I leave you there?”\u003c/p\u003e\n\u003cp\u003e“Yeah. You’re sure everything is all right?”\u003c/p\u003e\n\u003cp\u003e“The lieutenant called it in. He had it under control,” Liam said. “Look, I’ll leave you at the bar, and I’ll head to Katie’s house, and then, if she’s not working or at her place, I’ll meet up with you at Craig’s place. Your place. Whatever.”\u003c/p\u003e\n\u003cp\u003e“All right, thanks,” David said.\u003c/p\u003e\n\u003cp\u003eHe didn’t know why. He’d been the one pointing out all the reasons that it had to have been Sam Barnard. But was it?\u003c/p\u003e\n\u003cp\u003eLiam let him off before reaching the insanity of Duval Street. David turned the corner and headed into O’Hara’s. Katie had not set up.\u003c/p\u003e\n\u003cp\u003eHe found Clarinda and caught her by the arm. “Katie, where’s Katie?” he demanded.\u003c/p\u003e\n\u003cp\u003e“She hasn’t come in yet.” Clarinda’s eyes widened. “She isn’t with you?”\u003c/p\u003e\n\u003cp\u003e“She’s with Sean. She was with Sean.”\u003c/p\u003e\n\u003cp\u003e“Jamie just sent Jonas to the house. She hasn’t answered her phone, and neither has Sean. Jamie is breathing fire,” Clarinda said. “Oh, my God! Has something happened?”\u003c/p\u003e\n\u003cp\u003e“I’m heading to my house. If she shows up here, call me immediately. Screw Jamie and every customer in this place, Clarinda, and call me!”\u003c/p\u003e\n\u003cp\u003e“Oh, my God, David, you’re scaring the hell out of me!” Clarinda said.\u003c/p\u003e\n\u003cp\u003e“Just call me!”\u003c/p\u003e\n\u003cp\u003eHe didn’t have time to reassure Clarinda, not when suddenly he was so convinced that he didn’t have time. He left the bar, and ran down the backstreets. A drunken party of six swaggered by him, almost knocking him over. A woman, in ridiculously high heels, staggered and caught his arm.\u003c/p\u003e\n\u003cp\u003e“Cool, thanks… Hey, help us along there, shoulders, will ya?” she asked.\u003c/p\u003e\n\u003cp\u003eHe pressed her onto the nearest man; if they all fell flat on their faces, so be it.\u003c/p\u003e\n\u003cp\u003eHe hopped a hedge to race across the lawn and up the porch steps of his house. He inserted the key in the lock, and twisted it. He reached inside to flick on the lights.\u003c/p\u003e\n\u003cp\u003eThe electricity was out.\u003c/p\u003e\n\u003cp\u003eHer heard movement in the bushes and swung around. Liam.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Liam asked.\u003c/p\u003e\n\u003cp\u003e“Electric.”\u003c/p\u003e\n\u003cp\u003eLiam swore. He reached for his phone. David stopped him. “If he has them, they might still be alive. No alarms.”\u003c/p\u003e\n\u003cp\u003eLiam nodded. He drew his service revolver and they went into the house. “Fuse box?” Liam asked.\u003c/p\u003e\n\u003cp\u003eDavid nodded. “I can see-I can see enough.”\u003c/p\u003e\n\u003cp\u003eHe went up the stairs and made a hurried sweep of the house. He came back down the stairs and went into the dining room.\u003c/p\u003e\n\u003cp\u003eThe books lay on the table, undisturbed.\u003c/p\u003e\n\u003cp\u003eHe turned to go back and look for his cousin.\u003c/p\u003e\n\u003cp\u003eBut he was shoved. Shoved, back toward the table.\u003c/p\u003e\n\u003cp\u003eHe swung around, ready to fight, ready to survive. There was no one there.\u003c/p\u003e\n\u003cp\u003eHe was shoved toward the table again.\u003c/p\u003e\n\u003cp\u003eThe top book flew open.\u003c/p\u003e\n\u003cp\u003eHe drew out a penlight and threw the glow onto the page. He looked at it, puzzled. It was a family tree. He turned the page.\u003c/p\u003e\n\u003cp\u003eThe paper nearly ripped as the page turned back.\u003c/p\u003e\n\u003cp\u003e“What? What?” he demanded aloud. The book offered a host of pages of old names, the kind of names the streets had taken on in honor of early residents, and names of those who had gone before and not been honored.\u003c/p\u003e\n\u003cp\u003eHe studied the page again that the unseen entity wanted him to read. The headline read, Smith.\u003c/p\u003e\n\u003cp\u003eHe ran his fingers down the page, following the descendants through the ages, births, marriages and deaths.\u003c/p\u003e\n\u003cp\u003eHe swore aloud as Liam came back into the house. “Search this place, top to bottom!” he told him. “Get someone here, Liam, quickly, for the love of God!”\u003c/p\u003e\n\u003cp\u003eDavid burst out into the night and started running.\u003c/p\u003e\n\u003cp\u003eKatie was stunned as she heard movement-real movement-behind her. She blinked, trying to adjust to the slim filter of outside light that made its way in.\u003c/p\u003e\n\u003cp\u003eShe longed to cry out; she was terrified for Sean. Tears stung her eyes.\u003c/p\u003e\n\u003cp\u003eShe couldn’t cry out. She had to find Sean in silence.\u003c/p\u003e\n\u003cp\u003eA noise startled her.\u003c/p\u003e\n\u003cp\u003eShe swung around. It was as if the museum had been activated. Next to the hanging tree, military ruler Porter waved a broadside that promised death to all pirates. His arms were jerking spasmodically. His jaw jerked and there was an awful moment when he talked without sound.\u003c/p\u003e\n\u003cp\u003eThen a bad recording came on. Rasping and hollow. “Death…death…death…to…to…all…all…all…pirates!”\u003c/p\u003e\n\u003cp\u003eShe moved quickly by Porter, only to crash into a tall robotic of a wrecker.\u003c/p\u003e\n\u003cp\u003e“Storm! Storrrrm…warning. First ta’ reach her, salvage is mine…mine…mine…mine.”\u003c/p\u003e\n\u003cp\u003eShe had to stay calm. She couldn’t heed the jerky movements or the eerie voices of the robotics. When she moved again, a sailor with the insignia for the Maine seemed to leap ahead of her in her path. He hadn’t moved. She was terrified, and she knew that someone had hit the mechanization that Craig Beckett made.\u003c/p\u003e\n\u003cp\u003eThey were just robotics. Just robotics coming to mechanical life. She had to ignore them.\u003c/p\u003e\n\u003cp\u003eShe had to get downstairs to Sean.\u003c/p\u003e\n\u003cp\u003eShe started to walk again, and then she heard stealthy movement. Not a robotic.\u003c/p\u003e\n\u003cp\u003eSomeone was stalking her in the darkness. She made her way carefully then, letting the robotics talk and move, and using them for cover.\u003c/p\u003e\n\u003cp\u003eShe came to the robotic of Ernest Hemingway. He jerked and spoke, complaining about his wife, Pauline. He said, in grating and broken words, that he’d set a penny into his patio-because his wife had certainly taken his very last penny. Katie slipped by him, glad of the noise he was making, and headed down the servants’ stairs to the exhibits below.\u003c/p\u003e\n\u003cp\u003eShe paused, having reached the first floor. She was going to have to sneak across the open entryway to get to the left bank of rooms if she didn’t go through the pantry corridor in the back.\u003c/p\u003e\n\u003cp\u003eShe didn’t want to go through the pantry corridor; it was too narrow. If there was someone there, that someone could too easily nail her.\u003c/p\u003e\n\u003cp\u003eAs she hesitated, she heard a strange whooshing noise, and, at first, she thought one of the robotics was speaking in a rusty voice once again.\u003c/p\u003e\n\u003cp\u003e“You…you…you…you…you. You are going to die. Come out, come out, wherever you are! We’re locked in, and your poor brother! Paying for the fact that you had to sleep with a Beckett!”\u003c/p\u003e\n\u003cp\u003eShe froze. The voice was near. But from which direction? \u003c/p\u003e","sourceLink":"https://allnovel.net/ghost-shadow-bone-island-trilogy-1/page-51.html","bookId":2286,"creation":"Oct 5, 2019 5:51:16 PM","modification":"Oct 5, 2019 5:51:16 PM"}
