{"id":12360,"no":12,"title":"Chapter 12","content":"\u0026nbsp;Ganymede. \n\u003cdiv\u003e\n After the landing, an unreasoning fear gripped Steve tightly. It wasn\u0027t anything he could put his finger on, but he felt it gnawing at the fringes of his mind, probing, seeking, thrusting for a way in. There was nothing to be afraid of, and Steve smoked one cigarette after another while the six-man parties disembarked to take up their beater-stations on the edges of the square.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ganymede, he recited to himself, is the largest satellite in the Solar System. 664,200 miles from Jupiter, it has a diameter of thirty two hundred and six miles, or bigger than the planet Mercury and almost as large as Pluto. It swings around Jupiter in a little over seven Earth days and in appearance the moonscape\u0027s enough like Luna to be a twin-brother, except for fat, bloated Jupiter hanging in the sky.\n\u003c/div\u003e \n\u003cdiv\u003e\n What was there to be afraid of? Steve didn\u0027t know. His brother had died on Ganymede—and the circumstances of Charlie\u0027s death still bordered on the mysterious. Well, he\u0027d see for himself about that. Did the fear crawl around the edges of his brain because he thought Teejay was responsible? But that didn\u0027t make sense, for to a certain degree he\u0027d thought that all along. Unless the appalling thought of having to fight Teejay and her whole loyal crew had taken hold of him unconsciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you moping about, boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Huh? Oh, Kevin. Nothing much, I guess. I—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You look to me like you\u0027ve seen a ghost. What is it, scared?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yeah. Yeah, I guess so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So what? Buck up, boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t want to be scared, Kevin.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who does?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s not what I mean. It\u0027s one thing to say that if you aren\u0027t—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who isn\u0027t? Don\u0027t look at me, boy. And didn\u0027t you watch all the men trooping outside with the blood drained from their faces, and their eyes sort of big and too bright behind the face-plates? We\u0027re all scared.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But why?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mean to say you spent so much time on zoology and forgot about other things? Like, for instance, Ganymede-fear?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Huh? How\u0027s that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Everyone is afraid, Steve. Everyone. Whenever a man gets near Ganymede, he suddenly becomes afraid. It\u0027s some sort of a psychological or maybe para-psychological phenomenon and none of the medicos could ever figure it out. It isn\u0027t the kind of fear that paralyzes, boy, but still, it holds on all the time a man\u0027s on Ganymede and it doesn\u0027t leave until he blasts off again. Didn\u0027t you ever hear about that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. That is, I knew it happened somewhere, but I forgot where.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, that\u0027s all there is to it, boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All! Don\u0027t you think it\u0027s enough? Something lurks out there, something makes people afraid, and we\u0027ve never been able to find out why, but you say—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Teejay came up and smiled at them, but there was something grim about her smile. \"You can always tell when someone comes to Ganymede for the first time. He\u0027s jumpier. Just relax, Stedman. By the time they start beating the anthrovacs in toward the Gordak you\u0027ll be feeling better—and raring to go to work with that oxygen-jag stunt of yours, too.\" And she added, \"Say, have you been watching your stone worm?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He sure has,\" Kevin told her. \"He took me down there yesterday and that worm\u0027s been growing fat on all the sand he\u0027s fed it. Sand—for food, that\u0027s what the worm eats. Imagine how that would settle the over-population problems on Earth if people, too, could eat sand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, and then—\" Teejay was speaking again—but words, just words, and Steve stopped listening. It occurred to him all at once that they were engrossed in their meaningless conversation for one reason only—to keep the fear from their minds. If you thought about something else, the fear would retreat at least in part, and if you could hold a conversation about everything and nothing, that was even better.\n\u003c/div\u003e \n\u003cdiv\u003e\n Steve almost jumped off the floor when a metallic voice blared forth from the loudspeaker, echoing and re-echoing in the near-empty room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Captain! Captain, this is Moretti, Group Seven.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go ahead, Moretti,\" Teejay said into the mike. \"I\u0027m listening.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who the devil\u0027s on radar, Captain?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why—no one! We forgot.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s a ship coming down. We can see it plain as day out here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What ship?\" Teejay asked softly, but they all knew the question was totally unnecessary.\n\u003c/div\u003e \n\u003cdiv\u003e\n Moretti\u0027s voice jumped an octave as he cried: \"It\u0027s Barling!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2816/77852.html","bookId":499,"creation":"Aug 2, 2019 4:38:41 AM","modification":"Aug 2, 2019 4:38:41 AM"}
