{"id":12373,"no":25,"title":"Chapter 25","content":"\u0026nbsp;They stood on a flat, grassy plain which stretched halfway to the horizon and then began to undulate into low hills. And far off, shrouded by purple mists, a range of mountains loomed distantly. \n\u003cdiv\u003e\n Purple mist; a purplish cast to the sky; a fiercely bright blue sun. \"What world is this?\" said Kevin.\n\u003c/div\u003e \n\u003cdiv\u003e\n The crew of the Frank Buck—a hundred men—stood in a long, thin file outside the ship. They\u0027d balked at first, but silently, the three anthrovacs had ferreted them out with their neutron guns, never uttering a sound, merely motioning with the weapons. Of the other animals Steve saw nothing, but within the corridors of the Frank Buck he\u0027d encountered a sand crawler and a desert cat, both dead.\n\u003c/div\u003e \n\u003cdiv\u003e\n The seconds fled, became minutes. When half an hour had passed, the crew became restless and some of them ambled off on the grassy plain until one of the anthrovacs herded them back. The Frank Buck\u0027s Exec, a short, wiry man, strode within the ship and came out a few moments later, scratching his head. \"I can\u0027t understand it,\" he said. \"None of the instruments work. I thought we could just pile back into the ship and blast off, but apparently someone has other ideas.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Someone did.\n\u003c/div\u003e \n\u003cdiv\u003e\n Someone came striding across the plain, a small dot of a figure at first. He came closer.\n\u003c/div\u003e \n\u003cdiv\u003e\n Steve ignored the anthrovacs, ran forward. \"Charlie!\" he cried. \"Charlie!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The man was shorter than Steve, and stockier. His eyes searched Steve\u0027s face briefly, and he said: \"Should I know you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Should you! I\u0027m your brother!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Interesting, but quite impossible.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The words hardly registered, and Steve babbled on, \"We thought you were dead. It was Teejay here who reported back to Earth saying you\u0027d died on Ganymede. Now you\u0027re alive and—\" Abruptly he whirled, turned to Teejay. \"You lied, damn you! Here\u0027s Charlie, see? Charlie was never dead. But you said—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I said Charlie was dead.\" The woman met his gaze levelly. \"He was. I know a dead man when I see one. He was dead.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But nothing. I don\u0027t know who this is. I can\u0027t explain it. That has nothing to do with what happened on Ganymede years ago.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes? Then what did happen? Why did Charlie write once that you must have been spawned in hell? You never did want to tell me what happened on Ganymede, did you? Maybe Charlie can.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is my name, Charlie Stedman. It is the name this body has always had, although when I do not inhabit it I assure you I am not Charlie Stedman,\" the stocky man said. \"You see, the original inhabitant of the garment—the body—was destroyed. The name applied to the body as well as the inhabiting mind. The language remained engraved in the brain cells, and impersonal parts of the memory, too. In that sense, I am Charlie Stedman. Does it satisfy you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hell, no,\" said Steve, bewildered. Mystery had been piled upon mystery, with no solution in sight. And grim confusion turned to grimmer anger as he faced Teejay once more. \"All right, start talking. Just how did you find Charlie? And what made him hate you like that? Talk, damn you!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Okay, I will. But I don\u0027t know why Charlie hated me, and that\u0027s the truth. I only met him once or twice and—unless it was Schuyler here. Hey, Schuyler!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Barling joined them. \"What do you want?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Answer this question: do you make a practise of poisoning the minds of your crew against me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I don\u0027t know what you mean by poi—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Teejay grabbed a handful of his shirt and twisted, constricting the collar about his throat. \"Answer me,\" she said. \"And no run around.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I guess so. It\u0027s only business, Captain Moore. The more they hated you, the more they\u0027d be willing to fight you in the hunt every step of the way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How about Charlie Stedman?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t remember. Probably, it was like that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Teejay flung him away from her. \"Does that satisfy you, Steve?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"For that part, yes. But what about the rest of it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not much to tell. I was out alone on Ganymede, a few miles from the ship. I thought I heard voices, sort of inside my head. I went forward to explore, just like you did, and also like you, I almost didn\u0027t have enough air to get back. Especially since I found your brother on the way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And he was dead?\" As he spoke, Steve looked at his brother, standing right there in front of him, and wondered if anyone ever asked a more impossible question.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. He was dead. I don\u0027t know how he died, but I placed my ear against the chest of his vac-suit. The heart-beat is amplified through it, you know. But there wasn\u0027t any. After that, I ran back to the Gordak, and I had barely enough air to make it. I reported Charlie\u0027s death, of course.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Charlie\u0027s death. Well, she sounded sincere. But there was Charlie, standing two paces to her right and apparently listening to an account of his own demise.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2816/77865.html","bookId":499,"creation":"Aug 2, 2019 4:39:19 AM","modification":"Aug 2, 2019 4:39:19 AM"}
