{"id":12383,"no":35,"title":"Chapter 35","content":"\u0026nbsp;The days followed each other in a slow, tortuous procession. Nothing seemed to satiate the parasite, for each day it strove for new emotions, and after a time Steve learned he could frustrate it by regarding everything as unreal, imaginative, non-existent. \n\u003cdiv\u003e\n Sometimes, the guest slept when the host did not. At such times, Steve found, he had freedom of a sort. His field of action was not circumscribed in any way except that violent activity would awaken the parasite. Steve toyed with his freedom, timorously at first, then grew more confident. He played with it, basked in it after steady days of control. He even discovered he could use the telepathic abilities of his uninvited mental guest.\n\u003c/div\u003e \n\u003cdiv\u003e\n He missed Teejay, wondered about her, longed for her. His astonishment was so extreme when he first heard her voice within his head that he almost awakened the parasite.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Steve? Steve, is that you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Teejay—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve been trying to reach you. When these creatures sleep, we can use their minds.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you\u0027re all right?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m as all right as can be expected, Steve. But they\u0027ve been running me through all sorts of emotional mazes. My clothing is torn and they don\u0027t care about it. My skin is torn and bruised. They don\u0027t care about that, either. They\u0027ll run us down. Did you notice all the other creatures here? Some of their bones are broken—if they have bones—and they\u0027ve never been set. They\u0027re bruised and bloody and infected and the parasites don\u0027t care! Why should they, they can get new bodies? But Steve—oh, Steve, I\u0027ve never felt so unclean in all my life and it\u0027s just as if I\u0027ve been defiled and—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take it easy, Teejay. Thinking like that won\u0027t help.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hate them. Oh, I hate them. I—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Listen. I want you to concentrate like that. Hate weakens them. Remember how the animals aboard the Frank Buck died? Well, since our emotions are so much stronger than the parasites, maybe, maybe—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You mean it could work in reverse?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You want me to try, darling?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes—no! We can\u0027t do it now. If it works, we\u0027d still be leaving a hundred men here. They\u0027re doomed, Teejay. We\u0027re all doomed unless we can do something about it, and soon. But at night they sleep. Yeah, they sleep at night! If we can contact the others, and make a concentrated effort of it, using the telepathic powers of the parasites—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shh! That\u0027s enough, Steve. My friend here is getting up. I can feel him stirring inside my head. Shh, later!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n At the end, hope had made Teejay her old spunky self again. But when Steve\u0027s own master awakened, that hope seemed mighty slim indeed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Each night they managed to contact two or three of the others, and the word was supposed to be passed on. Finally, it was arranged. The night for action was decided upon, and for some few of them it would be a gamble, for there was no guarantee that all the parasites would be asleep. Once the attempt was made, however, there would be no turning back. Whoever was left behind—was left behind.\n\u003c/div\u003e \n\u003cdiv\u003e\n Provided the plan worked at all.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2816/77875.html","bookId":499,"creation":"Aug 2, 2019 4:39:50 AM","modification":"Aug 2, 2019 4:39:50 AM"}
