{"id":12352,"no":4,"title":"Chapter 4","content":"\u0026nbsp; Someone tapped Steve\u0027s shoulder. Startled, he whirled around. A woman stood there, just behind him, staring at him insolently. She was tall, as tall as Steve himself, with her close-cropped blond hair peeking out around the edges of a black cap. She wore what looked to Steve like a glossy black Martian sand-cape which she let fall straight down behind her so that it almost brushed the floor. Under it, she wore a brief pair of shorts, also black, and a halter. She was muscular in that lithe, feminine way which had grown so popular in the twenty-second century—the century which had finally seen women come abreast of men in all sporting activities and surpass them in some which required special grace and lithe-limbed skill. \n\u003cdiv\u003e\n \"I hope you found whatever you\u0027re looking for,\" she said. She spoke with a complete lack of warmth which startled Steve for the second time in a few moments.\n\u003c/div\u003e \n\u003cdiv\u003e\n She was a beautiful woman, he realized, but she looked so completely incongruous among the coveralled men that Steve found himself whistling softly. \"I never expected to find a girl here,\" he admitted. \"Not on this expedition.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter, are you old fashioned? This is the twenty-second century, the enlightened century, remember? There\u0027s nothing a girl can\u0027t do if she sets her mind to it. A recent survey shows that forty-percent of the homemakers in the U.S.N.A. are men, sixty percent women. Okay, it\u0027s only logical that some of the remaining forty percent of females have some tough jobs, too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I read the books of the feminist movement,\" Steve assured her. \"But it\u0027s going to take a lot to convince me of that. Me and a lot of other people, I suspect.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that so, Mr. Smart-guy? Are you a member of the expedition?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, anytime you want to hustle down to the gym with me and go a few rounds, let me know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you serious?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course I\u0027m serious.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" Steve said, deciding to change the subject and feeling utterly ridiculous about the whole conversation, \"let\u0027s forget it. I was looking for T. J. Moore.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The woman smiled coldly. \"That\u0027s me. I\u0027m T. J. What do you want?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—uh—what? You\u0027re T. J.? You—a girl?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you please hurry with whatever you want to tell me? I haven\u0027t got all day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My name\u0027s Stedman.\" Steve felt his composure returning. The fact that T. J. Moore was a woman didn\u0027t make any difference. But unconsciously, Steve regarded her as a member of the weaker sex, and a large chunk of her fearsome reputation vanished because of it. \"I wonder, if Mr. Carmical contacted you—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He sure did, Stedman.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good, then we can—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe you think it\u0027s good. I think it stinks. Listen, Stedman, maybe you think you can pull the wool over my eyes like you did over Brody Carmical—but you can\u0027t. He didn\u0027t recognize your name, I did. No kid brother of Charlie Stedman\u0027s going to make trouble for me because he thinks I was responsible for his brother\u0027s death.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t say—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You didn\u0027t have to say. I can see it in your face. But get this straight, Stedman. Your brother died on Ganymede three years ago—of natural causes, that is, if you can call some of the local fauna \u0027natural causes\u0027. He worked for Barling Brothers Interplanetary, so I guess the rivalry between them and us didn\u0027t help. But no one killed him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t say—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that all you can say, \u0027you didn\u0027t say?\u0027 Try to tell me why you came aboard the Gordak; go ahead, try.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m an expert in Extra-terrestrial zoology, and you needed one. Mr. Carmical hired me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know that. But I guess I also know a thing or two which Brody Carmical doesn\u0027t. All right, Stedman. You come as far as Mercury. But one slip, just one slip—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Okay, T. J.,\" Steve said, almost jauntily. \"I\u0027ll watch my step.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m the Gordak\u0027s captain. You\u0027ll call me that. Captain—is it clear?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" said Steve, and laughed. The ten-world junket would be a hard, driving, gruelling ordeal come what might, and he wouldn\u0027t kowtow to T. J. Moore, male or female, here at the beginning. \"No,\" he said again, forcing the laughter out. \"This isn\u0027t a military ship, so you won\u0027t impose any arbitrary discipline on me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The woman laughed too, but it was more effective. \"I won\u0027t, won\u0027t I? Once we leave Earth, Stedman, everything we do is dangerous. Everything. I\u0027ve got to have full authority, every order obeyed at the drop of a hat. Understand?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The woman removed the black cap from her head, and Steve noticed, not without surprise, that her pale blond hair wasn\u0027t close-cropped after all. It had been piled up inside the cap, and now it spilled down loosely about her shoulders. Smiling, she dropped the cap to the floor. \"Pick it up,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you kidding? I\u0027m an expert on Extra-terrestrial zoology. That\u0027s what Mr. Carmical hired me for. If you want that hat picked up, better do it yourself.\" Vaguely, Steve wondered if Charlie had met the woman those final days on far Ganymede, had fought with her tooth and nail for some priceless specimen—and lost, with no witness but the bleak, desolate topography of the Jovian moon.\n\u003c/div\u003e \n\u003cdiv\u003e\n The woman turned away from him, called: \"LeClarc! LeClarc, come here.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2816/77844.html","bookId":499,"creation":"Aug 2, 2019 4:38:19 AM","modification":"Aug 2, 2019 4:38:19 AM"}
