{"id":63226,"no":14,"title":"Page 14","content":"\u003cp\u003eIn a daze, I watched Cross\u0027s body lower to mine, my legs sliding apart to accommodate the width of his hips. My muscles strained with the urge to lift toward him, to hasten the contact between us that I\u0027d been craving since I first laid eyes on him. Lowering his head, he took my mouth again, bruising my lips with a fine edge of violence.\u003c/p\u003e\n\u003cp\u003eAbruptly, he yanked himself away, stumbling to his feet.\u003c/p\u003e\n\u003cp\u003eI lay there gasping and wet, so willing and ready. Then I realized why he\u0027d reacted so fiercely.\u003c/p\u003e\n\u003cp\u003eSomeone was behind him.\u003c/p\u003e\n\u003cp\u003eChapter 4\u003c/p\u003e\n\u003cp\u003eMortified by the sudden intrusion into our privacy, I scrambled up and back into the armrest, yanking down my skirt.\u003c/p\u003e\n\u003cp\u003e\"...two o\u0027clock appointment is here.\"\u003c/p\u003e\n\u003cp\u003eIt took an endless moment to realize Cross and I were still alone in the room, that the voice I\u0027d heard had come through a speaker. Cross stood at the far end of the sofa, flushed and scowling, his chest heaving. His tie was loosened and the fly of his slacks strained against a very impressive erection.\u003c/p\u003e\n\u003cp\u003eI had a nightmare vision in my head of what I must look like. And I was late getting back to work.\u003c/p\u003e\n\u003cp\u003e\"Christ.\" He shoved both hands through his hair. \"It\u0027s the middle of the f**king day. In my goddamn f**king office!\"\u003c/p\u003e\n\u003cp\u003eI got to my feet and tried to straighten my appearance.\u003c/p\u003e\n\u003cp\u003e\"Here.\" He came to me, yanking my skirt up again.\u003c/p\u003e\n\u003cp\u003eFurious at what I\u0027d almost let happen when I should be at work, I smacked at his hands. \"Stop it. Leave me alone.\"\u003c/p\u003e\n\u003cp\u003e\"Shut up, Eva,\" he said grimly, catching the hem of my black silk blouse and tugging it into place, adjusting it so that the buttons once again formed a straight row between my br**sts. Then he pulled down my skirt, smoothing it with calm, expert hands. \"Fix your ponytail.\"\u003c/p\u003e\n\u003cp\u003eCross retrieved his coat, shrugging into it before adjusting his tie. We reached the door at the same time and when I crouched to fetch my purse, he lowered with me.\u003c/p\u003e\n\u003cp\u003eHe caught my chin, forcing me to look at him. \"Hey,\" he said softly. \"You okay?\"\u003c/p\u003e\n\u003cp\u003eMy throat burned. I was aroused and mad and thoroughly embarrassed. I\u0027d never in my life lost my mind like that. And I hated that I\u0027d done so with him, a man whose approach to sexual intimacy was so clinical it depressed me just thinking about it.\u003c/p\u003e\n\u003cp\u003eI jerked my chin away. \"Do I look okay?\"\u003c/p\u003e\n\u003cp\u003e\"You look beautiful and f**kable. I want you so badly it hurts. I\u0027m dangerously close to taking you back to the couch and making you come \u0027til you beg me to stop.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t accuse you of being silver-tongued,\" I muttered, aware that I wasn\u0027t offended. In fact, the rawness of his hunger for me was a serious aphrodisiac. Clutching the strap of my purse, I stood on shaky legs. I needed to get away from him. And, when my workday was done, I needed to be alone with a big glass of wine.\u003c/p\u003e\n\u003cp\u003eCross stood with me. \"I\u0027ll be done by five. I\u0027ll come get you then.\"\u003c/p\u003e\n\u003cp\u003e\"No, you won\u0027t. This doesn\u0027t change anything.\"\u003c/p\u003e\n\u003cp\u003e\"The hell it doesn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be arrogant, Cross. I lost my head for a second, but I still don\u0027t want what you want.\"\u003c/p\u003e\n\u003cp\u003eHis fingers curled around the door handle. \"Yes, you do. You just don\u0027t want it the way I want to give it to you. So, we\u0027ll revisit and revise.\"\u003c/p\u003e\n\u003cp\u003eMore business. Cut-and-dried. My spine stiffened.\u003c/p\u003e\n\u003cp\u003eI set my hand over his and yanked on the handle, ducking under his arm to squeeze out the door. His secretary shoved quickly to his feet, gaping, as did the woman and two men who were waiting for Cross. I heard him speak behind me.\u003c/p\u003e\n\u003cp\u003e\"Scott will show you into my office. I\u0027ll be just a moment.\"\u003c/p\u003e\n\u003cp\u003eHe caught me by reception, his arm crossing my lower back to grip my hip. Not wanting to make a scene, I waited until we were by the elevators to pull away.\u003c/p\u003e\n\u003cp\u003eHe stood calmly and hit the call button. \"Five o\u0027clock, Eva.\"\u003c/p\u003e\n\u003cp\u003eI stared at the lighted button. \"I\u0027m busy.\"\u003c/p\u003e\n\u003cp\u003e\"Tomorrow, then.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m busy all weekend.\"\u003c/p\u003e\n\u003cp\u003eStepping in front of me, he asked tightly, \"With whom?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s none of your - \"\u003c/p\u003e\n\u003cp\u003eHis hand covered my mouth. \"Don\u0027t. Tell me when, then. And before you say never, take a good look at me and tell me if you see a man who\u0027s easily deterred.\"\u003c/p\u003e\n\u003cp\u003eHis face was hard, his gaze narrowed and determined. I shivered. I wasn\u0027t sure I\u0027d win a battle of wills with Gideon Cross.\u003c/p\u003e\n\u003cp\u003eSwallowing, I waited until he lowered his hand and said, \"I think we both need to cool off. Take a couple days to think.\"\u003c/p\u003e\n\u003cp\u003eHe persisted. \"Monday after work.\"\u003c/p\u003e\n\u003cp\u003eThe elevator arrived and I stepped into it. Facing him, I countered, \"Monday lunch.\"\u003c/p\u003e\n\u003cp\u003eWe\u0027d have only an hour, a guaranteed escape.\u003c/p\u003e\n\u003cp\u003eJust before the doors closed, he said, \"We\u0027re going to happen, Eva.\"\u003c/p\u003e\n\u003cp\u003eIt sounded as much like a threat as a promise.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t sweat it, Eva,\" Mark said, when I arrived at my desk nearly a quarter after two. \"You didn\u0027t miss anything. I had a late lunch with Mr. Leaman. I just barely got back myself.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" No matter what he said, I still felt terrible. My kick-ass Friday morning seemed to have happened days ago.\u003c/p\u003e\n\u003cp\u003eWe worked steadily until five, discussing a fast-food client and contemplating some possible tweaks to ad copy for a chain of organic grocery stores.\u003c/p\u003e\n\u003cp\u003e\"Talk about strange bedfellows,\" Mark had teased, not knowing how apt that was in regard to my personal life.\u003c/p\u003e\n\u003cp\u003eI\u0027d just shut down my computer and was pulling my purse out of the drawer when my phone rang. I glanced at the clock, saw it was exactly five, and considered ignoring the call because I was technically done for the day.\u003c/p\u003e\n\u003cp\u003eBut since I was still feeling shitty about my overly-long lunch, I considered it penance and answered. \"Mark Garrity\u0027s - \" \u003c/p\u003e","sourceLink":"https://allnovel.net/bared-to-you-crossfire-1/page-14.html","bookId":1922,"creation":"Oct 5, 2019 9:50:35 AM","modification":"Oct 5, 2019 9:50:35 AM"}
