{"id":63244,"no":32,"title":"Page 32","content":"\u003cp\u003e\"Yeah, I did.\" And I got riled up just thinking about it. We\u0027d connected. I knew it. I\u0027d wanted him more than anything last night, and today I wanted nothing to do with him ever again. \"It was intense. The best sexual experience of my life, and he was right there with me. I know he was. First time he\u0027d ever made it in a car, and he was kind of resistant at first, but then I got him so hot for it he couldn\u0027t say no.\"\u003c/p\u003e\n\u003cp\u003e\"Really? Never?\" He ran a hand over his morning stubble. \"Most guys scratch car banging off their f**k list in high school. In fact, I can\u0027t think of anyone who didn\u0027t, except for the nerds and fuglies, and he\u0027s neither.\"\u003c/p\u003e\n\u003cp\u003eI shrugged. \"I guess car banging makes me a slut.\"\u003c/p\u003e\n\u003cp\u003eCary grew very still. \"Is that what he said?\"\u003c/p\u003e\n\u003cp\u003e\"No. He didn\u0027t say shit. I got that from his \u0027friend,\u0027 Magdalene. You know that chick in most of the photos you printed off the Internet? She decided to sharpen her claws with a little catty girl chat in the bathroom.\"\u003c/p\u003e\n\u003cp\u003e\"The bitch is jealous.\"\u003c/p\u003e\n\u003cp\u003e\"Sexual frustration. She can\u0027t f**k him, because apparently girls who f**k him go into the discard pile.\"\u003c/p\u003e\n\u003cp\u003e\"Did he say that?\" Again, fury laced his quiet question.\u003c/p\u003e\n\u003cp\u003e\"Not in so many words. He said he doesn\u0027t sleep with his female friends. He\u0027s got issues with women wanting more than a good time in the sack, so he keeps the women he bangs and the women he hangs out with in two separate camps.\" I took another sip of my coffee. \"I warned him that sort of setup wasn\u0027t going to work for me and he said he\u0027d make some adjustments, but I guess he\u0027s one of those guys who\u0027ll say whatever\u0027s necessary to get what he wants.\"\u003c/p\u003e\n\u003cp\u003e\"Or else you have him running scared.\"\u003c/p\u003e\n\u003cp\u003eI glared. \"Don\u0027t make excuses for him. Whose side are you on, anyway?\"\u003c/p\u003e\n\u003cp\u003e\"Yours, baby girl.\" He reached out and patted my knee. \"Always yours.\"\u003c/p\u003e\n\u003cp\u003eI wrapped my hand around his muscular forearm and stroked my fingers gently along the underside in silent gratitude. I couldn\u0027t feel the multitude of fine white scars from cutting that marred his skin, but I never forgot they were there. I was thankful every day that he was alive, healthy, and a vital part of my life. \"How\u0027d your night go?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t complain.\" His eyes took on a mischievous glint. \"I shagged that busty blonde in a maintenance closet. Her tits were real.\"\u003c/p\u003e\n\u003cp\u003e\"Well, then.\" I smiled. \"You made her night, I\u0027m sure.\"\u003c/p\u003e\n\u003cp\u003e\"I try.\" He picked up the phone receiver and winked at me. \"What kind of delivery do you want? Subs? Chinese? Indian?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not hungry.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re always hungry. If you don\u0027t pick something, I\u0027ll cook and you\u0027ll have to eat that.\"\u003c/p\u003e\n\u003cp\u003eI lifted my hand in surrender. \"Okay, okay. You pick.\"\u003c/p\u003e\n\u003cp\u003eI got to work twenty minutes early on Monday, figuring I\u0027d skip running into Gideon. When I reached my desk without incident, I felt such relief that I knew I was in serious trouble where he was concerned. My moods were shifting all over the place.\u003c/p\u003e\n\u003cp\u003eMark arrived in high spirits, still floating from his major successes of the week before, and we dug right into work. I\u0027d done some vodka market comparisons on Sunday and he was kind enough to go over those with me and listen to my impressions. Mark was also assigned the account for a new e-reader manufacturer, so we began the initial work on that.\u003c/p\u003e\n\u003cp\u003eWith such a busy morning, time flew swiftly and I didn\u0027t have time to think about my personal life. I was really grateful for that. Then I answered the phone and heard Gideon on the line. I wasn\u0027t prepared.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s your Monday been so far?\" he asked, his voice sending a shiver of awareness through me.\u003c/p\u003e\n\u003cp\u003e\"Hectic.\" I glanced at the clock and was startled to see it was twenty minutes to noon.\u003c/p\u003e\n\u003cp\u003e\"Good.\" There was a pause. \"I tried calling you yesterday. I left a couple messages. I wanted to hear your voice.\"\u003c/p\u003e\n\u003cp\u003eMy eyes closed on a deep breath. It had taken every bit of my willpower to make it through the day without listening to the voice mail. I\u0027d even enlisted Cary in the cause, telling him to restrain me forcibly if it looked like I might succumb to the urge. \"I did the hermit thing and worked a little.\"\u003c/p\u003e\n\u003cp\u003e\"Did you get the flowers I sent?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. They\u0027re lovely. Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"They reminded me of your dress.\"\u003c/p\u003e\n\u003cp\u003eWhat the hell was he doing? I was beginning to think he had multiple personality disorder. \"Some women might say that\u0027s romantic.\"\u003c/p\u003e\n\u003cp\u003e\"I only care what you say.\" His chair creaked as if he\u0027d pushed to his feet. \"I thought about stopping by...I wanted to.\"\u003c/p\u003e\n\u003cp\u003eI sighed, surrendering to my confusion. \"I\u0027m glad you didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eThere was another long pause. \"I deserved that.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t say it to be a bitch. It\u0027s just the truth.\"\u003c/p\u003e\n\u003cp\u003e\"I know. Listen...I arranged for lunch up here in my office so we don\u0027t waste any of the hour leaving and getting back.\"\u003c/p\u003e\n\u003cp\u003eAfter his parting, I\u0027ll call you, I\u0027d wondered if he would want to get together again after he settled down from whatever trip he\u0027d been on. It was a possibility I\u0027d been dreading since Saturday night, aware that I needed to cut him off, but feeling strung out from the desire to be with him. I wanted to experience again that pure, perfect moment of intimacy we\u0027d shared.\u003c/p\u003e\n\u003cp\u003eBut I couldn\u0027t justify that one moment against all the other moments when he made me feel like crap.\u003c/p\u003e\n\u003cp\u003e\"Gideon, we don\u0027t have any reason to have lunch together. We hashed things out Friday night, and we...took care of business Saturday. Let\u0027s just leave it at that.\"\u003c/p\u003e\n\u003cp\u003e\"Eva.\" His voice turned gruff. \"I know I f**ked up. Let me explain.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to. It\u0027s okay.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/bared-to-you-crossfire-1/page-32.html","bookId":1922,"creation":"Oct 5, 2019 9:50:35 AM","modification":"Oct 5, 2019 9:50:35 AM"}
