{"id":63276,"no":64,"title":"Page 64","content":"\u003cp\u003eHe caught me looking at it. \"What? You still don\u0027t like my tie? I think it works well with the emo jeans and my lounge lizard jacket.\"\u003c/p\u003e\n\u003cp\u003e\"Cary\" - my lips quirked - \"you can wear anything.\"\u003c/p\u003e\n\u003cp\u003eIt was true. Cary could pull any look off, a benefit of having a sculpted rangy body and a face that could make angels weep.\u003c/p\u003e\n\u003cp\u003eI set my hand over his restless fingers. \"Are you nervous?\"\u003c/p\u003e\n\u003cp\u003e\"Trey didn\u0027t call last night,\" he muttered. \"He said he would.\"\u003c/p\u003e\n\u003cp\u003eI gave his hand a reassuring squeeze. \"It\u0027s just one missed call, Cary. I\u0027m sure it doesn\u0027t mean anything serious.\"\u003c/p\u003e\n\u003cp\u003e\"He could\u0027ve called this morning,\" he argued. \"Trey\u0027s not flakey like the others I\u0027ve dated. He wouldn\u0027t have forgotten to call, which means he just doesn\u0027t want to.\"\u003c/p\u003e\n\u003cp\u003e\"The rat bastard. I\u0027ll be sure to take lots of pictures of you having a great time looking sexy, classy, and cool to torment him with on Monday.\"\u003c/p\u003e\n\u003cp\u003eHis mouth twitched. \"Ah, the deviousness of the female mind. It\u0027s a shame Cross won\u0027t see you today. I think I got a semi when you came out of your room in that dress.\"\u003c/p\u003e\n\u003cp\u003e\"Eww!\" I smacked his shoulder and mock-glared when he laughed.\u003c/p\u003e\n\u003cp\u003eThe dress had seemed perfect to both of us when we\u0027d found it. It was cut in a classic garden party style - fitted bodice with a knee-length skirt that flared out from the waist. It was even white with flowers. But that\u0027s where the tea-and-crumpets style ended.\u003c/p\u003e\n\u003cp\u003eThe edginess came from the strapless form, the alternating layers of black and crimson satin underskirts that gave it volume, and the black leather flowers that looked like wicked pinwheels. Cary had picked the red Jimmy Choo peep-toe pumps out of my closet and the ruby drop earrings to give it all the finishing touch. We\u0027d decided to leave my hair loose around my shoulders, in case we arrived and learned that hats were required. All in all, I felt pretty and confident.\u003c/p\u003e\n\u003cp\u003eClancy drove us through an imposing set of monogrammed gates and turned into a circular driveway, following the direction of a valet. Cary and I got out by the entrance, and he took my arm as my heels sank into blue-gray gravel on the walk to the house.\u003c/p\u003e\n\u003cp\u003eUpon entering the Vidal\u0027s sprawling Tudor-style mansion, we were warmly greeted by Gideon\u0027s family in a receiving line - his mother, stepfather, Christopher, and their sister.\u003c/p\u003e\n\u003cp\u003eI took in the sight, thinking the Vidal family could only look more perfect if Gideon was lined up with them. His mother and sister had his coloring, both women boasting the same glossy obsidian hair and thickly-lashed blue eyes. They were both beautiful in a finely wrought way.\u003c/p\u003e\n\u003cp\u003e\"Eva!\" Gideon\u0027s mother drew me toward her, then air-kissed both of my cheeks. \"I\u0027m so pleased to finally meet you. What a gorgeous girl you are! And your dress. I love it.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eHer hands brushed over my hair, cupped my face, and then slid down my arms. It was hard for me to bear it, because touching was sometimes an anxiety trigger for me when the person was a stranger. \"Your hair, is it naturally blond?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I replied, startled and confused by the question. Who asked a question like that of a stranger?\u003c/p\u003e\n\u003cp\u003e\"How fascinating. Well, welcome. I hope you have a wonderful time. We\u0027re so glad you could make it.\"\u003c/p\u003e\n\u003cp\u003eFeeling strangely unsettled, I was grateful when her attention moved to Cary and zeroed in.\u003c/p\u003e\n\u003cp\u003e\"And you must be Cary,\" she crooned. \"Here I\u0027d been certain my two boys were the most attractive in the world. I see I was wrong about that. You are simply divine, young man.\"\u003c/p\u003e\n\u003cp\u003eCary flashed his megawatt smile. \"Ah, I think I\u0027m in love, Mrs. Vidal.\"\u003c/p\u003e\n\u003cp\u003eShe laughed with throaty delight. \"Please. Call me Elizabeth. Or Lizzie, if you\u0027re brave enough.\"\u003c/p\u003e\n\u003cp\u003eLooking away, I found my hand clasped by Christopher Vidal Senior. In many ways, he reminded me of his son, with his slate green eyes and boyish smile. In others, he was a pleasant surprise. Dressed in khakis, loafers, and a cashmere cardigan, he looked more like a college professor than a music company executive.\u003c/p\u003e\n\u003cp\u003e\"Eva. May I call you Eva?\"\u003c/p\u003e\n\u003cp\u003e\"Please do.\"\u003c/p\u003e\n\u003cp\u003e\"Call me Chris. It makes it a little easier to distinguish between me and Christopher.\" His head tilted to the side as he contemplated me through quirky brass spectacles. \"I can see why Gideon is so taken with you. Your eyes are a stormy gray, yet they\u0027re so clear and direct. Quite the most beautiful eyes I think I\u0027ve ever seen, aside from my wife\u0027s.\"\u003c/p\u003e\n\u003cp\u003eI flushed. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Is Gideon coming?\"\u003c/p\u003e\n\u003cp\u003e\"Not that I\u0027m aware of.\" Why didn\u0027t his parents know the answer to that question?\u003c/p\u003e\n\u003cp\u003e\"We always hope.\" He gestured at a waiting servant. \"Please head back to the gardens and make yourself at home.\"\u003c/p\u003e\n\u003cp\u003eChristopher greeted me with a hug and a kiss on the cheek, while Gideon\u0027s sister Ireland sized me up in a sulky way that only a teenager could pull off. \"You\u0027re a blonde,\" she said.\u003c/p\u003e\n\u003cp\u003eJeez. Was Gideon\u0027s preference for dark-haired women a damn law or something? \"And you\u0027re a very lovely brunette.\"\u003c/p\u003e\n\u003cp\u003eCary offered me his arm and I accepted it gratefully.\u003c/p\u003e\n\u003cp\u003eAs we walked away, he asked me quietly, \"Were they what you expected?\"\u003c/p\u003e\n\u003cp\u003e\"His mom, maybe. His stepdad, no.\" I looked back over my shoulder, taking in the elegant floor-length cream sheath dress that clung to Elizabeth Vidal\u0027s svelte figure. I thought of what little I knew about Gideon\u0027s family. \"How does a boy grow up to be a businessman who takes over his stepfather\u0027s family business?\"\u003c/p\u003e\n\u003cp\u003e\"Cross owns shares in Vidal Records?\"\u003c/p\u003e\n\u003cp\u003e\"Controlling interest.\"\u003c/p\u003e\n\u003cp\u003e\"Hmm. Maybe it was a bailout?\" he offered. \"A helping hand during a trying time for the music industry?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/bared-to-you-crossfire-1/page-64.html","bookId":1922,"creation":"Oct 5, 2019 9:50:35 AM","modification":"Oct 5, 2019 9:50:35 AM"}
