{"id":85401,"no":13,"title":"Page 13","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCole had told me he had a presentation for English the next day, so I didn’t want to interrupt his work by asking him to make dinner. Instead, I texted him earlier in the day and told him I’d bring him home a bag of fish and chips. I got Mum a haggis supper just in case she felt like eating. I hurried home with the dinner since I’d bought it from a shop on Leith Walk and didn’t want it to get cold. As soon as I got in the door, I headed for the kitchen, switching on the kettle and pulling out plates.\u003c/p\u003e\n\u003cp\u003eCole appeared in the doorway, his hungry eyes fixated on the fish and chips bag. ‘Can I help?’\u003c/p\u003e\n\u003cp\u003e‘Tell Mum I got her a haggis supper if she feels like coming out into the living room to eat with us.’\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed at my request, but he did as he was told. After that he sat himself down on the floor at the coffee table and waited for his food, switching the television to a comedy show.\u003c/p\u003e\n\u003cp\u003eI had just put the dinner out on the table, along with a glass of juice for Cole, tea for me, and water for Mum, when she appeared. The dark grey long johns she wore were actually loose on her, and she shuffled towards us as though she was in pain. She probably was.\u003c/p\u003e\n\u003cp\u003eShe sat down on the edge of the couch, the bruised circles under her eyes so prominent I could barely take in anything else. She didn’t make a move for her food – she just looked at the plate with the battered haggis and chips on it. I pushed it towards her, chewing on a chip. ‘Dinner.’\u003c/p\u003e\n\u003cp\u003eAt her grunt, I turned away and stared at the telly. My brother and I pretended to be watching the show, but I could tell by the stiffness of Cole’s body that he was just as hyperaware of Mum as I was.\u003c/p\u003e\n\u003cp\u003eFive minutes later the tension had only just begun to slowly drain from us as Mum managed to eat some of her food, even if it was at the pace of a moonwalker, when she ruined it.\u003c/p\u003e\n\u003cp\u003eLike always.\u003c/p\u003e\n\u003cp\u003eFocused now on the TV show, Cole had laughed at a joke and turned around to see if I was laughing too. He’d done this since he was a toddler. Anytime he found something funny, he’d look to me to make sure I found it just as amusing. I smiled at him as I always did.\u003c/p\u003e\n\u003cp\u003e‘Pfft.’\u003c/p\u003e\n\u003cp\u003eMy muscles immediately grew rigid at the sound, as did Cole’s.\u003c/p\u003e\n\u003cp\u003eA ‘pfft’ from Mum was usually followed by something unpleasant.\u003c/p\u003e\n\u003cp\u003e‘Look at him,’ she sneered.\u003c/p\u003e\n\u003cp\u003eI was sitting on the floor like Cole, so I had to look over my shoulder to see what she was bitching about. My blood heated when I saw she was glaring at Cole.\u003c/p\u003e\n\u003cp\u003e‘Mum …’ I warned.\u003c/p\u003e\n\u003cp\u003eHer face scrunched up into a hateful, ugly expression. ‘Laughs like that fuckin useless bastard of a man.’\u003c/p\u003e\n\u003cp\u003eI shot a look at Cole and a burst of pain exploded in my chest at his downcast expression. He stared at the rug, as if trying to block her words out.\u003c/p\u003e\n\u003cp\u003e‘He’ll turn out just like his dad. A piece of shit. Looks just like him. A piece of –’\u003c/p\u003e\n\u003cp\u003e‘Shut up,’ I snapped, twisting around to face her, my eyes flashing furiously. ‘You can either sit here and finish your dinner in total silence or go back to your bed and drown yourself in drink. Either way, you keep your nasty, gin-soaked thoughts to yourself.’\u003c/p\u003e\n\u003cp\u003eMum blustered incoherently and threw the plate on to our table, sending some errant chips flying. As she pushed herself up off the couch, she began muttering under her breath about ungrateful kids and no respect.\u003c/p\u003e\n\u003cp\u003eAs soon as she had disappeared into her room, I let out a sigh of relief. ‘Cole, ignore her. You’re nothing like Dad.’\u003c/p\u003e\n\u003cp\u003eCole shrugged, refusing to look at me, the colour on his cheeks high. ‘I wonder where he is.’\u003c/p\u003e\n\u003cp\u003eI shuddered at the thought of ever finding out. ‘I don’t care, as long as he’s far away from here.’\u003c/p\u003e\n\u003cp\u003eLater that night, after I’d cleaned up the flat, done the dishes and sprayed the sitting room and kitchen with air freshener to get rid of the fish-and-chips smell, I flopped down beside Cole on the couch. He’d finished his presentation and was now surrounded by pieces of a comic he was working on.\u003c/p\u003e\n\u003cp\u003eI handed him a mug of hot chocolate as I squeezed on to the other end of the couch, skirting his drawings. I squinted at a piece of paper that was upside down, trying to make out the image. ‘What’s this one about?’\u003c/p\u003e\n\u003cp\u003eCole shrugged, his eyebrows drawn together. ‘Don’t know what’s happening with this one.’\u003c/p\u003e\n\u003cp\u003e‘Why not?’\u003c/p\u003e\n\u003cp\u003e‘Jamie and Alan were helping me with it, but …’\u003c/p\u003e\n\u003cp\u003eUh-oh, the irritation in his voice did not sound good. ‘But … ?’ I frowned. Now that I thought about it, it had been a week since Cole had asked me if he could hang out at Jamie’s. ‘Have you two fallen out?’\u003c/p\u003e\n\u003cp\u003e‘Maybe.’ At least that’s what I thought his mumble translated into.\u003c/p\u003e\n\u003cp\u003eOh, boy. Cole was a laid-back guy and a fight with his friends rarely happened, so I didn’t even know if I wanted to be made aware of why they were fighting. But it was Cole … ‘What happened?’\u003c/p\u003e\n\u003cp\u003eThe blush on his cheeks made me even warier.\u003c/p\u003e\n\u003cp\u003eOh, crap, this better not be teenage-boy gross. ‘Cole?’\u003c/p\u003e\n\u003cp\u003eHe shrugged at me again.\u003c/p\u003e\n\u003cp\u003e‘That’s it. I’m getting you weights to wear on your shoulders so you can’t do that to me any more. I thought I told you shrugging does not equate to an answer. Neither does grunting.’\u003c/p\u003e\n\u003cp\u003eMy brother rolled his eyes at me.\u003c/p\u003e\n\u003cp\u003e‘Or that.’\u003c/p\u003e\n\u003cp\u003e‘It doesn’t matter, all right?’ he bit out, flopping back against the couch to sip at the hot chocolate, refusing to meet my eyes.\u003c/p\u003e\n\u003cp\u003e‘It matters to me.’\u003c/p\u003e\n\u003cp\u003eHis huge, long-suffering sigh could have filled up a hot-air balloon. ‘He just said something that pissed me off.’\u003c/p\u003e\n\u003cp\u003e‘Oi,’ I admonished. ‘Watch the language.’\u003c/p\u003e\n\u003cp\u003e‘He annoyed me.’\u003c/p\u003e\n\u003cp\u003e‘What did he say?’\u003c/p\u003e\n\u003cp\u003eThe muscle in Cole’s jaw flexed and for a moment I could see him older, a man. My God, where had the time gone? ‘He said something about you.’\u003c/p\u003e\n\u003cp\u003eI winced. ‘Me?’\u003c/p\u003e\n\u003cp\u003e‘Yeah. Something sexual.’\u003c/p\u003e\n\u003cp\u003eOh, Christ. I flinched. There were just some words you didn’t ever want to hear coming out of your baby brother’s mouth. ‘Sexual’ was definitely one of them. ‘Okay.’\u003c/p\u003e\n\u003cp\u003eCole looked up at me from under his lashes, his mouth twisted into a frustrated grimace. ‘All my mates fancy you, but Jamie went too far.’\u003c/p\u003e\n\u003cp\u003eI did not want to know what that meant.\u003c/p\u003e\n\u003cp\u003eInstead I thought about how close the two of them were. ‘Did Jamie apologize once he realized he’d gone too far?’\u003c/p\u003e\n\u003cp\u003e‘Yeah, but that’s not the point.’\u003c/p\u003e\n\u003cp\u003e‘It is the point.’ I leaned forward so I could catch his gaze, so he could see how much I meant what I was about to say. ‘Life is too short to hold on to silly grudges. Jamie was man enough to apologize. Be man enough and gracious enough to accept the apology.’\u003c/p\u003e\n\u003cp\u003eFor a moment he held my gaze, processing my advice. Finally he nodded. ‘Okay.’\u003c/p\u003e\n\u003cp\u003eI smiled and sat back. ‘Good.’\u003c/p\u003e\n\u003cp\u003eOnce he’d turned his attention back to the comic, I reached for my latest paperback, readying myself to escape into someone else’s world for a while.\u003c/p\u003e\n\u003cp\u003e‘Jo?’\u003c/p\u003e\n\u003cp\u003e‘Mmm-hmm?’\u003c/p\u003e\n\u003cp\u003e‘I googled that guy you’re dating. Malcolm Hendry.’\u003c/p\u003e\n\u003cp\u003eMy head snapped up from my book, my pulse racing a little faster all of a sudden. ‘Why?’\u003c/p\u003e\n\u003cp\u003eCole shrugged. Again. ‘You haven’t said much about him.’ He scowled at me. ‘He’s a bit old, do you not think?’\u003c/p\u003e\n\u003cp\u003e‘Not really.’\u003c/p\u003e\n\u003cp\u003e‘He’s fifteen years older than you.’\u003c/p\u003e\n\u003cp\u003eI really didn’t want to be having this conversation with Cole of all people. ‘I like him a lot. You will too.’\u003c/p\u003e\n\u003cp\u003eCole snorted. ‘Yeah, like I’m going to meet him. I met Callum only a handful of times and you dated him for two years.’\u003c/p\u003e\n\u003cp\u003e‘I don’t want to introduce you to someone who might not stick around. But I have a good feeling about Malcolm.’\u003c/p\u003e\n\u003cp\u003eHis next question was asked softly but with a hint of disdain that shot me right in the heart. ‘Is it because he’s loaded?’\u003c/p\u003e\n\u003cp\u003e‘No,’ I answered tightly. ‘It’s not.’\u003c/p\u003e\n\u003cp\u003e‘You date a lot of wankers, Jo, and I know it’s because they’ve got money. You don’t have to.’ His face was starting to colour now with frustrated anger. ‘She makes you miserable enough – you don’t need to be going out with some tool just so we don’t have to worry about money. As soon as I turn sixteen I’m getting a job so I can help.’\u003c/p\u003e\n\u003cp\u003eI think it was the longest Cole had ever spoken in one sitting in about a year. And his declaration felt like a punch in the gut. I sat up straight, my own cheeks blazing hot with annoyance. ‘Don’t use the “w” word. And to answer your question, I’m dating a guy I really care about, and he just happens to have money. And you are not getting a job at sixteen. You’re finishing high school and you’re going to uni or art school or whatever the hell it is you want to do. But I’ll be damned if you end up in some crap job because you’re a bloody high school dropout!’ I was breathing hard with fear at the thought of it.\u003c/p\u003e\n\u003cp\u003eCole stared at me, his green eyes round with astonishment at my outburst. ‘Jesus, chill, Jo. It was just an idea.’\u003c/p\u003e\n\u003cp\u003e‘It was a bad idea.’\u003c/p\u003e\n\u003cp\u003e‘Aye, I’m getting that.’\u003c/p\u003e\n\u003cp\u003eI relaxed at the teasing in his voice and leaned back into the couch, pulling my paperback up to my face. ‘Just draw, you pain in the ass.’\u003c/p\u003e\n\u003cp\u003eHe choked back his laughter and put down his mug to start drawing again.\u003c/p\u003e\n\u003cp\u003eAfter a minute, I looked at him over the top of my book. ‘Just so you know … I love you, baby boy.’\u003c/p\u003e\n\u003cp\u003e‘Mmm-hmm, lu uu uu.’\u003c/p\u003e\n\u003cp\u003eI deduced that was ‘Mmm-hmm, love you too’ in teenage muttering.\u003c/p\u003e\n\u003cp\u003eMy lips twitched against an answering grin, a warm contentment settling in my chest as I stared down at the pages of my book.\u003c/p\u003e\n\u003cp\u003e7\u003c/p\u003e\n\u003cp\u003eEven though it was the end of February, and March was but a day away, Edinburgh was still freezing. The frigid sea air rushed up towards New Town, blasting those who were unfortunate enough to find themselves walking north towards it, unprotected by the buildings. \u003c/p\u003e","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-13.html","bookId":1893,"creation":"Oct 5, 2019 5:07:07 PM","modification":"Oct 5, 2019 5:07:07 PM"}
