{"id":85412,"no":24,"title":"Page 24","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e‘Um, not really.’\u003c/p\u003e\n\u003cp\u003e‘You sound like shit.’\u003c/p\u003e\n\u003cp\u003e‘Well …’\u003c/p\u003e\n\u003cp\u003e‘Okay, I’m coming over.’\u003c/p\u003e\n\u003cp\u003e‘Joss, you don’t have to.’\u003c/p\u003e\n\u003cp\u003e‘I have a bottle of wine here. Are you going to argue with me and a bottle of wine?’\u003c/p\u003e\n\u003cp\u003eI smiled. ‘I wouldn’t dream of it.’\u003c/p\u003e\n\u003cp\u003e‘Smart lady. I’ll be there in ten.’ She hung up and I rolled my eyes. I always knew there was a secret ‘momma bear’ hiding underneath all Joss’s prickliness.\u003c/p\u003e\n\u003cp\u003eWhen she arrived, she took one look at me and shook her head, her brows drawn together. ‘Jesus C, Jo, what’s happened now?’\u003c/p\u003e\n\u003cp\u003eI stepped aside to let her in, nodding at the bottle of wine in her hand. ‘Let’s crack this open first. We’re both going to need it.’\u003c/p\u003e\n\u003cp\u003eCole greeted Joss with a brusque nod and headed into his room to give us some privacy. Joss got comfortable on the end of the couch. ‘Hit me with it.’\u003c/p\u003e\n\u003cp\u003eMy mouth twisted at the irony of her word choice. ‘Well, now that you mention it …’\u003c/p\u003e\n\u003cp\u003eWhen I was finished, I had to body tackle her to the couch so she couldn’t barge into my mum’s room and give her a beatdown, and then I had to spend five minutes assuring her that Cole and I were okay.\u003c/p\u003e\n\u003cp\u003eHer eyes were still flashing a little wildly as she took a sip of wine. ‘So Cam was there for you?’\u003c/p\u003e\n\u003cp\u003e‘Yeah. He was very kind, actually.’\u003c/p\u003e\n\u003cp\u003eHer eyebrows rose at my expression and then she gifted me with one of her gorgeous smiles. ‘Oh, I recognize that look. I see that look on Ellie’s face every time she gazes at Adam.’\u003c/p\u003e\n\u003cp\u003e‘Whatever,’ I muttered, refusing to let her catch sight of my eyes in case they just confirmed her suspicions.\u003c/p\u003e\n\u003cp\u003e‘You are so crushing on Cam and I didn’t even have to do anything.’\u003c/p\u003e\n\u003cp\u003e‘I’m not crushing on Cam.’\u003c/p\u003e\n\u003cp\u003e‘I know what that look means.’\u003c/p\u003e\n\u003cp\u003e‘We’re just friends.’ I stared at her now. ‘Joss, I like him, but we have partners, and I …’\u003c/p\u003e\n\u003cp\u003eJoss sighed. ‘You still want the security that Malcolm can give you.’\u003c/p\u003e\n\u003cp\u003eI didn’t need to answer – we both knew she was right.\u003c/p\u003e\n\u003cp\u003e‘Does Cam give you butterflies?’\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e‘Are you aware of every move he makes?’\u003c/p\u003e\n\u003cp\u003eAnother affirmative.\u003c/p\u003e\n\u003cp\u003e‘Does he enter your thoughts at the slightest provocation?’\u003c/p\u003e\n\u003cp\u003e‘Mm-hmm.’\u003c/p\u003e\n\u003cp\u003e‘You are so screwed.’\u003c/p\u003e\n\u003cp\u003e‘I am not.’ I huffed indignantly. ‘I’m perfectly in control of the situation.’\u003c/p\u003e\n\u003cp\u003e‘Yeah.’ Joss snorted. ‘So was I until I found myself pinned to Su’s desk. Eighteen months later and I’m picking out bedsheets with Braden and worrying if he doesn’t text me at least once from work to let me know how his day is going – as if he can’t tell me when he gets home. I can’t get to sleep without him beside me. Me? Can’t sleep without a guy in my bed? I’m addicted, Jo. And it started out with that look you’ve got.’\u003c/p\u003e\n\u003cp\u003e‘I’m glad for you, Joss. I really am. But it’s not the same thing. I care about Malcolm. I’m just physically attracted to Cam. It’s nothing.’\u003c/p\u003e\n\u003cp\u003eJoss burst out laughing and I watched in complete bemusement as she shook with her own hysterics.\u003c/p\u003e\n\u003cp\u003e‘What?’\u003c/p\u003e\n\u003cp\u003eShe waved me off, trying to catch her breath. ‘Oh, man, nothing. Nothing.’ She looked at me again and then gave a furtive chuckle as if she knew something I didn’t. ‘I’m just having déjà vu.’\u003c/p\u003e\n\u003cp\u003eFor the first time ever, I pretended to be sick at work. I told Mr Meikle I was coming down with a migraine, and since I was pale with worry for Cole, it didn’t take much convincing for him to let me leave early, although he grumbled the entire time I packed up my things.\u003c/p\u003e\n\u003cp\u003eI managed to get back to the flat just as Cole was getting home from school. He stopped in the hallway when he stepped inside the flat, his lips pinched as he watched me kick off my work shoes.\u003c/p\u003e\n\u003cp\u003e‘Well, you can’t pull a sickie every day,’ he said, deducing exactly what I’d done and why. ‘You’ll just have to trust that I can take care of being in the flat alone with her. Plus, I really think you scared the crap out of her.’\u003c/p\u003e\n\u003cp\u003eAt that exact moment Mum’s bedroom door opened. She peered out at us, her lip curling in hostility as her eyes clashed with mine. She made a grunting noise before using the wall to help her along to the bathroom. As soon as the door shut, I turned back to Cole.\u003c/p\u003e\n\u003cp\u003e‘Apparently, I can’t trust you to be alone with her.’\u003c/p\u003e\n\u003cp\u003eHe winced at the reminder that he had kept her abuse from me. ‘I just didn’t want to upset you.’\u003c/p\u003e\n\u003cp\u003eI harrumphed at that and strode into the kitchen for a cup of tea. By the time I’d made it and nestled into the couch with my book, Cole had settled down on the armchair with his homework and Mum had gone back into her bedroom.\u003c/p\u003e\n\u003cp\u003eWe sat there for an hour before I decided to get up and put on some dinner. I was just coming out of the kitchen when I heard a knock at the door. For an awful moment I thought maybe I’d finally stretched Malcolm’s patience and he’d turned up at the flat. He’d texted me today and I’d texted back, but I hadn’t encouraged conversation. Had he decided to show up to see what was going on?\u003c/p\u003e\n\u003cp\u003eMy heart was pounding stupidly hard as I reached for the door, and it flipped over in my chest when I saw who stood on the other side of it.\u003c/p\u003e\n\u003cp\u003e‘Cam.’ I smiled, more than happy to see him.\u003c/p\u003e\n\u003cp\u003eHe was wearing his usual uniform of print tee and jeans and I wanted to haul him in out of the freezing-cold stairwell. He gave me a quick smile. ‘All right?’\u003c/p\u003e\n\u003cp\u003eI stepped aside. ‘Come in.’\u003c/p\u003e\n\u003cp\u003eHis smile widened and he slid past me, his shoulder brushing mine and causing inappropriate thoughts to tumble through my overworked brain. ‘Can I get you a coffee?’\u003c/p\u003e\n\u003cp\u003e‘Aye, that would be great.’ He followed me, throwing a wave to Cole. ‘Hey, bud, how are you?’\u003c/p\u003e\n\u003cp\u003eCole grinned at him. ‘Good. You?’\u003c/p\u003e\n\u003cp\u003e‘Yeah, not bad.’ He trailed me into the kitchen.\u003c/p\u003e\n\u003cp\u003e‘What do you take?’\u003c/p\u003e\n\u003cp\u003e‘Milk, no sugar.’\u003c/p\u003e\n\u003cp\u003eI set about making it, fully aware of his eyes on my every movement. My cheeks felt incredibly warm under his perusal, and I hurried to get his drink ready. ‘You’re working tonight, aren’t you?’ I said, handing him the mug.\u003c/p\u003e\n\u003cp\u003e‘I am. But I wanted to drop something off first.’ He took a sip of his drink. ‘Mmm, good coffee.’\u003c/p\u003e\n\u003cp\u003eI laughed softly. ‘The way to a man’s heart.’\u003c/p\u003e\n\u003cp\u003eHis grin was wicked. ‘Only an easily pleased man,’ he retorted, suggesting he was anything but easy to please.\u003c/p\u003e\n\u003cp\u003e‘Yeah, I can guess what it takes to please you, Cam, and this is a PG-rated household.’\u003c/p\u003e\n\u003cp\u003eHe threw back his head and laughed, causing another flutter in my chest and my own smile to widen. ‘Good thing the flat downstairs is open to X-rated situations.’\u003c/p\u003e\n\u003cp\u003eI flushed and shook my head. ‘Moving on …’\u003c/p\u003e\n\u003cp\u003e‘What? Punters in the bar say worse than that to you and your comebacks are always good.’\u003c/p\u003e\n\u003cp\u003eHe had been paying attention. I shrugged. ‘They’re not my friends.’\u003c/p\u003e\n\u003cp\u003eHis eyes softened. ‘I’m still your friend, then? You haven’t changed your mind?’\u003c/p\u003e\n\u003cp\u003e‘No, I haven’t changed my mind.’\u003c/p\u003e\n\u003cp\u003e‘Good.’ He pulled something out of his back pocket. ‘Because I want you to trust me enough to give this to Cole.’ Cam held out a key. I raised an eyebrow at it. ‘A spare key to my flat. I want him to use my place when you’re not around. It’s a safe place for him to be so you’re not worrying every second of every minute that you’re not with him.’\u003c/p\u003e\n\u003cp\u003eThat key was the best present anyone had ever given me.\u003c/p\u003e\n\u003cp\u003eEver.\u003c/p\u003e\n\u003cp\u003e‘Cam’ – I looked from the key up to him – ‘are you sure? I mean, it’s not too much of an imposition?’\u003c/p\u003e\n\u003cp\u003e‘Not if it helps you out.’\u003c/p\u003e\n\u003cp\u003eI reached for the key, but instead of just taking it, I curled my hand around it and his fingers. He tensed with awareness and I poured my gratitude into my eyes. ‘This is the best present I’ve ever had.’\u003c/p\u003e\n\u003cp\u003eCam’s eyes roamed my face, his mouth curled up at the corners. ‘A key: the way to a woman’s heart.’\u003c/p\u003e\n\u003cp\u003e‘Only an easily pleased one.’\u003c/p\u003e\n\u003cp\u003eHe laughed again.\u003c/p\u003e\n\u003cp\u003e‘What’s so funny?’ Cole’s voice snapped us out of our little bubble. I pulled my hand back from Cam’s and held up the key to Cole.\u003c/p\u003e\n\u003cp\u003e‘Present.’\u003c/p\u003e\n\u003cp\u003e‘Oh?’\u003c/p\u003e\n\u003cp\u003e‘I’ll explain in a minute.’ I turned to Cam. ‘Would you like to stay for dinner? Macaroni cheese.’\u003c/p\u003e\n\u003cp\u003e‘How can I say no to that?’\u003c/p\u003e\n\u003cp\u003e‘You can’t. I won’t let you.’ I handed the key to Cole. ‘Take Cam into the sitting room – he’ll explain. Dinner will be ready soon.’\u003c/p\u003e\n\u003cp\u003eThey left me to it and for a moment I could only stare at the cupboard, my insides all trembling and fluttering from my interaction with Cam. He was thoughtful and considerate and trying to prove what a good friend he could be, and that just made his hotness even hotter. I wondered, not for the first time, what he’d be like in bed. His grin alone made me tingle – imagine what his tongue could do.\u003c/p\u003e\n\u003cp\u003eMy phone buzzed, snapping me out of my sensual haze.\u003c/p\u003e\n\u003cp\u003eMalcolm.\u003c/p\u003e\n\u003cp\u003eGuilt immediately washed over me as I pressed the ANSWER button. ‘Hey, Malcolm.’\u003c/p\u003e\n\u003cp\u003e‘Sweetheart. How are you?’\u003c/p\u003e\n\u003cp\u003e‘Just about to put out dinner for me and Cole.’ I winced at the omission of our guest. ‘Can I call you back?’\u003c/p\u003e\n\u003cp\u003e‘Of course. Talk to you soon.’\u003c/p\u003e\n\u003cp\u003eI hung up and shoved my phone in my back pocket with shaking fingers.\u003c/p\u003e\n\u003cp\u003eSeriously. What was I playing at?\u003c/p\u003e\n\u003cp\u003eCam stopped by early before work the next day and walked me to the bar. I found that now we understood each other Cam was pretty easy to talk to. He tried once more to persuade me to go to judo with him, but I put him off, still not keen on the idea of having someone slam me into a mat or whatever it was judo involved. \u003c/p\u003e","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-24.html","bookId":1893,"creation":"Oct 5, 2019 5:07:07 PM","modification":"Oct 5, 2019 5:07:07 PM"}
