{"id":85414,"no":26,"title":"Page 26","content":"\u003cp\u003eWe became this family unit, bonding quickly and strongly.\u003c/p\u003e\n\u003cp\u003eMy feelings for Cam only grew deeper and I was in a constant battle with my conscience, arguing with it, pretending that it didn’t mean anything. Along with the emotional stuff, my body was almost at breaking point for want of him. I don’t know how I managed to hide it from him, but I did. I didn’t want anything to destroy our friendship.\u003c/p\u003e\n\u003cp\u003eThat didn’t mean I didn’t find other outlets for my pent-up sexual frustration, and that outlet only added a whole other level of guilt and shame to my already considerable stack. I hadn’t seen Malcolm as much as I usually did, but three of the four times I did see him, we had sex … and the three times we had sex I …\u003c/p\u003e\n\u003cp\u003e… I did the unthinkable. I closed my eyes and imagined Cam.\u003c/p\u003e\n\u003cp\u003eI came each time.\u003c/p\u003e\n\u003cp\u003eMalcolm took this to mean he and I were back on track and whatever had been bothering me before was dealt with.\u003c/p\u003e\n\u003cp\u003eI was an awful, awful person.\u003c/p\u003e\n\u003cp\u003eYup. My world was full of colour. Red for want. Yellow for shame.\u003c/p\u003e\n\u003cp\u003eGreen for jealousy.\u003c/p\u003e\n\u003cp\u003eYes, the green-eyed monster had also reared her ugly head in the last few weeks. Every time Cam mentioned Becca’s name I felt that little ache in my chest, an ache that ruptured into a full-blown bleed on Sunday.\u003c/p\u003e\n\u003cp\u003eCole and I had had lunch with the Nicholses and had come home in a good mood. Cole had gone downstairs to invite Cam up for coffee and I was humming away like an idiot, my stomach already a riot of fluttery winged creatures in anticipation of seeing him, when Cole came back into the flat unaccompanied.\u003c/p\u003e\n\u003cp\u003eI frowned at him as I poured Cam’s coffee. ‘Is he just coming?’\u003c/p\u003e\n\u003cp\u003eCole shook his head, his brows drawn together in what I took for bemusement.\u003c/p\u003e\n\u003cp\u003e‘Not in?’\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003eOh, dear God, the shrugging had returned. ‘Well?’\u003c/p\u003e\n\u003cp\u003eHe leaned against the kitchen counter and sighed before he shot me a questioning look. ‘Are you and Cam just friends?’\u003c/p\u003e\n\u003cp\u003eI coughed up the lie quite easily these days. ‘Of course. I’m with Malcolm. Why?’\u003c/p\u003e\n\u003cp\u003eTwo spots of colour appeared high on Cole’s cheeks and his mouth quirked up at the corners in amusement. ‘Because it definitely sounds like Cam’s too busy shagging some noisy bird to want to have coffee with us.’\u003c/p\u003e\n\u003cp\u003eMy whole body froze as I stared at my brother, my heart pounding, a horribly uneasy feeling in my stomach as jealousy seized hold of me.\u003c/p\u003e\n\u003cp\u003e‘Jo?’\u003c/p\u003e\n\u003cp\u003eI frowned, grasping at a reason for my freeze. ‘Don’t say “shagging” and don’t say “bird”. Not “bird”, “chick”, “piece”. We’re “women” or “ladies” or “girls”.’\u003c/p\u003e\n\u003cp\u003eCole grunted. ‘Thanks for the vocab lesson.’\u003c/p\u003e\n\u003cp\u003eI stared after him as he took off for the living room, my good mood annihilated by the thought of Cam and Becca having sex.\u003c/p\u003e\n\u003cp\u003eI guess in the end I couldn’t really cope with all the colour, and the following Thursday, before the crack of dawn, I stripped the wallpaper in the sitting room. I was taking time to find some calm. The night before I went on a date with Malcolm, but I ended up getting him to drop me off early at the flat, after making up some excuse about not feeling well. I hurried upstairs to check the Internet, found the sale I was looking for, reserved what I needed from the local store, and began priming the walls.\u003c/p\u003e\n\u003cp\u003eWhen Thursday morning broke, I got Cole ready for school, ignoring his grumblings about the stripped walls, and then I headed out to pick up what I’d reserved: three rolls of wallpaper. I also bought some paste and a box of doughnuts.\u003c/p\u003e\n\u003cp\u003eAs soon as I changed into my paint-covered jeans and tee, scraped my long hair back into a ponytail, and put on my headscarf, I felt better. Calmer already. I was just putting up my pasting table when Mum appeared in the doorway.\u003c/p\u003e\n\u003cp\u003eWe stared at each other.\u003c/p\u003e\n\u003cp\u003eWe hadn’t spoken since my attack in the kitchen almost three weeks before.\u003c/p\u003e\n\u003cp\u003eHer tired eyes swept the living room – the dust sheets, the rolls of wallpaper, the bucket of paste. She grunted. ‘Again?’\u003c/p\u003e\n\u003cp\u003eTaking my cue from Cole, I shrugged in reply.\u003c/p\u003e\n\u003cp\u003eMum sighed and shook her head wearily. ‘Any food?’\u003c/p\u003e\n\u003cp\u003e‘There’s leftover pasta from last night. Can you heat it up without burning down the flat?’\u003c/p\u003e\n\u003cp\u003eShe waved off my caustic comment and moved towards the kitchen a little unsteadily. ‘I’ll eat it cold.’\u003c/p\u003e\n\u003cp\u003eA little while later she returned to her room. That was good. Despite what I considered my civility in light of the circumstances, I still found it hard not to throw a punch anytime I thought of her hitting Cole. Honestly, that’s all I really saw now when I looked at her.\u003c/p\u003e\n\u003cp\u003eI switched on my music but kept it low so as not to disturb alco-mum and began to hang the new wallpaper. It was cream with very faint champagne, silver and chocolate stripes. I’d have to get new cushions for the couch and change the floor lamp, but I didn’t care. Decorating always zoned me out and I needed to zone out big time. I started at ten and by eleven I was feeling completely relaxed and sated from having eaten two doughnuts. I was in the middle of hanging a sheet of wallpaper, thinking that the kitchen cabinets could do with a repaint, when there was a knock at the door.\u003c/p\u003e\n\u003cp\u003eTurning on my stepladder, my hands high above me holding the wallpaper away from the wall, I yelled, ‘Who is it?’\u003c/p\u003e\n\u003cp\u003e‘Cam!’\u003c/p\u003e\n\u003cp\u003eNope. He wasn’t going to destroy my calm. I took a deep breath and looked back at what I’d accomplished so far. I was on my last piece of wallpaper and the room looked brighter and fresher already. ‘Come in!’ I lined up the paper and used the brush to smooth the top of it to the wall.\u003c/p\u003e\n\u003cp\u003eTwo seconds later I heard him ask behind me, ‘What are you doing?’\u003c/p\u003e\n\u003cp\u003eIgnoring the effect of his voice on my body, I slid the paper slightly, checking its position before smoothing down another section. ‘I’m wallpapering.’\u003c/p\u003e\n\u003cp\u003e‘By yourself?’ I could hear the incredulity in his voice.\u003c/p\u003e\n\u003cp\u003eI nodded, taking a step down the ladder so I could smooth the middle section. It was lining up exactly. Practice did make perfect. ‘Who do you think decorated this place? The wallpaper, the paint, the sanded floors …’ I finished off the piece and stepped back, smiling at the new look.\u003c/p\u003e\n\u003cp\u003eTurning to Cam, I was surprised to find a slightly dumbfounded look on his face as his eyes searched the room and then came back to me. ‘Do you know how bloody hard it is to hang wallpaper? You just did it like a pro.’\u003c/p\u003e\n\u003cp\u003eI made a face at him. I didn’t see what the big deal was. ‘Uncle Mick taught me.’\u003c/p\u003e\n\u003cp\u003e‘When you were ten?’ he asked, smiling in curiosity. ‘When did you start this?’ He nodded at the folding table.\u003c/p\u003e\n\u003cp\u003e‘An hour ago.’\u003c/p\u003e\n\u003cp\u003eThose gorgeous eyes of his widened. ‘And you’re done already? Jo, this place is really nicely put together. It looks professional. You know that, right?’\u003c/p\u003e\n\u003cp\u003eI grinned at the compliment, feeling a flush of pleasure that he thought so. ‘Thank you. It drives Cole nuts. He almost had a fit when he saw the stripped walls.’\u003c/p\u003e\n\u003cp\u003e‘Actually’ – Cam took a step towards me – ‘The reason I came by was because of Cole. I got this weird text from him saying, “Jo’s wallpapering. She only does that when something’s up. Do you know what’s going on?” ’\u003c/p\u003e\n\u003cp\u003eTraitor. I sighed, looking away from Cam. So it had got to the point where Cole was now going to our neighbour for help, even when it concerned me. Was I to have no secrets?\u003c/p\u003e\n\u003cp\u003e‘Well?’\u003c/p\u003e\n\u003cp\u003eI shrugged. ‘Every now and then it helps me relax.’ I tried to placate him with a smile. ‘Cam, you of all people know my life is stressful. I just do this to relieve it.’\u003c/p\u003e\n\u003cp\u003eSeeming to have mercy on me, Cam gave me a slow nod. ‘Right.’ He looked at the floor now, his eyes running along it to the paintwork on the skirting board. Without saying a word he disappeared and turned towards the kitchen. I heard him in the kitchen and then watched him appear, passing the doorway to head along to the bedrooms and bathroom. I heard three doors open. Bathroom, Cole’s room and my room.\u003c/p\u003e\n\u003cp\u003eCam returned to the living room to encounter my ‘look’, featuring raised eyebrows and arms crossed over my chest. His lips twitched at it. Mine did not. ‘Are you done, you nosy bugger?’\u003c/p\u003e\n\u003cp\u003eHe grinned. ‘You have a lot of books.’\u003c/p\u003e\n\u003cp\u003eI harrumphed.\u003c/p\u003e\n\u003cp\u003e‘Explains the vocab.’\u003c/p\u003e\n\u003cp\u003e‘Excuse me?’\u003c/p\u003e\n\u003cp\u003e‘You’re very articulate. Well read.’\u003c/p\u003e\n\u003cp\u003eWhy did Cam’s compliments always have to be the best? It was very irritating to someone who was trying to get him out from under her skin.\u003c/p\u003e\n\u003cp\u003e‘You’re also talented.’\u003c/p\u003e\n\u003cp\u003eAstonishment jolted through my body. ‘Me? Talented?’ Was he high?\u003c/p\u003e\n\u003cp\u003eHis arm swept around the room. ‘Jo, you should be doing this for a living.’\u003c/p\u003e\n\u003cp\u003e‘Um, doing what?’\u003c/p\u003e\n\u003cp\u003e‘Painting and decorating.’\u003c/p\u003e\n\u003cp\u003eI laughed at the absurdity of it. ‘Oh, okay. Who in their right mind would hire a high school dropout with no experience to be a painter and decorator? Let’s face facts. I’m useless, Cam.’\u003c/p\u003e\n\u003cp\u003eHis eyes instantly hardened, narrowing on me and pinning me in place. ‘You are not useless. Don’t talk about yourself like that in front of me. It pisses me off.’ It was lucky he had no intention of waiting for me to speak, since I didn’t know how to reply or react to the warm fuzzies in my chest. ‘You’re good at this. Really good. I think Nate knows someone with his own company. I could see about getting you an apprenticeship.’\u003c/p\u003e\n\u003cp\u003e‘No. I’m twenty-four. No one hires a twenty-four-year-old apprentice.’\u003c/p\u003e\n\u003cp\u003e‘They do if it’s a favour for a friend.’\u003c/p\u003e\n\u003cp\u003e‘Cam, no.’\u003c/p\u003e\n\u003cp\u003e‘Jo, come on, at least think about it. You enjoy it and you’re good at it. It’s better than working two jobs and dating –’ He stopped himself, blanching when he realized he’d almost crossed the line.\u003c/p\u003e\n\u003cp\u003eWell, not really ‘almost’. He had crossed it. I clenched my jaw, forcing back the sting of tears in my eyes as I realized he still saw me that way – the bimbo after the rich guy’s wallet. I wiped the paste off the folding table, deciding to ignore him. \u003c/p\u003e","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-26.html","bookId":1893,"creation":"Oct 5, 2019 5:07:07 PM","modification":"Oct 5, 2019 5:07:07 PM"}
