{"id":85420,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e‘Wow!’ I breathed, wanting to curl my fingers in his hair but unable to remember how to move.\u003c/p\u003e\n\u003cp\u003eCam nodded in agreement against my skin.\u003c/p\u003e\n\u003cp\u003eAfter a little while he pulled up, bracing his weight on his arms beside my head. His features were completely relaxed, his eyes soft and languid. ‘I’ve never come so fucking hard before,’ he confessed quietly.\u003c/p\u003e\n\u003cp\u003eSweet satisfaction washed over me and gave me the strength to lift my arm. I stroked Cam’s muscled back, then slid my hand into his hair, running my fingers through it soothingly. ‘Me neither. In fact, up until now I thought multiple orgasms were a myth.’\u003c/p\u003e\n\u003cp\u003eHe laughed, his thumb sweeping affectionately across my cheekbone. ‘You’ll stay here tonight?’\u003c/p\u003e\n\u003cp\u003e‘If you want me to.’\u003c/p\u003e\n\u003cp\u003eHis expression changed, becoming more serious – pensive even. ‘There’s nothing I want more.’\u003c/p\u003e\n\u003cp\u003eSmiling, I realized I believed him.\u003c/p\u003e\n\u003cp\u003eI didn’t know if I trusted him completely yet, but at least I knew that in that moment I believed him. I drew his head down to mine, pressing my mouth to his for a kiss sweetened not just by the satisfaction of great sex but by emotion as well. When I let him up for air, I grinned at him, feeling a bit like a kid who’d found out Santa Claus was real after all. ‘You’ll have to tell me if I snore.’\u003c/p\u003e\n\u003cp\u003eHe frowned. ‘No one’s ever told you before?’\u003c/p\u003e\n\u003cp\u003e‘I’ve had a sleepover once and I didn’t stick around in the morning to ask.’\u003c/p\u003e\n\u003cp\u003e‘You mean you’ve only stayed with a guy once?’ I knew by the hardness in his eyes that he’d drawn the right conclusion as to why that was.\u003c/p\u003e\n\u003cp\u003eI shrugged, turning my head away, embarrassed that I’d brought it up now and worried what he’d think. ‘Yeah.’\u003c/p\u003e\n\u003cp\u003e‘Jo?’ He touched my chin, turning my head so I had to meet his gaze. ‘They were dicks. All of them.’\u003c/p\u003e\n\u003cp\u003e‘Let’s not talk about them.’\u003c/p\u003e\n\u003cp\u003e‘We’ll talk, just not now.’ And with that ominous warning, he withdrew from me and went to get rid of the condom. When he returned from the bathroom seconds later he pulled the duvet down underneath me so I could crawl on to the sheets, and he slid in beside me, covering us. I rested on my side, my head on his pillow, my nose inhaling the smell of his cologne, my heart suddenly racing again as I realized I didn’t know what to do.\u003c/p\u003e\n\u003cp\u003eIt became quickly apparent that I had no reason to be anxious.\u003c/p\u003e\n\u003cp\u003eCam’s strong arms wrapped around my waist as he snuggled in behind me, my naked bottom pressed to his groin, his legs entangling themselves in mine. ‘ ’Night, baby.’ His voice rumbled in my ear and I felt my stomach flip at the possessiveness in those two words.\u003c/p\u003e\n\u003cp\u003eSmoothing my hands down over the arms that held me close, I burrowed back against him and let myself melt. ‘ ’Night.’\u003c/p\u003e\n\u003cp\u003eMy butterflies actually woke me up, my eyes blinking open to find my cheek pressed against Cam’s bare chest, my arm thrown across his stomach, and his hand resting on the curve of my waist as I lay curled into him. The fluttering in my stomach only worsened.\u003c/p\u003e\n\u003cp\u003eCam must have seeped into my subconscious, all my concerns and exhilaration waking me. There was my excitement at being with him, and yet the anxiety over throwing away a secure relationship with Malcolm for this passionate but nevertheless somewhat shaky relationship I’d developed with Cam. Unlike any man I’d met, he could rile me, piss me off, argue with me until we were blue in the face … all of which screamed ‘disaster waiting to happen!’\u003c/p\u003e\n\u003cp\u003eYet I had to weigh that against the unbelievable chemistry between us, the awe-inspiring sex, his concern and consideration once he’d stopped being a prick, his patience, and how down-to-earth he was. I loved that he could admit when he was wrong, that he saw things in me no other man had, and that he had taken time to get to know Cole. I liked Cam. I really liked him, and I knew as I lay there that I would have lost the tiny sliver of self-respect I’d had left if I’d walked away from those feelings, if I had given up on them because of another man’s wealth and what it could bring me and Cole.\u003c/p\u003e\n\u003cp\u003eCole.\u003c/p\u003e\n\u003cp\u003eI tensed a little, fretting at the thought of my brother. I didn’t have nearly enough saved for his future. I needed to go job hunting again, see if I couldn’t find something that paid better than Meikle \u0026amp; Young’s.\u003c/p\u003e\n\u003cp\u003e‘Whatever you’re thinking, I’m not sure I’m going to like it,’ Cam murmured sleepily.\u003c/p\u003e\n\u003cp\u003eI tilted my head back in surprise, my eyes meeting his drowsy gaze. ‘What?’\u003c/p\u003e\n\u003cp\u003eHe squeezed my waist. ‘You were warm and relaxed, and then I felt your whole body get tense. What’s up?’\u003c/p\u003e\n\u003cp\u003e‘Worrying about my job. Worrying I should try to get something that pays better than Meikle’s.’\u003c/p\u003e\n\u003cp\u003e‘Never mind better pay. How about someone who treats you better?’\u003c/p\u003e\n\u003cp\u003eI made a noise of agreement.\u003c/p\u003e\n\u003cp\u003e‘So is that what you do first thing in the morning? Worry?’\u003c/p\u003e\n\u003cp\u003eSmiling at him, I nodded. ‘If you’re sticking around you’ll need to get used to it.’\u003c/p\u003e\n\u003cp\u003eHe tightened his embrace. ‘If I’m sticking around, I’ll do my best to make bloody sure you never have to worry again.’\u003c/p\u003e\n\u003cp\u003eMy breath caught. Damn, I hoped it wasn’t going to become a habit of his to say romantic crap that robbed me of speech all the time. ‘Smooth talker,’ I answered a little hoarsely, and his lips twitched with amusement, as if the arrogant bugger knew that his words liquefied my insides.\u003c/p\u003e\n\u003cp\u003e‘What time is it?’\u003c/p\u003e\n\u003cp\u003e‘I don’t know. I gave Malcolm back the Omega watch.’\u003c/p\u003e\n\u003cp\u003e‘That was good of you.’\u003c/p\u003e\n\u003cp\u003e‘It was the right thing to do.’ I winced, feeling a wave of remorse wash over me. It somehow didn’t feel right to be luxuriating in the heat of Cam and the happiness he brought me, while Malcolm was home hurting over my betrayal. ‘Do you feel guilty?’ I mumbled against his warm skin, my fingers absent-mindedly stroking the lines of his abs.\u003c/p\u003e\n\u003cp\u003e‘It’s difficult to feel anything but hard when you’re touching me, baby,’ Cam answered gruffly.\u003c/p\u003e\n\u003cp\u003eI chuckled despite myself. ‘Insatiable, are we?’\u003c/p\u003e\n\u003cp\u003e‘Apparently around you.’\u003c/p\u003e\n\u003cp\u003e‘More sweet talk. Am I required to repay you in some way for it?’\u003c/p\u003e\n\u003cp\u003e‘Now why would you assume you had to pay for it?’\u003c/p\u003e\n\u003cp\u003eI grinned teasingly. ‘Well, you’re not known for being sweet to me, Cam.’\u003c/p\u003e\n\u003cp\u003eHis chest rose under my cheek as he gave a little huff of annoyance. ‘How long am I going to pay for being a bastard to you?’\u003c/p\u003e\n\u003cp\u003e‘Oh, I don’t know. I think it might prove useful as leverage in the future.’\u003c/p\u003e\n\u003cp\u003eHis playful growl filled the room as he rolled me on to my back. At the sudden move, I giggled up into his now alert eyes, letting him pin me to the mattress. He nudged my legs apart. His face was still relaxed from sleep, the sexy curl of his upper lip soft and begging for attention. ‘Do you want to know why I was such a bastard?’\u003c/p\u003e\n\u003cp\u003e‘You’ve already told me why – ah.’ I ended on a gasp, feeling him hard and nudging insistently between my legs. My legs widened instinctively as he moved slowly against me, teasing me.\u003c/p\u003e\n\u003cp\u003e‘Truth?’ He lowered his head, kissing softly along my jaw until he found my ear. I shuddered at the tiny nip he gave the lobe, at the lick of his tongue against the bite. My chest heaved and my breasts brushed tantalizingly against his chest. My chest rose and fell in fast, shallow movements.\u003c/p\u003e\n\u003cp\u003eAt the press of our bodies, Cam froze for a second, a guttural moan falling from his lips to land on a breath against my neck.\u003c/p\u003e\n\u003cp\u003eI brought my knees up, inviting him to take what we both so desperately wanted him to. He reached for the chest of drawers and rummaged around, then pulled out a condom.\u003c/p\u003e\n\u003cp\u003eAs Cam put on the protection his usually cobalt eyes were almost black. ‘Truth?’\u003c/p\u003e\n\u003cp\u003e‘Truth,’ I whispered on a nod.\u003c/p\u003e\n\u003cp\u003e‘I wanted you and I couldn’t have you.’\u003c/p\u003e\n\u003cp\u003eMy lips parted in amazement at the confession. ‘That’s why you were a bastard to me?’\u003c/p\u003e\n\u003cp\u003e‘I didn’t want to want you so badly, so when it appeared that you were someone I could never respect or want, I held on to that and ran with it. But you kept blowing all my preconceptions to smithereens, and I just kept wanting you more.’\u003c/p\u003e\n\u003cp\u003eAs Cameron gazed deep into my eyes I felt a weight bear down on us, like a cocoon wrapping around us, protecting the connection that was developing so deep and fast between us. ‘I guess that means your bastard days are behind you,’ I replied, my words barely audible under the gravity of emotion.\u003c/p\u003e\n\u003cp\u003eHis brows drew together. ‘Meaning?’\u003c/p\u003e\n\u003cp\u003e‘You can stop wanting me now that you have me.’\u003c/p\u003e\n\u003cp\u003eLight twinkled mischievously in his eyes as he grinned at me. ‘I don’t think that’s possible. To stop wanting you, I mean.’\u003c/p\u003e\n\u003cp\u003eWithout warning, before I could even reply to that, he pushed into me and I cried out, my hands digging into the muscles in his back as my body grew reacquainted with his thickness. His breath whispered over my lips just before he kissed me, his tongue teasing mine as he pulled out of me a few inches before sliding back in.\u003c/p\u003e\n\u003cp\u003eHis kisses were hot and sweet as he slowly made love to me, pushing us towards another shattering release.\u003c/p\u003e\n\u003cp\u003eWe had just got out of his shower – where I’d finally found my chance to study the ink on his arms with my tongue – and we were in the kitchen making tea and toast when my phone rang. I found it in the pocket of my faux fur jacket, still lying in the hall from last night when Cam stripped me out of it.\u003c/p\u003e\n\u003cp\u003eA picture of Joss giving someone behind me a sly grin popped up on my phone screen as it rang. I’d taken it at the bar months ago, not realizing Craig was doing some absurd ‘sexy’ dance behind me as I snapped Joss’s picture. I smiled. ‘Hullo?’\u003c/p\u003e\n\u003cp\u003e‘Hey, you,’ she answered casually. ‘How are you?’\u003c/p\u003e\n\u003cp\u003e‘I’m fine.’ More than fine! I just had life-changing sex with Tattoo Guy! I grinned, trying to contain my giddiness as I wandered back into the kitchen, where Cam stood by the kettle, shirtless and all mine. ‘You?’ \u003c/p\u003e","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-32.html","bookId":1893,"creation":"Oct 5, 2019 5:07:07 PM","modification":"Oct 5, 2019 5:07:07 PM"}
