{"id":85421,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e‘Good. You sound weird.’\u003c/p\u003e\n\u003cp\u003e‘Weird?’\u003c/p\u003e\n\u003cp\u003e‘Yeah. Weird.’\u003c/p\u003e\n\u003cp\u003e‘I don’t know what you’re talking about.’ Cam glanced up at me and smiled, the corners of his eyes crinkling sexily. I grinned again. ‘I don’t know what you’re talking about at all.’\u003c/p\u003e\n\u003cp\u003e‘Hmm.’ Clearly Joss was unconvinced. ‘Are you and Cole coming to lunch today?’\u003c/p\u003e\n\u003cp\u003eI hesitated. I had a lot to do today. I had to tell Cole about me and Cam, and it was time to put the clothes Malcolm had bought me on eBay. Just the thought of it made my stomach lurch with guilt about how things had ended between us.\u003c/p\u003e\n\u003cp\u003e‘Butter or jam on your toast?’ Cam asked loudly.\u003c/p\u003e\n\u003cp\u003eI sucked in my breath.\u003c/p\u003e\n\u003cp\u003e‘Was that Cam?’ Joss asked quietly, more than idle curiosity in her tone.\u003c/p\u003e\n\u003cp\u003e‘Yes.’\u003c/p\u003e\n\u003cp\u003e‘At nine thirty in the morning? Asking about toast?’\u003c/p\u003e\n\u003cp\u003e‘Mm-hmm.’\u003c/p\u003e\n\u003cp\u003e‘Oh, my God, you fucked him.’\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. ‘Well, just say it like it is, Joss.’\u003c/p\u003e\n\u003cp\u003e‘I take it you dumped Malcolm first before you got it on with Tattoo Guy. Poor Malcolm. Oh, well.’\u003c/p\u003e\n\u003cp\u003eAn unexpected warmth flooded my chest at Joss’s summation of the situation. She hadn’t asked me if I’d cheated on Malcolm. She’d just assumed I’d been good enough to be straight with him. It was nice to know she thought so well of me. ‘We broke up last night.’ I was suddenly very aware of Cam’s inquisitive eyes on me. ‘Look, we’ll talk about it later.’\u003c/p\u003e\n\u003cp\u003e‘Bring Cam to lunch.’\u003c/p\u003e\n\u003cp\u003eOkay, what? ‘What?’ I tried to squelch the hint of hysteria in that question.\u003c/p\u003e\n\u003cp\u003e‘If you’re seeing him now you should bring him to lunch. Elodie won’t mind.’\u003c/p\u003e\n\u003cp\u003e‘You never asked Malcolm to lunch.’\u003c/p\u003e\n\u003cp\u003eCam shot me another questioning look.\u003c/p\u003e\n\u003cp\u003e‘Well, if I’d thought the lunch would be as interesting as this one is definitely going to be, I might have.’\u003c/p\u003e\n\u003cp\u003e‘We’re not coming to lunch just to entertain you.’\u003c/p\u003e\n\u003cp\u003eSuddenly the phone was whipped from my ear and I watched wide-eyed as Cameron held it up to his own. ‘Joss, hey, it’s Cam. We’ll be there. Time?’ He nodded at whatever she said. ‘Cool. See you then.’\u003c/p\u003e\n\u003cp\u003eI took the phone from him and gestured between us. ‘I don’t know what just happened here, but we’ll talk.’ I lifted it to my ear. ‘Joss.’\u003c/p\u003e\n\u003cp\u003e‘Nice phone voice, huh?’ She chuckled.\u003c/p\u003e\n\u003cp\u003e‘Funny. Apparently we’ll see you at lunch.’\u003c/p\u003e\n\u003cp\u003e‘See you then. Oh, and Jo?’\u003c/p\u003e\n\u003cp\u003e‘Yeah?’\u003c/p\u003e\n\u003cp\u003e‘Was he good?’\u003c/p\u003e\n\u003cp\u003eLaughter fell from my lips before I could stop it, remembering how I’d pestered Joss about Braden after I found out they had slept together. Payback was a bitch. ‘What was it you said to me? You can have him when I’m done.’\u003c/p\u003e\n\u003cp\u003eHer groan caused my smile to widen. ‘I’m such a bitch. Never tell Braden I said that. Please?’\u003c/p\u003e\n\u003cp\u003e‘I promise.’\u003c/p\u003e\n\u003cp\u003e‘Good. If you break that promise, I’ll find a way to lock you in a room with Ellie and her romantic drama collection.’\u003c/p\u003e\n\u003cp\u003e‘You know some of us don’t find that an excruciating prospect.’\u003c/p\u003e\n\u003cp\u003e‘Fine. I’ll take up smoking just to drive your cravings nuts.’\u003c/p\u003e\n\u003cp\u003e‘You have a severely sadistic side. Anyway, I don’t have any cravings.’\u003c/p\u003e\n\u003cp\u003e‘Even when you smell cigarette smoke?’ she asked smugly.\u003c/p\u003e\n\u003cp\u003eDamn. It was true. Anytime I got a whiff of cigarette smoke, my eyes closed in torture and I had to hunt down the nearest stick of gum to quell the need for nicotine intake. ‘Your point is moot considering I’m not going to tell him.’\u003c/p\u003e\n\u003cp\u003e‘Moot? Nice word choice. The brain is certainly working well for a Sunday morning conversation. He must have really started those engines, huh?’\u003c/p\u003e\n\u003cp\u003e‘Goodbye, Joss. Oh, and you tell anyone about me and Cam before I get a chance to and I will tell Braden.’ I hung up with a satisfied smirk.\u003c/p\u003e\n\u003cp\u003eCam was staring at me as he held out my mug of coffee. ‘What was that about?’\u003c/p\u003e\n\u003cp\u003e‘I have some information she’d like me to keep quiet. She threatened to torture me with cigarette smoke if I ever give her up.’\u003c/p\u003e\n\u003cp\u003eHe frowned, pushing a plate of toast towards me. There were slices spread with butter and others with jam. I took some sugary goodness. ‘You used to smoke?’\u003c/p\u003e\n\u003cp\u003e‘Quit almost six months ago.’\u003c/p\u003e\n\u003cp\u003e‘Thank God,’ he muttered.\u003c/p\u003e\n\u003cp\u003eHis words caused a pang of anxiety at the thought that something as insignificant as being a smoker would make him less attracted to me. Would it be so easy to diminish his attraction in the future? I covered my insecure thoughts with a forced chuckle. ‘What? Would that have been a deal breaker?’\u003c/p\u003e\n\u003cp\u003eThe corner of his mouth quirked up cheekily. ‘Nah. I’d have convinced you to quit somehow. Just glad I missed the withdrawal. That must have been fun for Cole.’\u003c/p\u003e\n\u003cp\u003eMy whole body relaxed at his answer and when I laughed it was for real this time. ‘I wasn’t that bad.’\u003c/p\u003e\n\u003cp\u003e‘Yeah, yeah, I’ll get the real story from Cole.’\u003c/p\u003e\n\u003cp\u003e‘Speaking of …’ I muttered and scrolled through my phone until I found his number. Cole’s phone rang three times before I heard his voice.\u003c/p\u003e\n\u003cp\u003e‘What’s up?’\u003c/p\u003e\n\u003cp\u003e‘You on your way home?’\u003c/p\u003e\n\u003cp\u003e‘Five minutes away.’\u003c/p\u003e\n\u003cp\u003e‘Okay. I have something to talk to you about.’ I smiled at Cam, but inside I was a little nervous about Cole’s reaction to me and Cam being together.\u003c/p\u003e\n\u003cp\u003e‘That doesn’t sound good.’\u003c/p\u003e\n\u003cp\u003e‘We’ll see.’\u003c/p\u003e\n\u003cp\u003eHe grunted and I rolled my eyes.\u003c/p\u003e\n\u003cp\u003e‘See you soon.’\u003c/p\u003e\n\u003cp\u003eAnother grunt and then he hung up. I sighed. ‘Someone should have written a book by now about interpreting teen language. I was never that monosyllabic.’\u003c/p\u003e\n\u003cp\u003eCam grinned into his mug. ‘I’ll bet.’\u003c/p\u003e\n\u003cp\u003eI smacked him playfully. ‘You know what I mean.’\u003c/p\u003e\n\u003cp\u003eHe shrugged. ‘He’s a teenage boy. As far as teenage boys go I think you guys have good communication between you.’\u003c/p\u003e\n\u003cp\u003eGuessing he was probably right, I nodded and reached for another slice of toast. ‘Well, let’s see how my communication skills hold up when we try to explain this to him.’\u003c/p\u003e\n\u003cp\u003eAs Cam dumped his mug in the sink, he flashed me a wolfish grin. ‘Oh, I’d say from all that screaming you did last night and this morning, those communication skills are pretty sharp.’\u003c/p\u003e\n\u003cp\u003e‘You’re such a cocky bugger.’\u003c/p\u003e\n\u003cp\u003e‘Then stop with the screaming. It only inflates my ego. Among other things.’\u003c/p\u003e\n\u003cp\u003e‘Fine. From now on I’ll be quiet as a church mouse.’\u003c/p\u003e\n\u003cp\u003eLaughing, Cam reached for me, tugging me against his chest as I took the last bite of my toast. He kissed me, getting crumbs and jam on his lips. ‘I dare you to try to keep quiet. Go on. It’ll make things even more interesting.’\u003c/p\u003e\n\u003cp\u003eResting my hands on his chest, I leaned into him, feeling him harden against me through his jeans. I bit my lip, smiling a little as I stared at his sensual mouth. ‘I accept that dare.’ My eyes flicked to his, laughing at him. ‘It’s not like it won’t be a win-win situation.’\u003c/p\u003e\n\u003cp\u003eHis arms tightened around me. ‘Going to make me work for it, huh?’\u003c/p\u003e\n\u003cp\u003e‘You’ll enjoy the labour.’\u003c/p\u003e\n\u003cp\u003eHis grin widened and he shook his head. ‘I can’t believe we waited this long.’\u003c/p\u003e\n\u003cp\u003eStill smiling, I nodded in agreement. ‘It’s definitely fun so far.’\u003c/p\u003e\n\u003cp\u003eAlthough Cam was still smiling back at me, something grave entered his expression as he held my gaze. ‘Yeah, baby. It’s definitely fun so far.’\u003c/p\u003e\n\u003cp\u003e16\u003c/p\u003e\n\u003cp\u003eThere was a sense of unreality as Cam threaded his fingers through mine and brought my knuckles to his lips. The soft brush against my skin was like a greeting and goose bumps popped up all over my body to say hello back to him. He led me up the stairs to my flat and the whole time I gazed at him in surreal wonder, the concrete steps like marshmallow clouds beneath my feet. How could it be that sex had not had such a ‘girly’ effect on me but this arbitrary act of handholding did? For a moment, the beauty of it allowed me to forget where he was actually leading me.\u003c/p\u003e\n\u003cp\u003eMum.\u003c/p\u003e\n\u003cp\u003eFiona was sitting on the couch watching television when Cam and I entered the flat. As soon as I heard the muffled sound of voices filtering into the hall from the sitting room, my whole body tensed with the realization that Cam was about to come face-to-face with her since he’d helped Cole out the night I’d stayed at Malcolm’s.\u003c/p\u003e\n\u003cp\u003eYay.\u003c/p\u003e\n\u003cp\u003eSeeming to read my body language, Cam pressed a reassuring hand to the small of my back, guiding me into the room.\u003c/p\u003e\n\u003cp\u003eShe was lounging on the armchair in her ratty robe with her thinning hair wet. To my surprise I realized that she had obviously taken a shower without being coerced by me. She had a hot mug in her hand and it shook as she raised it to her lips, watching us as we slowly made our way farther into the room.\u003c/p\u003e\n\u003cp\u003e‘Mum.’ I gave her a brittle nod and Cam’s hand coasted around my waist, his strong arm hugging me into his side.\u003c/p\u003e\n\u003cp\u003eThe slight widening of Mum’s eyes told me she hadn’t missed the deliberate move. ‘You’ve been here before?’ She asked it quietly, with mild curiosity but no accusation, as I had been expecting. Clearly she’d forgotten Cam and his presence that awful night.\u003c/p\u003e\n\u003cp\u003e‘Cameron MacCabe.’ Cam acknowledged her gruffly, giving me a squeeze.\u003c/p\u003e\n\u003cp\u003eShe made a mumbling noise, her bloodshot eyes darting back to me. ‘No one was here this morning.’\u003c/p\u003e\n\u003cp\u003eBurrowing deeper into Cam, my hand clutching the back of his shirt like a little girl, I nodded again. ‘Cole stayed at Jamie’s.’\u003c/p\u003e\n\u003cp\u003e‘I fell.’ Her mouth pursed. ‘I fell. My back is killing me. No one was here to help. If you’re going to be gallivanting around, that little bugger should at least be here to help.’\u003c/p\u003e\n\u003cp\u003eThe insult to my brother was like a steel rod sliding into my spine. I straightened sharply, taking a step away from Cam. My eyes narrowed on her, and I tried to squelch the hurt in my chest – the hurt I felt any time she did or said something so selfish and uncaring, so lacking in parental concern. ‘Did the gin not help you back up, Mum? Funny, it seems to help you with everything else.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-33.html","bookId":1893,"creation":"Oct 5, 2019 5:07:07 PM","modification":"Oct 5, 2019 5:07:07 PM"}
