{"id":85430,"no":42,"title":"Page 42","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eMy fingernails bit into the palm of my hands at the inappropriate question while my brain cursed Malcolm to hell. ‘Sir.’\u003c/p\u003e\n\u003cp\u003e‘You silly girl.’ He shook his head, almost as if he felt sorry for me. My heart began to thump in preparation for the insult I knew was coming, my blood already heating with anger. ‘A girl with your limited talents should think more carefully in future before throwing away the opportunity to attach yourself to an affluent man like Malcolm Hendry.’\u003c/p\u003e\n\u003cp\u003eHis unkind attack slapped me back into the past.\u003c/p\u003e\n\u003cp\u003e‘Get out of my way!’ Dad bellowed, kicking out at me, catching my buttocks with his work boot as I passed. I stumbled, humiliation and pain making me whirl around and glare at him in defiance. His face darkened and he took a menacing step towards me. ‘Dinnae you look at me like that. Dinnae you! You’re nothing. Absolutely worthless.’\u003c/p\u003e\n\u003cp\u003eThe memory, summoned by Mr Meikle’s condescension, pinned me in my seat. My skin grew hot with renewed humiliation. It’s hard to believe you’re anything but worthless when a parent spends most of your formative years telling you you’re useless. A big nothing. I knew I’d carried that with me. It didn’t take a genius to understand why I had such low self-esteem, or why I had very little belief in myself.\u003c/p\u003e\n\u003cp\u003eOr why I probably never would.\u003c/p\u003e\n\u003cp\u003eHowever, I’d grown so used to thinking that way about myself that when others thought it too it didn’t seem wrong. Although Joss had spent the last few months attempting to make me see that it was wrong, it had never fully got through to me.\u003c/p\u003e\n\u003cp\u003eUntil Cameron.\u003c/p\u003e\n\u003cp\u003eHe wanted me to demand more of myself. He got angry when I didn’t, and furious when other people belittled me. He told me in little ways almost every day that he thought I was special. He chipped away at my insecurities about my intelligence, my personality, and although they were still there, they had been suppressed by his support. Every day they were squashed deeper and deeper into the caverns of my worries.\u003c/p\u003e\n\u003cp\u003eCam said I was more.\u003c/p\u003e\n\u003cp\u003eHow dare anyone who didn’t know me at all try to tell me I was less.\u003c/p\u003e\n\u003cp\u003eI pushed back from my desk, my chair careening into the metal filing shelves behind me with the force of the action. ‘I quit.’\u003c/p\u003e\n\u003cp\u003eMr Meikle blinked rapidly, the colour on his cheeks deepening to a rosy red. ‘Pardon?’\u003c/p\u003e\n\u003cp\u003eGlowering at him, I pulled my bag up off the floor and yanked my jacket off the coat stand near my desk. Standing in the doorway to his reception area, I kept my eyes on him in defiance as I put my jacket on. ‘I said, I quit. Find someone else to hiss at with your viperous tongue, you short old windbag.’\u003c/p\u003e\n\u003cp\u003eI spun around on trembling legs and left him spluttering in my wake as I hurried out the door, down the stairs, and out the main entrance. Adrenaline pumped through me as I marched down the street fuelled by ire and self-righteous indignation.\u003c/p\u003e\n\u003cp\u003eCool air blew through my hair and across my cheeks until the fire began to wane and my trembling increased.\u003c/p\u003e\n\u003cp\u003eI’d just quit my job.\u003c/p\u003e\n\u003cp\u003eThe job Cole and I needed.\u003c/p\u003e\n\u003cp\u003eThe breath whooshed out of me and I stumbled against a wrought-iron fence, struggling to get air into my lungs. What were we going to do? We couldn’t survive on my wages from the bar, and jobs weren’t exactly easy to come by. I had some money put away, but that money was for Cole, not for me to burn through while I tried to find a new job.\u003c/p\u003e\n\u003cp\u003e‘Oh, fuck,’ I muttered, tears pricking the corners of my eyes as I pushed myself off the fence, looking back the way I’d come. I could feel the eyes of passers-by on my face, as they sensed my distress and probably wondered if I needed help. ‘I need to go back.’ I took two steps back towards the office, then stopped, clenching my fists at my sides.\u003c/p\u003e\n\u003cp\u003eI was halted by pride.\u003c/p\u003e\n\u003cp\u003eMe? Halted by pride?\u003c/p\u003e\n\u003cp\u003eI gave a huff of hysterical laughter and clutched my stomach, fighting the urge to be sick.\u003c/p\u003e\n\u003cp\u003eI couldn’t go back. Meikle wouldn’t even take me back after what I’d just said to him.\u003c/p\u003e\n\u003cp\u003e‘Oh, God.’ I pushed a shaking hand through my hair, gulping in as much air as I could.\u003c/p\u003e\n\u003cp\u003eAnd then it hit me.\u003c/p\u003e\n\u003cp\u003eThis was Cam’s fault.\u003c/p\u003e\n\u003cp\u003eMy attraction to him had caused me to dump a wealthy, kind, handsome man who I knew cared about me. And now I’d quit my job! And for what? Because Cameron was charming enough to make me feel special, to make me feel better about myself? What about something real? What about telling me he loved me, huh?\u003c/p\u003e\n\u003cp\u003eIt had been only six weeks, but I knew I loved him. Shouldn’t he know he loved me? It wasn’t like he wasn’t capable of it. He’d fucking loved Blair!\u003c/p\u003e\n\u003cp\u003eMore tears trembled on my eyelashes. I was mucking up my life because of him. Making impulsive, stupid decisions that were going to wreck any hope of a financially secure future for Cole.\u003c/p\u003e\n\u003cp\u003eOh, God … Cole.\u003c/p\u003e\n\u003cp\u003eI’d let him get close to Cole too.\u003c/p\u003e\n\u003cp\u003eWho did that?\u003c/p\u003e\n\u003cp\u003eWho played Russian roulette not only with their own emotions but with their bloody kid’s?\u003c/p\u003e\n\u003cp\u003eI had to do something. Quickly. I needed space. Time to re-evaluate before it was too late.\u003c/p\u003e\n\u003cp\u003eI needed to see Cam.\u003c/p\u003e\n\u003cp\u003eDespite my alarming pace, the usually forty-minute distance that I covered in twenty-five minutes still seemed to take forever, and I had to stop myself from walking down to Joss’s flat on Dublin Street when I passed it. Perhaps talking this over with a friend would help, would clear up all my confusion, but I feared that Joss, who was Team Cameron, would only convince me I was being hysterical.\u003c/p\u003e\n\u003cp\u003eAnd maybe I was.\u003c/p\u003e\n\u003cp\u003eIn fact, somewhere inside, I was pretty sure I was, but right now the anger and panic were overruling logic.\u003c/p\u003e\n\u003cp\u003eLogic that Joss probably would have used to talk me round. But Joss was hiding out from Ellie at the moment because Els had gone overboard with plans for the engagement party that was to take place in two weeks. With her brain ready to explode from Ellie in celebration mode, Joss had told me the other night at work that she had taken to not answering her door during the day. Five weeks of planning for a party? If I were Joss I’d be in hiding too.\u003c/p\u003e\n\u003cp\u003eWith no one to talk me down and my emotions rocketing all over the place, I stormed into my building and stomped up the stairs, breathless by the time I reached Cam’s flat. I may have pounded on his door harder than was necessary.\u003c/p\u003e\n\u003cp\u003e‘Jesus Chr–’ Cam cut his words short at the sight of me as he opened the door to find me there, dishevelled and out of breath. ‘Jo? What are you – why aren’t you at work?’\u003c/p\u003e\n\u003cp\u003eMy eyes skimmed over him. He was kind of dressed up for Cam. The Diesel T-shirt he wore looked new and was a little more tight-fitting than his usual tees, sculpting the lean lines of muscle in his strong body. And were those new jeans? My eyes dropped to the black Levi’s and I was almost relieved to see he was wearing his scuffed black engineer boots. Why was he semi-dressed up?\u003c/p\u003e\n\u003cp\u003eHe looked hot.\u003c/p\u003e\n\u003cp\u003eIt was such a turn-on when he gazed at me with those warm blue eyes, even when they were all worried and concerned as they were now. ‘Jo?’ He stepped out of his flat, reaching for me.\u003c/p\u003e\n\u003cp\u003eI wanted to lean into him, to let him hold me against him, to breathe him in, to feel his lips on my skin. I wanted that forever.\u003c/p\u003e\n\u003cp\u003eNo, dammit! I drew back, taking him by surprise. I needed space. Every time I was near him, he just befuddled my brain.\u003c/p\u003e\n\u003cp\u003eHe frowned, dropping his arm. ‘What’s wrong?’\u003c/p\u003e\n\u003cp\u003eI suddenly had an overwhelming desire to start crying. I held it at bay and looked anywhere but at him. ‘I quit my job.’\u003c/p\u003e\n\u003cp\u003eSilence fell between us for a moment and then he replied, ‘That’s good.’\u003c/p\u003e\n\u003cp\u003eMy glare skewered him to the wall behind him. ‘No. It’s not good. It’s not bloody good, Cam.’\u003c/p\u003e\n\u003cp\u003e‘Okay, baby, calm down. Obviously something has happened.’ He sighed heavily and ran a hand through his hair. ‘And I’m about to make it either better or worse. I need to tell you something.’\u003c/p\u003e\n\u003cp\u003eShaking my head, I took a step up the stairs that would lead me to my flat. ‘I don’t want to know. Cam’ – I took a deep breath, reaching far inside me for the strength to say it – ‘I need space to think.’\u003c/p\u003e\n\u003cp\u003eHe looked stunned, almost like I’d hit him. ‘Space?’\u003c/p\u003e\n\u003cp\u003eI nodded, chewing my lip to hell.\u003c/p\u003e\n\u003cp\u003eAnd then Cam’s eyes darkened, his whole expression growing taut with coming anger. I began to gnaw my lip as he took a menacing step towards me. ‘Space from me?’\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e‘Fuck that shit,’ he growled, his hands reaching for me before drawing back with restraint. ‘What the hell happened today?’\u003c/p\u003e\n\u003cp\u003e‘You did,’ I replied as calmly as I could.\u003c/p\u003e\n\u003cp\u003eHis eyes only blazed bluer. Apparently my being calm only exacerbated his anger. ‘Me?’\u003c/p\u003e\n\u003cp\u003e‘I keep making these rash decisions and being completely selfish and that’s not fair to Cole.’\u003c/p\u003e\n\u003cp\u003eCam screwed up his face. ‘Rash decisions? Am I a fucking rash decision? Is that what you’re saying?’\u003c/p\u003e\n\u003cp\u003e‘No!’ I cried, aghast at the hurt in his eyes. ‘No. I don’t know.’ I threw up my hands, so confused I just wanted the floor to open up and swallow me whole. ‘Are you? Are we? I mean what are we doing here? I keep expecting –’\u003c/p\u003e\n\u003cp\u003e‘Expecting what?’\u003c/p\u003e\n\u003cp\u003e‘You to just wake up one day, realize you’re bored out of your skull, and end it.’\u003c/p\u003e\n\u003cp\u003eA very tense silence fell between us again, and I watched with growing nervousness as Cam struggled to control his frustration. Finally he met my gaze and asked quietly, ‘Have I ever given you that impression? That I’m just messing around? I took you to meet my parents, for Christ’s sake, not to mention what I’ve just done today. That bullshit is in your head and I didn’t put it there, so what is going on?’\u003c/p\u003e\n\u003cp\u003eI threw up my hands again, tears glistening in my eyes. ‘I don’t know. I quit my job and being angry at me only took me so far, so I had to be angry at you! And I’m on my period, so I might be a little emotional.’ I sucked back tears.\u003c/p\u003e\n\u003cp\u003eHis lips twitched now, the anger easing from his expression.\u003c/p\u003e\n\u003cp\u003e‘It’s not funny!’ I stomped my foot like a petulant child.\u003c/p\u003e\n\u003cp\u003eWith a grunt, Cam answered by hauling me off the stairs and into his arms. I automatically wrapped my arms around him and buried my burning face in his neck. \u003c/p\u003e","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-42.html","bookId":1893,"creation":"Oct 5, 2019 5:07:07 PM","modification":"Oct 5, 2019 5:07:07 PM"}
