{"id":85431,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e‘No more talk about needing space?’ he asked hoarsely, his warm breath on my ear.\u003c/p\u003e\n\u003cp\u003eI nodded in agreement and his arms tightened.\u003c/p\u003e\n\u003cp\u003e‘Why did you quit?’\u003c/p\u003e\n\u003cp\u003eI pulled back and he eased me to my feet, although he didn’t let go of me. Now that I was this close to him I didn’t want to let go either.\u003c/p\u003e\n\u003cp\u003eJesus, I was such a mess.\u003c/p\u003e\n\u003cp\u003e‘He found out I dumped Malcolm and he said some horrible things to me.’\u003c/p\u003e\n\u003cp\u003eCam’s face clouded over. ‘What horrible things?’\u003c/p\u003e\n\u003cp\u003eI shrugged. ‘Basically he said I was stupid for dumping a rich man when that was about as good as my life would get.’\u003c/p\u003e\n\u003cp\u003e‘I’m going to kill him. First, you’re going to report him for misconduct, and then I’m going to kill him.’\u003c/p\u003e\n\u003cp\u003e‘I don’t want anything else to do with him.’\u003c/p\u003e\n\u003cp\u003e‘Jo, he crossed a line.’\u003c/p\u003e\n\u003cp\u003e‘Yeah, he did. But I don’t have the luxury of time to go through the rigmarole of seeing him brought to some kind of meagre justice. I have to find a job.’\u003c/p\u003e\n\u003cp\u003e‘Braden.’\u003c/p\u003e\n\u003cp\u003e‘Nope.’ I pinched my lips together.\u003c/p\u003e\n\u003cp\u003eCam shook his head. ‘You are so bloody stubborn.’ And then he kissed my pinched mouth open, his lips light at first and then pressing harder, drawing me deeper into his demand for more.\u003c/p\u003e\n\u003cp\u003eWhen he finally let me up for breath, his expression was almost pained. ‘Don’t do that to me again, okay?’\u003c/p\u003e\n\u003cp\u003eFeeling ashamed of my behaviour, and vowing to be absolutely sure about a decision before throwing something as important as a break-up Cam’s way, I pressed another kiss to his lips, my hands cupping his bristly cheeks tenderly, hoping he understood more in that kiss than I was willing to say. ‘I’m sorry,’ I whispered.\u003c/p\u003e\n\u003cp\u003e‘You’re forgiven.’ He squeezed my waist.\u003c/p\u003e\n\u003cp\u003eSmoothing my hands down his new T-shirt, I puckered my brows in thought. ‘Why are you dressed up? And what did you mean “not to mention what I’ve just done today”?’\u003c/p\u003e\n\u003cp\u003e‘Ah.’ Cam pushed me back a little. ‘There’s someone here to see you.’\u003c/p\u003e\n\u003cp\u003e21\u003c/p\u003e\n\u003cp\u003eYou would think that after witnessing my crazy emotional drama Cam would have been considerate enough to prepare me for who was in his flat waiting for me.\u003c/p\u003e\n\u003cp\u003eBut no.\u003c/p\u003e\n\u003cp\u003eHe wanted it to be a surprise.\u003c/p\u003e\n\u003cp\u003eFeeling a little nervous about whatever unknown thing awaited me, I followed him into his sitting room.\u003c/p\u003e\n\u003cp\u003eMy eyes immediately were drawn to a young woman rising from Cam’s couch. Shorter than me but taller than Joss, she stood there, all curves and ass and amazing hair. For some reason, my immediate thought was that this was Blair. I stared into exceptionally light hazel eyes, so light they were almost gold, and felt my throat close up. Some might say the woman was slightly overweight, but all I processed was the big boobs and curvy ass, which looked good on her. Her jet-black hair cascaded down her back in an amazing riot of soft waves. Thinking this woman was Blair, and hating her on sight, I didn’t realize for a while that the rest of her features were kind of plain. Her hair, eyes and figure gave the impression of extraordinary.\u003c/p\u003e\n\u003cp\u003eThen she smiled.\u003c/p\u003e\n\u003cp\u003eShe had a knee-knockingly great smile. ‘Jo?’\u003c/p\u003e\n\u003cp\u003eAnd an American accent.\u003c/p\u003e\n\u003cp\u003eUh … what?\u003c/p\u003e\n\u003cp\u003e‘Johanna?’\u003c/p\u003e\n\u003cp\u003eThe gruff voice drew my gaze to the left, and my eyes widened at the sight of the large man standing next to Cam’s fireplace. The weight of his light hazel eyes on me made me stagger back in shock. I’d been so consumed with jealousy, thinking the woman was Blair, that it hadn’t even registered how familiar those exotic eyes were.\u003c/p\u003e\n\u003cp\u003e‘Uncle Mick?’ I breathed in shock, my eyes running the length of him.\u003c/p\u003e\n\u003cp\u003eHe looked older now, grey peppering his dark hair and beard, but it was him. A tower of a man, standing at six and a half feet tall with huge shoulders, he still looked as fit and healthy as he had eleven years ago. Everyone had always said Uncle Mick was built like a brick shithouse. He still was.\u003c/p\u003e\n\u003cp\u003eWhat was he doing here?\u003c/p\u003e\n\u003cp\u003e‘Jo.’ He shook his head, giving me a grin that made me feel homesick. ‘I always knew you’d be a knockout, lass, but just look at you.’ His accent threw me for a moment, the sharp, abrupt inflection of Scots softened slightly in certain words by an American drawl. His accent was Joss’s in reverse.\u003c/p\u003e\n\u003cp\u003eStill dumbstruck, I could only say his name again. ‘Uncle Mick?’ I glanced back at Cam, my mouth open in wonder, my heart in my throat. ‘What is going on?’\u003c/p\u003e\n\u003cp\u003eCam stepped forward and took my hand in reassurance. ‘You told me Mick’s surname, that he’d moved to Arizona, and you showed me old photographs. Mick has a Facebook account, and I tracked him down on there.’\u003c/p\u003e\n\u003cp\u003eFacebook? I looked back at Mick incredulously, still not believing he was here. Everything that had been good about my life as a child was standing in front of me and I didn’t know whether I wanted to run facefirst into his chest or turn on my heel and flee.\u003c/p\u003e\n\u003cp\u003e‘Cam and I got to talking and he told me how difficult things have been for you, darling. I’m so sorry.’ Mick’s voice was low, as though he were talking to a frightened animal. ‘I’m so sorry I wasn’t here.’\u003c/p\u003e\n\u003cp\u003eI gulped and for the hundredth time that day tried desperately not to cry. ‘Why are you here?’\u003c/p\u003e\n\u003cp\u003e‘We came back a few years ago to Paisley for a short visit, but no one knew where you’d gone. I saw your dad.’\u003c/p\u003e\n\u003cp\u003eI winced at the thought of my father. ‘He’s still there, then?’\u003c/p\u003e\n\u003cp\u003eMick nodded, taking a step towards me. ‘I’m glad Fiona got you away from him. I’m glad he has no clue where you went and is too stupid to find you.’\u003c/p\u003e\n\u003cp\u003eI felt my nose sting with the tears I could no longer hold back. ‘So you came all the way here to see me?’\u003c/p\u003e\n\u003cp\u003eHe grinned. ‘You’re worth the plane ticket, baby girl.’\u003c/p\u003e\n\u003cp\u003eBaby girl. He’d always called me that and I’d loved it. It was why I called Cole ‘baby boy’. The sob rose out of my mouth before I could stop it, and seemingly done with being patient, Uncle Mick made a rough noise and crossed the room to pull me into a bear hug. I hugged him back, breathing him in. Mick had never been one for aftershave. He’d always smelled of soap and earth. The ache in my chest intensified as I reverted to a ten-year-old in his arms.\u003c/p\u003e\n\u003cp\u003eWe stood together for a good while, until my crying finally trailed off, and then Mick eased me back, his light eyes – eyes I’d loved more than any other eyes in the world until Cole came along – were bright on me. ‘I’ve missed you.’\u003c/p\u003e\n\u003cp\u003eI laughed in an attempt to curb another crying jag. ‘Missed you, too.’\u003c/p\u003e\n\u003cp\u003eClearing his throat and shifting uncomfortably under the weight of emotion between us, Mick turned to look back at the young woman. Although he introduced her, I no longer needed to be told who she was. Her eyes gave her away. ‘Jo, this is Olivia, my daughter.’\u003c/p\u003e\n\u003cp\u003eOlivia’s eyes were shining with tears as she took a step towards me. ‘It’s nice to meet you, Jo. Dad has been talking about you for years, so I almost feel like I know you. God, was that as cliché as it sounded?’\u003c/p\u003e\n\u003cp\u003eI smiled weakly, not quite sure how I felt about her. Watching the way Uncle Mick gazed adoringly at his daughter, I was happy for him. Happy he’d found his own family. But the thirteen-year-old girl inside me resented Olivia – resented her for being what had taken Mick away in the first place.\u003c/p\u003e\n\u003cp\u003eI tried to quash that feeling, knowing it was useless and childish and petty, but it was there no matter how much I didn’t want it to be.\u003c/p\u003e\n\u003cp\u003e‘After coming to Paisley and not finding you, we tried Facebook too, but you don’t have an account. We thought we’d found Cole, but we couldn’t be sure, and Dad was worried that you didn’t want to hear from him anyway.’\u003c/p\u003e\n\u003cp\u003eI looked up at Mick, my hand curling on his arm. ‘I’m sorry for losing touch. It was childish.’\u003c/p\u003e\n\u003cp\u003e‘Baby girl, you were just a child.’\u003c/p\u003e\n\u003cp\u003e‘Cam was pretty sure you’d want to see Dad.’ Olivia smiled gratefully behind me and I turned to face Cameron.\u003c/p\u003e\n\u003cp\u003e‘I can’t believe you did this,’ I whispered softly, knowing and not caring at the moment that everything I felt for him was shimmering in my eyes.\u003c/p\u003e\n\u003cp\u003eCam’s knuckles brushed along my jaw affectionately. ‘Happy?’\u003c/p\u003e\n\u003cp\u003eI nodded, choking on the lump in my throat. I was happy. Just having Mick in the room … I felt safe.\u003c/p\u003e\n\u003cp\u003eWe settled around Cam’s coffee table while he made us refreshments. I sat between Mick and Olivia, surprised by Olivia’s friendliness and enthusiasm. I’d have thought she’d be mad at me for having had her dad for the first thirteen years of our lives, but she seemed anything but mad. She seemed glad for her dad that they had found me.\u003c/p\u003e\n\u003cp\u003e‘How long are you staying?’ I asked Mick as he relaxed against the cushions, his long arm draping across the back of the sofa behind me.\u003c/p\u003e\n\u003cp\u003eHis eyes drifted to Olivia as he replied, ‘We don’t know yet.’\u003c/p\u003e\n\u003cp\u003eWhen Cam rejoined us the questions just started pouring out of my mouth.\u003c/p\u003e\n\u003cp\u003eI was saddened by some of the answers and my resentment towards Olivia began to diminish. I wasn’t the only one who hadn’t had it easy.\u003c/p\u003e\n\u003cp\u003eMick had moved to Phoenix to get to know his daughter, and there his affair with her mother, Yvonne, rekindled. Mick worked for a few contractors over there, he and Yvonne got married, and they were a happy family. Until Yvonne was diagnosed with stage IV breast cancer. She passed away three years ago, leaving Olivia and Mick all alone in the world. Yvonne’s mother and sister lived in New Mexico, but they weren’t that close to them.\u003c/p\u003e\n\u003cp\u003e‘We thought of Cameron’s e-mails as a sign,’ Olivia told me quietly. ‘Perhaps we just need a break from Arizona …’ She shrugged. ‘It just seemed like the right thing to do to come here and see you and take a breath.’\u003c/p\u003e\n\u003cp\u003eI frowned. ‘But what about your lives there? Uncle Mick’s business? Your job?’\u003c/p\u003e\n\u003cp\u003e‘Things haven’t been the same for us in Phoenix for a long time,’ Mick replied softly. ‘We both thought a break might do us good.’ I gathered from the sadness buried in the back of his eyes, he meant things hadn’t been the same for them since Yvonne’s death. Mick smiled softly down at me. ‘Do you fancy coming on a wee walk with me, Jo? We’ll talk.’ \u003c/p\u003e","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-43.html","bookId":1893,"creation":"Oct 5, 2019 5:07:07 PM","modification":"Oct 5, 2019 5:07:07 PM"}
