{"id":85437,"no":49,"title":"Page 49","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAssured that the drunken twat would be fine, I got up out of his bed and pulled on my boots.\u003c/p\u003e\n\u003cp\u003eMaybe I should try just depending on myself for a while.\u003c/p\u003e\n\u003cp\u003e25\u003c/p\u003e\n\u003cp\u003eWhere are you? x\u003c/p\u003e\n\u003cp\u003eI looked down at Cam’s text, sighed a little, and then quickly texted him back.\u003c/p\u003e\n\u003cp\u003eTook Cole out to lunch with Mick and Olivia. Hungover? x\u003c/p\u003e\n\u003cp\u003e‘I know it’s none of my business, but you seem a little out of it,’ Olivia observed softly as she strolled beside me.\u003c/p\u003e\n\u003cp\u003eUncle Mick and Cole walked ahead of us and I could see Mick chatting away quite animatedly to Cole. We’d gone for lunch at the Buffalo Grill, this amazing Tex-Mex place behind the university. Now we were walking off our burgers with a nice Sunday stroll down the Meadows. We weren’t the only ones enjoying the large park behind the uni. Friends and families had descended upon it, playing football and tennis, chasing playful dogs, and in general hanging out and enjoying the fair spring weather while it lasted. I’d decided this morning that I didn’t really feel like facing Cam or our problems. Instead I’d pounced on Cole as soon as he’d got home and then called Uncle Mick to suggest lunch. I’d found myself breathing a little easier as soon as Cole and I stepped out of our building and had been trying to enjoy myself until Cam had intruded upon my thoughts with his text.\u003c/p\u003e\n\u003cp\u003eMy phone buzzed before I could respond to Olivia’s comment.\u003c/p\u003e\n\u003cp\u003eCam’s reply:\u003c/p\u003e\n\u003cp\u003eA wee bit. You okay? x\u003c/p\u003e\n\u003cp\u003e‘Just a second, Olivia,’ I muttered apologetically, before replying that I was fine and I’d see him when I got back.\u003c/p\u003e\n\u003cp\u003e‘Is that Cam?’ She nodded down at my phone.\u003c/p\u003e\n\u003cp\u003e‘Aye.’ I’d sadistically hoped he was suffering the worst hangover ever. He couldn’t even give me that. ‘I’ve never seen him that drunk before.’\u003c/p\u003e\n\u003cp\u003e‘Is he okay?’\u003c/p\u003e\n\u003cp\u003eI studied her for a moment. We didn’t know each other all that well, so I didn’t know if I could confide in her. I’d gone to Joss and Braden for help because I trusted them to be honest, but the welcome advice they’d given me had been blown to smithereens by Cam’s dive to the bottom of a bottle last night. I did feel the urge to talk to someone else about it, but Olivia? I just didn’t know her that well.\u003c/p\u003e\n\u003cp\u003eAs if she sensed the turn of my thoughts, she gave me an understanding smile. ‘I get it. You’re not sure you can talk to me. That’s cool – but you should know I’m really good at dispensing advice and keeping secrets. If I hadn’t become a librarian I most certainly would have become an advice columnist by day and a spy by night.’\u003c/p\u003e\n\u003cp\u003eI chuckled. ‘Well, that’s good to know. Truthfully, I don’t even know what to say. I don’t know if it’s all in my head or if there really is a problem.’\u003c/p\u003e\n\u003cp\u003eOlivia cleared her throat. ‘You’re obviously distressed about something and … well … I learned a hard lesson in the past about ignoring something just because I thought it was all in my head.’\u003c/p\u003e\n\u003cp\u003eMomentarily distracted, I asked tentatively, ‘What happened?’\u003c/p\u003e\n\u003cp\u003eHer unusual eyes narrowed and I noted that she unconsciously clenched her hands into fists. ‘Mom. She was weird for a while before we learned her diagnosis. She was snippy, short-tempered, impatient. This was a woman who was pretty much the most laid-back person I knew. My gut told me something was seriously wrong, but I didn’t press her about it. And I should have. If I had, I might have got her to go to the doctor’s about the lump in her breast. Instead she was so frozen with fear, by the time she finally found the courage to do something about it, it was too late.’\u003c/p\u003e\n\u003cp\u003e‘God, Olivia, I’m so sorry.’\u003c/p\u003e\n\u003cp\u003eShe shrugged. ‘I live with that guilt every day, so whatever your gut is telling you, don’t ignore it.’\u003c/p\u003e\n\u003cp\u003eI was so busy scrutinizing the dark shadows lurking in her eyes that I sidestepped Olivia’s advice completely. ‘Does Uncle Mick know how you feel about your mum’s death?’\u003c/p\u003e\n\u003cp\u003e‘Yeah.’ She nodded. ‘He worries. But I’m okay.’\u003c/p\u003e\n\u003cp\u003e‘If you ever want to talk …’\u003c/p\u003e\n\u003cp\u003eOlivia smiled sadly at me. ‘Thanks, Jo. I mean that. You’ve been really cool about me being here, and I know that can’t be easy. I can tell by the way you look at Dad that he’s important to you, and after seeing what your mom is like, I kind of hate myself for taking him away from you when you so obviously needed him.’\u003c/p\u003e\n\u003cp\u003e‘Don’t ever feel that way. You’re his daughter. And he needed you. I understand that. “Teen Me” didn’t, but “Adult Me” gets it. And “Adult Me” is finally all right with it.’ I watched Mick laugh at something Cole said. ‘But it’s nice to have him back for a while.’\u003c/p\u003e\n\u003cp\u003e‘Cameron must really care about you to have gone to all the trouble of finding us?’\u003c/p\u003e\n\u003cp\u003eThere was a question within her question, and I knew Olivia realized that whatever was troubling me was about Cam. I felt the need to confide in her forcing its way to the fore. I’d spent so long bottling everything up and keeping it to myself, I guess I was kind of tired of shouldering every little problem in silence. ‘Cam and I bumped into his ex-girlfriend yesterday.’\u003c/p\u003e\n\u003cp\u003eOlivia sighed heavily. ‘Ah.’\u003c/p\u003e\n\u003cp\u003e‘He told me a while back he’d been in love with this girl Blair. They broke up because she left to work at a university in France, not because they fell out of love. Now she’s back and they’re already exchanging text messages. You must have seen how subdued and weird Cam was yesterday after it, and then you saw how bloody drunk he got – and he never gets drunk. So now I’m thinking the worst. Blair’s back and Cam’s head is all messed up because he still loves her.’\u003c/p\u003e\n\u003cp\u003e‘Whoa, okay, that’s a lot.’ Olivia threw her shoulders back and began counting down her points on her fingers. ‘One: you don’t know he still loves her. Two: bumping into an ex you have real history with will mess with anyone’s head. Three: he doesn’t get to just start up a friendship with this woman without discussing it with you, which brings me to four: you have to talk to him about it. Otherwise the uncertainty is just going to eat away at your relationship like a virus.’\u003c/p\u003e\n\u003cp\u003eI nodded. ‘You’re right. You are good at this.’\u003c/p\u003e\n\u003cp\u003e‘I know. So are you going to take my advice?’\u003c/p\u003e\n\u003cp\u003e‘I have a little insecurity problem, so it might take me a while to gather the nerve to approach him about it.’\u003c/p\u003e\n\u003cp\u003e‘In other words you’re afraid he’s going to turn around and say that he’s in love with this Blair person.’\u003c/p\u003e\n\u003cp\u003eI frowned. ‘You might want to add mind reader to your résumé.’\u003c/p\u003e\n\u003cp\u003e‘Yeah, I think we’ve established that I am awesome.’ She grinned cheekily.\u003c/p\u003e\n\u003cp\u003eI smiled back. ‘Agreed.’\u003c/p\u003e\n\u003cp\u003eJust as quickly as her grin had appeared, Olivia grew serious again. ‘Find the courage to talk to him, Jo, or it’ll blow out of proportion.’\u003c/p\u003e\n\u003cp\u003e‘Courage?’ I furrowed my brow. ‘Do you think I can download that from the Internet?’\u003c/p\u003e\n\u003cp\u003e‘It wouldn’t surprise me. But it’ll probably come with strings attached and a whole host of nasty ramifications.’\u003c/p\u003e\n\u003cp\u003e‘So I’m going to have to steal it from someone else, then?’\u003c/p\u003e\n\u003cp\u003e‘What do you mean steal courage? Johanna Walker, you’re one of the bravest, strongest people I’ve ever met, and that’s saying something – I come from Arizona, where about six million people willingly live in torturous heat between May and September.’\u003c/p\u003e\n\u003cp\u003e‘Cam says he thinks I’m strong, too,’ I murmured disbelievingly.\u003c/p\u003e\n\u003cp\u003e‘Girl, talk to him. I cannot believe that a man who looks at you in a way that actually makes me think that being in a relationship might be pretty sweet could possibly be in love with someone else.’\u003c/p\u003e\n\u003cp\u003eI sucked in a deep breath. ‘Okay. I’ll talk to him.’\u003c/p\u003e\n\u003cp\u003eOlivia smacked me on the back, making me wince. ‘That a girl!’\u003c/p\u003e\n\u003cp\u003eA few hours later I said goodbye to Uncle Mick and Olivia on Princes Street with plans to meet them for dinner during the week, and then I dropped Cole off at the Omni Centre, where he was meeting up with his friends. Before I left, he grabbed my arm.\u003c/p\u003e\n\u003cp\u003e‘Jo, you okay?’ he asked, his eyebrows drawn together in concern.\u003c/p\u003e\n\u003cp\u003eI marvelled that I was now looking my brother in the eye. I wished he wasn’t so tall for his age; it would at least allow me to pretend he wasn’t growing up if he still looked like a wee boy. However, height or no height, nothing could diminish his intuitiveness. It was a part of who he was, it was a part of our relationship – he knew me too well. I shrugged. ‘I’m okay.’\u003c/p\u003e\n\u003cp\u003eCole stuck his hands in his jeans, hunching over, his head bowed towards me, his eyes searching mine. ‘Is there something I should know?’\u003c/p\u003e\n\u003cp\u003e‘I’m just feeling a little off. It’s a girl thing,’ I reassured him with a soft smile. ‘Now go. Hang out with your friends and be immature. Responsible,’ I added hurriedly, ‘but immature.’\u003c/p\u003e\n\u003cp\u003eHe made a face. ‘Do those two go hand in hand?’\u003c/p\u003e\n\u003cp\u003e‘If your immaturity can lead to consequences, then it’s irresponsible.’\u003c/p\u003e\n\u003cp\u003eCole grunted. ‘You should write that shi– stuff down.’\u003c/p\u003e\n\u003cp\u003e‘I heard the “shit” in there, baby boy, and I’m stealing the last Pop-Tart as punishment.’\u003c/p\u003e\n\u003cp\u003e‘Harsh, Jo.’ He shook his head, backing off with a smile. ‘Harsh.’\u003c/p\u003e\n\u003cp\u003eI rolled my eyes and gave him a little wave before I left him there, hoping to use the walk back home to bolster my courage.\u003c/p\u003e\n\u003cp\u003eBy the time I was standing outside Cam’s door I was pretty sure I was ready to call him on his bullshit. Having already texted him to let him know I was on my way, I didn’t bother to knock. ‘It’s me,’ I called as I stepped inside and shut the door.\u003c/p\u003e\n\u003cp\u003e‘In here.’\u003c/p\u003e\n\u003cp\u003eI followed his voice to the sitting room and was surprised to find that Nate was with him. Even more surprising, the telly wasn’t on. Glancing down at the coffee mugs and the half-eaten sandwiches from the local deli, it was clear that Nate had stopped by for a chat. \u003c/p\u003e","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-49.html","bookId":1893,"creation":"Oct 5, 2019 5:07:07 PM","modification":"Oct 5, 2019 5:07:07 PM"}
