{"id":85442,"no":54,"title":"Page 54","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShaking my head, I gave Mick a glum smile. ‘I had a fight with Cam.’\u003c/p\u003e\n\u003cp\u003eHe frowned. ‘About what?’\u003c/p\u003e\n\u003cp\u003eAnd so I laid it out for him, telling him about Blair and my insecurity over their friendship and my worry that Cameron would never really respect me the way he would respect someone like Blair.\u003c/p\u003e\n\u003cp\u003e‘All that’s going on in your head?’ Mick asked in disbelief.\u003c/p\u003e\n\u003cp\u003eConfused, I nodded slowly.\u003c/p\u003e\n\u003cp\u003e‘Jesus Christ, woman. I doubt very much Cam was thinking any of the shit you threw at him last night. It probably felt like it came out of nowhere. You know, men don’t think like women.’\u003c/p\u003e\n\u003cp\u003e‘Well …’ I pulled a face. ‘That’s because you have the emotional capacity of a shot cup.’\u003c/p\u003e\n\u003cp\u003eMick huffed in amusement as we met Ryan outside. ‘I’ll take it, son.’ He nodded at him.\u003c/p\u003e\n\u003cp\u003e‘Great.’ Ryan beamed. ‘Let’s get you back to the office so we can sign all the forms.’\u003c/p\u003e\n\u003cp\u003eWe followed Ryan down the street as he talked at someone on his phone. Everything about him was so polished, so rehearsed. I actually couldn’t believe that only four months ago I would have been attracted to the douche bag.\u003c/p\u003e\n\u003cp\u003eDouche bag?\u003c/p\u003e\n\u003cp\u003eOh, Christ, I was spending too much time with Cole these days.\u003c/p\u003e\n\u003cp\u003e‘Back to my earlier point,’ Uncle Mick suddenly said, drawing my gaze away from Ryan’s well-tailored jacket. ‘I think you’re overthinking the whole thing. I think you’ll find that boy cares a great deal about you and would be willing to compromise. And I can tell you for a fact he didn’t mean what he said last night. You know we all say shit we don’t mean when we’re angry.’\u003c/p\u003e\n\u003cp\u003e‘You think he cares a great deal about me?’\u003c/p\u003e\n\u003cp\u003eRolling his eyes (someone else was spending too much time with Cole, too), Mick sighed. ‘Of course he does. Jesus Christ, girl. Get your head out of your arse.’\u003c/p\u003e\n\u003cp\u003eI’d been planning on popping down to Cam’s before my shift at the bar that night, but when I tried his door there was no answer. Since he hadn’t texted me or called me, I thought perhaps it was a good thing anyway. Maybe he needed time away from me to cool down.\u003c/p\u003e\n\u003cp\u003eI received a text from Joss before heading to work, explaining she wouldn’t be in tonight because she’d caught a bug that Declan had picked up at school and couldn’t keep anything down.\u003c/p\u003e\n\u003cp\u003eLovely.\u003c/p\u003e\n\u003cp\u003eShe said Sadie was covering for her.\u003c/p\u003e\n\u003cp\u003eBrian greeted me cheerily at the door to the bar and introduced me to our new doorman, Vic. He was this huge, hulking Polish guy I wouldn’t want to mess with. I smiled hello at Vic and got a stoic nod back. I raised an eyebrow at Brian. ‘What happened to Phil?’ Not that I would miss him.\u003c/p\u003e\n\u003cp\u003e‘Left us for greener pastures,’ Brian replied with a shrug.\u003c/p\u003e\n\u003cp\u003eMimicking his shrug, I went inside to find Sadie and Alistair working behind the bar. Su still hadn’t found a replacement for Cam, so Alistair was back to covering the shifts that he could. Sadie was a twenty-one-year-old postgrad student who usually worked Monday nights. She seemed like a cool girl. She was outgoing and funny and very smart. We’d only worked together a few times, so I didn’t really know her that well, and tonight would be busy so I didn’t imagine that would change in any way.\u003c/p\u003e\n\u003cp\u003eThree hours later the place was packed. The three of us were worked off our feet and I hid in Su’s office during my break since the sound level was much quieter in there. I also obsessively checked my phone, but Cam still hadn’t got in touch. Biting my lip, I wondered if I should be worried, but then it occurred to me that I hadn’t contacted him either, and maybe he was sitting looking at his phone, worrying about why I hadn’t texted him.\u003c/p\u003e\n\u003cp\u003eGod, I hoped so.\u003c/p\u003e\n\u003cp\u003eWhen I got back to the bar, it was so busy I thankfully didn’t have time to dwell on my relationship. In fact my head was so into work that when the guy first pushed his way to the front of the bar and leaned across it I didn’t recognize him. I shot him a quick, irritated look, not having much patience with anyone who shoved himself to the front of the queue, but I hurried down the bar to get a beer for my customer, not registering who he was. It wasn’t until I stretched back up from the fridge and realized he’d shoved his way down to the end of the bar to be near me that I took the time to really look at him.\u003c/p\u003e\n\u003cp\u003eGrey-blue eyes stared at me out of a rugged, older man’s face. His hair was cropped close to his head, but I could see the sprinklings of grey among the dark strands. There were attractive lines around his eyes, and his face hadn’t softened with age. It was still rough-hewn. His powerful shoulders and chest suggested he was still as fit as he’d ever been.\u003c/p\u003e\n\u003cp\u003eThose hard eyes glittered at me and I felt my world flip upside down.\u003c/p\u003e\n\u003cp\u003e‘Dad?’ I mouthed, disbelieving that he was standing at the bar in front of me.\u003c/p\u003e\n\u003cp\u003eI wanted to run. I wanted to hide. No. I wanted to run home, grab Cole, and then hide.\u003c/p\u003e\n\u003cp\u003e‘Jo.’ Murray Walker leaned across the bar. ‘Good to see you, lass.’\u003c/p\u003e\n\u003cp\u003eI found myself stumbling towards him, the pounding noise of chatter and music fizzling to a quiet murmur. I put the beer on the bar with a trembling hand.\u003c/p\u003e\n\u003cp\u003eMurray eyed my shaking fingers and smirked as he turned his gaze back on my face. ‘Been a long time. You’re all grown up. You’re even prettier than your maw was.’\u003c/p\u003e\n\u003cp\u003e‘Hey, can I get served?’ an irritated girl beside Murray asked. The irritation melted to fear when Murray whipped his head around to glare at her.\u003c/p\u003e\n\u003cp\u003e‘What are you doing here?’ I asked, loud enough to be heard over the music, hating myself for the quiver in my voice.\u003c/p\u003e\n\u003cp\u003e‘Been trying to find you for fucking ages, ever since I got out.’ He grunted, his face twisting into that familiar expression of hate. ‘Bitch took off and didn’t tell me where you were going. Then I did a google search on you the other week there and where did you crop up but in a picture with a multimillionaire from Edinburgh. The article said you worked here. It was an auld article like, but I thought I’d try my luck.’ He flashed me a grin that didn’t reach his eyes.\u003c/p\u003e\n\u003cp\u003eMy whole body was shaking now. The blood was rushing in my ears, my pulse points throbbing and my stomach churning. I clasped my hands behind my back, trying to still the tremors. ‘Wh-what do you want?’\u003c/p\u003e\n\u003cp\u003eMurray’s eyes narrowed and he leaned over the bar. I instinctively moved back. ‘I want to see my son, Jo.’\u003c/p\u003e\n\u003cp\u003eIt was my worst fear realized.\u003c/p\u003e\n\u003cp\u003eI feared it more than I feared Murray Walker.\u003c/p\u003e\n\u003cp\u003e‘No.’\u003c/p\u003e\n\u003cp\u003eHe curled his lip at me. ‘What?’\u003c/p\u003e\n\u003cp\u003eI shook my head, eyes blazing. ‘Never. I’ll not let you near him.’\u003c/p\u003e\n\u003cp\u003eHe huffed, seeming amazed at my audacity. He slammed a hand on the bar with a twisted smile. ‘I’ll let you think on that very carefully, lass. See you soon.’ And just as quickly as he’d appeared, he melted back into the crowd.\u003c/p\u003e\n\u003cp\u003eThe noise, the music, came flooding back and I staggered against the bar in absolute shock.\u003c/p\u003e\n\u003cp\u003e‘Jo, you okay?’\u003c/p\u003e\n\u003cp\u003eBlinking rapidly, seeing little dark spots all over my vision, I turned on unstable feet to find Alistair peering into my face in concern. ‘I feel –’\u003c/p\u003e\n\u003cp\u003e‘Whoa.’ He reached for me as I swayed towards him. ‘Okay, you’re taking a break.’\u003c/p\u003e\n\u003cp\u003e‘Too busy …’ I murmured.\u003c/p\u003e\n\u003cp\u003eSomething cold was pressed into my hand as Alistair led me towards the staff room. I glanced down at the bottle of water. ‘Sadie and I have this, so just take a minute or two. You’re probably dehydrated. It’s hot in here tonight. Go on, drink up,’ he insisted, and then once he was sure I was obeying his order, he hurried back out to the bar to help Sadie with the customers.\u003c/p\u003e\n\u003cp\u003eMy heart was still pounding. I gazed at the wall. Trying to process what had just happened.\u003c/p\u003e\n\u003cp\u003eMurray Walker was back.\u003c/p\u003e\n\u003cp\u003eHe was still a mean bastard.\u003c/p\u003e\n\u003cp\u003eAnd … Cole. He wanted to see Cole. I shook my head, bending over on a gasp as tears pricked my eyes.\u003c/p\u003e\n\u003cp\u003eNo. Never.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eWhat was I going to do?\u003c/p\u003e\n\u003cp\u003eI took a taxi home that night, terrified that Murray would be waiting outside the bar for me. He wasn’t. Still …\u003c/p\u003e\n\u003cp\u003eI lay in bed staring at the ceiling.\u003c/p\u003e\n\u003cp\u003eThis could break me. I could curl up and cry and become that little girl he’d abused. I could run to Cam.\u003c/p\u003e\n\u003cp\u003eBut Cole was mine to protect. He’d always been mine to protect. And anyway, Murray was just playing with me. He’d had no interest in wanting to see Cole when he was in Cole’s bloody life, and now he’d come to me. Not Mum. Me.\u003c/p\u003e\n\u003cp\u003eThen I did a google search on you the other week there and where did you crop up but in a picture with a multimillionaire from Edinburgh.\u003c/p\u003e\n\u003cp\u003eThe bastard didn’t want Cole. He wanted money.\u003c/p\u003e\n\u003cp\u003eHe was going to blackmail me for money.\u003c/p\u003e\n\u003cp\u003eStupid asshole. I didn’t have any money!\u003c/p\u003e\n\u003cp\u003eI shook my head and turned on my side, pulling the covers tight around me. I’d just tell him that Malcolm and I were over and I didn’t have access to his money any more. I was pretty sure that then he’d go slithering back into his little hole in Glasgow.\u003c/p\u003e\n\u003cp\u003eThat was it, settled then. There was no need to tell anyone about this. Murray would be gone before I knew it.\u003c/p\u003e\n\u003cp\u003eSleep evaded me for another night.\u003c/p\u003e\n\u003cp\u003e28\u003c/p\u003e\n\u003cp\u003eThankfully Cole put my subdued behaviour the next morning down to the reigning silence between me and Cam.\u003c/p\u003e\n\u003cp\u003e‘You should talk to him,’ my little brother had advised as if it was the most obvious solution in the world. I’d just nodded at him and promised him I was nipping down to see Cam before work tonight.\u003c/p\u003e\n\u003cp\u003eCam still hadn’t texted me.\u003c/p\u003e\n\u003cp\u003eThen again, I still hadn’t texted him.\u003c/p\u003e\n\u003cp\u003eZombified from lack of sleep, I didn’t do much that day. When I popped out for some groceries I felt as though eyes were following me the entire time, paranoid that Murray had found me again. I hurried home and stayed in the flat for the rest of the day.\u003c/p\u003e\n\u003cp\u003eWhen I was sure Cam would have returned home from work, I threw plenty of concealer on the dark circles under my eyes and walked down to his flat on shaking legs. I didn’t know what to say to him, where to start …\u003c/p\u003e\n\u003cp\u003eI’d worked myself up into such a nervous mess that it was sort of deflating to discover that he wasn’t home. \u003c/p\u003e","sourceLink":"https://allnovel.net/down-london-road-on-dublin-street-2/page-54.html","bookId":1893,"creation":"Oct 5, 2019 5:07:07 PM","modification":"Oct 5, 2019 5:07:07 PM"}
