{"id":74314,"no":25,"title":"Page 25","content":"\u003cp\u003eWoods\u003c/p\u003e\n\u003cp\u003eI walked over to the bar and took the glass of bourbon that Mitch, the club\u0027s bartender, pushed my way. It was after-hours and I was expecting someone. He\u0027d texted me an hour ago.\u003c/p\u003e\n\u003cp\u003eJust as I lifted the glass to my lips, Grant walked in the door and scanned the room until he found me at the bar. He had been out of town more than usual this year. It was summertime. He should have been in his condo, living it up in Rosemary.\u003c/p\u003e\n\u003cp\u003e\"Give me one of those, Mitch,\" Grant said as he approached the bar, and leaned against it before looking at me. \"I\u0027m back. What\u0027s up?\"\u003c/p\u003e\n\u003cp\u003e\"Where have you been?\" I asked.\u003c/p\u003e\n\u003cp\u003eHis mouth was in a firm, set line before he gave in and let out a sigh. \"You don\u0027t want to know,\" he said, then took a long swig of the bourbon.\u003c/p\u003e\n\u003cp\u003eThat meant he\u0027d been with Nan. There was a story there I wasn\u0027t sure I wanted to know. Grant was Rush\u0027s best friend. They were like brothers. Rush\u0027s mom had been married to Grant\u0027s dad when they were kids. The marriage only lasted a few years but they bonded. What no one expected was for Grant and Nan, Rush\u0027s half sister, to do anything more than fight. They fought when they were kids and they fought now. Grant was a good guy. Nan was the world\u0027s second-biggest bitch. Angelina was the first.\u003c/p\u003e\n\u003cp\u003e\"Nan,\" I said simply.\u003c/p\u003e\n\u003cp\u003eGrant took another swig and handed the glass back to Mitch. \"Another,\" he replied.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s twenty-three-year-old Kentucky bourbon. It\u0027s meant to be sipped and enjoyed, not thrown back like a shot of cheap tequila,\" I pointed out.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re an elitist, Woods. Kiss my ass. I need more alcohol.\"\u003c/p\u003e\n\u003cp\u003e\"Anyone who spends five minutes with Nan needs alcohol. The question is, why the hell do you do it?\"\u003c/p\u003e\n\u003cp\u003eGrant threw back his second glass of bourbon and then looked over at me. \"Not talking about her tonight. Why did you call me? What is going on?\"\u003c/p\u003e\n\u003cp\u003eGood. I didn\u0027t really want to know about Nan anyway. If she came back to town, Rush was gonna be pissed. He loved his sister, but she hated his wife. So Nan had drawn a line and Rush had stayed on Blaire\u0027s side. Nan\u0027s coming back to Rosemary wouldn\u0027t be cool. I\u0027d hoped she was staying in LA with her daddy. She\u0027d recently found out the man she had grown up thinking was her father was not. Her real father was the lead singer of Slacker Demon. Apparently, Rush\u0027s momma liked sleeping with the band back in the day.\u003c/p\u003e\n\u003cp\u003e\"I fired the board. I\u0027m choosing my own. My father\u0027s board isn\u0027t for me. I want you on my new one.\"\u003c/p\u003e\n\u003cp\u003eGrant set down his glass and stared at me a minute. \"What did you just say?\"\u003c/p\u003e\n\u003cp\u003e\"The club has a board of directors. The old one has been let go. Will you be on my new board?\"\u003c/p\u003e\n\u003cp\u003eGrant motioned for Mitch to refill his glass. \"Damn, I\u0027m glad I\u0027m back. Crazy shit happens here all the time. No place is as drama-ridden as Rosemary. Not even fucking LA.\"\u003c/p\u003e\n\u003cp\u003e\"Does this mean yes, you will be on my board?\" I asked, taking a sip of my bourbon.\u003c/p\u003e\n\u003cp\u003eGrant grinned over at me. \"Hell yeah, I will.\"\u003c/p\u003e\n\u003cp\u003eI knew he would. That made four. I still needed to talk to a few more. \"I have paperwork in my office for you to fill out. But tonight, let\u0027s drink. I need a distraction.\"\u003c/p\u003e\n\u003cp\u003eGrant pulled out a stool and sat down. \"Where\u0027s Della?\"\u003c/p\u003e\n\u003cp\u003eI had been expecting this question but hearing her name jolted me. She had met with her birth mother today. Braden was supposed to call me tonight and let me know how it went. I was anxious and needed to think about something else until I got that call.\u003c/p\u003e\n\u003cp\u003e\"She left.\" I couldn\u0027t bring myself to explain anything else.\u003c/p\u003e\n\u003cp\u003e\"She left? What the fuck did you do?\"\u003c/p\u003e\n\u003cp\u003e\"Screwed up. Missed some signs I should have noticed. Got too busy to see what she needed. Smothered her.\" There was a long list of things I had realized I was guilty of.\u003c/p\u003e\n\u003cp\u003e\"Damn. Last I saw you two, you were worshipping at her altar. How the hell did it go south so fast?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not over. I\u0027m waiting. She\u0027ll come back. I\u0027m letting her decide if she can do this. In the meantime, I\u0027m drinking a lot and living for phone calls from Tripp.\"\u003c/p\u003e\n\u003cp\u003eGrant put his glass down and let out a low whistle. \"Ah, hell no. She left with Tripp?\"\u003c/p\u003e\n\u003cp\u003eI just managed a nod.\u003c/p\u003e\n\u003cp\u003e\"Shit, dude. I\u0027m sorry. If you want my help kicking his playboy ass I got your back.\"\u003c/p\u003e\n\u003cp\u003eAt one point that would have been exactly what I wanted, but not now. Tripp was taking care of her. He was making sure she was safe. It was all I had. I shook my head. \"No. It\u0027s okay. He\u0027s keeping me updated. He\u0027s making sure she has what she needs to be free.\"\u003c/p\u003e\n\u003cp\u003eGrant frowned and leaned toward me. \"Am I understanding you right? Your woman is off with Tripp and you\u0027re okay with this?\"\u003c/p\u003e\n\u003cp\u003e\"She loves me.\"\u003c/p\u003e\n\u003cp\u003eGrant nodded. \"Yeah, she does.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027ll be back. This hand isn\u0027t over. It can\u0027t be. I went all in.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t have to explain that to Grant. He got it. He smiled and leaned back with his drink in his hand. \"You got this one, Ace.\"\u003c/p\u003e\n\u003cp\u003eMy phone rang and I pulled it out to see my mother\u0027s name on the screen. I stuck it back in my pocket. I wasn\u0027t talking to her. I was sure she was aware that the old board members had been released. She wouldn\u0027t be happy about that.\u003c/p\u003e\n\u003cp\u003e\"Is Nan coming back?\" I asked.\u003c/p\u003e\n\u003cp\u003eGrant held the glass to his lips a moment longer than necessary. He was stalling. I knew that move. When he finally set it down he turned his head toward me. \"Yeah. She\u0027s coming back. I\u0027m heading over to Rush\u0027s when I leave here to tell him. He needs to be prepared.\"\u003c/p\u003e\n\u003cp\u003e\"You ask her to come back?\" I asked. Grant\u0027s attraction to Nan made no sense to me. He had seen how evil she could be. He had seen her at her worst. How could he want that?\u003c/p\u003e\n\u003cp\u003e\"Hell no. But she\u0027s coming. Kiro bought her a nice, big, fancy house. The light blue one that sits over the hill on the south end of the beach.\"\u003c/p\u003e\n\u003cp\u003eKiro was the lead singer of Slacker Demon and Nan\u0027s father. \"Damn. I like that house. How\u0027d she get that out of him?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s trying to get rid of her. She hasn\u0027t been easy to deal with. She gives him hell every chance she gets and he\u0027s pretty desperate.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t say I blame him.\" I would have done whatever I could to get away from her, too, if I was him. Nan was dangerous when she wanted to be.\u003c/p\u003e\n\u003cp\u003e\"I feel bad for her, man. She knows he bought it for her to move her as far away from him as possible. She just wants his attention.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s the lead singer in the biggest, most legendary rock band of our time. He ignored her for most of her life. He isn\u0027t daddy material.\"\u003c/p\u003e\n\u003cp\u003eGrant frowned and I could see he was dealing with something. \"He has another daughter. He treats her differently. He\u0027s affectionate with her. He loves her. It\u0027s obvious. But she\u0027s not like Nan. She doesn\u0027t demand things and she\u0027s quiet. I think that\u0027s what he wants. A meek, sweet daughter. Nan will never be that.\"\u003c/p\u003e\n\u003cp\u003e\"Another daughter? Really?\" I\u0027d never heard of Kiro having a daughter.\u003c/p\u003e\n\u003cp\u003e\"Yeah. She lives with him, too. She has what Nan wants and will never get. Because Nan can\u0027t be her. She can\u0027t be what Kiro wants. It sucks for her. She\u0027s always just wanted attention. Both her parents denied her that. Rush is all she ever had and now he has Blaire and Nate. She lost him, too. I can\u0027t help but feel bad for her.\" He took a drink and set it down, then stood up. \"I get that no one understands why I have anything to do with her, and I\u0027ll be honest: at times, I don\u0027t know either. She\u0027s all kinds of fucked up and mean.\"\u003c/p\u003e\n\u003cp\u003eI nodded, because he was right about that. \u003c/p\u003e","sourceLink":"https://allnovel.net/simple-perfection-perfection-2/page-25.html","bookId":1992,"creation":"Oct 5, 2019 10:30:59 AM","modification":"Oct 5, 2019 10:30:59 AM"}
