{"id":74316,"no":26,"title":"Page 26","content":"\u003cp\u003eDella\u003c/p\u003e\n\u003cp\u003e\"I shouldn\u0027t have got you. If it hadn\u0027t been for you crying and keeping me up all night I wouldn\u0027t have been needing a nap. I wouldn\u0027t have let my little boy go to that store. It\u0027s all your fault, Della. All your fault. He knows it, too. He wanted to stay with me but I was so sleepy. So very sleepy. You wouldn\u0027t let me sleep.\" Mother roared and reared back and slapped me across the face. I stumbled backward and grabbed the edge of the bed before I fell down.\u003c/p\u003e\n\u003cp\u003e\"If you had slept at night and let me be a good mommy to my little boy he would be alive. But you ruined everything. I didn\u0027t want another baby. Your father wanted a little girl. He said it would complete our family. You didn\u0027t complete us! You destroyed us!\" I braced myself as Mother hit me again. I tried not to cry. I tried not to whimper. If I whimpered she would get angrier. I had to stay calm. I had to let her scream. She would cry soon and go to her room.\u003c/p\u003e\n\u003cp\u003e\"Get on that bed and don\u0027t move. The monsters under it will get you. They will come get you for being such a bad girl. They know it\u0027s all your fault. They know what you did to me.\"\u003c/p\u003e\n\u003cp\u003eI never understood her when she blamed me for my brother\u0027s death---I was a baby when it happened---but I let her yell and hit me. If I fought back she only got angrier. Once she had hit me at breakfast and I didn\u0027t wake up until the middle of the night. I had been on the kitchen floor with a pillow under my head and a blanket over me. She had put two plates of food beside me.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t fight back anymore. I was scared to.\u003c/p\u003e\n\u003cp\u003e\"Get on that bed!\" she screamed as I scrambled to do as she commanded. \"Don\u0027t come out. I don\u0027t want to look at you,\" she said before walking away and slamming the door behind her. I heard the familiar click and I knew she\u0027d locked me in. My door had always locked from the outside. She controlled it.\u003c/p\u003e\n\u003cp\u003e\"Good night, Momma,\" I whispered as I pulled my knees up to my chin and rocked myself back and forth while I pretended that I had a better life. One where I could go outside and ride a bike.\u003c/p\u003e\n\u003cp\u003eI opened my eyes and stared at the ceiling fan. I was in the guest bedroom at Braden\u0027s house. I hadn\u0027t woken up screaming. I had never dreamed of my mother and not woken up screaming with imaginary blood on my hands. Something had changed. The memory was one I\u0027d forgotten but her words that day made sense now. I sat up and swung my legs over and stood up. I had dreamed and not screamed. I was afraid to hope, but I had never been able to do this. I opened my door and stepped out into the dark hallway. Braden would be asleep and I didn\u0027t want to wake her. But I needed to process this.\u003c/p\u003e\n\u003cp\u003eI walked to the kitchen to get a drink of water.\u003c/p\u003e\n\u003cp\u003eBraden was standing at the counter with a glass of milk, staring straight ahead in deep thought, when I walked into the room. Her eyes shifted to me. \"Della? Are you okay? I didn\u0027t hear you.\"\u003c/p\u003e\n\u003cp\u003eI stood there as it really sank in. I had dreamed of her. Yet I hadn\u0027t had a night terror. \"I dreamed about her. About my life then. And . . . and . . . I just woke up. No blood. I never saw the blood. I just woke up.\"\u003c/p\u003e\n\u003cp\u003eBraden stared at me as she processed what I had told her. Then she set her milk down on the bar and ran over to me. Her arms wrapped around me. \"You\u0027re getting better. Already, you\u0027re getting better,\" she said in a teary voice.\u003c/p\u003e\n\u003cp\u003eI wanted to cry, too. I wanted to cry because I realized I might just have a chance at happiness. What if I was strong after all? What if, underneath all that fear, I had buried someone deep inside who was brave and could take on life without someone to lean on?\u003c/p\u003e\n\u003cp\u003e\"I think I\u0027m going to be okay,\" I said out loud, because I needed to hear myself say it.\u003c/p\u003e\n\u003cp\u003eBraden squeezed me tighter. \"I know you\u0027re going to be okay. I know it.\"\u003c/p\u003e\n\u003cp\u003eWe stood there holding each other in the kitchen for several moments before I pulled back. \"I\u0027m not going to go crazy. I won\u0027t snap one day and become her.\"\u003c/p\u003e\n\u003cp\u003eBraden wiped at the tears streaming down her face. \"I know. I\u0027ve always known that.\"\u003c/p\u003e\n\u003cp\u003e\"But I didn\u0027t. I had seen her. I knew what she could be. I didn\u0027t want to be that too.\"\u003c/p\u003e\n\u003cp\u003e\"She was the woman who raised you but she wasn\u0027t your mother.\"\u003c/p\u003e\n\u003cp\u003eI nodded. I knew that now. I was going to be okay. \"I want to meet my . . . I want to meet my birth father. I need to see him. I need to see his family, too.\"\u003c/p\u003e\n\u003cp\u003eBraden nodded. \"Good. I think you should.\"\u003c/p\u003e\n\u003cp\u003eI stepped back and turned to go back to the bedroom.\u003c/p\u003e\n\u003cp\u003e\"Della,\" Braden said.\u003c/p\u003e\n\u003cp\u003eI glanced back at her. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Call him. He needs to hear from you.\"\u003c/p\u003e\n\u003cp\u003eShe wasn\u0027t talking about my birth father. She was talking about Woods. I would have given anything to hear his voice. But I couldn\u0027t. He had moved on. He hadn\u0027t looked for me or tried to contact me. I had let him go and he\u0027d walked away. I couldn\u0027t bother him now. \"I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"He misses you,\" she said.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know that. You assume it because you think what we had was a forever thing. But Woods has plans and I\u0027m not in them. I gave him what he wanted. I\u0027m not going to bother him again.\"\u003c/p\u003e\n\u003cp\u003eBraden let out a frustrated growl. \"Della, a call from you wouldn\u0027t be a bother to him.\"\u003c/p\u003e\n\u003cp\u003eShe loved me and didn\u0027t understand what I was trying to tell her. I knew better. \"No, Braden. I\u0027m letting him live. I\u0027ll find my way soon. First, I have to figure out my past.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t say more as I walked back to the bedroom. I closed the door and waited a minute to make sure she wasn\u0027t following me before I let the tears fall. I didn\u0027t want her to see me cry. She would call him. She would try to fix this. There was nothing there to fix, but she didn\u0027t see it that way.\u003c/p\u003e\n\u003cp\u003eBut now I knew I was going to heal. I was going to be okay. I had a future. I had to face what I\u0027d lost. Losing Woods was my biggest mistake. I shouldn\u0027t have left him. I should have been stronger then and fought harder. But I hadn\u0027t. I would deal with that the rest of my life. \u003c/p\u003e","sourceLink":"https://allnovel.net/simple-perfection-perfection-2/page-26.html","bookId":1992,"creation":"Oct 5, 2019 10:30:59 AM","modification":"Oct 5, 2019 10:30:59 AM"}
