{"id":74358,"no":48,"title":"Page 48","content":"\u003cp\u003eTwo months later . . .\u003c/p\u003e\n\u003cp\u003eDella\u003c/p\u003e\n\u003cp\u003eBraden was pregnant. I had hung up with her over ten minutes ago but I hadn\u0027t moved from the swing on the porch. I continued to swing. I needed to let this process. Braden . . . a mommy. My Braden. Wow . . .\u003c/p\u003e\n\u003cp\u003eThe door to the house opened and Woods stepped outside. \"You off the phone?\" he asked as he walked over to the swing.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" I replied, scooting over so he could sit down with me.\u003c/p\u003e\n\u003cp\u003e\"What is Braden up to?\" he asked as he put his arm around me and pulled me over to his side.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s . . . she\u0027s pregnant.\" It was hard to even say it. I had always imagined Braden as a mom. She would make an excellent one, but just knowing that she was about to start another new step in life was a surprise.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s good, right?\" Woods asked.\u003c/p\u003e\n\u003cp\u003eI smiled and nodded. I guess in the moment I took to process, I looked upset. \"Yes, it\u0027s wonderful. They\u0027ve been trying for a while now, apparently. I didn\u0027t know. She hadn\u0027t said anything. But she\u0027s now three months along and they heard the heartbeat yesterday. She feels it\u0027s safe to tell people now.\"\u003c/p\u003e\n\u003cp\u003eWoods pushed the swing with his feet so I curled mine back behind me and let him do the work. \"She\u0027ll be a wonderful mother,\" I told him.\u003c/p\u003e\n\u003cp\u003e\"I agree with you. She\u0027s pretty damn fierce when she loves someone.\"\u003c/p\u003e\n\u003cp\u003eI laughed and looked up at him. \"Yes, she is.\"\u003c/p\u003e\n\u003cp\u003eWoods bent down and kissed the tip of my nose. \"I love you.\"\u003c/p\u003e\n\u003cp\u003e\"I love you more,\" I said in reply. That was always his line. I figured I would take it away from him.\u003c/p\u003e\n\u003cp\u003eHe chuckled. \"Thief.\"\u003c/p\u003e\n\u003cp\u003eI pinched the skin covering his abs and he squirmed.\u003c/p\u003e\n\u003cp\u003eWe sat there for a while and enjoyed the evening breeze. Fall was here and Rosemary was peaceful again. The crowds were gone. Jace\u0027s absence still clung to us. We all felt it. We knew we always would. But lately we had all been able to talk about him again. Someone would tell a funny story about him and we would all laugh instead of cry.\u003c/p\u003e\n\u003cp\u003eBethy was at work again but Woods still wasn\u0027t ready to speak to her. He knew he was wrong. He admitted it to me one night. But he said he couldn\u0027t forgive her. I let it go. I knew he just needed more time.\u003c/p\u003e\n\u003cp\u003eTripp was also back in town. He had been gone for about a week and packed up his place in South Carolina. Then he\u0027d moved back here into his condo. Woods had given him a place on the board of directors at the club.\u003c/p\u003e\n\u003cp\u003e\"Della?\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Do you believe in fate?\"\u003c/p\u003e\n\u003cp\u003eI thought about it a minute. I wasn\u0027t sure. I hadn\u0027t given much thought to the idea of fate before.\u003c/p\u003e\n\u003cp\u003e\"What exactly do you mean by that?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I mean . . . do you think things happen for a reason, and no matter what we do or what we choose they\u0027ll happen anyway?\"\u003c/p\u003e\n\u003cp\u003eHe was thinking about Jace\u0027s death. He didn\u0027t want to hate Bethy. But his heart wasn\u0027t letting him forgive her because of his love for Jace.\u003c/p\u003e\n\u003cp\u003e\"I think that everyone\u0027s life is controlled by a series of events. They choose what they want and if it is in their control they can reach it. Sometimes luck shines on them and sometimes it doesn\u0027t. I also think accidents happen and we are placed in situations where we have to do things for those we love that we don\u0027t want to do.\"\u003c/p\u003e\n\u003cp\u003eWoods didn\u0027t say anything.\u003c/p\u003e\n\u003cp\u003eI let him think about it. I wasn\u0027t going to push him to forgive Bethy.\u003c/p\u003e\n\u003cp\u003eThat would be something he\u0027d have to find within himself when he was ready. \u003c/p\u003e","sourceLink":"https://allnovel.net/simple-perfection-perfection-2/page-48.html","bookId":1992,"creation":"Oct 5, 2019 10:30:59 AM","modification":"Oct 5, 2019 10:30:59 AM"}
