{"id":70647,"no":10,"title":"Page 10","content":"\u003cp\u003e“Do you know someone better for the job?”\u003c/p\u003e\n\u003cp\u003e“No, but I’m sure there’s someone.”\u003c/p\u003e\n\u003cp\u003e“Right. Because there are so many good foster homes open and available for a teenage boy with an ex-convict father. You know what a load of crap that is. He’s lucky to have found you.”\u003c/p\u003e\n\u003cp\u003e“I’m the lucky one. He’s such a great kid. This is the first time he’s ever given me any trouble.”\u003c/p\u003e\n\u003cp\u003e“I doubt trouble is what he set out to cause tonight. Why don’t you talk to him? Talk to the police. I’m sure that you can all sort this out and find a way to get Wyatt back in jail for breaking parole or something.”\u003c/p\u003e\n\u003cp\u003e“Do you think?”\u003c/p\u003e\n\u003cp\u003e“You won’t know until you try.”\u003c/p\u003e\n\u003cp\u003eIsabelle nodded. “I’ll talk to them.”\u003c/p\u003e\n\u003cp\u003eShe stepped out of Grant’s embrace and went to wipe the tears off her face, but he grabbed her hand, stopping her. “Let him see the consequences of his actions. He needs to know that what he does affects you.”\u003c/p\u003e\n\u003cp\u003e“I don’t want him to see me cry.”\u003c/p\u003e\n\u003cp\u003e“Better that than letting him do something like this again. Trust me.”\u003c/p\u003e\n\u003cp\u003eIsabelle stared into Grant’s amber eyes for a long moment. “I do trust you.” And because she did, she left her face wet and went to join her son.\u003c/p\u003e\n\u003cp\u003eTrina didn’t know how long she’d have before her kidnapper came back, so she had to hurry. The drugs he’d given her had finally worn off enough that she could get off the cot without falling down. Hitting her head on that hard cement floor once had been enough of an incentive for her to be more careful this time.\u003c/p\u003e\n\u003cp\u003eShe had no idea where she was, but she felt like it had to be a basement. Every once in a while, she could hear the faint creak of floorboards overhead and what she thought might be the sound of water running in the pipes.\u003c/p\u003e\n\u003cp\u003eWherever she was, it was dark. There were no windows, no lamps. The light switch for the single bulb overhead was on the outside of the door. Only a thin ribbon of light from under the door allowed her to see anything at all.\u003c/p\u003e\n\u003cp\u003eAt least he’d left her that much. Trina was sure that if he hadn’t, she would have panicked weeks ago.\u003c/p\u003e\n\u003cp\u003eOr was it months? She couldn’t be sure anymore. Her life was now a series of drug-fogged memories and terrifying nightmares where Henry was killed over and over again.\u003c/p\u003e\n\u003cp\u003eEvery time she closed her eyes, she saw his body hanging from the ceiling, swinging slightly, that motion the only remnant of the life that had burned so bright within him.\u003c/p\u003e\n\u003cp\u003eTrina’s eyes welled up, and she bit her lip to keep from crying. It was hard enough to see in here without the added hindrance of tears. If she was going to have any chance of getting out of here, she needed to find a plan soon, before her husband’s killer came back and drugged her into unconsciousness again.\u003c/p\u003e\n\u003cp\u003eShe looked around the tiny space. It was about eight feet square, with a cot along one wall and a toilet and sink tucked in the corner. The floor was bare concrete. There was no mattress or blankets. The only thing in here that wasn’t permanently attached was the light bulb in the ceiling, a bar of soap, a washcloth, and a single roll of toilet paper.\u003c/p\u003e\n\u003cp\u003eTrina had already tried to open the door the last time she’d woken, and it hadn’t budged. She wasn’t going to waste whatever little time she had now trying it again. She needed a new idea.\u003c/p\u003e\n\u003cp\u003eMaybe if she moved the cot, she could reach the light bulb, break it, and use the pieces as a weapon.\u003c/p\u003e\n\u003cp\u003eOf course, as soon as the killer came back and saw the light didn’t go on, he’d know something was wrong.\u003c/p\u003e\n\u003cp\u003eHe’d warned her that he’d punish her if she gave him any trouble.\u003c/p\u003e\n\u003cp\u003eHe seemed to know how long the drugs he gave her lasted, and she was never awake for more than a few minutes before he knocked her out again.\u003c/p\u003e\n\u003cp\u003eTrina figured she had maybe twenty minutes before he came back to drug her again.\u003c/p\u003e\n\u003cp\u003eA sick sense of panic swelled inside her veins. She didn’t know how much longer she was going to last in here. She’d spent most of her imprisonment sleeping, and already she was starting to feel her mind fraying around the edges.\u003c/p\u003e\n\u003cp\u003eNot to mention her body was getting weaker by the day. With little use, her muscles were wasting away, and even though the killer fed her, she didn’t eat much. She couldn’t, no matter how hard she tried.\u003c/p\u003e\n\u003cp\u003eTrina scanned the dank space, searching for something she’d missed before. Something she could use as a weapon or a tool.\u003c/p\u003e\n\u003cp\u003eThe toilet. It had bits of metal in it, didn’t it?\u003c/p\u003e\n\u003cp\u003eTrina stumbled across the small space and lifted the lid off the back of the tank. It was dark inside. None of the ribbon of light from under the door found its way in here.\u003c/p\u003e\n\u003cp\u003eShe stuck her hands in the frigid water, feeling around for something she could use. The first thing she found was a metal rod that connected the lever on the outside of the toilet to a chain.\u003c/p\u003e\n\u003cp\u003eHope speared through her as her shaking fingers moved over the rod, trying to figure out how to free it.\u003c/p\u003e\n\u003cp\u003eThe next time her husband’s killer came at her with that needle, she was going to ram this thing right into his eye.\u003c/p\u003e\n\u003cp\u003eCHAPTER FIVE\u003c/p\u003e\n\u003cp\u003eIsabelle had to sit on her hands to keep from reaching out to Dale to reassure herself he was okay. She knew he wouldn’t like her coddling him in front of the two officers sitting on the couch.\u003c/p\u003e\n\u003cp\u003e“Let’s go over this one more time,” said the younger of the two policemen, Officer Reynolds. He was rope thin and held his pencil poised over his notepad in anxious anticipation. “You were in your room studying at what time?”\u003c/p\u003e\n\u003cp\u003eDale’s jaw tightened with frustration. “It was about ten, I guess.”\u003c/p\u003e\n\u003cp\u003e“And then what?”\u003c/p\u003e\n\u003cp\u003e“I already told you,” Dale nearly shouted.\u003c/p\u003e\n\u003cp\u003eIsabelle had never seen him so agitated, and it worried her. Maybe something more had happened than the simple talk he claimed he’d had with his father. Then again, maybe that was enough.\u003c/p\u003e\n\u003cp\u003eReynolds opened his mouth, but the older officer who’d introduced himself as Officer Brooks held out a warning hand to his partner. He had a calm patience about him that spoke to his obvious experience in dealing with children. He was a little on the heavy side, but it only made him look more rock solid.\u003c/p\u003e\n\u003cp\u003e“Tell us again, son,” said Officer Brooks in a calm, steady voice. “It helps make sure we didn’t mess up any details the first time ’round.”\u003c/p\u003e\n\u003cp\u003eDale sighed and rubbed his eyes with the heels of his hands. It was nearly midnight, and he looked exhausted. Isabelle barely stifled the urge to run the police off and send Dale to get some much-needed rest.\u003c/p\u003e\n\u003cp\u003e“He threw rocks at my window,” said Dale. “I thought it was one of my friends, so I went over, but it was Da—Wyatt.”\u003c/p\u003e\n\u003cp\u003eHe’d almost said “Dad,” and the fact that he had to stop himself and call his father by his first name to distance himself from him broke Isabelle’s heart.\u003c/p\u003e\n\u003cp\u003e“Had you already opened the window at that time?” asked the older officer.\u003c/p\u003e\n\u003cp\u003e“No, but he wanted me to, so I did.”\u003c/p\u003e\n\u003cp\u003eThe younger policeman’s pencil raced across the page, writing down who knew what vital information.\u003c/p\u003e\n\u003cp\u003e“What did he say to you then?” asked Brooks.\u003c/p\u003e\n\u003cp\u003e“I already told you!” shouted Dale.\u003c/p\u003e\n\u003cp\u003eIsabelle couldn’t hold back any longer. She put her hand on his shoulder, hoping she was offering more comfort than embarrassment.\u003c/p\u003e\n\u003cp\u003eDale stiffened at her touch, but at least he didn’t shrug her off.\u003c/p\u003e\n\u003cp\u003e“Tell us again,” came the calm reply of the seasoned cop.\u003c/p\u003e\n\u003cp\u003e“Coffee, anyone?” Grant came into the living room with a fistful of coffee mugs and a full carafe. Apparently he’d found the secret hiding place that she couldn’t.\u003c/p\u003e\n\u003cp\u003eThe young cop perked up, nodding at the offer, but Brooks kept his attention steady on Dale, not letting the interruption bother him. “Go ahead, son. Tell us what he said.”\u003c/p\u003e\n\u003cp\u003eDale let out a gusty, dramatic sigh. “He wanted me to come out and talk to him.”\u003c/p\u003e\n\u003cp\u003e“So you did.”\u003c/p\u003e\n\u003cp\u003e“Yes. I did.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eDale looked at Isabelle, then down at the carpet.\u003c/p\u003e\n\u003cp\u003eBrooks looked at Isabelle, too, then nodded as if he’d found the answer. “You didn’t want him to come in the house, did you?”\u003c/p\u003e\n\u003cp\u003eDale shot to his feet, knocking Isabelle’s arm away from him, and threw his hands up in exasperation. “I don’t know why you all are making such a big deal about this. He didn’t hurt me. All we did was talk.”\u003c/p\u003e\n\u003cp\u003e“What about?” asked Brooks, unfazed by Dale’s explosion.\u003c/p\u003e\n\u003cp\u003eDale’s mouth tightened, and he remained silent.\u003c/p\u003e\n\u003cp\u003e“Dale?” said Isabelle. “What did he want?”\u003c/p\u003e\n\u003cp\u003e“Nothing,” said Dale.\u003c/p\u003e\n\u003cp\u003eGrant handed both officers a cup of coffee, then propped himself against the wall, listening.\u003c/p\u003e\n\u003cp\u003eThe younger policeman stopped writing long enough to shoot Dale a disbelieving look. “He came all the way out here late at night to talk to you about nothing? You don’t think we’re going to believe that, do you?”\u003c/p\u003e\n\u003cp\u003eIsabelle fought an uncharacteristic surge of anger but lost the battle. They were not going to treat her son like a felon. “Hey! Don’t you call Dale a liar in his own home. If he said they talked about nothing, I’m sure that’s what happened.”\u003c/p\u003e\n\u003cp\u003e“Well, Dale?” asked Brooks. “Was it really nothing?”\u003c/p\u003e\n\u003cp\u003eDale gave Isabelle a guilty grimace. “Well, it wasn’t exactly nothing. Just stuff, you know. He asked if I liked it here. And he wanted to know who Amanda and Rachel were. If they were close friends of yours, Isabelle.”\u003c/p\u003e\n\u003cp\u003eThe hair on the back of Isabelle’s neck rose. If he knew about them, he’d been watching the house since last week, when she’d babysat Rachel.\u003c/p\u003e\n\u003cp\u003e“Who are they?” asked Brooks.\u003c/p\u003e\n\u003cp\u003eHer voice came out faint. “Amanda’s a friend of mine. Rachel is her daughter and my student. She’s seven.”\u003c/p\u003e\n\u003cp\u003eThe officer’s mouth flattened. “Did he threaten them, Dale?”\u003c/p\u003e\n\u003cp\u003e“No. He said he thought Amanda was hot and wanted to ask her out. I didn’t tell him who they were. I swear.”\u003c/p\u003e\n\u003cp\u003e“Good. That’s good.” Brooks looked to Isabelle. “Do you have Amanda’s address and phone number?”\u003c/p\u003e\n\u003cp\u003e“In my address book.” She fetched it from the kitchen and gave it to the younger officer, who wrote the information down. “Can you drive by her place and check on her?”\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am. We’ll see to it.”\u003c/p\u003e\n\u003cp\u003eIsabelle wished that relieved her, but it wasn’t enough. She was going to have to warn Amanda, let her know to keep an eye out for Wyatt.\u003c/p\u003e\n\u003cp\u003e“Did Wyatt ask you to leave with him, Dale?” asked Brooks.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Did he threaten you in any way?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Did he threaten anyone else?”\u003c/p\u003e\n\u003cp\u003eDale paled a little and glanced Isabelle’s way. “Not exactly.”\u003c/p\u003e\n\u003cp\u003e“What do you mean by that?” asked Brooks.\u003c/p\u003e\n\u003cp\u003eDale shrugged. “I just know him, you know.”\u003c/p\u003e\n\u003cp\u003eAnd he’d seen Wyatt hurt his mother over and over.\u003c/p\u003e\n\u003cp\u003eIsabelle laced her fingers together tight to keep them to herself. “You don’t need to worry about me, Dale. I’ll be careful.”\u003c/p\u003e\n\u003cp\u003eDale flushed a guilty red, but didn’t look at her. Instead he asked Brooks, “Are you worried that he might hurt Isabelle or Amanda?” \u003c/p\u003e","sourceLink":"https://allnovel.net/no-escape-delta-force-3/page-10.html","bookId":2376,"creation":"Oct 5, 2019 10:17:34 AM","modification":"Oct 5, 2019 10:17:34 AM"}
