{"id":70669,"no":32,"title":"Page 32","content":"\u003cp\u003eNow all he had to do was take care of Trina, and everything else would fall in line.\u003c/p\u003e\n\u003cp\u003eKeith pulled the painter’s disposable coveralls on over his clothes, making sure he was covered from head to toe. Freeing Trina was going to be messy.\u003c/p\u003e\n\u003cp\u003eIt was late afternoon before Isabelle heard the rumble of Grant’s Mustang in the driveway again. She put down the cap she’d been crocheting in an effort to distract herself and keep her fingers from dialing his cell phone. He’d left because he wanted to be alone, or at least not with her. He’d left because she’d hurt him. She’d driven him away. The least she could do was give him some time to himself.\u003c/p\u003e\n\u003cp\u003eShe opened the back door for him, relieved that he’d actually come back, that he wasn’t gone for good.\u003c/p\u003e\n\u003cp\u003eHis sun-streaked hair was a tousled mess, damp as if he’d just showered, and she was pretty sure the red smudge on his shirt was lipstick.\u003c/p\u003e\n\u003cp\u003eHe’d been with another woman.\u003c/p\u003e\n\u003cp\u003eJealousy and sense of betrayal filled her, and Isabelle locked her knees to keep from crumpling to the floor under the weight of it. She knew she had no claim on him, but the idea that he’d sleep with her one night and find another woman the next day was beyond painful. She wanted to crawl into herself and disappear.\u003c/p\u003e\n\u003cp\u003eWhen she stood frozen, blocking his path, Grant took her by the arms and moved her back. He didn’t just come inside, shut the door, and stop there. He walked forward and kept walking. Isabelle backed up fast to keep him from running her over.\u003c/p\u003e\n\u003cp\u003e“What have you done to me?” he demanded. Angry desperation glittered in his eyes, making them glow in contrast to his tanned skin.\u003c/p\u003e\n\u003cp\u003eShe bumped into the kitchen counter and grabbed it to steady herself. “What are you talking about?”\u003c/p\u003e\n\u003cp\u003e“It’s not supposed to be like this,” he snarled. “I like women. Lots and lots of women. And Susan was really nice. Pretty. Busty as hell.”\u003c/p\u003e\n\u003cp\u003eSusan. Knowing her name made it real.\u003c/p\u003e\n\u003cp\u003eA little piece of Isabelle’s heart shriveled as he’d confirmed her suspicions. She couldn’t get enough air to speak, even if she would have had something to say.\u003c/p\u003e\n\u003cp\u003eGrant pressed his hands to the counter on either side of her body, caging her in place. “And she wanted me. What the hell have you done to me that keeps me from fucking a pretty, available woman who wants me?”\u003c/p\u003e\n\u003cp\u003eHe didn’t have sex with her? The tightness in her chest eased enough so she could say, “I didn’t do anything.”\u003c/p\u003e\n\u003cp\u003e“You sure as hell did. You pushed me away.”\u003c/p\u003e\n\u003cp\u003e“So you went to find another woman?”\u003c/p\u003e\n\u003cp\u003e“Why not? You didn’t want me. You made that abundantly clear. We’re not even friends, right?”\u003c/p\u003e\n\u003cp\u003e“Grant, I’m sorry. I didn’t mean what I said. We are friends. I care about you.”\u003c/p\u003e\n\u003cp\u003eSome of the tension drawing his face tight faded away. “Then why did you turn cold like that?”\u003c/p\u003e\n\u003cp\u003eHow could she explain it to him when she didn’t even understand herself? “You scare me.”\u003c/p\u003e\n\u003cp\u003e“I’d never hurt you.”\u003c/p\u003e\n\u003cp\u003e“No, not like that. The way I feel about you scares me. The way I want you scares me.”\u003c/p\u003e\n\u003cp\u003eHis eyes brightened with interest. “You want me?”\u003c/p\u003e\n\u003cp\u003e“Of course I do. What sane woman wouldn’t?”\u003c/p\u003e\n\u003cp\u003e“Susan wanted me, too. I couldn’t keep her hands off me.”\u003c/p\u003e\n\u003cp\u003eIsabelle closed her eyes, and all she could see was some busty blonde with her red, red lips on Grant. “I really don’t want to hear about this.”\u003c/p\u003e\n\u003cp\u003eBut he kept on telling her anyway. “And the whole time, while she’s kissing my neck and feeling me up, I kept thinking about you. About how she wasn’t you and how it just felt . . . wrong.” He leaned down until his mouth was at her temple and his breath was caressing her skin. “I kicked her out of the hotel room, and before she was even gone, I had to wash her off of me. I couldn’t stand the feel of her mouth on my skin.” He pulled in a shuddering breath. “What the fuck have you done to me, Isabelle? And how do I make it go away?”\u003c/p\u003e\n\u003cp\u003eGrant breathed in Isabelle’s scent, letting it calm his frayed nerves. He knew she didn’t have an answer to his questions. No one did. He was messed up. That was the only explanation he could find.\u003c/p\u003e\n\u003cp\u003eOr maybe it was just this place. The home of bad memories. It brought out too many emotions in him. Made him feel things he shouldn’t, think of things best left in the past.\u003c/p\u003e\n\u003cp\u003eBut he couldn’t leave. Not with a killer still on the loose. He’d never be able to live with himself if he left Isabelle and Dale alone to fend for themselves.\u003c/p\u003e\n\u003cp\u003eHis hands slid over her back, tracing the delicate bones of her spine. He liked the way she felt against him, how she was so warm and soft. And he didn’t have to break his neck bending down to kiss her, either. She was tall enough that her mouth was in easy reach, tempting him to steal another taste. He just knew that if he did, she’d soften for him and make those faint sighing noises of pleasure that drove him wild.\u003c/p\u003e\n\u003cp\u003eAnd just like that, he went hard, his cock swelling under his fly.\u003c/p\u003e\n\u003cp\u003eThank God. For a while there, he’d been afraid his dick was broken, ’cause it sure as hell hadn’t responded to the blonde, and that had never happened before in his life. His dick always responded. Always. Until today.\u003c/p\u003e\n\u003cp\u003eSome of his panic faded away as his body became familiar territory once again, working the way it was supposed to when he had a woman in his arms.\u003c/p\u003e\n\u003cp\u003eIsabelle sucked in a breath and her hands gripped his biceps as if to steady herself.\u003c/p\u003e\n\u003cp\u003eOh, yeah. She’d felt his erection, too, not that he could exactly hide it when he was pressed up against her so close.\u003c/p\u003e\n\u003cp\u003e“Grant,” she started in a worried tone.\u003c/p\u003e\n\u003cp\u003e“Shh. Don’t worry. I’m not going to push.”\u003c/p\u003e\n\u003cp\u003eHer hands slid up to his face, and she held him between her palms. Those exotic eyes flickered across his features, and Grant felt her gaze all the way to his toes.\u003c/p\u003e\n\u003cp\u003e“This is a mistake,” she whispered.\u003c/p\u003e\n\u003cp\u003e“No mistakes.” He wasn’t going to do anything she’d regret. He was going to be good. Honorable. Then he and his grounded dick were going to go back to his room and get off so he’d have enough control left around her to keep his word.\u003c/p\u003e\n\u003cp\u003e“But it’s my mistake. Dale is out with Angela for the evening, and there’s no one here I can hurt. No one but myself.”\u003c/p\u003e\n\u003cp\u003eGrant had no clue what she meant, but when she pulled him down and covered his mouth with her own, he no longer cared.\u003c/p\u003e\n\u003cp\u003eHer tongue played along his lips, and her silken sigh slid inside him, heating him hard and fast. Sweat broke out along his spine, and his hands clenched against her back. He locked their bodies together tight, and through the thin fabrics between them, he felt her nipples tighten against his chest.\u003c/p\u003e\n\u003cp\u003eA deep moan rumbled out of him. He needed to get her naked and feel her nipples harden against his tongue. Right. Now.\u003c/p\u003e\n\u003cp\u003eIsabelle’s lips parted, and her sharp teeth nibbled at his mouth before she deepened the kiss and gave him what he wanted. The taste of her filled his senses, making his head spin. She was such a great kisser, never holding anything back. She speared her fingers through his damp hair and held on while she drank her fill.\u003c/p\u003e\n\u003cp\u003eGrant lifted her until she was straddling his hips and pulled his mouth away long enough that he could carry her back to her bed. He wasn’t going to give her any time to change her mind. Not now, not when she was fire in his arms and kissing him like she was starving for him.\u003c/p\u003e\n\u003cp\u003eHe kicked the bedroom door shut in case they were still occupied when Dale came back, and he set her down on the mattress.\u003c/p\u003e\n\u003cp\u003eShe hadn’t made her bed, which was just as well, because Grant was planning to make a mess of it, anyway. This might be the last time he ever got to enjoy naked Isabelle, and he planned on doing all those dirty things he’d spent the past few days fantasizing about. Assuming he could think clearly enough to even remember what they were.\u003c/p\u003e\n\u003cp\u003eGrant pulled his shirt over his head and tossed it aside. His boots were next, while he still had the sense left to remember how to get them off. The whole time, he watched Isabelle, searching for signs of hesitation.\u003c/p\u003e\n\u003cp\u003eShe’d said something about making a mistake, and Grant sure as hell didn’t want to be a part of that. He wanted to make her feel good, so good she’d let him do it again any time he wanted.\u003c/p\u003e\n\u003cp\u003eIsabelle glided off the bed and knelt in front of him in a move so graceful he couldn’t believe it had really happened. She was all sinuous curves and sleek lines, moving like some kind of cat as she came to him.\u003c/p\u003e\n\u003cp\u003eShe stared up at him with dark green eyes as she opened his jeans and freed his erection. Her long, slender fingers closed around him, stroking and sliding over his cock until his knees threatened to give out. And then she took him in her mouth, and Grant found the strength to stay standing. No way was he going to buckle when it might make her stop.\u003c/p\u003e\n\u003cp\u003eThe heat of her mouth scalded him and sent streamers of warmth spiraling outward. He grabbed her head to help steady himself, but it did no good. His world was spinning, shrinking down to the suckling heat of her mouth and his battle to make it last longer than ten seconds.\u003c/p\u003e\n\u003cp\u003eHe knew he couldn’t hold out much longer, and he gave her hair a little tug to warn her, but Isabelle let out a wicked little snarl and slid his cock deeper in her mouth.\u003c/p\u003e\n\u003cp\u003eSpots of flickering light filled his vision, and he gritted his teeth to hold out just a little longer.\u003c/p\u003e\n\u003cp\u003eHe wanted to do so many things to her, and he wasn’t going to have the strength left to do them if she blew the top of his head off with that sweet, hot mouth.\u003c/p\u003e\n\u003cp\u003e“Enough,” he gasped and jerked out of her reach. His dick throbbed in anger, but he ignored it.\u003c/p\u003e\n\u003cp\u003eIsabelle licked her lips. “I wasn’t done.”\u003c/p\u003e\n\u003cp\u003e“You are now. My turn.”\u003c/p\u003e\n\u003cp\u003eHe saw her open her mouth to argue and knew if she said anything else, anything about wanting his cock in her mouth again, he wasn’t going to survive. So before she could sway him with her shiny, hot mouth, he pounced.\u003c/p\u003e\n\u003cp\u003eGrant took her down to the mattress and pinned her with his body. He covered her mouth in a kiss meant to distract while he used every skill he’d learned over the years to rid her of her clothes as fast as he knew how. Something ripped, but he didn’t give a fuck. Whatever it was, he’d get her a new one. Then he’d find a way to get her to let him rip that one off, too.\u003c/p\u003e\n\u003cp\u003eIn seconds, she was staring up at him, completely naked and a little shocked. “Not fair.”\u003c/p\u003e\n\u003cp\u003eHe stared down at her sleek body, all bare and laid out for his enjoyment. The lights were on, and he could see every inch of smooth skin, every swath of flushed heat he’d caused.\u003c/p\u003e\n\u003cp\u003eGrant liked making her glow like that. In fact, he was wondering just how far down her body he could make her turn such a pretty, hot pink.\u003c/p\u003e\n\u003cp\u003e“I’d say it’s more than fair. Or at least it will be in a minute.”\u003c/p\u003e\n\u003cp\u003eChallenge blazed bright in Isabelle’s eyes. “I wanted to make you come.”\u003c/p\u003e\n\u003cp\u003e“And you will. Just not yet.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Ladies first.”\u003c/p\u003e\n\u003cp\u003eShe moved as if to slip out from under him, but Grant was faster. He pinned her, straddling her thighs as he gathered her hands and held them to his chest. His erection bobbed, thrusting out obscenely in front of him from his open jeans, but there wasn’t much he could do about that right now. \u003c/p\u003e","sourceLink":"https://allnovel.net/no-escape-delta-force-3/page-32.html","bookId":2376,"creation":"Oct 5, 2019 10:17:34 AM","modification":"Oct 5, 2019 10:17:34 AM"}
