{"id":70676,"no":39,"title":"Page 39","content":"\u003cp\u003eShe let out a low, pained moan that nearly stopped Grant’s heart. She was hurting, and there wasn’t a fucking thing he could do about it.\u003c/p\u003e\n\u003cp\u003eRage fountained up inside him, making him shake with the force of it. Someone had hurt his Isabelle, and they were going to pay.\u003c/p\u003e\n\u003cp\u003eThe paramedics arrived, and Grant sprinted downstairs to let them in. They hauled in their equipment and knelt beside Isabelle.\u003c/p\u003e\n\u003cp\u003e“Tell us what happened here,” said one of the paramedics. He was in his midthirties and had an air of calm competence about him that made Grant move aside and put Isabelle into his seemingly capable hands.\u003c/p\u003e\n\u003cp\u003e“She’s a teacher. One of the kids at school gave her some tea. It was these flower ball things that opened up when you put them in hot water. We shared lunch, and that was the only thing she had that I didn’t.”\u003c/p\u003e\n\u003cp\u003eHe swabbed Isabelle’s arm for an IV. “Is she on any medication?” he asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know.” Admitting it made him sick. He didn’t know her at all. Why hadn’t he taken the time to get to know her better? Why hadn’t he insisted on finding out more about her?\u003c/p\u003e\n\u003cp\u003eBecause he never did. That’s why. No ties, no commitments. Just sex.\u003c/p\u003e\n\u003cp\u003eHe was such a fucking shallow asshole for not caring more.\u003c/p\u003e\n\u003cp\u003e“Would she have any reason to want to hurt herself?” asked the female paramedic, giving Grant a mistrustful scowl. She was younger than her partner, with a cynical bitterness about her that came only from learning the hard way not to trust people.\u003c/p\u003e\n\u003cp\u003e“Hurt herself?” asked Grant, not understanding what she meant.\u003c/p\u003e\n\u003cp\u003e“Kill herself,” said the woman in a flat, indifferent tone.\u003c/p\u003e\n\u003cp\u003e“God, no. Isabelle would never do anything like that.”\u003c/p\u003e\n\u003cp\u003e“Kathy, I can’t get a line in. You try.”\u003c/p\u003e\n\u003cp\u003eKathy moved around Isabelle just as another seizure wracked her body. “Hold her down,” she ordered.\u003c/p\u003e\n\u003cp\u003eGrant helped them hold her still while he tried not to let himself think about what could happen.\u003c/p\u003e\n\u003cp\u003eHe couldn’t lose her. Not Isabelle.\u003c/p\u003e\n\u003cp\u003eFinally, Kathy managed to get an IV started. He only hoped that it would help flush the shit out of her system.\u003c/p\u003e\n\u003cp\u003e“Her pulse is getting weaker,” said the man. “We need to move.”\u003c/p\u003e\n\u003cp\u003e“Where’s the stuff you think poisoned her?” asked Kathy. “We’ll need to bring it with us.”\u003c/p\u003e\n\u003cp\u003e“In the kitchen. I’ll get it.”\u003c/p\u003e\n\u003cp\u003eHe raced downstairs and grabbed the bag of tea. The paramedics were already on their way down with her, so Grant followed in their wake.\u003c/p\u003e\n\u003cp\u003eKathy stopped him from getting into the back of the ambulance. “I’ll take that, sir.” She held her hand out for the tea.\u003c/p\u003e\n\u003cp\u003e“I’ll carry it.” He started to step up into the back of the ambulance when Kathy grabbed his arm and stopped him while snatching the bag of tea from his hand.\u003c/p\u003e\n\u003cp\u003e“I think it would be best if you followed us in your own car.”\u003c/p\u003e\n\u003cp\u003e“I want to be with her.”\u003c/p\u003e\n\u003cp\u003e“I understand that, sir, but we need the room to work.” It was a lie. Grant could hear it in her tone. But why would she lie about that? Why wouldn’t she want him to ride along?\u003c/p\u003e\n\u003cp\u003eOh, God. “You think I poisoned her?”\u003c/p\u003e\n\u003cp\u003e“I’m not saying that, sir. I just think it would be best if you followed behind us. Besides, you’re still not wearing any clothes.”\u003c/p\u003e\n\u003cp\u003eGrant looked down and realized he was wearing only his underwear, standing out on the street. Not that he gave a fuck what Isabelle’s neighbors thought of him, as long as he was with her and she was safe. “Please. I’d never do anything to hurt her. Just let me come with you.”\u003c/p\u003e\n\u003cp\u003e“They won’t let you in the hospital like that. Go get dressed and follow us. We’re wasting time arguing.” With that, Kathy shut the doors and the ambulance drove off with the wail of sirens floating behind them.\u003c/p\u003e\n\u003cp\u003eGrant stood there in shock. He should have been cold, but instead, he was just numb. Isabelle might be dying, and he was at least partially responsible.\u003c/p\u003e\n\u003cp\u003eHe’d fed her poisoned tea.\u003c/p\u003e\n\u003cp\u003eShe said she loved him.\u003c/p\u003e\n\u003cp\u003eHis brain couldn’t wrap around any of it. For the first time in his life, he had no idea what to do. This was all too much, and he had no one to turn to. His friends were busy dealing with their own problems, the police had already thought he might be the killer, and the only person in this whole town who gave a shit about him might be dying.\u003c/p\u003e\n\u003cp\u003eHe was alone and powerless to do anything to help Isabelle.\u003c/p\u003e\n\u003cp\u003eGrant didn’t know how long he stood there, but he was shivering when he finally pulled himself together enough to go back in the house. Two minutes later, he was in his car, dressed, and screeching down the quiet neighborhood street toward the hospital.\u003c/p\u003e\n\u003cp\u003eOne thing was for sure, he was no longer waiting around for the police to find the fucking killer. He was going to hunt the bastard down himself and take him out. Head shot. Nice and clean and guaranteed to work every time.\u003c/p\u003e\n\u003cp\u003eIf he was going to be in this alone, he was going to do it his way. No matter what it cost him.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-FIVE\u003c/p\u003e\n\u003cp\u003eDetective Mathews was waiting for Grant at the hospital. As Grant came through the doors, Mathews stepped in front of him, blocking his path.\u003c/p\u003e\n\u003cp\u003eGrant barely resisted hitting the man just to make himself feel better.\u003c/p\u003e\n\u003cp\u003eHe shoved his way past the detective and went straight to the emergency room desk. “I don’t have time to deal with you right now. I need to check on Isabelle.”\u003c/p\u003e\n\u003cp\u003e“They’re still working on her. You have a while before they’ll let you see her.”\u003c/p\u003e\n\u003cp\u003e“They’ll let me see her now,” said Grant, knowing he sounded threatening to the young woman behind the desk. If he had to scare a few people to get in to see Isabelle, then that’s what he’d do.\u003c/p\u003e\n\u003cp\u003e“She’s only been here a few minutes. Let them do their job.”\u003c/p\u003e\n\u003cp\u003e“If she’s only been here a few minutes, how did you get here so fast?”\u003c/p\u003e\n\u003cp\u003eMathews’s face went blank. “I was already here visiting someone.”\u003c/p\u003e\n\u003cp\u003eThe woman behind the desk spoke with a harried looking man in scrubs and pointed to Grant. He walked over and asked, “Are you with Isabelle Carson?”\u003c/p\u003e\n\u003cp\u003e“Yes. Is she okay?” Dear God, please let her be okay.\u003c/p\u003e\n\u003cp\u003e“We’ve stopped the seizures, but it will be a while until the lab can figure out what she ingested. Do you have any idea what was in the tea?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“How long ago did she drink it?”\u003c/p\u003e\n\u003cp\u003eGrant looked at the clock on the wall. “I don’t know exactly. About two hours ago.”\u003c/p\u003e\n\u003cp\u003eThe man nodded and wrote something on a chart.\u003c/p\u003e\n\u003cp\u003e“When can I see her?” asked Grant.\u003c/p\u003e\n\u003cp\u003e“As soon as she’s stable. She’s not out of the woods yet, so if you think of anything that might help us, please don’t wait to let us know.”\u003c/p\u003e\n\u003cp\u003eThe man walked off, and suddenly, Grant wasn’t sure he could stay standing. His legs were weak and shaking, and he thought he might throw up.\u003c/p\u003e\n\u003cp\u003eIsabelle wasn’t safe yet. Grant would have given anything to take her place right now. This helplessness was killing him.\u003c/p\u003e\n\u003cp\u003eDetective Mathews shoved a chair under Grant and eased him into it. “Are you sure you didn’t get any of that stuff into you?”\u003c/p\u003e\n\u003cp\u003e“I’m sure.”\u003c/p\u003e\n\u003cp\u003e“Did you bring it with you?”\u003c/p\u003e\n\u003cp\u003e“The paramedic took it with her in the ambulance.”\u003c/p\u003e\n\u003cp\u003e“Hold on. I need to take a look at it. I’ll be right back.”\u003c/p\u003e\n\u003cp\u003eGrant sat there in a plastic chair with his head in his hands, trying not to throw up. Isabelle had been poisoned. He’d been right there and he hadn’t seen the danger. He’d handed her the cup himself and smiled at her while she drank it down.\u003c/p\u003e\n\u003cp\u003eHe didn’t think he’d ever be able to forgive himself for that. He should have known something was wrong. His instincts should have been better.\u003c/p\u003e\n\u003cp\u003eMathews came back a couple of minutes later with a paper cup of water. “Drink this.”\u003c/p\u003e\n\u003cp\u003eGrant eyed the cup. “You think that’s going to make me feel better?”\u003c/p\u003e\n\u003cp\u003e“If you feel like I think you feel, you’ll try anything.”\u003c/p\u003e\n\u003cp\u003eHe was right, but Grant wasn’t going to ask him how he knew. He didn’t need to know anything about Detective Mathews other than how good he was at his job. Based on where Isabelle was right now, the answer was not fucking good enough.\u003c/p\u003e\n\u003cp\u003eGrant slugged the water back, but it didn’t help him feel better. He still wanted to physically fight his way back to Isabelle’s side if that’s what it took. Her being in danger again hurled him back to that night when he was willing to kill to keep her safe. He didn’t know what it was about her that triggered his caveman instincts, but they were rampaging through him, growling at him to take Isabelle and hide her away where no one could ever get to her again.\u003c/p\u003e\n\u003cp\u003e“The best thing you can do for her now is to let the doctors work.”\u003c/p\u003e\n\u003cp\u003e“I want to be with her.”\u003c/p\u003e\n\u003cp\u003e“I understand how you feel, but you’d just get in the way. They’ll come get you if she takes a turn for the worse.”\u003c/p\u003e\n\u003cp\u003e“How do you know?” demanded Grant.\u003c/p\u003e\n\u003cp\u003eMathews stared at him for a moment as if studying him. Whatever he saw seemed to satisfy him. “Experience,” he said. “Let me buy you a cup of coffee in the cafeteria and we can talk.”\u003c/p\u003e\n\u003cp\u003e“I don’t want any fucking coffee!”\u003c/p\u003e\n\u003cp\u003eSeveral heads turned toward Grant. One of them was a small boy with wide, frightened eyes. He stared at Grant while he clung to his mother’s arm.\u003c/p\u003e\n\u003cp\u003eGrant felt like a total shit for scaring the kid. “Fine. Coffee.” He told the nurse at the desk where he’d be, gave her his cell number, and followed Mathews down a long hall.\u003c/p\u003e\n\u003cp\u003eThe man knew exactly where they were going without even needing to read the signs, which made Grant wonder just how much time he’d been spending here lately.\u003c/p\u003e\n\u003cp\u003eNot that he cared.\u003c/p\u003e\n\u003cp\u003e“I’m sorry I jumped to the conclusion that you were guilty. I shouldn’t have done that.”\u003c/p\u003e\n\u003cp\u003e“I really don’t give a shit about that anymore. I’m too worried about Isabelle to care how much of a prick you are.”\u003c/p\u003e\n\u003cp\u003eMathews nodded. “Fair enough.”\u003c/p\u003e\n\u003cp\u003e“Daddy!” came a high-pitched, excited voice from behind them.\u003c/p\u003e\n\u003cp\u003eGrant turned and saw a little girl, maybe four years old, running toward Mathews. He bent down, scooped her up, and kissed the top of her head. “Heya, pumpkin. Aren’t you supposed to be with Aunt Janet?”\u003c/p\u003e\n\u003cp\u003e“I saw you go by Mommy’s room. You should come back and sit with her. She likes it when you hold her hand.”\u003c/p\u003e\n\u003cp\u003e“I will really soon, but I have to work now.”\u003c/p\u003e\n\u003cp\u003eThe little girl pouted and looked up at her father with giant brown eyes. “You always gotta work.”\u003c/p\u003e\n\u003cp\u003eGrant said, “Go ahead. I can get my own coffee.”\u003c/p\u003e\n\u003cp\u003e“No. We need to talk. There’s been a development in the case. Just give me a minute.”\u003c/p\u003e\n\u003cp\u003eMathews carried his daughter into one of the rooms, and Grant followed him. He stood in the doorway and watched as Mathews handed his girl to a woman sitting beside another woman’s bed. “You be good for Aunt Janet,” he told her. “I’ll meet you at home for dinner.”\u003c/p\u003e\n\u003cp\u003e“Pizza?” asked the little girl.\u003c/p\u003e\n\u003cp\u003e“If you’re good.” \u003c/p\u003e","sourceLink":"https://allnovel.net/no-escape-delta-force-3/page-39.html","bookId":2376,"creation":"Oct 5, 2019 10:17:34 AM","modification":"Oct 5, 2019 10:17:34 AM"}
