{"id":70677,"no":40,"title":"Page 40","content":"\u003cp\u003eMathews kissed his daughter, then went to the bed and did the same to the woman lying there. She couldn’t have been thirty yet, but she was dying. Grant was no doctor, but it was impossible to mistake. She was bone thin, and her skin had an ugly yellow cast to it. She had dark hollows under her eyes and they barely fluttered when Mathews smoothed patchy wisps of hair back over her balding head. His wedding ring flashed in the bright fluorescent lighting, and Grant realized that this had to be his wife.\u003c/p\u003e\n\u003cp\u003e“Love you, sweetheart. Be back soon,” he whispered, but Grant heard it. His heart ached for the man, but like with Isabelle, he was helpless to do a damn thing to make it better.\u003c/p\u003e\n\u003cp\u003eMathews shut the door behind him as he left his wife’s room. Nothing in his face showed he was suffering. If Grant hadn’t seen what the man was going through for himself, he never would have believed it.\u003c/p\u003e\n\u003cp\u003e“You should go spend time with your family,” said Grant.\u003c/p\u003e\n\u003cp\u003e“I’ve got to do my job. The bill collectors don’t care that my wife is sick.”\u003c/p\u003e\n\u003cp\u003e“I’m so sorry.”\u003c/p\u003e\n\u003cp\u003e“Forget it,” said Mathews. “And I mean that. This is none of your business, and I expect you to respect that.”\u003c/p\u003e\n\u003cp\u003e“Sure,” he said, though he knew it was a lie. That was not the kind of thing a man forgot easily.\u003c/p\u003e\n\u003cp\u003eThey went to the cafeteria and got coffee. Whatever pain Mathews was suffering, he somehow managed to push it aside long enough to do his job. “Where did Isabelle get the tea?”\u003c/p\u003e\n\u003cp\u003e“At school. She said one of her students gave it to her.”\u003c/p\u003e\n\u003cp\u003e“Today?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“We got that warrant to search Wyatt’s motel room this morning. There were bits of plant matter in there.”\u003c/p\u003e\n\u003cp\u003e“Plant matter?”\u003c/p\u003e\n\u003cp\u003e“I assumed it was pot, but after seeing the tea, I think it’s a pretty safe bet those plant bits are what he used to poison Isabelle.”\u003c/p\u003e\n\u003cp\u003eThat fucking bastard. Grant was going to kill him. He was going to force-feed him a gallon of that tea and see how he liked it.\u003c/p\u003e\n\u003cp\u003eMathews kept talking while the seething rage swelled inside Grant, taking over.\u003c/p\u003e\n\u003cp\u003e“I’ll have a sample sent to a lab, but the results could take weeks,” said Mathews.\u003c/p\u003e\n\u003cp\u003e“You can’t wait that long to charge him with the murders.”\u003c/p\u003e\n\u003cp\u003e“We won’t have to. The poison wasn’t the only thing we found in his room. Trina Skinner’s body was on his bed.”\u003c/p\u003e\n\u003cp\u003e“The woman who went missing?” Another victim. Another innocent woman dead. “How?”\u003c/p\u003e\n\u003cp\u003e“She was stabbed twenty-seven times.”\u003c/p\u003e\n\u003cp\u003eThe paper cup in Grant’s hand collapsed in his grip and coffee sloshed onto the table.\u003c/p\u003e\n\u003cp\u003eWyatt really needed to die, and Grant was more than ready to be the one to make that happen.\u003c/p\u003e\n\u003cp\u003eMathews nodded. “She hadn’t been dead long. Wyatt must have been holding her all this time. We’re not sure where.”\u003c/p\u003e\n\u003cp\u003eGrant did not allow himself to think about the horror Trina must have faced since she was abducted two months ago. He was already teetering on the edge of going hunting for Wyatt right now. His rifle was in his trunk. All he had to do was find the man and it would all be over.\u003c/p\u003e\n\u003cp\u003eIf it weren’t for his need to be near Isabelle, his need to know she was going to make it, he’d already be gone. “Why keep her so long and risk getting caught?”\u003c/p\u003e\n\u003cp\u003e“To kill her in the right order would be my guess.”\u003c/p\u003e\n\u003cp\u003e“That means he skipped Amanda, killed Trina, and moved on to Isabelle.”\u003c/p\u003e\n\u003cp\u003eMathews shook his head. “Amanda wasn’t around, so maybe he decided to move on without her. Either that, or he already got to her and we haven’t found the body yet.”\u003c/p\u003e\n\u003cp\u003e“No. Amanda’s fine. She called us this weekend and told us not to worry.” Grant’s tone was clipped and cold with denial. Amanda and her little girl were safe. He refused to believe anything else.\u003c/p\u003e\n\u003cp\u003eMathews’s mouth flattened like he didn’t quite buy it. “If you talk to her again, tell her to stay put until we’ve caught Wyatt.”\u003c/p\u003e\n\u003cp\u003e“How long will that take?”\u003c/p\u003e\n\u003cp\u003e“I wish I knew. You could pack up and leave town if it would make you feel safer.”\u003c/p\u003e\n\u003cp\u003e“I’m not going to feel safe until he’s back behind bars.” Or dead. Dead would be better.\u003c/p\u003e\n\u003cp\u003eThe harried-looking young man in scrubs came into the cafeteria and scanned the room. Grant’s heart gave a hard thump of anxiety as he rose to his feet.\u003c/p\u003e\n\u003cp\u003eThe man saw him and headed his direction. Grant met him halfway.\u003c/p\u003e\n\u003cp\u003e“Isabelle’s stable now,” said the man. “You can see her in a few minutes once they get her settled in a room.”\u003c/p\u003e\n\u003cp\u003e“Is she awake?”\u003c/p\u003e\n\u003cp\u003e“Not yet. It may take a while.”\u003c/p\u003e\n\u003cp\u003e“But she’ll be fine, right?”\u003c/p\u003e\n\u003cp\u003e“We can’t know for sure if there will be any lasting effects from the poison until after she’s conscious.”\u003c/p\u003e\n\u003cp\u003e“What the hell is that supposed to mean?” demanded Grant.\u003c/p\u003e\n\u003cp\u003eMathews put a restraining hand on his arm. “One step at a time, Grant. She’s going to live. Count your blessings.”\u003c/p\u003e\n\u003cp\u003eGrant jerked away from the detective and gave the intern a hard stare. “Tell me what that means.”\u003c/p\u003e\n\u003cp\u003e“It means that we don’t know. I’m sorry. Toxins are difficult to treat when we don’t know what they are. We treated her symptoms, and she seems to be recovering.”\u003c/p\u003e\n\u003cp\u003e“Seems to be?”\u003c/p\u003e\n\u003cp\u003e“We’ll just have to wait and see.”\u003c/p\u003e\n\u003cp\u003eThe man’s vague answers were threatening Grant’s tenuous control. He wanted to lash out and pound the answers out of this guy, even though he knew it wouldn’t help.\u003c/p\u003e\n\u003cp\u003eMathews stepped between them before Grant could do anything he’d regret. “Take us to her. He needs to see for himself she’s okay.”\u003c/p\u003e\n\u003cp\u003eThe man in scrubs looked nervously from Mathews to Grant, apparently catching on to how close he was to seeing violence up close and personal. “Uh. Right this way.”\u003c/p\u003e\n\u003cp\u003eIsabelle felt like she’d spent the night tumbling inside a dryer. Her skin was hot and parched, her stomach was spinning almost as much as her head, and every muscle in her body ached. Even her eyelids.\u003c/p\u003e\n\u003cp\u003eIt took her a minute to convince them to work, but finally, she cracked an eye open. Grant was the first thing she saw, though he was a bit fuzzy around the edges. He was sitting beside her, watching her with bloodshot eyes. When he saw her move, he jumped out of his chair and hovered over her.\u003c/p\u003e\n\u003cp\u003e“Hey, beautiful. How are you feeling?”\u003c/p\u003e\n\u003cp\u003eHer throat was raw, and when she spoke, only a hoarse whisper came out. “Like crap.”\u003c/p\u003e\n\u003cp\u003eGrant smiled a little. “Sure beats the alternative.”\u003c/p\u003e\n\u003cp\u003e“Feeling good?”\u003c/p\u003e\n\u003cp\u003e“No. Feeling nothing. You scared ten years off my life.”\u003c/p\u003e\n\u003cp\u003eIsabelle frowned in confusion and looked around. She wasn’t at home. She was in a hospital.\u003c/p\u003e\n\u003cp\u003eSlowly, bits and pieces of memories came back to her, though they were vague and fuzzy, as if she’d seen everything through a heavy fog. “What happened?”\u003c/p\u003e\n\u003cp\u003e“I’ll fill you in in a minute. Do you hurt anywhere?”\u003c/p\u003e\n\u003cp\u003eHer vision cleared enough that she could make out his face better. He looked horrible—like he’d been through the wringer himself. “Grant, what happened?”\u003c/p\u003e\n\u003cp\u003eHe looked at the wall behind her. “You ate something bad.”\u003c/p\u003e\n\u003cp\u003eIsabelle remembered the pain. That was not food poisoning. She’d had that before, and as horrible as it was, this was much worse. “You’re lying. Why are you lying to me?”\u003c/p\u003e\n\u003cp\u003e“I don’t want to scare you.”\u003c/p\u003e\n\u003cp\u003e“Then tell me what’s going on. You’re freaking me out.”\u003c/p\u003e\n\u003cp\u003eHe pulled in a deep breath and let it out. “The tea you brought home was poisoned.”\u003c/p\u003e\n\u003cp\u003ePoisoned? Isabelle’s mind struggled to make sense of that and couldn’t. “That can’t be true. None of my students would do anything to hurt me.”\u003c/p\u003e\n\u003cp\u003e“Did one of the students actually give you the tea?”\u003c/p\u003e\n\u003cp\u003e“Melissa Norton.”\u003c/p\u003e\n\u003cp\u003e“I need to tell Mathews.” He stood up as if preparing to leave.\u003c/p\u003e\n\u003cp\u003e“Grant, wait. Don’t leave me. I don’t understand what’s going on. I need you.”\u003c/p\u003e\n\u003cp\u003eGrant halted midstride, turned around, and came back to her bed. Some of the tension had left his body, but there was still a feral light in his golden eyes that worried her.\u003c/p\u003e\n\u003cp\u003eHe stroked her cheek, and his cool hand felt good against her hot skin. “I’m just going to get you a doctor and make a quick phone call. I’ll be back in two minutes, okay?”\u003c/p\u003e\n\u003cp\u003eIsabelle nodded and closed her eyes. She was so tired, even though the clock in the room said it was just barely five. When she opened them again, an hour had passed and Grant was gone.\u003c/p\u003e\n\u003cp\u003eKeith sat beside her, holding her hand, looking so worried it broke her heart.\u003c/p\u003e\n\u003cp\u003e“Hi,” she said.\u003c/p\u003e\n\u003cp\u003eKeith’s head jerked up. “Hi, yourself.”\u003c/p\u003e\n\u003cp\u003e“Where’s Grant?”\u003c/p\u003e\n\u003cp\u003e“He asked me to come sit with you for a little while. He ran home to get you some clothes and to check on Dale. They should be back any minute. How are you feeling?”\u003c/p\u003e\n\u003cp\u003e“Honestly, not so good, but I’ll live.”\u003c/p\u003e\n\u003cp\u003eKeith’s blue eyes filled up with tears, and he gripped her hand so hard it hurt. “I’m so sorry, Isabelle. You shouldn’t have to suffer like this.”\u003c/p\u003e\n\u003cp\u003e“I’m just tired.”\u003c/p\u003e\n\u003cp\u003e“Try to sleep, then. You’ll feel better if you sleep.”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-SIX\u003c/p\u003e\n\u003cp\u003eGrant had one foot out the door on his way back to the hospital when Isabelle’s home phone rang. He picked it up, hoping it was Dale.\u003c/p\u003e\n\u003cp\u003e“Hello.”\u003c/p\u003e\n\u003cp\u003e“Grant?” It was a girl’s voice, tight with panic.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Thank God. I’ve been trying to reach you for hours. Dale’s dad was at the school, and he was acting so mean. I ran inside to get help, but I was too late.” Finally, he recognized the voice as Angela’s.\u003c/p\u003e\n\u003cp\u003e“Slow down. What about Dale?”\u003c/p\u003e\n\u003cp\u003e“His dad took him.”\u003c/p\u003e\n\u003cp\u003e“What? When? Where?” He shouted the questions into the phone like a barrage of gunfire.\u003c/p\u003e\n\u003cp\u003eShe started crying, and Grant reeled in his temper. “Take a deep breath, Angela, and tell me what happened.”\u003c/p\u003e\n\u003cp\u003e“We were walking out of school. Dale’s dad was waiting for him.”\u003c/p\u003e\n\u003cp\u003e“And Dale left with him?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“In his dad’s car, or his own?”\u003c/p\u003e\n\u003cp\u003e“His dad’s.”\u003c/p\u003e\n\u003cp\u003e“Where did they go?”\u003c/p\u003e\n\u003cp\u003eAngela hiccoughed. “I don’t know. Dale told me to go inside.”\u003c/p\u003e\n\u003cp\u003e“And you did?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Good girl. Did you tell someone at school?”\u003c/p\u003e\n\u003cp\u003e“Yes. They called the police.”\u003c/p\u003e\n\u003cp\u003e“How long ago?”\u003c/p\u003e\n\u003cp\u003e“Over two hours ago. They’ve been trying to call Isabelle, but no one answered.”\u003c/p\u003e\n\u003cp\u003eGrant glanced at Isabelle’s answering machine. The thing was blinking like crazy. The police had probably tried to call her cell phone, too. He dug through her purse and found it. Ten new messages.\u003c/p\u003e\n\u003cp\u003eShit. This was so not good.\u003c/p\u003e\n\u003cp\u003e“Okay. Did you tell the police what happened? What you saw?”\u003c/p\u003e\n\u003cp\u003e“Yes.” \u003c/p\u003e","sourceLink":"https://allnovel.net/no-escape-delta-force-3/page-40.html","bookId":2376,"creation":"Oct 5, 2019 10:17:34 AM","modification":"Oct 5, 2019 10:17:34 AM"}
