{"id":70684,"no":47,"title":"Page 47","content":"\u003cp\u003eGrant muttered a low curse. “You think Wyatt’s going to wait until some specialist gets here? He’s getting twitchier by the minute. You have to do something now.”\u003c/p\u003e\n\u003cp\u003e“You’re not in charge here, Grant. Either shut up and let us do our job, or leave. I won’t have you making things worse.”\u003c/p\u003e\n\u003cp\u003eGrant pointed to the chaos around them. “How much worse do you think this can get? Does Rachel have to die before you’ll move in?”\u003c/p\u003e\n\u003cp\u003e“SWAT is on standby. We know what we’re doing.”\u003c/p\u003e\n\u003cp\u003e“Tell that to Rachel,” shouted Grant. “She’s in there, scared to death, and we’re standing around out here waiting for some specialist to arrive. Fuck that.”\u003c/p\u003e\n\u003cp\u003eGrant turned and stalked away back toward his Mustang. Isabelle turned to follow him, but Mathews stopped her by taking hold of her arm. “Let him go.”\u003c/p\u003e\n\u003cp\u003e“Are you going to let me talk to Wyatt?” asked Dale.\u003c/p\u003e\n\u003cp\u003e“Not yet. The longer we stall, the better. Phillips—the negotiator—is good. If anyone can find a way out of this mess, it’s her. All we have to do is stall until she gets here.”\u003c/p\u003e\n\u003cp\u003e“How long will that be?” asked Isabelle. All she could think about was little Rachel in there, alone and afraid. Something like this would be hard on the strongest child, but Rachel didn’t even have that going for her. She was emotionally frail. Something like this might destroy her.\u003c/p\u003e\n\u003cp\u003eFor all Isabelle knew, it might already be too late.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-TWO\u003c/p\u003e\n\u003cp\u003eGrant was good at not being seen, and with all the excitement and people milling around, no one noticed him carrying his duffel bag away from the scene. He slipped silently over a fence, being careful to avoid the yards with dogs in them. The last thing he wanted was to have any attention called to him now.\u003c/p\u003e\n\u003cp\u003eWyatt wasn’t going to stop, so Grant was going to stop him. The life of a little girl was at stake, not to mention Isabelle’s and Dale’s lives. He was willing to take the risk in exchange for being sure the job was done right, because although the police had procedures and protocol to follow, Grant didn’t. He might go down for killing the bastard, but prison would be easier than trying to live with himself if he stood by and did nothing.\u003c/p\u003e\n\u003cp\u003eHe found a vantage point in a rotting tree house that had probably gone so long without use it had been forgotten. The structure was sound enough to support his weight and had the added advantage of a straight line of sight into Amanda’s back windows.\u003c/p\u003e\n\u003cp\u003eGrant loaded his rifle and peered through the scope. Six armed men in black stood waiting outside the back door for the signal to move in. One more was stationed farther back—a sharpshooter. He figured there was at least one more sniper out there, but he couldn’t see him. That was a good sign.\u003c/p\u003e\n\u003cp\u003eThe blinds were mostly shut, but Grant could see movement behind the windows, too big to be Rachel. He settled himself and let the world fall away. Nothing mattered but his target. There was no rush. No pressure. Just the feel of the rifle in his capable hands and his breath moving in and out of his lungs.\u003c/p\u003e\n\u003cp\u003eSooner or later, he’d get a clean shot. And when he did, he was taking it.\u003c/p\u003e\n\u003cp\u003eWyatt paced the room. This was so messed up. They said they’d send Dale in five minutes ago, but he still hadn’t come. What was taking so long?\u003c/p\u003e\n\u003cp\u003eHe hit redial. The man who called himself Detective Mathews answered. “Everything okay in there?” he asked.\u003c/p\u003e\n\u003cp\u003e“Fucking great. Where’s Dale?”\u003c/p\u003e\n\u003cp\u003e“We’re getting him into a vest right now.”\u003c/p\u003e\n\u003cp\u003e“I’m not going to shoot him.”\u003c/p\u003e\n\u003cp\u003e“It’s just a precaution. Standard procedure.”\u003c/p\u003e\n\u003cp\u003eSweat rolled down Wyatt’s back. They were stalling. He could feel it in his bones. The question was, what for?\u003c/p\u003e\n\u003cp\u003eA sick, greasy dread filled him up. They were moving in to take him down. He had to get out of here. Now.\u003c/p\u003e\n\u003cp\u003eWyatt hung up the phone and grabbed the little girl from where she was huddled over her mother’s corpse, bawling. He picked her up and held her in front of his chest to keep the cops from shooting him.\u003c/p\u003e\n\u003cp\u003eBut where to go?\u003c/p\u003e\n\u003cp\u003eThe phone rang, but he ignored it. The time for talk was over. His only chance now was to get out of here and try to make the trade later.\u003c/p\u003e\n\u003cp\u003eHis car was parked a block over, behind the house. He’d sneaked in through the yard, thinking he’d be less visible that way. Maybe he could get out the same way.\u003c/p\u003e\n\u003cp\u003eWyatt peered through the blinds. The brat kicked and fought against his grip, so he squeezed her until she yelped with pain and settled down.\u003c/p\u003e\n\u003cp\u003eOutside, he could see at least two or three guys. They were waiting for him to come out. Even so, it still beat facing the twenty or thirty cops out front.\u003c/p\u003e\n\u003cp\u003eAnd he did have the girl to shield him. No way would the cops fire at him while he was holding a little girl.\u003c/p\u003e\n\u003cp\u003eAs far as he could tell, it was his only chance, and he’d better take it while he could. He had no idea of what they were planning to do with him, but he doubted it would be good.\u003c/p\u003e\n\u003cp\u003eWith his pistol in one hand and Rachel plastered against his chest, he kicked open the back door and eased out into the dark.\u003c/p\u003e\n\u003cp\u003eGrant saw Wyatt peer through the slats in the blinds, but Grant couldn’t see Rachel, and he wasn’t taking any chances.\u003c/p\u003e\n\u003cp\u003eThere was plenty of time to think. No rush.\u003c/p\u003e\n\u003cp\u003eThe cold sweat sliding over his ribs proved him a liar. This was not the same as taking out a target—killing a man he’d been ordered to kill, or one who was prepared to shoot back at him and his buddies.\u003c/p\u003e\n\u003cp\u003eThis was his call. His decision.\u003c/p\u003e\n\u003cp\u003e“You can’t do it, Grant,” came Isabelle’s gentle voice from below the tree house.\u003c/p\u003e\n\u003cp\u003eSurprise rippled through him, making his muscles tense.\u003c/p\u003e\n\u003cp\u003e“You shouldn’t be here. Go back to Dale.”\u003c/p\u003e\n\u003cp\u003e“You can’t do this,” said Isabelle.\u003c/p\u003e\n\u003cp\u003e“I have to. Rachel isn’t safe.”\u003c/p\u003e\n\u003cp\u003e“Let the police deal with it.”\u003c/p\u003e\n\u003cp\u003e“Because they’ve done such a great job so far? No. I know what I’m doing.”\u003c/p\u003e\n\u003cp\u003eHer voice was pitched high with desperation. “Do you?”\u003c/p\u003e\n\u003cp\u003eHe heard a scraping sound as she climbed up to the tree house and peered over the edge. “So you’re okay with killing a man?”\u003c/p\u003e\n\u003cp\u003e“Won’t be the first time. You know that.”\u003c/p\u003e\n\u003cp\u003e“This is different. You’re playing judge, jury, and executioner, and you have no right.”\u003c/p\u003e\n\u003cp\u003e“No, I’m killing a man before he can hurt the people I care about.”\u003c/p\u003e\n\u003cp\u003e“What about Dale? Do you care about him?”\u003c/p\u003e\n\u003cp\u003eGrant’s jaw ached from clenching it too hard. “You know I do.”\u003c/p\u003e\n\u003cp\u003e“How do you think he’ll feel when you tell him you killed his father?”\u003c/p\u003e\n\u003cp\u003eGrant hadn’t stopped to think about it. He was reacting to a threat with the most effective means he knew how.\u003c/p\u003e\n\u003cp\u003e“Or were you just planning on not telling him anything? Pretend it didn’t happen? Do you think you could ever look him in the eye again without thinking about how you killed his father?”\u003c/p\u003e\n\u003cp\u003eGrant hesitated. His finger vibrated against the trigger. “Wyatt deserves to die.”\u003c/p\u003e\n\u003cp\u003e“Yes, but you don’t deserve having to tell a boy you murdered his father. You don’t deserve to spend the rest of your life in prison.”\u003c/p\u003e\n\u003cp\u003eGrant hated it that she was right. Prison he could probably learn to handle, but Dale looking at him with hatred in his eyes? That he’d never survive.\u003c/p\u003e\n\u003cp\u003eGrant pulled in a breath and flicked on the weapon’s safety.\u003c/p\u003e\n\u003cp\u003eA gunshot rang out, and Grant located Wyatt through the rifle’s scope. The back of Wyatt’s head exploded at the same instant a hole appeared in his skull. Two more shots rang out—likely one from each sniper. Wyatt fell to the ground, landing on top of Rachel.\u003c/p\u003e\n\u003cp\u003eArmed men swarmed over the body, but Grant didn’t stick around long enough to watch.\u003c/p\u003e\n\u003cp\u003e“Time to go,” he told Isabelle.\u003c/p\u003e\n\u003cp\u003e“Did you . . . ?”\u003c/p\u003e\n\u003cp\u003e“No. It wasn’t me, and I don’t want them to think it was. Come on.”\u003c/p\u003e\n\u003cp\u003eA few quick, efficient movements later, Grant had his rifle back in the duffel bag. He eased out of the tree house and walked casually toward Amanda’s place with Isabelle at his side. Nearly everyone was behind the house where all the action was. He veered well around them, keeping out of sight.\u003c/p\u003e\n\u003cp\u003eThere wasn’t a single policeman near his car when he stowed his weapon, and he and Isabelle went to find Rachel.\u003c/p\u003e\n\u003cp\u003eIsabelle held Rachel’s hand while the paramedics readied her for transport. She was listless and unresponsive. The only sign she gave that she was still with them was a constant stream of tears down her cheeks. Isabelle gently wiped them away, but Rachel didn’t flinch, even though the bruise on her face had to hurt.\u003c/p\u003e\n\u003cp\u003e“Can I come with her?” she asked the paramedic.\u003c/p\u003e\n\u003cp\u003e“Are you family?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry. An officer will ride with her, though.”\u003c/p\u003e\n\u003cp\u003e“But her mother was killed. She doesn’t have anyone else.”\u003c/p\u003e\n\u003cp\u003e“No, ma’am. The woman inside isn’t dead. They’re working on her now.”\u003c/p\u003e\n\u003cp\u003eIsabelle’s heart gave a hard kick. “Are you sure? We were told she died.”\u003c/p\u003e\n\u003cp\u003e“She’s alive, though just barely.”\u003c/p\u003e\n\u003cp\u003eIsabelle clutched Rachel’s hand, trying to convey to her some sense of hope. “You hear that, sweetie? Your mom is alive. They’re helping her right now.” If she heard it, she didn’t acknowledge it.\u003c/p\u003e\n\u003cp\u003eThe paramedic checked his watch and made a notation. “You should go now. We’re ready to transport her.”\u003c/p\u003e\n\u003cp\u003e“I’ll meet you at the hospital, Rachel. Don’t worry. I’ll be there.” Isabelle didn’t know what else to say. It’s not like she could tell the girl everything was going to be okay. She knew better than to offer an empty promise like that. Rachel’s life had been irrevocably altered tonight, and it was going to be a long, slow recovery process—and that was assuming Amanda would live through this to offer her support.\u003c/p\u003e\n\u003cp\u003eAmanda. Isabelle needed to go to her, too. She needed to see for herself that her friend was alive and do whatever she could to help her stay that way.\u003c/p\u003e\n\u003cp\u003e“Be strong,” she told Rachel as she leaned down to kiss her forehead. “I’ll see you soon.”\u003c/p\u003e\n\u003cp\u003eIsabelle climbed down from the ambulance on weak legs. She felt like her whole world had been ripped apart and she couldn’t find the pieces to put it back together. Everything was too big. Too heavy. Even standing was a chore.\u003c/p\u003e\n\u003cp\u003eHow was she going to find the strength to support Rachel through this? And poor Amanda. If she lived, God willing, her life would be turned upside-down. She’d have even more to face, and the woman was barely holding it together as it was.\u003c/p\u003e\n\u003cp\u003eIsabelle stood there as the ambulance rolled away. She felt like a total failure. She should have found a way to prevent this from happening. She should have made sure Amanda had really left town. She knew what a strain that was going to be on her finances not to be able to work. Why hadn’t she predicted something like this could happen?\u003c/p\u003e\n\u003cp\u003eShe didn’t have time to dwell on her mistakes now. She had to focus on not making any more. She had to check on Amanda, then get to the hospital and be there for Rachel.\u003c/p\u003e\n\u003cp\u003eIsabelle turned to take a step toward the car, and her body wouldn’t move. She was frozen on the spot, trembling with fatigue. \u003c/p\u003e","sourceLink":"https://allnovel.net/no-escape-delta-force-3/page-47.html","bookId":2376,"creation":"Oct 5, 2019 10:17:34 AM","modification":"Oct 5, 2019 10:17:34 AM"}
