{"id":70690,"no":53,"title":"Page 53","content":"\u003cp\u003e“Damn it!” seethed Keith. “Why is doing the right thing always so complicated?” He stomped away, behind her where she couldn’t see. When he came back, he was wielding a gun.\u003c/p\u003e\n\u003cp\u003eIsabelle’s blood ran cold. He was going to kill Grant right now. Right here.\u003c/p\u003e\n\u003cp\u003eShe had to warn him. She screamed louder, begging Dale with her eyes to help her, too.\u003c/p\u003e\n\u003cp\u003eKeith went to the door. She couldn’t see him around the corner, but she could hear him turn the lock.\u003c/p\u003e\n\u003cp\u003e“Hey, Grant,” said Keith, sounding like nothing was wrong.\u003c/p\u003e\n\u003cp\u003e“I need to talk to Isabelle.”\u003c/p\u003e\n\u003cp\u003e“She doesn’t want to see you. I’m sorry. It’s best if you just go.”\u003c/p\u003e\n\u003cp\u003eNo! Isabelle rocked her chair, scooting it the last few inches until she was near the wall. Her head was the only thing she could move, so she slammed it against the wall. Pain exploded in her head. She shook it off and did it again. This time, her vision filled with flickering lights. She couldn’t let herself pass out, and she blinked hard to clear her vision.\u003c/p\u003e\n\u003cp\u003e“What was that?” asked Grant.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“That pounding?”\u003c/p\u003e\n\u003cp\u003e“Dale’s music,” said Keith, smooth and calm.\u003c/p\u003e\n\u003cp\u003e“That didn’t sound like—”\u003c/p\u003e\n\u003cp\u003eDale tipped his chair over, and it broke apart under his weight. The sound of splintering wood filled the room.\u003c/p\u003e\n\u003cp\u003e“What the hell?”\u003c/p\u003e\n\u003cp\u003eThere was a harsh grunt, then Grant appeared around the corner and took in the situation in one sweeping glance. Behind him, Keith approached, gun in one hand, what looked like a can of Mace in the other.\u003c/p\u003e\n\u003cp\u003eIsabelle screamed and jerked her head, trying to tell Grant Keith was behind him. He spun around and saw the gun. Grant reacted in a brutally fast attack. One second, the gun was in Keith’s hand, the next, it was skidding across the floor.\u003c/p\u003e\n\u003cp\u003eGrant pinned Keith to the wall by the throat. Keith lifted the can of Mace and sprayed. Grant knocked the can aside, deflecting most of the spray away from his face, but some of it went into his right eye.\u003c/p\u003e\n\u003cp\u003eGrant’s body went limp and crumpled to the floor. His eyes were still open, staring without blinking. He lay there limp, like a puppet with cut strings.\u003c/p\u003e\n\u003cp\u003eKeith retrieved the gun and stood over him. That feral glow of insanity was back in his eyes. He was going to kill Grant while Isabelle watched, both of them helpless to stop it.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-EIGHT\u003c/p\u003e\n\u003cp\u003eGrant was seething, boiling over with the kind of rage and desperation he’d felt the night he’d killed Lavine, but it didn’t do him any good. He couldn’t move. Couldn’t even blink.\u003c/p\u003e\n\u003cp\u003eWhatever Keith had sprayed him with was fast, potent stuff. If he didn’t find a way to throw off the effects, they were all dead.\u003c/p\u003e\n\u003cp\u003eHe heard Isabelle’s muffled scream from across the room. Keith had her tied to a chair. Blood ran down the side of her face, mixing with panicked tears. And her eyes, they were wide with terror and anguish.\u003c/p\u003e\n\u003cp\u003eKeith had hurt her, and Grant was going to kill him for it.\u003c/p\u003e\n\u003cp\u003eGrant tamped down the urge and tried to concentrate on what he needed to do to save her and the others. He took a quick survey of his body, trying to move anything. All he got was a tiny wiggle in his toes. Not much, but something. He had no idea how long this stuff lasted, or if it was permanent.\u003c/p\u003e\n\u003cp\u003ePanic made his heart pound. What if he wasn’t able to help them? What if he had to watch them die?\u003c/p\u003e\n\u003cp\u003eGet a grip. Focus.\u003c/p\u003e\n\u003cp\u003eAt least his heart was still working. Whatever had paralyzed him could have done so to his heart muscle and diaphragm, as well. He could still breathe. That was something.\u003c/p\u003e\n\u003cp\u003eKeith grabbed him by the arm and dragged him over the floor. “Why do you have to make things so hard on me?”\u003c/p\u003e\n\u003cp\u003eGrant’s foot twitched. He moved it again, just to be sure it wasn’t an accident. It moved.\u003c/p\u003e\n\u003cp\u003eExcitement raced through him. He was metabolizing the paralytic quickly. Maybe if he revved up his heart rate to speed his metabolism it would help. He could slow his heart when he needed to take a shot. Maybe he could do the opposite now.\u003c/p\u003e\n\u003cp\u003eKeith arranged Grant’s body so he could see the room. “Stay right here. I’ll be back for you in a minute as soon as Isabelle finishes taking her medicine.”\u003c/p\u003e\n\u003cp\u003eDale struggled to rid himself of the ropes and bits of broken chair that were taped to his legs. Keith was hardly paying him any attention. He walked by, backhanded Dale in the face, and the boy went down hard without so much as a twitch.\u003c/p\u003e\n\u003cp\u003eA splinter of wood cut Dale’s face, and blood oozed into the carpet.\u003c/p\u003e\n\u003cp\u003eRage took over. Grant let it. He gave in to the feeling and let it consume him. His heart hammered in his chest, and sweat beaded up on his skin. He was going to kill Keith. He’d spilled a child’s blood. He’d hurt Isabelle. No one hurt his Isabelle.\u003c/p\u003e\n\u003cp\u003eKeith set the spray can down, picked up her chair, and moved it away from the wall. He inspected her head with gentle fingers. “You shouldn’t have done that. I hate seeing you bleed.”\u003c/p\u003e\n\u003cp\u003eHe ripped the tape from Isabelle’s mouth, and she screamed loud enough to wake the dead. “Help!”\u003c/p\u003e\n\u003cp\u003eKeith clamped a hand hard over her mouth. “Shut up, or I’ll shoot Dale in the head right now. Understand?”\u003c/p\u003e\n\u003cp\u003eIsabelle went silent.\u003c/p\u003e\n\u003cp\u003eA buzzing sensation lightened Grant’s limbs. He could move his arms now, though he was careful not to let Keith see. Another minute or two and maybe he’d be able to sit up.\u003c/p\u003e\n\u003cp\u003eKeith poured pills into his hand and pressed them into Isabelle’s mouth. “We’re running out of time. Swallow faster.”\u003c/p\u003e\n\u003cp\u003e“Please don’t make me do this,” begged Isabelle around the pills.\u003c/p\u003e\n\u003cp\u003eKeith smoothed her hair away from her sweaty face. “It’ll be okay. You’ll see. Just a few more and everything will be okay.”\u003c/p\u003e\n\u003cp\u003e“You’re crazy. I don’t want to die,” she sobbed.\u003c/p\u003e\n\u003cp\u003e“You’re just afraid.” Keith’s soothing caress over her hair made Grant want to break his fingers one by one.\u003c/p\u003e\n\u003cp\u003e“Of course I’m afraid. You’re killing the people I love.”\u003c/p\u003e\n\u003cp\u003eKeith’s face twisted, and his blue eyes glowed bright. He grabbed her hair in his fist and leaned down close to her face. His voice was harsh and biting. “Not killing. Helping. I would never kill anyone. Say it.”\u003c/p\u003e\n\u003cp\u003eIsabelle clamped her lips together.\u003c/p\u003e\n\u003cp\u003eKeith jerked her head back. “Say it!”\u003c/p\u003e\n\u003cp\u003eShe said nothing.\u003c/p\u003e\n\u003cp\u003eKeith let her go, walked over to Rachel, and put the gun against her temple. “Say it.”\u003c/p\u003e\n\u003cp\u003eGrant couldn’t wait any longer. He felt heavy and weak, but at least he could move. He surged up from the floor and tackled Keith. They went down in a clumsy sprawl of arms and legs, but at least the weapon was no longer pointed at Rachel.\u003c/p\u003e\n\u003cp\u003eA gunshot blasted through the room. Grant felt no pain, which didn’t mean anything, but he also didn’t feel the force of the bullet, which meant he either hadn’t been hit or had just been grazed. Either way, he was still moving, and he shoved forward, slamming Keith to the ground.\u003c/p\u003e\n\u003cp\u003eKeith punched Grant in the jaw, making his head snap to the side. He was a strong motherfucker. Stronger than Grant had guessed.\u003c/p\u003e\n\u003cp\u003eGrant grabbed the hand with the weapon, keeping it pointed away from the others. Keith hit him in the head again, and this time, he didn’t bounce back so well. His body still wasn’t working right, and every move was slower and weaker than normal. Keith twisted his body and pinned Grant to the ground. Grant had to use both hands to keep Keith from shooting him. Unfortunately, that left Keith a free hand to lock around Grant’s throat.\u003c/p\u003e\n\u003cp\u003eKeith squeezed, blocking off his air.\u003c/p\u003e\n\u003cp\u003eGrant twisted his arm, trying to pry the gun away. He was getting weaker by the second without any oxygen. He felt like a fish out of water, clumsy and flopping around on the ground.\u003c/p\u003e\n\u003cp\u003eBehind Keith, Dale’s fish tank bubbled merrily, its occupants blissfully unaware that if the gun went off, their world would be shattered. Literally.\u003c/p\u003e\n\u003cp\u003eWhich was a good idea. Fifty gallons of water was freaking heavy.\u003c/p\u003e\n\u003cp\u003eGrant lifted his leg and caught his foot in a decorative curl of the iron stand. He pulled, but it was too heavy. Nothing happened. He pulled harder.\u003c/p\u003e\n\u003cp\u003eFireworks went off inside his eyeballs. He was running out of air and time. If he didn’t do this, Keith would live and Isabelle and the kids would be murdered.\u003c/p\u003e\n\u003cp\u003eNo fucking way was Grant going to let that happen.\u003c/p\u003e\n\u003cp\u003eHe let his rage fuel his strength and pulled, using every bit of power he had left. The aquarium tilted. He pulled more. It tilted farther, then fell in slow motion, crashing over Keith’s back.\u003c/p\u003e\n\u003cp\u003eThe weight was staggering—glass shattered and water spewed everywhere, drenching them.\u003c/p\u003e\n\u003cp\u003eKeith let go of Grant’s neck. Grant shook his head so he could get a breath of air and not water. As soon as he sucked in his first breath, he shoved Keith’s groaning body off of his and looked for the gun. It had been washed away and lay on the floor near Rachel’s chair.\u003c/p\u003e\n\u003cp\u003eGrant’s body felt heavy and weak, but he pushed to his feet. He had to take care of securing Keith before he could go to Isabelle.\u003c/p\u003e\n\u003cp\u003eDale was already up and working on freeing Isabelle. Grant held out his hand to Dale. “Tape.”\u003c/p\u003e\n\u003cp\u003eIsabelle’s voice was shaky. Strained. “Help Rachel and Amanda first. Please.”\u003c/p\u003e\n\u003cp\u003eDale grabbed the roll of duct tape and tossed it to Grant. He made quick work of securing Keith so the fucker had no chance of getting free. He had plenty of nasty cuts over his back, but Grant couldn’t bring himself to care enough to stop the bleeding.\u003c/p\u003e\n\u003cp\u003e“You okay?” he asked Dale.\u003c/p\u003e\n\u003cp\u003eHe cut one of the ropes holding Rachel to her chair. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“Thought he knocked you out.”\u003c/p\u003e\n\u003cp\u003e“I’m good at faking it. I wasn’t any fun for Wyatt to hit once I went down,” said Dale. “Guess it was good I had the practice, huh?”\u003c/p\u003e\n\u003cp\u003eGrant had no idea what to say to that. Poor kid. But he’d be here for them to talk about it later. He’d help Dale work through things. Grant wasn’t going anywhere.\u003c/p\u003e\n\u003cp\u003eHe picked up the gun as he passed it, checked the safety, and shoved it into his jeans.\u003c/p\u003e\n\u003cp\u003eNow, finally, he could go to Isabelle.\u003c/p\u003e\n\u003cp\u003e“How are you, honey?” he asked her.\u003c/p\u003e\n\u003cp\u003e“Just get me loose.”\u003c/p\u003e\n\u003cp\u003eDale had cut away the remaining ropes and tape but didn’t have a key for the handcuffs. “Did you see a key?” he asked her.\u003c/p\u003e\n\u003cp\u003eIsabelle shook her head. She didn’t look good. “I need to throw up. Help me to the bathroom.”\u003c/p\u003e\n\u003cp\u003e“Keith fed her a bunch of pills,” said Dale. “Like fifty.”\u003c/p\u003e\n\u003cp\u003e“Less than that,” she said. “I counted thirty-eight.”\u003c/p\u003e\n\u003cp\u003eGrant had to make a conscious effort not to panic at that news. No time for a bathroom. There were dying fish all over the floor, anyway. It’s not like the carpet was going to be saved.\u003c/p\u003e\n\u003cp\u003eHer hands were bound, so he used his fingers to gag her and made her throw up. The pills were all still mostly intact, which had to be a good thing. He counted thirty-five.\u003c/p\u003e\n\u003cp\u003eIsabelle shook in his arms, and he couldn’t stand to let her go. He pulled his cell phone out of his pocket, but the fight or the water had killed it. “I’m going to call for help. Just hold on, okay?”\u003c/p\u003e\n\u003cp\u003e“I’ll do it,” offered Dale.\u003c/p\u003e\n\u003cp\u003e“Is Amanda alive?” asked Isabelle.\u003c/p\u003e\n\u003cp\u003eGrant glanced at her. She was lying on the floor, but she was breathing. “Yes.” \u003c/p\u003e","sourceLink":"https://allnovel.net/no-escape-delta-force-3/page-53.html","bookId":2376,"creation":"Oct 5, 2019 10:17:34 AM","modification":"Oct 5, 2019 10:17:34 AM"}
