{"id":35524,"no":10,"title":"Chapter 10","content":"\u003cp\u003e. . . Only Yankee know-how and the mass-production system -- Detroit, Chicago, Cleveland, the magic names! -- could have done the trick, sent that ceaseless and almost witlessly noble flood of cheap one-dollar (the China Dollar, the trade dollar) television kits to every village and backwater of the Orient. And when the kit had been assembled by some gaunt, feverish-minded youth in the village, starved for a chance, for that which the generous Americans held out to him, that tinny little instrument with its built-in power supply no larger than a marble began to receive. And what did it receive? Crouching before the screen, the youths of the village -- and often the elders as well -- saw words. Instructions. How to read, first. Then the rest. How to dig a deeper well. Plow a deeper furrow. How to purify their water, heal their sick. Overhead, the American artificial moon wheeled, distributing the signal, carrying it everywhere. . . to all the waiting, avid masses of the East.\u003c/p\u003e  \n\u003cp\u003e. . . What had China been? Yearning, one needful commingled entity looking toward the West, its great democratic President, Chiang Kai-shek, who had led the Chinese people through the years of war, now into the years of peace, into the Decade of Rebuilding. But for China it was not a rebuilding, for that almost supernaturally vast flat land had never been built, lay still slumbering in the ancient dream. Arousing; yes, the entity, the giant, had to partake at last of full consciousness, had to waken into the modern world with its jet airplanes and atomic power, its autobahns and factories and medicines. And from whence would come the crack of thunder which would rouse the giant? Chiang had known that, even during the struggle to defeat Japan. It would come from the United States. And, by 1950, American technicians and engineers, teachers, doctors, agronomists, swarming like some new life form into each province, each --\u003c/p\u003e          \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/343/781.html","bookId":313,"creation":"Aug 5, 2019 6:28:08 AM","modification":"Aug 5, 2019 6:28:08 AM"}
