{"id":20408,"no":13,"title":"CHAPTER XIII. MISCHIEF ON FOOT","content":"\u0026nbsp;As may be supposed, John Haynes was deeply incensed with Frank Frost for the manner in which he had foiled him in his attack upon Pomp. He felt that in this whole matter he had appeared by no means to advantage. After all his boasting, he had been defeated by a boy younger and smaller than himself. The old grudge which he had against Frank for the success gained over him at school increased and added poignancy to his mortification. He felt that he should never be satisfied until he had “come up” with Frank in some way. The prospect of seeing him ejected from the farm was pleasant, but it was too far off. John did not feel like waiting so long for the gratification of his revengeful feelings. He resolved in the meantime to devise some method of injuring or annoying Frank. \n\u003cdiv\u003e\n He could not at once think of anything feasible. Several schemes flitted across his mind, but all were open to some objection. John did not care to attempt anything which would expose him, if discovered, to a legal punishment. I am afraid this weighed more with him than the wrong or injustice of his schemes.\n\u003c/div\u003e \n\u003cdiv\u003e\n At last it occurred to him that Mr. Frost kept a couple of pigs. To let them out secretly at night would be annoying to Frank, as they would probably stray quite a distance, and thus a tedious pursuit would be made necessary. Perhaps they might never be found, in which case John felt that he should not grieve much.\n\u003c/div\u003e \n\u003cdiv\u003e\n Upon this scheme John finally settled as the one promising the most amusement to himself and annoyance to his enemy, as he chose to regard Frank. He felt quite averse, however, to doing the work himself. In the first place, it must be done by night, and he could not absent himself from the house at a late hour without his father\u0027s knowledge. Again, he knew there was a risk of being caught, and it would not sound very well if noised abroad that the son of Squire Haynes had gone out by night and let loose a neighbor\u0027s pigs.\n\u003c/div\u003e \n\u003cdiv\u003e\n He cast about in his mind for a confederate, and after awhile settled upon a boy named Dick Bumstead.\n\u003c/div\u003e \n\u003cdiv\u003e\n This Dick had the reputation of being a scape-grace and a ne\u0027er-do-well. He was about the age of John Haynes, but had not attended school for a couple of years, and, less from want of natural capacity than from indolence, knew scarcely more than a boy of ten. His father was a shoemaker, and had felt obliged to keep his son at home to assist him in the shop. He did not prove a very efficient assistant, however, being inclined to shirk duty whenever he could.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was upon this boy that John Haynes fixed as most likely to help him in his plot. On his way home from school the next afternoon, he noticed Dick loitering along a little in advance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hold on, Dick,” he called out, in a friendly voice, at the same time quickening his pace.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick turned in some surprise, for John Haynes had a foolish pride, which had hitherto kept him very distant toward those whom he regarded as standing lower than himself in the social scale.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you, John?” he responded, putting up the knife with which he had been whittling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right. What are you up to nowadays?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Working in the shop,” said Dick, shrugging his shoulders. “I wish people didn\u0027t wear shoes, for my part. I\u0027ve helped make my share. Pegging isn\u0027t a very interesting operation.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said John, with remarkable affability. “I shouldn\u0027t think there\u0027d be much fun in it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fun! I guess not. For my part, I\u0027d be willing to go barefoot, if other people would, for the sake of getting rid of pegging.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you have some time to yourself, though, don\u0027t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Precious little. I ought to be in the shop now. Father sent me down to the store for some awls, and he\u0027ll be fretting because I don\u0027t get back. I broke my awl on purpose,” said Dick, laughing, “so as to get a chance to run out a little while.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose your father gives you some of the money that you earn, doesn\u0027t he?\u0027 inquired John.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A few cents now and then; that\u0027s all. He says everything is so high nowadays that it takes all we can both of us earn to buy food and clothes. So if a fellow wants a few cents now and then to buy a cigar, he can\u0027t have \u0027em.”\n\u003c/div\u003e \n\u003cdiv\u003e\n John was glad to hear this. He felt that he could the more readily induce Dick to assist him in his plans.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dick!” he said abruptly, looking round to see that no one was within hearing-distance, “wouldn\u0027t you like to earn a two-dollar bill?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “For myself?” inquired Dick.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is there much work in it?” asked indolent Dick cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, and what little there is will be fun.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I\u0027m in for it. That is, I think I am. What is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027ll promise not to tell?” said John.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Honor bright.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s only a little practical joke that I want to play upon one of the boys.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “On who?” asked Dick, unmindful of his grammar.\n\u003c/div\u003e \n\u003cdiv\u003e\n “On Frank Frost.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Frank\u0027s a pretty good fellow. It isn\u0027t going to hurt him any, is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, no, of course not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because I wouldn\u0027t want to do that. He\u0027s always treated me well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course he has. It\u0027s only a little joke, you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, well, if it\u0027s a joke, just count me in. Fire away, and let me know what you want done.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know that Frank, or his father, keeps pigs?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want you to go some night—the sooner the better—and let them out, so that when morning comes the pigs will be minus, and Master Frank will have a fine chase after them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seems to me,” said Dick, “that won\u0027t be much of a joke.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I guess you never saw a pig-chase. Pigs are so contrary that if you want them to go in one direction they are sure to go in another. The way they gallop over the ground, with their little tails wriggling behind them, is a caution.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But it would be a great trouble to Frank to get them back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, well, you could help him, and so get still more fun out of it, he not knowing, of course, that you had anything to do with letting them out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And that would take me out of the shop for a couple of hours,” said Dick, brightening at the thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course,” said John; “so you would get a double advantage. Come, what do you say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I don\u0027t know,” said Dick, wavering. “You\u0027d pay me the money down on the nail, wouldn\u0027t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said John. “I\u0027ll show you the bill now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He took from his pocketbook a two-dollar greenback, and displayed it to Dick.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You could buy cigars enough with this to last you some time,” he said insinuatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I could. I declare, I\u0027ve a good mind to take up your offer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027d better. It\u0027s a good one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But why don\u0027t you do it yourself?” asked Dick, with sudden wonder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because father\u0027s very strict,” said John glibly, “and if I should leave the house at night, he\u0027d be sure to find it out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s where I have the advantage. I sleep downstairs, and can easily slip out of the window, without anybody\u0027s being the wiser.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just the thing. Then you agree?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I might as well. Are you particular about the night?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, take your choice about that. Only the sooner the better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The two boys separated, John feeling quite elated with his success.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2969/81753.html","bookId":375,"creation":"Aug 2, 2019 11:44:33 AM","modification":"Aug 2, 2019 11:44:33 AM"}
