{"id":20428,"no":33,"title":"CHAPTER XXXIII. CONCLUSION","content":"\u0026nbsp;The restitution which Squire Haynes was compelled to make stripped him of more than half his property. His mortification and chagrin was so great that he determined to remove from Rossville. He gave no intimation where he was going, but it is understood that he is now living in the vicinity of Philadelphia, in a much more modest way than at Rossville. \n\u003cdiv\u003e\n To anticipate matters a little, it may be said that John was recently examined for college, but failed so signally that he will not again make the attempt. He has shown a disposition to be extravagant, which, unless curbed, will help him run through his father\u0027s diminished property at a rapid rate whenever it shall come into his possession.\n\u003c/div\u003e \n\u003cdiv\u003e\n The squire\u0027s handsome house in Rossville was purchased by Henry Morton—I must still be allowed to call him thus, though not his real name. He has not yet taken up his residence there, but there is reason to believe that ere long there will be a Mrs. Morton to keep him company therein.\n\u003c/div\u003e \n\u003cdiv\u003e\n Not long since, as he and Frank lay stretched out beneath a thick-branching oak in the front yard at the farm, Mr. Morton turned to our hero and said, “Are you meaning to go to college when your father comes home, Frank?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank hesitated.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have always looked forward to it,” he said, “but lately I have been thinking that I shall have to give up the idea.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because it is so expensive that my father cannot, in justice to his other children, support me through a four years\u0027 course. Besides, you know, Mr. Morton, we are four hundred dollars in your debt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Should you like very much to go to college, Frank?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better than anything else in the world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you shall go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank looked up in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t you understand me?” said Mr. Morton.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean that I will defray your expenses through college.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank could hardly believe his ears.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You would spend so much money on me!” he exclaimed incredulously. “Why, it will cost a thousand dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, I can afford it,” said Mr. Morton. “But perhaps you object to the plan.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How good you are to me!” said Frank, impulsively seizing his friend\u0027s hand. “What have I done to deserve so much kindness?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have done your duty, Frank, at the sacrifice of your inclinations. I think you ought to be rewarded. God has bestowed upon me more than I need. I think he intends that I shall become his almoner. If you desire to express your gratitude, you can best do it by improving the advantages which will be opened to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Frank hastened to his mother to communicate his brilliant prospects. Her joy was scarcely less than his.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do not forget, Frank,” she said, “who it is that has raised up this friend for you. Give Him the thanks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was another whose heart was gladdened when this welcome news reached him in his tent beside the Rappahannock. He felt that while he was doing his duty in the field, God was taking better care of his family than he could have done if he remained at home.\n\u003c/div\u003e \n\u003cdiv\u003e\n Before closing this chronicle I must satisfy the curiosity of my readers upon a few points in which they may feel interested.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Rossville Guards are still in existence, and Frank is still their captain. They have already done escort duty on several occasions, and once they visited Boston, and marched up State Street with a precision of step which would have done no discredit to veteran soldiers.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dick Bumstead\u0027s reformation proved to be a permanent one. He is Frank\u0027s most intimate friend, and with his assistance is laboring to remedy the defects of his early education. He has plenty of ability, and, now that he has turned over a new leaf, I have no hesitation in predicting for him a useful and honorable career.\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Mrs. Payson has left Rossville, much to the delight of her grandson Sam, who never could get along with his grandmother. She still wears for best the “bunnit” presented her by Cynthy Ann, which, notwithstanding its mishap, seems likely to last her to the end of her natural life. She still has a weakness for hot gingerbread and mince pie, and, though she is turned of seventy, would walk a mile any afternoon with such an inducement.\n\u003c/div\u003e \n\u003cdiv\u003e\n Should any of my readers at any time visit the small town of Sparta, and encounter in the street a little old lady dressed in a brown cloak and hood, and firmly grasping in her right hand a faded blue cotton umbrella, they may feel quite certain that they are in the presence of Mrs. Mehitabel Payson, relict of Jeremiah Payson, deceased.\n\u003c/div\u003e \n\u003cdiv\u003e\n Little Pomp has improved very much both in his studies and his behavior. He now attends school regularly, and is quite as far advanced as most boys of his age. Though he is not entirely cured of his mischievous propensities, he behaves “pretty well, considering,” and is a great deal of company to old Chloe, to whom he reads stories in books lent him by Frank and others. Chloe is amazingly proud of Pomp, whom she regards as a perfect prodigy of talent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lor\u0027 bress you, missus,” she remarked to Mrs. Frost one day, “he reads jest as fast as I can talk. He\u0027s an awful smart boy, dat Pomp.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why don\u0027t you let him teach you to read, Chloe?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Lor\u0027, missus, I couldn\u0027t learn, nohow. I ain\u0027t got no gumption. I don\u0027t know noffin\u0027.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why couldn\u0027t you learn as well as Pomp?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dat ar boy\u0027s a gen\u0027us, missus. His fader was a mighty smart nigger, and Pomp\u0027s took arter him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Chloe\u0027s conviction of her own inferiority and Pomp\u0027s superior ability seemed so rooted that Mrs. Frost finally gave up her persuasions. Meanwhile, as Chloe is in good health and has abundance of work, she has no difficulty in earning a comfortable subsistence for herself and Pomp. As soon as Pomp is old enough, Frank will employ him upon the farm.\n\u003c/div\u003e \n\u003cdiv\u003e\n While I am writing these lines intelligence has just been received from Frank\u0027s substitute at the seat of war. He has just been promoted to a captaincy. In communicating this he adds: “You may tell Frank that I am now his equal in rank, though his commission bears an earlier date. I suppose, therefore, I must content myself with being Captain Frost, Jr. I shall be very glad when the necessities of the country will permit me to lay aside the insignia of rank and, returning to Rossville, subside into plain Henry Frost again. If you ask me when this is to be, I can only say that it depends on the length of our struggle. I am enlisted for the war, and I mean to see it through! Till that time Frank must content himself with acting as my substitute at home. I am so well pleased with his management of the farm that I am convinced it is doing as well as if I were at home to superintend it in person. Express to Mr. Waring my gratitude for the generous proposal he has made to Frank. I feel that words are inadequate to express the extent of our obligations to him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Some years have passed since the above letter was written. The war is happily over, and Captain Frost has returned home with an honorable record of service. Released from duty at home, Frank has exchanged the farm for the college hall, and he is now approaching graduation, one of the foremost scholars in his class. He bids fair to carry out the promise of his boyhood, and in the more varied and prolonged campaign which manhood opens before him we have reason to believe that he will display equal fidelity and gain an equal success.\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2969/81773.html","bookId":375,"creation":"Aug 2, 2019 11:44:33 AM","modification":"Aug 2, 2019 11:44:33 AM"}
