{"id":20402,"no":7,"title":"CHAPTER VII. LIKE FATHER, LIKE SON","content":"\u0026nbsp;“Well, father, I\u0027ve got some news for you,” said John Haynes, as he entered his father\u0027s presence, two or three days later. \n\u003cdiv\u003e\n “What is it, John?” inquired the squire, laying down a copy of the New York Herald, which he had been reading.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who do you think has enlisted?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not choose to guess,” said his father coldly. “If you feel disposed to tell me, you may do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n John looked somewhat offended at his father\u0027s tone, but he was anxious to tell the news. “Frost\u0027s going to enlist,” he said shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed!” said the squire, with interest. “How did you hear?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I heard him say so himself, just now, in the store.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I expected it,” said Squire Haynes, with a sneer. “I understood his motives perfectly in urging the town to pay an enormous bounty to volunteers. He meant to line his own pockets at the public expense.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He says that he doesn\u0027t mean to accept the bounty,” continued John, in a tone which indicated a doubt whether Mr. Frost was in earnest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you hear him say that?” asked Squire Haynes abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I heard him say so to Mr. Morse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps he means it, and perhaps he doesn\u0027t. If he don\u0027t take it, it is because he is afraid of public opinion. What\u0027s he going to do about the farm, while he is gone?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is the strangest part of it,” said John. “I don\u0027t believe you could guess who is to be left in charge of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t choose to guess. If you know, speak out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n John bit his lip resentfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s that conceited jackanapes of his—Frank Frost.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean that he is going to leave that boy to carry on the farm?” demanded Squire Haynes, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, all I can say is that he\u0027s more of a fool than I took him to be.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, he thinks everything of Frank,” said John bitterly. “He\u0027ll be nominating him for representative next.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The squire winced a little. He had been ambitious to represent the town in the legislature, and after considerable wire-pulling had succeeded in obtaining the nomination the year previous. But it is one thing to be nominated and another to be elected. So the squire had found, to his cost. He had barely obtained fifty votes, while his opponent had been elected by a vote of a hundred and fifty. All allusions, therefore, recalling his mortifying defeat were disagreeable to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “On the whole, I don\u0027t know but I\u0027m satisfied,” he said, recurring to the intelligence John had brought. “So far as I am concerned, I am glad he has made choice of this boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don\u0027t think he is competent?” asked John, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “For that very reason I am glad he has been selected,” said the squire emphatically. “I take it for granted that the farm will be mismanaged, and become a bill of expense, instead of a source of revenue. It\u0027s pretty certain that Frost won\u0027t be able to pay the mortgage when it comes due. I can bid off the farm for a small sum additional and make a capital bargain. It will make a very good place for you to settle down upon, John.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Me!” said John disdainfully. “You don\u0027t expect me to become a plodding farmer, I trust. I\u0027ve got talent for something better than that, I should hope.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said the squire, “I have other news for you. Still, you could hire a farmer to carry it on for you, and live out there in the summer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, perhaps that would do,” said John, thinking that it would sound well for him, even if he lived in the city, to have a place in the country. “When does the mortgage come due, father?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t remember the exact date. I\u0027ll look and see.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The squire drew from a closet a box hooped with iron, and evidently made for security. This was his strong-box, and in this he kept his bonds, mortgages, and other securities.\n\u003c/div\u003e \n\u003cdiv\u003e\n He selected a document tied with red ribbon, and examined it briefly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall have the right to foreclose the mortgage on the first of next July,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you will do it then. I should like to see them Frosts humbled.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “THEM Frosts! Don\u0027t you know anything more about English grammar, John?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Those Frosts, then. Of course, I know; but a feller can\u0027t always be watching his words.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I desire you never again to use the low word \u0027feller,\u0027” said the squire, who, as the reader will see, was more particular about grammatical accuracy than about some other things which might be naturally supposed to be of higher importance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said John sulkily, “anything you choose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As to the mortgage,” proceeded Squire Haynes, “I have no idea they will be able to lift it. I feel certain that Frost won\u0027t himself have the money at command, and I sha\u0027n\u0027t give him any grace, or consent to a renewal. He may be pretty sure of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps he\u0027ll find somebody to lend him the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think not. There are those who would be willing, but I question whether there is any such who could raise the money at a moment\u0027s warning. By the way, you need not mention my purpose in this matter to any one. If it should leak out, Mr. Frost might hear of it, and prepare for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may trust me for that, father,” said John, very decidedly; “I want to see Frank Frost\u0027s proud spirit humbled. Perhaps he\u0027ll feel like putting on airs after that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n From the conversation which has just been chronicled it will be perceived that John was a worthy son of his father; and, though wanting in affection and cordial good feeling, that both were prepared to join hands in devising mischief to poor Frank and his family. Let us hope that the intentions of the wicked may be frustrated.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2969/81747.html","bookId":375,"creation":"Aug 2, 2019 11:44:33 AM","modification":"Aug 2, 2019 11:44:33 AM"}
