{"id":79168,"no":11,"title":"Page 11","content":"\u003cp\u003e\"Gail got almost nothing out of the divorce, they say,\" Edith continued, oblivious to the unsubtle hint. \"Word is her husband stashed all his assets on one of those little islands in the Caribbean, declared bankruptcy, and left the state. Never sees his daughter, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Poor little Anne,\" Octavia said.\u003c/p\u003e\n\u003cp\u003e\"Ready to go?\" Nick said pointedly to Octavia.\u003c/p\u003e\n\u003cp\u003eShe glanced over her shoulder and saw that her potential clients were still contemplating a purchase. \"In a few minutes.\"\u003c/p\u003e\n\u003cp\u003e\"Gail lost her job in Seattle a couple of months ago and now she\u0027s back here in Eclipse Bay. She\u0027s living with her folks while she looks for work. Money is tight.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s job hunting?\" Octavia looked down the street. Gail\u0027s Chevy had disappeared around a corner. \"Is that why she was in your shop?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Unfortunately, I had to tell her that I just don\u0027t do enough business to warrant hiring an assistant. I gather she\u0027s tried several other places with no luck.\"\u003c/p\u003e\n\u003cp\u003e\"Hmm,\" Octavia said.\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eThe middle-aged couple left a short time later with their newly acquired seascape wrapped in brown paper.\u003c/p\u003e\n\u003cp\u003eOctavia set the security alarm, locked the door of the gallery, and dropped her keys into the spacious bag that hung from her right shoulder.\u003c/p\u003e\n\u003cp\u003eNick gave her an enigmatic smile and put on his sunglasses.\u003c/p\u003e\n\u003cp\u003eShe would have given a lot to be able to read his mind at that moment, she thought. Then again, maybe it was better not to know what he was thinking. The knowledge would only have made her more tense. She was still wondering if this burst of recklessness was going to prove to be a disaster.\u003c/p\u003e\n\u003cp\u003eThey walked together toward the parking lot. When they reached the BMW, he opened the door on the passenger side and held it for her. She searched his face quickly, looking for any concealed signs of triumph. She saw none. If anything, she thought, he seemed as wary as she felt.\u003c/p\u003e\n\u003cp\u003eNow that was an interesting development.\u003c/p\u003e\n\u003cp\u003eShe collected the folds of her skirt in one hand and slipped into the front seat. \"What did you do with Carson?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s spending the evening with Rafe and Hannah out at Dreamscape,\" Nick said.\u003c/p\u003e\n\u003cp\u003e\"Oh.\" She realized she had become accustomed to seeing Nick and Carson together during the past two weeks. \"Will he be joining us for dinner later?\" He smiled. \"This is my date, not Carson\u0027s.\" He closed the car door very deliberately. She watched him walk around the front of the vehicle. He moved with an easy, fluid grace that was at once relaxed and purposeful. Probably the way most top-of-the-food-chain predators moved when they were going out to grab a gazelle for dinner, she thought. Fascinating, exciting. More than a little dangerous.\u003c/p\u003e\n\u003cp\u003eThe sense of deep, sensual appreciation that swept through her caught her by surprise. She was still slightly awed by her decision to go out with him. Until tonight, the only big risks she had ever taken in life had involved the buying and selling of art. She trusted her intuition when it came to taking chances on unknown painters. But she had always been cautious when it came to men.\u003c/p\u003e\n\u003cp\u003eNick got behind the wheel and closed the door. The interior of the BMW suddenly felt overwhelmingly intimate. She realized she was holding her breath.\u003c/p\u003e\n\u003cp\u003e\"Couple of things you should know,\" she said carefully when he made to slip the key into the ignition. \"The first is that, in case your grandfather hasn\u0027t told you, Claudia Banner was my great-aunt.\" Dead silence.\u003c/p\u003e\n\u003cp\u003eNick did not fire up the engine. Instead, he twisted slightly in the seat and rested his right arm on the back. He watched her very steadily through his dark glasses.\u003c/p\u003e\n\u003cp\u003e\"Want to run that past me again?\" he said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m related to Claudia Banner. The woman who—\"\u003c/p\u003e\n\u003cp\u003e\"Trust me, I know who Claudia Banner is.\"\u003c/p\u003e\n\u003cp\u003e\"Was. My aunt died a year and a half ago.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\" Nick waited a beat. \"This is for real? Not a joke of some kind?\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s not a joke.\" She gripped her bag very tightly in her lap. \"Does it change things? Do you want to call off the date?\"\u003c/p\u003e\n\u003cp\u003e\"My grandfather knows who you are?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Sullivan and Mitchell both know. They figured it out the night of Lillian\u0027s show.\" She cleared her throat. \"Obviously they haven\u0027t told anyone else in either family yet.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Obviously.\" He tapped the key absently against the leather seat back. \"Well, hell.\"\u003c/p\u003e\n\u003cp\u003e\"Is this a problem for you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m thinking,\" he said. \"Give me a minute.\"\u003c/p\u003e\n\u003cp\u003e\"Look, if you\u0027re that rattled, I can find my own way out to Thurgarton\u0027s place.\"\u003c/p\u003e\n\u003cp\u003e\"It isn\u0027t a problem and I\u0027m not rattled.\" He took off his dark glasses and examined her with cool, faintly narrowed eyes. \"I just find this news a little unexpected, that\u0027s all. It raises a few questions.\"\u003c/p\u003e\n\u003cp\u003e\"I know. I answered some of them for Mitchell and I can do the same for you.\" She glanced pointedly at her watch. \"But not now. We need to get going. I promised Virgil I\u0027d meet him and the others at six.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\" He turned back and twisted the key in the ignition. The powerful engine growled softly. \"I\u0027m still waiting for the other shoe to drop.\"\u003c/p\u003e\n\u003cp\u003e\"The other shoe?\"\u003c/p\u003e\n\u003cp\u003e\"You said there were a couple of things I needed to know.\" He checked his mirrors and reversed out of the parking space.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be leaving town at the end of the summer.\"\u003c/p\u003e\n\u003cp\u003eHe shot her a quick glance and she knew that the news had taken him by surprise.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re leaving Eclipse Bay?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I\u0027m going to sell the gallery.\"\u003c/p\u003e\n\u003cp\u003eHe seemed to relax slightly. He gave an understanding inclination of his head. \"Not surprised the gallery here isn\u0027t working. Makes sense to concentrate on the Portland branch.\"\u003c/p\u003e\n\u003cp\u003eShe watched the road through the windshield. \"Both galleries are successful, as a matter of fact. But I\u0027m going to sell both branches.\"\u003c/p\u003e\n\u003cp\u003e\"Getting out of the art business altogether?\"\u003c/p\u003e\n\u003cp\u003e\"Not that easy.\" She smiled slightly. \"It isn\u0027t just a business. More of a calling, I\u0027m afraid. I can\u0027t imagine not being involved in art. A couple of months ago I was offered a position in a large gallery in San Diego. I don\u0027t have to give them my official decision until next month, but I\u0027m leaning strongly toward accepting the offer.\"\u003c/p\u003e\n\u003cp\u003e\"San Diego, huh?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a certainty. There\u0027s also a possibility that I\u0027m looking at in Denver.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\"\u003c/p\u003e\n\u003cp\u003eHe drove in silence for a few minutes, piloting the BMW carefully through the small business district, past the pier, the town\u0027s single gas station, and the Incandescent Body bakery. \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-11.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
