{"id":79178,"no":21,"title":"Page 21","content":"\u003cp\u003e\"You mean like put all the animal pictures together?\"\u003c/p\u003e\n\u003cp\u003e\"Exactly.\" She made some more notations on the piece of paper. \"In addition to your picture of Winston, I received a lot of pictures of horses and one or two cow portraits.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t get any other dogs besides Winston, did you?\" he asked quickly.\u003c/p\u003e\n\u003cp\u003e\"Not yet.\"\u003c/p\u003e\n\u003cp\u003e\"Good. That means mine will be the best.\"\u003c/p\u003e\n\u003cp\u003e\"I sense a certain streak of competitiveness here.\"\u003c/p\u003e\n\u003cp\u003e\"Huh?\"\u003c/p\u003e\n\u003cp\u003e\"Everyone knows that Hartes are very goal-oriented. They like to win.\"\u003c/p\u003e\n\u003cp\u003e\"Great-Granddad says winning is a lot better than losing.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not surprised to hear that. I suspect it\u0027s a family motto. And there\u0027s certainly some truth to it. But that viewpoint overlooks the fact that not all situations have to be viewed in terms of win-lose.\"\u003c/p\u003e\n\u003cp\u003e\"Huh?\"\u003c/p\u003e\n\u003cp\u003eShe smiled. \"Never mind. I was just thinking out loud.\u003c/p\u003e\n\u003cp\u003eThe point is, the Children\u0027s Art Show is not a competition. There won\u0027t be any prize for the best picture.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" He shrugged and let it go. \"Mind if I ask you a question?\"\u003c/p\u003e\n\u003cp\u003e\"What is it?\"\u003c/p\u003e\n\u003cp\u003eCarson looked up from the floor plan. \"Do you like my dad, Miss Brightwell?\"\u003c/p\u003e\n\u003cp\u003eShe was amazed when she did not miss a beat in her response. \"Yes, I do.\"\u003c/p\u003e\n\u003cp\u003e\"A lot?\"\u003c/p\u003e\n\u003cp\u003e\"I like him enough to go out with him,\" she said cautiously.\u003c/p\u003e\n\u003cp\u003e\"He likes you, too. A lot. That\u0027s why he called you so many times. He didn\u0027t mean to make you mad or anything.\"\u003c/p\u003e\n\u003cp\u003e\"Carson, I really don\u0027t think—\"\u003c/p\u003e\n\u003cp\u003e\"He never, ever asked a lady to go out so many times after she turned him down once or twice.\"\u003c/p\u003e\n\u003cp\u003eShe wrinkled her nose, amused in spite of herself. \"I suspect that I may have unwittingly aroused those Harte competitive instincts we were just talking about.\" Aroused might not have been quite the right word under the circumstances, she thought. \"Make that triggered.\"\u003c/p\u003e\n\u003cp\u003e\"Huh?\"\u003c/p\u003e\n\u003cp\u003e\"That attitude about winning that we discussed a moment ago. It\u0027s possible that your father decided that persuading me to go out with him was a sort of game. He wanted to win, so he kept calling me until I said yes.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" Carson gave that some thought and then shook his head. \"Nah. I don\u0027t think that\u0027s how it is with him. Dad says he doesn\u0027t like people who play games.\"\u003c/p\u003e\n\u003cp\u003e\"Neither do I.\" Resolutely she turned back to the floor plan. \"I think that the house pictures would look good on the two panels in the center of the room. What do you think?\"\u003c/p\u003e\n\u003cp\u003eThe door of the gallery opened. She looked up quickly, expecting to see Nick returning from the mail run. But it was Jeremy Seaton who strolled into the showroom.\u003c/p\u003e\n\u003cp\u003eHe was good-looking in an angular way. His light-brown hair was cut in a close, conservative style as befitted a member of the institute staff. His clothes were left over from his days in academia: khaki trousers, an open-throated, button-down shirt, and expensive-looking loafers.\u003c/p\u003e\n\u003cp\u003e\"Good morning, Jeremy. Something tells me you\u0027ve heard about the Upsall.\"\u003c/p\u003e\n\u003cp\u003e\"Yep. Couldn\u0027t resist coming by to see it for myself.\" He gave her a quick, easy smile and then looked at Carson. \"I know you. You\u0027re Nick Harte\u0027s son, right? You\u0027re looking more like your dad every day. I\u0027ll bet you don\u0027t remember me. We haven\u0027t seen much of each other in the last couple of years. I\u0027m Jeremy Seaton.\"\u003c/p\u003e\n\u003cp\u003eCarson shook his head. \"I don\u0027t remember.\"\u003c/p\u003e\n\u003cp\u003e\"Figured you wouldn\u0027t. Well, it doesn\u0027t matter. Your dad and I used to hang out together a lot in the old days.\"\u003c/p\u003e\n\u003cp\u003eCarson looked intrigued. \"You knew Dad when he was a kid?\"\u003c/p\u003e\n\u003cp\u003e\"Sure did. We played some baseball together. And when we got a little older we also played a little pool down at the Total Eclipse.\"\u003c/p\u003e\n\u003cp\u003e\"What else did you do?\" Carson asked eagerly.\u003c/p\u003e\n\u003cp\u003eJeremy stroked his jaw, looking thoughtful. \"As I recall, we spent an inordinate amount of time cruising up and down Bayview Drive on Friday and Saturday nights showing off our cars and trying to get girls to look at us. Wasn\u0027t a whole lot to do here in Eclipse Bay in those days.\"\u003c/p\u003e\n\u003cp\u003e\"Still isn\u0027t, as far as I can tell,\" Nick said from the doorway. \"Hello, Jeremy. Been a while.\"\u003c/p\u003e\n\u003cp\u003eOctavia could have sworn that the temperature in the gallery plummeted at least twenty or thirty degrees. There was a definite chill in the air.\u003c/p\u003e\n\u003cp\u003eJeremy lowered his hand and turned around with a deliberate air and a politely bland expression. \"Harte.\" His tone remained civil, but all the warmth had leached out of it. \"Heard you were in town for the summer.\"\u003c/p\u003e\n\u003cp\u003e\"Heard you\u0027ve taken up full-time residence and got yourself a job at the institute,\" Nick said in a voice that was equally lacking in inflection. \"Giving up the academic life for good?\"\u003c/p\u003e\n\u003cp\u003eThe gallery was flooded with toxic levels of testosterone. Nick and Jeremy might have been good friends in the past, Octavia thought, but something had gone very wrong somewhere along the line.\u003c/p\u003e\n\u003cp\u003e\"Thought I\u0027d try something a little different,\" Jeremy said. \"Everyone needs a change once in a while. How\u0027s the writing going?\"\u003c/p\u003e\n\u003cp\u003e\"Swell.\"\u003c/p\u003e\n\u003cp\u003e\"Rumor at the post office this morning is that you\u0027re planning to use Octavia here to help with some in-depth research for your next book,\" Jeremy said coolly.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve lived in Eclipse Bay long enough to know better than to listen to post office gossip.\"\u003c/p\u003e\n\u003cp\u003e\"I sure wouldn\u0027t want to think that there was any truth to the rumors I heard today.\"\u003c/p\u003e\n\u003cp\u003e\"When you get right down to it, it doesn\u0027t much matter if there\u0027s any truth to them or not,\" Nick said. \"Either way, it\u0027s none of your business.\"\u003c/p\u003e\n\u003cp\u003eConfusion and something that might have been the beginnings of unease appeared in Carson\u0027s small face. She knew exactly how he felt, Octavia thought. This uncomfortable little scene had gone far enough.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got the Upsall in my back room, Jeremy,\" she said briskly. \"Come around behind the counter and I\u0027ll show it to you. You know something about art. I\u0027d be interested to get your opinion.\"\u003c/p\u003e\n\u003cp\u003eNeither of the two men looked at her. They watched each other with the air of two lions facing off over a downed zebra.\u003c/p\u003e\n\u003cp\u003eI definitely do not look good in stripes, Octavia thought.\u003c/p\u003e\n\u003cp\u003eShe cleared her throat. \"Gentlemen, if you wish to continue this conversation, you may do so outside. I would like to remind you that there is a minor present. I would suggest you find someplace private where you can make idiots of yourselves without an audience.\"\u003c/p\u003e\n\u003cp\u003eThat got their attention. Both men turned toward her. The chill in their eyes would have thawed a frozen pizza in two seconds flat. \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-21.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
