{"id":79180,"no":23,"title":"Page 23","content":"\u003cp\u003eFor a timeless moment it was as if she\u0027d been frozen by some powerful force, unable to move, barely able to breathe. But an acute awareness arced through her, raising the small hairs on the back of her arms. She ought to be getting used to the sensation, she thought. Nick Harte had this effect on her a lot.\u003c/p\u003e\n\u003cp\u003eWith an effort, she forced herself to move through the oddly charged atmosphere and started up the cliff path. She climbed carefully, conscious of how the wind was whipping her long, white skirt around her legs.\u003c/p\u003e\n\u003cp\u003e\"Looks like the weather people missed the call on this storm,\" Nick said when she reached the top. He glanced toward the looming chaos that threatened on the horizon. \"Going to be a lot stronger than they predicted.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She held her hair out of her face. \"What are you doing here, Nick?\"\u003c/p\u003e\n\u003cp\u003e\"I brought dinner.\" His tone was casual to the point of careless, but his eyes were anything but casual. A dangerous energy crackled there in the blue depths. \"Unless you\u0027ve got other plans?\"\u003c/p\u003e\n\u003cp\u003eShe\u0027d had some plans, she thought. But none of them sounded nearly as interesting as dinner with Nick. Or as reckless.\u003c/p\u003e\n\u003cp\u003e\"You cooked dinner?\" she asked, buying herself a little time to analyze the situation before she did something really, really risky like invite him into her cottage.\u003c/p\u003e\n\u003cp\u003eHis mouth curved in a rakish grin that showed some teeth.\u003c/p\u003e\n\u003cp\u003e\"Now, why would I sweat over a hot stove all afternoon when I\u0027ve acquired a brother-in-law who owns and operates a restaurant?\"\u003c/p\u003e\n\u003cp\u003eShe found herself smiling in spite of the invisible lightning in the air. \"Good question.\"\u003c/p\u003e\n\u003cp\u003e\"I brought a picnic basket that is stuffed to the hilt with some of Rafe\u0027s finest delicacies. Interested?\"\u003c/p\u003e\n\u003cp\u003eLive it up. Take some chances. Life is too damn short…\u003c/p\u003e\n\u003cp\u003eShe breathed deep, inhaling the intoxicating vapors of the oncoming storm. \"Are you kidding? If Rafe did the cooking, I\u0027m more than interested. I\u0027m enthralled.\"\u003c/p\u003e\n\u003cp\u003e\"You know, I always knew that guy would turn out to be useful someday, even if he is a Madison.\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Carson?\"\u003c/p\u003e\n\u003cp\u003e\"At Dreamscape.\"\u003c/p\u003e\n\u003cp\u003e\"Handy built-in baby-sitting setup you\u0027ve got there.\"\u003c/p\u003e\n\u003cp\u003e\"I figure I\u0027m doing Rafe and Hannah a favor by giving them a little hands-on practice.\"\u003c/p\u003e\n\u003cp\u003eShe tilted her head a little. \"Do they need practice?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. They\u0027re expecting. But don\u0027t say anything, okay? They\u0027re still in the process of notifying everyone in the family.\"\u003c/p\u003e\n\u003cp\u003e\"A baby.\" A sweet, vicarious joy rushed through her. \"That\u0027s wonderful. How exciting. When?\"\u003c/p\u003e\n\u003cp\u003e\"Uh, you\u0027ll have to ask Hannah. I forgot to check the date.\"\u003c/p\u003e\n\u003cp\u003e\"How could you forget to ask when the baby is due?\"\u003c/p\u003e\n\u003cp\u003e\"I forgot, okay? So sue me.\"\u003c/p\u003e\n\u003cp\u003e\"Men.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, I brought dinner. I think that\u0027s pushing the envelope of the SG thing far enough, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"SG thing?\"\u003c/p\u003e\n\u003cp\u003e\"Sensitive Guy.\"\u003c/p\u003e\n\u003cp\u003eShe arranged the contents of the picnic basket on the glass-topped dining room table while Nick built a fire. Rafe had outdone himself, she thought. There was an array of appetizing dishes including a beautiful vegetable pate, curried potato salad studded with fresh green peas, cold asparagus spears dressed in hollandaise sauce, little savory pastries filled with shrimp, and cold soba noodles steeped in a ginger-flavored marinade. There were also homemade pickles, Greek olives, and crusty bread from the Incandescent Body. A bottle of pinot noir bearing the label of an exclusive Oregon vintner rounded out the menu. Dessert consisted of tiny raspberry tarts.\u003c/p\u003e\n\u003cp\u003e\"Oh, my,\" she murmured appreciatively. \"This is lovely. Absolutely spectacular. And to think that I was going to fix a plain green salad for dinner. Rafe is amazing.\"\u003c/p\u003e\n\u003cp\u003e\"Enough about Rafe,\" Nick said. He struck a match and held it to the kindling. \"Let\u0027s talk about me.\"\u003c/p\u003e\n\u003cp\u003e\"What about you?\"\u003c/p\u003e\n\u003cp\u003e\"I want full credit for selecting the wine.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I suppose I can give you that.\" She glanced at the label. \"It\u0027s a very nice wine.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks.\" He uncoiled to his feet, crossed the room, and took the bottle from her. \"I\u0027ll have you know that I went through almost every bottle of red in Rafe\u0027s cellar looking for it.\"\u003c/p\u003e\n\u003cp\u003e\"A dirty job, but someone had to do it, right?\"\u003c/p\u003e\n\u003cp\u003e\"Damn right.\"\u003c/p\u003e\n\u003cp\u003eHe carried the pinot noir into the kitchen, found the corkscrew, and went to work with a few deft, economical movements.\u003c/p\u003e\n\u003cp\u003eA moment later he poured wine into two glasses. He handed one of the glasses to her and raised his own in a small salute.\u003c/p\u003e\n\u003cp\u003e\"To Hannah and Rafe and the baby,\" he said.\u003c/p\u003e\n\u003cp\u003eShe smiled and touched her glass to his. \"And to the end of the Harte-Madison feud. May you all live long and happy lives.\"\u003c/p\u003e\n\u003cp\u003eHe paused, the glass partway to his mouth, and slowly lowered it. \"You sound like you\u0027re saying goodbye.\"\u003c/p\u003e\n\u003cp\u003e\"I am, in a way.\" She took a sip of the wine. \"I\u0027ve been in a strange place for the past few months—\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, Eclipse Bay is a little weird, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"—but I think I\u0027ve treaded water long enough.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re entitled to tread water for a while after you lose someone you love, you know.\"\u003c/p\u003e\n\u003cp\u003e\"I know. But Aunt Claudia would have been the first to tell me to get on with my life.\" She did not want to pursue that topic, she thought. She turned away and opened a cupboard to select some of the green glass dishes she stored inside. \"Mind if I ask what that scene at the gallery was about today?\"\u003c/p\u003e\n\u003cp\u003e\"Any chance I can get away with asking, \u0027What scene?\u0027\"\u003c/p\u003e\n\u003cp\u003e\"No.\" She looked at him over her shoulder as she took the plates out of the cupboard. \"But I suppose you could tell me to mind my own business.\"\u003c/p\u003e\n\u003cp\u003eHe leaned back against the tiled counter and contemplated the bloodred wine in his glass for a moment. She knew that whatever he was going to tell her, it was not going to be the whole truth and nothing but.\u003c/p\u003e\n\u003cp\u003e\"Jeremy and I go back a ways. We alternated between being buddies and friendly rivals in the old days here in Eclipse Bay. Competed a little with our cars and—\"\u003c/p\u003e\n\u003cp\u003e\"Getting dates with fast women?\" she finished lightly.\u003c/p\u003e\n\u003cp\u003e\"Fast women, sad to say, were always pretty scarce around Eclipse Bay.\"\u003c/p\u003e\n\u003cp\u003e\"Too bad. Go on, what happened with you and Jeremy?\"\u003c/p\u003e\n\u003cp\u003e\"We had some adventures. Got into some trouble. Raised a little hell. We stayed in touch in college and we both wound up working in Portland. He took a position as an instructor at a college there and I dutifully tried to fulfill my filial obligations at Harte Investments. And then—\" \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-23.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
