{"id":79190,"no":33,"title":"Page 33","content":"\u003cp\u003e\"I already warned him once that I won\u0027t stand by and let him fool around with you.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s just it, we are not fooling around.\"\u003c/p\u003e\n\u003cp\u003e\"Well, just what the heck do you call it?\" Mitchell demanded.\u003c/p\u003e\n\u003cp\u003eNick waited with genuine interest to hear her answer.\u003c/p\u003e\n\u003cp\u003eOctavia drew herself up with astonishing aplomb. \"Nick is working for me.\"\u003c/p\u003e\n\u003cp\u003eMitchell gaped. \"What the devil?\"\u003c/p\u003e\n\u003cp\u003eShe bestowed an icy little smile on Nick and then looked at Mitchell with cool determination. \"He has kindly agreed to investigate the missing Upsall. A.Z. and Virgil and I don\u0027t feel that Chief Valentine can handle the case on his own.\"\u003c/p\u003e\n\u003cp\u003e\"Well, shoot and damn.\" Mitchell looked bemused for a couple of seconds, but in true Madison style, he recovered swiftly. \"That doesn\u0027t explain why he was out at your place until all hours last night.\"\u003c/p\u003e\n\u003cp\u003e\"Relax,\" Octavia said smoothly. \"Last night was no big deal.\"\u003c/p\u003e\n\u003cp\u003eNick felt his insides clench. No big deal?\u003c/p\u003e\n\u003cp\u003e\"It\u0027s true we had dinner together, but so what?\" Octavia went on in a breezy manner. \"The only reason he left as late as he did was because of the storm. My fault, entirely. I didn\u0027t want him driving home until the wind had died down a little. I was afraid about stuff like downed power lines and trees falling across the road.\"\u003c/p\u003e\n\u003cp\u003eShe did not have to sound quite so damned casual, Nick thought.\u003c/p\u003e\n\u003cp\u003eBut her tactics were working. Mitchell was starting to appear somewhat mollified.\u003c/p\u003e\n\u003cp\u003e\"Well, shoot and damn,\" Mitchell said again. \"So you kept him there at your place on accounta the high winds?\"\u003c/p\u003e\n\u003cp\u003e\"Violent storms make me a little nervous.\"\u003c/p\u003e\n\u003cp\u003e\"That one last night was a tad rough,\" Mitchell admitted. \"Worst we\u0027ve had in a while. You say he\u0027s gonna play private eye for you? Just like the guy in his books?\"\u003c/p\u003e\n\u003cp\u003e\"Precisely,\" Octavia said firmly. \"From now on whenever you see Nick with me, you may assume that we are discussing the case. Nothing more.\"\u003c/p\u003e\n\u003cp\u003e\"Huh.\" Mitchell looked thoughtful now. \"If you\u0027re sure that\u0027s all there is to it—\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely certain,\" Octavia said. \"Like I said, last night was no big deal. Just a friendly dinner that lasted a little longer than we anticipated because of the storm.\"\u003c/p\u003e\n\u003cp\u003e\"Huh.\" Mitchell looked hard at Nick. \"You think you can find that painting?\"\u003c/p\u003e\n\u003cp\u003e\"Probably not.\" Nick shrugged. \"But Virgil and A.Z. and Octavia want me to ask around a little so I said I would. If you hear anything useful, let me know.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll do that.\"\u003c/p\u003e\n\u003cp\u003eMitchell nodded to both of them and stalked back toward the waiting SUV.\u003c/p\u003e\n\u003cp\u003eThey watched him climb into the front seat and slam the door. Bryce put the behemoth in gear and drove out of the parking lot.\u003c/p\u003e\n\u003cp\u003eThere was a short silence. Nick folded his arms, leaned back against the BMW, and looked at Octavia.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s get something straight here,\" he said. \"I don\u0027t need you to protect me from Mitchell Madison.\"\u003c/p\u003e\n\u003cp\u003eOctavia reached into her shoulder bag, removed a pair of sunglasses, and slipped them onto her nose. Leveling the playing field, Nick thought. Now he could not read the expression in her eyes any better than she could read his.\u003c/p\u003e\n\u003cp\u003e\"I think I\u0027m the one who should make things clear,\" she said crisply. \"I have a vested interest in making certain that you are not distracted by Mitchell and his misguided attempts to protect me. I want you to concentrate on finding that Upsall. Do we understand each other?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, sure. We understand each other.\" He paused a beat. \"Last night was no big deal, huh?\"\u003c/p\u003e\n\u003cp\u003eShe pursed her lips and tilted her head slightly. Light glared on the lenses of her glasses. \"I may not have phrased that correctly.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad to hear that.\"\u003c/p\u003e\n\u003cp\u003e\"After due consideration, I\u0027ve decided that last night was actually quite therapeutic for me.\"\u003c/p\u003e\n\u003cp\u003eHer deliberate, reflective, analytical tone sent a cold chill through him.\u003c/p\u003e\n\u003cp\u003e\"Therapeutic?\" he repeated cautiously.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t laugh, but this morning, when I woke up, I felt like the princess in the fairy tale, the one who\u0027d been asleep for a hundred years. Awake at last. Okay, so maybe it was more like having been asleep for a couple of years, but you get the picture.\"\u003c/p\u003e\n\u003cp\u003eHe relaxed a little but not much. \"I\u0027m a little confused here. Are you saying I\u0027m Prince Charming?\"\u003c/p\u003e\n\u003cp\u003eShe chuckled. \"Hardly.\"\u003c/p\u003e\n\u003cp\u003eHis belly tightened. \"I was afraid of that.\"\u003c/p\u003e\n\u003cp\u003e\"What I\u0027m trying to explain is that, in a way, I\u0027ve been living in a different world for nearly two years. I put a lot of things on hold while Aunt Claudia was ill, and I never went back to them after she died. I\u0027ve been just sort of floating through my life, as it were.\"\u003c/p\u003e\n\u003cp\u003e\"A free spirit.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s how I described it, but it was more like being unanchored or untethered, if you see what I mean.\"\u003c/p\u003e\n\u003cp\u003eThat fit with what he had figured out for himself, he thought. \"Sounds like a form of depression or something.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe.\" She snapped her fingers. \"But whatever the problem was, it\u0027s fixed.\"\u003c/p\u003e\n\u003cp\u003e\"Because we had great sex last night?\"\u003c/p\u003e\n\u003cp\u003e\"The quality of the sex probably wasn\u0027t as much of a factor as the fact that I actually did the deed.\" She smiled coolly. \"It has been a while, you see. My social life was one of the things I put on hold when Aunt Claudia got so ill. I never really got back to it.\"\u003c/p\u003e\n\u003cp\u003e\"Glad I could serve in a useful capacity.\"\u003c/p\u003e\n\u003cp\u003e\"You were extremely useful.\" She pushed her glasses up more firmly on her nose and cleared her throat. \"Since we\u0027re having this conversation, I should probably take the opportunity to apologize for that unfortunate little scene last night as you were running out the door. Let\u0027s just chalk it up to two years\u0027 worth of celibacy, the storm, and the last remnants of my weird emotional condition.\"\u003c/p\u003e\n\u003cp\u003e\"A nice tidy list of reasons.\" He shoved his fingers through his hair. \"And for the record, I was not running out the door. It was late and I had to pick up Carson and get back to the cottage.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\" She glanced at her watch. \"I\u0027m glad we\u0027ve got that settled. You\u0027ll have to excuse me. I need to get back to the gallery.\"\u003c/p\u003e\n\u003cp\u003e\"Now who\u0027s running?\"\u003c/p\u003e\n\u003cp\u003eHer mouth tightened. \"I\u0027ve got a business to see to and you\u0027ve got a missing painting to investigate.\"\u003c/p\u003e\n\u003cp\u003e\"Sure.\" He wished he could see her eyes behind those damn sunglasses. \"Would you like to come out to my place and have dinner with Carson and me tonight?\"\u003c/p\u003e\n\u003cp\u003eShe hesitated. \"Thanks, but I\u0027m afraid I\u0027m busy this evening.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-33.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
