{"id":79191,"no":34,"title":"Page 34","content":"\u003cp\u003eThe chill returned to his gut. \"Seaton?\"\u003c/p\u003e\n\u003cp\u003e\"Why, yes, as a matter of fact. How did you know?\"\u003c/p\u003e\n\u003cp\u003e\"Lucky guess,\" he said grimly.\u003c/p\u003e\n\u003cp\u003e\"He wants me to look at some of his paintings.\" She turned away to start back toward the gallery. \"He has never exhibited his work and he wants me to give him a professional opinion on whether it might have commercial possibilities.\"\u003c/p\u003e\n\u003cp\u003e\"Bullshit. He wants to talk you into bed.\"\u003c/p\u003e\n\u003cp\u003eShe stopped and looked back over her shoulder. \"Would you like to tell me what it is between you two?\"\u003c/p\u003e\n\u003cp\u003e\"What the hell. I never told anyone else.\" He wrenched open the driver\u0027s side door of the BMW and got behind the wheel. \"Might be therapeutic for me.\"\u003c/p\u003e\n\u003cp\u003e\"Nick, wait窶能"\u003c/p\u003e\n\u003cp\u003eHe slammed the door and looked at her through the lowered window while he started the engine. \"Seaton hates my guts because he thinks that I had an affair with his ex-wife while they were still married.\"\u003c/p\u003e\n\u003cp\u003eHer mouth opened but no words emerged. Her speechless condition gave him some satisfaction, but not much.\u003c/p\u003e\n\u003cp\u003e\"One more thing,\" he added, snapping the car into gear. \"What happened last night between you and me wasn\u0027t therapy. It was great sex. There\u0027s a difference.\"\u003c/p\u003e\n\u003cp\u003eHe drove out of the marina parking lot, leaving her standing there in her bright purple jumper and ridiculously sexy shoes.\u003c/p\u003e\n\u003cp\u003eChapter 11\u003c/p\u003e\n\u003cp\u003e\"What the hell do you expect me to do?\" Sullivan snarled into the phone. \"I\u0027m trying to put together a merger here.\"\u003c/p\u003e\n\u003cp\u003e\"Hate to break this to you,\" Mitchell growled on the other end, \"but my grandson and your son don\u0027t need any help putting the finishing touches on the Madison-Harte merger. Both of \u0027em have been running their own companies for years. They know what they\u0027re doing. You\u0027re just gumming things up, hanging over their shoulders there in Portland. Leave \u0027em be and pay attention to the larger issues.\"\u003c/p\u003e\n\u003cp\u003e\"Larger issues? Never heard you use a fancy phrase like that before, Mitch.\"\u003c/p\u003e\n\u003cp\u003e\"Must have picked it up from one of you silver-tongued Hartes. Look, we\u0027ve got a problem here in Eclipse Bay.\"\u003c/p\u003e\n\u003cp\u003eSullivan cranked back in the chair and contemplated the view from the window of the temporary office his new son-in-law, Gabe Madison, had provided for him. The headquarters of Madison Commercial, soon to become\u003c/p\u003e\n\u003cp\u003eMadison-Harte, were located on the top floors of a Portland office tower. From his perch he could see the boat traffic on the Willamette River.\u003c/p\u003e\n\u003cp\u003eThe summer afternoon was sunny and warm. The weather reporters claimed that it was hot down there on the city streets, but he spent most of his time in Phoenix these days. He knew hot, and this was not hot.\u003c/p\u003e\n\u003cp\u003e\"Seems to me that you have a problem, Mitch,\" he said, stalling for time while he considered the larger issues. \"Not me. You\u0027re the one who decided to take on the job of looking out for Claudia Banner\u0027s great-niece.\"\u003c/p\u003e\n\u003cp\u003e\"This problem we\u0027re discussing involves your grandson,\" Mitch shot back. \"I told you I wouldn\u0027t stand by and let him窶能"\u003c/p\u003e\n\u003cp\u003e\"Shut up.\" Sullivan got up out of the chair very suddenly.\u003c/p\u003e\n\u003cp\u003ePhone in hand, he went to stand at the window. \"Don\u0027t say it again.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t say what?\" Mitchell asked innocently. \"That I won\u0027t let Nick sucker Octavia into an affair and then dump her when he decides he wants to replace her with some other lady?\"\u003c/p\u003e\n\u003cp\u003e\"This is my grandson you\u0027re talking about.\" Sullivan\u0027s hand clamped fiercely around the phone, but he managed to keep his voice level. \"He is not a philanderer, damn it.\"\u003c/p\u003e\n\u003cp\u003e\"That so? Then why hasn\u0027t he found himself a good woman sometime during the past four years and settled down again? That\u0027s what you Hartes do, isn\u0027t it? Get married and stay married?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Mitch. Unlike the sterling example of family values you set for your grandsons with your three or four wives and God only knows how many affairs, we Hartes are real big on family values.\"\u003c/p\u003e\n\u003cp\u003e\"You leave my grandsons out of this.\"\u003c/p\u003e\n\u003cp\u003e\"Hard to do that, given that they\u0027re married to my granddaughters.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s not a damn thing wrong with Gabe\u0027s or Rafe\u0027s family values and you know it. Lillian is Gabe\u0027s passion and Hannah is Rafe\u0027s. Nothing comes between a Madison and his passion. Those two boys are married for life.\"\u003c/p\u003e\n\u003cp\u003e\"So was Nick,\" Sullivan said quietly.\u003c/p\u003e\n\u003cp\u003eSilence hummed on the line.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the real problem, you see,\" Sullivan continued. \"Nick figured he had married for life. He hasn\u0027t adjusted to the loss of Amelia. He\u0027s not heartless, he\u0027s just trying to protect himself.\"\u003c/p\u003e\n\u003cp\u003e\"Look, I know folks here in Eclipse Bay like to say that losing her broke Nick\u0027s heart.\" There was a note of gruff sympathy in Mitchell\u0027s voice. \"Expect it\u0027s true, what with him being a Harte and all. But that ain\u0027t no excuse for him playin\u0027 fast and loose with a nice girl like Octavia. She\u0027s had a rough time of it, too, damn it. But unlike your grandson, I don\u0027t think she\u0027s tough enough to protect herself.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027ve decided to do it for her?\"\u003c/p\u003e\n\u003cp\u003e\"Someone\u0027s gotta do it. Not like she\u0027s got any family around to take on the job.\"\u003c/p\u003e\n\u003cp\u003eSullivan hesitated. \"All right, you\u0027ve made your point.\"\u003c/p\u003e\n\u003cp\u003e\"Got another one to make while I\u0027m at it,\" Mitchell said grimly. \"Your grandson spent last night at her place.\"\u003c/p\u003e\n\u003cp\u003eThat gave Sullivan pause. \"The whole night?\"\u003c/p\u003e\n\u003cp\u003e\"Well, maybe not the entire night窶能"\u003c/p\u003e\n\u003cp\u003eSullivan relaxed slightly. \"Didn\u0027t think so.\"\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s pretty damn obvious those two are foolin\u0027 around.\"\u003c/p\u003e\n\u003cp\u003e\"Obvious to you, maybe.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, obvious to me. You should have seen the way\u003c/p\u003e\n\u003cp\u003eOctavia jumped to Nick\u0027s defense this afternoon when I cornered him down at the marina.\"\u003c/p\u003e\n\u003cp\u003e\"What the hell do you think you\u0027re doing, cornering my grandson?\"\u003c/p\u003e\n\u003cp\u003e\"I was just makin\u0027 sure he understands he can\u0027t have his way with Octavia.\"\u003c/p\u003e\n\u003cp\u003e\"Damn it, Mitch窶能" Sullivan broke off abruptly and backtracked to the other part of Mitchell\u0027s comment. \"What did you mean when you said Octavia jumped to his defense?\"\u003c/p\u003e\n\u003cp\u003e\"She claimed he\u0027s sort of working for her.\"\u003c/p\u003e\n\u003cp\u003e\"Nick? Working for Octavia Brightwell? Doing what, for crying out loud?\"\u003c/p\u003e\n\u003cp\u003e\"Playing private detective, I hear. Like that fellow in his novels.\"\u003c/p\u003e\n\u003cp\u003eSullivan struggled valiantly to hang onto the few remaining wisps of logic that still dangled from the conversation. \"Why does Octavia need an investigator?\"\u003c/p\u003e\n\u003cp\u003e\"Long story. That painting Thurgarton left to A.Z. and Virgil and the Heralds got stolen from her shop last night.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-34.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
