{"id":79202,"no":45,"title":"Page 45","content":"\u003cp\u003e\"Why isn\u0027t it fair?\"\u003c/p\u003e\n\u003cp\u003e\"It just isn\u0027t, that\u0027s all. My picture was the only dog picture until now. That\u0027s why Miss Brightwell liked it so much.\"\u003c/p\u003e\n\u003cp\u003eSo that\u0027s what this is all about, Nick thought. He took a swallow of coffee while he considered how to handle the situation. He understood Carson\u0027s position better than his son realized. Every time he thought about Jeremy and his artistic talent and how much Jeremy had in common with Octavia, he was flooded with a wholly irrational jealousy, too.\u003c/p\u003e\n\u003cp\u003e\"Miss Brightwell made it clear that she likes both dog pictures,\" Nick said.\u003c/p\u003e\n\u003cp\u003e\"She likes Anne\u0027s better than mine,\" Carson muttered.\u003c/p\u003e\n\u003cp\u003e\"How do you know that?\"\u003c/p\u003e\n\u003cp\u003e\"Anne\u0027s is better,\" Carson said.\u003c/p\u003e\n\u003cp\u003eIt was a simple statement, uttered in the tone of voice of a guy who knows his hopes are doomed.\u003c/p\u003e\n\u003cp\u003e\"Mind if I ask why you care so much what Miss Brightwell thinks about your picture of Winston?\" Nick asked. \"Is this just a simple manifestation of the Harte competitive instinct, or is there something else going on here?\"\u003c/p\u003e\n\u003cp\u003eCarson frowned. \"Huh?\"\u003c/p\u003e\n\u003cp\u003eSometimes he had to remind himself that Carson wasn\u0027t quite six yet. He was smart, but words like manifestation and competitive instinct could still throw him.\u003c/p\u003e\n\u003cp\u003e\"Remember, the Children\u0027s Art Show isn\u0027t a competition. Miss Brightwell isn\u0027t going to choose a winning picture. All the drawings will be exhibited. There won\u0027t be any losers.\"\u003c/p\u003e\n\u003cp\u003e\"Doesn\u0027t mean Miss Brightwell doesn\u0027t like Anne\u0027s picture best,\" Carson grumbled.\u003c/p\u003e\n\u003cp\u003e\"Why do you care? I mean, let\u0027s face it, you\u0027ve never shown a lot of interest in art until you decided to draw a picture for Miss Brightwell\u0027s show.\"\u003c/p\u003e\n\u003cp\u003e\"I want Miss Brightwell to like my picture best.\"\u003c/p\u003e\n\u003cp\u003e\"How come?\"\u003c/p\u003e\n\u003cp\u003eCarson shrugged. \"She likes artists. If she thought I was a good artist, maybe she\u0027d like me better.\"\u003c/p\u003e\n\u003cp\u003e\"Better than what? Better than she likes Anne?\"\u003c/p\u003e\n\u003cp\u003eCarson kicked the post again. The blow was not so forceful this time. More of a gesture of frustration. \"I dunno.\"\u003c/p\u003e\n\u003cp\u003e\"She likes you a lot,\" Nick said. \"Trust me.\"\u003c/p\u003e\n\u003cp\u003eCarson took another halfhearted shot at the post with the toe of his running shoe. Definitely losing steam now. A little boy struggling to deal with complex emotions that he doesn\u0027t comprehend, Nick thought.\u003c/p\u003e\n\u003cp\u003eThey stood there in silence for a while, morosely watching the sunlight dance on the waters of the bay. Nick finished his coffee.\u003c/p\u003e\n\u003cp\u003eI want her to like me, too. I don\u0027t want her to think of me as therapy or business. I want her to want me, the way I want her.\u003c/p\u003e\n\u003cp\u003eHe heard a crumpling sound and looked down, vaguely surprised to discover that he had crushed the empty coffee cup in his hand. Irritated, he tossed the remains into the nearest trash bin.\u003c/p\u003e\n\u003cp\u003eAn adult male struggling to deal with complex emotions that he doesn\u0027t comprehend, he thought. Well, at least he wasn\u0027t going around kicking fence posts. A definite sign of maturity.\u003c/p\u003e\n\u003cp\u003e\"So,\" he said, \"what do you say we ask Miss Brightwell to have dinner at our house tonight?\"\u003c/p\u003e\n\u003cp\u003e\"Think she\u0027d come?\" Carson asked with sudden enthusiasm.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Nick said, determined to be honest. \"But we\u0027re a couple of Hartes. That means we go after what we want, even if we lose in the end.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" Carson said, \"she likes salads. Tell her we\u0027re gonna have a really big salad.\"\u003c/p\u003e\n\u003cp\u003e\"Good idea.\"\u003c/p\u003e\n\u003cp\u003e\"Salad, hmm?\" Octavia said a few minutes later when they presented her with their proposition.\u003c/p\u003e\n\u003cp\u003e\"With lots and lots of lettuce,\" Carson assured her. \"As much as you want.\"\u003c/p\u003e\n\u003cp\u003eNick leaned back against the counter and folded his arms. \"Maybe a couple of radishes, too,\" he promised.\u003c/p\u003e\n\u003cp\u003eShe gave him that mysterious smile that left him in limbo. \"I could hardly pass up an offer like that,\" she said. \"It\u0027s a date.\"\u003c/p\u003e\n\u003cp\u003eNick turned to Carson. \"Guess we\u0027d better hit Fulton\u0027s before they run out of the best lettuce.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" Carson whirled and rushed toward the door.\u003c/p\u003e\n\u003cp\u003eNick looked at Octavia. \"Thanks. He\u0027s dealing with his first-ever case of professional jealousy. Anne\u0027s picture of Zeb hit him hard.\"\u003c/p\u003e\n\u003cp\u003e\"I noticed.\"\u003c/p\u003e\n\u003cp\u003eOutside, Jeremy drove his Nissan into the little parking lot. Nick watched him climb out of the car and start toward the row of shops.\u003c/p\u003e\n\u003cp\u003e\"Carson realized right away that Anne\u0027s picture was much better than his,\" he said to Octavia.\u003c/p\u003e\n\u003cp\u003e\"The art show isn\u0027t a competition.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I reminded him of that.\" He crossed the showroom to the open door. \"But he\u0027s a Harte. He had an agenda when he entered his picture of Winston in your show. He wanted you to think his drawing was the best. Now he\u0027s worried that he\u0027s been outclassed by a better artist.\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"I understand.\"\u003c/p\u003e\n\u003cp\u003eOutside on the sidewalk, Jeremy had paused at the entrance to Seaton\u0027s Antiques. He glanced at Nick, his face impassive. Then he opened the door and disappeared into his grandmother\u0027s shop.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m really glad to hear that you understand,\" Nick said softly. \"Because I\u0027m having a similar problem.\"\u003c/p\u003e\n\u003cp\u003eShe leaned her elbows on the counter. \"You\u0027re worried that you\u0027ve been outclassed by a better artist?\"\u003c/p\u003e\n\u003cp\u003e\"Professional jealousy is tough to deal with at any age.\"\u003c/p\u003e\n\u003cp\u003eHe went outside to join Carson.\u003c/p\u003e\n\u003cp\u003eAt six that evening she stood on the top of the bluff with Carson and looked down at the five finger-shaped stones that thrust upward out of the swirling waters at the base of the short cliff.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s called Dead Hand Cove,\" Carson explained, cheerfully morbid. \"Dad named it when he was a kid. On account of the way the rocks stick up. Like a dead hand. See?\"\u003c/p\u003e\n\u003cp\u003e\"Got it.\" The day had been pleasantly warm but there was a mild breeze off the water. Octavia stared down into the cove. \"The stones really do look like fingers.\"\u003c/p\u003e\n\u003cp\u003e\"And there\u0027s some caves down there, too. Dad and I went into them yesterday. We found some marks on the walls. Dad said he put them there when he was a kid so that Aunt Lillian and Aunt Hannah wouldn\u0027t get lost when they went inside.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a Harte for you,\" she said. \"Always planning ahead.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, Dad says that\u0027s what Hartes do.\" Carson\u0027s mood darkened into a troubled frown. \"He says sometimes all the planning doesn\u0027t work, though. He says sometimes stuff happens that you don\u0027t expect and things change.\"\u003c/p\u003e\n\u003cp\u003e\"You mean stuff like Anne\u0027s picture of Zeb?\" she asked gently.\u003c/p\u003e\n\u003cp\u003eHe gazed up at her quickly and then looked away. \"Yeah. It was better than my picture of Winston, wasn\u0027t it?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-45.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
