{"id":79207,"no":50,"title":"Page 50","content":"\u003cp\u003e\"Mitch told me that much.\"\u003c/p\u003e\n\u003cp\u003e\"I got a lot more serious about the situation after I heard the rumor that Octavia had been voted Most Likely Suspect.\"\u003c/p\u003e\n\u003cp\u003e\"Octavia?\" Sullivan scowled. \"Now, that\u0027s interesting.\"\u003c/p\u003e\n\u003cp\u003e\"I thought so.\" Never let it be said that the old man was losing it mentally, Nick thought. Sullivan had grasped the implications immediately. \"Especially when you consider that she\u0027s well-liked here in town. It would have been a lot easier to cast suspicion on the Heralds, who are viewed as the local weirdos and outsiders.\"\u003c/p\u003e\n\u003cp\u003e\"You figure it\u0027s personal, don\u0027t you? Someone is out to pin the blame on Octavia for some specific reason.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s how it looks to me.\"\u003c/p\u003e\n\u003cp\u003e\"You sure she hasn\u0027t managed to piss off someone here in town? Maybe refused to market some artist who\u0027s decided to get even?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\" Nick shot him a searching glance. \"I\u0027m starting to wonder if this could be coming out of the past.\"\u003c/p\u003e\n\u003cp\u003e\"Claudia Banner.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"But the only folks who got hurt when Claudia pulled off her scam all those years ago were Mitch and me. And we\u0027re both a little too old for revenge, even if we had a notion to go after it.\"\u003c/p\u003e\n\u003cp\u003e\"I doubt if anyone gets too old for revenge if the motivation is strong enough, but I agree that you and Mitch are not the ones behind this. What I want to know is, do you think there\u0027s anyone else in Eclipse Bay who might harbor a grudge against Claudia Banner that would be big enough to make him go after Octavia?\"\u003c/p\u003e\n\u003cp\u003eSullivan contemplated that in silence for a while.\u003c/p\u003e\n\u003cp\u003e\"If there\u0027s one thing I\u0027ve learned about business in the past sixty years,\" he said finally, \"it\u0027s that it\u0027s always personal. And when the deal involves as much cash as Claudia\u0027s scam did, there\u0027s usually a fair amount of collateral damage.\"\u003c/p\u003e\n\u003cp\u003e\"Meaning maybe someone besides you and Mitchell Madison got hurt?\"\u003c/p\u003e\n\u003cp\u003e\"Could be. It\u0027s possible. I can\u0027t give you any names but I\u0027ll tell you what I\u0027ll do. I\u0027ll go over this with Mitch. You know, he and I never really talked about the details of what happened when Claudia put us into bankruptcy. We were too busy blaming each other and firing up the feud. But maybe we can discuss it calmly now. Put our heads together and reconstruct events, so to speak.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks. Let me know if you come up with anyone who might still be so pissed off at Claudia Banner that he would go after her niece.\"\u003c/p\u003e\n\u003cp\u003e\"All right. It\u0027s a long shot, though. You do realize that?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. But that\u0027s all I\u0027ve got at the moment. Long shots.\"\u003c/p\u003e\n\u003cp\u003e\"I can see that.\" Sullivan came to a halt and stabbed the cane into the sand a few times. He gave Nick a beatific smile. \"Now that that\u0027s settled, how about I do you a favor and give you some time to yourself?\"\u003c/p\u003e\n\u003cp\u003e\"You offering to babysit?\"\u003c/p\u003e\n\u003cp\u003e\"Figured I\u0027d take Carson back to Portland with me for a few days. Lillian and I can look after him while Gabe and Hamilton argue about the details of the merger. You\u0027ll have time to work on finding that missing painting.\"\u003c/p\u003e\n\u003cp\u003e\"Sure. If he wants to go, you\u0027re welcome to take him with you, but don\u0027t pretend that you\u0027re trying to do me any favors. You just want another opportunity to mold him in your image. You think you can turn him into the next major empire builder in the family.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got to admit, the boy\u0027s got a flair for business.\"\u003c/p\u003e\n\u003cp\u003eSullivan chuckled. \"Remember how much money he made off that lemonade stand he set up in front of the house a few months ago when you brought him down to Phoenix? Talk about a natural aptitude.\"\u003c/p\u003e\n\u003cp\u003eNick regarded his son playing with Winston and felt a rush of pride. \"We\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003e\"We will, indeed. By the way, don\u0027t tell me that I\u0027m not doing you any favors by removing young Carson from the vicinity for a while. I\u0027d think you\u0027d appreciate me giving you a little space in which to do your courting.\"\u003c/p\u003e\n\u003cp\u003e\"Courting.\" Nick stumbled over a rocky outcropping. He caught his balance and glowered at Sullivan. \"What the hell are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"I figure I owe you that much,\" Sullivan continued smoothly, \"after the way I tried to coerce you into taking over Harte Investments. And I\u0027ve got to say, I think you\u0027ve made a fine choice. I\u0027m rather fond of Octavia.\"\u003c/p\u003e\n\u003cp\u003e\"Damn it, who said anything about me courting Octavia Brightwell?\"\u003c/p\u003e\n\u003cp\u003e\"Gives me a good feeling to be helping you out like this. I do believe I\u0027m getting downright sentimental in the twilight of my life.\"\u003c/p\u003e\n\u003cp\u003e\"Twilight, my ass. You\u0027re not getting sentimental, you\u0027re still trying to run things, the way you always have.\"\u003c/p\u003e\n\u003cp\u003e\"What can I say? It\u0027s in the blood.\"\u003c/p\u003e\n\u003cp\u003eThey set out for Portland two hours later. Sullivan waited until they passed the You Are Now Leaving Eclipse Bay sign before he picked up the cell phone and punched out Mitchell\u0027s number.\u003c/p\u003e\n\u003cp\u003e\"Well?\" Mitchell demanded. \"Did you get Nick straightened out?\"\u003c/p\u003e\n\u003cp\u003eSullivan glanced at Carson seated beside him. The boy was immersed in a book about dogs. \"There\u0027s no need to worry about my grandson\u0027s, uh, association with Miss Brightwell.\"\u003c/p\u003e\n\u003cp\u003eMitchell snorted loudly on the other end. \"So you say.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll have to take my word on that subject, Mitch. Meanwhile, something has come up in regard to that missing painting. Nick\u0027s got a hunch that there\u0027s a personal angle here. He thinks the thief might be someone who is still holding a grudge because of what happened when Claudia took Harte-Madison apart.\"\u003c/p\u003e\n\u003cp\u003e\"But you and I were the ones who went bankrupt all those years ago. As far as I know we were the only people who got ripped off. Why the hell would anyone else still hold a grudge?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I suggest we start with a list of everyone we knew at the time who might have had anything to do with Claudia and Harte-Madison.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s gonna take some thinking.\"\u003c/p\u003e\n\u003cp\u003e\"I know. Tell you what. You put your list together and I\u0027ll make up mine. Then we can talk and compare notes. Maybe something will hit us.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see what I can do.\" Mitch paused. \"You\u0027re sure Nick is gonna get his act together with Octavia?\"\u003c/p\u003e\n\u003cp\u003e\"Count on it.\"\u003c/p\u003e\n\u003cp\u003eSullivan ended the call and looked at Carson. \"Picked out the kind of dog you want?\"\u003c/p\u003e\n\u003cp\u003e\"I want one just like Winston.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t go wrong with another Winston.\" Sullivan ruffled the boy\u0027s hair, then reached into his briefcase. \"That reminds me, I brought a printout of your investment portfolio with me. Want to see how those lemonade profits are doing?\"\u003c/p\u003e\n\u003cp\u003eCarson slammed the dog book closed. \"How much money did I make?\" he asked excitedly. \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-50.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
