{"id":79208,"no":51,"title":"Page 51","content":"\u003cp\u003e\"You did very well with those ten shares in Fast Toy, Inc.\"\u003c/p\u003e\n\u003cp\u003e\"I told you they made good toys.\"\u003c/p\u003e\n\u003cp\u003e\"So you did.\" Sullivan put the brokerage statement on the seat between them. \"Take a look at that bottom line. You made three hundred dollars.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, wow.\" Carson snatched up the statement and immediately started asking questions about the various entries.\u003c/p\u003e\n\u003cp\u003eSullivan settled back against the seat and prepared to indulge himself in one of his favorite hobbies: teaching his eager great-grandson the finer points of investment strategies.\u003c/p\u003e\n\u003cp\u003eLife was good, he thought. He had Carson, and two hours ago Hannah had informed him that he was soon to become a great-grandfather for the second time. Judging by the intimacy and the joy he witnessed when he was with Gabe and Lillian, he was almost certain there would be more good news coming from that quarter one of these days.\u003c/p\u003e\n\u003cp\u003eAll he had to do was get Nick and Octavia on the right track and life would be damn near perfect.\u003c/p\u003e\n\u003cp\u003eChapter 17\u003c/p\u003e\n\u003cp\u003eAn eerie green light emanated from Arizona\u0027s War Room. Octavia studied the glow seeping around the edge of the heavy steel door with great interest.\u003c/p\u003e\n\u003cp\u003e\"Think maybe she\u0027s thawing some of those frozen space aliens she claimed the institute was trying to hide a few months ago?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"When it comes to A.Z. and her conspiracy theories, nothing would surprise me.\" Nick pushed open the door and stood back to allow Octavia to enter the room.\u003c/p\u003e\n\u003cp\u003eIn any normal house, the space would probably have been described by the architect as a study. But Arizona didn\u0027t live in a normal house. Her cabin was fortified with locking metal shutters on all the windows. The doors had been reinforced with steel bolts. Rumor had it that Arizona had six months\u0027 worth of supplies and food stored on the premises.\u003c/p\u003e\n\u003cp\u003eOctavia had lived in Eclipse Bay long enough to know that the reason no one in town got nervous about Arizona was because it was a fact that she had no interest in weapons of any kind. In her bizarre fantasy world, her mission was to collect and analyze intelligence data on the various conspiracies she was certain lay just below the surface at the Eclipse Bay Policy Studies Institute. The fact that the institute dismissed her as a quaint, local eccentric suited Arizona just fine. As she had explained to Octavia on one occasion, the disdain from the institute staff only made her job of spying on them simpler.\u003c/p\u003e\n\u003cp\u003eOctavia stepped into the War Room and saw that the mysterious green light radiated from a computer screen. Three people garbed in flowing robes and wearing a lot of the vaguely Egyptian-style jewelry favored by the Heralds sat hunched over the table. Two of them were going through heavy, leather-bound log books. The third was pounding away on the keyboard. They barely glanced up when Octavia and Nick entered.\u003c/p\u003e\n\u003cp\u003eThere was a spartan, military-spare look to the furnishings. A large topographical map of Eclipse Bay was laminated to the surface of a massive desk. Rows of log books were arranged on the metal shelving that lined one wall.\u003c/p\u003e\n\u003cp\u003eArizona, dressed in her customary camouflage-patterned fatigues, occupied the aging wooden chair behind the desk. A chubby, unlit cigar stuck out of the corner of her mouth. The narrow beam from the desk lamp was aimed low to illuminate the topo map. Most of Arizona\u0027s face was in shadow.\u003c/p\u003e\n\u003cp\u003e\"About time you two got here.\" Arizona motioned toward the chairs that sat opposite her on the other side of the desk. \"Have a seat. Coffee?\"\u003c/p\u003e\n\u003cp\u003eOctavia glanced toward the machine in the corner. She could detect the unmistakable odor of burned coffee from where she stood. The glass pot had been sitting on the hot plate for a long, long time.\u003c/p\u003e\n\u003cp\u003e\"No, thanks,\" she said politely. She took one of the chairs. \"I\u0027ve had enough today.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll pass, too.\" Nick dropped into the chair beside her. He angled his chin toward the three Heralds. \"How\u0027s Project Log Book going?\"\u003c/p\u003e\n\u003cp\u003e\"Right on schedule, and I intend to keep it that way.\" Arizona permitted herself a small moment of intense satisfaction. \"Those bastards up at the institute aren\u0027t going to stop us. But we\u0027ve got a problem.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s up?\" Nick asked easily.\u003c/p\u003e\n\u003cp\u003e\"The institute crowd has started a rumor. Heard it at Fulton\u0027s this morning,\" Arizona stated, clearly agitated.\u003c/p\u003e\n\u003cp\u003eOctavia sighed. \"That would be the rumor that I\u0027m the one who stole the painting and faked a break-in at my gallery to cover my tracks?\"\u003c/p\u003e\n\u003cp\u003e\"Bingo.\" Arizona snorted. \"So, you\u0027ve heard it, too, eh?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Nick said. \"Seemed to be coming from Eugene and Dwayne. I took steps to keep them quiet, but I had a hunch that they weren\u0027t the original source.\"\u003c/p\u003e\n\u003cp\u003e\"I reckon that the institute tried to use them to spread it for obvious reasons,\" Arizona said. \"Not like those two blockheads would question the source of a story. They\u0027d just happily blab to anyone who would listen. Whoever used them knew that was their nature.\"\u003c/p\u003e\n\u003cp\u003eNick thought for a minute. \"You said you heard the rumor at Fulton\u0027s?\"\u003c/p\u003e\n\u003cp\u003e\"Checkout counter,\" Arizona said. \"Overheard Betty Stiles talking about it to Marjorie Dunne.\"\u003c/p\u003e\n\u003cp\u003eAn unpleasant whisper of unease went through Octavia. Marjorie Dunne was the mother of little Katy Dunne, one of the children who had entered a picture in the Children\u0027s Art Show. Gordon Dunne served on the town council and had made it clear that he intended to run for mayor in the next election cycle. The family took its role as pillars of the community seriously.\u003c/p\u003e\n\u003cp\u003e\"Betty and Marjorie, huh?\" Nick leaned back in his chair and thrust his legs out toward the desk. He steepled his fingers. \"What we need to do is trace this rumor back to the source.\"\u003c/p\u003e\n\u003cp\u003e\"We know where it got started,\" Arizona snapped. \"That crowd up at the institute concocted it. I\u0027ll bet they\u0027ve got that painting stashed somewhere up there, too. Now, I\u0027ve come up with a plan—\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Nick unsteepled his fingers and held up one hand, palm out, to silence her. \"Don\u0027t even think about it. You are not going to send Octavia and me into the institute to search for that painting.\"\u003c/p\u003e\n\u003cp\u003e\"Got to go in,\" Arizona declared. \"Don\u0027t see any other way to find the picture.\"\u003c/p\u003e\n\u003cp\u003e\"Give me a few more days,\" Nick said. \"I\u0027m working on some angles.\"\u003c/p\u003e\n\u003cp\u003eArizona looked skeptical. \"What angles?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a little complicated and I\u0027m not ready to talk about it yet. Let\u0027s just say that I think this thing has roots in the past. I\u0027ve asked my grandfather to help. He and Mitch Madison are doing some deep background research. When I get the results I\u0027ll contact you.\"\u003c/p\u003e\n\u003cp\u003e\"Deep background, huh?\" Arizona chewed on her cigar while she pondered that. \"When do you expect a report from \u0027em?\" \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-51.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
