{"id":79218,"no":61,"title":"Page 61","content":"\u003cp\u003e\"What\u0027s going on here?\" he asked with lazy interest.\u003c/p\u003e\n\u003cp\u003eShe straddled him and smiled slowly. \"My turn.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, wow.\"\u003c/p\u003e\n\u003cp\u003eShe felt him leave the bed again shortly before dawn. Dismay and regret and a strange resentment whispered through her. She opened her eyes and stared at the wall, listening to him pad barefooted across the floor.\u003c/p\u003e\n\u003cp\u003eOf course he was leaving. What had she expected him to do? Stay until morning? What would be the point? This was a summer affair.\u003c/p\u003e\n\u003cp\u003eBut she was not about to let him just slide out like this. He could say a proper goodbye when he left her bed, damn it.\u003c/p\u003e\n\u003cp\u003eShe turned on her side, searching for him in the shadows, expecting to see him making for the bathroom with his clothes. But he wasn\u0027t creeping across the carpet.\u003c/p\u003e\n\u003cp\u003eHe stood at the window, one hand braced against the sill, and looked out at the moonlit bay. The pale glow streaming through the glass etched his shoulders in steely silver and cast his profile into deep shadow.\u003c/p\u003e\n\u003cp\u003e\"Nick?\" She levered herself up on her elbows. \"What are you doing?\"\u003c/p\u003e\n\u003cp\u003eHe turned his head to look toward the bed. \"I was just thinking.\"\u003c/p\u003e\n\u003cp\u003e\"About what?\"\u003c/p\u003e\n\u003cp\u003e\"About what happens at the end of the summer.\"\u003c/p\u003e\n\u003cp\u003eShe did not move. She did not even breathe. \"This isn\u0027t The Talk, is it? Because if you\u0027re trying to sneak it in now—\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not The Talk,\" he said, his voice roughening abruptly.\u003c/p\u003e\n\u003cp\u003eShe stared at him. \"Are you angry?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe. Yeah. I think so. I\u0027m trying to have a rational discussion here and you\u0027re throwing that crap about The Talk in my face.\"\u003c/p\u003e\n\u003cp\u003eHe was angry, all right. Fair enough. She was rapidly losing her temper, too.\u003c/p\u003e\n\u003cp\u003e\"Okay, sorry,\" she said stiffly. \"I just wanted to be sure you weren\u0027t going to try to deliver that stupid talk now. Because it\u0027s much too late.\"\u003c/p\u003e\n\u003cp\u003eHe did not move for a few seconds. Then he came away from the window and walked back to the bed to stand looking down at her.\u003c/p\u003e\n\u003cp\u003e\"Too late?\" he repeated neutrally.\u003c/p\u003e\n\u003cp\u003e\"Whether you like it or not, we are involved in a relationship. It may not work out for a variety of reasons, but I\u0027ll be damned if I\u0027ll let you put some arbitrary limit on it.\"\u003c/p\u003e\n\u003cp\u003e\"There seems to be some confusion here,\" he said coldly. \"You\u0027re accusing me of trying to specify the time and date when this thing between us ends, but I\u0027m not the one who keeps talking about leaving Eclipse Bay in a few weeks.\"\u003c/p\u003e\n\u003cp\u003eShe opened her mouth to argue and then closed it quickly.\u003c/p\u003e\n\u003cp\u003eOkay, he had a point.\u003c/p\u003e\n\u003cp\u003eShe cleared her throat. \"That\u0027s different.\"\u003c/p\u003e\n\u003cp\u003e\"Like hell.\"\u003c/p\u003e\n\u003cp\u003eShe glowered. \"I have to be pragmatic. I\u0027ve got a business to sell. That takes time and planning. And then there\u0027s the move. A person can\u0027t make those sorts of arrangements on a last-minute basis.\"\u003c/p\u003e\n\u003cp\u003eHe put one knee on the tumbled bedding. \"You\u0027re the one who\u0027s running scared here.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not true.\"\u003c/p\u003e\n\u003cp\u003e\"Hell, maybe we\u0027ve both been running scared for a while.\" He came down on top of her, pushing her back onto the pillows. \"But I think it\u0027s time we both stopped.\"\u003c/p\u003e\n\u003cp\u003e\"You do?\"\u003c/p\u003e\n\u003cp\u003e\"If you want to sleep with me, lady, you\u0027re going to have to take a few chances.\"\u003c/p\u003e\n\u003cp\u003e\"Is that so?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"What about you?\" she managed. \"Are you willing to take a few risks, too?\"\u003c/p\u003e\n\u003cp\u003eHis smile was slow and enigmatic in the shadows. His eyes had never been more dangerous. Or promised so much.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been taking chances since the day I met you,\" he said. \"Want to know why I didn\u0027t give you The Talk back at the beginning of this affair?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"I forgot about it, that\u0027s why. Never even crossed my mind to give you The Talk.\" He brushed his mouth across hers. \"You see? Taking chances.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003eHe bent his head again and put his mouth to her throat. She felt the edge of his teeth against her skin and excitement stormed through her. She wrapped her arms around him and stopped thinking about the end of summer.\u003c/p\u003e\n\u003cp\u003eChapter 20\u003c/p\u003e\n\u003cp\u003eGail rushed through the door of the gallery shortly after ten-thirty the next morning. \"You won\u0027t believe this.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" Octavia came around the corner of one of the display panels and stopped, staring in amazement. \"You\u0027re right. I don\u0027t believe it. Good grief, what happened? You\u0027ve got Very Big Hair.\"\u003c/p\u003e\n\u003cp\u003e\"What? Oh, yeah, my hair.\" Gail grimaced and put up a hand to touch the crisply starched mountain of hair on top of her head. \"You owe me for this, boss. Big time.\"\u003c/p\u003e\n\u003cp\u003eOctavia shook her head slowly in disbelief. She could not get over her hair. \"That\u0027s amazing.\"\u003c/p\u003e\n\u003cp\u003e\"Carla wanted to color it, too, but I drew the line at that.\"\u003c/p\u003e\n\u003cp\u003e\"Let me guess. Blonde?\"\u003c/p\u003e\n\u003cp\u003e\"Probably. I didn\u0027t get into a discussion of shades. I told her I needed to think about such a major move.\" Gail waved that aside. \"But that\u0027s not important. What\u0027s important here is what I heard while I was trapped in the chair.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, yes.\" Octavia propped a scene of Hidden Cove at dawn against the panel. \"Your undercover assignment. I almost forgot. Well?\"\u003c/p\u003e\n\u003cp\u003eGail drew herself up proudly. \"Laugh if you will, but I found out something you really ought to know.\"\u003c/p\u003e\n\u003cp\u003eOctavia reached up to remove a picture of the marina from a panel. \"Okay, Madam Spy. What did you find out at the beauty shop?\"\u003c/p\u003e\n\u003cp\u003eGail leaned against the counter and examined her nails. \"Not much.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not surprised.\" She set the marina scene aside and hoisted the picture of Hidden Cove.\u003c/p\u003e\n\u003cp\u003e\"Just two tiny little snippets of information that you might find interesting.\"\u003c/p\u003e\n\u003cp\u003eOctavia hung the Hidden Cove picture on the panel in the space that had been previously occupied by the painting of the marina. \"And those two tiny little snippets would be?\"\u003c/p\u003e\n\u003cp\u003e\"Well, for starters, I found out what caused the big fight at the Total Eclipse last night.\"\u003c/p\u003e\n\u003cp\u003e\"It was a bar brawl.\" Octavia stepped back to study the position of the picture she had just hung. \"I have it on excellent authority that such events are random acts of nature. They don\u0027t need a cause.\"\u003c/p\u003e\n\u003cp\u003e\"This one apparently had a very specific cause,\" Gail murmured dryly.\u003c/p\u003e\n\u003cp\u003e\"Really?\" Octavia made a tiny adjustment to the frame. \"And what was it?\"\u003c/p\u003e\n\u003cp\u003e\"You.\"\u003c/p\u003e\n\u003cp\u003eOctavia\u0027s fingers stilled on the frame. \"Someone said that I was the cause?\"\u003c/p\u003e\n\u003cp\u003e\"Actually, everyone is saying it this morning.\"\u003c/p\u003e\n\u003cp\u003eOctavia turned slowly. \"That\u0027s very irritating.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-61.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
