{"id":79222,"no":65,"title":"Page 65","content":"\u003cp\u003e\"Might be a good idea to give everyone some time to cool off before you tell them about the coffee thing,\" Nick said behind her. He sounded amused, but there was the barest hint of a warning in his voice. \"I\u0027m not sure Eclipse Bay is ready for the details of my second cup of coffee.\"\u003c/p\u003e\n\u003cp\u003eShe spun around. Reality came back with a jarring thud.\u003c/p\u003e\n\u003cp\u003e\"I think it might be a good idea to check out now,\" he said.\u003c/p\u003e\n\u003cp\u003eShe wondered just how big a fool she had made of herself. He was right. This was a very, very good time to check out.\u003c/p\u003e\n\u003cp\u003e\"Okay.\" She whipped the cart around and headed for the checkout counter, leaving Sandra and Megan still tangled up in Canned Veg \u0026amp; Beans.\u003c/p\u003e\n\u003cp\u003e\"I hope you don\u0027t mind me interrupting back there,\" Nick said, falling into step beside her. \"It\u0027s just that some things are personal, you know? That stuff about the second cup of coffee? That\u0027s special to a sensitive guy like me.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, for heaven\u0027s sake, Nick, you didn\u0027t even have a second cup of coffee this morning and you know it.\"\u003c/p\u003e\n\u003cp\u003e\"Are you sure?\"\u003c/p\u003e\n\u003cp\u003e\"Of course I\u0027m sure. Can\u0027t you remember what you had for breakfast?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all a blur after the eggs and mustard.\"\u003c/p\u003e\n\u003cp\u003eChapter 21\u003c/p\u003e\n\u003cp\u003eAt four o\u0027clock that afternoon he went back to the gallery to check on Octavia. She had looked good during the scene with Sandra and Megan at Fulton\u0027s, but underneath he thought he had detected some additional strain.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s not here,\" Gail said the instant he walked through the door. \"She went home early.\"\u003c/p\u003e\n\u003cp\u003e\"She never goes home early,\" Nick said.\u003c/p\u003e\n\u003cp\u003e\"She did today.\"\u003c/p\u003e\n\u003cp\u003eHe was getting more concerned by the minute. \"Is she okay?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so.\" Gail exhaled deeply. \"She\u0027s lived in town off and on for over a year and she\u0027s been hanging out a lot with Hartes and Madisons, but, that doesn\u0027t mean she\u0027s completely acclimated to our quaint little traditions here in Eclipse Bay. In spite of the way she handled Sandra and Megan, I think she\u0027s a lot more upset about the gossip that is going around than she\u0027s letting on.\"\u003c/p\u003e\n\u003cp\u003eNick frowned. \"You really think it\u0027s bothering her? Seemed like she was dealing with it fairly well earlier.\"\u003c/p\u003e\n\u003cp\u003eGail watched him very steadily. \"The brawl last night was bad enough. But the fact that everyone is talking about how you spent the night at her place is a real problem, I think.\"\u003c/p\u003e\n\u003cp\u003e\"Why? Everyone knows that we\u0027re seeing each other. It\u0027s no secret. She\u0027s aware of that.\"\u003c/p\u003e\n\u003cp\u003e\"No offense, but I do believe that you\u0027re missing the point here,\" Gail said. \"You were seen driving away from her cottage at eight o\u0027clock this morning.\"\u003c/p\u003e\n\u003cp\u003e\"Seven thirty-five, and so somebody noticed my car coming from the direction of her cottage early this morning. So what? Not the first time.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, it is, as a matter of fact.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right, I am missing something here. You want to run that by me again?\"\u003c/p\u003e\n\u003cp\u003eGail picked up a stack of brochures announcing the Children\u0027s Art Show and made a pretense of straightening them. \"Eight o\u0027clock or, to be precise, seven thirty-five, is well after dawn at this time of year.\"\u003c/p\u003e\n\u003cp\u003e\"What about it?\"\u003c/p\u003e\n\u003cp\u003e\"Pay attention, Nick.\" She slapped the brochures back down on the counter. \"The word has gone out that Octavia has broken the curse.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah? So?\"\u003c/p\u003e\n\u003cp\u003e\"You do know about the curse, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"That idiotic story about me that claims that I never spend the entire night with a woman?\" He waved that aside. \"I\u0027ve heard about it, sure.\"\u003c/p\u003e\n\u003cp\u003e\"Well?\" she demanded.\u003c/p\u003e\n\u003cp\u003e\"It probably got started because I\u0027ve never left Carson with a sitter overnight. But it doesn\u0027t follow that I never have any nights to myself. Carson stays with family once in a while. He\u0027s with his grandfather and his great-grandfather and Lillian and Gabe at the moment. Leaving me free to do as I please at night.\"\u003c/p\u003e\n\u003cp\u003e\"So, does that mean that you do sometimes spend the entire night with a woman with whom you\u0027re romantically involved?\" Gail asked with disconcerting interest.\u003c/p\u003e\n\u003cp\u003e\"Guys don\u0027t get romantically involved.\"\u003c/p\u003e\n\u003cp\u003e\"What do they get?\"\u003c/p\u003e\n\u003cp\u003e\"Involved, period.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, sure, I knew that. So, do you sometimes spend the entire night with women with whom you\u0027re involved, period?\"\u003c/p\u003e\n\u003cp\u003e\"You know, I didn\u0027t come here to discuss my love life with a woman who has Very Big Hair.\"\u003c/p\u003e\n\u003cp\u003e\"That was a low blow.\" Gail patted the rigid outer layer of her voluminous hairdo. \"I was only carrying out my assignment.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" Nick went toward the door. \"Too bad you didn\u0027t learn anything useful about that damned painting.\"\u003c/p\u003e\n\u003cp\u003eGail straightened her shoulders and held her chin high. \"In the long run, I feel that I discovered something infinitely more important.\"\u003c/p\u003e\n\u003cp\u003e\"Such as?\"\u003c/p\u003e\n\u003cp\u003e\"The name of the woman who broke the curse on Hardhearted Harte.\"\u003c/p\u003e\n\u003cp\u003eHe went out onto the sidewalk and slammed the door closed.\u003c/p\u003e\n\u003cp\u003eTwenty minutes later he stood on the bluff above the small, crescent-shaped beach, looking down. She was sitting on a rock, knees drawn up under a long, geranium-red skirt, her face hidden beneath the wide brim of a big straw hat. The now-familiar flicker of intense awareness crackled through him, tightening his belly and heating his blood.\u003c/p\u003e\n\u003cp\u003eIt was a deeply sensual feeling, but he could not slap the label great sex on this and let it go at that. He had known that from the beginning.\u003c/p\u003e\n\u003cp\u003eHe watched her there in the sunlight, her skirt fluttering a little in the breeze, her gracefully rounded arms wrapped around her knees, and he finally understood.\u003c/p\u003e\n\u003cp\u003eThis strange, bone-deep sensation that he always experienced when he thought about her or when he was in her vicinity wasn\u0027t merely desire or anticipation. It was a sense of connection. In some manner that he knew he would probably never fully comprehend, he was linked to her now.\u003c/p\u003e\n\u003cp\u003eHe had never known this particular kind of bond, he realized. Perhaps it would have developed eventually with Amelia if they had had more time and if he had not screwed things up by quitting Harte Investments and if she had not turned to an old lover when the chips were down.\u003c/p\u003e\n\u003cp\u003eNo. It would never have been like this with Amelia. It could never be like this with anyone else.\u003c/p\u003e\n\u003cp\u003eMaybe the rumors were right. Maybe he had been under some kind of curse.\u003c/p\u003e\n\u003cp\u003eBut what was the point of being freed if he lost the lady who had the magic touch?\u003c/p\u003e\n\u003cp\u003eShe turned slightly, obviously aware that someone was on the bluff behind her. The straw brim of the hat tilted at an angle and he caught a glimpse of her face. She had on a pair of dark glasses. He could not read her expression but he got the distinct impression that she was not overly thrilled to see him. She was certainly not waving. \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-65.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
