{"id":79225,"no":68,"title":"Page 68","content":"\u003cp\u003e\"Yeah.\" Dwayne drank more beer. \"Always says somethin\u0027 like, Good morning, or How are you? or Beautiful day, ain\u0027t it?\"\u003c/p\u003e\n\u003cp\u003eNick looked at Dwayne. \"She says, Beautiful day, ain\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Nan, that ain\u0027t right.\" Dwayne\u0027s thin face twisted into a tight little knot with the effort of trying to think. \"She says, Beautiful day, isn\u0027t it? Yeah, that\u0027s it. Isn\u0027t it.\"\u003c/p\u003e\n\u003cp\u003e\"Sure glad we got that straight,\" Jeremy said under his breath.\u003c/p\u003e\n\u003cp\u003e\"Anyhow,\" Eugene went on with a doggedly determined air, \"point is, she\u0027s a nice lady, even if she did swipe that painting. Me and Dwayne shouldn\u0027t have said that stuff about her deliberately screwing your brains out just so you wouldn\u0027t figure her for the thief. I mean, so what if that\u0027s the reason she\u0027s sleeping with you? It\u0027s a damn good reason, if you ask me. Goes to show she\u0027s smart.\"\u003c/p\u003e\n\u003cp\u003e\"It takes a real man to apologize,\" Nick said. \"Far as I can tell, you were among the first to hear the rumors at Fulton\u0027s. If you really want to settle things between us, you can tell me the name of the person who gave you the story.\"\u003c/p\u003e\n\u003cp\u003eEugene and Dwayne exchanged nods. \"It was that prissy old bitch, Mrs. Burke, wasn\u0027t it? Remember, Dwayne, she was talking to Carla from the beauty shop? I was in the ice cream section getting a couple of quarts of chocolate fudge swirl and they were right across from me in frozen orange juice. Acted like they never saw us.\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" Dwayne said. \"I remember. Old Lady Burke and Carla from the beauty parlor.\"\u003c/p\u003e\n\u003cp\u003eNick saw Jeremy\u0027s eyes narrow a little at the names. He put down his unfinished beer and got to his feet.\u003c/p\u003e\n\u003cp\u003e\"Thanks, Eugene,\" he said. \"You, too, Dwayne. I appreciate the information. And the beer, too.\"\u003c/p\u003e\n\u003cp\u003e\"Same here.\" Jeremy set his unfinished glass down on the bar next to Nick\u0027s.\u003c/p\u003e\n\u003cp\u003e\"Ain\u0027tcha gonna finish your beers?\" Eugene asked, looking offended.\u003c/p\u003e\n\u003cp\u003e\"The thing is,\" Nick said, \"you\u0027ve given us a hot new clue and we\u0027ve got to get to work on it immediately.\"\u003c/p\u003e\n\u003cp\u003e\"A clue, huh?\" Eugene sounded pleased. \"How about that, Dwayne? We gave \u0027em a clue. If they find that missing picture it\u0027ll be on accounta us.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll have our undying gratitude,\" Nick said.\u003c/p\u003e\n\u003cp\u003e\"I like the sound of that,\" Eugene said. \"You sure you don\u0027t want the rest of your beer?\"\u003c/p\u003e\n\u003cp\u003e\"I wish I could hang around to finish it, but time is of the essence,\" Nick said. \"Help yourself.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t mind if I do.\" Eugene picked up Nick\u0027s unfinished beer and dumped it into his own nearly empty glass.\u003c/p\u003e\n\u003cp\u003eDwayne did the same with the remaining beer in Jeremy\u0027s glass.\u003c/p\u003e\n\u003cp\u003e\"That strike you as sanitary?\" Jeremy asked as they went through the front door into the sunlight.\u003c/p\u003e\n\u003cp\u003e\"The alcohol probably kills all the germs,\" Nick said.\u003c/p\u003e\n\u003cp\u003e\"Sure. Eugene and Jeremy would have considered that.\"\u003c/p\u003e\n\u003cp\u003eThe sunshine was blinding after the endless night of the Total Eclipse. Nick reached for his dark glasses. \"What\u0027s with Mrs. Burke? You know her well?\"\u003c/p\u003e\n\u003cp\u003e\"No, but my grandmother does. Mrs. Burke is a member of her bridge group,\" Jeremy said. \"They\u0027ve been playing together every Wednesday and Saturday for nearly forty years.\"\u003c/p\u003e\n\u003cp\u003e\"Which means your grandmother might be able to tell us where Mrs. Burke got the story.\"\u003c/p\u003e\n\u003cp\u003eJeremy exhaled heavily. \"There may be a little problem with me interrogating Grandma at the moment.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s still upset about you being hauled off to the police station after the big brawl?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. I stopped by to see her again this morning. I wanted to explain things and then ask her some questions about her recollections of what happened in the past. But I didn\u0027t get far. She was just sitting there at her kitchen table looking more depressed than she did after my divorce. Evidently I am proving to be just one major disappointment after another.\"\u003c/p\u003e\n\u003cp\u003e\"Want me to talk to her? Tell her it was all my fault?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s already decided whose fault it is,\" Jeremy said. \"Like everyone else in town, she blames Octavia.\"\u003c/p\u003e\n\u003cp\u003eThe door of the Total Eclipse opened again behind Nick. He glanced over his shoulder and saw Walter Willis emerge from the gloom. Something clicked.\u003c/p\u003e\n\u003cp\u003e\"Hey, Walt, got a minute?\"\u003c/p\u003e\n\u003cp\u003e\"No problem.\" Walt changed direction and veered away from the van at the curb. He went toward Nick, sunlight gleaming on his meticulously shaved head. \"I need to get some tools but I\u0027m in no rush. What can I do for you?\"\u003c/p\u003e\n\u003cp\u003e\"You and Torrance installed the security alarm system in Octavia Brightwell\u0027s gallery, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Sure did. She asked us to put it in when she opened for business. Why? Got a problem with it?\"\u003c/p\u003e\n\u003cp\u003e\"No. I just wondered if anyone besides Octavia and her former assistant might have access to the code.\"\u003c/p\u003e\n\u003cp\u003e\"This is about the missing painting, isn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Any ideas?\"\u003c/p\u003e\n\u003cp\u003e\"Well, Torrance or I could override the system if need be. But we\u0027ve never had to do it. A real solid alarm system. Hasn\u0027t failed yet, not even during that big storm the other night.\" Walter\u0027s expression clouded. \"See here, you thinking maybe one of us used the override code to sneak in and steal that painting?\"\u003c/p\u003e\n\u003cp\u003e\"Never crossed my mind,\" Nick said with absolute sincerity.\u003c/p\u003e\n\u003cp\u003eWalter snorted and relaxed. \"Should hope not.\"\u003c/p\u003e\n\u003cp\u003e\"But can you think of anyone else who might be able to override that system?\"\u003c/p\u003e\n\u003cp\u003eWalter stroked his square chin, reflective and willing to be helpful now that he had been assured that he and his twin were not suspects. \"Torrance and I never gave out the code to anyone except Miss Brightwell. I know she gave it to Noreen Perkins, but that\u0027s about all I know. You\u0027d have to find Noreen to ask her if she gave it to anyone.\"\u003c/p\u003e\n\u003cp\u003e\"Sean Valentine is working that angle,\" Nick said. \"Don\u0027t think he\u0027s tracked her down yet, but he will eventually. Thanks, Walt. I just wanted to make certain I wasn\u0027t overlooking something obvious.\"\u003c/p\u003e\n\u003cp\u003e\"You bet.\" Walter winked broadly. \"I figure it\u0027s the least I can do for you after what you and Seaton, here, did for me and Torrance. Told Fred years ago the place needed a new coat of paint but he kept putting it off on account of he was too damn cheap. But now he says he wants a first-class job. Bottom line, on behalf of the Willis brothers, I\u0027d like to say thanks.\"\u003c/p\u003e\n\u003cp\u003e\"It was nothing,\" Nick said. \"Just doing our part to improve Eclipse Bay. Hartes and Seatons have got a deep sense of civic responsibility, you know.\"\u003c/p\u003e\n\u003cp\u003eChapter 22\u003c/p\u003e\n\u003cp\u003e\"Way I figure it,\" Mitchell said into the cell phone, \"getting into a bar fight over a lady like Octavia is as good as a marriage proposal. You\u0027d damn sure better speak to that grandson of yours or I\u0027m gonna have to do it for you.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/summer-in-eclipse-bay-eclipse-bay-3/page-68.html","bookId":1793,"creation":"Oct 5, 2019 4:14:46 PM","modification":"Oct 5, 2019 4:14:46 PM"}
