{"id":31237,"no":49,"title":"Chapter 47","content":"Departure From Horncastle — Recruiting Sergeant — Kauloes and Lolloes.\n\u003cbr\u003e \n\u003cbr\u003e Leaving Horncastle I bent my steps in the direction of the east. 179 I walked at a brisk rate, and late in the evening reached a large town, 180 situate at the entrance of an extensive firth, or arm of the sea, which prevented my further progress eastward. Sleeping that night in the suburbs of the town, I departed early next morning in the direction of the south. A walk of about twenty miles brought me to another large town, 181 situated on a river, where I again turned towards the east. At the end of the town I was accosted by a fiery-faced individual, somewhat under the middle size, dressed as a recruiting sergeant.\n\u003cbr\u003e \n\u003cbr\u003e ‘Young man,’ said the recruiting sergeant, ‘you are just the kind of person to serve the Honourable East India Company.’\n\u003cbr\u003e \n\u003cbr\u003e ‘I had rather the Honourable Company should serve me,’ said I.\n\u003cbr\u003e \n\u003cbr\u003e ‘Of course, young man. Well, the Honourable East India Company shall serve you — that’s reasonable. Here, take this shilling; ‘t is service-money. The Honourable Company engages to serve you, and you the Honourable Company; both parties shall be thus served; that’s just and reasonable.’\n\u003cbr\u003e \n\u003cbr\u003e ‘And what must I do for the Company?’\n\u003cbr\u003e \n\u003cbr\u003e ‘Only go to India; that’s all.’\n\u003cbr\u003e \n\u003cbr\u003e ‘And what should I do in India?’\n\u003cbr\u003e \n\u003cbr\u003e ‘Fight, my brave boy! fight, my youthful hero!’\n\u003cbr\u003e \n\u003cbr\u003e ‘What kind of country is India?’\n\u003cbr\u003e \n\u003cbr\u003e ‘The finest country in the world! Rivers bigger than the Ouse! Hills higher than anything near Spalding! Trees — you never saw such trees! Fruits — you never saw such fruits!’\n\u003cbr\u003e \n\u003cbr\u003e ‘And the people — what kind of folk are they?’\n\u003cbr\u003e \n\u003cbr\u003e ‘Pah! Kauloes — blacks — a set of rascals not worth regarding.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Kauloes!’ said I; ‘blacks!’\n\u003cbr\u003e \n\u003cbr\u003e ‘Yes,’ said the recruiting sergeant; ‘and they call us lolloes, which in their beastly gibberish means reds.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Lolloes!’ said I; ‘reds!’\n\u003cbr\u003e \n\u003cbr\u003e ‘Yes,’ said the recruiting sergeant, ‘kauloes and lolloes; and all the lolloes have to do is to kick and cut down the kauloes, and take from them their rupees, which mean silver money. Why do you stare so?’\n\u003cbr\u003e \n\u003cbr\u003e ‘Why,’ said I, ‘this is the very language of Mr. Petulengro.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Mr. Pet —?’\n\u003cbr\u003e \n\u003cbr\u003e ‘Yes,’ said I, ‘and Tawno Chikno.’\n\u003cbr\u003e \n\u003cbr\u003e ‘Tawno Chik —? I say, young fellow, I don’t like your way of speaking; no, nor your way of looking. You are mad, sir; you are mad; and what’s this? Why your hair is grey! You won’t do for the Honourable Company — they like red. I’m glad I didn’t give you the shilling. Good day to you.’\n\u003cbr\u003e \n\u003cbr\u003e ‘I shouldn’t wonder,’ said I, as I proceeded rapidly along a broad causeway, in the direction of the east, ‘if Mr. Petulengro and Tawno Chikno came originally from India. I think I’ll go there.’\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1309/39513.html","bookId":1491,"creation":"Aug 5, 2019 3:13:15 AM","modification":"Aug 5, 2019 3:13:15 AM"}
