{"id":109262,"no":12,"title":"Page 12","content":"\u003cp\u003eHe lifted a brow at the tone, but said nothing. “Then I trust I’ll be comfortable enough until morning.”\u003c/p\u003e\n\u003cp\u003e“Just get out.” She pulled open the door to the rain. “I’ll call the cottage in the morning if I want to talk to you again.”\u003c/p\u003e\n\u003cp\u003e“A pleasure meeting you, Miss Concannon.” Though it wasn’t offered, he took her hand, held it while he looked into her eyes. “A greater one watching you work.” On an impulse that surprised both of them, he lifted her hand to his lips, lingered just a moment over the taste of her skin. “I’ll be back tomorrow.”\u003c/p\u003e\n\u003cp\u003e“Wait for an invitation,” she said, and closed the door smartly behind him.\u003c/p\u003e\n\u003cp\u003eChapter Four\u003c/p\u003e\n\u003cp\u003eAT Blackthorn Cottage, the scones were always warm, the flowers always fresh and the kettle always on the boil. Though it was early in the season for guests, Brianna Concannon made Rogan comfortable in her serenely efficient manner, as she had all the other guests she’s welcomed since that first summer after her father’s death.\u003c/p\u003e\n\u003cp\u003eShe served him tea in the tidy, polished parlor where a fire burned cheerfully and a vase full of freesia scented the air.\u003c/p\u003e\n\u003cp\u003e“I’ll be serving dinner at seven, if that suits you, Mr. Sweeney.” She was already thinking of ways to stretch the chicken she’d planned to cook so it would feed one more.\u003c/p\u003e\n\u003cp\u003e“That will be fine, Miss Concannon.” He sipped the tea and found it perfect, a far cry from the chilly, sugar-laden soft drink Maggie had tossed at him. “You have a lovely place here.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” It was, if not her only pride, perhaps her only joy. “If you need anything, anything at all, you’ve only to ask.”\u003c/p\u003e\n\u003cp\u003e“If I could make use of the phone?”\u003c/p\u003e\n\u003cp\u003e“Of course.” She started to step away to give him privacy, when he held up a hand, a signal of command to anyone who has served.\u003c/p\u003e\n\u003cp\u003e“The vase there on the table—your sister’s work?”\u003c/p\u003e\n\u003cp\u003eBrianna’s surprise at the question showed only in the quick widening of her eyes. “It is, yes. You know of Maggie’s work?”\u003c/p\u003e\n\u003cp\u003e“I do. I have two pieces myself. And I’ve just purchased another even as it was made.” He sipped his tea again, measuring Brianna. As different from Maggie as one piece of her work was from another. Which meant, he assumed, that they were the same somewhere beneath what the eye could see. “I’ve just come from her workshop.”\u003c/p\u003e\n\u003cp\u003e“You were in Maggie’s workshop?” Only true shock would have driven Brianna to ask a question of a guest with such a tone of disbelief. “Inside?”\u003c/p\u003e\n\u003cp\u003e“Is it so dangerous, then?”\u003c/p\u003e\n\u003cp\u003eA hint of a smile crossed Brianna’s face, lightening her features. “You seem to be alive and well.”\u003c/p\u003e\n\u003cp\u003e“Well enough. Your sister is an immensely talented woman.”\u003c/p\u003e\n\u003cp\u003e“That she is.”\u003c/p\u003e\n\u003cp\u003eRogan recognized the same undercurrent of pride and annoyance in the statement as he had when Maggie had spoken of her sister. “Do you have other pieces of hers?”\u003c/p\u003e\n\u003cp\u003e“A few. She brings them by when the mood strikes her. If you’ll not be needing anything else at the moment, Mr. Sweeney, I’ll see about dinner.”\u003c/p\u003e\n\u003cp\u003eAlone, Rogan settled back with his excellent tea. An interesting pair, he thought, the Concannon sisters. Brianna was taller, slimmer and certainly more lovely than Maggie. Her hair was rose gold rather than flame and fell in soft curls to her shoulders. Her eyes were a wide, pale green, almost translucent. Quiet, he thought, even a trifle aloof, like her manner. Her features were finer, her limbs softer, and she’d smelled of wildflowers rather than smoke and sweat.\u003c/p\u003e\n\u003cp\u003eAll in all she was much more the type of woman he found appealing.\u003c/p\u003e\n\u003cp\u003eYet he found his thoughts trailing back to Maggie with her compact body, her moody eyes and her uncertain temper. Artists, he mused, with their egos and insecurities, needed guidance, a firm hand. He let his gaze roam over the rose-colored vase with its swirls of glass from base to lip. He was very much looking forward to guiding Maggie Concannon.\u003c/p\u003e\n\u003cp\u003e“So, is he here?” Maggie slipped out of the rain into the warm, fragrant kitchen.\u003c/p\u003e\n\u003cp\u003eBrianna continued to peel potatoes. She’d been expecting the visit. “Who is he?”\u003c/p\u003e\n\u003cp\u003e“Sweeney.” Crossing to the counter, Maggie snatched a peeled carrot and bit in. “Tall, dark, handsome and rich as sin. You can’t miss him.”\u003c/p\u003e\n\u003cp\u003e“In the parlor. You can take in a cup and join him for tea.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to talk to him.” Maggie hitched herself up on the counter, crossed her ankles. “What I wanted, Brie, love, is your opinion of him.”\u003c/p\u003e\n\u003cp\u003e“He’s polite and well-spoken.”\u003c/p\u003e\n\u003cp\u003eMaggie rolled her eyes. “So’s an altar boy in church.”\u003c/p\u003e\n\u003cp\u003e“He’s a guest in my home—”\u003c/p\u003e\n\u003cp\u003e“A paying one.”\u003c/p\u003e\n\u003cp\u003e“And I’ve no intention,” Brianna went on without pause, “of gossiping about him behind his back.”\u003c/p\u003e\n\u003cp\u003e“Saint Brianna.” Maggie crunched down on the carrot, gestured with the stub of it. “What if I were to tell you that he’s after managing my career?”\u003c/p\u003e\n\u003cp\u003e“Managing?” Brianna’s hands faltered before they picked on the rhythm again. Peelings fell steadily on the newspaper she’d laid on the counter. “In what way?”\u003c/p\u003e\n\u003cp\u003e“Financially, to start. Displaying my work in his galleries and talking rich patrons into buying it for great sums of money.” She waved the remains of the carrot before finishing it off. “All the man can think about is making money.”\u003c/p\u003e\n\u003cp\u003e“Galleries,” Brianna repeated. “He owns art galleries?”\u003c/p\u003e\n\u003cp\u003e“In Dublin and Cork. He has interests in others in London and New York. Paris, too, I think. Probably Rome. Everybody in the art world knows Rogan Sweeney.”\u003c/p\u003e\n\u003cp\u003eThe art world was as removed from Brianna’s life as the moon. But she felt a quick, warm pride that her sister could claim it. “And he’s taken an interest in your work.”\u003c/p\u003e\n\u003cp\u003e“Stuck his aristocrat’s nose in is what he’s done.” Maggie snorted. “Calling me on the phone, sending letters, all but demanding rights to everything I make. Now today, he pops up on my doorstep, telling me that I need him. Hah.”\u003c/p\u003e\n\u003cp\u003e“And, of course, you don’t.”\u003c/p\u003e\n\u003cp\u003e“I don’t need anyone.”\u003c/p\u003e\n\u003cp\u003e“You don’t, no.” Brianna carried the vegetables to the sink to rinse. “Not you, Margaret Mary.” \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-12.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
