{"id":109263,"no":13,"title":"Page 13","content":"\u003cp\u003e“Oh, I hate that tone, all cold and superior. You sound just like Mother.” She slid off the counter to stalk to the refrigerator. And because of it, she was swamped with guilt. “We’re getting along well enough,” she added as she pulled out a beer. “The bills are paid, there’s food on the table and a roof over all our heads.” She stared at her sister’s stiff back and let out a sound of impatience. “It can’t be what it once was, Brie.”\u003c/p\u003e\n\u003cp\u003e“You think I don’t know that?” Brianna’s lilting voice turned edgy. “Do you think I have to have more? That I can’t be content with what is?” Suddenly unbearably sad, she stared out the window toward the fields beyond. “It’s not me, Maggie. ’Tisn’t me.”\u003c/p\u003e\n\u003cp\u003eMaggie scowled down at her beer. It was Brianna who suffered, Maggie knew. Brianna who had always been in the middle. Now, Maggie thought, she had the chance to change that. All she had to do was sell part of her soul.\u003c/p\u003e\n\u003cp\u003e“She’s been complaining again.”\u003c/p\u003e\n\u003cp\u003e“No.” Brianna tucked a stray hair away in the knot at the nape of her neck. “Not really.”\u003c/p\u003e\n\u003cp\u003e“I can tell by the look on your face she’s been in one of her moods—and taking it out on you.” Before Brianna could speak, Maggie waved a hand. “She’ll never be happy, Brianna. You can’t make her happy. The good Lord knows I can’t. She’ll never forgive him for being what he was.”\u003c/p\u003e\n\u003cp\u003e“And what was he?” Brianna demanded as she turned around. “Just what was our father, Maggie?”\u003c/p\u003e\n\u003cp\u003e“Human. Flawed.” She set her beer down and walked to her sister. “Wonderful. Do you remember, Brie, the time he bought the mule, and was going to make a fortune having tourists snap pictures of it in a peaked cap with our old dog sitting on its back?”\u003c/p\u003e\n\u003cp\u003e“I remember.” Brie would have turned away, but Maggie grabbed her hands. “And I remember he lost more money feeding that cursed, bad-tempered mule than he ever did with his scheming.”\u003c/p\u003e\n\u003cp\u003e“Oh, but it was fun. We went to the Cliffs of Mohr, and it was such a bright summer day. The tourists swarming about and the music playing. And there was Da holding that stupid mule, and that poor old dog, Joe, as terrified of that mule as he would have been of a roaring lion.”\u003c/p\u003e\n\u003cp\u003eBrianna softened. She couldn’t help it. “Poor Joe sitting and shivering with fear on that mule’s back. Then that German came along, wanting a picture of himself with Joe and the mule.”\u003c/p\u003e\n\u003cp\u003e“And the mule kicked.” Maggie grinned and picked up her beer again for a toast. “And the German screamed in three different languages while he hopped about on one foot. And Joe, terrified, leaped off and landed right on a display of lace collars, and the mule ran, scattering tourists. Oh, what a sight. People shouting and running, ladies screaming. There was a fiddler there, remember? And he just kept playing a reel as if we’d all start dancing any moment.”\u003c/p\u003e\n\u003cp\u003e“And that nice boy from Killarney caught the mule’s lead and dragged him back. Da tried to sell him the mule there and then.”\u003c/p\u003e\n\u003cp\u003e“And nearly did. It’s a good memory, Brie.”\u003c/p\u003e\n\u003cp\u003e“He made many memories worth laughing over. But you can’t live on laughter alone.”\u003c/p\u003e\n\u003cp\u003e“And you can’t live without it, as she would. He was alive. Now it seems this family’s more dead than he is.”\u003c/p\u003e\n\u003cp\u003e“She’s ill,” Brianna said shortly.\u003c/p\u003e\n\u003cp\u003e“As she has been for more than twenty years. And ill she’ll stay as long as she has you to tend to her hand and foot.”\u003c/p\u003e\n\u003cp\u003eIt was true, but knowing the truth didn’t change Brianna’s heart. “She’s our mother.”\u003c/p\u003e\n\u003cp\u003e“That she is.” Maggie drained the beer and set it aside. The yeasty taste warred with the bitterness on her tongue. “I’ve sold another piece. I’ll have money for you by the end of the month.”\u003c/p\u003e\n\u003cp\u003e“I’m grateful for it. So is she.”\u003c/p\u003e\n\u003cp\u003e“The hell she is.” Maggie looked into her sister’s eyes with all the passion and anger and hurt boiling beneath. “I don’t do it for her. When there’s enough you’ll hire a nurse and you’ll move her into her own place.”\u003c/p\u003e\n\u003cp\u003e“That isn’t necessary—”\u003c/p\u003e\n\u003cp\u003e“It is,” Maggie interrupted. “That was the agreement, Brie. I’ll not stand by and watch you dance to her tune for the rest of her life. A nurse and a place in the village.”\u003c/p\u003e\n\u003cp\u003e“If that’s what she wants.”\u003c/p\u003e\n\u003cp\u003e“That’s what she’ll have.” Maggie inclined her head. “She kept you up last night.”\u003c/p\u003e\n\u003cp\u003e“She was restless.” Embarrassed, Brianna turned back to prepare the chicken. “One of her headaches.”\u003c/p\u003e\n\u003cp\u003e“Ah, yes.” Maggie remembered her mother’s headaches well, and how well timed they could be. An argument Maeve was losing: instant headache. A family outing she didn’t approve of: the throbbing began.\u003c/p\u003e\n\u003cp\u003e“I know what she is, Maggie.” Brianna’s own head began to ache. “That doesn’t make her less of my mother.”\u003c/p\u003e\n\u003cp\u003eSaint Brianna, Maggie thought again, but with affection. Her sister might be younger than her own twenty-eight by a year, but it had always been Brianna who took responsibility. “And you can’t change what you are, Brie.” Maggie gave her sister a fierce hug. “Da always said you’d be the good angel and I the bad. He was finally right about something.” She closed her eyes a moment. “Tell Mr. Sweeney to come by the cottage in the morning. I’ll speak with him.”\u003c/p\u003e\n\u003cp\u003e“You’ll let him manage you, then?”\u003c/p\u003e\n\u003cp\u003eThe phrase had Maggie wincing. “I’ll speak with him,” she repeated, and headed back into the rain.\u003c/p\u003e\n\u003cp\u003eIf Maggie had a weakness, it was family. That weakness had kept her up late into the night and had awakened her early in the chill, murky dawn. To the outside world she preferred to pretend she had responsibilities only to herself and her art, but beneath the facade was a constant love of family, and the dragging, often bitter obligations that went with it.\u003c/p\u003e\n\u003cp\u003eShe wanted to refuse Rogan Sweeney, first on principle. Art and business, to her mind, could not and should not mix. She wanted to refuse him secondly because his type—wealthy, confident and blue-blooded—irritated her. Thirdly, and most telling, she wanted to refuse him because to do otherwise was an admission that she lacked the skill to handle her affairs alone.\u003c/p\u003e\n\u003cp\u003eOh, that was a pill that stuck bitterly in her throat. \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-13.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
