{"id":109266,"no":16,"title":"Page 16","content":"\u003cp\u003e“It’ll add to the mystery, won’t it?”\u003c/p\u003e\n\u003cp\u003eShe very nearly grinned before she recovered. “I’ll not be after dressing up like some fashion plate for showings—if I come at all.”\u003c/p\u003e\n\u003cp\u003eThis time he tucked his tongue firmly in his cheek. “I’m sure your sense of style will reflect your artistic nature.”\u003c/p\u003e\n\u003cp\u003eIt might have been an insult, but she couldn’t be sure. “And I won’t be nice to people if I don’t want to be.”\u003c/p\u003e\n\u003cp\u003e“Temperament, again artistic.” He toasted her with his tea. “Should add to sales.”\u003c/p\u003e\n\u003cp\u003eThough she was amused, she sat back and crossed her arms over her chest. “I will never, never duplicate a piece or create something out of someone else’s fancy.”\u003c/p\u003e\n\u003cp\u003eHe frowned, shook his head. “That may be a deal breaker. I had this idea for a unicorn, with a touch of gold leaf on the horn and hooves. Very tasteful.”\u003c/p\u003e\n\u003cp\u003eShe snickered, then gave up and laughed out loud. “All right, Rogan. Maybe by some miracle we’ll be able to work together. How do we do it?”\u003c/p\u003e\n\u003cp\u003e“I’ll have contracts drawn up. Worldwide will want exclusive rights to your work.”\u003c/p\u003e\n\u003cp\u003eShe winced at that. It felt as though she were surrendering a part of herself. Perhaps the best part. “Exclusive rights to the pieces I choose to sell.”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eShe looked past him, out the window toward the fields beyond. Once, long ago, they, like her art, had felt like part of her. Now they were just part of a lovely view. “What else?”\u003c/p\u003e\n\u003cp\u003eHe hesitated. She looked almost unbearably sad. “It won’t change what you do. It won’t change who you are.”\u003c/p\u003e\n\u003cp\u003e“You’re wrong,” she murmured. With an effort, she shook off the mood and faced him again. “Go on. What else?”\u003c/p\u003e\n\u003cp\u003e“I’ll want a show, within two months, at the Dublin gallery. Naturally, I’ll need to see what you have finished, and I’ll arrange for shipping. I’ll also need you to keep me apprised of what you’ve completed over the next few weeks. We’ll price the pieces, and whatever inventory is left after the show will be displayed in Dublin and our other galleries.”\u003c/p\u003e\n\u003cp\u003eShe took a long, calming breath. “I’d appreciate it, if you’d not refer to my work as inventory. At least in my presence.”\u003c/p\u003e\n\u003cp\u003e“Done.” He steepled his fingers. “You will, of course, be sent a complete itemization of pieces sold. You may, if you choose, have some input as to which ones we photograph for our catalog. Or you can leave it up to us.”\u003c/p\u003e\n\u003cp\u003e“And how and when am I paid?” she wanted to know.\u003c/p\u003e\n\u003cp\u003e“I can buy the pieces outright. I have no objection to that since I have confidence in your work.”\u003c/p\u003e\n\u003cp\u003eShe remembered what he’d said before, about getting twice as much as what he’d paid her for the sculpture she’d just finished. She might not have been a businesswoman, but she wasn’t a fool.\u003c/p\u003e\n\u003cp\u003e“How else do you handle it?”\u003c/p\u003e\n\u003cp\u003e“By commission. We take the piece, and when and if we sell it, we deduct a percentage.”\u003c/p\u003e\n\u003cp\u003eMore of a gamble, she mused. And she preferred a gamble. “What percentage do you take?”\u003c/p\u003e\n\u003cp\u003eHoping for a reaction, he kept his eyes level with hers. “Thirty-five percent.”\u003c/p\u003e\n\u003cp\u003eShe made a strangled sound in her throat. “Thirty-five? Thirty-five? You thief. You robber.” She shoved back from the table and stood. “You’re a vulture, Rogan Sweeney. Thirty-five percent be damned and you with it.”\u003c/p\u003e\n\u003cp\u003e“I take all the risks, I have all the expenses.” He spread his hands, steepled them again. “You have merely to create.”\u003c/p\u003e\n\u003cp\u003e“Oh, as if all it takes is sitting on me ass and waiting for the inspiration to come fluttering down like raindrops. You know nothing, nothing about it.” She began to pace again, swirling the air with temper and energy. “I’ll remind you, you’d have nothing to sell without me. And it’s my work, my sweat and blood that they’ll spend good money for. You’ll get fifteen percent.”\u003c/p\u003e\n\u003cp\u003e“I’ll get thirty.”\u003c/p\u003e\n\u003cp\u003e“Plague take you, Rogan, for a horse thief. Twenty.”\u003c/p\u003e\n\u003cp\u003e“Twenty-five.” He rose then to stand toe to toe with her. “Worldwide will earn a quarter of your sweat and blood, Maggie, I promise you.”\u003c/p\u003e\n\u003cp\u003e“A quarter.” She hissed through her teeth. “That’s a businessman for you, preying on art.”\u003c/p\u003e\n\u003cp\u003e“And making the artist financially secure. Think of it, Maggie. Your work will be seen in New York, in Rome and Paris. And no one who sees it will forget it.”\u003c/p\u003e\n\u003cp\u003e“Oh, it’s clever you are, Rogan, taking a quick turn from money into fame.” She scowled at him then stuck out her hand. “The hell with it and you, you’ll have your twenty-five percent.”\u003c/p\u003e\n\u003cp\u003eWhich was exactly what he’d planned on. He took her hand, held it. “We’re going to do well together, Maggie.”\u003c/p\u003e\n\u003cp\u003eWell enough, she hoped, to settle her mother in the village and away from Blackthorn Cottage. “If we don’t, Rogan, I’ll see that you pay for it.”\u003c/p\u003e\n\u003cp\u003eBecause he’d enjoyed the taste of her, he lifted her hand to his lips. “I’ll risk it.”\u003c/p\u003e\n\u003cp\u003eHis lips lingered there long enough to make her pulse stutter. “If you were going to try to seduce me, you’d have been smarter to start before we had a deal.”\u003c/p\u003e\n\u003cp\u003eThe statement both surprised and annoyed him. “I prefer to keep personal and professional matters separate.”\u003c/p\u003e\n\u003cp\u003e“Another difference between us.” It pleased her to see she’d scratched the seamlessly polite exterior. “My personal and professional lives are always fusing. And I indulge both when the whim strikes.” Smiling, she slipped her hand from his. “It hasn’t as yet—personally speaking. I’ll let you know if and when it does.”\u003c/p\u003e\n\u003cp\u003e“Are you baiting me, Maggie?”\u003c/p\u003e\n\u003cp\u003eShe stopped as if thinking it through. “No, I’m explaining to you. Now I’ll take you to the glass house so you can choose what you want shipped to Dublin.” She turned to pull a jacket from a peg by the back door. “You might want your coat. It’d be a shame to get that fancy suit wet.”\u003c/p\u003e\n\u003cp\u003eHe stared at her a moment, wondering why he should feel so completely insulted. Without a word he turned on his heel and strode back into the living room for his coat.\u003c/p\u003e\n\u003cp\u003eMaggie took the opportunity to step outside and cool her blood in the chilly rain. Ridiculous, she told herself, to get so sexually tied up over having her hand kissed. Rogan Sweeney was smooth, too smooth. It was a fortunate thing he lived on the other side of the country. More fortunate yet, he wasn’t her type. \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-16.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
