{"id":109274,"no":24,"title":"Page 24","content":"\u003cp\u003e“Did you now?” If he was hoping for a blush or stutter, he’d be disappointed. “I’ll have to thank you.”\u003c/p\u003e\n\u003cp\u003e“You slept like a stone. At one point I nearly held a mirror up to your lips to be certain you were alive.” She was certainly alive now, vibrant in the lamplight. “Do you want a brandy?”\u003c/p\u003e\n\u003cp\u003e“Better not, before I’ve eaten.”\u003c/p\u003e\n\u003cp\u003eHe rose, went to a sideboard and poured a single snifter from a decanter. “You were upset before we left.”\u003c/p\u003e\n\u003cp\u003eShe cocked her head. “Now, that’s a fine and diplomatic way of phrasing it.” The weeping spell didn’t embarrass her. It was simply emotion, passion, as real and as human as laughter or lust. But she remembered that he had held her hand and had offered no useless words to stem the storm. “I’m sorry if I made you uncomfortable.”\u003c/p\u003e\n\u003cp\u003eShe had, miserably, but he shrugged it off. “You didn’t want to talk about it.”\u003c/p\u003e\n\u003cp\u003e“Didn’t, and don’t.” She took a quiet breath because her voice had been sharp. He didn’t deserve such rudeness after his kindness. “It’s nothing to do with you, Rogan, just old family miseries. Since I’m feeling mellow, I’ll tell you it was comforting to have you hold my hand. I didn’t think you were the type to offer.”\u003c/p\u003e\n\u003cp\u003eHis eyes flicked back to hers. “It seems to me we don’t know each other well enough to generalize.”\u003c/p\u003e\n\u003cp\u003e“I’ve always considered myself a quick and accurate judge, but you may be right. So tell me”—she propped an elbow on the arm of the chair, cocked her chin on her fist—“who are you, Rogan Sweeney?”\u003c/p\u003e\n\u003cp\u003eHe was relieved when the need to answer was postponed by the arrival of her dinner. A tidy, uniformed maid wheeled in a tray, settling it in front of Maggie with no more than a whisper of sound and a jingle of silverware. She bobbed once when Maggie thanked her, then disappeared the moment Rogan told her that would be all.\u003c/p\u003e\n\u003cp\u003e“Ah, what a scent.” Maggie attacked the soup first, a rich, thick broth swimming with chunks of vegetables. “Do you want some?”\u003c/p\u003e\n\u003cp\u003e“No, I’ve eaten.” Rather than go back around the desk, he sat in the chair beside hers. It was oddly cozy, he realized, to sit with her while she ate and the house seemed to settle quietly around them. “Since you’re back among the living, perhaps you’d like to go by the gallery in the morning.”\u003c/p\u003e\n\u003cp\u003e“Umm.” She nodded, her mouth full of crusty roll. “When?”\u003c/p\u003e\n\u003cp\u003e“Eight—I have appointments midmorning, but I can take you in and leave a car at your disposal.”\u003c/p\u003e\n\u003cp\u003e“A car at my disposal.” Tickled, she pressed a fist to her mouth as she laughed. “Oh, I could get used to that quick enough. And what would I do with the car at my disposal?”\u003c/p\u003e\n\u003cp\u003e“What you like.” God knew why her reaction annoyed him, but it did. “Or you can wander around Dublin on foot, if you prefer.”\u003c/p\u003e\n\u003cp\u003e“A bit touchy this evening, are we?” She moved from the soup to the entrée of honeyed chicken. “Your cook’s a treasure, Rogan. Do you think I can charm this recipe out of him—or her—for Brie?”\u003c/p\u003e\n\u003cp\u003e“Him,” Rogan said. “And you’re welcome to try. He’s French, insolent and given to tantrums.”\u003c/p\u003e\n\u003cp\u003e“Then we have all but nationality in common. Tell me, will I be moving to a hotel tomorrow?”\u003c/p\u003e\n\u003cp\u003eHe’d thought about that, a great deal. It would certainly be more comfortable for him if she were tucked away in a suite at the Westbury. More comfortable, he thought, and much more dull. “You’re welcome to stay in the guest room if it suits you.”\u003c/p\u003e\n\u003cp\u003e“It suits me down to the ground.” She studied him as she speared a tiny new potato. He looked relaxed here, she realized. Very much the complacent king of the castle. “Is it just you in this big house?”\u003c/p\u003e\n\u003cp\u003e“It is.” He lifted a brow. “Does that worry you?”\u003c/p\u003e\n\u003cp\u003e“Worry me? Oh, you mean because you might come knocking on my door one lustful night?” She chuckled, infuriating him. “I’m able to say yes or no, Rogan, the same as you would be if I came knocking on yours. I only asked because it seems a lot of room for one man.”\u003c/p\u003e\n\u003cp\u003e“It’s my family home,” he said stiffly. “I’ve lived here all my life.”\u003c/p\u003e\n\u003cp\u003e“And a fine place it is.” She pushed the tray back and rose to go to the small sideboard. Lifting the top of a decanter, she sniffed. Sighed at the fine scent of Irish whiskey. After pouring herself a glass, she came back and curled up her legs. “Sláinte,” she said, and tossed the whiskey back. It set a good, strong fire kindling in her gut.\u003c/p\u003e\n\u003cp\u003e“Would you like another?”\u003c/p\u003e\n\u003cp\u003e“One’ll do me. One warms the soul, two warms the brain, my father often said. I’m in the mood for a cool head.” She set the empty glass on the tray, shifted her body more comfortably. Her frayed flannel robe slid open at the curve of her knee. “You haven’t answered my question.”\u003c/p\u003e\n\u003cp\u003e“Which was?”\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003e“I’m a businessman, as you remind me with regularity.” He settled back, making a determined effort not to let his mind or his gaze wander to her bare legs. “Third generation. Born and bred in Dublin, with love and respect for art nurtured in me from the cradle.”\u003c/p\u003e\n\u003cp\u003e“And that love and respect was augmented by the idea of making a profit.”\u003c/p\u003e\n\u003cp\u003e“Precisely.” He swirled his brandy, sipped, and looked exactly like what he was. A man comfortable with his own wealth and content with his life. “While making a profit brings its own sense of satisfaction, there’s another, more spiritual satisfaction that comes from developing and promoting a new artist. Particularly one you believe in passionately.”\u003c/p\u003e\n\u003cp\u003eMaggie touched her tongue to her top lip. He was entirely too confident, she decided, much too sure of himself and his place in the world. All that tidy certainty begged for a bit of shaking.\u003c/p\u003e\n\u003cp\u003e“So, I’m here to satisfy you, Rogan?”\u003c/p\u003e\n\u003cp\u003eHe met her amused eyes, nodded. “I have no doubt you will, Maggie, eventually. On every level.”\u003c/p\u003e\n\u003cp\u003e“Eventually.” She hadn’t meant, really, to steer them onto this boggy ground, but it seemed irresistible, sitting with him in the quiet room with her body so rested, her mind so alert. “Your choice of time and place, then?”\u003c/p\u003e\n\u003cp\u003e“It’s traditional, I believe, for the man to choose when to advance.” \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-24.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
