{"id":109277,"no":27,"title":"Page 27","content":"\u003cp\u003eShe hadn’t been expecting quite that reaction. But that didn’t mean she couldn’t enjoy it. She could meet him on even ground when he wasn’t quite so controlled, quite so skillful. Her head might have spun, but the sensation of power remained. No seduction here, only raw needs, rubbing together like live wires and threatening to flare.\u003c/p\u003e\n\u003cp\u003eHe dragged her head back and plundered her mouth. Just once, he promised himself. Only once to relieve some of this vicious tension that coiled inside him like a snake.\u003c/p\u003e\n\u003cp\u003eBut kissing her didn’t relieve it. Instead, the complete and eager response of her, the total verve of it, wrapped his tension only tighter until he couldn’t breathe.\u003c/p\u003e\n\u003cp\u003eFor a moment he felt as though he were being sucked into some velvet-lined, airless tunnel. And he was terrified that he’d never want or need light again.\u003c/p\u003e\n\u003cp\u003eHe jerked away, fastened his hands like vises on the wheel. He eased back onto the road like a drunk trying to negotiate a straight line.\u003c/p\u003e\n\u003cp\u003e“I’m assuming that was an answer to something.” Her voice was unnaturally quiet. It wasn’t his kiss that had unnerved her nearly as much as the way he had ended it.\u003c/p\u003e\n\u003cp\u003e“It was that or throttle you.”\u003c/p\u003e\n\u003cp\u003e“I prefer being kissed to strangled. Still, I’d like it better if you weren’t angry about wanting me.”\u003c/p\u003e\n\u003cp\u003eHe was calmer now, concentrating on the road and making up the time she’d cost him that morning. “I explained myself before. The timing’s inappropriate.”\u003c/p\u003e\n\u003cp\u003e“Inappropriate. And who’s in charge of propriety?”\u003c/p\u003e\n\u003cp\u003e“I prefer knowing whom I’m sleeping with. Having some mutual affection and respect.”\u003c/p\u003e\n\u003cp\u003eHer eyes narrowed. “There’s a long way between a kiss on the lips and a tumble in the sheets, Sweeney. I’ll have you know I’m not one to leap onto the mattress at the blink of an eye.”\u003c/p\u003e\n\u003cp\u003e“I never said—”\u003c/p\u003e\n\u003cp\u003e“Oh, didn’t you, now?” She was all the more insulted because she knew how quickly she would have leaped onto a mattress with him. “As far as I can see, you’ve decided I’m plenty loose enough. Well, I won’t be explaining my past history to you. And as for affection and respect, you’ve yet to earn them from me, boy-o.”\u003c/p\u003e\n\u003cp\u003e“Fine, then. We’re agreed.”\u003c/p\u003e\n\u003cp\u003e“We’re agreed you can go straight to hell. And your maid’s name is Noreen.”\u003c/p\u003e\n\u003cp\u003eThat distracted him enough to have him taking his eyes off the road and staring. “What?”\u003c/p\u003e\n\u003cp\u003e“Your maid, you dolt, you narrow-nosed aristocrat. ’Tisn’t Nancy. It’s Noreen.” Maggie folded her arms and stared resolutely out the side window.\u003c/p\u003e\n\u003cp\u003eRogan only shook his head. “I’m grateful to you for clearing that up. God knows what an embarrassment it would have been to me if I’d had to introduce her to the neighbors.”\u003c/p\u003e\n\u003cp\u003e“Blue-blooded snob,” she muttered.\u003c/p\u003e\n\u003cp\u003e“Wasp-tongued viper.”\u003c/p\u003e\n\u003cp\u003eThey settled into an angry silence for the rest of the drive.\u003c/p\u003e\n\u003cp\u003eChapter Seven\u003c/p\u003e\n\u003cp\u003eIT was impossible not to be impressed by Worldwide Gallery, Dublin. The architecture alone was worth a visit to the place. Indeed, photographs of the building had appeared in dozens of magazines and art books around the world as a shining example of the Georgian style that was part of Dublin’s architectural legacy.\u003c/p\u003e\n\u003cp\u003eThough Maggie had seen it reproduced in glossy pages, the sight of it, the sheer grandeur of it in three dimensions, took her breath away.\u003c/p\u003e\n\u003cp\u003eShe’d spent hours of her free time during her apprenticeship in Venice haunting galleries. But nothing compared in splendor with Rogan’s.\u003c/p\u003e\n\u003cp\u003eYet she made no comment at all while he unlocked the imposing-looking front doors and gestured her inside.\u003c/p\u003e\n\u003cp\u003eShe had to resist the urge to genuflect, such was the churchlike quiet, the play of light, the scented air in the main room. The Native American display was beautifully and carefully mounted—the pottery bowls, the gorgeous baskets, the ritual masks, shaman rattles and beadwork. On the walls were drawings at once primitive and sophisticated. Maggie’s attention and her admiration focused on a buckskin dress the color of cream, adorned with beads and smooth, bright stones. Rogan had ordered it hung like a tapestry. Maggie’s fingers itched to touch.\u003c/p\u003e\n\u003cp\u003e“Impressive” was all she said.\u003c/p\u003e\n\u003cp\u003e“I’m delighted you approve.”\u003c/p\u003e\n\u003cp\u003e“I’ve never seen American Indian work outside of books and such.” She leaned over a water vessel.\u003c/p\u003e\n\u003cp\u003e“That’s precisely why I wanted to bring the display to Ireland. We too often focus on European history and culture and forget there’s more to the world.”\u003c/p\u003e\n\u003cp\u003e“Hard to believe people who could create this would be the savages we see in those old John Wayne movies. Then again”—she smiled as she straightened—“my ancestors were savage enough, stripping naked and painting themselves blue before they screamed into battle. I come from that.” She tilted her head to study him, the perfectly polished businessman. “We both do.”\u003c/p\u003e\n\u003cp\u003e“One could say that such tendencies become more diluted in some than in others over the centuries. I haven’t had the urge to paint myself blue in years.”\u003c/p\u003e\n\u003cp\u003eShe laughed, but he was already checking his watch again.\u003c/p\u003e\n\u003cp\u003e“We’re using the second floor for your work.” He started toward the stairs.\u003c/p\u003e\n\u003cp\u003e“For any particular reason?”\u003c/p\u003e\n\u003cp\u003e“For several particular reasons.” Impatience shimmering like a wave of heat around him, he paused until she joined him on the staircase. “I prefer a show like this to have some sense of a social occasion. People tend to appreciate art, at least feel it’s more accessible, if they’re relaxed and enjoying themselves.” He stopped at the top of the steps, lifting a brow at her expression. “You’ve a problem with that?”\u003c/p\u003e\n\u003cp\u003e“I’d like people to take my work seriously, not think of it as a party favor.”\u003c/p\u003e\n\u003cp\u003e“I assure you, they’ll take it seriously.” Particularly with the prices he’d decided to demand for it, the strategy he intended to employ. “And the marketing of your work is, after all, my province.” He turned, sliding open double pocket doors, then stepped back so that Maggie could enter first.\u003c/p\u003e\n\u003cp\u003eShe quite simply lost her voice. The wonderfully enormous room was flooded with light from the domed central skylight above. It poured down over the dark, polished floor and tossed back stunning reflections, almost mirrorlike, of the work Rogan had chosen to display. \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-27.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
