{"id":109285,"no":37,"title":"Page 37","content":"\u003cp\u003eThe emotional force of the statement more than the words caused Rogan to study her curiously. “I’m aware of that.”\u003c/p\u003e\n\u003cp\u003e“You can’t be. Not really, for you’ve never known any different.” She took a deep breath. “Well.” There were eyes on her already, dozens of them, bright with curiosity. “It’s into the lions’ den, isn’t it? You needn’t worry,” she said before he could speak. “I’ll behave. My future depends on it.”\u003c/p\u003e\n\u003cp\u003e“This is only the beginning, Margaret Mary.”\u003c/p\u003e\n\u003cp\u003eAs he drew her into the room with its whirl of light and color, she was very much afraid he was right.\u003c/p\u003e\n\u003cp\u003eBut behave she did. The evening seemed to go well as she shook hands, accepted compliments, answered questions. The first hour seemed to float by like a dream, what with the sparkle of wine, the glitter of glass and the flash of jewels. Drifting through it was easy, as Maggie felt slightly removed from the reality, somewhat disconnected, as much audience as actor in a sumptuously produced play.\u003c/p\u003e\n\u003cp\u003e“This, ah this.” A bald man with a drooping mustache and a fussy British accent expounded on a piece. It was a series of glowing blue spears trapped within a sheer glass globe. “Imprisoned, you call it. Your creativity, your sexuality, fighting to set itself free. Man’s eternal struggle, after all. It’s triumphant, even as it’s melancholy.”\u003c/p\u003e\n\u003cp\u003e“It’s the six counties,” Maggie said simply.\u003c/p\u003e\n\u003cp\u003eThe bald man blinked. “I beg your pardon.”\u003c/p\u003e\n\u003cp\u003e“The six counties of Ireland,” she repeated with a wicked rebel gleam in her eyes. “Imprisoned.”\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003eStanding beside this would-be critic, Joseph muffled a laugh. “I found the use of color here so striking, Lord Whitfield. The translucence of it creates an unresolved tension between its delicacy and its boldness.”\u003c/p\u003e\n\u003cp\u003e“Just so.” Lord Whitfield nodded, cleared his throat. “Quite extraordinary. Excuse me.”\u003c/p\u003e\n\u003cp\u003eMaggie watched him retreat with a broad smile. “Well, I don’t think he’ll be after buying it and setting it in his den, do you, Joseph?”\u003c/p\u003e\n\u003cp\u003e“You’re a wicked woman, Maggie Concannon.”\u003c/p\u003e\n\u003cp\u003e“I’m an Irishwoman, Joseph.” She winked at him. “Up the rebels.”\u003c/p\u003e\n\u003cp\u003eHe laughed delightedly and, slipping an arm around her waist, led her around the room. “Ah, Mrs. Connelly.” Joseph gave Maggie a subtle squeeze to signal her. “Looking stunning as always.”\u003c/p\u003e\n\u003cp\u003e“Joseph, always a smooth word. And this—” Anne Connelly shifted her attention from Joseph, whom she considered a mere factotum to Maggie. “This is the creative drive. I’m thrilled to meet you, my dear. I’m Mrs. Dennis Connelly—Anne. I believe you met my daughter, Patricia, yesterday.”\u003c/p\u003e\n\u003cp\u003e“I did, yes.” Maggie found Anne’s handclasp as delicate and soft as a brush of satin.\u003c/p\u003e\n\u003cp\u003e“She must be off with Rogan somewhere. They’re a lovely couple, aren’t they?”\u003c/p\u003e\n\u003cp\u003e“Very.” Maggie lifted a brow. She knew a warning when she heard one. “Do you live in Dublin, Mrs. Connelly?”\u003c/p\u003e\n\u003cp\u003e“I do indeed. Only a few houses away from the Sweeney mansion. My family has been a part of Dublin society for generations. And you’re from the west counties?”\u003c/p\u003e\n\u003cp\u003e“Clare, yes.”\u003c/p\u003e\n\u003cp\u003e“Lovely scenery. All those charming quaint villages and thatched roofs. Your family are farmers, I’m told?” Anne lifted a brow, obviously amused.\u003c/p\u003e\n\u003cp\u003e“Were.”\u003c/p\u003e\n\u003cp\u003e“This must be so exciting for you, particularly with your rural upbringing. I’m sure you’ve enjoyed your visit to Dublin. You’ll be going back soon?”\u003c/p\u003e\n\u003cp\u003e“Very soon, I think.”\u003c/p\u003e\n\u003cp\u003e“I’m sure you miss the country. Dublin can be very confusing to one unused to city life. Almost like a foreign land.”\u003c/p\u003e\n\u003cp\u003e“At least I understand the language,” Maggie said equably. “I hope you’ll enjoy your evening, Mrs. Connelly. Excuse me, won’t you?”\u003c/p\u003e\n\u003cp\u003eAnd if Rogan thought he would sell that woman anything that Maggie Concannon created, Maggie thought as she walked away, he’d hang for it.\u003c/p\u003e\n\u003cp\u003eExclusive rights be damned. She’d smash every last piece into dust before she saw any in Anne Connelly’s hands. Talking to her as though she were some slack-jawed milkmaid with straw in her hair.\u003c/p\u003e\n\u003cp\u003eShe held her temper back as she made her way out of the ballroom and toward one of the sitting rooms. Each was crowded with people, talking, sitting, laughing, discussing her. Her head began to throb as she marched down the stairs. She’d get herself a beer out of the kitchen, she decided, and have a few minutes of peace.\u003c/p\u003e\n\u003cp\u003eShe strode straight in, only to come up short when she saw a portly man puffing on a cigar and nursing a pilsner.\u003c/p\u003e\n\u003cp\u003e“Caught,” he said, and grinned sheepishly.\u003c/p\u003e\n\u003cp\u003e“That makes two of us then. I was coming down for a quiet beer myself.”\u003c/p\u003e\n\u003cp\u003e“Let me fetch you one.” Gallantly, he heaved his bulk out of the chair and pulled a bottle out for her. “You don’t want me to put out the cigar, do you?”\u003c/p\u003e\n\u003cp\u003eThe plea in his voice made her laugh. “Not at all. My father used to smoke the world’s worst pipe. Stunk to high heaven. I loved it.”\u003c/p\u003e\n\u003cp\u003e“There’s a lass.” He found her a beer and a glass. “I hate these things.” He jerked his thumb toward the ceiling. “M’wife drags me.”\u003c/p\u003e\n\u003cp\u003e“I hate them, too.”\u003c/p\u003e\n\u003cp\u003e“Pretty enough work, I suppose,” he said as she drank. “Like the colors and shapes. Not that I know a damn thing about it. Wife’s the expert. But I liked the look of it, and that should be enough, I’d say.”\u003c/p\u003e\n\u003cp\u003e“And I.”\u003c/p\u003e\n\u003cp\u003e“Everyone’s always trying to explain it at these blasted affairs. What the artist had in mind and such. Symbolism.” He rolled his tongue over the word as if it were a strange dish he wasn’t quite ready to sample. “Don’t know what the devil they’re talking about.”\u003c/p\u003e\n\u003cp\u003eMaggie decided the man was half-potted and that she loved him. “Neither do they.”\u003c/p\u003e\n\u003cp\u003e“That’s it!” He raised his glass and drank deeply. “Neither do they. Just blustering. But if I was to say that to Anne—that’s my wife—she’d give me one of those looks.”\u003c/p\u003e\n\u003cp\u003eHe narrowed his eyes, lowered his brows and scowled. Maggie hooted with laughter.\u003c/p\u003e\n\u003cp\u003e“Who cares what they think anyway?” Maggie propped her elbow on the table and held a fist to her chin. “It’s not as if anyone’s life depended on it.” Except mine, she thought, and pushed the idea away. “Don’t you think affairs like this are just an excuse for people to get all dressed up and act important?” \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-37.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
