{"id":109299,"no":51,"title":"Page 51","content":"\u003cp\u003e“I’ve only one priority at the moment.” Her hands cruised up his chest, crushing wildflowers petals against his skin. “I’m going to have you now, Rogan.” Her laugh came again, low and challenging, before her lips sank into his. “Go ahead, fight me off.”\u003c/p\u003e\n\u003cp\u003eHe hadn’t meant to touch her. That was his last coherent thought before his hands streaked up and filled themselves with her br**sts. Her throaty moan spilled into his mouth like wine, rich and drugging.\u003c/p\u003e\n\u003cp\u003eThen he was tugging away her shirt and shoving back from the table all at once. “To hell with it,” he muttered against her greedy mouth, and was lifting her.\u003c/p\u003e\n\u003cp\u003eHer arms and legs wrapped around him like silken rope, her shirt dangling from one wrist where the buttons held. Beneath, she wore a plain cotton camisole as erotic to him as ivory lace.\u003c/p\u003e\n\u003cp\u003eShe was small and light, but with the blood trumpeting in his brain, he thought he could have carried a mountain. Her busy mouth never paused, racing from cheek to jaw to ear and back, while sexy little whimpers purred in her throat.\u003c/p\u003e\n\u003cp\u003eHe started out of the kitchen, stumbled over a loose throw rug and knocked her back against the doorjamb. She only laughed, breathlessly now, and tightened the vise of her legs around his waist.\u003c/p\u003e\n\u003cp\u003eTheir lips fused again in a rough, desperate kiss. With the doorway and her own limbs bracing her, he tore his mouth free to fasten it on her breast, suckling greedily through cotton.\u003c/p\u003e\n\u003cp\u003eThe pleasure of it, dark and damning, lanced like a spear through her system. This was more, she realized as the blood sizzling through her veins began to hum like an engine. More than she’d expected. More than she might have been ready for. But there was no turning back.\u003c/p\u003e\n\u003cp\u003eHe whirled away from the wall.\u003c/p\u003e\n\u003cp\u003e“Hurry,” was all she could say as he strode toward the stairs. “Hurry.”\u003c/p\u003e\n\u003cp\u003eHer words pumped like a pulse of his blood. Hurry. Hurry. Against his thundering heart, hers beat in furious response. With Maggie clinging like a bur, he all but leaped up the stairs, leaving a trail of broken flowers in their wake.\u003c/p\u003e\n\u003cp\u003eHe turned unerringly to the left, into the bedroom where the sun poured gold and the fragrant breeze lifted the open curtains. He fell with her onto already tumbled sheets.\u003c/p\u003e\n\u003cp\u003eIf it was madness that overcame him, it ruled her as well. There was no thought, or need, in either of them for gentle caresses, for soft words or slow hands. They tore at each other, mindless as beasts, dragging at clothes, pulling, tugging, kicking off shoes, all the while feeding greedily with violent kisses.\u003c/p\u003e\n\u003cp\u003eHer body was like an engine, fueled to race. She bucked and rolled and reared while her breath seared out in burning gasps. Seams ripped, needs exploded.\u003c/p\u003e\n\u003cp\u003eHis hands were smooth. Another time they might have glided over her body like water. But now they grasped and bruised and plundered, bringing her unspeakable pleasure that tore through her over-charged system like lightning tears a darkened sky. He filled his palms with her breast again, and now, without barriers, drew the rigid tips into his mouth.\u003c/p\u003e\n\u003cp\u003eShe cried out, not in pain at the rough scrape of his teeth and tongue, but in glory as the first harsh, vicious orgasm struck like a blow.\u003c/p\u003e\n\u003cp\u003eShe hadn’t expected it to slap her so quick and hard, nor had she ever experienced the utter helplessness that followed so fast on the heels of the storm. Before she could do more than wonder, fresh needs coiled whiplike inside her.\u003c/p\u003e\n\u003cp\u003eShe spoke in Gaelic, half-remembered words she hadn’t known she’d held in her heart. She’d never believed, never, that hunger could swallow her up and leave her trembling. But she shook under his hands, under the wild demand of his mouth. For another dazed interlude she was totally vulnerable, her bones molten and her mind reeling, stunned into surrender by the punch of her own climax.\u003c/p\u003e\n\u003cp\u003eHe never felt the change. He knew only that she vibrated beneath him like a plucked bow. She was wet and hot and unbearably arousing. Her body was smooth, soft, supple, all the lovely dips and curves his to explore. He knew only the desperate desire to conquer, to possess, and so gorged himself on the flavor of her flesh until it seemed the essence of her raced through his veins like his own blood.\u003c/p\u003e\n\u003cp\u003eHe clasped her limp hand in his and ravaged until she cried out once again, and his name was like a sob in the air.\u003c/p\u003e\n\u003cp\u003eWith the room spinning like a carousel around her, she dragged her hands from his, tangled her fingers in his hair. Need spurted through her again, voraciously. She thrust her hips up.\u003c/p\u003e\n\u003cp\u003e“Now!” The demand broke from her throat. “Rogan, for God’s sake—”\u003c/p\u003e\n\u003cp\u003eBut he had already plunged inside her, deep and hard. She arched back, arched up, in glorious welcome as fresh pleasure geysered through her in one lancing, molten flash. Her body mated with his, matching rhythms, stroke for desperate stroke. The bite of her nails on his back was unfelt.\u003c/p\u003e\n\u003cp\u003eWith vision blurred and dimmed, he watched her, saw each stunning sensation flicker over her face. It won’t be enough, he thought dizzily. Even as the sorrow nicked through the burnished shield of passion, she opened her eyes and said his name again.\u003c/p\u003e\n\u003cp\u003eSo he drowned in that sea of green, and burying his face in the fire of her hair, surrendered. With one last flash of glorious greed, he emptied himself into her.\u003c/p\u003e\n\u003cp\u003eIn a war of any kind, there are casualties. No one, Maggie thought, knew the glory, the sorrow or the price of battle better than the Irish. And if, as she was very much afraid at the moment, her body was paralyzed for life as the result of this wonderful little war, she wouldn’t count the cost.\u003c/p\u003e\n\u003cp\u003eThe sun was still shining. Now that her heart had ceased to crash like thunder in her head, she heard the twitter of birds, the roar of her furnace, and the hum of a bee buzzing by the window.\u003c/p\u003e\n\u003cp\u003eShe lay across the bed, her head clear off the mattress and dragged down by gravity. Her arms were aching. Perhaps because they were still wrapped like vises around Rogan, who was splayed over her, still as death.\u003c/p\u003e\n\u003cp\u003eShe felt, when she held her own breath, the quicksilver race of his heart. It was, she decided, a wonder they hadn’t killed each other. Content with his weight, and the drouzy feel of cobwebs in her brain, she watched the sun dance on the ceiling.\u003c/p\u003e\n\u003cp\u003eHis own mind cleared slowly, the red haze mellowing, then fading completely until he became aware again of the quiet light and the small, warm body beneath his. He shut his eyes again and lay still.\u003c/p\u003e\n\u003cp\u003eWhat were the words he should say? he wondered. If he told her that he’d discovered, to his own shock and confusion, that he loved her, why should she believe it? To say those words now, when they were both still sated and dazed from sex, would hardly please a woman like Maggie, or make her see the bare truth of them. \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-51.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
