{"id":109303,"no":55,"title":"Page 55","content":"\u003cp\u003e“No. She wouldn’t talk to me, only got angry.” It wasn’t worth recounting the verbal blows punch by punch, Brianna thought. To do so would only serve to spread the unhappiness more thickly. “She went off to her room, but she took the clippings with her.”\u003c/p\u003e\n\u003cp\u003e“Well, that’s something. Perhaps they’ll comfort her.” Maggie jolted when the phone rang and scrambled out of her chair so quickly that Brianna gaped. “Hello. Oh, Eileen, is it?” The disappointment in her voice was unmistakable. “Yes, I’ve the photos you sent for the catalog. They look more than fine. Perhaps I should tell Mr. Sweeney myself that—oh, a meeting. No, that’s all right, then, you can tell him I approved of them. You’re welcome. Goodbye.”\u003c/p\u003e\n\u003cp\u003e“You answered the phone,” Brianna commented.\u003c/p\u003e\n\u003cp\u003e“Of course I did. It rang, didn’t it?”\u003c/p\u003e\n\u003cp\u003eThe waspish tone of her sister’s voice had Brianna’s brow arching. “Were you expecting a call?”\u003c/p\u003e\n\u003cp\u003e“No. Why would you think so?”\u003c/p\u003e\n\u003cp\u003e“Well, the way you went leaping up, like you were after snatching a child from in front of a car.”\u003c/p\u003e\n\u003cp\u003eOh, had she? Maggie thought. Had she done that? It was humiliating. “I don’t like the damn thing ringing my ears off, that’s all. I’ve got to get to work.” With that as a fare-thee-well, she stalked out of the kitchen.\u003c/p\u003e\n\u003cp\u003eIt didn’t matter a tinker’s damn to her whether he called or not, Maggie told herself. Maybe it had been three weeks since he’d gone back to Dublin, maybe she’d only spoken to him twice in all that time, but it hardly mattered to her. She was much too busy to be bothered chattering over the phone, or entertaining him if he came to see her.\u003c/p\u003e\n\u003cp\u003eAs he’d bloody well said he would, she added silently, and slammed the shop door behind her.\u003c/p\u003e\n\u003cp\u003eShe didn’t need Rogan Sweeney’s company, or anyone’s. She had herself.\u003c/p\u003e\n\u003cp\u003eMaggie picked up her pipe and went to work.\u003c/p\u003e\n\u003cp\u003eThe Connellys’ formal dining room would have reminded Maggie of a set she had seen on the glossy soap opera that had been on television the day her father died. Everything gleamed and sparkled and shone. Wine of the very best vintage glimmered gold in the crystal, shooting rainbows into the facets. Candles, slim and white, added to the elegance of light showered down from the five-tiered chandelier.\u003c/p\u003e\n\u003cp\u003eThe people surrounding the lace-decked table were every bit as polished as the room. Anne, in sapphire silk and her grandmother’s diamonds, was the picture of the gracious hostess. Dennis, flushed from the good meal and better company, beamed at his daughter. Patricia looked particularly lovely, and as delicate as the pastel pink and creamy pearls she wore.\u003c/p\u003e\n\u003cp\u003eAcross from her, Rogan sipped at his wine and struggled to keep his mind from wandering west, toward Maggie.\u003c/p\u003e\n\u003cp\u003e“It’s so nice to have a quiet family meal.” Anne picked at the miserly portion of pheasant on her plate. The scale had warned her that she’d added two pounds in the last month, and that would never do. “I hope you’re not disappointed I didn’t invite a party, Rogan.”\u003c/p\u003e\n\u003cp\u003e“Of course not. It’s a pleasure, a rare one for me these days, to spend a quiet evening with friends.”\u003c/p\u003e\n\u003cp\u003e“Exactly what I’ve been telling Dennis,” Anne went on. “Why, we’ve hardly seen you in months. You work much too hard, Rogan.”\u003c/p\u003e\n\u003cp\u003e“A man can’t work too hard at something he loves,” Dennis put in.\u003c/p\u003e\n\u003cp\u003e“Ah, you and your man’s work.” Anne laughed lightly and barely resisted kicking her husband smartly under the table. “Too much business makes a man tense, I say. Especially if he has no wife to soothe him.”\u003c/p\u003e\n\u003cp\u003eKnowing just where this was leading, Patricia did her best to change the subject. “You had a wonderful success with Miss Concannon’s showing, Rogan. And I’ve heard the American Indian art has been very well received.”\u003c/p\u003e\n\u003cp\u003e“Yes, on both counts. The American art is moving to the Cork gallery this week, and Maggie’s—Miss Concannon’s—moves on to Paris shortly. She’s finished some astonishing pieces this past month.”\u003c/p\u003e\n\u003cp\u003e“I’ve seen a few of them. I believe Joseph covets the globe. The one with all the colors and shapes inside. It’s quite fascinating really.” Patricia folded her hands in her lap as the dessert course was served. “I wonder how it was done.”\u003c/p\u003e\n\u003cp\u003e“As it happens, I was there when she made it.” He remembered the heat, the bleeding colors, the sizzling sparks. “And I still can’t explain it to you.”\u003c/p\u003e\n\u003cp\u003eThe look in his eyes put Anne on full alert. “Knowing too much about the artistic process can spoil the enjoyment, don’t you think? I’m sure it’s all routine to Miss Concannon, after all. Patricia, you haven’t told us about your little project? How is the day school going?”\u003c/p\u003e\n\u003cp\u003e“It’s coming along nicely, thank you.”\u003c/p\u003e\n\u003cp\u003e“Imagine our little Patricia starting a school.” Anne smiled indulgently.\u003c/p\u003e\n\u003cp\u003eRogan realized with a guilty start that he hadn’t asked Patricia about her pet project in weeks. “Have you found a location, then?”\u003c/p\u003e\n\u003cp\u003e“Yes, I have. It’s a house off Mountjoy Square. The building will require some renovation, of course. I’ve hired an architect. The grounds are more than suitable, with plenty of space for play areas. I hope to have it ready for children by next spring.”\u003c/p\u003e\n\u003cp\u003eAnd she could imagine it. The babies and toddlers whose mothers needed a reliable place to leave their children while they worked. The older children who would come after school and before the close of business. It would fill some of the ache, she thought, and the emptiness that throbbed inside her. She and Robert hadn’t had children. They had been so sure there was plenty of time. So sure.\u003c/p\u003e\n\u003cp\u003e“I’m sure Rogan could help you with the business end of it, Patricia,” Anne went on. “After all, you’ve no experience.”\u003c/p\u003e\n\u003cp\u003e“She’s my daughter, isn’t she?” Dennis interjected with a wink. “She’ll do fine.”\u003c/p\u003e\n\u003cp\u003e“I’m sure she will.” Again Anne itched to connect her foot with her husband’s shin.\u003c/p\u003e\n\u003cp\u003eShe waited until she was in the parlor with her daughter and the men were lingering over glasses of port in the dining room—a custom Anne refused to believe was outdated. She dismissed the maid who had wheeled in coffee, and rounded on her daughter.\u003c/p\u003e\n\u003cp\u003e“What are you waiting for, Patricia? You’re letting the man slip between your fingers.” \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-55.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
