{"id":109304,"no":56,"title":"Page 56","content":"\u003cp\u003e“Please, don’t start this.” Already Patricia could feel the dull, insistent throb of a headache in progress.\u003c/p\u003e\n\u003cp\u003e“You want to be a widow all your life, I suppose.” Grim-eyed, Anne added cream to her cup. “I’m telling you it’s been time enough.”\u003c/p\u003e\n\u003cp\u003e“You’ve been telling me that since a year after Robbie died.”\u003c/p\u003e\n\u003cp\u003e“And it’s no more than the truth.” Anne sighed. She’d hated to watch her daughter grieve, had wept long and hard herself, not only over the loss of the son-in-law she’d loved, but for the pain she’d been unable to erase from Patricia’s eyes. “Darling, as much as we all wish it wasn’t so, Robert’s gone.”\u003c/p\u003e\n\u003cp\u003e“I know that. I’ve accepted it and I’m trying to move on.”\u003c/p\u003e\n\u003cp\u003e“By starting a day-care service for other people’s children?”\u003c/p\u003e\n\u003cp\u003e“Yes, in part. I’m doing that for myself, Mother. Because I need work, the satisfaction of it.”\u003c/p\u003e\n\u003cp\u003e“I’ve finished trying to talk you out of that.” In a gesture of peace, Anne raised her hands. “And if it’s what you want, truly, than it’s what I want as well.”\u003c/p\u003e\n\u003cp\u003e“Thank you for that.” Patricia’s face softened as she leaned over to kiss her mother’s cheek. “I know that you only want the best for me.”\u003c/p\u003e\n\u003cp\u003e“I do. Which is exactly why I want Rogan for you. No, don’t close up on me, girl. You can’t tell me you don’t want him as well.”\u003c/p\u003e\n\u003cp\u003e“I care for him,” Patricia said carefully. “Very much. I always have.”\u003c/p\u003e\n\u003cp\u003e“And he for you. But you’re standing back, all too patiently, and waiting for him to take the next step. And while you’re waiting he’s becoming distracted. A blind woman could see that he’s interested in more than that Concannon woman’s art. And she’s not the type to wait,” Anne added with a wag of the finger. “Oh, no, indeed. She’ll see a man of Rogan’s background and means and snap him up before he can blink.”\u003c/p\u003e\n\u003cp\u003e“I very much doubt Rogan can be snapped up,” Patricia said dryly. “He knows his own mind.”\u003c/p\u003e\n\u003cp\u003e“In most areas,” Anne agreed. “But men need to be guided, Patricia. Allured. You haven’t set yourself out to allure Rogan Sweeney. You’ve got to make him see you as a woman, not as his friend’s widow. You want him, don’t you?”\u003c/p\u003e\n\u003cp\u003e“I think—”\u003c/p\u003e\n\u003cp\u003e“Of course you do. Now see to it that he wants you, too.”\u003c/p\u003e\n\u003cp\u003ePatricia said little when Rogan drove her home. Home to the house she’d shared with Robert, the house she couldn’t give up. She no longer walked into a room expecting to find him waiting for her, or suffered those silvery slashes of pain at odd moments when she suddenly remembered their life together.\u003c/p\u003e\n\u003cp\u003eIt was simply a house that held good memories.\u003c/p\u003e\n\u003cp\u003eBut did she want to live in it alone for the rest of her life? Did she want to spend her days caring for other women’s children while there were none of her own to brighten her life?\u003c/p\u003e\n\u003cp\u003eIf her mother was right and Rogan was what she wanted, then what was wrong with a little allure.\u003c/p\u003e\n\u003cp\u003e“Won’t you come in for a while?” she asked when he walked her to the door. “It’s early still, and I’m restless.”\u003c/p\u003e\n\u003cp\u003eHe thought of his own empty house, and the hours before the workday began. “If you’ll promise me a brandy.”\u003c/p\u003e\n\u003cp\u003e“On the terrace,” she agreed, and walked inside.\u003c/p\u003e\n\u003cp\u003eThe house reflected the quiet elegance and faultless taste of its mistress. Though he’d always felt completely at home there, Rogan thought of Maggie’s cluttered cottage and narrow rumpled bed.\u003c/p\u003e\n\u003cp\u003eEven the brandy snifter reminded him of Maggie. He thought of the way she’d smashed one against the hearth in a rage of passion. And of the package that had come days later, holding the one she’d made to replace it.\u003c/p\u003e\n\u003cp\u003e“It’s a lovely night,” Patricia said, and snagged his wandering attention.\u003c/p\u003e\n\u003cp\u003e“What? Oh, yes. Yes, it is.” He swirled the brandy, but didn’t drink.\u003c/p\u003e\n\u003cp\u003eA crescent moon rode the sky, misted by clouds, then glowing white and thin as the breeze nudged them clear. The air was warm and fragrant, disturbed only by the muffled sound of traffic beyond the hedges.\u003c/p\u003e\n\u003cp\u003e“Tell me more about the school,” he began. “What architect have you chosen?” She named a firm he approved of. “They do good work. We’ve used them ourselves.”\u003c/p\u003e\n\u003cp\u003e“I know. Joseph recommended them. He’s been wonderfully helpful, though I feel guilty taking his mind off his work.”\u003c/p\u003e\n\u003cp\u003e“He’s well able to do a half-dozen things at once.”\u003c/p\u003e\n\u003cp\u003e“He never seems to mind my dropping into the gallery.” Testing him, herself, Patricia moved closer. “I’ve missed you.”\u003c/p\u003e\n\u003cp\u003e“Things have been hectic.” He tucked her hair behind her ear, an old gesture, an old habit he wasn’t even aware of. “We’ll have to make some time. We haven’t been to the theater in weeks, have we?”\u003c/p\u003e\n\u003cp\u003e“No.” She caught his hand, held it. “But I’m glad we have time now. Alone.”\u003c/p\u003e\n\u003cp\u003eA warning signal sounded in his head. He dismissed it as ridiculous and smiled at her. “We’ll make more. Why don’t I come by that property you’ve bought, look it over for you?”\u003c/p\u003e\n\u003cp\u003e“You know I value your opinion.” Her heart beat light, quick, in her chest. “I value you.”\u003c/p\u003e\n\u003cp\u003eBefore she could change her mind, she leaned forward and pressed her mouth to his. If there had been alarm in his eyes, she refused to see it.\u003c/p\u003e\n\u003cp\u003eNo sweet, platonic kiss this time. Patricia curled her fingers into his hair and poured herself into it. She wanted, desperately wanted, to feel something again.\u003c/p\u003e\n\u003cp\u003eBut his arms didn’t come around her. His lips didn’t heat. He stood, still as a statue. It wasn’t pleasure, nor was it desire that trembled between them. It was the chilly air of shock.\u003c/p\u003e\n\u003cp\u003eShe drew back, saw the astonishment and, worse, much worse, the regret in his eyes. Stung, she whirled away.\u003c/p\u003e\n\u003cp\u003eRogan set his untouched brandy down. “Patricia.”\u003c/p\u003e\n\u003cp\u003e“Don’t.” She squeezed her eyes tight. “Don’t say anything.”\u003c/p\u003e\n\u003cp\u003e“Of course I will. I have to.” His hands hesitated over her shoulders and finally settled gently. “Patricia, you know how much I…” What words were there? he thought frantically. What possible words? “I care about you,” he said, and hated himself. \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-56.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
