{"id":109310,"no":62,"title":"Page 62","content":"\u003cp\u003e“I was out a good deal of the time. You may have exclusive rights to my work, but not to me, Rogan. I do have my own life, as I’ve already explained.”\u003c/p\u003e\n\u003cp\u003e“A number of times.” He could feel the temper seeping back into him. “I’m not interfering with your life. I’m managing your career. And to that purpose, I’ll be traveling to Paris to oversee the display, and the showing.”\u003c/p\u003e\n\u003cp\u003eParis. She’d barely had an hour with him and he was already talking about leaving. Distressed by her own plummeting heart, she spoke crisply. “’Tis a wonder you keep your business thriving, Rogan. I’d think you’d be hiring people capable of handling details like that without you feeling the need to peek over their shoulders.”\u003c/p\u003e\n\u003cp\u003e“I assure you, I have very competent people. As it happens, I have a vested interest in your work, and I want to handle those details myself. I want it done right.”\u003c/p\u003e\n\u003cp\u003e“Which means you want it done your way.”\u003c/p\u003e\n\u003cp\u003e“Precisely. And I want you to come with me.”\u003c/p\u003e\n\u003cp\u003eThe sarcastic little comment that had sprung to her lips slipped off. “With you? To Paris?”\u003c/p\u003e\n\u003cp\u003e“I realize you have some artistic or possibly moral objection to promoting your own work, but you did well enough at the Dublin show. It would be advantageous to have you appear, however briefly, at your first international show.”\u003c/p\u003e\n\u003cp\u003e“My first international show,” she repeated, dumb-founded as the phrase sank into her head. “I don’t—I don’t speak French.”\u003c/p\u003e\n\u003cp\u003e“That won’t be a problem. You’ll have a look at the Paris gallery, dispense a bit of charm and have plenty of time to see the sights.” He waited for her answer, received nothing but a blank stare. “Well?”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“Tomorrow.”\u003c/p\u003e\n\u003cp\u003e“Tomorrow.” The first skitter of panic had her pressing a hand to her stomach. “You want me to go with you to Paris tomorrow?”\u003c/p\u003e\n\u003cp\u003e“Unless you’ve some pressing previous engagement.”\u003c/p\u003e\n\u003cp\u003e“I don’t, no.”\u003c/p\u003e\n\u003cp\u003e“Then it’s settled.” The relief was almost brutal. “After we’ve satisfied ourselves that the Paris show is successful, I’d like you to go south with me.”\u003c/p\u003e\n\u003cp\u003e“South?”\u003c/p\u003e\n\u003cp\u003e“I’ve a villa on the Mediterranean. I want to be alone with you, Maggie. No distractions, no interruptions. Just you.”\u003c/p\u003e\n\u003cp\u003eHer eyes lifted to his. “The block of time you’ve been working on for these weeks?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t have shouted at you if you’d explained it to me.”\u003c/p\u003e\n\u003cp\u003e“I had to explain it to myself first. Will you come?”\u003c/p\u003e\n\u003cp\u003e“Yes, I’ll come with you.” She smiled. “You’d only to ask.”\u003c/p\u003e\n\u003cp\u003eAn hour later she burst into the gallery, only to stop and simmer with frustration as she waited for Joseph to finish with a client. While he charmed a woman old enough to be his mother, Maggie wandered around the main room, noting that the American Indian display had been replaced by a selection of metal sculptures. Intrigued by the shapes, she lost her sense of urgency in admiration.\u003c/p\u003e\n\u003cp\u003e“A German artist,” Joseph said from behind her. “This particular work is, I feel, both visceral and joyous. A celebration of elemental forces.”\u003c/p\u003e\n\u003cp\u003e“Earth, fire, water, the suggestion of wind in the feathering of the copper.” She put on an airy accent to match his. “Powerful indeed in scope, but with an underlying mischief that suggests satire.”\u003c/p\u003e\n\u003cp\u003e“And it can be yours for a mere two thousand pounds.”\u003c/p\u003e\n\u003cp\u003e“A bargain. A pity I’m without a farthing to me name.” She turned, laughing, and kissed him. “You’re looking fit, Joseph. How many hearts have you broken since I left you?”\u003c/p\u003e\n\u003cp\u003e“Nary a one. Since mine belongs to you.”\u003c/p\u003e\n\u003cp\u003e“Hah! A good thing for us both that I know you’re full of blarney. Have you a minute to spare?”\u003c/p\u003e\n\u003cp\u003e“For you, days. Weeks.” He kissed her hand. “Years.”\u003c/p\u003e\n\u003cp\u003e“A minute will do me. Joseph, what do I need for Paris?”\u003c/p\u003e\n\u003cp\u003e“A tight black sweater, a short skirt and very high heels.”\u003c/p\u003e\n\u003cp\u003e“That’ll be the day. Really, I’m to go, and I haven’t a clue what I’ll need. I tried to reach Mrs. Sweeney, but she’s out today.”\u003c/p\u003e\n\u003cp\u003e“So I’m your second choice. You devastate me.” He signaled to one of his staff to take the room. “All you need for Paris, Maggie, is a romantic heart.”\u003c/p\u003e\n\u003cp\u003e“Where can I buy one?”\u003c/p\u003e\n\u003cp\u003e“You have your own. You can’t hide it from me, I’ve seen your work.”\u003c/p\u003e\n\u003cp\u003eShe grimaced, then slipped her arm through his. “Listen now, I’d not admit this to just anyone, but I’ve never traveled. In Venice I only had to worry about learning and not wearing anything that would catch fire. And paying the rent. If I’m going to have a trip to Paris, I don’t want to make a fool of myself.”\u003c/p\u003e\n\u003cp\u003e“You won’t. You’ll be going with Rogan, I take it, and he knows Paris as well as a native. You’ve only to act a bit arrogant, a bit bored, and you’ll fit right in.”\u003c/p\u003e\n\u003cp\u003e“I’ve come to you for fashion advice. Oh, it’s humiliating to say it, but I can’t go looking like this. Not that I want to paint myself up like a mannequin, but I don’t want to look like Rogan’s country cousin either.”\u003c/p\u003e\n\u003cp\u003e“Hmm.” Joseph took the question seriously, drawing her back to arm’s length for a slow, careful study. “You’d do just fine as you are, but…”\u003c/p\u003e\n\u003cp\u003e“But?”\u003c/p\u003e\n\u003cp\u003e“Buy yourself a silk blouse, very tailored, but soft. Vivid colors, my girl, no pastels for you. Slacks of the same type. Use your eye for color. Go for the clash. And that short skirt is a must. You’ve got that black dress?”\u003c/p\u003e\n\u003cp\u003e“I didn’t bring it with me.”\u003c/p\u003e\n\u003cp\u003eHe clucked his tongue like a maiden aunt. “You should always be prepared. All right, that’s out, so go for glitter this time. Something that dazzles the eye.” He tapped the sculpture beside them. “These metal tones would suit you. Don’t go for classic, go for bold.” Pleased with the thought, he nodded. “How’s that?”\u003c/p\u003e\n\u003cp\u003e“Confusing. I’m ashamed to find it matters to me.”\u003c/p\u003e\n\u003cp\u003e“There’s nothing shameful about it. It’s simply a matter of presentation.”\u003c/p\u003e\n\u003cp\u003e“That may be, but I’d be grateful to you if you didn’t mention this to Rogan.” \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-62.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
