{"id":109317,"no":70,"title":"Page 70","content":"\u003cp\u003eTaken by surprise and not entirely pleased, he frowned down at the sketch. “You drew this while I was asleep.”\u003c/p\u003e\n\u003cp\u003e“Well, I didn’t want to wake you and spoil the moment.” She hid her grin in her glass. “You were sleeping so sweetly. Perhaps you’d like to hang that one in your Dublin gallery.”\u003c/p\u003e\n\u003cp\u003e“I’m naked.”\u003c/p\u003e\n\u003cp\u003e“Nude is the word, I’ll remind you. When it’s art. And you look very artistic nude, Rogan. I’ve signed it, you see, so you may get a nice price for it.”\u003c/p\u003e\n\u003cp\u003e“I think not.”\u003c/p\u003e\n\u003cp\u003eShe tucked her tongue in her cheek. “As my manager it’s your duty to market my work. You’re always saying so yourself. And this, if I do say so, is one of my finest drawings. You’ll note the light, and the way it plays on the muscles of your—”\u003c/p\u003e\n\u003cp\u003e“I see,” he said in a strangled voice. “And so would everyone else.”\u003c/p\u003e\n\u003cp\u003e“No need to be modest. You’ve a fine form. I think I captured it even better in this other one.”\u003c/p\u003e\n\u003cp\u003eHis blood, quite simply, ran cold. “Other one?”\u003c/p\u003e\n\u003cp\u003e“Aye. Let’s see now.” She reached over to flip pages herself. “Here we are. Shows a bit more…contrast when you’re standing, I think. And a bit of that arrogance comes through as well.”\u003c/p\u003e\n\u003cp\u003eWords failed him. She’d drawn him standing on the terrace, one arm resting on the rail behind him, the other cupping a brandy snifter. And a smile—a particularly smug smile—on his face. It was all he was wearing.\u003c/p\u003e\n\u003cp\u003e“I never posed for this. And I’ve never stood naked on the terrace drinking brandy.”\u003c/p\u003e\n\u003cp\u003e“Artistic license,” she said airly, delighted that she’d flummoxed him so completely. “I know your body well enough to draw it from memory. It would have spoiled the theme to bother with clothes.”\u003c/p\u003e\n\u003cp\u003e“The theme? Which is?”\u003c/p\u003e\n\u003cp\u003e“Master of the house. I thought that’s what I’d title it. Both of them actually. You might offer them as a set.”\u003c/p\u003e\n\u003cp\u003e“I won’t be selling them.”\u003c/p\u003e\n\u003cp\u003e“And why not? I’d like to know? You’ve sold several of my other drawings that aren’t nearly as well done. Those I didn’t want you to sell, but I’d signed on the dotted line, so you did. I want you to market these.” Her eyes danced. “In fact, I insist, as I believe is my right, contractually speaking.”\u003c/p\u003e\n\u003cp\u003e“I’ll buy them myself, then.”\u003c/p\u003e\n\u003cp\u003e“What’s your offer? My dealer tells me my price is rising.”\u003c/p\u003e\n\u003cp\u003e“You’re blackmailing me, Maggie.”\u003c/p\u003e\n\u003cp\u003e“Oh, aye.” She toasted him then sipped more wine. “You’ll have to meet my price.”\u003c/p\u003e\n\u003cp\u003eHe glanced at the sketch again before firmly closing the book. “Which is?”\u003c/p\u003e\n\u003cp\u003e“Let’s see now…. I think if I was taken upstairs and made love to until moonrise, we might have a deal.”\u003c/p\u003e\n\u003cp\u003e“You’ve a shrewd business sense.”\u003c/p\u003e\n\u003cp\u003e“I’ve learned it from a master.” She started to stand, but he shook his head and scooped her into his arms.\u003c/p\u003e\n\u003cp\u003e“I want no slipping through loopholes on this deal. I believe your terms were that you be taken upstairs.”\u003c/p\u003e\n\u003cp\u003e“Right you are. I suppose that’s why I need a manager.” She wound a lock of his hair around her fingers as he carried her into the house. “You know, of course, if I’m not satisfied with the rest of the terms, the deal’s off.”\u003c/p\u003e\n\u003cp\u003e“You’ll be satisfied.”\u003c/p\u003e\n\u003cp\u003eAt the top of the stairs he stopped to kiss her. Her response was, as always, fast and urgent, and as always, it quickened his blood. He stepped into the bedroom, where the softened light of sunset swam through the windows. Soon the light would go gray with dusk.\u003c/p\u003e\n\u003cp\u003eTheir last night alone would not be spent in the dark.\u003c/p\u003e\n\u003cp\u003eThinking this, he laid her on the bed, and when she reached for him, he slipped away to light candles. They were scattered through the room, some stubs, some slim tapers, all burned down to varying lengths. Maggie knelt on the bed while Rogan struck the flames and sent the light dancing gold.\u003c/p\u003e\n\u003cp\u003e“Romance.” She smiled and felt oddly touched. “It seems a spot of blackmail’s been well worth the effort.”\u003c/p\u003e\n\u003cp\u003eHe paused, a flaring match between his fingers. “Have I given you so little romance, Maggie?”\u003c/p\u003e\n\u003cp\u003e“I was only joking.” She tossed back her breeze-ruffled hair. His voice had been much too serious. “I’ve no need for romance. Honest lust is quite good enough for me.”\u003c/p\u003e\n\u003cp\u003e“Is that what we have?” Thoughtfully he set the match to the wick then shook it out. “Lust.”\u003c/p\u003e\n\u003cp\u003eLaughing, she held out her arms. “If you’d stop wandering about the room and come over here, I’ll show you exactly what we have.”\u003c/p\u003e\n\u003cp\u003eShe looked dazzling in the candle glow with the last colors of day bleeding through the windows beside the bed. Her hair afire, her skin kissed by her days in the sun and her eyes aware, mocking and unquestionably inviting.\u003c/p\u003e\n\u003cp\u003eOn other days and other nights he would have dived into that invitation, accepted it, reveled in it and the firestorm they could make between them. But his mood had shifted. He crossed slowly to her, taking her hands before they could tug him eagerly into the bed with her, lifting them to his lips as his eyes watched her.\u003c/p\u003e\n\u003cp\u003e“That wasn’t the bargain, Margaret Mary. I was to make love to you. It’s time I did.” He kept her hands in his, drawing her arms down to her sides as he leaned forward to toy with her lips. “It’s time you let me.”\u003c/p\u003e\n\u003cp\u003e“What foolishness is that?” Her voice wasn’t steady. He was kissing her as he had once before, slowly, gently, and with the utmost concentration. “I’ve done more than let you a great many times before.”\u003c/p\u003e\n\u003cp\u003e“Not like this.” He felt her hands flex against his, her body draw back. “Are you so afraid of tenderness, Maggie?”\u003c/p\u003e\n\u003cp\u003e“Of course I’m not.” She couldn’t get her breath, yet she could hear it, feel it coming slow and heavy through her lips. Her whole body was tingling, yet he was barely touching her. Something was slipping away from her. “Rogan, I don’t want to—”\u003c/p\u003e\n\u003cp\u003e“To be seduced?” He took his lips from hers, let them roam leisurely over her face.\u003c/p\u003e\n\u003cp\u003e“No, I don’t.” But her head tilted back as he skimmed his mouth down her throat.\u003c/p\u003e\n\u003cp\u003e“You’re about to be.”\u003c/p\u003e\n\u003cp\u003eHe released her hands then to draw her closer. No fevered embrace this time, but an inescapable possession. Her arms seemed impossibly heavy as she wound them round his neck. She could do no more than cling as he stroked her hair, her face, with gentle fingertips that felt no more substantial than a whisper on the air. \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-70.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
