{"id":109332,"no":86,"title":"Page 86","content":"\u003cp\u003e“Selfishness?”\u003c/p\u003e\n\u003cp\u003eStartled, Brianna glanced up again. “No, not that. Not ever. That’s one flaw I’ve never seen in you.”\u003c/p\u003e\n\u003cp\u003e“But others?”\u003c/p\u003e\n\u003cp\u003e“You’ve enough of them. What, do you want to be perfect?”\u003c/p\u003e\n\u003cp\u003eThe dismissive tone had Maggie wincing. “You’re still upset with me about last evening.”\u003c/p\u003e\n\u003cp\u003e“I’m not, no.” With renewed vigor Brianna began to pound the dough. “With myself, with circumstances, with fate, if you like. But not with you. It wasn’t your doing, and God knows you warned me it wouldn’t work. But I wish you wouldn’t always leap to defend me.”\u003c/p\u003e\n\u003cp\u003e“I can’t help it.”\u003c/p\u003e\n\u003cp\u003e“I know.” Brianna smoothed the dough into a mound and slipped it into a bowl for a second rising. “She was better behaved after you’d gone. And a little embarrassed, I think. Before she left she told me I’d cooked a nice meal. Not that she ate any of it, but at least she said it.”\u003c/p\u003e\n\u003cp\u003e“We’ve had worse evenings.”\u003c/p\u003e\n\u003cp\u003e“That’s God’s truth. Maggie, she said something else.”\u003c/p\u003e\n\u003cp\u003e“She says lots of things. I didn’t come to go over all of that.”\u003c/p\u003e\n\u003cp\u003e“It was about the candlesticks,” Brianna continued, and had Maggie lifting both brows.\u003c/p\u003e\n\u003cp\u003e“What of them?”\u003c/p\u003e\n\u003cp\u003e“The ones I had on the sideboard, the ones you’d made me last year. She said what pretty work they were.”\u003c/p\u003e\n\u003cp\u003eWith a laugh, Maggie shook her head. “You’ve been dreaming.”\u003c/p\u003e\n\u003cp\u003e“I was awake and standing in my own hallway. She looked at me, and she told me. And she kept standing there, looking at me until I understood that she couldn’t say it to you herself, but she wanted you to know.”\u003c/p\u003e\n\u003cp\u003e“Why should she?” Maggie said unsteadily.\u003c/p\u003e\n\u003cp\u003e“I think it was a kind of apology, for whatever passed between you in the dining room. The best she could make. When she saw I understood her, she started in on Lottie again, so the two of them left the way they’d come in. Arguing.”\u003c/p\u003e\n\u003cp\u003e“Well.” Maggie had no idea how to react, how to feel. Restlessly, her fingers reached into her pocket to toy with the smooth glass drops.\u003c/p\u003e\n\u003cp\u003e“It’s a small step, but a step it is.” Brisk, Brianna began to dust flour on her hands in preparation for kneading the next loaf. “She’s happy in the house you gave her, even if she doesn’t know it yet.”\u003c/p\u003e\n\u003cp\u003e“You could be right.” Her breath hitched a bit as she released it. “I hope you are. But don’t be planning any more family meals in the near future.”\u003c/p\u003e\n\u003cp\u003e“That I won’t.”\u003c/p\u003e\n\u003cp\u003e“Brianna…” Maggie hesitated, ended by looking helplessly at her sister. “I’m driving to Dublin today.”\u003c/p\u003e\n\u003cp\u003e“Oh, you’ll have a long day, then. You’re needed at the gallery?”\u003c/p\u003e\n\u003cp\u003e“No. I’m going to see Rogan. I’m either going to tell him I’m not going to see him again, or that I’ll marry him.”\u003c/p\u003e\n\u003cp\u003e“Marry him?” Brianna bobbled the next ball of dough. “He’s asked you to marry him?”\u003c/p\u003e\n\u003cp\u003e“The last night we were in France. I told him no, absolutely no. I meant it. I might still. That’s why I’m driving, to give myself time to think it through. I’ve realized that it has to be one or the other.” She fingered the glass drops in her pocket. “So I’m going, and I wanted to tell you.”\u003c/p\u003e\n\u003cp\u003e“Maggie—” Brianna was left with her hands full of dough, staring at the swinging back door.\u003c/p\u003e\n\u003cp\u003eThe worst part was not finding him home—and knowing she should have checked before making the drive. At the gallery, his butler had said, but when she arrived there, cursing Dublin traffic all the way, he was already gone and on the way to his office.\u003c/p\u003e\n\u003cp\u003eAgain, she missed him, by no more than five minutes, she was informed. He was heading to the airport and a flight to Rome. Would she care to put through a call to his car phone?\u003c/p\u003e\n\u003cp\u003eShe would not, Maggie decided, stumble through one of the biggest decisions of her life over the telephone. In the end, she got back in her lorry and made the long, lonely drive back to Clare.\u003c/p\u003e\n\u003cp\u003eIt was easy to call herself a fool. And to tell herself she was better off not having found him at all. Exhausted by the hours of driving, she slept like the dead until noon the next day.\u003c/p\u003e\n\u003cp\u003eThen she tried to work.\u003c/p\u003e\n\u003cp\u003e“I want the Seeker in the forefront, and the Triad centered, precisely.”\u003c/p\u003e\n\u003cp\u003eRogan stood in the sun-washed showroom of Worldwide Gallery, Rome, watching his staff arrange Maggie’s work. The sculptures stood up well in the gilded rococo decor. The heavy red velvet he’d chosen to drape the pedestals and tables added a royal touch. Something he was sure Maggie would have complained about, but which suited the clientele of this particular gallery.\u003c/p\u003e\n\u003cp\u003eHe checked his watch, muttered to himself under his breath. He had a meeting in twenty minutes. There was no help for it, he thought as he called out another order for a minute adjustment. He was going to be late. Maggie’s influence, he supposed. She’d corrupted his sense of time.\u003c/p\u003e\n\u003cp\u003e“The gallery opens in fifteen minutes,” he reminded the staff. “Expect some press, and see that they each receive a catalog.” He scanned the room one last time, noting the placement of each piece, the fold of every drape. “Well done.”\u003c/p\u003e\n\u003cp\u003eHe stepped outside into the bright Italian sun, where his driver waited.\u003c/p\u003e\n\u003cp\u003e“I’m running late, Carlo.” Rogan shifted into his seat and opened his briefcase.\u003c/p\u003e\n\u003cp\u003eCarlo grinned, tucked the chauffeur’s cap lower on his brow and flexed his fingers like a concert pianist preparing to launch into an arpeggio. “Not for long, signore.”\u003c/p\u003e\n\u003cp\u003eTo Rogan’s credit, he barely lifted a brow as the car leaped like a tiger from the curb, snarling and growling at the cars it cut off. Bracing himself in the corner of the seat, Rogan turned his attention to a printout of figures from his Roman branch.\u003c/p\u003e\n\u003cp\u003eIt had been an excellent year, he decided. Far from the staggering boom of the mideighties, but quite good enough. He thought perhaps it was best that the days when a painting could demand hundreds of millions of pounds at auction were over. Art, with so high a price tag, was too often hidden away in a vault until it was as soulless as gold bullion.\u003c/p\u003e\n\u003cp\u003eStill, it had been a profitable year. Profitable enough, he thought, that he could implement his idea of opening another smaller branch of Worldwide, one that displayed and sold only the works of Irish artists. It had been a germ in his mind for the last few years, but lately, just lately, it had grown. \u003c/p\u003e","sourceLink":"https://allnovel.net/born-in-fire-born-in-trilogy-1/page-86.html","bookId":1560,"creation":"Oct 5, 2019 11:35:30 PM","modification":"Oct 5, 2019 11:35:30 PM"}
