{"id":85037,"no":13,"title":"Page 13","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDarren and Donna were up at the bar getting more drinks.\u003c/p\u003e\n\u003cp\u003eAdam and I were alone on the couch.\u003c/p\u003e\n\u003cp\u003eHe caressed my hip soothingly, obviously trying to get me to relax. “So,” he spoke into my ear again, reinforcing the feeling that we were in our own little bubble inside the bar.\u003c/p\u003e\n\u003cp\u003e“Are you going to tell me why you’re being a bitch to me?”\u003c/p\u003e\n\u003cp\u003e“Stop calling me that,” I snapped, turning my head so our noses were almost touching. I stared into his dark eyes and lost my breath so badly I had to look away.\u003c/p\u003e\n\u003cp\u003e“Stop acting like one.”\u003c/p\u003e\n\u003cp\u003e“I’m annoyed,” I explained. “I get to be annoyed.”\u003c/p\u003e\n\u003cp\u003e“Would you fill me in?”\u003c/p\u003e\n\u003cp\u003eI turned to him again, and this time I don’t think I managed to mask my hurt and confusion over his actions because his own expression softened with concern. “Why did you threaten Nicholas with physical violence when he came to you for advice about asking me out?”\u003c/p\u003e\n\u003cp\u003eUnderstanding dawned in his eyes and he sighed heavily. “He’s not good enough for you.”\u003c/p\u003e\n\u003cp\u003e“That’s not up to you to decide.”\u003c/p\u003e\n\u003cp\u003eHis fingers dug into my hip as they curled in reflex to my response. “It’s up to me to protect you.”\u003c/p\u003e\n\u003cp\u003eI closed my eyes, his words hurting me. “I’m not yours to protect.”\u003c/p\u003e\n\u003cp\u003eAdam’s body grew solid next to mine and we sat in awful silence for a moment.\u003c/p\u003e\n\u003cp\u003eThe silence was broken when his arm loosened its hold around my waist. I was just turning my head to look at him questioningly when I felt the touch of his fingers against my upper back. Slowly, torturously he skimmed them down my spine and I flushed feeling my nipples harden visibly against the fabric covering my chest. “You sure about that,” he murmured hoarsely in my ear.\u003c/p\u003e\n\u003cp\u003eMy eyes widened as I stared into his, a flurry of confusion and questions rioting in my head, none of which I had time to voice before Donna and Darren took a seat next to us with our drinks. Adam’s arm came back around, his hand resting gently on my hip, and I sat there in stunned silence wondering what the hell he’d meant by that.\u003c/p\u003e\n\u003cp\u003eChapter 7\u003c/p\u003e\n\u003cp\u003eAdam winced as he looked over at me. “I really did send you some pretty mixed signals.”\u003c/p\u003e\n\u003cp\u003eI snorted. “You think?”\u003c/p\u003e\n\u003cp\u003eHe smiled sheepishly. “I’m sorry, Els. You pissed me off. I was trying to make a point that you were mine. It wasn’t fair.”\u003c/p\u003e\n\u003cp\u003eI shrugged. “You were torn. I forgive you. Especially since it makes a really good story.”\u003c/p\u003e\n\u003cp\u003eHe laughed as I reached for the diary again, flipping through the pages to find the next entry.\u003c/p\u003e\n\u003cp\u003e“That night at Club 39 wasn’t nearly as bad as the night at Fire.”\u003c/p\u003e\n\u003cp\u003eAdam groaned. “Damn, I don’t know if I want to read this from your point of view.”\u003c/p\u003e\n\u003cp\u003e“I get quite detailed.”\u003c/p\u003e\n\u003cp\u003eHe quirked an eyebrow at me. “Detailed?”\u003c/p\u003e\n\u003cp\u003eI nodded, blushing.\u003c/p\u003e\n\u003cp\u003eHe saw the blush and grinned, pulling the diary out of my hand. “Baby, that’s hot.”\u003c/p\u003e\n\u003cp\u003eSunday, September 16th I’m done. It’s over. I don’t care what history lies between me and Adam… it’s finally over… I hadn’t been looking forward to the night at Fire because it meant being stuck in a club, watching Adam flirt with everything that moved, but it was a big night for Braden as he was holding a special event for Fresher’s Week, and I promised him I’d be there.\u003c/p\u003e\n\u003cp\u003eAs per usual he and Joss were so wrapped up in their own stuff they didn’t notice the tension between me and Adam. It was this horribly awkward tension, mixed with sexual frustration, and it had sprung up between us after our clash a little while after the eventful night at Club 39.\u003c/p\u003e\n\u003cp\u003eIt had happened when I accepted a date with a guy called Jason that I met in Starbucks.\u003c/p\u003e\n\u003cp\u003eJason was hot and seemed nice and I saw no harm in grabbing a drink with him. Except, Braden had informed Adam of my plans and Adam had spent the entire night calling me up with stupid questions. He ruined the date. It was immature and completely outrageous.\u003c/p\u003e\n\u003cp\u003eEven more so was the fact that, as Joss so bluntly pointed out, I had rudely kept answering the phone instead of switching it off. The truth was I’d been enjoying Adam’s reaction to my date. Somewhere along the line I had forgotten my vow to move on from him after the night at his apartment, and I was playing our stupid game again. I wanted a reaction from him and I got it. But after chewing him out at my parent’s Sunday lunch the next day, Adam had gone from hot to ice cold. He tried not to be alone with me and when he was alone with me he spoke to me about things you’d chat to a perfect stranger about. It had been wearing on my nerves for weeks, and that along with my worries about school and the recurring headache I couldn’t seem to get rid of, I found myself wanting to lay my frustrations at his feet.\u003c/p\u003e\n\u003cp\u003eEveryone else would get nice Ellie, sweet Ellie, the Ellie everyone knew and liked. Adam would get crabby Ellie, tired Ellie, the Ellie with the bitter, broken heart.\u003c/p\u003e\n\u003cp\u003eWhile Braden detained Joss after a small skirmish about her dress (my brother was such an alpha-male idiot sometimes) Adam led me up to a private booth across from the bar. I slid in one side and was surprised when Adam sat down quite close to me.\u003c/p\u003e\n\u003cp\u003e“Careful,” I warned him dryly, “I think you’re breaking your one meter distance rule with me.”\u003c/p\u003e\n\u003cp\u003eHe curled his lip, unimpressed. “Don’t start. Not tonight.”\u003c/p\u003e\n\u003cp\u003e“Not any night.”\u003c/p\u003e\n\u003cp\u003eHis eyes flashed. “You know why I don’t date, Ellie? So I don’t have to put up with this shit. It’s like being in a fucking relationship without the benefits.”\u003c/p\u003e\n\u003cp\u003eHurt, I gave him the dirtiest look I could muster. “No, it’s like being in a friendship you broke.”\u003c/p\u003e\n\u003cp\u003eHaving successfully spread my hurt to him, I felt awful, and feeling awful made me even angrier at him. I didn’t want to care that I hurt his feelings.\u003c/p\u003e\n\u003cp\u003eAdam was about to respond when movement drew our heads up and we saw Joss trying to escape our argument. He gave her a look that told her to plant her bottom down beside us and save him from me.\u003c/p\u003e\n\u003cp\u003eI was almost as relieved as he was when she sat down on my other side.\u003c/p\u003e\n\u003cp\u003e“Braden’s having drinks sent over,” she said, her eyes taking in all the guests. “I didn’t realize he had other friends appearing tonight. I thought it was just us and random people.”\u003c/p\u003e\n\u003cp\u003e“No,” I replied absentmindedly, my bad mood causing the rope bridge between my brain and mouth to snap. “Some of his exes as well as his previous friends-with-benefits girls love clubbing. He invited them and a few of his guy friends.”\u003c/p\u003e\n\u003cp\u003eIt wasn’t until Adam snapped, “Ellie, what are you playing at?” and I turned to see him gazing pointedly at Joss that I followed his gaze and saw Joss had frozen at my careless comment.\u003c/p\u003e\n\u003cp\u003eMortified, I hurried to assure her apologetically, “Oh crap, Joss, I didn’t mean anything. I mean, those girls don’t mean anything…”\u003c/p\u003e\n\u003cp\u003e“Let’s get drunk,” she announced overly cheerily and I felt unbelievably guilty for making her feel uncomfortable and uncertain of Braden.\u003c/p\u003e\n\u003cp\u003e“I don’t think that’s a good idea. Let’s just wait for Braden,” Adam insisted.\u003c/p\u003e\n\u003cp\u003eHowever, Braden spent an awful long time flirting and chatting with guests and the tension at our table grew so thick we all sought to escape it. Joss and I headed for the dance floor, and I kept her company for a while until I headed to the bar to get some water. As I approached I caught sight of Adam and felt that oh so familiar burn in my throat. He was wearing a black shirt, rolled up at the sleeves, with black dress trousers. It was simple, it was hot. He always looked hot. And tonight he looked hot as he leaned into a girl who was sitting on a stool at the other end of the bar. She had her head tilted back while Adam braced one hand on the bar and leaned in to whisper in her ear. She laughed and he lifted his face so they were almost close enough to kiss. Whatever he murmured to her made her laugh soften to a flirtatious smile and I felt that burn in my throat transform into a lump of tears.\u003c/p\u003e\n\u003cp\u003eAs if he sensed my gaze Adam’s head lifted and our eyes met. I’d never found it easy to hide my emotions when I was feeling something particularly deeply and I hurried to look away before he caught it.\u003c/p\u003e\n\u003cp\u003e“What can I get you?” One of the bartenders finally approached me.\u003c/p\u003e\n\u003cp\u003e“Bottle of water,” I replied, my voice hoarse with pain and he had to lean in for me to repeat the order. Just as I handed him money for the water, I felt a hand on my lower back and his cologne hit me seconds before his mouth brushed my ear.\u003c/p\u003e\n\u003cp\u003e“Els,” Adam said quietly, his voice thick with emotion.\u003c/p\u003e\n\u003cp\u003eI didn’t know how to respond. My eyes fixed downward on the bottle as I tried to control myself, knowing that every day I was getting closer and closer to forcing our situation into some kind of resolution by putting the truth out there.\u003c/p\u003e\n\u003cp\u003e“Sweetheart, look at me.”\u003c/p\u003e\n\u003cp\u003eI did as he asked, searching his face for answers I knew he wasn’t ready to give me, answers he may never be ready to give me.\u003c/p\u003e\n\u003cp\u003eHe lifted his hand from my back and brushed his knuckles tenderly along my jaw, his eyes following their movement. “The prettiest thing I’ve ever seen,” he murmured.\u003c/p\u003e\n\u003cp\u003eThe words stung because they signaled another round on this merry-go-round of mixed signals. I reared back from his touch, grimacing. “Don’t.”\u003c/p\u003e\n\u003cp\u003eHe dropped his hands. “Ellie—”\u003c/p\u003e\n\u003cp\u003eI gestured to the girl at the other end of the bar who was now throwing invisible daggers my way. “Did you say that to her?”\u003c/p\u003e\n\u003cp\u003e“El—”\u003c/p\u003e\n\u003cp\u003eA surge of shocked murmurs and shouts interrupted him and we both turned to look over his shoulder to see Braden rearing back from hitting… “Gavin,” I gasped.\u003c/p\u003e\n\u003cp\u003eAdam immediately took off to be by his friend’s side and I followed, my heart racing for Braden. Gavin had been his and Adam’s friend at school, but he’d grown up into a prize arsehole. Braden, for some reason, felt loyalty to him and kept him around. That was until five years ago when he’d slept with Analise and betrayed Braden.\u003c/p\u003e\n\u003cp\u003eNow he was in his nightclub?\u003c/p\u003e\n\u003cp\u003e“That is Gavin.” Braden threw Joss a disgusted look. “The friend who fucked Analise. \u003c/p\u003e","sourceLink":"https://allnovel.net/until-fountain-bridge-on-dublin-street-2/page-13.html","bookId":1892,"creation":"Oct 5, 2019 5:05:20 PM","modification":"Oct 5, 2019 5:05:20 PM"}
