{"id":80516,"no":39,"title":"Page 39","content":"\u003cp\u003e“Not even a little,” I smile. “But you’re right. He’s really not an ass**le.” I don’t know why it makes me happy that she sees that about him, but it does.\u003c/p\u003e\n\u003cp\u003e“Why are we talking about Drew?” Good question, Sunshine. Because it’s easy. Because if we stop, we’re going to have to deal with what we’re doing here and neither of us knows how. We suck at this.\u003c/p\u003e\n\u003cp\u003e“Will you have dinner with me tomorrow night?” I spit the words out before I can talk myself out of them.\u003c/p\u003e\n\u003cp\u003e“It’s Sunday. We always have dinner together.”\u003c/p\u003e\n\u003cp\u003e“No. Just us.”\u003c/p\u003e\n\u003cp\u003e“You don’t want to go to Drew’s?” She looks confused.\u003c/p\u003e\n\u003cp\u003e“No.” I definitely do not want to go to Drew’s.\u003c/p\u003e\n\u003cp\u003e“Why not? Are you still pissed about the sex thing? He said he told you it wasn’t true.”\u003c/p\u003e\n\u003cp\u003e“I’m trying to ask you out and you’re making it really impossible.”\u003c/p\u003e\n\u003cp\u003eShe stops spinning the baton. “Why would you ask me out?”\u003c/p\u003e\n\u003cp\u003e“Isn’t that what people do? Go on dates?” People still do that, right? Leigh never expected movies and dinner first, so I really don’t have a clue.\u003c/p\u003e\n\u003cp\u003e“I don’t know. I’ve never been on a date.” And it’s swinging again.\u003c/p\u003e\n\u003cp\u003e“Never?”\u003c/p\u003e\n\u003cp\u003e“Sorry, no. Never really had a chance. My life hasn’t exactly been what you’d classify as normal. How many dates have you been on?” Her defensiveness is kicking in.\u003c/p\u003e\n\u003cp\u003e“None.” My life hasn’t been quite normal, either. “Guess we’re both freaks.”\u003c/p\u003e\n\u003cp\u003e“I think we established that a while ago.”\u003c/p\u003e\n\u003cp\u003e“So let’s pretend. One night. We’ll go out and pretend we’re normal.” We never even left the foyer, so I’m still right next to the door, but I’m not ready to open it yet. She looks scared. Like she thinks this is a very bad idea and any second now she’s going to say so. I put my hands on either side of her face so she has to look at me. “One night,” I repeat, not giving her a chance to formulate an excuse. “I’ll pick you up tomorrow.” I press my lips to her forehead, even though that’s not where I want them at all.\u003c/p\u003e\n\u003cp\u003e“Are you still with her?” she whispers, and I can’t believe I didn’t think to tell her. Actually, I can, because I’ve never discussed Leigh with her. Not once. I wonder if it’s been in her head this whole conversation.\u003c/p\u003e\n\u003cp\u003e“No,” I say.\u003c/p\u003e\n\u003cp\u003e“Not even just for‌—‌” she stops and looks uncomfortable and I kind of want to laugh because some of the conversations she has with Drew would make a\u0026nbsp; p**n\u0026nbsp; star blush, but she can’t spit this out. Looking at her now, I’m forced to admit to the vulnerability that she’s always been hiding behind every sexual innuendo and under every tight black dress.\u003c/p\u003e\n\u003cp\u003e“Not for anything. I promise.” I trace my thumb under her bottom lip and back away before I let myself kiss her, because I’ve been waiting to kiss her for months and I don’t want to do it standing in the foyer while she has a weapon in her hand and we just got done talking about Leigh.\u003c/p\u003e\n\u003cp\u003eShe nods and looks embarrassed for asking, but she shouldn’t be. I would have needed to know if it was the other way around.\u003c/p\u003e\n\u003cp\u003e“So, tomorrow. You and me. Normal. All right?”\u003c/p\u003e\n\u003cp\u003e“All right.” She smiles, but it’s not even a real smile, just the vague idea of one.\u003c/p\u003e\n\u003cp\u003eI turn toward the door, but she stops me.\u003c/p\u003e\n\u003cp\u003e“What am I supposed to wear?”\u003c/p\u003e\n\u003cp\u003eI shrug because I don’t even know where we’re going yet.\u003c/p\u003e\n\u003cp\u003e“Wear something normal.”\u003c/p\u003e\n\u003cp\u003eI pull up to my house just in time to see Clay Whitaker walking back to his car in my driveway. He looks nervous when he sees me.\u003c/p\u003e\n\u003cp\u003e“What’s up?” I ask. I didn’t even know he knew where I lived.\u003c/p\u003e\n\u003cp\u003e“You never told me what you thought of the picture.” Nice try, Clay, but that’s not why you’re here.\u003c/p\u003e\n\u003cp\u003e“Picture was perfect, Clay. You know it was. What do you want? Because you don’t do subtle well.”\u003c/p\u003e\n\u003cp\u003e“Why’d you have me draw it?”\u003c/p\u003e\n\u003cp\u003eI feel like every single person I know wants a confession from me tonight.\u003c/p\u003e\n\u003cp\u003e“I’m going to walk in that house right now and give you your damn picture back so I never have to hear a f**king word about it again.” I start toward the front porch and the motion sensors kick the lights on.\u003c/p\u003e\n\u003cp\u003e“You didn’t see her face.” He’s not talking about the picture anymore. He’s talking about at Drew’s when I walked away with Leigh and he’s wrong. I did see her face and it was awful and it would be nice if everyone would let me forget it.\u003c/p\u003e\n\u003cp\u003e“What is it about that girl that makes everyone think they have some sort of ownership or obligation to protect her?” Me, included. “In case you haven’t noticed she should probably be the one protecting all of us.”\u003c/p\u003e\n\u003cp\u003e“Drew and I maybe. Not sure about you.” He’s kicking an invisible rock back and forth with his foot and I start looking around for one of my own.\u003c/p\u003e\n\u003cp\u003e“Fine, Clay. Tell me what to do.”\u003c/p\u003e\n\u003cp\u003e“You’re asking me?” He’s shocked. So am I. “You do realize that g*y teenage boys and straight teenage girls are not interchangeable, right? Same strategies don’t really work.”\u003c/p\u003e\n\u003cp\u003e“I get it. I’ve never done this before.” I’m trying to figure out how I got to the point where I’m standing in my driveway, asking Clay Whitaker for advice. How is it that with everything that’s happened in my life, this girl is going to be the thing that undoes me?\u003c/p\u003e\n\u003cp\u003e“You’ve never done this before?” he asks with more than a little disbelief.\u003c/p\u003e\n\u003cp\u003eI look at him like the insulting idiot that he is, especially in light of what he thinks I was doing last night with Leigh. “I’ve done that before. I just haven’t done this before.” I motion back and forth between myself and the direction of Nastya’s house even though he probably has no idea what I’m doing.\u003c/p\u003e\n\u003cp\u003e“You’ve never just gone out with a girl?” He laughs but I’m not seeing the humor and I make sure my expression tells him so. “OK, not funny. Seriously, why don’t you just ask Drew for advice?” He considers that for a moment. “Scratch that. Never mind.” He walks over and leans up against the door of his car. “Okay, then. What does she like?”\u003c/p\u003e\n\u003cp\u003e“Running and ice cream. And hitting things. And names.”\u003c/p\u003e\n\u003cp\u003e“Names?”\u003c/p\u003e\n\u003cp\u003e“Don’t ask.”\u003c/p\u003e\n\u003cp\u003e“Well, the whole sweat and adrenaline rush from the running might be nice for foreplay but I don’t think it’s going to play well on a first date. You’d be better off going with ice cream. Very chaste. Like her.” He smirks.\u003c/p\u003e\n\u003cp\u003e“I thought you were going to be serious.”\u003c/p\u003e\n\u003cp\u003e“I was being serious.” He stops and I can tell he’s trying to decide something. “How do you know so much about her anyway? She doesn’t even talk.” It’s almost like what I said to Mrs. Leighton, but Clay’s intentions are different.\u003c/p\u003e\n\u003cp\u003e“Already did the ice cream thing.” I ignore his question.\u003c/p\u003e\n\u003cp\u003e“Then it looks like you’re down to hitting things.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 37\u003c/p\u003e\n\u003cp\u003eNastya\u003c/p\u003e\n\u003cp\u003eIs it sad to be going on a first date at eighteen years old? I thought about texting Josh to cancel at least six times today. At one point I finally did text him that I couldn’t go because I had nothing to wear. He texted me right back –\u003c/p\u003e\n\u003cp\u003eNothing sounds good c u at 4\u003c/p\u003e\n\u003cp\u003eSo now I’m stuck. The only thing that makes me feel better is that Josh seems to be as socially inept as me. Except that he talks. So I guess he gets the edge. But still. I really need him. I don’t want to mess this up. It’s bad enough that my brain is a cesspool; I can’t imagine the hellhole my heart would be if he wasn’t in it.\u003c/p\u003e\n\u003cp\u003eSince wearing nothing isn’t really a viable option, I’m back to square one. I have absolutely no idea what to wear. My fashion sense isn’t lacking. It’s nonexistent. I went from recital clothes to recovery clothes to repulsive clothes. I’ve never done normal. I don’t even know what that is. This is where the female friend thing would come in. I would have sucked it up and written a note asking Margot to help me, but the whole idea was kind of last minute and she had plans this afternoon so she’s not even home. Which means my closet and I are on our own.\u003c/p\u003e\n\u003cp\u003eMy closet is of no use to me. It may actually be laughing at me. It’s true. I hear it. Other than the sundress I wore yesterday, I’m out of options in the normal department. I look at my clothes. Black, black, some more black. I don’t want to wear any of it. I don’t want to look like Nastya Kashnikov tonight. I don’t want to be a Russian whore. I don’t want to look like Emilia, either. Maybe for tonight I could just be someone else. Some third girl I haven’t met yet.\u003c/p\u003e\n\u003cp\u003eI realize with a craptastic amount of horror that I am going to have to go to the mall. I throw on one of the eight variations of tight black t-shirts I own and a pair of jeans and head out.\u003c/p\u003e\n\u003cp\u003eOnly I don’t end up at the mall. I end up at Drew’s. The God that I have recently come to think might hate me is smiling on me today because Sarah isn’t home. But then neither is Drew. Mrs. Leighton opens the door. I look at her stomach which seems to have grown exponentially since the last time I saw her.\u003c/p\u003e\n\u003cp\u003e“Hey sweetie,” she says and she’s the only person on Earth I don’t have the urge to smack for calling me sweetie. She lets me in after explaining that Drew and Sarah went out on a friend’s boat with Mr. Leighton. She pours lemonade and we sit at the breakfast bar and stare at each other.\u003c/p\u003e\n\u003cp\u003e“Oh!” she says after a few minutes, and I’d gotten so accustomed to the quiet that I almost fall off the stool. She grabs for my hand and I yank it back out of instinct before I can think about it. I feel like a fool but she ignores it. “I just wanted you to feel the baby kick,” she says reaching for my hand and letting me meet her halfway. She places it on her stomach and it’s the weirdest feeling in the world. I almost expect an alien to burst through her abdomen at any moment.\u003c/p\u003e\n\u003cp\u003e“Feel it?” she looks at me expectantly. I pull my hand back. I can’t help but see the hurt on her face but I’m too afraid I might start crying and I can’t keep my hand there anymore. “Sorry,” she says. “I just get a little excited. You’d think the third time around it wouldn’t be a big deal, but it never gets old. It’s my favorite part.” It would probably be mine, too, but I won’t ever get to find out. Maybe I never would have wanted one anyway, but the deciding would have been nice. The piece of shit who took my hand took that, too.\u003c/p\u003e\n\u003cp\u003eAll I wanted was to figure out what to wear on a date I probably shouldn’t even be going on and I don’t know how I ended up with my hand on Mrs. Leighton’s stomach, feeling her baby kick and fighting back tears.\u003c/p\u003e\n\u003cp\u003eMrs. Leighton doesn’t do well with the silence. She’s a space filler. “It’s a girl,” she says. “We just found out.”\u003c/p\u003e\n\u003cp\u003eThere’s a pad of paper and a pen next to the phone on the counter. I pick it up and write.\u003c/p\u003e\n\u003cp\u003eName?\u003c/p\u003e\n\u003cp\u003e“Catherine,” she says. “After Jack’s mother.”\u003c/p\u003e\n\u003cp\u003eI smile because I know that one. Pure, unsullied I scrawl and hand it to her.\u003c/p\u003e\n\u003cp\u003eShe returns the smile. “Drew said you had a thing with names. What does mine mean? Lexie, well, Alexa, really. Do you know?”\u003c/p\u003e\n\u003cp\u003eDefender I scribble and underneath You. Then, before she asks, I give her Drew’s – masculine, manly and Sarah’s – princess. She rolls her eyes and laughs. “Self-fulfilling prophecies, you think?” The quiet returns and then she asks, “What about Josh?” I think there’s more to that question than she’s letting on but she’s testing the waters.\u003c/p\u003e\n\u003cp\u003eSalvation, I write. She looks at the word and nods. And for a minute she looks as sad as I feel. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sea-of-tranquility/page-39.html","bookId":1857,"creation":"Oct 5, 2019 4:27:42 PM","modification":"Oct 5, 2019 4:27:42 PM"}
