{"id":80522,"no":45,"title":"Page 45","content":"\u003cp\u003eClay is looking happier with the picture now. His face is relaxed. When he’s frustrated, his face tenses and he twists the bottom of his shirt around. I spend a lot of time staring at him, too. Not much else to do.\u003c/p\u003e\n\u003cp\u003e“But enough about me. Let’s talk about you. What first? I bet your classic is why don’t you talk? I’m right aren’t I? But I’m going to skip that one. I think there are far more interesting questions to ask.”\u003c/p\u003e\n\u003cp\u003eHe asks his questions. Lots of them. But he doesn’t get any answers from me so he comes up with his own. He takes pleasure in telling me how the world is coming to an end because Josh Bennett lets me sit with him at lunch and has been seen not only having unsolicited conversations with people but also, gasp, smiling. And that thought makes me smile, which Clay seems to appreciate.\u003c/p\u003e\n\u003cp\u003eAccording to Clay, the prevailing explanation for my foray into the Josh Bennett Dead Zone is that I must already be dead. That one amuses me because they think it’s funny, but I think it’s kind of true. Other people are sure I’m in a cult and I’m brainwashing him. That theory is my favorite. I’ll have to let Josh know.\u003c/p\u003e\n\u003cp\u003e“At least you shouldn’t have to worry about that shitdick Ethan after today,” Clay continues.\u003c/p\u003e\n\u003cp\u003eI look at him, confused.\u003c/p\u003e\n\u003cp\u003e“You didn’t hear about that?” His eyes are wide but I don’t know why, because he knows no one really speaks to me. “This afternoon, Ethan was walking down the hall and bragging about you blowing him in the bathroom.”\u003c/p\u003e\n\u003cp\u003eI shrug. This isn’t anything new. Ethan spews this crap all the time, especially since he’s figured out that I don’t dispute it. The only three people I care about know it’s not true, and I have a feeling that everyone who knows Ethan, knows it’s not true also. Clay must see my lack of shock and it makes him almost giddy at the fact that he gets to tell me the rest of this story.\u003c/p\u003e\n\u003cp\u003e“Yeah, ok, not a big deal, right? But this time he did it with Josh walking behind him. It was awesome. Michelle and I had a front row seat. Josh nailed Ethan to the wall and Ethan’s like ‘You don’t scare me, Bennett.’ and Josh is like ‘Good. Then you won’t run the next time you see me coming, because if you ever say her name again, I’ll make it possible for you to suck your own dick.’ The best part was that Josh never even raised his voice. Just flat, scary freaking calm. Then he let Ethan go and walked away like nothing happened.” He raises his eyebrows at me. “See? Awesome.”\u003c/p\u003e\n\u003cp\u003eI don’t really think it’s so awesome. I know how much Josh hates to call attention to himself and I wish he didn’t think he had to do it for me.\u003c/p\u003e\n\u003cp\u003eClay finishes the drawing, and when he starts cleaning up, I go grab my stuff. At this point, I’ve paid my debt for his door-holding ten times over. I figure he owes me something now. When he’s done, I pull the photograph I’ve been holding for days out of my backpack and hand it to him. Then I grab a sheet of paper and a pen and ask for what I want.\u003c/p\u003e\n\u003cp\u003eCHAPTER 45\u003c/p\u003e\n\u003cp\u003eNastya\u003c/p\u003e\n\u003cp\u003eI didn’t remember what actually happened to me until over a year after it did. For days, then weeks, then months, I knew what everyone else knew. I knew that I left home to walk to school to record my last audition piece. I had gone home to change and get ready first, before heading back to campus. I agonized over every aspect of my appearance that day, especially my hands. I meticulously painted my nails to perfection. I wore a pale pink blouse with pearl buttons and a white eyelet skirt and everyone knew what I was wearing because they found me in it, even if the buttons were torn off.\u003c/p\u003e\n\u003cp\u003eI knew exactly where I was found in a heavily wooded section of the preserve that separated the park I cut through that day from the subdivision behind it. I knew that they didn’t find me until late that night because a thunderstorm had rolled in, making the search nearly impossible. By that time, the Amber Alert had been running all over the state for hours. My name, my picture, my description. Everywhere. Even after they found me, the morbid curiosity didn’t stop. People never can get enough of tragic stories about pretty little girls. I was good entertainment for a while, especially during the will she or won’t she period, when they didn’t know if I’d live.\u003c/p\u003e\n\u003cp\u003eI knew that when they got me to the hospital I was taken into surgery immediately and my heart stopped on the table for ninety-six seconds before they were able to restart it again.\u003c/p\u003e\n\u003cp\u003eI knew what had happened to me by piecing together an extensive list of injuries. For months, that’s what I felt like. A list of injuries. A sum total of hurts. My entire body was made of pain.\u003c/p\u003e\n\u003cp\u003eOne day I overheard one of my many doctors talking to a police detective when he didn’t know I could hear. Have you caught that monster yet? he asked. The detective told him that they hadn’t. You should string him up when you get him. He ruined that poor girl. I guessed he was right, because that was exactly how I felt, and when you hear your doctor saying that you’re ruined, you figure he knows what he’s talking about.\u003c/p\u003e\n\u003cp\u003e“Did you always sleep with a shirt on? Before me?” I ask Josh when we get into bed. Asher hates sleeping in a shirt. He insists that all guys hate sleeping in clothes but I don’t know if it’s true. Josh always sleeps in a t-shirt and boxer shorts, which is usually what I’m sleeping in, too. Josh won’t let me fold his underwear, but apparently he doesn’t have a problem with my wearing them.\u003c/p\u003e\n\u003cp\u003e“Before you, I didn’t sleep with anything on,” he says, and I can hear the smile in his voice, even if I can’t see it.\u003c/p\u003e\n\u003cp\u003e“Oh.” I feel my face get hot. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Don’t be,” he laughs. “It’s a good trade off.”\u003c/p\u003e\n\u003cp\u003eHis hand finds its way up to my cheek. He leans down and kisses me and his lips are an invitation I’m going to have to accept sooner or later. “If I didn’t know you better, I’d think you were blushing.”\u003c/p\u003e\n\u003cp\u003eBut the fact is that he doesn’t know me better. He doesn’t really know me at all.\u003c/p\u003e\n\u003cp\u003eFor the first time in weeks, we’re not spending half the night in the garage. It’s still early, but I tell him I’m tired and I want to go to bed. I’m not tired. I’m just hoping he’ll follow me. After about fifteen minutes, I hear him come out of the shower and then he climbs in next to me. He kisses the side of my head and says good night and then laces his fingers through my mine like he always does; like he’s reminding me that he’s still here, or maybe vice-versa.\u003c/p\u003e\n\u003cp\u003eI slide my hand under the fabric of his t-shirt, up his stomach until it’s flat against the skin on his chest and I can feel his heart beating against my palm. I can just hear his breath hitch because he didn’t see it coming. He’s warm and solid and I want to touch every part of him. I should stop this, because I know where it’s going. But I’m the one who started it, and really, I just don’t want to.\u003c/p\u003e\n\u003cp\u003e“Sunshine.” It’s all he says.\u003c/p\u003e\n\u003cp\u003eHe rests his hand on top of mine through the fabric of his shirt. “You can take it off if you want to,” I tell him.\u003c/p\u003e\n\u003cp\u003e“I’d rather take off yours,” he jokes.\u003c/p\u003e\n\u003cp\u003e“That, too,” I say, but I’m not joking. I feel him tense just slightly under my hand, but he doesn’t move to do anything, and we lay there for a minute, just breathing and trying to read each other’s thoughts.\u003c/p\u003e\n\u003cp\u003e“You have my permission,” I whisper.\u003c/p\u003e\n\u003cp\u003eIt isn’t like I’ve never touched him and he’s never touched me. Just never everywhere at once. I’m in one of his t-shirts, like always, and he pulls it up over my head and I let him because that’s what I want. I want him to touch me. Here. Now. Everywhere. Always.\u003c/p\u003e\n\u003cp\u003e“I wish I could see you,” he says.\u003c/p\u003e\n\u003cp\u003e“I’m glad you can’t,” I admit. Too many scars. I can blame them even if they aren’t the real reason.\u003c/p\u003e\n\u003cp\u003eI’m more at peace with Josh than anywhere else in the world and I want to run away before I ruin us both. But then his shirt is off, too, and his body is pressed against mine so that there’s no space between us. He pushes my hair away, muttering something about “stupid hair always in your face,” but he keeps his hand tangled in it, and then he kisses me, and that’s what we do for a long time.\u003c/p\u003e\n\u003cp\u003eSomehow he leaves my body just enough to reach his nightstand to get a condom which I think about telling him he doesn’t need. Then he’s leaning over me and kissing me again and I let myself focus on just that. Because it’s real. It’s true. One, real, amazing, true thing. And then his knee slips between mine gently pushing them apart and a moment later I can feel the pressure of him. I know the exact moment when he realizes‌—‌realizes one of the thousand things I never told him. Because he stops right there. Suddenly eerily still. He’s not kissing me anymore. He’s staring at me and his face is so close to mine that I think he can read my mind.\u003c/p\u003e\n\u003cp\u003eI know he’s going to say something, but I don’t want him to, because it will make me tell him things. He’ll make me feel safe and safe is something I should never feel again.\u003c/p\u003e\n\u003cp\u003eThere are a thousand words in his eyes but all he says is, “Sunshine?” It’s not my name. It’s a question. Or maybe it’s more than one, but I don’t let him say anything else.\u003c/p\u003e\n\u003cp\u003eI reach around him, though I’m not sure this will even work, and I tilt my h*ps up and shove him towards me. And, for just a second, there’s tearing and burning, and then it’s done. I squeeze my eyes shut because pain is familiar and grounding and I’d rather give myself to that. I’m used to pain and this really isn’t so bad. It’s the look on his face that I’m not used to – awe, confusion, wonder and please, please, please don’t let it be love.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” He’s inside me but he still doesn’t move. His hands are on either side of my face and he looks like he’s scared of me.\u003c/p\u003e\n\u003cp\u003e“Yes,” I whisper, but I don’t know if it comes out. I don’t know if I’m okay. It shouldn’t be possible to be this close to another person. To let them crawl inside you.\u003c/p\u003e\n\u003cp\u003eCHAPTER 46\u003c/p\u003e\n\u003cp\u003eJosh\u003c/p\u003e\n\u003cp\u003eWhen it’s over, we’re both shaking, and for a moment I’m confused and comforted and loved and then I’m lost. I don’t know what happened. Just that it did. And she’s here, but she’s not. And I want to be happy, but I can’t, because she’s crying underneath me. At first, it’s just soft and barely there and I hardly recognize what’s happening because I’ve never seen her cry. Then her body starts racking with it and it’s so jagged and wrong. There’s still barely any sound coming out, but it’s the shaking that’s almost worse and it steals every undeserved ounce of joy I felt just the moment before.\u003c/p\u003e\n\u003cp\u003eI need to get away from here. I wish she would stop crying, because I don’t think I can take it for one more second and it’s not like it’s loud or melodramatic. It’s not. It’s just heartbreaking.\u003c/p\u003e\n\u003cp\u003eI don’t know what I did, so I just hold her and whisper I’m sorry, because I don’t know what else to do. I’m sorry. Again and again and again against her hair. I don’t know how many times I say it or for how long, just that I can’t stop. But she doesn’t stop crying and I know that it’s not enough.\u003c/p\u003e\n\u003cp\u003eShe’s gone in the morning and I don’t know if she’s gone from the bed or the house or from everything.\u003c/p\u003e\n\u003cp\u003eShe isn’t at school. I called her phone three times, even though I’m not supposed to, but she didn’t answer. I didn’t expect her to. I wanted to text her but I couldn’t think of any words that wouldn’t sound desperate.\u003c/p\u003e\n\u003cp\u003eWhen I get home, she’s waiting in my garage. She’s on the counter where she used to sit and her chair is empty on the other side.\u003c/p\u003e\n\u003cp\u003eI hit the button and the automatic door lowers, bringing all of the dread of this moment down with it. I walk into the house, because I don’t want to do this in my garage. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-sea-of-tranquility/page-45.html","bookId":1857,"creation":"Oct 5, 2019 4:27:42 PM","modification":"Oct 5, 2019 4:27:42 PM"}
