{"id":24636,"no":66,"title":"LXIV. In Earnest","content":"\u0026nbsp;1 \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n SHE had never seemed more dazzling to him, and more remote, than in the hours that followed. They lay on the beach and watched the sunset, and wandered arm in arm through the brief twilight into the darkness. She was happy; and her happiness was a mockery to him. She was tender and passionate—and in that very excess of tenderness and passion seemed to confess to him that this was the end.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was playing at marriage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the vast night the moon rose slowly behind the hills, unseen but palely tinging the sky. They went past stray bonfires far up the shore until they could see it, a slender crescent, cradled between two hills.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Its light faintly touched the edges of the waves with silver.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What would it be like,” Rose-Ann wondered, “to bathe in icy moonlight? Shall we?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He remembered the time at Woods Point, the first morning of their marriage when she had slipped from their warm bed while he slept, to plunge into the snow. He remembered the sudden loneliness with which he had awakened, and her naked footprints in the snow.... It seemed profoundly characteristic of all her strangeness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n What other woman in the world would have left, at dawn, the bed of happy love, to keep such an icy tryst! It was like their whole married life: the warmth of mere human happiness had not satisfied her; she must go out into the bleak strange arctic spaces of emotion; and he must go, too.... Well, let her keep her cold assignation with the moonlight alone, this time!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” he said resentfully, and gathered driftwood for a 423fire, while she undressed in the darkness.... He saw her go in, crying out with delight at the water’s bitter coldness, and emerge, white and slender and dripping with silver moonlight, from the waves.... And this was the creature he had tried to make his wife! This seeker after strange and impossible beauty!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He remembered that he had offered her, in some playful madness that day, a house. A house in the environs of Chicago! Thank heaven, she would never know that he had been in earnest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She had dried her body miraculously on the tiny tea-towel from their lunch-basket and resumed her clothes by the time his fire was alight, and she came up laughing and hungry, demanding food. He unpacked from the little basket the supper which their hosts of the tea-shop had prepared for them. She munched sandwiches while he broiled bacon on a stick over the blaze.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We could do this every night on the Dunes,” she said—and his heart leaped.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Rose-Ann,” he said. “Don’t torment me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She took his hand. “Do I torment you?” she asked. “I don’t mean to. I’m sorry!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Was it surrender? he wondered—or some new evasion?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Our marriage—” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh! Must we talk about it?” Her voice was wistful. “We’re so happy—as we are.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “As we are.... But what are we?” he demanded painfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Together....” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And then, when he did not speak, she asked, a little coldly,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you want me to say, Felix?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know.... There are so many things to say.... All the things we haven’t said....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Must we say them, Felix? Well, then—I’m sorry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “For what?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “For everything.... Felix, if we had met each other for the first time now—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 424“We could be very happy, I think. Oh, I know we could!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have we hurt each other so much, then?” he asked sadly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s not that.... All that was my fault.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. I’ve thought everything out. And sometimes I think I’m not sorry that it happened. Because I’ve learned some things I didn’t know—about myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d rather not.... Felix, I’m not the same person I was. I’ve found things in myself I’m frightened of. Don’t make me tell them....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish you would.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They’re not nice things, Felix.... I woke up last night hating you....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her voice was shaken.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m sorry, Rose-Ann,” he said contritely. “You have a right to hate me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” she said. “It’s not what you think. It’s something else—something you’d never guess.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Suddenly she threw herself face down on the sand and began to cry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He put his hand on her shoulder. She drew herself away from his touch with a convulsive movement. He looked on, hurt and baffled and frightened.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She sat up, seized his hand and pressed it desperately. “Why can’t I trust you?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had lost all clue to her thoughts. “I wish I could help you,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know—perhaps I’m trying to fool myself again.... What are you really like, Felix?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was looking away from him, gripping his hand, staring blindly into the darkness. She seemed not to be speaking to him. He did not answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her hand relaxed its grip upon his, and she said, drying her tears,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I despise myself....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “For crying?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 425“No—for what we’ve done.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He thought he knew what she meant. “For—playing at marriage?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” she said strangely, “playing at marriage....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had a moment of clairvoyance, a moment in which his mind saw into the one same realm of memory with hers.... He saw them, beside another camp-fire, talking....\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not afraid,” he repeated aloud the words she had said to him then, “not afraid of life or of any of the beautiful things life may bring us....”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Felix!” she cried out. “Don’t!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was seeing another picture, of themselves walking in a park under great trees that lifted their shivering glooms to the sky. “Everything,” she had said, “is all right now.” What mockery! And he felt, again, forces that he did not understand hurling themselves on his heart crushing and stunning it....\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We were afraid of life,” he said. “We were cowards. Despise me, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Felix!” she cried, “you did care!... I never knew!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 2\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They looked into the dying embers of the fire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His mind, as by a shadowy wing, was touched with a faint regret ... for what?... for an old dream, beautiful in its way—a dream of freedom; but a dream only—and worthy only the farewell tribute of a faint and shadowy regret.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What shall we do?” she whispered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let’s build our house, Rose-Ann. Will you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2781/77062.html","bookId":1311,"creation":"Aug 3, 2019 2:17:13 PM","modification":"Aug 3, 2019 2:17:13 PM"}
