{"id":30620,"no":11,"title":"CHAPTER 11","content":"\u0026nbsp;Kaflis and his charge again reached the garden. The twilight was nearly past. A horseman galloped up to them, followed by several running footmen. It was the prince. \n\u003cdiv\u003e\n “Well, Hakim,” he inquired, in his usual abrupt style, “can you cure her?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes;” answered Iskander, firmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now listen, Hakim,” said Mahomed. “I must very shortly leave the city, and proceed into Epirus at the head of our troops. I have sworn two things, and I have sworn them by the holy stone. Ere the new moon, I will have the heart of Iduna and the head of Iskander!”\n\u003c/div\u003e \n\u003cdiv\u003e\n The physician bowed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you can so restore the health of this Frangy girl,” continued Mahomed, “that she may attend me within ten days into Epirus, you shall claim from my treasury what sum you like, and become physician to the Seraglio. What say you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My hope and my belief is,” replied Iskander, “that within ten days she may breathe the air of Epirus.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By my father’s beard, you are a man after my own heart,” exclaimed the prince; “and since thou dealest in talismans, Hakim, can you give me a charm that you will secure me a meeting with this Epirot rebel within the term, so that I may keep my oath. What say you? what say you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There are such spells,” replied Iskander. “But mark, I can only secure the meeting, not the head.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is my part,” said Mahomed, with an arrogant sneer. “But the meeting, the meeting?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know the fountain of Kallista in Epirus. Its virtues are renowned.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have beard of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Plunge your scimitar in its midnight waters thrice, on the eve of the new moon, and each time summon the enemy you would desire to meet. He will not fail you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you cure the captive, I will credit the legend, and keep the appointment,” replied Mahomed, thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have engaged to do that,” replied the physician.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, then, I shall redeem my pledge,” said the prince\n\u003c/div\u003e \n\u003cdiv\u003e\n “But mind,” said the physician, “while I engage to cure the lady and produce the warrior, I can secure your highness neither the heart of the one nor the head of the other.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “‘Tis understood,” said Mahomed.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2868/79268.html","bookId":1180,"creation":"Aug 5, 2019 2:27:31 AM","modification":"Aug 5, 2019 2:27:31 AM"}
