{"id":98141,"no":1,"title":"Page 1","content":"\u003cp\u003eStarted by ARIADNE at xxx p.m. xxx xxx BC GMT\u003c/p\u003e\n\u003cp\u003eI shall construct a labyrinth in which I can lose myself, together with anyone who tries to find me\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;who said this and about what?\u003c/p\u003e\n\u003cp\u003e:-)\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eWhat\u0027s going on? Is there anyone there ...?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI\u0027m here.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eSo what\u0027s going on round here?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eYour guess is as good as mine.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eAriadne, are you there?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWho\u0027s she?\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eShe started this thread. Seems this isn\u0027t the Internet, just looks like it. You can\u0027t link to anywhere else from here.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003exxx\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eHello! If anyone can read this, please answer.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eI can read it.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eWho posted the first message?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eIt\u0027s been up on the board a long time.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eHow can you tell? There\u0027s no date on it.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eI saw it three hours ago.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eAttention, roll-call. There\u0027s just Nutcracker, Romeo and me here, is that right?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eThat\u0027s right.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eAt least, we\u0027re the only ones who want to join in.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eRight, so there are three of us here.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eBut where is here exactly?\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eHow do you mean?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eQuite literally. Can you describe where you are now? What is it\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;a room, a hall, a house? A hole in someone\u0027s xxx?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWell I\u0027m in a room, anyway. Or a cell, I can\u0027t tell which is more correct. Not very big. Green walls, white ceiling lamp. A bed by one wall and by the opposite wall a desk with the keyboard I\u0027m typing on right now. The keyboard is attached rigidly to the desk. Above the desk there\u0027s an LCD screen set in the wall behind thick glass. That\u0027s where all these letters appear. It\u0027s impossible to break, I tried already. The room has two doors, one made of strange, blackish-green metal. It\u0027s locked. There\u0027s a raised section in the middle of it. The other door\u0027s made of wood, painted white, and it leads into a bathroom. It\u0027s open.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eI\u0027ve got the same as Romeo. A locked metal door with some kind of relief design on it. A hotel-style bathroom with soap, shower gel and shampoo on the shelf under the mirror. Everything in packaging marked with a strange symbol\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;something like a little cogwheel. So where are you, Nutcracker?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eIn the same kind of room. I think the door\u0027s made of cast bronze. But Organism, the symbol on the soap looks more like a star than a cogwheel. In fact it looks like the symbol they use in books for a footnote. It\u0027s even on the loo paper, every sheet.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eSo we\u0027re all in the same hotel. Let\u0027s try knocking on the walls. Can you hear anything?\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eMe neither.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eI\u0027ll try knocking on the door, listen.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI can\u0027t hear a thing.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eSo how did we get here?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003ePersonally speaking, I haven\u0027t got the slightest idea. How about you, Organism?\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eI just woke up here wearing this pooftah\u0027s housecoat with nothing underneath it.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eIt\u0027s not a housecoat. It\u0027s a chiton\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;the kind of tunic the ancient Greeks used to wear, so I won\u0027t take issue with your opinion of it. I don\u0027t think they wore any underclothes either.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eIt\u0027s a good job it\u0027s warm in here then.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eSo, maybe you remember how you got here, Nutcracker?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eNo, I don\u0027t.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWhy have you two got such odd names\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;Organizm, Nutscracker?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eWell, why have you got such an odd name, Romeo? Is your cohiba really such a whopper?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI suppose that depends whose you compare it with. And anyway, it wasn\u0027t me who invented the name. It just appears on the screen when I send a message. I\u0027m not Romeo, I\u0027m xxx. A professional xxx, if anyone\u0027s interested.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003ePorn business? Socially significant work. You and I are almost colleagues, Romeo\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;I\u0027m a xxx. I used to work at xxx.com, so I\u0027m temporarily out of a job. But there\u0027s not much danger of that for you.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eHow did the porn business get mixed up in all this? And what are all these x\u0027s?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eThat\u0027s not the first time they\u0027ve appeared. It\u0027s the censor. Someone\u0027s monitoring our conversation. And he doesn\u0027t like it when we try to exchange information about who we really are. Or start swearing.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eHey, you, whoever you are! I demand that you allow me to contact my family immediately! And the xxx embassy!\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eWhat makes you think there\u0027s a xxx embassy here?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eThere\u0027s a xxx embassy everywhere.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eAre you sure? What if we\u0027re in xxx?\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eApparently you guys can understand each other without words. But I don\u0027t understand what the xxx embassy is, and where xxx is, if there\u0027s no xxx embassy there. And what the xxx you want it for anyway.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eHi there, is it okay if I join in your discussion?\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eWho are you, Monstradamus?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003exxx. I live in xxx and I\u0027m a xxx.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003ePerhaps you ought to try something a bit more original?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI\u0027ve read all the messages on this thread. I\u0027m in the same situation, the same room, the same fancy getup. And I don\u0027t remember how I got here, either.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eSo now we are four. That\u0027s nice.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eWhat\u0027s so nice about it?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eMaybe more will turn up soon. The more heads we have, the better our chances of coming up with something.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eAnd what if we\u0027ve simply died?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eDon\u0027t panic! Dead people don\u0027t hang around in chat rooms.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eWe don\u0027t know that for a fact. Maybe that\u0027s all they can do.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eIf this is the afterlife, then I for one am disappointed.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eLet\u0027s discuss the situation. I suggest we don\u0027t take Organism\u0027s hypothesis about the afterlife into consideration.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eThen maybe it\u0027s a dream?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003ePinch yourself. Maybe you\u0027ll wake up. I tried already, it didn\u0027t work.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eRight, so everybody has a bronze door. Let\u0027s try figuring out the design on that door. It\u0027s a figure like a rectangle with the upper and lower edges bent inwards and the sides bent outwards.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eIt looks like a bat. Or the Batman symbol.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI reckon it\u0027s a double-headed axe.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eMaybe it\u0027s just decoration, without any meaning. But Romeo saying it looks like an axe has made me think so too. The fascists used to have axes like that\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;or was it the ancient Romans?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eIf it is an axe, it\u0027s much older than Rome. They used to have axes like that in Crete and ancient Egypt.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eAre you a historian then, Monstradamus?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eNo. I\u0027m a xxx.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eHey, that\u0027s right. I forgot. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-helmet-of-horror/page-1.html","bookId":2606,"creation":"Oct 5, 2019 6:32:10 PM","modification":"Oct 5, 2019 6:32:10 PM"}
