{"id":98143,"no":3,"title":"Page 3","content":"\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI think he/she means what he/she says.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eI\u0027m female, since it interests you so very much. My name\u0027s xxx, I\u0027m a xxx by profession and a xxx by education, but by vocation I\u0027ve always been a xxx. I\u0027ve read everything already. And I have nothing interesting to add. As for whether I\u0027m being serious or not, you can be quite sure I always mean what I say.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eTell me, Ugly, did you invent your views to match your name or was your name invented to match your views?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eMy name\u0027s for my sins. And so is yours.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eBut do you know what \u0027UGLI\u0027 really means? It\u0027s not from the word \u0027ugly\u0027 as you probably thought. It\u0027s \u0027Universal Gate for Logic Implementation\u0027. A universal logic element, I remember that from school. So if you chose your views to match your name you were looking in the wrong place altogether.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eWe were talking about Ariadne\u0027s dream. It has been suggested that she was shown it specially and it contains information for everyone.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWhat does that mean\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;shown it specially? This isn\u0027t a cinema. And if the information\u0027s for everyone, then why was it shown to Ariadne?\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eYou\u0027ll get a showing too, don\u0027t be in such a hurry.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eYou think that monster in the bronze helmet really is walking about outside our doors?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eYou don\u0027t have to take everything so literally. In the dream the door was made of wood, with a bull\u0027s head. But in here it\u0027s made of bronze, with an infernal symbol. Dreams are metaphorical.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eAriadne saw Romeo in her dream and when she described him he recognised himself. What kind of metaphor is that?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWho says I recognised myself? It was just a couple of details that matched.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eBut what kind of details? There can\u0027t be many tattoos like that. An anchor with a dollar sign.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eLet\u0027s introduce a bit of clarity here. I actually do have a tattoo on my arm, just above the wrist. It\u0027s a fountain of oil, gushing up through a dollar sign. From upside down it looks a bit like an anchor. That\u0027s all. I don\u0027t know what tattoo she saw. And my yacht club symbol is nothing like that.\u003c/p\u003e\n\u003cp\u003eSartrik\u003c/p\u003e\n\u003cp\u003exxx me, a xxx sailor.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eNew members, once again, please introduce yourselves.\u003c/p\u003e\n\u003cp\u003eSartrik\u003c/p\u003e\n\u003cp\u003eI\u0027m absolutely xxx. My entire body aches.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eHave you been beaten up, or what?\u003c/p\u003e\n\u003cp\u003eSartrik\u003c/p\u003e\n\u003cp\u003eI feel sick. Is there any beer to be had around here?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI doubt it. Did you overdo it yesterday then?\u003c/p\u003e\n\u003cp\u003eSartrik\u003c/p\u003e\n\u003cp\u003eSomething of the sort.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eHow did you end up in here?\u003c/p\u003e\n\u003cp\u003eSartrik\u003c/p\u003e\n\u003cp\u003eI don\u0027t remember a thing.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eLeave the man alone, let him get his head together. But can this dream of Ariadne\u0027s be interpreted scientifically? Seems to me Monstradamus knows about that kind of thing.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eWhat does \u0027interpreted scientifically\u0027 mean?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWell, for instance, this Asterisk is tall, with a big helmet. That symbolises the male sexual organ in a state of erection.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eAnd the two dwarves symbolise the balls, do they?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eCool it, Romeo. Sometimes a cochiba\u0027s just a cigar.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eCould you talk about that separately somehow?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eI second that motion.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eUnfortunately we can\u0027t just go out into the corridor.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eYou didn\u0027t answer the question, Monstradamus. Can the dream be analysed?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eIf you\u0027re thinking of penis symbolism, then I\u0027ve got nothing to add to what Nutcracker said. But I do have a few observations along an entirely different line. I can share them if you\u0027re interested.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eOf course we\u0027re interested.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eIn the first place, the names. Has anyone any guesses on that score?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eNames of demons from hell.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eThe soap, the toilet paper and other items in the bathroom are all marked with something that looks like the symbol for indicating a footnote\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;a little star. It\u0027s called an asterisk, which is also the name of the character Ariadne dreamed about. It sounds a lot like \u0027Asterius\u0027.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eWhat\u0027s \u0027Asterius\u0027?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003e\u0027Starry\u0027 in Latin. Asterius, the son of Minos and Parsiphae. The half-man, half-animal from Crete. Better known as the Minotaur.\u003c/p\u003e\n\u003cp\u003eSartrik\u003c/p\u003e\n\u003cp\u003eThat one on the \u0027Remy Martin\u0027 bottle?\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eNo, the \u0027Remy Martin\u0027 beast is a Cyclops. The Minotaur is a freak with a bull\u0027s head.\u003c/p\u003e\n\u003cp\u003eSartrik\u003c/p\u003e\n\u003cp\u003eGod, I feel really sick.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eNow for that double axe on the door. In Greek it\u0027s called a \u0027labros\u0027. That\u0027s where we get the word \u0027Labyrinth\u0027, the place where the Minotaur lived. Some accounts say it was a beautiful palace with lots of corridors and rooms, according to others it was a foul-smelling cave with numerous branches plunged in eternal darkness. Or it could be that people from different cultures had different impressions of the same place.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eBut what has an axe got to do with a labyrinth?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eThey find them in Crete. Where the labyrinth was. That\u0027s all I know.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eMaybe the Minotaur was killed with an axe like that?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eLet me go on with the names. As well as Asterius and Asterisk, it\u0027s hard not to notice another coincidence. It was Ariadne who dreamed about him. That was the name of the Minotaur\u0027s sister. And it was also Ariadne who started this thread with the question about the labyrinth.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eIt\u0027s a very common name. I had a lotion for dry skin called \u0027Ariadne\u0027s Milk\u0027.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eNames and coincidences are all very well. But what I don\u0027t understand is\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;what are we going to do?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eWell, what can we do? Wait for Theseus, who will lead us out of the labyrinth. And hope the joke doesn\u0027t go too far.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eDoes it seem like a joke to you?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eWell, I\u0027d say our hosts certainly seem to have a sense of humour.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI haven\u0027t laughed even once yet.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eMonster\u0027s right. There\u0027s definitely humour in all of this, only it\u0027s infernal humour. Forcing serious people like us to call each other by idiotic names. Dressing us in ancient Greek chitons and making us sit at these screens. And then the Internet we end up in has about as much to do with the real one as we do with Ancient Greece.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eIt\u0027s not really all that different. The screen design is an imitation of the \u0027Guardian\u0027 site. The heading is the same\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\u0027Guardian Unlimited\u0027. And the chat area looks the same. The difference is there are hundreds of threads there. But we\u0027ve only got one.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eThe name makes sense though. Our Guardian really is unlimited.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eAnd another joke is the Merrill Lynch symbol on the flag.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eBut Ariadne saw the flag in a dream, so it\u0027s not clear whose joke it is. Our moderators\u0027 or hers.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI wouldn\u0027t like to alarm anyone, but shouldn\u0027t we consider the possibility that Ariadne herself is also a joke by our moderators, as Organism called them.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eWhy\u0027s that?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eBecause, phenomenologically speaking, she only exists in the form of messages of unknown origin signed \u0027Ariadne\u0027.\u003c/p\u003e\n\u003cp\u003eAriadne\u003c/p\u003e\n\u003cp\u003eThanks. Ariadne.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eAriadne, please don\u0027t take offence. I\u0027m talking about a hypothetical possibility. It doesn\u0027t mean I suspect you of anything. The same thing could apply to any of us.\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eWhat does \u0027phenomenologically\u0027 mean?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eIt\u0027s the way you can see these words now.\u003c/p\u003e\n\u003cp\u003eAriadne\u003c/p\u003e\n\u003cp\u003eEverything I told you was the truth.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eNobody ever doubted it. Nebuchadnezzar\u0027s just theorising, right?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI\u0027m not Nebuchadnezzar.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eSorry, Monstradamus.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI\u0027m no more Monstradamus than I am Nebuchadnezzar, so what\u0027s the difference?\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eYou know what I think? Either no one\u0027s noticed it or everyone has, but no one\u0027s saying.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWhat\u0027s that, then?\u003c/p\u003e\n\u003cp\u003eOrganizm(-:\u003c/p\u003e\n\u003cp\u003eWe don\u0027t post our messages complete, like in a normal chat room. The words appear on the screen one letter at a time, in real time. We can even interrupt each other, and then three dots appear at the end of the phrase that\u0027s interrupted.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eEveryone\u0027s noticed that.\u003c/p\u003e\n\u003cp\u003eOrganizm(-: \u003c/p\u003e","sourceLink":"https://allnovel.net/the-helmet-of-horror/page-3.html","bookId":2606,"creation":"Oct 5, 2019 6:32:10 PM","modification":"Oct 5, 2019 6:32:10 PM"}
