{"id":98145,"no":5,"title":"Page 5","content":"\u003cp\u003eI\u0027m busy.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eI never understood before why gluttony is a sin. Then a spiritual friend of mine explained. Gluttony is not so very terrible in itself. But it\u0027s a sign of a base soul. The same thing applies to debauchery. The soul doesn\u0027t become debased through committing these acts. A base soul manifests itself through them.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eNo, you won\u0027t get under his skin that easily.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eModerators! Give us all something to eat!\u003c/p\u003e\n\u003cp\u003eAriadne\u003c/p\u003e\n\u003cp\u003eI heard some kind of noise. But where\u0027s the food?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eThere\u0027s a small flap to the right of the monitor. Just a rectangle in the wall. Lift the flap and you\u0027ll find a tray behind it.\u003c/p\u003e\n\u003cp\u003eAriadne\u003c/p\u003e\n\u003cp\u003eI found it, thank you.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eBut what are you supposed to turn? Organism said ...\u003c/p\u003e\n\u003cp\u003eAriadne\u003c/p\u003e\n\u003cp\u003eHe was just joking, Romeo. Having a laugh.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eLet\u0027s all eat in peace. Bon appetit .\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eI\u0027m back. Who\u0027s there?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI am. Is everything all right?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI was worried.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eI was only gone for a moment. Where\u0027s everyone else?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eThey\u0027re eating. There\u0027s just the two of us.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eWhat\u0027s outside your door?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eA labyrinth of neatly trimmed rough bushes higher than my head. And running between the bushes is a dirt pathway.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eAnd I\u0027ve got the same kind of bushes along the sides of an alley.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eAn alley?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eMy door opens into a park. The alley starts right outside and along the sides there are bushes. With treetops showing above them in places.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWhat I\u0027ve got is more like a corridor between the bushes, I wouldn\u0027t call it an alley. And it starts winding straightaway, so I can\u0027t see anything but leaves. It\u0027s more like a narrow corridor than anything else, neatly sliced through the bushes by something like a combine harvester.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eWhat colour is the ground there?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eBeige.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eIt\u0027s beige here too. We\u0027re near each other!\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWhat else did you see?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eI didn\u0027t go very far. There are lots of alleys, and they keep branching and twisting and turning corners. I wasn\u0027t afraid in the least. Quite the opposite, what I saw gave me a really good feeling. The labyrinth might be complex, but it\u0027s impossible to get lost in.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWhy?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eBecause there\u0027s a plan hanging at every place the path branches. And there\u0027s a little sign on the plan: \u0027You are here\u0027.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eThat\u0027s handy all right. And wasn\u0027t there any little sign saying: \u0027The Minotaur is here\u0027?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI was joking. Did you meet anyone?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eNo. But several times I had the feeling there was someone just round the corner.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eAnd was there anything like what Ariadne was talking about?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eYes, kind of. Only not exactly. Once I spotted some roofs above the bushes, but they were a long way off. And I saw fountains with different kinds of figures.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eLike the one Ariadne talked about?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eI don\u0027t know. I went through a few forks in the path and at every one there was a small ... I don\u0027t know what to call it\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;an oasis, I suppose. Trees and a fountain with bronze figures of animals. First a hare and a tortoise. They were sitting facing each other, with their faces lifted up to the sky. Their mouths were open and there were long thin streams of water spurting out. To be quite honest, it looked a bit ridiculous, as though they were spitting at an invisible ceiling that was too high, so that everything just fell back down on their own heads. At another fork there was a fountain with a fox and a crow. The crow was high up in the tree, and so big it looked more like an eagle. There was a water pipe leading up to it, hidden among the leaves. The fox was squatting on his haunches gazing up at the crow as though it was trying to hit it with the stream of water spurting out of its throat, but it couldn\u0027t reach high enough. The crow had its wings pulled back and up and its beak was open, and there was another stream of water spurting out of that, as though the sight of the fox made it feel sick.\u003c/p\u003e\n\u003cp\u003eSartrik\u003c/p\u003e\n\u003cp\u003eNow that\u0027s something I can understand.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eWhat do you understand?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eTake no notice. You\u0027re a wonderful storyteller, Isolde. It was like seeing it all with my own eyes.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eYes, I forgot to say. The plan that was hanging everywhere looked more like an old engraving than something modern. Or like an enlarged photocopy of an engraving. And written on it in this strange oblique typeface was: plan du labirinthe de versailles . What could that mean? Is it from the word \u0027verse\u0027? Because there are characters from fables in the fountains?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eA plan of the labyrinth at Versailles. That\u0027s a real piece of luck.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eVersailles? Then why is it written with a small letter?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI could suggest that\u0027s not really the strangest thing about our surroundings.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eDo you mind not butting into other people\u0027s conversations?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eSorry, I didn\u0027t realise it was private.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eAnd where did you go, Romeo?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI haven\u0027t been outside yet.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eWhy not?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI think it\u0027s some kind of trap.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eI think it\u0027s a trap, too. But we\u0027re already caught in it anyway. And the room you\u0027re sitting in is just as much a part of it as what\u0027s outside the door.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eThat\u0027s true. I suppose I ought to go out and scout around. Maybe I could find the way to your fountains.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eWait, Romeo. It\u0027s dark out there already. You can go tomorrow. Why don\u0027t you tell me what you look like instead? Are you like what Ariadne said?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI don\u0027t understand why everyone\u0027s decided I was the man she dreamed about. The only things we have in common are the tattoo and the moustache. We\u0027ve already dealt with the tattoo. That just leaves the moustache. And that\u0027s like identifying a man by the colour of his tie.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eAre you really bald?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eNot bald, my head\u0027s shaved. That\u0027s a big difference. People go bald because they have no choice, but they shave their heads out of self-respect. Even if it does look the same from a distance. And my mole is really small, you can hardly see it. And anyway, who doesn\u0027t have some kind of a mole on his face?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eAre you handsome?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWhat does \u0027handsome\u0027 mean?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eWell, it means a man is nice to look at.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eNice for who? I got used to the way I look ages ago. And as far as anyone else is concerned, it depends on the circumstances. But one thing I can say for certain is you needn\u0027t be afraid of being with me.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eWhat do you mean? Do you mean I wouldn\u0027t be frightened of you? Or do you mean that with you I wouldn\u0027t have to be afraid of anything?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eHe\u0027s trying to say that if you\u0027re with him even he won\u0027t frighten you.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eJust give people a chance to talk, will you? Isolde, can I ask you something about yourself?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eSuch as?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eSuch as ... Do you like poetry?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eSometimes.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWho\u0027s your favourite poet?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eCaroline Kennedy.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eWhat has she written?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003e\u0027The Favourite Poems of Jacqueline Kennedy-Onassis.\u0027\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eAnd what do you look like?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eHow would you like me to look?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI\u0027d like to know how you really look.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eMedium height. Dark hair. Green eyes. They say I\u0027m beautiful.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eBut can you describe yourself so I can imagine how you look? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-helmet-of-horror/page-5.html","bookId":2606,"creation":"Oct 5, 2019 6:32:10 PM","modification":"Oct 5, 2019 6:32:10 PM"}
