{"id":98149,"no":9,"title":"Page 9","content":"\u003cp\u003eA porcupine.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eYes, that\u0027s it. A porcupine sitting on a bronze tree-stump with water flowing out from it in all directions, as though the beast had suffered bad fright. And the snake is coiled up creeping towards the stump and shooting out a tall jet of water that divides into three branches and falls like rain on the porcupine and everything all around. It\u0027s an incredibly beautiful fountain. The first time I saw it there was a little rainbow suspended in the spray of water beside it, and from that moment on I loved it best of all. There are actually three jets of water, but with different pressures. Their nozzles are set close beside each other in the snake\u0027s mouth, so it looks as though there\u0027s one jet rising into the air and three falling downwards. And I remembered the tattoo on your wrist, the oil and the yachtclub. Does the jet you can see above the bushes divide into three?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eYes, I think so.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eAren\u0027t you absolutely sure?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eI can see a jet of water and the roof of a house when I climb up on to a bench and stand on the back of it. But it\u0027s not possible to stand up there like that for very long, you sway backwards and forwards and then you lose your balance and you have to jump down. That makes it hard to make out the details. But if it is the same fountain you should see my labyrinth when you stand beside it.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eThere\u0027s a tall hedge beside the fountain with the snake and the porcupine and I can\u0027t tell what\u0027s behind it. It\u0027s very long\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;I walked a little way along it, the bushes fence off a large section of park. I think that must be your enclosure.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eIf you\u0027ve walked along that hedge, at one moment we might only have been ten feet apart. I was beside it too, on my own side. I\u0027m practically certain it was the outside hedge. In the first place, there were two rows of barbed fencing instead of just one in the bushes. And in the second place, there\u0027s a spot where you can clearly hear the sound of falling water. Oh and, by the way, beside the spot with the sound of water there\u0027s a long wall protruding from the bushes. It looks like the back of some building and it\u0027s painted with pink and gold Cupids blowing seashells like trumpets. Have you got anything like that?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eThere is a single-storey building to the right of the fountain. It looks like a pavilion for storing garden tools, except that it\u0027s very big. Its back section disappears into the high hedge. But I didn\u0027t see any Cupids on it.\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eCan you get inside?\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eThe door\u0027s locked. Is there a door in your wall?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eIsoldA\u003c/p\u003e\n\u003cp\u003eDoes it open?\u003c/p\u003e\n\u003cp\u003eRomeo-y-Cohiba\u003c/p\u003e\n\u003cp\u003eTo be honest I didn\u0027t try it. I stood beside it for a while and suddenly I felt terrified, I even got a pounding in my temples. I\u0027m not the timid type at all, but suddenly there it was. For no reason at all. I thought\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;who knows what\u0027s inside there? What if it\u0027s the Minotaur?\u003c/p\u003e\n\u003cp\u003e:-)))\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eNutcracker, do you know any Latin?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eThe Senate and People of Rome. P-Q-R-S. No, I\u0027m confusing it with the alphabet. What the Romans had was S-P-Q-R.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eWhy are you interested in Latin, Ugly?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eTo translate a few words.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI\u0027ll give it a try.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eWhat\u0027s \u0027aiselceclesia\u0027?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI don\u0027t know.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eAnd \u0027ieselceaeclesi\u0027?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI don\u0027t know that either. Are you sure it\u0027s Latin?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eWhat else could it be?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI can\u0027t tell yet. Can you give us the whole phrase?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eIt\u0027s very long.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eThen a couple of words at least.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eIt starts: \u0027aiselceclesia ieselceaeclesi selceataecles elceatctaecle\u0027.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eStop, that\u0027s enough for now.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eWhat is it?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eNot so fast. Let me have a think.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eWhere\u0027s it from, Ugly?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eFrom a labyrinth.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eHave you got a labyrinth outside your door?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eWhat else am I supposed to have?\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eCatacombs.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eDon\u0027t mock, Nutcracker.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eThe catacombs were the cradle of the faith. It would have been great reassurance from the Lord.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eShe said before she had a hall full of benches. Now all of a sudden there\u0027s a labyrinth.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eI wish you\u0027d go back to your bitches, Nutcracker, I really do. Can you make anything of it, Monstradamus?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eWere the words written in a column, one under the other?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eCan you type the one that was in the middle?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eWhat do you mean? Which one\u0027s that?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eThe seventh from the top, if that makes it easier.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eEatcnasanctae.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eEat NASA. I can\u0027t make out any other references there.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eWhere did you find it?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eI don\u0027t really want to talk about that.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eWhat if I reproduce the entire inscription, then will you tell me?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eIn that case, yes.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eThe inscription was this:\u003c/p\u003e\n\u003cp\u003eA I S E L C E C L E S I A I S E L C E A E C L\u003c/p\u003e\n\u003cp\u003eE S I S E L C E A T A E C L E S E L C E A T\u003c/p\u003e\n\u003cp\u003eC T A E C L E L C E A T C N C T A E C L C\u003c/p\u003e\n\u003cp\u003eE A T C E A N C T A E C E A T C N A S A\u003c/p\u003e\n\u003cp\u003eN C T A E C E A T C N A N C T A E C L C\u003c/p\u003e\n\u003cp\u003eE A T C N C T A E C L E L C E A T C T A E\u003c/p\u003e\n\u003cp\u003eC L E S E L C E A T A E C L E S I S E L C E\u003c/p\u003e\n\u003cp\u003eA E C L E S I A I S E L C E C L E S I A\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eThat\u0027s right. How did you do that?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eDominus illuminatio mea.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eBut what does it mean?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eThe Lord is my light.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eI mean what does my inscription mean?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eWell, what do you think?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eI can\u0027t make any sense of it at all. What sense is there?\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eThe sense can be very different, depending on where you found it. So you\u0027ll have to be honest about everything.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eAll right. Outside my door there really is a hall with benches. I didn\u0027t really look at it properly at first. But then when I did ... I\u0027m not even sure whether you\u0027ll believe me or not, Monstradamus.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eI\u0027ll give it a try.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eThere\u0027s a cathedral there. A Gothic cathedral.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eYou just said there was a labyrinth.\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eThat\u0027s there too, only inside the cathedral. And in front of the entrance to the labyrinth there\u0027s another Latin inscription laid out on the floor:\u003c/p\u003e\n\u003cp\u003eHVNC MVNDVM TIPICE LABERINTHVS\u003c/p\u003e\n\u003cp\u003eDENOTAT ISTE:\u003c/p\u003e\n\u003cp\u003eINTRANTI LARGVS, REDEVNTI SED\u003c/p\u003e\n\u003cp\u003eNIMIS ARTVS SIC MVNDO CAPTVS,\u003c/p\u003e\n\u003cp\u003eVICIORVM MOLLE GRAVATVS VIX VALET\u003c/p\u003e\n\u003cp\u003eAD VITE DOCTRINAM QVISQVE REDIRE.\u003c/p\u003e\n\u003cp\u003eMonstradamus\u003c/p\u003e\n\u003cp\u003eThe meaning of that is more or less as follows\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\u0027the labyrinth represents the world in which we live, wide at the entrance, but narrow at the exit. He who is ensnared by the joys of this world and is burdened with its sins, may only rediscover the doctrine of life through effort.\u0027 Only don\u0027t ask me what the doctrine of life is. Was there really a wide entrance and a narrow exit?\u003c/p\u003e\n\u003cp\u003eUGLI 666\u003c/p\u003e\n\u003cp\u003eThere wasn\u0027t any entrance or exit at all in the usual sense. The entire labyrinth was laid out on the floor of the cathedral in light-blue marble. It\u0027s just a mosaic.\u003c/p\u003e\n\u003cp\u003eNutscracker\u003c/p\u003e\n\u003cp\u003eIs there such a thing as light-blue marble?\u003c/p\u003e\n\u003cp\u003eUGLI 666 \u003c/p\u003e","sourceLink":"https://allnovel.net/the-helmet-of-horror/page-9.html","bookId":2606,"creation":"Oct 5, 2019 6:32:10 PM","modification":"Oct 5, 2019 6:32:10 PM"}
