{"id":40457,"no":22,"title":"CHAPTER XXII. DICK RALSTON\u0027S FATHER.","content":"\u0026nbsp;When Chester followed Mr. Perkins into the great dining room of the Fifth Avenue he was rather dazzled by its size and the glistening appearance of the tables. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope you have brought your appetite with you, Chester,\" said his Western friend. \"The Fifth Avenue sets a good table.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My appetite is sure to be good. I was kept so busy to-day that I had hardly time to buy a sandwich for lunch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All the better! You\u0027ll enjoy your meal. As for me, I don\u0027t have the appetite I do at home. There\u0027s nothing like a tramp on the open prairie to make a man feel peckish.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you ever been in New York before, Mr. Perkins?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not since I was a boy. I was born up Albany way, and came here when I was about your age. But, Lord, the New York of that day wasn\u0027t a circumstance to what it is now. There was no Elevated railroad then, nor horse cars either, for that matter, and where this hotel stands there was a riding school or something of that sort.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you going to stay here long?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I go to Washington to-morrow, stopping at Philadelphia and Baltimore on the way. No. I have no business in Washington, but I think by the time a man is fifty odd he ought to see the capital of his country. I shall shake hands with the President, too, if I find him at home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you ever been further West than Minneapolis?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I have been clear out to the Pacific. I\u0027ve seen the town of Tacoma, where you\u0027ve got five lots. I shall write out to a friend in Portland to buy me as many. Then we shall both have an interest there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You think the lots are worth something?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know it. When the Northern Pacific Railroad is finished, every dollar your friend spent for his lots will be worth thirty or forty.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope your predictions will come true, Mr. Perkins.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did I hear you speaking of Tacoma?\" asked a gentleman on Chester\u0027s left hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can tell you something about it. I live at Seattle.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Am I right about there being a future for the place?\" asked Paul Perkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are. I may say that lots there are already worth twice what they were last week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How\u0027s that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because work on the railroad has been resumed, and there is no doubt now that it will be pushed to completion.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That settles it. I must own property there. I won\u0027t wait to write, but will telegraph my friend in Portland to go there at once at my expense, and buy five—no, ten lots. I got that idea from you, Chester, and if I make a profit I shall feel indebted to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be glad if it helps fill your pockets, Mr. Perkins.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come up to my room for a while, Chester,\" went on the other, \"and we will consider what to do. We might go to the theater, but I think I would rather walk about here and there using my eyes. There is plenty to see in New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will suit me, Mr. Perkins.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n About eight o\u0027clock the two went downstairs. Near the entrance, just inside the hotel, Chester heard himself called by name.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Looking up, he recognized Felix Gordon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you going to the theater, Chester?\" asked Felix.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I think not.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you introduce me to your friend?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Perkins, this is Felix Gordon, nephew of our bookkeeper,\" said Chester, unwillingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hope you are well, Mr. Gordon,\" said Paul. \"Are you fond of the theater?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir,\" answered Felix, eagerly. \"There\u0027s a good play at Palmer\u0027s. I think you\u0027d like it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt, but I\u0027d rather see the streets of New York. As you are a friend of Chester, do me the favor to buy yourself a ticket,\" and Mr. Perkins drew a two-dollar bill from his pocket and tendered it to Felix.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am ever so much obliged,\" said Felix, effusively. \"As it is time for the performance to commence, I\u0027ll go at once, if you\u0027ll excuse me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly. You don\u0027t want to lose the beginning of the play.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Felix started off on a half run, Mr. Perkins said: \"Do you know why I was so polite to Felix, who by all accounts isn\u0027t your friend at all?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I was rather puzzled.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wanted to get rid of him. He was probably sent here by his uncle as a spy upon us. Now he is disposed of.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see you are shrewd,\" said Chester, laughing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I\u0027m a little foxy when there\u0027s occasion,\" rejoined Mr. Perkins. \"Now, where shall we go?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I will not undertake to describe the route followed by the two. The city was pretty much all new to the stranger from Minneapolis, and it mattered little where he went.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n About ten o\u0027clock the two witnessed from a distance a scene between a man of forty and an old, infirm man, apparently seventy years of age.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The younger man is Ralston, the gambler,\" said Chester, in excitement, when they were near enough to recognize the figures of the two.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Halt a minute, and let us hear what it is all about,\" returned Mr. Perkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am hungry,\" said the old man, pitifully, \"and I have no money for a bed. Have pity on me, Dick, and give me something.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You ought not to have come here,\" returned Ralston, roughly. \"Why didn\u0027t you stay in the country, where you had a comfortable home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In the poorhouse,\" murmured the old man, sadly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, it\u0027s no worse for being a poorhouse, is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But is it right for me to live there when you are rich and prosperous?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you know I am rich and prosperous?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By your dress. And there\u0027s a diamond in your shirt bosom. That must be valuable.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s about all I own that is valuable. It was a fool\u0027s errand that brought you here. You had better go back,\" and Ralston prepared to go on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you give me a trifle, Dick?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, take that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A quarter?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; it will give you some supper.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But what shall I do for a bed?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go to the station house. They\u0027ll take in an old man like you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Before the aged man could renew his application the younger one had disappeared round the corner of the next street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Follow me, Chester,\" said Paul Perkins. \"I\u0027m going to speak to the old man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He touched him on the shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you in trouble, my friend?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old man, looking the picture of despondency in his ragged suit, and with his long, gray locks floating over his shoulders, turned at the words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir,\" he said, \"I am poor and in trouble, and my heart is sore.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is the man who has just left you related to you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is my only son.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He doesn\u0027t seem kind to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; he cares nothing for his old father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did you become so poor?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is the cause. When he was turned twenty-one I was worth ten thousand dollars. He forged my name, more than once, and to save him I paid the forged notes. So it happened that I was turned out in my old age from the farm and the home that had been mine for twenty-five years, and in the end I was sent to the poorhouse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then he brought all this upon you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know what he is now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He tells me he is in business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"His business is carried on at the gambling house, so my young friend here assures me. You will get no help from him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I begin to think so. Perhaps I was foolish to leave my home, poor as it was, and come here to ask help.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much money will take you home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here is a ten-dollar bill. Take it, get a meal and a night\u0027s lodging and in the morning start for home. It is the best thing you can do. As for your son, you can only leave him to his own devices. A man who will treat his old father as he has treated you will never prosper.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, sir. I will follow your advice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would rather be in your position, old and poor as you are, than in his.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Chester,\" added Mr. Perkins, as they walked on, \"this Ralston is a more contemptible rascal than I thought. If my old father were living, I would give half the money I possess. While I had a dollar in my pocket he should share it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I say the same, Mr. Perkins.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When they reached the Fifth Avenue Hotel, Paul Perkins shook hands with Chester.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-night,\" he said. \"You won\u0027t see me for two weeks, perhaps, but I\u0027ll be sure to find you out when I return to the city. I hope you won\u0027t have any trouble with that scoundrel in the office.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Mr. Perkins, but I am afraid I shall.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t mind it if you do. Remember that you will always have a friend in Paul Perkins.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2959/81405.html","bookId":430,"creation":"Aug 5, 2019 1:08:10 PM","modification":"Aug 5, 2019 1:08:10 PM"}
