{"id":40462,"no":27,"title":"CHAPTER XXVII. MR. TRIPP IS DISAPPOINTED.","content":"\u0026nbsp;Silas Tripp returned home full of the news he had heard in New York. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just as I thought,\" he said to himself, \"Chester Rand ought never to have left Wyncombe. He ain\u0027t calc\u0027lated to succeed in the city. He\u0027d orter have stayed in my store. In two or three years he might have been earnin\u0027 four or five dollars a week, and he could have boarded at home. It costs a sight to live in the city. I ain\u0027t sure that I could afford it myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tripp decided to offer Chester his old place at two dollars and a half a week. Abel Wood was again in his employ, but he didn\u0027t like him as well as Chester.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The latter he had always found reliable, while Abel was rather apt to forget what Silas told him. Once he had stopped in the street and played ball, losing ten or fifteen minutes in that way. Mr. Tripp was obliged to confess that he never had a more satisfactory boy than Chester.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The store closed at nine, and Silas, instead of going into the house, walked over to Mrs. Rand\u0027s cottage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was rather surprised when she saw who her visitor was.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-evening, Mr. Tripp,\" she said, politely. \"Won\u0027t you come in?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, widder. It\u0027s rather late to call, but I thought you might like to hear about York, seein\u0027 Chester is there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you been to New York to-day?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I went up on a little business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you see Chester?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I didn\u0027t see him,\" answered Silas, significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you hear anything of him?\" Mrs. Rand naturally asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tripp coughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, yes, I heered somethin\u0027 about him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is he—sick?\" asked the mother, anxiously, made apprehensive by his tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not that I know of. Hain\u0027t he writ anything special to you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had a letter yesterday, but there was nothing special in it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose he didn\u0027t say nothin\u0027 about his place?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; he likes it very much.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t like to say it, widder, but he\u0027s deceivin\u0027 you. I saw his employer myself, and he said that he had to discharge Chester.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Somehow Mrs. Rand did not seem so much disturbed by this intelligence as the storekeeper thought she would be.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you mean the real estate office,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; I was treated quite handsome by Mr. Mullins, the bookkeeper, who is runnin\u0027 the business while Mr. Fairchild is away. He says Chester wasn\u0027t spry enough, that he wasn\u0027t wide awake enough to work in the city.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Rand actually smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So that is what he said,\" she returned. \"I can tell you why Chester was discharged. Mr. Mullins wanted to give the place to his nephew.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mebbe so,\" answered Silas, dubiously. \"Anyhow, it\u0027s unfortunate for Chester to lose his place. I feel for you, Mrs. Rand, as I always liked Chester myself, and I came here to-night to say that I\u0027m ready to take him back into the store, and give him two dollars and a half a week. He suits me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tripp leaned back in the rocking-chair and looked as if he had made a very handsome proposal.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see, Mr. Tripp,\" said Mrs. Rand, smiling, \"that you think Chester is out of a position.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So he is. Wasn\u0027t he discharged? I know from what Mr. Mullins said he won\u0027t take him back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Chester would not be willing to go back. He has a new and better place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t say!\" ejaculated Mr. Tripp, surprised and, it must be confessed, disappointed. \"What sort of a place is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is working for a New York paper or magazine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sho! Does he get as much pay as he did at the other place?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Considerably more,\" Mrs. Rand answered, with satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"More\u0027n five dollars a week?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; he offers to send me five dollars a week, but I can get along without assistance, since Miss Dolby pays me so liberally.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I am surprised. Chester is very lucky. Mebbe it won\u0027t last,\" he continued, hopefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems likely to be permanent.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I guess I must be goin\u0027. If he should lose his place, tell him I will take him back any time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think he would be satisfied to come back to Wyncombe after working in New York.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Silas Tripp returned to his house rather disappointed. He had felt so sure of securing Chester\u0027s services, and now his old boy seemed to be quite out of his reach.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Offered to send his mother five dollars a week!\" he soliloquized. \"Then he must be makin\u0027 as much as ten in his new place. Mr. Mullins didn\u0027t seem to know about it. I wonder what he can be doin\u0027 to get such a high salary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2959/81410.html","bookId":430,"creation":"Aug 5, 2019 1:08:10 PM","modification":"Aug 5, 2019 1:08:10 PM"}
