{"id":40465,"no":30,"title":"CHAPTER XXX. THE ATTEMPTED ROBBERY.","content":"\u0026nbsp;Dick Ralston was in the real estate office when the telegram was received. Indeed, he spent a good deal of his time there, so that it was supposed by some that he had a share in the business. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look at that, Dick!\" said the bookkeeper, passing the telegram to his confederate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Confusion! What sends him home so soon?\" said Ralston. \"Do you suppose he suspects anything?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. How can he? Perhaps,\" said Mullins, nervously, \"we had better give up the whole thing. You see how I will be placed. I\u0027m afraid I shall be suspected.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look here!\" growled Ralston, \"I don\u0027t want to hear any such weak, puerile talk. How do you propose to pay me the nine hundred and sixty-odd dollars you owe me? Do you expect to save it out of your salary?\" he concluded, with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish we had never met,\" said the bookkeeper, in a troubled tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you; but it is too late for that. There is nothing to do but to carry out our program. How much money is there on deposit in the bank?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About twenty-four hundred dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then we had better draw out more than eighteen hundred. As well be hanged for a sheep as for a lamb.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You forget, Ralston, that such a wholesale draft will raise suspicion at the bank.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re awfully cautious.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t want everything to miscarry through imprudence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come, it is ten o\u0027clock. Better send Felix to the bank.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Better wait a little while. If we drew such a large amount just at the beginning of banking hours, the bank officers might suspect something.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Cautious again. Well, wait half an hour, if you must. Call Felix and give him his instructions.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Felix Gordon came in at this moment, and was admitted to the conference.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Felix,\" said the bookkeeper, \"you remember the arrangement I made with you yesterday?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Cousin David.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is to be carried out to-day. I shall give you a check for eighteen hundred dollars, and you will receive the money and come from the bank here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Cousin David.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will carry the parcel in the left-hand pocket of your sack coat, and if it is taken you can appear to be unconscious of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And—that is all you will have to do, except to say that a tall, thin man\"—Ralston was short and sturdy—\"jostled against you, and must have taken it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right! I see. And I am to have twenty-five dollars for——\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your trouble. Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give it to me now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wait till you come back. Don\u0027t be afraid. You will get it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Felix was on his way to the bank, he did not know that he was followed at a little distance by a small man with keen, black eyes, who, without appearing to do so, watched carefully every movement of the young office boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Felix entered the bank, he also entered the bank, and stood behind Felix in the line at the paying teller\u0027s window.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He nodded secretly to the teller when that official read the check presented by Felix.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Eighteen hundred dollars?\" the latter repeated, aloud.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir,\" answered Felix, composedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall have to go back to get it. We haven\u0027t as much here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He went to another part of the bank and returned after a time with three packages. One was labeled one thousand dollars, another five hundred dollars and a third two hundred dollars. Then he counted out from the drawer beside him a hundred dollars in bills.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Felix, with a look of relief, took the three parcels and dropped them carelessly in the side pocket of his sack coat, and put the bills in loose. Then he started on his way back to the office.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Sharpleigh, for it was he, as the reader has doubtless guessed, walked closely behind him. He was not quite sure as to the manner in which the money was to be taken, but guessed at once when he caught sight of Dick Ralston at a little distance with his eyes intently fixed upon Felix.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The office boy sauntered along, with nothing apparently on his mind, and finally stopped in front of a window on union Square, which appeared to have considerable attraction for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then it was that the detective saw Ralston come up, and, while apparently watching the window also, thrust his hand into the pocket of the office boy and withdraw the package of money, which he at once slipped into his own pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Sharpleigh smiled a little to himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very neat!\" he soliloquized, \"but it won\u0027t go down, my cunning friend.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Felix gave a little side glance, seeing what was going on, but immediately stared again in at the window.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sharpleigh beckoned to a tall man, dressed as a civilian, but really an officer in plain clothes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go after him!\" he said, in a low voice, indicating Ralston.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he followed Felix, who in about five minutes began to show signs of agitation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He thrust his hand wildly into his pocket, and looked panic-stricken.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is the matter, my boy?\" asked Sharpleigh, blandly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, sir, I have been robbed,\" faltered Felix.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Robbed—of what?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had eighteen hundred dollars in bank bills in my pocket, in four parcels, and—and they must have been taken while I was looking in at this window.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You seem to have been very careless?\" said Sharpleigh. \"Why were you not more careful when you knew you had so much money in your care?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I ought to have been, I know it, sir, but I wasn\u0027t thinking.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where are you employed?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At Mr. Fairchild\u0027s office, on Fourteenth Street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The real estate agent?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know the place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My cousin is the bookkeeper. He will be so angry with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think he will have reason. I saw a man following you rather closely, I presume he took the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, won\u0027t you come back to the office with me and tell my cousin that? I am afraid he will discharge me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I will go with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So it happened that Felix and Mr. Sharpleigh went together into the office where Mullins was eagerly waiting for the return of his emissary.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter, Felix?\" he said, as the boy entered. \"Have you brought the money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, Cousin David, I am so sorry.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So sorry? For what?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I—I have lost the money. A pickpocket took it while I was looking in at a window. This gentleman was near and he saw a suspicious-looking man next to me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is a strange story, Felix. We must notify the police at once. Did you see anyone likely to commit the theft, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was, of course, addressed to Mr. Sharpleigh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will be willing to testify to this at the police office? You see, this boy is my cousin. Mr. Fairchild is away, and I shall be blamed for this terrible loss. Why, there were eighteen hundred dollars in the parcel!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There were three parcels, and a roll of bills, Cousin David.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Mullins looked surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then it was not all put in one parcel?\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is strange. I—I don\u0027t know what to do. Mr. Fairchild has telegraphed that he will be at home sometime during the day. Probably I had better wait till he comes before notifying the police.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This he said in a questioning sort of way, as if asking Sharpleigh\u0027s advice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will give the thief a chance to escape,\" suggested the detective.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True. Perhaps you will be kind enough to leave word at the nearest police office. I only wish Mr. Fairchild were here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right, sir,\" said the detective, \"I will comply with your request.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He left the office, but it is needless to say that he didn\u0027t go far away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is a very interesting comedy,\" he murmured, rubbing his hands, \"a very interesting comedy, and apparently played for my benefit.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, Felix,\" said the bookkeeper, \"tell me how it all came out. Did the paying teller look suspicious when you presented the check?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. He said he hadn\u0027t as much money in the drawer, and went to the safe in the back part of the bank. He returned with three parcels of bills in brown paper, and a hundred dollars loose.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And then you put it in your pocket?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Cousin David; I did exactly as you told me. I put them in my pocket and walked back in a leisurely way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you see anything of Ralston?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I saw him out of the corner of my eye, while I was looking in at a window on union Square.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He took the money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes. Now, Cousin David, give me the twenty-five dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At that instant the door was opened suddenly, and Dick Ralston dashed into the office, looking very much excited.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mullins,\" he said, \"we\u0027ve been sold—sold—regularly sold. Look at this!\" and he showed one of the brown packages partly torn open.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well,\" said the bookkeeper, \"what\u0027s the matter?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Matter? Matter enough. Here\u0027s a package marked one thousand dollars, and it contains only slips of green paper in place of bills. You can see for yourself.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2959/81413.html","bookId":430,"creation":"Aug 5, 2019 1:08:10 PM","modification":"Aug 5, 2019 1:08:10 PM"}
