{"id":85758,"no":11,"title":"Page 11","content":"\u003cp\u003eSo? I\u0027m not best friends with Miranda, but I\u0027d rather hang with her than Roxanne. \"Jess, I need your help. Bring Miranda.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to talk about Mitch in front of her, Amy.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, so here\u0027s my advice on the boyfriend front. Give Mitch some space and let him come after you. Ignore him for a bit. He thrives on challenges, Jess, and maybe you\u0027re too accessible.\"\u003c/p\u003e\n\u003cp\u003e\"But--\"\u003c/p\u003e\n\u003cp\u003e\"But nothing. Listen to me. I know what I\u0027m talking about. I dated him, too. Remember?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I remember.\"\u003c/p\u003e\n\u003cp\u003e\"So, are you coming over now or what?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll come. Just remember to be nice to Miranda. She\u0027s sensitive.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m always nice,\" I say, then hang up.\u003c/p\u003e\n\u003cp\u003eI wrap myself in a robe and wait for Jess and Miranda. Ten minutes later the doorman rings me to get my approval to let my friends up. When I open the door, Miranda is standing behind Jess, looking down at the ground. Miranda is wearing black stretch pants and a huge red sweater that hangs to her knees, as if she\u0027s trying to hide her body.\u003c/p\u003e\n\u003cp\u003e\"Hi, Miranda,\" I say.\u003c/p\u003e\n\u003cp\u003eShe manages a small \"Hi,\" and follows Jess into the condo.\u003c/p\u003e\n\u003cp\u003eLeading them to my room, I open the door and Mutt, who was locked inside, goes right for poor Miranda\u0027s crotch.\u003c/p\u003e\n\u003cp\u003e\"Leave her alone,\" I say to Mutt, who sniffs loudly then walks out of the room.\u003c/p\u003e\n\u003cp\u003eI open my closet doors. \"Okay, what should I wear?\"\u003c/p\u003e\n\u003cp\u003eI admit I\u0027ve been blessed with a mom who came up with the Everyone\u0027s a star at Starbucks campaign. Don\u0027t knock it. My entire wardrobe was probably paid with jingles and slogans my mom created. The Don\u0027t Baby Me slogan for Precious Baby Finger Foods was a big hit along with the jingle If you know someone who needs someone, call 1-800-Therapy.\u003c/p\u003e\n\u003cp\u003e\"Are those real Jimmy Choo shoes?\" Miranda asks, wide-eyed.\u003c/p\u003e\n\u003cp\u003eMy mom brought them back for me from a fashion show in New York last year. \"Yeah. Want to try them on?\"\u003c/p\u003e\n\u003cp\u003eMiranda takes a step back. \"Oh, no. I\u0027m so heavy I\u0027d probably break the heel.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be ridiculous,\" I say, then grab the shoes and hand them to her. They\u0027re slingback and will practically fit anyone. \"Just don\u0027t let my dog lick them.\"\u003c/p\u003e\n\u003cp\u003eMiranda hesitates, then slowly reaches out and takes them from my outstretched hand.\u003c/p\u003e\n\u003cp\u003eI look over at Jess when Miranda sits on the edge of my bed to take her gym shoes off and put the Jimmy Choos on. She\u0027s rummaging through my closet, taking stuff out and laying it over her arm. \"I\u0027ll give you choices.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks, Mommy,\" I say sarcastically.\u003c/p\u003e\n\u003cp\u003eJessica rolls her eyes as she lays out the outfit I wore on my last date with Avi. I know it sounds lame, but it\u0027s sacred. The memories of that night are attached to that skirt and top. I\u0027m absolutely not wearing it. \"Nope. Next.\"\u003c/p\u003e\n\u003cp\u003eShe holds out a ripped jeans/tight sweater combination. \"Nope. Too alternative.\"\u003c/p\u003e\n\u003cp\u003eA knock at the door interrupts us. \"Amy, it\u0027s me.\" My dad.\u003c/p\u003e\n\u003cp\u003eWhen I tell him to come in, he surveys the clothes strewn around the room and Miranda trying to balance in the Choos. \"You girls putting on a fashion show? I\u0027ll give you money if you\u0027ll make Amy clean her room.\"\u003c/p\u003e\n\u003cp\u003e\"Dad, don\u0027t be a dork,\" I tell him, pushing him out of the room before he embarrasses me more. \"I\u0027m going to the youth group meeting tonight. Remember?\"\u003c/p\u003e\n\u003cp\u003e\"I remember. But I thought you said it started at four.\"\u003c/p\u003e\n\u003cp\u003e\"It does.\"\u003c/p\u003e\n\u003cp\u003eHe checks his watch. \"It\u0027s five to. You better hurry.\"\u003c/p\u003e\n\u003cp\u003eWhen he\u0027s gone, I see the third outfit Jess has picked for me. Dark blue jeans and a simple pink long-sleeve tee with a gold O at the top. While I\u0027m shimmying into the jeans, Miranda stumbles in the Choos over to my nightstand and picks up the picture of Avi. \"Is he your boyfriend?\"\u003c/p\u003e\n\u003cp\u003eJess bites her bottom lip, probably to keep herself from blurting out, \"He\u0027s her non-boyfriend.\"\u003c/p\u003e\n\u003cp\u003eI hesitate before saying, \"Kind of.\"\u003c/p\u003e\n\u003cp\u003eMiranda looks from the picture of Avi to me. \"He\u0027s a hottie.\"\u003c/p\u003e\n\u003cp\u003eA little part of my heart flips over. Turning around, I finish dressing and say, \"I\u0027m ready. Let\u0027s go,\" because I don\u0027t want to talk about him. I haven\u0027t even written him back and I don\u0027t call him at home because I don\u0027t want to act like stalker-girlfriend. I\u0027m confused. I hate feeling like this.\u003c/p\u003e\n\u003cp\u003eWhen we arrive at the youth group meeting at the synagogue, I\u0027m surprised at the amount of kids here. There must be at least forty kids hanging around the social hall. Some kids I recognize from school, but most I\u0027ve never seen in my life.\u003c/p\u003e\n\u003cp\u003eA dark, curly-haired guy with a kippah on his head who\u0027s probably in his thirties tries to quiet everyone down.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s Rabbi Doug, the new assistant rabbi,\" Jess tells me.\u003c/p\u003e\n\u003cp\u003eMiranda stays close to Jess\u0027s side as we find a vacant place on the floor to sit. It takes a while for everyone else to shut up, but finally all eyes are on Rabbi Doug.\u003c/p\u003e\n\u003cp\u003e\"Is everybody ready to build a sukkah for our play?\"\u003c/p\u003e\n\u003cp\u003eAsk me a year ago and I couldn\u0027t tell you what a sukkah was. Now I know it\u0027s a small structure where you invite family and friends to eat the \"harvest meal.\" Normally Jews build a sukkah sometime near October for the holiday of Sukkot, but the youth group is putting on a play for the Hebrew school students about the holidays and the sukkah is being built tonight.\u003c/p\u003e\n\u003cp\u003eRabbi Doug proceeds to have us count off so we\u0027re in different groups. I\u0027m in a group with a bunch of kids I don\u0027t know. This guy who assigns himself the leader of our group has us meet in the hallway.\u003c/p\u003e\n\u003cp\u003eA girl with curly black hair and bushy eyebrows is in my group, along with a couple of other girls and a bunch of guys. I sit next to Bushy Brow and give her a small smile.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Nikki. With an z,\" she says.\u003c/p\u003e\n\u003cp\u003eOh, no. Flashbacks of my stepfather, Marc with a c, slam into my consciousness. \"I\u0027m Amy. With a y\" I say back.\u003c/p\u003e\n\u003cp\u003e\"Where do you go to school?\"\u003c/p\u003e\n\u003cp\u003e\"Chicago Academy. Where do you go?\"\u003c/p\u003e\n\u003cp\u003eAt the mention of Chicago Academy, Nikki blinks twice. What is it with people lately? I swear you\u0027d think Chicago Academy was synonymous with School For Brats. \"Mather,\" she replies.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s cool.\"\u003c/p\u003e\n\u003cp\u003eNikki isn\u0027t über-friendly after I told her I go to Chicago Academy, like she\u0027s suddenly wary of me.\u003c/p\u003e\n\u003cp\u003eLuckily, a cool guy wearing a black hooded sweatshirt sits on the other side of me and starts talking. \"What\u0027s up? I\u0027m Wes.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Amy.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never seen you here before,\" Wes says while checking me out. He\u0027s so obvious about it, a guy like that deserves to be played with.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a youth group virgin,\" I say.\u003c/p\u003e\n\u003cp\u003eInstead of being shocked, the guy laughs. \"Cool. You might not want to hang with me. I\u0027m so not a virgin I might scare you off\"\u003c/p\u003e\n\u003cp\u003e\"I go to Chicago Academy,\" I tell him. \"I might scare you off.\"\u003c/p\u003e\n\u003cp\u003eInstead of being intimidated, Wes leans forward. \"Ooh, one of those rich kids. Is it true your parents host teenage parties with booze and pot?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely,\" I lie. \"What else would we do with all that excess money?\"\u003c/p\u003e\n\u003cp\u003eHe laughs and gives me a big, cocky smile. \"I like you, Amy.\"\u003c/p\u003e\n\u003cp\u003eRabbi Doug gives us our assignment. \"You guys are in charge of hanging the fruit in the sukkah. The baskets, hooks, and string are in the back room. Be creative, people.\"\u003c/p\u003e\n\u003cp\u003eI follow the rest of the kids to the back room. Wes and I are instant friends, I find out he goes to Mather High, too, and sings in a band called Lickity Split. Nikki is starting to warm up to me, or maybe she likes Wes so she\u0027s acting all nicey-nice.\u003c/p\u003e\n\u003cp\u003e\"Do you have a boyfriend?\" Wes asks me while we\u0027re attempting to string bananas together.\u003c/p\u003e\n\u003cp\u003eI look over to Jessica\u0027s group, working with nails and wood to put up the sukkah structure. \"Sort of.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean by \u0027sort of?\" Nikki chimes in.\u003c/p\u003e\n\u003cp\u003eIs it really any of these people\u0027s business? \"I have a boyfriend, but he\u0027s in Israel.\"\u003c/p\u003e\n\u003cp\u003eWes plunges a needle and thread into the skin of the banana. \"As in he lives there?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"How can he be your boyfriend when he\u0027s, like, a million miles away?\"\u003c/p\u003e\n\u003cp\u003eI stop the banana threading. It\u0027s like everyone else is putting into words what\u0027s been on my mind lately. It\u0027s pissing me off. Ever since I talked to my Israeli cousin yesterday, I\u0027ve been rethinking my relationship with Avi. Obviously I\u0027m not his first priority. Why should he be mine?\u003c/p\u003e\n\u003cp\u003eWithout answering Wes, I wander away from the youth group and stare out at the view of Lake Michigan. The backyard of the synagogue faces the lake, on prime real estate property. I\u0027m sure my stepfather would love to get his hands on this piece of land. I envision myself on the sandy beach below.\u003c/p\u003e\n\u003cp\u003eAn image of Nathan pops into my head, interrupting my thoughts of Avi. Why, I have no clue. It\u0027s just... well, Nathan kind of reminds me of Avi. Not his looks, by any means. Avi is drop-dead-oh-my-God gorgeous, the Abercrombie model come to life. Nathan is the opposite. He looks as awkward as he acts and doesn\u0027t even care that he\u0027s a loner. Avi has a bunch of loyal friends.\u003c/p\u003e\n\u003cp\u003eAvi and I fell for each other after hating each other for the better part of the summer. In the beginning, we fought every time we came within two feet of each other. When he kissed me, it was as explosive as the fighting and more incredible than any kiss I\u0027d ever had.\u003c/p\u003e\n\u003cp\u003eI\u0027m sure kissing Nathan would be nothing like kissing\u003c/p\u003e\n\u003cp\u003eAvi.\u003c/p\u003e\n\u003cp\u003eI put my hands on either side of my head and squeeze my eyes shut. How can I think about kissing Nathan? Eww.\u003c/p\u003e\n\u003cp\u003eOkay, I\u0027ll admit he has unique green eyes. They have little specks of brown and gold in them, and when he looks at me I find myself searching for those specks. A guy like that shouldn\u0027t have such cool eyes.\u003c/p\u003e\n\u003cp\u003e\"Hey, Amy, you okay?\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s Jessica. I don\u0027t feel like talking right now, even to my best friend. I\u0027m kind of fine being depressed all by myself. \"I\u0027m fine.\"\u003c/p\u003e\n\u003cp\u003e\"You think the youth group is weak sauce, don\u0027t you? I\u0027m sorry I made you--\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not weak sauce.\"\u003c/p\u003e\n\u003cp\u003e\"Then why are you all mopey?\" My best friend rolls her eyes at me, if you can believe it. \"Seriously, Amy, you\u0027re gonna have to get over Avi. You\u0027ve been acting like a total recluse lately and it\u0027s getting on everyone\u0027s nerves, especially mine. Can\u0027t you move on? I guarantee Avi\u0027s not moping around, making his friends and everyone else around him miserable.\"\u003c/p\u003e\n\u003cp\u003eI stand here wide-eyed, not believing for a second Jessica just bitched me out. She\u0027s never done this before. We\u0027ve always supported each other through guys and zits and parents and school. \"I guess it\u0027s too much to ask for my best friend to support me when I need it the most,\" I say.\u003c/p\u003e\n\u003cp\u003e\"You know what, Amy? I was thinking the same thing,\" she says, then stomps back to the sukkah- building activity.\u003c/p\u003e\n\u003cp\u003eWhat the hell was that all about? I\u0027m too confused to think right now. All I want to do is go home. What\u0027s worse is that I\u0027m at the mercy of Jessica because she drove me here.\u003c/p\u003e\n\u003cp\u003eStomping back to my group, I plop myself down next to Wes from Lickity Split again.\u003c/p\u003e\n\u003cp\u003e\"Amy, you just sat on a banana,\" Wes informs me, then bursts out laughing. Nikki and the rest of my group follow. All eyes are watching to see what I\u0027m going to do next.\u003c/p\u003e\n\u003cp\u003eI could cry--that wouldn\u0027t take too much effort. In fact, I can feel a waterfall forming behind my eyelids.\u003c/p\u003e\n\u003cp\u003eClosing my eyes, my brain focuses on the wet, gushy mush soaking the jeans I spent over a half hour picking out. And on Jessica\u0027s tirade. And on my mom\u0027s pregnancy. And on Avi and Nathan and my dad\u0027s date disaster. And Mutt\u0027s insatiable addiction to sniffing everyone\u0027s crotch. \u003c/p\u003e","sourceLink":"https://allnovel.net/how-to-ruin-my-teenage-life-how-to-ruin-2/page-11.html","bookId":2765,"creation":"Oct 5, 2019 5:09:16 PM","modification":"Oct 5, 2019 5:09:16 PM"}
