{"id":85753,"no":6,"title":"Page 6","content":"\u003cp\u003eMy dad stands. I can tell he\u0027s going to break the bad news right now and I wince. \"I\u0027m not going to send you away, sweetheart.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not?\"\u003c/p\u003e\n\u003cp\u003e\"No. I got you a job.\"\u003c/p\u003e\n\u003cp\u003e7\u003c/p\u003e\n\u003cp\u003eMoses had incredible negotiation skills. He made God The #1 Top Guy, change his mind about destroying all of the\u003c/p\u003e\n\u003cp\u003eJewish people (Exodus 32:13). If that doesn\u0027t prove anyone can change the course of their life, nothing will. I wish I had Moses\u0027s negotiation skills when dealing with my dad.\u003c/p\u003e\n\u003cp\u003e\"Amy, what are you doing here so early? Conversion class doesn\u0027t start for another ten minutes.\"\u003c/p\u003e\n\u003cp\u003eI\u0027m standing in the doorway of Rabbi Glassman\u0027s office at Temple Beit Chaverim. The rabbi is reading over papers while he rubs his gray and black beard.\u003c/p\u003e\n\u003cp\u003e\"I need to talk to someone,\" I tell him.\u003c/p\u003e\n\u003cp\u003ePutting his papers aside, Rabbi Glassman motions for me to sit at the chair opposite his desk. \"I\u0027m always here to listen if someone needs an ear. That\u0027s my job.\"\u003c/p\u003e\n\u003cp\u003e\"Listening to people complain?\"\u003c/p\u003e\n\u003cp\u003e\"Among other things,\" he says with a smile, then leans back in his large cushioned chair. \"What\u0027s on your mind?\"\u003c/p\u003e\n\u003cp\u003eLots of stuff, but I\u0027m going to pick out the top one bugging me. \"I got in trouble.\"\u003c/p\u003e\n\u003cp\u003e\"With the law?\" he prompts.\u003c/p\u003e\n\u003cp\u003e\"With my dad. I took his credit card without his permission and now he wants me to pay him back the money I charged.\" I look to the rabbi, to make sure he\u0027s not keeling over in shock or shame.\u003c/p\u003e\n\u003cp\u003e\"What did you charge, if I may ask?\"\u003c/p\u003e\n\u003cp\u003eI put my hands up. \"I know this is gonna sound weird, but it was for a good reason. I signed up for PJSN...you know, the Professional Jewish Singles Network. It\u0027s a dating service. And I did it for my dad.\"\u003c/p\u003e\n\u003cp\u003eThe rabbi\u0027s eyebrows raise up. \"You signed your father up for a dating service without his permission?\"\u003c/p\u003e\n\u003cp\u003eI nod. \"He needs a wife.\"\u003c/p\u003e\n\u003cp\u003eRabbi Glassman sighs, then says in a quiet voice, \"Amy, sometimes you have to let people choose their own paths in life.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, but what if they\u0027re taking the wrong one?\"\u003c/p\u003e\n\u003cp\u003e\"Everyone makes mistakes. Even rabbis. We\u0027re all human.\"\u003c/p\u003e\n\u003cp\u003eI seem to be making more than my share of human mistakes lately. \"So you\u0027re saying I should let my dad live his life alone and lonely?\"\u003c/p\u003e\n\u003cp\u003e\"Nonsense. He has you, doesn\u0027t he? Some things aren\u0027t measured by their size, but by their importance.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s very philosophical, Rabbi,\" I say, smiling.\u003c/p\u003e\n\u003cp\u003e\"You caught me on a good day.\"\u003c/p\u003e\n\u003cp\u003eI bite the inside of my cheek. \"I haven\u0027t had a lot of those lately.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, but you can\u0027t appreciate a great day unless you\u0027ve experienced bad ones.\"\u003c/p\u003e\n\u003cp\u003e\"Like Jonah had when God made the whale eat him?\"\u003c/p\u003e\n\u003cp\u003e\"I see you\u0027ve been studying for class.\"\u003c/p\u003e\n\u003cp\u003eI lean forward and whisper, \"Yeah, although I don\u0027t really buy it all, Rabbi. It\u0027s a little far-fetched for me, if you know what I mean. Can I still be a Jew if my brain can\u0027t grasp around certain Bible stories?\"\u003c/p\u003e\n\u003cp\u003eThe reason I can talk to Rabbi Glassman honestly is because he\u0027s never judged me or laughed at my opinions or arguments in class. He makes me feel like everything I have to say is really important and smart. Even when I\u0027m disagreeing with him.\u003c/p\u003e\n\u003cp\u003eRabbi Glassman leans forward and whispers back, \"Amy, I think it\u0027s far-fetched, too.\"\u003c/p\u003e\n\u003cp\u003eMy mouth goes wide. \"You do? Don\u0027t worry, Rabbi. Your secret is safe with me.\"\u003c/p\u003e\n\u003cp\u003eRabbi Glassman smiles and says, \"I think it all comes down to faith and trust.\"\u003c/p\u003e\n\u003cp\u003e\"In people?\" I ask.\u003c/p\u003e\n\u003cp\u003eHe shrugs, as if he doesn\u0027t have all the answers to all of his questions. \"In people...in God...in yourself. Do you think you have faith and trust?\"\u003c/p\u003e\n\u003cp\u003eI look up at him. \"Should I answer that now?\"\u003c/p\u003e\n\u003cp\u003eMy rabbi shakes his head. \"I don\u0027t know if you\u0027re ready to answer that yet. Why don\u0027t you think about it for a while and get back to me when you\u0027re... let\u0027s say... twenty years old.\"\u003c/p\u003e\n\u003cp\u003eI stand up, taking in all the information Rabbi Glassman gave me as I leave his office. \"See you at class, Rabbi,\" I call over my shoulder. \"And thanks for the talk.\"\u003c/p\u003e\n\u003cp\u003e\"Any time,\" he calls back.\u003c/p\u003e\n\u003cp\u003eFive minutes later, I\u0027m in conversion class with five other people. Even though my father is Jewish, my mother isn\u0027t. I\u0027ve lived with my mom most of my life, and she raised me without any religion. I went to Israel this past summer and realized I was missing something in my life: being Jewish. So I\u0027m learning as much about my faith as I can.\u003c/p\u003e\n\u003cp\u003eHence the conversion class.\u003c/p\u003e\n\u003cp\u003eWe meet once a week. Rabbi Glassman has us read stories from the Bible and we discuss our opinions and reflect on the meaning or lessons behind the stories. He also teaches us about the different Jewish holidays and laws. The rabbi says a lot of Judaism comes from traditions. Since I don\u0027t really have any Jewish traditions, I\u0027m going to have to make up some myself.\u003c/p\u003e\n\u003cp\u003eBack at home, I take Mutt out then walk over to Perk Me Up! Yes, I\u0027m officially a Perk Me Up! employee, thanks to my father and Maria. My punishment is a job at my favorite café, and I\u0027m not thrilled about it.\u003c/p\u003e\n\u003cp\u003eMaria greets me with a huge smile. \"Nice to see we\u0027re all perky this evening.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been a long day.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, then maybe I\u0027ll just have you sweep floors and wipe off tables so you don\u0027t have to interact with the customers.\"\u003c/p\u003e\n\u003cp\u003eI put a fake smile on my face.\u003c/p\u003e\n\u003cp\u003e\"Thatta girl,\" Maria says. \"That\u0027s what my customers like to see.\"\u003c/p\u003e\n\u003cp\u003eMaria directs me behind the counter, has me sign forms, then holds out a yellow apron. \"Here, put this on. You can shadow me until your shift ends.\"\u003c/p\u003e\n\u003cp\u003eYellow isn\u0027t really my color, but I hang the sunshiny thing around my neck and tie the wrap at my waist without complaint. Even though it\u0027s seven o\u0027clock, there are still customers hanging out and ordering pastries. They\u0027re even drinking coffee this late, especially the ones who pull all-nighters.\u003c/p\u003e\n\u003cp\u003eThe most all-nighters I see are lawyers. The ones who have to head to court in the morning or prepare for what they call depositions. Do you think the money they make is worth it for the amount of sleep they\u0027re missing? There\u0027s no way I could ever be a lawyer. I like my sleep too much.\u003c/p\u003e\n\u003cp\u003eAfter fifteen minutes, Maria hands me a white rag with antibacterial stuff on it and tells me to wipe off the tables.\u003c/p\u003e\n\u003cp\u003eI was really hoping to hide behind the counter all night until my shift was up, but Maria\u0027s having none of that. I\u0027m just thankful she hasn\u0027t asked me to clean out the bathrooms so I shuffle over to the tables and start wiping them off.\u003c/p\u003e\n\u003cp\u003eI start cleaning the private nook where a couch and two cushy chairs are located, then I freeze. Sitting in the chair, reading, is none other than Nathan Keener s-not--my-last-name Greyson. He looks up and I can tell he\u0027s about as thrilled to see me as I am to see him. The cup stops short of his lips.\u003c/p\u003e\n\u003cp\u003eIgnoring the urge to confront him about spreading rumors about me, I hurriedly wipe his table before he sets whatever he\u0027s drinking back down.\u003c/p\u003e\n\u003cp\u003e\"You missed a spot,\" Nathan mumbles. I huff. I did not miss a spot.\u003c/p\u003e\n\u003cp\u003e\"All the tables are clean,\" I tell Maria back at the register.\u003c/p\u003e\n\u003cp\u003eShe seems pleased as she does an eye scan of the café. For the next thirty minutes, Maria gives me the rundown on how to make the espressos, cold drinks, blended drinks, and tells me the particulars of some of her customers. She also explains how to use the cash register. I\u0027m dizzy from the information overload, but I think I got it. Or at the very least I\u0027ll make it look like I got it.\u003c/p\u003e\n\u003cp\u003e\"You think you can hold down the fort for five minutes while I call in an order for more cups?\" Maria asks. \"And don\u0027t forget to smile. Remember, the café is called Perk Me Up!\"\u003c/p\u003e\n\u003cp\u003eJust call me the Smiling Barista Extraordinare. Well, not really--I don\u0027t know how to \"garnish,\" as Maria puts it, with cinnamon, nutmeg, and other fancy stuff. I\u0027ve been hanging out at Perk Me Up! ever since I moved in with my dad, so I pretty much know the basic routine. It\u0027s the non-basic that throws me off.\u003c/p\u003e\n\u003cp\u003eWhile I\u0027m counting how many cups we have left, the door to the café opens.\u003c/p\u003e\n\u003cp\u003eMy first real customer. I smile and look up then relax as I realize who my customer is.\u003c/p\u003e\n\u003cp\u003eMy dad.\u003c/p\u003e\n\u003cp\u003e\"Welcome to Perk Me Up!\" I tell him in an overly formal tone. \"Can I help you?\"\u003c/p\u003e\n\u003cp\u003eHe walks up to the counter and surveys the scene. \"You look good as a working woman,\" he says, looking proud.\u003c/p\u003e\n\u003cp\u003e\"Cut the crap. What do you want?\"\u003c/p\u003e\n\u003cp\u003eI hear a gasp beside me. Oops, it\u0027s Maria. And she can\u0027t see I\u0027m talking to my dad instead of a real customer. \"Amy!\" she chastises.\u003c/p\u003e\n\u003cp\u003eBut when she reaches me, she breathes a sigh of relief.\u003c/p\u003e\n\u003cp\u003e\"Boy, you\u0027ve got tough employees,\" my dad says, then gives Maria a wink. \"Okay, Amy, give me a large cup of your house coffee, black, with a shot of espresso.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re never gonna fall asleep,\" I tell him.\u003c/p\u003e\n\u003cp\u003e\"Good. I\u0027ve got a lot of work to do tonight.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s a wonder my father isn\u0027t a lawyer. He never tells me the specifics of his work. I guess it\u0027s cool that he\u0027s got a top-secret job, so I don\u0027t bug him about working late.\u003c/p\u003e\n\u003cp\u003eI pour the mixture into a cup while Maria watches me closely. She smiles as I finish; then I hand it to my dad. He takes a sip right away, not even waiting for it to cool off. \"Best-tasting coffee I\u0027ve ever had in my life,\" he tells Maria, his overzealous reaction totally obvious.\u003c/p\u003e\n\u003cp\u003eI roll my eyes. \"Aba, go sit down already.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you join him,\" Maria says. \"Your shift is over.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve only been here an hour. How can it be over?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s our deal,\" my dad chimes in. \"An hour a day on the weekdays, three hours on Sundays. I didn\u0027t want it to interfere with your schoolwork.\"\u003c/p\u003e\n\u003cp\u003eEight hours a week isn\u0027t so bad, especially because I\u0027ll still have my Saturday nights free.\u003c/p\u003e\n\u003cp\u003eI hand Maria my yellow apron, but she says to bring it back tomorrow when I work. Then I grab my purse from the locked cabinet and sit down with my dad at one of the tables.\u003c/p\u003e\n\u003cp\u003eMy dad takes out mail from his briefcase and starts rummaging through it. I\u0027m craning my neck to see if there\u0027s a letter from Avi. It\u0027s been over two weeks since I\u0027ve gotten one. It\u0027s unlike him.\u003c/p\u003e\n\u003cp\u003e\"Well?\" I ask.\u003c/p\u003e\n\u003cp\u003eMy dad has this mischievous smile that gives it away. I hold my hand out. \"Give.\"\u003c/p\u003e\n\u003cp\u003eHe holds out a letter and I snatch it out of his hand. My heart skips a beat and my stomach feels like little butterflies are flying around inside me as I run my fingers over the return address.\u003c/p\u003e\n\u003cp\u003eSince Avi and I have this long-distance relationship, I get insecure. When I\u0027m in bed at night, thinking about how much I miss him, I wonder: Did he forget about me? Has he met someone else who\u0027s cuter or nicer or just...doesn\u0027t have as many hang-ups as me?\u003c/p\u003e\n\u003cp\u003eI\u0027m feeling a bit better as I rip open the letter, but then notice my dad staring at me...gauging my reaction.\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you read it out loud,\" he suggests.\u003c/p\u003e\n\u003cp\u003e\"Yeah, right,\" I say sarcastically. I stick the letter in my pocket, I\u0027ll read it later when I\u0027m in bed...alone.\u003c/p\u003e\n\u003cp\u003e\"Wait!\" Maria calls out as we\u0027re about to leave. She\u0027s holding a backpack. \"Do you know that boy who was sitting on one of the chairs over there? He left this.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Nathan\u0027s,\" I say. \"I\u0027m sure he\u0027ll realize it and come back to get it.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be silly, Amy,\" my dad says. \"You can return it to him on the way home.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/how-to-ruin-my-teenage-life-how-to-ruin-2/page-6.html","bookId":2765,"creation":"Oct 5, 2019 5:09:16 PM","modification":"Oct 5, 2019 5:09:16 PM"}
