{"id":87291,"no":13,"title":"Page 13","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Her date tried to rape her,” he said, voice low.\u003c/p\u003e\n\u003cp\u003e“Yes, and she sucked the life out of him for it.” I took a ragged breath. “And he deserved it. He would have killed her.”\u003c/p\u003e\n\u003cp\u003eCosta was silent for a few moments, as if considering the right thing to say. “You know that for sure?”\u003c/p\u003e\n\u003cp\u003e“Yes. The sharing that happens when a succubus drinks from her…well, normally her lover, it allows the couple to share emotions, thoughts, even memories.”\u003c/p\u003e\n\u003cp\u003eCosta turned and I gripped the door, though he took the turn slowly. “Later, when she was able to talk about it, she told me that she could see his plans for her body after he was done with her. Broken and ragged and dead at the bottom of a hole somewhere.”\u003c/p\u003e\n\u003cp\u003eCosta was silent, and I wondered if I was only adding to his view that succubi were dangerous. “She doesn’t deserve this,” I whispered. “She’d only just gotten herself back.”\u003c/p\u003e\n\u003cp\u003eCosta touched my shoulder, his hand cool against my suddenly too hot skin. “We’re going to find her, I promise.”\u003c/p\u003e\n\u003cp\u003eThe first warehouse on our list looked promising.\u003c/p\u003e\n\u003cp\u003eIt was in an industrial area on the south side of the city, and the exterior looked terrifying enough for a person to imagine a kidnapped girl being held there. Rust stains covered the old metal siding, and the neighborhood was quiet and dirty. Potholes pitted the asphalt that surrounded the building and the road leading to it. Bits of paper and cans traced the edges of the road.\u003c/p\u003e\n\u003cp\u003eI walked around the perimeter while we waited for the man with the key, conscious of Costa following in my wake. He moved quietly, which made me all the more aware of my heels knocking against the pavement.\u003c/p\u003e\n\u003cp\u003e“I’m going to look into that connection, you know,”\u003c/p\u003e\n\u003cp\u003eI told him after we’d circled the building. None of the windows was low enough to peer into, and both doors had been disappointingly sturdy. “Between Astrid’s murder and our kidnappings.”\u003c/p\u003e\n\u003cp\u003eHe was silent and still, like a snake about to strike. His dark eyes never strayed from mine.\u003c/p\u003e\n\u003cp\u003e“So if you have something you want to tell me, you should tell me now.”\u003c/p\u003e\n\u003cp\u003eChapter Eight\u003c/p\u003e\n\u003cp\u003eDarkness crept from every corner of the warehouse, and the air hung heavily, filling my throat and lungs with moldy dampness. I coughed to clear my throat and stepped into the room, clicking on my flashlight. No power ran to the structure. It wasn’t necessary since, according to Luc Chevalier, the building hadn’t been used in nearly five years. And the warehouse was not available for rent because it needed to be cleaned and renovated— one among many properties on their list with that issue, apparently.\u003c/p\u003e\n\u003cp\u003eCosta’s flashlight beamed from behind me, and I felt him move close—too close. I almost wished that Chevalier’s man had stayed with us instead of moving on to unlock the next warehouse. I took a step, then another, walking carefully to avoid the debris on the floor.\u003c/p\u003e\n\u003cp\u003eBits and pieces of metal were interspersed on the ground in small, cobwebbed piles. They looked like brackets of some sort—probably the last thing that was produced in this building. I moved my flashlight across the ground, revealing the large room foot by foot. The concrete floor was free of any equipment, and the warehouse looked like it was simply a big room devoid of anything to really hide behind, save some empty pallets stacked one to two feet high along the edges of the room.\u003c/p\u003e\n\u003cp\u003e“I don’t see any doors leading to other rooms, do you?” I whispered.\u003c/p\u003e\n\u003cp\u003e“Looks like an office in the back,” he said, voice only slightly louder than mine.\u003c/p\u003e\n\u003cp\u003eI followed him to the far side of the building, and sure enough, in one corner, a door stood. The window built into the top part of the wood was so covered in dust and grime that I couldn’t make out anything in the room beyond.\u003c/p\u003e\n\u003cp\u003eCosta moved from where he stood beside me to try the knob. It turned easily.\u003c/p\u003e\n\u003cp\u003eThe door drifted open and Costa pulled his gun from his belt, keeping it pointed at the ground.\u003c/p\u003e\n\u003cp\u003e“Police,” he called, with a voice loud enough to carry through the whole warehouse.\u003c/p\u003e\n\u003cp\u003eMovement in the corner of the room, just on the edge of my flashlight’s glow, made me jump. I pulled my gun as I hastily tried to follow the shape with the light. But I halted when I caught up to it.\u003c/p\u003e\n\u003cp\u003e“Damn rat,” I muttered.\u003c/p\u003e\n\u003cp\u003eWe searched what seemed like every square inch of the dirty old warehouse, but there was no basement or rooms other than the office and a couple of restrooms.\u003c/p\u003e\n\u003cp\u003eEvery inch felt emptier than the last and there was no sign that anyone had been in the building recently.\u003c/p\u003e\n\u003cp\u003e“She’s not here,” I said, as Costa pointed his flashlight across the rafters in the ceiling.\u003c/p\u003e\n\u003cp\u003e“You okay?” he asked, turning the flashlight to face the floor.\u003c/p\u003e\n\u003cp\u003e“No, I’m not okay,” I muttered, and then winced, hoping my voice was too low for him to have heard.\u003c/p\u003e\n\u003cp\u003eCosta grabbed my hand and squeezed. “If it were my brother in this situation, I wouldn’t be okay, either,” he said softly.\u003c/p\u003e\n\u003cp\u003e“You have a brother?”\u003c/p\u003e\n\u003cp\u003e“Yes. I have a brother.”\u003c/p\u003e\n\u003cp\u003e“Older or younger?” Was it possible Costa understood more than I credited him for?\u003c/p\u003e\n\u003cp\u003e“Younger,” he said, voice rough. “I am very protective of him, like you are of Elaine. I can’t imagine how you’re feeling right now. How you’re keeping it together.”\u003c/p\u003e\n\u003cp\u003eI grunted. “I thought you’d decided I was a cold bitch for handling it so well.”\u003c/p\u003e\n\u003cp\u003eI couldn’t see his face in the dark, but his hand dropped from mine. I fought not to reach for him, reach for the small bit of comfort that touch had given me, reach for the greater comfort I knew he could give me. If he wanted to.\u003c/p\u003e\n\u003cp\u003e“Let’s just go,” I said finally, the darkness and silence eating at me. “I’m fine. It was a long shot that we’d find her here. Let’s go to the next one.” I headed for the door, leaving Costa to follow me out, and tried to shove thoughts of Elaine trapped in a similar building—filled with dirt and rats and sharp pieces of metal—from my mind.\u003c/p\u003e\n\u003cp\u003eAfter searching through all three warehouses we’d pegged for the day, I had come to the conclusion that looking for a succubus in a warehouse was akin to looking for a needle in a haystack. And that Luc Chevalier was a bit of a slumlord. We’d found exactly nothing. Zip. Nada. And neither had the other team Vasquez sent to check out a couple of other warehouses across town.\u003c/p\u003e\n\u003cp\u003eMy stomach rumbled as Costa pulled up to the restaurant where I’d parked my car that morning.\u003c/p\u003e\n\u003cp\u003e“You want to go in and get a bite to eat?” Costa asked.\u003c/p\u003e\n\u003cp\u003e“Sure,” I said. There were worse things to look at while I ate than Valerio Costa, that was for sure.\u003c/p\u003e\n\u003cp\u003eWe walked into the restaurant and waited again for a table. A host manned the station today, a skinny young guy, who looked like he needed to grow into his long arms and legs—probably a college kid. I looked at Costa and frowned as I took in his expression. Anger creased his face into a glare. A look that he directed at the host.\u003c/p\u003e\n\u003cp\u003eI glanced at the man, but he didn’t seem to notice Costa’s attention. His eyes were solely focused on me, and I suppressed a sigh at the blatant look of hunger. I touched Costa’s shoulder and he tore his gaze from the young man and blinked at me for a couple of seconds before his expression cleared to his normal professional visage.\u003c/p\u003e\n\u003cp\u003eI didn’t really notice the looks men gave me anymore, not unless they were terribly dramatic in their attention.\u003c/p\u003e\n\u003cp\u003eBut obviously Costa wasn’t entirely comfortable with the stares.\u003c/p\u003e\n\u003cp\u003e“Are you all right?” Costa asked as we sat down at a table rather than the comfy booth we’d had earlier in the day.\u003c/p\u003e\n\u003cp\u003e“I’m as fine as I’m going to be until we find Elaine. I wish you’d quit asking me that.” I flipped open the menu and my eyes glazed over reading it. Everything looked good when I was hungry.\u003c/p\u003e\n\u003cp\u003e“Sorry,” he muttered. “You just seem…”\u003c/p\u003e\n\u003cp\u003eI looked at him over my menu.\u003c/p\u003e\n\u003cp\u003eA hint of a smile broke out on his face. “Okay, honestly, you look good—you always do. But you also look a little tired.”\u003c/p\u003e\n\u003cp\u003eI ignored the heat traveling up my neck. “Damn right, I look good.” I ignored his small prod about my lack of sleep. Of course I wasn’t sleeping.\u003c/p\u003e\n\u003cp\u003eThe waitress, a woman in her midforties who looked like she could do her job in her sleep, stopped by the table and looked at us expectantly. “What can I getcha?”\u003c/p\u003e\n\u003cp\u003e“Coke. Cheeseburger and fries, please. No pickles.\u003c/p\u003e\n\u003cp\u003eExtra mustard,” Costa said.\u003c/p\u003e\n\u003cp\u003eI trailed my eyes down the menu as she waited. Finally I said, “Fish sticks. Asparagus for the side. Oh, and hot tea, please.”\u003c/p\u003e\n\u003cp\u003eThe waitress made a small noise at that, but took our menus and wandered off.\u003c/p\u003e\n\u003cp\u003e“Really? Fish sticks and asparagus?” he asked, examining me like he’d never seen me before.\u003c/p\u003e\n\u003cp\u003e“I’m hungry. Everything looked good.”\u003c/p\u003e\n\u003cp\u003e“So you decided to order one thing from the kid’s menu and one from the adult’s?”\u003c/p\u003e\n\u003cp\u003eI laughed. The sound broke from my throat before I even realized what I was doing and how inappropriate it was given my current situation. I broke off abruptly, thoughts of Elaine milling around my brain.\u003c/p\u003e\n\u003cp\u003e“You can still laugh, you know,” Costa said. “It’s not betraying her to not be in mourning every second of every day.” He leaned back in his chair and crossed his arms.\u003c/p\u003e\n\u003cp\u003e“Besides, you’re beautiful when you laugh.” He cleared his throat. “Not that you’re not always—beautiful, I mean.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, that doesn’t exactly separate me from the crowd, now does it?” I said, suddenly more angry than happy about his compliment.\u003c/p\u003e\n\u003cp\u003e“Excuse me?”\u003c/p\u003e\n\u003cp\u003e“I’m a succubus,” I said, keeping my voice down to avoid bringing in the whole darn restaurant into our conversation. “Beauty is sort of a given. Allure, inspiring lust in the opposite sex. It all comes with the package.”\u003c/p\u003e\n\u003cp\u003eI took a deep breath, trying to think through how to say what I meant. “I didn’t earn any of it. It’s just what I am.”\u003c/p\u003e\n\u003cp\u003eHis cop face returned, expressionless and cold. “I suppose.” \u003c/p\u003e","sourceLink":"https://allnovel.net/succubus-lost-files-of-the-otherworlder-enforcement-agency-2/page-13.html","bookId":2263,"creation":"Oct 5, 2019 5:20:59 PM","modification":"Oct 5, 2019 5:20:59 PM"}
