{"id":90619,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Jesus, man. I don’t miss that a bit. My girlfriend loved that shi—” His eyes met my disapproving glare, and the man dropped his arm off Casper and nodded warily. “Ma’am.”\u003c/p\u003e\n\u003cp\u003eHis accent was even more golden and mellow than Casper’s. He was smaller and older, with shaggy blond hair graying at the temples, his face leathery with sun except for white rings around his eyes that matched the shape of the goggles perched on his hat.\u003c/p\u003e\n\u003cp\u003eI nodded primly, and Casper said, “This is my niece, Anne. And that’s Keen. Y’all—I mean, ladies—this is Teddy. He’s from Almanica, too.”\u003c/p\u003e\n\u003cp\u003e“Land of the free and home of the brave,” Teddy said genially, pantomiming the tip of a hat without actually moving his hat.\u003c/p\u003e\n\u003cp\u003e“How long?” Keen asked anxiously, and Teddy answered, “Twenty years, little lady.”\u003c/p\u003e\n\u003cp\u003e“Then you don’t even know about Google, do you?”\u003c/p\u003e\n\u003cp\u003e“Goggles, yes. Googles, no. But I miss Def Leppard most of all.”\u003c/p\u003e\n\u003cp\u003eKeen wrinkled her nose and said, “Lame.”\u003c/p\u003e\n\u003cp\u003eThe three of them all laughed together, and Mikhail and I shared a skeptical look. I had always heard that things were strange in the wild country across the ocean, but there was something definitely off about these Almanicans.\u003c/p\u003e\n\u003cp\u003e“Where?” Keen asked.\u003c/p\u003e\n\u003cp\u003e“San Antonio. You?”\u003c/p\u003e\n\u003cp\u003e“Raleigh.”\u003c/p\u003e\n\u003cp\u003e“Then we’re all from the right side of the Mason-Dixon, at least.” Teddy held out his hand, and Keen shook it. Then they just all stood there like idiots, grinning.\u003c/p\u003e\n\u003cp\u003e“The parachutes?” I barked, and Keen rolled her eyes.\u003c/p\u003e\n\u003cp\u003e“My bad,” Teddy said. He clapped Casper on the shoulder and went for the door. “Back in two shakes, friends.”\u003c/p\u003e\n\u003cp\u003e“I don’t approve.” Mikhail sneered at the door. “That man is wrong.”\u003c/p\u003e\n\u003cp\u003e“Lot of that going around,” Keen said, returning Mikhail’s sneer.\u003c/p\u003e\n\u003cp\u003eCasper chuckled to himself. “Oh, man. I thought I was a goner. I was grabbing the parachutes, and the door opened. I knew I was caught.”\u003c/p\u003e\n\u003cp\u003e“Then what happened?” I asked.\u003c/p\u003e\n\u003cp\u003eHe smiled, dimples and all. “Then he said ‘y’all.’ ”\u003c/p\u003e\n\u003cp\u003e“I take it that’s Almanican?”\u003c/p\u003e\n\u003cp\u003e“That’s Southern.”\u003c/p\u003e\n\u003cp\u003eTeddy barged in through the door with three large packs. Dumping them onto the floor at my feet, he said, “Good luck, y’all. I’ve got to skedaddle before the captain wonders where I got off to, but good luck with whatever you’re up to.” He looked pointedly at the parachutes. “I’d count to ten and start praying, folks.”\u003c/p\u003e\n\u003cp\u003eCasper jerked him into a hug, and they beat each other on the back like brothers.\u003c/p\u003e\n\u003cp\u003e“Good to see you, man,” Casper said. “It’s been too long since I’ve seen a face from home.”\u003c/p\u003e\n\u003cp\u003eKeen cleared her throat loudly, and Casper rumpled her hair affectionately.\u003c/p\u003e\n\u003cp\u003e“Not many make it,” Teddy agreed, pumping Casper’s hand again. “At least you got her. I had a kid about that age. Samantha. She’s grown by now, I guess. You’re a lucky man.” He dashed tears out of his eyes, rubbing the network of wrinkles at their corners tiredly. “Take care of that girl, you hear me?”\u003c/p\u003e\n\u003cp\u003eCasper put an arm around the shorter man’s shoulders. “Be careful out there, Ted.”\u003c/p\u003e\n\u003cp\u003eIt was one of the longest good-byes I’d ever seen, and they had just met.\u003c/p\u003e\n\u003cp\u003e“Baseball. Harleys. Convertibles,” Teddy said wistfully at the door.\u003c/p\u003e\n\u003cp\u003e“Movie theaters. Reese’s Peanut Butter Cups,” Casper answered.\u003c/p\u003e\n\u003cp\u003e“Cell phones and french fries and prom,” Keen muttered, and Casper pulled her into a hug and said, “You would have hated it, kid,” into the top of her head. She sniffled and hugged him back for just a second before pushing away from him and picking up one of the parachutes.\u003c/p\u003e\n\u003cp\u003e“Are you sure these things are functional?” I asked.\u003c/p\u003e\n\u003cp\u003eCasper wiped at his eyes. Without a word, he went to the closet and put on his leather traveling coat and his sturdiest top hat. He handed me one parachute and pulled the other one over his shoulders, tightening and buckling the straps across his chest.\u003c/p\u003e\n\u003cp\u003e“Too late to worry about that, darlin’. If it comes down to getting thrown off or jumping, I’ll jump every time.”\u003c/p\u003e\n\u003cp\u003e21\u003c/p\u003e\n\u003cp\u003eThe last thing Mikhail said to me was, “We’ll be ready.”\u003c/p\u003e\n\u003cp\u003eAll I could answer was, “Pray that you are,” in Sanguine and hope that he wouldn’t do anything rash in his fervor to serve me. And then he was gone, whispering with Teddy in unexpected camaraderie as they planned the disruption that would cover our escape.\u003c/p\u003e\n\u003cp\u003eWe waited a few moments, nervous and alert in the doorway. A loud boom rocked the ship with a sickening lurch, followed by shouting. Casper held up a finger to his lips and ran. Keen followed, and I took the rear.\u003c/p\u003e\n\u003cp\u003eThe straps of the parachute dug into my corset, the string that would open it bouncing against my stomach. I could taste the blood seeping up my throat, Big Gar and Gandy going sour in my belly. Getting onto the airship had taken every ounce of courage I possessed, but getting off of it was going to be exponentially worse.\u003c/p\u003e\n\u003cp\u003eThe route Casper took was a familiar one, and I wasn’t surprised when he led us into the library and locked the door from the inside.\u003c/p\u003e\n\u003cp\u003eAs he unlatched the breast-shaped window, I groaned. “Please, not that.”\u003c/p\u003e\n\u003cp\u003e“It’s a big window off the back of the ship. It’s the best shot we have of getting out of here alive and not in chains. How much do you want to win?”\u003c/p\u003e\n\u003cp\u003e“Enough to jump through a nipple.”\u003c/p\u003e\n\u003cp\u003e“Thought so.”\u003c/p\u003e\n\u003cp\u003eHe opened the window all the way, and a chill breeze rustled the pages of a book left open on the seat. I breathed in deeply, grateful to find no taste of salt on the air. With a sudden bout of inspiration, Casper took down a coiled rope, a long satin thing with tassels. I didn’t really want to think about why it was resting on a shelf in the library, but he didn’t offer me the chance to reject it. After stepping up onto the window seat, he helped me and Keen up and threaded the rope through the harness of first his parachute and then each of ours. He knotted the ends together and pulled it tight, forcing us into closer quarters than was comfortable or safe.\u003c/p\u003e\n\u003cp\u003eMy nose was buried in his chest, and Keen’s cheek was turned to my shoulder. Hunger trilled in the back of my throat, but I was still full enough of pirate blood that being so near didn’t send me into a frenzy.\u003c/p\u003e\n\u003cp\u003e“Is this really necessary?” With every word, I took in a lungful of Keen’s young, innocent edibility and Casper’s scent, masculine and spiced with sweat.\u003c/p\u003e\n\u003cp\u003e“Seriously,” Keen said, her voice muffled by my shoulder. “She smells like hot pennies.”\u003c/p\u003e\n\u003cp\u003e“If we get separated in the forest, you’ll think it’s pretty necessary,” he said.\u003c/p\u003e\n\u003cp\u003eFor a moment, we simply stood there, breathing fresh air and feeling the slight, sucking breeze. It was early morning, the clouds a sickly purple rimmed with red. At least it wasn’t raining.\u003c/p\u003e\n\u003cp\u003e“On three?” Casper asked.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eBut he’d already leaned backward out the round window, curling his arms around us like a shield and carrying us with him into the emptiness of the sky. My mouth opened in a scream as we tumbled, weightless, but Casper’s hand sealed my lips, and the sound died. Everything was happening both too quickly and with infinite slowness as the wind rushed around us. Up and down had no meaning, and my heart thumped against my corset. I fought to keep the blood down and the scream in and the tears at bay. We spun, and I caught a brief glimpse of the airship, her bronze balloon reflecting the morning sun with a fierce vengeance. The reclining woman on the gondola, which I now recognized as an optimistic portrayal of Miss May, seemed to be winking at me upside down.\u003c/p\u003e\n\u003cp\u003eAnd then Casper was laughing, and despite my terror and fear and utter confusion, I managed to glare at him. His face gave me something to focus on, as opposed to the nothingness of the sky, and the manic joy and wonder I saw there was startling.\u003c/p\u003e\n\u003cp\u003e“Woooooooohooooo!” he yelled, throwing his arms into the air. After a moment, Keen followed suit.\u003c/p\u003e\n\u003cp\u003e“Aren’t we supposed to pull the string and not die?” I shouted.\u003c/p\u003e\n\u003cp\u003e“Hold on, baby! It’s gonna be a bumpy ride!”\u003c/p\u003e\n\u003cp\u003eI clutched the front of his jacket with one hand, curling my head against his chest and trying to prepare myself for something for which one couldn’t really prepare.\u003c/p\u003e\n\u003cp\u003e“One . . . two . . . three!”\u003c/p\u003e\n\u003cp\u003eI pulled my string and nearly bit my tongue off as our bodies jolted against the tight straps of the parachutes. When I dared to pull my face away and look up, I saw two white pillows poofed out against the violet clouds.\u003c/p\u003e\n\u003cp\u003e“Casper! It didn’t go! Mine didn’t go!”\u003c/p\u003e\n\u003cp\u003eKeen pulled frantically at the string, but her pack was still contained. Although we’d slowed down a great deal, it felt as if we were moving too fast. With an ominous creak, the silky rope lashing us together slipped a few inches, and Keen grabbed Casper’s coat and my sleeve in a death grip.\u003c/p\u003e\n\u003cp\u003eCasper looked down, his face going ashen. “Just hold on, girl,” he said. “Keen, look at me. Hold on. You can do this. You’ve done worse. We’re going to get through it.”\u003c/p\u003e\n\u003cp\u003eThe rope creaked again, a few more inches sneaking out past Casper’s careful knot. Keen screamed and clawed at us as if she could climb our bodies and get to a safer place. Casper wrapped both arms around her waist and held her close with visible effort, the sweat starting to bead up on his forehead.\u003c/p\u003e\n\u003cp\u003eI looked down. A sea of dark green trees rose to meet us, fast and furious. Crows exploded from the pines just below us, their feathers left to drift in the air. One floated past my face, and I reached up in wonder to grab it, but we were falling too swiftly, and I knew it.\u003c/p\u003e\n\u003cp\u003e“Ahna!”\u003c/p\u003e\n\u003cp\u003eI looked up, startled out of my reverie by the urgency of Casper’s voice.\u003c/p\u003e\n\u003cp\u003e“You can take the most damage. Can you slow our fall somehow? I have to hold Keen.”\u003c/p\u003e\n\u003cp\u003eThe words ripped past my ears, stolen by the wind. I looked down, flexing my toes. There wasn’t much time before we tumbled into the trees. From high up, they had looked like moss or the cover on a bed, but as we got closer, the danger was thrown in stark relief. Sharp black branches, broken and ragged, reached toward us. It was so surreal, the falling, that I had forgotten to be afraid. But he was right—my body was much harder to injure and easier to heal than theirs were. My fear of heights was considered unusual among Bludmen. \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-as-she-wants-blud-2/page-30.html","bookId":1598,"creation":"Oct 5, 2019 5:44:03 PM","modification":"Oct 5, 2019 5:44:03 PM"}
