{"id":90625,"no":36,"title":"Page 36","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI scooted to sit beside him, my back against the headboard and my legs stretched out before me under the shimmering ripples of my dress.\u003c/p\u003e\n\u003cp\u003e“Truth,” I said.\u003c/p\u003e\n\u003cp\u003e“Why did you tell Mr. Sweeting that your name was Anne Carol?”\u003c/p\u003e\n\u003cp\u003e“You sneaky little creature!” I smacked his arm. I had taken the game for fun, but now he’d all but bound me to reveal secrets I wasn’t ready to share. I’d underestimated him again. But I had my honor.\u003c/p\u003e\n\u003cp\u003e“Anne is the Sanglish version of Ahnastasia, so that part is true. As for Carol, it’s the Sanglish version of Charles, which is the name of the Svedish king. Many people in my home country say that I’m his bastard daughter through my mother, who spent much time with the king in Stock-helm on a diplomatic mission that lasted longer than expected. As I’m the only person in my family with this coloring and without the Tsar’s trademark nose, I have always wondered if it was true.”\u003c/p\u003e\n\u003cp\u003e“Sweeting would have killed you if you had been wrong. I guess you have your answer now.”\u003c/p\u003e\n\u003cp\u003eMy eyebrows went up. “You’ve dealt with him?”\u003c/p\u003e\n\u003cp\u003eHe looked away. “Selling blud is the tamest of his pastimes.”\u003c/p\u003e\n\u003cp\u003e“Your turn.”\u003c/p\u003e\n\u003cp\u003e“Dare.”\u003c/p\u003e\n\u003cp\u003e“I dare you to kiss me.” I licked my lips and waited.\u003c/p\u003e\n\u003cp\u003e“You don’t play around, do you?”\u003c/p\u003e\n\u003cp\u003e“No. Why should I have to?”\u003c/p\u003e\n\u003cp\u003e“Well, then. I guess I’ve got no choice, do I, darlin’?”\u003c/p\u003e\n\u003cp\u003eHe leaned toward me with infinite slowness, his mouth curling in a smile and his eyes falling closed with a sweep of auburn lashes. I breathed him in, contented to find that my scent was highest in his blood, as if I’d marked him as my own. Long ago, when I’d first smelled him, I’d recognized the blud of other predators. Now I smelled only him and me, and it was a pleasant and heady mix. Just before his lips found mine, I leaned over to meet him.\u003c/p\u003e\n\u003cp\u003eIt was agonizing, the slowness with which he took my mouth. The ferocity of him roiled underneath, waiting. I parted my lips, wanting more, and his hand came up to cup my jaw and hold me in place. I was surely caught, but not by his hand, and I sighed when his tongue finally found mine, sweetly seeking and intense.\u003c/p\u003e\n\u003cp\u003eI had little experience with kissing, but he had plenty, and he used it well. Hot and sweet, firm and unyielding, he tasted me and teased me and made me hungry for more. He kissed me so carefully that my beast never rose; I felt all of the power with none of the frenzy, and, like a banked fire, the heat only grew the deeper it got. When he finally pulled away, I realized that I’d slid down the bed onto my back, my talons sunk in the pillowy coverlet and shredding the fluffy white.\u003c/p\u003e\n\u003cp\u003e“Your turn,” he said, his voice dusky with promise.\u003c/p\u003e\n\u003cp\u003e“Dare.”\u003c/p\u003e\n\u003cp\u003eThe grin he gave me was so masculine, so confident, so seductive, that I stopped breathing. “Now you kiss me.”\u003c/p\u003e\n\u003cp\u003eI smiled coquettishly and licked my lips. Bolstering myself on an elbow, I leaned over with the same casual slowness he had used to torture me and licked a searing line up his jugular vein, ending with a chaste kiss behind his ear.\u003c/p\u003e\n\u003cp\u003e“Oh, you little minx,” he growled.\u003c/p\u003e\n\u003cp\u003e“You didn’t say what kind of kiss or where,” I said blithely, putting my hands behind my head and my elbows out as I leaned back against the pillows. “Your turn.”\u003c/p\u003e\n\u003cp\u003e“Truth.”\u003c/p\u003e\n\u003cp\u003e“What do you want to do right this moment, Casper?”\u003c/p\u003e\n\u003cp\u003e“So many things, darlin’. So many things.” The look he gave me then—it burned right through me.\u003c/p\u003e\n\u003cp\u003e“That answer doesn’t count.”\u003c/p\u003e\n\u003cp\u003eHe sat up, leaning possessively over me. “Then I guess we’re even.”\u003c/p\u003e\n\u003cp\u003e“I don’t think we are.”\u003c/p\u003e\n\u003cp\u003eHe caught my chin in deft fingers, his lips so close I could feel their warmth against mine. “Are you trying to make me crazy, woman?”\u003c/p\u003e\n\u003cp\u003e“I was trying to stop that from happening, but I think I’ve changed my mind. I like you better wild.”\u003c/p\u003e\n\u003cp\u003eSomething twisted in the air between us, a breathless pause that reminded me of that moment when the first snowflake falls, giving the sky permission to erupt in flurries of blinding white. He was kissing me before I’d even noticed him moving, and I took it as permission to let go of the control I’d kept around him until then. My hands caught in his hair, and he pressed me back, deep into white blankets that billowed around us like clouds.\u003c/p\u003e\n\u003cp\u003eI laughed fiercely into his mouth, and he whispered, “This is serious, girl,” and licked a searing trail up my neck to the same place where I’d kissed him earlier, right behind my ear. It ran tingles of fire down my spine, and I gasped and made fists in his hair. No wonder he’d called me a minx. That place was like liquid gold. He was halfway on top of me, and I curled one leg over his leg, keeping him there. He made me feel small and dainty, and I liked the weight of him, pressing against me in the most wonderful ways.\u003c/p\u003e\n\u003cp\u003eHe took my mouth again, his tongue dipping between my lips with ferocious purpose. I was learning, and I kissed him back, loving the taste of him. Pulling away and licking my lips, he murmured, “I want more.”\u003c/p\u003e\n\u003cp\u003eGrabbing me around the waist, he pulled me down until I was stretched out the full length of the bed. He placed one hand on my neck, trailing it down my chest and stomach.\u003c/p\u003e\n\u003cp\u003e“And your very flesh will be a great poem,” he said.\u003c/p\u003e\n\u003cp\u003e“You have me laid out before you, and you speak of poetry?” I couldn’t help laughing. “Is that how things are done in your world?”\u003c/p\u003e\n\u003cp\u003e“You make me remember things I thought were lost forever,” he whispered. “Things I needed. Things I’m glad to have back.”\u003c/p\u003e\n\u003cp\u003e“Maybe one day you can scrawl poems on me with a brush,” I purred. “Starting at my ankles, with black ink winding ever upward.”\u003c/p\u003e\n\u003cp\u003e“Oh, woman. It’s like you want to kill what’s left of the gentleman inside me.”\u003c/p\u003e\n\u003cp\u003e“I don’t want him dead. Just quiet. Kiss me again.”\u003c/p\u003e\n\u003cp\u003eI pulled him down to me and nipped his lip. Words were pretty, but I didn’t want words. I wanted his body, his mouth, his growls. I wanted the fire behind his eyes to consume us both. I wanted the flame he had kindled in me to catch and burn. I wanted him to make me forget everything else.\u003c/p\u003e\n\u003cp\u003eHe kissed down my neck and along my collarbone, his lips and tongue searing against my skin. It was as if I’d never felt anything before, as if every inch of my body was waking up, and waking up hungry. He kissed along the neckline of my gown, following it to the V and licking deep in the line between my breasts. I moaned underneath him, pressing upward, aching to rub against him as I’d once seen a cat do.\u003c/p\u003e\n\u003cp\u003eHis hand slipped under me to fiddle with the buttons down my back, and I rolled to my side to accommodate him. If his deftness with buttons was any indication, those nimble fingers were going to be delicious on my skin.\u003c/p\u003e\n\u003cp\u003eHe was running his tongue across the tops of my breasts when the lights winked out, leaving us in complete darkness. I gasped and pulled back, for there wasn’t even the faintest hint of light to see by. I was lost without all my senses.\u003c/p\u003e\n\u003cp\u003e“There’s a tunnel,” Casper murmured into my skin. “Under the mountains.”\u003c/p\u003e\n\u003cp\u003eI felt the kiss of skin on my back and sighed as he pulled the strings of my corset, releasing the bow. His mouth was still busy with the mounds of my breasts pushed up by the corset, and he found one nipple and teased it with his tongue.\u003c/p\u003e\n\u003cp\u003e“But, Casper, the lights . . . ?”\u003c/p\u003e\n\u003cp\u003e“The shadows will fall behind you.”\u003c/p\u003e\n\u003cp\u003eWhen his lips slanted again over mine, messy and rough in the dark, I thought perhaps he kissed me just to shut me up, and I obliged him by unbuttoning his collar, down and down, until his chest was laid bare to my hands.\u003c/p\u003e\n\u003cp\u003eJust then, a sound rang out over the throbbing hum of the train. Metal scraping against metal—in the door’s lock. With a hiss and reflexes long honed by the threat of assassins, I grabbed Casper’s shirt and yanked him to me, rolling us both onto the ground beside the bed. Before he could ask me why, I put a hand over his mouth. Even without a Bludman’s perfect hearing, he should have recognized the sound of a heavy boot on the floor of my room.\u003c/p\u003e\n\u003cp\u003e25\u003c/p\u003e\n\u003cp\u003eThe door opened on silent hinges. Casper froze for the barest moment before lurching to his feet and springing away. I couldn’t see anything, but I heard a strange man’s yelp of surprise. After a quick tussle, liquid splashed over the ground, and I crawled up on the bed before the salt-reeking water could reach me. The smell was sharp and painful, biting at my nose. The fight continued, and an unfamiliar voice shrieked in wordless fury. The scent of burning flesh filled the room, and Casper called, “Are you hurt? Did the bastard get you?”\u003c/p\u003e\n\u003cp\u003e“I’m unharmed. What’s happening? I can’t see anything!”\u003c/p\u003e\n\u003cp\u003eThree quick thumps, then the heavy smack of a big form landing on the ground, all of it overlaid with shrieking and growling and an unsettling hiss.\u003c/p\u003e\n\u003cp\u003e“How do you kill a Bludman?” Casper grunted with effort. “Quick!”\u003c/p\u003e\n\u003cp\u003e“You can’t kill him yet. We have to question him first.”\u003c/p\u003e\n\u003cp\u003e“Screw questioning him!” Casper shouted between the sounds of a struggle. “He’s big, and he’s already been hit with his own seawater, and he’s still not cooperating.”\u003c/p\u003e\n\u003cp\u003e“Little bitch, I hear you!” the man called between grunts. He had a thick Svedish accent, and I breathed in deeply, trying to get a sense of him. A Bludman, and one strong enough to fight while soaked in seawater.\u003c/p\u003e\n\u003cp\u003eAnd then I knew the answer to Casper’s question about killing him.\u003c/p\u003e\n\u003cp\u003eWithout saying a word, I crept forward, one hand out in front of me and my boots splashing in the puddle.\u003c/p\u003e\n\u003cp\u003e“Where are you, Casper?”\u003c/p\u003e\n\u003cp\u003e“On the ground. I’m on top of him. But stay back; he’s covered with salt water.”\u003c/p\u003e\n\u003cp\u003eI scooted one foot ahead of me until I nudged a heavy boot. It struck out at my leg, and I jerked back before he could bruise me. Carefully and quietly, I nudged my way up his body. He tried to grab my boot at one point, and I stepped on his hand and ground the bones under my heel.\u003c/p\u003e\n\u003cp\u003e“I can see you, ice bitch,” he growled. \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-as-she-wants-blud-2/page-36.html","bookId":1598,"creation":"Oct 5, 2019 5:44:03 PM","modification":"Oct 5, 2019 5:44:03 PM"}
