{"id":90637,"no":48,"title":"Page 48","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWe were silent as we walked slowly down the hall. Casper glanced briefly through the other doors, taking in the paintings of Olgha, Alex, and my parents, captured in a rare and planned moment together, stiff and wooden even considering the kindness of the artist’s brush. Mounds of tiny crystal vials rested on every flat surface of the room—one blud tear in each, the formal show of mourning. My eyes squeezed shut in pain. I should have brought a vial and left a tear of my own, one drop of royal blud among thousands.\u003c/p\u003e\n\u003cp\u003eAs if reading my mind, he squeezed my arm. “We’re going to kick that bitch’s ass,” he said.\u003c/p\u003e\n\u003cp\u003e“That we are,” I answered, squeezing back.\u003c/p\u003e\n\u003cp\u003e32\u003c/p\u003e\n\u003cp\u003eOur afternoon passed in the sweet haze of stolen indulgence. Browsing in shops, strolling down streets lined with tinkling snowdrops, visiting the world’s largest collection of blud creatures in the Muscovy Zoo and laughing at the camels. We kissed in the highest belfry of the Basilica of Aztarte as I sat in a window, my hair rustled by a breeze that smelled of the coming snow. I found that I was no longer frightened of heights. Afterward, Casper stood in the window himself, leaning outward over the whole city, and yelled something barbaric that sounded very much like “Yawp.” It brought him such strange joy that I found it bizarrely endearing.\u003c/p\u003e\n\u003cp\u003eRemembering Verusha’s favorite treat, I stopped at a vendor in the Franchian district and bought a painted box of sugared liver. What were a few more coppers when soon I would be either dead or the reigning monarch? And it was worth it, seeing her face light up when we walked through the door of the groomery.\u003c/p\u003e\n\u003cp\u003e“Ah, darleenk, you remembered!” She snatched the box and popped a sliver into her mouth, sucking blissfully as she ushered us into her sitting room. Casper moved toward the divan, but she plucked at his jacket and tugged him into the last rays of afternoon sun by the window. She walked around him, old eyes narrow and calculating. “Tell me, now. Was it as horrible as they say?”\u003c/p\u003e\n\u003cp\u003eCasper managed to keep a straight face, and I merely inclined my head and said, “We managed to survive.”\u003c/p\u003e\n\u003cp\u003eVerusha slapped Casper in the ribs, and he stood up straighter. She ran his hair through her talons and slid a hand down his arm, squeezing his muscles. She held his fingers up to the light, saying, “Interesting. It’s coming on quite fast. But I can smell it on you, the vestiges of your humanity. You’ll need a good bathing.”\u003c/p\u003e\n\u003cp\u003e“Another grooming?” He grimaced and glanced at the door to the groomery.\u003c/p\u003e\n\u003cp\u003eVerusha drew back, one hand to her chest in affront. “A Bludman? In my groomery? How obscene.”\u003c/p\u003e\n\u003cp\u003e“We might as well drag you out to the trough with the bludmares,” I added with a grin. I swiped a bit of liver from the open box and savored the tartness of the sour sugar against the rich tang of blood.\u003c/p\u003e\n\u003cp\u003e“So I’m just suddenly . . . different to you?” Casper asked. His face was guarded, a strange mixture of anger and bemusement.\u003c/p\u003e\n\u003cp\u003e“My boy, you have gone from stew to stud,” Verusha said, popping another bit of candy into her mouth. “It is not often one changes species overnight. We should celebrate. You are hungry?”\u003c/p\u003e\n\u003cp\u003eHe nodded silently, as if it pained him to admit it. Verusha opened the warming cube that hummed gently on a shelf and withdrew two vials of blood. She took down two teacups, poured for us, and served, bowing her head slightly to him and greatly to me in the proper show of deference.\u003c/p\u003e\n\u003cp\u003eCasper sat, rigid, on the edge of the sofa. He took a sip of blood, tentative and with great concentration, as if every time he tasted it, he was afraid to find it repellent. After a few more sips, he relaxed all over and settled back against the cushions.\u003c/p\u003e\n\u003cp\u003e“I told you hunger would make you peevish,” I said, and he chuckled.\u003c/p\u003e\n\u003cp\u003e“Funny how it loosens you up a little. Almost like alcohol but without the fuzziness. I feel just as sharp, just not like everything you say is a challenge. Much better.”\u003c/p\u003e\n\u003cp\u003eHe leaned back, one boot on his knee, savoring his blood as if trying to puzzle out a rare vintage.\u003c/p\u003e\n\u003cp\u003e“I would swear it tastes like butter,” he said between sips. “How is that possible?”\u003c/p\u003e\n\u003cp\u003e“Verusha prefers good country stock,” I supplied. “These Pinkies would have access to fresh dairy and butter, and perhaps that’s what you’re tasting. I sense cream and sunshine and freshness. Quite round and full-bodied.”\u003c/p\u003e\n\u003cp\u003eVerusha settled back into her pillows with a handful of liver candy perched on her prodigious bosom. An easy life indoors, extra vials of country blood, and plenty of sweetmeats had made her cushy, and she was enjoying it.\u003c/p\u003e\n\u003cp\u003e“Good for the constitution,” she said.\u003c/p\u003e\n\u003cp\u003e“And what’s that, in the box?” Casper asked, setting down his empty teacup and leaning forward to pluck a bit of liver from the box on the table.\u003c/p\u003e\n\u003cp\u003eShe hissed and made as if to swat him. “Stay out of an old woman’s sweets,” she muttered. “It’s too expensive to waste on someone with no taste for riches.”\u003c/p\u003e\n\u003cp\u003eHe dodged her hand and sniffed the bit of deep red liver, coated with crystallized sugar and resembling a bright jewel. He had just opened his mouth when the door swung in to reveal a cleaner-than-usual Keen, her hair pulled back under the traditional kerchief of low-ranking Pinky servants.\u003c/p\u003e\n\u003cp\u003e“Is that candy?” She grinned as if she’d never been gone, skittering to his side and plunking herself down on the divan. “All the food here is dull. No salt. What’s the point?” Before she could dig her gloved fingers into the box, he snapped it shut.\u003c/p\u003e\n\u003cp\u003e“It belongs to Verusha,” he said. “Please try to have some manners.”\u003c/p\u003e\n\u003cp\u003e“What the hell, Maestro? Who died and made you God?” She slung her booted feet up onto the small table and took out her clockwork tortoise, still in sphere form, tossing it from hand to hand. Casper quivered beside her and began breathing through his mouth, and I realized that it was the first time he’d been trapped in a small, airless room with a Pinky since being bludded.\u003c/p\u003e\n\u003cp\u003e“We should go.” I stood and held out a hand to Casper, unsure of what I would do if he rejected the offer. But he took my hand and hurried around the table, away from Keen, who smelled less repulsive after a good grooming.\u003c/p\u003e\n\u003cp\u003e“Where are we going?” she said, clearly puzzled. “And where were you guys last night? And where have you been all day?” Her eyes narrowed as she looked at the open neck of Casper’s shirt, and then she looked him up and down. “Smile,” she commanded, glaring.\u003c/p\u003e\n\u003cp\u003e“I don’t think I can.”\u003c/p\u003e\n\u003cp\u003eShe threw her tortoise down and rounded on me, hands balled into fists, as vicious and small as the bludweasel we’d seen at the zoo. “What did you do?” She stepped close enough for me to smell the scent of violets from Verusha’s shampoo. “What did you do to him?”\u003c/p\u003e\n\u003cp\u003e“What had to be done,” Casper said tiredly, pulling her back by the shoulders while keeping his face firmly turned away. “We didn’t have a choice. I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“You’re sorry? You’re frigging sorry?” Keen backed away from us, one step after another toward the door. She was fighting tears, shoulders heaving. “You were fine, Casper. Why’d you have to ruin everything?”\u003c/p\u003e\n\u003cp\u003e“I didn’t tell you. I couldn’t. But it was getting bad in London. Worse on the Maybuck. I was starting to lose it. You don’t understand—”\u003c/p\u003e\n\u003cp\u003e“I don’t understand? Why you’d let her turn you into one of them? Jesus, Casper. You’re not even a person anymore. You’re a monster.” She whipped the kerchief off her head and wiped her eyes angrily. “I read your frigging journal, you whiny sack. I can’t believe that after that chick at the caravan chose a Blud over you, you kept drinking. You’re such a goddamn addict. You’re so sad. And weak. You’re just like . . .”\u003c/p\u003e\n\u003cp\u003e“Like what, Keen?” A deadly calm had come over him. “Like whom?”\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter. I just expected better from you.”\u003c/p\u003e\n\u003cp\u003e“I was lost long before you showed up. There was no escaping my past. You can’t undo that much bludwine. It was this or madness.”\u003c/p\u003e\n\u003cp\u003eShe snorted and leaned back against the wall beside the door. “Don’t you get it? This is madness. You’re totally bugshit. You’re always supposed to fight it, Casper. Dracula, the bad guys in Blade, the Lost Boys. Even Colin Farrell. They’re bad guys. They kill people. You’re always supposed to fight the vampires!”\u003c/p\u003e\n\u003cp\u003e“But vampires are cool. I thought it was zombies that you were always supposed to fight?” The corner of his mouth quirked up hopefully, his dimples flashing with a Bludman’s killer charm, and she shut her eyes and beat her fist against Verusha’s damask wallpaper.\u003c/p\u003e\n\u003cp\u003e“You think this is a joke? Awesome. I guess I’m the punch line.” She pointed at me, right at my heart. “And I hope that gypsy bitch rips you in half. You’d make a suckass queen, anyway, considering you don’t care about anyone but yourself.”\u003c/p\u003e\n\u003cp\u003eOne hand on the doorknob, she glared at him. He looked away, and she was gone. When the door slammed behind her, Casper finally inhaled. Verusha was already fetching another vial for him. He took the teacup and drank it down in several gulps, desperately and without testing or savoring it this time.\u003c/p\u003e\n\u003cp\u003e“She’ll be back,” he said quietly. “She always is.”\u003c/p\u003e\n\u003cp\u003eVerusha and I nodded, but I wasn’t so sure. That last look she’d given us had burned like a slap across the face. Somewhere deep inside me, the old version of Ahnastasia snarled and envisioned a slender head on a pike in the snow, the short brown hair dark against the hills and dripping blood. But the new version of me ached painfully and wished there had been some way to make her see the truth of it.\u003c/p\u003e\n\u003cp\u003eI picked the brass sphere off the couch and turned it over in my hands.\u003c/p\u003e\n\u003cp\u003e“She wanted a pet,” Casper said. “I always said I would buy her a clockwork, but I just never got around to it. She’d be hanged for stealing that. I guess I didn’t realize how much she needed . . .”\u003c/p\u003e\n\u003cp\u003e“A friend,” I whispered.\u003c/p\u003e\n\u003cp\u003eWhen I looked down, I found Casper’s hand in mine, but I couldn’t recall when it had happened or who had reached for whom. I squeezed back anyway. I couldn’t explain it, but I had lost something, too, and I already missed the little urchin. I could only hope that we all survived long enough for me to find her and fix the mess I’d made of a fellow victim’s life. \u003c/p\u003e","sourceLink":"https://allnovel.net/wicked-as-she-wants-blud-2/page-48.html","bookId":1598,"creation":"Oct 5, 2019 5:44:03 PM","modification":"Oct 5, 2019 5:44:03 PM"}
