{"id":8430,"no":18,"title":"CHAPTER XVII. AN ATHLETIC CONTEST.","content":"\u0026nbsp;THE two boy riders were taking their usual afternoon walk, when they met Carden. The canvas man frowned, but his face seemed also to wear an expression of triumphant malice, as if he could foresee some evil in store for Robert. \n\u003cdiv\u003e\n \"Did you notice how Carden looked, Robert?\" asked Charlie.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not very pleasant. He hasn\u0027t forgotten me for detecting him in his attempt to rob me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He looked as if he had heard of some bad luck for you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That must be your imagination, Charlie. I\u0027ve had no bad luck.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder what makes Carden stay here now he is discharged from the circus,\" said Charlie, thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose he can stay here as cheap as anywhere,\"137 said Robert. \"I don\u0027t trouble myself about him or his plans.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is your enemy, Rob. He may try to do you some harm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will be on my guard, but I won\u0027t worry myself about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n They came to an open field, where half a dozen boys were engaged in athletic sports. There was soon to be a picnic, and prizes had been offered for the best running, leaping and vaulting, and these boys were engaged in practising for the grand contest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let us stop and look at them,\" said Charlie.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well,\" answered his friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n So they took up a position about fifty feet away and regarded the contestants with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n Their presence was noticed by the boys, who at once recognized them as circus riders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let us invite them to join us,\" said Frank Perry, a boy of sixteen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" chimed in several others.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I object,\" said Ronald Percy, stiffly. \"My father wouldn\u0027t care to have me associate with circus performers.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ronald was the son of a rich manufacturer, and138 was generally considered snobbish by his companions. At any rate he presumed greatly upon his \"blue blood\" and his father\u0027s wealth, and attempted to be very exclusive. It certainly was nothing to the discredit of his father that he had worked his way up to his present position from the position of a poor factory boy, but it might have led Ronald to reflect upon the folly of his personal pretensions. But his mother claimed to be of \"genteel\" family, and had imbued the boy with her own notions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the objection, if they are circus performers?\" asked Sidney Grey, who might really have claimed aristocratic lineage if he had so desired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you consider circus performers fit company for you?\" asked Ronald, superciliously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, if they behave themselves like gentlemen; and these two look as well bred as we are.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course they do,\" said Frank Perry. \"Let us have them here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n This seemed to be the general wish, and Ronald\u0027s protest went for nothing.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sidney Grey left the group of boys and walked towards where Robert and Charlie were standing.139 He was a slender boy with a frank, pleasant face which prepossessed a stranger in his favor at first sight.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you join us?\" he asked. \"We are practising for the picnic next Saturday. There are to be some prizes offered for running, vaulting, and so on.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you,\" answered Robert. \"I will join you with pleasure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So will I,\" said Charlie, \"but I am afraid I might beat you all in jumping.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will take the risk,\" said Sydney, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We are just going to have some leaping, and will give you a chance. Perhaps it is lucky you won\u0027t be at the picnic.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Sidney returned to his friends, followed by the two circus boys.\n\u003c/div\u003e \n\u003cdiv\u003e\n The trial about to commence was a standing jump. The two rivals for superiority were Sidney and Ronald. They were of about the same size, and seemed, so far as appearance went, very well matched. Probably there was nothing, save his family and position, of which Ronald was more proud than of his jumping, and he looked140 forward complacently to the trial which was now about to take place.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you try first?\" asked Sidney of Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, thank you; I will wait to the end.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you?\" he next asked of Charlie Davis.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t mind,\" answered Charlie, readily.\n\u003c/div\u003e \n\u003cdiv\u003e\n Charlie was small of his age, and was not likely to be a very formidable competitor. He made a jump which proved to be a little less than five feet, and was not bad for a boy of his size who was not accustomed to this kind of exercise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There, boys, beat that if you can,\" he said, of course in fun.\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys smiled and the trial continued.\n\u003c/div\u003e \n\u003cdiv\u003e\n It is unnecessary to chronicle each jump. Sidney Grey came up at last and jumped six feet and three inches.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, Sidney,\" said one of his friends. \"I don\u0027t believe that will be beat.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do,\" said Ronald, emphatically. \"I haven\u0027t tried yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Take your turn, then,\" said Sidney, good-naturedly. \"I shouldn\u0027t be surprised if you beat me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Ronald appeared to be of the same opinion, and141 it turned out that his expectations were fulfilled. He gathered himself up for a tremendous effort, and cleared six feet four inches.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good!\" said Sidney, not disturbed by his rival\u0027s success. \"If you jump like this next Saturday you will carry off the prize.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve beat you all,\" said Ronald, triumphantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not quite all,\" said Sidney. \"There\u0027s one here who hasn\u0027t jumped yet,\" pointing to Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh well, he can try if he wants to,\" said Ronald, superciliously, looking as if he thought it didn\u0027t matter much whether he did or not.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your name is Robert, isn\u0027t it?\" said Sidney.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then, Robert, you will have the honor of closing this contest.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Under ordinary circumstances Robert would not have cared to win, but he had chanced to overhear Ronald\u0027s objections to associating with circus performers, and had noticed the airs of superiority which he assumed, and he thought he would like to take down his pride a little. His training had given him unusual strength and elasticity of limb, and he was better prepared than any of the other boys to excel in a contest of this kind.\n\u003c/div\u003e \n\u003cdiv\u003e\n 142\n\u003c/div\u003e \n\u003cdiv\u003e\n He took the position which had been marked as the starting point, and standing for a moment motionless, made a sudden spring forward, and the result was regarded with admiring astonishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Six feet and eight inches!\" declared Sidney, after measuring. \"You are the champion, Robert. None of us can come up with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The face of Ronald was an interesting study. He was astonished and mortified. He couldn\u0027t bear to have his record surpassed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It wan\u0027t a fair leap,\" he said with chagrin. \"He stood too far forward.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, he didn\u0027t,\" answered, Sidney; \"I noticed how he stood myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you like, I will jump again,\" said Robert quietly, turning to Ronald.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will be fairer,\" said Ronald, hoping Robert would the second time fall short of his own mark.\n\u003c/div\u003e \n\u003cdiv\u003e\n Again Robert took his place, and would not jump till Ronald himself had declared that he was in the right place. Then, making an extra effort, he cleared six feet and nine inches.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You didn\u0027t make much by your doubting,143 Ronald,\" said Frank Perry. \"Are you satisfied now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I didn\u0027t bargain to jump against a circus boy,\" said Ronald, sullenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That won\u0027t affect your chances at the picnic,\" said Sidney. \"Robert won\u0027t be there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nor I,\" said Charlie Davis.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We are not much afraid of you, Charlie,\" said Sidney, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I didn\u0027t half try!\" said Charlie.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s lucky for us you didn\u0027t,\" said Sidney.\n\u003c/div\u003e \n\u003cdiv\u003e\n Ronald walked off in disgust, but Robert and Charlie remained with their new friends, whom they found pleasant and companionable. That was the last of the contests, but a game of ball was got up, in which the two circus boys joined.\n\u003c/div\u003e \n\u003cdiv\u003e\n When they were ready to part Sidney said, in a friendly way, \"I am glad to have made your acquaintance. Come and see me to-morrow afternoon if you feel like it. I should like to ask you something of your life and adventures, for I suppose you have had adventures.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you; I will come,\" answered Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n But circumstances arose which prevented his keeping his engagement.\n\u003c/div\u003e \n\u003cdiv\u003e\n 144\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3014/83305.html","bookId":277,"creation":"Aug 1, 2019 8:32:30 AM","modification":"Aug 1, 2019 8:32:30 AM"}
