{"id":8431,"no":19,"title":"CHAPTER XVIII. THE CANVAS MAN FINDS A BONANZA.","content":"\u0026nbsp;FITZGERALD had put a new idea into the head of the canvas man—an idea which the man\u0027s unscrupulous and cruel nature readily welcomed and adopted. It was with malicious satisfaction that he thought it over, and considered how he should carry it out. \n\u003cdiv\u003e\n There was, however one circumstance that interfered with his cheerfulness—the want of money. He had never been a saving man, and now that he was discharged, and without an income, his fortunes were at a low ebb. He foresaw that after carrying out his purpose it would be necessary for him to leave Crampton, but as his purse contained but seventy-five cents it did not seem possible to go far unless he walked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I had only got that boy\u0027s $200, I should be all right,\" he said to himself. \"It would have been better for him and for me, too, for in that case I wouldn\u0027t do him any harm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Accident\n\u003c/div\u003e \n\u003cdiv\u003e\n The Accident in the Ring.\n\u003c/div\u003e \n\u003cdiv\u003e\n 145\n\u003c/div\u003e \n\u003cdiv\u003e\n Carden had no friends of whom he could ask a loan with any hope of success—in fact, it is doubtful whether he had any friends at all. While in this perplexity he chanced to recall a conversation he had heard some days before in a billiard saloon. It ran thus:\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Tarbox has more money than any farmer in town. He is mean and close-fisted, and so spends next to nothing. Of course when that is kept up year after year a man can\u0027t help getting rich.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where does he invest his money—in savings banks?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, he is afraid of them. He is of a suspicious nature, and I shouldn\u0027t wonder if he follows the example of an old uncle of his who died twenty years ago.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How is that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, the old man lived in a miserable way in a poor hut, and after he died it was found that he had secreted large sums in various places in and about the hut. I don\u0027t know how many thousand dollars.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did Nathan Tarbox inherit any of his uncle\u0027s money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 146\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, he came in for a third of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You think he hides his money in the same way?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it very probable. Of course it is very silly, for he gets no interest, and he is really in more danger of losing it than if it were earning dividends of interest in some good bank. However, that\u0027s the man\u0027s nature.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n In his necessity Carden recalled this conversation, and, having no conscientious scruples, he pondered how he should turn it to account.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I could find one of the farmer\u0027s hiding-places for his money,\" he thought, \"I might make a good thing out of it. The money isn\u0027t doing him any good. I might as well have it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He mechanically took his way towards the Tarbox farm, impelled by a faint hope that he might hear or see something to his advantage.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now it chanced that at some distance from the farm-house was an old barn, which had been built by the farmer\u0027s father, and which was still used, though a newer one had been built nearer the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n From the street, towards the close of the afternoon, Carden saw Mr. Tarbox taking his way towards147 this old barn, and out of curiosity he jumped over the stone wall and followed him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder if it would do any good to ask him to lend me five dollars?\" thought the canvas man. \"I might tell him I had been discharged through the influence of Anak and the boy, and he has reason to hate both. At any rate it won\u0027t do any harm to try. So I\u0027ll follow him cautiously, and see if I can accomplish anything.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Tarbox did not perceive that he was followed. He went by a well-worn path to the old barn, and, opening a small door at the side, went in.\n\u003c/div\u003e \n\u003cdiv\u003e\n Carden came up presently and peered in through a crack of the door. The crack was narrow, but still wide enough to enable him to see what was going on within.\n\u003c/div\u003e \n\u003cdiv\u003e\n Carden was actuated at first by mere curiosity, but his curiosity speedily gave place to deep interest when he saw Tarbox lift a trap door and prepare to descend into the barn cellar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is he going to do, I wonder?\" thought the canvas man.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was disappointed to find that the farmer and his operations were concealed from him, as,148 though he could see the trap door, he could not look down into the cellar. Of course it was possible to enter the barn and look down, but this would be too venturesome, and, if he were observed it would be hard to explain his curiosity in any satisfactory manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n However, it occurred to the eager looker-on that it might be possible for him to look down into the barn cellar through some crevice near the bottom of the barn. No sooner had the idea come into his mind than he discovered exactly such an opening as he desired. He lost no time in throwing himself flat upon the ground, and putting his eye to a round hole—once a knot hole.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now his curiosity was gratified. Through this loop-hole he saw the farmer with a small spade in his hand, which he appeared to keep permanently under the barn, digging at a particular spot in the northeast corner, only a few feet from the ladder beneath the trap-door.\n\u003c/div\u003e \n\u003cdiv\u003e\n Carden\u0027s heart beat high at this sight. It naturally recalled to him the conversation he had heard in the billiard saloon, and putting the two together he jumped to the conclusion that Tarbox had149 come to this out-of-the-way spot to visit one of his hoards—perhaps to add to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If it should be so,\" he muttered to himself, \"then I am in luck. It won\u0027t be my fault if I don\u0027t borrow a good sum without the farmer knowing anything about it. Let me see what he is doing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n He glued his eyes persistently to the loop-hole, and watched with an anxious eagerness which can be surmised the movements of the miserly farmer.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tarbox did not need to dig long. Presently he threw aside his spade, and getting on his knees began to fumble with his hands in the cavity he had made.\n\u003c/div\u003e \n\u003cdiv\u003e\n He drew up a round wooden box, such as housewives often use to keep saleratus or other supplies in, about the size of a market box of strawberries. Probably it was one he had taken from the pantry without his wife\u0027s observation, for Tarbox was a man who could keep a secret from his wife, at any rate when it related to money.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Carden saw this box produced his suspicions were increased almost to certainties, and he waited with breathless anxiety till Tarbox should open it.\n\u003c/div\u003e \n\u003cdiv\u003e\n 150\n\u003c/div\u003e \n\u003cdiv\u003e\n This the farmer did not long delay doing, and the unseen witness was rewarded for his watching in seeing that the box was more than half full of silver and gold. The silver preponderated, but a few gold coins were mixed with them.\n\u003c/div\u003e \n\u003cdiv\u003e\n Carden felt like a hungry man favored with the sight of a rich repast, and his eyes glittered with cupidity. He would like to have made his way at once to the cellar, throttled the farmer and seized the box, but that would have been very imprudent. Tarbox was a powerful man, and he would have fought desperately for the money that was so dear to him. Besides, even had Carden secured the box, he could have hardly got away in the afternoon without being observed. No, he must curb his impatience, and defer his visit to a more seasonable time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can do it to-night,\" he muttered to himself, \"after the performance is over. Then I will get out of town as soon as I can. I wonder how much money there is there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n This was a fruitful and pleasing subject of contemplation, and occupied his thoughts as he hurriedly left the barn and made his way to the high road.\n\u003c/div\u003e \n\u003cdiv\u003e\n 151\n\u003c/div\u003e \n\u003cdiv\u003e\n He went to his boarding-place, made his small possessions in the way of clothing into a bundle, and regarded it with satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To-night I will leave Crampton forever,\" he said. \"After all, I shall be in fair luck, even if I did get kicked out from the circus.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n There was one thing, however, that he did not take into the account. He had acted as a spy upon the unsuspecting farmer, and so became the possessor of a valuable secret. It didn\u0027t occur to him that possibly he in turn might have attracted observation, and that his movements might have been watched.\n\u003c/div\u003e \n\u003cdiv\u003e\n It chanced that Charlie Davis was strolling out alone, and had seen Carden enter Mr. Tarbox\u0027s field and make his way to the barn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What can Carden be going there for?\" thought Charlie. \"I\u0027ll watch him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Charlie had also seen Mr. Tarbox, and he was not slow in concluding that Carden, for some reason which he could not at once guess, was watching him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What in the world can Carden be looking at?\" he thought. \"There can\u0027t be anything to steal in that old barn. At any rate he\u0027s up to some mischief,152 I\u0027ll bet a hat. I\u0027ll tell—let me see—I\u0027ll tell Anak, and ask what he thinks about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n It was 6 o\u0027clock when Charlie returned to the circus tent, and he broached the subject at once to the Norwegian giant.\n\u003c/div\u003e \n\u003cdiv\u003e\n Anak was a shrewd fellow, and he guessed the truth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s something valuable there on which Carden has some designs, but he isn\u0027t likely to do anything till late to-night. Meet me after the performance, and we\u0027ll take a stroll over that way.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3014/83306.html","bookId":277,"creation":"Aug 1, 2019 8:32:32 AM","modification":"Aug 1, 2019 8:32:32 AM"}
