{"id":8436,"no":24,"title":"CHAPTER XXIII. WHAT THE LETTER CONTAINED.","content":"\u0026nbsp;THE letter, which was directed in a bold hand to Robert Rudd, care of Dr. Grey, ran thus: \n\u003cdiv\u003e\n \"Robert Rudd: I understand that you have left the circus on account of the accident you met with recently, and I presume that you have not yet found anything else to do. I chanced to be at Crampton and saw you perform, and was favorably impressed by your appearance. I am about to make a journey to the West, and need the services of a boy or young man to assist me in writing and serve me in other ways, and I feel disposed to employ you, if you would like to accept the engagement. I cannot offer you as high pay as you probably received at the circus, but am ready to pay your travelling expenses and pay you five dollars per week.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Be kind enough to let me know at once whether you will accept my offer, or rather, if you are favorably disposed, come at once to New York and call upon me at the St. Nicholas Hotel. You189 will find me in room No. 35. I would suggest that the sooner you can come to me the better.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yours truly,??\n\u003c/div\u003e \n\u003cdiv\u003e\n \"John Fitzgerald.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Robert read this letter with mingled surprise and gratification. It was pleasant to think he would soon be employed and earning his own livelihood, and he could have thought of no engagement more likely to suit him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is your letter about, Robert?\" asked Sidney.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Read it for yourself, Sidney,\" said Robert, passing it to him. \"What do you think of it?\" he asked, later.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think it is a splendid chance. I wouldn\u0027t mind having such an offer myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I am in luck,\" said Robert, complacently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you mean to accept it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly; I should be very foolish if I did not. I have been wondering what I could get to do, and this comes just in the nick of time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am almost sorry the offer has come to you, Robert. I had been expecting you would stay with me a considerable time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 190\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should be sure to enjoy it if I was willing to be idle, but I have an independent spirit, and I prefer to earn my own living. I will come back and visit you some time if you will let me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let you! I shall quarrel with you if you don\u0027t. Perhaps, however, you would prefer to visit Ronald Percy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will wait at any rate till I receive an invitation,\" answered Robert, smiling, for he did not feel in the least sensitive about the malicious contempt which Ronald professed to feel for him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When will you start, Robert?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To-morrow morning. Mr. Fitzgerald seems to be in a hurry, and there is no good reason for delay. My foot is well enough for all ordinary use, though it would give out if I should attempt riding.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n When Dr. Grey was shown the letter Robert had received, he looked puzzled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly the chance seems to be a good one,\" he said, \"and doubtless it will be well to accept it. It is certainly a remarkable piece of luck.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I consider it,\" said Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I mean, that it is like the events in a story that you should have such a chance offer from an191 absolute stranger, just as you stand in need of it. I should like to see this Mr. Fitzgerald,\" he continued, thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I heard that there was a man of that name staying at the hotel about a week since,\" said Sidney.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He says he was present when Robert met with his accident.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then it is probably the same one. Then you have decided to accept, my boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir; I shall go to New York to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It may be as well. But one thing I want to say: if the engagement doesn\u0027t prove satisfactory, or you are ever again thrown upon your own resources, come back to us and you will have a cordial welcome.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Rob, you may be sure of that,\" said Sidney, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are both very kind to me,\" returned Robert, gratefully, \"and I will take you at your word. By the way, Dr. Grey, I want to ask you a favor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is granted as soon as asked, my boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is only to keep the two hundred dollars I have saved up for the present. It will be safer in192 your hands than mine, and I shan\u0027t need it, as all my expenses are to be paid by my new employer, and five dollars a week besides.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will keep it for you if you desire.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you; if I had it I might have it stolen from me, and besides it would make me uncomfortable to feel that I had so much money about me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see you are prudent. I have one good reason for keeping it, as you will one day come back and reclaim it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning Robert started for New York.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3014/83311.html","bookId":277,"creation":"Aug 1, 2019 8:32:47 AM","modification":"Aug 1, 2019 8:32:47 AM"}
