{"id":8446,"no":34,"title":"CHAPTER XXXI. HERCULES—THE STRONG MAN.","content":"\u0026nbsp;\"HERCULES!\" cried Robert, joyfully, from his perch in the tree. \n\u003cdiv\u003e\n Hercules paused and looked about in surprise, for he saw no one except an ill-looking tramp, who, he was sure, had not spoken to him. He thought he recognized the voice, but was not certain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who is it calls me?\" he asked. \"Where are you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Here, in this tree.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Hercules espied our hero and recognized him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Robert Rudd,\" he cried, in mingled surprise and joy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it is I.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are you doing here? I had no idea of seeing you here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nor I you; but I am glad you came along.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 248\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why are you up there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because the gentleman below insists upon my giving him my money, and I have a use for it myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ha!\" said Hercules, eying the besieging force narrowly. \"Well, he looks like a thief and a scoundrel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n Meantime, as may readily be imagined, the tramp had been busily scanning him. Now the appearance of Hercules was very deceptive. He was not a man of large, powerful frame—indeed he did not look as strong as the tramp; but his sinews were of iron and his muscles were immense, but these were concealed by his clothing. Only in the ring, when he performed his feats of strength, were they displayed to advantage. The tramp was not a classical scholar, or the name Hercules might have told him something. As it were he really thought himself the more powerful man of the two, and it came into his mind that he might as well enlarge his schemes of plunder and force this new acquaintance to pay tribute as well as the boy whom he was besieging.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You call me a thief and a scoundrel, do you?\" he said, flaming up in fierce wrath.\n\u003c/div\u003e \n\u003cdiv\u003e\n 249\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I do,\" returned Hercules, eying him coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How dare you do it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why shouldn\u0027t I?\" said Hercules, contemptuously. \"Didn\u0027t you mean to rob this boy if I hadn\u0027t come along?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will do it yet, but I have business with you first.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What kind of business?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Empty your pockets, and don\u0027t be long about it,\" said the tramp, approaching Hercules menacingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n It had never occurred to Robert that the tramp would attempt anything so absurd as to attack the professional champion, whose name was famous for strength, and when he saw that such was his intention he laughed aloud in amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t crow, young rooster!\" cried the tramp, angrily. \"I\u0027ll tackle your friend first; your turn will come by and by.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you want to have a tussle with me, do you?\" said Hercules, eying the other with a smile of amusement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I\u0027ll finish you up in short order,\" said the tramp, boastfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n 250\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be afraid, Hercules!\" cried Robert, with a laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll try not to. So you want me to hand over my money, do you?\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; and you\u0027d better be quick about it, too,\" growled the tramp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose I don\u0027t?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ll whip you till you can\u0027t stand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is better than any circus I ever attended,\" said Robert, delighted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027ll think it\u0027s a circus before he gets through,\" said Hercules, significantly. \"Well, my ill-looking friend, I must inform you in the outset that you are taking a good deal of trouble for a very little. My stock of money is very low.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t care; you can hand over what you\u0027ve got.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Or fight for it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" growled the tramp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I\u0027ll fight—a little friendly encounter. It\u0027s the custom to shake hands first; will you do it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The tramp extended his hand, which Hercules at once grasped with such an iron pressure that251 the tramp fairly danced and howled with pain, while the veins swelled upon his forehead.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let go!\" he yelled.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hercules released his hand with a laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s only a small lesson, my friend. Do you want my money now?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who are you?\" asked the tramp, with the addition of an oath.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am Hercules, the strong man. You made a mistake when you tackled me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m off, then,\" said the tramp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not quite yet. You need a further lesson.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n So saying, Hercules seized the tramp suddenly, raised him aloft, threw him up in the air, and then hurled him to the distance of a couple of rods, where he lay stunned for a minute or two.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now clear out!\" said Hercules sternly, as the rascal rose to his feet and limped off. \"I would give you in charge if it were not too much trouble. Never let me set eyes on you again!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t if I can help it,\" muttered the tramp as he slunk away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, Robert, come down from the tree, and tell me all about yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n 252\n\u003c/div\u003e \n\u003cdiv\u003e\n Robert told his story, and asked Hercules for similar information.\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve been to see a sister who lives near here,\" he said, \"and now am on my way back to North\u0027s circus, where I am engaged.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where are they?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At Athens.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How far off is that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only ten miles.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is there anything for me?\" asked Robert, eagerly. \"I want to work my way back to the East.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They\u0027ve got a rider—but I forgot, your doctor won\u0027t let you ride. If you don\u0027t mind selling at the lemonade stand, there\u0027ll be a chance. They\u0027ve sent off the boy that worked for them the first of the season. Young Ajax is with the circus, and others whom you know.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n The same night the two friends joined North\u0027s circus, and set out on a leisurely return to the East.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3014/83321.html","bookId":277,"creation":"Aug 1, 2019 8:33:17 AM","modification":"Aug 1, 2019 8:33:17 AM"}
