{"id":70936,"no":25,"title":"Page 25","content":"\u003cp\u003e“Yee haw,” Mona whooped. She rolled down the window to let her long, blond hair flutter behind her. Hanna lit a Parliament and swiveled the Sirius radio dial until she found a retro rap station playing “Baby Got Back.” She turned the volume up and the cabin throbbed—of course the car had the best bass money could buy.\u003c/p\u003e\n\u003cp\u003e“That’s more like it,” Mona said.\u003c/p\u003e\n\u003cp\u003e“Hells yeah,” Hanna answered.\u003c/p\u003e\n\u003cp\u003eAs she navigated a sharp turn a little too quickly, something in the back of her mind made a ping.\u003c/p\u003e\n\u003cp\u003eIt’s not gonna be you.\u003c/p\u003e\n\u003cp\u003eOuch.\u003c/p\u003e\n\u003cp\u003eEven Daddy doesn’t love you best!\u003c/p\u003e\n\u003cp\u003eDouble ouch.\u003c/p\u003e\n\u003cp\u003eWell, fuck it. Hanna pressed down on the gas and nearly took out someone’s dog-shaped mailbox.\u003c/p\u003e\n\u003cp\u003e“We’ve got to go somewhere and show this bitch off.” Mona put her Miu Miu heels up on the dashboard, smearing bits of grass and dirt on it. “How ’bout Wawa? I’m jonesing for some Tastykake.”\u003c/p\u003e\n\u003cp\u003eHanna giggled and took another swig of Ketel One. “You must be super-baked.”\u003c/p\u003e\n\u003cp\u003e“I’m not just baked, I’m broiled!”\u003c/p\u003e\n\u003cp\u003eThey parked crookedly in the Wawa lot and sang, “I like big BUTTS and I cannot lie!” as they stumbled into the store. A couple of grubby delivery guys, holding 64-ounce cups of coffee and leaning against their trucks, stared with their mouths open.\u003c/p\u003e\n\u003cp\u003e“Can I have your hat?” Mona asked the skinnier of the two, pointing to his mesh ball cap that said WAWA FARMS. Without a word, the guy gave it to her.\u003c/p\u003e\n\u003cp\u003e“Ew,” Hanna whispered. “That thing is germy!” But Mona had already put it on her head.\u003c/p\u003e\n\u003cp\u003eIn the store, Mona bought sixteen Tastykake Butterscotch Krimpets, a copy of Us Weekly, and a huge bottle of Tahitian Treat; Hanna bought a Tootsie Pop for ten cents. When Mona wasn’t looking, she shoved a Snickers and a pack of M\u0026amp;M’s into her purse.\u003c/p\u003e\n\u003cp\u003e“I can hear the car,” Mona said dreamily as they paid. “It’s screaming.”\u003c/p\u003e\n\u003cp\u003eIt was true. In her drunken haze, Hanna had activated the alarm on the keychain. “Oops.” She giggled.\u003c/p\u003e\n\u003cp\u003eHooting with laughter, they ran back to the car and slid inside. They stopped at a red light, heads bobbing. The supermarket strip mall to their left was empty except for some loose shopping carts. The store’s neon signs glowed vacantly; even the Outback Steakhouse bar was dead.\u003c/p\u003e\n\u003cp\u003e“People in Rosewood are such losers.” Hanna gestured to the darkness.\u003c/p\u003e\n\u003cp\u003eThe highway was barren too, so Hanna let out a startled, “Eep!” when a car stealthily rolled up in the lane next to her. It was a silver, pointy-nosed Porsche with tinted windows and those creepy blue headlights.\u003c/p\u003e\n\u003cp\u003e“Check that out,” Mona said, Krimpet crumbs falling out of her mouth.\u003c/p\u003e\n\u003cp\u003eAs they stared, the car revved its engine.\u003c/p\u003e\n\u003cp\u003e“It wants to race,” Mona whispered.\u003c/p\u003e\n\u003cp\u003e“Bull,” Hanna answered. She couldn’t make out who was inside the car—only the red, glowing tip of a lit cigarette. An uneasy feeling washed over her.\u003c/p\u003e\n\u003cp\u003eThe car revved its engine again—impatiently, this time—and she could finally see a vague outline of the driver. He revved his engine again.\u003c/p\u003e\n\u003cp\u003eHanna raised an eyebrow at Mona, feeling drunk, hyped, and completely invincible.\u003c/p\u003e\n\u003cp\u003e“Do it,” Mona whispered, pulling down the brim of the Wawa milk hat.\u003c/p\u003e\n\u003cp\u003eHanna swallowed hard. The light turned green. As Hanna hit the gas, the car launched forward. The Porsche growled ahead of her.\u003c/p\u003e\n\u003cp\u003e“You pussy, don’t let him beat you!” Mona cried.\u003c/p\u003e\n\u003cp\u003eHanna stepped down on the gas pedal and the engine roared. She pulled alongside the Porsche. They were doing 80, then 90, then 100. Driving this fast felt better than stealing.\u003c/p\u003e\n\u003cp\u003e“Kick his ass!” Mona screamed.\u003c/p\u003e\n\u003cp\u003eHeart pounding, Hanna pressed the pedal to the floor. She could hardly hear what Mona was saying over the engine noise. As they rounded a turn, a deer stepped into their lane. It came out of nowhere.\u003c/p\u003e\n\u003cp\u003e“Shit!” Hanna screamed. The deer stood dumbly still. She gripped the wheel tightly, hit the brakes, and swerved right, and the deer jumped out of the way. Quickly, she wrenched the wheel to straighten it out, but the car began to skid. The tires caught on a patch of gravel on the side of the road, and suddenly, they were spinning.\u003c/p\u003e\n\u003cp\u003eThe car spun around and around, and then they hit something. All at once, there was a crunch, splintering glass and…darkness.\u003c/p\u003e\n\u003cp\u003eA split second later, the only sound in the car was a vigorous hissing noise from under the hood.\u003c/p\u003e\n\u003cp\u003eSlowly, Hanna felt her face. It was okay; nothing had hit it. And her legs could move. She pushed herself up through a bunch of folded, puffy fabric—the airbag. She checked on Mona. Her long legs kicked wildly from behind her airbag.\u003c/p\u003e\n\u003cp\u003eHanna wiped tears from the corners of her eyes. “You okay?”\u003c/p\u003e\n\u003cp\u003e“Get this thing off me!”\u003c/p\u003e\n\u003cp\u003eHanna got out of the car and then pulled Mona out. They stood on the side of the highway, breathing hard. Across the street were the SEPTA tracks and the dark Rosewood station. They could see far up the highway: There was no sign of the Porsche—or the deer that they’d missed. Ahead of them, the stoplights swung, turning from yellow to red.\u003c/p\u003e\n\u003cp\u003e“That was something,” Mona said, her voice quivering.\u003c/p\u003e\n\u003cp\u003eHanna nodded. “You sure you’re all right?” She looked at the car.\u003c/p\u003e\n\u003cp\u003eThe whole front end had crumpled into a telephone pole. The bumper hung off the car, touching the ground. One of the headlights had twisted around to a crooked angle; the other flashed crazily. Stinky steam poured out of the hood.\u003c/p\u003e\n\u003cp\u003e“You don’t think it’s gonna blow up, do you?” Mona asked.\u003c/p\u003e\n\u003cp\u003eHanna giggled. This shouldn’t have been funny, but it was. “What should we do?”\u003c/p\u003e\n\u003cp\u003e“We should bolt,” Mona said. “We can walk home from here.”\u003c/p\u003e\n\u003cp\u003eHanna swallowed more giggles. “Oh my God. Sean’s gonna shit!”\u003c/p\u003e\n\u003cp\u003eThen both girls started to laugh. Hiccupping, Hanna turned around on the empty road and spread her arms out. There was something empowering about standing in the middle of an empty four-lane highway. She felt like she owned Rosewood. She also felt like she was spinning, but maybe that was because she was still wasted. She tossed the key ring next to the car. It hit the pavement hard, and the alarm started wailing again.\u003c/p\u003e\n\u003cp\u003eHanna quickly bent down and hit the deactivate button. The alarm stopped. “Does it have to be so loud?” she complained.\u003c/p\u003e\n\u003cp\u003e“Totally.” Mona put her sunglasses back on. “Sean’s dad should really get that fixed.”\u003c/p\u003e\n\u003cp\u003e26\u003c/p\u003e\n\u003cp\u003eDO U LOVE ME? Y OR N?\u003c/p\u003e\n\u003cp\u003eThe grandfather clock in the hall rang at 9 A.M. on Saturday morning as Emily padded quietly down the stairs to the kitchen. She never got up this early on the weekends, but this morning, she couldn’t sleep.\u003c/p\u003e\n\u003cp\u003eSomeone had made coffee, and there were sticky buns sitting out on a chicken-print plate on the table. It looked as if her parents had gone out for their never-fail, rain-or-shine Saturday crack-of-dawn walk. If they did their two loops around the neighborhood, Emily could get out of here without anybody noticing.\u003c/p\u003e\n\u003cp\u003eLast night, after Ben caught her and Maya in the photo booth, Emily had bolted from the party—without saying good-bye to Maya. Emily had called Carolyn—who was at Applebee’s—and asked for a ride, pronto. Carolyn and Topher, her boyfriend, came, no questions asked, although her sister gave Emily—who stank of whiskey—a stern, parental look when she climbed in the backseat. At home, she’d hidden under her covers so she wouldn’t have to talk to Carolyn and dropped off into a deep sleep. But this morning, she felt worse than ever.\u003c/p\u003e\n\u003cp\u003eShe didn’t know what to think about what happened at the party. It was all a blur. She wanted to believe that kissing Maya had been a mistake, and that she could explain everything to Ben and it would be okay. But Emily kept returning to how everything felt. It was like…before last night, she’d never been kissed before.\u003c/p\u003e\n\u003cp\u003eBut there was nothing, nothing about Emily that said lesbian. She bought girly hot-oil treatments for her chlorine-damaged hair. She had a poster of the hot Australian swimmer Ian Thorpe on her wall. She giggled with the other swimmer girls about the boys in their Speedos. She’d only kissed one other girl, years ago, and that didn’t count. Even if it did, it didn’t mean anything, right?\u003c/p\u003e\n\u003cp\u003eShe broke a Danish in half and stuffed a piece in her mouth. Her head throbbed. She wanted things to go back to the way they were. To throw a fresh towel in her duffel and head to practice, to happily make goofy pig faces into someone’s digital camera on the away-meet bus. To be content with herself and her life and to not be an emotional yo-yo.\u003c/p\u003e\n\u003cp\u003eSo that was it. Maya was awesome and all, but they were just confused—and sad, for their own reasons. But not gay. Right?\u003c/p\u003e\n\u003cp\u003eShe needed some air.\u003c/p\u003e\n\u003cp\u003eIt was desolate outside. The birds were chirping noisily, and someone’s dog kept barking, but everything was still. Freshly delivered papers were still waiting on front lawns, wrapped in blue plastic.\u003c/p\u003e\n\u003cp\u003eHer old, red Trek mountain bike was propped up against the side of the toolshed. Emily jerked it upright, hoping she’d be coordinated enough to handle a bike after last night’s whiskey. She pushed off to the street, but her bike’s front wheel made a flapping noise.\u003c/p\u003e\n\u003cp\u003eEmily bent down. There was something caught in the wheel. A piece of notebook paper was woven through the spokes. She pulled it out and read a few lines. Wait. This was her own handwriting.\u003c/p\u003e\n\u003cp\u003e…I love staring at the back of your head in class, I love how you chew gum whenever we’re talking on the phone together, and I love that when you jiggle your Skechers during class when Mrs. Hat starts talking about famous American court cases, I know you’re totally bored.\u003c/p\u003e\n\u003cp\u003eEmily’s eyes darted around her empty front yard. Was this what she thought it was? She nervously skimmed down to the bottom, her mouth dry.\u003c/p\u003e\n\u003cp\u003e…and I’ve done a lot of thinking about why I kissed you the other day. I realized: It wasn’t a joke, Ali. I think I love you. I can understand if you never want to speak to me again, but I just had to tell you.—Em\u003c/p\u003e\n\u003cp\u003eThere was something else written on the other side of the paper. She flipped it over.\u003c/p\u003e\n\u003cp\u003eThought you might want this back.\u003c/p\u003e\n\u003cp\u003eLove, A\u003c/p\u003e\n\u003cp\u003eEmily let her bike clatter to the ground.\u003c/p\u003e\n\u003cp\u003eThis was the letter to Ali, the very one Emily had sent right after the kiss. The one she’d wondered if Ali had ever gotten.\u003c/p\u003e\n\u003cp\u003eCalm down, Emily told herself, realizing her hands were trembling. There’s a logical explanation for this.\u003c/p\u003e\n\u003cp\u003eIt had to be Maya. She lived in Ali’s old room. Emily had told Maya about Alison and the letter last night. Maybe she was just giving it back?\u003c/p\u003e\n\u003cp\u003eBut then…Love, A. Maya wouldn’t write that.\u003c/p\u003e\n\u003cp\u003eEmily didn’t know what to do or who to talk to. Suddenly, she thought of Aria. So much had happened last night after Emily ran into her, she’d forgotten their conversation. What had all Aria’s bizarre Alison questions been about? And there was something about her expression last night. Aria seemed…nervous.\u003c/p\u003e\n\u003cp\u003eEmily sat on the ground and looked at the “Thought you might want this back” message again. If Emily recalled correctly, Aria had spiky handwriting that looked a lot like this.\u003c/p\u003e\n\u003cp\u003eIn the last days before Ali had gone missing, she’d held the kiss over Emily’s head, forcing Emily to go along with whatever she wanted to do. It hadn’t occurred to Emily that maybe Ali had told the rest of their friends. But maybe… \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-little-liars-pretty-little-liars-1/page-25.html","bookId":2378,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
