{"id":70943,"no":32,"title":"Page 32","content":"\u003cp\u003eEveryone from Rosewood Day hung out at the back of the church, from the lacrosse boys to the video game–obsessed geeks who Ali no doubt would have teased back in seventh. Old Mr. Yew—the one in charge of the Rosewood Day charity drive—stood in the corner, talking quietly to Mr. Kaplan, who taught art. Even Ali’s older JV field hockey friends had returned from their respective colleges; they stood in a teary huddle near the door. Spencer scanned the familiar faces, remembering all the people she used to know and didn’t anymore. And then, she saw a dog—a seeing-eye dog.\u003c/p\u003e\n\u003cp\u003eOh my God.\u003c/p\u003e\n\u003cp\u003eSpencer grabbed Aria’s arm. “By the exit,” she hissed.\u003c/p\u003e\n\u003cp\u003eAria squinted. “Is that…?”\u003c/p\u003e\n\u003cp\u003e“Jenna,” Hanna murmured.\u003c/p\u003e\n\u003cp\u003e“And Toby,” Spencer added.\u003c/p\u003e\n\u003cp\u003eEmily turned pale. “What are they doing here?”\u003c/p\u003e\n\u003cp\u003eSpencer was too stunned to answer. They looked the same but totally different. His hair was long now, and she was…gorgeous, with long black hair and wearing big Gucci sunglasses.\u003c/p\u003e\n\u003cp\u003eToby, Jenna’s brother, caught Spencer staring. A sour, disgusted look settled over his face. Spencer quickly jerked her eyes away.\u003c/p\u003e\n\u003cp\u003e“I can’t believe he showed up,” she whispered, too quietly for the others to hear.\u003c/p\u003e\n\u003cp\u003eBy the time the girls reached the heavy wooden doors that led to the church’s crumbling stone steps, Toby and Jenna were gone. Spencer squinted in the sunlight of the brilliant, perfectly blue sky. It was one of those lovely early-fall days with no humidity, where you were dying to skip school, lie in a field, and not think about your responsibilities. Why was it always on days like this that something horrible happened?\u003c/p\u003e\n\u003cp\u003eSomeone touched her shoulder and Spencer jumped. It was a blond burly cop. She motioned for Hanna, Aria, and Emily to go on without her.\u003c/p\u003e\n\u003cp\u003e“Are you Spencer Hastings?” he asked.\u003c/p\u003e\n\u003cp\u003eShe nodded dumbly.\u003c/p\u003e\n\u003cp\u003eThe cop wrung his enormous hands together. “I’m very sorry for your loss,” he said. “You were good friends with Ms. DiLaurentis, right?”\u003c/p\u003e\n\u003cp\u003e“Thanks. Yeah, I was.”\u003c/p\u003e\n\u003cp\u003e“I’m going to need to talk with you.” The cop reached into his pocket. “Here’s my card. We’re reopening the case. Since you were friends, you might be able to help us. Is it okay if I come by in a couple of days?”\u003c/p\u003e\n\u003cp\u003e“Um, sure,” Spencer stammered. “Whatever I can do.”\u003c/p\u003e\n\u003cp\u003eZombielike, she caught up with her old friends, who’d gathered under a weeping willow. “What did he want?” Aria asked.\u003c/p\u003e\n\u003cp\u003e“They want to talk to me, too,” Emily said quickly. “It’s not a big deal though, is it?”\u003c/p\u003e\n\u003cp\u003e“I’m sure it’s the same old stuff,” Hanna said.\u003c/p\u003e\n\u003cp\u003e“He couldn’t be wondering about…,” Aria started. She looked nervously to the church’s front door, where Toby, Jenna, and her dog had stood.\u003c/p\u003e\n\u003cp\u003e“No,” Emily said quickly. “We couldn’t get in trouble for that now, could we?”\u003c/p\u003e\n\u003cp\u003eThey all glanced at each other worriedly.\u003c/p\u003e\n\u003cp\u003e“Of course not,” Hanna finally said.\u003c/p\u003e\n\u003cp\u003eSpencer looked around at everyone talking quietly on the lawn. She felt sick after seeing Toby, and she hadn’t seen Jenna since the accident. But it was a coincidence that the cop had spoken to her right after she’d seen them, right? Spencer quickly pulled out her emergency cigarettes and lit up. She needed something to do with her hands.\u003c/p\u003e\n\u003cp\u003eI’ll tell everyone about The Jenna Thing.\u003c/p\u003e\n\u003cp\u003eYou’re just as guilty as I am.\u003c/p\u003e\n\u003cp\u003eBut no one saw me.\u003c/p\u003e\n\u003cp\u003eSpencer nervously exhaled and scanned the crowd. There wasn’t any proof. End of story. Unless…\u003c/p\u003e\n\u003cp\u003e“This has been the worst week of my life,” Aria said suddenly.\u003c/p\u003e\n\u003cp\u003e“Mine too.” Hanna nodded.\u003c/p\u003e\n\u003cp\u003e“I guess we can look on the bright side,” Emily said, her voice high-pitched and jittery. “It can’t get any worse than this.”\u003c/p\u003e\n\u003cp\u003eAs they followed the procession out to the gravel parking lot, Spencer stopped. Her old friends stopped too. Spencer wanted to say something to them—not about Ali or A or Jenna or Toby or the police, but instead, more than anything, she wanted to tell them that she’d missed them all these years.\u003c/p\u003e\n\u003cp\u003eBut before she could say it, Aria’s phone rang.\u003c/p\u003e\n\u003cp\u003e“Hang on…,” Aria muttered, rooting around in her bag for her phone. “It’s probably my mom again.”\u003c/p\u003e\n\u003cp\u003eThen, Spencer’s Sidekick vibrated. And rang. And chirped. It wasn’t just her phone, but her friends’ phones too. The sudden, high-pitched noises sounded even louder against the sober, silent funeral procession. The other mourners shot them dirty looks. Aria held hers up to silence it; Emily struggled to operate her Nokia. Spencer wrenched her phone out of her clutch’s pocket.\u003c/p\u003e\n\u003cp\u003eHanna read her screen. “I have one new message.”\u003c/p\u003e\n\u003cp\u003e“I do too,” Aria whispered.\u003c/p\u003e\n\u003cp\u003e“Same,” Emily echoed.\u003c/p\u003e\n\u003cp\u003eSpencer saw she did, too. Everyone hit READ. A moment of stunned silence passed.\u003c/p\u003e\n\u003cp\u003e“Oh my God,” Aria whispered.\u003c/p\u003e\n\u003cp\u003e“It’s from…,” Hanna squeaked.\u003c/p\u003e\n\u003cp\u003eAria murmured, “Do you think she means…”\u003c/p\u003e\n\u003cp\u003eSpencer swallowed hard. In tandem, the girls read their texts out loud. Each said the exact same thing:\u003c/p\u003e\n\u003cp\u003eI’m still here, bitches. And I know everything. —A \u003c/p\u003e","sourceLink":"https://allnovel.net/pretty-little-liars-pretty-little-liars-1/page-32.html","bookId":2378,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
