{"id":87403,"no":16,"title":"Page 16","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI drank back the wine and watched him, \"You don’t look the way I imagined you would,\" I said softly.\u003c/p\u003e\n\u003cp\u003eHe gave me a funny look, \"What do you remember about me?\"\u003c/p\u003e\n\u003cp\u003eI shook my head to stop from panicking, it was a tactic I had used before, \"I meant as a man who orders people to kill others and does bad things.\" The wine was getting to me.\u003c/p\u003e\n\u003cp\u003eHe studied my face as I answered. Seeming satisfied, he nonchalantly spoke, \"How did you think someone like me would look?\"\u003c/p\u003e\n\u003cp\u003e\"Like the fat man in the white suit, or Bin Laden, or Rush Limbaugh.\"\u003c/p\u003e\n\u003cp\u003eHe grimaced, \"The white suit went out with the mullet and Bin Laden wore his beard far too long. If I do a beard it\u0027s always groomed and stylish.\"\u003c/p\u003e\n\u003cp\u003eI shook my head, \"I have never seen you with a beard. You were so baby-faced as a boy.\"\u003c/p\u003e\n\u003cp\u003eHe was up and out of the chair far faster than I would have imagined him able to move. He undid my seatbelt and dragged me to the back of the plane. He opened a door and dragged me in, slamming the door shut, \"What do you remember of me from before?\"\u003c/p\u003e\n\u003cp\u003eI stuttered, \"I-I-I re-re-remember you from be-be-before, as a k-k-kid. M-m-maybe twenty-five.\"\u003c/p\u003e\n\u003cp\u003eHe looked into my eyes with scrutinizing severity. He towered over me. I didn’t dare look around the small space. I stayed with him, let him lock my gaze.\u003c/p\u003e\n\u003cp\u003e\"You remember me from before?\" he sounded confused.\u003c/p\u003e\n\u003cp\u003e\"When I worked—before the kids, I followed you for a time. They always knew you would outgrow your arms dealing, when you took over the company from your father. I knew who you were when we met. I had watched you for a couple years.\" He was killing my wine buzz.\u003c/p\u003e\n\u003cp\u003eHe licked his lips and lessened his vice-grip hold on me. My skin burned where he touched it. He looked at the welt on my wrist as he let go. He took a deep breath and chuckled. His face was a mixture of relief and confusion. I was a mess. I trembled and tried to back up, but I was against the counter in the bathroom. Why had he pulled me down there? Why had he not roughed me up in front of Steve?\u003c/p\u003e\n\u003cp\u003e\"What did I say about lying to me?\" he asked softly.\u003c/p\u003e\n\u003cp\u003eMy stomach dropped, “I swear—I never lied. You never asked if I remembered you.”\u003c/p\u003e\n\u003cp\u003eHis hands trailed up my back, pulling me into him. He cradled me against him. I didn’t know what to make of it. He was insane, that much was clear.\u003c/p\u003e\n\u003cp\u003eHe released me and reached for the door, but the jet took off. He was thrown against the wall behind him, with me pressed into his chest.\u003c/p\u003e\n\u003cp\u003eHe smirked at the helpless state of me. His hands roamed my back, eventually cupping my ass and lifting me up into his lips. I pressed on his chest, fighting the whole way but he won out, with the plane pushing me into him and the considerable difference in our strength.\u003c/p\u003e\n\u003cp\u003eHis mouth owned mine. His hands lifted my skirt, grabbing handfuls of ass cheek, as his tongue slid into my mouth. I felt him harden against my belly. He ground himself against me, rubbing me into him.\u003c/p\u003e\n\u003cp\u003eHe swung us around and sat on the toilet. My legs draped over his lap, as his mouth roamed my neck. He kissed and sucked, nibbling at my tender skin. His huge hands rotated my pelvis against his, forcing a lap dance out of me.\u003c/p\u003e\n\u003cp\u003eHis soft lips nipped at my shoulder as he dragged my blouse to the side.\u003c/p\u003e\n\u003cp\u003eI shook my head, \"I can\u0027t do this.\"\u003c/p\u003e\n\u003cp\u003eHe looked up from the buttons on my blouse and shook his head, \"I didn’t ask you for your opinion. I told you I own everything, Evie. Right now that includes your pussy.\"\u003c/p\u003e\n\u003cp\u003eI gasped as a feverish heat claimed my entire face. He sucked the air from me with his kiss. It was passionate and demanding.\u003c/p\u003e\n\u003cp\u003eHe stood up with me in his arms, and placed me on the counter, with the pressure of the plane pushing him into me. He dropped to his knees and lifted my skirt. He pulled my panties to the side and licked hard. I cried out, gripping his head. He pulled at my clit in short, fast sucks and then licked the length of me, sticking his tongue inside.\u003c/p\u003e\n\u003cp\u003eI bucked forward but he held me in place. He started the sucking spurts again and I lost the battle. I let go of his head and leaned back into the wall. I let him lick and tongue-fuck me. Every inch of me was on fire, when I felt his finger at the entrance of my pussy. I cried out a second time as he thrust his thick finger inside. I was well lubed from the near orgasmic state I was in. His finger moved with his tongue flicks, sending me over the edge. My body clenched down on him, just as he slid a second finger in. He pumped me with his fingers bringing me to climax.\u003c/p\u003e\n\u003cp\u003eI made a sound I\u0027d never heard leave my lips, as even my ass clenched. I felt it in my toes, but before I could even finish it, he was standing between my thighs and sliding his cock head up and down the length of me. He pushed inside, finishing my orgasm with his cock pumping hard.\u003c/p\u003e\n\u003cp\u003eHe leaned over me; he was all consuming, as he growled down onto me, \"Tell me who owns your pussy, Evie.\"\u003c/p\u003e\n\u003cp\u003eI was flabbergasted and dizzy. He ripped open my shirt and tore off my bra. He grabbed behind me, arching my back and flicked his tongue across my nipple, before wrapping his lips around it and sucking hard.\u003c/p\u003e\n\u003cp\u003eThe strange sound escaped my lips again. He pulled me down and bucked harder. I placed my feet on the wall behind him, so he could get deeper. His balls slapped against me, spanking my ass.\u003c/p\u003e\n\u003cp\u003e\"Do I own your pussy?\"\u003c/p\u003e\n\u003cp\u003eI nodded, catching a glimpse of his devilish smile through his lashes, as he looked up from my breast.\u003c/p\u003e\n\u003cp\u003e\"Do I own you?\"\u003c/p\u003e\n\u003cp\u003eI nodded again, \"You own me.\"\u003c/p\u003e\n\u003cp\u003eHe gripped my hips, jerking me into the wall again. I felt something I had never felt before, a second orgasm. I dug my hands into his hair and dragged his face up to mine. Hungrily, I sucked his lips into mine. I could taste myself on his lips. He kept his pace, feeling my body tightening.\u003c/p\u003e\n\u003cp\u003e\"You want that orgasm?\" he broke our kiss and murmured in my ear, as he nipped at my lobe.\u003c/p\u003e\n\u003cp\u003eI nodded my sweaty face against his.\u003c/p\u003e\n\u003cp\u003e\"What do you say?\"\u003c/p\u003e\n\u003cp\u003e\"P-p-please,\" I panted.\u003c/p\u003e\n\u003cp\u003eHe gathered me up in his arms and spun me again. My back slammed against the wall. I wrapped my legs around him, gripping his huge shoulders. His hands dug into my ass. He fucked me against the wall, harder than I had ever been.\u003c/p\u003e\n\u003cp\u003eHe bounced me on his cock, spreading his legs to make a plateau for me to rest against. I clawed at his skin, trying desperately to keep at the angle I was at. I came, biting down on his shoulder. He grunted and moaned into my nape. I felt him pulsate and fill me. He jerked his orgasm into the wall and me. His legs twitched. \"God damned,\" he whispered.\u003c/p\u003e\n\u003cp\u003eI nodded, \"I think God had a hand in that.\"\u003c/p\u003e\n\u003cp\u003eHe laughed, but I was serious. There was no way, one man could make me feel like that. Nothing on the planet, had ever made me feel like that. It was a release like I had never had.\u003c/p\u003e\n\u003cp\u003eIt was better than crying and letting my steam off. I might never cry again, if he could keep that up. I slapped myself mentally, and reminded my filthy brain that I had just let a criminal screw me. I started to giggle when he kissed me softly and helped me stand on my own, pulling his cock from me.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s funny?\"\u003c/p\u003e\n\u003cp\u003eI shook my head and looked down at my underwear on the floor, torn off. I didn’t even recall that moment.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"We just joined the mile-high club.\" I felt the blush, still on my face, redden. Inside however, I was freaking out and screaming.\u003c/p\u003e\n\u003cp\u003eWhat had I just done?\u003c/p\u003e\n\u003cp\u003eHe brushed off my mile-high comment, \"Oh that.\"\u003c/p\u003e\n\u003cp\u003eI bit my lip and knew he had joined the club, long before I ever came along. He was probably the chair of the arms-dealer sector. I tried to straighten my clothes, but I noticed the rip in my skirt and lack of buttons on my blouse. I grabbed the destroyed ends of my very expensive, lace bra and gave him a hostile look. He did his pants up and left the bathroom. He returned seconds later, passing a robe through. \"Just come eat in the robe.\" He closed the door again.\u003c/p\u003e\n\u003cp\u003eI scowled, \"I\u0027m not eating dinner in a robe,\" I shouted through the door but he was gone. I picked up my clothes and started to clean up.\u003c/p\u003e\n\u003cp\u003eLooking into the mirror, I could swear I didn’t know the girl looking back at me. If I looked too hard I would see me, and then I would have to let in some of the shame I was repressing for having fun, while my kids and mother were on the run.\u003c/p\u003e\n\u003cp\u003eChapter Seven - New you means new shoes\u003c/p\u003e\n\u003cp\u003e\"I wish we could put you in something classic. You would make a beautiful widow.”\u003c/p\u003e\n\u003cp\u003eI frowned, “He told you my husband was dead?”\u003c/p\u003e\n\u003cp\u003eShe shook her head, “I overheard him talking about it. Anyway, this is going to look amazing on you.\"\u003c/p\u003e\n\u003cp\u003eShe passed me a charcoal leather mini skirt and I felt like Julia Roberts in Pretty Woman, only the movie was going backwards.\u003c/p\u003e\n\u003cp\u003eI looked at the label and coughed, \"Silvia Eisele? Is this for real? It must have cost a thousand dollars for this skirt?\"\u003c/p\u003e\n\u003cp\u003eShe smirked, \"I know, right. He always has the nicest shit.\"\u003c/p\u003e\n\u003cp\u003eI scowled, \"Does he bring a lot of women on board?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head, \"No,\" her eyes were wide, \"I think you\u0027re the first. He doesn\u0027t bring anyone but Steve—well and me. I live on this damned thing, I swear. Well, and the yacht too. That’s where the ladies come and then they cum. You should hear the dirty shit that’s said in those hallowed halls.” She winked at me. Was she oblivious to the fact, he had just shredded my clothing off in the restroom? Did she think I went in there like Superwoman, but realized after, I had shredded my clothes that my costume was at home?\u003c/p\u003e\n\u003cp\u003eShe did up a zipper and nattered on, “The women\u0027s clothes are for me. We stop everywhere, so I have clothes for my off time.\"\u003c/p\u003e\n\u003cp\u003eI laughed, \"Rough.\"\u003c/p\u003e\n\u003cp\u003eShe gave me a serious look, \"I am probably going to get cancer from this bloody plane. You know how much radiation flight attendants are exposed to?\"\u003c/p\u003e\n\u003cp\u003eI flinched, \"No.\"\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes, \"A lot.\"\u003c/p\u003e\n\u003cp\u003eI looked around the back room for a shower, \"There isn’t a shower in here is there?\" I wanted him off my skin. I wanted him out of me.\u003c/p\u003e\n\u003cp\u003eShe laughed, \"This isn’t an RV.\"\u003c/p\u003e\n\u003cp\u003eI sighed, \"I smell.\"\u003c/p\u003e\n\u003cp\u003eShe laughed and pointed to the clothes set out, \"Just dress. He wants us back out there in like a minute.\" Her bright, glossy eyes narrowed, \"We don’t make him angry, ever.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-end-of-me-the-single-lady-spy-1/page-16.html","bookId":2264,"creation":"Oct 5, 2019 5:22:02 PM","modification":"Oct 5, 2019 5:22:02 PM"}
