{"id":87414,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe slammed a hand down on the hard counter, “Of course they know about it! They made the fucking thing! They hid them! They made a unanimous decision and saved the world from ending, at the hands of idiotic idealists.”\u003c/p\u003e\n\u003cp\u003eI glanced at Jack, “Guess you were right.”\u003c/p\u003e\n\u003cp\u003eHe nodded, “Yay.”\u003c/p\u003e\n\u003cp\u003eFitz closed his eyes and pinched his brow with his juice-covered hand, “We need to run now. They know you’ll come here.”\u003c/p\u003e\n\u003cp\u003eI frowned, “You’re dead.”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “Not where the Burrow is concerned.”\u003c/p\u003e\n\u003cp\u003eMy guts started to burn, “You said you knew James was going to find something out or be onto something. What the hell did you think we were here for?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “I thought you found out about your mom.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe looked at me, “She’s one of us. Always has been. Close your damned mouths; you look like idiots. She was like the Mata Hari of our time. Magnificent spy.”\u003c/p\u003e\n\u003cp\u003eI couldn’t feel my legs and arms, “I don’t understand.”\u003c/p\u003e\n\u003cp\u003eHe grinned, “She’s retired. She used to be one of the head spies for MI6.”\u003c/p\u003e\n\u003cp\u003eBetrayal and sickness rolled around inside of me, “She’s English?”\u003c/p\u003e\n\u003cp\u003e“German and English. Her mother—your grandmother, was born in a concentration camp. Your great-grandparents both died there and your great aunt fled to England with your grandmother. She met an Englishman and married him and gave birth to your mother. It was obvious early on, your mother was far more intelligent than the boys in school. MI6 hired her in the sixties at eighteen. She climbed ranks faster than the men. She was the first female to reach those sorts of ranks. Brilliant, bloody deadly too. She can kill with her pinky finger.” He spoke with such pride in his voice, but I nearly gagged.\u003c/p\u003e\n\u003cp\u003e“She has my kids!” I blurted.\u003c/p\u003e\n\u003cp\u003eHe nodded, “Then they have never been safer.”\u003c/p\u003e\n\u003cp\u003eI closed my eyes and tried to see it all. I shook my head, “None of it makes sense. She never left the house. She was always there. He was gone on mission, but she was there. She was baking and sewing and making ornaments. She let the lawyer into James’ office, she let me go to the hotels, and she let the bad men get to James and me. How had it all happened before her eyes? She would have known if she was a spy, even a shitty one, much less, a brilliant one.”\u003c/p\u003e\n\u003cp\u003eHe sighed, “Then she did it for a reason. She has to be aware of what’s happening.”\u003c/p\u003e\n\u003cp\u003eI opened my eyes, “What kind of fucking operation is this?”\u003c/p\u003e\n\u003cp\u003eI could see sadness in Fitz’s eyes, “She stopped when you were born. You and Sissy were everything to her. She wasn’t supposed to be able to get pregnant. You were both a miracle. A set of twin girls for a lady who couldn’t have a single baby. As you aged, she slowly got back into it. Small missions, tiny jobs, little things she could do while you were in school.”\u003c/p\u003e\n\u003cp\u003eI shook my head, “Impossible.”\u003c/p\u003e\n\u003cp\u003eHe laughed, “Not for her. She was one of a kind. She could take you to the park, assassinate someone, and not even bat an eyelash, or have a hair out of place. She was a machine.”\u003c/p\u003e\n\u003cp\u003e“What does that even mean? Did she do that?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “Of course not. She never endangered you. She became a regular American mother. She doted on your father, but always maintained the aid to her country.”\u003c/p\u003e\n\u003cp\u003eI ran my fingers through my hair and tried not to notice the grease, “What is the Burrow?” I didn’t want to know anything else. I didn’t have room for it.\u003c/p\u003e\n\u003cp\u003eI looked up to see Fitz shaking his head, “Something dangerous. Something that once you know about it, you can never come back from knowing. You leave the service the way I did.” He looked sickened, “The way your father did.”\u003c/p\u003e\n\u003cp\u003eTears flooded my eyes.\u003c/p\u003e\n\u003cp\u003eHe was alive.\u003c/p\u003e\n\u003cp\u003eHe was another person who had pretended to be dead and left me.\u003c/p\u003e\n\u003cp\u003eI got up and walked to the hallway, “I need to lay down.”\u003c/p\u003e\n\u003cp\u003eI walked to the spare room I had slept in before, and curled up in the sheets.\u003c/p\u003e\n\u003cp\u003eWhen I closed my eyes I saw it all. The obvious things that stuck out but seemed innocent with unknowing eyes. With jaded bitterness, I could see them for what they were.\u003c/p\u003e\n\u003cp\u003eThe door opened, just as I was about to jump up and scream at Fitz some more.\u003c/p\u003e\n\u003cp\u003eCoop poked his head in, “You okay?”\u003c/p\u003e\n\u003cp\u003eI shook my head, “Fuck no.”\u003c/p\u003e\n\u003cp\u003eHe laughed and closed the door. He laid on the bed on his back, “Feeling stupid?”\u003c/p\u003e\n\u003cp\u003eI punched him in the arm, hurting my hand.\u003c/p\u003e\n\u003cp\u003eHe snorted, “I’ll take that as a yes.” He turned, looking at me, “You hit like a girl.”\u003c/p\u003e\n\u003cp\u003eI closed my eyes, “How could they? How could they lie and cheat Sissy and me? How could the very same shit happen to my kids? Do you see the irony in this? It’s insane.”\u003c/p\u003e\n\u003cp\u003eCoop was looking at me still, when I opened my eyes, “Almost like it was planned,” he said.\u003c/p\u003e\n\u003cp\u003eI nodded, “I have no doubt, some of it was. Look at it all? It all fits so nicely when you stand back. Up close it’s a jumbled mess, but from a distance you can see everything. You can easily just slip the puzzle pieces together.”\u003c/p\u003e\n\u003cp\u003eHe grabbed my hand, “Your kids are safe. She isn’t going to hurt them. She isn’t going to let them get hurt.”\u003c/p\u003e\n\u003cp\u003eMy eyes watered, “Why didn’t she tell me the truth? Why didn’t she let me in?”\u003c/p\u003e\n\u003cp\u003eHe wiped a tear dripping down my cheek, “Did you tell your kids what you used to be?”\u003c/p\u003e\n\u003cp\u003eI scowled, “Of course not. They’re only little.”\u003c/p\u003e\n\u003cp\u003eHe shrugged, “Did you ever plan on telling them about you being a spy? Do you plan on telling them about James’ betrayal, or his still being alive, or what he really did for a living?”\u003c/p\u003e\n\u003cp\u003eI clenched my jaw.\u003c/p\u003e\n\u003cp\u003eHe nodded, “You don’t know why she never told you things, but you can see how easy it is to want to protect them.”\u003c/p\u003e\n\u003cp\u003eI shook my head, “I was CI though. Why didn’t she tell me then? Or when I was retired. We shared more things, than I ever knew.”\u003c/p\u003e\n\u003cp\u003e“I don’t know. You have to ask her.”\u003c/p\u003e\n\u003cp\u003eI narrowed my eyes, “How do I reach her?”\u003c/p\u003e\n\u003cp\u003eHe sighed, “No.”\u003c/p\u003e\n\u003cp\u003eI climbed off the bed and left the room.\u003c/p\u003e\n\u003cp\u003e“What is the Burrow?” I shouted down the hall.\u003c/p\u003e\n\u003cp\u003eFitz passed me a bowl of probably the most amazing-looking fruit salad I’d had ever seen. I sighed taking it and my seat.\u003c/p\u003e\n\u003cp\u003eHe sat with a bowl of fruit too, “Well, I guess since the story of how the Burrow was created is the same as the story of how your mom became a spy, I can just head off from where I was before in the story. The newly-formed spy operatives joined forces and saved the weapons from the Germans. We didn’t get them all, just the ones with the potential to destroy the world with their so-called brilliance.” He ate a bite and chewed, but he seemed lost in it all, “We took them somewhere no one would ever find them. An asylum where they would be safe. At first the presidents and leaders were aware the Burrow existed but they didn’t know where it was. Then the Korean War happened and they wanted the weapons. They wanted to win. The Master Key makes the call. He decides if the cause is worthy or not. He saw the request for aid from the Nations involved in the Korean War. He turned them down. It was then, that the first mission to try to find the Burrow was executed by our own governments. We had been brothers in arms and suddenly we were at war within our own ranks. The men working for the Burrow would die protecting it and the men working for the cause would die trying to find it.”\u003c/p\u003e\n\u003cp\u003eI looked at Coop standing in the hallway. I could see he was as in the dark as I was.\u003c/p\u003e\n\u003cp\u003eFitz spoke through the bite he was chewing, “Then came the Vietnam War. The CIA would stop at nothing to get those weapons. The Burrow had been moved in secret to protect it. It was no easy feat. Everyone was so angry when they couldn’t find it, and then eventually more weapons started to disappear. Anytime a new one was created, it was taken. The Burrow grew as technology developed. It wasn’t even during the Gulf War, Bosnia, Afghanistan and Iraq that we saw much threat against the Burrow. As technology grew, so did the Burrow’s capabilities. Since 9/11, we have had the hardest time keeping the Burrow a secret.” He sighed and ate another bite.\u003c/p\u003e\n\u003cp\u003eI took a bite and chewed, “What kind of weapons?”\u003c/p\u003e\n\u003cp\u003eCoop answered, “People.”\u003c/p\u003e\n\u003cp\u003eFitz looked back, “You are a sharp one.”\u003c/p\u003e\n\u003cp\u003eLuce gave me a look, “People?”\u003c/p\u003e\n\u003cp\u003eI shrugged.\u003c/p\u003e\n\u003cp\u003eJack inhaled sharply, “That actually makes sense.”\u003c/p\u003e\n\u003cp\u003eI shook my head, “What does?”\u003c/p\u003e\n\u003cp\u003eCoop crossed his arms and leaned against the wall, “They’re hiding the scientists and engineers, who pose a threat to society with their inventions and discoveries. Isn’t that right, Fitz?”\u003c/p\u003e\n\u003cp\u003eFitz nodded, “Yes, it is. You see, they always come from an innocent place. The intelligent mean well. The technology rarely has weaponry as the intention, but the governments, our own homeland security, CIA, MI6, and the UN always see it as potential. So we fake a death with a heart attack, or accident, or sometimes we just go with plain old missing persons. We take them and their work to the Burrow. We leave behind misinformation and lies. Nothing in this world is ever as it seems. You have to understand, everyone thinks the weapons will save them or give them the upper hand, but the council has to be able to see that winning won’t save us in the big picture. Pollution, destruction of country’s environments, destruction of land, deaths of innocents, upping the ante and winning, have to all be separated and looked at piece by piece.”\u003c/p\u003e\n\u003cp\u003eI had only one question, “Where is the Burrow?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “I don’t know. Only the Master Key knows that.”\u003c/p\u003e\n\u003cp\u003eCoop took his seat again, “Where is the Master Key?”\u003c/p\u003e\n\u003cp\u003eFitz shook his head, “I would die before I would reveal that. He or she must find you, if they wish to be found at all.”\u003c/p\u003e\n\u003cp\u003e“Was my father a Master Key?”\u003c/p\u003e\n\u003cp\u003eHis eyes lit up, “He was so proud of you.”\u003c/p\u003e\n\u003cp\u003eI shouted, “WAS HE, FITZ?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-end-of-me-the-single-lady-spy-1/page-27.html","bookId":2264,"creation":"Oct 5, 2019 5:22:02 PM","modification":"Oct 5, 2019 5:22:02 PM"}
