{"id":87422,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe shrugged, “I told you, I had always wanted to, and then after seeing you so angry and desperate, I knew you would be into some fun.”\u003c/p\u003e\n\u003cp\u003eI almost gagged, “What about the bank accounts, and the payroll, and the money James had left behind?”\u003c/p\u003e\n\u003cp\u003eHe pointed at the computer, “It’s there for you and your children. You may have it, if and when, I am safely back to being a scummy arms dealer, and you are back to being the prudish mother you were.”\u003c/p\u003e\n\u003cp\u003eI looked forward, “What about them?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “I don’t know.”\u003c/p\u003e\n\u003cp\u003e“What about me?”\u003c/p\u003e\n\u003cp\u003eHe looked grave, “I don’t know.”\u003c/p\u003e\n\u003cp\u003eI felt sick, “You said I was yours.”\u003c/p\u003e\n\u003cp\u003eHe gave me a grim smile, “I said a lot of things to get in your pants. Like you said, I really am a sex addict. It’s more fun if you give yourself to me, than if I am forced to take what I want.”\u003c/p\u003e\n\u003cp\u003e“Will you let us live?”\u003c/p\u003e\n\u003cp\u003eHis eyes narrow as he thought on the answer, but never spoke.\u003c/p\u003e\n\u003cp\u003eI unbuckled my seatbelt, needing to be away from him.\u003c/p\u003e\n\u003cp\u003eI walked to the front of the plane and sat next to Jack. I buckled my belt and tried not to think about how sick it all was—how sick Servario was.\u003c/p\u003e\n\u003cp\u003eI needed to warn them that he was going to kill them, but I needed my kids more.\u003c/p\u003e\n\u003cp\u003eChapter Fifteen – Silent as the grave you promised me\u003c/p\u003e\n\u003cp\u003eWhen we landed it was dark and humid. I wasn’t excited about the tight pants I was wearing in the heat. We walked to the limo waiting for us on the dusty tarmac. Looking back, the sleek, white jet and stretched, black limo looked out of place at the tiny rundown airport. I slumped into a seat and closed my eyes, blocking the world out.\u003c/p\u003e\n\u003cp\u003eWe drove for what felt like an eternity. The limo bumped along the road, until we reached our destination and the vehicle came to a stop. I opened my eyes, seeing a look of worry on Coop’s face. I nodded subtly.\u003c/p\u003e\n\u003cp\u003eThe doors opened. My heart started to pick up pace as we got out into the damp heat. We were outside of a villa of sorts. There was a huge gate. As it opened Servario leaned in, “You will be sleeping in my room tonight.” Chills ran up my spine.\u003c/p\u003e\n\u003cp\u003eWe entered the courtyard of a beautifully lit home. Torches lit the way down the courtyard. “The way to the sea.” Servario pointed.\u003c/p\u003e\n\u003cp\u003eThe home was massive and every room was lit, making it warm and inviting. We walked into the house, greeted by a small woman in a maid’s uniform.\u003c/p\u003e\n\u003cp\u003eServario held his hand out to everyone, “Pick rooms in the wing to the right, shower and rest up. We leave again tomorrow.”\u003c/p\u003e\n\u003cp\u003eLuce stepped out of the heels, “Night.” She walked down the hallway. Jack followed her but Coop watched me for a second.\u003c/p\u003e\n\u003cp\u003e“You coming?”\u003c/p\u003e\n\u003cp\u003eI glanced sideways at Servario speaking with Steve, and shook my head, “You know how us agents are, always thinking with our cocks.”\u003c/p\u003e\n\u003cp\u003eHe saw it. He knew what I meant. “Fuck,” he mouthed and walked down the hall, “Night, Evie.”\u003c/p\u003e\n\u003cp\u003eI nodded, “Night, Coop.”\u003c/p\u003e\n\u003cp\u003eI was almost trembling when I looked at the men talking, “Which way to your room?”\u003c/p\u003e\n\u003cp\u003eServario pointed down the hall the opposite way my team went. I walked past his arm and headed for the room.\u003c/p\u003e\n\u003cp\u003eOf course it was ridiculous. It was oversized and lush. If I hadn’t seen his cock I would assume he was trying to make up for things with the extravagance in his life. I closed the double door and found my way into the huge ensuite. I started a bubble bath and stripped down, tying my hair up. He had salts and bubbles and soaps, all in a dish. I climbed into the steamy tub, nearly moaning. The tub was an oversized, corner unit.\u003c/p\u003e\n\u003cp\u003eI closed my eyes and planned my next move. I would seduce him, tie him up maybe, and get them out. But was that risking my kids? Did he have them or did my mother or did he have them all? Where had Fitz gotten the private jet? Why was my father in hiding and did my mother know? What did I know for a fact?\u003c/p\u003e\n\u003cp\u003eNothing. Everything was up in the air.\u003c/p\u003e\n\u003cp\u003eJames might be alive, or not.\u003c/p\u003e\n\u003cp\u003eServario might be the Master Key, or not. My team might be murdered, or not.\u003c/p\u003e\n\u003cp\u003eMy kids might be safe, or not.\u003c/p\u003e\n\u003cp\u003eI might be kept alive, or not.\u003c/p\u003e\n\u003cp\u003eNothing was left, nothing was a guarantee.\u003c/p\u003e\n\u003cp\u003eI heard a zipper and opened my eyes. Servario dropped his pants and pulled his shirt off. I closed my eyes, but he didn’t have a shower like I thought he might. He stepped into my tub, pushing me over to a side, to accommodate him.\u003c/p\u003e\n\u003cp\u003eThe water level rose, nearly touching the top of the tub.\u003c/p\u003e\n\u003cp\u003e“What are you doing?” I asked, not raising my voice.\u003c/p\u003e\n\u003cp\u003e“I am enjoying my last night with you.”\u003c/p\u003e\n\u003cp\u003eMy stomach sunk. “You’re going to murder me tomorrow?”\u003c/p\u003e\n\u003cp\u003eHe didn’t answer me. I opened my eyes, startled by the look on his face.\u003c/p\u003e\n\u003cp\u003e“Just promise not to hurt my kids.” The words weren’t a plea. They were a demand. My life for theirs.\u003c/p\u003e\n\u003cp\u003eHe nodded, “I will guard them with my life.”\u003c/p\u003e\n\u003cp\u003eTears leaked from my eyes, “Why are you doing this?”\u003c/p\u003e\n\u003cp\u003eHis lip quivered as he mouthed something and I read his lips, “The secret must be kept. There is no price too high. No matter what it is, I will pay it to protect the world from the chaos it could bring.”\u003c/p\u003e\n\u003cp\u003eHe didn’t speak aloud in his own home? Were we ever safe? He was always mouthing and whispering. He was always silent, unless he was showboating his bad qualities. Then he was loud and slightly demented.\u003c/p\u003e\n\u003cp\u003eHe turned on the loud jets as he picked up one of my feet and started to rub, “Tell me something you don’t want to.”\u003c/p\u003e\n\u003cp\u003eI frowned, barely hearing what he’d said, “I like you. I don’t know why, but when it’s just you and me, and say, some bubbles or a bed, I like you.” I spoke in the same low whisper he did.\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003e“Tell me something you don’t want to.”\u003c/p\u003e\n\u003cp\u003eHe grinned, “I joined the mile-high club with you. I have never had sex on my jets, ever.”\u003c/p\u003e\n\u003cp\u003eI laughed silently, still too-near tears for it to not sound like crying, “Didn’t see that coming.”\u003c/p\u003e\n\u003cp\u003e“If you could do anything in the world, for the next year, what would it be?”\u003c/p\u003e\n\u003cp\u003eI frowned.\u003c/p\u003e\n\u003cp\u003eHe chuckled murmuring, “Humor me.”\u003c/p\u003e\n\u003cp\u003eArching an eyebrow, I spoke softly, after thinking for only a second, “Take my kids to an ashram in Thailand and learn to be a Yogi. Let them homeschool for the year and run around on a private beach, like Swiss Family Robinson, only the Thai edition. Then I would rent a house in France and I would take them to museums and galleries, and the ruins of France. I would winter in the Alps and ski. And I would probably finish the year off in Australia, or Greece, or somewhere completely different. Maybe on a yacht.” The words each brought a different flash of images, I could imagine every moment. I could see their faces.\u003c/p\u003e\n\u003cp\u003eHe nodded, “I knew you were high maintenance, deep down.”\u003c/p\u003e\n\u003cp\u003eI laughed bitterly, still leaking tears.\u003c/p\u003e\n\u003cp\u003eHis eyes looked the same as mine, devastated.\u003c/p\u003e\n\u003cp\u003e“What about after that? Would you go back to Boston?”\u003c/p\u003e\n\u003cp\u003eI searched his face for where it was all going, “You mean if I could and be safe?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eI nodded, “I would. My kids are in an amazing school. They love their friends and sports. They excel in the things they do. I would go back. I would need a different house though, maybe neighborhood. James fucked some of the neighbors as well.”\u003c/p\u003e\n\u003cp\u003eHe coughed, “That man makes me look like a preacher.”\u003c/p\u003e\n\u003cp\u003eI gave him a look, “Yeah, maybe one of the ones who they have to keep moving ‘cause he is always in the paper for bad things.”\u003c/p\u003e\n\u003cp\u003eHe pinched my toes.\u003c/p\u003e\n\u003cp\u003eI pulled back my foot. He grabbed the other one and started to massage it.\u003c/p\u003e\n\u003cp\u003e“Evie, if things were different and you were just a girl and I was just a guy, would you go to the Alps with me for Christmas?”\u003c/p\u003e\n\u003cp\u003eThe question hurt my insides. I shook my head, “No.”\u003c/p\u003e\n\u003cp\u003eHe nodded, “I see.” He paused, “May I ask why?”\u003c/p\u003e\n\u003cp\u003eI blinked a tear down my cheek, “I don’t think I can ever forget the conversation we had on the plane.”\u003c/p\u003e\n\u003cp\u003eA soft smile grew on his face, “Fair enough.”\u003c/p\u003e\n\u003cp\u003eWe lay in silence until, finally, I stood up, dripping water on him, “I need some sleep. Do you have some pajamas I can borrow?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “No, you may not wear any.”\u003c/p\u003e\n\u003cp\u003eI climbed out and dried myself with, what was probably, the softest towel on the planet. The queen probably didn’t have as nice of a towel. I walked naked to his bed and climbed in.\u003c/p\u003e\n\u003cp\u003eHe got out and walked across the room in the dim light coming from the bathroom.\u003c/p\u003e\n\u003cp\u003e“Should I sleep in the closet or are you not having company over tonight?”\u003c/p\u003e\n\u003cp\u003eHe chuckled, “You stay right where you are.”\u003c/p\u003e\n\u003cp\u003eMy stomach tensed, “Gustavo, you can’t be serious.”\u003c/p\u003e\n\u003cp\u003eHe turned sharply, grinning, “You never call me that.”\u003c/p\u003e\n\u003cp\u003eI tilted my head, “I should sleep in clothing. I just…I can’t—, not with you. Not ever again.”\u003c/p\u003e\n\u003cp\u003eHe laughed and fiddled with a drawer of things, “All I ask is for five minutes to persuade you otherwise.”\u003c/p\u003e\n\u003cp\u003eI shook my head, “No.”\u003c/p\u003e\n\u003cp\u003e“Don’t say no to me.” He pointed at me and walked back across the room to turn off the light in the bathroom.\u003c/p\u003e\n\u003cp\u003eHe climbed into the bed, dragging me across it to him. He wrapped himself around me and whispered in my ear, “You want to know my perfect year, assuming I had another one to live?”\u003c/p\u003e\n\u003cp\u003eI nodded. I was scared of him. Not the right kind of fear though. It was a fear he was going to break my heart, after only a week of knowing each other.\u003c/p\u003e\n\u003cp\u003eHis words were breath only, tickling my ear, “It would start with spooning you for a whole night, like you deserve to be. Then I would do everything in my power to ensure your life was the way you wanted it to be. I would say that I would die for you, Evie, but that won’t guarantee your safety. I would spend my whole year in your shadow, protecting you and earning the place I want to be in your heart. So that you would invite me for Christmas in the Alps.” He kissed my cheek, “I need one last show out of you tonight. Someone is watching me and I don’t know who. Please, let me play bad guy. Can you do that?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-end-of-me-the-single-lady-spy-1/page-35.html","bookId":2264,"creation":"Oct 5, 2019 5:22:02 PM","modification":"Oct 5, 2019 5:22:02 PM"}
