{"id":87423,"no":36,"title":"Page 36","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eTears were streaming down my face, I gave myself the moment and then shut it off. I turned to him, speaking loudly, “You have five minutes to make me want it. But you have to stop whispering that dirty shit in my ear.”\u003c/p\u003e\n\u003cp\u003eI could see the glossiness of his eyes in the moonlight, filtering in when he nodded, “I knew you’d come around.”\u003c/p\u003e\n\u003cp\u003eI woke hours later and looked over at him. He was sleeping still. I cuddled in and let everything he had said be more than it probably was.\u003c/p\u003e\n\u003cp\u003eFlashes of the night before crept in my brain, making me blush. I’d ridden him for the first time. It was amazing. My body was clenching just from remembering.\u003c/p\u003e\n\u003cp\u003e“You’re making me sweat,” he uttered, not opening his eyes.\u003c/p\u003e\n\u003cp\u003eI smiled, “You made me sweat last night.”\u003c/p\u003e\n\u003cp\u003eHe grinned, “You liked it.”\u003c/p\u003e\n\u003cp\u003eI bit his arm lightly, “You liked it.”\u003c/p\u003e\n\u003cp\u003eHe opened one very green eye, “I did.”\u003c/p\u003e\n\u003cp\u003eHis smile was infectious. I dragged my hands across his torso, “I’m hungry.”\u003c/p\u003e\n\u003cp\u003eHe chuckled, “I’ll see is Matilda has any raisin bran for you.”\u003c/p\u003e\n\u003cp\u003eI swatted him and climbed off the bed. “I want more of Pierre’s waffles.”\u003c/p\u003e\n\u003cp\u003eHe lifted his head and watched me pull on clothes, I stole from his drawer, “Stop stealing my clothes and no more waffles for you. You aren’t even allowed to come over anymore.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes, “Whatever.”\u003c/p\u003e\n\u003cp\u003eI looked down at his shorts and black t-shirt, “These almost fit. Were you slimmer before?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “I called ahead a few days ago and asked Matilda to get you some of my clothes, from when I was a boy, out of the old bags. I was shoving them in there last night, when you were being rude to me.”\u003c/p\u003e\n\u003cp\u003eI folded my arms, “How am I so predictable to you? How do you guess my every move?”\u003c/p\u003e\n\u003cp\u003eHis eyes sparkled, “You military people are all the same. You follow orders. I knew if I told you to do something, you would.”\u003c/p\u003e\n\u003cp\u003eI snorted as I left the room in search of food.\u003c/p\u003e\n\u003cp\u003eI found Coop instead.\u003c/p\u003e\n\u003cp\u003eHe gave me a grave look, “You okay?”\u003c/p\u003e\n\u003cp\u003eI nodded, “Yeah. We’re fucked, but I’m okay.”\u003c/p\u003e\n\u003cp\u003e“Why? What did he say?”\u003c/p\u003e\n\u003cp\u003eI shook my head and walked down the hall, “Nothing. That’s the problem. He hasn’t told me anything. He doesn’t talk to me about James, or the Burrow, or anything. I told him whatever happens, to keep my kids safe and that’s the only guarantee I’ve gotten from him.”\u003c/p\u003e\n\u003cp\u003eHe swallowed, “Martin’s team hasn’t checked in since they went silent.”\u003c/p\u003e\n\u003cp\u003eWorry snuck in, where I had told myself not to. I sighed, “What can we do? Realistically, what are our options?”\u003c/p\u003e\n\u003cp\u003eHe shook his head and led me to the bedroom where Luce and Jack were sitting on a huge bed.\u003c/p\u003e\n\u003cp\u003e“Morning,” Luce smiled. I could see the fear on her face. She looked like herself again, no makeup, or fancy clothes, or big hair. I pointed to their outfits, “Where’d you get clothes from?”\u003c/p\u003e\n\u003cp\u003eJack shrugged, “There were laid out already. The lady, who doesn’t speak any of the languages I have tossed at her, did it.”\u003c/p\u003e\n\u003cp\u003eI snorted, “How many do you speak, Jack?”\u003c/p\u003e\n\u003cp\u003eHe looked down, “Counting Elvish and Klingon, nine.”\u003c/p\u003e\n\u003cp\u003eI smirked and looked at Luce who was shaking her head, “Dude.”\u003c/p\u003e\n\u003cp\u003eHe blushed, “What?”\u003c/p\u003e\n\u003cp\u003eI crossed my arms, “We need a plan.”\u003c/p\u003e\n\u003cp\u003eCoop made a face, “This place is bugged to fuck. I found seven between my room and this one. I’m assuming we didn’t get them all. We’ve been pretty careful of what we said.”\u003c/p\u003e\n\u003cp\u003eI pointed at the clothes, “And we all put on clothes from here. Probably sewn in the damned hems.”\u003c/p\u003e\n\u003cp\u003eLuce sighed, “Go for a swim?”\u003c/p\u003e\n\u003cp\u003eI nodded, “Let’s.”\u003c/p\u003e\n\u003cp\u003eWe walked back out into the main room and out the front door.\u003c/p\u003e\n\u003cp\u003eThere was no one around, “Creepy how there is no staff, huh?”\u003c/p\u003e\n\u003cp\u003eCoop looked around, “Super creepy. Not to mention, Steve took our guns before we got on the plane.”\u003c/p\u003e\n\u003cp\u003eThe path to the ocean was bricked with sand and rock gardens the entire way. The ocean was beautiful and turquoise.\u003c/p\u003e\n\u003cp\u003e“Where the hell are we?”\u003c/p\u003e\n\u003cp\u003eJack smirked, “We are in Mexico, just North of Veracruz.”\u003c/p\u003e\n\u003cp\u003eI frowned, “How the hell did he get us in Mexico without passports or shit?”\u003c/p\u003e\n\u003cp\u003eCoop picked up the pace, “Not a clue.”\u003c/p\u003e\n\u003cp\u003eWe started to run, as we got closer to the sandy beach. We all dove into the waves. They weren’t too rough, there was a rocky break, out in the water, not too far from the beach. It got the worst of the moody Atlantic. The beach near the house was more of a pool. The water was warm, and yet refreshing. We swam out against the current, each of us dunking and soaking ourselves thoroughly.\u003c/p\u003e\n\u003cp\u003eI flutter-kicked and looked back at the house, “He’s trying something. I don’t know what, but I think he wants to help us.”\u003c/p\u003e\n\u003cp\u003eCoop pointed, “Well, here he comes, swimming trunks and all. Maybe he’ll just offer it up.”\u003c/p\u003e\n\u003cp\u003eI laughed when I saw, he truly had on Bermuda shorts and was carrying a stack of towels.\u003c/p\u003e\n\u003cp\u003eHe dropped them on the beach, far from us and jogged for the water. We all watched in silence as he jumped in and swam out.\u003c/p\u003e\n\u003cp\u003eServario bobbed and looked us all over before speaking softly, “I was hoping you would come out here. Let’s all pretend to swim and be playful. Whoever is the mole, is watching. Unless of course, it’s one of you.”\u003c/p\u003e\n\u003cp\u003eMy jaw dropped, “What?”\u003c/p\u003e\n\u003cp\u003eHe nodded, “I have a mole. I didn’t know, until recently. My staff is unaware of a lot of aspects in my life, and when I made inquiries about the Burrow, like any arms dealer worth his salt would, I had James up my ass, instantly. My plan was to put it out there and see who bit. James bit instantly.”\u003c/p\u003e\n\u003cp\u003eI looked at Coop, “One of ours, maybe?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “If there is, it’s over my head.”\u003c/p\u003e\n\u003cp\u003eJack frowned, “Wait, who was Derringer to all this?”\u003c/p\u003e\n\u003cp\u003eServario shook his head, “The patsy, your people wanted to blame a lot of things related to all of this on. It’s not him. It’s someone in my employment. My houses are not safe. My planes weren’t safe.”\u003c/p\u003e\n\u003cp\u003eI frowned, “Is the plane safe now?” I asked thinking on the conversation we’d had.\u003c/p\u003e\n\u003cp\u003eHe smirked, “I had something installed, it alerts to issues of that nature. The plane starts and an alarm goes off, it only works in planes and vehicles.”\u003c/p\u003e\n\u003cp\u003eCoop looked confused, “Does anyone know you installed it?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “No. Impossible.”\u003c/p\u003e\n\u003cp\u003eCoop looked lost, “So you’re on our side?”\u003c/p\u003e\n\u003cp\u003eServario shook his head, “I’m on her side. Whatever side you choose, will dictate if I’m on your side or not.”\u003c/p\u003e\n\u003cp\u003eI could tell Coop wasn’t buying it. Jack nodded, “That actually makes sense. You must have been friends with her dad, and that’s why the information James found, tied you together.”\u003c/p\u003e\n\u003cp\u003eCoop’s eyes widened, “Her father killed your father when you were what, eighteen?”\u003c/p\u003e\n\u003cp\u003eServario’s eyes had no green in them, “Let’s drop it. It’s my business, not yours. Yours is staying alive. Your government has a few key members in it, who won’t rest until they’ve got the Burrow. Those same people, by now, think you all are involved. Running with Evie, when you were told to keep her with me, didn’t help your cause. You don’t stand a chance at surviving the next forty-eight hours, unless you off them and hide the evidence linking you.”\u003c/p\u003e\n\u003cp\u003eMy teeth started to chatter as we floated in the water, “We know the commander is involved.”\u003c/p\u003e\n\u003cp\u003eCoop nodded, “He’s been my only contact throughout the whole thing.”\u003c/p\u003e\n\u003cp\u003eLuce nodded, “The eyes on the house. We know for sure that’s gonna be one team, following along. They wouldn’t risk the information getting out.”\u003c/p\u003e\n\u003cp\u003eServario licked his lips, making a face from the salt, “Don’t forget, there has to be a politician in on this. There is no way the commander got involved, without someone higher up putting it in his face. The only people who really knew about the Burrow were very high in the CIA, UN, MI6, and CI. One of them has opened this can of worms.”\u003c/p\u003e\n\u003cp\u003eI thought and nodded, “We split up and take them out?”\u003c/p\u003e\n\u003cp\u003eCoop gave me a look, “This is a top breach if we do it. We can be tried with espionage, treason, terrorism, and a variety of other really chargeable offenses. You in for that, with your kids?”\u003c/p\u003e\n\u003cp\u003eI swallowed and looked at Servario. He shook his head, “She’s out. She isn’t negotiable. She is a civilian.”\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed, “Are my kids safe?”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “Doesn’t matter, you aren’t in.”\u003c/p\u003e\n\u003cp\u003eI searched his face, “I’m in. This is my father’s work, my country’s work, my mother’s work, and if this ends, my kids can have normalcy again.”\u003c/p\u003e\n\u003cp\u003e“You could die and leave them orphaned—or worse, get caught and shame them with the lies they charge you with.”\u003c/p\u003e\n\u003cp\u003eI swam to shore, “We leave here in an hour. We need to figure out your situation first.”\u003c/p\u003e\n\u003cp\u003eI knew who it was.\u003c/p\u003e\n\u003cp\u003eI knew who the mole was.\u003c/p\u003e\n\u003cp\u003eHe came out of the water after me, “You aren’t in.”\u003c/p\u003e\n\u003cp\u003eI looked back, “You ever sleep with Roxy?”\u003c/p\u003e\n\u003cp\u003eHe sighed, “I told you I won’t have you disrespecting her. I truly hired her for the cooking and the OCD. She is very clean. Yes, she’s pretty but I don’t like to mix business with pleasure.”\u003c/p\u003e\n\u003cp\u003eI put my hands on my hips, “You mixed it with me.”\u003c/p\u003e\n\u003cp\u003eHe shook his head, “You have never been anything, but pleasure in my mind.”\u003c/p\u003e\n\u003cp\u003eI bit my lip, “Roxy doesn’t know that.”\u003c/p\u003e\n\u003cp\u003eHe picked up a towel and dried himself off, “You think it’s her?”\u003c/p\u003e\n\u003cp\u003eI dried off and walked up to the house, “She is it. She’s jealous.”\u003c/p\u003e\n\u003cp\u003eHe looked back at Coop, Luce, and Jack in the water, still plotting. He sighed, “No way. I never brought women on the plane, and I’ve never been that way with her.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-end-of-me-the-single-lady-spy-1/page-36.html","bookId":2264,"creation":"Oct 5, 2019 5:22:02 PM","modification":"Oct 5, 2019 5:22:02 PM"}
