{"id":8714,"no":11,"title":"CHAPTER XI — LUKE IS ARRESTED","content":"\u0026nbsp;Just after twelve o\u0027clock, when Luke was at home eating dinner, a knock was heard at the front door. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll go, mother,\" said Luke, and he rose from the table, and, going into the entry, opened the outer door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His surprise may be imagined when he confronted Squire Duncan and the gentlemen already mentioned as directors of the Groveton bank.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you wish to see mother?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; we have come on important business,\" said Squire Duncan, pompously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Walk in, if you please.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Luke led the way into the little sitting-room, followed by the visitors. The dinner-table was spread in the kitchen adjoining. The room looked very much filled up with the unwonted company, all being large men.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother,\" called Luke, \"here are some gentlemen who wish to see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The widow entered the room, and looked with surprise from one to another. All waited for Squire Duncan, as the proper person, from his official position, to introduce the subject of their visit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mrs. Larkin,\" said the squire, pompously, \"it has possibly come to your ears that the Groveton Bank, of which you are aware that I am the president, has been robbed of a box of bonds?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir. I was so informed by Miss Melinda Sprague this morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am also informed that you have in your custody a tin box similar to the one that has been taken.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He expected to see Mrs. Larkin show signs of confusion, but she answered calmly: \"I have a box in my custody, but whether it resembles the one lost I can\u0027t say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Ha! you admit that you hold such a box?\" said the squire, looking significantly at his companions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Certainly. Why should I not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you willing to show it to us?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, we are willing to show it,\" said Luke, taking it upon himself to answer, \"but I have no idea that it will do you any good.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is for us to decide, young man,\" said Squire Duncan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you suppose it is the box missing from the bank, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It may be.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When did you miss the box?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Only this morning, but it may have been taken a month ago.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This box has been in our possession for a fortnight.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Such is your statement, Luke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is the truth,\" said Luke, flushing with indignation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My boy,\" said Mr. Beane, \"don\u0027t be angry. I, for one, have no suspicion that you have done anything wrong, but it is our duty to inquire into this matter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who told you that we had such a box, Mr. Beane?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Melinda Sprague was the informant.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought so, mother,\" said Luke. \"She is a prying old maid, and it is just like her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Sprague only did her duty,\" said the squire. \"But we are losing time. We require you to produce the box.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will get it, gentlemen,\" said the widow, calmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n While she was upstairs, Mr. Manning inquired: \"Where did you get the box, Luke?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you identify it as the box taken from the bank,\" answered Luke, \"I will tell you. Otherwise I should prefer to say nothing, for it is a secret of another person.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Matters look very suspicious, in my opinion, gentlemen,\" said Squire Duncan, turning to his associates.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not necessarily,\" said Mr. Beane, who seemed inclined to favor our hero. \"Luke may have a good reason for holding his tongue.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here Mrs. Larkin presented herself with the missing box. Instantly it became an object of attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It looks like the missing box,\" said the squire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course, I can offer no opinion,\" said Mr. Beane, \"not having seen the one lost. Such boxes, however, have a general resemblance to each other.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you the key that opens it?\" asked the squire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Squire Duncan,\" asked Mr. Beane, \"have you the key unlocking the missing box?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir,\" answered Squire Duncan, after a slight pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I don\u0027t think we can decide as to the identity of the two boxes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The trustees looked at each other in a state of indecision. No one knew what ought to be done.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What course do you think we ought to take, Squire Duncan?\" asked Mr. Bailey.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think,\" said the bank president, straightening up, \"that there is sufficient evidence to justify the arrest of this boy Luke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have done nothing wrong, sir,\" said Luke, indignantly. \"I am no more of a thief than you are.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mean to insult me, you young jackanapes?\" demanded Mr. Duncan, with an angry flush on his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I intend to insult no one, but I claim that I have done nothing wrong.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is what all criminals say,\" sneered the squire.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Luke was about to make an angry reply, but Mr. Beane, waving his hand as a signal for our hero to be quiet, remarked calmly: \"I think, Duncan, in justice to Luke, we ought to hear his story as to how the box came into his possession.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is my opinion,\" said Mr. Bailey. \"I don\u0027t believe Luke is a bad boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Prince Duncan felt obliged to listen to that suggestion, Mr. Bailey and Mr. Beane being men of consideration in the village.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Young man,\" he said, \"we are ready to hear your story. From whom did you receive this box?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"From a man named Roland Reed,\" answered Luke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The four visitors looked at each other in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And who is Roland Reed?\" asked the president of the bank. \"It seems very much like a fictitious name.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It may be, for aught I know,\" said Luke, \"but it is the name given me by the person who gave me the box to keep for him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"State the circumstances,\" said Mr. Beane.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About two weeks since I was returning from the house of Miss Almira Clark, where I had gone on an errand for my mother. To shorten my journey, I took my way through the woods. I had nearly passed through to the other side, when a tall man, dark-complexioned, whom I had never seen before stepped up to me. He asked me my name, and, upon my telling him, asked if I would do him a favor. This was to take charge of a tin box, which he carried under his arm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The one before us?\" asked Mr. Manning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he give any reason for making this request?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He said he was about to leave the neighborhood, and wished it taken care of. He asked me to put it under lock and key.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he state why he selected you for this trust?\" asked Mr. Beane.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, sir; he paid me for my trouble, however. He gave me a bank-note, which, when I reached home, I found to be a ten-dollar bill.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you haven\u0027t seen him since?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Once only.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When was that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On the evening of Florence Grant\u0027s party. On my way home the same man came up to me and asked if the box was safe. I answered, \u0027Yes.\u0027 He said, \u0027That is all—for the present,\u0027 and disappeared. I have not seen him since.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is a very pretty romance,\" said Prince Duncan, with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can confirm it,\" said Mrs. Larkin, calmly. \"I saw Luke bring in the box, and at his request I took charge of it. The story he told at that time is the same that he tells now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very possibly,\" said the bank president. \"It was all cut and dried.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You seem very much prejudiced against Luke,\" said Mrs. Larkin, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By no means, Mrs. Larkin. I judge him and his story from the standpoint of common sense. Gentlemen, I presume this story makes the same impression on you as on me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Beane shook his head. \"It may be true; it is not impossible,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You believe, then, there is such a man as Roland Reed?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There may be a man who calls himself such.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If there is such a man, he is a thief.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It may be so, but that does not necessarily implicate Luke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He would be a receiver of stolen property.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not knowing it to be such.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"At all events, I feel amply justified in causing the arrest of Luke Larkin on his own statement.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Surely you don\u0027t mean this?\" exclaimed Mrs. Larkin, in dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t be alarmed, mother,\" said Luke, calmly. \"I am innocent of wrong, and no harm will befall me.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3006/82972.html","bookId":285,"creation":"Aug 1, 2019 8:43:16 AM","modification":"Aug 1, 2019 8:43:16 AM"}
