{"id":8721,"no":18,"title":"CHAPTER XVIII — MR. DUNCAN\u0027S SECRET","content":"\u0026nbsp;About two weeks later, Prince Duncan sat at his desk with a troubled look. Open before him were letters. One was post-marked London, and ran as follows: \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"MY DEAR SIR: I have decided to shorten my visit, and shall leave Liverpool next Saturday en route for New York. You will see, therefore, that I shall arrive nearly as soon as the letter I am now writing. I have decided to withdraw the box of securities I deposited in your bank, and shall place it in a safe-deposit vault in New York. You may expect to see me shortly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yours in haste,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"JOHN ARMSTRONG.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Drops of perspiration gathered on the brow of Prince Duncan as he read this letter. What would Mr. Armstrong say when he learned that the box had mysteriously disappeared? That he would be thoroughly indignant, and make it very unpleasant for the president of Groveton Bank, was certain. He would ask, among other things, why Mr. Duncan had not informed him of the loss by cable, and no satisfactory explanation could be given. He would ask, furthermore, why detectives had not been employed to ferret out the mystery, and here again no satisfactory explanation could be given. Prince Duncan knew very well that he had a reason, but it was not one that could be disclosed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He next read the second letter, and his trouble was not diminished. It was from a Wall Street broker, informing him that the Erie shares bought for him on a margin had gone down two points, and it would be necessary for him to deposit additional margin, or be sold out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why did I ever invest in Erie?\" thought Duncan ruefully. \"I was confidently assured that it would go up—that it must go up—and here it is falling, and Heaven knows how much lower it will go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this point the door opened, and Randolph entered. He had a special favor to ask. He had already given his father several hints that he would like a gold watch, being quite dissatisfied with his silver watch now that Luke Larkin possessed one superior to his. He had chosen a very unfavorable moment for his request, as he soon found out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Father,\" he said, \"I have a favor to ask.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it?\" asked Prince Duncan, with a frown.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish you would buy me a gold watch.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, you do!\" sneered his father. \"I was under the impression that you had two watches already.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I have, but one is a Waterbury, and the other a cheap silver one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, they keep time, don\u0027t they?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then what more do you want?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Luke Larkin has a silver watch better than mine—a stem-winder.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suppose he has?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t want a working boy like him to outshine me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where did he get his watch?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know; he won\u0027t tell. Will you buy me a gold one, father? Then I can look down upon him again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I can\u0027t. Money is very scarce with me just now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I don\u0027t want to wear a watch at all,\" said Randolph pettishly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Suit yourself,\" said his father coldly. \"Now you may leave the room. I am busy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Randolph left the room. He would have slammed the door behind him, but he knew his father\u0027s temper, and he did not dare to do so.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What am I to do?\" Prince Duncan asked himself anxiously. \"I must send money to the brokers, or they will sell me out, and I shall meet with a heavy loss.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After a little thought he wrote a letter enclosing a check, but dated it two days ahead.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They will think it a mistake,\" he thought, \"and it will give me time to turn around. Now for money to meet the check when it arrives.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Prince Duncan went up-stairs, and, locking the door of his chamber, opened a large trunk in one corner of the room. From under a pile of clothing he took out a tin box, and with hands that trembled with excitement he extracted therefrom a dozen government bonds. One was for ten thousand dollars, one for five, and the remainder were for one thousand dollars each.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If they were only sold, and the money deposited in the bank to my credit,\" he thought. \"I am almost sorry I started in this thing. The risk is very great, but—but I must have money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this moment some one tried the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Prince Duncan turned pale, and the bonds nearly fell from his hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who\u0027s there?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is I, papa,\" answered Randolph.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you may go down-stairs again,\" answered his father angrily. \"I don\u0027t want to be disturbed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Won\u0027t you open the door a minute? I just want to ask a question.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I won\u0027t. Clear out!\" exclaimed the bank president angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What a frightful temper father has!\" thought the discomfited Randolph.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was nothing for it but to go down-stairs, and he did so in a very discontented frame of mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems to me that something is going contrary,\" said Duncan to himself. \"It is clear that it won\u0027t do to keep these bonds here any longer. I must take them to New York to-morrow—and raise money on them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On second thought, to-morrow he decided only to take the five-thousand-dollar bond, and five of the one thousand, fearing that too large a sale at one time might excite suspicion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Carefully selecting the bonds referred to, he put them away in a capacious pocket, and, locking the trunk, went down-stairs again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is still time to take the eleven-o\u0027clock train,\" he said, consulting his watch. \"I must do it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Seeking his wife, he informed her that he would take the next train for New York.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Isn\u0027t this rather sudden?\" she asked, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A little, perhaps, but I have a small matter of business to attend to. Besides, I think the trip will do me good. I am not feeling quite as well as usual.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I believe I will go, too,\" said Mrs. Duncan unexpectedly. \"I want to make some purchases at Stewart\u0027s.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This suggestion was very far from agreeable to her husband.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really—I am\"—he said, \"I must disappoint you. My time will be wholly taken up by matters of business, and I can\u0027t go with you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t need to. I can take care of myself, and we can meet at the depot at four o\u0027clock.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Besides, I can\u0027t supply you with any money for shopping.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have enough. I might have liked a little more, but I can make it do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps it will look better if we go in company,\" thought Prince Duncan. \"She needn\u0027t be in my way, for we can part at the station.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Very well, Jane,\" he said quietly. \"If you won\u0027t expect me to dance attendance upon you, I withdraw my objections.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The eleven-o\u0027clock train for New York had among its passengers Mr. and Mrs. Duncan.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was another passenger whom neither of them noticed—a small, insignificant-looking man—who occasionally directed a quick glance at the portly bank president.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3006/82979.html","bookId":285,"creation":"Aug 1, 2019 8:43:34 AM","modification":"Aug 1, 2019 8:43:34 AM"}
