{"id":8731,"no":28,"title":"CHAPTER XXVIII — COLEMAN\u0027S LITTLE PLAN","content":"\u0026nbsp;Though Coleman went to bed late, he awoke early. He had the power of awaking at almost any hour that he might fix. He was still quite fatigued, but having an object in view, overcame his tendency to lie longer, and swiftly dressing himself, went downstairs. Luke was still sleeping, and did not awaken while his companion was dressing. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Coleman went downstairs and strolled up to the clerk\u0027s desk,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re up early,\" said that official.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, it\u0027s a great nuisance, but I have a little business to attend to with a man who leaves Chicago by an early train. I tried to find him last night, but he had probably gone to some theater. That is what has forced me to get up so early this morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am always up early,\" said the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you are used to it, and don\u0027t mind it. It is different with me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Coleman bought a cigar, and while he was lighting it, remarked, as if incidentally:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By the way, did my young friend leave my money with you last evening?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He left a package of money with me, but he didn\u0027t mention it was yours.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Forgot to, I suppose. I told him to leave it here, as I was going out to the theater, and was afraid I might have my pocket picked. Smart fellows, those pickpockets. I claim to be rather smart myself, but there are some of them smart enough to get ahead of me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was relieved of my pocketbook containing over two hundred dollars in money once. By Jove! I was mad enough to knock the fellow\u0027s head off, if I had caught him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is rather provoking.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I\u0027ll trouble you to hand me the money the boy left with you, as I have to use some this morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Coleman spoke in an easy, off-hand way, that might have taken in some persons, but hotel clerks are made smart by their positions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sorry, Mr. Coleman,\" said the clerk, \"but I can only give it back to the boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I commend your caution, my friend,\" said Coleman, \"but I can assure you that it\u0027s all right. I sent it back by Luke when I was going to the theater, and I meant, of course, to have him give my name with it. However, he is not used to business, and so forgot it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When did you hand it to him?\" asked the clerk, with newborn suspicion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About eight o\u0027clock. No doubt he handed it in as soon as he came back to the hotel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much was there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This question posed Mr. Coleman, as he had no idea how much money Luke had with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t say exactly,\" he answered. \"I didn\u0027t count it. There might have been seventy-five dollars, though perhaps the sum fell a little short of that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t give you the money, Mr. Coleman,\" said the clerk, briefly. \"I have no evidence that it is yours.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really, that\u0027s ludicrous,\" said Coleman, with a forced laugh. \"You don\u0027t mean to doubt me, I hope,\" and Madison Coleman drew himself up haughtily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That has nothing to do with it. The rule of this office is to return money only to the person who deposited it with us. If we adopted any other rule, we should get into no end of trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, my friend,\" said Coleman, frowning, \"you are putting me to great inconvenience. I must meet my friend in twenty minutes and pay him a part of this money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have nothing to do with that,\" said the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You absolutely refuse, then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do,\" answered the clerk, firmly. \"However, you can easily overcome the difficulty by bringing the boy down here to authorize me to hand you the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems to me that you have plenty of red tape here,\" said Coleman, shrugging his shoulders. \"However, I must do as you require.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Coleman had a bright thought, which he proceeded to carry into execution.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He left the office and went upstairs. He was absent long enough to visit the chamber which he and Luke had occupied together. Then he reported to the office again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The boy is not dressed,\" he said, cheerfully. \"However, he has given me an order for the money, which, of course, will do as well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He handed a paper, the loose leaf of a memorandum book, on which were written in pencil these words:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give my guardian, Mr. Coleman, the money I left on deposit at the office. LUKE LARKIN.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That makes it all right, doesn\u0027t it?\" asked Coleman, jauntily. \"Now, if you\u0027ll be kind enough to hand me my money at once, I\u0027ll be off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It won\u0027t do, Mr. Coleman,\" said the clerk. \"How am I to know that the boy wrote this?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t you see his signature?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The clerk turned to the hotel register, where Luke had enrolled his name.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The handwriting is not the same,\" he said, coldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, confound it!\" exclaimed Coleman, testily. \"Can\u0027t you understand that writing with a pencil makes a difference?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I understand,\" said the clerk, \"that you are trying to get money that does not belong to you. The money was deposited a couple of hours sooner than the time you claim to have handed it to the boy—just after you and the boy arrived.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re right,\" said Coleman, unabashed. \"I made a mistake.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You cannot have the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have no right to keep it from me,\" said Coleman, wrathfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bring the boy to the office and it shall be delivered to him; then, if he chooses to give it to you, I have nothing to say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I tell you he is not dressed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He seems to be,\" said the clerk, quietly, with a glance at the door, through which Luke was just entering.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Coleman\u0027s countenance changed. He was now puzzled for a moment. Then a bold plan suggested itself. He would charge Luke with having stolen the money from him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3006/82989.html","bookId":285,"creation":"Aug 1, 2019 8:44:03 AM","modification":"Aug 1, 2019 8:44:03 AM"}
