{"id":8709,"no":6,"title":"CHAPTER VI — PREPARING FOR THE PARTY","content":"\u0026nbsp;The evening of the party arrived. It was quite a social event at Groveton, and the young people looked forward to it with pleasant anticipation. Randolph went so far as to order a new suit for the occasion. He was very much afraid it would not be ready in time, but he was not to be disappointed. At five o\u0027clock on Thursday afternoon it was delivered, and Randolph, when arrayed in it, surveyed himself with great satisfaction. He had purchased a handsome new necktie, and he reflected with pleasure that no boy present—not even Linton—would be so handsomely dressed as himself. He had a high idea of his personal consequence, but he was also of the opinion that \"fine feathers make fine birds,\" and his suit was of fine cloth and stylish make. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder what the janitor will wear?\" he said to himself, with a curl of the lip. \"A pair of overalls, perhaps. They would be very appropriate, certainly.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was just the question which was occupying Luke\u0027s mind. He did not value clothes as Randolph did, but he liked to look neat. Truth to tell, he was not very well off as to wardrobe. He had his every-day suit, which he wore to school, and a better suit, which he had worn for over a year. It was of mixed cloth, neat in appearance, though showing signs of wear; but there was one trouble. During the past year Luke had grown considerably, and his coat-sleeves were nearly two inches too short, and the legs of his trousers deficient quite as much. Nevertheless, he dressed himself, and he, too, surveyed himself, not before a pier-glass, but before the small mirror in the kitchen.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t my clothes look bad, mother?\" he asked anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"They are neat and clean, Luke,\" said his mother, hesitatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I know; but they are too small.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have been growing fast in the last year, Luke,\" said his mother, looking a little disturbed. \"I suppose you are not sorry for that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" answered Luke, with a smile, \"but I wish my coat and trousers had grown, too.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish, my dear boy, I could afford to buy you a new suit.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, never mind, mother,\" said Luke, recovering his cheerfulness. \"They will do for a little while yet. Florence didn\u0027t invite me for my clothes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; she is a sensible girl. She values you for other reasons.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope so, mother. Still, when I consider how handsomely Randolph will be dressed, I can\u0027t help thinking that there is considerable difference in our luck.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would you be willing to exchange with him, Luke?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is one thing I wouldn\u0027t like to exchange.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what is that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wouldn\u0027t exchange my mother for his,\" said Luke, kissing the widow affectionately. \"His mother is a cold, proud, disagreeable woman, while I have the best mother in the world.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t talk foolishly, Luke,\" said Mrs. Larkin; but her face brightened, and there was a warm feeling in her heart, for it was very pleasant to her to hear Luke speak of her in this way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t think any more about it, mother,\" said Luke. \"I\u0027ve got a new necktie, at any rate, and I will make that do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then there was a knock at the door, and Linton entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought I would come round and go to the party with you, Luke,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Linton was handsomely dressed, though he had not bought a suit expressly, like Randolph. He didn\u0027t appear to notice Luke\u0027s scant suit. Even if he had, he would have been too much of a gentleman to refer to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think we shall have a good time,\" he said. \"We always do at Mrs. Grant\u0027s. Florence is a nice girl, and they know how to make it pleasant. I suppose we shall have dancing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know how to dance,\" said Luke, regretfully. \"I should like to have taken lessons last winter when Professor Bent had a class, but I couldn\u0027t afford it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You have seen dancing?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It doesn\u0027t take much knowledge to dance a quadrille, particularly if you get on a side set. Come, we have an hour before it is time to go. Suppose I give you a lesson?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think I could learn enough in that time to venture?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I do. If you make an occasional mistake it won\u0027t matter. So, if your mother will give us the use of the sitting-room, I will commence instructions.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Luke had looked at some dancers in the dining-room at the hotel, and was not wholly a novice, therefore. Linton was an excellent dancer, and was clear in his directions. It may also be said that Luke was a ready learner. So it happened at the end of the hour that the pupil had been initiated not only in the ordinary changes of the quadrille, but also in one contra dance, the Virginia Reel, which was a great favorite among the young people of Groveton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, I think you\u0027ll do, Luke,\" said Linton, when the lesson was concluded. \"You are very quick to learn.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You think I won\u0027t be awkward, Linton?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, if you keep cool and don\u0027t get flustered.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am generally pretty cool. But I shall be rather surprised to see myself on the floor,\" laughed Luke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt others will be, but you\u0027ll have a great deal more fun.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I shall. I don\u0027t like leaning against the wall while others are having a good time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you could dance as well as you can skate you would have no trouble, Luke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; that is where Randolph has the advantage of me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is a very great dancer, though he can\u0027t come up to you in skating. However, dancing isn\u0027t everything. Dance as well as he may, he doesn\u0027t stand as high in the good graces of Florence Grant as he would like to do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I always noticed that he seemed partial to Florence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, but it isn\u0027t returned. How about yourself, Luke?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Luke, being a modest boy, blushed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I certainly think Florence a very nice girl,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was sure of that,\" said Linton, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I don\u0027t want to stand in your way, Linton,\" continued Luke, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No danger, Luke. Florence is a year older than I am. Now, you are nearly two years older than she, and are better matched. So you needn\u0027t consider me in the matter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course, this was all a joke. It was true, however, that of all the girls in Groveton, Luke was more attracted by Florence Grant than by any other, and they had always been excellent friends. It was well known that Randolph also was partial to the young lady, but he certainly had never received much encouragement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally the boys got out, and were very soon at the door of Mrs. Grant\u0027s handsome cottage. It was large upon the ground, with a broad veranda, in the Southern style. In fact, Mrs. Grant was Southern by birth, and, erecting the house herself, had it built after the fashion of her Southern birthplace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Most of the young visitors had arrived when Luke and Linton put in an appearance. They had been detained longer than they were aware by the dancing-lesson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Randolph and Sam Noble were sitting side by side at one end of the room, facing the entrance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look,\" said Randolph, with a satirical smile, to his companion, \"there comes the young janitor in his dress suit. Just look at his coat-sleeves and the legs of his trousers. They are at least two inches too short. Any other boy would be ashamed to come to a party in such ridiculous clothes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam looked and tittered. Luke\u0027s face flushed, for, though he did not hear the words, he guessed their tenor. But he was made to forget them when Florence came forward and greeted Linton and himself with unaffected cordiality.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3006/82967.html","bookId":285,"creation":"Aug 1, 2019 8:43:02 AM","modification":"Aug 1, 2019 8:43:02 AM"}
