{"id":8710,"no":7,"title":"CHAPTER VII — FLORENCE GRANT\u0027S PARTY","content":"\u0026nbsp;Luke\u0027s uncomfortable consciousness of his deficiencies in dress soon passed off. He noticed the sneer on Randolph\u0027s face and heard Sam\u0027s laugh, but he cared very little for the opinion of either of them. No other in the company appeared to observe his poor dress, and he was cordially greeted by them all, with the two exceptions already named. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The janitor ought to know better than to intrude into the society of his superiors,\" said Randolph to Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He seems to enjoy himself,\" said Sam.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was half an hour after the party had commenced, when all were engaged in one of the plays popular at a country party.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am going to have a party myself in a short time,\" continued Randolph, \"but I shall be more select than Florence in my invitations. I shall not invite any working boys.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Right you are, Randolph,\" said the subservient Sam. \"I hope you won\u0027t forget me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no; I shall invite you. Of course, you don\u0027t move exactly in my circle, but, at any rate, you dress decently.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If Sam Noble had had proper pride he would have resented the insolent assumption of superiority in this speech, but he was content to play second fiddle to Randolph Duncan. His family, like himself, were ambitious to be on good terms with the leading families in the village, and did not mind an occasional snub.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall you invite Tom Harper?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He felt a little jealous of Tom, who had vied with him in flattering attentions to Randolph.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I don\u0027t think so. Tom isn\u0027t here, is he?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He received an invitation, but ever since his accident he has been troubled with severe headaches, and I suppose that keeps him away.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He isn\u0027t up to my standard,\" said Randolph, consequentially. \"He comes of a low family.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You and he have been together a good deal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, I have found him of some service, but I have paid for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet this was the boy who, at his own personal risk, had obtained for Randolph the prize at the skating-match. Privately, Sam thought Randolph ungrateful, but he was, nevertheless, pleased at having distanced Tom in the favor of the young aristocrat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After an hour, spent in various amusements, one of the company took her place at the piano, and dancing began.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now is your time, Luke,\" said Linton. \"Secure a partner. It is only a quadrille.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I feel a little nervous,\" said Luke. \"Perhaps I had better wait till the second dance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, nonsense! Don\u0027t be afraid.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, Randolph, with a great flourish, had invited Florence to dance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you,\" she answered, taking his arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Randolph took his place with her as head couple. Linton and Annie Comray faced them. To Randolph\u0027s amazement, Luke and Fanny Pratt took their places as one of the side couples. Randolph, who was aware that Luke had never taken lessons, remarked this with equal surprise and disgust. His lip curled as he remarked to his partner: \"Really, I didn\u0027t know that Luke Larkin danced.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nor I,\" answered Florence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sorry he is in our set.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why?\" asked Florence, regarding him attentively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He will probably put us out by his clownish performance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wouldn\u0027t it be well to wait and see whether he does or not?\" responded Florence, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Randolph shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I pity his partner, at any rate,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I can\u0027t join in any such conversation about one of my guests,\" said Florence, with dignity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here the first directions were given, and the quadrille commenced.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Luke felt a little nervous, it must be confessed, and for that reason he watched with unusual care the movements of the head couples. He was quick to learn, and ordinarily cool and self-possessed. Besides, he knew that no one was likely to criticize him except Randolph. He saw the latter regarding him with a mocking smile, and this stimulated him to unusual carefulness. The result was that he went through his part with quite as much ease and correctness as any except the most practiced dancers. Florence said nothing, but she turned with a significant smile to Randolph. The latter looked disappointed and mortified. His mean disposition would have been gratified by Luke\u0027s failure, but this was a gratification he was not to enjoy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The dance was at length concluded, and Luke, as he led his partner to a seat, felt that he had scored a success.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I have the pleasure of dancing with you next time, Florence?\" asked Randolph.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, but I should not think it right to slight my other guests,\" said the young lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then Luke came up and preferred the same request. He would not have done so if he had not acquitted himself well in the first quadrille.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Florence accepted with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was not aware that dancing was one of your accomplishments, Luke,\" she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nor I, till this evening,\" answered Luke. \"There stands my teacher,\" and he pointed to Linton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You do credit to your teacher,\" said Florence. \"I should not have known you were such a novice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Luke was pleased with this compliment, and very glad that he had been spared the mortification of breaking down before the eyes of his ill-wisher, Randolph Duncan. It is hardly necessary to say that he did equally well in the second quadrille, though he and Florence were head couple.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next dance was the Virginia Reel. Here Florence had Linton for a partner, and Luke secured as his own partner a very good dancer. From prudence, however, he took his place at some distance from the head, and by dint of careful watching he acquitted himself as well as in the quadrilles.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Really, Luke, you are doing wonderfully well,\" said Linton, when the dance was over. \"I can hardly believe that you have taken but one lesson, and that from so poor a teacher as I am.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I couldn\u0027t have had a better teacher, Lin,\" said Luke. \"I owe my success to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you say Luke couldn\u0027t dance?\" asked Sam Noble of Randolph, later in the evening.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He can\u0027t,\" answered Randolph, irritably.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He gets along very well, I am sure. He dances as well as I do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That isn\u0027t saying much,\" answered Randolph, with a sneer. He could not help sneering even at his friends, and this was one reason why no one was really attached to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sam walked away offended.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The party broke up at half-past ten. It was an early hour, but late enough considering the youth of the participants. Luke accompanied home one of the girls who had no brother present, and then turned toward his own home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had nearly reached it, when a tall figure, moving from the roadside, put a hand on his shoulder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are Luke Larkin?\" said the stranger, in questioning tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is the tin box safe?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, sir.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is all—for the present,\" and the stranger walked quickly away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who can he be,\" thought Luke, in wonder, \"and why should he have trusted a complete stranger—and a boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Evidently there was some mystery about the matter. Had the stranger come honestly by the box, or was Luke aiding and abetting a thief? He could not tell.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3006/82968.html","bookId":285,"creation":"Aug 1, 2019 8:43:06 AM","modification":"Aug 1, 2019 8:43:06 AM"}
