{"id":81552,"no":30,"title":"Page 30","content":"\u003cp\u003e“Looks like it.”\u003c/p\u003e\n\u003cp\u003e“You don’t mind?” she pressed.\u003c/p\u003e\n\u003cp\u003e“A man’s got to pay his gambling debts.” He leaned forward and scooped up cubes and playing pieces. “Want to try another game?”\u003c/p\u003e\n\u003cp\u003eShe did, but there was a problem. “I can’t think of anything else to bet.”\u003c/p\u003e\n\u003cp\u003e“How about one of my Laughing Gods against that fireberyl comb you wear?” Severance suggested very casually. Cidra was shocked.\u003c/p\u003e\n\u003cp\u003e“They’re both much too valuable.”\u003c/p\u003e\n\u003cp\u003e“That’s what will make the game interesting.”\u003c/p\u003e\n\u003cp\u003eShe shook her head firmly. “I couldn’t.”\u003c/p\u003e\n\u003cp\u003e“The way you just played, I doubt you’ll have any trouble winning again. You seem to have gotten the hang of Free Market.”\u003c/p\u003e\n\u003cp\u003eThat much was true. She was obviously improving rapidly as a player. The strange euphoria was still bubbling in her blood. Recklessly she smiled. “All right, Severance, it’s a bet.” He smiled too. That smile with all the teeth. Then he coolly and methodically proceeded to demolish her in the next game.\u003c/p\u003e\n\u003cp\u003eWhen it was over, Cidra sat feeling dazed by the loss. She realized belatedly that she hadn’t expected to lose. The first win had given her an unnatural confidence in her new skills. It was an unwarranted confidence, apparently. Severance said nothing, waiting for the impact of the loss to sink in. Wistfully she watched him retrieve the last sardite chip from her side of the table, and then she lifted her gaze to his. “You won.”\u003c/p\u003e\n\u003cp\u003e“Ummm.” He sat waiting quietly, with an air of grave expectation.\u003c/p\u003e\n\u003cp\u003e“I suppose you want the comb.”\u003c/p\u003e\n\u003cp\u003e“It’s customary to pay a gambling debt immediately.”\u003c/p\u003e\n\u003cp\u003e“Of course.” She straightened proudly, determined to be good loser. She fished the beautiful fireberyl comb from her coronet of hair and slowly held it out to him.\u003c/p\u003e\n\u003cp\u003eHe took it from her and examined it. The trapped flames of the polished fireberyl flickered in the light. “It’s very beautiful.”\u003c/p\u003e\n\u003cp\u003e“My parents gave it to me when they saw me off on my quest.” Memories of her mother’s gentle, understanding expression as she had said good-bye to her daughter tugged at Cidra for the first time in days. Her father had been equally compassionate. Their understanding was tempered with the natural emotional distance a Harmonic instinctively maintained with a Wolf. They had both known that this farewell had been coming since the day Cidra was born. Their young Wolf cub had to find her own way. They could offer shelter, but they could not provide a true way of life for her.\u003c/p\u003e\n\u003cp\u003eSeverance looked up. “So your parents know you’re on your way to Renaissance?”\u003c/p\u003e\n\u003cp\u003eSurprised by the question, Cidra hesitated and then admitted, “No. I don’t think so. I implied that I would begin my search on Lovelady. They would have had doubts about the wisdom of going to Renaissance.”\u003c/p\u003e\n\u003cp\u003e“Especially as a passenger in a mail ship.”\u003c/p\u003e\n\u003cp\u003e“They might have had doubts,” Cidra said firmly, “but they would not have argued with my decision. I am an adult. They respect that status. I simply did not wish to cause them undue concern. Renaissance has a reputation for being very dangerous.”\u003c/p\u003e\n\u003cp\u003eHe studied her for a moment. “Your parents don’t know you very well, do they?”\u003c/p\u003e\n\u003cp\u003e“They are kind, intuitive people who saw to it that I had an excellent education and proper training in the Klinian laws,” Cidra informed him proudly.\u003c/p\u003e\n\u003cp\u003e“But no matter what they did, they couldn’t make you into a Harmonic. You’re a Wolf. So they don’t really know you.”\u003c/p\u003e\n\u003cp\u003e“You don’t really know me, either, Severance, so don’t make any judgments,” she heard herself retort. “You can’t ever get to know me the way Harmonics know each other. Wolves aren’t capable of that kind of communication.” She got to her feet, aware that she was trembling. Without a word she retreated into her bunk with her precious copy of Nisco’s Serenity and Ritual.\u003c/p\u003e\n\u003cp\u003eSeverance made no move to stop her. He put away the playing pieces, stashed the field, and then carefully tucked the fireberyl comb into a pouch on the utility loop that was hanging near his bunk. He decided that he, too, would read tonight. He could do without any more ale for a while.\u003c/p\u003e\n\u003cp\u003eWhen he finally stretched out to sleep, he had a last mental image of Cidra in his arms. In the fantasy she was wearing nothing except the fireberyl comb in her hair. The flames in the comb were dim compared to the flames in her eyes.\u003c/p\u003e\n\u003cp\u003eCidra spent the next couple of days working diligently on her programming project. The tensions of the first week had been far more severe than she could have imagined. Occasionally she had unpleasant visions of how much worse her situation would have been if she had accepted passage with someone such as Scates, the man who had come to her hotel room in Valentine.\u003c/p\u003e\n\u003cp\u003eThere was no doubt that living in close quarters with Teague Severance had its risks and that his mood could be somewhat volatile, but she was learning to manage the unstable atmosphere between them. And she had to admit that Severance was able to deal with the situation. He seemed grimly determined to get to Renaissance without losing his temper or his self-control again. She knew instinctively that he placed a high value on his own sense of control. He was the pilot in command, and the concept was important to him. His sense of responsibility ran deep.\u003c/p\u003e\n\u003cp\u003eThey were four days away from Renaissance when disaster struck in the lav. Cidra had just turned on the spray and was anticipating her all-important evening shower when she realized that something had gone wrong. The spray bubbled briefly from the surrounding walls and then died. She stared at the disappearing drops of water in dismay. Keeping the length of her showers to a minimum was hard enough; to do without a spray altogether was unthinkable.\u003c/p\u003e\n\u003cp\u003e“Severance!”\u003c/p\u003e\n\u003cp\u003eHe was at the panel in an instant, sounding alarmed. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003eClutching the panel to shield her naked body, she peered around the edge. “The spray fixture is broken. There’s no water.”\u003c/p\u003e\n\u003cp\u003eHis alert, concerned expression turned into one of sardonic interest. “Is that a fact?”\u003c/p\u003e\n\u003cp\u003e“Severance, this is serious! We’re four days from Renaissance. What are we going to do?”\u003c/p\u003e\n\u003cp\u003e“Use a lot of deodorant?”\u003c/p\u003e\n\u003cp\u003eShe glared at him. “This is not a joke.”\u003c/p\u003e\n\u003cp\u003e“I know it’s not for you. Anyone who spends a couple of hours a day in the lav probably finds this a full-scale catastrophe.”\u003c/p\u003e\n\u003cp\u003e“I do not spend two hours a day in here, and it is a full-scale catastrophe. I have never gone one day in my life without a proper bath.” \u003c/p\u003e","sourceLink":"https://allnovel.net/sweet-starfire-lost-colony-1/page-30.html","bookId":1802,"creation":"Oct 5, 2019 4:36:11 PM","modification":"Oct 5, 2019 4:36:11 PM"}
