{"id":81571,"no":49,"title":"Page 49","content":"\u003cp\u003e“That’s a little extreme under the circumstances.”\u003c/p\u003e\n\u003cp\u003e“I work for you, Teague Severance. Have you forgotten our contract? I have sworn my loyalty to the firm of Severance Pay, Ltd. It would have been a breach of that act to have let Racer use me. He only wanted to add to your suffering, you know,” Cidra explained, lowering her voice. “And it would have bothered you greatly. Not because I was your lover but because you feel responsible for me. Racer didn’t seem to understand that I am merely your employee.”\u003c/p\u003e\n\u003cp\u003e“Lately I’ve had trouble understanding that myself.” Severance reached out and wrapped his palms around the nape of Cidra’s neck. He pulled her close and kissed her with a quick roughness that betrayed the tension he had hidden so well all morning. “Sweet Harmony in hell, Cidra Rainforest. I’ve never been so scared in my life as I was when I saw that dracon eyeing you. Don’t ever, ever do that to me again.”\u003c/p\u003e\n\u003cp\u003eShe smiled mistily as he freed her. “I’ll make a note not to go swimming in the near future.”\u003c/p\u003e\n\u003cp\u003eHe stared down at her for another long moment, as if he wanted to say more. Instead he released her and turned toward the tent. “I guess I’d better get moving.”\u003c/p\u003e\n\u003cp\u003eSurprised, she stepped after him. “What are we going to do?” A sloshing sound reminded her of her wet boots. Gingerly Cidra sat down on the charred ground and removed them, shaking out the river water.\u003c/p\u003e\n\u003cp\u003e“I’m going after Racer.” He spoke from inside the tent.\u003c/p\u003e\n\u003cp\u003e“Going after him? But, Severance, he’s got a skimmer. He’s long gone.”\u003c/p\u003e\n\u003cp\u003e“He’s got a skimmer that’s in trouble, although he may not realize it yet. It’s going to take a while for the fuel cells to start losing power.” Severance reappeared outside the tent carrying his travel pack. He put it down on the ground, crouched beside it, and began going through the contents.\u003c/p\u003e\n\u003cp\u003eCidra watched him. “Why should the fuel cells fail on his skimmer?”\u003c/p\u003e\n\u003cp\u003e“After I shot Overcash, Racer ducked into the cabin. I had a clear view of the engine section of the skimmer. And I got in a couple more shots. One cell was glowing yellow when the skimmer took off up the river. Yellow means that the charge was already starting to diminish. Racer will realize what’s happening when he calms down and has a chance to check his controls.”\u003c/p\u003e\n\u003cp\u003e“Then what will he do?”\u003c/p\u003e\n\u003cp\u003e“Panic, I hope. He tends to lose his nerve when the sardite’s down. I’m counting on him losing it this time too.”\u003c/p\u003e\n\u003cp\u003e“You speak from past experience with the man?” Cidra asked carefully.\u003c/p\u003e\n\u003cp\u003e“This isn’t the first time we’ve tangled.”\u003c/p\u003e\n\u003cp\u003e“You said he was once your partner.”\u003c/p\u003e\n\u003cp\u003eSeverance removed a thin blade from the travel pack and slipped it into his utility loop. “The partnership dissolved the day he left me to fight my way out of a sinkswamp here on Renaissance.”\u003c/p\u003e\n\u003cp\u003eCidra sucked in her breath. “He’s tried to kill you before?”\u003c/p\u003e\n\u003cp\u003e“Not exactly. We had a mail run into a field camp that was doing some work in the swamps up north. There was trouble with the sled. Always something going wrong with machinery on this damned planet. The sled started to slip into a sinkswamp with both of us on board. When we realized what was happening, we managed to attach a wire line to a tree. The plan was to use it to climb to safety. Racer went first. When he reached the tree, the line broke. He was getting set to toss me another one when he saw the killweaver. The things live in the swamps, and this one apparently decided to investigate the activity going on over its nest. It surfaced beside the sled. Big ugly thing with very unappealing pincers. Racer took one look and fled.”\u003c/p\u003e\n\u003cp\u003e“Leaving you behind?”\u003c/p\u003e\n\u003cp\u003e“Guess he figured I didn’t have much chance, anyway. He made it to the company’s field camp a couple of hours later and somehow neglected to mention that he had left me behind in the sled sitting on top of a killweaver’s web. I think he was busy realizing just how convenient the whole setup was. In one fell swoop he was now sole owner of the ship and all our equipment. It was somewhat disconcerting for him when I wandered into camp an hour behind him. We’ve made a practice of avoiding each other ever since.”\u003c/p\u003e\n\u003cp\u003e“How did you get away from the….the killweaver?” Cidra struggled with the dim recollection of a holotape she had once seen of a huge spider shape. Another typical Renaissance horror. Even the wild parts of Lovelady seemed tame in comparison to this planet.\u003c/p\u003e\n\u003cp\u003e“It’s a short story. The trick with dracons and killweavers is to distract them with a convenient meal.”\u003c/p\u003e\n\u003cp\u003eCidra shuddered. “What did you find to feed the kill-weaver?”\u003c/p\u003e\n\u003cp\u003e“Something equally mean and ugly.” Severance got to his feet, having removed several small objects from his travel pack.\u003c/p\u003e\n\u003cp\u003e“But you didn’t find this, uh, distraction until after the web had burned your hands?”\u003c/p\u003e\n\u003cp\u003e“It never pays to be slow on Renaissance.” He dropped the travel pack and checked the contents of his loop.\u003c/p\u003e\n\u003cp\u003e“Are we leaving already?” Cidra asked.\u003c/p\u003e\n\u003cp\u003e“I’m leaving. You’re staying here.”\u003c/p\u003e\n\u003cp\u003eShe shot to her feet. “Severance, no!”\u003c/p\u003e\n\u003cp\u003eHis face softened. “You’ll be all right. There’s enough charge left on the deflectors to last until nightfall. I’ll be back by then. Just stay inside the screens and don’t wander outside for any reason. Understood?”\u003c/p\u003e\n\u003cp\u003e“I refuse to stay here alone while you take off info that jungle!”\u003c/p\u003e\n\u003cp\u003e“I’ll be staying close to the riverbank. Don’t worry, Racer won’t get far. When he realizes that the fuel cells are faltering, he’ll bring the skimmer into shore, set up the deflector screens, and call for help. I intend to arrive long before help does.”\u003c/p\u003e\n\u003cp\u003e“I don’t like this,” Cidra began earnestly.\u003c/p\u003e\n\u003cp\u003e“I’m not especially thrilled with the mess we’re in, either. But since I’m the one who got us into it, I’d better start fixing things. Once the fuel cells start to go, the skimmer won’t have enough power to stay afloat, but there’ll still be enough of a charge left in them to keep the deflectors and a comm unit going for quite a while. I can float the skimmer back down the river if necessary. Relax, I’m supposed to be the one whose good with his hands, remember?” He walked toward her, coming to a halt a short distance away. “Don’t look at me like that, Cidra. It’s going to be all right. This is my fault and I’ll take care of it.”\u003c/p\u003e\n\u003cp\u003e“It’s hardly your fault!” \u003c/p\u003e","sourceLink":"https://allnovel.net/sweet-starfire-lost-colony-1/page-49.html","bookId":1802,"creation":"Oct 5, 2019 4:36:11 PM","modification":"Oct 5, 2019 4:36:11 PM"}
