{"id":81387,"no":115,"title":"Page 115","content":"\u003cp\u003e“Och, away wi’ ye. I’ll mind the bairnie. I dinna mean to go down yet a while.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Auntie.” She kissed the old woman’s cheek, and turned to go—then, with a glance at her aunt, took a step back toward the hearth, and unobtrusively slid the cradle a little farther from the fire.\u003c/p\u003e\n\u003cp\u003eTHE AIR OUTSIDE was fresh, and smelled of new grass and barbecue smoke. It made her want to skip down the brick paths, blood humming in her veins. She could hear the strains of music from the house, and the sound of Roger’s voice. A quick turn in the fresh air, and then she’d go in; perhaps Roger would be ready for a break by then, and they could—\u003c/p\u003e\n\u003cp\u003e“Brianna!” She heard her name, hissed from behind the wall of the kitchen garden, and turned, startled, to find her father’s head poking cautiously round the corner, like a ruddy snail. He jerked his chin at her and disappeared.\u003c/p\u003e\n\u003cp\u003eShe cast a quick look over her shoulder to be sure no one was watching, and hastily whisked round the wall into the shelter of a sprouting carrot bed, to find her father crouched over the recumbent body of one of the black maids, who was sprawled atop a pile of aging manure with her cap over her face.\u003c/p\u003e\n\u003cp\u003e“What on earth—” Brianna began. Then she caught a whiff of alcohol, pungent among the garden scents of carrot tops and sun-ripened manure. “Oh.” She squatted next to her father, skirts ballooning over the brick path.\u003c/p\u003e\n\u003cp\u003e“It was my fault,” he explained. “Or some of it, at least. I left a cup under the willows, still half-full.” He nodded toward the brick path, where one of Jocasta’s punch cups lay on its side, a sticky drop of liquid still clinging to its rim. “She must have found it.”\u003c/p\u003e\n\u003cp\u003eBrianna leaned over and sniffed at the edge of the maid’s rumpled cap, now fluttering with heavy snores. Rum punch was the prevailing odor, but she also detected the richly sour scent of ale and the smooth tang of brandy. Evidently the slave had been thriftily disposing of any dregs left in the cups she collected for washing.\u003c/p\u003e\n\u003cp\u003eShe lifted the ruffled edge of the cap with a cautious finger. It was Betty, one of the older maids, her face slack-lipped and drop-jawed in alcoholic stupor.\u003c/p\u003e\n\u003cp\u003e“Aye, it wasna the first half-cup she’d had,” Jamie said, seeing her. “She must have been reeling. I canna think how she walked so far from the house, in such condition.”\u003c/p\u003e\n\u003cp\u003eBrianna glanced back, frowning. The brick-walled kitchen garden was near to the cookhouse, but a good three hundred yards from the main house, and separated from it by a rhododendron hedge, and several flower beds.\u003c/p\u003e\n\u003cp\u003e“Not just how,” Brianna said, and tapped a finger against her lip in puzzlement. “Why?”\u003c/p\u003e\n\u003cp\u003e“What?” He had been frowning at the maid, but glanced up at her tone. She rose, and tilted her head at the snoring woman.\u003c/p\u003e\n\u003cp\u003e“Why did she walk out here? It looks like she’s been tippling all day—she can’t have been dashing out here with every cup; somebody would have noticed. And why bother? It’s not like it would be hard to do without being noticed. If I were drinking leftovers, I’d just stay there under the willows and gulp it.”\u003c/p\u003e\n\u003cp\u003eHer father gave her a startled look, replaced at once with one of wry amusement.\u003c/p\u003e\n\u003cp\u003e“Would ye, then? Aye, that’s a thought. But perhaps there was enough in the cup that she thought to enjoy it in peace.”\u003c/p\u003e\n\u003cp\u003e“Maybe so. But there are surely hiding places nearer the river than this.” She reached down and scooped up the empty cup. “What was it you were drinking, rum punch?”\u003c/p\u003e\n\u003cp\u003e“No, brandy.”\u003c/p\u003e\n\u003cp\u003e“Then it wasn’t yours that pushed her over the edge.” She held out the cup, tilting it so he could see the dark dregs at the bottom. Jocasta’s rum punch was made not only with the usual rum, sugar, and butter but also with dried currants, the whole concoction being mulled with a hot poker. The result not only was dark brown in color but always left a heavy sediment in the cups, composed of tiny grains of soot from the poker and the charred remnants of incinerated currants.\u003c/p\u003e\n\u003cp\u003eJamie took the cup from her, frowning. He inserted his nose into the cup and took a deep sniff, then stuck a finger into the liquid and put it in his mouth.\u003c/p\u003e\n\u003cp\u003e“What is it?” she asked, seeing his face change.\u003c/p\u003e\n\u003cp\u003e“Punch,” he said, but ran the tip of his tongue back and forth over his teeth, as though to cleanse it. “With laudanum, I think.”\u003c/p\u003e\n\u003cp\u003e“Laudanum! Are you sure?”\u003c/p\u003e\n\u003cp\u003e“No,” he said frankly. “But there’s something in it beyond dried currants, or I’m a Dutchman.” He held the cup out to her, and she took it, sniffing furiously. She couldn’t make out much beyond but the sweet, burned smell of rum punch. Perhaps there was a sharper tang, something oily and aromatic . . . perhaps not.\u003c/p\u003e\n\u003cp\u003e“I’ll take your word for it,” she said, wiping the tip of her nose on the back of her hand. She glanced at the supine maid. “Shall I go look for Mama?”\u003c/p\u003e\n\u003cp\u003eJamie squatted beside the maid and inspected her carefully. He lifted a limp hand and felt it, listened to her breathing, then shook his head.\u003c/p\u003e\n\u003cp\u003e“I canna say whether she’s drugged, or only drunk—but I dinna think she’s dying.”\u003c/p\u003e\n\u003cp\u003e“What shall we do with her? We can’t leave her lie.”\u003c/p\u003e\n\u003cp\u003eHe looked down at the slave, frowning.\u003c/p\u003e\n\u003cp\u003e“No, of course not.” He stooped and—quite gently—gathered the woman into his arms. One worn shoe fell off, and Brianna retrieved it from the brick walk.\u003c/p\u003e\n\u003cp\u003e“D’ye ken where she sleeps?” Jamie asked, gingerly negotiating his stertorous burden round the edge of a cucumber frame.\u003c/p\u003e\n\u003cp\u003e“She’s a house slave; she must sleep in the attics.”\u003c/p\u003e\n\u003cp\u003eHe nodded, tossing his head to dislodge a strand of red hair that had blown into his mouth.\u003c/p\u003e\n\u003cp\u003e“Verra well, then, we’ll go round the stables and see can we get up the back stair without bein’ seen. Go across, will ye, lass, and signal me when it’s clear.”\u003c/p\u003e\n\u003cp\u003eShe tucked shoe and cup under her cloak to hide them, then ducked quickly out onto the narrow walk that led past the kitchen garden, branching to cookhouse and necessary. She glanced to and fro, feigning casualness. There were a few people within sight, near the paddock, but that was some distance away—and all of them had their backs to her, engrossed with Mr. Wylie’s black Dutch horses.\u003c/p\u003e\n\u003cp\u003eAs she turned to signal to her father, she caught sight of Mr. Wylie himself, escorting a lady into the stable block. A gleam of gold silk—wait, it was her mother! Claire’s pale face turned momentarily in her direction, but her attention was fixed on something Wylie was saying, and she didn’t notice her daughter on the path.\u003c/p\u003e\n\u003cp\u003eBree hesitated, wanting to call to her mother, but couldn’t do so without attracting unwanted attention. Well, at least she knew where Claire was. She could come and fetch her mother to help—once they had Betty safely tucked away.\u003c/p\u003e\n\u003cp\u003eWITH A FEW CLOSE alarms and near-misses, they managed to get Betty up to the long attic room she shared with the other female house servants. Jamie, panting, dumped her unceremoniously on one of the narrow beds, then wiped his sweating brow on his coat sleeve, and, long nose wrinkled, began fastidiously to dust manure crumbs from the skirts of his coat.\u003c/p\u003e\n\u003cp\u003e“So, then,” he said, a little grumpily. “She’s safe, aye? If ye tell one of the other slaves she’s taken ill, I suppose no one who matters will find out.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Da.” She leaned close and kissed his cheek. “You’re a sweet man.”\u003c/p\u003e\n\u003cp\u003e“Oh, aye,” he said, sounding resigned. “My bones are filled wi’ honey, to be sure.” Still, he didn’t look displeased. “Have ye got that shoe, still?” He took off the maid’s remaining shoe, and placed it neatly beside its fellow beneath the bed, then drew the coarse woolen blanket gently over the woman’s feet, grimy white in their thick stockings.\u003c/p\u003e\n\u003cp\u003eBrianna checked the maid’s condition; so far as she could tell, everything seemed all right; the woman was still snoring wetly, but in a reassuringly regular manner. As they tiptoed cautiously back down the rear stairs, she gave Jamie the silver cup.\u003c/p\u003e\n\u003cp\u003e“Here. Did you know this was one of Duncan’s cups?”\u003c/p\u003e\n\u003cp\u003e“No.” He arched one brow, frowning. “What d’ye mean, ‘Duncan’s cups’?”\u003c/p\u003e\n\u003cp\u003e“Aunt Jocasta had a set of six cups made for Duncan, for a wedding present. She showed them to me yesterday. See?” She turned the cup in her hand, to show him the engraved monogram—“I,” for “Innes,” with a tiny fish, its scales beautifully detailed, swimming round the letter.\u003c/p\u003e\n\u003cp\u003e“Does that help?” she asked, seeing his brow crease in interest.\u003c/p\u003e\n\u003cp\u003e“It may.” He pulled out a clean cambric handkerchief and wrapped the cup carefully before putting it in the pocket of his coat. “I’ll go and find out. Meanwhile, can ye find Roger Mac?”\u003c/p\u003e\n\u003cp\u003e“Of course. Why?”\u003c/p\u003e\n\u003cp\u003e“Well, it does occur to me that if yon Betty drank part of a cup of rum punch and was laid out like a fish on a slab, then I should like to find whoever drank the first part of it, and see if they’re in a similar condition.” He raised one brow at her. “If the punch was drugged, then likely it was meant for someone, aye? I thought perhaps you and Roger Mac might look round discreetly for bodies in the shrubbery.”\u003c/p\u003e\n\u003cp\u003eThat aspect of the matter hadn’t struck her in the rush to get Betty upstairs.\u003c/p\u003e\n\u003cp\u003e“All right. I should find Phaedre or Ulysses first, though, and tell one of them that Betty’s sick.”\u003c/p\u003e\n\u003cp\u003e“Aye. If ye speak with Phaedre, ye might inquire whether yon Betty is an opium-eater as well as a bibber. Though I will say I think it unlikely,” he added dryly.\u003c/p\u003e\n\u003cp\u003e“So do I,” she said, matching his tone. She took his point, though; perhaps the punch had not been drugged, but Betty had taken the laudanum herself, on purpose. It was possible; she knew Jocasta kept some in the stillroom. If she had taken it herself, though, was it for recreational use—or had the maid perhaps intended to commit suicide?\u003c/p\u003e\n\u003cp\u003eShe frowned at Jamie’s back, as he paused at the foot of the stair, listening before stepping onto the landing. It was easy enough to think that the misery of slavery might dispose one to suicide. At the same time, honesty compelled her to admit that Jocasta’s house servants lived reasonably well; better than any number of free individuals—black or white—that she’d seen in Wilmington and Cross Creek.\u003c/p\u003e\n\u003cp\u003eThe servants’ room was clean, the beds rough but comfortable. The house servants had decent clothes, even to shoes and stockings, and more than enough to eat. As for the sorts of emotional complications that could lead one to contemplate suicide—well, those weren’t limited to slaves.\u003c/p\u003e\n\u003cp\u003eMuch more likely that Betty was merely a toper, of the sort who would drink anything even vaguely alcoholic—the reek of her garments certainly suggested as much. But in that case, why take the risk of stealing laudanum, on a day when the wedding party insured there would be an abundance of every kind of drink?\u003c/p\u003e\n\u003cp\u003eShe was reluctantly forced to the same conclusion that she was sure her father had already reached. Betty had taken the laudanum—if that’s what it was, she reminded herself—by accident. And if that was so . . . whose cup had she drunk from? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-115.html","bookId":1858,"creation":"Oct 5, 2019 4:35:45 PM","modification":"Oct 5, 2019 4:35:45 PM"}
