{"id":81348,"no":76,"title":"Page 76","content":"\u003cp\u003e“No, he is not.” His hand dropped from my shoulder, and he circled the table, until he stood by Beardsley’s side.\u003c/p\u003e\n\u003cp\u003e“If ye understand me, man—close your eye,” he said quietly. There was a moment’s silence, and Beardsley’s bloodshot eye fixed on Jamie’s face—with undeniable intelligence. The lid closed slowly, then rose again.\u003c/p\u003e\n\u003cp\u003eJamie turned to me.\u003c/p\u003e\n\u003cp\u003e“Go,” he said. “Let it be his choice. If—or if not—I will call for ye.”\u003c/p\u003e\n\u003cp\u003eMy knees were trembling, and I knotted my hands in the folds of my skirt.\u003c/p\u003e\n\u003cp\u003e“No,” I said. I looked at Beardsley, then swallowed hard and shook my head. “No,” I said again. “I—if you . . . you must have a witness.”\u003c/p\u003e\n\u003cp\u003eHe hesitated a moment, but then nodded.\u003c/p\u003e\n\u003cp\u003e“Aye, you’re right.” He glanced at Mrs. Beardsley. She stood stock-still, hands knotted under her apron, eyes darting from me to Jamie to her husband and back. Jamie shook his head briefly, then turned back to the stricken man, squaring his shoulders.\u003c/p\u003e\n\u003cp\u003e“Blink once for yes, twice for nay,” he said. “You understand?”\u003c/p\u003e\n\u003cp\u003eThe eyelid lowered without hesitation.\u003c/p\u003e\n\u003cp\u003e“Listen, then.” Jamie drew a deep breath and began to speak, in a flat, unemotional tone of voice, his eyes steady on the ruined face and the fierce gaze of its open eye.\u003c/p\u003e\n\u003cp\u003e“Ye ken what has happened to you?”\u003c/p\u003e\n\u003cp\u003eBlink.\u003c/p\u003e\n\u003cp\u003e“Ye ken that my wife is a physician, a healer?”\u003c/p\u003e\n\u003cp\u003eThe eye rolled in my direction, then back to Jamie. Blink.\u003c/p\u003e\n\u003cp\u003e“She says that you have suffered an apoplexy, that the damage canna be mended. You understand?”\u003c/p\u003e\n\u003cp\u003eA huffing sound came from the lopsided mouth. This was not news. Blink.\u003c/p\u003e\n\u003cp\u003e“Your foot is putrid. If it is not taken off, you will rot and die. You understand?”\u003c/p\u003e\n\u003cp\u003eNo response. The nostrils flared suddenly, moist, questing; then the air was expelled with a snort. He had smelled the rot; had suspected, perhaps, but not known for sure that it came from his own flesh. Not ’til now. Slowly, a blink.\u003c/p\u003e\n\u003cp\u003eThe quiet litany went on, statements and questions, each a shovelful of dirt, taken from a deepening grave. Each ending with the inexorable words, “You understand?”\u003c/p\u003e\n\u003cp\u003eMy hands and feet and face felt numb. The odd sense of sanctuary in the room had altered; it felt like a church, but no longer a place of refuge. A place now in which some ritual took place, leading to a solemn, predestined end.\u003c/p\u003e\n\u003cp\u003eAnd it was predestined, I understood. Beardsley had made his choice long since—perhaps even before we arrived. He had had a month in that purgatory, after all, suspended in the cold dark between heaven and earth, in which to think, to come to grips with his prospects and make his peace with death.\u003c/p\u003e\n\u003cp\u003eDid he understand?\u003c/p\u003e\n\u003cp\u003eOh, yes, very well.\u003c/p\u003e\n\u003cp\u003eJamie bent over the table, one hand on Beardsley’s arm, a priest in stained linen, offering absolution and salvation. Mrs. Beardsley stood frozen in the fall of light from the window, a stolid angel of denunciation.\u003c/p\u003e\n\u003cp\u003eThe statements and the questions came to an end.\u003c/p\u003e\n\u003cp\u003e“Will ye have my wife take your foot and tend your wounds?”\u003c/p\u003e\n\u003cp\u003eOne blink, then two, exaggerated, deliberate.\u003c/p\u003e\n\u003cp\u003eJamie’s breathing was audible, the heaviness in his chest making a sigh of each word.\u003c/p\u003e\n\u003cp\u003e“Do ye ask me to take your life?”\u003c/p\u003e\n\u003cp\u003eThough one half of his face sagged lifeless and the other was drawn and haggard, there was enough of Beardsley left to show expression. The workable corner of the mouth turned up in a cynical leer. What there is left of it, said his silence. The eyelid fell—and stayed shut.\u003c/p\u003e\n\u003cp\u003eJamie closed his own eyes. A small shudder passed over him. Then he shook himself briefly, like a man shaking off cold water, and turned to the sideboard where his pistols lay.\u003c/p\u003e\n\u003cp\u003eI crossed swiftly to him, laying a hand on his arm. He didn’t look at me, but kept his eyes on the pistol he was priming. His face was white, but his hands were steady.\u003c/p\u003e\n\u003cp\u003e“Go,” he said. “Take her out.”\u003c/p\u003e\n\u003cp\u003eI looked back at Beardsley, but he was my patient no longer; his flesh beyond my healing or my comfort. I went to the woman and took her by the arm, turning her toward the door. She came with me, walking mechanically, and did not turn to look back.\u003c/p\u003e\n\u003cp\u003eTHE OUTDOORS SEEMED UNREAL, the sunlit yard unconvincingly ordinary. Mrs. Beardsley pulled free of my grip and headed toward the barn, walking fast. She glanced back over her shoulder at the house, then broke into a heavy run, disappearing through the open barn door as though fiends were after her.\u003c/p\u003e\n\u003cp\u003eI caught her sense of panic and nearly ran after her. I didn’t, though; I stopped at the edge of the yard and waited. I could feel my heart beating, slowly, thumping in my ears. That seemed unreal, too.\u003c/p\u003e\n\u003cp\u003eThe shot came, finally, a small flat sound, inconsequent amid the soft bleating of goats from the barn and the rustle of chickens scratching in the dirt nearby. Head, I wondered suddenly, or heart, and shuddered.\u003c/p\u003e\n\u003cp\u003eIt was long past noon; the cold, still air of the morning had risen and a chilly breeze moved through the dooryard, stirring dust and wisps of hay. I stood and waited. He would have paused, I thought, to say a brief prayer for Beardsley’s soul. A moment passed, two, then the back door opened. Jamie came out, took a few steps, then stopped, bent over, and vomited.\u003c/p\u003e\n\u003cp\u003eI started forward, in case he needed me, but no. He straightened and wiped his mouth, then turned and walked across the yard away from me, heading for the wood.\u003c/p\u003e\n\u003cp\u003eI felt suddenly superfluous, and rather oddly affronted. I had been at work no more than moments before, deeply absorbed in the practice of medicine. Connected to flesh, to mind and body; attentive to symptoms, aware of pulse and breath, the vital signs. I hadn’t liked Beardsley in the least, and yet I had been totally engaged in the struggle to preserve his life, to ease his suffering. I could still feel the odd touch of his slack, warm flesh on my hands.\u003c/p\u003e\n\u003cp\u003eNow my patient was abruptly dead, and I felt as though some small part of my body had been amputated. I thought I was perhaps a trifle shocked.\u003c/p\u003e\n\u003cp\u003eI glanced at the house, my original sense of caution superseded by distaste—and something deeper. The body must be washed, of course, and decently laid out for burial. I had done such things before—with no great qualms, if without enthusiasm—and yet I found myself now with a great reluctance to go back into the place.\u003c/p\u003e\n\u003cp\u003eI’d seen death by violence—and many much more distasteful than this was likely to have been. Death was death. Whether it came as passage, as parting, or in some cases, as dearly desired release . . . Jamie had freed Beardsley very suddenly from the prison of his stricken body; did his spirit perhaps still linger in the house, having not yet realized its freedom?\u003c/p\u003e\n\u003cp\u003e“You are being superstitious, Beauchamp,” I said severely to myself. “Stop it at once.” And yet I didn’t take a step toward the house, but hovered in the yard, keyed up like an indecisive hummingbird.\u003c/p\u003e\n\u003cp\u003eIf Beardsley was beyond my help, and Jamie in no need of it, there was still one who might require it. I turned my back on the house and went toward the barn.\u003c/p\u003e\n\u003cp\u003eThis was no more than a large open shed with a loft, fragrantly dark and filled with hay and moving shapes. I stood in the doorway until my eyes adjusted. There was a stall in one corner, but no horse. A rickety fence with a milking stanchion made a goat pen in the other corner; she was crouched inside it, on a pile of fresh straw. Half a dozen goats crowded and bumped around her, jostling and nibbling at the fringes of her shawl. She was little more than a hunched shape, but I caught the brief shine of a wary eye in the shadows.\u003c/p\u003e\n\u003cp\u003e“Ith it over?” The question was asked softly, barely audible above the quiet grunting and bleating.\u003c/p\u003e\n\u003cp\u003e“Yes.” I hesitated, but she seemed in no need of my support; I could see better now—she had a small kid curled in her lap, her fingers stroking the small, silky head. “Are you quite all right, Mrs. Beardsley?”\u003c/p\u003e\n\u003cp\u003eSilence, then the heavy figure shrugged and settled, some tension seeming to leave her.\u003c/p\u003e\n\u003cp\u003e“I thcarthely know,” she said softly. I waited, but she neither moved nor spoke further. The peaceful company of the goats seemed as likely as mine to be a comfort to her, so I turned and left them, rather envying her the warm refuge of the barn and her cheerful companions.\u003c/p\u003e\n\u003cp\u003eWe had left the horses in the dooryard, still saddled, tethered to an alder sapling. Jamie had loosened their girths and removed their saddlebags when he went to fetch my medicine box, but had not taken the time to unsaddle them. I did that now; plainly it would be some time yet before we could leave. I took off the bridles as well, and hobbled them, turning them loose to graze on the winter-brown grass that still grew thickly at the edge of the pines.\u003c/p\u003e\n\u003cp\u003eThere was a hollowed half-log on the western side of the house, plainly meant to serve as a horse trough, but it was empty. Welcoming the chore for the delay it allowed me, I raised water from the well and emptied bucket after bucket into the trough.\u003c/p\u003e\n\u003cp\u003eWiping my wet hands on my skirt, I looked round for further useful occupation, but there wasn’t any. No choice, then. I braced myself, poured more water into the bucket, dropped in the hollow drinking gourd that stood on the edge of the well, and carried it back around the house, concentrating fiercely on not spilling any, in order to avoid thinking about the prospects within.\u003c/p\u003e\n\u003cp\u003eWhen I raised my eyes, I was startled to see that the back door stood open. I was sure it had been closed before. Was Jamie inside? Or Mrs. Beardsley?\u003c/p\u003e\n\u003cp\u003eKeeping a wary distance, I craned my neck to peep into the kitchen, but as I sidled closer, I heard the steady chuff of a spade shifting dirt. I went around the far corner to find Jamie digging near a mountain-ash tree that stood by itself in the yard, a short distance from the house. He was still in shirtsleeves, and the wind blew the stained white linen against his body, ruffling the red hair over his face.\u003c/p\u003e\n\u003cp\u003eHe brushed it back with one wrist, and I saw with a small sense of shock that he was crying. He wept silently and somehow savagely, attacking the soil as though it were an enemy. He caught my movement from a corner of his eye, and stopped, swiping a blood-smeared shirtsleeve quickly across his face, as though to wipe away sweat from his brow.\u003c/p\u003e\n\u003cp\u003eHe was breathing hoarsely, loud enough to hear from a distance. I came silently and offered him the gourd of water, along with a clean handkerchief. He didn’t meet my eyes, but drank, coughed, drank again, handed back the gourd, and blew his nose, gingerly. It was swollen, but no longer bleeding.\u003c/p\u003e\n\u003cp\u003e“We won’t sleep here tonight, will we?” I ventured to ask, seating myself on the chopping block that stood under the ash tree.\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e“God, no,” he said hoarsely. His face was blotched and his eyes bloodshot, but he had firm hold of himself. “We’ll see him decently buried and go. I dinna mind if we sleep cold in the wood again—but not here.” I agreed wholeheartedly with that notion, but there was one thing more to be considered.\u003c/p\u003e\n\u003cp\u003e“And . . . her?” I asked delicately. “Is she in the house? The back door is open.”\u003c/p\u003e\n\u003cp\u003eHe grunted, and thrust in his shovel.\u003c/p\u003e\n\u003cp\u003e“No, that was me. I’d forgot to leave it open when I came out before—to let the soul go free,” he explained, seeing my upraised eyebrow.\u003c/p\u003e\n\u003cp\u003eIt was the complete matter-of-factness with which he offered this explanation, rather than the fact that it echoed my own earlier notion, that made the hairs prickle along my neck. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-fiery-cross-outlander-5/page-76.html","bookId":1858,"creation":"Oct 5, 2019 4:35:45 PM","modification":"Oct 5, 2019 4:35:45 PM"}
