{"id":67332,"no":11,"title":"Page 11","content":"\u003cp\u003e“I know.” Lynn suddenly seemed to find something absolutely mesmerizing about her shoes.\u003c/p\u003e\n\u003cp\u003eRuth moved past her on the porch. “I’d better go in and change.”\u003c/p\u003e\n\u003cp\u003e“Ruth,” Lynn said sharply. Ruth turned to face her. “I’m sorry about the other night. That really was an awful thing to do. I was upset and I took it out on you.”\u003c/p\u003e\n\u003cp\u003eRuth had pretty much figured that out on her own. “Paul and I connected, so no harm done.”\u003c/p\u003e\n\u003cp\u003e“I know, and I’m glad you did because I think Paul is great. I know he’s a soldier and all, but he’s a nice guy. I only met him that one time, but I could see he’s ten times the man Clay will ever be. He’s the kind of guy I hope to meet.”\u003c/p\u003e\n\u003cp\u003ePaul had obviously impressed her during their brief exchange. She wondered what they’d talked about.\u003c/p\u003e\n\u003cp\u003e“All’s well that ends well,” Ruth said.\u003c/p\u003e\n\u003cp\u003e“Shakespeare, right?” Lynn asked. “In other words, all is forgiven?”\u003c/p\u003e\n\u003cp\u003eRuth laughed and nodded, then started into the house.\u003c/p\u003e\n\u003cp\u003ePaul picked her up at five-thirty and they drove to a Mexican restaurant in downtown Kent. Paul had arranged for her to meet his best friend.\u003c/p\u003e\n\u003cp\u003eCarley and Brian Hart were high school sweethearts and Brian had known Paul for most of his life.\u003c/p\u003e\n\u003cp\u003e“We go way back,” Brian said when they were introduced. He slid out of the booth and they exchanged handshakes, with Paul standing just behind Ruth, his hand on her shoulder.\u003c/p\u003e\n\u003cp\u003e“I’m pleased to meet you both.” They were a handsome couple. Carley was a delicate blonde with soulful blue eyes, and her husband was tall and muscular, as if he routinely worked out.\u003c/p\u003e\n\u003cp\u003e“We’re pleased to meet you, too,” Carley said when Ruth slipped into the booth across from her.\u003c/p\u003e\n\u003cp\u003ePaul got in beside Ruth.\u003c/p\u003e\n\u003cp\u003e“I insisted Paul introduce us,” Carley said as she reached for a chip and dipped it in the salsa. “Every time we tried to get together during his leave, he already had plans with you.”\u003c/p\u003e\n\u003cp\u003eRuth hadn’t thought of it that way, but realized she’d monopolized his time. “I guess I should apologize for that.”\u003c/p\u003e\n\u003cp\u003e“We only have the two weeks,” Paul explained.\u003c/p\u003e\n\u003cp\u003e“You’ll be back in Seattle after the training, won’t you?” Brian asked.\u003c/p\u003e\n\u003cp\u003e“Maybe, but…” Paul hesitated and glanced at Ruth.\u003c/p\u003e\n\u003cp\u003e“We only just met and…” Ruth let the rest fade away. He would be back and they’d see each other again, but only if she could accept his career in the military.\u003c/p\u003e\n\u003cp\u003eThis fourteen-day period was a testing time for them both, and at the end they had a decision to make.\u003c/p\u003e\n\u003cp\u003e“I’m giving Ruth two weeks to fall head over heels in love with me.” Paul said it as if it were a joke.\u003c/p\u003e\n\u003cp\u003e“If she doesn’t, there’s definitely something wrong with her,” Carley joked back.\u003c/p\u003e\n\u003cp\u003eRuth smiled, but she felt her heart sinking. She hadn’t made her decision yet; the truth was, she’d been putting it off until the last possible minute.\u003c/p\u003e\n\u003cp\u003eTime was dwindling and soon, in a matter of days, Paul would be leaving again. She wasn’t ready—wasn’t ready to decide and wasn’t ready for him to go.\u003c/p\u003e\n\u003cp\u003eBrian and Carley had to be home before eight because of their babysitter, so they left the restaurant first.\u003c/p\u003e\n\u003cp\u003eRuth had enjoyed the spicy enchiladas, the margarita and especially the teasing between Paul and Brian. Carley had told story after story of the two boys and their high-school exploits, and they’d all laughed and joked together.\u003c/p\u003e\n\u003cp\u003ePaul and Ruth lingered in the booth over cups of dark coffee, gazing into each other’s eyes. He’d switched places so he could sit across from her. If she’d met him under any other circumstance, there’d be no question about her feelings. None! It was so easy to fall in love with this man. In fact, it was already too late; even Paul’s mother had seen that. Ruth knew him. After all the letters and e-mails, all the conversations, she felt as if he’d become part of her life.\u003c/p\u003e\n\u003cp\u003e“I know what you’re thinking,” Paul said unexpectedly.\u003c/p\u003e\n\u003cp\u003e“What am I thinking?” she asked with amusement.\u003c/p\u003e\n\u003cp\u003e“You’re wondering why I find life in the military so attractive.”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “Close.”\u003c/p\u003e\n\u003cp\u003e“Do you want to know my answer?”\u003c/p\u003e\n\u003cp\u003eRuth was already aware of his reasons, but decided to hear him out, anyway. “Sure, go ahead.”\u003c/p\u003e\n\u003cp\u003e“I like the structure, the discipline, the knowledge that I’m doing something positive to bring about freedom and democracy in the world.”\u003c/p\u003e\n\u003cp\u003eThis was where it got troubling for Ruth.\u003c/p\u003e\n\u003cp\u003eBefore she could state her own feelings, Paul stopped her. “I know you don’t agree with me, and I accept that, but I am who I am.”\u003c/p\u003e\n\u003cp\u003e“I didn’t challenge that—I wouldn’t.”\u003c/p\u003e\n\u003cp\u003eHe stiffened, then reached for his coffee and held it at arm’s length, cupping his hands around the mug. “True enough, but the minute I started talking, you looked like you wanted to challenge my answer.”\u003c/p\u003e\n\u003cp\u003eShe hadn’t known her feelings were that transparent.\u003c/p\u003e\n\u003cp\u003e“I guess now is as good a time as any to ask where I stand with you.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” An uneasy feeling began to creep up her spine. They had only a couple of days before he was scheduled to leave, and she was going to need every minute of that time to concentrate on this relationship.\u003c/p\u003e\n\u003cp\u003e“You know what I’m asking, Ruth.”\u003c/p\u003e\n\u003cp\u003eShe did. She met his eyes. “I’m in love with you, Paul.”\u003c/p\u003e\n\u003cp\u003e“I’m in love with you, too.” He stretched his hand across the table and intertwined their fingers.\u003c/p\u003e\n\u003cp\u003eHer heart nearly sprang out of her chest with happiness and yet tears filled her eyes.\u003c/p\u003e\n\u003cp\u003eTo her astonishment, Paul laughed. “This is supposed to be a happy moment,” he told her.\u003c/p\u003e\n\u003cp\u003e“I am happy, but I’m afraid, too.”\u003c/p\u003e\n\u003cp\u003e“Of what?”\u003c/p\u003e\n\u003cp\u003e“Of you leaving again. Of your involvement in the military. Of you fighting in a war, any war.”\u003c/p\u003e\n\u003cp\u003e“It’s what I do.”\u003c/p\u003e\n\u003cp\u003e“I know.” Still, she had a hard time reconciling her emotions and beliefs with the way Paul chose to make his living.\u003c/p\u003e\n\u003cp\u003e“But you don’t like it,” he said, his voice hard.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eHe sighed harshly. “Then tell me where we go from here.”\u003c/p\u003e\n\u003cp\u003eRuth wished she knew. “I can’t answer that.”\u003c/p\u003e\n\u003cp\u003eHis eyes pleaded with her. “I can’t answer it for you, Ruth. You’re going to have to make up your mind about us.”\u003c/p\u003e\n\u003cp\u003eShe’d known it would come down to this. “I’m not sure I can. Not yet.”\u003c/p\u003e\n\u003cp\u003eHe considered her words. “When do you think you’ll be able to decide?”\u003c/p\u003e\n\u003cp\u003e“Let’s wait until you’ve finished your training and we see each other again…. We’ll both have a better idea then, don’t you think?”\u003c/p\u003e\n\u003cp\u003e“No. I might not be coming back to Seattle. I have to know soon. Now. Tonight.” He paused. “I sound unfair and pushy, and I apologize.”\u003c/p\u003e\n\u003cp\u003e“Apologize for what?” she asked. Her hand tightened around his fingers. Already she could feel him pulling away from her, if not physically, then emotionally.\u003c/p\u003e\n\u003cp\u003e“I’ve been trained to be decisive. Putting things off only leads to confusion. We’ve been writing for months.”\u003c/p\u003e\n\u003cp\u003e“Yes, I know, but—”\u003c/p\u003e\n\u003cp\u003e“We’ve spent every possible minute of my leave together.”\u003c/p\u003e\n\u003cp\u003e“Yes…”\u003c/p\u003e\n\u003cp\u003e“I love you, Ruth, but I won’t lie to you. I’m not leaving the marines. I’ve chosen the military as my career and that means I could be involved in conflicts all over the world. I have to know if you can accept that.”\u003c/p\u003e\n\u003cp\u003e“I…”\u003c/p\u003e\n\u003cp\u003e“If you can’t, we need to walk away from each other right now. I don’t want to drag this out. You decide.”\u003c/p\u003e\n\u003cp\u003eRuth didn’t want a part-time husband. “I want a man who’ll be a husband to me and a father to my children. A man of peace, not war.” She didn’t mean to sound so adamant.\u003c/p\u003e\n\u003cp\u003ePaul didn’t respond for a long moment. “I think we have our answer.” He slid out of the booth and waited for her. They’d paid their tab earlier, so there was nothing to do but walk out the door to the parking lot.\u003c/p\u003e\n\u003cp\u003eRuth wasn’t finished with the conversation, even if Paul was. “I need time,” she told him.\u003c/p\u003e\n\u003cp\u003e“The decision’s made.”\u003c/p\u003e\n\u003cp\u003e“You’re pressuring me,” she protested. “I’ve still got two days, remember?”\u003c/p\u003e\n\u003cp\u003e“It doesn’t work that way,” he said.\u003c/p\u003e\n\u003cp\u003e“But this isn’t fair!”\u003c/p\u003e\n\u003cp\u003e“I already admitted it wasn’t.” He opened the passenger door, and a moment later, he joined her in the car. “I wish now I’d waited and we still had those two days,” he said bleakly. “But we don’t.”\u003c/p\u003e\n\u003cp\u003eHe started the car and Ruth noticed that his fingers had tensed on the steering wheel.\u003c/p\u003e\n\u003cp\u003eRuth bit her lip. “Sure we do. Let’s just pretend we didn’t have this conversation and enjoy the time we have left. You can do that, can’t you?” Her voice took on a pleading quality.\u003c/p\u003e\n\u003cp\u003e“I wish I could, but…I can’t.” He inhaled deeply. “The decision is made.”\u003c/p\u003e\n\u003cp\u003eThey didn’t have much to say during the rest of the ride to the university district. When Paul pulled up in front of the rental house, Ruth noticed the lights were on, which meant Lynn was home.\u003c/p\u003e\n\u003cp\u003eThey sat side by side in the car without speaking until Paul roused himself to open the car door. He walked around to escort her from the passenger side. Silently he walked her to the porch.\u003c/p\u003e\n\u003cp\u003eRuth half expected him to kiss her. He didn’t.\u003c/p\u003e\n\u003cp\u003e“Will I see you again?” she asked as he began to walk away.\u003c/p\u003e\n\u003cp\u003eHe turned back and stood there, stiff and formal. “Probably not.”\u003c/p\u003e\n\u003cp\u003e“You mean this is it? This is goodbye…as if I meant nothing…as if we were strangers?” She felt outraged that he could just leave her like this, without a word. It was unkind and unfair…and life wasn’t that simple.\u003c/p\u003e\n\u003cp\u003e“Is there anything left to say?” he asked.\u003c/p\u003e\n\u003cp\u003e“Of course there is,” she cried. She didn’t know what, but surely there was something. Hurting and angry, Ruth gestured wildly with her arms. “You can’t be serious! Are you really going to walk away? Just like that?”\u003c/p\u003e\n\u003cp\u003e“Yes.” The word was devoid of emotion.\u003c/p\u003e\n\u003cp\u003e“You aren’t going to write me again?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eThis was unbelievable.\u003c/p\u003e\n\u003cp\u003e“Call me?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eShe glared at him. “In other words, you’re going to act as if you’d never even met me, as if I’d never mailed that Christmas card.”\u003c/p\u003e\n\u003cp\u003eA hint of a smile flickered over his tightly controlled features. “I’m certainly going to give it my best shot.”\u003c/p\u003e\n\u003cp\u003e“Fine, then,” she muttered. If he thought so little of her, then he could do as he wished. She didn’t want to be with a man who didn’t care about her feelings, just his own.\u003c/p\u003e\n\u003cp\u003eNine\u003c/p\u003e\n\u003cp\u003eTrue to Paul’s word, Ruth didn’t hear from him after their Tuesday-night dinner with Carley and Brian. The first day, her anger carried her. Then she convinced herself that Paul would contact her before he left for Camp Pendleton. Not so. Paul Gordon—correction, Sergeant Paul Gordon, USMC, was out of her life and that was perfectly fine with her. Only it wasn’t. \u003c/p\u003e","sourceLink":"https://allnovel.net/hearts-divided-cedar-cove-0/page-11.html","bookId":1946,"creation":"Oct 5, 2019 10:05:00 AM","modification":"Oct 5, 2019 10:05:00 AM"}
