{"id":67340,"no":19,"title":"Page 19","content":"\u003cp\u003e“No.” She shook her head. “Definitely not a possible scenario.”\u003c/p\u003e\n\u003cp\u003e“That leaves us with professional enemies.”\u003c/p\u003e\n\u003cp\u003e“I work in the English Department at a university,” Chloe said. “None of my fellow assistant professors are the James Bond type. In fact…” She smiled. “My sister calls them Woody Allen–wannabes.”\u003c/p\u003e\n\u003cp\u003e“Really?” He raised his eyebrows. “That bad, huh?”\u003c/p\u003e\n\u003cp\u003e“Not bad,” she protested. “They’re very nice men.”\u003c/p\u003e\n\u003cp\u003e“Hmm,” he murmured, but didn’t comment further. “So you have a sister?”\u003c/p\u003e\n\u003cp\u003e“I have two, actually.”\u003c/p\u003e\n\u003cp\u003e“Either of them have a reason to follow or threaten you?”\u003c/p\u003e\n\u003cp\u003e“No.” A swift mental image of Alexie made Chloe laugh.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I just pictured Alexie trying to stalk me. She has no patience—she’d last maybe two minutes before she confronted me and told me exactly what she wanted.”\u003c/p\u003e\n\u003cp\u003e“I think I like her.” Jake’s lips curved in a smile. “Apparently both you and Alexie inherited some of your grandmother Winifred’s character traits. You said you have two sisters?”\u003c/p\u003e\n\u003cp\u003eChloe nodded. “Alexie is my older sister. Lily is younger than me by five years. And before you ask…” She held up her hand to forestall his next question. “Lily’s on a buying trip in Europe for her lingerie boutique. And my mother’s with her, so neither of them could possibly be connected to this. Not that there’s any possibility of that, anyway,” she added. “I have a normal family, Jake. And I live a perfectly average life. I have no idea why someone would want to follow me or who this person might be.”\u003c/p\u003e\n\u003cp\u003e“Maybe you have nothing to worry about,” he said calmly. “Have you talked to the police?”\u003c/p\u003e\n\u003cp\u003e“No. What would I tell them—that I feel someone watching me?” She frowned. “They’d call in a psychiatrist and have me committed.”\u003c/p\u003e\n\u003cp\u003e“Not necessarily. They get more complaints like yours than you might think.”\u003c/p\u003e\n\u003cp\u003e“I’m guessing they file them in the ‘paranoid’ folder.” Chloe was unconvinced. “I’d rather wait until I have something concrete to tell them before I call.”\u003c/p\u003e\n\u003cp\u003e“What sort of evidence are you waiting for?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” Chloe bit her lip, considering. “Something beyond an uneasy feeling. If I’d actually seen the person who’s following me, then I’d have something solid for the police to investigate.”\u003c/p\u003e\n\u003cp\u003e“But you haven’t noticed anyone unusual or out of the ordinary? No one who made you feel uncomfortable?”\u003c/p\u003e\n\u003cp\u003eChloe instantly thought of the man wearing sunglasses outside David’s shop.\u003c/p\u003e\n\u003cp\u003e“What is it?”\u003c/p\u003e\n\u003cp\u003e“Probably nothing.”\u003c/p\u003e\n\u003cp\u003e“Tell me.”\u003c/p\u003e\n\u003cp\u003e“The other afternoon I was in downtown Seattle, picking up a gift for my grandmother’s birthday. I saw a man outside the shop who seemed to be staring at me through the glass. But I may have been imagining it. I turned to speak to David and when I looked back, the man was gone.”\u003c/p\u003e\n\u003cp\u003e“Could you describe him?”\u003c/p\u003e\n\u003cp\u003eShe called up the image of the man at David’s shop and told Jake the few things she remembered.\u003c/p\u003e\n\u003cp\u003e“Any distinctive features?” Jake asked.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Have you seen the man since then?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“But you still feel as if someone’s following you.” Jake’s words were more a confirmation than a question.\u003c/p\u003e\n\u003cp\u003eChloe stared at him. His face was set in grim lines. Despite the sunshine that poured through the window behind her, Chloe shivered. “You think I’m being stalked. You believe me.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Jake’s eyes narrowed. “You’ve gone pale as a ghost.”\u003c/p\u003e\n\u003cp\u003eChloe crossed her arms. The short-sleeved, light cotton sweater she wore over her sleeveless summer dress suddenly wasn’t heavy enough to warm her. “Telling you about it has somehow made it more real.”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to scare you more than you already are, Chloe.” Jake stretched across the table and took her hand, folding it between his palms. The heat from his hands warmed her chilled fingers and reached past the fear to stir the sexual awareness that always simmered just below the surface when he was near. “We’ll find out who the man is, why he’s following you and what he wants.”\u003c/p\u003e\n\u003cp\u003e“But I didn’t know the man I saw through the window. I have no idea who he is or why he’d follow me.”\u003c/p\u003e\n\u003cp\u003e“First things first. We should tell the police. Even though you don’t have a lot of information, they can at least take a report and establish a file. Who knows?” Jake shrugged. “Maybe something you tell them will fit into a bigger puzzle, since we have no idea what connection you have with this man.”\u003c/p\u003e\n\u003cp\u003e“I have a one o’clock lecture, but after that I’m free for the rest of the afternoon. I’ll drive downtown to the Seattle Police Department when I’m finished.”\u003c/p\u003e\n\u003cp\u003e“I’ll make a couple of calls. I’m sure they’ll send an officer out here to talk with you.”\u003c/p\u003e\n\u003cp\u003e“I’d rather meet the officer off campus. I’d like to keep this from my colleagues and students, if possible.”\u003c/p\u003e\n\u003cp\u003e“All right.” Jake looked at his watch. “We’d better leave if you’re going to make your one o’clock class.”\u003c/p\u003e\n\u003cp\u003e“Is it that late already?” Chloe checked her own watch, slid out of the booth and grabbed her purse, waiting while Jake paid their bill.\u003c/p\u003e\n\u003cp\u003eHe took her arm as they left the restaurant, surveying the student and faculty pedestrians as they crossed the campus.\u003c/p\u003e\n\u003cp\u003e“As first dates go, this has been memorable,” he said when they reached her office at Liberty Hall. He leaned against the doorjamb, waiting for her.\u003c/p\u003e\n\u003cp\u003eChloe slipped her lecture notes and two volumes of poetry into her briefcase and rejoined him. “Are you telling me most women you take out for pizza don’t require bodyguard services?” she asked wryly.\u003c/p\u003e\n\u003cp\u003e“Not usually, no.” He looked sideways at her and grinned. Sunlight shafted through the high windows at the end of the hall and burnished his dark hair. Chloe couldn’t help smiling back. She felt safer with him nearby.\u003c/p\u003e\n\u003cp\u003eShe touched his hand. “Thank you,” she said softly. “I didn’t realize how worried I’ve been. I feel safer just knowing you’re taking me seriously.”\u003c/p\u003e\n\u003cp\u003eHis eyes darkened and he covered her hand with his, trapping her fingers against his warm skin. “I’m glad.”\u003c/p\u003e\n\u003cp\u003eA door slammed down the hall, the noise breaking the charged moment between them, and Chloe slipped her hand from his. “I’d better go.”\u003c/p\u003e\n\u003cp\u003e“I’ll walk with you.”\u003c/p\u003e\n\u003cp\u003eJake fell into step beside her as they left Liberty Hall and walked the short distance to her classroom. She said goodbye and entered the lecture hall on the lower level; Jake followed her, stopping on the threshold to peruse the room. Directly in front of him was a speaker’s table where Chloe was arranging a couple of books and a sheaf of notes. Beyond the small instructor area, theater seats rose in tiers to a set of upper doors where students were entering. The room was filling quickly. Satisfied that Chloe was safe for the moment, Jake stepped outside, lowered the doorstop to keep the door open and moved to the shade of a walnut tree several yards across the lawn. He dropped onto a bench beneath the big old tree and pulled out his cell phone to call his office.\u003c/p\u003e\n\u003cp\u003e“Morrissey Demolition.”\u003c/p\u003e\n\u003cp\u003e“Barbara, I need you to cancel my afternoon appointments.”\u003c/p\u003e\n\u003cp\u003e“Sure, boss. Should I reschedule?”\u003c/p\u003e\n\u003cp\u003e“No. Tell them I’m dealing with an emergency situation and you’ll call tomorrow to arrange another time.”\u003c/p\u003e\n\u003cp\u003e“All right. Everything okay?”\u003c/p\u003e\n\u003cp\u003e“Everything’s fine. I should be in the office late this afternoon. Thanks, Barbara.” He hung up and dialed the cell-phone number for Gray Stewart, an old friend and a detective with the Seattle Police Department. While he waited for Gray to answer, he watched Chloe through the open hall door. She walked back and forth as she spoke, pausing to ask and answer questions, unmistakably passionate about the subject under discussion, whatever it might be.\u003c/p\u003e\n\u003cp\u003e“Hello.”\u003c/p\u003e\n\u003cp\u003e“Gray, it’s Jake. I’ve got a problem. I think whoever’s been following me has started stalking a woman I’m seeing.”\u003c/p\u003e\n\u003cp\u003e“The brunette in the Tribune photo?”\u003c/p\u003e\n\u003cp\u003eJake groaned out loud. “Has the entire world seen that picture?”\u003c/p\u003e\n\u003cp\u003e“Probably all of Seattle, at least,” Gray said, clearly amused.\u003c/p\u003e\n\u003cp\u003e“Well, hell.” He paused. “Yeah, it’s the same woman. I just had lunch with her and she told me she’s felt someone watching her, off and on, since a day or so after the picture was in the paper.”\u003c/p\u003e\n\u003cp\u003e“The timing’s pretty suspicious. Anything else happen to her? Any threatening letters or a dead rat left on her doorstep?”\u003c/p\u003e\n\u003cp\u003e“No. And I don’t want her to know about the letter and the blown-apart sewer rat I got. I’d like you to talk to her, though.”\u003c/p\u003e\n\u003cp\u003e“All right. Tell her to come to the station this afternoon.”\u003c/p\u003e\n\u003cp\u003e“I’d rather take her myself and meet you somewhere outside your office. She’s teaching a class right now, but we could be there by two-thirty.”\u003c/p\u003e\n\u003cp\u003e“All right. Meet me at Rosa’s Downtown at two-thirty. And you’re buying my coffee and doughnuts. You still owe me twenty bucks from the last poker game.”\u003c/p\u003e\n\u003cp\u003e“You got it.”\u003c/p\u003e\n\u003cp\u003eFor the next hour, Jake returned messages and caught up on business calls, sitting under the walnut tree. He stood up and waited inside the doorway when Chloe dismissed class. As she collected her books and purse, he assessed the students leaving through the exit at the top of the tiered seats. None of them did anything to rouse his suspicions; they all appeared to be typical college freshmen. Students still crowded the aisle leading to the exit above when Chloe joined him.\u003c/p\u003e\n\u003cp\u003e“I called the Seattle P.D. and made arrangements for you to talk to Gray Stewart.”\u003c/p\u003e\n\u003cp\u003e“Is he the officer handling harassment reports?”\u003c/p\u003e\n\u003cp\u003e“Not exactly.” Jake took her briefcase. “Gray and I went to high school together. After we graduated, I enlisted in the Marine Corps and he joined the Seattle P.D. He’s a detective now.”\u003c/p\u003e\n\u003cp\u003e“I see.”\u003c/p\u003e\n\u003cp\u003e“I’m parked this way.” He pointed toward the visitors’ lot.\u003c/p\u003e\n\u003cp\u003e“My car’s in the faculty lot in the opposite direction.” Chloe reached for her briefcase. “Thanks for all your help, Jake.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I’ll drive you downtown. We’ll come back and pick up your car when you’re finished talking with Gray.”\u003c/p\u003e\n\u003cp\u003e“I can’t let you do that,” she protested. “I’m sure you must have a dozen ways to spend your afternoon that would be more fun than waiting for me in a police station.”\u003c/p\u003e\n\u003cp\u003e“Nope, not a thing.” He took her arm and turned her toward the lot where he’d left his car. “Besides, Gray’s meeting us at Rosa’s Downtown, a restaurant near his office. I told him I’d come with you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/hearts-divided-cedar-cove-0/page-19.html","bookId":1946,"creation":"Oct 5, 2019 10:05:00 AM","modification":"Oct 5, 2019 10:05:00 AM"}
