{"id":67326,"no":5,"title":"Page 5","content":"\u003cp\u003ePaul wore a stunned look.\u003c/p\u003e\n\u003cp\u003e“That was…very nice,” Ruth managed after a moment.\u003c/p\u003e\n\u003cp\u003ePaul nodded in agreement, then cleared his throat. “Very.”\u003c/p\u003e\n\u003cp\u003e“Should I admit I was afraid of what would happen when we met?” she asked.\u003c/p\u003e\n\u003cp\u003e“Afraid why? Of what?”\u003c/p\u003e\n\u003cp\u003e“I didn’t know what to expect.”\u003c/p\u003e\n\u003cp\u003e“Me, neither.” He slid his hand down her spine and moved a step away from her. “I’d built up this meeting in my mind.”\u003c/p\u003e\n\u003cp\u003e“I did, too,” she whispered.\u003c/p\u003e\n\u003cp\u003e“I was so afraid you could never live up to my image of you,” Paul told her. “I figured we could meet and I’d get you out of my system. I’d buy you dinner, thank you for your letters and e-mails—and that would be the end of it. No woman could possibly be everything I’d envisioned you to be. But you are, Ruth, you are.”\u003c/p\u003e\n\u003cp\u003eAlthough the wind and rain were chilly, his words were enough to warm her from head to foot.\u003c/p\u003e\n\u003cp\u003e“I didn’t believe you could be what I’d imagined, either, and I was right,” Ruth said.\u003c/p\u003e\n\u003cp\u003e“You were?” He seemed crestfallen.\u003c/p\u003e\n\u003cp\u003eShe nodded. “Paul, you’re even more wonderful than I’d realized.” At his relieved expression, she said, “I underestimated how strong my feelings for you are. Look at me, I’m shaking.” She held out her hand as evidence of how badly she was trembling after his kiss.\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I’ve been in life-and-death situations and I didn’t flinch. Now, one evening with you and my stomach’s full of butterflies.”\u003c/p\u003e\n\u003cp\u003e“That’s lack of sleep.”\u003c/p\u003e\n\u003cp\u003e“No,” he said, and took her by the shoulders. “That was what your kiss did to me.” His eyes glittered as he stared down at her.\u003c/p\u003e\n\u003cp\u003e“What should we do?” she asked uncertainly.\u003c/p\u003e\n\u003cp\u003e“You’re the one with reservations about falling for a guy in the service.”\u003c/p\u003e\n\u003cp\u003eHer early letters had often referred to her feelings about exactly that. Ruth lowered her gaze. “The fundamental problem hasn’t changed,” she said. “But you’ll eventually get out, won’t you?”\u003c/p\u003e\n\u003cp\u003eHe hesitated, and his dark eyes—which had been so warm seconds before—seemed to be closing her out. “Eventually I’ll leave the marines, but you should know it won’t be anytime in the near future. I’m in for the long haul, and if you want to continue this relationship, the sooner you accept that, the better.”\u003c/p\u003e\n\u003cp\u003eRuth didn’t want their evening to end on a negative note. When she’d answered his letter that first time, she’d known he was a military man and it hadn’t stopped her. She’d gone into this with her eyes wide open. “I don’t have to decide right away, do I?”\u003c/p\u003e\n\u003cp\u003e“No,” he admitted. “But—”\u003c/p\u003e\n\u003cp\u003e“Good,” she said, cutting him off. She couldn’t allow their differences to come between them so quickly. She sensed that Paul, too, wanted to push all that aside. When she slid her arms around his waist and hugged him, he hugged her back. “You’re exhausted. Let’s meet in the morning. I’ll take you over to visit my grandmother and we can talk some more then.”\u003c/p\u003e\n\u003cp\u003eRuth rested her head against his shoulder again and Paul kissed her hair. “You’re making this difficult,” he said.\u003c/p\u003e\n\u003cp\u003e“I know. I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Me, too,” he whispered.\u003c/p\u003e\n\u003cp\u003eRuth realized they’d need to confront the issue soon. She could also see that settling it wasn’t going to be as easy as she’d hoped.\u003c/p\u003e\n\u003cp\u003eFour\u003c/p\u003e\n\u003cp\u003ePaul met Ruth at the Seattle terminal at ten the following morning and they walked up the ramp to board the Bremerton ferry. The hard rain of the night before had yielded to glorious sunshine.\u003c/p\u003e\n\u003cp\u003eUnlike the previous evening, when Paul and Ruth had talked nonstop through a three-hour dinner, it seemed that now they had little to say. The one big obstacle in their relationship hung between them. They sat side by side on the wooden bench and sipped hot coffee as the ferry eased away from the Seattle dock.\u003c/p\u003e\n\u003cp\u003e“You’re still thinking about last night, aren’t you?” Ruth said, carefully broaching the subject after a lengthy silence. “About you being in the military, I mean, and my objections to the war in Iraq?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Yeah, there’s the political aspect and also the fact that you don’t seem comfortable with the concept of military life,” he said.\u003c/p\u003e\n\u003cp\u003e“I’m not, really, but we’ll work it out,” she assured him, and reached for his free hand, entwining their fingers. “We’ll find a way.”\u003c/p\u003e\n\u003cp\u003ePaul didn’t look as if he believed her. But after a couple of moments, he seemed to come to some sort of decision. He brought her hand to his lips. “Let’s enjoy the time we have today, all right?”\u003c/p\u003e\n\u003cp\u003eRuth smiled in agreement.\u003c/p\u003e\n\u003cp\u003e“Tell me about your grandmother.”\u003c/p\u003e\n\u003cp\u003eRuth was more than willing to change the subject. “This is my paternal grandmother, and she’s lived in Cedar Cove for the past thirty years. She and my grandfather moved there from Seattle after he retired because they wanted a slower pace of life. I barely remember my grandfather Sam. He died when I was two, before I had any real memories of him.”\u003c/p\u003e\n\u003cp\u003e“He died young,” Paul commented sympathetically.\u003c/p\u003e\n\u003cp\u003e“Yes…My grandmother’s been alone for a long time.”\u003c/p\u003e\n\u003cp\u003e“She probably has good friends in a town like Cedar Cove.”\u003c/p\u003e\n\u003cp\u003e“Yes,” Ruth said. “And she’s still got friends she’s had since the war. It’s something I admire about my grandmother,” she continued. “Not only because she speaks three languages fluently and is one of the most intelligent women I know. She’s my inspiration. Ever since I can remember, she’s been helping others. Even though she’s in her eighties, Grandma’s involved with all kinds of charities and social groups. When I enrolled at the University of Washington, I intended for the two of us to get together often, but I swear her schedule’s even busier than mine.”\u003c/p\u003e\n\u003cp\u003ePaul grinned at her. “I know what you mean. It’s the same in my family.”\u003c/p\u003e\n\u003cp\u003eBy the time they stepped off the Bremerton ferry and took the foot ferry across to Cedar Cove, it was after eleven. They stopped at a deli, where Paul bought a loaf of fresh bread and a bottle of Washington State gewürztraminer to take with them. At quarter to twelve, they trudged up the hill toward her grandmother’s duplex on Poppy Lane.\u003c/p\u003e\n\u003cp\u003eWhen they arrived, Helen greeted them at the front door and eagerly ushered Paul and Ruth into the house. Ruth hugged her grandmother, whose white hair was cut stylishly short. Now in her early eighties, Helen was thinner than the last time Ruth had visited and somehow seemed more fragile. Her grandmother hugged her back, then paused to give Paul an embarrassingly frank look. Ruth felt her face heat as her grandmother spoke.\u003c/p\u003e\n\u003cp\u003e“So, you’re the young man who’s captured my granddaughter’s heart.”\u003c/p\u003e\n\u003cp\u003e“Grandma, this is Paul Gordon,” Ruth said hurriedly, gesturing toward Paul.\u003c/p\u003e\n\u003cp\u003e“This is the soldier you’ve been writing to, who’s fighting in Afghanistan?”\u003c/p\u003e\n\u003cp\u003e“I am.” Paul’s response sounded a bit defensive, Ruth thought. He obviously preferred not to discuss it.\u003c/p\u003e\n\u003cp\u003eIn an effort to ward off any misunderstanding, Ruth added, “My grandfather was a soldier when Grandma met him.”\u003c/p\u003e\n\u003cp\u003eHelen nodded, and a faraway look stole over her. It took her a moment to refocus her attention on Ruth. “Come, both of you,” she said, stepping between them. She wrapped her arm around Ruth’s waist. “I set the table outside. It’s such a beautiful afternoon, I thought we’d eat on the patio.”\u003c/p\u003e\n\u003cp\u003e“We brought some bread and a bottle of wine,” Ruth said. “Paul got them.”\u003c/p\u003e\n\u003cp\u003e“Perfect. Thank you, Paul.”\u003c/p\u003e\n\u003cp\u003eWhile Ruth sliced the fresh-baked bread, he opened the wine, then helped her grandmother carry the salad plates outside. An apple pie cooled on the kitchen counter and the scent of cinnamon permeated the sunlit kitchen.\u003c/p\u003e\n\u003cp\u003eThey chatted throughout the meal; the conversation was light and friendly as they lingered over their wine. Every now and then Ruth caught her grandmother staring at Paul with the strangest expression on her face. Ruth didn’t know what to make of this. It almost seemed as if her grandmother was trying to place him, to recall where she’d seen him before.\u003c/p\u003e\n\u003cp\u003eHelen seemed to read Ruth’s mind. “Am I embarrassing your beau, sweetheart?” she asked with a half smile.\u003c/p\u003e\n\u003cp\u003eRuth resisted informing her grandmother that Paul wasn’t her anything, especially not her beau. They’d had one lovely dinner together, but now their political differences seemed to have overtaken them.\u003c/p\u003e\n\u003cp\u003e“I apologize, Paul.” Helen briefly touched his hand, which rested on the table. “When I first saw you—” She stopped abruptly. “You resemble someone I knew many years ago.”\u003c/p\u003e\n\u003cp\u003e“Where, Grandma?” Ruth asked.\u003c/p\u003e\n\u003cp\u003e“In France, during the war.”\u003c/p\u003e\n\u003cp\u003e“You were in France during World War II?” Ruth couldn’t quite hide her shock.\u003c/p\u003e\n\u003cp\u003eHelen turned to her. “I haven’t spoken much about those days, but now, at the end of my life, I think about them more and more.” She pushed back her chair and stood.\u003c/p\u003e\n\u003cp\u003eRuth stood, too, thinking her grandmother was about to carry in their empty plates and serve the pie.\u003c/p\u003e\n\u003cp\u003eHelen motioned her to sit. “Stay here. There’s something I want you to see. I think perhaps it’s time.”\u003c/p\u003e\n\u003cp\u003eWhen her grandmother had left them, Ruth looked at Paul and shrugged. “I have no idea what’s going on.”\u003c/p\u003e\n\u003cp\u003ePaul had been wonderful with her grandmother, thoughtful and attentive. He’d asked a number of questions during the meal—about Cedar Cove, about her life with Sam—and listened intently when she responded. Ruth knew his interest was genuine. Together they cleared the table and returned the dishes to the kitchen, then waited for Helen at the patio table.\u003c/p\u003e\n\u003cp\u003eIt was at least five minutes before she came back. She held a rolled-up paper that appeared to be some kind of poster, old enough to have turned yellow with age. Carefully she opened it and laid it flat on the cleared table. Ruth saw that the writing was French. In the center of the poster, which measured about eighteen inches by twenty-four, was a pencil sketch of two faces: a man and a woman, whose names she didn’t recognize.\u003c/p\u003e\n\u003cp\u003e“Who’s that?” Ruth asked, pointing to the female.\u003c/p\u003e\n\u003cp\u003eHer grandmother smiled calmly. “I am that woman.”\u003c/p\u003e\n\u003cp\u003eRuth frowned. Although she’d seen photographs of her grandmother as a young woman, this sketch barely resembled the woman she knew. The man in the drawing, however, seemed familiar. Gazing at the sketch for a minute, she realized the face was vaguely like Paul’s. Not so much in any similarity of features as in a quality of…character, she supposed.\u003c/p\u003e\n\u003cp\u003e“And the man?”\u003c/p\u003e\n\u003cp\u003e“That was Jean-Claude,” Helen whispered, her voice full of pain.\u003c/p\u003e\n\u003cp\u003ePaul turned to Ruth, but she was at a complete loss and didn’t know what to tell him. Her grandfather’s name was Sam and she’d never heard of this Jean-Claude. Certainly her father had never mentioned another man in his mother’s life. \u003c/p\u003e","sourceLink":"https://allnovel.net/hearts-divided-cedar-cove-0/page-5.html","bookId":1946,"creation":"Oct 5, 2019 10:05:00 AM","modification":"Oct 5, 2019 10:05:00 AM"}
