{"id":62906,"no":4,"title":"Page 4","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You’ll be fine.” Ralston’s eyes softened when he looked at Darcy. “And I can’t go anyway. The mayor has me reinspecting all the public buildings as part of a planned overhaul of the alarm systems.”\u003c/p\u003e\n\u003cp\u003e“Panic’s spreading,” she muttered, pulling a set of keys out of her pocket. “Don’t let them keep you out all night.”\u003c/p\u003e\n\u003cp\u003e“I won’t, but I may be late. Let yourself in if I’m not there.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Thank you. I’m fine.”\u003c/p\u003e\n\u003cp\u003eFrowning, Ralston asked, “You sure?”\u003c/p\u003e\n\u003cp\u003e“Don’t worry about me. I’m good.”\u003c/p\u003e\n\u003cp\u003e“Okay, then. See you tomorrow.”\u003c/p\u003e\n\u003cp\u003eThe man left, but Jared’s jaw didn’t relax even then. “He’s a little old for you, isn’t he?”\u003c/p\u003e\n\u003cp\u003eDarcy paused in the act of rounding her desk. “Excuse me?”\u003c/p\u003e\n\u003cp\u003e“He’s what? Forty? Forty-five?”\u003c/p\u003e\n\u003cp\u003e“We’re not talking about this.” She walked right past him.\u003c/p\u003e\n\u003cp\u003eDamn it, when she got stern in that voice of hers, it made him hot. He’d just reached the point of being too occupied by his work to pay attention to her sex appeal, then Jim Ralston had fucked it all to hell by showing up and starting a territory war.\u003c/p\u003e\n\u003cp\u003eJared followed. “How long has it been over between you two?”\u003c/p\u003e\n\u003cp\u003e“Long enough.”\u003c/p\u003e\n\u003cp\u003e“For you, maybe. Not for him.”\u003c/p\u003e\n\u003cp\u003e“You’re way off base.” She strode right out of the open bay door and into the parking lot, making a beeline for a city-owned pickup truck with emblems on the door and a light bar on the roof. “He was there for me during a rough time in my life. It was never serious and it’s been over for nearly two years—not that it’s any of your damn business.”\u003c/p\u003e\n\u003cp\u003e“The hell it isn’t,” he shot back, rounding the front end and yanking open the passenger door. “If he’s going to be a problem, I have a right to know.”\u003c/p\u003e\n\u003cp\u003e“He’s not a problem. Drop it.”\u003c/p\u003e\n\u003cp\u003e“That bit about you letting yourself into his place was like a dog lifting his leg.”\u003c/p\u003e\n\u003cp\u003eShe met his gaze through the window. “You don’t have any right to my personal history. You don’t have any rights at all where I’m concerned. You’re a possible good time and that’s it. And even that’s debatable at the moment.”\u003c/p\u003e\n\u003cp\u003e“Is it, now?” He glanced at his watch, then slid into the truck and slammed the door shut. It was four thirty. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eChapter three\u003c/p\u003e\n\u003cp\u003eDarcy got behind the wheel and slid the key in the ignition, her thoughts roiling. Backing down from Jared Cameron wasn’t an option. At the tiniest show of weakness, he would steamroll right over her. And the alternative—keeping him at a distance—wasn’t an option she considered for more than a second. She wanted him. Badly. Almost desperately, if she was being honest. So, as overbearing and aggravating as he was, she was inclined to put up with his social Asperger’s if that’s what it took to have him in her bed.\u003c/p\u003e\n\u003cp\u003eThey drove to what was left of Florinda’s Dance Studio in silence. Jared’s gaze slid back and forth over the city, taking everything in. There was a story behind his precise focus, something that explained the edge to him that set him apart from other law enforcement officers she’d met. He was hyperaware and highly perceptive. He moved like a predator, with an economy of movement and lightness of stride. And he never let his guard down.\u003c/p\u003e\n\u003cp\u003eA man hunter. That’s what he was. Someone had spent a lot of money training him to be dangerous. The military, she guessed.\u003c/p\u003e\n\u003cp\u003eShe parked on the street in front of the studio and got out. There were already bulldozers on the lot and giant Dumpsters to collect the rubble. Her stomach clenched tight with grief and sadness so thick it was hard for her to swallow past it.\u003c/p\u003e\n\u003cp\u003eSucking in a deep breath, she joined Jared at the curb. He turned slowly, examining the surrounding neighborhood.\u003c/p\u003e\n\u003cp\u003eDarcy steeled her resolve and moved forward into the roofless ruins, trying to picture the place as it had once been. She was sorry it had been so long since she’d last visited. Her memories were cobwebbed from childhood. There were only faint echoes of bygone times when she and Danielle had playfully competed against one another and shared ballerina dreams.\u003c/p\u003e\n\u003cp\u003e“Adults or children?” Jared asked, breaking into her reverie.\u003c/p\u003e\n\u003cp\u003e“Excuse me?” She looked at him.\u003c/p\u003e\n\u003cp\u003eHis gaze narrowed. “Are you okay? You don’t look so good.”\u003c/p\u003e\n\u003cp\u003e“Gee, thanks.”\u003c/p\u003e\n\u003cp\u003e“Cut it out. You look”—he frowned—“sad.”\u003c/p\u003e\n\u003cp\u003e“Both adults and children,” she answered, skipping over the too-close-to-home comment. She was recovering her composure by the moment. Thanks to him, and the aura of strength and security that surrounded him. “And all styles, from ballet to hip-hop to ballroom.”\u003c/p\u003e\n\u003cp\u003e“You were a student.” It wasn’t a question.\u003c/p\u003e\n\u003cp\u003eShe took a deep breath, knowing it would be useless to deflect him. Nothing slipped by him. “A long time ago.”\u003c/p\u003e\n\u003cp\u003eHe nodded. His hands went to his hips as he looked over what was left. “Considering the size of the town, how large were the classes?”\u003c/p\u003e\n\u003cp\u003e“Five to fifteen students. The owners used to be professional dancers. People came from all over the country to study with them.” She pointed at the quaint motel across the street. “They had arrangements for out-of-towners with the Daniels family.”\u003c/p\u003e\n\u003cp\u003e“We’ll have to dig into those former students.”\u003c/p\u003e\n\u003cp\u003e“Sheriff Miller has been working on that.”\u003c/p\u003e\n\u003cp\u003eJared nodded. “Morales is on it, then.”\u003c/p\u003e\n\u003cp\u003eAt her questioning glance, he filled in, “My partner.”\u003c/p\u003e\n\u003cp\u003eShe watched him walk the perimeter of the crumbling brick walls, his cool cop’s eyes taking in everything. Her chest tightened as her past combined with her present, but she put it aside and answered his questions.\u003c/p\u003e\n\u003cp\u003eNearly an hour later, he glanced at his watch and pointed out, “It’s quarter to six.”\u003c/p\u003e\n\u003cp\u003eThere was a wealth of promise in those words and the heat in his eyes.\u003c/p\u003e\n\u003cp\u003eDarcy nodded. He would dull the pain, at least for a little while. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eTHEY MADE A quick stop at Darcy’s office, where she grabbed the files Jared had perused earlier and swapped out her work truck for a convertible BMW that was incongruous in a town filled with pickups and modest compacts.\u003c/p\u003e\n\u003cp\u003eShe glanced at him, showing no doubts or trepidation. “Your place or mine?”\u003c/p\u003e\n\u003cp\u003e“Dinner first?” he asked, because he wasn’t a completely one-track-minded Neanderthal. Okay…he was. But he didn’t want this go-round with her to be his last. If he was going to ignore his better sense, he might as well do it all the way.\u003c/p\u003e\n\u003cp\u003e“Dinner later.”\u003c/p\u003e\n\u003cp\u003eFuck yeah. “Your place, then. Mine is a motel with paper-thin walls.”\u003c/p\u003e\n\u003cp\u003e“Right.” She backed up with speedy precision, and the sleek sports car purred out of the parking lot.\u003c/p\u003e\n\u003cp\u003e“Drugstore.” He met her gaze when she glanced at him. “I didn’t come prepared for this.”\u003c/p\u003e\n\u003cp\u003eShe got to the store quick but declined to go in with him. “It’ll be all over town in a half hour anyway, but I’d rather not encourage the spread if I can help it.”\u003c/p\u003e\n\u003cp\u003eOnce he got inside the store, he realized quickly that she hadn’t been kidding. The woman at the register eyed his purchases with an avid gaze and smiled at him with a delight that rankled. If he’d been any less impatient, he would have had Darcy drive him to the next town to buy condoms. As it was, he made it in and out of the store in less than ten minutes, dropping the bag on the floorboard between his feet when he slid back into the passenger seat. Darcy was turning back onto the street before he got his seat belt on.\u003c/p\u003e\n\u003cp\u003eJared leaned his head back against the headrest and closed his eyes, relishing the slow simmer in his blood. He hadn’t been this eager to get into a woman’s pants in a very, very long time. He was also inordinately curious about Darcy’s home and what it would reveal about her. “How long have you lived in Lion’s Bay?”\u003c/p\u003e\n\u003cp\u003e“My whole life, except for a brief stint around college.”\u003c/p\u003e\n\u003cp\u003eThere was something in her voice that made him open his eyes and look at her. She’d released her ponytail from the elastic band, freeing the chocolate strands to whip around in the evening air. Her head was tilted in a way that could be described only as deeply sensual. She sought the feel of the wind rushing over her skin and through her hair as she would a lover’s caresses.\u003c/p\u003e\n\u003cp\u003eHe took a deep, slow breath. Darcy was clearly a tactile woman who wanted to be touched. And he was going to touch every inch of her, inside and out.\u003c/p\u003e\n\u003cp\u003eThey pulled up to a small, dated, one-story ranch-style home. It was so diametrically opposed to what he would have pictured her gravitating to that he thought they’d made another pit stop at first. Then she pulled into the carport on the side of the house.\u003c/p\u003e\n\u003cp\u003eHe frowned. She was modern, sexy, and fierce. He’d gotten that impression from the way she decorated her office and from the car she drove. But the house she lived in was retro and uninspired. There was a story there. He’d dig it out.\u003c/p\u003e\n\u003cp\u003eHe followed her to the back door with a deliberately moderated stride, stretching out the last moments of delicious anticipation. There was nothing in the world like the buildup to a mind-blowing orgasm, and there was no doubt that he was minutes away from having the first of many tonight.\u003c/p\u003e\n\u003cp\u003eDarcy preceded him up the utilitarian cement walkway to a matching set of three steps and a small porch. She was through the door before he reached the tiny staircase. He climbed slowly, his cock getting harder with every step he took.\u003c/p\u003e\n\u003cp\u003eWhen he reached the threshold of the open door, he paused. Took another deep breath. Let it out. He absorbed the fact that somewhere over the course of a few short hours, fucking the sexy fire inspector had become damn near necessary to his sanity.\u003c/p\u003e\n\u003cp\u003eOn an intellectual level, he understood the pull between them. He’d spent most of his life studying human behavior and pinpointing how best to hunt and kill men. He was well aware that they were all animals at their core, creatures of instinct and hormonal impetuses. He and Darcy had an explosive attraction at that base level, and neither of them was inclined to fight it. But that didn’t mean he was taking it gracefully. He needed control and unadulterated reason, and Darcy was fucking with both of those. He was hanging on by a thread, and knowing that it was going to snap at any second had him edgy and frustrated. \u003c/p\u003e","sourceLink":"https://allnovel.net/on-fire-shadow-stalkers-4/page-4.html","bookId":1921,"creation":"Oct 5, 2019 9:49:18 AM","modification":"Oct 5, 2019 9:49:18 AM"}
