{"id":84396,"no":8,"title":"Page 8","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAnyone with half a brain could tell he didn‘t have his heart in it when it came to women.‖\u003c/p\u003e\n\u003cp\u003eMe: ―I know, but what I can say? I was in love.‖\u003c/p\u003e\n\u003cp\u003eMom: ― Jenna—‖\u003c/p\u003e\n\u003cp\u003eDad: ―I think it‘s pretty funny.‖\u003c/p\u003e\n\u003cp\u003eMom: ―He‘s not your father.‖\u003c/p\u003e\n\u003cp\u003eDad: ―Thank God for that.‖\u003c/p\u003e\n\u003cp\u003eGrandpa: ―I am not deaf, Stewart, thank you very much.‖\u003c/p\u003e\n\u003cp\u003eDad: ―Glad to hear it, Max, but my name‘s Elliot. Max, what year is it?‖\u003c/p\u003e\n\u003cp\u003eMom: ―Elliot.‖\u003c/p\u003e\n\u003cp\u003eGrandpa: ―What‘s that got to do with anything?‖\u003c/p\u003e\n\u003cp\u003eDad: ―What day?‖\u003c/p\u003e\n\u003cp\u003eMom: ― Elliot.‖\u003c/p\u003e\n\u003cp\u003eDad: ―What? I‘m just orienting him. Who‘s the president, Max?‖\u003c/p\u003e\n\u003cp\u003eGrandpa: ―Nixon. Hah! Thought you‘d trip me up.‖\u003c/p\u003e\n\u003cp\u003eDad: ―You‘re sharp as a tack, Max.‖\u003c/p\u003e\n\u003cp\u003eGrandpa: ―Damn right. And, Stewart, don‘t think for one second I don‘t know you voted for that damn Kennedy.‖\u003c/p\u003e\n\u003cp\u003eMom: ―Oh, for—‖\u003c/p\u003e\n\u003cp\u003eDad (thought-bubble): Told you.\u003c/p\u003e\n\u003cp\u003eGrandpa: ―Smooth-talking, skirt-chasing son of a bitch.\u003c/p\u003e\n\u003cp\u003eScrew anything with a ho—‖\u003c/p\u003e\n\u003cp\u003eMom (stabbing her Crackberry): ―Yeah, we‘ve definitely got to be going.‖\u003c/p\u003e\n\u003cp\u003eCome to think of it, Bob, maybe Grandpa and Grandma deserved each other.\u003c/p\u003e\n\u003cp\u003ec\u003c/p\u003e\n\u003cp\u003eWhile Mom went to complain to the nurses, I tried to air-kiss Grandpa good-bye.\u003c/p\u003e\n\u003cp\u003eOnly when I got close, Grandpa‘s eyes sharpened and I knew he was seeing me-me.\u003c/p\u003e\n\u003cp\u003e―Jenna, such a sweet thing, you‘re my little sweetheart.‖ His breath reeked of ancient tobacco, that morning‘s scrambled eggs, and chest rot. ―You come back and visit your old grandpa anytime.‖\u003c/p\u003e\n\u003cp\u003e―Yeah,‖ I said, stepping back fast as he made another grab but came up short.\u003c/p\u003e\n\u003cp\u003e―Sure.‖\u003c/p\u003e\n\u003cp\u003eAnd then we were out of there, Dad peeling off to go break it up between Mom and the nurses while I ducked into the bathroom. The toilets smelled of baby powder and old farts. All the seats were higher off the ground and handicap-equipped. I huddled on a seat and clasped my arms around my stomach. If I‘d been at a computer, I‘d have e-mailed Matt, which sometimes helped, but that wasn‘t an option. My belly was twitching and my skin grafts burned as raw and fiery as they had when they were new. (Memo to Bob: What they don‘t tell you is that not only do the grafted sites kill, but the donor sites hurt as much as second-degree burns, and for just about as long. I was on fire, in one way or another, for a good year and a half.)\u003c/p\u003e\n\u003cp\u003eThe metal prong of my watchband was nowhere near sharp enough, but I had to, I had to. That patch of unblemished skin on the left, below my navel, that would be good.\u003c/p\u003e\n\u003cp\u003eYeah, yeah, come on, come on. I really worked at it, coring and digging and twisting, the skin trying to jump out of the way. Cold sweat pearled my upper lip, and a bead crawled down the back of my neck to trickle between my skin grafts. He touched me he saw me he touched me.\u003c/p\u003e\n\u003cp\u003e(Mom, howling: No, don’t you do it. . . .)\u003c/p\u003e\n\u003cp\u003eFinally, a red bead oozed and ballooned, and I sighed with relief as my blood bubbled and drew out the poison that was Grandpa.\u003c/p\u003e\n\u003cp\u003eThere was this other cutter back on the ward. She etched words and letters. But I didn‘t.\u003c/p\u003e\n\u003cp\u003eHonestly, Bob: how do you carve a scream?\u003c/p\u003e\n\u003cp\u003e11: a\u003c/p\u003e\n\u003cp\u003eMy parents started in as soon as we pulled out of the lot.\u003c/p\u003e\n\u003cp\u003eMom: ―Well, that wasn‘t so bad, was it?‖\u003c/p\u003e\n\u003cp\u003eShe said this every time. Dad always stared straight ahead and let the silence spin out.\u003c/p\u003e\n\u003cp\u003eMom (an edge creeping into her voice, daring someone to disagree): ―I thought he looked much better this time around.‖\u003c/p\u003e\n\u003cp\u003eDad: ―He was thinner and more confused, Emily. His tremor is worse and he‘s clearly not oriented. You should make him a DNR.‖\u003c/p\u003e\n\u003cp\u003eMom: ―That‘s not what he wants.‖\u003c/p\u003e\n\u003cp\u003eDad: \u0026lt;mumble\u0026gt;\u003c/p\u003e\n\u003cp\u003eMom: ―I didn‘t catch that.‖\u003c/p\u003e\n\u003cp\u003eDad: \u0026lt;silence\u0026gt;\u003c/p\u003e\n\u003cp\u003eMom: ―Excuse me?‖\u003c/p\u003e\n\u003cp\u003eDad: ―I said you‘d be doing all of us a favor if you‘d change his status to a DNR.\u003c/p\u003e\n\u003cp\u003eThat last stroke would‘ve killed him but, no, you had to pull out all the stops. Emily, you keep doing this guilt thing. Let him go.‖\u003c/p\u003e\n\u003cp\u003eMom: ―I won‘t be a party to murdering my own father.‖\u003c/p\u003e\n\u003cp\u003eDad (grunting a laugh): ―That‘s rich.‖\u003c/p\u003e\n\u003cp\u003eMom: ―What did you say? What the hell did you just say?‖\u003c/p\u003e\n\u003cp\u003eMe: ―Guys, don‘t fight. Please.‖\u003c/p\u003e\n\u003cp\u003eMom: ―He needs better care.‖\u003c/p\u003e\n\u003cp\u003eDad: ―You need to let him go.‖\u003c/p\u003e\n\u003cp\u003e―Don‘t tell me what to do with my—‖\u003c/p\u003e\n\u003cp\u003e―We can‘t afford—‖\u003c/p\u003e\n\u003cp\u003e―I promised—‖\u003c/p\u003e\n\u003cp\u003e―I wouldn‘t be surprised if he put the noose around your mother‘s neck—‖\u003c/p\u003e\n\u003cp\u003e―How dare you—‖\u003c/p\u003e\n\u003cp\u003e―Oh, look who‘s talking. First him, and then your daughter, and now you and that damned bookstore sucking us—‖\u003c/p\u003e\n\u003cp\u003e―I‘m working as hard as you are—‖\u003c/p\u003e\n\u003cp\u003e―You know where the mental illness in this family\u003c/p\u003e\n\u003cp\u003ecomes from? Not from my side, my father‘s—‖\u003c/p\u003e\n\u003cp\u003e―Don‘t you bring up—‖\u003c/p\u003e\n\u003cp\u003e―. . . still got it together—‖\u003c/p\u003e\n\u003cp\u003e―. . . my mother! Don‘t you give me that crap! Jenna‘s problems are not—!‖\u003c/p\u003e\n\u003cp\u003eLike that. On and on. They hurled daggers, and the air split and tore and howled.\u003c/p\u003e\n\u003cp\u003eMe, I screwed in my buds and turned up Nine Inch Nails until my ears bled.\u003c/p\u003e\n\u003cp\u003eHome.\u003c/p\u003e\n\u003cp\u003eMy parents stomped into the kitchen to continue their ―discussion.‖ I bolted upstairs to my room, put on Hurt, pulled up my ghost account and reread Matt‘s e-mail for that day.\u003c/p\u003e\n\u003cp\u003eTo: Jenna Lord\u003c/p\u003e\n\u003cp\u003eFrom: Lord, Matthew SSG\u003c/p\u003e\n\u003cp\u003eSubject: re: The Home Front\u003c/p\u003e\n\u003cp\u003eJenna, you should never feel bad about telling me what‘s going on. For the longest time, I would think about you every day, all alone with them and probably going crazy.\u003c/p\u003e\n\u003cp\u003eRemember when I left for basic, and only you and Mom came to see me off?\u003c/p\u003e\n\u003cp\u003eYes, I remembered. I clutched a miniature American flag and Mom sobbed. I didn‘t want Matt to worry about me but, inside, my guts shriveled. Matt was my protector. Now there was no one between me and our father, me and our parents, me and the flames.\u003c/p\u003e\n\u003cp\u003eIn the beginning, I kept thinking about that day, focusing on what I‘d left behind, looking over my shoulder at you guys, you know? But go outside the wire for the first time, and you\u0027re in the present, real fast. If you‘re not, you‘re toast. All you can afford to see is now. So you worry about that boot lying in the middle of the street, the way the shopkeeper slid back into his shop and, it‘s quiet, it‘s too damn quiet, where are all the kids? It‘s when everyone disappears that you know something bad‘s going to happen.\u003c/p\u003e\n\u003cp\u003eSo I pretend. Or maybe it‘s lying, I don‘t know. But to get through the day, you have to decide that there is no past, no family to come back to. You tell yourself that you‘re already dead and buried. . . .\u003c/p\u003e\n\u003cp\u003e―That is not true!‖ Mom‘s voice was shrill, loud enough to shatter crystal. ―You know I‘m working as hard as I—‖\u003c/p\u003e\n\u003cp\u003eDad: \u0026lt;something hard and mean I couldn‘t decipher\u0026gt; Mom: ―. . . excuse . . . for trying . . . always shooting me down!‖\u003c/p\u003e\n\u003cp\u003eDad (louder, meaner): ―Don‘t push . . .‖\u003c/p\u003e\n\u003cp\u003eMom: ―. . . who . . . screwing this week!‖\u003c/p\u003e\n\u003cp\u003eDad (really loud now): ―. . . drinking . . . won‘t be goaded . . . ‖\u003c/p\u003e\n\u003cp\u003eMom: ―. . . don‘t have the guts to—‖\u003c/p\u003e\n\u003cp\u003eThere was a sudden, massive BOOM that made the panes of my windows chatter and Mom scream.\u003c/p\u003e\n\u003cp\u003eShit. My heart scrabbled up the back of my throat. I bolted out of my room then skidded to a stop on the landing, not sure what was best. You have to understand, Bob. It‘s one thing to run to an accident that‘s already happened to see if you can help. It‘s another to jump in the car right before it wraps itself around that tree. ―Mom? Dad?‖\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e―Dad?‖ I slid onto the first step and then the second, the third. My scars writhed; the grafts between my shoulders clenched as if trying to hold me back. ―Mom?‖\u003c/p\u003e\n\u003cp\u003eMore nothing, which didn‘t necessarily mean anything one way or the other. Maybe five seconds since the BOOM, and now I had a choice: go downstairs, or back to my room and pretend I hadn‘t heard a thing.\u003c/p\u003e\n\u003cp\u003eThree guesses, Bob.\u003c/p\u003e\n\u003cp\u003ec\u003c/p\u003e\n\u003cp\u003eThe kitchen was . . . bad.\u003c/p\u003e\n\u003cp\u003eMy mother was half-cowering, her hands stalled before her face. My father was puffing like a bull. Blood and drywall smeared the knuckles of his right hand. A cloud of grit hung in the air and more sanded the kitchen floor. A fist-sized crater had caved in the wall beside Mom‘s left ear.\u003c/p\u003e\n\u003cp\u003eWithout taking his eyes off my mother, Psycho-Dad said, ―Go back upstairs, Jenna.‖\u003c/p\u003e\n\u003cp\u003e―But, but . . . Dad,‖ I said. ― Mom.‖\u003c/p\u003e\n\u003cp\u003e―I said, go upstairs.‖ Dad‘s blood dripped in big, ruby teardrops onto the cream tile.\u003c/p\u003e\n\u003cp\u003e―What part of that did you not understand?‖\u003c/p\u003e\n\u003cp\u003eI didn‘t budge, although the patchwork of new and old flesh on my belly and back tugged and fisted. I thought, fleetingly, of calling 9-1-1—but to tell them what, exactly? My psychotic father killed the kitchen wall? ―Mom, do you want me to . . . I mean, should I st—?‖\u003c/p\u003e\n\u003cp\u003e―No. Go on, Jenna.‖ Her voice was flat, eerie, almost dead. ―I‘ll be fine. Be a good girl and go to your room.‖\u003c/p\u003e\n\u003cp\u003eIf I went—if I did what they said—this was more pretend, like the ward and school, too. Pretend you haven‘t heard this, Jenna. Go listen to your music, Jenna. Tell yourself a nice story, Jenna, and everything will be just fine.\u003c/p\u003e\n\u003cp\u003eTell yourself you‘re dead, the way Matt does, so the past can‘t hurt you.\u003c/p\u003e\n\u003cp\u003eWell, Bob, I wish I could say I dialed 9-1-1. I wish I could say that I stood as a human shield and told my father that if he needed to hit anyone, he could start with me.\u003c/p\u003e\n\u003cp\u003eMatt might have done that. He certainly tried to protect me, even if that hadn‘t always worked out.\u003c/p\u003e\n\u003cp\u003eI wish there was some other story I could tell you, Bob. But you wanted the truth, remember?\u003c/p\u003e\n\u003cp\u003eSo, here it is: I was a very good girl and did as I was told.\u003c/p\u003e\n\u003cp\u003e12: a\u003c/p\u003e\n\u003cp\u003eFive minutes after I heard the garage door chug up and then down, there came the dull thud of cupboards and then the bony clatter of ice against glass. I knew what was going on. Any second now, Mom would drag out the Stoli hidden behind the jumbo-sized box of Cascade and pound back the first slug of her evening. It was always like this when she and Dad fought, and since they fought at least twice every weekend, my mom went through a lot of Stoli. \u003c/p\u003e","sourceLink":"https://allnovel.net/drowning-instinct/page-8.html","bookId":2756,"creation":"Oct 5, 2019 4:59:34 PM","modification":"Oct 5, 2019 4:59:34 PM"}
