{"id":68583,"no":13,"title":"Page 13","content":"\u003cp\u003eHi, Honey,\u003c/p\u003e\n\u003cp\u003eHow’s my best gal? I don’t know what’s happening but there’s been a lot of talk lately. If I say any more it’ll probably get cut out of this letter, so I won’t. Whatever it is, I know I’m going and soon. I feel it in my gut.\u003c/p\u003e\n\u003cp\u003eAt a time like this, I want you to understand that no matter what’s ahead of me, I’m ready. If the invasion comes to pass—although I have no idea where or when—you should know there’s a strong likelihood that I won’t make it back. Don’t get me wrong. I don’t want to die. None of us do. But this is war, Joan, and if I have breath left in me, I will fight. I’m no hero, but I am willing to do what’s required of me so that you, my parents, my brother and sisters—and everyone in Europe and America and the rest of the world—can live in freedom.\u003c/p\u003e\n\u003cp\u003eIf I had a choice, I’d be with you, making those babies we talked about. Instead, I’m all the way over on the other side of the world, ready to do whatever it takes to send Hitler straight to hell where he belongs.\u003c/p\u003e\n\u003cp\u003eRemember I love you. I can’t say it any plainer than that. If I lose my life, then please remember that nothing here on earth or in heaven will stand in the way of my love. Pray for me, my darling. Pray for us all.\u003c/p\u003e\n\u003cp\u003eHugs and kisses,\u003c/p\u003e\n\u003cp\u003eJacob\u003c/p\u003e\n\u003cp\u003eMary Jo’s voice broke as she read the last few lines.\u003c/p\u003e\n\u003cp\u003eMack couldn’t help responding to her emotion. Focusing on his task, he reached for one of the library books, flipping through it. “Oh, my goodness,” he whispered.\u003c/p\u003e\n\u003cp\u003e“What?” Mary Jo set aside the letter and walked over to his side of the table, looking over his shoulder.\u003c/p\u003e\n\u003cp\u003e“June 6 of that year was D-day. When the Allies invaded Europe on the beaches of Normandy.”\u003c/p\u003e\n\u003cp\u003e“That was his last letter,” Mary Jo repeated. She returned to her chair and slumped down. She realized what must have happened.\u003c/p\u003e\n\u003cp\u003e“Remind me what some of the previous letters say.”\u003c/p\u003e\n\u003cp\u003e“Well, he said the men were in constant drills. I know Jacob was a paratrooper with the 101st. He talked about what it was like when he made his first jump. He was scared out of his wits, but he said it got easier the more often he did it.”\u003c/p\u003e\n\u003cp\u003e“He must’ve been practicing for the landing,” Mack said. “That makes sense.”\u003c/p\u003e\n\u003cp\u003e“At the end of the letter, when he said that if anything happened to him—” Mary Jo couldn’t continue.\u003c/p\u003e\n\u003cp\u003e“What?” Mack asked, glancing up.\u003c/p\u003e\n\u003cp\u003eMary Jo blinked back tears. “He was killed, wasn’t he? He didn’t survive the invasion.”\u003c/p\u003e\n\u003cp\u003e“We don’t know that. He might have been wounded.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” she agreed with some hesitation. “But don’t you think she would’ve kept the letter notifying her of that?”\u003c/p\u003e\n\u003cp\u003e“They weren’t married, right?”\u003c/p\u003e\n\u003cp\u003e“No.” They were engaged; Jacob had left for Europe with the promise that if he made it back they’d be married.\u003c/p\u003e\n\u003cp\u003e“But if they weren’t husband and wife, the army wouldn’t have notified Joan that Jacob had been wounded,” Mack explained. “The only way she’d learn that was if someone in Jacob’s family told her.”\u003c/p\u003e\n\u003cp\u003e“There’s nothing here from his family.”\u003c/p\u003e\n\u003cp\u003e“We still can’t rule out the possibility that he might’ve been wounded. I don’t think we should leap to the conclusion that he was killed in the invasion.”\u003c/p\u003e\n\u003cp\u003e“What does the book say about D-day?” Mary Jo asked, feeling she was sadly lacking in her knowledge of Second World War history.\u003c/p\u003e\n\u003cp\u003e“Okay,” Mack said, scanning the information. “The Normandy landings by the Allied forces were the largest amphibious invasion ever undertaken. Wow, listen to this! There were one hundred and seventy-five thousand troops and over five thousand ships. I can’t even imagine what that must’ve looked like.”\u003c/p\u003e\n\u003cp\u003e“They came from England, didn’t they?” She remembered that much, anyway.\u003c/p\u003e\n\u003cp\u003eHe nodded. “The landings took place along a fifty-mile stretch of the Normandy coast and were divided into five sectors.” He listed them. “I remember something about Omaha Beach and Utah Beach in history class—and from that movie, Saving Private Ryan. That’s where the Americans landed.”\u003c/p\u003e\n\u003cp\u003e“Oh, yes… Of course.” Mary Jo had watched the movie with her brothers on DVD. The battle-scene action had upset her—and now she knew of someone who’d actually been there, part of the battle. Someone who might have died there. Someone whose handwriting she’d become familiar with, whose thoughts she was privy to.\u003c/p\u003e\n\u003cp\u003e“I believe the English and Canadians were on Juno Beach and Sword Beach,” Mack went on. “Omaha and Utah were definitely where the Americans landed.”\u003c/p\u003e\n\u003cp\u003e“Jacob—”\u003c/p\u003e\n\u003cp\u003e“Jacob wouldn’t have been on the beaches,” Mack said.\u003c/p\u003e\n\u003cp\u003e“He wouldn’t?”\u003c/p\u003e\n\u003cp\u003e“He was a paratrooper, wasn’t he?”\u003c/p\u003e\n\u003cp\u003e“Yeah. He was.” She wasn’t entirely sure what that meant, other than that he jumped out of planes.\u003c/p\u003e\n\u003cp\u003e“Then he must’ve parachuted in behind enemy lines.”\u003c/p\u003e\n\u003cp\u003e“‘Behind enemy lines,’” she echoed in a hushed voice, hardly aware she’d spoken the words aloud.\u003c/p\u003e\n\u003cp\u003eMack glanced over at her. “That doesn’t automatically mean Jacob was killed,” he said again.\u003c/p\u003e\n\u003cp\u003e“I know, but without another letter after the invasion, it doesn’t bode well.”\u003c/p\u003e\n\u003cp\u003eMack didn’t say anything for a minute or two. “Are you sure there wasn’t more than the cigar box hidden under the floorboards?” he eventually asked.\u003c/p\u003e\n\u003cp\u003eAt the time, Mary Jo had been so excited about finding the letters that she hadn’t searched further.\u003c/p\u003e\n\u003cp\u003e“Maybe we should go and look,” she said. “Want to do it now?”\u003c/p\u003e\n\u003cp\u003e“Why not.”\u003c/p\u003e\n\u003cp\u003eShe led the way into her bedroom. The more she thought about it, the more convinced she was that Jacob Dennison had been killed. Perhaps that was why Joan had hidden his letters. She couldn’t bear to part with them, but couldn’t bear to look at them, either.\u003c/p\u003e\n\u003cp\u003eMack opened the closet door and got down on all fours to remove the loose planks. Mary Jo doubted that anything else could’ve been hidden inside that small space.\u003c/p\u003e\n\u003cp\u003e“Do you have a flashlight?” Mack asked.\u003c/p\u003e\n\u003cp\u003e“Yes, hold on.” She hurried into the kitchen, opening the utility drawer and pulling out the flashlight. Linc had bought it for her and she was grateful because she’d already used it once during a power outage.\u003c/p\u003e\n\u003cp\u003eWhen she returned to the bedroom, Mary Jo found Mack lying on his stomach.\u003c/p\u003e\n\u003cp\u003e“Here,” she said, handing him the light.\u003c/p\u003e\n\u003cp\u003eMack stretched out his arm and took it from her.\u003c/p\u003e\n\u003cp\u003e“Do you see anything?” she asked.\u003c/p\u003e\n\u003cp\u003e“I think so.”\u003c/p\u003e\n\u003cp\u003e“You do?” She couldn’t keep the excitement out of her voice.\u003c/p\u003e\n\u003cp\u003e“Wait,” he said in a half grunt. Whatever he’d uncovered was in his hands now. He scrambled into a kneeling position and gave Mary Jo what appeared to be a small square with a piece of oilcloth wrapped around it.\u003c/p\u003e\n\u003cp\u003e“What is it?” she asked, hardly able to believe her eyes.\u003c/p\u003e\n\u003cp\u003e“Open it and see,” Mack said.\u003c/p\u003e\n\u003cp\u003eMary Jo knelt on the floor next to him and reverently peeled off the protective rag to discover a small brown book, closed with a tiny hinged lock. Across the top Five Year Diary was written in faded gold lettering.\u003c/p\u003e\n\u003cp\u003e“It’s Joan’s diary,” Mary Jo exclaimed. She pressed it to her heart. At last they’d have their answer. At last they’d learn the fate of the man who had become so real to them.\u003c/p\u003e\n\u003cp\u003eIf Mack hadn’t thought to look in the hiding space again, she might never have seen this diary. “Thank you, Mack,” she said, and spontaneously leaned forward to kiss him. It was a simple kiss, but it instantly stirred Mary Jo’s emotions.\u003c/p\u003e\n\u003cp\u003eNeither of them moved for a long moment and then, as if drawn together by some outside force, they simultaneously reached for each other….\u003c/p\u003e\n\u003cp\u003eThe diary was forgotten as Mary Jo threw her arms around Mack and gave herself over to his kiss.\u003c/p\u003e\n\u003cp\u003eNine\u003c/p\u003e\n\u003cp\u003eWill Jefferson was certain he’d made some headway with Shirley Bliss. After several disappointing conversations, she’d finally accepted a date. This was no small achievement on his end; Shirley had agreed to attend a Seattle art show featuring the work of Larry Knight.\u003c/p\u003e\n\u003cp\u003eWhen the invitation arrived Will knew right away that this event would interest Shirley. She’d always been impressed by his connection with a major art-world star like Knight. Will had asked her out on several other occasions in the past month and she’d had excuses every time. He’d prefer to believe she would’ve been eager to accompany him if not for her “prior engagements.”\u003c/p\u003e\n\u003cp\u003eHe knew at least one of those engagements was real, the one with her friend Melinda, Matilda…M something-or-other Sullivan. Miranda. That was it. He and Miranda had chatted briefly on the phone and she’d said she’d assist him when necessary. So far, he hadn’t needed her. She hadn’t sounded any friendlier during that conversation than she had the night of the library event. However, Will was confident he’d win her over without a lot of effort.\u003c/p\u003e\n\u003cp\u003eDespite his offer to pick her up at home, Shirley had insisted on meeting him at the Bremerton ferry. He wasn’t happy about it, but at this stage he was willing to let her set the parameters of their relationship. If she wanted to go slow, that was fine; he was a patient man.\u003c/p\u003e\n\u003cp\u003eWhen he got to Bremerton, Will found Shirley waiting in the ferry terminal.\u003c/p\u003e\n\u003cp\u003e“It’s good to see you.” He held out his hands as he walked toward her and leaned forward to kiss her cheek.\u003c/p\u003e\n\u003cp\u003e“Good to see you, too.” She stepped back quickly. He knew she wasn’t physically demonstrative, especially in public, so he wasn’t offended.\u003c/p\u003e\n\u003cp\u003eShe looked lovely, dressed in a bold black-and-teal outfit. Will felt fortunate to have her at his side. He’d taken care with his appearance, too. He recognized the importance of dressing well and didn’t mind splurging on suits that fit him properly. In his experience, money spent on a man’s wardrobe produced dividends. Clothes made the man; that might be a cliché but Will was in full agreement.\u003c/p\u003e\n\u003cp\u003e“I’m so glad you invited me,” she said as they walked onto the ferry. “I’m a big fan of Larry Knight’s.”\u003c/p\u003e\n\u003cp\u003eThey made their way to the front, getting to the choice seats before those who’d driven on could reach them. They sat on the comfortable padded benches across from each other.\u003c/p\u003e\n\u003cp\u003e“Larry Knight is a friend of mine,” Will reminded her. He didn’t want to point out that if it weren’t for him, Tanni’s boyfriend would never have gotten into that San Francisco art school. Thanks to him and his connections, Shaw was doing what he wanted—and at a considerable distance from Shirley’s daughter. Fortunately, Larry felt Shaw had talent and was willing to help him.\u003c/p\u003e\n\u003cp\u003e“I really admire his work, especially some of the recent pieces. You know, the ones that were influenced by sixties pop art.”\u003c/p\u003e\n\u003cp\u003e“Yes, he’s very talented.” Will knew he sounded a bit cursory.\u003c/p\u003e\n\u003cp\u003e“He’s more than talented,” Shirley said. “The man is a genius.” \u003c/p\u003e","sourceLink":"https://allnovel.net/1022-evergreen-place-cedar-cove-10/page-13.html","bookId":1952,"creation":"Oct 5, 2019 10:10:01 AM","modification":"Oct 5, 2019 10:10:01 AM"}
