{"id":68592,"no":22,"title":"Page 22","content":"\u003cp\u003e“I guess I forgot,” he muttered, striding toward his side of the duplex.\u003c/p\u003e\n\u003cp\u003e“Mack!” she called.\u003c/p\u003e\n\u003cp\u003eAbruptly he turned to face her. “What?”\u003c/p\u003e\n\u003cp\u003e“You’re still coming for dinner, aren’t you?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “No, thanks. I’ve lost my appetite.”\u003c/p\u003e\n\u003cp\u003eFifteen\u003c/p\u003e\n\u003cp\u003eShirley Bliss was curled up on her living room sofa, feet tucked beneath her and a cup of tea in her hand. Her friend Miranda sat across from her, holding an identical mug, also filled with steaming tea. Miranda had recently accepted a part-time job with Will Jefferson, which in Shirley’s opinion was good for Will and for Miranda. Her friend didn’t need the money, but she was at loose ends and Will could use the help. Besides, Miranda had connections that could benefit the gallery.\u003c/p\u003e\n\u003cp\u003eHer husband had been a well-known landscape artist. Miranda dabbled in art, too, although she lacked the discipline to capitalize on her talent. However, she had an excellent eye and her criticism was incisive.\u003c/p\u003e\n\u003cp\u003e“I’ve been dying to hear about your hot date with Will Jefferson,” Miranda said.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t exactly call it a hot date,” Shirley said, not meeting her eyes. Shirley felt mildly guilty for accepting Will’s invitation. In all likelihood, she would’ve found yet another excuse to refuse if not for the fact that he’d asked her to the gallery event, where she’d met Larry Knight. Shirley couldn’t turn down the opportunity of a lifetime.\u003c/p\u003e\n\u003cp\u003eWhen they did meet, Larry was everything she’d imagined and more. They hadn’t spoken long. He’d told her he’d lost his wife five years earlier, and an instant rapport had developed between them. Those minutes alone with him—despite being in a room full of people—had been magical.\u003c/p\u003e\n\u003cp\u003e“Will took you to Canlis, didn’t he?” This was one of the most exclusive and expensive restaurants in Seattle.\u003c/p\u003e\n\u003cp\u003e“Uh, yes.”\u003c/p\u003e\n\u003cp\u003eMiranda gave a short laugh. “Apparently he didn’t get the message that you don’t eat red meat.” Shirley wasn’t a full vegetarian and did on occasion eat beef, but not often and never steak.\u003c/p\u003e\n\u003cp\u003e“He got it by the end of the night.” The message about her food preferences wasn’t the only one. She couldn’t have been any clearer—she wasn’t interested in pursuing a relationship with Will Jefferson. While she appreciated everything he’d done for Tanni and Shaw, that appreciation didn’t imply any kind of romantic relationship.\u003c/p\u003e\n\u003cp\u003e“He talked you into letting him display your dragon piece.”\u003c/p\u003e\n\u003cp\u003eThat, too, had been prompted by the guilt Shirley felt over using Will, primarily in the situation with Tanni and Shaw. The dragon was a deeply personal work of art that she’d never allowed in public before and wouldn’t again. He wanted it up for the summer and she’d reluctantly consented, after initially agreeing to only one month.\u003c/p\u003e\n\u003cp\u003eTo her, the dragon symbolized the fiery grief the death of her husband had brought into her life. Shirley had made the fabric collage shortly after her husband, Jim, was killed in a motorcycle accident. Will had taken one look at it and practically begged her to let him display it. After weeks of turning him down she’d finally acquiesced, with the proviso that specific measures be taken to protect it. Will had accepted her conditions.\u003c/p\u003e\n\u003cp\u003e“Have you talked to Will since last Sunday?” Miranda asked.\u003c/p\u003e\n\u003cp\u003eShirley shook her head. His reticence was mildly surprising. He’d been finding one reason or another to contact her every other day and then…silence. Not that Shirley was complaining.\u003c/p\u003e\n\u003cp\u003e“Does the fact he hasn’t called concern you?” Miranda asked.\u003c/p\u003e\n\u003cp\u003eSipping her tea, Shirley watched her friend over the rim of her mug. “Why all these questions about me and Will Jefferson?”\u003c/p\u003e\n\u003cp\u003eMiranda shifted uncomfortably. “No reason. I was just wondering.”\u003c/p\u003e\n\u003cp\u003e“I enjoyed talking to Larry Knight for five minutes far more than I enjoyed that expensive dinner with Will.”\u003c/p\u003e\n\u003cp\u003e“But you would never have met Larry if it hadn’t been for Will.”\u003c/p\u003e\n\u003cp\u003eThat was true enough. “I know.”\u003c/p\u003e\n\u003cp\u003e“And you feel guilty about that, right?”\u003c/p\u003e\n\u003cp\u003eShirley sighed. “Right.”\u003c/p\u003e\n\u003cp\u003e“I did,” Miranda mumbled, looking decidedly un comfortable.\u003c/p\u003e\n\u003cp\u003e“You did what?” Shirley asked in confusion.\u003c/p\u003e\n\u003cp\u003e“I heard from Will.”\u003c/p\u003e\n\u003cp\u003e“Will Jefferson? He called you about work, you mean?”\u003c/p\u003e\n\u003cp\u003eMiranda shrugged. “At first I thought he wanted me for the gallery. I’ve already worked a couple of afternoons. However, this time he called and…asked me out to dinner.”\u003c/p\u003e\n\u003cp\u003eThat was encouraging news. “And?” Shirley asked, excited for her friend.\u003c/p\u003e\n\u003cp\u003e“Absolutely not.” Her reply was forceful. “I wouldn’t go out with the man my best friend’s dating if you paid me a million bucks.” She grinned. “Well, maybe I would for that kind of money.”\u003c/p\u003e\n\u003cp\u003eShirley smiled, too. “I get your drift, but you don’t have to turn him down.”\u003c/p\u003e\n\u003cp\u003eMiranda looked in every direction except Shirley’s.\u003c/p\u003e\n\u003cp\u003e“In other words, it wouldn’t bother me in the least if you wanted to go out with Will,” Shirley said, hoping to reassure her.\u003c/p\u003e\n\u003cp\u003e“But it would bother me.” Miranda spoke just as adamantly as she had earlier. “He’s interested in you. The only reason Will asked me is to get a reaction out of you.”\u003c/p\u003e\n\u003cp\u003e“Why would you think that?”\u003c/p\u003e\n\u003cp\u003eMiranda rolled her eyes. “Oh, please.”\u003c/p\u003e\n\u003cp\u003e“Okay, you could be right.” Shirley laughed. “So call him back and tell him you’ve had a change of heart.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Why?” Shirley repeated. “Because I have a feeling you might actually be interested.”\u003c/p\u003e\n\u003cp\u003e“You’ve got to be kidding! That man’s used to women falling all over themselves to make him happy. He’s had his way for far too long.” Amusement glimmered in her eyes. “You were the exception, the woman he couldn’t get.”\u003c/p\u003e\n\u003cp\u003e“Well, rumor has it there were others,” Shirley said, thinking of Grace.\u003c/p\u003e\n\u003cp\u003e“He needs a woman who’ll tell him what’s what.”\u003c/p\u003e\n\u003cp\u003e“The woman he needs, Miranda, is you,” Shirley said.\u003c/p\u003e\n\u003cp\u003e“Sorry, not interested.”\u003c/p\u003e\n\u003cp\u003eShirley wasn’t convinced that was even close to the truth. “Whatever you decide is fine with me. I don’t want him, so he’s all yours.”\u003c/p\u003e\n\u003cp\u003e“I don’t want him, either,” Miranda said stubbornly. “It would take far too much time and effort to whip him into shape. I don’t have the inclination or the patience to take on that project.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“I’m serious,” Miranda insisted.\u003c/p\u003e\n\u003cp\u003e“If you say so.” Shirley had seen the spark in Miranda’s eyes whenever Will’s name was mentioned.\u003c/p\u003e\n\u003cp\u003e“Don’t you start with me, Shirley Bliss.”\u003c/p\u003e\n\u003cp\u003e“Fine. I won’t,” she returned, smiling. Oh, her friend was interested, but at the same time she was afraid. Miranda’s marriage hadn’t been nearly as happy as Shirley’s. For all his talent, Hugh Sullivan had been a difficult and demanding personality.\u003c/p\u003e\n\u003cp\u003eA half hour later, Shirley was in the kitchen preparing a chicken-and-rice casserole dish when Tanni came home.\u003c/p\u003e\n\u003cp\u003eHer relationship with her teenage daughter was rocky and hadn’t improved much. Shirley tended to tread lightly, always unsure of Tanni’s mood. It was usually best to wait for her to speak first.\u003c/p\u003e\n\u003cp\u003e“What’s that?” her daughter asked, wrinkling her nose as she watched Shirley work.\u003c/p\u003e\n\u003cp\u003e“Dinner,” Shirley said without elaborating.\u003c/p\u003e\n\u003cp\u003e“You aren’t putting mushrooms in it, are you?”\u003c/p\u003e\n\u003cp\u003e“No.” She had planned to add mushrooms but wouldn’t now. “This is chicken with cheese and rice. Does that meet with your approval?”\u003c/p\u003e\n\u003cp\u003e“Sounds okay, I guess.”\u003c/p\u003e\n\u003cp\u003eEvidently Shirley had deflated her daughter’s indignation. She chanced a look in Tanni’s direction and took a leap of faith. “Is everything all right?” she asked tentatively.\u003c/p\u003e\n\u003cp\u003eTanni whirled around, and Shirley was shocked to see tears in her eyes. In the past she would’ve pretended she hadn’t noticed, but she couldn’t do that anymore. She reached out her arms and hugged Tanni.\u003c/p\u003e\n\u003cp\u003eTanni released a sob as she slid her arms around her mother’s waist. “He won’t even answer my text messages anymore,” she wailed.\u003c/p\u003e\n\u003cp\u003e“Shaw?”\u003c/p\u003e\n\u003cp\u003eTanni nodded jerkily.\u003c/p\u003e\n\u003cp\u003eThe two of them—Tanni and Shaw—had been together constantly for about eight months. Shirley had been nearly frantic with worry that they might become physically involved. Her fear was that they’d already crossed that line. Will Jefferson had thrown her a life preserver when—with Larry’s assistance—he’d arranged for Shaw to attend the San Francisco Art Institute.\u003c/p\u003e\n\u003cp\u003eAt first Shaw and Tanni were in frequent communication, but then as the weeks passed, Tanni heard from him less and less often. In the beginning she’d made excuses for Shaw. “He’s busy,” she’d say, keeping her cell phone close at hand.\u003c/p\u003e\n\u003cp\u003e“I thought he loved me,” Tanni blurted now. Shirley could feel her daughter struggling to control her emotions.\u003c/p\u003e\n\u003cp\u003eShe had no words of advice to offer. It didn’t matter. What Tanni needed was comfort and love, and Shirley had both in abundance.\u003c/p\u003e\n\u003cp\u003e“I volunteered at the library because I thought it would help take my mind off Shaw, but that’s no good, either.”\u003c/p\u003e\n\u003cp\u003eThe Reading with Rover program was going well, and Shirley assumed Tanni enjoyed being part of it. Every indication from Grace Harding suggested that Tanni was doing a terrific job.\u003c/p\u003e\n\u003cp\u003e“You seemed to like working with the kids.”\u003c/p\u003e\n\u003cp\u003e“I do, but I hate having to deal with Kristen.” She twisted her lip as she pronounced the other girl’s name. “She’s such a goody-goody,” Tanni spat out. “And Grace wants me to make nice. Give me a break.”\u003c/p\u003e\n\u003cp\u003e“I’m sure you’ll work it out.” Shirley couldn’t think of anything else to tell Tanni.\u003c/p\u003e\n\u003cp\u003e“I want to quit, but I can see how much the little kids love reading to the dogs. And if I left, Grace would have to remove someone from the program. That’d be wrong. Besides, I’d just go back to worrying about Shaw.”\u003c/p\u003e\n\u003cp\u003e“You can’t quit without a good reason.”\u003c/p\u003e\n\u003cp\u003eHer daughter glared up at her as if Shirley had uttered the stupidest words ever spoken by a parent. “Thanks, Mom, but I already figured that out on my own.”\u003c/p\u003e\n\u003cp\u003e“Oops, sorry.” They rarely had a conversation without Shirley making at least one critical error in judgment, saying either too much or too little.\u003c/p\u003e\n\u003cp\u003eTanni broke out of her arms. “I’m not calling or texting Shaw ever again.”\u003c/p\u003e\n\u003cp\u003eThat was no doubt for the best, although hard to pull off, especially since these kids seemed to have cell phones permanently attached to their hands.\u003c/p\u003e\n\u003cp\u003eTanni hesitated. “Not today, anyway.”\u003c/p\u003e\n\u003cp\u003e“Do you want me to hold on to your cell phone for you?” Shirley asked, thinking it might help if she kept temptation out of the way.\u003c/p\u003e\n\u003cp\u003e“No.” Tanni sent her a scornful look and went into her bedroom, closing the door. \u003c/p\u003e","sourceLink":"https://allnovel.net/1022-evergreen-place-cedar-cove-10/page-22.html","bookId":1952,"creation":"Oct 5, 2019 10:10:01 AM","modification":"Oct 5, 2019 10:10:01 AM"}
