{"id":68610,"no":40,"title":"Page 40","content":"\u003cp\u003e“Are you sure Jacob’s his actual first name?”\u003c/p\u003e\n\u003cp\u003e“That’s how he signs all his letters,” Mack said. “He—”\u003c/p\u003e\n\u003cp\u003e“Mack,” Mary Jo broke in softly.\u003c/p\u003e\n\u003cp\u003eHe glanced at her.\u003c/p\u003e\n\u003cp\u003e“If you wrote me, you’d sign your letters ‘Mack,’ right?”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“But your given name is Jerome.”\u003c/p\u003e\n\u003cp\u003eMack’s eyes widened. “I hadn’t thought of that. There were other Dennisons included on the website.”\u003c/p\u003e\n\u003cp\u003e“Let’s go back and check,” Mary Jo said excitedly.\u003c/p\u003e\n\u003cp\u003e“There’s another possibility,” Roy murmured.\u003c/p\u003e\n\u003cp\u003e“What?” Mary Jo wished now that they’d taken this to Roy earlier. Talking to him had given them a new approach. If they found Jacob, if he was still alive or even if he wasn’t but had family, they might also be able to learn Joan’s fate.\u003c/p\u003e\n\u003cp\u003e“What’s your idea?” Mack asked his father.\u003c/p\u003e\n\u003cp\u003e“You said he isn’t listed among those who were killed?”\u003c/p\u003e\n\u003cp\u003e“That we know of,” Mack said.\u003c/p\u003e\n\u003cp\u003eMary Jo felt it was important to add, “We couldn’t find a list of the wounded, though—so he might’ve been injured and shipped home.”\u003c/p\u003e\n\u003cp\u003e“But we discounted that,” Mack said. “If he was injured, he still would’ve had a way of getting in touch.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Mary Jo nodded. “If he was injured, he could’ve written eventually or had someone write for him.” Mary Jo was convinced that if Jacob had been capable of it, he would’ve found a way to tell Joan he’d survived.\u003c/p\u003e\n\u003cp\u003e“He might have been captured,” Roy suggested.\u003c/p\u003e\n\u003cp\u003e“Captured,” Mack echoed. “You mean taken as a prisoner of war? We didn’t even consider that.”\u003c/p\u003e\n\u003cp\u003eMary Jo stared at Roy, stunned. How could they have overlooked such an obvious possibility?\u003c/p\u003e\n\u003cp\u003e“Well, I guess we’ll be doing some more research. You’ve certainly given us something to think about,” Mack said. “Thanks, Dad.”\u003c/p\u003e\n\u003cp\u003e“No, thank you,” Corrie told him. “It’ll be a long time before I let your father live down the fact that I was right.” She gleefully rubbed her palms together. “We’re going to love having you and Noelle as part of our family, Mary Jo.”\u003c/p\u003e\n\u003cp\u003eAnd Mary Jo was going to love being a McAfee, too.\u003c/p\u003e\n\u003cp\u003eTwenty-Nine\u003c/p\u003e\n\u003cp\u003eBellamy Towers. Linc stared up at the four-story building in Bremerton, feeling his mouth go dry. He’d got the address of his father-in-law’s office out of the telephone directory but he’d only had the street name and number. He was shocked to discover that Bellamy obviously owned the whole complex. He knew from visiting the family home that Lori came from money; what astonished him was how much.\u003c/p\u003e\n\u003cp\u003eHe needed to speak to his father-in-law. Pacing back and forth in the parking lot, Linc realized that in his present frame of mind he’d make a mess of this. He was too angry to think logically or speak calmly. Linc had a temper, which he tended to fire off quickly; with enough provocation he’d say something he couldn’t take back. This conversation was too important to be ruled by emotion. He needed a clear head and cool reason.\u003c/p\u003e\n\u003cp\u003eJust as he was finally ready to enter the building, out came Leonard Bellamy. The other man frowned when he saw Linc. “What are you doing here?” Bellamy demanded.\u003c/p\u003e\n\u003cp\u003eLinc bit back a sarcastic reply. He felt like telling Lori’s father that he was in the area and thought they could go for a beer together. Instead, he spoke in as polite a tone as he could manage. “I’d like to talk to you for a couple of minutes.”\u003c/p\u003e\n\u003cp\u003e“I’m busy.” Bellamy attempted to step around him.\u003c/p\u003e\n\u003cp\u003eLinc blocked his move. “Unfortunately, I have a lot of time on my hands and my guess is you know why.” The man had set out to ruin his business and had just about succeeded. Linc couldn’t hang on much longer. He’d been able to find out that Bellamy had told certain influential people in Cedar Cove and adjoining communities that Linc was a gold digger who’d married his daughter for her money. Bellamy had also tried to thwart him by delaying his license application. When that didn’t shut Linc down, he’d apparently spread false rumors. Not that Linc could prove it, but there’d been hints. Mack McAfee had made a point of telling him that he’d heard Bellamy was “out to get” him.\u003c/p\u003e\n\u003cp\u003eLinc had spoken to his attorney, who said there was basically nothing to be done. He could file a suit for slander or for restraint of trade but Linc would rather end this than take his father-in-law to court—especially with a weak, hearsay case.\u003c/p\u003e\n\u003cp\u003eLong before he’d set up his shop he’d done extensive research on the area. Only because he felt he could make a go of it had he decided to branch out into Cedar Cove; otherwise, he would’ve continued his commute into Seattle. Based on his findings, he’d obtained a loan from a local bank to cover his start-up costs and he’d drawn on his savings, sinking most of the money into remodeling the garage.\u003c/p\u003e\n\u003cp\u003eAs part of his research, Linc had gone to visit various local insurance claim adjusters. These were the people who generally sent work his way. He’d talked to a number of them before he’d made his decision to move. Every one of them had assured him there was a need for his business.\u003c/p\u003e\n\u003cp\u003eWhen the promised work didn’t come, Linc went to see them all again. On his second series of visits Linc found his reception much cooler. The adjusters had no work to send him and weren’t interested in receiving his bids. When he dug deeper, Linc learned that Bellamy was good friends with someone high up in the state insurance commissioner’s office. Linc couldn’t prove that Bellamy had used their friendship to influence the adjusters but it all added up.\u003c/p\u003e\n\u003cp\u003eHe’d purchased a garage that had sat in disrepair for several years, cleaned it up and remodeled it. Then he’d hired two employees. Now these employees were twiddling their thumbs while Linc paid their wages from his dwindling reserves. Another month like the last one, and he’d have no choice but to close his doors.\u003c/p\u003e\n\u003cp\u003e“I said I don’t have time, nor do I have the desire to speak with you,” Bellamy said in a tone few would question. “Now kindly step aside.”\u003c/p\u003e\n\u003cp\u003e“You’re spreading lies about me in the community.” Bellamy’s attitude made Linc reconsider the advisability of taking him to court. But the idea went in and out of his mind in seconds. Much as he disliked Bellamy, the man was Lori’s father. Linc refused to jeopardize that relationship—or at least jeopardize it any more than Bellamy already had himself.\u003c/p\u003e\n\u003cp\u003e“We can make this all go away,” Bellamy said, his mood suddenly more affable. “With a snap of my fingers, I can set things straight for you.”\u003c/p\u003e\n\u003cp\u003eLinc hesitated. The man had essentially confirmed everything he’d suspected. “What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Leave my daughter.”\u003c/p\u003e\n\u003cp\u003e“Leave Lori?” Linc couldn’t believe what he was hearing.\u003c/p\u003e\n\u003cp\u003e“I’ll buy you out, make all the trouble you went to in getting that garage set up worth your while. All I ask is that you walk away from my daughter and don’t look back.”\u003c/p\u003e\n\u003cp\u003eHow friendly he sounded. How cordial. Linc’s financial difficulties would disappear if he abandoned his wife.\u003c/p\u003e\n\u003cp\u003eLinc stared at him, still unable to believe that even Bellamy would suggest such a thing.\u003c/p\u003e\n\u003cp\u003e“I hear you’re late with last month’s payment to the bank.”\u003c/p\u003e\n\u003cp\u003eThe only way Bellamy would know that was if someone from the bank had fed him the information.\u003c/p\u003e\n\u003cp\u003e“You made a mistake when you married my daughter.” His tone grew threatening again. “You saw her as an easy target.”\u003c/p\u003e\n\u003cp\u003e“I saw her as the most incredible woman I’ve ever known,” Linc countered. He meant it—meant it with everything in him.\u003c/p\u003e\n\u003cp\u003eBellamy snickered. “And that’s why you married her…what, two weeks after you met?”\u003c/p\u003e\n\u003cp\u003e“Something like that.” After meeting Lori’s mother, Linc felt he should have insisted to Lori that they wait. In their haste to get married, Linc had planted the seeds of suspicion within her family. In retrospect he would’ve preferred to meet her parents first and give them the opportunity to know him. Bellamy might still have objected, but at least Linc would’ve made the effort. At least he would’ve created the beginnings of a relationship.\u003c/p\u003e\n\u003cp\u003e“There’s still time to fix this,” Bellamy said.\u003c/p\u003e\n\u003cp\u003e“You want me to leave Lori?” He shook his head as he said the words.\u003c/p\u003e\n\u003cp\u003e“Divorce her.”\u003c/p\u003e\n\u003cp\u003eThe words hit him with such force, Linc stumbled back two steps. “I realize I was wrong. I should’ve come and talked to you first before marrying Lori. I should have—”\u003c/p\u003e\n\u003cp\u003eRed-faced, Bellamy leaned closer and when he spoke it was through gritted teeth. “Where you were wrong, young man, was in thinking you could get to me through my daughter.”\u003c/p\u003e\n\u003cp\u003e“Get to you?” The man seemed to assume the entire world revolved around him and his bank account. “I didn’t even know who you were.” Bellamy started to scoff but Linc talked right over him. “I married Lori because I’m in love with her. As for leaving her, I’d rather die first.”\u003c/p\u003e\n\u003cp\u003eBellamy laughed in his face. “We both know my daughter’s incapable of making a decent decision. She’s an empty-headed—”\u003c/p\u003e\n\u003cp\u003eLinc had heard enough. He grabbed Bellamy by his fancy suit lapels and jerked him forward. “Don’t ever speak about my wife like that again,” he snapped. “Lori has brains and integrity, and if you don’t see that in her, I pity you.” He abruptly released the other man.\u003c/p\u003e\n\u003cp\u003eBellamy straightened his sleeves and glared at Linc. “I could have you arrested for assault.”\u003c/p\u003e\n\u003cp\u003e“Go ahead.” If the man was determined to ruin him, he might as well do a thorough job.\u003c/p\u003e\n\u003cp\u003e“You stay married to my daughter and I’m cutting her out of my will. I swear to you that you won’t get a penny.”\u003c/p\u003e\n\u003cp\u003e“I doubt you’ll believe me, but I have no interest in your money.”\u003c/p\u003e\n\u003cp\u003e“You’re right. I don’t believe you.”\u003c/p\u003e\n\u003cp\u003e“Then that’s your problem.” Linc figured he might as well leave now, while his dignity was relatively intact.\u003c/p\u003e\n\u003cp\u003eWhen he returned to the garage, he saw that both employees were lounging around, idly entertaining themselves. One was working on a sudoku puzzle and the other was tossing cards into an empty coffee tin. Linc sent them both home.\u003c/p\u003e\n\u003cp\u003eAn hour later, after he’d sorted through the bills that were stacked on his desk, he hung his head in abject frustration. He wouldn’t be able to make this month’s payment to the bank, either.\u003c/p\u003e\n\u003cp\u003eUnless something changed fast, Linc was about to go belly-up. He knew he had the option of filing for bankruptcy, but he refused to consider it. No matter what happened, he wouldn’t take the easy way out, wouldn’t walk away from his debts. He was the one who’d taken the financial gamble; he’d pay the price.\u003c/p\u003e\n\u003cp\u003eWith his elbows propped on his desk, he shoved the hair away from his face. It was time to go home to Lori. At five-thirty, he posted the closed sign on the door.\u003c/p\u003e\n\u003cp\u003eShoring up his resolve, Linc sat in his truck for several minutes before he headed into the ground-floor apartment. As much as possible he tried not to inflict his worries on Lori. \u003c/p\u003e","sourceLink":"https://allnovel.net/1022-evergreen-place-cedar-cove-10/page-40.html","bookId":1952,"creation":"Oct 5, 2019 10:10:01 AM","modification":"Oct 5, 2019 10:10:01 AM"}
