{"id":68617,"no":47,"title":"Page 47","content":"\u003cp\u003eHe didn’t confirm or deny the statement.\u003c/p\u003e\n\u003cp\u003e“Roy, don’t. Please reconsider,” Corrie whispered with an urgency that gave him pause.\u003c/p\u003e\n\u003cp\u003eHe clutched the car keys so tightly they dug into his hands. “That young man has a right to know about his baby.”\u003c/p\u003e\n\u003cp\u003eCorrie closed her eyes and he knew she was thinking back to the time she’d found herself pregnant and alone. The same memory had haunted him from the moment their daughter came to tell them she was pregnant and the father was out of her life.\u003c/p\u003e\n\u003cp\u003e“This is the first time Gloria has ever come to us with a problem,” Corrie argued. “It’s been a breakthrough in our relationship. If you say anything to Chad, it could destroy her trust. It could destroy everything. I’m begging you, Roy, don’t do this.”\u003c/p\u003e\n\u003cp\u003eRoy’s eyes bored into hers and he stood his ground. They so rarely disagreed that it made this standoff even more difficult. Still, Roy was determined. “The young man has a right to know,” he repeated.\u003c/p\u003e\n\u003cp\u003eCorrie gave him a sad smile. “What you’re saying is that you had a right to know and I didn’t tell you.”\u003c/p\u003e\n\u003cp\u003e“Yes!” he all but shouted. When he’d discovered he had a daughter he would never meet, it had nearly broken his spirit. He loved Corrie and had asked her to be his wife, and yet she’d kept this secret for months. The anger and anguish had nearly consumed him. What she’d done had the power to tear them apart. Roy hadn’t let that happen; instead, he’d buried his feelings. But he understood now that this unresolved matter could still undermine their marriage, their relationship.\u003c/p\u003e\n\u003cp\u003e“I’ve never begged you for anything,” his wife said. “Don’t do this. Please, Roy, don’t do this.”\u003c/p\u003e\n\u003cp\u003eUnsure now, he walked over to his recliner and sagged into it. His car keys dangled from his hand as he leaned forward, gripped by indecision. He believed that contacting Chad Timmons was the right thing to do for Gloria and her baby. Yet everything Corrie said was true. Their daughter, the very one he’d thought forever lost, was back in their lives. Corrie feared, as he did, that going against her will would destroy their fragile bond.\u003c/p\u003e\n\u003cp\u003eCorrie remained where she stood.\u003c/p\u003e\n\u003cp\u003e“I need to think,” he murmured.\u003c/p\u003e\n\u003cp\u003e“Okay,” she agreed after a prolonged moment.\u003c/p\u003e\n\u003cp\u003eHe heard the reluctance in her voice.\u003c/p\u003e\n\u003cp\u003e“Think of Gloria—this is what she wants,” Corrie said. “Right or wrong, these are her wishes.”\u003c/p\u003e\n\u003cp\u003eFeeling the full weight of his years, Roy wiped a hand down his face. “Have you ever wondered what would’ve happened if I’d found out you were pregnant?” he asked.\u003c/p\u003e\n\u003cp\u003eCorrie didn’t answer him.\u003c/p\u003e\n\u003cp\u003e“You’ll never know because you made the decision not to tell me.” He tried hard to keep the bitterness out of his voice.\u003c/p\u003e\n\u003cp\u003e“You were seeing someone else.” Her words rang with painful accusation. “What did you expect me to do?”\u003c/p\u003e\n\u003cp\u003e“I expected you to tell me,” he barked. Corrie had taken the choice away from him. He’d been young and stupid, and even now he couldn’t be completely sure how he would’ve handled the situation. He liked to think he would have stepped up and been a man, but again that was something he’d never know.\u003c/p\u003e\n\u003cp\u003e“Let me give it more thought,” he said when he’d regained control of his emotions. What had happened had happened; they couldn’t go back and undo the past. Reviving these dead emotions could only hurt them.\u003c/p\u003e\n\u003cp\u003eCorrie sat down on the sofa and pressed her hands between her knees. When she spoke she lowered her head, her words barely audible. “I know what Gloria feels.”\u003c/p\u003e\n\u003cp\u003e“Tell me,” he urged, wanting to understand how she’d rationalized her silence all those years ago.\u003c/p\u003e\n\u003cp\u003e“She’s afraid.”\u003c/p\u003e\n\u003cp\u003e“Of what?” he challenged.\u003c/p\u003e\n\u003cp\u003eCorrie glanced up. “Rejection. Blame.”\u003c/p\u003e\n\u003cp\u003e“Blame?” Roy stared at her. “Why would I blame you? The responsibility for birth control should be shared.”\u003c/p\u003e\n\u003cp\u003e“It was more than that.”\u003c/p\u003e\n\u003cp\u003e“Explain it to me.”\u003c/p\u003e\n\u003cp\u003e“I…had an important decision to make and I wanted to make it myself, without pressure from you.”\u003c/p\u003e\n\u003cp\u003eHer reasoning irritated him. “Don’t you think that was rather selfish?”\u003c/p\u003e\n\u003cp\u003e“No.” Corrie would not back down. “I was young and immature,” she said. “I had all I could deal with already. I couldn’t handle you being in the center of the situation. Gloria feels the same way. Chad is out of her life. He, too, is involved with someone else. Gloria feels as I did—that she’d rather deal with this on her own.”\u003c/p\u003e\n\u003cp\u003eHearing her so coldly cut out Chad, just as Corrie had eliminated him from the equation, made the decision easy for Roy. He came to his feet and stalked out of the house.\u003c/p\u003e\n\u003cp\u003e“Roy!” his wife called after him. “Don’t do this. Please…don’t do this,” she wailed.\u003c/p\u003e\n\u003cp\u003eRoy ignored her, climbed into his car and drove off. He couldn’t say he looked forward to meeting Chad Timmons. The task of informing the other man that he was about to become a father wouldn’t be pleasant.\u003c/p\u003e\n\u003cp\u003eHe drove into Tacoma and parked at the hospital. His visit was brief. He left a message for Chad with the receptionist, asking the doctor to meet him at a tavern close to the hospital. Whether or not Chad decided to show up was his choice. If he didn’t arrive within half an hour of the end of his shift—which the receptionist had told him was 4:00 p.m.—Roy would take that to mean Chad wasn’t interested in talking to him. In that case, he wouldn’t pursue the issue. Corrie and Gloria would get their wish. But, by the same token, Roy would feel he’d done what he had to do.\u003c/p\u003e\n\u003cp\u003eHe sat at a table in the darkened room and ordered a beer. He wasn’t much of a drinking man. Never had been, but there were occasions that seemed to call for it. This was one of them.\u003c/p\u003e\n\u003cp\u003eHe’d drunk about half his beer when the door opened and Dr. Chad Timmons entered. They’d met briefly at the opening of the medical clinic, and Roy recognized him immediately. The younger man paused near the entrance and looked around.\u003c/p\u003e\n\u003cp\u003eRoy raised his chin just enough for Timmons to spot him.\u003c/p\u003e\n\u003cp\u003eChad walked the length of the room and stood in front of him. “You wanted to speak to me?” he asked defensively.\u003c/p\u003e\n\u003cp\u003eRoy gestured toward the chair.\u003c/p\u003e\n\u003cp\u003eChad ignored the silent invitation to join him. “What’s this about?”\u003c/p\u003e\n\u003cp\u003e“Sit down, son.”\u003c/p\u003e\n\u003cp\u003eWith obvious reluctance he pulled out a chair and sat.\u003c/p\u003e\n\u003cp\u003e“You know my daughter,” Roy said without emotion.\u003c/p\u003e\n\u003cp\u003e“I know both your daughters,” Chad returned.\u003c/p\u003e\n\u003cp\u003eFor a moment Roy had forgotten that at one time Linnette had been infatuated with Chad.\u003c/p\u003e\n\u003cp\u003e“Has something happened to Gloria?” Chad asked. A look of concern passed over his face.\u003c/p\u003e\n\u003cp\u003eRoy managed to disguise a smile. “That’s one way of putting it.” He caught the bartender’s eye, lifted his nearly empty glass and held up two fingers. A minute later, two pints were delivered to their table.\u003c/p\u003e\n\u003cp\u003e“I didn’t ask for this,” Chad said, still sounding defensive.\u003c/p\u003e\n\u003cp\u003eRoy resisted the urge to suggest he was going to need it. Instead, he offered the other man a few words of advice. “Don’t turn down a free beer.”\u003c/p\u003e\n\u003cp\u003eChad cracked a smile.\u003c/p\u003e\n\u003cp\u003e“Would you mind if I told you a story about me?” Roy asked.\u003c/p\u003e\n\u003cp\u003eChad motioned for him to proceed.\u003c/p\u003e\n\u003cp\u003e“Corrie and I were college sweethearts. I was playing for the football team and became a bit of a campus celebrity. I’m afraid I let that attention go to my head.”\u003c/p\u003e\n\u003cp\u003e“It can happen easily enough,” Chad said. He leaned forward and put his elbows on the table.\u003c/p\u003e\n\u003cp\u003e“Especially when one of the sexiest cheerleaders on the squad made a play for me.”\u003c/p\u003e\n\u003cp\u003e“Hey, you’re only human.”\u003c/p\u003e\n\u003cp\u003e“Yeah, only human.” Roy wasn’t proud of this next part. “I broke up with Corrie. As they say, I had bigger fish to fry. I knew I’d hurt her and I felt bad about that, but Alicia—the cheerleader—made it clear she didn’t like competition.”\u003c/p\u003e\n\u003cp\u003eChad grinned as if he understood Roy’s quandary. “It was either one or the other, right?”\u003c/p\u003e\n\u003cp\u003e“You’ve got the picture.” Roy paused and sipped his beer. “Corrie left school and I have to tell you I was relieved not to see her around campus. Especially after Alicia dumped me.”\u003c/p\u003e\n\u003cp\u003e“Any particular reason you lost the cheerleader?”\u003c/p\u003e\n\u003cp\u003eRoy nodded. “I got hurt, put on injured reserved. My star had fallen. Alicia moved on.”\u003c/p\u003e\n\u003cp\u003e“Bigger fish?”\u003c/p\u003e\n\u003cp\u003e“You bet.” Roy’s hand tightened around the beer mug. “I decided that if I was going into law enforcement, I couldn’t risk another injury. So I gave up sports and concentrated on my studies.”\u003c/p\u003e\n\u003cp\u003e“You joined the Seattle police force, didn’t you?”\u003c/p\u003e\n\u003cp\u003eRoy nodded. “I made detective.”\u003c/p\u003e\n\u003cp\u003eChad arched his brows.\u003c/p\u003e\n\u003cp\u003e“That injury returned to haunt me years later, when I hurt my back during a chase, and it led to my taking early retirement. But that’s another story.”\u003c/p\u003e\n\u003cp\u003e“Is there a point to this story?” Chad asked.\u003c/p\u003e\n\u003cp\u003e“Oh, yes, there’s a point. I’ll get to it in a minute.”\u003c/p\u003e\n\u003cp\u003eChad lifted his mug. “If you’re buying the beer, take as long as you want.”\u003c/p\u003e\n\u003cp\u003eRoy chuckled, relaxing against the back of the captain’s chair. “I ran into Corrie on campus a short while later. That was the following year. We met at the library. When I saw her again, I was stunned by how beautiful she was. How genuine. I couldn’t believe I’d left her for someone as superficial as Alicia.”\u003c/p\u003e\n\u003cp\u003e“I’m surprised Corrie would have anything to do with you.”\u003c/p\u003e\n\u003cp\u003eRoy had to agree. “She didn’t make it easy. I sort of accidentally on purpose showed up at the library every night, about the same time I knew she’d be there.”\u003c/p\u003e\n\u003cp\u003e“Smart man.”\u003c/p\u003e\n\u003cp\u003e“I didn’t make detective on looks alone.”\u003c/p\u003e\n\u003cp\u003eChad grinned.\u003c/p\u003e\n\u003cp\u003e“Eventually Corrie realized I was serious and agreed to go out with me again. I didn’t make the same mistake twice, and just before I graduated I asked her to be my wife.”\u003c/p\u003e\n\u003cp\u003e“Now that was a good move.”\u003c/p\u003e\n\u003cp\u003e“I couldn’t agree with you more.” Roy straightened and stared down at his beer. “The night before we were married, Corrie told me that when she’d gone home to live with her family she’d given birth to my baby.” He made eye contact with Chad.\u003c/p\u003e\n\u003cp\u003e“Gloria.”\u003c/p\u003e\n\u003cp\u003e“Yes, Gloria. I didn’t know I had a daughter until after she’d been given up for adoption.” Chad frowned.\u003c/p\u003e\n\u003cp\u003e“Like her mother, Gloria tends to be…cautious with what she shares. Private.”\u003c/p\u003e\n\u003cp\u003e“Yes, she does,” Chad said.\u003c/p\u003e\n\u003cp\u003eUncertain how to lead into the purpose of his visit, Roy met Chad’s eyes again. “She says you’re seeing someone else now.”\u003c/p\u003e\n\u003cp\u003eChad held his look. “If you don’t mind, I’d rather not discuss my personal life.”\u003c/p\u003e\n\u003cp\u003e“That’s fine with me. However, before I say anything more, I want to tell you that I’m taking a huge risk seeing you this afternoon.” \u003c/p\u003e","sourceLink":"https://allnovel.net/1022-evergreen-place-cedar-cove-10/page-47.html","bookId":1952,"creation":"Oct 5, 2019 10:10:01 AM","modification":"Oct 5, 2019 10:10:01 AM"}
