{"id":68575,"no":5,"title":"Page 5","content":"\u003cp\u003eOlivia was the one who suggested he consider buying the art gallery. Leave it to his sister to steer him toward a worthy purpose. The gallery had been about to close, and he’d bought the business, any remaining stock and the building itself, which was one of the oldest in town and in need of repair. To this day Will wasn’t sure why he’d thought he could make a success of this. But then, he’d always enjoyed a challenge.\u003c/p\u003e\n\u003cp\u003eDrawing a deep breath, he picked up the phone. He knew Shirley Bliss’s number by heart. He’d called so often that his fingers hit the numbers automatically.\u003c/p\u003e\n\u003cp\u003eShirley, a widowed artist whose work he’d displayed, interested him in a way no woman had since Grace Sherman—Grace Harding now. He’d fallen for Grace and come so close to making her part of his life; the fact that it hadn’t happened still depressed him.\u003c/p\u003e\n\u003cp\u003e“Hello.” Shirley’s teenage daughter, Tanni, answered his call.\u003c/p\u003e\n\u003cp\u003e“Hello, Tanni,” Will said cheerfully. “How’s it going?”\u003c/p\u003e\n\u003cp\u003e“Okay, I guess.”\u003c/p\u003e\n\u003cp\u003e“You heard from Shaw lately?” he asked. By pulling a few strings he’d been instrumental in getting Tanni’s boyfriend into the San Francisco Art Institute. He wanted Shirley to be in his debt, although so far she’d shown little appreciation.\u003c/p\u003e\n\u003cp\u003e“Not really.”\u003c/p\u003e\n\u003cp\u003eThe girl’s voice tensed. Clearly this was a delicate subject and one he should avoid.\u003c/p\u003e\n\u003cp\u003e“Is your mother home?” he asked next. Not having had children, Will felt at a distinct disadvantage while talking to teenagers.\u003c/p\u003e\n\u003cp\u003e“She’s in the dungeon.”\u003c/p\u003e\n\u003cp\u003e“The dungeon?”\u003c/p\u003e\n\u003cp\u003e“The basement,” Tanni said. “Where she works.”\u003c/p\u003e\n\u003cp\u003eOh, her studio. “Would you mind letting her know I’m on the phone?”\u003c/p\u003e\n\u003cp\u003eThe girl hesitated. “Mom doesn’t like to be disturbed when she’s working.”\u003c/p\u003e\n\u003cp\u003eEvidently Tanni was prepared to stand guard over the moat leading to the castle—and the dungeon. “Just tell her I’m on the phone, if you would.”\u003c/p\u003e\n\u003cp\u003e“All right.” She didn’t seem pleased about it.\u003c/p\u003e\n\u003cp\u003eWill heard Tanni set the phone down and walk away, her shoes tapping against the floor. Then he could hear her shout into the basement. After a few minutes she returned and picked up the receiver. “Mom says if you sold another piece, would you please put the check in the mail.”\u003c/p\u003e\n\u003cp\u003e“I didn’t. Tell her I have a question for her.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eOnce again Will heard her set the phone down, trot across the room and shout. He didn’t hear anything for another minute or so.\u003c/p\u003e\n\u003cp\u003eThen… “This is Shirley.”\u003c/p\u003e\n\u003cp\u003eIf he’d recognized the lack of welcome in Tanni’s voice, it came through even more clearly in her mother’s.\u003c/p\u003e\n\u003cp\u003e“I hope I’m not interrupting you.” Will forced himself to sound his most charming.\u003c/p\u003e\n\u003cp\u003e“It’s fine.” Some of the irritation left her voice. “I was in the middle of something but I needed a break, anyway.”\u003c/p\u003e\n\u003cp\u003eHe relaxed a bit. “I called to see if you were available this Saturday night. I have tickets for the Playhouse.” He didn’t give her a chance to reject yet another invitation. Instead, he continued in a conversational tone. “Peggy Beldon stopped by earlier in the week. She’s redecorating the master bedroom and bought an original piece—a collage. She mentioned that Bob’s starring in the production of Fiddler on the Roof. That’s a favorite of mine and I like to support our local theater.”\u003c/p\u003e\n\u003cp\u003e“This Saturday?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Oh, Will, I’m sorry but I promised Miranda I’d attend the fundraiser at the library this Saturday.”\u003c/p\u003e\n\u003cp\u003eOkay, he’d half expected this kind of response. “I might be able to trade in the tickets for another night.” He wasn’t giving up that easily.\u003c/p\u003e\n\u003cp\u003e“Unlikely,” Shirley said, and he heard a hint of regret in her voice—or thought he did. “I read in the Chronicle this morning that the tickets have completely sold out. The theater might add extra shows.”\u003c/p\u003e\n\u003cp\u003e“Well, maybe we can go to one of those.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” Shirley said.\u003c/p\u003e\n\u003cp\u003e“What about Sunday?” he blurted out, not sure what to suggest. A stroll along the waterfront? A movie? Coffee? He’d tried all those before and gotten nowhere.\u003c/p\u003e\n\u003cp\u003e“That won’t work, either. Miranda and I—”\u003c/p\u003e\n\u003cp\u003e“Just who is Miranda?” Will asked, gritting his teeth. He’d never heard the other woman’s name before and all of a sudden it was Miranda this and Miranda that. He hadn’t even met the woman and already he had the distinct feeling she was a troublemaker.\u003c/p\u003e\n\u003cp\u003e“Miranda’s a good friend. We’ve known each other for years. We drifted apart but after my husband died we reconnected. Miranda lost Hugh, her husband, about five years ago. You might’ve heard of him—Hugh Sullivan, a landscape painter. Anyway, she’s been helping me navigate widowhood.”\u003c/p\u003e\n\u003cp\u003eWill wanted to be the one to guide Shirley to new love and a new life. He’d hoped they could find this path to happiness together.\u003c/p\u003e\n\u003cp\u003e“I think it might be best if we tried to get together another time,” she said with finality.\u003c/p\u003e\n\u003cp\u003eBefore he could propose another potential outing, Shirley ended the conversation. “Thanks for calling, Will. Bye now.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t come up with anything fast enough to stop her from disconnecting. When he started to sputter something, the telephone droned in his ear. Shaking his head, he hung up.\u003c/p\u003e\n\u003cp\u003ePerhaps he was losing his touch. It wasn’t his looks. Even now that he’d grown older, his brown hair with its silver accents gave him the distinguished appearance of a man who was confident and comfortable with himself.\u003c/p\u003e\n\u003cp\u003eHe routinely worked out; he wasn’t fanatical about exercise but he kept in shape. Although he’d recently purchased the gallery, he’d managed his finances effectively. He wasn’t rich, but he was well off.\u003c/p\u003e\n\u003cp\u003eGeorgia, being Georgia, had been more than fair in their divorce settlement. Apparently she felt guilty for filing. Another irony, since he was the one who’d cheated on her. He knew his mother and sister kept in touch with his ex. He didn’t. Contact between them would be just too…awkward.\u003c/p\u003e\n\u003cp\u003eWill didn’t know what it was about him that scared Shirley Bliss away. So many women fawned over him, and attracting the opposite sex had never been a problem until he met Shirley.\u003c/p\u003e\n\u003cp\u003eDespite her skittishness, Will sensed that she was attracted to him, that she wanted to know him better. For whatever reason, Shirley couldn’t or wouldn’t let him get close.\u003c/p\u003e\n\u003cp\u003eThen he understood.\u003c/p\u003e\n\u003cp\u003eThe answer should’ve been obvious. Shirley did want to date him. She felt, just as he did, that they’d be terrific together. She felt the same sparks Will did.\u003c/p\u003e\n\u003cp\u003eBut Shirley was afraid.\u003c/p\u003e\n\u003cp\u003eThat was understandable. He should’ve recognized it long ago. After years of being married to the same man, Shirley was terrified of what would happen if she allowed herself to have strong feelings for someone else.\u003c/p\u003e\n\u003cp\u003eNow that he’d figured it out, Will decided he could afford to take some time to work on a strategy to convince her….\u003c/p\u003e\n\u003cp\u003eSaturday night, after closing, he looked through the gallery windows and caught a glimpse of the flickering lights of the shipyard across the cove. Down at the marina, sailboats bobbed on the gentle swell of the wake created by the Bremerton ferry. From there, his gaze moved toward the library. He’d read about the fundraiser but hadn’t thought much about it until Shirley said she had plans to go with her friend.\u003c/p\u003e\n\u003cp\u003eDoubt flickered in his mind. He couldn’t help wondering if what she’d said was true—if she really was at the fundraiser. The only way of confirming it was to show up there himself. He didn’t have any other plans, since he wasn’t willing to attend the theater on his own. So Will made the sudden decision to become a library supporter. He still found it uncomfortable to see Grace, but she needed to know he’d moved on, too, and there was no better way to prove it.\u003c/p\u003e\n\u003cp\u003eHe shaved and splashed on a light dose of citrusy cologne, then put on a gray vest his mother had knit him on impossibly small needles. He couldn’t begin to imagine how many hours this had taken Charlotte. Will tended to wear it on special occasions and this evening, he felt, was special—an opportunity to make a real connection with Shirley.\u003c/p\u003e\n\u003cp\u003eWith his hands in his pants pockets, Will walked casually down the hill to the library. Even before he reached the end of the block he could hear the music drifting up from the open library doors. Grace had brought in a chamber music group; this event was more formal and elegant than he’d assumed.\u003c/p\u003e\n\u003cp\u003eAs he entered the library, the first person he saw was his sister, Olivia. Her husband, Jack Griffin, stood attentively by her side, and Will recognized the concern on his face. His sister was recovering from cancer. Just before Christmas they’d nearly lost her to a massive infection with temperatures high enough to make her delirious. The episode had shaken the entire family, as well as her many friends. Like Grace.\u003c/p\u003e\n\u003cp\u003eWill had viewed Olivia with fresh eyes after seeing her so ill. The surge of love and protectiveness he’d felt had taken him by surprise. He hadn’t realized how deeply he loved his little sister.\u003c/p\u003e\n\u003cp\u003eWill wasn’t aware that he was blocking the doorway until someone politely asked to step past.\u003c/p\u003e\n\u003cp\u003e“Sorry,” he mumbled as he went farther into the room.\u003c/p\u003e\n\u003cp\u003eWaiters moved among the throng hoisting trays with champagne flutes and tiny hors d’oeuvres. It occurred to Will that he might need a ticket. He saw a woman at a table collecting money and hurried toward her. While he waited in line, he glanced around, hoping to find Shirley. A moment later he did. She stood talking to Grace; the woman beside her must be Miranda.\u003c/p\u003e\n\u003cp\u003eAs if Shirley’s friend felt his gaze she turned in his direction. Her eyes locked on him and then ever so slowly narrowed. Will stared back.\u003c/p\u003e\n\u003cp\u003eMiranda said something to Shirley, who instantly looked at him. Then she nodded.\u003c/p\u003e\n\u003cp\u003eSo Miranda had asked about him. That was interesting, he thought, as he surreptitiously observed Shirley’s friend. She stood nearly a head taller than Shirley. Will suspected Miranda was close to six feet; he was six-one. By contrast, Shirley was petite, delicate, fine-boned. Miranda was none of those things.\u003c/p\u003e\n\u003cp\u003eHe paid for his ticket and decided to approach Shirley. Perhaps they could mingle for a while and then ditch her friend and go to dinner. He didn’t see any need to waste a beautiful evening. On his way over to Shirley, he grabbed a flute and took a sip. Not real champagne, but a decent sparkling wine, probably a California label.\u003c/p\u003e\n\u003cp\u003eShirley gave a small wave and started toward him. Miranda came with her. Both women held half-full flutes that they balanced carefully as they walked.\u003c/p\u003e\n\u003cp\u003e“Will,” Shirley said, smiling up at him warmly. “I didn’t expect to see you here. Weren’t you going to the theater?”\u003c/p\u003e\n\u003cp\u003e“Last-minute change of plans,” he said, returning her smile. He flicked a glance at her friend.\u003c/p\u003e\n\u003cp\u003eAs if suddenly realizing she needed to make introductions, Shirley said, “This is the friend I mentioned. Miranda Sullivan, Will Jefferson.”\u003c/p\u003e\n\u003cp\u003e“Pleased to meet you,” Miranda said, sounding anything but.\u003c/p\u003e\n\u003cp\u003eHer attitude annoyed him. “Same here,” he responded, matching her tone. What was this woman’s problem, anyway? She seemed to disapprove of him for some reason, even though she knew next to nothing about him. \u003c/p\u003e","sourceLink":"https://allnovel.net/1022-evergreen-place-cedar-cove-10/page-5.html","bookId":1952,"creation":"Oct 5, 2019 10:10:01 AM","modification":"Oct 5, 2019 10:10:01 AM"}
