{"id":56347,"no":125,"title":"Chapter 125: Diamonds","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 125: Diamonds\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue did not stop to greet the gathered students. He made his way towards the podium, and placed the tray he’d brought with him atop it. Next, he fumbled through his coat until he pulled out a small cloth pouch, removing it’s contents. He placed this upon the tray.\u003c/p\u003e\n\u003cp\u003eHe spun around to face the board, and scrawled something across it’s surface: Who wants to win a prize?\u003c/p\u003e\n\u003cp\u003eAt first only the students in the front noticed, but word quickly spread. Attention turned to Lan Jue, and the volume decreased.\u003c/p\u003e\n\u003cp\u003eHe continued to write: It’s too noisy to hold the raffle.\u003c/p\u003e\n\u003cp\u003eQuiet washed over the room. Wang Hongyun was curious at the promise of a raffle. It was certainly a novel approach. It was quiet now, he thought, but these were college students – stickers and candy weren’t going to cut it. If the prize wasn’t good enough in their estimation, he was going to have a classroom of angry students on his hands.\u003c/p\u003e\n\u003cp\u003eThe dance instructor had only been teaching a few years, but he knew more or less the mind of the elective student. He’d struggled with classroom control at the outset himself.\u003c/p\u003e\n\u003cp\u003e“Good afternoon, everyone,” Lan Jue began. He stepped from behind the podium, and bowed to the gathered student body.\u003c/p\u003e\n\u003cp\u003eJin Tao was the first to stand – a show of respect for his professor. Tang Xiao was half a second behind. But it wasn’t until after the three beauties followed their example that the other students joined in. Soon nearly the whole class was on it’s feet.\u003c/p\u003e\n\u003cp\u003e“Hello, Professor Lan.” Jin Tao shouted the greeting towards the podium [1. In China, it’s customary – mostly in primary/middle/high school – to stand and say hello to the teacher in this fashion at the start of class. It’s really only done in universities for teachers that are highly respected.] The other students echoed his call.\u003c/p\u003e\n\u003cp\u003eLan Jue motioned for them all to sit. “Please return to your seats.”\u003c/p\u003e\n\u003cp\u003eThe students did as instructed. Jin Yan lightly kicked the man at her side. “Why didn’t you stand, Professor Wang? We’re here listening to the class, so we’re no different than students. More than that, we’re his colleagues. If we don’t show support for Professor Lan, how can we set a good example for the students?”\u003c/p\u003e\n\u003cp\u003eWang Hongyun smirked, shrugging his shoulders. “I wasn’t feeling it.”\u003c/p\u003e\n\u003cp\u003eJin Yan scowled, but said nothing further.\u003c/p\u003e\n\u003cp\u003eLan Jue returned to the podium and pointed to the board. “That’s right, a prize. No tricks. So take a guess, what do you think it will be? I’m pretty confident you wont be disappointed. Does anyone remember what I said we’d be discussing today?”\u003c/p\u003e\n\u003cp\u003e“Jewelry!” A female student belted the answer from somewhere in the crowd below.\u003c/p\u003e\n\u003cp\u003eLan Jue gave her a thumbs up. “That’s right. Today we’re discussing jewelry. In regards to jewel knowledge, there’s a lot of complicated information to go over. Jewelry comes in all shapes and sizes, numerous types and categories. I wont be able to cover them all in one class, so today we’ll just be covering one kind. If this is a topic you all find interesting, I’ll continue with the other kinds at a later date.”\u003c/p\u003e\n\u003cp\u003eLan Jue lifted the tray from the podium as he began the lesson. The velvet covering was a deep mazarine, identical to the one used to display products in Zeus’ Jewelry Shop. A gemstone shimmered alluringly within it. The gem itself was crystal clear, and pure white. Twinkling against the velvet, it was like a star set against the midnight sky.\u003c/p\u003e\n\u003cp\u003e“Who can tell me what this is?”\u003c/p\u003e\n\u003cp\u003e“A diamond.” Shui Zhondie at Qianlin’s shoulder was the first to answer, her pleasant voice wafting up towards him. It was almost musical, and though lacking the softness of Zhou Qianlin’s, was far more melodious.\u003c/p\u003e\n\u003cp\u003e“That’s right.” Lan Jue nodded at her. “This is one of the gems we often come across when considering jewelry. Diamonds. This is our topic for today. Further, this particular piece is the prize for our raffle.”\u003c/p\u003e\n\u003cp\u003e“Ooohh…” The students’ appreciative cooes filled the lecture hall. Using a diamond as the prize? It was something entirely new for the university.\u003c/p\u003e\n\u003cp\u003eThe sneering, self-confident contempt on Wang Hongyun’s face froze. From where he was sitting that was a one-karat gem. He couldn’t speak as to it’s value, but he knew that at least it wasn’t cheap. Meanwhile, Lan Jue pointed at the second sentence he’d written on the blackboard.\u003c/p\u003e\n\u003cp\u003eThe silence came quicker this time, and the students settled down to continue. It wasn’t long before he had everyone’s rapt attention.\u003c/p\u003e\n\u003cp\u003e“There’s that old adage; a diamond is forever. I imagine you’ve all heard it before. It’s actually a slogan, but it also serves to elucidate the gem’s character. Namely, a diamond’s strength and resistance.”\u003c/p\u003e\n\u003cp\u003e“I’m no chemist, no physicist. I wont go in to how a gem in made, or it’s component parts. I will tell you that a diamond is hard. If we don’t consider power gems, then diamonds are the strongest precious stones there are. If we were to assign a value of ‘ten’ to how hard it is, then the other gems we know such as rubies and sapphires would be a nine. Jadite would be seven. Specifically those types of jade – as they were collectively referred to in the ancient era – which were at a hardness of seven or more were Jadeite. Under seven were called nephrite.”\u003c/p\u003e\n\u003cp\u003e“It’s our first class on the subject, and as such I don’t want to inundate you with information. Just know that for the classic gems, diamonds are the hardest. As a result they are the preference for engagement and wedding rings. They resist damage and wear, and represent the endurance and eternity of a couple’s love.\u003c/p\u003e\n\u003cp\u003eLan Jue’s voice was magnetic. Not too fast, not too slow. His words were plain, his delivery solid. The students listened easily as he continued.\u003c/p\u003e\n\u003cp\u003eLan Jue stepped from the dais and handed the tray to Jin Tao. “Pass this around and make sure everyone has a chance to look.” He smiled a little. “And if everyone wouldn’t mind showing a little restraint. In fact losing this diamond wouldn’t affect me, as it’s meant to be given away regardless, but it would take the opportunity away from your fellow classmates.”\u003c/p\u003e\n\u003cp\u003eA soft chuckle trilled though the students. The atmosphere grew a little more relaxed.\u003c/p\u003e\n\u003cp\u003eLan Jue paid no further mind to Jin Tao and the diamond, and returned to the podium to continue the lecture. “So that’s it concerning the hardness of a diamond. Today, what we’ll discuss is how to assess the quality of a diamond, if you are so inclined. First, is the size. Generally speaking the size of a gem is directly proportional to it’s cost – the same holds true for power gems. I suppose it’s fair to say that the bigger the gem, the more it’ll cost you. Conversely the smaller, the cheaper. It certainly applies as a rule to diamonds.”\u003c/p\u003e\n\u003cp\u003e“If your interest in a diamond is for it’s value as an item later, then you’re looking for something in the range of one karat or more. The price difference between a point ninety-nine and one karat diamond is significant. The one being passed around class right now is precisely one karat. The size of a diamond, though, doesn’t not entirely determine it’s price however. If this diamond were two karats the price would not be doubled, necessarily.”\u003c/p\u003e\n\u003cp\u003e“Other than size, in an effort to determine the quality of a diamond, there are a small number of other criteria to consider. Could one assume that two, one-karat diamonds would be of similar prices? This would be false, as their quality could be vastly different. The price, then, could be just as volatile.”\u003c/p\u003e\n\u003cp\u003eThe tray had begun to make it’s way back from the far recesses of the class. The students were all familiar with diamonds, but it was the first time for most that they saw one up close, much less with an explanation. They examined it with interest as it passed.\u003c/p\u003e\n\u003cp\u003e“There are three others ways to determine a gem’s quality, aside from size. They are color, clarity, and cut. We’ll start with color. For diamonds, it’s simply the whiter, the better. Their ranking in the order of color is indicating by alphabet, with the lowest letters displaying inferior color. The highest, is D. This indicates one hundred percent, pure white. Perfection. Next is E, nearly perfect. Then F, approximately ninety-eight percent white. These three are the top of the color scale. Lower letters are G, H, I, J, and K. The further down the list you go, the more yellowed the gem appears, and the price suffers as a result. A D-colored gem could be triple the price of an I-colored gem of the same size. Clearly, the color has a significant impact on value. Of course when seeking a purchase you don’t always need to chase after perfection. D, E and F gems are immaculately colored, and just as rare.”\u003c/p\u003e\n\u003cp\u003e“The gem before you today has a color rating of F, nearly entirely white.”\u003c/p\u003e\n\u003cp\u003eAs the gem passed from hand to hand, Lan Jue continued to elaborate on the intricacies of diamond identification. He followed with clarity, and cut, delivering the information with ease and approachability.\u003c/p\u003e\n\u003cp\u003e“The perfect diamond would be one whose color, cut and clarity are the top of it’s class. These are what are called Flawless Diamonds. This is where the phrase ‘flawless beauty’ comes from.”\u003c/p\u003e\n\u003cp\u003eTime passed quickly as the class proceeded, Lan Jue carefully providing the knowledge to the gathered students. The diamond and it’s tray made the rounds, finishing it’s journey back on his podium.\u003c/p\u003e\n\u003cp\u003e“And now for the moment you all have been waiting for. You all have been patient and attentive. It’s time for the lottery.”\u003c/p\u003e\n\u003cp\u003eHe picked up the tray before him. “Our method will be simple, to ensure fairness for all participants.”\u003c/p\u003e\n\u003cp\u003eLan Jue passed out scraps of paper he’d prepared in advance. “Please write your names on the paper, then pass them back up when you’re finished. We’ll place your tickets in a box and draw one slip. Whoever has their name on that paper, that’s the diamond’s new owner.”\u003c/p\u003e\n\u003cp\u003eThe slips were quickly written and recovered. Lan Jue placed them all in a box he’d prepared earlier, and set it on the podium. He stuck his hand within, rustled the contents, and pulled out a single scrap.\u003c/p\u003e\n\u003cp\u003e“Alright, and the winner is… Zhou... Zhou Qianlin!” Lan Jue stuttered ever so slightly, surprised by the unlikely result.\u003c/p\u003e\n\u003cp\u003eWhat are the chances? But there it was, the winner, Zhou Qianlin.\u003c/p\u003e\n\u003cp\u003eShe herself was taken aback, and her numerous male fans seated behind her waved their arms in excitement. Still Lan Jue felt something was amiss. A flash of blue light crossed his eyes as he employed his psychic force to probe the interior of the box. In the one hundred or so tickets he found, forty-two bore Zhou Qianlin’s name…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-124\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-126\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-125","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
