{"id":56353,"no":131,"title":"Chapter 131: Planet Taihua","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 131: Planet Taihua\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe bus-sized verti-car rumbled to a start, then began it’s journey. They still had to travel to the university’s exclusive space ship, which would then deliver them to Planet Taihua.\u003c/p\u003e\n\u003cp\u003eWu Junyi stood near the driver’s seat. His ordinarily serious Director’s face was gone, and he had a small smile as he addressed the teachers. “Professors one and all, you’ve worked hard. For this trip, I will be your guide. I hope it will be a pleasant and relaxing experience for all of you. In a little while we’ll be on our way, and from then it’s twenty hours to Skyfire’s closest neighbor, Taihua. Once we arrive, the next five days will be spent enjoying one another’s company. For now, sit back, relax, and enjoy the ride.”\u003c/p\u003e\n\u003cp\u003eLan Jue responded by slipping on his sunglasses and headphones. He sank back in to his chair, and closed his eyes. The sound that filled his ears was pleasant, a sudden gift from Hua Li as he was preparing to leave. It was, in fact, \u003cem\u003eSounds of Nature\u003c/em\u003e – his soon-to-be-released album.\u003c/p\u003e\n\u003cp\u003eIt wasn’t long until their bus arrived at the public ship hangar.\u003c/p\u003e\n\u003cp\u003eThe university’s ship was bright silver. The NEU identification symbols shimmered on it’s sides. The teachers filed out of the bus, and on to the ship directly. Then, off they went to Taihua.\u003c/p\u003e\n\u003cp\u003eAs they boarded, Tan Lingyun chose a corner to herself, distancing herself in apparent disgust. Though Lan Jue was thankful for her departure, his pride was further bruised by her hateful attitude. He wondered what was so despicable about him that caused her to act that way.\u003c/p\u003e\n\u003cp\u003eJin Yan wasn’t aware of his mood, and so chose once more to sit beside him. She asked a few questions about how Jin Tao was doing, but noticed Lan Jue was tired. She knew how to behave in social situations and let the subject lie.\u003c/p\u003e\n\u003cp\u003eLan Jue closed his eyes. He felt a shudder rumble through the ship, heard the noise of it’s engines firing. It brought a sense of calm to him. In truth he was enjoying this university lifestyle. It was simple, and quiet. Although there were things that required his attention every day, and although he had concerns for his students and what to teach, it was a life he felt was happy and enriching.\u003c/p\u003e\n\u003cp\u003eLan Jue slipped in to a meditative state, spurred on by the quietude of his mind and the contentment he felt. His consciousness turned inward, expanding out within him.\u003c/p\u003e\n\u003cp\u003eUnlike normal people, his own meridians were a light blue color. His skeleton, silver. The flow of his blood and fluids was the same as any normal man, but close examination would reveal sparks of electricity flashing between the erythrocytes.\u003c/p\u003e\n\u003cp\u003eThis was a mark of the ninth ranked talent, the strange conditions of their body. The only way an Adept could control these levels of power, was if they conditioned themselves as conduits of this energy.\u003c/p\u003e\n\u003cp\u003eTo put it simply, there were distinct similarities between a high level Adept and an power gem. Some said that Adepts were little more than intelligent gems themselves. Of course it wasn’t that simple, but in a sense it wasn’t entirely false.\u003c/p\u003e\n\u003cp\u003eEvery Adept had a Core, the center of their powers. For innate Talents they had it at birth, and it expanded with time and training. For them, the strength or lack thereof was determined by genetics.\u003c/p\u003e\n\u003cp\u003eWhen Adepts first appeared among the ranks of humanity, the very strongest were ninth ranked. The Paragons of today all arose from that basic metric, reaching their lofty heights through unending cultivation.\u003c/p\u003e\n\u003cp\u003eHaving an innate Talent was best, as was widely considered, though they didn’t have their supreme power from birth. If they did, their own raging energies would destroy them. Like anyone they else they, too, required training. Through cultivation they could inspire their Core to grow, to expand and interact with the external energies that make up the world around them. With time, their power expands to great heights.\u003c/p\u003e\n\u003cp\u003eBut the training regimens were difficult, and boring. Many average Talents were stuck in mediocrity because they couldn’t bear the process. They squandered their opportunities, and the time for proper training passed them by. The foundation was never built, and thus they remained average, for the rest of their lives.\u003c/p\u003e\n\u003cp\u003eThe Core of an Adept wasn’t set, and it’s location was different for each person. The Psychic Tide, for instance, had her Core between her eyebrows. It was the optimal location for her particular Talent. For many high-level Adepts, their Core was fixed in the pit of their stomachs. Mika and Ke’er were counted among them. Then there were special cases, like Xiuxiu. Her core was actually in her right arm. So, in combat, she led with her right.\u003c/p\u003e\n\u003cp\u003eLan Jue’s own Core was in the pit of his stomach. However, in contrast to most Adepts, his Core was different.\u003c/p\u003e\n\u003cp\u003eHis was diamond shaped, suspended in the exact center of his torso. It was a deep, endless blue. It twinkled with light as Lan Jue breathed, firing off in all directions with each inhalation, and shimmering as he exhaled. How often it did so was a result of his heart rate and respiration.\u003c/p\u003e\n\u003cp\u003eSurrounding the diamond core, a pure white light shone. It was a bolt of white lightning that flickered rapidly with power, faster than the normal human eye could fathom. However, it’s instability was clear.\u003c/p\u003e\n\u003cp\u003eBoth his Core and that bolt of lightning seemed dimmer than they should be. Their flickers, slow. This was undoubtedly a result of Lan Jue’s careful control.\u003c/p\u003e\n\u003cp\u003eThunder and lightning were the most explosive of the Disciplines. In combat, their strength was renowned. The drawback was it’s instability, for it was just as volatile as it was potent. To protect himself from this, the first thing Lan Jue did after his injury was block his Core’s power. Had he not, the fluctuating force of his Discipline would have undoubtedly turned on his own body.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e“When you are able to bring your lightning and thunder together, blended as one, that is the moment you will be a Paragon! When you do, that will be your opportunity to follow in my footsteps.”\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe aged voice reverberated in Lan Jue’s ears. Any time that voice came to him, a dull pain followed. The unhappy memories of his youth came rushing back on the tides of that hateful sound.\u003c/p\u003e\n\u003cp\u003eThe tribulations of Tang Xiao and Jin Tao were serious, but compared to the suffering of his own youth they were the lucky ones. For him and his brother, their younger years were spent in hell! The fact they lived through it was damn near miraculous.\u003c/p\u003e\n\u003cp\u003eLan Jue gently shook his head, and awoke from his meditation. The motion also served to help him shake off those unwanted memories.\u003c/p\u003e\n\u003cp\u003eTo help wipe the bitter thoughts away his eyes peered out of the porthole to the universe beyond. Thanks to the relatively short distance between their destination and departure, there was no need for wormholes or Deep Sleep. He could sit and enjoy the view.\u003c/p\u003e\n\u003cp\u003eThe boundless horizons of the universe spread out before him. It didn’t matter how lofty your status, how great your powers, or how terrible your troubles… in the vastness of space they were less than nothing.\u003c/p\u003e\n\u003cp\u003eIn the distance a pale blue orb spun silently in the dark. Even from out here it was easy to see Taihua’s allure. Blues and greens melded together as the dominant hues. It appeared as though Lan Jue’s silent ruminations were not brief. They would soon arrive at their destination.\u003c/p\u003e\n\u003cp\u003e“It really is just \u003cem\u003efull\u003c/em\u003e of vitality!” Jin Yan sighed in admiration as she stared at the nearing planet.\u003c/p\u003e\n\u003cp\u003eLan Jue nodded slowly. “Just so. Certainly worthy of being a tourist destination. I hope it’s a rewarding trip.”\u003c/p\u003e\n\u003cp\u003e“You’ve never been to Taihua before?” Jin Yan asked, somewhat puzzled.\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I’m not actually from Skyfire. I haven’t really visited the surrounding areas.”\u003c/p\u003e\n\u003cp\u003eThis captured Jin Yan’s interest. “Oh, so where does our Professor Lan hail from?”\u003c/p\u003e\n\u003cp\u003e“The home world.”\u003c/p\u003e\n\u003cp\u003e“Home world? Isn’t the environment there already unbearable? The destruction of the previous area was terrible. If it weren’t for the following interstellar migration, then the homeworld…” Jin Yan stopped, winced apologetically, and sneaked a peek at Lan jue.\u003c/p\u003e\n\u003cp\u003eHe grinned, the expression making it clear he didn’t mind. “You’re right! The ignorance of our race almost completely destroyed our ancestral home. But that’s our home, the origin of our lineage. In fact Taihua looks a little like our home world once did. If the home world had never suffered the scars of that chaos, it’d be just as beautiful.”\u003c/p\u003e\n\u003cp\u003e“Attention please. We’ll be entering Taihua’s atmosphere shortly. Please fasten your seat belts.” The warning and subsequent beeps aroused the travelers from their slumber. Jin Yan pressed the buckles together until that tell-tale snap greeted her. Everyone settled firmly in their seats.\u003c/p\u003e\n\u003cp\u003eThe ship was rocked with a violent jolt, and the porthole became obscured by a fiery red light. The interior lights of the ship flickered on and off as they tore through Taihua’s upper atmosphere.\u003c/p\u003e\n\u003cp\u003eThe journey through the thickening air was a short one, and as the friction eased so did the violent shaking. The ship stabilized, and the scenery returned to view outside the porthole. Moisture dotted the glass as they tore through the clouds, followed by a slight tremble as the ship began to reduce it’s speed.\u003c/p\u003e\n\u003cp\u003eAs the mist cleared the dazzling blue ocean was revealed. Where it ended a vast expanse of green met the sea. For many of the teachers it wasn’t their first time visiting the planet, but they still had their faces glued to the porthole. One after the other they sighed in appreciation.\u003c/p\u003e\n\u003cp\u003e“It’s beautiful.” Lan Jue, too, could not stop himself from speaking his mind.\u003c/p\u003e\n\u003cp\u003e“It is! So pretty. If I could move here after I retire it would be incredible.” Jin Yan’s voice was full of yearning.\u003c/p\u003e\n\u003cp\u003e“I thought development was banned,” Lan Jue said, “You can still settle here?”\u003c/p\u003e\n\u003cp\u003e“There’s a small section open for development, to benefit tourism,” Jin Yan explained. “And you know as well as I that in the East there’s nothing money can’t accomplish. If you really wanted to live here it wouldn’t be impossible, just very, very expensive. At any rate it’s more than any of us could afford.”\u003c/p\u003e\n\u003cp\u003e“I see,” Lan Jue replied.\u003c/p\u003e\n\u003cp\u003eThe ship began to descend. It was slow, in order to allow the passenger to adept to the change in cabin pressure. Half an hour later the ship was touching down on a tarmac surrounded by verdant green forests.\u003c/p\u003e\n\u003cp\u003eAs the doors opened they were struck by the moist, fresh winds.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-130\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-132\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-131","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
