{"id":56236,"no":14,"title":"Chapter 14: New Bridegroom","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 14: New Bridegroom \u003c/strong\u003e\u003cstrong\u003eRichard\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe gardens of the magnificent building were swarmed with people, especially around the outdoor swimming pool. The immaculately dressed patrons were sampling the fine wines and beverages, while likewise engaging each other in conversation.\u003c/p\u003e\n\u003cp\u003eIn these sorts of situations no one would dare speak loudly. It was essential to maintain one’s demeanor.\u003c/p\u003e\n\u003cp\u003eAs the people milled, an enormous gemstone-blue verti-car appeared in the distance, cresting the mountain.\u003c/p\u003e\n\u003cp\u003eThe airship was easily ten times the size of the average verti-cars docked nearby, comparable in size to a small airship. As it neared the peak of the mountain it began to descend. A reserved section of the parking area had been set aside.\u003c/p\u003e\n\u003cp\u003e“He’s coming,” people whispered.\u003c/p\u003e\n\u003cp\u003eAs the vehicle drew nearer, the dual patterns on it’s sides became visible; two hearts conjoined, one red and one blue. The red heart represented the Eastern Alliance, while the blue naturally signified it’s Western Alliance counterpart. This wedding would have major significance for both.\u003c/p\u003e\n\u003cp\u003eA man in his forties, his posture tall and straight, pushed through the crowds with an entourage of ten-odd people.\u003c/p\u003e\n\u003cp\u003eHe stood straight in a fine suit, with short hair and a steadfast expression on his handsome features. He was a staple on all of the Eastern Alliance’s major television networks. Chief Minister Zhou Xue, the youngest Chief in the history of the Eastern Alliance, first among the Alliance’s luminaries.\u003c/p\u003e\n\u003cp\u003eAnd today he was the penultimate host. The magnificent estate in which this wedding was held was, in fact, his official residence.\u003c/p\u003e\n\u003cp\u003eTo be more accurate, this residence was the home of all Eastern Alliance chief ministers.\u003c/p\u003e\n\u003cp\u003eMinister Zhou Xue walked to the distant verti-car, pausing about thirty meters shy. A small smile graced his features as he watched the vehicle’s door slowly open.\u003c/p\u003e\n\u003cp\u003eAverage verti-cars had only one door, but this luxurious and enormous vehicle had two. When the doors opened two bodyguards appeared from within, clad in black suits and sunglasses. They took up positions near the door, one left and one right, framing the entrance as a very tall man with grey hair emerged.\u003c/p\u003e\n\u003cp\u003eHe was exceptionally tall, exceeding two meters, and though his hair was grey it was meticulously styled with pomade. He stepped from the car with a smile on his face, but he clearly bore himself with an air of importance.\u003c/p\u003e\n\u003cp\u003eA young man exited next. He wore a Steven Rich suit, goshawk pattern black crocodile leather shoes, and a black bow tie. His head was covered in fine blonde hair, styled to be aesthetically pleasing. He was a little thin, with two bright piercing blue eyes. He too was tall, very similar to the old man before him.\u003c/p\u003e\n\u003cp\u003eSeeing the two men, Minister Zhou Xue strode forward to greet them. The elderly gentleman similarly rushed to meet his host.\u003c/p\u003e\n\u003cp\u003eThe two men met with open arms for a large embrace.\u003c/p\u003e\n\u003cp\u003e“Austin, we meet again. I see you’re as statuesque as ever,” Minister Zhou Xue said with a chuckle.\u003c/p\u003e\n\u003cp\u003e“Zhou, you haven’t changed a bit. You cheated me the last time!” The elder gentleman grumbled.\u003c/p\u003e\n\u003cp\u003eThe Chief laughed. “This is an auspicious day for our children! Let’s not discuss business. We’ll talk later. From today, we’re one family, how could I cheat you? From now on how about I just call you Sylva, eh?”\u003c/p\u003e\n\u003cp\u003eSylva Austin was head of the Austin family, and Prime Minister of the Western Alliance. The Austin family was the single most prominent family of the Western Alliance.\u003c/p\u003e\n\u003cp\u003e“Of course,” Austin chortled. He turned his head to look at the young man behind him. “Richard, come and greet your father in law.”\u003c/p\u003e\n\u003cp\u003eChief Zhou smiled. “There’s no need for formalities. You’ve had a long and tiresome journey. Come in and rest, everything’s already set for the ceremony. We’ll wait a little while before we start, yes?”\u003c/p\u003e\n\u003cp\u003e“Indeed. It’s almost that time, you’ve gone through a lot of trouble yourself Zhou,” Austin replied.\u003c/p\u003e\n\u003cp\u003eFrom within the sapphire verti-car an entourage of more than ten individuals exited, silent as mice, moving with practiced instinct to surround the man and his son.\u003c/p\u003e\n\u003cp\u003eSylva Austin found it difficult to relax. As Chief Zhou lead him through the crowds, the myriad officials and lauded guests lined up to greet them. He met each with poise and grace, returning their acknowledgements with flawless etiquette.\u003c/p\u003e\n\u003cp\u003eRichard Austin smiled courteously through the process, but concealed in his eyes was anticipation.\u003c/p\u003e\n\u003cp\u003eOriginally, when he’d first laid eyes on Minister Zhou Xue’s daughter Zhou Qianlin, he mistook her for an angel. Though his father opposed, he was adamant in his affections for her. Zhou Qianlin herself never paid him any mind, until he spent a vast sum of money to conduct a romantic proposal. From then on she began to respond.\u003c/p\u003e\n\u003cp\u003eBoth were descendents of prominent families, and it involved two powerful alliances. Sylva Austin and Minister Zhou Xue discussed the matter seven times, eventually coming to an agreement both sides could accept, and the grand wedding was set.\u003c/p\u003e\n\u003cp\u003eOf the three great alliances, the Northern Alliances was clearly the strongest, followed by the West. The Eastern Alliance was considered the least dominant, but the difference between it and the Western Alliance was negligible. Both needed a powerful ally.\u003c/p\u003e\n\u003cp\u003eFaced with the prospect of embracing his beautiful bride, Richard could hardly contain his excitement. From the moment he’d begun pursuing Zhou Qianlin, their hands had never even touched! In this moment, his brain was filled with images of beautiful black hair, striking blue eyes and an angelic figure. In his heart, this wedding had absolutely nothing to do with the political implications.\u003c/p\u003e\n\u003cp\u003eFinally disentangling themselves from greeters and well-wishers, the Austins found their way in to the lounge. With little time before the start of the ceremony, Minister Zhou Xue left the two gentlemen to be with the bride’s family. He still had a few small things to prepare.\u003c/p\u003e\n\u003cp\u003e“Richard, I hope you understand the price I paid to help you with this wedding,” Sylva Austin said with a sigh.\u003c/p\u003e\n\u003cp\u003eRespectfully, Richard responded. “Father, thank you for your help.”\u003c/p\u003e\n\u003cp\u003eSylva shook his head. “There is no need for that sort of talk between father and son. If this woman is as Minister Zhou Xue has said, you mustn’t only marry her, you must thoroughly subdue her. Make her a part of the Austin family. The Eastern Alliance has grown swiftly these last few years, and Zhou Xue is a formidable man. Hopefully this marriage will benefit us in other ways.\u003c/p\u003e\n\u003cp\u003eRichard uttered not a sound. He was the groom, and in his heart, there was only his bride.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-13\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-15\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-14","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
