{"id":56380,"no":158,"title":"Chapter 158: Comparing Notes","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 158: Comparing Notes\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHua Li’s face looked pitiful. “Can I not participate? I’ve been doing nothing \u003cem\u003ebut\u003c/em\u003e training these last two days. At this pace I’m gunna die, I can feel it.”\u003c/p\u003e\n\u003cp\u003eLan Jue’s countenance grew hard. “Stop whining. At your level you think I believe a little singing and dancing makes you that tired?”\u003c/p\u003e\n\u003cp\u003eHua Li’s eyes nearly popped out of his head. “Shit A-Jue. Have you ever actually \u003cem\u003ewatched\u003c/em\u003e one of my concerts?”\u003c/p\u003e\n\u003cp\u003eLan Jue waved a hand dismissively. “Looking at you is enough. What’s the point of seeing one of these prancing shows of yours?”\u003c/p\u003e\n\u003cp\u003eChu Cheng, standing next to him, laughed at their exchange. “There’s a connection between his physical prowess and his fame, you know. He puts his Discipline to good use during his concerts, too. It’s not just singing and shaking his ass. Some crazy special effects. When he says he’s tired I believe him. And in the end, who knows how hard Mo Xiao pushes him.”\u003c/p\u003e\n\u003cp\u003e“Lan Jue!” Hua Li nearly gnashed his teeth at his friend, grabbing his nose between his fingers. “I hate your face! You’ve \u003cem\u003ereally\u003c/em\u003e never seen one of my concerts!? You don’t know people say I’m the most handsome of my whole familial dynasty? No wonder you haven’t shown the least bit of interest. I am the greatest celebrity ever known, and when I’m dancing on that stage you have no idea how handsome, charming and awesome I really am!”\u003c/p\u003e\n\u003cp\u003eLan Jue simply rolled his eyes. “Why should I be interested? Isn’t it mostly young girls that are infatuated with you?”\u003c/p\u003e\n\u003cp\u003eHua Li’s white-knuckle grip relaxed as he fell in to a combat pose. “We’re settling this, right now!”\u003c/p\u003e\n\u003cp\u003eLan Jue rubbed his nose. “Fine, soon. You pinch my nose like that and you’re asking to be put in the ground.”\u003c/p\u003e\n\u003cp\u003e“No doubt,” Chu Cheng interrupted. “What kind of man are you anyway? A-Jue’s only just recovered from his injuries and here you are being so rough. If I were you, A-Jue, I wouldn’t put up with any of this nonsense. You should beat the crap out of him on principle. I’ll be the ref.”\u003c/p\u003e\n\u003cp\u003eBoth Lan Jue and Hua Li turned the force of their glare onto Chu Cheng. He instantly shrunk away. “I’m just trying to seek out justice here, right, looking out! What’s all this hostility alluva sudden?”\u003c/p\u003e\n\u003cp\u003eHua Li’s cantankerous voice growled at him. “People who stir up shit are the worst kind. A-Jue, you and I will beat on this piece of trash, then we’ll see what’s up.”\u003c/p\u003e\n\u003cp\u003eLan Jue’s fists tightened. “I like it. It’s far past time we shut this guy up. Always sitting here profiting at other people’s expense.”\u003c/p\u003e\n\u003cp\u003eChu Cheng’s response was angry, indignant. “The hell is wrong with you two, treating me like this? You really take me for that sort of person?”\u003c/p\u003e\n\u003cp\u003e“Yes!” Hua Li and Lan Jue shouted in unison.\u003c/p\u003e\n\u003cp\u003e“Ah, Professor!” Their heated exchange was interrupted by the surprised cry from behind them. Lan Jue turned his head to spy the large silhouette bounding towards him.\u003c/p\u003e\n\u003cp\u003eLan Jue lifting his hands to protect himself from the jiggly onrush of his student. “Use your words there, kid, save all this gesticulating for the ring. Don’t you know how heavy you are?”\u003c/p\u003e\n\u003cp\u003eTang Xiao hobbled excitedly towards his teacher, his moon-shaped face jiggling. “It’s good to see you back, Professor. Miss Mika’s been great with me the last few days, studiously teaching me. Miss Lin Guoguo as well. Under their guidance my power has increased by leaps and bounds!”\u003c/p\u003e\n\u003cp\u003eLan Jue couldn’t help himself in the face of the kid’s sincerity, and actually ruffled his disciple’s hair. “Good, keep it up, reign in that sensitivity. Later I’ll see for myself how far you’ve come. Right now it’s time for us to head to the Reaper’s Arena.”\u003c/p\u003e\n\u003cp\u003e“Huh? There’s no need, Professor, here should be fine. I was told only Adepts with high levels of power need to go to the Arena. Miss Mika’s teachings are enough for me, there’s really no need for you to bother yourself with me.”\u003c/p\u003e\n\u003cp\u003eThe kid was really scared! He was working fine with the two women. It was harsh, but his improvement was obvious to anyone who saw – only, with them sometimes he was beaten so badly he hardly wished to live. How much worse would it be with his Professor doing the beating? From what he was hearing, it sounded like Professor wanted to take matter in to his own hands, literally. Though he’d never actually witnessed Lan Jue’s true power, he could guess considering how powerful Mika and Lin Guoguo were. Would he even live to see home?\u003c/p\u003e\n\u003cp\u003eLan Jue smiled mirthfully. “Don’t be scared. Today you get to rest, just watch and learn.”\u003c/p\u003e\n\u003cp\u003e“Oh.” Tang Xiao breathed a sigh of relief and said nothing more. He respectfully took a step to the side, out of their way. With so much power around him, he didn’t dare resort to his more wily tendencies. He turned his head and looked at Jin Tao, sleeping fitfully in the nourishment pod. This guy! He was the lucky one, asleep and unaware.\u003c/p\u003e\n\u003cp\u003eReaper’s Arena.\u003c/p\u003e\n\u003cp\u003eLan Jue busied himself with setting up their special combat arena, employing the special control apparatus the Wine Master had given him.\u003c/p\u003e\n\u003cp\u003eZeus’ Amazons and Jin Tao sat in a separate area, with a panoramic view of the layout. Only Lan Jue, Hua Li and Chu Cheng remained inside.\u003c/p\u003e\n\u003cp\u003e“It looks like second brother [1. Here I believe he’s referring to Chu Cheng] was right when he said you’re doing much better. Are you feeling alright?” Hua Li asked.\u003c/p\u003e\n\u003cp\u003eLan Jue nodded. “I’ve already checked things out for myself, and I can honestly say I can’t be any better. I can’t figure out \u003cem\u003ehow\u003c/em\u003e I ended up recovering so well. In fact, did you guys see anything out of the ordinary when you arrived that day?”\u003c/p\u003e\n\u003cp\u003eHua Li spoke up. “When we got there we found you asleep in a hollowed out hole, in something that looked like white rock. I went over to check on you myself and you were fine; calm, breathing. It was like you’d never gotten injured at all.”\u003c/p\u003e\n\u003cp\u003e“A white rock?” Lan Jue felt a flash of… something, but he couldn’t pinpoint precisely what was striking about Hua Li’s statement. Nor could he recall any of the methods the Doctor used to treat him at the time.\u003c/p\u003e\n\u003cp\u003e“Alright, well we’ll leave that discussion for another time. So bring it, which one of you two is first?” Lan Jue swept his eyes between his fellow Monarchs.\u003c/p\u003e\n\u003cp\u003eChu Cheng gave him a surprised look. “What? You’re thinking two on one?”\u003c/p\u003e\n\u003cp\u003eLan Jue smirked. “Just taking advantage of an opportunity, what’s wrong with two on one? Didn’t you say earlier you were planning on uniting with A-Li against me? A-Cheng, you’re getting more cunning every time I see you.”\u003c/p\u003e\n\u003cp\u003eChu Cheng snorted, puffing his chest out with pride. “What kind of person do you take me for? A-li, let me deal with this punk first. Three years with his thumb up his keister, I’m positive he’s lost all his edge.”\u003c/p\u003e\n\u003cp\u003eHua Li shrugged. “Alright, he’s all yours then.” He lunged back a few steps to give them adequate room. He didn’t exit to the observation platform, though, but remained at the edge of the ring.\u003c/p\u003e\n\u003cp\u003eLan Jue and Chu Cheng stared at each other from across the arena. Little by little their respective expressions became calm and impassive. The two knew each other exceedingly well. Lan Jue had indeed been languishing in sorrow the last three years, but in reality Chu Cheng didn’t in the least underestimate or look down upon his friend and mercenary companion. He knew as well as any that of the Divine Monarchs, it was Lan Jue’s Discipline that was the most destructive.\u003c/p\u003e\n\u003cp\u003eLan Jue looked back at his friend, still and unchanged. He was calm, like the surface of a lake. They stood in silence, staring, until a change overcame them.\u003c/p\u003e\n\u003cp\u003eA crimson hue slowly began to overtake Chu Cheng’s eyes until they looked like burning charcoal. A powerful, stifling aura arose in tandem, and the air around him shimmered as though viewed through extreme heat.\u003c/p\u003e\n\u003cp\u003eMika muttered to herself within the observation platform. “Heat-based Discipline.”\u003c/p\u003e\n\u003cp\u003eLan Jue, meanwhile, was undergoing his own changes. Coiling arcs of electricity flashed across his vision, until his eyes were a startling electric violet. Flashes of power sparked from behind his lids. The unsettling crackle of lightning filled their ears, making skin crawl.\u003c/p\u003e\n\u003cp\u003eSuddenly, both of them were on the move. There seemed to be some tacit agreement not to employ their Disciplines just yet. Lightning arced from Lan Jue off to the sides.\u003c/p\u003e\n\u003cp\u003eChu Cheng’s lithe figure launched in to the air, spreading out like some terrible bird. With a twist he was tumbling towards Lan Jue delivering a flurry of kicks.\u003c/p\u003e\n\u003cp\u003eLan Jue made no move to retreat, but instead kept up the advance. He did not leave the ground to meet his assailant. His hands shot up, however, and pressed at the air towards Chu Cheng.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBang bang, bang bang!\u003c/em\u003e The sounds of impact filled the arena. With each one the air filled with sparks of lightning and fire.\u003c/p\u003e\n\u003cp\u003eChu Cheng fell back to earth with a graceful backflip. He glared across the field and growled while hungry flames exuded from him. Everything around him was illuminated by the angry blaze. If one were to look carefully, they would see drops of golden-red fluid dripping from him.\u003c/p\u003e\n\u003cp\u003eLan Jue chuckled. “Who are you trying to scare?” As he spoke lightning began to coil up his form. With a flash he became covered in a crystalline blue light.\u003c/p\u003e\n\u003cp\u003eStrangely, it wasn’t just the color of him that changed. He almost looked as though he were composed of crystal himself. There were no sparks, no thunder – it was as though his Discipline simply manifested.\u003c/p\u003e\n\u003cp\u003e“Eh?” Chu Cheng couldn’t help but vocalize his surprise. This was different, and until this moment he was sure he was totally familiar with Lan Jue’s abilities.\u003c/p\u003e\n\u003cp\u003eElectromorphosis! This was among Lan Jue’s most powerful of abilities. It helped to amplify his thunderbolt Discipline. But despite what he knew, this wasn’t the same. Usually when he employed this power, he would be a mess of lightning bolts and electric light – but not this time. When did he learn to control his Discipline so well, Chu Cheng thought, to keep it in check? Not a single iota of his power was escaping his grasp. But hadn’t he been in hiding for three years, without any training? Not judging by what he was seeing!\u003c/p\u003e\n\u003cp\u003eHe was surprised, but Chu Cheng was too good – too much a professional to let that deter him. Without stopping, he lashed out with a chopping motion towards Lan Jue.\u003c/p\u003e\n\u003cp\u003eA roaring, frightening wall of flame came racing towards the Jewelry Master. The heat it released was so great that the area it passed warped nauseatingly.\u003c/p\u003e\n\u003cp\u003eBut Lan Jue didn’t move, made no effort to sidestep. It was almost as though he hadn’t noticed the fiery wall that was crashing down towards him. With his hands pressed against his chest, his powers seemed even more restrained.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBoooooommm!\u003c/em\u003e The fiery attack landed a direct hit, and Lan Jue was lost amongst the roiling flames. Flame and smoke rose to the heavens like a volcanic eruption. Odd crimson orbs were interlaced in the fiery column, rising from the point of impact. The heat was so intense Zeus’ amazons and Tang Xiao could feel it from the observation platform.\u003c/p\u003e\n\u003cp\u003eThe overweight disciple looked on, silent as a mouse. He thought Mika’s fiery discipline was frightening to behold, but the difference in power was clear as he watched this young master at work. Whether power, prestige or intimidation factor, he was on a whole other level.\u003c/p\u003e\n\u003cp\u003eMika herself looked on with a manic flash in her eyes. The power and purity of his Discipline was astonishing. She felt the explosive power of it when the attack landed. He was at least ninth level fifth rank, by her estimation, if not stronger. This was definitely her chance to learn and improve, she thought.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-157\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-159\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-158","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
