{"id":56240,"no":18,"title":"Chapter 18: A Place Called A Hospital","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 18: A Place Called A Hospital\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe lay against his wide, sturdy chest, the kind that made people feel safe.\u003c/p\u003e\n\u003cp\u003eHer lily-white, gem encrusted dress; her exquisite tiara; her dazzling tecnicolor veil. All had been cast beside the sofa.\u003c/p\u003e\n\u003cp\u003eHe gently stroked her hair, which had already begun to unravel. Three years of suffering, poured out in a day. Despite her illness, he shut his eyes in relief.\u003c/p\u003e\n\u003cp\u003eHe didn’t see her brows furrow, or her bite her lip, but the shift in muscle was felt beneath his fingertips. “What is it, Jinyu. Why knit your brow?”\u003c/p\u003e\n\u003cp\u003e“Do you know who I am? Who’s here to cure you?” Lan Jue’s deep voice asked. “It doesn’t matter who it was, they’ll pay for what they did to you.”\u003c/p\u003e\n\u003cp\u003e“Do you really know me?” Zhou Qianlin quavering voice asked.\u003c/p\u003e\n\u003cp\u003e“Huh?” Lan Jue turned her over in his arms, looking in to her eyes.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin lifted her head to regard him, looking at him in earnest. It felt as though his face had been branded in to her mind.\u003c/p\u003e\n\u003cp\u003e“Of course I know who you are. You’re my wife. My Hera. My Jinyu. Zhou Jinyu.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I-I’m not Zhou Jinyu. I’m Zhou Qianlin.”\u003c/p\u003e\n\u003cp\u003e“Wha-“ Lan Jue started, moving to sit by her side and looking at her closely. No, it was definitely Hera! Black hair, blue eyes… How could she not know who she was? Even her scent, exactly as it was before.\u003c/p\u003e\n\u003cp\u003e“Beloved… Is it, amnesia?” Lan Jue asked with uncertainty.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin drew the covers closer, saying quietly, “Can I ask you something?”\u003c/p\u003e\n\u003cp\u003e“Anything,” Lan Jue replied.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin’s eyes shone as she looked at him. “You said this Jinyu is your wife… then… you’ve had relations before?”\u003c/p\u003e\n\u003cp\u003e“Of course! You really don\u0027t know?” Lan Jue was unconvinced.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin nodded her head, then moved the comforter to the side. She pulled them from Lan Jue’s body.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin\u0027s fair features grew red, and she turned her face to avoid looking at him. Her hand slipped from beneath the sheets and pointed. “Well, then look at this.”\u003c/p\u003e\n\u003cp\u003eA sense of trepidation filled Lan Jue’s heart. When he dropped his head to look, he was nearly petrified.\u003c/p\u003e\n\u003cp\u003eThere, he saw a fresh smear of red.\u003c/p\u003e\n\u003cp\u003eIt was quiet, quiet as the grave.\u003c/p\u003e\n\u003cp\u003eAfter a moment Lan Jue spoke, his voice strange. “I’m sorry. I didn’t know you were…”\u003c/p\u003e\n\u003cp\u003eThis time, it was Zhou Qianlin who was speechless.\u003c/p\u003e\n\u003cp\u003eHer body trembled, her lip quivered, her teeth clenched. It was as though she were afraid a curse would burst forth from her lips.\u003c/p\u003e\n\u003cp\u003eAfter some time her mood stabilized. She hissed coldly through gritted teeth:\u003c/p\u003e\n\u003cp\u003e“This was my first time!”\u003c/p\u003e\n\u003cp\u003eLan Jue was dumbstruck. How could this be? He shook his head.\u003cem\u003e No… this can’t be true.\u003c/em\u003e His heart sunk to the pit of his stomach.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eFirst time? What did she mean the first time? It meant… she wasn’t Hera. \u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eMy Hera, my Jinyu. She still hasn’t returned to me. \u003c/em\u003eLan Jue felt as though he’d been run through with a sword. The pain in his heart stole his breath.\u003c/p\u003e\n\u003cp\u003eWatching Lan Jue’s face drain of color, she too was dazed. The room sank in to a suffocating quiet.\u003c/p\u003e\n\u003cp\u003eLan Jue’s pained voice arose as he spoke to himself. “Three years. Three years. Why would God play such a cruel trick on me? Why give me hope? Don’t you understand… the more you hope, the more crushing when it’s gone. My Hera… still hasn’t returned.”\u003c/p\u003e\n\u003cp\u003e“So what you’re saying is, what you just did to me wasn’t intentional.” Zhou Qianlin’s cold voice interrupted.\u003c/p\u003e\n\u003cp\u003e“Huh?” Her words snapped Lan Jue awake. Seeing here, this woman an exact replica of his Hera, somehow eased the suffering in his heart.\u003c/p\u003e\n\u003cp\u003eYes! She wasn’t Hera, but she and her…\u003c/p\u003e\n\u003cp\u003eAnd, it had been her first time.\u003c/p\u003e\n\u003cp\u003eFurther, the unification of the Eastern and Western Alliance leaders through this marriage.\u003c/p\u003e\n\u003cp\u003eMost important was that she knew who she was. Even if she didn’t know, her family certainly would. In his arrogance he’d let slip his name, sharing with her father regardless of the situation that his name was Zeus.\u003c/p\u003e\n\u003cp\u003eWhat to do?\u003c/p\u003e\n\u003cp\u003eLan Jue felt his heart thumping in his chest. In all his life, he’d never encountered such an awkward situation.\u003c/p\u003e\n\u003cp\u003eBut it was done. Other than facing it, what else could he do?\u003c/p\u003e\n\u003cp\u003e“W-well, Zhou Qianlin, you’d been poisoned. Were suffering from it’s effect. So, I was forced… against my will to…”\u003c/p\u003e\n\u003cp\u003eZhou Qianlin glared at him, saying not a word.\u003c/p\u003e\n\u003cp\u003eLan Jue was incapable of alleviating the situation. He knew of only one solution for the current problem.\u003c/p\u003e\n\u003cp\u003eThe dead don’t talk.\u003c/p\u003e\n\u003cp\u003eKill her, and the problem would be gone!\u003c/p\u003e\n\u003cp\u003eAnd yet, could he do it?\u003c/p\u003e\n\u003cp\u003eZhou Qianlin uttered, “I have an older sister… I think her name is Zhou Jinyu. She disappeared when I was young. Where did you meet her?”\u003c/p\u003e\n\u003cp\u003eLan Jue stared at her. “An older sister?” She was Jinyu’s younger sister, but Jinyu had told him she was an orphan!\u003c/p\u003e\n\u003cp\u003eA younger sister separated for that long?\u003c/p\u003e\n\u003cp\u003eHe didn’t know what to think.\u003c/p\u003e\n\u003cp\u003eEven if he could do it, silencing her wouldn’t actually solve everything.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin shot him another cold glance. “You just said I’d be poisoned. That’s why you did that to me?”\u003c/p\u003e\n\u003cp\u003e“Yes, yes!” Lan Jue nodded emphatically.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin’s expression changed, and she sat up abruptly. With eyes wide she glared at Lan Jue and yelled, “Have you never heard of places called HOSPITALS on this planet? What sort of poison could a modern hospital not cure? You could have sent me to the hospital. If I’m poisoned how does sleeping with me fix anything?\u003c/p\u003e\n\u003cp\u003e“I…” Lan Jue stared at her dumbly, dropping his head after a moment. Not knowing whether to laugh or cry, he muttered, “I thought you were someone else.”\u003c/p\u003e\n\u003cp\u003eZhou Qialin’s expression was pained, possibly due to the pain in her body.\u003c/p\u003e\n\u003cp\u003e“Put your clothes on. I don’t want to look at your hideous self. I’m afraid I’ll get a stye.” She shook her head violently for him to leave.\u003c/p\u003e\n\u003cp\u003eLan Jue scrambled to his feet, quickly pulling on his clothes. As he did, his eyes fell upon the wedding dress crumbled atop the sofa. “It was probably your fiancé who poisoned you. To go so far as to poison your own new wife… this sort of scumbag, you’re better off not marrying him.”\u003c/p\u003e\n\u003cp\u003eZhou Qianlin shot him a glare. “How do you know it was him? Before then, he had never even touched me. Scumbag? YOU’RE the scumbag! And even if he was, at least he didn’t break the law. You? You destroyed my wedding, and defiled my body. You tell me, what are we going to do about that?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-17\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-19\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-18","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
