{"id":56241,"no":19,"title":"Chapter 19: Same Clothes, New Person","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 19: Same Clothes, New Person\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eZhou Qianlin glared at Lan Jue. “You tell me, what are we going to do about that?\"\u003c/p\u003e\n\u003cp\u003eLan Jue took a deep breath. “What’s done is done. It was my fault. All of this was because I mistook you for someone else. I don’t know how I can make up for this either. You tell me what I can do, and I’ll do it.” The mistake had been made. He was a man, and had to face up to his wrongdoings, doing everything in his power to make it right.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin stared at him, her eyes a tangle of emotions. Lan Jue had changed, no longer dressed in the clothes he’d worn when we abducted her.\u003c/p\u003e\n\u003cp\u003eHe wore a white shirt, and paneled deep blue pants. His neat clothes and his tousled hair gave a strange merger of order and chaos.\u003c/p\u003e\n\u003cp\u003eThat dangerous glint in his eye from before was gone, and he’d assumed a more apologetic stance, like a child who’d done wrong.\u003c/p\u003e\n\u003cp\u003eNibbling her lower lip, Zhou Qianlin got up from the bed.\u003c/p\u003e\n\u003cp\u003e“Find me some clean clothes.”\u003c/p\u003e\n\u003cp\u003e“Right away.” Lan Jue spun on his heel and left without hesitation. He’d only gone a few steps before pausing, then went directly to the closet furthest inside the apartment.\u003c/p\u003e\n\u003cp\u003eHe paused before the closet as though uncertain, opening it after a moment’s consideration. He quickly grabbed a few articles of clothing from within and returned to Qianlin.\u003c/p\u003e\n\u003cp\u003eQianlin regarded him coldly. “You seem awfully practiced at bringing women home.”\u003c/p\u003e\n\u003cp\u003eArriving before her, he gently placed the clothing at her side. A spark of sadness shone in his eyes. “Your sister’s.”\u003c/p\u003e\n\u003cp\u003eZhou Qianlin stared at him, catching that passing look. Though Lan Jue hid it well, his innermost anguish was too profound to hide completely.\u003c/p\u003e\n\u003cp\u003eLifting the clothes by her side, she caught a whiff of a clear and refreshing scent. Each piece had been painstakingly folded. Lan Jue looked on, watching the clothes as though they were precious pieces of jewelry.\u003c/p\u003e\n\u003cp\u003eEven on Skyfire Avenue, even close friends, none knew that in the Jewelry Master’s heart the closet of clothes was more precious than his entire stock.\u003c/p\u003e\n\u003cp\u003e“Hey!”\u003c/p\u003e\n\u003cp\u003eLan Jue was shaken from his reverie. He lifted his head, looking directly in to Zhou Qianlin’s hard stare.\u003c/p\u003e\n\u003cp\u003e“I’m sorry.” He pressed his hand to his chest, an unconscious habit of his gentile mannerisms. He turned away and stepped aside.\u003c/p\u003e\n\u003cp\u003eA quiet rustling could be heard from behind him, but there was no excitement in Lan Jue’s heart. In truth it was drowned in disappointment and sadness.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eShe is not Jinyu, even if she looks just like her. She’s not my Hera. \u003c/em\u003eWhere it not for the grief in his heart, and the fact she was her sister, Lan Jue never would have opened that closet. Of course, it was merely to make amends that he opened it.\u003c/p\u003e\n\u003cp\u003eFootsteps approached, and Lan Jue subconsciously turned his head.\u003c/p\u003e\n\u003cp\u003eShe wore a long dress, white as snow, and a little thin. Tight-fitting but modest, with no extra fabric. Though the spotless dress was unadorned, the gem-encrusted gown she’d worn to the wedding made it look downright plain.\u003c/p\u003e\n\u003cp\u003eHowever, that raven black hair melded beautifully with the white dress. Those deep blue eyes were like the most fetching gems on the planet. Her beauty was almost otherworldly, perfect in every detail. Such beauty that it took your breath away.\u003c/p\u003e\n\u003cp\u003e“Jinyu…” his voice trembled.\u003c/p\u003e\n\u003cp\u003eShe rose to her feet and moved towards him. In an instant she found herself wrapped in a firm, warm, shivering embrace.\u003c/p\u003e\n\u003cp\u003eThe hug was like a thaw, and though she should have been angry she instead found herself almost automatically returning the embrace.\u003c/p\u003e\n\u003cp\u003e“Jinyu, my Hera, I miss you so much,” Lan jue, his eyes closed as though trying to keep a hold on the past. He seemed unaware his body had grown so feverish.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin tried to admonish him several times, her mouth opening though no words came out. But in the end, she couldn’t bring herself to ruin what she saw in front of her.\u003c/p\u003e\n\u003cp\u003eWhat she saw was his intimacy, the fact that he still remembered her favorite color, an unblemished white. Contrary to the common woman she had no taste for fancy jewelry, in fact quite the opposite from Lan Jue. Moreover he kept saying she was the most precious gem he had. If a bottle of Romanee-Conti was considered some great treasure, then she could only be described as the most dazzling jewel in the crown of the gods.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin’s face softened, the chill leaving her features. In the face of today’s events any girl would have her rage clearly written on her features.\u003c/p\u003e\n\u003cp\u003eBut that burning hug, as though magic, melted her cold exterior. Her rigid body eased, and thus so did her heart.\u003c/p\u003e\n\u003cp\u003eIt is common for one man loves one woman, but it was unexpected to see this level of devotion.\u003c/p\u003e\n\u003cp\u003eThe coldness receded from her expression.\u003c/p\u003e\n\u003cp\u003eOne of his hands rested on her waist, the other gently stroking her messy hair. His tender ministrations helped settle it back in place.\u003c/p\u003e\n\u003cp\u003eThis was care, a care derived from the depths of the heart. An adulation more precious than life.\u003c/p\u003e\n\u003cp\u003e“Hera, Hera…” he whispered. She never gave a response. That familiar body, with that familiar scent, but without her tender voice.\u003c/p\u003e\n\u003cp\u003eLan Jue composed himself, suddenly standing straight and looking at the woman in his arms.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin looked like a frightened bunny, quickly extricating herself from his arms. She hugged her arms to her chest, features growing red from embarrassment.\u003c/p\u003e\n\u003cp\u003eLan Jue looked as though he were in a trance. His clothes were the same, he appeared no different, but the man was changed. The woman before him looked for all the world exactly like Hera. But she didn’t have her eyes, eyes which could melt the coldest heart.\u003c/p\u003e\n\u003cp\u003eA silence fell over the room. Lan Jue uttered not a sound, Zhou Qianlin never opened her mouth. Their hearts each were flooded with conflicting emotion, but the emotions in each were as different as night and day.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-18\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-20\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-19","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
