{"id":56412,"no":190,"title":"Chapter 190: I Beg You to Help Professor Tan","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 190: I Beg You to Help Professor Tan\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eZhou Qianlin was surprised. “Could he even be a match for Professor Tan?”\u003c/p\u003e\n\u003cp\u003eLe Ziqian nodded. “His name is Su He. Have you heard of him?”\u003c/p\u003e\n\u003cp\u003e“Su He? You don’t mean the East’s famous Su He, do you?” Qianlin’s eyes opened wide at the revelation. She stared at her professor, flabbergasted.\u003c/p\u003e\n\u003cp\u003eOnce again, he nodded. “I haven’t the slightest idea how Lir managed to convince him to join. It’s quite the problem. Even I’m impressed with the man, and I’m a hard one to enthuse. And unless I’m mistaken, we’ll be against him tomorrow for the research competition as well. Big problem. No wonder they agreed to it, with him on their side.”\u003c/p\u003e\n\u003cp\u003e“He was an academician at the Eastern R\u0026amp;D University by the age of twenty-six, and a Sovereign-ranked pilot. He should be around thirty-three now, about the same age as me. Differences in ability, however, are hard to determine. We participated in a competition before, and I envied his practical knowledge. In my youth, he was about the only person I truly admired.”\u003c/p\u003e\n\u003cp\u003eQianlin looked concerned. “What should we do, Professor?”\u003c/p\u003e\n\u003cp\u003eA familiar, bitingly cold female voice rang through the arena. “If this Lir University puppet is so vehement about it, who am I to deny him. If he beats me, they win – just like him. He won’t gang up like they want us to, to make us look cheap.”\u003c/p\u003e\n\u003cp\u003eLe Ziqian patted his forehead in frustration. “This temper of yours, Lingyun,” he said with a sigh. “I understand her thinking, but it’s misguided. Three on one, we might have stood a chance. In an even fight, though…”\u003c/p\u003e\n\u003cp\u003eHe trailed off, lost in some secret thought. He piped up again suddenly. “Mm, yes. This has to do with our Dean, Xu Renjian. Dean Xu’s research group is always in contest with Su He’s, and in fact the two are the largest in the alliance – with two radically different views on the subject. I fear Su He is here for one purpose, and that is to challenge Xu Renjian’s authority. \u003cem\u003eThat\u003c/em\u003e is why he’s with Lir University.”\u003c/p\u003e\n\u003cp\u003eQianlin thought in silence for a moment before replying. “Do you think he’ll take it too far?”\u003c/p\u003e\n\u003cp\u003eLe Ziqian’s answer was delivered through a bitter smirk. “I like to think I understand the man, at least a little. Ordinarily, the most striking feature about him is his calm. Almost apathetic. But this guy’s conceit runs to the bone. The student Tang Xiao beat was more than likely his little apprentice, so their fight will be about him regaining face. As for Lingyun…”\u003c/p\u003e\n\u003cp\u003eHe lapsed in to silence, anxiety clearly written on his face.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWang Hongyuan leaped to his feet. Lan Jue tried to yank him back down. “What are you doing?”\u003c/p\u003e\n\u003cp\u003eHongyuan slumped back in his chair. “Such an arrogant bastard. He wants to go three on one? Lemme show him what pride gets you.”\u003c/p\u003e\n\u003cp\u003eHe’d barely finished the sentence before Tan Lingyun’s voice filled the arena. A cheer went up from the audience around them.\u003c/p\u003e\n\u003cp\u003eLan Jue only smiled. “The Savage Goddess’ gumption really is impressive, eh?”\u003c/p\u003e\n\u003cp\u003e“Lingyun is strong,” Hongyuan conceded, “but do you think she’s strong enough to beat that punk?”\u003c/p\u003e\n\u003cp\u003eLan Jue shook his head.\u003c/p\u003e\n\u003cp\u003eWang Hongyuan gave him friend a scalding look. “You look down on her that much, eh? She’s an eight-ranked Disciple and a Sovereign-class pilot. You still don’t think she’s capable?”\u003c/p\u003e\n\u003cp\u003e“For him to propose this sort of contest, he must know more than the Lir leadership lets on. Plus, I know that man, and he’s undoubtedly stronger than Lingyun. His name is Su He,” Lan Jue remarked.\u003c/p\u003e\n\u003cp\u003e“Su He?” Wang Hongyuan wasn’t familiar with the name.\u003c/p\u003e\n\u003cp\u003eLan Jue stared at him blankly. “Professor Wang. You’re not from the Eastern Alliance, are you. Unless I’m mistaken, I’d say Western. If that’s the case, it’s no surprise you don’t know him.”\u003c/p\u003e\n\u003cp\u003eWang Hongyuan’s brows narrowed. “And that’s the reason for his vanity, I suppose. If Tan Lingyun should lose, I’m not sure this punk will stay his hand.”\u003c/p\u003e\n\u003cp\u003eLan Jue opened his mouth to speak, when suddenly that familiar warmth arose against his chest where the Soulcaller gem rested.\u003c/p\u003e\n\u003cp\u003eQianlin: \u003cem\u003eYou think you could help Professor Tan? That guy from Lir is supposed to be very strong.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue: \u003cem\u003eHow am I supposed to help her?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eI don’t know…\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e…\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eI’m begging you.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAgh…\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAre you unable to?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eFine.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eIs that your answer?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNgh.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThank you.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eNo problem. It’s been a long time since I’ve seen this guy. I’d be interested to gauge his progress.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHuh?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue said nothing further, and the Soulcaller gem cooled.\u003c/p\u003e\n\u003cp\u003e“I have to visit the restroom. Excuse me.” Lan Jue rose, and meandered his way through the crowd.\u003c/p\u003e\n\u003cp\u003eWang Hongyuan watched him leave from the corner of his eye. A smile spread across his face.\u003c/p\u003e\n\u003cp\u003eJin Yan poked him. “Where’s Professor Lan go?”\u003c/p\u003e\n\u003cp\u003e“The bathroom,” he answered. “Call of nature, he’ll be back in a bit.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eTan Lingyun cut the connection on her communicator. She watched Le Ziqian’s name fade from the screen.\u003c/p\u003e\n\u003cp\u003e“Su He!” Tan Lingyun’s pupils contracted. Le Ziqian’s revelations hadn’t deterred her, in fact only strengthening her resolve.\u003c/p\u003e\n\u003cp\u003eShe looked up, surrounded by Wu Junyi and no small number of instructors from the mecha combat department.\u003c/p\u003e\n\u003cp\u003e“Professor Tan.” Wu Junyi took a step forward.\u003c/p\u003e\n\u003cp\u003eShe took a deep breath. “I apologize, Director. I was impulsive. I should not have represented the school in that fashion. If we lose I’ll bear the consequences. You’ll have my resignation.”\u003c/p\u003e\n\u003cp\u003eWu Junyi shook his head, smirking. “Alas, the Dean asked me to come here and tell you, you’ve done well. Your decision is the school’s decision. Win or lose, just keep our school’s positive momentum going!”\u003c/p\u003e\n\u003cp\u003eTan Lingyun’s pretty face lit up in a rare smile, and she nodded her head. She settled on the floor, crossed her legs, and closed her eyes. She had to mentally prepare for what was to follow.\u003c/p\u003e\n\u003cp\u003eWu Junyi wordlessly waved to the others, and the small group dispersed.\u003c/p\u003e\n\u003cp\u003eThere was a thirty-minute interval between the student and teacher battles. It was sufficient time to reset and prepare.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue leaned against a wall, tapping a number in to his communicator.\u003c/p\u003e\n\u003cp\u003e“Jewelry Master? What are you calling me for?” The voice that answered sounded less than pleased to hear from him.\u003c/p\u003e\n\u003cp\u003e“I need a favor.” Lan Jue said, smiling at the reaction.\u003c/p\u003e\n\u003cp\u003e“No! I haven’t forgotten how you guys treated me the last time.” The man sounded decidedly displeased.\u003c/p\u003e\n\u003cp\u003e“Remember that women don’t like petty men,” Lan Jue cooed. “You aren’t a petty man, are you Accountant?”\u003c/p\u003e\n\u003cp\u003eIndeed, it was the Accountant, and he remembered just as well as the poor man the way they left him stranded. Ostensibly the excuse was that there wasn’t any room in the car for him, the Amazons and Zeus all together. So they’d just left him there to find his own way back.\u003c/p\u003e\n\u003cp\u003eThe Accountant’s angry voice shot back at him. “Don’t give me that crap. Introduce me to one of those ladies that follow you around, then, and maybe I’ll help.”\u003c/p\u003e\n\u003cp\u003eLan Jue’s voice adopted a scornful tone. “You’re asking me to help you chase skirts. Just the fact you’re saying it makes your grandpa lose face. Are you going to help me or not? I can always ask someone else. Your grandfather definitely must know someone with the expertise I need. Someone who wouldn’t refuse a comrade in arms.”\u003c/p\u003e\n\u003cp\u003e“You will \u003cem\u003enot\u003c/em\u003e mention any of this to my grandfather!” The Accountant suddenly sounded flustered.\u003c/p\u003e\n\u003cp\u003e“Then stop talking nonsense. So what’s the answer.”\u003c/p\u003e\n\u003cp\u003e“You’re like a damn slave master,” the Accountant lamented.\u003c/p\u003e\n\u003cp\u003e“I’m recording this.”\u003c/p\u003e\n\u003cp\u003e“What the hell do you want!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHalf an hour passed in the blink of an eye.\u003c/p\u003e\n\u003cp\u003eSu He and Tan Lingyun strode to their respective simulators and began running diagnostics.\u003c/p\u003e\n\u003cp\u003e“The simulated combat competition between the National Eastern University and Lir University will begin shortly. The combatants shall be; from the NEU, Professor Tan Lingyun; from Lir University, Professor Su He. Would both challengers please prepare. The combat map shall be chosen at random.”\u003c/p\u003e\n\u003cp\u003eTan Lingyun’s hands darted over the simulated controls, tapping away to their own rhythm. The screen flashed with each command. She was ready, at her best, and anxious to get under way.\u003c/p\u003e\n\u003cp\u003e“The map for this battle shall be: Sky.”\u003c/p\u003e\n\u003cp\u003eAn air battle!\u003c/p\u003e\n\u003cp\u003eIn truth the Sky arena wasn’t entirely in the air. There was cloud cover, for instance, and more. They changed the necessary tactics and flow of a fight. In the end the differences between an air and ground fight were as different as night and day. It opened up entirely new avenues of strategy, however there was a higher reliance on pilot control.\u003c/p\u003e\n\u003cp\u003eIn the next instant, two mechas appeared in the map.\u003c/p\u003e\n\u003cp\u003eTan Lingyun’s suit was a pale green, which rose eighteen meters tall. Just by the look of it, it was clear dexterity was its focus. This was affirmed with the two small metallic wings bolted to its back frame. The whole thing was surrounded by a faint green light – undoubtedly a characteristic of a powerful gem at its core.\u003c/p\u003e\n\u003cp\u003eSu He’s suit was yellow. It was taller than his opponent’s, with a streamlined construction that made it look more aerodynamic. A massive laser canon was strapped to its back. Like Hua Qianhu before him, this one looked like a sniper mecha.\u003c/p\u003e\n\u003cp\u003e“Three. Two. One. Begin!”\u003c/p\u003e\n\u003cp\u003eThe digitized voice rang out, and with that the deciding fight in the instructor combat exchange commenced.\u003c/p\u003e\n\u003cp\u003eAleady the NEU had cinched the student battles. Winning here, and in the real fights, would mean an unequivocal victory for the research school. But they were only halfway there.\u003c/p\u003e\n\u003cp\u003eThe entire audience sat on the edge of their seat. Every eye was locked on the giant projector screens.\u003c/p\u003e\n\u003cp\u003eAs soon as she heard the word begin, Tan Lingyun’s mecha was on the move. The pale green suit emitted a cocoon of disruptive energy as she raced towards her opponent. However, a close look would reveal that her seemingly straightforward rush was actually punctuated with precise jukes and dodges.\u003c/p\u003e\n\u003cp\u003eIt was a step above disordered movement, a style they called Anticipative Advance. The tiny movements deterred ranged combat, while still optimizing forward momentum. A high-level tactic used primarily for snipers.\u003c/p\u003e\n\u003cp\u003eThis fight was going to be an intense one.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-189\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-191\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-190","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
