{"id":56415,"no":193,"title":"Chapter 193: THIS is God-Ranked!","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 193: THIS is God-Ranked!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe difference in equipment quality for the two mechas wasn’t much. As such, the green mecha wasn’t significantly faster than the yellow.\u003c/p\u003e\n\u003cp\u003eBefore long Su He’s mecha dipped in to the cloud cover. The stately green predator followed half a second behind.\u003c/p\u003e\n\u003cp\u003eHere the benefits of a sim match were made apparent, for as they drilled through the clouds and mist the spectator’s screens filtered them out and revealed a crystal clear picture. Now, they could see every minute detail of the fight despite the environment.\u003c/p\u003e\n\u003cp\u003eSu He did not pause as he penetrated the clouds. He became distorted and difficult to pinpoint, with a fuzzy grey light hovering around him. He looked very much like the clouds he hid in. More importantly, however, this aura he exuded hid the fluctuations of his mech and discipline power.\u003c/p\u003e\n\u003cp\u003eSlowly, he lifted the laser cannon to his shoulder. He continued to move backward through the mist while carefully aiming for the encroaching green hunter.\u003c/p\u003e\n\u003cp\u003eThe suit stopped. Tan Lingyun felt the vibrating of the sim pod come to a halt, and although she couldn\u0027t see Su He she was immediately filled with dread. What was this person doing? Why where they stopped when a sniper likely had their sights trained on her, especially a sniper as strong as this?\u003c/p\u003e\n\u003cp\u003eIt was an opportunity Su He couldn’t afford to miss. With a sizzling bang, the laser cannon released its first shot. The clouds turned an angry red as the sizzling laser raced towards its target.\u003c/p\u003e\n\u003cp\u003eBut what happened next was a strange turn, for just as the laser was set to obliterate Tan Lingyun, a powerful green aura gushed forth. The nimble mech side-stepped ever so slightly, as the verdant light congealed in to a thick layer before its chest.\u003c/p\u003e\n\u003cp\u003eThe laser burst in to a fiery explosion, but the brunt of its force was avoided with the juke. The rest was deflected by the intense shield.\u003c/p\u003e\n\u003cp\u003eThe impact force caused the suit to spin around.\u003c/p\u003e\n\u003cp\u003eSu He saw how his attack was mitigated until it was useless. In surprise and frustration, he began the procedures to ghost his suit once more.\u003c/p\u003e\n\u003cp\u003eHe knew God-ranked pilots didn’t do anything unless it specifically granted them a combat advantage. There was definitely a reason the green mecha had stopped to suffer the strike.\u003c/p\u003e\n\u003cp\u003eAs expected, the moment his shadow appeared he saw a green flash streak by. He broke out in a cold sweat.\u003c/p\u003e\n\u003cp\u003eThe light had been one of the suit’s spikes, fired from its hand at incredible speed.\u003c/p\u003e\n\u003cp\u003eSu He stopped on a dime, refusing to let inertia pull him to the side. It was a poignant display of his mastery. The sudden change in trajectory saved him, for as anticipated a second flash of green raced past. Had he kept going, that spike would have impaled the cockpit.\u003c/p\u003e\n\u003cp\u003eSweat had already soaked through Su He’s flight suit. The intensity was oppressive, and an underlying fear crept through his brain as he continued to narrowly avoid destruction.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIn the sim pod.\u003c/p\u003e\n\u003cp\u003eTan Lingyun watched the exchange on her screens, absorbed in every tiny detail. Though she wasn’t the one piloting the suit, she was nevertheless full of a deep satisfaction.\u003c/p\u003e\n\u003cp\u003eHer observations were interrupted when that deep voice from before filled her cockpit. “The reason for leaving myself open for the blast, was to resolve this fight as quickly as possible. He’s got a very powerful shield defense system installed in his suit, capable of blocking our radar. Add in the cloud cover, and he’s practically invisible. Nearly all high-level snipers are outfitted like this. So, the best way to determine a sniper’s location is to have him take a shot. The precondition, of course, being that you’re confident you can avoid or block the shot.”\u003c/p\u003e\n\u003cp\u003eAs the voice was instructing, she did indeed see Su He’s mecha partially concealed in the clouds.\u003c/p\u003e\n\u003cp\u003eSu He had indeed avoided the two attack, but in the course of evasion was forced to stop his retreat. In the same instant Su He’s location was revealed, the green mecha launched forward at top speed. Spin, launch, sprint – three actions that blended seamlessly in to one. No movement was wasted.\u003c/p\u003e\n\u003cp\u003eBy the time Su He reacted, trying desperately to turn and flee, the green mecha was already hovering directly in front of him.\u003c/p\u003e\n\u003cp\u003eHowever, Su He’s training was immaculate, and his estimation of the situation appropriate. He knew that running at the needed speed would take time, time he didn’t have. If he tried, his enemy would catch up quickly, with his back exposed. What’s more, though his cannon was a far sight better than his student’s, it still needed time to cool before another shot could be fired. There wasn’t time for him to fire one off before Tan Lingyun could land a fatal strike.\u003c/p\u003e\n\u003cp\u003eSo he didn’t run. Instead his hands relaxed around the grip of the laser cannon, allowing the powerful weapon to fall away. His arms rose and warded him, the blades wrapped around them dull against the gray clouds. Close combat was his only option, now.\u003c/p\u003e\n\u003cp\u003eThe green mecha was unarmed, having fired its spikes earlier.\u003c/p\u003e\n\u003cp\u003eFinally, the two mecha met once again. The audience watched with baited breath, throats tight with anxiety.\u003c/p\u003e\n\u003cp\u003eThe green mecha stuttered. Ghosting?\u003c/p\u003e\n\u003cp\u003eNo, or... yes?\u003c/p\u003e\n\u003cp\u003eIt appeared as though there was some problem, that the maneuver failed. Though there was the hint of a phantom, it wasn’t as expertly executed as before. The image was only partially separate from the real thing, not unlike Su He’s own attempts earlier.\u003c/p\u003e\n\u003cp\u003eBut Su He saw something else entirely.\u003c/p\u003e\n\u003cp\u003eIndeed, the ghosting image didn’t entirely separate, however it wasn’t two mechas he saw. It was \u003cem\u003ethree\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThree?\u003c/em\u003e \u003cem\u003eDamn!\u003c/em\u003e \u003cem\u003eWhat is his hand speed?!\u003c/em\u003e Su He was thunderstruck, and excitement shone in his eyes. He held no fear for such opponents, only anticipation. His fingers danced over the controls fervently.\u003c/p\u003e\n\u003cp\u003eThe yellow mecha’s torso began to rotate at intense speed. The weapons stretching from its elbow sockets became a blur. He became a wall of whirling steel.\u003c/p\u003e\n\u003cp\u003eSu He was not one for defense. Otherwise he wouldn’t have chosen a sniper mech for the battle. Right now, though, he had no choice. He faced three enemies now essentially, and he had no idea where the next attack could come from. Nor did he know what manner of attack it would be, considering his opponent’s abilities. All he had to rely on was his ultimate defense.\u003c/p\u003e\n\u003cp\u003eSuddenly, a giant mechanical fist appeared in front of his face. She seemed to pay the spinning blades no mind.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eIs she crazy?\u003c/em\u003e This was Su He’s first thought. After all, those weapons he wielded weren’t ordinary alloy blades. They were high-frequency concussive steel, the best you could buy. It was for this reason that Tan Lingyun’s shields had failed to deflect the attack, and the strike had still managed to damage her suit.\u003c/p\u003e\n\u003cp\u003eAnd it didn’t even have any weapons, resorting to fists. She was asking for death.\u003c/p\u003e\n\u003cp\u003eSu He didn’t know what his enemy was planning, but he did know that hesitation when fighting someone of this caliber was a death sentence. So he punched buttons on his keyboard, and the whirling weapons exploded outward like a deadly metal dervish. They swiped mindlessly, viciously at his attacker. The terrible humming blades captured his adversaries fist between them.\u003c/p\u003e\n\u003cp\u003eDid she have time to retreat? No. Nor was there any trickery. The green mecha planned to eat the attack straight on.\u003c/p\u003e\n\u003cp\u003eTan Lingyun cried out in alarm, watching from within the dark sim pod. She couldn’t understand why this person who called themselves ‘Lei Feng’ was acting so recklessly.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eCrunch!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe sounds of impact reverberated through the air. The yellow mecha went flying, arms flailing and chest plate dented.\u003c/p\u003e\n\u003cp\u003eThe green mecha’s thrusters fired at full strength, at the suit dissolved in to a piercing ray of light that shot forward.\u003c/p\u003e\n\u003cp\u003eHe caught up, and the two suits stopped in that heavy cloud cover.\u003c/p\u003e\n\u003cp\u003eA moment later…\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBoom!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe yellow mecha exploded in a fiery inferno.\u003c/p\u003e\n\u003cp\u003e“Su He’s mecha has sustained one hundred percent damage. Victory: Tan Lingyun.”\u003c/p\u003e\n\u003cp\u003eNot a sound arose from the audience. They sat in silence, disbelieving, unsure of what happened.\u003c/p\u003e\n\u003cp\u003e“How… how did you do that?” Tan Lingyun asked quietly to the darkness of the simulator. She didn’t care who this Lei Feng actually was, she just had to know how he’d taken victory. It had all happened too fast for her to see.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe VIP platform. Han Ruchao and Xu Renjian were comical mirrors of each other, staring wide eyed and slack-jawed at the screen.\u003c/p\u003e\n\u003cp\u003eSu He’s defeat had turned his earlier threats in to a joke. He’d lost, and lost terribly. Their one-on-one bout, engaged at his request, ended up being a gift to the enemy.\u003c/p\u003e\n\u003cp\u003e“Renjian… did you see how your instructor won the fight?” Han Ruchao couldn’t help but ask his NEU counterpart, asking the question almost unconsciously.\u003c/p\u003e\n\u003cp\u003eXu Renjian shook his head. “I didn’t see it clearly. The two suits were of about equal power. It looks like she won with her bare fists, though Su He’s defense should have deflected them. Somehow the strike must have landed, and then… empty space.”\u003c/p\u003e\n\u003cp\u003eHan Ruchao sucked in an angry breath. “You’re certainly a sneaky one, Renjian. Keeping your cards very close to the chest. If this were some accident I could accept the loss, but… You must introduce this miracle pilot of yours to me later. I had no idea your university had managed to lure a God-ranked pilot on staff.”\u003c/p\u003e\n\u003cp\u003eXu Renjian shot his rival a bitter smile. “I am pleased at our victory, Ruchao, but I am just as confused as you are. As far as I knew Tan Lingyun was a Sovereign-ranked pilot [1. Admitting to cheating, are we?]. I have no idea when or how she’s managed to make such a leap in power. It was quite the surprise, I assure you! Surprised doesn’t even describe it.”\u003c/p\u003e\n\u003cp\u003eXu Renjian shook his head, his fate face jiggling. He had to let go of his disbelief, for he’d seen it true. He went on, his face a mask of seriousness. “I suppose we should settle the terms of our wager, then.”\u003c/p\u003e\n\u003cp\u003eHan Ruchao’s face twitched as though in pain. “As straightforward as always.”\u003c/p\u003e\n\u003cp\u003eXu Renjian huffed disdainfully. “And if you’d have won? We’re all adults here, admit when you’ve lost and pay up.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-192\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-194\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-193","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
