{"id":56427,"no":205,"title":"Chapter 204: I Am Hera!","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 204: I Am Hera!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue leaned back, making himself comfortable on the lounge chair. He took sips from his glass of whisky while watching the skies darken through the hotel window. His eyes narrowed, and a gentle sigh passed his lips. “You know, I’ve experienced quite a lot in the last few years. I’ve lived a life of decadence ever since joining Skyfire Avenue. Every day it’s been fine alcohol and delicious food, no need to ponder on life or times. I didn’t care about anything. And yet, not long ago, I discovered that my abilities and cultivation weren’t as rusty as one might expect. On the contrary, I was stronger. My will had matured.”\u003c/p\u003e\n\u003cp\u003e“Mentor. There are many, many wonderful things in this universe. Not just in our little corner, but everywhere. Get out, see new things. I can guarantee it’ll be beneficial for you. The path to perfection is built on understanding. A phrase that I give to you, which helped me find my way. You’re still young. Even way back then, I felt that God-ranked was not your ultimate end.”\u003c/p\u003e\n\u003cp\u003eSu He stared at Lan Jue in surprise. “But my Talent…”\u003c/p\u003e\n\u003cp\u003eLan Jue shook his head. “See? Just like I said. It’s still the thing you’re the most concerned over. Even after I’ve pointed out your hurdles, you have yet to find a way out from underneath them. Remember this, mentor; Anyone over seventh rank has an opportunity to reach Paragon status. It isn’t just mindless effort, either. Luck plays a role, but when you reach that epiphany it’s like crossing in to another world. I heard this from my grandpa, and I’m convinced every paragon in the modern age would agree with his sentiment.”\u003c/p\u003e\n\u003cp\u003e“Epiphany?” It was as though something just clicked in to place with Su He [1. Ehm, the definition of an epiphany? Judges... yes, yes he\u0027s just had an epiphany.]. He drank off the rest of his whisky in one gulp. He poured himself another glass, and took another drink.\u003c/p\u003e\n\u003cp\u003eRed had begun to creep up in to his cheeks, and his eyes adopted a far away look.\u003c/p\u003e\n\u003cp\u003eAfter about ten minutes, the internal fervor he was struggling with subsided. His eyes brightened as he returned his focus to Lan Jue.\u003c/p\u003e\n\u003cp\u003e“If one day I manage to reach those heights, remind me to treat you to the universes finest single-malt. I think I will take a vacation. I’m gunna do it!”\u003c/p\u003e\n\u003cp\u003eHe shot to his feet, alive with inspiration, and made for the door. He yanked it open, and was gone down the wall with lengthy strides.\u003c/p\u003e\n\u003cp\u003eLan Jue remained seated, sipping his drink. The smile on his face refused to abate. “I wonder what heights he meant,” Lan Jue muttered to himself, “God-ranked or Paragon? This guy, still so sly. If he wants that bottle, he’ll have to work hard for it.”\u003c/p\u003e\n\u003cp\u003eLan Jue poured himself another glass and meandered in to the balcony. The cool night air caressed his face. It was moist and cool, refreshing, filling him with a sense of cleansing renewal.\u003c/p\u003e\n\u003cp\u003eLan Jue stared in to the distance. But he wasn’t looking at any one thing in particular, instead letting the world pass by with a thousand-yard stare. His mind was blank, empty. Always look forward, he then thought – easier said than done.\u003c/p\u003e\n\u003cp\u003eSimply give something up, and you may never truly be rid of it. The only way to progress, was through acceptance.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eYeah… I’ll give it a shot!\u003c/em\u003e \u003cem\u003eHera. If you can hear what’s in my heart, then teach me. Lead me to what I should do\u003c/em\u003e.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003ePlanet Skyfire, Mount Tian.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHe’s probably already on Lir\u003c/em\u003e. Zhou Qianlin peeked at the time displayed on the face of her communicator. She lay stomach-down on the bed, letting her long hair frame her pretty face.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHe didn’t pick me up for school today. It was strange, I must be getting used to seeing him every day. I heard Richard suddenly gave up and left for the West, too, though I don’t know why. Now, without his interference, life is going back to normal.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhen he comes back, picks me up and sends me home, then things are on track. Then things are perfect.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBut will it be like I want? Will it happen?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e“Beep beep!”\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e“What’s up?” A deep voice crackled through the unit on her wrist.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin was shocked to discover that, at some point during her musings she’d actually dialed his number in to her communicator.\u003c/p\u003e\n\u003cp\u003e“Sorry. I, ehm, dialed the wrong number.”\u003c/p\u003e\n\u003cp\u003eThere was silence on the other end.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin didn’t speak either. She could hear the sound of wind.\u003c/p\u003e\n\u003cp\u003eFor a time, they remained like that, maintaining the silence.\u003c/p\u003e\n\u003cp\u003eAfter a long moment Lan Jue’s voice arose. It sounded drawn. “Tell me… you must be Hera.”\u003c/p\u003e\n\u003cp\u003eZhou Qianlin was dazed by the accusation. A tear crept down her cheek from shimmering blue eyes. She took a long, deep breath. Her voice trembling, she replied:\u003c/p\u003e\n\u003cp\u003e“I am Hera!”\u003c/p\u003e\n\u003cp\u003e“I miss you.” Lan Jue’s voice was thick with sadness.\u003c/p\u003e\n\u003cp\u003e“I miss you too.” Zhou Qianlin quickly dropped the connection. She pulled the covers over her head, and broke in to tears.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt was early morning, and the wind was gently rattling the window. The sound roused Lan Jue.\u003c/p\u003e\n\u003cp\u003eThe outside was already bright. Rubbing his aching head, Lan Jue pulled himself out from under the sheets.\u003c/p\u003e\n\u003cp\u003eThe balcony door was still open, allowing the wind to race through the room’s interior. He spied the empty whisky bottle on the end table.\u003c/p\u003e\n\u003cp\u003eHe shook his head, trying to clear the haze from his brain. The Jewelry Master was finding it difficult to remember the events of last night. He faintly recalled something, maybe a dream. She said she missed him.\u003c/p\u003e\n\u003cp\u003eThe corners of his mouth sketched the contours of a smile. He rose to his feet and, through a cleansing flush of his internal energies, expelled the hangover effects. [2. Holy crap don’t we all wish we had that ability.]\u003c/p\u003e\n\u003cp\u003e“I run in to you every time I’m drunk. That’s why I love drinking. It helps me find you, Hera. You’re still alive somewhere, aren’t you… at least in my heart.”\u003c/p\u003e\n\u003cp\u003eHe walked in to the bathroom and turned on the shower. He stood underneath the nozzle as jets of cold water washed over him. It was numbing, but helped to wake him from his deep slumber.\u003c/p\u003e\n\u003cp\u003eBy the time he exited the bathroom ten minutes later, covered in twinkling droplets of water, he felt ready to handle whatever the day had to throw at him.\u003c/p\u003e\n\u003cp\u003e“Hera, I promise you, I’ll snap out of it. I definitely will. Drinking brings me to you, which is great, but… I promise, I’ll scale it back. I’ll be strong, so that only you know how frail I really am.”\u003c/p\u003e\n\u003cp\u003eHe got ready, choosing for today a pale blue suit. When in Lir, do as the Lirians do, he thought.\u003c/p\u003e\n\u003cp\u003eLan Jue went downstairs to ferret out some breakfast, when he ran in to Lin Guoguo and Xiuxiu.\u003c/p\u003e\n\u003cp\u003e“Ah boss, you’re up! Still haven’t had breakfast eh?” Lin Guoguo beamed prettily at him.\u003c/p\u003e\n\u003cp\u003eLan Jue nodded and shot her a smile of his own. “You guys eat already?”\u003c/p\u003e\n\u003cp\u003eLin Guoguo tittered. “Yup! But if you like we can stick around and keep you company.”\u003c/p\u003e\n\u003cp\u003eLan Jue smirked. “Wouldn’t it make more sense for me not to eat, then?”\u003c/p\u003e\n\u003cp\u003eXiuxiu looked at him in curiosity. “Why do you say that?”\u003c/p\u003e\n\u003cp\u003e“I’ve already got a feast for the eyes right in front of me,” he said with a wink.\u003c/p\u003e\n\u003cp\u003eXiuxiu’s immediately flushed a shade of red Lan Jue had never seen before, while her eyes betrayed her appreciation for the compliment. Guoguo, meanwhile, was frowning admonishingly. “Not the slightest hint of sincerity, boss.”\u003c/p\u003e\n\u003cp\u003eThe smile fled from Lan Jue’s face. “What! Of course I’m being sincere.”\u003c/p\u003e\n\u003cp\u003eLin Guoguo moved closer to him like a tigress, a lopsided grin on her face. She placed her hands on his shoulder, rose until she stood on the tips of her toes, and whispered in to his ear. “If you \u003cem\u003eare\u003c/em\u003e, we’ll be waiting for your knock on our door tonight.” [3. What’s the emoji for ‘I think I just crapped my pants’?]\u003c/p\u003e\n\u003cp\u003eLan Jue’s face was a mixture of shock and something else. He gave a nervous chuckle. “I-I’m a wholesome gentleman. Stop it!”\u003c/p\u003e\n\u003cp\u003eLin Guoguo stuck her tongue out at him. “The worst kind of wholesome gentleman. Let’s go Xiuxiu, and let the good boy enjoy his breakfast in peace.”\u003c/p\u003e\n\u003cp\u003eLan Jue watched the two of them go, speechless.\u0026nbsp; He shook his head, and couldn’t help but laugh at her antics. These girls, he thought. Ridiculous.\u003c/p\u003e\n\u003cp\u003eHe thought about the Accountant, and hoped things weren’t going too poorly for him. He knew it wouldn’t be a pleasant circumstance, however the younger man had made no attempts to reach Lan Jue on his communicator. It could be a lot worse than he thought!\u003c/p\u003e\n\u003cp\u003eLan Jue ate his breakfast, then sat for a while with a glass of tea. After sitting in quiet contemplation for a little while, he tapped the Keeper’s number out on his wrist.\u003c/p\u003e\n\u003cp\u003e“Hello!” the Keeper’s hoary voice grunted in acknowledgement.\u003c/p\u003e\n\u003cp\u003e“It’s me,” Lan Jue said.\u003c/p\u003e\n\u003cp\u003e“Ngh. Have you met with the old coot yet?”\u003c/p\u003e\n\u003cp\u003e“Yup. He’s a little harder to deal with than you let on.”\u003c/p\u003e\n\u003cp\u003eHe went on to relay everything that had happened with the Bookworm the night before.\u003c/p\u003e\n\u003cp\u003e“Very good. So be it. And don’t worry, he won’t do anything untoward to the Accountant. Leaving him there is a good thing. He’s always saying I’m too strict, so let him see what real strict is. He’ll come back praising my name.” Notes of smug pleasure resonated in the old Paragon’s voice.\u003c/p\u003e\n\u003cp\u003eLan Jue blinked at the voice coming from his wrist. “Are you really the Accountant’s grandfather?”\u003c/p\u003e\n\u003cp\u003e“Stupid question! Alright, then if there’s nothing else. Now that he’s seen what you gave him, the next step will be much easier. I leave it up to you.” The Keeper didn’t give Lan Jue a chance to respond before severing the connection.\u003c/p\u003e\n\u003cp\u003eLan Jue just stared at his wrist. This old man was crazypants, asking others to do his bidding while he sits in his library!\u003c/p\u003e\n\u003cp\u003eJust then two people stepped in through the hotel doors and attracted the Avenue denizen’s attention. They were a man and a woman, the man being Su He. Beside him stood an attractive, small woman. She looked to be of similar age to Lan Jue’s former mentor, and quite pretty. A small smile was spread across her face.\u003c/p\u003e\n\u003cp\u003eSu He himself looked like an entirely different person. He stood tall, veritably beaming with happiness and excitement. Compared to the despondent man he’d drank with last night, this was a miraculous change.\u003c/p\u003e\n\u003cp\u003e“Ah, Lan Jue. Here you are! I was just knocking on your door looking for you. Have you eaten? Su He pulled the young woman beside him as he took a seat across from his guest.\u003c/p\u003e\n\u003cp\u003eLan Jue smiled pleasantly. “I have. Mentor, care to introduce us?”\u003c/p\u003e\n\u003cp\u003eSu He slapped his forehead. “Ach, my manners. Here, allow me. This is Ya Xiu [4. ‘Elegant Beauty’ is the direct translation of her name]. \u0026nbsp;My girlfriend. Ya Xiu, this is Lan Jue. The one I spoke with you about last night.”\u003c/p\u003e\n\u003cp\u003eYa Xiu’s face reddened, but still politely extended her hand towards Lan Jue. “Hello, Lan Jue. I’m very happy to meet you. I’m even happier you helped Su He come to his senses.”\u003c/p\u003e\n\u003cp\u003eLan Jue laughed. “All I did was talk, the work was all Su He’s. I can’t take the credit for any of that.”\u003c/p\u003e\n\u003cp\u003eAn extra from the author: ‘When I got to the part of the story where I write ‘I am Hera’, there were tears in my eyes. I’m often asked if indeed Zhou Qianlin is Hera, and in fact my own heart is in knots about it. Ultimately, will she be? Right now, I have no answers. I can only write my story, and see what happens in the end. We will follow the plot, and maybe someday in the near future a revelation will be forthcoming.\u003c/p\u003e\n\u003cp\u003eFor Hera, I beg for your support, and beg it keeps coming.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-203\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-205\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-204","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
