{"id":56446,"no":224,"title":"Chapter 223: The Power of Coeus","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 223: The Power of Coeus\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe moment Lan Jue realized the image in front of him was fake, his eyes immediately shot to Hua Li. Zeus looked just in time to see that, like his own, the image Hua Li had targeted was simply an illusion.\u003c/p\u003e\n\u003cp\u003eBoth he and Poseidon had forgotten the same fact; Lan Qing’s specialty was not hand speed! Though a renowned Monarch, his hand speed wasn’t anything so completely outside the norm for God-ranked pilots. It was silly for them to have believed he improved so much in a few short years, to the point where he was able to simultaneously create three doppelgangers.\u003c/p\u003e\n\u003cp\u003eHowever, this realization came too late.\u003c/p\u003e\n\u003cp\u003eThe third and final figure racing towards Cerberus looked identical to the three that came before it. It rushed its target like a cyan specter. However, unlike the other two, when Hades brought his weapon up to strike, the shadow evaded.\u003c/p\u003e\n\u003cp\u003eThe attacker flashed and shuddered through reality like a force of evil. Where there had been one, there were now nine separate images racing towards the dark red mecha.\u003c/p\u003e\n\u003cp\u003eThey burst outward like an explosion, with the first three dissolving as they met Cerberus, but strangely did not do any collision damage. However, the whole of the frightening mecha reacted by releasing a powerful aura of dark red light.\u003c/p\u003e\n\u003cp\u003eThe remainder of the illusions flashed all around him. They raced in circles until Hades was lost in an orb of cyan light. What followed was a series of vicious strikes from every which direction, scarring the iron-clad sides of the red suit.\u003c/p\u003e\n\u003cp\u003eLan Jue reacted first, immediately moving towards his beleaguered friend the moment he saw him in trouble.\u003c/p\u003e\n\u003cp\u003eBut before he could approach to save his friend, one of the figures extricated itself from the group. It raced his way, faster than a shooting star.\u003c/p\u003e\n\u003cp\u003eThe first thing he noticed was how perfect it’s trajectory and advance really was. He didn’t even have time to prepare for evasion before the figure approached. He’d only just turned completely to face the pinned Hades and, instead of racing towards his friend to offer support, he had to focus all of his efforts on defense.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBang\u003c/em\u003e! Thor lashed out with its spear of lightning, catching the oncoming form dead center. But instead of being blasted back, as one might expect, the frighteningly fast silhouette dodged to the side and dashed off in another direction. Directly towards Poseidon. Had the sky-blue mecha not stopped its forward advanced the moment it saw the figure coming, they’d have run directly in to one another.\u003c/p\u003e\n\u003cp\u003eThere was a palpable fear of Coeus, living in the heart of each of them. Poseidon, the current target, knew he couldn’t sustain a direct attack from their leader. So he turned sideways to make himself a smaller target, and stretched his trident outward.\u003c/p\u003e\n\u003cp\u003eThe cyan light surrounding Cerberus had become a raging tempest of violent power. The red light captured within it was becoming dimmer by the second, while shards of shrapnel launched out in all directions.\u003c/p\u003e\n\u003cp\u003eThor and Triton made no move to save their companion. They understood very well the capabilities of Coeus. Going after Cerberus would accomplish nothing, and in fact may lead to them becoming ensnared themselves.\u003c/p\u003e\n\u003cp\u003eThe two blue mecha stood back to back, and allowed their powers to amalgamate.\u003c/p\u003e\n\u003cp\u003e“Those aren’t doppelgangers. The big guy’s illusions, most likely.” Hua Li’s voice called to Lan Jue through the mecha’s communication system.\u003c/p\u003e\n\u003cp\u003eLan Jue responded with a deep, pensive voice. “Yeah, but we found that out too late. From the outset we’ve been dancing to his rhythm. I hadn’t expected him to immediate employ the phantoms. And this power isn’t assisted by any discipline. He painstakingly employed the maneuver to make us think they were doppelgangers, and in the confusion went in for the strike. Chu Cheng got caught in the trap.”\u003c/p\u003e\n\u003cp\u003eThe swirling tornado of cyan light lifted away and landed a distance from the others. It looked like a half moon, perhaps five meters long in total. It was a blade of light, curved and frightening to behold, with a handle set in the middle. One of Coeus’ moonblades.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBoom---!\u003c/em\u003e A blast tore through the arena, interrupting Hua Li and Lan Jue’s discussion. There was an enormous red erruption, followed by the expulsion of a single beam of cyan light. The weapon that had been cast so far away had inexplicably vanished.\u003c/p\u003e\n\u003cp\u003eTriton hefted its massive trident, and a shimmering blue aura burst in to bloom, rapdly expanding in to the distance. This was one of the suit’s special characteristics to assist in battlefield control; a probe. It was a blast of energy not unlike an ocean ripple. It passed harmlessly through the phantoms, in search of their true enemy.\u003c/p\u003e\n\u003cp\u003eThor raised its spear. It stood still and attentive, careful not to react without thought, though the blue light pulsing from it was growing stronger.\u003c/p\u003e\n\u003cp\u003e“You disappoint me,” Lan Qing’s harsh and critical voice called out.\u003c/p\u003e\n\u003cp\u003eThe strange cyan light coalesced to form Coeus, standing a short distance before them.\u003c/p\u003e\n\u003cp\u003eLan Qing’s mecha had sustained severe burns on its left shouldered, blackening the alloy. However, it was clear the damage wasn’t having much of an effect. It was the last-ditch strike of their defeated comrade that had scarred him.\u003c/p\u003e\n\u003cp\u003eLan Jue and Hua Li were silent. In terms of pure speed, Coeus had both of their suits soundly beat.\u003c/p\u003e\n\u003cp\u003eWere Thor capable of sustaining Lan Jue’s Discipline here, the jewelry master would be able to catch up to his brother with the addition of his lightning. But he didn’t have the dexterity.\u003c/p\u003e\n\u003cp\u003eThe intimidating mecha shimmered, and split in two. Both mirror images raced towards Lan Jue and Hua Li respectively.\u003c/p\u003e\n\u003cp\u003eThere it was! Triton’s probe confirmed it; these weren’t illusions, they were true doppelgangers.\u003c/p\u003e\n\u003cp\u003eTriton rapidly moved behind Thor, who slowly separated in to two doppelgangers of its own.\u003c/p\u003e\n\u003cp\u003eLan Qing was somewhat lacking in hand speed, when compared to his brother. The doppelganger maneuver required a punishing level of dexterity, but this was something Lan Jue didn’t shy from.\u003c/p\u003e\n\u003cp\u003eThe mirror images racing their way bore crescent-shaped moonblades in each hand. Where he standing still, one might notice that the two weapons could join to create a single loop.\u003c/p\u003e\n\u003cp\u003eThor lashed out with his spear like a snake, it’s sizzling tip roaring through the air towards Coeus’ cockpit.\u003c/p\u003e\n\u003cp\u003eOne of the moonblades rose in an attempt to deflect Thor’s deadly spear. However, just as the blades were about to touch the spear burst in to a countless number of smaller piercing lightning bolts that shot off in all directions.\u003c/p\u003e\n\u003cp\u003eThe two doppelgangers reacted by bringing their moonblades together, and as they did there appeared a curtain of protective light around the offending mecha. It was sufficient to deflect every one of the lightning strikes.\u003c/p\u003e\n\u003cp\u003e“Eh?” Lan Qing’s surprised voice crackled through Lan Jue’s cockpit. Clearly Thor’s lightning attack had caught him off guard.\u003c/p\u003e\n\u003cp\u003eTriton had not been cowering during the exchange. By then its trident was gone, and it was standing with its arms outstretched as though it was holding something in its embrace. Waves of intense energy were caught between his arms, growing more and more powerful as the waves washed over one another. A small opening had appeared from the mecha’s chest plate, and it was from there that the energy was being released. The orb of light was growing more powerful by the moment, as energy was being fed in to it.\u003c/p\u003e\n\u003cp\u003eParting of the Waters! One of the most devastating of Triton’s abilities. So great was its destructive capabilities that even the best outfitted mecha suit couldn’t stand a direct blast. The drawback was that it required time to build up, giving the enemy time to avoid it.\u003c/p\u003e\n\u003cp\u003eThor had corrected this by masterfully holding off Coeus, and blocking Triton from view as it prepared. It was enough time for Hua Li to get ready in stotal secrecy. Now all that was needed, was for Thor to coax Coeus in to the kill zone.\u003c/p\u003e\n\u003cp\u003eLan Jue had pulled all the stops. He was surprised at his hand speed, faster than he’d ever been. It had allowed his spear’s lightning attack to explode with power similar to his forest of lightning. It was a torrential attack, that succeeded in forcing Coeus to retreat.\u003c/p\u003e\n\u003cp\u003eLan Qing’s mecha couldn’t overcome Thor in pure explosive power. Still he felt somewhat helpless because, though his hand speed was clearly superior, his enemy’s massive weapons would always be able to easily deflect his blows.\u003c/p\u003e\n\u003cp\u003eWhere this fight one on one, it would be Lan Jue who would be fighting uphill. Luckily, though, he wasn’t alone.\u003c/p\u003e\n\u003cp\u003e“We’ve got it, A-Jue!” Hua Li called out.\u003c/p\u003e\n\u003cp\u003eIn an instant, Thor was on the move. The massive suit dissolved in to a blinding blue light that shot headlong towards Coeus. The furious charge left Lan Qing no option but to withdraw further. He knew Thor’s destructive capabilities would materialize faster than his own could.\u003c/p\u003e\n\u003cp\u003eHe was flustered, reacting instead of controlling the battle’s flow. Caught off guard, all Coeus could do was spin its mighty blades haphazardly in attempts to keep Thor at bay.\u003c/p\u003e\n\u003cp\u003eBut Thor was simply too fast, too furious [1. \u003ca href\u003d\"https://www.youtube.com/watch?v\u003dTA7gnSyuIik\"\u003eTOO FAST FOR Y’ALL! \u003c/a\u003e]. Thor focused all of its energy, and as he raced forward seven interlaced beams of light tore through the skies. Each one viciously slimmed in to the Hero of the East, one after the other. It was all he could do to protect himself, like a tree trying to stave off destruction in the midst of a hurricane. Each beam of light took with it shards of twisted metal.\u003c/p\u003e\n\u003cp\u003eAt last the tempest passed. Coeus hovered in the air, clearly destabilized.\u003c/p\u003e\n\u003cp\u003eIt was Hua Li’s chance, and he didn’t miss the opportunity. His Parting the Waters strike was released, creating a tremendously massive column of blue light that exploded outward just as Thor landed its final strike. It was that last little push that shoved Coeus directly in to the oncoming coup de grâce, and spun him around away from Hua Li.. After such a blitzkrieg, his defeat seemed certain.\u003c/p\u003e\n\u003cp\u003eLan Jue’s hand speed had reached its limit. He shot a glance at the control terminal which recorded the maneuvers, and saw that his last strike had reached a maximum of ninety-two CPS. It was the his own personal best. Unfortunately, his hand speed was too much for the suit’s power gems to sustain. Were that not the case, he could have employed the Seven Stars. That, he was confident, would have ended the fight there and then.\u003c/p\u003e\n\u003cp\u003eThe thought tumbled through his head as he watched the final moments of their exchange unfold. He looked on confident in the knowledge that nothing his brother could do would save him in the face of his rapidly approaching demise. There was no dodging, no deflect his friend’s terribly blast of power. He couldn’t even see it coming.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eBoooooomm---!\u003c/i\u003e The two mecha collided with one another. Prometheus coaxed his suit to race forward and crash in to brother’s sapphire mecha.\u003c/p\u003e\n\u003cp\u003eBut just as its fate seemed sealed, Coeus tipped his hand.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-222\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-224\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-223","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
