{"id":56511,"no":289,"title":"Chapter 288: Starlord’s Finale","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 288: Starlord’s Finale\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDeimos’ frontal assault cut short, and forced to retreat. Was this the power of a Discipline-infused mecha?\u003c/p\u003e\n\u003cp\u003eAnd as the others stood in silent tribute, Starlord took its opportunity. While still charging backward, it swiped Starblade toward the stationary enemies.\u003c/p\u003e\n\u003cp\u003eMeanwhile Thor, hovering in the air, began to wobble to and fro as though it were losing its balance. Then with an audible \u003cem\u003ebloop\u003c/em\u003e, the sapphire mecha was engulfed in a bubble. The strange shield was a gift from Poseidon, who stood close by.\u003c/p\u003e\n\u003cp\u003eTriton had a mechanical hand resting upon Thor’s shoulder, trident in hand. In the next moment the god of the seas swept his trident out, and great waves went crashing toward Starlord.\u003c/p\u003e\n\u003cp\u003eThe star-spangled mecha thrust it’s sword high in to the air, and a dazzling pinprick of light exuded from its tip. Triton, meanwhile, started to wobble just as Thor had before – like Poseidon was having trouble wresting controls.\u003c/p\u003e\n\u003cp\u003eA staggering streamer of condensed starlight violently made its way toward the Divine Monarchs, forcing them to retreat.\u003c/p\u003e\n\u003cp\u003eStarlord Deimos, still a force to be reckoned with!\u003c/p\u003e\n\u003cp\u003eBoth Lan Jue and Hua Li were intensely surprised by what they’d witnessed. Their strange and sudden wobbles were not for no reason. Each time either of them had tried to advance, Deimos had placed a shot precisely in their path. They had only just begun to move when Deimos correctly assessed their intention and cut them short. Their rhythm was shattered. Thor’s indomitable advance was barred.\u003c/p\u003e\n\u003cp\u003eKnowing his enemy’s motives in advance? Deimos was that intelligent? Unless, it wasn’t that he didn’t have a Discipline – his Discipline was Foresight.\u003c/p\u003e\n\u003cp\u003eStarlord’s attacks laid siege to Thor and Triton’s shield. Its mighty sword never paused, and the torrential attacks kept coming.\u003c/p\u003e\n\u003cp\u003eHowever as the audience watched, they noticed that Starlord’s attacks weren’t actually damaging their targets. It wasn’t that the strikes weren’t fierce, or swift. They simply weren’t strong enough to penetrate the shield!\u003c/p\u003e\n\u003cp\u003eWere one to only consider mecha construction, Starlord was in a class all its own. Even compared to the tricked-out Thor and Poseidon’s deep pockets, Starlord was a terrifying force. But things change when Disciplines are added to the equation.\u003c/p\u003e\n\u003cp\u003eStarlord’s attacked hadn’t changed since the last few fights, before the new sim pods were introduced. However, Thor and Triton were infinitely more powerful now. In skill, technique and tactics Deimos was nigh impossible to overcome. But in sheer power, in Discipline, the younger pilots had the advantage.\u003c/p\u003e\n\u003cp\u003eThis was the difference between being an Adept, and not. It was for this reason it is true all god-ranked pilots are also accomplished Talents. One fed the other.\u003c/p\u003e\n\u003cp\u003eAs Thor slid backward away from Starlord’s attack, it hefted the crackling lightning spear in its hand. The skies overhead erupted in to a terrifying and violent display, where hundreds of thousands of lightning bolts came crashing down upon Thor. The towering mecha absorbed them, then released the contained power in a cone of devastating electric fire. Forest of Lightning!\u003c/p\u003e\n\u003cp\u003eThe beam of light from Starblade, and Thor’s Forest of Lightning met in the air. Amidst the shuddering corona of disparate energy, the two vanished. However, where Thor and Triton had been under pressure moments before, now the tables were turning.\u003c/p\u003e\n\u003cp\u003eAs god-ranked pilots, and ninth-ranked Talents, these men were masters of battlefield control. Without any hesitation, making a split-second decision, both Thor and Triton were in motion. They positioned for an area attack.\u003c/p\u003e\n\u003cp\u003eGolden blasts of lightning joined with crashing blue waves. They seemed to cover the whole of this simulated world. Despite Deimos’ wealth of experience, he was still losing ground.\u003c/p\u003e\n\u003cp\u003eThe comments section was silent. Many of the older pilots shut their eyes, bitterly refusing to watch. They knew DreamNet’s upgrade meant this was the end of an era, and they didn’t want to see it happen. Would Deimos – heroic pilot, legendary powerhouse – have to exit his kingdom in this way? They feared it might be.\u003c/p\u003e\n\u003cp\u003eBut in the end…\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBoom--!\u003c/em\u003e Starlord disappeared in to the storm of destructive energy. Mecha, sword, and pilot went up in flames.\u003c/p\u003e\n\u003cp\u003eA unified cry went up through the audience: “No--!”\u003c/p\u003e\n\u003cp\u003eBut there was nothing they could do to change the result.\u003c/p\u003e\n\u003cp\u003eDeimos fall was indicative of the rest of the match. Thor and Poseidon tore down mid lane unopposed, which drew the ire of Starlord’s teammates. They came thirsting for revenge, eventually converging in the center of the field. The Monarchs and Star Alliance went head to head, but the end had already been determined. In the end, the Monarchs lost Poseidon and Hades, but the Star Alliance headquarters was destroyed. The Monarchs had won their second victory.\u003c/p\u003e\n\u003cp\u003eMiao Xiao had not\u0026nbsp; continued to offer explanations or analysis during the fight. From beginning to end, she maintained her silence. When the fight was finished, everyone was quiet.\u003c/p\u003e\n\u003cp\u003eThere were no more illusions about these matches. Deimos – originally the strongest of the Star Alliance by a massive margin – was now the weakest. The anxiety and suspense was gone, and the audience knew Prometheus would give the enemy no quarter. No matter how many battles followed, the result would be the same.\u003c/p\u003e\n\u003cp\u003eMo Xiao by this point had received some information. She looked it over and then, with serene expression and a small smile, began to speak.\u003c/p\u003e\n\u003cp\u003e“I apologize, I’ve been very quiet. Watching this last fight, I could hardly breathe. Unfortunately this is the inevitable march of time, as the newer generations grow and improve the elders are left behind. Still, it’s not what we want! I actually have some news, from the Four Divine Monarchs. They would like to announce that they are forfeiting the fifth and final fight. With this development, we would like to announce the winner of today’s first ever God Team Competition – the Star Alliance! Deimos remains undefeated, and leaves DreamNet after this final victory. For those of you who have already purchased the full analysis package, DreamNet will reimburse thirty percent of that.”\u003c/p\u003e\n\u003cp\u003eMo Xiao carefully and clearly revealed the news. Once again, the comment section erupted in to excited discussion.\u003c/p\u003e\n\u003cp\u003ePart of the Monarchs’ decision to forfeit was certainly out of respect. Their esteem of Deimos was such that they didn’t wish to see his legend tarnished. In turn, it earned them some respect from audience members as well. The comments section confirmed it.\u003c/p\u003e\n\u003cp\u003eIn effect, there were no losers in this fight.\u0026nbsp;DreamNet’s evolution would constitute a massive change for the network. Certainly there were those, like Deimos, that would see their prestige diminished. On the other hand, there was certain to be more young adepts appearing on the scene. It was an integral addition in the end, allowing DreamNet to more accurately mimic life..\u003c/p\u003e\n\u003cp\u003eAlready DreamNet had expressed the fact that there will remain certain sectors unavailable for Discipline use. In this way some of the charm of the old DreamNet will remain, as well as to keep it fairer for non-Talent pilots. It was there that Deimos’ name would forever live at the top of its power rankings.\u003c/p\u003e\n\u003cp\u003eThese were DreamNet’s plans and machinations for the near future. Undoubtedly the results would be more than favorable. At the very least it will overshadow any grumbling about the change.\u003c/p\u003e\n\u003cp\u003e“Hey bro.” Zeus’ voice called over the coms.\u003c/p\u003e\n\u003cp\u003ePrometheus was alone in his pod. No one could see the sadness in his eyes. “What is it?”\u003c/p\u003e\n\u003cp\u003e“There’s something I need to discuss with you,” the younger Lan went on in a quiet voice.\u003c/p\u003e\n\u003cp\u003e“Alright. We’ll open a dedicated channel.” Lan Qing did just that. There were few methods more reliable for absolute secrecy than a god-ranked pilots conversation in Sanctuary.\u003c/p\u003e\n\u003cp\u003eTheir exchange didn’t last very long. Chu Cheng and Hua Li waited patiently for them to finish. Both of them were content to stand in silence, ruminating on the circumstances. Neither appeared to be in a pleasant mood. Although victory was all but assured, it wasn’t a win they wanted. The top spot was poisoned.\u003c/p\u003e\n\u003cp\u003eLikewise, had there not been a sudden change in DreamNet structure, their defeat would have been inevitable. The same would have been true if Deimos was an Adept.\u003c/p\u003e\n\u003cp\u003eAfter a little while the two brothers finished their conversation. Prometheus nodded at Zeus. “Alright, we’ll leave it there for now. I’ve got to head out.”\u003c/p\u003e\n\u003cp\u003eA voice interrupted Lan Qing’s exit. “I was wondering if I could have a word with the four of you,” it said.\u003c/p\u003e\n\u003cp\u003eShock froze the Divine Monarchs in place. It was Deimos who approached them!\u003c/p\u003e\n\u003cp\u003eSeveral figures walked to the gathered Monarchs. At the head of the small entourage was the First Under Heaven. Thunderclap, the Knave, Yu Honghu and Windbreaker fanned out to either side. The whole of the Star Alliance stood and stared at their rivals.\u003c/p\u003e\n\u003cp\u003eDeimos didn’t look any less regal after the affair. He stood straight and tall, slowly made his way toward the others.\u003c/p\u003e\n\u003cp\u003eLan Qing stopped. Clearly he couldn’t leave just this moment, not least because he was interested in what in the world Deimos had to say. Even with all his wisdom, he couldn’t puzzle it out. Where it simply about his retirement, or the upgrade to DreamNet, there were better avenues. Instead he’d chosen this one.\u003c/p\u003e\n\u003cp\u003eThe Starlord waved a thick hand. In response, the world around them became a universe of twinkling stars. Constellations swam in the dark expanse that surrounded them on all sides. Eventually the lights receded and a room was revealed. All nine of the competitors appeared within.\u003c/p\u003e\n\u003cp\u003e“This is…” Hua Li trailed off as his eyes stared in bewilderment.\u003c/p\u003e\n\u003cp\u003e“Discipline!” Lan Jue’s eyes were wide. This wasn’t some DreamNet function, it was Discipline! Deimos was indeed an Adept like the rest of them. Now he felt them, the waves of power pulsing from the Starlord from somewhere deep within. They had been well hidden. But now he felt it – terrifying was the only way he describe the sheer volume of ability he felt! They were all wrong, he surely was a powerful Adept. But, then why didn’t he use it during the fight?\u003c/p\u003e\n\u003cp\u003e“Sir, what’s the meaning of this,” Lan Qing coldly greeted.\u003c/p\u003e\n\u003cp\u003e“Forgive me,” Deimos replied while shaking his hand apologetically. “I hope you all don’t think I’m looking down on you, or was taking it easy. In truth, I can’t use my Discipline in combat. I don’t have the ability to control it anymore. Seeing as we’re safe and separate here, there’s also something I want to talk with you about.”\u003c/p\u003e\n\u003cp\u003eThe Four Divine Monarchs were finding it difficult to respond. Their minds were muddled by the strange revelation they just had. Yet they felt at ease with Deimos, and felt as though they could trust him. There was no time for small talk or wasted words now.\u003c/p\u003e\n\u003cp\u003eBut what did he want to say?\u003c/p\u003e\n\u003cp\u003eDeimos lifted his hand again, and removed the mask from his face.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-287\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-289\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-288","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
