{"id":56537,"no":315,"title":"Chapter 313: Light Bulbs","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 313: Light Bulbs\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eA strange, gentle sensation lingered within Lan Jue. The training had been exceptionally laborious for these talented kids, but Zhou Qianlin persisted. Never once did she cry out in pain, or for help.\u003c/p\u003e\n\u003cp\u003eHe slowly stood with her in his arms, then laid her gently onto the bed. She never loosened her hold on his neck – even when he tried to get himself loose, she just held him tighter. “Don’t go,” she murmured.\u003c/p\u003e\n\u003cp\u003eLan Jue hadn’t been expected her to pull back, and she’d gotten quite strong after her two-month training. He practically fell down on top of her.\u003c/p\u003e\n\u003cp\u003eQianlin’s breath caught in her throat, but she didn’t wake. Only her cheeks reddened.\u003c/p\u003e\n\u003cp\u003eThe contact was like an atomic bomb in Lan Jue’s brain. They were so close, this sensation… Lan Jue’s breath began to quicken, and Zhou Qianlin instinctively gripped the bed sheets.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBang bang bang!\u003c/em\u003e A knock sounded at the door. Tang Mi’s voice called in. “Qianlin…. Qianlin you there?”\u003c/p\u003e\n\u003cp\u003eLan Jue’s eyes popped wide, and he shot to his feet. He was so quick to extricate himself from the student that he banged his head against the wall. He pressed a hand to his head and winced. Qianlin was, by this point, completely awake.\u003c/p\u003e\n\u003cp\u003e“I’m here Little Mi. What’s up?” She fought to bring herself back under control while speaking to her friend.\u003c/p\u003e\n\u003cp\u003e“Open the door, I have to talk to you about something,” she said.\u003c/p\u003e\n\u003cp\u003eShe glanced at Lan Jue, who had already replaced his golden mask. He gave her a nod.\u003c/p\u003e\n\u003cp\u003e“Coming.” She stood and opened the door. Tang Mi’s impatient face appeared on the other side. She blinked curiously at her friend’s rosy cheeks and heaving chest, then gave her wink\u003c/p\u003e\n\u003cp\u003eQianlin just looked at her, confused and unsure of her meaning. Tang Mi pulled the door open the rest of the way to step inside, and that’s when she saw Lan Jue.\u003c/p\u003e\n\u003cp\u003e“Ah! D-drillmaster, you’re here too! Hello.” She snapped to attention.\u003c/p\u003e\n\u003cp\u003eHe nodded. “I also had something to discuss with this student. Our business is complete – I’m leaving.” He shot Tang Mi a glance before swaggering out of the door.\u003c/p\u003e\n\u003cp\u003eTang Mi smiled sweetly, and stepped aside to let him pass. But the moment he was gone she shut the door with a disdainful sneer, as though she were removing something repulsive.\u003c/p\u003e\n\u003cp\u003e“Little Mi… what are you doing?” Qianlin said in agitation.\u003c/p\u003e\n\u003cp\u003eQianlin’s friend looked her over. “Are you alright? Did he do anything to you?”\u003c/p\u003e\n\u003cp\u003eQianlin’s response was cold and irritated. “What the hell is wrong with your head?! He was asking me about the fight today, and my Discipline. Now what do you want?”\u003c/p\u003e\n\u003cp\u003eTang Mi heaved a sigh. “Good… good. It scared me! I thought… well, you’re so pretty. And he’s so strong. If he wanted to, ehm, emulate the birds and the bees, which one of us could stop him? It’s good he didn’t do anything.”\u003c/p\u003e\n\u003cp\u003eQianlin’s lips curled in to a frown. “What makes you think the Drillmaster is such a despicable person?”\u003c/p\u003e\n\u003cp\u003eTang Mi sniffed derisively. “Who says he’s a good man, either? Have you already forgotten how he tormented us? \u003cem\u003eI\u003c/em\u003e still remember the needles he stabbed us with. That pain, I’ll remember for the rest of my life. When I’m stronger, I’ll give him a taste of his own medicine! Henh henh henh henh…”\u003c/p\u003e\n\u003cp\u003eThe young politician’s daughter laughed in spite of herself. “Alright, that’s enough. Weren’t you just telling me about how much improvement you feel you’ve made? Say what you will about the Drillmaster, but his methods are effective. Why the change of heart all of a sudden?”\u003c/p\u003e\n\u003cp\u003eTang Mi chortled. “Alright, fine. I’ll be honest – he’s actually very cool, and ruggedly handsome I think. I wish I knew what his face looked like under that mask. They say people with disabilities hide them behind masks. I think that’s probably why he does it, otherwise why wear a mask all the time? His assistants, too. It’s all too strange, am I right?”\u003c/p\u003e\n\u003cp\u003eQianlin was on the verge of erupting in to laughter. She quickly and silently relayed this information to Lan Jue through the Spiritcaller gem. She responded to Tang Mi before she could tell something was amiss. “How do I know?”\u003c/p\u003e\n\u003cp\u003eTang Mi continued on her ruminations. “Or maybe he’s as handsome as Poseidon! That’d be nice. Then he’d be the perfect man. You know I saw the way Tan Lingyun was looking at him – very unusual. She’s been staring at him through the whole training, intentionally or not. Like she wants to eat him. Think I should throw my hat in the ring? I may not have a mature figure, but my advantage is in age!”\u003c/p\u003e\n\u003cp\u003eQianlin patted her forehead. “Hey! Would you stop being such a nympho? You go through dream lovers like candy. First it’s this one, then another. How about a little consistency!”\u003c/p\u003e\n\u003cp\u003eTang Mi adopted an indignant, morally superior air. “I like what I like. If, one day, there is a man who is worthy then I’ll put all my attention on him.”\u003c/p\u003e\n\u003cp\u003e“Alright,” Qianlin said, wishing to change the subject. “Get out of here, I’m sleepy. I think I’ll take a nap. Rest is a rare thing.”\u003c/p\u003e\n\u003cp\u003eTang Mi jutted her tongue out at her friend. “It still looks like you’re upset! And I don’t get a ‘thank you’ or anything. I risked offending the Drillmaster to come save you!”\u003c/p\u003e\n\u003cp\u003eQianlin smirked. “Yes, yes – thank you ever so much, Sister Mi.”\u003c/p\u003e\n\u003cp\u003eEventually, with great effort, she managed to send Tang Mi off. Qianlin couldn’t help but shake her head. Tang Mi was a good friend.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue had returned to the boy’s dormitory by the time he heard Qianlin’s messages.\u003c/p\u003e\n\u003cp\u003eThe Spiritcaller Power Gem:\u003c/p\u003e\n\u003cp\u003eLan Jue’s voice was thick with umbrage: \u003cem\u003eShe thought I was there to take advantage of you?!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eZhou Qianlin: \u003cem\u003eThen what were you doing laying on me?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eYou \u003c/em\u003epulled\u003cem\u003e me!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eYou’re strong as an ox. I weigh a hundred pounds, how can I pull you?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAh? So you deny it? So if that kind of man, I guess I could just sneak in there while you’re asleep…\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e…\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhat do you think about that?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eI wouldn’t be disinclined.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eI… a thousand showers wouldn’t clean the spirit from that. You really pulled me!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eIt’s fine, no need for excuses. At any rate, it’s not like you were in any rush to get \u003c/em\u003eoff\u003cem\u003e me. What, you didn’t think I was awake?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis is emotional abuse! I’m being framed!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eDon’t worry. I forgive you.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003e…\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIn the early morning, the traditional bugle call the NEU students had all come to recognize roused them from their slumber. There was no departure party or flashiness – it was just time to go. Not even Gao Lei was present. Only the guide was there, to lead them to Zeus-1.\u003c/p\u003e\n\u003cp\u003eThe small sapphire ship took off and glided through the atmosphere, under escort from two An Lun patrol ships.\u003c/p\u003e\n\u003cp\u003eAfter a moment, Lan Jue’s ship shook and they sped off toward the stars.\u003c/p\u003e\n\u003cp\u003eLan Jue watched An Lun shrink in to the distance from a porthole. He struggled with conflicting emotions.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBrother. I’ll be back. I look forward to standing at your side in the fight to come.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe students felt similarly. They were silent as An Lun slowly disappeared behind them. A month wasn’t very long in the grand scheme, but they’d learned a tremendous amount in that time. Everything they’d gained here would benefit them for the rest of their lives. It was an important, life-changing experience.\u003c/p\u003e\n\u003cp\u003eAs they set their course for home, the students all unconsciously tightened their safety harnesses. Who knew if the Demon Drillmaster would take this chance to test their g-force resistance again.\u003c/p\u003e\n\u003cp\u003eBut the ride was unexpectedly smooth. However, it wasn’t long before a silhouette appeared before the ship, suspended in space.\u003c/p\u003e\n\u003cp\u003e“Do you all think you really won that battle, yesterday?” Lan Jue’s question was simple, but there were clear notes of disdain.\u003c/p\u003e\n\u003cp\u003eHe snorted. “Truth is, that’s what I thought. Then, I discovered I was wrong…”\u003c/p\u003e\n\u003cp\u003eLan Jue went on to share what he’d learned with the students. Their faces blanched as they came to the realization.\u003c/p\u003e\n\u003cp\u003eHe then went on to discuss groups. After discussion with his assistants, the squads were restructured. There were still five teams, with some changes. Jin Tao switched with Tang Mi, for one, replacing her as captain of Echo squad.\u003c/p\u003e\n\u003cp\u003eThe reason for the slight change was simple: Echo had taken the most casualties from their exchange. Only Qianlin and Tang Mi had survived. Their decimation was a direct result of Tang Mi’s command.\u003c/p\u003e\n\u003cp\u003eJin Tao had been in Geng Yang’s group for the fight. Although Delta was sacrificed, he fought with bravery and relied on his own strength to pull him through. He’d put himself between the enemy and his squad to cover their retreat. Unfortunately, his opponent had been Prometheus.\u003c/p\u003e\n\u003cp\u003eAlthough they’d ultimately been defeated, Geng Yang and Jin Tao’s sacrifice had revealed the enemy’s location. Although Jin Tao’s time on the field had been brief, he’d performed admirably. That is why he was promoted.\u003c/p\u003e\n\u003cp\u003eTang Xiao was also commended. Charlie squad, under his command, performed the best. Tan Lingyun, conversely, was criticized for the great losses her team had endured.\u003c/p\u003e\n\u003cp\u003eAfter the teams were restructured, they found their roles similarly adjusted. After witnessing the demonstration of their Discipline, Lan Jue was able to separate them more effectively. New tactics were devised to better suit the changes.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-312\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-314\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-313","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
