{"id":56260,"no":38,"title":"Chapter 38: The NEU","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 38: The NEU\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe bike leisurely meandered towards the school, Lan Jue sitting straight atop it so as not to wrinkle his finely pressed suit.\u003c/p\u003e\n\u003cp\u003eThe fine black bike had been procured for him by the The Wine Master. He had always been a fan of antiques. Apparently this bike the Wine Master had been riding was a relic from Former Era China. The brand name – Forever – could be made out on it’s crossbar. It was a good name, denoting it’s quality. The bike was veritably soundless as it rolled along.\u003c/p\u003e\n\u003cp\u003eA soothing, cool breeze caressed his face. Occasionally he would ring the bell, and the crisp \u003cem\u003eding ding ding\u003c/em\u003e would waft upon the wind. It was certainly a novel experience for Lan Jue.\u003c/p\u003e\n\u003cp\u003eToday, in order to appear more the professor, Lan Jue had chosen to wear a pair of black-rimmed spectacles. Naturally they were lens-less*, but they lent a certain air of culture and gentleness. His clean and kept face wore a genial, elegant smile. It was a scholarly look, contrary to what one might expect.\u003c/p\u003e\n\u003cp\u003eFrom far away he could make out the towering sign of the National Eastern University. The front gates of the campus were tall, and made of fine wrought metal. In fact, they were composed of an alloy, though it was difficult to determine which with the naked eye.\u003c/p\u003e\n\u003cp\u003eThe National Eastern University. The letters were bold and brazen, written in a forceful hand that demanded attention. They caused Lan Jue to think back on that old geezer, reclining easily on his deck chair. He couldn’t of been the one to write this, could he?\u003c/p\u003e\n\u003cp\u003eAnd yet Lan Jue knew clearly that though the man looked older than God, he’d probably go another hundred years before kicking the bucket. He was the world’s greatest scientist! Was there anyone else who understood the workings of the human body better than he?\u003c/p\u003e\n\u003cp\u003eIt wasn’t long before Lan Jue and his antique Forever bike arrived before the campus’ lofty gates.\u003c/p\u003e\n\u003cp\u003eHe’d arrived just as the students were showing for morning lessons. The school’s gates were thrown wide to accommodate the occasional maglev vehicle. As the levitating cars drew near they would slow, rapidly shifting from speeding bullets to full stop. Before the gates they would be scanned, and only then were they permitted entrance.\u003c/p\u003e\n\u003cp\u003eAside from the maglevs, pricey high-altitude verti-cars were also seem from time to time. Like their inexpensive cousins, they also had to stop and get scanned before they could enter. In fact, the air above the university was entirely devoid of verti-cars or other traffic. At least, not on the campus. Such were the rules, and any who dared break them ran the risk of being shot out of the sky.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eA number of the maglevs arrived at the gate and went no further. Parking on campus cost a pretty penny, so most of students were sent to school by family. They would be dropped off at the gate and walk in from there.\u003c/p\u003e\n\u003cp\u003eDumb-mutt Jin was such a student. His family’s maglev arrived at the gates and descended until he could jump out. He slipped his backpack over his head and walked towards the gate.\u003c/p\u003e\n\u003cp\u003eThe backpack was something that survived the inevitable march of progress. Personal inter-dimensional pockets existed, but only for those students whose families were particularly well off.\u003c/p\u003e\n\u003cp\u003eDumb-mutt Jin’s family was middle class at best. A maglev itself was an achievement.\u003c/p\u003e\n\u003cp\u003eHe made his way through the gates, nodding his head to the rock and roll blasting through his headphones like he did any other day.\u003c/p\u003e\n\u003cp\u003eHe wore a black school uniform that was fairly well kept, but the white shirt beneath was undone to the third button revealing his underwhelming pectorals. He wore a diamond earring in his left ear that lead the eye to his pink spiky hair. It made him look rather like a rooster. He certainly didn’t look the part of a model student.\u003c/p\u003e\n\u003cp\u003eMecha Pilot. Junior. Problem child. Those were the words to describe Dumb-mutt Jin. His name was actually Jin Tou, but his emphatically miserable behavior earned him the moniker Dumb-mutt. He was like a cur, they said, biting anyone he came across. And with his current academic record, graduating was starting to look like a crazy pipe dream.\u003c/p\u003e\n\u003cp\u003eAs he made to traverse the gates Dumb-mutt Jin looked up in time to see something that stopped him in his tracks.\u003c/p\u003e\n\u003cp\u003eA man in a pressed suit rode towards the school on an ancient two-wheeled bicycle. He was a few meters away from the school when he threw his right leg over the back of the bike, balancing on his left foot perched atop the pedal. He swept by like that, standing to one side as the bicycle rolled on. His casual entrance, fine suit and gaunt stature was quite the attention-grabber.\u003c/p\u003e\n\u003cp\u003eDumb-mutt Jin had fostered an interest in novelty items, and his eyes grew wide at the sight. He immediately pinched thumb and forefinger together, placing them in his mouth to produce a shrill whistle.\u003c/p\u003e\n\u003cp\u003eThe man soon pulled up the university’s gates and dismounted.\u003c/p\u003e\n\u003cp\u003e“Hey brother, not bad! Where’d you get the wheeler? Pretty sweet ride. All mechanical, right? Manpowered?” Dumb-mutt Jin appeared a fan of the past, and walked a circuit around the man.\u003c/p\u003e\n\u003cp\u003eThe man offered a refined smile, and gave a reserved nod of his head. “It’s called a bicycle. All manpowered.”\u003c/p\u003e\n\u003cp\u003e“It’s got character! Lemme get a ride on it.” Dumb-mutt Jin moved closer still in zeal.\u003c/p\u003e\n\u003cp\u003e“I’m afraid not,” the suit-clad mad responded with a shake of his head.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003ePfft,”\u003c/em\u003e Dumb-mutt spat disdainfully. “Well that’s not fair, ya stingy bastard. Whatever.” As he spoke, he turned and entered the campus. He wasn’t a good student, true, but making trouble before the university gates was just plain stupid.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue followed the chicken-head punk depart with his eyes, a laugh bubbling unbidden from his chest. Memories of his own time as a student came rushing back, and it appeared this university had it’s own problem kids. The exaggerated hairstyle reminded him of a young A-Cheng, who’d experimented with something similar. But, sadly, that ended when his mother came storming into the school with a pair of scissors. \u003cem\u003eSnip, snip!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eBeep!\u003c/em\u003e Attention unregistered vehicle, you are prohibited from going further.” An emotionless digitized voice pulled Lan Jue from his reverie. Two men in uniform were already watching as he approached.\u003c/p\u003e\n\u003cp\u003eThe two men were clearly campus security, and were clad in uniforms made to look like military fatigues. Both were quite tall, and quite burly.\u003c/p\u003e\n\u003cp\u003e“Unregistered vehicle, you are not permitted to enter the campus grounds. Please await processing, and produce your student identification for inspection.”\u003c/p\u003e\n\u003cp\u003eLan Jue certainly wasn’t as old as Zhou Qianlin had tried to assert. Freshly shaved he looked quite young, no different than a post-graduate student.\u003c/p\u003e\n\u003cp\u003eLan Jue smiled, and spoke to the uniformed guards politely. “Good morning, to the both of you. Please excuse me, but I haven’t got a student ID. This is actually my first day reporting to the university. I’m afraid I’m not familiar with the rules.” As he spoke, he pulled out a dark blue envelope from the basket affixed to the back of the bicycle. He opened the document and produced the letter of appointment.\u003c/p\u003e\n\u003cp\u003eOne of the guards took the red paper from Lan Jue’s grip, while at the same time whipping free some instrument from his waist. He drew the apparatus over the document, scanning it. Only afterward did he open it to read.\u003c/p\u003e\n\u003cp\u003e“Etiquette teacher? What’s an etiquette teacher?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e*I don\u0027t know about the other places in the world these days, but rimless glasses are a \u0027thing\u0027 in China. A fashion statement aimed at making you look cute or scholarly. I mean, you forgot to put actual glass in your glasses, so I dunno how smart you are, but that\u0027s just me showing my age I guess...\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-37\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-39\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-38","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
