{"id":56617,"no":395,"title":"Chapter 393: The Opening Ceremony","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 393: The Opening Ceremony\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe hosts and sponsors of the games ensured that no violence occurred outside of the arenas. That didn’t mean they barred people from defending themselves. The short man had started things my slapping his shoulder and poking at him – that earned a response. Of course Lan Jue would not get in to trouble for that.\u003c/p\u003e\n\u003cp\u003eThe surrounding Adepts didn’t dare trouble Lan Jue further. Some of them knew the short man, and knew that he was a seventh ranked Adept. Even still, he didn’t even have a chance to use his Discipline against the masked man. Eventualy he picked himself up off of the floor, and slinked away like a beaten dog.\u003c/p\u003e\n\u003cp\u003eThe first day would have a staggering number of Adepts competing, so they had set aside a place designated as an Adept resting and waiting area. Once registration was complete, robotic assistants lead them to this waiting room and urged them to have a seat.\u003c/p\u003e\n\u003cp\u003eAs they made they way through the corridors of the arena, Lan Jue couldn’t help but sigh inwardly. The place reminded him quite a lot of the NEU’s training facilities, just much larger.\u003c/p\u003e\n\u003cp\u003eThe octagonal sports arena was capable of holding over a hundred thousand people. The open air battlefield itself was the size of ten football fields, and had been separated in to several diamond-shaped fields. Each one was roughly fifty meters in diameter. Altogether there was a hundred of these small skirmish fields. It meant two hundred adepts could battle at a time. The stands were each equipped with a personal screen that let the view see the action up close. It was state-of-the-art, and despite the chocking throngs of people there was perfect order. Overhead, a cadre of mecha pilots hovered, keeping an eye on the situation below.\u003c/p\u003e\n\u003cp\u003eAt the Western end of the field there was a raised dais different from the others. It stretched long, with seats enough for a hundred spectators. Clearly this was the VIP booth, as was evident by its perfect view of the arena.\u003c/p\u003e\n\u003cp\u003eAfter a little over an hour, all of the participating Adepts were registered. The ceaseless din of impatient people filled the waiting area. Lan Jue, however, stood with a firm dispassion for the goings on that swirled around him. A badge was pinned to his chest with the number 315.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eHrrrmmmnn….”\u003c/em\u003e An electronic hum filled the air. The boisterous crowds were silenced as a blanket of darkness fell upon them – like the day had suddenly been extinguished.\u003c/p\u003e\n\u003cp\u003eFloodlights cracked as they switched on, sending beams of light piercing through the blackness in all directions. They swayed and rolled until settling on a single figure, suspended in air above the center of the arena.\u003c/p\u003e\n\u003cp\u003eHe was dressed in black leather, and his physique could rival mountains. Tidal waves of oppressive force crashed against the awe inspired onlookers. It wasn’t focused, so the crushing asphyxiation they felt flow over them was thankfully temporary.\u003c/p\u003e\n\u003cp\u003e“Welcome Ladies and Gentlemen, fans and contenders, to the Conclave’s Tournament Arena.” The man’s thunderous voice boomed across the fields and bleachers.\u003c/p\u003e\n\u003cp\u003eNaturally, all the Northerners recognized the celebrity immediately. This was their pride and joy, fourth strongest Paragon, the Terminator! Outsiders didn’t need too long to guess for themselves who he might be.\u003c/p\u003e\n\u003cp\u003e“I offer you all a feast for the eyes, available live here and at home. You young fighters here for glory, show us what you’re made of. Let the whole human race see how strong you truly are.”\u003c/p\u003e\n\u003cp\u003eHis were were simple, a few sentences only. But he said them with a fierce vigor and a booming voice, and that was enough to get the competitor’s blood boiling.\u003c/p\u003e\n\u003cp\u003eThe Terminator had not been exaggerating. Everything that was going to happen on these fields were streamed live to all corners of the human Alliances. The proceeds would be used to help acquire the lofty prizes organizers had promised.\u003c/p\u003e\n\u003cp\u003eThe lights peeled away and plunged them all in to darkness, but just for a moment. The darkness fled before a radiant blue – though this was not the blue of the sky. This was a heavier blue, like the boundless depths of the ocean.\u003c/p\u003e\n\u003cp\u003eThere was not a sound. Then, rolling in with the soothing color came a ululating cry. An enormous column of golden light sprang to life, stretching from the ground up to the distant heavens. Gradually, a sapphire-hued figure radiating cobalt blue light descended through the glimmering column.\u003c/p\u003e\n\u003cp\u003eThe notes of this man’s song were strong and clear, and the familiar strains of \u003cem\u003eSounds of Nature\u003c/em\u003e filled their ears. The silence of the arena was shattered. A hundred thousand voices rang out with cheers, like thunderous waves that crested and rose again and again.\u003c/p\u003e\n\u003cp\u003eThe same word reverberated over and over; \u003cem\u003ePoseidon! Poseidon! Poseidon!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eHua Li’s face was a mask of bitter pain, like the face he’d shown at the loss of that little mermaid girl. The magnificent decorations from his earlier concert had been exquisite, but this time… this time he truly did look like the King of the Oceans.\u003c/p\u003e\n\u003cp\u003eHis voice had a strangely alluring quality, almost magnetic. Listeners almost couldn’t help but reach out, to offer comfort and companionship to this forlorn god. No one could escape the moving quality of his sorrowful ballad, a song that despite having no words resonated with the soul of every listener.\u003c/p\u003e\n\u003cp\u003eAs the entertainer sang, a line of figures made their way on to the VIP observation deck. The Terminator stood at their head, and the newly minted Infernal Vanguagrd stood at his shoulder. Half a step behind them walked two more; Metatron, and Lucifer.\u003c/p\u003e\n\u003cp\u003eNeither Paragon from the Western Citadels chose to come. It wasn’t expected that they would. They didn’t have the luxury of the Avenue, after all, with so many Paragons to send as representatives. The Pontiff also had his own issues to deal with.\u003c/p\u003e\n\u003cp\u003eA cadre of government officials and famous Adepts trailed the four mighty leaders. Though distinguished, those Adepts that walked with Davis were too old to participate in the games. None of them were any less than ninth rank.\u003c/p\u003e\n\u003cp\u003eThe final notes of Poseidon’s \u003cem\u003eTears of the Sea-God\u003c/em\u003e came to a close. However, he did not vacate the stage once the song was complete. His powerful voice, clear as crystal, sang acapella in deafening scales of emotion. The crowds howled back at the top of their lungs.\u003c/p\u003e\n\u003cp\u003eThere weren’t many who could boast seeing a Poseidon concert live. Gobi Entertainment would generally never allow a concert to be streamed across the galaxy as this one was. Here, though, was a blessing. One hundred thousand people screamed and wiped away tears as they stared at the superstar mere meters away. People at home were glued to their televisions and projectors to watch the first ever universally streamed Poseidon concert. With nothing but his voice, the Divine Monarch inspired a thunderous zeal in his audience.\u003c/p\u003e\n\u003cp\u003eTo the normal man, Paragons were too separate for them to comprehend. They were living gods, hardly even human. But Poseidon was different. People would scrape and claw for a copy of his records. Now here he stood before them, the universal idol, and it was almost more than they could believe.\u003c/p\u003e\n\u003cp\u003eEventually his singing ceased, and with an easy smile he bowed. Suspending in air, he turned to face the crowds in another corner and bowed again. He repeated this several times.\u003c/p\u003e\n\u003cp\u003e“I am honored and humbled to have been given the opportunity to preform for all of you today. I myself am an Adept – and certainly under forty! I wanted to join the festivities myself… those prizes are something else. But, I don’t think I can honestly compete. I would be ruined before ever entering the arena. I do have a reputation to uphold, after all.”\u003c/p\u003e\n\u003cp\u003eHis voice was soft and humble, with a note of mirth. He gave the crowds and easy laugh.\u003c/p\u003e\n\u003cp\u003e“But I do hope there’s one thing I can do while I’m here. I haven’t cleared this with our sponsors, but I’m sure they’ll indulge me. To whosoever wins this grand tournament, I’d like to buy you a meal. You and me, one an one. I’ll certainly have some questions on how to make myself stronger!”\u003c/p\u003e\n\u003cp\u003eAnother round of cheers tore through the arena. Many of the spectators here and watching the stream had also seen Poseidon perform during the god battles. Though they were competing as mecha pilots, it had served to reveal Hua Li’s skill. His availability and proximity, along with his self-deprecating words, only made the audience more excited for the likeable hero.\u003c/p\u003e\n\u003cp\u003e“I’m still talking because I’m waiting for my music. This is a real treat for all of you, a new and original song I recently composed. Here it is for all of, in commemoration of this momentous competition. I call it, \u003cem\u003eClash of the Titans.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eOn cue, the music swelled up to replace his introduction. The sound came low and rough like distant explosions. The floodlights pitched and rolled, and where they passed halos of radiant light swirled in feral eddies. The after image of the lights burned sharp edges in the eyes of onlookers as they swept across the skies.\u003c/p\u003e\n\u003cp\u003eHua Li reached out a hand, and a flash of light responded. His trident appeared in his grasp, like constrained light that fought to be free. It’s emanating luminescence washed over him, and where it touched his body became encased in golden armor. In the space of a breath, their gentle idol had transformed in to a terrible god of war.\u003c/p\u003e\n\u003cp\u003eHis blue hair blew back behind him, and his hands gripped tight upon the trident with a white-knuckle grip. Bathed in light, he \u003cem\u003eroared\u003c/em\u003e with his powerful voice, filling the arena with a warcry.\u003c/p\u003e\n\u003cp\u003eIt was a roar to shatter mountains and overturn seas. The swirling halos of light seemed to flea before his call, moving outward in rippling waves. The sweet tenderness of his first song was forgotten, replaced by the blood-boiling call to battle.\u003c/p\u003e\n\u003cp\u003eHe cried and swept his arms like a seasoned general commanding his troops. Images of a mounted host surging toward the enemies lines played out in the swirling lights.\u003c/p\u003e\n\u003cp\u003eHis voice grew louder still, and the armies vanished in the face of its power. In the distance a dark figure arose, bathed in an aura of poisonous purple. The two stared at one another from across the arena.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eThis\u003c/em\u003e is the ultimate battle. Justice, standing against evil. The power of the gods permeates all things, so surely evil must fall. Light shall reign supreme. Clash of Titans! Clash of Titans! Witness the battle of good and evil, here on this stage where gods are made. We are the divines who mold worlds to our whim. Our splendor lights the heavens!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-392\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-394\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-393","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
