{"id":56621,"no":399,"title":"Chapter 397: Daddy Has To Go","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 397: Daddy Has To Go\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe joy that poured out of the little girl was a font of positivity. She was like a sprite filling the area with happiness and excitement.\u003c/p\u003e\n\u003cp\u003eHe followed the Pharmacist and Jun’er back to their room. The suite was quite large, as Lan Jue noted while Jun’er pulled him to the sofa for a story.\u003c/p\u003e\n\u003cp\u003eAs had become somewhat of a custom, Lan Jue related his tale while carefully stimulating her ocular nerves with his bio-electric Discipline.\u003c/p\u003e\n\u003cp\u003eThe Pharmacist smiled as she listened from beside him on the sofa. Whenever it came to story time she would sit and listen absent-mindedly, thinking about what could have been. She pondered on how life would be different in the man in her heart were here. He would hold his daughter the same way, and tell her stories of his own. That would be so perfect…\u003c/p\u003e\n\u003cp\u003eBefore she would cry quietly at the painful thoughts, but over time she grew accustomed. The more they shared this family time, n fact, the more she enjoyed it.\u003c/p\u003e\n\u003cp\u003eThe gentle current of electricity and Lan Jue’s soothing cadence soon put the little one to sleep. She lay against his shoulder, her sweet features content. Lan Jue’ tenderly relinquished her to her mother, and followed as she put her to bed.\u003c/p\u003e\n\u003cp\u003e“Thank you, really.” The Pharmacist whispered.\u003c/p\u003e\n\u003cp\u003eLan Jue smiled warmly. He could see the depth of the emotion in her eyes. “Now I’m Jun’er’s father. Even if your husband came back, it wouldn’t change the fact. She’s an angel and I adore her. I do it for Jun’er, not for you.”\u003c/p\u003e\n\u003cp\u003eShe nodded her head in understanding. “She’s been so happy since you’ve come, and healthier too. This trip especially, she’s often tired but ‘ve never seen her happier. You were right, even if she can’t see she doesn’t deserve to live in a cage. I’m confident she’ll only get better, and grow quickly.”\u003c/p\u003e\n\u003cp\u003e“Well I should go,” he said after a moment. “And don’t worry, I’ll keep an eye on her through the tournament.”\u003c/p\u003e\n\u003cp\u003eShe gave a thankful smile. “Great.”\u003c/p\u003e\n\u003cp\u003e“Daddy…” Jun’er’s tiny voice muttered from her bed.\u003c/p\u003e\n\u003cp\u003eLan Jue moved to her side, and gently patted her hand. Her tiny fingers wrapped around his thumb and wouldn’t let go. She was having a nightmare.\u003c/p\u003e\n\u003cp\u003e“Daddy… daddy don’t go, okay? Stay with me and mommy. I miss you daddy…” Her tiny face was scrunched in sadness and concern.\u003c/p\u003e\n\u003cp\u003eThe Pharmacist had been holding it together, but Jun’er’s pleas immediately caused water to spring to her eyes. She fought to keep the tears contained.\u003c/p\u003e\n\u003cp\u003eLan Jue gently stroked her hair. “Daddy’s here sweetie pie, I’m not going anywhere. I’m staying right here with Jun’er.”\u003c/p\u003e\n\u003cp\u003eHe glances toward the Pharmacist as he spoke. She was stepping out of the room to regain her composure.\u003c/p\u003e\n\u003cp\u003eThe bed creaked as he tenderly lay down beside her. Like a kitten, Jun’er curled up against his warmth. Almost immediately her nervous expression melted away, and a look of stasfaction replaced it.\u003c/p\u003e\n\u003cp\u003eShe dreamt for a while and Lan Jue waited. After some time he attempted to get up, but the effort nearly woke her. He had no choice but to stay. After the Pharmacist calmed down she poked her head in once or twice but said nothing. Eventually Lan Jue also succumbed to drowsiness, and himself fell asleep.\u003c/p\u003e\n\u003cp\u003eWhen he awoke Jun’er was no longer in his arms, and he was covered in a blanket. He sighed and stretched as the comforting warmth flowed through him.\u003c/p\u003e\n\u003cp\u003eHe noted that he felt… released. His mood seemed abnormally easy. He hadn’t felt this since Hera died. Just as he was comforting Jun’er, she must be comforting him he thought. He sorely wished he had a little one of his own just like her.\u003c/p\u003e\n\u003cp\u003eWhen he stumbled out of the room he saw the Pharmacist carefully feeding Jun’er some fruit.\u003c/p\u003e\n\u003cp\u003e“Daddy!” Jun’er’s sharp hearing picked out his foot steps right away.\u003c/p\u003e\n\u003cp\u003eLan Jue gave the Pharmacist an embarrassed and apologetic smile, to which she mirthfully shook her head. He trotted over to Jun’er and placed her on his knee.\u003c/p\u003e\n\u003cp\u003eJun’er stuck her sticky little fingers under Lan Jue’s nose, clutching a piece of tangerine. “Eat some!”\u003c/p\u003e\n\u003cp\u003e“Aww thank you honey. Such a good girl!” He answered with a big smile.\u003c/p\u003e\n\u003cp\u003e“Daddy’s so lazy. I got a long time ago and you were still sleeping!” Her accusation actually caused Lan Jue to blush in embarrassment. He coughed to try and conceal his embarrassment.\u003c/p\u003e\n\u003cp\u003eThe Pharmacist couldn’t help but laugh. “Daddy’s just very tired, Jun’er. He still has a lot of things to do. You shouldn’t tease your daddy so much!” She then turned her attention to Lan Jue. “You can go ahead and manage your business.”\u003c/p\u003e\n\u003cp\u003eHe nodded in agreement.\u003c/p\u003e\n\u003cp\u003e“Daddy!” Jun’er called. “You should come back early tonight and help me sleep again. I had such a good sleep!”\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eEhm…\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eHe wasn’t sure how to respond. It was certainly an awkward situation. If he were to do as little Jun’er asked, how would the Pharmacist react?\u003c/p\u003e\n\u003cp\u003eHe looked her way to see, and saw her own face reddening. She shook her head helplessly. “We’ll have to see baby. If daddy gets everything done then he can come home early.”\u003c/p\u003e\n\u003cp\u003e“Oh.” She answered as her face fell.\u003c/p\u003e\n\u003cp\u003eLan Jue wanted to say something to comfort her, but held his tongue. He and the Pharmacist were only friends, despite what Jun’er thought. The situation between him and Qianlin being what it was, he wasn’t sure it was such a good idea she learn he was spending every evening in another woman’s room.\u003c/p\u003e\n\u003cp\u003eHe bid them both farewell and left for his own room. He trotted down the hall in high spirits, but there was a hint of bitter sympathy for the Pharmacist and her plight. To be so young with an absent lover. He certainly knew how that felt.\u003c/p\u003e\n\u003cp\u003e“You’re back.” He was surprised to find Zhou Qianlin waiting.\u003c/p\u003e\n\u003cp\u003e“The competition is over for the day?” Lan Jue asked in surprise. He’d have guessed it would be a little while longer still before all the fighters finished.\u003c/p\u003e\n\u003cp\u003eShe answered with a shake of her head. “No, they’re still at it. I came back early since I’m not terribly interested in combat. Besides you’ve already finished your first round. Are you alright, by the way? I saw the Convert land a hit.”\u003c/p\u003e\n\u003cp\u003eHe smiled. “Relax, I’ve got a thick skin. I just spent the time looking after Jun’er, the poor girl.”\u003c/p\u003e\n\u003cp\u003eQianlin knew of Jun’er, and was equally sympathetic. When she heard about his role as the small girl’s father, she encouraged him to continue.\u003c/p\u003e\n\u003cp\u003e“We should work on our Disciplines,” Qianlin announced.\u003c/p\u003e\n\u003cp\u003eHis smirk widened. “So diligent today. What lit a fire under you?”\u003c/p\u003e\n\u003cp\u003e“After seeing so many Adepts fighting, I feel like I need to at least match their strength. I feel like I’m getting close to a breakthrough,” she mused.\u003c/p\u003e\n\u003cp\u003eLan Jue’s brows crinkled at her words, and he grunted. “Shit, if only I advanced so quickly.”\u003c/p\u003e\n\u003cp\u003eBoth she and he had both undergone Bize’s ‘extraction process,’ but ever since then she’d been improving at light speed. If she did break through soon, it would mean she was already at eighth rank!\u003c/p\u003e\n\u003cp\u003eHer rapid advance wasn’t just because of her protogenic powers. Lan Jue’s bio-electric Discipline, and their combined cultivating efforts have all been tremendously profitable.\u003c/p\u003e\n\u003cp\u003eShe blushed. “So are you going to or not?”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah of course!” He answered quickly.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eBy the end of the second day, the three thousand Adepts who signed up were weened to half. The second round looked like it would have around seventeen hundred participants. All of those were already winners, considering the prizes for making the cut. Now with each win their prize will get better, becoming even more outrageous the further up they climb.\u003c/p\u003e\n\u003cp\u003eThe arena was a mess of people scrambling for seats. Scalped tickets were priced so high they would cost an average family their year’s salary, and yet they were being sold. The reduction in the sheer number of adepts didn’t appear to affect the audience numbers at all, but there was nothing for it. Safety concerns meant they couldn’t somehow increase capacity.\u003c/p\u003e\n\u003cp\u003eLan Jue made his way back to the arena in his golden masked and waited with the others for his turn to come. Things were much more straightforward in day two. There were no fancy speechs or extravagant shows. When the time came, lots would be drawn and that was all.\u003c/p\u003e\n\u003cp\u003eThe Skyfire Avenue combatants were nearby. Because of their illustrious standing and their shared origin, they were given their own rest area. Lan Jue was out with the ‘normal’ Adepts.\u003c/p\u003e\n\u003cp\u003eThe numbers were a lot smaller, but the system remained the same. Two hundred Adepts at a time, one hundred arenas. Things would move a lot faster this time around, though.\u003c/p\u003e\n\u003cp\u003eThere was a buzz, and the random draw began. Seventeen hundred pictures appeared suspended in the sky. With a maddening and dramatic shuffle, they arranged themselves in to pairs.\u003c/p\u003e\n\u003cp\u003eThis time Lan Jue’s opponent was number 67 – a very low digit, considering, and it took him by surprise. The Pharmacist was number 66. Close call!\u003c/p\u003e\n\u003cp\u003eAt his current level of strength he would have absolutely zero chance against the Pharmacist. More importantly, though, he didn’t want Jun’er to see her parents fighting! If it came to that, he would forfeit.\u003c/p\u003e\n\u003cp\u003eThis time, though, it was 67 he was facing. He’d heard from somewhere than the first hundred were all seeded competitors – all of them were ninth level at least.\u003c/p\u003e\n\u003cp\u003eThe opening round of fights had been rife with sixth and seventh level Adepts. His own eighth level opponent was an aberration that would be seen far more this time around – even far more ninth level foes. With his luck he’d fight a Paragon.\u003c/p\u003e\n\u003cp\u003eParticularly depressing was the fact that he was in the \u003cem\u003eninth\u003c/em\u003e batch this time, instead of the third. He’d be waiting here for quite a long time.\u003c/p\u003e\n\u003cp\u003eSo be it, time to wait.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-396\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-398\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-397","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
