{"id":56626,"no":404,"title":"Chapter 402: Hades’ Hospitality","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 402: Hades’ Hospitality\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAlthough Qianlin suspected something was going on, she didn’t immediately ask about it. Her face reddened as she bit her lower lip.\u003c/p\u003e\n\u003cp\u003ePart of Lan Jue’s insistence was for her benefit. He could have broken through the barrier to rank two alone, but wanted Qianlin to experience it as well. Differences in how quickly two people climb the ranks lie in how quickly they could strengthen their energy.\u003c/p\u003e\n\u003cp\u003eAdepts beneath the rank of ninth level ninth rank could envelope two people. Although Lan Jue couldn’t directly improve her Discipline, he could help to strengthen her body. A strong temple was important for a strong Discipline.\u003c/p\u003e\n\u003cp\u003eThe speed and strength of their combined powers was strong when they melded together – right to the peak of ninth level. He went rigid as the energy struck him like a flood, with shimmering electric purple light exuding from his pores. The pulses of energy evaporated his own clothing. This happened a total of three times before Lan Jue broke through completely to second rank.\u003c/p\u003e\n\u003cp\u003eEven though he and Qianlin were at the peak of ninth rank level when joined, he could still feel that their total power had increased somewhat since the last time. Their Disciplines were more vivacious.\u003c/p\u003e\n\u003cp\u003eIt was important to remember that the peak of ninth level wasn’t a point, so much as it was a plateau. When an Adept’s power reached a certain point, there they would remain until they discovered the Path to Paragon. It was similar to the discrepancies in hand speed among God pilots. Any pilot with a hand speed over forty was considered God-ranked, but they were practically children compared to God pilots with hand speeds in the eighties.\u003c/p\u003e\n\u003cp\u003eNaturally, there were also differences among Adepts when they got to such lofty heights of power. The vast majority of peak-level Adepts remained there for their entire lives, never able to comprehend the secrets of protogenia. This was the strength of a solid foundation and unceasing cultivation.\u003c/p\u003e\n\u003cp\u003eWhile the situation he was in wasn’t ideal, Lan Jue didn’t begrudge Bize her actions. By now he understood the reasons, and understood that in the end it had been the clairvoyant’s idea. He suspected that everything he’d experienced since encountering Bize had been carefully arranged by the former Avenue leader. Even down to her taking their ‘altruistic blood’, and the change in powers it produced.\u003c/p\u003e\n\u003cp\u003eHaving to go over ranks you’ve passed before certainly seemed on the surface to be a monumental waste of time and effort. The advantages came later, when the Adept reached his peak. With the benefit of a strong foundation, breaking through to Paragon would be much easier.\u003c/p\u003e\n\u003cp\u003eIt only went to show how precise and pervasive the clairvoyant had been. The deeper he went down the rabbit hole, the more he saw the old man’s gentle touch.\u003c/p\u003e\n\u003cp\u003eWhen it came to the Clairvoyant, Lan Jue was thankful for the old man’s guidance. Btu he was also terrified. It felt like every step he took the Clairvoyant was watching. Although he didn’t know how powerful the old man was in a fight, but his powers of prediction and control alone made him terrifying even compared to someone like the Terminator.\u003c/p\u003e\n\u003cp\u003eHe remembered that his old teacher had been loathe to speak of other Paragons, but the Clairvoyant was mentioned on more than one occasion. He even recalled notes of admiration in the crotchety man’s voice.\u003c/p\u003e\n\u003cp\u003eEverything was trending toward improvement. A year, that’s how long it would take at his current pace to get back to where he was before the Bize incident. He won’t be back where he started, however – he’ll be in a much stronger position for future growth, at the very least. In three years, he’d probably reach the peak of ninth level. This was a speed comparable to his brother’s, though not quite as fast.\u003c/p\u003e\n\u003cp\u003eThe thought made him laugh. He wanted to be better than his brother, but of course it wouldn’t be an overnight thing. He couldn’t even remember how many times Lan Qing beat him when they were young.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe Dark Citadel’s coterie had been set up in the Nice Hotel, a famous Western chain that spanned the Alliance. It wasn’t as expansive as the Intercontinental where he stayed, but it had an ‘old-world luxury’ charm.\u003c/p\u003e\n\u003cp\u003eLina sat in the hotel bathroom, sulking. Her hope had been to gain some attention during this tournament – to be noted. Her Discipline wasn’t overly strong yet, but she was a third rank ninth level Adept at twenty-four years old. The jump to fourth rank was very close as well. Among the denizens of the Dark Citadel, she showed the most promise. Most importantly, it was all natural. She hadn’t used any genetica potions or bionic installations to get where she was.\u003c/p\u003e\n\u003cp\u003eIt hadn’t only been Dracula watching her performance. With her tremendous talent, Satan was watching, too. He was, after all, on the look-out for a successor. He’d praised her on more than one occasion, and even gifted her several items to help with her cultivation.\u003c/p\u003e\n\u003cp\u003eBut who could have imagined! Only the second round, and she runs in to that hateful playboy. Her loss had been as bitter as it had been unexpected. That was not to say she didn’t know a fair amount about Chu Cheng and the contentious relationship his family had with Satan’s.\u003c/p\u003e\n\u003cp\u003eThe Lord of the Underworld and the Prince of Devils had always been at odds, regardless of who held the title. It was an interesting balance of power, where no one side could completely destroy the other. Both were Paragon-level Talents, perennial leaders of the world of darkness. So, their struggle continued through the generations.\u003c/p\u003e\n\u003cp\u003eEver since the interstellar migration of humanity, the darker side of the Adept world had been growing strained. Darkness simply wasn’t the prevalent force. This was not just shown by the presence of the Pontiff and his people, but the structures of government as well. If Satan ever had any plans to subjugate the West to his bidding, the path would be long and nearly impossible.\u003c/p\u003e\n\u003cp\u003eThe result effected certain groups more than others. Vampires, for instance, could only drink the blood of animals and not humans. This contention, however, was what the world of darkness believed was necessary to obtain strength. Even inheritors needed to prove themselves, and this was why neither Hades nor Satan would ever be wiped from memory. Satan’s plan was to strengthen his lead and expel his enemies, not obliterate them.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eBastard!”\u003c/em\u003e Lina raised her hand as though to hit something, but let her arm drop a moment later. Thinking about her loss was difficult, especially how it happened. The wretch had even dared to chain her down! When she’d been released, she couldn’t help but take that cheap shot. She had to restrain herself from trying to tear him limb from limb.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eDing-dong\u003c/em\u003e. The doorbell interrupted her angry internal discourse.\u003c/p\u003e\n\u003cp\u003e“Who is it!” She asked impatiently.\u003c/p\u003e\n\u003cp\u003e“Room service,” a voice from outside explained.\u003c/p\u003e\n\u003cp\u003eLina rose and, with a frown, pulled open the door to her room. “I didn’t order any room service.”\u003c/p\u003e\n\u003cp\u003eShe saw the man with the tray, but his face was covered by it. The tray’s contents were also concealed by the large metal cover.\u003c/p\u003e\n\u003cp\u003e“People are iron, and iron becomes steel. You can only do that if you eat – even when you lose. Otherwise it’ll start to affect your growth!” The man allowed the tray to drop, revealing his grinning face.\u003c/p\u003e\n\u003cp\u003eAt first, Lina didn’t know how to respond but then her anger swelled. It was the man from the tournament! He closed the gap between them, brandishing the tray. A blast of hot air struck her as the cover was removed.\u003c/p\u003e\n\u003cp\u003eAs an Adept of some power, her reaction time was good. She took a step back, almost instinctually, as the hot air caressed her face. It wasn’t until after her initial defensive reaction that she smelled the mouth-watering fragrance.\u003c/p\u003e\n\u003cp\u003eChu Cheng sauntered in to her room and closed the door with the tip of his foot.\u003c/p\u003e\n\u003cp\u003e“Get out of here! Who said you could come in?!” Lina was starting to get her senses back, but not before the guy had brazenly sauntered in to her room.\u003c/p\u003e\n\u003cp\u003eChu Cheng, with helpless expression, placed the tray down on a nearby end table. The contents were revealed to be a salad and a couple steaks.\u003c/p\u003e\n\u003cp\u003e“Two t-bone steaks, medium, with Angus steak sauce and a Caesar salad. Ah right, and this.” With a theatrical wave of his hand, Chu Cheng produced a bottle of champagne and two fluted glasses seemingly from nowhere. He set them up beside the tray.\u003c/p\u003e\n\u003cp\u003e“I know you’re upset because of your loss today. For me at least, good food is the best comfort. If it’s that important to you, I’ll report to the judges and surrender. You’ll be able to take my spot and continue up the ladder. What do you think?” Chu Cheng asked with a smile.\u003c/p\u003e\n\u003cp\u003e“Who needs your charity,” she spat. Her words didn’t match her emotions, though, as the anger she felt was slowly beginning to subside.\u003c/p\u003e\n\u003cp\u003eTh red-haired young man pulled out a chair for her to sit, in an old-world gentlemanly style. “You should eat, the food it starting to get cold. We can talk while we eat, alright? If at any point you don’t want to continue, I’ll get up and leave.”\u003c/p\u003e\n\u003cp\u003eThe savory scents of the steak had already filled the apartment. He was right – in her anger, Lina had forgotten lunch. It hadn’t bothered her before, but the food was here in front of her now and her stomach had begun to grumble in response.\u003c/p\u003e\n\u003cp\u003eWith a cold sniff, she plopped down on to the chair.\u003c/p\u003e\n\u003cp\u003eChu Cheng elegantly moved to the side of the table, where he effortlessly popped open the bottle of champagne. \u003cem\u003ePop!\u003c/em\u003e The cork flew free from the bottle, but instead of tearing through the air Chu Cheng caught it in his fist. Holding the bottle by its bottom, he filled the two glasses. The happy fizz of the alcohol dispelled some of the chilly atmosphere.\u003c/p\u003e\n\u003cp\u003e“I have a friend who tells me that champagne is the only drink appropriate for singers,” Chu Cheng began. “He says its filled with the sound of music. There’s something about it that immediately puts people in a better mood, and helps them forget their troubles.”\u003c/p\u003e\n\u003cp\u003eAs he spoke, Chu Cheng handed one of the slender glasses to Lina. He smiled disarmingly, and tapped the crystal glass to hers. \u003cem\u003eTing!\u003c/em\u003e Came the pleasant sound.\u003c/p\u003e\n\u003cp\u003eChu Cheng took a small sip, then put the glass back down on the table. He gathered up a napkin and silverware from the tray, then handed them to Lina before getting his own.\u003c/p\u003e\n\u003cp\u003e“It’s my pleasure to dine with such a beautiful woman, thank you.” He said.\u003c/p\u003e\n\u003cp\u003eLina replied by sipping her champagne, then tearing in to the steak without another word.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-401\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-403\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-402","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
