{"id":56627,"no":405,"title":"Chapter 403: How Could You Be So Shameless?","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 403: How Could You Be So Shameless?\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eChu Cheng served her as a gentleman might. Lina Lee continued to hold her hold.\u003c/p\u003e\n\u003cp\u003eSumptuous steaks were a treat for vampires. There was blood, but not a lot. Adepts in general had mighty appetites, and t-bone steaks were a fine remedy.\u003c/p\u003e\n\u003cp\u003eDue to the universal appeal of T-bone steaks, Chu Cheng did not sit idly by. He was never one to waste.\u003c/p\u003e\n\u003cp\u003eThe bottle of champagne quickly vanished between the two of them. Lina’s eyes had brightened, though Chu Cheng couldn’t tell if it was the alcohol or the food. Her pale face now had a healthy pink glow, making her stunning beauty even more apparent.\u003c/p\u003e\n\u003cp\u003e“Hey.” It was the first word she’d spoken since they started eating.\u003c/p\u003e\n\u003cp\u003e“Hm?” Chu Cheng gave her what he fancied was his most charming smile. He looked at her questioningly.\u003c/p\u003e\n\u003cp\u003eShe looked back at him with her head canted to the side, an odd expression on her face. “I want to ask you something.”\u003c/p\u003e\n\u003cp\u003e“Please,” he said, “I’m an open book.”\u003c/p\u003e\n\u003cp\u003eGenuine curiosity played on her pretty features as she leaned closer across the table. She fixed his eyes with her own. “I really want know… how you could be so shameless!”\u003c/p\u003e\n\u003cp\u003eThe young gentleman’s face froze, but for a tick at the corner of his mouth. “You’re, ehm, direct. I’m, uh… at a loss for words.”\u003c/p\u003e\n\u003cp\u003eShe frowned at him admonishingly. “Loss for words. You have fewer scruples than a thieving leper [1. In Chinese, having a ‘thick face’ means one is shameless (the idea being that you have ‘so much face’ that you can afford to lose it by doing shameless things). The original text reads “Guys like you have a face thicker than the Citadel’s walls.” It’s cute.]. Don’t be coy, I know your game.”\u003c/p\u003e\n\u003cp\u003eChu Cheng’s face relaxed in to a lopsided grin. He looked at her with a raised brow. “Fine – you’re right. I am shameless. But tell me, how much is pride worth per pound, hm? I have a good friend, Lan Jue. He said, ‘A man who does not feed his pride is invincible.’ This is true in pursuing women – you must be shameless. Either you succeed or you don’t, so to me there’s always a fifty-fifty shot. And for a woman as amazing as you, the chance to live that life is worth my pride. Tell you what, give me a chance. We’ll just chat, straight up. What do you think?”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue, having just broken through to the next rank, sneezed suddenly. [2. I mentioned it elsewhere, but the stigma is that if someone is talking about you behind your back, it makes you sneeze.] He furrowed his brow, and rubbed his nose.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLina’s gave him a flat stare. “Who knows how many women you’ve fed that line to. None of it is going to work on me. You playboys are slime, I can’t think of anyone I hate more. I could see you were trash from the moment I laid eyes on you. You’re a pig[3. She actually uses the word rascal - 无赖 – which uses my Chinese last name as part of it, heh.], now get out.”\u003c/p\u003e\n\u003cp\u003eAs she spoke, she got up and waved him toward the door like a fly.\u003c/p\u003e\n\u003cp\u003eChu Cheng looked to her clean plate, then to her frigid expression. With helpless expression he rose to his feet. Though his face bore a forlorn expression, he said nothing. He set about carefully piling the dirty dishes and napkins back on to the tray and even wiped the table down. He set the lid back on the tray, took it up, and finally walked to the door.\u003c/p\u003e\n\u003cp\u003eAs he passed her, Chu Cheng offered a slight nod. “I’m sorry to have disturbed you.” With that said, he walked around Lina and left without looking back.\u003c/p\u003e\n\u003cp\u003eA sudden and inexplicable chill raced through her as she watched him leave. \u003cem\u003eThis cheeky shit\u003c/em\u003e, she thought. Shouldn’t he be a sticky sleeze like all the others? Instead he left without any fuss. Almost as though he really didn’t have any ill-intent.\u003c/p\u003e\n\u003cp\u003eThose steaks \u003cem\u003ehad\u003c/em\u003e been delicious. And juicy. After she shut the door, Lina realized the anger that’d burned at her was gone.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe last two days of competitions was the most watched stream in all the Great Alliances. Each round, each match left an impression on the audience.\u003c/p\u003e\n\u003cp\u003eAfter the fights were finished, analysts looked over the fights and hand-picked which ones to rebroadcast. Several were already emerging as classics, with views in the millions almost right away. Surprisingly Lan Jue’s fight with the Barber was not the most viewed, but in fact was Chu Cheng’s.\u003c/p\u003e\n\u003cp\u003eIn terms of valuable content for Adepts, the Lan Jue’s fight was full of excellent footage. The common viewer, however, sought drama. A fight between a man and a woman never failed to draw eyes, especially when the woman looked like Lina. The drama of her hidden appearance, then Chu Cheng forcing her to reveal her gorgeous frame and figure – it was so perfectly watchable as to be almost scripted.\u003c/p\u003e\n\u003cp\u003eChu Cheng was also a draw, representing the North and the Great Conclave. As he’d been unfortunately reminded by his run-in with the robot earlier, there was no shortage of screens trained on him.\u003c/p\u003e\n\u003cp\u003eIt didn’t take long for the sweeping banners of their faces to be plastered all over the web. There were conversations about other fighters, pictures as well, and they rose and fell in popularity too. With so much to see, the adoration of the crowd was fickle and hard earned.\u003c/p\u003e\n\u003cp\u003eHowever, when the tournament organizers took this opportunity to have the crowd pick their favorite losers, Lina was one. The other was the Barber, who unfortunately fell second to the vampire heiress.\u003c/p\u003e\n\u003cp\u003eShe was a true femme fatale.\u003c/p\u003e\n\u003cp\u003eLina was stunned by the news. To lose so badly, but be voted back in by the people was completely outside of her expectations. It was a\u0026nbsp; very pleasant surprise. The loathing she felt for Chu Cheng eased – just a little bit.\u003c/p\u003e\n\u003cp\u003eThe competition entered its third day.\u003c/p\u003e\n\u003cp\u003eThe original three thousand plus competitors had since been whittled down to a little over eight hundred. Lan Jue found the waiting area considerably less stuffy.\u003c/p\u003e\n\u003cp\u003eMeanwhile, the tournament field was changing once again. One hundred arenas were reduced to fifty, and their breadth increased in kind. All the shields were reset to adjust for the changes.\u003c/p\u003e\n\u003cp\u003eLan Jue needed no time to recover or adjust afer breaking through to second rank since he’d done so already. He’d spent his night playing with Jun’er until she fell asleep, then returned to Qianlin and continued their cultivation.\u003c/p\u003e\n\u003cp\u003eA few snobbish Adepts wandered the waiting area loudly boasting, but most competitors concealed their excitement behind a calm face. Most were quite pleased with themselves having already earned fine rewards. For each round they climbed, things would only get more extravagant.\u003c/p\u003e\n\u003cp\u003eLan Jue stood by himself in a corner, silently hoping his luck would change before they drew opponents. His last two encounters were far more difficult than they should have been if one considered the odds. But even if he did run in to someone his own strength, he always had an ace up his sleeve.\u003c/p\u003e\n\u003cp\u003eLan Jue was no longer escaping attention either. So far, his fight with the Barber was the second most-watched recording in the net. Expert commenters were lauding it as very educational. Many already begun to suspect the masked man was the Divine Monarch – Zeus.\u003c/p\u003e\n\u003cp\u003eA great deal of Zeus’ fame was due to Thor. He was a famed pilot, but no one had ever seen him in contest as an Adept alone, without his storied mecha. It was for this reason his fight was second only to the crowd-pleasing Chu Cheng battle.\u003c/p\u003e\n\u003cp\u003eThere were others, of course, who had already captured the imaginations of the crowd, though they were not yet so flashy. Among them were powerful as a thunderbolt Pharmacist, the seemingly invincible Constantine, and the strikingly beautiful Sariel.\u003c/p\u003e\n\u003cp\u003eThe decision to restrict competitors to forty or below proved inspired. These young figured quickly became heroes in the eyes of the audience, and especially for the youth. It seemed evident the experience of these games would resonate in the lives of generations to come.\u003c/p\u003e\n\u003cp\u003eThe viewer numbers continued to climb as the tournament continued. So far, they still hadn’t reached the vaulted heights enjoyed by the Star Alliance and Divine Monarch fight, it was important to remember that these were still the preliminaries. When it came time for the finals, things would be drastically different.\u003c/p\u003e\n\u003cp\u003eLan Jue was told all about the Terminator and Jun’er. He found it quite funny. The enormous man, feared for his power, was a giant teddy bear to a little blind girl.\u003c/p\u003e\n\u003cp\u003eAnd calling him Uncle, like those two were anywhere \u003cem\u003enear\u003c/em\u003e the same generation? Hilarious!\u003c/p\u003e\n\u003cp\u003eHilarious, but only very quietly. Making his mirth known to the Terminator would be asking for a very complete and painful demise.\u003c/p\u003e\n\u003cp\u003e“Selection has begun.” Once more, the tournament system began assigning opponents. Eight hundred faces appeared in the sky over the arenas and began to arrange themselves in pairs.\u003c/p\u003e\n\u003cp\u003eSilent prayers filled the hearts of the Adepts. Now that they were coming closer to the semi-finals, they knew most of the weaker competitors had already been eliminated. Chances were the person they faced next would be a true challenge, nothing less than eighth rank.\u003c/p\u003e\n\u003cp\u003eLan Jue watched calmly from his corner. He didn’t \u003cem\u003ewant\u003c/em\u003e to face a powerhouse, but if he did than so be it. He didn’t mind much leaving the ranking lower than expected. He’d come mostly just to participate, hoping for no higher than the semi-finals. Already it was proving to have a very positive effect on his cultivation.\u003c/p\u003e\n\u003cp\u003eAs if to\u0026nbsp; spite him, Lan Jue saw his opponent. Now with so few competitors, the portraits above were much larger. Such strange luck he had, when things went well they went great, but when things went bad… well, you fought Lina.\u003c/p\u003e\n\u003cp\u003eHe couldn’t believe it. He’d watched the fight between Chu Cheng and Lina, and it was quite illuminating. Although Chu Cheng had won, he’d had to show some real muscle to do it. Lina was a third rank, but her dual Disciplines made her a double threat.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-402\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-404\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-403","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
