{"id":56677,"no":455,"title":"Chapter 453: The Bet","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u0026nbsp;\u0026nbsp;\u003cstrong\u003eChapter 453: The Bet\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eFive hundred million…. Not a small sum! Dollars and NED had a 2-1 exchange rate, meaning a dollar was two NED. Five hundred million was enough to buy the Great Conclave Arena. The bet these women were making was the max, because no one had ever spent that much before.\u003c/p\u003e\n\u003cp\u003e“Of course,” the worker said with a somewhat curt tone. He looked down at the odds on his screen, revealing Zeus at 6.3/1 and Qi Mu favored at 0.16/1. “Who are you placing your bet on?”\u003c/p\u003e\n\u003cp\u003eThe one on the left answered. “Put it all on Zeus.”\u003c/p\u003e\n\u003cp\u003eIt was bold. Although Qi Mu had ultimately lost to Titan, he’d shown his strength. No small number of people believed he could easily handle Zeus. Dozens of talking heads had provided their opinions on the masked Monarch’s fight against Bing Yu, where they claimed his victory was a result of exploiting opportunity. No one looked at the weakest competitor as a threat. Even though his Discipline was famed for its explosive force, there didn’t appear to be any path to victory against Qi Mu and his three transformations. In fact, Qi Mu’s odds would have been higher but for speculation he’d been injured in his fight against Titan.\u003c/p\u003e\n\u003cp\u003eThe worker swallowed, printed the ticket, and handed it to the women.\u003c/p\u003e\n\u003cp\u003eTheir bet altered the odds for Zeus, to 6.2/1. Despite the large bet, things remained mostly stable though. It was a testament to the faith the public put in Qi Mu.\u003c/p\u003e\n\u003cp\u003eThe women finished the transaction through their communicators, then left. Once they were out of ear-shot, the worker turned to a colleague. “Go upstairs and let them know.”\u003c/p\u003e\n\u003cp\u003eAnd that was it, five hundred million dollars on a long shot. It wasn’t rare at all for people to lay bets on the underdogs, but five hundred million dollars? That was unheard of.\u003c/p\u003e\n\u003cp\u003eLan Jue walked through the competitor’s entrance of the arena, breathing in the crisp morning air. It had a pleasant, soothing effect on his mood. He could feel the ebb and flow of energy through his meridians. He tightened his fists, excited for the battle to come. This was important for him, for he knew that to fight against such a strong opponent would undoubtedly teach him something.\u003c/p\u003e\n\u003cp\u003eFight, cultivate, understand. Rinse and repeat. The last few days had seen tremendous progress. He felt like a teenager again, when he had been considered a great future Talent. Then, as now, surpassing his brother had been his goal.\u003c/p\u003e\n\u003cp\u003eHis brother’s role in the military was very unfortunate. Lan Jue hoped he could have an opportunity to see him in the ring. His presence certainly would have made things more interesting. Even as his brother, Lan Jue didn’t know how much Lan Qing was capable of.\u003c/p\u003e\n\u003cp\u003eHe ruminated as his feet brought him to the waiting area. There were a few others competitors who had already arrived, though the Pharmacist was still absent. The Driver was seated a short distance away in his sofa, staring intently at something. Lan Jue followed his gaze to Cao Shuiqin embracing her guqin. Everyone knew that she used the guqin with her Discipline, but now why she held it so affectionately.\u003c/p\u003e\n\u003cp\u003eCao Shuiqin paid the Driver no mind, as though she didn’t notice his existence at all. However the flush in her cheeks screamed that she was anything but on an even keel.\u003c/p\u003e\n\u003cp\u003eLan Jue felt something odd, a strange sensation. Since when did this tournament become a dating reality show? Come to think of it, he hadn’t seen Chu Cheng in days. Who knows what he was up to with the vampire princess, or if they were talking at all. He figured they were – Chu Cheng was possessed of a very specific skillset that almost assured his success.\u003c/p\u003e\n\u003cp\u003eFrom what he could see, the Driver also had the bug. His compatriot certainly had an eye for beauty, he’d give him that. Cao Shuiqin, herself from the East, looked as gentle as water, and just as strong. It would be a fine victory for the Avenue if they managed to convince her to come over.\u003c/p\u003e\n\u003cp\u003eLan Jue chose not to bother the Driver, lost as he was in his appreciation. Instead, he chose a seat and shut his eyes for a little soul rejuvenation.\u003c/p\u003e\n\u003cp\u003eBut, just then, a nagging sensation made him pop his eyes open. A massive figure was trundling passed him.\u003c/p\u003e\n\u003cp\u003eTitan?\u003c/p\u003e\n\u003cp\u003eThe convert’s gait was heavy, thudding hard against the ground with every step. He made for the far side of the waiting area and sat. Lan Jue couldn’t tell why, but something told him that Titan’s Discipline was erratic. When he shut his eyes and regulated his breathing, though, the inkling dissipated.\u003c/p\u003e\n\u003cp\u003eThe common diagnosis for an Adept of his level suffering from unstable Discipline, was an injury. But could he be? There was no way! He’d watched yesterday’s fight, and Qi Mu hadn’t left any lasting damage. His own martial style was defense-focused as well, to an almost startling degree.\u003c/p\u003e\n\u003cp\u003eLan Jue’s eyes sparkled. Something wasn’t right.\u003c/p\u003e\n\u003cp\u003eThe remainder of the competitors trickled in as the morning stretched on.\u003c/p\u003e\n\u003cp\u003e“What are you looking at? He isn’t your opponent today.” The Pharmacist took a seat by Lan Jue’s side, greeting him with a smile.\u003c/p\u003e\n\u003cp\u003eLan Jue answered. “When he walked by me just now, something was different. His energies are chaotic.”\u003c/p\u003e\n\u003cp\u003e“Eh?” She, too, looked at the concert. At present he looked perfectly fine, calm as the surface of a lake.\u003c/p\u003e\n\u003cp\u003e“You should focus on today’s tribulations. You don’t have to worry about him until your next fight.” She offered.\u003c/p\u003e\n\u003cp\u003e“Yeah.” He nodded, for she was right. Every fight was going to be a struggle. At the levels they competed at, there were no easy pickings.\u003c/p\u003e\n\u003cp\u003eIt wasn’t long before the arena was a cacophonous press of milling humans. There were too many to count. However, they did seem fewer than when the tournament had begun. By now a lot of the competitors had shown the breadth of what they were capable of already. But where attendance in the arena might have dropped, viewership over the net was exploding. Countless watchers wanted to know what the deal was with the White Blademaster, and how he would perform in today’s battle. Jun Yongye would be facing Cao Shuiqin, while the Driver would be facing Jun Yongye’s defeated opponent Yan Ningya.\u003c/p\u003e\n\u003cp\u003eThe third group was undoubtedly top of everyone’s list of most interesting fights. After the battle between Qi Mu and Titan in the first fight, there was little else to capture people’s attention.\u003c/p\u003e\n\u003cp\u003eMo Xiao had since arrived, and had taken her place on the viewing platform beside the Terminator. She was ready to start the day’s ceremonies.\u003c/p\u003e\n\u003cp\u003e“Your Majesty.” She curtsied respectfully to the Paragon. He nodded back.\u003c/p\u003e\n\u003cp\u003e“What can you tell us about today’s events, sir? Which one are you most excited for?” She beamed a dazzling smile.\u003c/p\u003e\n\u003cp\u003eHe chuckled. “Group four.”\u003c/p\u003e\n\u003cp\u003e“Group Four?” She parroted, looking at the fight list in her hand. Then she understood. “Ah. Xuanyuan Shishi and Constantine.”\u003c/p\u003e\n\u003cp\u003eThe Paragon slowly nodded.\u003c/p\u003e\n\u003cp\u003eIndeed, today the stage was set for a clash of two goliaths. Constantine and his spear of Fate, against Xuanyuan Shishi’s Mistblades. Which would turn out to be more powerful? This was the question on everyone’s lips. Like the Paragon, many waited with baited breath for their encounter. Most bets were placed on Constantine, the peak-level Adept of the Pontiff’s Citadel. Along with Metatron, he had the greatest chance of eventually breaking through to Paragon.\u003c/p\u003e\n\u003cp\u003eMo Xiao went on. “There doesn’t look to be any surprises in store for our first group. Bing Yu will be facing off against Titan, and Qi Mu against Zeus. Titan’s chances for victory far outstrip his competitor, but what do you think about Zeus and Qi Mu?”\u003c/p\u003e\n\u003cp\u003eThe Paragon’s deep voice boomed back at her. “From what we’ve seen of Zeus’ Talent so far, it doesn’t look like he’s got much of a chance. His victory against Bing Yu may have been luck, but I don’t think we’ve seen everything he’s capable of. Bing Yu had lost because of a lack of understanding, her element being fundamentally weak to lightning. There is no more explosive Discipline than Lightning. In contrast to Bing Yu, Zeus has a very deep awareness of his powers. If he’s got any more tricks up his sleeve, he’ll need them for today’s fight.”\u003c/p\u003e\n\u003cp\u003e“You think he has a chance?” Mo Xiao asked, somewhat taken aback.\u003c/p\u003e\n\u003cp\u003eHis reply was tepid. “From all the information we have, Zeus should be a rank six or seven Adept. All we’ve seen in this tournament, though, is the work of a third rank at best. Why this is, I can’t say, but I can’t imagine it’s a simple answer.”\u003c/p\u003e\n\u003cp\u003eMo Xiao fell silent for a moment, then said, “I suppose we’ll see! Perhaps Zeus will prove as mythical as his namesake.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eChu Cheng lounged in a VIP box tucked away within the arena. He watched the bustle below while occasionally taking a sip of cognac or a bite of dried fruit.\u003c/p\u003e\n\u003cp\u003e“Well you certainly know how to enjoy yourself. Your friend is about to enter the ring with a monster, and you look cool as a cucumber. Aren’t you at all nervous?” Lina muttered darkly at his side. Hua Li was also seated nearby.\u003c/p\u003e\n\u003cp\u003eChu Cheng chuckled in response. “Why should I be worried? If he loses it makes me look better.”\u003c/p\u003e\n\u003cp\u003eHua Li grunted. “What makes you think he’s going to lose?”\u003c/p\u003e\n\u003cp\u003e“I never said he would!” Chu Cheng countered.\u003c/p\u003e\n\u003cp\u003e“I just hope he does.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-452\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-454\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-453","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
