{"id":56686,"no":464,"title":"Chapter 462: I Must Win!","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 462: I Must Win!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe two silver-clad women sat in a tidy room. They looked at the ten-digit number flashing on their communicators, then exchanged looks.\u003c/p\u003e\n\u003cp\u003e“Quite a lot of money!”\u003c/p\u003e\n\u003cp\u003e“Indeed!”\u003c/p\u003e\n\u003cp\u003e“Again tomorrow?”\u003c/p\u003e\n\u003cp\u003e“Of course. This was the boss’ task for us. What do you think the odds are for tomorrow’s fight?”\u003c/p\u003e\n\u003cp\u003e“Worse than today’s, I guess. His challenger is really strong.”\u003c/p\u003e\n\u003cp\u003e“It’s so easy to earn money in the North! That’s good, since we need money when we go back. Heheh… feels good.”\u003c/p\u003e\n\u003cp\u003e“But do you think he’ll win tomorrow?”\u003c/p\u003e\n\u003cp\u003e“Of course! He has to.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe streets around the Great Conclave Arena were packed tight, even in the early morning. The lines stretched for almost ten blocks. Scalpers prowled the area looking for people desperate enough to buy their criminally overpriced tickets. They were still able to catch a few nibbles, though. Ticket scalpers had been anxious since so few were buying. Electronic tickets were set with the buyer’s name and other info, making them hard to sell, but there were always loopholes.\u003c/p\u003e\n\u003cp\u003eThe waiting crowds chatted amongst themselves, raising the city’s decibel levels. “So which fight are you looking forward to today,” one asked. Another answered sighed.\u003c/p\u003e\n\u003cp\u003e“Man, I dunno. At least on the books it doesn’t look like there’s anything to get very excited about. But we’ll see! The fight between the Pharmacist and Jiang Yuan might be worth watching. You guys remember that skull Jiang Yuan summoned in the quarter-finals? Someone told me it’s some sort of \u003cem\u003elizard\u003c/em\u003e skull. Lizard my ass, that thing’s like a demon dragon. The Terminator called it something, malcontent or whatever. I dunno if he’ll use it in the next fight, but he’s facing the Pharmacist so I’m interested in taking a look.”\u003c/p\u003e\n\u003cp\u003e“All you have to do is take a look at the odds to know which one will be worth a watch, silly. The Pharmacist sits at zero point eight, and Jian Yuan is one point two – the closest spread today. That’ll definitely be the fight to watch.”\u003c/p\u003e\n\u003cp\u003e“The lightning Adept from Group One also has two wins. He beat Qi Mu. Do you think he has a chance against Titan?”\u003c/p\u003e\n\u003cp\u003e“Pfft, you’re dreaming. Were you asleep for Titan’s fight? You saw how strong he is. Whatever that sparkplug dude things he’s up to, he’s got nothing on Titan. One punch and the fight’s over, that’s my prediction.”\u003c/p\u003e\n\u003cp\u003e“Hah! Nailed it, one punch. I put five grand on Titan today, even though the odds were only point five. Pocket change for winnings, but still. The masked one is at point four, but who’s going to put any bets on him?”\u003c/p\u003e\n\u003cp\u003e“Oh don’t even start. I put money on Qi Mu yesterday and then he lost, damn near killed me. I put all the rest of my savings on Titan, so I’ll win it all back when he takes today’s victory.”\u003c/p\u003e\n\u003cp\u003e“Gambling has a dangerous habit of ruining families [1. Gambling in all forms is very illegal in China, but it’s a big part of the culture. Underground gambling establishment – at least in my town – were on almost every street]. Yall should be careful.”\u003c/p\u003e\n\u003cp\u003eThere was an electric buzz and the audience took their seats. Today the final four would be chosen. The revelers outside were indicative of the larger interest; most people were anxious for Group Two, where they would see the Pharmacist and Jiang Yuan go head-to-head.\u003c/p\u003e\n\u003cp\u003eIf Jiang Yuan beat the Pharmacist, and Titan beat Zeus, than the final four would contain two Easterners, a Northerner and a Westerner. The two Easterners already qualified, but they weren’t Avenue representatives. That would be a situation the Great Conclave could accept.\u003c/p\u003e\n\u003cp\u003eThe Terminator sat in a locker room, perched upon a bench that had been specifically designed to hold his girth. He sat across from Titan, whose face looked like burnished metal.\u003c/p\u003e\n\u003cp\u003e“Stable?” He asked.\u003c/p\u003e\n\u003cp\u003eTitan nodded. “More or less.”\u003c/p\u003e\n\u003cp\u003eThe Terminator’s voice was low and solemn. “You’ve chosen a very difficult road. But there is nothing impossible in the face of determination.”\u003c/p\u003e\n\u003cp\u003eTitan replied. “I have faith in my choice. I know it will make it much harder for me to break through, but my Path is all about faith. For that reason I \u003cem\u003ecannot\u003c/em\u003e lose, and I \u003cem\u003ewill\u003c/em\u003e win glory for the North. My understanding, my vision of my Path will become clearer with each fight. Please, master, don’t worry; I will improve. This is not a step backward.”\u003c/p\u003e\n\u003cp\u003eThe Terminator forced a smile. “Well said! But don’t underestimate your opponent – that was Qi Mu’s mistake. That Zeus… there’s a lot to him, he’s no simple Adept. I suspect he’s Jue Di’s disciple. His Discipline isn’t as simple as it looks, either. I haven’t seen him use Jue Di’s other trademark mastery, but handle him with care. Give it everything you’ve got.”\u003c/p\u003e\n\u003cp\u003e“Yes!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue was the last one to enter the waiting area. All of the other remaining competitors were already waiting in their respective sofas. Xuanyuan Shishi shot him a thumbs up and beamed a friendly smile of encouragement. Jong Yongye sat nearby, with his eyes closed. Meditating, he suspected.\u003c/p\u003e\n\u003cp\u003eThe Driver – who had lost his last two fights – sat with an inexplicable smirk on his face. He seemed to have forgotten that the White Blademaster would be his opponent today.\u003c/p\u003e\n\u003cp\u003e“Quite the atmosphere!” the Pharmacist beamed at Lan Jue.\u003c/p\u003e\n\u003cp\u003eHe chortled back. “Doesn’t matter what’s going on today, I’m not a high school student, I can control myself.”\u003c/p\u003e\n\u003cp\u003eShe smiled. “What? You don’t remember High school well?”\u003c/p\u003e\n\u003cp\u003eLan Jue shook his head. “How could I not? We only have our youth once. But if we did go back, I’d probably panic again.”\u003c/p\u003e\n\u003cp\u003eA strange expression flitted across the Pharmacist’s face, and she adopted a far-off look. “Yeah…. Going back would be nice…”\u003c/p\u003e\n\u003cp\u003eHe gave her an apologetic pat on the shoulder before sitting beside her.\u003c/p\u003e\n\u003cp\u003eHis eyes then turned to his future opponent. When he saw Titan’s face – that metallic, silver façade- he knew that his guesses yesterday were correct. The Terminator’s apprentice was different.\u003c/p\u003e\n\u003cp\u003eBut how?\u003c/p\u003e\n\u003cp\u003eAs he pondered, a sudden and all-pervasive aura poured from him. It was full of arrogance.\u003c/p\u003e\n\u003cp\u003eThe remaining players were all strong Adepts – they all felt it. Xuanyuan Shishi turned his eyes to Zeus, surprise in their depths. Jun Yongye snapped out of his meditative silence. The White Blademaster gave him a fixed and serious look as though he were thinking something. Titan answered by narrowing his eyes. The power around him thickened perceptibly. A host of eyes fell on Zeus. At least they had all been made aware that Zeus had no intention of losing quietly. He’ll be going in to that fight, ready to leave it all on the field.\u003c/p\u003e\n\u003cp\u003eThe VIP Booth\u003c/p\u003e\n\u003cp\u003e“Sis, am I looking at this right? Three hundred million dollars! I have never in my life spent that much money before,” one of the women in silver fleece said to her companion, seated beside her.\u003c/p\u003e\n\u003cp\u003e“Stimulating! It feels great. Think about it, his odds are around point four again, that means a profit of over a million dollars. The numbers are dropping after our bet, too. Once all bets have been placed we stand to make a killing.”\u003c/p\u003e\n\u003cp\u003e“He’ll win! He’s got to win!”\u003c/p\u003e\n\u003cp\u003eThe VIP platform.\u003c/p\u003e\n\u003cp\u003e“I’m sure you’ve come to anticipate my question, Your Majesty; which fight are you most interest in today?” Mo Xiao asked with a smile.\u003c/p\u003e\n\u003cp\u003eThe Terminator gave her an easy grin, and spoke softly. “There are two.”\u003c/p\u003e\n\u003cp\u003e“Two?” Group One and Two I assume?” She went on.\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003eMo Xiao said “Does this mean you aren’t confident in Titan’s chances to win his group?”\u003c/p\u003e\n\u003cp\u003eThe Paragon chuckled. “There are quite a number of twists and turns we’ve seen. I’m hoping for an entertaining match. We did not host this tournament to celebrate winning, or to demonize losing. Our greatest desire is that these brilliant up-and-comers have a chance to improve. By the end, they will leave better than when they came. We also intend for this to be a source of inspiration for young Adepts. We want them to be determined, and to grow strong. The stellar migration has been a boon for our species, and it continues to be the highest priority for us as denizens of the stars. If we wish to become the masters of universe, we’ll need power to do it.”\u003c/p\u003e\n\u003cp\u003eMo Xiao thoughtfully nodded her head as he spoke. She was surprised, the Paragon was particularly chatty today. Meanwhile, the Gourmet sat on the Paragon’s other side with a contemplative smile on his face. Jun’er looked up at him. “Uncle Gourmet? Why do you have such a mean smile?”\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eCough! Cough!\u003c/em\u003e The Gourmet’s face went rigid. He feigned a fit of coughing to keep her quiet.\u003c/p\u003e\n\u003cp\u003eThe Terminator spared them only a passing glance, with calm eyes, before turning back to the ring.\u003c/p\u003e\n\u003cp\u003e“There you have it ladies and gentlemen, I hope you were listening! Our first fight will be the one many will be watching; Titan versus Zeus! Whoever wins will emerge as Group One’s finalist. Will our first competitors please make their way to the field, and get ready for battle!”\u003c/p\u003e\n\u003cp\u003eTitan slowly rose to his feet. It was like watching a mountain uproot. The aura of his intent was so pervasive it made breathing difficult for those around him. He spared a moment to look briefly at Lan Jue, then walked to the ring.\u003c/p\u003e\n\u003cp\u003eLan Jue also stood and rearranged the mask on his face, fixing it in place. He took long and eager strides to the field.\u003c/p\u003e\n\u003cp\u003eAs far as Lan Jue was concerned, the most important fight of the tournament was about to get underway. He was about to compete against the closest thing to a manufactured Paragon that the North possessed – the Terminator’s disciple.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-461\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-463\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-462","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
