{"id":56269,"no":47,"title":"Chapter 47: Prometheus","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 47: Prometheus\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eEastern Alliance, Planet An Lun\u003c/p\u003e\n\u003cp\u003eRolling hills and stretching mountains surround a valley. Within the valley buzzes a world of metal; metal buildings, metal machinery, metal verti-cars. And massive metal mecha suits.\u003c/p\u003e\n\u003cp\u003eThe valley’s sky is torn by countless soaring peaks, the tallest among them lying to the west where it’s head was hidden by clouds.\u003c/p\u003e\n\u003cp\u003eTwo people stood upon the summit of that great mountain.\u003c/p\u003e\n\u003cp\u003eClouds and mist roiled like a floating sea, causing their figures to appear indistinct like spirits.\u003c/p\u003e\n\u003cp\u003eChu Cheng stood with his hands in his pockets. The flickering light of a cigarette flickered through the mists, a fiery red like his hair.\u003c/p\u003e\n\u003cp\u003e“So I guess you didn’t just call me here to shoot the breeze with you, boss.” Chu Cheng’s lazy drawl hung heavy in the surrounding clouds. He was always like this, no matter the situation, like he’d just woken up.\u003c/p\u003e\n\u003cp\u003eA man stood a few paces from him, dressed in black military fatigues. He was tall, stocky, with wide shoulders and a straight back. However it did not approach the level of excessive – he wasn’t overly robust, but instead was like a javelin.\u003c/p\u003e\n\u003cp\u003eA golden star had been affixed to the epaulet of his uniform.\u003c/p\u003e\n\u003cp\u003eA general! This raven-haired man, certainly no older than thirty, was in fact a general.\u003c/p\u003e\n\u003cp\u003eAs the era of science and technology progressed, it took a special level of talent and military ability to rise above the rabble.\u003c/p\u003e\n\u003cp\u003eBy the estimation of most military organizations, a man at thirty was only beginning to work his way up the totem pole and nothing more. The average general in the Eastern Alliance was fifty-one. With the average life expectancy at one hundred and twenty, a thirty year-old general was unheard of.\u003c/p\u003e\n\u003cp\u003e“How is he,” the man asked, turning to face Chu Cheng.\u003c/p\u003e\n\u003cp\u003eHis eyes were a viridescent green, and when paired with his black hair gave him a wicked appearance. However at present, their firm expression pushed the sinister light away. His face was stoic, weathered, as though it were chiseled by a knife. An almost imperceptible, oppressive power exuded from him like some indestructible blade.\u003c/p\u003e\n\u003cp\u003e“Not so good.” Chu Cheng lazily rubbed his nose, struggling for a response in the face of the man’s piercing presence.\u003c/p\u003e\n\u003cp\u003eThe raven-haired man’s eyes softened somewhat. “Three years, and he still hasn’t come out?”\u003c/p\u003e\n\u003cp\u003eChu Cheng’s voice was thin as he responded. “You know his temperament. If it were so easy to get him out why would we be worrying about him. Boss, if you have the time the best thing is to go see him yourself. You guys have your misunderstandings, but you’ve always been the most convincing. Not to mention you’re his older brother by blood.”*\u003c/p\u003e\n\u003cp\u003eThe man’s eyes once more grew cold and hard. “He isn’t wrong to blame me. It was my miscalculation that lead to Hera’s fall.”\u003c/p\u003e\n\u003cp\u003eChu Cheng’s brows creased. “Boss, we all know what happened. You don’t need to pile all the blame on your shoulders. Look, in three years he hasn’t returned home but you? Three years in this camp, drilling your soldiers like a machine.”\u003c/p\u003e\n\u003cp\u003e“I called you here,” the general growled, “not so you can tell me how to live my life. His decadence, your lack of progress – you both have your own messes to clean up.”\u003c/p\u003e\n\u003cp\u003eChu Cheng gulped, and subconsciously retreated a step. “You’re mad at A-Jue boss, don’t take it out on me!”\u003c/p\u003e\n\u003cp\u003e“This isn’t me angry,” the man responded faintly. “My own abilities need honing, and luckily here you are. Show me how you’ve progressed these last few years.”\u003c/p\u003e\n\u003cp\u003eAs he spoke his long legs took him forward, and in that instant his green eyes shone with a dazzling light. The clouds around him dispersed, replaced with a towering column of blueish-green.\u003c/p\u003e\n\u003cp\u003e“Boss, you’re serious?” Chu Cheng quailed, his standard indolent expression melting away. A blazing flame burst from his back. It began as a pure red, but in the face of that opulant teal pillar before him it became orange, then crimson, ultimately settling on an undulating maroon. The heart of the fires burned black.\u003c/p\u003e\n\u003cp\u003eThe raven-haired man said nothing further. He lifted his hand, and the column of light melted in to his arm, blooming like a lotus flower to create a blazing spear of light that engulfed Chu Cheng.\u003c/p\u003e\n\u003cp\u003eIn the valley, the bustling personnel paused to look when the peak of the western mountain was consumed in light.\u003c/p\u003e\n\u003cp\u003eIn the space of a moment the entire horizon was tinted teal, and within it flickered a persistent maroon. The two coronas of colored energies clashed, and their fluctuating exchanges caused the clouds over the valley to flee.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHalf an hour later…\u003c/p\u003e\n\u003cp\u003e“Boss, you’re downright inhuman!” Chu Cheng pressed a hand to his red, swollen face and sat on the ground with a sigh. His clothes were nearly in tatters.\u003c/p\u003e\n\u003cp\u003eParts of the raven-haired man’s clothes were burned and blackened, though he remained as straight and dignified as before they’d fought.\u003c/p\u003e\n\u003cp\u003e“There was no will to fight. I derived no pleasure from beating you,” the man responded flatly.\u003c/p\u003e\n\u003cp\u003eChu Cheng’s face grew dark. “You beat me then start talking down to me? How can anyone say you brothers are decent people? You’re bloodthirsty, and A-Jue’s a wolf in sheep’s clothing, wicked smart to boot. I’m outta here! And I’m damn sure not coming back. If you feel bad, go take it out on your little brother.”\u003c/p\u003e\n\u003cp\u003e“I’ll go find him,” the man responded.\u003c/p\u003e\n\u003cp\u003eChu Chung stood to leave, but stopped in surprise at the revelation. “You’re really going to find him…”\u003c/p\u003e\n\u003cp\u003eThe raven-haired man only nodded his head.\u003c/p\u003e\n\u003cp\u003e“But I heard you’re on the cusp of a promotion,” Chu Cheng said. “Can you even leave right now?”\u003c/p\u003e\n\u003cp\u003e“What’s in a title.” The man’s cold eyes fixed on Chu Cheng.\u003c/p\u003e\n\u003cp\u003eChu Cheng stuck out his thumb. “Good. You deserved to be called Prometheus.”\u003c/p\u003e\n\u003cp\u003eFaintly the man responded. “Out here, call me Lan Qing. I’m only Prometheus in the field.”\u003c/p\u003e\n\u003cp\u003ePrometheus, the god of wisdom!\u003c/p\u003e\n\u003cp\u003e“I’m off. I’m looking forward to hear about when you beat on A-Jue. If ya like let me know when, and I’ll go check out the festivities.”\u003c/p\u003e\n\u003cp\u003eLan Qing waved, and turned back towards the valley.\u003c/p\u003e\n\u003cp\u003eWith the clouds gone the valley looked crisp and clear. The world of metal reflected sunlight off of every surface, their sharp rays absorbing his figure.\u003c/p\u003e\n\u003cp\u003eChu Cheng stood quietly as them an left, and with a smile on his face flicked a middle finger at his back. He began to hobble his way down the mountain, but stopped after a few steps. A beam of red light shot down from the heavens, with a monstrous black figure standing in it’s center. A sanguine light glowed from it.\u003c/p\u003e\n\u003cp\u003eAmong his four brothers, Chu Cheng also had a nickname…\u003c/p\u003e\n\u003cp\u003eHades, Lord of the Underworld.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e*This seems a little clunky, but the distinction has to be made because the use of terms like ‘brother’ and ‘sister’ in China aren’t exclusively reserved for immediate family. These terms can also refer to cousins, good friends, etc.\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-46\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-48\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-47","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
