{"id":56698,"no":476,"title":"Chapter 474: I","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 474: I…\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe knelt beside her on one knee, with bright eyes that watched her closely. At some point – she didn’t know when – he’d produced a sweet-smelling rose. He held it out to her.\u003c/p\u003e\n\u003cp\u003e“Qianlin, I’m sorry. I’m not sure if this is too late, or too early… maybe you can’t accept or it’s one sided. But I wanted to show you how sincere I am.”\u003c/p\u003e\n\u003cp\u003e“Ever since the day I met you, my heart’s been all knotted up. At first I couldn’t help but replace your identity with hers. Her shadow was a large one that covered everything in my life. For a long time I wasn’t even sure you weren’t her. I told myself it wasn’t right, and that it wasn’t fair to you. Just because you look alike doesn’t mean you’re some sort of substitute. In my guilt and shame, I kept you at a distance. I had to keep telling myself you weren’t her, you weren’t her.”\u003c/p\u003e\n\u003cp\u003e“However, somethings are out of our control. When you showed up my dead heart started beating again. I see your gentleness, your strength, and I see how well you treat me. Your sister’s image will always have a place in my soul, but you are just as deep.”\u003c/p\u003e\n\u003cp\u003e“I resisted for a long time because I thought it was a betrayal. It was a betrayal of her love, and so for a long time I couldn’t reconcile that within me. But life has to be about looking forward. Although, that’s much easier said than done. I told myself before that Hera would be the only woman I would ever love – but life had different plans.”\u003c/p\u003e\n\u003cp\u003e“At a point even I don’t know when, I fell in love with Zhou Qianlin. Not a Substitute for the love I lost, but something new. You are Zhou Qianlin, not Hera. My heart knows it now.”\u003c/p\u003e\n\u003cp\u003e“Hera had to go… and now I’m moving forward. My love for her will never subside, but I have more love to give. I know I’ve hurt you many, many times, and I can’t ask you to put that all aside and accept me. But maybe, you’ll give me a chance, I hope you will. I hope that I’ll find a way to tell you, starting right now, you are the Zhou Qianlin in my heart. The girl I like… the girl I love.”\u003c/p\u003e\n\u003cp\u003e“I know it’s… not phrased the best, maybe. I don’t know what I can say to really get my point across, but I promise that I’ll never hurt you again. I will devote all of my care and attention on to you.”\u003c/p\u003e\n\u003cp\u003e“I was unwilling at first to be your bodyguard at the university. I was afraid I was giving up my freedom. Now, though, I realize that this was a gift of a new start, from you. With your approval, I’d like to extend our contract indefinitely. I will stand at your side watching over you, protecting you, and loving you.”\u003c/p\u003e\n\u003cp\u003eHe lifted the flower up to Zhou Qianlin, his face full of sincerity. She looked back at him too stunned to speak. Tears had begun to stream down her cheeks long ago. Her whole body shook.\u003c/p\u003e\n\u003cp\u003eThen, she shoved the rose away. Her head snapped to the side as though she couldn’t look at him. “No! I can’t, at least not now.”\u003c/p\u003e\n\u003cp\u003eLan Jue was completely taken by surprise. He thought she might not accept right away, but outright rejection was not what he’d anticipated.\u003c/p\u003e\n\u003cp\u003e“Don’t cry, Qianlin. Don’t cry. Its fine – I can wait.” Lan Jue stood and enveloped her in a hug.\u003c/p\u003e\n\u003cp\u003eShe shook against his chest. Her voice was low and broke from the tears. “I’m sorry, A-Jue. I’m sorry I can’t answer… and right now I can’t tell you why. When this tournament is done and we go back to Skyfire, I’ll show you something. If afterwards you still want to be together we can talk about it again. Ok?”\u003c/p\u003e\n\u003cp\u003eWith that said, she jump to her feet and fled the bar. Lan Jue was left standing there, flower in hand, feeling desolate. He returned to his seat and quietly finished first his glass, and then Qianlin’s. The taste was sweet as ever, but it couldn’t soothe the bitterness he felt [1. A potentially important note; while bitterness in English implies he blames Qianlin (and is the precise word he uses), no such implication is in the original text. It’s safe to assume he is not angry with Qianlin.]. He replaced the cork. At least right now, he wouldn’t be enjoying this bottle.\u003c/p\u003e\n\u003cp\u003eOutside the bustling streets of Luo City were a circus of sights and sounds, but all he felt was loneliness. When he eventually returned to his room, he entered to find it plunged in to darkness. Qianlin lay on the bed, seemingly already asleep.\u003c/p\u003e\n\u003cp\u003eHe didn’t trouble her, and absconded to the couch. It was then he felt it, the pang of those old wounds. It’d been a long time since he felt it, but it was as clear as sharp as ever.\u003c/p\u003e\n\u003cp\u003eThey didn’t spend any time in cultivation. The whole day had gone by without any work. Early morning the next day, the first thing Lan Jue did after stirring was look toward the bed. He saw Qianlin there, clad in her nightgown, looking outside. He then noticed the blanket that was covering him.\u003c/p\u003e\n\u003cp\u003eHe took a deep breath to try and calm himself, then wrapped the covers around him and stood. Qianlin, hearing him stir behind her, turned around and greeted him with a smile. She looked mostly recovered. “You’re up. I’ve ordered us breakfast, it should be here soon.”\u003c/p\u003e\n\u003cp\u003e“Alright,” he replied. “I’ll go take a shower, then.”\u003c/p\u003e\n\u003cp\u003e“Alrighty!” She shot him a dazzling smile, bright and wide.\u003c/p\u003e\n\u003cp\u003eLan Jue shuffled toward the bathroom. He suddenly felt the need to escape her smiling face.\u003c/p\u003e\n\u003cp\u003eQianlin watched him go, and once his back was turned a pained look flitted passed her eyes. She nibbled her lower lip. \u003ci\u003eCould you understand that my own heartache is so much worse than yours? But I can’t tell you. It would affect you too much, affect the tournament. Wait for us to get back, and then I’ll tell you everything. I don’t want anything to stand between the two of us… and I don’t want you to feel regret, later.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eOn the outside, everything seemed perfectly normal. The two of them had a pleasant breakfast, then continued with their cultivation. Although, Qianlin could feel that Lan Jue’s kiss was far more ‘polite.’\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe finals were about to begin, and the streets were a mess of people trying to make their way. Every broadcast station from here to the shattered starfields was covering the games.\u003c/p\u003e\n\u003cp\u003eLan Jue hadn’t seen the Pharmacist all day. When he saw Jun’er, she was with the Gourmet. He guessed she’d delivered the child to the Gourmet early, so as not to interrupt his cultivation.\u003c/p\u003e\n\u003cp\u003eNow it was time for the games to continue.\u003c/p\u003e\n\u003cp\u003eThe finals would be determined by lots, to see which fighters would compete against who. When Lan Jue got to the waiting area, it felt almost deserted. But wasn’t it? There were only four left, where once there had been thousands.\u003c/p\u003e\n\u003cp\u003eThe Pharmacist, Jun Yongye, and Xuanyuan Shishi had all already arrived. When his Avenue compatriot saw him, she greeted him with a smile and a nod. Jun Yongye and Shishi offered a respectful greeting as well.\u003c/p\u003e\n\u003cp\u003eLan Jue offered a nod of his own, then sat. It was time to focus, but not for glory. He was eager to see what more he could learn.\u003c/p\u003e\n\u003cp\u003eReally, this chance was one in a million. He’d already done what he could to push the troubles between him and Qianlin to the back of his mind. After all, he wasn’t the same Lan Jue as before. He’d grown and matured considerably. Love was an eternal consideration, but it wasn’t everything.\u003c/p\u003e\n\u003cp\u003eHe smiled to the Pharmacist. “If we happen to get paired up, then you have to promise not to go easy on me. Give it all you’ve got. I’m anxious to feel the destructive force of the fairy.”\u003c/p\u003e\n\u003cp\u003eShe smiled back. “Let’s hope it doesn’t come to that.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “I guess that’s up to lady luck. Best would be me against you for the championship. If that happens I’ll forfeit. We can always test ourselves back in the Reaper’s Arena.”\u003c/p\u003e\n\u003cp\u003eThe Pharmacist looked at him seriously for a moment, but said nothing.\u003c/p\u003e\n\u003cp\u003eMeanwhile, things on the VIP platform were proceeding as they had been, without any visible deviation but for one. The Terminator sat in the center of the platform, calm and impassive as a mountain. What was new was the person beside him.\u003c/p\u003e\n\u003cp\u003eShe wore a snow-white veil, with a gown that matched. From what one could see, she looked to be in her thirties. But here in the North, there was only one other person who deserved the same respect as the Terminator. The Epochrion!\u003c/p\u003e\n\u003cp\u003eShe had settled herself between the Terminator and the Gourmet. She was still and silent, simply watching the scene around her.\u003c/p\u003e\n\u003cp\u003eOn the Terminator’s other side was, as ever, Mo Xiao. She was still in charge of announcing the rest of the games.\u003c/p\u003e\n\u003cp\u003e“Ladies and gentlemen, hello and welcome. I am Mo Xiao.” As the time came for the game to commence, her voice rose like a crystal chime through the arena.\u003c/p\u003e\n\u003cp\u003e“I hope you’re all looking forward to the semi-finals! Finally, we have fought past the gauntlet and have emerged with four remaining fighters. Whatever their performance, each of them will be leaving with wonderful prizes to show for their effort. However, there can only be one champion, and all the riches they will earn.\u003c/p\u003e\n\u003cp\u003e“Let me introduce you to our potential champions. From Group One; Zeus, the God of Lightning! Emerging from Group Two, the Pharmacist, also known as the Sword-Spirit Fairy. Group Three has produced the White Blademaster Jun Yongye. And last but not least, from Group Four, the Ten Thousand Swords as one – Xuanyuan Shishi!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-473\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-475\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-474","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
