{"id":56706,"no":484,"title":"Chapter 482: A Heroic Tale","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 482: A Heroic Tale\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“The secret to the blue mechas success wasn’t equipment, and it wasn’t skill. The power he had that day was from an entire bottle of Fantascia Genetica the pilot drank before the fight.”\u003c/p\u003e\n\u003cp\u003e“Some of you might not know what Fantascia Genetica is. I’ll tell you. It is the greatest DNA-altering substance the West has produced. Taking any amount will help one’s Discipline. The most important question is; can one handle the strength of the medicine? The single exception to this are ninth-level Adepts. Popular knowledge holds that a ninth-level who takes a bottle of Genetica will outright explode. His powers would be too strong for him or her to control.”\u003c/p\u003e\n\u003cp\u003e“The pilot of this majestic war machine is indeed a ninth-level Adept. He knew the risks, and yet he drank that decoction, so that he could save more lives. He burned away his body for his people, burned away his life until only the faintest spark was left. If the Cosmagus hadn’t had arrived just then, that hero would be lost to us. We would never have the opportunity to know them. But now you do!”\u003c/p\u003e\n\u003cp\u003ePoseidon stopped, grabbed Lan Jue’s left hand, and thrust it into the air!\u003c/p\u003e\n\u003cp\u003e“A-Jue, let the people learn who Zeus really is.” Poseidon’s eyes were alive with excitement, burning with it. His fervor had infected the crowd who shouted down at them.\u003c/p\u003e\n\u003cp\u003eLan Jue returned his look with a serious one of his own. His brother wasn’t doing this to turn him into a hero.\u003c/p\u003e\n\u003cp\u003eChu Cheng had used his own methods to alert Lan Jue of the potential dangers surrounding him. Hua Li was giving him another tool to protect him. None of this was part of the earlier rehearsals. The only purpose was to protect his friend.\u003c/p\u003e\n\u003cp\u003eLan Jue heaved a deep sigh. Silent as a statue, he simply extended his pinky finger. Thor’s promise glimmered in the floodlights. A flash, and a towering figure appeared before Lan Jue and Hua Li.\u003c/p\u003e\n\u003cp\u003eThor! It was, Thor!\u003c/p\u003e\n\u003cp\u003eThe mecha slowly descended from the sky, encased in blue light. The sleek, metallic surface cast of blinding rays of refracted light. The air around it writhed with images of the battle on Taihua.\u003c/p\u003e\n\u003cp\u003eThor, Zeus, Thunderbolt Discipline… it all added up. Now they understood. That mysterious hero, who had saved so many lives, was Zeus. That Sapphire guardian angel had been Thor. And although this Thor wasn’t exactly like the Thor in DreamNet, it was close enough for the audience to connect the dots. There was a single word bouncing through the collective consciousness; heroic!\u003c/p\u003e\n\u003cp\u003eThis was the hero of Taihua, before their eyes. Short though the crowd\u0027s memory was, several still remembered Zeus’ rise. He was an Easterner, an outsider, who had belittled a woman on interstellar television. They couldn’t understand why a woman like the Pharmacist would consent to be seen with him.\u003c/p\u003e\n\u003cp\u003eNow they knew. Or so they thought.\u003c/p\u003e\n\u003cp\u003eShock wasn’t reserved for the audience alone. Many of the tournament competitors were just as stunned by the revelation. They were Adepts, they all understood the risks of a ninth level using the Fantascia Genetica. Yet, somehow, this man had done it and survived. Now he was the tournament Champion – hero and victor! Despite all that had come before, that was how the crowd saw him now.\u003c/p\u003e\n\u003cp\u003eHis Eastern Alliance companions were no less impressed. With the Gourmet first among them, the Avenue delegation looked upon him with profound respect. Jun’er was the only one not struck dumb by the news. “That’s my daddy!” She cried, never looking away from him. “That’s my daddy!”\u003c/p\u003e\n\u003cp\u003eThe Pharmacist’s eyes welled with tears to hear her little girl’s happy cries. Her face revealed appreciation. His efforts gave Jun’er the complete childhood she so desperately needed.\u003c/p\u003e\n\u003cp\u003eJun Yongye stood a few meters behind the tournament champion. His face was a mask of shifting emotion.\u003c/p\u003e\n\u003cp\u003e“Can we give our hero some cheers and applause?!” Hua LI’s excited voice cried out to the masses. Their response was thunderous. It sounded like a bomb went off in the stands, shaking its foundation.\u003c/p\u003e\n\u003cp\u003eNo… not just the Great Adept Arena. This was being streamed to every household on every planet throughout human civilization. What they were hearing now was echoed on Luo, Lyr, Skyfire, and everywhere else humans inhabited. In the East, spectators stoically faced the projection of their hero, and bowed.\u003c/p\u003e\n\u003cp\u003eLan Jue wasn’t prepared for this. A strange sensation washed over him just like the adoration of the audience. He couldn’t describe it, but there were words for it. If he had been born a believer of the Pontiff, someone would have told him it was the power of faith.\u003c/p\u003e\n\u003cp\u003eHe could feel, much to his surprise, that his already solid Discipline had been refined even further. The progress was much faster than anticipated. He’d never experienced anything like it before. Somewhere in there was also the arrow of compassion, shining its pale light on his soul.\u003c/p\u003e\n\u003cp\u003eImprovement. Every day, improvement. Lan Jue was a product of the environment, tempered by it.\u003c/p\u003e\n\u003cp\u003eHe was joined with Qianlin, so he couldn’t feel if his own Discipline had risen in rank. All he knew was that everything he’d experienced since coming to the tournament had coalesced to help him get better. In addition, he could sense similar improvements in Qianlin’s abilities.\u003c/p\u003e\n\u003cp\u003eThe cheers rang for over ten minutes before petering out. “Say something… to me, to all of humanity.”\u003c/p\u003e\n\u003cp\u003eLan Jue looked at him in silence for a moment. Then, slow and deliberate, he swung his arms open and enveloped his brother in a hug.\u003c/p\u003e\n\u003cp\u003ePoseidon smiled and hugged him back.\u003c/p\u003e\n\u003cp\u003eWhen they separated, Lan Jue gave them both a distance of a few meters. Thor then reached down, whereupon Lan Jue’s stepped up onto the mechanical hand before being lifting up into the air. Thor’s hand hovered at heart length, and Lan Jue stood easily in the palm.\u003c/p\u003e\n\u003cp\u003e“Thank you everyone, for your cheers and applause. I really never expected I would be here. On that day, on Taihua… everything happened so fast. I am a teacher, and went with my coworkers on a retreat. Disaster struck, suddenly and without warning. When fleeing to the camp, our group came across a soldier running out to meet the monsters.\u003c/p\u003e\n\u003cp\u003e“They fought with every fiber of their being, sacrificing everything they had to protect these innocent tourists. I caught the soldier before he left and told him that only a mecha would be able to beat these things. He was throwing his life away. What he said stuck with me; he said that it was his duty, the duty of his brothers, to protect the people. There were still scared, hurt tourists out there. We have to protect them.\u003c/p\u003e\n\u003cp\u003e“After that he left, no hesitation or fear. I have a decent memory, and I can still recall his ID. When the dust settled I looked him up. He gave up his life so that others might live. If we want to survive as a species, then we need to be like that soldier. Not just a few of us – all of us. We will colonize the stars, but only if we adopt that spirit. Really, there are countless heroes every day. You call me a hero, but I can’t be considered among them.\u003c/p\u003e\n\u003cp\u003e“Taihua was no accident. The creatures that devastated that planet are coming. We must band together, and contribute what we can to the strength of humanity. All I am doing is the best that I can, the same that anyone else would. This is my responsibility, as a part of humanity.”\u003c/p\u003e\n\u003cp\u003eHe finished his short speech with a bow. The hero of Taihua dropped from between Thor’s fingers as the mecha became light and disappeared into Thor’s Promise.\u003c/p\u003e\n\u003cp\u003eThe effect, if not the sound of Lan Jue’s speech persisted in the air. It rang in the listeners’ chests, igniting their spirits.\u003c/p\u003e\n\u003cp\u003eThe floodlights illuminating the ring darkened, like a planet eclipsing the sun. It was the Terminator, whose mountainous figure was suspended in the air. The lights flicked away from the ring and converged on the Paragon. He looked at the cameras with solemn expression.\u003c/p\u003e\n\u003cp\u003e“Yes, citizens, they speak the truth. Humanity needs more heroes. The reason behind this tournament was just this, to find champions for the human race. Our rewards were to attract the best.\u003c/p\u003e\n\u003cp\u003e“Unfortunately, events have reached the point where they need to be discussed. Tonight we will. Ladies and gentlemen, please turn your attention to the screens.”\u003c/p\u003e\n\u003cp\u003eWith that the Terminator vanished. A three-dimensional holographic image took up the arena’s interior. When it first appeared it looked like an image of the night sky, a blanket of twinkling stars. A lumbering space ship heaved into view, though from this perspective it looked like a toy.\u003c/p\u003e\n\u003cp\u003eMilitary enthusiasts recognized it right away. It was a Monarch-Class Mothership, followed by its strike group. There were four battleships, twelve expedition cruisers, and other a hundred other support ships. The whole fleet slowly wandered through space.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-481\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-483\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-482","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
