{"id":56272,"no":50,"title":"Chapter 50: Nooblet vs. The Ace","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u0026nbsp;\u003cstrong\u003eChapter 50: Nooblet vs. The Ace\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe Gunner jumped, startled, and hurriedly moved to dodge the shield attack.\u003c/p\u003e\n\u003cp\u003eHis control was significantly better than Jin Tao’s, which allowed the shield to skim harmlessly past his legs. Still, the screen went black.\u003c/p\u003e\n\u003cp\u003e“Defeat. Mecha damage has exceeded thirty percent. Please repair your suit, and continue.”\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHow’d that happen?! \u003c/em\u003e The Lancer’s pilot reacted in much the same way Jin Tao had, and pounded the replay button.\u003c/p\u003e\n\u003cp\u003eNooblet hadn’t just thrown the shield, but in the next moment had thrown his sword as well. The attack had caused the Gunner to reel away, and he’d essentially impaled himself as the undefended cockpit was pierced by the titanium allow blade.\u003c/p\u003e\n\u003cp\u003e“Which one of us is long distance anyway?!” The Gunner-Mecha’s operator roared.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eHehehe!\u003c/em\u003e Lan Jue cackled wickedly and hit the button for his third fight. \u003cem\u003eRocking newbies really did make you feel good! And no one even knows who I am! \u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eAnother flash. Another fight. Another Saber-Mecha.\u003c/p\u003e\n\u003cp\u003eMuch like Jin Tao the Saber-Mecha raced forward to attack Lan Jue’s Nooblet. As he did, Lan Jue saw clearly the name floating above it’s head: The Ace.\u003c/p\u003e\n\u003cp\u003eWhat ironic parallelism!\u003c/p\u003e\n\u003cp\u003eThe Ace flew forward, titanium allow sword in it’s right hand, and again like Jin Tao attempting to strike at the neck.\u003c/p\u003e\n\u003cp\u003eNooblet waited until the last moment, lifted his right foot, and tried to surreptitiously pin his opponent.\u003c/p\u003e\n\u003cp\u003eBut it was Lan Jue’s turn to be surprised, for either by coincidence or from true skill his enemy lifted his leg the instant before his foot found it’s mark. The action caused Nooblet to ram his abdomen right against the rising knee, while the sweeping sword overhead buried itself in his shoulder with a staggering blow.\u003c/p\u003e\n\u003cp\u003eThe two were locked together, a hair’s breadth apart, affording no room to maneuver.\u003c/p\u003e\n\u003cp\u003eNooblet turned his wrist to point the tip of his blade upward and thrust at the Ace’s exposed arm. In the same moment he slammed his shield against his adversary’s side.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eDing ! peng!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eThe two sounds rang out almost concurrently. The Ace drew it’s arm back and the crossguards of the two swords clashed. The second muffled sound was Nooblet’s shield striking against the enemy’s knee.\u003c/p\u003e\n\u003cp\u003eThe strike came at an angle and caused the Ace’s suit to tilt. When you and your rival’s equipment were the same, victory came down to control.\u003c/p\u003e\n\u003cp\u003eThe Ace made no effort to stabilize itself, instead spinning around and out of reach. It’s steps were irregular and erratic , causing the body to twist.\u003c/p\u003e\n\u003cp\u003eBut instead of toppling, it was clear the body was compensating intentionally with the steps.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eDisordered Stepping?\u003c/em\u003e Lan Jue looked on in surprise. It was a pretty standard close combat move for intermediates, used to avoid both close combat attacks and ranged artillery.\u003c/p\u003e\n\u003cp\u003eThis was a technique an unfitted cadet could pull off?\u003c/p\u003e\n\u003cp\u003eThis guy was full of surprises, and it certainly piqued Lan Jue’s interest. He changed up his own footwork, matching the disordered stepping of his opponent and swerving in to his path.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eTang Mi’s pretty face was a hard mask.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhat the hell was this? It wasn’t easy finding a way to re-register a new account, specific to prevent this sort of newb abuse. And who could have known a landmine would find a landmine? This Saber-Mech’s shield strike had expertly offset her rhythm. How long had it been since she’s seen something like this?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eAnd this guy still dares rush me, you really think I’m that much of a push-over?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eSuddenly a vicious thought came to Tang Mi! The titanium sword in her hand lashed out, the blade twinkling, and like mercury wound towards her rival.\u003c/p\u003e\n\u003cp\u003eBut in that exact moment Nooblet saw her hand rising and the tip of his sword rose to meet the flat of her blade. The Ace’s streaking blade was knocked away. Tang Mi was mad enough to spit blood!\u003c/p\u003e\n\u003cp\u003eNooblet’s figure rushed quickly, and almost as though he’d flashed right through her.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eClink!\u003c/em\u003e The soft sound wafted towards her.\u003c/p\u003e\n\u003cp\u003eTang Mi’s reaction was could not be called slow. She sent her mecha spinning outward, slashing towards Nooblet.\u003c/p\u003e\n\u003cp\u003eHowever, to her continued amazement, when she turned Nooblet was nowhere to be found.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eClink, clank, chink, clang, chink! \u003c/em\u003eThe sound of metal striking metal filled the cockpit from behind her.\u003c/p\u003e\n\u003cp\u003eTang Mi was flabberghasted. She changed up her footwork with each step, but no matter what she did she couldn’t catch a glimpse of Nooblet.\u003c/p\u003e\n\u003cp\u003eA drop of sweat raced down her forehead. \u003cem\u003eIs he.. shadowing me?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eMirroring was an expert close-combat technique. The greatest sin of close combat was giving your enemy your back, and a master at mirroring could take advantage of that when their strength is inferior to stick close to their adversary without them even knowing.\u003c/p\u003e\n\u003cp\u003eBut Tang Mi knew where her assailant was, why couldn’t she shake him?\u003c/p\u003e\n\u003cp\u003eSuddenly, everything grew black and calm. A computerized voice filled the cockpit.\u003c/p\u003e\n\u003cp\u003e“Defeat. Mecha damage one hundred percent. Please repair your suit, and continue.”\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhat? \u003c/em\u003eONE HUNDRED PERCENT\u003cem\u003e damage?! \u003c/em\u003eTang Mi sat in utter confusion. Simulated and real mecha combat were almost exactly the same. She knew what a hundred percent damage meant. That sort of thing only happened with massive, direct frontal explosion. How could a saber mech possible do something like that?\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eREPLAY!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eShe reached out and slammed the button.\u003c/p\u003e\n\u003cp\u003eIt started from the beginning of the fight, with The Ace rushing towards Nooblet. He squatted, she kneed him.\u003c/p\u003e\n\u003cp\u003eThe Ace broke in to disordered stepping.\u003c/p\u003e\n\u003cp\u003eNooblet, disordered stepping…\u003c/p\u003e\n\u003cp\u003eAnd then that supernatural strike. That one strike, that offset the Ace and allowed Nooblet to get behind her.\u003c/p\u003e\n\u003cp\u003eAfter that is was cut after cut, and a clear line was open to finish the fight. But he’d just kept swinging that sword .\u003c/p\u003e\n\u003cp\u003eThe titanium allow sword glinted with a brilliant metallic luster. No strike was exceedingly powerful, but the speed was inhuman. Even in the replay Tang Mi had to slow down the speed to see clearly what had happened.\u003c/p\u003e\n\u003cp\u003eAs she looked on in shocked admiration, she noticed that nearly all of Nooblet’s strikes found a joint – but they did not sever them completely.\u003c/p\u003e\n\u003cp\u003eWhen his final cut struck home, her mecha stiffened, and collapse in to a heap of slag. A pile of scrap. Like a toppled tower of toy bricks.\u003c/p\u003e\n\u003cp\u003eTang Mi knew this technique, or to be precise, had heard of this technique!\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThe Brunois assault!\u003c/em\u003e It was a technique rarely seen on the battlefield, since it was largely impractical.\u003c/p\u003e\n\u003cp\u003eSlaughtered! The Ace slaughtered by Nooblet!\u003c/p\u003e\n\u003cp\u003ePerfect victory!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-49\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-51\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-50","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
