{"id":56730,"no":508,"title":"Chapter 506: Misunderstanding","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 506: Misunderstanding\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue responded with a sardonic chuckle. “I don’t want to steal the spring of your youth.”\u003c/p\u003e\n\u003cp\u003eXiuxiu turned her head and gave him a look. “I’ve never wanted anything from you. I’ve only ever wanted to be by your side. If you want to deprive me of that, then I have nothing to live for.”\u003c/p\u003e\n\u003cp\u003eLan Jue was stunned by the strength of her words. “You can’t be serious?” Lan Jue knew Xiuxiu. She looked soft, but she was made of iron. When she made up her mind that was it.\u003c/p\u003e\n\u003cp\u003eShe proved that with her rigid answer. “Absolutely!”\u003c/p\u003e\n\u003cp\u003eHe gave a soft laugh and shook his head. “Alright then. Pretend I never said anything.”\u003c/p\u003e\n\u003cp\u003eHer mousy voice came again after a moment. “Don’t bring this up again, ok? I just want to see you often, and be by your side when you need me. That’s enough for me. I’m different from the other girls. I didn’t stay with you out of affection. My reason is simple.”\u003c/p\u003e\n\u003cp\u003eLan Jue felt his heart sink from her tone. He knew Xiuxiu was the one who felt most deeply of all the Amazons. That’s why he spoke with her first. These were young women in their twenties, it wasn’t fair for him to keep them so close. It was a waste of their precious youth, and he couldn’t give them what they wanted.”\u003c/p\u003e\n\u003cp\u003eIt was impossible that Xiuxiu didn’t have any interest at all. However, he’d always seen Xiuxiu as a little sister. After so long, that feeling was deep-rooted. When later he met Hera, Xiuxiu was even more the confidante and friend than a love interest.\u003c/p\u003e\n\u003cp\u003eThrough all the years Xiuxiu was unfailingly at his side. She never asked for anything, and she never brought him trouble. This truth, though, only made him feel worse.\u003c/p\u003e\n\u003cp\u003eThe verticar quickly made the trip to the Avenue’s periphery, then settled just outside. Lan Jue stepped out and began walking back when he was suddenly grabbed from behind.\u003c/p\u003e\n\u003cp\u003eXiuxiu’s soft body gently shook against his, her arms wrapped around his waist. “Please don’t make me go, ok? Please, I beg you.”\u003c/p\u003e\n\u003cp\u003eEven if Lan Jue was a hard man, he couldn’t help but crumble before Xiuxiu’s sad display. He heaved a sigh, saying, “alright. I promise I won’t say anything like this again. Xiuxiu, I’m afraid you’re in too deep.”\u003c/p\u003e\n\u003cp\u003e“I’m not afraid.” She answered resolutely.\u003c/p\u003e\n\u003cp\u003eThey separated and Lan Jue turned around. He gently stroked her hair, and Xiuxiu fell in to his embrace. Great tears tumbled from her eyes.\u003c/p\u003e\n\u003cp\u003eSoemthing tickled at the back of Lan Jue’s mind as he held her, and he lifted his head. He saw another figure nearby, her face also wet. Zhou Qianlin stood in silence, with a black box clutched in her hands. She wavered slightly from side to side as though she might fall over, and her lip was caught between her teeth.\u003c/p\u003e\n\u003cp\u003eHer delicate hand slowly rose to her chest where the precious Soulcaller gemstone sat. Deflty, she plucked it off her neck, followed by the twinkling pearl on her wrist.\u003c/p\u003e\n\u003cp\u003eLan Jue heard her voice in his head.\u003c/p\u003e\n\u003cp\u003e“\u003ci\u003eHave these back.”\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eShe crouched and placed the box, necklace and bracelet upon the floor. Full of grace and composure, she rose to her feet and left.\u003c/p\u003e\n\u003cp\u003eLan Jue wanted to follow, but Xiuxiu held on to him tightly. She was still shaking from her sobs. Without the Soulcaller, he had no way to explain.\u003c/p\u003e\n\u003cp\u003eHe couldn’t see Xiuxiu’s red eyes, staring in the direction Qianlin had left.\u003c/p\u003e\n\u003cp\u003eShe cried for ten minutes before being able to reign herself in. “Boss,” she finally managed to say, “Let’s go home.” She wrapped her arm in his and started back.\u003c/p\u003e\n\u003cp\u003e“Yeah,” he answered, his heart heavy. His right hand rested at the small of his back. Out of Xiuxiu’s view, he indicated with a finger and the jewelry Qianlin had left flew over to his palm.\u003c/p\u003e\n\u003cp\u003eWhen they got back, Lan Jue went straight to his chambers. The Jewelry Store on the upper Avenue was still open as he walked through. It was just a normal Jewelry Store, after all.\u003c/p\u003e\n\u003cp\u003eThe other girls were ill at ease when they saw Xiuxiu’s red and puffy eyes. Yet they didn’t trouble Lan Jue, who walked by them as though they weren’t there. His face was dark and sad.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e“Didi – didi – didi!”\u003c/i\u003e Lan Jue looked at his communicator as it rang. No one picked up on the other end. He let it go on as he stared at the heart-shaped Soulcaller and the pelagic pearl cradled in his palm. There was a dull ache in his chest that wouldn’t go away.\u003c/p\u003e\n\u003cp\u003eHe could have guessed she would come quickly. Their shared connection meant she could feel when he was nearby. \u003ci\u003eShe was waiting for me, to tell me something. But she got there just in time to see Xiuxiu hugging me. Of course she’d misunderstand.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eThe communicator rang and continued to be ignored. Lan Jue couldn’t keep the frustration from his face, and he heaved a deep sigh. He focused on her, thinking of them together. He reached out to summon her to his side.\u003c/p\u003e\n\u003cp\u003eBut, much to Lan Jue’s shock, Qianlin had somehow cut their link. Her energy was still there intermingled with his, but without her cooperation he couldn’t call her close.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eWhat in the world is all this?\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eWhen it came to matters of love, sometimes it was best to step away from a misunderstanding and let cooler heads prevail. The fear, though, was how deeply entrenched that misunderstanding became.\u003c/p\u003e\n\u003cp\u003eThis wasn’t something he was prepared to allow. A glint of determination flashed in his eyes. Although he’d worked hard at his cultivation these last few days, the specter of Zhou Qianlin had lingered in his mind. It was clear she occupied a special and eternal place in his heart.\u003c/p\u003e\n\u003cp\u003eNow he knew this to be true, and he understood what his heart wanted. There was no further reason to hesitate. He was on the other side of his pain from Hera, and he had grown tremendously as a person in the interim. It was maturity that came from time and experience, an important factor in being a man.\u003c/p\u003e\n\u003cp\u003eHe needed to find her so they could talk through their pain. When he saw her he knew that she was not heartless, and that she had real feelings for him. Otherwise, what was everything they’d been through?\u003c/p\u003e\n\u003cp\u003eAfter he calmed dwon, Lan Jue could see things much clearer. Sometimes matters of love needed logic too. A lot of intractable misunderstandings happened because the chance to resolve them slipped by.\u003c/p\u003e\n\u003cp\u003eHe took a shower and changed his clothes once his mind had been made up. When he left, he saw the girls gathered in the shop. They called to him all together when he stepped out.\u003c/p\u003e\n\u003cp\u003e“Boss.”\u003c/p\u003e\n\u003cp\u003eThey’d been with Lan Jue for a long time. Of course they would pick out his poor mood. Though, now he seemed better.\u003c/p\u003e\n\u003cp\u003eThe communicator on Lan Jue’s wrist chose that moment to start ringing.\u003c/p\u003e\n\u003cp\u003eHe connected right away when he saw who it was. “Wine Master.”\u003c/p\u003e\n\u003cp\u003e“Are you back?” The Paragon’s deep voice answered.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Come pay me a visit.”\u003c/p\u003e\n\u003cp\u003eLan Jue’s brows furrowed. “Now?” He’s only just made the decision to go after Qianlin and explain things. He wanted to avoid future heartache, but the Wine Master seemed determined to change his plans.\u003c/p\u003e\n\u003cp\u003eThe Paragon affirmed. “Unless you have something very important to handle, then yes.”\u003c/p\u003e\n\u003cp\u003e“Alright.” Lan Jue replied helplessly. The Wine Master was insistent. The only thing he could think of that would need immediate attention, would be the Clairvoyant.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-505\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-507\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-506","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
