{"id":56734,"no":512,"title":"Chapter 510: Halt! I’m Talking to You!","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 510: Halt! I’m Talking to You!\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSo who was it that held higher status in Lan Jue’s heart? It was difficult to admit, but the image of Hera had begun to dim. Zhou Qianlin was sharper, more impressed upon his mind. However, deep in his heart there would forever be an overlap between them. He’d come to accept that this may always be the case.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eIt doesn’t matter, I like \u003c/i\u003eher\u003ci\u003e! \u003c/i\u003eLan Jue firmly reminded himself. There was no more time for looking back.\u003c/p\u003e\n\u003cp\u003eIt wasn’t long before he arrived at the peak of the mountain. Lan Jue found a place to lean his bicycle, then walked up to the front.\u003c/p\u003e\n\u003cp\u003eHe pressed the doorbell.\u003c/p\u003e\n\u003cp\u003eAfter a moment, the door flung open. Lan Jue was met by none other than the Chairman of the Eastern Alliance, Zhou Xueguan.\u003c/p\u003e\n\u003cp\u003eLan Jue went stiff. Ever since taking Zhou Qianlin from her wedding, Lan Jue had been left with an unhealed wound. He didn’t know how he could explain, and apologize to her family.\u003c/p\u003e\n\u003cp\u003eThe Chairman fixed him with steely eyes. “Who are you looking for?”\u003c/p\u003e\n\u003cp\u003eThis wasn’t the kind of place solicitors frequented.\u003c/p\u003e\n\u003cp\u003e“Uncle, hello,” Lan Jue began. “I am looking for Zhou Qianlin.”\u003c/p\u003e\n\u003cp\u003eThe most powerful politician in the East stood in the doorway, and sized up the young visitor. Lan Jue had chosen an ash grey suit, with a deep blue shirt and dark grey tie. His brown leather shoes were a stately addition, and with the suit set off his slender, athletic physique. The edge of a white handkerchief peaked from his vest pocket.\u003c/p\u003e\n\u003cp\u003e“You are?” the Chairman asked.\u003c/p\u003e\n\u003cp\u003e“I’m her friend. I’m sorry, is she home?” Lan Jue inquired.\u003c/p\u003e\n\u003cp\u003eZhou Xueguan shook his head. “She is not. She left early this morning and hasn’t returned. Why haven’t you called her communicator, friend?”\u003c/p\u003e\n\u003cp\u003eLan Jue smirked sheepishly. “We’ve had a bit of a misunderstanding. She’s not answering my calls.”\u003c/p\u003e\n\u003cp\u003e“A misunderstanding?” The statesman looked at Lan Jue curiously. “Come in.” He stepped aside and pulled open the door. He didn’t know how this young man got all the way up here, but in his years of experience he’d learned to read people well. This young man, in his estimation, had no ill intent.\u003c/p\u003e\n\u003cp\u003eThis was the first time Lan Jue entered this complex by the front door. The place was as spartan as Qianlin’s room. Only the simple essentials and tasteful decoration could be seen.\u003c/p\u003e\n\u003cp\u003eZhou Xueguan lead Lan Jue to a sofa and sat. “You still haven’t told me who you are.”\u003c/p\u003e\n\u003cp\u003e“Ah, I’m sorry, how impolite. Uncle, I am Lan Jue.” He was still a little out of sorts, otherwise he wouldn’t have forgotten such a simple courtesy.\u003c/p\u003e\n\u003cp\u003e“Lan Jue?” Zhou Xueguan searched his memory for the name, but shook his head. “I’m sorry. \u0026nbsp;I’ve never heard Qianlin talk about you. How do you know each other?”\u003c/p\u003e\n\u003cp\u003eLan Jue fumbled for words. “I’m one of her instructors at school. I’m an etiquette teacher at the National Eastern University.”\u003c/p\u003e\n\u003cp\u003eIt appeared those qualifications were enough for the chairman. His face softened once Lan Jue explained who he was. “Etiquette teacher, eh? No wonder I get a refined sense from you. Well, Qianlin isn’t here. I myself have a meeting to get to. Won’t be long.”\u003c/p\u003e\n\u003cp\u003eWas this a hint for him to leave? Lan Jue looked reluctant, but he was not slow in rising to his feet. “Uncle, if I could trouble you to give Qianlin a message? I have to speak to her about something rather urgent.”\u003c/p\u003e\n\u003cp\u003e“Sure,” the chairman replied. “But I’m afraid, instructor, I must remind you. You are Qianlin’s teacher, and thus should call me ‘sir’, not ‘uncle.’”\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eSharp! No wonder he’s the Chairman.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue couldn’t think of a way to answer. He only nodded, and muttered “Of course, Mister Zhou. I’m sorry for troubling you.”\u003c/p\u003e\n\u003cp\u003eZhou Xueguan put in his daughter’s number in to the communicator. After a few rings Qianlin’s familiar voice answered. “Daddy, what is it?”\u003c/p\u003e\n\u003cp\u003eInwardly Lan Jue couldn’t help but gloat. \u003ci\u003eHah! I \u003c/i\u003eknew\u003ci\u003e she was just screening my calls!\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e“We have a visitor here at the house,” her father began. “He says he’s your teacher. Lan Jue. He says he needs to speak with you about something urgent.”\u003c/p\u003e\n\u003cp\u003e“Oh. Hand him the communicator, please.” Her voice was calm.\u003c/p\u003e\n\u003cp\u003eZhou Xueguan gave his communicator to Lan Jue, who thankfully took it from him. “Qianlin, where are you?”\u003c/p\u003e\n\u003cp\u003eQianlin’s sweet voice answered. “Professor Lan, I’m out walking around with a few friends. What’s the matter?”\u003c/p\u003e\n\u003cp\u003eHe couldn’t be direct with her father standing right in front of him. “Can we meet somewhere and talk?”\u003c/p\u003e\n\u003cp\u003eHer response was soft. “I’m sorry. I’ve already left Skyfire City.”\u003c/p\u003e\n\u003cp\u003e“Left?” Lan Jue was surprised at the revelation. “When are you coming back?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure.” Qianlin’s voice was halting and timid. “If that’s it, Professor, I’ll talk to you later.”\u003c/p\u003e\n\u003cp\u003eLan Jue rushed to fit in a last word. “Look, everything was a misunderstanding –“ He could hear the dial tone on the other side. She’d hung up. He was forced to hand the communicator back under the Chairman’s fixed, curious stare. Lan Jue’s face was both bitter but resigned.\u003c/p\u003e\n\u003cp\u003e“I’ll be leaving uncle, sorry for troubling you.” The former Mercenary King bowed respectfully before the Eastern leader and then left. He didn’t give any thought to addressing the chairman wrong a second time. The Chairman didn’t correct him. He simply watched the young man go, with a small smile on his face.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAs he trundled down the mountain, Lan Jue was a lot less confident and a lot more depressed then he had been coming up. He hadn’t seen this coming, and it was the worst outcome he could have dreamt up. But leaving without saying anything, how could he fault her for that? He’d just done the same thing! He could only blame himself.\u003c/p\u003e\n\u003cp\u003eLan Jue pondered on the sour matters as he rolled homeward. \u003ci\u003eOh well\u003c/i\u003e, he thought, \u003ci\u003eI’ll deal with other matters first.\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eBut wait – she’d said she was out with classmates. He would go to school first, then, and at least find out who she was out with. Maybe he could guess where they went. If time allowed, he’d go find her. It sounded like she was out of the city, but not off planet, so it wouldn’t take too long time get wherever she was.\u003c/p\u003e\n\u003cp\u003eIt had been a long time since he had walked the campus. This was as good a time as any to get in touch with the A.R.C. students and get them up to speed on the plan. If they decided to join his division, he’d at least have a group capable of following instruction. It was a great deal for them as well. Aside from Avenue membership, they also got a damn god level mecha suit for signing up.\u003c/p\u003e\n\u003cp\u003eHowever, he couldn’t just show up looking like he did. He was too recognizable now. If what the Driver said was true, he was practically a celebrity after the tournament. He had to be careful, otherwise he’d get himself in trouble.\u003c/p\u003e\n\u003cp\u003eHe pulled off the path at where he and Qianlin used to separate after school. He put on his hat, mask and sunglasses, and then continued his trek to the NEU.\u003c/p\u003e\n\u003cp\u003eTo ensure he wouldn’t be seen, Lan Jue didn’t go through the main gates, either. He pulled the bike around the side and scaled a wall. If he’d wanted to come in the normal way, security would have had to ask him his identity. That would’ve been less than ideal.\u003c/p\u003e\n\u003cp\u003eThe NEU’s perimeter wall was tall, and was equipped with an electronic fence to deter unwanted visitors. This, of course, was not a problem for an Adept who specialized in lightning. He easily hopped the wall, and once inside began to walk the narrow alleys like everyone else.\u003c/p\u003e\n\u003cp\u003eLan Jue chose not to visit Wu Junyi in the administration building, and instead head straight for the electives offices. Wang Hongyuan would be there, and he could tell him about the future of the A.R.C. class as well.\u003c/p\u003e\n\u003cp\u003eHis walk across campus was going well. No one he passed seem to recognize him, and his destination was only a few feet away. At this time, most of the students were in class, so the roads were mostly deserted.\u003c/p\u003e\n\u003cp\u003eHe was congratulating himself on his luck, when suddenly a harsh shout pulled his eyes away from the electives building.\u003c/p\u003e\n\u003cp\u003e“Halt! I’m talking to you, the guy in the hat!”\u003c/p\u003e\n\u003cp\u003eThe shout almost made Lan Jue leap out of his skin. He unconsciously spun toward the source.\u003c/p\u003e\n\u003cp\u003eOf course he knew who it was! In fact, he was starting to think the two of them were forever cursed to be in each other’s orbit. He could always count on it, and always at the worst times.\u003c/p\u003e\n\u003cp\u003eTan Lingyun, known locally as the Savage Goddess, was in his face faster than he could gasp. “Who the hell are you, skulking around the school like this? Take off that ridiculous mask, and the hat and glasses while you’re at it. If you refuse don’t blame me for the consequences!”\u003c/p\u003e\n\u003cp\u003eThe sudden sense of déjà vu caused his hackles to raise. Rude as ever!\u003c/p\u003e\n\u003cp\u003eHe heaved a deep, helpless sigh. “It’s clear that your temperament isn’t ever going to improve. We were born with opposing horoscopes [1. The Chinese use a system of animals for their horoscopes that are different from ours. Anyone who’s ever been to a Chinese restaurant knows this. I’m a cow!]. Why is it whenever I expressly \u003ci\u003edon’t\u003c/i\u003e want trouble, you’re always around the corner?”\u003c/p\u003e\n\u003cp\u003eAs he spoke, he lifted his head, pulled off his hat and glasses, and stared coldly at her. He didn’t need to hide his identity from her anymore, not after the tournament. Running in to her was probably a good thing. She must have watched it, too.\u003c/p\u003e\n\u003cp\u003eWhen she saw his face, old habits kicked it. “\u003ci\u003eAgain\u003c/i\u003e I run in to you, piece of tr –“\u003c/p\u003e\n\u003cp\u003eAnd then she remembered.\u003c/p\u003e\n\u003cp\u003eHer curse caught in her throat. “Yo- you… you… you are... !”\u003c/p\u003e\n\u003cp\u003e“I am what?” Lan Jue said in faux resignation. “Trash? That’s what you were going to say. I’m on the edge of my seat waiting to hear your opinion, Professor Tan.”\u003c/p\u003e\n\u003cp\u003eThe Savage Goddess stared at him with eyes so wide he thought they might roll out of her head. She was still as a statue, and suddenly she found she couldn’t utter a single sound.\u003c/p\u003e\n\u003cp\u003eSince the end of the tournament, she’d been waiting for him to come back. She wasn’t sure he ever would, but she had been looking forward to the chance to meet him face to face again. She figured that the chances would be small, though, considering his sudden rise to stardom. After the tournament he was a household name, and she figured coming back to the school would have caused a splash he wasn’t interested in. Still she prayed that was the case. And here he was – was he coming back?\u003c/p\u003e\n\u003cp\u003eNow, however, with the man right she wanted him, she couldn’t think of anything to say. Here she was, and now everything was not what she imagined. He was Lei Feng? Was that even possible? This was the Demon Drillmaster?\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eZeus?\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eHow could this be Zeus, though? How was he not a rough and rugged warrior?\u003c/p\u003e\n\u003cp\u003eA thousand questions flooded her mind all at once, so many that she couldn’t even straighten her thoughts enough to pick one. She just looked at him, hardly able to believe her eyes.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-509\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-511\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-510","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
