{"id":56274,"no":52,"title":"Chapter 52: Outrage and Oscillation","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 52: Outrage and Oscillation\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue was caught off guard. He did not expect Fresh Meat to go through an entire tyrade before his assault. He couldn’t help but laugh at the story, and in that split second he’d let his guard down.\u003c/p\u003e\n\u003cp\u003eFresh Meat’s attacks were instantaneous and vicious. Even with his abilities, controlling this factory-level mecha under this sort of assault was proving difficult.\u003c/p\u003e\n\u003cp\u003eThe tips of his toes raised, and suddenly he was shooting backwards. In the same moment the blade in his hands was cutting an arc, barely managing to deflect Fresh Meat’s own weapon. His right leg raised to meet his enemy’s kick and push it aside.\u003c/p\u003e\n\u003cp\u003e“Some good reaction time buddy!” Fresh Meat’s voice sounded fullof praise.\u003c/p\u003e\n\u003cp\u003e“I’ll poke your eyes out,” he shouted, and suddenly his mechanical legs were shooting out to entwine Nooblet’s.\u003c/p\u003e\n\u003cp\u003eNooblet was unstable, his hurried retreat causing him to stagger. He couldn’t avoid being caught by his adversary’s trip. The body of Fresh Meat’s mecha then twisted with the agility of a monkey, in attempts to bring Nooblet to the ground.\u003c/p\u003e\n\u003cp\u003eJiujitsu! Fresh Meat had learned to incorporate jiujitsu in to his mecha fighting techniques.\u003c/p\u003e\n\u003cp\u003e“You know though I’ve come across some bad luck myself lately,” Fresh Meat continued through the grapple. “I’d gone to the cafeteria for some grub yesterday and there in my food was a piece of pork covered in hair. I though to myself, man this school’s cafeteria really doesn’t care for cleanliness. So then I carefully pulled the hairs out one by one, cleaned it off and popped in my mouth. And goddamnit, wouldn’t you know, it was a piece of ginger!”\u003c/p\u003e\n\u003cp\u003eWhere someone present to see Lan Jue’s face in the sim pod, they would have discovered the look of disgust on his face.\u003c/p\u003e\n\u003cp\u003eNooblet’s mecha had been pinned to the ground by Fresh Meat, their legs wrapped together. It appeared Fresh Meats pointless stories were giving him a definite advantage. Even with Lan Jue’s many experiences on the battlefield, this was the first time he’d come across an opponent like… this.\u003c/p\u003e\n\u003cp\u003eTaking advantage of the situation, Fresh Meat extricated himself from the grapple and plopped his metallic girth directly on to Nooblet’s back. He then proceeded to lock up Nooblet’s sword arm with his hands.\u003c/p\u003e\n\u003cp\u003e“Heh! Whada ya think buddy, cool story right?” Fresh Meat sounded exceptionally proud of himself. Or maybe you’re not convinced. Tell you what, if not you go ahead and hit me. Go on, hit me! Hehehe!”\u003c/p\u003e\n\u003cp\u003e“Don’t think you’ve won just yet,” Lan Jue growled.\u003c/p\u003e\n\u003cp\u003e“Eh?” Fresh Meat sounded surprised. “Won? Oh don’t worry, I wont let you off so easy – I just don’t want you to hurt your mecha! That way DreamNet can’t interrupt us while we continue our little chat.”\u003c/p\u003e\n\u003cp\u003eSuddenly Fresh Meat felt Nooblet’s mecha shaking beneath him. It was of no great intensity, but quite sudden. More, surprising, however, wasn’t the shaking itself – but the fact that it had unexpectedly loosened his grip!\u003c/p\u003e\n\u003cp\u003e“No… !” Fresh Meat yelled. Nooblet twisted and, in a way Fresh Meat couldn’t even determine, suddenly he was the one entangled. For with a metal-crunching blow Nooblet threw him to the floor, and pinned him there.\u003c/p\u003e\n\u003cp\u003e“Oscillation! You’re using oscillation!” Fresh Meat was too shocked to even attempt a counter.\u003c/p\u003e\n\u003cp\u003eOscillation, he’d been attempting to train in that for ages!\u003c/p\u003e\n\u003cp\u003eFresh Meat was indeed Tang Mi’s older brother, Tang Xiao. He was well known, one of the best students in the mecha combat division. Already a Sovereign-Level First Class pilot, and one of the top ten in the entire combat department.\u003c/p\u003e\n\u003cp\u003eOnce one was evaluated as a Sovereign-Level mecha pilot they were immediately conferred the title of Lieutenant by any state in the three Alliances.\u003c/p\u003e\n\u003cp\u003eThe graduation requirement for even National Scholar pilots was only Second Class. Sovereign-Level Second Class pilots were often called upon to command mecha squadrons of ten suits.\u003c/p\u003e\n\u003cp\u003eBut even with all these ranking and expectations – Sovereign-Level, First Class, top ten – Tang Xiao still wasn’t capable of executing the Oscillation technique.\u003c/p\u003e\n\u003cp\u003eThe \u003cem\u003eBrunois Assault\u003c/em\u003e was a show move, worth little in actual combat. But Oscillation, that was a close combat maneuver that was highly prized. It was fair to say it was that level of ability every pilot dreamt of.\u003c/p\u003e\n\u003cp\u003eIn truth Oscillation was something even the lowest Third-Rank pilots trained, but even Sovereign-Ranked pilots… maybe even God-Ranked pilots couldn’t master it. It took a certain level of talent not everyone possessed.\u003c/p\u003e\n\u003cp\u003eThe technique knows as Oscillation caused the entire mecha to begin vibrating at high-frequency. The result was traumatic injury to the opponent, or to extricate oneself from difficult grapples. Brain waves are important in mecha manipulation, but Oscillation – that required an unfathomable speed of hand!\u003c/p\u003e\n\u003cp\u003eModern mechas required both brain wave and manual control to operate, but oscillation was another matter. It required the pilot to execute a series of perfectly timed, high-frequency movements – all in an instant. Needless to say, this required exceptional dexterity. Repetitive motions, performed again and again in as short a time as possible. That was oscillation.\u003c/p\u003e\n\u003cp\u003eAll three alliances have attempted to solve the oscillation problem through technological pursuit, employing exhaustive studies and experimentation. The problem persisted, however, that oscillation produced by these means was far and away less flexible than that which was performed by the pilot. It was also expensive, both fiscally and in terms of energy use.\u003c/p\u003e\n\u003cp\u003eIt went without saying that Nooblet’s basic saber-mech didn’t possess this sort of high technology. The only explanation was that it was the pilot’s own skill.\u003c/p\u003e\n\u003cp\u003eWhen they tout speed of hand as a requirement of oscillation, what they mean is that the effective control of the mecha must top three hundred. That is to say, a pilot must execute at least three hundred flawless moves in a minute before oscillation can be achieved.\u003c/p\u003e\n\u003cp\u003eTang Xiao new he himself could reach the three hundred mark but only rarely and with great effort. He could only manage around a hundred and eighty efficiently.\u003c/p\u003e\n\u003cp\u003eNooblet pressed a clenched fist against Fresh Meat’s head. “Go on then, keep talking,” he snarled.\u003c/p\u003e\n\u003cp\u003eFresh Meat bubbled excitedly. “How did you learn to oscillate?! H-how fast are your hands? How old are you? Do you teach or study here? Can you teach me? You must be a teacher, right? There aren’t any students here capable of oscillating.”\u003c/p\u003e\n\u003cp\u003e“Teach you?” A sadistic grin spread against Lan Jue’s features. “Sure, I can teach you. Where are you?”\u003c/p\u003e\n\u003cp\u003eFresh Meat’s joy was almost overwhelming. “I’m in the research department. Just tell me where to be and I’ll go to you!”\u003c/p\u003e\n\u003cp\u003e“There’s a small lawn behind the electives building. I’ll be waiting for you there. Be there in ten minutes, or I’m gone.” Lan Jue’s voice came soft and even.\u003c/p\u003e\n\u003cp\u003e“Right, yes! I’ll be right there!” Tang Xiao was clearly ecstatic, how could he not be. He’d never known anyone who could oscillate. Whoever this person was, he must have recently arrived.\u003c/p\u003e\n\u003cp\u003e“But before you go, let’s give you some more first hand oscillation experience…” The first pressed against Fresh Meat’s head became a blur, and in an instant buried itself in the mecha’s head.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eCrunch!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-51\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-53\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-52","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
