{"id":56744,"no":522,"title":"Chapter 520: Live Life Like Luo Xianni!","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 520: Live Life Like Luo Xianni!\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIn that instant a nimbus of light surrounded Lan Jue, while a white phantom shimmered at his back. He thrust his index finger forward.\u003c/p\u003e\n\u003cp\u003eFor a moment, nothing happened.\u003c/p\u003e\n\u003cp\u003eLan Jue’s pupils contracted, and without hesitation he dropped his sword. He retracted his hands, then returned with the mightiest of the nine Taiji Hammers; Downward Hammer strike!\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eBoom--!\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eThe concussive force shook their surroundings. Lan Jue staggered back, nearly falling before regaining his footing some ten meters back. Lan Qing had not moved.\u003c/p\u003e\n\u003cp\u003eBoth Hua Li and Chu Cheng watched the brothers in awe. It was no surprise that Lan Qing was strong – the strongest of all of them, no doubt. Only now, they had some measure to compare it to. Both of them had plentiful experience with peak Adepts – Chu Cheng’s father was one, after all – but even at the highest levels there were enormous discrepancies in strength. Aftershocks of his power still caused the floor to tremble.\u003c/p\u003e\n\u003cp\u003ePalm, fist, finger. Three strikes, straightforward and unobtrusive. One might even call it drab. And yet, its strength was such that Lan Jue’s Taiji sword couldn’t stand up to it. This was not just an inferior Discipline, but inferior martial technique.\u003c/p\u003e\n\u003cp\u003eLan Qing could see his brother was still a beginner with the sword. His opening tactic was no different than Chu Cheng’s: Overcome with superior force. The difference lay in Lan Qing’s strength.\u003c/p\u003e\n\u003cp\u003eChu Cheng’s outright offensive couldn’t penetrate Lan Jue’s defense. Lan Qing’s storm of energy put Lan Jue and the Asura Godblade on the ropes.\u003c/p\u003e\n\u003cp\u003e“Very good!” Lan Qing’s hard voice called. He raced forward to press the attack. As invasive as wind, as aggressive as fire – in a moment he went from being rooted as the mountains to a raging lion.\u003c/p\u003e\n\u003cp\u003eLan Jue saw him coming, but didn’t back down. On the contrary, a hint of a smirk cracked his lips. And why wouldn’t he? This was the first time in all their clashes that Lan Jue had been able to withstand his brother’s Prajna triple-attack [1. I can’t recall if I’ve described Lan Qing’s martial art before. I believe it was noted somewhere that he and his brother were taught different styles that suited each of them. If I gave it a name before, I’ve forgotten. Henceforth we’ll refer to his style as Prajna technique, where Prajna is the Buddhist concept of wisdom and insight.]. And he didn’t even get wounded! He’d done it with only rudimentary sword training.\u003c/p\u003e\n\u003cp\u003eHe’d dropped his weapon, not because he didn’t have an answer with his sword style, but rather because he feared the attack might injure Xiuxiu. In substitute he fell back on the more familiar Taiji defense. He knew that Lan Qing hadn’t used the full strength of the Three Prajna Charms, but just defending at all was a success.\u003c/p\u003e\n\u003cp\u003eIn an instant, Lan Qing was nearly on top of his brother. He struck at him with a fist. Lan Jue responded with a cross-step, and dropped into a defensive posture with his hands at the ready. His Taiji technique prepared to meet his brother’s fist.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eBoom – boom – boom!\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eThree blast, as the two brothers clashed three times.\u003c/p\u003e\n\u003cp\u003eLan Jue’s nine hammers were iron wrapped in silk, imbued with his intrinsic lightning. His tai-yang bearing was on full display.\u003c/p\u003e\n\u003cp\u003eLan Qing was as omnipresent as the wind. His attacks were heavy as a tumbling mountain, then light as a summer breeze. From time to time, he’d lash out at Lan Jue with another Prajna charm to keep him on his toes.\u003c/p\u003e\n\u003cp\u003eThey danced around each other, faster and faster, until gradually they were just a pair of blurry shapes. The arena was buffeted with the screeching howl of their powers.\u003c/p\u003e\n\u003cp\u003eFor the spectators, this was a much more pleasing fight than the one before. Lan Jue was forced back with every collision, but he still managed to defend against his brother’s attacks. He was on the defensive, but wasn’t losing too much ground.\u003c/p\u003e\n\u003cp\u003e“Careful.” Lan Qing suddenly cautioned.\u003c/p\u003e\n\u003cp\u003eThe nimbus that had appeared around his head before appeared anew, and Lan Qing’s entire demeanor changed. His iron exterior seemed to soften with an ethereal benevolence. He thrust out with his palms, alternating one after the other. Each press added to a tide of concussive force headed for Lan Jue. However, not all of them were of equal strength. Some were deceptively soft, which made the stronger ones more acute. The whispering green energy became a fierce wind that kicked up dirt and stones in its path.\u003c/p\u003e\n\u003cp\u003eWithin it, was the faint trace of protogenia.\u003c/p\u003e\n\u003cp\u003eLan Jue did not retreat, but rushed forward. The golden aura around him blazed. Behind him, the image of yin and yang, black and white, rotated around one another. His clawed hands rose as though lifting something heavy, then he pushed forward with all of his strength. It was all in total contrast to Lan Qing’s measured strikes.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eBoom--! \u003c/i\u003eThe arena became an explosion of color, as hurricane-force blasts of energy filled the area. Reality collapsed in the center of the ring, and rebounded with a violent detonation that sent Lan Jue flying. Lan Qing tumbled out of the sky and staggered back, but kept his footing.\u003c/p\u003e\n\u003cp\u003eLan Jue caught himself, and swung his eyes toward his brother. Gold light poured from them before the whole ring became immersed in it. Lan Qing fell back on his heels, while the halo of light surrounding him fanned out like a holy areole [2. \u003ca href\u003d\"http://img0.ph.126.net/3SLvwmnXI5503j1-BquEug\u003d\u003d/6597807538959072170.jpg\"\u003eLike this\u003c/a\u003e.]. Behind him, another image of a cyan Buddha spontaneously sprang into being. He pressed his palms together in front of him as bands of white and cyan intermingled all around. Everyone could feel the energy levels rising.\u003c/p\u003e\n\u003cp\u003e“Stay your hand!” The Wine Master’s booming voice interrupted their exchange.\u003c/p\u003e\n\u003cp\u003eThe brothers were too caught up, and had begun to call upon their protogenic Domain. This was the arena, and while it may look real it was still a constructed reality. If he let them employ the full breadth of their protogenia, he feared this place wouldn’t survive.\u003c/p\u003e\n\u003cp\u003eBut they had already passed the point of no return. Even if the Wine Master intervened personally, it would just be adding his own flame to the raging fire. It could make matters worse.\u003c/p\u003e\n\u003cp\u003eHowever, before the critical moment a strange energy infiltrated the arena. A figure appeared, followed by a bone-crunching \u003ci\u003ecrack!\u003c/i\u003e Everything around them froze as time was arrested. Lan Jue and Lan Qing were unable to even blink, frozen in the instant before their collision.\u003c/p\u003e\n\u003cp\u003eProtogenic coagulation?\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eThis…\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue and Lan Qing had awakened from their battle lust, but found they couldn’t move. The protogenic domains they summoned coalesced in on themselves impotently.\u003c/p\u003e\n\u003cp\u003eNeither of them had experienced anything like this before. They weren’t Paragons, but at least their command of protogenia wasn’t anything to sniff at! This kind of protogenic coalescence… what sort of power could do that?!\u003c/p\u003e\n\u003cp\u003eThere was an odd flash of pink light. Lan Jue and Lan Qing seemed to shrink, no more the doughty titans of the ring. There was another flash and pop.\u003c/p\u003e\n\u003cp\u003eLuo Xianni busily flicked a Polaroid photo in her hand. It had captured the perfect moment, just at the peak of the two boys’ conflict, with all their power swirling around them. At some point during their clash, she had produced a delicate looking pink camera from somewhere. She smirked at the collective stares directed her way. “If you want to know how to life, learn from Luo Xianni. Always carry a camera along! Oh, yeah!” [3. This exclamation, in English, is popular among young girls or woman who are trying to act young.]\u003c/p\u003e\n\u003cp\u003eThey… they’d been changed into a picture?\u003c/p\u003e\n\u003cp\u003eChu Cheng was struck dump with amazement. He could only stare at the newly revealed Paragon.\u003c/p\u003e\n\u003cp\u003eThey had all guessed, but now they knew. This woman who claimed to be Lan Jue and Lan Qing’s mother, had to be one of the old-style Paragons. She was unknown, a hermit, and now they saw how powerful she really was.\u003c/p\u003e\n\u003cp\u003eTwo men in the midst of calling upon the peak of their power, were immediately reduced to a pretty picture. All of that impressive protogenic energy, gone. How was that even possible?\u003c/p\u003e\n\u003cp\u003eEven the wine Master looked stunned by what he’d witnessed. After all, it’d been many years since he last saw his Aunt. His memory of the woman wasn’t what it once was.\u003c/p\u003e\n\u003cp\u003eShe tittered on, her face split in a wide smile. “Not bad, not bad! These two young men are an impressive pair. Strong, good potential. Bupang really knows how to pick them. Ay, if only they were my real children!”\u003c/p\u003e\n\u003cp\u003eIn the midst of her lamentations, the flicking photo vanished in a flash of light. Two figured then appeared, suddenly and without warning. They were Lan Jue and Lan Qing. Neither were employing their powers anymore.\u003c/p\u003e\n\u003cp\u003eThe two brothers shared a wordless look, and saw the shock mirrored in one another’s eyes. Lan Jue remembered her telling him she was once known as the Photographer in these parts.\u003c/p\u003e\n\u003cp\u003eEven the Avenue’s photographer could move mountains.\u003c/p\u003e\n\u003cp\u003eLuo Xianni chuckled to herself. “It’s been so long since I’ve used my camera, I’m a little rusty. When you’re fighting, try not to move around so much. It ruins the picture and makes it blurry. Alright, I think that’s enough for today. Come and find me if you ever want some pictures!”\u003c/p\u003e\n\u003cp\u003eThey left the arena. All four of the Monarchs were silent as they stepped back out onto the Avenue. Lan Qing, especially. Luo Xianni walked right beside them.\u003c/p\u003e\n\u003cp\u003e“Mother, where are you going to go?” Lan Jue asked.\u003c/p\u003e\n\u003cp\u003e“To my store to take a look around,” she answered. “It should be more or less ready for the grand re-opening. Make sure I’m the first one you call when it’s time to get married. I promise, you’ll have photos unlike anything you’ve ever seen. It’s up top, called Luo Xianni’s Wedding Photography.”\u003c/p\u003e\n\u003cp\u003e“Mother, I have a question. How long can you seal time like that when you take a picture?” Lan Jue pressed.\u003c/p\u003e\n\u003cp\u003eShe thought for a moment. “Not too long. At your strength, no more than three years, I suspect. I wouldn’t able to take pictures though, a pity.”\u003c/p\u003e\n\u003cp\u003eThree. Three years…\u003c/p\u003e\n\u003cp\u003eLan Jue just stared at her. The concept was terrifying, worse than any prison. Only moment ago he felt what that was like; he could think, he could even control his Discipline, but he couldn’t move even a centimeter. Nor could he find a way to break free. This was the containing power of protogenia.\u003c/p\u003e\n\u003cp\u003eImagine: No one under the rank of Paragon could deny her a picture. It was terrifying!\u003c/p\u003e\n\u003cp\u003eLan Jue went on. “If the photo is destroyed, what then?”\u003c/p\u003e\n\u003cp\u003eHer answer was thoughtful. “That depends on what you mean by ‘destroyed’. I’m the only one able to damage the photos. If I rip up your image, then you are ripped up too. The higher the Discipline, the more difficult it is to tear up.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-519\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-521\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-520","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
