{"id":56770,"no":548,"title":"Chapter 546: Uniting with the Banishing Blades","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 546: Uniting with the Banishing Blades\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIn a flash of light, Qianlin vanished. Lan Jue’s aura swelled as he rose to peak level.\u003c/p\u003e\n\u003cp\u003eHe nodded toward the sword-spirits. “What do I need to do?”\u003c/p\u003e\n\u003cp\u003eJun Yongye responded. “There are stages. First I will join with you. Then, Xuanyuan and Qianlin. Once our spirits clash you will experience the fluctuations in Captus, then you will perceive the dissolution as two become one. I will help you as much as I can.”\u003c/p\u003e\n\u003cp\u003e“Got it!” Lan Jue nodded resolutely.\u003c/p\u003e\n\u003cp\u003eJon Yunye motioned. “Please sit.”\u003c/p\u003e\n\u003cp\u003eLan Jue sat cross-legged on the floor with hands on his knees. His back was straight and tall.\u003c/p\u003e\n\u003cp\u003eJun Yongye’s face became serious. Xuanyuan Shishi retreated to stand by the Pharmacist’s side.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eClang!\u003c/i\u003e The ringing sound was harsh against the ears. Lan Jue felt his very soul reverberating from impact. His focus immediately sharpened to a razor’s edge, his eyes bright and vibrant.\u003c/p\u003e\n\u003cp\u003eA faint red light began to radiate around Jun Yongye. An unfamiliar sensation flooded the room.\u003c/p\u003e\n\u003cp\u003eEverything around Lan Jue vanished. It was as though he’d slipped into a separate reality. Lan Jue stared, but the outside world seemed murky and different.\u003c/p\u003e\n\u003cp\u003eBefore his eyes, Jun Yongye fractured into a host of beaming lights. They arced up into the air. His red aura deepened until, all of a sudden, everything went dark. A single beam of red light was all that was left.\u003c/p\u003e\n\u003cp\u003eIt was dark as a black hole. The stark red that split it in two was breathtaking.\u003c/p\u003e\n\u003cp\u003eThe fabled blade, Captus, descended through the light, blade first. It was a bright red from hilt to point that pulsed incessantly. The moment he set his eyes upon it Lan Jue felt himself caught in its influence. His soul was painted with the red light of the sword.\u003c/p\u003e\n\u003cp\u003eIt was marvelous. He made no effort to resist and simply experienced the sensations.\u003c/p\u003e\n\u003cp\u003eAnd then reality warped around him. A flash, then a slash of red light was racing right at him. It struck Lan Jue directly on top of his head. He shook violently as the light pierced him, impaling his soul. The power contained within him threatened to burst out of him. He felt like he was being torn into a hundred thousand pieces.\u003c/p\u003e\n\u003cp\u003eIt was definitely \u003ci\u003enot\u003c/i\u003e marvelous. The obliteration of one’s soul was not something one could just grit their teeth and endure.\u003c/p\u003e\n\u003cp\u003eLan Jue threw his head back and screamed at the top of his lungs. Glorious rays of red light erupted from every pore. He couldn’t stop shaking, and with every painful jerk lightning burst from him.\u003c/p\u003e\n\u003cp\u003eBolts of golden lightning appeared and vanished, colliding constantly with each other around and through his Core. It poured its energy in wild abandoned, like a dam that had burst.\u003c/p\u003e\n\u003cp\u003eLan Jue suddenly knew what it meant when they said a pain worse than death. This is what they were talking about. Pain, unendurable pain the likes of which could break a man.\u003c/p\u003e\n\u003cp\u003eEverything was spinning. Lan Jue could feel his own body caught in the wildfire that was Captus. More precisely it was like a black hole in the pit of his stomach. It was sucking in bone, blood, organs and meridians.\u003c/p\u003e\n\u003cp\u003e“Clear your heart, focus your mind! You are joining with the sword spirit. You must endure it no matter what. Be strong and you will succeed.” Jun Yongye’s disembodied voice called through his mind. It helped root him in the moment.\u003c/p\u003e\n\u003cp\u003eThe pain was excruciating, but Lan Jue clung to a single image. A pair of eyes, heavy with unwillingness and dismay, filled with agony. She didn’t want to leave him!\u003c/p\u003e\n\u003cp\u003eThey were Qianlin’s eyes, moments after receiving the killing blow meant for Lan Jue. The poison had stolen her ability to speak, leaving just her eyes to try and impart her final words.\u003c/p\u003e\n\u003cp\u003eHow could any physical or ethereal pain match such agony? How could it compare with nearly watching Qianlin die? To the videos from she and Hera?\u003c/p\u003e\n\u003cp\u003eIn that moment Lan Jue fixed on the thought. The pain is his body was separate like it belonged to someone else. In his heart was only the boundless love he felt for Hera and Qianlin.\u003c/p\u003e\n\u003cp\u003eFrom the Pharmacist and Xuanyuan’s perspective, Lan Jue had been consumed in a cocoon of glaring red light. The image of him wracked with pain was burned into their minds. Xuanyuan Shishi watched with knitted brows, while the Pharmacist nervously clenched her fists. She had experienced precisely what he was going through. She knew how much it hurt. Worse, it was insidious. The more you focused on the pain the worse it became.\u003c/p\u003e\n\u003cp\u003eJudging by the look on his face, she judged his process was more difficult than hers. This was to be expected, for the Banishing Blades were not equal in strength. Xuanyuan Shishi had told her once that Jun Yongye was the strongest sword-spirits to arise in the last ten thousand years.\u003c/p\u003e\n\u003cp\u003eHe’d revealed that Jun Yongye had held back during the tournament, and that was the sole reason for Lan Jue’s victory. The stronger the spirit, the more dominating the weapon – and the more painful the joining. Lan Jue had a tremendous weight on his shoulders.\u003c/p\u003e\n\u003cp\u003eThis was the premise behind Jun Yongye’s insistence of joining with Lan Jue first. Helping Qianlin bond with Xuanyuan Shishi would be an easier endeavor.\u003c/p\u003e\n\u003cp\u003eTheir nervous gazes eased when they saw him begin to stabilize. His face was no longer a mask of pain, like he felt it no longer. It was replaced with a sentimental smile. He still shook from time to time but remained still and straight, seated on the floor. The red light flowed freely from his pores, and the aura he released was firm. The light that surrounded him was cross-shaped, like a sword.\u003c/p\u003e\n\u003cp\u003eXuanyuan Shishi’s voice was joyful and relieved. “We have made the right decision. The results are even better than we’d hoped. The first one was the worst, what comes will be easier. He was a strong will.”\u003c/p\u003e\n\u003cp\u003eThe Pharmacist’s face revealed a knowing smile. “Experienced men know how to overcome adversity. He’s known suffering in his life. I had no idea he would channel it for fortitude.”\u003c/p\u003e\n\u003cp\u003eThe sword-spirit smiled and nodded. “They are fine candidates for mastering the Harmonious Swords.”\u003c/p\u003e\n\u003cp\u003eThis earned a surprise look from the Pharmacist. “You two were unable to learn the style? It’s obvious both of you have studied the sword to near perfection!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-545\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-547\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-546","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
