{"id":56771,"no":549,"title":"Chapter 547: Thunder Essence","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 547: Thunder Essence\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eXuanyuan Shishi’s face fell. “You shouldn’t tease, sword-sister. The Banishing Blades have creates spirits out of balance. Only one of us is female, Occisus. It would be…. Strange for us to perform a style based on such affection. As we have both trained profoundly in other styles, combining them is also difficult.”\u003c/p\u003e\n\u003cp\u003eThe Pharmacist’s eyes were wide. “So that’s the way it is? I thought you two could combine harmoniously. No wonder you two fled so quickly when the Terminator showed up.”\u003c/p\u003e\n\u003cp\u003eXuanyuan Shishi was trying to keep his composure. “I’d appreciate it if you didn’t always have to point out the truth, sister.”\u003c/p\u003e\n\u003cp\u003e“Huh?!” Their conversation was interrupted as the Pharmacist suddenly exclaimed, and snapped her eyes to Lan Jue.\u003c/p\u003e\n\u003cp\u003eAt some point, they don’t know when, a white light had begun to spread from him. It was a gentle light was settled just over his skin and muscles like a film. It was only visible in passing, swelling and contracted with his breath. It gave Lan Jue a strange, ethereal quality.\u003c/p\u003e\n\u003cp\u003eThis…\u003c/p\u003e\n\u003cp\u003eIt wasn’t the destructive power of Captus, nor was it Lan Jue’s own Discipline. His Thunderbolt abilities had already been overcome and scattered by the Banishing Blade before being absorbed. The white light was none of this, and it permeated his whole body.\u003c/p\u003e\n\u003cp\u003e“That must be Qianlin’s power.” The Pharmacist offered after some consideration.\u003c/p\u003e\n\u003cp\u003eXuanyuan Shishi was uncertain. “But hasn’t she lost consciousness?”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “Haven’t you ever heard of lover’s instinct?”\u003c/p\u003e\n\u003cp\u003eHe stared blankly at her. “I’m a sword-spirit. All I know is that love is strange.”\u003c/p\u003e\n\u003cp\u003eShe grunted. “That’s instinct.”\u003c/p\u003e\n\u003cp\u003eThe white light eased and supported Lan Jue. Captus’ corona of red energy had vanished within him. Lan Jue sat cross-legged and unmoved, like he was in a trance. The seconds passed in silence until they became hours.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Lan Jue!” A low voice shook him from his focus on Hera and Qianlin. When he opened his eyes, he found himself still in that dark pocket of reality where nothing existed but the red sword. The red light it exuded surrounded them like a cocoon in the darkness.\u003c/p\u003e\n\u003cp\u003e“Yongye, is it you calling me?” Lan Jue asked, but did not speak. It was a thought given voice in this strange place.\u003c/p\u003e\n\u003cp\u003e“Yes. I am still in the process of joining with you. But there is a problem. There are some properties that do not meld well, and forcing them will make the process incomplete. We will need some outside help. If you have a power gem with thunder properties, I can try to channel myself through it as a means of transformation. That should solve the issue.”\u003c/p\u003e\n\u003cp\u003eLan Jue’s face scrunched in thought. “Thunder gems are rare. The ones they find are all a-ranked. In fact I have one stored in Thor’s Promise. Would that do?”\u003c/p\u003e\n\u003cp\u003eJun Yongye’s voice rang out once more from the sword. “Unlikely, it doesn’t have the potency we need. Filtering my power will be difficult, but let us try.”\u003c/p\u003e\n\u003cp\u003eCaptus flashed, and Lan Jue was surprised to find Thor’s Promise react in kind. Its pale green light flickered and danced among the steady red light of the sword. Another flash, and the sizeable contents hidden within Thor’s Promise was laid bare.\u003c/p\u003e\n\u003cp\u003eThe Banishing Blades were dimensional weapons. It would stand to reason their interdimensional control would extend to something like Lan Jue’s ring.\u003c/p\u003e\n\u003cp\u003eFlash! The thunder gems in Lan Jue’s collection hovered in the darkness between man and sword, twinkling in a rainbow of colors. “They’re all roughly the same; impure, weak… ey? Wait!”\u003c/p\u003e\n\u003cp\u003eFlash! Something else joined the stones. A box, with a strange metal nestled within. It was a light blue color itself, but deep sapphire specks of blue twinkling around it. Stranger still, at almost looked like it moved. Just a little – an incessant buzz back and forth - but enough to make it seem alive.\u003c/p\u003e\n\u003cp\u003e“This is…” There was hesitation in the sword-spirit’s voice.\u003c/p\u003e\n\u003cp\u003eLan Jue’s eyes sparkled. He remembered it the moment it appeared. “Living metal. Nothing like it has ever been seen in the Three Alliances. I still haven’t been able to figure out what it does, but it seems to involve amplification. Injecting it with even a little inert energy doubles its potency. I also suspect its movements help make unstable energy easier to control. I got it in an auction, I don’t know any more specifics.”\u003c/p\u003e\n\u003cp\u003e“Oh, right. This is a type of metal only detected on Lyr’s seabed, salvaged from twenty thousand meters below the surface. It is likely there is nothing else in the universe like it, and if there is another in the future it’ll be different. As far as we know these living metals are possessed of a single element. They are also unyielding, resistant to any efforts to break it apart. I bought it in the hopes it could be made into an Astrum when I ascended to Paragon.” This was all that he knew of the strange prize from Lyr.\u003c/p\u003e\n\u003cp\u003e“You’re luck is unbelievable. This, this is thunder essence!” Jun Yongye’s infinitely calm voice was a pitch higher.\u003c/p\u003e\n\u003cp\u003e“Thunder essence? What metal is that?” Lan Jue asked curiously.\u003c/p\u003e\n\u003cp\u003eJun Yongye explained. “Thunder essence isn’t actually metal, but a purified element of the planet. Legends talk of a time when great beasts roamed the land. They would grow so powerful that they threatened all life. In those dire times, there appeared the divine Empyreal Lightning. If the lightning’s support is strong, then the beast becomes an immortal and rises to the heavens. If it cannot then the process continues. Empyreal lightning was said to come in sets; four, six, or nine sets of nine. Only when the ninth bolt of the ninth strike is just enough to empower a creature with lightning properties is thunder essence born. The creature rises to immortality, and though they leave only a fraction of their life force behind, it is the strongest, purest element in the universe.”\u003c/p\u003e\n\u003cp\u003eLan Jue listened in stunned silence. “I \u003ci\u003eam\u003c/i\u003e lucky! So should I use it for my future Astrum?”\u003c/p\u003e\n\u003cp\u003e“No, impossible! Thunder essence cannot be molded to suit your needs. Instead…”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-546\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-548\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-547","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
