{"id":56277,"no":55,"title":"Chapter 55: Little Elf Girl","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eChapter 55: Little Elf Girl\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You’re telling me you’re my older brother…” Tang Mi looked at Tang Xiao’s swollen face pig-like face in surprise.\u003c/p\u003e\n\u003cp\u003eTang Xiao winced. “Have a little compassion, why don’t you.”\u003c/p\u003e\n\u003cp\u003e“You want me to be compassionate?” Tang Mi spat. “I called you over to deal with that Nooblet, and instead you’re calling me on the communicator to come and save you. What are you doing letting someone beat you in your pig face anyway?”\u003c/p\u003e\n\u003cp\u003eTang Xiao stuck out his chest and, choking back the pain in his body, spoke with pride. “You don’t understand. I’m cultivating my powers. You’ll understand later!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You don’t understand!” Jin Tao said to a visibly panicked Jin Yan.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“If you tell anyone about what we’re doing here, you can forget about cultivation. And don’t bother coming to find me,” Lan Jue warned.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue found it hard to imagine how this hospital had become so run-down. It was a shabby stone building of simple construction, with decorative iron bolted to the wood-framed windows. It had to be among the oldest architectural styles on Planet Skyfire.\u003c/p\u003e\n\u003cp\u003eA distinctly modern crucifix’s green neon glow flickered over the large door. The twinkling green glow radiated around the cross like a halo, sometimes there and sometimes not. Even from a good distance you could still make it out.\u003c/p\u003e\n\u003cp\u003eLan Jue brought his bicycle to a stop. “You’re sure this is the place?”\u003c/p\u003e\n\u003cp\u003eZhou Qianlin answered by dismounting from the backseat of the bike and wordlessly making her way in to the hospital.\u003c/p\u003e\n\u003cp\u003eHe pulled his bike to the side and entered after her. After all, it was his duty as her body guard.\u003c/p\u003e\n\u003cp\u003eThe scent of disinfectant fluid swirled around him as he entered the hospital. This sort of low-cost cleaning method was rarely seen in the three alliances anymore.\u003c/p\u003e\n\u003cp\u003eAll the facilities he passed look exceedingly worn-out, with the exception of the odd doctor or nurse’s coverall.\u003c/p\u003e\n\u003cp\u003eDespite this, however, the hospital was host to many patients. Without exception each was clad in simple clothing, some as worn as the building they stood in.\u003c/p\u003e\n\u003cp\u003eIt was a poor district hospital. Lan Jue knew this even before stepping foot inside, because Grace Hospital was located right in the middle of Skyfire’s most famous ghetto.\u003c/p\u003e\n\u003cp\u003eWhat he couldn’t understand is why Zhou Qianlin would want to come to a place like this. Looking at her lithe figure moving in front of him, It was clear she was familiar with the place.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin didn’t pause, continuing on in to the heart of the hospital. She proceeded until passing through a simple wooden door.\u003c/p\u003e\n\u003cp\u003eThey stepped in to a small, pleasant flower garden, no more than two hundred square meters. The vegetation within wasn’t anything particularly special or rare, but they were vibrant and well tended. Vibrant green filled the eyes, and the fresh smell was invigorating. Twenty or so elderly patients sat or stood among the flora.\u003c/p\u003e\n\u003cp\u003eAs Zhou Qianlin entered, every pair of yellowed, rheumy eyes drew towards her. Their faces lit up, their wrinkles deepening as each adopted a smile.\u003c/p\u003e\n\u003cp\u003e“Linlin!”* A wrinkled woman in grey clothing smiled at Zhou Qianlin and weakly waved her hand.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin hurried to the woman’s side, a radiant smile blossoming upon her face.\u003c/p\u003e\n\u003cp\u003e“Granny Meng! Why are you sitting on this stone bench with no cushion. You mustn’t let your legs get cold.” Zhou Qianlin knelt before the elderly woman and took her hand, a look of mild admonishment on her face.\u003c/p\u003e\n\u003cp\u003eGrenny Meng chuckled. “It’s fine, it’s fine. The weather today isn’t bad. I’m not cold at all. Here, I got this special for you. Eat it quick while it’s fresh.” As she spoke her trembling hands fumbled for her pocket, extracting an apple from within. She passed it to Zhou Qianlin.\u003c/p\u003e\n\u003cp\u003eThe skin of the apple was already distinctly shriveled, but the smile on Zhou Qianlin’s face was wide and genuine. “Thank you Granny Meng. Oh, it smells lovely,” she said as she took it in her hands.\u003c/p\u003e\n\u003cp\u003eShe ignored the shriveled and dusty exterior of the apple and took a big bite.\u003c/p\u003e\n\u003cp\u003eThe other elderly occupants of the garden had begun to gather around.\u003c/p\u003e\n\u003cp\u003e“Little Linlin, come here to granddad.^ Here, I brought you some bread.”\u003c/p\u003e\n\u003cp\u003e“Don’t bother with that bread. Here, Linlin, this is some tea my grandson brought me. I knew you were coming today so I brewed you a cup, still warm. Here have a sip, wet your whistle.”\u003c/p\u003e\n\u003cp\u003e“Linlin, I brought you this…”\u003c/p\u003e\n\u003cp\u003eAlmost every one of the twenty-something patients presented something to Zhou Qianlin. She took each item in turn, praising the giver and looking upon each item as though it were precious.\u003c/p\u003e\n\u003cp\u003eLan Jue stood not far off, silently looking on. He keenly felt the warmth and friendliness of the older patients as Zhou Qianlin ate their gifts and gave them hugs in return.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eWhy? What relationship do they have to her? What is this place?\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eA quavering, aged voice interrupted his thoughts. “Did you come with Linlin young man?”\u003c/p\u003e\n\u003cp\u003eLan Jue turned his head and spotted an old man clad in an old green army coat, clutching a walking cane in his hands. He looked back at Lan Jue in curiosity.\u003c/p\u003e\n\u003cp\u003e“Yes. Greetings,” Lan Jue politely responded. “Pardon me sir, but what is this place?”\u003c/p\u003e\n\u003cp\u003eThe old man’s eyes softened visibly. “This is Grace Hospital Retirement Home, serving the slums here. Linlin comes here once a week to volunteer. She’s our little elf – we say that when she comes it’s like our own festival.”\u003c/p\u003e\n\u003cp\u003eZhou Qianlin pulled her hair up with practiced hands and tied it with a simple piece of cloth. He didn’t notice when in her hands suddenly appeared a pair of nail clippers. One by one she knelt before them, and one by one careful clipped their nails. Concentration filled her eyes, and from beginning to end her face held a gentle smile. In between she’d speak a few sentences to her charges, which would invariable cause their faces to light up in smiles.\u003c/p\u003e\n\u003cp\u003e“Young man, come have a cup of water if you’d prefer not to talk.” The old man from before offered a mottled tea cup, filled with steaming clear water.\u003c/p\u003e\n\u003cp\u003e“Thank you very much.” Lan Jue hurriedly took the cup and brought it to his lips.\u003c/p\u003e\n\u003cp\u003eThe old man began to chuckle, but the phlegm is his throat set him to coughing. “It’s my turn to get my nails clipped, eh!” He turned towards Zhou Qianlin with a youthful vigor.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eThis green-eyed girl, smiling as she works… she really is the garden’s little elf. A flawless, perfect little elf.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e*In China, repeating the last part of a person’s name is a cutesy nickname denoting familiarity.\u003c/p\u003e\n\u003cp\u003e^Granny and granddad are used to denote a close relationship with an elder person – not necessarily blood relation.\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-54\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-56\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-55","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
