{"id":56278,"no":56,"title":"Chapter 56: Kindness Should be Preserved","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 56: Kindness Should be Preserved\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Excuse me a moment everyone, I’m going to get some water and wash your feet. Please come in one by one.” Zhou Qianlin turned and motioned Lan Jue over. It was the first time she’d acknowledged him in the half hour they’d been there.\u003c/p\u003e\n\u003cp\u003eLan Jue was still surprised with the scene, but managed to make his way towards her.\u003c/p\u003e\n\u003cp\u003eAs he did, he felt all eyes on him.\u003c/p\u003e\n\u003cp\u003e“Ey, Linlin, is this your boyfriend hm?” Granny Meng’s eyes lit up mischievously with this new piece of potential gossip.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin’s face grew red, and she quickly shook her head. “Not at all, he’s a friend of mine.” She spoke then to Lan Jue. “Come and help me with the water.”\u003c/p\u003e\n\u003cp\u003eShe gripped his sleeve and pulled him away through another door on the opposite side of the garden.\u003c/p\u003e\n\u003cp\u003eThey found themselves in a long corridor beset on each side with scores of doors, a number above each one.\u003c/p\u003e\n\u003cp\u003e“What are you yanking me for,” Lan Jue inquired as he was pulled along.\u003c/p\u003e\n\u003cp\u003e“They all care a lot for me. If I didn’t pull you away you’d never have escaped,” she responded. “With you to help me today getting the water should go faster.”\u003c/p\u003e\n\u003cp\u003eAs they spoke she pulled him in to a simple room. A wooden chair and a steel frame with hangers affixed to the ceiling were it’s only adornments.\u003c/p\u003e\n\u003cp\u003e“Usually they use this room to give the patients injections.” She offered the simple explanation as they moved towards the water heater in the back. A washbasin had been set beside it.\u003c/p\u003e\n\u003cp\u003eZhou Qianlin took up the basin and began pouring the hot water in to it. “The cold water pipe is outside. Go bring some in so we can adjust the temperature.”\u003c/p\u003e\n\u003cp\u003e“Why are you cleaning these people’s feet anyway,” Lan Jue asked with genuine curiosity.\u003c/p\u003e\n\u003cp\u003e“They’re old and have trouble stooping down,” she responded without hesitation. “And washing their feet with warm water helps with circulation.”\u003c/p\u003e\n\u003cp\u003eThe basin had filled during their exchange, and she carefully placed it onto the ground. She removed her backpack and put it to the side.\u003c/p\u003e\n\u003cp\u003eStanding over her, Lan Jue could clearly make out the contents of her backpack as she opened it to rifle through.\u003c/p\u003e\n\u003cp\u003eThere was no make-up, accessories or playthings as you might expect; only books, and two bags – one big, and one small.\u003c/p\u003e\n\u003cp\u003eFirst she removed the small back and replaced the nail-clippers she’d used earlier. Besides those, there was also a pair of scissors and hair clippers.\u003c/p\u003e\n\u003cp\u003eShe then opened the larger bag. Lan Jue peered in, and couldn’t help but lift his brows and interject.\u003c/p\u003e\n\u003cp\u003e“What are all the orange peels for?”\u003c/p\u003e\n\u003cp\u003eZhou Qianlin smiled, and her response was filled with no small measure of pride. “Don’t you know? Using orange peels in the water not only helps with circulation, but can also clear the cuticles, softened the skin of the feet, and guard them from cracking.”\u003c/p\u003e\n\u003cp\u003e“You’re a homeopath, too,” Lan Jue muttered in wonder.\u003c/p\u003e\n\u003cp\u003eThe smile on Zhou Qianlin’s face widened. “Go get the water.”\u003c/p\u003e\n\u003cp\u003e“Right,” he said, and turned to do so.\u003c/p\u003e\n\u003cp\u003eThe first batch consisted of four elderly patients. They entered orderly and took their seats. When Lan Jue returned, their eyes immediately fell upon him, curiosity plain on their faces.\u003c/p\u003e\n\u003cp\u003e“Hey son, who are you anyway?”\u003c/p\u003e\n\u003cp\u003e“You really aren’t Linlin’s boyfriend?”\u003c/p\u003e\n\u003cp\u003e“Hey kiddo, you’re a handsome fella but ya still aren’t a match for our Linlin. Keep at it eh!”\u003c/p\u003e\n\u003cp\u003e“You mess with our girl and you’ll have to answer to me!”\u003c/p\u003e\n\u003cp\u003eLan Jue felt overwhelmed with the questions, but he keenly felt how much these people cared for Zhou Qianlin.\u003c/p\u003e\n\u003cp\u003eWith Lan Jue’s help, four orange-peel infused basins of warm water were quickly produced. Each were placed before the patients before their shoes and socks were carefully removed and their feet placed inside.\u003c/p\u003e\n\u003cp\u003eHer motions were practiced, fluid from beginning to end. Each of the retirees beamed down at her as she worked, appreciation and enjoyment filling their pale yellowed eyes.\u003c/p\u003e\n\u003cp\u003e“Do you usually come by yourself,” Lan Jue asked as he helped her pour the water.\u003c/p\u003e\n\u003cp\u003e“Xiao Mi usually comes with me,” she said. “Today she had something to do, otherwise I wouldn’t have asked you to come. This is probably the first time you’ve done something like this, huh. You aren’t accustomed to it.”\u003c/p\u003e\n\u003cp\u003eLan Jue nodded in confirmation.\u003c/p\u003e\n\u003cp\u003e“Well today we’ll be using up some of your time,” she continued. “They’ll be warming their feet for about twenty minutes each. Until they begin to sweat a little is best.”\u003c/p\u003e\n\u003cp\u003e“Why do you do this?”\u003c/p\u003e\n\u003cp\u003eZhou Qianlin gave him a strange look. “No real reason! These people need looking after, so here I am. I’m happy when I’m with them. I lost my grandparents in the war, but here I have many grandparents to share my time with. They have so many experiences, I love hearing them talk about their lives. If my studies weren’t so busy I’d be here more often.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eSoak, wash, wipe. And so it continued.\u003c/p\u003e\n\u003cp\u003eFor two hours it proceeded, washing the feet of every tenant, but Zhou Qianlin did not waste the time. As they left she would also gather their laundry, bringing it in to the washroom to rinse and dry.\u003c/p\u003e\n\u003cp\u003eIt was night by the time they left Grace Hospital Retirement Home. Lan Jue stood at the door, holding Zhou Qianlin’s bag as she placed her hands on her head and stretched. Her supple figure beneath the dim lamplight was a sight to behold.\u003c/p\u003e\n\u003cp\u003eLan Jue shouldered her back and began to push his bicycle. “Tired?”\u003c/p\u003e\n\u003cp\u003e“No, I’m used to it. Are you? You got the hang of it pretty quickly, and they seemed to like you. I hadn’t suspected the great nobility would be able to handle this sort of work, hehe.” Zhou Qianlin’s smile had flowered significantly. Except for the very beginning, Lan Jue had stood at her side and helped for the whole two hours, his fine three-piece suit becoming hopelessly wrinkled in the process.\u003c/p\u003e\n\u003cp\u003eHe smiled. “Helping the elderly is showing respect. It something we all must do.”\u003c/p\u003e\n\u003cp\u003e“Time to go home,” Zhou Qianlin said.\u003c/p\u003e\n\u003cp\u003eLan Jue patted the bike’s back seat before straddling it himself. Zhou Qianlin sat upon it as though she’d done it a hundred times before, and immediately wrapped an arm around his waist.\u003c/p\u003e\n\u003cp\u003eAs the bike began to creep forward Lan Jue spoke over his shoulder. “How long have you been coming here?”\u003c/p\u003e\n\u003cp\u003e“More than two years.”\u003c/p\u003e\n\u003cp\u003e“Are you doing anything tomorrow night?”\u003c/p\u003e\n\u003cp\u003eZhou Qianlin’s response was guarded. “Why?”\u003c/p\u003e\n\u003cp\u003e“A friend of mine invited me to a meal, and I can bring someone along. Would you like to come?”\u003c/p\u003e\n\u003cp\u003eA flash of surprise passed though Zhou Qianlin’s pretty eyes. But something else lay deeper still.\u003c/p\u003e\n\u003cp\u003e“Why would you invite me to go eat with you?”\u003c/p\u003e\n\u003cp\u003eLan Jue smiled. “Kindness should be preserved.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-55\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-57\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-56","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
