{"id":56787,"no":565,"title":"Chapter 563: Sweep and Clear","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 563: Sweep and Clear\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe Red Widow had no idea how this enemy could suddenly appear. What happened to all their defenses? After all that money, it was like it had no use at all.\u003c/p\u003e\n\u003cp\u003eInside he was enraged, but he kept a clear head.\u003c/p\u003e\n\u003cp\u003eSix of the mechas that were guarding him broke off and engaged the metallic orb. They fired wildly at it, but their long-ranged attacks harmlessly bounced off. Then, as they watched, the orb grew several sharp and spindly protrusions. They appeared just in time, as the orb came crashing into the pirate mechas.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003ePeng! Bang!\u003c/i\u003e Two pirates were turned to slag as the orb made contact. The energy it struck with felt like it would level a mountain. The spikes launched out and pinned the remaining combatants to the floor – dead.\u003c/p\u003e\n\u003cp\u003e“Ai-ya, weak sauce.” Tang Xiao loudly complained. His round body catapulted into the air, changing back into a war machine. The Star Division unit commander chased after Red Widow.\u003c/p\u003e\n\u003cp\u003eThe pirate leader was obvious. His bright red suit was better than the others, and his cunning tactics were common for someone who’d spent their life as a deplorable scum.\u003c/p\u003e\n\u003cp\u003eHowever, before long the red mecha was gone. Vanished without a trace.\u003c/p\u003e\n\u003cp\u003e“Where’d he go?” Tang Xiao asked his sister, he was nearby.\u003c/p\u003e\n\u003cp\u003eTang Xiao’s unit was special. Using his metalmorphosis Discipline, the ten-member team became a singular weapon. The only teams that could outdo their damage output were Alpha Squads.\u003c/p\u003e\n\u003cp\u003eTang Mi was just as confused. “I don’t know! Some sort of mechanism? Forget it, there are other targets. Every target is worth it.”\u003c/p\u003e\n\u003cp\u003eIn terms of sheer numbers, the Red Widows outnumbered the Star Division. Quality, though, was a different story. In that regard the Star Division had a tremendous advantage. Plus, the speed and ferocity of their attack meant that many of the pirates’ mecha pilots were still groggily wandering the residential area and weren’t in their suits.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue sat before the large screens of the central control room. He watched as the action unfolded, sweeping up the rest of the base. He couldn’t help but feel a little bored.\u003c/p\u003e\n\u003cp\u003eThis was turning into a one-sided slaughter.\u003c/p\u003e\n\u003cp\u003eHe figured one of the top ten pirate clans in the Starfields would put up more of a fight. Perhaps he underestimated what the Star Division could do.\u003c/p\u003e\n\u003cp\u003eAfter over ten missions, every brigade in the Division was working better together. Individual fighting squads were the most improved. Every ten-man team had at least one sovereign-ranked pilot or ninth level Talent. They had enough of both to go around.\u003c/p\u003e\n\u003cp\u003eThe Adept-turned-pilots were a force of nature when behind a mecha suit. With Talent and technology as one, the pirates were mowed down like wheat.\u003c/p\u003e\n\u003cp\u003eBefore long Lan Jue’s communicator started receiving reports. One after the other, the important sectors of the base came under Division control.\u003c/p\u003e\n\u003cp\u003e“Should we launch the distress signal, Jewelry Master?” The Accountant asked.\u003c/p\u003e\n\u003cp\u003e“Do it.” Lan Jue replied.\u003c/p\u003e\n\u003cp\u003eA ship blasted off into the sky once the command was given. Right away it was through the atmosphere and climbing.\u003c/p\u003e\n\u003cp\u003e“Ah, running away?” The Accountant’s face bore a disdainful grin. His fingers danced mesmerizingly across the keyboard in front of him. Outside of the base, its perimeter rail guns slowly began to retarget.\u003c/p\u003e\n\u003cp\u003eLock. Fire!\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eBoom---!\u003c/i\u003e A silvery-white light fired into the sky. The beam twinkled as it vanished into the distance. The fleeing shit was right in its path, and as the particle beam swept by the ship was atomized. Nothing was left to prove it had ever existed.\u003c/p\u003e\n\u003cp\u003eRed Widow was dismayed to find their mighty defenses turned against them. In the moments before his death, he still couldn’t understand what had happened. As the silver light approached and set his ship ablaze, he just didn’t get it. These were their own weapons.\u003c/p\u003e\n\u003cp\u003eThe Accountant’s distress signal was, of course, for the three satellite asteroids. He made it look like a call to arms from the pirate commander himself. Soon they were sending a fleet of ships down to the main base while he watched.\u003c/p\u003e\n\u003cp\u003eThree battleships. Fifteen patrol boats. It looked like the pirates were throwing everything they had at them. Unfortunately for them, they were greeted by the planetary defense system they relied so heavily on. Each blast from a railgun rivaled the power of a battleship’s main battery.\u003c/p\u003e\n\u003cp\u003eIf there were doubts as to why Xiaosu didn’t want to attack the asteroids head-on, this put them to rest. It wasn’t that it was impossible – Lan Jue, the Pharmacist, and the Gourmet could have handled it themselves if they threw all their power behind it. But that would just deny these soldiers invaluable battle experience. She didn’t want that.\u003c/p\u003e\n\u003cp\u003eTheir future enemies weren’t going to be this easy to overcome. The battle against those aliens on Tempest wasn’t so easy, for instance. Xiao Su’s three secret weapons – the Gourmet, Lan Jue and the Pharmacist – had all tipped their hand to deal with the Progenitor. That one was young, and still had power equivalent to a peak-ranked Adept. They also knew precious little about these foreign adversaries.\u003c/p\u003e\n\u003cp\u003eTo be prepared for the fight ahead, they needed as much practice as they could get right now. They needed to be a strong, well-oiled machine. It was the only way to serve their people.\u003c/p\u003e\n\u003cp\u003eAn hour had passed since Operation Bugle Call had commenced. Three battleships and sixteen patrol boats were now space debris. The Red Widow pirate clan was no more.\u003c/p\u003e\n\u003cp\u003eThe battle was over.\u003c/p\u003e\n\u003cp\u003eUnfortunately, the clan was quite a bit poorer than they thought. When they found the pirate cache it didn’t even match up to what they’d found from the Desert Tempest pirates. Evidently, most of it had been used to build these bases. So while they didn’t have a lot of toys, they did have an astronomically expensive planetary defense system. It was bulky, though, and took up a lot of space. Lan Jue considered leaving it behind, but he’d forgotten something. A click of the Photographer’s camera, a familiar phrase and \u003ci\u003esnap!\u003c/i\u003e A whole system’s defenses were safely packaged in a Polaroid photo.\u003c/p\u003e\n\u003cp\u003eThe rest of the resources they came across hardly required a thought. Railguns and planetary shields were a moment’s concern, all the rest even less so.\u003c/p\u003e\n\u003cp\u003eStripping the base took them about a day.\u003c/p\u003e\n\u003cp\u003eThe campaign was flawless, almost textbook. With little effort and minimal time, they’d taken the four asteroids without even giving their enemies time to counterattack. The reason? Clandestine operations.\u003c/p\u003e\n\u003cp\u003eWithout Lan Jue’s involvement Majesty wouldn’t have been able to reach the asteroid’s surface. They wouldn’t have caught the pirates with their pants down, unable to respond.\u003c/p\u003e\n\u003cp\u003eClearly the first one to honor for the Star Division’s victory was their commander, Lan Jue.\u003c/p\u003e\n\u003cp\u003eA day later, Majesty and Zeus-1 were in the air again. The asteroids were left behind, stripped and silenced, as they headed for the next objective.\u003c/p\u003e\n\u003cp\u003eThe soldiers were in high spirits after their win. But Xiaosu was good at keeping them in check. Morale was important, but pride was deadly. Debriefs were given after every fight, and Xiaosu made a point of highlighting where everyone could have been better. In that way she ensured they kept improving.\u003c/p\u003e\n\u003cp\u003eOver the next month, Majesty and Zeus-1 stalked the Starfields. Whatever foe they encountered was quickly silenced.\u003c/p\u003e\n\u003cp\u003eHowever, eventually news of the Division’s exploits became known. After all, pirate clans were disappearing right and left. One of the strongest went dark and no communications had been heard for ages. It was starting to get everyone’s attention.\u003c/p\u003e\n\u003cp\u003eEspecially the Moonfiend Pirates.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShattered Starfields, Planet Moonfiend.\u003c/p\u003e\n\u003cp\u003e“Where the hell did these people come from? They appear out of nowhere and vanish like ghosts. According to this we’ve lost contact with more than \u003ci\u003etwenty\u003c/i\u003e groups. We have to assume they fell to nefarious means. Whoever they are, their bloodlust has started to creep in to our domain.” The pirate who spoke was tall, with a downtrodden face like he was the victim. The bald ruffian’s most striking feature was his enormous red beard.\u003c/p\u003e\n\u003cp\u003eHe stood across from another man. This one was tall, too, but sat and glowered at him with a morose expression.\u003c/p\u003e\n\u003cp\u003eWere Lan Jue here, he’d recognize the man. It was his old friend, Gabriel, one of the Pontiff’s Archangels.\u003c/p\u003e\n\u003cp\u003eThe seraph narrowed his eyes. “So many clans, whoever they are is on a mission. Redbeard, do you have any more specific information?”\u003c/p\u003e\n\u003cp\u003eThe one called Redbeard replied. “According to our intelligence, only one person from the Black Widow clan managed to get eyes on them. Hey prefer to engage with mecha ground troops. Their ships are equipped with some kind of cloaking capability as well. They get in close, and the mechas strike hard and fast. They overwhelm the defenders and take over. Because of the cloaking no pirate patrols have found them out in space, no way to engage. Right, and their insignia is some kind of flame. They all have them, just different colors.\u003c/p\u003e\n\u003cp\u003e“A flame insignia?” Gabriel’s face darkened as he thought.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-562\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-564\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-563","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
