{"id":56806,"no":584,"title":"Chapter 582: Nasty Middle-Aged Man","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 582: Nasty Middle-Aged Man\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eLan Jue’s eyes lit up. “Ah, how’d you know I was starving?”\u003c/p\u003e\n\u003cp\u003eThe Gourmet gave him a flat stare. “Because \u003ci\u003eI’m\u003c/i\u003e hungry. Would you like some?”\u003c/p\u003e\n\u003cp\u003eHe replied with eyes wide with shock. “On what condition?”\u003c/p\u003e\n\u003cp\u003eSkyfire Avenue’s chef chuckled. “I remember that cache we found with all the goodies. By the time I got there it was practically empty, but I seem to remember a bottle. The label was silver. A deer’s head? I’m not sure I’m remembering that correctly.”\u003c/p\u003e\n\u003cp\u003eLan Jue looked at him indignantly. “You scoundrel! If you think I’m trading my Dalmore whisky for some cake, you’re dreaming.”\u003c/p\u003e\n\u003cp\u003eThe Gourmet harrumphed. “Who says it’s yours? That was won for the Division in war. As commander, aren’t you afraid of how it looks when you line your own pockets like this?”\u003c/p\u003e\n\u003cp\u003e“Lining my own pockets?” Lan Jue whined. “I haven’t even opened it! I was planning to share it with everyone when we got back!”\u003c/p\u003e\n\u003cp\u003eThe Gourmet didn’t appear to believe him. “With everyone, when we get back? How much did you get, exactly? Is there an inventory somewhere?”\u003c/p\u003e\n\u003cp\u003e“No one likes to drink it anyway,” he weakly replied, scowling openly.\u003c/p\u003e\n\u003cp\u003ePassion crept into the Gourmet’s voice. “You must be fair! Uphold justice! How can you convince your men you are righteous if you bend the rules for your own benefit?”\u003c/p\u003e\n\u003cp\u003eGabriel’s eyes popped open when he heard the Paragon’s impassioned words. Surprise and hope briefly flitted across his face. If the Gourmet and Lan Jue continued their bickering – or if they got drunk - he might have a chance to escape. He knew they couldn’t have taken the entire planet so quickly. Gabriel was confident that if he could slip away, he’d just need to wait until they left. Then he could return safely to Europa.\u003c/p\u003e\n\u003cp\u003eLan Jue saw his friend’s intractable bearing, and sighed.\u003c/p\u003e\n\u003cp\u003e“How much do you want?”\u003c/p\u003e\n\u003cp\u003eThe Gourmet produced a platter from somewhere unseen. He placed the cakes atop it and cradled the metal container with his hands. They began to glow with a red-hot, infernal heat that warmed the treats. The control room filled with the smell.\u003c/p\u003e\n\u003cp\u003eLan Jue wrinkled his nose happily when the scent reached him. “Did you use butter? IT smells amazing!”\u003c/p\u003e\n\u003cp\u003eNext the Gourmet took up a cut of spiced beef. With a knife in his other hand, he quickly sliced thin pieces off of the cut and over the top of the cake. Gabriel swallowed a mouthful of saliva. He hadn’t eaten, either.\u003c/p\u003e\n\u003cp\u003eLan Jue helped himself to a piece of cake with a slice of beef draped over it. He took a might bite, anxious to enjoy the treat.\u003c/p\u003e\n\u003cp\u003eSu Xiaosu also slunk over. She blinked at the Gourmet with big doe eyes and a pathetic expression. The Paragon chuckled and motioned for her to help herself. “I’m not a miserly man. ISn’t that right, Jewelry Master?”\u003c/p\u003e\n\u003cp\u003eLan Jue busily scarfed down the cake. When the Gourmet confronted him again he sighed. A wave of his hand and a bottle appeared.\u003c/p\u003e\n\u003cp\u003eThe bottle looked a little like a clock pendulum. The liquid within caught the light, and glowed with a rich golden hue. The label was just like the Gourmet described; a silver stag’s head. It was definitely flashy.\u003c/p\u003e\n\u003cp\u003eDalmore whisky, among some of the most expensive whisky in the universe. The taste was sublime – on a whole other level than the competition.\u003c/p\u003e\n\u003cp\u003eDalmore whiskies were rarely found on the open market. They were produced in small numbers. Older bottles were especially scarce. The one Lan Jue produced had the number ‘thirty’ written clearly on the label.\u003c/p\u003e\n\u003cp\u003eWhiskies were different from other spirits. They were bottles and sealed at very specific times. The age of a whisky was how long it’d spent aging in barrels before being bottled. The years after bottling didn’t mean anything. Rather like rice wine, the taste became more mellow and savory with time. However, the differences were slight.\u003c/p\u003e\n\u003cp\u003eIn fact, Lan Jue had found crates full of whisky in the hidden cache they’d confiscated. Apparently, that pirate chief was a real fan.\u003c/p\u003e\n\u003cp\u003eA lot of the ancient bottling techniques had been lost to history, and were likely never to be rediscovered. This bottle was one of a treasure trove they’d uncovered, full of a precious liquid most even from Skyfire Avenue have never seen.\u003c/p\u003e\n\u003cp\u003eThe Gourmet picked up the bottle to open it.\u003c/p\u003e\n\u003cp\u003e“Wait, wait! Do you have proper glasses?” Lan Jue cried in a final, desperate gambit. High-class whisky needed the proper glasses to really enjoy. They trapped the spirit’s aroma. That was the only way to fully enjoy it.\u003c/p\u003e\n\u003cp\u003e“Nonsense! As a self-professed glutton, how could I come unprepared?” In a flash, two traditional Scottish whisky glasses were on the table beside the bottle.\u003c/p\u003e\n\u003cp\u003eLan Jue sighed, defeated. He had no recourse but to gnaw of the cake and beef in consolation.\u003c/p\u003e\n\u003cp\u003e“Add another glass!” The Driver’s boisterous voice heralded his arrival. They turned their heads to see the rough-looking man stride their way.\u003c/p\u003e\n\u003cp\u003e“Not cool, you guys! You were gunna drink such a fine bottle without me! Don’t you have any shame?” He roared.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eFight! Come on, fight!\u003c/i\u003e Someone inwardly prayed.\u003c/p\u003e\n\u003cp\u003eUnfortunately, another glass joined the other two. Soon they were sloshing with a sip of golden liquid, enough to cover the glass’ bottom.\u003c/p\u003e\n\u003cp\u003eThe Gourmet then recorked the bottle, and tucked it away in his storage ring.\u003c/p\u003e\n\u003cp\u003e“You’re a thief! Who was just going on about fairness and righteousness and all that?” Lan Jue cried indignantly.\u003c/p\u003e\n\u003cp\u003e“Enough,” the Gourmet coolly remarked. “I wanted this bottle, and was gracious to give you both a taste. There was never any sort of agreement about anything else. What are you doing, slandering me like that?”\u003c/p\u003e\n\u003cp\u003eLan Jue paused, and the anger drained from his face. “Seeing as you’re the senior here, go right ahead.”\u003c/p\u003e\n\u003cp\u003eA spark of surprise lit up the Gourmet’s expression. “You have something better, don’t you?” The Gourmet didn’t see everything in the cache they’d found, only the empty bottle of Dalmore. He didn’t think there might be something better hidden inside. And yet, Lan Jue had been relatively quick to give up this bottle.\u003c/p\u003e\n\u003cp\u003eThe Jewelry Master chuckled sheepishly. “Old bottles of Talisker and Bowmore. \u0026nbsp;What do you think, do they match up to the Dalmore?”\u003c/p\u003e\n\u003cp\u003eBoth of them were fine whiskies, but really they couldn’t match up to a fine Dalmore.\u003c/p\u003e\n\u003cp\u003eThe Driver didn’t involve himself. He snatched up the glass, lifted it to his nose and took a deep breath. He looked enchanted by the aroma.\u003c/p\u003e\n\u003cp\u003eLan Jue and the Gourmet followed his example. They each took a moment to appreciate the smell, then sipped.\u003c/p\u003e\n\u003cp\u003eTheir first reaction to the whisky wasn’t the flavor or texture. It was a pleasant warmth that started in their bellies and spread outward. It took with it the heady flavors and aromas. The sensation was so pure it made the hairs on their arms stand on end.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eNo conflict, damn!\u003c/i\u003e Gabriel sat glumly to one side, his mind still searching for a way out. The alcohol was of no interest him, but the cake was a bit of a distraction.\u003c/p\u003e\n\u003cp\u003eUnfortunately for him, he’d been entirely forgotten by the others. In mere moments, it was all scarfed down by Lan Jue and the others while they enjoyed their drinks.\u003c/p\u003e\n\u003cp\u003e“Well, I’m going to look for the Seamstress,” the Gourmet stated, after he’d finished eating. “I got a message from her earlier. She should be somewhere nearby.”\u003c/p\u003e\n\u003cp\u003ePeople often considered the Seamstress a gentle and soft-spoken lady, but that was only part of her persona. In fact, she was an accomplished mecha pilot – god-ranked. She’d been called Windbreaker during the god battles, and had given them the Monarchs a great deal of trouble piloting Skyshade. She’d hidden her identity so well everyone assumed Windbreaker was a man. She was also the Gourmet’s wife.\u003c/p\u003e\n\u003cp\u003eWith a fine drink in hand and a full belly, of course the Gourmet would want to go find his wife. As he got up and left, the Driver quietly watched him go. When the coast was clear, he scooched closer.\u003c/p\u003e\n\u003cp\u003e“So you got anything better?” He said, looking at his drinking buddy.\u003c/p\u003e\n\u003cp\u003eLan Jue cautiously drew his eyes to the Driver. “What about those cigars I saw you snatch from the cache?”\u003c/p\u003e\n\u003cp\u003e“There’s enough for you! Fair.”\u003c/p\u003e\n\u003cp\u003e”Fine, then it’s agreed! We’ll split it up when we get back,” Lan Jue said with a grin.\u003c/p\u003e\n\u003cp\u003e“I knew you two were up to no good!” There was a flash of light, and the Gourmet reappeared in front of them.\u003c/p\u003e\n\u003cp\u003eThe Driver almost fell out of his chair. “\u003ci\u003eShit!\u003c/i\u003e It’s a trap!”\u003c/p\u003e\n\u003cp\u003eThe Gourmet grunted in irritation. His dark gaze settled on Lan Jue. “Come clean!”\u003c/p\u003e\n\u003cp\u003eLan Jue threw up his hands, entreating silence. “Quiet! There are a lot of people who want this stuff. How about this, when we get back we split it three ways. Everyone gets a fair cut. How’s that sound? And no one hides anything else. But! I would like some Australian lobster. Gourmet, it’s on you.”\u003c/p\u003e\n\u003cp\u003eThe Gourmet’s serious expression melted away and he chuckled. “No problem. Then it’s agreed. I’m off!” He trotted out again.\u003c/p\u003e\n\u003cp\u003eLan Jue and the Driver waited until his back was turned before flagrantly flipping him off. “That nasty old man,” the Driver said, out of earshot. “So treacherous!”\u003c/p\u003e\n\u003cp\u003eLan Jue sighed. “I blame you. If only you could have kept your mouth shut.”\u003c/p\u003e\n\u003cp\u003eGabriel closed his eyes, looking almost pained. \u003ci\u003eThese guys…\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eBlasts were still fierce and often. The fighting had spread out and pirates were being rooted out as they finished their drinks. Star Division’s ships appeared above the holdouts heads and rained death from a safe distance. Every explosion eroded the pirates’ resistance.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-581\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-583\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-582","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
