{"id":56807,"no":585,"title":"Chapter 583: The Death of the Barber","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 583: The Death of the Barber\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe pirates had weapons, certainly, but without the help of a planetary defense system they would never get through an airship’s hull. All they could do was try and survive the beating. They had to watch as their fellow scallywags were reduced to ash.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll of the Star Division soldiers from every brigade were immersed in battle. They were strong together and alone. Whether they fought in groups or on their own, the Star Division soldiers swept away all opposition. Air support watched over them from above.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA day on Moonfiend was roughly sixteen hours long. Eight hours after dawn, when the sun was at its zenith, the sounds of fighting began to subside. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMoonfiend Palace, main control room.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Boss,” Su Xiaosu called, looking at Lan Jue, “it’s more or less finished.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue nodded back at her. They weren’t trying to kill the whole planet. There were too many, and a lot of the population weren’t pirates. Discussions were held on the topic of taking some of these slaves with them. In the end, though, they couldn’t work it out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were too many people. With only the few ships they had, there wasn’t enough space to take them all. Besides, there was nothing to stop pirates from hiding among them as normal folk. It was a recipe for future disaster.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey need a proper military to solve this problem. The Moonfiend Pirates were no more, and the Shattered Starfields no longer had a dominant force. When they returned, Lan Jue would urge the Eastern military to send a few ships and pick them up. It wasn’t unthinkable that they would want to set up an outpost here.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Accountant had been busy these last few hours as well. He’d been busy at the code for the defense system, supplanting their defenses with an encryption program of his own. It was phenomenally complicated, and any would-be hacker would have to get passed it before they could assume control of the system.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Tell people to start packing it up. Time to withdraw. We’re gather on Moonfiend then head out,” Lan Jue told Xiaosu.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Aye.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe battleships they’d captured from the pirates were theirs now, and though they weren’t large enough to take everyone they did afford them more space. The miners, for instance, were undoubtedly innocent victims here. Lan Jue had already ordered the Coffee Master to head to the mines with his new ship and gather them up. Those unfortunate souls who were kept in the Citadel’s prison were also brought aboard. Those two groups alone filled Star Division’s two new battleships.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe battle for Moonfiend was easier than they’d thought. Su Xiaosu’s intimate knowledge of the terrain and enemy forces had been integral. The pirates were sluggish, untrained, and lacked unity. It was a recipe for quick collapse.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course this is not to detract from the skill of the Star Division. Months of excursions have made them a true fighting force. A string of victories had made them confident, and the benefits they reaped solidified their faith in the organization. Despite months of danger, Star Division hadn’t lost a single soldier. It was miraculous, and filled Lan Jue’s men with conviction.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSkyfire Avenue’s young warriors had been tempered in the flames of battle. Lan Jue’s Star Division was made out here among the broken stars. It filled Lan Jue with joy.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Jewelry Master. Jewelry Master, if you’re hearing me, respond.” An urgent voice was calling him from the main monitor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue was stunned for a moment. Xiaosu answered and called up the feed. The Accountant’s anxious face came into view.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What is it, Accountant?” Lan Jue asked inquiringly.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Accountant’s voice was low. “See for yourself.” The sound of his fingers on the keyboard preceded a change of video.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom the picture they could see an expansive asteroid belt. It was surging through pace like a rocky tidal wave. Massive slabs of metallic rock smashed into each other at thousands of kilometers a second. As the space between them filled with debris, faint undulations in reality caught their eye.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What is this?” He asked the distressed hacker.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I have no idea,” the Accountant replied, “that’s what makes it so frightening. At first it just looked like cosmic turbulence. With so many small planets and asteroid fields to get in the way, though, that should be impossible! For safety I think we all need to get out of here right away. We can’t delay.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Got it!” Lan Jue snapped his attention to Xiaosu. “Send out the command, immediate evacuation. Get everyone back as soon as possible, have the ships ready to pick them up.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Aye aye.” The Division’s second-in-command didn’t question or hesitate. This was her first time running into cosmic turbulence. Everything the Accountant said was true, they shouldn’t have anything like that so deep in the Starfields!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu Xiaosu shot to her feet once the orders were given. The Accountant took up remote control of the planet’s systems. She then turned to Lan Jue. “Boss, we need to go too. Mika will bring Zeus-1 around to pick us up.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Alright, let’s go.” The Driver and Xiaosu were on his heels as he walked out of the room. As he passed Gabriel, he muttered, “Are you coming with us or staying here? There’s cosmic turbulence coming this way.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eGabriel, who had until then been sitting quietly with his eyes shut, jumped to his feet. “I’m coming,” he said without a moment’s hesitation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOF course he hadn’t been meditating, though it had appeared that way. The Archangel had been quiet and attentive the whole time. He’d heard the exchange between Lan Jue and the Accountant. He didn’t believe it either, but better to doubt and live. What if it were true? It would mean cosmic turbulence was bringing enough asteroids in its wake to obliterate the whole planet. Moonfiend’s defenses couldn’t contend with that.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe decision to leave with Lan Jue was an easy one. Gabriel was confident from their earlier exchanges that the Star Division commander didn’t have any intention of killing him. It was humiliating, but it was better than dying.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFourth Brigade followed their leaders from the palace, as did the units left behind by First and Second Brigade. The Accountant shut down the defenses around the palace to allow for approach. When Lan Jue stepped out with his people in tow, he was greeted with a landscape of devastation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu Xiaosu’s eyes hardened. She’d built this place through her own effort. It would be strange if she felt joy at watching it burn.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Xiaosu.” Lan Jue put a hand on her shoulder.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe shook her head. “I’m fine, boss, relax. Tearing it down is better than giving it to them.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue smiled supportively. “I like your thinking. You might have lost the Moonfiend Pirates, but you got the Star Division in return. We’re a larger arena for you to showcase your skill.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eXiaosu smiled, and nodded.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere were still people on the street, though much fewer than there had been. He looked in the distance to see a familiar figure.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Her?” Lan Jue muttered in surprise.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003ePurplish-red hair, matching leotard… it was the same beautiful young woman from before.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe others followed his gaze to the woman. The Driver’s eyes in particular lit up. “Nice! I didn’t girls who looked like that were in this pirate hell.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue narrowed his eyes. “I don’t think she’s a pirate. I saw her in Crescent City, then again in Luna. How did she get here?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAt first he’d felt compassionate for the young woman, compelled to help. However, each time he saw her, Lan Jue felt something wasn’t right. He couldn’t say what it was, but the feeling was real.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll take a look.” A figure appeared at Lan Jue’s side. It was one of Skyfire Avenue’s eighteen councilors, the Barber. His eyes were bright, clearly interested in getting a better look at this beauty.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver muttered. “Aren’t you afraid the Beautician will be jealous?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Barber chortled over his shoulder. “There’s nothing between us. She looks down on me. How do you think I’d look if I’m a savior, eh? What do you say, Jewelry Master. Let’s bring her with us. Leaving someone so beautiful here would be a terrible waste.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe didn’t wait for Lan Jue’s permission. The Barber was adept at speed, and was off in a flash.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue could only helplessly shake his head. “This guy. In such a rush…” He stopped mid-sentence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Barber arrived before the woman in a few short moments. Meanwhile, the girl was staring up into the sky, peering at something only she could see. As the Barber appeared she seemed to sense it, and waved at him with her hand.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA ray of blinding red light flashed. In an instant, the Barber was reduced to a cloud of blood. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWhoosh!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e They watched in horror as what remained of the Avenue councilor was sucked into the woman, and vanished.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue, the Driver and the others felt the wave of power from the ray. It washed over them, making every hair on their body stand on end. The tell-tale pressure of someone with a superior Discipline descended upon them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e“Barber!”\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e Lan Jue screamed. He charged. Now he understood why she’d felt so wrong. That power was not something any human could produce.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHow could the terror they felt be produced by any normal person? No wonder she was so unnaturally beautiful, and here alone in a world of pirates.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver and Xiaosu were right behind him. They rushed right for the Barber’s murderer.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe had her head down as she slurped up what remained of her kill. A violet aura rippled around her that seemed to make her brighter.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHer eyes snapped up, and she saw Lan Jue heading her way.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-582\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-584\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-583","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
