{"id":56809,"no":587,"title":"Chapter 585: The Violet Princess","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 585: The Violet Princess\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue knew the failings were not with the sword, but with how much of its power Lan Jue was able to command. The woman lifting her head and looked up at Zeus-1, hovering overhead. Mika had been appraised of the situation. She knew the Barber had been slain by this woman’s hand, and now with her boss out of the way she had a clean line of sight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZeus-1’s main cannon fires a dazzling beam of blue light!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMika knew Lan Jue was in the strike zone at only a hundred meters away. She was counting on his peak cultivation to help him avoid the brunt of the attack.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBoom!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e A thunderous boom resounded. The resulting shockwave sent Lan Jue hurdling away once again. A massive crater where the ship had fired. All the buildings around it had been summarily leveled.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA red flick flickered around Lan Jue – Captus, protecting itself. Even with his constitution shored up by the Banishing Blade, the blast threw him a thousand meters from the crater.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA moment later, a dark red lung spread out over the sky. The crimson hue painted everything around them as rivers of lava tumbled from the heavens. The boiling rock converged on the crater.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Gourmet hovered in the sky, hand in hand with Seamstress. His face was hard and imposing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe ground still trembled from Zeus-1’s blast. The crater it left behind was now a lake of molten lava. Its surface bubbled with poisonous fumes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue recovered from the two blow-backs and rose into the sky. There he hovered and watched his team take on their inhuman opponent. An inexplicable disquiet filled him, though. He suspected the woman wouldn’t be put down so easily.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Coffee Master, Bartender. When you’ve gotten everyone get back in atmosphere and meet up with Majesty. ” Lan Jue shouted the command through his communicator. He was beginning to suspect meeting her here was no accident. He’d felt it in their clash. There was something familiar…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe blinding lights eventually receded. The waves of energy and clouds of dust settled. Clear skies hung over the red-hot lake of lava. But the beautiful woman was nowhere to be seen – like she’d indeed been swallowed up by the lava.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver appeared at Lan Jue’s side. His voice was low and uncertain. “Where the hell did she come from? A Paragon? She didn’t seem like it! I didn’t sense any protogenia.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue frowned. “I don’t know, either. But I feel…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBefore he could explain any further, both men snapped their eyes to the lake. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003ePfoo!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e A figure breached the bubbling stone and shot into the air.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe woman looked angry. A strange frost covered her face, but otherwise she seemed unchanged from the mighty attack. There wasn’t any indication the lava touched her at all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe cast a venomous glare at Lan Jue as she soared higher. Then, she whipped her hand out to swipe at the Gourmet. In the same instant her body erupted in a blinding red light that shot right for Zeus-1.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue’s battleship was shielded, but nevertheless careened out of the way of the red light. Thankfully, its upgraded defenses were comprehensive. The wild evasion maneuvers sent the ship reeling, but Mika’s expert piloting kept them safe and in control.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Gourmet withdrew a meter meters, pulling the Seamstress back with him. He retracted his hand from hers, and traced a circle in the air before him with his arms. Color drained from an extensive patch of reality around him. He thrust his palms forward, inciting a beam of pale-white light to fire out. The beam and the woman’s encroaching palm met halfway.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSilent as the grave, the woman’s arm started to melt when it clashed with the Gourmet’s power. His Domain consumed her like snow in a furnace.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis protogenia was… corrosive? What power was this?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Gourmet’s face changed when he witnessed the effect. A guttural hum vibrated through the air while the grey light poured from the Gourmet like a font. His body adopted a similar ashen-grey hue, and an elaborate crown sat atop his head. The rules of life and death were perverted around the Infernal Vanguard. He pressed the attack, pumping his fist in seven successive strikes to erase the woman entirely.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut the beautiful monster clenched her fist, and punched through. She struck the Gourmet like a lightning bolt. He went flailing through the air, and the grey light of Domain dissipated like a host of spirits.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven the Gourmet, a Paragon in his own right, was no match for her. How strong was she?!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe was given no breathing room, as in the next instant a blast of white light was almost upon her. A roar like some unspeakable beast preceded it; the sound of air being ripped apart as the white light came crashing over her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe woman looked on with wide, shocked eyes. Instinctively her hand shot up.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBoom---!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e The light – a hundred millions sword-strikes as one – hit her like a torrent. Then, it turned around and came back for another pass. She grunted as the violet light surrounding her flared. The aura protected her, forcibly shoving the deadly flood to either side. She lightly stamped her right food, and in response the whole planet trembled.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe white light was scattered and the figure that summoned it staggered back. One moment the white light was searing through the air and the next it was not. She cut it off herself to keep her stability.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was the Pharmacist, appearing in their time of need. The righteous light of Occisus made a nimbus around her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver gaped at her from Lan Jue’s side in complete and utter disbelief.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStar Division’s three mightiest warriors descended upon the woman one after the other, and yet they were still outclassed. It was unlikely she’d summoned the whole of her power yet. And what power it was! Although she was no Paragon, it was the only means of comparison they had, and she was at least of the second degree. Maybe even stronger.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue shot the Driver a telling glance. He knew it meant he was to fall back to the ships. Lan Jue then shot forward to join the Pharmacist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe light of Captus and Occisus flashed and twinkled. They’d were hungry for the destruction of the beast.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe beautiful woman seethed with anger. She glared daggers at Lan Jue and, with a petulant pout, seemed almost resentful. “I didn’t try to eat you! Why do you hit me?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue scowled. The girl seemed to measure her world in what could be eaten.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Who are you?” Lan Jue demanded.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe woman was bewildered by the question. After a moment, however, her resolute answer was given. “The Violet Princess.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The Violet Princess.” Lan Jue stared at her. Princess was a rare title even among humans. Western Alliance royalty saw its frequent usage, but otherwise it was a novelty from the old world.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Is this incorrect? In your human history, is it not proper to refer to your high status females as ‘princess?’” Her words were strange, but she spoke with confidence and fluency.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue’s expression grew only more confused. “Are you not human?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I am,” she said, “and I am not. My people eat yours.” She delivered it as point of fact. And then, she opened her mouth wide…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt stretched grotesquely, revealing rows of razor sharp teeth. She belched a plume of violet air at Lan Jue and the Pharmacist.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHer attacks before were more reactions, self-defense. This time was different. This time there was intent. Her maw stretched over a hundred meters wide, and within swirled a vortex as violent as a black hole.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere it was. Now Lan Jue remembered where he’d felt this before.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAshen pockets of air descended from above. They cut Lan Jue and the Pharmacist off from the Violet Princess’ assault. The Gourmet came down to join his compatriots, but his was not idle. His hands tirelessly contorted into archaic runic shapes while behind him, a gigantic image flickered in and out of reality.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was humanoid in shape, and peering deep into the surrounding darkness one could spy hair the color of bone dust. An ornate black robe concealed its figure, with dim silver light tracing designs cross its surface. He was majestic, imposing, and radiated with the essence of death.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003cspan\u003eHades’ Effigy! A phenomenon of the Reflection of Heaven and Earth! \u003ca id\u003d\"footnoteref-1\" href\u003d\"#footnote-1\"\u003e[1]\u003c/a\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut it was faint, and the effigy unstable. It was evident he hadn’t reached the comprehension needed to master it fully. He was managing with every ounce of effort he could muster.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe nightmarish image behind the Gourmet extended a palm. A world-shuddering terror spilled out like a tide. The Violet Princess whirled and bit at the enormous ashen hand.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe effigy’s light was devoured, but likewise the sea of violet energy within the princess’ maw had also been extinguished.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Withdraw!” The Gourmet grabbed up his two companions and shot into the air.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e But the Violet Princess’ figure shimmered and vanished, reappearing in their path.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Delicious morsels. I can’t let you go.” She mumbled the phrase again and again, like a psychotic mantra. She waved her arms in circles, and the motion birthed an orb of red light. It fired itself at the three of them, a prison of crimson light.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Pharmacist’s first reaction was to bite hard on her tongue. She felt her mouth fill with blood as Occisus’ resplendent light blazed around them. The runes etched on the blade’s surface flickered, while buffeting winds roared. The image of an enormous sword appeared in the air and cut the orb of light in two. It opened enough of an avenue for the Gourmet to pull them into another retreat.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAnother hair-raising sizzle filled the air as Zeus-1 let loose another blast from its main gun. This time everyone could see clearly how she’d avoided the first salvo. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe waved her hand like swatting away a fly. Her aura thickened into a red shell that warded off the blast without a scratch. All it served to do was slow down her pursuit for a few seconds.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut an important fact was revealed. With her speed, dodging it would not be a problem. Instead she took every hit directly. Did she find them so beneath her that dodging was unnecessary?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv class\u003d\"footnotes\"\u003e\n \u003col\u003e\n  \u003cli\u003e\u003cspan id\u003d\"footnote-1\"\u003eReminder; Paragon levels. 1.Realm of Protogenia 2. Reflection of Heaven and Earth 3. Nirvana 4. Unknowable\u003ca href\u003d\"#footnoteref-1\" class\u003d\"btn btn-sm btn-link\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n \u003c/ol\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-584\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-586\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-585","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
