{"id":56810,"no":588,"title":"Chapter 586: The Terrifying Violet Princess","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 586: The Terrifying Violet Princess\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“An alien. Her aura, it’s just like an alien’s!” Lan Jue’s voice wormed into the Pharmacist’s and Gourmet’s ears.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAn alien? An alien this strong?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTheir hearts sank. If this was true the princess chose her name aptly. She would have to be among the strongest of her kind. And if she was here, did that mean there were others?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Violet Princess reeled at Zeus-1. She appeared to have lost patience. Throwing her head back, the alien screamed into the heavens. A pair of wings ripped open her back and spread wide. It was a precursor for an unfathomable scene.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe beautiful face was twisted in a mask of ferocity and anger. Lines of mystifying violet light slithered across her skin, while her body swelled to over three meters tall. Her figure retained its alluring shape, however layers of violet scales slithered out to encase her. She glared at Zeus-1 hovering nearby, then lashed out.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuddenly the sky – no, everything around them changed. Their surroundings became painted violet. The fleeing Division leaders felt sluggish and the air was like moving through soup.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA beam of light erupted from the princess, coalescing into the shape of a mouth intent on swallowing up the airship.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eNo--!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e” Lan Jue screamed, but he was helpless to stop it. He could hardly move in this violet universe. Even Captus’ light was dimmed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKa-cha!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e The crystal-clear click of a shutter hung in the air.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe color palette of their new reality shifted from violet to pale pink. On the heels of that sharp camera shutter came another sound. Awesome and dreadful, the violet light was stopped dead and shattered into a hundred thousand shards of class. Pieces of it glittered as they tumbled from the sky. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZeus-1 fled like a robin from a hawk. It swung dramatically askew in its hurry to flee. Mika was just getting the writhing hellfire around her back under control. She had stared into the jaws of death. A moment later, and everyone onboard would have been smoke and ash.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was unthinkable. Their complicated and daring raid of Moonfiend had gone without a hitch. Only in the final moments, as they made for a victorious departure, did they met with disaster. How could this be? It was outside their ability to predict.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Photographer didn’t either. She’d saved the lives of everyone on that ship, but only just. She wasn’t any more prepared than anyone else.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Violet Princess’ eyes were filled with incredulity. She looked at Luo Xianni with doubt written on her pretty face.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLuo Xianni hovered in midair, with her camera in one hand. She looked back at the princess, eye to eye.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHer sudden arrival made Lan Jue feel like he could breathe again. He called out to his mother. “I think she’s an alien. Only, I don’t know why she looks like a human.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAn alien? When he said the words, the Pharmacist and the Gourmet shuddered. This beautiful woman, an alien? The level of power she displayed would back that up, as would her brutal aura.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLuo Xianni sniffed. She lifted her camera once again. But the Violet Princess sensed something was coming. Her beguiling figure trembled, then vanished. She reappeared in the next instant in front of the Photographer, throwing a fist toward her face.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust as the attack was ready to land, her figure became dim. The princess swiped right through an empty image. The real Paragon was a thousand meters away.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eKa-cha!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e The familiar sound of her shutter came again. The skies went pick, and the Violet Princess felt her movements stiffen.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt didn’t last. A tremendous burst of violet light vented off of her that halted the Photographer’s power. It didn’t extend to the pink skies, but for now the princess evaded becoming a photograph.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEvery onlooker was struck dumb by what they witnessed. They had just seen the Photographer handily transform a battleship into a thin sheet! Apparently, the princess was too strong for even the mighty Paragon to seal away.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Violet Princess thrust with her palms. A tide of violet energy surged from her, threatening to swallow up the vast pink sky. Forlorn humans watched the comforting pale hue began to dissolve. A shimmering figure appeared behind her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was a globe, enormous and violet as the rest of her kind. Despite its hazy image, they could see writhing tentacles lashing around the orb. Its presence boosted the princess’ aura, making it stronger. She was calling on her full power.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eReality crackled where the embattled colors met. Cresting waves of energy filled all the space in between.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Zeus-1, we’re retreating!” The Gourmet said, making the call.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe knew more than most that they couldn’t be around for what was about to happen. This fight wasn’t one any of them could sway in any positive fashion. He was thankful the beast hadn’t used her full power immediately, otherwise it would have been a very short fight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe three of them withdrew as quickly as they could to the waiting airship. They were gathered up the by tractor beam and brought aboard. Lan Jue wasted no time making his way to the captain’s chair and ordering Mika to get them out of there.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe planet’s surface was too dangerous. They would wait for the Photographer in orbit.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMika grit her teeth and navigated them through the tempestuous winds. When she caught a moment of calm air, Zeus-1’s engines flared to life. An impressive wake of flame followed their escape.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue’s face was dark. Coming off their victory over the Moonfiend pirates, everyone had been ecstatic. Now the atmosphere was bleak and somber.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue had seen all kinds of aliens; from progenitor seeds to common beasts. He felt like he had at least a working knowledge of what they were up against. The Violet Princess showed him how wrong he was.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe’d been operating under the assumption that the size of any given alien was proportional to their strength. Humanity was shoring up to steel themselves for a conflict, thinking they need only survive a simple assault. It would come down to a battle of attrition.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Violet Princess changed the game entirely.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe was incredibly strong, seemingly invincible. The Photographer had become a Reflection of Heaven and Earth, and yet all she could do was dissuade the foe. Lan Jue determined that she must not be entirely familiar with her abilities. If she was, she’d have killed them all from the start, because she had the power of a Paragon as strong as Luo Xianni!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-585\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-587\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-586","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
