{"id":56811,"no":589,"title":"Chapter 587: Retreat","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 587: Retreat\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNeither Captus nor Occisus could harm the Violet Princess. She was on a whole other realm of dominance. If there were many like her in her species, then when the battle came…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue thought back to the Clairvoyant and his earliest predictions. If this is what he saw in those visions, he could understand why the situation was so dire.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Did you record the fight?” He asked Mika.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe nodded. “Everything after we arrived.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu Xiaosu interjected, standing nearby. “I have the first part on my communicator.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue’s voice was low. “Clean it up and send a copy to Majesty. Tell them to relay it to the Avenue immediately, highest priority.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Could she just be a powerful Paragon, not an alien?” The Driver said, hesitant to jump to conclusions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue’s lips turned in a bitter smirk. “I hoped so. But her aura, the savagery, her fighting style, the fact she \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eate\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e the Barber… it all confirms my suspicions. We fought the aliens on Tempest. We know they can get into the Starfields. If…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe trailed off when something outside caught his eye. His pupils contracted. “What is that?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe others had been keenly watching when they saw his expression change. They followed his shocked gaze out the bridge window. Instantly their faces matched Lan Jue’s, filled with shock and disbelief.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZeus-1 had shed Moonfiend’s atmosphere, and the vista of outer space was revealed from the airship’s windows. What they saw was the encroaching asteroid hail. Three swirling cyclones of violet energy had appeared among the crashing stones.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey were ten thousand kilometers across at least. From the vantage of their tiny airship, it was a truly spectacular scene. Light stopped at they neared the borders of the vortexes, photons ripped apart. It was apocalyptic.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Accountant’s voice crackled through the bridge’s speakers. “Zeus-1, Zeus-1! This is Majesty. Powerful, unknown energy fluctuations have appeared. Requesting permission to retreat!” His voice was beginning to sound desperate.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Granted,” Lan Jue affirmed. “Majesty and everyone else. Get out as fast as you can, make your way to Skyfire.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Acknowledged. Jewelry Master, are you coming?” The Accountant sounded much relieved by the order to withdraw.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue hesitated for a moment. “Yes, we’re all pulling out.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I anticipated your order and took the liberty of having the Coffee Master and Bartender take their ships back first. They move slower,” the Accountant confessed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“No time for that,” Lan Jue replied. “Everyone needs to get out, immediately.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Aye aye!” The Accountant felt a weight lift from his chest, appearing to have avoided Lan Jue’s wrath. Majesty briefly shed its cloak and twinkled against the dark backdrop of space. The battleship then reengaged its invisibility and headed toward Zeus-1. Mika turned their ship around to prepare for their exit.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m getting in the ejection capsule. Mika, shoot me out,” Lan Jue ordered.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHer head snapped around to look at him. “Boss, you –“\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe narrowed his eyes, catching the words in her throat. He didn’t speak, he didn’t need to. But Mika resolutely shook her head. “No. No!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZeus-1 picked up speed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue’s voice was hard with anger. “So you’re going to force me to disgrace myself? My mother’s down there. You fall back, and I’ll go down to help. After a little while come back to pick us up.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m going too,” the Pharmacist announced.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue shook his head. “You have Jun’er to look after, we can’t risk you. Gourmet, everyone, I’m ordering you to retreat. No one will follow me. You’re all necessary for the war against these aliens. If you believe the Clairvoyant’s predictions, then no harm should come to me. I’ll just be there to support the Photographer as much as I can. Someone needs to be there to record what happens. I’ll make sure to send all the data and keep updates. I’m the only one who can do this. Now don’t worry, my mother’s strong. Even if she can’t defeat the princess, escaping shouldn’t be too difficult. When we’re out of danger, we’ll get in contact.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue was calm. He was addressing the leadership of Star Division.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Pharmacist opened her mouth to protest, but the Gourmet put a hand on her shoulder. “Commander’s orders!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue was a God-ranked mecha pilot, and third strongest in their group. With Zeus’ help he could survive longer out in pace than the Gourmet could. It was clearly the right choice.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue looked at the Gourmet with a grateful eye. He turned and made his way to the ejection pod.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuddenly, a soft voice caught his ear. “Don’t go. Don’t waste your effort, good child.” There was a flicker of pink, and the Photographer appeared on the ship’s deck. Her face was pale and she stumbled, nearly falling but for the support of the Pharmacist beside her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone was relieved to see her, Lan Jue particularly. He rushed to her side.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ma, are you alright?” He asked with deep concern.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe smirked at him. “I won’t die. Let’s get out of here. In all my life I’ve never seen interspatial fluctuations as strong as these – not normal cosmic turbulence. We need to get clear as quick as possible.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMika didn’t need to wait for instructions. When the Photographer appeared she was overjoyed, and wasted no time in pulling Zeus-1 into an escape trajectory.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue returned to the main control console. “Majesty, this is Zeus-1. Release all your probes and get as much data from the surroundings as you can.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Aye aye, Majesty acknowledges!” Came the Accountant’s reply.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBoth ships made their final preparations then beat an escape as fast as their engines could muster. In no time they were tearing through space at the speed of light.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eProbes silently spun in orbit around Moonfiend. Linking eyes watched the surrounding chaos and sent the images back to the Division armada.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the surface of Moonfiend.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA violet shadow was frozen solid. A series of clicks issued from it over and over until suddenly, a burst of violet light erupted from it. The shadow was shattered, revealing none other than the Violet Princess.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was confusion in her eyes. However, the pursed lips and irritated expression spoke to her displeasure. In another circumstance she looked like she might be a beautiful woman irritated with her boyfriend. It was an insidious mask, hiding the terror beneath.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe swirling whirlpools of energy around the planet continued to expand until the asteroid belt threatening Moonfiend was swallowed up and vanished.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-586\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-588\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-587","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
