{"id":56281,"no":59,"title":"Chapter 59","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 59:\u003c/strong\u003e\u003cstrong\u003e The \u003c/strong\u003e\u003cstrong\u003eMoonfiend Empress\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Alright, alright sister. If miss An Liu wants to wait then she can wait.” The pretty voice came from behind, and Lin Guoguo’s slender figure approached to block Mika’s approach.\u003c/p\u003e\n\u003cp\u003eHer body was enveloped in a faint pink aura, making her appear strange and ethereal. Blanketed in this rose light and exuding her trademark sweetness she was like a faerie. Mika’s angry red flames seems to shrinking the face of Lin Guoguo’s presence.\u003c/p\u003e\n\u003cp\u003e“Enough!” Mika huffed, causing the flames around her to leap higher. “Let’s go then. If someone wants to sit and look after the mutt on our doorstep then let them.”\u003c/p\u003e\n\u003cp\u003eLin Guoguo gave An Liu an apologetic look. “I’m very sorry miss An Liu. Mika really does have an awful temper. You shouldn’t take it personally.”\u003c/p\u003e\n\u003cp\u003eAn Liu’s features remained hard and cold, but she nodded her head and moved to the side of Zeus’ Jewelry Store to wait.\u003c/p\u003e\n\u003cp\u003eLin Guoguo then turned to follow Mika inside.\u003c/p\u003e\n\u003cp\u003e“Mika, why is it you get so mad every time you run in to miss An Liu? Didn’t the boss tell you to avoid using your power as much as possible?” Lin Guoguo stood at Mika’s side and spoke no higher than a whisper.\u003c/p\u003e\n\u003cp\u003eMika grunted. “It’s nothing, just looking at that b*tchy face makes me angry. You shouldn’t bother with her either, she’s no good.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIt was a white world. The sky, the ground – everything was washed white. It made everything flat and two dimensional, difficult to judge distance.\u003c/p\u003e\n\u003cp\u003eConfusion was clear in the eyes of the golden hooded man and his six silver-clad cohorts.\u003c/p\u003e\n\u003cp\u003eNone had any clue where they were.\u003c/p\u003e\n\u003cp\u003eAs moonfiend pirates, on their own planet they were the judges and executioners, masters of life and death. As a result they had grown overbearing, arrogant, proud.\u003c/p\u003e\n\u003cp\u003eThis was particularly true for the golden man. He felt, as a ninth-level Adept, he was above the common rabble and their rules. There was very little in his world that could cause him fear. It was this fearlessness that sent him to Skyfire Avenue despite it’s reputation.\u003c/p\u003e\n\u003cp\u003eLan Jue stood as he did before, hands stuffed in to the pocket of his jeans. Though now there was a clear dissatisfaction in his eyes.\u003c/p\u003e\n\u003cp\u003eHe lifted his hand and punched a string of numbers in to the communicator strapped to his wrist. Soon after the connection stuttered to life.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBeep, beep\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003e“Eh? What are you doing calling me? I thought you’d died ages ago.” The voice that wafted through the communicator was soft and quiet.\u003c/p\u003e\n\u003cp\u003e“Your subordinates wanted to tear my shop down,” Lan Jue responded. “I thought I should let you know.”\u003c/p\u003e\n\u003cp\u003e“Huh? You’ve opened a shop, where are you? This poor woman has been looking for you for three years with no luck, so imagine my surprise to hear you’re a shopkeeper. What do you sell?” The woman on the other end sounded as though she’d woken up, her previously lazy intonations becoming clear and sweet. Surprise was also clear in her voice.\u003c/p\u003e\n\u003cp\u003eLan Jue spoke to his wrist. “I was no longer interested in my old life. I just wanted things to be nice and quiet, so I opened a place on Skyfire Avenue. As for the other matter, you should speak with your people.” He removed the communicator from his wrist and handed it to the golden man.\u003c/p\u003e\n\u003cp\u003e“Empress.” The man spoke in to the item with trepidation.\u003c/p\u003e\n\u003cp\u003e“Which one is this?” The sweet and gentle woman’s voice had changed again, this time bearing a chill that cut to the bone.\u003c/p\u003e\n\u003cp\u003e“I’m Gao Yong.” A bitterness crept in to the golden man’s mouth.\u003c/p\u003e\n\u003cp\u003e“What happened,” The woman known as the Empress asked.\u003c/p\u003e\n\u003cp\u003eGao Yong dare not slight his mistress, and so briefly recounted the circumstances.\u003c/p\u003e\n\u003cp\u003e“Alright, very good.” Despite the words, the Moonfiend Empress’ voice had grown markedly chillier.\u003c/p\u003e\n\u003cp\u003e“Empress, that stone is very important. We suspect it holds enormous energy, an energy that hasn’t been tapped in to.” The golden man hurriedly tried to offer his explanation.\u003c/p\u003e\n\u003cp\u003e“And this is your reason for leading men in to Skyfire Avenue?”\u003c/p\u003e\n\u003cp\u003eGao Yong was silent, as if he knew what was to come.\u003c/p\u003e\n\u003cp\u003e“Give the communicator back to that guy,” the Empress snapped.\u003c/p\u003e\n\u003cp\u003eGao Yong lifted his head to look at Lan Lue, who was standing calmly to the side as though nothing had happened. The golden man took a deep breath and, with a dark glint in his eye, took a step forward to stand before Lan Jue. He handed him the communicator.\u003c/p\u003e\n\u003cp\u003e“Would you like to handle this, or should I?” Lan Jue asked indifferently.\u003c/p\u003e\n\u003cp\u003eThe Empress’ sweet voice once more rang from the communicator. “I really never would have imagined in these three years you’d have run off to Skyfire Avenue. It is, in fact, quite a nice place. Thank you, I\u0027ll deal with it.”\u003c/p\u003e\n\u003cp\u003eThe corner of Lan Jue’ mouth curled in to a smile. “I see you’ve finally grown a little conscientious.”\u003c/p\u003e\n\u003cp\u003eThe Empress laughed. “I know you feel for me, you don’t want to weaken my organization.”\u003c/p\u003e\n\u003cp\u003e“Gao Yong,” she barked.\u003c/p\u003e\n\u003cp\u003eThe golden man lifted his head and looked directly at the communicator in Lan Jue’s hand.\u003c/p\u003e\n\u003cp\u003e“In accordance with his wishes you all will cut off one finger and pay him what he asked. Then you’ll get your asses back here. You’ll forget this whole issue with the stone ever happened.”\u003c/p\u003e\n\u003cp\u003eGao Yong stood in stunned silence. Although in his heart he knew it was coming, he almost couldn’t believe it coming from his Empress’ mouth. This was the Moonfiend Empress, destroyer of cities! Arbiter of life and death, with a heart of stone who would shatter any opponent who dared defy her like an uncaring bolt of thunder. Yet in the face of this man before him, she orders a senior general to injure himself. It was beyond belief.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eGao Yong!”\u003c/em\u003e The Empress’ powerful voice burst out.\u003c/p\u003e\n\u003cp\u003e“I \u003cem\u003erefuse!\u003c/em\u003e” he blurted out, his voice full of indignation. Yes, he refused, how could he possibly be convinced to do otherwise.\u003c/p\u003e\n\u003cp\u003e“Empress, I’ve done no wrong. I’ve done nothing but what’s best for the Moonfiend Pirates. How could you treat me like this? You don’t fear disappointing my brothers?” Gao Yong shouted angrily at the communicator in Lan Jue’s hand.\u003c/p\u003e\n\u003cp\u003eThe Empress was silent.\u003c/p\u003e\n\u003cp\u003eLan Jue sighed once more. “Some people are so stupid there isn’t any medicine in the universe that can save them. Empress, let me help you teach them a lesson.”\u003c/p\u003e\n\u003cp\u003eThe Moonfiend Empress sighed as well. “What’s your status on the Avenue?”\u003c/p\u003e\n\u003cp\u003e“Councilman,” Lan Jue replied.\u003c/p\u003e\n\u003cp\u003e“Then I appreciate you taking the trouble,” she said. “Keep that one alive, but the others I leave up to you. If they continue to cause you trouble then deal with the lot.”\u003c/p\u003e\n\u003cp\u003eLan Jue smiled. “So be it. I’ll speak with you later.” He hung up.\u003c/p\u003e\n\u003cp\u003eHis eyes rose to fix upon Gao Yong. “You refuse to submit?”\u003c/p\u003e\n\u003cp\u003eGao Yong glared daggers back at him. “Why should I submit?”\u003c/p\u003e\n\u003cp\u003e“Very well then. I’ll give you all a chance,” Lan Jue said. “Beat me, and you all can leave Skyfire Avenue unmolested.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-58\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-60\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-59","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
