{"id":56821,"no":599,"title":"Chapter 597: The Rejected Driver","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 597: The Rejected Driver\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Seamstress shot Lan Jue a surprised look. “Is he serious? You think he’s got a shot?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTo this, Lan Jue shrugged. “I have no idea. Not as good as he hopes, I’m sure.” As he spoke, he stabbed a small piece of fruit on a fork. He delivered the piece to Qianlin and pressed it gently to her lips. She opened and accepted the morsel.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll the while the Seamstress watched his tender care. “Even now she’s a lucky girl.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue politely chuckled. “How could this be considered lucky? When she wakes up, then we’ll be blessed.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut the Seamstress shook her head. “Sometimes it’s dangerous to think on what it is to be ‘really blessed.’ Take yourself, for example. You’re better now than ever before, is this not because of hardships? The Wine Master and the others pile tremendous pressure on your shoulders. Do you think they don’t worry about you, how you’ll hold up?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue smirked and rubbed his upper arm. “Well, that’s because in their eyes I can handle it. It’s fine, don’t worry. I can definitely manage what’s going on. There’s just so much outside of our control. Even if we do know the right decision now, there are so many elements that could completely change the trend of events.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“The Gourmet told me what happened with Parliament,” she replied, changing the subject. “Did they really dismiss your suggestion?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue shrugged. “I hope they come up with something better. I’ve been thinking, but up to this point I can’t figure any other way to face to the alien threat. They’re too strong.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Seamstress nodded, fear evident in her gaze. “We’ve yet to experience the full might of these invaders. Your determinations seem sound; they absorb energy to make themselves stronger. It’s a terrifying prospect.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue nodded slightly. “None of this matters now, our only option is to face what comes our way. “Where is the Gourmet? You didn’t invite him?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe replied through a smile. “He also feels the impending crisis, and has sequestered himself for meditation. He said he needs to firm up his cultivation.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue chuckled. “Here I only thought we young’uns got that ominous sense. The Gourmet feels it, too! That’s good. I need to do the same. Right now there’s nothing more important than strength. When humanity really starts to feel the aggression of our alien enemy, the only one you can rely on for protection is yourself.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Not just him, we all feel it,” the Seamstress assured. “You know I’ve never been much for cultivating, but I’ve put more effort into it myself. I was speaking with the Driver today about closing the shop and participating in the Division training full time. What’s your plan for the troops in the future?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStar Division’s commander shook his head. “Right now I have no plan. I have to see how the situation plays out. We were out for a while as well, and learned a lot. We’ll need time to process and decide on our next move. We’ll use the resources we acquired to strengthen the Division, while the troops use this time of peace to prepare their minds and bodies for the next task. Originally I’d thought about going to An Lun and joining the process there, but it seems like staying close by is a better decision. We have no idea when – or where – those aliens are going to show up.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo one need to worry about An Lun. With Jue Di there, the Violet Princess herself wouldn’t be able to take it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Seamstress rejoined. “I think that’s the right call. Step by step, assessing the situation as we go along. A better decision can be made when we learn more from the Shattered Starfields.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe sounds of footsteps outside caught their attention. The Driver’s gloomy face was revealed when he pulled the door open. He shot Lan Jue a loathsome look, then pulled off his jacket and poured himself a drink. The Driver promptly empties the glass.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo one needed to ask, the answer was written clear on his face. He’d been turned down. The Seamstress was no fool and recognized it right away. She opened a fresh thermos of hot water and poured each of them a glass.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I don’t get it. What the hell is so good about you? Pretty, capable women just flock around you. Meanwhile, I can’t find one for myself. Someone tell me, what the hell is going on! You have a woman, stop hogging all the others, alright?” The Driver bitterly complained.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue sighed. “You think I don’t worry about that? I don’t want to steal their youths, either, but if I even bring it up they threaten to commit suicide or some nonsense. What am I supposed to do? All I can do is let it be, and hope they find someone for themselves.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver scowled. “Oh come on. How much time have they spent with you? How are they supposed to find a replacement?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis made the Jewelry Master smirk. “So you’re saying you can’t match up?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver sniffed derisively. “Bullshit. I’m a hell of a lot manlier than you.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003cspan\u003eLan Jue rapped his knuckles against his whisky glass. “Last I checked your Discipline was yin-based. I dunno how manly that is.” \u003ca id\u003d\"footnoteref-1\" href\u003d\"#footnote-1\"\u003e[1]\u003c/a\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver gaped at him for a long moment before coming up with a response. “Well, every cloud has a silver lining, right?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“So Su Xiaosu outright rejected you,” Lan Jue said, shifting gears. “What did you say to her?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I walked in, and I said to her ‘I like you.’ Then I asked if she’d be my girlfriend.” The Driver was to the point.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Seamstress smiled at her friend. “Just like your soldiers – you only know the blunt method. Try a little finesse, won’t you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver sat straight. “Adepts at our level have hearts like mirrors. What’s the point of ‘finesse’? Would you rather relationships were like the normal folk, all those games and nonsense? I’m not interested in any of that. If we’re good, we’re good. IF we’re not, we’re not. Simple and direct is my style. If I’m rejected, I won’t give it another thought.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHere, he swung his eyes over to Lan Jue. “She told me she’s only interested in staying in the jewelry shop. She said she wasn’t interested in taking a partner, ever. She only wanted to be your assistant and serve at your side.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue slapped his forehead, screwing tight his eyes. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eSo be it, another one.\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What’s your plan for these women? Keep them as slaves? Continue to order them about?” The Driver asked, ill-tempered.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“They are not slaves,” Lan Jue protested. “They’re employees, and in fact they have more stock in the store than I do. Can you call that slavery? As for what I’m going to do, I have no idea. They’re married to this idea of paying me back and that’s why they stick around. Plus, everyone one of them has complicated backstories. Skyfire Avenue is the best fit for what they need, I can’t just turn them away. If I did, I’d have to go with them.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“There’s nothing pleasant about drinking with you!” The Driver murmured into his glass. “I could do great things and still never find a girl.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue frowned at him. “It doesn’t help that you don’t take good care of your appearance. Charitable deeds also bring good karma.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver changed the subject. “Ah, right. There’s something I need to talk with you about. Should we continue to try and join the yin and yang forms of lightning, like we did? If it succeeds we’ll both benefit a lot. It’ll make cultivating faster too, I’m sure.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You’ve got that ominous feeling too, eh?” Lan Jue asked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You’re damn right,” he said. “You don’t have a sour outlook after almost dying to that thing? We clearly don’t have what it takes to face the aliens as we are now. IF we don’t work hard to get better, what hope do we have?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue hesitated. “Right now Qianlin and I are cultivating together. This is why I haven’t sought you out to cultivate. I don’t know if we can join the two kinds of lightning while I’m joined with her. It would be a dangerous thing to attempt.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver shrugged. “Why don’t we go to the Wine Master’s Reaper Arena? We can give it a try. If it helps, great. Otherwise we’ve lost nothing.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue pondered for a moment. “Alright, but the Reaper Arena isn’t guaranteed to be safe. His pocket dimensions can’t handle protogenia, and if we succeed you can bet there will be a lot of that flying around. Wherever we go has to be capable of handling protogenic current. I’ll ask my mother, she should be able to find a place with no risk at all.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver slapped the table. “Excellent. Drink!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe two of them ate fruit and ham, talking as they worked their way through the whisky bottle. It was gone in no time. The Driver was eager to open another but Lan Jue stopped him by shaking his head. “No more for me, one should know when to stop. Tomorrow morning I’ll come and get you, we’ll give it a shot.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Alright,” he replied.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe bid farewell to the Seamstress, then Lan Jue and Zhou Qianlin stepped out of the tailor shop. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe had neglected the special relationship between his and the Drivers’ Disciplines. His speed and quality of cultivation had been tremendous after joining with Qianlin. Then, with the addition of the Banishing Blades he had more than he could handle, much less explore other avenues.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver’s insistence reminded him of something his father said once. That yin and yang lightning joined could create an incredibly potent – and dangerous – thunderbolt. Jue Di’s hope had been that Lan Jue would find a wife with a yin-skewed Thunderbolt Discipline. That would have been best.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow that was not an option, he already found Zhou Qianlin. What he was interested in discovering most of all, was whether or not he and Qianlin could successfully cultivate with another while already joined.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt wasn’t like he could just dump her either, and practice with the Driver alone. Lan Jue wanted to cross the threshold of Paragon with her together. Working separately would only increase the gap between them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe would ask dad!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue returned to the shop and turned on the holographic projection system in his quarters. He attempted to connect with Lan Qing. After a few moment, the projector’s lights flickered and Lan Qing appeared in full military regalia.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s so late, what is it?” Lan Qing asked in his simple fashion.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Brother,” Lan Jue began. “I’m looking for dad. Is he around?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv class\u003d\"footnotes\"\u003e\n \u003col\u003e\n  \u003cli\u003e\u003cspan id\u003d\"footnote-1\"\u003eThe Driver describes himself as 阳刚, or ‘manly.’ It shared the same 阳 character as 阴阳. Lan Jue asked ‘where’s the yang?’\u003ca href\u003d\"#footnoteref-1\" class\u003d\"btn btn-sm btn-link\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n \u003c/ol\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-596\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-598\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-597","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
