{"id":56838,"no":616,"title":"Chapter 614: Vairocana!","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 614: Vairocana!\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eObviously the giant Buddha was the image of Lan Qing’s dharma. Suddenly, Lan Jue’s eyes filled with shock. He had also suffered Jue Di’s edification, and it’d prepared him with a working knowledge of the ancient Buddhist faith.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is… Vairocana dharmakaya [1. \u003c/span\u003e\u003ca href\u003d\"https://en.wikipedia.org/wiki/Vairocana\"\u003e\u003cspan style\u003d\"\"\u003eThe Buddha\u003c/span\u003e\u003c/a\u003e\u003cspan style\u003d\"\"\u003e who represents the true form, present in all things. The ‘dharma body’.]! How is this possible?” Jun Yongye’s voice was in Lan Jue’s ear, absent his usual calm. His audible shock confirmed Lan Jue’s suspicions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eVairocana was one of the primary buddhas of the ancient faith. He bore a status higher than any other. He was the dharmakaya, the true body of the Buddha. As a primordial Buddha he was a founding pillar upon which the faith rested, and sat at the center of the five wisdoms.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Pauper remained cross-legged on the floor, and a golden aura flickered around his body. Everything about him seemed to change as the image of the Taming Dragon Arhat revealed itself. He pressed his hands together in respect toward the image of Vairocana.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue looked up at his brother with a tight smile. \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBrother, is it wise to play at such great power? How am I supposed to catch up?!\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing had been paused at the peak of ninth level for a long while, three years so far as Lan Jue could remember. In that time he had purified himself, perfected himself to reveal the scene they witnessed now. His brother leapt passed the first degree of Paragon to immediately become a Reflection of Heaven and Earth. And most amazing of all, his dharma followed Vairocana Buddha!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How… how is this possible?” Jun Yongye’s startled voice continued to demand.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue replied. “Why shouldn’t it be possible? What’s the problem?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA bitter mirth crept into Jun Yongye’s voice. “Problem? There’s a big problem. Do you know what it meant in the old days to coalesce the image of the dharmkaya?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What does it mean?” He asked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s the reincarnation of the Budda.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wha…” Lan Jue’s eyes went wide. “That… isn’t real, is it? You’re saying my brother is the reincarnation of the Buddha? What about me?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Its impossibility is precisely why I find it strange!” Jun Yongye blithely commented. “The ancient faith has its roots in the oldest days. They hold that a Buddha has three kayas – bodies. All together they are nirmanakaya, or the physical body; sambhogakaya, their limitless spirit; and dharmakaya, the fundamental truth and our connection to it. Vairocana represents the last, and the most powerful. However, to my knowledge the Pure Lands of the buddhas disappeared when the realm of immortals did. How can we have a reincarnation if they no longer exist? It must have been latent in his blood, awakened once his cultivation was strong enough. It makes sense, but never would I have imagined that bloodline would be Vairocana dharmakaya. He has summoned the might of the greatest of buddhas. If he can step into the Womb Realm, then he will be as indomitable as the immortals who came before.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue’s own smirk spread wider. “So what sort of dharma do I need if I want to surpass my brother?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJun Yongye flatly began to list his options. “\u003c/span\u003e\u003ca href\u003d\"https://en.wikipedia.org/wiki/Yuanshi_Tianzun\"\u003e\u003cspan style\u003d\"\"\u003eCelestial Master Yuan Shi\u003c/span\u003e\u003c/a\u003e\u003cspan style\u003d\"\"\u003e, \u003c/span\u003e\u003ca href\u003d\"https://en.wikipedia.org/wiki/Lingbao_Tianzun\"\u003e\u003cspan style\u003d\"\"\u003eCelestial Master Lingbao\u003c/span\u003e\u003c/a\u003e\u003cspan style\u003d\"\"\u003e, or \u003c/span\u003e\u003ca href\u003d\"https://en.wikipedia.org/wiki/Daode_Tianzun\"\u003e\u003cspan style\u003d\"\"\u003eCelestial Master Daode\u003c/span\u003e\u003c/a\u003e\u003cspan style\u003d\"\"\u003e. No less than one of the three Pure Ones, or perhaps one of the Great Emperors. Enough of that nonsense. I return to sleep. I require silence.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe sword-spirit’s reaction spoke volumes as to what Lan Qing was accomplishing. The other Paragons also looked on in stunned silence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuspended in air, Lan Qing slowly opened his eyes. They shimmered with a warm golden light. Through a small smile, the super soldier continued to deliver chants and charms. Gradually he slipped backward into the image of the Buddha behind him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eVairocana’s eye’s opened, and his hands opened in a sign of acceptance. The whole base shook with a deep, throaty hum. Everyone below was awakened from their insights just as the great Buddha became a column of golden light. Its ubiquitous glow hung over all of them for a long time before fading away.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen it did, Lan Qing appeared seated on the field among them. Only an hour had passed, but he seemed like an entirely different person. The chilly exterior was gone, replaced with an ineffable kindness.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eAh-hahaha!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e Ahh \u003c/span\u003e\u003ca href\u003d\"https://en.wikipedia.org/wiki/Gautama_Buddha\"\u003e\u003cspan style\u003d\"\"\u003eGautama\u003c/span\u003e\u003c/a\u003e\u003cspan style\u003d\"\"\u003e, Gautama… I bet you didn’t guess my son would create your dharmakaya! It’s too much, oh it’s hilarious!” Jue Di’s booming laughter would be heard by the Pure Ones themselves if they still existed. He looked like he was on the verge of dancing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing simply smiled. He arose, only to turn toward Jue Di and bow. “I thank you father, for my success.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJue Di waved away the appreciation. “This had nothing to do with me, only your own hard work. You still need to stabilize your dharma, continue to gain insight into the nature of protogenia.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes,” Lan Qing replied respectfully.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe other Paragons gathered round. The Wine Master full of praise and admiration. “Congratulations, Fleet Admiral Lan.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Photographer made no effort to hide the beaming pride in her face. She lunged forward and wrapped him in a hug. “Good boy, you have a lot of promise. Right to the dharma, heh. That’s really something.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Clockmaker and Pauper in turn offered their congratulations to the new Paragon. Lan Jue met him with a helpless expression. “You’re not leaving me with a lot of opportunity here,” he complained.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis brother smiled softly. “You speak of opportunities. Everyone had their own path to follow. Do you know why I always work so hard?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Why?” \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Because when we were young, father always said my Talent was inferior to yours,” Lan Qing revealed. “If I didn’t always work hard, you would quickly get better than me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue turned shocked eyes to Jue Di. “Is that true?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJue Di shrugged. “Of course. If you put forth half the effort your brother did we wouldn’t still be waiting for you to make your own breakthrough.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Clockmaker, Wine Master and Pauper felt uncomfortable being privy to the conversation. Was this man incapable of simply having a nice chat? How old was he…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course, none of them dared open their mouth in protest. The results of his parenting were right in front of them – Lan Qing was the youngest Paragon ever known, much less the youngest to become a Reflection of Heaven and Earth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Pauper looked around. “I’m afraid they’re really going to need to reorder the Paragon list. Admiral Lan, how shall we address you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing shook his head and looked at his father. “I haven’t been able to pick one. I was hoping father could help me decide.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003cspan\u003e“How about Siddhartha \u003ca id\u003d\"footnoteref-2\" href\u003d\"#footnote-2\"\u003e[2]\u003c/a\u003e,” Jue Di offered.\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone looked at him in abashed powerlessness…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing forced a smile.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue chuckled and interjected. “Dad, let’s settle on something a little more standard, you know…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJue Di grunted. “How is this not up to standard? We’ve got the Pope, Satan even. Why shouldn’t he be called Siddhartha?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue was quickly losing ground. “Do you ever want grandchildren? What woman will sleep with him if he’s got a name like Siddhartha?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJue Di clearly had less than savory reasons for choosing the name, but he stuck to them. “There’s a reason. But remember kid, you’ve created the image of the Buddha, you aren’t really his reincarnation. Don’t let it influence our next generation!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA tinge of embarrassment crept into Lan Qing’s face. “Father, I’ve barely had time to deal with my own things. It’s been so busy, I can’t even –“\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Sooner or later.” Jue Di didn’t frame it as an option. “Now that you’re a Paragon you’ll notice difference. Thirty years will pass and you’ll hardly seem different at all, but that doesn’t give you license to keep me waiting! If you come across a good opportunity you grab it kid, you hear me? A-Jue, you’ve got all those pretty girls around you, find one suitable for your brother.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue shrunk under the instruction. “I am a pure man, alright! Anyway it’s easy to find the right match for him. Any girl that can run three circuits around the planet has what it takes.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing chuckled. “Stop your nonsense.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJue Di interrupted. “Alright, A-Qing go rest. Stabilize your dharma as quickly as you can. You skipped a grade so you’re bound to have weaknesses in your foundation. You’ll need to discover what you’re lacking quickly.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Yes,” he answered.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue slithered up to Jue Di’s side. “Now that you’ve taught my brother the dharma of Vairocana what am I supposed to do? Don’t let him go yet, he still hasn’t decided on a name.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJue Di slapped a hand against his forehead. “It’s age, I’m getting amnesia.” Both Lan Jue and Lan Qing looked at their father with sharp eyes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLuo Xianni tittered. “Alright, you two don’t worry over nothing. He’s as strong as a dragon and as nasty-tempered as a tiger. He’s never dying.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJue Di’s face went slightly red. “Woman, have you never learned the word restraint?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSne sniffed derisively. “This old lady was plenty restrained when she was younger. It was a waste of time. Now pick a name for your son, alright? If you don’t then I will.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJue Di pondered for a moment. “Vairocana separates the darkness from the light. He gives rise to the beasts of the earth. His light neither gives life nor takes it away, and his brilliance blazes brighter than the sun. Thus he is also named the Light of Wisdom or the Radiant Light. This light covers and embraces all things through time and space, through morality it binds them. It is as inseparable as day is to night, and its bounty is delivered to all the myriad sentient and non-sentient things of the universe. As the foundation of Buddhist faith, it is beautiful. The ‘\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eCommentaries of the \u003c/span\u003e\u003c/i\u003e\u003ca href\u003d\"https://en.wikipedia.org/wiki/Mahavairocana_Tantra\"\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eMahavairocana Tantra\u003c/span\u003e\u003c/i\u003e\u003c/a\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003e’\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e states, ‘When the Light of Wisdom shines on the realms, the roots of virtue will grow and all endeavors shall succeed.’”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe paused for a moment, then continued. “If you insist that A-Qing’s name cannot surpass the Buddha’s, then we shall call him the Peerless Light.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Peerless Light? The thought it strange at first, but the name instantly called to mind the luminescence that had poured from Lan Qing during his breakthrough, and the bounty he delivered unto An Lun. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“No, that doesn’t sound any good.” Luo Xianni complained. “Peerless Light, might as well be ‘I am Awesome.’ That’s not suitable at all, can’t you think of something that sounds better?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJue Di narrowed his eyes. “Sounds better? You think of one, then.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It at least has to do with his dharma,” she snapped. “I don’t know, how about the Warrior Buddha? Or maybe ‘Great Sage, the Equal of Heaven.’ How do those sound, \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eJue Di\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e\u003cspan\u003e.” \u003ca id\u003d\"footnoteref-1\" href\u003d\"#footnote-1\"\u003e[1]\u003c/a\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJue Di grunted. “Not my ideas.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWarrior Monk? Great Sage, Equal to Heaven? When they heard the names the other Paragons froze. For the first time they were beginning to get a glimpse into Jue Di’s dharma. [3. As a bonus, here’s a trailer for a movie called \u003c/span\u003e\u003ca href\u003d\"https://www.youtube.com/watch?v\u003dVQoMf9P-Q8U\"\u003e\u003cspan style\u003d\"\"\u003eWinning Monk\u003c/span\u003e\u003c/a\u003e\u003cspan style\u003d\"\"\u003e (same characters as warrior monk) that looks \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eflippin awesome.\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e]\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv class\u003d\"footnotes\"\u003e\n \u003col\u003e\n  \u003cli\u003e\u003cspan id\u003d\"footnote-2\"\u003eThe human name of the founder of Buddhiasm, later to become Gautama Buddha.\u003ca href\u003d\"#footnoteref-2\" class\u003d\"btn btn-sm btn-link\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n  \u003cli\u003e\u003cspan id\u003d\"footnote-1\"\u003eThis is a snide joke – or maybe not. The warrior Buddha was one of the trials faced by the Monkey King in the Journey to the West. The second title, ‘Great Sage, Equal to Heaven’ was the title the Monkey King gave himself to piss off all the immortals.\u003ca href\u003d\"#footnoteref-1\" class\u003d\"btn btn-sm btn-link\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n \u003c/ol\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-613\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-615\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-614","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
