{"id":56847,"no":625,"title":"Chapter 623: Primordial Lightning","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 623: Primordial Lightning\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe Driver benefited tremendously from the practice. Although the thunder essence was absorbed by Lan Jue, a small amount of it was transferred to him through their shared cultivation. Just that small amount helped to create a foundation that would support his rise to Paragon. It helped him to discover his own Path.\u003c/p\u003e\n\u003cp\u003eLan Jue’s quantifiable strength didn’t improve much, though he had been actively trying to curtail the speed of his improvement. Star Division’s commander was focused on purification of the energy rather than accumulation of it.\u003c/p\u003e\n\u003cp\u003eJue Di helped his son navigate the intricacies of his own path to Paragon. Lan Jue was calmer, which aided his cultivation. Currently their problem was Qianlin. If they were intended to break through together, how was that possible? Qianlin didn’t have the presence of mind to seek her Path. His only recourse was to stop his progress and await the happy day got back to normal.\u003c/p\u003e\n\u003cp\u003e“All set!” The Wine Master’s voice was calm, and his face lit up in self-appreciation. He’d clearly succeeded.\u003c/p\u003e\n\u003cp\u003eLan Jue peered through the window at the expanse of barren mountains. “Where?”\u003c/p\u003e\n\u003cp\u003e“If you could \u003ci\u003esee\u003c/i\u003e it, it wouldn’t be very hidden from aliens would it,” the Wine Master snapped. “I used dimensional fragmentation to hide them.”\u003c/p\u003e\n\u003cp\u003e“Does it need to be tested?” Lan Jue asked.\u003c/p\u003e\n\u003cp\u003eThe Wine Master stared at him. “Testing would require an s-ranked interdimensional power gem. Relax, my aunt and I have checked it several times, and tried with a small amount of energy. There won’t be a problem. If you want to try it, wait until we need to use it.”\u003c/p\u003e\n\u003cp\u003e“Fine,” he replied. “So we should prepare to leave.”\u003c/p\u003e\n\u003cp\u003eThe Wine Master nodded. “That’s right, there’s no time to waste. We’ve been held up here for ten days, and we have a lot we still need to learn. Right, did the unmanned information drones get back ok?”\u003c/p\u003e\n\u003cp\u003eLan Jue’s brows knit together when he thought of them. “They didn’t. I don’t think there’s a way for us to send information back alone. There are many dangers in the Starfields and no human consciousness to guide them. Then there are the aliens to consider. UAVs can’t cloak. Altogether it starts to look unlikely drones will be much help to us.”\u003c/p\u003e\n\u003cp\u003e“Then we just need to make sure we get what we can and bring it back quick.” The Wine Master said.\u003c/p\u003e\n\u003cp\u003eTwenty minutes later, Zeus-1 was in the air. IT shop off toward the alien planets, leaving a column of diffused light in its wake.\u003c/p\u003e\n\u003cp\u003eThey abandoned their circuitous right for something more direct. He ordered Mika and Xiaosu to bring them to the Starfield’s heart as quickly as they could. Caution could be relaxed now that their safety was assured.\u003c/p\u003e\n\u003cp\u003e“Boss, aliens have appeared on our radar, three of them. They’ll be within range in twenty minutes. Should we use the pulse to cover ourselves?” Xiaosu asked.\u003c/p\u003e\n\u003cp\u003eLan Jue shook his head. “No need. Who wants to deal with them?”\u003c/p\u003e\n\u003cp\u003eThe Taming Dragon Arhat curiously looked his way. “You don’t want to keep your distance? It could call others.”\u003c/p\u003e\n\u003cp\u003eLan Jue smirked. “Orders have changed – we’re a Fire Scout troop. We hit the enemy and record how they react. No more need for stealth.”\u003c/p\u003e\n\u003cp\u003eThe Wine Master frowned. “It’s a little early, no?”\u003c/p\u003e\n\u003cp\u003eLan Jue looked his way. “I’m not saying we’re rushing in. Its fine, your responsibility is to help us lock the aliens down if we need it. Guoguo, you should prepare. Wait for our order.”\u003c/p\u003e\n\u003cp\u003e“Aye,” in Guoguo replied. The helmet she used to connect with the ship was already descending onto her head.\u003c/p\u003e\n\u003cp\u003e“I’ll go!” The Driver stood, eager to jump at the chance.\u003c/p\u003e\n\u003cp\u003e“Alright.” Lan Jue nodded his way.\u003c/p\u003e\n\u003cp\u003eThe Driver was thrilled with the power coursing through him. Even at an eighth-rank Adept he felt like he was improving markedly every day. Once he completed the transformation of his Discipline he would be at peak level. Poised to become a Paragon.\u003c/p\u003e\n\u003cp\u003eFrom the ship’s windows they could see three figures separate from the darkness of space. They were the aliens, each one a least a hundred meters long. The two on either side had long black bodies, and purple depression all over them. They looked particularly fierce, but were approaching at only a moderate pace.\u003c/p\u003e\n\u003cp\u003e“A swordfish and two Reefs.” Su Xiaosu shouted the report over her shoulder. They’d seen these kinds before.\u003c/p\u003e\n\u003cp\u003eThe alien they called the ‘swordfish’ was a warrior of their species. It was going slow now, but they’d seen what it was capable of. IT was actually one of the fastest aliens they’d encountered. Tactically it approached problems simply, with a full-on rush. It attacked with mad ferocity, in attempts to overwhelm its foe.\u003c/p\u003e\n\u003cp\u003eThey saw one drill a perfectly smooth hole through a one-kilometer long asteroid, and pass through like it wasn’t there. Lan Jue determined that the worst place to be was right in front of one of those things. Even a Paragon might not be able to take a direct hit.\u003c/p\u003e\n\u003cp\u003eThe two ‘Reefs’ as they called them, weren’t terribly friendly either. The divots on their body shot out destructive light that protected them within a range of twenty kilometers. They dissolved and consumed whatever they touched. If they struck anything organic, it was destroyed and absorbed immediately.\u003c/p\u003e\n\u003cp\u003eThey were strong, and when facing three the Driver only had one option; get in close and put them down before they had a chance to respond.\u003c/p\u003e\n\u003cp\u003eThunderclap appeared in the vacuous depths of space, hidden by a hundred-meter long asteroid. Its glimmering spear was clutched in its hand, waiting.\u003c/p\u003e\n\u003cp\u003eFrom experience they knew these aliens could extend their perception up to ten kilometers and maintain it. You had to be close already if you wanted to avoid detection.\u003c/p\u003e\n\u003cp\u003eThe light around Thunderclap’s spear began to change, turning from silver to a translucent purple. The spear’s shaft was clear as crystal. A purple light also flashed in the mecha’s eyes. Compared to the last alien he fought, his battle experience had risen to a new level.\u003c/p\u003e\n\u003cp\u003eThe aliens were closing in, twenty kilometers from Thunderclap’s location. The Driver burst into motion. The mecha lifted its hand and slapped the surface of the asteroid. Tons of space stone went hurdling toward an inevitable collision with the beasts\u003c/p\u003e\n\u003cp\u003eSwordfish reacted fastest. It swerved just enough to put it in line with the asteroid. Then, when the two met, the clash turned the asteroid into a cloud of debris.\u003c/p\u003e\n\u003cp\u003eHowever, at that same moment there was a flash of purple. Thunderclap appeared beside the alien, then vanished in a blinding eruption of purple light!\u003c/p\u003e\n\u003cp\u003eFast as lightning, loud as thunder; it perfectly explained the Driver’s trademark fighting style. He flashed in close then let them have it with his thunderbolt Discipline. Only, this time it was his taiyin thunderbolt he was using. The yin-yang lightning had evolved it into an empowered purple adaptation.\u003c/p\u003e\n\u003cp\u003eThe Driver had listened to all these old sorts of powers from the ancient world that kept getting discussed. He settled on his own name for his unique variant – primordial lightning. It was nowhere near as destructive as the real stuff, but it looked like it.\u003c/p\u003e\n\u003cp\u003eFrom their vantage on Zeus-1, the purple light seemed hazy and small. However, it was a large enough explosion to engulf all three aliens.\u003c/p\u003e\n\u003cp\u003eThey were stunned, but the initial attack had failed to destroy them outright. Instead they grew sluggish like they were trying to swim through soup. Especially swordfish, it struggled and lashed from side to side to try and free itself to no avail. No matter what it did, it couldn’t rid itself of the confining purple light.\u003c/p\u003e\n\u003cp\u003eAll three of the creatures melted away beneath the force of the blast. They were dissolved, they were purified.\u003c/p\u003e\n\u003cp\u003eThunderclap spun like a top, and the primordial lightning became a vortex of destruction in response. The remains of the creatures were sucked into its depths and devoured.\u003c/p\u003e\n\u003cp\u003eThe Taming Dragon Arhat \u0026nbsp;watched with surprise. “When did this guy get so strong? What is that purple lightning?”\u003c/p\u003e\n\u003cp\u003eLan Jue smiled. “He calls it ‘primordial lightning,’ I guess that’s its name.”\u003c/p\u003e\n\u003cp\u003eMany average Adepts probably weren’t familiar with the concept of primordial lightning, but the Pauper had the blood of the Taming Dragon Arhat [1. There’s probably another name for it somewhere, but this is one of the Five Thunders in Daoist thunder magic. Specifically, he is using the lightning created by the natural laws of the universe, hence primordial. The other kinds of lightning come from heaven, the gods, and so forth. All of them seem particularly suited to combat Buddhist immortals.]. He had quite a wealth of knowledge regarding the old world.\u003c/p\u003e\n\u003cp\u003e“Nature’s primordial lightning? He’s got some gall! Honestly, though, his Discipline has reached an almost protogenic level. He isn’t even a Paragon, how is it he’s able to control something this powerful? In a straight fight I’d need to fight my hardest to beat him.”\u003c/p\u003e\n\u003cp\u003eLan Jue looked at his friend with a mischievous, instigating grin. “You should give it a try when we get back.”\u003c/p\u003e\n\u003cp\u003eThe Pauper chuckled, but didn’t fall for it. “We’ll see.”\u003c/p\u003e\n\u003cp\u003eThunderclap made its way back to the ship, bearing three more vital crystals for their collection. However, the Driver didn’t dock. Instead he coaxed the mecha to the front of Zeus-1 and hovered in front of the windows.\u003c/p\u003e\n\u003cp\u003e“Whadda ya think? That primordial lightning is something else, right?” The Driver’s arrogant voice crackled through the ship’s speakers.\u003c/p\u003e\n\u003cp\u003eThe Wine Master called back. “Your lightning can inhibit the aliens. The swordfish and reefs are strong, but they didn’t have a chance to fight back. It was like your lightning froze them up.”\u003c/p\u003e\n\u003cp\u003eA chuckle was returned. “Of course, it’s the primordial lightning. The seventy-two primordial lightnings that could kill immortals!”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-622\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-624\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-623","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
