{"id":56871,"no":649,"title":"Chapter 647: I Swear","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 647: I Swear\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA bitter pain stabbed at the Phantom’s chest. She’d had the gall to infiltrate Skyfire Avenue because she thought only the Epochrion was a problem. She was the only Reflection of Heaven and Earth, and thus the only one who could pose a threat. The other Paragons mostly new to their powers. Under those conditions fleeing wouldn’t have been difficult.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut who could have anticipated the arrival of that freak, Lan Qing. A Reflection of Heaven and Earth immediately after breaking through, while she was still stuck.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Stay your hand!” The Astral Phantom cried.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe aura around Lan Qing dimmed, and Varochana’s burning light receded. However, the whole universe around her seemed ready to detonate at a moment’s notice.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Astral Phantom was red faced, and ground her teeth in fury. “I will absolutely not swear myself to you, but I will swear to three things, whenever you need them. I’m a Paragon, I have my pride…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe pure fires sprang back to life before she could finish her thought. Their crackling cacophony drowned out her words.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing addressed her with a calm voice. “You aren’t in a position to negotiate. You will die, or you will serve! Those are your only options.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe couldn’t form the words, she was putting all of her energy toward warding off the holy flames. Her belligerence seemed pointless in the face of the God of Wisdom. An Lun’s super soldier was completely immovable.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eVarochana’s flames dimmed again. The assassin took great gulps of breath, but only in part from the strain. She felt like she had been on the edge of a precipice, about to be swallowed up. The fear still seized her chest.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I have limited patience. This is your final chance to make a decision.” Lan Qing’s keen eyes never left her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Phantom’s chest heaved as she fought to regain her breath. She wanted nothing more than to make Lan Qing stop breathing, but she when hanging over a ledge you didn’t bite the hand holding you up.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Ten!” Lan Qing’s eyes were bright and firm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Nine!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wait! What are your intentions?” The Phantom asked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Eight!” He ignored her entirely and continued the count down.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Seven!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“\u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWait!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e I need time to think. Give me time!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Six!” Lan Qing’s eyes were hard. His hands slowly rose and the fiery sun behind his head got brighter. Everything the light touched could hear the bone-shuddering chants of invisible bodhisattvas. It was so peaceful, but for the Astral Phantom it sounded like the inevitable march of death coming for her soul.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You…” The struggle was clear in the Phantom’s eyes. She knew what it would mean if he marked her soul.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Three!” Lan Qing’s hands rose higher.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wait a minute! What happened to four and five?!” She whined.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe flames got higher.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Two!” Lan Qing had her shaken to the core. Why would he give her room to breathe?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Wait – fine, fine! I agree!” Every inch Lan Qing’s hands rose her willpower eroded. Eventually when it seemed he would move, her defenses collapsed. Nothing was more important than life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe fiery lights around Lan Qing’s hands dispersed. His face changed. “Submit your spirit, and don’t think about pulling any tricks. I don’t have the patience to fight you anymore. If I feel like anything isn’t right, you won’t get a second chance.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Astral Phantom looked at him, conflicted. Her breath was rapid from exertion and fear. She was filled with regret. Why did she have to be so greedy? Avarice is what led her to this point. Everything would have been different. Her cherished life would not have been so upset.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“When… when you make the mark… if you wouldn’t…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe aura around Lan Qing’s hands flared. “I said no negotiations.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Fine! Ruthless!” She glared bloody murder but daren’t delay. She genuinely feared a change in Lan Qing’s mood. He might kill her at any moment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHer heart was unwilling, but a decision had to be made. She took a deep breath, grit her teeth, and closed her eyes. The purple aura that had surrounded her was gone. Moments later a small vortex appeared in the center of her forehead. Flecks of black swirled through the outer edges, while in the center knelt the cloudy image of a silver man.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSoul essence! Only a Paragon was able to manifest an image of their own souls.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe fierce and bloodthirsty expression was gone. Now the Phantom was a ghost of pain and sorrow. When she opened her eyes they were wet with tears. Her piteous expression and beautiful face tugged at the heart.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Such a big man, bullying a weaker girl. I don’t really have a choice, do I?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn another circumstance, with another man, her desperate plea might have meant something. Unfortunately, Lan Qing was unmoved. He did not hesitate and pointed with an index finger. A beam of golden light issued forth with spiraling lines of archaic runes in tow. Each strange symbol pulsed with Buddhist mysticism. The golden light was peace and calm, delivered into the purple vortex.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe tide of the vortex lurched in protest, but almost instantly the Phantom felt the burning fires of Varochana lapping at her skin. The vortex stabilized shortly thereafter and allowed the light to pass.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003cspan\u003eThe silver silhouette within the vortex became more distinct. A shrill cry from the depths of her spirit followed. The golden light struck it right on the forehead. It blazed a path, leaving a golden 佛 behind. \u003ca id\u003d\"footnoteref-1\" href\u003d\"#footnote-1\"\u003e[1]\u003c/a\u003e\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe sudden, intense pain caused the Astral Phantom to fall. She shuddered uncontrollably, drenched in sweat.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen a Paragon applied their mark, it meant the victim had to do everything they commanded. If they refused, the Paragon could erase their soul with a thought. By that point it didn’t matter how strong she became, the mark was there forever. There were very few instances where a mark like this had been placed. A Paragon’s dignity was sacrosanct. In the end it wasn’t that the Phantom was lacking in dignity, but that her love of life was too great.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe golden light persisted for about a minute, then vanished. Shortly after the burning light filling the universe receded into the image of Vairochana behind Lan Qing. The bodies of both combatants returned to normal size, and their battlefield vanished back into the Clairvoyant’s Domain. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv class\u003d\"footnotes\"\u003e\n \u003col\u003e\n  \u003cli\u003e\u003cspan id\u003d\"footnote-1\"\u003eThe symbol for Buddha.\u003ca href\u003d\"#footnoteref-1\" class\u003d\"btn btn-sm btn-link\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n \u003c/ol\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-646\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-648\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-647","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
