{"id":56949,"no":727,"title":"Chapter 725: To the Rescue","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 725: To the Rescue\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAnything that came close to the light Occisus released was cut apart by a hundred thousand minute slices. The aliens were diced again and again until there was nothing left of them but lacerated atoms. Occisus was a ship-sized meat grinder.\u003c/p\u003e\n\u003cp\u003eHe could sense immediately that the Pharmacist had prepared for this moment for a long time. Her will permeated the aura and galvanized it.\u003c/p\u003e\n\u003cp\u003eLan Jue’s instinct was to rush forward and get to her, but it would be impossible. Even if he and Qianlin had prepared and met her with their Harmonious Swords style, it still might not be enough to withstand Occisus.\u003c/p\u003e\n\u003cp\u003eHis choices were limited. What could he do if he couldn’t stop her? Flee?\u003c/p\u003e\n\u003cp\u003eFight!\u003c/p\u003e\n\u003cp\u003eLan Jue grit his teeth as Thor’s systems came back online. Thor was a conflagration of blue light that overwhelmed its Blinding Stone as the mecha launched toward Occisus.\u003c/p\u003e\n\u003cp\u003eEven a Paragon didn’t have the energy necessary to bear this sword without effort. When her strength failed, that would be his chance to end her foolhardy crusade. But if the planets abandoned their teleportation and joined the fight their chances of survival were slim to none.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe Pharmacist target was simple – Monarch.\u003c/p\u003e\n\u003cp\u003eHumanity’s war with the aliens was not new by this point. There was some level of familiarity with the enemy, knowledge which served the Pharmacist. She knew that attacking the central vortex was useless. The only way to do damage to these terrible alien worlds was to hit them directly.\u003c/p\u003e\n\u003cp\u003eShe had been watching and waiting. By coincidence she had arrived only about four hours after Lan Jue. Though her heart was filled with enmity she was no fool. She knew her mission was not easy – in fact it was likely impossible. A single person meant nothing against a foe the size of a planet. But none of that mattered in the face of her all-consuming purpose: To get her husband’s sword back!\u003c/p\u003e\n\u003cp\u003eFrom time immemorial the Banishing Blades were the greatest weapons ever created. She knew that somewhere within the legendary sword was some residual spark of her husband’s spirit. She needed it back to feel some part of him again.\u003c/p\u003e\n\u003cp\u003eWhen she’d arrived the planets were still hibernating. If she wanted any chance at succeeding she had to bide her time. Of course, she had no concept of what that chance would be. Still she had come alone, and that gave her patience to find the right moment.\u003c/p\u003e\n\u003cp\u003eShe’d slipped into a stillness not unlike her unwitting foes and waited. She saved her energy for the final fight. As a Paragon and with the help of Occisus she could hide herself better than Ln Jue and Thor. She’d been practically invisible until this moment.\u003c/p\u003e\n\u003cp\u003eWhen it seemed the planets were preparing to teleport, the Pharmacist knew her time had come.\u003c/p\u003e\n\u003cp\u003eAs her will flooded Occisus and the sword awakened, she could sense Ultus’ presence. She knew where it was being held and that was where she focused her assault.\u003c/p\u003e\n\u003cp\u003eShe pressed forward, holding nothing back. Her own protogenia was consumed as the blade drank everything up to fuel its bloodlust. It empowered her, making her attacks more potent than they ever had been. Maybe Occisus would carve her up too, she thought. But she didn’t mind, she just wanted to see that piece of her husband one last time.\u003c/p\u003e\n\u003cp\u003eClose and closer she came. Her body and mind were as one, focused on her singular purpose. Her heart beat against her chest.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eMy love, I’m here. If your soul is out there make Ultus heed my call. Come back!\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003eThe command echoed through her mind, through her sword. Beneath the hunger for destruction lingered pain and loneliness.\u003c/p\u003e\n\u003cp\u003eThe white light ripped through space!\u003c/p\u003e\n\u003cp\u003eJust when Occisus seemed poised to clash with Monarch’s roiling violet atmosphere, reality warbled uncomfortably. Occisus vanished. Then, a moment later, its white light brazenly reappeared on the planet’s surface. The ten-thousand meter long sword buried itself in the alien world.\u003c/p\u003e\n\u003cp\u003eA golden beam shot from Monarch’s surface. Its appearance bore a sharpness that seemed to defy reality. Though it was not as brilliant in hue as snow-white Occisus, its power was more tightly compacted. White and gold collided.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003eTing!\u003c/i\u003e A sound that seemed to shudder the pillars of the universe rang out. Rippled ran through the vortices in all three alien worlds.\u003c/p\u003e\n\u003cp\u003eThe white light dimmed and the Pharmacist reemerged in the space near Monarch. Her face was pale as a ghost like there was no blood left within her. She had put every ounce of herself in that attack. In this moment, besides what was needed to keep her alive in space, she was as weak and frail as a normal human.\u003c/p\u003e\n\u003cp\u003eIn her hand Occisus shivered.\u003c/p\u003e\n\u003cp\u003eBut more frightening than her feeble condition was the look in her eyes as she stared at the sword – and the one holding it.\u003c/p\u003e\n\u003cp\u003eThe sword was gold from top to pommel. It was simple, much like Occisus in appearance. It was gripped in the hands of a man in his mid-thirties. His body was hidden beneath long violet robes, but his handsome face was left uncovered. Long black hair splayed out behind his angular and handsome features and the whole of him shimmered with a faint golden glow. He was like a perfect representation of an ancient emperor. [1. Yellow is the color of the emperor in ancient China.]\u003c/p\u003e\n\u003cp\u003eAnd his deep violet eyes were staring right back at the Pharmacist.\u003c/p\u003e\n\u003cp\u003eFor a moment the two stared at one another. Then, slowly, the man lifted the golden sword to strike.\u003c/p\u003e\n\u003cp\u003eOnly just then his whole body shook. The aura of power around his weapon fluctuated frantically and he pressed his other hand against his head. He winced, as though in terrible pain.\u003c/p\u003e\n\u003cp\u003eNot a moment later a flash of blue light swept by and swallowed up the Pharmacist. A streak of brilliant color was left in its wake and streaked into the distance.\u003c/p\u003e\n\u003cp\u003eTwo beams of violet light erupted from the surface of Monarch and into the heavens, giving chase. They moved with unparalleled speed and seemed poised to quickly overtake the blue streak.\u003c/p\u003e\n\u003cp\u003eJust then, a deep and commanding voice boomed through space.\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e“Return!”\u003c/i\u003e he golden figure left in a flash, leaving behind a trail of fading golden silhouettes. The two beams of violet returned just as quickly as they left, as though they were two baseballs knocked back toward Monarch.\u003c/p\u003e\n\u003cp\u003eA sweeping light of yellow-gold appeared in the blue light’s path and intersected with it. There was a brilliant eruption of color – and then nothing.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eOn the surface of Monarch.\u003c/p\u003e\n\u003cp\u003eThe man with the golden sword slowly recovered. The look on his face was icy cold, and when he spoke his words were like frozen daggers. “You dare hinder me. Still your will lingers – good, very good! Then they shall be allowed to flee this time.”\u003c/p\u003e\n\u003cp\u003eThe two beams of purple light descended from heaven in a flash and terminated before the man in purple. The figures of the Violet Prince and Princess emerged.\u003c/p\u003e\n\u003cp\u003eBoth of them prostrated themselves before the man. “Monarch!”\u003c/p\u003e\n\u003cp\u003e“Hmph!” With the grunt the central whirlpools of power within each planet swelled. They grew until the whole world was swallowed up. When the light reached its brightest point there was a sudden flash, followed by darkness. The three planets were gone.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe pale yellow light eventually stopped, settling on the small planetoid Lan Jue had parked Zeus-1 upon.\u003c/p\u003e\n\u003cp\u003eThor’s sparkling sleek figure emerged. But there was also someone else, glaring at the mecha with eyes hard enough to crumble mountains.\u003c/p\u003e\n\u003cp\u003eThor’s chestplate hissed open and Lan Jue stepped out, carrying the pale and stupefied Pharmacist. He didn’t dare lifts his head to face the other man.\u003c/p\u003e\n\u003cp\u003e“Father, I’m sorry!” He muttered to the ground.\u003c/p\u003e\n\u003cp\u003eIndeed the one who saved them in their moment of need had been none other than Jue Di, the only one who could. No other living creature could have delivered them from the clutches of the Prince and Princess.\u003c/p\u003e\n\u003cp\u003eJue Di floated to the ground and stood before his son. His voice was cold and cruel. “Get on the ship. We’ll discuss this on the way back.”\u003c/p\u003e\n\u003cp\u003e“Yes, father.” Lan Jue replied obediently.\u003c/p\u003e\n\u003cp\u003eHe didn’t need to ask to know that Lan Qing had told Jue Di about Lan Jue’s plan. His father had come a long way to save him. Lan Jue stole a furtive glance and while Jue Di seemed fine, pangs of regret stabbed at Lan Jue’s chest. He knew every time Jue Di used his powers universal protogenia burned away some of his life force.\u003c/p\u003e\n\u003cp\u003eZeus-1 lifted off and began the journey back home. With no alien planets or patrols to worry about, their path was quick and direct.\u003c/p\u003e\n\u003cp\u003eLan Jue inwardly prayed the planets hadn’t transferred to the East. Humans were selfish creatures and he was no exception. At times like this who didn’t hope tragedy fell upon others rather than their own friends and family.\u003c/p\u003e\n\u003cp\u003e“Sister, are you alright?” He looked toward the Pharmacist, seated beside him with that same dull expression. Ever since using the sword she seemed lost, or somehow sealed away. Even her eyes didn’t move.\u003c/p\u003e\n\u003cp\u003eLan Jue was suddenly reminded of Jun’er’s words. She had told him her mother would be fine, that only he could bring her back. It seemed she’d been right once again. Her prophetic skills were getting stronger.\u003c/p\u003e\n\u003cp\u003eJue Di stood by Lan Jue’s side staring out of a window. His face was dark and solemn.\u003c/p\u003e\n\u003cp\u003eLan Jue dropped his head again, his face heavy with concern. “Are you alright, father?”\u003c/p\u003e\n\u003cp\u003eJue Di stared at him with hard eyes. “If you would stop making trouble for me I’d be fine. They definitely teleported into human territory. I’m going to rest. It looks like staying out of it isn’t an option for me anymore. Get us back to Skyfire, your brother’s waiting.”\u003c/p\u003e\n\u003cp\u003eLan Jue paused. “Shouldn’t he be on An Lun?”\u003c/p\u003e\n\u003cp\u003eJue Di answered. “This doesn’t conflict. You’ll understand once we return.” He didn’t give Lan Jue any chance to bother him further. Walking off to one corner he settled on the floor and began to meditate.\u003c/p\u003e\n\u003cp\u003eThe aliens were undoubtedly about to visit destruction upon the worlds of man, yet Lan Jue’s heart was accomplished what he’d set out to do, the Pharmacist was back safely. He’d deal with the aliens when they got back.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-724\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-726\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-725","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
