{"id":56961,"no":739,"title":"Chapter 737: It Begins","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 737: It Begins\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMika swept through the door and down the hall as fast as her feet could take her. She began to wheeze once she was out of the boss’ earshot, gasping through a face twisted in anger. She muttered to herself. “He’d just keep doing it unless we show him we’re serious. Sooner or later it had to be done. Heh, see how he likes being bullied. He won’t be making us leave any time soon.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eZeus-1 pulled out of Middle Heaven, with Majesty close on its heels. They took up position at the back of the fleet, and waited. The fight was about to begin, and Star Division needed to prepare for their part of it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStar Division was more than prepared. Besides Jun’er, all of Skyfire Avenue’s elite were in attendance. All four brigades were ready for war, but the charge would be led by the First and Second, with support from Vanguard.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eVanguard squad was a team composed entirely of Paragons or Adepts with equivalent power. This included Jue Di of the Infinite, and Luo Xianni of Nirvana. Of course, the various other Paragons from Skyfire Avenue and the God of Wine, Bize. The power behind the small squad was, frankly, ludicrous.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey constituted the best humanity had produced – ninety percent of the strongest people in the universe. Jue Di was their leader. However, Lan Jue was the one who called the shots.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eVanguard and Zeus’ five Amazons were aboard Zeus-1. Star Division occupied Majesty. Everyone was waiting with baited breath for the order to move in.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue stood by the window and looked out. The Paragons were all quietly meditating in their seats, maintaining their calm. Not only did they have to take the planet, they had to do it as fast as possible. When that happened they would leave Star Division behind to clean up, and Vanguard would go where they were needed the most. With the help of a squad of Paragons, retaking the planets was expected to happen swiftly.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey were also to keep a look out for creatures like the Violet Prince and Princess.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue stared into the blackness of space with his arms crossed in front of his chest, eyes sparkling. This was likely to be the most important fight of his life.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJun’er had attempted to forecast what would happen, but said the future was unclear. She was, after all, still was still young, new to her powers, and there were so many involved. The alien planets were also nearly immortals. Difficulties seeing the future were to be expected.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver stood at Lan Jue’s shoulder. His voice was low when he spoke. “How are you doing? When do you think you’ll break through?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue shook his head. “I don’t know, but it should be soon. I’m fighting it off as strong as I can. The more you accumulate the easier the process is.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver sighed. “Indeed! Even I was surprised at how easy it was. With the help of my Primordial Lightning, I didn’t encounter any real resistance. It seemed completely natural to join with my protogenia and become one with it. But it’s different for you. I can’t see where you’re at – it’s like looking into a deep pool.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue chuckled. “That’s because I’m more handsome than you are.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver sniffed disdainfully. “Stop talking nonsense. You think you can hold a candle to me?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe smirked at Lan Jue, but saw his commander’s pupil’s contract and stare straight ahead. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s starting!” He said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYes, the war was about to begin!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEngines flared to life from the tail ends of the massive warships. It lit up space like the birth of a hundred thousand new stars. They maintained formation as the fleet began to close in on the four human planets.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTwelve fleets, specifically, and they moved as a single body. Like Armageddon descending on the alien horde.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBehind them eight massive bastion ships began to press forward. The largest of them was of course Middle Heaven, though it must be said it was also the ugliest. It was also slower than its smaller counterparts.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTyrannosaurus was nestled in the middle of them all. Admiral Kang Hui stood behind his control desk with solemn expression. He was determined to cast of the shame of his previous defeat with this second encounter! The fate of humanity hung in the balance, and the pressure lain on his shoulder made it hard to breathe.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Begin!” Kang Hui’s face was dark, and his voice was curt. The light in his eyes was fierce – it was time to do or die! He was ready for the ultimate sacrifice if it came down to it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eFallen comrades, by the end of today I’ll have either won you vengeance, or I’ll meet you in the hereafter.\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShips began to move. At first they moved slowly, but soon they were closing in on the enemy from all directions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFrom a distance one couldn’t see the end of the human fighting force. Patrol boats charged at the fore, surrounded and protected by battleships, expedition ships and dreadnaughts. Capital ships came up from behind as an imposing rear guard.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCannons began to charge. Firepower mighty enough to level planets pointed at humanity’s foes.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs though sensing the change, the alien forces began to react. They swarmed, but not toward the humans. Instead they pressed tighter and withdrew, leaving empty space behind. At the same time they closed in tighter around the human planets they’d taken, as though ready to die in defense of their newest acquisitions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKang Hui scowled. This wasn’t what he wanted to see. He had hoped the aliens was charge ahead to meet them, so they could be spread out and their power diffused. However, with the fleets of three Alliances and the support of the bastions, he was confident in their success.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOn the other hand he was well aware of his enemy’s cunning. Rushing in would not have been like them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hold formations.” Kang Hui continued to call out orders. He had learned from their earlier failure that charging in was a sure path to defeat. Stay prepared, stay vigilant. The alien planets were still nowhere to be seen, and until they showed up anything was possible.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe fleets split up into predetermined formations and blazed toward the four planets as instructed. To avoid harming the planets, Capital ships were instructed not to have their main cannons charged. This was also to save energy for the more difficult fight ahead. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs the human ships closed in, the aliens gathered even tighter together. The large aliens even hid behind the planets.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Avoid hitting the planets. Open fire!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWith his order, ships spread around all four planets simultaneously began their attack.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eFlashes of laser fire lit streaked through space. They sped passed and around the planets, aiming for the aliens trying to use them for cover.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTheir enemy also pulled into formation. Turtle aliens brazenly appeared on the front lines, defending the others with their shells. The other creatures didn’t attack, but instead hid well behind the makeshift shield wall.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHuman forces were arrayed well, keeping formations that allowed for maximum coverage. However their strongest weapons were checked by their proximity to the planets. They had to rely on secondary weapons systems only.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuddenly a purple light began to emerge from behind the turtle aliens. Streaks of purple energy blasted forth, not unlike cannon fire from the human ships. They didn’t have the impact of human weapons, but where the caustic energy struck it began to dissolve the ships’ shields, causing them to fluctuate erratically.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShip captains reacted quickly. Dreadnaughts and Capital ships pulled to the front. With their stronger shields and heavy guns they could shield the smaller ships from destruction.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBoth sides viciously exchanged fire. However, the humans were at a disadvantage since they couldn’t use their strongest weapons. The alien horde had no such restrictions.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eClose inspection revealed that it was a particular kind of alien firing at them from a distance. They looked like hedgehogs, capable of throwing spikes of energy from their backs. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe human ships kept their distance. Just as the aliens had studied them, the humans had learned about their enemy. They knew the monsters were especially strong at close range, but lacked strong long-range fighting capabilities. Of course, this didn’t include the planets themselves.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHumanity had prepared well for the battle. With the backing of all the alliances they didn’t worry about running out of resources or energy, and so maintained the long-distance attacks. Their goal was to destroy the hedgehog aliens quickly, and keep the other creatures from getting too close. Any alien who dared try to get close was instantly put down by the overwhelming hail of laser fire.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThough mankind had suffered numerous defeats, each time they had learned. Kang Hui’s plan was a simple one – make less mistakes! Use the strength advantage to beat back the enemy, don’t be too aggressive, but don’t give them any opportunities either. Grind them down, that was how you killed aliens.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-736\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-738\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-737","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
