{"id":56966,"no":744,"title":"Chapter 742: I’ll Decide What’s Permitted!","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 742: I’ll Decide What’s Permitted!\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Increase artillery support to the ground teams, except for Monteux. Allow nearby ships to provide cover fire for our troops.” Kang Hui ordered.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Admiral, that won’t be permitted. There are…” His first officer timidly interjected.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e\u003cspan\u003eKang Hui’s response was cool and unyielding. “I’ll decide what’s permitted. \u003ca id\u003d\"footnoteref-1\" href\u003d\"#footnote-1\"\u003e[1]\u003c/a\u003e Are you saying our soldiers aren’t people, too? If we keep this up, how many will die before we take the planets? Follow orders, soldier!”\u003c/span\u003e\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Sir!” The officer had no choice, in battle the Admiral’s orders were to be obeyed above all else unless directly contradicted by superiors. But in a battle this crucial, what was the likelihood of that? Nothing was more important than remove this threat to humanity. The military leaders would all stand behind Kang Hui’s decision.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey could see the cover fire increase from space. Things started going smoother on the three planets almost immediately.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Sir, railguns have been installed on Monteux. Four of them so far. So far the East has handled their mission well.” Finally, some good news.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Have admiral Lan send over his data.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Aye, aye!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA few minutes later satellite images from the Eastern fleet started coming in. He looked upon the ground team’s progress in silence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat power! What overwhelming power! With no more than ten people they were protecting the whole ground assault team. Of course, those ten people were Paragons!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eInwardly Kang Hui sighed. He had been told in no uncertain terms that if this gambit was a success, to turn their weapons on the other Alliances. But Kang Hui was a smart man, and he had seen the power of these Paragons with his own eyes. Everyone one of them was capable of bringing Armageddon on their heads. That was even before they considered Jue Di. Provoking him would be begging for death.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe leadership simply didn’t understand. The East’s rise wasn’t something they could prevent. What they should be doing is working to maintain a good relationship with them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStrength has always been the way of the universe and the path to dominance. For the sake of humanity, Eastern prosperity wasn’t necessarily a bad thing. Besides, Kang Hui had Eastern blood, and after this fight he would undoubtedly be one of the strongest voices in the military. He would work for cooperation rather than aggression.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKang Hui was honestly a little nervous ever since Admiral Lan brought his An Lun army. Middle Heaven was a staggering sight to behold, even larger than Terminator had been. As for how much carnage it could produce, they could only imagine.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhatever capabilities it had, the East’s latest bastion was undoubtedly stronger than it looked. He didn’t trust its cumbersome speed, either. Why keep the stony exterior that slowed it down so much? It wasn’t like remodeling the planet’s surface would have been difficult for modern technology.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was impressive enough as a feat of engineering – the first planet to be turned into a Bastion!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe hoped there would be an opportunity for them to see what Middle Heaven could do. Militarily, the implications of a super-bastion frightened and excited him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Tell the Admiral to take control of the planet as quickly as he can.” Kang Hui said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing was, of course, aboard the massive bastion that used to be his base planet. He was watching after the ground crew, but what Kang Hui didn’t know was that Lan Qing had already ordered his fleet to prepare for attacks from ‘friendly’ forces. When Monteux was under their control, the ships would move in to defend their people.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was, however, only a defensive maneuver. He didn’t anticipate much trouble, not least because of his father’s presence. If Jue Di didn’t have to watch his power consumption, he could destroy a planet by himself.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe watched the screens as data continued to stream it. It looked like everything was still going well on the ground.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Have we found anyone alive?” He asked his brother.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“So far, nothing,” Lan Jue replied. “I think it was a ploy by the aliens. But why would they want to lure us to a fight on the planet’s surface?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing answered confidently. “Don’t think too much about it. You need to focus on taking over your sector. Leave the rest to me.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Bro. Come on, do you need to be so harsh all the time?” Lan Jue joked.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing paused for a moment. “This is war. You should call me Admiral.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue chuckled. “You need to relax. When we finish this fight I’m gonna tell dad to find you a girlfriend. It\u0027s a’out time you started a family.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing’s face turned hard and hostile. “Get back to the fight!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue cut the connection, suddenly in a better mood. He’d been nervous before, so nervous he forgot something important. Who was his brother? Prometheus the Wise! If Lan Jue had foreseen a problem, of course his brother had!\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe situation still wasn’t clear to him, but further consideration would have to wait until they finished taking the planet. The alien home worlds still had the opportunity to surprise them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSo far, while the aliens were many they hadn’t come across the stronger breeds. The truly powerful ones he feared to see were as strong as the Paragons. Lan Jue was sure the aliens weren’t lacking in that class of powerhouse. But where were the Violet Prince and Princess, or others like them? What about Monarch?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe fact they weren’t on the field meant things were only getting started.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Boss, I sense something.” Lin Guoguo announced.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue’s eyes lit up. “Where?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’ll take you,” she said. Without wasting any more time she urged her mecha toward the horizon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue followed close behind. The Driver and Pharmacist remained behind to look after Star Division.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs Lin Guoguo led the way she ignored the aliens that charged for them, attempting to block their path. Bolt after bolt of All-Haven lightning turned them to ash before they got close. The vital crystals left behind were swept up as they flew passed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the distance, the shell of a city came into view. Even from this distance, though, they could see signs of corrosion on its towering buildings. It looked like the whole thing had been devoured and digested. It’d been stained purple by the ordeal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLin Guoguo gasped. “These absolute bastards!” How many people used to live in this city? How many of their compatriots had become fuel for these monsters?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eGuoguo’s senses led them to a building that looked like it may once have been a church. “In there,” she said. “I can sense about ten life forms… humans.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue was suddenly serious. “Wait here. I’ll take a look.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Boss, be careful,” she urged.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue, though, changed tack. “Never mind, come with me. Pack up your mecha.” He didn’t feel comfortable leaving her outside by herself. They were deep in enemy territory, and a powerful creature could appear from any corner. She was safest by his side. He left Thor’s cockpit.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Alright!” She answered before appearing before her mecha in a flash of light. Both of them stored their suits.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue went down to ground level, but didn’t place his feet on the poisoned earth. He remained hovering about a meter above it. Lin Guoguo was a step behind him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue surveyed the building with a scowl. He spread his hands, and a gentle power emanated from him to push open the corroded doors. A rotten scent exuded from within the building. A pale blue light sprung up from within him to protect both he and Guoguo from the toxic cloud. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“In there,” she confirmed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue entered.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe interior of the building had fared better than its façade, but a carpet of poison purple blanketed the floor. The aliens’ sickness would not be denied by walls.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe interior was spacious and stretched far back. There, at the end of the room, was huddled a group of people. They looked at Lan Jue and Lin Guoguo.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eCould there really still be people alive in here? When the thought crossed his mind, suddenly Lan Jue felt an abiding unease. They did feel like humans, but their reactions were strange. That was to say, they were completely emotionless. Something definitely wasn’t right.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe destitute people scrambled to their feet and raced toward Lan Jue.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Save us. Save us!” They shouted the words as they raced forward. They moved quickly across the carpet of purple, seemingly unfazed by its corrosive properties.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue felt stricken. He didn’t move.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe light within the church dimmed. When they got close, Lan Jue could see that their eyes had turned deep violet. They felt like humans, but they were not themselves.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eControlled? Could they be saved?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe was still lost in thought when the closest one leapt up at him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Boss, be careful!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBOOM!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e The victim erupted in a grotesque explosion of purple blood and flesh.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv class\u003d\"footnotes\"\u003e\n \u003col\u003e\n  \u003cli\u003e\u003cspan id\u003d\"footnote-1\"\u003eThey use a phrase which means, roughly, ‘let the leadership deal with it when we’re not in time of war.\u003ca href\u003d\"#footnoteref-1\" class\u003d\"btn btn-sm btn-link\"\u003e\u003ci class\u003d\"fa fa-hand-o-left\"\u003e\u003c/i\u003e\u003c/a\u003e\u003c/span\u003e\u003c/li\u003e\n \u003c/ol\u003e\n\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-741\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-743\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-742","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
