{"id":56978,"no":756,"title":"Chapter 754: Incorporation","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 754: Incorporation\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hello, Admiral Lan Qing.” When he saw the Eastern luminary Sylva Austin felt more relaxed. No one of comparable age had as many military accomplishments. If they were here it meant they didn’t need to fear pursuit by alien forces.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hello, President Austin. Where are you and your entourage headed?” Lan Qing calmly greeted him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Western President adopted a grieved expression. “The alien planets have attacked our armies, and destroyed our last remaining bastions. The West has fallen into enemy hands and Europa has been occupied by our foes. We’ve had no choice but to flee our homeland under threat of death. We’re lucky to have run into you. You’ve come as reinforcements?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing regarded him like a statue. “It doesn’t seem as though you’re in any condition to fight. You’ve witnessed the enemy on Europa? What’s the situation on the ground?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSylva paused. He didn’t want to continue this line of questioning. For fear of unneeded trouble, for fear of judgement, he’d shut off all communications to Europa. He didn’t know what was happening back home.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“They’re everywhere, Europa has fallen. We were forced to run. We can’t know the conditions on the planet now. They’ve cut off all communications. I don’t know how many men you’ve brought with you, Admiral, but do you think you’ll be able to help us take back our home?” He lied straight-faced to the Eastern commander.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We have one bastion and five interstellar fleets,” Lan Qing answered. “We plan to attack the alien planets in full force.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSylva’s words were thick with gratitude. “That’s excellent. We’ll get out of your way, and congratulations on what’s sure to be a successful campaign, Admiral. We’ll wait for your triumphant return to present you with our most sincere thanks.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“No need.” Lan Qing replied.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Hm?” Sylva saw the hard light in Lan Qing’s eye.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe An Lun super soldier continued. “I mean to say you don’t need to move aside. We’re requisitioning your vessels.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“What?” Sylva stared at him with wide eyes. He could hardly believe what he was hearing.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We’re surrounded, sir.” The colonel at the President’s side had just noticed the Eastern ships pulling up on either flank. They hadn’t considered this possibility since the others were military vessels and not aliens. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSylva’s capitulatory façade fell away, and he faced Lan Qing with indignation. “Admiral Lan, this is the \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eWestern Alliance\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e. What is the meaning of this?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing’s voice was cold as ice. “So you do know where you are. As President should you be en route to flee your own nation? You cannot face the enemy on your own, so we’ve come. We will achieve victory through unity. Toward this end we’re requisitioning your ships. We will ensure your safety, but your people are coming under our control.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“This is unacceptable.” Sylva slammed his fist on the desk in front of him. These ships were meant to ensure the future of the Austin family. How could he just let them be taken? They certainly wouldn’t be given back. All of the wealth that had been painstakingly saved by his family would be robbed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It doesn’t matter what you find unacceptable. Lower your shields and stop your engines or you will be regarded as an enemy. This is how it is.” The connection was dropped.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSylva Austin, President of the Western Alliance, stared gaping at a black screen. He erupted in a string of curses. How could anyone have anticipated that they would run into an army, into someone as pompous and arrogant as this Admiral?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut what choice did he have? They couldn’t revolt. There were five fleets of the East’s best soldiers just outside. Lan Qing was piloting a bastion. What could he do with his small handful of refugees?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut he couldn’t stomach it! He couldn’t simply give himself and his family to these pirates! If he did, his family would be lost.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA wild a ferocious expression overcame him. He snapped his head toward the colonel. “How likely are we to break free? Even if it’s just us.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe colonel opened his mouth, but before he could answer Sylva grunted and collapsed to the floor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe gasped. “Mr. Austin, you…”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eRichard Austin stood over his father, the hand that had knocked him out till raised. His face was dark. “We are guilty in the eyes of the Western people. We cannot continue our sins. I also will not tolerate seeing anyone die by human hands when we have an enemy like the aliens at our gates. Follow Admiral Lan’s demands. If our ships and soldiers can contribute to the liberation of our home, then we must do so in order to redeem ourselves. I am not a man who runs from battle, colonel. Are you?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe officer stared at Richard. After a moment he replied. “Deep in my heart I never liked you. Now I see that I was wrong. I’m sorry.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe turned back to the control panel and opened up a link to all the ships captains. “This is an order, all ships of the Ninth Fleet lower your shields. Friendly forces will come to board your vessels. Put down your arms. We don’t want any trouble.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe command brought the West’s Ninth Fleet to a halt. Shields, which had been brought up when the Eastern ships had surrounded them, hissed as they were turned off. Boarding vessels were allowed to approach.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTwo hours later the West’s newest fleet was turned into the East’s newest addition. To Richard’s surprise the East didn’t remove their personnel, instead simply leaving some of their own behind to supervise. The Austin family’s people were left under the command of the colonel.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAustin brought his father, awake from his undesired nap, on the boarding vessel along with several of their closes descendants. They made their way to Middle Heaven. It was safer there, and signified their capitulation to the East.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSylva was quiet the whole way. He looked to have aged a decade in just a few hours. Richard sat across from him, also silent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe wasn’t sure what he should say, but he didn’t regret his actions. If he was given the choice to do it again, he would. It had somehow put his heart at ease.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSylva suddenly lifted his head and looked at his son.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eRichard sat up straight, ready for his father to react harshly. Instead the elder statesman started with a bitter laugh. “Perhaps you’re right. Perhaps I was too concerned with what our family could gain or lose. What I could lose. I forgot what it means to be human. I have sinned, and from now on I am no longer suited to running this family. That task falls to you. You’re now the head of the Austin family.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Father, I…” Richard wanted to explain, but Sylva lifted his hand and entreated silence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You don’t need to say anything. I don’t blame you, I’m not upset. I mean it, it took nerve to do what you did. I see you with new eyes. That nerve is precisely what’s needed to keep our family going. I didn’t want our family to end here, because of this. After a hundred years on the political stage. But so long as you remain, we will return to glory. The sins of the father will not be visited upon the son. Richard Austin will be the hero of our family, and the cleanser of our name.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eRichard was stunned. Suddenly he felt so small before his father, with a burden so heavy placed upon his shoulders. He felt like in a moment his life had changed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe small transport boat made it back to Middle Heaven without incident. Although everyone had heard of the East’s newest Bastion, seeing the remolded planet with his own eyes for the first time stunned Richard to silence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe soldiers were very respectful, and took pains to accommodate him and his family. Richard and his father were brought to the control room, at the center of the bastion.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen they entered, both of them focused immediately on a single person.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTall, straight, cold and resolute, but with a strangely gentle air. Both seemingly opposing sensations surrounded a single man harmoniously without contradiction.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing, the Peerless Light Emperor of Middle Heaven, senior commander of the Eastern army, Admiral of Middle Heaven – Prometheus! Title after lofty title flit through their minds. Richard felt small before the man, like he was looking up at a giant.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe soldier who led them quickly approached Lan Qing and stood at his side, speaking a few words. The Admiral then turned around to face them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe walked over with long strides, unthreatening, but Richard still fell back a step. Sylva faced him tall and uncowed. “Hello, Admiral,” he said.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing nodded. “Hello, President Austin. I appreciate your cooperation in this matter. Please relax, we’ll do everything in our power to help you recover what the aliens have taken. In a little while I’ll need to ask you some information, anything you can tell me about the state of Europa and its surrounding planets. Then you’ll be free to rest and recover from your flight.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo mention was made of the East’s forceful acquisition.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSylva had known this was coming, but the bitterness in him was still sharp. The Austin family’s years of leadership were coming to an end, but they would live. So long as they lived, there was a chance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-753\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-755\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-754","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
