{"id":56998,"no":776,"title":"Chapter 774: 48 Hours","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 774: 48 Hours\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing fixed him with a flat stare. “You’ll know when you need to know. All I can give you is a time. Forty-eight hours, then you start your mission. We will have plans for our own actions at that time.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Alright! In that case I’m off to take a look at my division.” He rose to his feet and bade farewell to his brother.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLately the Paragons of the Division had experienced much change. It was the soldiers that saw the greatest improvement. With the wealth of resources and support from Skyfire Avenue, Star Division had spared no effort in their training. Not only was their cultivation improved on an individual level, but their equipment was also a cut above.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEveryone knew their military exploits were already enough for the exuvium process. Skyfire Avenue had also assured them that if something should happen in the course of their service, the rewards from their exploits would be passed to their families. The people they love would be able to benefit from their sacrifice. It effectively assuaged family considerations that would have hampered their ability to act in the battlefield.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn contrast to the rest of humanity since the outbreak of war, Star Division had been running smoothly in every aspect. They had never been defeated, only forced to retreat. Star Division was the darling of military leaders, and no one had to worry about their morale. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe more they worked together the better they performed as a team. It was true for whole brigades and individual squads. In response their efficacy on the field had skyrocketed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSkyfire Avenue’s independent research had also confirmed what they knew, that the aliens were especially susceptible to Discipline. Mechas flooded with an Adept’s powers were especially potent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStar Division had their own section aboard Middle Heaven, a jurisdiction won through their continued success on the field. As they continued to develop as Skyfire Avenue’s military arm, even the Bloodiron Khans couldn’t keep up. In fact, there was no army that could compare.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue drove a verti-car to the division’s encampment. It was quiet when he got there, no one was immediately visible.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eThese guys… what are they up to?\u003c/span\u003e\u003c/i\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLately he had been busy performing scout missions and helping his brother draw up battle plans. He had had no time to check on the status of his division. But there were Paragons to look after them, and Su Xiaosu was overseeing their training. He wasn’t concerned they were slacking. Still, as commander he had to survey the troops before the big fight and make sure they were up to snuff.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe parked the car and made his way to the training area. As he made his way he was accosted by a familiar face.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“It’s you?” There were no honorifics or respectful exchanges. There was just surprise, and something strange underneath.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue felt similarly awkward, as the Savage Goddess Tan Lingyun came his way.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt had been ages since their last interaction, ever since the creation of Star Division. Aside from training and missions they had had no interactions. He’d been too busy to spend time with his soldiers, and that included her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe didn’t seem any different on the outside, but the strength of her aura had certainly improved. She’d definitely gotten stronger, more confident. Her overbearing heroism was more refined and she held herself with poise. Tan Lingyun’s eye-catching personage was helped by the skin-tight flight suit she wore.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eStill quite the figure…\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e Lan Jue said to himself. Tan Lingyun’s body struck all the right notes, enough that she turned a lot of heads wherever she went. Lan Jue was a man and was just as susceptible.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Why are you here?” She blurted out. Immediately regret passed across her face. She was, after all, speaking to her commander.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue smirked. “I’m here to check on everyone. How are things? Are you accustomed to your post?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTan Lingyun’s voice was calm. “No problems. If there’s nothing then I’ll head off.” She started to stride off, but paused when she came to his side. But whatever she was thinking she reconsidered, and quickly left.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen she passed him Lan Jue had a strange sense – like this woman who had given him so much trouble in the past was different all of a sudden.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe hadn’t noticed the moisture in her eyes. It wasn’t because of him, but because of what she felt. She had felt conflicted about Lan Jue for a long time, a fact which confused her deeply. She had assumed the moment she saw him that he was garbage – a pretty handbag with nothing inside. Etiquette teacher… he seemed like such a joke.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut then she began to discover the abilities he had deftly hidden away. First was his command of spacecraft, and that was the first time she thought he might be worth more than he appeared. Then his spectacular display at the Grand Adept Tournament, even winning Champion. It was then her estimation of the man completely changed, when she realized he was the Lei Feng that had touched her so deeply.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe was a strong woman, who had pursued perfection with a dogged will. Lei Feng was the first man who had ever left such an impression. For a woman like her, only a man who could conquer her on the field of battle had what it took to conquer her heart.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLei Feng had that power, but even Lan Jue didn’t know the sort of effect he’d had on Tan Lingyun.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBecause of this conflict Tan Lingyun liked the masked man the most. Cold, expressionless, pure power… Lei Feng was her preference. Knowing who had captured her infatuation had been startling, she would much have rather found Lei Feng to be a stranger.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut the world was full of instances where you didn’t get what you wanted.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEvery time she saw him the first thing she remembered was that effeminate, composed professor. Her heart only started racing when he put the mask on.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe didn’t understand it herself. In reality they were the same person – she should like Lan Jue. But when she looked on his face she still felt confused and unsure, not excitement. Then he puts on the mask, and she feels like she loses her self-control.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLater, when Lan Jue stopped wearing the mask so much, it was like Lei Feng had disappeared. He was no longer a part of her life, but the brief moment she’d spent with him was something she would remember forever. She hoped he would return one day, perhaps in a different form, and she searched for him in Star Division all the time. After all, Skyfire Avenue’s soldiers were rife with strong fighters. There should be someone suitable for her, she thought. But Lei Feng’s impression had been first and had been deep, replacing him would be difficult.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen she was passing him, in a moment of weakness, she had thought to ask if he would wear the mask. Just so she could see Lei Feng for a moment. But thought the words hung on the top of her tongue, how could she make such a request?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey were on the precipice of a war like none of them had ever seen. She didn’t know if she would make it back. Perhaps Lei Feng would always have to remain a pleasant memory.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was just a passing feeling, but one she was not accustomed to. It made her feel weak and out of control.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen she passed him, Lan Jue stood with furrowed brow as though thinking. Then a moment later he continued on his way.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe inside of the training area was just as silent as the exterior, a fact that made Lan Jue even more curious. Shouldn’t they be training, he thought? Why was it so quiet? They were just about to go into battle and needed to be in peak condition.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eJust then his communicator buzzed. It was Su Xiaosu.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Boss?” She sounded a little excited. “Any instructions?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Xiaosu,” he replied. “I’m in the Division training area, why isn’t there anyone here? Where is everybody?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe could hear her snickering. “Oh – oh, we’re at the second training field. Wait there, I’ll come get you.” She asked where he was specifically then hung up.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA short time later Su Xiaosu came running up to him. She was also in the Division’s flight suit, and it certainly treated her well. Lan Jue was surprised to feel her acting like he hadn’t seen since she was the Moonfiend Empress. It seemed giving her command of the Division had brought back that old fire.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“You’re looking well.” Lan Jue said with a smile. Seeing her like this also made him feel better. He knew the Division was in excellent hands.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu Xiaosu answered with a smile of her own. “Not just me, everyone is doing great. The troops have improved, and I think I can honestly that the Division can outperform all those fleets out there. Of course, including the Paragons.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue nodded. “The soldiers, then? Why don’t I see anybody?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Come with me,” she said. “They’re training in the second field.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue hadn’t come to the area An Lun had set up for Star Division, this was his first visit. Su Xiaosu quickly led him to the second field. When he arrived he understood why things were so quiet.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe stood in a spotlessly white warehouse filled with sim pods. They were the upgraded DreamNet pods, and each one of them had the red flame of Star Division painted on the side. The sheer amount of resources that must have gone in to acquiring all of these was staggering to think about.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe troops were logged in, training.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eOf course! How could he forget? Lan Jue slapped his forehead. In both Discipline and mecha piloting his soldiers were among the best. The sheer amount of destruction they could cause, even by accident, was too much to risk. A thousand Adepts in their suits would have torn up the bastion’s surface. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter DreamNet’s upgrade they could employ their Disciplines in the simulation, and didn’t need to hold back when training with their mecha suits. This was the advantage to having a warehouse full of new pods.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-773\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-775\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-774","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
