{"id":56999,"no":777,"title":"Chapter 775: The Mighty Star Division","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 775: The Mighty Star Division\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSafety concerns were just as true for mechas as they were for Adepts. In DreamNet it was almost impossible to tell the distinction between simulation and reality, even when piloting a suit. What’s more, no one needed to fear accidents, safety was assured. DreamNet was undoubtedly the most suitable place for Star Division to train.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“How is the training going?” He asked Su Xiaosu.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe responded. “Very well. It was like the upgrade was tailor-made for us. The simulation is precisely what they would encounter in real life, even emulating levels of exhaustion. Training at full capacity their progress has been spectacular. Some of our people are god-ranked pilots already – one fourth of them, to be precise. And it’s not just me saying it, boss. You may not be the best pilot in the crew anymore.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue smirked. “That good, eh? That’s excellent news.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSu Xiaosu stared at him. “Why do I get the sense you don’t believe me?”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue was playful in his reply. “Oh, it’s not that I don’t believe you! But to make sure don’t you think we should test that out?” He was anxious to see whether their progress really was as good as she was saying. If it was they would perform well when their time came to infiltrate the planet. Once he was familiar with their strengths and limitations he could put them to most efficient use when the fight started.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Alright!” She replied without hesitation. She brought Lan Jue to an open sim pod and had him enter. She then returned to her own.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue deftly entered his login information. He wasn’t playing with Newblet or any training mecha today. He would be piloting DreamNet’s version of Thor. Of course this was an older version, sans the upgrades the real Thor enjoyed. In addition DreamNet could not handle any protogenic powers.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe technology that went into this upgrade was astounding. Not an ounce of energy users poured into the pod was wasted. It was also equipped with an energy recycling system that stored charges from Discipline for portable use, like on a bastion. A single person using a single pod wouldn’t generate much, but a thousand high-class Adepts together could create quite a stockpile.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was a positive cycle.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue re-familiarized himself with Thor’s controls, testing the waters. Everything was as fluid as it always had been, and he felt comfortable even after so long away from the simulated world.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Boss.” Su Xiaosu’s voice caught his attention.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“I’m here.” He answered.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe went on. “How about I gather a small group for you to spar with, so you can see what I’m talking about.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue chuckled. “Alright! But do you think a small team can compete? Perhaps you should make it a little bigger.” He wasn’t being boastful, he knew his own capabilities. At his level of mastery the number of opponents hardly mattered anymore, especially against less skillful contenders.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue was a God-ranked pilot. With the evolution and improvement of his Discipline his body had also developed. He suspected his hand speed was about as good as the ‘fastest hands alive’, the Coffee Master. He could easily top one hundred commands per second. Once a pilot was able to reach those kinds of speeds all manner of complicated techniques were open to them. He was also a ninth level Talent. All things considered, he suspected that even if the Clairvoyant came back from the dead and came at him with his old mecha, he would stand more than a fighting chance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue was also well versed in martial arts, another style which could be employed with mecha suits. He’d tried it before with some success.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“We’ll start with a small team then go from there. Boss, you mustn’t hold back alright?” Su Xiaosu urged. Her mirthful voice sounded a little sinister.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Alright, bring it on.”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo sooner did he say the words than an invitation to spar popped up on his screens. He accepted, and half a moment later Thor was standing in a large arena. It was a standard competition-style battleground.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eHead to head… at least they’re confident.\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e Lan Jue smirked to himself in the sim pod.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThere was a flash of light, and ten more mecha suits appeared on the far side of the arena. They came in all different shapes and sizes, with the only similarity being the Star Division flame standing out against the metal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStar Division received tremendous support, not only from Skyfire Avenue but from the Eastern government itself. All of their pilot data was stored on DreamNet, so as a result they were given two sets of mechas made specifically for them. One was for use out in the real world, and the second was for DreamNet. The two were exactly the same.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue urged Thor to wave at the distant competitors. “Come!”\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eTheir formation seemed sloppy, but the moment they say Thor they shaped up. They raced at him in a semi-circle to try and surround the sapphire mecha.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eNothing special?\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e Lan Jue mused. At first glance it didn’t even look like they were working well together. They approached all at different speeds, but all of them seemed built for melee combat. There wasn’t a single long-range fighter among them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue felt an excitement boiling within him. He had spent so many days in silence with Qianlin, stabilizing his Discipline. It was time to make a little noise.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe wasn’t yet using his Discipline, but Thor raced ahead like a thunderbolt regardless. He made no overtures to juke or break the encirclement – he charged right in.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue had great confidence in his piloting ability, a confidence that came from years of experience. Even if he was facing ten times the number of suits he was sure he could handle them easily. Thor would weave among them like a fish darting through water and destroy his adversaries.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThor was fast, blasted ahead like a beam of light. In no time it reached met the small team. The first one Thor encountered was a larger mecha, a kind he’d never seen before. It was at least twice as large as Thor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA large size meant more energy, power and weight. But it also typically made this sort of suit cumbersome to pilot. Heavy attackers all suffered from this deficiency.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAppearing right in the midst of them so suddenly was also Lan Jue’s attempt at seeing how they’d react. In a flash it vanished again and appeared at their flank. A sword crackling with electric energy was in its grip – Lan Jue’s new preferred weapon.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe couldn’t use Occisus in the simulation, obviously. But now that he’d chosen to use it in real combat, it was also his weapon of choice in DreamNet. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe thrust forward, aiming for the mecha’s armpit. From here the sword would slip right through the armor and into the opponent’s cockpit, immediately putting the suit out of commission.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEven such a simple strike was made very dangerous because of Lan Jue’s speed.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe other team members saw it from a different perspective. The blue beam of light that was Thor appeared suddenly in front of their team leader. Then, leaving behind a warped afterimage, their target swept sideways and stabbed at their comrade.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut the expected did not occur.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis sword hit its target, but Lan Jue immediately felt like something wasn’t right. He didn’t sense any obstruction, his sword sliding in all the way to the hilt. This definitely was not normal.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe hadn’t used any Discipline, and this sword wasn’t especially sharp. What about the suit’s shields? How could his attack have landed so easily?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he pondered the enormous suit toppled on top of him like a corpse. Accompanying it was a powerful vacuum force that came from nowhere. In the same instant the other nine suits fell upon him like a swarm, suddenly several times faster than they had been.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe disjointed unit was suddenly on him, a circle of metal suits that gave him no route of escape.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSurround and destroy?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue’s smile spread bigger. They had a plan after all.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe large mecha was also changing. After falling it had actually started to get larger, trying to keep Thor pinned. His sword and half his suit’s arm was stuck in the expanding trap. This thing seemed less like a suit and more like an ooze. Lan Jue was slowly being devoured by it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat a unique suit! Liquid metal?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue had to make a decision. He was in a dangerous spot, but even now he was not alarmed. He’d seen a lot on the battlefield, and though they had taken him by surprise this wasn’t going to throw him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThor’s body lit up as bolts of electricity shot out in all directions. A sound like thunder burst out from the suit, the sound of its shields. Lan Jue’s mecha was God-ranked, hand-built. Of course it had its own tricks to employ.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe electric wave tearing through the air in the midst of the explosion caused the incoming mechas to pause. Lan Jue used the brief respite to get Thor free. The suit dissolves into a flash of lightning and rose, tearing itself from clutches of the hulking lump of metal keeping it down.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-774\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-776\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-775","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
