{"id":56300,"no":78,"title":"Chapter 78: The Moonfiend Palace","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 78: The Moonfiend Palace\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cstrong\u003e\u0026nbsp;\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e“Drop your weapons, put your hands on your head, and get on the ground!”\u003c/p\u003e\n\u003cp\u003eThe sound of weapons clattering to the floor followed, before every one of the cyan-hooded men netted their fingers atop their head and dropped to their knees. Denizens of the city who chanced by all invariably stared dumbstruck, unable to comprehend what was happening.\u003c/p\u003e\n\u003cp\u003e“Just can’t help yourself, can you Guoguo,” Lan Jue muttered helplessly.\u003c/p\u003e\n\u003cp\u003e“And who said they could point guns at my boss!” Lin Guoguo gave him a resentful look.\u003c/p\u003e\n\u003cp\u003eKe’er snickered. “Guoguo did well! She was only just faster than us.”\u003c/p\u003e\n\u003cp\u003eHe peered dejected towards the city interior. “Originally I’d hoped we could avoid this much noise.”\u003c/p\u003e\n\u003cp\u003eThe ear-piercing notes of an alarm sounded, and from the apex of the palace gates gun muzzles rose up. From the outer sectors of the city several verti-cars were already making their way towards them.\u003c/p\u003e\n\u003cp\u003eKe’er’s elegant brows shot up, but before she could make a move she felt Lan Jue’s hand on her shoulder. In the next moment an electric cloud arose, surrounding the three women and himself. By the time it dissipated, the area they once occupied was empty.\u003c/p\u003e\n\u003cp\u003eIt was only a matter of seconds before the pirate patrol cars arrived at the scene. By the time they did, the kneeling guards had began to come back to their senses, but to a man had no idea what had happened. It didn’t matter, as there was no trace of Lan Jue or his amazons to prove they were ever there.\u003c/p\u003e\n\u003cp\u003eSomewhere else, twisted tendrils of multicolored light swept overhead. Ke’er spoke to the small group that had appeared there. “Boss, your electro-portation is better than it’s ever been! Haven’t you been cripplingly depressed for three years?”\u003c/p\u003e\n\u003cp\u003eLin Guoguo gave her a reprimanding poke, while Mika struggled valiantly to hide a wry chuckle. “That’s our Ke’er, as frank and honest as you can get.”\u003c/p\u003e\n\u003cp\u003eLan Jue gently slapped Mika on the back of her head. “Yeah, because you never talk too much.”\u003c/p\u003e\n\u003cp\u003eMika stuck her tongue out at him. “Picking favorites!”\u003c/p\u003e\n\u003cp\u003eAs the afterglow of the electro-portation faded they found themselves before the gate of the old city.\u003c/p\u003e\n\u003cp\u003e“And who are you?” The clearly confused voice of a silver-hooded guard wafted towards them. him and his partner glared at the four figures that suddenly appeared before them in a cloud of sparks and color.\u003c/p\u003e\n\u003cp\u003eLan Jue lifted his head, and a burst of blue light filled the area. The silver hooded men collapsed. “Little Yue, if you would.” As he spoke, the sound was taken up by a strange blue light, which floated off in to the distance.\u003c/p\u003e\n\u003cp\u003eLightning was, obviously, light. Through proper implementation and reception it was a better mode of sound transmission than a megaphone.\u003c/p\u003e\n\u003cp\u003eA great cry like the call of a bird rose from the palace interior, and in the moments following a golden figure appeared before them.\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003eShe was a golden-robed girl, no older than eighteen or nineteen. She struck a strangely imposing figure, with her arms stretched out at her sides. But it wasn’t her stance that was surprising – instead it was the pair of wings extending from her back. They splayed out behind her, surrounded by a soothing white light. An ancient-looking bronze sword was clutched in her right hand. Despite her appearance, she exuded no sense of impending force or violence.\u003c/p\u003e\n\u003cp\u003eLan Jue looked at the young woman, engrossed. “I don’t believe we’ve had the pleasure. You’ve probably joined the clan in just these last few years. What’s your Discipline?”\u003c/p\u003e\n\u003cp\u003e“Enough!” The girl’s voice was hard, and cold. The bronze sword clutched in her hand sprung in to motion. In the same instant the white light around her wings grew brighter, and began congealing around them. As the blade moved it, too, glowed with an incandescent white light. A distinct sense of holy righteousness swept over them. Great fluctuations of power burst out towards Lan Jue and his companions.\u003c/p\u003e\n\u003cp\u003e“Angelism. Acquired, not congenital? Something you’ve inherited from the Pontiff’s Castle, I imagine.” Lan Jue watched the young woman carefully.\u003c/p\u003e\n\u003cp\u003eShe paused, taken aback, but the hesitation was quickly overtaken by a murderous look in her eyes. She rose to the tips of her toes, and in the space of an instant flashed towards Lan Jue. Her blade stretched out like a piercing white light, ready to separate his head from his body.\u003c/p\u003e\n\u003cp\u003e“\u003cem\u003eHalt\u003c/em\u003e, Luo Shang!” The queenly command rang forth, but was unfortunately a second too late. That violent light had already reached Lan Jue.\u003c/p\u003e\n\u003cp\u003e“Stop!” Lin Guoguo’s voice arose, cold as ice. Her viridian green eyes had became as gold as the girl’s robes.\u003c/p\u003e\n\u003cp\u003eThe young woman’s body shook visibly. She stopped in mid air, while in the same moment a fiery blaze erupted from beside Lan Jue. The wall of flame was like a shield, stopping the girl from advancing further.\u003c/p\u003e\n\u003cp\u003eWhite and red light collided. Nothing could penetrate the ensuing flash. The girl in gold had already retreated, and hovered in the air with wings splayed wide.\u003c/p\u003e\n\u003cp\u003eA figure descend from above, clad in a flowing black dress. She was lithe, and her long black hair flowed freely behind her like a living shadow, falling to her calves. Her skin was white as cream. In fact, it was only her pale red eyes that bore any color. As she floated to the ground, she became the focus of everyone’s attention.\u003c/p\u003e\n\u003cp\u003eScores of silver-hooded men began to pour from the palace gates as the red-eyed woman made her entrance. Among them, two men in gold arrived to stand beside the young woman. One, upon seeing Lan Jue, flinched visibly. Terror fluttered through his eyes.\u003c/p\u003e\n\u003cp\u003e“Empress.” The girl turned towards the woman and called to her respectfully.\u003c/p\u003e\n\u003cp\u003e“Luo Shang, I’ll handle this.” Her voice was hard, her expression worse, and she exuded a palpable sensation of majesty. With her presence alone, the area around them seemed stifled in her aura.\u003c/p\u003e\n\u003cp\u003e“As you command.” She fell back to stand behind her queen. She took up position beside her two golden-robed compatriots.\u003c/p\u003e\n\u003cp\u003eThe woman in black began to slowly, tantalizingly make her way towards Lan Jue. Each step increased the oppressive sense of her aura, filling the air until it was hard to breathe.\u003c/p\u003e\n\u003cp\u003eShe stopped five meters before him.\u003c/p\u003e\n\u003cp\u003eIn the next instant her icy expression melted away like frost before the spring sun. What emerged beneath the chill was an attractive smile. She gave him a light rebuke. “What are you doing here, bullying people?”\u003c/p\u003e\n\u003cp\u003eLan Jue gave an apologetic laugh. “It’s been a long time, Little Yue. I didn’t want it to be like this. Unfortunately, the coms code you gave me for the Crescent City has expired.”\u003c/p\u003e\n\u003cp\u003eThe empress began to walk towards Lan Jue once again, continuing to grumble coquettishly. “It \u003cem\u003ehas\u003c/em\u003e been a long time, and not so much as a word.” As she spoke her hand rose, and rested on Lan Jue’s arm. Were the elite members of the pirate clan in attendance not already looking on in stunned silence, they would be now. Their noble and majestic Empress, reduced to a flirtatious child?\u003c/p\u003e\n\u003cp\u003e“Not so close.” Mika thrust herself between them, face to face with the empress.\u003c/p\u003e\n\u003cp\u003e“Mika… still so hateful,” the woman cooed, her brows wrinkling.\u003c/p\u003e\n\u003cp\u003eMika pushed her black-rimmed glasses higher on hr nose, and lightly shook her head. The motion caused her red hair – previously pulled to a bun atop her head – to tumble down past her shoulders. As they hair came down, it began to change, becoming a garnet red from the root down.\u003c/p\u003e\n\u003cp\u003eA palpable, horrific power arose and swept forth like a tide. The silver-hooded regimens could not stop themselves from retreating a step in apprehension. It was a monstrous aura that was no less throttling than the Empress’ own.\u003c/p\u003e\n\u003cp\u003eSuch was the power of one of Zeus’ Amazons: Mika, the Stygian Succubus!\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-77\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-79\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-78","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
