{"id":57010,"no":788,"title":"Chapter 786: Tribulation Lightning?","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 786: Tribulation Lightning?\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe sole Paragon who seemed to fair well against the staggering force was the Driver, still hovering in the air.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs he watched the golden bolt of lightning viciously strike Lan Jue, a cracking sound surrounded him as well. His own Discipline flared out of his control to create a shell of purple lighting. After striking his friend, the golden lightning released a burst of energy that crested against the Driver’s purple shield. Their clash made his whole body shake, but his Discipline was infused with a pale golden hue.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLuo Xianni watched what was happening in the air above them with shock clear in her eyes. She expected Lan Jue to be immediately turned destroyed, but instead the unexpected revealed itself. Not only did Lan Jue survive, he was still peacefully meditating as before. The image that had emerged in the air behind him was clearer.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat was going on? Tribulation lightning was somehow useless against her son?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe cloud cover above them shifted, changing from gold to deep blue. The light filtered through it and spread across the ground, turning the world blue as well. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe lightning was changing? Typically that was a sign that it was getting stronger.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Pharmacist, standing beside Luo Xianni gaped at the scene as well. Even under the protection of her legendary weapon, she couldn’t move.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue chose this moment to breakthrough because of what he saw from the Pharmacist. She had taken the plunge in the midst of battle as well, and in that moment she had called upon Occisus’ power – summoning the Gates of Slaughter – which frightened away the Violet Prince and allowed them to escape.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHis assumptions were well founded. Breaking through with Qianlin, they could call upon the might of two swords. If they could command something like the Gates of Slaughter, their combined abilities would prove even more potent. It greatly increased their chances of destroying the progenitor.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat he did not anticipate was that their combined breakthrough would inspire such changes to the protogenia around them. The reaction was entirely different than what had occurred for the Pharmacist. They were in an abstruse state that he had no means to control.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe golden cloud became blue, but the aura it exuded only became stronger. It flashed again, and another bolt of pristine blue light lashed at Lan Jue. This time the result was different.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen the golden lightning tore into him, Lan Jue was surrounded by a blooming golden light. It filled him entirely, and shone from his every pore so that everything around him was a shining gold. The manifestation of his dharma was even more distinct.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNow when the blue lightning came crashing down, it struck him dead center and disappeared. There was no flash or outward sign other than the continued clarification of the image at his back. There wasn’t even a blast of thunder, as though Lan Jue had completely absorbed every ounce of energy from it. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Driver watched it all in awe. He couldn’t help it when he spoke. “Hey, this guy… he doesn’t even leave \u003c/span\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eme\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e any. I’d even take the leftovers!” He could acutely feel the benefits Lan Jue’s breakthrough was having on him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe had also absorbed some of the immortal qi from the thunder essence, and through it he knew that the lightning that assailed Lan Jue held similar power. It was also why he was not affected as much as the others, and obtained the greatest benefit.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHowever, Lan Jue completely absorbed the second blast and left nothing for him to draw on. In the last few moments he could sense his powers surged through the Realm of Protogenia and approach Reflection of Heaven and Earth. He was more than halfway there, and if he could just squeeze a little more from his friend’s breakthrough he might be able to cross the threshold! How could he not be impatient?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe corona of light around Lan Jue slowly receded back into his body. He seemed different, not just in his crystalline appearance but also his temperament. A stately and imperial air hung over him, much as it did the tribulation lightning.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe cloud changed again, darkening from blue to purple. The Driver felt this change most prominently, and the power within him rose sharply in response to it. His whole body trembled.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was…\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003ci\u003e\u003cspan style\u003d\"\"\u003eBrrruuummm!!\u003c/span\u003e\u003c/i\u003e\u003cspan style\u003d\"\"\u003e A roar of thunder rattled the earth.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis time the lightning was split in two; one thick and imposing, the other minute and agile. The larger one sought out and struck Lan Jue, while the smaller one arced away and toward the Driver.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhen it landed, the Driver’s body was wracked with shivers. The surge of power burned so badly his eyes rolled back in his skull and slowly merged into him to strengthen his aura at an alarming rate. Something appeared in the air behind him as well, the image of a black hole. Something seemed to be trying to fight its way out from within it.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAll the Paragons below looked on, dumbfounded.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThree times they witnessed the lightning fall from the sky to strike Lan Jue, and three times they saw him unharmed. They could distinguish the effects of this lightning through what it did to the Driver. Almost instantly the aura surrounding their friend rose to its limit. It was unthinkable! When did improving a Paragon’s cultivation become so easy?\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThat’s not to say they weren’t affected. Each of them could sense their essence nourished by this strange power. It wasn’t just cultivation, but their intrinsic knowledge of protogenia that improved. A small but hugely substantive change.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was very difficult to change the protogenia of a Paragon once they solidified it. It only happened when they rose to the next level of power. That was the moment of adjustment. One could imagine how much influence Lan Jue and Qianlin were having, if they could modulate one’s understanding of protogenia.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAfter three blasts of lightning, everything seemed to change.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eYet it wasn’t over. The cloud above them changed color for a third time, now turquoise in hue. Strangely it was nearly translucent, making the sky seem clear and calm.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe progenitor had begun to sag under the power exuded by the cloud. It lay prostrate on the ground, never daring to move for fear it would draw the lightning’s ire.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhat was Nirvana in the face of such intensity? Even the Monarch’s avatar, bearing the might of the Infinite, fled in the face of it. Even a true immortal would deign to elude this legendary presence.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis time, three bolts fell from on high. Though they were all the same color, they bore three distinct qualities.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-785\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-787\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-786","bookId":1509,"creation":"Sep 10, 2019 5:56:07 AM","modification":"Sep 10, 2019 5:56:07 AM"}
