{"id":57067,"no":845,"title":"Chapter 843: Reengage!","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cb\u003eChapter 843: Reengage!\u003c/b\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Jue nodded. “Qianlin has a point. Sister, search with your consciousness. We’ll protect you.” As he spoke he took up Qianlin’s hand.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSo long as the two of them were together, they were confident in their combat abilities. In all of humanity, the only Paragon who surpassed them when they were hand in hand was Jue Di. In fact, if they were to use their Harmonious Swords even Jue Di wouldn’t necessarily beat them in a fight.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis fact was part of the reason why they agreed to undertake this dangerous mission. If he’d really been in danger of being slain by the Violet Prince or Princess, Qianlin was prepared to reveal herself, and the two would have employed the full might of their swords without reservation.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe most dangerous part of their mission was after Lan Jue and the Pharmacist were captured and subdued. If their subjugators changed their mind, Qianlin would have had to face them herself.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003eζ\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eWhile Lan Jue and his team were performing their task, humanity’s armada had moved in to re-engage with the alien forces.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThey received the communication from Lan Jue an hour before the operation was to commence. It surprised the leadership, but Lan Qing had ordered everyone on high alert two hours prior. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe three bastions ships were arrayed in their triangular formation to protect the fleets as they advanced. All together they slowly moved in toward the alien home worlds. Moments after Lan Jue gave his brother confirmation and analysis of their enemy, the admiral shared the data with Kang Hui and Hua Li. However, he did’t share with them Lan Jue’s true mission.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe also did not share with them the fact that their grand assault was also a distraction. It was a two-pronged approach; if the armada was able to defeat their enemies then grand, but if they lost Lan Jue was also fighting for their right to survive.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing and his brother were blood. Especially since the both of them had become Paragons they were connected through this bond. At least up to this point Lan Qing could sense Lan Jue, and knew he was still alive. If he was still breathing so long after sending the last data dump, the signs were good. The plan was proceeding as they’d hoped, presumably, and there was still a chance.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn order to give his brother the best chance at survival, Lan Qing ordered a general offensive. Middle Heaven led the charge, anxious to break the lines and attack Europa. All of its cannons were on full display, but were not yet charging.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eStar Division was already deployed, traveling among the fleet ships. They were responsible for the defense of the entourage behind Middle Heaven.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAmong them were the recently organized Adept corps from the North. They were hand-picked by the Terminator, three thousand strong, and none of them lower than fifth level. They didn’t hold a candle to Star Division, but were nonetheless a boon to have at one’s side on the battlefield.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Dark Citadel’s remaining forces were also ready to engage. Only a few of them piloted mechas, one of them being Mika. She sat within the cockpit of her suit, Jezebel, regarding the scene with a calm expression.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eShe’d tried repeatedly to get in contact with Lan Jue, to no avail. She’d begun to worry for his safety until she received a message from her boss.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHe told her that he’d been dispatched on a secret mission. No matter what happens, he instructed, he had to keep a level head and a steady heart. She couldn’t allow herself to be swallowed up by the darkness.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMika was less anxious after the message. She focused on the remnants of her father’s power, the three hundred representatives of the Dark Citadel. It was a good company, with a fair number of strong fighters. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIt was a bleaker situation for the Pontiff’s Citadel. Metatron and a handful of Archangels were the only ones left by the Pontiff’s side. Su Xiaosu, the one they called the Morning Star, was not among them. They knew where she was, but they also knew her new position. As chief of Star Division, there was no way they were getting to her.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNothing was held back. Every soldier, every weapon was being prepared for the final fight. After five days, Poseidon was also ready to employ its humanoid transformation once more if needed. Middle Heaven’s molinite core was also prepared for peak load.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe waiting had been grueling. For five long days everyone had been living under a cloud of anxiety. Since no one knew when the aliens would complete their evolution, every minute was agonizingly slow as they anticipated the worst. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eGood news come to them from Angel. Several successful resupply shipments had come and gone, and the survivors were doing well. At least they wouldn’t have to worry about looking after the survivors.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eEverything was prepared for the final confrontation between man and monster. The time had come for victory or defeat to be determined. The finality of it settled over soldier and officer alike – billions of lives hung in the balance, and they were aware their chances of success were creeping closer to zero with each passing minute.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eNo one knew for certain when the home worlds would complete their evolution, however they knew this was their last chance to do something about it. Even if the North agreed to send more forces, time had run out. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThis was to be the end, either way.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing had made no attempts to hide the severity of it. He told everyone under his command that if they lost, humanity was lost. \u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe aliens did not float idly by as the armada approached. They moved in to intercept the fleet quickly.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe horde spread out across a wide breadth of space in a way similar to the formation they’d employed last time. Both flanks were populated by typical alien soldiers and their central core were the elite. This time, it was the Violet Prince and Princess who led them.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe Violet Princess’ expression was particularly frigid, and a deeply murderous glint lived in her eyes. An elusive human sensation had been within her grasp and these meddlesome soldiers had interrupted her. She was full of an unspeakable rage.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAs many as twenty two avatars stood by their side. Twenty four of the mightiest enemies humanity had ever faced stood between the last hope of mankind and their ultimate victory. Five of them commanded the power of the Infinite.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn many ways a creature of Infinite-level power was equivalent to a bastion ship. Middle Heaven was about as good as two, maybe three. In the fight to come it would come down to mastery of command.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eBut small and powerful was a deadly combination on the battlefield. That was why Paragons were so highly regarded by military leaders.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe two sides neared. Tyrannosaurus spun its lumbering body to position its main cannon – targeting the cluster of elite aliens.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eSuddenly a harsh orange light began to flicker around Middle Heaven. It looked like it was preparing to charge.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eThe support fleets were in tight formation and their weapons were trained on the enemy forces, ready to fire at a moment’s notice. Their shields were also engaged a full strength which covered them in shimmering shells of opaque light. They waited with baited breath.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA cold light radiated from the Violet Prince’s eyes. He glared at Tyrannosaurus but made no indication he was going to dodge its deadly blast.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eKang Hui stared back, seated within the bastion’s control center. Lan Qing’s face was on the screen beside him as they spoke through their dedicated channel.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Begin!” Lan Qing gave the order, cold and somber. But to Kang Hui, for some reason, it sounded almost fervent.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003e“Firing main cannon!” Kang Hui slammed his hand onto the red button in front of him.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA shudder rumbled through Tyrannosaurus. Then, the cannon released a deafening blast as it fired at the alien commanders.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eA column of white light spat forth that carved a stark path through space. Flagrantly it blazed towards its target.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eIn the same instant, Middle Heaven made its move.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eAn eruption of orange light brighter than ever before was belched from its rear. The warplanet was catapulted forward at tremendous speed. Swarms of drones tumbled from the hangars but didn’t follow the bastion. Instead they spread out and returned to where the rest of the armada waited as though abandoning ship.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eMiddle Heaven and Tyrannosaurus attacked at nearly the same moment. As the Eastern bastion barreled towards its foes it glowed with a blinding orange light in much the same way as before. It looked like it could erupt into its Solar Flare at any moment.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eHow powerful was a bastion’s main cannon? Strong enough that an alien planet would avoid it by any means necessary. They wouldn’t dare risk a directly blow.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan style\u003d\"\"\u003eLan Qing’s opening gambit was a simple one; attack with Tyrannosaurus’ strongest attack and send Middle Heaven in for a kamikaze run. If the aliens didn’t stop him, he would turn An Lun into the most terrifying bomb in all of human history and obliterate Europa. He would sacrifice Middle Heaven if it meant blowing the alien planets into dust.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-842\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-844\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-843","bookId":1509,"creation":"Sep 10, 2019 5:56:08 AM","modification":"Sep 10, 2019 5:56:08 AM"}
