{"id":56309,"no":87,"title":"Chapter 87: The Second Discipline","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp style\u003d\"text-align: center\"\u003e\u003cstrong\u003eChapter 87: The Second Discipline\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eBoom!\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eBlinding flashes of electric light preceded Michael’s inelegant tumble forward as the disembodied hand found it’s mark. But as the strike landed a plume of golden fire issued forth from the splayed wings to fall over Lan Jue.\u003c/p\u003e\n\u003cp\u003eAs the fierce flames consumed him, a flash overtook Lan Jue’s body and he vanished. He reappeared in the air a short distance away, covered in golden flame. Little by little they died away as lightning crackled around him.\u003c/p\u003e\n\u003cp\u003eMichael had already recovered by the time Lan Jue reappeared, and the snaking bolts of lightning that had been coiling around him were burned away by the holy fires. Shock and confusion were behind those flaming eyes.\u003c/p\u003e\n\u003cp\u003e“That speed…”\u003c/p\u003e\n\u003cp\u003eNo ordinary Discipline had produced that speed, or else he wouldn’t have lost the Adventus hold. It was as though Lan Jue simply tore apart space to appear elsewhere, folded reality. Whatever it was, it didn’t fall under the domain of Thunder Discipline.\u003c/p\u003e\n\u003cp\u003eLan Jue glared icicles at Michael, as his arms raised slowly on either side of his body. Slowly the violet bolts of lightning around him vanished, but with each passing second his body grew more and more luminous. He shown with a glaring, white-hot splendor.\u003c/p\u003e\n\u003cp\u003eIn all of the Three Alliances there existed ten Great Paragons, absolute masters of their Talent. They were possessed of a power so great, so terrible, that they were known to be capable of facing down warships by themselves. Both Lan Jue’s Ascension and Michael’s Adventus temporarily pushed them to the boundaries of a Paragon. Others of the Archengels weren’t capable of reaching such a level.\u003c/p\u003e\n\u003cp\u003eBut Michael, at the cusp of Paragon himself, was stunned as he watched Lan Jue. He had underestimated him, this man who he knew not to be greater than a seventh-rank. It was a mistake that lost him his edge. And he wasn’t even employing his supreme form!\u003c/p\u003e\n\u003cp\u003eMichael beat his twelve marvelous wings, launching him forward. His holy blade stretched forth towards Lan Jue as the air around the angel shimmered with ghostly shadows. As he drew closer, the shadows became great whirling tornadoes of holy light that filled the skies, threatening to devour Lan Jue.\u003c/p\u003e\n\u003cp\u003eA mocking sneer turned the Jewelry Master’s lips. The white light encapsulating him pulsed, expanding tremendously as the tornadoes of holy energy fell upon him. He melted in to a pillar of light, shooting up in to the air. Despite the number and ferocity of Michael’s blasts of energy, none could compete with Lan Jue’s speed and he escaped unscathed.\u003c/p\u003e\n\u003cp\u003eThe skies above were washed in white light. A single peal of thunder washed over them as a streak of lightning plunged from above.\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eCRACK!\u003c/em\u003e Michael’s body flashed white, and lightning coiled around him like a hungry serpent thrusting him backward.\u003c/p\u003e\n\u003cp\u003eHe toppled back with another figure, awash in rose-gold light. Lan Jue. None but Michael had been able to see where the attack had come from.\u003c/p\u003e\n\u003cp\u003eThe Angel’s wings began to fade from sight. The dancing fires surrounding Lan Jue slowly started to extinguish. Both figures plummeted towards the ground in free fall.\u003c/p\u003e\n\u003cp\u003eThey didn’t manage to gain some semblance of control until they were a hundred meters from the rapidly approaching ground. Lan jue stabilized, stopping the descent and casting free the golden fires that had surrounded him. Michael, too, recovered. Embraced by an orb of holy light, the electric tendrils that had sent him falling crackled in to nothingness.\u003c/p\u003e\n\u003cp\u003eLan Jue looked silently at his enemy, his features cold and calm. Michael looked back, dark and imposing.\u003c/p\u003e\n\u003cp\u003e“The speed of light. So, it’s not just thunder you command, but also electricity. [2. So here, my head exploded. All throughout the former chapters Lan Jue has been using lightning. His moniker – Zeus – was the gold of lightning. Thunder is simply the sound that accompanies it. Here, however, the author reveals to us that his Discipline was in fact \u003cem\u003ethunder\u003c/em\u003e, which makes no sense, while his \u003cem\u003esecond\u003c/em\u003e discipline is in fact lightning/electricity. Sooo… yeah, dunno what to do with that there.] It’s no wonder, then, that you were capable of achieving your supreme form. That you were such an illustrious figure in the mercenary world. In truth your power is no less than mine. Thunder and lightning. They complement each other – and that’s how you’ve reached ninth-level, ninth-rank.”\u003c/p\u003e\n\u003cp\u003eLan Jue listened as Michael ruminated on the situation, and offered words of his own in a calm, quiet voice. “I was interested in finding out just how long you could hold the Adventus. Your form’s specialty isn’t speed, but overcoming fortifications and disadvantages.”\u003c/p\u003e\n\u003cp\u003eMichael’s face was hard and mean. “So this was all part of your plan. Right down to using your Ascension. All to get me to employ Adventus. I imagine it didn’t even drain you all that much, if you drew on both your Disciplines. All you had to do was endure… wait until my Adventus was spent. Then you’d have your victory, am I right?”\u003c/p\u003e\n\u003cp\u003eA smile finally crept on to Lan Jue’s face. “Life’s easier when you don’t have to explain everything.”\u003c/p\u003e\n\u003cp\u003e“Worthy of the name Zeus,” Michael stated. His face had once more adopted a calm mask. “As smart as you are powerful. Good… very good. A man can only use the supreme form once in a period. Now it looks like you have the upper hand. But our fight isn’t over.”\u003c/p\u003e\n\u003cp\u003eAs he spoke the undulating rays of red and gold diminished until they were no more. His majestic wings were once again that pure, unblemished white of origin.\u003c/p\u003e\n\u003cp\u003eLan Jue’s eyes flashed and, without hesitation, his vanished once again in a column of light.\u003c/p\u003e\n\u003cp\u003eMichael raised his right hand. Thereupon there rested a golden bracelet, bearing a golden angel charm.\u003c/p\u003e\n\u003cp\u003eThe sky thundered, and lightning flashed. But this time no bolts of electricity assaulted Michael. His shield of light remained intact. The world behind the hovering angel grew dark as a black hole quietly rent reality asunder and opened. From within emerged a colossal figure, glimmering golden red. The white light that had warded him from harm shone bright, glowing from the center of the massive figure’s chest.\u003c/p\u003e\n\u003cp\u003eLan Jue appeared once again, looking down upon Michael with a biting glare. “The Angel of War – a fine mecha. Very fine.” He responded by lifting his left hand, looking towards the ring on his little finger.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-86\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/skyfire-avenue/sfl-chapter-88\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/skyfire-avenue/sfl-chapter-87","bookId":1509,"creation":"Sep 10, 2019 5:56:06 AM","modification":"Sep 10, 2019 5:56:06 AM"}
