{"id":8256,"no":13,"title":"Chapter 13","content":"\u003cp\u003eI would therefore beg you to pardon the philosopher Plato for his amatory verse, and relieve me of the necessity of offending against the precepts put by Ennius into the mouth of Neoptolemus by philosophizing at undue length; on the other hand if you refuse to pardon Plato, I am quite ready to suffer blame on this count in his company.\u003c/p\u003e \n\u003cp\u003eI must express my deep gratitude to you, Maximus, for listening with such close attention to these side issues, which are necessary to my defence inasmuch as I am paying back my accusers in their own coin. Your kindness emboldens me to make this further request, that you will listen to all that I have to say by way of prelude to my answer to the main charge with the same courtesy and attention that you have hitherto shown.\u003c/p\u003e \n\u003cp\u003eFor next I have to deal with that long oration, austere as any censor’s, which Pudens delivered on the subject of my mirror. He nearly exploded, so violently did he declaim against the horrid nature of my offence. ‘The philosopher owns a mirror, the philosopher actually possesses a mirror.’ Grant that I possess it: if I denied it, you might really think that your accusation had gone home: still it is by no means a necessary inference that I am in the habit of adorning myself before a mirror. Why! suppose I possessed a theatrical wardrobe, would you venture to argue from that that I am in the frequent habit of wearing the trailing robes of tragedy, the saffron cloak of the mimic dance, or the patchwork suit of the harlequinade? I think not. On the contrary there are plenty of things of which I enjoy the use without the possession.\u003c/p\u003e \n\u003cp\u003eBut if possession is no proof of use nor non-possession of non-use, and if you complain of the fact that I look into the mirror rather than that I possess it, you must go on to show when and in whose presence I have ever looked into it; for as things stand, you make it a greater crime for a philosopher to look upon a mirror than for the uninitiated to gaze upon the mystic emblems of Ceres.\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/638/1066.html","bookId":274,"creation":"Aug 1, 2019 8:24:30 AM","modification":"Aug 1, 2019 8:24:30 AM"}
