{"id":65633,"no":15,"title":"Page 15","content":"\u003cp\u003e“About what?” Alix was getting lost. “You mean the bridesmaids?”\u003c/p\u003e\n\u003cp\u003e“Uh-uh.” She shook her head. “The wedding. It seems all she really wanted was a small wedding, and it was her mother who insisted on this huge affair that cost the earth. And her daddy. He wanted to show off his little girl.” Tammie Lee paused for another breath. “The funny part is that while her parents were arranging an extravagant event, Savannah and Charlie, her fiancé, flew to Vegas and got married.”\u003c/p\u003e\n\u003cp\u003eAlix gasped, and Tammie Lee broke into giggles. “I’d love to have been a fly on the wall when my aunt Dorothea got that phone call.”\u003c/p\u003e\n\u003cp\u003eTammie Lee wrapped her arm around Alix’s. “Her daddy was fit to be tied. Her mama didn’t know what to do. Eventually they went ahead with the big reception, and I have to say it was absolutely lovely. Savannah and Charlie were there greeting their guests as husband and wife, and they were so happy. Oh, I get goose bumps just remembering the way they looked at each other. They were so much in love.”\u003c/p\u003e\n\u003cp\u003e“I know why she ran off to Vegas,” Alix muttered. “Everyone was taking control of her wedding.” And she couldn’t blame Tammie Lee’s cousin for eloping, either.\u003c/p\u003e\n\u003cp\u003e“Fortunately, no one was angry with Savannah for very long,” Tammie Lee went on. “Everyone knew her mother had ridden roughshod over her. Of course, it helped that Savannah had her first child exactly nine months after the wedding.”\u003c/p\u003e\n\u003cp\u003e“And they’re still happy and everything?” Alix asked.\u003c/p\u003e\n\u003cp\u003e“Oh, yes. Savannah’s had three children in the last five years and no one even remembers how her mother tried to take over her wedding.”\u003c/p\u003e\n\u003cp\u003eAlix nodded slowly. Much as she appreciated Jacqueline’s help, Jacqueline and Susan Turner had done exactly the same thing to her. It was as if her opinion no longer mattered and conferring with her was merely an afterthought. The wedding invitations were a good example. The order had been placed before Alix and Jordan had approved Jacqueline and Susan’s decision. Granted, that might be a formality at this stage, but Alix would’ve appreciated seeing their final choice.\u003c/p\u003e\n\u003cp\u003eAlix grinned at her friend. “Are you in the mood for one of those thick, juicy burgers we had the first time we went shopping?”\u003c/p\u003e\n\u003cp\u003e“You bet,” Tammie Lee said enthusiastically and they drove to a fast-food restaurant. Sitting across from her friend and wolfing down a cheeseburger, Alix suddenly understood the point Tammie Lee was trying to make.\u003c/p\u003e\n\u003cp\u003e“Do you think I should be saying something to Jacqueline and Susan Turner?” she asked anxiously.\u003c/p\u003e\n\u003cp\u003e“Well,” Tammie Lee drawled. “That’s up to you. Do you feel they’ve taken over your wedding? Like Savannah’s mama did?”\u003c/p\u003e\n\u003cp\u003e“Yes, they have and even though I don’t like it, I haven’t stopped it, either.” Being on good terms with Jordan’s mother was vital; arguing over the wedding could damage their future relationship. And Jacqueline and Reese had done so much for her already, how could she complain? Alix felt trapped, stuck in a quicksand of glittery invitations and unwieldy guest lists filled with strangers.\u003c/p\u003e\n\u003cp\u003e“Oh, Alix, I probably shouldn’t have said a word…. But I was thinking about Savannah and Charlie and how happy they were after they got back from their Vegas wedding. Oh,” she sighed. “I guess my mouth gets ahead of my brain sometimes. Jacqueline enjoys being part of this and she really believes she’s doing a good thing. She just can’t resist taking control. It’s the way she is.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“She and Reese love you like a daughter.”\u003c/p\u003e\n\u003cp\u003e“I think the world of them, too.” Love wasn’t a word that came easily to her, but Alix did love the Donovans. They’d done more for her than her own parents even knew how to do.\u003c/p\u003e\n\u003cp\u003eTammie Lee took a delicate sip of her Diet Coke before she spoke again. “As I said, Jacqueline can get a bit carried away and while her intentions might be the best, I’m not sure she always makes the right choices for you.”\u003c/p\u003e\n\u003cp\u003e“What now?” Alix asked wearily. “What did she do?”\u003c/p\u003e\n\u003cp\u003eTammie Lee released a long breath. “You might want to check on your flower order,” she said in a low voice.\u003c/p\u003e\n\u003cp\u003eAlix nodded. She’d chosen white daisies for her wedding bouquet. Daisies appealed to her in their utter simplicity and unpretentiousness. But when she’d mentioned her choice to Jacqueline, her friend had cringed visibly and stated that roses were more traditional. The bridesmaids’ flowers had been discussed, too, and Jacqueline had overruled Alix’s preference there, as well. Alix had tried to insist, but apparently Jacqueline hadn’t been able to accept her decision, after all.\u003c/p\u003e\n\u003cp\u003e“Thanks for the heads-up,” Alix said. As soon as she could, she’d go to Susannah’s Garden and change the flower order back to white daisies.\u003c/p\u003e\n\u003cp\u003eAn hour later, Alix met Jordan on the Seattle waterfront. He was standing near the ferry dock when she joined him for their afternoon date. Because of the wedding, neither of them had extra money for frivolous things like dinners out. A movie was a rare treat these days. Since the ferry was relatively cheap, they’d decided to ride it to Bremerton, where they’d explore the newly renovated waterfront.\u003c/p\u003e\n\u003cp\u003e“Hi,” Jordan said, greeting her with a fervent hug. They attracted a bit of attention. Alix was used to that. Jordan was clean-cut in crisp jeans and a shirt with a button-down collar and a light jacket. She hadn’t altered her own dress style and wore mostly jeans, black leather and of course her combat boots. The two of them looked about as different as it was possible for any two people to look. It never bothered her and apparently her fashion choices hadn’t distressed him, either.\u003c/p\u003e\n\u003cp\u003eThey walked onto the ferry for the early-afternoon trip, moving inside when it began to rain. Jordan purchased them each a cup of coffee, which they drank gazing out at Seattle, rapidly disappearing into the foggy distance.\u003c/p\u003e\n\u003cp\u003e“How’d the fitting go?” Jordan asked. He put his coffee on the table in front of them and held her hand.\u003c/p\u003e\n\u003cp\u003e“All right, I guess.” Alix noticed a seagull flying outside the ferry window. She longed to tell Jordan how beautiful the dress was and how pretty she felt wearing it, but she didn’t. The thought of talking about this made her feel shy. Like a young, inexperienced girl—the virgin bride she wasn’t. Instead, she drew his attention to the seagull that was keeping pace with the ferry.\u003c/p\u003e\n\u003cp\u003e“Would you like to start moving your stuff over to my place?” Jordan asked a moment later. They’d decided his tiny apartment would be their first home.\u003c/p\u003e\n\u003cp\u003eThe question surprised her. “It’s a little early, don’t you think?” The wedding was almost three months away. They had plenty of time to arrange all that. Besides, everything she owned could be transported in a single load. Well, maybe two.\u003c/p\u003e\n\u003cp\u003eJordan stared down at their clasped hands. “I can hardly wait to be married to you.”\u003c/p\u003e\n\u003cp\u003e“Me, neither.” Happiness like this was foreign to Alix and sometimes it made her uncomfortable. For most of her life, happiness had been fleeting. She’d learned that the minute anything good came along, someone or something would take it away from her. She still believed that. It was a bad habit she was working hard to break, this attitude of waiting for the negative, expecting it.\u003c/p\u003e\n\u003cp\u003eJordan slid his arm around her shoulders and she nestled against him. “You know, if we saved ten percent from each of our paychecks, within a couple of years we’d have enough to make a down payment on a house.”\u003c/p\u003e\n\u003cp\u003e“You want to buy a house?” Alix asked, her head spinning at the very idea.\u003c/p\u003e\n\u003cp\u003e“Don’t you?” He sounded surprised.\u003c/p\u003e\n\u003cp\u003e“I guess,” she answered with a shrug. “I hadn’t given it any thought.”\u003c/p\u003e\n\u003cp\u003e“With our budget, the house’ll have to be small. Seattle real estate’s pretty pricey.”\u003c/p\u003e\n\u003cp\u003e“I’ve never lived in a house I owned,” she said breathlessly. The concept was an unfamiliar one. Living in a place without a landlord who’d be responsible for its care and upkeep. Not that any landlord she’d ever had came around to fix whatever went wrong. Except for the Donovans, but that wasn’t really a landlord-tenant relationship.\u003c/p\u003e\n\u003cp\u003e“How does that seem to you?” Jordan asked.\u003c/p\u003e\n\u003cp\u003e“Good.” Actually it was better than good. It was…thrilling. Never in her whole life had Alix thought she’d own a real home. Then again, she’d never dreamed she’d marry Jordan Turner, either.\u003c/p\u003e\n\u003cp\u003eHis parents’ place was provided by his father’s church in the nearby town of Burien, but Jordan, as youth pastor at the Free Methodist Church off Blossom Street, only got a small housing allowance.\u003c/p\u003e\n\u003cp\u003e“Eventually, we’re going to need more than two bedrooms,” she said casually, thinking they’d be having children someday. She’d like two, maybe three, if Jordan agreed. She didn’t have much confidence in her ability to be a mother, but she already knew that love could compensate for a lot.\u003c/p\u003e\n\u003cp\u003eGrinning, Jordan stared out over the dark green waters of Puget Sound. “I’ve been doing a lot of thinking about the bedroom myself.”\u003c/p\u003e\n\u003cp\u003e“Jordan Turner, are you talking about…dare I say the word?”\u003c/p\u003e\n\u003cp\u003eJordan chuckled. “Yeah, I am. S-E-X. I’m a healthy, normal male who’s marrying the woman he’s crazy about.”\u003c/p\u003e\n\u003cp\u003eAlix snuggled closer to his side. “I’m looking forward to living with you, too.”\u003c/p\u003e\n\u003cp\u003e“In the beginning I’ll use one of the extra bedrooms for a study.”\u003c/p\u003e\n\u003cp\u003e“What bedrooms?” Jordan seemed to forget that he lived in a bottom-level one-bedroom apartment two blocks off Blossom Street.\u003c/p\u003e\n\u003cp\u003e“In the house we’re buying.”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah, that house,” Alix said, joining in his game. “I’ll need a big kitchen, though.”\u003c/p\u003e\n\u003cp\u003e“Of course. Will you cook for me?”\u003c/p\u003e\n\u003cp\u003e“It will be my pleasure.”\u003c/p\u003e\n\u003cp\u003e“Big meals on Sunday after church.”\u003c/p\u003e\n\u003cp\u003e“Absolutely.”\u003c/p\u003e\n\u003cp\u003eJordan kissed her neck.\u003c/p\u003e\n\u003cp\u003e“There should be plenty of room in the backyard for the kids to run and play,” she said.\u003c/p\u003e\n\u003cp\u003e“Kids?” he asked, eyebrows arching.\u003c/p\u003e\n\u003cp\u003e“Not right away.”\u003c/p\u003e\n\u003cp\u003eJordan closed his eyes and sighed. “I’m so happy, Alix. I’ve never been this happy.”\u003c/p\u003e\n\u003cp\u003e“Me, too.” Alix was beginning to trust that her happiness with Jordan wouldn’t be snatched away by a cruel or indifferent fate. It was a heady and unusual feeling, but one she could easily get used to. Wanted to get used to.\u003c/p\u003e\n\u003cp\u003eShe just had to survive the wedding first.\u003c/p\u003e\n\u003cp\u003eCHAPTER 11\u003c/p\u003e\n\u003cp\u003eColette Blake\u003c/p\u003e\n\u003cp\u003eMarch was traditionally a slow month in the flower business; Colette remembered that from the time she’d worked in her mother’s shop. The Valentine’s rush was over, it was too early for Easter and Mother’s Day, and school proms hadn’t started.\u003c/p\u003e\n\u003cp\u003eSusannah worked hard at attracting customers to the store. She ran a weekly draw that anyone could enter and on slow days, she and Colette took turns standing on Blossom Street and giving away single flowers with a tag attached that advertised the store. This week, it was green carnations in honor of St. Patrick’s Day. \u003c/p\u003e","sourceLink":"https://allnovel.net/back-on-blossom-street-blossom-street-4/page-15.html","bookId":1936,"creation":"Oct 5, 2019 9:58:25 AM","modification":"Oct 5, 2019 9:58:25 AM"}
