{"id":65639,"no":21,"title":"Page 21","content":"\u003cp\u003eHe cocked his head. “But you’ll notice I didn’t bring you to any of those restaurants.”\u003c/p\u003e\n\u003cp\u003eColette found it impossible not to smile. “So that’s why we had to drive an hour outside of Seattle. You’ve gone through the entire roster of fine dining establishments in all of King County.”\u003c/p\u003e\n\u003cp\u003eChristian was saved from having to answer when the waiter came for their dinner order. After he’d left, the subject changed and they discussed mutual acquaintances. It was common ground, and safe.\u003c/p\u003e\n\u003cp\u003eTo say the meal was divine would be an understatement. Every course, from the roasted tomato soup with hot rosemary-scented rolls to the hearts-of-palm salad to her entrée was so delicious it practically dissolved on her tongue.\u003c/p\u003e\n\u003cp\u003e“You didn’t drink your champagne,” Christian said as the waiter carried off their dinner plates. He gestured at the full glass that had remained untouched throughout the meal.\u003c/p\u003e\n\u003cp\u003e“No, I didn’t.”\u003c/p\u003e\n\u003cp\u003eHis expression sobered as he stared at her intently. “Why? Because being with me is nothing to celebrate? Or is there some other reason?”\u003c/p\u003e\n\u003cp\u003eThat comment made her flinch, but it was the perfect lead-in for what she had to tell him—and she would have, had their conversation gone another way. Instead, she’d learned that he was relying on attorneys to rescue him from the law. Under the circumstances, Colette didn’t feel she could let him know, not right now. She had to wait, see what the next few months would bring.\u003c/p\u003e\n\u003cp\u003e“Are you trying to ask me if I’m pregnant?” she asked, smiling as though the question was patently absurd. “I already gave you my answer, remember? I have no reason to lie.”\u003c/p\u003e\n\u003cp\u003eThe tension visibly eased from his shoulders.\u003c/p\u003e\n\u003cp\u003e“However, if I was,” she said, purposely testing him, “I’d certainly know your feelings on the matter, wouldn’t I?”\u003c/p\u003e\n\u003cp\u003eIt was plain that talk of a pregnancy had unsettled him.\u003c/p\u003e\n\u003cp\u003e“Since it’s a moot point, I don’t think we need to belabor it.”\u003c/p\u003e\n\u003cp\u003eColette nodded vigorously. “My feelings exactly.”\u003c/p\u003e\n\u003cp\u003eHe sipped from his second glass of champagne as they read the dessert menu. Everything sounded delectable, and Colette was certainly tempted, but in the end declined and ordered tea instead. Christian did the same. Soon afterward, he settled the bill and they prepared to return to Seattle.\u003c/p\u003e\n\u003cp\u003eOn the drive back, despite her best efforts to stay awake, Colette drifted off. The car was cozily warm, the ride smooth, the music soft. When he turned onto Blossom Street, she suddenly woke up, feeling disoriented for a moment. She glanced at his unyielding profile, then looked out at the familiar street.\u003c/p\u003e\n\u003cp\u003eInstead of parking on Blossom as he had earlier, Christian drove into the alley near the rear entrance to her apartment. He switched off the engine and they sat in the dark. There seemed little to say.\u003c/p\u003e\n\u003cp\u003eA feeling of sadness came over her, and she felt regret that their relationship had dwindled down to this—mutually kept secrets, mutually told lies.\u003c/p\u003e\n\u003cp\u003e“Christian, listen—” she began, but he cut her off.\u003c/p\u003e\n\u003cp\u003e“Before you say anything, I’d like to make a comment, if you don’t mind.”\u003c/p\u003e\n\u003cp\u003e“No, go ahead.”\u003c/p\u003e\n\u003cp\u003e“We both agree that our…liaison, for lack of a better term, should never have happened,” he said. He appeared to be choosing his words deliberately.\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“It was a mistake,” he said quietly, “and I apologize for my part in it.”\u003c/p\u003e\n\u003cp\u003e“I do, too.” Christian shouldn’t assume all the responsibility for something in which she’d been a willing partner. “Please, Christian, I’d rather not talk about it.”\u003c/p\u003e\n\u003cp\u003e“What I realize now is that by giving in to my—”\u003c/p\u003e\n\u003cp\u003e“Christian.” She placed her hand on the door handle, ready to end this uncomfortable discussion. He couldn’t say anything she hadn’t said to herself a hundred times. “This isn’t doing either of us any good. It happened. As you said, it shouldn’t have, but it did. I don’t blame you and I hope you don’t blame me.”\u003c/p\u003e\n\u003cp\u003e“Of course not.”\u003c/p\u003e\n\u003cp\u003e“Fine. Then let’s leave it. You said you wanted to end things on a positive note. We have. It’s over. I wish it didn’t have to end at all, but I can’t be a party to what you’re doing.”\u003c/p\u003e\n\u003cp\u003e“And I accept that.”\u003c/p\u003e\n\u003cp\u003eShe opened the door. “Then this is goodbye.”\u003c/p\u003e\n\u003cp\u003e“Yes.” His voice was a hoarse whisper.\u003c/p\u003e\n\u003cp\u003eShe started to climb out of the car.\u003c/p\u003e\n\u003cp\u003e“Colette,” he said. Stopping her, he reached for her hand. “If you need anything, please contact me.”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “Thank you, but no.”\u003c/p\u003e\n\u003cp\u003eEven in the darkness she knew he was smiling. “Somehow I figured you’d say that.”\u003c/p\u003e\n\u003cp\u003e“Take care of yourself, Christian.”\u003c/p\u003e\n\u003cp\u003e“You, too.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” she said. “I’m really sorry. About…everything.”\u003c/p\u003e\n\u003cp\u003eChristian released her hand. “I meant what I said, Colette. I won’t trouble you again.”\u003c/p\u003e\n\u003cp\u003eShe swallowed, nodding slowly, unable to speak.\u003c/p\u003e\n\u003cp\u003e“I want only the best for you,” he added.\u003c/p\u003e\n\u003cp\u003eHe opened the car door, and the interior light illuminated the alley with its concrete parking spaces and winter-bare tree. He walked around to the passenger side and helped her out, his hand clasping hers a little longer and a little harder than necessary.\u003c/p\u003e\n\u003cp\u003eIt looked for a moment as if he intended to kiss her. Instead, he backed away and dropped her hand. Colette fumbled inside her purse for her keys; when she glanced up, she knew with certainty that this would be the last time she’d ever see Christian Dempsey.\u003c/p\u003e\n\u003cp\u003eHe nodded once, then got back into the car, waiting long enough for her to unlock her door before he disappeared into the night.\u003c/p\u003e\n\u003cp\u003eCHAPTER 15\u003c/p\u003e\n\u003cp\u003e“…there are no knitting police.”\u003c/p\u003e\n\u003cp\u003eStephanie Pearl-McPhee from her book Knitting Rules! Storey Publishing, 2006\u003c/p\u003e\n\u003cp\u003eLydia Goetz\u003c/p\u003e\n\u003cp\u003eI was on my feet from the moment I walked into A Good Yarn until I flipped the lock and turned over the Closed sign at the end of a very long afternoon. We did a booming business, with thirty-eight sales. By anyone’s standards, it was an excellent business day. I attributed this to the fact that it was now April, and spring had well and truly arrived.\u003c/p\u003e\n\u003cp\u003eFortunately, Margaret seemed to be in a better mood. Although we didn’t have a spare moment to discuss it, I had the feeling the police were closing in on a suspect. Margaret had said she’d heard there was promising news but that was all she was able to tell me.\u003c/p\u003e\n\u003cp\u003eToward the end of the day, we’d had a couple of unexpected visitors—Carol Girard and her son, Cameron. I was eager to tell Brad about Carol’s news.\u003c/p\u003e\n\u003cp\u003eWhen I got home, Brad had already started dinner, to my relief. I’d put three boneless chicken breasts in a marinade of buttermilk and ranch dressing spices that morning, and there was leftover coleslaw from the night before, plus Cody’s favorite, Tater Tots.\u003c/p\u003e\n\u003cp\u003eOur son was in the backyard throwing balls around with a couple of neighborhood kids. As always, Chase was with him, barking and running after all the loose balls. The sound of Cody’s excited young voice drifted toward me, and tired though I was, I felt a surge of happiness knowing that right outside this window was my son.\u003c/p\u003e\n\u003cp\u003e“Hi, sweetheart.” I kissed Brad and he slipped an arm around me.\u003c/p\u003e\n\u003cp\u003e“How was your day?” I asked.\u003c/p\u003e\n\u003cp\u003e“Better, now that you’re home.” He smiled. “Aside from that, busy.”\u003c/p\u003e\n\u003cp\u003eI set my purse on the kitchen counter. “Mine, too.” Since Brad works for UPS, he has to meet a daily quota or “delivery expectation” every day, which means he’s constantly on the go.\u003c/p\u003e\n\u003cp\u003eI took a tray of raw cut-up vegetables and dip from the refrigerator. It was difficult to get Cody to eat vegetables and he could be downright inventive at finding reasons he shouldn’t have to. When he was eight, he’d announced in an earnest voice that God had personally spoken to him. When Brad asked him what divine message had been revealed, Cody had said that, according to God, he shouldn’t eat any more green beans.\u003c/p\u003e\n\u003cp\u003e“What’s so funny?” Brad asked, turning away from the stove.\u003c/p\u003e\n\u003cp\u003e“I was just thinking about God telling Cody he didn’t have to eat green beans.”\u003c/p\u003e\n\u003cp\u003eBrad laughed out loud. “Good thing the kid likes raw carrots and broccoli.”\u003c/p\u003e\n\u003cp\u003e“I suspect that has more to do with the dip,” I said, but at least he was putting something green and orange in his mouth that didn’t contain sugar.\u003c/p\u003e\n\u003cp\u003eI opened the silverware drawer and extracted what we needed for the evening meal. “Carol Girard stopped in this afternoon,” I said.\u003c/p\u003e\n\u003cp\u003eCarol was a good friend and one of my very first customers. When I met her, she and her husband, Doug, had been experiencing fertility problems. In an effort to reduce her stress and prepare for the IVF treatments, Carol had quit her job.\u003c/p\u003e\n\u003cp\u003eAfter working in a high-pressure position as an investment banker, she’d discovered that staying home wasn’t as easy as she’d assumed. She’d grown restless and bored. Carol had wandered into the yarn store during one of the lengthy walks she’d started taking—and when she learned the class would be knitting a baby blanket, she felt it was a sign that she’d have her baby.\u003c/p\u003e\n\u003cp\u003eTheir prayers were answered, but not in a way anyone had expected. She and Doug had adopted a baby boy they’d named Cameron.\u003c/p\u003e\n\u003cp\u003e“How is Carol?”\u003c/p\u003e\n\u003cp\u003eI looked my husband straight in the eye, grinning widely. “She’s pregnant.”\u003c/p\u003e\n\u003cp\u003e“Carol?” A smile broke out.\u003c/p\u003e\n\u003cp\u003eI nodded. I knew what he was thinking because that very thought had gone through my mind, too. Doug and Carol had spent thousands upon thousands of dollars trying to conceive. They’d finally given up on ever having a child—and then they’d adopted Cameron. And now…\u003c/p\u003e\n\u003cp\u003e“She’s sure?”\u003c/p\u003e\n\u003cp\u003e“Three months sure,” I told him.\u003c/p\u003e\n\u003cp\u003eAs I recalled, there was no medical reason Carol couldn’t conceive. It had just never happened, despite every test and procedure modern medicine could provide.\u003c/p\u003e\n\u003cp\u003e“I’ll bet Doug’s happy,” Brad said. Like my own husband, Doug was one of those men who value family—a natural dad.\u003c/p\u003e\n\u003cp\u003e“Doug is thrilled. So’s Cameron—they’ve told him he’s going to be a big brother.” The three-year-old was as excited as his parents. While they were in the yarn store, he’d wanted Carol to buy a plush lamb I had on display for what he called “Mama’s baby.”\u003c/p\u003e\n\u003cp\u003e“I’m glad for them,” Brad told me. “Why don’t we have them over sometime soon? We’ll celebrate.”\u003c/p\u003e\n\u003cp\u003eI nodded. I’d been on an emotional high ever since I’d heard the news. I knew Jacqueline and Alix would share my feelings. A new baby pattern book had arrived earlier in the week and I planned to knit a project out of it. Maybe another baby blanket. I could envision a reunion of that first knitting class in a few months. We’d present Carol with hand-knit gifts to welcome this new baby.\u003c/p\u003e\n\u003cp\u003eThe high lasted until later that night as I got ready for bed. I was washing my face when it hit me. Carol’s pregnancy had suddenly, cruelly reminded me: I would never have a baby. The emotional punch came out of nowhere and struck with such intensity that I closed my eyes and leaned against the bathroom counter. I held my breath until the pain began to subside. \u003c/p\u003e","sourceLink":"https://allnovel.net/back-on-blossom-street-blossom-street-4/page-21.html","bookId":1936,"creation":"Oct 5, 2019 9:58:25 AM","modification":"Oct 5, 2019 9:58:25 AM"}
