{"id":65644,"no":26,"title":"Page 26","content":"\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eThe bell above the door jingled as she left and Whiskers, my lazy cat, raised his head, then stretched his well-fed body in the warm afternoon sun.\u003c/p\u003e\n\u003cp\u003eAs soon as Margaret was gone, I went back to the conversation. “Okay,” I said to Hailey, “put your sister on the line.”\u003c/p\u003e\n\u003cp\u003e“Here. Julia, talk to Aunt Lydia,” Hailey said.\u003c/p\u003e\n\u003cp\u003e“Julia,” I said softly, trying to encourage her. “Sweetie, tell me what’s wrong.”\u003c/p\u003e\n\u003cp\u003eShe hiccuped a couple of sobs. “I…I don’t know. I can’t stop crying.”\u003c/p\u003e\n\u003cp\u003e“Are you frightened?” I asked, thinking something must have happened to trigger this emotional breakdown.\u003c/p\u003e\n\u003cp\u003e“Yes…I can’t sleep. I try and try.”\u003c/p\u003e\n\u003cp\u003eMargaret had told me how poorly Julia had been sleeping after the incident. The carjacking had taken place more than two months ago and I’d thought Julia was doing better. Apparently not.\u003c/p\u003e\n\u003cp\u003e“Have you talked to anyone?” I asked.\u003c/p\u003e\n\u003cp\u003e“No.” The word was accompanied by a sob.\u003c/p\u003e\n\u003cp\u003e“Are you ready to talk?”\u003c/p\u003e\n\u003cp\u003e“No!” she screamed, anger taking control. “I want to forget. Why did he have to pick me? I hate him…I hate him.” She sobbed again, harder this time, almost wailing. “Why won’t everyone just leave me alone? It’s all anyone wants to talk about. I can’t stand my life…I don’t want to live anymore.”\u003c/p\u003e\n\u003cp\u003eNow I understood why Hailey was so frightened. “Sweetheart, don’t say that.”\u003c/p\u003e\n\u003cp\u003eJulia must have tossed the phone away, because I heard a loud clang and soon afterward Hailey was on the line again. “She’s still crying, only now she’s got her face on the floor.”\u003c/p\u003e\n\u003cp\u003eJulia screamed an obscenity that made me blink a couple of times.\u003c/p\u003e\n\u003cp\u003eHailey gasped. “What should I do, Aunt Lydia?”\u003c/p\u003e\n\u003cp\u003e“I’d better tell your mother about this.”\u003c/p\u003e\n\u003cp\u003e“Can she come home?”\u003c/p\u003e\n\u003cp\u003e“Of course.” Julia might not want to see Margaret, but it was evident to me that she needed to talk to someone, perhaps a counselor or her doctor.\u003c/p\u003e\n\u003cp\u003eA few minutes later, after I’d reassured Hailey as well as I could, Margaret returned. “Alix was working as the barista,” Margaret told me, grinning. It’d been such a long time since I’d seen my sister this carefree that I hated having to tell her about Julia.\u003c/p\u003e\n\u003cp\u003e“That was Hailey on the phone,” I said.\u003c/p\u003e\n\u003cp\u003eThe animation immediately left her face. “Is everything all right with Julia?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “I think she’s having some kind of breakdown.”\u003c/p\u003e\n\u003cp\u003eThe color drained out of Margaret’s face. The reprieve was over. She tensed and for a moment seemed rooted to the spot, frozen with indecision about what she should do.\u003c/p\u003e\n\u003cp\u003e“She needs you,” I told her. “She’s talking nonsense.” I couldn’t tell her Julia was talking about not wanting to live anymore. It terrified me that she’d even suggested…\u003c/p\u003e\n\u003cp\u003eMargaret stared into the distance.\u003c/p\u003e\n\u003cp\u003e“Go home and call me once you’re there so I know everything’s okay. Leave now, Margaret.”\u003c/p\u003e\n\u003cp\u003eMy sister nodded.\u003c/p\u003e\n\u003cp\u003eI went to her then and hugged her. “Everything’s going to be fine,” I assured her and I prayed that was true.\u003c/p\u003e\n\u003cp\u003eMargaret left. As soon as I saw her drive away, I wished I’d closed the shop and gone with her. I wasn’t sure it was a good idea to let her deal with this by herself.\u003c/p\u003e\n\u003cp\u003eAn eternity passed before the phone rang again. When I picked up, it was Hailey. I didn’t recognize her voice at first because she was crying so hard. “My mom and dad are here,” she sobbed into the phone. “They decided to take Julia to the hospital. Daddy thinks Julia needs professional help.”\u003c/p\u003e\n\u003cp\u003eA hard lump formed in my throat.\u003c/p\u003e\n\u003cp\u003e“I’m coming over,” I told Hailey.\u003c/p\u003e\n\u003cp\u003e“They don’t want me to go with them and I don’t want to be here by myself.”\u003c/p\u003e\n\u003cp\u003e“I’m on my way.” I’d never just left the shop like this. Even when Margaret and I learned that our mother had been found unconscious at home, Jacqueline had been here to take over.\u003c/p\u003e\n\u003cp\u003eAfter reassuring Hailey, I called Brad on his cell and told him what had happened. He confirmed that I should put a note on the door, lock up and leave right away. I promised to phone him as soon as I had any news.\u003c/p\u003e\n\u003cp\u003eI don’t even remember getting in my car and driving to Matt and Margaret’s house. The minute I pulled up in front and parked, the door banged open and Hailey raced down the steps and hurled herself into my arms, sobbing.\u003c/p\u003e\n\u003cp\u003eHolding her tightly, I stroked her hair. I noticed two neighbors watching us, and knowing what a private person my sister is, I kissed the top of Hailey’s head and steered her back toward the house.\u003c/p\u003e\n\u003cp\u003eOnce inside, she got herself a tissue and blew her nose loudly.\u003c/p\u003e\n\u003cp\u003e“Do you know what set Julia off?” I asked, wondering why this had happened now.\u003c/p\u003e\n\u003cp\u003eHailey shook her head.\u003c/p\u003e\n\u003cp\u003eI put on water to make tea. Tea always seemed to calm me and I hoped it would help my niece, too.\u003c/p\u003e\n\u003cp\u003e“Mom tried to talk to Julia. She said the man’s going to be caught and the police are making an arrest soon.”\u003c/p\u003e\n\u003cp\u003eThat was the same news Margaret had given me. “Did that make any difference?” I asked.\u003c/p\u003e\n\u003cp\u003e“No.” Hailey stared up at me with tearful eyes. “Julia just kept crying. She tried to stop. I could tell she wanted to, but she couldn’t do it. It’s like…like she’s kept everything inside and then it all just broke loose.” She bit her lip and looked as if she might start weeping again herself.\u003c/p\u003e\n\u003cp\u003eThe tea kettle whistled and I immediately tended to it. I poured the boiling water into a ceramic pot that had once belonged to our mother and added plenty of sugar to our cups, thinking the events of the afternoon warranted it.\u003c/p\u003e\n\u003cp\u003e“Tell me exactly what happened,” I said, carrying our tea to the table and sitting down next to Hailey.\u003c/p\u003e\n\u003cp\u003eMy niece frowned, as though trying to remember the details. “Julia was home before me and I could see she’d been crying.” She gestured at the tissues scattered about the kitchen. “I asked her if everything was okay, and she said…she said she wanted to die.”\u003c/p\u003e\n\u003cp\u003eI couldn’t help it; I swallowed a gasp just hearing those words again.\u003c/p\u003e\n\u003cp\u003e“Julia said…she said everyone looks at her. That’s not true, Aunt Lydia! No one looks at her any different than they did before—she just thinks they do.”\u003c/p\u003e\n\u003cp\u003e“I know.” I wondered if there’d been any other signs of trouble since the carjacking.\u003c/p\u003e\n\u003cp\u003e“When Mom got here, Julia started talking about dying again and Mom phoned Dad. When he got here, he said we had to get Julia to a hospital.” She sipped her tea and sucked in a wobbly breath as she made a determined effort to hold in her emotions. “Julia scared me.”\u003c/p\u003e\n\u003cp\u003e“How?” I asked.\u003c/p\u003e\n\u003cp\u003e“I think she might’ve done it…She might’ve actually killed herself. She looked so desperate and I think…I think she really meant it. That’s why I called the shop. I was so glad when you answered. I…I—” She shook her head, unable to go on.\u003c/p\u003e\n\u003cp\u003e“You did the right thing,” I said, trying to comfort her.\u003c/p\u003e\n\u003cp\u003e“I know.” She held the mug with both hands. “It isn’t right that a strange man could hurt Julia like this.”\u003c/p\u003e\n\u003cp\u003e“No, it isn’t,” I agreed.\u003c/p\u003e\n\u003cp\u003e“He broke her arm, but he did more than that. He broke her spirit, too—that’s what my dad says,” she told me in a solemn voice. “Julia isn’t the same person she used to be. I hardly know her anymore.”\u003c/p\u003e\n\u003cp\u003eI’d seen a change in Julia, too, and I was with her a whole lot less than her family. When it happened, the attack had seemed terrible enough. But I’d had no idea how far-reaching the impact on my niece and my sister would be.\u003c/p\u003e\n\u003cp\u003eAnother two hours passed before the phone rang. Hailey nearly threw herself against the wall in her eagerness to answer it. As soon as she did, her gaze flew to me.\u003c/p\u003e\n\u003cp\u003e“Aunt Lydia’s here with me,” she said into the receiver. Following that, she nodded a couple of times. A minute later, she said, “Okay,” and hung up. Then she burst into tears. “The hospital’s going to keep Julia overnight—they have her on suicide watch.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 19\u003c/p\u003e\n\u003cp\u003eAlix Townsend\u003c/p\u003e\n\u003cp\u003e“I want to bake my own wedding cake,” Alix said. She looked at her future mother-in-law and Jacqueline, who both sat across the table from her. They were in Jacqueline’s home, and this meeting was one Alix had delayed as long as she dared. The last time she’d been involved in a wedding discussion had been the Saturday she’d gone to the gym with Colette. Susan had already determined the entire menu for the rehearsal dinner. Why, Alix wondered, had Susan even gone through the facade of soliciting her opinion?\u003c/p\u003e\n\u003cp\u003eInstinctively she knew these two women she loved would try to thwart her on the issue of the cake. Alix had done her best to be amenable, biting her tongue, sweeping aside her natural inclinations. The wedding cake, however, was a different matter. Her professional pride was on the line.\u003c/p\u003e\n\u003cp\u003e“Alix,” Jacqueline said, sounding sympathetic and conciliatory. “It’s perfectly understandable that you’d want to make your own wedding cake. You’re a baker—it’s what you do.” She gestured vaguely. “But, darling, you’ve got so many other things to worry about.”\u003c/p\u003e\n\u003cp\u003e“Actually, I’m looking forward to it,” Alix insisted. She practically needed diplomatic training to prepare for this wedding. With tolerance and patience (Jordan’s words, not hers), hoping to inspire unity (again from Jordan), Alix had all but given Jacqueline and Susan Turner free rein. However, with the wedding cake, she was determined to get her own way. She had a very distinct idea of what she wanted.\u003c/p\u003e\n\u003cp\u003e“You’re going to be far too busy to spend time on the cake,” Susan chimed in, agreeing with Jacqueline.\u003c/p\u003e\n\u003cp\u003eThe two older women had become friends during all of this. Alix was pleased for them both—and alarmed that neither seemed to realize how much they’d alienated her in the process. They had a vision of what they wanted this wedding to be and as far as Alix could figure, she and Jordan were just props. Alix tried to remember that they loved her and were doing this for her and for Jordan.\u003c/p\u003e\n\u003cp\u003e“Actually, I’d like something to take my mind off things,” Alix said. Every time she had to deal with another aspect of this stupid wedding, her skin started to itch.\u003c/p\u003e\n\u003cp\u003e“Alix,” Jacqueline said in the same tone of voice she used when speaking to three-year-old Amelia. “I don’t think you recognize the pressure you’re putting on yourself.” She shook her head. “Susan and I aren’t saying you can’t bake your cake.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” Alix felt some of the tension leave her shoulders. She reached for her coffee and sipped from the edge of the cup. She didn’t usually drink coffee from anything other than a mug, but Jacqueline didn’t own one. Everything was top-of-the-line china for her.\u003c/p\u003e\n\u003cp\u003eNow that her friend was a grandmother twice over, she’d compromised her standards—to a degree. The kitchen was a good example; the cupboards were still stacked with the finest dinnerware, while the bottom drawers contained an assortment of toys and children’s eating utensils. \u003c/p\u003e","sourceLink":"https://allnovel.net/back-on-blossom-street-blossom-street-4/page-26.html","bookId":1936,"creation":"Oct 5, 2019 9:58:25 AM","modification":"Oct 5, 2019 9:58:25 AM"}
