{"id":65665,"no":47,"title":"Page 47","content":"\u003cp\u003e“Afterward he said he’d behaved badly. He was afraid he’d destroyed your relationship. Apparently, you had the same reservations.”\u003c/p\u003e\n\u003cp\u003e“Yes.” Everything Christian had told his aunt was true. But two unexpected events had altered the situation. The first was the fact that she was pregnant and the second was what she’d discovered on his computer. She understood now that at least part of his reserve after the holidays could be attributed to his illegal activities.\u003c/p\u003e\n\u003cp\u003eColette saw that Elizabeth was smiling now. “I’ve known Christian his entire life,” the old woman said. “I know that young man better than his own father does. He can be stubborn and unreasonable. When he came to me that night, I saw him as a man in love, a man who feared he’d risked too much.”\u003c/p\u003e\n\u003cp\u003eTears clouded Colette’s eyes as something else occurred to her. “It’s like you said earlier—he suspected he might not come back. That’s why he told you.”\u003c/p\u003e\n\u003cp\u003eElizabeth grabbed Colette’s hand with surprising strength. “We have to trust he’ll come home.”\u003c/p\u003e\n\u003cp\u003e“I want him to know we love him,” Colette whispered.\u003c/p\u003e\n\u003cp\u003e“He knows,” Elizabeth said, her voice confident. “I have to believe he does.”\u003c/p\u003e\n\u003cp\u003eColette had to believe that, too.\u003c/p\u003e\n\u003cp\u003e“Now,” Elizabeth said. “I’d suggest we try again to sleep.”\u003c/p\u003e\n\u003cp\u003eColette finished her milk, rinsed the glass and set it in the sink. Together, the two women climbed the wide sweeping staircase to the second floor. They parted there, Elizabeth going to her own room at the end of the hall, while Colette walked to the opposite end, to the guest bedroom.\u003c/p\u003e\n\u003cp\u003eFor the first time since she’d arrived, Colette slept for four hours straight. When she woke, the sun was high and light spilled into the room.\u003c/p\u003e\n\u003cp\u003eSeconds later, she realized what had awakened her—the sharp ring of a phone. With a burst of hope, she tossed aside her covers and ran out of the room. She stood at the top of the stairs and listened as Elizabeth answered the phone. After the initial greeting, the other woman was silent for a long moment.\u003c/p\u003e\n\u003cp\u003e“Thank God!” she cried suddenly, but her exclamation of joy was immediately followed by a cry of frustration.\u003c/p\u003e\n\u003cp\u003eColette moved down to the top step.\u003c/p\u003e\n\u003cp\u003e“Yes, yes, of course,” Elizabeth was saying. “Don’t spare any expense,” she said. “Find him, Elliott, and don’t come home until you do.”\u003c/p\u003e\n\u003cp\u003eSo Christian hadn’t been rescued. Overcome by discouragement and frustration, Colette sank onto the step and buried her face in her hands. She didn’t know how Elizabeth was holding up when Colette’s own sense of hope was all but shredded.\u003c/p\u003e\n\u003cp\u003eColette returned to her room and quickly pulled on slacks and a light sweater. She’d shower later. Right now, it was more important to learn what Elizabeth had been told by Christian’s father.\u003c/p\u003e\n\u003cp\u003eColette found her in the garden, watering her plants.\u003c/p\u003e\n\u003cp\u003e“I heard the phone,” Colette said, stepping onto the back patio.\u003c/p\u003e\n\u003cp\u003eElizabeth gasped. “Didn’t anyone ever tell you to announce yourself properly instead of scaring people half to death?”\u003c/p\u003e\n\u003cp\u003eTaken aback, Colette froze. Then she saw that Elizabeth’s cheeks were stained with tears. “Tell me,” she whispered.\u003c/p\u003e\n\u003cp\u003e“We know where he went,” Elizabeth said hoarsely. She took a moment to compose herself. When she spoke again, her voice was clear. “The investigator Elliott hired discovered that Christian ended up in a completely different city. A town actually. In Shanxi province.”\u003c/p\u003e\n\u003cp\u003e“But…why?”\u003c/p\u003e\n\u003cp\u003e“That I can’t answer.”\u003c/p\u003e\n\u003cp\u003eColette frowned. “Has Elliott tracked him down in this other place?”\u003c/p\u003e\n\u003cp\u003e“No.” Elizabeth sighed heavily. “Not yet. He’s making arrangements to search for him now. I trust he’ll find Christian soon.”\u003c/p\u003e\n\u003cp\u003eColette did, too. She was counting on it.\u003c/p\u003e\n\u003cp\u003eCHAPTER 35\u003c/p\u003e\n\u003cp\u003e“In knitting, as in life, there are usually two ways to go: The easy way and the hard way. Often we find out about the easy way only when we are three-quarters of the way through with the hard way.”\u003c/p\u003e\n\u003cp\u003eAnn Shayne and Kay Gardiner, Mason-Dixon Knitting Potter Craft, 2006\u003c/p\u003e\n\u003cp\u003eLydia Goetz\u003c/p\u003e\n\u003cp\u003eI was very concerned about Margaret. I couldn’t ignore what Alix had told me about her wanting to pay someone to injure Danny Chesterfield. I waited, mulling over the situation before I approached Brad. When he heard my news, a dark frown crept slowly across his face.\u003c/p\u003e\n\u003cp\u003e“Do you think Matt knows about this?” he asked, bringing me a cup of coffee after dinner on Tuesday evening.\u003c/p\u003e\n\u003cp\u003e“I doubt it.” I gratefully accepted the coffee. It had become our habit to sit down and talk after the evening meal. We took turns making coffee or tea, and now that it was springtime, we often sat on the patio behind the house. I treasured these hours with my husband, even when we just sat in companionable silence.\u003c/p\u003e\n\u003cp\u003eBrad lounged on the deck chair next to me and cradled his mug with both hands. “We should tell him,” he finally said.\u003c/p\u003e\n\u003cp\u003e“I think so, too. Only…” I wasn’t sure how to say this. “You know how private Margaret can be.”\u003c/p\u003e\n\u003cp\u003eBrad looked over at me. “You don’t want to offend your sister by going behind her back.”\u003c/p\u003e\n\u003cp\u003eI nodded, feeling relieved at his understanding. “It might be best if we talked to the two of them together,” I said.\u003c/p\u003e\n\u003cp\u003e“How do you figure Margaret will react to being confronted with this?”\u003c/p\u003e\n\u003cp\u003e“Probably not well,” I admitted. “But I hope she’ll realize I couldn’t ignore this. I want her to know that I know.” My worst fear was that my sister would end up in jail while Danny Chesterfield roamed free. But Margaret was already in a prison of her own making, confined by her hate and her unwillingness to come to terms with what had happened.\u003c/p\u003e\n\u003cp\u003eBrad stood abruptly and set his mug aside. “Let’s go.”\u003c/p\u003e\n\u003cp\u003e“Now?” I should’ve known he wouldn’t want to delay doing something about this. Brad is a man of action.\u003c/p\u003e\n\u003cp\u003eI don’t think the same way Brad does, which is one reason I hadn’t mentioned it immediately. I needed to consider the problem from all angles, examine various options. Not Brad. He wanted to move forward, talk to Matt right away. A part of me was grateful not to carry this burden alone anymore, and yet I wasn’t sure that marching over to Matt and Margaret’s was the best course of action.\u003c/p\u003e\n\u003cp\u003eBrad settled the matter with one incisive question. “Do you want your sister to follow through with this?”\u003c/p\u003e\n\u003cp\u003e“No, but…”\u003c/p\u003e\n\u003cp\u003e“She will, Lydia.”\u003c/p\u003e\n\u003cp\u003eI knew he was right and the longer we waited, the more likely it was that Margaret would find someone to commit this crime on her behalf.\u003c/p\u003e\n\u003cp\u003eFortunately, Cody had gone to his friend Zack’s down the street, and Mrs. Miller was happy to keep him there for another hour.\u003c/p\u003e\n\u003cp\u003eOn the drive over to my sister’s, I asked Brad to do the talking once we arrived. I was nervous. Margaret can take offense so easily and she’d be furious with me for involving myself in affairs she considered none of my concern.\u003c/p\u003e\n\u003cp\u003eI pictured her blowing up at me, quitting her job and cutting off our relationship. That would devastate me. My mind always seemed to gravitate to the worst possible scenarios. It’s a tendency I’ve had for most of my life, even before the cancer. I find it frightening, unproductive and disconcerting—and I couldn’t quite suppress a sigh as I thought about this. I was about to confront my sister and risk the very relationship I treasured most, outside of the one I shared with my husband and son. And yet I had no choice. All at once I felt like weeping.\u003c/p\u003e\n\u003cp\u003eAs the cliché has it, Brad could read me like a book. When we parked in front of my sister’s house, he gently took my hand. “Everything’s going to work out,” he assured me. “Don’t worry, okay?”\u003c/p\u003e\n\u003cp\u003eI hoped he was right.\u003c/p\u003e\n\u003cp\u003eMatt opened the screen door for us even before we made it to the top step. He’s a big man, tall and thick-waisted now that he’d reached middle age. I remember when my sister first started dating him in high school. I’d been half in love with him myself. My sister had chosen well; I liked and admired Matt.\u003c/p\u003e\n\u003cp\u003e“This is a nice surprise,” Matt said, leading us into the house. He kissed me on the cheek, and he and Brad exchanged handshakes.\u003c/p\u003e\n\u003cp\u003eMargaret stepped out of the kitchen, a dish towel tossed carelessly over one shoulder. She looked instantly suspicious. “What’s this about?” she asked.\u003c/p\u003e\n\u003cp\u003e“Sit down.” My brother-in-law gestured toward the sofa, ignoring Margaret’s lack of welcome. He turned off the television and, with his usual hospitality, offered us a drink.\u003c/p\u003e\n\u003cp\u003eWe declined. Brad and I sat close to each other on the sofa. I folded my hands over my knees and waited for my husband to speak.\u003c/p\u003e\n\u003cp\u003e“I hope you’ll excuse our coming without any advance warning,” he began.\u003c/p\u003e\n\u003cp\u003e“Of course,” Matt said, glancing toward Margaret. “You’re welcome anytime.”\u003c/p\u003e\n\u003cp\u003eReluctantly, my sister sat down on the oversize chair beside Matt’s recliner. A wicker basket next to the chair was filled with her knitting. I recognized the pattern; it was the prayer shawl the class had knit together. Everyone, even Colette, had finished by now. Everyone except Margaret.\u003c/p\u003e\n\u003cp\u003e“Lydia told me something this evening that worries her, and it involves you,” Brad said. “I’ll let her explain.”\u003c/p\u003e\n\u003cp\u003eBoth Matt and Margaret turned their attention to me. I looked at Brad, wanting him to do it. But apparently it was up to me. I leaned toward my sister, silently pleading for her forgiveness.\u003c/p\u003e\n\u003cp\u003e“Alix came to me the other day,” I said after an awkward moment.\u003c/p\u003e\n\u003cp\u003eAs soon as I mentioned Alix’s name, Margaret crossed her arms and averted her eyes.\u003c/p\u003e\n\u003cp\u003e“You know what she told me, don’t you?” I asked softly.\u003c/p\u003e\n\u003cp\u003eMatt looked over at his wife, who remained stubbornly silent, her lips pursed, her eyes flashing lightning bolts at me.\u003c/p\u003e\n\u003cp\u003eThis was exactly what I’d feared. “Do you think I care what happens to Danny Chesterfield?” I blurted out, which I’m sure confused my brother-in-law even more.\u003c/p\u003e\n\u003cp\u003e“What’s that creep got to do with anything?” Matt demanded of his wife.\u003c/p\u003e\n\u003cp\u003eMargaret ignored him and continued to hold my gaze.\u003c/p\u003e\n\u003cp\u003e“Don’t you realize you’re putting your entire family at risk?” I cried. “You could end up in prison!”\u003c/p\u003e\n\u003cp\u003eMatt stormed to his feet. “Would someone tell me what the hell’s going on here?”\u003c/p\u003e\n\u003cp\u003eBrad stood, too. “Margaret’s trying to hire a hit man to injure Danny Chesterfield.”\u003c/p\u003e\n\u003cp\u003eThe room went completely still as Matt digested those words. Then, as if the weight of this was more than he could carry, he sank into his chair, leaned his head back and closed his eyes.\u003c/p\u003e\n\u003cp\u003eMargaret had yet to utter a single word.\u003c/p\u003e\n\u003cp\u003eFinally, Matt straightened and turned to his wife. “What are you thinking?” he asked, his voice weary and discouraged. There was no anger in his question, only pain and confusion. “Why can’t you let this go?”\u003c/p\u003e\n\u003cp\u003eFor the first time since I’d started speaking, Margaret’s gaze left mine. “I refuse to rest while that man walks around free to hurt someone else’s daughter. Since our justice system has seen fit to release him, I don’t have any choice but to take matters in my own hands.” \u003c/p\u003e","sourceLink":"https://allnovel.net/back-on-blossom-street-blossom-street-4/page-47.html","bookId":1936,"creation":"Oct 5, 2019 9:58:25 AM","modification":"Oct 5, 2019 9:58:25 AM"}
