{"id":65671,"no":53,"title":"Page 53","content":"\u003cp\u003eJordan’s mother knew immediately why Alix was thanking her. “Sarah loved that shawl,” her mother-in-law said in a low voice, “but more importantly she loved you. Just as I do.”\u003c/p\u003e\n\u003cp\u003eAt the gathering in the fellowship hall after the funeral, Alix took care of the serving and cleaning up, thus allowing family members to visit with their guests.\u003c/p\u003e\n\u003cp\u003eSusan found her in the church kitchen, washing dishes. “Thank you for all your help, Alix,” she said.\u003c/p\u003e\n\u003cp\u003eAlix finished rinsing the last of the dishes and released the drain at the bottom of the sink. “I was happy to do what I could.”\u003c/p\u003e\n\u003cp\u003eSusan sighed, leaning against the counter. “Mom always knew.”\u003c/p\u003e\n\u003cp\u003eAlix turned and cast a quizzical glance at her mother-in-law as she dried her hands. “Knew what?”\u003c/p\u003e\n\u003cp\u003e“Mom knew you’d be good for Jordan. I was the one with doubts, the one who questioned…. Well, you know that, but Alix, I was wrong.”\u003c/p\u003e\n\u003cp\u003e“Susan, please, it’s okay.” She wished Jordan’s mother would forget all that. Alix had.\u003c/p\u003e\n\u003cp\u003e“I know you’ve forgiven me, which also amazes me about you.” Susan seemed in awe of her, and that only embarrassed Alix further.\u003c/p\u003e\n\u003cp\u003e“Listen,” she said, “I’m no saint.”\u003c/p\u003e\n\u003cp\u003e“Yes, but…”\u003c/p\u003e\n\u003cp\u003e“What you need to remember,” Alix told her, “is that I realized if I was going to have a successful marriage, you and I had to come to a meeting of the minds. I didn’t want to put my husband in the middle and demand that he choose sides. Besides, I don’t have a mother of my own.” Alix hesitated. “Well, I do have a biological mother—I’m sure you remember her—but she’s no one I’d ever want as a role model.”\u003c/p\u003e\n\u003cp\u003eSusan nodded, then looked away. “The family would like to thank you.”\u003c/p\u003e\n\u003cp\u003e“For washing the dishes? No, really—”\u003c/p\u003e\n\u003cp\u003e“Not for that,” Susan said, interrupting her, “but for the way you handled everything the day of the wedding. You were the only one who thought of calling the sheriff’s office, for instance.”\u003c/p\u003e\n\u003cp\u003eAlix shrugged off the praise. “When you’ve dealt with the police as much as I have, it’s second nature to expect them in every situation.”\u003c/p\u003e\n\u003cp\u003eSusan laughed, and then Jordan came into the kitchen. “People are starting to leave, Mom.”\u003c/p\u003e\n\u003cp\u003e“Oh, thanks,” she said, hugged Alix and left.\u003c/p\u003e\n\u003cp\u003eJordan was grinning from ear to ear.\u003c/p\u003e\n\u003cp\u003e“What’s so funny?” Alix wanted to know.\u003c/p\u003e\n\u003cp\u003eJordan slid his arms around her waist. “You’re pretty incredible, Alix Turner.” He grinned again. “Pretty and incredible.”\u003c/p\u003e\n\u003cp\u003e“Yeah, right.”\u003c/p\u003e\n\u003cp\u003e“You think I’m joking?”\u003c/p\u003e\n\u003cp\u003eShe had to admit she enjoyed listening to him sing her praises, deserved or not.\u003c/p\u003e\n\u003cp\u003e“I don’t know what you did to win over my mother, Alix, but she’s had a complete turnaround.” Jordan arched his brows. “Are you going to tell me how you did it?”\u003c/p\u003e\n\u003cp\u003eWrapping her arms around him, Alix smiled. “It was easy. All I had to do was love her son.”\u003c/p\u003e\n\u003cp\u003eJordan kissed her then, and it wasn’t the short, affectionate kisses they so often shared in public or when family members were nearby. Her husband kissed her the way he had on their wedding day, the kiss of a man utterly captivated by the woman he’d married.\u003c/p\u003e\n\u003cp\u003eAlix leaned her head against Jordan’s shoulder and looked out the kitchen door at the family gathered to honor the life of Sarah Turner. Many of them were people she barely knew, people she’d met once or twice before. Some of their names escaped her at the moment, and yet they were her family now. Not Jordan’s brother or his cousins and uncles and aunts. Their cousins, uncles and aunts.\u003c/p\u003e\n\u003cp\u003eFor the first time in her adult life, Alix belonged.\u003c/p\u003e\n\u003cp\u003eCHAPTER 40\u003c/p\u003e\n\u003cp\u003eColette Blake\u003c/p\u003e\n\u003cp\u003eElizabeth Sasser invited Colette and Christian to dinner five days after his return from China. Since then, she and Christian had spent practically every minute together. He’d accompanied Colette to her ultrasound appointment and then to her doctor’s, where he listened to his child’s heartbeat. Already he was enthralled with the idea of becoming a father.\u003c/p\u003e\n\u003cp\u003eColette was no longer working. Susannah had been sympathetic—and very excited for her. Chrissie, who was out of school now, would be filling in. Colette had offered to work out her two-week notice, but Susannah had said it wasn’t necessary.\u003c/p\u003e\n\u003cp\u003eElizabeth had invited Christian’s father, Elliott, for dinner that same evening.\u003c/p\u003e\n\u003cp\u003eOn Friday night, Elliott had arrived before Christian and Colette. The minute they pulled up outside the house, he stepped onto the porch to welcome them.\u003c/p\u003e\n\u003cp\u003eHe smiled approvingly when Christian slipped his arm around Colette’s waist and guided her up the walkway.\u003c/p\u003e\n\u003cp\u003e“You’re looking considerably healthier,” Elliott commented. “And happier.”\u003c/p\u003e\n\u003cp\u003e“I am,” Christian assured his father.\u003c/p\u003e\n\u003cp\u003e“Are they here?” Elizabeth asked, poking her head out the front door. She smiled when she saw them on the porch, then frowned at Christian and shook her head. “You’re late.”\u003c/p\u003e\n\u003cp\u003e“Aunt Elizabeth, I am not late.”\u003c/p\u003e\n\u003cp\u003e“Dinner’s on the table,” she said as though to prove him wrong.\u003c/p\u003e\n\u003cp\u003eThe dining room had been set with a lace tablecloth, plus the china and silverware from the display cabinet. Doris had already carried in the serving dishes. In the center of the table was a sirloin roast, new red potatoes and fresh asparagus. The rolls appeared to be homemade.\u003c/p\u003e\n\u003cp\u003e“This looks delicious,” Colette said as Christian drew out a chair for her.\u003c/p\u003e\n\u003cp\u003eHe sat next to Colette and clasped her hand. It felt good to be linked to him, good and right.\u003c/p\u003e\n\u003cp\u003eAfter the blessing was given by Elliott, the serving dishes were passed around.\u003c/p\u003e\n\u003cp\u003eElizabeth helped herself to a generous portion of roast beef, then set the plate down and glared at Christian. “Well? Are you going to keep me in suspense all night?” she demanded.\u003c/p\u003e\n\u003cp\u003e“Suspense about what?” Christian asked innocently. Beneath the table and out of view, he squeezed Colette’s hand.\u003c/p\u003e\n\u003cp\u003e“Are you going to marry the girl or not?”\u003c/p\u003e\n\u003cp\u003eElliott seemed equally interested in his response.\u003c/p\u003e\n\u003cp\u003e“We’re talking about it.” Christian glanced at Colette. “In other words, we’re still negotiating.”\u003c/p\u003e\n\u003cp\u003e“Negotiating,” his aunt repeated scornfully. “Marriage is a commitment, not a contract to be negotiated.”\u003c/p\u003e\n\u003cp\u003e“What’s important, son,” Elliott began, sounding far calmer than his aunt, “is that you two love each other. And just seeing you together, I can tell that you do.”\u003c/p\u003e\n\u003cp\u003e“Of course he loves her,” Elizabeth said irritably. “And she loves him.”\u003c/p\u003e\n\u003cp\u003e“Then they’ll reach the decision to marry in their own good time,” Elliott assured the older woman.\u003c/p\u003e\n\u003cp\u003eElizabeth picked up her fork. “Unfortunately, time is of the essence,” she muttered and dug into her beef.\u003c/p\u003e\n\u003cp\u003e“Now, Elizabeth, be patient,” Elliott cautioned. “You’re going to be around for a lot of years yet.”\u003c/p\u003e\n\u003cp\u003eChristian’s great-aunt looked somewhat condescendingly at Elliott Dempsey. “My age has nothing to do with this.”\u003c/p\u003e\n\u003cp\u003e“Dad,” Christian said. “Aunt Betty—”\u003c/p\u003e\n\u003cp\u003e“Don’t call me that!”\u003c/p\u003e\n\u003cp\u003e“Yes, dear,” he said, struggling to hide a smile. He turned to his father. “I do have some news for you.”\u003c/p\u003e\n\u003cp\u003eElliott smiled expectantly.\u003c/p\u003e\n\u003cp\u003e“You’re going to become a grandfather in three months.”\u003c/p\u003e\n\u003cp\u003eChristian’s father leaped to his feet, rushing over to congratulate them. But Elizabeth was not appeased. “If you don’t marry this woman and give that baby your name, I swear to you right now, I’m cutting you out of my will.”\u003c/p\u003e\n\u003cp\u003e“Aunt Elizabeth,” Christian said, grinning. “That baby’s a little girl and her name is Elizabeth Catherine Dempsey.”\u003c/p\u003e\n\u003cp\u003e“I…I—” Elizabeth sputtered.\u003c/p\u003e\n\u003cp\u003e“We’re naming her after you,” Colette said, “and Christian’s mother.”\u003c/p\u003e\n\u003cp\u003e“You’re getting married? For the love of heaven, please tell me you’re getting married,” Elizabeth cried. “The sooner the better.”\u003c/p\u003e\n\u003cp\u003eChristian winked at Colette, but then his expression sobered. “Actually, no.”\u003c/p\u003e\n\u003cp\u003e“No?” Elizabeth bellowed loudly enough to bring Doris running in from the kitchen.\u003c/p\u003e\n\u003cp\u003e“Is everything all right?” the housekeeper asked anxiously.\u003c/p\u003e\n\u003cp\u003eStricken, Elizabeth nodded. “Everything’s delicious, Doris, thank you. You can bring out dessert in a few minutes.”\u003c/p\u003e\n\u003cp\u003e“What’s for dessert?” Christian asked.\u003c/p\u003e\n\u003cp\u003e“Christian, don’t be cruel,” Colette said and held up her left hand, revealing the gold band on her ring finger. “Christian and I were married Thursday afternoon by my friend’s husband.”\u003c/p\u003e\n\u003cp\u003e“I certainly hope he’s a minister,” Elizabeth said under her breath.\u003c/p\u003e\n\u003cp\u003e“He is,” Colette told her. “We got the license first thing Monday morning and Jordan Turner married us as soon as the waiting period was over.”\u003c/p\u003e\n\u003cp\u003e“Thank God!”\u003c/p\u003e\n\u003cp\u003e“Then we phoned my parents and told them our news.”\u003c/p\u003e\n\u003cp\u003e“All of it?” Elizabeth asked.\u003c/p\u003e\n\u003cp\u003e“All of it,” Colette said. “They’re pleased for us, more than a little surprised about the baby, but delighted.” She paused. “Telling Derek’s parents was more difficult, but they wished us well.”\u003c/p\u003e\n\u003cp\u003e“A girl named after me,” Elizabeth repeated slowly, proudly. “It’s about time you did something right,” she said, reaching for her fork again. “Even if you didn’t invite me to the wedding.”\u003c/p\u003e\n\u003cp\u003eElliott raised his wineglass to congratulate them. “Under the circumstances, Aunt Elizabeth, I think we can forgive the oversight.”\u003c/p\u003e\n\u003cp\u003eColette turned to smile at her husband, the man she loved, the man whose child she carried. They’d decided to call her Beth, and when she brought her daughter home from the hospital, Colette would wrap her in the prayer shawl she’d knit with Lydia and her other friends.\u003c/p\u003e\n\u003cp\u003eCHAPTER 41\u003c/p\u003e\n\u003cp\u003e“Granny was knitting a lovely lacy sweater. She had a piece of paper with tick marks and numbers on it. ‘Where is your pattern?’ I asked. She replied, ‘A pattern? God gave you a brain, didn’t he?’ Granny was a thinking knitter. I wanted to be just like her.”\u003c/p\u003e\n\u003cp\u003eRené Wells, Granny and Me Designs\u003c/p\u003e\n\u003cp\u003eLydia Goetz\u003c/p\u003e\n\u003cp\u003eI was pleased that Julia and Hailey were with Mom when I visited. She chatted on endlessly about her childhood, and the girls listened attentively. It was a relief to see my mother in such high spirits. She was showing signs of improvement, I thought.\u003c/p\u003e\n\u003cp\u003eAfter about thirty minutes, the girls left and it was just Mom and me.\u003c/p\u003e\n\u003cp\u003e“You’re looking so happy,” Mom said as I brushed her hair, getting her ready for an early dinner. The prayer shawl I’d knit was tucked around her shoulders. She wore it almost constantly these days and I found that gratifying. Of all the things I’d knit Mom through the years, this was the one I felt most strongly about because so many of those stitches held my hopes and prayers for her. \u003c/p\u003e","sourceLink":"https://allnovel.net/back-on-blossom-street-blossom-street-4/page-53.html","bookId":1936,"creation":"Oct 5, 2019 9:58:25 AM","modification":"Oct 5, 2019 9:58:25 AM"}
