{"id":65672,"no":54,"title":"Page 54","content":"\u003cp\u003e“Lydia?” she asked as I stroked the brush down the length of her hair.\u003c/p\u003e\n\u003cp\u003e“Yes, Mom?”\u003c/p\u003e\n\u003cp\u003e“Who were those nice young girls?”\u003c/p\u003e\n\u003cp\u003eI smiled, but it was a smile of sadness and resignation. “Those are Margaret’s daughters, Julia and Hailey.”\u003c/p\u003e\n\u003cp\u003eMy mother sighed. “Oh, of course. What’s the matter with me that I can’t remember my own granddaughters?”\u003c/p\u003e\n\u003cp\u003e“Mom, don’t worry. Julia and Hailey know who you are and that’s what’s important.” The diagnosis was official now. Mom had Alzheimer’s. As the disease progressed, I knew there’d come a time when Mom no longer recognized me. I’d deal with it; I would have no choice. I’d remember her as the young wife in photographs from the ’60s and ’70s, as the mother who’d walked me to school and sewed my Halloween costumes, as the grief-stricken widow and the old woman she was now. And all the moments in between. My mother.\u003c/p\u003e\n\u003cp\u003e“Is Margaret coming?” Mom asked in a tentative voice.\u003c/p\u003e\n\u003cp\u003e“Soon.” My sister would come by sometime on Monday. We alternated visits, which helped. I was grateful for Margaret and the way taking care of Mom had strengthened the bond we shared as sisters.\u003c/p\u003e\n\u003cp\u003e“She’s going to be a star,” Mom told me.\u003c/p\u003e\n\u003cp\u003eI knew my mother was thinking about Margaret’s high-school days and her athletic success. I was the brains of the family, supposedly. I did take pride in the fact that I’d graduated with my high-school class despite missing almost my entire junior year while battling cancer.\u003c/p\u003e\n\u003cp\u003eAfter I finished brushing Mom’s hair, it was time for dinner. Each of the residents was brought down to the dining room by a staff member. I waited until Mom was gone, then locked her room and left.\u003c/p\u003e\n\u003cp\u003eBrad, Cody and Chase were waiting for me at Green Lake. The three-mile walk around the lake was a favorite exercise of mine. Brad and Cody loved it, too, and Chase was quivering with excitement as he and Cody set off on their run.\u003c/p\u003e\n\u003cp\u003e“How’s your mom doing?” Brad asked.\u003c/p\u003e\n\u003cp\u003eI thought about the question she’d asked me—who Julia and Hailey were—and shrugged. “She’s in good spirits.”\u003c/p\u003e\n\u003cp\u003e“I’m glad.”\u003c/p\u003e\n\u003cp\u003eBrad knew I’d agonized over the decision to move Mom yet again, and so soon after her last move. Until Margaret told me, I hadn’t been aware how long she’d been suffering from memory loss. But Dad had known and he’d been covering for her and I’d never suspected.\u003c/p\u003e\n\u003cp\u003eBrad and I started down the path, hands linked. He talked about one thing and another, and I responded at the appropriate times, but my mind was in a dozen different places.\u003c/p\u003e\n\u003cp\u003eI was thinking about Carol and her baby.\u003c/p\u003e\n\u003cp\u003eColette, too.\u003c/p\u003e\n\u003cp\u003eIt’d been a shock when she told me she was pregnant. And married! Needless to say, she’d moved out of the apartment and in with Christian. Which meant I’d be looking for a new tenant soon, and that was fine. Susannah was going to miss her, but it seemed Chrissie enjoyed working in the flower shop, and she’d be there all summer.\u003c/p\u003e\n\u003cp\u003eMostly I’ve been thinking about Brad and me adopting. Perhaps a baby would be unrealistic for us, but there are older children in need of a home, in need of love. That thought had come to me during a conversation with Alix. The state had declared her parents unfit and she’d been eligible for adoption. Only she was too old, she’d said, for anyone to want her. An older child—this was a possibility Brad and I needed to explore.\u003c/p\u003e\n\u003cp\u003e“You’re very quiet,” my husband said.\u003c/p\u003e\n\u003cp\u003e“I’ve been thinking…about a lot of things.”\u003c/p\u003e\n\u003cp\u003e“Tell me one,” he said.\u003c/p\u003e\n\u003cp\u003eI sorted through the most pressing of the thoughts dancing in my head. “I’m afraid my mother won’t live much longer,” I said and felt an immediate sense of pain. It was the first time I’d admitted this to Brad and the knowledge that I’d soon be without my mother left me feeling bereft and alone.\u003c/p\u003e\n\u003cp\u003e“That frightens you, doesn’t it?”\u003c/p\u003e\n\u003cp\u003e“It does, more than I realized it would,” I told him, but found myself unable to describe my feelings beyond this awareness of impending loss. Life without Mom—I could hardly imagine it. She was no longer the person she’d been, and yet she would always be my mom.\u003c/p\u003e\n\u003cp\u003e“Then treasure the time you still have with her,” Brad suggested gently.\u003c/p\u003e\n\u003cp\u003eI nodded.\u003c/p\u003e\n\u003cp\u003e“Margaret phoned,” he told me. “She wanted me to pass along the news.”\u003c/p\u003e\n\u003cp\u003e“What news?”\u003c/p\u003e\n\u003cp\u003e“Danny Chesterfield’s been sentenced.”\u003c/p\u003e\n\u003cp\u003eMargaret had followed the case closely; according to her, Danny had reached a plea agreement with the prosecuting attorney’s office. He would be serving a ten-year prison term. To my way of thinking, he was already serving his sentence, and it had nothing to do with his time behind bars.\u003c/p\u003e\n\u003cp\u003e“Mom, Dad!” Cody shouted frantically as Chase ran toward us, dragging his leash. “Catch him for me.”\u003c/p\u003e\n\u003cp\u003eBrad reached out and grabbed the dog’s leash. Laughing, Cody caught up with us and hugged his father. “Thanks, Dad,” he said, breathless with exhilaration and joy.\u003c/p\u003e\n\u003cp\u003eJoy.\u003c/p\u003e\n\u003cp\u003eI felt it, too, in every cancer-free cell of my body. I was at peace with my life and with the future, whatever it held. \u003c/p\u003e","sourceLink":"https://allnovel.net/back-on-blossom-street-blossom-street-4/page-54.html","bookId":1936,"creation":"Oct 5, 2019 9:58:25 AM","modification":"Oct 5, 2019 9:58:25 AM"}
