{"id":66478,"no":14,"title":"Page 14","content":"\u003cp\u003eMaddie had taxied this familiar airfield and roared down the rutted runway in her head so many times it felt as though she’d done it before; or as though she were dreaming now. The Anson leaped into the air in a gust of headwind. Maddie fought the aircraft for a while, straightened the rudder, felt the speed increase as Dympna’s laborious cranking of the undercarriage began to progress and the extra drag fell away. The wings lifted and dipped in the blustering wind like a motorboat riding swells. It was lovely flying a low-winged plane, with its unblocked endless view of sky – or, on that occasion, low-hanging cloud.\u003c/p\u003e\n\u003cp\u003e‘Hey, Scottie!’ Dympna ordered, shouting over the engines. ‘Stop squeaking and give me a hand.’\u003c/p\u003e\n\u003cp\u003eThe skriking Scot crept towards the cockpit, keeping low to the floor of the aircraft to avoid having to look out. Maddie glanced over her shoulder again; she could tell her friend was manfully battling some demon or other.\u003c/p\u003e\n\u003cp\u003e‘If you’re scared, do something,’ Maddie shouted, not without irony.\u003c/p\u003e\n\u003cp\u003eThe Scot, whey-faced and determined, reached down alongside the pilot’s seat and took hold of the undercarriage crank. ‘My real fear,’ Scottie gasped, giving the crank a turn, ‘is not of heights’ – another turn – ‘but of being sick.’\u003c/p\u003e\n\u003cp\u003e‘Doing something should help,’ yelled the Yank from the back, enjoying the view ahead of him for different reasons than the rest of them.\u003c/p\u003e\n\u003cp\u003e‘Looking at the horizon helps,’ yelled Maddie, her own far-seeing eyes focused on the distant place where the battered grey land met tumultuous grey cloud. Conversation was not really possible. Most of Maddie’s being was absorbed in flying the buffeting Anson. But a little corner of her mind was sorrowing that her friend’s first flight was not being made through a still summer evening of golden light over the green Pennines.\u003c/p\u003e\n\u003cp\u003eMaddie landed the Anson into wind with a wallop, and Dympna kept her hands to herself, letting Maddie do it. The Yank said it was a whale of a landing, which he meant as a compliment. Afterwards the Scot stood quivering on the runway with gritted teeth while the aircraft was refuelled and the Branston ground crew chatted with the ferry pilots. Maddie stood close by, not close enough to touch, not anything so babyish. But offering silent sympathy.\u003c/p\u003e\n\u003cp\u003eMinus the Yank ferry pilot, the Anson crew set off back to Maidsend. Fitful sunlight, low on the horizon, gleamed through the heavy cloud in the west, and Maddie, rather desperate to improve the experience for her suffering passenger, was able to climb a little higher where the wind was brisker and not so gusty. (The ferry pilots are not allowed to fly higher than 5000 feet. Engel will have to do the metric conversion – sorry about that.)\u003c/p\u003e\n\u003cp\u003eBlooming crosswind, Maddie swore to herself as they crawled back towards home.\u003c/p\u003e\n\u003cp\u003e‘Still feeling sick?’ Dympna bellowed at the hapless Scot. ‘Come and sit in the front.’\u003c/p\u003e\n\u003cp\u003eThe Scot, in weakened state, was easily bullied (as you know). Dympna crawled out of her forward seat and Scottie crawled into it.\u003c/p\u003e\n\u003cp\u003eMaddie glanced at her friend, grinned and took hold of the finely manicured hand that gripped the edge of the copilot’s seat. She forced the hand round the flight controls.\u003c/p\u003e\n\u003cp\u003e‘Hold this,’ she bellowed. ‘See how we’re slant against the sun? ’Cause there’s a whopper of a crosswind, so we have to crab. Just like sailing. You point the plane sideways. Got it?’\u003c/p\u003e\n\u003cp\u003eScottie nodded, face pale, jaw set, eyes alight.\u003c/p\u003e\n\u003cp\u003e‘See?’ Maddie held her own empty hands aloft. ‘You’re in control. You’re flying the plane. The Flying Scotsman!’\u003c/p\u003e\n\u003cp\u003eThe Flying Scotsman squeaked again.\u003c/p\u003e\n\u003cp\u003e‘Don’t cling to it – just hold it gently – oh, well done.’\u003c/p\u003e\n\u003cp\u003eThey beamed at each other for a moment. Then they looked back at the sky.\u003c/p\u003e\n\u003cp\u003e‘Dympna!’ cried Maddie. ‘Look, look at the sun!’\u003c/p\u003e\n\u003cp\u003eIt was green.\u003c/p\u003e\n\u003cp\u003eGod’s truth – the rim of the lowering sun, all they could see of it, had turned green. It was sandwiched in between a bank of low dark haze and a higher bank of dark cloud, and just along the upper edge of the haze was this bright lozenge of flaming green, like Chartreuse liqueur with light behind it. Maddie had never seen anything like it.\u003c/p\u003e\n\u003cp\u003e‘My God –’ Dympna whispered something to this effect, but no one heard her. She laid a hand on each girl’s shoulder, gripping them hard.\u003c/p\u003e\n\u003cp\u003e‘Fly the plane, Maddie,’ she commanded hoarsely, an instructor’s reminder.\u003c/p\u003e\n\u003cp\u003e‘I am.’\u003c/p\u003e\n\u003cp\u003eMaddie flew the plane, but she stared at the sun’s green edge too, for a long, wind-buffeted, glorious half a minute. Thirty seconds it lasted, green sunlight breaking the cloud on the horizon. Then the light winked out below the haze again and all three pilots were left blinded in the dull gloom of a showery autumn afternoon.\u003c/p\u003e\n\u003cp\u003e‘What was it? Dympna, what was it? A test? A new bomb? What –’\u003c/p\u003e\n\u003cp\u003eDympna relaxed her grip on their shoulders.\u003c/p\u003e\n\u003cp\u003e‘It’s called the Green Flash,’ she said. ‘It’s just a mirage, a trick of the light. Nothing to do with the war.’ She let out a little gasp of delight. ‘Oh! My father saw it once when he was camping on Kilimanjaro, years ago. Get to work, Scottie, undercarriage needs lowering. And I need the instructor’s seat back to make sure Brodatt lands us safely.’\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eDown on earth, Dympna tossed out the two tyros and took off again without herself setting foot on the ground at Maidsend, hurrying back to her own base before it got dark or the weather closed in (ATA pilots are able to authorise their own flights).\u003c/p\u003e\n\u003cp\u003eQueenie, herself again, took hold of Maddie’s hand and squeezed it tightly. She walked all the way back across the airfield without letting it go. Maddie closed her eyes and flew again in the ethereal, pale green light. She knew she would never let it go.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eI’m sorry. This has got absolutely bugger all to do with Air Taxi.\u003c/p\u003e\n\u003cp\u003eBut it was that flight that shoehorned Maddie into the ATA. She was released to them by the WAAF, not seconded – a somewhat unusual procedure then, though they did more of it later in the war – unusual because the ATA is a civilian organisation and the WAAF military. But Maddie had been on the ATA’s waiting list since it was drawn up, and having Dympna on her side put her at an advantage over other applicants who might have been equally qualified. The women on the waiting list were all far more qualified than the men because the qualified men didn’t have to wait. Also, Maddie’s Oakway night flying and fog line landings made her a bit special (night and fog, brrrr, even innocently and in English it makes me shiver). Lads with her experience were flying bombers now. The ATA needed her.\u003c/p\u003e\n\u003cp\u003eThey fly without radio or navigation aids. They do have maps, but they are not allowed to mark balloons or new airfields on them, in case they lose the maps and you lot pick them up. Maddie did a training course when she joined, early in 1941, and she had one instructor who told her: ‘You don’t need a map. Just fly this heading for as long as it takes to smoke two cigarettes. Then turn and fly the next heading for another cigarette.’ You can fly hands-free and light a fag mid-flight pretty easily if the aircraft is set up properly – FDF, Fag Direction Finding.\u003c/p\u003e\n\u003cp\u003eAbout the same time Maddie joined the Air Transport Auxiliary, her friend the wireless operator was seconded to the SOE, the Special Operations Executive. Maddie did not know this. They’d been swapping letters for a while after Maddie left Maidsend, and then suddenly Queenie’s letters started arriving from an undisclosed address and were full of black censor’s marks, as though they were coming from a soldier in North Africa. And then Queenie asked her to write to her at home, which had the impressively simple (and palindromic!) address of Craig Castle, Castle Craig (Aberdeenshire). But she was not at home. That was just for forwarding purposes. So they did not see each other most of that year except:\u003c/p\u003e\n\u003cp\u003e1) When Queenie turned up unexpectedly during a break in the Manchester Blitz, and they spent three wet and stormy days burning black market petrol up and down the Pennines on Maddie’s Silent Superb.\u003c/p\u003e\n\u003cp\u003e2) When one of Queenie’s Top Ten Fears materialised and her favourite brother Jamie the bomber pilot (the real Jamie) and his crew got shot down. Jamie spent a night floating in the North Sea and afterwards had to have four frozen fingers and all his toes amputated. Maddie went to visit him when he was in hospital. In fact she had never met him before, and perhaps that wasn’t the best time to meet him, but Queenie actually sent Maddie a telegram – only the second telegram she’d ever got – asking Maddie to come along with Queenie to see him, and Maddie did. It was perhaps not the best time to meet Queenie either.\u003c/p\u003e\n\u003cp\u003e3) When Queenie was sent up to Oakway for parachute training. And they weren’t allowed to talk to each other that time.\u003c/p\u003e\n\u003cp\u003eThat should be a separate section, ‘SOE Parachute Drops’. But I have not got to that bit yet and now von Linden is just arriving, and I will have to translate what I have written today for him myself, since Engel is not here.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eI am alone. O God. I have tried to undo Thibaut’s knots, but I can’t reach them with both hands. I was translating today’s writing for von Linden, my elbows on the table and my head between my hands, not daring to look at him. I’d already asked him for more time and he’d said he would consider it after he’d heard today’s material. And I know I have given him nothing today. Nothing but the events of the past two weeks, which he already knows, and the Green Flash. Almighty Christ. After I’d got to the bit about the cook feeling me up – so embarrassing, but if I’d skipped it and v.L. found out later I’d pay for it in blood – he came over and stood by me. I had to look up. When I did, he took a handful of my hair and held it lightly off the back of my neck for a moment.\u003c/p\u003e\n\u003cp\u003eHe never smiles or frowns or anything. I could feel my face flaming. Oh why did I have to put down that coarse, filthy sarcasm about choosing between the cook and the inquisitor? I could not tell what he was thinking. He rubbed my hair gently between his fingers.\u003c/p\u003e\n\u003cp\u003eThen he said one word. It sounds the same in English and French and German. Kerosene.\u003c/p\u003e\n\u003cp\u003eAnd he left me here with the door closed.\u003c/p\u003e\n\u003cp\u003eI would like to write something heroic and inspired before I go up in fireworks, but I am too stupid and sick with dread to think of anything. I can’t even think of anyone else’s memorable defiance to repeat. I wonder what William Wallace said when they were tying him to the horses that would rip him into quarters. All I can think of is Nelson saying ‘Kiss me, Hardy.’\u003c/p\u003e\n\u003cp\u003eOrmaie 17.XI.43 JB-S\u003c/p\u003e\n\u003cp\u003eThey have WASHED MY HAIR. That was what the kerosene was for this time. FLAMING HEAD LICE. Now I stink of explosive, but I have not got nits.\u003c/p\u003e\n\u003cp\u003eJust after the Hauptsturmführer left me last night, there was an air raid and everybody scrambled to the shelters as usual. I sat weeping and waiting for two hours, just as I did sometimes during that week of interrogation, begging God and the RAF for a direct hit that they NEVER DELIVER. After it was over, no one came back for another hour. THREE HOURS without anyone telling me what was going on. I expect v.L. was hoping that in my panic I would write something more productive as a last resort, only I struggled so much trying to get my legs free that the chair I was tied to fell over. Needless to say I could not write in such a state (and did not even consider calling for help). Eventually a number of people came in and found me doing a frantic imitation of an upside-down tortoise. \u003c/p\u003e","sourceLink":"https://allnovel.net/code-name-verity-code-name-verity-1/page-14.html","bookId":2672,"creation":"Oct 5, 2019 10:01:16 AM","modification":"Oct 5, 2019 10:01:16 AM"}
