{"id":42393,"no":9,"title":"Chapter VII—The Choice Of A Vocation","content":"\u0026nbsp;James Garfield\u0027s experience on the canal was over. The position was such an humble one that it did not seem likely to be of any service in the larger career which one day was to open before him. But years afterward, when as a brigadier-general of volunteers he made an expedition into Eastern Kentucky, he realized advantage from his four months\u0027 experience on the canal. His command had run short of provisions, and a boat had been sent for supplies, but the river beside which the men were encamped had risen so high that the boat dared not attempt to go up the river. Then General Garfield, calling to his aid the skill with which he had guided the Evening Star at the age of fifteen, took command of the craft, stood at the wheel forty-four hours out of the forty-eight, and brought the supplies to his men at a time when they were eating their last crackers. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Seek all knowledge, however trifling,\" says an eminent author, \"and there will come a time when you can make use of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n James may never have read this remark, but he was continually acting upon it, and the spare moments which others devoted to recreation he used in adding to his stock of general knowledge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The last chapter closes with Mrs. Garfield\u0027s advice to James to give up his plan of going to sea, and to commence and carry forward a course of education which should qualify him for a college professor, or a professional career. Her words made some impression upon his mind, but it is not always easy to displace cherished dreams. While she was talking, a knock was heard at the door and Mrs. Garfield, leaving her place at her son\u0027s bedside, rose and opened it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am glad to see you, Mr. Bates,\" she said with a welcoming smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Samuel D. Bates was the teacher of the school near by, an earnest young man, of exemplary habits, who was looking to the ministry as his chosen vocation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And how is James to-day?\" asked the teacher, glancing toward the bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So well that he is already beginning to make plans for the future,\" answered his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What are your plans, James?\" asked the young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should like best to go to sea,\" said James, \"but mother doesn\u0027t approve of it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"She is wise,\" said Bates, promptly. \"You would find it a great disappointment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, it must be delightful to skim over the waters, and visit countries far away,\" said the boy, his cheeks flushing, and his eyes glowing with enthusiasm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You think so now; but remember, you would be a poor, ignorant sailor, and would have to stay by the ship instead of exploring the wonderful cities at which the ship touched. Of course, you would have an occasional run on shore, but you could not shake off the degrading associations with which your life on shipboard would surround you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why should a sailor\u0027s life be degrading?\" asked James.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It need not be necessarily, but as a matter of fact most sailors have low aims and are addicted to bad habits. Better wait till you can go to sea as a passenger, and enjoy to the full the benefits of foreign travel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There is something in that,\" said James, thoughtfully. \"If I could only be sure of going some day.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Wouldn\u0027t it be pleasant to go as a man of culture, as a college professor, as a minister, or as a lawyer, able to meet on equal terms foreign scholars and gentlemen?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was a new way of putting it, and produced a favorable impression on the boy\u0027s mind. Still, the boy had doubts, and expressed them freely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That sounds well,\" he said; \"but how am I to know that I have brain enough to make a college professor, or a minister, or a lawyer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t think there is much doubt on that point,\" said Bates, noting the bright, expressive face, and luminous eyes of the sick boy. \"I should be willing to guarantee your capacity. Don\u0027t you think yourself fit for anything better than a common sailor?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered James. \"I think I could make a good carpenter, for I know something about that trade already, and I daresay I could make a good trader if I could find an opening to learn the business; but it takes a superior man to succeed in the positions you mention.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There are plenty of men with only average ability who get along very creditably; but I advise you, if you make up your mind to enter the lists, to try for a high place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy\u0027s eyes sparkled with new ambition. It was a favorite idea with him afterward, that every man ought to feel an honorable ambition to succeed as well as possible in his chosen path.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One thing more,\" added Bates. \"I don\u0027t think you have any right to become a sailor.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No right? Oh, you mean because mother objects.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That, certainly, ought to weigh with you as a good son; but I referred to something else.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What then?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you remember the parable of the talents?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n James had been brought up by his mother, who was a devoted religious woman, to read the Bible, and he answered in the affirmative.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems to me that you are responsible for the talents which God has bestowed upon you. If you have the ability or the brain, as you call it, to insure success in a literary career, don\u0027t you think you would throw yourself away if you became a sailor?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Garfield, who had listened with deep interest to the remarks of the young man, regarded James anxiously, to see what effect these arguments were having upon him. She did not fear disobedience. She knew that if she should make it a personal request, James was dutiful enough to follow her wishes; but she respected the personal independence of her children, and wanted to convince, rather than to coerce, them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I knew positively that you were right in your estimate of me, Mr. Bates, I would go in for a course of study.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Consult some one in whose judgment you have confidence, James,\" said the teacher, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can you suggest any one?\" asked the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Dr. J.P. Robinson, of Bedford, is visiting at the house of President Hayden, of Hiram College. You have heard of him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is a man of ripe judgment, and you can rely implicitly on what he says.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"As soon as I am well enough I will do as you advise,\" said James.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I am satisfied. I am sure the doctor will confirm my advice.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Bates,\" said Mrs. Garfield, as she followed out the young teacher, \"I am much indebted to you for your advice to James. It is in accordance with my wishes. If he should decide to obtain an education, where would you advise him to go?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To the seminary where I have obtained all the education I possess,\" answered the young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is called the \u0027Geauga Seminary,\u0027 and is located in Chester, in the next county. For a time it will be sufficient to meet all James\u0027 needs. When he is further advanced he can go to Hiram College.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it expensive?\" asked Mrs. Garfield. \"James has no money except the few dollars his brother and I can spare him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He will have plenty of company. Most of the students are poor, but there are chances of finding work in the neighborhood, and so earning a little money. James knows something of the carpenter\u0027s trade?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, he helped build the house we live in, and he has been employed on several barns.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My readers will remember that the Garfields no longer lived in the humble log-cabin in which we first found them. The money Thomas brought home from Michigan, supplemented by the labor of James and himself, had replaced it by a neat frame house, which was much more comfortable and sightly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will do. I think I know a man who will give him employment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is a boy of energy. If he gets fairly started at school, I think he will maintain himself there,\" said Mrs. Garfield.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The teacher took his leave.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Mrs. Garfield re-entered the room she found James looking very thoughtful.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mother,\" he said, abruptly, \"I want to get well as quick as I can. I am sixteen years old, and it is time I decided what to do with myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You will think of what Mr. Bates has said, will you not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, mother; as soon as I am well enough I will call on Dr. Robinson and ask his candid opinion. I will be guided by what he says.\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2970/81782.html","bookId":374,"creation":"Aug 11, 2019 5:59:12 AM","modification":"Aug 11, 2019 5:59:12 AM"}
