{"id":64551,"no":10,"title":"Page 10","content":"\u003cp\u003eCHAPTER EIGHT\u003c/p\u003e\n\u003cp\u003eDANIKA\u003c/p\u003e\n\u003cp\u003eWe quickly developed a pattern, and five days later, we’d gone out dancing nearly every night.\u003c/p\u003e\n\u003cp\u003eI was a restless person. I always had been. I found myself constantly thinking of the next step, calculating what was to come, or even ten steps ahead. I rarely found myself living in the moment. Tristan did that for me. He brought me back to the moment nearly every second I was in his company. It was an addictive kind of feeling, to know, just know, that whatever was going on right now was worth attending to. I didn’t have to look forward with Tristan. I lived in the present, and I loved it.\u003c/p\u003e\n\u003cp\u003e“Are you getting sick of my hangover sandwiches?” Tristan asked as he handed me one.\u003c/p\u003e\n\u003cp\u003e“Abso-fucking-lutely not,” I said, taking my sandwich from him.\u003c/p\u003e\n\u003cp\u003eAs I thought about it, I wasn’t sick of one thing about him. We’d been inseparable since nearly the moment we’d met, and it was far from getting old.\u003c/p\u003e\n\u003cp\u003e“I actually have a promoting gig tonight,” he told me between bites. “So you get to see me work. It’s this new club, over off Paradise. You’ll finally get to meet Dean.”\u003c/p\u003e\n\u003cp\u003e“I can’t go,” I said, recalling what day of the week it was. “I have a thing tonight.”\u003c/p\u003e\n\u003cp\u003eHe stopped eating, watching me. “A thing?”\u003c/p\u003e\n\u003cp\u003eI shrugged. “A weekly thing.”\u003c/p\u003e\n\u003cp\u003e“Care to elaborate? Is this a date type of thing, or a girls’ night type of thing?”\u003c/p\u003e\n\u003cp\u003eI blinked at him, caught off guard by the idea of it being a weekly date. What on earth had I said that would make it sound like it was a date?“It’s a girls’ night.”\u003c/p\u003e\n\u003cp\u003e“Where at?” he asked, taking a bite.\u003c/p\u003e\n\u003cp\u003eI studied him, wondering what was going through his mind. “It’s here at the house. Why?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I thought maybe I’d swing by after I’m done tonight and join you. You’re meeting all of my friends. I can return the favor.”\u003c/p\u003e\n\u003cp\u003e“It’s a girls’ night, so…”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “I’ll finagle my way in.”\u003c/p\u003e\n\u003cp\u003e“We won’t be partying until four in the morning, so you’ll still be out by the time we’re done.”\u003c/p\u003e\n\u003cp\u003eHis eyes narrowed on me. “Why don’t you want me to come to this thing?”\u003c/p\u003e\n\u003cp\u003eI poked a finger into his chest. That only served to turn his glare into a smile. “You aren’t invited. Don’t sweat it. It’s just a small, quiet get together. You’d be bored to tears in five minutes.”\u003c/p\u003e\n\u003cp\u003e“What time does it start?”\u003c/p\u003e\n\u003cp\u003e“Early. And it ends early.”\u003c/p\u003e\n\u003cp\u003e“Do you all sit around and talk, or like watch chick flicks?”\u003c/p\u003e\n\u003cp\u003eI sighed. “We sit around and talk and drink cocktails. There’s not a thing about it you’d be interested in. Just go and do your usual routine tonight. Don’t worry your pretty little head about it.”\u003c/p\u003e\n\u003cp\u003eThat lit his face up with his most sinister smile. “I feel like you’re daring me to come.”\u003c/p\u003e\n\u003cp\u003eI shook my head. “You’re a whack-job, you know that? I am most definitely not daring you. I’m warning you off.”\u003c/p\u003e\n\u003cp\u003eThat had his eyes narrowing again. “You’re hiding something from me. I’m going to ask Bev what this is all about.\u003c/p\u003e\n\u003cp\u003eI lifted my chin. “Go for it. She’ll tell you what I just did. Girls only. No boys allowed.”\u003c/p\u003e\n\u003cp\u003eHe sighed, finally looking resigned about the whole thing. “Fine. What about tomorrow night? We on for tomorrow?”\u003c/p\u003e\n\u003cp\u003eI smiled, relieved that he was done pressing the issue. I really didn’t want Lucy to get a load of him. She wouldn’t believe for a second that he and I were purely platonic. Hell, even I didn’t really believe it.\u003c/p\u003e\n\u003cp\u003e“We’re on,” I told him.\u003c/p\u003e\n\u003cp\u003e“Any plans for today?” he asked, taking the last bite of his sandwich.\u003c/p\u003e\n\u003cp\u003e“I told the boys I’d swim with them after breakfast.”\u003c/p\u003e\n\u003cp\u003e“You said you’d swim with us for four hours!” Ivan called from his couch, where he was scarfing down his blueberry pancakes.\u003c/p\u003e\n\u003cp\u003e“I said four hours or until you said uncle,” I called back. I took a huge bite out of my sandwich, stuffed but unable to throw it away.\u003c/p\u003e\n\u003cp\u003eTristan snagged the last bit out of my hand, eating it.\u003c/p\u003e\n\u003cp\u003e“Lucky for you, I have swim trunks packed,” he said after he’d washed the bite down with a long drink of his water.\u003c/p\u003e\n\u003cp\u003e“Oh, darn. I was hoping you’d have to borrow a bikini from me. That would have made my day.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “You’ll have to remember that the next time you win a bet.”\u003c/p\u003e\n\u003cp\u003eTristan was competitive. In fact, he took the term to a whole new level. He could turn anything into a challenge, from eating breakfast, to being the dogs’ favorite, and he liked to gamble with it. Always. Even my mundane life was never dull, with Tristan around.\u003c/p\u003e\n\u003cp\u003e“Oh, I will, now that you’ve put it on the table.”\u003c/p\u003e\n\u003cp\u003e“Whoa, whoa, whoa,” he said, waving a hand as though to ward the notion off. “It’s not on the table unless you have something just as big to wager on your end.”\u003c/p\u003e\n\u003cp\u003eI pursed my lips, thinking. “I’ll come up with something by the time you pull some new competition out of your sleeve.”\u003c/p\u003e\n\u003cp\u003e“How about letting me sleep in your bed?” His expression was perfectly innocent, the reprobate.\u003c/p\u003e\n\u003cp\u003e“Excuse me?” I asked, wondering if I’d heard him right.\u003c/p\u003e\n\u003cp\u003e“No funny business. If I win our next wager, I get to sleep in your bed with you, instead of on the couch. I repeat, no funny business. If you win, I’ll wear one of your bikinis for a humiliating swim session. It’ll have to be here at the house, and with the boys gone, since I can guarantee I’ll be exposing myself.”\u003c/p\u003e\n\u003cp\u003eMy mind went crazy for a minute, picturing that very vividly. I’d never thought that cross-dressing could be a turn-on for me.\u003c/p\u003e\n\u003cp\u003e“Oh no, boo,” he uttered softly, watching me. “Don’t get that look on your face. Are you trying to kill me?”\u003c/p\u003e\n\u003cp\u003eI snapped out of it, swallowing hard. He’d won our little tiff over the nickname boo. I’d given up. He’d wanted to call me that more than I hadn’t wanted him to. I was secretly even beginning to think it was cute.\u003c/p\u003e\n\u003cp\u003eI pointed. “You can change first. I need to get the boys’ swim trunks out for them.”\u003c/p\u003e\n\u003cp\u003eHe strode out of the kitchen and towards my room. I wasn’t surprised when I heard the shower turn on less than a minute later.\u003c/p\u003e\n\u003cp\u003eI fished out the boys’ swim trunks and left them to change. I nearly walked into Tristan as he stepped out of my bedroom and into my path.\u003c/p\u003e\n\u003cp\u003eI looked up at his face, trying hard not to stare at his bare chest. The sight was mouth-watering. “The boys are getting ready,” I told him. “Now I just need to change. I only need a minute. Can you wait out by the pool, in case they jump the gun and rush it?”\u003c/p\u003e\n\u003cp\u003eHe just nodded, turned, and walked away. I had the supreme self-control not to watch him do it.\u003c/p\u003e\n\u003cp\u003eI was a big fan of one-piece black suits for pool time with the boys, but I didn’t even consider it just then. I fished out my only string bikini. It was bronze, with a gold cover-up, but I left the cover-up in my drawer, knowing I’d be swimming the entire time.\u003c/p\u003e\n\u003cp\u003eI was reaching out to open the sliding glass door that led to the pool when I remembered sunscreen.\u003c/p\u003e\n\u003cp\u003eI grabbed a tube of forty-five SPF out of the bathroom, catching Mat as he was racing through the hallway.\u003c/p\u003e\n\u003cp\u003eHe stood still, but tapped his foot impatiently as I helped him put it on. “I coulda been in the pool already, boo,” he whined.\u003c/p\u003e\n\u003cp\u003e“Well, we don’t swim without putting sunblock on first, so no you couldn’t have,” I told him sternly. I wasn’t one to indulge whiny moods.\u003c/p\u003e\n\u003cp\u003eHe glanced at me, and snapped out of it almost instantly. “Can I go now?”\u003c/p\u003e\n\u003cp\u003eI nodded, waving him off. “Go for it, peeka.”\u003c/p\u003e\n\u003cp\u003eIvan came barreling down the hallway, and I gave him the same treatment. He stood patiently, knowing the routine.\u003c/p\u003e\n\u003cp\u003e“Is Tristan going to live with us for very long?” he asked.\u003c/p\u003e\n\u003cp\u003e“Not very long. Just another week or two. How come?”\u003c/p\u003e\n\u003cp\u003e“I like him. He’s a good cook, and he’s funny.”\u003c/p\u003e\n\u003cp\u003e“Can’t argue with that,” I told him, then waved him off.\u003c/p\u003e\n\u003cp\u003eI took a minute to pull my hair into a messy ponytail on top of my head, and carefully sun-blocked my face in the mirror. I went outside to keep an eye on the boys as I spread it over my body.\u003c/p\u003e\n\u003cp\u003eIvan and Mat were already in the pool as I stepped outside. Tristan was poised at the edge of the pool, watching them attentively. I had a brief moment to take in the awesome sight of Tristan shirtless in broad daylight before he looked at me.\u003c/p\u003e\n\u003cp\u003eI slipped on my gold framed shades, then bent to rub the sunscreen into my thighs. I propped my foot on one of the carelessly strewn lounge chairs to cover my knee and calf. Slowly, I gave my other leg the same treatment. I straightened, rubbing it onto my shoulders, and arms.\u003c/p\u003e\n\u003cp\u003eI began to walk towards Tristan as I slathered it onto my stomach.\u003c/p\u003e\n\u003cp\u003eI handed him the bottle when I reached him.\u003c/p\u003e\n\u003cp\u003eI saw his throat work as he swallowed hard. He was wearing shades, too, but I could still read his expression well enough.\u003c/p\u003e\n\u003cp\u003e“Want me to get your back?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” I said, caught off-guard. I’d forgotten to do my back. I’d meant for him to use it for himself, but he made a good point. I turned around.\u003c/p\u003e\n\u003cp\u003eThe first touch of his slick hands made me jump. He rubbed the sunblock on, and I was very conscious of the fact that I loved his hands on me. And he hadn’t even begun…\u003c/p\u003e\n\u003cp\u003eAfter he’d covered my shoulders and back with tantalizingly light touches, he began to rub and massage, focusing on my shoulders. I just about melted beneath his fingertips.\u003c/p\u003e\n\u003cp\u003e“Mmmm,” I hummed as he worked at a tense spot on my neck.\u003c/p\u003e\n\u003cp\u003e“I see you rubbing this spot all the time. You’re tense. You should let me work on you.”\u003c/p\u003e\n\u003cp\u003e“Are you a massage therapist, too?”\u003c/p\u003e\n\u003cp\u003e“No, but I have strong hands, and they’re at your service, whenever you like.”\u003c/p\u003e\n\u003cp\u003eBoy, did my mind go crazy with that statement, running wild with the things I’d like him to do with his hands.\u003c/p\u003e\n\u003cp\u003eHis hands moved down my back, rubbing deep into my muscle tissue. He worked to the sides of my waist, kneading. I moaned when his arms circled me, his hands working on my abs. I felt his chest just brush against my back, and instinctively I leaned into him.\u003c/p\u003e\n\u003cp\u003e“Boo, why is he touching your belly?” Mat shouted with typical six-year old volume control basically loud enough to alert the entire neighborhood.\u003c/p\u003e\n\u003cp\u003eThat snapped me out of it. I straightened, moving away from Tristan. “He was helping me put on sunscreen, peeka.”\u003c/p\u003e\n\u003cp\u003eI didn’t look at Tristan again until he spoke. “Can you get my back?” he asked, his voice hoarse.\u003c/p\u003e\n\u003cp\u003e“Yes, of course,” I said, moving to help him automatically. I paused for a long moment, staring at his back on full display.\u003c/p\u003e\n\u003cp\u003eI thought that there couldn’t be anything on earth sexier than a strong back as I began to work the sunblock into his skin, relishing the feel of his firm, resilient flesh. I kneaded at his shoulders, trying to copy what he’d done to me, as I studied his myriad tattoos.\u003c/p\u003e\n\u003cp\u003eThere was a golden dragon on his shoulder. It was intricate, and every detail looked precise and perfect, even in the direct sun. It was beautiful. I made a note to ask him about it. Later. \u003c/p\u003e","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-10.html","bookId":1929,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
