{"id":64555,"no":14,"title":"Page 14","content":"\u003cp\u003eI was in the kitchen, replenishing the snack trays, when I saw that I’d missed three calls.\u003c/p\u003e\n\u003cp\u003eI’d left my phone on the counter, and I grabbed it, a little too eager to see who had called.\u003c/p\u003e\n\u003cp\u003eI felt a ridiculous amount of disappointment when I saw that they were all from my ex, or Daryl the Dickhead, as I liked to think of him.\u003c/p\u003e\n\u003cp\u003eIt was silly to expect Tristan to call me, just because we’d been apart for a few hours. Lucy’d hit it right on the head about my co-dependency issues.\u003c/p\u003e\n\u003cp\u003eMy phone dinged a text at me, and I was disappointed yet again when I saw that it was a text from Daryl.\u003c/p\u003e\n\u003cp\u003eDaryl: I miss you, baby. Why you ignoring my calls?\u003c/p\u003e\n\u003cp\u003eI felt my lip curl up in disgust. The bastard had a nerve.\u003c/p\u003e\n\u003cp\u003eI started to respond before I remembered that texting back, no matter what I said, only ever encouraged him.\u003c/p\u003e\n\u003cp\u003eTwo things happened at once.\u003c/p\u003e\n\u003cp\u003e“Is that asshat bothering you again?” Candy shouted from the living room, right as the front door opened.\u003c/p\u003e\n\u003cp\u003eI looked up to see that Tristan had just walked in, and all of the women were watching me. That quickly changed, and I could have been happy that the potentially awkward conversation about my ex had been avoided, except that Tristan had apparently heard her comment, and although the women’s attention had shifted to focus on him, his was very much focused on me.\u003c/p\u003e\n\u003cp\u003e“Who’s bothering you? What’s going on?” he asked, striding straight to the kitchen. He’d obviously taken Candy’s comment way too seriously.\u003c/p\u003e\n\u003cp\u003e“Um, no one. Nothing’s going on. Why are you home so early? Shouldn’t you still be working?”\u003c/p\u003e\n\u003cp\u003eHe shrugged, his eyes going to the phone still in my hand. “I ducked out early. Is it that asshole ex of yours calling you again? I’m seriously going to kick his ass if he doesn’t leave you alone.”\u003c/p\u003e\n\u003cp\u003eI set my phone down on the counter, folding my arms across my chest. I saw his eyes go to my bared stomach, and I was gratified as he swallowed hard before looking back at my face.\u003c/p\u003e\n\u003cp\u003e“The first time you’ve had a paying gig all week, and you ditch out? Are you like, allergic to work?”\u003c/p\u003e\n\u003cp\u003eI’d been trying to distract him from talking about my ex, and it worked like a charm, for all of ten seconds.\u003c/p\u003e\n\u003cp\u003eHe laughed, moving into the kitchen.\u003c/p\u003e\n\u003cp\u003eHe grabbed my phone off the counter before I saw his intent.\u003c/p\u003e\n\u003cp\u003e“So rude,” I told him. “How would you like it if I started snooping through your phone?”\u003c/p\u003e\n\u003cp\u003eHe didn’t look up from my phone as he reached into his pocket and handed me his. “Go for it, boo.”\u003c/p\u003e\n\u003cp\u003e“Boo?” Candy called from the living room, sounding amused.\u003c/p\u003e\n\u003cp\u003eI’d forgotten that we weren’t alone, which said a lot about how much Tristan distracted me.\u003c/p\u003e\n\u003cp\u003eI set his phone on the counter, folding my arms across my chest, and giving him a very unfriendly look.\u003c/p\u003e\n\u003cp\u003eHe didn’t look up, scrolling through my phone. I saw his jaw clench right before he brought the phone to his ear.\u003c/p\u003e\n\u003cp\u003eWithout another word, he strode out of the kitchen, through the dining room, opened the sliding glass door, and walked outside.\u003c/p\u003e\n\u003cp\u003eI followed him, wondering what the hell he was up to.\u003c/p\u003e\n\u003cp\u003e“Is this Daryl?” he said into my phone.\u003c/p\u003e\n\u003cp\u003eMy jaw dropped.\u003c/p\u003e\n\u003cp\u003eHe paused for a long moment, and whatever Daryl was saying was loud, because I could hear his voice from several feet away, though I couldn’t make out a word of what he was saying.\u003c/p\u003e\n\u003cp\u003e“Who I am is the guy who is going to kick your fucking ass if you don’t leave her alone. One more phone call, one more text, so much as a fucking email, and I will find you. Do you understand?”\u003c/p\u003e\n\u003cp\u003eHe paused again, and I could hear that Daryl was yelling on the other end of the line. “It doesn’t sound like you’re understanding what I’m saying. How about I come over to your house, and we can talk about it in person? Hell yeah, call the cops. Cops or no, I can guarantee that I will mess you up before they can take me away. I’m a very close friend of Danika’s, and I take my friendships very seriously. Now do you understand? Lose her fucking number.”\u003c/p\u003e\n\u003cp\u003eHe paused for a long time before speaking again. “That’s just fine. Fuck you, too, man, just so long as you leave my girl alone.”\u003c/p\u003e\n\u003cp\u003eHe hung up the phone, looking at me.\u003c/p\u003e\n\u003cp\u003eHe sighed, striding to me. He pushed my face into his chest, hugging me. I melted against him, even pissed. I thought that was because I wasn’t really pissed. It was more that I thought I should be pissed. What I was was completely infatuated. I didn’t think I’d ever met a sweeter guy in my life.\u003c/p\u003e\n\u003cp\u003eHe kissed the top of my head, murmuring, “Don’t be mad at me, K? I just want to look out for you. I can’t help it. You’ve put up with enough of that guy’s shit. Let me take over. I’ll make sure he never bothers you again.”\u003c/p\u003e\n\u003cp\u003e“You aren’t really going to beat him up, are you? That was just a threat, right?”\u003c/p\u003e\n\u003cp\u003e“Sure, boo,” he murmured into my hair. “I won’t beat him up, just so long as he never tries to contact you again.”\u003c/p\u003e\n\u003cp\u003eReluctantly, I pulled myself out of his arms. “You’re impossible, you know that?”\u003c/p\u003e\n\u003cp\u003eHe nodded, and gave me that dangerous smile. “I’m impossible, and you’re irresistible. That’s a great mix, if you ask me.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes, heading back into the house. “Irresistible, my ass,” I muttered.\u003c/p\u003e\n\u003cp\u003eHe laughed. “Exactly,” he said.\u003c/p\u003e\n\u003cp\u003eHe laughed harder when he saw the writing on my butt. “Sassy pants, huh? Did you have those custom made?”\u003c/p\u003e\n\u003cp\u003eI shot him a very sassy look as I started to open the door. “You think you can just infiltrate a girls’ night in? We’ll see about that. I’m going to have you voted out.”\u003c/p\u003e\n\u003cp\u003eHe stopped me with a hand on my arm and a big grin. “Let’s make a wager out of it. If the girls vote me out, I’ll give you that bikini peep show you’ve been fantasizing about.”\u003c/p\u003e\n\u003cp\u003eI raised a brow, instantly intrigued. That would be priceless…\u003c/p\u003e\n\u003cp\u003e“And if they don’t vote you out, you get to sleep in my bed, no funny business.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “No funny business.”\u003c/p\u003e\n\u003cp\u003eI held my hand out to shake.\u003c/p\u003e\n\u003cp\u003eHis big, warm hand enveloped mine.\u003c/p\u003e\n\u003cp\u003e“You’re going to lose,” I warned him. “I know these women better than you do. They won’t be swayed by your pretty face and your slutty body.”\u003c/p\u003e\n\u003cp\u003eI opened the door and walked inside while he was still laughing at me.\u003c/p\u003e\n\u003cp\u003eI went back to the loveseat and no sooner had I sat back down than Tristan was sitting next to me, crowding so close that I had to scoot nearly into Bev to give him room.\u003c/p\u003e\n\u003cp\u003eTristan threw his arm over the back of the couch, making himself very comfortable.\u003c/p\u003e\n\u003cp\u003e“Girls, this is Tristan. He thinks he can crash our girls’ night. I told him it was girls only, no exceptions. Who wants to help me kick his ass out?”\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed when not one of them volunteered.\u003c/p\u003e\n\u003cp\u003e“I vote we keep his ass in,” Candy said, giving him a very friendly smile. “I like his ass already.”\u003c/p\u003e\n\u003cp\u003eI mouthed a few choice words at her.\u003c/p\u003e\n\u003cp\u003e“It’s more of a friends’ night than a girls’ night,” Harriet said. “We just don’t have any men volunteering to join.”\u003c/p\u003e\n\u003cp\u003e“What’s the harm?” Jen joined in. “The more the merrier.”\u003c/p\u003e\n\u003cp\u003eI couldn’t believe it. They were turning on me. I opened my mouth to say something when Tristan spoke into my ear. “If you tell them it’s a bet, I automatically win the bet.”\u003c/p\u003e\n\u003cp\u003e“Fine,” I bit out. “Let’s take a vote. By a show of hands, who wants to let a man into our sacred girl ritual night?”\u003c/p\u003e\n\u003cp\u003eEveryone raised an eager hand in the air, except for Bev and Lucy, apparently the only ones who had my back.\u003c/p\u003e\n\u003cp\u003eI continued, even knowing I’d lost. It wasn’t in my nature to just give up. “Who votes we keep our girls’ night how God intended it, girls only?”\u003c/p\u003e\n\u003cp\u003eMe, Bev, and Lucy raised our hands. I didn’t know if I wanted to laugh or kick him when I saw that Tristan was raising a hand. He knew that he had enough votes, even if he voted with me, the smug bastard.\u003c/p\u003e\n\u003cp\u003eAnd so he stayed, chatting up the ladies until nearly three in the morning.\u003c/p\u003e\n\u003cp\u003eAside from the sting of losing a bet, I thoroughly enjoyed having him there.\u003c/p\u003e\n\u003cp\u003eHe was funny, and charming, and for whatever reason, he gently deflected Candy, and then Harriet’s subtle, and not so subtle come-ons.\u003c/p\u003e\n\u003cp\u003eLucy shot me a few concerned glances in the beginning, but in the end, even she was charmed by Tristan’s playful personality.\u003c/p\u003e\n\u003cp\u003e“You know, we usually call it a night by ten, eleven tops,” I told Tristan, as he helped me clean up after all of the women had left. He’d even managed to shoo Bev off to bed, not letting her help with cleanup. She’d had enough of her own strong cocktails to take him up on the offer gratefully.\u003c/p\u003e\n\u003cp\u003e“Did I corrupt your friends?” he asked with a shameless smile.\u003c/p\u003e\n\u003cp\u003eA corner of my mouth kicked up ruefully. “Not as badly as you’re corrupting me. I don’t do the dirty Vegas club scene.”\u003c/p\u003e\n\u003cp\u003e“I think I understand you a little better now, after meeting your friends. You’re like a forty-five year old, trapped inside of a hot, twenty-one year old body. That might be why you can never really cut loose and just let go.”\u003c/p\u003e\n\u003cp\u003eI took exception to that. “I cut loose all the time. We’ve been out dancing every night this week. What do you call that?”\u003c/p\u003e\n\u003cp\u003eHe pursed his lips, which drew my traitorous eyes to them, even in a bit of a pique. “It’s true you can dance. God, can you dance. And you’re certainly able to go out and have a good time, but that just isn’t the same as letting go. Even drunk until you feel pretty, you seem to stay in control every single second. I’ve yet to see you have a twenty-one year old moment.”\u003c/p\u003e\n\u003cp\u003e“Well, excuse me for not being a total slutbag, like half of the twenties crowd in Vegas.”\u003c/p\u003e\n\u003cp\u003e“It’s probably a lot more than half…” he mused.\u003c/p\u003e\n\u003cp\u003e“Well, it isn’t me. If that’s your idea of letting go, I think I’m just fine how I am.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t trying to offend you,” he said in his most conciliatory tone. “And I absolutely don’t mean that you should be sleeping around. I don’t know how to put it into words, but I’d just like to see you acting carefree sometimes.”\u003c/p\u003e\n\u003cp\u003eI stewed about that for a bit, as we finished cleaning up.\u003c/p\u003e\n\u003cp\u003ePerhaps he has a point, I thought.\u003c/p\u003e\n\u003cp\u003eI’d had an aimless sort of existence, growing up. My mother, a slave to the illness of addiction, had only ever lived in the present, which, I supposed, was why I had my eye determinedly on the future, which I knew was not the typical frame of mind for a twenty-one year old.\u003c/p\u003e\n\u003cp\u003eMy sister and I had been tossed around ruthlessly by our mother’s fickle way of life. She’d been so negligent that, in our teenage years, when she’d disappeared for a solid two weeks, social services had been alerted, which had led to an unfortunate turn of events. I had been so powerless, back then.\u003c/p\u003e\n\u003cp\u003eBut not anymore. Nowadays, I had my own fate well in hand.\u003c/p\u003e\n\u003cp\u003e“Are you stewing about the bet you lost? Going to miss keeping that big, soft bed all to yourself? I’ll bet you’re a cover hog.”\u003c/p\u003e\n\u003cp\u003eI rolled my eyes at him, but I couldn’t contain my grin. I knew I should have been more worried about the fact that we were going to be sharing a bed, but I just wasn’t. It was strange for me, especially considering we’d only known each other a week, but I trusted him. \u003c/p\u003e","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-14.html","bookId":1929,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
