{"id":64560,"no":19,"title":"Page 19","content":"\u003cp\u003e“A word,” he said through his teeth, then turned on his heel, striding out the back door.\u003c/p\u003e\n\u003cp\u003eJared sighed heavily. “Well, fuck,” he muttered.\u003c/p\u003e\n\u003cp\u003eHe squeezed my hand lightly before standing and following his brother.\u003c/p\u003e\n\u003cp\u003eI could imagine what was going on back there. Tristan would be reaming his brother out for what he’d have taken as a direct come-on. And certainly his brother was capable of that. They both were. But I didn’t think that had been what Jared was about. He was a genuinely nice guy, and I really thought he had just been offering comfort after asking a few too many awkward questions.\u003c/p\u003e\n\u003cp\u003eI’d told Jared that I would consider going out with him, when I was ready to date again, but I had to wonder if that was even an option. I knew, just knew, that if I dated Jared, it would drive Tristan insane, no matter that he and I had firmly committed to just being friends. What a mess, I thought.\u003c/p\u003e\n\u003cp\u003eLeticia came to sit beside me. Her eyes were on the back door, her brow furrowed. I marveled again at how lovely she was as she turned her dark eyes on me.\u003c/p\u003e\n\u003cp\u003e“You aren’t going to make my boys fight over you, are you?” she asked softly, glancing at the back door. It was sliding glass, but the brothers had moved out of sight right after they’d closed the door.\u003c/p\u003e\n\u003cp\u003eHer words struck me as a little hostile, but she didn’t seem hostile, just concerned.\u003c/p\u003e\n\u003cp\u003e“I’m not.” My words were soft, and even to my own ears they lacked any conviction. That made me defensive. “Tristan and I are strictly friends.”\u003c/p\u003e\n\u003cp\u003eShe shot me a sardonic look. She’d been sweet as sugar to me so far, but I saw the spicier side to her personality in that one look.\u003c/p\u003e\n\u003cp\u003e“You’re a smart girl, but that’s not a smart assessment. Strictly friends? Do you really believe that?”\u003c/p\u003e\n\u003cp\u003eMy mouth twisted. “We’re trying really hard to keep it that way. It’s what’s best for both of us.”\u003c/p\u003e\n\u003cp\u003eShe tossed her hair, and rolled her eyes. It made me smile. Who was I to knock a sassy woman? “Well, good luck to you, but I think you’re fighting a losing battle. And God help you if Tristan decides he wants more. He’s just like his father, and his father was impossible to resist, even when he was being a bastard. God, I loved that bastard. I named Tristan after him, in the hopes that he would be like that. His father could be callous, but…so charismatic. That man could get anything he wanted out of life. I wanted my son to be like that.”\u003c/p\u003e\n\u003cp\u003e“You named him after his father that left you both?”\u003c/p\u003e\n\u003cp\u003eShe did her little hair toss/eye roll. “I did, and I don’t regret it. Tristan hates that I did that, but it makes perfect sense to me.”\u003c/p\u003e\n\u003cp\u003eIt did not make sense to me, and I was definitely siding with Tristan on that one, but I held my tongue. I didn’t need to get into an argument with a woman I’d just met about something that was none of my business.\u003c/p\u003e\n\u003cp\u003e“And what about Jared? Did you name him after his father?”\u003c/p\u003e\n\u003cp\u003e“I did. I loved him, too.”\u003c/p\u003e\n\u003cp\u003e“And did he leave, too?”\u003c/p\u003e\n\u003cp\u003eI knew I’d overstepped with that one, but it didn’t seem to faze her.\u003c/p\u003e\n\u003cp\u003e“He stuck around for years actually. He was a very nice man. If you want to know the difference between the fathers, just look at the brothers.”\u003c/p\u003e\n\u003cp\u003eThat made me a little angry. I didn’t think it was fair to compare Tristan to a man who had left his son with no father. But then again, I had very similar baggage, so I was a touch sensitive about it.\u003c/p\u003e\n\u003cp\u003e“Has Tristan knocked up any girls, and then run in the other direction?” I asked, feeling riled.\u003c/p\u003e\n\u003cp\u003eShe pursed her lips, sending me a sidelong look. “He hasn’t. Not yet, anyway. You don’t have to defend him to me. No one loves him more than I do.”\u003c/p\u003e\n\u003cp\u003e“Then give him a little credit.”\u003c/p\u003e\n\u003cp\u003eShe waved her hands in the air, as though erasing the conversation. “Enough of the serious talk. I love my boys. That’s all I meant. Don’t make them hate each other.”\u003c/p\u003e\n\u003cp\u003e“I would never—”\u003c/p\u003e\n\u003cp\u003e“Good. Then let’s move on. Do you like mota?”\u003c/p\u003e\n\u003cp\u003eI just blinked at her, confused. “Mota?”\u003c/p\u003e\n\u003cp\u003eHair toss. Eye roll. “Marijuana? Do you like?”\u003c/p\u003e\n\u003cp\u003eI shook my head vigorously. In my experience, only losers smoked pot, and so I’d always stayed far, far away from the stuff.\u003c/p\u003e\n\u003cp\u003e“Well, I like, so I hope you don’t mind if I partake.”\u003c/p\u003e\n\u003cp\u003eI shook my head again. “It’s your house…”\u003c/p\u003e\n\u003cp\u003eThe brothers were both smiling as they filed back into the house, which I found reassuring, but I was a little shocked when Leticia casually handed Jared a lit joint, and he just took it, thanking her.\u003c/p\u003e\n\u003cp\u003eWas this normal? Was I really such a prude?\u003c/p\u003e\n\u003cp\u003eShe offered one to Tristan, but he waved her off, glancing at me.\u003c/p\u003e\n\u003cp\u003e“Don’t deny yourself on my account,” I said wryly, though I really didn’t want him to. I hated the stuff.\u003c/p\u003e\n\u003cp\u003eHe shook his head. “No, I’m good.”\u003c/p\u003e\n\u003cp\u003e“What the hell was up with that move you made during dinner?” I asked him later as he drove us home in my junker of a car.\u003c/p\u003e\n\u003cp\u003e“Hmmm?” His tone and even his lying face were all innocence.\u003c/p\u003e\n\u003cp\u003e“You know what. The hand on my knee. What was that all about?”\u003c/p\u003e\n\u003cp\u003eHe sighed, dropping the act. “Fuck, I’m sorry about that. Just watching you eat with that look on your face… I lost my mind for a minute.”\u003c/p\u003e\n\u003cp\u003e“You were being a tease. I’d recommend you not start playing that game with me.”\u003c/p\u003e\n\u003cp\u003e“Is that a threat?” he asked, sounding all sorts of intrigued with the idea.\u003c/p\u003e\n\u003cp\u003e“It is. Don’t start a war you can’t win, my friend. In the battle of the teases, I would whip your slutty ass, you sex fiend.”\u003c/p\u003e\n\u003cp\u003eHe laughed so hard that he had to pull the car over.\u003c/p\u003e\n\u003cp\u003e“You know I’m right,” I said, folding my arms over my chest.\u003c/p\u003e\n\u003cp\u003eHe nodded. “I completely agree, but you know I can’t turn down a challenge. Is that what you’re doing? Making it a challenge?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “No. There’s no challenge. No competition at all, and I refuse to turn it into a bet.”\u003c/p\u003e\n\u003cp\u003eHe pulled the car back onto the street again, smiling and shaking his head. “That’s a pity.”\u003c/p\u003e\n\u003cp\u003eDare I ask? “Why is that a pity?”\u003c/p\u003e\n\u003cp\u003e“Because I’d love to win or lose a bet like that. But you’re right. It would be a stupid thing to do.”\u003c/p\u003e\n\u003cp\u003e“So stupid,” I agreed. We didn’t say another word on the ride home, and I just knew that we were both thinking about how much we wanted to do something stupid.\u003c/p\u003e\n\u003cp\u003eCHAPTER FIFTEEN\u003c/p\u003e\n\u003cp\u003eWe went a few days without managing to do anything stupid, but of course, that wasn’t meant to last. The only surprising thing was, I was the first one to break open the stupid damn.\u003c/p\u003e\n\u003cp\u003eI woke up a few mornings later having the most graphic sex dream of my life.\u003c/p\u003e\n\u003cp\u003eIt was Tristan’s big hands on me in the dream, cupping my breasts and kneading, working down my belly, between my legs.\u003c/p\u003e\n\u003cp\u003eWe were out in the pool, alone. Like most dreams, nothing quite made sense. Like, why were we skinny-dipping in the middle of the day? Still, my dreaming mind went with that eagerly.\u003c/p\u003e\n\u003cp\u003eI was lying on an inflatable lounge that we hardly ever used, because it was shaped in a huge circle, with the middle cut out, and the boys always found horrible ways to use it, like sticking each others’ heads in the hole and dunking.\u003c/p\u003e\n\u003cp\u003eThe hole was being used for an entirely different wrong way in my dream, though. Tristan filled the hole, his distracting torso spilling out of it as he used his mouth on me in the most distracting way.\u003c/p\u003e\n\u003cp\u003eI’d never had a guy go down on me before, and even in the dream my imagination was limited. He just nuzzled me there, his hands far more of a distraction.\u003c/p\u003e\n\u003cp\u003eI woke up with my panties around my knees, and my shirt pulled up to my neck. One of my hands was on a sensitive breast, kneading at it, the other fingering my clit with restless strokes.\u003c/p\u003e\n\u003cp\u003eIt wasn’t that I didn’t care that Tristan was sleeping on the other side of my queen-sized bed, a big pillow all that separated us, it was more that I was too turned-on to let it deter me, and my sleepy mind told me that I could be quiet enough not to wake him. I’d gotten myself too worked up to stop, but I knew from experience that I needed more than my fingers to get myself off.\u003c/p\u003e\n\u003cp\u003eThe hand on my breast reached over to my nightstand, opening the drawer very slowly, the finger on my clit still circling, again and again.\u003c/p\u003e\n\u003cp\u003eI tried not to make any noise as I fished out my vibrator, but the low vibrating sound that it made when I turned it on was louder than I could ever remember. Then again, I didn’t have the luxury of turning on music to drown it out, as I usually did, with someone dead asleep in the bed next to me.\u003c/p\u003e\n\u003cp\u003eI gasped as I shoved it inside of me. I was wet from the dream, and it slid right in. I used one hand to hold it there, the hand from my breast moving to work on my clit.\u003c/p\u003e\n\u003cp\u003eMy eyes were closed, my breath coming out in quiet little pants. They only opened as I felt the bed moving.\u003c/p\u003e\n\u003cp\u003eThat movement should have made me stop, or panic, or do anything at all besides moan, shift the wand inside of me, and bite my lip as I glanced over at the gorgeous man moving towards me.\u003c/p\u003e\n\u003cp\u003eStupid, stupid, stupid, I told myself.\u003c/p\u003e\n\u003cp\u003eMore, more, more, my body screamed back.\u003c/p\u003e\n\u003cp\u003eTristan made a guttural sound, low in his throat, and I couldn’t hold back my own low moan.\u003c/p\u003e\n\u003cp\u003eI was under the covers, but so was he, so that hardly helped. I didn’t protest when he pulled them off both of us.\u003c/p\u003e\n\u003cp\u003eHe moved close, crouched at my side, his knees a breath away from my hip and thigh. The look in his eyes was…intoxicating.\u003c/p\u003e\n\u003cp\u003eHe bit his lip, and I felt myself clench around the wand in response.\u003c/p\u003e\n\u003cp\u003eMy legs were splayed apart, and he moved to straddle one of my thighs, looming over me, but still not touching.\u003c/p\u003e\n\u003cp\u003eI watched him swallow hard, his eyes fixed on my hands.\u003c/p\u003e\n\u003cp\u003eI squirmed.\u003c/p\u003e\n\u003cp\u003e“Can I…help?” he asked hoarsely.\u003c/p\u003e\n\u003cp\u003eI couldn’t even form the words to answer, just whimpering and shifting restlessly instead.\u003c/p\u003e\n\u003cp\u003eHe took that for a yes. One of his hands covered the hand that held the wand, tugging it up my body.\u003c/p\u003e\n\u003cp\u003eI started to protest as it started to slip out of me, but his knee caught it, pushing it deep inside of me.\u003c/p\u003e\n\u003cp\u003e“Ohhh…” I gasped.\u003c/p\u003e\n\u003cp\u003eHe moved my hand until I was cupping my own breast. He squeezed my wrist, which in turn made me knead harder at my pliant flesh.\u003c/p\u003e\n\u003cp\u003e“Pinch your nipple,” he told me, licking his bottom lip. I felt my own tongue copy the motion as I obeyed.\u003c/p\u003e\n\u003cp\u003eMy eyes, hungry to take him in, shot from his intent face, down his ripped torso, past the sexy V formed by the muscles at his hips, and to his heavy erection. He still wore boxer briefs, but they barely contained his jutting cock. I gyrated my hips, trying to get closer to his knee, and grinded the vibrator deeper inside of me.\u003c/p\u003e\n\u003cp\u003e“Mmmm,” he moaned. “That’s right, Danika. Perfect. Circle your hips just like that.”\u003c/p\u003e\n\u003cp\u003eHis other hand moved over the hand I had on my clit, not touching anything but the back of my hand as he took over the movements.\u003c/p\u003e\n\u003cp\u003eI circled my hips, while he moved my hand to circle my clit with just the perfect pressure.\u003c/p\u003e\n\u003cp\u003eHe moved the hand at my nipple to my other breast, nearly touching my skin as he rubbed my fingers deep.\u003c/p\u003e\n\u003cp\u003eHe cursed long and fluidly. \u003c/p\u003e","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-19.html","bookId":1929,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
