{"id":64565,"no":24,"title":"Page 24","content":"\u003cp\u003eShe wiggled her brows at me, her smile self-deprecating. “Hopefully it doesn’t bomb.”\u003c/p\u003e\n\u003cp\u003e“I’m sure it won’t,” I reassured her. “Especially if it’s at the Cavendish Casino. That place is hot right now.”\u003c/p\u003e\n\u003cp\u003e“Let’s hope you’re right. You’ve probably seen some of my work. I’ve done almost all of the ink on Tristan’s back, and his arms. And I’ve done quite a bit of Jared’s, too. Whenever he’s done having a private chat with Dean, I’ll show you.”\u003c/p\u003e\n\u003cp\u003eI glanced over to where the two men had been, and saw that they’d moved several feet away, and were speaking quietly to each other.\u003c/p\u003e\n\u003cp\u003e“Jared’s great, but Dean can be a pain,” Frankie said, her voice pitched low.\u003c/p\u003e\n\u003cp\u003eI nodded. I thought that was putting it nicely.\u003c/p\u003e\n\u003cp\u003e“So do you have any ink?”\u003c/p\u003e\n\u003cp\u003eI shook my head, reading from her smile where she was going with the question.\u003c/p\u003e\n\u003cp\u003e“Is there anything you really want? I’d be happy to help you make all of your tattoo dreams come true.”\u003c/p\u003e\n\u003cp\u003eI chewed on my lip. I had been thinking about that, especially recently. Something about staring at Tristan’s tattoos way too often had made me start to want my own. “I’ve toyed with the idea of getting a little cherry blossom branch on my back.”\u003c/p\u003e\n\u003cp\u003eHer grin widened. She clearly sensed a victory. “We’ll have to work on that. I’ll show you some of my designs that will blow your mind. You don’t even have to let my camera crew tape it, though I’d love it if you did.”\u003c/p\u003e\n\u003cp\u003eI blanched. “TV? I don’t know…”\u003c/p\u003e\n\u003cp\u003e“It’s not as bad as all that. Just think about it.”\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed on her. “You do this all the time, don’t you?”\u003c/p\u003e\n\u003cp\u003eShe shrugged, a very engaging twinkle in her eye. “I love putting my mark on beautiful people. Call it a personal quirk.”\u003c/p\u003e\n\u003cp\u003e“Tristan’s ink is the best I’ve seen.”\u003c/p\u003e\n\u003cp\u003e“Why thank you. Have you seen Jared’s?”\u003c/p\u003e\n\u003cp\u003e“I haven’t gotten a close look at any of it.”\u003c/p\u003e\n\u003cp\u003e“But you have gotten a close look at Tristan’s? Interesting…”\u003c/p\u003e\n\u003cp\u003eI shrugged, my mouth twisting wryly. “I don’t know if interesting is the word. Frustrating would be more apt.”\u003c/p\u003e\n\u003cp\u003eShe laughed. She started to say something, but it was interrupted by some woman behind me loudly calling her name.\u003c/p\u003e\n\u003cp\u003eI turned to see a blonde woman descending on us. She was Vegas pretty, with hair bleached platinum blonde, a face that reminded me a bit of a Bratz doll, and bombshell curves that no one could have mistaken for natural. Still, she filled out her pink bikini in a way that would have made any straight guy look twice.\u003c/p\u003e\n\u003cp\u003eFrankie smiled at the woman, but there was a noticeable chill in her eye that hadn’t been there before.\u003c/p\u003e\n\u003cp\u003e“Natalie,” Frankie said. “Long time no see. What are you doing here?”\u003c/p\u003e\n\u003cp\u003eShe pronounced the Natalie strangely, the a’s made into ah’s. I guessed that Natalie was one of those women that tried to make a pretty normal name sound exotic, but it just came out sounding a little stupid.\u003c/p\u003e\n\u003cp\u003e“Frankie, I can’t tell you how I excited I was when I heard you were getting your own show! I’ve been dying to talk to you!”\u003c/p\u003e\n\u003cp\u003e“Oh yeah?” Frankie asked, disinterest practically pouring off her in waves.\u003c/p\u003e\n\u003cp\u003e“Well, I’ve been wanting to get a tattoo for ages.”\u003c/p\u003e\n\u003cp\u003e“Really?” Frankie was clearly skeptical.\u003c/p\u003e\n\u003cp\u003e“And I think it would be great for my career to have it done on your show.”\u003c/p\u003e\n\u003cp\u003e“Career?” Frankie asked.\u003c/p\u003e\n\u003cp\u003e“I’ve gotten into modeling,” Natalie said smugly.\u003c/p\u003e\n\u003cp\u003eOnly in Vegas, I thought. Natalie was a good three inches shorter than me, which made her unlikely model material, no matter how pretty she was.\u003c/p\u003e\n\u003cp\u003e“I take it you and Howard didn’t work out.”\u003c/p\u003e\n\u003cp\u003eNatalie shrugged. “We’re still seeing each other. Nothing exclusive anymore, but he’s been good to me, and I won’t forget it.”\u003c/p\u003e\n\u003cp\u003e“Sure, yeah.” It was so obvious to me that Frankie couldn’t stand the woman, but Natalie seemed oblivious to it.\u003c/p\u003e\n\u003cp\u003eNatalie’s gaze sharpened on something behind Frankie, and I’d have sworn it turned predatory. “Is that Jared Vega?” she asked softly.\u003c/p\u003e\n\u003cp\u003eFrankie didn’t bother to hide her eye roll. “It is.”\u003c/p\u003e\n\u003cp\u003e“Is Tristan around? Those two are usually inseparable.”\u003c/p\u003e\n\u003cp\u003eFrankie’s smile was just a flash of teeth. “Nope.”\u003c/p\u003e\n\u003cp\u003e“Damn. I needed to talk to him.”\u003c/p\u003e\n\u003cp\u003e“You could always call him,” Frankie offered.\u003c/p\u003e\n\u003cp\u003eNatalie flushed. “I don’t have his number. Could I get it from you?”\u003c/p\u003e\n\u003cp\u003e“Sorry. Can’t do that. I’ll let him know you wanted to talk to him, if you want.”\u003c/p\u003e\n\u003cp\u003e“Fine,” Natalie said, her tone dismissive, then abruptly walked away.\u003c/p\u003e\n\u003cp\u003e“That was…interesting,” I said, wondering what to make of the blonde woman. She hadn’t been openly rude, just strange.\u003c/p\u003e\n\u003cp\u003e“Natalie wouldn’t know how to be anything but self-serving. A lot of conversations with her end like that. When you’re no longer useful to her, she just walks away.”\u003c/p\u003e\n\u003cp\u003e“Hmm,” I said.\u003c/p\u003e\n\u003cp\u003e“She’s a gold digger. You know the type. What she said about her ex, Howard, says it all. That was gold digger code for, we’re not dating, but I give him a blow job every time he pays my bills. Howard is almost sixty years old, by the way.”\u003c/p\u003e\n\u003cp\u003e“Yuck,” I said, watching the bombshell blonde approaching Jared and Dean. “She has to still be in her twenties.”\u003c/p\u003e\n\u003cp\u003e“She is. And that’s not even the worst of it. The whole story is just awful. She was Tristan’s high school sweetheart.”\u003c/p\u003e\n\u003cp\u003eThat made my heart twist painfully in my chest.\u003c/p\u003e\n\u003cp\u003e“The fact that he won’t date, that he only hooks up, is at least partially because of that twat,” Frankie said.\u003c/p\u003e\n\u003cp\u003eThat word made the side of my mouth kick up in spite of the way her statement made me feel. “Twatalie made him like that?”\u003c/p\u003e\n\u003cp\u003eFrankie threw back her head and laughed. “Oh, I like you. Yes, she did. Or at least, I blame her. Twatalie started seeing Howard when she still had Tristan’s ring on her finger.”\u003c/p\u003e\n\u003cp\u003eI went from mildly disliking Natalie to openly hating her guts with that one sentence. I couldn’t have said which made me hate her more; the fact that she’d been engaged to Tristan, or the fact that she’d cheated on him.\u003c/p\u003e\n\u003cp\u003e“That twat,” I said softly.\u003c/p\u003e\n\u003cp\u003e“Exactly,” Frankie agreed.\u003c/p\u003e\n\u003cp\u003eWe reached the front of the line, and a very friendly bartender got me two margaritas, and an entire tray of tequila shots for Frankie.\u003c/p\u003e\n\u003cp\u003eI eyed up the shots dubiously. “Please tell me those aren’t all for you.”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “For us. I don’t like to drink alone. How hard do you think it will be to get Jared away from his pretty boyfriend?”\u003c/p\u003e\n\u003cp\u003eI glanced over at the two men. Natalie was gone, but they hadn’t stopped talking quietly to each other. “They don’t look like they want to be disturbed.”\u003c/p\u003e\n\u003cp\u003e“Well, then, let’s start without him. He’ll find us when he’s done.”\u003c/p\u003e\n\u003cp\u003eWe hopped into a shallow corner of the pool, setting the drinks on the edge.\u003c/p\u003e\n\u003cp\u003eShe talked me into a tequila shot, and I downed it with a grimace.\u003c/p\u003e\n\u003cp\u003e“So I know that Tristan had to work tonight. Does he know that you’re here with his brother?”\u003c/p\u003e\n\u003cp\u003e“He doesn’t.”\u003c/p\u003e\n\u003cp\u003e“Be careful about that. I know you aren’t dating, but it feels…messy to me. Those two are close. It would be a pity to drive a wedge between them.”\u003c/p\u003e\n\u003cp\u003eI sighed. “I know. I thought about dating Jared, but I’ve decided tonight that it’s not happening. It just feels wrong. I don’t want to come between them, and I don’t want to lead Jared on.”\u003c/p\u003e\n\u003cp\u003e“Have you told Jared that? He seems to be sporting a big crush.”\u003c/p\u003e\n\u003cp\u003e“I told him. It was awkward, but he was very nice about it.”\u003c/p\u003e\n\u003cp\u003e“He’s the nicest guy in the world, but I worry about him.”\u003c/p\u003e\n\u003cp\u003eThat surprised me, but before I even asked, I knew what she was referring to. “Why?”\u003c/p\u003e\n\u003cp\u003e“I worry about both of the Vega brothers, but I especially worry about Jared. He’s just too open to anything, you know? He doesn’t seem to have a slow down button when it comes to drugs and alcohol. Neither of them do, but Tristan at least sticks mainly to the booze. I don’t think there’s anything Jared hasn’t tried, and at some point, you can’t just call it all experimenting.”\u003c/p\u003e\n\u003cp\u003e“Does Tristan know?”\u003c/p\u003e\n\u003cp\u003eFrankie sighed, looking like a worried mother in spite of her age. “He knows. He’ll be the first to say it’s normal to try things. When you’re smoking joints with your mother before you’re twelve, it’s hard to get perspective about it.”\u003c/p\u003e\n\u003cp\u003eI grimaced. “I went to dinner at her house, and saw some of that. I’m a total prude about drugs, and I know they’re grown-ups now, but that raised some red flags for me.”\u003c/p\u003e\n\u003cp\u003e“Don’t get me wrong, I love that woman to death, but that’s just messed up, and it isn’t even the half of it.”\u003c/p\u003e\n\u003cp\u003e“Dean handed Jared a baggie of something the second he showed up,” I told her, my voice pitched low, since Jared was approaching the pool.\u003c/p\u003e\n\u003cp\u003e“See now, that’s the shit that worries me. Dean will get him anything he wants, with no thought to what’s good for him. And I can guarantee that wasn’t just a baggie of weed.”\u003c/p\u003e\n\u003cp\u003eWe dropped the subject as Jared joined us in the pool, and Frankie went over every piece of ink she’d done on his skin, which was considerable.\u003c/p\u003e\n\u003cp\u003e“Mama’s boy,” I teased him gently when she pointed out a tattoo for his mom that he’d done on his chest.\u003c/p\u003e\n\u003cp\u003eIt was an anchor with the word mother etched into it. I thought it said a lot that he’d chosen an anchor to represent his mom, though to me it said something far different than what he thought it did. Lucy had trained me to look for signs of codependency, and permanently marking your body with the fact that someone was dragging you down was about as obvious as it got.\u003c/p\u003e\n\u003cp\u003e“Absolutely. Until the day I die, I’ll be a mama’s boy. She’s my best friend.”\u003c/p\u003e\n\u003cp\u003eIn spite of my reservations, a little ‘aww’ escaped me at such sweet words coming out of a grown man.\u003c/p\u003e\n\u003cp\u003e“Tristan is a mama’s boy, too, but not as bad as this one,” Frankie told me, as she ran her hands down Jared’s abs, tracing over the scaled dragon she’d done.\u003c/p\u003e\n\u003cp\u003eMy brow furrowed as I studied the intricate dragon. It was golden, and so elaborate that I had to study it carefully to catch all of the details. It was a lot like one she’d done on Tristan’s shoulder, but Jared’s dragon had one extra quirk that made me roll my eyes.\u003c/p\u003e\n\u003cp\u003e“Is that dragon smoking a joint, or a cigarette?” I asked, my tone wry.\u003c/p\u003e\n\u003cp\u003e“Guess,” Jared said playfully.\u003c/p\u003e\n\u003cp\u003e“Well half of it is in the water,” I complained.\u003c/p\u003e\n\u003cp\u003e“Here.” He hopped out of the pool, perching on the edge so I had a better view.\u003c/p\u003e\n\u003cp\u003eI moved close, getting between his legs to study the smoking dragon. “I can’t believe you put a dragon smoking a joint on his stomach,” I said to Frankie, my tone accusing, when I saw for certain what it was. \u003c/p\u003e","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-24.html","bookId":1929,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
