{"id":64583,"no":42,"title":"Page 42","content":"\u003cp\u003eHe nodded, his eyes so understanding that I felt myself tearing up.\u003c/p\u003e\n\u003cp\u003eI blinked those tears away, calling myself a stupid girl.\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-FOUR\u003c/p\u003e\n\u003cp\u003eJared and I ended up at the casino’s sports bar, betting on horse races, and drinking for free.\u003c/p\u003e\n\u003cp\u003eHe was great at cheering me up, telling me funny stories about he and Tristan as kids, and just generally finding ways to cheer me up.\u003c/p\u003e\n\u003cp\u003eI was well on my way to a better mood, when he said something that had me stewing again, but for a different reason.\u003c/p\u003e\n\u003cp\u003e“If you need something stronger than a cocktail, just let me know. I can get you whatever you need within ten minutes.”\u003c/p\u003e\n\u003cp\u003eI didn’t respond for a while, thinking about that.\u003c/p\u003e\n\u003cp\u003e“Jared, you need to knock it off with that stuff. I’m not even sure what you were referring to—”\u003c/p\u003e\n\u003cp\u003e“Anything you—”\u003c/p\u003e\n\u003cp\u003e“No, thank you. Hard liquor is more than enough for me. You need to knock that shit off, Jared.”\u003c/p\u003e\n\u003cp\u003e“We’re only twenty-one, sis. Live a little. We can be responsible and boring when we’re thirty.”\u003c/p\u003e\n\u003cp\u003e“That stuff is bad for you, Jared. All of it. Alcohol is bad enough. You don’t need to be trying every crazy thing that you come across.”\u003c/p\u003e\n\u003cp\u003eHe waved that off. “Don’t worry about it. I like to party, but I know what I’m doing.”\u003c/p\u003e\n\u003cp\u003eI sighed, thinking that it was impossible to talk a twenty-one year old out of being stupid. And I was the same age, so I should know.\u003c/p\u003e\n\u003cp\u003eHe gripped one of my hands in both of his. “Listen. Whatever you think happened that night didn’t change just because of what happened before. And Tristan may not express himself, but I know him better than anyone, and I can tell you that he’s never been like this, not with anyone. He’s fallen for you, and seeing it, I think it’s the first time for him.”\u003c/p\u003e\n\u003cp\u003e“He was engaged to Natalie.” My tone turned resentful just thinking of that other woman.\u003c/p\u003e\n\u003cp\u003e“That was ages ago, and they were kids. Every guy in the world thinks he’s in love with the first woman he has sex with…If anything, what you should take from Tristan and Natalie is that he is capable of being blindly loyal, maybe too much so. He made promises to her, and he kept every one of them. She’s a piece of work for what she did to him, but that’s not on him. If he was capable of being loyal to a woman like that, just imagine what he’d be willing to do for someone like you.”\u003c/p\u003e\n\u003cp\u003eTristan found us there hours later.\u003c/p\u003e\n\u003cp\u003eWe were clutching hands and giggling, drunk off our asses.\u003c/p\u003e\n\u003cp\u003eWe’d both gotten to the saying sweet things to each other’ phase of our drunk.\u003c/p\u003e\n\u003cp\u003e“There’s nothing I want more than to be your real sis, Jared,” I told him, eyes wide. Somehow, in drunk mind, that was meant to emphasize my point. “I’d adopt you if I could. No bullshit.”\u003c/p\u003e\n\u003cp\u003eHe patted my hand, his own eyes getting crazy wide. “I’d adopt you back. No bullshit. But I have an even better idea. Marry Tristan, and it’ll be legal. Wouldn’t that be so awesome?”\u003c/p\u003e\n\u003cp\u003eWe nodded together, slow, big nods. “Totally awesome,” I whispered. “If I could have one wish in the whole world, that would be it. I love you guys. I want you to be my family.”\u003c/p\u003e\n\u003cp\u003eHe gripped my hand hard, his eyes and tone earnest. “I want that too. And we totally love you back. Tristan might not say it, but I know him better than anybody, and he totally does.”\u003c/p\u003e\n\u003cp\u003e“I love you,” I told him, feeling drunk, weepy time coming on.\u003c/p\u003e\n\u003cp\u003e“I love you back.”\u003c/p\u003e\n\u003cp\u003e“Isn’t this sweet?” Frankie asked wryly, from somewhere behind us.\u003c/p\u003e\n\u003cp\u003eI craned my neck and then whipped my head around to see where she was.\u003c/p\u003e\n\u003cp\u003eShe and Tristan stood at our backs. She had her arms folded across her chest, a huge smile on her face.\u003c/p\u003e\n\u003cp\u003eTristan wasn’t smiling, but he also wasn’t looking more than mildly annoyed, which was a good sign, considering I’d just been telling his brother how much I loved him.\u003c/p\u003e\n\u003cp\u003e“How many have you had?” Tristan asked sternly.\u003c/p\u003e\n\u003cp\u003eFor some reason, that made us both giggle hard, clutching our bellies.\u003c/p\u003e\n\u003cp\u003e“Not more than eight,” Jared said.\u003c/p\u003e\n\u003cp\u003e“Less than three,” I said at the same time.\u003c/p\u003e\n\u003cp\u003eWe looked at each other, and dissolved into giggles again.\u003c/p\u003e\n\u003cp\u003e“I’ve got Jared,” Frankie told Tristan.\u003c/p\u003e\n\u003cp\u003eHe nodded. “I’ve got my girl. Talk to you tomorrow.”\u003c/p\u003e\n\u003cp\u003eTristan came around my chair, kneeling down in front of me. He studied me, putting a warm hand on my knee.\u003c/p\u003e\n\u003cp\u003e“Still mad at me?” he asked.\u003c/p\u003e\n\u003cp\u003eI shook my head. “Not mad. Just hurt, but the hurt is numb now, so that’s good.”\u003c/p\u003e\n\u003cp\u003eHe straightened, tugging me to my feet. He pulled me into his side as we began to walk, taking most of my weight.\u003c/p\u003e\n\u003cp\u003e“Hurt?” he questioned, sounding confused.\u003c/p\u003e\n\u003cp\u003eHe’s such a guy, I thought. “Yes. Hurt. That night we were together in the rain. I thought it was special, and it wasn’t, and I feel like I lost something important when a night that was special to me lost all of its special.”\u003c/p\u003e\n\u003cp\u003eHis other arm came around, his hand snagging at the back of my head, then cupping, then caressing. “I’m sorry you feel that way, but you’re wrong. That night was special, and whatever stupid fucked up shit I did before that can’t change how special it was.”\u003c/p\u003e\n\u003cp\u003eThat made me warm all over.\u003c/p\u003e\n\u003cp\u003eI was so starved for any words from him that I’d take scraps and be happy.\u003c/p\u003e\n\u003cp\u003e“Jared was trying to tell me that. He’s the best.”\u003c/p\u003e\n\u003cp\u003e“He’s the best,” Tristan agreed, affection in every word.\u003c/p\u003e\n\u003cp\u003e“We never should have kissed. I didn’t know he was my future brother at the time.”\u003c/p\u003e\n\u003cp\u003eThat had him stopping, his arms around me tightening.\u003c/p\u003e\n\u003cp\u003e“When was this?” he asked, his tone very, very careful.\u003c/p\u003e\n\u003cp\u003e“At the pool party, that night I went out with him.”\u003c/p\u003e\n\u003cp\u003e“Did you…were you…” He didn’t seem to know what to say, but his voice held a thread of something that had me tensing up, even in my drunken stupor.\u003c/p\u003e\n\u003cp\u003e“Was I what?” I asked.\u003c/p\u003e\n\u003cp\u003e“Are you attracted to him?”\u003c/p\u003e\n\u003cp\u003eI patted his arm. “No, no, no. It’s nothing like that. Please don’t get mad at him.”\u003c/p\u003e\n\u003cp\u003eHe rubbed at his chest as though it were sore, his eyes getting a bit distant. “I’m not mad. I just need to know what happened.”\u003c/p\u003e\n\u003cp\u003eI waved my hand in the air in a motion that was supposed to be small, but turned big and sloppy. It reminded me just how drunk I was. Like drunk enough to tell Tristan some shit that he’d never needed to know. “We went out that one time. He kissed me. I let him, for like one minute.\u003c/p\u003e\n\u003cp\u003e“You kissed for a full minute?” He looked queasy, and he kept rubbing hard at that spot on his chest.\u003c/p\u003e\n\u003cp\u003e“I wanted to like kissing him.”\u003c/p\u003e\n\u003cp\u003e“What? What the fuck does that mean?”\u003c/p\u003e\n\u003cp\u003e“It means that it lasted for a full minute because I wanted to like it. He’s a good kisser.”\u003c/p\u003e\n\u003cp\u003eHis head dropped back until he was looking straight up. “I did not need to know that. That’s so messed up. He’s my brother, and you’re my girl.”\u003c/p\u003e\n\u003cp\u003e“Listen. He was a good kisser, but it didn’t matter. I told him right then that we couldn’t date. My feelings were too strong for you, and I let him know that. And that was that.”\u003c/p\u003e\n\u003cp\u003e“Was his tongue in your mouth?” he growled.\u003c/p\u003e\n\u003cp\u003eMy brows shot up at that. He was jealous, which I found to be the most hypocritical thing in the world. “Now that you don’t need to know.”\u003c/p\u003e\n\u003cp\u003e“Did he touch you anywhere?”\u003c/p\u003e\n\u003cp\u003e“Don’t be an ass. I just told you everything, and you have no right to be jealous, let alone mad, Mr. Slutty McSlutFace.”\u003c/p\u003e\n\u003cp\u003eThat surprised a short bark of a laugh out of him, but it died a quick death.\u003c/p\u003e\n\u003cp\u003eHe straightened, still rubbing at his chest. “I’m not mad. Really. Just hurt.” He rubbed harder as he said the word hurt.\u003c/p\u003e\n\u003cp\u003eI put my hand over his, stepping close. It was crazy, but I actually felt bad, even after all of the things he’d done that had been so much worse than my one minute kiss.\u003c/p\u003e\n\u003cp\u003e“Is this what hurts?” I asked softly, caressing the spot he’d been rubbing. It was right over his heart.\u003c/p\u003e\n\u003cp\u003eHe nodded, looking more miserable than I could stand.\u003c/p\u003e\n\u003cp\u003e“It hurts your heart that we kissed?”\u003c/p\u003e\n\u003cp\u003eHe winced, but he nodded, and it was perverse, but I loved that I could affect him. He never gave me words of love, so any hint that I’d touched his heart had an impact on me.\u003c/p\u003e\n\u003cp\u003e“You know it won’t happen again. You can trust both of—”\u003c/p\u003e\n\u003cp\u003eHe cut his hand through the air in a dismissive motion. “Of course. I know I can trust you both. It just hurts. Probably because it reminds me how close I was to losing you, and how much I don’t deserve for you to give me a chance. I should have given in to my feelings for you right from the start. I regret everything I did to push you away, and every time I lied to myself about how I felt.”\u003c/p\u003e\n\u003cp\u003e“Do-over?” I asked him, which drew a small smile out of him. This smile told me that he thought I was cute. I loved reading his smiles, and that I was learning what each one of them meant, day by day. He had the best smiles.\u003c/p\u003e\n\u003cp\u003e“Deal,” he said softly, drawing me to him. “Let’s start fresh, and forget about all the mistakes I’ve made.”\u003c/p\u003e\n\u003cp\u003e“We’ve made,” I chided, letting him pull me close.\u003c/p\u003e\n\u003cp\u003eWe were in the middle of a casino, slot machines clinking in the background, and I didn’t care. I let him kiss me. I’d let him kiss me anywhere.\u003c/p\u003e\n\u003cp\u003eIt wasn’t a light kiss. It wasn’t a romantic kiss. It wasn’t innocent, or casual, or appropriate for public.\u003c/p\u003e\n\u003cp\u003eIt was a down and dirty, suck at my mouth kind of kiss, demanding, hungry, and perfect.\u003c/p\u003e\n\u003cp\u003eBy the time he pulled back, I was clutching at his shirt, and shaky at the knees.\u003c/p\u003e\n\u003cp\u003eHis mouth went to my ear, his voice rough and unsteady. “I need you. Now. I can’t wait even a minute to be inside of you.”\u003c/p\u003e\n\u003cp\u003eThat had my brain go fuzzy as I tried to figure out what he could mean. He didn’t keep me in suspense for long, pulling me into the nearest women’s restroom.\u003c/p\u003e\n\u003cp\u003eIt was huge, with marble floors and counters, and stalls with doors that went floor to ceiling, covered in opaque glass that frosted as you locked the door.\u003c/p\u003e\n\u003cp\u003eThe stalls were so big, in fact, that they could accommodate a beast of a man like Tristan.\u003c/p\u003e\n\u003cp\u003eOne woman gave us a strange look as she walked out, and we walked in, but luckily for us, she was the only one we came across before we were locked away.\u003c/p\u003e\n\u003cp\u003eTristan pushed my back hard into the door of the stall.\u003c/p\u003e\n\u003cp\u003eI licked my lips as he worked himself loose from his jeans, his cock already huge and throbbing for me. He bunched my skirt up at the waist, running a finger over my cleft. He sucked in a breath when he found me wet.\u003c/p\u003e\n\u003cp\u003eHe didn’t even take off my panties, just shoved the thin thong aside, both hands pushing my skirt up, and lifting me. He pushed into me with a hard stroke, and a rough groan.\u003c/p\u003e\n\u003cp\u003e“If anyone comes in, they can see our shadows through this door, so I need to make this quick. I need you.” Each word he said was a rough pant into my ear.\u003c/p\u003e\n\u003cp\u003eI moaned, gripping at his shoulders as he ground into me.\u003c/p\u003e\n\u003cp\u003eHe was in a hurry, but even then, he still saw to my pleasure with a soft touch on my clit, and hard thrusts into my core. \u003c/p\u003e","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-42.html","bookId":1929,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
