{"id":64587,"no":46,"title":"Page 46","content":"\u003cp\u003eShe nodded. “I know. But doesn’t it make him even hotter?”\u003c/p\u003e\n\u003cp\u003eI laughed, because there was no denying it; even to a lesbian, the man was hot. “I’m not sure. It really depends on what you mean by hardcore. I’m not into pain.”\u003c/p\u003e\n\u003cp\u003e“Pain is what I mean. Yes, you can be sure that one is not for you. Though I do hear that he is spectacular in bed.”\u003c/p\u003e\n\u003cp\u003eI let out a dreamy sigh, thinking of Tristan. “So is Tristan. Spectacular.”\u003c/p\u003e\n\u003cp\u003e“Fan-fucking-tastic! Let’s drink to that!” She signaled the bartender for another round of tequila shots.\u003c/p\u003e\n\u003cp\u003e“He’s so big. Like huge. I never imagined I could enjoy a man with a cock that big. It was…intimidating at first. I mean, I’m small, how could he fit?”\u003c/p\u003e\n\u003cp\u003eFrankie was laughing so hard that she had to put both hands on the bar. “Oh my God! I love you so hard when you’re tipsy!”\u003c/p\u003e\n\u003cp\u003e“Do you think he’s, like, stretching me out? I mean, he must be, because we can fuck really hard now, and at first it took him a while just to work himself inside.” I had the very lucid thought that I must be really drunk to be talking like this.\u003c/p\u003e\n\u003cp\u003eShe was still dying with laughter, just shaking her head, again and again.\u003c/p\u003e\n\u003cp\u003e“Is that possible? Could that be where the term loose comes from?”\u003c/p\u003e\n\u003cp\u003e“I don’t think it works that way,” she gasped. “Babies come out of that thing.”\u003c/p\u003e\n\u003cp\u003eI nodded, thinking fuzzily that she had a good point. “And he absolutely loves eating my pussy. Like, he could do it all day, he loves it so much. I didn’t think a man could be like that, so into getting me off.”\u003c/p\u003e\n\u003cp\u003eShe was back to laughing hard and clutching the edge of the bar. “Oh my God. I can’t believe I’m not recording this. You are my favorite drunk ever. Let’s drink to Tristan’s oral fixation, because if anyone can appreciate going down on a girl, it would be me. Maybe he and I are like pussy eating soul mates, because I could eat a snatch all day.”\u003c/p\u003e\n\u003cp\u003eI was giggling so hard that it took me three tries to grab the shot the bartender slid me. “You’re so bad,” I told her, dissolving into another fit of giggles.\u003c/p\u003e\n\u003cp\u003eWe were both blitzed by the time the band finished their set. I cheered loudly as the small crowd went wild, then watched with longing as they left the stage, heading somewhere in back.\u003c/p\u003e\n\u003cp\u003e“I’ve only been fifty feet away from him all night, and I still missed him. Isn’t that nuts?”\u003c/p\u003e\n\u003cp\u003e“Totally. It’s also sweet. You’ve got it bad, huh?”\u003c/p\u003e\n\u003cp\u003e“So bad.”\u003c/p\u003e\n\u003cp\u003e“Well, he’s got it bad, too. Don’t you ever forget it.”\u003c/p\u003e\n\u003cp\u003eI just shook my head, unable to admit out loud that he didn’t, or if he did, he sure wasn’t telling me about it.\u003c/p\u003e\n\u003cp\u003eI felt someone kiss the top of my head, and swiveled around to see that it was Jared, not Tristan, as I’d been expecting. I grinned, nearly as happy to see him. I hopped off my barstool, giving him an exuberant hug.\u003c/p\u003e\n\u003cp\u003e“Good job! You guys were amazing, as always.”\u003c/p\u003e\n\u003cp\u003e“Thanks, sis,” he said, and I could hear the smile in his voice. He pulled back, studying my face. “You’re sloshed, aren’t you?”\u003c/p\u003e\n\u003cp\u003eI nodded. “It’s you and your brother’s fault. I’m trying to train my liver to keep up with your lifestyle. I need to shape up to stay in the picture.”\u003c/p\u003e\n\u003cp\u003eHe stroked an affectionate hand over my hair. “You don’t have to change a thing. You’re perfect just the way you are.”\u003c/p\u003e\n\u003cp\u003eEven drunk, I could see that his eyes were glassy like they got when he was high, but I still thought it was the sweetest thing I’d ever heard.\u003c/p\u003e\n\u003cp\u003eThe other four members of the band approached us just moments after that touching scene.\u003c/p\u003e\n\u003cp\u003eTristan was smiling, not at all bothered by the fact that me and Jared were having another love fest. “You telling my baby bro how much you love him again?” he asked. He wore his fond smile, and just then I thought I might love that one the most.\u003c/p\u003e\n\u003cp\u003e“I was getting to it,” I admitted.\u003c/p\u003e\n\u003cp\u003eTristan shouldered his brother aside playfully, moving until he was standing close, shifting his thighs between my legs. I was wearing shorts, but he parted my legs so wide that I was afraid I may have still been indecently exposing myself.\u003c/p\u003e\n\u003cp\u003eI opened my mouth to tell him that, but he buried his hands in my hair, and I quickly got distracted.\u003c/p\u003e\n\u003cp\u003eHe leaned in close, his eyes smiling into mine. “I thought it was distracting to have you in the crowd, but I realized tonight that seeing you laugh at the bar while I perform is even more distracting.”\u003c/p\u003e\n\u003cp\u003eI pouted. “Sorry.” I pointed at Frankie, who was nursing a drink, and smirking at us. “It was her fault. She was making me laugh. Are you going to ban me from performances altogether now?”\u003c/p\u003e\n\u003cp\u003e“Don’t be silly,” he scolded, shaking his head at me, and using his hands in my hair to shake mine with him. “Of course not. I just realized tonight that I need your full attention on me, or it drives me crazy. I think I’ve thought up another solution.”\u003c/p\u003e\n\u003cp\u003eI arched a brow at him. “Oh yeah?”\u003c/p\u003e\n\u003cp\u003e“Yeah. You need a bodyguard with you in the crowd, so I don’t have to come down and break any nuts while we’re on stage. I’ll find somebody before our next gig.”\u003c/p\u003e\n\u003cp\u003eI giggled, because a bodyguard sounded like a crazy idea to me. I opened my mouth to tell him so, but never got a chance, as he bent down, slanting his lips over mine.\u003c/p\u003e\n\u003cp\u003eHis mouth was hot, and hungry, devouring mine. He always tasted so good. I could never get enough. His tongue slipped into to my mouth, and I moaned, licking and sucking at him.\u003c/p\u003e\n\u003cp\u003eHe pulled back briefly. “You taste like tequila,” he said breathlessly. “Had a few, huh? I think I might be able to get buzzed just tasting you.”\u003c/p\u003e\n\u003cp\u003eThat made me giggle some more, and the giggling only stopped when he was kissing me again.\u003c/p\u003e\n\u003cp\u003eWe necked like teenagers in the middle of a bar for God only knows how long. It was insane, and tacky, and wonderful.\u003c/p\u003e\n\u003cp\u003eHis hands stayed firm on my hips as his mouth drank from mine, with long, hungry pulls. We’d never done this before, just kissed for what could have been hours. Our chemistry had always just been so crazy, our lust a race to the finish line that ended in ecstasy.\u003c/p\u003e\n\u003cp\u003eHe pulled back at one point, panting into the top of my head. I turned, scraping my tongue across his stubble roughened jaw, begging for his mouth again.\u003c/p\u003e\n\u003cp\u003eHe gave it to me, and we kissed like that for the longest time. We ignored all the calls from our friends of ‘get a room’, lost in our own little world of drugging kisses, and in my case, mad crazy love.\u003c/p\u003e\n\u003cp\u003e“You’re so perfect,” I murmured to him as we came up for air. “I can’t believe you’re all mine.”\u003c/p\u003e\n\u003cp\u003eHis laugh was rough and breathless. “I’m as far from perfect as a person can get, but I am all yours.”\u003c/p\u003e\n\u003cp\u003eThat warmed me down to my toes, as did the press of his lips on mine. He eased back from all out necking, and began to give me sweet, short kisses.\u003c/p\u003e\n\u003cp\u003eI tried to press my body to his, but he backed away.\u003c/p\u003e\n\u003cp\u003e“I can kiss you all night, sweetheart, but if we start dry humping in this bar, I’m liable to embarrass myself.”\u003c/p\u003e\n\u003cp\u003e“I want you,” I whispered, as his lips came back to claim mine. “I want you deep inside of me. For hours. I told Frankie how huge you are, how you stretch me you’re so big, but I didn’t tell her how perfect it feels to have you inside of me.”\u003c/p\u003e\n\u003cp\u003eHe pulled back, gasping out a laugh, his eyes finding Frankie. “You got an earful, huh?”\u003c/p\u003e\n\u003cp\u003eFrankie grinned, toasting the air. “Drunk confessions are the best. Tequila is like a truth serum, and she can’t take any of it back.”\u003c/p\u003e\n\u003cp\u003e“We could fuck in the bathroom, like we did in the casino that one time,” I said into his ear, seriously hot for him now, so hot I didn’t know how I could bear to wait until we got home.\u003c/p\u003e\n\u003cp\u003eHe shook his head, smiling. “Not at this place, we can’t. It’s not four a.m. and deserted, like the casino was.\u003c/p\u003e\n\u003cp\u003e“Let’s have sex in your car then,” I suggested, trying to pull him flush against me.\u003c/p\u003e\n\u003cp\u003eHe studied me, biting his lip. I tried to tug his head down to me, because I wanted to bite his lip, too, but he wouldn’t budge. “That’s a hard offer to turn down. It won’t be comfortable, not that I give a damn about that.”\u003c/p\u003e\n\u003cp\u003eI shook my head at him, my eyes wide. “I don’t give a damn either. I need your cock buried in my pussy like ten minutes ago.”\u003c/p\u003e\n\u003cp\u003eThat has his eyebrows shooting into his hairline. “Aren’t you in a mood tonight? Normally I can’t pry the word pussy out of you.”\u003c/p\u003e\n\u003cp\u003e“I do hate that word, but it’s not bugging me so much tonight. Pussy, pussy, pussy.”\u003c/p\u003e\n\u003cp\u003e“I love that word,” Frankie mused, shamelessly listening to our conversation. “I love any word that gets a visceral reaction, every time you use it out loud. Pussy. Cunt. Fuck. Cock. Though it should be noted that the word cock is my least favorite of all of those.”\u003c/p\u003e\n\u003cp\u003eTristan turned his head to look at her, smirking. “How come that doesn’t shock me?”\u003c/p\u003e\n\u003cp\u003eShe snickered. “Here’s all I’m saying, everything about a woman can be pretty, from her feet to her ears, but the same can’t be said for a man.”\u003c/p\u003e\n\u003cp\u003eTristan threw his head back and laughed, his hands rubbing my hips. I loved his throat. The sight of it stretched like that drove me wild. I pushed up so I could lick it, and then suck hard enough to leave a mark.\u003c/p\u003e\n\u003cp\u003e“I can’t argue with you there,” Tristan told Frankie. “I’m right there with you; team pussy all the way.”\u003c/p\u003e\n\u003cp\u003eI smacked his arm. “That sounds way too general for my taste.”\u003c/p\u003e\n\u003cp\u003eHe laughed harder, pulling my face into his chest. “Okay. I’m team Danika’s pussy all the way. That better?”\u003c/p\u003e\n\u003cp\u003eI nodded, appeased at the conclusion to that ridiculous conversation.\u003c/p\u003e\n\u003cp\u003e“Go ahead, go screw in your car,” Frankie told us, her tone wry. “Don’t delay on my account. You’ve been making out in front of me for hours. Why get shy now?”\u003c/p\u003e\n\u003cp\u003e“Good point,” Tristan said, taking her suggestion, and ignoring her sarcasm. “Excuse us. We’ll be back in ten to fifteen minutes.”\u003c/p\u003e\n\u003cp\u003eFrankie’s grin turned rueful. “I wouldn’t go advertising that. It’s not exactly an endorsement.”\u003c/p\u003e\n\u003cp\u003e“I’ve never had any complaints,” was his parting shot as he tugged me out of my chair.\u003c/p\u003e\n\u003cp\u003eI felt giddy as we raced to his car, clutching hands and laughing.\u003c/p\u003e\n\u003cp\u003e“We’re going to get ourselves arrested,” Tristan muttered as he opened the back door of his car for me.\u003c/p\u003e\n\u003cp\u003eI just laughed harder, strangely uncaring of that possibility.\u003c/p\u003e\n\u003cp\u003eHe crowded me into the car, and it was a tight fit, to put it lightly.\u003c/p\u003e\n\u003cp\u003e“Are you wet?” he asked, as he positioned me on my hands and knees, facing away from him. He began to peel my tiny jean shorts off.\u003c/p\u003e\n\u003cp\u003e“I’ve been wet since the moment you touched me.”\u003c/p\u003e\n\u003cp\u003e“Good,” he grunted, folding himself over my back, lining himself up at my entrance. “Tell me if I’m too rough. I need to fuck you hard after all of that making out.”\u003c/p\u003e\n\u003cp\u003eI moaned loudly as he worked himself into me, his breath hot on my neck, coming out in fast pants as he invaded me. \u003c/p\u003e","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-46.html","bookId":1929,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
