{"id":64592,"no":51,"title":"Page 51","content":"\u003cp\u003eThat he is dead, he is just away.\u003c/p\u003e\n\u003cp\u003eWith a cheery smile and a wave of hand\u003c/p\u003e\n\u003cp\u003eHe has wandered into an unknown land;\u003c/p\u003e\n\u003cp\u003eAnd left us dreaming how very fair\u003c/p\u003e\n\u003cp\u003eIts needs must be, since he lingers here.\u003c/p\u003e\n\u003cp\u003eAnd you-oh you, who the wildest yearn\u003c/p\u003e\n\u003cp\u003eFrom the old-time step and the glad return-\u003c/p\u003e\n\u003cp\u003eThink of him faring on, as dear\u003c/p\u003e\n\u003cp\u003eIn the love of there, as the love of here\u003c/p\u003e\n\u003cp\u003eThink of him still the same way, I say;\u003c/p\u003e\n\u003cp\u003eHe is not dead, he is just away.”\u003c/p\u003e\n\u003cp\u003eAs I finished my gaze happened to skim across Dean, who was down the row from Tristan. Seeing that even he was crying like his heart was broken had my eyes finally flooding with tears. I could only be relieved that I’d gotten through it before I broke down.\u003c/p\u003e\n\u003cp\u003eI approached Tristan on the bench, moving to sit beside him, on the other side from his mother, but they surprised me by moving apart, making a space for me between the two of them.\u003c/p\u003e\n\u003cp\u003eI took it without a word.\u003c/p\u003e\n\u003cp\u003eLeticia moved her face into my shoulder, sobbing piteously. I wrapped my arms around her, feeling so powerless in the face of her pain. I simply couldn’t wrap my mind around how horrible this must be for her, when I’d only known Jared for a short time, and the loss of him had still shaken me to my core.\u003c/p\u003e\n\u003cp\u003eTristan’s lips moved to my ear, voice thick with tears. “Thank you for that. That was so beautiful, so perfect. It said everything that I wanted to say, if I could have found the strength. I’ll never forget that for as long as I live; the way you were my strength, when I was too weak to even stand.”\u003c/p\u003e\n\u003cp\u003eHis face moved into my neck, and I found myself in the odd, and heartbreaking position of having an arm around both him and his mother as we all cried our hearts out.\u003c/p\u003e\n\u003cp\u003eIt had been at Leticia’s insistence that it was an open casket ceremony. I hadn’t thought it was a good idea, and I’d been right. It was just too hard to look at him. I didn’t think that anyone could feel better for seeing the body of a twenty-one year old man in his prime, pale and still in death.\u003c/p\u003e\n\u003cp\u003eTristan and I went to see him together. He was clutching my hand so hard that it ached, but I didn’t say a word.\u003c/p\u003e\n\u003cp\u003eI held my breath as I looked at Jared’s still form, the air only escaping my lungs when I couldn’t hold it for another moment.\u003c/p\u003e\n\u003cp\u003eI didn’t know what to say. There were no words for this. His stillness, the peace on his face, it brought both comfort and despair.\u003c/p\u003e\n\u003cp\u003eStill, I tried my hardest to bring Tristan some bit of comfort with my own perspective. “I don’t have a bad memory of him. I don’t have a thing to say about him that isn’t filled with affection. I know logically that no one on this earth is perfect, but to me, he was. There is bad in all of us, but I’ll only ever remember the good in Jared.”\u003c/p\u003e\n\u003cp\u003eTristan hugged me to him, burying his face in my hair. “Thank you for that. It helps, to know someone else saw him how I did, that there are more of us to remember him like that.”\u003c/p\u003e\n\u003cp\u003e“Always,” I whispered in his ear. “I will always be here to remember him like that with you.”\u003c/p\u003e\n\u003cp\u003eThe day of the funeral seemed to last forever, well-wishers offering endless condolences to mother and son. It was so obvious to me that all of it was nothing but a strain on them both that it was hard to stomach.\u003c/p\u003e\n\u003cp\u003eI barely left Tristan’s side, because that was where he needed me to be. He seemed to draw strength from me, and I was desperate to be what he needed, in the face of his pain.\u003c/p\u003e\n\u003cp\u003eHis mother held a reception at her home after the ceremony. Friends and family brought food, and drinks, and no one seemed to want to leave, so it went on into the late hours of the night.\u003c/p\u003e\n\u003cp\u003eTristan drank too much, stayed eerily quiet, and kept me close. It wasn’t hard to talk him in to retiring early.\u003c/p\u003e\n\u003cp\u003eWe shared his childhood room that night, clutching each other close on the twin sized bed. There were other places to sleep, more comfortable places, but I didn’t even consider it. This was where he wanted to be, and I would be there with him.\u003c/p\u003e\n\u003cp\u003e“I love you,” I murmured into his ear before he drifted off.\u003c/p\u003e\n\u003cp\u003e“I love you. So much. You’re my rock, Danika,” he said quietly.\u003c/p\u003e\n\u003cp\u003eFinally, for the first time in days, he drifted off into a deep sleep. I gazed at him with tender eyes the entire time.\u003c/p\u003e\n\u003cp\u003eWatching him sleep, feeling his heart beat under my palm, I could admit it to myself. I would love this man to the end of my days. I’d fallen too deep. Middle of the Pacific deep, with no land in sight. There was no going back. My heart was his forever. \u003c/p\u003e","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-51.html","bookId":1929,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
