{"id":64548,"no":7,"title":"Page 7","content":"\u003cp\u003eI was relieved when he shook his head. His smile was innocent enough, but I thought there was a hint of something else in his eyes.\u003c/p\u003e\n\u003cp\u003e“Just dancing, sweetheart.”\u003c/p\u003e\n\u003cp\u003eI dropped low, really low, and shook my way back up, my hands just brushing his thighs as I rose.\u003c/p\u003e\n\u003cp\u003e“You making a move on me?” he called out with a laugh.\u003c/p\u003e\n\u003cp\u003eI shook my head at him, giving him a wide-eyed, innocent look. “Just dancing, sweetheart.”\u003c/p\u003e\n\u003cp\u003eIt was on after that. He’d caress my hip. I’d counter that by a turn and an extra little arch of my back, just brushing up against him. He’d curse loudly, but we kept dancing.\u003c/p\u003e\n\u003cp\u003eI was actually giggling when he finally pulled me back into the lounge. I couldn’t remember the last time I’d giggled.\u003c/p\u003e\n\u003cp\u003e“I’m conceding, but only because I think you’d go until we both passed out, just to prove a point,” Tristan told me as we walked.\u003c/p\u003e\n\u003cp\u003e“All I heard just now was ‘blah, blah, blah Danika wins’.”\u003c/p\u003e\n\u003cp\u003eHe stopped, shaking his head and laughing. “I like you,” he told me.\u003c/p\u003e\n\u003cp\u003eI wrinkled my nose at him. “I like you, too, platonic friend of mine.”\u003c/p\u003e\n\u003cp\u003eWe were both grinning like fools as we rejoined the group.\u003c/p\u003e\n\u003cp\u003eCory served us another round. Kenny and Jared immediately started making cracks when they saw that Tristan was drinking a margarita.\u003c/p\u003e\n\u003cp\u003e“He drinks those to feel pretty,” Cory made sure to add. “True story.”\u003c/p\u003e\n\u003cp\u003e“Real men don’t drink margaritas,” Jared told me, waving his bottle of beer.\u003c/p\u003e\n\u003cp\u003eI pointed at the bottle. “That will give you a beer gut.”\u003c/p\u003e\n\u003cp\u003eJared grinned, lifting up his shirt to show me some very nice abs. “Hasn’t been a problem so far.”\u003c/p\u003e\n\u003cp\u003eI was a little too tipsy not to give him a very big smile for the very nice show.\u003c/p\u003e\n\u003cp\u003eTristan slapped a hand onto his brother’s shoulder, leaning in to say something in his ear. Whatever it was wiped the smile from Jared’s face. He let his shirt drop.\u003c/p\u003e\n\u003cp\u003e“Give us a minute,” Tristan said, moving a few feet away.\u003c/p\u003e\n\u003cp\u003eThey had a short, hushed conversation before returning to us. Tristan’s face was very blank, but Jared’s looked slightly flushed, perhaps with temper.\u003c/p\u003e\n\u003cp\u003e“So are you in this band that Tristan claims to be in?” I asked Kenny.\u003c/p\u003e\n\u003cp\u003eKenny beamed at me. “Yes, I am. All four of us are, plus one of our buddies who isn’t here tonight.”\u003c/p\u003e\n\u003cp\u003e“What kind of music do you play?” I asked.\u003c/p\u003e\n\u003cp\u003e“Rock.”\u003c/p\u003e\n\u003cp\u003eI wasn’t surprised in the least. “So who plays what?”\u003c/p\u003e\n\u003cp\u003e“I’m bass, Jared is lead guitar, Cory is drums, Tristan is lead vocals, and our friend Dean is rhythm guitar.”\u003c/p\u003e\n\u003cp\u003eI shot Tristan a look. “Gee, the lead singer of a rock band. I’m shocked. I never would have guessed.” Sarcasm dripped from every word.\u003c/p\u003e\n\u003cp\u003eHe seemed to find that funny, which was good. I’d much rather have him think I was funny, than be offended by my sense of humor.\u003c/p\u003e\n\u003cp\u003e“So when and where do I get to see you play?” I asked, turning back to Kenny.\u003c/p\u003e\n\u003cp\u003eKenny’s brow furrowed. “I’m not sure. Dean is setting up some gigs for us. Of course you’re invited, whenever that happens.”\u003c/p\u003e\n\u003cp\u003e“So what are your day jobs?” I asked, figuring they all had to have one.\u003c/p\u003e\n\u003cp\u003e“As you’ve seen, Cory is a bartender, and I’m a valet parker on the weekends here. Our friend Dean is a blackjack dealer. And Tristan and Jared are both in the club promoting business.”\u003c/p\u003e\n\u003cp\u003e“They get paid to party,” Cory added.\u003c/p\u003e\n\u003cp\u003eI couldn’t seem to keep my two cents in. “All I think when I hear club promoter is drug dealer, or unemployed.”\u003c/p\u003e\n\u003cp\u003eJared grimaced.\u003c/p\u003e\n\u003cp\u003eTristan just laughed. “You’re coming to the next club party I host,” he said, pointing at me.\u003c/p\u003e\n\u003cp\u003eI shrugged, giving him a sassy look. “Don’t threaten me with a good time…”\u003c/p\u003e\n\u003cp\u003eAll four of them seemed to find that hilarious. I flushed with pleasure. I could get used to this kind of attention, especially since it was coming from four hot guys.\u003c/p\u003e\n\u003cp\u003e“Danika works for Jerry,” Tristan told them.\u003c/p\u003e\n\u003cp\u003e“We love Jerry!” Kenny said.\u003c/p\u003e\n\u003cp\u003e“She’s the nanny,” Tristan added.\u003c/p\u003e\n\u003cp\u003e“Holy shit,” Jared muttered.\u003c/p\u003e\n\u003cp\u003e“Did not see that coming,” Cory called out, his back to us as he mixed a drink.\u003c/p\u003e\n\u003cp\u003e“Not what I was expecting,” Kenny mused.\u003c/p\u003e\n\u003cp\u003e“Why is that so surprising to everyone?” I asked, baffled that all four of them had had the same reaction to my being a nanny.\u003c/p\u003e\n\u003cp\u003e“I had you pegged for a model,” Jared said.\u003c/p\u003e\n\u003cp\u003e“Tristan loves to date models,” Cory called out.\u003c/p\u003e\n\u003cp\u003e“Fuck off,” Tristan told him.\u003c/p\u003e\n\u003cp\u003e“We’re not dating,” I stated firmly.\u003c/p\u003e\n\u003cp\u003e“I would have guessed dancer,” Tristan told me, as though he hadn’t just told Cory to fuck off. Typical guys…\u003c/p\u003e\n\u003cp\u003eI pointed at Tristan. “This round goes to Tristan. I’m a full-time student, and a nanny, but I am an aspiring dancer, not that I ever have the time.” I returned his smile, utterly charmed by it. “And the model thing is very flattering, guys, but I’m a little short for that.”\u003c/p\u003e\n\u003cp\u003e“Not for Vegas modeling,” Jared pointed out.\u003c/p\u003e\n\u003cp\u003e“You’re what, five-eight?” Kenny guessed. “That’s tall enough.”\u003c/p\u003e\n\u003cp\u003e“I’d guess she’s five-seven,” Tristan mused, “and she is tall enough, but I’m betting she’s never even tried modeling, especially of the Vegas variety. Not your scene, right?”\u003c/p\u003e\n\u003cp\u003eI curled my lip at him. “You don’t know me that well. Quit pretending you’re an expert.”\u003c/p\u003e\n\u003cp\u003e“Am I wrong?” His brows shot up with the question.\u003c/p\u003e\n\u003cp\u003e“You’re not,” I grudgingly admitted.\u003c/p\u003e\n\u003cp\u003eI blamed the alcohol when he gave me a smug smile, and my reaction was to stick my tongue out at him.\u003c/p\u003e\n\u003cp\u003eHe grabbed my hand, pulling me back out of my chair. “Just for that, we’re going for another round on the floor.”\u003c/p\u003e\n\u003cp\u003e“You’re a glutton for punishment,” I told him, but I followed easily enough.\u003c/p\u003e\n\u003cp\u003eThe music had changed to Top Forty remixes, and something slow and sultry with a heavy beat had overtaken the room.\u003c/p\u003e\n\u003cp\u003eUh oh, I thought.\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed on his as he pulled me flush against him, sliding one sneaky knee between mine. “What are you doing?” I asked pointedly.\u003c/p\u003e\n\u003cp\u003e“Just feeling the music. What happens on the dance floor, stays on the dance floor, and I really am just dancing with you, I swear.”\u003c/p\u003e\n\u003cp\u003eI can live with that, I thought, moving against him, letting the music take me over for another intoxicating spell.\u003c/p\u003e\n\u003cp\u003eWe danced close, but he still didn’t cross any lines. We kept our lower regions very carefully apart, though our chests rubbed together more than once. I didn’t know what it said about me, or my previous relationships, but I didn’t think I’d ever been more turned on in my life as I was just from dancing with Tristan. My breath came out in little pants, every inch of my skin overheated, and not just from exertion.\u003c/p\u003e\n\u003cp\u003e“You’re absolutely positive that you don’t hookup? Not even one really awesome night together before we settle down to being friends?” His voice was a rasp in my ear that made me shiver from head to toe.\u003c/p\u003e\n\u003cp\u003eI shook my head with no hesitation. It wasn’t that I wasn’t tempted; I just knew that I would feel like shit in the morning, if I did something like that. I wasn’t someone who could handle sex without commitment. I never had been.\u003c/p\u003e\n\u003cp\u003e“I’m positive,” I said into his ear.\u003c/p\u003e\n\u003cp\u003e“No friends with benefits, either?” he asked hopefully.\u003c/p\u003e\n\u003cp\u003e“The friends with benefits thing never works.”\u003c/p\u003e\n\u003cp\u003eHe pulled back to meet my eyes. “I agree,” he said, though he didn’t look happy about it. “That never works. Someone always ends up getting hurt. Sorry, I just lost my mind for second. That was an asshole thing to say.”\u003c/p\u003e\n\u003cp\u003e“It’s okay. Just don’t let it happen again.” I smiled while I said it, and there was no anger behind the words.\u003c/p\u003e\n\u003cp\u003eI just wasn’t sure how many times I could tell him no and mean it. I wanted him, and I wasn’t dense enough to deny it to myself.\u003c/p\u003e\n\u003cp\u003e“I’ll try my best,” he murmured.\u003c/p\u003e\n\u003cp\u003eCHAPTER SIX\u003c/p\u003e\n\u003cp\u003eI knew before I’d even opened my eyes that I had a raging hangover. You couldn’t go from hardly ever drinking, to losing count of your drinks in one night, and not feel it, and Lord did I feel it.\u003c/p\u003e\n\u003cp\u003eI checked the clock and groaned out loud when I saw that it was seven a.m. That’s how I knew that my hangover was truly heinous; it had woken me up after only three hours of sleep.\u003c/p\u003e\n\u003cp\u003eI sat up reaching for the glass of water I kept on my nightstand. I drank the entire glass, even though drinking was the last thing I wanted to do, because I knew that getting rehydrated was the best way to recover from the hangover.\u003c/p\u003e\n\u003cp\u003eDot, who’d been sleeping in his own doggy bed near the foot of mine, moved to my feet. He put his head on his paws, and looked up at me. I couldn’t decide if he was giving me a sympathetic look or a condescending one.\u003c/p\u003e\n\u003cp\u003eMy door opened, and Mat peeked his head inside, grinning. “Good morning, boo,” he said, using the nickname he’d given me when he was four.\u003c/p\u003e\n\u003cp\u003e“Morning, peeka,” I told him, using my own nickname for him.\u003c/p\u003e\n\u003cp\u003eMat was always the first one awake, but everyone else quickly followed, usually due to the noise he managed to make. “Everybody else is still sleeping,” he said in a whisper that managed to be louder than outright speaking.\u003c/p\u003e\n\u003cp\u003e“I figured,” I said with a rueful smile. He always woke me up first, since I cooked breakfast. “Whatcha want for breakfast?”\u003c/p\u003e\n\u003cp\u003e“Blueberry pancakes, please!” he nearly shouted.\u003c/p\u003e\n\u003cp\u003eI winced and held up a hand. “Coming right up, but I’m going to need you to stay nice and quiet this morning, okay?”\u003c/p\u003e\n\u003cp\u003e“Got it!” he said in a slightly quieter voice. “Will you turn on cartoons while I wait for my food?”\u003c/p\u003e\n\u003cp\u003e“Of course, bud. I just need to go to the bathroom, then I’ll be right out.”\u003c/p\u003e\n\u003cp\u003eI used the restroom and made my way to the living room, Dot dogging my steps.\u003c/p\u003e\n\u003cp\u003eMat was sitting on his kid-sized couch on the floor, Pupcake in his lap. He was staring in confusion across the room, and as I stepped into the room, I saw why.\u003c/p\u003e\n\u003cp\u003eI padded quietly across the room, switching on the TV and finding a channel with some cartoons. Mat fixated on the television, and I walked quietly over to the shirtless hunk of a man that was sprawled out on the sofa. I was so fuzzy headed that I’d forgotten he was even crashing here.\u003c/p\u003e\n\u003cp\u003eHe was lying on his back, a pillow pulled over his face, and another one draped over his lap. He’d completely kicked off his thin blanket. I could just make out that he was at least wearing boxer-briefs, which was good, but the rest of him was all tanned, bared, tattooed skin.\u003c/p\u003e\n\u003cp\u003eNot good, I thought, taking him in. I’d had no doubts that he would look good naked, and I certainly didn’t need to see just how good.\u003c/p\u003e\n\u003cp\u003eEven at rest, I could see the hard ridges in his abdomen. And his arms. Jesus. His arms were huge, which was kind of a thing for me. I thought they might have been bigger than my waist, and for sheer perverse reasons, I wanted to measure them to see if I was right. And the tattoos…God, the tattoos. I didn’t have a bit of ink, but I loved his. He didn’t have full sleeves, like his brother, but he wasn’t too far off. His arms were covered with intricate designs, and it wasn’t all black, either. I loved all the color. It stood out startlingly against the other black ink, as though the black was just there to frame the color. \u003c/p\u003e","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-7.html","bookId":1929,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
