{"id":64550,"no":9,"title":"Page 9","content":"\u003cp\u003eI wore a dark, collared shirt and jeans for our night out. Few clubs were as strict with their dress code as the Cavendish resort, and Cory wasn’t working, so we couldn’t afford to go to Decadence.\u003c/p\u003e\n\u003cp\u003eDanika came out in tiny black satin shorts, and a crimson blouse that hugged her breasts in a way that made my mouth water. She was wearing the same fuck-me heels she’d had on the night before, and it was official—she had killer legs.\u003c/p\u003e\n\u003cp\u003e“Fucking A,” I said, not bothering to watch my language, since the boys were already in bed.\u003c/p\u003e\n\u003cp\u003e“You’re not so bad yourself,” she said, tossing her hair as she gave me a sassy grin. “Is Kenny our chauffeur again?”\u003c/p\u003e\n\u003cp\u003eI nodded. “Let’s wait outside for him. If he had to ring the bell, that might wake the boys, and then there might be hell to pay.”\u003c/p\u003e\n\u003cp\u003eIt was a bit of a challenge to get out of the front door without the dogs getting loose, but Danika managed it like a pro.\u003c/p\u003e\n\u003cp\u003e“So you don’t have a house, or a car?” she asked, as we made our way to the curb to wait for Kenny.\u003c/p\u003e\n\u003cp\u003eI smirked. She didn’t pull punches, that was for sure. “I have a car. I loaned it to a buddy, who needed to drive to L.A. for a few days.”\u003c/p\u003e\n\u003cp\u003e“That was nice of you,” she said.\u003c/p\u003e\n\u003cp\u003eI shrugged. “It’s not a big deal, especially since I have friends like Kenny, who will drive me around.”\u003c/p\u003e\n\u003cp\u003e“Kenny is a sweetheart,” she said, sounding like she meant it.\u003c/p\u003e\n\u003cp\u003eI felt my jaw clenching, though I knew it was unreasonable to be jealous.\u003c/p\u003e\n\u003cp\u003e“He’s a guy in a band. Don’t trust any of us,” I warned, my voice harsher than I’d intended.\u003c/p\u003e\n\u003cp\u003eShe shrugged. “You all seem safe enough to me, as long as I’m not stupid enough to date any of you.”\u003c/p\u003e\n\u003cp\u003eI felt a wave of relief at her dismissive tone. “Exactly.”\u003c/p\u003e\n\u003cp\u003eWe ended up going to a club that ironically enough was called Tryst. I shot Danika a warning look when Kenny told us where we were headed. The look said ‘say a word, and I won’t cook you breakfast again’.\u003c/p\u003e\n\u003cp\u003eShe seemed to get the point, but her grin was infuriating.\u003c/p\u003e\n\u003cp\u003e“You getting us free drinks at this place?” she asked.\u003c/p\u003e\n\u003cp\u003e“Yes,” Kenny answered. “Our buddy Doug is working one of the bars tonight.”\u003c/p\u003e\n\u003cp\u003e“Do you have connections at every club in town?” she questioned.\u003c/p\u003e\n\u003cp\u003e“Just about,” Kenny conceded. “When you’re trying to promote a local band, you tend to get to know a lot of the people working the clubs.”\u003c/p\u003e\n\u003cp\u003e“I’m sure it doesn’t hurt that you guys seem to go out every night, too,” she shot back.\u003c/p\u003e\n\u003cp\u003eTryst was packed. Still, the bouncer at the door recognized us on sight, and let us in with one small nod. Getting in was always half the battle.\u003c/p\u003e\n\u003cp\u003eWe found Doug at one of the main bars in the club. He nodded when he saw me, waving me over. His bar was so packed that I had to shoulder my way in.\u003c/p\u003e\n\u003cp\u003e“Got you guys a table,” he said into my ear, voice pitched low. “And bottle service. It’s your lucky night.”\u003c/p\u003e\n\u003cp\u003eI grinned. “Thanks, man.”\u003c/p\u003e\n\u003cp\u003e“Sure thing. It’s not like you’ve never hooked me up. Who’s that fucking hottie you walked in with?”\u003c/p\u003e\n\u003cp\u003eMy grin wilted a little. “My friend, Danika. She’s off-limits.”\u003c/p\u003e\n\u003cp\u003eHe sighed. “All the ones that look like that usually are.”\u003c/p\u003e\n\u003cp\u003eA VIP hostess showed us to our seats, courtesy of Doug. She was cute, and shot me some very inviting looks.\u003c/p\u003e\n\u003cp\u003eI smiled, not really considering it. I’d invited Danika out to dance, and by God, we were going to dance, even if I was jonesing for a hook-up.\u003c/p\u003e\n\u003cp\u003eDanika gave me a mischievous smile as we slid onto the cushioned VIP bench.\u003c/p\u003e\n\u003cp\u003e“So where did you learn to cook like that?” she asked. “Those were the best enchiladas I’ve ever had, and enchiladas are one of my favorites.”\u003c/p\u003e\n\u003cp\u003eI smiled, thinking of my mother. “My mother taught me to cook. You should try her enchiladas. They put mine to shame, especially since I was missing some of the ingredients for pico on top.”\u003c/p\u003e\n\u003cp\u003e“Does she live here in Vegas?”\u003c/p\u003e\n\u003cp\u003e“Yes. In fact, I’m due for a family dinner soon, and I’m going to make you come with me.”\u003c/p\u003e\n\u003cp\u003eHer eyes widened. “You want me to meet your parents?”\u003c/p\u003e\n\u003cp\u003eMy face stiffened a little, but I didn’t let it show. It couldn’t be a sore subject if I didn’t allow it to be.\u003c/p\u003e\n\u003cp\u003e“I want you to meet my mother. I’ve never met my father. He left the second my mother told him she was pregnant. Never bothered to look him up.”\u003c/p\u003e\n\u003cp\u003eShe nodded, her eyes searching my face. She swallowed. “We’re in the same boat, my friend. I’ve not a clue who my father is. My mother would never tell me a thing about him.”\u003c/p\u003e\n\u003cp\u003eI blinked, a little taken aback. It was selfish, but I felt comforted by the thought that she and I had both experienced something so painful. It made me feel less alone, and so connected to her in ways I couldn’t remember being connected to anyone besides family since I could remember.\u003c/p\u003e\n\u003cp\u003e“No wonder we get along so well,” I finally responded. “We have more in common than we’d realized. Is your mother in Vegas, too?”\u003c/p\u003e\n\u003cp\u003eShe shrugged, one side of her mouth jerking down. “I’m not exactly sure. She and I never really got along. We don’t keep in touch.”\u003c/p\u003e\n\u003cp\u003eI’d learned my lesson when I’d asked her about her sister, so I didn’t ask her why on earth she didn’t know where her mother was, though I was curious as hell about it.\u003c/p\u003e\n\u003cp\u003e“So what’s a good day for you to come meet my mother?”\u003c/p\u003e\n\u003cp\u003eShe smiled, the clouds in her silver eyes clearing. “So you’re not asking, but telling me, that I’m going to meet your mother?”\u003c/p\u003e\n\u003cp\u003eI gave her a rueful smile. “I’m letting you pick the day, at least. You have nothing to worry about. You two are going to love each other.”\u003c/p\u003e\n\u003cp\u003e“If she’s anything like you and Jared, I can’t imagine we won’t get along.”\u003c/p\u003e\n\u003cp\u003eThat brought my mind to my baby brother. It didn’t matter that he was an adult, he’d always be my baby brother. I’d have done anything for him, anything at all, but I knew that he was a little upset that I’d told him that he couldn’t ask Danika out. We had very strict brother rules about dating the same woman, but since I wasn’t dating her, he thought it was unfair that I’d warned him off. Still, whether he understood it or not, I thought he’d respect my wishes.\u003c/p\u003e\n\u003cp\u003eThe waitress brought out our bottle service, and I saw Danika’s eyes widen. I made a note to myself that I owed Doug big time.\u003c/p\u003e\n\u003cp\u003e“I’m impressed. Grey Goose bottle service. You’ve got some pretty good connections, for a homeless guy.”\u003c/p\u003e\n\u003cp\u003eI laughed, already mixing dirty martinis for us.\u003c/p\u003e\n\u003cp\u003e“Just how dirty do you want this?” I asked, wiggling my eyebrows suggestively.\u003c/p\u003e\n\u003cp\u003eThat surprised a giggle out of her, and I thought that was my favorite sound. It was just so uncharacteristic for her, and I loved to be the cause of it.\u003c/p\u003e\n\u003cp\u003e“I’ll take it as dirty as you can dish it out.”\u003c/p\u003e\n\u003cp\u003eI felt myself growing hard. She’d gotten the better of me, yet again.\u003c/p\u003e\n\u003cp\u003eWe had two drinks before hitting the floor.\u003c/p\u003e\n\u003cp\u003eI was a good dancer, but I had absolutely nothing on Danika. The girl could move. And her dancing wasn’t just about the sexy. I thought that every move she made was filled with talent and beauty. It was a Top Forty dance mix tonight, and she knew the words to every song, frequently matching her moves to the words in cute little ways, flipping her hair, or holstering air guns at her sexy as hell hips.\u003c/p\u003e\n\u003cp\u003eI bummed a cigarette off Kenny when I saw him where he was chatting up some guy in the corner.\u003c/p\u003e\n\u003cp\u003e“Do you mind if I smoke?” I asked Danika as I returned to our table.\u003c/p\u003e\n\u003cp\u003eShe was looking at her phone, but she glanced up briefly to shake her head. She didn’t look happy.\u003c/p\u003e\n\u003cp\u003e“It’s not a habit,” I reassured her as I lit up. “I only smoke when I drink.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “Well, from what I can see, you drink every night. How is that not a habit?”\u003c/p\u003e\n\u003cp\u003eI smiled ruefully. She did have a point.\u003c/p\u003e\n\u003cp\u003e“Who are you texting?” I asked, trying to get a look at the screen on her phone.\u003c/p\u003e\n\u003cp\u003eHer lip curled in distaste. “No one important. My ex won’t leave me alone, but I’ve learned not to text him back, even if it’s just to tell him to go to hell.”\u003c/p\u003e\n\u003cp\u003eI felt a totally unreasonable surge of anger move through me at that. “Want me to kick his ass?” I asked, not even close to joking.\u003c/p\u003e\n\u003cp\u003eShe laughed, shaking her head as she put her phone back into her tiny clutch. “No. He’ll give up eventually.”\u003c/p\u003e\n\u003cp\u003e“What did his text say?”\u003c/p\u003e\n\u003cp\u003eShe rolled her eyes. “He says he loves me. But he sure didn’t love me enough not to cheat on me.”\u003c/p\u003e\n\u003cp\u003eMy gut clenched and my fists curled. “How long ago was that?”\u003c/p\u003e\n\u003cp\u003eShe made a dismissive motion with her hands. “Almost a month now.”\u003c/p\u003e\n\u003cp\u003eMy eyes widened. “You haven’t even been broken up for a month?” I couldn’t have said exactly why, but that bothered me. A lot.\u003c/p\u003e\n\u003cp\u003e“We’re ancient history, as far as I’m concerned. One strike and you’re out. I don’t know if it was the first time he cheated on me, but it was the first time I caught him, and once was enough for me. I wouldn’t take him back if he were the last man on earth. I’m ‘if he caught fire, and I had a glass of water, I’d drink it slowly and watch’ done.”\u003c/p\u003e\n\u003cp\u003eEven out of sorts, I had to stifle a laugh at that visual.\u003c/p\u003e\n\u003cp\u003eI heard the faint noise of her phone dinging at her even in her purse, and I wanted to punch somebody.\u003c/p\u003e\n\u003cp\u003eShe got it out again, checked the screen, then put it back.\u003c/p\u003e\n\u003cp\u003e“You let me know if he keeps it up, and I will make sure he stops.”\u003c/p\u003e\n\u003cp\u003eShe sent me a sideways smile that made me want to kiss her. “You’re sweet, you know that?”\u003c/p\u003e\n\u003cp\u003eI shook my head. I’d never thought of myself that way. Not even a little.\u003c/p\u003e\n\u003cp\u003e“What do you say we hit the floor again, boo?” I asked her, after we’d both had two more dirty martinis.\u003c/p\u003e\n\u003cp\u003eHer perfect little nose wrinkled at me. “Don’t call me that. That is such a weird nickname for a grown ass man to be calling me.”\u003c/p\u003e\n\u003cp\u003e“So what should I call you?”\u003c/p\u003e\n\u003cp\u003e“Danika.”\u003c/p\u003e\n\u003cp\u003e“That sounds so formal. I can’t call you by your name all of the time.”\u003c/p\u003e\n\u003cp\u003e“Then call me something sweet. Like sweetheart, or hell, I don’t know, pudding.”\u003c/p\u003e\n\u003cp\u003e“Pudding?” I laughed.\u003c/p\u003e\n\u003cp\u003eShe nodded. “It’s sweet, and I like the way you say it. You can’t call someone pudding and not sound sweet on me.\u003c/p\u003e\n\u003cp\u003e“You’re just messing with me, aren’t you?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No. I sincerely want you to call me pudding. I think it’s adorable.”\u003c/p\u003e\n\u003cp\u003e“You’re drunk,” I noted.\u003c/p\u003e\n\u003cp\u003eShe shrugged. “So? I’d still like to hear you call me pudding.”\u003c/p\u003e\n\u003cp\u003e“You won’t say so in the morning.”\u003c/p\u003e\n\u003cp\u003e“Then I give you my drunk permission to ignore whatever the sober me tells you. You should like the drunk me better, anyway, because I like you more than the sober me does.”\u003c/p\u003e\n\u003cp\u003eI couldn’t really argue with that. “Okay, pudding, let’s dance.” \u003c/p\u003e","sourceLink":"https://allnovel.net/bad-things-tristan-danika-1/page-9.html","bookId":1929,"creation":"Oct 5, 2019 9:54:56 AM","modification":"Oct 5, 2019 9:54:56 AM"}
