{"id":18695,"no":1,"title":"Chapter 1","content":"\u0026nbsp;Why Mrs. General Talboys first made up her mind to pass the winter of 1859 at Rome I never clearly understood. \u0026nbsp;To myself she explained her purposes, soon after her arrival at the Eternal City, by declaring, in her own enthusiastic manner, that she was inspired by a burning desire to drink fresh at the still living fountains of classical poetry and sentiment. \u0026nbsp;But I always thought that there was something more than this in it. \u0026nbsp;Classical poetry and sentiment were doubtless very dear to her; but so also, I imagine, were the substantial comforts of Hardover Lodge, the General’s house in Berkshire; and I do not think that she would have emigrated for the winter had there not been some slight domestic misunderstanding. \u0026nbsp;Let this, however, be fully made clear,—that such misunderstanding, if it existed, must have been simply an affair of temper. \u0026nbsp;No impropriety of conduct has, I am very sure, ever been imputed to the lady. \u0026nbsp;The General, as all the world knows, is hot; and Mrs. Talboys, when the sweet rivers of her enthusiasm are unfed by congenial waters, can, I believe, make herself disagreeable. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But be this as it may, in November, 1859, Mrs. Talboys came among us English at Rome, and soon succeeded in obtaining for herself a comfortable footing in our society. \u0026nbsp;We all thought her more remarkable for her mental attributes than for physical perfection; but, nevertheless, she was, in her own way, a sightly woman. \u0026nbsp;She had no special brilliance, either of eye or complexion, such as would produce sudden flames in susceptible hearts; nor did she seem to demand instant homage by the form and step of a goddess; but we found her to be a good-looking woman of some thirty or thirty-three years of age, with soft, peach-like cheeks,—rather too like those of a cherub, with sparkling eyes which were hardly large enough, with good teeth, a white forehead, a dimpled chin and a full bust. \u0026nbsp;Such, outwardly, was Mrs. General Talboys. \u0026nbsp;The description of the inward woman is the purport to which these few pages will be devoted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There are two qualities to which the best of mankind are much subject, which are nearly related to each other, and as to which the world has not yet decided whether they are to be classed among the good or evil attributes of our nature. \u0026nbsp;Men and women are under the influence of them both, but men oftenest undergo the former, and women the latter. \u0026nbsp;They are ambition and enthusiasm. \u0026nbsp;Now Mrs. Talboys was an enthusiastic woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As to ambition, generally as the world agrees with Mark Antony in stigmatising it as a grievous fault, I am myself clear that it is a virtue; but with ambition at present we have no concern. \u0026nbsp;Enthusiasm also, as I think, leans to virtue’s side; or, at least, if it be a fault, of all faults it is the prettiest. \u0026nbsp;But then, to partake at all of virtue, or even to be in any degree pretty, the enthusiasm must be true.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bad coin is known from good by the ring of it; and so is bad enthusiasm. \u0026nbsp;Let the coiner be ever so clever at his art, in the coining of enthusiasm the sound of true gold can never be imparted to the false metal. \u0026nbsp;And I doubt whether the cleverest she in the world can make false enthusiasm palatable to the taste of man. \u0026nbsp;To the taste of any woman the enthusiasm of another woman is never very palatable.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We understood at Home that Mrs. Talboys had a considerable family,—four or five children, we were told; but she brought with her only one daughter, a little girl about twelve years of age. \u0026nbsp;She had torn herself asunder, as she told me, from the younger nurslings of her heart, and had left them to the care of a devoted female attendant, whose love was all but maternal. \u0026nbsp;And then she said a word or two about the General, in terms which made me almost think that this quasi-maternal love extended itself beyond the children. \u0026nbsp;The idea, however, was a mistaken one, arising from the strength of her language, to which I was then unaccustomed. \u0026nbsp;I have since become aware that nothing can be more decorous than old Mrs. Upton, the excellent head-nurse at Hardover Lodge; and no gentleman more discreet in his conduct than General Talboys.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And I may as well here declare, also, that there could be no more virtuous woman than the General’s wife. \u0026nbsp;Her marriage vow was to her paramount to all other vows and bonds whatever. \u0026nbsp;The General’s honour was quite safe when he sent her off to Rome by herself; and he no doubt knew that it was so. \u0026nbsp;Illi robur et ?s triplex, of which I believe no weapons of any assailant could get the better. \u0026nbsp;But, nevertheless, we used to fancy that she had no repugnance to impropriety in other women,—to what the world generally calls impropriety. \u0026nbsp;Invincibly attached herself to the marriage tie, she would constantly speak of it as by no means necessarily binding on others; and, virtuous herself as any griffin of propriety, she constantly patronised, at any rate, the theory of infidelity in her neighbours. \u0026nbsp;She was very eager in denouncing the prejudices of the English world, declaring that she had found existence among them to be no longer possible for herself. \u0026nbsp;She was hot against the stern unforgiveness of British matrons, and equally eager in reprobating the stiff conventionalities of a religion in which she said that none of its votaries had faith, though they all allowed themselves to be enslaved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We had at that time a small set at Rome, consisting chiefly of English and Americans, who habitually met at each other’s rooms, and spent many of our evening hours in discussing Italian politics. \u0026nbsp;We were, most of us, painters, poets, novelists, or sculptors;—perhaps I should say would-be painters, poets, novelists, and sculptors,—aspirants hoping to become some day recognised; and among us Mrs. Talboys took her place, naturally enough, on account of a very pretty taste she had for painting.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I do not know that she ever originated anything that was grand; but she made some nice copies, and was fond, at any rate, of art conversation. \u0026nbsp;She wrote essays, too, which she showed in confidence to various gentlemen, and had some idea of taking lessons in modelling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In all our circle Conrad Mackinnon, an American, was, perhaps, the person most qualified to be styled its leader. \u0026nbsp;He was one who absolutely did gain his living, and an ample living too, by his pen, and was regarded on all sides as a literary lion, justified by success in roaring at any tone he might please. \u0026nbsp;His usual roar was not exactly that of a sucking-dove or a nightingale; but it was a good-humoured roar, not very offensive to any man, and apparently acceptable enough to some ladies. \u0026nbsp;He was a big burly man, near to fifty as I suppose, somewhat awkward in his gait, and somewhat loud in his laugh. \u0026nbsp;But though nigh to fifty, and thus ungainly, he liked to be smiled on by pretty women, and liked, as some said, to be flattered by them also. \u0026nbsp;If so, he should have been happy, for the ladies at Rome at that time made much of Conrad Mackinnon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of Mrs. Mackinnon no one did make very much, and yet she was one of the sweetest, dearest, quietest, little creatures that ever made glad a man’s fireside. \u0026nbsp;She was exquisitely pretty, always in good humour, never stupid, self-denying to a fault, and yet she was generally in the background. \u0026nbsp;She would seldom come forward of her own will, but was contented to sit behind her teapot and hear Mackinnon do his roaring. \u0026nbsp;He was certainly much given to what the world at Rome called flirting, but this did not in the least annoy her. \u0026nbsp;She was twenty years his junior, and yet she never flirted with any one. \u0026nbsp;Women would tell her—good-natured friends—how Mackinnon went on; but she received such tidings as an excellent joke, observing that he had always done the same, and no doubt always would until he was ninety. \u0026nbsp;I do believe that she was a happy woman; and yet I used to think that she should have been happier. \u0026nbsp;There is, however, no knowing the inside of another man’s house, or reading the riddles of another man’s joy and sorrow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We had also there another lion,—a lion cub,—entitled to roar a little, and of him also I must say something. \u0026nbsp;Charles O’Brien was a young man, about twenty-five years of age, who had sent out from his studio in the preceding year a certain bust, supposed by his admirers to be unsurpassed by any effort of ancient or modern genius. \u0026nbsp;I am no judge of sculpture, and will not, therefore, pronounce an opinion; but many who considered themselves to be judges, declared that it was a “goodish head and shoulders,” and nothing more. \u0026nbsp;I merely mention the fact, as it was on the strength of that head and shoulders that O’Brien separated himself from a throng of others such as himself in Rome, walked solitary during the days, and threw himself at the feet of various ladies when the days were over. \u0026nbsp;He had ridden on the shoulders of his bust into a prominent place in our circle, and there encountered much feminine admiration—from Mrs. General Talboys and others.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Some eighteen or twenty of us used to meet every Sunday evening in Mrs. Mackinnon’s drawing-room. \u0026nbsp;Many of us, indeed, were in the habit of seeing each other daily, and of visiting together the haunts in Rome which are best loved by art-loving strangers; but here, in this drawing-room, we were sure to come together, and here before the end of November, Mrs. Talboys might always be found, not in any accustomed seat, but moving about the room as the different male mental attractions of our society might chance to move themselves. \u0026nbsp;She was at first greatly taken by Mackinnon,—who also was, I think, a little stirred by her admiration, though he stoutly denied the charge. \u0026nbsp;She became, however, very dear to us all before she left us, and certainly we owed to her our love, for she added infinitely to the joys of our winter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have come here to refresh myself,” she said to Mackinnon one evening—to Mackinnon and myself; for we were standing together.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall I get you tea?” said I.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And will you have something to eat?” Mackinnon asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no, no;” she answered. \u0026nbsp;“Tea, yes; but for Heaven’s sake let nothing solid dispel the associations of such a meeting as this!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you might have dined early,” said Mackinnon. \u0026nbsp;Now Mackinnon was a man whose own dinner was very dear to him. \u0026nbsp;I have seen him become hasty and unpleasant, even under the pillars of the Forum, when he thought that the party were placing his fish in jeopardy by their desire to linger there too long.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Early! \u0026nbsp;Yes. \u0026nbsp;No; I know not when it was. \u0026nbsp;One dines and sleeps in obedience to that dull clay which weighs down so generally the particle of our spirit. \u0026nbsp;But the clay may sometimes be forgotten. \u0026nbsp;Here I can always forget it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you asked for refreshment,” I said. \u0026nbsp;She only looked at me, whose small attempts at prose composition had, up to that time, been altogether unsuccessful, and then addressed herself in reply to Mackinnon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is the air which we breathe that fills our lungs and gives us life and light. \u0026nbsp;It is that which refreshes us if pure, or sinks us into stagnation if it be foul. \u0026nbsp;Let me for awhile inhale the breath of an invigorating literature. \u0026nbsp;Sit down, Mr. Mackinnon; I have a question that I must put to you.” \u0026nbsp;And then she succeeded in carrying him off into a corner. \u0026nbsp;As far as I could see he went willingly enough at that time, though he soon became averse to any long retirement in company with Mrs. Talboys.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We none of us quite understood what were her exact ideas on the subject of revealed religion. \u0026nbsp;Somebody, I think, had told her that there were among us one or two whose opinions were not exactly orthodox according to the doctrines of the established English church. \u0026nbsp;If so, she was determined to show us that she also was advanced beyond the prejudices of an old and dry school of theology. \u0026nbsp;“I have thrown down all the barriers of religion,” she said to poor Mrs. Mackinnon, “and am looking for the sentiments of a pure Christianity.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thrown down all the barriers of religion!” said Mrs. Mackinnon, in a tone of horror which was not appreciated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed, yes,” said Mrs. Talboys, with an exulting voice. \u0026nbsp;“Are not the days for such trammels gone by?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But yet you hold by Christianity?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A pure Christianity, unstained by blood and perjury, by hypocrisy and verbose genuflection. \u0026nbsp;Can I not worship and say my prayers among the clouds?” \u0026nbsp;And she pointed to the lofty ceiling and the handsome chandelier.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But Ida goes to church,” said Mrs. Mackinnon. \u0026nbsp;Ida Talboys was her daughter. \u0026nbsp;Now, it may be observed, that many who throw down the barriers of religion, so far as those barriers may affect themselves, still maintain them on behalf of their children. \u0026nbsp;“Yes,” said Mrs. Talboys; “dear Ida! her soft spirit is not yet adapted to receive the perfect truth. \u0026nbsp;We are obliged to govern children by the strength of their prejudices.” \u0026nbsp;And then she moved away, for it was seldom that Mrs. Talboys remained long in conversation with any lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mackinnon, I believe, soon became tired of her. \u0026nbsp;He liked her flattery, and at first declared that she was clever and nice; but her niceness was too purely celestial to satisfy his mundane tastes. \u0026nbsp;Mackinnon himself can revel among the clouds in his own writings, and can leave us sometimes in doubt whether he ever means to come back to earth; but when his foot is on terra firma, he loves to feel the earthly substratum which supports his weight. \u0026nbsp;With women he likes a hand that can remain an unnecessary moment within his own, an eye that can glisten with the sparkle of champagne, a heart weak enough to make its owner’s arm tremble within his own beneath the moonlight gloom of the Coliseum arches. \u0026nbsp;A dash of sentiment the while makes all these things the sweeter; but the sentiment alone will not suffice for him. \u0026nbsp;Mrs. Talboys did, I believe, drink her glass of champagne, as do other ladies; but with her it had no such pleasing effect. \u0026nbsp;It loosened only her tongue, but never her eye. \u0026nbsp;Her arm, I think, never trembled, and her hand never lingered. \u0026nbsp;The General was always safe, and happy, perhaps, in his solitary safety.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It so happened that we had unfortunately among us two artists who had quarrelled with their wives. \u0026nbsp;O’Brien, whom I have before mentioned, was one of them. \u0026nbsp;In his case, I believe him to have been almost as free from blame as a man can be whose marriage was in itself a fault. \u0026nbsp;However, he had a wife in Ireland some ten years older than himself; and though he might sometimes almost forget the fact, his friends and neighbours were well aware of it. \u0026nbsp;In the other case the whole fault probably was with the husband. \u0026nbsp;He was an ill-tempered, bad-hearted man, clever enough, but without principle; and he was continually guilty of the great sin of speaking evil of the woman whose name he should have been anxious to protect. \u0026nbsp;In both cases our friend Mrs. Talboys took a warm interest, and in each of them she sympathised with the present husband against the absent wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of the consolation which she offered in the latter instance we used to hear something from Mackinnon. \u0026nbsp;He would repeat to his wife, and to me and my wife, the conversations which she had with him. \u0026nbsp;“Poor Brown;” she would say, “I pity him, with my very heart’s blood.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are aware that he has comforted himself in his desolation,” Mackinnon replied.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know very well to what you allude. \u0026nbsp;I think I may say that I am conversant with all the circumstances of this heart-blighting sacrifice.” \u0026nbsp;Mrs. Talboys was apt to boast of the thorough confidence reposed in her by all those in whom she took an interest. \u0026nbsp;“Yes, he has sought such comfort in another love as the hard cruel world would allow him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Or perhaps something more than that,” said Mackinnon. \u0026nbsp;“He has a family here in Rome, you know; two little babies.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know it, I know it,” she said. \u0026nbsp;“Cherub angels!” and as she spoke she looked up into the ugly face of Marcus Aurelius; for they were standing at the moment under the figure of the great horseman on the Campidoglio. \u0026nbsp;“I have seen them, and they are the children of innocence. \u0026nbsp;If all the blood of all the Howards ran in their veins it could not make their birth more noble!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not if the father and mother of all the Howards had never been married,” said Mackinnon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What; that from you, Mr. Mackinnon!” said Mrs. Talboys, turning her back with energy upon the equestrian statue, and looking up into the faces, first of Pollux and then of Castor, as though from them she might gain some inspiration on the subject which Marcus Aurelius in his coldness had denied to her. \u0026nbsp;“From you, who have so nobly claimed for mankind the divine attributes of free action! \u0026nbsp;From you, who have taught my mind to soar above the petty bonds which one man in his littleness contrives for the subjection of his brother. \u0026nbsp;Mackinnon! you who are so great!” \u0026nbsp;And she now looked up into his face. \u0026nbsp;“Mackinnon, unsay those words.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are illegitimate,” said he; “and if there was any landed property—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Landed property! and that from an American!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The children are English, you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Landed property! \u0026nbsp;The time will shortly come—ay, and I see it coming—when that hateful word shall be expunged from the calendar; when landed property shall be no more. \u0026nbsp;What! shall the free soul of a God-born man submit itself for ever to such trammels as that? \u0026nbsp;Shall we never escape from the clay which so long has manacled the subtler particles of the divine spirit? \u0026nbsp;Ay, yes, Mackinnon;” and then she took him by the arm, and led him to the top of the huge steps which lead down from the Campidoglio into the streets of modern Rome. \u0026nbsp;“Look down upon that countless multitude.” \u0026nbsp;Mackinnon looked down, and saw three groups of French soldiers, with three or four little men in each group; he saw, also, a couple of dirty friars, and three priests very slowly beginning the side ascent to the church of the Ara C?li. \u0026nbsp;“Look down upon that countless multitude,” said Mrs. Talboys, and she stretched her arms out over the half-deserted city. \u0026nbsp;“They are escaping now from these trammels,—now, now,—now that I am speaking.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They have escaped long ago from all such trammels as that of landed property,” said Mackinnon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ay, and from all terrestrial bonds,” she continued, not exactly remarking the pith of his last observation; “from bonds quasi-terrestrial and quasi-celestial. \u0026nbsp;The full-formed limbs of the present age, running with quick streams of generous blood, will no longer bear the ligatures which past times have woven for the decrepit. \u0026nbsp;Look down upon that multitude, Mackinnon; they shall all be free.” \u0026nbsp;And then, still clutching him by the arm, and still standing at the top of those stairs, she gave forth her prophecy with the fury of a Sybil.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They shall all be free. \u0026nbsp;Oh, Rome, thou eternal one! thou who hast bowed thy neck to imperial pride and priestly craft; thou who hast suffered sorely, even to this hour, from Nero down to Pio Nono,—the days of thine oppression are over. \u0026nbsp;Gone from thy enfranchised ways for ever is the clang of the Pr?torian cohorts and the more odious drone of meddling monks!” \u0026nbsp;And yet, as Mackinnon observed, there still stood the dirty friars and the small French soldiers; and there still toiled the slow priests, wending their tedious way up to the church of the Ara C?li. \u0026nbsp;But that was the mundane view of the matter,—a view not regarded by Mrs. Talboys in her ecstasy. \u0026nbsp;“O Italia,” she continued, “O Italia una, one and indivisible in thy rights, and indivisible also in thy wrongs! to us is it given to see the accomplishment of thy glory. \u0026nbsp;A people shall arise around thine altars greater in the annals of the world than thy Scipios, thy Gracchi, or thy C?sars. \u0026nbsp;Not in torrents of blood, or with screams of bereaved mothers, shall thy new triumphs be stained. \u0026nbsp;But mind shall dominate over matter; and doomed, together with Popes and Bourbons, with cardinals, diplomatists, and police spies, ignorance and prejudice shall be driven from thy smiling terraces. \u0026nbsp;And then Rome shall again become the fair capital of the fairest region of Europe. \u0026nbsp;Hither shall flock the artisans of the world, crowding into thy marts all that God and man can give. \u0026nbsp;Wealth, beauty, and innocence shall meet in thy streets—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There will be a considerable change before that takes place,” said Mackinnon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There shall be a considerable change,” she answered. \u0026nbsp;“Mackinnon, to thee it is given to read the signs of the time; and hast thou not read? \u0026nbsp;Why have the fields of Magenta and Solferino been piled with the corpses of dying heroes? \u0026nbsp;Why have the waters of the Mincio ran red with the blood of martyrs? \u0026nbsp;That Italy might be united and Rome immortal. \u0026nbsp;Here, standing on the Capitolium of the ancient city, I say that it shall be so; and thou, Mackinnon, who hearest me, knowest that my words are true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was not then in Rome,—I may almost say there was not in Italy, an Englishman or an American who did not wish well to the cause for which Italy was and is still contending; as also there is hardly one who does not now regard that cause as well-nigh triumphant; but, nevertheless, it was almost impossible to sympathise with Mrs. Talboys. \u0026nbsp;As Mackinnon said, she flew so high that there was no comfort in flying with her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said he, “Brown and the rest of them are down below. \u0026nbsp;Shall we go and join them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Poor Brown! \u0026nbsp;How was it that, in speaking of his troubles, we were led on to this heart-stirring theme? \u0026nbsp;Yes, I have seen them, the sweet angels; and I tell you also that I have seen their mother. \u0026nbsp;I insisted on going to her when I heard her history from him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what is she like, Mrs. Talboys?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well; education has done more for some of us than for others; and there are those from whose morals and sentiments we might thankfully draw a lesson, whose manners and outward gestures are not such as custom has made agreeable to us. \u0026nbsp;You, I know, can understand that. \u0026nbsp;I have seen her, and feel sure that she is pure in heart and high in principle. \u0026nbsp;Has she not sacrificed herself; and is not self-sacrifice the surest guarantee for true nobility of character? \u0026nbsp;Would Mrs. Mackinnon object to my bringing them together?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mackinnon was obliged to declare that he thought his wife would object; and from that time forth he and Mrs. Talboys ceased to be very close in their friendship. \u0026nbsp;She still came to the house every Sunday evening, still refreshed herself at the fountains of his literary rills; but her special prophecies from henceforth were poured into other ears. \u0026nbsp;And it so happened that O’Brien now became her chief ally. \u0026nbsp;I do not remember that she troubled herself much further with the cherub angels or with their mother; and I am inclined to think that, taking up warmly, as she did, the story of O’Brien’s matrimonial wrongs, she forgot the little history of the Browns. \u0026nbsp;Be that as it may, Mrs. Talboys and O’Brien now became strictly confidential, and she would enlarge by the half-hour together on the miseries of her friend’s position, to any one whom she could get to hear her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell you what, Fanny,” Mackinnon said to his wife one day,—to his wife and to mine, for we were all together; “we shall have a row in the house if we don’t take care. \u0026nbsp;O’Brien will be making love to Mrs. Talboys.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nonsense,” said Mrs. Mackinnon. \u0026nbsp;“You are always thinking that somebody is going to make love to some one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Somebody always is,” said he.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’s old enough to be his mother,” said Mrs. Mackinnon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What does that matter to an Irishman?” said Mackinnon. \u0026nbsp;“Besides, I doubt if there is more than five years’ difference between them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There must be more than that,” said my wife. \u0026nbsp;“Ida Talboys is twelve, I know, and I am not quite sure that Ida is the eldest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If she had a son in the Guards it would make no difference,” said Mackinnon. \u0026nbsp;“There are men who consider themselves bound to make love to a woman under certain circumstances, let the age of the lady be what it may. \u0026nbsp;O’Brien is such a one; and if she sympathises with him much oftener, he will mistake the matter, and go down on his knees. \u0026nbsp;You ought to put him on his guard,” he said, addressing himself to his wife.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed, I shall do no such thing,” said she; “if they are two fools, they must, like other fools, pay the price of their folly.” \u0026nbsp;As a rule there could be no softer creature than Mrs. Mackinnon; but it seemed to me that her tenderness never extended itself in the direction of Mrs. Talboys.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just at this time, towards the end, that is, of November, we made a party to visit the tombs which lie along the Appian Way, beyond that most beautiful of all sepulchres, the tomb of Cecilia Metella. \u0026nbsp;It was a delicious day, and we had driven along this road for a couple of miles beyond the walls of the city, enjoying the most lovely view which the neighbourhood of Rome affords,—looking over the wondrous ruins of the old aqueducts, up towards Tivoli and Palestrina. \u0026nbsp;Of all the environs of Rome this is, on a fair clear day, the most enchanting; and here perhaps, among a world of tombs, thoughts and almost memories of the old, old days come upon one with the greatest force. \u0026nbsp;The grandeur of Rome is best seen and understood from beneath the walls of the Coliseum, and its beauty among the pillars of the Forum and the arches of the Sacred Way; but its history and fall become more palpable to the mind, and more clearly realised, out here among the tombs, where the eyes rest upon the mountains whose shades were cool to the old Romans as to us,—than anywhere within the walls of the city. \u0026nbsp;Here we look out at the same Tivoli and the same Pr?neste, glittering in the sunshine, embowered among the far-off valleys, which were dear to them; and the blue mountains have not crumbled away into ruins. \u0026nbsp;Within Rome itself we can see nothing as they saw it.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2904/80029.html","bookId":1104,"creation":"Aug 2, 2019 10:23:16 AM","modification":"Aug 2, 2019 10:23:16 AM"}
