{"id":75592,"no":39,"title":"Page 39","content":"\u003cp\u003e“I have to go to Mistress Miniahna’s,” Ruhn heard himself say. “To check on her before the dawn comes.”\u003c/p\u003e\n\u003cp\u003e“All right, I understand.” Saxton took a step back, a reserve tightening his features. “I shall see you at nightfall, then. We need to pay a visit to those real estate developers.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eThere was an awkward silence. And then Ruhn blurted, “When?”\u003c/p\u003e\n\u003cp\u003eSaxton exhaled as if he were changing tracks in his head with effort. “Ah, let’s say five forty-five. End of business for them, dark enough for us. We’ll need to take your truck—”\u003c/p\u003e\n\u003cp\u003e“I mean us. When can we…do this again?”\u003c/p\u003e\n\u003cp\u003eSaxton’s smile was quick and sustaining. “Anytime you like.”\u003c/p\u003e\n\u003cp\u003eRuhn reached up and brushed the male’s face with his knuckles…before running his forefinger across that lower lip. Flashes of what they had just done replayed with a soundtrack of their moans and gasps.\u003c/p\u003e\n\u003cp\u003e“Thank you,” he said.\u003c/p\u003e\n\u003cp\u003eSaxton shook his head. “I rather think I’m the one who should be saying that.”\u003c/p\u003e\n\u003cp\u003eNo, Ruhn thought. Not at all.\u003c/p\u003e\n\u003cp\u003eHe leaned in and kissed the male. As his blood began to stir, he knew he had to go—or he was liable to never, ever leave.\u003c/p\u003e\n\u003cp\u003e“It is I who am grateful to you,” he whispered against those lips.\u003c/p\u003e\n\u003cp\u003e“Who is Oskar?”\u003c/p\u003e\n\u003cp\u003eAs the question was whispered in her ear, Novo came fully awake. At first, she had no idea whose chest she was lying all sprawled and warm on—but a quick inhale solved that problem. Peyton. She and Peyton were—\u003c/p\u003e\n\u003cp\u003eYes, the hospital room. She was in the clinic, still recovering from surgery.\u003c/p\u003e\n\u003cp\u003eLifting her head, she looked at the male she’d turned into a throw pillow. Peyton seemed perfectly content to be used in such a fashion, his naked body relaxed, his eyes heavily lidded, the mess at his throat already beginning to heal itself. Over on the floor, his tuxedo was all fallen-soldier-on-the-battlefield, scattered in pieces from having been cast aside.\u003c/p\u003e\n\u003cp\u003eHis cock was much the same, resting flaccid and exhausted on one of his thighs.\u003c/p\u003e\n\u003cp\u003eShe had the sense it would be back in working order at the drop of a hat.\u003c/p\u003e\n\u003cp\u003e“A lover?” he prompted.\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“Oskar. You said his name in your sleep just now.”\u003c/p\u003e\n\u003cp\u003e“Oh, that’s no one.”\u003c/p\u003e\n\u003cp\u003e“Really? You seemed upset—or your voice did.”\u003c/p\u003e\n\u003cp\u003e“Must have been a nightmare for no good reason.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” He brushed a wisp of hair back from her cheek. “Can I ask you something?”\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003e“You want to go on a date with me sometime?”\u003c/p\u003e\n\u003cp\u003eNovo cocked a brow at him. “A date.”\u003c/p\u003e\n\u003cp\u003e“Yup. Dinner. Dancing. This kind of thing.”\u003c/p\u003e\n\u003cp\u003e“Are you thinking there will be sex involved?”\u003c/p\u003e\n\u003cp\u003e“Hoping, sure.”\u003c/p\u003e\n\u003cp\u003e“Maybe.”\u003c/p\u003e\n\u003cp\u003eHis smile went straight into the center of her chest, sure as that dagger had: slow, confident, sexy. “I love a challenge.”\u003c/p\u003e\n\u003cp\u003e“I’m not a challenge, though.”\u003c/p\u003e\n\u003cp\u003e“You are as far from easy as anyone I’ve ever met.”\u003c/p\u003e\n\u003cp\u003e“You can never win me. That’s why I’m not.”\u003c/p\u003e\n\u003cp\u003e“Isn’t that the very definition of a challenge?”\u003c/p\u003e\n\u003cp\u003e“No, it’s called a brick wall. You’re welcome to try me, though.”\u003c/p\u003e\n\u003cp\u003e“Somehow, someday,” he held his forefinger aloft, “I’m going to get through to you.”\u003c/p\u003e\n\u003cp\u003e“Ask yourself why you’re bothering to try. You’ll get far more out of that endeavor, I assure you—”\u003c/p\u003e\n\u003cp\u003e“She’s soooooooooooooo hiiiiiiiiiiiiiiiiiiiiiiiigh, hiiigh above me—”\u003c/p\u003e\n\u003cp\u003eNovo recoiled and had to talk over all the off-key. “Why are you singing?”\u003c/p\u003e\n\u003cp\u003e“—she’s soooo looooovely—”\u003c/p\u003e\n\u003cp\u003eNovo had to laugh. “You are a total freak, you know that—”\u003c/p\u003e\n\u003cp\u003e“—liiiiiike Cleeeopatraaaa, Joooooooannn of Arrrrccc—”\u003c/p\u003e\n\u003cp\u003e“Oh, my God, you are tone deaf.”\u003c/p\u003e\n\u003cp\u003eAs she covered her ears, he really turned up the volume. “—or Apppphroooodiiiiteeee—”\u003c/p\u003e\n\u003cp\u003eHis arms wrapped around her and he kissed her and kissed her again. But it wasn’t about sex. He seemed to like the fact that she was laughing, and the mouth-to-mouth was his way of telling her that.\u003c/p\u003e\n\u003cp\u003e“Why are you such a whack job?” she said against his lips.\u003c/p\u003e\n\u003cp\u003e“ ’Cuz I will do just about anything to see that smile of yours.”\u003c/p\u003e\n\u003cp\u003e“Why do you care?”\u003c/p\u003e\n\u003cp\u003e“How can I not?”\u003c/p\u003e\n\u003cp\u003eNovo rolled her eyes. “Listen, you need to stop.”\u003c/p\u003e\n\u003cp\u003e“I did. I’m no longer singing. But if you want me to go through my repertoire of Wham!, I have that shit on deck right now for you. I also do a mean Flock of Seagulls, wassup.”\u003c/p\u003e\n\u003cp\u003e“I’m talking about being charming. I hate it. Just be yourself.”\u003c/p\u003e\n\u003cp\u003e“What if I am being myself.”\u003c/p\u003e\n\u003cp\u003e“Frustrated lounge singer?”\u003c/p\u003e\n\u003cp\u003e“Someone who wants to make you smile.”\u003c/p\u003e\n\u003cp\u003eShe shoved herself off of him and sat up—at least until her IV lines stopped her. “I think you need to go.”\u003c/p\u003e\n\u003cp\u003ePeyton just put his hands behind his head and continued to lie there like a lion sunning himself. Except he was not king of the jungle and, hello, the light source was fluorescent and coming from the bathroom.\u003c/p\u003e\n\u003cp\u003eDamn it, that roughed-up blond hair and those sleepy blue eyes were too fucking attractive. Especially considering they were the cherry on top of one hell of a naked-ass sundae.\u003c/p\u003e\n\u003cp\u003e“I can’t,” he drawled.\u003c/p\u003e\n\u003cp\u003eWait, what had they been talking about? Oh, right. The Peyton charm. “You sure as hell can cut the shit.”\u003c/p\u003e\n\u003cp\u003e“By the way, it’s two in the afternoon.” He nodded at the clock over on the wall. “Daylight is a real buzzkill, so you can’t tell me to go. As annoying as you find me, I’m very sure you don’t want my death on your conscience.”\u003c/p\u003e\n\u003cp\u003e“Do not underestimate how irritating you can be.” Novo pointed to the door. “And no matter what time of day or night, you can always leave this room.”\u003c/p\u003e\n\u003cp\u003e“Make me.”\u003c/p\u003e\n\u003cp\u003eShe blinked. “What…?”\u003c/p\u003e\n\u003cp\u003e“You heard me, hard-ass. Unplug yourself, pick me up, and toss me out there like litter. Otherwise, I’m just sooooo comfortable right here. I mean, this two-inch pillow—that’s basically like putting my head on a Frosted Mini-Wheat—is diiiiivine. And don’t get me started on these sheets. I mean, hello, I’m throwing my Porthault out as soon as I get home and replacing it with this sandpaper. My ass is getting buffed to a high shine with me just breathing.”\u003c/p\u003e\n\u003cp\u003eNovo mostly kept the laugh to herself. Mostly. “Stop. You’re not funny.”\u003c/p\u003e\n\u003cp\u003e“No? Not even a little?” He winked at her. “How about I do my best joke ever.”\u003c/p\u003e\n\u003cp\u003eShe crossed her arms over her chest—and then abruptly froze. As she looked down at herself, she took a ragged breath.\u003c/p\u003e\n\u003cp\u003eInstantly, Peyton was all serious and sitting up. “What’s wrong. I’ll get the doctor—”\u003c/p\u003e\n\u003cp\u003e“No, I’m okay.”\u003c/p\u003e\n\u003cp\u003eWith hands that shook, she reached up to the hospital johnny’s ties. Loosening the top one, she gently parted the two halves…and stared down.\u003c/p\u003e\n\u003cp\u003eIn a barely audible voice, she whispered, “It’s gone. The scar…is gone. It’s healed. My heart…has healed. There’s no pain.”\u003c/p\u003e\n\u003cp\u003ePeyton leaned in. And then he reached out and brushed his finger down the perfectly regenerated skin. There wasn’t even a mark.\u003c/p\u003e\n\u003cp\u003e“I didn’t want to die.” She cleared her throat, but she was still hoarse. “Out there. When it happened…I didn’t want to die.”\u003c/p\u003e\n\u003cp\u003e“You sound surprised.”\u003c/p\u003e\n\u003cp\u003eNovo closed her eyes. “I am.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003eTrying to snap out of it, she shut his sympathy down. “You already apologized for the mistake.”\u003c/p\u003e\n\u003cp\u003e“No.” He shook his head. “I’m sorry there was a time when you wanted to die.”\u003c/p\u003e\n\u003cp\u003e“I never said that.”\u003c/p\u003e\n\u003cp\u003e“You don’t have to.”\u003c/p\u003e\n\u003cp\u003eBefore she could try to slam that door closed, he did the strangest thing. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-kiss-black-dagger-legacy-1/page-39.html","bookId":1779,"creation":"Oct 5, 2019 10:35:56 AM","modification":"Oct 5, 2019 10:35:56 AM"}
