{"id":75557,"no":4,"title":"Page 4","content":"\u003cp\u003e“We’re stuck here.” Axe flexed his heavy arms like they were sore. “They can’t get us out. Bus is canceled.”\u003c/p\u003e\n\u003cp\u003e“What the hell?” Peyton pictured his weed stash in his bedroom like it was a long-lost relative. “I got plans.”\u003c/p\u003e\n\u003cp\u003e“Take it up with management, my man. I can’t help you.”\u003c/p\u003e\n\u003cp\u003eThe problem was that they couldn’t just dematerialize off the mountain. The Brotherhood compound, which included this subterranean complex, was in a highly secured location: For one, the trainees were not privy to its whereabouts, and that was information you didn’t want to have, anyway. Who needed to know where the First Family stayed? All that got you was on the short list of torture targets if there was an assassination attempt. But even more to the point, the property was covered in mhis, something that both blurred the landscape visually and also made it virtually impossible for anyone who didn’t know the coordinates to dematerialize on or off the acreage.\u003c/p\u003e\n\u003cp\u003eSo yeah, nobody in the class was going any-fucking-where.\u003c/p\u003e\n\u003cp\u003eShit, he’d thought the ride back to Caldwell proper was going to be bad? This was a frickin’ nightmare. Trapped here, with Paradise and Craeg, until at least five or six o’clock the following night when it was dark enough to bus out? Assuming the blizzard quit by then?\u003c/p\u003e\n\u003cp\u003ePeyton looked over at Novo. She and Axe were talking about the IED stuff Paradise had been studying, and as he watched her lips move…he thought about all the places she could put them on his body.\u003c/p\u003e\n\u003cp\u003eWell, now, he decided, at least the Brotherhood let people booze up if they were off duty. And with the right kind of persuasion? It was beyond time for him and Novo to find some privacy and put it to good use—and that would do double duty keeping him away from the flying fists of one half of the Happiest Couple on the Fucking Planet.\u003c/p\u003e\n\u003cp\u003eThis was an opportunity. Not a crisis.\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eGoddamn it. He tasted amazing.\u003c/p\u003e\n\u003cp\u003eAs Novo kept a convo going with Axe, it was just a surface-level tennis match of words and terms they’d learned in class. Underneath all those conventional syllables, she was back in the moment when she had taken a part of Peyton into her…and liked it.\u003c/p\u003e\n\u003cp\u003eHe was still staring at her, his body poised as if it were ready to take hers down to the floor, all kinds of heat and erotic intent rolling off of him like strokes she could actually feel on her bare skin.\u003c/p\u003e\n\u003cp\u003eThe aggression and the hunger were a surprise considering his refined bloodline, but not a shock given who he was. For a rich boy, he had proven to be a cunning and tenacious fighter, strong and strangely fearless. Now…the question appeared to be whether she wanted to see what kind of lover he was—\u003c/p\u003e\n\u003cp\u003e“—Paradise’s birthday,” Axe was saying to him. “Elise told me you guys were going to meet to make sure shit was tight.”\u003c/p\u003e\n\u003cp\u003eNovo refocused as Peyton nodded. “I’ll call her tonight. I think we’re all set.”\u003c/p\u003e\n\u003cp\u003e“When is this?” Novo heard herself ask.\u003c/p\u003e\n\u003cp\u003eAs date/time/location were shared and there was more gum-flapping around the whole celebration, she retreated into her head again.\u003c/p\u003e\n\u003cp\u003eYeah, not her scene. Two or three hundred members of the glymera under the age of a century, doing a Stella McCartney/Tom Ford mix-and-mingle fueled by top-shelf liquor, finger foods on silver trays, and aristocratic privilege?\u003c/p\u003e\n\u003cp\u003eJust shoot me now, she thought.\u003c/p\u003e\n\u003cp\u003eAnd that was before you added Peyton staring at the birthday girl like she had stolen his soul and put it in her Chanel bag.\u003c/p\u003e\n\u003cp\u003e“—coming, right?”\u003c/p\u003e\n\u003cp\u003eWhen there was a pause, she glanced at Axe. “What?”\u003c/p\u003e\n\u003cp\u003e“You have to come,” the guy muttered. “I need someone I can stand to talk to.”\u003c/p\u003e\n\u003cp\u003e“Why don’t we skip it and go to The Keys?”\u003c/p\u003e\n\u003cp\u003e“Those days are over for me.”\u003c/p\u003e\n\u003cp\u003e“Oh, that’s right. You got your happily ever after, so you’re too good for us sluts.”\u003c/p\u003e\n\u003cp\u003eAnd no, she didn’t give a shit that she sounded bitter…\u003c/p\u003e\n\u003cp\u003eOkay, maybe she was sorry she was being a bitch. But the guy had been a legend down at Caldwell’s infamous sex club. Why anybody would give that up for just one person, she couldn’t fathom. It was a buffet exchanged for a cupboard full of the same can of soup, decade in and decade out. Plus that whole eggs-in-one-basket thing? Not for her.\u003c/p\u003e\n\u003cp\u003eShe’d only had to learn that lesson once.\u003c/p\u003e\n\u003cp\u003e“You go there on the regular?” Peyton asked her with a remote expression.\u003c/p\u003e\n\u003cp\u003eAs he narrowed his stare on her, it was tempting to point out to Mr. Anachronism that females were *shocker* allowed to drive cars, own real property, wear pants. And civilization hadn’t crashed and burned into the mountain of Everything Was Better Before.\u003c/p\u003e\n\u003cp\u003e“I’m a member.” She crossed her arms over her chest. “You got a problem with that.”\u003c/p\u003e\n\u003cp\u003e“So when are you taking me?”\u003c/p\u003e\n\u003cp\u003eShe hid her surprise. “You couldn’t handle it.”\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003eNovo looked him up and down. “I don’t, but you’re not interesting enough to me to find out.”\u003c/p\u003e\n\u003cp\u003eAxe whistled under his breath. “Ouch.”\u003c/p\u003e\n\u003cp\u003ePeyton ignored the guy, a cold light entering his eyes. “Challenge accepted. What night?”\u003c/p\u003e\n\u003cp\u003eNovo shook her head. “That wasn’t a challenge.”\u003c/p\u003e\n\u003cp\u003e“I think it was. And although you didn’t spare me any courtesy, I will rise above and refrain from pointing out that you’re lying. Just like you did a minute and a half ago when you told me you didn’t want to fuck me.” He put his hand over his mouth. “Oh. Whoops. Did that just come out?”\u003c/p\u003e\n\u003cp\u003e“Will you two cut the shit and get a room already,” Axe drawled. “No offense, but rom coms make me sick.”\u003c/p\u003e\n\u003cp\u003e“This is not a romantic comedy,” Novo ground out. “It’s a murder mystery with an obvious ending.”\u003c/p\u003e\n\u003cp\u003e“I have to agree with her on that one.” Peyton reached forward and ran his fingertips along Novo’s collarbone. “A good orgasm is known as the little death. And I’m more than willing to die for you. A little.”\u003c/p\u003e\n\u003cp\u003eBefore she could slap his hand away—or break out the bodily harm—he sauntered off with a smile.\u003c/p\u003e\n\u003cp\u003e“Where’s some booze,” he said over his shoulder. “I need a drink if I’m going to make it through today stuck in here with all of your denial.”\u003c/p\u003e\n\u003cp\u003eNovo crossed her arms over her chest. “He is such an asshole.”\u003c/p\u003e\n\u003cp\u003e“Everyone needs a hobby.” Axe shrugged. “And he clearly likes pissing you off.”\u003c/p\u003e\n\u003cp\u003e“If you tell me to stop encouraging him, I’m going to punch you in the junk.”\u003c/p\u003e\n\u003cp\u003eAxe put his palms up. “Not it on that one. Besides, your presence alone is enough encouragement. What are you going to do, take your own skin off?”\u003c/p\u003e\n\u003cp\u003e“Yeah, right. Paradise is the one he wants, and don’t read any bitch into that. She is more than welcome to hold that exalted position. And likewise, if he wants to continue hitting that wall until he blacks out, have fun with that.”\u003c/p\u003e\n\u003cp\u003eAxe regarded her for a long moment. Then he offered his palm. “A hundy says that you’re the one for him.”\u003c/p\u003e\n\u003cp\u003e“I don’t bet.”\u003c/p\u003e\n\u003cp\u003e“Coward.”\u003c/p\u003e\n\u003cp\u003eShe jerked her hand forward and grabbed him hard. “Fuck you. And it’s on.”\u003c/p\u003e\n\u003cp\u003e“You can’t do anything to dissuade him.”\u003c/p\u003e\n\u003cp\u003e“That’s my S.O.P. with the bastard. I’m not stopping now.”\u003c/p\u003e\n\u003cp\u003e“Not what I meant.” Axe shook his head. “This is out of your control. And his.”\u003c/p\u003e\n\u003cp\u003e“Like you’re an expert.”\u003c/p\u003e\n\u003cp\u003e“I am.” The male shrugged his powerful shoulders. “Just been through it myself. That’s how I know how this is going to turn out.”\u003c/p\u003e\n\u003cp\u003eAs the fighter walked away, he had all the calmness of someone who could see the future, and Novo hoped he enjoyed that superiority—while it lasted.\u003c/p\u003e\n\u003cp\u003eShe was going to enjoy spending his Benji.\u003c/p\u003e\n\u003cp\u003eThat much she was clear on.\u003c/p\u003e\n\u003cp\u003eAs Saxton stood at a long window framed by green velvet drapes with golden tassels and embroidered sashes, he stared out into a blizzard and braced himself to go ice-bath. He had his briefcase in one hand, his Gucci scarf in the other—and his intense distaste of cold weather all around him.\u003c/p\u003e\n\u003cp\u003eThe Black Dagger Brotherhood’s mansion was on top of a mountain, and the wind gusts at this higher altitude were like an invading army bearing down against its great stone walls. The blasts came in waves and from different directions, and as he watched the snowflakes blow at their mercy, he was reminded of what schools of fish looked like, going this way and then that way, in delineated chaos. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-kiss-black-dagger-legacy-1/page-4.html","bookId":1779,"creation":"Oct 5, 2019 10:35:55 AM","modification":"Oct 5, 2019 10:35:55 AM"}
