{"id":103703,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"You\u0027re on my back, woman!\" Ben hissed at Ashley. \"It won\u0027t help Halloway if we run over a cliff.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, but there\u0027s so much blood.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going as quickly as safety will allow.\"\u003c/p\u003e\n\u003cp\u003eVillanueva halted their discussion with a firm motion of his arm. He pointed around the next corner. Ashley crept next to him and peered past the curve. Up ahead, the tunnel dumped into a large cavern. \"I think I should proceed alone,\" the SEAL said. \"Check out the area.\"\u003c/p\u003e\n\u003cp\u003e\"No. Not this time,\" Ashley said firmly. \"I want the team together. More eyes to watch backs, and more trigger fingers to protect those backs.\"\u003c/p\u003e\n\u003cp\u003eVillanueva shrugged.\u003c/p\u003e\n\u003cp\u003eThe team proceeded as a group into the cavern, flashlights flared out like the spokes of a wheel. The chamber was similar to the others they had crossed in their journey here. Stalagmites littered the floor; stalactites stabbed downward. Except there was one new feature. Ashley rubbed a snowflake from her eyelash. \"Damn. It\u0027s snowing in here.\"\u003c/p\u003e\n\u003cp\u003eA small flurry of soft flakes fluttered through their light beams.\u003c/p\u003e\n\u003cp\u003eLinda held a hand out and flakes settled on her palm. \"They\u0027re not cold or wet.\"\u003c/p\u003e\n\u003cp\u003eBen shouldered his way to Ashley\u0027s side, brushing at the sifting of flakes. \"This is bad.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not snow. It\u0027s gypsum crystals.\" He pointed his flashlight to the branches of gypsum crystals festooning the ceiling of the chamber like twenty-foot white chandeliers. \"They\u0027re fragile, delicate structures. Body heat can cause them to weaken and flake away.\"\u003c/p\u003e\n\u003cp\u003eAshley brushed flakes from her shoulders, like dandruff. \"I still don\u0027t see the danger.\"\u003c/p\u003e\n\u003cp\u003e\"For this snowfall to be happening now, a lot of body heat had to recently pass through here. More than one injured SEAL.\"\u003c/p\u003e\n\u003cp\u003eAshley\u0027s eyes widened with the implication. \"We\u0027re not alone down here.\"\u003c/p\u003e\n\u003cp\u003eThe drifting of gypsum crystals thickened as the team crossed the cavern. Lights jittered in every direction, shadows jumping and lunging. Ashley adjusted the handkerchief she had tied over her nose and mouth to keep from inhaling the flakes. She glanced at the others, masked like a bunch of bandits sneaking up on an unsuspecting victim.\u003c/p\u003e\n\u003cp\u003eVillanueva still had the point, crouching low and darting from cover to cover, before waving them forward with an all-clear sign. No one spoke much, fearful of just what else might be lurking in the next shadow.\u003c/p\u003e\n\u003cp\u003eBen marched beside her, pointing his gun forward. He shifted his light to the cavern floor. \"Blood trail is thinning,\" he whispered.\u003c/p\u003e\n\u003cp\u003eTheir evening report to Alpha Base was now an hour past due, but they couldn\u0027t halt their search now. It would take half an hour to unwrap the radio\u0027s components from their waterproof plastic, assemble the parts, and make their report. Time, like the SEAL\u0027s blood trail, was running out.\u003c/p\u003e\n\u003cp\u003eA frantic hissing from Villanueva drew her attention away from the red trail. The others had frozen in crouched positions. She was the only one still standing. Ben pulled her down beside him. He kept a hold on her hand.\u003c/p\u003e\n\u003cp\u003eThe SEAL, crouched at the base of a huge boulder, held a finger to his lips and motioned her to come forward… quietly. Ashley crept to the point position.\u003c/p\u003e\n\u003cp\u003eVillanueva pressed his lips to her ear. He spoke in a hurry. \"We\u0027ve reached the other side of this cave. There\u0027re two exit points. A large tunnel and small wormhole.\"\u003c/p\u003e\n\u003cp\u003e\"So? Let\u0027s go. Which way does the blood trail go?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"I can\u0027t say for sure. The mud is too chewed up out there to get a clear trail.\"\u003c/p\u003e\n\u003cp\u003e\"So we just check both,\" she said, leaning away.\u003c/p\u003e\n\u003cp\u003e\"Wait. That\u0027s not why I called you over.\" He pointed beyond the boulder. \"Poke your head around the corner and listen.\"\u003c/p\u003e\n\u003cp\u003eRaising an eyebrow, Ashley craned her neck around the boulder. In the rock face before her, she spotted another rough-walled tunnel, like the one that had led them to this cavern. At first she didn\u0027t hear anything above her own panting breath. Perhaps her ears weren\u0027t as sharp as the SEAL\u0027s. As she was turning to ask Villanueva for elaboration, she heard it too. A cracking and crunching, like dry sticks underfoot. And a throaty slurping. A shiver passed through her. It was coming from the tunnel ahead.\u003c/p\u003e\n\u003cp\u003eShe raised her light to flash it into the heart of the tunnel when Villanueva swatted her arm back down.\u003c/p\u003e\n\u003cp\u003e\"No,\" he hissed. \"Whatever\u0027s in there doesn\u0027t know we\u0027re here.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe it\u0027s Halloway,\" she said earnestly, but even she didn\u0027t believe her words.\u003c/p\u003e\n\u003cp\u003e\"Bullshit,\" the SEAL said.\u003c/p\u003e\n\u003cp\u003e\"Well, what do we do? Just sit here and wait?\"\u003c/p\u003e\n\u003cp\u003eA sharp sneeze retorted from behind them. Ashley whipped around. Khalid shrugged apologetically and pointed to the drifting flakes, his other hand restraining a second outburst.\u003c/p\u003e\n\u003cp\u003eTurning back to Villanueva, Ashley held her breath. \"I can\u0027t hear it anymore,\" she whispered.\u003c/p\u003e\n\u003cp\u003eThe SEAL nodded. He had his eyes closed. \"Neither can I.\"\u003c/p\u003e\n\u003cp\u003eShit! Whatever was in that tunnel now knew they were here. There was no further use hiding. She stood up, now holding her pistol in both hands. \"Ben, Villanueva. You\u0027re both with me. Michaelson, you stay under cover behind the boulder with the others.\"\u003c/p\u003e\n\u003cp\u003eMichaelson stepped forward. \"This is a military matter. You should remain here. It\u0027s safer. I\u0027ll go with Ben and Villanueva.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" she said, checking her pistol. \"I want you here. Guarding our rear. And protecting the others. We may need a fast retreat.\"\u003c/p\u003e\n\u003cp\u003eShe watched the major chew over her decision. Apparently unable to find fault, he nodded. \"Be careful.\"\u003c/p\u003e\n\u003cp\u003eShe cocked her pistol. \"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eHer group crossed to the front of the boulder, gun barrels pointing toward the tunnel opening.\u003c/p\u003e\n\u003cp\u003e\"I say we open fire,\" the SEAL said quietly. \"Blast the tunnel and ask questions later.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Ashley hissed. \"There\u0027s still a chance Halloway may be in there.\"\u003c/p\u003e\n\u003cp\u003eVillanueva raised his assault rifle. \"We take the advantage while we\u0027ve got it.\"\u003c/p\u003e\n\u003cp\u003eShe shoved his rifle with her shoulder and stepped forward. \"Halloway!\" she called. \"If you\u0027re in there, give us some signal!\"\u003c/p\u003e\n\u003cp\u003eThe tunnel just stared blankly back at them.\u003c/p\u003e\n\u003cp\u003e\"Satisfied?\" The SEAL\u0027s contempt dripped from the word as he repositioned. He lowered his head closer to his rifle sights. The cavern exploded with rifle fire as he blasted blindly into the dark eye of the tunnel. The reverberations rocked through the cavern.\u003c/p\u003e\n\u003cp\u003eHer ears still rang after the SEAL ceased firing. A cloud of rock dust and smoke rolled from the assaulted opening.\u003c/p\u003e\n\u003cp\u003eBen narrowed his light beam, trying to dig deeper into the inky blackness, but failed. \"Damn.\"\u003c/p\u003e\n\u003cp\u003eFrom the mouth of the tunnel erupted a ululating cry, like a keening hawk, but more guttural and rasping. Ashley winced at the noise. A primordial part of her responded, wanting to cower and flee, but she dropped to one knee and raised her pistol higher.\u003c/p\u003e\n\u003cp\u003eThen something small bounced out into the main cavern.\u003c/p\u003e\n\u003cp\u003e\"Jesuschristgoddamnmotherfu…\" Villanueva swore a stream, backing a step away.\u003c/p\u003e\n\u003cp\u003eIt was Halloway. His head. The decapitated head of the former SEAL bumped to a stop a yard away, eyes staring up, snowflakes settling softly on the eyelashes.\u003c/p\u003e\n\u003cp\u003eFOURTEEN\u003c/p\u003e\n\u003cp\u003eJASON PLOPPED INTO HIS CHAIR IN THE OFFICE, EXPELLING a sigh loud enough to draw his \"baby-sitter\u0027s\" attention. He had been waiting for five minutes already. Five minutes! He was going to be late for his karate practice.\u003c/p\u003e\n\u003cp\u003eRoland looked up from his papers; his glasses drooped to the tip of his long nose. \"Oh, Jason. Are you still here? I thought you had already left for the gym.\"\u003c/p\u003e\n\u003cp\u003e\"You know I can\u0027t.\" He stressed each syllable.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eJason rolled his eyes. \"Dr. Blakely said I was not to leave any of the buildings without a stupid baby-sitter.\" He scrunched up his face and imitated the nasal quality of Blakely\u0027s voice. \"It\u0027s for my own protection.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s just silly. The gym is right next door. Be a good boy and scoot on over there. I\u0027ve still a huge pile of reports to log and index.\"\u003c/p\u003e\n\u003cp\u003eJason\u0027s face brightened. All right! He shoved his chair back with a loud squeak and bolted away. He ran down the hall and out the door, his gym bag bumping against his leg. He sprinted the ten yards to the next building. Lieutenant Brusserman was probably already waiting. Once through the door, Jason was assaulted by the familiar smells of a gymnasium. Sweaty cotton jerseys, varnish on the basketball court\u0027s floor, and the tang of disinfectant.\u003c/p\u003e\n\u003cp\u003eHe searched the aerobics area for Lieutenant Brusserman, but saw no sign of him. Jason crossed the gym, heading for the locker room. He stopped to watch a game of one-on-one being played on the basketball court. Jason recognized Major Chan, with whom he had gone boating yesterday.\u003c/p\u003e\n\u003cp\u003eSignaling a time out, Major Chan crossed over to where Jason stood. He was winded and spoke between gulps of air. \"Hi, kid. Listen, the lieutenant called. He won\u0027t be able to make it today, but he said to say sorry. He\u0027ll see you tomorrow.\" The major faked a punch at him playfully and then returned to his game.\u003c/p\u003e\n\u003cp\u003eJason\u0027s heart sank. \"But what am I supposed to…\" The major was already back in the game, defending a drive to the basket.\u003c/p\u003e\n\u003cp\u003eDarn it! Now what? He didn\u0027t want to go back to Roland\u0027s office. He\u0027d be stuck thumbing through those boring magazines about Navy life.\u003c/p\u003e\n\u003cp\u003eHe nudged open the door and slipped outside. A group of white-smocked researchers milled past him, heading toward the dormitories, joking and laughing.\u003c/p\u003e\n\u003cp\u003eJason sat on the steps and searched in his gym bag for something to do. His Nintendo Game Boy? He crinkled his nose. No-boring. His hand curled around a Spiderman comic book, but he\u0027d read it.\u003c/p\u003e\n\u003cp\u003eSighing, he juggled the contents. A few coins jingled, and a pack of gum fell out of his bag. Frowning, he picked up the package of Juicy Fruit and shoved it into the side compartment of his bag. While doing so, his hand fell upon a hard, round object hidden in the pocket.\u003c/p\u003e\n\u003cp\u003eHe fished it out. Oh, yeah! He fingered the old red firecracker. A cherry bomb. He smiled, remembering how he had traded for it with Billy Sanderson for an X-men comic book. Almost forgot about this little baby. Glancing around him with a mischievous gleam in his eye, he pondered sneaking off and trying it out. \u003c/p\u003e","sourceLink":"https://allnovel.net/subterranean/page-22.html","bookId":1526,"creation":"Oct 5, 2019 10:30:23 PM","modification":"Oct 5, 2019 10:30:23 PM"}
