{"id":103688,"no":6,"title":"Page 6","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eAshley bristled. Once again Blakely had failed to reveal the full extent of this mission. First the armed escort, and now this. \"I don\u0027t know if I like this,\" she said. \"Raping a continent. And for whose benefit?\"\u003c/p\u003e\n\u003cp\u003eLinda nodded in agreement.\u003c/p\u003e\n\u003cp\u003eEveryone sat quietly, pondering the sobering news.\u003c/p\u003e\n\u003cp\u003eThen Ben, in a sudden outburst, destroyed the somber reverie. \"To hell with it. Let\u0027s go dancing! It\u0027s the flipping birthplace of the tango. C\u0027mon, Buenos Aires is just waking up.\"\u003c/p\u003e\n\u003cp\u003eAshley frowned. This Australian sheepherder never stops, she thought. \"I\u0027ll pass. I have a son to tuck into bed.\"\u003c/p\u003e\n\u003cp\u003eKhalid also shook his head. \"We don\u0027t dance the tango in my country.\"\u003c/p\u003e\n\u003cp\u003eLinda brightened. \"I\u0027ll go. I\u0027d like to get out of this stuffy hotel.\"\u003c/p\u003e\n\u003cp\u003e\"Superb!\" Ben said. \"I know of a bar in the San Telmo district. Quaint and authentic.\"\u003c/p\u003e\n\u003cp\u003eBen scooted out of the booth and gave Linda his hand. \"The night and the stars await us,\" he declared with a slight bow.\u003c/p\u003e\n\u003cp\u003eBashfully, Linda smiled at Ben\u0027s drama.\u003c/p\u003e\n\u003cp\u003eAs the two walked away, Ashley noticed Khalid\u0027s brows lower. He mumbled something in Arabic, then said his good-byes to her and slipped from the table also.\u003c/p\u003e\n\u003cp\u003eShe watched as Ben escorted Linda across the bar. A small burst of her tinkling laughter could be heard as the two exited onto the street.\u003c/p\u003e\n\u003cp\u003eAshley remained, nursing the rest of her drink. As if on cue, the plangent chords of a tango began wailing from the bar\u0027s speakers. The sultry music just made her feel that much lonelier.\u003c/p\u003e\n\u003cp\u003eBOOK TWO\u003c/p\u003e\n\u003cp\u003eUnder the Ice\u003c/p\u003e\n\u003cp\u003eFIVE\u003c/p\u003e\n\u003cp\u003eIN A PLANE AGAIN, ASHLEY THOUGHT SOURLY, HER NOSE pressed to the window. Down below, glacier fought granite from horizon to horizon.\u003c/p\u003e\n\u003cp\u003eThis was the final leg of the two-day journey. Yesterday, they had flown the eight hundred miles from Buenos Aires to Esperanza, the Argentine army base on the tip of an Antarctic Peninsula. There, Ashley had her first taste of Antarctic air-like ice water poured into her lungs. The team overnighted at the base\u0027s military barracks and the next morning were hauled once again aboard the Argentine transport. By noon, Blakely had promised, they would reach their final destination, the U.S. naval base McMurdo.\u003c/p\u003e\n\u003cp\u003eAshley longed to spend more than twenty-four hours outside an airplane\u0027s cabin. She pushed herself up a bit to see if Jason was behaving himself. He was seated across the rattling cabin next to Ben, talking animatedly, his hands expressive. The two had become fast friends since bunking together in the male dormitory of the barracks in Esperanza.\u003c/p\u003e\n\u003cp\u003eBen noticed her stare and grinned over Jason\u0027s head at her. The Australian was demonstrating admirable patience. Jason\u0027s stories could get long-winded.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s fine,\" said Major Michaelson, seated next to her.\u003c/p\u003e\n\u003cp\u003eStartled, she snapped at him. \"I didn\u0027t ask for your opinion.\"\u003c/p\u003e\n\u003cp\u003e\"I just meant…\" He shook his head with a frown. \"Never mind.\"\u003c/p\u003e\n\u003cp\u003eAshley bit her lower lip. He was obviously just trying to reassure her. \"I\u0027m sorry. That wasn\u0027t directed at you. I just have these nagging doubts about bringing Jason along.\"\u003c/p\u003e\n\u003cp\u003eThe tension in his shoulders seemed to relax. \"Your son has a lot of spunk. He\u0027ll do fine.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks. But what about Ben? He didn\u0027t come on this mission to be my baby-sitter.\"\u003c/p\u003e\n\u003cp\u003eThe major smiled. \"Maybe some of Jason\u0027s maturity will rub off on him.\"\u003c/p\u003e\n\u003cp\u003eShe chuckled. \"That man sure is a walking showboat.\"\u003c/p\u003e\n\u003cp\u003e\"At least he knows his business.\" He nodded toward Ben. \"I read his file. A celebrated search-and-rescue worker, specializing in cave reconnaissance. Two years ago, he rescued an experienced research crew in the Lechuguilla caves. The researchers had disappeared for eight days, and no one could find them. Ben went in alone and came out with a broken leg and the four crew members. He knows his caves. Almost a sixth sense.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t realize…\" She glanced at Ben, who was now playing cards with Jason. She sat there pondering the revelation.\u003c/p\u003e\n\u003cp\u003e\"Your file was just as impressive,\" the major said.\u003c/p\u003e\n\u003cp\u003e\"My file?\"\u003c/p\u003e\n\u003cp\u003e\"You seem to have an amazing ability to ferret out new discoveries in otherwise heavily researched sites.\"\u003c/p\u003e\n\u003cp\u003eShe just shrugged at his praise. The major seemed extraordinarily talkative. He\u0027d otherwise been so close-lipped and stoic. She turned to him. \"You sure as hell know a lot about us, but all I\u0027ve received were tickets and a schedule. I don\u0027t even know your first name.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Dennis,\" he said. \"Dr. Blakely plans a full debriefing at Alpha Base.\"\u003c/p\u003e\n\u003cp\u003eMajor Dennis Michaelson, she thought. With a first name, the major almost seemed human. She settled back in her seat. \"Where are you from, Dennis?\"\u003c/p\u003e\n\u003cp\u003e\"Nebraska. Our family\u0027s farm is just outside North Platte.\"\u003c/p\u003e\n\u003cp\u003e\"So why did you join the Marines?\"\u003c/p\u003e\n\u003cp\u003e\"My brother, Harry, and I joined together. He\u0027s a big motor buff-cars, bikes, drag racing, that sort of thing. He joined to get his hands dirty on even bigger engines. The guy was never happy unless his hands were filthy with oil. Always needing to tinker.\" An affectionate smile had appeared on Michaelson\u0027s face as he described his brother.\u003c/p\u003e\n\u003cp\u003e\"And what about you? What drew you away from the farm?\"\u003c/p\u003e\n\u003cp\u003e\"Partly to keep an eye on Harry. But also, as I said, our family farm\u0027s just outside North Platte. And North Platte is just outside of nowhere.\"\u003c/p\u003e\n\u003cp\u003e\"So you joined to see the world. And now here you are. Serving at the bottom of it.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said almost fiercely. \"And right now North Platte never looked so good.\"\u003c/p\u003e\n\u003cp\u003e\"So why not quit and go back to the farm?\"\u003c/p\u003e\n\u003cp\u003eHis face suddenly clouded over, black eyebrows pulling together. He shook his head but remained silent.\u003c/p\u003e\n\u003cp\u003eShe tried to extract more from him. \"How did you get hitched with such a dull assignment? Guarding a bunch of scientists.\"\u003c/p\u003e\n\u003cp\u003e\"I volunteered,\" he mumbled.\u003c/p\u003e\n\u003cp\u003eShe crinkled her nose. Not exactly the expected decision of a career military man. No prestige, no glory, stationed at the ass-end of the world. \"Why?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged his shoulders. \"I have my reasons.\" He unbuckled his seat belt and climbed out of the seat, grumbling about using the restroom.\u003c/p\u003e\n\u003cp\u003eAlone, she went back to studying the landscape passing below the skis of the aircraft. Sun reflected off the ice. The more she got to know her teammates, the less she seemed to understand them. But what else was new? She never understood people. Look at her marriage. A honeymoon that lasted eight years until one day she came home early from a dig-nauseated by morning sickness-and discovered her husband in their bed with his secretary. No warning signs. No lipstick on a collar. No blond hair on his jacket. Nothing. A mystery to her.\u003c/p\u003e\n\u003cp\u003eAshley placed a hand on her belly. Scott\u0027s infidelity was not the worst of it. She remembered the cramping pain and the rush of blood. The emotional overload from his betrayal had triggered a miscarriage. Losing the child had almost destroyed her. Only Jason, then seven years old, had kept her sane.\u003c/p\u003e\n\u003cp\u003eEven though years had passed, a part of her ached when she remembered how much she had lost. Not just the baby, but her faith in people. She refused to let herself be so gullible, so vulnerable again.\u003c/p\u003e\n\u003cp\u003eSlumping into her seat, she stared out the frosted window. Just at the edge of the horizon, a tower of smoke rose into the air, a dark signature against the blue sky. She sat up straighter. As the plane droned on, the source of the gray plume appeared, rising from the flat surface like some awakening giant. Mount Erebus.\u003c/p\u003e\n\u003cp\u003eThe interior of the Dodge van reeked of cigarette smoke and bounced in rough sync with the bass beat of a Pearl Jam cassette. A tired midday sun protruded wanly over the summit of Mount Erebus. The driver, a young Navy ensign, bobbed his head to the music. \"Almost home,\" he called over his shoulder. \"Just around the next ridge of ice.\" The road from Williams Field to McMurdo Base was a rough-hewn stretch of carved ice. With a final molar-jarring bump as they circled the ridge, Ashley viewed their destination.\u003c/p\u003e\n\u003cp\u003eShe swiped a glove over the steamed passenger window. The other team members were doing the same. Beside the blue ice shelf encasing the Ross Sea, McMurdo Base was a black smudge. An industrial complex of gray buildings dwarfed by a huge junkyard to the south. The van trundled past an ignited trash dump fuming oily smoke into the blue sky.\u003c/p\u003e\n\u003cp\u003eA Navy helicopter screamed over the van, the pressure and sound vibrating the windows. Jason covered his ears. The base buzzed with other helicopters. Ashley tapped the driver on the shoulder. \"Is it always this busy here?\"\u003c/p\u003e\n\u003cp\u003eThe driver gave her a thumbs-up sign. \"This is a slow day,\" he yelled.\u003c/p\u003e\n\u003cp\u003eShe leaned back into her seat. Great.\u003c/p\u003e\n\u003cp\u003eBlakely smiled. \"We\u0027ll only be stopping here for a couple of hours, then we\u0027ll proceed directly to Alpha Base. It\u0027s much quieter down there.\" He glanced wistfully out the window. \"Actually, after a year or so, you get accustomed to the commotion and smell up top here. I almost miss it.\"\u003c/p\u003e\n\u003cp\u003e\"Seems like a lot of pollution for a scientific station,\" Linda said with a grimace. \"These surrounding biocommunities are fragile.\"\u003c/p\u003e\n\u003cp\u003eBlakely shrugged. \"We\u0027ve been allocated a ten-million-dollar cleanup fund. It\u0027ll get better.\"\u003c/p\u003e\n\u003cp\u003e\"I sure hope so,\" Linda said.\u003c/p\u003e\n\u003cp\u003eThey were dropped off near a cement-block building. Ashley tightened her parka around her; the wind burned as it whipped across her cheeks. Frostbite could set in within mere minutes if unprotected. Her teammates dashed for the entryway. She made sure Jason was ahead of her. She didn\u0027t want him wandering off and getting lost.\u003c/p\u003e\n\u003cp\u003eWarmth. The interior was heated but felt humid and sticky, the pungent odor of sweat prevalent. Crinkling her nose, she noticed the hallway was lined with a rainbow of colored parkas hung on pegs.\u003c/p\u003e\n\u003cp\u003eBlakely directed them to hang up their parkas. \"Don\u0027t worry about them being stolen. To steal someone\u0027s coat is a hanging offense here.\"\u003c/p\u003e\n\u003cp\u003eAshley helped Jason off with his parka and hung it next to hers.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll only be stopping for lunch, then proceeding directly to Alpha Base,\" Blakely continued. \"The E-mess is at the end of this corridor. Help yourselves and unwind. We\u0027ll meet back here in two hours. There\u0027s also a recreation room with Ping-Pong and pool tables around the corner from E-mess. Enjoy yourselves.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/subterranean/page-6.html","bookId":1526,"creation":"Oct 5, 2019 10:30:23 PM","modification":"Oct 5, 2019 10:30:23 PM"}
