{"id":103739,"no":60,"title":"Page 60","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eKhalid pulled off his pack and opened it. He removed a length of climbing rope and tossed it to Linda. \"Tie the boy here.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" She dropped the rope, refusing.\u003c/p\u003e\n\u003cp\u003e\"He has three minutes left on the timer. I\u0027ll reset it once he\u0027s secure.\"\u003c/p\u003e\n\u003cp\u003e\"But why-\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re running out of time. Do it now!\"\u003c/p\u003e\n\u003cp\u003eLinda glanced at Jason\u0027s timer, then bent down and picked up the rope. \"I\u0027m sorry,\" she said as she positioned his back against the stone column.\u003c/p\u003e\n\u003cp\u003e\"Tie his hands behind his back first.\"\u003c/p\u003e\n\u003cp\u003eJason saw the worried look in her eyes as she knotted the rope around his wrists. He could tell she was on the verge of tears. This bothered Jason more than being tied up. \"It\u0027s okay,\" he whispered to her.\u003c/p\u003e\n\u003cp\u003eShe secured his waist to the column with the rope.\u003c/p\u003e\n\u003cp\u003e\"Make it tight. You\u0027ll use up precious seconds if I have to redo it.\"\u003c/p\u003e\n\u003cp\u003eLinda pulled the rope snug and tied a rapid knot. \"I\u0027m done.\" She sat back, her head hanging down. \"There,\" she said, anger sharpening her voice. \"Now reset the timer!\"\u003c/p\u003e\n\u003cp\u003eKhalid checked the knots and the tautness of the ropes. He then bent down and tapped at the credit-card-sized keyboard below the LED readout. The number now flashed 120. Jason had another two hours.\u003c/p\u003e\n\u003cp\u003e\"Why are you doing this?\" Linda asked.\u003c/p\u003e\n\u003cp\u003e\"Two reasons. First, the boy is slowing us down. And I have fifteen charges still to set. With your help, I can be done in less than two hours. The second reason is motivation. I won\u0027t return to reset his timer again until all fifteen charges are placed. This way you\u0027ll be encouraged to cooperate with the utmost speed.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll help you. I told you I would. There\u0027s no need for this.\"\u003c/p\u003e\n\u003cp\u003eHis next words were acid: \"Your word is shit.\"\u003c/p\u003e\n\u003cp\u003eShe remained silent.\u003c/p\u003e\n\u003cp\u003eJason saw Khalid grab two handkerchiefs and come toward him. He tried to shy away, but the ropes held him tight. Khalid shoved the heel of his hand into Jason\u0027s forehead, pinning the back of his skull to the rock column. He then balled up one of the handkerchiefs and forced it into Jason\u0027s mouth. Before Jason could try to spit it out, he secured the gag with the second handkerchief.\u003c/p\u003e\n\u003cp\u003eBy now, Linda was grabbing at Khalid\u0027s arm. \"Leave him alone!\"\u003c/p\u003e\n\u003cp\u003eKhalid elbowed her away, finishing his knot. \"I don\u0027t want this brat screaming as soon as we leave. It could draw those creatures back.\" He pointed at Jason\u0027s belt. It now read 116. \"We\u0027re wasting time.\"\u003c/p\u003e\n\u003cp\u003eLinda knelt by Jason. He tried to remain calm. She touched his cheek. \"I\u0027ll be back. I promise.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, forcing back the tears that threatened.\u003c/p\u003e\n\u003cp\u003eShe hugged him tight until Khalid pulled at her shoulder. \"Now!\"\u003c/p\u003e\n\u003cp\u003eLinda stood, and with a final squeeze on Jason\u0027s shoulder, she turned and followed Khalid. Jason watched them disappear out of sight behind him, then listened as their footsteps faded into the darkness. He was alone.\u003c/p\u003e\n\u003cp\u003eWith his helmet lamp slicing a path forward into the blackness, Ben led the way across the empty cavern floor, heading for the lights of Alpha Base. He was careful to stop frequently and listen. Even though he could not see them, he knew the three mimi\u0027swee hunters, armed with knives and spears, had fanned out to either side, watching for any signs of the crak\u0027an. They moved without lights and were as silent as phantoms. The only thing Ben could hear was the scrape of Harry\u0027s boots on the rock behind him.\u003c/p\u003e\n\u003cp\u003eBen switched his pistol to his other hand and wiped his palm on his trousers leg. The fires had heated up the cavern and the pall of smoke made it difficult to breathe. He licked at his cracked lips and removed his canteen, flipping the top with his thumb. Careful to no more than wet his mouth, he took a quick swig, then whispered to Harry, \"I expected lots of those monsters to be still around.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe the heat and the smoke are keeping them away.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like it. This is just too damned easy. One thing I\u0027ve learned when things look fine-shit happens!\"\u003c/p\u003e\n\u003cp\u003eHarry shrugged. \"Be careful what you wish for, buddy.\"\u003c/p\u003e\n\u003cp\u003eA noise to the right drew their attention. \"It\u0027s Nob\u0027cobi,\" Harry said. \"C\u0027mon. He\u0027s found something.\"\u003c/p\u003e\n\u003cp\u003eBen followed Harry\u0027s bouncing lantern across the uneven floor. Nob\u0027cobi was crouched by a steaming pile of dung. He had a fistful of it in front of his nose. He turned to Harry and spoke in hushed tones.\u003c/p\u003e\n\u003cp\u003eHarry translated. \"He says it\u0027s fresh.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s good.\" Ben crinkled his nose at the odor. \"I\u0027d hate to think it had spoiled.\"\u003c/p\u003e\n\u003cp\u003e\"He estimates it\u0027s less than an hour old. There\u0027s other spoor too. He\u0027s guessing that it\u0027s a group of at least five of them. Two of them male.\"\u003c/p\u003e\n\u003cp\u003e\"He can tell all that from sniffing shit?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s their job.\"\u003c/p\u003e\n\u003cp\u003e\"What should we do, then? Circle away from them?\"\u003c/p\u003e\n\u003cp\u003eHarry knelt and conversed in whispers with Nob\u0027cobi. The other two hunters stood yards away, scanning the periphery, ears twitching forward and back. Finally Harry stood and returned to Ben. \"The plan is to follow the group. They seem to be aiming for the base. The crak\u0027an travel in tight pods. As they march, any stragglers they encounter will either join the pod or be killed by them. So the wake of this pod should be relatively free of stray beasts.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" Ben mumbled, kicking at the pile of damp spoor, \"but if they turn back this way, we become crak\u0027an shit ourselves.\"\u003c/p\u003e\n\u003cp\u003eKhalid watched Linda closely, making sure she set the wires correctly. Good. She was learning. This was the ninth charge. She had set the last three after he demonstrated with the first two. This time, her hands hardly shook.\u003c/p\u003e\n\u003cp\u003eAs he finished his charge, he watched as she furtively glanced at her watch. He knew it was still another hour before Jason\u0027s timer ran out, and with only six more charges to set, they were making good time. \"Now push the yellow button on the transceiver,\" he said to her, pointing over her shoulder. \"Good, now it\u0027s activated and awaiting my signal.\"\u003c/p\u003e\n\u003cp\u003eAs they neared the base, Ben could see the pod of crak\u0027an through the darkness, their triangular heads and bristled crests outlined by the lights of the camp, now just yards away.\u003c/p\u003e\n\u003cp\u003eThe pod totaled seven-two more had joined the group during the hour of travel to the base. Led by the larger of the two males, the pod of females traveled in a loose array, or \"harem,\" as Harry described it. The smaller male, nicknamed \"Tiny Tim,\" trailed them. He seemed to be guarding the pod\u0027s backside and frequently turned and ventured a ways behind the pod. He seemed to sense that something was amiss, frequently whirling back, scenting the air behind the group.\u003c/p\u003e\n\u003cp\u003e\"Edgy son of a bitch,\" Harry whispered in Ben\u0027s ear as he crouched behind a boulder next to him.\u003c/p\u003e\n\u003cp\u003eBen nodded, wary of even speaking, fearful of attracting the beast\u0027s attention. The journey had been tense. During the trek, the pod had encountered a solitary belligerent male. It was attacked by the group in a sharklike frenzy and torn to meaty ribbons.\u003c/p\u003e\n\u003cp\u003eRemembering the sight, Ben shivered. Out here in the middle of the open cavern floor, there were few places to hide. If they should attract the pod\u0027s attention… He shook his head, forcing the image from his mind.\u003c/p\u003e\n\u003cp\u003eHe peeked around the boulder. He could see that the pod was just now entering the periphery of the base, fading into the shadows of the remaining buildings.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s clear,\" Harry said softly, waving to the trio of mimi\u0027swee hunters. \"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eBen stood from his crouch and stepped to follow Harry. As he rounded the boulder, his foot slipped in an unseen hole and he fell. As his pistol struck the rocky floor, he saw the flash of muzzle fire from its barrel, and an explosive shot rang out across the cavern.\u003c/p\u003e\n\u003cp\u003eChrist, Ben thought, so much for a quiet entrance.\u003c/p\u003e\n\u003cp\u003eHe watched as a reptilian snout reemerged from the shadows of the base ahead, darting back and forth, searching. Tiny Tim stepped back out into the light.\u003c/p\u003e\n\u003cp\u003eJason squirmed in his ropes as the gunshot echoed across the cavern. He chewed at his gag, but he couldn\u0027t even move his tongue, and breathing through his mouth was all but impossible. He pulled deeply through his nose, panicked that he couldn\u0027t get enough air. Around him, shadows danced in the flickering light.\u003c/p\u003e\n\u003cp\u003eHis first thought was that Khalid had shot Linda, and his heart pounded in his chest. Then a volley of gunfire from an automatic weapon echoed across the cavern. It wasn\u0027t Khalid! He struggled again with his gag. Maybe he could work free of it, call to whoever it was for help.\u003c/p\u003e\n\u003cp\u003eMore gunfire erupted.\u003c/p\u003e\n\u003cp\u003eWas it coming closer? He listened. Blood thundered in his ears, making it hard to judge.\u003c/p\u003e\n\u003cp\u003eMore blasts.\u003c/p\u003e\n\u003cp\u003eYes! He struggled more frantically. Then a thought occurred to him and he froze.\u003c/p\u003e\n\u003cp\u003eWhat were they firing at?\u003c/p\u003e\n\u003cp\u003eBen slammed into the entryway of one of the few concrete buildings still standing. Nob\u0027cobi pounced in behind him, breathing hard. A quick scan revealed the building to be a dormitory-cots lined both walls. But Ben ignored the room and took a quick peek back out the entryway. He saw the tail of one of the crak\u0027an disappear around the far corner.\u003c/p\u003e\n\u003cp\u003eGood. Luckily, it had been one of the slower females that had pursued them. A few quick moves and they had lost her. But what about Harry? Had he made it to the base?\u003c/p\u003e\n\u003cp\u003eVolleys of automatic fire flared to the south.\u003c/p\u003e\n\u003cp\u003eBen clenched a fist. Okay, at least he was still alive and fighting. He considered his options, rubbing at his forehead. He could try to make it to Harry, but it would be damned difficult to find him. Or he could try to get to Blakely\u0027s office and retrieve the statue. That was the wisest plan, but he hated leaving Harry and the other hunters on their own.\u003c/p\u003e\n\u003cp\u003eStill, what could he do? His one pistol would be little help. No, he\u0027d just have to hope Harry and the others could manage. Besides, Harry knew the base well and knew where Ben would be heading.\u003c/p\u003e\n\u003cp\u003eHe pushed open the door of the building, leaned out, and took a moment to get his bearings. Spotting the elevator shaft off to the left, and the lake just past a set of trampled tents, he centered himself. Okay, he knew roughly where he was. Blakely\u0027s office was less than half a mile away. That\u0027s if the bridge spanning the gorge that split the camp was still intact. If he had to circle around the huge crevice, then it would be more like two miles. And with those bloody crak\u0027an creeping around, he wanted the shortest route possible. \u003c/p\u003e","sourceLink":"https://allnovel.net/subterranean/page-60.html","bookId":1526,"creation":"Oct 5, 2019 10:30:23 PM","modification":"Oct 5, 2019 10:30:23 PM"}
