{"id":104770,"no":16,"title":"Page 16","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBoom. . . boom . . . boom . . .\u003c/p\u003e\n\u003cp\u003eOff to the north, a resounding blast cast up a gout of smoke and flame, coming from the township. Close enough to rattle the Land Rover\u0027s windows.\u003c/p\u003e\n\u003cp\u003e\"Telstra substation,\" Graff said. \"They\u0027re cutting off all means of communication.\"\u003c/p\u003e\n\u003cp\u003eOther sections of The Settlement were already burning.\u003c/p\u003e\n\u003cp\u003eThese were no ordinary pirates. It was a full-on assault.\u003c/p\u003e\n\u003cp\u003eWho the hell were they?\u003c/p\u003e\n\u003cp\u003eMonk shifted back into gear and headed away from the township, along the coastal road.\u003c/p\u003e\n\u003cp\u003e\"Where are you—?\" Graff began to ask.\u003c/p\u003e\n\u003cp\u003eMonk rounded a bend. A small beachside hotel, isolated within a couple of tamed acres of rain forest, appeared ahead. Monk took a sharp turn at a sign that read the mango lodge and grille. He sped down the entry road. The hotel rose into view, a two-story building that dissolved into a few freestanding jungle bungalows. A swimming pool glistened.\u003c/p\u003e\n\u003cp\u003eThe place appeared deserted.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be safe here,\" Monk said as he braked to a stop at the side of the hotel under the shielding bower of the lodge\u0027s namesake, a mango tree.\u003c/p\u003e\n\u003cp\u003eMonk hopped out.\u003c/p\u003e\n\u003cp\u003e\"Wait!\" Graff struggled with his door, finally fighting it open. He all but fell out of the Land Rover. He chased Monk down.\u003c/p\u003e\n\u003cp\u003eMonk did not slow. He half trotted toward the beach. Like all seaside hotels, the Mango Lodge and Grille offered all the activities a beachcomber might want: snorkeling, kayaking, sailing. At the rear of the establishment, Monk spotted the hotel\u0027s activities center, a small cinder-block outbuilding with a thatched roof. It was boarded-up because of the evacuation.\u003c/p\u003e\n\u003cp\u003eOn the fly, Monk snatched up a pole used to clean the pool. In no time, he was prying boards free and smashing through the glass door.\u003c/p\u003e\n\u003cp\u003eGraff caught up with him.\u003c/p\u003e\n\u003cp\u003eMonk reached out and hauled the researcher inside, out of the sun. The helicopter roared past overhead, low, its rotor wash whipping palm fronds. Then it swept away, continuing its patrol of the shoreline.\u003c/p\u003e\n\u003cp\u003e\"Keep out of sight!\" Monk warned.\u003c/p\u003e\n\u003cp\u003eGraff nodded vigorously.\u003c/p\u003e\n\u003cp\u003eMonk stalked through the front of the activities center, packed with beach towels, sunglasses, suntan oils, and a host of souvenirs. The place smelled of coconut and damp feet. Monk circled the counter and proceeded through a doorway draped in rattling beads.\u003c/p\u003e\n\u003cp\u003eHe found what he was looking for.\u003c/p\u003e\n\u003cp\u003eScuba gear hung along the back wall.\u003c/p\u003e\n\u003cp\u003eMonk kicked off his boots.\u003c/p\u003e\n\u003cp\u003eOn the beach side of the room, lined up before a roll-up door, rested a variety of crafts for fun in the sun. Monk bypassed the paddleboats, a pair of kayaks, and stopped before the lone Jet Ski watercraft. It rested on a wheeled trailer, ready for easy hauling to and from the water,\u003c/p\u003e\n\u003cp\u003eAt least the seas on this side of the island were clean of that toxic soup.\u003c/p\u003e\n\u003cp\u003eMonk turned to Graff. \"I\u0027m going to need your help.\"\u003c/p\u003e\n\u003cp\u003eEighteen minutes later, Monk rubbed his elbow across the grease-stained window in the roll-up door. His wet suit squeaked against the glass. Craning his neck, Monk waited for the helicopter to circle by overhead and swing back north toward Flying Fish Cove. The cove lay out of direct sight, hidden by Smith Point. All that Monk could make out of the war zone was the smudged pall of smoke rising over the ridgeline.\u003c/p\u003e\n\u003cp\u003eAt last, the helicopter turned tail and headed back toward the cruise ship.\u003c/p\u003e\n\u003cp\u003e\"Okay, here we go!\"\u003c/p\u003e\n\u003cp\u003eMonk bent down and hauled the door up, snapping it into place overhead. Behind him, Graff lifted the trailer hitch, and Monk swung around to the front. He grabbed the back of the Jet Ski, and together they ran the trailer down to the water. The large rubber sand tires made it quick work.\u003c/p\u003e\n\u003cp\u003eGraff worked one arm to loosen the craft from the trailer while Monk ran back and hauled on his BC vest and tanks. Once outfitted, he slipped a souvenir Mango Lodge windbreaker over all his equipment.\u003c/p\u003e\n\u003cp\u003eHeavily burdened, Monk plodded back to the water and helped float the Jet Ski off its trailer. \"Stay hidden,\" he instructed Graff. \"But if you can find some means of communication, a radio or anything, try to raise someone in authority.\"\u003c/p\u003e\n\u003cp\u003eGraff nodded. \"Be careful.\"\u003c/p\u003e\n\u003cp\u003eIn another minute Monk was gunning the engine to a high whine and racing off toward Smith Point. Behind him, Graff trotted the empty trailer back to its garage.\u003c/p\u003e\n\u003cp\u003eMonk bent lower in the seat and cranked the craft to full throttle. Flying faster, the windbreaker snapped in the breeze. Sea and salt sprayed. Smith Point grew in front of him. At last, he reached the rocky spur and, without slowing, sped around it.\u003c/p\u003e\n\u003cp\u003eOn the far side of the cove, the Mistress of the Seas rose like a besieged white castle. Closer still, the waters burned with spills of flaming oil and smoking husks of ships. Even the jetty was a blasted ruin. And throughout the war zone, the roar of the pirates\u0027 speedboats growled.\u003c/p\u003e\n\u003cp\u003eOn the hunt.\u003c/p\u003e\n\u003cp\u003eHere we go.\u003c/p\u003e\n\u003cp\u003eLike a skimming torpedo, Monk shot into the fray.\u003c/p\u003e\n\u003cp\u003e2:o8 P.M.\u003c/p\u003e\n\u003cp\u003e\"There must be something we can do,\" Lisa said-\u003c/p\u003e\n\u003cp\u003e\"For now, we sit tight,\" Henri Barnhardt warned.\u003c/p\u003e\n\u003cp\u003eThey were holed up in one of the empty outside cabins. Lisa stood near one of the room\u0027s two portholes. Henri took a post by the door.\u003c/p\u003e\n\u003cp\u003eAn hour ago they had fled through the ship, only to discover the place in full chaos. Uniformed crew and wild-eyed passengers, both the sick and the healthy, crowded the hallways. Explosions and gunfire were almost drowned out by the nerve-rattling klaxon of the ship\u0027s alarm bell. Whether automated or purposeful, someone had tripped the ship\u0027s fire doors, dropping them, isolating sections.\u003c/p\u003e\n\u003cp\u003eMeanwhile masked gunmen cleared the halls, one after the other, shooting anyone who resisted or moved too slowly. Lisa and Henri had heard the screams, the gunfire, the trampling feet from the deck above. They came close to being shot themselves. Only a swift race through the ship\u0027s gilded showroom and down another hallway had saved them.\u003c/p\u003e\n\u003cp\u003eThey did not know how much longer they could hold out.\u003c/p\u003e\n\u003cp\u003eThe rapidity of the takedown of the Mistress of the Seas suggested some of the crew must have been involved.\u003c/p\u003e\n\u003cp\u003eLisa stared out the porthole window. The sea was on fire. From this same window, she had watched a handful of desperate passengers leap from upper balconies into the waters, hoping to make it to shore.\u003c/p\u003e\n\u003cp\u003eBut the gunboats swept the cove, peppering and strafing the water.\u003c/p\u003e\n\u003cp\u003eBodies floated amid the flaming debris.\u003c/p\u003e\n\u003cp\u003eThere was no escape.\u003c/p\u003e\n\u003cp\u003eWhy was this happening? What was going on?\u003c/p\u003e\n\u003cp\u003eFinally, the alarm klaxon went silent, cutting off with a final whining squelch. The silence that remained felt heavy, a physical weight. Even the air seemed thicker.\u003c/p\u003e\n\u003cp\u003eSomewhere above someone sobbed and wailed.\u003c/p\u003e\n\u003cp\u003eHenri met Lisa\u0027s eyes.\u003c/p\u003e\n\u003cp\u003eFrom the room\u0027s speaker a stiff voice began speaking in Malay. Lisa didn\u0027t speak the Malaysian language. Still staring at Henri, she watched the toxicologist shake his head. He was just as lost. But whatever was said was eventually repeated in Mandarin Chinese. They were the two most common languages spoken on the island.\u003c/p\u003e\n\u003cp\u003eFinally, the speaker switched to English, heavily accented.\u003c/p\u003e\n\u003cp\u003e\"The ship is now ours. Each deck is patrolled by guards. Anyone caught out in the halls will be shot on sight. No one will come to harm as long as we are obeyed. That is all.\"\u003c/p\u003e\n\u003cp\u003eThe speech ended with a snap of static.\u003c/p\u003e\n\u003cp\u003eHenri tested to make sure the cabin door was locked, then stepped toward Lisa. \"The ship\u0027s been hijacked. Someone must have been planning this for some time.\"\u003c/p\u003e\n\u003cp\u003eLisa flashed back to the Achille Lauro, an Italian cruise ship hijacked by Palestinian terrorists back in 1985. And more recently in 2005, Somalian pirates attacked another cruise ship off the east African coast.\u003c/p\u003e\n\u003cp\u003eShe turned to the porthole, staring out, and studied the boats patrolling the waters below, operated by teams of masked gunmen. They appeared to be pirates, but she suspected otherwise.\u003c/p\u003e\n\u003cp\u003eMaybe some of Painter\u0027s paranoia had rubbed off on her.\u003c/p\u003e\n\u003cp\u003eThis was all too coordinated for a random act of piracy.\u003c/p\u003e\n\u003cp\u003e\"Surely,\" Henri said, \"they\u0027ll ransack the ship and steal everything not locked down, then flee back among the islands. If we can keep alive, avoid any confrontation . . .\"\u003c/p\u003e\n\u003cp\u003eThe speaker screeched again, and a new voice spoke through the general shipboard communications. In English. It didn\u0027t repeat in Malay or Chinese.\u003c/p\u003e\n\u003cp\u003e\"The following passengers will report to the ship\u0027s bridge. They will be expected here in the next five minutes. They will come with their hands on their heads, fingers clasped. Failure to appear will result in the death of two passengers for every minute you are late. We will shoot the children first.\"\u003c/p\u003e\n\u003cp\u003eThe names were stated.\u003c/p\u003e\n\u003cp\u003eDr. Gene Lindholm.\u003c/p\u003e\n\u003cp\u003eDr. Benjamin Miller.\u003c/p\u003e\n\u003cp\u003eDr. Henri Barnhardt.\u003c/p\u003e\n\u003cp\u003eAnd last: Dr. Lisa Cummings.\u003c/p\u003e\n\u003cp\u003e\"You have five minutes.\"\u003c/p\u003e\n\u003cp\u003eThe radio went silent again.\u003c/p\u003e\n\u003cp\u003eLisa still faced the porthole. \"This is no hijacking.\"\u003c/p\u003e\n\u003cp\u003eAnd these were no ordinary pirates.\u003c/p\u003e\n\u003cp\u003eBefore she turned away from the window, she spotted a Jet Ski racing across the water toward the cruise ship. A rooster tail of water jetted high behind it, making it easy to spot. It weaved through the debris with skill. She could not make out who was aboard the craft. The rider was hunkered low.\u003c/p\u003e\n\u003cp\u003eAnd with good reason.\u003c/p\u003e\n\u003cp\u003eTwo speedboats were in tight pursuit, crashing through flames and smoking planks. Muzzle flashes sparked from the boat.\u003c/p\u003e\n\u003cp\u003eShe shook her head at the Jet Skier\u0027s foolishness.\u003c/p\u003e\n\u003cp\u003eFrom over the top of the cruise ship, a helicopter dove into view, sweeping down toward the Jet Ski. She didn\u0027t want to watch, but she felt some obligation. Some acknowledgment of the rider\u0027s suicidal assault.\u003c/p\u003e\n\u003cp\u003eThe helicopter tilted in a sharp arc, side door open.\u003c/p\u003e\n\u003cp\u003eA blast of smoke spat from its interior.\u003c/p\u003e\n\u003cp\u003eGrenade launcher.\u003c/p\u003e\n\u003cp\u003eWincing, Lisa glanced down in time to see the Jet Ski explode in a fiery ball of smoke and charred metal.\u003c/p\u003e\n\u003cp\u003eShe swung away, numb and trembling all over. She faced Henri. They had no other choice.\u003c/p\u003e\n\u003cp\u003eLet\u0027s go.\u003c/p\u003e\n\u003cp\u003e2:12 P.M.\u003c/p\u003e\n\u003cp\u003eMonk sank into the depths of the sea, dragged down by his weight belt and tanks. He did not fight it and held his breath. Overhead, the blue of the water blazed with fire. Shrapnel from the blasted Jet Ski sizzled through the water. Two meters away, the watercraft sank nose first into the depths. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-16.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
