{"id":104778,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not necessarily true,\" Devesh countered cryptically.\u003c/p\u003e\n\u003cp\u003eHenri focused back to their captor.\u003c/p\u003e\n\u003cp\u003e\"My employers and I believe this is not the first outbreak of this Judas Strain. There are historical reports from the region of a similar outbreak. Back almost a millennium ago.\" His voice lowered to a contemplative whisper. \"The stories were accompanied by some strange and disturbing claims.\"\u003c/p\u003e\n\u003cp\u003e\"What historical reports are you talking about?\" Lisa asked.\u003c/p\u003e\n\u003cp\u003eDevesh waved away her question. \"It doesn\u0027t matter. We\u0027ve got others looking into that question, following that historical trail. We must stay focused on our goal. Our mission aboard the ship lies not in the past, but the present. My employers orchestrated the evacuation of the island, arranged to have Mr. Blunt\u0027s cruise ship detoured here. We needed to isolate the currently infected in one place. Here we have the rare opportunity to study how this disease unfolds. Its epidemiology, its pathology, its physiologic effects. And we\u0027ve a full shipload of test subjects.\"\u003c/p\u003e\n\u003cp\u003eLisa backed away a step, unable to mask her horror.\u003c/p\u003e\n\u003cp\u003eDevesh leaned on his cane. \"I sense your distaste, Dr. Cummings. Now you understand why the Guild had to act. When faced with an organism of such virulence, there could be no hand-wringing. No politically correct response to such an onslaught. Action must be swift, and hard choices made. In Tuskegee, did not your own government allow people infected with syphilis to die of the disease while scientists dispassionately recorded the suffering, the advancing symptoms, and the eventual deaths? To survive this, we must be as brutal and cold. Because, believe me, this is a war for the survival of the human species.\"\u003c/p\u003e\n\u003cp\u003eLisa sought some counter to his words, too shocked.\u003c/p\u003e\n\u003cp\u003eHenri interceded, but not in the manner Lisa had expected. \"He\u0027s right.\"\u003c/p\u003e\n\u003cp\u003eLisa turned to the toxicologist.\u003c/p\u003e\n\u003cp\u003eHenri\u0027s eyes remained locked on the screen depicting the microscopic image of the Judas Strain. \"This is a planet killer. And it\u0027s already loose. Remember how fast the bird flu circled the world. We have a week, possibly only days. If we don\u0027t find a way to stop it, all life—at least all higher life—will be wiped off the earth.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad we have a meeting of the minds,\" Devesh said with a bow of his head in Henri\u0027s direction. His eyes found Lisa\u0027s. \"And possibly when I show Dr. Cummings here her role in our endeavor, she may also find the same such enlightenment.\"\u003c/p\u003e\n\u003cp\u003eLisa frowned at his puzzling statement.\u003c/p\u003e\n\u003cp\u003eDevesh swung away toward the door. \"But first we must join your friends up in the radio room. We have some fires to put out.\"\u003c/p\u003e\n\u003cp\u003e7:02 A.M Washington, D. C.\u003c/p\u003e\n\u003cp\u003ePainter stared at the news reports on his three plasma screens: Fox, CNN, NBC. All reporting on the blast near Georgetown.\u003c/p\u003e\n\u003cp\u003e\"So everything is fine,\" Painter said, standing behind his desk. He held the earpiece more firmly in place. Lisa\u0027s voice was faint, traveling from halfway around the world. \"You scared Jennings in R and D. He was just about ready to have the island firebombed.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry for the false alarm,\" Lisa said. \"It was nothing more than laboratory contamination. Everything is fine here ... or at least as fine as a shipload of burned patients might be. The initial conjecture is a bloom of something called fireweed. It\u0027s been plaguing these waters for years, spews off a corrosive pall, clearing beaches. This was just a perfect storm of the weed. The matter should be resolved in the next day or so, then Monk and I will head back.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the first bit of good news I\u0027ve heard all day,\" Painter replied.\u003c/p\u003e\n\u003cp\u003eHis eyes kept flickering back to the plasma screens on his walls. They showed the fires being finally put out in the woods behind the safe house. Fire trucks arced water from engines parked along the forest\u0027s fire road.\u003c/p\u003e\n\u003cp\u003eLisa whispered in his ear. \"I know you\u0027re busy. I\u0027ll report in again in another twelve hours as scheduled.\"\u003c/p\u003e\n\u003cp\u003e\"Great. You get some sleep. I imagine the sunsets out there must be beautiful.\"\u003c/p\u003e\n\u003cp\u003e\"They are. I... I wish you were here to enjoy them with me.\"\u003c/p\u003e\n\u003cp\u003e\"Me, too. But it won\u0027t be much longer until you\u0027re back. And right now I have a fire of my own to put out.\"\u003c/p\u003e\n\u003cp\u003eOn the screen a news helicopter swung away to reveal the charred remains of the safe house for the morning news. He had already heard the report from the arson investigators. Tire tracks in the backyard had led to the discovery of an abandoned Thunderbird, the same convertible in which Gray had arrived on the scene a couple hours ago. It seemed he had not fled to the streets, but into the woods. But where did he go after that? There had still been no sign of Gray, his parents, or the wounded Guild operative.\u003c/p\u003e\n\u003cp\u003eWhere had they gone into hiding?\u003c/p\u003e\n\u003cp\u003e\"I have work here, too,\" Lisa said.\u003c/p\u003e\n\u003cp\u003e\"Is there anything you need?\"\u003c/p\u003e\n\u003cp\u003e\"No . . .\"\u003c/p\u003e\n\u003cp\u003eHe heard a hesitation in her voice. \"Lisa? What is it?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing.\" She snapped a bit. \"I guess I\u0027m just tired. You know how I get this time of the month.\"\u003c/p\u003e\n\u003cp\u003eHis aide Brant wheeled into the office with a sheaf of faxes in hand. He noted the letterhead of the top. Washington PD. It was another of the progress reports of their canvass of the local hospitals. He spoke as he accepted the papers from Brant.\u003c/p\u003e\n\u003cp\u003e\"Then make sure you get some rest,\" he said, already reading the first line on the report. \"You just stay safe and don\u0027t forget the sunblock. I can\u0027t have you making me look like some ghost next to your island tan.\"\u003c/p\u003e\n\u003cp\u003e\"Will do.\" Lisa\u0027s voice had faded to the barest whisper. The ship\u0027s satellite connection was spotty. Still, he heard the disappointment in her voice. He missed her, too.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see you soon,\" he finished. \"Talk to you in another half day. Now go get some sleep.\"\u003c/p\u003e\n\u003cp\u003eThe line died without further word. He removed the earpiece and settled to his desk. Prioritizing, he shifted the pile of reports in front of him. He would scan them, then pass on the all clear to Jennings.\u003c/p\u003e\n\u003cp\u003eAt least, one catastrophe had been put to bed.\u003c/p\u003e\n\u003cp\u003e6:13 P.M.\u003c/p\u003e\n\u003cp\u003eAt sea\u003c/p\u003e\n\u003cp\u003eLisa lowered the telephone handset. Her heart thudded heavily in her chest. The line had been cut off at a signal from Devesh Patanjali. He stood in the doorway to the ship\u0027s state-of-the-art communication shack, bracing both palms on his cane.\u003c/p\u003e\n\u003cp\u003eHe shook his head, displaying his disappointment.\u003c/p\u003e\n\u003cp\u003eLisa\u0027s stomach churned uneasily. Did he know what she had attempted? She rose from her seat beside the radioman. One of the guards grabbed her elbow.\u003c/p\u003e\n\u003cp\u003e\"All you had to do was stick to the script, Dr. Cummings,\" Devesh said, his voice thick with exasperation. \"It was a simple request, and the consequences were duly explained to you.\"\u003c/p\u003e\n\u003cp\u003ePanic iced Lisa\u0027s blood. \"I... I followed your script. I didn\u0027t say anything out of turn. Painter thinks everything is fine. Just like you ordered.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Lucky for that. But don\u0027t think your attempt at subtle communication, a hidden context, escaped me.\"\u003c/p\u003e\n\u003cp\u003eOh God. . . She had taken a chance during the phone conversation. Surely he couldn\u0027t know. \"I don\u0027t understand—\"\u003c/p\u003e\n\u003cp\u003e\" \u0027You know how I get this time of the month,\u0027 \" Devesh quoted her, cutting her off. He turned and headed out the door to the hallway. \"In fact, you finished your cycle ten days ago, Dr. Cummings.\"\u003c/p\u003e\n\u003cp\u003eAn icy numbness spread through her.\u003c/p\u003e\n\u003cp\u003e\"We have a full dossier on you, Dr. Cummings. Which I\u0027ve read. And my memory is eidetic. Photographic. I encourage you not to underestimate my resources again.\"\u003c/p\u003e\n\u003cp\u003eThe guard manhandled her out of the room. She stumbled along.\u003c/p\u003e\n\u003cp\u003eShe had been a fool to try to secretly communicate with Painter, no matter how subtly.\u003c/p\u003e\n\u003cp\u003eWhat have I done?\u003c/p\u003e\n\u003cp\u003eOut in the passageway, other key captives stood lined up in the hall: Dr. Lindholm, Ryder Blunt, and an Aussie captain in a bloody khaki uniform. All of them had called their respective agencies, reporting all was well and under control at the remote island, whitewashing the scenario, buying the hijackers time to add distance between ship and island before anyone grew wiser.\u003c/p\u003e\n\u003cp\u003eBut there were also others gathered in the hall. Four children cowered at the back of the passageway. Boys and girls. Ages six to ten. One for each of those sent into the radio room. Each child\u0027s life was balanced upon their cooperation. Lisa had been assigned a little girl, eight years old, with large almond eyes, terrified, huddled on the floor, hugging her knees to her chest. Her brother, a couple years older, kept an arm around her.\u003c/p\u003e\n\u003cp\u003eThe Maori leader stepped over to the child, pistol in hand.\u003c/p\u003e\n\u003cp\u003eDevesh joined him and faced back to the group, a fist resting on his hip. \"You were all warned if you strayed from the script in any significant regard, attempted any subterfuge, there would be consequences. But as this is Dr. Cummings\u0027s first mistake, I\u0027ll be lenient with her.\"\u003c/p\u003e\n\u003cp\u003e\"Please,\" Lisa begged. She could not bear the child\u0027s blood on her hands. In the radio room, she had reacted instinctively. It had been a stupid ploy.\u003c/p\u003e\n\u003cp\u003eDevesh\u0027s gaze settled to her. \"Instead of the little girl, Dr. Cummings, I\u0027ll let you choose another child to die in her place.\"\u003c/p\u003e\n\u003cp\u003eLisa\u0027s breath caught in her chest.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not a cruel man, only practical. This is a lesson all of you must take to heart.\" He waved to Lisa. \"Pick a child.\"\u003c/p\u003e\n\u003cp\u003eLisa shook her head. \"I can\u0027t. . .\"\u003c/p\u003e\n\u003cp\u003e\"Choose or I\u0027ll have them all shot. Let this be a lesson to everyone. We have too much to accomplish to tolerate insubordination, no matter how slight.\"\u003c/p\u003e\n\u003cp\u003eThe guard dragged her forward at a signal from his tattooed leader.\u003c/p\u003e\n\u003cp\u003e\"Choose a child, Dr. Cummings.\"\u003c/p\u003e\n\u003cp\u003eLisa bit back a sob, staring at the four children\u0027s faces. None spoke English, but they must have read something in her face, understood her agony, and it scared them. Fresh tears flowed. They all hunched tighter.\u003c/p\u003e\n\u003cp\u003eLisa caught Devesh\u0027s eyes, pleading with him. \"Please, Dr. Patanjali. It was my mistake. Punish me.\"\u003c/p\u003e\n\u003cp\u003e\"I believe that is exactly what I\u0027m doing.\" He stared back at her, unmoved. \"Now pick.\"\u003c/p\u003e\n\u003cp\u003eLisa stared across the four faces. She could not pick little the girl or her \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-25.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
