{"id":104780,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSeichan had sounded relieved. \"Then we don\u0027t have much time. Many lives are in jeopardy. If you could gather your resources, figure out what—\"\u003c/p\u003e\n\u003cp\u003e\"I know what the inscription means, Seichan,\" Vigor had scolded, cutting her off. \"And I know what it implies. If you want to know more, you\u0027ll both meet me at Hotel Ararat in Istanbul. I\u0027ll be there seven in the morning. At the rooftop restaurant.\"\u003c/p\u003e\n\u003cp\u003eAfter the call, Seichan had hurriedly arranged false papers and coordinated their transportation. She had assured him the Guild knew nothing of her contacts. \"Just favors owed,\" she had explained.\u003c/p\u003e\n\u003cp\u003eSeichan twisted with a wince to face him, drawing him back to the present. Her elbow bumped her cup of tea. Gray caught it before it went tumbling to the street below. She stared at the jostled cup with the slightest pinch of concern at the corner of her eyes. Gray suspected such carelessness was rare for this woman, someone always in control.\u003c/p\u003e\n\u003cp\u003eJust as quickly, her expression hardened again.\u003c/p\u003e\n\u003cp\u003e\"I know I\u0027ve kept you in the dark,\" she said. \"Once Monsignor Verona arrives, I will explain everything.\" She nodded toward him. \"But what about you? Did you make any headway with the obelisk\u0027s writing?\"\u003c/p\u003e\n\u003cp\u003eHe merely shrugged, letting her think he knew something.\u003c/p\u003e\n\u003cp\u003eShe stared—then sighed. \"Fine.\"\u003c/p\u003e\n\u003cp\u003eShe returned to their table.\u003c/p\u003e\n\u003cp\u003eSeichan had supplied Gray with photographs and a printed copy of the angelic script. En route here, he had attempted to break whatever code was locked within the script, but there were too many variables. He needed more information. And besides, Gray suspected he already knew the message of the code: break open the obelisk and find the treasure inside.\u003c/p\u003e\n\u003cp\u003eThey\u0027d already done that.\u003c/p\u003e\n\u003cp\u003eGray wore the silver crucifix on a cord around his neck. He had already examined it. It was definitely old, well worn. Even under a magnifying lens, he could discern no writing, no clues of any significance that would confirm Seichan\u0027s wild claim that the cross once belonged to the confessor of Marco Polo, the world traveler and explorer.\u003c/p\u003e\n\u003cp\u003eAlone at the railing, Gray studied the city, already bustling in the early morning. Below, buses competed with cars and pedestrians. The bleat of horns attempted to drown out the sharper cries of hawkers and the continual babble of early-morning tourists.\u003c/p\u003e\n\u003cp\u003eHe searched the immediate vicinity, watching for any sign of threat or suspicious approach. Had they shaken Nasser? Having put half the world between them, Seichan seemed confident. But Gray refused to let his guard down. Below, in the hotel\u0027s courtyard, a pair of men rose from beaded blankets, finished with their morning prayers, and vanished back into the hotel. Alone now, a child splashed absently in the lobby fountain.\u003c/p\u003e\n\u003cp\u003eSatisfied, Gray allowed his gaze to shift momentarily higher. Hotel Ararat stood in the heart of Istanbul\u0027s oldest district, the Sultanahmet. All the way to the sea, ancient structures rose like islands from the muddle of the lower streets. Right across from the hotel, the lofty domes of the Blue Mosque climbed into the sky. Farther down the street, a massive Byzantine church stood half swallowed by black scaffolding, as if the ironwork sought to clutch the structure to the earth\u0027s bosom. And beyond the scaffolding, the Topkapi Palace sprawled amid courtyards and gardens.\u003c/p\u003e\n\u003cp\u003eGray felt the weight of ages in these grand architectural masterpieces, stone monuments of history. His fingers absently fingered the cross around his neck. Here was another piece of antiquity, its provenance ripe with historical significance. But what did it have to do with Seichan\u0027s global threat? A cross that once belonged to Marco Polo\u0027s priest?\u003c/p\u003e\n\u003cp\u003e\"Hey, Ali Baba,\" Kowalski called out behind him. \"One more of these licorice drinks.\"\u003c/p\u003e\n\u003cp\u003eGray bit back a groan.\u003c/p\u003e\n\u003cp\u003e\"It is called raki,\" a new voice corrected, full of professorial authority.\u003c/p\u003e\n\u003cp\u003eGray turned. A familiar and welcome figure stepped from the shadowed stairway onto the rooftop terrace. Monsignor Vigor Verona spoke in Turkish to the tea waiter, polite, apologetic. \"Bir sise raki lutfen.\"\u003c/p\u003e\n\u003cp\u003eThe waiter nodded with a smile and stepped away.\u003c/p\u003e\n\u003cp\u003eVigor approached their table. Gray noted the lack of Roman collar around the man\u0027s neck. Plainly the monsignor was traveling incognito. Free of the collar, Vigor appeared a decade younger than his sixty years. Or maybe it was the casual manner of his dress: blue denim jeans, hiking boots, and a black shirt with the sleeves rolled up. He also carried a weathered backpack over one shoulder. He looked ready to scale the mountain for which Hotel Ararat was named, off on a search for Noah\u0027s Ark.\u003c/p\u003e\n\u003cp\u003eAnd perhaps once upon a time, the monsignor had made that very trek.\u003c/p\u003e\n\u003cp\u003eBefore rising to prefect of the Vatican\u0027s archives, Vigor had served the Holy See as a biblical archaeologist. Such a position had also allowed him to serve the Vatican in one other manner. As spy. Vigor\u0027s cover as an archaeologist had permitted him to travel broadly and deeply, perfect for filtering intelligence and information back to the Holy See.\u003c/p\u003e\n\u003cp\u003eVigor had also helped Sigma in the past.\u003c/p\u003e\n\u003cp\u003eAnd it seemed his expertise was needed once again.\u003c/p\u003e\n\u003cp\u003eVigor settled to the seat with a long sigh. The tea waiter returned and settled a steaming cup of tea in front of their new arrival.\u003c/p\u003e\n\u003cp\u003e\"Tesekkurler,\" Vigor said, thanking the man.\u003c/p\u003e\n\u003cp\u003eKowalski shifted straighter as the waiter departed, staring between his empty glass and the back of the man\u0027s embroidered vest. He slumped, swearing softly under his breath about the poor service.\u003c/p\u003e\n\u003cp\u003e\"Commander Pierce. Seichan,\" Vigor began. \"Thank you for honoring my request. And Seaman Joe Kowalski. Wonderful to make your acquaintance.\"\u003c/p\u003e\n\u003cp\u003eA few other pleasantries were passed around. Vigor haltingly mentioned his niece Rachel-It was an awkward subject. Rachel and Gray\u0027s breakup had been a mutual understanding, but Vigor was still very protective of his neice. Not that she needed it. It seemed Rachel was faring well as a lieutenant with the Italian carabinieri, even gaining a pay grade.\u003c/p\u003e\n\u003cp\u003eStill, Gray was happy when Seichan interrupted. \"Monsignor Verona, why did you summon us all the way to Istanbul?\"\u003c/p\u003e\n\u003cp\u003eVigor silenced her with a raised palm, sipped from his tea, then lowered his cup precisely to the tabletop. \"Yes, we\u0027ll get to that. But before that, 1 want two things settled at the start. First, wherever this leads, I\u0027m coming with you.\" He pinned Gray with a firm, unwavering stare—then swung his sights on Seichan. \"Second, but no less important, I want to know what all this has to do with our illustrious Venetian explorer Marco Polo.\"\u003c/p\u003e\n\u003cp\u003eSeichan started. \"How did you... I never mentioned anything about Marco Polo?\"\u003c/p\u003e\n\u003cp\u003eBefore Vigor could respond, the waiter returned. Kowalski glanced up, hope in his eyes. Those same eyes widened further when the waiter produced a full bottle of raki and propped it in front of the former seaman.\u003c/p\u003e\n\u003cp\u003e\"I ordered you a half liter,\" Vigor explained.\u003c/p\u003e\n\u003cp\u003eKowalski reached over and squeezed Vigor\u0027s arm. \"Padre, you\u0027re all right in my book.\"\u003c/p\u003e\n\u003cp\u003eGray turned his attention to Seichan. \"So what does all this have to do with Marco Polo?\"\u003c/p\u003e\n\u003cp\u003eMidnight Washington, D. C.\u003c/p\u003e\n\u003cp\u003eThe black BMW sedan turned off Dupont Circle and glided through the darker streets. Its xenon headlights carved a bluish path down the elm-lined avenue. Rows of apartment buildings framed the street, creating an urban canyon.\u003c/p\u003e\n\u003cp\u003eIt was nothing like the canyons of Nasser\u0027s own land, where only goats roamed and caves and tunnels served as homesteads for the wandering Afghani tribes. Yet even that land was not truly his home. His father had left Cairo when Nasser was eight years old, off to Afghanistan after its liberation from Russian forces, to join those who sought a purer Islam. Nasser\u0027s younger brother and sister had been dragged there, too. They\u0027d had no choice. On the eve of their departure, his father had strangled his mother, using Nasser\u0027s own school scarf. His mother had not wanted to leave Egypt, to vanish forever beneath a burka. She had talked, complained in the wrong ears.\u003c/p\u003e\n\u003cp\u003eThe children had been forced to watch, kneeling in obeisance, as their mother\u0027s eyes bulged, tongue swollen, punished by their father\u0027s hand.\u003c/p\u003e\n\u003cp\u003eIt was a lesson Nasser learned well.\u003c/p\u003e\n\u003cp\u003eTo be cold. In all ways.\u003c/p\u003e\n\u003cp\u003eThe xenon lamps swept around a corner. From the passenger seat, Nasser motioned to the middle of the block. \"Stop there.\"\u003c/p\u003e\n\u003cp\u003eThe driver, his broken nose bandaged after the failed kidnapping, slid the sedan to the curb. Nasser twisted around to face the rear seat. Two figures huddled close together.\u003c/p\u003e\n\u003cp\u003eAnnishen, dressed all in shades of black, almost faded into the leather furniture. She even wore a hood over her shaved scalp, giving her a monkish appearance. Her eyes shone brightly out of the darkness. She had one arm around her companion, leaning close, intimate.\u003c/p\u003e\n\u003cp\u003eHe still mewled around the gag. Blood blackened one side of his face and throat. In his bound hands, clutched between his knees, he still held his own right ear. Nasser had discovered the man\u0027s name in a Rolodex.\u003c/p\u003e\n\u003cp\u003eA doctor.\u003c/p\u003e\n\u003cp\u003e\"Is this the place?\" Nasser asked.\u003c/p\u003e\n\u003cp\u003eThe man nodded vigorously, squeezing his eyes shut after verifying the address.\u003c/p\u003e\n\u003cp\u003eNasser studied the building\u0027s lobby. A night watchman was stationed behind a desk inside. A security camera protruded above the bulletproof glass doors. Full security. Nasser rubbed his thumb along the edge of the electronic key in his hand, a gift courtesy of their passenger.\u003c/p\u003e\n\u003cp\u003eAfter a full day, Nasser was finally back on the trail of the American and the Guild traitor. Last night, he had searched the small home in the Takoma Park neighborhood. He had discovered Seichan\u0027s damaged motorcycle in its garage, but little else. There had been no sign of the obelisk, except for a broken fragment of Egyptian marble in the driveway.\u003c/p\u003e\n\u003cp\u003eBut inside the house, Allah had smiled upon him.\u003c/p\u003e\n\u003cp\u003eNasser had discovered a Rolodex.\u003c/p\u003e\n\u003cp\u003eWith several doctors\u0027 names.\u003c/p\u003e\n\u003cp\u003eIt had taken the rest of the day to find the right one.\u003c/p\u003e\n\u003cp\u003eHe turned around again.\u003c/p\u003e\n\u003cp\u003e\"Thank you, Dr. Corrin. You\u0027ve provided the leverage I\u0027ll need.\"\u003c/p\u003e\n\u003cp\u003eNasser had no need to nod to Annishen. Her blade slipped between the man\u0027s ribs and opened his heart. It was a Mossad technique that Nasser had taught Annishen. He had employed it himself only once before.\u003c/p\u003e\n\u003cp\u003eAs his father knelt in prayer. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-27.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
