{"id":104784,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe rushed out of the bedroom and across to the front door. Reaching for the dead bolt, she paused. She leaned forward instead and peeked through the door\u0027s peephole. It offered a fish-eye view of the hallway. A lone woman, black hair cut into a bob, stood outside the door. She wore a white jacket with the pharmacy logo on the lapel and carried a white paper bag, stapled with a clutch of receipt.\u003c/p\u003e\n\u003cp\u003eThe woman reached out of view. The bell chimed again. The woman checked her watch and began to step away.\u003c/p\u003e\n\u003cp\u003eHarriet called through the door. \"Hold for a moment!\"\u003c/p\u003e\n\u003cp\u003e\"Swan Pharmacy,\" the woman called back.\u003c/p\u003e\n\u003cp\u003eTo be extra cautious, Harriet crossed to the telephone on an entryway table. She caught a look at herself in the wall mirror above it. She looked haggard, a melted wax candle of a woman. She tapped the button on the phone and rang the front desk in the lobby.\u003c/p\u003e\n\u003cp\u003eIt was answered immediately.\u003c/p\u003e\n\u003cp\u003e\"Phoenix Park. Front desk.\"\u003c/p\u003e\n\u003cp\u003e\"This is room 334. I wanted to confirm a pharmacy delivery.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am. I checked her credentials three minutes ago. Is there a problem?\"\u003c/p\u003e\n\u003cp\u003e\"No. Not at all. I just wanted—\"\u003c/p\u003e\n\u003cp\u003eA crash sounded from the bedroom behind her, followed by a spat of cursing. Jack had finally opened the bathroom door.\u003c/p\u003e\n\u003cp\u003eThe receptionist spoke in her ear. \"Is there anything else I can do for you, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003e\"No. Thank you.\" She hung up the phone.\u003c/p\u003e\n\u003cp\u003e\"Harriet!\" her husband called, a note of distress behind the anger.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here, Jack.\"\u003c/p\u003e\n\u003cp\u003eThe doorbell chimed again.\u003c/p\u003e\n\u003cp\u003eFrazzled, Harriet undid the door\u0027s dead bolt, hoping Jack would not fuss about taking his pills. She pulled open the door.\u003c/p\u003e\n\u003cp\u003eThe delivery woman lifted her face, smiling—but there was no warmth, only a feral amusement. A shock of recognition froze Harriet. It was the woman who had attacked them at the safe house. Before Harriet could move, the woman kicked the door the rest of the way open.\u003c/p\u003e\n\u003cp\u003eStartled, the edge struck Harriet in the shoulder and knocked her into a stumbling fall onto the hard tile. She tried to absorb the impact with an outstretched arm—but her wrist exploded under her with a sharp snap. Fiery pain shot up her arm.\u003c/p\u003e\n\u003cp\u003eGasping out, half on her hip, she rolled away.\u003c/p\u003e\n\u003cp\u003eJack stalked out of the bedroom, only in his boxers.\u003c/p\u003e\n\u003cp\u003e\"Harriet... ?\"\u003c/p\u003e\n\u003cp\u003eStill addled, Jack took too long to register the situation.\u003c/p\u003e\n\u003cp\u003eThe woman stepped over the threshold and raised a thick-barreled pistol. She pointed the weapon at Jack. \"Here\u0027s your medication.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Harriet moaned.\u003c/p\u003e\n\u003cp\u003eThe woman pulled the trigger. A snapping pop of electricity exploded from the barrel. Something spat past Harriet\u0027s ear, trailing wire. It struck Jack in the bare chest, sparking and crackling blue in the dim light.\u003c/p\u003e\n\u003cp\u003eTaser.\u003c/p\u003e\n\u003cp\u003eHe gagged, arms flying out—and crashed backward.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t move.\u003c/p\u003e\n\u003cp\u003eIn the stunned silence a Fox News announcer whispered from the half-muted television: \"Metro police are still continuing a manhunt for Grayson Pierce, wanted in connection to the arson and bombing of a local D.C. home.\"\u003c/p\u003e\n\u003cp\u003e8:32 A.M. Istanbul\u003c/p\u003e\n\u003cp\u003eAlone at the roof rail Gray struggled to think of some secure channel to communicate to Washington. About the dangers at Christmas Island. He would have to be circumspect, some private communication that would not spread beyond Painter. But how? Who was to say that the Guild was not monitoring all manner of communication?\u003c/p\u003e\n\u003cp\u003eSeichan spoke behind him, back at the table. Her words were not directed at Gray. \"Monsignor, you still have not explained why you called us to Istanbul. You claimed to have understood the angelic inscription.\"\u003c/p\u003e\n\u003cp\u003eCuriosity drew Gray back to the table, but he could not sit. He stood between Seichan and Vigor.\u003c/p\u003e\n\u003cp\u003eThe monsignor swung up his backpack and settled it in his lap. He fished through it and pulled out a notebook, flipping it open on the table. Across the page was a charcoal-etched line of angelic letters.\u003c/p\u003e\n\u003cp\u003e\"Here is the inscription on the floor of the Tower of Wind,\" Vigor said. \"Each letter of this alphabet corresponds to a specific tonal word. And according to the father of angelic script, Trithemius, when combined in the right sequence, such groupings could open a direct line to a specific angel.\"\u003c/p\u003e\n\u003cp\u003e\"Like long-distance dialing,\" Kowalski muttered from the other side of the table.\u003c/p\u003e\n\u003cp\u003eWith a nod, Vigor flipped the sheet to the next page. \"I went ahead and marked the name for each letter.\"\u003c/p\u003e\n\u003cp\u003eGray shook his head, not seeing any pattern.\u003c/p\u003e\n\u003cp\u003eVigor slipped out a pen and drew a line under the first letter of each name, reciting as he did so. \"A. I. G. A. H.\"\u003c/p\u003e\n\u003cp\u003e\"Is that some angel\u0027s name?\" Kowalski asked.\u003c/p\u003e\n\u003cp\u003e\"No, not an angel, but it is a name,\" Vigor said. \"What you have to understand is that Trithemius based his alphabet on Hebrew, claiming power in the Jewish letters. Even today, practitioners of Kabbalah believe that there is some form of divine wisdom buried in the shapes and curves of the Hebrew alphabet. Trithemius just claimed his angelic script was the purest distillation of Hebrew.\"\u003c/p\u003e\n\u003cp\u003eGray leaned closer, beginning to understand the direction of Vigor\u0027s track. \"And Hebrew is read opposite from English. From right to left.\"\u003c/p\u003e\n\u003cp\u003eSeichan traced a finger across the paper and read backward. \"H. A. G. I. A.\"\u003c/p\u003e\n\u003cp\u003e\"Hagia,\" Vigor pronounced carefully. \"The word means \u0027divine\u0027 in Greek.\"\u003c/p\u003e\n\u003cp\u003eGray\u0027s eyes had narrowed—then widened with sudden understanding.\u003c/p\u003e\n\u003cp\u003eOf course.\u003c/p\u003e\n\u003cp\u003e\"What?\" Siechan asked.\u003c/p\u003e\n\u003cp\u003eKowalski scratched the stubble on his head, equally clueless.\u003c/p\u003e\n\u003cp\u003eVigor stood and drew them all up. He walked them to face the city. \"On his journey home, Marco Polo crossed through Istanbul, named Constantinople at the time. Here is where he crossed from Asia and finally reentered Europe, a significant crossroads of sorts.\"\u003c/p\u003e\n\u003cp\u003eThe monsignor pointed out to the city, toward one of the ancient monuments. Gray had noted it before. A massive flat-domed church, half covered in black scaffolding as restoration work was under way.\u003c/p\u003e\n\u003cp\u003e\"Hagia Sophia,\" Gray said, naming the structure.\u003c/p\u003e\n\u003cp\u003eVigor nodded. \"It was once the largest Christian church in all the world. Marco himself commented on the wonders of its airy spaces. Some people mistake Hagia Sophia to mean \u0027Saint Sophia,\u0027 but in fact, the true name of the structure is the Church of Divine Wisdom, which can also be interpreted as the Church of Angelic Wisdom.\"\u003c/p\u003e\n\u003cp\u003e\"Then that\u0027s where we must go!\" Seichan said. \"The first key must be hidden there.\" She swung away.\u003c/p\u003e\n\u003cp\u003e\"Not so fast, young lady,\" Vigor scolded.\u003c/p\u003e\n\u003cp\u003eThe monsignor returned to his backpack, reached inside, and drew out a cloth-wrapped object. Gently resting it on the table, he peeled back the layers to reveal a flat bar of dull gold. It appeared very old. It bore a hole at one end, and its surface was covered in a cursive script.\u003c/p\u003e\n\u003cp\u003e\"Not angelic,\" Vigor said, noting Gray\u0027s attention to the lettering. \"It\u0027s Mongolian. It reads, \u0027By the strength of the eternal heaven, holy be the Khan\u0027s name. Let he who pays him not reverence be killed.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand,\" Gray said, crinkling his brow. \"Did this belong to Marco Polo? What is it?\"\u003c/p\u003e\n\u003cp\u003e\"In Chinese, it is called apaitzu. In Mongolian, a gerege.\"\u003c/p\u003e\n\u003cp\u003eThree blank faces stared back at Vigor.\u003c/p\u003e\n\u003cp\u003eVigor nodded to the object. \"In the modern vernacular, it\u0027s a VIP passport. A traveler bearing this superpassport could demand horses, supplies, men, boats, anything from the lands governed by Kublia Khan. To refuse such aid was punishable by death. The Khan granted such passes to those ambassadors who traveled in his service.\"\u003c/p\u003e\n\u003cp\u003e\"Nice,\" Kowalski whistled—but from the glint in the man\u0027s eyes, Gray suspected it was the gold more than the story that had won the man\u0027s awe.\u003c/p\u003e\n\u003cp\u003e\"And the Polos were given one of these passports?\" Seichan asked.\u003c/p\u003e\n\u003cp\u003e\"Three of them, in fact. One for each Polo. Marco, his father, and his uncle. In fact, there is an anecdote concerning these passports. A famous one. When the Polos arrived back in Venice, it was said no one recognized them. The trio came worn, tired, in a single ship. Looking little better than beggars. None would believe them to be the long-vanished Polos. Upon stepping to shore, the trio sliced open the seams of their clothes, and a vast wealth of emeralds, rubies, sapphires, and silver spilled out. Included in this treasure trove were the three golden paitzus, described in great detail. But after this story, the golden passports vanished away. All three of them.\"\u003c/p\u003e\n\u003cp\u003e\"The same number as the map\u0027s keys,\" Gray commented.\u003c/p\u003e\n\u003cp\u003e\"Where did you find this?\" Seichan asked. \"In one of the Vatican museums?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Vigor tapped the open notebook with the angelic script. \"With the help of a friend, I discovered it under the marble tile upon which this inscription was written. In a secret hollow beneath the marble.\"\u003c/p\u003e\n\u003cp\u003eLike the friar\u0027s cross, Gray realized. Buried in stone.\u003c/p\u003e\n\u003cp\u003eSeichan swore slightly. Again the prize had been right under her nose all along.\u003c/p\u003e\n\u003cp\u003eVigor continued, \"I believe this is one of the very paitzus granted to the Polos.\" He faced them all. \"And I believe this is the first key.\"\u003c/p\u003e\n\u003cp\u003e\"So the clue leading to Hagia Sophia . . .\" Gray began.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s pointing to the second key,\" Vigor finished. \"Two more missing passports, two more missing keys.\"\u003c/p\u003e\n\u003cp\u003e\"But how can you be so sure?\" Seichan asked.\u003c/p\u003e\n\u003cp\u003eVigor flipped the gold bar over. Inscribed in great detail, a single letter adorned the back side. An angelic letter.\u003c/p\u003e\n\u003cp\u003eVigor tapped the letter. \"Here is the first key.\"\u003c/p\u003e\n\u003cp\u003eGray knew he was right. He glanced up, toward the massive church. Hagia Sophia. The second key had to be hidden there, but it was a huge structure. It would be like finding a golden needle in a haystack. It could take days.\u003c/p\u003e\n\u003cp\u003eVigor must have read his worry. \"I already have someone scouting ahead at the church. An art historian from the Vatican who helped me back at the Tower of Wind with the angelic riddle.\"\u003c/p\u003e\n\u003cp\u003eGray nodded. As he studied the single letter, he could not shake a deeper worry. For his two friends. Monk and Lisa. Already in harm\u0027s way. If he could not contact Washington safely, perhaps there was another way he could help his friends: by beating the Guild to whatever lay at the end of this mystery. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-31.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
