{"id":104796,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe remembered her earlier words. No organism is evil for evil\u0027s sake. It just sought to survive, to spread, to thrive.\u003c/p\u003e\n\u003cp\u003eThe file was also cross-indexed to the original viral photos. She brought those up, too.\u003c/p\u003e\n\u003cp\u003eOld and new. Side by side. All the same.\u003c/p\u003e\n\u003cp\u003eShe reached to close the file, but her finger hovered over the button.\u003c/p\u003e\n\u003cp\u003eNo...\u003c/p\u003e\n\u003cp\u003eHer hand began to tremble.\u003c/p\u003e\n\u003cp\u003eOf course . ..\u003c/p\u003e\n\u003cp\u003eLightning cracked, blindingly bright through the balcony doors, followed by an immediate clap of thunder that made her jump. The entire ship shuddered. The balcony doors rattled.\u003c/p\u003e\n\u003cp\u003eThe lightning had struck right over the ship, maybe hitting it.\u003c/p\u003e\n\u003cp\u003eThe cabin lights flickered. Lisa glanced up just as they went out. Darkness fell over the cabin.\u003c/p\u003e\n\u003cp\u003eThe orderlies yelled out a complaint.\u003c/p\u003e\n\u003cp\u003eLisa stood up.\u003c/p\u003e\n\u003cp\u003eOh. My. God.\u003c/p\u003e\n\u003cp\u003eThen the lights zapped back on with a surge of current. The computer squelched a complaint and made a loud smoky pop. The television in the other room garbled, then settled into regular movie dialogue.\u003c/p\u003e\n\u003cp\u003eLisa stayed where she was, frozen in shock.\u003c/p\u003e\n\u003cp\u003eShe continued staring down at the figure in the bed. In the moment of brief darkness, Lisa had made another discovery about the patient. Had no one ever turned out the lights in here? Or was this phenomenon new?\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t only the woman\u0027s eyes that glowed.\u003c/p\u003e\n\u003cp\u003eIn the darkness, dressed only in a thin gown, the woman\u0027s limbs and face had glowed with a soft blush, a sheen of phosphorescence that was not evident in the bright light.\u003c/p\u003e\n\u003cp\u003eThe cyanobacteria had not just spread to her eyes—but everywhere.\u003c/p\u003e\n\u003cp\u003eLisa was so stunned that she failed to note one other detail for a full breath: the patient\u0027s eyes were open, staring back at Lisa.\u003c/p\u003e\n\u003cp\u003eParched lips moved.\u003c/p\u003e\n\u003cp\u003eLisa read those lips more than heard the words.\u003c/p\u003e\n\u003cp\u003e\"Wh-who are you?\"\u003c/p\u003e\n\u003cp\u003e8:12 p.m.\u003c/p\u003e\n\u003cp\u003eMonk listened to the radio\u0027s earpiece as he climbed the stairs from the lower decks. He had gone down to check the access to Ryder Blunt\u0027s private dock, where he kept his boat. It was unguarded. Few knew about the private slide launch.\u003c/p\u003e\n\u003cp\u003e\"I have the electronic key to the dock\u0027s hatch,\" Ryder said. \"Once I\u0027m free, I\u0027ll head down there, get the boat gassed up, and be ready to launch. But can you free Dr. Cummings by yourself?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Monk said into the mouthpiece. \"The less commotion the better.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027ve got everything prepared.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Mother.\" Monk sighed. \"I\u0027ll be ready in a half hour. On my word, you know what to do.\"\u003c/p\u003e\n\u003cp\u003e\"Roger that. Out.\"\u003c/p\u003e\n\u003cp\u003eMonk climbed to the next landing of the stair, crossed to a janitorial closet, and collected up the blanket, pillow, and clothes he had hidden inside earlier.\u003c/p\u003e\n\u003cp\u003eHis earpiece buzzed again. \"Monk?\"\u003c/p\u003e\n\u003cp\u003e\"Lisa?\" He checked his watch. It was early. His heart thudded harder. \"What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing. At least not exactly. We need a change of plans. We need room for one more.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"My patient. She\u0027s awake.\"\u003c/p\u003e\n\u003cp\u003e\"Lisa. . .\"\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t leave her here,\" she insisted in his ear. \"Whatever is happening to her is critical to everything that\u0027s going on. We can\u0027t risk the Guild escaping with her before we can return.\"\u003c/p\u003e\n\u003cp\u003eMonk breathed hard out his nose, recalculating. \"How mobile is she?\"\u003c/p\u003e\n\u003cp\u003e\"Weak but mobile enough. I think. I can\u0027t judge more with the orderlies in the next room. I\u0027m in my room where I can talk. I left her back there, feigning still being catatonic.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re sure she\u0027s that important.\"\u003c/p\u003e\n\u003cp\u003e\"Positive.\"\u003c/p\u003e\n\u003cp\u003eMonk asked a few more questions, settled a few more details, revising on the fly. Lisa signed off to get ready at her end.\u003c/p\u003e\n\u003cp\u003e\"Ryder?\" Monk said.\u003c/p\u003e\n\u003cp\u003e\"I heard,\" the Aussie billionaire said. \"My radio was still on.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll have to move up the timetable.\"\u003c/p\u003e\n\u003cp\u003e\"No bloody kidding. When will you be here?\"\u003c/p\u003e\n\u003cp\u003eMonk flipped the safety off his weapon. \"I\u0027m heading up there right now.\"\u003c/p\u003e\n\u003cp\u003e8:16 p.m.\u003c/p\u003e\n\u003cp\u003eLisa returned to the infirmary suite. She had donned a sweater. She had complained earlier to the orderlies that she was cold, a simple excuse to return briefly to her room and make the radio call to Monk.\u003c/p\u003e\n\u003cp\u003eAs she entered, Tweedledee and Tweedledum were still engrossed in their movie. Some shoot-out was under way on the television. Life was about to imitate art.\u003c/p\u003e\n\u003cp\u003eIf all went well.\u003c/p\u003e\n\u003cp\u003eLisa turned and crossed to the bedroom—then stumbled back a step, startled.\u003c/p\u003e\n\u003cp\u003eDr. Devesh Patanjali stood at the foot of the bed, hands behind his back. Ahead, Susan lay sprawled on the bed, under the isolation tent, eyes closed, breathing evenly.\u003c/p\u003e\n\u003cp\u003eDevesh was not supposed to be here.\u003c/p\u003e\n\u003cp\u003e\"Ah,\" he said without turning, \"Dr. Cummings, how is our patient doing?\"\u003c/p\u003e\n\u003cp\u003e8:17 P.M.\u003c/p\u003e\n\u003cp\u003eThe elevator doors chimed open onto the level of the Presidential Suite. Monk, tired and irritable, strode out into the hall. He had a bundle of blankets and a pillow.\u003c/p\u003e\n\u003cp\u003eHe crossed toward the pair of guards posted by the double doors.\u003c/p\u003e\n\u003cp\u003eOne sat on a chair, the other straightened from where he was leaning against the wall.\u003c/p\u003e\n\u003cp\u003e\"Go,\" Monk said crisply into his radio\u0027s microphone.\u003c/p\u003e\n\u003cp\u003eIt was his signal.\u003c/p\u003e\n\u003cp\u003eA muffled gunshot rang out from behind the suite\u0027s door as Ryder took out the man posted inside.\u003c/p\u003e\n\u003cp\u003eStartled, the guard who\u0027d been standing by the wall swung to the door.\u003c/p\u003e\n\u003cp\u003eMonk was on him immediately. He swung up both arms, a pistol in each hand, one tucked into a pillow, the other bundled in the blanket. He shoved the pillow against the man\u0027s back and pulled the trigger, taking out his spine. As the guard dropped, he fired a second round into the man\u0027s head. Before the body even hit the ground, Monk turned to the seated man, lifting the blanket-wrapped pistol. He pulled the trigger. . . twice.\u003c/p\u003e\n\u003cp\u003e8:19 P.M.\u003c/p\u003e\n\u003cp\u003eLisa entered the bedroom.\u003c/p\u003e\n\u003cp\u003e\"Dr. Patanjali, I\u0027m glad you\u0027re here,\" she said, swallowing the gall that came with the lie. She needed Devesh out of here. She had told Monk only two orderlies would be here.\u003c/p\u003e\n\u003cp\u003eDevesh turned to her.\u003c/p\u003e\n\u003cp\u003eLisa swiped some loose hair over her ear, feigning exhaustion as her heart pounded. \"I had come to get some test results on a CSF tap 1 performed earlier. But.. .\" She waved to the computer. \"The power surge knocked out the CPU. I was hoping to review the results before 1 went to bed.\"\u003c/p\u003e\n\u003cp\u003e\"Why didn\u0027t you order one of the men to fetch them from Dr. Pollum\u0027s lab?\"\u003c/p\u003e\n\u003cp\u003e\"No one\u0027s there. I was hoping you might expedite matters.\"\u003c/p\u003e\n\u003cp\u003eDevesh sighed. \"Certainly. 1 was just heading over to my room for the night. I\u0027ll call down and have Pollum send you a hard copy.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eDevesh headed away, but he stopped at the threshold and turned back to her.\u003c/p\u003e\n\u003cp\u003eLisa tensed.\u003c/p\u003e\n\u003cp\u003e\"You looked quite handsome at the cocktail party. Truly radiant.\"\u003c/p\u003e\n\u003cp\u003eLisa kept her face impassive by sheer force of will. \"Th-thank you.\"\u003c/p\u003e\n\u003cp\u003eThen he was gone.\u003c/p\u003e\n\u003cp\u003eShaken a bit, Lisa hurried over to Susan. Leaning down, Lisa whispered in her ear. \"I\u0027m going to begin unhooking you from everything. We\u0027re getting out of here.\"\u003c/p\u003e\n\u003cp\u003eSusan nodded. Her lips moved, exhaling a soft \"thank you.\"\u003c/p\u003e\n\u003cp\u003eAs Lisa set to work on the IV catheter, she noted the tear tracks leaking from the outer corner of Susan\u0027s eyes to her pillow. Earlier, Lisa had quietly explained about the fate of the woman\u0027s husband. Lisa had read his autopsy reports, courtesy of Devesh.\u003c/p\u003e\n\u003cp\u003eLisa squeezed the woman\u0027s shoulder.\u003c/p\u003e\n\u003cp\u003eLuckily, Devesh had not noted her glowing tears.\u003c/p\u003e\n\u003cp\u003e8:25 p.m.\u003c/p\u003e\n\u003cp\u003eMonk hurried across the outside starboard deck, hunched against the wind-lashed rain. Only a few pools of light spilled to the darkened deck. Black clouds whipped and roiled above the giant net woven across the top of the island. Flashes of lightning glowed like a distant war zone. The rumble of thunder was almost constant.\u003c/p\u003e\n\u003cp\u003eAfter his first talk with Lisa, Monk had scouted the proper section of deck and prepared everything he needed. But he hadn\u0027t had time to ready a second sling. He\u0027d simply have to haul the women up one at a time.\u003c/p\u003e\n\u003cp\u003eTo accomplish that quickly, Monk needed more muscle.\u003c/p\u003e\n\u003cp\u003eRyder pounded behind him, dressed in local rags like Monk.\u003c/p\u003e\n\u003cp\u003eGassing up the billionaire\u0027s boat would have to wait.\u003c/p\u003e\n\u003cp\u003e\"This way!\" Monk yelled above the drench of rain and gusts of wind.\u003c/p\u003e\n\u003cp\u003eA deck chair skittered past him. The winds were picking up. They needed to be out of here in the next hour to escape the worst brunt of the coming typhoon.\u003c/p\u003e\n\u003cp\u003eOverhead, the island\u0027s woven roof shook and rattled.\u003c/p\u003e\n\u003cp\u003eMonk reached the section of deck where he had rigged a rope and fireman\u0027s sling, stolen from out of the ship\u0027s emergency rescue gear.\u003c/p\u003e\n\u003cp\u003eMonk pointed. \"Haul it to the rail!\" he hollered as he leaned over the edge.\u003c/p\u003e\n\u003cp\u003eHe searched below. The curve of the ship\u0027s hull made it hard to be certain, but two levels below him should be the balcony to the cabin where Lisa had been tending her patient. It was the point of egress for this op.\u003c/p\u003e\n\u003cp\u003eFarther below, the dark lagoon reflected the ship\u0027s few lights, rippling gently, sheltered from the worst of the wind by the high volcanic walls. As Monk turned to Ryder, he noted some flashes of light in the water. Not reflections, something deeper. Bright blues and crimson fire.\u003c/p\u003e\n\u003cp\u003eWhat the hell?\u003c/p\u003e\n\u003cp\u003eA crackle of lightning shattered overhead, striking the roof net, lighting up the lagoon. Monk ducked from the thunder. Where the lightning struck, sparkling blue energies shattered outward along the steel bracings of the net, leaving momentary dances of St. Elmo\u0027s fire. The entire structure must be grounded, acting like a massive lightning rod.\u003c/p\u003e\n\u003cp\u003eRyder joined him at the rail. He had the coil of rope over his shoulder and tossed the sling over the rail. He lowered it with the experience of a dock lineman. The sling reached the level of the balcony, swinging in the blustering wind.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go down,\" Monk yelled in his ear. \"Secure the cabin. Then haul ass back up here. The two of us will have to pull the woman up.\"\u003c/p\u003e\n\u003cp\u003eRyder nodded. He had already heard the plan. Monk had repeated it, just to give the man one last chance to volunteer to go down instead. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-43.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
