{"id":104800,"no":47,"title":"Page 47","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe searched the cavernous length of the nave. People, frightened by the gunplay, cowered in corners or shifted in maddened tides of confusion and panic. She had to find Gray and Vigor.\u003c/p\u003e\n\u003cp\u003eSirens sounded in the distance.\u003c/p\u003e\n\u003cp\u003eA hand snagged her shirt. Reflexively, she jabbed a pistol into ribs.\u003c/p\u003e\n\u003cp\u003eHer target didn\u0027t flinch. \"Seichan, what happened?\"\u003c/p\u003e\n\u003cp\u003eIt was Gray, his face drawn and pale.\u003c/p\u003e\n\u003cp\u003e\"Gray ... we have to get out of here. Now. Where\u0027s the monsignor?\"\u003c/p\u003e\n\u003cp\u003eHe pointed toward a neighboring stairwell. Vigor kept half hidden at its entrance and watched the crowd.\u003c/p\u003e\n\u003cp\u003eSeichan herded Gray over to him.\u003c/p\u003e\n\u003cp\u003eThe monsignor stared back at the arched doorway, his eyes wounded with grief. \"Nasser shot him. Shot Balthazar.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Seichan said, killing any misconception. \"I did.\"\u003c/p\u003e\n\u003cp\u003eVigor backed a step. Gray swung around.\u003c/p\u003e\n\u003cp\u003e\"He was working with Nasser,\" Seichan explained.\u003c/p\u003e\n\u003cp\u003eVigor\u0027s voice turned angry. \"How can . . . ?\"\u003c/p\u003e\n\u003cp\u003e\"I have photos from two years ago. Nasser and Balthazar together. Money changed hands.\" She fixed Vigor with a hard stare. \"He\u0027s been working with him all along.\"\u003c/p\u003e\n\u003cp\u003eSeichan read the continuing disbelief. She hardened her voice. \"Monsignor, who called your attention to the inscription in the Tower of Wind?\"\u003c/p\u003e\n\u003cp\u003eVigor glanced toward the doors, toward the dead man out of sight.\u003c/p\u003e\n\u003cp\u003e\"Before involving you both,\" Seichan pressed, \"Nasser and I were playing cat and mouse throughout Italy, searching for the first bits of the angelic puzzle. No one was supposed to discover my invisible mark in the Vatican until I called you, alerted you to search the tower\u0027s closet with an ultraviolet light. Do you think your friend just accidentally stumbled upon it?\"\u003c/p\u003e\n\u003cp\u003e\"He said . . . one of his students . . .\"\u003c/p\u003e\n\u003cp\u003e\"He was lying. Nasser told him. The bastard followed the same trail I did. Used Balthazar to recruit you into solving the riddle.\"\u003c/p\u003e\n\u003cp\u003eVigor sank to the stairs, covering his face.\u003c/p\u003e\n\u003cp\u003eSeichan turned to Gray. He stood a step away, eyes glazed, reconfiguring all the morning\u0027s events in light of the revelation. He must have sensed Seichan\u0027s attention.\u003c/p\u003e\n\u003cp\u003e\"Then Nasser knew we were trying to betray him,\" Gray said. \"He knew we had the first key. He knows everything.\"\u003c/p\u003e\n\u003cp\u003e\"Not necessarily.\" Seichan pulled Vigor up by the shoulder and shoved Gray toward the church. \"It was why I had to take him out. I don\u0027t think he had the time to call Nasser after he left you. I took him out before he got the chance and made things worse.\"\u003c/p\u003e\n\u003cp\u003e\"Worse?\" Gray stopped, refusing to move, his eyes furious. \"You could have captured him. We could have used him against Nasser. There were a thousand options!\"\u003c/p\u003e\n\u003cp\u003e\"All of them too risky!\" Seichan stepped closer, walking into the fire. \"Get this through your thick skull, Gray. Nasser\u0027s plan, our plans . . . they\u0027re all screwed. It\u0027s clean slate time here. And we have to act now.\"\u003c/p\u003e\n\u003cp\u003eHis face darkened as anger boiled up. Even his eyes turned stormy. \"When the bastard finds out what you did . . . what we did . . . you just got my parents killed!\"\u003c/p\u003e\n\u003cp\u003eShe cut him off with a resounding slap to the face, knocking him back a step. Stunned, he lunged at her. She didn\u0027t resist. He collared her. His other hand a fist.\u003c/p\u003e\n\u003cp\u003eShe kept her voice calm against his storm. \"With that bastard dead, we have a small window of confusion here. We must take advantage of it.\"\u003c/p\u003e\n\u003cp\u003e\"But my folks—\"\u003c/p\u003e\n\u003cp\u003eShe kept her voice even. \"Gray, they\u0027re already dead.\"\u003c/p\u003e\n\u003cp\u003eThe fist tangled in her shirt trembled. His face constricted tight, red and agonized. His eyes searched her, needing someone to blame.\u003c/p\u003e\n\u003cp\u003e\"And if they\u0027re not dead,\" she continued, \"if he\u0027s keeping them alive as extra insurance, then we have only one hope here.\"\u003c/p\u003e\n\u003cp\u003eGray\u0027s hand dropped from her throat but remained clenched.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll need a big bargaining chip,\" she continued. \"Equal to the weight of your parents\u0027 lives.\"\u003c/p\u003e\n\u003cp\u003eIn his eyes, she could see the rage beginning to subside, the tide going out, the words finally sinking in. \"And the second key alone won\u0027t do it.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"We need to go silent. Have Vigor pull his cell phone battery so that it\u0027s not tracked.\"\u003c/p\u003e\n\u003cp\u003e\"But how will Nasser reach us?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s time we took that control from him.\"\u003c/p\u003e\n\u003cp\u003e\"But when he tries to call us ... ?\"\u003c/p\u003e\n\u003cp\u003e\"Nasser will be furious. He may hurt one, or both of your folks, maybe even kill one. But until he finds us, he\u0027ll keep one alive. He\u0027s not a fool. And that is our only hope.\"\u003c/p\u003e\n\u003cp\u003eVigor\u0027s phone began to ring. Everyone froze a breath. Then Vigor slipped it out of his pocket. He glanced to the caller ID, swallowed, and passed it to Gray.\u003c/p\u003e\n\u003cp\u003eHe took it. \"Nasser,\" he confirmed.\u003c/p\u003e\n\u003cp\u003e\"Speak of the devil,\" Seichan hissed. \"One of the snipers must have called him. Needing to get further instructions. It\u0027s probably the only reason they haven\u0027t stormed the place already. Killing Balthazar caught them off guard. This is the only window we have.\"\u003c/p\u003e\n\u003cp\u003eGray stared down at the phone.\u003c/p\u003e\n\u003cp\u003eSeichan waited.\u003c/p\u003e\n\u003cp\u003eHow strong was this man?\u003c/p\u003e\n\u003cp\u003e2:04 P.M.\u003c/p\u003e\n\u003cp\u003eGray\u0027s fingers refused to move, clamped around the phone.\u003c/p\u003e\n\u003cp\u003eIt vibrated and rang again.\u003c/p\u003e\n\u003cp\u003eHe could almost feel the fury emanating out of it, an anger ready to be unleashed against his mother and father. He wanted desperately to answer it: to scream, to beg, to curse, to bargain.\u003c/p\u003e\n\u003cp\u003eBut he had no leverage.\u003c/p\u003e\n\u003cp\u003eNot yet.\u003c/p\u003e\n\u003cp\u003e\"Nasser must still be in midflight,\" Gray finally mumbled to the phone.\u003c/p\u003e\n\u003cp\u003e\"Due to touch down in five hours,\" Seichan agreed.\u003c/p\u003e\n\u003cp\u003eGray let a coldness wash through him, but his fingers tightened harder. \"Up in the air, he\u0027ll hesitate to make any major decisions. He\u0027ll wait until his feet are on the ground before making a final assessment.\"\u003c/p\u003e\n\u003cp\u003e\"And if he hasn\u0027t heard from you by then .. .\"\u003c/p\u003e\n\u003cp\u003eGray couldn\u0027t say the words. He only nodded his confirmation. Nasser would kill his parents. He won\u0027t wait any longer than that. He\u0027ll punish Gray and move on to a new strategy.\u003c/p\u003e\n\u003cp\u003eFive hours.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll need more than the second key we found here,\" he said. \"More than even the third key.\"\u003c/p\u003e\n\u003cp\u003eSeichan nodded.\u003c/p\u003e\n\u003cp\u003eGray stared up at Seichan. \"We\u0027ll need to have solved the obelisk\u0027s riddle. We\u0027ll need Marco\u0027s map.\"\u003c/p\u003e\n\u003cp\u003eSeichan simply stared, waiting.\u003c/p\u003e\n\u003cp\u003eGray knew what he had to do. He flipped the phone over. With fingers numb and uncooperative, he fumbled with the battery in back.\u003c/p\u003e\n\u003cp\u003eVigor stepped up and covered his palm over Gray\u0027s fingers. \"Are you sure, Gray?\"\u003c/p\u003e\n\u003cp\u003eHe lifted his eyes. \"No . .. I\u0027m not. I\u0027m not sure of a damn thing.\" He slipped his hands free of the monsignor\u0027s and peeled the battery off the phone, cutting the last ring in half. \"But that doesn\u0027t mean I won\u0027t act.\"\u003c/p\u003e\n\u003cp\u003eGray turned to Seichan. \"What now?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve just thrown down the gauntlet. Nasser will be calling his henchmen. We\u0027ve got maybe a minute or two.\" She pointed into the depths of the church. \"This way. Kowalski\u0027s got a car. He\u0027ll meet us out at the east exit.\"\u003c/p\u003e\n\u003cp\u003eShe led them down the nave. People milled, unsure, voices echoed. Sirens closed down upon their location. Seichan fished something out of her pocket.\u003c/p\u003e\n\u003cp\u003e\"Nasser must have snipers at that exit, too,\" Gray said, striding up to her.\u003c/p\u003e\n\u003cp\u003eSeichan held out her palm. \"Concussive grenade. A flash-bang. We\u0027ll detonate it in the center. As everyone goes rushing out the exits . . . out we\u0027ll go, too.\"\u003c/p\u003e\n\u003cp\u003eGray frowned.\u003c/p\u003e\n\u003cp\u003eVigor voiced his concern as they circled past a crowd of schoolchildren, all wide-eyed and fearful, clutched in a group. \"If the snipers see any of us, they\u0027ll open fire. On the crowd.\"\u003c/p\u003e\n\u003cp\u003e\"No other way.\" Seichan sped faster. \"We\u0027ll have to take the chance. Nasser\u0027s men may already be coming—\"\u003c/p\u003e\n\u003cp\u003eA gunshot cracked loudly in the church.\u003c/p\u003e\n\u003cp\u003eGray felt something whine past his ear. A bit of wall mosaic blasted in a shower of gold.\u003c/p\u003e\n\u003cp\u003eThe crowd panicked, fleeing in all directions.\u003c/p\u003e\n\u003cp\u003eVigor was knocked to a knee. Gray dragged him up as a second shot sparked against a marble column. The blast echoed.\u003c/p\u003e\n\u003cp\u003eStaying low, the trio fled to the side and down the length of the nave. As they reached the center, Seichan prepared to pure the pin on the grenade.\u003c/p\u003e\n\u003cp\u003eGray grabbed her hand, restraining her. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the only way. There could be more shooters ahead of us. We\u0027ll need to trample with them to reach the exit.\"\u003c/p\u003e\n\u003cp\u003eAnd if we\u0027re spotted amid the crowd, he thought, how many innocent people will be killed?\u003c/p\u003e\n\u003cp\u003eHe pointed. \"There\u0027s another way.\"\u003c/p\u003e\n\u003cp\u003eStill holding his hand clamped to hers, he led them all to the south side, toward the wall of scaffolding he had scaled earlier.\u003c/p\u003e\n\u003cp\u003e\"Up!\" he said.\u003c/p\u003e\n\u003cp\u003eHowever, there remained one obstacle.\u003c/p\u003e\n\u003cp\u003eThe scaffolding guard had not fled his post. He remained crouched behind a wooden barrier, his rifle up, ready to shoot.\u003c/p\u003e\n\u003cp\u003eGray snatched the grenade out of Seichan\u0027s fingers, pulled the pin, and tossed the bomb behind the barrier. \"Close your eyes!\" he yelled at Vigor, pulling the monsignor down. \"Cover your ears.\"\u003c/p\u003e\n\u003cp\u003eSeichan crouched, her head wrapped in her arms.\u003c/p\u003e\n\u003cp\u003eThe explosion felt like a kick to the gut. A sonic boom trapped in stone. A flash seared through Gray\u0027s lids, even with his head turned away.\u003c/p\u003e\n\u003cp\u003eThen it was over.\u003c/p\u003e\n\u003cp\u003eGray yanked Vigor up. Screams echoed, sounding muffled through the residual ring in his ears. He rushed toward the massive scaffolding. The crowds parted, fleeing toward the east and west exits.\u003c/p\u003e\n\u003cp\u003eBut they weren\u0027t going with them.\u003c/p\u003e\n\u003cp\u003eAt the scaffolding, the guard was down, dazed on his back, moaning.\u003c/p\u003e\n\u003cp\u003eHe\u0027d have a bad headache, but he\u0027d live.\u003c/p\u003e\n\u003cp\u003eGray took his rifle and waved Seichan and Vigor up the scaffolding staircase. They\u0027d have to move fast. The stampede would slow the shooters, but only for so long.\u003c/p\u003e\n\u003cp\u003eHe clambered up after Seichan and Vigor.\u003c/p\u003e\n\u003cp\u003e\"Where are we going?\" Seichan called down. \"We\u0027ll be sitting ducks up here!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-47.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
