{"id":104807,"no":54,"title":"Page 54","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThey were led forward.\u003c/p\u003e\n\u003cp\u003eA single boar rooted through the open space in front and squealed back from the strangers\u0027 approach. More pigs huddled under an overhang, squeezed tight together, rump to rump.\u003c/p\u003e\n\u003cp\u003eMonk led Susan through the sheet of water and under the large overhang. He shivered as the rain cascaded over his bare chest. The heat of the fire inside was welcome, but the smoke choked and stung, doing its best to exit a narrow flue in the thatching.\u003c/p\u003e\n\u003cp\u003eAround the fire ahead, a crowd had gathered, some standing, some squatted. Monk estimated over a hundred. Men, bare-breasted women. But cave openings lined the walls. More faces peered out. A few naked children stood staring, wide-eyed. One cradled a piebald piglet.\u003c/p\u003e\n\u003cp\u003eAt some signal, the drums suddenly stopped with one resounding note. The quiet intimidated.\u003c/p\u003e\n\u003cp\u003eIn that sudden silence, a voice called out.\u003c/p\u003e\n\u003cp\u003e\"Monk!\"\u003c/p\u003e\n\u003cp\u003eStartled, he turned. A thin figure stood pressed up against the bamboo bars of a cage built into a back corner. He wore a torn shirt and a pair of muddy white briefs. \"Jessie?\"\u003c/p\u003e\n\u003cp\u003eThe young nurse was still alive!\u003c/p\u003e\n\u003cp\u003eBut before they could continue their tearful and heartfelt reunion, a towering figure stepped forward, though for the tribe, towering was about five-foot-nothing. The old graybeard looked like someone had sold him a skin suit two sizes too large. He was greased and daubed in ash, too. He wore some sort of twisted gourd over his privates and a shock of purpled feathers in his hair, sticking straight up, as if startled. And nothing else.\u003c/p\u003e\n\u003cp\u003eMonk recognized that this was the tribe\u0027s leader.\u003c/p\u003e\n\u003cp\u003eIt was time to perform, to dance for his supper—or rather, to dance not to become supper.\u003c/p\u003e\n\u003cp\u003eMonk lifted his arm toward the elder. \"Boogla-boogla rah!\" he intoned solemnly, then tensed his forearm and reached his other hand to pull the toggle at his wrist.\u003c/p\u003e\n\u003cp\u003eFreed from its electromagnetic contacts, his prosthetic hand dropped to the muddy volcanic stone.\u003c/p\u003e\n\u003cp\u003eA gasp arose from the crowd.\u003c/p\u003e\n\u003cp\u003eThe leader fell back a step, almost into the fire.\u003c/p\u003e\n\u003cp\u003eMonk lowered his arm, staring down at his disembodied hand.\u003c/p\u003e\n\u003cp\u003eBesides looking authentically fleshy, the prosthetic was a marvel of DARPA engineering, incorporating direct peripheral nerve control through its titanium wrist contact points. It also was bioengineered with advanced mechanics and actuators, allowing sensory feedback and surgically precise movements.\u003c/p\u003e\n\u003cp\u003eBut that was only half the story.\u003c/p\u003e\n\u003cp\u003eMonk\u0027s stumped end of his wrist was encased in a polysynthetic cuff, surgically attached to the end of his wrist and wired into nerve bundles and muscle tendons. In actuality, it was the other half of his prosthesis. The hand might be the brawn, but the wrist cuff was definitely the brain.\u003c/p\u003e\n\u003cp\u003eWith his remaining hand, he manipulated the titanium contacts on the cuff. It was the best feature of his artificial hand. Monk performed this stunt at parties all the time. So why should this be any different?\u003c/p\u003e\n\u003cp\u003eThe cuff and hand were linked wirelessly, a digital radio interface.\u003c/p\u003e\n\u003cp\u003eAs Monk tapped a practiced sequence on his wrist, his severed hand lifted up onto its fingers and began to dance across the rock like a five-legged spider.\u003c/p\u003e\n\u003cp\u003eThis time the cannibal leader did step into the fire, searing his backside enough to yelp and leap away.\u003c/p\u003e\n\u003cp\u003eMonk sent his hand chasing after him.\u003c/p\u003e\n\u003cp\u003eBy now a wide ring cleared around the party.\u003c/p\u003e\n\u003cp\u003eRyder had drawn Susan back into the shadows of the cliff face, giving Monk the stage.\u003c/p\u003e\n\u003cp\u003e\"Now that I have your attention,\" Monk bellowed.\u003c/p\u003e\n\u003cp\u003eHe strode toward the fire.\u003c/p\u003e\n\u003cp\u003eGuessing no one spoke English here, he had to sell it with a bravado of expression and a great pounding of his bare chest. Still, it wasn\u0027t good enough just to scare the superstitious folk. He needed to win them over. It was time for an American-led coup of Cannibal Island.\u003c/p\u003e\n\u003cp\u003eTurning on a heel, Monk pointed back to Susan.\u003c/p\u003e\n\u003cp\u003eOn his signal, she unwrapped Monk\u0027s borrowed shirt from around her head. Ryder reached and stripped the hospital gown from her shoulders and let it fall away. Susan lifted her arms, bare-breasted like the women here.\u003c/p\u003e\n\u003cp\u003eOnly she glowed in the shadows.\u003c/p\u003e\n\u003cp\u003eA hushed amazement spread through the tribespeople.\u003c/p\u003e\n\u003cp\u003eMonk gaped at Susan himself. She glowed even brighter than when he had first seen her. Significantly brighter. Her skin shone with an inner moonlight, turning her skin almost translucent.\u003c/p\u003e\n\u003cp\u003eRyder motioned to Monk, urging him from the sideline to continue.\u003c/p\u003e\n\u003cp\u003eRattled, Monk collected himself. He stepped to Susan, dropped to his knees, and shouted the only word he knew in the cannibals\u0027 language, taught to him by a toothless pirate.\u003c/p\u003e\n\u003cp\u003eA name.\u003c/p\u003e\n\u003cp\u003e\"RANGDA!\" Monk called out, naming the cannibals\u0027 queen of the island, mistress of the lagoon\u0027s glowing demons.\u003c/p\u003e\n\u003cp\u003eGlowing like Susan.\u003c/p\u003e\n\u003cp\u003eHe bowed down.\u003c/p\u003e\n\u003cp\u003e\"All hail the witch queen of the islands!\"\u003c/p\u003e\n\u003cp\u003e1:04 A.M.\u003c/p\u003e\n\u003cp\u003eDevesh entered Lisa\u0027s room, tapping his cane.\u003c/p\u003e\n\u003cp\u003eSprawled in bed, hooked to an IV, Lisa knew she could not stall any longer. Earlier, as she was hauled back onto the ship from the tender dock, she had swooned in her guard\u0027s arms, catching him by surprise and collapsing with a bone-jarring thud to the deck.\u003c/p\u003e\n\u003cp\u003eLisa had split her lip doing so, but she\u0027d had to make it look convincing. It hadn\u0027t been hard. With her calf sliced open by a sword, her body torn and lacerated in hundreds of places by the clawed grip of the predatory squids, and her lungs still coarse from the near drowning, only adrenaline had kept her on her feet.\u003c/p\u003e\n\u003cp\u003eSo she had collapsed, even passing out for a few breaths.\u003c/p\u003e\n\u003cp\u003eThe act had her rushed up to the scientific suite, where she was treated by the ship\u0027s doctor and one of the WHO medical staff. Her leg had been cleaned and stitched, along with the worst of her lacerations. An IV catheter was established, streaming in fluids, antibiotics, and pain relievers. She now lay in her old room, an inside cabin with no balcony or window, under guard. Beneath the thin sheet, her body was a patchwork of bandages and taped gauze.\u003c/p\u003e\n\u003cp\u003eSuch care was not administered out of mercy or compassion. It was done to serve one end: to make sure she completed her promise to Devesh atop the deck.\u003c/p\u003e\n\u003cp\u003eThe Judas Strain. I know what it\u0027s doing.\u003c/p\u003e\n\u003cp\u003eFor such a revelation, Devesh was not about to lose her, especially with Susan Tunis vanished somewhere on the storm-swept island. Devesh needed Lisa. So she stretched her advantage, stalling. She had tasked Devesh with some busywork, various assignments for the head of his clinical labs.\u003c/p\u003e\n\u003cp\u003eHer justification: to test and confirm her hypothesis.\u003c/p\u003e\n\u003cp\u003eBut that could stretch for only so long.\u003c/p\u003e\n\u003cp\u003e\"So,\" Devesh said. \"Results are being compiled right now. It\u0027s time to have our little delayed chat. If I don\u0027t like what I hear, we\u0027ll begin slowly reversing all your medical care. I imagine reopening your wound with pliers will persuade you to cooperate.\"\u003c/p\u003e\n\u003cp\u003eDevesh turned on a heel and waved to a waiting nurse.\u003c/p\u003e\n\u003cp\u003eLisa\u0027s IV catheter was quickly pulled and taped over.\u003c/p\u003e\n\u003cp\u003eLisa sat up. The room swam a bit, then steadied.\u003c/p\u003e\n\u003cp\u003eEver the gentleman, Devesh held out a thick cotton robe with the ship\u0027s logo. Lisa stood up, draped in a thin hospital gown, but naked underneath. She tolerated his politeness to pull on the robe and cover herself. She cinched the belt snugly.\u003c/p\u003e\n\u003cp\u003e\"This way, Dr. Cummings.\" Devesh crossed back to the door.\u003c/p\u003e\n\u003cp\u003eBarefoot, Lisa was led out of her cabin. Devesh headed across to the infectious-disease suite.\u003c/p\u003e\n\u003cp\u003eThe door stood open. Voices could be heard.\u003c/p\u003e\n\u003cp\u003eFollowing Devesh inside, Lisa immediately recognized two familiar faces: the bacteriologist, Benjamin Miller, and her confidant since arriving, the Dutch toxicologist Henri Barnhardt. The two clinicians were seated on one side of a narrow table.\u003c/p\u003e\n\u003cp\u003eLisa glanced around. The back half of the suite had been emptied of all furniture and refilled with laboratory equipment, much of it stolen from Monk\u0027s gear: fluorescence microscopes, scintillation and auto-gamma spectrometers, carbon dioxide incubators, refrigerated centrifuges, microliter and ELISA readers, and along one wall, a small fraction collector.\u003c/p\u003e\n\u003cp\u003eSome universities weren\u0027t so well equipped.\u003c/p\u003e\n\u003cp\u003eDr. Eloise Chenier, the Guild\u0027s virologist and chief administrator of the infectious-disease lab, stood on the other side of the table, dressed in an ankle length lab coat. In her late fifties, with salt-and-pepper hair and a pair of read ing glasses hung on a chain around her neck, she looked like some quaint schoolmarm.\u003c/p\u003e\n\u003cp\u003eThe virologist had an arm raised to a pair of computer stations behind her. Data flowed across one monitor, the other displayed a jumble of overlapping files. She was just finishing some explanation with Henri and Miller, accented heavily in French.\u003c/p\u003e\n\u003cp\u003e\"We gained an excellent viral load by washing a sample of the cerebral spinal fluid through a series of phosphate buffers, then fixed it with glutaralde-hyde, and pelleted it by centrifugation.\"\u003c/p\u003e\n\u003cp\u003eChenier noted their arrival and waved them to the table.\u003c/p\u003e\n\u003cp\u003eDevesh joined his colleague while Lisa found an empty stool next to Henri. Her friend placed a reassuring hand on her knee. Henri glanced at her, his expression asking, Are you okay?\u003c/p\u003e\n\u003cp\u003eShe nodded, glad to be seated.\u003c/p\u003e\n\u003cp\u003eDevesh turned to Lisa. \"We\u0027ve completed all the ancillary tests you requested, Dr. Cummings. Perhaps now you can explain why?\"\u003c/p\u003e\n\u003cp\u003eHis accusing gaze weighed heavily on her.\u003c/p\u003e\n\u003cp\u003eLisa took a deep breath. She had delayed for as long as possible. Her only hope for further survival was to offer the truth and pray her ingenuity proved of great enough value to overcome her earlier betrayal.\u003c/p\u003e\n\u003cp\u003eShe remembered Devesh\u0027s first lesson: Be useful.\u003c/p\u003e\n\u003cp\u003eLisa started slowly, relating her discovery of the strange retinal glow in Susan\u0027s eyes. But as she spoke, she read the disbelief shining already in Devesh\u0027s expression.\u003c/p\u003e\n\u003cp\u003eLisa turned to Henri, seeking substantiation. \"Were you able to perform the fluorescent assay on the spinal fluid sample?\"\u003c/p\u003e\n\u003cp\u003e\"Ja. The fluid sample did demonstrate a low fluorescence.\"\u003c/p\u003e\n\u003cp\u003eChenier agreed. \"I spun the sample down. The bacterial pellet did glow. And was confirmed to be cyanobacteria.\"\u003c/p\u003e\n\u003cp\u003eMiller, the bacteriologist, nodded his agreement.\u003c/p\u003e\n\u003cp\u003eDevesh\u0027s skepticism shifted to interest. His eyes focused back to Lisa. \"And from this, you determined the bacteria migrated from the brain, down the optic nerve, and colonized the fluids of the eye. So you ordered the second spinal tap.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-54.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
