{"id":104813,"no":60,"title":"Page 60","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eGray noted the wavering uncertainty in Nasser\u0027s countenance.\u003c/p\u003e\n\u003cp\u003eOh, please, God, let Vigor convince him.\u003c/p\u003e\n\u003cp\u003eVigor continued. \"Once you follow the trail to the end, then make your decision. About them, about us. It would be foolish to destroy hostages or resources until you discover what lies at the true end of that trail.\"\u003c/p\u003e\n\u003cp\u003eNasser sank to his seat. \"So then show me where it ends. Convince me, Monsignor.\"\u003c/p\u003e\n\u003cp\u003e\"And if I do so, as a man of honor, will you keep Gray\u0027s parents alive?\"\u003c/p\u003e\n\u003cp\u003eNasser waved a hand. \"Fine. For now. But if you are lying, Monsignor . ..\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not.\" Vigor lowered to one knee before the table.\u003c/p\u003e\n\u003cp\u003eGray joined him.\u003c/p\u003e\n\u003cp\u003eVigor shifted forward three sheets of paper: the map of Angkor, the obelisk\u0027s angelic code, and the line of three symbols from the keys. The monsignor lifted the sheet of angelic code.\u003c/p\u003e\n\u003cp\u003e\"As Commander Pierce has already related, all the blacked-out diacritical marks—the circles that accent the script—actually represent temple sites that make up Angkor.\"\u003c/p\u003e\n\u003cp\u003eNasser nodded.\u003c/p\u003e\n\u003cp\u003e\"And here again are the three symbols from the keys.\u003c/p\u003e\n\u003cp\u003e\"Now compare these three symbols to the matching circled symbols on the obelisk. What do you see different?\"\u003c/p\u003e\n\u003cp\u003eNasser leaned forward, as did Gray.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s three blacked-out circles on the symbols on the obelisk,\" Nasser said.\u003c/p\u003e\n\u003cp\u003e\"Representing three temples,\" Vigor said. \"Now, how many blacked-out circles are there among the three key symbols.\"\u003c/p\u003e\n\u003cp\u003e\"Only one,\" Gray said. He understood now. He had been so certain he had solved the puzzle earlier that he had failed to look one step further. \"One temple. That blacked-out circle doesn\u0027t just represent the Portuguese castle—it represents one of the temples!\"\u003c/p\u003e\n\u003cp\u003eGray shifted the map to him and took a pen to circle the corresponding temple and connected them.\u003c/p\u003e\n\u003cp\u003eNasser leaned closer to read the temple marked on the map of Angkor. \"Bayon.\" He leaned back. \"But how can you be sure it\u0027s significant?\"\u003c/p\u003e\n\u003cp\u003e\"The Bayon was the last temple ever built in Angkor,\" Vigor said. \"Built about the time Marco came through the area. The strange thing about the temple is that after it was constructed, all building stopped in the area.\"\u003c/p\u003e\n\u003cp\u003e\"But what\u0027s there?\" Nasser asked.\u003c/p\u003e\n\u003cp\u003eVigor shrugged. \"I have no idea. Perhaps the source of the Judas Strain, perhaps some other answer. All I know is that Marco believed it was important enough to preserve. And even if I\u0027m wrong, after following this trail halfway around the world, why stop when you are only steps from the very end?\"\u003c/p\u003e\n\u003cp\u003eNasser stared around the room.\u003c/p\u003e\n\u003cp\u003eSeichan stirred. \"We can be there in half an hour, Amen. It\u0027s worth at least going there.\"\u003c/p\u003e\n\u003cp\u003eGray feared to agree with them, lest he only stir up Nasser\u0027s wrath.\u003c/p\u003e\n\u003cp\u003eVigor was not as bashful. \"Marco went to much trouble to preserve the location of this temple. The Vatican mystics went through as much trouble to secure it in code. Even the locals here claim the temple still holds many hidden treasures. It bears investigation.\"\u003c/p\u003e\n\u003cp\u003eKowalski raised his hand. \"And I have to take a leak. Bad.\"\u003c/p\u003e\n\u003cp\u003eNasser frowned, but he gained his feet. \"We\u0027ll head over there. To the Bayon. But if there\u0027s nothing discovered by noon, it\u0027s over.\"\u003c/p\u003e\n\u003cp\u003eNasser lifted the phone to his ears. \"Annishen, stay that execution order.\"\u003c/p\u003e\n\u003cp\u003eGray reached and gripped Vigor\u0027s knee under the table.\u003c/p\u003e\n\u003cp\u003eThank you.\u003c/p\u003e\n\u003cp\u003eVigor glanced to him with an expression that read, We aren\u0027t out of the woods yet.\u003c/p\u003e\n\u003cp\u003eNasser proved it. \"Annishen, the one parent you chose. We\u0027ll spare their life as per my word to the monsignor. But we\u0027ll still need some incentive to encourage the commander\u0027s continued and heartfelt cooperation.\"\u003c/p\u003e\n\u003cp\u003eNasser\u0027s eyes fixed to Gray. \"For every hour in which we don\u0027t have satisfactory results, cut off one finger. And since we\u0027ve stalled here for much longer than an hour due to Commander Pierce\u0027s futile attempts to barter, you may take that first finger now.\"\u003c/p\u003e\n\u003cp\u003eNasser snapped his phone closed.\u003c/p\u003e\n\u003cp\u003eGray knew silence would serve him better, but the words were out of his mouth before he could stop them. \"You goddamn bastard. 1 will kill you.\"\u003c/p\u003e\n\u003cp\u003eUnperturbed, Nasser turned away. \"By the way, Commander Pierce, the parent Annishen chose ... it was your mother.\"\u003c/p\u003e\n\u003cp\u003e6:55 P.M.\u003c/p\u003e\n\u003cp\u003eAs the hood was ripped from her head, Harriet knew something was wrong, dreadfully wrong.\u003c/p\u003e\n\u003cp\u003eShe had been dragged from a closet where she\u0027d been locked up and forced to sit on a steel chair. With the hood pulled away, she saw they were in an abandoned warehouse. The space was cavernous, with concrete floors and walls. Steel exposed beams and pipes ran across the ceiling, and chains hung from rusted pulleys. It smelled of motor oil and burned rubber.\u003c/p\u003e\n\u003cp\u003eHarriet glanced around.\u003c/p\u003e\n\u003cp\u003eNo windows. The only light came from a few bare bulbs, pooling patches in the darkness. A steel staircase rose to one side. Beside it, an old freight elevator stood open.\u003c/p\u003e\n\u003cp\u003eIt all appeared deserted—except for their captors.\u003c/p\u003e\n\u003cp\u003eA step away to the left Annishen leaned on a table, a cell phone at her ear, standing silent. It appeared she was listening in to some conversation. A pistol lay on the table, next to a pair of bolt cutters and a small blowtorch. Three other men patrolled the basement\u0027s darkness.\u003c/p\u003e\n\u003cp\u003eDirectly across from her Harriet\u0027s husband sat slumped in a similar chair. Like Harriet, his wrists were in handcuffs. One of the three men stood guard over him with a hand on a holstered pistol. But Jack was no threat. His head hung, trailing a rope of drool. They had stripped him of his pants. He had urinated on himself, soaking the front of his boxers. His left leg, from the knee down, was strapped into his prosthesis. The old industrial accident had stripped so much of Jack\u0027s pride. Nature had taken the rest.\u003c/p\u003e\n\u003cp\u003eAnd not just nature.\u003c/p\u003e\n\u003cp\u003eHarriet felt the weight of the unused pills in her sweater pocket.\u003c/p\u003e\n\u003cp\u003eTears welled up and streamed down her face.\u003c/p\u003e\n\u003cp\u003eAnnishen spoke, finishing her call with a snap of her cell phone. She faced Harriet and motioned to another of the guards. \"Undo her cuffs.\"\u003c/p\u003e\n\u003cp\u003eHarriet did not object. She lifted her arms to allow the handcuffs to be keyed open. Their weight fell away. She rubbed her wrists.\u003c/p\u003e\n\u003cp\u003eWhat was going on ?\u003c/p\u003e\n\u003cp\u003eObeying a signal from Annishen, one of the men dragged her in her chair over to the table. The loud squeak of steel on cement drew up her husband\u0027s bleary face.\u003c/p\u003e\n\u003cp\u003e\"Harriet. . .\" he mumbled. \"What time is it?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay, Jack,\" she mumbled tenderly. \"Go back to sleep.\"\u003c/p\u003e\n\u003cp\u003eAnnishen stepped over to him. \"I don\u0027t think so. He\u0027s done enough sleeping. Those little pills you gave him finally kicked in, really knocked him out. But now it\u0027s time to wakey-wake.\" She cupped his chin and pulled his face up. \"Hold him like this,\" she instructed his guard. \"He should watch the show.\"\u003c/p\u003e\n\u003cp\u003eJack did not offer any fight as the man pinned his head.\u003c/p\u003e\n\u003cp\u003eAnnishen returned to the table, wiping Jack\u0027s drool on her pant leg. She nodded to the guard beside Harriet\u0027s chair. He reached over, grabbed Harriet\u0027s left arm, and yanked it hard over the tabletop, pinning her wrist against the wood.\u003c/p\u003e\n\u003cp\u003eInstinctively, Harriet fought back, but the man just dragged her arm farther, stretching her limb until her armpit was jammed against the table\u0027s edge. She felt the cold muzzle of a pistol against her cheek, held by the third guardsman.\u003c/p\u003e\n\u003cp\u003eAnnishen sauntered over. \"It seems we must teach your son a little lesson, Mrs. Pierce.\"\u003c/p\u003e\n\u003cp\u003eShe picked up the blowtorch and pulled the trigger on the self-igniter. A blue flame spat out the torch\u0027s muzzle with a sharp hiss. She settled it to the table near her hand. \"For cauterizing the stump.\"\u003c/p\u003e\n\u003cp\u003e\"What. . . what are you doing?\"\u003c/p\u003e\n\u003cp\u003eIgnoring her the woman picked up the bolt cutters, pulling the handles wide. \"Now which finger shall we cut off first?\"\u003c/p\u003e\n\u003cp\u003e6:01 a.m.\u003c/p\u003e\n\u003cp\u003eGray rode in the backseat of a white van. Seichan sat pressed against his side, the pair of them pinned between two armed guards. Nasser faced them from the bench seat ahead, flanked by more guards.\u003c/p\u003e\n\u003cp\u003eKowalski and Vigor rode in the vehicle behind theirs. Another two vans followed front and rear, piled in with more khaki-dressed gunmen.\u003c/p\u003e\n\u003cp\u003eNasser was taking no chances.\u003c/p\u003e\n\u003cp\u003eThrough the windshield, Gray dully watched the spires of Angkor Wat rise out of the mists ahead, five massive corncob-shaped towers, lit by the first rays of the rising sun. Angkor Wat was the first of many temples spread across a hundred square miles of ruins. It was also the largest and best preserved, considered a Cambodian icon, with its immense jumble of chambers, walls, scalloped towers, carvings and statues. This temple alone covered five hundred acres, encircled by a wide moat.\u003c/p\u003e\n\u003cp\u003eBut it was not their goal.\u003c/p\u003e\n\u003cp\u003eThey were headed to Angkor Thorn, another mile north. And while not as large as Angkor Wat, the walled ruins of Thorn housed the great Bayon temple, considered to be the heart of all of Angkor.\u003c/p\u003e\n\u003cp\u003eA resounding bump shook the van.\u003c/p\u003e\n\u003cp\u003eGray caught his own reflection in the rearview mirror. His cheeks were sunken, shadowed, his lips cracked, the stubble over his jaw and chin looked like a black bruise. Only his eyes still shone flinty and hard, fueled by his anger and vengeance. But deeper in his chest, there remained only grief and guilt.\u003c/p\u003e\n\u003cp\u003eSeichan, perhaps sensing him sinking into a numbing despair, gripped his hand in her own. It was not a tender gesture. She squeezed hard, nails biting, refusing to let him slip away, dragging him from the edge of that well.\u003c/p\u003e\n\u003cp\u003eNasser noted her gesture. A shadow of a sneer appeared, then vanished away again. \"And I thought you were smarter than that, Commander,\" he muttered. \"Is she fucking you yet?\"\u003c/p\u003e\n\u003cp\u003eGray focused back at him. \"Shut the hell up.\"\u003c/p\u003e\n\u003cp\u003eNasser laughed, once, sharp, amused. \"No? Too bad. If you\u0027re being screwed over, you should at least get something out of it.\"\u003c/p\u003e\n\u003cp\u003eSeichan slipped her hand from Gray\u0027s. \"Fuck you, Amen.\"\u003c/p\u003e\n\u003cp\u003e\"Not anymore, Seichan. Not after I kicked you out of bed.\" Nasser\u0027s eyes turned to Gray. \"Did you know? That we were once lovers?\"\u003c/p\u003e\n\u003cp\u003eGray snapped a glance toward Seichan. Surely Nasser was lying. How could she . . . with the bastard who had just ordered his mother\u0027s torture? Just the thought of his mother spilled more acid into his stomach. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-60.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
