{"id":104826,"no":74,"title":"Page 74","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe tourist motioned to the tuk-tuk, silently requesting if they might take it. Lisa nodded and hobbled away with Susan across the uneven plaza of stone blocks. Ahead, Lisa spotted men inside the temple: leaning on towers, standing above gateways, patrolling atop walls. They all wore khaki and black berets.\u003c/p\u003e\n\u003cp\u003eWas it the Cambodian army?\u003c/p\u003e\n\u003cp\u003eSusan dragged her forward, plodding purposefully toward the eastern gate. A pair of men in berets stood guard. They had rifles on their shoulders. Lisa saw no insignias. The man on the left, plainly Cambodian, bore a set of raked scars down one side of his face. The other, similarly attired, was Caucasian, leather-skinned with a scruffy growth of beard. Both men\u0027s eyes were diamond hard.\u003c/p\u003e\n\u003cp\u003eThese were not members of the Cambodian army.\u003c/p\u003e\n\u003cp\u003eMercenaries.\u003c/p\u003e\n\u003cp\u003e\"The Guild,\" Lisa whispered, remembering the intelligence Painter had passed to her regarding Gray\u0027s capture. They\u0027re already here.\u003c/p\u003e\n\u003cp\u003eLisa tugged Susan to a stop, but the woman struggled to pull away, to continue on.\u003c/p\u003e\n\u003cp\u003e\"Susan, we can\u0027t hand you back over to the Guild,\" Lisa said.\u003c/p\u003e\n\u003cp\u003eEspecially not after Monk gave his life to free you.\u003c/p\u003e\n\u003cp\u003eSusan\u0027s voice was muffled through her blanket, but it sounded firm. \"No choice ... I must. .. without the cure, all will be lost...\" Susan shook her head. \". . . one chance. The cure must be forged.\"\u003c/p\u003e\n\u003cp\u003eLisa understood. She remembered Devesh\u0027s warning and Painter\u0027s confirmation. The pandemic was already spreading. The world needed the cure before it was too late. Even if it landed in the hands of the Guild, it had to be brought forth. They\u0027d deal with the consequences after that.\u003c/p\u003e\n\u003cp\u003eStill...\u003c/p\u003e\n\u003cp\u003e\"Are you sure there\u0027s no other way?\" Lisa asked.\u003c/p\u003e\n\u003cp\u003eSusan\u0027s words trembled with fear and grief. \"I wish to God there was. We may already be too late.\" She gently removed Lisa\u0027s hand from her sleeve and stumbled forward, plainly intending to go alone.\u003c/p\u003e\n\u003cp\u003eLisa followed. She also had no choice.\u003c/p\u003e\n\u003cp\u003eThey approached the guarded gateway. Lisa did not know how they would talk themselves through the barricade.\u003c/p\u003e\n\u003cp\u003eBut apparently Susan had a plan.\u003c/p\u003e\n\u003cp\u003eShe shed her blanket, letting it drop away at her heels. In the brightness of the sun, she looked no different from anyone else, only perhaps more pale, her skin thin and wan. She clawed away the sunglasses and turned to stare into the full face of the sun.\u003c/p\u003e\n\u003cp\u003eLisa watched Susan\u0027s body quake, imagining the blinding brunt striking through the woman\u0027s pupils, to the optic nerve, to her brain.\u003c/p\u003e\n\u003cp\u003eBut apparently it still was not enough.\u003c/p\u003e\n\u003cp\u003eSusan ripped away her blouse, exposing more skin to the sunlight. She unbuttoned her pants, and as gaunt as she was from her weeks in stupor, they fell way. In only her bra and panties, Susan approached the gate.\u003c/p\u003e\n\u003cp\u003eThe guards did not know what to make of the near-naked woman. Still, they stepped forward to block the way. The Cambodian soldier waved them off in sharp, piercing words. \"D\u0027tay! Bpel k\u0027raowee!\"\u003c/p\u003e\n\u003cp\u003eSusan ignored him and continued, intending to pass between them.\u003c/p\u003e\n\u003cp\u003eThe other guard grabbed the woman\u0027s shoulder, half turning her. His stoic expression clenched, agonized. He whipped his hand back. His palm was seared a beet red; his fingertips trailed blood as he fell back and collapsed against the wall.\u003c/p\u003e\n\u003cp\u003eThe Cambodian hauled up his rifle, pointing it at the back of Susan\u0027s head as she continued past.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t!\" Lisa shouted.\u003c/p\u003e\n\u003cp\u003eThe rifleman glanced back at her.\u003c/p\u003e\n\u003cp\u003e\"Take us!\" she said, struggling for the name Painter had used in relating Gray\u0027s story. Then she remembered. \"Take us to Amen Nasser!\"\u003c/p\u003e\n\u003cp\u003e10:48 A.M.\u003c/p\u003e\n\u003cp\u003e\"Come see this!\" Vigor called, unable to keep the amazement from his voice. He glanced back, searching for the others.\u003c/p\u003e\n\u003cp\u003eGray stood a few yards away, examining one of the foundation pillars. The pylons were stacks of unmortared sandstone disks, a foot thick and a full three feet across. Gray fingered several deep cracks, stress fractures of an aging spine.\u003c/p\u003e\n\u003cp\u003eOff in the room\u0027s center, Seichan and Kowalski stood by the stone face, watching Nasser\u0027s demolition team prepare the carved block.\u003c/p\u003e\n\u003cp\u003eAgain the sharp, grinding whine of a diamond drill bit rang out, echoing loudly in the barrel vault. Another inch-thin bore was cored a foot into the face. Already charges were being packed into the other holes and wired up, twice as many as they had used for the altar. Ropes hung down to ferry equipment and explosives up and down the well.\u003c/p\u003e\n\u003cp\u003eA shaft of bright sunlight illuminated their labors.\u003c/p\u003e\n\u003cp\u003eUnlike Seichan and Kowalski, Vigor had not been able to watch the mutilation. Even now he swung away and returned his attention to the wall he had been studying. Away from the central shaft, the vault here lay in deep shadow. Vigor had been allowed a flashlight so he could hunt for another entrance to the subterranean cavern. And while he hated to help Nasser, if he could find another way down, then he could perhaps limit the degree of defilement to these ancient ruins.\u003c/p\u003e\n\u003cp\u003eBut Vigor hadn\u0027t been granted much time.\u003c/p\u003e\n\u003cp\u003eTen minutes.\u003c/p\u003e\n\u003cp\u003eWith preparations under way, Nasser had climbed out of the vault. Vigor had noted him checking his cell phone, searching for a signal. Apparently unsuccessful, he had climbed out, ordering them to be ready by the time he returned.\u003c/p\u003e\n\u003cp\u003eGray joined Vigor. \"What is it? Did you find that doorway you were looking for?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" Vigor admitted. He had walked the entire circumference of the vault. There was no other door. It seemed the only way down was through the stone face of bodhisattva Lokesvara. \"But I did find this.\"\u003c/p\u003e\n\u003cp\u003eVigor waited for one of the patrolling guards to pass, then shifted his flashlight flat against the wall, casting the beam up the surface. Lit by shadow and light, an expanse of wall etchings appeared, reminiscent of the bas-reliefs above. But it depicted no figures, just cascading tangles.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" Gray said, reaching his fingers out to examine what the light\u003c/p\u003e\n\u003cp\u003erevealed.\u003c/p\u003e\n\u003cp\u003eBy now, Seichan and Kowalski had joined them.\u003c/p\u003e\n\u003cp\u003eVigor shifted the light, widening the beam to illustrate. \"At first, I thought it was just decorative scrollwork. It covers all the walls.\" He waved an arm to encompass the breadth of the chamber. \"Every surface.\"\u003c/p\u003e\n\u003cp\u003e\"Then what the hell is it?\" Kowalski muttered.\u003c/p\u003e\n\u003cp\u003e\"Not hell, Mr. Kowalski,\" Vigor said. \"This is angelic.\"\u003c/p\u003e\n\u003cp\u003eVigor took the light and cupped it over a small fraction of the carved tapestry. \"Look closer.\"\u003c/p\u003e\n\u003cp\u003eGray leaned to the wall, tracing with his fingers. Understanding dawned in the commander\u0027s face. \"It\u0027s made up of angelic symbols, all jumbled together.\"\u003c/p\u003e\n\u003cp\u003eSeichan joined Gray, following his fingers, nose to nose. \"This is impossible. Didn\u0027t you say angelic script was devised by someone in the sixteen-hundreds?\"\u003c/p\u003e\n\u003cp\u003eVigor nodded. \"Johannes Trithemius.\"\u003c/p\u003e\n\u003cp\u003e\"How could it be here?\" Gray asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" Vigor said. \"Maybe at some point the Vatican did send someone all the way to Cambodia to follow Marco\u0027s trail like we did. Maybe they returned with etchings of this script, and Trithemius somehow got ahold of it. Devised his script from it. And if he knew Marco\u0027s story of glowing angelic beings, it might be why he claimed the script was angelic.\"\u003c/p\u003e\n\u003cp\u003eGray turned to Vigor. \"But you don\u0027t believe that, do you?\"\u003c/p\u003e\n\u003cp\u003eVigor watched Gray step back, retreat a few more steps, his gaze fixed to the wall.\u003c/p\u003e\n\u003cp\u003eHe sees it, too.\u003c/p\u003e\n\u003cp\u003eVigor took a deep shuddering breath, trying to restrain what he suspected. \"Trithemius claimed he gained knowledge of the script after weeks of fasting and deep meditative study. I think that\u0027s exactly what happened.\"\u003c/p\u003e\n\u003cp\u003eSeichan scoffed. \"He just happened to dream all this up, a match to the ancient script here.\"\u003c/p\u003e\n\u003cp\u003eVigor nodded. \"That\u0027s exactly what I\u0027m saying. Remember what I told you before, about how angelic script bears a striking resemblance to Hebrew. Trithemius even claimed his script was the purest distillation of the Hebrew alphabet.\"\u003c/p\u003e\n\u003cp\u003eSeichan shrugged.\u003c/p\u003e\n\u003cp\u003e\"What do you know about Jewish Kabbalah?\" Vigor asked.\u003c/p\u003e\n\u003cp\u003e\"Just that it\u0027s some Jewish mystical study.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly. Practitioners of Kabbalah search for mystical insight into the divine nature of the universe by studying the Hebrew Bible. They believe that divine wisdom lies buried in the very shapes and curves of the Hebrew alphabet. And that by meditating upon them, one can gain great insight into the universe, into who we are at the most basic level.\"\u003c/p\u003e\n\u003cp\u003eSeichan shook her head. \"Are you saying that this Trithemius fellow meditated and came up with this purer form of Hebrew? Stumbled upon a language—this same language—\" She patted the wall. \"A language that links to some great inner wisdom?\"\u003c/p\u003e\n\u003cp\u003eGray cleared his throat. \"And 1 think inner is the key word here.\" He waved Seichan to step back, to join him. \"What do you see? Look at the whole pattern. Does it look familiar to you?\"\u003c/p\u003e\n\u003cp\u003eSeichan stared for a single breath, then snapped, \"I don\u0027t know. What am I looking for?\"\u003c/p\u003e\n\u003cp\u003eGray sighed and stepped to the wall. He ran a finger along one of the cascades. \"Look at the way it swirls down in spirals of broken helixes. Picture this section all by itself.\"\u003c/p\u003e\n\u003cp\u003eSeichan squinted. \"It looks almost biological.\"\u003c/p\u003e\n\u003cp\u003eGray nodded. \"Follow the strands. Don\u0027t they look like double helixes of DNA? Like a genetic map?\"\u003c/p\u003e\n\u003cp\u003eSeichan remained doubtful. \"Written in an angelic language?\"\u003c/p\u003e\n\u003cp\u003eGray stepped away, his eyes still on the wall. \"Maybe. In fact, there was a scientific study that compared patterns in DNA code with patterns found in human languages. According to a Zipf\u0027s law—a statistical tool—all human languages show a specific pattern of repetitive word usage. Such as the frequency the word the or a. Or the rarity of other words, like aardvark or elliptical. When you plot a graph comparing the popularity of words against the frequency of their usage, you get a straight line. And it\u0027s the same whether English, Russian, or Chinese. All human languages produce the same linear pattern.\"\u003c/p\u003e\n\u003cp\u003e\"And DNA code?\" Vigor asked, intrigued.\u003c/p\u003e\n\u003cp\u003e\"It produced exactly the same pattern. Even in our junk DNA, which most scientists consider to be biological garbage. The study has been repeated and verified. For some reason, there is a language buried in our genetic code. We don\u0027t know what it says. But—\" Gray pointed at the wall. \"That may be the written form of the language.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-74.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
