{"id":104831,"no":79,"title":"Page 79","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSeichan waved to the door. \"There\u0027s more writing under the name.\"\u003c/p\u003e\n\u003cp\u003eVigor nodded. \"A quote from the Bible., book of Matthew, chapter twenty-eight, concerning the resurrection of Jesus from his tomb.\" Vigor read the quote aloud. \" \u0027Behold, there was a great earthquake, for an angel of the Lord descended from the sky, and came and rolled away the stone from the door, and sat on it.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a lot of help.\"\u003c/p\u003e\n\u003cp\u003eIt was.\u003c/p\u003e\n\u003cp\u003eVigor stared up at the crucifix carved into a bronze medallion above the door. He said a silent prayer and made the sign of the cross.\u003c/p\u003e\n\u003cp\u003eBefore he could finish, he felt the ground shake under his knees. A great crash of rock echoed behind him, sounding as if the cavern had collapsed.\u003c/p\u003e\n\u003cp\u003eSeichan retreated, taking the light, off to investigate. \"Stay here!\"\u003c/p\u003e\n\u003cp\u003eDarkness descended, chilling him. Though he could no longer read the words, they blazed in his mind.\u003c/p\u003e\n\u003cp\u003eBehold, there was a great earthquake. . .\u003c/p\u003e\n\u003cp\u003e11:52 P.M.\u003c/p\u003e\n\u003cp\u003eGray knelt over Lisa as the resounding shock rattled through the cavern. Kowalski sheltered her other side. One of the stalactites broke away from the roof and plunged into the pool\u0027s depth. From where it had broken off, a scatter of deep cracks radiated outward, spanning the limestone roof.\u003c/p\u003e\n\u003cp\u003eSusan crouched halfway down the spar of rock as it thrust out into the glowing lake. All around the waters trembled with vibrations, sloshing back and forth. The stirring churned up more acidic wash, choking the air.\u003c/p\u003e\n\u003cp\u003eRich with the Judas Strain.\u003c/p\u003e\n\u003cp\u003eSmaller concussions struck above, pounding like cannonballs against the roof of the cavern.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happening?\" Lisa yelled.\u003c/p\u003e\n\u003cp\u003e\"Nasser\u0027s bomb,\" he gasped out, ears ringing.\u003c/p\u003e\n\u003cp\u003eEarlier, Gray had examined the foundation pillars of the Bayon. He had found the columns riddled with fissures and cracks, pressure fractures from old age and from periodic shifts in the earth. Gray imagined that the concussion of the double-strength bomb had widened the fissures even more. And then the wash of acid—splashing outward and flowing into all those cracks— had dissolved the hearts out of the pylons.\u003c/p\u003e\n\u003cp\u003e\"One of the foundation pillars must have collapsed,\" he said. \"Taking down a section of the temple with it.\"\u003c/p\u003e\n\u003cp\u003eGray stared up.\u003c/p\u003e\n\u003cp\u003eThe tumbling of stone blocks had stopped—but for how long? He swung around to Susan. She stood up, slowly, warily. She glanced back, plainly wanting to return to shore. But instead, she turned and continued onward.\u003c/p\u003e\n\u003cp\u003ePast her shoulders the twin beams of sunlight glowed even brighter as the noon hour struck, the full face of the sun baking down atop the ruins.\u003c/p\u003e\n\u003cp\u003e\"Will it hold long enough?\" Lisa asked, staring out at Susan.\u003c/p\u003e\n\u003cp\u003e\"It\u0027ll have to.\"\u003c/p\u003e\n\u003cp\u003eGray had no doubt that if another foundation pillar collapsed, the temple\u0027s weight would flatten this limestone bubble like a pancake. He pulled Lisa to her feet. They couldn\u0027t stay. Even if the pillars held, the lake was near to erupting.\u003c/p\u003e\n\u003cp\u003eThe entire pool now glowed, from shore to shore. Where the twin beams of sunlight struck, the waters had begun to bubble, gasping out more toxin into the air, more of the Judas Strain.\u003c/p\u003e\n\u003cp\u003eThey had to leave.\u003c/p\u003e\n\u003cp\u003eDown the spur of rock, Susan reached its end and sat down, hugging one knee. She kept her back to them, perhaps fearful if she saw them she would lose her nerve and come running back. She looked so alone, so frightened.\u003c/p\u003e\n\u003cp\u003eA racking cough shook through Gray. His lungs burned. He could taste the caustic toxin on his tongue. They could wait no longer.\u003c/p\u003e\n\u003cp\u003eLisa knew it, too. Her eyes were bloodshot, weeping heavily from both the sting of the air and from the fear for her friend.\u003c/p\u003e\n\u003cp\u003eSusan had no choice. Neither did they.\u003c/p\u003e\n\u003cp\u003eThey headed toward the distant archway. A flickering light halfway ahead revealed Seichan running back. Alone. Where was Vigor?\u003c/p\u003e\n\u003cp\u003eAnother crack of rock blasted above.\u003c/p\u003e\n\u003cp\u003eGray cringed, fearing another avalanche.\u003c/p\u003e\n\u003cp\u003eThe reality was worse.\u003c/p\u003e\n\u003cp\u003eThe stone plug shattered out of the rooftop, raining down chunks of the block. Sunlight blazed down. A large slab bearing a corner of an upturned lip splashed leadenly into the water, swamping Susan. More pieces struck like depth charges.\u003c/p\u003e\n\u003cp\u003eTriumphant voices echoed from above.\u003c/p\u003e\n\u003cp\u003eGray heard Nasser\u0027s voice call out. \"They have to be down there!\"\u003c/p\u003e\n\u003cp\u003eBut Nasser wasn\u0027t the worst danger at the moment.\u003c/p\u003e\n\u003cp\u003eThe full face of the sun blazed unfiltered upon the lake, combusting the pool. Already primed, close to critical mass, the bubbling became an instant boil, erupting in vast expulsions, coughing up gouts of gas and water.\u003c/p\u003e\n\u003cp\u003eThe pool was blowing.\u003c/p\u003e\n\u003cp\u003eThey\u0027d never make it to the stairs.\u003c/p\u003e\n\u003cp\u003eGray backpedaled, dragging Kowalski and Lisa with him a few steps. He yelled at Seichan. \"Drop flat! Now!\"\u003c/p\u003e\n\u003cp\u003eHe obeyed his own advice, waving Lisa and Kowalski down. Gray grabbed the abandoned tarp they\u0027d used to transport Susan. He dragged it over all three of them, trying to trap as much air as possible.\u003c/p\u003e\n\u003cp\u003e\"Pin your edges close to the stone!\" he ordered the others.\u003c/p\u003e\n\u003cp\u003eBeyond the tarp he heard the crackles of boiling water, furious, hissing angry—then a deep sonorous whoop, as if the entire lake had jumped a foot then dropped. Water washed his ankles, then swept away.\u003c/p\u003e\n\u003cp\u003eThe air under the tarp turned to liquid fire.\u003c/p\u003e\n\u003cp\u003eThe three of them huddled, gasping, coughing, choking.\u003c/p\u003e\n\u003cp\u003e\"Susan,\" Lisa finally croaked out.\u003c/p\u003e\n\u003cp\u003e12:00 P.M.\u003c/p\u003e\n\u003cp\u003eSusan screamed.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t cry with mere lungs, or the flutter of vocal cords. She howled out of the core of her being.\u003c/p\u003e\n\u003cp\u003eShe could not escape the agony. Her mind, still attuned by sunlight, continued its detailed recording of every sensation. Forbidden from oblivion, her being scribed every detail: the sear of her lungs, the fire in her eyes, the flaying of her skin. She burned from the inside out, propelling her cry to the heavens.\u003c/p\u003e\n\u003cp\u003eBut was there anyone to hear?\u003c/p\u003e\n\u003cp\u003eAs she expelled all of herself upward, she finally found her release.\u003c/p\u003e\n\u003cp\u003eShe fell back to the stone.\u003c/p\u003e\n\u003cp\u003eHer heart clenched one last time, squeezing out the last of her.\u003c/p\u003e\n\u003cp\u003eThen nothing.\u003c/p\u003e\n\u003cp\u003eI2:01 P.M.\u003c/p\u003e\n\u003cp\u003e\"What about Susan?\" Lisa gasped.\u003c/p\u003e\n\u003cp\u003eGray risked a peek from under a flap of tarp, craning back toward the rocky spar. The lake still boiled, burning under the fiery sun. The air above the lake shimmered with an oily miasma.\u003c/p\u003e\n\u003cp\u003eBut the worst flow of gasses spiraled upward, through the opening, drafting up the flue of the Bayon\u0027s central spire, turning tower into chimney.\u003c/p\u003e\n\u003cp\u003eGray knew it was the only reason they lived.\u003c/p\u003e\n\u003cp\u003eIf the cavern had still been sealed . . .\u003c/p\u003e\n\u003cp\u003eOut on the spar another of their party had not fared as well. Susan lay sprawled on her back, as still as a statue. Gray could not tell if she was breathing. In fact, it was hard to see her shape against the glare of the sunlight.\u003c/p\u003e\n\u003cp\u003eAnd that\u0027s when he realized it.\u003c/p\u003e\n\u003cp\u003eThe rocky spar did not extend fully into the stream of sunlight.\u003c/p\u003e\n\u003cp\u003eSusan still lay in shadow—but she no longer glowed. The brightness in her had blown out like a candle.\u003c/p\u003e\n\u003cp\u003eWhat did that mean?\u003c/p\u003e\n\u003cp\u003eOverhead, screams echoed down from the temple, now awash with the pool\u0027s toxic expulsion. Gray also heard more stones striking the roof of the cavern. The caustic gas had further weakened the precarious balance of stone above their heads.\u003c/p\u003e\n\u003cp\u003e\"We have to get out of the cavern,\" Gray said.\u003c/p\u003e\n\u003cp\u003e\"What about Susan?\" Lisa asked.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll have to trust she had enough exposure. Whatever she needed to happen, hopefully happened.\" Gray rolled to his knees, coughing hard. They all needed the cure now. He stared over to Kowalski. \"Get Lisa to the stairs.\"\u003c/p\u003e\n\u003cp\u003eKowalski pushed up. \"Don\u0027t have to tell me twice.\"\u003c/p\u003e\n\u003cp\u003eLisa clutched Gray\u0027s wrist as he stood, keeping the tarp over their heads. \"What are you going to do?\"\u003c/p\u003e\n\u003cp\u003e\"I have to get Susan.\"\u003c/p\u003e\n\u003cp\u003eLisa pinched around to see—then covered her mouth. The lake still roiled heavily, popping with gas. \"Gray, you\u0027ll never make it.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll have to.\"\u003c/p\u003e\n\u003cp\u003e\"But I don\u0027t see her moving. 1 think the sudden explosion was too much.\"\u003c/p\u003e\n\u003cp\u003eGray remembered Marco\u0027s story, of his forced cannibalism, drinking the blood and eating the flesh of another man to live. \"1 don\u0027t think it matters if she\u0027s alive or dead. We just need her body.\"\u003c/p\u003e\n\u003cp\u003eLisa flinched at the callousness of his words, but she did not object.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to need the tarp,\" Gray said.\u003c/p\u003e\n\u003cp\u003eKowalski nodded, clutching Lisa by the arm. \"Fine by me. I\u0027m taking the girl.\"\u003c/p\u003e\n\u003cp\u003eGray whisked away from them, cocooning himself in the tarp. He wrapped his head, leaving only a slit to peer out. He heard Kowalski and Lisa running down the strand.\u003c/p\u003e\n\u003cp\u003eAnother boulder crashed onto the cavern roof from the temple above.\u003c/p\u003e\n\u003cp\u003eAs good as a starter\u0027s pistol.\u003c/p\u003e\n\u003cp\u003eKeeping his head low, Gray sprinted down the causeway.\u003c/p\u003e\n\u003cp\u003eThirty yards.\u003c/p\u003e\n\u003cp\u003eThat\u0027s all.\u003c/p\u003e\n\u003cp\u003eThere and back.\u003c/p\u003e\n\u003cp\u003eSteps from the shore, Gray bulled into the rising miasma of toxin. He held his breath. Still, it was like hitting a wall of fire. His eyes immediately burned, squeezing his vision to a pinpoint, while tears turned the rest of his sight into a watery blur. Barely able to see, he closed his lids, pulled the slit shut, and ran blind, counting his steps.\u003c/p\u003e\n\u003cp\u003eAt thirty he risked a fast peek. An inferno greeted him.\u003c/p\u003e\n\u003cp\u003eBut through the pain he spied an outflung arm. A step away. He took that step, bent down, and grabbed the arm. Luckily she no longer glowed, no longer burned. Still, he could not pick her up. He retreated, dragging her. The tarp tangled his feet, slowing him down. He finally tossed it aside, taking one breath before he did so.\u003c/p\u003e\n\u003cp\u003eIt dropped him to a knee.\u003c/p\u003e\n\u003cp\u003eHis chest clenched, his throat closed in protest.\u003c/p\u003e\n\u003cp\u003eSwallowing flames.\u003c/p\u003e\n\u003cp\u003eHe pushed up, dragging blind, stumbling, hurrying.\u003c/p\u003e\n\u003cp\u003eHis skin ran with fire, as if lashed with steel-studded whips.\u003c/p\u003e\n\u003cp\u003eNot going to make it.\u003c/p\u003e\n\u003cp\u003eFire.\u003c/p\u003e\n\u003cp\u003eFlame.\u003c/p\u003e\n\u003cp\u003eBurn.\u003c/p\u003e\n\u003cp\u003eHe tripped, went down to a knee.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eThen he was rising again—but not on his own.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got you,\" she said in his ear.\u003c/p\u003e\n\u003cp\u003eSeichan.\u003c/p\u003e\n\u003cp\u003eShe had an arm under him, dragging him bodily. His toes scraped the stones as he struggled to gain his footing. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-79.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
