{"id":104763,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eSighing, Lindholm stepped next to her and tapped the chart. \"Under the list of presenting symptoms and physical findings. At the bottom.\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Moderate to severe signs of exposure,\u0027\" she mumbled, reading down the list. The last line stated deep dermal second-degree sunburn to calves, with resultant edema and severe blistering.\u003c/p\u003e\n\u003cp\u003eShe glanced up. She had treated similar symptoms all morning. \"This wasn\u0027t just a sunburn.\"\u003c/p\u003e\n\u003cp\u003e\"The island\u0027s clinicians jumped to that conclusion,\" Lindholm said with evident disgust.\u003c/p\u003e\n\u003cp\u003eLisa could not blame the island\u0027s doctors or nurses. At that time, no one was aware of the environmental disaster brewing. She again checked the date.\u003c/p\u003e\n\u003cp\u003eFive weeks ago.\u003c/p\u003e\n\u003cp\u003e\"I believe we may have found Patient Zero,\" Lindholm said pompously. \"Or at least one of the earliest cases.\"\u003c/p\u003e\n\u003cp\u003eLisa closed the folder. \"Can I see him?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"That was the second reason I came down here.\" There was a grim waver in his voice at the end that disturbed Lisa. She waited for him to explain, but he simply turned on a heel and headed out. \"Follow me.\"\u003c/p\u003e\n\u003cp\u003eThe WHO leader crossed the dining room to one of the ship\u0027s elevators. He hit the button for the Promenade Deck, third level.\u003c/p\u003e\n\u003cp\u003e\"The isolation ward?\" she asked.\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003eA moment later the doors opened into a makeshift clean room. Lindholm waved for her to don one of the bio-suits, similar to the one Monk had taken to collect samples.\u003c/p\u003e\n\u003cp\u003eLisa climbed into a suit, noting the slight body odor as she pulled the hood over her head and sealed her seams. Once both were ready, she was led down a passage to one of the cabins. The door was open and other clinicians were crowded at the entry.\u003c/p\u003e\n\u003cp\u003eLindholm bellowed for the others to clear a path. They scattered, well trained by their leader. Lindholm led Lisa into the small room, an inside cabin, no windows. The only bed stood against the back wall.\u003c/p\u003e\n\u003cp\u003eA figure lay under a thin blanket. He looked more cadaverous than alive. But she noted the shallow rise and fall of the blanket, a panting weak breath. Intravenous lines ran to an exposed arm. The skin on the limb so wan and wasted as to the point of translucency.\u003c/p\u003e\n\u003cp\u003eShe instinctively looked to his face. Someone had shaved him, but hastily. A few nicks still oozed. His hair was gray and wispy, like a chemo patient, but his eyes were open, meeting hers.\u003c/p\u003e\n\u003cp\u003eFor a moment she thought she noted a flash of recognition, the barest startle. Even a hand lifted feebly toward her.\u003c/p\u003e\n\u003cp\u003eBut Lindholm strode between them. Ignoring the patient, he peeled back the lower half of the blanket to expose the man\u0027s legs. She was expecting to see scabbed skin, healing from a second-degree burn, like she had been treating all day, but instead she saw that a strange purplish bruising stretched from the man\u0027s groin to toe, pebbled with black blisters.\u003c/p\u003e\n\u003cp\u003e\"If you had read further into the report,\" Lindholm said, \"you would have discovered these new symptoms arose four days ago. The hospital staff surmised tropical gangrene, secondary to the deep infection in the burns. But it\u0027s actually—\"\u003c/p\u003e\n\u003cp\u003e\"Necrotizing fasciitis,\" she finished.\u003c/p\u003e\n\u003cp\u003eLindholm sniffed tightly and lowered the blanket. \"Exactly. That\u0027s what we thought.\"\u003c/p\u003e\n\u003cp\u003eNecrotizing fasciitis, better known as flesh-eating disease, was caused by bacteria, usually beta-hemolytic streptococci.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s the assessment?\" she asked. \"A secondary infection through his earlier wounds?\"\u003c/p\u003e\n\u003cp\u003e\"I had our bacteriologist brought in. A quick gram stain last night revealed a massive proliferation of Propionibacterium.\"\u003c/p\u003e\n\u003cp\u003eShe frowned. \"That makes no sense. That\u0027s just an ordinary epidermal bacterium. Nonpathogenic. Are you sure it wasn\u0027t just a contaminant.\"\u003c/p\u003e\n\u003cp\u003e\"Not in the numbers found in the blisters. The stains were repeated on other tissue samples. The same results. It was during these second studies that an odd necrosis was noted in the surrounding tissue. A pattern of decay sometimes seen locally. It can mimic necrotizing fasciitis.\"\u003c/p\u003e\n\u003cp\u003e\"Caused by what?\"\u003c/p\u003e\n\u003cp\u003e\"The sting of a stonefish. Very toxic. The fish looks like a rock but bears stiff dorsal spines envenomed by poison glands. One of the nastiest venoms in the world. 1 brought Dr. Barnhardt in to test the tissue.\"\u003c/p\u003e\n\u003cp\u003e\"The toxicologist?\"\u003c/p\u003e\n\u003cp\u003eA nod.\u003c/p\u003e\n\u003cp\u003eDr. Barnhardt had been flown here from Amsterdam, an expert in environmental poisons and toxins. Under the auspices of Sigma, Painter had personally requested the man\u0027s addition to the WHO team.\u003c/p\u003e\n\u003cp\u003e\"The results came back this past hour. He found active poison in the patient\u0027s tissues.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand. So the man was poisoned by a stonefish while wandering in delirium?\"\u003c/p\u003e\n\u003cp\u003eA voice spoke behind her, answering her question. \"No.\"\u003c/p\u003e\n\u003cp\u003eShe turned. A tall figure filled the doorway, a bear of a man squeezed into a contamination suit too small for his girth. His grizzled and bearded face fit his size, but not the delicacy of his mind. Dr. Henrick Barnhardt pushed into the room.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t believe the man was ever stung by a stonefish. But he is suffering from the venom.\"\u003c/p\u003e\n\u003cp\u003e\"How is that possible?\"\u003c/p\u003e\n\u003cp\u003eBarnhardt ignored her question for the moment and addressed the WHO leader. \"It\u0027s what I suspected, Dr. Lindholm. I borrowed Dr. Miller\u0027s Propionibacterium cultures and had them analyzed. There is no doubt now.\"\u003c/p\u003e\n\u003cp\u003eLindholm visibly blanched.\u003c/p\u003e\n\u003cp\u003e\"What?\" Lisa asked.\u003c/p\u003e\n\u003cp\u003eThe toxicologist reached and gently straightened the blanket over the John Doe patient, a tender gesture for such a large man. \"The bacteria,\" he said, \"the Propionibacterium ... is producing the equivalent of stonefish venom, pumping it out in quantities enough to dissolve this man\u0027s tissues.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s impossible.\"\u003c/p\u003e\n\u003cp\u003eLindholm snorted. \"That\u0027s what I said.\"\u003c/p\u003e\n\u003cp\u003eLisa ignored him. \"But Propionibacterium doesn\u0027t produce any toxins. It\u0027s benign.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t explain how or why,\" Barnhardt said. \"Even to begin any further assessment, I would need a scanning microscope at least. But I assure you, Dr. Cummings, this benign bacteria has somehow transformed into one of the nastiest bugs on the planet.\"\u003c/p\u003e\n\u003cp\u003e\"How do you mean transformed?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think the patient caught this bug. I think it was a part of his normal bacterial flora. Whatever the man was exposed to out there, it changed the bacterium\u0027s biochemistry, altered it\u0027s basic genetic structure and made it virulent. Turned it into a flesh-eater.\"\u003c/p\u003e\n\u003cp\u003eLisa still refused to believe it. Not without more proof. \"My partner, Dr. Kokkalis, has a portable forensic lab assembled in our suite. If you could—\"\u003c/p\u003e\n\u003cp\u003eLisa felt something brush the back of her gloved hand. She almost jumped away, startled. But it was only the old man in the bed, reaching again for her. His eyes met hers, desperate. His lips, chapped and cracked, trembled with a dry breath.\u003c/p\u003e\n\u003cp\u003eSue . .. Susan . ..\u003c/p\u003e\n\u003cp\u003eShe turned and gripped the man\u0027s fingers. Plainly he was still in a delirium, mistaking her for someone else. She squeezed reassurance.\u003c/p\u003e\n\u003cp\u003e\"Susan . . . where\u0027s Oscar? 1 can hear him barking in the woods. . .\" His eyes rolled back in his head. \". . . barking . . . help him . . . but don\u0027t. . . don\u0027t go in the water .. .\" She felt his fingers go slack in her grip. His eyelids drifted closed, dragging away the brief moment of confused lucidity.\u003c/p\u003e\n\u003cp\u003eA nurse stepped forward and checked the man\u0027s vitals. He was out again.\u003c/p\u003e\n\u003cp\u003eLisa tucked his hand back under his blanket.\u003c/p\u003e\n\u003cp\u003eLindholm stepped forward, close, invading her space. \"This forensics lab of Dr. Kokkalis\u0027s. We must gain access to it as soon as possible. In order to confirm or dismiss this wild conjecture by Dr. Barnhardt.\"\u003c/p\u003e\n\u003cp\u003e\"I would prefer to wait for Monk\u0027s return,\" Lisa said, stepping back. \"Some of the equipment is of special design. We will need his expertise to operate it without damage.\"\u003c/p\u003e\n\u003cp\u003eLindholm scowled—not so much at her as life in general. \"Fine.\" He swung away. \"Your partner is due back in the next hour. Dr. Barnhardt, in the meantime collect whatever samples you\u0027ll need.\"\u003c/p\u003e\n\u003cp\u003eA nod by the Dutch toxicologist acknowledged the order—though Lisa noted the slight roll to Barnhardt\u0027s eyes as the WHO leader departed. Lisa followed Lindholm out of the room.\u003c/p\u003e\n\u003cp\u003eBarnhardt called after her. \"You will page me when Dr. Kokkalis returns, ja?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\" She was as anxious as everyone else to discover the truth here. But she also feared they were still barely scratching the surface. Something dreadful was brewing here.\u003c/p\u003e\n\u003cp\u003eBut what?\u003c/p\u003e\n\u003cp\u003eShe hoped Monk would not be gone long.\u003c/p\u003e\n\u003cp\u003eAs she left, she also remembered the patient\u0027s last words. Don\u0027t . . . don\u0027t go in the water. . .\u003c/p\u003e\n\u003cp\u003e11:53 A M\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll have to swim for it,\" Monk said.\u003c/p\u003e\n\u003cp\u003e\"Are ... are you crazy?\" Graff answered as they cowered behind the rock.\u003c/p\u003e\n\u003cp\u003eMoments ago the pirates\u0027 speedboat had ground up against a submerged reef, one of the many that gave rise to the name for this section of island: Smithson\u0027s Blight. Out on the water, the gunfire had ended, replaced by the roar of the engine as the boat sought to drag itself free.\u003c/p\u003e\n\u003cp\u003eMonk had popped his head up to evaluate the scenario, only to almost lose an ear to a sniper\u0027s bullet. They were still pinned down, trapped, with nowhere to run—except into the face of the enemy.\u003c/p\u003e\n\u003cp\u003eMonk bent down and unzipped one of his suit\u0027s seals near his shin. He reached through the opening and removed the 9mm Glock from its ankle holster.\u003c/p\u003e\n\u003cp\u003eGraff\u0027s eyes widened as he pulled free the pistol. \"Do you think you can take them all out? Hit the gas tank or something?\"\u003c/p\u003e\n\u003cp\u003eMonk shook his head and zipped back up. \"You\u0027ve been watching too many Bruckheimer movies. This peashooter will only serve to get them to duck their heads. Perhaps long enough for us to hit the surf over there.\"\u003c/p\u003e\n\u003cp\u003eHe pointed to a line of boulders that stretched out into the water. If they could get on the far side, keep the boulders between them and the boat, they might be able to make it around the next point. Then if they could reach the beach on the far side before the pirates freed their boat.. . and if there was some path that led into the island\u0027s interior .. . \u003c/p\u003e","sourceLink":"https://allnovel.net/the-judas-strain-sigma-force-4/page-9.html","bookId":1529,"creation":"Oct 5, 2019 10:39:28 PM","modification":"Oct 5, 2019 10:39:28 PM"}
