{"id":42537,"no":11,"title":"CHAPTER X FRENCH’S HOTEL","content":"\u0026nbsp;Pietro had one of those mean and malignant natures that are best pleased when they are instrumental in bringing others into trouble. He looked forward to becoming a padrone himself some time, and seemed admirably fitted by nature to exercise the inhuman office. He lost no time, on his return, in making known to his uncle what he had learned. \n\u003cdiv\u003e\n For the boys to appropriate to their own use money which had been received for their services was, in the eyes of the padrone, a crime of the darkest shade. In fact, if the example were generally followed, it would have made a large diminution of his income, though the boys might have been benefited. He listened to Pietro with an ominous scowl, and decided to inflict condign punishment upon the young offenders.\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile Phil and Giacomo resumed their wanderings. They no longer hoped to make up the large difference between what they had and the sum they were expected by the padrone to bring. As the evening advanced the cold increased, and penetrated through their thin clothing, chilling them through and through. Giacomo felt it the most. By and by he began to sob with the cold and fatigue.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is the matter, Giacomo?” asked Phil, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I feel so cold, Filippo—so cold and tired. I wish I could rest.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys were in Printing House Square, near the spot where now stands the Franklin statue.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you want to rest, Giacomo,” said Phil, pityingly, “we will go into French’s Hotel a little while.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They entered the hotel and sat down near the heater. The grateful warmth diffused itself through their frames, and Giacomo sank back in his seat with a sigh of relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you feel better, Giacomo?” asked his comrade.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Filippo; I wish I could stay here till it is time to go home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We will, then. We shall get no more money outside.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The padrone——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will beat us at any rate. It will be no worse for us. Besides they may possibly ask us to play here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can play no more to-night, Filippo, I am so tired.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil knew very little of sickness, or he might have seen that Giacomo was going to be ill. Exposure, fatigue, and privation had been too much for his strength. He had never been robust, and he had been subjected to trials that would have proved hard for one much stronger to bear.\n\u003c/div\u003e \n\u003cdiv\u003e\n When he had once determined to remain in the comfortable hotel, Phil leaned back in his chair also, and decided to enjoy all the comfort attainable. What though there was a beating in prospect?\n\u003c/div\u003e \n\u003cdiv\u003e\n He had before him two or three hours of rest and relief from the outside cold. He was something of a philosopher, and chose not to let future evil interfere with present good.\n\u003c/div\u003e \n\u003cdiv\u003e\n Near the two boys sat two young men—merchants from the interior of New York State, who were making a business visit to the metropolis.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Gardner,” said the first, “where shall we go to-night?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why need we go anywhere?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you might like to go to some place of amusement.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I would if the weather were less inclement. The most comfortable place is by the fire.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are right as to that, but the evening will be long and stupid.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, we can worry it through. Here, for instance, are two young musicians,” indicating the little fiddlers. “Suppose we get a tune out of them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Agreed. Here, boy, can you play on that fiddle?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, give us a tune, then. Is that your brother?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, he is my comrade.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He can play, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you play, Giacomo?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The younger boy roused himself. The two stood up, and played two or three tunes successfully. A group of loungers gathered around them and listened approvingly. When they had finished Phil took off his hat and went the rounds. Some gave, the two first mentioned contributing most liberally. The whole sum collected was about fifty cents.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil and Giacomo now resumed their seats. They felt now that they were entitled to rest for the remainder of the evening, since they had gained quite as much as they would have been likely to earn in wandering about the streets. The group that had gathered about them dispersed, and they ceased to be objects of attention. Fatigue and the warmth of the room gradually affected Giacomo until he leaned back and fell asleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t take him till it’s time to go back,” thought Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n So Giacomo slept on, despite the noises in the street outside and the confusion incident to every large hotel. As he sat asleep, he attracted the attention of a stout gentleman who was passing, leading by the hand a boy of ten.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that your brother?” he asked in a low tone of Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, signore; it is my comrade.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you go about together?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” answered Phil, bethinking himself to use English instead of Italian.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He seems tired.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; he is not so strong as I am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you play about the streets all day?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How would you like that, Henry?” asked his father to the boy at his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to play about the streets all day,” said Henry, roguishly, misinterpreting the word “play.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think you would get tired of it. What is your name, my boy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Filippo.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what is the name of your friend?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Giacomo.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you never go to school?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you like to go?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You would like it better than wandering about the streets all day?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why do you not ask your father to send you to school?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My father is in Italy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And his father, also?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Si, signore,” answered Phil, relapsing into Italian.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you think of that, Henry?” asked the gentleman. “How should you like to leave me, and go to some Italian city to roam about all day, playing on the violin?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I would rather go to school.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think you would.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you often out so late, Filippo? I think that is the name you gave me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil shrugged his shoulders\n\u003c/div\u003e \n\u003cdiv\u003e\n “Always,” he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “At what time do you go home?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At eleven.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is too late for a boy of your age to sit up. Why do you not go home sooner?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The padrone would beat me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is the padrone?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The man who brought me from Italy to America.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Poor boys!” said the gentleman, compassionately. “Yours is a hard life. I hope some time you will be in a better position.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil fixed his dark eyes upon the stranger, grateful for his words of sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-night,” said the stranger, kindly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-night, signore.”\n\u003c/div\u003e \n\u003cdiv\u003e\n An hour passed. The City Hall clock near by struck eleven. The time had come for returning to their mercenary guardian. Phil shook the sleeping form of Giacomo. The little boy stirred in his sleep, and murmured, “Madre.” He had been dreaming of his mother and his far-off Italian home. He woke to the harsh realities of life, four thousand miles away from that mother and home.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have I slept, Filippo?” he asked, rubbing his eyes, and looking about him in momentary bewilderment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Giacomo. You have slept for two hours and more. It is eleven o’clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then we must go back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; take your violin, and we will go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They passed out into the cold street, which seemed yet colder by contrast with the warm hotel they just left, and, crossing to the sidewalk that skirts the park, walked up Centre street.\n\u003c/div\u003e \n\u003cdiv\u003e\n Giacomo was seized with a fit of trembling. His teeth chattered with the cold. A fever was approaching, although neither he nor his companion knew it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you cold, Giacomo?” asked Phil, noticing how he trembled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am very cold. I feel sick, Filippo.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will feel better to-morrow,” said Phil; but the thought of the beating which his little comrade was sure to receive saddened him more than the prospect of being treated in the same way himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n They kept on their way, past the Tombs with its gloomy entrance, through the ill-lighted street, scarcely noticed by the policeman whom they passed—for he was accustomed to see boys of their class out late at night—until at last they reached the dwelling of the padrone, who was waiting their arrival with the eagerness of a brutal nature, impatient to inflict pain.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2995/82629.html","bookId":317,"creation":"Aug 11, 2019 6:05:00 AM","modification":"Aug 11, 2019 6:05:00 AM"}
