{"id":42540,"no":14,"title":"CHAPTER XIII PHIL FINDS A CAPITALIST","content":"\u0026nbsp;To account for Phil’s unexpected loss, I must explain that Tim Rafferty, whose ordinary place of business was in or near the City Hall Park, had been sent uptown on an errand. He was making his way back leisurely, when, just as he was passing Burnton’s bookstore, he saw Phil looking in at the window. He immediately recognized him as the little Italian fiddler who had refused to lend him his fiddle, as described in a previous chapter. In his attempt he was frustrated by Paul Hoffman. His defeat incensed him, and he determined, if he ever met Phil again, to “get even with him,” as he expressed it. It struck him that this was a good opportunity to borrow his fiddle without leave. \n\u003cdiv\u003e\n When Phil discovered his loss, he determined to run after the thief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Give me back my fiddle!” he cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n But this Tim was in no hurry to do. As he had longer legs than Phil, the chances were that he would escape. But some distance ahead he saw one of the blue-coated guardians of the public peace, or, in newsboy parlance, a cop, and saw that Phil could easily prove theft against him, as it would be impossible to pass himself off as a fiddler. He must get rid of the violin in some way, and the sooner the better. He threw it into the middle of the street, just as a heavy cart was coming along. The wheels of the ponderous vehicle passed over the frail instrument, crushing it utterly. Phil ran forward to rescue his instrument, but too late. It was spoiled beyond recovery. Phil picked up the pieces mechanically, and took them back with him, but he soon realized that he might as well cast them away again. Meanwhile Tim, satisfied with the mischief he had done, and feeling revenged for his former mortification, walked up a side street, and escaped interference.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil had come to one of those crises in human experience when it is necessary to pause and decide what to do next. The fiddle was not a valuable one—in fact, it was a shabby little instrument—but it was Phil’s stock in trade. Moreover, it belonged to the padrone, and however innocent Phil might be as regarded its destruction, his tyrannical master was sure to call him to heavy account for it. He was certain to be severely punished, more so than the evening before, and this was not a pleasant prospect to look forward to. The padrone was sure not to forgive an offense like this.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thinking over these things, a bold suggestion came into Phil’s mind. Why need he go back at all? Why should he not take this occasion for breaking his fetters, and starting out into life on his own account? There was nothing alarming in that prospect. He was not afraid but that he could earn his own living, and fare better than he did at present, when out of his earnings and those of his comrades the padrone was growing rich. Other boys had run away, and though some had been brought back, others had managed to keep out of the cruel clutches of their despotic master.\n\u003c/div\u003e \n\u003cdiv\u003e\n It did not take Phil long to come to a decision. He felt that he should never have a better chance. He had three dollars in his pocket thanks to the generosity of the sailors—and this would last him some time. It would enable him to get out of the city, which would be absolutely necessary, since, if he remained, the padrone would send Pietro for him and get him back.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was only one regret he had at leaving the padrone. It would part him from his little comrade, Giacomo. Giacomo, at least, would miss him. He wished the little boy could have gone with him, but this, under present circumstances, was impossible. By staying he would only incur a severe punishment, without being able to help his comrade.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was still but nine o’clock. He had plenty of time before him, as he would not be missed by the padrone until he failed to make his appearance at night. Having no further occasion to go uptown, he decided to turn and walk down into the business portion of the city. He accordingly made his way leisurely to the City Hall Park, when he suddenly bethought himself of Paul Hoffman, who had served as his friend on a former occasion. Besides Giacomo, Paul was the only friend on whom he could rely in the city. Paul was older and had more experience than he, and could, no doubt, give him good advice as to his future plans.\n\u003c/div\u003e \n\u003cdiv\u003e\n He crossed the Park and Broadway, and kept along on the west side of the street until he reached the necktie stand kept by Paul. The young street merchant did not at first see him, being occupied with a customer, to whom he finally succeeded in selling two neckties; then looking up, he recognized the young fiddler.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How are you, Phil?” he said, in a friendly manner. “Where have you kept yourself? I have not seen you for a long time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have been fiddling,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I don’t see your violin now. What has become of it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is broken—destroyed,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did that happen?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil described the manner in which his violin had been stolen.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know who stole it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was that boy who tried to take it once in the Park.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When I stopped him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know him. It is Tim Rafferty. He is a mean boy; I will pay him up for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not care for it now,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But what will your padrone say when you come home without it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He would beat me, but I will not go home.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What will you do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will run away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good for you, Phil! I like your spunk,” said Paul, heartily. “I wouldn’t go back to the old villain if I were you. Where are you going?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Away from New York. If I stay here the padrone would catch me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much did you earn with your fiddle when you had it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two dollars, if it was a good day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is excellent. I’ll tell you what, Phil, if you could stay in the city, I would invite you to come and live with us. You could pay your share of the expense, say three or four dollars a week, and keep the rest of your money to buy clothes, and to save.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like it,” said Phil; “but if I stay in the city the padrone would get hold of me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has he any legal right to your services?” asked Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil looked puzzled. He did not understand the question.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean did your father sign any paper giving you to him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Phil, comprehending now.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I suppose he could take you back. You think you must go away from the city, then, Phil?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where do you think of going?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You might go to Jersey—to Newark, which is quite a large city, only ten miles from here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to go there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think the padrone would send there to find you. But how are you going to make your living—you have lost your fiddle?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can sing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you would make more money with your fiddle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Si, signore.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t talk to me in Italian, Phil; I no understand it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can speak English much better than most Italian boys.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Some cannot speak at all. Some speak french, because we all stayed in Paris sometime before we came to America.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Parlez-vous Francais?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oui, monsieur, un peu.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I can’t. Those three words are all the French I know. But, I say, Phil, you ought to have a fiddle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to have one. I should make more money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much would one cost?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell you what I will do, Phil,” said Paul, after a moment’s thought. “I know a pawnbroker’s shop on Chatham Street where there is a fiddle for sale. I don’t think it will cost very much; not more than five dollars. You must buy it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have not five dollars,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I will lend you the money. You shall buy it, and when you have earned money enough you shall come back to New York some day and pay me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said Phil, gratefully. “I will surely pay you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course you will, Phil,” said Paul, confidently. “I can see by your face that you are honest. I don’t believe you would cheat your friend.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would not cheat you, Signor Paul.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see, Phil, you are bound to make an Italian of me. You may just call me Paul, and don’t mind about the signor. Now I’ll tell you what I propose. I cannot leave my business for an hour and a half. You can go where you please, but come back at that time, and I will take you home to dinner with me. On the way back I will stop with you at the Chatham Street store and ask the price of the violin; then, if it doesn’t cost too much, I will buy it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must come back at twelve o’clock, Phil.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil strolled down to the Battery, feeling a little strange without his violin. He was elated with the thought of his coming freedom, and for the first time since he landed in America the future looked bright to him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2995/82632.html","bookId":317,"creation":"Aug 11, 2019 6:05:00 AM","modification":"Aug 11, 2019 6:05:00 AM"}
