{"id":42545,"no":19,"title":"CHAPTER XVIII PHIL ELUDES HIS PURSUER","content":"\u0026nbsp;Phil had already made up his mind where to go. Just across the river was New Jersey, with its flourishing towns and cities, settled to a large extent by men doing business in New York. The largest of these cities was Newark, only ten miles distant. There Phil decided to make his first stop. If he found himself in danger of capture he could easily go farther. This plan Paul approved, and it was to be carried into execution immediately. \n\u003cdiv\u003e\n “I will go down to the Cortlandt Street Ferry with you, Phil,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to have you, if it will not take you from your business, Paolo.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My business can wait,” said Paul. “I mean to see you safe out of the city. The padrone may be in search of you already.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he will send Pietro to find me,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is Pietro?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil explained that Pietro was the padrone’s nephew and assisted in oppressing the boys.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope he will send him,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil looked up in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to see this Pietro. What would he do if he should find you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He would take me back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you did not want to go?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I couldn’t help it,” said Phil, shrugging his shoulders. “He is much bigger than I.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he bigger than I am?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he is as big.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He isn’t big enough to take you away if I am with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul did not say this boastfully, but with a quiet confidence in his own powers in which he was justified. Though by no means quarrelsome, he had on several occasions been forced in self-defense into a contest with boys of his own size, and in some instances larger, and in every case he had acquitted himself manfully, and come off victorious.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should not be afraid if you were with me, Paolo,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are right, Phil,” said Paul, approvingly. “But here we are at the ferry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Cortlandt Street is a short distance below the Astor House, and leads to the ferry, connecting on the other side with trains bound for Philadelphia and intermediate places.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul paid the regular toll, and passed through the portal with Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going with me?” asked the little fiddler, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only to Jersey City, Phil. There might be some of your friends on board the boat. I want to see you safe on the cars. Then I must leave you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are very kind, Paolo.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are a good little chap, Phil, and I mean to help you. But the boat is about ready to start. Let us go on board.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They walked down the pier, and got on the boat a minute before it started. They did not pass through to the other end, but, leaning against the side, kept their eyes fixed on the city they were about to leave. They had not long to wait. The signal was heard, and the boat started leisurely from the pier. It was but ten feet distant, when the attention of Paul and Phil was drawn to a person running down the drop in great haste. He evidently wanted to catch the boat, but was too late.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil clutched at Paul’s arm, and pointed to him in evident excitement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is Pietro,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n At that moment Pietro, standing on the brink, caught sight of the boy he was pursuing, looking back at him from the deck of the ferry-boat. A look of exultation and disappointment swept over his face as he saw Phil, but realized that he was out of his reach. He had a hand-organ with him, and this had doubtless encumbered him, and prevented his running as fast as he might otherwise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So that is Pietro, is it?” said Paul, regarding him attentively in order to fix his face in his memory.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Paolo,” said Phil, his eyes fixed nervously upon his pursuer, who maintained his place, and was watching him with equal attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are not frightened, Phil, are you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil admitted that he was.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He will come over in the next boat,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he will not know where you are.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He will seek me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will he? Then I think he will be disappointed. The cars will start on the other side before the next boat arrives. I found out about that before we started.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil felt relieved by this intelligence, but still he was nervous. Knowing well Pietro’s malice, he dreaded the chances of his capturing him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He stays there. He does not go away,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It will do him no good, Phil. He is like a cat watching a canary bird beyond his reach. I don’t think he will catch you to-day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He may go in the cars, too,” suggested Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true. On the whole, Phil, when you get to Newark, I advise you to walk into the country. Don’t stay in the city. He might find you there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will do what you say, Paolo. It will be better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They soon reached the Jersey shore. The railroad station was close by. They went thither at once, and Phil bought a ticket for Newark.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How soon will the cars start?” inquired Paul of a railway official.\n\u003c/div\u003e \n\u003cdiv\u003e\n “In five minutes,” was the answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, Phil, I advise you to get into the cars at once. Take a seat on the opposite side, though there is no chance of your being seen by Pietro, who will get here too late. Still, it is best to be on the safe side. I will stay near the ferry and watch Pietro when he lands. Perhaps I will have a little conversation with him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will go, Paolo.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, good-by, Phil, and good luck,” said Paul, cheerfully. “If you ever come to New York, come to see me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Paolo, I will be sure to come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And, Phil, though I don’t think you will ever fall into the power of that old brute again (I am sure you won’t if you take good care of yourself), still, if he does get you back again, come to me the first chance you get, and I will see what I can do for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Paolo. I will remember your kindness always,” said the little fiddler, gratefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is all right, Phil. Good-by!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-by!” said Phil, and, shaking the hand of his new friend, he ascended the steps, and took a seat on the opposite side, as Paul had recommended.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry to part with Phil,” said Paul to himself. “He’s a fine little chap, and I like him. If ever that old brute gets hold of him again, he shan’t keep him long. Now, Signor Pietro, I’ll go back and see you on your arrival.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil was right in supposing that Pietro would take passage on the next boat. He waited impatiently on the drop till it touched, and sprang on board. He cursed the interval of delay, fearing that it would give Phil a chance to get away. However, there was no help for this. Time and tide wait for no man, but it often happens that we are compelled to wait for them. But at length the boat touched the Jersey shore, and Pietro sprang out and hurried to the gates, looking eagerly on all sides for a possible glimpse of the boy he sought. He did not see him, for the cars were already on their way, but his eyes lighted up with satisfaction as they lighted on Paul, whom he recognized as the companion of Phil. He had seen him talking to the little fiddler. Probably he would know where he had gone. He walked up to Paul, who was standing near, and, touching his cap, said: “Excuse me, signore, but have you seen my little brother?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your little brother?” repeated Paul, deliberately.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Si, signore, a little boy with a fiddle. He was so high;” and Pietro indicated the height of Phil correctly by his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There was a boy came over in the boat with me,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, yes; he is the one, signore,” said Pietro, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And he is your brother?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Si, signore.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s a lie,” thought Paul, “I should know it even if Phil had not told me. Phil is a handsome little chap. He wouldn’t have such a villainous-looking brother as you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you tell me where he has gone?” asked Pietro, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t he tell you where he was going?” asked Paul, in turn.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he means to run away,” said Pietro. “Did you see where he went?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why should he want to run away?” asked Paul, who enjoyed tantalizing Pietro, who he saw was chafing with impatience. “Did you not treat him well?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is a little rascal,” said Pietro. “He is treated well, but he is a thief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you are his brother,” repeated Paul, significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you see where he went?” asked Pietro, getting angry. “I want to take him back to his father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How should I know?” returned Paul, coolly. “Do you think I have nothing to do but to look after your brother?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why didn’t you tell me that before?” said Pietro, incensed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t get mad,” said Paul, indifferently; “it won’t do you any good. Perhaps, if you look round, you will see your brother. I’ll tell him you want him if I see him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Pietro looked at Paul suspiciously. It struck him that the latter might be making a fool of him, but Paul looked so utterly indifferent that he could judge nothing from his appearance. He concluded that Phil was wandering about somewhere in Jersey City.\n\u003c/div\u003e \n\u003cdiv\u003e\n It did not occur to him that he might have taken the cars for some more distant place. At any rate, there seemed no chance of getting any information out of Paul. So he adjusted his hand-organ and walked up the street leading from the ferry, looking sharply on either side, hoping to catch a glimpse of the runaway; but, of course, in vain.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think you’ll find Phil to-day, Signor Pietro,” said Paul to himself, as he watched his receding form. “Now, as there is nothing more to be done here, I will go back to business.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2995/82637.html","bookId":317,"creation":"Aug 11, 2019 6:05:00 AM","modification":"Aug 11, 2019 6:05:00 AM"}
