{"id":42528,"no":2,"title":"CHAPTER I PHIL THE FIDDLER","content":"\u0026nbsp;“Viva Garibaldi!” sang a young Italian boy in an uptown street, accompanying himself on a violin which, from its battered appearance, seemed to have met with hard usage. \n\u003cdiv\u003e\n As the young singer is to be the hero of my story, I will pause to describe him. He was twelve years old, but small of his age. His complexion was a brilliant olive, with the dark eyes peculiar to his race, and his hair black. In spite of the dirt, his face was strikingly handsome, especially when lighted up by a smile, as was often the case, for in spite of the hardships of his lot, and these were neither few nor light, Filippo was naturally merry and light-hearted.\n\u003c/div\u003e \n\u003cdiv\u003e\n He wore a velveteen jacket, and pantaloons which atoned, by their extra length, for the holes resulting from hard usage and antiquity. His shoes, which appeared to be wholly unacquainted with blacking, were, like his pantaloons, two or three sizes too large for him, making it necessary for him to shuffle along ungracefully.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was now ten o’clock in the morning. Two hours had elapsed since Filippo, or Phil, as I shall call him, for the benefit of my readers unfamiliar with Italian names, had left the miserable home in Crosby Street, where he and forty other boys lived in charge of a middle-aged Italian, known as the padrone. Of this person, and the relations between him and the boys, I shall hereafter speak. At present I propose to accompany Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n Though he had wandered about, singing and playing, for two hours, Phil had not yet received a penny. This made him somewhat uneasy, for he knew that at night he must carry home a satisfactory sum to the padrone, or he would be brutally beaten; and poor Phil knew from sad experience that this hard taskmaster had no mercy in such cases.\n\u003c/div\u003e \n\u003cdiv\u003e\n The block in which he stood was adjacent to Fifth Avenue, and was lined on either side with brown-stone houses. It was quiet, and but few passed through it during the busy hours of the day. But Phil’s hope was that some money might be thrown him from a window of some of the fine houses before which he played, but he seemed likely to be disappointed, for he played ten minutes without apparently attracting any attention. He was about to change his position, when the basement door of one of the houses opened, and a servant came out, bareheaded, and approached him. Phil regarded her with distrust, for he was often ordered away as a nuisance. He stopped playing, and, hugging his violin closely, regarded her watchfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re to come in,” said the girl abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Che cosa volete?” (1) said Phil, suspiciously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;(1) “What do you want?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t understand your Italian rubbish,” said the girl. “You’re to come into the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In general, boys of Phil’s class are slow in learning English. After months, and even years sometimes, their knowledge is limited to a few words or phrases. On the other hand, they pick up French readily, and as many of them, en route for America, spend some weeks, or months, in the French metropolis, it is common to find them able to speak the language somewhat. Phil, however, was an exception, and could manage to speak English a little, though not as well as he could understand it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What for I go?” he asked, a little distrustfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My young master wants to hear you play on your fiddle,” said the servant. “He’s sick, and can’t come out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right!” said Phil, using one of the first English phrases he had caught. “I will go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come along, then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil followed his guide into the basement, thence up two flight of stairs, and along a handsome hall into a chamber. The little fiddler, who had never before been invited into a fine house, looked with admiration at the handsome furniture, and especially at the pictures upon the wall, for, like most of his nation, he had a love for whatever was beautiful, whether in nature or art.\n\u003c/div\u003e \n\u003cdiv\u003e\n The chamber had two occupants. One, a boy of twelve years, was lying in a bed, propped up by pillows. His thin, pale face spoke of long sickness, and contrasted vividly with the brilliant brown face of the little Italian boy, who seemed the perfect picture of health. Sitting beside the bed was a lady of middle age and pleasant expression. It was easy to see by the resemblance that she was the mother of the sick boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil looked from one to the other, uncertain what was required of him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you speak English?” asked Mrs. Leigh.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Si, signora, a little,” answered our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My son is sick, and would like to hear you play a little.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And sing, too,” added the sick boy, from the bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil struck up the song he had been singing in the street, a song well known to all who have stopped to listen to the boys of his class, with the refrain, “Viva Garibaldi.” His voice was clear and melodious, and in spite of the poor quality of his instrument, he sang with so much feeling that the effect was agreeable.\n\u003c/div\u003e \n\u003cdiv\u003e\n The sick boy listened with evident pleasure, for he, too, had a taste for music.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I could understand Italian,” he said, “I think it must be a good song.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps he can sing some English song,” suggested Mrs. Leigh.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you sing in English?” she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil hesitated a moment, and then broke into the common street ditty, “Shoe fly, don’t bouder me,” giving a quaint sound to the words by his Italian accent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know any more?” asked Henry Leigh, when our hero had finished.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not English,” said Phil, shaking his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ought to learn more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can play more,” said Phil, “but I know not the words.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then play some tunes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Thereupon the little Italian struck up “Yankee Doodle,” which he played with spirit and evident enjoyment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know the name of that?” asked Henry.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil shook his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is ‘Yankee Doodle.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil tried to pronounce it, but the words in his mouth had a droll sound, and made them laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How old are you?” asked Henry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Twelve years.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you are quite as old as I am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish you were as well and strong as he seems to be,” said Mrs. Leigh, sighing, as she looked at Henry’s pale face.\n\u003c/div\u003e \n\u003cdiv\u003e\n That was little likely to be. Always a delicate child, Henry had a year previous contracted a cold, which had attacked his lungs, and had gradually increased until there seemed little doubt that in the long struggle with disease nature must succumb, and early death ensue.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long have you been in this country?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Un anno.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A year,” said Henry. “I know that, because ‘annus’ means a year in Latin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Si, signor, a year,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And where do you come from?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Da Napoli.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That means from Naples, I suppose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Si, signor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Most of the little Italian musicians to be found in our streets are brought from Calabria, the southern portion of Italy, where they are purchased from their parents, for a fixed sum, or rate of annual payment. But it is usual for them when questioned, to say that they come from Naples, that being the principal city in that portion of Italy, or indeed in the entire kingdom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who do you live with,” continued Henry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “With the padrone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And who is the padrone?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He take care of me—he bring me from Italy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he kind to you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He beat me sometimes,” he answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Beats you? What for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I bring little money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does he beat you hard?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Si, signor, with a stick.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He must be a bad man,” said Henry, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much money must you carry home?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But it isn’t your fault, if people will not give you money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Non importa. He beat me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He ought to be beaten himself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil shrugged his shoulders. Like most boys of his class, to him the padrone seemed all-powerful. The idea that his oppressive taskmaster should be punished for his cruelty had never dawned upon him. Knowing nothing of any law that would protect him, he submitted to it as a necessity, from which there was no escape except by running away. He had not come to that yet, but some of his companions had done so, and he might some day.\n\u003c/div\u003e \n\u003cdiv\u003e\n After this conversation he played another tune. Mrs. Leigh drew out her purse, and gave him fifty cents. Phil took his fiddle under his arm, and, following the servant, who now reappeared, emerged into the street, and moved onward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2995/82620.html","bookId":317,"creation":"Aug 11, 2019 6:05:00 AM","modification":"Aug 11, 2019 6:05:00 AM"}
