{"id":42548,"no":22,"title":"CHAPTER XXI THE SIEGE","content":"\u0026nbsp;When the enemy had fairly been driven out of the house Mrs. McGuire went upstairs in search of Phil. Our hero had come out from his place of concealment, and stood at the window. \n\u003cdiv\u003e\n “Where is Pietro?” he asked, as his hostess appeared in the chamber.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I druv him out of the house,” said Bridget, triumphantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then he won’t come up here?” interrogated Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s I that would like to see him thry it,” said Mrs. McGuire, shaking her head in a very positive manner, “I’d break my broom over his back first.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil breathed freer. He saw that he was rescued from immediate danger.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is he now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s outside watching for you. He’ll have to wait till you come out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “May I stay here till he goes?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure, and you may,” said the warm-hearted Irishwoman. “You’re as welcome as flowers in May. Are you hungry?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, thank you,” said Phil. “I have eaten my dinner.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Won’t you try a bit of bread and cold mate now?” she asked, hospitably.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are very kind,” said Phil, gratefully, “but I am not hungry. I only want to get away from Pietro.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that the haythen’s name? Sure I niver heard it before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is Peter in English.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And has he got the name of the blessed St. Peter, thin? Sure, St. Peter would be mightily ashamed of him. And is he your brother, do you say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He said he was; but I thought it was a wicked lie when he said it. He’s too bad, sure, to be a brother of yours. But I must go down to my work. My clothes are in the tub, and the water will get cold.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you be kind enough to tell me when he goes away?” asked Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure I will. Rest aisy, darlint. He shan’t get hold of you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Pietro’s disappointment may be imagined when he found that the victim whom he had already considered in his grasp was snatched from him in the very moment of his triumph. He felt nearly as much incensed at Mrs. McGuire as at Phil, but against the former he had no remedy. Over the stalwart Irishwoman neither he nor the padrone had any jurisdiction, and he was compelled to own himself ignominiously repulsed and baffled. Still all was not lost. Phil must come out of the house some time, and when he did he would capture him. When that happy moment arrived he resolved to inflict a little punishment on our hero on his own account, in anticipation of that which awaited him from his uncle, the padrone. He therefore took his position in front of the house, and maintained a careful watch, that Phil might not escape unobserved.\n\u003c/div\u003e \n\u003cdiv\u003e\n So half an hour passed. He could hear no noise inside the house, nor did Phil show himself at any of the windows. Pietro was disturbed by a sudden suspicion. What if, while he was watching, Phil had escaped by the back door, and was already at a distance!\n\u003c/div\u003e \n\u003cdiv\u003e\n This would be quite possible, for as he stood he could only watch the front of the house. The rear was hidden from his view. Made uneasy by this thought, he shifted his ground, and crept stealthily round on the side, in the hope of catching a view of Phil, or perhaps hearing some conversation between him and his Amazonian protector by which he might set at rest his suddenly formed suspicions.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was wrong, however. Phil was still upstairs. He was disposed to be cautious, and did not mean to leave his present place of security until he should be apprised by his hostess that Pietro had gone.\n\u003c/div\u003e \n\u003cdiv\u003e\n Bridget McGuire kept on with her washing. She had been once to the front room, and, looking through the blinds, had ascertained that Pietro was still there.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’ll have to wait long enough,” she said to herself, “the haythen! It’s hard he’ll find it to get the better of Bridget McGuire.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She was still at her tub when through the opposite window on the side of the house she caught sight of Pietro creeping stealthily along, as we have described.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll be even wid him,” said Bridget to herself exultingly. “I’ll tache him to prowl around my house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n She took from her sink near by a large, long-handled tin dipper, and filled it full of warm suds from the tub. Then stealing to the window, she opened it suddenly, and as Pietro looked up, suddenly launched the contents in his face, calling forth a volley of imprecations, which I would rather not transfer to my page. Being in Italian, Bridget did not exactly understand their meaning, but guessed it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it there ye are?” she said, in affected surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why did you do that?” demanded Pietro, finding enough English to express his indignation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why did I do it?” repeated Bridget. “How would I know that you were crapin’ under my windy? It serves ye right, anyhow. I don’t want you here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Send out my brother, then,” said Pietro.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s no brother of yours inside,” said Mrs. McGuire.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s a lie!” said Pietro, angrily stamping his foot.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you want it ag’in?” asked Bridget, filling her dipper once more from the tub, causing Pietro to withdraw hastily to a greater distance. “Don’t you tell Bridget McGuire that she lies.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My brother is in the house,” reiterated Pietro, doggedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is no brother of yours—he says so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He lies,” said Pietro.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure and it’s somebody else lies, I’m thinkin’,” said Bridget.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he in the house?” demanded Pietro, finding it difficult to argue with Phil’s protector.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t see him,” said Bridget, shrewdly, turning and glancing round the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll call the police,” said Pietro, trying to intimidate his adversary.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish you would,” she answered, promptly. “It would save me the trouble. I’ll make a charge against you for thryin’ to break into my house; maybe you want to stale something.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Pietro was getting disgusted. Mrs. McGuire proved more unmanageable than he anticipated. It was tantalizing to think that Phil was so near him, and yet out of his reach. He anathematized Phil’s protector in his heart, and I am afraid it would have gone hard with her if he could have had his wishes fulfilled. He was not troubled to think what next to say, for Bridget suddenly terminated the interview by shutting down the window with the remark: “Go away from here! I don’t want you lookin’ in at my windy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Pietro did not, however, go away immediately. He moved a little further to the rear, having a suspicion that Phil might escape from the door at the back. While he was watching here, he suddenly heard the front door open, and shut with a loud sound. He ran to the front, thinking that Phil might be taking flight from the street door, but it was only a ruse of Mrs. McGuire, who rather enjoyed tantalizing Pietro. He looked carefully up and down the street, but, seeing nothing of Phil, he concluded he must still be inside. He therefore resumed his watch, but in some perplexity as to where he ought to stand, in order to watch both front and rear. Phil occasionally looked guardedly from the window in the second story, and saw his enemy, but knew that as long as he remained indoors he was safe. It was not very agreeable remaining in the chamber alone, but it was a great deal better than falling into the clutches of Pietro, and he felt fortunate to have found so secure a place of refuge.\n\u003c/div\u003e \n\u003cdiv\u003e\n Pietro finally posted himself at the side of the house, where he could command a view of both front and rear, and there maintained his stand nearly underneath the window at which his intended prisoner was standing.\n\u003c/div\u003e \n\u003cdiv\u003e\n As Phil was watching him, suddenly he heard steps, and Bridget McGuire entered the chamber. She bore in her hand the same tin dipper before noticed, filled with steaming hot water. Phil regarded her with some surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you like to see some fun now?” she asked, her face covered by a broad smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Phil.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Open the windy, aisy, so he won’t hear.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil obeyed directions, and managed not to attract the attention of his besieger below, who chanced at the moment to be looking toward the door in the rear.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now,” said Bridget, “take this dipper and give him the binifit of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t let him see you do it,” cautioned his protector.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil took the idea and the dipper at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n Phil, holding the dipper carefully, discharged the contents with such good aim that they drenched the watching Pietro. The water being pretty hot, a howl of pain and rage rose from below, and Pietro danced about frantically. Looking up, he saw no one, for Phil had followed directions and drawn his head in immediately. But Mrs. McGuire, less cautious, looked out directly afterward.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will ye go now, or will ye stand jist where I throw the hot water?”\n\u003c/div\u003e \n\u003cdiv\u003e\n In reply, Pietro indulged in some rather emphatic language, but being in the Italian language, in which he was more fluent, it fell unregarded upon the ears of Mrs. McGuire.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I told you to go,” she said. “I’ve got some more wather inside.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Pietro stepped back in alarm. He had no disposition to take another warm shower bath, and he had found out to his cost that Bridget McGuire was not a timid woman, or easily frightened.\n\u003c/div\u003e \n\u003cdiv\u003e\n But he had not yet abandoned the siege. He shifted his ground to the front of the house, and took a position commanding a view of the front door.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2995/82640.html","bookId":317,"creation":"Aug 11, 2019 6:05:00 AM","modification":"Aug 11, 2019 6:05:00 AM"}
