{"id":8496,"no":14,"title":"CHAPTER XIV. ERNEST HAS AN ADVENTURE.","content":"\u0026nbsp;Luke Robbins remained at the farm-house over night and till the middle of the next day. At that hour the sum of money which Mason had withdrawn from the bank was transferred to the party for whom it was intended, and Luke\u0027s mission was at an end. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He received from the farmer the stipulated five dollars and started on his return to Emmonsville, Ezekiel Mason driving him the greater part of the way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Luke arrived at the bank half an hour before it closed and reported his success, including the capture of John Fox. He was congratulated, but noticed that the officers of the bank looked grave.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is anything the matter?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered the cashier. \"At one o\u0027clock yesterday we sent your young friend Ernest with a thousand dollars in United States bonds to the bank at Lee\u0027s Falls. He did not return last night, and we have received no tidings from him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you fear?\" asked Luke, hurriedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We fear that he may have been captured by some of the Fox gang, and be at present in confinement, or else--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Killed or wounded,\" added the cashier.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He could not have met John Fox, for I held him in custody.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There was the other brother, James, who was at large.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"James is the tall brother?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then,\" said Luke, \"I shall have to hunt him, too. Will you grant me leave of absence?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Gladly. We want to recover the bonds, but we care still more for the safety of the boy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Indeed, Ernest had become popular with the bank officials, as well as with the residents of Emmonsville. The cashier spoke truly when he said he cared more for the boy\u0027s safety than for the recovery of the bonds.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can you tell me anything that will help me in my expedition?\" asked Luke. \"Have you any idea where the Fox gang would be likely to carry Ernest?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is generally supposed that the band have a secret rendezvous somewhere within a dozen miles, but no one has been able to discover where it is.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you think that Ernest would be carried there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, they would hardly bring themselves to kill a young boy. He would, of course, be easily overpowered by a grown man, so that there would be no excuse for murderous violence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This spoils all my pleasure at capturing John Fox,\" said Luke, ruefully. \"I should be willing to have him go free if only I could get the boy back. How did the boy go?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He walked.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But it was a long distance.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, about ten miles. We at first thought of providing him with a saddle-horse, but there was one objection.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What was that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He would have been more likely to be suspected of being out on some mission. But on foot he would not be apt to attract attention. A boy of sixteen is not very apt to be a custodian of money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leaving Luke Robbins to start on his search for Ernest, we will go back to the time when the boy messenger left the bank on the day previous.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The United States bonds were inclosed in an envelope and carried in an inner pocket, which had been expressly made by an Emmonsville tailor on his first connecting himself with the bank. The pocket was unusually deep, so as to accommodate a long parcel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was the most important commission on which Ernest had been employed, and he was pleased with the confidence reposed in him. He did not dread the long walk, for he was a strong and active boy. Besides, he was authorized to accept a ride if one should be offered him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He would, of course, arrive at Lee\u0027s Falls after the bank was closed, but he was instructed to call at the residence of the cashier and leave the bonds.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest had walked three miles when he met with an adventure.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the borders of a small pond he caught sight of a small Indian boy playing. He was probably not more than three years of age. A stick he was playing with fell into the pond, and the little fellow reached over to recover it. In doing so he lost his balance and fell into the water; there was a scream and a splash, and Ernest no sooner saw the accident than he ran up, threw off his coat and vest lest he should wet the bonds, and plunged into the pond.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young bank messenger was an expert swimmer, and in an instant had seized the child and placed him out of danger. The little Indian boy clung to him instinctively, feeling safe with his young protector.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where do you live, little boy?\" asked Ernest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Out yonder,\" answered the child.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest had not been quite sure whether he would be able to understand or speak English, but having been brought up among white people, he was as familiar with English as most white boys of his age.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest looked in the direction pointed out by the boy. At the distance of a hundred rods he saw a rude log house, which seemed to contain but one room. Smoke was curling from a chimney projecting from the roof. Outside sat an Indian, about forty years of age, smoking a pipe.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He seemed busily thinking, having the grave face characteristic of the average Indian. He did not immediately notice the approach of his little son. But when they were near, the Indian boy uttered a cry, pronouncing some Indian word which possibly meant \"father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the red man looked up, and his grave face changed as he recognized his boy in the company of a young white stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He rose hastily from his seat, and advanced quickly to meet the two who were approaching.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What has happened?\" he asked in clear and distinct English.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your little boy fell into the water,\" explained Ernest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you saved him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Ernest, modestly. \"I saw him fall, and jumped in after him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Was the water deep?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About so deep,\" said Ernest, placing his hand about five feet from the ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then he would have been drowned if you had not been near?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, if he could not swim.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He is too young to swim. But you are wet,\" added the Indian, noticing for the first time the condition of Ernest\u0027s clothes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, a little.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Come in,\" said the Indian abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He led the way into the log cabin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a stove in the centre of the room, and the air was so heated as to be uncomfortable. As he led the child in, a stout Indian woman came forward with a cry and took him in her arms. Her husband rapidly explained what had happened. She instantly stripped the clothes from the child, and put on a dry change.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now,\" said the Indian, turning to Ernest, \"take off your wet clothes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though Ernest knew that it was wise to do so, he felt bashful about removing them in presence of the woman. But his Indian host brought from a nail, on which they hung, a pair of buckskin breeches of his own, and offered them to Ernest for his temporary use.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest no longer hesitated, but made the substitution.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As the Indian was four or five inches taller than himself, the legs covered his feet. He laughed as he saw how they looked, and the Indian\u0027s serious face relaxed a little from the same cause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now I will dry your clothes,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He took a chair and, hanging the wet garments over the back, placed it very near the stove. Ernest hardly liked to lose so much time, but he knew that it would not be safe to wear the trousers in their soaked condition.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You speak English very well,\" he said, turning to the Indian.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I have spent much time with white people,\" was the answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you support yourself by hunting?\" went on Ernest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I am a hunter, but I go with rich white people from the cities, and with Englishmen, who want a guide.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And do they pay you well?\" asked Ernest, not quite sure whether he was not showing too much curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, they pay me well. I have some money in the bank.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then Ernest remembered having seen the Indian one day at the bank. He was told at the time that his name was John Castro, and that he had several hundred dollars on deposit.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3012/83231.html","bookId":279,"creation":"Aug 1, 2019 8:35:26 AM","modification":"Aug 1, 2019 8:35:26 AM"}
