{"id":8508,"no":26,"title":"CHAPTER XXVI. BOUGHT OFF.","content":"\u0026nbsp;Bolton\u0027s reply did not quite suit Mr. Ray, but he felt that if he said too much about the will it would give it an exaggerated importance in the eyes of the man before him. So he answered carelessly, \"Oh, very well! The document is of no value, and though I should prefer to have it, I won\u0027t insist. I will give you the hundred dollars, but I wish it understood that it is all I can give you at any time. Don\u0027t apply to me again, for it will be of no use.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I understand,\" said Bolton, non-committally.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall I give you a check?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I could do better with the money. My name is not known now at any bank.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I think I can accommodate you. I believe I have that sum in my desk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He opened a drawer in his secretary, and produced a hundred dollars in crisp new bills. They had been taken from the bank the day before for a different purpose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bolton took them joyfully. It was long since he had had so much money in his possession. He had been his own worst enemy. Once a prosperous lawyer, he had succumbed to the love of drink, and gradually lost his clients and his position. But he had decided to turn over a new leaf, and he saw in this money the chance to reinstate himself, and in time recover his lost position.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you,\" he said; but while there was relief there was no gratitude in his tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And now,\" said Stephen Ray, \"I must ask you to leave me. I have important business to attend to. You will excuse me if I suggest it would be better to go away--to a distance--and try to build yourself up somewhere where you are not known.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I might go to Savannah.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, to Savannah, if you think it will be to your advantage,\" said Ray with equanimity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The other noticed his manner, and he said to himself, \"He is willing to have me visit Savannah. It is clear that Ernest did not die there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Benjamin Bolton left the house in a pleasant frame of mind. It was not the sum which he had received that exhilarated him. He looked upon it only as the first instalment. It was clear that Stephen Ray feared him, for he was not an open-handed man, and would not have parted with his money unnecessarily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bolton had not arranged his campaign, but he was determined to raise himself in the world by playing on the fears of the man he had just visited.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wonder,\" he said to himself, \"whether Dudley Ray\u0027s son is really dead. He was a strong and healthy boy, and he may still be living.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was a point not easy to ascertain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He went to a restaurant and obtained a substantial meal, of which he stood very much in need. Then he went out for a stroll. He did not propose to leave the place yet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he was walking along he met Clarence Ray again, but not now on his bicycle. The boy recognized him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you going to stay in town?\" asked Clarence, curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not long.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you get through your business with pa?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, for the present. By the way, I suppose you know that you have a cousin about your own age. I used to know him and his father.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did you? His father is dead.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So I have understood. Do you happen to know where the son is?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Somewhere out West, I think.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bolton pricked up his ears. So it seemed that Stephen Ray had deceived him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would give five dollars to know where he is,\" he said slowly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you got five dollars?\" Clarence asked, doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By way of answer Bolton took a roll of bills from his pocket. They were those which Stephen Ray had given him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mean it?\" asked Clarence, in a more respectful tone. Since Bolton had money, he regarded him differently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I mean it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why didn\u0027t you ask pa?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He never liked the boy nor his father, and I don\u0027t think he would tell me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is true. He didn\u0027t like either of them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you couldn\u0027t find out for me?\" said Bolton, tentatively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know but I could,\" answered Clarence, briskly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He had a special use for five dollars, and it struck him that he might just as well earn the money offered by the stranger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you could, I would cheerfully pay you the five dollars. You see I used to know Ernest Ray and his father, and I would be pleased to meet Ernest again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just so,\" said Clarence, complaisantly. \"How long are you going to remain in town?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did think of going to Elmira to-night, but I think on the whole I will stay at the hotel here till to-morrow morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That will give me time to find out,\" said Clarence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right! You had better not ask your father, for he is so prejudiced I don\u0027t think he would tell you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s so. He will be going out this evening, and then I will search in his desk. I saw a letter there once in which the boy\u0027s name was mentioned. But I say, if you\u0027ve got money why don\u0027t you buy some new clothes? You look awfully shabby.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your suggestion is a good one,\" said Bolton, smiling. \"Come to look at myself I do appear shabby. But then I\u0027m no dude. I dare say when you rode into me this morning you took me for a tramp.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, you did look like one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s so. I can\u0027t blame you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shall I find you at the hotel this evening?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I\u0027ll see what I can do.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n About seven o\u0027clock Squire Ray went out to attend to a business meeting, and Clarence was left in possession of the study. He locked the door and began to ransack his father\u0027s desk. At length he succeeded in his quest.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Benjamin Bolton was sitting in the public room of the hotel an hour later smoking a cigar, and from time to time looking towards the door. Presently Clarence entered, and went up to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you got it?\" asked Bolton, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" nodded Clarence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He took a piece of paper from his vest pocket and handed it to Bolton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It read thus: \"Ernest Ray, Oak Forks, Iowa.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did you get it?\" asked Bolton.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I found a letter in pa\u0027s desk from an old man named Peter Brant, asking pa for some money for the boy, who was living with him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When was that letter written?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About two years ago.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you. This gives me a clue. Come out of doors and I will give you what I promised. It isn\u0027t best that any one should think we had dealings together.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Five minutes later Clarence started for home, happy in the possession of a five-dollar bill.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never paid any money more cheerfully in my life,\" mused Bolton. \"Now I must find the boy!\"\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3012/83243.html","bookId":279,"creation":"Aug 1, 2019 8:36:00 AM","modification":"Aug 1, 2019 8:36:00 AM"}
