{"id":8519,"no":37,"title":"CHAPTER XXXVII. CONCLUSION.","content":"\u0026nbsp;On Tuesday Bolton returned with Ernest. Two hours were spent in conference with Stephen Ray. The latter fought hard, but had to yield in the end. He understood perfectly well the strength of his opponent\u0027s case. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest consented to receive the estate as it was bequeathed to his father, without any demand for back revenues. Whatever Stephen Ray had accumulated besides, he was allowed to retain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As this amounted to a hundred thousand dollars, Ray felt that it might have been worse. Had he not been dissuaded by Bolton, Ernest would have consented to share the estate with the usurper, but the lawyer represented that this would be condoning the wrong done to his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In a month the whole matter was settled, and Stephen Ray departed, removing to Chicago, in which city he had some business interests.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But what shall I do with this large house?\" asked Ernest. \"I don\u0027t want to live here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know of a gentleman who would like to hire it for term of years,\" responded Bolton. \"He will pay a rental of five thousand dollars a year. The bonds which you inherit will yield an income equally large.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So that my income will be ten thousand dollars a year?\" said Ernest, dazzled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What shall I do with it all?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bolton smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are but seventeen,\" he said. \"A few years hence you will probably marry. Then you can occupy the house yourself. Meanwhile--\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will go back to California. Luke will expect me. While I am away I appoint you my man of business. I wish you to have charge of my property at a proper commission.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will undertake the charge with pleasure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bolton knew how much this would increase his importance in the eyes of the firm by which he was employed. Still, Ernest could not have made a better choice. Bolton was no longer intemperate. He was shrewd and keen, and loyal to his young employer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest returned to California, but he had lost his old zest for business, now that his fortune was secure. He soon came East again, and entered upon a plan of systematic study, ending with a collegiate course. He brought with him Frank Fox, the son of the dead outlaw, who regarded him with devoted affection. They lived together, and he placed Frank at a well-known school, justly noted for the success of its pupils.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of the many boys with whom Frank was associated not one suspected that the attractive lad, who was a favorite with all, was a son of the noted desperado whose deeds had been commemorated in dime novels and were a matter of common knowledge in the West. Ernest had cautioned the boy to say as little as possible of his past history.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Years have gone by, and what Bolton predicted has come to pass. Ernest is a young man, a college graduate, and he will soon be married to a young lady of high position in the city of New York. He will go abroad for a year, and on his return will take up his home on his ancestral estate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Last week he received a letter from a patient in a New York City hospital. It was signed John Franklin, a name with which he was not familiar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In some wonder he answered the call, and was led to a bed on which lay a gaunt, spectral man, evidently in the last stage of existence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this John Franklin?\" asked Ernest, doubtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is the name I go by now,\" answered the dying man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do I know you? Have I ever met you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t remember you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I tell you my real name, will you keep it secret?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then I am John Fox.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What! the noted outlaw?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am all that is left of him. You will not betray me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; certainly not. Can I do anything for you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; you were left the guardian of my brother\u0027s child?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is he alive? Is he well?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you bring him here? Will you let me see him before I die?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will. I cannot refuse the request of a dying man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So Ernest brought Frank to the bedside of his dying uncle. It was a sad interview. Frank was moved, but John Fox, seeing him strong, handsome, robust, felt comforted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He at least has profited by the fate that overtook his father and myself. I shall die content, for I leave him in good hands. Don\u0027t let him think too hardly of us!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will not. And so far as I can compass it, his future life shall be happy.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3012/83254.html","bookId":279,"creation":"Aug 1, 2019 8:36:27 AM","modification":"Aug 1, 2019 8:36:27 AM"}
