{"id":8488,"no":6,"title":"CHAPTER VI. A CRITICAL SITUATION.","content":"\u0026nbsp;Ernest turned and regarded the tramp in amazement. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean?\" he demanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want that money you just dug up,\" replied Tom Burns boldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Instantly Ernest comprehended his danger. He was a stout boy, but the tramp was a large man, weighing probably fifty pounds more than himself. Moreover, he looked desperate and reckless. The boy felt that in strength he was no match for the thief who confronted him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Yet he could not bear the thought of allowing himself to be robbed. Left penniless, how could he carry out the plans which he had in view? He tried to gain time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you want to rob me?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have just as much right to that money as you,\" said the tramp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you make that out?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The man who put it there owed me money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think I am a fool to believe that ridiculous story?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027d better be careful how you talk,\" said Burns menacingly. \"What I say I mean.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then all I can say is that you have told a falsehood. You are the man, I suppose, who entered our cabin at night and stole money out of a trunk.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know anything about your trunk,\" said Burns mendaciously. \"But I have no time to talk--I want that money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest looked about him, hoping to see some one to whom he could appeal for help, but no one appeared in sight. Next he looked at the tramp, to note if he were armed. To his relief Burns did not appear to have any weapon with him. Rapidly he determined not to give up the money without a struggle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t give up the money to a thief,\" he said boldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he turned and ran as fast as he was able.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom Burns uttered an execration and prepared to pursue him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Winged with fear of losing his gold, Ernest flew rather than ran, not heeding the direction he was taking. The tramp accepted the challenge and put forth his utmost speed in the hope of overtaking him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll pay for this, boy,\" he growled. \"Just let me catch you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But Ernest did not mean to be caught. Being a fast runner for a boy of his size, he bade fair to out-distance his pursuer. But directly in his path was an excavation of considerable size and depth. Ernest paused on the brink to consider whether to descend the sloping sides or to go round it. The delay was fatal. The tramp saw his advantage, and, pushing forward, seized him by the collar.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve caught you!\" he cried, triumphantly. \"Now give me the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a brief struggle, but a boy, even a strong boy, was no match for a man taller and heavier than himself. The gold pieces were snatched from him, and the tramp, releasing his hold, was about to make off in triumph when he found himself seized in turn.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why, you contemptible thief!\" exclaimed Luke Robbins, for it was he whose opportune coming had saved Ernest from being plundered. \"Are you trying to rob the boy?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He seized the tramp by the collar, forced him to give up the gold he had just snatched from Ernest, and flung him on his back.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The tramp\u0027s surprise deepened to dismay when, looking up, he saw the stalwart hunter with stern face looking down upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was my money,\" he whined.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your money, you owdacious liar! Don\u0027t tell me that or I\u0027ll treat you worse.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But it was. I had hidden it under a tree. I came along just as the boy dug it up. I told him to give it to me, for it was mine, but he wouldn\u0027t, and then I chased him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the truth of the matter, Ernest?\" asked Luke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It was money that Peter Brant had hidden away. He told me on his deathbed where to look for it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought it was Peter\u0027s.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I had just dug it up and put it in my pocket when this man came along. He ordered me to give it him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he say he hid it there?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. He said that Peter owed him money, and he wanted it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You appear to be a very ingenious liar,\" remarked Luke, turning to the tramp. \"Which of these stories do you want me to believe?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hid it there!\" said the tramp, doggedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then why did you tell the boy that Peter owed you money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I didn\u0027t think he would believe that I hid it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right there. He don\u0027t believe it, nor do I. One thing more--were you the man that broke into his cabin and stole two gold pieces from his trunk?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No. I don\u0027t know anything about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course you would deny it. All the same, I have no doubt that you were the man.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If I had done it he would have seen me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That won\u0027t go down. He was asleep. Ernest, what shall I do with this fellow? Shall I shoot him?\" and Luke Robbins pulled out a revolver, which he handled in a significant way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t shoot! Spare my life, Mr. Robbins!\" cried the tramp, in great alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Humph! I don\u0027t see the good. Your life is of no value to the world.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let him go, Luke,\" said Ernest, \"but tell him to clear out of this neighborhood.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is treating him too well. Still, I will do as you say. Hark, you fellow, what is your name?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tom Burns.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are a disgrace to the name of Burns. If I spare your life will you leave this neighborhood and never come back?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, yes,\" answered the tramp, earnestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027d better keep that promise. If I ever catch sight of you again, I\u0027ll shoot with out asking you any questions. Now get!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom Burns got up and started away with celerity. He thought it wise to put as great a distance as possible between himself and the tall and stalwart hunter, fearing that he would repent his leniency and end his life by a stray bullet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll scare him a little,\" said Luke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He fired after the fugitive, taking care not to hit him, however. Tom Burns heard the bullet whistling by his head, and with a cry of terror increased his speed till he reached a place where he felt secure. Then, sinking down on the ground, he uttered an ejaculation of relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is a terrible man!\" he panted. \"He\u0027d as soon take my life as not. I won\u0027t get in his way again if I can help it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Luke Robbins laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is my parting message,\" he said. \"Well, Ernest, where do you want to go? What are your plans?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know,\" answered Ernest, gravely. \"I am not sure that I have any plans. I feel upset completely.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Sit down here and I\u0027ll talk to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He pointed to a little ridge which would serve as a seat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The two sat down together.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, how much money have you got?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A hundred dollars,\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It isn\u0027t much. Is that all your uncle left?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think so. He said nothing about having more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It isn\u0027t much to begin the world with. I wish for your sake, boy, that I had some to give you, but I never knew how to get together money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I guess it will do, Luke. I have health and strength. I think I can make my way.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you have no trade.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, Ernest. You\u0027ve got me there. I am only a hunter, but I don\u0027t make much of a living. I don\u0027t recommend you to follow in my steps. I\u0027d like to keep you with me, but it wouldn\u0027t pay you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"One thing is certain, Luke. I must get away from here. There is nothing I can do in Oak Forks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where do you want to go, lad?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know. I might go eastward to Chicago or New York, or I might go West to California. Have you ever been to either place, Luke?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, lad, but if I had my choice I\u0027d go westward. I\u0027ve heard fine stories of California. I think I should like to see that land, and push on to the Pacific ocean.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you go?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Stop a minute! Let me think!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The hunter assumed a thoughtful look. He remained silent for five minutes. Then he said, as if to himself, \"Why not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ernest still kept silence, but his eyes were fixed upon the face of the hunter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally Luke looked up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you want to go, lad?\" he asked. \"Do you want to go by the railroad, or are you in for a tramp over the mountains and plains?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That depends on whether I am to go alone or not. If I go alone I shall prefer to go by rail.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you in for a long tramp with me?\" asked Luke, his face glowing with new-born enthusiasm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will go anywhere with you, Luke.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then it is agreed. We will start to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3012/83223.html","bookId":279,"creation":"Aug 1, 2019 8:35:05 AM","modification":"Aug 1, 2019 8:35:05 AM"}
