{"id":86232,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“If you’d accepted my invitation to go out on a date, and treated me in that clinical, detached way you do those other losers I’ve seen you attend political functions and movie premieres with, I think I’d have had to kill you.”\u003c/p\u003e\n\u003cp\u003eShe stared at him a very long moment, and there was no motion in the room except for the flickering light of those many different screens, showing the story of her life for the past few hours.\u003c/p\u003e\n\u003cp\u003eShe lowered her gaze to the blouse she was holding. It was an odd contrast to her pale naked body, and the soft glitter of the lovely chandelier nipple jewels. She liked the way those looked, and how Matt’s eyes kept straying to them.\u003c/p\u003e\n\u003cp\u003eSavannah struggled past those thoughts, to what was going on in her own head. To what she knew she had to be brave enough to say, if she truly wanted to believe Matt’s words.\u003c/p\u003e\n\u003cp\u003eIt was five minutes before she found the courage, and to his credit, he waited, motionless, through the extraordinarily long pause.\u003c/p\u003e\n\u003cp\u003e“You know,” she said, her voice thick, not her own. “One day I was in the elevator with this young girl doing summer work in the mailroom.\u003c/p\u003e\n\u003cp\u003eShe had on the prettiest pair of sandals. I kept staring at those shoes, and I thought… ‘I bet she really enjoyed buying those. I bet she likes looking at the way they look on her feet.’ And it made me feel so sad…”\u003c/p\u003e\n\u003cp\u003e“Savannah.” He took a step toward her, but she closed her eyes, shook her head. “And I knew then, though I didn’t admit it to myself. I’ve never bought clothes, shopped for fun, done anything out of a sense of spontaneous whimsy.” She took a deep breath, raised her head and met his eyes squarely.\u003c/p\u003e\n\u003cp\u003e“You’re right. You’re all right. I was Geoffrey Tennyson’s cyborg, from the day my mother died. So you are all absolutely right. As much as I’ve fantasized about you, and wanted you, I would have treated you exactly that way. I wanted to be cruel to you tonight, finish up with all this and walk away, but I can’t. I want you, Matt. And admitting that terrifies me.”\u003c/p\u003e\n\u003cp\u003e“And love?”\u003c/p\u003e\n\u003cp\u003eShe lifted an uneasy shoulder. “I don’t know what that is. I do know…” her voice lowered and he came to her, so when she raised her head, she was looking directly up into his face, her bare body erotically almost pressed against his fully clothed one. “I know you’re the ‘someone’ in the fantasy to comfort myself. Every time. You always have been, since the day I met you.”\u003c/p\u003e\n\u003cp\u003eReaching down, she picked up his hand. After only a brief hesitation, she brought it to her lips, pressing her face into his palm. Something seemed unusual and she raised her face enough to look at a wound on his palm. A deep wound, like a puncture.\u003c/p\u003e\n\u003cp\u003eHis blood had coagulated, but the wound was hot to the touch, sticky.\u003c/p\u003e\n\u003cp\u003e“What—”\u003c/p\u003e\n\u003cp\u003eHis other hand touched her face, tracing the light impressions she could feel where the mask had pressed against her face.\u003c/p\u003e\n\u003cp\u003e“I kept digging my hand into the screw set under the table to keep myself from breaking down and releasing you. I almost broke, every time one of them touched you, every time you came, every time I heard the fear in your voice. I wanted this to be the right thing. And I told myself I was sure. But every time you got upset…” A tremor ran through his hand, amazing her. “Don’t ever make me go through that again.”\u003c/p\u003e\n\u003cp\u003e“Make you—” She saw the trace of a smile in his eyes, a moment before her knees gave out on her.\u003c/p\u003e\n\u003cp\u003e“Whoa.” He caught her at the waist as she gripped his coat lapels for balance, and before she knew what he was about, he’d lifted her off her feet and was headed to the couch.\u003c/p\u003e\n\u003cp\u003e“I didn’t feed you enough, I think,” he observed.\u003c/p\u003e\n\u003cp\u003eNot to mention what three or four mind-blowing orgasms in one night can do to someone.\u003c/p\u003e\n\u003cp\u003eHe laid her down on the couch and then straightened, retaining one of her hands in his, studying her.\u003c/p\u003e\n\u003cp\u003e“Matt,” she whispered. “Matt,” she repeated softly, seeing what was in his dark, intent eyes. She was afraid to put her arms around him, afraid to stroke her fingers through his hair, afraid to do anything.\u003c/p\u003e\n\u003cp\u003eStruggling against all her natural instincts to curl into a protective fetal ball and deny what she was so scared and hopeful was the truth.\u003c/p\u003e\n\u003cp\u003eNever lose control.Her father had told her, from her very first tantrum.\u003c/p\u003e\n\u003cp\u003eYou give the enemy the advantage when you lose control. And it took her very little time to understand he meant that to apply to everything, because to him there wasn’t any time that wasn’t about business, the business of life, the ultimate corporation. You ruled your life and everyone around you with iron control, or you opened yourself to defeat, to takeover. To failure.\u003c/p\u003e\n\u003cp\u003eTo the disappointment in her father’s face.\u003c/p\u003e\n\u003cp\u003eOh, God.To think that her whole life, the compass she followed each day, had always pointed to that.\u003c/p\u003e\n\u003cp\u003eOne tyrannical man’s expectations, a man who was dead.\u003c/p\u003e\n\u003cp\u003eNobody could possibly understand how hard it would be to let that go, when her whole life had been structured on it. The idea of turning to something different was the same as detonating a bomb that would blow up her foundation, her world. She’d been called a Daddy’s girl, but that implied something soft, with golden curls, like Lucas had described.\u003c/p\u003e\n\u003cp\u003eShe’d been his weapon, his tool.\u003c/p\u003e\n\u003cp\u003eBut tonight had been about who she was, Savannah. And by making it about that, Matt had told her clearly, through action, that it was her he wanted. Not the weapon of Geoffrey.\u003c/p\u003e\n\u003cp\u003eHer. And though she might not have much of an idea of who Savannah Tennyson was, when she looked into Matt’s eyes, she saw he knew. As if his eyes were the mirror she’d never been able to find to show her what her true face was. And there she finally had the truth of why he was always the center of her comfort fantasy. Of every fantasy.\u003c/p\u003e\n\u003cp\u003e“You really do love me.”\u003c/p\u003e\n\u003cp\u003eHis hand reached out, smoothed her hair from her temple, tilted her chin so she had to look up at him, into his unsmiling, devastatingly handsome countenance.\u003c/p\u003e\n\u003cp\u003e“And you love me, sweetheart. I’ll wait for you to know it, the way I do.”\u003c/p\u003e\n\u003cp\u003eIt was such a reflection of her own thoughts, she had to stifle tears. “We don’t…we haven’t even gone out on a date. I’m not counting tonight, Matthew.”\u003c/p\u003e\n\u003cp\u003e“I beg to differ.” He caressed her hand, playing idle finger games with her, a wonderfully intimate pastime that fascinated her. “Over the past two years, we have had over thirty- eight dates. We’ve played the same fencing games that dating couples play. We’ve even spent the entire night together, several times. We’ve ordered food.”\u003c/p\u003e\n\u003cp\u003eHer mouth turned up into a shy smile.\u003c/p\u003e\n\u003cp\u003e“Matt, you’re as dysfunctional as I am. Those are meetings, not dates.\u003c/p\u003e\n\u003cp\u003eNext thing you’ll say is that the video we saw on the new line of hydraulic nailers was the same as going to a movie.”\u003c/p\u003e\n\u003cp\u003e“I laid an arm over the back of your chair. I would have tried to cop a feel, but figured you’d chew my arm off at the shoulder.”\u003c/p\u003e\n\u003cp\u003eShe laughed then, and it wasn’t as hopeless a sound as she expected it to be.\u003c/p\u003e\n\u003cp\u003eHe removed his hand from hers, began to loosen his tie.\u003c/p\u003e\n\u003cp\u003e“What…what are you doing?” Her throat had gone dry, knowing exactly what he was doing. The trembling in her thighs increased, and all the passion stroked to life but unfulfilled by Peter and Ben flared as if there had never been a lull. Every cell of her body begged.\u003c/p\u003e\n\u003cp\u003e“You know what I’m doing. You’re mine. And notions of twentieth- century promiscuity be damned, we both know the way I intend to stake my claim on you, make you mine forever.”\u003c/p\u003e\n\u003cp\u003eChapter Six\u003c/p\u003e\n\u003cp\u003e“Have you thought of just asking?”\u003c/p\u003e\n\u003cp\u003eshe asked softly, stilling him in the act of unbuttoning the third button of his shirt, exposing the fine dark hair of his chest that her fingers longed to stroke, tangle in, clutch when his body slid into hers.\u003c/p\u003e\n\u003cp\u003e“You know the rules of negotiation.\u003c/p\u003e\n\u003cp\u003eNever give them a chance to say no.”\u003c/p\u003e\n\u003cp\u003eA full smile curved her lips this time, and she watched his eyes settle on her mouth with erotic intent. “Be brave, Matthew.”\u003c/p\u003e\n\u003cp\u003eMatt seemed to weigh her words, every aspect of the moment, down to the ticking of the clock and the hum of the lighting.\u003c/p\u003e\n\u003cp\u003e“Don’t calculate the risk, Matt,” she said, the silence driving away her tentative assurance, making her eyes prick with the threat of tears. “This is so hard for me. Please, just… believe…”\u003c/p\u003e\n\u003cp\u003eIn something larger than us both.\u003c/p\u003e\n\u003cp\u003eHis eyes softened, and the crucial moment of connection was made, a moment of such impact she almost heard the click. “You’re right.” He dropped to one knee beside her. “I am very much in love with you, Savannah. I’ve wanted you from the very first moment I saw you. Since the moment we met, you’ve stirred me up, made me think thoughts so fantastic you’d laugh at them.”\u003c/p\u003e\n\u003cp\u003e“Like what?” She touched his face, grateful that he stayed still, letting her fill with wonder at the simple pleasure of feeling his jaw beneath her fingers, knowing from his expression he wanted her hand there.\u003c/p\u003e\n\u003cp\u003eIt was a miracle to be wanted. She wondered if he could possibly understand that.\u003c/p\u003e\n\u003cp\u003e“You’re crying,” he said softly, and she nodded.\u003c/p\u003e\n\u003cp\u003e“You haven’t told me an example of fantastic thoughts.”\u003c/p\u003e\n\u003cp\u003e“Forever thoughts. A house. A dog. A shared portfolio.”\u003c/p\u003e\n\u003cp\u003eShe laughed then, a quick hitch into a sob. His gaze on hers, he stayed on one knee beside her, but finished unbuttoning his shirt, drawing her attention down to his hands. Her body’s urgent hum increased, disrupting her emotional focus. She had never felt so many different things at once. Her fingers trailed down his neck, followed the opening in his shirt to feel a man’s chest, again for the first time. A shudder ran through his body. A new miracle. She lifted amazed eyes to him.\u003c/p\u003e\n\u003cp\u003e“You’ve brought me to a place I’ve never been tonight, Matt,” she admitted. “And I’ve no idea where to go at this point but to lead with my feelings, even knowing that I’m giving you every opportunity to cut me to ribbons. I want you. Please.\u003c/p\u003e\n\u003cp\u003eJust don’t…” It took every ounce of courage to say the words, and she was proud they came out, not as a trembling plea, but a quiet, steady request. “Please don’t hurt me.” \u003c/p\u003e","sourceLink":"https://allnovel.net/board-resolution-knights-of-the-board-room-1/page-22.html","bookId":1900,"creation":"Oct 5, 2019 5:12:44 PM","modification":"Oct 5, 2019 5:12:44 PM"}
