{"id":63827,"no":12,"title":"Page 12","content":"\u003cp\u003eFive years later\u003c/p\u003e\n\u003cp\u003eJason leaned forward as his daughter made her entrance on stage. Facing the audience, Kristi Lynn began to sing, her voice pure and clear.\u003c/p\u003e\n\u003cp\u003eHis daughter. Another miracle that Leanne had wrought in his life. And soon they would have a second child. And after that, a dozen more, if God - and his wife - were willing.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s wonderful, isn\u0027t she?\" Leanne whispered.\u003c/p\u003e\n\u003cp\u003e\"Indeed,\" he said. \"She has her mother\u0027s talent.\"\u003c/p\u003e\n\u003cp\u003eLeanne grinned at him. \"And her father\u0027s charm.\"\u003c/p\u003e\n\u003cp\u003eJason took her hand in his and gave it a squeeze. The last five years had been the happiest he had ever known. He had stood beside Leanne and watched the sun rise over the Grand Canyon, sat beside her on a sandy white beach in Hawaii and watched the waves lap at the shore. He grinned at the memory. He had sat there so long he\u0027d gotten one hell of a sunburn. But even that had felt good.\u003c/p\u003e\n\u003cp\u003eHe had watched Leanne\u0027s body swell with new life, stood at her bedside the morning Kristi Lynn had been born, felt his heart swell with awe when the doctor had placed his daughter in his arms. He had been there when Kristi took her first wobbly steps, uttered her first word, run alongside her the day she had learned to ride a bike.\u003c/p\u003e\n\u003cp\u003eHe had turned to writing again, surprised and pleased when he sold his first book in years, a novel about a vampire who yearned to be a man again. He had written three other books since then, each of which had received rave reviews. His favorite quote hung on the wall behind his desk. Jason Blackthorne\u0027s vampires are so realistic, so vividly drawn, one would think he wrote from personal experience.\u003c/p\u003e\n\u003cp\u003eJason stood, applauding loudly when Kristi Lynn finished her solo. When the recital was over, they went out for hot fudge sundaes to celebrate.\u003c/p\u003e\n\u003cp\u003eLater that night, standing beside Kristi\u0027s bed while Leanne tucked her in, he thanked a generous and forgiving God for granting him a second chance at life.\u003c/p\u003e\n\u003cp\u003eThe End \u003c/p\u003e","sourceLink":"https://allnovel.net/masquerade/page-12.html","bookId":1925,"creation":"Oct 5, 2019 9:52:23 AM","modification":"Oct 5, 2019 9:52:23 AM"}
