{"id":70980,"no":14,"title":"Page 14","content":"\u003cp\u003eJodi hands me a water pitcher and tells me to go fill the glasses in the dining room. I pour water into a glass and I’m moving on to the next place setting when a handsome guy I’ve never seen before stumbles through the doorway. He appears to be twenty or so. His black suit, blazing red tie, and shiny shoes just scream power.\u003c/p\u003e\n\u003cp\u003e“Where’s the goddamned bathroom?” he says.\u003c/p\u003e\n\u003cp\u003e“Down the hall to your left,” I reply quietly, taken aback by his behavior. I start toward the kitchen to see what else Jodi needs me to do but he takes me by the elbow and turns me around. I smell alcohol on his breath.\u003c/p\u003e\n\u003cp\u003e“I’m Marcus Winchester.” He puffs his chest out like he’s more important than Prince William then scans my body. “I can’t believe the Goodwins keep you hidden away.”\u003c/p\u003e\n\u003cp\u003eYou have got to be kidding me.\u003c/p\u003e\n\u003cp\u003e“Excuse me,” I say, cradling the water pitcher against my chest, and try to head toward the kitchen, but he doesn’t let go of my arm.\u003c/p\u003e\n\u003cp\u003eHe looks down at my uniform, well, more specifically, down my dress, because it’s way too big.\u003c/p\u003e\n\u003cp\u003eI have a sudden urge to throw this water on Marcus—but if I do that, my dad and Cindy might get fired and we would have to leave before the baby is born and we might not find more work and where would we live and oh holy God—help.\u003c/p\u003e\n\u003cp\u003e“I’m needed in the kitchen.”\u003c/p\u003e\n\u003cp\u003e“You’re needed here.” Marcus laughs softly, squeezing my arm harder. “Don’t you want a kiss? I’ll give you another chance, even though a bad girl like you doesn’t deserve my forgiveness.”\u003c/p\u003e\n\u003cp\u003eWho the hell does he think he is?\u003c/p\u003e\n\u003cp\u003eMarcus leans in and I’m debating whether or not to toss the water on him when Jack appears in the doorway.\u003c/p\u003e\n\u003cp\u003e“Jack,” I blurt.\u003c/p\u003e\n\u003cp\u003eMarcus releases my arm and I step away, panting, my tongue heavy and dry. I shake my head at Jack, trying to show him that Marcus is the last thing I want.\u003c/p\u003e\n\u003cp\u003e“Marcus, meet Savannah. She’s one of my good friends,” Jack says with the hint of a threat in his voice.\u003c/p\u003e\n\u003cp\u003eI step away, my hands shaking as I continue pouring water into glasses. I breathe in and out. It’s only a couple hours. I can handle a couple of hours. My hands go from shaky to earthquaky in a matter of seconds and I can’t imagine how pissed Mrs. Goodwin will be if I drop this glass pitcher on her hardwood floor.\u003c/p\u003e\n\u003cp\u003e“You’re friends with your servants?” Marcus asks, raising his eyebrows. His eyes are red and hazy. “My servants clean my toilet.”\u003c/p\u003e\n\u003cp\u003eJack grabs Marcus’s elbow. “C’mon, we’ve got a great bourbon collection you should see.”\u003c/p\u003e\n\u003cp\u003eA minute later, Jack reappears by my side and takes the water pitcher from my hands.\u003c/p\u003e\n\u003cp\u003e“Did Marcus hurt you?” he murmurs, placing the pitcher on a sideboard.\u003c/p\u003e\n\u003cp\u003eI hate that Marcus questioned whether Jack could be friends with a servant like me. And all I can think about is how Jack looked at me today when he found out I’m not going to college. Like I’m this pathetic little bee, swarming around, with no thoughts and dreams of my own. Marcus Winchester and his I’m-a-rich-person-so-I-can-do-whatever-I-want attitude reminds me of horrible Mr. Cates.\u003c/p\u003e\n\u003cp\u003e“Why would you invite such a Neanderthal to dinner?” I ask.\u003c/p\u003e\n\u003cp\u003e“Dad’s working on a business deal with his father.” Jack pulls a handkerchief out of his suit pocket and dabs it on my face, and I cover his hand with mine, searching his eyes. It feels nice being comforted by him, and I wish I could stay in this moment, but I can’t. I’m pissed.\u003c/p\u003e\n\u003cp\u003e“So it’s okay if Marcus humiliates me because your dad does business with his father? That sucks.”\u003c/p\u003e\n\u003cp\u003eJack’s face drops and he furrows his eyebrows. He takes his hand off my face then walks around the table and finishes pouring water into each glass. Him taking over my chore is a nice concession, but can that really make up for what happened?\u003c/p\u003e\n\u003cp\u003e“You don’t have to do that,” I say.\u003c/p\u003e\n\u003cp\u003e“I know,” Jack replies. “But Dad’s always harping on me about how I should learn to do stuff for myself before college starts.”\u003c/p\u003e\n\u003cp\u003e“Is that why he tried to teach you how to do laundry?”\u003c/p\u003e\n\u003cp\u003e“You heard about that, huh?” He leans around the flower arrangement to grin at me.\u003c/p\u003e\n\u003cp\u003e“I hear everything,” I say, sniffling into his handkerchief. It smells like him. “The maids gossip about you all the time in Hillcrest.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah, like what?”\u003c/p\u003e\n\u003cp\u003e“I heard about the walk through the rose garden with the country singer and you picking thorns out of your—”\u003c/p\u003e\n\u003cp\u003e“I’ve been looking for you, son.” Mr. Goodwin appears in the dining room wearing a gray suit like Jack’s. “I want you to talk to George about business school—” He gazes from me to the water pitcher in Jack’s hands. “What’s going on here?”\u003c/p\u003e\n\u003cp\u003eI hold my breath and bite down on the handkerchief.\u003c/p\u003e\n\u003cp\u003eJack lays a hand on his father’s shoulder and speaks quietly to him. I hear the words “Marcus” and “dickhead.”\u003c/p\u003e\n\u003cp\u003e“Are you okay?” Mr. Goodwin asks me.\u003c/p\u003e\n\u003cp\u003e“Yes, sir.” I nod quickly.\u003c/p\u003e\n\u003cp\u003e“Do you wish to be relieved? I’m sure we can find someone else to serve us.”\u003c/p\u003e\n\u003cp\u003e“No, sir. I’m fine.” Cindy needs the money.\u003c/p\u003e\n\u003cp\u003e“Good. Why don’t you head back into the kitchen to see if Jodi needs anything.”\u003c/p\u003e\n\u003cp\u003eIt’s not like I expected Mr. Goodwin to throw Marcus out of the house, not with a big business deal with Marcus’s father on the line, but I can’t help feeling a tiny bit betrayed anyway. But this is how our world works—rich people like Marcus and Jack can do as they want, while people like me serve them coffee and hope they will treat us nicely.\u003c/p\u003e\n\u003cp\u003eI leave the dining room and hide in the same cranny I did this morning to calm down, but also to hear what else they say in case they mention selling Star again.\u003c/p\u003e\n\u003cp\u003e“I see the way you look at Savannah,” I hear Mr. Goodwin saying quietly.\u003c/p\u003e\n\u003cp\u003eWhat?! How does Jack look at me?\u003c/p\u003e\n\u003cp\u003eMr. Goodwin goes on, “You better not do that tonight during dinner. You know how much I want this deal with Winchester…and I’d rather you not piss off his daughter by being more interested in Savannah than her.”\u003c/p\u003e\n\u003cp\u003e“I know Dad…Savannah and I…we’ve just been working on a school project together.”\u003c/p\u003e\n\u003cp\u003eLies.\u003c/p\u003e\n\u003cp\u003e“And that’s it?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e“What’s this project?”\u003c/p\u003e\n\u003cp\u003eA long pause. “We have to tell the school where we want to be in five years.”\u003c/p\u003e\n\u003cp\u003e“And where do you want to be?”\u003c/p\u003e\n\u003cp\u003e“Getting my MBA and working for you. I hope I’ll have a winning horse by then.”\u003c/p\u003e\n\u003cp\u003e“What else?” Mr. Goodwin asks.\u003c/p\u003e\n\u003cp\u003eJack pauses for several seconds. “When you were my age, where did you want to be in five years?”\u003c/p\u003e\n\u003cp\u003eI peek around the corner to see Mr. Goodwin checking his tie in the window reflection. “In a woman’s bed, I imagine.”\u003c/p\u003e\n\u003cp\u003eJack laughs. “That’s where I want to be in five years too.”\u003c/p\u003e\n\u003cp\u003e“I dare you to write that on your project.” Mr. Goodwin straightens Jack’s blue tie and dusts his shoulders off. “Please be on your best behavior tonight. Don’t eat all the bread before anyone else gets any, okay?”\u003c/p\u003e\n\u003cp\u003e“You’re a cruel man, Dad.”\u003c/p\u003e\n\u003cp\u003e“No, I just really like Jodi’s bread.”\u003c/p\u003e\n\u003cp\u003eI rush to the kitchen, breathing in and out. I set the water pitcher down and bury his handkerchief in my apron pocket. Forget about him, Savannah.\u003c/p\u003e\n\u003cp\u003eI’m cradling a wine carafe as everyone files into the dining room.\u003c/p\u003e\n\u003cp\u003eMrs. Goodwin and Mrs. Winchester are wearing chic suits, and Abby Winchester and Shelby look straight out of a movie with their sparkly cocktail dresses. My awful blue maid’s uniform makes me want to jump out the window. A man with stark white hair, Mr. Winchester seems like one of those guys whose ego fills an entire room. Jack steps forward to shake his hand. “It’s good to see you, sir.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry we didn’t get a chance to speak in Cincinnati the other day.” The man searches Jack’s face and fiercely squeezes his hand. Looks painful.\u003c/p\u003e\n\u003cp\u003e“I was busy with my horse,” Jack says.\u003c/p\u003e\n\u003cp\u003eMr. Winchester sips his drink. Looks like he’s been checking out the famous bourbon collection. “I’m sorry he lost. He should’ve won, considering his pedigree. Sometimes the breeding doesn’t work out like we hope it will.”\u003c/p\u003e\n\u003cp\u003eEmbarrassment stains Jack’s face redder than the wine I’m holding. Mr. Winchester drops his hand and Jack moves to pull out Abby’s seat and helps her to sit down. She smiles at him over her shoulder as he scoots her chair in. She really is pretty, and elegant, but she looks breakable, like one of Cindy’s angel figurines.\u003c/p\u003e\n\u003cp\u003eI fill wine glasses while Mr. Goodwin and Mr. Winchester start talking business. Marcus makes eyes at me from the other side of the table.\u003c/p\u003e\n\u003cp\u003e“I’m looking forward to your sister’s birthday party this weekend,” Abby says quietly to Jack. “Maybe we’ll have a chance to explore your farm? Alone?”\u003c/p\u003e\n\u003cp\u003e“I don’t know if we should do that,” Jack says slowly. “Not alone.”\u003c/p\u003e\n\u003cp\u003e“Oh? Why not?”\u003c/p\u003e\n\u003cp\u003e“Well, um.” He pauses to cough. “It’s haunted.”\u003c/p\u003e\n\u003cp\u003eI purse my lips so I won’t burst out laughing. Cedar Hill is not haunted.\u003c/p\u003e\n\u003cp\u003e“Whose ghost is it?” Abby asks.\u003c/p\u003e\n\u003cp\u003e“Um, there are three ghosts?” Jack says.\u003c/p\u003e\n\u003cp\u003e“Three. Hmm.” She playfully narrows her eyes at him.\u003c/p\u003e\n\u003cp\u003e“Yeah, there’s a woman in a white dress. Um, her name is Moaning Myrtle.”\u003c/p\u003e\n\u003cp\u003e“You stole that from Harry Potter.”\u003c/p\u003e\n\u003cp\u003e“Damn,” he mutters.\u003c/p\u003e\n\u003cp\u003eShe glances over at Mr. Goodwin and Mr. Winchester, who are busy arguing about who makes better trucks: Ford or Chevy. “You could protect me from the ghosts,” she says, and leans toward Jack. His face suddenly goes stark white. I was wrong. Maybe we do have ghosts at Cedar Hill.\u003c/p\u003e\n\u003cp\u003eIs she touching him under the table? Jesus Lord.\u003c/p\u003e\n\u003cp\u003e“How long have you owned Paradise Park?” Jack rushes to ask Mr. Winchester. His voice sounds squeaky.\u003c/p\u003e\n\u003cp\u003eMr. Winchester stirs his cocktail. “The racetrack has been in my family since 1877.”\u003c/p\u003e\n\u003cp\u003e“It’s amazing that it hasn’t been sold and resold over and over again,” Jack says.\u003c/p\u003e\n\u003cp\u003eMr. Winchester seems impressed by the observation. “Many tracks do change ownership, yes, but my racetrack is an important part of my heritage.”\u003c/p\u003e\n\u003cp\u003e“Then why do you want to sell it?” Jack asks Mr. Winchester.\u003c/p\u003e\n\u003cp\u003eHe wants to sell Paradise Park! How can he just give up a track that’s been in his family for more than century? That’s crazy. If Mr. Goodwin suddenly decided to give up Cedar Hill, I’d cart him straight to a psychiatrist.\u003c/p\u003e\n\u003cp\u003eI pause and stare. Mrs. Goodwin clears her throat and nods her head, indicating I should get back to work. I set the wine bottle on a sideboard and begin helping Paula pass out salads.\u003c/p\u003e\n\u003cp\u003eMr. Winchester smiles at Jack. “None of my kids want to take over the business and I want to retire. I want to play golf and spend time with my kids and my grandkids.” He reaches out and touches Abby’s hand. “I’ve spent too much of my life away from my family. There’s nothing more important.” \u003c/p\u003e","sourceLink":"https://allnovel.net/racing-savannah-hundred-oaks-4/page-14.html","bookId":1969,"creation":"Oct 5, 2019 10:19:04 AM","modification":"Oct 5, 2019 10:19:04 AM"}
