{"id":70968,"no":2,"title":"Page 2","content":"\u003cp\u003eEight times? Stalk-er, I sing in my head.\u003c/p\u003e\n\u003cp\u003eJack keeps a firm hand on Wrigley’s lead and lets out a long breath. “Hi, Dad.”\u003c/p\u003e\n\u003cp\u003eMr. Goodwin goes on, “Why aren’t you answering your cell—” He stops. Takes one look at my red hair, freckled skin, and short, jockey-sized body, and then his eyes grow wide. “Are you Danny Barrow’s kid?”\u003c/p\u003e\n\u003cp\u003e“Yes. Savannah Barrow.”\u003c/p\u003e\n\u003cp\u003eJack furrows his eyebrows. “You’re the new groom’s daughter?”\u003c/p\u003e\n\u003cp\u003eMr. Goodwin drags a hand through his hair. “Can I see you in my office, son?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir. Savannah, can I catch up with you later? Maybe we could—”\u003c/p\u003e\n\u003cp\u003e“Jack. Now,” Mr. Goodwin says.\u003c/p\u003e\n\u003cp\u003eJack ties Wrigley to a hitching post, his voice changing from casual to super serious. “Nice to meet you, Savannah. If you’ll excuse me.” Then he disappears inside the house with his father and the three hounds at his ankles.\u003c/p\u003e\n\u003cp\u003eI gently pat Wrigley’s muzzle, as I stare up at the white manor house.\u003c/p\u003e\n\u003cp\u003eNow that Jack knows who I really am, the groom’s daughter, he doesn’t even give me a second glance.\u003c/p\u003e\n\u003cp\u003eFigures.\u003c/p\u003e\n\u003cp\u003eThe Tryout\u003c/p\u003e\n\u003cp\u003eOn my way to Hillcrest to retrieve my riding gear, I skirt the stone wall that doubles as a fence bordering the property. Mom once told me, “They call them slave walls.” It had embarrassed me to hear Mom say something so un-PC, but when I confronted her, she said, “We can ignore history or we can learn from it. I choose to learn from it.”\u003c/p\u003e\n\u003cp\u003eWhat I wouldn’t give to hear her voice now.\u003c/p\u003e\n\u003cp\u003eShe died when I was eleven after having been diagnosed with breast cancer the year before. It was stage four by the time the doctors caught it, but Mom fought hard. We didn’t have insurance, so we couldn’t afford the medical bills that skyrocketed to over $200K. Then Mom was suddenly buried…and Dad was buried under a mountain of debt. And without her, my whole world fell apart.\u003c/p\u003e\n\u003cp\u003eDad worked as a groom for a wealthy horseman who was more interested in gambling than the racehorses themselves. Mr. Cates didn’t give a crap that his employees didn’t have insurance, and he worked his horses into the ground, racing them when they were injured with stress fractures or worse.\u003c/p\u003e\n\u003cp\u003eShortly after my mother died, Dad said he needed my help with a sad mare named Moonshadow, who had been lethargic ever since her first foal had been weaned. Mr. Cates didn’t care that the horse was sad, but I did. I told my dad I would help her feel better again.\u003c/p\u003e\n\u003cp\u003eI rubbed the mare’s nose and searched her eyes. “I know how it feels to lose somebody too.”\u003c/p\u003e\n\u003cp\u003eI started riding Moonshadow nearly every day, and she taught me just how great at riding I am. She made me feel proud of myself. As soon as I got to know her, I told her all my secrets.\u003c/p\u003e\n\u003cp\u003eThe first one?\u003c/p\u003e\n\u003cp\u003e“I love my dad, but I’m never gonna end up working for minimum wage like him. I want more.”\u003c/p\u003e\n\u003cp\u003eBack in Charles Town, Dad spent 99 percent of his time in the barns, and coming to Tennessee hasn’t changed that habit one bit. So I figure he must be in Greenbriar, where the Goodwins’ best horses live. It’s the fanciest barn I’ve ever seen; it has a digital contraption that keeps flies and mosquitoes at bay and classical music plays 24/7. I don’t even have an iPod, for crying out loud.\u003c/p\u003e\n\u003cp\u003eAfter grabbing my riding gear from Hillcrest, I tramp through mud on my way to Greenbriar, passing by two of the smaller barns. The Goodwins own about forty horses, but they have enough barn space to house over 1,200. Apparently they make a lot of their money renting stalls (studio apartments for horses) to Thoroughbred owners who use the Goodwin practice tracks to get ready for the real races on weekends. Mr. Goodwin keeps plenty of people on staff—veterinarians, farriers (blacksmiths) to fix horseshoes, farmers to work the hay, tons of grooms and exercise riders, and stall managers.\u003c/p\u003e\n\u003cp\u003eI arrive in front of Greenbriar to find Dad and a bunch of guys sitting in lawn chairs.\u003c/p\u003e\n\u003cp\u003e“What a bunch of lazy asses.”\u003c/p\u003e\n\u003cp\u003eDad jumps to his feet as the other guys laugh at me. “It’s break time.” He draws me into his arms for a hug. I bury my nose in his shirt, inhaling his earthy smell of grass and leather and hay. My dad’s only thirty-six, and his height makes him look even younger.\u003c/p\u003e\n\u003cp\u003eWhen I pull away, I bounce on my tiptoes, scanning the group. “Is Gael around?”\u003c/p\u003e\n\u003cp\u003e“Gael? What do you need him for?”\u003c/p\u003e\n\u003cp\u003e“I want to talk to him about riding—”\u003c/p\u003e\n\u003cp\u003eThat’s when this douche of a jockey comes strutting out of Greenbriar. Bryant Townsend is 5’1”—an inch taller than me, but I could take him.\u003c/p\u003e\n\u003cp\u003e“Forget the horse, Barrow. Come ride a cowboy,” he says, making rude gestures with his pelvis. What an ass. Dad looks like he might kill Bryant, but I hold him back—I can handle myself.\u003c/p\u003e\n\u003cp\u003e“Tell me when you see a real cowboy and I will.”\u003c/p\u003e\n\u003cp\u003e“Oooooooh,” the guys say, laughing.\u003c/p\u003e\n\u003cp\u003e“You’re all fired,” Dad says. He waves an arm at the guys, and they go back to talking horses and trucks, ignoring my father.\u003c/p\u003e\n\u003cp\u003e“Wow, what a great help you are, Dad.” He gives me a noogie, and I duck away. “Not the hair!” It takes forever to bind my red curls in a French braid.\u003c/p\u003e\n\u003cp\u003eIt doesn’t surprise me that Dad fits right in here. He’s a good head groom—he knows when to be strict, but most of the time he’s relaxed, which keeps his staff relaxed, which ultimately keeps the horses calm. And he knows more about horses than anyone I know. I completely understand why Mr. Goodwin snatched him away from Charles Town.\u003c/p\u003e\n\u003cp\u003e“So how about some lunch?” Dad asks.\u003c/p\u003e\n\u003cp\u003e“Can you help me find Gael first?”\u003c/p\u003e\n\u003cp\u003e“We shouldn’t waste his time—”\u003c/p\u003e\n\u003cp\u003e“You don’t think I can get a job here, Dad?”\u003c/p\u003e\n\u003cp\u003eHe inclines his head, smiling slightly. “It’s worth a try, I guess. But don’t get your hopes up. They got some of the best exercise boys I’ve ever seen.”\u003c/p\u003e\n\u003cp\u003eExercise riders make $10 per horse per day giving super-fast horses their daily workouts. It’s way above minimum wage. If I can make more money by riding horses, I can make a better life for myself than working in a motel or gas station after high school.\u003c/p\u003e\n\u003cp\u003eSo watch out Cedar Hill—here I come.\u003c/p\u003e\n\u003cp\u003eWe find Gael in the Greenbriar pasture, inspecting a yearling’s hoof. Dad told me he’s a former jockey from Spain. He’s tiny, but he could still beat the crap out of most guys on this farm.\u003c/p\u003e\n\u003cp\u003e“Can I help you, Barrow?” Gael asks Dad, flashing a glance at me.\u003c/p\u003e\n\u003cp\u003e“I want to be an exercise rider,” I reply, pulling my gloves out of my back pocket. “And I’m trying out today.”\u003c/p\u003e\n\u003cp\u003e“Says who?” Gael asks.\u003c/p\u003e\n\u003cp\u003e“Says me.”\u003c/p\u003e\n\u003cp\u003eDad shakes his head at the blue sky. “Generally you ask for a job interview, Shortcake.”\u003c/p\u003e\n\u003cp\u003e“Being an exercise rider is dangerous,” Gael says. “Just last month one died in Arizona after being thrown from a horse.”\u003c/p\u003e\n\u003cp\u003e“I’m always careful.” I hold up my protective vest and helmet. “And I have plenty of experience from working at the Charles Town Races in West Virginia.”\u003c/p\u003e\n\u003cp\u003eGael’s eyes widen. “Good for you, drama mama.”\u003c/p\u003e\n\u003cp\u003e“Did you just call me drama mama?”\u003c/p\u003e\n\u003cp\u003eGael ignores me. “Charles Town is a Grade 2 track. Those horses aren’t the fastest, craziest horses in the world. That’s what we got here. This is the big show.”\u003c/p\u003e\n\u003cp\u003e“I bet riding a Goodwin horse is safer than the ones I used to ride. It’s only truly dangerous to ride injured or weak horses, and you know the Goodwins have the best horses.”\u003c/p\u003e\n\u003cp\u003eGael gives my dad a grin. “She knows her shit.”\u003c/p\u003e\n\u003cp\u003e“Of course she knows her shit. She’s a Barrow.” Dad squeezes my shoulder.\u003c/p\u003e\n\u003cp\u003e“May I try out? Sir?”\u003c/p\u003e\n\u003cp\u003eDad gives me a nod, proud I remembered to ask for the job interview this time.\u003c/p\u003e\n\u003cp\u003e“Well…” Gael says. “I’m afraid it’s not my decision.”\u003c/p\u003e\n\u003cp\u003e“Dad, please,” I say.\u003c/p\u003e\n\u003cp\u003e“It’s not his call either,” Gael says.\u003c/p\u003e\n\u003cp\u003e“But the lead trainer always makes decisions when it comes to training horses. So whose decision is it?”\u003c/p\u003e\n\u003cp\u003e“Mine.”\u003c/p\u003e\n\u003cp\u003eI twirl around to find Jack Goodwin. He adjusts his cowboy hat and shoves his hands in his pockets, swaggering toward me with his hounds.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” I ask Dad and Gael.\u003c/p\u003e\n\u003cp\u003e“You haven’t heard?” Jack uses his super serious voice, like when he discovered who I really am. “I’m running the farm this year.”\u003c/p\u003e\n\u003cp\u003e“What do you mean you’re running the farm?”\u003c/p\u003e\n\u003cp\u003e“It’s one of his father’s tests to get him ready to run the farm one day,” Gael mutters to me. “He made Jack learn to drive a truck when he was ten. And he started drawing up stud fee contracts when he was twelve.”\u003c/p\u003e\n\u003cp\u003eHell, I’m happy I passed algebra II last year. And he has to run a farm?\u003c/p\u003e\n\u003cp\u003e“And you’re going to school too?” I ask Jack. “Senior year isn’t gonna be easy.”\u003c/p\u003e\n\u003cp\u003e“I’ll get it done.”\u003c/p\u003e\n\u003cp\u003eTalk about a busy schedule. Can he go to school, run the farm, sleep, and be stalked by this Abby Winchester girl all at once?\u003c/p\u003e\n\u003cp\u003e“So what’s the deal with me getting a tryout?” I ask.\u003c/p\u003e\n\u003cp\u003e“Jack wants me to clear all decisions with him,” Gael says, not sounding at all perturbed he has to take orders from a seventeen-year-old. “It’s up to him if you get one.”\u003c/p\u003e\n\u003cp\u003e“So can I try out? Sir?”\u003c/p\u003e\n\u003cp\u003eA tiny smirk appears on Jack’s face. “What are your qualifications?”\u003c/p\u003e\n\u003cp\u003e“Let’s see. I’ve been riding since I was four years old. I was an exercise rider at Charles Town Races. And oh yeah, I caught Star on foot this morning. Remember that?”\u003c/p\u003e\n\u003cp\u003eJack’s smirk erupts into a full-blown grin.\u003c/p\u003e\n\u003cp\u003e“You caught Tennessee Star on foot?” Dad exclaims.\u003c/p\u003e\n\u003cp\u003eGael looks from me to Jack. “What?”\u003c/p\u003e\n\u003cp\u003e“Just ’cause she caught Star once doesn’t mean she could handle him on the track,” Jack says, staring me down. “You want a job as an exercise rider? Then I want to see you ride Star.”\u003c/p\u003e\n\u003cp\u003e“No,” Dad says. “He bucks all his riders.”\u003c/p\u003e\n\u003cp\u003e“C’mon, please? I’ve been riding for thirteen years. You know I can do this!”\u003c/p\u003e\n\u003cp\u003eDad throws his head back. “Could she at least ride another horse besides Star?”\u003c/p\u003e\n\u003cp\u003eJack thinks for a sec. “Let’s see her ride Mystic Minerva. But I reserve the right to see her ride Star before I make a decision.”\u003c/p\u003e\n\u003cp\u003eWhy is he so interested in me riding Star?\u003c/p\u003e\n\u003cp\u003eDad snaps and points at a tall groom with a mess of floppy brown hair who’s been eavesdropping. “Get Minerva saddled up, Whitfield.”\u003c/p\u003e\n\u003cp\u003e“Townsend,” Gael barks. “Get on Lucky Strikes and take him around the track a few times. I want you to show Savannah how the tryout will work.” Townsend goes with another groom to get Lucky Strikes out of his stall.\u003c/p\u003e\n\u003cp\u003eWhile waiting, Jack squats and scratches his dogs’ ears, muttering to them, “You stinky dogs, you. You’re handsome devils, and, Athena, you’re a beautiful girl. Give me a kiss.” The dog licks and slobbers on his face. He peeks up at me a few times, but I tighten my gloves and pretend not to notice him. \u003c/p\u003e","sourceLink":"https://allnovel.net/racing-savannah-hundred-oaks-4/page-2.html","bookId":1969,"creation":"Oct 5, 2019 10:19:04 AM","modification":"Oct 5, 2019 10:19:04 AM"}
