{"id":70974,"no":8,"title":"Page 8","content":"\u003cp\u003eI shake my head.\u003c/p\u003e\n\u003cp\u003e“He said, ‘I’m not an ape.’” We laugh together as Jack folds his arms on top of the white fence. “I don’t see how he lives without a cell.”\u003c/p\u003e\n\u003cp\u003e“I don’t have one,” I mumble. “And I get along okay.”\u003c/p\u003e\n\u003cp\u003e“Considering how often mine beeps, I’m tempted to get rid of it myself.”\u003c/p\u003e\n\u003cp\u003eI don’t buy that for one second.\u003c/p\u003e\n\u003cp\u003e“If Star wins,” Jack says, “I want you in the winner’s picture, okay?”\u003c/p\u003e\n\u003cp\u003eI duck my head, grinning. “Okay,” I reply. “So where’s your girlfriend?”\u003c/p\u003e\n\u003cp\u003eJack’s face goes hard. “She’s not my girlfriend.”\u003c/p\u003e\n\u003cp\u003e“Whatever you say,” I tease.\u003c/p\u003e\n\u003cp\u003e“You know, normally I hate giant hats on girls—I think whoever invented them should be rounded up and quartered—but today I love them.”\u003c/p\u003e\n\u003cp\u003e“Oh yeah?”\u003c/p\u003e\n\u003cp\u003e“Yeah, because every time I see Abby’s hat bobbing through the crowd, I can just turn and run off in the other direction.”\u003c/p\u003e\n\u003cp\u003eI laugh quietly, wishing he’d elaborate on this whole Abby Winchester situation. Clearly something is going on between them, and whatever it is, it pisses me off because I like him—\u003c/p\u003e\n\u003cp\u003eI pinch my arm. Why can’t I stop thinking about him?\u003c/p\u003e\n\u003cp\u003eMr. Goodwin comes back balancing three hot dogs and his notebook in his hands.\u003c/p\u003e\n\u003cp\u003e“Don’t tell my wife,” he tells me, as if I would ever impose upon Mrs. Goodwin’s privacy. We yank the aluminum foil back and chow down. I tap my boot nonstop, hardly believing I’m standing with Jack Goodwin at a race.\u003c/p\u003e\n\u003cp\u003eWe finish, wad up our aluminum foil, and Jack checks his watch. “Whitfield should have Star in the paddock by now. Let’s go check on him.”\u003c/p\u003e\n\u003cp\u003eDad is helping Rory to put Star’s saddle on when we enter the paddock. Star prances and tries to rip away from Rory, and he attempts to bite Dad’s arm. Dad raises an eyebrow when he sees me with Jack. I quickly shake my head, trying to show Dad that hanging out with Jack wasn’t my idea. He asked me to stand with him during the race.\u003c/p\u003e\n\u003cp\u003e“Danny,” Jack says, tipping his hat at him. “How’s Star doing?”\u003c/p\u003e\n\u003cp\u003e“Fed and somewhat more relaxed than usual,” Dad replies. “I think his workout this morning really helped him.”\u003c/p\u003e\n\u003cp\u003e“Good.” Jack steps up to Star’s nose and whispers to him. It’s really cute.\u003c/p\u003e\n\u003cp\u003eAfter Bryant mounts, I pat Star’s neck. “You can do this, understand?” I tell the horse. Star lets out a snort and his tail flips in circles as he looks every which way, and I pat him again to try to soothe him. His breathing steadies as he looks me in the eye.\u003c/p\u003e\n\u003cp\u003eBut the second Bryant steers Star toward the starting gate, the horse whips his head around again. What’s it gonna take to keep him calm?\u003c/p\u003e\n\u003cp\u003eI move to walk with Jack.\u003c/p\u003e\n\u003cp\u003e“Shortcake, where are you going?” Dad asks.\u003c/p\u003e\n\u003cp\u003e“Jack wants me to stand with him during the race. For luck.”\u003c/p\u003e\n\u003cp\u003eA grin slides across Jack’s face and he mouths, “Shortcake?”\u003c/p\u003e\n\u003cp\u003eI’m tempted to flip him off, but one doesn’t generally flip off the boss.\u003c/p\u003e\n\u003cp\u003eDad does not look pleased. “I need you back in the barn right after, understand?”\u003c/p\u003e\n\u003cp\u003eI nod quickly and join Jack at the finish line. The scoreboard shows 9–2 odds for Star to win. Not bad. That means people are betting on him to win based on his pedigree and how he looked in warm-ups this morning and the paddock just now.\u003c/p\u003e\n\u003cp\u003eIt makes me proud I played a role in those odds.\u003c/p\u003e\n\u003cp\u003eI’m leaning against the fence watching the horses and lead ponies trot around the track, doing a final warm-up before post time, when Jack starts tapping his hands on the fence like he’s pounding a bongo drum.\u003c/p\u003e\n\u003cp\u003e“Calm down,” Mr. Goodwin says to Jack.\u003c/p\u003e\n\u003cp\u003e“Can’t,” Jack says.\u003c/p\u003e\n\u003cp\u003eMy palms go sweaty and I cross my fingers and my toes as the horses enter the starting gate. Star is in the seventh position. I glue my eyes to the green-and-black Goodwin family silks worn by Bryant and the horse.\u003c/p\u003e\n\u003cp\u003eThe gates fly open.\u003c/p\u003e\n\u003cp\u003e“And they’re off!” the announcer says, as the crowd goes silent. Hooves thunder across the dirt. It’s a sight that’s mesmerized me since I was a little girl, almost like seeing floats in a parade. The excitement of seeing horses fly out of the gate leaving a wake of dust is electric.\u003c/p\u003e\n\u003cp\u003eBut Star broke late and now he’s trailing the pack. Ten other horses are leaving him in the dust. A colt named Hard Money has the lead, followed by Desert Waves. The Name’s Timmy is in third. “Go, Star,” I say, not tearing my eyes off the green and black silks.\u003c/p\u003e\n\u003cp\u003eHe starts to pick up speed at the 5/8 pole, and I jump up and down. This is Star’s seventh race. Seventh time’s a charm.\u003c/p\u003e\n\u003cp\u003eThe pack reaches the straightaway and hurtles toward the finish line. Star is still in last place but he’s making ground—he passes four horses in a late break, but it’s not enough.\u003c/p\u003e\n\u003cp\u003eJack slams his hand against the fence when Desert Waves crosses the line first.\u003c/p\u003e\n\u003cp\u003e“Maybe next time,” Mr. Goodwin says, looking equal parts pissed and pitying.\u003c/p\u003e\n\u003cp\u003e“Damn,” I whisper, not wanting to meet Jack’s face. He brought me along today to keep his horse calm! To help him win the race! How will I get the job now?\u003c/p\u003e\n\u003cp\u003e“He should’ve won,” Jack says, rubbing his eyes. “Shit.”\u003c/p\u003e\n\u003cp\u003eMr. Goodwin lays a hand on his shoulder. “Son, lower your voice, please.”\u003c/p\u003e\n\u003cp\u003e“He shouldn’t be losing. Not with his breeding! That’s all horse racing is. Breeding!” Under his breath, I hear Jack mutter, “And I can’t even fucking do that right.”\u003c/p\u003e\n\u003cp\u003eI look at the crowd around us. People are staring at Jack. Here’s the thing: regular horse races aren’t like the Derby. They aren’t like an NFL game. It’s about gambling. People watch the races then they go inside and cash in their winning tickets, and then they bet again. They usually don’t make a big scene.\u003c/p\u003e\n\u003cp\u003e“I can’t believe it,” Jack says, turning to face his father, letting out a string of curses. “Five lengths! He might as well have not run,” Jack hisses.\u003c/p\u003e\n\u003cp\u003e“Shh,” says Mr. Goodwin.\u003c/p\u003e\n\u003cp\u003eI feel bad for Jack, but I’m also scared I won’t get the job now. I’ll have to try out for another owner, maybe even work at another farm away from my dad. I need an opportunity to do something big with my life—I won’t get stuck making minimum wage.\u003c/p\u003e\n\u003cp\u003eI turn to watch Bryant handing Star off to Rory to cool the horse down. Dad pats the horse’s neck then walks over to us. “Savannah, I need you back in the barn now.”\u003c/p\u003e\n\u003cp\u003eThat’s when Jack looks at me as if he just remembered I’m here. Blood races to my head. I really thought I could help with Jack’s horse. Bile works its way from my stomach to my throat.\u003c/p\u003e\n\u003cp\u003e“Excuse me,” I say to Jack and Mr. Goodwin, then follow Dad back to the barn. I yank a sucker out of my pocket. Now’s not a good time to ask if I got the job.\u003c/p\u003e\n\u003cp\u003eStar did great in his warm-ups. So what went wrong? What’s he so scared of?\u003c/p\u003e\n\u003cp\u003eI glance back just in time to see Abby Winchester hurling herself into Jack’s arms. He looks over her shoulder, staring at me. Why in the world is he hugging her?\u003c/p\u003e\n\u003cp\u003eI pop the sucker in my mouth, shove the wrapper in my pocket, and get ready for the long drive home.\u003c/p\u003e\n\u003cp\u003eWhy Can’t Things Stay Simple?\u003c/p\u003e\n\u003cp\u003eAfter the races, at twilight, I’m hanging out by the Greenbriar pasture, watching Star graze. He’s chomping on grass, not a care in the world. I unlock the fence and head into the pasture.\u003c/p\u003e\n\u003cp\u003eStar sees me, trots over, and invades my space, pushing against me.\u003c/p\u003e\n\u003cp\u003e“Nuh uh.” I get right back in his face, showing him who’s boss. I push him away, making him move several feet from me. Dad always says that horses have short memories and that I should never worry about hurting their feelings. They’ll always come back, because they want to feel safe, they want to feel taken care of.\u003c/p\u003e\n\u003cp\u003eSo why doesn’t Star feel safe? What’s he scared of? With his bloodline, he should be an expert racer already. Instead he panicked and got a shitty start out of the gate.\u003c/p\u003e\n\u003cp\u003eI cluck my tongue and snap. “Star, c’mere.”\u003c/p\u003e\n\u003cp\u003eHe looks up and walks over, keeping a bit of distance from me this time. I reach into my pocket and pull out a treat, rewarding him for showing me respect. As he eats from my hand, his breathing slows and a stillness settles over his body.\u003c/p\u003e\n\u003cp\u003eI start examining him, looking for injuries. Monitor his breathing. I rest my head against the withers and listen for his heartbeat.\u003c/p\u003e\n\u003cp\u003eSometimes, it’s almost like I can hear a horse’s voice. This one time, I could tell a mare was sick because she kept rubbing her head against mine and whinnying. Turns out she had an infection that could’ve made her go blind. And I caught it just in time.\u003c/p\u003e\n\u003cp\u003e“Why are you so skittish?”\u003c/p\u003e\n\u003cp\u003eI stand there with Star while he grazes and stare up at the sky, praying to Mom. Is she up there listening to me? I pray that even though Star did bad in his race today, I get the job.\u003c/p\u003e\n\u003cp\u003eAll of a sudden, Star’s tail starts whipping around and his ears lay back. He’s nervous or angry.\u003c/p\u003e\n\u003cp\u003e“Hi,” Jack calls out, waving from outside the fence, his hounds running circles around him. Jack looks comfortable in a T-shirt, track pants, and a baseball cap turned around backward. A good outfit to curl up in on a Sunday night.\u003c/p\u003e\n\u003cp\u003eStar pins his ears. Does the horse not like Jack, or is it the three rambunctious dogs at his side? I’d hate to tell Jack that his horse doesn’t like him.\u003c/p\u003e\n\u003cp\u003e“Can we talk?” Jack asks.\u003c/p\u003e\n\u003cp\u003eNodding, I pat Star’s neck and exit the pasture.\u003c/p\u003e\n\u003cp\u003e“You did really well today.” The fresh smells of Jack’s cotton T-shirt and soap waft up to my nose, luring me into a trance. His eyes are bright sapphires under the moon.\u003c/p\u003e\n\u003cp\u003e“I’m sorry he didn’t win. I can’t believe it, honestly.”\u003c/p\u003e\n\u003cp\u003e“Me neither. He did better in your warm-up than he did in the damned race.” Jack purses his lips and looks at the next pasture over, where mares are grazing with their young. “We should probably get the horses inside.”\u003c/p\u003e\n\u003cp\u003eJack and I mount Appaloosa ponies and herd the horses toward the barns. A rush of happiness fills me when he gently coaxes a yearling into his stall. I love how he respects and takes care of his animals, and his fluid riding skills show he’s a true horseman. The stars glitter against the deep purple sky. It feels like it’s just me and Jack for miles and miles.\u003c/p\u003e\n\u003cp\u003eMuch too soon, the horses are safe and cozy in their stalls, and I have no excuse to spend more time with him.\u003c/p\u003e\n\u003cp\u003e“Lock that gate,” he calls.\u003c/p\u003e\n\u003cp\u003e“Yes, sir.” I finish the chore and meet back up with Jack.\u003c/p\u003e\n\u003cp\u003e“Don’t call me sir.”\u003c/p\u003e\n\u003cp\u003e“Aren’t you the boss?” I tease.\u003c/p\u003e\n\u003cp\u003eHe scratches the back of his neck, looking pained all of a sudden. “I’m probably gonna score a big fat F on this test.”\u003c/p\u003e\n\u003cp\u003e“Why do you say that? Everyone respects you.” Gael told me a story about when Jack was fifteen and his father was out of town and couldn’t be reached, Gael was wrestling with whether to euthanize a prized gelding that broke his femur on the track. Jack made the call to put the suffering horse down.\u003c/p\u003e\n\u003cp\u003e“I don’t know who’d buy a horse I breed considering how bad Star’s turned out.” \u003c/p\u003e","sourceLink":"https://allnovel.net/racing-savannah-hundred-oaks-4/page-8.html","bookId":1969,"creation":"Oct 5, 2019 10:19:04 AM","modification":"Oct 5, 2019 10:19:04 AM"}
