{"id":70975,"no":9,"title":"Page 9","content":"\u003cp\u003e“He’s a fast horse,” I reply. “He just has some growing up to do.”\u003c/p\u003e\n\u003cp\u003e“He should be better than this. He’s bred from the Man o’ War and Nasrullah lines.”\u003c/p\u003e\n\u003cp\u003e“He just got a bad start out of the gate.”\u003c/p\u003e\n\u003cp\u003e“Star’s been gate-trained a couple times already.” We’re standing so close, I can count the freckles on his nose. See the flecks of gray in his blue eyes. “I love Star, but my father thinks I should sell him to recoup some of the cost. Cut my losses.”\u003c/p\u003e\n\u003cp\u003eA memory of Moonshadow roars into my thoughts. Moonshadow bucking and squealing, trying to get away from strange men she didn’t know, trying to get back to me. I swallow hard and try to focus on the present.\u003c/p\u003e\n\u003cp\u003e“Please don’t sell Star,” I say quietly. “Crotchety as he is, I like him.”\u003c/p\u003e\n\u003cp\u003e“It’s a good thing I’m the boss right now ’cause I can’t sell him. I can’t fail on my first big stud fee deal. Nobody will respect me as an owner…Maybe your workouts with Star will get him in shape for the race at Keeneland next weekend.”\u003c/p\u003e\n\u003cp\u003eI move closer to Jack, getting in his space just like pushy Star. “Does this mean I got the exercise rider job?”\u003c/p\u003e\n\u003cp\u003eHe steps closer, invading my space this time. “I think it’s pretty obvious you’ve got the job.”\u003c/p\u003e\n\u003cp\u003e“Yay!” I squeal and jump into his arms, wrapping my arms around his neck. My heart swells at the trust Jack is putting in me. He clears his throat and I immediately let go, mortified. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eHe gently pats my shoulder. “So we’ll see you tomorrow morning, then?”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e“Stop calling me sir.” He laughs softly and gazes into my eyes, and it feels like everything stops. The wind stops rustling the grass. We both stop breathing. The only thing that keeps on are the twinkling stars.\u003c/p\u003e\n\u003cp\u003eHeat floods my body as he takes a step closer and gently pushes me against the white fence. “Hey,” he says. His fingertips graze my cheek. He stares at my lips, setting me on fire. Holy shit, what is happening!\u003c/p\u003e\n\u003cp\u003eI grab his shoulders to hold myself up, breathing hard, inhaling a mix of honeysuckle and soap. The fence scrapes against my back. What would Jack say if someone caught us here?\u003c/p\u003e\n\u003cp\u003eI push him away before anything happens.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” he murmurs, as if in a daze, locking his hands around my waist.\u003c/p\u003e\n\u003cp\u003e“Jack, no.”\u003c/p\u003e\n\u003cp\u003eAt the word no he jerks his hands away and holds them up. “Wow, you really don’t want to kiss me, eh?”\u003c/p\u003e\n\u003cp\u003e“You’re my boss.”\u003c/p\u003e\n\u003cp\u003eHis eyes flutter open wide and he takes a step back. “Shit, I’m sorry. I wasn’t thinking.”\u003c/p\u003e\n\u003cp\u003eOf course he wasn’t thinking. He doesn’t have to worry about what other people would say. “Why is the rich, gorgeous Jack Goodwin kissing a girl like her? He must be using her because she works at Cedar Hill. She’s convenient.” He doesn’t have to worry about his father getting fired if he’s caught kissing me. On top of that, after he badmouthed Abby Winchester today, he let her hug him! So how can I trust anything he says? Just like all rich people.\u003c/p\u003e\n\u003cp\u003eJack nervously scratches his nose. “I’m sorry. Can we pretend this never happened? My dad’ll be pissed at me.”\u003c/p\u003e\n\u003cp\u003eWithout a word, I abandon Jack by the pasture, haul ass back to Hillcrest, and rush into my shoebox of a room, slamming the door shut behind me, rattling the picture of my mother hanging by the door. I reach my bed in two steps and collapse.\u003c/p\u003e\n\u003cp\u003eJack Goodwin just tried to kiss me!\u003c/p\u003e\n\u003cp\u003eIt’s not that I’m nervous about the prospect of hooking up. I’ve fooled around before—I even had a regular thing going with this guy Adam. We almost slept together once, but not even the cheap wine coolers we drank before made it feel right. I want my first time to be with someone I love and respect.\u003c/p\u003e\n\u003cp\u003eI cradle my stuffed bear. If I’d stayed out by the pasture, if I hadn’t pushed Jack away, he would’ve kissed me.\u003c/p\u003e\n\u003cp\u003eAnd I’m not sure what I think about that.\u003c/p\u003e\n\u003cp\u003eI have five days to get Star in shape for his next race.\u003c/p\u003e\n\u003cp\u003eIf he doesn’t win this time, there’s a good chance Mr. Goodwin will convince Jack to sell him, and I can’t let that happen. Not again.\u003c/p\u003e\n\u003cp\u003eSo, on Monday morning before school, I meet Gael for my first day of work as an exercise rider at Cedar Hill.\u003c/p\u003e\n\u003cp\u003e“Congratulations on the job, drama mama.”\u003c/p\u003e\n\u003cp\u003eI give him my death glare as he gives me my schedule. I’m to take Minerva, Star, and Echoes of Summer out for exercise. I will ride each horse for about twenty minutes before handing the horse off to a hot-walker to cool down before it gets a bath and food.\u003c/p\u003e\n\u003cp\u003eFirst I take Minerva out onto the track, warm her up, then turn the other direction and race around the turf to avoid a traffic jam with other riders warming up.\u003c/p\u003e\n\u003cp\u003eWhen I’m just getting finished with Minerva, Jack appears on the edge of the track, riding Wrigley. He pulls his cowboy hat off, waves it at the staff, and puts it back on. Most guys my age would still be sleeping at 5:30 a.m., but Jack’s up early to see what’s happening on the track and in the barns.\u003c/p\u003e\n\u003cp\u003eWhen I trot past, riding Minerva, I discover that Mr. Serious is back. He avoids my eyes and tips his hat. “Good morning, Savannah.”\u003c/p\u003e\n\u003cp\u003e“Good morning, sir.”\u003c/p\u003e\n\u003cp\u003eThank the heavens he didn’t bring up last night’s almost kiss.\u003c/p\u003e\n\u003cp\u003eI drop Minerva off with a hot-walker then retrieve Star from Greenbriar. He flicks his ears forward and approaches me but doesn’t get too close. He’s starting to respect my space.\u003c/p\u003e\n\u003cp\u003e“Good boy.” I take his lead and direct him out onto the track. He seems happy and carefree today. We trot around the track two times and then head over to the clocker’s tower.\u003c/p\u003e\n\u003cp\u003e“I’m ready,” I tell Gael so he can time me, and Star and I take off. I feel like I’m riding a ballistic missile. “Woooo!” I maintain perfect control, so it’s a great run. When I’m finished, Gael and Jack are clapping, and Mr. Goodwin has joined them. He whistles and claps too.\u003c/p\u003e\n\u003cp\u003e“Time?” I call out to Gael.\u003c/p\u003e\n\u003cp\u003e“1:41,” he replies. “It’s not complete shit.”\u003c/p\u003e\n\u003cp\u003e“It was brilliant!” Jack shouts. Mr. Goodwin gives his son a weird look.\u003c/p\u003e\n\u003cp\u003eI wave to Jack, dismount, and whisper to Star that he did a wonderful job. But the second I pass Star off to a hot-walker, the horse starts whinnying and slapping his tail around. Instead of going to get Echoes of Summer, I rush back over to Star, relieve the hot-walker, and cool the horse down myself. Star nickers and nips at my face as we walk in circles over and over.\u003c/p\u003e\n\u003cp\u003eI only have five days to get this horse ready to race.\u003c/p\u003e\n\u003cp\u003eWhat’s wrong with him? Why does he only respond to me?\u003c/p\u003e\n\u003cp\u003eAfter work on Monday morning, Rory drives me to my new school, and on the way, I dig into his new screenplay.\u003c/p\u003e\n\u003cp\u003e“But this doesn’t make any sense,” I say, waving the script. “Your character just met the girl two minutes ago. Why would she sleep with him?”\u003c/p\u003e\n\u003cp\u003e“True love. She saw him and just had to have him.”\u003c/p\u003e\n\u003cp\u003e“Girls don’t sleep with guys two minutes after meeting them.”\u003c/p\u003e\n\u003cp\u003e“But it’s like, every guy’s dream!” Keeping one hand on the wheel, Rory taps his other hand on the paper. “That’s why this script will sell. Men will love it.”\u003c/p\u003e\n\u003cp\u003e“Well, I wouldn’t pay for a movie ticket to this. You need to edit.”\u003c/p\u003e\n\u003cp\u003e“I’m so glad I met you. Nobody else wants to read my screenplays.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry no one wants to read your porn,” I tease.\u003c/p\u003e\n\u003cp\u003e“Hey, now. It’s high-brow porn.”\u003c/p\u003e\n\u003cp\u003eMy heart starts thumping hard the moment we pull into the parking lot, where Rory says the seniors park in the back corner. I peer out the truck window at a sunken area of concrete filled with water, weeds, and mud.\u003c/p\u003e\n\u003cp\u003e“Why is there a lake in the middle of the parking lot?”\u003c/p\u003e\n\u003cp\u003e“Because the school spends all its money on the football team.”\u003c/p\u003e\n\u003cp\u003eRory adds that everyone calls this area of the parking lot The Swamp, and for some unknown reason it’s cool to park there.\u003c/p\u003e\n\u003cp\u003eI hop down out of the truck, and Rory links my arm in his as we walk past a group of smokers and then the skaters. He helps me check in at the office and points out the cafeteria and the bathroom, but then abandons me at my homeroom because he absolutely has to meet up with the drama teacher. He swears this will be the year the teacher finally agrees to produce his original play, Call Me When Your Mom Is Back in Town.\u003c/p\u003e\n\u003cp\u003eAfter homeroom, in which I talk to absolutely nobody, I navigate through the crowded hallway. My first class of the day is Crucial Life Lessons, a required course for seniors, where we’ll learn, you guessed it, “Crucial Life Lessons.” Is that stuff like how to balance our bank accounts, warnings not to sign up for credit cards, and the difference between 87 and 93 octane gas?\u003c/p\u003e\n\u003cp\u003eI enter the classroom and grab a seat toward the back. The name Coach Lynn is scrawled across the whiteboard. Vanessa Green comes in, takes the seat right in front of me, and turns around.\u003c/p\u003e\n\u003cp\u003e“I had fun Saturday night,” she says. “I think I have a sparkler addiction now.”\u003c/p\u003e\n\u003cp\u003e“I had fun too—”\u003c/p\u003e\n\u003cp\u003eJack Goodwin appears in the doorway.\u003c/p\u003e\n\u003cp\u003e“Oh shit,” I mumble.\u003c/p\u003e\n\u003cp\u003eHe sees me and swaggers past girls trying to speak to him and lazily drops into the desk next to mine, props his foot on his thigh, and shakes his cowboy boot. I guess he isn’t allowed to wear a cowboy hat in school; his hair curls around his collar.\u003c/p\u003e\n\u003cp\u003e“You did fantastic this morning,” Jack says, leaning toward me and smiling that lopsided smile. “I know Star’ll do well this weekend at Keeneland. I know it.”\u003c/p\u003e\n\u003cp\u003e“Thank you.” I smile, bowing my head a little.\u003c/p\u003e\n\u003cp\u003e“So you and Whitfield, huh?” He drapes his arms across the desks in front of and behind him. Vanessa swivels slightly, listening in.\u003c/p\u003e\n\u003cp\u003e“What?” I reply.\u003c/p\u003e\n\u003cp\u003e“I saw you walking in the parking lot with him,” Jack replies.\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003e“So I’m wondering if you guys got a thing going on.”\u003c/p\u003e\n\u003cp\u003e“Naw. He’s too tall. He’d break his neck trying to kiss me.”\u003c/p\u003e\n\u003cp\u003eVanessa laughs.\u003c/p\u003e\n\u003cp\u003eJack gazes into my eyes and my pulse thumps harder and harder. Is he gonna bring up the almost kiss?\u003c/p\u003e\n\u003cp\u003e“So he’s just a friend?” Jack asks.\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003eThat’s when Rory enters the classroom and grabs the seat right in front of Jack.\u003c/p\u003e\n\u003cp\u003e“Hey, Ror,” I say. “Jack thought that we’re dating.”\u003c/p\u003e\n\u003cp\u003eRory screws up his face. “The other night after the party? S fell asleep on the drive home. Her snoring is terrible. She’s like a troll or something.”\u003c/p\u003e\n\u003cp\u003e“Hey!” I say.\u003c/p\u003e\n\u003cp\u003e“A troll, huh?” Jack whispers to me. “I thought you were a Shortcake.”\u003c/p\u003e\n\u003cp\u003eI feel my face flaming pinker than Strawberry Shortcake her damned self. I swivel around and concentrate on Vanessa’s straight blond hair.\u003c/p\u003e\n\u003cp\u003eAs Coach Lynn begins to take roll, Jack leans across the aisle toward me.\u003c/p\u003e\n\u003cp\u003e“I wish this class taught us real life lessons,” he whispers.\u003c/p\u003e\n\u003cp\u003eI open my notebook and uncap my pen, pretending to get ready to take notes, which is ridiculous because I hate taking notes. “What kind of lessons?” \u003c/p\u003e","sourceLink":"https://allnovel.net/racing-savannah-hundred-oaks-4/page-9.html","bookId":1969,"creation":"Oct 5, 2019 10:19:04 AM","modification":"Oct 5, 2019 10:19:04 AM"}
