{"id":70610,"no":11,"title":"Page 11","content":"\u003cp\u003e“Do I need to get a ticket?”\u003c/p\u003e\n\u003cp\u003e“Of course not—we’l sit in the owner’s box.”\u003c/p\u003e\n\u003cp\u003e“Damn. Yeah, I definitely want to come.”\u003c/p\u003e\n\u003cp\u003e“Cool. I’l cal you about details. Oh—and wear a suit or something nice.”\u003c/p\u003e\n\u003cp\u003e“I can do that. Thanks for the invite.”\u003c/p\u003e\n\u003cp\u003eI smile. This is great. I get to hang out with Ty under the supervision of JJ and Carter. They’l keep me sane.\u003c/p\u003e\n\u003cp\u003e“Did you want a ride home tonight?”\u003c/p\u003e\n\u003cp\u003e“Thanks for the offer, but I think I’l check out this party.”\u003c/p\u003e\n\u003cp\u003e“Gonna hang with Kristen again?”\u003c/p\u003e\n\u003cp\u003e“Hel no,” he says, laughing. “I like being with girls who have actual brain activity. Girls like you.”\u003c/p\u003e\n\u003cp\u003eOh. My. God. I quickly say, “Have fun. I’l cal you tomorrow. Bye!” I jump into my truck and drive away. I don’t bother looking in the rearview mirror this time. I know he’s watching me.\u003c/p\u003e\n\u003cp\u003eAt home, I run upstairs to Mike’s room and pound on the door.\u003c/p\u003e\n\u003cp\u003e“Come in.” I open the door to find Mike lounging on the floor playing a footbal video game. I sit down next to him, and he passes me the second control er. “What are you doing home so early?” he asks. “No parties or anything? No hot date with Ty?”\u003c/p\u003e\n\u003cp\u003e“If you want to play bal tomorrow, you’d better shut your mouth, because I’l kick your ass, bro.”\u003c/p\u003e\n\u003cp\u003e“Yeah, right.” Mike laughs as he immediately scores a touchdown. Man, do I suck at video games.\u003c/p\u003e\n\u003cp\u003e“So tel me what the Alabama coach said about me already!”\u003c/p\u003e\n\u003cp\u003e“We’re going to talk about Ty first. He’s real y cool, Jordan. And even though he’s not starting this year, he’l have his pick of col eges.”\u003c/p\u003e\n\u003cp\u003e“Great,” I say, throwing the control er down. I stand and shuffle across the room and fal onto Mike’s bed.\u003c/p\u003e\n\u003cp\u003e“Tel me what the Alabama guy said.”\u003c/p\u003e\n\u003cp\u003e“Well , on the down low, since I stretched the rules a bit by talking to him about you, if you keep playing like you did tonight, they’l offer you a ful ride.”\u003c/p\u003e\n\u003cp\u003e“You’re kidding me!”\u003c/p\u003e\n\u003cp\u003e“Nope,” Mike says. “Keep up the good work and you’re a shoo-in for Alabama. Just don’t get distracted, don’t get hurt, and don’t do anything stupid.”\u003c/p\u003e\n\u003cp\u003e“But isn’t it kinda weird that they’re wil ing to give me the ful ride even though I didn’t make any big passes tonight?”\u003c/p\u003e\n\u003cp\u003e“Hel , don’t question it,” Mike says, laughing. “Just rol with it. I would.”\u003c/p\u003e\n\u003cp\u003e“It would be awesome if I went to Alabama—we’d be rivals!”\u003c/p\u003e\n\u003cp\u003e“Tennessee would total y kick your ass.”\u003c/p\u003e\n\u003cp\u003e“Sure, keep tel ing yourself that.”\u003c/p\u003e\n\u003cp\u003eMike rubs his jaw. “But there’s one thing I don’t think either of us has considered. The coaches of any school you go to are going to use you as a recruitment tool. Alabama wil be showcasing you al the time, and they’l want you to help with advertising.”\u003c/p\u003e\n\u003cp\u003e“Ugh,” I say. “Like that time Sports Illustrated wanted to do an article on me? Thank God Dad stepped in and said no.”\u003c/p\u003e\n\u003cp\u003e“Yup,” Mike says. “I don’t think your life wil be so private anymore. Everyone’s going to know everything about you.”\u003c/p\u003e\n\u003cp\u003e“As long as I can play col ege bal , I don’t care.”\u003c/p\u003e\n\u003cp\u003e“Cool. Now, on to more important issues—tel me what’s up with Ty. I like him.”\u003c/p\u003e\n\u003cp\u003e“Me too. I invited him to Dad’s game on Sunday. Are you going?”\u003c/p\u003e\n\u003cp\u003eyou going?”\u003c/p\u003e\n\u003cp\u003e“I can if you want me to. Don’t you want some alone time with Ty?” Mike asks, grinning.\u003c/p\u003e\n\u003cp\u003e“Please come. Please help me act normal. I real y like Ty and want to be his friend, but I keep pushing him away. He sat next to me on the bus tonight and I ignored him most of the time.”\u003c/p\u003e\n\u003cp\u003eMike suddenly drops the control er. “He sat next to you on the bus? In the back row? In front of al those guys? Oh sis, he total y wants you bad.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” I say with a sigh.\u003c/p\u003e\n\u003cp\u003e“I can’t even imagine having the guts to sit with a girl in front of al those guys. Henry and JJ wil kick Ty’s ass if he hurts you. And even if they don’t kick his ass, they’l make fun of him for it in the locker room. Hel , I’d never stop mentioning it,” Mike laughs.\u003c/p\u003e\n\u003cp\u003eEnough about Ty. “I’m going to bed. Thanks for the help with the coach.”\u003c/p\u003e\n\u003cp\u003e“No prob. Wait—Jordan,” Mike says, standing and putting a hand on my shoulder. “Give Ty a shot. I don’t want you to go through life never taking a chance on a guy.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if I can,” I whisper.\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“I don’t know how to kiss or anything like that.”\u003c/p\u003e\n\u003cp\u003eMike chuckles. “Sis, if he kisses you, you’l figure out how to kiss back pretty quickly.”\u003c/p\u003e\n\u003cp\u003e“What if we get together, and then he breaks up with me? That would suck. And then we’d be stuck on a team together.”\u003c/p\u003e\n\u003cp\u003e“He wouldn’t risk anything if he wasn’t serious. Trust me. I can tel he’s a good guy.”\u003c/p\u003e\n\u003cp\u003eI nod. “Yeah, I know.”\u003c/p\u003e\n\u003cp\u003eBut is a good guy worth the risk of losing sight of my goals? My dreams?\u003c/p\u003e\n\u003cp\u003eonly father\u003c/p\u003e\n\u003cp\u003eWatching my favorite sport\u003c/p\u003e\n\u003cp\u003eWatching my favorite brother\u003c/p\u003e\n\u003cp\u003e(okay, my only brother)\u003c/p\u003e\n\u003cp\u003eWatching my only father cheer for Mike\u003c/p\u003e\n\u003cp\u003eSmiling\u003c/p\u003e\n\u003cp\u003eLaughing\u003c/p\u003e\n\u003cp\u003eShouting\u003c/p\u003e\n\u003cp\u003eTelling Mom how proud he is\u003c/p\u003e\n\u003cp\u003eSaying no father could have a better son\u003c/p\u003e\n\u003cp\u003eAnd I’m sitting right there\u003c/p\u003e\n\u003cp\u003eReady to drown myself in nacho cheese\u003c/p\u003e\n\u003cp\u003e’Cause all I have is football\u003c/p\u003e\n\u003cp\u003eAnd the person I want to share it with,\u003c/p\u003e\n\u003cp\u003emore than anything\u003c/p\u003e\n\u003cp\u003eHasn’t even asked if I won last night…\u003c/p\u003e\n\u003cp\u003ehenry\u003c/p\u003e\n\u003cp\u003ethe count? 17 days until alabama\u003c/p\u003e\n\u003cp\u003eIn his game, Mike total y kicked the Florida Gators’\u003c/p\u003e\n\u003cp\u003easses, 21–10. I screamed so much for my brother that I got hoarse.\u003c/p\u003e\n\u003cp\u003eNow I’m back at home, sitting in the kitchen, texting with Henry.\u003c/p\u003e\n\u003cp\u003eI text: How did party go?\u003c/p\u003e\n\u003cp\u003eHenry texts back: Carter got trashed \u0026amp; made out with freshman from lunch.\u003c/p\u003e\n\u003cp\u003eWTF! Carter really got drunk? He never drinks. I hope nothing’s wrong.\u003c/p\u003e\n\u003cp\u003eYeah, it was crazy. I was counting on him to give me a ride \u0026amp; I ended up lugging him home. He’s a heavy SOB. LOL. I know. He killed me with that sack on Wed. JJ?\u003c/p\u003e\n\u003cp\u003eAfter crazy fight, JJ \u0026amp; Lacey went upstairs to bedroom. Shocker. Was Carrie there?\u003c/p\u003e\n\u003cp\u003eYup.\u003c/p\u003e\n\u003cp\u003eAnd?\u003c/p\u003e\n\u003cp\u003eI hung with Marie again.\u003c/p\u003e\n\u003cp\u003eWas Ty there?\u003c/p\u003e\n\u003cp\u003eKristen spent entire time throwing herself @ Ty When I read that text, I throw up in my mouth. I text Henry back: Does Ty like Kristen?\u003c/p\u003e\n\u003cp\u003eDon’t think so. Carter, JJ \u0026amp; I will be at su casa in hour 4 fantasy Don’t think so. Carter, JJ \u0026amp; I will be at su casa in hour 4 fantasy draft\u003c/p\u003e\n\u003cp\u003eK\u003c/p\u003e\n\u003cp\u003eMom comes into the kitchen, carrying a bundle of sunflowers, and arranges them in a vase. “What are you doing tonight, Jordan?”\u003c/p\u003e\n\u003cp\u003e“The guys are coming over. Is that okay?”\u003c/p\u003e\n\u003cp\u003eMom nods, pul ing a bottled water from the fridge, and takes a seat.\u003c/p\u003e\n\u003cp\u003e“Thanks for coming to my game last night, Mom.”\u003c/p\u003e\n\u003cp\u003eShe smiles. “Wouldn’t have missed it. So…tel me about Ty Green. I haven’t seen a high school quarterback like him in years. Maybe ever.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“He’s better than your brother was at seventeen.”\u003c/p\u003e\n\u003cp\u003e“Yeah, but we can’t tel Mike that!”\u003c/p\u003e\n\u003cp\u003eMom laughs lightly. “Were you upset with Coach Mil er for taking you out?”\u003c/p\u003e\n\u003cp\u003e“Oh, hel yeah.”\u003c/p\u003e\n\u003cp\u003e“Is Ty coming over tonight?” Mom asks. Glancing up at me, she starts peeling the label off her bottled water.\u003c/p\u003e\n\u003cp\u003e“Nah. But I invited him to Dad’s game tomorrow.”\u003c/p\u003e\n\u003cp\u003e“Ah, wel I can’t wait to meet him. He looks like a cute young man.”\u003c/p\u003e\n\u003cp\u003e“Yup,” I say before thinking.\u003c/p\u003e\n\u003cp\u003e“Oh?” Mom’s grinning now. “Do you like him as more than a teammate?”\u003c/p\u003e\n\u003cp\u003eI shrug.\u003c/p\u003e\n\u003cp\u003eMom folds her hands together and lifts them to her chin, and her smile brightens even brighter, like how the sky gets when the sun starts dribbling over the horizon during early morning runs.\u003c/p\u003e\n\u003cp\u003eBefore I embarrass myself even more, and before Mom can start talking about feelings and shit, I dart out of the kitchen and run downstairs.\u003c/p\u003e\n\u003cp\u003eLater that evening, the guys and I are finishing up our fantasy draft while eating enough Chinese food to feed al of China itself.\u003c/p\u003e\n\u003cp\u003eHenry lies down on the rug and clutches his stomach.\u003c/p\u003e\n\u003cp\u003e“Remind me not to eat two orders of General Tso’s chicken ever again.”\u003c/p\u003e\n\u003cp\u003e“Hey, Henry,” I say.\u003c/p\u003e\n\u003cp\u003e“Yeah?” he replies with a grin.\u003c/p\u003e\n\u003cp\u003e“Don’t eat two orders of General Tso’s chicken ever again.”\u003c/p\u003e\n\u003cp\u003e“This egg drop soup is complete crap,” Carter says, kicking the egg snot stuff around with a spoon. “Not enough salt. And the eggs are rancid.”\u003c/p\u003e\n\u003cp\u003e“When I turn eighteen, I’m getting a tattoo,” JJ\u003c/p\u003e\n\u003cp\u003eannounces.\u003c/p\u003e\n\u003cp\u003e“Of what?” Henry asks.\u003c/p\u003e\n\u003cp\u003e“I’m thinking of getting a Chinese character, like right above my butt,” he says, pointing at his lower back.\u003c/p\u003e\n\u003cp\u003e“You would get a tramp stamp,” I say, biting into a fortune cookie as Henry and Carter start laughing.\u003c/p\u003e\n\u003cp\u003e“What would it say?”\u003c/p\u003e\n\u003cp\u003e“I was thinking thunder,\u003c/p\u003e\n\u003cp\u003eor ripple, you know,\u003c/p\u003e\n\u003cp\u003esomething deep like that.”\u003c/p\u003e\n\u003cp\u003eHenry hoists himself up onto an elbow and leans over to whisper in my ear. “Maybe we could pay the tattoo artist off, and get him to write the Chinese word for exit.”\u003c/p\u003e\n\u003cp\u003eI crack up. “Total y.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” JJ demands.\u003c/p\u003e\n\u003cp\u003e“We think you should go with thunder,” Henry says, biting his lips together.\u003c/p\u003e\n\u003cp\u003eJJ thinks for a moment. “Yeah, you’re right. Thunder, it is.”\u003c/p\u003e\n\u003cp\u003e“I’l get a tattoo too,” Henry says, flexing his left arm.\u003c/p\u003e\n\u003cp\u003e“Of a hula girl, on my bicep.”\u003c/p\u003e\n\u003cp\u003eI grin before asking, “What are you gonna get, Carter?”\u003c/p\u003e\n\u003cp\u003e“Um, maybe, like, flames? What about you, Woods?”\u003c/p\u003e\n\u003cp\u003e“Maybe the Alabama logo?” I point at my hip bone and say, “Right here?”\u003c/p\u003e\n\u003cp\u003eHenry coughs into a fist as JJ’s cel rings.\u003c/p\u003e\n\u003cp\u003e“Yo, how’s my favorite girl?” JJ says, grinning lazily and reclining against the couch as if he’s the Greek god in charge of pleasuring the women of Hundred Oaks High School. Hel , he’s probably waiting on some girls to jump out of the closet and start fanning him with palm leaves while feeding him potato chips. “I’l be there in ten minutes,” JJ continues, standing up.\u003c/p\u003e\n\u003cp\u003e“Who was that?” Henry asks. “The redheaded chick from the cafeteria?”\u003c/p\u003e\n\u003cp\u003e“Nah. Lacey wants me to come over.” JJ winks. “She needs me.”\u003c/p\u003e\n\u003cp\u003eHenry laughs. “Have fun, man.”\u003c/p\u003e\n\u003cp\u003e“Gag me,” I mutter as I start cleaning up trash, picking up used chopsticks and fortune cookie wrappers.\u003c/p\u003e\n\u003cp\u003eJJ says, “Later,” and runs up the stairs and out the basement door.\u003c/p\u003e\n\u003cp\u003eCarter stands up and throws a few take-out cartons away. “I’m gonna jet too, Woods. I need to get home before my dad freaks out.” \u003c/p\u003e","sourceLink":"https://allnovel.net/catching-jordan-hundred-oaks-1/page-11.html","bookId":1966,"creation":"Oct 5, 2019 10:17:33 AM","modification":"Oct 5, 2019 10:17:33 AM"}
