{"id":70619,"no":20,"title":"Page 20","content":"\u003cp\u003e“What’s wrong?”\u003c/p\u003e\n\u003cp\u003eNot answering, I shuffle across the room in my underwear, lock the door, and then rejoin him in my bed.\u003c/p\u003e\n\u003cp\u003eThings start getting even more intense, so intense we just know it’s going to happen, so I say, “Do you have something?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eHe leans over the side of my bed, reaches down to the floor, and grabs a condom from his jeans pocket. I’m a bit scared, but this feels so right. He actual y likes me for me. And I just have to have him. Every bit of him. Now.\u003c/p\u003e\n\u003cp\u003eA little while later, we’re stil clinging to each other under the covers.\u003c/p\u003e\n\u003cp\u003e“Want to make this official?” he asks.\u003c/p\u003e\n\u003cp\u003e“What? Like be a couple?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Sure,” I say, smiling.\u003c/p\u003e\n\u003cp\u003eHe brushes the hair out of my face with his pinky finger and cups my chin with his hand. I can’t believe we just did it. It! It did hurt some, but it wasn’t scary…it was…fun and sweet.\u003c/p\u003e\n\u003cp\u003eNow we’re staring at each other and he keeps giving me little kisses. “I’ve never felt like this before,” he says.\u003c/p\u003e\n\u003cp\u003e“Me either. So why me?”\u003c/p\u003e\n\u003cp\u003e“You’re strong and in control and different and mature. Why me?”\u003c/p\u003e\n\u003cp\u003eAl I can think about is how hot he is, but then I say,\u003c/p\u003e\n\u003cp\u003e“You’re smart and cute.”\u003c/p\u003e\n\u003cp\u003e“That’s it?” he replies, tickling my stomach. “That’s it? ”\u003c/p\u003e\n\u003cp\u003e“What more do you want?” I reply, laughing as I squirm.\u003c/p\u003e\n\u003cp\u003e“Well , Kristen Markum gave me a long handwritten note saying how much she wants me. Along with a picture.” He raises his eyebrows at me and laughs.\u003c/p\u003e\n\u003cp\u003e“Ugh. I hate that girl.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eI take a deep breath. “Wel , besides the fact that she cal ed me a dyke and a slut and accused me of sleeping with JJ and Henry…”\u003c/p\u003e\n\u003cp\u003e“What else?”\u003c/p\u003e\n\u003cp\u003e“Kristen and I were okay friends growing up…and then in seventh grade, we were real y excited about going to the Christmas Dance.”\u003c/p\u003e\n\u003cp\u003eI couldn’t wait—I had these cool, red New Balances I was going to wear, and Kristen and I bought these matching red cashmere sweaters. I thought I might get to dance with this eighth grader who was kinda cute. Maybe even get my first kiss.\u003c/p\u003e\n\u003cp\u003eI go on, “And then Carter asked Kristen to the dance, and she sort of laughed in his face.”\u003c/p\u003e\n\u003cp\u003e“Yikes.”\u003c/p\u003e\n\u003cp\u003e“I know. He felt awful, so I got al the guys on my footbal team to boycott the dance, and I threw this awesome party in my basement instead. We had, like, awesome party in my basement instead. We had, like, a slasher movie marathon, and Dad made chili dogs and gave us root beer and told al the guys these epic footbal stories from when he played with Emmitt Smith and Michael Irvin…and, wel , al the guys went back to school on Monday saying my party was better than any dance could ever be.”\u003c/p\u003e\n\u003cp\u003eTy laughs. “You’re hilarious.”\u003c/p\u003e\n\u003cp\u003e“And al the girls at school were real y pissed at me\u003c/p\u003e\n\u003cp\u003e’cause I’d ruined the dance for them, and Kristen told everyone that I’d boycotted the dance because no guy would ever want to dance with me.”\u003c/p\u003e\n\u003cp\u003eBecause I was taller than all the guys…and huge. Ugly.\u003c/p\u003e\n\u003cp\u003e“Ouch,” he says, turning to look at the ceiling.\u003c/p\u003e\n\u003cp\u003e“And I’ve stil never been to a dance.”\u003c/p\u003e\n\u003cp\u003eI don’t tel Ty about how after Kristen said that, I decided being a guy was better, because none of my teammates would ever say anything so horrible to me. And none of them ever have.\u003c/p\u003e\n\u003cp\u003e“Well , I would’ve gone to your slasher-movie chili-dog party, ’cause you’re beautiful,” Ty says, smiling. A knock sounds on the door, and I hear someone fiddling with the knob. Shit! I didn’t think my parents would be home for another half hour! Then I rol over and look at the clock—I total y lost track of time. I quickly start pul ing my clothes back on. Ty does the same and we’re laughing at each other as we struggle with shirts and jeans and underwear.\u003c/p\u003e\n\u003cp\u003eI hear Mom say, “Jordan, what are you doing in there?”\u003c/p\u003e\n\u003cp\u003e“Nothing…hanging out with Ty.”\u003c/p\u003e\n\u003cp\u003eI don’t hear her say anything else for a few seconds, but then she says, “Wel , come on down for dinner. Ty?\u003c/p\u003e\n\u003cp\u003eCan you stay? Mr. Woods wants to meet you.”\u003c/p\u003e\n\u003cp\u003eCrap. I bite my fist and shake my head furiously at Ty, which doesn’t deter him at al because he says, “I would love that, Mrs. Woods. Thanks for inviting me.”\u003c/p\u003e\n\u003cp\u003eHe has this shit-eating grin on his face, so I punch him hard on the shoulder, and he fal s back onto my bed.\u003c/p\u003e\n\u003cp\u003e“Damn it, Woods. That hurt!”\u003c/p\u003e\n\u003cp\u003eI smile at him as he puts his jeans on. After pul ing my hair back into a knot, we head downstairs, and I pray that Mom doesn’t question why Ty and I were in my room with the door locked.\u003c/p\u003e\n\u003cp\u003eSure enough, when she sees us come into the kitchen, she gives me a knowing look, but doesn’t say a thing. I’l be in for it later, though. She tel s me to carry the roast to the table and asks Ty to grab the gravy, which takes just about everything we’ve got because we’re giggling so hard.\u003c/p\u003e\n\u003cp\u003eBut Ty stops giggling when we walk into the dining room, where Dad is already sitting with his signature bottle of Gatorade. Ty straightens up, seeming to grow by several inches, and wipes the smile off his face. After setting the gravy down on the table, Ty stretches out his hand to Dad and says, “I’m Tyler Green, sir. It’s nice to meet you.”\u003c/p\u003e\n\u003cp\u003eDad smiles and returns the handshake. “Donovan Woods. I’ve heard a lot about you.” Dad gestures at the seat to his immediate right, then points at Ty to sit in it. I sit down to Ty’s right, poised to butcher the roast.\u003c/p\u003e\n\u003cp\u003e“So,” Dad says to Ty, “my son tel s me you’ve got a cannon for an arm.”\u003c/p\u003e\n\u003cp\u003eTy smiles slightly. “Oh, I’m nothing compared to you and Mike.”\u003c/p\u003e\n\u003cp\u003eWhat? No mention of me? Believe it or not, I can throw just as far and as hard as Mike. Doesn’t Ty know that? Between me, Mike, and Ty, Ty’s the obvious footbal prodigy. Maybe I shouldn’t be so proud, but it would’ve been nice to get some recognition from my new boyfriend.\u003c/p\u003e\n\u003cp\u003eMom final y brings the corn and bread to the table, and we dig in.\u003c/p\u003e\n\u003cp\u003e“What are your plans for col ege?” Dad asks Ty as\u003c/p\u003e\n\u003cp\u003e“What are your plans for col ege?” Dad asks Ty as he grabs some roast.\u003c/p\u003e\n\u003cp\u003e“No plans yet,” Ty replies.\u003c/p\u003e\n\u003cp\u003e“What col eges are you looking at? Which schools have contacted you so far?”\u003c/p\u003e\n\u003cp\u003e“None so far, sir.”\u003c/p\u003e\n\u003cp\u003eDad bites into a piece of bread, chews, and narrows his eyes. “I find that hard to believe.”\u003c/p\u003e\n\u003cp\u003eTy glances at me and takes a deep breath, so I say,\u003c/p\u003e\n\u003cp\u003e“Just drop it, Dad.”\u003c/p\u003e\n\u003cp\u003eDad glares at me. “Jordan, just because you have some competition for your position doesn’t mean you should be selfish and ruin Ty’s col ege aspirations. If he’s better than you, like everyone’s saying, you should be helping your teammate to get a good scholarship. Maybe you should tel Coach Mil er to give him more of your playing time.”\u003c/p\u003e\n\u003cp\u003eDad says these horrific things as easily as if he’s buying a book of stamps at the post office.\u003c/p\u003e\n\u003cp\u003eI choke on my lemonade. Tears rush to my eyes as Ty pats me on the back.\u003c/p\u003e\n\u003cp\u003e“Donovan, please,” Mom says, pinching the bridge of her nose. “Jordan has earned her spot on that team. She deserves every second of playing time she gets.”\u003c/p\u003e\n\u003cp\u003eDad keeps chewing his bread. “Doesn’t Ty deserve a chance to play too?”\u003c/p\u003e\n\u003cp\u003e“Dad, you have no idea what you’re even talking about. You don’t even know Ty. And you never come to our games anyway.” I turn to face my mother. “Mom, thank you for dinner. May I be excused?”\u003c/p\u003e\n\u003cp\u003eMom seems on the verge of tears. She nods slowly. Before I leave the room, I steal a peek at Dad, who is chewing on his roast. Does he even have a clue how much he just hurt me? He just embarrassed me in front of my brand new boyfriend. When I find Ty’s face, it’s impassive. Blank as a bed of snow. Is blank how he real y feels about me?\u003c/p\u003e\n\u003cp\u003eAfter running upstairs, I throw open my closet and pul out my trainers and put on some running clothes. I storm back through the house, peering into the dining room, and see that Ty’s stil sitting there with my father, eating as though nothing just happened.\u003c/p\u003e\n\u003cp\u003eRunning down the road in twilight, winding around the little curves near my house, jogging past the cow pastures and a rustic red barn, I keep waiting for Ty to sprint up behind me, announcing that he punched Dad in the face or something. I run for an hour, but Ty never comes sprinting after me.\u003c/p\u003e\n\u003cp\u003eI can’t help but notice that, unlike Henry, Ty didn’t tel my dad to shove it or stick up for me in any way. I get that Dad intimidates people, but how could Ty not say anything? I’m his girlfriend! I just slept with him, and he just absorbed Dad’s attack on me, acting like it didn’t happen.\u003c/p\u003e\n\u003cp\u003eShouldn’t he be out here chasing after me?\u003c/p\u003e\n\u003cp\u003erevelations\u003c/p\u003e\n\u003cp\u003ethe count? 7 days until alabama\u003c/p\u003e\n\u003cp\u003eAfter practice, I leave the locker room and I’m heading to the parking lot when Carrie rushes up to me. I can see Ty standing next to my truck waiting on me, but I stop to find out what she wants.\u003c/p\u003e\n\u003cp\u003e“Carter told me you and Ty are dating now—I’m so happy for you.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“Is he, like, an amazing kisser?”\u003c/p\u003e\n\u003cp\u003eI smile and, without thinking, I blurt out, “He’s great.”\u003c/p\u003e\n\u003cp\u003eOkay, okay, it’s kind of fun talking about Ty. It’s not like JJ, Henry, or Carter would want to know how Ty’s tongue feels.\u003c/p\u003e\n\u003cp\u003eCarrie returns my smile. “See, kissing’s not that hard.”\u003c/p\u003e\n\u003cp\u003e“Yup.”\u003c/p\u003e\n\u003cp\u003e“He’s got a great body too.”\u003c/p\u003e\n\u003cp\u003e“Yup.”\u003c/p\u003e\n\u003cp\u003e“Jordan? You know you can talk to me, right? I’d never repeat anything you say.”\u003c/p\u003e\n\u003cp\u003eI glance at her and nod. It would be great to talk to her about everything, maybe even get some more pointers on what guys like. “Thanks, Carrie. Um, yeah, I had one question, but you can’t tel a soul.”\u003c/p\u003e\n\u003cp\u003e“Lips are sealed.”\u003c/p\u003e\n\u003cp\u003e“Um, wel , it, you know, sort of hurt. Does it always hurt? Because JJ and, um, Henry, say it feels great.”\u003c/p\u003e\n\u003cp\u003eShe smiles, shifting her bag on her shoulder. “The first time?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“Sure, it hurts. But they’re guys—it always feels good to them. So you’ve only done it once, then?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“It won’t be so bad next time.”\u003c/p\u003e\n\u003cp\u003e“It wasn’t bad the first time!” We both crack up.\u003c/p\u003e\n\u003cp\u003e“I’m glad you’re happy, Jordan.”\u003c/p\u003e\n\u003cp\u003e“What about you? Are you and Carter…?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “He’s cool, but I miss Sam, and I need to get over him before I try dating again.”\u003c/p\u003e\n\u003cp\u003eThe shock of this statement causes me to drop my bag. “What? But you broke up with him.”\u003c/p\u003e\n\u003cp\u003e“I know…I had to.”\u003c/p\u003e\n\u003cp\u003e“Why?” I say, putting a hand on my hip. I can’t believe I trusted her and she doesn’t seem to have any clue about anything.\u003c/p\u003e\n\u003cp\u003e“Jordan…I think you should talk to him about this.”\u003c/p\u003e\n\u003cp\u003e“Why? It’s your fault you broke up!” I’m tempted to push Carrie to the ground and punch her face. Henry hasn’t been himself at al since she dumped him, and here she is, saying she’s stil into him! What. A. Skank. She tightens her ponytail, then peeks at me. “He wants to get back together with me, and you should know that I love him very much…but I can’t be with a guy who doesn’t love me back.” \u003c/p\u003e","sourceLink":"https://allnovel.net/catching-jordan-hundred-oaks-1/page-20.html","bookId":1966,"creation":"Oct 5, 2019 10:17:33 AM","modification":"Oct 5, 2019 10:17:33 AM"}
