{"id":70626,"no":27,"title":"Page 27","content":"\u003cp\u003eSince Alabama expects me to act like a lady al the time, I’m wearing a new grey dress and heels, so I’m stumbling along as we enter the quad, which is covered in red and white Rol Tide flags. I’m drawing tons of attention to myself, including the stares of some hot guys. I mean, they’re nothing compared to Ty, but I’m glad to know there wil be more of a selection than at Hundred Oaks. Some of them smile at us.\u003c/p\u003e\n\u003cp\u003eI elbow Mom. “Dad better watch out. These col ege guys are total y into you.”\u003c/p\u003e\n\u003cp\u003eMom laughs. “That would certainly be a scandal. The wife of the Tennessee Titans’ quarterback runs off with a twenty-year-old col ege boy.”\u003c/p\u003e\n\u003cp\u003eThen a dark, tal guy with wavy black hair walks by us. He puts Ty to shame. “Uh, Mom, if you ran off with that guy, no one would blame you.”\u003c/p\u003e\n\u003cp\u003eAnd then Dad gives me a noogie and says, “What did you say?”\u003c/p\u003e\n\u003cp\u003e“Dad! Stop,” I exclaim, smoothing out my hair.\u003c/p\u003e\n\u003cp\u003e“Everyone’s staring!” I add, which makes him laugh even harder.\u003c/p\u003e\n\u003cp\u003eWe find the athletic department, where the director greets us enthusiastical y, offering us coffee and soda and food, and if we didn’t cut him off, I’m sure Mark Tucker would’ve offered us a trip to a spa and a vacation and a new Ferrari.\u003c/p\u003e\n\u003cp\u003eI did my homework. Before Mr. Tucker became the Director of Athletics for Alabama, he was an Olympic skier. Then he total y wiped out in the final seconds of a race, blowing the gold medal. So he retired, vowing never to ski again or some shit like that. Afterward, he went back to col ege and got a degree in school administration.\u003c/p\u003e\n\u003cp\u003e“We’re so glad you could visit,” Mr. Tucker says, shaking my hand and patting my shoulder\u003c/p\u003e\n\u003cp\u003esimultaneously. “Come on in my office.” He ushers us in, and I can’t help but notice al the people in the outer office gawking and pointing at me. What’s that about?\u003c/p\u003e\n\u003cp\u003eMom, Dad, and I take a seat, and then I hear Mr. Tucker raising his voice, so I turn and see he’s speaking with his assistant. “Where is he?” Mr. Tucker says quickly, quietly.\u003c/p\u003e\n\u003cp\u003e“He said he doesn’t have time for this,” the assistant replies.\u003c/p\u003e\n\u003cp\u003e“I don’t care what he says,” Mr. Tucker exclaims. “Tel him to get over here. Now.”\u003c/p\u003e\n\u003cp\u003ehim to get over here. Now.”\u003c/p\u003e\n\u003cp\u003eWho doesn’t have time for what?\u003c/p\u003e\n\u003cp\u003eDad furrows his eyebrows as he turns from watching the exchange. He glances at me.\u003c/p\u003e\n\u003cp\u003eMr. Tucker shuts the door and sits at his desk, unbuttoning his suit jacket. “So, Jordan, what are you thinking of majoring in?”\u003c/p\u003e\n\u003cp\u003eI kinda want to say creative writing, but the last thing I need is my future teammates to hear that I’m beginning to like poetry. “I’m not sure yet, Mr. Tucker. Maybe physical therapy? I dunno.”\u003c/p\u003e\n\u003cp\u003eMr. Tucker laughs lightly. “No need to worry. You have a lot of time before you have to figure that out. So, I trust you know how excited we are that you’re considering joining our program?”\u003c/p\u003e\n\u003cp\u003e“Yes,” I reply. “Sir, about the game on Friday, I wasn’t feeling wel and didn’t play my best, but it won’t happen aga—”\u003c/p\u003e\n\u003cp\u003eHe waves a hand at me. “Don’t worry. Happens to the best of us.”\u003c/p\u003e\n\u003cp\u003eI played like complete suckage on Friday night—how could he not care? Maybe he’s sympathetic ’cause he flew off the Super G ski track and landed in some pine trees. “But—” I say.\u003c/p\u003e\n\u003cp\u003e“Your performance on Friday night isn’t an issue,” Mr. Tucker adds.\u003c/p\u003e\n\u003cp\u003e“But she threw two picks,” Dad exclaims. Confusion and anger cloud his face.\u003c/p\u003e\n\u003cp\u003eMr. Tucker waves his hand again. “So you know we want you to be part of our recruiting team here at Alabama?”\u003c/p\u003e\n\u003cp\u003e“Um, yes, sir. But I don’t know what that means exactly. Would you want me to talk to potential players or something?”\u003c/p\u003e\n\u003cp\u003eMr. Tucker fiddles with a paperweight on his desk.\u003c/p\u003e\n\u003cp\u003e“Well …yes, but that’s not al .” The office door slams open to reveal a man in khakis, a windbreaker, and a basebal cap. Typical coach-wear. It’s the head coach, Rob Thompson. He’s one of the best coaches in the game; his specialty is rearing future NFL quarterbacks. Some of the best have come from this school.\u003c/p\u003e\n\u003cp\u003eI jump to my feet and smooth out my dress, but before I can introduce myself, Coach Thompson says,\u003c/p\u003e\n\u003cp\u003e“You’ve got five minutes, Tucker. I have practice.”\u003c/p\u003e\n\u003cp\u003eMy mouth fal s open. The coach doesn’t have more than five minutes to speak with a potential quarterback? One they are prepared to give a ful ride to? What the hel does that mean?\u003c/p\u003e\n\u003cp\u003e“Can you give us ten minutes, Rob?” Mr. Tucker asks. “And I’l give Mr. and Mrs. Woods and Jordan the tour of the grounds and stadium.”\u003c/p\u003e\n\u003cp\u003e“You’ve got five,” Coach Thompson says, shaking Dad’s hand, then taking a seat on the other side of Mom.\u003c/p\u003e\n\u003cp\u003eShe purses her lips and clutches her bag. She looks like she might just stand up and leave.\u003c/p\u003e\n\u003cp\u003eDoes Coach Thompson have a problem with the Titans? Maybe he’s acting like an asshole because my bro plays for Alabama’s main rival, Tennessee. But wait, I would be an asset because I know how Mike plays and thinks. Coach Thompson must realize this. So what the hel is this dude’s problem?\u003c/p\u003e\n\u003cp\u003eDad sits back down in his chair and rubs his eyes with a thumb and a forefinger.\u003c/p\u003e\n\u003cp\u003eMom speaks up first. “Mr. Tucker, you were discussing Jordan’s role in recruiting? What exactly does that mean?”\u003c/p\u003e\n\u003cp\u003e“We’d like for her to speak at some events and do more photography work for us—like she did for our boosters’ calendar. We’d also like her to be the face of our charity program. We encourage foster children to consider sports, showing them that a team can be a family too.”\u003c/p\u003e\n\u003cp\u003eI feel confused. Mike doesn’t have to do any of this stuff for Tennessee. Sure, they make posters of him, stuff for Tennessee. Sure, they make posters of him, but it’s not like he has to pose like I did. And I’m al for charity and helping kids, but with practice and school and traveling to games, how wil I have time for the charity program, speaking at events, and recruiting?\u003c/p\u003e\n\u003cp\u003e“Okay. I can do those things,” I say, peeking at Coach Thompson. “But it seems like al these extra activities might affect my practice time. Shouldn’t I be focusing on playing bal ?”\u003c/p\u003e\n\u003cp\u003eCoach Thompson crosses his arms and stares out the window. “You won’t be playing footbal for me anytime soon.”\u003c/p\u003e\n\u003cp\u003e“But she has the best QB record in the entire state of Tennessee,” Dad replies, and my heart gets so excited I think it might stop.\u003c/p\u003e\n\u003cp\u003e“It’s true—I threw for 2,653 yards and thirty-one touchdowns last year alone.”\u003c/p\u003e\n\u003cp\u003eThe coach laughs, but it’s not a nice laugh. “I think my five minutes are up, Tucker.” He stands and walks out of the office, letting the door slam behind him. I’m going to play for this jerk?\u003c/p\u003e\n\u003cp\u003eGlaring at the door, Mr. Tucker runs a hand through his hair and rises from his desk. “I’m sorry about Coach Thompson. He’s under a lot of stress…you know, with the upcoming game against Florida. Let me show you around the school.”\u003c/p\u003e\n\u003cp\u003e“I sure hope the coach won’t be treating my daughter like that when she’s a member of his team,” Mom says, folding her hands in front of her.\u003c/p\u003e\n\u003cp\u003e“Oh, of course not,” Mr. Tucker says, ushering us out of his office.\u003c/p\u003e\n\u003cp\u003e“Let’s go home,” Dad says to me.\u003c/p\u003e\n\u003cp\u003e“But I haven’t seen the field yet.”\u003c/p\u003e\n\u003cp\u003e“I think we’ve seen enough.”\u003c/p\u003e\n\u003cp\u003e“Dad, come on,” I whisper, bouncing on my tiptoes. He’d use any reason to get me to leave. So what if Thompson’s in a grouchy mood today? “Alabama’s my dream.”\u003c/p\u003e\n\u003cp\u003eDad rests a hand on my shoulder and, eventual y, he nods. “It won’t hurt to take a look around campus.”\u003c/p\u003e\n\u003cp\u003eWe get to see some of the classrooms and the new state-of-the-art gym and workout facilities, including a new pool. Al of this bores me. I want to see the freaking stadium! It takes about an eon for us to go out there, what with these awful shoes I’m wearing, and with Mr. Tucker’s need to point out every last little thing, from where the bike racks are located to where I could pick up a newspaper to where students are al owed to smoke. I would hope an athletic director would know better than to point out ashtrays to a quarterback, but whatever. I’l trudge through Mr. Tucker’s show-and-tel as long as I get to see the field eventual y.\u003c/p\u003e\n\u003cp\u003eFinal y, when we get to the stadium, Dad says, “I’l stay outside.” He drops to sit on a bench. “I’ve gotta make some cal s.”\u003c/p\u003e\n\u003cp\u003eHe slumps, staring at the parking lot, and doesn’t take his phone out.\u003c/p\u003e\n\u003cp\u003eMom and I head inside Bryant-Denny, which is so beautiful, even better than on television. The lush green field reminds me of an Irish countryside, and I can even smel the freshly painted yard lines. The giant red scoreboard and the little tunnel leading from the locker room make me giddy. I can’t wait to run out of it. Water coolers are set up on the benches and staffers are carrying bal s and assorted equipment across the field. I indulge in a few daydreams, including one where I run for a touchdown with only ten seconds left in a tie game, and another where I throw for a touchdown from the fifty-yard line. Okay, that would never happen, but it’s a cool dream. I’m knocked out of my fantasies by some guys who jog up to me. Wearing red and white sweats, these guys are even hotter than the ones we saw on the quad. I recognize them from pictures on the team website—three wide receivers and two running backs.\u003c/p\u003e\n\u003cp\u003ebacks.\u003c/p\u003e\n\u003cp\u003eThey al smile at Mom and say, “Hel o, ma’am.” At first, I’m convinced they’re southern gentlemen, but then one of them says, “And you must be Jordan Woods, our new poster girl!”\u003c/p\u003e\n\u003cp\u003eThe other four guys laugh. So that’s how it’s going to be? Not only can I play quarterback, I can play this game too: sarcastic bitchiness. In my heels, I stumble up to the asshole wide receiver who just taunted me and say, “Yup. I’m the new poster girl. But only because you weren’t pretty enough. Wouldn’t want to scare the fans away.”\u003c/p\u003e\n\u003cp\u003e“Oooh,” and “Ouch,” the other guys say, slapping the wide receiver, who bats their arms away.\u003c/p\u003e\n\u003cp\u003e“You’re prettier than I thought you’d be,” says one of the wide receivers. “I’ve changed my mind. I won’t mind you being on the team one bit. I hope we get to be roommates.” He sidles up next to me and wraps an arm around my shoulder. Ugh. Jake Reynolds’s face flashes in my head. I shove the wide receiver away, hard, but immediately regret it because this is not how a lady acts. Hopeful y none of the coaches saw that. The receiver stumbles away, laughing.\u003c/p\u003e\n\u003cp\u003eMr. Tucker is fiddling with his cufflinks, glancing back and forth between me and the Alabama players.\u003c/p\u003e\n\u003cp\u003e“Shouldn’t you al be getting ready for practice?”\u003c/p\u003e\n\u003cp\u003eFrowning, he points toward Coach Thompson, who is inspecting a player’s knee and talking to a trainer at the same time.\u003c/p\u003e\n\u003cp\u003eThe guys al say “Yes, sir” and jog off toward the benches.\u003c/p\u003e\n\u003cp\u003eI’ve been lucky for the past ten years, because everyone in Tennessee just accepted me. What should count is that I’m a great footbal player, a great person. It shouldn’t matter that I’m not a boy. \u003c/p\u003e","sourceLink":"https://allnovel.net/catching-jordan-hundred-oaks-1/page-27.html","bookId":1966,"creation":"Oct 5, 2019 10:17:33 AM","modification":"Oct 5, 2019 10:17:33 AM"}
