{"id":70627,"no":28,"title":"Page 28","content":"\u003cp\u003eBut I guess that’s how everyone sees me. Girl first, footbal player second.\u003c/p\u003e\n\u003cp\u003eJust like Henry said.\u003c/p\u003e\n\u003cp\u003eIt gets worse when the wide receiver who groped my shoulder comes running back over, tossing a bal . He throws it at me so hard that when I catch it, I stumble backward because of these stupid shoes. He laughs at me. Kicking the heels off, I decide I’m not gonna let this asshole embarrass me. He’s standing there, stretching his arms out and smiling, just daring me. So I run back a few steps, but instead of throwing the bal at the wide receiver, I draw my arm back and launch a thirty-fiveyard bomb over the dude’s head. Oh yeah, it goes exactly where I want it to. The bal flies right between two of the other assholes, hitting the water cooler. Ice and water explode al over the rest of the players who made fun of me.\u003c/p\u003e\n\u003cp\u003eThey turn and gawk at me. Even Coach Thompson is staring. It takes every bit of decorum I possess not to slap my hips with my hands and yel , “Suck it!” at these fools.\u003c/p\u003e\n\u003cp\u003eThe wide receiver gapes, then shrugs, saying, “Nice. But you’ve stil got a lot to prove, little girl.”\u003c/p\u003e\n\u003cp\u003eI glare back at him, wishing I had another bal , because I think his helmet needs a good dent in it. Considering I led my team to the state championship game last year, I have proven myself. Girl or not, I’m an awesome footbal player.\u003c/p\u003e\n\u003cp\u003e“Well , Mom, I think we’ve seen enough. Thank you, Mr. Tucker, for your time.” I elbow Mom, who is smiling at the water cooler mess on the other side of the field.\u003c/p\u003e\n\u003cp\u003e“Oh, yes, thank you, Mr. Tucker. I’m glad there’s at least one gentleman at this school,” Mom says.\u003c/p\u003e\n\u003cp\u003eHel , I don’t think I’ve ever seen anyone act more embarrassed than Tucker. His face is red and sweaty and he’s dabbing at his forehead with a handkerchief. Dad’s right. Alabama never wanted me to play in the first place. No wonder Mr. Tucker didn’t care that I fucked up royal y on Friday night.\u003c/p\u003e\n\u003cp\u003eSo now what?\u003c/p\u003e\n\u003cp\u003eSo now what?\u003c/p\u003e\n\u003cp\u003eLater that night, I’m sitting on the dock, writing in my journal while watching the moon shine down on algaecovered Lake Jordan. When I got home, I stripped out of that stupid grey dress and hurled it into the closet, where I found Henry’s blue Converses nestled up against a pair of my cleats. And then I noticed his Super Mario Bros. Tshirt, so I sat down in the closet and cried into Luigi’s face. And then I realized how psycho that was, so I ran out to the lake. (After putting clothes on, of course.) As soon as my back was to the house, I started bawling. I don’t know what’s worse: me screwing up on the field and letting my team down, or knowing that Alabama never wanted me to play in the first place. Now, I keep opening and closing my cel phone. I want to cal Henry so much. But why bother?\u003c/p\u003e\n\u003cp\u003eAnd I can’t cal Ty to tel him about my trip to Alabama. I can’t show weakness in front of him—he’l just question my ability to play, like he did on Friday night.\u003c/p\u003e\n\u003cp\u003eCarter and JJ just aren’t good at talking about this stuff. Besides, I don’t want anyone to know about what happened today. I mean, if Alabama isn’t going to let me play, then why should I keep starting for Hundred Oaks? Might as wel give Ty the chance so he can get a ful ride to col ege.\u003c/p\u003e\n\u003cp\u003eHe does deserve and need it…\u003c/p\u003e\n\u003cp\u003eI write in my journal:\u003c/p\u003e\n\u003cp\u003eEven though Dad’s always been kind of a jerk, at least I had my dreams and my best friend.\u003c/p\u003e\n\u003cp\u003eWell, Henry’s gone, and my dream school wasn’t a dream after all. I have a boyfriend now, but the perfect boyfriend was right in front of me, and I didn’t even notice. It’s like I flew into a black hole, into a void where I don’t know anything.\u003c/p\u003e\n\u003cp\u003e“Jordan?”\u003c/p\u003e\n\u003cp\u003eI look over my shoulder as I snap my journal shut and sit on it. Dad’s standing behind me with his hands in his pockets.\u003c/p\u003e\n\u003cp\u003e“You okay?” he asks.\u003c/p\u003e\n\u003cp\u003e“Please just leave me alone…”\u003c/p\u003e\n\u003cp\u003eDad comes and sits down next to me, pul s his loafers off, and dips his toes in the lake.\u003c/p\u003e\n\u003cp\u003e“You gonna say I told you so?” I mutter.\u003c/p\u003e\n\u003cp\u003e“Course not. Just came out to check on you—you haven’t said two words since we left Alabama. Mom’s worried.” He jerks his head toward the house, so I turn and see Mom staring from the kitchen window, arms folded across her stomach.\u003c/p\u003e\n\u003cp\u003eDad asks, “Why do you want to go to Alabama?”\u003c/p\u003e\n\u003cp\u003eI shake my head at him as I wipe my nose on my sweatshirt sleeve and repeat what I said the other day.\u003c/p\u003e\n\u003cp\u003e“It’s the best footbal school in the country.” Duh. He elbows me in the side. “Hey—what about Ole Miss? I turned out okay, didn’t I?”\u003c/p\u003e\n\u003cp\u003eI let out a tiny laugh.\u003c/p\u003e\n\u003cp\u003eDad swats at a mosquito before saying, “Alabama may have the best record ever, but that doesn’t mean it’s the right school for you.”\u003c/p\u003e\n\u003cp\u003e“And what is the best school for me, Dad? One without a footbal team?”\u003c/p\u003e\n\u003cp\u003eHe blows a bunch of air out and leans back on his hands, staring up at the clear sky. “I don’t know what the best school is for you, but you should explore al your options.”\u003c/p\u003e\n\u003cp\u003eI pul my knees up to my chest and wrap my arms around my legs, thinking how embarrassing it would be to admit to my teammates that I’m not going to Alabama. Maybe if I play harder and better than ever before, they’l have no choice but to let me play.\u003c/p\u003e\n\u003cp\u003e“Alabama’s what’s best for me, Dad.”\u003c/p\u003e\n\u003cp\u003eHe reaches over and rubs my back. “Your mom and I love you no matter what you choose, but I hope you’l seriously think about other col eges.”\u003c/p\u003e\n\u003cp\u003e“Whatever.”\u003c/p\u003e\n\u003cp\u003eDad pauses for awhile. “How about we go fishing together on Saturday? Just you and me?”\u003c/p\u003e\n\u003cp\u003eSo he can try to talk me out of Alabama again? “No thanks.”\u003c/p\u003e\n\u003cp\u003ePain washes over his face as he stares into my eyes and takes his hand off my back. Then he gets up and heads back to the house while I keep staring at the moon and slapping at mosquitoes.\u003c/p\u003e\n\u003cp\u003eWhen I turn to see if Mom’s stil looking at me from the kitchen window, I don’t find her staring at me. But Dad is.\u003c/p\u003e\n\u003cp\u003eMaybe he does care, but I can’t forget how he’s tried to get me to quit for years. This is what Dad’s been waiting for—for me to give up.\u003c/p\u003e\n\u003cp\u003eBut I’m not going to.\u003c/p\u003e\n\u003cp\u003eFROM: Woods, Jordan\u003c/p\u003e\n\u003cp\u003eTO: Tucker, Mark (Athletics, University of Alabama) DATE: Saturday, September 18, 07:32 a.m.\u003c/p\u003e\n\u003cp\u003eSUBJECT: Thank you\u003c/p\u003e\n\u003cp\u003eDear Mr. Tucker:\u003c/p\u003e\n\u003cp\u003eThank you again for inviting me to visit campus last Tuesday. I enjoyed meeting Coach Thompson and the players. While I look forward to helping with recruitment and working with charities that the University of Alabama supports, I’m very excited to play for the football team one day.\u003c/p\u003e\n\u003cp\u003eI’ve enclosed a video from our fourth game. Last night, we beat Cool Springs 42–14. I threw for 300 yards and ran for one touchdown. Please feel free to share my video with the coaching staff.\u003c/p\u003e\n\u003cp\u003eI’m looking forward to visiting campus again and to joining the team next year.\u003c/p\u003e\n\u003cp\u003eSincerely,\u003c/p\u003e\n\u003cp\u003eJordan Woods\u003c/p\u003e\n\u003cp\u003eFROM: Tucker, Mark (Athletics, University of Alabama) TO: Woods, Jordan\u003c/p\u003e\n\u003cp\u003eDATE: Monday, September 20, 09:13 a.m.\u003c/p\u003e\n\u003cp\u003eSUBJECT: RE: Thank you\u003c/p\u003e\n\u003cp\u003eHi Jordan:\u003c/p\u003e\n\u003cp\u003eI hope you enjoyed your tour of campus. It was great to meet you and your family. I’m sorry you couldn’t stay longer. We just received the proofs for next year’s calendar, and we love your photos. We’re most excited you’re joining our community.\u003c/p\u003e\n\u003cp\u003eThe University of Alabama Alumni Charity Ball is on December 4, and we’d appreciate it if you could attend. Several alumnae have expressed a desire to meet you.\u003c/p\u003e\n\u003cp\u003eYours truly,\u003c/p\u003e\n\u003cp\u003eMark Tucker\u003c/p\u003e\n\u003cp\u003ethe count? 21 days since the fight with\u003c/p\u003e\n\u003cp\u003ehenry\u003c/p\u003e\n\u003cp\u003e“For our next project,” says Mr. Majors, the music appreciation teacher, as he paces back and forth across the classroom, “you and your partner wil pick a classical composer. I’d like you to prepare a tenminute oral report, including a biography of the composer’s life and an analysis of how that composer’s work has influenced current music. Also, I’d like you to play a recording of a piece of music written by that composer and tel us what it means to you. So now, please go ahead and choose your partner and your composer.”\u003c/p\u003e\n\u003cp\u003eEven though he hasn’t been speaking to me, I automatical y look at Henry, who’s sitting in the desk right next to mine. He glances at my face, and after frowning his perpetual frown, he turns away. “Yo, Bates,” Henry shouts across the room. “You’re with me.”\u003c/p\u003e\n\u003cp\u003eBates, who was already moving to sit with his usual partner, looks from Henry to me and back at Henry again. Shrugging, Bates says, “Sure, whatever.”\u003c/p\u003e\n\u003cp\u003e“Henry,” I say. “Come on.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “I’m working with Bates on this one.”\u003c/p\u003e\n\u003cp\u003eA bunch of other kids start looking at me and Henry, wide-eyed. The whole class is silent.\u003c/p\u003e\n\u003cp\u003eI pick up my pen and start clicking it repeatedly, hoping the noise wil distract me, because I’m about to smash something. No other footbal players are in this class. Maybe I just won’t do the project—I don’t give a shit about this class anyway.\u003c/p\u003e\n\u003cp\u003eBut if I get a bad grade, the principal could make Coach bench me for a few games until I bring my grades up. And I can’t stand to miss a game—I’ve gotta prove to Alabama that I’m the best high school quarterback in the country, and that when I join their team, they should let me play.\u003c/p\u003e\n\u003cp\u003eAs I put my head down on my desk, I feel a tap on my shoulder. I turn and find Marie, Henry’s recent fling.\u003c/p\u003e\n\u003cp\u003e“Hey,” she says softly. “I need a good grade on this, and since you did great on that disco project, I was hoping we could work together?” She smiles at me.\u003c/p\u003e\n\u003cp\u003e“Um, sure.”\u003c/p\u003e\n\u003cp\u003e“Cool,” she says, sitting down next to me. “I’ve been meaning to tel you I loved your flea-flicker play the other night. You don’t see those very often.”\u003c/p\u003e\n\u003cp\u003eMy mouth drops open. “You know what a flea-flicker is?”\u003c/p\u003e\n\u003cp\u003eMarie shrugs and pul s a nail file from her purse, running it across her fingernails. “Sure. Who doesn’t?”\u003c/p\u003e\n\u003cp\u003eAfter practice, I try to catch Henry before he drives off, but he leaves without saying anything. Leaning up against my truck, I pul out my cel and dial his number, but he doesn’t answer. This must be the hundredth time I’ve tried to cal him in the past two weeks. Why oh why did I accuse him of not being open on the field? And why did I defend Ty? Why didn’t I just let Henry sleep over anyway? How do I fix this? “Sam,” I say to his voice mail, “I hope you’re feeling okay. Can we please talk? I miss you so much.”\u003c/p\u003e\n\u003cp\u003eAs I’m flipping my phone shut, Carter walks up. “You okay?”\u003c/p\u003e\n\u003cp\u003eI nod. “Just worried about Henry.”\u003c/p\u003e\n\u003cp\u003e“Me too,” Carter replies as he shifts his bag from one shoulder to the other.\u003c/p\u003e\n\u003cp\u003eI’m sick of talking to my journal about this shit. “Do you think I should dump Ty? Do you think Henry would go back to normal if I did that?”\u003c/p\u003e\n\u003cp\u003eCarter focuses on his sneakers and clutches the strap on his bag. “I dunno…”\u003c/p\u003e\n\u003cp\u003e“I mean, I like Ty, but it’s not like I’m in love with him or anything.”\u003c/p\u003e\n\u003cp\u003e“Hmm…”\u003c/p\u003e\n\u003cp\u003e“And we’ve been having sex, and I worry that it’s a mista—” \u003c/p\u003e","sourceLink":"https://allnovel.net/catching-jordan-hundred-oaks-1/page-28.html","bookId":1966,"creation":"Oct 5, 2019 10:17:33 AM","modification":"Oct 5, 2019 10:17:33 AM"}
