{"id":70634,"no":35,"title":"Page 35","content":"\u003cp\u003eMike and Dad rol their eyes at Jake, and Henry throws a bedpan at him.\u003c/p\u003e\n\u003cp\u003eThen Ty comes running into the room, carrying roses, his cleats nearly slipping on the slick floor. “Woods! Are you okay?” He hands me the flowers and drags a hand across my hair.\u003c/p\u003e\n\u003cp\u003e“Thank you.” I smel the flowers and whisper, “I’m fine—just a sprain.”\u003c/p\u003e\n\u003cp\u003e“Thank God,” Ty says, leaning toward my lips. As he kisses me in front of everyone, I open my eyes for a quick peek at Henry. His face is blank as he stares out the window. He drops my hand as Ty continues to kiss me and stroke my cheek.\u003c/p\u003e\n\u003cp\u003e“Get a room,” Jake says loudly.\u003c/p\u003e\n\u003cp\u003eI pul away from Ty. “The game?”\u003c/p\u003e\n\u003cp\u003e“We won!”\u003c/p\u003e\n\u003cp\u003eHenry and I shout, “Hel yeah!” and “Awesome!” and\u003c/p\u003e\n\u003cp\u003e“State champions!” and knock fists. “The score?”\u003c/p\u003e\n\u003cp\u003eHenry asks.\u003c/p\u003e\n\u003cp\u003e“14–3,” Ty says, looking only at me. “We never scored again after you left. I was a wreck. I threw an interception.”\u003c/p\u003e\n\u003cp\u003eI smile. “You? When’s the last time you did that?”\u003c/p\u003e\n\u003cp\u003e“Don’t remember.”\u003c/p\u003e\n\u003cp\u003eHenry guffaws. Ty scowls at Henry, then whispers to me, “How are you?”\u003c/p\u003e\n\u003cp\u003e“I’m gonna be fine. Couple weeks of physical therapy and I’l be a brand new quarterback.”\u003c/p\u003e\n\u003cp\u003eTy closes his eyes, nodding. “Jordan, tonight was horrifying for me.”\u003c/p\u003e\n\u003cp\u003e“For you?” I exclaim.\u003c/p\u003e\n\u003cp\u003e“Yeah…I couldn’t handle it if anything serious happened to you,” Ty whispers. “And it’s only going to be worse at the col ege level.”\u003c/p\u003e\n\u003cp\u003e“Ty, I’m not going to quit because I sprained my knee.”\u003c/p\u003e\n\u003cp\u003e“I’m so scared something wil happen to you. You’re, like, one of the only things I have left.”\u003c/p\u003e\n\u003cp\u003ePoor Vanessa. She’l have to live with Ty’s paranoia forever, but at least I have a choice. I won’t do something just because my boyfriend thinks I should. Not anymore. I never should’ve let Ty tel me Henry couldn’t sleep over.\u003c/p\u003e\n\u003cp\u003eMaybe my life needs some physical therapy too.\u003c/p\u003e\n\u003cp\u003eI’m Jordan Woods. I lead a sixty-person footbal team, and I’ve been letting everyone else shape me. I want to be a rock again.\u003c/p\u003e\n\u003cp\u003e“Ty—I’m not going to quit. You’l just have to get over it.”\u003c/p\u003e\n\u003cp\u003e“Tonight was just a sprain. But you could get permanently hurt in col ege.”\u003c/p\u003e\n\u003cp\u003e“You don’t think she knows that, man?” Henry says, taking my hand again.\u003c/p\u003e\n\u003cp\u003eWhen Ty sees our hands together, I think he’s going to get mad, but he gazes over at my dad, who’s standing by the window.\u003c/p\u003e\n\u003cp\u003e“Mr. Woods? You agree with me, right?” Ty says. Dad rocks to his left side, shifts his weight, and coughs. “I might try to discourage my daughter from playing footbal , but I’d never stop her from doing anything she loves. That’s her decision. If I had any say, I never would’ve let her join that Pop Warner team when she was seven.”\u003c/p\u003e\n\u003cp\u003eMom smiles at Dad and rubs his neck. I can’t believe Dad feels this way. It’s true—he never has told me I can’t play footbal . Though I’m scared about my knee, I can’t play footbal . Though I’m scared about my knee, I feel happier than I have in a long time. I mean, it’s not like I have Dad’s total support, but even having his blessing to do what I love is huge.\u003c/p\u003e\n\u003cp\u003eTy’s face goes red. “Fine…whatever you want to do, Woods. I’ve gotta get home to check on Vanessa. I’l cal you later.” He kisses my forehead and leaves. I shut my eyes, and then I feel Henry moving closer to me. He whispers in my ear, “Let me know if you need anything, okay?”\u003c/p\u003e\n\u003cp\u003eDad’s doctor just told me my knee should be fine in a few weeks. Stil , this injury terrifies me. What terrifies me even more?\u003c/p\u003e\n\u003cp\u003eWhat happens next with Henry.\u003c/p\u003e\n\u003cp\u003eKnowing that my knee isn’t royally messed up, I feel like I’ve been given a free play.\u003c/p\u003e\n\u003cp\u003eA chance to make some choices.\u003c/p\u003e\n\u003cp\u003eHenry was right—I let everyone else’s feelings affect my decisions.\u003c/p\u003e\n\u003cp\u003eScrew that.\u003c/p\u003e\n\u003cp\u003eI’m taking the ball and running with it.\u003c/p\u003e\n\u003cp\u003eMaybe they’re not my top choices, but they’re choices that are good for me, choices I can live with.\u003c/p\u003e\n\u003cp\u003eSome things I can’t control; but some things I can. And I’m going to.\u003c/p\u003e\n\u003cp\u003eFirst I go to Dad’s study, the girl-free zone, and use one of my crutches to push the door open.\u003c/p\u003e\n\u003cp\u003e“Dad? You know how you said I should consider al options?”\u003c/p\u003e\n\u003cp\u003e“Yep,” he says, peering up from the sports’ section of the Tennessean.\u003c/p\u003e\n\u003cp\u003e“I was wondering…if maybe you can…maybe you could…help me come up with some other options?”\u003c/p\u003e\n\u003cp\u003eDad sets the newspaper down on his desk, leans back in his chair, and stares up at the ceiling. A smile blooms.\u003c/p\u003e\n\u003cp\u003e“Let me see what I can come up with.”\u003c/p\u003e\n\u003cp\u003e“But I don’t get it,” Ty says, laughing and running a hand across his jaw.\u003c/p\u003e\n\u003cp\u003e“I think you’re great, and I real y love hanging out with you—”\u003c/p\u003e\n\u003cp\u003e“You’re breaking up with me?”\u003c/p\u003e\n\u003cp\u003e“Yes.” I reach out and touch his arm, and he shakes his head.\u003c/p\u003e\n\u003cp\u003e“That doesn’t make any sense. Every girl at Hundred Oaks wants to go out with me…and you’re breaking up with me?”\u003c/p\u003e\n\u003cp\u003e“I’m sorry—”\u003c/p\u003e\n\u003cp\u003e“Is this because of Henry?” he asks, confusion creeping across his face.\u003c/p\u003e\n\u003cp\u003e“No, it’s real y not. You’re great—I just know you’re not the right guy for me. And it’s not fair to either of us.”\u003c/p\u003e\n\u003cp\u003e“Look, I’m sorry I asked you to give up footbal . It was stupid of me.”\u003c/p\u003e\n\u003cp\u003e“No, I get that you’re scared of what might happen to me…to anyone you care about. I understand everything you’ve been through.”\u003c/p\u003e\n\u003cp\u003e“Is this because I’m a better footbal player?”\u003c/p\u003e\n\u003cp\u003e“Jesus, Ty,” I say with a laugh. “Sometimes you just aren’t supposed to be with someone. You can’t control everything, no matter how much you want to.”\u003c/p\u003e\n\u003cp\u003eAnd even if Henry doesn’t want to talk to me, I can stil talk to him.\u003c/p\u003e\n\u003cp\u003eAfter school on Monday, I hobble over to Henry’s rusty maroon truck, being careful to mind my knee, and tuck a note under his windshield wiper.\u003c/p\u003e\n\u003cp\u003eDear Sam—I’m here. Whenever you’re ready. Love, Jordan\u003c/p\u003e\n\u003cp\u003eOne Week Since\u003c/p\u003e\n\u003cp\u003eOn this lame Friday afternoon, I’m lying on my bed, alternating between fiddling with the plastic footbal charm and writing in my journal. I write:\u003c/p\u003e\n\u003cp\u003eNo best friend + no boyfriend \u003d no plans and no life Neither of my parents has mentioned my breakup with Ty except to say they’re stil going to help him get through col ege, and Mom wil keep taking Vanessa on shopping trips because she doesn’t trust Ty or his grandfather with such an important responsibility. Henry? Wel , after I left him the note, several strange gifts started showing up. Like a giant stuffed panda holding a bag of chocolate-chip cookies. I devoured the cookies in about two minutes, but why the hel would he get me a panda?\u003c/p\u003e\n\u003cp\u003eIn retaliation for the stupid panda, I cal ed Marie and Carrie, and together, we dressed the thing up in girly clothes and smeared makeup on it. Then we wrote Henry’s name on its white fur in lipstick and put it out in front of the school. Pretty lame, I know, but it actual y made Henry laugh when he saw it. I spied on him from a window.\u003c/p\u003e\n\u003cp\u003eThen, the other night, Chinese food was delivered with a special fortune cookie. A handwritten fortune taped to the plastic read, “I’m sorry, Woods.” So I tried to cal and thank him, but he didn’t pick his phone up. Of course.\u003c/p\u003e\n\u003cp\u003eIn response, I had a pizza delivered to him with a message that read, “I forgive you. Stop being a bonehead” in olives. Apparently, my message barely fit on an extra large pizza! Man, Henry hates olives. Then yesterday, a deck of cards, a pair of salt and pepper shakers, and a blank journal showed up outside the door to my room. I love the new journal— it’s leather bound and the paper smel s wonderful. And it makes me feel good, that maybe my interest in writing isn’t total y lame, that I can be publicly proud of myself for something other than footbal .\u003c/p\u003e\n\u003cp\u003eBut why can’t the boy just freaking talk to me? Why al the covert shit?\u003c/p\u003e\n\u003cp\u003eMy dad pokes his head in my room. “Can I come in?”\u003c/p\u003e\n\u003cp\u003eI hide my journal under the pil ow and pick up my footbal . “Sure,” I reply, sitting up.\u003c/p\u003e\n\u003cp\u003e“How’s the knee feel?”\u003c/p\u003e\n\u003cp\u003e“Not bad.”\u003c/p\u003e\n\u003cp\u003e“Let me see you extend it,” Dad says, picking up my right foot and pushing and pul ing my leg in and out several times. “Good. You’re healing up nicely.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” I drop my foot back on the bed and start tossing my bal .\u003c/p\u003e\n\u003cp\u003e“What are you doing this weekend?” Dad asks.\u003c/p\u003e\n\u003cp\u003e“No plans.”\u003c/p\u003e\n\u003cp\u003e“How about taking a little trip with me? I don’t have a game on Sunday.”\u003c/p\u003e\n\u003cp\u003e“Where are we going? The beach? God, I could so use some heat and some fresh air.”\u003c/p\u003e\n\u003cp\u003eDad sits on my bed with me. “I was thinking Michigan.”\u003c/p\u003e\n\u003cp\u003e“Michigan?” I say, sticking out my tongue. “It’s colder there than it is here! Why the hel would we go there?”\u003c/p\u003e\n\u003cp\u003e“You wanted other options, right?”\u003c/p\u003e\n\u003cp\u003e“Yeah…”\u003c/p\u003e\n\u003cp\u003e“Look, I know I can’t stop you from playing bal in col ege, but if you’re going to play, I want you to go someplace where you’l be taken care of.”\u003c/p\u003e\n\u003cp\u003e“Like where?”\u003c/p\u003e\n\u003cp\u003eDad takes a deep breath. “Want to take a trip up to Michigan State with me? Their head coach is interested in you. He’s an honest guy—I played against interested in you. He’s an honest guy—I played against him in col ege.”\u003c/p\u003e\n\u003cp\u003eI laugh loudly. When I said options, I meant Florida or Ole Miss or Tennessee, even. “Give up Alabama for Michigan State? Are you freaking kidding me?”\u003c/p\u003e\n\u003cp\u003e“Jordan—if you go to Alabama, I know you’l be doing great things like the charity program with foster kids. There’s no guarantee you’l ever actual y hit the field, but there’s a 100 percent chance they’re going to make you do stuff like model for their calendar.”\u003c/p\u003e\n\u003cp\u003eI nod, clutching my pil ow. “Michigan State would actual y let me play?”\u003c/p\u003e\n\u003cp\u003e“As long as you keep playing like you are now, yes.”\u003c/p\u003e\n\u003cp\u003eDad smiles. “They’ve seen some of your tapes.”\u003c/p\u003e\n\u003cp\u003e“Do you think the guys on the team wil be sexist?”\u003c/p\u003e\n\u003cp\u003eDad laughs. “Probably. But there, at least you’l get to play. And the coach promised me you won’t be paraded around like a piece of meat.”\u003c/p\u003e\n\u003cp\u003e“That’s good to hear.”\u003c/p\u003e\n\u003cp\u003eDad musses my hair. “So, what do you say? Can we at least go talk to the Michigan State coach? Maybe throw a bal around with some of his wide receivers?”\u003c/p\u003e\n\u003cp\u003e“Let’s do it. When do we leave?”\u003c/p\u003e\n\u003cp\u003e“We can leave now. Get your bags packed. Bring some cleats.” Dad stands up and walks out the door, but then pokes his head back in. “By the way, we’re taking Henry with us. He doesn’t know it yet, but we’re going to stop by the University of Michigan too. I told his mom to keep him home until we get there.” Dad grins. \u003c/p\u003e","sourceLink":"https://allnovel.net/catching-jordan-hundred-oaks-1/page-35.html","bookId":1966,"creation":"Oct 5, 2019 10:17:33 AM","modification":"Oct 5, 2019 10:17:33 AM"}
