{"id":7889,"no":16,"title":"CHAPTER XVI JUST TOO LATE","content":"\u0026nbsp;Leaving Abner Holden bound in his cabin, Ralph led Herbert, by a short path, out of the woods. \n\u003cdiv\u003e\n “Your best course,” he said, “will be to take the cars for Columbus at Vernon. At Columbus you will go to Wheeling, and from there, over the Baltimore \u0026amp; Ohio Railroad to Baltimore, and thence to New York. But all this will cost money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have money,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About fifteen dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that all?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it not enough to carry me to New York?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hardly. Besides, when you get there, how will you get along? Have you any relations in the city?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, an uncle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you will go to him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Herbert, hastily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He does not care to see me. Shall I tell you what sort of a letter he wrote to Dr. Kent about me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, tell me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert, in indignant language, which correctly represented his feelings, gave the substance of the letter, which is already known to us.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall not feel easy,” he said, “until I am able to return the ten dollars which my uncle sent me. I am not willing to remain under obligations to one who cares so little for me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think you are proud,” said Ralph, bending his eyes upon the lad\u0027s glowing countenance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I am,” said Herbert; “but is it not a proper pride?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I cannot say no,” answered Ralph; “but would you feel the same about incurring obligations to a friend?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Herbert; “that would be different.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to hear you say so, for I am going to ask you to accept help from me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n To Herbert\u0027s surprise, Ralph drew out a small bag, originally intended for shot, and drew therefrom five golden coins, of five dollars each.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take them,” he said, simply.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert hesitated, while his face indicated extreme surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought—” he commenced, and then paused.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You thought me poor,” said Ralph, finishing the sentence for him. “Is it not so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Most people think so,” said Ralph. “But it was not poverty that drove me from the busy world to this solitude. Rich or poor, I had money enough for my wants. Here I have little use for money. To me it is a useless and valueless thing. You need have no hesitation in taking this. But on second thoughts, I had better give you more.” And he was about to draw forth more.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no,” said Herbert, hastily. “It is quite sufficient. You are very, very kind. Some time I hope to repay you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Ralph. “Do not talk of repayment. Let me have the pleasure of giving you this small sum.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How kind you are,” said Herbert, impulsively, “and to a stranger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yet my obligation to you is greater than yours to me,” said Ralph.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How can that be?” asked the boy, raising his eyes to Ralph\u0027s grave face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are the first human being in whose society I have taken pleasure for years. Deeply injured by man, I conceived a hatred for the whole race. But in your frank face I see much to like. I think I could trust you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope so,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have inspired in me a new feeling, for which I cannot account. Yesterday the world had no attractions for me. To-day I feel an interest in your welfare, at least.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why do you bury yourself in this lonely place?” said Herbert. “You cannot be happy in it. Come with me to New York. It must be a beautiful place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ralph smiled gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To the young the world seems bright,” he said. “It is after years have swept away one illusion after another, after faith in one\u0027s fellowmen has been sorely tried, and the hollowness of the world\u0027s friendship has been proved, that the brightness fades.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have seen more of life than I,” said Herbert, “and perhaps it is presumption in me to question what you say; but I cannot help feeling that you are mistaken. I am sure that there is such a thing as true friendship.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How many true friends are you blessed with?” asked Ralph, a little sarcasm in his tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not many, perhaps, but some. There is good Dr. Kent and his family. I am sure of their friendship. Then,” he added, his color slightly rising, “I think I have found another friend,” and he looked in the face of his guide.\n\u003c/div\u003e \n\u003cdiv\u003e\n The grave face softened.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, my lad,” said Ralph. “You are right there, at least. You can rely upon my friendship being sincere.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I am right, am I not?” said Herbert, smiling brightly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe you are,” said the guide, after a pause, “and I thank you for teaching me a lesson.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Man was made in the image of God,” said Herbert. “If we doubt man, I think it is the same as doubting God.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ralph did not reply, but walked on in thoughtful silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How far is it to Vernon?” asked Herbert, when they had emerged from the woods.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is five miles farther. Can you walk so far?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes; I have good stout legs. But suppose Mr. Holden should escape. He might pursue us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ralph smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I shall find him in the same place when I return,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He will be very angry with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I suppose so,” said Ralph, indifferently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you not afraid he will have you arrested?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I care little. If I am fined, I will pay the fine, and that will be the end of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you might be imprisoned?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I see any danger of that, I shall be tempted to charge Abner Holden with his attempt upon your life. Don\u0027t make yourself anxious about me, my lad. I have little fear of what the law may do as far as my agency in this affair is concerned.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ralph seemed so entirely unconcerned that something of his confidence was imparted to Herbert. Noting the erect mien and fearless glance of his guide, every movement betokening strength, he could not help feeling that Abner Holden would be rash to make such a man his enemy. He felt safe in his protection, and his apprehensions of capture passed away. So with lightened heart he walked the five dusty miles to the village of Vernon, accompanied by Ralph.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a thrifty village, with neat and tasteful dwellings lining the principal street. The railroad and manufactories had built it up rapidly and given it an air of prosperity which was pleasant to see.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We will go at once to the railway station,” said Ralph. “You may catch the next train, and it will be as well to leave this neighborhood as soon as possible.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They were fortunate enough to reach the station fifteen minutes before the eastern train departed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert bought a ticket for Columbus, fifty miles distant, and entered the train.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-by, Herbert,” said Ralph, from the platform.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-by,” said Herbert. “Thank you for all your kindness to me. Shall I not see you again?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not know,” said Ralph, musing. “I have no wish nor intention of going to New York at present, yet I have a feeling that we shall meet again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope it may be so,” said Herbert. “I shall be glad to see you again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n While he spoke the shrill sound of the railway whistle was heard, the train started, and Herbert was fairly off on his journey.\n\u003c/div\u003e \n\u003cdiv\u003e\n Just as he was leaving the depot, a wagon drove hastily up to the station, and Abner Holden jumped out. Herbert saw him as he looked from the window, and for a moment he was apprehensive, but the train was fairly on the way.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stop! stop!” vociferated Abner. “Stop, I say!” for he had also caught sight of his bound boy on the way to freedom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don\u0027t think they will stop the train for you, you fool!” said a man standing by. “You ought to have come sooner if you wanted to go by this train.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t want to go by it,” said Abner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you want, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My boy\u0027s run away, and I have just seen him aboard the train.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, that\u0027s it, is it? Your son?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I hope not. It\u0027s a young rascal that\u0027s bound to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he\u0027s a young rascal, I shouldn\u0027t think you\u0027d want him back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Turning away, for he saw that he had failed, his glance rested on Ralph.\n\u003c/div\u003e \n\u003cdiv\u003e\n Instantly his anger rose.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s your doings,” said he, shaking his fist in impotent wrath at the sturdy hunter, whom he would have attacked had he dared. “It\u0027s your fault, and you shall pay for it if there\u0027s law in the land.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What will the law say to your attempt to shoot the boy?” demanded Ralph, coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Abner turned pale, and realized that his best course was to keep quiet about an affair which might seriously compromise himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3020/83519.html","bookId":261,"creation":"Aug 1, 2019 8:04:28 AM","modification":"Aug 1, 2019 8:04:28 AM"}
