{"id":7893,"no":20,"title":"CHAPTER XX FACING A BURGLAR","content":"\u0026nbsp;Herbert deliberated as to whether it would be best to inform his aged traveling companion of the suspicious-looking man, who appeared to have followed them for no good purpose. He finally decided not to do so, since it would only alarm Mr. Carroll, and prevent his sleeping off his fatigue, while there would be no advantage gained, since a blind and feeble man could be of little use in repelling the burglar, should the stranger prove to be such. \n\u003cdiv\u003e\n The bedroom was large and square, and contained two beds. The larger of these was placed in the corner, and this was assigned to the old gentleman. The smaller was situated between the two side windows, and was, of course, the more exposed of the two. This Herbert was to occupy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know how to load the pistol, Herbert?” asked Mr. Carroll.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said Herbert, confidently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t anticipate any occasion for using it,” continued the old gentleman. “Still, it will be best to be prepared.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I think, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You won\u0027t be afraid to use it, if it should be necessary?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Carroll took a package from his carpet-bag and showed it to Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This package,” he said, “contains five thousand dollars in bank bills. If it were known that I had it, I should be in danger. I suppose it will be best to put it back in the carpet-bag.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If it were mine,” said Herbert, “I would not do that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where, then, would you put it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would put it between the mattresses. If anyone should get into the room, they would seize the carpet-bag first, and, perhaps, make off before they could be stopped.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know but you are right,” said Mr. Carroll. “Perhaps it will be well to put my watch in the same place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir; I think it would be well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You see, Herbert,” continued the old gentleman, “how much confidence I repose in you. Knowing where my watch and money are, it would be very easy for you to secure both, and leave me here, destitute and helpless.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you don\u0027t think there is any danger of my doing so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said the old gentleman. “Though our acquaintance is so recent, I feel great confidence in you. As I cannot see the face, I have learned to judge of the character by the tone of the voice, and I am very much mistaken if you are not thoroughly honest and trustworthy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, sir,” said Herbert, his face flushed with pleasure at this evidently sincere commendation. “You shall not repent your confidence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sure of that, Herbert,” said Mr. Carroll, kindly. “But I must bid you good-night. This has been a fatiguing day, and I shall lose no time in getting to sleep.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-night. I hope you will sleep well, sir,” said Herbert. “There won\u0027t be much sleep for me,” he thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Carroll lay down, and his deep, tranquil breathing soon assured our hero that he was asleep. He rose from his bed and examined the windows. All but one were provided with fastenings. But the one on the right-hand side of his bed could be raised from the outside without difficulty.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I had a nail,” thought Herbert. “I could soon make it fast.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But there was none in the room, and he did not wish to go downstairs for one, since he would probably meet the stranger, who would then learn what precautions he was taking, and so, perhaps, vary his attack.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That window will need watching,” thought Herbert. “I wonder whether I shall be able to keep awake.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The excitement of his situation, and, perhaps, the strong tea, to which he was unaccustomed, helped him to remain vigilant. His mind was active and on the alert, and his ears were open to catch the least sound.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was only half-past ten. Probably the attempt to enter the room would not be made before twelve, at least, in order to insure their being asleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert examined his pistol. It was in excellent order, and was provided with two barrels, both of which he loaded. Thus, he would have a double chance to defend himself. He did not remove all his clothing, but kept on his pants, in order to be prepared for emergencies.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was an hour and a half to wait before midnight. The minutes passed slowly. Herbert for a time heard the murmur of voices in the barroom below, then steps ascended the stairs, and, after a while, all was hushed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish the fellow would come quick,” he thought, “if he is coming at all, so that it might be all over, and I might go to sleep.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Time sped on. Herbert could hear the village clock striking twelve; but still all around remained quiet.\n\u003c/div\u003e \n\u003cdiv\u003e\n It might have been a half an hour later when he heard a slight noise, as he thought, under the window. Jumping softly out of bed, he took a peep out. It was just light enough for him to distinguish a dark form moving about, bearing something, which he soon perceived to be a ladder. That it was the black-whiskered man who had followed them, he did not doubt, and he felt confident that he intended to place the ladder against the window. He was not mistaken. He heard the top of the ladder softly inclined against the house, and then he felt that the critical moment, which was to test his courage, was close at hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert\u0027s heart began to beat rapidly. He felt that he was taking upon himself a fearful responsibility in shooting this man, as he would probably be obliged to do in self-defense. But one thing he resolved upon. He would not take his life. He would only use such a degree of violence as should be absolutely necessary. He would even give him a chance by firing the first barrel in the air, in hope of frightening the robber. If that failed, he must wound him. There was little time for these thoughts to pass through his mind, for all the while the man was creeping up the ladder.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert had moved a little aside, that he might not be seen.\n\u003c/div\u003e \n\u003cdiv\u003e\n Soon he perceived, by the indistinct light, the face of the stranger rising above the window-sill. Next, the window was slowly raised, and he began to make preparations to enter the room. Then Herbert felt that it was time for him to appear.\n\u003c/div\u003e \n\u003cdiv\u003e\n Stepping intrepidly to the window, he said: “I know your purpose. Unless you go down instantly, I will shoot you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no tremor in his voice as he said this. Courage came with the occasion, and his tone was resolute, and self-possessed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you\u0027re awake, are you, my chicken?” was the reply. “If you know what\u0027s best for yourself, you\u0027ll hand over the old man\u0027s money, and save me the trouble of getting in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never!” said Herbert, firmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I will take it myself, and give you something to remember me by, you little fool!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He placed his knee on the window-sill, and prepared to jump in.\n\u003c/div\u003e \n\u003cdiv\u003e\n “One step farther,” said Herbert, resolutely, “and I fire!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He displayed the pistol, at the sight of which the burglar hesitated.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hold on a bit,” said he, pausing. “I\u0027ll give you some of the plunder, if you\u0027ll put up that shooting iron, and make no trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think me a villain, like yourself?” asked Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “By ——, you shall repent this,” said the robber, with an oath, and he made another attempt to enter.\n\u003c/div\u003e \n\u003cdiv\u003e\n Click!\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a sharp report, but Herbert had fired in the air, and the burglar was unhurt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Confusion!” he exclaimed; “that will raise the house!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, espying the carpet-bag, he determined to jump in, seize it, and get away before the people in the house were fairly awake. As for the pistol, that had been discharged, and he supposed that nothing was to be feared from it. But he reckoned without his host. As he put one leg over, and had all but succeeded in getting in, Herbert fired once more, this time hitting him in the shoulder. He uttered a shriek of pain, and, losing his hold, tumbled backward to the ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n The two reports alarmed the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s the matter?” exclaimed Mr. Carroll, awakened and alarmed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t be alarmed, sir,” said Herbert. “A man just attempted to get in through the window, and I have wounded him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are a brave boy,” said Mr. Carroll. “Where is he now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He has tumbled to the ground, shot through the shoulder, I think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a loud thumping at the door. Herbert opened it, and admitted half a dozen guests, headed by the landlord.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s the matter?” exclaimed all, in chorus.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you will come to the window, gentlemen, I will show you,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n They followed him curiously, and the sight of the ladder and the wounded man, who was uttering groans of pain from the ground below, told the story at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Served the rascal right,” said the landlord. “Who is he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The black-whiskered man who was in the barroom last night,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I remember now; he asked particularly where you were to sleep—you and the old gentleman—but I did not suspect his purpose.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did,” said Herbert, “and kept awake to be ready for him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are a brave lad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I only did my duty,” said Herbert, modestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Help! help!” groaned the wretch below.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert heard the cry of pain, and his heart was filled with pity. The man was, indeed, a villain. He had only been served right, as the landlord said. Still, he was a fellow-creature, and he was in pain. Herbert could not regret that he had shot him; but he did regret the necessity, and he felt sympathy for him in his suffering.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Poor fellow!” he said, compassionately; “I am afraid he is a good deal hurt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Poor fellow!” echoed the landlord. “It serves him right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Still, he is in pain, and he ought to be cared for.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He has no claim upon us. He may be there till morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Mr. Carroll. “Herbert is right. He is guilty, but he is in pain, and it is the part of humanity to succor him. Landlord, if you will have him brought in, and send for the doctor, you may look to me for your pay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yet, he was going to rob you, sir,” said the landlord, considerably surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, that is true; but you don\u0027t know how strongly he was tempted.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He looks like a hard ticket. I didn\u0027t like to give him a bed, but we can\u0027t well refuse travelers, if they have money to pay their reckoning. I made him pay in advance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pray, lose no time,” said Herbert, as another groan was heard; “I will go out and help you bring him in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n A lantern was lit, and the whole company followed the landlord out.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said he, throwing the light of the candle full on the sufferer\u0027s face, “you\u0027ve got yourself into a fine pickle, haven\u0027t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh,” groaned the burglar, “if it hadn\u0027t been for that accursed boy!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027d have got off with the old gentleman\u0027s money. Well, it was rather unkind to interfere.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you in much pain?” asked Herbert, bending over him.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was something in his voice that betrayed the compassion he really felt.\n\u003c/div\u003e \n\u003cdiv\u003e\n The burglar looked up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You\u0027re the boy that wounded me, ain\u0027t you?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Curse you! I don\u0027t know but you\u0027ve killed me. I\u0027m shot through the shoulder. Then, that cursed fall! I feel as if I had broken my back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did not want to shoot you,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What did you do it for, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Because you forced me to it. You were after Mr. Carroll\u0027s money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn\u0027t I offer to divide with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but, of course, I would not agree to that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you so much better than common folks?” sneered the burglar.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know about that. I would not steal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take him up,” said the landlord to the hotel servants. “He don\u0027t deserve it, but I\u0027ve promised the old gentleman we\u0027d see to him. Tom White, you may go for the doctor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Two men approached and attempted to lift the wounded burglar. But, in the first attempt, they touched the injured shoulder. He uttered a shriek of pain, and exclaimed, “You\u0027ll murder me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me lift him,” said Herbert. “Perhaps you were too rough.”\n\u003c/div\u003e \n\u003cdiv\u003e\n At length, but not without much groaning on the part of the burglar, he was got into the house, and laid on a bed in a small room on the first floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you feel better?” asked Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A little.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think you have broken any bones in falling?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought so at first, but perhaps I am only bruised.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When the doctor comes, he will extract the bullet, and relieve you of a good deal of your pain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are a strange boy,” said the burglar, with a look of surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why am I?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You shot me, and yet you pretend to be sorry for me now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, why did you shoot me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have already told you. Because I was obliged to. I would not have done it, if there had been any other way. I shot the first barrel in the air.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “By accident?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I thought it would alarm you, and I might save the money without injuring you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you really mean that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you don\u0027t have any ill-will against me now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is strange.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know why it should be.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose I ought to hate you, because you have brought me to this pass,” said the burglar, thoughtfully, “but I don\u0027t. That is strange, too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am so glad you feel so,” said Herbert. “I am very sorry for your pain, and I will do what I can to relieve it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have no money to pay the landlord and the doctor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Carroll says he will pay all needed expenses.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The man I wanted to rob?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then hang me, if I ain\u0027t ashamed of trying to rob him,” said the burglar, earnestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you ever robbed anyone before?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I haven\u0027t. I\u0027m a rough customer, and have done plenty of mean things, but this is the first job of the kind I ever attempted. I wouldn\u0027t have done it, only I heard the old man say in the cars, that he had a lot of money with him. I was hard up, and on my way to Cedarville, to try to get work, but when I heard what he said, the devil tempted me, I believe, and I determined to keep you both in sight, and get out where you did. I\u0027ve tried and failed, and that\u0027s the end of it. It\u0027s my first attempt at burglary.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope it will be the last.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may bet your life on that!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then,” said Herbert, quietly, “I will intercede with Mr. Carroll for you, and ask him not to have you arrested.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you do that?” asked the wounded man, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I promise it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you will, boy, I will bless you, and if God would listen to such a scamp as I am, I\u0027d pray for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He will listen to you,” said Herbert. “Try to lead a better life, and He will help you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I\u0027d met with such as you before,” said the burglar. “I\u0027d have been a better man than I am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Here the doctor entered, and Herbert gave place to him. The wound was discovered not to be serious, and, the bullet being extracted, the sufferer found relief. Herbert returned to bed, and this time, having no anxious thoughts to weigh upon his mind, he soon sank into a refreshing sleep, in which the fatigues and excitements of the day were completely forgotten.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3020/83523.html","bookId":261,"creation":"Aug 1, 2019 8:04:45 AM","modification":"Aug 1, 2019 8:04:45 AM"}
