{"id":7902,"no":29,"title":"CHAPTER XXIX SPARRING","content":"\u0026nbsp;After the concert, Tom Stanton took even a greater dislike to his cousin than before. To say that he was in love with Julia Godfrey would be rather ridiculous, considering his youth. Even if he had been older, Tom cared too much about himself to fall in love with another. But Julia had been a belle among the children of her own age at the dancing school, and there was considerable rivalry among the boys—or, I should, perhaps, say young gentlemen—for the honor of her notice. Tom desired it, because it would give him a kind of distinction among his fellows. So, though he was not in love with Julia, he was jealous when she showed favor to anyone else. But this feeling was mild compared with that he experienced when Julia bestowed her notice upon his penniless cousin. That Herbert should be preferred to himself, he thought, not only showed great lack of taste on the part of the young heiress, but was a grievous wrong to himself. \n\u003cdiv\u003e\n “I can\u0027t understand how girls can be such fools,” thought Tom, as that evening, after returning from the concert, he surveyed his rather perturbed face in the mirror surmounting his bureau. “I wouldn\u0027t have believed Julia Godfrey would stoop to notice such a pauper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then a cheerful thought came to him. Perhaps she was only trying to rouse his jealousy. He had heard of such things. But, if so, why should she choose such a beggar as Herbert to practice her arts upon?\n\u003c/div\u003e \n\u003cdiv\u003e\n Certainly, to an unprejudiced observer, such a thought would never have suggested itself. The cool indifference with which Julia had treated Tom did not appear to argue any such feeling as would lead to the attempt to rouse his jealousy. But, then, Tom was not an unprejudiced observer, and considered his personal attractions such that any girl might appreciate them.\n\u003c/div\u003e \n\u003cdiv\u003e\n When he arrived at the counting-room the next morning, he found Herbert already there. Indeed, our hero was very particular to be punctual in his attendance, while Tom was generally at least a quarter of an hour behind time.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I saw you at the concert last evening, Mason,” said Tom, who wanted to get a chance to say something disagreeable.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I was there,” said Herbert. “You sat in the row just behind us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. I suppose you were never at a concert before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not in New York.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Godfrey was very kind to take you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n That was what Herbert thought himself. But as Tom expressed it, there was something in his tone which implied a conviction of Herbert\u0027s social inferiority, which our hero did not like.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have found Mr. Godfrey very kind,” he said, briefly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There are not many employers who would invite a boy in your position to a concert with his family,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe my position is the same as yours,” said Herbert, nettled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t see it,” said Tom, haughtily. “Will you explain yourself?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe we are both in Mr. Godfrey\u0027s employ,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, so far as that goes. But I am the son of a rich man,” said Tom, pompously.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert might have replied that he was the nephew of a rich man, but he had no disposition to boast of his relationship to his cousin\u0027s family.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t see that that makes any difference,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t you? Well, I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We are both boys in Mr. Godfrey\u0027s employ.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s true, but then, he took you out of pity, you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom\u0027s tone as he said this was very aggravating, and Herbert\u0027s face flushed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know anything of the sort,” he retorted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I suppose you don\u0027t consider it in that light,” said Tom, carelessly; “but, of course, it is clear enough to others. Where would you have been, if Mr. Godfrey hadn\u0027t given you a place? Blacking boots, probably, among the street ragamuffins.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I might,” said Herbert, quietly, “if I couldn\u0027t have got anything better to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s a very genteel occupation,” sneered Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t think it is,” said Herbert, “but it\u0027s an honest one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may have to take it yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps so. So may you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean to insult me?” demanded Tom, haughtily, his face flushing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I only said to you the same thing you said to me. If it\u0027s an insult on one side, it is on the other.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You seem to forget that our circumstances are very different,” said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are just now, so far as money goes. I get a larger salary than you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom was very much incensed at this remark, being aggrieved by the fact that Herbert received more than he.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn\u0027t mean that,” said he. “Of course, if Mr. Godfrey chooses to give away money in charity, it is none of my business. I don\u0027t need any charity.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Godfrey pays me for my services,” said Herbert. “If he pays me too liberally now, I hope to make it up to him afterward.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You seemed to be very intimate with Julia Godfrey last evening,” said Tom, unpleasantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I found her very pleasant.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; she is very kind to take notice of you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose the notice you have taken of me this morning is meant in kindness,” said Herbert, thinking his cousin very disagreeable.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, of course, being in the same counting-room, I think it right to take some notice of you,” said Tom, condescendingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am very much obliged to you,” said Herbert, sarcastically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But there\u0027s one piece of advice I should like to give you,” proceeded Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is that?” inquired Herbert, looking his cousin in the face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t feel too much set up by Julia Godfrey\u0027s notice. She only took notice of you out of pity, and to encourage you. If you had been in her own position in society—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Like you, for instance!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, like me,” said Tom, complacently, “she would have been more ceremonious. I thought I would just mention it to you, Mason, or you might not understand it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was only natural that Herbert should be provoked by this elaborate humiliation suggested by Tom, and his cousin\u0027s offensive assumption of superiority. This led him to a retort in kind.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose that is the reason she took so little notice of you,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom was nettled at this statement of a fact, but he answered in an off-hand manner, “Oh, Julia and I are old friends. I\u0027ve danced with her frequently at dancing school.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert happened to remember what Julia had said of his cousin, and was rather amused at this assumption of intimacy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am much obliged to you for your information,” said Herbert, “though I am rather surprised that you should take so great an interest in my affairs.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you\u0027re new in the city, and I know all the ropes,” said Tom. “I thought I might as well give you a friendly hint.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am lucky in having such a friend,” said Herbert, “and will take the advice as it was given.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Here the bookkeeper entered, and, soon after, Mr. Godfrey made his appearance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope you had a pleasant evening, Herbert,” he said, kindly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very pleasant, sir; thank you,” said Herbert, in a very different tone from the one he had used in addressing Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe I saw you, also, at the concert, Thomas,” said Mr. Godfrey.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” said Tom. “I am very fond of music, and attend all the first-class musical entertainments.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed?” said Mr. Godfrey, but this was all the reply he made.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My daughter insists that I shall invite you to the house again soon,” said Mr. Godfrey, again addressing Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am very much obliged to her, and to you, sir,” said Herbert, modestly. “I shall be very glad to come.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom\u0027s face darkened, as he heard this. He would have given considerable to receive such an invitation himself, but the prospect did not seem very promising.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Godfrey must be infatuated,” he said to himself, impatiently, “to invite such a beggar to his house. Mason ought to have good sense enough to feel that he is out of place in such a house. I wouldn\u0027t accept any invitation given out of pity.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder why Tom dislikes me so much?” thought Herbert. “He certainly takes pains enough to show his feeling. Would it be different, I wonder, if he knew that I was his cousin?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert thought of mentioning to Mr. Godfrey that he had recovered three-quarters of the money of which he had been robbed. It would have been well if he had done so, but Mr. Godfrey seemed particularly engaged, and he thought it best not to interrupt him.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/3020/83532.html","bookId":261,"creation":"Aug 1, 2019 8:05:06 AM","modification":"Aug 1, 2019 8:05:06 AM"}
