{"id":24682,"no":14,"title":"Chapter 13","content":"Several kids laughed.\n\u003cbr\u003e \n\u003cbr\u003e \"No, that\u0027s a brassiere,\" said Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e There was more laughter.\n\u003cbr\u003e \n\u003cbr\u003e Stephen was shocked. \"She said \u0027brassiere\u0027!\" he whispered. \"Right in class!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I know, I heard her!\" said Jason.\n\u003cbr\u003e \n\u003cbr\u003e But Deedee still didn\u0027t trust her, even if she did say \"brassiere\" right out loud.\n\u003cbr\u003e \n\u003cbr\u003e There was a television show that Deedee liked to watch. It was about real criminals. At the end of the show, they always asked the viewers to call the police if they knew where any of the criminals were.\n\u003cbr\u003e \n\u003cbr\u003e Deedee wondered if she had seen Mrs. Drazil on that show.\n\u003cbr\u003e \n\u003cbr\u003e \"Does anybody have any questions they\u0027d like to ask me?\" asked Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e Ron raised his hand.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Drazil pointed to him.\n\u003cbr\u003e \n\u003cbr\u003e \"How old are you?\" asked Ron.\n\u003cbr\u003e \n\u003cbr\u003e Dana gasped. \"You\u0027re not supposed to ask someone that!\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"Especially someone as old as Mrs. Drazil!\" said Mac.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Drazil smiled. \"I don\u0027t mind,\" she said. \"I\u0027m sixty-six years old. You can ask me anything you want.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Anything?\" asked Joy.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m a teacher,\" said Mrs. Drazil. \"That\u0027s what I\u0027m here for.\"\n\u003cbr\u003e \n\u003cbr\u003e Paul raised his hand. \"How much do you weigh?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"One hundred and twenty-four pounds,\" said Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e \"How much money do you make?\" asked Eric Bacon.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m a substitute teacher,\" explained Mrs. Drazil. \"So I only make money on days that I teach. Then I make fifty-one dollars and eighteen cents a day.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What a rip-off!\" said Jenny. \"You should make at least two hundred!\"\n\u003cbr\u003e \n\u003cbr\u003e \"That would be nice,\" said Mrs. Drazil. \"But I\u0027m a teacher because I love to teach. I love to see young children learn.\"\n\u003cbr\u003e \n\u003cbr\u003e Joy raised her hand. \"How many men have you kissed in your whole life?\"\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Drazil thought a moment as she appeared to be counting on her fingers. \"Thirty-one,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e Everyone gasped. Deedee raised her hand. Mrs. Drazil smiled at her. \"Yes, the girl in the pretty flowered T-shirt.\"\n\u003cbr\u003e 74\n\u003cbr\u003e \"Have you ever been in jail?\" asked Deedee.\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" said Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e \"Are the police after you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" said Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e Deedee still didn\u0027t trust her.\n\u003cbr\u003e \n\u003cbr\u003e \"Okay,\" said Mrs. Drazil. \"Before we get started I want to say one more thing. I enjoy teaching so much that sometimes I get a little carried away. I talk too much. So if I start to get boring, will somebody please raise your hand and tell me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"For real?\" asked Todd. \"You want us to tell you to stop talking?\"\n\u003cbr\u003e \n\u003cbr\u003e \"And we won\u0027t get in trouble?\" asked Bebe.\n\u003cbr\u003e \n\u003cbr\u003e \"No, of course not,\" said Mrs. Drazil. \"You\u0027ll be helping me and the rest of your class. You\u0027re not going to learn anything if you\u0027re bored.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Cool!\" said Terrence.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, I suppose when I first started teaching, I used to be a little more strict,\" said Mrs. Drazil. \"I even worried about things like whether my students had clean fingernails or if their shirts were tucked in.\" She laughed, \"But times have changed. I\u0027ve changed. Besides, the kids were a lot worse back then. At least some of them.\"\n\u003cbr\u003e \n\u003cbr\u003e For just a second her sweet face turned sour as she looked at her notebook on her desk.\n\u003cbr\u003e \n\u003cbr\u003e Then she smiled again. \"I believe teaching requires mutual cooperation. I will cooperate with you, and you need to cooperate with me. If we work together, we will have a very enjoyable learning experience.\"\n\u003cbr\u003e \n\u003cbr\u003e Her face turned sour again. \"But if you cross me, you will be very, very sorry.\" She ran her fingers over her blue notebook. \"Oh, maybe not today, maybe not tomorrow, but someday I will get you! You can run, but you can\u0027t hide.\"\n\u003cbr\u003e \n\u003cbr\u003e She smiled. \"Okay, let\u0027s get started.\"\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1990/56932.html","bookId":676,"creation":"Aug 3, 2019 2:24:18 PM","modification":"Aug 11, 2019 1:28:41 PM"}
