{"id":24686,"no":18,"title":"Chapter 17 Why the Children Decided They Had to Get Rid of Mrs. Drazil","content":"1. She was nice.\n\u003cbr\u003e \n\u003cbr\u003e \"I made cookies for everyone this morning,\" Mrs. Drazil announced. Everyone cheered.\n\u003cbr\u003e \n\u003cbr\u003e 2. She thought up ways to make learning interesting.\n\u003cbr\u003e \n\u003cbr\u003e \"I made five dozen cookies,\" she said. \"There are twelve cookies in a dozen. So, who can tell me how many cookies I made?\"\n\u003cbr\u003e \n\u003cbr\u003e Joe waved his arm back and forth. \"I know! I know!\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"Okay, Joe,\" said Mrs. Drazil. \"How many cookies did I make?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Five dozen,\" Joe said proudly.\n\u003cbr\u003e \n\u003cbr\u003e 3. She was patient.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I made five dozen cookies,\" said Mrs. Drazil. \"I told you that. But how many cookies are there?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Five dozen,\" said Joe.\n\u003cbr\u003e \n\u003cbr\u003e \"But how many cookies are in five dozen?\" asked Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e \"Huh?\" asked Joe.\n\u003cbr\u003e \n\u003cbr\u003e \"How much is twelve times five?\" asked Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e \"Uh, just a second,\" said Joe. \"Can I use pencil and paper?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Certainly,\" said Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e Joe took out a piece of paper and a pencil. He wrote the number five on the piece of paper, then tore it into twelve pieces. \"Sixty!\" he said.\n\u003cbr\u003e \n\u003cbr\u003e Nobody quite understood Joe\u0027s mathematical methods.\n\u003cbr\u003e \n\u003cbr\u003e 4. She was fair.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, there are sixty cookies,\" she said. \"And there are twenty-eight children in the class. So, how many cookies should each child get?\"\n\u003cbr\u003e \n\u003cbr\u003e Bebe raised her hand. \"A hundred,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"You can\u0027t have a hundred cookies,\" said Mrs. D. \"I only made sixty.\"\n\u003cbr\u003e 96\n\u003cbr\u003e \"Make some more,\" said Bebe.\n\u003cbr\u003e \n\u003cbr\u003e \"I made sixty,\" said Mrs. Drazil. \"I\u0027m not making any more.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Okay,\" Bebe said with a sigh. \"I\u0027ll take sixty.\"\n\u003cbr\u003e \n\u003cbr\u003e \"We have to divide them evenly,\" said Mrs. Drazil. \"How many cookies should each child get so that every child gets the same amount?\"\n\u003cbr\u003e \n\u003cbr\u003e John raised his hand. \"Everyone can have two cookies,\" he said, \"and there will be four left over.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Can I have them?\" asked Bebe.\n\u003cbr\u003e \n\u003cbr\u003e Allison raised her hand. \"Everyone can have exactly two and one-seventh cookies,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"Very good, Allison,\" said Mrs. Drazil. \"And John, you were right too.\" She gave everyone exactly two and one-seventh cookies.\n\u003cbr\u003e \n\u003cbr\u003e 5. She was a good cook.\n\u003cbr\u003e \n\u003cbr\u003e \"Best cookies I ever had in my whole life!\" said Stephen.\n\u003cbr\u003e \n\u003cbr\u003e Everyone agreed.\n\u003cbr\u003e \n\u003cbr\u003e \"I got the recipe from Miss Mush,\" said Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e \"You did?\" several kids said together.\n\u003cbr\u003e \n\u003cbr\u003e \"I just added a pinch of this and a little of that,\" said Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e 6. She knew what a goozack was.\n\u003cbr\u003e \n\u003cbr\u003e \"Jason, would you please open the door?\" she said.\n\u003cbr\u003e \n\u003cbr\u003e Everyone gasped. \"What\u0027s the matter?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e \"You said the D-word!\" said Dana.\n\u003cbr\u003e \n\u003cbr\u003e \"Door?\" asked Mrs. Drazil. Everyone gasped again. \"You\u0027re supposed to call it a goozack,\" explained Dana.\n\u003cbr\u003e \n\u003cbr\u003e \"Who said so?\" asked Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Kidswatter,\" said Dana.\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Kidswatter is a goozack,\" said Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e Yes, Mrs. Drazil was smart. She was nice. She made learning interesting. She was patient and fair. And she even could make Miss Mush\u0027s cookies taste good.\n\u003cbr\u003e \n\u003cbr\u003e But she made Louis shave off his mustache.\n\u003cbr\u003e \n\u003cbr\u003e And so she had to go.\n\u003cbr\u003e 99\n\u003cbr\u003e They had a plan. It all depended on Sharie.\n\u003cbr\u003e \n\u003cbr\u003e Everyone just hoped she wouldn\u0027t fall asleep first. Sharie often fell asleep in class.\n\u003cbr\u003e \n\u003cbr\u003e C\u0027mon, Sharie, thought Deedee. You can do it.\n\u003cbr\u003e \n\u003cbr\u003e Sharie looked out the window. The sky was full of big, fluffy clouds. She yawned. The clouds looked like giant pillows.\n\u003cbr\u003e \n\u003cbr\u003e Sharie imagined herself wrapped up in one of those clouds, soft and cozy. She pulled her blue-and-red overcoat snugly over her head.\n\u003cbr\u003e \n\u003cbr\u003e Her eyes closed. Then they opened wide. \"Whazzat?!\" she shouted.\n\u003cbr\u003e \n\u003cbr\u003e \"Sharie?\" said Mrs. Drazil.\n\u003cbr\u003e \n\u003cbr\u003e \"Look!\" shouted Sharie, pointing out the window. \"It\u0027s a- Hurry!\" Her long eyelashes stuck straight out.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Drazil hurried to Sharie\u0027s desk. \"What is it?\"\n\u003cbr\u003e \n\u003cbr\u003e \"A spaceship!\" said Sharie. \"From outer space!\"\n\u003cbr\u003e \n\u003cbr\u003e On the other side of the room, Deedee dropped her pencil. She bent down to pick it up, then stayed down.\n\u003cbr\u003e \n\u003cbr\u003e Deedee was part of the plan too. She had a dangerous mission. She had volunteered for it. She felt it was her duty, since she was the one who had brought Louis up to meet Mrs. Drazil in the first place.\n\u003cbr\u003e \n\u003cbr\u003e \"You don\u0027t have to do it,\" Ron had told her. \"Mrs. Drazil would have seen Louis sooner or later.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I\u0027ll do it,\" Deedee had bravely replied.\n\u003cbr\u003e \n\u003cbr\u003e Now she crawled across the floor.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Drazil looked out the window. \"Where?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Wait it went behind a cloud,\" said Sharie.\n\u003cbr\u003e \n\u003cbr\u003e \"What did it look like?\" asked Mrs. Drazil.\n\u003cbr\u003e 100\n\u003cbr\u003e \"Like a giant hamburger,\" said Sharie. \"But there was a zizzle stick hanging down from the bottom!\"\n\u003cbr\u003e \n\u003cbr\u003e Deedee crawled to the teacher\u0027s desk. She reached up and quietly opened the top drawer. She removed the blue notebook.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Drazil stared out the window. \"What\u0027s a zizzle stick?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know,\" Sharie said very mysteriously. \"They don\u0027t have them here on earth.\"\n\u003cbr\u003e \n\u003cbr\u003e Deedee crawled safely back to her seat.\n\u003cbr\u003e \n\u003cbr\u003e At recess everyone crowded around Deedee as she went through the blue notebook.\n\u003cbr\u003e \n\u003cbr\u003e \"Louis once put a frog in Mrs. Drazil\u0027s shoe,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"Why wasn\u0027t her shoe on her foot?\" asked Jenny.\n\u003cbr\u003e \n\u003cbr\u003e \"It doesn\u0027t say,\" said Deedee. \"There\u0027s a whole list of bad things Louis did. And he made it sound like Mrs. Drazil picked on him for no reason!\"\n\u003cbr\u003e \n\u003cbr\u003e \"No wonder she put a trash can on his head!\" said Todd.\n\u003cbr\u003e \n\u003cbr\u003e \"What else did he do?\" asked Eric Bacon, who was always looking for new ideas.\n\u003cbr\u003e \n\u003cbr\u003e But Deedee had already turned the page.\n\u003cbr\u003e \n\u003cbr\u003e \"There are other kids a lot worse than Louis,\" she said, flipping through the pages.\n\u003cbr\u003e \n\u003cbr\u003e \"What are you looking for?\" asked Ron.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know yet,\" said Deedee. \"But I\u0027ll know it when I see it.\"\n\u003cbr\u003e \n\u003cbr\u003e She saw it!\n\u003cbr\u003e \n\u003cbr\u003e It was a note to Mrs. Drazil from a girl named Jane Smith. Deedee read it aloud.\n\u003cbr\u003e \n\u003cbr\u003e Dear Lizard Face,\n\u003cbr\u003e \n\u003cbr\u003e Guess what? I didn\u0027t do my homework again! HA HA HA! And there\u0027s nothing you can do about it because you\u0027re too stupid and ugly! HA HA HA! My family is moving away tomorrow! And you don\u0027t know where! HA HA HA! Rub a monkey\u0027s tummy! By the time you get this letter, I\u0027ll be gone. Rub a monkey\u0027s tummy with your head!\n\u003cbr\u003e \n\u003cbr\u003e Love and Kisses, Jane Smith\n\u003cbr\u003e \n\u003cbr\u003e Everyone was shocked. \"How old is that letter?\" asked Myron. Deedee checked the date, then did the math in her head. \"Jane Smith wrote it twenty-six years\n\u003cbr\u003e \n\u003cbr\u003e ago.\"\n\u003cbr\u003e 102\n\u003cbr\u003e \"And look,\" said Ron, reading over Deedee\u0027s shoulder. \"Jane didn\u0027t do her last twelve homework assignments!\"\n\u003cbr\u003e \n\u003cbr\u003e After recess Sharie saw the UFO again, and Deedee returned the notebook to Mrs. Drazil\u0027s desk.\n\u003cbr\u003e \n\u003cbr\u003e Now all they had to do was find Jane Smith.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1990/56936.html","bookId":676,"creation":"Aug 3, 2019 2:24:18 PM","modification":"Aug 11, 2019 1:28:49 PM"}
