{"id":24670,"no":2,"title":"Chapter 1","content":"Louis used to be the yard teacher at Wayside School. He passed out the balls and played with the kids at recess and lunch.\n\u003cbr\u003e \n\u003cbr\u003e When the school closed, the children were sent to other schools. Horrible schools. No two kids were sent to the same school.\n\u003cbr\u003e \n\u003cbr\u003e Louis was afraid he\u0027d cry if he talked to them.\n\u003cbr\u003e \n\u003cbr\u003e But he worked hard. For two hundred and forty-two days, he pushed and pulled, shoveled and mopped. He never left the building. At night he slept on the couch in the teachers\u0027 lounge on the twelfth floor.\n\u003cbr\u003e \n\u003cbr\u003e Some days it seemed hopeless. The worst part was the smell. He often had to run and stick his head out a window to get a breath of fresh air. But whenever he felt like quitting, he thought about those poor kids, stuck in those horrible schools, and he just worked harder.\n\u003cbr\u003e \n\u003cbr\u003e And at last, two hundred and forty-three days later, the school was ready to open.\n\u003cbr\u003e \n\u003cbr\u003e Well, almost ready. There was one little problem.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly, from somewhere inside the building, or maybe just inside his head, Louis heard a loud \"moo.\"\n\u003cbr\u003e \n\u003cbr\u003e He put his hands over his ears and said, \"I don\u0027t hear it, I don\u0027t hear it, I don\u0027t hear it\" until the mooing stopped.\n\u003cbr\u003e \n\u003cbr\u003e He had scrubbed and polished every inch of Wayside School. There were no cows anywhere. He was sure of it! Still, every once in a while, he heard something go \"moo.\" Or at least he thought he did.\n\u003cbr\u003e \n\u003cbr\u003e He took the sign off the door.\n\u003cbr\u003e \n\u003cbr\u003e But before you enter, you should know something about Wayside School.\n\u003cbr\u003e \n\u003cbr\u003e Wayside School is a thirty-story building with one room on each floor, except there is no nineteenth story.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls teaches the class on the thirtieth story.\n\u003cbr\u003e \n\u003cbr\u003e Miss Zarves teaches the class on the nineteenth story. There is no Miss Zarves.\n\u003cbr\u003e \n\u003cbr\u003e Understand?\n\u003cbr\u003e \n\u003cbr\u003e Good; explain it to me.\n\u003cbr\u003e \n\u003cbr\u003e \"Louis!\" someone shouted.\n\u003cbr\u003e \n\u003cbr\u003e He turned to see a red and blue overcoat\n\u003cbr\u003e 4\n\u003cbr\u003e running toward him. \"Hi, Sharie!\" he said. He couldn\u0027t see her face, but he knew she had to be somewhere inside the coat.\n\u003cbr\u003e \n\u003cbr\u003e Sharie jumped into his arms.\n\u003cbr\u003e \n\u003cbr\u003e \"I bet you\u0027re glad to be back,\" said Louis.\n\u003cbr\u003e \n\u003cbr\u003e \"You bet!\" said Sharie. \"Now I can finally get some sleep!\"\n\u003cbr\u003e \n\u003cbr\u003e All around the playground, old friends were getting back together.\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, old pal!\" said John.\n\u003cbr\u003e \n\u003cbr\u003e \"Hey, good buddy,\" said Joe.\n\u003cbr\u003e \n\u003cbr\u003e \"Bebe!\" yelled Calvin from one side of the playground.\n\u003cbr\u003e \n\u003cbr\u003e \"Calvin!\" shouted Bebe from the other.\n\u003cbr\u003e \n\u003cbr\u003e They ran and smashed into each other.\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Eric, good to see you,\" said Eric.\n\u003cbr\u003e \n\u003cbr\u003e \"Hey, good to see you too,\" said Eric. \"Oh, look. There\u0027s Eric!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Eric! Hi, Eric!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Eric.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Eric.\"\n\u003cbr\u003e \n\u003cbr\u003e Even Kathy said hello to everybody.\n\u003cbr\u003e \n\u003cbr\u003e \"Hey, Big Ears!\" she said to Myron as she slapped him on the back. \"What\u0027s happ\u0027nin\u0027, Smelly?\" she asked Dameon. \"You didn\u0027t take a bath for two hundred and forty-three days, did you? Hi, Allison. Did you get uglier while you were\n\u003cbr\u003e \n\u003cbr\u003e away, or were you always this ugly and I just forgot?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s a nice sweater, Kathy,\" said Allison, who always tried to say something nice.\n\u003cbr\u003e \n\u003cbr\u003e Kathy moved on to Terrence. \"I\u0027m sure glad to see you, Terrence!\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"You are?\" asked Terrence.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" said Kathy. \"I thought you\u0027d be in jail by now.\"\n\u003cbr\u003e \n\u003cbr\u003e Todd came running across the playground.\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Todd!\" shouted Sharie, right in Louis\u0027s ear.\n\u003cbr\u003e \n\u003cbr\u003e Todd kept running.\n\u003cbr\u003e \n\u003cbr\u003e \"Hey, Todd!\" called Jason. \"Good to see you!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Todd!\" called Myron and D. J.\n\u003cbr\u003e \n\u003cbr\u003e But Todd didn\u0027t answer. He just kept running until he reached the school building.\n\u003cbr\u003e \n\u003cbr\u003e Then he kissed Wayside School.\n\u003cbr\u003e \n\u003cbr\u003e Out of all the schools, Todd had been sent to the very worst one. It was awful! The first thing he had to do every morning was-\n\u003cbr\u003e \n\u003cbr\u003e Wait a second. I don\u0027t have to tell you. You already know.\n\u003cbr\u003e \n\u003cbr\u003e Todd was sent to your school.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1990/56920.html","bookId":676,"creation":"Aug 3, 2019 2:24:18 PM","modification":"Aug 3, 2019 2:24:18 PM"}
