{"id":24690,"no":22,"title":"Chapter 21","content":"Miss Nogard entered the classroom on the thirtieth story. She looked at all the bright and chipper faces. She knew by the end of the day they would no longer be bright and chipper.\n\u003cbr\u003e \n\u003cbr\u003e They would be glum and blah.\n\u003cbr\u003e \n\u003cbr\u003e She smiled at the class. \"Good morning, everybody,\" she said. \"My name is Miss Nogard.\"\n\u003cbr\u003e \n\u003cbr\u003e She listened to their brains.\n\u003cbr\u003e \n\u003cbr\u003e Calvin had spilled orange juice on his lap during breakfast and worried that someone might\n\u003cbr\u003e 130\n\u003cbr\u003e think he had gone to the bathroom in his pants.\n\u003cbr\u003e \n\u003cbr\u003e Dana had gotten her hair cut yesterday, and she thought it was too short. She was afraid it made her look like a boy. She was especially sensitive to this because Dana was sometimes a boy\u0027s name.\n\u003cbr\u003e \n\u003cbr\u003e Jason was mad at his older brother, Justin. Justin was in high school. Justin always got good grades and was a star in everything he did. Compared to Justin, Jason felt like a loser. \"What\u0027s so great about high school?\" he had asked this morning. \"My school is higher than yours!\"\n\u003cbr\u003e \n\u003cbr\u003e D. J. had heard a song on the radio on his way to school. He hated the song! But it kept playing over and over again in his head.\n\u003cbr\u003e \n\u003cbr\u003e Bebe had an itch on her leg.\n\u003cbr\u003e \n\u003cbr\u003e Miss Nogard smiled. The bad stuff always rose to the top of the brain.\n\u003cbr\u003e \n\u003cbr\u003e Even if a person was very excited about something wonderful, the person still worried about what could go wrong.\n\u003cbr\u003e \n\u003cbr\u003e Jenny was going horseback riding after school, if it didn\u0027t rain. She had never gone horseback riding before. She hoped she wouldn\u0027t fall off the horse.\n\u003cbr\u003e \n\u003cbr\u003e Miss Nogard clapped her hands. \"So, who would like to tell me what you\u0027ve been working on?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e A few hands went up in the air.\n\u003cbr\u003e \n\u003cbr\u003e \"Oooh! Oooh!\" said Mac.\n\u003cbr\u003e \n\u003cbr\u003e \"How about the boy in the orange and purple shirt?\" said Miss Nogard.\n\u003cbr\u003e \n\u003cbr\u003e Everyone looked around.\n\u003cbr\u003e \n\u003cbr\u003e \"The handsome young man sitting right there,\" said Miss Nogard.\n\u003cbr\u003e \n\u003cbr\u003e Dana looked at her shirt. It was orange and purple. She pointed at herself and mouthed the word me?\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, you,\" said Miss Nogard.\n\u003cbr\u003e \n\u003cbr\u003e Dana\u0027s face turned red-hot. \"I\u0027m a girl,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e Everyone laughed.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, I am so embarrassed!\" said Miss Nogard, with her hand over her heart.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s not your fault,\" said Dana. \"It\u0027s my stupid haircut. I hate it!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, no,\" said Miss Nogard. \"You look adorable. I see now you\u0027re a very pretty girl.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m ugly,\" muttered Dana. She buried her head under her arms.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027d better call on someone else,\" said Miss Nogard.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly, out of nowhere, a brain screamed, Don\u0027t call on me! Whatever you do, please don\u0027t call on me!\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1990/56940.html","bookId":676,"creation":"Aug 3, 2019 2:24:18 PM","modification":"Aug 11, 2019 1:28:55 PM"}
