{"id":24671,"no":3,"title":"Chapter 2","content":"Dameon hurried up the stairs. He couldn\u0027t wait to see Mrs. Jewls, his favorite teacher in the whole world.\n\u003cbr\u003e \n\u003cbr\u003e But the thirtieth floor was a lot higher up than he remembered, even if there was no nineteenth.\n\u003cbr\u003e \n\u003cbr\u003e By the time he got up there, his legs hurt, his side ached, and he had a blister on the back of his ankle where it rubbed against his sneaker.\n\u003cbr\u003e \n\u003cbr\u003e He stumbled into the room and collapsed on the floor. \"Hi, Mrs. Jewls,\" he gasped.\n\u003cbr\u003e \n\u003cbr\u003e \"Hi, Dameon, welcome back!\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e Dameon looked up at her. Something seemed different about her, but he wasn\u0027t sure what it was.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, Dameon, would you do me a favor?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Sure,\" said Dameon.\n\u003cbr\u003e \n\u003cbr\u003e \"I left my pencil in the office,\" said Mrs. Jewls. \"Would you mind going down and getting it for me?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No problem,\" said Dameon.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s yellow,\" said Mrs. Jewls. \"It has a point at one end and a red eraser at the other.\"\n\u003cbr\u003e \n\u003cbr\u003e Dameon got to his feet and headed down the stairs.\n\u003cbr\u003e \n\u003cbr\u003e One by one the other children staggered into the classroom, huffing and puffing. They were all out of shape.\n\u003cbr\u003e \n\u003cbr\u003e Still, they were very excited to be back in Mrs. Jewls\u0027s class. Shouts of joy could be heard from every corner of the room.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls held up two fingers.\n\u003cbr\u003e \n\u003cbr\u003e All the children became quiet. Joy stopped shouting.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls told the children to sit at their old desks. \"So, did anyone learn anything at your other schools?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e Mac raised his hand. \"Oooh! Oooh!\" he grunted.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, Mac,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Civilization!\" declared Mac.\n\u003cbr\u003e \n\u003cbr\u003e \"What about civilization?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"We learned it,\" said Mac.\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s very impressive,\" said Mrs. Jewls. \"Would you like to tell the class something about civilization?\"\n\u003cbr\u003e \n\u003cbr\u003e Mac thought a moment. \"I don\u0027t remember,\" he said. \"But I know we learned it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s good, Mac,\" said Mrs. Jewls. \"Anyone else learn anything?\"\n\u003cbr\u003e \n\u003cbr\u003e Rondi raised her hand. \"Evaporation,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"Good,\" said Mrs. Jewls. \"What is evaporation?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know,\" said Rondi.\n\u003cbr\u003e \n\u003cbr\u003e Dana raised her hand. \"I learned about exaggeration,\" she said. \"It was all my teacher ever talked about. We had like ten thousand tests on it and the teacher would kill you if you didn\u0027t spell it right.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s very good, Dana!\" said Mrs. Jewls. \"You learned your lesson well.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I did?\" asked Dana.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls shrugged. \"Well, I guess we\u0027ll just continue where we left off.\"\n\u003cbr\u003e \n\u003cbr\u003e Just then Mr. Kidswatter\u0027s voice came over the PA. system. \"Good morning, boys and girls.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Kidswatter was the principal. He paused a moment because he thought every kid in school was saying \"Good morning, Mr. Kidswatter\" back to him.\n\u003cbr\u003e \n\u003cbr\u003e Nobody said it\n\u003cbr\u003e \n\u003cbr\u003e Sharie buried her head in her huge coat, closed her eyes, and went to sleep.\n\u003cbr\u003e \n\u003cbr\u003e \"Welcome back to Wayside School!\" said Mr. Kidswatter. \"I know I\u0027m sure glad to be back. It was wonderful to see all your bright and chipper faces this morning. I missed every single one of you.\n\u003cbr\u003e \n\u003cbr\u003e \"And welcome back to Miss Mush, too. Today\u0027s lunch menu will be baked liver in purple sauce. Miss Mush actually cooked this before the school was closed, but she assures me it is still as tasty as ever!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sure it is,\" said Myron.\n\u003cbr\u003e \n\u003cbr\u003e \"A safety reminder. Now, it has been a while since you\u0027ve had to rush up and down the stairs, and I want to make sure there are no accidents. So remember this simple rule. When you go up the stairs, stay to your right. When you go down the stairs, stay to your left. That way, there should be no problems.\n\u003cbr\u003e \n\u003cbr\u003e \"Okay, let\u0027s all have a good day. And remember,\n\u003cbr\u003e 10\n\u003cbr\u003e I\u0027m your friend. And you\u0027re my friends. And if you ever need a friend, you can always come to me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Isn\u0027t that nice,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"What a bunch of baloney! There I was, lying on a beach in Jamaica, when suddenly I get a fax that the dumb school was back open. Well, those kids better not bother me. My friends? That\u0027s a joke! Like I would really want to be friends with those little snot-nose- What? Don\u0027t tell me to shut up! You shut up! What\u0027s on? You mean they\u0027re hearing what I\u0027m saying right this very second? Well, how do you turn it off? What button? I don\u0027t see a red button. There is no red button. Oh, here it\n\u003cbr\u003e 11\n\u003cbr\u003e Mrs. Jewls told everyone to pick a color and write a poem about it\n\u003cbr\u003e \n\u003cbr\u003e \"Huh?\" said Joy.\n\u003cbr\u003e \n\u003cbr\u003e \"For example,\" said Mrs. Jewls, \"if brown was your favorite color, you might write: \u0027At the circus I saw a clown. On his face was a great big frown. His sad eyes were big and brown.\u0027 \"\n\u003cbr\u003e \n\u003cbr\u003e \"Could you repeat that just a little bit slower?\" asked Joy.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls repeated it for her.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1990/56921.html","bookId":676,"creation":"Aug 3, 2019 2:24:18 PM","modification":"Aug 3, 2019 2:24:18 PM"}
