{"id":24672,"no":4,"title":"Chapter 3","content":"\"Ooh, I\u0027m going to do purple!\" said Rondi. Rondi loved anything purple.\n\u003cbr\u003e \n\u003cbr\u003e \"You can\u0027t do purple,\" said Allison. \"I\u0027m doing it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So?\" said Rondi. \"Mrs. Jewls didn\u0027t say two people couldn\u0027t do the same color.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But purple is my favorite color in the world,\" said Allison.\n\u003cbr\u003e \n\u003cbr\u003e Rondi and Allison were best friends, but Allison always got her way.\n\u003cbr\u003e \n\u003cbr\u003e Rondi switched to blue.\n\u003cbr\u003e \n\u003cbr\u003e Joe raised his hand. \"I don\u0027t know what rhymes with red,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls gave him a few suggestions. \"Bed, led, wed. Think of words that end in \u0027e-d.\u0027 \"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, I get it!\" said Joe. He set to work.\n\u003cbr\u003e \n\u003cbr\u003e Rondi tried to think of words that rhymed with blue. She raised her hand. \"Mrs. Jewls!\" she said. \"I chose blue. Can I rhyme that with zoo?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, that would be a good rhyme,\" agreed Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"How about glue?\" asked Rondi.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, that rhymes too,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, I know!\" said Rondi. \"How about stew?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Just pick one and get started,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e Rondi smiled. \"This is fun,\" she told Allison. \"There are lots of words that rhyme with blue.\"\n\u003cbr\u003e \n\u003cbr\u003e Allison grunted.\n\u003cbr\u003e \n\u003cbr\u003e Nothing rhymed with purple. In her mind, Allison had gone through every letter of the alphabet: aurple, burple, curple, durple... all the way to zurple.\n\u003cbr\u003e \n\u003cbr\u003e But after making a big stink over it with Rondi, she couldn\u0027t switch colors now.\n\u003cbr\u003e \n\u003cbr\u003e Rondi was just about to start her poem when she got an even better idea: Love That\u0027s True. \"Poets are always writing about Love That\u0027s True, aren\u0027t they, Mrs. Jewls?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sometimes,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e Rondi smiled. Except she really didn\u0027t know much about true love.\n\u003cbr\u003e \n\u003cbr\u003e \"Morning dew!\" she said. \"Poets write about morning dew too, don\u0027t they, Mrs. Jewls?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I believe so,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e Dana walked to Mrs. Jewls\u0027s desk. \"I can\u0027t think of anything that rhymes with pink,\" she complained.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m sure you\u0027ll think of something,\" said Mrs. Jewls. She winked at her.\n\u003cbr\u003e \n\u003cbr\u003e \"I can\u0027t think,\" said Dana. \"My mind\u0027s on the blink. I\u0027m no good at poetry. I stink!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Just keep trying,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e Dana returned to her seat. She started to put her name on her paper, but her pen wouldn\u0027t write. \"Great!\" she complained. \"Now my pen\u0027s out of ink!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hey, Dana,\" whispered John. \"Do you want to borrow my pen?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Sure,\" said Dana.\n\u003cbr\u003e \n\u003cbr\u003e \"Too bad, I\u0027m using it,\" said John. Then he and Joe cracked up.\n\u003cbr\u003e \n\u003cbr\u003e Meanwhile, Allison was going through the alphabet for the tenth time. . . . Murple, nurple, ourple, qurple, . . . she thought.\n\u003cbr\u003e \n\u003cbr\u003e \"My left shoe!\" exclaimed Rondi.\n\u003cbr\u003e \n\u003cbr\u003e \"You better choose something, Rondi, and get started,\" advised Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"I got it!\" said Rondi. \"A Bird That Flew!\"\n\u003cbr\u003e \n\u003cbr\u003e At the end of the day, the children turned in their poems.\n\u003cbr\u003e \n\u003cbr\u003e Yellow\n\u003cbr\u003e \n\u003cbr\u003e by Kathy\n\u003cbr\u003e \n\u003cbr\u003e I don\u0027t feel too well, oh I don\u0027t know who to tell, oh I\u0027m sick and I smell, oh My barf is yellow\n\u003cbr\u003e \n\u003cbr\u003e Green\n\u003cbr\u003e \n\u003cbr\u003e by Stephen\n\u003cbr\u003e \n\u003cbr\u003e The swimming pool has lots of chlorine. It turned my hair green.\n\u003cbr\u003e \n\u003cbr\u003e Brown\n\u003cbr\u003e \n\u003cbr\u003e by Joy\n\u003cbr\u003e \n\u003cbr\u003e At the circus I saw a clown.\n\u003cbr\u003e \n\u003cbr\u003e On his face was a great big frown.\n\u003cbr\u003e \n\u003cbr\u003e His sad eyes were big and brown.\n\u003cbr\u003e \n\u003cbr\u003e Red\n\u003cbr\u003e \n\u003cbr\u003e by Joe\n\u003cbr\u003e \n\u003cbr\u003e The fire truck is red!\n\u003cbr\u003e \n\u003cbr\u003e It hurried!\n\u003cbr\u003e \n\u003cbr\u003e The siren wailed!\n\u003cbr\u003e \n\u003cbr\u003e The house burned!\n\u003cbr\u003e \n\u003cbr\u003e The firemen saved\n\u003cbr\u003e \n\u003cbr\u003e The baby who screamed.\n\u003cbr\u003e \n\u003cbr\u003e Pink\n\u003cbr\u003e \n\u003cbr\u003e by Dana\n\u003cbr\u003e \n\u003cbr\u003e My favorite color is pink. John is a ratfink!\n\u003cbr\u003e 16\n\u003cbr\u003e Purple\n\u003cbr\u003e \n\u003cbr\u003e by Allison\n\u003cbr\u003e \n\u003cbr\u003e The baby won\u0027t stop crying.\n\u003cbr\u003e \n\u003cbr\u003e His face is turning purple.\n\u003cbr\u003e \n\u003cbr\u003e Will anything make him feel better?\n\u003cbr\u003e \n\u003cbr\u003e I bet a burp\u0027ll.\n\u003cbr\u003e \n\u003cbr\u003e Blue\n\u003cbr\u003e \n\u003cbr\u003e by Rondi\n\u003cbr\u003e \n\u003cbr\u003e That was as far as she got.\n\u003cbr\u003e 17\n\u003cbr\u003e Actuall","sourceLink":"http://novel.tingroom.com/jingdian/1990/56922.html","bookId":676,"creation":"Aug 3, 2019 2:24:18 PM","modification":"Aug 3, 2019 2:24:18 PM"}
