{"id":24674,"no":6,"title":"Chapter 5 A Story with a Disappointing Ending","content":"Paul\u0027s father was a security guard at a museum. The museum had a very famous painting.\n\u003cbr\u003e \n\u003cbr\u003e It was painted by Leonardo da Vinci. It was called the Mona Lisa.\n\u003cbr\u003e \n\u003cbr\u003e Next to the painting was a sign.\n\u003cbr\u003e \n\u003cbr\u003e DO NOT TOUCH!\n\u003cbr\u003e \n\u003cbr\u003e All day Paul\u0027s father made sure nobody touched the painting.\n\u003cbr\u003e \n\u003cbr\u003e At night after the museum closed, Paul\u0027s father was alone. Just him and the Mona Lisa.\n\u003cbr\u003e \n\u003cbr\u003e And the sign. Do not touch! Do not touch! Do not...\n\u003cbr\u003e \n\u003cbr\u003e He was dying to touch it. The tips of his fingers tingled with desire.\n\u003cbr\u003e \n\u003cbr\u003e But this story isn\u0027t about Paul\u0027s father. It\u0027s about Paul.\n\u003cbr\u003e \n\u003cbr\u003e Paul was a student in Mrs. Jewls\u0027s class. He sat behind Leslie.\n\u003cbr\u003e \n\u003cbr\u003e Leslie had two long brown pigtails that reached down to her waist. They just hung there, all day, right in front of Paul\u0027s face.\n\u003cbr\u003e \n\u003cbr\u003e The Mona Leslie.\n\u003cbr\u003e \n\u003cbr\u003e Do not touch! Do not touch! Do not. . .\n\u003cbr\u003e \n\u003cbr\u003e Paul reached out, grabbed, and yanked!\n\u003cbr\u003e \n\u003cbr\u003e \"Yaaaaaaaahhhhhhhh!\" screamed Leslie.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls sent Paul to the counselor\u0027s office.\n\u003cbr\u003e \n\u003cbr\u003e The counselor\u0027s office was on the fourth floor. Paul had never been there before.\n\u003cbr\u003e \n\u003cbr\u003e Like every student in Wayside School, he was afraid of the counselor. The counselor had a very scary face, with big, bushy eyebrows and a little beard on his pointed chin.\n\u003cbr\u003e 24\n\u003cbr\u003e \"Come in,\" said the counselor.\n\u003cbr\u003e \n\u003cbr\u003e Paul entered and sat down on the couch.\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s the problem?\" asked the counselor.\n\u003cbr\u003e \n\u003cbr\u003e \"I pulled Leslie\u0027s pigtails again,\" said Paul. \"I know it\u0027s wrong, but I just can\u0027t help myself.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Watch the pickle,\" said the counselor.\n\u003cbr\u003e \n\u003cbr\u003e Paul\u0027s eyes went back and forth as he stared at the swaying pickle.\n\u003cbr\u003e \n\u003cbr\u003e \"You are getting sleepy,\" said the counselor. \"Your eyelids are getting heavy.\"\n\u003cbr\u003e \n\u003cbr\u003e Paul suddenly felt very tired. He could hardly keep his eyes open.\n\u003cbr\u003e \n\u003cbr\u003e \"When I count to three,\" said the counselor, \"you will fall into a deep, deep sleep. One . . . two . . . three.\"\n\u003cbr\u003e \n\u003cbr\u003e Paul closed his eyes. He wasn\u0027t exactly asleep. He felt like he was living in a dream. But it was a very pleasant dream. He felt happy and safe.\n\u003cbr\u003e \n\u003cbr\u003e \"Can you hear me?\" asked the counselor.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" said Paul. He was no longer afraid of the counselor. In fact he liked him a lot.\n\u003cbr\u003e \n\u003cbr\u003e \"You will do what I say,\" said the counselor.\n\u003cbr\u003e \n\u003cbr\u003e \"I - will - do - what - you - say,\" Paul repeated.\n\u003cbr\u003e \n\u003cbr\u003e \"I am going to count to five,\" said the counselor. \"And then you will wake up. You will return to your classroom. You will take your seat behind Leslie. You will want to pull one of her pigtails. But when you reach for it, it will turn into a rattlesnake.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Leslie\u0027s - pigtails - are - rattlesnakes,\" said Paul.\n\u003cbr\u003e \n\u003cbr\u003e \"Very good,\" said the counselor. \"Now just one more thing.\" He rubbed his beard and smiled.\n\u003cbr\u003e \n\u003cbr\u003e \"When Leslie says the word \u0027pencil,\u0027 her ears will turn into candy. The most delicious candy in the world. The candy of your dreams.\"\n\u003cbr\u003e \n\u003cbr\u003e Paul licked his lips. He could almost taste the rich chocolate and chewy caramel.\n\u003cbr\u003e \n\u003cbr\u003e \"And you will try to eat the candy.\"\n\u003cbr\u003e \n\u003cbr\u003e \"When - Leslie - says - \u0027pencil\u0027 - I - will - eat -her - ears,\" said Paul.\n\u003cbr\u003e \n\u003cbr\u003e The counselor counted to five.\n\u003cbr\u003e \n\u003cbr\u003e Paul\u0027s eyes blinked open.\n\u003cbr\u003e \n\u003cbr\u003e \"You may go back to class now,\" said the counselor.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m not in trouble?\" asked Paul.\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" said the counselor.\n\u003cbr\u003e \n\u003cbr\u003e Paul shrugged. He returned to class. As he passed Leslie, she stuck out her tongue at him.\n\u003cbr\u003e \n\u003cbr\u003e He sat down behind her.\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027d the counselor do to you?\" asked Eric Fry.\n\u003cbr\u003e \n\u003cbr\u003e \"Nothing,\" said Paul. \"He\u0027s a nice man.\"\n\u003cbr\u003e \n\u003cbr\u003e He looked at Leslie\u0027s pigtails. He had pulled\n\u003cbr\u003e 26\n\u003cbr\u003e the one on the left. But he still wanted to pull the one on the right\n\u003cbr\u003e \n\u003cbr\u003e He lunged for it.\n\u003cbr\u003e \n\u003cbr\u003e It hissed at him. Its tail rattled.\n\u003cbr\u003e \n\u003cbr\u003e He screamed and fell back over in his chair.\n\u003cbr\u003e \n\u003cbr\u003e Everyone laughed.\n\u003cbr\u003e \n\u003cbr\u003e \"Paul, are you all right?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Uh, I guess so,\" said Paul, getting back up.\n\u003cbr\u003e \n\u003cbr\u003e He didn\u0027t feel much like pulling Leslie\u0027s pigtails anymore.\n\u003cbr\u003e \n\u003cbr\u003e It was just a short while later that Leslie\u0027s pencil point broke.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, great!\" she complained.\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s the matter?\" asked Jenny, who sat next to Leslie.\n\u003cbr\u003e \n\u003cbr\u003e Leslie showed her the broken pencil point.\n\u003cbr\u003e \n\u003cbr\u003e \"You want to borrow mine?\" asked Eric Fry, who sat behind Jenny.\n\u003cbr\u003e \n\u003cbr\u003e \"No, I\u0027ll just go sharpen it,\" said Leslie. She went to the back of the room and sharpened her pencil.\n\u003cbr\u003e \n\u003cbr\u003e She returned to her seat. She set the pencil on her desk, but it rolled off when she sat down.\n\u003cbr\u003e \n\u003cbr\u003e \"Hey, where\u0027d it go?\" she asked, turning around.\n\u003cbr\u003e \n\u003cbr\u003e \"Where\u0027d what go?\" asked Paul.\n\u003cbr\u003e \n\u003cbr\u003e \"There it is,\" said Jenny. \"Under Paul\u0027s desk.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s under my desk?\" asked Paul.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll get it,\" said Eric Fry. He reached under\n\u003cbr\u003e \n\u003cbr\u003e Paul\u0027s desk, picked up the pencil, and handed it to\n\u003cbr\u003e \n\u003cbr\u003e Leslie.\n\u003cbr\u003e \n\u003cbr\u003e She thanked him and everyone returned to work.\n\u003cbr\u003e 29\n\u003cbr\u003e All the kids in Mrs. Jewls\u0027s class brought a pet to school. The room was very noisy. Dogs barked. Cats meowed. A frog croaked. A pig squealed. A cow mooed. Birds tweeted.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls held up two fingers.\n\u003cbr\u003e \n\u003cbr\u003e All the animals became quiet.\n\u003cbr\u003e \n\u003cbr\u003e Stephen didn\u0027t have a pet. So he brought an orange. He kept it in a cage on his desk so it couldn\u0027t escape.\n\u003cbr\u003e \n\u003cbr\u003e Todd brought Ralphie, his baby brother.\n\u003cbr\u003e \n\u003cbr\u003e \"Todd?\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e Todd barked.\n\u003cbr\u003e \n\u003cbr\u003e \"You cannot have a pet human,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"He doesn\u0027t bite,\" Todd assured her.\n\u003cbr\u003e \n\u003cbr\u003e Joy told Todd to sit and be quiet.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls got a large piece of poster board from the supply closet. \"Let\u0027s make a chart,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e Across the top of her chart she wrote, \"Name of Kid,\" \"Kind of Pet,\" \"Name of Pet.\"\n\u003cbr\u003e \n\u003cbr\u003e She started with Deedee. She wrote \"Deedee\" under \"Name of Kid.\" \"And you have a dog,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"Cat,\" said Deedee.\n\u003cbr\u003e \n\u003cbr\u003e \"Cat?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e Deedee nodded as she petted her dog.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls moved on to Ron. \"Ron, I see you have a cat.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Dog,\" said Ron, as he stroked the cat on his lap.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls shrugged. \"Okay,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"He\u0027s my dog,\" said D. J.\n\u003cbr\u003e \n\u003cbr\u003e \"Ron has your dog?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Ron has a cat,\" said D. J.\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s what I thought,\" said Mrs. Jewls. \"But what-\"\n\u003cbr\u003e 30\n\u003cbr\u003e \"What\u0027s a dog,\" said Jenny.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls covered her ears and shook her head. \"Let\u0027s start all over again,\" said Mrs. Jewls. She got a new piece of poster board from the supply closet.\n\u003cbr\u003e \n\u003cbr\u003e \"Mac, what\u0027s your dog\u0027s name?\"\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s my dog\u0027s name,\" said Jenny.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m not talking to you, Jenny. I\u0027m talking to Mac.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He can\u0027t talk,\" said Mac.\n\u003cbr\u003e \n\u003cbr\u003e \"Who can\u0027t talk?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Mac,\" said Mac.\n\u003cbr\u003e \n\u003cbr\u003e Billy barked at Mac.\n\u003cbr\u003e \n\u003cbr\u003e Mac barked at Billy.\n\u003cbr\u003e \n\u003cbr\u003e Todd barked at both of them.\n\u003cbr\u003e \n\u003cbr\u003e Joy made Todd lie down by her feet.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls moved on. \"What\u0027s your pet, Myron?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Your pet\u0027s a turtle,\" said Sharie.\n\u003cbr\u003e \n\u003cbr\u003e \"What?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"What is Jenny\u0027s pet,\" said Sharie.\n\u003cbr\u003e \n\u003cbr\u003e \"Jenny\u0027s pet is a dog!\" said Mrs. Jewls. \"What\u0027s his name, Jenny?\"\n\u003cbr\u003e \n\u003cbr\u003e Jenny nodded. Her dog sat up straight and tall and seemed to smile at Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"He\u0027s handsome,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"My mouse is handsome,\" said Benjamin.\n\u003cbr\u003e \n\u003cbr\u003e Benjamin had a little white mouse in a cage on his desk.\n\u003cbr\u003e \n\u003cbr\u003e \"If you like mice,\" said Dana, making a face.\n\u003cbr\u003e \n\u003cbr\u003e \"Mrs. Jewls likes mice,\" said Calvin. \"She eats them.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Gross!\" said Dana.\n\u003cbr\u003e \n\u003cbr\u003e \"He won\u0027t come when you call him,\" said Kathy. \"He doesn\u0027t know his name.\"\n\u003cbr\u003e \n\u003cbr\u003e Billy meowed.\n\u003cbr\u003e \n\u003cbr\u003e \"Will Mrs. Jewls eat yogurt?\" asked John.\n\u003cbr\u003e \n\u003cbr\u003e \"No way!\" said Calvin.\n\u003cbr\u003e \n\u003cbr\u003e \"I will too,\" said Mrs. Jewls. \"I like yogurt. I like strawberry best.\"\n\u003cbr\u003e \n\u003cbr\u003e Maurecia beamed. \"Mrs. Jewls likes strawberry best,\" she bragged.\n\u003cbr\u003e \n\u003cbr\u003e \"You shouldn\u0027t pick favorites,\" complained Dana.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you like crackers, Mrs. Jewls?\" asked Rondi.\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t worry,\" said Calvin. \"Mrs. Jewls won\u0027t eat crackers.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How do you know what I\u0027ll eat Calvin?\" asked Mrs. Jewls, a little annoyed. \"I like eating crackers with cheese on top.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, gross!\" said Myron.\n\u003cbr\u003e \n\u003cbr\u003e \"He won\u0027t come when you call him,\" Kathy said again.\n\u003cbr\u003e 32\n\u003cbr\u003e \"Mac! Keep Mac away from my socks!\" shouted Allison.\n\u003cbr\u003e \n\u003cbr\u003e \"Wait,\" said Jason. \"Now you\u0027ve got my socks, and I\u0027ve got your socks/\u0027\n\u003cbr\u003e \n\u003cbr\u003e \"I can tell the difference between my socks and your socks, Jason,\" said Allison.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls covered her ears and shook her head. She moved on. \"What\u0027s your pet, Dameon?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e \"I already told you he was a turtle,\" said Sharie.\n\u003cbr\u003e \n\u003cbr\u003e \"I wasn\u0027t talking to you, Sharie,\" said Mrs. Jewls. \"I was talking to Dameon.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Your nose a ferret,\" said Dameon.\n\u003cbr\u003e \n\u003cbr\u003e \"My nose a ferret?\" asked Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"My nose a hamster,\" said Joe.\n\u003cbr\u003e \n\u003cbr\u003e Billy bleated.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Jewls licked her leg.\n\u003cbr\u003e \n\u003cbr\u003e \"Hey, Paul,\" said Leslie. \"I like your pigtails.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thanks,\" said Paul. \"May I touch your pajamas?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Go ahead,\" said Bebe, who was already petting Leslie\u0027s pajamas. \"She won\u0027t scratch you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"This is crazy!\" shouted Terrence.\n\u003cbr\u003e \n\u003cbr\u003e \"He\u0027s cute,\" said Dana.\n\u003cbr\u003e \n\u003cbr\u003e Name of KidKind of PetName of Pet\n\u003cbr\u003e \n\u003cbr\u003e DeedeeDogCat\n\u003cbr\u003e \n\u003cbr\u003e RonCatDog\n\u003cbr\u003e \n\u003cbr\u003e D.J.DogO.K.\n\u003cbr\u003e \n\u003cbr\u003e JennyDogWhat\n\u003cbr\u003e \n\u003cbr\u003e MacDogMac\n\u003cbr\u003e \n\u003cbr\u003e JoyDogTodd\n\u003cbr\u003e \n\u003cbr\u003e SharieTurtleYorpet\n\u003cbr\u003e \n\u003cbr\u003e BenjaminMouseHandsome\n\u003cbr\u003e \n\u003cbr\u003e CalvinCatMrs. Jewls\n\u003cbr\u003e \n\u003cbr\u003e KathySkunkGross\n\u003cbr\u003e \n\u003cbr\u003e JohnFrogYogurt\n\u003cbr\u003e \n\u003cbr\u003e MaureciaCatStrawberry-\n\u003cbr\u003e \n\u003cbr\u003e RondiBirdCrackers\n\u003cbr\u003e \n\u003cbr\u003e MyronChipmunkCheese\n\u003cbr\u003e \n\u003cbr\u003e AllisonCatSocks\n\u003cbr\u003e \n\u003cbr\u003e JasonCatSocks\n\u003cbr\u003e \n\u003cbr\u003e DameonFerretYorno\n\u003cbr\u003e \n\u003cbr\u003e JoeHamsterMino\n\u003cbr\u003e \n\u003cbr\u003e PaulDogTails\n\u003cbr\u003e \n\u003cbr\u003e LeslieCatPajamas\n\u003cbr\u003e \n\u003cbr\u003e TerrenceDogCrazy\n\u003cbr\u003e \n\u003cbr\u003e Eric FryKid (Goat)Billy\n\u003cbr\u003e \n\u003cbr\u003e Eric BaconDogBilly\n\u003cbr\u003e \n\u003cbr\u003e Eric OvensCatBilly\n\u003cbr\u003e \n\u003cbr\u003e DanaDogPugsy\n\u003cbr\u003e \n\u003cbr\u003e BebeBirdPicasso\n\u003cbr\u003e \n\u003cbr\u003e ToddKid (Human}Ralphie\n\u003cbr\u003e \n\u003cbr\u003e StephenOrangeFido\n\u003cbr\u003e 35\n\u003cbr\u003e Early in the morning, a white limousine drove up to Wayside School.\n\u003cbr\u003e \n\u003cbr\u003e Just like always.\n\u003cbr\u003e \n\u003cbr\u003e The chauffeur got out of the car, then opened the passenger door.\n\u003cbr\u003e \n\u003cbr\u003e Just like always.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Kidswatter stepped out of the car. \"Thank you, James,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"My name is David,\" said the chauffeur.\n\u003cbr\u003e \n\u003cbr\u003e Just like always.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Kidswatter entered the school building.\n\u003cbr\u003e \n\u003cbr\u003e \"Good morning, Mr. Kidswatter,\" said Mrs. Day, the school secretary. She handed him a cup of hot coffee.\n\u003cbr\u003e \n\u003cbr\u003e Just like always.\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, Miss Night,\" said Mr. Kidswatter.\n\u003cbr\u003e \n\u003cbr\u003e He walked into his office.\n\u003cbr\u003e \n\u003cbr\u003e Except his office door was closed.\n\u003cbr\u003e \n\u003cbr\u003e He smashed into it, spilling coffee all over his green suit.\n\u003cbr\u003e \n\u003cbr\u003e \"Who closed my door?\" he demanded.\n\u003cbr\u003e \n\u003cbr\u003e \"Why didn\u0027t you just open it?\" asked Mrs. Day.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s always open in the morning,\" said Mr. Kidswatter. \"How was I supposed to know it was closed this time?\"\n\u003cbr\u003e \n\u003cbr\u003e Up on the thirtieth story, Mrs. Jewls took roll.\n\u003cbr\u003e \n\u003cbr\u003e Todd was absent.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh dear, I hope Todd is all right,\" said Mrs. Jewls.\n\u003cbr\u003e \n\u003cbr\u003e \"Todd\u0027s never all right!\" said Joy.\n\u003cbr\u003e \n\u003cbr\u003e She and Maurecia laughed.\n\u003cbr\u003e \n\u003cbr\u003e Dameon looked at Mrs. Jewls. Ever since he returned to Wayside School, he\u0027d thought there was something different about her, but he still couldn\u0027t figure out what it was.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1990/56924.html","bookId":676,"creation":"Aug 3, 2019 2:24:18 PM","modification":"Aug 3, 2019 2:24:18 PM"}
