{"id":5543,"no":6,"title":"Chapter 6","content":"6:1 [hgb]\u0026nbsp; 我 见 日 光 之 下 有 一 宗 祸 患 ， 重 压 在 人 身 上 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; There is an evil which I have seen under the sun, and it is common among men: \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; There is an evil which I have seen under the sun, and it is hard on men; \n\u003cbr\u003e6:2 [hgb]\u0026nbsp; 就 是 人 蒙 神 赐 他 赀 财 ， 丰 富 ， 尊 荣 ， 以 致 他 心 里 所 愿 的 一 样 都 不 缺 ， 只 是 神 使 他 不 能 吃 用 ， 反 有 外 人 来 吃 用 。 这 是 虚 空 ， 也 是 祸 患 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; A man to whom God hath given riches, wealth, and honour, so that he wanteth nothing for his soul of all that he desireth, yet God giveth him not power to eat thereof, but a stranger eateth it: this is vanity, and it is an evil disease. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; A man to whom God gives money, wealth, and honour so that he has all his desires but God does not give him the power to have joy of it, and a strange man takes it. This is to no purpose and an evil disease. \n\u003cbr\u003e6:3 [hgb]\u0026nbsp; 人 若 生 一 百 个 儿 子 ， 活 许 多 岁 数 ， 以 致 他 的 年 日 甚 多 ， 心 里 却 不 得 满 享 福 乐 ， 又 不 得 埋 葬 。 据 我 说 ， 那 不 到 期 而 落 的 胎 比 他 倒 好 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; If a man beget an hundred children, and live many years, so that the days of his years be many, and his soul be not filled with good, and also that he have no burial; I say, that an untimely birth is better than he. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; If a man has a hundred children, and his life is long so that the days of his years are great in number, but his soul takes no pleasure in good, and he is not honoured at his death; I say that a birth before its time is better than he. \n\u003cbr\u003e6:4 [hgb]\u0026nbsp; 因 为 虚 虚 而 来 ， 暗 暗 而 去 ， 名 字 被 黑 暗 遮 蔽 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For he cometh in with vanity, and departeth in darkness, and his name shall be covered with darkness. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; In wind it came and to the dark it will go, and with the dark will its name be covered. \n\u003cbr\u003e6:5 [hgb]\u0026nbsp; 并 且 没 有 见 过 天 日 ， 也 毫 无 知 觉 。 这 胎 ， 比 那 人 倒 享 安 息 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Moreover he hath not seen the sun, nor known any thing: this hath more rest than the other. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Yes, it saw not the sun, and it had no knowledge; it is better with this than with the other. \n\u003cbr\u003e6:6 [hgb]\u0026nbsp; 那 人 虽 然 活 千 年 ， 再 活 千 年 ， 却 不 享 福 ， 众 人 岂 不 都 归 一 个 地 方 去 吗 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Yea, though he live a thousand years twice told, yet hath he seen no good: do not all go to one place? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And though he goes on living a thousand years twice over and does not see good, are not the two going to the same place? \n\u003cbr\u003e6:7 [hgb]\u0026nbsp; 人 的 劳 碌 都 为 口 腹 ， 心 里 却 不 知 足 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; All the labour of man is for his mouth, and yet the appetite is not filled. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; All the work of man is for his mouth, and still he has a desire for food. \n\u003cbr\u003e6:8 [hgb]\u0026nbsp; 这 样 看 来 ， 智 慧 人 比 愚 昧 人 有 什 么 长 处 呢 ？ 穷 人 在 众 人 面 前 知 道 如 何 行 ， 有 什 么 长 处 呢 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For what hath the wise more than the fool? what hath the poor, that knoweth to walk before the living? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; What have the wise more than the foolish? and what has the poor man by walking wisely before the living? \n\u003cbr\u003e6:9 [hgb]\u0026nbsp; 眼 睛 所 看 的 ， 比 心 里 妄 想 的 倒 好 。 这 也 是 虚 空 ， 也 是 捕 风 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Better is the sight of the eyes than the wandering of the desire: this is also vanity and vexation of spirit. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; What the eyes see is better than the wandering of desire. This is to no purpose and a desire for wind. \n\u003cbr\u003e6:10 [hgb]\u0026nbsp; 先 前 所 有 的 ， 早 已 起 了 名 。 并 知 道 何 为 人 。 他 也 不 能 与 那 比 自 己 力 大 的 相 争 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; That which hath been is named already, and it is known that it is man: neither may he contend with him that is mightier than he. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; That which is, has been named before, and of what man is there is knowledge. He has no power against one stronger than he. \n\u003cbr\u003e6:11 [hgb]\u0026nbsp; 加 增 虚 浮 的 事 既 多 ， 这 与 人 有 什 么 益 处 呢 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Seeing there be many things that increase vanity, what is man the better? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; There are words without number for increasing what is to no purpose, but what is man profited by them? \n\u003cbr\u003e6:12 [hgb]\u0026nbsp; 人 一 生 虚 度 的 日 子 ， 就 如 影 儿 经 过 。 谁 知 道 什 么 与 他 有 益 呢 ？ 谁 能 告 诉 他 身 后 在 日 光 之 下 有 什 么 事 呢 ？\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For who knoweth what is good for man in this life, all the days of his vain life which he spendeth as a shadow? for who can tell a man what shall be after him under the sun? \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Who is able to say what is good for man in life all the days of his foolish life which he goes through like a shade? who will say what is to be after him under the sun?  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/120/1800.html","bookId":181,"creation":"Aug 1, 2019 6:13:34 AM","modification":"Aug 1, 2019 6:13:34 AM"}
