{"id":106722,"no":17,"title":"Page 17","content":"\u003cp\u003eLeo’s heart felt like a combustion chamber going critical, but they made it to the cliff. He slapped his hand against the limestone. Fiery lines burned across the cliff face, slowly forming the outline of a massive door.\u003c/p\u003e\n\u003cp\u003e“Come on! Come on!” Leo urged.\u003c/p\u003e\n\u003cp\u003eHe made the mistake of glancing back. Only a stone’s throw away, the first Maenad appeared out of the woods. Her eyes were pure red. She grinned with a mouth full of fangs, then slashed her talon fingernails at the nearest tree and sliced it in half. Little tornadoes of leaves swirled around her as if even the air were going crazy.\u003c/p\u003e\n\u003cp\u003e“Come, demigod!” she called. “Join me in the revels!”\u003c/p\u003e\n\u003cp\u003eLeo knew it was insane, but her words buzzed in his ears. Part of him wanted to run toward her.\u003c/p\u003e\n\u003cp\u003eWhoa, boy, he told himself. Golden Rule for Demigods: Thou shalt not Hokey Pokey with psychos.\u003c/p\u003e\n\u003cp\u003eStill, he took a step toward the Maenad.\u003c/p\u003e\n\u003cp\u003e“Stop, Leo.” Piper’s charmspeak saved him, freezing him in place. “It’s the madness of Dionysus affecting you. You don’t want to die.”\u003c/p\u003e\n\u003cp\u003eHe took a shaky breath. “Yeah. They’re getting stronger. We’ve got to hurry.”\u003c/p\u003e\n\u003cp\u003eFinally the bunker doors opened. The Maenad snarled. Her friends emerged from the woods, and together they charged.\u003c/p\u003e\n\u003cp\u003e“Turn around!” Piper called to them in her most persuasive voice. “We’re fifty yards behind you!”\u003c/p\u003e\n\u003cp\u003eIt was a ridiculous suggestion, but the charmspeak momentarily worked. The Maenads turned and ran back the way they’d come, then stumbled to a halt, looking confused.\u003c/p\u003e\n\u003cp\u003eLeo and Piper ducked inside the bunker.\u003c/p\u003e\n\u003cp\u003e“Close the door?” Piper asked.\u003c/p\u003e\n\u003cp\u003e“No!” Leo said. “We want them inside.”\u003c/p\u003e\n\u003cp\u003e“We do? What’s the plan?”\u003c/p\u003e\n\u003cp\u003e“Plan.” Leo tried to shake the fogginess from his brain.\u003c/p\u003e\n\u003cp\u003eThey had thirty seconds, tops, before the Maenads poured in.\u003c/p\u003e\n\u003cp\u003eThe Argo II’s engine would explode in—he checked his watch—oh, gods, twelve minutes?\u003c/p\u003e\n\u003cp\u003e“What can I do?” Piper asked. “Come on, Leo.”\u003c/p\u003e\n\u003cp\u003eHis mind began to clear. This was his territory. He couldn’t let the Maenads win.\u003c/p\u003e\n\u003cp\u003eFrom the nearest worktable, Leo snatched a bronze control box with a single red button. He handed it to Piper. “I need two minutes. Climb the catwalks. Distract the Maenads like you did outside, okay? When I shout the order, wherever you are, push that button. But not before I say.”\u003c/p\u003e\n\u003cp\u003e“What does it do?” Piper asked.\u003c/p\u003e\n\u003cp\u003e“Nothing yet. I have to set the trap.”\u003c/p\u003e\n\u003cp\u003e“Two minutes.” Piper nodded grimly. “You got it.”\u003c/p\u003e\n\u003cp\u003eShe ran to the nearest ladder and began to climb while Leo raced off down the aisles, snatching things from tool chests and supply cabinets. He grabbed machine parts and wires. He threw switches and activated time-delay sensors on the bunker’s interior control panels. He didn’t think about what he was doing any more than a pianist thinks about where his fingers are landing on the keyboard. He just flew through the bunker, bringing all the pieces together.\u003c/p\u003e\n\u003cp\u003eHe heard the Maenads rushing into the bunker. For a moment, they stopped in amazement, oohing and ahhing at the vast cavern full of shiny stuff.\u003c/p\u003e\n\u003cp\u003e“Where are you?” Babette called. “My fake lord Dionysus! Party with us!”\u003c/p\u003e\n\u003cp\u003eLeo tried to shut out her voice. Then he heard Piper, somewhere in the catwalks above, call out: “How about we square dance? Turn to the left!”\u003c/p\u003e\n\u003cp\u003eThe Maenads shrieked in confusion.\u003c/p\u003e\n\u003cp\u003e“Grab a partner!” Piper shouted. “Swing her around!”\u003c/p\u003e\n\u003cp\u003eMore cries and shrieking and a few CLANGS as some of the Maenads apparently swung each other into heavy metal objects.\u003c/p\u003e\n\u003cp\u003e“Stop it!” Babette yelled. “Do not grab a partner! Grab that demigod!”\u003c/p\u003e\n\u003cp\u003ePiper shouted a few more commands, but she seemed to be losing her sway.\u003c/p\u003e\n\u003cp\u003eLeo heard feet banging on the rungs of ladders.\u003c/p\u003e\n\u003cp\u003e“Oh, Leo?” Piper yelled. “Has it been two minutes?”\u003c/p\u003e\n\u003cp\u003e“Just a sec!” Leo found the last thing he needed—a quilt-sized stack of shimmering golden fabric. He fed the metallic cloth into the nearest pneumatic tube and pulled the lever. Done—assuming the plan worked.\u003c/p\u003e\n\u003cp\u003eHe ran to the middle of the bunker, right in front of the Argo II, and yelled, “Hey! Here I am!”\u003c/p\u003e\n\u003cp\u003eHe held out his arms and grinned. “Come on! Party with me!”\u003c/p\u003e\n\u003cp\u003eHe glanced at the counter on the ship’s engine. Six and a half minutes left. He wished he hadn’t looked.\u003c/p\u003e\n\u003cp\u003eThe Maenads climbed down from the ladders and began circling him warily. Leo danced and sang random television theme songs, hoping it would make them hesitate. He needed all the Maenads together before he sprung the trap.\u003c/p\u003e\n\u003cp\u003e“Sing along!” he said.\u003c/p\u003e\n\u003cp\u003eThe Maenads snarled. Their blood-red eyes looked angry and annoyed. Their wreaths of snakes hissed. Their thyrsus rods glowed with purple fire.\u003c/p\u003e\n\u003cp\u003eBabette was the last to join the party. When she saw Leo alone, unarmed and dancing, she laughed with delight.\u003c/p\u003e\n\u003cp\u003e“You are wise to accept your fate,” she said. “The real Dionysus would be pleased.”\u003c/p\u003e\n\u003cp\u003e“Yeah, about that,” Leo said. “I think there’s a reason he changed his number. You guys aren’t followers. You’re crazy rabid stalkers. You haven’t found him because he doesn’t want you to.”\u003c/p\u003e\n\u003cp\u003e“Lies!” Babette said. “We are the spirits of the wine god! He is proud of us!”\u003c/p\u003e\n\u003cp\u003e“Sure,” Leo said. “I’ve got some crazy relatives too. I don’t blame Mr. D.”\u003c/p\u003e\n\u003cp\u003e“Kill him!” Babette shrieked.\u003c/p\u003e\n\u003cp\u003e“Wait!” Leo held up his hands. “You can kill me, but you want this to be a real party, don’t you?”\u003c/p\u003e\n\u003cp\u003eAs he’d hoped, the Maenads wavered.\u003c/p\u003e\n\u003cp\u003e“Party?” asked Candy.\u003c/p\u003e\n\u003cp\u003e“Party?” asked Buffy.\u003c/p\u003e\n\u003cp\u003e“Oh, yeah!” Leo looked up and shouted to the catwalks: “Piper? It’s time to crank things up!”\u003c/p\u003e\n\u003cp\u003eFor three incredibly long seconds, nothing happened. Leo just stood there grinning at a dozen frenzied nymphs who wanted to dice him into bite-sized demigod cubes.\u003c/p\u003e\n\u003cp\u003eThen the whole bunker whirred to life. All around the Maenads, pipes rose from the floor and blew purple steam. The pneumatic tube system spit out metal shavings like glittered confetti. The magic banner above them shimmered and changed to read WELCOME, PSYCHO NYMPHS!\u003c/p\u003e\n\u003cp\u003eMusic blared from the sound system—the Rolling Stones, Leo’s mom’s favorite band. He liked to listen to them while he worked, because it reminded him of the good old days when he hung out in his mom’s shop.\u003c/p\u003e\n\u003cp\u003eThen the winch system swung into place, and a mirrored ball began to descend right over Leo’s head.\u003c/p\u003e\n\u003cp\u003eOn the catwalk above, Piper stared down at the chaos she’d wrought with the push of a button, and her jaw dropped. Even the Maenads looked impressed by Leo’s instant party.\u003c/p\u003e\n\u003cp\u003eGiven a few more minutes, Leo could’ve done much better—a laser show, pyrotechnics, maybe some appetizers and a drink machine. But for two minutes’ work, it wasn’t bad. A few Maenads began to square dance. One did the Hokey Pokey.\u003c/p\u003e\n\u003cp\u003eOnly Babette looked unaffected. “What trick is this?” she demanded. “You do not party for Dionysus!”\u003c/p\u003e\n\u003cp\u003e“Oh, no?” Leo glanced up. The mirrored ball was almost within reach. “You haven’t seen my final trick.”\u003c/p\u003e\n\u003cp\u003eThe ball opened up. A grappling hook dropped down, and Leo jumped for it.\u003c/p\u003e\n\u003cp\u003e“Get him!” Babette yelled. “Maenads, attack!”\u003c/p\u003e\n\u003cp\u003eThankfully, she had trouble getting their attention. Piper started calling down square dancing instructions again, confusing them with odd commands. “Turn left, turn right, bonk your heads! Sit down, stand up, fall down dead!”\u003c/p\u003e\n\u003cp\u003eThe pulley lifted Leo into the air as the Maenads swarmed underneath him, gathering in a nice compact cluster. Babette leaped at him. Her claws just missed his feet.\u003c/p\u003e\n\u003cp\u003e“Now!” he muttered to himself, praying that his timer was set accurately.\u003c/p\u003e\n\u003cp\u003eBLAM! The nearest pneumatic tube shot a curtain of golden mesh over the Maenads, covering them like a parachute. A perfect shot.\u003c/p\u003e\n\u003cp\u003eThe Maenads struggled against the net. They tried pushing it off, cutting the ropes with their teeth and fingernails, but as they punched and kicked and struggled, the net simply changed shape, hardening into a cubical cage of glittered gold.\u003c/p\u003e\n\u003cp\u003eLeo grinned. “Piper, hit the button again!”\u003c/p\u003e\n\u003cp\u003eShe did. The music died. The party ended.\u003c/p\u003e\n\u003cp\u003eLeo dropped from the hook onto the top of his newly made cage. He stomped on the roof, just to be sure, but it felt as hard as titanium.\u003c/p\u003e\n\u003cp\u003e“Let us out!” Babette shrieked. “What evil magic is this?”\u003c/p\u003e\n\u003cp\u003eShe slammed against the woven bars, but even her superstrength was no match for the golden material. The other Maenads hissed and screamed and banged on the cage with their thyrsus rods.\u003c/p\u003e\n\u003cp\u003eLeo jumped to the ground. “This is my party now, ladies. That cage is made from Hephaestian netting, a little recipe my dad cooked up. Maybe you’ve heard the story. He caught his wife Aphrodite cheating on him with Ares, so Hephaestus threw a golden net over them and put them on display. They stayed trapped until my dad decided to let them out. That netting right there? That’s made from the same stuff. If two gods couldn’t escape it, you don’t stand a chance.”\u003c/p\u003e\n\u003cp\u003eLeo seriously hoped he was right about that. The furious Maenads raged around their prison, climbing over each other and trying to rip through the mesh with no success.\u003c/p\u003e\n\u003cp\u003ePiper slid down the ladder and joined him. “Leo, you are amazing.”\u003c/p\u003e\n\u003cp\u003e“I know that.” He looked at the digital display next to the ship’s engine. His heart sank. “For about two more minutes. Then I stop being amazing.”\u003c/p\u003e\n\u003cp\u003e“Oh, no.” Piper’s face fell. “We need to get out of here!”\u003c/p\u003e\n\u003cp\u003eSuddenly Leo heard a familiar sound from the bunker entrance: a puff of steam, the creak of gears, and the clink-clank of metal legs running across the floor.\u003c/p\u003e\n\u003cp\u003e“Buford!” Leo called. The automated table chuffed toward him, whirring and clacking its drawers.\u003c/p\u003e\n\u003cp\u003eJason walked in behind him, grinning. “Waiting for us?”\u003c/p\u003e\n\u003cp\u003eLeo hugged the little worktable. “I’m so sorry, Buford. I promise I’ll never take you for granted again. Only Lemon Pledge with extra-moisturizing formula, my friend. Anytime you want it!”\u003c/p\u003e\n\u003cp\u003eBuford puffed steam happily.\u003c/p\u003e\n\u003cp\u003e“Um, Leo?” Piper urged. “The explosion?”\u003c/p\u003e\n\u003cp\u003e“Right!” Leo opened Buford’s front drawer and grabbed the syncopator. He ran to the combustion chamber. Twenty-three seconds. Oh, good. No rush.\u003c/p\u003e\n\u003cp\u003eHe would only get one chance to do this right. Leo carefully fitted the syncopator into place. He closed the combustion chamber and held his breath. The engine started to hum. The glass cylinders glowed with heat. If Leo hadn’t been immune to fire, he was pretty sure he would have gotten a nasty sunburn.\u003c/p\u003e\n\u003cp\u003eThe ship’s hull shuddered. The whole bunker seemed to tremble.\u003c/p\u003e\n\u003cp\u003e“Leo?” Jason asked tightly.\u003c/p\u003e\n\u003cp\u003e“Hold on,” Leo said.\u003c/p\u003e\n\u003cp\u003e“Let us out!” Babette screeched in her golden cage. “If you destroy us, Dionysus will make you suffer!”\u003c/p\u003e\n\u003cp\u003e“He’ll probably send us a thank-you card,” Piper grumbled. “But it won’t matter. We’ll all be dead.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-demigod-diaries/page-17.html","bookId":1545,"creation":"Oct 5, 2019 11:03:01 PM","modification":"Oct 5, 2019 11:03:01 PM"}
