{"id":106709,"no":4,"title":"Page 4","content":"\u003cp\u003e“Can you open it?” I asked.\u003c/p\u003e\n\u003cp\u003eHal shook his head.\u003c/p\u003e\n\u003cp\u003e“Do you know what’s inside?” Thalia asked.\u003c/p\u003e\n\u003cp\u003eAgain, Hal shook his head.\u003c/p\u003e\n\u003cp\u003e“It’s trapped,” I guessed.\u003c/p\u003e\n\u003cp\u003eHal nodded emphatically, then traced a finger across his neck.\u003c/p\u003e\n\u003cp\u003eI knelt next to the safe. I didn’t touch it, but I held my hands close to the combination lock. My fingers tingled with warmth as if the box were a hot oven. I concentrated until I could sense the mechanisms inside. I didn’t like what I found.\u003c/p\u003e\n\u003cp\u003e“This thing is bad news,” I muttered. “Whatever’s inside must be important.”\u003c/p\u003e\n\u003cp\u003eThalia knelt next to me. “Luke, this is why we’re here.” Her voice was full of excitement. “Zeus wanted me to find this.”\u003c/p\u003e\n\u003cp\u003eI looked at her skeptically. I didn’t know how she could have such faith in her dad. Zeus hadn’t treated her any better than Hermes treated me. Besides, a lot of demigods had been led here. All of them were dead.\u003c/p\u003e\n\u003cp\u003eStill, she fixed me with those intense blue eyes, and I knew this was another time Thalia would get her way.\u003c/p\u003e\n\u003cp\u003eI sighed. “You’re going to ask me to open it, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Can you?”\u003c/p\u003e\n\u003cp\u003eI chewed my lip. Maybe next time I teamed up with someone, I should choose someone I didn’t like so much. I just couldn’t say no to Thalia.\u003c/p\u003e\n\u003cp\u003e“People have tried to open this before,” I warned. “There’s a curse on the handle. I’m guessing whoever touches it gets burned to a pile of ashes.”\u003c/p\u003e\n\u003cp\u003eI looked up at Hal. His face turned as gray as his hair. I took that as a confirmation.\u003c/p\u003e\n\u003cp\u003e“Can you bypass the curse?” Thalia asked me.\u003c/p\u003e\n\u003cp\u003e“I think so,” I said. “But it’s the second trap I’m worried about.”\u003c/p\u003e\n\u003cp\u003e“The second trap?” she asked.\u003c/p\u003e\n\u003cp\u003e“Nobody’s managed to trigger the combination,” I said. “I know that because there’s a poison canister ready to break as soon as you hit the third number. It’s never been activated.”\u003c/p\u003e\n\u003cp\u003eJudging from Hal’s wide eyes, this was news to him.\u003c/p\u003e\n\u003cp\u003e“I can try to disable it,” I said, “but if I mess up, this whole apartment is going to fill with gas. We’ll die.”\u003c/p\u003e\n\u003cp\u003eThalia swallowed. “I trust you. Just…don’t mess up.”\u003c/p\u003e\n\u003cp\u003eI turned to the old man. “You could maybe hide in the bathtub. Put some wet towels over your face. It might protect you.”\u003c/p\u003e\n\u003cp\u003eHal shifted uneasily. The snakeskin fabric of his suit rippled as if it were still alive, trying to swallow something unpleasant. Emotions played across his face—fear, doubt, but mostly shame. I guess he couldn’t stand the idea of cowering in a bathtub while two kids risked their lives. Or maybe there was a little demigod spirit left in him after all. He gestured at the safe like: Go ahead.\u003c/p\u003e\n\u003cp\u003eI touched the combination lock. I concentrated so hard I felt like I was dead-lifting five hundred pounds. My pulse quickened. A line of sweat trickled down my nose. Finally I felt gears turning. Metal groaned, tumblers clicked, and the bolts popped back. Carefully avoiding the handle, I pried open the door with my fingertips and extracted an unbroken vial of green liquid.\u003c/p\u003e\n\u003cp\u003eHal exhaled.\u003c/p\u003e\n\u003cp\u003eThalia kissed me on the cheek, which she probably shouldn’t have done while I was holding a tube of deadly poison.\u003c/p\u003e\n\u003cp\u003e“You are so good,” she said.\u003c/p\u003e\n\u003cp\u003eDid that make the risk worth it? Yeah, pretty much.\u003c/p\u003e\n\u003cp\u003eI looked into the safe, and some of my enthusiasm faded. “That’s it?”\u003c/p\u003e\n\u003cp\u003eThalia reached in and pulled out a bracelet.\u003c/p\u003e\n\u003cp\u003eIt didn’t look like much, just a row of polished silver links.\u003c/p\u003e\n\u003cp\u003eThalia latched it around her wrist. Nothing happened.\u003c/p\u003e\n\u003cp\u003eShe scowled. “It should do something. If Zeus sent me here—”\u003c/p\u003e\n\u003cp\u003eHal clapped his hands to get our attention. Suddenly his eyes looked almost as crazy as his hair. He gesticulated wildly, but I had no idea what he was trying to say. Finally he stamped his snakeskin boot in frustration and led us back to the main room.\u003c/p\u003e\n\u003cp\u003eHe sat at his computer and started to type. I glanced at the clock on his desk. Maybe time traveled faster in the house, or maybe time just flies when you’re waiting to die, but it was already past noon. Our day was half over.\u003c/p\u003e\n\u003cp\u003eHal showed us the short novel he’d written: You’re the ones!! You actually got the treasure!! I can’t believe it!! That safe has been sealed since before I was born!! Apollo told me my curse would end when the owner of the treasure claimed it!! If you’re the owner—\u003c/p\u003e\n\u003cp\u003eThere was more, with plenty more exclamation points, but before I could finish reading, Thalia said, “Hold it. I’ve never seen this bracelet. How could I be the owner? And if your curse is supposed to end now, does that mean the monsters are gone?”\u003c/p\u003e\n\u003cp\u003eA clack, clack, clack from the hallway answered that question.\u003c/p\u003e\n\u003cp\u003eI frowned at Hal. “Do you have your voice back?”\u003c/p\u003e\n\u003cp\u003eHe opened his mouth, but no sound came out. His shoulders slumped.\u003c/p\u003e\n\u003cp\u003e“Maybe Apollo meant we’re going to rescue you,” Thalia said.\u003c/p\u003e\n\u003cp\u003eHal typed a new sentence: Or maybe I die today.\u003c/p\u003e\n\u003cp\u003e“Thank you, Mr. Cheerful,” I said. “I thought you could tell the future. You don’t know what will happen?”\u003c/p\u003e\n\u003cp\u003eHal typed: I can’t look. It’s too dangerous. You can see what happened to me last time I tried to use my powers.\u003c/p\u003e\n\u003cp\u003e“Sure,” I grumbled. “Don’t take the risk. You might mess up this nice life you’ve got here.”\u003c/p\u003e\n\u003cp\u003eI knew that was mean. But the old man’s cowardice annoyed me. He’d let the gods use him as a punching bag for too long. It was time he fought back, preferably before Thalia and I became the leucrotae’s next meal.\u003c/p\u003e\n\u003cp\u003eHal lowered his head. His chest was shaking, and I realized he was crying silently.\u003c/p\u003e\n\u003cp\u003eThalia shot me an irritated look. “It’s okay, Hal. We’re not giving up. This bracelet must be the answer. It’s got to have a special power.”\u003c/p\u003e\n\u003cp\u003eHal took a shaky breath. He turned to his keyboard and typed: It’s silver. Even if it turns into a weapon, the monsters can’t be hurt by any metal.\u003c/p\u003e\n\u003cp\u003eThalia turned to me with a silent plea in her eyes, like: Your turn for a helpful idea.\u003c/p\u003e\n\u003cp\u003eI studied the empty enclosure, the metal panel through which the monsters had exited. If the apartment door wouldn’t open again, and the window was covered by man-eating acid drapes, then that panel might be our only exit. We couldn’t use metal weapons. I had a vial of poison, but if I was right about that stuff, it would kill everyone in the room as soon as it dispersed. I ran through another dozen ideas in my head, quickly rejecting them all.\u003c/p\u003e\n\u003cp\u003e“We’ll have to find a different kind of weapon,” I decided. “Hal, let me borrow your computer.”\u003c/p\u003e\n\u003cp\u003eHal looked doubtful, but he gave me his seat.\u003c/p\u003e\n\u003cp\u003eI stared at the screen. Honestly, I’d never used computers much. Like I said, technology attracts monsters. But Hermes was the god of communication, roadways, and commerce. Maybe that meant he had some power over the Internet. I could really use a divine Google hit right about now.\u003c/p\u003e\n\u003cp\u003e“Just once,” I muttered to the screen, “cut me some slack. Show me there’s an upside to being your son.”\u003c/p\u003e\n\u003cp\u003e“What, Luke?” Thalia asked.\u003c/p\u003e\n\u003cp\u003e“Nothing,” I said.\u003c/p\u003e\n\u003cp\u003eI opened the Web browser and started typing. I looked up leucrotae, hoping to find their weaknesses. The Internet had almost nothing on them, except that they were legendary animals that lured their prey by imitating human voices.\u003c/p\u003e\n\u003cp\u003eI searched for “Greek weapons.” I found some great images of swords, spears, and catapults, but I doubted we could kill monsters with low-resolution JPEGs. I typed in a list of things we had in the room—torches, Celestial bronze, poison, Snickers bars, golf club—hoping that some sort of magic formula would pop up for a leucrota death ray. No such luck. I typed in “Help me kill leucrotae.” The closest hit I got was Help me cure leukemia.\u003c/p\u003e\n\u003cp\u003eMy head was throbbing. I didn’t have any concept of how long I’d been searching until I looked at the clock: four in the afternoon. How was that possible?\u003c/p\u003e\n\u003cp\u003eMeanwhile, Thalia had been trying to activate her new bracelet, with no luck. She’d twisted it, tapped it, shaken it, worn it on her ankle, thrown it against the wall, and swung it over her head yelling “Zeus!” Nothing happened.\u003c/p\u003e\n\u003cp\u003eWe looked at each other, and I knew we were both out of ideas. I thought about what Hal Green had told us. All demigods started off hopeful. All of them had ideas for escape. All of them failed.\u003c/p\u003e\n\u003cp\u003eI couldn’t let that happen. Thalia and I had survived too much to give up now. But for the life of me (and I mean that literally) I couldn’t think of anything else to try.\u003c/p\u003e\n\u003cp\u003eHal walked over and gestured at the keyboard.\u003c/p\u003e\n\u003cp\u003e“Go ahead,” I said dejectedly.\u003c/p\u003e\n\u003cp\u003eWe changed places.\u003c/p\u003e\n\u003cp\u003eRunning out of time, he typed. I’ll try to read the future.\u003c/p\u003e\n\u003cp\u003eThalia frowned. “I thought you said that was too dangerous.”\u003c/p\u003e\n\u003cp\u003eIt doesn’t matter, Hal typed. Luke is right. I’m a cowardly old man, but Apollo can’t punish me any worse than he already has. Perhaps I’ll see something that will help you. Thalia, give me your hands.\u003c/p\u003e\n\u003cp\u003eHe turned to her.\u003c/p\u003e\n\u003cp\u003eThalia hesitated.\u003c/p\u003e\n\u003cp\u003eOutside the apartment, the leucrotae growled and scraped against the corridor. They sounded hungry.\u003c/p\u003e\n\u003cp\u003eThalia placed her hands in Halcyon Green’s. The old man closed his eyes and concentrated, the same way I do when I’m reading a complicated lock.\u003c/p\u003e\n\u003cp\u003eHe winced, then took a shaky breath. He looked up at Thalia with an expression of sympathy. He turned to the keyboard and hesitated a long time before starting to type.\u003c/p\u003e\n\u003cp\u003eYou are destined to survive today, Hal typed.\u003c/p\u003e\n\u003cp\u003e“That’s—that’s good, right?” she asked. “Why do you look so sad?”\u003c/p\u003e\n\u003cp\u003eHal stared at the blinking cursor. He typed, Someday soon, you will sacrifice yourself to save your friends. I see things that are…hard to describe. Years of solitude. You will stand tall and still, alive but sleeping. You will change once, and then change again. Your path will be sad and lonely. But someday you will find your family again.\u003c/p\u003e\n\u003cp\u003eThalia clenched her fists. She started to speak, then paced the room. Finally she slammed her palm against the bookshelves. “That doesn’t make any sense. I’ll sacrifice myself, but I’ll live. Changing, sleeping? You call that a future? I—I don’t even have a family. Just my mom, and there’s no way I’m going back to her.”\u003c/p\u003e\n\u003cp\u003eHal pursed his lips. He typed, I’m sorry. I don’t control what I see. But I didn’t mean your mother.\u003c/p\u003e\n\u003cp\u003eThalia almost backed up into the drapes. She caught herself just in time, but she looked dizzy, as if she’d just stepped off a roller coaster.\u003c/p\u003e\n\u003cp\u003e“Thalia?” I asked, as gently as I could. “Do you know what he’s talking about?”\u003c/p\u003e\n\u003cp\u003eShe gave me a cornered look. I didn’t understand why she seemed so rattled. I knew she didn’t like to talk about her life back in L.A., but she’d told me she was an only child, and she’d never mentioned any relatives beside her mom.\u003c/p\u003e\n\u003cp\u003e“It’s nothing,” she said at last. “Forget it. Hal’s fortune-telling skills are rusty.”\u003c/p\u003e\n\u003cp\u003eI’m pretty sure not even Thalia believed that.\u003c/p\u003e\n\u003cp\u003e“Hal,” I said, “there’s got to be more. You told us that Thalia will survive. How? Did you see anything about the bracelet? Or the goat? We need something that will help.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-demigod-diaries/page-4.html","bookId":1545,"creation":"Oct 5, 2019 11:03:01 PM","modification":"Oct 5, 2019 11:03:01 PM"}
