{"id":99190,"no":13,"title":"Page 13","content":"\u003cp\u003eThe military mentality is a bandit and raider mentality.\u0026nbsp;\u0026nbsp;Thus, all military represents a form of organized banditry where the conventional mores do not prevail.\u0026nbsp;\u0026nbsp;The military is a way of rationalizing murder, rape, looting, and other forms of theft which are always accepted as part of warfare.\u0026nbsp;\u0026nbsp;When denied an outside target, the military mentality always turns against its own civilian population, using identical rationalizations for bandit behavior.\u003c/p\u003e\n\u003cp\u003e- BuSab Manual, Chapter Five: \"The Warlord Syndrome\"\u003c/p\u003e\n\u003cp\u003eMcKie, awakening from the communications trance, realized how he must\u0027ve appeared to this strange Gowachin towering over him.\u0026nbsp;\u0026nbsp;Of course a Dosadi Gowachin would think him ill.\u0026nbsp;\u0026nbsp;He\u0027d been shivering and mumbling in the trance, perspiration rolling from him.\u0026nbsp;\u0026nbsp;McKie took a deep breath.\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m not ill.\"\u003c/p\u003e\n\u003cp\u003e\"Then it\u0027s an addiction?\"\u003c/p\u003e\n\u003cp\u003eRecalling the many substances to which the Dosadi could be addicted, McKie almost used this excuse but thought better of it.\u0026nbsp;\u0026nbsp;This Gowachin might demand some of the addictive substance.\u003c/p\u003e\n\u003cp\u003e\"Not an addiction,\" McKie said.\u0026nbsp;\u0026nbsp;He lifted himself to his feet, glanced around.\u0026nbsp;\u0026nbsp;The sun had moved perceptibly toward the horizon behind its streaming veil.\u003c/p\u003e\n\u003cp\u003eAnd something new had been added to the landscape - that gigantic tracked vehicle, which stood throbbing and puffing smoke from a vertical stack behind the Gowachin intruder.\u0026nbsp;\u0026nbsp;The Gowachin maintained a steady, intense concentration on McKie, disconcerting in its unwavering directness.\u0026nbsp;\u0026nbsp;McKie had to ask himself:\u0026nbsp;\u0026nbsp;was this some threat, or his Dosadi contact?\u0026nbsp;\u0026nbsp;Aritch\u0027s people had said a vehicle would be sent to the contact point, but . . .\u003c/p\u003e\n\u003cp\u003e\"Not ill, not an addiction,\" the Gowachin said. \"Is it some strange condition which only Humans have?\"\u003c/p\u003e\n\u003cp\u003e\"I was ill,\" McKie said.\u0026nbsp;\u0026nbsp;\"But I\u0027m recovered.\u0026nbsp;\u0026nbsp;The condition has passed.\"\u003c/p\u003e\n\u003cp\u003e\"Do you often have such attacks?\"\u003c/p\u003e\n\u003cp\u003e\"I can go years without a recurrence.\"\u003c/p\u003e\n\u003cp\u003e\"Years?\u0026nbsp;\u0026nbsp;What causes this . . . condition?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"I . . . ahhhh.\"\u0026nbsp;\u0026nbsp;The Gowachin nodded, gestured upward with his chin.\u0026nbsp;\u0026nbsp;\"An affliction of the Gods, perhaps.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps.\"\u003c/p\u003e\n\u003cp\u003e\"You were completely vulnerable.\"\u003c/p\u003e\n\u003cp\u003eMcKie shrugged.\u0026nbsp;\u0026nbsp;Let the Gowachin make of that what he could.\u003c/p\u003e\n\u003cp\u003e\"You were not vulnerable?\"\u0026nbsp;\u0026nbsp;Somehow, this amused the Gowachin, who added:\u0026nbsp;\u0026nbsp;\"I am Bahrank.\u0026nbsp;\u0026nbsp;Perhaps that\u0027s the luckiest thing which has ever happened to you.\"\u003c/p\u003e\n\u003cp\u003eBahrank was the name Aritch\u0027s aides had given as McKie\u0027s first contact.\u003c/p\u003e\n\u003cp\u003e\"I am McKie.\"\u003c/p\u003e\n\u003cp\u003e\"You fit the description, McKie, except for your, ahhh, condition.\u0026nbsp;\u0026nbsp;Do you wish to say more?\"\u003c/p\u003e\n\u003cp\u003eMcKie wondered what Bahrank expected.\u0026nbsp;\u0026nbsp;This was supposed to be a simple contact handing him on to more important people.\u0026nbsp;\u0026nbsp;Aritch was certain to have knowledgeable observers on Dosadi, but Bahrank was not supposed to be one of them.\u0026nbsp;\u0026nbsp;The warning about this Gowachin had been specific.\u003c/p\u003e\n\u003cp\u003e\"Bahrank doesn\u0027t know about us.\u0026nbsp;\u0026nbsp;Be extremely careful what you reveal to him.\u0026nbsp;\u0026nbsp;It\u0027d be very dangerous to you if he were to learn that you came from beyond the God Veil.\"\u003c/p\u003e\n\u003cp\u003eThe jumpdoor aides had reinforced the warning.\u003c/p\u003e\n\u003cp\u003e\"If the Dosadi penetrate your cover, you\u0027ll have to return to your pickup point on your own.\u0026nbsp;\u0026nbsp;We very much doubt that you could make it.\u0026nbsp;\u0026nbsp;Understand that we can give you little help once we\u0027ve put you on Dosadi.\"\u003c/p\u003e\n\u003cp\u003eBahrank visibly came to a decision, nodding to himself.\u003c/p\u003e\n\u003cp\u003e\"Jedrik expects you.\"\u003c/p\u003e\n\u003cp\u003eThat was the other name Aritch\u0027s people had provided.\u0026nbsp;\u0026nbsp;\"Your cell leader.\u0026nbsp;\u0026nbsp;She\u0027s been told that you\u0027re a new infiltrator from the Rim.\u0026nbsp;\u0026nbsp;Jedrik doesn\u0027t know your true origin.\"\u003c/p\u003e\n\u003cp\u003e\"Who does know?\"\u003c/p\u003e\n\u003cp\u003e\"We cannot tell you.\u0026nbsp;\u0026nbsp;If you don\u0027t know, then that information cannot be wrested from you.\u0026nbsp;\u0026nbsp;We assure you, though, that Jedrik isn\u0027t one of our people.\"\u003c/p\u003e\n\u003cp\u003eMcKie didn\u0027t like the sound of that warning.\u0026nbsp;\u0026nbsp;\". . . wrested from you.\"\u0026nbsp;\u0026nbsp;As usual, BuSab sent you into the tiger\u0027s mouth without a full briefing on the length of the tiger\u0027s fangs.\u003c/p\u003e\n\u003cp\u003eBahrank gestured toward his tracked vehicle.\u0026nbsp;\u0026nbsp;\"Shall we go?\"\u003c/p\u003e\n\u003cp\u003eMcKie glanced at the machine.\u0026nbsp;\u0026nbsp;It was an obvious war device, heavily armored with slits in its metal cab, projectile weapons protruding at odd angles.\u0026nbsp;\u0026nbsp;It looked squat and deadly.\u0026nbsp;\u0026nbsp;Aritch\u0027s people had mentioned such things.\u003c/p\u003e\n\u003cp\u003e\"We saw to it that they got only primitive armored vehicles, projectile weapons and relatively unimportant explosives, that sort of thing.\u0026nbsp;\u0026nbsp;They\u0027ve been quite resourceful in their adaptations of such weaponry, however.\"\u003c/p\u003e\n\u003cp\u003eOnce more, Bahrank gestured toward his vehicle, obviously anxious to leave.\u003c/p\u003e\n\u003cp\u003eMcKie was forced to suppress an abrupt feeling of profound anxiety.\u0026nbsp;\u0026nbsp;What had he gotten himself into?\u0026nbsp;\u0026nbsp;He felt that he had awakened to find himself on a terrifying slide into peril, unable to control the least threat.\u0026nbsp;\u0026nbsp;The sensation passed, but it left him shaken.\u0026nbsp;\u0026nbsp;He delayed while he continued to stare at the vehicle.\u0026nbsp;\u0026nbsp;It was about six meters long with heavy tracks, plus other wheels faintly visible within the shadows behind the tracks.\u0026nbsp;\u0026nbsp;It sported a conventional antenna at the rear for tapping the power transmitter in orbit beneath the barrier veil, but there was a secondary system which burned a stinking fuel.\u0026nbsp;\u0026nbsp;The smoke of that fuel filled the air around them with acridity.\u003c/p\u003e\n\u003cp\u003e\"For what do we wait?\" Bahrank demanded.\u0026nbsp;\u0026nbsp;He glared at McKie with obvious fear and suspicion.\u003c/p\u003e\n\u003cp\u003e\"We can go now,\" McKie said.\u003c/p\u003e\n\u003cp\u003eBahrank turned and led the way swiftly, clambering up over the tracks and into a shadowed cab.\u0026nbsp;\u0026nbsp;McKie followed, found the interior a tightly cluttered place full of a bitter, oily smell.\u0026nbsp;\u0026nbsp;There were two hard metal seats with curved backs higher than the head of a seated Human or Gowachin.\u0026nbsp;\u0026nbsp;Bahrank already occupied the seat on the left, working switches and dials.\u0026nbsp;\u0026nbsp;McKie dropped into the other seat.\u0026nbsp;\u0026nbsp;Folding arms locked across his chest and waist to hold him in place; a brace fitted itself to the back of his head.\u0026nbsp;\u0026nbsp;Bahrank threw a switch.\u0026nbsp;\u0026nbsp;The door through which they\u0027d entered closed with a grinding of servomotors and the solid clank of locks.\u003c/p\u003e\n\u003cp\u003eAn ambivalent mood swept over McKie.\u0026nbsp;\u0026nbsp;He had always felt faint agoraphobia in open places such as the area around the rock.\u0026nbsp;\u0026nbsp;But the dim interior of this war machine, with its savage reminders of primitive times, touched an atavistic chord in his psyche and he fought an urge to claw his way outside.\u0026nbsp;\u0026nbsp;This was a trap!\u003c/p\u003e\n\u003cp\u003eAn odd observation helped him overcome the sensation.\u0026nbsp;\u0026nbsp;There was glass over the slits which gave them their view of the outside.\u0026nbsp;\u0026nbsp;Glass.\u0026nbsp;\u0026nbsp;He felt it.\u0026nbsp;\u0026nbsp;Yes, glass.\u0026nbsp;\u0026nbsp;It was common stuff in the ConSentiency - strong yet fragile.\u0026nbsp;\u0026nbsp;He could see that this glass wasn\u0027t very thick.\u0026nbsp;\u0026nbsp;The fierce appearance of this machine had to be more show than actuality, then.\u003c/p\u003e\n\u003cp\u003eBahrank gave one swift, sweeping glance to their surroundings, moved levers which set the vehicle into lurching motion.\u0026nbsp;\u0026nbsp;It emitted a grinding rumble with an overriding whine.\u003c/p\u003e\n\u003cp\u003eA track of sorts led from the white rock toward the distant city.\u0026nbsp;\u0026nbsp;It showed the marks of this machine\u0027s recent passage, a roadway to follow.\u0026nbsp;\u0026nbsp;Glittering reflections danced from bright rocks along the track.\u0026nbsp;\u0026nbsp;Bahrank appeared very busy with whatever he was doing to guide them toward Chu.\u003c/p\u003e\n\u003cp\u003eMcKie found his own thoughts returning to the briefings he\u0027d received on Tandaloor.\u003c/p\u003e\n\u003cp\u003e\"Once you enter Jedrik\u0027s cell you\u0027re on your own.\"\u003c/p\u003e\n\u003cp\u003eYes . . . he felt very much alone, his mind a clutter of data which had little relationship to any previous experience.\u0026nbsp;\u0026nbsp;And this planet could die unless he made sense out of that data plus whatever else he might learn here.\u003c/p\u003e\n\u003cp\u003eAlone, alone . . . If Dosadi died there\u0027d be few sentient watchers.\u0026nbsp;\u0026nbsp;The Caleban\u0027s tempokinetic barrier would contain most of that final destructive flare.\u0026nbsp;\u0026nbsp;The Caleban would, in fact, feed upon the released energy.\u0026nbsp;\u0026nbsp;That was one of the things he\u0027d learned from Fannie Mae.\u0026nbsp;\u0026nbsp;One consuming blast, a meal for a Caleban, and BuSab would be forced to start anew and without the most important piece of physical evidence - Dosadi.\u003c/p\u003e\n\u003cp\u003eThe machine beneath McKie thundered, rocked, and skidded, but always returned to the track which led toward Chu\u0027s distant spires.\u003c/p\u003e\n\u003cp\u003eMcKie studied the driver covertly.\u0026nbsp;\u0026nbsp;Bahrank showed uncharacteristic behavior for a Gowachin:\u0026nbsp;\u0026nbsp;more direct, more Human.\u0026nbsp;\u0026nbsp;That was it!\u0026nbsp;\u0026nbsp;His Gowachin instincts had been contaminated by contact with Humans.\u0026nbsp;\u0026nbsp;Aritch was sure to despise that, fear it.\u0026nbsp;\u0026nbsp;Bahrank drove with a casual expertise, using a complex control system.\u0026nbsp;\u0026nbsp;McKie counted eight different levers and arms which the Gowachin employed.\u0026nbsp;\u0026nbsp;Some were actuated by knees, others by his head.\u0026nbsp;\u0026nbsp;His hands reached out while an elbow deflected a lever.\u0026nbsp;\u0026nbsp;The war machine responded.\u003c/p\u003e\n\u003cp\u003eBahrank spoke presently without taking his attention from driving.\u003c/p\u003e\n\u003cp\u003e\"We may come under fire on the second ledge.\u0026nbsp;\u0026nbsp;There was quite a police action down there earlier.\"\u003c/p\u003e\n\u003cp\u003eMcKie stared at him.\u003c/p\u003e\n\u003cp\u003e\"I thought we had safe passage through.\"\u003c/p\u003e\n\u003cp\u003e\"You Rimmers are always pressing.\"\u003c/p\u003e\n\u003cp\u003eMcKie peered out the slits:\u0026nbsp;\u0026nbsp;bushes, barren ground, that lonely track they followed.\u003c/p\u003e\n\u003cp\u003eBahrank spoke.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re older than any Rimmer I ever saw before.\"\u003c/p\u003e\n\u003cp\u003eAritch\u0027s people had warned McKie about this as a basic flaw in his cover, the need to conceal the subtle signs of age.\u003c/p\u003e\n\u003cp\u003eThey\u0027d provided him with some geriatric assistance and an answer to give when challenged.\u0026nbsp;\u0026nbsp;He used that answer now.\u003c/p\u003e\n\u003cp\u003e\"It ages you in a hurry out here.\"\u003c/p\u003e\n\u003cp\u003e\"It must.\"\u003c/p\u003e\n\u003cp\u003eMcKie felt that something in Bahrank\u0027s response eluded him, but dared not pursue this.\u0026nbsp;\u0026nbsp;It was an unproductive exchange.\u0026nbsp;\u0026nbsp;And there was that reference to a \"police action.\"\u0026nbsp;\u0026nbsp;McKie knew that the Rim Rabble, excluded from Chu, tried periodic raids, most often fruitless.\u0026nbsp;\u0026nbsp;Barbaric!\u003c/p\u003e\n\u003cp\u003e\"What excuse did you use to come out here?\"\u0026nbsp;\u0026nbsp;McKie asked.\u003c/p\u003e\n\u003cp\u003eBahrank shot a probing glance at him, raised one webbed hand from the controls to indicate a handle in the roof over his head.\u0026nbsp;\u0026nbsp;The handle\u0027s purpose was unknown to McKie, and he feared he had already betrayed too much ignorance.\u0026nbsp;\u0026nbsp;But Bahrank was speaking.\u003c/p\u003e\n\u003cp\u003e\"Officially, I\u0027m scouting this area for any hidden surprises the Rimmers may have stored out here.\u0026nbsp;\u0026nbsp;I often do that.\u0026nbsp;\u0026nbsp;Unofficially, everyone thinks I\u0027ve a secret pond out here full of fertile females.\"\u003c/p\u003e\n\u003cp\u003eA pond . . . not a Graluz.\u0026nbsp;\u0026nbsp;Again, it was a relatively fruitless exchange with hidden undertones.\u003c/p\u003e\n\u003cp\u003eMcKie stared silently ahead through a slit.\u0026nbsp;\u0026nbsp;Their dusty track made a slow and wide sweep left, abruptly angled down onto a narrow ledge cut from red rock walls.\u0026nbsp;\u0026nbsp;Bahrank put them through a series of swift changes in speed:\u0026nbsp;\u0026nbsp;slow, fast, slow, fast.\u0026nbsp;\u0026nbsp;The red rock walls raced past.\u0026nbsp;\u0026nbsp;McKie peered out and downward on his side.\u0026nbsp;\u0026nbsp;Far below lay jungle verdure and, in the distance, the smoke and spires of Chu - fluted buildings ranked high over dim background cliffs.\u003c/p\u003e\n\u003cp\u003eThe speed changes appeared purposeless to McKie.\u0026nbsp;\u0026nbsp;And the dizzy drop off the cliff on his side filled him with awe.\u0026nbsp;\u0026nbsp;Their narrow ledge hugged the cliff, turning as the cliff turned - now into shadows and now into light.\u0026nbsp;\u0026nbsp;The machine roared and groaned around him.\u0026nbsp;\u0026nbsp;The smell of oil made his stomach heave.\u0026nbsp;\u0026nbsp;And the faraway city seemed little closer than it had from the cliff top, except that it was taller, more mysterious in its smoky obscurity.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t expect any real trouble until we reach the first ledge,\" Bahrank said.\u003c/p\u003e\n\u003cp\u003eMcKie glanced at him.\u0026nbsp;\u0026nbsp;First ledge?\u0026nbsp;\u0026nbsp;Yes, that\u0027d be the first elevation outside the city\u0027s walls.\u0026nbsp;\u0026nbsp;The gorge within which Chu had been raised came down to river level in broad steps, each one numbered.\u0026nbsp;\u0026nbsp;Chu had been anchored to island hills and flats where the river slowed and split into many arms.\u0026nbsp;\u0026nbsp;And the hills which had resisted the river were almost solid iron ore, as were many of the flanking ledges.\u003c/p\u003e\n\u003cp\u003e\"Glad to get off there,\" Bahrank said.\u003c/p\u003e\n\u003cp\u003eTheir narrow ledge had turned at right angles away from the cliff onto a broad ramp which descended into grey-green jungle.\u0026nbsp;\u0026nbsp;The growth enclosed them in abrupt green shadows.\u0026nbsp;\u0026nbsp;McKie, looking out to the side, identified hair fronds and broad leaf ficus, giant spikes of barbed red which he had never before seen.\u0026nbsp;\u0026nbsp;Their track, like the jungle floor, was grey mud.\u0026nbsp;\u0026nbsp;McKie looked from side to side; the growth appeared an almost equal mixture of Terran and Tandaloor, interspersed with many strange plants.\u003c/p\u003e\n\u003cp\u003eSunlight made him blink as they raced out of the overhanging plants onto a plain of tall grass which had been trampled, blasted, and burned by recent violence.\u0026nbsp;\u0026nbsp;He saw a pile of wrecked vehicles off to the left, twisted shards of metal with, here and there, a section of track or a wheel aimed at the sky.\u0026nbsp;\u0026nbsp;Some of the wrecks looked similar to the machine in which he now rode.\u003c/p\u003e\n\u003cp\u003eBahrank skirted a blast hole at an angle which gave McKie a view into the hole\u0027s depths.\u0026nbsp;\u0026nbsp;Torn bodies lay there.\u0026nbsp;\u0026nbsp;Bahrank made no comment, seemed hardly to notice.\u003c/p\u003e\n\u003cp\u003eAbruptly, McKie saw signs of movement in the jungle, the flitting presence of both Humans and Gowachin.\u0026nbsp;\u0026nbsp;Some carried what appeared to be small weapons - the glint of a metal tube, bandoliers of bulbous white objects around their necks.\u0026nbsp;\u0026nbsp;McKie had not tried to memorize all of Dosadi\u0027s weaponry; it was, after all, primitive, but he reminded himself now that primitive weapons had created these scenes of destruction.\u003c/p\u003e\n\u003cp\u003eTheir track plunged again into overhanging growth, leaving the battlefield behind.\u0026nbsp;\u0026nbsp;Deep green shadows enclosed the lurching, rumbling machine.\u0026nbsp;\u0026nbsp;McKie, shaken from side to side against the restraints, carried an odor memory with him:\u0026nbsp;\u0026nbsp;deep, bloody musks and the beginnings of rot.\u0026nbsp;\u0026nbsp;Their shaded avenue made a sharp right turn, emerged onto another ledge slashed by a plunging cut into which Bahrank took them, turning onto another cliff-hugging ledge.\u003c/p\u003e\n\u003cp\u003eMcKie stared across Bahrank through the slits.\u0026nbsp;\u0026nbsp;The city was nearer now.\u0026nbsp;\u0026nbsp;Their rocking descent swept his gaze up and down Chu\u0027s towers, which lifted like silvery organ pipes out of the Council Hills.\u0026nbsp;\u0026nbsp;The far cliff was a series of misted steps fading into purple grey.\u0026nbsp;\u0026nbsp;Chu\u0027s Warrens lay smokey and hazed all around the fluted towers.\u0026nbsp;\u0026nbsp;And he could make out part of the city\u0027s enclosing outer wall.\u0026nbsp;\u0026nbsp;Squat forts dotted the wall\u0027s top, offset for enfilading fire.\u0026nbsp;\u0026nbsp;The city within the wall seemed so tall.\u0026nbsp;\u0026nbsp;McKie had not expected it to appear so tall - but that spoke of the population pressures in a way that could not be misunderstood.\u003c/p\u003e\n\u003cp\u003eTheir ledge ended at another battlefield plain strewn with bodies of metal and flesh, the death stink an inescapable vapor.\u0026nbsp;\u0026nbsp;Bahrank spun his vehicle left, right, dodged piles of torn equipment, avoided craters where mounds of flesh lay beneath insect blankets.\u0026nbsp;\u0026nbsp;Ferns and other low growth were beginning to spring upright after the monstrous trampling.\u0026nbsp;\u0026nbsp;Grey and yellow flying creatures sported in the ferntops, uncaring of all that death.\u0026nbsp;\u0026nbsp;Aritch\u0027s aides had warned McKie that Dosadi\u0027s life existed amidst brutal excesses, but the actuality sickened him.\u0026nbsp;\u0026nbsp;He identified both Gowachin and Human forms among the sprawled corpses.\u0026nbsp;\u0026nbsp;The sleek green skin of a young Gowachin female, orange fertility marks prominent along her arms, especially revolted him.\u0026nbsp;\u0026nbsp;McKie turned sharply away, found Bahrank studying him with tawny mockery in the shining Gowachin eyes.\u0026nbsp;\u0026nbsp;Bahrank spoke as he drove.\u003c/p\u003e\n\u003cp\u003e\"There\u0027re informers everywhere, of course, and after this . . .\"\u0026nbsp;\u0026nbsp;His head nodded left and right.\u0026nbsp;\u0026nbsp;\". . . you\u0027ll have to move with more caution than you might\u0027ve anticipated.\"\u003c/p\u003e\n\u003cp\u003eA brittle explosion punctuated his words.\u0026nbsp;\u0026nbsp;Something struck the vehicle\u0027s armor on McKie\u0027s side.\u0026nbsp;\u0026nbsp;Again they were a target.\u0026nbsp;\u0026nbsp;And again.\u0026nbsp;\u0026nbsp;The clanging of metal against metal came thickly, striking all around them, even on the glass over the view slits.\u003c/p\u003e\n\u003cp\u003eMcKie suppressed his shock.\u0026nbsp;\u0026nbsp;That thin glass did not shatter.\u0026nbsp;\u0026nbsp;He knew about thick shields of tempered glass, but this put a new dimension on what he\u0027d been told about the Dosadi.\u0026nbsp;\u0026nbsp;Quite resourceful, indeed!\u003c/p\u003e\n\u003cp\u003eBahrank drove with apparent unconcern.\u003c/p\u003e\n\u003cp\u003eMore explosive attacks came from directly in front of them, flashes of orange in the jungle beyond the plain.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re testing,\" Bahrank said.\u0026nbsp;\u0026nbsp;He pointed to one of the slits.\u0026nbsp;\u0026nbsp;\"See?\u0026nbsp;\u0026nbsp;They don\u0027t even leave a mark on that new glass.\"\u003c/p\u003e\n\u003cp\u003eMcKie spoke from the depths of his bitterness.\u003c/p\u003e\n\u003cp\u003e\"Sometimes you wonder what all this proves except that our world runs on distrust.\"\u003c/p\u003e\n\u003cp\u003e\"Who trusts?\"\u003c/p\u003e\n\u003cp\u003eBahrank\u0027s words had the sound of a catechism.\u003c/p\u003e\n\u003cp\u003eMcKie said:\u003c/p\u003e\n\u003cp\u003e\"I hope our friends know when to stop testing.\"\u003c/p\u003e\n\u003cp\u003e\"They were told we couldn\u0027t take more\u0027n eighty millimeter.\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t they agree to pass us through?\"\u003c/p\u003e\n\u003cp\u003e\"Even so, they\u0027re expected to try a few shots if just to keep me in good graces with my superiors.\"\u003c/p\u003e\n\u003cp\u003eOnce more, Bahrank put them through a series of dazzling speed changes and turns for no apparent reason.\u0026nbsp;\u0026nbsp;McKie lurched against the restraints, felt bruising pain as an elbow hit the side of the cab.\u0026nbsp;\u0026nbsp;An explosion directly behind rocked them up onto the left track.\u0026nbsp;\u0026nbsp;As they bounced, Bahrank spun them left, avoided another blast which would\u0027ve landed directly on them along their previous path.\u0026nbsp;\u0026nbsp;McKie, his ears ringing from the explosions, felt the machine bounce to a stop, reverse as more explosions erupted ahead.\u0026nbsp;\u0026nbsp;Bahrank spun them to the right, then left, once more charged full speed ahead right into an unbroken wall of jungle.\u0026nbsp;\u0026nbsp;With explosions all around, they crashed through greenery, turned to the right along another shadowed muddy track.\u0026nbsp;\u0026nbsp;McKie had lost all sense of direction, but the attack had ceased.\u003c/p\u003e\n\u003cp\u003eBahrank slowed them, took a deep breath through his ventricles.\u003c/p\u003e\n\u003cp\u003e\"I knew they\u0027d try that.\"\u003c/p\u003e\n\u003cp\u003eHe sounded both relieved and amused.\u003c/p\u003e\n\u003cp\u003eMcKie, shaken by the brush with death, couldn\u0027t find his voice.\u003c/p\u003e\n\u003cp\u003eTheir shadowy track snaked through the jungle for a space, giving McKie time to recover.\u0026nbsp;\u0026nbsp;By then, he didn\u0027t know what to say.\u0026nbsp;\u0026nbsp;He couldn\u0027t understand Bahrank\u0027s amusement, the lack of enduring concern over such violent threat.\u003c/p\u003e\n\u003cp\u003ePresently, they emerged onto an untouched, sloping plain as smooth and green as a park lawn.\u0026nbsp;\u0026nbsp;It dipped gently downward into a thin screen of growth through which McKie could see a silver-green tracery of river.\u0026nbsp;\u0026nbsp;What caught and held McKie\u0027s attention, however, was a windowless, pock-walled grey fortress which lifted from the plain in the middle distance.\u0026nbsp;\u0026nbsp;It towered over the growth screening the river.\u0026nbsp;\u0026nbsp;Buttressed arms reached toward them to enclose a black metal barrier.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s our gate,\" Bahrank said.\u003c/p\u003e\n\u003cp\u003eBahrank turned them left, lined up with the center of the buttressed arms.\u0026nbsp;\u0026nbsp;\"Gate Nine and we\u0027re home through the tube,\" he said.\u003c/p\u003e\n\u003cp\u003eMcKie nodded.\u0026nbsp;\u0026nbsp;Walls, tubes, and gates:\u0026nbsp;\u0026nbsp;those were the keys to Chu\u0027s defenses.\u0026nbsp;\u0026nbsp;They had \"barrier and fortress minds\" on Dosadi.\u0026nbsp;\u0026nbsp;This tube would run beneath the river.\u0026nbsp;\u0026nbsp;He tried to place it on the map which Aritch\u0027s people had planted in his mind.\u0026nbsp;\u0026nbsp;He was supposed to know the geography of this place, its geology, religions, social patterns, the intimate layout of each island\u0027s walled defenses, but he found it hard to locate himself now on that mental map.\u0026nbsp;\u0026nbsp;He leaned forward to the slit, peered upward as the machine began to gather speed, saw the great central spire with its horizontal clock.\u0026nbsp;\u0026nbsp;All the hours of map briefing snicked into place.\u003c/p\u003e\n\u003cp\u003e\"Yes, Gate Nine.\"\u003c/p\u003e\n\u003cp\u003eBahrank, too busy driving, did not reply.\u003c/p\u003e\n\u003cp\u003eMcKie dropped his gaze to the fortress, stifled a gasp.\u003c/p\u003e\n\u003cp\u003eThe rumbling machine was plunging downslope at a frightening pace, aimed directly toward that black metal barrier.\u0026nbsp;\u0026nbsp;At the last instant, when it seemed they would crash into it, the barrier leaped upward.\u0026nbsp;\u0026nbsp;They shot through into a dimly illuminated tube.\u0026nbsp;\u0026nbsp;The gate thundered closed behind them. Their machine made a racketing sound on metal grating beneath the tracks.\u003c/p\u003e\n\u003cp\u003eBahrank slowed them, shifted a lever beside him.\u0026nbsp;\u0026nbsp;The machine lifted onto wheels with an abrupt reduction in noise which made McKie feel that he\u0027d been deafened.\u0026nbsp;\u0026nbsp;The feeling was heightened by the realization that Bahrank had said the same thing to him several times.\u003c/p\u003e\n\u003cp\u003e\"Jedrik says you come from beyond the far mountains.\u0026nbsp;\u0026nbsp;Is that true?\"\u003c/p\u003e\n\u003cp\u003e\"Jedrik says it.\"\u0026nbsp;\u0026nbsp;He tried to make it sound wry, but it came out almost questioning.\u003c/p\u003e\n\u003cp\u003eBahrank was concentrating on a line of thought, however, as he drove them straight down the grating floor of the dim tube.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a rumor that you Rimmers have started a secret settlement back there, that you\u0027re trying to build your own city.\"\u003c/p\u003e\n\u003cp\u003e\"An interesting rumor.\"\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t it, though?\"\u003c/p\u003e\n\u003cp\u003eThe single line of overhead lights in the tube left the cab\u0027s interior darker than it\u0027d been outside, illuminated by only the faint reflections from instruments and dials.\u0026nbsp;\u0026nbsp;But McKie had the odd sensation that Bahrank saw him clearly, was studying every expression.\u0026nbsp;\u0026nbsp;Despite the impossibility of this, the thought persisted.\u0026nbsp;\u0026nbsp;What was behind Bahrank\u0027s probing?\u003c/p\u003e\n\u003cp\u003eWhy do I feel that he sees right through me?\u003c/p\u003e\n\u003cp\u003eThese disquieting conjectures ended as they emerged from the tube onto a Warren street.\u0026nbsp;\u0026nbsp;Bahrank spun them to the right along a narrow alleyway in deep grey shadows.\u003c/p\u003e\n\u003cp\u003eAlthough he\u0027d seen many representations of these streets the actuality deepened McKie\u0027s feelings of misgiving.\u0026nbsp;\u0026nbsp;So dirty . . . oppressive . . . so many people.\u0026nbsp;\u0026nbsp;They were everywhere!\u003c/p\u003e\n\u003cp\u003eBahrank drove slowly now on the silent wheels, the tracks raised off the paving.\u0026nbsp;\u0026nbsp;The big machine eased its way through narrow little streets, some paved with stone, some with great slabs of gleaming black.\u0026nbsp;\u0026nbsp;All the streets were shaded by overhanging upper stories whose height McKie could not judge through the slits.\u0026nbsp;\u0026nbsp;He saw shops barred and guarded.\u0026nbsp;\u0026nbsp;An occasional stairway, also guarded, led up or down into repellent darkness.\u0026nbsp;\u0026nbsp;Only Humans occupied these streets, and no casual, pedestrian expressions on any of them.\u0026nbsp;\u0026nbsp;Jaws were set on grim mouths.\u0026nbsp;\u0026nbsp;Hard, questioning eyes peered at the passing vehicle.\u0026nbsp;\u0026nbsp;Both men and women wore the universal dark, one-piece clothing of the Labor Pool.\u003c/p\u003e\n\u003cp\u003eNoting McKie\u0027s interest, Bahrank spoke.\u003c/p\u003e\n\u003cp\u003e\"This is a Human enclave and you have a Gowachin driver.\"\u003c/p\u003e\n\u003cp\u003e\"Can they see us in here?\"\u003c/p\u003e\n\u003cp\u003e\"They know.\u0026nbsp;\u0026nbsp;And there\u0027s trouble coming.\"\u003c/p\u003e\n\u003cp\u003e\"Trouble?\"\u003c/p\u003e\n\u003cp\u003e\"Gowachin against Human.\"\u003c/p\u003e\n\u003cp\u003eThis appalled McKie, and he wondered if this were the source of those forebodings which Aritch and aides would not explain:\u0026nbsp;\u0026nbsp;destruction of Dosadi from within.\u0026nbsp;\u0026nbsp;But Bahrank continued:\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a growing separation between Humans and Gowachin, worse than it\u0027s ever been.\u0026nbsp;\u0026nbsp;You may be the last Human to ride with me.\"\u003c/p\u003e\n\u003cp\u003eAritch and company had prepared McKie for Dosadi\u0027s violence, hunger, and distrust, but they\u0027d said nothing about species against species . . . only that someone they refused to name could destroy the place from within.\u0026nbsp;\u0026nbsp;What was Bahrank trying to say?\u0026nbsp;\u0026nbsp;McKie dared not expose his ignorance by probing, and this inability dismayed him.\u003c/p\u003e\n\u003cp\u003eBahrank, meanwhile, nosed their machine out of a narrow passage onto a wider street which was crowded by carts, each piled with greenery.\u0026nbsp;\u0026nbsp;The carts moved aside slowly as the armored vehicle approached, hatred plain in the eyes of the Humans who moved with the carts.\u0026nbsp;\u0026nbsp;The press of people astonished McKie:\u0026nbsp;\u0026nbsp;for every cart (and he lost count of them within a block) there were at least a hundred people crowding around, lifting arms high, shouting at the ring of people who stood shoulder to shoulder around each cart, their backs to the piled contents and obviously guarding those contents.\u003c/p\u003e\n\u003cp\u003eMcKie, staring at the carts, realized with a shocked sense of recognition that he was staring at carts piled with garbage.\u0026nbsp;\u0026nbsp;The crowds of people were buying garbage.\u003c/p\u003e\n\u003cp\u003eAgain, Bahrank acted the part of tour guide.\u003c/p\u003e\n\u003cp\u003e\"This is called the Street of the Hungry.\u0026nbsp;\u0026nbsp;That\u0027s very select garbage, the best.\"\u003c/p\u003e\n\u003cp\u003eMcKie recalled one of Aritch\u0027s aides saying there were restaurants in Chu which specialized in garbage from particular areas of the city, that no poison-free food was wasted.\u003c/p\u003e\n\u003cp\u003eThe passing scene compelled McKie\u0027s attention:\u0026nbsp;\u0026nbsp;hard faces, furtive movements, the hate and thinly suppressed violence, all of this immersed in a normal commercial operation based on garbage.\u0026nbsp;\u0026nbsp;And the numbers of these people!\u0026nbsp;\u0026nbsp;They were everywhere around:\u0026nbsp;\u0026nbsp;in doorways, guarding and pushing the carts, skipping out of Bahrank\u0027s path.\u0026nbsp;\u0026nbsp;New smells assaulted McKie\u0027s nostrils, a fetid acridity, a stink such as he had never before experienced.\u0026nbsp;\u0026nbsp;Another thing surprised him:\u0026nbsp;\u0026nbsp;the appearance of antiquity in this Warren.\u0026nbsp;\u0026nbsp;He wondered if all city populations crowded by threats from outside took on this ancient appearance.\u0026nbsp;\u0026nbsp;By ConSentient standards, the population of Chu had lived here only a few generations, but the city looked older than any he\u0027d ever seen.\u003c/p\u003e\n\u003cp\u003eWith an abrupt rocking motion, Bahrank turned their machine down a narrow street, brought them to a stop.\u0026nbsp;\u0026nbsp;McKie, looking out the slit on his right, saw an arched entry in a grimy building, a stairway leading downward into gloom.\u003c/p\u003e\n\u003cp\u003e\"Down there\u0027s where you meet Jedrik,\" Bahrank said.\u0026nbsp;\u0026nbsp;\"Down those stairs, second door on your left.\u0026nbsp;\u0026nbsp;It\u0027s a restaurant.\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027ll I know her?\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t they tell you?\"\u003c/p\u003e\n\u003cp\u003e\"I . . .\" McKie broke off.\u0026nbsp;\u0026nbsp;He\u0027d seen pictures of Jedrik during the Tandaloor briefings, realized now that he was trying to delay leaving Bahrank\u0027s armored cocoon.\u003c/p\u003e\n\u003cp\u003eBahrank appeared to sense this.\u003c/p\u003e\n\u003cp\u003e\"Have no fear, McKie.\u0026nbsp;\u0026nbsp;Jedrik will know you.\u0026nbsp;\u0026nbsp;And McKie . . .\"\u003c/p\u003e\n\u003cp\u003eMcKie turned to face the Gowachin.\u003c/p\u003e\n\u003cp\u003e\". . . go directly to the restaurant, take a seat, wait for Jedrik.\u0026nbsp;\u0026nbsp;You\u0027ll not survive long here without her protection.\u0026nbsp;\u0026nbsp;Your skin\u0027s dark and some Humans prefer even the green to the dark in this quarter.\u0026nbsp;\u0026nbsp;They remember Pylash Gate here.\u0026nbsp;\u0026nbsp;Fifteen years isn\u0027t long enough to erase that from their minds.\"\u003c/p\u003e\n\u003cp\u003eNothing about a Pylash Gate had been included in McKie\u0027s briefings and now he dared not ask.\u003c/p\u003e\n\u003cp\u003eBahrank moved the switch which opened McKie\u0027s door.\u0026nbsp;\u0026nbsp;Immediately, the stink of the street was amplified to almost overpowering proportions.\u0026nbsp;\u0026nbsp;Bahrank, seeing him hesitate, spoke sharply.\u003c/p\u003e\n\u003cp\u003e\"Go quickly!\"\u003c/p\u003e\n\u003cp\u003eMcKie descended in a kind of olfactory daze, found himself standing on the side of the street, the object of suspicious stares from all around.\u0026nbsp;\u0026nbsp;The sight of Bahrank driving away was the cutting of his last link to the ConSentiency and all the familiar things which might protect him.\u0026nbsp;\u0026nbsp;Never in his long life had McKie felt this much alone. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dosadi-experiment-consentiency-universe-2/page-13.html","bookId":2173,"creation":"Oct 5, 2019 6:40:19 PM","modification":"Oct 5, 2019 6:40:19 PM"}
