{"id":99191,"no":14,"title":"Page 14","content":"\u003cp\u003eNo legal system can maintain justice unless every participant - magisters, prosecutors, Legums, defendants, witnesses, all - risks life itself in whatever dispute comes before the bar.\u0026nbsp;\u0026nbsp;Everything must be risked in the Courtarena.\u0026nbsp;\u0026nbsp;If any element remains outside the contest and without personal risk, justice inevitably fails.\u003c/p\u003e\n\u003cp\u003e- Gowachin Law\u003c/p\u003e\n\u003cp\u003eNear sunset there was a fine rain which lasted well into darkness, then departed on the gorge wind which cleared Dosadi\u0027s skies.\u0026nbsp;\u0026nbsp;It left the air crystalline, cornices dripping puddles in the streets.\u0026nbsp;\u0026nbsp;Even the omnipresent Warren stink was diluted and Chu\u0027s inhabitants showed a predatory lightness as they moved along the streets.\u003c/p\u003e\n\u003cp\u003eReturning to headquarters in an armored troop carrier which carried only his most trusted Gowachin, Broey noted the clear air even while he wondered at the reports which had brought him racing from the Council Hills.\u0026nbsp;\u0026nbsp;When he entered the conference room, Broey saw that Gar already was there standing with his back to the dark window which looked out on the eastern cliffs.\u0026nbsp;\u0026nbsp;Broey wondered how long Gar had been there.\u0026nbsp;\u0026nbsp;No sign of recognition passed between Gowachin and Human, but this only emphasized the growing separation of the species.\u0026nbsp;\u0026nbsp;They\u0027d both seen the reports which contained that most disturbing datum:\u0026nbsp;\u0026nbsp;the killing of a Human double agent under circumstances which pointed at Broey himself.\u003c/p\u003e\n\u003cp\u003eBroey crossed to the head of the conference table, flipped the toggle which activated his communicator, addressed the screen which only he could see.\u003c/p\u003e\n\u003cp\u003e\"Assemble the Council and link for conference.\"\u003c/p\u003e\n\u003cp\u003eThe response came as a distorted buzz filtered through scramblers and suppressed by a privacy cone.\u0026nbsp;\u0026nbsp;Gar, standing across the room, could make no sense out of the noises coming from the communicator.\u003c/p\u003e\n\u003cp\u003eWhile he waited for the Council members to come on the conference link, Broey seated himself at the communicator, summoned a Gowachin aide to the screen, and spoke in a low voice masked by the privacy cone.\u003c/p\u003e\n\u003cp\u003e\"Start a security check on all Humans in positions where they might threaten us.\u0026nbsp;\u0026nbsp;Use Plan D.\"\u003c/p\u003e\n\u003cp\u003eBroey glanced up at Gar.\u0026nbsp;\u0026nbsp;The Human\u0027s mouth worked silently.\u0026nbsp;\u0026nbsp;He was annoyed by the privacy cone and his inability to tell exactly what Broey was doing.\u0026nbsp;\u0026nbsp;Broey continued speaking to his aide.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll want the special force deployed as I told you earlier . . .\u0026nbsp;\u0026nbsp;Yes . . .\"\u003c/p\u003e\n\u003cp\u003eGar pointedly turned his back on this conversation, stared out at the night.\u003c/p\u003e\n\u003cp\u003eBroey continued to address his aide in the screen.\u003c/p\u003e\n\u003cp\u003e\"No!\u0026nbsp;\u0026nbsp;We must include even the Humans in this conference.\u0026nbsp;\u0026nbsp;Yes, that\u0027s the report Gar made to me.\u0026nbsp;\u0026nbsp;Yes, I also received that information.\u0026nbsp;\u0026nbsp;Other Humans can be expected to riot and drive out their Gowachin neighbors, and there\u0027ll be retaliations.\u0026nbsp;\u0026nbsp;Yes, that was my thought when I saw the report.\"\u003c/p\u003e\n\u003cp\u003eBroey turned off the privacy cone and scrambler.\u0026nbsp;\u0026nbsp;Tria had just come onto his screen with an override, interrupting the conversation with his security aide.\u0026nbsp;\u0026nbsp;She spoke in a low, hurried voice with only a few words intelligible to Gar across the room.\u0026nbsp;\u0026nbsp;But Broey\u0027s suspicions were becoming obvious.\u0026nbsp;\u0026nbsp;He heard Tria out, then:\u003c/p\u003e\n\u003cp\u003e\"Yes . . . it would be logical to suppose that such a killing was made to look like Gowachin work for . . .\u0026nbsp;\u0026nbsp;I see.\u0026nbsp;\u0026nbsp;But the scattered incidents which . . . Indeed?\u0026nbsp;\u0026nbsp;Well, under the circumstances . . .\"\u003c/p\u003e\n\u003cp\u003eHe left the thought incomplete, but his words drew a line between Human and Gowachin, even at the highest levels of his Advisory Council.\u003c/p\u003e\n\u003cp\u003e\"Tria, I must make my own decisions on this.\"\u003c/p\u003e\n\u003cp\u003eWhile Broey was speaking, Gar brought up a chair and placed it near the communicator, then sat down.\u0026nbsp;\u0026nbsp;Broey had finished his conversation with Tria and restored the privacy circuits, however, and even though he sat nearby Gar could not penetrate their protective screen.\u0026nbsp;\u0026nbsp;He was close enough now, though, to hear the buzzing of the privacy system and the sound annoyed Gar.\u0026nbsp;\u0026nbsp;He did not try to conceal his annoyance.\u003c/p\u003e\n\u003cp\u003eBroey saw Gar, but gave no indication that he approved or disapproved Gar\u0027s nearness.\u003c/p\u003e\n\u003cp\u003e\"So I understand,\" Broey said.\u0026nbsp;\u0026nbsp;\"Yes . . . I\u0027ll issue those orders as soon as I\u0027ve finished here.\u0026nbsp;\u0026nbsp;No . . .\u0026nbsp;\u0026nbsp;Agreed.\u0026nbsp;\u0026nbsp;That would be best.\"\u0026nbsp;\u0026nbsp;He closed the circuit.\u0026nbsp;\u0026nbsp;The annoying buzz stopped.\u003c/p\u003e\n\u003cp\u003e\"Jedrik means to set Gowachin against Human, Human against Gowachin,\" Gar said.\u003c/p\u003e\n\u003cp\u003e\"If so, it\u0027s been a long time in secret preparation,\" Broey said.\u003c/p\u003e\n\u003cp\u003eHis words implied many things:\u0026nbsp;\u0026nbsp;that there was conspiracy in high places, that the situation had achieved dangerous momentum without being detected, that all of the inertial forces could not now be anticipated.\u003c/p\u003e\n\u003cp\u003e\"You expect it to get worse,\" Gar said.\u003c/p\u003e\n\u003cp\u003e\"Hopefully.\"\u003c/p\u003e\n\u003cp\u003eGar stared at him for a long period, then:\u003c/p\u003e\n\u003cp\u003e\"Yes.\u003c/p\u003e\n\u003cp\u003eIt was clear that Broey wanted a well-defined condition to develop, one which would provide clear predictions of the major consequences.\u0026nbsp;\u0026nbsp;He was prepared for this.\u0026nbsp;\u0026nbsp;When Broey understood the situation to his own satisfaction, he\u0027d use his own undeniable powers to gain as much as possible during a period of upset.\u003c/p\u003e\n\u003cp\u003eGar broke the silence.\u003c/p\u003e\n\u003cp\u003e\"But if we\u0027ve misunderstood Jedrik\u0027s intent -\"\u003c/p\u003e\n\u003cp\u003e\"It helps us when the innocent suffer,\" Broey said, paraphrasing part of an old axiom which every Dosadi knew.\u003c/p\u003e\n\u003cp\u003eGar completed the thought for him.\u003c/p\u003e\n\u003cp\u003e\"But who\u0027s innocent?\"\u003c/p\u003e\n\u003cp\u003eBefore Broey could respond, his screen came alight with the assembled faces of his Council, each face in its own little square.\u0026nbsp;\u0026nbsp;Broey conducted the conference quickly, allowing few interruptions.\u0026nbsp;\u0026nbsp;There were no house arrests, no direct accusations, but his words and manner divided them by species.\u0026nbsp;\u0026nbsp;When he was through, Gar imagined the scrambling which must be going on right then in Chu while the powerful assembled their defenses.\u003c/p\u003e\n\u003cp\u003eWithout knowing how he sensed this, Gar felt that this was exactly what Jedrik had wanted, and that it\u0027d been a mistake for Broey to increase the tensions.\u003c/p\u003e\n\u003cp\u003eAfter turning off the communicator, Broey sat back and addressed himself to Gar with great care.\u003c/p\u003e\n\u003cp\u003e\"Tria tells me that Jedrik cannot be found.\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t we expect that?\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps.\"\u0026nbsp;\u0026nbsp;Broey puffed his jowls.\u0026nbsp;\u0026nbsp;\"What I don\u0027t understand is how a simple Liaitor could elude my people and Tria.\"\u003c/p\u003e\n\u003cp\u003e\"I think we\u0027ve underestimated this Jedrik.\u0026nbsp;\u0026nbsp;What if she comes from . . .\"\u0026nbsp;\u0026nbsp;His chin jerked ceilingward.\u003c/p\u003e\n\u003cp\u003eBroey considered this.\u0026nbsp;\u0026nbsp;He\u0027d been supervising the interrogation of Bahrank at a secure post deep in the Council Hills when the summons to headquarters had interrupted.\u0026nbsp;\u0026nbsp;The accumulating reports indicated a kind of trouble Chu had known at various times, but never at this magnitude.\u0026nbsp;\u0026nbsp;And Bahrank\u0027s information had been disappointing.\u0026nbsp;\u0026nbsp;He\u0027d delivered this Rim infiltrator named McKie to such and such an address.\u0026nbsp;\u0026nbsp;(Security had been unable to check this in time because of the riots.)\u0026nbsp;\u0026nbsp;Bahrank\u0027s beliefs were obvious.\u0026nbsp;\u0026nbsp;And perhaps the Rimmers were trying to build their own city beyond the mountains.\u0026nbsp;\u0026nbsp;Broey thought this unlikely.\u0026nbsp;\u0026nbsp;His sources in the Rim had proved generally trustworthy and his special source was always trustworthy.\u0026nbsp;\u0026nbsp;Besides, such a venture would require gigantic stocks of food, all of it subject to exposure in the regular accounting.\u0026nbsp;\u0026nbsp;That, after all, was the Liaitor function, why he had . . .\u0026nbsp;\u0026nbsp;No, that was not probable.\u0026nbsp;\u0026nbsp;The Rim subsisted on the lowest of Chu\u0027s leavings and whatever could be wrested from Dosadi\u0027s poisonous soil.\u0026nbsp;\u0026nbsp;No . . .\u0026nbsp;\u0026nbsp;Bahrank was wrong.\u0026nbsp;\u0026nbsp;This McKie was peculiar, but in quite another way.\u0026nbsp;\u0026nbsp;And Jedrik must\u0027ve known this before anyone else - except himself.\u0026nbsp;\u0026nbsp;The paramount question remained:\u0026nbsp;\u0026nbsp;who\u0027d helped her?\u003c/p\u003e\n\u003cp\u003eBroey sighed.\u003c/p\u003e\n\u003cp\u003e\"We have a long association, Gar.\u0026nbsp;\u0026nbsp;A person of your powers who has worked his way from the Rim through the Warrens . . .\"\u003c/p\u003e\n\u003cp\u003eGar understood.\u0026nbsp;\u0026nbsp;He was being told that Broey looked upon him with active suspicion.\u0026nbsp;\u0026nbsp;There\u0027d never been any real trust between them, but this was something else:\u0026nbsp;\u0026nbsp;nothing openly spoken, nothing direct or specific, but the meaning clear.\u0026nbsp;\u0026nbsp;It was not even sly; it was merely Dosadi.\u003c/p\u003e\n\u003cp\u003eFor a moment, Gar didn\u0027t know which way to turn.\u0026nbsp;\u0026nbsp;There\u0027d always been this possibility in his relationship with Broey, but long acceptance had lulled Gar into a dangerous dependency.\u0026nbsp;\u0026nbsp;Tria had been his most valuable counter.\u0026nbsp;\u0026nbsp;He needed her now, but she had other, much more demanding, duties at this juncture.\u003c/p\u003e\n\u003cp\u003eGar realized now that he would have to precipitate his own plans, calling in all of the debts and dependencies which were his due.\u0026nbsp;\u0026nbsp;He was distracted by the sound of many people hurrying past in the outer hall.\u0026nbsp;\u0026nbsp;Presumably, things were coming to a head faster than expected.\u003c/p\u003e\n\u003cp\u003eGar stood up, stared vaguely out the windows at those dark shadows in the night which were the Rim cliffs.\u0026nbsp;\u0026nbsp;While waiting for Broey, Gar had watched darkness settle there, watched the spots of orange appear which were the Rim\u0027s cookfires.\u0026nbsp;\u0026nbsp;Gar knew those cookfires, knew the taste of the food which came from them, knew the flesh-dragging dullness which dominated existence out there.\u0026nbsp;\u0026nbsp;Did Broey expect him to flee back to that?\u0026nbsp;\u0026nbsp;Broey would be astonished at the alternatives open to Gar.\u003c/p\u003e\n\u003cp\u003e\"I will leave you now,\" Broey said.\u0026nbsp;\u0026nbsp;He arose and waddled from the room.\u0026nbsp;\u0026nbsp;What he meant was:\u0026nbsp;\u0026nbsp;\"Don\u0027t be here when I return.\"\u003c/p\u003e\n\u003cp\u003eGar continued to stare out the windows.\u0026nbsp;\u0026nbsp;He seemed lost in angry reverie.\u0026nbsp;\u0026nbsp;Why hadn\u0027t Tria reported yet?\u0026nbsp;\u0026nbsp;One of Broey\u0027s Gowachin aides came in, fussed over papers on a corner table.\u003c/p\u003e\n\u003cp\u003eIt was actually no more than five minutes that Gar remained standing thus.\u0026nbsp;\u0026nbsp;He shook himself presently, turned, and let himself out of the room.\u003c/p\u003e\n\u003cp\u003eScarcely had he set foot in the outer passage than a troop of Broey\u0027s Gowachin shouldered their way past him into the conference room.\u0026nbsp;\u0026nbsp;They\u0027d been waiting for him to leave.\u003c/p\u003e\n\u003cp\u003eAngry with himself for what he knew he must do, Gar turned left, strode down the hall to the room where he knew he\u0027d find Broey.\u0026nbsp;\u0026nbsp;Three Gowachin wearing Security brassards followed him, but did not interfere.\u0026nbsp;\u0026nbsp;Two more Gowachin guarded Broey\u0027s door, but they hesitated to stop him.\u0026nbsp;\u0026nbsp;Gar\u0027s power had been felt here too long.\u0026nbsp;\u0026nbsp;And Broey, not expecting Gar to follow, had failed to issue specific orders.\u0026nbsp;\u0026nbsp;Gar counted on this.\u003c/p\u003e\n\u003cp\u003eBroey, instructing a group of Gowachin aides, stood over a table cluttered with charts.\u0026nbsp;\u0026nbsp;Yellow light from fixtures directly overhead played shifting shadows on the charts as the aides bent over the table and made notes.\u0026nbsp;\u0026nbsp;Broey broke off at the intrusion, his surprise obvious.\u003c/p\u003e\n\u003cp\u003eGar spoke before Broey could order him removed.\u003c/p\u003e\n\u003cp\u003e\"You still need me to keep you from making the worst mistake of your life.\"\u003c/p\u003e\n\u003cp\u003eBroey straightened, did not speak, but the invitation for Gar to continue was there.\u003c/p\u003e\n\u003cp\u003e\"Jedrik\u0027s playing you like a fine instrument.\u0026nbsp;\u0026nbsp;You\u0027re doing precisely what she wants you to do.\"\u003c/p\u003e\n\u003cp\u003eBroey\u0027s cheeks puffed.\u0026nbsp;\u0026nbsp;The shrug angered Gar.\u003c/p\u003e\n\u003cp\u003e\"When I first came here, Broey, I took certain precautions to insure my continued health should you ever consider violence against me.\"\u003c/p\u003e\n\u003cp\u003eAgain, Broey gave that maddening Gowachin shrug.\u0026nbsp;\u0026nbsp;This was all so mundane.\u0026nbsp;\u0026nbsp;Why else did this fool Human continue alive and at liberty?\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve never been able to discover what I did to insure myself against you,\" Gar said.\u0026nbsp;\u0026nbsp;\"I have no addictions.\u0026nbsp;\u0026nbsp;I\u0027m a prudent person and, naturally, have means of dying before your experts on pain could overcome my reason.\u0026nbsp;\u0026nbsp;I\u0027ve done all of the things you might expect of me . . . and something more, something you now need desperately to know.\"\u003c/p\u003e\n\u003cp\u003e\"I have my own precautions, Gar.\"\u003c/p\u003e\n\u003cp\u003e\"Of course, and I admit I don\u0027t know what they are.\"\u003c/p\u003e\n\u003cp\u003e\"So what do you propose?\"\u003c/p\u003e\n\u003cp\u003eGar gave a little laugh, not quite gloating.\u003c/p\u003e\n\u003cp\u003e\"You know my terms.\"\u003c/p\u003e\n\u003cp\u003eBroey shook his head from side to side, an exquisitely Human gesture.\u003c/p\u003e\n\u003cp\u003e\"Share the rule?\u0026nbsp;\u0026nbsp;I\u0027m astonished at you, Gar.\"\u003c/p\u003e\n\u003cp\u003e\"Your astonishment hasn\u0027t reached its limits.\u0026nbsp;\u0026nbsp;You don\u0027t know what I\u0027ve really done.\"\u003c/p\u003e\n\u003cp\u003e\"Which is?\"\u003c/p\u003e\n\u003cp\u003e\"Shall we retire to a more private place and discuss it?\"\u003c/p\u003e\n\u003cp\u003eBroey looked around at his aides, waved for them to leave.\u003c/p\u003e\n\u003cp\u003e\"We will talk here.\"\u003c/p\u003e\n\u003cp\u003eGar waited until he heard the door close behind him on the last of the departing aides.\u003c/p\u003e\n\u003cp\u003e\"You probably know about the death fanatics we\u0027ve groomed in the Human enclaves.\"\u003c/p\u003e\n\u003cp\u003e\"We are prepared to deal with them.\"\u003c/p\u003e\n\u003cp\u003e\"Properly motivated, fanatics can keep great secrets, Broey.\"\u003c/p\u003e\n\u003cp\u003e\"No doubt.\u0026nbsp;\u0026nbsp;Are you now going to reveal such a secret?\"\u003c/p\u003e\n\u003cp\u003e\"For years now, my fanatics have lived on reduced rations, preserving and exporting their surplus rations to the Rim.\u0026nbsp;\u0026nbsp;We have enough, megatons of food out there.\u0026nbsp;\u0026nbsp;With a whole planet in which to hide it, you\u0027ll never find it.\u0026nbsp;\u0026nbsp;City food, every bit of it and we will . . .\"\u003c/p\u003e\n\u003cp\u003e\"Another city!\"\u003c/p\u003e\n\u003cp\u003e\"More than that.\u0026nbsp;\u0026nbsp;Every weapon the city of Chu has, we have.\"\u003c/p\u003e\n\u003cp\u003eBroey\u0027s ventricle lips went almost green with anger.\u003c/p\u003e\n\u003cp\u003e\"So you never really left the Rim?\"\u003c/p\u003e\n\u003cp\u003e\"The Rim-born cannot forget.\"\u003c/p\u003e\n\u003cp\u003e\"After all that Chu has done for you . . .\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you didn\u0027t mention blasphemy.\"\u003c/p\u003e\n\u003cp\u003e\"But the Gods of the Veil gave us a mandate!\"\u003c/p\u003e\n\u003cp\u003e\"Divide and rule, subdivide and rule even more powerfully, fragment and rule absolutely.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not what I meant.\"\u0026nbsp;\u0026nbsp;Broey breathed deeply several times to restore his calm.\u0026nbsp;\u0026nbsp;\"One city and only one city.\u0026nbsp;\u0026nbsp;That is our mandate.\"\u003c/p\u003e\n\u003cp\u003e\"But the other city will be built.\"\u003c/p\u003e\n\u003cp\u003e\"Will it?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve dug in the factories to provide our own weapons and food.\u0026nbsp;\u0026nbsp;If you move against our people inside Chu, we\u0027ll come at you from the outside, shatter your walls and . . .\"\u003c/p\u003e\n\u003cp\u003e\"What do you propose?\"\u003c/p\u003e\n\u003cp\u003e\"Open cooperation for a separation of the species, one city for Gowachin, one for Human.\u0026nbsp;\u0026nbsp;What you do in Chu will be your own business then, but I\u0027ll tell you that we of the new city will rid ourselves of the DemoPol and its aristocracy.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d create another aristocracy?\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps.\u0026nbsp;\u0026nbsp;But my people will die for the vision of freedom we share.\u0026nbsp;\u0026nbsp;We no longer provide our bodies for Chu!\"\u003c/p\u003e\n\u003cp\u003e\"So that\u0027s why your fanatics are all Rim-born.\"\u003c/p\u003e\n\u003cp\u003e\"I see that you don\u0027t yet understand, Broey.\u0026nbsp;\u0026nbsp;My people are not merely Rim-born; they are willing, even eager, to die for their vision.\"\u003c/p\u003e\n\u003cp\u003eBroey considered this.\u0026nbsp;\u0026nbsp;It was a difficult concept for a Gowachin, whose Graluz guilt was always transformed into a profound respect for the survival drive.\u0026nbsp;\u0026nbsp;But he saw where Gar\u0027s words must lead, and he built an image in his mind of fleshly Human waves throwing themselves onto all opposition without inhibitions about pain, death, or survival in any respect.\u0026nbsp;\u0026nbsp;They might very well capture Chu.\u0026nbsp;\u0026nbsp;The idea that countless Rim immigrants lived within Chu\u0027s walls in readiness for such sacrifice filled him with deep disquiet.\u0026nbsp;\u0026nbsp;It required strong self-control to conceal this reaction.\u0026nbsp;\u0026nbsp;He did not for an instant doubt Gar\u0027s story.\u0026nbsp;\u0026nbsp;It was just the kind of thing this dry-fleshed Rimmer would do.\u0026nbsp;\u0026nbsp;But why was Gar revealing this now?\u003c/p\u003e\n\u003cp\u003e\"Did Jedrik order you to prepare me for . . .\"\u003c/p\u003e\n\u003cp\u003e\"Jedrik isn\u0027t part of our plan.\u0026nbsp;\u0026nbsp;She complicates matters for us, but the kind of upset she\u0027s igniting is just the sort of thing we can exploit better than you.\"\u003c/p\u003e\n\u003cp\u003eBroey weighed this with what he knew about Gar, found it valid as far as it went, but it still did not answer the basic question.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not ready to sacrifice my people,\" Gar said.\u003c/p\u003e\n\u003cp\u003eThat had the ring of partial truth.\u0026nbsp;\u0026nbsp;Gar had shown many times that he could make hard decisions.\u0026nbsp;\u0026nbsp;But numbered among his fanatic hordes there doubtless were certain skills he\u0027d prefer not losing - not yet.\u0026nbsp;\u0026nbsp;Yes, that was the way Gar\u0027s mind worked.\u0026nbsp;\u0026nbsp;And Gar would know the profound respect for life which matured in a Gowachin breast after the weeding frenzy.\u0026nbsp;\u0026nbsp;Gowachin, too, could make bloody decisions, but the guilt . . . oh, the guilt . . .\u0026nbsp;\u0026nbsp;Gar counted on the guilt.\u0026nbsp;\u0026nbsp;Perhaps he counted too much.\u003c/p\u003e\n\u003cp\u003e\"Surely, you don\u0027t expect me to take an open and active part in your Rim city project?\"\u003c/p\u003e\n\u003cp\u003e\"If not open, then passive.\"\u003c/p\u003e\n\u003cp\u003e\"And you insist on sharing the rule of Chu?\"\u003c/p\u003e\n\u003cp\u003e\"For the interim.\"\u003c/p\u003e\n\u003cp\u003e\"Impossible!\"\u003c/p\u003e\n\u003cp\u003e\"In substance if not in name.\"\u003c/p\u003e\n\u003cp\u003e\"You have been my advisor.\"\u003c/p\u003e\n\u003cp\u003e\"Will you precipitate violence between us with Jedrik standing there to pick up whatever she can gain from us?\"\u003c/p\u003e\n\u003cp\u003e\"Ahhhhhh . . .\" Broey nodded.\u003c/p\u003e\n\u003cp\u003eSo that was it!\u0026nbsp;\u0026nbsp;Gar was not part of this Jedrik thing.\u0026nbsp;\u0026nbsp;Gar was afraid of Jedrik, more afraid of her than he was of Broey.\u0026nbsp;\u0026nbsp;This gave Broey cause for caution.\u0026nbsp;\u0026nbsp;Gar was not easily made fearful.\u0026nbsp;\u0026nbsp;What did he know of this Jedrik that Broey did not know?\u0026nbsp;\u0026nbsp;But now there was a sufficient reason for compromise.\u0026nbsp;\u0026nbsp;The unanswered questions could be answered later.\u003c/p\u003e\n\u003cp\u003e\"You will continue as my chief advisor,\" Broey said.\u003c/p\u003e\n\u003cp\u003eIt was acceptable.\u0026nbsp;\u0026nbsp;Gar signified his consent by a curt nod.\u003c/p\u003e\n\u003cp\u003eThe compromise left an empty feeling in Broey\u0027s digestive nodes, though.\u0026nbsp;\u0026nbsp;Gar knew he\u0027d been manipulated to reveal his fear of Jedrik.\u0026nbsp;\u0026nbsp;Gar could be certain that Broey would try to neutralize the Rim city project.\u0026nbsp;\u0026nbsp;But the magnitude of Gar\u0027s plotting went far beyond expectations, leaving too many unknowns.\u0026nbsp;\u0026nbsp;One could not make accurate decisions with insufficient data.\u0026nbsp;\u0026nbsp;Gar had given away information without receiving an equal exchange.\u0026nbsp;\u0026nbsp;That was not like Gar.\u0026nbsp;\u0026nbsp;Or was that a correct interpretation of what\u0027d happened here?\u0026nbsp;\u0026nbsp;Broey knew he had to explore this, risking one piece of accurate information as bait.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s been a recent increase of mystical experiences by Gowachin in the Warrens.\"\u003c/p\u003e\n\u003cp\u003e\"You know better than to try that religious nonsense on me!\"\u003c/p\u003e\n\u003cp\u003eGar was actually angry.\u003c/p\u003e\n\u003cp\u003eBroey concealed his amusement.\u0026nbsp;\u0026nbsp;Gar did not know then (or did not accept) that the God of the Veil sometimes created illusions in his flock, that God spoke truly to his anointed and would even answer some questions.\u003c/p\u003e\n\u003cp\u003eMuch had been revealed here, more than Gar suspected.\u0026nbsp;\u0026nbsp;Bahrank had been right.\u0026nbsp;\u0026nbsp;And Jedrik would know about Gar\u0027s Rim city.\u0026nbsp;\u0026nbsp;It was possible that Jedrik wanted Broey to know and had maneuvered Gar into revealing the plot.\u0026nbsp;\u0026nbsp;If Gar saw this, that would be enough to make him fearful.\u003c/p\u003e\n\u003cp\u003eWhy didn\u0027t the God reveal this to me? Broey wondered.\u0026nbsp;\u0026nbsp;Am I being tested?\u003c/p\u003e\n\u003cp\u003eYes, that had to be the answer, because there was one thing certain now:\u003c/p\u003e\n\u003cp\u003eThis time, I\u0027ll do what the God advises. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dosadi-experiment-consentiency-universe-2/page-14.html","bookId":2173,"creation":"Oct 5, 2019 6:40:19 PM","modification":"Oct 5, 2019 6:40:19 PM"}
