{"id":99194,"no":17,"title":"Page 17","content":"\u003cp\u003eWe are plagued by a corrupt polity which promotes unlawful and/or immoral behavior.\u0026nbsp;\u0026nbsp;Public interest has no practical significance in everyday behavior among the ruling factions.\u0026nbsp;\u0026nbsp;The real problems of our world are not being confronted by those in power.\u0026nbsp;\u0026nbsp;In the guise of public service, they use whatever comes to hand for personal gain.\u0026nbsp;\u0026nbsp;They are insane with and for power.\u003c/p\u003e\n\u003cp\u003e- From a clandestine document circulated on Dosadi\u003c/p\u003e\n\u003cp\u003eIt was dark when a disguised Jedrik and undisguised McKie emerged onto the streets.\u0026nbsp;\u0026nbsp;She led them down narrow passages, her mind full of things McKie had revealed.\u0026nbsp;\u0026nbsp;Jedrik wore a blonde wig and puff-out disguise which made her appear heavy and hunched.\u003c/p\u003e\n\u003cp\u003eAs they passed an open courtyard, McKie heard music.\u0026nbsp;\u0026nbsp;He almost stumbled.\u0026nbsp;\u0026nbsp;The music came from a small orchestra - delicate tympany, soft strings, and a rich chorus of wind instruments.\u0026nbsp;\u0026nbsp;He did not recognize the melody, but it moved him more deeply than any other music of his experience.\u0026nbsp;\u0026nbsp;It was as though the music were played only for him.\u0026nbsp;\u0026nbsp;Aritch and company had said nothing about such magnificent music here.\u003c/p\u003e\n\u003cp\u003ePeople still thronged the streets in numbers which astonished him.\u0026nbsp;\u0026nbsp;But now they appeared to pay him little notice.\u003c/p\u003e\n\u003cp\u003eJedrik kept part of her attention on McKie, noting the fools with their musical dalliance, noting how few people there were on the streets - little more than her own patrols in this quarter.\u0026nbsp;\u0026nbsp;She\u0027d expected that, but the actuality held an eerie mood in the dim and scattered illumination from lighted corners.\u003c/p\u003e\n\u003cp\u003eShe had debated providing McKie with a crude disguise, but he obviously didn\u0027t have the cunning to carry off the double deception she required.\u0026nbsp;\u0026nbsp;She\u0027d begun to sense a real intelligence in him, though.\u0026nbsp;\u0026nbsp;McKie was an enigma.\u0026nbsp;\u0026nbsp;Why had he never encountered the opportunities to sharpen that intelligence?\u0026nbsp;\u0026nbsp;Sensing the sharpness in him, she could not put off the thought that she had missed something vital in his accounts of that social entity which he called the ConSentiency.\u0026nbsp;\u0026nbsp;Whether this failure came from actual concealment by McKie or through his inadequacies, she was not yet willing to judge.\u0026nbsp;\u0026nbsp;The enigma set her on edge.\u0026nbsp;\u0026nbsp;And the mood in the streets did nothing to ease her emotions.\u0026nbsp;\u0026nbsp;She was glad when they crossed the line into the area completely controlled by her own personal cell.\u003c/p\u003e\n\u003cp\u003eThe bait having been trailed through the streets by one who would appear a tame underling, Jedrik allowed herself a slight relaxation.\u0026nbsp;\u0026nbsp;Broey would have learned by this time about the killing of Tria\u0027s double agent.\u0026nbsp;\u0026nbsp;He would react to that and to the new bait.\u0026nbsp;\u0026nbsp;It was almost time for phase two of her design for Broey.\u003c/p\u003e\n\u003cp\u003eMcKie followed her without question, acutely aware of every strange glance cast their way.\u0026nbsp;\u0026nbsp;He was emptied of all resistance, knowing he could not survive if he failed to follow Jedrik through the smelly, repellent darkness of her streets.\u003c/p\u003e\n\u003cp\u003eThe food from the restaurant sat heavily in his stomach.\u0026nbsp;\u0026nbsp;It had been tasty:\u0026nbsp;\u0026nbsp;a stew of odd shapes full of shredded greenery, and steaming hot.\u0026nbsp;\u0026nbsp;But he could not shake the realization that his stew had been compounded of someone\u0027s garbage.\u003c/p\u003e\n\u003cp\u003eJedrik had left him very little.\u0026nbsp;\u0026nbsp;She hadn\u0027t learned of the Taprisiot, or the bead in his stomach which probably would not link him to the powers of the ConSentiency if he died.\u0026nbsp;\u0026nbsp;She had not learned of the standard BuSab implantation devices which amplified his senses.\u0026nbsp;\u0026nbsp;And, oddly, she had not explored many of his revelations about BuSab.\u0026nbsp;\u0026nbsp;She\u0027d seemed much more interested in the money hidden about his person and had taken possession of all of it.\u0026nbsp;\u0026nbsp;She\u0027d examined the currency carefully.\u003c/p\u003e\n\u003cp\u003e\"This is real.\"\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t sure, but he thought she\u0027d been surprised.\u003c/p\u003e\n\u003cp\u003e\"This was given to you before you were sent to Dosadi?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eShe was a while absorbing the implications, but appeared satisfied.\u0026nbsp;\u0026nbsp;She\u0027d given him a few small currency tokens from her own pockets.\u003c/p\u003e\n\u003cp\u003e\"Nobody\u0027ll bother you for these.\u0026nbsp;\u0026nbsp;If you need anything, ask.\u0026nbsp;\u0026nbsp;We may be able to gratify some of your needs.\"\u003c/p\u003e\n\u003cp\u003eIt was still dark, lighted only by illumination at corners, when they came to the address Jedrik sought.\u0026nbsp;\u0026nbsp;Grey light suffused the street.\u0026nbsp;\u0026nbsp;A young Human male of about ten squatted with his back against the stone wall at the building\u0027s corner.\u0026nbsp;\u0026nbsp;As Jedrik and McKie approached, he sprang up, alert.\u0026nbsp;\u0026nbsp;He nodded once to Jedrik.\u003c/p\u003e\n\u003cp\u003eShe did not acknowledge, but by some hidden signal the boy knew she had received his message.\u0026nbsp;\u0026nbsp;He relaxed once more against the wall.\u003c/p\u003e\n\u003cp\u003eWhen McKie looked back a few paces beyond where the boy had signaled, he was gone.\u0026nbsp;\u0026nbsp;No sound, no sign just gone.\u003c/p\u003e\n\u003cp\u003eJedrik stopped at a shadowed entryway.\u0026nbsp;\u0026nbsp;It was barred by an openwork metal gate flanked by two armed guards.\u0026nbsp;\u0026nbsp;The guards opened the gate without words.\u0026nbsp;\u0026nbsp;Beyond the gate there was a large, covered courtyard illuminated by glowing tubes on right and left.\u0026nbsp;\u0026nbsp;Three of its sides were piled to the courtyard cover with boxes of various sizes - some taller than a Human and narrow, others short and fat.\u0026nbsp;\u0026nbsp;Set into the stacks as though part of the courtyard\u0027s walls was one narrow passage leading to a metal door opposite the gateway.\u003c/p\u003e\n\u003cp\u003eMcKie touched Jedrik\u0027s arm.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s in the boxes?\"\u003c/p\u003e\n\u003cp\u003e\"Weapons.\"\u0026nbsp;\u0026nbsp;She spoke as though to a cretin.\u003c/p\u003e\n\u003cp\u003eThe metal door was opened from within.\u0026nbsp;\u0026nbsp;Jedrik led McKie into a large room at least two stories tall.\u0026nbsp;\u0026nbsp;The door clanged shut behind them.\u0026nbsp;\u0026nbsp;McKie sensed several Humans along the courtyard wall on both sides of him, but his attention had been captured by something else.\u003c/p\u003e\n\u003cp\u003eDominating the room was a gigantic cage suspended from the ceiling.\u0026nbsp;\u0026nbsp;Its bars sparkled and shimmered with hidden energies.\u0026nbsp;\u0026nbsp;A single Gowachin male sat cross-legged in a hammock at the cage\u0027s center.\u0026nbsp;\u0026nbsp;McKie had seldom seen a ConSentient Gowachin that aged.\u0026nbsp;\u0026nbsp;His nose crest was fringed by flaking yellow crusts.\u0026nbsp;\u0026nbsp;Heavy wrinkles wormed their way beneath watery eyes beginning to glaze with the degeneration which often blinded Gowachin who lived too long away from water.\u0026nbsp;\u0026nbsp;His body had a slack appearance, with loose muscles and pitted indentations along the nodes between his ventricles.\u0026nbsp;\u0026nbsp;The hammock suspended him off the cage floor and that floor shimmered with volatile energies.\u003c/p\u003e\n\u003cp\u003eJedrik paused, divided her attention between McKie and the old Gowachin.\u0026nbsp;\u0026nbsp;She seemed to expect a particular reaction from McKie, but he wasn\u0027t certain she found what she sought.\u003c/p\u003e\n\u003cp\u003eMcKie stood a moment in silent examination of the Gowachin.\u0026nbsp;\u0026nbsp;Prisoner?\u0026nbsp;\u0026nbsp;What was the significance of that cage and its shimmering energies?\u0026nbsp;\u0026nbsp;Presently, he glanced around the room, recording the space.\u0026nbsp;\u0026nbsp;Six armed Human males flanked the door through which he and Jedrik had entered.\u0026nbsp;\u0026nbsp;A remarkable assortment of objects crammed the room\u0027s walls, some with purpose unknown to him but many recognizable as weapons:\u0026nbsp;\u0026nbsp;spears and swords, flame-throwers, garish armor, bombs, pellet projectors . . .\u003c/p\u003e\n\u003cp\u003eJedrik moved a pace closer to the cage.\u0026nbsp;\u0026nbsp;The occupant stared back at her with faint interest.\u0026nbsp;\u0026nbsp;She cleared her throat.\u003c/p\u003e\n\u003cp\u003e\"Greetings, Pcharky.\u0026nbsp;\u0026nbsp;I have found my key to the God Wall.\"\u003c/p\u003e\n\u003cp\u003eThe old Gowachin remained silent, but McKie thought he saw a sparkle of interest in the glazed eyes.\u003c/p\u003e\n\u003cp\u003eJedrik shook her head slowly from side to side, then:\u0026nbsp;\u0026nbsp;\"I have a new datum, Pcharky.\u0026nbsp;\u0026nbsp;The Veil of Heaven was created by creatures called Calebans.\u0026nbsp;\u0026nbsp;They appear to us as suns.\"\u003c/p\u003e\n\u003cp\u003ePcharky\u0027s glance flickered to McKie, back to Jedrik.\u0026nbsp;\u0026nbsp;The Gowachin knew the source of her new datum.\u003c/p\u003e\n\u003cp\u003eMcKie renewed his speculations about the old Gowachin.\u0026nbsp;\u0026nbsp;That cage must be a prison, its walls enforced by dangerous energies.\u0026nbsp;\u0026nbsp;Bahrank had spoken of conflict between the species.\u0026nbsp;\u0026nbsp;Humans controlled this room.\u0026nbsp;\u0026nbsp;Why did they imprison a Gowachin?\u0026nbsp;\u0026nbsp;Or . . . was this caged Gowachin, this Pcharky, another agent from Tandaloor?\u0026nbsp;\u0026nbsp;With a tightening of his throat, McKie wondered if his own fate might be to live out his days in such a cage.\u003c/p\u003e\n\u003cp\u003ePcharky grunted, then:\u003c/p\u003e\n\u003cp\u003e\"The God Wall is like this cage but more powerful.\"\u0026nbsp;\u0026nbsp;His voice was a husky croaking, the words clear Galach with an obvious Tandaloor accent.\u0026nbsp;\u0026nbsp;McKie, his fears reinforced, glanced at Jedrik, found her studying him.\u0026nbsp;\u0026nbsp;She spoke.\u003c/p\u003e\n\u003cp\u003e\"Pcharky has been with us for a long time, very long.\u0026nbsp;\u0026nbsp;There\u0027s no telling how many people he has helped to escape from Dosadi.\u0026nbsp;\u0026nbsp;Soon, I may persuade him to be of service to me.\"\u003c/p\u003e\n\u003cp\u003eMcKie found himself shocked to silence by the possibilities glimpsed through her words.\u0026nbsp;\u0026nbsp;Was Dosadi in fact an investigation of the Caleban mystery?\u0026nbsp;\u0026nbsp;Was that the secret Aritch\u0027s people concealed here?\u0026nbsp;\u0026nbsp;McKie stared at the shimmering bars of Pcharky\u0027s cage.\u0026nbsp;\u0026nbsp;Like the God Wall?\u0026nbsp;\u0026nbsp;But the God Wall was enforced by a Caleban.\u003c/p\u003e\n\u003cp\u003eOnce more, Jedrik looked at the caged Gowachin.\u003c/p\u003e\n\u003cp\u003e\"A sun confines enormous energies, Pcharky.\u0026nbsp;\u0026nbsp;Are your energies inadequate?\"\u003c/p\u003e\n\u003cp\u003eBut Pcharky\u0027s attention was on McKie.\u0026nbsp;\u0026nbsp;The old voice croaked.\u003c/p\u003e\n\u003cp\u003e\"Human, tell me:\u0026nbsp;\u0026nbsp;Did you come here willingly?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t answer him,\" Jedrik snapped.\u003c/p\u003e\n\u003cp\u003ePcharky closed his eyes.\u0026nbsp;\u0026nbsp;Interview ended.\u003c/p\u003e\n\u003cp\u003eJedrik, accepting this, whirled and strode to the left around the cage.\u003c/p\u003e\n\u003cp\u003e\"Come along, McKie.\"\u0026nbsp;\u0026nbsp;She didn\u0027t look back, but continued speaking.\u0026nbsp;\u0026nbsp;\"Does it interest you that Pcharky designed his own cage?\"\u003c/p\u003e\n\u003cp\u003e\"He designed it?\u0026nbsp;\u0026nbsp;Is it a prison?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"If he designed it . . . how does it hold him?\"\u003c/p\u003e\n\u003cp\u003e\"He knew he\u0027d have to serve my purposes if he were to remain alive.\"\u003c/p\u003e\n\u003cp\u003eShe had come to another door which opened onto a narrow stairway.\u0026nbsp;\u0026nbsp;It climbed to the left around the cage room.\u0026nbsp;\u0026nbsp;They emerged into a long hallway lined with narrow doors dimly lighted by tiny overhead bulbs.\u0026nbsp;\u0026nbsp;Jedrik opened one of these doors and led the way into a carpeted room about four meters wide and six long.\u0026nbsp;\u0026nbsp;Dark wood panels reached from floor to waist level, shelves loaded with books above.\u0026nbsp;\u0026nbsp;McKie peered closely:\u0026nbsp;\u0026nbsp;books . . . actual paper books.\u0026nbsp;\u0026nbsp;He tried to recall where he\u0027d ever before seen such a collection of primitive . . .\u0026nbsp;\u0026nbsp;But, of course, these were not primitive.\u0026nbsp;\u0026nbsp;These were one of Dosadi\u0027s strange recapitulations.\u003c/p\u003e\n\u003cp\u003eJedrik had removed her wig, stopped midway in the room to turn and face McKie.\u003c/p\u003e\n\u003cp\u003e\"This is my room.\u0026nbsp;\u0026nbsp;Toilet there.\"\u0026nbsp;\u0026nbsp;She pointed to an opening between shelves.\u0026nbsp;\u0026nbsp;\"That window . . .\"\u0026nbsp;\u0026nbsp;Again, she pointed, this time to an opening opposite the toilet door.\u0026nbsp;\u0026nbsp;\". . . is one-way to admit light, and it\u0027s our best.\u0026nbsp;\u0026nbsp;As Dosadi measures such things, this is a relatively secure place.\"\u003c/p\u003e\n\u003cp\u003eHe swept his gaze around the room.\u003c/p\u003e\n\u003cp\u003eHer room?\u003c/p\u003e\n\u003cp\u003eMcKie was struck by the amount of living space, a mark of power on Dosadi; the absence of people in the hall.\u0026nbsp;\u0026nbsp;By the standards of this planet, Jedrik\u0027s room, this building, represented a citadel of power.\u003c/p\u003e\n\u003cp\u003eJedrik spoke, an odd note of nervousness in voice and manner:\u003c/p\u003e\n\u003cp\u003e\"Until recently, I also had other quarters:\u0026nbsp;\u0026nbsp;a prestigious apartment on the slopes of the Council Hills.\u0026nbsp;\u0026nbsp;I was considered a climber with excellent prospects, my own skitter and driver.\u0026nbsp;\u0026nbsp;I had access to all but the highest codes in the master banks, and that\u0027s a powerful tool for those who can use it.\u0026nbsp;\u0026nbsp;Now . . .\"\u0026nbsp;\u0026nbsp;She gestured.\u0026nbsp;\u0026nbsp;\". . . this is what I have chosen.\u0026nbsp;\u0026nbsp;I must eat swill with the lowest.\u0026nbsp;\u0026nbsp;No males of rank will pay the slightest attention to me.\u0026nbsp;\u0026nbsp;Broey thinks I\u0027m cowering somewhere, a pallet in the Warrens.\u0026nbsp;\u0026nbsp;But I have this . . .\"\u0026nbsp;\u0026nbsp;Again, that sweeping gesture.\u0026nbsp;\u0026nbsp;\". . . and this.\"\u0026nbsp;\u0026nbsp;One finger tapped her head.\u0026nbsp;\u0026nbsp;\"I need nothing more to bring those Council Hills crashing down.\"\u003c/p\u003e\n\u003cp\u003eShe stared into McKie\u0027s eyes.\u003c/p\u003e\n\u003cp\u003eHe found himself believing her.\u003c/p\u003e\n\u003cp\u003eShe was not through speaking.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re definitely male Human, McKie.\"\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t know what to make of that, but her air of braggadocio fascinated him.\u003c/p\u003e\n\u003cp\u003e\"How did you lose that other . . .\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t lose it.\u0026nbsp;\u0026nbsp;I threw it away.\u0026nbsp;\u0026nbsp;I no longer needed it.\u0026nbsp;\u0026nbsp;I\u0027ve made things move faster than our precious Elector, or even your people, can anticipate.\u0026nbsp;\u0026nbsp;Broey thinks to wait for an opening against me?\"\u0026nbsp;\u0026nbsp;She shook her head.\u003c/p\u003e\n\u003cp\u003eCaptivated, McKie watched her cross to the window, open a ventilator above it.\u0026nbsp;\u0026nbsp;She kicked a wooden knob below the adjoining bookshelves, pulled out a section of paneling which trailed a double bed.\u0026nbsp;\u0026nbsp;Standing across the bed from McKie, she began to undress.\u0026nbsp;\u0026nbsp;She dropped the wig to the floor, slipped off the coveralls, peeled the bulging inner disguise from her flesh.\u0026nbsp;\u0026nbsp;Her skin was pale cream.\u003c/p\u003e\n\u003cp\u003e\"McKie, I am your teacher.\"\u003c/p\u003e\n\u003cp\u003eHe remained silent.\u0026nbsp;\u0026nbsp;She was long waisted, slim, and graceful.\u0026nbsp;\u0026nbsp;The creamy skin was marked by two faint scars to the left of the pubic wedge.\u003c/p\u003e\n\u003cp\u003e\"Take off your clothes,\" she said.\u003c/p\u003e\n\u003cp\u003eHe swallowed.\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e\"McKie, McKie, to survive here you must become Dosadi.\u0026nbsp;\u0026nbsp;You don\u0027t have much time.\u0026nbsp;\u0026nbsp;Get your clothes off.\"\u003c/p\u003e\n\u003cp\u003eNot knowing what to expect, McKie obeyed.\u003c/p\u003e\n\u003cp\u003eShe watched him carefully.\u003c/p\u003e\n\u003cp\u003e\"Your skin is lighter than I expected where the sun has not darkened you.\u0026nbsp;\u0026nbsp;We will bleach the skin of your face and hands tomorrow.\"\u003c/p\u003e\n\u003cp\u003eMcKie looked at his hands, at the sharp line where his cuffs had protected his arms.\u0026nbsp;\u0026nbsp;Dark skin.\u0026nbsp;\u0026nbsp;He recalled Bahrank talking of dark skin and a place called Pylash Gate.\u0026nbsp;\u0026nbsp;To mask the unusual shyness he felt, he looked at Jedrik, asked about Pylash Gate.\u003c/p\u003e\n\u003cp\u003e\"So Bahrank mentioned that?\u0026nbsp;\u0026nbsp;Well, it was a stupid mistake.\u0026nbsp;\u0026nbsp;The Rim sent in shock troops and foolish orders were given for the gate\u0027s defenses.\u0026nbsp;\u0026nbsp;Only one troop survived there, all dark-skinned like you.\u0026nbsp;\u0026nbsp;The suspicion of treachery was natural.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003eHe found his attention compelled toward the bed.\u0026nbsp;\u0026nbsp;A dark maroon spread covered it.\u003c/p\u003e\n\u003cp\u003eJedrik approached him around the foot of the bed.\u0026nbsp;\u0026nbsp;She stopped less than a hand\u0027s width away from him . . . creamy flesh, full breasts.\u0026nbsp;\u0026nbsp;He looked up into her eyes.\u0026nbsp;\u0026nbsp;She stood half a head over him, an expression of cold amusement on her face.\u003c/p\u003e\n\u003cp\u003eMcKie found the musky smell of her erotically stimulating.\u0026nbsp;\u0026nbsp;She looked down, saw this, laughed, and abruptly hurled him onto the bed.\u0026nbsp;\u0026nbsp;She landed with him and her body was all over him, hot and hard and demanding.\u003c/p\u003e\n\u003cp\u003eIt was the strangest sexual experience of McKie\u0027s life.\u0026nbsp;\u0026nbsp;Not lovemaking, but violent attack.\u0026nbsp;\u0026nbsp;She groaned, bit at him, clawed.\u0026nbsp;\u0026nbsp;And when he tried to caress her, she became even more violent, frenzied.\u0026nbsp;\u0026nbsp;Through it all, she was oddly careful of his pleasure, watching his reactions, reading him.\u0026nbsp;\u0026nbsp;When it was over, he lay back, spent.\u0026nbsp;\u0026nbsp;Jedrik sat up on the edge of the bed.\u0026nbsp;\u0026nbsp;The blankets were a twisted mess.\u0026nbsp;\u0026nbsp;She grabbed a blanket, threw it across the room, stood up, whirled back to look down at him.\u003c/p\u003e\n\u003cp\u003e\"You are very sly and tricky, McKie.\"\u003c/p\u003e\n\u003cp\u003eHe drew in a trembling breath, remained silent.\u003c/p\u003e\n\u003cp\u003e\"You tried to catch me with softness,\" she accused.\u0026nbsp;\u0026nbsp;\"Better than you have tried that with me.\u0026nbsp;\u0026nbsp;It will not work.\"\u003c/p\u003e\n\u003cp\u003eMcKie marshalled the energy to sit up and restore some order to the bed. His shoulder pained him where she\u0027d scratched.\u0026nbsp;\u0026nbsp;He felt the ache of a bite on his neck.\u0026nbsp;\u0026nbsp;He crawled into the bed, pulled the blankets up to his chin.\u0026nbsp;\u0026nbsp;She was a madwoman, absolutely mad.\u0026nbsp;\u0026nbsp;Insane.\u003c/p\u003e\n\u003cp\u003ePresently, Jedrik stopped looking at him.\u0026nbsp;\u0026nbsp;She recovered the blanket from across the room, spread it on the bed, joined him.\u0026nbsp;\u0026nbsp;He was acutely conscious of her staring at him with an openly puzzled frown.\u003c/p\u003e\n\u003cp\u003e\"Tell me about the relationships between men and women on your worlds.\"\u003c/p\u003e\n\u003cp\u003eHe recounted a few of the love stories he knew, fighting all the while to stay awake.\u0026nbsp;\u0026nbsp;It was difficult to stifle the gaping yawns.\u0026nbsp;\u0026nbsp;She kept punching his shoulder.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t believe it.\u0026nbsp;\u0026nbsp;You\u0027re making this up.\"\u003c/p\u003e\n\u003cp\u003e\"No . . . no.\u0026nbsp;\u0026nbsp;It\u0027s true.\"\u003c/p\u003e\n\u003cp\u003e\"You have women of your own there?\"\u003c/p\u003e\n\u003cp\u003e\"Women of my . . .\u0026nbsp;\u0026nbsp;Well, it\u0027s not like that, not ownership . . . ahhh, not possession.\"\u003c/p\u003e\n\u003cp\u003e\"What about children?\"\u003c/p\u003e\n\u003cp\u003e\"What about them?\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027re they treated, educated?\"\u003c/p\u003e\n\u003cp\u003eHe sighed, sketched in some details from his own childhood.\u003c/p\u003e\n\u003cp\u003eAfter a while she let him go to sleep.\u0026nbsp;\u0026nbsp;He awakened several times during the night, conscious of the strange room and bed, of Jedrik breathing softly beside him.\u0026nbsp;\u0026nbsp;Once, he thought he felt her shoulders shaking with repressed sobs.\u003c/p\u003e\n\u003cp\u003eShortly before dawn, there was a scream in the next block, a terrifying sound of agony loud enough to waken all but the most hardened or the most fatigued.\u0026nbsp;\u0026nbsp;McKie, awake and thinking, felt Jedrik\u0027s breathing change.\u0026nbsp;\u0026nbsp;He lay tense and watchful, awaiting a repetition or another sound which might explain that eerie scream.\u0026nbsp;\u0026nbsp;A threatening silence gripped the night.\u0026nbsp;\u0026nbsp;McKie built an image in his mind of what could be happening in the buildings around them:\u0026nbsp;\u0026nbsp;some people starting from sleep not knowing (perhaps not caring) what had awakened them; lighter sleepers grumbling and sinking back into restless slumber.\u003c/p\u003e\n\u003cp\u003eFinally, McKie sat up, peered into the room\u0027s shadows.\u0026nbsp;\u0026nbsp;His disquiet communicated itself to Jedrik.\u0026nbsp;\u0026nbsp;She rolled over, looked up at him in the pale dawn light now creeping into the shadows.\u003c/p\u003e\n\u003cp\u003e\"There are many noises in the Warrens that you learn to ignore,\" she said.\u003c/p\u003e\n\u003cp\u003eComing from her, it was almost conciliatory, almost a gesture of apology, of friendship.\u003c/p\u003e\n\u003cp\u003e\"Someone screamed,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I knew it must be something like that.\"\u003c/p\u003e\n\u003cp\u003e\"How can you sleep through such a sound?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"But how can you ignore it?\"\u003c/p\u003e\n\u003cp\u003e\"The sounds you ignore are those which aren\u0027t immediately threatening to you, those which you can do nothing about.\"\u003c/p\u003e\n\u003cp\u003e\"Someone was hurt.\"\u003c/p\u003e\n\u003cp\u003e\"Very likely.\u0026nbsp;\u0026nbsp;But you must not burden your soul with things you cannot change.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you want to change . . . that?\"\u003c/p\u003e\n\u003cp\u003e\"I am changing it.\"\u003c/p\u003e\n\u003cp\u003eHer tone, her attitude were those of a lecturer in a schoolroom, and now there was no doubt that she was being deliberately helpful.\u0026nbsp;\u0026nbsp;Well, she\u0027d said she was his teacher.\u0026nbsp;\u0026nbsp;And he must become completely Dosadi to survive.\u003c/p\u003e\n\u003cp\u003e\"How\u0027re you changing things?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not capable of understanding yet.\u0026nbsp;\u0026nbsp;I want you to take it one step at a time, one lesson at a time.\"\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t help asking himself then:\u003c/p\u003e\n\u003cp\u003eWhat does she want from me now?\u003c/p\u003e\n\u003cp\u003eHe hoped it was not more sex.\u003c/p\u003e\n\u003cp\u003e\"Today,\" she said, \"I want you to meet the parents of three children who work in our cell.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dosadi-experiment-consentiency-universe-2/page-17.html","bookId":2173,"creation":"Oct 5, 2019 6:40:19 PM","modification":"Oct 5, 2019 6:40:19 PM"}
