{"id":99198,"no":21,"title":"Page 21","content":"\u003cp\u003eThe attack by those who want to die - this is the attack against which you cannot prepare a perfect defense.\u003c/p\u003e\n\u003cp\u003e- Human aphorism\u003c/p\u003e\n\u003cp\u003eBy the third morning, McKie felt that he might have lived all of his life on Dosadi.\u0026nbsp;\u0026nbsp;The place demanded every element of attention he could muster.\u003c/p\u003e\n\u003cp\u003eHe stood alone in Jedrik\u0027s room, staring absently at the unmade bed.\u0026nbsp;\u0026nbsp;She expected him to put the place in order before her return.\u0026nbsp;\u0026nbsp;He knew that.\u0026nbsp;\u0026nbsp;She\u0027d told him to wait here and had gone away on urgent business.\u0026nbsp;\u0026nbsp;He could only obey.\u003c/p\u003e\n\u003cp\u003eConcerns other than an unmade bed distracted him, though.\u0026nbsp;\u0026nbsp;He felt now that he understood the roots of Aritch\u0027s fears.\u0026nbsp;\u0026nbsp;The Gowachin of Tandaloor might very well destroy this place, even if they knew that by doing so they blasted open that bloody region where every sentient hid his most secret fears.\u0026nbsp;\u0026nbsp;He could see this clearly now.\u0026nbsp;\u0026nbsp;How the Running Phylum expected him to avoid that monstrous decision was a more elusive matter.\u003c/p\u003e\n\u003cp\u003eThere were secrets here.\u003c/p\u003e\n\u003cp\u003eMcKie sensed Dosadi like a malignant organism beneath his feet, jealously keeping those secrets from him.\u0026nbsp;\u0026nbsp;This place was the enemy of the ConSentiency, but he found himself emotionally siding with Dosadi.\u0026nbsp;\u0026nbsp;It was betrayal of BuSab, of his Legum oath, everything.\u0026nbsp;\u0026nbsp;But he could not prevent that feeling or recognition of it.\u0026nbsp;\u0026nbsp;In the course of only a few generations, Dosadi had become a particular thing.\u0026nbsp;\u0026nbsp;Monstrous?\u0026nbsp;\u0026nbsp;Only if you held to your own precious myths.\u0026nbsp;\u0026nbsp;Dosadi might be the greatest cleansing force the ConSentiency had ever experienced.\u003c/p\u003e\n\u003cp\u003eThe whole prospect of the ConSentiency had begun to sicken him.\u0026nbsp;\u0026nbsp;And Aritch\u0027s Gowachin.\u0026nbsp;\u0026nbsp;Gowachin Law?\u0026nbsp;\u0026nbsp;Stuff Gowachin Law!\u003c/p\u003e\n\u003cp\u003eIt was quiet in Jedrik\u0027s room.\u0026nbsp;\u0026nbsp;Painfully quiet.\u003c/p\u003e\n\u003cp\u003eHe knew that out on the streets of Chu there was violent warfare between Gowachin and Human.\u0026nbsp;\u0026nbsp;Wounded had been rushed through the training courtyard while he was there with Jedrik.\u0026nbsp;\u0026nbsp;Afterward, she\u0027d taken him to her command post, a room across the hall and above Pcharky\u0027s cage.\u0026nbsp;\u0026nbsp;He\u0027d stood nearby, watched her performance as though she were a star on an entertainment circuit and he a member of the audience.\u0026nbsp;\u0026nbsp;It was fascinating.\u0026nbsp;\u0026nbsp;Broey will do this.\u0026nbsp;\u0026nbsp;Broey will give that order.\u0026nbsp;\u0026nbsp;And each time, the reports revealed how precisely she had anticipated her opponent.\u003c/p\u003e\n\u003cp\u003eOccasionally, she mentioned Gar or Tria.\u0026nbsp;\u0026nbsp;He was able to detect the subtle difference in her treatment of that pair.\u003c/p\u003e\n\u003cp\u003eOn their second night together, Jedrik had aroused his sexual appetites softly, deftly.\u0026nbsp;\u0026nbsp;She had treated him to a murmurous compliance, and afterward had leaned over him on an elbow to smile coldly.\u003c/p\u003e\n\u003cp\u003e\"You see, McKie:\u0026nbsp;\u0026nbsp;I can play your game.\"\u003c/p\u003e\n\u003cp\u003eShockingly, this had opened an area of awareness within him which he\u0027d not even suspected.\u0026nbsp;\u0026nbsp;It was as though she\u0027d held up his entire previous life to devastating observation.\u003c/p\u003e\n\u003cp\u003eAnd he was the observer!\u003c/p\u003e\n\u003cp\u003eOther beings formed lasting relationships and operated from a secure emotional base.\u0026nbsp;\u0026nbsp;But he was a product of BuSab, the Gowachin . . . and much that had gone before.\u0026nbsp;\u0026nbsp;It had become increasingly obvious to him why the Gowachin had chosen him to groom for this particular role.\u003c/p\u003e\n\u003cp\u003eI was damaged and they could rebuild me the way they wanted!\u003c/p\u003e\n\u003cp\u003eWell, the Gowachin could still be surprised by what they produced.\u0026nbsp;\u0026nbsp;Dosadi was evidence of that.\u0026nbsp;\u0026nbsp;They might not even suspect what they\u0027d actually produced in McKie.\u003c/p\u003e\n\u003cp\u003eHe was bitter with a bitterness he knew must\u0027ve been fermenting in him for years.\u0026nbsp;\u0026nbsp;The loneliness of his own life with its central dedication to BuSab had been brought to a head by the loneliness of this imprisoned planet.\u0026nbsp;\u0026nbsp;An incredible jumble of emotions had sorted themselves out, and he felt new purpose burning within him.\u003c/p\u003e\n\u003cp\u003ePower!\u003c/p\u003e\n\u003cp\u003eAhhhh . . . that was how it felt to be Dosadi!\u003c/p\u003e\n\u003cp\u003eHe\u0027d turned away from Jedrik\u0027s cold smile, pulled the blankets around his shoulder.\u003c/p\u003e\n\u003cp\u003eThank you, loving teacher.\u003c/p\u003e\n\u003cp\u003eSuch thoughts roamed through his mind as he stood alone in the room the following day and began to make the bed.\u0026nbsp;\u0026nbsp;After her revelation, Jedrik had resumed her interest in his memories, napping only to awaken him with more questions.\u003c/p\u003e\n\u003cp\u003eIn spite of his sour outlook, he still felt it his duty to examine her behavior in every possible light his imagination could produce.\u0026nbsp;\u0026nbsp;Nothing about Dosadi was too absurd.\u0026nbsp;\u0026nbsp;He had to build a better picture of this society and its driving forces.\u003c/p\u003e\n\u003cp\u003eBefore returning to Jedrik\u0027s room, he\u0027d made another tour of the training courtyard with her.\u0026nbsp;\u0026nbsp;There\u0027d been more new weapons adapted from his kit, and he\u0027d realized the courtyard was merely Jedrik\u0027s testing ground, that there must be many more training areas for her followers.\u003c/p\u003e\n\u003cp\u003eMcKie had not yet revealed to her that Aritch\u0027s people might terminate Dosadi\u0027s people with violence.\u0026nbsp;\u0026nbsp;Shed been centering on this at dawn.\u0026nbsp;\u0026nbsp;Even while they shared the tiny toilet cubicle off her room she\u0027d pressed for answers.\u003c/p\u003e\n\u003cp\u003eFor a time, McKie had diverted her with questions about Pcharky.\u0026nbsp;\u0026nbsp;What were the powers in that cage?\u0026nbsp;\u0026nbsp;At one point, he\u0027d startled her.\u003c/p\u003e\n\u003cp\u003e\"Pcharky knows something valuable he hopes to trade for his freedom.\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027d you know?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s obvious.\u0026nbsp;\u0026nbsp;I\u0027ll tell you something else:\u0026nbsp;\u0026nbsp;he came here of his own free will . . . for whatever purpose.\"\u003c/p\u003e\n\u003cp\u003e\"You learn quickly, McKie.\"\u003c/p\u003e\n\u003cp\u003eShe was laughing at him and he glared at her.\u003c/p\u003e\n\u003cp\u003e\"All right!\u0026nbsp;\u0026nbsp;I don\u0027t know that purpose, but it may be that you only think you know it.\"\u003c/p\u003e\n\u003cp\u003eFor the briefest flicker, something dangerous glared from her eyes, then:\u003c/p\u003e\n\u003cp\u003e\"Your jumpdoors have brought us many fools, but Pcharky is one of the biggest fools.\u0026nbsp;\u0026nbsp;I know why he came.\u0026nbsp;\u0026nbsp;There\u0027ve been many like him.\u0026nbsp;\u0026nbsp;Now . . . there is only one.\u0026nbsp;\u0026nbsp;Broey, for all of his power, cannot search out his own Pcharky.\u0026nbsp;\u0026nbsp;And Keila Jedrik is the one who frustrates him.\"\u003c/p\u003e\n\u003cp\u003eToo late, she realized that McKie had goaded her into this performance.\u0026nbsp;\u0026nbsp;How had he done that?\u0026nbsp;\u0026nbsp;He\u0027d almost found out too much too soon.\u0026nbsp;\u0026nbsp;It was dangerous to underestimate this naive intruder from beyond the God Wall.\u003c/p\u003e\n\u003cp\u003eOnce more, she\u0027d begun probing for things he had not yet revealed.\u0026nbsp;\u0026nbsp;Time had protected him.\u0026nbsp;\u0026nbsp;Aides had come urging an early inspection of the new weapons.\u0026nbsp;\u0026nbsp;They were needed.\u003c/p\u003e\n\u003cp\u003eAfterward, they\u0027d gone to the command post and then to breakfast in a Warren dining room.\u0026nbsp;\u0026nbsp;All through breakfast, he\u0027d plied her with questions about the fighting.\u0026nbsp;\u0026nbsp;How extensive was it?\u0026nbsp;\u0026nbsp;Could he see some of the prisoners?\u0026nbsp;\u0026nbsp;Were they using the weapons built from the patterns in his kit?\u0026nbsp;\u0026nbsp;Were they winning?\u003c/p\u003e\n\u003cp\u003eSometimes she merely ignored his questions.\u0026nbsp;\u0026nbsp;Most of her answers were short, distracted.\u0026nbsp;\u0026nbsp;Yes.\u0026nbsp;\u0026nbsp;No.\u0026nbsp;\u0026nbsp;No.\u0026nbsp;\u0026nbsp;Yes.\u0026nbsp;\u0026nbsp;McKie realized she was answering in monosyllables to fend him off.\u0026nbsp;\u0026nbsp;He was a distraction.\u0026nbsp;\u0026nbsp;Something important had been communicated to her and he\u0027d missed it.\u0026nbsp;\u0026nbsp;Although this angered him, he tried to mask the emotion, striving to penetrate her wall of concern.\u0026nbsp;\u0026nbsp;Oddly, she responded when he changed his line of questioning to the parents of the three children and the conversation there.\u003c/p\u003e\n\u003cp\u003e\"You started to designate a particular place:\u0026nbsp;\u0026nbsp;\u0027Beyond the . . .\u0027\u0026nbsp;\u0026nbsp;Beyond what?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s something Gar, thinks I don\u0027t know.\u0026nbsp;\u0026nbsp;He thinks only his death fanatics have that kind of rapport with the Rim.\"\u003c/p\u003e\n\u003cp\u003eHe stared at her, caught by a sudden thought.\u0026nbsp;\u0026nbsp;By now, he knew much about Gar and Tria.\u0026nbsp;\u0026nbsp;She answered his questions about them with candor, often using him openly to clarify her own thoughts.\u0026nbsp;\u0026nbsp;But - death fanatics?\u003c/p\u003e\n\u003cp\u003e\"Are these fanatics homosexual?\"\u003c/p\u003e\n\u003cp\u003eShe pounced.\u003c/p\u003e\n\u003cp\u003e\"How\u0027d you know?\"\u003c/p\u003e\n\u003cp\u003e\"A guess.\"\u003c/p\u003e\n\u003cp\u003e\"What difference would it make?\"\u003c/p\u003e\n\u003cp\u003e\"Are they?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eMcKie shuddered.\u003c/p\u003e\n\u003cp\u003eShe was peremptory.\u003c/p\u003e\n\u003cp\u003e\"Explain!\"\u003c/p\u003e\n\u003cp\u003e\"When Humans for any reason go terminal where survival of their species is concerned, it\u0027s relatively easy to push them the short step further into wanting to die.\"\u003c/p\u003e\n\u003cp\u003e\"You speak from historical evidence?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Example.\"\u003c/p\u003e\n\u003cp\u003e\"With rare exceptions, primitive Humans of the tribal eras reserved their homosexuals as the ultimate shock troops of desperation.\u0026nbsp;\u0026nbsp;They were the troops of last resort, sent into battle as berserkers who expected, who wanted, to die.\"\u003c/p\u003e\n\u003cp\u003eShe had to have the term berserkers explained, then showed by her manner that she believed him.\u0026nbsp;\u0026nbsp;She considered this, then:\u003c/p\u003e\n\u003cp\u003e\"What does your ConSentiency do about this susceptibility?\"\u003c/p\u003e\n\u003cp\u003e\"We take sophisticated care to guide all natural sexual variants into constructive, survival activities.\u0026nbsp;\u0026nbsp;We protect them from the kinds of pressures which might tip them over into behavior destructive of the species.\"\u003c/p\u003e\n\u003cp\u003eOnly later had McKie realized she had not answered his question:\u0026nbsp;\u0026nbsp;beyond what?\u0026nbsp;\u0026nbsp;She\u0027d rushed him off to a conference room where more than twenty Humans were assembled, including the two parents who\u0027d made the chart about Tria and Gar.\u0026nbsp;\u0026nbsp;McKie realized he didn\u0027t even know their names.\u003c/p\u003e\n\u003cp\u003eIt put him at a disadvantage not knowing as many of these people by sight and name as he should.\u0026nbsp;\u0026nbsp;They, of course, had ready memories of everyone important around them and, when they used a name, often did it with such blurred movement into new subjects that he was seldom sure who had been named.\u0026nbsp;\u0026nbsp;He saw the key to it, though.\u0026nbsp;\u0026nbsp;Their memories were anchored in explicit references to relative abilities of those around them, relative dangers.\u0026nbsp;\u0026nbsp;And it wasn\u0027t so much that they concealed their emotions as that they managed their emotions.\u0026nbsp;\u0026nbsp;Nowhere in their memories could there be any emotive clouding such as thoughts of love or friendship.\u0026nbsp;\u0026nbsp;Such things weakened you.\u0026nbsp;\u0026nbsp;Everything operated on the strict basis of quid pro quo, and you\u0027d better have the cash ready - whatever that cash might be. McKie, pressed all around by questions from the people in the conference room, knew he had only one real asset:\u0026nbsp;\u0026nbsp;he was a key they might use to open the God Wall.\u0026nbsp;\u0026nbsp;Very important asset, but unfortunately owned by an idiot.\u003c/p\u003e\n\u003cp\u003eNow, they wanted his information about death fanatics.\u0026nbsp;\u0026nbsp;They milked him dry, then sent him away like a child who has performed for his elders but is sent to his room when important matters are brought up for discussion. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dosadi-experiment-consentiency-universe-2/page-21.html","bookId":2173,"creation":"Oct 5, 2019 6:40:19 PM","modification":"Oct 5, 2019 6:40:19 PM"}
