{"id":99204,"no":27,"title":"Page 27","content":"\u003cp\u003eDoes a population have informed consent when that population is not taught the inner workings of its monetary system, and then is drawn, all unknowing, into economic adventures?\u003c/p\u003e\n\u003cp\u003e- from The Trial of Trials\u003c/p\u003e\n\u003cp\u003eFor almost an hour after the morning meal, Aritch observed Ceylang as she worked with the McKie simulator.\u0026nbsp;\u0026nbsp;She was pushing herself hard, believing Wreave honor at stake, and had almost reached the pitch Aritch desired.\u003c/p\u003e\n\u003cp\u003eCeylang had set up her own simulator situation:\u0026nbsp;\u0026nbsp;McKie interviewing five of Broey\u0027s Gowachin.\u0026nbsp;\u0026nbsp;She had the Gowachin come to McKie in surrender, hands extended, the webbed fingers exposed to show that the talons were withdrawn.\u003c/p\u003e\n\u003cp\u003eSimulator-McKie merely probed for military advantages.\u003c/p\u003e\n\u003cp\u003e\"Why does Broey attack in this fashion?\"\u003c/p\u003e\n\u003cp\u003eOr he\u0027d turn to some places outside the h-focus of the simulator.\u003c/p\u003e\n\u003cp\u003e\"Send reinforcements into that area.\"\u003c/p\u003e\n\u003cp\u003eNothing about the Rim.\u003c/p\u003e\n\u003cp\u003eEarlier, Ceylang had tried the issue with a prisoner simulation where the five Gowachin tried to confuse McKie by presenting a scenario in which Broey massed his forces at the corridor.\u0026nbsp;\u0026nbsp;The makings of a breakout to the Rim appeared obvious.\u003c/p\u003e\n\u003cp\u003eSimulator-McKie asked the prisoners why they lied.\u003c/p\u003e\n\u003cp\u003eCeylang cleared the simulator and sat back.\u0026nbsp;\u0026nbsp;She saw Aritch at the observation window, opened a channel to him.\u003c/p\u003e\n\u003cp\u003e\"Something has to be wrong in the simulation.\u0026nbsp;\u0026nbsp;McKie cannot be led into questioning the purposes of the Rim.\"\u003c/p\u003e\n\u003cp\u003e\"I assure you that simulation is remarkable in its accuracy.\u0026nbsp;\u0026nbsp;Remarkable.\"\u003c/p\u003e\n\u003cp\u003e\"Then why . . .\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps he already knows the answer.\u0026nbsp;\u0026nbsp;Why don\u0027t you try him with Jedrik?\u0026nbsp;\u0026nbsp;Here. . .\"\u0026nbsp;\u0026nbsp;Aritch operated the controls at the observer station.\u0026nbsp;\u0026nbsp;\"This might help.\u0026nbsp;\u0026nbsp;This is a record of McKie in recent action on Dosadi.\"\u003c/p\u003e\n\u003cp\u003eThe simulator presented a view down a covered passage through a building.\u0026nbsp;\u0026nbsp;Artificial light.\u0026nbsp;\u0026nbsp;Darkness at the far end of the passage.\u0026nbsp;\u0026nbsp;McKie, two blocky guards in tow, approached the viewers.\u003c/p\u003e\n\u003cp\u003eCeylang recognized the scene.\u0026nbsp;\u0026nbsp;She\u0027d watched this action at Gate Eighteen from several angles, had seen this passage empty before the battle, acquainting herself with the available views.\u0026nbsp;\u0026nbsp;As she\u0027d watched it then, the passage had filled with Human defenders.\u0026nbsp;\u0026nbsp;There was a minor gate behind the viewer and she knew the viewer itself to be only a bright spot, a fleck of glittering impurity in an otherwise drab brick over the gate\u0027s archway.\u003c/p\u003e\n\u003cp\u003eNow, the long passage seemed strange to Ceylang without its throng of defenders.\u0026nbsp;\u0026nbsp;There were only a few workmen along its length as McKie passed.\u0026nbsp;\u0026nbsp;The workmen repaired service pipes in the ceiling.\u0026nbsp;\u0026nbsp;A cleanup crew washed down patches of blood at the far end of the passage, the high-water mark of the Gowachin attack.\u0026nbsp;\u0026nbsp;An officer leaned against a wall near the viewer, a bored expression on his face which did not mislead Ceylang.\u0026nbsp;\u0026nbsp;He was there to watch McKie.\u0026nbsp;\u0026nbsp;Three soldiers squatted nearby rolling hexi-bones for coins which lay in piles before each man.\u0026nbsp;\u0026nbsp;Every now and then, one of the gamblers would pass a coin to the watching officer.\u0026nbsp;\u0026nbsp;A repair supervisor stood with his back to the viewer, notebook in hand, writing a list of supplies to complete the job.\u0026nbsp;\u0026nbsp;McKie and his guards were forced to step around these people.\u0026nbsp;\u0026nbsp;As they passed, the officer turned, looked directly into the Viewer, smiled.\u003c/p\u003e\n\u003cp\u003e\"That officer,\" Ceylang said.\u0026nbsp;\u0026nbsp;\"One of your people?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eThe viewpoint shifted, looking down on the gate itself, McKie in profile.\u0026nbsp;\u0026nbsp;The gatekeeper was a teenager with a scar down his right cheek and a broken nose.\u0026nbsp;\u0026nbsp;McKie showed no signs of recognition, but the youth knew McKie.\u003c/p\u003e\n\u003cp\u003e\"You go through on request.\"\u003c/p\u003e\n\u003cp\u003e\"When did she call?\"\u003c/p\u003e\n\u003cp\u003e\"Ten.\"\u003c/p\u003e\n\u003cp\u003e\"Let us through.\"\u003c/p\u003e\n\u003cp\u003eThe gate was opened.\u0026nbsp;\u0026nbsp;McKie and his guards went through, passed beyond the viewer\u0027s focus.\u003c/p\u003e\n\u003cp\u003eThe youthful gatekeeper stood up, smashed the viewer.\u0026nbsp;\u0026nbsp;The h-focus went blank.\u003c/p\u003e\n\u003cp\u003eAritch looked down from his observation booth for a moment before speaking.\u003c/p\u003e\n\u003cp\u003e\"Who called?\"\u003c/p\u003e\n\u003cp\u003e\"Jedrik?\"\u0026nbsp;\u0026nbsp;Ceylang spoke without thinking.\u003c/p\u003e\n\u003cp\u003e\"What does that conversation tell you?\u0026nbsp;\u0026nbsp;Quickly!\"\u003c/p\u003e\n\u003cp\u003e\"That Jedrik anticipated his movements, was observing him all the time.\"\u003c/p\u003e\n\u003cp\u003e\"What else?\"\u003c/p\u003e\n\u003cp\u003e\"That McKie . . . knows this, knows she can anticipate him.\"\u003c/p\u003e\n\u003cp\u003e\"She carries a better simulation of him in her head than we have . . . there.\"\u003c/p\u003e\n\u003cp\u003eAritch pointed at the h-focus area.\u003c/p\u003e\n\u003cp\u003e\"But they left so much unspoken!\"\u0026nbsp;\u0026nbsp;Ceylang said.\u003c/p\u003e\n\u003cp\u003eAritch remained silent.\u003c/p\u003e\n\u003cp\u003eCeylang closed her eyes.\u0026nbsp;\u0026nbsp;It was like mind reading.\u0026nbsp;\u0026nbsp;It confused her.\u003c/p\u003e\n\u003cp\u003eAritch interrupted her musings.\u003c/p\u003e\n\u003cp\u003e\"What about that officer and the gatekeeper?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re wise to use living observers there.\u0026nbsp;\u0026nbsp;They all seem to know when they\u0027re being watched.\u0026nbsp;\u0026nbsp;And how it\u0027s done.\"\u003c/p\u003e\n\u003cp\u003e\"Even McKie.\"\u003c/p\u003e\n\u003cp\u003e\"He didn\u0027t look at the viewers.\"\u003c/p\u003e\n\u003cp\u003e\"Because he assumed from the first that we\u0027d have him under almost constant observation.\u0026nbsp;\u0026nbsp;He\u0027s not concerned about the mechanical intrusions.\u0026nbsp;\u0026nbsp;He has built a simulation McKie of his own who acts on the surface of the real McKie.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s your assumption?\"\u003c/p\u003e\n\u003cp\u003e\"We arrived at this from observation of Jedrik in her dealings with McKie.\u0026nbsp;\u0026nbsp;She peels away the simulation layers one at a time, coming closer and closer to the actuality at the core.\"\u003c/p\u003e\n\u003cp\u003eAnother observation bothered Ceylang.\u003c/p\u003e\n\u003cp\u003e\"Why\u0027d the gatekeeper shut down that viewer just then?\"\u003c/p\u003e\n\u003cp\u003e\"Obviously because Jedrik told him to do that.\"\u003c/p\u003e\n\u003cp\u003eCeylang shuddered.\u003c/p\u003e\n\u003cp\u003e\"Sometimes I think those Dosadi play us like a fine instrument.\"\u003c/p\u003e\n\u003cp\u003e\"But of course!\u0026nbsp;\u0026nbsp;That\u0027s why we sent them our McKie.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dosadi-experiment-consentiency-universe-2/page-27.html","bookId":2173,"creation":"Oct 5, 2019 6:40:19 PM","modification":"Oct 5, 2019 6:40:19 PM"}
