{"id":99208,"no":31,"title":"Page 31","content":"\u003cp\u003eWhere pain predominates, agony can be a valued teacher.\u003c/p\u003e\n\u003cp\u003e- Dosadi aphorism\u003c/p\u003e\n\u003cp\u003eMcKie and Jedrik had no need to discuss the decision.\u0026nbsp;\u0026nbsp;It was a choice which they shared and knew they shared through a memory-selection process now common to both of them.\u0026nbsp;\u0026nbsp;There was a loophole in the God Wall and even though that wall now blanketed Dosadi in darkness, a Caleban contract was still a Caleban contract.\u0026nbsp;\u0026nbsp;The vital question was whether the Caleban of the God Wall would respond.\u003c/p\u003e\n\u003cp\u003eJedrik in McKie\u0027s body stood guard outside her own room while a Jedrik-fleshed McKie went alone into the room to make the attempt.\u0026nbsp;\u0026nbsp;Who should he try to contact?\u0026nbsp;\u0026nbsp;Fannie Mae?\u0026nbsp;\u0026nbsp;The absolute darkness which enclosed Dosadi hinted at an absolute withdrawal of the guardian Caleban.\u0026nbsp;\u0026nbsp;And there was so little time.\u003c/p\u003e\n\u003cp\u003eMcKie sat cross-legged on the floor of the room and tried to clear his mind.\u0026nbsp;\u0026nbsp;The constant strange discoveries in the female body he now wore interfered with concentration.\u0026nbsp;\u0026nbsp;The moment of exchange left an aftershock which he doubted would ever diminish.\u0026nbsp;\u0026nbsp;They had but to share the desire for the change now and it occurred.\u0026nbsp;\u0026nbsp;But this different body - ahh, the multiplicity of differences created its own confusions.\u0026nbsp;\u0026nbsp;These went far beyond the adjustments to different height and weight.\u0026nbsp;\u0026nbsp;The muscles of his/her arms and hips felt wrongly attached.\u0026nbsp;\u0026nbsp;The bodily senses were routed through different unconscious processes.\u0026nbsp;\u0026nbsp;Anatomy created its own patterns, its own instinctual behavior.\u0026nbsp;\u0026nbsp;For one thing, he found it necessary to develop consciously monitored movements which protected his/her breasts.\u0026nbsp;\u0026nbsp;The movements were reminiscent of those male adjustments by which he prevented injury to testes.\u0026nbsp;\u0026nbsp;These were movements which a male learned early and relegated to an automatic behavior pattern.\u0026nbsp;\u0026nbsp;The problem in the female body was that he had to think about such behavior.\u0026nbsp;\u0026nbsp;And it went far beyond the breast-testes interlock.\u003c/p\u003e\n\u003cp\u003eAs he tried to clear his mind for the Caleban contact, these webbed clusters of memory intruded.\u0026nbsp;\u0026nbsp;It was maddening.\u0026nbsp;\u0026nbsp;He needed to clear away bodily distractions, but this female body demanded his attention.\u0026nbsp;\u0026nbsp;In desperation, he hyperventilated and burned his awareness into a pineal focus whose dangers he knew only too well.\u0026nbsp;\u0026nbsp;This was the way to permanent identity loss if the experience were prolonged.\u0026nbsp;\u0026nbsp;It produced a sufficient clarity, however, that he could fill his awareness with memories of Fannie Mae.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eHe sensed time\u0027s passage as though each heartbeat were a blow.\u003c/p\u003e\n\u003cp\u003eFear hovered at the edges of the silence.\u003c/p\u003e\n\u003cp\u003eIt came to him that something had put a terrible fear into the God Wall Caleban.\u003c/p\u003e\n\u003cp\u003eMcKie felt anger.\u003c/p\u003e\n\u003cp\u003e\"Caleban! You owe me!\"\u003c/p\u003e\n\u003cp\u003e\"McKie?\"\u003c/p\u003e\n\u003cp\u003eThe response was so faint that he wondered whether it might be his hopes playing tricks on him.\u003c/p\u003e\n\u003cp\u003e\"Fannie Mae?\"\u003c/p\u003e\n\u003cp\u003e\"Are you McKie?\"\u003c/p\u003e\n\u003cp\u003eThat was stronger, and he recognized the familiar Caleban presence in his awareness.\u003c/p\u003e\n\u003cp\u003e\"I am McKie and you owe me a debt.\"\u003c/p\u003e\n\u003cp\u003e\"If you are truly McKie . . . why are you so . . . strange . . . changed?\"\u003c/p\u003e\n\u003cp\u003e\"I wear another body.\"\u003c/p\u003e\n\u003cp\u003eMcKie was never sure, but he thought he sensed consternation.\u0026nbsp;\u0026nbsp;Fannie Mae responded more strongly then.\u003c/p\u003e\n\u003cp\u003e\"I remove McKie from Dosadi now?\u0026nbsp;\u0026nbsp;Contract permits.\"\u003c/p\u003e\n\u003cp\u003e\"I will share Dosadi\u0027s fate.\"\u003c/p\u003e\n\u003cp\u003e\"McKie!\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t argue with me, Fannie Mae.\u0026nbsp;\u0026nbsp;I will share Dosadi\u0027s fate unless you remove another node/person with me.\"\u003c/p\u003e\n\u003cp\u003eHe projected Jedrik\u0027s patterns then, an easy process since he shared all of her memories.\u003c/p\u003e\n\u003cp\u003e\"She wears McKie\u0027s body!\"\u003c/p\u003e\n\u003cp\u003eIt was accusatory.\u003c/p\u003e\n\u003cp\u003e\"She wears another body,\" McKie said.\u0026nbsp;\u0026nbsp;He knew the Caleban saw his new relationship with Jedrik.\u0026nbsp;\u0026nbsp;Everything depended now on the interpretation of the Caleban contract.\u003c/p\u003e\n\u003cp\u003e\"Jedrik is Dosadi,\" the Caleban protested.\u003c/p\u003e\n\u003cp\u003e\"So am I Dosadi . . . now.\"\u003c/p\u003e\n\u003cp\u003e\"But you are McKie!\"\u003c/p\u003e\n\u003cp\u003e\"And Jedrik is also McKie.\u0026nbsp;\u0026nbsp;Contact her if you don\u0027t believe me.\"\u003c/p\u003e\n\u003cp\u003eHe broke the contact with an angry abruptness, found himself sprawled on the floor, still twitching.\u0026nbsp;\u0026nbsp;Perspiration bathed the female body which he still wore. The head ached.\u003c/p\u003e\n\u003cp\u003eWould Fannie Mae do as he\u0027d told her?\u0026nbsp;\u0026nbsp;He knew Jedrik was as capable of projecting his awareness as he was of projecting hers.\u0026nbsp;\u0026nbsp;How would Fannie Mae interpret the Dosadi contract?\u003c/p\u003e\n\u003cp\u003eGods!\u0026nbsp;\u0026nbsp;The ache in this head was a burning thing.\u0026nbsp;\u0026nbsp;He felt alien in Jedrik\u0027s body, misused.\u0026nbsp;\u0026nbsp;The pain persisted and he wondered if he\u0027d done irreparable harm to Jedrik\u0027s brain through that intense pineal focus.\u003c/p\u003e\n\u003cp\u003eSlowly, he pushed himself upright, got to his feet.\u0026nbsp;\u0026nbsp;The Jedrik legs felt weak beneath him.\u0026nbsp;\u0026nbsp;He thought of Jedrik outside that door, trembling in the zombielike trance required for this mind-to-mind contact.\u0026nbsp;\u0026nbsp;What was taking so long?\u0026nbsp;\u0026nbsp;Had the Calebans withdrawn?\u003c/p\u003e\n\u003cp\u003eHave we lost?\u003c/p\u003e\n\u003cp\u003eHe started for the door but before he\u0027d taken the second step, light blazed around him.\u0026nbsp;\u0026nbsp;For a fractional heartbeat he thought it was the final fire to consume Dosadi, but the light held steady.\u0026nbsp;\u0026nbsp;He glanced around, found himself in the open air.\u0026nbsp;\u0026nbsp;It was a place he recognized immediately:\u0026nbsp;\u0026nbsp;the courtyard of the Dry Head compound on Tandaloor.\u0026nbsp;\u0026nbsp;He saw the familiar phylum designs on the surrounding walls:\u0026nbsp;\u0026nbsp;green Gowachin script on yellow bricks.\u0026nbsp;\u0026nbsp;There was the sound of water splashing in the corner pool.\u0026nbsp;\u0026nbsp;A group of Gowachin stood in an arched entry directly ahead of him and he recognized one of his old teachers.\u0026nbsp;\u0026nbsp;Yes - this was a Dry Head sanctum.\u0026nbsp;\u0026nbsp;These people had protected him, trained him, introduced him to their most sacred secrets.\u003c/p\u003e\n\u003cp\u003eThe Gowachin in the shadowed entry were moving excitedly into the courtyard, their attention centered on a figure sprawled near them.\u0026nbsp;\u0026nbsp;The figure stirred, sat up.\u003c/p\u003e\n\u003cp\u003eMcKie recognized his own body there.\u003c/p\u003e\n\u003cp\u003eJedrik!\u003c/p\u003e\n\u003cp\u003eIt was an intense mutual need.\u0026nbsp;\u0026nbsp;The body exchange required less than an eyeblink.\u0026nbsp;\u0026nbsp;McKie found himself in his own familiar body, seated on cool tiles.\u0026nbsp;\u0026nbsp;The approaching Gowachin bombarded him with questions.\u003c/p\u003e\n\u003cp\u003e\"McKie, what is this?\"\u003c/p\u003e\n\u003cp\u003e\"You fell through a jumpdoor!\"\u003c/p\u003e\n\u003cp\u003e\"Are you hurt?\"\u003c/p\u003e\n\u003cp\u003eHe waved the questions away, crossed his legs, and fell into the long-call trance focused on that bead in his stomach.\u0026nbsp;\u0026nbsp;That bead Bildoon had never expected him to use!\u003c/p\u003e\n\u003cp\u003eAs it was paid to do, the Taprisiot waiting on CC enfolded his awareness.\u0026nbsp;\u0026nbsp;McKie rejected contact with Bildoon, made six calls through the responsive Taprisiot.\u0026nbsp;\u0026nbsp;The calls went to key agents in BuSab, all of them ambitious and resourceful, all of them completely loyal to the agency\u0027s mandate.\u0026nbsp;\u0026nbsp;He transmitted his Dosadi information in full bursts, using the technique derived from his exchanges with Jedrik - mind-to-mind.\u003c/p\u003e\n\u003cp\u003eThere were few questions and those easily answered.\u003c/p\u003e\n\u003cp\u003e\"The Caleban who holds Dosadi imprisoned plays God.\u0026nbsp;\u0026nbsp;It\u0027s the letter of the contract.\"\u003c/p\u003e\n\u003cp\u003e\"Do the Calebans approve of this?\"\u003c/p\u003e\n\u003cp\u003eThat question came from a particularly astute Wreave agent sensitive to the complications implicit in the fact that the Gowachin were training Ceylang, a Wreave female, as a Legum.\u003c/p\u003e\n\u003cp\u003e\"The concepts of approval or disapproval are not applicable.\u0026nbsp;\u0026nbsp;The role was necessary for that Caleban to carry out the contract.\"\u003c/p\u003e\n\u003cp\u003e\"It was a game?\"\u003c/p\u003e\n\u003cp\u003eThe Wreave agent was outraged.\u003c/p\u003e\n\u003cp\u003e\"Perhaps.\u0026nbsp;\u0026nbsp;There\u0027s one thing certain:\u0026nbsp;\u0026nbsp;the Calebans don\u0027t understand harmful behavior and ethics as we understand them.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve always known that.\"\u003c/p\u003e\n\u003cp\u003e\"But now we\u0027ve really learned it.\"\u003c/p\u003e\n\u003cp\u003eWhen he\u0027d made the six calls, McKie sent his Taprisiot questing for Aritch, found the High Magister in the Running Phylum\u0027s conference pool.\u003c/p\u003e\n\u003cp\u003e\"Greetings, Client.\"\u003c/p\u003e\n\u003cp\u003eMcKie projected wry amusement.\u0026nbsp;\u0026nbsp;He sensed the Gowachin\u0027s shock.\u003c/p\u003e\n\u003cp\u003e\"There are certain things which your Legum instructs you to do under the holy seal of our relationship,\" McKie said.\u003c/p\u003e\n\u003cp\u003e\"You will take us into the Courtarena, then?\"\u003c/p\u003e\n\u003cp\u003eThe High Magister was perceptive and he was a beneficiary of Dosadi\u0027s peculiar gifts, but he was not a Dosadi.\u0026nbsp;\u0026nbsp;McKie found it relatively easy to manipulate Aritch now, enlisting the High Magister\u0027s deepest motivations.\u0026nbsp;\u0026nbsp;When Aritch protested against canceling the God Wall contract, McKie revealed only the first layer of stubborn determination.\u003c/p\u003e\n\u003cp\u003e\"You will not add to your Legum\u0027s difficulties.\"\u003c/p\u003e\n\u003cp\u003e\"But what will keep them on Dosadi?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing.\"\u003c/p\u003e\n\u003cp\u003e\"Then you will defend rather than prosecute?\"\u003c/p\u003e\n\u003cp\u003e\"Ask your pet Wreave,\" McKie said.\u0026nbsp;\u0026nbsp;\"Ask Ceylang.\"\u003c/p\u003e\n\u003cp\u003eHe broke the contact then, knowing Aritch could only obey him.\u0026nbsp;\u0026nbsp;The High Magister had few choices, most of them bad ones.\u0026nbsp;\u0026nbsp;And Gowachin Law prevented him from disregarding his Legum\u0027s orders once the pattern of the contest was set.\u003c/p\u003e\n\u003cp\u003eMcKie awoke from the call to find his Dry Head friends clustered around Jedrik.\u0026nbsp;\u0026nbsp;She was explaining their predicament.\u0026nbsp;\u0026nbsp;Yes . . .\u0026nbsp;\u0026nbsp;There were advantages to having two bodies with one purpose.\u0026nbsp;\u0026nbsp;McKie got to his feet.\u0026nbsp;\u0026nbsp;She saw him, spoke.\u003c/p\u003e\n\u003cp\u003e\"My head feels better.\"\u003c/p\u003e\n\u003cp\u003e\"It was a near thing.\"\u0026nbsp;\u0026nbsp;And he added:\u003c/p\u003e\n\u003cp\u003e\"It still is.\u0026nbsp;\u0026nbsp;But Dosadi is free.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dosadi-experiment-consentiency-universe-2/page-31.html","bookId":2173,"creation":"Oct 5, 2019 6:40:19 PM","modification":"Oct 5, 2019 6:40:19 PM"}
