{"id":99183,"no":6,"title":"Page 6","content":"\u003cp\u003eLaw must retain useful ways to break with traditional forms because nothing is more certain than that the forms of Law remain when all justice is gone.\u003c/p\u003e\n\u003cp\u003e- Gowachin aphorism\u003c/p\u003e\n\u003cp\u003eHe was tall for a Dosadi Gowachin, but fat and ungroomed.\u0026nbsp;\u0026nbsp;His feet shuffled when he walked and there was a permanent stoop to his shoulders.\u0026nbsp;\u0026nbsp;A flexing wheezing overcame his chest ventricles when he became excited.\u0026nbsp;\u0026nbsp;He knew this and was aware that those around him knew it.\u0026nbsp;\u0026nbsp;He often used this characteristic as a warning, reminding people that no Dosadi held more power than he, and that power was deadly.\u0026nbsp;\u0026nbsp;All Dosadi knew his name:\u0026nbsp;\u0026nbsp;Broey.\u0026nbsp;\u0026nbsp;And very few misinterpreted the fact that he\u0027d come up through the Sacred Congregation of the Heavenly Veil to his post as chief steward of Control:\u0026nbsp;\u0026nbsp;The Elector.\u0026nbsp;\u0026nbsp;His private army was Dosadi\u0027s largest, most efficient, and best armed.\u0026nbsp;\u0026nbsp;Broey\u0027s intelligence corps was a thing to invoke fear and admiration.\u0026nbsp;\u0026nbsp;He maintained a fortified suit atop his headquarters building, a structure of stone and plasteel which fronted the main arm of the river in the heart of Chu.\u0026nbsp;\u0026nbsp;Around this core, the twisting walled fortifications of the city stepped outward in concentric rings.\u0026nbsp;\u0026nbsp;The only entrance to Broey\u0027s citadel was through a guarded Tube Gate in a subbasement, designated TG One.\u0026nbsp;\u0026nbsp;TG One admitted the select of the select and no others.\u003c/p\u003e\n\u003cp\u003eIn the forenoon, the ledges outside Broey\u0027s windows were a roosting place for carrion birds, who occupied a special niche on Dosadi.\u0026nbsp;\u0026nbsp;Since the Lords of the Veil forbade the eating of sentient flesh by sentient, this task devolved upon the birds.\u0026nbsp;\u0026nbsp;Flesh from the people of Chu and even from the Rim carried fewer of the planet\u0027s heavy metals.\u0026nbsp;\u0026nbsp;The carrion birds prospered.\u0026nbsp;\u0026nbsp;A flock of them strutted along Broey\u0027s ledge, coughing, squawking, defecating, brushing against each other with avian insolence while they watched the outlying streets for signs of food.\u0026nbsp;\u0026nbsp;They also watched the Rim, but it had been temporarily denied to them by a sonabarrier.\u0026nbsp;\u0026nbsp;Bird sounds came through a voder into one of the suite\u0027s eight rooms.\u0026nbsp;\u0026nbsp;This was a yellow-green space about ten meters long and six wide occupied by Broey and two Humans.\u003c/p\u003e\n\u003cp\u003eBroey uttered a mild expletive at the bird noise.\u0026nbsp;\u0026nbsp;The confounded creatures interfered with clear thinking.\u0026nbsp;\u0026nbsp;He shuffled to the window and silenced the voder.\u0026nbsp;\u0026nbsp;In the sudden quiet he looked out at the city\u0027s perimeter and the lower ledges of the enclosing cliffs.\u0026nbsp;\u0026nbsp;Another Rim foray had been repulsed out there in the night.\u0026nbsp;\u0026nbsp;Broey had made a personal inspection in a convoy of armored vehicles earlier.\u0026nbsp;\u0026nbsp;The troops liked it that he occasionally shared their dangers.\u0026nbsp;\u0026nbsp;The carrion birds already had cleaned up most of the mess by the time the armored column swept through..\u0026nbsp;\u0026nbsp;The flat back structure of Gowachin, who had no front rib cage, had been easily distinguishable from the white framework which had housed Human organs.\u0026nbsp;\u0026nbsp;Only a few rags of red and green flesh had marked where the birds had abandoned their feast when the sonabarriers herded them away.\u003c/p\u003e\n\u003cp\u003eWhen he considered the sonabarriers, Broey\u0027s thoughts grew hard and clear.\u0026nbsp;\u0026nbsp;The sonabarriers were one of Gar\u0027s damned affectations!\u0026nbsp;\u0026nbsp;Let the birds finish it.\u003c/p\u003e\n\u003cp\u003eBut Gar insisted a few bodies be left around to make the point for the Rim survivors that their attacks were hopeless.\u003c/p\u003e\n\u003cp\u003eThe bones by themselves would be just as effective.\u003c/p\u003e\n\u003cp\u003eGar was bloody minded.\u003c/p\u003e\n\u003cp\u003eBroey turned and glanced across the room past his two Human companions.\u0026nbsp;\u0026nbsp;Two of the walls were taken up by charts bearing undulant squiggles in many colors.\u0026nbsp;\u0026nbsp;On a table at the room\u0027s center lay another chart with a single red line.\u0026nbsp;\u0026nbsp;The line curved and dipped, ending almost in the middle of the chart.\u0026nbsp;\u0026nbsp;Near this terminus lay a white card and beside it stood a Human male statuette with an enormous erection which was labeled \"Rabble.\"\u0026nbsp;\u0026nbsp;It was a subversive, forbidden artifact of Rim origin.\u0026nbsp;\u0026nbsp;The people of the Rim knew where their main strength lay:\u0026nbsp;\u0026nbsp;breed, breed, breed . . .\u003c/p\u003e\n\u003cp\u003eThe Humans sat facing each other across the chart.\u0026nbsp;\u0026nbsp;They fitted into the space around them through a special absorption.\u0026nbsp;\u0026nbsp;It was as though they\u0027d been initiated into the secrets of Broey\u0027s citadel through an esoteric ritual both forbidding and dangerous.\u003c/p\u003e\n\u003cp\u003eBroey returned to his chair at the head of the table, sat down, and quietly continued to study his companions.\u0026nbsp;\u0026nbsp;He experienced amusement to feel his fighting claws twitch beneath their finger shields as he looked at the two.\u0026nbsp;\u0026nbsp;Yes - trust them no more than they trusted him.\u0026nbsp;\u0026nbsp;They had their own troops, their own spies - they posed real threat to Broey but often their help was useful.\u0026nbsp;\u0026nbsp;Just as often they were a nuisance.\u003c/p\u003e\n\u003cp\u003eQuilliam Gar, the Human male who sat with his back to the windows, looked up as Broey resumed his seat.\u0026nbsp;\u0026nbsp;Gar snorted, somehow conveying that he\u0027d been about to silence the voder himself.\u003c/p\u003e\n\u003cp\u003eDamned carrion birds! But they were useful . . . useful.\u003c/p\u003e\n\u003cp\u003eThe Rim-born were always ambivalent about the birds.\u003c/p\u003e\n\u003cp\u003eGar rode his chair as though talking down to ranks of the uninformed.\u0026nbsp;\u0026nbsp;He\u0027d come up through the educational services in the Convocation before joining Broey.\u0026nbsp;\u0026nbsp;Gar was thin with an inner emaciation so common that few on Dosadi gave it any special notice.\u0026nbsp;\u0026nbsp;He had the hunter\u0027s face and eyes, carried his eighty-eight years as though they were twice that.\u0026nbsp;\u0026nbsp;Hairline wrinkles crawled down his cheeks.\u0026nbsp;\u0026nbsp;The bas-relief of veins along the backs of his hands and the grey hair betrayed his Rim origins, as did a tendency to short temper.\u0026nbsp;\u0026nbsp;The Labor Pool green of his clothing fooled very few, his face was that well known.\u003c/p\u003e\n\u003cp\u003eAcross from Gar sat his eldest daughter and chief lieutenant, Tria.\u0026nbsp;\u0026nbsp;She\u0027d placed herself there to watch the windows and the cliffs.\u0026nbsp;\u0026nbsp;She\u0027d also been observing the carrion birds, rather enjoying their sounds.\u0026nbsp;\u0026nbsp;It was well to be reminded here of what lay beyond the city\u0027s outer gates.\u003c/p\u003e\n\u003cp\u003eTria\u0027s face held too much brittle sharpness to be considered beautiful by any except an occasional Gowachin looking for an exotic experience or a Warren laborer hoping to use her as a step out of peonage.\u0026nbsp;\u0026nbsp;She often disconcerted her companions by a wide-eyed, cynical stare.\u0026nbsp;\u0026nbsp;She did this with an aristocratic sureness which commanded attention.\u0026nbsp;\u0026nbsp;Tria had developed the gesture for just this purpose.\u0026nbsp;\u0026nbsp;Today, she wore the orange with black trim of Special Services, but without a brassard to indicate the branch.\u0026nbsp;\u0026nbsp;She knew that this led many to believe her Broey\u0027s personal toy, which was true but not in the way the cynical supposed.\u0026nbsp;\u0026nbsp;Tria understood her special value:\u0026nbsp;\u0026nbsp;she possessed a remarkable ability to interpret the vagaries of the DemoPol.\u003c/p\u003e\n\u003cp\u003eIndicating the red line on the chart in front of her, Tria said, \"She has to be the one.\u0026nbsp;\u0026nbsp;How can you doubt it?\"\u0026nbsp;\u0026nbsp;And she wondered why Broey continued to worry at the obvious.\u003c/p\u003e\n\u003cp\u003e\"Keila Jedrik,\" Broey said.\u0026nbsp;\u0026nbsp;And again:\u0026nbsp;\u0026nbsp;\"Keila Jedrik.\"\u003c/p\u003e\n\u003cp\u003eGar squinted at his daughter.\u003c/p\u003e\n\u003cp\u003e\"Why would she include herself among the fifty who . . .\"\u003c/p\u003e\n\u003cp\u003e\"She sends us a message,\" Broey said.\u0026nbsp;\u0026nbsp;\"I hear it clearly now.\"\u0026nbsp;\u0026nbsp;He seemed pleased by his own thoughts.\u003c/p\u003e\n\u003cp\u003eGar read something else in the Gowachin\u0027s manner.\u003c/p\u003e\n\u003cp\u003e\"I hope you\u0027re not having her killed.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not as quick to anger as are you Humans,\" Broey said.\u003c/p\u003e\n\u003cp\u003e\"The usual surveillance?\" Gar asked.\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t decided.\u0026nbsp;\u0026nbsp;You know, don\u0027t you, that she lives a rather celibate life?\u0026nbsp;\u0026nbsp;Is it that she doesn\u0027t enjoy the males of your species?\"\u003c/p\u003e\n\u003cp\u003e\"More likely they don\u0027t enjoy her,\" Tria said.\u003c/p\u003e\n\u003cp\u003e\"Interesting.\u0026nbsp;\u0026nbsp;Your breeding habits are so peculiar.\"\u003c/p\u003e\n\u003cp\u003eTria shot a measuring stare at Broey.\u0026nbsp;\u0026nbsp;She wondered why the Gowachin had chosen to wear black today.\u0026nbsp;\u0026nbsp;It was a robe-like garment cut at a sharp angle from shoulders to waist, clearing his ventricles.\u0026nbsp;\u0026nbsp;The ventricles revolted her and Broey knew this.\u0026nbsp;\u0026nbsp;The very thought of them pressing against her . . .\u0026nbsp;\u0026nbsp;She cleared her throat.\u0026nbsp;\u0026nbsp;Broey seldom wore black; it was the happy color of priestly celebrants.\u0026nbsp;\u0026nbsp;He wore it, though, with a remoteness which suggested that thoughts passed through his mind which no other person could experience.\u003c/p\u003e\n\u003cp\u003eThe exchange between Broey and Tria worried Gar.\u0026nbsp;\u0026nbsp;He could not help but feel the oddity that each of them tried to present a threatening view of events by withholding some data and coloring other data.\u003c/p\u003e\n\u003cp\u003e\"What if she runs out to the Rim?\" Gar asked.\u003c/p\u003e\n\u003cp\u003eBroey shook his head.\u003c/p\u003e\n\u003cp\u003e\"Let her go.\u0026nbsp;\u0026nbsp;She\u0027s not one to stay on the Rim.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps we should have her picked up,\" Gar said.\u003c/p\u003e\n\u003cp\u003eBroey stared at him, then:\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve gained the distinct impression that you\u0027ve some private plan in mind.\u0026nbsp;\u0026nbsp;Are you prepared to share it?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve no idea what you . . .\"\u003c/p\u003e\n\u003cp\u003e\"Enough!\" Broey shouted.\u0026nbsp;\u0026nbsp;His ventricles wheezed as he inhaled.\u003c/p\u003e\n\u003cp\u003eGar held himself very quiet.\u003c/p\u003e\n\u003cp\u003eBroey leaned toward him, noting that this exchange amused Tria.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s too soon to make decisions we cannot change!\u0026nbsp;\u0026nbsp;This is a time for ambiguity.\"\u003c/p\u003e\n\u003cp\u003eIrritated by his own display of anger, Broey arose and hurried into his adjoining office, where he locked the door.\u0026nbsp;\u0026nbsp;It was obvious that those two had no more idea than he where Jedrik had gone to ground.\u0026nbsp;\u0026nbsp;But it was still his game.\u0026nbsp;\u0026nbsp;She couldn\u0027t hide forever.\u0026nbsp;\u0026nbsp;Seated once more in his office, he called Security.\u003c/p\u003e\n\u003cp\u003e\"Has Bahrank returned?\"\u003c/p\u003e\n\u003cp\u003eA senior Gowachin officer hurried into the screen\u0027s view, looked up.\u003c/p\u003e\n\u003cp\u003e\"Not yet.\"\u003c/p\u003e\n\u003cp\u003e\"What precautions to learn where he delivers his cargo?\"\u003c/p\u003e\n\u003cp\u003e\"We know his entry gate.\u0026nbsp;\u0026nbsp;It\u0027ll be simple to track him.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want Gar\u0027s people to know what you\u0027re doing.\"\u003c/p\u003e\n\u003cp\u003e\"Understood.\"\u003c/p\u003e\n\u003cp\u003e\"That other matter?\"\u003c/p\u003e\n\u003cp\u003e\"Pcharky may have been the last one.\u0026nbsp;\u0026nbsp;He could be dead, too.\u0026nbsp;\u0026nbsp;The killers were thorough.\"\u003c/p\u003e\n\u003cp\u003e\"Keep searching.\"\u003c/p\u003e\n\u003cp\u003eBroey put down a sense of disquiet.\u0026nbsp;\u0026nbsp;Some very unDosadi things were happening in Chu . . . and on the Rim.\u0026nbsp;\u0026nbsp;He felt that things occurred which his spies could not uncover.\u0026nbsp;\u0026nbsp;Presently, he returned to the more pressing matter.\u003c/p\u003e\n\u003cp\u003e\"Bahrank is not to be interfered with until afterward.\"\u003c/p\u003e\n\u003cp\u003e\"Understood.\"\u003c/p\u003e\n\u003cp\u003e\"Pick him up well clear of his delivery point and bring him to your section.\u0026nbsp;\u0026nbsp;I will interview him personally.\"\u003c/p\u003e\n\u003cp\u003e\"Sir, his addiction to . . .\"\u003c/p\u003e\n\u003cp\u003e\"I know the hold she has on him.\u0026nbsp;\u0026nbsp;I\u0027m counting on It.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve not yet secured any of that substance, sir, although we\u0027re still trying.\"\u003c/p\u003e\n\u003cp\u003e\"I want success, not excuses.\u0026nbsp;\u0026nbsp;Who\u0027s in charge of that?\"\u003c/p\u003e\n\u003cp\u003e\"Kidge, sir.\u0026nbsp;\u0026nbsp;He\u0027s very efficient in this . . .\"\u003c/p\u003e\n\u003cp\u003e\"Is Kidge available?\"\u003c/p\u003e\n\u003cp\u003e\"One moment, sir.\u0026nbsp;\u0026nbsp;I\u0027ll put him on.\"\u003c/p\u003e\n\u003cp\u003eKidge had a phlegmatic Gowachin face and rumbling voice.\u003c/p\u003e\n\u003cp\u003e\"Do you want a status report, sir?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"My Rim contacts believe the addictive substance is derived from a plant called \u0027tibac.\u0027\u0026nbsp;\u0026nbsp;We have no prior record of such a plant, but the outer Rabble has been cultivating it lately.\u0026nbsp;\u0026nbsp;According to my contacts, it\u0027s extremely addictive to Humans, even more so to us.\"\u003c/p\u003e\n\u003cp\u003e\"No record?\u0026nbsp;\u0026nbsp;What\u0027s its origin?\u0026nbsp;\u0026nbsp;Do they say?\"\u003c/p\u003e\n\u003cp\u003e\"I talked personally to a Human who\u0027d recently returned from upriver where the outer Rabble reportedly has extensive plantations of this \u0027tibac.\u0027\u0026nbsp;\u0026nbsp;I promised my informant a place in the Warrens if he provides me with a complete report on the stuff and a kilo packet of it.\u0026nbsp;\u0026nbsp;This informant says the cultivators believe tibac has religious significance.\u0026nbsp;\u0026nbsp;I didn\u0027t see any point in exploring that.\"\u003c/p\u003e\n\u003cp\u003e\"When do you expect him to deliver?\"\u003c/p\u003e\n\u003cp\u003e\"By nightfall at the latest.\"\u003c/p\u003e\n\u003cp\u003eBroey held his silence for a moment.\u0026nbsp;\u0026nbsp;Religious significance.\u0026nbsp;\u0026nbsp;More than likely the plant came from beyond the God Wall then, as Kidge implied.\u0026nbsp;\u0026nbsp;But why?\u0026nbsp;\u0026nbsp;What were they doing?\u003c/p\u003e\n\u003cp\u003e\"Do you have new instructions?\" Kidge asked.\u003c/p\u003e\n\u003cp\u003e\"Get that substance up to me as soon as you can.\"\u003c/p\u003e\n\u003cp\u003eKidge fidgeted.\u0026nbsp;\u0026nbsp;He obviously had another question, but was unwilling to ask it.\u0026nbsp;\u0026nbsp;Broey glared at him.\u003c/p\u003e\n\u003cp\u003e\"Yes?\u0026nbsp;\u0026nbsp;What is it?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you want the substance tested first?\"\u003c/p\u003e\n\u003cp\u003eIt was a baffling question.\u0026nbsp;\u0026nbsp;Had Kidge withheld vital information about the dangers of this tibac?\u0026nbsp;\u0026nbsp;One never knew from what quarter an attack might come.\u0026nbsp;\u0026nbsp;But Kidge was held in his own special bondage.\u0026nbsp;\u0026nbsp;He knew what could happen to him if he failed Broey.\u0026nbsp;\u0026nbsp;And Jedrik had handled this stuff.\u0026nbsp;\u0026nbsp;But why had Kidge asked this question?\u0026nbsp;\u0026nbsp;Faced with such unknowns, Broey tended to withdraw into himself, eyes veiled by the nictating membrane while he weighed the possibilities.\u0026nbsp;\u0026nbsp;Presently, he stirred, looked at Kidge in the screen.\u003c/p\u003e\n\u003cp\u003e\"If there\u0027s enough of it, feed some to volunteers - both Human and Gowachin.\u0026nbsp;\u0026nbsp;Get the rest of it up to me immediately, even while you\u0027re testing, but in a sealed container.\"\u003c/p\u003e\n\u003cp\u003e\"Sir, there are rumors about this stuff.\u0026nbsp;\u0026nbsp;It\u0027ll be difficult getting real volunteers.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll think of something.\"\u003c/p\u003e\n\u003cp\u003eBroey broke the connection, returned to the outer room to make his political peace with Gar and Tria.\u0026nbsp;\u0026nbsp;He was not ready to blunt that pair . . . not yet.\u003c/p\u003e\n\u003cp\u003eThey were sitting just as he\u0027d left them.\u0026nbsp;\u0026nbsp;Tria was speaking:\u003c/p\u003e\n\u003cp\u003e\". . . the highest probability and I have to go on that.\"\u003c/p\u003e\n\u003cp\u003eGar merely nodded.\u003c/p\u003e\n\u003cp\u003eBroey seated himself, nodded to Tria, who continued as though there\u0027d been no hiatus.\u003c/p\u003e\n\u003cp\u003e\"Clearly, Jedrik\u0027s a genius.\u0026nbsp;\u0026nbsp;And her Loyalty Index!\u0026nbsp;\u0026nbsp;That has to be false, contrived.\u0026nbsp;\u0026nbsp;And look at her decisions:\u0026nbsp;\u0026nbsp;one questionable decision in four years.\u0026nbsp;\u0026nbsp;One!\"\u003c/p\u003e\n\u003cp\u003eGar moved a finger along the red line on the chart.\u0026nbsp;\u0026nbsp;It was a curiously sensuous gesture, as though he were stroking flesh.\u003c/p\u003e\n\u003cp\u003eBroey gave him a verbal prod.\u003c/p\u003e\n\u003cp\u003e\"Yes, Gar, what is it?\"\u003c/p\u003e\n\u003cp\u003e\"I was just wondering if Jedrik could be another . . .\"\u003c/p\u003e\n\u003cp\u003eHis glance darted ceilingward, back to the chart.\u0026nbsp;\u0026nbsp;They all understood his allusion to intruders from beyond the God Wall.\u003c/p\u003e\n\u003cp\u003eBroey looked at Gar as though awakening from an interrupted thought.\u0026nbsp;\u0026nbsp;What\u0027d that fool Gar mean by raising such a question at this juncture?\u0026nbsp;\u0026nbsp;The required responses were so obvious.\u003c/p\u003e\n\u003cp\u003e\"I agree with Tria\u0027s analysis,\" Broey said.\u0026nbsp;\u0026nbsp;\"As to your question . . .\"\u0026nbsp;\u0026nbsp;He gave a Human shrug.\u0026nbsp;\u0026nbsp;\"Jedrik reveals some of the classic requirements, but . . .\"\u0026nbsp;\u0026nbsp;Again, that shrug.\u0026nbsp;\u0026nbsp;\"This is still the world God gave us.\"\u003c/p\u003e\n\u003cp\u003eColored as they were by his years in the Sacred Congregation, Broey\u0027s words took on an unctuous overtone, but in this room the message was strictly secular.\u003c/p\u003e\n\u003cp\u003e\"The others have been such disappointments,\" Gar said.\u0026nbsp;\u0026nbsp;\"Especially Havvy.\"\u0026nbsp;\u0026nbsp;He moved the statuette to a more central position on the chart.\u003c/p\u003e\n\u003cp\u003e\"We failed because we were too eager,\" Tria said, her voice snappish.\u0026nbsp;\u0026nbsp;\"Poor timing.\"\u003c/p\u003e\n\u003cp\u003eGar scratched his chin with his thumb.\u0026nbsp;\u0026nbsp;Tria sometimes disturbed him by that accusatory tone she took toward their failures.\u0026nbsp;\u0026nbsp;He said:\u003c/p\u003e\n\u003cp\u003e\"But . . . if she turns out to be one of them and we haven\u0027t allowed for it . . .\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll look through that gate when we come to it,\" Broey said.\u0026nbsp;\u0026nbsp;\"If we come to it.\u0026nbsp;\u0026nbsp;Even another failure could have its uses.\u0026nbsp;\u0026nbsp;The food factories will give us a substantial increase at the next harvest.\u0026nbsp;\u0026nbsp;That means we can postpone the more troublesome political decisions which have been bothering us.\"\u003c/p\u003e\n\u003cp\u003eBroey let this thought hang between them while he set himself to identifying the lines of activity revealed by what had happened in this room today.\u0026nbsp;\u0026nbsp;Yes, the Humans betrayed unmistakable signs that they behaved according to a secret plan.\u0026nbsp;\u0026nbsp;Things were going well, then:\u0026nbsp;\u0026nbsp;they\u0027d attempt to supersede him soon . . . and fail.\u003c/p\u003e\n\u003cp\u003eA door behind Tria opened.\u0026nbsp;\u0026nbsp;A fat Human female entered.\u0026nbsp;\u0026nbsp;Her body bulbed in green coveralls and her round face appeared to float in a halo of yellow hair.\u0026nbsp;\u0026nbsp;Her cheeks betrayed the telltale lividity of dacon addiction.\u0026nbsp;\u0026nbsp;She spoke subserviently to Gar.\u003c/p\u003e\n\u003cp\u003e\"You told me to interrupt if . . .\"\u003c/p\u003e\n\u003cp\u003e\"Yes, yes.\"\u003c/p\u003e\n\u003cp\u003eGar waved to indicate she could speak freely.\u0026nbsp;\u0026nbsp;The gesture\u0027s significance did not escape Broey.\u0026nbsp;\u0026nbsp;Another part of their set piece.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve located Havvy but Jedrik\u0027s not with him.\"\u003c/p\u003e\n\u003cp\u003eGar nodded, addressed Broey:\u003c/p\u003e\n\u003cp\u003e\"Whether Jedrik\u0027s an agent or another puppet, this whole thing smells of something they have set in motion.\"\u003c/p\u003e\n\u003cp\u003eOnce more, his gaze darted ceilingward.\u003c/p\u003e\n\u003cp\u003e\"I will act on that assumption,\" Tria said.\u0026nbsp;\u0026nbsp;She pushed her chair back, arose.\u0026nbsp;\u0026nbsp;\"I\u0027m going into the Warrens.\"\u003c/p\u003e\n\u003cp\u003eBroey looked up at her.\u0026nbsp;\u0026nbsp;Again, he felt his talons twitch beneath their sheaths.\u0026nbsp;\u0026nbsp;He said:\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t interfere with them.\"\u003c/p\u003e\n\u003cp\u003eGar forced his gaze away from the Gowachin while his mind raced.\u0026nbsp;\u0026nbsp;Often, the Gowachin were difficult to read, but Broey had been obvious just then:\u0026nbsp;\u0026nbsp;he was confident that he could locate Jedrik and he didn\u0027t care who knew it.\u0026nbsp;\u0026nbsp;That could be very dangerous.\u003c/p\u003e\n\u003cp\u003eTria had seen it, too, of course, but she made no comment, merely turned and followed the fat woman out of the room.\u003c/p\u003e\n\u003cp\u003eGar arose like a folding ruler being opened to its limit.\u0026nbsp;\u0026nbsp;\"I\u0027d best be getting along.\u0026nbsp;\u0026nbsp;There are many matters requiring my personal attention.\"\u003c/p\u003e\n\u003cp\u003e\"We depend on you for a great deal,\" Broey said.\u003c/p\u003e\n\u003cp\u003eHe was not yet ready to release Gar, however.\u0026nbsp;\u0026nbsp;Let Tria get well on her way.\u0026nbsp;\u0026nbsp;Best to keep those two apart for a spell.\u0026nbsp;\u0026nbsp;He said:\u003c/p\u003e\n\u003cp\u003e\"Before you go, Gar.\u0026nbsp;\u0026nbsp;Several things still bother me.\u0026nbsp;\u0026nbsp;Why was Jedrik so precipitate?\u0026nbsp;\u0026nbsp;And why destroy her records?\u0026nbsp;\u0026nbsp;What was it that we were not supposed to see?\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps it was an attempt to confuse us,\" Gar said, quoting Tria.\u0026nbsp;\u0026nbsp;\"One thing\u0027s sure:\u0026nbsp;\u0026nbsp;it wasn\u0027t just an angry gesture.\"\u003c/p\u003e\n\u003cp\u003e\"There must be a clue somewhere,\" Broey said.\u003c/p\u003e\n\u003cp\u003e\"Would you have us risk an interrogation of Havvy?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not!\"\u003c/p\u003e\n\u003cp\u003eGar showed no sign that he recognized Broey\u0027s anger.\u0026nbsp;\u0026nbsp;He said:\u003c/p\u003e\n\u003cp\u003e\"Despite what you and Tria say, I don\u0027t think we can afford another mistake at this time.\u0026nbsp;\u0026nbsp;Havvy was . . . well . . .\"\u003c/p\u003e\n\u003cp\u003e\"If you recall,\" Broey said, \"Havvy was not one of Tria\u0027s mistakes.\u0026nbsp;\u0026nbsp;She went along with us under protest.\u0026nbsp;\u0026nbsp;I wish now we\u0027d listened to her.\"\u0026nbsp;\u0026nbsp;He waved a hand idly in dismissal.\u0026nbsp;\u0026nbsp;\"Go see to your important affairs.\"\u0026nbsp;\u0026nbsp;He watched Gar leave.\u003c/p\u003e\n\u003cp\u003eYes, on the basis of the Human\u0027s behavior it was reasonable to assume he knew nothing as yet about this infiltrator Bahrank was bringing through the gates.\u0026nbsp;\u0026nbsp;Gar would\u0027ve concealed such valuable information, would not have dared raise the issue of a God Wall intrusion . . .\u0026nbsp;\u0026nbsp;Or would he?\u0026nbsp;\u0026nbsp;Broey nodded to himself.\u0026nbsp;\u0026nbsp;This must be handled with great delicacy. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dosadi-experiment-consentiency-universe-2/page-6.html","bookId":2173,"creation":"Oct 5, 2019 6:40:19 PM","modification":"Oct 5, 2019 6:40:19 PM"}
