{"id":99186,"no":9,"title":"Page 9","content":"\u003cp\u003eAll persons act from beliefs they are conditioned not to question, from a set of deeply seated prejudices.\u0026nbsp;\u0026nbsp;Therefore, whoever presumes to judge must be asked:\u0026nbsp;\u0026nbsp;\"How are you affronted?\"\u0026nbsp;\u0026nbsp;And this judge must begin there to question inwardly as well as outwardly.\u003c/p\u003e\n\u003cp\u003e- \"The Question\" from Ritual of the Courtarena Guide to Servants of the Box\u003c/p\u003e\n\u003cp\u003e\"One might suspect you of trying to speak under water,\" McKie accused.\u003c/p\u003e\n\u003cp\u003eHe still sat opposite Aritch in the High Magister\u0027s sanctus, and this near-insult was only one indicator marking the changed atmosphere between them.\u0026nbsp;\u0026nbsp;The sun had dropped closer to the horizon and its spiritual ring no longer outlined Aritch\u0027s head.\u0026nbsp;\u0026nbsp;The two of them were being more direct now, if not more candid, having explored individual capacities and found where profitable discourse might be directed.\u003c/p\u003e\n\u003cp\u003eThe High Magister flexed his thigh tendons.\u003c/p\u003e\n\u003cp\u003eKnowing these people from long and close observation, McKie realized the old Gowachin was in pain from prolonged inactivity.\u0026nbsp;\u0026nbsp;That was an advantage to be exploited.\u0026nbsp;\u0026nbsp;McKie held up his left hand, enumerated on his fingers:\u003c/p\u003e\n\u003cp\u003e\"You say the original volunteers on Dosadi submitted to memory erasure, but many of their descendants are immune to such erasure.\u0026nbsp;\u0026nbsp;The present population knows nothing about our ConSentient Universe.\"\u003c/p\u003e\n\u003cp\u003e\"As far as the present Dosadi population comprehends, they are the only people on the only inhabited planet in existence.\"\u003c/p\u003e\n\u003cp\u003eMcKie found this hard to believe.\u0026nbsp;\u0026nbsp;He held up a third finger.\u003c/p\u003e\n\u003cp\u003eAritch stared with distaste at the displayed hand.\u003c/p\u003e\n\u003cp\u003eThere were no webs between the alien fingers!\u003c/p\u003e\n\u003cp\u003eMcKie said, \"And you tell me that a DemoPol backed up by certain religious injunctions is the primary tool of government there?\"\u003c/p\u003e\n\u003cp\u003e\"An original condition of our experiment,\" Aritch said.\u003c/p\u003e\n\u003cp\u003eIt was not a comprehensive answer, McKie observed.\u0026nbsp;\u0026nbsp;Original conditions invariably changed.\u0026nbsp;\u0026nbsp;McKie decided to come back to this after the High Magister had submitted to more muscle pain.\u003c/p\u003e\n\u003cp\u003e\"Do the Dosadi know the nature of the Caleban barrier which encloses them?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve tried rocket probes, primitive electromagnetic projections.\u0026nbsp;\u0026nbsp;They understand that those energies they can produce will not penetrate their \u0027God Wall.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Is that what they call the barrier?\"\u003c/p\u003e\n\u003cp\u003e\"That or \u0027The Heavenly Veil.\u0027\u0026nbsp;\u0026nbsp;To some degree, these labels measure their attitude toward the barrier.\"\u003c/p\u003e\n\u003cp\u003e\"The DemoPol can serve many governmental forms,\" McKie said.\u0026nbsp;\u0026nbsp;\"What\u0027s the basic form of their government?\"\u003c/p\u003e\n\u003cp\u003eAritch considered this, then:\u003c/p\u003e\n\u003cp\u003e\"The form varies.\u0026nbsp;\u0026nbsp;They\u0027ve employed some eighty different governmental forms.\"\u003c/p\u003e\n\u003cp\u003eAnother nonresponsive answer.\u0026nbsp;\u0026nbsp;Aritch did not like to face the fact that their experiment had assumed warlord trappings.\u0026nbsp;\u0026nbsp;McKie thought about the DemoPol.\u0026nbsp;\u0026nbsp;In the hands of adepts and with a population responsive to the software probes by which the computer data was assembled, the DemoPol represented an ultimate tool for manipulation of a populace.\u0026nbsp;\u0026nbsp;The ConSentiency outlawed its use as an assault on individual rights and freedoms.\u0026nbsp;\u0026nbsp;The Gowachin had broken this prohibition, yes, but a more interesting datum was surfacing:\u0026nbsp;\u0026nbsp;Dosadi had employed some eighty different governmental forms without rejecting the DemoPol.\u0026nbsp;\u0026nbsp;That implied frequent changes.\u003c/p\u003e\n\u003cp\u003e\"How often have they changed their form of government?\"\u003c/p\u003e\n\u003cp\u003e\"You can divide the numbers as easily as I,\" Aritch said. His tone was petulant.\u003c/p\u003e\n\u003cp\u003eMcKie nodded. One thing had become quite clear.\u003c/p\u003e\n\u003cp\u003e\"Dosadi\u0027s masses know about the DemoPol, but you won\u0027t let them remove it!\"\u003c/p\u003e\n\u003cp\u003eAritch had not expected this insight.\u0026nbsp;\u0026nbsp;He responded with revealing sharpness which was amplified by his muscle pains.\u003c/p\u003e\n\u003cp\u003e\"How did you learn that?\"\u003c/p\u003e\n\u003cp\u003e\"You told me.\"\u003c/p\u003e\n\u003cp\u003e\"I?\"\u003c/p\u003e\n\u003cp\u003e\"Quite plainly.\u0026nbsp;\u0026nbsp;Such frequent change is responsive to an irritant - the DemoPol.\u0026nbsp;\u0026nbsp;They change the forms of government, but leave the irritant.\u0026nbsp;\u0026nbsp;Obviously, they cannot remove the irritant.\u0026nbsp;\u0026nbsp;That was clearly part of your experiment - to raise a population resistant to the DemoPol.\"\u003c/p\u003e\n\u003cp\u003e\"A resistant population, yes,\" Aritch said.\u0026nbsp;\u0026nbsp;He shuddered.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve fractured ConSentient Law in many places,\" McKie said.\u003c/p\u003e\n\u003cp\u003e\"Does my Legum presume to judge me?\"\u003c/p\u003e\n\u003cp\u003e\"No.\u0026nbsp;\u0026nbsp;But if I speak with a certain bitterness, please recall that I am a Human.\u0026nbsp;\u0026nbsp;I embrace a profound sympathy for the Gowachin, but I remain Human.\"\u003c/p\u003e\n\u003cp\u003e\"Ahhhh, yes.\u0026nbsp;\u0026nbsp;We must not forget the long Human association with DemoPols.\"\u003c/p\u003e\n\u003cp\u003e\"We survive by selecting the best decision makers,\" McKie said.\u003c/p\u003e\n\u003cp\u003e\"And a DemoPol elevates mediocrity.\"\u003c/p\u003e\n\u003cp\u003e\"Has that happened on Dosadi?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"But you wanted them to try many different governmental forms?\"\u003c/p\u003e\n\u003cp\u003eThe High Magister shrugged, remained silent.\u003c/p\u003e\n\u003cp\u003e\"We Humans found that the DemoPol does profound damage to social relationships.\u0026nbsp;\u0026nbsp;It destroys preselected portions of a society.\"\u003c/p\u003e\n\u003cp\u003e\"And what could we hope to learn by damaging our Dosadi society?\"\u003c/p\u003e\n\u003cp\u003e\"Have we arrived back at the question of expected benefits?\"\u003c/p\u003e\n\u003cp\u003eAritch stretched his aching muscles.\u003c/p\u003e\n\u003cp\u003e\"You are persistent, McKie. I will say that.\"\u003c/p\u003e\n\u003cp\u003eMcKie shook his head sadly.\u003c/p\u003e\n\u003cp\u003e\"The DemoPol was always held up to us as the ultimate equalizer, a source of decision-making miracles.\u0026nbsp;\u0026nbsp;It was supposed to produce a growing body of knowledge about what a society really needed.\u0026nbsp;\u0026nbsp;It was thought to produce justice in all cases despite any odds.\"\u003c/p\u003e\n\u003cp\u003eAritch was irritated.\u0026nbsp;\u0026nbsp;He leaned forward, wincing at the pain of his old muscles.\u003c/p\u003e\n\u003cp\u003e\"One might make the same accusations about the Law as practiced everywhere except on Gowachin worlds!\"\u003c/p\u003e\n\u003cp\u003eMcKie suppressed a sharp response.\u0026nbsp;\u0026nbsp;Gowachin training had forced him to question assumptions about the uses of law in the ConSentiency, about the inherent rightness of any aristocracy, any power bloc whether majority or minority.\u0026nbsp;\u0026nbsp;It was a BuSab axiom that all power blocs tended toward aristocratic forms, that the descendants of decision makers dominated the power niches.\u0026nbsp;\u0026nbsp;BuSab never employed offspring of their agents.\u003c/p\u003e\n\u003cp\u003eAritch repeated himself, a thing Gowachin seldom did.\u003c/p\u003e\n\u003cp\u003e\"Law is delusion and fakery, McKie, everywhere except on the Gowachin worlds!\u0026nbsp;\u0026nbsp;You give your law a theological aura.\u0026nbsp;\u0026nbsp;You ignore the ways it injures your societies.\u0026nbsp;\u0026nbsp;Just as with the DemoPol, you hold up your law as the unvarying source of justice. When you . . .\"\u003c/p\u003e\n\u003cp\u003e\"BuSab has . . .\"\u003c/p\u003e\n\u003cp\u003e\"No! If something\u0027s wrong in your societies, what do you do?\u0026nbsp;\u0026nbsp;You create new law.\u0026nbsp;\u0026nbsp;You never think to remove law or disarm the law.\u0026nbsp;\u0026nbsp;You make more law!\u0026nbsp;\u0026nbsp;You create more legal professionals.\u0026nbsp;\u0026nbsp;We Gowachin sneer at you!\u0026nbsp;\u0026nbsp;We always strive to reduce the number of laws, the number of Legums.\u0026nbsp;\u0026nbsp;A Legum\u0027s first duty is to avoid litigation.\u0026nbsp;\u0026nbsp;When we create new Legums, we always have specific problems in mind.\u0026nbsp;\u0026nbsp;We anticipate the ways that laws damage our society.\"\u003c/p\u003e\n\u003cp\u003eIt was the opening McKie wanted.\u003c/p\u003e\n\u003cp\u003e\"Why are you training a Wreave?\"\u003c/p\u003e\n\u003cp\u003eBelatedly, Aritch realized he had been goaded into revealing more than he had wanted.\u003c/p\u003e\n\u003cp\u003e\"You are good, McKie.\u0026nbsp;\u0026nbsp;Very good.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" McKie persisted.\u0026nbsp;\u0026nbsp;\"Why a Wreave?\"\u003c/p\u003e\n\u003cp\u003e\"You will learn why in time.\"\u003c/p\u003e\n\u003cp\u003eMcKie saw that Aritch would not expand on this answer, but there were other matters to consider now.\u0026nbsp;\u0026nbsp;It was clear that the Gowachin had trained him for a specific problem:\u0026nbsp;\u0026nbsp;Dosadi.\u0026nbsp;\u0026nbsp;To train a Wreave as Legum, they\u0027d have an equally important problem in mind . . . perhaps the same problem.\u0026nbsp;\u0026nbsp;A basic difference in the approach to law, species differentiated, had surfaced, however, and this could not be ignored.\u0026nbsp;\u0026nbsp;McKie well understood the Gowachin disdain for all legal systems, including their own.\u0026nbsp;\u0026nbsp;They were educated from infancy to distrust any community of professionals, especially legal professionals.\u0026nbsp;\u0026nbsp;A Legum could only tread their religious path when he completely shared that distrust.\u003c/p\u003e\n\u003cp\u003eDo I share that distrust?\u003c/p\u003e\n\u003cp\u003eHe thought he did.\u0026nbsp;\u0026nbsp;It came naturally to a BuSab agent.\u0026nbsp;\u0026nbsp;But most of the ConSentiency still held its professional communities in high esteem, ignoring the nature of the intense competition for new achievements which invariably overcame such communities:\u0026nbsp;\u0026nbsp;new achievements, new recognition.\u0026nbsp;\u0026nbsp;But the new could be illusion in such communities because they always maintained a peer review system nicely balanced with peer pressures for ego rewards.\u003c/p\u003e\n\u003cp\u003e\"Professional always means power,\" the Gowachin said.\u003c/p\u003e\n\u003cp\u003eThe Gowachin distrusted power in all of its forms.\u0026nbsp;\u0026nbsp;They gave with one hand and took with the other.\u0026nbsp;\u0026nbsp;Legums faced death whenever they used the Law.\u0026nbsp;\u0026nbsp;To make new law in the Gowachin Courtarena was to bring about the elegant dissolution of old law with a concomitant application of justice.\u003c/p\u003e\n\u003cp\u003eNot for the first time, McKie wondered about the unknown problems a High Magister must face.\u0026nbsp;\u0026nbsp;It would have to be a delicate existence indeed.\u0026nbsp;\u0026nbsp;McKie almost formed a question about this, thought better of it.\u0026nbsp;\u0026nbsp;He shifted instead to the unknowns about Dosadi.\u0026nbsp;\u0026nbsp;God Wall?\u0026nbsp;\u0026nbsp;Heavenly Veil?\u003c/p\u003e\n\u003cp\u003e\"Does Dosadi often accept a religious oligarchy?\"\u003c/p\u003e\n\u003cp\u003e\"As an outward form, yes.\u0026nbsp;\u0026nbsp;They currently are presided over by a supreme Elector, a Gowachin by the name of Broey.\"\u003c/p\u003e\n\u003cp\u003e\"Have Humans ever held power equal to Broey\u0027s?\"\u003c/p\u003e\n\u003cp\u003e\"Frequently.\"\u003c/p\u003e\n\u003cp\u003eIt was one of the most responsive exchanges that McKie had achieved with Aritch.\u0026nbsp;\u0026nbsp;Although he knew he was following the High Magister\u0027s purpose, McKie decided to explore this.\u003c/p\u003e\n\u003cp\u003e\"Tell me about Dosadi\u0027s social forms.\"\u003c/p\u003e\n\u003cp\u003e\"They are the forms of a military organization under constant attack or threat of attack.\u0026nbsp;\u0026nbsp;They form certain cabals, certain power enclaves whose influences shift.\"\u003c/p\u003e\n\u003cp\u003e\"Is there much violence?\"\u003c/p\u003e\n\u003cp\u003e\"It is a world of constant violence.\"\u003c/p\u003e\n\u003cp\u003eMcKie absorbed this.\u0026nbsp;\u0026nbsp;Warlords.\u0026nbsp;\u0026nbsp;Military society.\u0026nbsp;\u0026nbsp;He knew he had just lifted a corner of the real issue which had brought the Gowachin to the point of obliterating Dosadi.\u0026nbsp;\u0026nbsp;It was an area to be approached with extreme caution.\u0026nbsp;\u0026nbsp;McKie chose a flanking approach.\u003c/p\u003e\n\u003cp\u003e\"Aside from the military forms, what are the dominant occupations?\u0026nbsp;\u0026nbsp;How do they perceive guilt and innocence?\u0026nbsp;\u0026nbsp;What are their forms of punishment, of absolution?\u0026nbsp;\u0026nbsp;How do they . . .\"\u003c/p\u003e\n\u003cp\u003e\"You do not confuse me, McKie.\u0026nbsp;\u0026nbsp;Consider, Legum:\u0026nbsp;\u0026nbsp;there are better ways to answer such questions.\"\u003c/p\u003e\n\u003cp\u003eBrought up short by the Magister\u0027s chiding tone, McKie fell into silence.\u0026nbsp;\u0026nbsp;He glanced out the oval window, realizing he\u0027d been thrown onto the defensive with exquisite ease.\u0026nbsp;\u0026nbsp;McKie felt the nerves tingling along his spine.\u0026nbsp;\u0026nbsp;Danger!\u0026nbsp;\u0026nbsp;Tandaloor\u0027s golden sun had moved perceptibly closer to the horizon.\u0026nbsp;\u0026nbsp;That horizon was a blue-green line made hazy by kilometer after kilometer of hair trees whose slender female fronds waved and hunted in the air.\u0026nbsp;\u0026nbsp;Presently, McKie turned back to Aritch.\u003c/p\u003e\n\u003cp\u003eBetter ways to answer such questions.\u003c/p\u003e\n\u003cp\u003eIt was obvious where the High Magister\u0027s thoughts trended.\u0026nbsp;\u0026nbsp;The experimenters would, of course, have ways of watching their experiment.\u0026nbsp;\u0026nbsp;They could also influence their experiment, but it was obvious there were limits to this influence.\u0026nbsp;\u0026nbsp;A population resistant to outside influences?\u0026nbsp;\u0026nbsp;The implied complications of this Dosadi problem daunted McKie.\u0026nbsp;\u0026nbsp;Oh, the circular dance the Gowachin always performed!\u003c/p\u003e\n\u003cp\u003eBetter ways.\u003c/p\u003e\n\u003cp\u003eAritch cleared his ventricle passages with a harsh exhalation, then:\u003c/p\u003e\n\u003cp\u003e\"Anticipating the possibility that others would censure us, we gave our test subjects the Primary.\"\u003c/p\u003e\n\u003cp\u003eDevils incarnate!\u0026nbsp;\u0026nbsp;The Gowachin set such store on their damned Primary!\u0026nbsp;\u0026nbsp;Of course all people were created unequal and had to find their own level!\u003c/p\u003e\n\u003cp\u003eMcKie knew he had no choice but to plunge into the maelstrom.\u003c/p\u003e\n\u003cp\u003e\"Did you also anticipate that you\u0027d be charged with violating sentient rights on a massive scale?\"\u003c/p\u003e\n\u003cp\u003eAritch shocked him by a brief puffing of jowls, the Gowachin shrug.\u003c/p\u003e\n\u003cp\u003eMcKie allowed himself a warning smile.\u003c/p\u003e\n\u003cp\u003e\"I remind the High Magister that he raised the issue of the Primary.\"\u003c/p\u003e\n\u003cp\u003e\"Truth is truth.\"\u003c/p\u003e\n\u003cp\u003eMcKie shook his head sharply, not caring what this revealed.\u0026nbsp;\u0026nbsp;The High Magister couldn\u0027t possibly have that low an estimation of his Legum\u0027s reasoning abilities.\u0026nbsp;\u0026nbsp;Truth indeed!\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll give you truth:\u0026nbsp;\u0026nbsp;the ConSentiency has laws on this subject to which the Gowachin are signatories!\"\u003c/p\u003e\n\u003cp\u003eEven as the words fell from his lips, McKie realized this was precisely where Aritch had wanted him to go.\u0026nbsp;\u0026nbsp;They\u0027ve learned something from Dosadi!\u0026nbsp;\u0026nbsp;Something crucial!\u003c/p\u003e\n\u003cp\u003eAritch massaged the painful muscles of his thighs, said, \"I remind you, Legum, that we peopled Dosadi with volunteers.\"\u003c/p\u003e\n\u003cp\u003e\"Their descendants volunteered for nothing!\"\u003c/p\u003e\n\u003cp\u003e\"Ancestors always volunteer their descendants - for better or for worse.\u0026nbsp;\u0026nbsp;Sentient rights?\u0026nbsp;\u0026nbsp;Informed consent?\u0026nbsp;\u0026nbsp;The ConSentiency has been so busy building law upon law, creating its great illusion of rights, that you\u0027ve almost lost sight of the Primary\u0027s guiding principle:\u0026nbsp;\u0026nbsp;to develop our capacities.\u0026nbsp;\u0026nbsp;People who are never challenged never develop survival strengths!\"\u003c/p\u003e\n\u003cp\u003eDespite the perils, McKie knew he had to press for the answer to his original question:\u0026nbsp;\u0026nbsp;benefits.\u003c/p\u003e\n\u003cp\u003e\"What\u0027ve you learned from your monster?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll soon have a complete answer to that question.\"\u003c/p\u003e\n\u003cp\u003eAgain, the implication that he could actually watch Dosadi.\u0026nbsp;\u0026nbsp;But first it\u0027d be well to disabuse Aritch of any suspicion that McKie was unaware of the root implications.\u0026nbsp;\u0026nbsp;The issue had to be met head on.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not going to implicate me.\"\u003c/p\u003e\n\u003cp\u003e\"Implicate you?\"\u0026nbsp;\u0026nbsp;There was no mistaking Aritch\u0027s surprise.\u003c/p\u003e\n\u003cp\u003e\"No matter how you use what you\u0027ve learned from Dosadi, you\u0027ll be suspected of evil intent.\u0026nbsp;\u0026nbsp;Whatever anyone learns from . . .\"\u003c/p\u003e\n\u003cp\u003e\"Oh, that.\u0026nbsp;\u0026nbsp;New data gives one power.\"\u003c/p\u003e\n\u003cp\u003e\"And you do not confuse me, Aritch.\u0026nbsp;\u0026nbsp;In the history of every species there are many examples of places where new data has been gravely abused.\"\u003c/p\u003e\n\u003cp\u003eAritch accepted this without question.\u0026nbsp;\u0026nbsp;They both knew the background.\u0026nbsp;\u0026nbsp;The Gowachin distrusted power in all of its forms, yet they used power with consummate skill.\u0026nbsp;\u0026nbsp;The trend of McKie\u0027s thoughts lay heavily in this room now.\u0026nbsp;\u0026nbsp;To destroy Dosadi would be to hide whatever the Gowachin had learned there.\u0026nbsp;\u0026nbsp;McKie, a non-Gowachin, therefore, would learn these things, would share the mantle of suspicion should it be cast.\u0026nbsp;\u0026nbsp;The historical abuses of new data occurred between the time that a few people learned the important thing and the time when that important thing became general knowledge.\u0026nbsp;\u0026nbsp;To the Gowachin and to BuSab it was the \"Data Gap,\" a source of constant danger.\u003c/p\u003e\n\u003cp\u003e\"We would not try to hide what we\u0027ve learned,\" Aritch said, \"only how we learned it.\"\u003c/p\u003e\n\u003cp\u003e\"And it\u0027s just an academic question whether you destroy an entire planet and every person on it!\"\u003c/p\u003e\n\u003cp\u003e\"Ahh, yes:\u0026nbsp;\u0026nbsp;academic.\u0026nbsp;\u0026nbsp;What you don\u0027t know, McKie, is that one of our test subjects on Dosadi has initiated, all on her own, a course of events which will destroy Dosadi very quickly whether we act or not.\u0026nbsp;\u0026nbsp;You\u0027ll learn all about this very soon when, like the good Legum we know you to be, you go there to experience this monster with your own flesh.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-dosadi-experiment-consentiency-universe-2/page-9.html","bookId":2173,"creation":"Oct 5, 2019 6:40:19 PM","modification":"Oct 5, 2019 6:40:19 PM"}
