{"id":90756,"no":30,"title":"Page 30","content":"\u003cp\u003eFrom her front porch, Cassie could see the flickering blue of the television flashing like a strobe light in a haunted house. Her mother must be waiting up for her.\u003c/p\u003e\n\u003cp\u003e\"I should go right in,\" Cassie said, gripping the door handle. \"She\u0027s up.\"\u003c/p\u003e\n\u003cp\u003e\"Not yet.\" Adam reached for her hand and squeezed it.\u003c/p\u003e\n\u003cp\u003e\"With everything going on,\" he said, \"and everything that\u0027s happened, I want you to know that we\u0027ll get through it.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" Cassie said.\u003c/p\u003e\n\u003cp\u003e\"Are you sure?\" He leaned in for a kiss, but he stopped just shy of her lips.\u003c/p\u003e\n\u003cp\u003eCassie could feel his breath on her skin and the warmth of his body so close to hers. She held his gaze, and her heart pounded heavily in her chest.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m positive.\" She pulled him in toward her, meeting his soft lips with hers. With a wild abandon she had forgotten, she and Adam melded into one, and she let herself be swept away.\u003c/p\u003e\n\u003cp\u003eThey kissed like that until they were both heated and flushed. Cassie allowed her breathing to slow and her heart to settle. Then she stared up at him, captivated for a moment by the course of life pulsing between them. The silver cord, she thought, the mystifying bond that had connected her to him from the beginning, and always would. It was stronger now than ever. After the wild mix of would. It was stronger now than ever. After the wild mix of emotions Cassie had experienced these past few weeks, one thing emerged solid and bright. She realized in a whole new way just how lucky she was to have Adam by her side.\u003c/p\u003e\n\u003cp\u003e\"I love you,\" she said.\u003c/p\u003e\n\u003cp\u003eHe smiled brightly. \"And I love you.\"\u003c/p\u003e\n\u003cp\u003eShe kissed him once more, tenderly, and inhaled a full breath of him. \"I really love you,\" she said.\u003c/p\u003e\n\u003cp\u003eHis blue eyes sparkled, and he laughed aloud. \"We can play this game all night.\"\u003c/p\u003e\n\u003cp\u003e\"Or our whole lives,\" Cassie said, beaming back at him.\u003c/p\u003e\n\u003cp\u003eShe found she couldn\u0027t take her eyes from his. They drew her closer and closer in.\u003c/p\u003e\n\u003cp\u003e\"Maybe even longer.\"\u003c/p\u003e\n\u003cp\u003eWhen Cassie finally made her way into the house, she shut the front door behind her and paused. Her mother looked almost like a ghost, and about as frightened as if she\u0027d seen one. Cassie felt awful she\u0027d caused her to worry so much. Her mother had every right to be angry with her.\u003c/p\u003e\n\u003cp\u003e\"Mom,\" she said. \"I am so sorry.\"\u003c/p\u003e\n\u003cp\u003eWhen her mother made no response, she added, \"I needed to go to Cape Cod; it was an emergency. And then\u0026nbsp;\u0026nbsp;- \"\u003c/p\u003e\n\u003cp\u003e\"Forget about the car,\" her mother said. \"Are you okay?\" Cassie nodded and dropped her bag at the door. When she reached her mother\u0027s arms, she looked up at her, hoping to see a sign of reprieve in her eyes. But instead, a saddened expression passed over her mother\u0027s face, like a massive wave of pain.\u003c/p\u003e\n\u003cp\u003e\"Mom?\" Cassie asked, not even sure what to say.\u003c/p\u003e\n\u003cp\u003eHer mother\u0027s large black eyes, shadowed by dark circles, filled with tears. \"I thought you ran away,\" she said.\u003c/p\u003e\n\u003cp\u003e\"And then I thought you were dead. I swear I could feel your pain.\"\u003c/p\u003e\n\u003cp\u003eShe spoke quietly and regretfully, and Cassie realized her mother probably could feel when she was in pain. They were connected, and she was a witch, after all.\u003c/p\u003e\n\u003cp\u003e\"You seem to be pulling away from me, just when I thought we were becoming closer,\" her mother said. \"Was it something I did or said that upset you? Tell me.\" When Cassie found out her mother kept Scarlett a secret, it seemed like such a betrayal, like the worst secret in the world to keep hidden for her entire life. But now, looking at her mother\u0027s frail, penitent face, Cassie realized she\u0027d done it to protect her. She must have known Scarlett was evil.\u003c/p\u003e\n\u003cp\u003e\"Oh, Mom,\" Cassie said. \"I wasn\u0027t angry, just confused. I was confused about so much.\"\u003c/p\u003e\n\u003cp\u003eAfter everything that had happened, Cassie realized it was time to finally tell her mom the truth.\u003c/p\u003e\n\u003cp\u003e\"I have so much to tell you,\" Cassie said.\u003c/p\u003e\n\u003cp\u003eCassie didn\u0027t even know where to begin, but she did her best to speak evenly and not leave anything out. She dug her nails into her palms and went on, uninterrupted, for what felt like forever. Then her mother took a shallow breath in and shut her eyes. Cassie knew it was time to be quiet and let her speak.\u003c/p\u003e\n\u003cp\u003e\"Scarlett\u0027s mother didn\u0027t shy away from the dark side of Black John either,\" she said. \"She\u0027d been banned from our Circle for performing dark magic. But I\u0027d hoped those days were behind us now. That\u0027s why I never mentioned Scarlett.\"\u003c/p\u003e\n\u003cp\u003eCassie nodded, and her mother took her face into her hands. \"I would have never kept it from you if I thought you were in danger.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not your fault,\" Cassie said. \"I should have told you when I found out about her.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not anybody\u0027s fault,\" her mother said. \"But it\u0027s still come to this.\" She took a deep breath and stood up.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s something I\u0027ve been waiting to give you until it was necessary,\" she said cryptically. \"Now seems to be that time.\"\u003c/p\u003e\n\u003cp\u003eThe tone of her voice was puzzling. \"What is it?\" Cassie asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be right back.\"\u003c/p\u003e\n\u003cp\u003eHer mother left the room and was gone longer than Cassie expected her to be. But just when Cassie was about to go looking for her, she returned with a book in her hands. It was a faded leather-bound journal with gold, deckle-edged pages. It looked to Cassie like an old bible.\u003c/p\u003e\n\u003cp\u003e\"This was your father\u0027s Book of Shadows,\" her mother said, holding it out to her with both hands.\u003c/p\u003e\n\u003cp\u003eCassie froze, paralyzed, and felt the blood drain out of her face. Black John\u0027s Book of Shadows - just the thought of it made her shudder. Black magic was something she felt was better left unexplored.\u003c/p\u003e\n\u003cp\u003eHer mother continued holding the book out to her. \"It\u0027s okay,\" she said. \"You can touch it.\"\u003c/p\u003e\n\u003cp\u003eCassie reached out to take it from her mother reluctantly.\u003c/p\u003e\n\u003cp\u003eThe book felt cruel and cold in her hands - it almost felt alive.\u003c/p\u003e\n\u003cp\u003e\"How did you get this?\" Cassie asked.\u003c/p\u003e\n\u003cp\u003eHer mother sat back down beside her. \"It\u0027s a long story.\u003c/p\u003e\n\u003cp\u003eBut it\u0027s been hidden here in this house for quite some time.\u003c/p\u003e\n\u003cp\u003eYou have to understand, in the wrong hands, this book could be extremely dangerous.\"\u003c/p\u003e\n\u003cp\u003eLike the Master Tools, Cassie thought. \"And you want me to have it?\"\u003c/p\u003e\n\u003cp\u003eHer mother\u0027s face was stern. \"You\u0027ll need it if you stand any chance of defeating Scarlett.\"\u003c/p\u003e\n\u003cp\u003eThe book was heavier than it appeared to be, like its contents were greater than the sum of its pages. It was impossible to comprehend the dark spells and secrets it enclosed. Cassie noticed that its black leather cover wasn\u0027t completely smooth. It was faintly embossed with a symbol that reminded Cassie of the inscriptions on the silver bracelet and the diadem. There were also dull scratches and indentations, like fingernails had worn into its surface.\u003c/p\u003e\n\u003cp\u003eAnd its upper-right-hand corner was eroded almost completely gray, like a deteriorated oval-shaped stamp.\u003c/p\u003e\n\u003cp\u003eBlack John\u0027s fingerprint, Cassie realized.\u003c/p\u003e\n\u003cp\u003eShe jerked her eyes away from the grayed spot, and her stomach lurched. She was intrigued by it, but it also upset her.\u003c/p\u003e\n\u003cp\u003eCassie refocused on the embossed symbol, trying to remember where else she\u0027d seen that design. And then she remembered: It was identical to the inscription on Black John\u0027s lodestone ring, the one used to identify him as John Blake, and later as John Brunswick.\u003c/p\u003e\n\u003cp\u003eHaving this book in her hands was the closest thing now to having Black John there in the room with her. It felt like all the darkness in the world might begin to pour forth from its pages at any moment.\u003c/p\u003e\n\u003cp\u003eCassie\u0027s mother watched her handle the book apprehensively. \"I know it feels alive to you,\" she said. \"But it\u0027s just a book, I promise. And you are strong enough to handle it.\" There was a candidness in her eyes that Cassie had never seen before.\u003c/p\u003e\n\u003cp\u003eThe book shivered in Cassie\u0027s hands as she tried to calm herself. It was just paper and words, that\u0027s all it was.\u003c/p\u003e\n\u003cp\u003eAnd its words contained the key to defeating Scarlett, saving the Circle, and getting the Master Tools back. She didn\u0027t have the luxury of pretending this book didn\u0027t exist, as evil and frightening as it felt to her. She couldn\u0027t simply put it back into its hiding place. It was her responsibility to read it, study it, and ingest its secrets until they became part of who she was. Only then would she be strong enough against Scarlett.\u003c/p\u003e\n\u003cp\u003eHer mother silently observed her mental struggle and seemed to know exactly what she was thinking.\u003c/p\u003e\n\u003cp\u003e\"Remember, Cassie,\" she said. \"There\u0027s so much goodness in you. There\u0027s much more light in your soul than dark. Do you recognize that?\"\u003c/p\u003e\n\u003cp\u003eCassie nodded. \"I think so.\"\u003c/p\u003e\n\u003cp\u003e\"But there are things in this book that won\u0027t be easy for you to read. Do you understand what I mean by that?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Cassie said.\u003c/p\u003e\n\u003cp\u003e\"If you open it,\" her mother warned, \"there\u0027s no going back.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-secret-circle-the-divide-the-secret-circle-4/page-30.html","bookId":2098,"creation":"Oct 5, 2019 5:44:39 PM","modification":"Oct 5, 2019 5:44:39 PM"}
