{"id":65598,"no":22,"title":"Page 22","content":"\u003cp\u003eHe squeezed his eyes closed with a curse, unable to deny it.\u003c/p\u003e\n\u003cp\u003e“Did you come when I did, Lucien?” She lubricated her palms and then curled her hands around him. “How terribly naughty of you. But you’re still so hard, ready to do it again.”\u003c/p\u003e\n\u003cp\u003eHis hips began to pump upward as she used both hands to stroke him off. “Jesus . . . Julienne . . .” Sweat dripped from his brow, dampening the inky hair on his forehead.\u003c/p\u003e\n\u003cp\u003e“What a shame for your trollop,” she murmured. “I have no experience with male anatomy, but I know you’re well-endowed. So hot and huge. My hands can barely close around your cock.” She pressed her mouth against his ear. “Like a wild stallion. But that woman out there won’t have the pleasure of riding you tonight.” Biting the lobe of his ear, she whispered hotly, “You will never be mine, but for tonight, at least, you won’t be hers either.”\u003c/p\u003e\n\u003cp\u003eLucien growled.\u003c/p\u003e\n\u003cp\u003eHis fingers flexed against her kneecaps, and his shaft pulsed in her hands. Julienne memorized the beauty of his face flushed with passion, his gorgeous eyes narrowed and watching her, his mouth swollen and parted on heaving gasps. She stroked him faster, running her thumbs over the slickness on the tip, wanting to give him pleasure. Pumping her fists with greater and greater urgency, Julienne relished the guttural cries that tore from his throat.\u003c/p\u003e\n\u003cp\u003eShe loved the feel of him, soft satin over steel, and the way he liked to be pleasured, hard and primitive. His entire body tensed beneath her, his cock swelled in her hands, telling her how close he was.\u003c/p\u003e\n\u003cp\u003e“Come for me, darling,” she urged. “Come until there’s nothing left for any other woman.”\u003c/p\u003e\n\u003cp\u003eHe cursed, and then twisted his hips, releasing his seed in powerful spurts across the rug. Julienne continued to attend to him, drawing out everything he had, until her hands were covered in his semen, until Lucien slumped in exhaustion, his body twitching, his breathing labored.\u003c/p\u003e\n\u003cp\u003eOnly then did she release him. She brushed featherlight kisses across his closed lids and parted lips, all the while carefully unwinding his cravat. Then she wiped her hands off with it. She stood and tossed the ruined linen on his chest.\u003c/p\u003e\n\u003cp\u003e“Good-bye, Lucien.”\u003c/p\u003e\n\u003cp\u003eGlorious with anger, she left him spent on the floor.\u003c/p\u003e\n\u003cp\u003eChapter Eight\u003c/p\u003e\n\u003cp\u003eJulienne collected Aunt Eugenia and left the ball immediately.\u003c/p\u003e\n\u003cp\u003eShe was relieved to return to Montrose Hall. With her emotions in turmoil, she longed for a glass of sherry and a warm bath. As the butler closed the door behind them, their housekeeper approached with a letter in hand. “Lord Montrose returned this evening, my lady. I was told to present this to you upon your return.”\u003c/p\u003e\n\u003cp\u003e“Dear heaven,” Eugenia muttered. “What now?”\u003c/p\u003e\n\u003cp\u003eJulienne opened the missive and read quickly. Furious, she stomped her slippered foot on the marble floor. “The idiot returned to London only to leave straight away for a party.”\u003c/p\u003e\n\u003cp\u003e“A party? With what we’ve been through these last weeks?”\u003c/p\u003e\n\u003cp\u003e“I will need my cloak back,” Julienne informed the startled butler. “And have the carriage brought around again.”\u003c/p\u003e\n\u003cp\u003e“No, Julienne.”\u003c/p\u003e\n\u003cp\u003eShe turned wide-eyed to her aunt.\u003c/p\u003e\n\u003cp\u003eEugenia shook her head. “Our position is too precarious. Risking your reputation at a time like this could lead to our ruin. I’m ashamed of myself for allowing Hugh to run wild like this, and I’m ashamed that you’ve been the one to go haring after him every time.” She sighed. “I haven’t done a very good job of being the disciplinarian, I’m afraid. It’s time I corrected that. I shall be the one to go after him.”\u003c/p\u003e\n\u003cp\u003eJulienne leaned over and kissed her aunt’s cheek. “You’ve done a remarkable job. But you’ll have to trust me. The places Hugh frequents would make you swoon, and we can’t have that.”\u003c/p\u003e\n\u003cp\u003e“Oh, I don’t know about that. I was married, and you’re just a—”\u003c/p\u003e\n\u003cp\u003e“Do you know what a dildo is?”\u003c/p\u003e\n\u003cp\u003eEugenia’s eyes widened. “Good grief!”\u003c/p\u003e\n\u003cp\u003e“Or the Kama Sutra?”\u003c/p\u003e\n\u003cp\u003eEugenia waved her hands in front of her face. “Of course, I’ve heard of such things, but for you to have been exposed . . . Good heavens.”\u003c/p\u003e\n\u003cp\u003e“See? You’re already on the verge of a fit of vapors.” Julienne grabbed her aunt’s elbow and led her toward the stairs. “I shall see to Hugh.”\u003c/p\u003e\n\u003cp\u003e“You cannot go back to Remington’s! If Fontaine were to hear of it—”\u003c/p\u003e\n\u003cp\u003e“I don’t believe Hugh went to Remington’s,” she said dryly. “He owes too much money there.”\u003c/p\u003e\n\u003cp\u003e“Too much . . . Oh, dear God, we’re ruined!” Eugenia shook her head, resigned.\u003c/p\u003e\n\u003cp\u003e“Now, now. Order some hot tea and settle in. Don’t worry yourself. I will locate Hugh, and we’ll sort this entire mess out.” She prodded her aunt up the stairs.\u003c/p\u003e\n\u003cp\u003e“I don’t feel right about you going out alone at this hour, Julienne.”\u003c/p\u003e\n\u003cp\u003e“I know,” she soothed. “I won’t be gone long.”\u003c/p\u003e\n\u003cp\u003e“The last time you said that, you spent the night with Lucien Remington!”\u003c/p\u003e\n\u003cp\u003e“Aunt Eugenia!” Julienne glanced around the foyer in dismay. “Keep your voice down!”\u003c/p\u003e\n\u003cp\u003eHer aunt grumbled her way up the stairs, glancing down at the foyer indecisively every few steps.\u003c/p\u003e\n\u003cp\u003eJulienne moved into the study to wait for the carriage, and poured herself two fingers of Hugh’s expensive brandy. She lifted the tumbler and downed the contents, coughing and wincing as the potent liquor burned its way down her throat. Her body still hummed vibrantly from her earlier orgasm, but deep inside, her heart was cold. The things Lucien had said . . . that woman he was with . . .\u003c/p\u003e\n\u003cp\u003eNo. She couldn’t think of that now, or she would go mad.\u003c/p\u003e\n\u003cp\u003eShe had to think about Hugh, who was in for a surprise. She was weary of his irresponsibility, and at the present moment, she was furious with every male on the planet.\u003c/p\u003e\n\u003cp\u003eHer brother was about to discover that firsthand.\u003c/p\u003e\n\u003cp\u003eIt was nearly dawn, and Julienne was close to exhaustion by the time the carriage pulled up to the fourth house. She was relying on her coachman to find her brother based on his knowledge of Hugh’s favorite haunts. This was her final stop. If this was not the correct party, she would return to Montrose Hall and wait for Hugh there.\u003c/p\u003e\n\u003cp\u003eHer footman climbed the steps and made the necessary inquiries. Moments later, he opened the carriage door. “Lord Montrose arrived an hour past, my lady.”\u003c/p\u003e\n\u003cp\u003e“Good.” She alighted from the carriage and wrapped her cloak tighter around her.\u003c/p\u003e\n\u003cp\u003eAs she walked up the short staircase, Julienne admired the grand Georgian design. It was large for a townhouse, and the beautifully maintained façade proudly boasted the wealth of its owner. The door was held open, and she swept right in, using the hood of her cloak to hide her face.\u003c/p\u003e\n\u003cp\u003eShe found her brother in a richly appointed billiards room, surrounded by a large and boisterous group of gentlemen and demimondaines. Julienne waited for him to notice her in the doorway, unwilling to risk stepping inside. Hugh laughed at a pretty brunette’s witticism and then glanced her way. Despite her hood and cloak, he recognized her. His humor fled, turning into wide-eyed, mouth-agape horror. He left his companions without a word and hastened toward her with his long-legged stride. Gripping her elbow, he pulled her into the shadows.\u003c/p\u003e\n\u003cp\u003eHugh La Coeur was renowned for a great many things in addition to his propensity for hedonism. He was a beautiful male specimen, with golden hair and dark, heavy-lidded eyes. He’d emerged victorious from two duels, and was considered to be an expert marksman and swordsman. If only he’d focus that level of intensity on making money, they could climb out of the financial mire they were in now.\u003c/p\u003e\n\u003cp\u003e“Jules, what the devil are you doing here?” he cried.\u003c/p\u003e\n\u003cp\u003e“What do you think, Hugh?” Her voice rose with anger. “You irresponsible, self-centered—”\u003c/p\u003e\n\u003cp\u003eHe clamped a tobacco-scented hand over her mouth and tugged her down the hall. Opening a closed door, he pushed her into a dimly lit parlor. “If Fontaine heard word of your presence in this house, it would be a disaster!”\u003c/p\u003e\n\u003cp\u003eJulienne pulled her arm from his grip. “And then he might not be inclined to offer for me, and you would be ruined in debt. I can well collect your concern.”\u003c/p\u003e\n\u003cp\u003eHugh had the decency to flush. “You would be ruined as well,” he pointed out gruffly.\u003c/p\u003e\n\u003cp\u003e“At this point, Hugh, I would find the loss of my reputation to be worth it if you would learn your lesson.” She slashed her hand through the air. “Your rakehell days are over. I’ve come to like Lord Fontaine. It troubles me to think of his money being used to pay for your selfish indulgences. I will not allow him to support you forever. You must do your duty to the title. You need to maintain the estates, make the tenants happy, and find someone you can trust to make some investments for you.”\u003c/p\u003e\n\u003cp\u003eHugh gaped. “Hell’s teeth! I will not engage in trade!”\u003c/p\u003e\n\u003cp\u003e“Swallow your pride,” she snapped. “You have squandered centuries of Le Coeur heritage in less than a decade. Now you must find a way to rebuild it.” She crossed her arms and lifted her chin. “And you will start doing so immediately. You no longer have the luxury of parties such as these. You should be home, sleeping, in preparation for the day’s hard work on the morrow.”\u003c/p\u003e\n\u003cp\u003e“Damnation.” His hands went to his hips. “I will not be dictated to!”\u003c/p\u003e\n\u003cp\u003e“And you will not whore me out to pay for your lifestyle!”\u003c/p\u003e\n\u003cp\u003eHugh was shocked into silence. He was still young enough that his hard living had not yet etched its passing on his handsome face, but that wouldn’t last long. If he continued on his present course of endless indulgences, he would age before his time. But Julienne would fight tooth and nail before she allowed that to happen.\u003c/p\u003e\n\u003cp\u003eHe lowered his head. “Ah hell, Jules. You are correct, as usual. I’m dreadfully sorry for having gotten us into this morass.” He ran a hand through his hair and looked at her with suddenly weary eyes. “I’m not suited to being Montrose. I never have been. You have no idea how often I wish Father and Mother were still alive. I miss them, and I had so much yet to learn . . .”\u003c/p\u003e\n\u003cp\u003e“I understand, Hugh, truly. But you are the only one who can do this,” she said with a sigh. “We all have responsibilities in life. This is your burden to bear. I will assist you as best I can and help you find your footing, but you will have to do what is necessary to keep yourself there.”\u003c/p\u003e\n\u003cp\u003eHe began to pace. “Have you discussed our situation with Fontaine?”\u003c/p\u003e\n\u003cp\u003e“Not yet.”\u003c/p\u003e\n\u003cp\u003e“But Jules,” Hugh cried, “you have to tell him.”\u003c/p\u003e\n\u003cp\u003eJulienne narrowed her eyes. “Exactly how much trouble are we in?”\u003c/p\u003e\n\u003cp\u003eHe flushed, and her gut clenched.\u003c/p\u003e\n\u003cp\u003e“Cut to the heart of it,” she ordered. “I don’t have the stomach to listen to an accounting of every shilling.”\u003c/p\u003e\n\u003cp\u003eHugh quit pacing and faced her squarely. “It’s mostly gambling debts.”\u003c/p\u003e\n\u003cp\u003e“I’m aware of that. How much, Hugh?” She rubbed the space between her brows, fighting off a headache.\u003c/p\u003e\n\u003cp\u003e“Well, I owe White’s twenty thousand pounds and—”\u003c/p\u003e\n\u003cp\u003e“Twenty thousand?” she screeched.\u003c/p\u003e\n\u003cp\u003e“Hush, Jules!” He winced and shot a glance at the door. “Perhaps you should sit.”\u003c/p\u003e\n\u003cp\u003e“Good heavens,” she muttered, her eyes widening. Julienne began to tap her foot in a rapid staccato on the Aubusson rug. “Tell me that is your largest creditor.”\u003c/p\u003e\n\u003cp\u003e“Now, Julienne, I realize—”\u003c/p\u003e\n\u003cp\u003e“Out with it. We don’t have all night.”\u003c/p\u003e\n\u003cp\u003e“We should discuss this at home.”\u003c/p\u003e\n\u003cp\u003e“Oh, no. Right here will be sufficient.” She arched a brow. “Who is your largest creditor, and how much do you owe them?”\u003c/p\u003e\n\u003cp\u003eHugh’s shoulders slumped. “Remington’s. I owe one hundred thousand pounds.”\u003c/p\u003e\n\u003cp\u003eJulienne swayed on her feet. “One hundred thousand?” she breathed as the blood drained from her face. “To Lucien Remington?”\u003c/p\u003e\n\u003cp\u003eHe reached out to steady her. “Don’t faint, Jules,” he pleaded. “I’m sorry about all of this, but that bastard Remington kept my accounts open. White’s cut me off at twenty thousand, but—”\u003c/p\u003e\n\u003cp\u003e“No more!” she snapped, pushing him away. “Don’t blame Lucien Remington for your weakness. I will not have you disparaging him in any way. Do you understand? In any way. He has made something of himself, built an empire. You have done this to us. You alone are responsible.”\u003c/p\u003e\n\u003cp\u003eHugh recoiled from her sharp tone, one she’d never used with him before. “He could ruin us!”\u003c/p\u003e\n\u003cp\u003e“And who gave him that power?” she countered.\u003c/p\u003e\n\u003cp\u003eHe opened his mouth to speak, but she cut him off with an upraised hand. “I’m exhausted, and I don’t wish to discuss your problems anymore this evening. Fetch your cloak. We’re leaving.”\u003c/p\u003e\n\u003cp\u003eAs the door to the parlor closed, the two intertwined figures on the settee separated, and one sat up.\u003c/p\u003e\n\u003cp\u003e“Fascinating,” Amanda murmured, as she straightened her bodice.\u003c/p\u003e\n\u003cp\u003eMagnus, Duke of Glasser, brushed aside her dark hair to nuzzle her neck. “Not as fascinating as what I have right here,” he murmured wickedly.\u003c/p\u003e\n\u003cp\u003e“Glass, for heaven’s sake. Don’t you realize we’ve just met our future daughter-in-law?” She brushed his roving hands away.\u003c/p\u003e\n\u003cp\u003eThe duke heaved a long-suffering sigh and sat up beside her. “We didn’t meet anyone. We eavesdropped. And it sounded like the chit has her claws in Fontaine. Why would she want Charles?”\u003c/p\u003e\n\u003cp\u003e“Charles?” She rolled her eyes. “For heaven’s sake, Glass, pay attention. I’m talking about Lucien.”\u003c/p\u003e\n\u003cp\u003e“Lucien?” he queried, obviously confused. “She’s an earl’s daughter. And from the sound of it, she’s well on her way to being a marchioness. What would she want with Lucien?”\u003c/p\u003e\n\u003cp\u003e“What woman wouldn’t want Lucien? He’s the spitting image of you, handsome devil that you are.” She smiled seductively. “And didn’t you hear Lady Julienne defend him? There’s something afoot there. She likes him.” \u003c/p\u003e","sourceLink":"https://allnovel.net/scandalous-liaisons-historical-4/page-22.html","bookId":2666,"creation":"Oct 5, 2019 9:58:19 AM","modification":"Oct 5, 2019 9:58:19 AM"}
