{"id":74509,"no":13,"title":"Page 13","content":"\u003cp\u003e“Alexa, I’m heading to the ladies’ room. Want to come with?”\u003c/p\u003e\n\u003cp\u003eHe liked Dan’s girlfriend, Lauren, but he could cheerfully kill her right now. Hmm, did she have any allergies?\u003c/p\u003e\n\u003cp\u003eHe watched Alexa as she crossed the room, laughing about something or other with Lauren. Yep, still hot in that dress from this angle.\u003c/p\u003e\n\u003cp\u003eFor a second, he wondered what the night would have been like if Alexa wasn’t there with him. That was easy: miserable. With her here, though, it had been more than okay. Fun, even, which is the last thing he thought this wedding would be.\u003c/p\u003e\n\u003cp\u003e“Another drink?” Dan plopped down in the seat next to him.\u003c/p\u003e\n\u003cp\u003e“What? Oh, yeah, sure.”\u003c/p\u003e\n\u003cp\u003e“You’ve got it bad with that one. Nice going.” Dan jerked his head in the direction of where Lauren and Alexa had disappeared. Drew had no idea how to respond to that, so he just shrugged and smiled.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Bill slurred. “I’d hit that one. I’ve always wanted to bang a black girl. What’s it like, Drew?”\u003c/p\u003e\n\u003cp\u003eDrew didn’t realize he’d stood up until he felt Dan pull him in the direction of the bar. He resisted for a second, the rage in his bloodstream pushing him to charge at Bill, but after a second or two he allowed himself to be dragged away. Dan waved at the bartender, who promptly set two neat whiskeys at the end of the bar for them.\u003c/p\u003e\n\u003cp\u003e“I could throw him off the roof,” he said to Dan once he’d calmed down enough to speak.\u003c/p\u003e\n\u003cp\u003e“You could,” Dan said. “And you probably should. But maybe wait until after the wedding? Too many witnesses right now.”\u003c/p\u003e\n\u003cp\u003eDrew picked up his drink and looked around the room for Alexa. At least she hadn’t heard Bill.\u003c/p\u003e\n\u003cp\u003e“All I know is that I’m keeping him the hell away from Alexa for the rest of the night.”\u003c/p\u003e\n\u003cp\u003eLauren ran up to her room to retrieve her lipstick, so Alexa killed some time texting Maddie an update from inside one of the bathroom stalls. All of a sudden, her ears perked up at a conversation by the sinks.\u003c/p\u003e\n\u003cp\u003e“I thought Drew was the one to break up with Molly?”\u003c/p\u003e\n\u003cp\u003e“He was. He totally destroyed her when he did it, too.” That was Amy. “But I bet he was pissed when Josh and Molly started dating.” She laughed. “When he gets rid of that date of his, I have an idea for a place he can find someone who looks a lot like Molly.”\u003c/p\u003e\n\u003cp\u003eThe conversation faded as they left the bathroom. Drew had told her Molly had broken up with him, hadn’t he? Had he lied to her, or was she remembering things wrong?\u003c/p\u003e\n\u003cp\u003eThirty seconds later while looking in the mirror she got another hit to the psyche. One glance down at her clutch to take out her lipstick, and when she looked back up, she was flanked by thin blond women.\u003c/p\u003e\n\u003cp\u003eAll three of them were in cocktail dresses shorter and tighter than anything she’d dare to wear because of her thighs and hips and butt. Their perky little breasts were obviously unencumbered by bras, and their long, thin legs looked even longer and thinner because of their sky-high heels. And there she was in between them, in the dress that her friends would say made her look “voluptuous,” which was just another word for “fat.”\u003c/p\u003e\n\u003cp\u003eShe couldn’t believe Maddie had convinced her not to wear Spanx. She’d felt great in that dress just a few hours ago when she left Drew’s hotel room, but was that just beer and flattering lighting? Maddie had never steered her wrong before, but then Maddie was her friend and loved her. Maddie would give her tough love about many things in life, but she would never say something bad about her body. That was the problem with good friends: they were too damn supportive sometimes.\u003c/p\u003e\n\u003cp\u003eAnd she’d spent the night falling deeper and deeper in lust with Drew, with those damn tingles every time he touched her, and the whole time he was probably looking at all of those other women, wishing he was with one of them.\u003c/p\u003e\n\u003cp\u003eShe needed to shake this off to get through the rest of this night. Pep-talk-in-the-hallway time.\u003c/p\u003e\n\u003cp\u003eOkay, Alexa Elizabeth Monroe, she said in her head, none of this matters, remember? You’re just here because you told Olivia and Maddie about it before you realized you should back out. You’re wearing a great dress, you’re drinking some free alcohol and eating good food, and you’re going to leave in—\u003c/p\u003e\n\u003cp\u003eShe started when she felt a hand on her shoulder mid–mental pep talk. Not Drew’s. How was it that she already knew his touch? She shook off that question and turned to find Lauren behind her.\u003c/p\u003e\n\u003cp\u003e“There you are! Dan texted me that he and Drew are over at the bar. Let’s go find them.”\u003c/p\u003e\n\u003cp\u003eThey found them at the bar, all right. Drew, Dan . . . and Amy. Alexa sighed. Maybe she needed another pep talk. Amy’s little dig about being too skinny for a dress like Alexa’s had already been ringing in her ears, and now she was standing there with her hands all over Drew.\u003c/p\u003e\n\u003cp\u003eThe cotton candy pink did look ridiculous on her, at least.\u003c/p\u003e\n\u003cp\u003e“Hey!” Drew said as Alexa and Lauren approached. He felt like he’d been scanning the room for her for an hour. “You guys found us.” He stepped away from Amy and put his arm around Alexa’s waist.\u003c/p\u003e\n\u003cp\u003e“Now are you guys coming?” Amy asked.\u003c/p\u003e\n\u003cp\u003eAlexa turned and looked up at him with a question in her eyes. Before he could answer it, Amy grabbed his hand.\u003c/p\u003e\n\u003cp\u003e“They’re going to cut the cake, remember?” she said. Yeah, he remembered. Amy had been bugging him about it for the past five minutes. Why he had to stand around and watch two people put a fake cut into a huge cake, he’d never understand.\u003c/p\u003e\n\u003cp\u003ePlus, he’d rather stand over here in the corner with his arm around Alexa’s waist.\u003c/p\u003e\n\u003cp\u003e“In a second, Amy. We’ll meet you over there.”\u003c/p\u003e\n\u003cp\u003eAmy huffed and walked away. He turned his full attention back to Alexa. But instead of looking back up at him like he wanted her to do, she stared after Amy with a weird look on her face.\u003c/p\u003e\n\u003cp\u003e“Come on,” she said. “They’re cutting the cake. Let’s go watch.”\u003c/p\u003e\n\u003cp\u003eHe reached for her hand as they walked across the ballroom and was glad when she took it. Was she upset about the allergy thing? She’d barely even glanced at him when she came back from the bathroom.\u003c/p\u003e\n\u003cp\u003eAs they stood in the crowd surrounding Josh and Molly, she gripped his hand and stared fixedly ahead with that big smile from before planted firmly on her face.\u003c/p\u003e\n\u003cp\u003e“Are we cool?” he said in her ear. She jumped. Something occurred to him. “Is something wrong? Did Bill say anything to you?”\u003c/p\u003e\n\u003cp\u003eShe turned to him with her eyebrows raised.\u003c/p\u003e\n\u003cp\u003e“Bill? No, why?”\u003c/p\u003e\n\u003cp\u003eHe looked into her eyes, but she seemed to be genuinely confused. Okay, Bill hadn’t gotten to her, and it seemed like no one had told her what Bill had said.\u003c/p\u003e\n\u003cp\u003e“Nothing, don’t worry about it,” he said. “It wasn’t a big deal.”\u003c/p\u003e\n\u003cp\u003eHer eyes didn’t move from his face. Fine, he wouldn’t have believed himself, either.\u003c/p\u003e\n\u003cp\u003e“I’ll tell you later,” he said, wondering if that would work.\u003c/p\u003e\n\u003cp\u003eIt didn’t.\u003c/p\u003e\n\u003cp\u003eHer laughter had no mirth in it. The crowd around them oohed and aahed at the stupid cake. She put her finger on his chin and tilted his head down to be level with her own.\u003c/p\u003e\n\u003cp\u003e“It was either something gross about my body or something racist. Which one?” she asked.\u003c/p\u003e\n\u003cp\u003eAround them, people toasted to Josh and Molly. Alexa let go of him and raised her glass. He lifted his by rote and drank.\u003c/p\u003e\n\u003cp\u003e“The latter,” he said, after a few long moments.\u003c/p\u003e\n\u003cp\u003eShe took another sip of her drink.\u003c/p\u003e\n\u003cp\u003e“He seemed like that kind of guy,” she said.\u003c/p\u003e\n\u003cp\u003eMolly came up to them before he had a chance to apologize for Bill.\u003c/p\u003e\n\u003cp\u003e“Drew, Alexa, hi! Alexa, I didn’t get a chance to say earlier, you look so beautiful tonight!” Molly was red-cheeked and beaming, not quite drunk but definitely tipsy. Drew knew the signs.\u003c/p\u003e\n\u003cp\u003e“Oh, Molly, thank you so much, but you look stunning! That dress is incredible and this wedding has been so lovely. Thank you so much for welcoming me,” Alexa said, squeezing Molly’s hand. No one would have been able to tell from the look on her face that they’d just been having a kind of tense conversation.\u003c/p\u003e\n\u003cp\u003e“You are so kind. I’m so delighted that Drew has found you!” Molly said.\u003c/p\u003e\n\u003cp\u003eSo was he, he realized.\u003c/p\u003e\n\u003cp\u003e“So am I,” he said, and slid his arm around Alexa’s waist. She relaxed against him, and he sighed in relief. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wedding-date/page-13.html","bookId":1776,"creation":"Oct 5, 2019 10:31:47 AM","modification":"Oct 5, 2019 10:31:47 AM"}
