{"id":74519,"no":23,"title":"Page 23","content":"\u003cp\u003eGreat, I’ll check flights.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you’re not spinning around in your office chair,” Theo said, standing at her office door.\u003c/p\u003e\n\u003cp\u003eShe jumped.\u003c/p\u003e\n\u003cp\u003e“How did you know I had something to be spinning about?”\u003c/p\u003e\n\u003cp\u003eTheo plopped into the chair on the other side of her desk.\u003c/p\u003e\n\u003cp\u003e“Um, because I was sitting right there when he said he wanted the memo?”\u003c/p\u003e\n\u003cp\u003eThe memo, right. That’s what he was talking about.\u003c/p\u003e\n\u003cp\u003e“Oh. Yeah, right, I was thinking of . . . something else.”\u003c/p\u003e\n\u003cp\u003eTheo paused mid-reach toward her candy jar.\u003c/p\u003e\n\u003cp\u003e“Wait a minute. What could you possibly be thinking about other than your project?” He looked from Alexa’s face to her phone. “Who’s the guy?”\u003c/p\u003e\n\u003cp\u003eShe tried to hold back her smile and failed.\u003c/p\u003e\n\u003cp\u003e“Um. Close the door.”\u003c/p\u003e\n\u003cp\u003eTheo jumped up to close the door and was back at her desk in seconds.\u003c/p\u003e\n\u003cp\u003e“Talk. We can talk about the memo in a second. I don’t have another meeting for”—he looked at his watch—“forty-five minutes. Go.”\u003c/p\u003e\n\u003cp\u003eShe rooted through her candy jar to find a Jolly Rancher.\u003c/p\u003e\n\u003cp\u003e“Soooo, funny story . . .”\u003c/p\u003e\n\u003cp\u003eSome people might say Drew’s terrible mood during those two hours after he’d texted Alexa was because he’d convinced himself she wasn’t going to write back. After ten minutes of nothing, he’d decided that her gentle way of letting him down would be to never answer, and his desperation would be out there floating in the wind forever.\u003c/p\u003e\n\u003cp\u003eThat wasn’t why he’d been in such a bad mood, he insisted to himself, and then to Carlos, when he stopped by on the way to get more coffee. It was just because of those irritating parents he had to deal with this morning. Carlos didn’t believe him. He didn’t really believe himself either.\u003c/p\u003e\n\u003cp\u003eIt was kind of amazing how little he cared about those irritating parents after Alexa texted back, though.\u003c/p\u003e\n\u003cp\u003eIn the middle of their tame text conversation about flight times, he ventured a suggestion.\u003c/p\u003e\n\u003cp\u003eYou gonna show up to the flight without panties like yesterday?\u003c/p\u003e\n\u003cp\u003eHer reply came back within seconds.\u003c/p\u003e\n\u003cp\u003eMaybe.\u003c/p\u003e\n\u003cp\u003eHe grinned down at his phone.\u003c/p\u003e\n\u003cp\u003eFriday morning, he tried to convince himself the spring in his step was only because his apartment was spotless for the first time in months, thanks to the emergency visit from a house cleaner. Carlos was at the clinic all day, not the main hospital, so there was no one there to argue that point with him.\u003c/p\u003e\n\u003cp\u003eAll he had that day were some appointments in the morning and assisting Dr. Montgomery on a surgery for four-year-old Jack, one of Drew’s favorite patients. He’d been hit by a car about a month ago, and one of his bones wasn’t healing right. Throughout it all, the kid had been a trooper, and his parents had been attentive and thoughtful.\u003c/p\u003e\n\u003cp\u003eBut Jack’s surgery got pushed back. From noon to two. Then at one thirty, word came from Dr. Montgomery’s office that it was going to be at least another hour, maybe two. Drew dropped by the waiting room to check on Jack and his parents. Jack was playing happily on the floor with a pile of Legos.\u003c/p\u003e\n\u003cp\u003e“Dr. Nick! Look what I did!”\u003c/p\u003e\n\u003cp\u003e“Hey, Jack, good job. Hey, Abby, Fred, how are you guys holding up?”\u003c/p\u003e\n\u003cp\u003eJack’s mom, Abby, looked up at him and shrugged as she helped Jack pull apart two blue Legos.\u003c/p\u003e\n\u003cp\u003e“Hanging in there, but we thought we’d be done by now.”\u003c/p\u003e\n\u003cp\u003eDrew sighed.\u003c/p\u003e\n\u003cp\u003e“Yeah, me, too. Dr. Montgomery had an emergency. I’m so sorry about this.”\u003c/p\u003e\n\u003cp\u003eThe frustrating thing was that Drew could have done the surgery alone, but Dr. Montgomery had taken an interest in the case, and it’s not like he could tell the parents, Oh no, don’t wait for the expert, he’s not worth it.\u003c/p\u003e\n\u003cp\u003e“They told us,” Abby said. “At least they let us feed him a little once it got pushed back, otherwise this would be even more of a nightmare.”\u003c/p\u003e\n\u003cp\u003eDrew was grateful he’d sent word to the nurses to get Jack some food; sometimes you had to relax the “no eating before surgery” rules with kids.\u003c/p\u003e\n\u003cp\u003e“Can I get you two anything?” Drew asked them. “Coffee, tea, water?”\u003c/p\u003e\n\u003cp\u003eFred smiled at him.\u003c/p\u003e\n\u003cp\u003e“Thanks, Dr. Nichols. I went on a coffee run, so we’re good. Thanks for checking on us. We appreciate it.”\u003c/p\u003e\n\u003cp\u003eWhen he finally got word that Dr. Montgomery was out of his emergency surgery, he did a quick mental calculation and realized there was no way he was going to be on time to pick up Alexa from the airport. Now he’d be late, she’d be sitting at LAX—possibly without panties on—getting more and more frustrated, and the whole weekend would be fucked up.\u003c/p\u003e\n\u003cp\u003eDamn it. He called Carlos.\u003c/p\u003e\n\u003cp\u003e“Hey man, I need a huge favor.”\u003c/p\u003e\n\u003cp\u003eCarlos was clearly in the car; Drew could hear the air whistling through the windows.\u003c/p\u003e\n\u003cp\u003e“Shouldn’t you be getting ready for Alexa?” Carlos asked.\u003c/p\u003e\n\u003cp\u003eWhy was he friends with such a jackass?\u003c/p\u003e\n\u003cp\u003e“Yeah, that’s the thing. My surgery got pushed back, so I’m going to be stuck here for a while. Can you pick her up from the airport and bring her to my apartment? You have my keys, right? I’ll owe you in beer for the next two months.”\u003c/p\u003e\n\u003cp\u003eHe could hear Carlos’s car shut off, and he got switched off speakerphone.\u003c/p\u003e\n\u003cp\u003e“No problem, man. Text me her flight info and how I can find her. Or should I just take all of the short black women with big boobs at LAX to your apartment so you can pick?”\u003c/p\u003e\n\u003cp\u003eDrew lay his head down on his desk.\u003c/p\u003e\n\u003cp\u003e“I’m going to regret this, aren’t I?”\u003c/p\u003e\n\u003cp\u003e“Oh, no doubt, you absolutely are. Good luck with the surgery!”\u003c/p\u003e\n\u003cp\u003eDrew texted Alexa the change of plans. Hopefully, she wouldn’t be pissed. She knew he was a doctor, so it would be okay. Right?\u003c/p\u003e\n\u003cp\u003eAlexa had given her boss two hard copies and an email version of her memo right before he walked out the door on Friday afternoon. She’d barely slept all week, between her regular work, texting Drew, writing and editing the memo every night, thinking about Drew, and, oh yeah, stressing about the upcoming weekend. Thursday night, she’d made her last edits on the memo, after copious notes from Theo, and had packed probably way too many clothes for a weekend trip to L.A.\u003c/p\u003e\n\u003cp\u003eShe slipped into the bathroom at work right before leaving for the airport, stepped out of her underwear, and tucked them into the bottom of her tote bag. When she came out of the stall, she couldn’t even look herself in the eye in the mirror.\u003c/p\u003e\n\u003cp\u003eShe sang along to her girl-power playlist in the car on the way to the airport, which helped to psych herself up. But the text from Drew brought her down to earth.\u003c/p\u003e\n\u003cp\u003eMy surgery got pushed back so I’m running late. My buddy Carlos is going to pick you up and bring you to my apartment. He drives a red BMW his number is 310-555-4827 if you can’t find him, but he’s got your number too.\u003c/p\u003e\n\u003cp\u003eHuh. He was a doctor; these things happened. But she felt so deflated. Now she had no real idea when she was going to get to see him tonight. How long was this surgery supposed to last? Was she supposed to just tuck herself in his bed and wait for him? Thank God she’d thrown her yoga pants in her suitcase. And brought her laptop.\u003c/p\u003e\n\u003cp\u003eAnd the friend picking her up had a red BMW? Oh God, he was going to be one of those fancy car assholes, wasn’t he? Welcome to L.A.\u003c/p\u003e\n\u003cp\u003eShe forced herself to put together a weekend work to-do list while on the flight. When she read it over, she saw she’d repeated three different things. Too distracted for more work, she pulled a fashion magazine out of her bag and updated her Sephora wish list, just in case that dream gift certificate actually came.\u003c/p\u003e\n\u003cp\u003eWhen her flight landed, she had texts from both Maddie and Theo, wishing her luck (Maddie) and asking a work question (Theo). And one from a 310 number:\u003c/p\u003e\n\u003cp\u003eHey Alexa, Drew’s friend Carlos here. Picking you up bc he can’t. Look for the red car. See you soon.\u003c/p\u003e\n\u003cp\u003eShe wished tone came through easier on text messages. Was this guy the asshole that the red sports car would make him seem? And, oh God, had Drew told him the same girlfriend story he’d given the people at the wedding, or did he know the real story? She couldn’t even ask Drew because he was in surgery. She’d just have to play it by ear.\u003c/p\u003e\n\u003cp\u003eFifteen minutes later, Alexa stood outside and realized one of the big differences between Northern and Southern California: a lot more red sports cars in Southern California. She smiled tentatively at each one, but so far she was 0 for 5 as they sped by. Or maybe Drew hadn’t described her and Carlos was looking for one of those tall, blond, skinny women like she’d seen in the bathroom at the wedding? \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wedding-date/page-23.html","bookId":1776,"creation":"Oct 5, 2019 10:31:47 AM","modification":"Oct 5, 2019 10:31:47 AM"}
