{"id":74528,"no":32,"title":"Page 32","content":"\u003cp\u003eHe went to a birthday party, one that he would have happily bailed on to be in Berkeley. He left before the blonde in the strapless dress who reminded him of Amy could put her hand on his ass again. Sunday afternoon, he almost texted Vivian, a girl he’d been sleeping with for a while in the fall, but he watched golf on the couch all afternoon instead. He was relieved to fill in for someone and be on call on Monday.\u003c/p\u003e\n\u003cp\u003eCarlos burst into Drew’s office on Wednesday afternoon.\u003c/p\u003e\n\u003cp\u003e“Hey man, my trip to Hawaii was great, thanks for asking.”\u003c/p\u003e\n\u003cp\u003eDrew looked up from his stack of files.\u003c/p\u003e\n\u003cp\u003e“You were in Hawaii?”\u003c/p\u003e\n\u003cp\u003eCarlos rolled his eyes and dropped into a chair.\u003c/p\u003e\n\u003cp\u003e“You’re such an asshole. My cousin’s wedding? I was a groomsman? I left Friday morning, which is why you had to cover for me on Friday?”\u003c/p\u003e\n\u003cp\u003eHe shrugged.\u003c/p\u003e\n\u003cp\u003e“Right, sorry that your travel schedule isn’t on the top of my mind at every moment of the day. You have my apologies.” He went back to puzzling out his own handwriting in his files.\u003c/p\u003e\n\u003cp\u003e“Wow, someone is still in a shitty mood, huh?” Carlos settled into the chair. Damn it, he should have just smiled and asked him about his trip and he would have been gone after a few minutes. Now he was going to have to deal with this bullshit.\u003c/p\u003e\n\u003cp\u003e“Just busy, that’s all.”\u003c/p\u003e\n\u003cp\u003eCarlos looked at the pile of files on his desk and raised his eyebrows. Drew only did this work when he was forced into it or had nothing else to do to keep him occupied, and Carlos knew it.\u003c/p\u003e\n\u003cp\u003e“So I’m guessing from the look on your face that you didn’t go to Berkeley last weekend? Did you even try to fix it?”\u003c/p\u003e\n\u003cp\u003eDrew kept his eyes on his computer and attempted to keep his voice level.\u003c/p\u003e\n\u003cp\u003e“Leave it alone, Carlos.”\u003c/p\u003e\n\u003cp\u003eOf course he’d thought about trying to fix it. But what was the point?\u003c/p\u003e\n\u003cp\u003eCarlos stood up, thank God.\u003c/p\u003e\n\u003cp\u003e“Fine, keep brooding. But you’d better have pulled yourself together by the time we go to San Francisco this weekend.”\u003c/p\u003e\n\u003cp\u003eDrew’s head shot up. What the hell was he talking about? Why the hell would he be going to San Francisco?\u003c/p\u003e\n\u003cp\u003eCarlos laughed. At, not with him, he was pretty sure.\u003c/p\u003e\n\u003cp\u003e“The American Association of Pediatric Hospital Medicine Conference? We planned it, like, two months ago? We’re the only two junior peds from this hospital who get to go? We leave tomorrow?”\u003c/p\u003e\n\u003cp\u003eDrew laid his head down on his desk, lifted it, and banged it back down. Luckily, the files on his desk cushioned him.\u003c/p\u003e\n\u003cp\u003e“You remember now, I see.” Carlos walked to the door. “Have fun packing.”\u003c/p\u003e\n\u003cp\u003eDrew let out a sigh when he was finally alone again in his office. Great, just the place he didn’t want to go. He jumped when Carlos poked his head back in the door.\u003c/p\u003e\n\u003cp\u003e“You should call her and tell her you’ll be in town.”\u003c/p\u003e\n\u003cp\u003eDrew got up and slammed the door in Carlos’s face.\u003c/p\u003e\n\u003cp\u003eMaddie was all in for Theo’s party, especially since her on-again, off-again relationship with Chris was off, this time (she said) for good. Thank God; Alexa had never liked that guy. Maddie volunteered to be the designated driver for the night on the condition that Alexa wear whatever she ordered.\u003c/p\u003e\n\u003cp\u003eThis meant that Alexa sat in Maddie’s car Saturday night in a leather jacket and a strapless black dress, wearing altogether too much eye makeup and heels at least an inch too high. Sometimes giving the reins over to Maddie wasn’t the best idea.\u003c/p\u003e\n\u003cp\u003e“Are you sure about this outfit?” she asked Maddie again, even though it was too late to change. “I have way too much cleavage with this dress, and this makeup isn’t me. Plus, this is San Francisco. All of the dudes there will be in jeans and hoodies.”\u003c/p\u003e\n\u003cp\u003e“Just because their standards are low does not mean that we should lower ours.” Maddie backed into the parking spot on a side street that they’d found after ten minutes of circling. “And why do you care about your cleavage? What happened to ‘If you’ve got them, flaunt them’?”\u003c/p\u003e\n\u003cp\u003eAlexa checked her reflection in the car mirror one last time.\u003c/p\u003e\n\u003cp\u003e“There are going to be a ton of douchebags here tonight, that’s what happened. All of those tech bros that Theo’s friend Nate knows. And the rest of the people there will be people I’ve worked with. I don’t want them to think . . .”\u003c/p\u003e\n\u003cp\u003eMaddie jumped out of the car and shut the door. Alexa knew a hint to stop talking when she heard one.\u003c/p\u003e\n\u003cp\u003eShe grinned when she looked at Maddie, wearing a hot pink minidress and tall black boots. Hopefully, at least Maddie would get some action tonight. She needed to find someone good to her after that asshole Chris.\u003c/p\u003e\n\u003cp\u003e“All right, fine,” Alexa said. “Let’s do this.”\u003c/p\u003e\n\u003cp\u003e“I can’t handle this for one more minute,” Drew whispered to Carlos.\u003c/p\u003e\n\u003cp\u003eIt was the awards dinner at the conference. The ballroom of the Palace Hotel was filled to the brim with self-congratulatory doctors. Drew wanted to stab himself in the head with a fork.\u003c/p\u003e\n\u003cp\u003e“On it,” Carlos said. “I’m going to the bathroom in two minutes. Three minutes later, you go up to the bar for another drink. We’ll meet up by the taxi stand outside and get the hell out of here.”\u003c/p\u003e\n\u003cp\u003eIn ten minutes, the two of them were in a cab, laughing at how well they’d executed their plan. It was the first moment of fun Drew had had in two days. The conference had been educational, sure, and he’d gotten to spend more time with Dr. Davis, his mentor from med school, but it had been two full days of networking and listening and smiling and taking notes, even in the hotel bar at night. And the whole time he kept trying to not remember that Alexa was just a bridge away. Thank God Carlos was there, too. He would have died from either boredom or frustration otherwise.\u003c/p\u003e\n\u003cp\u003e“Where are we going?” He hadn’t paid attention when Carlos had yelled out an address to the cabbie.\u003c/p\u003e\n\u003cp\u003e“I just told him 24th and Valencia. I figured we could find somewhere good to go around there, and no one from the conference is going to get that far from here.” He thought for a minute. “And if they do, we want to know who they are so we can find them at next year’s conference.”\u003c/p\u003e\n\u003cp\u003eThey walked into the first bar they found and were soon drinking bourbon and watching basketball with everyone else sitting at the bar. Halfway through the first bourbon their jackets were off and their ties were loosened. By the time they’d finished their drinks, they’d made friends with the bearded dudes on either side of them and their tattooed bartender, so much so that they ordered a large pizza for delivery to the bar, with the bartender’s blessing.\u003c/p\u003e\n\u003cp\u003eAfter his third drink, Drew got up to find the bathroom. His new friends pointed him to the back of the bar, so he weaved through a crowd of people to get there. On his way back to his barstool he heard the laughter. He turned his head and saw her.\u003c/p\u003e\n\u003cp\u003eShe was over in the corner, and a black dude in glasses had his arm around her. Without thinking about it, he walked toward them and stopped just outside their circle.\u003c/p\u003e\n\u003cp\u003e“Alexa.”\u003c/p\u003e\n\u003cp\u003eShe turned, and when her eyes met his, her smile blew him away all over again. It was hesitant at first, and then grew in strength, like a light with a dimming switch being turned up. He smiled back at her, trying to think of what to say, but between the bourbon and the hunger and her smile, his mind was blank.\u003c/p\u003e\n\u003cp\u003e“Drew. What . . . what are you doing here?”\u003c/p\u003e\n\u003cp\u003eShe didn’t sound upset to see him, and she was still smiling at him. Those were good signs. But that guy’s arm was still around her.\u003c/p\u003e\n\u003cp\u003eSuddenly, instead of being on the other side of the circle of people from her, he was right in front of her.\u003c/p\u003e\n\u003cp\u003e“What am I doing at this bar, or in San Francisco?” he asked. He wanted to reach out for her but stopped himself.\u003c/p\u003e\n\u003cp\u003e“Either.” She raised her eyebrows and her smile dimmed a little. “Both.”\u003c/p\u003e\n\u003cp\u003eHe touched her hand but didn’t take it. Had he forgotten how good it felt to be around her, or had he forced himself to block that out?\u003c/p\u003e\n\u003cp\u003e“Conference. Carlos and I are both here.” He inclined his head in the direction of the bar. “We had to bail on the awards dinner tonight, and somehow we ended up here.” He moved closer to her, so their bodies were almost touching. He could feel her body heat through that tight dress she was wearing. She didn’t move away. “And you?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wedding-date/page-32.html","bookId":1776,"creation":"Oct 5, 2019 10:31:47 AM","modification":"Oct 5, 2019 10:31:47 AM"}
