{"id":74544,"no":48,"title":"Page 48","content":"\u003cp\u003e“Don’t worry about it, Drew. You don’t need to explain. Your feelings come through loud and clear.” She opened the door and ran back downstairs before he could reach for her again.\u003c/p\u003e\n\u003cp\u003eThank God no one was in the bathroom. She ducked in there for a few minutes to take a deep breath and swallow the tears that had threatened. She washed her hands, dabbed cold water under her eyes, and faked a smile at herself in the mirror like she hadn’t just had a sangria-fueled relationship-ending fight in the middle of a party.\u003c/p\u003e\n\u003cp\u003eWhen she walked out of the bathroom, she ran into Heather, coming out of the kitchen with more cupcakes.\u003c/p\u003e\n\u003cp\u003e“Awesome, you can help me carry these.” Heather handed her a tray of cupcakes. Thankful for something to do, Alexa carried them outside. She took a deep breath before she walked through the door, but a quick scan of the crowd showed her no evidence of either Drew or Carlos in the yard. She did see Lucy, though, and put two red velvet cupcakes on a plate for the two of them.\u003c/p\u003e\n\u003cp\u003e“You said this was your favorite, right?” Alexa held out the plate to Lucy, and soon they both had red tongues and lips smeared in cream cheese frosting. Robin joined them with a cupcake of her own and a pile of napkins. Alexa had just relaxed a little and wiped her mouth when the circle opened and she heard Drew’s voice.\u003c/p\u003e\n\u003cp\u003e“Alexa.” His voice was steady, like their fight had made no impact on him. “I got a call. I’ve got to be at the hospital in thirty minutes.” He touched his hand to her shoulder and dropped it almost as quickly. “Sorry to do this to you guys, but I have to take Alexa away from you: duty calls.”\u003c/p\u003e\n\u003cp\u003eShe thought about telling him that she’d stay, that she could get a ride home later, and also that he could go fuck himself.\u003c/p\u003e\n\u003cp\u003eBut her political training hadn’t completely deserted her; not even this much sangria would allow her to let all of these people know her business. So instead, she gave everyone in the group hugs good-bye amid false promises of getting drinks “the next time she was in town” and followed Drew to his car.\u003c/p\u003e\n\u003cp\u003eDrew had stayed in Heather’s bedroom for a while after Alexa had fled. He’d wanted to run after her, to tell her no, she’d gotten it all wrong, that wasn’t how he felt. But he’d already made a mess of this conversation, so he figured he should maybe wait and try again when they got home after the party and could really talk.\u003c/p\u003e\n\u003cp\u003eBut then he got the call from the hospital and had to run outside and grab her in a hurry. He’d thought about asking Carlos to drive her home, but after basically accusing Carlos of hitting on her, he wasn’t in the best position to ask Carlos for a favor. Plus, he didn’t want Alexa to think he was pissed at her and had ditched her at the party.\u003c/p\u003e\n\u003cp\u003eHowever, from the look on her face and the way she refused to meet his eyes when he found her outside, he thought for a second that she’d tell him to go on without her. That would have pissed him off. That he could tell she’d considered it even pissed him off.\u003c/p\u003e\n\u003cp\u003eThey drove without talking for a few minutes, the only noise in the car the pop music she’d been singing along to on the way there. She broke the silence before he could.\u003c/p\u003e\n\u003cp\u003e“Did you really get a call from the hospital, or was that just your excuse to leave?”\u003c/p\u003e\n\u003cp\u003eThat’s when he lost his temper.\u003c/p\u003e\n\u003cp\u003e“What the fuck, Alexa? Really? You really think I would make up a call from the hospital just to get you out of there? Do you think I’m that much of a child?”\u003c/p\u003e\n\u003cp\u003eShe didn’t respond, and when he glanced her way, she just shrugged. That made his temper flare even higher.\u003c/p\u003e\n\u003cp\u003e“Really? You have that low of an opinion of me, just because I didn’t introduce you to people as my girlfriend? Just because I don’t use the exact word that you want me to use to describe you, you decide I’m the kind of asshole who would lie to you and all of my friends like that? When you decided to push back our dinner reservations by an hour last night because you were on the phone with your buddy Teddy writing one fucking sentence together for forty-five minutes, did I call you a controlling bitch workaholic who doesn’t pay attention to anyone else’s feelings? No, I didn’t, but I sure as hell could have.”\u003c/p\u003e\n\u003cp\u003eHe thought he saw her flinch out of the corner of his eye, but when he turned to look at her, her face was impassive.\u003c/p\u003e\n\u003cp\u003e“At least I finally know what you really think of me.”\u003c/p\u003e\n\u003cp\u003eHe turned into his parking spot, his sudden anger gone as quickly as it had come.\u003c/p\u003e\n\u003cp\u003e“No, Alexa, I didn’t . . .” She was out of the car before he could say anything else. He followed her up to his apartment, unlocked the door, and pushed it open for her before following her inside.\u003c/p\u003e\n\u003cp\u003e“I shouldn’t have said that. I didn’t mean it—that’s not how I feel,” he said as soon as he’d shut the door. Her back was still to him as she walked around the living room picking up her stuff.\u003c/p\u003e\n\u003cp\u003e“Alexa! Come on, talk to me.” She finally turned to him. He looked at the pile of her stuff in her hands. “Wait a minute, what are you doing?”\u003c/p\u003e\n\u003cp\u003eShe neatly piled it all into the big purse she always used on the airplane.\u003c/p\u003e\n\u003cp\u003e“What does it look like I’m doing? Why are you still here? Don’t you have to go to the hospital?”\u003c/p\u003e\n\u003cp\u003eHe shook his head in reaction to what she’d said. In reaction to everything.\u003c/p\u003e\n\u003cp\u003e“No! I mean, yes, I have to go to the hospital, but no, please don’t pack. Don’t leave now! You can’t leave now. I have to talk to you.”\u003c/p\u003e\n\u003cp\u003eShe stood there, silently, staring somewhere around the base of his neck but not meeting his eyes. He closed the distance between them and held on to her shoulders. She finally looked up at him but still didn’t say anything.\u003c/p\u003e\n\u003cp\u003e“Promise me. Promise you won’t leave. If this . . . if this has meant anything to you at all, promise me you won’t leave while I’m at the hospital.”\u003c/p\u003e\n\u003cp\u003eShe closed her eyes and dropped her head, but he didn’t let go of her. Finally, she whispered, “Okay. I promise.”\u003c/p\u003e\n\u003cp\u003eHe pulled her into his arms. She leaned her head against his shoulder for a quick second before she stepped backward.\u003c/p\u003e\n\u003cp\u003e“Go. You’re going to be late.”\u003c/p\u003e\n\u003cp\u003eShe was right. He looked back over his shoulder at her on his way out the door, but she had already turned to look out the window.\u003c/p\u003e\n\u003cp\u003eAlexa dropped into a chair and put her head in her hands as soon as he walked out the door. What a fucking nightmare the past few hours had been. She’d planned the whole way home in the car to pack and take a cab to the airport as soon as he left for the hospital, but now she couldn’t even do that.\u003c/p\u003e\n\u003cp\u003eShe was usually the last person who would leave in the middle of a fight. She liked to finish any discussion, she liked closure, and she always wanted to know exactly where she stood.\u003c/p\u003e\n\u003cp\u003eBut this time she couldn’t wait to get out of there. She already knew where she stood; she didn’t need him to say it out loud. She didn’t want to finish this fight, didn’t want him to tell her what she knew was coming, didn’t want to have to deal with the pain of listening to the gentle breakup speech he’d perfected on the dozen women who came before her.\u003c/p\u003e\n\u003cp\u003eWhat would be even worse was if he didn’t give her the breakup speech today. If instead he found some way to convince her to stay with him. That would just postpone the inevitable and make it hurt all the more when he finally decided to move on. And make her feel even more stupid when he did.\u003c/p\u003e\n\u003cp\u003eThat’s why she had to get out of there. Fly back to Berkeley so she could hide inside of her apartment and eat ice cream and cry for an entire day before she had to face anyone.\u003c/p\u003e\n\u003cp\u003eBut now she’d promised him she wouldn’t leave, and as much as she wanted to break that promise, she wouldn’t. And now she had to sit here and wait, with only her own thoughts for company.\u003c/p\u003e\n\u003cp\u003eShe thought about calling Maddie, but she knew if she did she would break down on the phone, and the last thing she wanted was to have Drew walk in on her while she was sobbing her heart out over him.\u003c/p\u003e\n\u003cp\u003eInstead, she changed, finished packing, and tried and failed to concentrate on work. Finally, she got into Drew’s bed and pulled up Anne of Green Gables on her iPad. Anne was right to smash her slate over Gilbert’s head—fuck him for calling her Carrots.\u003c/p\u003e\n\u003cp\u003eDrew got home much later that night, after an easy but long surgery. Thank God it had been an easy one; his mind was half on Alexa the entire time. Part of him was pissed at her that she’d started a fight over what seemed like nothing, but the rest of him was terrified that she’d left and he’d never see her again. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wedding-date/page-48.html","bookId":1776,"creation":"Oct 5, 2019 10:31:47 AM","modification":"Oct 5, 2019 10:31:47 AM"}
