{"id":74552,"no":56,"title":"Page 56","content":"\u003cp\u003e“Yeah, at the Blue Lounge, but wait—”\u003c/p\u003e\n\u003cp\u003eOlivia shook her head and gestured to Drew.\u003c/p\u003e\n\u003cp\u003e“You have other things to deal with right now. Don’t worry, we’ll catch up later.”\u003c/p\u003e\n\u003cp\u003eHad Olivia and Drew talked about her? Where had they even met? What was he doing here? Alexa reached out and grabbed Olivia’s hand before she walked away.\u003c/p\u003e\n\u003cp\u003e“Wait, Livie . . . Thank you.”\u003c/p\u003e\n\u003cp\u003eOlivia squeezed her hand.\u003c/p\u003e\n\u003cp\u003e“You’re welcome, kiddo. It was my pleasure.”\u003c/p\u003e\n\u003cp\u003eBy the time Olivia walked out the door with Theo and Maddie, the council chambers were deserted. Just Alexa and Drew were left.\u003c/p\u003e\n\u003cp\u003e“Thank you for the doughnuts,” she said. “That was so sweet.”\u003c/p\u003e\n\u003cp\u003e“You’re very welcome.” He reached out to her and touched her upper arm. She had to fight to not sway toward him. “I hoped they would start the day out on a good note.”\u003c/p\u003e\n\u003cp\u003eShe smiled, thinking back to her first bite into the still-warm doughnut.\u003c/p\u003e\n\u003cp\u003e“They did.” She gave up the fight and leaned into his hand for a moment. “Drew, what are you doing here?”\u003c/p\u003e\n\u003cp\u003eHe dropped his hand. It was probably for the best, but she still missed his touch.\u003c/p\u003e\n\u003cp\u003e“I’m here . . . Shit, I had a whole beginning to this, and now I’ve forgotten it all.” He took a deep breath. “Everything went wrong that weekend.”\u003c/p\u003e\n\u003cp\u003eNow she reached out and grabbed his hand. She couldn’t help herself.\u003c/p\u003e\n\u003cp\u003e“Drew, that’s all my fault. I shouldn’t have started that fight at the party. And I shouldn’t have left without saying good-bye. I’m sorry. I should have just talked to you like a grown-up.”\u003c/p\u003e\n\u003cp\u003eHe tightened his grip on her hand when she went to pull away.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, too. I should have been honest about how I felt.”\u003c/p\u003e\n\u003cp\u003eShe didn’t want to hear the rest. Not tonight. Probably not ever.\u003c/p\u003e\n\u003cp\u003e“No, don’t worry about it. You didn’t have to come all the way up here about that. I know how you feel; it’s okay.” Shit, was she going to start crying again? At this point, she couldn’t even be embarrassed about it.\u003c/p\u003e\n\u003cp\u003e“No, Alexa. You don’t know.” He released her hand and took a step back. “I never told you this, but I changed my flight back to L.A. that day, so I could spend more time with you.”\u003c/p\u003e\n\u003cp\u003eShe looked up at him and narrowed her eyes. Why was he telling her something she already knew?\u003c/p\u003e\n\u003cp\u003e“I knew that. I was right there when you changed it.”\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e“No. Not after the conference. After the wedding.”\u003c/p\u003e\n\u003cp\u003eShe let her purse slide off her shoulder and onto the floor. Her mind was a jumble. She felt drunk. Was it all of the doughnuts and pizza? Or maybe the many cups of coffee?\u003c/p\u003e\n\u003cp\u003e“What do you mean, after the wedding? Your flight was that night, right?”\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003e“My flight was at noon. When you were in the bathroom that morning, I changed my flight so I could spend the day with you. I should have realized then that I could never get enough of you.”\u003c/p\u003e\n\u003cp\u003eWhat was he saying? Why was he saying this now?\u003c/p\u003e\n\u003cp\u003e“Drew, I . . .”\u003c/p\u003e\n\u003cp\u003eHe reached for her hand again.\u003c/p\u003e\n\u003cp\u003e“No, let me finish, let me get this out. You . . . I . . . Alexa, I can’t imagine my life without you. I haven’t been able to since I first met you in that elevator. When I woke up that morning and you weren’t there . . . it broke me. I tried to live without you, but I couldn’t. I can’t.” He took a deep breath. “Alexa, I love you. I love you so much.”\u003c/p\u003e\n\u003cp\u003eShe tried to release his hand, but he held on tight. Her eyes filled with tears.\u003c/p\u003e\n\u003cp\u003e“Drew, I . . . Are you sure?”\u003c/p\u003e\n\u003cp\u003eHe smiled and took another step toward her.\u003c/p\u003e\n\u003cp\u003e“I’ve never been more sure about anything.”\u003c/p\u003e\n\u003cp\u003eTelling Alexa that he’d loved her hadn’t been as hard as he’d thought it would be. As a matter of fact, he wanted to keep saying it, over and over. But did she feel the same way? He couldn’t tell. All he knew was her hand was in his and she was here with him.\u003c/p\u003e\n\u003cp\u003eHe might as well tell her everything.\u003c/p\u003e\n\u003cp\u003e“Look.” He held out his phone to her. She looked at him with a question in her eyes but took it anyway. “This is how sure I am. Read this email.”\u003c/p\u003e\n\u003cp\u003eShe cleared her throat and looked at his phone. He was still gripping her hand.\u003c/p\u003e\n\u003cp\u003e“Drew Nichols, Children’s Hospital of Oakland is pleased to offer you the position of . . .” Her voice trailed away. “Is this for real?”\u003c/p\u003e\n\u003cp\u003eHe took the phone out of her hand.\u003c/p\u003e\n\u003cp\u003e“Very much for real. I called my mentor on Sunday. He told me when I saw him before the wedding that there was going to be a job opening up here and tried to get me to apply for it. I said no then, but . . . I changed my mind. It was a little more complicated than he’d implied, and I can’t start until—”\u003c/p\u003e\n\u003cp\u003eShe threw her arms around him and buried her head in his chest. She was crying again, but he hoped that these were good tears. He pulled her tight against him.\u003c/p\u003e\n\u003cp\u003e“I’m only going to take it if you want me to,” he said against her ear. “Please tell me you do?”\u003c/p\u003e\n\u003cp\u003eShe turned her head and pulled his head down to hers for a long kiss. Eventually, he pulled back and wiped the tears from her face with his thumb. My God, he’d missed her so much.\u003c/p\u003e\n\u003cp\u003e“Tell me.”\u003c/p\u003e\n\u003cp\u003eShe smiled up at him, her eyes sparkling through her tears.\u003c/p\u003e\n\u003cp\u003e“Yes, I want you to take it.”\u003c/p\u003e\n\u003cp\u003eHe kissed her eyelids, her cheeks, her hair.\u003c/p\u003e\n\u003cp\u003e“Don’t you have something else to tell me?” he said, his lips a breath away from hers.\u003c/p\u003e\n\u003cp\u003e“I love you.” The tears streamed from her eyes as she said it. “Oh, Drew, I love you so much. I’ve been trying to deny to myself all week how much I love you.”\u003c/p\u003e\n\u003cp\u003eHe brushed her tears away.\u003c/p\u003e\n\u003cp\u003e“I’ve been trying to admit to myself how much I love you.”\u003c/p\u003e\n\u003cp\u003eHe held her face in his hands and kissed her, their tears mingling with each other’s, their bodies fitting together like they were made to be just like that.\u003c/p\u003e\n\u003cp\u003e“Mizz Monroe?” The voice came from the doorway. Alexa put her head on his shoulder, laughing into his mascara-stained shirt before she turned toward the security guy. “I was going to lock up. Should I, um . . .”\u003c/p\u003e\n\u003cp\u003eAlexa cleared her throat.\u003c/p\u003e\n\u003cp\u003e“Sorry about this, Stu. You can lock up. Let me just get my stuff.”\u003c/p\u003e\n\u003cp\u003eShe picked her purse back up from where she’d dropped it on the ground and took Drew’s hand.\u003c/p\u003e\n\u003cp\u003e“Let’s go home.”\u003c/p\u003e\n\u003cp\u003eHe squeezed her hand and walked with her out the door.\u003c/p\u003e\n\u003cp\u003e“Aren’t you forgetting that we have to meet up with everyone from your office?”\u003c/p\u003e\n\u003cp\u003eShe stopped and laughed as she wiped her face with the sleeve of her suit jacket.\u003c/p\u003e\n\u003cp\u003e“I can’t believe it, but I had forgotten that. I’ll text Theo; he’ll understand. Olivia can come over . . . a little bit later.”\u003c/p\u003e\n\u003cp\u003eDrew shook his head. He wanted nothing more than to take her straight home and make up for all of their lost time, but he knew she’d regret missing out on this night with her crew.\u003c/p\u003e\n\u003cp\u003e“No, no, you can’t not go. This is your night of triumph!” He took her heavy bag from her and tossed it over his own shoulder.\u003c/p\u003e\n\u003cp\u003eShe smiled up at him.\u003c/p\u003e\n\u003cp\u003e“See, this is why I love you.”\u003c/p\u003e\n\u003cp\u003eHe laughed.\u003c/p\u003e\n\u003cp\u003e“This is it? Of all the things it could be, me sending you out to have drinks with your coworkers instead of locking you in the bedroom with me is why you love me?”\u003c/p\u003e\n\u003cp\u003eShe reached for his hand and squeezed it.\u003c/p\u003e\n\u003cp\u003e“Yeah. It is.”\u003c/p\u003e\n\u003cp\u003eHe lifted their joined hands and kissed hers.\u003c/p\u003e\n\u003cp\u003e“Now, let’s get you into the bathroom to wash your face before your whole office sees you with raccoon eyes. Plus, if you walk in there looking like that, your sister is going to draw and quarter me.”\u003c/p\u003e\n\u003cp\u003eShe laughed.\u003c/p\u003e\n\u003cp\u003e“Come with me upstairs to my office so I can repair myself.” She pulled his face down so she could whisper in his ear. “And you know, my office door locks, so no one will interrupt us there.”\u003c/p\u003e\n\u003cp\u003eHe liked the sound of that. He gestured to the hallway with his free hand.\u003c/p\u003e\n\u003cp\u003e“Lead the way, Monroe.”\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003e“Why can’t Carlos meet us at the restaurant?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wedding-date/page-56.html","bookId":1776,"creation":"Oct 5, 2019 10:31:47 AM","modification":"Oct 5, 2019 10:31:47 AM"}
