{"id":74553,"no":57,"title":"Page 57","content":"\u003cp\u003eThey walked into the Fairmont, almost a year after they’d met there. Carlos was in town and was staying there for some reason, instead of one of the more convenient hotels downtown. Drew had insisted on meeting him in his room, instead of at the restaurant where they were having dinner. Alexa was trying not to complain about it, but it was a Thursday night at seven, she’d had a long day, and she was ready for a cocktail and an enormous plate of French fries.\u003c/p\u003e\n\u003cp\u003e“He needs your opinion on his outfit. I don’t know.” Drew had been distracted their whole drive there and kept checking his phone. She knew he had a few patients he was worried about, but this was unusual for him.\u003c/p\u003e\n\u003cp\u003eShe pressed the button for the elevator and looked up at him and smiled, ready to reminisce about their elevator, but he wasn’t looking at her; he was looking off in the distance. Okay. She tried not to take it personally.\u003c/p\u003e\n\u003cp\u003eIn the past year, they’d had their ups and downs. They’d learned how to deal with two busy careers and a relationship, too; what the other person was like on an early Monday morning and a stressful Thursday night instead of just their idyllic weekends; that she never made the bed; that Drew always left the lights on.\u003c/p\u003e\n\u003cp\u003eThey’d also learned how to talk to each other about their feelings, even when they were scary. And throughout everything, they’d loved each other. Those two things helped them get over all of the bumps, big and little.\u003c/p\u003e\n\u003cp\u003eThe corner elevator—their elevator—opened, and he grabbed her hand and led her inside. She looked up at him to ask another question, saw something out of the corner of her eye, and turned.\u003c/p\u003e\n\u003cp\u003eThere were bouquets of flowers lining the elevator. Deep red roses, fat pink peonies, bright orange gerbera daisies, golden yellow daffodils, purple lilacs, all in vases along the floor. In one corner was a picnic basket, in another was an ice bucket with a bottle of champagne inside, and a pink bakery box was in the middle.\u003c/p\u003e\n\u003cp\u003e“Drew? What’s . . . Is this . . . Are we . . .” She didn’t even know what to ask him. At first, she’d thought it must be some mistake, but then she saw the way he was smiling at her, looking relaxed for the first time that day. He took both of her hands in his, and her whole body warmed at his touch.\u003c/p\u003e\n\u003cp\u003e“Alexa. I love you. I love you so much. You know that, right?”\u003c/p\u003e\n\u003cp\u003eShe nodded, tears springing into her eyes. Damn this man for always making her cry. Except now, almost always, it was from joy.\u003c/p\u003e\n\u003cp\u003e“Me, too. I love you so much, too.”\u003c/p\u003e\n\u003cp\u003eThe elevator shuddered to a stop, and she looked around and laughed.\u003c/p\u003e\n\u003cp\u003eHe kissed one of her hands.\u003c/p\u003e\n\u003cp\u003e“I know you do. We met right here, three hundred sixty-four days ago, and it was the best thing that’s ever happened to me.” He pulled her down to the floor, where they sat cross-legged, like they had the last time they’d been stuck in an elevator together. “Alexa Monroe, will you marry me?”\u003c/p\u003e\n\u003cp\u003eA tear slid down her cheek. At least she’d switched to waterproof mascara ever since Drew had moved to Berkeley.\u003c/p\u003e\n\u003cp\u003e“Yes, I’ll marry you. I would LOVE to marry you.” She pulled his face toward hers, and they kissed until they were lying on the floor, the flowers surrounding them.\u003c/p\u003e\n\u003cp\u003eHe pulled back and smiled at her, then sat bolt upright.\u003c/p\u003e\n\u003cp\u003e“Wait! I forgot something!” He reached in his pocket and pulled out a jewelry box. “Do you like it? I had Maddie give me some ideas, but if you . . .”\u003c/p\u003e\n\u003cp\u003eShe held out her left hand for him to slide the ring on her finger. She glanced down and saw the sparkle but couldn’t keep her eyes off the look on his face. She couldn’t remember ever having been this happy in her life.\u003c/p\u003e\n\u003cp\u003e“The ring is perfect, and I can’t believe Maddie was able to keep this secret from me.” She looked around at the elevator. “How did you manage to do this? How long do we get the elevator for? Wait. Carlos isn’t really upstairs, is he?”\u003c/p\u003e\n\u003cp\u003eHe intertwined their hands and laughed.\u003c/p\u003e\n\u003cp\u003e“Nope, safe and sound in L.A. We only get the elevator for thirty minutes, and that took a lot of sweet-talking to the hotel manager and implied promises of having a wedding here. I wanted to do this tomorrow, on our actual elevator anniversary, but I had to compromise. I hope you don’t mind.”\u003c/p\u003e\n\u003cp\u003e“I don’t mind a single thing right now.”\u003c/p\u003e\n\u003cp\u003eHe grinned at her.\u003c/p\u003e\n\u003cp\u003e“I’m going to open that bottle of champagne as soon as I manage to let go of you. We don’t have much time to drink it.”\u003c/p\u003e\n\u003cp\u003eHe seemed in no hurry to let go of her, though, and she was in no hurry for him to let her go. He wrapped his arms around her again, and they sat there on the floor together, her head against his chest. After a minute or so, he gestured to the picnic basket and said the magic words.\u003c/p\u003e\n\u003cp\u003e“I brought the fancy cheese and crackers this time.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-wedding-date/page-57.html","bookId":1776,"creation":"Oct 5, 2019 10:31:47 AM","modification":"Oct 5, 2019 10:31:47 AM"}
