{"id":73729,"no":19,"title":"Page 19","content":"\u003cp\u003eChapter Eighteen\u003c/p\u003e\n\u003cp\u003ePreston\u003c/p\u003e\n\u003cp\u003e“Can we do it this way?” Amanda asked nervously as she straddled my lap.\u003c/p\u003e\n\u003cp\u003eGod, she was so damn innocent. Knowing I’d been the only one ever to touch her, to be inside her, to taste her, made my insane possessiveness worse. I wanted to keep her close. Away from everyone else.\u003c/p\u003e\n\u003cp\u003e“Yes, sweetheart, it feels real good this way,” I assured her as I held her hips. “You’ll have all the control.”\u003c/p\u003e\n\u003cp\u003eI leaned forward and pulled one of her nipples into my mouth. They were right there, teasing me. I couldn’t ignore them. I was pretty damn sure I was addicted to them. She arched her back and let out a soft moan.\u003c/p\u003e\n\u003cp\u003e“I want it in,” she pleaded.\u003c/p\u003e\n\u003cp\u003eI smiled up at her. “Then put it in.”\u003c/p\u003e\n\u003cp\u003eHer eyes went wide with surprise, and then she slowly lowered her body until the tip of my erection touched the entrance we both wanted it in so badly.\u003c/p\u003e\n\u003cp\u003e“Do I just go down?” she asked, looking back up at me.\u003c/p\u003e\n\u003cp\u003eIf I wasn’t so incredibly turned on, I would have laughed. “Yeah, just go down on it.” I liked the way that sounded.\u003c/p\u003e\n\u003cp\u003eShe bit her bottom lip as she eased down on it.\u003c/p\u003e\n\u003cp\u003e“Ah, that’s so good,” I groaned as she teased us both by going slow.\u003c/p\u003e\n\u003cp\u003e“Yeah,” she panted, “it is.”\u003c/p\u003e\n\u003cp\u003eShe paused, and I wanted so badly to thrust up, but I held back. This was going to be all her. “Do I keep going?” She was breathing fast and hard, making her tits bounce gently in my face. God, it didn’t get any better than this.\u003c/p\u003e\n\u003cp\u003e“All the way down,” I assured her.\u003c/p\u003e\n\u003cp\u003eShe sank down all the way, and my hips bucked on their own accord, causing her to cry out.\u003c/p\u003e\n\u003cp\u003e“Fuck, baby,” I growled as her muscles inside squeezed my dick.\u003c/p\u003e\n\u003cp\u003e“Ohgod. It feels so good,” she said, throwing her head back and giving me complete access to her pretty neck. I leaned forward and kissed and licked several soft spots before she started to move. Lifting her hips, she said, “I wanna move.”\u003c/p\u003e\n\u003cp\u003e“Up and down, baby. As fast or slow as you want to. It’s your ride.”\u003c/p\u003e\n\u003cp\u003e“Oh,” she breathed, her eyes going wider at my words.\u003c/p\u003e\n\u003cp\u003eShe eased up, and I had to fist my hands at my sides to keep from taking over. This was making me fucking crazy. Flipping her on her back and pumping in and out of her until we both screamed out in release was very tempting. But then, watching her experience this for the first time was something I’d never forget.\u003c/p\u003e\n\u003cp\u003e“Preston,” she breathed.\u003c/p\u003e\n\u003cp\u003e“Yeah, baby?”\u003c/p\u003e\n\u003cp\u003e“Can I go faster? I think I wanna go faster.”\u003c/p\u003e\n\u003cp\u003eAh, hell yeah. “You ride me as fast and hard as you want to. If it feels good to you, it feels just as amazing to me. I promise. You can’t do this wrong.”\u003c/p\u003e\n\u003cp\u003eShe nodded and placed both her hands on my shoulders, then eased up off me and sank back down quickly. “AH!”\u003c/p\u003e\n\u003cp\u003eShe did it again, harder this time. It was the most amazing thing I’d ever felt. It was hotter inside than before, and softer. . . .\u003c/p\u003e\n\u003cp\u003eSHIT!\u003c/p\u003e\n\u003cp\u003eI wasn’t wearing a condom. Shit, shit, shit.\u003c/p\u003e\n\u003cp\u003eI grabbed her waist as she started getting her rhythm and stopped her.\u003c/p\u003e\n\u003cp\u003e“No, please,” she begged, sinking back down on me. “Yes, oh God, Preston.”\u003c/p\u003e\n\u003cp\u003eFuck me. How was I going to stop this?\u003c/p\u003e\n\u003cp\u003eShe lifted her hips and sank back down on me hard, then cried out again. She was so close. If I wasn’t positive I’d shoot off like a damn cannon when she came, I’d let her finish first.\u003c/p\u003e\n\u003cp\u003e“Manda, I gotta put on a condom.”\u003c/p\u003e\n\u003cp\u003eShe didn’t stop like I’d expected. She lifted her hips faster and rocked back and forth this time while making sexy little moans that were gonna push me over the edge.\u003c/p\u003e\n\u003cp\u003e“Manda, a condom, baby. I forgot a condom.”\u003c/p\u003e\n\u003cp\u003e“S’okay. I’m on the pill,” she said before pressing down harder and rocking her hips back and forth.\u003c/p\u003e\n\u003cp\u003eWhy the fuck was she on the pill?\u003c/p\u003e\n\u003cp\u003e“Preston, AH! Preston,” she cried out, grabbing my shoulder and leaning forward as she began trembling in my lap.\u003c/p\u003e\n\u003cp\u003eI couldn’t hold back. I wrapped both my arms around her and buried my head in her shoulder as I shot off my release inside her.\u003c/p\u003e\n\u003cp\u003eAmanda\u003c/p\u003e\n\u003cp\u003eI didn’t want to move. Ever. Preston was inside me. I was completely satisfied, and his mouth was nibbling at my neck. No wonder girls in high school liked sex so much. Nothing I’d ever done under the covers in my bed felt like this.\u003c/p\u003e\n\u003cp\u003e“Why are you on the pill?” Preston asked against my neck.\u003c/p\u003e\n\u003cp\u003eSmiling, I arched my neck a little more so he could cover more skin.\u003c/p\u003e\n\u003cp\u003e“Irregular, really bad periods. I’ve been on the pill since I was sixteen.”\u003c/p\u003e\n\u003cp\u003eI’d never thought the fact that I took that little pill every day would come in so handy.\u003c/p\u003e\n\u003cp\u003e“I’ve never had sex without a condom before,” he said, tilting his head back to look at me. “Being inside you with nothing between us was the best experience of my life.”\u003c/p\u003e\n\u003cp\u003eMy body felt warm all over. Knowing he’d enjoyed it as much as I had made it even better.\u003c/p\u003e\n\u003cp\u003ePreston leaned forward and kissed me. “It isn’t safe though. As good as that felt we can’t do that again. We need to protect you.. I have protection. Can we do this again?\"\u003c/p\u003e\n\u003cp\u003e“If you’re a very good boy,” I teased.\u003c/p\u003e\n\u003cp\u003eHis hands slipped down my back until they were caressing my bottom. “I can be real good. So damn good you’ll want to strip for me all the time.”\u003c/p\u003e\n\u003cp\u003eGiggling, I shifted my hips and felt him still semi-hard inside me. Oh.\u003c/p\u003e\n\u003cp\u003e“Manda, if you don’t get off me, we are gonna have to have a round two real soon.”\u003c/p\u003e\n\u003cp\u003eI wiggled a little more on his lap, and this time he laughed. “You’re going to kill me. Death by sex with the hottest woman on the planet. That’s one helluva way to go.”\u003c/p\u003e\n\u003cp\u003eA knock at the door startled me, and Preston tensed underneath me. I looked from the door to him, and he lifted me off his lap. Then handed me a towel. “Go on in the bathroom and take a shower.”\u003c/p\u003e\n\u003cp\u003eI was worried it could be Marcus. I didn’t want him hurting Preston any more. I wrapped the towel around me and stood there.\u003c/p\u003e\n\u003cp\u003ePreston pointed to the bathroom, and I shook my head. “It could be Marcus.”\u003c/p\u003e\n\u003cp\u003ePreston laughed. “Well, you standing there like that ain’t gonna help matters if it is.”\u003c/p\u003e\n\u003cp\u003e“You can’t answer the door naked,” I pointed out.\u003c/p\u003e\n\u003cp\u003eHe looked down at himself and smirked. “No, I can’t.” Then he headed for the bedroom. Another knock and a “I know you’re in there. Open the damn door” told us it was Dewayne.\u003c/p\u003e\n\u003cp\u003ePreston came walking out of the bedroom in a pair of sweats and pointed to the bathroom. “It’s Dewayne, and we both know he ain’t here to kick my ass. Go take a shower, and don’t come out in a towel.”\u003c/p\u003e\n\u003cp\u003eSmiling, I walked into the bathroom and closed the door behind me.\u003c/p\u003e\n\u003cp\u003ePressing my ear to the door, I listened to see what Dewayne wanted before I turned the water on. He could be here to warn us Marcus was on the way.\u003c/p\u003e\n\u003cp\u003e“She in here?” Dewayne asked.\u003c/p\u003e\n\u003cp\u003e“Word travels fast.”\u003c/p\u003e\n\u003cp\u003eDewayne let out a bark of laughter. “Hell yeah, it does. You messing around with Marcus’s sister, that’s screwed up. Even for you.”\u003c/p\u003e\n\u003cp\u003e“Shut up, D. What do you want, other than to see if Amanda is here?”\u003c/p\u003e\n\u003cp\u003e“Ah, you know, the usual. You got Marcus ready to pound in anyone’s head who looks at him the wrong way. Rock and I have to keep him from getting thrown in jail. So I need to know, are you just fucking her, or is this more than that?”\u003c/p\u003e\n\u003cp\u003e“It’s Amanda, D. Don’t say that. Ever.”\u003c/p\u003e\n\u003cp\u003eThere was a pause. “So Rock was right. For you to mess around with Manda, it has to be for a bigger reason. She got to you.”\u003c/p\u003e\n\u003cp\u003e“I’ve been attracted to her for a couple of years now, but she was too young. She’s not anymore, and I . . . It’s different with her. Everything is different.”\u003c/p\u003e\n\u003cp\u003eHearing him admit that it was different with me eased the worry that he might never love me. Just to know he felt something.\u003c/p\u003e\n\u003cp\u003e“I’d say it was your business, but since we were kids if something goes wrong with one of us, then it is everyone’s business. Just be careful. I know shit you probably don’t know I know. It ain’t the kind of thing relationships are built on. And Manda ain’t the kind of girl you just use for a little while.”\u003c/p\u003e\n\u003cp\u003e“I know that. Don’t you think I fucking know that?”\u003c/p\u003e\n\u003cp\u003eAnother moment of silence, and then the front door opened and closed. I stepped back and took a deep breath.\u003c/p\u003e\n\u003cp\u003eThe bathroom door swung open, and Preston walked inside with a wicked grin on his face. “Since you waited on me while you listened in on that conversation, I think I’ll help get you clean and you can show off those singing abilities of yours in the shower. I’ve been waiting all damn day to hear them.” \u003c/p\u003e","sourceLink":"https://allnovel.net/just-for-now-sea-breeze-4/page-19.html","bookId":1988,"creation":"Oct 5, 2019 10:28:48 AM","modification":"Oct 5, 2019 10:28:48 AM"}
