{"id":73734,"no":24,"title":"Page 24","content":"\u003cp\u003eChapter Twenty-Three\u003c/p\u003e\n\u003cp\u003ePreston\u003c/p\u003e\n\u003cp\u003eA loud banging sound interrupted my dreams. I tried to block it out. I wasn’t ready for this dream to end. Amanda was laughing and running down the beach while I chased her. She didn’t hate me. She still loved me. The banging was joined with a ringing noise and some yelling. I peeled open my eyes and glanced over at the clock. It was four in the afternoon. I’d slept all day. I hadn’t gotten home from work until almost four this morning. Then I’d been too jacked up on coffee to sleep. It had been almost seven before I crashed. I had to go back to work at eight tonight.\u003c/p\u003e\n\u003cp\u003eThe banging reminded me of why I was awake. I stumbled out of bed and made my way to the door before whoever was on the other side beat it down.\u003c/p\u003e\n\u003cp\u003eI jerked it open to see Marcus standing on the other side. “Shit, man, I was getting ready to break the door down. I’ve been calling you, and then banging on this door for over ten minutes when that didn’t work.”\u003c/p\u003e\n\u003cp\u003e“I was sleeping. I’m working nights now, you know.”\u003c/p\u003e\n\u003cp\u003e“That’s right. I forgot you worked last night. Listen, I need to tell you something, and I don’t know how you’re gonna take it, so you might want to sit down.”\u003c/p\u003e\n\u003cp\u003eThis was not something you wanted to wake up to. “What is it?” I demanded. I didn’t need to sit down, I just needed to know.\u003c/p\u003e\n\u003cp\u003e“It’s your mom. She overdosed.” He paused and waited for a reaction from me.\u003c/p\u003e\n\u003cp\u003e“Did it kill her this time?” This wasn’t her first overdose.\u003c/p\u003e\n\u003cp\u003eMarcus placed his hand on my shoulder and let out a heavy sigh. “Yeah, man. It did.”\u003c/p\u003e\n\u003cp\u003eI turned and headed for my room to put on some clothes. The kids would need me. I slipped on some jeans and tried to figure out how I could fit all three kids in here and take care of them when I was working nights. Without my mom’s rent and utilities I’d have a little extra to hire a sitter.\u003c/p\u003e\n\u003cp\u003e“You okay?” Marcus asked from the doorway of my room.\u003c/p\u003e\n\u003cp\u003e“She was junkie, Marcus. It was bound to happen. I just need to get to the kids. They’re probably scared.”\u003c/p\u003e\n\u003cp\u003eThe tightness in my chest surprised me. I wouldn’t grieve for this woman. She’d done nothing for me in my life. I swallowed the weak emotion from the little boy deep inside who had wanted his mother to love him. Even a little. I’d figured out long ago she never would. I wouldn’t shed a tear for her now.\u003c/p\u003e\n\u003cp\u003e“The kids are fine. Amanda has all three of them. They’re getting ice cream, then going to the park. She sent me to find you. There are custody issues you have to deal with.”\u003c/p\u003e\n\u003cp\u003eAmanda had the kids? How? Why? No matter how much they liked her, they would have called me first.\u003c/p\u003e\n\u003cp\u003e“How did Amanda know to get the kids?”\u003c/p\u003e\n\u003cp\u003e“Your younger brother called her. Told her your mom hadn’t woken up in two days, and Amanda left school and rushed over there. She also had him call 911 while he waited on her to arrive. They couldn’t reach you, so they called her.”\u003c/p\u003e\n\u003cp\u003eBrent had called Amanda. My chest hurt. All three kids had been upset when I’d had to tell them I wouldn’t be bringing Amanda around anymore. Daisy had even cried. But they’d known they could count on her when they couldn’t get me on the phone. A lump formed in my throat, and I grabbed my keys and headed for the door.\u003c/p\u003e\n\u003cp\u003e“I know she left you for the Stone guy, and I’m sorry about that, man.”\u003c/p\u003e\n\u003cp\u003eSo that was what she had told him. She’d left me for Jason Stone. Was she even dating him, or had it just been her way to cover up the truth?\u003c/p\u003e\n\u003cp\u003e“You were right. I wasn’t good enough for her. She finally wised up and saw it too.” I opened the door and headed down the stairs. I couldn’t talk about this with Marcus. Not right now.\u003c/p\u003e\n\u003cp\u003e“For what it’s worth, she still cares about you. She was really upset about this, and she was worried sick over those kids.”\u003c/p\u003e\n\u003cp\u003e“The kids love her” was the only reply I had.\u003c/p\u003e\n\u003cp\u003e“But you don’t?”\u003c/p\u003e\n\u003cp\u003eI stopped and looked back at him. I’d told enough lies. I wasn’t going to keep on telling them just to make everyone feel better. “I’ll always love her. Always.” I jerked open the door to my Jeep and jumped inside. “Where am I going?” I asked.\u003c/p\u003e\n\u003cp\u003e“DHR is waiting on you at the trailer.”\u003c/p\u003e\n\u003cp\u003eI shifted into drive and took off.\u003c/p\u003e\n\u003cp\u003eI wouldn’t have to fight Momma for the kids now. She’d made it easy. I wasn’t exactly the best option as a parent, but anything was better than her. And I didn’t want them separated. I couldn’t let them go. I’d figure this out somehow.\u003c/p\u003e\n\u003cp\u003eAmanda\u003c/p\u003e\n\u003cp\u003eI held Daisy’s cotton candy ice-cream cone while she ran over to the slide to go down it another time. She alternated between taking a lick of her ice cream and sliding. The ice cream wasn’t going to last too much longer. The sun was getting the best of it.\u003c/p\u003e\n\u003cp\u003e“Has Preston called you yet?” Jimmy asked, taking the seat beside me.\u003c/p\u003e\n\u003cp\u003e“No, but my brother did find him, and he is at the trailer talking to the people who determine where you go. He’s an adult and your closest relative, so he should have no problem getting custody,” I assured him. Brent and Daisy were too young to think about the legal issues. But it was bothering Jimmy. He understood the courts had rules.\u003c/p\u003e\n\u003cp\u003e“What if he doesn’t want us full-time?” Jimmy asked.\u003c/p\u003e\n\u003cp\u003e“He will.”\u003c/p\u003e\n\u003cp\u003e“He never tried to take us from Mom.”\u003c/p\u003e\n\u003cp\u003e“Because she would have fought him on it, and he’d have lost. He was also afraid that he’d draw attention to the situation and they’d take all of you away from him and each other.”\u003c/p\u003e\n\u003cp\u003eJimmy nodded. “Yeah, he explained that to me. I’m just worried that they will do it now.”\u003c/p\u003e\n\u003cp\u003e. My daddy was buddies with two of the three judges who could possibly hear this case. They played golf every Saturday morning and had since I was a little girl. If I had to go to my daddy and beg and plead with him for their help, I would.\u003c/p\u003e\n\u003cp\u003e“I promise you this will be okay.”\u003c/p\u003e\n\u003cp\u003eJimmy sighed. “I hope so. You know, Daisy really misses you.”\u003c/p\u003e\n\u003cp\u003e“I miss her too. I’ve missed all three of you.”\u003c/p\u003e\n\u003cp\u003eDaisy came running back to me with a big grin on her face to take another few licks of her melting ice cream.\u003c/p\u003e\n\u003cp\u003e“You better stop and eat it, Daisy, before it just melts away,” Jimmy told her.\u003c/p\u003e\n\u003cp\u003e“It gives me headaches if I eat it too fast,” she replied.\u003c/p\u003e\n\u003cp\u003eJimmy just smiled and kicked at a rock down by his feet.\u003c/p\u003e\n\u003cp\u003e“Amanda, is my momma in heaven?” Daisy asked.\u003c/p\u003e\n\u003cp\u003eI looked down at her little face. She was the first one to say anything about her momma’s death. The boys had acted like nothing important had happened. Brent was swinging by himself, and I was giving him his space. But he hadn’t brought up the fact that his mother was dead.\u003c/p\u003e\n\u003cp\u003e“I don’t know a lot about heaven, Daisy. I’d like to think that because she brought such amazing kids into this world, there was someplace nice she got to go once her life was over.”\u003c/p\u003e\n\u003cp\u003eI was pretty sure the woman was rotting in hell, but I wasn’t about to tell that to her seven-year-old daughter.\u003c/p\u003e\n\u003cp\u003e“I don’t know much about heaven eithaw. I just been to Sunday school a few times with my next-dowah neighbow.”\u003c/p\u003e\n\u003cp\u003eI’d grown up in church, and I still didn’t know a lot about heaven. “Church doesn’t have all the answers, Daisy. Sometimes the answer we need is in our heart. We just have to listen to it.”\u003c/p\u003e\n\u003cp\u003eDaisy looked down at her chest and frowned, then looked back up at me. “I’ve nevah heawed my hawt befowah.”\u003c/p\u003e\n\u003cp\u003eJimmy chuckled beside me, and I smiled over at him.\u003c/p\u003e\n\u003cp\u003e“Listen real close, and you’ll finally hear something one day,” I told her.\u003c/p\u003e\n\u003cp\u003eShe nodded, then spun around and ran back toward the slide.\u003c/p\u003e\n\u003cp\u003eOnce she was far enough away, Jimmy looked at me. “Thanks for not telling her the truth.”\u003c/p\u003e\n\u003cp\u003eI felt tears sting my eyes. He was so young to know so much. “I happen to think that was the truth.”\u003c/p\u003e\n\u003cp\u003eJimmy shook his head. “No, that ain’t the truth. I believe there’s a heaven for the good and a hell for the bad. And we both know my momma wasn’t good.”\u003c/p\u003e\n\u003cp\u003eHow did I argue with him? He knew more about how cruel his mother was than I did. I couldn’t sit here and tell him his mother was in heaven when I knew she wasn’t. He was right. She’d probably split hell wide open.\u003c/p\u003e\n\u003cp\u003e“Jimmy.” Preston’s voice interrupted my thoughts, and I lifted my eyes to see him walking up to us. His eyes were full of concern as he looked at his brother.\u003c/p\u003e\n\u003cp\u003eJimmy stood up and walked to meet him halfway. Preston pulled him into a tight hug and whispered something in his ear. Jimmy nodded and looked back at me. “Thanks, Amanda. For everything,” Jimmy said.\u003c/p\u003e\n\u003cp\u003eThe lump in my throat was painful. I nodded. I wasn’t sure I could talk. This was the first time I’d seen Preston since I’d walked out of his apartment. Knowing he’d just become the guardian of three kids, that the world was on his shoulders, and how alone he must feel was killing me. Dammit, why did I have to love him so much?\u003c/p\u003e\n\u003cp\u003e“Pweston!” Daisy came running from the slide when she spotted her big brother. Preston bent down and opened his arms wide, letting her run into them.\u003c/p\u003e\n\u003cp\u003e“Hey, my Daisy May. You been havin’ fun?”\u003c/p\u003e\n\u003cp\u003eDaisy nodded and pointed back at me still holding her ice cream. “Amanda came and took us away from all those people. She got me ice cweam and bwought us hewah to play.”\u003c/p\u003e\n\u003cp\u003ePreston didn’t look up at me. He kept his gaze on Daisy. “Sounds like she saved the day. You ready to go to my place now?”\u003c/p\u003e\n\u003cp\u003eDaisy nodded enthusiastically, then broke free of Preston to run back to me.\u003c/p\u003e\n\u003cp\u003eShe wrapped her arms around my waist and squeezed me tightly. “Thank you for getting us and the ice cweam.”\u003c/p\u003e\n\u003cp\u003eI bent down and kissed the top of her head. “You’re very welcome.”\u003c/p\u003e\n\u003cp\u003e“Will you come see me?” she asked, pulling away and looking up at me pleadingly.\u003c/p\u003e\n\u003cp\u003e“Yes. I’ll talk to your brother about that. We’ll have another ice cream date, okay?”\u003c/p\u003e\n\u003cp\u003eDaisy beamed at me. “Okay. I’ll see you soon,” she called out as she ran back to Preston, who was standing a good distance away from me with his hands tucked in his pockets.\u003c/p\u003e\n\u003cp\u003e“Go get Brent, and y’all go on out to the Jeep,” he said to Jimmy, and then he turned to look at me.\u003c/p\u003e\n\u003cp\u003eI stood up and walked over to throw away the ice cream and close some of the distance he had left between us.\u003c/p\u003e\n\u003cp\u003e“Thanks for going after them when they called you today. And sending your brother to wake me up. It means a lot.” The flat tone of his voice was so unlike him. It was as if all emotion was gone. He sounded hollow. I wanted to wrap my arms around him and tell him it would be okay. That I’d help him, that I loved him. But I couldn’t. He’d never loved me. He’d lied to me. As much as I wanted to ease his pain right now, I wasn’t the one to do it.\u003c/p\u003e\n\u003cp\u003e“If they ever need me, all they have to do is call. I’ll help however I can.”\u003c/p\u003e\n\u003cp\u003ePreston nodded and looked away from me. Holding my gaze wasn’t something he wanted to do, apparently. I hated that. I missed him so much.\u003c/p\u003e\n\u003cp\u003e“Thanks,” he replied.\u003c/p\u003e\n\u003cp\u003eHe started to turn to walk away. I didn’t want him to leave yet. I wasn’t done looking at him. Being near him. I wanted to say more. For him to say more. This was just so wrong.\u003c/p\u003e\n\u003cp\u003e“Wait, Preston,” I called out before I could stop myself.\u003c/p\u003e\n\u003cp\u003eHe paused, then looked back at me. I had to say something. I didn’t know what to say. I couldn’t tell him I was sorry about his mom, because I knew he wasn’t. I couldn’t tell him I missed him, because what good would that do?\u003c/p\u003e\n\u003cp\u003e“Don’t do this, Manda. You made the right choice. You’ve got your dinners in New York and rides in a jet now. It’s what you deserve. And I’ve become the guardian of three kids. I love them. It’ll completely change my world. And it’s what I deserve.\" He didn’t wait for me to process his words. He just walked away. And I let him. \u003c/p\u003e","sourceLink":"https://allnovel.net/just-for-now-sea-breeze-4/page-24.html","bookId":1988,"creation":"Oct 5, 2019 10:28:48 AM","modification":"Oct 5, 2019 10:28:48 AM"}
