{"id":73715,"no":5,"title":"Page 5","content":"\u003cp\u003eChapter Four\u003c/p\u003e\n\u003cp\u003ePreston\u003c/p\u003e\n\u003cp\u003eThis was not the kind of shit I needed right now. I’d been focused on drinking Amanda Hardy out of my system tonight. That’s all I wanted to focus on. That and her legs. Damn, her legs.\u003c/p\u003e\n\u003cp\u003eThen something like this happens. Not what I was in the mood for.\u003c/p\u003e\n\u003cp\u003e“Tell him you didn’t touch his mom, Preston,” Dewayne demanded from in front of me. He was acting like my fucking bodyguard. I could take the guy. I didn’t need someone to protect me.\u003c/p\u003e\n\u003cp\u003e“Tell. Him,” Dewayne repeated.\u003c/p\u003e\n\u003cp\u003eI couldn’t do that. Me and the guy threatening to beat my ass both knew I couldn’t deny it. He’d caught me with his mom last week. I could remember his face. Couldn’t remember his mom’s face but did remember the fury in his eyes. I’d seen it one too many times.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Rock asked as he and Marcus ran out and also stood between me and the guy. I didn’t have the heart to tell the guy his dear mom had paid me very well for that Sunday afternoon roll around her sheets. I wasn’t into older women. I used them. That was it. They had cash, and I fulfilled their fantasies. The dude wouldn’t be able to handle the truth, though.\u003c/p\u003e\n\u003cp\u003e“Trying to stop a fight,” Dewayne explained as both Rock and Marcus stood beside him, blocking me even more from the angry son of one of my clients. This was just another reason I needed to start demanding that I not handle business in clients’ houses. This shit happens.\u003c/p\u003e\n\u003cp\u003e“What did he do?” Marcus asked, glancing back at me.\u003c/p\u003e\n\u003cp\u003eI shrugged and took another shot of tequila.\u003c/p\u003e\n\u003cp\u003e“Guy says Preston slept with his mom, and he’s out for blood,” Dewayne explained.\u003c/p\u003e\n\u003cp\u003e“Shit,” Rock mumbled, and shot a warning glare back my way.\u003c/p\u003e\n\u003cp\u003e“Go ahead, Preston. Explain that ain’t the case,” Dewayne demanded again.\u003c/p\u003e\n\u003cp\u003eI was getting tired of that. I hadn’t spoken up yet. Had they not figured out that there was truth to this? Did they want me to lie to the guy and piss him off more? This guy and I had made eye contact that day as I’d pulled my jeans back on and headed out his mother’s bedroom door while she made excuses to her son. I hadn’t stayed around to deal with the drama. I just got the hell out.\u003c/p\u003e\n\u003cp\u003e“You got the wrong guy,” a voice interrupted. “He’s mine. He wouldn’t be sleeping with someone’s mom when he has me to come home to. So back off. I don’t want to hear any more of this.”\u003c/p\u003e\n\u003cp\u003eWhat the fucking hell?\u003c/p\u003e\n\u003cp\u003eAmanda walked around the wall of guys standing guard in front of me and crooked her finger my way. “Come on, baby. Let’s go. This guy’s confused you with someone else, and you’ve had too much to drink.”\u003c/p\u003e\n\u003cp\u003eHad I passed out? Maybe I’d had more shots than I intended.\u003c/p\u003e\n\u003cp\u003e“Manda, what the hell—?”\u003c/p\u003e\n\u003cp\u003e“Back off, Marcus. I got this,” she snapped, cutting off her brother’s angry question.\u003c/p\u003e\n\u003cp\u003e“Come on, Preston. Now.”\u003c/p\u003e\n\u003cp\u003eI didn’t question her. I set down my shot glass and stood up, then walked over to her. What was she doing? She slipped her hand around my waist and steered me away from the angry son and my friends.\u003c/p\u003e\n\u003cp\u003e“Follow me,” she said, and led me through the crowd and toward the stairs leading up to the bedrooms. Probably not the best idea. I didn’t need to have Amanda Hardy anywhere near a bed. Especially as drunk as I was at the moment. But then again, maybe this was all a drunken dream. Which meant I could strip her hot little body of this clingy, sexy-ass dress and kiss all the places my dreams haunt me with at night.\u003c/p\u003e\n\u003cp\u003eAmanda opened a door and pushed me inside a pink-and-white bedroom with ruffles on the bed and a white teddy bear resting against the pillows. Hell, yeah. This was hot. Amanda naked on that bed. Fuck, I was hard.\u003c/p\u003e\n\u003cp\u003e“Sit down.” She shoved me toward the bed and then backed away from me. Not the best dream I’d ever had.\u003c/p\u003e\n\u003cp\u003eShe put her hands on her hips and glared at me from across the room. Sexy. As. Hell.\u003c/p\u003e\n\u003cp\u003e“What are you doing? This is Marcus’s engagement party. You can’t go picking fights. What is wrong with you? Is everything a joke to you? Life’s just one big party for you, isn’t it? Well, wake up! You have friends down there who love you. They stand up for you even when they know you probably did screw that poor guy’s mom.” She stopped and shook her head in disgust. “God, please tell me she wasn’t married.” Then she put up her hand to stop anything I might say in reply. “No. Don’t tell me anything. I don’t want to know. Just stay in here. Sleep it off. Don’t ruin this night for Marcus and Low. They deserve to be happy. Marcus loves you, Preston. Don’t do something stupid to hurt him.”\u003c/p\u003e\n\u003cp\u003eShe dropped her hands to her side and let out a sigh. She was disappointed in me. This was a good thing. Maybe she was even disgusted with me. That would be even better. I needed her to stop flirting. I needed her to stop making me want things I couldn’t have. Because, dammit, I wanted her. So very bad.\u003c/p\u003e\n\u003cp\u003e“I’ve got a date that I’ve run out on to save the testosterone party down there from throwing down one big ugly fight. All because you can’t keep your pants up around a female.” She dropped her eyes as she said the last part, and her cheeks flamed red. Did the idea of me having sex embarrass her?\u003c/p\u003e\n\u003cp\u003eShe turned and walked back to the door. Her perfect round ass swayed under the thin material of the dress, mocking me with what I couldn’t ever have. What I’d never be good enough for.\u003c/p\u003e\n\u003cp\u003e“He better be good to you,” I said just loud enough for her to hear me if she was really listening. She stopped. She’d heard me.\u003c/p\u003e\n\u003cp\u003eSlowly she turned back around and stared at me with a confused expression. “What does that mean?” she asked, studying my face like it had all the answers she needed.\u003c/p\u003e\n\u003cp\u003e“It means that I don’t give a shit who his brother is. If he hurts you, I’ll hurt him.”\u003c/p\u003e\n\u003cp\u003eAmanda let out a short, hard laugh and shook her head. “Really? Really, Preston? You care if Jason hurts me? Because I find it very hard to believe that you care about my feelings at all.” Then she spun around and walked away, slamming the door behind her.\u003c/p\u003e\n\u003cp\u003eAmanda\u003c/p\u003e\n\u003cp\u003eI would not cry. And I would stop this stupid shaking. There was a very hot, attractive, somewhat famous guy downstairs waiting on me. He didn’t make me feel cheap and unwanted. Taking a deep breath, I straightened my shoulders and smoothed the wrinkles out of my dress, then walked back down the stairs. Scanning the crowd, I found Jason immediately. He was with Sadie and Jax. They were all probably talking about me. I’m sure Sadie was explaining my performance with Preston.\u003c/p\u003e\n\u003cp\u003eSpeaking to guests as I made my way through the crowd, I kept a permanent smile plastered on my face. No one would know that what I’d just done had been for anyone else but Marcus. I’d never let them see I had any feelings for Preston. My pride would keep me safe.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry. I was worried that if I didn’t step in and help, we’d have a fight on our hands, and I don’t want anything to ruin tonight for Marcus and Willow,” I explained once I got to Jason, before anyone could say anything.\u003c/p\u003e\n\u003cp\u003eJason was frowning, but it was a concerned frown. “That’s fine. You did a good job ending things.”\u003c/p\u003e\n\u003cp\u003e“Please tell me you locked him in a room so he can’t come out,” Sadie said. She was annoyed. I could hear it in her voice.\u003c/p\u003e\n\u003cp\u003e“Yeah, he is locked up. Hopefully passed out by now,” I assured her.\u003c/p\u003e\n\u003cp\u003e“I’m sorry. I have to ask this—did the guy really sleep with someone’s mom?” Jason asked.\u003c/p\u003e\n\u003cp\u003eJax reached over and punched Jason in the arm. “Dude. Don’t.”\u003c/p\u003e\n\u003cp\u003e“I was just curious.”\u003c/p\u003e\n\u003cp\u003e“It’s her brother’s best friend. Let it go.”\u003c/p\u003e\n\u003cp\u003e“No. It’s okay. He may be one of Marcus’s best friends, but I’m aware he has issues. And yes, Jason, he probably did. You would be hard-pressed to find a female here Preston hasn’t slept with.”\u003c/p\u003e\n\u003cp\u003eSadie’s eyebrows shot up, and I realized what I’d said. I was venting. I needed to watch my mouth. My mom always said “Loose lips sink ships.” She was right. I needed to be more careful what I spewed from my mouth.\u003c/p\u003e\n\u003cp\u003e“Weren’t we going to go down to the beach and check out the tent and band?” I asked, needing to get everyone’s mind off what I’d just said.\u003c/p\u003e\n\u003cp\u003e“Yeah, we were,” Jax replied, reaching for Sadie’s arm and leading her toward the door.\u003c/p\u003e\n\u003cp\u003e“Sounds like a good idea to me,” Jason agreed, and offered me his arm. I slipped my hand into the crook of his arm, and we all headed outside.\u003c/p\u003e\n\u003cp\u003eMarcus was standing with Willow in his arms, talking to Dewayne, Rock, and Trisha pretty intensely when we walked back out the doors. Cage York, Willow’s best friend, and his girlfriend, Eva, had arrived too. They must’ve been getting filled in on the situation. Cage and Preston play baseball together, so they’re pretty tight.\u003c/p\u003e\n\u003cp\u003e“Come here, Amanda,” Marcus called out to me. I was hoping he’d forget what I’d just done, but apparently he wasn’t going to. I wasn’t sure what he was going to say, but I didn’t feel right letting Jason hear them talk about Preston. He wasn’t here to defend himself, and I’d already bashed him enough.\u003c/p\u003e\n\u003cp\u003e“Let me go reassure my brother that Preston is fine, and then I’ll meet y’all down there.”\u003c/p\u003e\n\u003cp\u003eJason nodded. “Of course.”\u003c/p\u003e\n\u003cp\u003eIf Marcus frowned any harder, the crease in his forehead was going to crack. Not a good sign. “Don’t scold me. I got him out of here, didn’t I?”\u003c/p\u003e\n\u003cp\u003e“You don’t need to stick your nose into any of Preston’s crap. He has issues you need to stay miles away from. I get that you were trying to help save the party, but I don’t like you stepping in to help Preston out. We got it. You stay away from his messes.”\u003c/p\u003e\n\u003cp\u003eI may have an absent father for the most part, but I have Marcus to make up for it. Where my daddy ignores me, Marcus hovers over me. I love him, I really do, but I don’t like being told what I can and can’t do. It was time he backed off a little. I’m eighteen years old.\u003c/p\u003e\n\u003cp\u003e“She made a smart move. Lay off and give her a little credit.” Cage stepped over and defended me. Like that would help. Marcus tolerated Cage because of Willow. He didn’t exactly care what his opinion was.\u003c/p\u003e\n\u003cp\u003e“Listen. I saw a way to help, and I did. Not a big deal. I didn’t go have a heart-to-heart with Preston. So back off. I’m a big girl now.” I shot Marcus a tight smile, and then left him standing there before he or any of the other guys could speak up. I had a date waiting on me. I wasn’t going to waste another minute talking about Preston Drake.\u003c/p\u003e\n\u003cp\u003eA hand shot out and grabbed my arm, and I glanced back to see it was Dewayne who’d stopped me, not my brother. What was his deal? Was I now going to get a lecture from him, too?\u003c/p\u003e\n\u003cp\u003e“Preston talks when he’s drunk. He talks a lot. About a lot of shit. You know what I mean? Keep your distance. I love him, but he ain’t good for you.” Dewayne’s low voice almost sounded like a rumble, but I heard every word. He’d spoken low enough that Marcus and the others couldn’t hear him. I felt my face heat up, and I jerked my arm out of his hold.\u003c/p\u003e\n\u003cp\u003eWhat did Dewayne know about me and Preston? Could he possibly know about that night? I’d thought it was my secret. Apparently not. My stomach turned, and I prayed I wasn’t about to get sick. It was bad enough knowing Preston had taken my virginity in a storage building on a bunch of boxes and then walked away, leaving me there alone. But knowing that someone else knew of my shame was even worse.\u003c/p\u003e\n\u003cp\u003eI had to force myself to keep from running as I walked swiftly through the crowd. I didn’t smile and pretend like everything was great. The dark beach up ahead on the outskirts of the tent and lighting was my goal. Hiding away for a few minutes while I got a grip on things was necessary.\u003c/p\u003e\n\u003cp\u003eI could hear Sadie call my name from somewhere up ahead, but I pretended like I didn’t hear her. I ran for the sand and the shadows.\u003c/p\u003e\n\u003cp\u003eI just needed a moment.\u003c/p\u003e\n\u003cp\u003eTears burned my eyes, and I tilted my head back and blinked into the ocean breeze in an attempt to dry my tears before they ruined my face. The small sliver of hope I’d had that Preston had felt something for me was now completely extinguished. He had told someone. A moment that I wanted to remember yet wanted to wash my memory of at the same time wasn’t as private as I’d thought. Preston had talked about it, while drunk. God, I hated him. How could I have been so crazy about him when he has no redeeming qualities? I was the biggest idiot on the face of the earth.\u003c/p\u003e\n\u003cp\u003e“Amanda?” Jason’s concerned voice startled me. I hadn’t expected him to follow me out here. Although we’d met before, this was really our first time together without a crowd around us. I wanted to be alone. Not pretending for my date.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, I blinked away my tears and turned to face Jason. “Hey, sorry. The crowd and everything got to me. Fresh air and a quiet moment seemed like a good idea.”\u003c/p\u003e\n\u003cp\u003e“I just thought I’d check on you. I can go if you want to be alone.”\u003c/p\u003e\n\u003cp\u003eYes. I wanted to be alone. But I couldn’t be rude. Jason had been really understanding so far tonight. I hadn’t been the best date. It was time to suck it up and get over myself.\u003c/p\u003e\n\u003cp\u003e“No, I’m glad you came out here. You can enjoy the quiet with me.” I smiled up at him. It was odd how similar he looked to Jax. He didn’t have the rocker swagger that Jax did, though. He was more polite and studious, almost.\u003c/p\u003e\n\u003cp\u003e“I like hiding from crowds. It’s been my thing since crowds became an issue with my brother’s fame.” The grin on his face was really cute.\u003c/p\u003e\n\u003cp\u003e“I can imagine. You don’t appear to be as outgoing as Jax.”\u003c/p\u003e\n\u003cp\u003eJason chuckled. “No. Not even a little. Jax was always the one who liked an audience.”\u003c/p\u003e\n\u003cp\u003e“So, are you leaving with Jax and Sadie when they move her to LA?” It was still hard for me to accept the fact that Sadie was leaving. I was going to miss her so much.\u003c/p\u003e\n\u003cp\u003e“Yeah. Classes start next week for me, too.”\u003c/p\u003e\n\u003cp\u003eJason would be going to college in California too. That was one of the reasons I didn’t feel guilty for using him to get over Preston. Not that it was working.\u003c/p\u003e\n\u003cp\u003e“Well, I think I’m ready to go back to the crowd now. You want to dance?” I asked, deciding it was time I stopped hiding at my brother’s engagement party.\u003c/p\u003e\n\u003cp\u003e“Sounds good.” \u003c/p\u003e","sourceLink":"https://allnovel.net/just-for-now-sea-breeze-4/page-5.html","bookId":1988,"creation":"Oct 5, 2019 10:28:48 AM","modification":"Oct 5, 2019 10:28:48 AM"}
