{"id":112287,"no":18,"title":"Page 18","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“How do you know so much?” Ellie demanded. “You can’t know.”\u003c/p\u003e\n\u003cp\u003eTom looked suddenly tired. “I know enough. I’m an explosive ordnance disposal expert.”\u003c/p\u003e\n\u003cp\u003e“What’s that mean?” asked Ellie.\u003c/p\u003e\n\u003cp\u003e“It means,” Tom Eden said, “that I’m the guy they send out to make sure the bombs don’t go off.”\u003c/p\u003e\n\u003cp\u003e“Well then, you did a really sucky job, Tom,” said Ellie, and burst into tears.\u003c/p\u003e\n\u003cp\u003e23\u003c/p\u003e\n\u003cp\u003e“He’s wrong.” Ellie’s eyes were swollen and the tip of her nose was red, but the rest of her face was pinched and too white in the glare of Alex’s flashlight. The tent was warm enough, but Ellie couldn’t stop shivering, even with Mina curled alongside her. She bunched the sleeping bag under her chin. “He doesn’t know.”\u003c/p\u003e\n\u003cp\u003eAlex cast about for something more reassuring to say, unsure if her shakiness was only due to the aftereffects of a concussion. She ended up smoothing Ellie’s damp hair from her forehead. “He’s just guessing, Ellie.”\u003c/p\u003e\n\u003cp\u003ePrivately, she had to admit that what Tom said made some sense, even if an EMP didn’t account for everything. Unless there was more than one, or maybe a lot of EMPs combined with something else—but with what?\u003c/p\u003e\n\u003cp\u003e“But what about those kids we saw? Could all those … those …”\u003c/p\u003e\n\u003cp\u003e“Electromagnetic pulses?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Could a lot of them at the same time do that? Make you go crazy and eat people?”\u003c/p\u003e\n\u003cp\u003e“I don’t know, Ellie.”\u003c/p\u003e\n\u003cp\u003eEllie’s eyes shone like twin high beams. “When you were asleep, Tom said it wouldn’t be safe to go back home right away, especially to any of the cities. He said that if this was really big, there wouldn’t be power or water, and no way to get food because nothing would work. People would be scared and maybe hurting each other.”\u003c/p\u003e\n\u003cp\u003eAlex opened her mouth to reply, but then came the sound of the tent being unzipped, and a moment later, Tom stuck his head in. “How we doing in here?” he asked.\u003c/p\u003e\n\u003cp\u003e“You’re wrong,” Ellie said, without a lot of heat.\u003c/p\u003e\n\u003cp\u003e“We were just talking about you,” Alex said.\u003c/p\u003e\n\u003cp\u003e“I knew my ears were burning.” Tom shouldered his way in. The tent was a two-man and a tight fit. Alex felt Tom at her back, and she could smell him, too: the fragrance of wood smoke and musk so potent it made her a little dizzy. “What’s up?” he asked.\u003c/p\u003e\n\u003cp\u003e“We were wondering…,” Alex began. When she turned to look over her shoulder, their faces were inches apart. His cinnamon-colored hair, thick and wavy, was mussed and his cheeks rosy, as if he’d just come in from a ski slope—and he smelled so good. Her pulse jumped at a powerful tug of attraction. “Ellie said you think we shouldn’t go back.”\u003c/p\u003e\n\u003cp\u003eTom’s eyes flicked to Ellie then back. “We can talk about this in the morning. You know, after Ellie gets some rest.”\u003c/p\u003e\n\u003cp\u003eShe got the message. “Sure.”\u003c/p\u003e\n\u003cp\u003e“Don’t go,” Ellie said. She put a hand on Alex’s arm. “I don’t want to go to sleep.”\u003c/p\u003e\n\u003cp\u003eTom grinned. “No arguments, kiddo. We got to get an early start tomorrow. Mina will stay here, and we’ll be right outside, okay? We aren’t going anywhere, and we’ve got my Winchester, and I got a Mossberg for Alex here. We’ll be fine.”\u003c/p\u003e\n\u003cp\u003e“If we’ll be fine, how come you need guns?”\u003c/p\u003e\n\u003cp\u003eTom looked so perplexed that Alex almost laughed. “Honestly, Ellie, everything will be okay,” she said. “The guns are for just in case.”\u003c/p\u003e\n\u003cp\u003e“Maybe I should have a gun.”\u003c/p\u003e\n\u003cp\u003e“I don’t think so. Guns are pretty heavy, and your hands are too little,” Alex said, relieved that this was true. “We’ll watch out for you.”\u003c/p\u003e\n\u003cp\u003e“Promise?”\u003c/p\u003e\n\u003cp\u003e“Pinky swear. If you’re ever in trouble, all you have to do is yell and we’ll hear you.”\u003c/p\u003e\n\u003cp\u003e“I don’t have a very big voice,” Ellie said.\u003c/p\u003e\n\u003cp\u003e“I know how to fix that.” She dipped a hand under her sweatshirt and fished out her silver whistle, warm from her body heat. “You blow on that and I bet you ten bucks they’ll hear it in the next state.”\u003c/p\u003e\n\u003cp\u003eEllie held up her hair as Alex slipped the chain over the girl’s head. The girl cupped the whistle in her hands as carefully as a robin’s egg. “Who gave it to you?”\u003c/p\u003e\n\u003cp\u003eSwallowing was suddenly very, very hard. She felt Tom’s eyes on her. “My parents. I was a little younger than you. They gave it to me on my first camping trip.”\u003c/p\u003e\n\u003cp\u003eEllie said, gravely, “You have very smart parents.”\u003c/p\u003e\n\u003cp\u003e“You know, Tom’s right. It’s pretty late,” Alex said. “Come on. I’ll tuck you in.”\u003c/p\u003e\n\u003cp\u003e24\u003c/p\u003e\n\u003cp\u003eOutside, by the fire, Tom said, “That was pretty good.”\u003c/p\u003e\n\u003cp\u003eAlex tried on a smile that kept slipping from her lips. “She’s just scared.” She paused. “Me, too.”\u003c/p\u003e\n\u003cp\u003e“Makes three of us,” Tom said, and took her hand. The act was so natural and so quiet, not a come-on at all. She didn’t flinch, although her heart did that little thump-bump-a-dump again. His hand was calloused, but his skin was warm and his grip was strong. It was weird how he was about her age but seemed older somehow. Maybe that happened when you went to war. “Cut yourself some slack,” he said. “Ellie would be dead if not for you.”\u003c/p\u003e\n\u003cp\u003e“I don’t know if you noticed, but you saved us,” she said.\u003c/p\u003e\n\u003cp\u003e“True. But I had a gun.”\u003c/p\u003e\n\u003cp\u003e“And we got lucky.”\u003c/p\u003e\n\u003cp\u003e“Half the battle. Like Stan and Earl.”\u003c/p\u003e\n\u003cp\u003e“Can you tell me what happened?”\u003c/p\u003e\n\u003cp\u003eHe hesitated, then said, “I still don’t get it all. The … Zap happened, and Stan dropped dead. Just dropped.”\u003c/p\u003e\n\u003cp\u003e“You mean, like Ellie’s …?”\u003c/p\u003e\n\u003cp\u003eTom was shaking his head. “I don’t think so, not like her grandfather. Stan was a healthy guy, in his forties, I think. He might have had a pacer or something else mechanical, but I doubt it. Earl had just turned sixty-five. I know because Jim talked about throwing his dad a big party when he got back from Afghanistan.”\u003c/p\u003e\n\u003cp\u003e“Did he bleed?”\u003c/p\u003e\n\u003cp\u003e“Jim? Yeah, but so did I. So did Earl.”\u003c/p\u003e\n\u003cp\u003e“How did Earl die?” But she thought she knew. “Was it Jim?”\u003c/p\u003e\n\u003cp\u003eSighing, Tom gave her hand a squeeze, then let go. “Jim was okay at first, but then his headache came back, worse than before, and then his memory started to go. Like the second morning he didn’t know what a spoon was for. It only lasted a second, but it was really spooky, and then it wasn’t just the spoon, it was everything. Like his memory was full of holes.”\u003c/p\u003e\n\u003cp\u003eGod, this was all too familiar. “How long before he”—she faltered over the word—“before he changed?”\u003c/p\u003e\n\u003cp\u003e“End of the second day is when things went to hell. We’d made camp, mainly because Jim had stopped talking and was just staring, like guys after an IED’s gone off, or if they’ve seen too many other guys get blown up. Combat fatigue, shell shock … you know. I went off to get water and then I heard the shots. By the time I made it back, it was over. I got off two shots with the Winchester, for all the good that did.”\u003c/p\u003e\n\u003cp\u003eHis voice faded. She waited.\u003c/p\u003e\n\u003cp\u003e“I think the reason Earl died was because he hesitated, or maybe he was firing wild. Jim was fast when he was sane, and you saw him. He was crazy and fast. Earl probably couldn’t believe his kid was coming after him. After that, I couldn’t just leave. I kept hoping Jim’d snap out of it. Tracking him took some time. Whatever else he was, he was still partly Jim. He knew how to evade. It was part of our training. Then I started to find animals. You could tell that something had been at them, know what I’m saying?” When she nodded, he said, “Then I heard Ellie and …” He spread his hands. “You know the rest.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry you had to shoot your friend,” she said.\u003c/p\u003e\n\u003cp\u003eHe looked away, but not before she saw the sudden shine in his eyes. “You know what I don’t understand? Why not me or Earl? Why did Stan die? And why, out of all of us, only Jim?”\u003c/p\u003e\n\u003cp\u003e“But it wasn’t just Jim,” she said.\u003c/p\u003e\n\u003cp\u003e“Yeah, Ellie told me about those kids. Still doesn’t make sense.”\u003c/p\u003e\n\u003cp\u003e“What if it’s got to do with age?”\u003c/p\u003e\n\u003cp\u003e“How do you figure?”\u003c/p\u003e\n\u003cp\u003eSince the idea had only just occurred to her, she wasn’t sure what she was groping toward. “I’m seventeen, almost eighteen. You’re—”\u003c/p\u003e\n\u003cp\u003e“Twenty. Twenty-one, come December.”\u003c/p\u003e\n\u003cp\u003e“Was Jim older or younger than you?”\u003c/p\u003e\n\u003cp\u003eHe thought about it. “Not too many years older. Maybe … twenty-four, twenty-five?”\u003c/p\u003e\n\u003cp\u003e“So what if being older means the change happens later?”\u003c/p\u003e\n\u003cp\u003e“Maybe.” He scratched his head. “That doesn’t explain why Stan died. You and I are younger than Jim, but those brain-zapped kids you saw were also about our age. Only it can’t be just age, because we’re okay. So is Ellie.”\u003c/p\u003e\n\u003cp\u003eSo far. He didn’t say that, but he might as well have. She said nothing for a moment. The fire popped. A shower of sparks flared, then died. Tom’s scent—that complex, musky spice—touched something deep in her chest. And that made her think of something else.\u003c/p\u003e\n\u003cp\u003eThe dogs smelled Jim, and so did I. I smelled those kids, but Ellie didn’t. But what does that mean?\u003c/p\u003e\n\u003cp\u003e“What about smell?” she asked.\u003c/p\u003e\n\u003cp\u003eTom looked confused. “Smell?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Did Jim … did he complain of a weird smell before he, you know, changed?”\u003c/p\u003e\n\u003cp\u003e“No,” Tom said. “I don’t believe he did.”\u003c/p\u003e\n\u003cp\u003eThat night, the moon was green.\u003c/p\u003e\n\u003cp\u003e25\u003c/p\u003e\n\u003cp\u003eThe sound reached them two days later, while they were still several miles from the station. At first, Alex thought the sound might be a woodpecker—likely a big pileated thwacking some tree. As they got closer, though, she realized that what they were hearing was not an animal at all. The sound came very fast, a trip-hammer stutter: putta-putta-putta-putta-putta. \u003c/p\u003e","sourceLink":"https://allnovel.net/ashes-ashes-trilogy-1/page-18.html","bookId":2564,"creation":"Oct 6, 2019 1:03:05 AM","modification":"Oct 6, 2019 1:03:05 AM"}
