{"id":112306,"no":38,"title":"Page 38","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBut a perimeter couldn’t be the only reason, Alex figured. Short of building a fence, how did you secure an entire village?\u003c/p\u003e\n\u003cp\u003e“What sucks,” Peter continued, “is that they’ve figured out how to survive. They know to get warm, they know to find shelter; they follow people. From what you said, it sounds like they’re learning how to really hunt.”\u003c/p\u003e\n\u003cp\u003e“So maybe they’ll kill each other,” Alex said.\u003c/p\u003e\n\u003cp\u003ePeter shook his head. “They don’t, which completely blows. Right now, they’re not organized enough to overrun the town. They might get there, though, and then we’re screwed. There are way more of them than we got bullets for.”\u003c/p\u003e\n\u003cp\u003eShe wasn’t giving up on Tom. “You have all these people. You’ve got guns. With the horses, you could get to Tom in a couple of hours. If one of you were hurt, you’d go after him, wouldn’t you?”\u003c/p\u003e\n\u003cp\u003e“I’m not doing hypotheticals,” said Peter. “Look, I understand. You care about this guy. I get that. He sounds like he was a pretty good guy.”\u003c/p\u003e\n\u003cp\u003e“He is,” she said, her eyes filling. “He is.”\u003c/p\u003e\n\u003cp\u003e“Peter,” Chris said quietly, “I say we go after him. It’s not like there are a lot of us. If we don’t fight for each other, who will? If he’s Spared, then it’s worth the risk.”\u003c/p\u003e\n\u003cp\u003eAlex heard the emphasis: Spared. Like Changed. These people didn’t see Tom or her or even themselves as survivors. They were Spared, like people who’d escaped some sort of wrath-of-God thing.\u003c/p\u003e\n\u003cp\u003e“Damn it,” said Peter. He scuffed snow with the heel of his boot, and Alex smelled the peppery edge of his resistance ease. “All right. But you stay behind, Chris.”\u003c/p\u003e\n\u003cp\u003eAlex didn’t like the sound of that either—not because Chris was such an ally, but because Peter already didn’t like her. So if there was a little accident …\u003c/p\u003e\n\u003cp\u003eChris apparently felt the same way. “I don’t think that’s a good idea.”\u003c/p\u003e\n\u003cp\u003e“Yeah, yeah, yeah, that’s just it. You’re not thinking,” Peter snapped. “But I am, and I do not want to explain to the Rev or the Council why the hell you’re dead and I’m not.”\u003c/p\u003e\n\u003cp\u003eA splinter of ice stabbed the dark mist of Chris’s scent. No hint of anger crossed his face; there was nothing to betray him except his scent. Chris may have been only a little older than Alex, but he was very calm, a lot like Tom in some ways, and Alex thought she understood why Chris’s scent was so … what was the word? Dark. Not evil, but shadowy, as if Chris knew how to hide. Maybe he’d dealt with people about to go nuclear his whole life.\u003c/p\u003e\n\u003cp\u003e“My grandfather is not here,” Chris said evenly. “The Council of Five is not here. It’s just us, Peter, and the deal is we watch each other’s back. So I’m coming.”\u003c/p\u003e\n\u003cp\u003eThe two stared at each other a long moment, and then Peter gave a curt nod. “Fine. If we’re lucky, we can be there a couple hours before dawn. Now excuse me while I go sell the others on this crazy scheme.”\u003c/p\u003e\n\u003cp\u003eAfter he’d stomped off, she said to Chris, “Thank you.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome,” he said, but he did not smile and his scent thickened, folding him in darkness again. “But I didn’t do it for you.”\u003c/p\u003e\n\u003cp\u003e“And if Peter told you to put a bullet in my head?”\u003c/p\u003e\n\u003cp\u003e“I don’t think you want to go there,” he said.\u003c/p\u003e\n\u003cp\u003e43\u003c/p\u003e\n\u003cp\u003eThey were eight altogether. Two men on horseback flanked either side of the wagon, Peter rode point, and another man brought up the rear. Chris handled the wagon, and Alex sat between him and Jet. The puppy curled in a knot in her lap.\u003c/p\u003e\n\u003cp\u003e“Nice pup,” Chris said.\u003c/p\u003e\n\u003cp\u003e“What?” Everything was so loud: the creak of the wagon, the jangle of traces, the heavy clop of horses’ hooves. After days of skulking around, hiding in the woods, and nearly jumping out of her skin every time a branch cracked, she was a little freaked out by the noise.\u003c/p\u003e\n\u003cp\u003e“Your pup. Don’t see too many Weimies around here.”\u003c/p\u003e\n\u003cp\u003e“Weimies?”\u003c/p\u003e\n\u003cp\u003e“Weimaraners. He’s going to be one big dog when he grows up. If I’m not wrong, he’s going to be a ghost, too.” At her confused look, one corner of his mouth lifted in a half-grin. “You don’t know much about dogs, do you?”\u003c/p\u003e\n\u003cp\u003eOther than that they suddenly like me? “Never had one.”\u003c/p\u003e\n\u003cp\u003e“It’s the color of his coat. They call those kind of Weimies ‘gray ghosts.’ He got a name?”\u003c/p\u003e\n\u003cp\u003e“I haven’t had time.” She looked down at the dog. “I like Ghost.”\u003c/p\u003e\n\u003cp\u003e“Good a name as any. You’ll have to let our vet give him the once-over before we can let you keep him, though.”\u003c/p\u003e\n\u003cp\u003e“You’ve got a vet?”\u003c/p\u003e\n\u003cp\u003e“Yeah, and we could use a couple more. We’ve got a lot of livestock and, of course, all the dogs. We get a lot of people headed this way, so a vet’ll eventually come through.”\u003c/p\u003e\n\u003cp\u003eShe remembered the argument about Tom: We need him. “That what you were doing back at the roadblock? Weeding people out?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“You don’t sound sorry about it.”\u003c/p\u003e\n\u003cp\u003eEven in that queer moonlight, Chris’s eyes and hair were as dark as his scent. “It’s necessary.”\u003c/p\u003e\n\u003cp\u003e“How can you turn people away?”\u003c/p\u003e\n\u003cp\u003e“We do what we have to. We don’t have unlimited supplies. Whether you get to stay depends on what you bring to the table.”\u003c/p\u003e\n\u003cp\u003e“That’s pretty harsh.”\u003c/p\u003e\n\u003cp\u003e“Yes, it is. But there’s only so much food to go around, and we have to balance who we bring in with what we need. Right now, we need people for labor, tending to the animals, and general upkeep. We need guys to man the perimeter. Come spring, there will be fields to till and plant, so we might let in more—if people are still coming, that is.”\u003c/p\u003e\n\u003cp\u003e“Who decides? Peter?”\u003c/p\u003e\n\u003cp\u003e“No. The Council of Five.”\u003c/p\u003e\n\u003cp\u003e“Like”—she frowned—“a town council?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “More like, you know, elders.”\u003c/p\u003e\n\u003cp\u003eShe almost laughed. “Nearly everybody’s an elder.”\u003c/p\u003e\n\u003cp\u003e“Except for us, yeah. But these guys have family ties that go way, way back. The Reverend’s family—the Yeagers—pretty much started Rule from the ground up, and a Yeager’s always been the head of the Council. As I understand it, the Council of Five has been in charge of Rule for a long time.”\u003c/p\u003e\n\u003cp\u003eSomething dinged. “Peter said the Reverend is your grandfather. But your last name is Prentiss.”\u003c/p\u003e\n\u003cp\u003e“That’s right. Growing up, I never saw my grandfather.”\u003c/p\u003e\n\u003cp\u003e“So you didn’t live here before?”\u003c/p\u003e\n\u003cp\u003eShe sensed a sudden wariness, a reserve that reeked of secrets and shame, and his scent got even darker. “No. I’m from Merton, about sixty miles southeast. You?”\u003c/p\u003e\n\u003cp\u003e“Evanston, Illinois. A couple blocks from Northwestern.”\u003c/p\u003e\n\u003cp\u003eA flicker of something like amusement. “I’d just applied to Northwestern. Wasn’t my first choice.”\u003c/p\u003e\n\u003cp\u003eOkay, so he was a senior, either seventeen or, more likely, eighteen. “What was?”\u003c/p\u003e\n\u003cp\u003e“Doesn’t really matter now, does it?”\u003c/p\u003e\n\u003cp\u003eOuch. She felt the barrier slam down and decided there was no answer to that. Instead, she watched a knot of clouds scud over the face of that alien moon. Snuffling, the puppy burrowed deeper into her lap.\u003c/p\u003e\n\u003cp\u003eChris said, “Sorry. It’s just that I don’t like looking back. No point. It’s all dead anyway.”\u003c/p\u003e\n\u003cp\u003e“How do you know that?”\u003c/p\u003e\n\u003cp\u003e“We scrounged up an old radio, the kind that still works.”\u003c/p\u003e\n\u003cp\u003eHer pulse skipped. Harlan and Brett had taken the ranger radio when they’d stolen the truck. “Where did you find it?”\u003c/p\u003e\n\u003cp\u003eMaybe he heard something in her tone, because he flicked a curious glance. “Farm about ten miles out of town.”\u003c/p\u003e\n\u003cp\u003e“Oh.” She worked at keeping the disappointment out of her voice. “Have you heard a lot of broadcasts?”\u003c/p\u003e\n\u003cp\u003e“Not tons, and even less as time’s gone on. Enough to know it’s a mess out there.” He paused. “Where were you when it happened?”\u003c/p\u003e\n\u003cp\u003eShe gave him the bare minimum: the mountain, Jack, Ellie. He didn’t ask why she was in the Waucamaw or about her parents, and she saw no reason to volunteer the information. “What about you?” she asked.\u003c/p\u003e\n\u003cp\u003e“School. I was outside, helping the chemistry teacher set off a smoke bomb for the sophomores. She just dropped. I thought at first she’d fainted, but she was gone.”\u003c/p\u003e\n\u003cp\u003e“What did you do?”\u003c/p\u003e\n\u003cp\u003e“Before or after the plane crashed in the football field?”\u003c/p\u003e\n\u003cp\u003e“After.”\u003c/p\u003e\n\u003cp\u003e“I nearly beat a kid to death with a textbook. It was either that or he was going to take my face off. There was this other girl in the group. She was still okay—not Changed—only she freaked out and took off for the playground where there were all these kids. Most of them hadn’t Changed. Some had, though, and they were going after the others.”\u003c/p\u003e\n\u003cp\u003e“Oh my God.” She didn’t even want to imagine that.\u003c/p\u003e\n\u003cp\u003e“Then these five football jocks spotted her. Plowed right into that playground and tore that girl apart, and after that, they started in on the little ones.” He paused again. “I still see it sometimes when I close my eyes. Hear it. The whole freaking mess.”\u003c/p\u003e\n\u003cp\u003e“What did you do?”\u003c/p\u003e\n\u003cp\u003e“Not what I thought I would,” he said. “I ran.”\u003c/p\u003e\n\u003cp\u003eThey rode in silence for a while and then she asked, “How did you end up in Rule? Because of your grandfather?”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “My car wouldn’t start. Home was twenty-five miles away, and Merton’s a big town. After what I saw at the school, I figured it would be five hundred times worse there. All those people dead or getting killed or going crazy. No point.”\u003c/p\u003e\n\u003cp\u003e“But it was still home.”\u003c/p\u003e\n\u003cp\u003e“There was just me and my dad.” The shadows in Chris’s scent thickened, and Alex thought that his father was someone Chris didn’t like thinking about. “Now that we understand more—how old the people who dropped were—I know there wouldn’t have been any point. He was fifty.” \u003c/p\u003e","sourceLink":"https://allnovel.net/ashes-ashes-trilogy-1/page-38.html","bookId":2564,"creation":"Oct 6, 2019 1:03:05 AM","modification":"Oct 6, 2019 1:03:05 AM"}
