{"id":112324,"no":56,"title":"Page 56","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Excellent?” Alex goggled at him. “What’s good about maggots?”\u003c/p\u003e\n\u003cp\u003e“Because they eat the dead stuff and leave healthy tissue behind,” said Kincaid. “See the margins there? That’s all viable tissue. Alex, see if you can scoop a couple dozen of those little guys onto some gauze.”\u003c/p\u003e\n\u003cp\u003e“Sure,” she said faintly, not at all sure she wouldn’t pass out. She couldn’t get rid of the image of flies buzzing over the boy’s\u003c/p\u003e\n\u003cp\u003ewounds, landing and laying eggs.\u003c/p\u003e\n\u003cp\u003eAnd then she thought, Hey, wait a minute.\u003c/p\u003e\n\u003cp\u003e“You want some help?” asked Paul, although he sounded like he’d be just as happy if she refused.\u003c/p\u003e\n\u003cp\u003eShe did not disappoint. “No, I’m good.”\u003c/p\u003e\n\u003cp\u003e“Oh, we are going to give you bad boys a regular feast,” Kincaid said. “Warm you maggies right up.”\u003c/p\u003e\n\u003cp\u003e“They look pretty warm to me,” said Alex. “They’re moving all over the place.”\u003c/p\u003e\n\u003cp\u003e“He is the only person I know who would get excited over a bowl of maggots,” Paul observed as he pumped up the blood pressure cuff again. “Ninety-five over sixty-two.”\u003c/p\u003e\n\u003cp\u003e“I like the sound of that,” Kincaid said. “Paul, get us another catalytic heater in here and then see if you can scrounge us up a plastic container and an apple.”\u003c/p\u003e\n\u003cp\u003e“You want to eat?” asked Alex. “Now?”\u003c/p\u003e\n\u003cp\u003e“Eventually.” He winked at her over his mask. “Apple’s for the maggies. Old fishing trick. The maggies’ll keep somewhere cool and dark for a couple weeks.”\u003c/p\u003e\n\u003cp\u003e“We could start our own maggot farm,” said Paul.\u003c/p\u003e\n\u003cp\u003e“That is a very good idea,” said Kincaid. “We find somewhere warm enough. Flies’ll die otherwise.”\u003c/p\u003e\n\u003cp\u003e“I was joking.” Paul rolled his eyes. “Be right back. Boss, I hope you and your maggies will be very happy.”\u003c/p\u003e\n\u003cp\u003e“Oh, we will,” Kincaid said, “we will.”\u003c/p\u003e\n\u003cp\u003eGreat, now she’d be babying maggots for the foreseeable future. Alex thought it would be a really long time before she looked at rice the same way again.\u003c/p\u003e\n\u003cp\u003ePresuming, of course, she ever saw rice again.\u003c/p\u003e\n\u003cp\u003e“That’s it,” said Kincaid. After peeling out of his gloves, he dragged the mask from his face and sighed. “Wish I hadn’t had to cut away so much tissue to find healthy muscle, but can’t be helped. Between me and the maggots, though, those wounds might just granulate in. They won’t be pretty, but if he’s lucky, he won’t lose the leg.”\u003c/p\u003e\n\u003cp\u003e“Is he going to make it?” asked Alex.\u003c/p\u003e\n\u003cp\u003eKincaid’s mouth set in a grimace. “If things were even halfway normal, I’d say only fifty-fifty. He’s already arrested once, and he’s septic. Fluids’ll help, but we only got a couple more bags and no more antibiotic. If his blood pressure falls again, I got nothing left to give him.”\u003c/p\u003e\n\u003cp\u003e“Maybe it won’t,” said Alex. “Maybe you got to him in time.”\u003c/p\u003e\n\u003cp\u003e“Maybe. Be a damn shame, all this effort and risk for nothing. Just got to hope for the best.” He looked behind Alex. “Greg, take this girl home before she passes out.”\u003c/p\u003e\n\u003cp\u003e“Just waiting on you, Doc,” said Greg from the door.\u003c/p\u003e\n\u003cp\u003eNight had fallen hours before. Now she glanced at Ellie’s watch and saw that Mickey said it was pushing ten. Untying her mask, Alex said, “Have you been there the whole time?”\u003c/p\u003e\n\u003cp\u003e“All”—Greg checked his pocket watch—“six hours and twenty minutes.”\u003c/p\u003e\n\u003cp\u003e“And it’s way past my bedtime,” said Kincaid. He looked as if he was going to fall down, and when he dropped into a chair, he let out a long groan. “Many more nights like this, and I’m going to be old before my time.”\u003c/p\u003e\n\u003cp\u003e“You need to rest,” Paul said. A huge butterfly splotch stained the chest of his scrub top, and a sheen of sweat glistened on his ruddy scalp. “We’re not kids anymore.”\u003c/p\u003e\n\u003cp\u003e“I heard that,” said Kincaid.\u003c/p\u003e\n\u003cp\u003e“You should get some sleep,” Alex said. She was dead tired and she could smell herself. “I can watch him for a while. All I need to do is wash up a little bit.” When Kincaid opened his mouth to protest, she said, “Come on, if something bad happens to you, we’re screwed.”\u003c/p\u003e\n\u003cp\u003e“She’s got a point,” said Paul.\u003c/p\u003e\n\u003cp\u003eKincaid grumbled some more but eventually gave in. “I’ll bed down here. You come get me in four hours,” he said as Paul ushered him out. “Don’t you forget.”\u003c/p\u003e\n\u003cp\u003e“I won’t,” she said, and then after he was gone: “Maybe.”\u003c/p\u003e\n\u003cp\u003e“You really do look beat,” said Greg, who looked only marginally better than she felt. “You want company?”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” she said, and then ruined it by yawning. “Look on the bright side. You won’t have to come get me in the morning.”\u003c/p\u003e\n\u003cp\u003e“I’ll bring you a change of clothes. Chances are Doc is going to let you knock off tomorrow, though.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well.” She glanced at their patient, whose color was only a little less white than his sheets. His dark hair looked artificial, like something penned in with a Magic Marker. Then she began to gather up soiled instruments. The plastic garbage bags were overflowing with soiled and bloodied gauze and the remnants of\u003c/p\u003e\n\u003cp\u003ethe boy’s clothes. “Let’s see what happens. You should go home.” “I’m gone.” Greg tipped her a wave. “Just don’t tell Chris.”\u003c/p\u003e\n\u003cp\u003eNow what, she thought, as she began tidying up the treatment room, would I tell Chris exactly? Oh, bad Greg left me all by my widdle wonesome?\u003c/p\u003e\n\u003cp\u003eShe had thought of Chris, too, and often. Not obsessively, not the way she had with Tom—but that had been different, hadn’t it? She wasn’t sure now what she’d felt with Tom, but they’d fought together and he’d been hurt, maybe dying, and she’d been on a mission to save him.\u003c/p\u003e\n\u003cp\u003eYeah, like, fail.\u003c/p\u003e\n\u003cp\u003eShe took the boy’s blood pressure, noted his pulse, checked his IVs. Then, gathering up a tray of soiled instruments, she dumped them in alcohol before crossing the hall to retrieve their makeshift steam sterilizer. She carried the sterilizer outside, set it on a small propane stove, and lit the stove. While she waited for the steam to build, she washed the instruments, then placed them in the sterilizer. It would take about twenty minutes of steam to disinfect the instruments, heat being their only …\u003c/p\u003e\n\u003cp\u003eHeat.\u003c/p\u003e\n\u003cp\u003eHeat.\u003c/p\u003e\n\u003cp\u003eStaring down at the tiny ring of blue flame, huddled in her scrubs and a thin yellow nurse’s gown, she frowned. Something about heat had been bothering her for hours. But why?\u003c/p\u003e\n\u003cp\u003eKincaid’s words came back: Flies’ll die in the cold.\u003c/p\u003e\n\u003cp\u003eThat was right. Flies died in the cold. Leave a dead anything out in the cold, and there would not be blowflies, not in winter. She had seen no flies in Honey’s stable at all, not even four weeks ago. She’d seen more than a few dead bodies on the road, but no flies. And at the gas station, dead Ned …\u003c/p\u003e\n\u003cp\u003e“No flies,” she murmured. But the boy had maggots. Maggots could only come from flies, but if they’d found him in an abandoned barn, how had he stayed warm? What would’ve warmed up the barn enough so flies could live in winter?\u003c/p\u003e\n\u003cp\u003eOkay, maybe the boy had started a fire. No, that couldn’t be it. That boy was out cold when they brought him in; he was just the other side of dead. Hell, he had been dead.\u003c/p\u003e\n\u003cp\u003eWhich meant that someone else started the fire. Someone else kept the boy warm. There had been someone else, maybe more than one person.\u003c/p\u003e\n\u003cp\u003eBut Greg had said, Found him by his lonesome in a barn.\u003c/p\u003e\n\u003cp\u003eNo, Greg. Not hardly. And they’d been nearer Oren … what were they doing there? They’d been on their way to Wisconsin, unless there’d been a change in plans. Hadn’t Chris been up to Oren already? Right; that’s where he’d gotten the books. So Chris had been there not long ago.\u003c/p\u003e\n\u003cp\u003eKincaid: Either you boys hurt? You boys get a name?\u003c/p\u003e\n\u003cp\u003eIf Kincaid was worried about that, he must’ve figured there was a fight. Getting a name, though, suggested not only other people but … a conversation? Or—oh my God—a trade? Something worse?\u003c/p\u003e\n\u003cp\u003eBecause Kincaid knew: they hadn’t just found this kid; they hadn’t rescued him.\u003c/p\u003e\n\u003cp\u003eThey’d taken him.\u003c/p\u003e\n\u003cp\u003e62\u003c/p\u003e\n\u003cp\u003eAlmost every kid she’d ever known, herself included, squirreled crap away in their pockets. Before she’d discovered Swiss Army knives, Alex’s favorites had been rocks and chewing gum. She had no idea why, and her mother was always grousing about chewing gum that melted in the dryer.\u003c/p\u003e\n\u003cp\u003eBut there was nothing in the boy’s pockets.\u003c/p\u003e\n\u003cp\u003eWhat kid carried nothing? Alex stared in disbelief at the jumble of tattered clothing she’d retrieved from the trash. The stink was terrible: blood and pus and months’ worth of dirt. The boy’s name was penned into his sneakers but too smeary from sweat and dirt for her to make out more than a J and an N. Or maybe M. His flannel shirt had only one ripped pocket, and his jeans pockets were riddled with holes.\u003c/p\u003e\n\u003cp\u003eShe picked up a limp tongue of the boy’s olive-green jacket in one gloved hand. The jacket had faux-fur along the hood and a sagging, quilted, blaze-orange, zip-in lining. She hefted the jacket. Couldn’t tell a thing from the weight. But that was the beauty of a zippered lining. Since coming to Rule she’d certainly used hers to sneak supplies for her Great Escape. So she unzipped and then pulled the lining completely from the jacket.\u003c/p\u003e\n\u003cp\u003eSomething metallic chinked to the floor. When she saw what it was, she clapped a hand to her mouth to stifle the scream.\u003c/p\u003e\n\u003cp\u003eNot a knife. Not a gun.\u003c/p\u003e\n\u003cp\u003eHer whistle.\u003c/p\u003e\n\u003cp\u003e63\u003c/p\u003e\n\u003cp\u003eShe did not wake Kincaid.\u003c/p\u003e\n\u003cp\u003eInstead, dryeyed, she huddled by the boy, trying to will him back to consciousness. When that didn’t work, she checked his blood pressure, fiddled with his IVs, listened to his too-rapid heart, and felt his fingertips, which were cold. That, she knew, was bad, and she might have to get Kincaid soon, but not quite yet. All she needed were a few minutes alone with the boy. If he would just wake up …\u003c/p\u003e\n\u003cp\u003eShe’d slipped the whistle around her neck and tucked it under her scrubs, and now she touched it just to make sure it was still there. Of course it was. She was not dreaming. This wasn’t like her parents slipping away into the night. This was real and tangible and she ought to be able to put this together. All the pieces were there, she knew; she just didn’t know how they fit together. \u003c/p\u003e","sourceLink":"https://allnovel.net/ashes-ashes-trilogy-1/page-56.html","bookId":2564,"creation":"Oct 6, 2019 1:03:05 AM","modification":"Oct 6, 2019 1:03:05 AM"}
