{"id":100954,"no":15,"title":"Page 15","content":"\u003cp\u003eSeverin managed—very aptly from what Elle could see—to hold a quill in his thick, claw tipped fingers and scratch out a note.\u003c/p\u003e\n\u003cp\u003eElle shrugged at his indifference and turned to look at her crutches again. Servants were lined up in front of them. All of them were nodding and smiling, looking encouraging as they gestured for her to keep talking.\u003c/p\u003e\n\u003cp\u003eThe situation struck Elle as being odd, which was something she did not hesitate to tell Emele the following day after the footmen carried her outside for the first time since her accident.\u003c/p\u003e\n\u003cp\u003e“The entire dinner was awkward and silent. He only ever acknowledged me with his ears whenever I slurped my soup or clanged a dish,” Elle explained to her faithful ladies maid as they meandered down the path. (Emele finally trusted her enough to stroll down the level, graveled paths in the thick garden even though Elle’s puffy skirts still gave her troubles.)\u003c/p\u003e\n\u003cp\u003e“I fail to understand why I am brought to dinner with Prince Severin. Surely I’m beneath his notice,” Elle said.\u003c/p\u003e\n\u003cp\u003eEmele stopped to write. Companionship.\u003c/p\u003e\n\u003cp\u003e“Companionship? You are bluffing. Prince Severin needs my companionship like a peacock needs horse fur. He clearly doesn’t want me there. I am positive the only reason he does not send me off, bouncing on my way home and further injuring my leg is because of you and the rest of the Chateau servants,” Elle said, walking further up the garden trail. The armchair the footmen had brought her out in was still within sight, Elle felt confident she could go farther.\u003c/p\u003e\n\u003cp\u003eNever! Emele wrote. The Prince is too kind for that.\u003c/p\u003e\n\u003cp\u003e“Say what you will, but I have experienced otherwise,” Elle dryly said. “What are the terms of his curse? It seems to have done very little to sweeten his temperament,” she said. Little was known of Prince Severin’s curse, even among the Crown’s servants.\u003c/p\u003e\n\u003cp\u003eEmele shook her head and kept walking. Not my story to tell.\u003c/p\u003e\n\u003cp\u003e“Why not? You were cursed with him,” Elle said, thumping after her maid as they moved toward the outer patches of greenery. They walked the perimeter of the gardens, going down a path that was walled in by giant hedges. A wrought iron fence was snug against the outer hedge. Elle wasn’t sure if it was meant to keep intruders out, or everyone else in.\u003c/p\u003e\n\u003cp\u003eThe weather was pleasant. The sun was warm and intense considering summer was leaving and fall would soon sweep through the land.\u003c/p\u003e\n\u003cp\u003eEmele shook her head again but didn’t write anything on her slate.\u003c/p\u003e\n\u003cp\u003eElle paddled down the path for a few moments, contemplating her next question and occasionally stopping to push her skirts backwards. “Will you be stuck like this forever?”\u003c/p\u003e\n\u003cp\u003eEmele smiled generously. No. There is hope.\u003c/p\u003e\n\u003cp\u003e“So the curse can be broken?” Elle said, stopping in surprise.\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003eEmele smiled mysteriously and wrote nothing.\u003c/p\u003e\n\u003cp\u003eElle raised an eyebrow. “Not your story to tell?”\u003c/p\u003e\n\u003cp\u003eEmele opened her mouth with soundless laughter.\u003c/p\u003e\n\u003cp\u003eElle and Emele turned down a path, and Emele pointed to a stone bench. You are tired.\u003c/p\u003e\n\u003cp\u003e“I am not,” Elle stubbornly said. “But a break would be nice.”\u003c/p\u003e\n\u003cp\u003eThere was barely enough room for both ladies due to their voluminous skirts. Elle tried to pat hers down as it puffed around her like a frosted cake, but it seemed to be a lost cause.\u003c/p\u003e\n\u003cp\u003e“How long have I been here?” Elle asked.\u003c/p\u003e\n\u003cp\u003eRoughly a month.\u003c/p\u003e\n\u003cp\u003e“I suspect my holiday is almost over, and I will not be your guest much longer,” Elle admitted, her eyes scanning the great trees that stretched above the hedges.\u003c/p\u003e\n\u003cp\u003eYou aren’t healed yet.\u003c/p\u003e\n\u003cp\u003e“That is a fact I am painfully aware of. Soon, though, I will be healed enough that a carriage ride will only be a hurtful experience instead of an injurious one.” Elle paused, “As delightful as your company has been I would not be opposed to returning home. There are some family affairs I need to see to,” she said, staring unseeingly at the hedge in front of her as she thought of her family. Elle shook herself from her reverie and offered Emele a smile. “Do you have any family? Parents and siblings who aren’t also employed by Prince Severin?”\u003c/p\u003e\n\u003cp\u003eEmele hesitated. Yes.\u003c/p\u003e\n\u003cp\u003e“Do you miss them?”\u003c/p\u003e\n\u003cp\u003eEmele held her stick of chalk and stared at her slate. The black of her mask was a stark contrast against her pale skin in the warm sunlight. I do, she finally wrote.\u003c/p\u003e\n\u003cp\u003e“Can they visit you here?”\u003c/p\u003e\n\u003cp\u003eThey can, but they won’t.\u003c/p\u003e\n\u003cp\u003e“What? Why not? Do they live too far away, or can’t they spare the time?” Elle frowned.\u003c/p\u003e\n\u003cp\u003eNeither.\u003c/p\u003e\n\u003cp\u003e“I fail to understand.”\u003c/p\u003e\n\u003cp\u003eEmele stood. Are you refreshed? If you are tired a footman can carry you back.\u003c/p\u003e\n\u003cp\u003e“I’m refreshed,” Elle said, lunging off the bench.\u003c/p\u003e\n\u003cp\u003eEmele led the way down the path. Her smiles were gone and her countenance was subdued.\u003c/p\u003e\n\u003cp\u003eElle noted the change and thought it was best to hold her tongue.\u003c/p\u003e\n\u003cp\u003eThey strolled for a while, until Elle’s good leg burned with exertion and she suspected Emele had forgotten her entirely and was deep in thought. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-15.html","bookId":1808,"creation":"Oct 5, 2019 9:52:03 PM","modification":"Oct 5, 2019 9:52:03 PM"}
