{"id":83834,"no":22,"title":"Page 22","content":"\u003cp\u003eAfter pausing for a few moments, the seamstress stepped back and took an unused slate. She wrote in dramatic, curling letters and presented her message to the room. He will love it.\u003c/p\u003e\n\u003cp\u003eElle looked around, confusion wrinkling her forehead as she watched the maids hug each other and beam. They clapped their hands and soundlessly giggled. The maid holding the rose red cloth sample preened as she joined the other maids holding the previously selected shades.\u003c/p\u003e\n\u003cp\u003eHeloise drew everyone back into order by clapping three times.\u003c/p\u003e\n\u003cp\u003eThe maid with the knotted rope came back and measured Elle again as the seamstress swept out of the room, the maids holding the selected colors trailing behind her like ducklings.\u003c/p\u003e\n\u003cp\u003eBy the time the maid measured every inch of Elle and recorded the measurements on a slate the other women had finished packing up the cloth samples. They left in a gaggle, leaving Elle—shivering—with Bernadine, Heloise, and Emele.\u003c/p\u003e\n\u003cp\u003eEmele flung her fan aside and helped Elle redress as Bernadine and Heloise held a conversation through slate exchanges.\u003c/p\u003e\n\u003cp\u003e“I don’t think it’s necessary to make new dresses for me,” Elle gratefully taking her crutches when Emele handed them to her after twitching the hemline of her gown into place.\u003c/p\u003e\n\u003cp\u003eIt is, Bernadine wrote.\u003c/p\u003e\n\u003cp\u003eHeloise added, The payoff will be ample.\u003c/p\u003e\n\u003cp\u003eElle was unconvinced. She didn’t think the prince would stomach spending money on a wardrobe for a trespasser, but he was the one she sought out for help. He must have known what his servants were planning, right?\u003c/p\u003e\n\u003cp\u003eElle sighed and carefully seated herself on a couch. “I find that I do not care for being ignorant and ill informed.”\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003ePrince Severin the Gardener\u003c/p\u003e\n\u003cp\u003eA few days later, Elle could not keep a smile off her lips. She was in the gardens with Emele—the inner gardens, the ladies maid refused to go anywhere near the hedge lined walkway where she and Elle had met the bratty village boy—walking with ease and wearing the first of her new dresses.\u003c/p\u003e\n\u003cp\u003eThe design and mint green color immensely pleased Elle. Gone were the loose, puffy sleeves and the embarrassingly low neckline, which now cut off right below Elle’s collar bone instead of swooping further down her chest. The sleeves still ended at the elbow, but they were fitted and tight. The skirt was not puffed and required no underskirt unlike the previous dresses.\u003c/p\u003e\n\u003cp\u003eThe dress allowed Elle to swing forward and walk confidently and with much more grace and quickness.\u003c/p\u003e\n\u003cp\u003eEmele was still off put that her choice of gowns had been removed from Elle’s wardrobe. However, even Emele could not deny that Elle no longer tripped, and her crutches did not slide out underneath her anymore.\u003c/p\u003e\n\u003cp\u003e“Today is a perfect day,” Elle pronounced, closing her eyes and briefly sunning herself. “The air is perfect, neither too hot nor too cold. My dress is fabulous, and Jock is getting exercise. Come, Jock!” Elle called, choosing a new pathway to explore.\u003c/p\u003e\n\u003cp\u003eJock panted as he hurried after Elle and Emele. The girls wove their way through the gardens, stopping occasionally to admire a fountain or a pond.\u003c/p\u003e\n\u003cp\u003e“Look at that little pavilion on the other side of the pond, Emele. Do you know which path to take to get to it?” Elle asked, gesturing at a stone structure that was nestled into an inlet of the lily pad covered pond.\u003c/p\u003e\n\u003cp\u003eEmele didn’t seem to hear Elle. She was staring down one of the garden paths, rubbing the rounded corners of her slate.\u003c/p\u003e\n\u003cp\u003e“Emele?” Elle asked.\u003c/p\u003e\n\u003cp\u003eThe ladies maid didn’t reply, but she broke into a grin when what appeared to be a burly red bear trudged down the path, swinging an empty bucket.\u003c/p\u003e\n\u003cp\u003eAs the walker drew closer Elle realized it was not a bear, but a man. He was an impressive height and girth, and instead of following the tidy, clean-shaven look of fashion the man had a trimmed, wild red beard and short, curly red hair. The beard barely fit below his black mask, and Elle wondered how he kept himself groomed with the bothersome thing.\u003c/p\u003e\n\u003cp\u003eJock ran two circles around the bear man, barking and jumping, before he grew tired and had to lie down in the shade. Emele greeted the man with scarcely less enthusiasm. Elle, she wrote. This is Marc, chief gardener.\u003c/p\u003e\n\u003cp\u003e“It’s a pleasure to meet you, Marc,” Elle said. “The gardens are lovely.”\u003c/p\u003e\n\u003cp\u003eMarc bowed low.\u003c/p\u003e\n\u003cp\u003eHis Highness Prince Severin greatly esteems Marc for his talent with growing and tending to flowers, Emele wrote, her chest puffed with pride.\u003c/p\u003e\n\u003cp\u003eMarc bowed low, again.\u003c/p\u003e\n\u003cp\u003e“I see,” Elle said. “I imagine the royal palace does not have gardens half as well loved and tended to.”\u003c/p\u003e\n\u003cp\u003eEmele nodded, and Marc bowed low, as expressionless as a stone statue.\u003c/p\u003e\n\u003cp\u003eWhen we moved here there was almost nothing planted. Marc has worked diligently to amend that.\u003c/p\u003e\n\u003cp\u003e“His efforts have been greatly rewarded,” Elle said.\u003c/p\u003e\n\u003cp\u003eMarc, who was looking sideways at the pond, bowed low. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-22.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
