{"id":83836,"no":24,"title":"Page 24","content":"\u003cp\u003ePrince Severin stalked inside, his black cat nose twitching before he turned to look at Elle and his servants. He narrowed his cat eyes until they were golden glints of light. He raised his upper lip in a sneer. His white, alarming teeth were a sharp contrast against the black of his fur. A growl leaked from him, making the hair on the back of Elle’s neck stand on end.\u003c/p\u003e\n\u003cp\u003eEmele gracefully stood and curtsied, tipping the crown of her head to the prince. Oliver scrambled to his feet and rocked forward in a bow. When he popped upright he realized Emele hadn’t risen from her curtsey yet and hastily threw himself in an even deeper bow.\u003c/p\u003e\n\u003cp\u003eElle remained seated, and was glad she did so when Severin turned away and stalked into the bookshelves, disappearing from view.\u003c/p\u003e\n\u003cp\u003eOliver returned to his book, sitting cross legged on the floor and propping himself against the wall.\u003c/p\u003e\n\u003cp\u003eEmele remained standing, her mouth on the brink of a frown as she stared at the sea of bookshelves.\u003c/p\u003e\n\u003cp\u003e“Emele?” Elle said.\u003c/p\u003e\n\u003cp\u003eEmele raised a finger to her lips and shook her head.\u003c/p\u003e\n\u003cp\u003eSeverin reappeared, holding a book in one large paw. He stalked to the doors in his rolling, animalistic gait, and did not spare Elle and Emele a glance when he left, pulling the door shut with more strength than necessary.\u003c/p\u003e\n\u003cp\u003eEmele sighed and pulled out her slate. I may have made a miscalculation.\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003eEmele glanced at Oliver, but he was engrossed in his book. Emele adjusted her grip on her piece of chalk before writing again. I knew His Highness would be visiting the library this morning.\u003c/p\u003e\n\u003cp\u003e“So you brought me here on purpose,” Elle said, folding her arms across her chest.\u003c/p\u003e\n\u003cp\u003eEmele nodded.\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003ePrince Severin needs companionship. He is so lonely he is too empty to acknowledge it.\u003c/p\u003e\n\u003cp\u003e“With all due respect, Emele, you are utterly mad. The prince has no interest in me, and he has the friendliness of a viper.”\u003c/p\u003e\n\u003cp\u003eYou are mistaken. It is not that he is not friendly but that he has no friends. He sits in his study all day, fulfilling the desire’s of his brother’s heart. As members of his household we servants cannot fill the void of friendship.\u003c/p\u003e\n\u003cp\u003e“No one forced him to leave the courts of nobility. He made the decision to closet himself in this chateau,” Elle said, turning a page in her book.\u003c/p\u003e\n\u003cp\u003eEmele sat down. He did it to protect us.\u003c/p\u003e\n\u003cp\u003e“Pardon?”\u003c/p\u003e\n\u003cp\u003eThe village boy you and I encountered was not the first person to insult me.\u003c/p\u003e\n\u003cp\u003eElle stared at Emele, who avoided her gaze. “How many?” she finally asked.\u003c/p\u003e\n\u003cp\u003eMore than I care to recall.\u003c/p\u003e\n\u003cp\u003e“They are frightened of you?”\u003c/p\u003e\n\u003cp\u003eMagic makes folk uncomfortable. No one dared harm His Highness, but Oliver was almost killed by a crowd, and Marc was turned out of his house. Emele hesitated, resting her chalk on her slate before she added. My family disowned me.\u003c/p\u003e\n\u003cp\u003e“Emele, I’m sorry. They’re fools, they don’t see the truth,” Elle said, thumping her way around the table to sit next to her friend.\u003c/p\u003e\n\u003cp\u003eYes. So Prince Severin came to Chanceux Chateau to spare us more pain. In doing so he has utterly cut himself off. You could change that, Elle.\u003c/p\u003e\n\u003cp\u003e“You are mistaken, Emele, I cannot. You saw the way he glared at us. His Highness Prince Severin has no wish to further know me, and I am not going to push the relationship.”\u003c/p\u003e\n\u003cp\u003eIt only appears that way because he has been hurt too many times.\u003c/p\u003e\n\u003cp\u003e“Forgive me if my heart does not bleed for him,” Elle dryly said.\u003c/p\u003e\n\u003cp\u003eWill you try? Please?\u003c/p\u003e\n\u003cp\u003eElle raised her gaze from the slate to look at Emele’s masked face. Her eyes, the only bit of upper facial features Elle could see, were painfully filled of hope. But, in spite of the pretty portrait Emele painted of Prince Severin, Elle doubted the maid was right. Prince Severin couldn’t be lonely. He was too ruthless and crafty to have any kind of haunting emotion like loneliness.\u003c/p\u003e\n\u003cp\u003eRather than outright lie to her, Elle changed the subject. “I would like to go for a walk again today in the gardens. I very much wish to see the pavilion on the pond. Could we take our tea there?”\u003c/p\u003e\n\u003cp\u003eEmele’s shoulders fell as she took her slate from Elle.\u003c/p\u003e\n\u003cp\u003e“Perhaps we will run into the dashing Marc. You should study this book so you can ask him questions,” Elle said, pulling the flower book across the table.\u003c/p\u003e\n\u003cp\u003eEmele turned bright red and stopped writing. She hastily erased her message and started writing again. I already have.\u003c/p\u003e\n\u003cp\u003eElle laughed. “You’ve read it before? Emele, you fox!”\u003c/p\u003e\n\u003cp\u003eA week later Oliver accompanied Elle and Jock through the sprawling gardens, carrying an open parasol. Elle glanced over her shoulder at the dutiful stable boy. “Oliver, you don’t have to stay. I didn’t really want a parasol to begin with, and I assure you I’m not going to leave the gardens.”\u003c/p\u003e\n\u003cp\u003eOliver pinned the frilled accessory against his shoulder as he wrote. Mademoiselle Emele instructed me to remain with you. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-24.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
