{"id":83837,"no":25,"title":"Page 25","content":"\u003cp\u003e“I see,” Elle said, impressed with the ladies maid’s ability to boss Elle around even in her absence. Emele was overseeing the final dress of Elle’s new wardrobe with Bernadine and Heloise. Elle didn’t understand what was so special about it, but she was grateful for the chance to escape to the gardens, unattended. Or so she thought.\u003c/p\u003e\n\u003cp\u003eJock bounced around Elle’s feet, breathing loudly and getting leaves stuck in the sweeping fringe of his tail. The dog growled and chased his tail, spinning in a circle before he ran out of air and had to sit down.\u003c/p\u003e\n\u003cp\u003e“I understand completely,” Elle said to the fat dog before she raised her nose in the air and sniffed. The sweet scent of flowers thickened the air. “Oliver, where are the flowers? I can smell them, but we’ve only seen green things so far.”\u003c/p\u003e\n\u003cp\u003eOliver started down one of the garden paths, beckoning for Elle to follow. Elle thumped after her small guide, smiling up at the sun as Jock barked.\u003c/p\u003e\n\u003cp\u003eOliver led Elle to an open garden that overflowed with flowers. There were strands of pastel colored sweet peas, colonies of prideful narcissus, bushes of irises, peonies, daffodils, and more. Most of all, though, there were roses. Some were the size of Elle’s thumbnail. Others were as big as her hand stretched wide open. They came in pinks, reds, whites, yellows, even oranges and pink tinted purples.\u003c/p\u003e\n\u003cp\u003eThe garden was a wash of rainbow hues, and bees hummed in the air while tiny hummingbirds darted from flower to flower.\u003c/p\u003e\n\u003cp\u003eElle stared in shock, she had never seen so many flowers—so many types of flowers—in bloom at once. Everything was in bloom, even flowers that were supposed to bloom in spring and early summer. “Emele is right. Marc is incredible,” Elle exclaimed, breathing in the sweet, fragrant air. “Fall is due to arrive any day, but this garden looks like it is early spring.”\u003c/p\u003e\n\u003cp\u003eOliver cheekily grinned. Not all Marc.\u003c/p\u003e\n\u003cp\u003e“Who else does this? It’s beautiful. I don’t think a fairy’s garden could look this gorgeous,” Elle said.\u003c/p\u003e\n\u003cp\u003eOliver raised his eyebrows but didn’t write out a reply as Elle explored. She made her way past a bed of snapdragons and admired the chrysanthemums before a rosebush caught her attention. The roses themselves were orange, but the petal edges were a striking red.\u003c/p\u003e\n\u003cp\u003eJock pulled Elle’s attention from the flowers by exploding in ferocious barks before running up and down the path twice.\u003c/p\u003e\n\u003cp\u003e“Jock? What’s wrong?” Elle asked as the dog raced past her. He kept going this time, following a pathway out of the flower garden. “Jock!” Elle said, hurrying after him on her crutches.\u003c/p\u003e\n\u003cp\u003eOliver scurried at Elle’s side, trying to hold the parasol above her.\u003c/p\u003e\n\u003cp\u003e“Forget about the parasol, Oliver. Can you run ahead and find Jock? Jock!” Elle called, turning a corner.\u003c/p\u003e\n\u003cp\u003eThe little dog hadn’t gone far. He was hopping around a set of gardening tools, barking and snarling at someone who was hidden behind a large rosebush.\u003c/p\u003e\n\u003cp\u003e“I’m sorry—,” Elle stopped when was able to skirt around the rosebush and see who Jock was attacking.\u003c/p\u003e\n\u003cp\u003eIt was Prince Severin, but unlike Elle had ever seen him.\u003c/p\u003e\n\u003cp\u003eTo begin with, he was dirty. His fur was matted with dirt, and the clothes he wore were simple, faded, and ragged. The Prince’s sleeves were rolled up past his elbows, and he was up to his forearms in dirt and mud. A pile of wilting weeds was mounded next to him, and he held a trowel in one hand. He stared at Elle, frozen in the middle of pulling a weed.\u003c/p\u003e\n\u003cp\u003eElle stared at Severin for a moment before shutting her eyes and pinching herself on the forearm. When she opened her eyes the prince was still there.\u003c/p\u003e\n\u003cp\u003eOliver looked away and took tiny steps backwards, edging away from the stunned pair. He made it all the way to the flower garden without being noticed.\u003c/p\u003e\n\u003cp\u003eA bee buzzed between Elle and the prince, and Elle finally found her voice. “Good morning, Your Highness,” she said, her voice was flat and toneless.\u003c/p\u003e\n\u003cp\u003eSeverin looked down at the weed and growled, plucking it from the ground with ease.\u003c/p\u003e\n\u003cp\u003eElle kept staring as the prince weeded. He seemed different. Maybe it was seeing him covered in dirt, or maybe it was the simple fact that he was gardening. Elle thoughtfully scratched her scalp. “The gardens are exotic. I am interested in your garden management, for I cannot fathom how you manage to have all these flowers in bloom at once,” she said.\u003c/p\u003e\n\u003cp\u003eSeverin looked up and jabbed at Elle with the trowel. “Not one word,” he ordered.\u003c/p\u003e\n\u003cp\u003eElle blinked. “Pardon?”\u003c/p\u003e\n\u003cp\u003e“I am not gardening. I am spiritually cleansing myself.”\u003c/p\u003e\n\u003cp\u003e“Oh. Of course.”\u003c/p\u003e\n\u003cp\u003eThe skin on the bridge of Severin’s cat nose wrinkled. “The act of weeding allows me to expel my thoughts so I may work more efficiently.”\u003c/p\u003e\n\u003cp\u003e“Your Highness. Gardening is not something to be ashamed of.”\u003c/p\u003e\n\u003cp\u003e“All good warriors must make time to focus their thoughts.”\u003c/p\u003e\n\u003cp\u003e“It is a genteel and admirable hobby,” Elle said, reaching out to rub a rosebush leaf between her fingers.\u003c/p\u003e\n\u003cp\u003e“The balance of peace and work allows one to obtain an optimum performance level.”\u003c/p\u003e\n\u003cp\u003e“Your Highness, allow me to say that you appear to have selective hearing.”\u003c/p\u003e\n\u003cp\u003e“Stop rubbing the bush, you’re getting your finger oils on it,” Severin said before he went back to pulling weeds. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-25.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
