{"id":83847,"no":36,"title":"Page 36","content":"\u003cp\u003e“A stable?” Elle said, batting Emele away when the ladies maid tried to adjust the scarf hanging from Elle’s neck.\u003c/p\u003e\n\u003cp\u003e“Yes,” Severin said, fiddling with a cuff of his waistcoat. “Oliver and the grooms are not ornamental staff members,” he dryly said.\u003c/p\u003e\n\u003cp\u003e“How many horses?” Elle asked, eagerly drawing her hood.\u003c/p\u003e\n\u003cp\u003e“A dozen. There is my riding horse, several carriage horses, and the work horses,” Severin said, watching Emele help Elle struggle into her suede mittens.\u003c/p\u003e\n\u003cp\u003e“Are there any dogs? Besides Jock I mean.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“There used to be a kennel, but the dogs snarled whenever they scented me and the kennel master could not control them as aptly as he used to since he lacks a voice,” Severin wryly said. “Stay behind me,” he added.\u003c/p\u003e\n\u003cp\u003e“What’s wrong—,” Elle’s breath was knocked from her lungs when Severin opened the doors. The wind howled and blew, stinging Elle’s bare skin with frigid temperatures.\u003c/p\u003e\n\u003cp\u003eSeverin stepped out of the castle and turned around to pull Elle after him. He shut the door as Elle tried to hold her wildly blowing cloak against her.\u003c/p\u003e\n\u003cp\u003e“Hold on,” Severin said before he picked Elle up and perched her on his back, the same way he carried her when fleeing Bernadine.\u003c/p\u003e\n\u003cp\u003e“Emele would kill you if she knew this is how I’m getting to the stables,” Elle shouted above the howling wind.\u003c/p\u003e\n\u003cp\u003eSeverin didn’t reply—even when Elle pressed her face against the warm fur leaking out of the back collar of his waistcoat. He picked up her crutches and hustled across the courtyard, entering the stable with a bang.\u003c/p\u003e\n\u003cp\u003eElle slipped from Severin’s back and leaned against a stall while Severin wrestled the door shut. The stable was solid and warm. It smelled like hay and wood shavings, and several horses hung their heads over the stall doors, looking at Elle with bright eyes.\u003c/p\u003e\n\u003cp\u003e“They are beautiful animals,” Elle said, drawing closer to the nearest horse. It was a coal black Percheron, a draft horse used for farm work.\u003c/p\u003e\n\u003cp\u003eThe horse sniffed Elle’s gloved hand, hoping for treats. He blew on her, puffing warm, sweet smelling air.\u003c/p\u003e\n\u003cp\u003eElle smiled until the horse drew back, pinning its ears against its head. It retreated to the back of its stall and placed its butt in her direction.\u003c/p\u003e\n\u003cp\u003eElle frowned and glanced up at Severin, who had joined her at the stall door. “Animals do not much care for me in this figure,” Severin said.\u003c/p\u003e\n\u003cp\u003e“Which one is yours?” Elle asked.\u003c/p\u003e\n\u003cp\u003e“The only one that does not shy away,” Severin said, leading the way down the aisle.\u003c/p\u003e\n\u003cp\u003eWherever Severin passed horses shied or snarled, striking their stall doors with hooves and flattening their ears. The more docile tempered work horses retreated to the back of their stalls, but a team of matched carriage horses all lunged against their doors.\u003c/p\u003e\n\u003cp\u003eAt the far end of the stable a tall horse hung his head over a stall door and nickered. He had mouse colored fur and a dark colored mane and tail. His muzzle was sooty black—as if he had rubbed his face in fireplace ashes, and when Severin opened the stall door Elle could see the same sooty black color crawled up his legs.\u003c/p\u003e\n\u003cp\u003e“He’s very fine looking,” Elle said as Severin slipped the gelding a treat from his pocket.\u003c/p\u003e\n\u003cp\u003e“He was my charger when I was a field commander,” Severin said.\u003c/p\u003e\n\u003cp\u003e“You kept him when you were named commanding general?” Elle asked, tugging one of her mittens off to pet the charming horse.\u003c/p\u003e\n\u003cp\u003e“I did. He was too old be used in battles, so he was retired to my personal stables to be retained as a riding horse,” Severin said.\u003c/p\u003e\n\u003cp\u003eElle turned to look at the other horses housed in the cheerful stables. “He’s the only horse that is not afraid of you?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“That is depressing.”\u003c/p\u003e\n\u003cp\u003e“Their dislike is natural. I smell and have the appearance of a predator,” Severin said, placing a clawed hand on his horse’s neck.\u003c/p\u003e\n\u003cp\u003e“What is his name?” Elle asked.\u003c/p\u003e\n\u003cp\u003e“Fidele,” Severin said.\u003c/p\u003e\n\u003cp\u003eThe mouse colored horse brushed his whiskery muzzle against Elle’s palm. “You are a brave and loyal mount,” Elle told the horse as Severin exited the stall and shut the door. “He’s quite furry,” Elle called as Severin climbed a ladder to the hayloft.\u003c/p\u003e\n\u003cp\u003e“Winter is almost here. All the horses grow thicker coats then. Do you ride?” Severin asked, pitching hay down to the stalls.\u003c/p\u003e\n\u003cp\u003e“A little. I am proficient enough that I won’t fall, and I can put a horse through the paces. I’ve never owned one, though, and I haven’t ever cared for one either,” Elle said as Fidele left her to investigate his hay.\u003c/p\u003e\n\u003cp\u003e“Not even when your father was a merchant?”\u003c/p\u003e\n\u003cp\u003e“No, we lived in a river port city. He conducted most of his business by ship,” Elle said, plopping down on a bag of grain. A tiger striped barn cat shyly watched her from a stall partition. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-36.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
