{"id":83851,"no":40,"title":"Page 40","content":"\u003cp\u003e“Today I want to go down the stairs,” Elle announced to Emele over her breakfast toast.\u003c/p\u003e\n\u003cp\u003eI will summon the footmen to bring your chair, Emele wrote after she finished wiping white Jock hairs off a couch pillow.\u003c/p\u003e\n\u003cp\u003e“You misinterpreted the meaning of my words. I want to walk down the stairs. I don’t want to be carried.”\u003c/p\u003e\n\u003cp\u003eEmele held a hand to her throat before she scribbled away on her slate. Her penmanship was messy and scrawling. You can’t, you can’t use crutches and go down steps. It would be too dangerous.\u003c/p\u003e\n\u003cp\u003e“I won’t need crutches. I can hold onto the railing.”\u003c/p\u003e\n\u003cp\u003eYou cannot move without crutches.\u003c/p\u003e\n\u003cp\u003e“I believe that I can,” Elle firmly said.\u003c/p\u003e\n\u003cp\u003eEmele pursed her lips.\u003c/p\u003e\n\u003cp\u003e“Talk to Duval if you must, but my leg is better, I am sure of it. I just need to get my strength back.”\u003c/p\u003e\n\u003cp\u003eEmele’s lower lip trembled. Do you want to leave us that badly?\u003c/p\u003e\n\u003cp\u003eElle reached for Emele’s hand. “You are willfully misunderstanding me today. That’s not it at all. I enjoy it here, but I will have to leave eventually. I’m not totally healed yet, Emele. Today I will merely go down a flight of stairs, I won’t go up.”\u003c/p\u003e\n\u003cp\u003eEmele brushed a teardrop from her eyelashes and bravely nodded.\u003c/p\u003e\n\u003cp\u003eElle finished her breakfast as Emele fluttered around the room, anxiously straightening cushions and inspecting Elle’s wardrobe.\u003c/p\u003e\n\u003cp\u003eThe ladies maid helped Elle into one of her new dresses—the blue-gray dress that set off her eyes just right. The castle was cold enough that Elle took a white shawl to wrap around her shoulders.\u003c/p\u003e\n\u003cp\u003e“I want my hair down today, it’s too cold to pin it up,” Elle said when Emele held a handful of hairpins and patted a chair in invitation.\u003c/p\u003e\n\u003cp\u003eEmele nodded and retrieved a brush, carefully brushing Elle’s inky black hair until it gleamed.\u003c/p\u003e\n\u003cp\u003eWhen she finished Emele wrote, I am going to get a manservant to come with us as you descend the stairs.\u003c/p\u003e\n\u003cp\u003eWhen Elle arched an eyebrow the ladies maid added, Just in case.\u003c/p\u003e\n\u003cp\u003eElle sighed. “Very well. Go get one, I will meet you at the closest staircase,” she said, reaching for her crutches. She barely had time to stand before Emele exited the room, cramming her wide skirts through the bedroom door.\u003c/p\u003e\n\u003cp\u003eElle propped her crutches under her arms and made her way to the door. When she left her room and started down the hallway she moved slowly, taking the time to carefully set her mending foot on the ground.\u003c/p\u003e\n\u003cp\u003eWhen she reached the staircase Emele was already waiting there with the selected manservant.\u003c/p\u003e\n\u003cp\u003e“Hello, Burke,” Elle greeted, glancing at Emele in surprise.\u003c/p\u003e\n\u003cp\u003eWhen Emele said manservant Elle thought she meant one of the tall, muscled footmen. Burke was about as muscled as a flashy colored duck and would be roughly as useful as one.\u003c/p\u003e\n\u003cp\u003eBurke smiled brightly before he bowed, the vibrant ruby fabric of his waistcoat blinding Elle. When he straightened up he gestured to the stairs behind himself and clapped.\u003c/p\u003e\n\u003cp\u003eElle sidled up to the stair railing. She exhaled and handed her crutches to Emele before placing a hand on the railing. She took a moment to flex her ankles before she stepped down, moving her good leg first. When she was safely situated she turned to grin at Emele and Burke.\u003c/p\u003e\n\u003cp\u003eBurke clasped his hands and pumped them above his head, and Emele clapped encouragingly.\u003c/p\u003e\n\u003cp\u003eElle carefully descended the stairs, going one step at a time. The effort exhausted her, but she gritted her teeth and pushed on. “I won’t recover if I don’t push myself,” Elle muttered, carefully climbing down another step. She was five steps from the bottom of the stairs when her leg abruptly gave out.\u003c/p\u003e\n\u003cp\u003eElle clung to the rail to keep herself from crashing headfirst down the stairs, but she would have slammed into the stairs if Severin hadn’t caught her by the waist with one arm.\u003c/p\u003e\n\u003cp\u003eElle released the breath she was holding but was still stiff with tension when she realized the cursed prince had her.\u003c/p\u003e\n\u003cp\u003e“Did it ever occur to you,” Severin said. “To try a few stairs, call it a success, and end it before it became a failure? Or, better yet, to strengthen your leg first by walking instead of going straight to climbing like a mountain goat?”\u003c/p\u003e\n\u003cp\u003eSeverin held Elle secure as he descended to a stair lower than the one she stood on. Elle threw her arms around his hulking shoulders before he picked her legs out from under her and carried her down the remaining stairs.\u003c/p\u003e\n\u003cp\u003e“I have been trying to strengthen my leg,” Elle said, her hands clenching the fabric of his shirt.\u003c/p\u003e\n\u003cp\u003eSeverin held Elle aloft even after they reached the main floor. “Then might I recommend you try more?” he said as he swiveled so they faced his servants.\u003c/p\u003e\n\u003cp\u003eEmele and Burke appeared to be congratulating each other. They didn’t even try hiding their smug smiles, and ignored Severin and Elle. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-40.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
