{"id":83852,"no":41,"title":"Page 41","content":"\u003cp\u003eElle frowned as she watched her gleeful ladies maid. “Thank you for your help, Your Highness. I am lucky you happened to be passing by.”\u003c/p\u003e\n\u003cp\u003eSeverin narrowed his eyes as he too stared at his servants. “It wasn’t by chance. Burke was with me when Emele fetched him. The pair exchanged secretive words through their slates. As my sense of well being is keenly tied to the activities of Bernadine, Heloise, and Emele I thought it would be prudent to see what she was doing. Unfortunately I might have played right into her hands.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Elle asked.\u003c/p\u003e\n\u003cp\u003e“Nothing. Emele, are you going to leave us standing here all day, or will you bring the crutches down?” Severin said, his voice was clear and piercing.\u003c/p\u003e\n\u003cp\u003eEmele sashayed down the stairs, sweetly presenting Elle’s crutches to her when Severin gently set her down.\u003c/p\u003e\n\u003cp\u003eElle took the crutches and propped them under her arms. “Thank you again, Your Highness.”\u003c/p\u003e\n\u003cp\u003e“Think nothing of it,” Severin said before growling, “Burke.”\u003c/p\u003e\n\u003cp\u003eThe brightly clothed valet saluted Severin.\u003c/p\u003e\n\u003cp\u003e“I will meet you in my study one hour hence. Do not be late,” Severin warned before he stalked across the room and up the far staircase.\u003c/p\u003e\n\u003cp\u003eElle watched him go before she turned to face Emele. The ladies maid was wearing a triumphant smile, her shoulders were raised slightly and her skin glowed. She looked, almost, as if she had just been granted the dearest wish of her heart. It was odd.\u003c/p\u003e\n\u003cp\u003e“Emele,” Elle started.\u003c/p\u003e\n\u003cp\u003eYes, Emele wrote as two housemaids swept past, carrying a rug that had just been aired out.\u003c/p\u003e\n\u003cp\u003eElle thought for a moment and decided this was neither the time nor the place to start what was very likely to be an argument. “ I’m famished. Do you think we could visit Bernadine in the kitchens and take some refreshments?”\u003c/p\u003e\n\u003cp\u003eI don’t see why not\u003c/p\u003e\n\u003cp\u003e“Fantastic! Let’s go, shall we?”\u003c/p\u003e\n\u003cp\u003eWhatever you wish, Elle.\u003c/p\u003e\n\u003cp\u003eElle chose not to confront Emele over her odd behavior until they took afternoon tea in the privacy of Elle’s bedroom.\u003c/p\u003e\n\u003cp\u003e“Emele, do you care to explain why you are so interested in my interactions with Prince Severin?” Elle asked, stirring sugar into her tea with a harmless smile.\u003c/p\u003e\n\u003cp\u003eEmele choked on the cookie she was consuming. She washed it down with a few sips of her tea before writing on her slate with controlled movements. What do you mean?\u003c/p\u003e\n\u003cp\u003e“I mean that your insistent intrusions beg me to believe there is more to your reason for asking me to befriend your master than a desire to stave off his supposed loneliness,” Elle said.\u003c/p\u003e\n\u003cp\u003eIsn’t it natural that I would want you, my close friend, to admire His Highness as well?\u003c/p\u003e\n\u003cp\u003e“Admire, perhaps. But you and all the servants in this chateau—with the exception of Marc, and he doesn’t notice anything that isn’t planted in the ground—push Severin and I together in the most tacky of ways.”\u003c/p\u003e\n\u003cp\u003eI don’t know what you’re referring to.\u003c/p\u003e\n\u003cp\u003eElle arched an eyebrow. “Oh really? Very well. It doesn’t matter, I expect I will only be here until the end of the week. I will be returning home soon you know.”\u003c/p\u003e\n\u003cp\u003eEmele panicked and made several curls fall out of the ornate bun she had styled her hair in that day with the severity of head shaking she displayed. No, you can’t!\u003c/p\u003e\n\u003cp\u003e“And why can’t I?” Elle asked, she still smiled but her eyes conveyed no warmth at all.\u003c/p\u003e\n\u003cp\u003eEmele drooped. You’re so close.\u003c/p\u003e\n\u003cp\u003e“Close to what?”\u003c/p\u003e\n\u003cp\u003eEmele hesitated and wrote, I cannot tell you. His Highness should be the one to explain.\u003c/p\u003e\n\u003cp\u003eElle leaned back in her chair and sighed in defeat. “I see.”\u003c/p\u003e\n\u003cp\u003eThe dishes clinked as Emele gathered up the tea cups. Have you finished your tea?\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eThen I shall return these to the kitchens. I will be back shortly.\u003c/p\u003e\n\u003cp\u003e“Thank you, Emele,” Elle said.\u003c/p\u003e\n\u003cp\u003eEmele dipped in an elegant curtsey before picking up the tray and bustling through the bedroom door.\u003c/p\u003e\n\u003cp\u003eAs she had several times before, Elle waited until Emele’s footsteps disappeared down the hallway before she snatched up her crutches. She made her escape, heading in the opposite direction that Emele disappeared in.\u003c/p\u003e\n\u003cp\u003e“If she doesn’t want to tell me that’s fine. I’ll just have to ask His Highness myself,” Elle said as she hurried up the hallway. After crossing several twisted hallways, Elle stopped outside Severin’s study.\u003c/p\u003e\n\u003cp\u003e“Enter,” Severin said after Elle knocked on the door.\u003c/p\u003e\n\u003cp\u003eElle opened the door. “We need to talk,” she said when Severin looked away from the tall, ornately framed mirror he was staring at.\u003c/p\u003e\n\u003cp\u003e“Then sit down, and let us talk,” Severin said.\u003c/p\u003e\n\u003cp\u003eElle set her crutches aside before closing the study door and slowly walking up to a chair pulled in front of Severin’s desk.\u003c/p\u003e\n\u003cp\u003e“Impressive,” Severin said when Elle seated herself. “You have increased in strength and ability. You wish to depart for your home soon?”\u003c/p\u003e\n\u003cp\u003e“Yes, but that’s not what I want to talk about,” Elle said. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-41.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
