{"id":83856,"no":45,"title":"Page 45","content":"\u003cp\u003e“You misunderstand. He is leaving with you,” Severin said. The wooden stall wall protested when he leaned his weight against it. “He will stay with you at Noyers. The hostlers expect your arrival, and his feeding and lodging has already been arranged.”\u003c/p\u003e\n\u003cp\u003eElle shook her head. “I can’t.”\u003c/p\u003e\n\u003cp\u003e“I thought you said you liked horses?” Severin asked.\u003c/p\u003e\n\u003cp\u003e“I do,” Elle said. “It’s just…”\u003c/p\u003e\n\u003cp\u003eFor the first time in their acquaintance, Elle was at a loss for words. When the pony leaned into her touch her face tightened and she narrowed her eyes. It took Severin a few moments to realize she was forcibly keeping herself from crying.\u003c/p\u003e\n\u003cp\u003e“It’s too much,” Elle finally said, turning to face Severin. “You’ve housed me and fed me for weeks, Severin, and you had an entirely new wardrobe made for me. You’ve already given me too much, I can never repay you.”\u003c/p\u003e\n\u003cp\u003eSeverin tilted his head, his cat ears quizzically flicking. “You aren’t meant to. That’s what a gift means.”\u003c/p\u003e\n\u003cp\u003e“People don’t give me gifts,” Elle said. “I can take care of myself and my family without aid or assistance.”\u003c/p\u003e\n\u003cp\u003e“I don’t mean to imply you are incapable by giving you a gift. It is precisely the opposite,” Severin said. “Hasn’t anyone given one to you before?”\u003c/p\u003e\n\u003cp\u003eElle looked at Rosemerry. “Not like this.”\u003c/p\u003e\n\u003cp\u003e“You alone carry your family’s financial burden?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eSeverin nodded. “I thought as much. You have a savior complex.”\u003c/p\u003e\n\u003cp\u003e“I do not!” Elle sputtered.\u003c/p\u003e\n\u003cp\u003eSeverin cracked a feline smile at her. “You do. And you are nearly as proud as I am. I bought the pony only with the motivation of bringing you joy. You seem happier around animals. You told me yourself that you find animals soothing. I would send Jock home with you if I could, but Heloise loves the mongrel too much. You said you didn’t have a horse,” Severin trailed off with a shrug.\u003c/p\u003e\n\u003cp\u003e“But the dresses—.”\u003c/p\u003e\n\u003cp\u003eSeverin sighed, which sounded more like an impatient growl. “Although I am pleased you are not greedy for more, I find your estimation of my wealth deplorable. The price of the dresses and Rosemerry are miniscule in comparison to my income. I—and my household—will feel no pain on behalf of these purchases. They will not even be noticed.”\u003c/p\u003e\n\u003cp\u003eElle was silent for a moment before she chuckled. “Oh, they will be noticed! You can bet that Bernadine and Emele are consorting over the pony right now.”\u003c/p\u003e\n\u003cp\u003e“That is probably so.”\u003c/p\u003e\n\u003cp\u003eElle stroked Rosemerry for a few good minutes before Severin finally spoke again. “Elle, take him.”\u003c/p\u003e\n\u003cp\u003eElle scrunched her eyes shut. “Alright,” she agreed before opening her green eyes and smiling at Severin. “Thank you for the pony, Severin. I will treasure him.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t expect any less of you,” Severin said, turning around to walk back up the aisle.\u003c/p\u003e\n\u003cp\u003e“Where are you going?” Elle asked.\u003c/p\u003e\n\u003cp\u003e“To get the side saddle.”\u003c/p\u003e\n\u003cp\u003e“I beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“He wouldn’t be any good to you without tack, would he?”\u003c/p\u003e\n\u003cp\u003e“The weather is too poor to ride outside,” Elle said.\u003c/p\u003e\n\u003cp\u003e“Naturally. You can perch on him in here and test how riding feels with your leg,” Severin said, returning with a ladies side saddle. “I bought you a regular saddle too in which you can sit astride in, but be careful in choosing when to use it. You will upset the delicate sensibilities of noble women, should they see you riding so,” Severin sneered, opening the door to Rosemerry’s box stall.\u003c/p\u003e\n\u003cp\u003eElle watched the easy way Severin strapped the oddly shaped saddle on Rosemerry’s back. “You really like horses, don’t you?”\u003c/p\u003e\n\u003cp\u003eSeverin glanced up as he tightened the saddle’s girth. “Yes. I spent much of my boyhood serving under the generals of Loire’s cavalry. I grew up on them.”\u003c/p\u003e\n\u003cp\u003e“You don’t get to be around them much anymore?”\u003c/p\u003e\n\u003cp\u003e“Not looking and smelling like this,” Severin shrugged.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” Elle said.\u003c/p\u003e\n\u003cp\u003e“There’s nothing to be sorry for. Sit lightly,” was the only warning Severin gave before he picked Elle up and perched her on the saddle.\u003c/p\u003e\n\u003cp\u003eElle grasped Rosemerry’s neck as she heaved her legs into position. “Thank you for the warning.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome,” Severin said, adjusting the placement of Elle’s leg on the saddle. “Now, I’m going to get his halter and lead him in the aisle. When I do you can grip his mane...”\u003c/p\u003e\n\u003cp\u003eThe morning of Elle’s departure, Elle hurried down the stairs in her gray dress—stepping carefully and gripping the stair railing. Emele skirted at her side, but Elle ignored the slate the ladies maid pushed at her.\u003c/p\u003e\n\u003cp\u003e“It’s wrong, I must have miss-seen the view from my window. It can’t be,” Elle said when she reached the main floor. Servants seemed to crawl out of the woodwork as Elle took firm, confident strides. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-45.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
