{"id":83861,"no":50,"title":"Page 50","content":"\u003cp\u003eSeverin chuffed before he nodded to Oliver and smoothly mounted Fidele. The large gelding tossed his head before leading the way out of the courtyard and down the shoveled driveway.\u003c/p\u003e\n\u003cp\u003eBehind them the servants—unable to call out—clapped their hands or waved white, lace handkerchiefs in the crisp air.\u003c/p\u003e\n\u003cp\u003eNeither Severin nor Elle acknowledged the send off as they rode on.\u003c/p\u003e\n\u003cp\u003eIt took nearly five minutes to reach the edge of Chanceux Chateau grounds. The front gates were open, fastened to the walls of a brick bridge that extended over a small river, but the road running outside the chateau was untouched by travelers and snow shovelers alike.\u003c/p\u003e\n\u003cp\u003e“We will ride east, it’s the route we will take when you finally are able to return to the palace,” Severin said, gesturing up the road.\u003c/p\u003e\n\u003cp\u003e“Very well,” Elle said.\u003c/p\u003e\n\u003cp\u003eThey settled into a brisk walk, Severin going first on Fidele to break the path for the smaller Rosemerry.\u003c/p\u003e\n\u003cp\u003eThe snow was not terribly deep in most places on the road. It had drifted horribly on the far side of the road, gathering in piles nearly as tall as Rosemerry in some spots, but as a result the opposite edge was scant inches deep.\u003c/p\u003e\n\u003cp\u003e“It certainly is beautiful,” Elle said. Snow covered the trees and bushes in a white glaze, and the sunshine made it sparkle.\u003c/p\u003e\n\u003cp\u003eSeverin glanced at the iced branches overhead. “It can be,” he said.\u003c/p\u003e\n\u003cp\u003e“You’re a gardener, how can you not enjoy the beauty of nature?”\u003c/p\u003e\n\u003cp\u003e“I also happen to be a general, and snow is miserable weather to camp or move an army in.”\u003c/p\u003e\n\u003cp\u003eElle thoughtfully studied the snowy forest. “How far do the chateau lands extend?” Elle asked.\u003c/p\u003e\n\u003cp\u003e“Quite far. Chanceux Chateau is the only household in these woods. The village is the closest settlement, but the woods extend for miles until reaching Lord de Bertainmont’s land.”\u003c/p\u003e\n\u003cp\u003e“His land borders the capital’s district, doesn’t it?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“So it is quite rural in these parts.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eThe pair was quiet for a time until Severin asked, “You find it forlorn?”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“The small population and lack of industry.”\u003c/p\u003e\n\u003cp\u003e“Goodness, no. I have spent my life penned up in the city, I heartily approve of the extra elbow room. I am dreadfully jealous of my sisters and their rustic lifestyle in the country,” Elle said.\u003c/p\u003e\n\u003cp\u003e“It is rare for a person to feel that way,” Severin said.\u003c/p\u003e\n\u003cp\u003e“How do you find the country life to be?” Elle asked.\u003c/p\u003e\n\u003cp\u003eSeverin shifted in the saddle. “I do not know. I enjoy the chateau and the privacy it brings, but my work is greatly hindered by the isolation. If I could ride to the palace to straighten out army affairs rather than meet with my brother in the lodge I believe I would enjoy it more.”\u003c/p\u003e\n\u003cp\u003e“Why do you meet at the lodge then?” Elle asked.\u003c/p\u003e\n\u003cp\u003eSeverin didn’t respond.\u003c/p\u003e\n\u003cp\u003eElle shrugged and returned her attention to the scenery. “What is that?” Elle asked, pointing to a depilated looking bridge that was covered in snow.\u003c/p\u003e\n\u003cp\u003e“I believe that is the entrance to one of the chateau’s many hunting trails. As I do not share the passion for hunting that Lucien has, it has not been used in some time. It leads into a back path to the gardens, though.”\u003c/p\u003e\n\u003cp\u003e“How useful,” Elle said as they forged on. “How long do you think we should press on?”\u003c/p\u003e\n\u003cp\u003e“I’m not certain,” Severin said. “Unfortunately I do not think you will be able to trudge home in this, unless more of it melts. Rosemerry is not capable off—,” Severin silenced himself and halted Fidele, making the big gelding restlessly paw at the snow covered ground.\u003c/p\u003e\n\u003cp\u003e“What is it?” Elle asked.\u003c/p\u003e\n\u003cp\u003eSeverin held up a hand and stared into the forest, his ears were rigid as he listened. He narrowed his eyes and placed a hand on his rapier—which Elle hadn’t thought much of him bringing until that moment.\u003c/p\u003e\n\u003cp\u003eElle uneasily shifted in the saddle, making her boot that she stored her small dagger in easier to reach. Rosemerry snorted, and Elle finally heard it. Cackling.\u003c/p\u003e\n\u003cp\u003eThe dark laughter echoed up and down the road as the sun disappeared behind a cloud and bare tree branches rattled overhead. Elle closed her eyes when the wind kicked up with a howl, pulling on her clothes and stinging her cheeks with its icy breath.\u003c/p\u003e\n\u003cp\u003eWhen it finally subsided Elle opened her eyes.\u003c/p\u003e\n\u003cp\u003eAn old woman, a hag wrapped in cloth that looked like cobwebs, stood in their way not twenty feet up the road. Her face was lined with wrinkles—not the ones that expressed joy or laughter, but lines etched by the permanent grimace she wore. What few teeth she had were black, but most unsettling were her white eyes. They were the sickly color of curdled milk.\u003c/p\u003e\n\u003cp\u003eRosemerry snorted and danced backwards, making Elle cling to him.\u003c/p\u003e\n\u003cp\u003eSeverin unsheathed his rapier and the hag chuckled.\u003c/p\u003e\n\u003cp\u003e“Unnecessary, boy. It’s not you I’m interested in,” she said, looking past Severin so her milky eyes rested on Elle. “Girl, pretty girl, won’t you come stay with granny?” she cooed in a thin, reedy voice before breaking into shrieking laughter. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-50.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
