{"id":83870,"no":59,"title":"Page 59","content":"\u003cp\u003eSeverin smiled, careful not to betray a hint of worry. If Elle knew he was sending her from danger he would have to load her on Fidele, kicking and screaming. “I have my reasons.”\u003c/p\u003e\n\u003cp\u003eElle shook her head. “That isn’t good enough. You place the well being of everyone in this castle before your own. Something is going on.”\u003c/p\u003e\n\u003cp\u003e“You sound paranoid. Nothing unanticipated is happening, I merely desire for you to be free and safe.”\u003c/p\u003e\n\u003cp\u003e“Fine, but I would rather leave tomorrow.”\u003c/p\u003e\n\u003cp\u003e“No, you are leaving today.”\u003c/p\u003e\n\u003cp\u003eElle narrowed her eyes and tucked her head like a mule.\u003c/p\u003e\n\u003cp\u003e“I need you to trust me, Elle. Please, go,” Severin said.\u003c/p\u003e\n\u003cp\u003eElle sighed. “Very well, you win. But I will be back,” she warned, tapping Severin on the chest with a finger.\u003c/p\u003e\n\u003cp\u003eSeverin engulfed her hand with his. “I look forward to it.”\u003c/p\u003e\n\u003cp\u003eElle blushed faintly and looked sideways. “We leave now?”\u003c/p\u003e\n\u003cp\u003e“You are leaving now, yes.”\u003c/p\u003e\n\u003cp\u003e“You’re not coming with?”\u003c/p\u003e\n\u003cp\u003e“I am unable to, but I have arranged for a guide,” Severin said, turning around as Burke hustled the courier from kitchen hallway.\u003c/p\u003e\n\u003cp\u003e“I am to return already? But I arrived not even an hour ago,” the courier complained as he wound a new scarf around his face.\u003c/p\u003e\n\u003cp\u003e“He doesn’t exactly inspire confidence,” Elle said.\u003c/p\u003e\n\u003cp\u003e“I apologize, the palace does not have as high of expectations as I do when it comes to staffing,” Severin said, leading the way outside.\u003c/p\u003e\n\u003cp\u003eThe sun was out, and while the air was chilly there was no breeze. Oliver stood in the courtyard, holding the reins of Fidele and a spare mount.\u003c/p\u003e\n\u003cp\u003eThe courier bowed to Severin before taking the spare horse from Oliver and mounting up.\u003c/p\u003e\n\u003cp\u003e“Wait, I’m riding Fidele?” Elle asked as Oliver tugged her pack of money from her and strapped it to Fidele’s saddle.”\u003c/p\u003e\n\u003cp\u003e“You are. Sit lightly.”\u003c/p\u003e\n\u003cp\u003e“Don’t you dare. Why am I taking Fidele? Much of the snow has melted,” Elle said, backing out of Severin’s reach.\u003c/p\u003e\n\u003cp\u003e“Because Rosemerry would not be able to keep up. In a few days I will send him after you,” Severin said.\u003c/p\u003e\n\u003cp\u003e“No. This doesn’t feel right. You’ll be stranded here if I take Fidele, what if there’s an emergency? You can’t ride any other horse. What aren’t you telling me?”\u003c/p\u003e\n\u003cp\u003e“Elle,” Severin said, halting her tirade. “Please, go.”\u003c/p\u003e\n\u003cp\u003eElle studied Severin, meeting his eyes and facing him down. “Very well.” she said.\u003c/p\u003e\n\u003cp\u003eSeverin opened his arms and Elle walked into them, squeezing Severin in a tight hug. Severin set his chin on top of her head, briefly closing his eyes. Even if she never came back, this was enough. Severin knew Elle cared for him.\u003c/p\u003e\n\u003cp\u003e“Be careful,” Elle said when he released her.\u003c/p\u003e\n\u003cp\u003e“Sit lightly,” Severin advised before lifting Elle onto Fidele’s back.\u003c/p\u003e\n\u003cp\u003e“Emele, Burke, take care. Tell the others I say farewell,” Elle called.\u003c/p\u003e\n\u003cp\u003eEmele nodded—judging by her lack of objection Burke must have filled her in. It was fortunate she hadn’t told Elle.\u003c/p\u003e\n\u003cp\u003eThe courier saluted Severin. “At your orders, Milord.”\u003c/p\u003e\n\u003cp\u003e“Return to Noyers and tell my brother that I understand. Watch out for this girl, Elle. See that she gets all the way to the palace,” Severin said.\u003c/p\u003e\n\u003cp\u003e“Very well, Your Highness,” the courier said before bowing from horseback and starting off.\u003c/p\u003e\n\u003cp\u003eElle and Fidele followed after him. At the edge of the courtyard Elle stopped. “Severin,” she shouted. “I’ll be back. I promise!” she said before cuing Fidele into a trot to catch up.\u003c/p\u003e\n\u003cp\u003eSeverin watched her go, staying outside long after she had disappeared. When he finally went inside he felt a great deal more confident, and the knot of worry loosened.\u003c/p\u003e\n\u003cp\u003eHis servants had assembled in the hall—for once without dramatics or sly antics. They were as serious and staunch as they were the day Severin explained the curse to them.\u003c/p\u003e\n\u003cp\u003e“I have some daunting news,” Severin announced. “Two Rangers intercepted plans for an assassination. My assassination.”\u003c/p\u003e\n\u003cp\u003eSeverin rolled his stiff shoulders, nodding to the soldiers who passed him, marching down the hallway.\u003c/p\u003e\n\u003cp\u003e“Good morning, Sir,” a soldier said, approaching from the other direction.\u003c/p\u003e\n\u003cp\u003eSeverin glanced at the man. “Good morning, Captain Remon.”\u003c/p\u003e\n\u003cp\u003e“I have the newest missive from your brother, Sir,” the soldier said, handing over a letter. “A courier arrived minutes ago with it.”\u003c/p\u003e\n\u003cp\u003eSeverin only glanced at the letter, he saw much of what he was expecting—a complaint in Severin’s failure to send a letter with the returning courier the previous day.\u003c/p\u003e\n\u003cp\u003e“Very good, thank you,” Severin said, briefly skimming the letter before folding it and placing it in his pocket.\u003c/p\u003e\n\u003cp\u003e“Any additional orders, sir?”\u003c/p\u003e\n\u003cp\u003e“Not yet. Was the courier taken to the kitchens?”\u003c/p\u003e\n\u003cp\u003e“He was, Sir.”\u003c/p\u003e\n\u003cp\u003e“Good. I wish for him to make the return trip today, but he may have two hours to recover,” Severin said, glancing outside.\u003c/p\u003e\n\u003cp\u003e“I will see that he is informed of your desires, Sir.”\u003c/p\u003e\n\u003cp\u003e“That is all, Remon. Thank you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-59.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
