{"id":83872,"no":61,"title":"Page 61","content":"\u003cp\u003e“After them,” Elle said, whipping her cloak off.\u003c/p\u003e\n\u003cp\u003eElle’s companions were gone before Elle folded her cloak and tossed it aside—still hefting her crossbow.\u003c/p\u003e\n\u003cp\u003eBeneath the cape she wore the female Ranger uniform: steely blue pauldrons and gauntlets with a matching chest piece that encased her upper body. She wore the designated Ranger boots, black leggings, and a Ranger Blue skirt that matched her armor. The silver patch over her heart was decorated with the insignia of an eagle with an arrow clenched in its beak. The eagle was Lucien’s symbol, the arrow was the signature of an intelligencer Ranger. Together the insignia meant Elle was a decorated éclaireur Ranger, the highest intelligencer rank that could be achieved.\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eThe Intelligencer\u003c/p\u003e\n\u003cp\u003e“Severin, are you hurt? Did they harm you at all?” Elle asked, running to Severin’s side. She held her crossbow in one hand and lifted Severin’s right arm, inspecting it and Severin’s ribcage from all angles before doing the same with the left. “Severin?” she asked when he didn’t reply.\u003c/p\u003e\n\u003cp\u003eShe looked up into his eyes and read the shock there. He had never guessed she was a Ranger.\u003c/p\u003e\n\u003cp\u003e“Elle, how did you get here?” he finally asked. “The road is blocked off.”\u003c/p\u003e\n\u003cp\u003e“I brought my party in through the hunting trail you pointed out on our ride,” Elle said, anxiously circling Severin to look for injuries. “But Severin, did they get you at all? Did they even knick you?”\u003c/p\u003e\n\u003cp\u003eSeverin stared at Elle. “Who are you?”\u003c/p\u003e\n\u003cp\u003e“You know me. I’m Elle, your Intruder,” Elle said, forcing her lips into the mold of a smile.\u003c/p\u003e\n\u003cp\u003eSeverin shook his head. “No, who are you really?”\u003c/p\u003e\n\u003cp\u003eElle reached out and grabbed his hand. “I am Elle. Nothing’s changed Severin. I’m still the demanding busy body who was bit by a squirrel.”\u003c/p\u003e\n\u003cp\u003eIn the woods behind them Prince Lucien’s personal horn sounded. The Prince wouldn’t be far off, and after he arrived all of Elle’s lies would come to light.\u003c/p\u003e\n\u003cp\u003eElle briefly shut her eyes. “This isn’t how I planned it. I was going to wait until our next ride when I came back, but I’ve run out of time.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eElle grabbed Severin by the shoulders, pulling on him until he looked down at her. “Severin, listen very carefully. No matter what you learn about me I want you to know that everything I said about you is true. You are incredible, Severin, please don’t forget everything I’ve said in your anger.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?” Severin said, his voice turning into a growl.\u003c/p\u003e\n\u003cp\u003eThe horn sounded again. It was much closer this time.\u003c/p\u003e\n\u003cp\u003e“I genuinely enjoyed my time here. I wouldn’t trade these last few months for the world. But I’m doing this for your sake, you deserve to be happy.”\u003c/p\u003e\n\u003cp\u003e“Elle?”\u003c/p\u003e\n\u003cp\u003eElle could hear the muffled thunder of horses galloping through snow. She threw her arms around Severin’s neck and whispered, “Severin, I love you.”\u003c/p\u003e\n\u003cp\u003eLight flared, tearing Severin away and throwing Elle to the ground.\u003c/p\u003e\n\u003cp\u003eElle pushed herself to her knees, wincing as Severin howled in pain. “Severin!” she screamed, her hair whipping in the sudden wind.\u003c/p\u003e\n\u003cp\u003eSeverin’s bones snapped and crackled as they rearranged and reformed in his body. His teeth shrank and sank back into his gums as his protruding cat muzzle flattened. His fur retreated to his hairline or fell out entirely—Elle couldn’t tell which in the bright light.\u003c/p\u003e\n\u003cp\u003eSeverin’s claws disappeared, his hands softened, and within moments the beast was gone, leaving behind a man. The man groaned and collapsed in the snow.\u003c/p\u003e\n\u003cp\u003eElle lurched to her feet. “Severin, are you ok?” she asked, crouching next to him.\u003c/p\u003e\n\u003cp\u003eElle held her hand an inch above Severin’s shoulder, wondering if it would hurt him if she touched him.\u003c/p\u003e\n\u003cp\u003eHer worry died when Severin pushed his hair out of his face and sat up, looking to her.\u003c/p\u003e\n\u003cp\u003eElle recognized him from the portrait Emele had shown her in the library. He was older now, taller with broad shoulders. His charcoal black hair spilled over his shoulders, and his eyes were still amber although they had normal, circular pupils. He had wrinkles on his forehead and at the top bridge of his nose—probably from squinting and working late into the night with poor lighting. He had a full lower lip, and a stubborn chin.\u003c/p\u003e\n\u003cp\u003eHe was muscled and athletic from his years as a soldier, and while he did not have the same dazzling good looks as Prince Lucien, he was undeniably aristocratic and handsome, far beyond the likes of Elle.\u003c/p\u003e\n\u003cp\u003eSeverin blinked once, cracking his jaw. He traced his face with his hands before looking at his bare feet. “I’m human?”\u003c/p\u003e\n\u003cp\u003eElle almost cried. His voice was the same, rumbling like distant peals of thunder, although she suspected he would no longer sound so guttural when angry. “Are you hurt?” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-61.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
