{"id":83821,"no":8,"title":"Page 8","content":"\u003cp\u003eLucien paused for a moment as if considering something. He opened his mouth twice before shaking his head. “Peasants,” was all he said in the end.\u003c/p\u003e\n\u003cp\u003e“Is that all for today?” Severin asked, glancing outside the dusty lodge window. It was almost dark, and it was still an hour’s ride home from the lodge.\u003c/p\u003e\n\u003cp\u003eLucien waved his hand dismissively. “Yes, yes. I’ll have your order sent to the chateau. Father and Sylvie send their love, of course. They’re both doing well.”\u003c/p\u003e\n\u003cp\u003e“Your Highness,” Severin said, standing and bowing to his brother in thanks.\u003c/p\u003e\n\u003cp\u003e“Don’t you have any messages you would like me to pass along?” Lucien asked, still lounging in his dusty chair.\u003c/p\u003e\n\u003cp\u003e“Please tell Princess Sylvie I am glad to hear she is in good health.”\u003c/p\u003e\n\u003cp\u003e“And Father?”\u003c/p\u003e\n\u003cp\u003eSeverin blackly eyed his half brother.\u003c/p\u003e\n\u003cp\u003e“Sooner or later you will have to forgive him for fathering you,” Lucien said, folding his arms across his belly as he leaned back in his chair.\u003c/p\u003e\n\u003cp\u003e“No, I don’t,” Severin said, gliding through the lodge in his animal grace before throwing the lodge door open.\u003c/p\u003e\n\u003cp\u003eThe wind gusted inside, scattering a few leaves across the floor before Severin shut the door behind him.\u003c/p\u003e\n\u003cp\u003e“Touchy,” Lucien said.\u003c/p\u003e\n\u003cp\u003eIt was the dead of night, and Elle couldn’t sleep. Her leg throbbed, guilt invaded her thoughts, and the room felt hot and stuffy. She was dying for a breath of fresh air, or for a noise, anything at all to get her mind off the consuming pain that tore at her leg.\u003c/p\u003e\n\u003cp\u003e“I hate monarchies,” Elle said, fluffing her pillow.\u003c/p\u003e\n\u003cp\u003eThere was a noise at the door, and Elle had a table knife in her hand as the door creaked open.\u003c/p\u003e\n\u003cp\u003e“Hello?” Elle asked.\u003c/p\u003e\n\u003cp\u003eNo one entered the room, but something padded across the floor.\u003c/p\u003e\n\u003cp\u003eThere was a snorting sort of panting at the foot of Elle’s bed. Elle propped herself up on her elbows, knife still brandished, but could see nothing.\u003c/p\u003e\n\u003cp\u003eThe snorting-breathing continued with the occasional tug on the bed blankets. Elle was beginning to wonder if the chateau was home to a pack of uncommonly large rats when something catapulted itself on top of the bed.\u003c/p\u003e\n\u003cp\u003eIt was a dog. A small dog with a fluffy tail and fluffy ears. Elle recognized it as a Papillon—a dog favored by the upper class for its dainty beauty—but it was the fattest Papillon she had ever seen. Elle didn’t know a dog could even get that fat.\u003c/p\u003e\n\u003cp\u003eThe dog waddled up the bed, his fringe of fur and fat swinging in the air. He snuffled in the blankets as Elle secured her filched kitchen knife back in her clothes.\u003c/p\u003e\n\u003cp\u003eThe dog made his inspection as high as Elle’s face, thrusting his nose in Elle’s ear. His tail wildly wiggled, and the dog turned in a circle twice before arranging itself next to Elle’s head, its fat forming a cushion.\u003c/p\u003e\n\u003cp\u003eElle hesitated before she reached out to touch the dog, eliciting excited pig-snorts from it. “You’re…endearing,” Elle said, closing an eye when the small dog whipped its tail in her face. When it finally calmed down its deep, snoring breathing formed a beat.\u003c/p\u003e\n\u003cp\u003eThe dog didn’t wake up when the man came through the window. He pried a window open with a knife and wordlessly slid inside, dressed entirely in black.\u003c/p\u003e\n\u003cp\u003e“I apologize for my inactivity, but as you can see I have been detained,” Elle said as he approached her bed. “I assume you have a message for me?”\u003c/p\u003e\n\u003cp\u003e“Your absence will be excused until you are fully healed,” he said.\u003c/p\u003e\n\u003cp\u003eElle blinked slowly. Did she hear that right? “What?”\u003c/p\u003e\n\u003cp\u003e“Your absence will be excused until you are fully healed.”\u003c/p\u003e\n\u003cp\u003e“Elle frowned. “What of my family?”\u003c/p\u003e\n\u003cp\u003e“All of your debts still exist, and you will return for duty, but for now you are excused.”\u003c/p\u003e\n\u003cp\u003e“Did Farand say this?” Elle asked.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eElle stared stupidly at the expensive coverlet while the man walked back to the window. “So what am I supposed to do in the meantime?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Think of it as a holiday,” he suggested. “I will remain on duty. If you should need me, you know the signal,” he said, slipping out of the room.\u003c/p\u003e\n\u003cp\u003eElle leaned back in her bed. “A holiday,” she dumbly repeated before a brilliant smile leaked across her lips. “Why not? I haven’t been on one in ages.”\u003c/p\u003e\n\u003cp\u003eChapter 3\u003c/p\u003e\n\u003cp\u003eFree to Walk\u003c/p\u003e\n\u003cp\u003eWhen Bernadine came for another visit the following week Elle was sitting in bed, receiving visitors like a queen. A tall, impossibly thin woman who closely resembled a heron followed in Bernadine’s wake, an unpleasant frown twisted on her lips.\u003c/p\u003e\n\u003cp\u003e“Bernadine, how good to see you again,” Elle said, fanning herself with a lace fan Emele had given her for no reason apparent to Elle. “Tell me, who have you brought with you? I’m dying for company you know.”\u003c/p\u003e\n\u003cp\u003eIf Bernadine or Emele noticed Elle’s mastery of language increased significantly overnight they said nothing.\u003c/p\u003e\n\u003cp\u003e“Your name is…Heloise,” Elle said, reading Emele’s slate when the ladies maid held it up.\u003c/p\u003e\n\u003cp\u003eHeloise nodded with a stork-like snap of her head and loomed over Elle. She grasped Elle’s chin and waggled her head back and forth, inspecting Elle with narrowed eyes. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-and-the-beast-timeless-fairy-tales-1/page-8.html","bookId":1808,"creation":"Oct 5, 2019 4:55:06 PM","modification":"Oct 5, 2019 4:55:06 PM"}
