{"id":100494,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI was conscious of the wind blowing at my back as he pulled his hood down and looked up at me. “I’m sorry for catching you here like this,” he began. “I know it looks bad.”\u003c/p\u003e\n\u003cp\u003eRandom weres surprising me at my car? Yeah. I made a face as he went on. “Helen’s distraught, and Jorgen is only bitten—he can’t scent his own piss unless it’s by the light of the moon. But I knew this was your car, and that you’d come out eventually.”\u003c/p\u003e\n\u003cp\u003e“You’ve been standing here all night?”\u003c/p\u003e\n\u003cp\u003e“For the last four or so hours.”\u003c/p\u003e\n\u003cp\u003eIt was easier to see him out here in the daylight, not the fluorescent lighting of Y4’s halls—maybe I because I found it easier to breathe, surrounded by so much more space. He would be a few inches taller than me when standing, with short wavy brown hair. He had a strong nose that had been broken before—what did it say about him that he hadn’t used his ability to change into a wolf to heal it?—and he was lean. He looked a little like one of my brother’s junkie friends: not the addicted part, but hungry, haunted.\u003c/p\u003e\n\u003cp\u003eHe pushed himself off my car. “How is he?”\u003c/p\u003e\n\u003cp\u003eIt wasn’t that I was bad at lying, although I was. It was that I hated doing it. I looked down at the slushy ground. “I’m afraid I don’t know what you’re talking about.”\u003c/p\u003e\n\u003cp\u003e“I just want to know if he’s okay. That’s it. It’s Christmas. He’s my uncle.”\u003c/p\u003e\n\u003cp\u003eHis grief and worry seemed earnest, plus the standing outside for five hours in December—but it didn’t matter. There was nothing I could say. Hospital rules and privacy laws prevented it. There was no way to know if this man—werewolf, I corrected—didn’t have some part in Winter’s state. Sure, he felt genuine, but I’d been conned before. Recently, even. I turned my attention to my purse and pulled my keys out, then walked to my car door.\u003c/p\u003e\n\u003cp\u003eHe didn’t move. I was close enough to feel how warm he was as I unlocked my door, his excess heat bleeding through his cotton coat. I could see the melt line on my windshield that a few hours of his body’s warmth had de-iced for me.\u003c/p\u003e\n\u003cp\u003e“Is it really going to be like this?” His eyes searched me for answers, lips pressed thin, as I got inside my car.\u003c/p\u003e\n\u003cp\u003e“For right now, I’m afraid so.” Ignoring him, I closed my car’s door. He stepped aside.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWELVE\u003c/p\u003e\n\u003cp\u003eThe look in his eyes haunted me all the way home. If someone I loved, say my mom or my brother, was alone in the hospital, and I wasn’t allowed to see them—but no. I’d done the right thing, and more important I’d done the legally correct thing, which was crucial for someone who wanted to keep her job.\u003c/p\u003e\n\u003cp\u003eI lost more theoretical sleep that morning hauling my new couch cover onto my couch. The directions were in Chinese, and Grandfather offered a few comments in German; both were equally unhelpful. Then I went back to my bedroom, switched into my flannel pajamas, and snuggled under the electric blanket. I didn’t set my alarm—I figured my family could wake me up when they got there, and if they were late for some reason, then I’d be lucky enough to have slept in.\u003c/p\u003e\n\u003cp\u003eI was fast asleep until the doorbell rang.\u003c/p\u003e\n\u003cp\u003e“Oh, man.” I looked at my alarm clock. Ten thirty A.M. A full half hour earlier than I’d expected them. Unfair.\u003c/p\u003e\n\u003cp\u003eI lurched out of bed and made it to the hallway. Usually I’d brush my teeth first, but it was cold outside, and I’d brushed them before going to bed, oh, two hours before. I looked out the peephole and saw Jake standing there, waddling back and forth like a penguin.\u003c/p\u003e\n\u003cp\u003e“What’s the password?” I yelled through the door, just like we used to do when we were kids.\u003c/p\u003e\n\u003cp\u003e“It’s fucking cold is the password.” He stuck his tongue out at the peephole.\u003c/p\u003e\n\u003cp\u003e“Hey, don’t lick the door, you’ll get stuck.” I opened it with a grin. “Come on in.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” He came in and stamped around in my hallway. Every time I saw him he looked cleaner than the time before. Admittedly, today he was helped by the slightly newer coat he was wearing since the last time I’d seen him—it made him look more filled out, possibly a trick of the extra down.\u003c/p\u003e\n\u003cp\u003e“That’s a nice coat.”\u003c/p\u003e\n\u003cp\u003e“It’s a gift from some kind soul.”\u003c/p\u003e\n\u003cp\u003eI listened for the irony in his voice, or ruefulness, but didn’t hear it. Maybe he was happy living on someone else’s hand-me-downs. I’d gotten him some sweaters and new gloves. What else did you give a homeless person? I’d given him a couch to sleep on often enough.\u003c/p\u003e\n\u003cp\u003e“I thought Mom and Peter would be here already?” He took off his coat and put it in my hall closet.\u003c/p\u003e\n\u003cp\u003e“They said eleven.” I went to the thermostat and turned the heat up. “How’s things?”\u003c/p\u003e\n\u003cp\u003e“The usual.” He sat down on my couch, and picked at the couch cover. “It’s better than the bloodstains.”\u003c/p\u003e\n\u003cp\u003e“About that—” I walked into my kitchen to preheat the oven—the faster we could get Xmas over with, the better for me, sleepwise. “They don’t need to know, okay?”\u003c/p\u003e\n\u003cp\u003eI saw a familiar light in his eyes. “What’s it worth to you?”\u003c/p\u003e\n\u003cp\u003eOh, had we played this game before. I gestured to the empty space where my dining room set had once been. “Me not telling Mom where my table and six chairs went.”\u003c/p\u003e\n\u003cp\u003eJake rocked back into the couch. “Deal.”\u003c/p\u003e\n\u003cp\u003eI frowned. I shouldn’t have to make deals with him. Or apologize to anyone about anything. But he’d seen me a bit ragged lately, and while I didn’t owe him or anyone else answers, I didn’t want this dinner to degrade into a he-said, she-said meal. We’d had enough of those in our past already.\u003c/p\u003e\n\u003cp\u003eThere was a knock at the door. “I’ll get it.” Jake stood, and I went to go put on Christmas-morning-appropriate clothing that wasn’t footie pajamas.\u003c/p\u003e\n\u003cp\u003e“Jakey!” I heard my mom crow from my bedroom. “Where’s Edie?”\u003c/p\u003e\n\u003cp\u003e“Getting dressed—”\u003c/p\u003e\n\u003cp\u003e“Go help Peter, will you?”\u003c/p\u003e\n\u003cp\u003eI heard her coming down the hall, and of course she didn’t knock. Doors were foreign concepts for my mother, which was perhaps why Jake and I played the password game, to prove that boundaries existed. She blustered into my room. “Edie!”\u003c/p\u003e\n\u003cp\u003e“Hey, Mom.” My mother, Shelly-Rae Spence (now Grinder), was shorter than me and much more petite. She’d called me strapping, growing up—not because I actually was, but because I was compared with her. She’d meant it as a joke, but I’d been an emo teenager and always felt self-conscious about being a moose to her deer.\u003c/p\u003e\n\u003cp\u003e“Merry Christmas!” she said, arms flung wide. I barely made it into my shirt before she hugged me. I hugged her awkwardly back.\u003c/p\u003e\n\u003cp\u003e“Merry Christmas. I preheated the oven.”\u003c/p\u003e\n\u003cp\u003e“Always thinking ahead! That’s why you’re my favorite!” she told me. Jake and I were always her favorite, often within earshot of each other. “Peter, put the turkey in!” she yelled back down my short hall. “We precooked it this morning, before we bought it over,” she confessed to me in a quieter tone.\u003c/p\u003e\n\u003cp\u003e“Thanks, Mom.”\u003c/p\u003e\n\u003cp\u003eShe patted my arm. “I know how you like to sleep.”\u003c/p\u003e\n\u003cp\u003eI inhaled to defend myself, but she left the room before I could. It wasn’t that I liked to sleep so much as the fact that I’d gotten off work two freaking hours before. But my mother and I had had this conversation on multiple occasions, usually when she called me sometime during the day before three P.M. or from other time zones.\u003c/p\u003e\n\u003cp\u003eI counted to ten backward, then followed her back out.\u003c/p\u003e\n\u003cp\u003eJake was wrestling with the card table my mother had brought in, while Peter was in the kitchen. I didn’t think I’d ever had this many people in my tiny apartment simultaneously before.\u003c/p\u003e\n\u003cp\u003e“It’s a shame about your dining room set, Edie.” She was unfolding chairs and setting them in front of the couch.\u003c/p\u003e\n\u003cp\u003ePeter pointed out at me with a potato-covered spoon. “Did you look on the Internet? Was that glass breaking some sort of manufacturing flaw?”\u003c/p\u003e\n\u003cp\u003e“Uh—I didn’t even think of that, to be honest.”\u003c/p\u003e\n\u003cp\u003e“Well, at the very least you should write a letter.”\u003c/p\u003e\n\u003cp\u003ePeter, my stepfather, was the letter-writing type. He was the type who, when the waiter asked how the meal was, was always honest instead of kind, like he thought the cooks behind the counter actually cared if his burger was a little dry. If you ever asked him if your ass was fat, it usually was. He wasn’t mean—he’d just missed out on some sort of filtering apparatus that most of the people who were more socially greased for life came with. Seeing as my biological father’s social lubricant had been alcohol, I supposed I should be pleased.\u003c/p\u003e\n\u003cp\u003eI looked over at Jake—he of the original table’s mishaps—who chose that moment to look away. “I’ll think about writing a letter.”\u003c/p\u003e\n\u003cp\u003e“Do.” Peter smiled and nodded. He swept my counter contents aside to get to a plug, and there was the sound of potatoes being whipped.\u003c/p\u003e\n\u003cp\u003eMy mother suggested we open gifts while things were reheating. I’d gotten her the usual, a sweater and a bottle of her favorite perfume. My brother earned socks and a new backpack from Peter. I could see the mild disappointment behind his smile. Nothing said New on the streets like nice things. He’d have to rough it up some, or trade it in for something else. Peter didn’t have any idea what it was like to be mostly homeless, and I didn’t really either, except what I’d gathered from watching my brother and County’s clientele.\u003c/p\u003e\n\u003cp\u003ePeter gave me a belt with a huge abstractly shaped silver buckle. “It’s sure to be fashionable soon,” my mom said, patting my arm as I lifted it out of the box. I spotted a gift receipt below and grinned. Returned soon was more like it.\u003c/p\u003e\n\u003cp\u003eMy mother saved her gift for last. It was big and fluffy in that way that was always disappointing as a kid: a pillow from your least favorite grandmother, or a stuffed animal from your aunt. I ripped into the wrapping paper with trepidation and found—a lovely new winter coat. It was teal with large gold buttons. \u003c/p\u003e","sourceLink":"https://allnovel.net/moonshifted-edie-spence-2/page-10.html","bookId":2619,"creation":"Oct 5, 2019 6:54:07 PM","modification":"Oct 5, 2019 6:54:07 PM"}
