{"id":100498,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Are you in any pain?”\u003c/p\u003e\n\u003cp\u003eJavier flicked dark eyes toward me, then back at the ceiling. “No. Never.”\u003c/p\u003e\n\u003cp\u003eThe woman standing beside him nodded and resumed petting him. His mom kept sobbing, wordless sounds.\u003c/p\u003e\n\u003cp\u003e“Is there anything I can do for you?” I asked him, then included the room at large.\u003c/p\u003e\n\u003cp\u003e“Café,” said the not-crying woman. She was definitely the girlfriend. I knew from the way I saw her look at him now.\u003c/p\u003e\n\u003cp\u003e“Certainly,” I said, and retreated out the door.\u003c/p\u003e\n\u003cp\u003eI walked down the row of other rooms on the trauma floor. None of them had happy people inside. That, multiplied by the time of year, made everything particularly grim. I went to the room labeled NUTRITION, like it was from Star Trek, and made an instant coffee. While I was loading up an extra Styrofoam cup with powdered creamer and sugar, the overhead intercom announced that visiting hours were over for the night.\u003c/p\u003e\n\u003cp\u003eThe charge nurse called to me as I passed her desk on my way back. “Hey, float. Send all those people home.”\u003c/p\u003e\n\u003cp\u003eIt took me a second to realize who she meant. “All of them? Can’t someone stay?”\u003c/p\u003e\n\u003cp\u003e“We don’t allow that here.”\u003c/p\u003e\n\u003cp\u003eI frowned at her. She didn’t look up to see it. “He can feel things now but by tomorrow morning, he’ll be insensate,” I said.\u003c/p\u003e\n\u003cp\u003e“So?”\u003c/p\u003e\n\u003cp\u003eSeen it all, done it all, are you stupid? I tried another tack. “It’s Christmas.”\u003c/p\u003e\n\u003cp\u003e“Only till midnight. Then it’s December twenty-sixth.”\u003c/p\u003e\n\u003cp\u003e“So someone can stay till midnight?” I asked, trying to work in some innocence and charm. I really didn’t want to be the bad guy. Not this time.\u003c/p\u003e\n\u003cp\u003eShe stopped typing and turned toward me. “One person. And that person better have a ride home, we’re out of bus passes.”\u003c/p\u003e\n\u003cp\u003eI’d take what I could get. “Okay. Thanks.”\u003c/p\u003e\n\u003cp\u003eShe went back to typing on her computer, without response.\u003c/p\u003e\n\u003cp\u003eI slunk back to Javier’s room with the good-bad news. “I got permission for one of you all to stay till midnight.” I hated myself a little for hoping the designated visitor didn’t wind up being his mom.\u003c/p\u003e\n\u003cp\u003e“Luz,” Javier said, in a whisper. I was sure who he meant.\u003c/p\u003e\n\u003cp\u003eJavier’s mother started crying again, and blotting at her face—at this rate, the other eyebrow didn’t stand a chance. I stood outside the room while they said their good-byes. They hugged him. It would be the last time he was able to feel it. There was a knot at the back of my throat, and all the swallowing in the world couldn’t get it to go away. I felt like I was spying, so I opened up my chart and tried to disappear.\u003c/p\u003e\n\u003cp\u003e“Pretty girl. Pity she’s with him,” said a person standing next to me. I startled and looked up.\u003c/p\u003e\n\u003cp\u003eSike stood beside me. Sike was a Rose Throne daytimer, and while Anna trusted her, I did not.\u003c/p\u003e\n\u003cp\u003eIn her day job, Sike was a model and as such professionally gorgeous, but right now she wore little makeup and her red hair was pulled into a high bun. A dour lab coat covered her slender frame’s soft curves. The name VERONICA LAMBRIDGE was embroidered on the pocket over the words LABORATORY TECHNICIAN. I knew Sike was neither Veronica, nor a lab tech. She patted the white lapel. “Fits nice, doesn’t it?”\u003c/p\u003e\n\u003cp\u003eI looked around at the floor. “You should have called.”\u003c/p\u003e\n\u003cp\u003e“Oh, I’m not here for you.” Sike smiled at me, and her face didn’t match her tone. “Let’s not be an idiot in public. I’m just your friend from the lab.”\u003c/p\u003e\n\u003cp\u003e“Lab workers and nurses don’t fraternize.” I hoped that “Veronica” was merely off duty and not stuffed into a trunk. “If you’re not helping me, then why are you here?”\u003c/p\u003e\n\u003cp\u003e“I need you to take me to Y4.” She put her hand on my arm just as Javier’s parents walked out, the father propelling the mother around my desk and toward the doors. We were both quiet until they passed.\u003c/p\u003e\n\u003cp\u003e“I can’t leave till my break,” I whispered.\u003c/p\u003e\n\u003cp\u003e“When’s that?”\u003c/p\u003e\n\u003cp\u003e“Nine. You’ve got an hour to kill.”\u003c/p\u003e\n\u003cp\u003eIt was obvious from her bearing that this was untenable. But there was no way she could drag me off in front of so many people without causing a scene. She wasn’t a full vampire, just a daytimer, she didn’t have look-away yet. She let go of my arm.\u003c/p\u003e\n\u003cp\u003e“Just go yourself,” I said, massaging blood back into my tricep.\u003c/p\u003e\n\u003cp\u003e“I can’t. The elevator doors won’t open for me.”\u003c/p\u003e\n\u003cp\u003eI pretended to read Javier’s chart. “Has that ever happened before?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eWell. Saying that was not good was probably an understatement. “There’s a lobby behind those doors. Go wait by the fish tank.” She looked down at me, full lips pursed in frustration. “I’ll come as soon as I can,” I added.\u003c/p\u003e\n\u003cp\u003e“You’d better.”\u003c/p\u003e\n\u003cp\u003eIf it wasn’t one vampire, it was another … in a manner of speaking. I waited until I was sure she was gone, then went into Javier’s room for his hourly feeling check.\u003c/p\u003e\n\u003cp\u003e“Can you feel this?” I poked the cap of my pen against the side of his ribs.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“This?” I asked, trying higher.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eI looked up at his face and saw his jaw clench, between answers.\u003c/p\u003e\n\u003cp\u003e“This?”\u003c/p\u003e\n\u003cp\u003e“Sí.”\u003c/p\u003e\n\u003cp\u003eI marked it. Another half a centimeter of feeling, gone. It was like he was slowly drowning, no way to turn around, walking farther and farther out into an inexorable sea.\u003c/p\u003e\n\u003cp\u003e“Is there anything—” I began, because I had to.\u003c/p\u003e\n\u003cp\u003e“Just go,” his girlfriend said, then added, “Please.”\u003c/p\u003e\n\u003cp\u003eI nodded, and did so.\u003c/p\u003e\n\u003cp\u003eI noted his new loss of feeling in his chart. The charge nurse came by, I thought to break me early, but she handed me a printout from a news website instead. Two Injured in Drug Deal Gone Bad, said the headline, and beneath it, One died en route, and one went to County, in critical condition. I folded it in half, and stuck it under the chart, realizing how easily their problems could have been Jake’s. Thank God that at his worst, he was always a user, not a dealer, at least not that I knew. Okay, so maybe I did look at our shared cell phone bill some—but only to see if he’d been dumb enough to use it to make too many calls to strange numbers.\u003c/p\u003e\n\u003cp\u003eAn hour is a long time, sitting outside of someone’s room. On Y4, I could have made myself useful, restocking things, making bedrolls, reading charts, but here I didn’t know the flow, and didn’t want to get in anyone’s way. I doodled some in the margin of my non-official report sheet, sketching a flaming heart. When I heard a strange beep from inside the room, I looked up. Luz was texting on her phone, and she walked toward the door.\u003c/p\u003e\n\u003cp\u003e“I have to answer this.”\u003c/p\u003e\n\u003cp\u003e“Just pull the curtain. You can talk in the room.” There were NO CELL PHONE signs up all over, but nurses and doctors talked on them all the time—I hadn’t seen an iPhone make anyone’s pacemaker give out yet.\u003c/p\u003e\n\u003cp\u003e“No. I have to go.”\u003c/p\u003e\n\u003cp\u003eI stood in her way. My break was starting in fifteen minutes. Sike needed me, for some likely unpleasant reason, and I needed Sike for some guidance. But if Luz left now and there was a break relief nurse sitting out here when she tried to come back who wasn’t a softie like me, chances were she wouldn’t get to come back at all.\u003c/p\u003e\n\u003cp\u003eShe must have read my thoughts on my face. “You know what it’s like to have obligations?” she said, the last word like it was an anchor.\u003c/p\u003e\n\u003cp\u003eI inhaled and exhaled. “I do. You wouldn’t know it to look at me, but I do.”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Then you understand. I’ll be back.” She chugged the last of her coffee, and walked out.\u003c/p\u003e\n\u003cp\u003eI spent five minutes leaning on the doorjamb. Javier couldn’t see me from the bed. He was my only patient, which was something of a miracle for a trauma float shift. He shouldn’t be alone, and I didn’t have any honest excuses to leave. I took Luz’s spot by the head of the bed, hauling up a chair.\u003c/p\u003e\n\u003cp\u003e“Anything you want to talk about?” I asked him.\u003c/p\u003e\n\u003cp\u003e“Not with you.” A pause. “Nothing personal.”\u003c/p\u003e\n\u003cp\u003eThere was a fine line between joyriding someone else’s pain, and trying to maintain an open channel of communication. Even I wasn’t always sure which side of it I was on. But I sat there to show I cared, just in case it mattered to him.\u003c/p\u003e\n\u003cp\u003eThe second hand clicked away. Sike would come looking for me soon. I hoped she stayed tactful, or her definition thereof.\u003c/p\u003e\n\u003cp\u003eI could use this time here to read the article the charge nurse had given me. Would it change anything, knowing who else had gotten hurt, or why they’d died? Not really. I had a job to do here, no matter the circumstances beyond. But sometimes I did wonder where that job ended. Did I ever really throw my scrubs into the linen cart and get to just go home?\u003c/p\u003e\n\u003cp\u003eI hunched over and set my elbows on my knees, deep in thought, as Javier dozed beside me.\u003c/p\u003e\n\u003cp\u003eLuz’s return startled us both. She eyed me with suspicion as she entered the room, coming to stand by my side.\u003c/p\u003e\n\u003cp\u003e“Did anything change?” she asked.\u003c/p\u003e\n\u003cp\u003e“No. I’m afraid whatever they already told you still stands.” I looked up slowly and realized she was shaking. “Are you all right?”\u003c/p\u003e\n\u003cp\u003e“I’m fine,” she said.\u003c/p\u003e\n\u003cp\u003eI wondered if she was in denial, or if she was so used to being strong that she couldn’t stop, not even now.\u003c/p\u003e\n\u003cp\u003e“Tomorrow, he won’t be able to feel me?” she asked. I nodded.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry.” I couldn’t even begin to comprehend her loss. Her anger was so palpable, so strong, it was like I could feel her very atoms vibrating—if pushed wrong, there was a chance she might fly apart.\u003c/p\u003e\n\u003cp\u003e“It’s not fair,” she said.\u003c/p\u003e\n\u003cp\u003e“No, it isn’t,” I agreed, because she was right. I turned to walk out of the room.\u003c/p\u003e\n\u003cp\u003eI made it three steps before she caught my arm and pulled me back, toward the half of the room hidden by curtains, and I let her.\u003c/p\u003e\n\u003cp\u003e“What do you think will happen if I give him these?” she asked in a whisper, holding out her other hand. She held four small glass vials, with a clear fluid inside. \u003c/p\u003e","sourceLink":"https://allnovel.net/moonshifted-edie-spence-2/page-14.html","bookId":2619,"creation":"Oct 5, 2019 6:54:07 PM","modification":"Oct 5, 2019 6:54:07 PM"}
