{"id":100501,"no":17,"title":"Page 17","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“This is the latest MRI from this morning.” Meaty flipped open a folder on the table, revealing a brain scan. I didn’t need to be a neurologist to know that it wasn’t right. A huge white spot took up space where normal brain matter should be. “After the accident and bleed, there’s no room in his skull for anybody to be left home inside there. But not everyone in the family is ready to hear that. Got it?”\u003c/p\u003e\n\u003cp\u003e“Guards at the door. Shaky DNR, bad bleed. Got it,” I said.\u003c/p\u003e\n\u003cp\u003eGina put her hand out, like we were in a high school football huddle. “One two three, don’t get mauled. Goooo team!”\u003c/p\u003e\n\u003cp\u003eI could get behind that. I put my hand on top of hers, and we pounded them together onto the table.\u003c/p\u003e\n\u003cp\u003eCHAPTER NINETEEN\u003c/p\u003e\n\u003cp\u003eI gathered supplies for any and all assorted tasks we’d have to do tonight while Gina got report. Pleths, dressing change kits, biopatches, line labels, one of everything, putting them into a pillowcase like a demented Santa. Less running around if things went bad—and with all these extra supplies, I’d be better able to exploit any opportunity I had to get some blood.\u003c/p\u003e\n\u003cp\u003eI realized I should have felt bad about it, or at the very least torn—but were-problems were not my problems. Jake and Dren were. Besides, how much harm could one drop of blood really do?\u003c/p\u003e\n\u003cp\u003eAs I rounded the floor, I spotted something near Winter’s door, in addition to the nurses exchanging report outside. A small black wolf curled up in the doorway, tail-to-nose. It had a puppy look about it, with too-big feet, too-fuzzy fur, and copper-yellow eyes. Beside it, taped to the wall, was a handwritten note that said, My mom said I could spend the night.\u003c/p\u003e\n\u003cp\u003e“Oh, my God, it’s a wolf puppy!” Its eyes opened up and focused on me.\u003c/p\u003e\n\u003cp\u003e“It’s a wolf person,” Lynn corrected me. She and Gina finished their chart checks, and the P.M. shift nurses exited the floor.\u003c/p\u003e\n\u003cp\u003eI waited until they left and set down my supply bag. I crouched down to see it better, without touching. “It’s the cutest thing ever, Gina.”\u003c/p\u003e\n\u003cp\u003e“The cutest thing that can bite your face off.” She looked down at the small wolf. “No offense.”\u003c/p\u003e\n\u003cp\u003eThe wolf closed its eyes again. Gina had enough experience to treat the wolf like a person. I didn’t. I’d have to get over that. But the cute was making it hard. I looked over to Gina and opened my mouth.\u003c/p\u003e\n\u003cp\u003e“Don’t ask to pet it. That’s rude,” she said, without looking up from Winter’s flowsheet.\u003c/p\u003e\n\u003cp\u003e“Damn you and your telepathy.”\u003c/p\u003e\n\u003cp\u003eGina made a face at me. “Get ready to go in.”\u003c/p\u003e\n\u003cp\u003eWe suited up. I felt weird having a wolf puppy watch me from the doorway while I kept a rifle with tranquilizer darts aimed at its relative inside. Now that it was standing, I could tell that it was a little taller than knee height.\u003c/p\u003e\n\u003cp\u003e“How’s things?” I asked Gina while the wolf’s ears tracked us both.\u003c/p\u003e\n\u003cp\u003eGina didn’t answer, but she gave me a thumbs-down, hidden from the wolf’s line of sight.\u003c/p\u003e\n\u003cp\u003eI walked closer to the pumps—I could see we’d gone up on his blood pressure medications—and that a new one had been added, because the old ones weren’t working well enough. His sedation was much lighter too.\u003c/p\u003e\n\u003cp\u003e“Mr. Winter, can you hear me?” Gina said loudly, right to the side of the bed. She shook him a bit, then did a sternal rub, checking for response to pain. He didn’t move. “Mr. Winter?” She looked to me, gave a half shrug, and went on with her assessment. The wolf in the doorway watched with intelligent eyes, sitting on its haunches. I wanted to talk to it, and bit my tongue. Having a wolf out here was a brilliant ploy. We—or at least I—would say all sorts of things in front of it, treating it like a pet or an animal, not a person. And wolves were probably better at reading people—I was sure it’d known from Gina’s stance how poorly Winter was doing, even before she’d said anything. A relative might rationalize away a nurse’s actions, desperate for good news, but a wolf would know better, I figured.\u003c/p\u003e\n\u003cp\u003e“Junior! What are you doing here?”\u003c/p\u003e\n\u003cp\u003eThe hoodie-wearing were whom I’d already met twice today rounded the corner, looking sternly at the wolf puppy. The puppy startled up to all fours, seemed excited for a second, then tucked head and tail down at his approach.\u003c/p\u003e\n\u003cp\u003e“Did your mother say you could stay like this?” he asked.\u003c/p\u003e\n\u003cp\u003eThe wolf puppy looked to the note, taped on the door.\u003c/p\u003e\n\u003cp\u003e“I am calling her to come get you.” The puppy made a whining sound. “You’re not in trouble. She should know better.” He stepped away to make his call.\u003c/p\u003e\n\u003cp\u003eThe wolf looked to Gina and me. Gina shrugged. “Sorry, kid.”\u003c/p\u003e\n\u003cp\u003eHe came back around the corner. “Your mother’s on her way. Do you have any clothing to wear?” The wolf lowered its head. “Well, hopefully she’ll remember.”\u003c/p\u003e\n\u003cp\u003e“We have scrubs,” Gina offered.\u003c/p\u003e\n\u003cp\u003e“Can you take him and go get some?”\u003c/p\u003e\n\u003cp\u003eGina looked from me, to Winter, inside the room. “Sure. Edie, stay here.”\u003c/p\u003e\n\u003cp\u003e“Aye-aye, Cap’n.”\u003c/p\u003e\n\u003cp\u003eGina left the hall, the wolf pup padding beside her. Now would have been a perfect blood-getting chance, only the other were was still out here, in the way. He sat down in Gina’s vacant chair and set his elbows on his knees. “I guess you know I know he’s here now, right?”\u003c/p\u003e\n\u003cp\u003eI gave him a weak smile. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“I’m Lucas.” He put his hand out, and I shook it.\u003c/p\u003e\n\u003cp\u003e“I’m Edie.” I wanted to look through things and do some work, but I didn’t want to do anything wrong in front of him. Visitor-guards made me self-conscious. “Are you going to be here all night? Guarding him?”\u003c/p\u003e\n\u003cp\u003eHe half smiled. “Is that what they’re calling it? We call it a vigil.”\u003c/p\u003e\n\u003cp\u003e“Ahh. Sorry.” There was silence filled by the hissing of pumps, the inflation and deflation of the sequential compression device on his one good leg.\u003c/p\u003e\n\u003cp\u003e“Do you think he’ll get better?” Lucas asked, after a time.\u003c/p\u003e\n\u003cp\u003eI inhaled, then paused before speaking. Breaking people into bad news was a process, like drawing a new swimmer out into the deep end of the pool. Sometimes people had to be confronted with it repeatedly before it sank in.\u003c/p\u003e\n\u003cp\u003e“Your silence says it all.” Lucas snorted.\u003c/p\u003e\n\u003cp\u003e“I’m not a vet,” I explained. “I’m only a nurse.”\u003c/p\u003e\n\u003cp\u003e“He’s a man now, not a wolf.”\u003c/p\u003e\n\u003cp\u003e“I think what will happen soon is you all will have to decide what kind of life he wanted for himself—and what kind you all want for him now,” I said, choosing my words carefully, showing him the deep end.\u003c/p\u003e\n\u003cp\u003eLucas stared into the room. “How tactful of you.”\u003c/p\u003e\n\u003cp\u003e“Sorry.”\u003c/p\u003e\n\u003cp\u003e“Don’t be.” Lucas inhaled and exhaled deeply, as if waking himself from a dream. “He just needs to make it to the full moon. And the moon needs to heal him. It has to.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eLucas made a face I couldn’t completely read. “His pack needs him.”\u003c/p\u003e\n\u003cp\u003eI would have asked more questions, only Gina came back around the corner with a barefoot boy in tow. “Here we go.” The boy was in extra-small scrubs; the sleeves hung down low, and Gina’d had to cuff the legs. The boy had bone-straight black hair with uneven bangs. The copper-yellow eyes that had looked fine on the wolf were now out of place—downright creepy. He seemed timid, hiding behind Gina’s leg. “Edie, meet Fenris Jr. Fenris Jr, meet Edie.”\u003c/p\u003e\n\u003cp\u003e“Hi, Edie,” Junior said, then to Lucas, “Was Mommy mad?”\u003c/p\u003e\n\u003cp\u003e“Not at you.” Lucas stood up and pointed to the chair. Junior sat down in it, and Lucas wheeled him away, so he couldn’t see in the door. “Let’s see if we can find another one of these. I bet they won’t mind if we run some chair races in that hall outside.”\u003c/p\u003e\n\u003cp\u003eFenris Jr.’s face brightened at this. Lucas was driving him off in Gina’s chair when Jorgen came around the bend. He eyed us and Lucas darkly.\u003c/p\u003e\n\u003cp\u003e“What’s the meaning of this? I just got a call from Helen.”\u003c/p\u003e\n\u003cp\u003e“You left Junior here, alone.”\u003c/p\u003e\n\u003cp\u003e“I had some phone calls I needed to make in private. He was only alone for a bit.”\u003c/p\u003e\n\u003cp\u003e“It’s not that he was alone—it’s that he was here at all. Even as a wolf, he’s too young for this, Jorgen.”\u003c/p\u003e\n\u003cp\u003e“He’s his mother’s child,” he said. Lucas’s lips straightened into a line.\u003c/p\u003e\n\u003cp\u003eGina cleared her throat to get their attention. “We strongly discourage child visitors.”\u003c/p\u003e\n\u003cp\u003eThe bald man glanced at her, then back to Lucas. “We need to transfer Winter to a better facility. He’s not getting the best care here.”\u003c/p\u003e\n\u003cp\u003eI blinked. That was the first I’d heard of it. And to think, I hadn’t even bled him yet. Beside me, Gina stiffened in anger. Lucas stood straighter, letting go of Junior’s chair.\u003c/p\u003e\n\u003cp\u003eAs if by magic, Meaty came around the corner to join us. “Is there a problem?”\u003c/p\u003e\n\u003cp\u003eJorgen looked from one to the other of us. “She consorts with were-bears, and she’s employed by vampires. Neither of them is acceptable. They both should be replaced.”\u003c/p\u003e\n\u003cp\u003eMeaty appeared unfazed. “I would let either one of them care for me, myself.”\u003c/p\u003e\n\u003cp\u003e“You have poor taste then.”\u003c/p\u003e\n\u003cp\u003e“Jorgen, you forget your place,” Lucas said. “I know your loyalty to my uncle runs deep, but now is not the time.”\u003c/p\u003e\n\u003cp\u003eJorgen looked at Lucas, and I remembered what Lucas had said that morning, leaning on my car, about bitten versus born. God, that seemed a long time ago. Jorgen looked like he was going to take a step nearer Lucas, then exhaled roughly, deflating.\u003c/p\u003e\n\u003cp\u003e“This nurse was one of the ones who found him. She saw the accident herself,” Meaty continued, as if nothing had gone on. “She’s been involved in his care since he first came here, isn’t that right?”\u003c/p\u003e\n\u003cp\u003eI nodded, because I knew Meaty expected it of me.\u003c/p\u003e\n\u003cp\u003e“Nurses found him?” Jorgen asked.\u003c/p\u003e\n\u003cp\u003e“Why do you think he’s still alive?” Meaty said.\u003c/p\u003e\n\u003cp\u003e“Did you see who hit him?” Junior asked. \u003c/p\u003e","sourceLink":"https://allnovel.net/moonshifted-edie-spence-2/page-17.html","bookId":2619,"creation":"Oct 5, 2019 6:54:07 PM","modification":"Oct 5, 2019 6:54:07 PM"}
