{"id":100502,"no":18,"title":"Page 18","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“No,” I said to the boy. “I just saw the truck. I gave a report to the police at the time.”\u003c/p\u003e\n\u003cp\u003e“They need to get back to work, Jorgen. Take Junior upstairs to wait for Helen.” Lucas nudged the boy to Jorgen’s side.\u003c/p\u003e\n\u003cp\u003eJorgen was still eyeing daggers at us, but I got the sense that he couldn’t disobey a direct command.\u003c/p\u003e\n\u003cp\u003eJunior peeked into Winter’s room one last time. “Bye, Grandpa Winter,” and then he looked up and to us. “Bye, Gina, bye, Edie. Sorry you didn’t get to pet me.”\u003c/p\u003e\n\u003cp\u003eI gave him a smile. “Me too.”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY\u003c/p\u003e\n\u003cp\u003eWithout the boy and Jorgen radiating disapproval, the climate outside Winter’s room warmed again. Gina’s shoulders slumped, and she sighed. “I’m gonna go to the bathroom. Anyone want coffee?”\u003c/p\u003e\n\u003cp\u003e“Yes, please,” Lucas said.\u003c/p\u003e\n\u003cp\u003e“I’ll be right back.” She pushed away from her desk and stood.\u003c/p\u003e\n\u003cp\u003e“Anything I can do while you’re gone?” I asked.\u003c/p\u003e\n\u003cp\u003eGina glanced at her chart and shrugged. “You can do a fingerstick.”\u003c/p\u003e\n\u003cp\u003eI nodded. “Sounds good.”\u003c/p\u003e\n\u003cp\u003eI turned to the isolation cart as soon as I could to hide my smile. A fingerstick was perfect. I’d go in alone, get a blood sugar on him, and keep the test strip afterward for Dren’s blood. I couldn’t have planned it any better.\u003c/p\u003e\n\u003cp\u003eLucas came to stand beside me, startling me from my nefarious thoughts.\u003c/p\u003e\n\u003cp\u003e“He’s that bad, eh?”\u003c/p\u003e\n\u003cp\u003e“How do you mean?” I tried to sound innocent.\u003c/p\u003e\n\u003cp\u003e“He’s gone down from two nurses, one with a trank gun, to one nurse without a trank gun.” His eyes searched mine. “You all don’t think he’s getting up again, do you.”\u003c/p\u003e\n\u003cp\u003e“Um.” I inhaled, and exhaled, glad my expression was hidden by my mask.\u003c/p\u003e\n\u003cp\u003e“Let me guess. You can’t tell me.”\u003c/p\u003e\n\u003cp\u003e“It’s not that I can’t tell you, it’s just not my place. I might do it wrong. Hell, I might be wrong. I don’t know how the moon works on your kind.”\u003c/p\u003e\n\u003cp\u003e“Can I come in with you?”\u003c/p\u003e\n\u003cp\u003eDammit to hell. I didn’t have a good excuse to keep him outside. “Sure. Why not?”\u003c/p\u003e\n\u003cp\u003eI got my supplies together at the edge of the room. Lucas walked in without gear on—what could happen to him if he got bitten, he’d become more were?—but being alone in the room with two werewolves made my cotton isolation smock feel a lot like a hooded red cape.\u003c/p\u003e\n\u003cp\u003e“So who was he to you?” I asked as I approached the bed.\u003c/p\u003e\n\u003cp\u003e“Frightening mostly.” Lucas stood on Winter’s right side, and I joined him there. “One Halloween as a kid I asked my mom if I could dress up as him.”\u003c/p\u003e\n\u003cp\u003e“That bad?”\u003c/p\u003e\n\u003cp\u003e“Worse, really.” Lucas looked down at Winter’s still form and shook his head. “He was willing to do anything to get his way.”\u003c/p\u003e\n\u003cp\u003eI didn’t know what to say. “I’m … sorry?” I guessed.\u003c/p\u003e\n\u003cp\u003e“He was the perfect pack leader,” Lucas said, going on like I wasn’t there. “He didn’t give a shit about anything else, anyone else—his life was the pack. Anything for the pack. He had to be tough. Cruel, even.” Lucas reached out to touch Winter’s face hesitantly. We hadn’t shaved him since his arrival, and his five o’clock shadow was becoming a low beard. “Goddammit—he lived this long. He wasn’t supposed to die.”\u003c/p\u003e\n\u003cp\u003eI uncovered one of Winter’s hands. I’d lance his finger and get blood while Lucas was distracted by his grief and—“Oh, no.”\u003c/p\u003e\n\u003cp\u003e“What?” Lucas’s attention spun to me. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“It’s probably in the chart already. I just didn’t know—” Winter’s fingertips were turning black. It was due to the blood pressure medication we gave people. At the volume he was getting it here, we were saving his vital organs at the expense of the rest of him. If we couldn’t turn down his meds soon—if the moon didn’t heal him, if he didn’t wake up and the processes in him that regulated blood pressure begin to work again—his hands would go. His remaining foot too.\u003c/p\u003e\n\u003cp\u003eLucas’s eyes narrowed. “That’s bad, isn’t it.”\u003c/p\u003e\n\u003cp\u003e“Yeah. I’m sorry.”\u003c/p\u003e\n\u003cp\u003eLucas leaned over the bed so that his face was over Winter’s. “You’re not supposed to die. Do you hear me? You’re not supposed to die.”\u003c/p\u003e\n\u003cp\u003eThere was a small cough from the room’s doorway. “Did I come at a bad time?”\u003c/p\u003e\n\u003cp\u003eLucas and I both looked up. A man I hadn’t met yet stood in the doorway, shadowed by the light outside. Lucas’s hands clenched on the bed’s side rail, so hard the bed shook. “Viktor.”\u003c/p\u003e\n\u003cp\u003e“I take it now’s a bad time?” The other man—were, I was guessing—stepped into the room.\u003c/p\u003e\n\u003cp\u003eIt was my job as nurse to make them calm down—but this was the only window I’d have to get blood for Dren. I was torn for half a second, and then I jabbed the lancet into the edge of Winter’s intact palm.\u003c/p\u003e\n\u003cp\u003e“How did you do this, Viktor?” Lucas released the bed, making it rattle. He rounded toward the door. “You couldn’t just wait for him to keel over on his own?”\u003c/p\u003e\n\u003cp\u003e“Me? I know nothing.” The visitor, Viktor, clutched an innocent hand to his chest. “I only just found out about the great one’s condition.”\u003c/p\u003e\n\u003cp\u003eI squeezed Winter’s hand hard to milk blood out. I just needed one drop. One stinking drop—\u003c/p\u003e\n\u003cp\u003e“He was my leader too,” Viktor continued. “I have as much right to pay respects as you.”\u003c/p\u003e\n\u003cp\u003e“Get out,” Lucas said, his voice no more than a growl. “You did this. I don’t know how, but you orchestrated this somehow—”\u003c/p\u003e\n\u003cp\u003eI didn’t have to be supernatural to feel the tension filling the room, flowing out from whatever history the two weres shared. I could hit the CODE button on the wall and summon twenty other medical personnel here, but then I wouldn’t get my blood—\u003c/p\u003e\n\u003cp\u003eOne thick drop welled out of the lancet-made hole. I swiped the test strip across it. It was all I needed—and it’d better be all Dren needed—to keep my brother safe.\u003c/p\u003e\n\u003cp\u003eI slid it into the glucometer and looked up at the two men. “Lucas—sir—you—”\u003c/p\u003e\n\u003cp\u003e“This is shameful! I have rights! I am a member of the pack!”\u003c/p\u003e\n\u003cp\u003e“You also own a black truck. I’m not stupid, Viktor,” Lucas said. Lucas crouched to jump—when Charles appeared in the hallway holding a trank gun behind both of them.\u003c/p\u003e\n\u003cp\u003e“No transformations on hospital grounds!” he shouted with a low voice. “Don’t think for a second I won’t shoot you both.” He waved the gun between them to prove his point.\u003c/p\u003e\n\u003cp\u003eLucas slowly relaxed, coming back to standing. “Viktor here was leaving.”\u003c/p\u003e\n\u003cp\u003e“As a pack member, I have every right to pay respects,” Viktor complained.\u003c/p\u003e\n\u003cp\u003eI moved around the bed to be out of the way of Charles’s possible shots. Viktor was a young man—same age as Lucas, probably—but he dressed older, in a three-piece suit. He held a fedora over his chest, seemingly to calm his injured pride, and without the hat I could see one lock of white hair against the rest of his natural black.\u003c/p\u003e\n\u003cp\u003e“Family makes the rules here, not packs,” Charles informed everyone, with the gun still held high.\u003c/p\u003e\n\u003cp\u003eViktor sighed then and bowed elaborately—to Winter, not to Lucas, I realized—and reset his hat on his head. “Until full moon then?” he asked of Lucas.\u003c/p\u003e\n\u003cp\u003e“Oh yes,” Lucas said, with a dangerous tone.\u003c/p\u003e\n\u003cp\u003eViktor left, Charles stepping backward to follow him with the barrel of his gun. “You all right, Edie?” he called back to me.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“Maybe your other friend in there better leave too,” Charles said.\u003c/p\u003e\n\u003cp\u003eLucas muttered something to himself. I wanted to stand up for his right to be there, but after their altercation I questioned the wisdom of it.\u003c/p\u003e\n\u003cp\u003e“Okay, now you, Edie,” Charles said. I exited the room. It was just Charles and me in the hall. He set down the gun.\u003c/p\u003e\n\u003cp\u003e“That’s bigger than a flush, Charles—” I tried to tease. My voice was too high, too tense.\u003c/p\u003e\n\u003cp\u003eCharles shook his head. “Don’t do that again, Edie. I don’t care how safe they seem. Never be alone with one of them.”\u003c/p\u003e\n\u003cp\u003e“Okay.” After that little show, I had to agree. I took a deep breath in and let it out slowly.\u003c/p\u003e\n\u003cp\u003e“Glad you’re good,” Charles said, and clapped my arm. “What’s his blood sugar at?”\u003c/p\u003e\n\u003cp\u003eI hadn’t realized I was still carrying the glucometer around. I looked down at its screen. “Two eighty-three.”\u003c/p\u003e\n\u003cp\u003eCharles and I changed the insulin drip together since it was a medication you needed a co-sign for, and when Gina returned I explained what had happened and took Lucas’s coffee in his stead. I wasn’t about to go find him. The test strip with Winter’s blood was safely in my pocket. That was all that mattered to me.\u003c/p\u003e\n\u003cp\u003eI had to go to the bathroom near shift change. I told Gina and waved at Meaty and Charles on my way out the door, and exited to find Lucas, sitting with his head between his knees outside in the hall.\u003c/p\u003e\n\u003cp\u003eI couldn’t exactly avoid him. The door to Y4 slammed shut behind me. He didn’t look up. He wasn’t asleep, was he?\u003c/p\u003e\n\u003cp\u003e“Pretend I’m not here,” he suggested without looking up.\u003c/p\u003e\n\u003cp\u003eI snorted. He’d been so frightening in the room, but now he just looked depressed. Winter was my patient … but that was the problem with visitors. Sometimes they needed nursing too. I walked over to him and knelt down. “Want to tell me what that was about?”\u003c/p\u003e\n\u003cp\u003eLucas looked up at me, eyes full of sadness. “I’m next in line to lead the pack.”\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-ONE\u003c/p\u003e\n\u003cp\u003e“Oh.” I didn’t know how to react. In my world, promotions were positive things.\u003c/p\u003e\n\u003cp\u003e“I never wanted this day to come.” Lucas leaned forward and put his head back into his hands. “I’m not like Winter was.” \u003c/p\u003e","sourceLink":"https://allnovel.net/moonshifted-edie-spence-2/page-18.html","bookId":2619,"creation":"Oct 5, 2019 6:54:07 PM","modification":"Oct 5, 2019 6:54:07 PM"}
