{"id":100513,"no":29,"title":"Page 29","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eOn an impulse, I hit the STOP button and looked up. “Hey.” I rapped on the wall with my free hand. “Are you there, Shadows? It’s me, Edie,” I said. I waited in silence, then sighed. “Which is it, you have no sense of humor, or no knowledge of popular literature?”\u003c/p\u003e\n\u003cp\u003eMore silence. I felt sure they were listening in, though. “You’d better protect him from weres, too,” I told the ceiling. And then I let the STOP button go.\u003c/p\u003e\n\u003cp\u003eI arrived on Y4 an hour early. Charles came into the break room while I was fishing in the back of the fridge for my emergency Diet Coke.\u003c/p\u003e\n\u003cp\u003e“Hey, Edie! Did they call you in, too?”\u003c/p\u003e\n\u003cp\u003e“I was down here already, and the weather was bad, so there was no point in driving home,” I lied. “Why? We busy?”\u003c/p\u003e\n\u003cp\u003e“When aren’t we,” Charles said, and passed by me to take a Hot Pocket out of the freezer, popping it into the microwave as I cracked open my Coke. “So many donors came in last night. What the hell did they need all that blood for?”\u003c/p\u003e\n\u003cp\u003eAfter my chat with Anna this A.M., I had a suspicion. I sat down, since technically I wasn’t on yet. “Charles, have the Shadows ever let you down?”\u003c/p\u003e\n\u003cp\u003eHe turned around from the microwave. “Why do you ask?”\u003c/p\u003e\n\u003cp\u003e“Your scar. The one you showed me. They didn’t protect you then, right? But—whatever they’re trading you, to keep you here, surely they’ve made good on that.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” he said, and behind him, the microwave counted down backward, seconds ticking away.\u003c/p\u003e\n\u003cp\u003e“What is it? If I can ask?”\u003c/p\u003e\n\u003cp\u003eHe made a thoughtful face and let out a huge sigh. “My wife needed a heart transplant. She was low on the list.”\u003c/p\u003e\n\u003cp\u003e“So … the Shadows moved her up?”\u003c/p\u003e\n\u003cp\u003e“Nope. She just got better.”\u003c/p\u003e\n\u003cp\u003e“Oh. God.” His wife—that’d mean he could never stop working at Y4. I mean, he could, but if he did … there was a distinct chance she’d die. That was an entire level of horror above the way they’d trapped me into working there. There was always the slim but possible chance that Jake might someday decide to stay clean. There was a ding, and Charles retrieved his Hot Pocket from inside the oven. “Damn.”\u003c/p\u003e\n\u003cp\u003e“Exactly. How’d they get you?”\u003c/p\u003e\n\u003cp\u003e“My brother’s a mess. Junkie. Homeless. Clueless as hell.” I wished I could confide in Charles, but I knew I shouldn’t. He had enough on his plate—plus he’d already warned me away from the weres. “There’s just so much stuff going on right now, I get worried about him.”\u003c/p\u003e\n\u003cp\u003e“Well, I don’t like the Shadows, but I don’t think they’ll abandon ship just yet. This place is prime feeding territory. Where else would they go?” He bit into his Hot Pocket, hissing as it released steam.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you’re a grown man, and you still eat those.”\u003c/p\u003e\n\u003cp\u003e“If you ever meet my wife, don’t rat me out. She makes me sandwiches, but I always pick up one of these on the way in.” His phone rang from his pocket. “Speaking of,” he said with a grin, reaching for it.\u003c/p\u003e\n\u003cp\u003e“She waits up for you every night?”\u003c/p\u003e\n\u003cp\u003e“She’s a night owl too. We make a good team.”\u003c/p\u003e\n\u003cp\u003eI smiled at him. It was nice to see that sometimes relationships worked. I took my Coke and ducked out the door.\u003c/p\u003e\n\u003cp\u003eIf I stayed down in Y4, they’d put me to work. I hopped back into the elevator, made it take me to trauma ICU.\u003c/p\u003e\n\u003cp\u003eI’d get in trouble if I keyed myself into the computer looking up patient data on Jake’s behalf, but with an exposed badge and a couple of open windows, I could make a thorough snoop. There couldn’t be that many white guys with dreadlocks at the hospital. Javier and Luz were gone; their room held a woman colored Oompa Loompa orange with liver failure instead. I bet she sounded like Gideon. And I bet Javier was at a skilled nursing facility, and Luz was still being strong for him, at least for now. She was tough, but it was young love, so it wouldn’t last—said me, the person who refused to admit she’d ever been in love before.\u003c/p\u003e\n\u003cp\u003eI quickly walked through all the ICUs. Satisfied that at least I’d tried on Jake’s behalf, I texted him as I waited for another elevator.\u003c/p\u003e\n\u003cp\u003eUr friend isn’t here. And then, before I could think things through or regret it, I typed, \u0026amp; still thinking about ur idea.\u003c/p\u003e\n\u003cp\u003eFaster than I would have been able to type it myself I got, Thanks Sissy. I owe you, back from him in return.\u003c/p\u003e\n\u003cp\u003ePar for the course. The elevator arrived and I went back to Y4.\u003c/p\u003e\n\u003cp\u003eI changed into scrubs after my time skirting the HIPAA privacy line, and was just about on time.\u003c/p\u003e\n\u003cp\u003eMeaty saw me coming out of the locker room hallway. “I just made the assignments. You’ll be around the corner tonight. Gina called in sick.”\u003c/p\u003e\n\u003cp\u003e“I bet she did.”\u003c/p\u003e\n\u003cp\u003eMeaty’s eyebrows raised with a silent question, and I shook my head. “Never mind.” I couldn’t blame Gina for wanting a shift off after the night she’d had. “Who am I up with?”\u003c/p\u003e\n\u003cp\u003e“Rachel.”\u003c/p\u003e\n\u003cp\u003eI made a face after Meaty passed by. Rachel was a four-legs-good, two-legs-bad kind of vet. She worked opposite weekends from Charles and me. On the rare shifts I had had with her, I’d never seen her hang out her co-workers much—so much so that I got the opinion that she hated us. Being in the were-corral corner with only her to talk to for eight hours would be hell.\u003c/p\u003e\n\u003cp\u003eAs if mentioning her had summoned her, Rachel swung open Y4’s double doors. “Edie, I need help. There’s visitors.”\u003c/p\u003e\n\u003cp\u003eMy first reaction was to be surprised she knew my name. After that I paused for a moment, waiting for her complaint to go farther, then realized that was her complaint in its entirety. Visitors. Outside her patient’s door. I nodded. “I’ll be there in a second.”\u003c/p\u003e\n\u003cp\u003eCHAPTER THIRTY-TWO\u003c/p\u003e\n\u003cp\u003eRachel was standing near Lynn, the P.M. shift outgoing nurse, giving very meaningful looks toward Helen, who also stood nearby. She was dressed in head-to-toe black, the color of mourning, and it didn’t suit her; it made her look too pale.\u003c/p\u003e\n\u003cp\u003e“Hey there,” I said, giving Helen a smile. “Want to go get coffee?” She was a high-ranking were—I wondered if talking to her would count? There weren’t any other weres around. I wondered how many needed to be listening in to officially kick-start the sanctuary engines of public humiliation and shame. At least where shame was concerned, I didn’t have any.\u003c/p\u003e\n\u003cp\u003eI watched Helen resurfacing from her distant thoughts, to focus slowly on me. “Hmm? Oh—it’s you. I don’t think I ever got your name.”\u003c/p\u003e\n\u003cp\u003e“Edie,” I said, putting my hand out.\u003c/p\u003e\n\u003cp\u003e“Helen,” she said, which I already knew. She shook my hand, hers warm but limp. Behind her, Rachel kept making furtive shoving gestures off to the side. “Do you think I’ll miss anything?”\u003c/p\u003e\n\u003cp\u003e“I doubt it. And I bet you need a break. Let’s take a walk,” I suggested to Helen, reaching for her arm.\u003c/p\u003e\n\u003cp\u003eShe reached back to me, and clung around me. I was startled by how near she was comfortable being—my personal bubble for strangers was a little farther out, unless I was about to sleep with them. But I didn’t want to miss my chance to ask her for sanctuary, plus I felt sure that Rachel’s happiness with me would be in direct proportion to how long I managed to keep Helen off the floor.\u003c/p\u003e\n\u003cp\u003e“Fenris Jr. is in bed, and I didn’t have anywhere else to be,” Helen said once we reached the double doors together, walking arm in arm. I nodded, even though I didn’t think she could see me. “Have you lost someone before?” she went on.\u003c/p\u003e\n\u003cp\u003eNo. I did know what it felt like to watch assorted someones leave, again and again and again. But not death, not yet. “No.”\u003c/p\u003e\n\u003cp\u003e“It’s awful.” She squeezed me around my waist and arm as if to emphasize that fact, her hot hand on my arm’s skin. I didn’t like it when people touched me at the hospital, especially when I didn’t know the last time they’d used hand sanitizer. I tried to keep that to myself, though. She was going through a lot, watching her father die slowly—just because I was jaded didn’t mean everyone else had to be. I didn’t squeeze her back, but I held her a little more firmly, and she relaxed into me. I assumed we’d hug, and that would be that.\u003c/p\u003e\n\u003cp\u003e“My husband’s death was tragic, but at least it was quick. My father’s death is a whole new kind of pain.” She didn’t step away.\u003c/p\u003e\n\u003cp\u003eI felt a little trapped, but I still made a sympathetic sound. She inhaled deeply, sniffing. Oh, God, if she started crying, what would I do? She sighed aloud and settled even closer to me, her head upon my chest, making walking almost impossible.\u003c/p\u003e\n\u003cp\u003e“Do—you want me to go get coffee and bring it back to you?” Rachel’s desires and requests for sanctuary be damned, I wasn’t going to haul a crying woman across half the hospital to the vending machines and back.\u003c/p\u003e\n\u003cp\u003e“No. It’s good for me to walk a bit. To get away,” she said from the vicinity of my right breast, and then raised her head, and took a step back. “I don’t mean to frighten you. I apologize.”\u003c/p\u003e\n\u003cp\u003e“It’s okay.” Frighten wasn’t the precise word I’d have gone with—creepy or overclose, yes—but it’d do.\u003c/p\u003e\n\u003cp\u003e“We find comfort in one another. I am not often alone. I haven’t been alone for the majority of my life.” Helen looked over my shoulder, back from where we’d come. “And now—things change.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.” Where she’d been against me was warm. In other circumstances, her closeness would have been nice, say if she were a relative of mine. I wanted to do what was right, even if it felt weird. I reached out for her arm and gave her a comforting pat. I didn’t know how else to help.\u003c/p\u003e\n\u003cp\u003eShe put her hand to mine, pulled it down to her own, and gave me a weak smile. “Just a hand to hold, okay?”\u003c/p\u003e\n\u003cp\u003eI could deal with that. “Okay.”\u003c/p\u003e\n\u003cp\u003eWe walked hand in hand like schoolgirls to the cafeteria. It was closed but there were vending machines outside. I stood by Helen as she ordered coffee, and together we watched the machine pour. “When you’re a child, they tell you parables about the moon.” \u003c/p\u003e","sourceLink":"https://allnovel.net/moonshifted-edie-spence-2/page-29.html","bookId":2619,"creation":"Oct 5, 2019 6:54:07 PM","modification":"Oct 5, 2019 6:54:07 PM"}
