{"id":100531,"no":47,"title":"Page 47","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Paw prints—that’s old. Older than me, even.” Meaty maneuvered around the station table and came to look at the screen with us. My own brother had been selling werewolf-water. And it was a full moon. And some of his clients, and probably other “dealers” and their clients, of the Luna Lobos were coming here too. More people crowded the camera’s angles all the time.\u003c/p\u003e\n\u003cp\u003e“Shit. How fast does it work?”\u003c/p\u003e\n\u003cp\u003e“Not how fast, how much. Depends on how much you drank.” We all watched the screens, aghast, and Gina shook her head. “Who the hell was hooking them up?”\u003c/p\u003e\n\u003cp\u003e“Doesn’t matter. We’re sitting ducks here, people. Grab as many trank rifles and as much ammo as you can,” Meaty said. “It’s time to leave.”\u003c/p\u003e\n\u003cp\u003eCHAPTER FORTY-NINE\u003c/p\u003e\n\u003cp\u003e“Why are they coming here?” I asked Meaty while Gina and Rachel raided the isolation carts for guns and ammo. The weres in the distant rooms were still trying to escape.\u003c/p\u003e\n\u003cp\u003e“Someone’s controlling them,” Meaty answered. We both watched over Gideon’s shoulder as the weres became more numerous, zooming closer. I almost wanted him to turn off the feed.\u003c/p\u003e\n\u003cp\u003e“But—why here? Why now?” Behind us, there was a wall-rattling thump as the weres in the distant rooms still tried to escape. Thank God they’d reinforced after the dragon. Thank God.\u003c/p\u003e\n\u003cp\u003e“There’s only three things that are valuable at this hospital.” Meaty ticked off thick fingers. “Vampire blood, were blood, and a shitload of narcotics. I’d bet those things are after the first two. As for why now—who knows? Maybe because the Shadows are gone. I’d like to know how they found that out, though.” Meaty glared at me.\u003c/p\u003e\n\u003cp\u003e“If I had talked, do you think I would have been stupid enough come back here?” I said.\u003c/p\u003e\n\u003cp\u003eMeaty grunted. “Charles didn’t talk. He’s already in Bermuda.”\u003c/p\u003e\n\u003cp\u003e“So whoever’s running this show did something to set the Shadows off. It doesn’t change what we’re dealing with right now,” Gina said, frowning as she returned. “I can’t believe you didn’t tell me, though.”\u003c/p\u003e\n\u003cp\u003eI did feel bad. I’d been making the best of bad situations for the past month. I looked to Meaty.\u003c/p\u003e\n\u003cp\u003e“All right. Let’s go.” My charge nurse started for the door. On the computer screen, the weres had reached the hospital lobby doors.\u003c/p\u003e\n\u003cp\u003e“Wait! What about the blood? You can’t just let those things take it.”\u003c/p\u003e\n\u003cp\u003e“My interest here is in saving my skin and yours. I haven’t lived this long to die now,” Meaty said, loading up their gun with darts.\u003c/p\u003e\n\u003cp\u003eIt didn’t feel right, just abandoning the ship. I knew Meaty knew better than I did, but—“I’ll call Sike again. She’s bound to almost be here.” The confirmation site hadn’t seemed that far away.\u003c/p\u003e\n\u003cp\u003e“And then what?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.” But I had my answer to my why-now question. If what Sike had said about Anna’s ability to make endless blood was true—maybe this was the other angle on that game. Maybe Anna was so threatening to the status quo that someone wanted to make a run on all the other vampire blood in the county. What better time to steal it than when she was being distracted by her confirmation party? Using the wolfmen my brother had accidentally been creating for distraction?\u003c/p\u003e\n\u003cp\u003e“If they get that blood, it’ll shift the balance of power.” If blood was the power to create new vampires, and get more daytimers in thrall, I couldn’t let anyone else get what was in the transfusion lab.\u003c/p\u003e\n\u003cp\u003eMeaty’s head shook. “It’s too dangerous. I won’t let you go without a plan.”\u003c/p\u003e\n\u003cp\u003eI reached out and took a trank gun from Gina. “I’ll think of something on the way. Where’s transfusion?”\u003c/p\u003e\n\u003cp\u003eMeaty sighed and waited, to see if I had any sudden epiphanies. I didn’t. Frowning, my charge nurse took the lab results back from me and drew a quick map at the bottom. The elevator banks were designated by their letters, and floors of stairs were hashed. “This is where you’re going—the transfusion lab’s at the back. This,” Meaty said, pointing to another spot on the map, “is where we’ll be. There’s an underground tunnel at the back of the accounting department, it leads to the loading docks outside.” Meaty took off their badge and pulled out keys, handing them all to me. “I’m not sure if I have access to all the doors. When you’re done, come find us. I hope you make it.”\u003c/p\u003e\n\u003cp\u003eGina handed me a fistful of darts. “If you get into trouble, call.” She pecked me on the cheek, like she was letting me go. Rachel shrugged and shook my hand.\u003c/p\u003e\n\u003cp\u003eThey walked out together like a combat unit, Meaty leading the charge. The wolfmen bayed behind me, thumping at their plastic walls.\u003c/p\u003e\n\u003cp\u003eI looked over at Gideon. “I hope you don’t mind staying behind.”\u003c/p\u003e\n\u003cp\u003eGideon threw his hat on the floor and took off his gloves.\u003c/p\u003e\n\u003cp\u003e“I guess that means you’re in. Thanks.” I held up Meaty’s map between us. It was a good thing I was familiar with the hospital’s general layout, because the map wasn’t very clear. The transfusion lab was on the first floor, but it was an entire hospital-length away. We would be safer if we came up to a higher floor, then ran along in one of the basement hallways.\u003c/p\u003e\n\u003cp\u003eThe elevators let us out, and we took a flight down, and I wished I’d popped a Vicodin back in Y4, when I’d had the chance. It was hard to be quiet when each step hurt, and frustrating to be going so slow.\u003c/p\u003e\n\u003cp\u003eWe were in the diagnostics imaging corridors now, limping along beneath sterile lights. There were howls coming from inside the building, and I was glad County had thick floors so I couldn’t hear claws scrabbling overhead.\u003c/p\u003e\n\u003cp\u003eThen the howls were from down the hall. I opened up the door nearest to us, and pulled Gideon inside. We were in one of the many rooms that patients disrobed and waited in before assorted scans. There was the chance they’d just race by—but fucking weres and their fucking noses, the door opened just as I closed the breech of the rifle.\u003c/p\u003e\n\u003cp\u003eI shot the first one in the shoulder. It was a were with fingerless gloves and dreadlocks. I knew him, I’d seen him on Christmas Day. He was Jake’s friend, Raymond—I registered it in half a second, and shot him anyway. The trank gun bucked, and the dart lodged into his chest, pushing a were-dose of suxamethonium chloride inside. I hit him again, just in case, before realizing I’d be screwed if I had to reload.\u003c/p\u003e\n\u003cp\u003eHe dropped as the drug paralyzed all the muscles in his body. A new were ran in after him. Gideon punched it in the face. His tined fingers slid into the were’s eyes, and the creature howled in agony for a split second before Gideon’s metal fingers skewered its brain.\u003c/p\u003e\n\u003cp\u003e“Oh, God—” I wanted to throw up, but there wasn’t any time. I reloaded the gun, and we went back into the hall, Gideon staying a little behind.\u003c/p\u003e\n\u003cp\u003eWe made it to the end of the hall, but another howl forced us inside a nearby door. I realized where we were in an instant. There was a red line of tape on the floor, and huge medical equipment on the room’s far side—this was the room with the MRI.\u003c/p\u003e\n\u003cp\u003eI moved to stand in front of Gideon. The red line on the floor marked where it was safe to stand with any metallic object. If I crossed over that line, it’d start tugging the metal on me, the buckles on my purse, the grommets on my boots. If Gideon crossed over it, it’d pull Grandfather right out of him.\u003c/p\u003e\n\u003cp\u003eThe room stank like cigarette smoke, and a man stood up from where he’d been sitting, on the MRI’s bed.\u003c/p\u003e\n\u003cp\u003e“Hey, lady. I wondered if you would show up. I heard about you.” It was Y4’s erstwhile daytimer patient, Mr. Hale, smoking in his hospital gown.\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003e“Just another daytimer,” he said with a greasy smile.\u003c/p\u003e\n\u003cp\u003eGideon started forward and I pressed him back. “No, you’re not.”\u003c/p\u003e\n\u003cp\u003e“Okay, you caught me.” He clasped his hand to his breast dramatically, as if shot. “I’m from House Grey. I think you already heard of us, from that whining were-brat.”\u003c/p\u003e\n\u003cp\u003eThis was the first time I’d ever met a House Grey vampire. “Why are you here?”\u003c/p\u003e\n\u003cp\u003e“To help control those pathetic were-distractions outside.” He tapped his head. “House Grey specializes in fucking with minds. Which I’ll show you, as soon as I get near. Without your Shadows to protect you—” He made a tsking sound and shook his head as though I was in trouble. “Did the Rose Throne really think we were going to let her rise go unchallenged?”\u003c/p\u003e\n\u003cp\u003e“Who?” I pretended not to know.\u003c/p\u003e\n\u003cp\u003eIn the blink of an eye he was two steps closer. Even though he was a daytimer, he’d had vampire blood yesterday. That made him stronger-faster-everythinger than me. He pointed an accusing finger at me. “I witnessed your trial, so don’t pretend you don’t know who I mean.”\u003c/p\u003e\n\u003cp\u003eI swallowed. I didn’t like being reminded of being stabbed by vampires just now. “Anna,” I said, taking another step back as he took a corresponding step forward.\u003c/p\u003e\n\u003cp\u003e“Yes. Her. That’s why we’re here. For the blood. But I bet you knew that already.” He stubbed his cigarette out on the MRI table at his side and gave me a heavy-lidded grin. “Who knows, if I kill you—they might give me some of it.”\u003c/p\u003e\n\u003cp\u003e“You need to stop right there.” My gun was down, no way I could lift it before he’d cross the distance between us. I reached into my pocket that had the darts.\u003c/p\u003e\n\u003cp\u003e“Sorry, lady, but I can’t have you interfere.” He stepped in front of the MRI.\u003c/p\u003e\n\u003cp\u003eI backed up again, shoving Gideon behind me. “I wouldn’t do that if I were you,” I said, trying to look as helpless as possible.\u003c/p\u003e\n\u003cp\u003e“Why? How are you going to stop me?” He gave me an amused look.\u003c/p\u003e\n\u003cp\u003e“Because I know something you don’t.”\u003c/p\u003e\n\u003cp\u003e“Really?” He laughed. “Lady, I have lived for a long, long time. I survived smallpox and the black plague. I won’t be dying here.” Then all his humor faded, and his eyes focused on me. “But you will.” Gideon leaned forward in warning against my back. \u003c/p\u003e","sourceLink":"https://allnovel.net/moonshifted-edie-spence-2/page-47.html","bookId":2619,"creation":"Oct 5, 2019 6:54:07 PM","modification":"Oct 5, 2019 6:54:07 PM"}
