{"id":87676,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI could just imagine that mother packing, stealing glances at her daughter, seeing the things that hadn’t made sense now making such horrible sense, things she would have paid better attention to if she hadn’t been fogged by drink and despair. The increasing paleness, the weight loss. Wondering, ‘when was the last time I saw either of my children smile?’ Marguerite’s broken eyes. Looking into her eyes and seeing…”\u003c/p\u003e\n\u003cp\u003e“The distance.”\u003c/p\u003e\n\u003cp\u003eKomal nodded. “You see it in the worst ones. You know somewhere they’ve shut down. They don’t seek escape or affection. You sit them in a corner and they simply wait until the next thing happens. They expect nothing. I suspect her mother probably asked Marguerite some questions in those moments. ‘How long has it been going on?’\u003c/p\u003e\n\u003cp\u003eDid she hug her, hold her, try to touch her at all? Or was she numb with shock, focused on getting them out of that house? As I imagine it, I find myself—absurdly—urging her to hurry, get out, don’t worry about clothes, just get out, get out now. Trying to impact an event that happened years ago. I do know one of the few personal things I got out of Marguerite about that moment was that David sat next to her on the bed as they watched their mother and held her hand. She remembers him saying softly, ‘It’s okay now.’\u003c/p\u003e\n\u003cp\u003e“He was about at the age I expect he would have either absented himself from home as much as possible or tried to intervene. Or both. We have a record of him at eleven coming to an emergency room with a broken arm and injuries to his face and mouth. Two of his teeth knocked out. Supposedly a fight after school. Marguerite confirmed that was a lie, that he’d attacked her father, tried to pull him off her. She knew her father would kill him if he tried to interfere. So after that she told David if he loved her, he’d just stay away as much as possible and not worry about it. That they’d just both try to stay away as much as possible. It’s odd they didn’t just run away.\u003c/p\u003e\n\u003cp\u003eThough she never said, I think that they wouldn’t leave their mother.\u003c/p\u003e\n\u003cp\u003e“He was devoted to her. School records show they insisted on being in the same classes, spent most of their time together. David had friends. Marguerite was sometimes with him when he spent time in their company but she did not cultivate her own friends. He was her one touchstone to something other than the horror of their home life.\u003c/p\u003e\n\u003cp\u003e“David was a child’s love but perhaps the only pure, untainted love she had where she gave back as well. And I don’t think anyone’s broken through to her since his death.”\u003c/p\u003e\n\u003cp\u003eKomal shook her head, rose. “I need to get us some tea, Mr. Winterman. This is a story better told in pieces. Would you like to help?”\u003c/p\u003e\n\u003cp\u003e“Yes.” He accompanied her, assisting in silence, respecting her need to reflect and gather her thoughts. She chose a tea that smelled of chamomile, probably seeking the calmness it could offer. When they returned to the main room, he carried the tea tray, set it down where she directed and then watched her pour, the careful balancing, the straining, everything he’d seen Marguerite demonstrate.\u003c/p\u003e\n\u003cp\u003e“You provided her the way to save herself.”\u003c/p\u003e\n\u003cp\u003e“Isn’t that always an odd word? ‘Save.’” She handed him a cup, began to pour herself one. “‘Save’ is what The Lone Ranger does, or Spider-Man. Coming out of nowhere to catch the heroine when the villain shoves her off the cliff, or pull her off the train tracks. No one was around to save Marie Peninski. Marguerite Perruquet picked up the pieces and has been trying to reassemble what was left ever since.” Tyler’s brow furrowed. “I don’t understand.”\u003c/p\u003e\n\u003cp\u003e“You’ve seen the popular movies where a personality divides because it can’t handle what’s happened to it? Marguerite Perruquet is strong enough to face what was done to Marie Peninski. She didn’t block it, but she somehow intuitively knew she had to create another name, a person whose shoes she could step into to manage what Marie endured.”\u003c/p\u003e\n\u003cp\u003e“What happened that night?” He put down his cup, afraid that he was going to break it with the rage vibrating through him.\u003c/p\u003e\n\u003cp\u003e“The mother about had the suitcase packed when he burst back into the room. With a gun.” Komal set her own cup back down, added some milk from a small pitcher. “The only way Marguerite could tell this part of the story was by demonstrating it to me with dolls. And because it was in fact that awful, I am going to say it as bluntly as I can, the best to get it over with.” Her fingers held on to the pitcher after she replaced it on the tray, her grip tightening.\u003c/p\u003e\n\u003cp\u003e“Frederick Peninski put the gun to Marguerite’s head and told his wife to remove her clothes, to remove her son’s clothes. Told Mrs. Peninski over and over that she was no better than him, that if demons were digging into her brain she’d be doing nothing different from him. He then told her to have sex with her son right then and there or he’d blow Marguerite to pieces one shot at a time. Then he’d shoot David as well. To prove it, he lifted Marguerite’s hand and shot through it.” The starburst. Tyler closed his eyes but Komal’s words kept coming.\u003c/p\u003e\n\u003cp\u003e“David made a lunge for his father and he shot him in the leg. The boy went down.\u003c/p\u003e\n\u003cp\u003eEven though the boy was bleeding and in pain, Frederick was screaming at her to do it, to show she was just like him. He had the gun cocked, his finger on the trigger, the barrel against Marguerite’s temple. So her mother did it. She did the unthinkable, aroused her son with the knowledge of a sexually mature woman and made him ejaculate inside her as Frederick ordered. After, he told her she had nowhere to go. That this was hell and there would be no escape from hell for any of them.” The clock ticked on the wall. Tyler could hear her refrigerator humming in the kitchen they’d just left. Tyler knew that there was sunshine outside and spring flowers, but all he could see were rows of bodies in Panama being bulldozed into a mass grave.\u003c/p\u003e\n\u003cp\u003eThe shadows of an interrogation room, a woman screaming, her slender bones breaking.\u003c/p\u003e\n\u003cp\u003eHe jerked at Komal’s touch. “Are you all right?” she asked.\u003c/p\u003e\n\u003cp\u003e“Yes.” He cleared his throat. “Finish it.”\u003c/p\u003e\n\u003cp\u003eShe gave him a thorough look, nodded. “Frederick left the house then. I suppose he figured he’d made sure there was nowhere they could go to escape the horror. The details of this are sketchy, because I never was able to get Marguerite to speak much of it. Mrs. Peninski must have bandaged up David’s leg and Marguerite’s hand, got them dressed. They took the car to the tallest building downtown, rode the service elevator to the roof and all three jumped.\u003c/p\u003e\n\u003cp\u003e“From the estimation of the emergency services team, investigators and eyewitness accounts as well as forensics, the mother fell free but the twins managed to latch on to each other. David landed on the bottom, took the full brunt of the asphalt. Marguerite had a couple broken bones as you see in the picture, but miraculously no head or spinal trauma, the kind of miracle you read about in Reader’s Digest. The mother and son died instantly.”\u003c/p\u003e\n\u003cp\u003e“And the father?”\u003c/p\u003e\n\u003cp\u003eKomal looked at him. “It was her testimony that put him away. I could barely get her to talk to me about anything but the sketchiest details, Mr. Winterman. But in court on the stand, she told us exactly what we needed to increase her father’s sentence to a twenty-year term. Child molestation, assault and the district attorney did a credible job of showing he contributed significantly to the suicide. I’ve no doubt that it was the loss of David that did it. Many children are afraid to look at their parents during such a testimony. You know she meets no one’s gaze easily. But from the moment she took the stand, she locked eyes with him as if they were standing on a platform over hell and the first one to blink would drop through a hatch in the floor. When she got up from the stand she shocked us all by bolting to his table. She was over it and on him like a wild animal, gouging his eyes, tearing at his face. Screaming at him, wails of such pain and savagery I thought we’d had a breakthrough. But an hour later she was as dispassionate and unreachable as ever.”\u003c/p\u003e\n\u003cp\u003eKomal lifted her cup to her lips with a hand that had a slight tremor. Took a long sip, studied a boy riding by her house on a bicycle. She was apparently lost in memory, a memory so different from that child’s innocence, Tyler wondered if she even saw him.\u003c/p\u003e\n\u003cp\u003eThen she raised a hand as the child saw the suggestion of her in the window and waved.\u003c/p\u003e\n\u003cp\u003e“But a police report I got from some of my friends in Tampa said they never clearly proved the sexual assault.”\u003c/p\u003e\n\u003cp\u003eKomal frowned. “That was an earlier report. We weren’t able to prove it because at first the prosecution wouldn’t use her. They didn’t think she could hold it together to be a credible witness right after it all happened. They were able to put him away on assault for shooting her and David. But several months later when I hadn’t gotten hardly a word out of her, she called the district attorney’s office from the orphanage and told them how he had abused her. Everything that happened that had led to the jump. They tried him on sexual molestation and the other charges. Your Tampa friends didn’t dig very far.”\u003c/p\u003e\n\u003cp\u003eTyler shrugged. “They were investigating the S\u0026amp;M Killer. She was a suspect for a very short time and they didn’t have to dig for long before they found the real perpetrator.”\u003c/p\u003e\n\u003cp\u003eKomal blinked, set down her cup. “Please tell me she never knew that.”\u003c/p\u003e\n\u003cp\u003e“No, she never did.”\u003c/p\u003e\n\u003cp\u003eKomal’s lips pressed together firmly. “Good. That child has been through enough.\u003c/p\u003e\n\u003cp\u003eShe went into an orphanage, got good grades, conducted herself with absolute decorum. Never responded to anyone we know of except one little boy who was adopted out six months after he got there. I offered to take her to visit him once but she simply shook her head, politely thanked me for my visits as she always did and that was that.\u003c/p\u003e\n\u003cp\u003e“The moment she turned eighteen, she packed her bags and left. I lost track of her for ten years except for the shock of receiving two postcards from her over that time period, telling me she was learning about the tea trade, traveling through India, Asia.\u003c/p\u003e\n\u003cp\u003eAnd then as you know, she came back here to open Tea Leaves.” \u003c/p\u003e","sourceLink":"https://allnovel.net/mirror-of-my-soul-nature-of-desire-4/page-12.html","bookId":1909,"creation":"Oct 5, 2019 5:23:41 PM","modification":"Oct 5, 2019 5:23:41 PM"}
