{"id":87686,"no":22,"title":"Page 22","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Artists,” Tyler pronounced as Marguerite turned to face him.\u003c/p\u003e\n\u003cp\u003e“Is there anything we should do for him?”\u003c/p\u003e\n\u003cp\u003e“No, he’s just missing Lauren. Of course that’s often when he’ll come up with something brilliant, inspired by his passion for her.” When she bent to pick up the robe, he put out his hand. “Don’t. Come here.” Dropping it, she walked toward him across the green grass in her bare feet. She watched his eyes touch every part of her as she came to him. The tightening of her nipples under his regard, her stomach and thighs, the dampening folds of her pussy.\u003c/p\u003e\n\u003cp\u003eShe was even cognizant of his eyes on her throat, her knees, feet and flanks. They all reacted as if his gaze alone were capable of caressing her.\u003c/p\u003e\n\u003cp\u003eWhen she got to him, he surprised her by sitting down in the grass and tugging her down so she was straddling his legs. He tucked her legs around his hips, his hands loosely linked at the widest part of her buttocks, his fingers playing in the sensitive crevice. “You like him.”\u003c/p\u003e\n\u003cp\u003e“I do. He’s something else. If I were Lauren, I’d never leave him alone.”\u003c/p\u003e\n\u003cp\u003e“Once he tells her about you, I’m sure she never will again.”\u003c/p\u003e\n\u003cp\u003e“What? I didn’t—”\u003c/p\u003e\n\u003cp\u003e“I know you didn’t. And he loves her to obsession.” Not unlike himself with the woman in his arms. “I wasn’t criticizing. It’s something about you. You’re more Goddess than Mistress. There’s something that makes a submissive feel…overwhelmed in your presence.”\u003c/p\u003e\n\u003cp\u003eShe chose to ignore that, as he knew she would. “Did the way I act with him bother you?”\u003c/p\u003e\n\u003cp\u003e“It’s a part of you that fascinates me, but the Master in me does get a bit restive when I see your hands on another man.”\u003c/p\u003e\n\u003cp\u003eEnough that he’d had to take a few steadying breaths when he’d come upon the intriguing tableau of Josh examining his angel naked. He’d had to take a moment to assess it, understand and force himself to appreciate the interaction, rather than break the fingers of a man whose hands created art revered all over the world.\u003c/p\u003e\n\u003cp\u003e“It’s different,” she said. She moved her hips over him, a stroke against his already hard cock. His fingers tightened on her buttocks, squeezing so a little breath left her.\u003c/p\u003e\n\u003cp\u003e“It’s like when I drink tea, do the ritual. It satisfies something I need to feel. A balance. Working with subs is like that. But with you, it’s different. It’s hard to explain.”\u003c/p\u003e\n\u003cp\u003e“I can’t describe it either.” He touched her hair, lifted it on either side of the comb clip, let it flow out of his hands, brush her bare back. He enjoyed the way she tilted her head back, feeling the sensation. “It’s like a vise around my chest, my heart, my mind.\u003c/p\u003e\n\u003cp\u003eIt’s like if some part of my mind isn’t about you, with you, I don’t feel whole. I want to be with you. Whether just being with you where you are, making love to you, or watching you make tea. It’s obsession, but something so much deeper. It’s so deep that I know you feel it, too. It can’t all be coming from me.” She considered that. “You know a lot of stalkers feel that way. And terribly arrogant men.”\u003c/p\u003e\n\u003cp\u003eHe smiled, a slow, lazy expression. “So they might. You don’t mind having me as a stalker, do you?”\u003c/p\u003e\n\u003cp\u003e“I think I can handle you. I have a bat for your hard head.”\u003c/p\u003e\n\u003cp\u003e“And I hear you know how to use it.” He lifted her hand to his lips. At her look, he raised a shoulder. “I regularly bribe Chloe for information.”\u003c/p\u003e\n\u003cp\u003e“I’m going to have to replace that girl with a retired Catholic nun who will see right through your charm, see what a bad man you are.”\u003c/p\u003e\n\u003cp\u003eHe shuddered. “I much prefer Chloe.” His eyes grew serious. “You terrify me. He had a gun.”\u003c/p\u003e\n\u003cp\u003e“He doesn’t anymore. The police have it. I doubt he even has working internal organs.”\u003c/p\u003e\n\u003cp\u003eHe framed her face in his hands, commanding her attention with a little shake. “Do you know how it would tear my guts out to lose you?” She shook her head, looked down, away, uncomfortable. Her body tensed and he knew she was about to pull away. Tyler reined his temper back with effort. Stop pushing. She was brave enough to come here last night. Don’t scare her off sooner than she’ll do it on her own. He reached into a shady corner under the bench.\u003c/p\u003e\n\u003cp\u003eA wildflower, a delicate star in a shade of pure cream, came into the field of Marguerite’s lowered gaze a moment before it was brushing against her lips, the stem of the flower held in Tyler’s hand.\u003c/p\u003e\n\u003cp\u003e“I leave you alone for an hour and you’re lying out here naked with another guy.\u003c/p\u003e\n\u003cp\u003eFaithless wench.”\u003c/p\u003e\n\u003cp\u003eShe tilted her head, dodging the flower and enjoying looking at him with the sun making the highlights of silver in his dark hair gleam. “Did you like his sketch?”\u003c/p\u003e\n\u003cp\u003e“I like anything that involves you.” He smiled as she reached out spontaneously and touched his throat, caught her fingers in the soft hairs of his chest through the open collar of his shirt. Her deft fingers even slipped one button to play more freely on his skin. “And yes, despite the fact I know his hellhound of a dealer will extort an ungodly amount of money from me to obtain the finished work, I liked it.”\u003c/p\u003e\n\u003cp\u003e“He must be doing well to have a gallery dedicated to him in New York.”\u003c/p\u003e\n\u003cp\u003e“He’s had that for a couple years. Josh is getting ready for his second tour of Europe. Milan, Paris, et cetera. That’s why Marcus is nagging him for several more pieces. His last one was auctioned off for a quarter of a million dollars.” Her eyes widened. “I thought you were joking…he was joking. Who is he? Oh…” Her hand went to her mouth. “He’s the anonymous Zone sculptor.”\u003c/p\u003e\n\u003cp\u003e“Actually, that was done by several of his protégés, under his supervision.”\u003c/p\u003e\n\u003cp\u003e“J. Martin.” Her hand reached out, caught his sleeve. “I didn’t know… I wouldn’t have… It will be all over Europe…the States…”\u003c/p\u003e\n\u003cp\u003eTyler burst out laughing at her look of horror. “The only woman I know who blanches at the idea of being immortalized in the art world. What if Mona Lisa had felt that way? Or Michelangelo’s David? Don’t worry, angel.” He stroked back her hair.\u003c/p\u003e\n\u003cp\u003e“I’m going to buy it. The sculpture, the sketch, it will all be mine.” Just like the woman that inspired them. “I’ll enjoy it as privately as you wish.” His lips brushed hers. “As privately as I intend to enjoy you, over and over. Just let that be a lesson to you when you let strange men see you naked.”\u003c/p\u003e\n\u003cp\u003eHer grip eased, but something in her face made his eyes narrow. “Marguerite—” She rose off him before he could tug her back down, reached for the robe. “I wouldn’t have let him if I had known. If I knew it would cost you so much money. I can go talk to him, tell him not to…that I withdraw my permission.” He stood, catching up to her in two steps, taking her arm to stop her. “He’s in prison.”\u003c/p\u003e\n\u003cp\u003eShe jerked free, her expression making that lightning change from malleable woman to hostile wild creature, frustrating him. “And he doesn’t know where I am, who I am.”\u003c/p\u003e\n\u003cp\u003e“He hasn’t seen you since you were fourteen. It will be a sculpture.”\u003c/p\u003e\n\u003cp\u003e“He’ll know. You don’t know. You see? I can’t do this. I can’t…”\u003c/p\u003e\n\u003cp\u003e“You’ll let him put you in a cage, keep you from feeling, loving, because of the fear that it might bring him back to you again?” His control broke. “For God’s sake, have some faith in us, in me. Stop running from him. Stop being so afraid. You can do better than this.”\u003c/p\u003e\n\u003cp\u003eSomething in her went still, frozen. He knew he’d said the wrong thing and instantly wished he could take it back. She lifted her chin, spoke in a voice that was terrible for its low intensity, the enormous feelings that trembled behind the quiet words.\u003c/p\u003e\n\u003cp\u003e“It’s not about fear. It’s about never feeling clean, spending years scrubbing your soul raw so you can eat without feeling nauseous, can look in the mirror and meet your own eyes when you put on makeup, brush your hair. To learn to be strong, to run your life and not be a victim of it, knowing in your heart that everything you’ve built is sitting on a foundation that can sink at any time. And you build it anyway, on faith alone that it won’t be shattered, when everything in your life tells you that faith is a fucking joke, but you do it anyway. You do it anyway.\u003c/p\u003e\n\u003cp\u003e“Have you ever been completely helpless while someone is torturing you? Night after night? I should have died on that building that day, but I didn’t. I’ve had to make myself a life, believing I should be dead, wanting to be dead because I couldn’t stop him from destroying them. I’ve done the best I can. The very best I can. And to have the person who says he loves me tell me it’s not good enough…” Her face was strained, white, tearless, which made the brittle brilliance of her blue eyes even more terrible to see.\u003c/p\u003e\n\u003cp\u003e“Oh, Marguerite.” He closed the gap between them and pulled her in his arms despite the fact she stood rigid. “I’m sorry. I’m so sorry. Please forgive me.” She shook in his arms, but the tight fist of fear around his heart eased a fraction as, an eternity of a moment later, her arms crept up, held him back. He stroked her hair, held her fiercely close, whispered to her, but the words were resounding in his head, pounding at him in a way he could not push away.\u003c/p\u003e\n\u003cp\u003e…to have the person who says he loves me tell me my best is not good enough…\u003c/p\u003e\n\u003cp\u003eHe put his hands to her bare waist, though he felt as if he were the one naked. He even felt a tremor in his hands which he hoped she didn’t. Something was shifting between them. He’d hoped to reach the point she would open up to him the way she was starting to do. He hadn’t anticipated it would open up things in himself as well, things he’d thought he could keep out of their relationship.\u003c/p\u003e\n\u003cp\u003eWith an effort, he beat it back and lifted her chin. “Your strength humbles me in every way. I’m a stupid bastard and I was taking out my frustration on you. Your fear tears at my heart. I don’t want you to have a moment of pain or worry.” Her blue eyes studied his. He was afraid she saw too much of what was moving there. “That is entirely unrealistic,” she said at last. \u003c/p\u003e","sourceLink":"https://allnovel.net/mirror-of-my-soul-nature-of-desire-4/page-22.html","bookId":1909,"creation":"Oct 5, 2019 5:23:41 PM","modification":"Oct 5, 2019 5:23:41 PM"}
