{"id":87697,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIn that, they were entirely too alike.\u003c/p\u003e\n\u003cp\u003eChapter Twelve\u003c/p\u003e\n\u003cp\u003eA couple busy hours finishing up the day at Tea Leaves kept her from dwelling too much on all the revelations from the airport. But the scent of Tyler in her room as she packed for the weekend and changed clothes brought it all back, along with other distracting thoughts. If she knew him, he was figuring sexual deprivation would force her to capitulate much more quickly to his absurd offer of marriage. He was relentless.\u003c/p\u003e\n\u003cp\u003eIt almost made her smile.\u003c/p\u003e\n\u003cp\u003eAs Marguerite drove up to the gate of Tyler’s “city house” late Friday afternoon, she noted it had many of the same qualities as his Gulf home. Acreage, privacy and lovely, tended grounds that suggested Robert either had a twin or divided his attention between both places. The house had a Caribbean flare, with tall front columns, wide vistas of windows and charming touches like the center fountain in the front drive.\u003c/p\u003e\n\u003cp\u003eSculptures of two children frolicking in the water reminded her of their puddle stomping, the laughter that had bubbled out of her, his playful grin.\u003c/p\u003e\n\u003cp\u003eHe was sitting on the front steps in khakis and an open-collared white shirt, the sleeves rolled up, his back comfortably leaned up against a column.\u003c/p\u003e\n\u003cp\u003eShe got out, shouldered her overnight bag with a casualness she was far from feeling when he looked at her out of those half-lidded, direct tiger eyes.\u003c/p\u003e\n\u003cp\u003e“How much money do you have?” she asked waspishly.\u003c/p\u003e\n\u003cp\u003e“You after me for my money now?”\u003c/p\u003e\n\u003cp\u003e“I have never been after you, Tyler Winterman. You’ve chased me from the beginning. Shamelessly and tiresomely.”\u003c/p\u003e\n\u003cp\u003e“Really? That embarrassing, am I?”\u003c/p\u003e\n\u003cp\u003e“Like a slavering hound.” She walked up to him, making the mental correction that he was more like a bloodhound. He tilted his head, surveying her from the tips of her sandals, her bare knees, the hem of her sleeveless linen sundress, up to her breasts and face, lingering on the hair she’d caught in a banana clip and which spilled over one shoulder.\u003c/p\u003e\n\u003cp\u003e“You look like a beautiful island sprite.” He ran his hands up her calves, under the skirt. Before she could back away, he had a firm grip on her thighs. “Drop the bag and come down here. Give Fido a break and let me drool on you a bit.” She knew there was nothing joking about the underlying command as his strength pulled her inexorably forward. She only had a moment to drop the bag before he had her stepping over him. Bringing her down to straddle his lap, his hands comfortable under the short skirt, he found the front of her thin panties with his thumbs while his fingers took a firm grip on her bare cheeks. He looked at her eye to eye as she felt the delicious pressure of his cock.\u003c/p\u003e\n\u003cp\u003e“Did you miss me?”\u003c/p\u003e\n\u003cp\u003e“A little. When I was bored and had nothing else to think about.” He caught the back of her head with one hand and took a nip at her bottom lip, made them part, his breath stroking her face. “Liar. Your cunt was wet for me all the way here. Your panties are soaked.”\u003c/p\u003e\n\u003cp\u003e“I was thinking about someone else.”\u003c/p\u003e\n\u003cp\u003e“Mm-hmm.” He covered her mouth with his, plunged deep. His hand held her nape while his other slid farther into that wet area, fingering her, making her shudder.\u003c/p\u003e\n\u003cp\u003e“Tell me his name then. Say who you’re thinking about, who’s getting your pussy so slick. Say it.”\u003c/p\u003e\n\u003cp\u003e“Tyler,” she whispered softly in his mouth. He made a satisfied growl, moving his grip to her waist and pulling her further onto him, his fingers digging into her hips.\u003c/p\u003e\n\u003cp\u003eThey’d made love, said the word “relationship”. She couldn’t help feeling sensual delight in the easy banter, the passion of newfound romance, the wild addictive quality it had. She’d never experienced anything like it before, knew she couldn’t trust or absorb it this fast, but he took over as he seemed to know how to do with her, leaving her with no footing and no anchor but him.\u003c/p\u003e\n\u003cp\u003eHe pushed the skirt up to her waist, baring her lower body to the sunlight. Finding her bra strap, he unhooked it, his hands coming around to capture her breasts beneath the loosened cups. When he surged up, working his mouth down the side of her throat, the upward pressure on her breasts made them all the more visible to him in the scooped neck. He was going to have sex with her right here on his front porch. While the winding drive and high brick fence hid them from public view, it still added to her arousal to feel his desire to take her here, wherever he wished, on his territory.\u003c/p\u003e\n\u003cp\u003eShe didn’t push him away as his mouth descended, took hold of her nipple through the cotton, suckled as he squeezed her buttocks. Her hips moved on him, wanting.\u003c/p\u003e\n\u003cp\u003eWanting him now.\u003c/p\u003e\n\u003cp\u003e“Please…”\u003c/p\u003e\n\u003cp\u003e“Please what?” He nipped her sharply.\u003c/p\u003e\n\u003cp\u003eShe gasped, tightening her hands on his shoulders. “Please, Master. Take me here.\u003c/p\u003e\n\u003cp\u003eOn the stairs. I need you. Now.”\u003c/p\u003e\n\u003cp\u003eTyler realized he hadn’t meant to make the demand, but her immediate response punched him low in the gut as he saw she hadn’t expected herself to respond as naturally as she had. Or as immediately.\u003c/p\u003e\n\u003cp\u003e“Soon.” He cradled her face, kissed her mouth hard again. “I’ll fuck you, angel, make love to you, make you scream when you come. But first I have a gift for you. I’ve been counting the minutes until you got here so I could give it to you.”\u003c/p\u003e\n\u003cp\u003eHe refastened her bra for her, lifted her off him and straightened her skirt, as if unaware of her mutinous look. As he got to his feet, Marguerite deliberately trailed her fingers over him, a light scrape of her nails on his turgid cock, straining against his pants. Catching her hand, he pulled her to him. “Behave,” he reproved. But he gave her a tender kiss on her nose that surprised her, though it barely distracted her from the throb of her body.\u003c/p\u003e\n\u003cp\u003eWhat had happened to her infamous control? But she knew. A sub didn’t have to have control around her Master. Only within his demands. She was quite literally a switch when she was with him, all of her compulsions commensurate with a submissive’s behavior, as strong in her as the Mistress when she stood over a different type of man.\u003c/p\u003e\n\u003cp\u003e“So how was your day? What did you do?”\u003c/p\u003e\n\u003cp\u003eHe opened the door for her, guided her in with a hand at the small of her back.\u003c/p\u003e\n\u003cp\u003eBehaving like the perfect gentleman while she had to clench her fingers into fists to keep from slapping him. Or jumping him.\u003c/p\u003e\n\u003cp\u003e“We had a large afternoon crowd,” she said at last. “Chloe tried her hand at a poppy seed cake that was gone in no time.”\u003c/p\u003e\n\u003cp\u003e“I assume you brought me a piece.”\u003c/p\u003e\n\u003cp\u003e“With paying customers willing to put down six dollars a slice? You’re going to have charm her into baking you one. On her own time.” Her tone was cool and Tyler knew she was getting back at him. He grinned, recognizing the challenging light in her eye. The sexy pout of those soft lips had his lust rising to the point he had to stifle a groan.\u003c/p\u003e\n\u003cp\u003e“Mercenary.”\u003c/p\u003e\n\u003cp\u003e“Fiscally responsible,” she returned. He saw he’d restored her good humor with his teasing. He squeezed her hand.\u003c/p\u003e\n\u003cp\u003e“I love it when you do that.”\u003c/p\u003e\n\u003cp\u003e“Do what?”\u003c/p\u003e\n\u003cp\u003e“Really smile.”\u003c/p\u003e\n\u003cp\u003eShe raised her hand to her lips, startled. It amazed him that she wasn’t aware of it, that she needed tactile experience to believe it. He touched her face, hurting for her and loving her at once. To keep it from becoming too serious, he curled a lock of her hair around his fingers. “And what if I have to offer Chloe sexual favors to wrest a cake out of her?”\u003c/p\u003e\n\u003cp\u003eMarguerite raised a brow. “Are you trying to make me jealous?”\u003c/p\u003e\n\u003cp\u003e“Are you jealous at the thought?”\u003c/p\u003e\n\u003cp\u003eShe considered it. “I don’t… I guess I haven’t gotten as far as to think I have the right to be possessive with you.”\u003c/p\u003e\n\u003cp\u003eRaising her hand, he kissed it and bit her knuckles with sharp pressure, watching her eyes focus on the mark of his teeth into her skin, pain offered as a pleasure. “You have every right to be possessive. Because I sure as hell consider you mine.”\u003c/p\u003e\n\u003cp\u003e“Well, there goes the affair I’d planned with half the men in the neighborhood.\u003c/p\u003e\n\u003cp\u003eTyler…”\u003c/p\u003e\n\u003cp\u003e“I’ll ease up,” he promised. “Come on out to the back. Your present is there.”\u003c/p\u003e\n\u003cp\u003e“Where are Mac and Violet?”\u003c/p\u003e\n\u003cp\u003e“Out back as well. I have a pool here, too. They’re taking a swim before dinner.” He took her down the hallway, past an opulent dining room set for seven, through the sunroom and out a covered walkway flanked by blooming gardenia bushes. The walkway led to the enclosed pool area which currently had all the windows open to allow the fresh air.\u003c/p\u003e\n\u003cp\u003eAs they stepped in, a man was coming out of the pool. She registered that there were three other people in there with him, but could not immediately focus on anyone else as her senses were abruptly inundated with him. He was the type of submissive that always called to her. In his late twenties, with green eyes like sea glass, his streaked chestnut hair to mid-shoulders, his lips soft, curved pleasantly. The upper torso was well-muscled, a lean, taut body. He was completely naked, obvious as he walked up the steps at the shallow end, hand on the rail, water sluicing down his flat stomach over the groin area and long thighs.\u003c/p\u003e\n\u003cp\u003e“Marguerite.” Tyler nodded as the man approached. “This is Roland. It’s his pleasure to serve you this weekend in whatever manner you wish. He works at True Blue, but volunteered to spend the weekend with us because he enjoys the company of strong Mistresses.” He looked into her amazed face. “I give him to you, as your Master.\u003c/p\u003e\n\u003cp\u003eYou have my permission to enjoy him fully in my company.” She met his gaze. “Not alone.”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “I am possessive,” he reminded her, his gaze sweeping over her.\u003c/p\u003e\n\u003cp\u003e“And I love watching you as a Mistress.”\u003c/p\u003e\n\u003cp\u003eHe moved his touch up to her neck, caressing her, murmured in her ear so only she could hear him. “As your Master, I’d like to see you top him. Indulge yourself as you desire and let’s see how it goes. I never shared Nina with another man, wouldn’t countenance it. But this is different. I know the compulsion that drives you to be a Mistress, just as I know that your soul is mine. As mine is yours,” he added quietly. \u003c/p\u003e","sourceLink":"https://allnovel.net/mirror-of-my-soul-nature-of-desire-4/page-33.html","bookId":1909,"creation":"Oct 5, 2019 5:23:41 PM","modification":"Oct 5, 2019 5:23:41 PM"}
