{"id":78601,"no":4,"title":"Page 4","content":"\u003cp\u003e\"What message?\" Dee said, frowning.\u003c/p\u003e\n\u003cp\u003eThe psychic was still staring at Jenny intently. \"You\u0027ve got the look,\" she said. \"You\u0027ve seen them -the faery folk.\"\u003c/p\u003e\n\u003cp\u003eAudrey said sharply, \"The faery folk?\" In the paper house Audrey\u0027s worst nightmare had been a fairy tale. A story about the Erlking, a spirit who haunted the Black Forest and stole children. The Elf-king. Julian had played the part to perfection, had even claimed to be the real Erlking.\u003c/p\u003e\n\u003cp\u003eThe Shadow Men. The faery folk. Different names for different ages. Oh, God, Jenny thought, she knows the truth. I should be happy, she thought wildly. But there was a knot in her stomach.\u003c/p\u003e\n\u003cp\u003eThe woman was answering Audrey. \"The Elder Race. Some people have the gift of seeing them where everyone else only sees a wind in the grass, or a shadow, or a reflection of light.\"\u003c/p\u003e\n\u003cp\u003eSomething about the woman\u0027s tone brought Jenny up short. The psychic sounded too-pleased- about the subject. Not scared enough. \"What do they look like?\"\u003c/p\u003e\n\u003cp\u003eThe woman gave her a laughing glance. As if you didn\u0027t know. \"They\u0027re the most beautiful things imaginable,\" she said. \"Creatures of light and happiness. I frequently see them dancing at Malibu Creek.\" She held up one of her chains, and Jenny saw the charm, a beautiful young girl with gauzy wings and floating draperies.\u003c/p\u003e\n\u003cp\u003e\"Pixies in bluebells,\" Dee said, absolutely straight-faced. Jenny\u0027s muscles went slack. This woman didn\u0027t know anything about the Shadow Men. Just another kook.\u003c/p\u003e\n\u003cp\u003eThe psychic was still smiling. \"The message is: Vanished. They told me to tell you that.\"\u003c/p\u003e\n\u003cp\u003e\"Vanished? Oh,\" Jenny said. \"Well, thank you.\" She supposed it was as good a message as any, considering Summer\u0027s situation.\u003c/p\u003e\n\u003cp\u003e\"Vanished,\" the woman repeated. \"At least-I think that was it. Sometimes I only get the vowel sounds. It might have been-\" She hesitated, then shook her head and went back to her Mercedes.\u003c/p\u003e\n\u003cp\u003e\"For a moment there I thought she had something,\" Audrey murmured.\u003c/p\u003e\n\u003cp\u003eJenny grabbed a handful of flyers and a map. \"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eOutside, they made their plans. \"P.C.\u0027s house is at thirteen-twenty-two Ramona Street,\" Jenny said. She knew this by heart. It was the first place they had checked, along with Slug\u0027s house. Of course, they hadn\u0027t been able to search directly, but one of the kinder detectives had let them know that there was no paper house in either of the boys\u0027 homes.\u003c/p\u003e\n\u003cp\u003e\"Dee, you and Michael can start there and cover everything west over to, say, Anchor Street. Audrey and I can cover everything east over to where Landana turns into Sycamore. Remember, it\u0027s the girl we want now.\"\u003c/p\u003e\n\u003cp\u003e\"In other words we\u0027re canvassing the entire south side of town,\" Michael said with a groan. \"Door to door.\"\u003c/p\u003e\n\u003cp\u003e\"Obviously we won\u0027t cover it all today,\" Jenny said. \"But we\u0027ll keep at it until we do.\" She looked at Dee, who nodded slightly. Dee would keep Michael at it.\u003c/p\u003e\n\u003cp\u003eAudrey didn\u0027t look particularly happy, either \"We\u0027ve been to a lot of those houses before. What are we supposed to say when they tell us they already have flyers?\"\u003c/p\u003e\n\u003cp\u003eDee grinned. \"Tell them you\u0027re selling encyclopedias.\" She hustled Michael into the Bug.\u003c/p\u003e\n\u003cp\u003eAudrey shook her head as she and Jenny got back into the Spider and drove away. The top was down, and the wind blew stray wisps of copper-colored hail out of her chignon. Jenny shut her eyes, feeling the rushing air on her face.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t want to think about anything, not about the psychic, not about Zach, not about Tom. Especially not about Tom. Underneath she\u0027d had some faint hope he might show up at the Center after school. He was avoiding her, that was it.\u003c/p\u003e\n\u003cp\u003eHer nose and eyes stung. She wanted him with her. If she thought any more about him, about his hazel eyes with their flecks of green, about his warmth and his strength and his easy devil-may-care smile, she was going to cry.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go over by Eastman and Montevideo,\" she heard herself saying. The words just came out of her mouth, from nowhere.\u003c/p\u003e\n\u003cp\u003eAudrey cast her a spiky-lashed glance but turned south.\u003c/p\u003e\n\u003cp\u003eEastman Avenue, the scene of so many recent riots, was almost deserted. Jenny hadn\u0027t been there since the day of Tom\u0027s birthday, the day she\u0027d walked there to buy a party game. As they approached Montevideo Street, everything Jenny had experienced the last time she\u0027d been here-the blue twilight, the footsteps behind her, the fear-came back to her. She almost expected to see P.C. in his black vest and Slug in his flannels walking down the sidewalk.\u003c/p\u003e\n\u003cp\u003eAudrey turned the corner on Montevideo and stopped.\u003c/p\u003e\n\u003cp\u003eThe mural on the blank wall still showed a street scene. In the middle of the mural was a realistic-looking store with a sign reading: More Games. But it was just paint and concrete. Flat. There was no handle sticking out of the door.\u003c/p\u003e\n\u003cp\u003eBehind that blank wall she\u0027d met Julian, in a place that wasn\u0027t a real place after all.\u003c/p\u003e\n\u003cp\u003eScraps of paper lay in the street. One was the bright yellow of Summer\u0027s flyer.\u003c/p\u003e\n\u003cp\u003eJenny felt suddenly very hollow. She didn\u0027t know what she\u0027d expected to find here, or even what had made her come.\u003c/p\u003e\n\u003cp\u003eAudrey shivered. \"I don\u0027t like this place.\"\u003c/p\u003e\n\u003cp\u003e\"No. It was a bad idea.\"\u003c/p\u003e\n\u003cp\u003eThey drove north, backtracking. They were actually near Summer\u0027s house now, in the kind of neighborhood where cars tended to be slightly dented, on blocks, or in pieces in the side yard. The afternoon seemed brighter here, and on the sidewalks the usual kids with sun-bleached hair and freckled limbs or night-black hair and brown limbs were running around.\u003c/p\u003e\n\u003cp\u003eThey parked the car by George Washington Elementary School and put the top up.\u003c/p\u003e\n\u003cp\u003eAt every house the spiel was the same.\u003c/p\u003e\n\u003cp\u003e\"Hi, we\u0027re from the Summer Parker-Pearson Citizen\u0027s Search Committee. Can we give you a flyer ... ?\"\u003c/p\u003e\n\u003cp\u003eIf the people in the house looked nice, they tried to get invited in. Then came the transition from \"We\u0027re looking for Summer\" to \"We\u0027re looking for an important clue in her disappearance\"-meaning the paper house. And today, \"We\u0027re looking for somebody who might know something about her\"-meaning the Crying Girl with the long dark hair and haunted eyes.\u003c/p\u003e\n\u003cp\u003eMost of all, though, they tried to talk to kids.\u003c/p\u003e\n\u003cp\u003eKids knew things. Kids saw things. Usually the adults in the houses only listened politely, but the kids were always eager to help. They followed along on their bicycles, suggesting places to look, remembering that they thought they might have seen someone who could possibly have been Summer yesterday, or maybe it was the day before.\u003c/p\u003e\n\u003cp\u003e\"The paper house is really important, but it could be dangerous. Anybody could have picked it up, thinking it was a toy,\" Jenny told one nine-year-old while Audrey kept his mother occupied. The nine-year-old nodded, his eyes bright and alert. Behind him, on a cracked leather sofa, a girl of four or five was sitting with a dog-eared book on her lap.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s Nori. She can\u0027t really read yet.\"\u003c/p\u003e\n\u003cp\u003e\"I can, too.\" Tilting her face toward the book, although her eyes still remained on her brother, Nori said, \"Then Little Red Riding Hood says, \u0027Grandma, what big eyes you have.\u0027 Then the wolf says, \u0027The better to see you with, my dear.\u0027\"\u003c/p\u003e\n\u003cp\u003eJenny smiled at her, then turned back to the boy. \"So if you see it or the white box, don\u0027t touch it, but call the number on the flyer and leave a message for me.\"\u003c/p\u003e\n\u003cp\u003e\"... Grandma, what big ears you have... .\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll know what you mean if you say, \u0027I\u0027ve found it.\u0027\"\u003c/p\u003e\n\u003cp\u003eThe boy nodded again. He understood about things like clues and secret messages.\u003c/p\u003e\n\u003cp\u003e\"... The better to hear you with, my dear. ...\"\u003c/p\u003e\n\u003cp\u003e\"Or if one of your friends knows about a girl with dark hair that was good friends with P.C. Serrani-\"\u003c/p\u003e\n\u003cp\u003e\"... Grandma, what big teeth you have....\"\u003c/p\u003e\n\u003cp\u003eAudrey was finished with the mother. Jenny gave the boy a quick touch on the shoulder and turned to the door.\u003c/p\u003e\n\u003cp\u003e\"... The better to EAT you with, my dear!\" Nori shrieked suddenly, bolting up on the couch. Jenny whirled-and dropped her flyers. Nori was standing, eyes wide, mouth pulled into a grimace. For an instant Jenny saw, not a child, but a small, misshapen goblin.\u003c/p\u003e\n\u003cp\u003eThen the mother cried, \"Nori!\" and Jenny was jerked back to reality. She felt herself turn red as she gathered the flyers.\u003c/p\u003e\n\u003cp\u003eNori began to giggle. Jenny apologized. The mother scolded. Finally they got out of the house.\u003c/p\u003e\n\u003cp\u003e\"I am never going to have children,\" Audrey said, outside.\u003c/p\u003e\n\u003cp\u003eThey kept going. Some people were friendly, others were rude. A shirtless man laughed unkindly when they started the spiel about Summer and rasped, \"Did you check the mall?\" Almost all of them already had heard about the missing girl.\u003c/p\u003e\n\u003cp\u003eDinnertime came and went. They called their parents to say they\u0027d be out for a little longer, while it was still light.\u003c/p\u003e\n\u003cp\u003eJenny glanced sideways at Audrey, a little surprised. Audrey wasn\u0027t the suffering-in-silence type. Jenny had expected to have to cajole her to stay out this long.\u003c/p\u003e\n\u003cp\u003eThere was a lot more to Audrey than her glamour-magazine exterior let on.\u003c/p\u003e\n\u003cp\u003eThey came to a street where a lot of kids were playing. Jenny recognized the white-blond head of the one covering his eyes against a tree. It was Summer\u0027s ten-year-old brother.\u003c/p\u003e\n\u003cp\u003e\"Cam!\" she said, startled. He didn\u0027t hear her. He went on counting, leaning on his folded arms. Other kids were scattering, hiding in open garages, behind bushes, in ivy. Jenny recognized two more of them. One was Dee\u0027s little sister, Kiah, the other was her own younger brother, Joey.\u003c/p\u003e\n\u003cp\u003eThey came to play with Cam after dinner, she realized. It was a long way for Kiah, even on a bike.\u003c/p\u003e\n\u003cp\u003e\"What are they playing?\" Audrey asked.\u003c/p\u003e\n\u003cp\u003e\"It looks like cops and robbers.\" At Audrey\u0027s blank expression Jenny remembered. Audrey had grown up in every place but America; her father was with the diplomatic corps. If he hadn\u0027t retired early, she wouldn\u0027t be in California now.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a chase game. You capture the robbers and take them back to your home base as prisoners. Hey,\u003c/p\u003e\n\u003cp\u003ewatch out!\" Jenny caught a small figure that had erupted out of the nearby ivy, tripped, and gone flying. It was Kiah, and Cam was close on her heels.\u003c/p\u003e\n\u003cp\u003eKiah looked up. She was never going to be tall like Dee, but she had Dee\u0027s fine bones and wild, leaping beauty. Cam had hair like dandelion fluff, even lighter than Summer\u0027s. It made him look oddly defenseless, although Jenny knew he was a tough kid.\u003c/p\u003e\n\u003cp\u003eUnlike Summer, who hadn\u0027t had a tough sinew in her, Jenny thought. Summer had been as fragile as spun glass.\u003c/p\u003e\n\u003cp\u003eEver since the night of the Game, Jenny\u0027s emotions had been like boats bumping at a thick canvas barrier-cut off from her but still nudging. But suddenly, at the sight of Cam, they burst through. Grief for Summer. Guilt. Tears filled her eyes.\u003c/p\u003e\n\u003cp\u003eWhat on earth could she say to him? \"I\u0027m sorry\" was so inadequate it was pathetic.\u003c/p\u003e\n\u003cp\u003eOther kids were coming out of hiding at the sight of Audrey and Jenny, gathering around curiously. Jenny still couldn\u0027t speak. Audrey came to the rescue, improvising.\u003c/p\u003e\n\u003cp\u003e\"So what are you playing?\"\u003c/p\u003e\n\u003cp\u003e\"Lambs and monsters,\" Cam said. \"I\u0027m the monster.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. So how do you play it?\"\u003c/p\u003e\n\u003cp\u003eKiah spoke up. \"If you\u0027re a lamb you hide, and then the monster comes looking for you. And if he tags you, then you\u0027re captured and you have to go back to the monster lair. And you have to stay there until another lamb comes and lets you out-\"\u003c/p\u003e\n\u003cp\u003e\"Or until the monster eats you,\" Cam put in harshly.\u003c/p\u003e\n\u003cp\u003eKiah\u0027s eyes flashed. \"But he can\u0027t eat you until he\u0027s got all the lambs there. Ev-er-y sin-gle one.\"\u003c/p\u003e\n\u003cp\u003eCops and robbers, Jenny thought. With only one cop and lots of robbers. The new name seemed a little savage, though, and so did the look in Cam-the-monster\u0027s eyes. God, I wonder what it must be like for him at home, she thought.\u003c/p\u003e\n\u003cp\u003e\"Cam,\" she said. His hard blue eyes fixed on her. \"Cam, did your parents tell you what we said happened to Summer?\"\u003c/p\u003e\n\u003cp\u003eHe nodded tightly.\u003c/p\u003e\n\u003cp\u003e\"Well-\" Jenny had a feeling that Aba might not approve of what she was going to do next. But all these kids knew Cam, they cared. Jenny felt more of a connection here than she had anywhere else.\u003c/p\u003e\n\u003cp\u003e\"Well-I know it sounds crazy. I know your mom and dad don\u0027t believe it. But, Cam, it was the truth. We didn\u0027t hurt Summer, and we didn\u0027t mean to let anybody else hurt her. You just don\u0027t know how sorry-\" The tears spilled suddenly, embarrassingly. Cam looked away and Jenny tried to get a grip on herself.\u003c/p\u003e\n\u003cp\u003e\"And what we\u0027re doing now is trying to stop the person who hurt her from hurting anybody else,\" she whispered, feeling stupidly like somebody on TV- \"America\u0027s Most Wanted.\"\u003c/p\u003e\n\u003cp\u003eJoey had joined the group and was flushed to his yellow hair roots with the humiliation of having a teenage sister bawling on the sidewalk. But Cam\u0027s tight look eased slightly.\u003c/p\u003e\n\u003cp\u003e\"You mean all that stuff kids are saying about you guys looking for a cardboard house is true?\"\u003c/p\u003e\n\u003cp\u003e\"Are they saying that? Good.\" It\u0027s working, Jenny thought. The junior grapevine. There was something heartening in these kids\u0027 expressions. They weren\u0027t closed off like adults, but open, interested, speculative. \"Listen,\" she said. \"We\u0027re still looking for that house, and now we\u0027re looking for something else. A girl who was friends with P.C. Serrani.\" For the hundredth time that day she described the Crying Girl.\u003c/p\u003e\n\u003cp\u003eThe kids listened.\u003c/p\u003e\n\u003cp\u003e\"We really, really want to talk to her,\" Jenny said.\u003c/p\u003e\n\u003cp\u003eThen she explained why. Why they needed the girl and why they needed the house. She explained, more or less, about Julian. A watered-down version, but the truth.\u003c/p\u003e\n\u003cp\u003eWhen she finished, she let out a long breath-and saw something like determination coalescing in the steady young gazes. They\u0027d weighed her claims, and they were willing to give her the benefit of the doubt. Even Joey, who\u0027d been running away from her for the last two weeks, looked halfway convinced.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll look for the girl tomorrow,\" he said briefly. \"We\u0027ll talk to kids who\u0027ve got, like, brothers or sisters in junior high. Because they might know her.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly!\" Jenny said, pleased. She spared him the humiliation of being kissed by his sister in public. \"Just be careful. If you see the paper house, do not touch it.\"\u003c/p\u003e\n\u003cp\u003eThe last traces of doubt were wiped from the young faces, and there were grim nods. Her urgency had gotten through. She felt as if she\u0027d recruited a team of small private detectives.\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" she said, and, feeling it was time for a judicious retreat, she gestured Audrey toward the next house.\u003c/p\u003e\n\u003cp\u003e\"One more game,\" somebody behind her said, and somebody else said, \"But who\u0027s going to be It?\"\u003c/p\u003e\n\u003cp\u003e\"Cam, unless he can guess who puts the eye in,\" Kiah\u0027s sweet voice fluted. On the doorstep Jenny glanced toward the street.\u003c/p\u003e\n\u003cp\u003eCam was turned around, undergoing some elaborate ritual for picking the next It. \"I draw a snake upon your back,\" Kiah chanted, tracing a wiggly shape. \"Who will put in the eye?\"\u003c/p\u003e\n\u003cp\u003eSomebody lunged forward and poked Cam between the shoulder blades. \"Courtney!\" Cam shouted.\u003c/p\u003e\n\u003cp\u003e\"Wrong! You\u0027re the monster again!\"\u003c/p\u003e\n\u003cp\u003eThe door opened to Audrey\u0027s knocking. \"Yes?\"\u003c/p\u003e\n\u003cp\u003eJenny tried to tear her attention from the game. Something about it... and about that snake thing ... were all children\u0027s games that gruesome? And their stories? The better to eat you with, my dear....\u003c/p\u003e\n\u003cp\u003eMaybe kids know something adults don\u0027t know, Jenny thought, chilled, as a lady asked them into the house.\u003c/p\u003e\n\u003cp\u003eWhen they came out, the sky was periwinkle blue and losing its color to the east. The light was fading. The street was empty.\u003c/p\u003e\n\u003cp\u003eGood, Jenny thought, glad that Joey was on his way home-maybe even home by now.\u003c/p\u003e\n\u003cp\u003e\"Want to finish this block?\" Audrey said, surprising her.\u003c/p\u003e\n\u003cp\u003e\"I-sure. Why not?\"\u003c/p\u003e\n\u003cp\u003eThey worked their way down one side of the street and up the other. Jenny could feel herself getting more and more perfunctory at each house. The sky was now midnight blue and the light had gone. She didn\u0027t know why, but she was starting to feel anxious.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s stop here,\" she said when there were still three more houses to go. \"I think we should be getting back now.\"\u003c/p\u003e\n\u003cp\u003eThe midnight blue slowly turned to black. The streetlights seemed far apart, and Jenny was reminded suddenly of the little islands of light in Zach\u0027s nightmare. A nightmare where a hunter had chased them through endless darkness.\u003c/p\u003e\n\u003cp\u003e\"Hey, wait up!\" Audrey protested.\u003c/p\u003e\n\u003cp\u003eJenny grabbed her arm. \"No, you hurry up. Come on, Audrey, we have to get back to the car.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean? What\u0027s wrong with you?\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. We just have to get back!\" A primitive warning was going off in Jenny\u0027s brain. A warning from the time when girls took skin bags to get water, she thought wildly, remembering something she\u0027d sensed with Julian. A time when panthers walked in the darkness outside mud huts. When darkness was the greatest danger of all.\u003c/p\u003e\n\u003cp\u003e\"Jenny, this is just so totally unlike you! If there was anything to be scared about, I\u0027d be scared of it,\" Audrey said, resisting as Jenny dragged her along. \"You\u0027re the one who always used to go off into the bad parts of town-\"\u003c/p\u003e\n\u003cp\u003e\"Yes, and look where it got me!\" Jenny said. Her heart was pounding, her breath coming fast. \"Come on!\"\u003c/p\u003e\n\u003cp\u003e\"-and I hate to tell you, but I can\u0027t run in these shoes. They\u0027ve been killing me for hours now.\"\u003c/p\u003e\n\u003cp\u003eThe flickering streetlight showed Audrey\u0027s tight Italian pumps. \"Oh, Audrey, why didn\u0027t you say something?\" Jenny said in dismay. Something made her jerk her head around, looking behind her. Something rustled in the oleanders.\u003c/p\u003e\n\u003cp\u003eWhere everyone else only sees a wind in the grass, or a shadow...\u003c/p\u003e\n\u003cp\u003e\"Audrey, take your shoes off. Now!\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t run barefoot-\"\u003c/p\u003e\n\u003cp\u003e\"Audrey, there is something behind us. We have to get out of here, fast. Now, come on!\" She was pulling Audrey again almost before Audrey had gotten the pumps off. Walking as fast as she could without running. If you run, they chase you, she thought wildly. But she wanted to run.\u003c/p\u003e\n\u003cp\u003eBecause there was something back there. She could hear the tiny sounds. It was tracking them, behind the hedge of overgrown bushes on her right. She could feel it watching them.\u003c/p\u003e\n\u003cp\u003eMaybe it\u0027s Cam or one of the other kids, she thought, but she knew it wasn\u0027t. Whatever it was, she knew in her heart that it wanted to hurt them.\u003c/p\u003e\n\u003cp\u003eIt was moving quickly, lightly, keeping pace with them, maybe twenty feet back. \"Audrey, hurry___\"\u003c/p\u003e\n\u003cp\u003eInstead, Audrey stopped dead. Jenny could just make out her look of fear as she stood, listening.\u003c/p\u003e\n\u003cp\u003e\"Oh, God, there is something!\"\u003c/p\u003e\n\u003cp\u003eThe rustling was closer.\u003c/p\u003e\n\u003cp\u003eWe should have run for a house, Jenny realized. Her one thought had been to get to the car. But now they had passed the last houses before the school grounds, and Audrey\u0027s car was too far ahead. They weren\u0027t going to make it.\u003c/p\u003e\n\u003cp\u003e\"Come on!\" Don\u0027t run don\u0027t run don\u0027t run, the hammering inside Jenny said. But her feet, clammy in their summery mesh loafers, wanted to pound down the sidewalk.\u003c/p\u003e\n\u003cp\u003eIt was gaining on them.\u003c/p\u003e\n\u003cp\u003eIt can\u0027t be a persona person would show above those hedges, Jenny thought, casting a look behind her. Suddenly Jenny\u0027s brain showed her a terrible picture: little Nori scurrying along spiderlike behind the bushes, her face contorted in a grimace.\u003c/p\u003e\n\u003cp\u003eDon\u0027t run don\u0027t run don\u0027t run ...\u003c/p\u003e\n\u003cp\u003eThe car was ahead, looking black instead of red in the darkness beyond a streetlight. Jenny seemed to hear eerily rapid breath behind her.\u003c/p\u003e\n\u003cp\u003eDontrundontrundontrundontrun ...\u003c/p\u003e\n\u003cp\u003e\"Get the keys,\" she gasped. \"Get the keys, Audrey-\"\u003c/p\u003e\n\u003cp\u003eHere was the car. But the rustling was right beside Jenny now, just on the other side of the hedge. It was going to come through the hedge, she thought. Right through the hedge and grab her... .\u003c/p\u003e\n\u003cp\u003eAudrey was fumbling in her purse. She\u0027d dropped her shoes. Jenny grabbed the car door handle.\u003c/p\u003e\n\u003cp\u003e\"Audrey!\" she cried, rattling it.\u003c/p\u003e\n\u003cp\u003eAudrey flung the contents of her purse on the sidewalk. She scattered the pile with a desperate hand, seized the keys.\u003c/p\u003e\n\u003cp\u003e\"Audrey! Get it open!\" Jenny watched in agony as Audrey ran to the driver\u0027s side of the car, leaving the contents of her purse scattered.\u003c/p\u003e\n\u003cp\u003eBut it was too late. There was a crashing in the hedge directly behind Jenny.\u003c/p\u003e\n\u003cp\u003eAt the same moment a dark shape reared up from the shadows on the sidewalk in front of her. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-forbidden-game-the-chase-the-forbidden-game-2/page-4.html","bookId":2435,"creation":"Oct 5, 2019 4:10:26 PM","modification":"Oct 5, 2019 4:10:26 PM"}
