{"id":108553,"no":10,"title":"Page 10","content":"\u003cp\u003eThat’s fine by me, Abraham says. I had just about enough of the silent life.\u003c/p\u003e\n\u003cp\u003eYou seemed to get along just fine.\u003c/p\u003e\n\u003cp\u003eI been on my best behaviour.\u003c/p\u003e\n\u003cp\u003eYou done all right.\u003c/p\u003e\n\u003cp\u003eAnyway, I don’t much care for the witchy shit they got goin on. I ain’t in all my life seen a slug pass up a meal. That girl’s cursed.\u003c/p\u003e\n\u003cp\u003eCursed? Moses says. The friar thinks she’s blessed.\u003c/p\u003e\n\u003cp\u003eThese religious types think everything’s blessed. Dump a bucket of shit on their head, and they’ll thank God for it not being two buckets. But I’ll tell you something.\u003c/p\u003e\n\u003cp\u003eAbraham points the toothpick at his brother to make his point.\u003c/p\u003e\n\u003cp\u003eI’ll tell you this, he goes on. Whatever hell those walking dead came out of, I ain’t interested in gettin cozy with the girl they’re afraid of.\u003c/p\u003e\n\u003cp\u003eYou got a vision, Abe. There’s no denyin it. The way you see the world – those eyes of yours ought to be enshrined somewhere important.\u003c/p\u003e\n\u003cp\u003eAbraham casts a suspicious gaze at his brother, as if unsure of the true thrust of the remark – but he grins proudly despite himself.\u003c/p\u003e\n\u003cp\u003eBut it don’t make any difference, Moses says. Because tomorrow when we leave, we’re takin her with us.\u003c/p\u003e\n\u003cp\u003eWho?\u003c/p\u003e\n\u003cp\u003eThe Vestal.\u003c/p\u003e\n\u003cp\u003eWhat in the hell would we do that for? If you want to steal some holy bride, why not go for one of the other ones? Maybe one that knows how to cook.\u003c/p\u003e\n\u003cp\u003eWe ain’t stealin her.\u003c/p\u003e\n\u003cp\u003eThat Ignatius ain’t gonna be very happy with you stealing his cannongirl.\u003c/p\u003e\n\u003cp\u003eI said we ain’t stealing her. The friar asked us to take her somewhere, and we’re gonna take her.\u003c/p\u003e\n\u003cp\u003eWhere?\u003c/p\u003e\n\u003cp\u003eNorth.\u003c/p\u003e\n\u003cp\u003eHow far north?\u003c/p\u003e\n\u003cp\u003eColorado Springs.\u003c/p\u003e\n\u003cp\u003eColorado? Shit. Is it gonna be snow on the ground?\u003c/p\u003e\n\u003cp\u003eIt’s a likelihood.\u003c/p\u003e\n\u003cp\u003eYou know I ain’t good with the inclement weather. I got bad circulation in my legs.\u003c/p\u003e\n\u003cp\u003eYou’ll endure.\u003c/p\u003e\n\u003cp\u003eWhat’s in Colorado anyway?\u003c/p\u003e\n\u003cp\u003eA citadel.\u003c/p\u003e\n\u003cp\u003eA what now?\u003c/p\u003e\n\u003cp\u003eA church.\u003c/p\u003e\n\u003cp\u003eAnother church?\u003c/p\u003e\n\u003cp\u003eThat’s right.\u003c/p\u003e\n\u003cp\u003eJesus, we’re spendin a lot of time with the gospel. What happens if I come out the other end all godified and priesty? What happens if I want to take the vow?\u003c/p\u003e\n\u003cp\u003eMoses chuckles.\u003c/p\u003e\n\u003cp\u003eI wouldn’t worry about it.\u003c/p\u003e\n\u003cp\u003eAbraham is quiet for a while. He picks his teeth with the wood splinter and looks thoughtfully at the beams running across the roof of the stable.\u003c/p\u003e\n\u003cp\u003eWhat’re we doin this for, Mose? he asks. Really now.\u003c/p\u003e\n\u003cp\u003eIt’s a mission, Moses says. We wanted a mission and we got one.\u003c/p\u003e\n\u003cp\u003eAbraham nods.\u003c/p\u003e\n\u003cp\u003eBut let’s be clear on this, Abraham says. You were the one that wanted a mission. It was never me.\u003c/p\u003e\n\u003cp\u003eMoses nods.\u003c/p\u003e\n\u003cp\u003eFair enough, he says. My mission, then.\u003c/p\u003e\n\u003cp\u003eAbraham considers a while longer.\u003c/p\u003e\n\u003cp\u003eAll right then, he says finally. I’ll come along with you on your mission. It’s a brother’s duty, ain’t it?\u003c/p\u003e\n\u003cp\u003eAnd later, well past midnight when Moses cannot sleep, he rises from the crib and steals out of the stable to stand under the coal-black sky and listen to the shrill cricket-song stretched taut and incontrovertible over the desert.\u003c/p\u003e\n\u003cp\u003eHe sits heavily on one of the picnic tables and folds his hands as though waiting politely for someone to bring him sustenance. His beard is dark and heavy.\u003c/p\u003e\n\u003cp\u003eSoon someone does come. It is the Vestal Amata, still dressed in her white robes, and she sits down across from him and looks into his eyes.\u003c/p\u003e\n\u003cp\u003eHe has not been, for many years, the kind of man whom a woman approaches. It used to be different, long ago, before things changed. Then he was cleanshaven, tall but still lithe. He knew how to be playful. He knew how to juggle oranges found underneath a laden orange tree. Now he has forgotten much of who he was before. Now he stomps and rages and draws lines he dares people not to cross. He is a man of hard laws and hard action, a man sharpened on the grit of constant violence. He is a barbarian, he knows.\u003c/p\u003e\n\u003cp\u003eSo he does not know what to make of a woman who approaches him alone in the middle of the night. He suspects again this Vestal – her slightly sneering mouth, her red hair, her eyes that do not look away in fright at the world and its barbaric things.\u003c/p\u003e\n\u003cp\u003eWe’re taking you, he says to her. My brother and me. We’re settin out tomorrow.\u003c/p\u003e\n\u003cp\u003eIgnatius told me, says the Vestal.\u003c/p\u003e\n\u003cp\u003eShe confronts him with her obstinate silence. He does not know whether he seeks refusal or gratefulness, but he finds that he has no gambit against the woman who does not reveal her game.\u003c/p\u003e\n\u003cp\u003eSunrise, he says. Just after sunrise.\u003c/p\u003e\n\u003cp\u003eThat’s fine, she says.\u003c/p\u003e\n\u003cp\u003eColorado, he says. That’s where we’re goin. I don’t know if the friar told you. It’s a citadel.\u003c/p\u003e\n\u003cp\u003eHe told me.\u003c/p\u003e\n\u003cp\u003eIt’s in the mountains. It’ll be cold. Bring what you have. We’ll make room.\u003c/p\u003e\n\u003cp\u003eFine.\u003c/p\u003e\n\u003cp\u003eWe’ll keep you out of harm.\u003c/p\u003e\n\u003cp\u003eThat’s fine.\u003c/p\u003e\n\u003cp\u003eShe deflects his words easily and looks at him as though she is the one trying to unlock his secrets, as opposed to the other way around.\u003c/p\u003e\n\u003cp\u003eHe stands and begins to walk away, but he can feel her eyes on his back – and large as he is, he feels delicate and frail.\u003c/p\u003e\n\u003cp\u003eHey, she calls to him.\u003c/p\u003e\n\u003cp\u003eHe stops and turns to face her but says nothing.\u003c/p\u003e\n\u003cp\u003eYou and your brother, she says. Are you holy men too? Or just hired guns?\u003c/p\u003e\n\u003cp\u003eHe is no expert of locution, but her words seem different now than they were earlier in the day. Perhaps she is a phantasm – her night form and her day form not the same.\u003c/p\u003e\n\u003cp\u003eBut her question unsettles him. He does not know how to answer it. So he replies in kind.\u003c/p\u003e\n\u003cp\u003eHow bout you? he asks. You an authentic miracle of God’s holy grace – or just a hoax?\u003c/p\u003e\n\u003cp\u003eShe smiles at him now – and now all pretence of purity is gone. What replaces it in her expression is something conspiring and downright lascivious.\u003c/p\u003e\n\u003cp\u003eAll right, Mosey, she says. Let’s get out of here and play for a while on the big checkerboard. Maybe we’ll both find out what’s what.\u003c/p\u003e\n\u003cp\u003eSo he leaves her there, clad in her white robes, her red hair spilling lurid on her shoulders, her eyes like false gemstones – and, too, like a fluid and perverse treachery, her curving lips.\u003c/p\u003e\n\u003cp\u003eThough the sun is not yet risen before the commotion begins.\u003c/p\u003e\n\u003cp\u003eThere is a man’s voice, loud – spitting and thick, as though the tongue were too big for the mouth.\u003c/p\u003e\n\u003cp\u003eWe’ll burn it! the voice calls. We’ll burn the whole goddamn place to the ground!\u003c/p\u003e\n\u003cp\u003eMoses rises, kicks his brother awake and moves to the stable door to look out. There’s nothing to see except the parishioners gathering in fearful huddles around the courtyard. The voice, he realizes when he hears it again, is coming from outside the perimeter wall – at the front gate.\u003c/p\u003e\n\u003cp\u003eOpen the goddamn doors! If she’s in there, we’re takin her. If she ain’t, we got no truck with you all. It can go quiet, or it can go rough. Your choice.\u003c/p\u003e\n\u003cp\u003eThen Ignatius is there, dashing around the corner of the building with the Vestal Amata in tow. The expression on the woman’s face is equal parts fear and anger.\u003c/p\u003e\n\u003cp\u003eI ain’t goin back with them, she says under her breath. Ignatius doesn’t seem to hear her, and the words are directed to no one in particular. It is a personal vow to herself and nothing more.\u003c/p\u003e\n\u003cp\u003eIt’s the man Fletcher, Ignatius says to Moses. He’s back. The whole carnival of them. You have to go now. Leave by the back.\u003c/p\u003e\n\u003cp\u003eAbe, let’s go, Moses says, gathering his satchel and weapons. Show us where to go, he says to Ignatius.\u003c/p\u003e\n\u003cp\u003eThe monk gestures for them to follow and leads them around the chapel itself to a place where barrels are stacked against the back wall and can be climbed upon. Moses goes up first until he can see over the top of the wall. It’s clear.\u003c/p\u003e\n\u003cp\u003eDon’t worry about us, Ignatius says to reassure them. They won’t bother us if she’s not here.\u003c/p\u003e\n\u003cp\u003eIt did not occur to him, until the monk Ignatius uttered this last, that he should be concerned about defending the residents of the mission. He did not think of it at all.\u003c/p\u003e\n\u003cp\u003eAnd so it is that he is no hero by nature. And for what cause, then, is he a warrior?\u003c/p\u003e\n\u003cp\u003eHand her up, Moses says to his brother. His brother lifts the Vestal Amata into his arms, and Moses hoists her to the top of the wall. Then he tosses his satchel over the back and turns to leap down himself. But before he goes, he looks back over the mission. On the opposite side there’s a glow against the sky, the front of the structure illuminated by the headlights of Fletcher’s convoy. It is eerie, the blaze and fracas at the intersection of people’s lives.\u003c/p\u003e\n\u003cp\u003eHe turns and looks down on Ignatius.\u003c/p\u003e\n\u003cp\u003eI’ll protect her, he says to the monk. But I ain’t a good man. You understand that?\u003c/p\u003e\n\u003cp\u003eIt doesn’t matter, the monk replies. Partly strong, partly broken. It’s the same with everything. Just go.\u003c/p\u003e\n\u003cp\u003eAnd they do.\u003c/p\u003e\n\u003cp\u003eMoses drops down on the other side of the wall then helps the Vestal Amata to the ground. Abraham comes last, leaping down with a yee-ha like a cowboy and tumbling in the weeds. He wears a mad smile on his face, as though there is no difference in his economy between fear and frolic. He stands and dusts off his hands.\u003c/p\u003e\n\u003cp\u003eThe Moses realizes something.\u003c/p\u003e\n\u003cp\u003eThe car, he says.\u003c/p\u003e\n\u003cp\u003eWhat about it? Abraham asks.\u003c/p\u003e\n\u003cp\u003eIt’s around front with them.\u003c/p\u003e\n\u003cp\u003eSo what? We’ll find us another one.\u003c/p\u003e\n\u003cp\u003eIt’s got our things in it.\u003c/p\u003e\n\u003cp\u003eNothin we can’t replace.\u003c/p\u003e\n\u003cp\u003eMoses thinks about the weapon in the trunk, the bladed mace made for him by the tinkerer Albert Wilson Jacks. Abraham is right – most things in the world are replaceable, but that is not one of them. And this is a time of cherishing unique things.\u003c/p\u003e\n\u003cp\u003eWe ain’t leaving without our things, Moses says.\u003c/p\u003e\n\u003cp\u003eAbraham looks off into the distance, as though he would rush headlong into it were he unleashed to do so.\u003c/p\u003e\n\u003cp\u003eAll right, he says. So what’s your suggestion?\u003c/p\u003e\n\u003cp\u003eThen, suddenly, there’s another voice behind them, a man. He has crept around the corner of the wall while they were talking, and now he aims a gun at them.\u003c/p\u003e\n\u003cp\u003eIf it’s any help, he says to the three of them now, here’s my suggestion.\u003c/p\u003e\n\u003cp\u003eThe gun in his hand fires, and Moses’ brother Abraham cries out and falls to the ground.\u003c/p\u003e\n\u003cp\u003eFive\u003c/p\u003e\n\u003cp\u003eAn Injury, a Murder and a Hostage \" Fletcher \" A Test of Mettle \" A City Hotel \" A Jar of Olives \" An Operation \" A Note of Farewell \" A Search \" Fountain Hills \" A Bandit Camp \" Rescue and Reclothing \" A Mountain Stream \" Mademoiselle from Armentières \" Interlude \" A Bronze Disc \u003c/p\u003e","sourceLink":"https://allnovel.net/exit-kingdom-reapers-2/page-10.html","bookId":2517,"creation":"Oct 5, 2019 11:22:34 PM","modification":"Oct 5, 2019 11:22:34 PM"}
