{"id":108568,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThen, in the distance, they see the spires of the structure. There are seventeen of them lined up in a row, grey spears standing ten storeys tall against the grey sky. It is unlike anything Moses has ever seen before. Dangerous is what it looks like, a structure of sharp steel edges and spikes – looking so like a weapon that Moses imagines it swung by one vicious giant against the jugular of another. Or a row of monstrous teeth, calcified to pale white – the petrified jaw bone of some ancient dragon.\u003c/p\u003e\n\u003cp\u003eJesus, Moses says. That don’t look like any cathedral I’ve ever been in.\u003c/p\u003e\n\u003cp\u003eMoses, please, says the Vestal Amata and takes his arm at the shoulder. The snow is collected on her choppy red hair – as though the winter itself would make her disappear.\u003c/p\u003e\n\u003cp\u003eCome on, he says. I been around a long time, and if there’s one thing I learned it’s that the things that look most dangerous usually ain’t. It’s the ridiculous-lookin things you got to watch out for.\u003c/p\u003e\n\u003cp\u003eSo they cross the courtyard, holding their arms before their faces to block the wind and snow. They are not dressed for this weather, and Moses can feel his beard icing up.\u003c/p\u003e\n\u003cp\u003eThey go around the side of the chapel. A ramp leads up to the glowing doors like the protruded tongue of a sleeping beast, and they climb it. They enter through the wide double doors and find themselves in a huge hall lined with pews – the buttresses of the seventeen spires creating a row of triangular ribs inside that gives you the impression of having fallen into the belly of a beast. But there is an odd violet glow in the place, a perverse warmth that does not seem to jibe with the bitter grey outside.\u003c/p\u003e\n\u003cp\u003eThen an old man approaches them. He wears a suit and tie and moves with surprising alacrity from some alcove in the side of the place across a line of pews and up the aisle towards them. It is the Pastor Whitfield, and he introduces himself with a smile.\u003c/p\u003e\n\u003cp\u003eYou are seeking sanctuary, maybe? the old man asks. We welcome all.\u003c/p\u003e\n\u003cp\u003eThat’s nice, Pastor, says Moses. But I’m just carryin her for a friend. A monk who goes by Ignatius.\u003c/p\u003e\n\u003cp\u003eThe old man smiles widely and claps his hands together.\u003c/p\u003e\n\u003cp\u003eIgnatius! he says. A dear old friend of mine. I’m so pleased to hear he is still with us. Are you part of his congregation?\u003c/p\u003e\n\u003cp\u003eUs? Moses says. No. Well, I ain’t at least. He told me to bring you her. She’s a Vestal.\u003c/p\u003e\n\u003cp\u003eThe old man looks at the girl with the cropped hair and smiles benignantly.\u003c/p\u003e\n\u003cp\u003eA Vestal, he says. I’m not sure I understand. She’s . . .\u003c/p\u003e\n\u003cp\u003eShe’s special, Moses says.\u003c/p\u003e\n\u003cp\u003eWe’re all of us special in one way or another. I’m sure this young woman—\u003c/p\u003e\n\u003cp\u003eSpecial as in the slugs don’t want her, Moses blurts out. The man’s kindness makes him nervous – along with the purple glow of the place, the sense of peace, the downright civilized tone of it all. He is unused to the niceties that come along with comfort and safety.\u003c/p\u003e\n\u003cp\u003eThey don’t— the old man begins, but stutters. They don’t—\u003c/p\u003e\n\u003cp\u003eThat’s right, Moses confirms. They don’t want her. It could be she’s an angel or somethin. At least that’s what the friar speculated.\u003c/p\u003e\n\u003cp\u003eYou mean, the pastor says, she’s immune?\u003c/p\u003e\n\u003cp\u003eImmune? Moses says and looks to the Vestal. I don’t know if you’d call it immune. If she died would she not come back? Beats me. But they’re not interested in makin her a meal. I reckon we could give you a demonstration if you got any slugs around. I don’t know if it means anything.\u003c/p\u003e\n\u003cp\u003eIf what you say is true, sir, says the pastor, then this young lady means a great deal indeed. But maybe more to science than to the Church. Please follow me. I would like to introduce you to some of my friends.\u003c/p\u003e\n\u003cp\u003eMoses doesn’t like being called sir. He can’t remember the last time it was done. It fits him ill. He longs suddenly for the barren wilderness, the brokedown country roads, the collapsing structures, the wandering dead. It is there, in that place of ragged leftovers, that he knows how to behave.\u003c/p\u003e\n\u003cp\u003eBut the old man seems kindly, and he offers them coffee, which Moses hasn’t had the delight of in a long time, and he loans them coats to wear as they cross the wide expanse of the snowy courtyard again. And so he follows the man, and the Vestal, still skittish, follows Moses. And when they are inside the buildings of the compound it is almost possible to forget that the world ever became the wilderness it did.\u003c/p\u003e\n\u003cp\u003eIt is a community. A whole functional community, clean and calm behind guarded electrical fences and concrete walls. There are soldiers, yes, marching with neat precision, but there are others, too. Civilians to be observed in the glowing windows of bunkhouses, even children. Technicians tinkering with machines, sitting in front of computer monitors. And scientists and doctors walking busily to and fro in white lab coats.\u003c/p\u003e\n\u003cp\u003eMoses wonders if this is the order he has been craving – if this is what order looks like. It has been so long. So long. He keeps a hand near a pistol on his belt in case of a trap. He looks warily around corners before he turns them so that he won’t be taken by surprise. The Vestal, too, seems to wither under the fluorescent lamps lining the ceilings of the compound. She cowers against Moses’ chest.\u003c/p\u003e\n\u003cp\u003eStrange, he thinks. The girl has been through so much. She has been beaten and lost and whored and imprisoned and broken and put back together – but she has never been simply safe. It must taste sour to her. Unnatural.\u003c/p\u003e\n\u003cp\u003eYes, Moses thinks, that is what the girl must feel.\u003c/p\u003e\n\u003cp\u003eThey are led by the pastor to a research wing of the compound and introduced to men and women who are cordial and businesslike. They smile politely and disbelievingly when Moses tells them about the Vestal. But then the Vestal does give a demonstration, three soldiers standing by ready to shoot the female slug in the head when she goes for the girl. But she doesn’t. The Vestal walks right up to the slug and stands before her. In the bright lights of the lab, everyone watches as the two lock curious, pitying and befuddled eyes. A long string of drool falls from the lip of the dead woman but she makes no move to wipe it away. Then Moses sees the Vestal’s lips move, as though she were speaking to the slug – just briefly, a phrase. But he is standing behind glass with the scientists and cannot hear what she says. Later he asks one of the soldiers who was in the room with the Vestal.\u003c/p\u003e\n\u003cp\u003eWhat did she say? Moses asks. To the slug, I mean.\u003c/p\u003e\n\u003cp\u003eThe soldier shrugs, still stunned by the demonstration.\u003c/p\u003e\n\u003cp\u003eShe said it soft, the soldier says. I couldn’t really hear it. But it sounded like, Where are you?\u003c/p\u003e\n\u003cp\u003eAfter the demonstration, the scientists sit the Vestal down and proceed to ask her a series of questions, many of which have to do with the things she has eaten or the drugs she has taken or the places she has been.\u003c/p\u003e\n\u003cp\u003eWhile the interview is taking place, the Vestal keeps glancing over at Moses, who nods seriously. It is a reassuring nod, but also one that says she is obliged to continue.\u003c/p\u003e\n\u003cp\u003eAfter a while, Pastor Whitfield himself approaches the desk where the scientists are talking with the Vestal, and he suggests that they give the girl a break.\u003c/p\u003e\n\u003cp\u003eShe’s travelled a long way to be here, he says to the others. Let’s give her some supper and some time to herself. Can we resume at another time?\u003c/p\u003e\n\u003cp\u003eThe scientists agree and begin to discuss their notes among themselves. Whitfield takes Moses and the Vestal to a dining hall, where they eat hungrily. Around them, at other tables, are civilians who do not even notice the newcomers. This place, it must host many travellers. Children run around the tables, screaming happily, their cries echoing from the raftered ceiling. It is nice, this place, and yet Moses winces as though prickled by the sounds of joy.\u003c/p\u003e\n\u003cp\u003eHow do you enjoy our food, my dear? Whitfield asks the Vestal.\u003c/p\u003e\n\u003cp\u003eIt’s lovely, thank you, says the Vestal in her most formal and subservient voice.\u003c/p\u003e\n\u003cp\u003eThen she excuses herself to the restroom.\u003c/p\u003e\n\u003cp\u003ePastor, Moses asks when she has gone. You’re a man of God.\u003c/p\u003e\n\u003cp\u003eI am.\u003c/p\u003e\n\u003cp\u003eA true man of God?\u003c/p\u003e\n\u003cp\u003eThe pastor smiles gently.\u003c/p\u003e\n\u003cp\u003eI am a man of a true God, he says. We all endeavour to be true men, but our successes on that front aren’t to be measured here in this place.\u003c/p\u003e\n\u003cp\u003eMoses considers this and finds it a fair response.\u003c/p\u003e\n\u003cp\u003eAnd this place, he says to the old man. It’s safe?\u003c/p\u003e\n\u003cp\u003eAs safe as any I’ve—\u003c/p\u003e\n\u003cp\u003eFor her, I mean.\u003c/p\u003e\n\u003cp\u003eI see. You wish to be reassured that we will not hurt her. Because the girl has been hurt enough, yes? For someone who identifies himself simply as her delivery man, you are generous to be concerned about her. I assure you, Mr Todd, we are not in the business of hurting people. We are a sanctuary here. There are still some of those left, you will be happy to hear.\u003c/p\u003e\n\u003cp\u003eMoses nods.\u003c/p\u003e\n\u003cp\u003eOne more thing, he says.\u003c/p\u003e\n\u003cp\u003eWhitfield opens his hands palms up as if to offer himself for service.\u003c/p\u003e\n\u003cp\u003eWhen I told you about her, Moses says, you took her straight to the doctors.\u003c/p\u003e\n\u003cp\u003eThe pastor nods.\u003c/p\u003e\n\u003cp\u003eIs that cause—\u003c/p\u003e\n\u003cp\u003eMoses starts to ask his question but stops short and looks around as though someone were spying on them. He shifts and leans in closer to the pastor and continues.\u003c/p\u003e\n\u003cp\u003eIs that cause you don’t believe she’s holy? Cause you believe it’s just a thing with her body rather than her soul?\u003c/p\u003e\n\u003cp\u003eThe pastor smiles, folds his hands and leans forward as if he would meet Moses in conspiracy over the tabletop.\u003c/p\u003e\n\u003cp\u003eI’m a man of God, says Whitfield. You said so yourself. It’s my business to believe that God has a hand in everything. It’s an article of my faith that things are the way they are because they are supposed to be that way. Is the girl divine? Absolutely. And so are we all.\u003c/p\u003e\n\u003cp\u003eBut—\u003c/p\u003e\n\u003cp\u003eBut the two things are not mutually exclusive, the pastor continues. Her body may have some divinity it can share with the rest of us. The soul, the body . . .\u003c/p\u003e\n\u003cp\u003eWhitfield waves a hand as if to dismiss them.\u003c/p\u003e\n\u003cp\u003e. . . Our desire to distil one from the other is a child’s game. For good or bad, you are your appetites as well as your expiations. You are just as much what you would eat as what you do eat. Look around you. The dead risen. The body has its harmony, too. Where is the soul?\u003c/p\u003e\n\u003cp\u003eWhitfield knocks against his own sternum.\u003c/p\u003e\n\u003cp\u003eRight here, he says. In our playful and meagre guts.\u003c/p\u003e\n\u003cp\u003eThe pastor sits back, and so does Moses, considering what Whitfield has said. After a few moments of silence, Moses speaks. \u003c/p\u003e","sourceLink":"https://allnovel.net/exit-kingdom-reapers-2/page-25.html","bookId":2517,"creation":"Oct 5, 2019 11:22:34 PM","modification":"Oct 5, 2019 11:22:34 PM"}
