{"id":108550,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBut the girl leans over and whispers in Abraham’s ear. Moses has crept close enough that he can hear the words himself.\u003c/p\u003e\n\u003cp\u003eThe girl says, I don’t always hush like I’m supposed to.\u003c/p\u003e\n\u003cp\u003eAbraham laughs out loud, pats the girl on the head and stands up again.\u003c/p\u003e\n\u003cp\u003eAtta girl, he says. Obeying too much’ll make you soft-headed.\u003c/p\u003e\n\u003cp\u003eThe girl scurries away, and Abraham turns to find his brother just behind him. He must notice something untrusting in Moses’ expression, because his own grows dark and spiteful.\u003c/p\u003e\n\u003cp\u003eIt ain’t blood in everything you see, Abraham says. How about trying to wipe your eyes clean?\u003c/p\u003e\n\u003cp\u003eMoses says nothing, and he watches his brother walk off around to the front of the church.\u003c/p\u003e\n\u003cp\u003eAnd so, long after the sun sets and the residents of the Mission San Xavier del Bac have gone to sleep and the snakes have emerged from their nests to warm themselves on the stones that still hold the heat of the day, then does Moses, who has trouble sleeping, wander the compound and find the monk Ignatius kneeling in prayer at the altar of the church. He tries to retreat quietly, but his unwieldy body crashes into a wooden pew and sends screeching disharmony to all corners of the cruciform structure.\u003c/p\u003e\n\u003cp\u003eSorry, friar, Moses says and continues to back away.\u003c/p\u003e\n\u003cp\u003eDon’t apologize, says Ignatius, rising from his knees and standing with his hands folded. At this hour it’s only you and me and God. Please don’t look so stricken. Stay if you like. Sinner though I am, I look forward to the times when I can exchange words.\u003c/p\u003e\n\u003cp\u003eThe harlequin Albert Wilson Jacks – he too was a man of observance and faith. And so Moses finds himself again, for the second night in a row, engaged in late and lonely palaver with a man of holy demeanour. He sits down gently on the wooden pew, and Ignatius sits near him, the two men facing forwards, gazing at the ornate golden interior of the apse.\u003c/p\u003e\n\u003cp\u003eWhen you pray, Moses asks, you pray without words?\u003c/p\u003e\n\u003cp\u003eI do. In prayer, speech is simply a byproduct.\u003c/p\u003e\n\u003cp\u003eWhat were you praying? I mean when I came in.\u003c/p\u003e\n\u003cp\u003eI was reciting a passage from Daniel. Would you like to hear it?\u003c/p\u003e\n\u003cp\u003eI reckon I could listen to it.\u003c/p\u003e\n\u003cp\u003eAnd the fourth kingdom shall be strong as iron. For as much as iron breaketh in pieces and subdueth all things, and as iron that breaketh all these, shall it break in pieces and bruise.\u003c/p\u003e\n\u003cp\u003eBreak in pieces and bruise, Moses repeats barely audible.\u003c/p\u003e\n\u003cp\u003eAnd whereas thou sawest the feet and toes, part of potters’ clay and part of iron, the kingdom shall be divided. But there shall be in it the strength of iron, for as much as thou sawest the iron mixed with miry clay. And as the toes of the feet were part of iron and part of clay, so the kingdom shall be partly strong and partly broken.\u003c/p\u003e\n\u003cp\u003eIt’s a good prayer, Moses says, nodding his head and stroking his black beard. A fine prayer.\u003c/p\u003e\n\u003cp\u003eIt’s apt, Ignatius agrees.\u003c/p\u003e\n\u003cp\u003eWe’re all of us partly strong, partly broken, ain’t we?\u003c/p\u003e\n\u003cp\u003eI would say so. But Ignatius must see something in Moses’ flinching expression, because he goes on to ask: What happened to your brother?\u003c/p\u003e\n\u003cp\u003eAbraham?\u003c/p\u003e\n\u003cp\u003eFor a moment, Moses is confused. What is it that the monk is asking? But Ignatius clarifies with a hand gesture circling his face. What he’s asking is how Abraham came to be so damaged of physique.\u003c/p\u003e\n\u003cp\u003eOh, Moses says, that. He got into a tussle a few days back. The other man got him pretty good. It was out in the desert. He walked away – the other guy, I mean. I didn’t kill him or nothin.\u003c/p\u003e\n\u003cp\u003eIgnatius nods but says nothing. Moses supposes he’s waiting because he hasn’t heard the real answer to what he was asking.\u003c/p\u003e\n\u003cp\u003eThe big man shifts in the pew, and the wood creaks uncomfortably beneath his weight.\u003c/p\u003e\n\u003cp\u003eThere was a town, Moses goes on. Abraham, he got – he got too close to one of the girls. I mean, it was agreed upon. Consensual, I mean. But still and all – there was something about him she didn’t cotton to. He must of done something – I don’t know what—\u003c/p\u003e\n\u003cp\u003eI think I understand, Ignatius says.\u003c/p\u003e\n\u003cp\u003eMoses looks at him, wondering if the man truly does understand. A man of God after all – but also one of pretty phrases and toy silences.\u003c/p\u003e\n\u003cp\u003eHe was born wrong, Moses says.\u003c/p\u003e\n\u003cp\u003eBut you watch out for him.\u003c/p\u003e\n\u003cp\u003eWatch out for him, Moses repeats as though the phrase has two meanings, which it does, and he is juggling between them in his mind. I got a brother’s duty, he says at last.\u003c/p\u003e\n\u003cp\u003eAnd what does that duty tell you?\u003c/p\u003e\n\u003cp\u003eIt tells me I’m his blooden kin and that even the worst of us has got at least one person in the world to honour them.\u003c/p\u003e\n\u003cp\u003eIgnatius says nothing.\u003c/p\u003e\n\u003cp\u003eI try to keep him from doing things, Moses says miserably.\u003c/p\u003e\n\u003cp\u003eIgnatius again says nothing – just continues to stare piously at all that baroque gold artistry above the altar. Maybe God speaks directly to him through statues.\u003c/p\u003e\n\u003cp\u003eWhat I would know is this, Moses says, raising his voice suddenly so that it echoes through the empty hall. If I’m the one man whose duty it is to honour my brother, how many others are out there – not blood to him, mind you – whose duty it is to hold him true accountable for the things he does? How many? What would your reckon on that number be?\u003c/p\u003e\n\u003cp\u003eMoses points angrily, first at the statue of the Virgin Mary in the alcove on the right and then to the entombed statue of Saint Xavier in the alcove on the left.\u003c/p\u003e\n\u003cp\u003eA man ain’t built like a church to hold divided loyalties. How can a man do honour to both a man and the man’s victims? You tell me that. Where is the order that would punish this man? What about all this?\u003c/p\u003e\n\u003cp\u003eAgain Moses gestures to the church – all the statues of saints and angels and martyrs looking down upon them.\u003c/p\u003e\n\u003cp\u003eI brung him here, and I lay him down before you – and where is the arbiter to set him true or make him pay? You command tongues to hold themselves for the name of God – and now there’s a sinner, nay two, in sore need of redemption or condemnation – either one’ll do. So redeem or condemn. I keep to my order, so why ain’t you keepin to yours?\u003c/p\u003e\n\u003cp\u003eMoses, having spilled forth this liturgy of frustration, looks again to the monk Ignatius, who sits benignant with his head bowed and his hands folded in his lap – as though his were a peace that becomes stronger the more you assail it.\u003c/p\u003e\n\u003cp\u003eFinally, Moses sits back in the pew and breathes deep.\u003c/p\u003e\n\u003cp\u003eI apologize, friar, he says quietly. I’m a coarse lout who sometimes talks out of turn.\u003c/p\u003e\n\u003cp\u003eIgnatius shakes his head, as though forgiveness were too bulky a thing for two such puny beings to trade between them.\u003c/p\u003e\n\u003cp\u003eYou are looking for an order, the monk says, some structure beyond your own contrivance. It may be that there is no such order.\u003c/p\u003e\n\u003cp\u003eThis strikes Moses as funny, and he gives a brief, aborted chuckle.\u003c/p\u003e\n\u003cp\u003eYou’re not much of a friar, friar, he says.\u003c/p\u003e\n\u003cp\u003eThe laws we create for ourselves are beautiful, says the smiling Ignatius, but don’t expect the world to conform to them. You’d be lucky to find one single other person who shares your code. If you do find that person, cleave to him with ferocity. But otherwise . . .\u003c/p\u003e\n\u003cp\u003eOrder’s a dancin megrim, eh?\u003c/p\u003e\n\u003cp\u003eNow Ignatius chuckles.\u003c/p\u003e\n\u003cp\u003eYou have a poetry that makes me miss the words I so infrequently use.\u003c/p\u003e\n\u003cp\u003eThat’s a kindness, friar, assuming you’re not makin fun.\u003c/p\u003e\n\u003cp\u003eRest assured. Friars don’t make fun.\u003c/p\u003e\n\u003cp\u003eThey sit in silence for a while, listening to the crackle of the single torch left burning in the church. The shadows move long and panicked in the orange flicker, and the statues cast phantasmagoric shadows across the frescoed walls – and the effect is of two different artforms in combat.\u003c/p\u003e\n\u003cp\u003eIt’s a beautiful place you’ve got here, friar, Moses says.\u003c/p\u003e\n\u003cp\u003eIt was built by the Papago in the eighteenth century under the direction of a man named Juan Bautista Velderrain.\u003c/p\u003e\n\u003cp\u003eMoses nods.\u003c/p\u003e\n\u003cp\u003eThere’s been a lot of history between then and now, Moses says. The memory of a man’s name – what does it get you?\u003c/p\u003e\n\u003cp\u003eNot much, I suppose. Just a thing to collect. Like stamps or currency – things whose values used to be accepted as common. Still, not all the magics of the past have gone away. There are still some in the desert. Still some even here at the mission.\u003c/p\u003e\n\u003cp\u003eLike what magics?\u003c/p\u003e\n\u003cp\u003eIgnatius breathes in deep and narrows his eyes as though looking past the very walls of the structure.\u003c/p\u003e\n\u003cp\u003eInteresting thing about the Papago, he says. Apparently their customs lacked much of the pageantry of other tribes’. Their dances were shuffling barefoot on the earth. Their music was drumming on overturned baskets – which makes almost no noise. Everything they did was aimed downward, as though life were something that came from above and were meant to be spilled into the earth. Now everything’s backwards. You plant life in the earth – call it death if you like – but it gets spit back up. Maybe we’ve fed the earth too much. Maybe it’s lost a taste for us.\u003c/p\u003e\n\u003cp\u003eMaybe, Moses says. He’s thinking about the sound of dry palms pounding on overturned baskets in the middle of the desert. Dry, skeletal rattle, man shaking his bones.\u003c/p\u003e\n\u003cp\u003eI have a job for you, Ignatius says, if you could find terms on which to take it.\u003c/p\u003e\n\u003cp\u003eWhat’s the job?\u003c/p\u003e\n\u003cp\u003eTomorrow we’ll talk. I want to show you something. But tomorrow.\u003c/p\u003e\n\u003cp\u003eTalk, Moses says to the caravaners. All we’ve got is talk.\u003c/p\u003e\n\u003cp\u003eHe pauses in his story as if to show how great a vacuum is left in the world by the absence of speech. He gazes into the bonfire, and the others gaze with him. It is late, and the sky overhead is lightless, the stars hidden behind the blinding screen of smoke from the fire.\u003c/p\u003e\n\u003cp\u003eTalk, Moses says again. There ain’t nothin good or bad in the universe that can’t be turned the other way by talkin it around. The world, it’s all palaver. You might think different – I did too, then. But break bone and tear flesh, those are just actions that a man might do, just ways of killing time between the questions we ask ourselves in the dark. Me, I’ve built and broken in equal share – and the earth ain’t any more or any less, on the balance, as a result of my doings. But you could just sit still like we’re all doin right here and talk your way the entire journey from heaven to hell and whatever purgatory’s between.\u003c/p\u003e\n\u003cp\u003eHe pauses again. No one speaks. Miles are travelled, perhaps, in their minds.\u003c/p\u003e\n\u003cp\u003eI’ve wielded thousands of weapons in my half-century of livin, Moses continues. Everything from rifle to tree branch. And I’m tellin you there’s no artillery more powerful than words. Those spoken and those un – it makes no difference. \u003c/p\u003e","sourceLink":"https://allnovel.net/exit-kingdom-reapers-2/page-7.html","bookId":2517,"creation":"Oct 5, 2019 11:22:34 PM","modification":"Oct 5, 2019 11:22:34 PM"}
