{"id":83124,"no":20,"title":"Page 20","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003ePayton was the only person, besides Claire, that could answer the question on my mind and I decided to stop hiding behind the wall of protection I had build around my self. “Am I crazy for thinking I could have a chance with her?”\u003c/p\u003e\n\u003cp\u003e19 Shut the Front Door\u003c/p\u003e\n\u003cp\u003eClaire\u003c/p\u003e\n\u003cp\u003eI didn’t make it completely out of homeroom’s doorway before Payton jerked me up and pulled me to the corner in the hallway. “You little sly slut puppy. I am extraordinarily proud of you.”\u003c/p\u003e\n\u003cp\u003e“What? Am I missing something here?”\u003c/p\u003e\n\u003cp\u003e“I knew you could get Jessie Boone to lust after you and I had hoped you could get him to want to date you, but I never dreamed you would get him to fall for you. Congratulations. The power you hold over him is crazy awesome good. I can’t believe how you exceeded my expectations. This is such a tattooable moment. No punt intended.”\u003c/p\u003e\n\u003cp\u003eI was caught off guard. “He has not fallen for me. Why would you think that?”\u003c/p\u003e\n\u003cp\u003e“Because I talked to him this morning and got the official status,” she squealed.\u003c/p\u003e\n\u003cp\u003eI gave her a hard shove and she stumbled backwards. “Shut the front door. Where, when, how, why? I need all the details.”\u003c/p\u003e\n\u003cp\u003e“I caught him in the parking lot by himself this morning and I told him I needed to talk to him about you. See what being prompt can get you, Claire. Anyway…when I asked him if he was falling for you, he didn’t answer me. I told him I could tell he was and he didn’t deny it. Then, he asked me if he had a chance with you.”\u003c/p\u003e\n\u003cp\u003e“And your response was?” I anxiously asked.\u003c/p\u003e\n\u003cp\u003e“Of course, I told him to go for it because you liked him. Claire, this couldn’t be going more perfectly if I orchestrated it myself.”\u003c/p\u003e\n\u003cp\u003e“You did orchestrate it yourself,” I reminded her, then recalled how I was the one that asked her to formulate the plan in the start.\u003c/p\u003e\n\u003cp\u003eShe cackled and proudly said, “I know.”\u003c/p\u003e\n\u003cp\u003ePayton and I were both thrilled with Jessie’s feelings toward me for completely different reasons. I knew he liked me and was attracted to me, but knowing he was falling for me made me feel something so different.\u003c/p\u003e\n\u003cp\u003eI spent first period feeling anxious about seeing Jessie and was saddened when I remembered that we had finished our partner assignments with the creative ingredients. I would miss that special time alone with him as we became better acquainted with one another.\u003c/p\u003e\n\u003cp\u003eWhen I entered Humanities, I knew we wouldn’t be partnering up because the desks had been rearranged into a circle instead of groups of two. I took my seat and a minute later, Jessie was at my side in the seat next to me.\u003c/p\u003e\n\u003cp\u003e“Hey, Princess.”\u003c/p\u003e\n\u003cp\u003e“Hey, you. The arms’s still good?” I reached out to touch his arm, partly because I needed him to tell me he felt my touch, but also because I couldn’t resist feeling my skin against his.\u003c/p\u003e\n\u003cp\u003eHe smiled and said, “Good as new.”\u003c/p\u003e\n\u003cp\u003e“I’m so glad. I thought about you all night. I mean… I was worried about your arm.”\u003c/p\u003e\n\u003cp\u003e“I thought about you all night, but it wasn’t your arm I was thinking about.”\u003c/p\u003e\n\u003cp\u003eHis words sent me into orbit. “Tell me how you were thinking about me.”\u003c/p\u003e\n\u003cp\u003e“I would think that Payton had already told you. She had a certain ‘run and tell that’ look on her face when she got out of my truck this morning.\u003c/p\u003e\n\u003cp\u003eI laughed and didn’t confirm or deny what Payton had told me about their conversation and I hoped it drove him crazy with the desire to know.\u003c/p\u003e\n\u003cp\u003eMrs. Tanner began class and announced we would spend the next few days in the library doing some research on the meaning of the lyrics behind Billy Joel’s song ‘We Didn’t Start the Fire.’ Since partnering was encouraged, I couldn’t be happier.\u003c/p\u003e\n\u003cp\u003eWe entered the library and both of us walked toward the back and sat at a table with a computer off to it’s itself in an inconvenient location so we could be hidden from the others. “This is secluded. I could take advantage of you and no one would know.”\u003c/p\u003e\n\u003cp\u003eI raised an eyebrow at him. “You promise?”\u003c/p\u003e\n\u003cp\u003eHe put his hand on my knee and gently squeezed. “I’m talking about stealing your answers from Billy’s song lyrics, you little dirty girl.”\u003c/p\u003e\n\u003cp\u003eI loved the game of naughty insinuation that we played. “We do have an assignment, so I guess we should get on it.”\u003c/p\u003e\n\u003cp\u003eHe smiled that mischievous smile that belonged only to him. I loved it. “Yes, we should get it on. I mean…get on it. The assignment, that is.”\u003c/p\u003e\n\u003cp\u003eI playfully slapped his leg. “You are the dirty one here.”\u003c/p\u003e\n\u003cp\u003eAfter we began to search for the meaning of the lyrics, I caught Jessie staring at me like he was mesmerized. I reached up to my face. “What? Do I have something on my face?”\u003c/p\u003e\n\u003cp\u003e“Yeah, you do.” He reached out and grazed the back of his fingers against my cheek. “You’ve got a little beautiful right there.”\u003c/p\u003e\n\u003cp\u003eI felt the heat rise in my cheeks because I wasn’t use to hearing things like that. Forbes never said romantic things because he was too busy planning how to get what he wanted from me.\u003c/p\u003e\n\u003cp\u003e“You want to kiss me, don’t me?” he boldly asked and my face began to pulsate with fire.\u003c/p\u003e\n\u003cp\u003eHe was so daring and I loved it. In an instant, I decided to be bold in return. “You have no idea how much.”\u003c/p\u003e\n\u003cp\u003eI saw he wouldn’t be the one to back down. As I recalled, he had warned me about that.“I bet I have a pretty good idea since I probably want to kiss you just as much, if not more.”\u003c/p\u003e\n\u003cp\u003eWe were alone, most likely safe from being seen, but not guaranteed and it made it so much more exciting. The thrill of being caught coursed through my veins and I looked into his pale blue eyes, willing him to lean forward and take the kiss I was prepared to give him.\u003c/p\u003e\n\u003cp\u003e“I’ll do it,” he threatened.\u003c/p\u003e\n\u003cp\u003e“Then do it. I dare you. In fact, I triple dog dare you,” I provoked.\u003c/p\u003e\n\u003cp\u003eI saw a look in his eye-one I liked. “Princess, I told you I never back down.”\u003c/p\u003e\n\u003cp\u003e“That’s what I’m counting on, so prove it,” I invited.\u003c/p\u003e\n\u003cp\u003eI thought he would lean forward and steal a quick kiss, but he didn’t. He took my hand and led me across the back of the library. He looked in all directions before opening a door and pulling me into a storage room I didn’t know existed. He shut the door behind us and locked it from the inside. He put his hands around my waist and pulled me until our faces were almost touching. “Believe me, yet?”\u003c/p\u003e\n\u003cp\u003e“Nope. I need more proof,” I challenged.\u003c/p\u003e\n\u003cp\u003e“I was hoping you would say that.”\u003c/p\u003e\n\u003cp\u003eHe placed sweet, soft kisses on my lips and I thought my legs would melt beneath me. He moved to my neck and I let him because I knew the door was locked. My breathing became ragged and his kisses became more urgent, then stopped suddenly when we heard someone jiggling the door knob from the other side. I began to giggle and he cupped his hand on my mouth and shushed me. “Do you want to get caught?” he whispered.\u003c/p\u003e\n\u003cp\u003eI felt a little rebellious streak run through me and I realized I didn’t care if we got caught because I was having too much fun.\u003c/p\u003e\n\u003cp\u003e“Come on, we better get out before whoever that was comes back with a key.”\u003c/p\u003e\n\u003cp\u003eHe cracked the door and peeked out, making sure the coast was clear. When he was certain we wouldn’t be seen leaving, he opened the door and we sprinted toward our table. I giggled all the way back because I was high from the excitement of almost being caught.\u003c/p\u003e\n\u003cp\u003eAlmost as soon as we sat down, Mrs. Tanner showed up at our table to check on our progress. “You two are quite a bit behind the others, so you need to pick up the pace.”\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am,” we said in unison, then laughed at the irony of her words after she walked off. We were definitely picking up the pace, just not the way she wanted us to.\u003c/p\u003e\n\u003cp\u003e“Okay, we’re going to get a bad grade if we don’t get serious. Don’t make me regret allowing you to be my partner,” he said playfully.\u003c/p\u003e\n\u003cp\u003e“Allow me to be your partner? I can arrange for Brad to be your partner again. In fact, I bet I could find him right now and talk him into it.”\u003c/p\u003e\n\u003cp\u003eI stood up, pretending to walk away. He reached for my arm and gently pulled me onto his lap. “I have no doubt you could talk Brad into doing anything for you.”\u003c/p\u003e\n\u003cp\u003eI looked around, then gave him a quick kiss before leaving his lap and returning to my chair.\u003c/p\u003e\n\u003cp\u003eWe got a little more serious about our work since we were behind and I realized something. Jessie was smart…like really smart. We didn’t have to look up a lot of the things listed in the lyrics because he already knew what they meant.\u003c/p\u003e\n\u003cp\u003e“How do know all this stuff? You’re like a walking, breathing search engine.”\u003c/p\u003e\n\u003cp\u003e“How do you not know this stuff? Every one of these things listed in the lyrics made headlines. Most of them were very heated and controversial.”\u003c/p\u003e\n\u003cp\u003e“Peyton Place? I’ve heard of that, but I’ve never known what it meant,” I admitted.\u003c/p\u003e\n\u003cp\u003e“It was a published novel about some people in a small town hiding their sordid secrets. It was made into a movie and a television series. As you imagine, a book that included incest, abortion, adultery, lust and murder was highly controversial during the 1950‘s.\u003c/p\u003e\n\u003cp\u003eJessie continued to enlighten and amaze me with his knowledge of world events. Although it wasn’t intentional on his part, he made me look like anything but the top student in school.\u003c/p\u003e\n\u003cp\u003eWe went to third period and sat in the same seats we had taken on the first day of school. I leaned forward and whispered, “Am I doing better?”\u003c/p\u003e\n\u003cp\u003eHe turned his head and whispered over his shoulder, “On what?”\u003c/p\u003e\n\u003cp\u003eI leaned in closer to his ear. “You told me I should smile more. I’ve been working on it.”\u003c/p\u003e\n\u003cp\u003e“Yes and it suits you quite well I might add.” I smiled more because it was him that suited me well and I found myself wishing for a simpler life, one that could include him without causing a complete eruption of chaos.\u003c/p\u003e\n\u003cp\u003e“I’m not looking forward to next period,” he confessed and I heard the pain in his voice. What Payton said was true-he was falling for me. I needed to make a decision soon because what I was doing was wrong. I had no right to ask him to stand aside and watch me with my boyfriend while I made a decision to keep him or cut him lose. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-under-going-under-1/page-20.html","bookId":1877,"creation":"Oct 5, 2019 4:50:10 PM","modification":"Oct 5, 2019 4:50:10 PM"}
