{"id":83140,"no":36,"title":"Page 36","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I have some great news for you. I got a call from Doug Stanton today. Do you know who that is?”\u003c/p\u003e\n\u003cp\u003eYeah, I knew who Doug Stanton was. Anybody who followed college football at all knew he was the long term coach at State. “Yes, sir, I do.”\u003c/p\u003e\n\u003cp\u003e“He’s interested in you, son. He’s heard about you and wants to come watch you play. It’s awful early in the season for anyone to be contacting me about you, but I think he wants to get a jumpstart on you before anyone else has the chance. He’s coming next week.”\u003c/p\u003e\n\u003cp\u003eMy heart raced and I realized the first thing I wanted to do was tell Claire, my friend. ”Wow, Coach. State would be my first choice.” It wasn’t far from my brothers and they had an incredibly successful record with Stanton as their coach.\u003c/p\u003e\n\u003cp\u003e“This is it, Jessie. This is the beginning of the rest of your football career. This is how you get noticed by the pros,” he said. “You’ve got the kind of talent for that whether you’ve thought about it or not.”\u003c/p\u003e\n\u003cp\u003eI might have that kind of talent, but I had not considered playing professionally because I never expected to be discovered playing for Collinsville. “I don’t want anyone on the team to know, Coach.”\u003c/p\u003e\n\u003cp\u003e“Why not?” he asked.\u003c/p\u003e\n\u003cp\u003eI decided I would tell him the why, but not the who. “They won’t all be happy about this and I don’t want to give anybody a reason to try to take me out before the game.”\u003c/p\u003e\n\u003cp\u003e“You don’t have to say another a word. You’ve been a real team player by not mentioning it before, but I know exactly who you mean and I’ve been keeping an eye on Forbes Henderson since the day you had to ride off the field in an ambulance. I’ve been his coach for four years and I know him well. He doesn’t have me fooled. Now, let’s get out there and do some practicing so you’ll be ready to bring your best for Stanton.”\u003c/p\u003e\n\u003cp\u003e“Sure thing, Coach and thanks for everything. This is literally going to change my life,” I explained.\u003c/p\u003e\n\u003cp\u003e“I know it is, Jessie, and I couldn’t be prouder to have a hand in it.”\u003c/p\u003e\n\u003cp\u003eWhen I got on the field for practice, I saw Claire across the field and was eager to tell her about my good news, but not because she was my friend-because I loved her.\u003c/p\u003e\n\u003cp\u003eWe played our perpetual game of watching each other between plays and cheers. She saw the ecstatic look on my face and I knew she suspected something was up with me. She wanted to run to me and find out what it was. I could see it in her eyes, like I was reading her mind, as she watched me intently from where she stood.\u003c/p\u003e\n\u003cp\u003eReal friends could have chatted after practice, but we couldn’t, and it spoke multitudes about this thing we bogusly called a friendship. She watched me get into my truck and leave as she stood by her car with Forbes and I realized we could label our relationship whatever we wanted, but things were no different from when we were testing the boundaries of our relationship in the beginning.\u003c/p\u003e\n\u003cp\u003eOne thing was different this time. I would hold her arms length to keep her safe. Anything closer was a risk to Claire I wasn’t willing to chance.\u003c/p\u003e\n\u003cp\u003e33 Spit It Out, Already\u003c/p\u003e\n\u003cp\u003eClaire\u003c/p\u003e\n\u003cp\u003eI wanted to call Jessie to see what had him smiling so much, but I was afraid to push the friend envelope too far. If I continued to act like more than a friend, I was afraid he would withdraw his contact from me altogether and that was something I couldn’t risk. Friendly contact was better than none at all.\u003c/p\u003e\n\u003cp\u003eI almost had to tie my hands down away from my phone, but I somehow managed to not call Jessie. By the time we met up on the way to Humanities the next day, my patience was gone. “You’ve got to tell me what had you grinning like a hyena yesterday. I’ve been dying to know.”\u003c/p\u003e\n\u003cp\u003eHe stopped walking and we stood at the entrance to the freshmen building away from our friends. He broke into a huge smile and said, “The coach from State is coming to watch me play next week. This is huge, Princess. It’s exactly what I wanted because it isn’t far from Harley and Ozzy and they have an awesome law school.”\u003c/p\u003e\n\u003cp\u003eI couldn’t control my excitement for him and threw my arms around his neck. “Jessie, that is awesome. I’m so happy for you.” He picked me up and spun me around for a few seconds before putting me down on the ground. He looked at my face and I couldn’t force myself to let go of him as I told him, “We never talked about it, but I plan on going to State, too.”\u003c/p\u003e\n\u003cp\u003eHis expression was thoughtful as he replied, “No, you never told me that.”\u003c/p\u003e\n\u003cp\u003eI remained inside the friend zone boundaries and bit my tongue instead of telling him how this solved all of our problems and how we were going to be together because we were supposed to be. Instead, I said, “Yeah, my mom’s alma mater. Maggie went there, too.”\u003c/p\u003e\n\u003cp\u003eWe both smiled and I realized I was still holding on to him. I let go and said, “Sorry. I just got really excited for you is all,” as I reached for my backpack on the sidewalk.\u003c/p\u003e\n\u003cp\u003eWe turned to walk toward class and he bumped my shoulder, his way of telling me my enthusiasm was alright. “It’s okay. Friends can hug. I’m pretty sure they do it everyday.”\u003c/p\u003e\n\u003cp\u003eI halfheartedly smiled at his dismissal of our embrace, but we both knew it was based on more than friendship, even if neither of us acknowledged it.\u003c/p\u003e\n\u003cp\u003eI spent the rest of the week struggling with my every move around Jessie. It was exhausting to fight what came naturally to me. Deflecting my instinct to touch his skin and tell him how I loved him wasn’t getting easier. In fact, it was growing increasingly more difficult with each passing day and I wondered if he was feeling the same as me.\u003c/p\u003e\n\u003cp\u003eWe sat in the library, the place I had grown to love, at our private table at the back. Jessie caught my attention several times when he would look up from his work at me. Each time I looked his way, he would turn from me as if he had changed his mind about saying the thing on his mind.\u003c/p\u003e\n\u003cp\u003eWhen I watched him do it for a fifth time, I decided to address it. I laid my pencil down on the table and said, “What?”\u003c/p\u003e\n\u003cp\u003e“I didn’t say anything.”\u003c/p\u003e\n\u003cp\u003eWe both reached to catch my pencil as it threatened to roll onto the floor. “Yeah, I know you didn’t, but you’ve looked at me about a half dozen times like you wanted to, so spit it out already!”\u003c/p\u003e\n\u003cp\u003eHe shook his head. “It’s nothing.”\u003c/p\u003e\n\u003cp\u003eIt had been days since I had felt his touch and I couldn’t stand it any longer, so I reached out to touch his hand. “Tell me. I want to know what is so fluster worthy.”\u003c/p\u003e\n\u003cp\u003eHe smiled and said, “I’m going to see my little brothers at their foster parents’ house on Sunday.”\u003c/p\u003e\n\u003cp\u003eI felt utter joy in my heart for him. “Oh, that’s wonderful. I know you are so excited about seeing them since it’s been a while. They’ll be super happy about seeing you.”\u003c/p\u003e\n\u003cp\u003eThat restless look of wanting to tell me something didn’t leave his face. “Is something wrong, Jessie? Are the boys alright?”\u003c/p\u003e\n\u003cp\u003eHe smiled because he liked my concern for his brothers. “Nothing is wrong, but I have something I’d like to ask you.”\u003c/p\u003e\n\u003cp\u003eI waited and when he didn’t say anything, I encouraged him to speak up. “Go ahead, Jessie. I’m listening.”\u003c/p\u003e\n\u003cp\u003e“I will completely understand if you don’t want to, so don’t feel like you have to say yes.”\u003c/p\u003e\n\u003cp\u003eHe was stalling and it was driving me crazy. “Okay, Jessie. Tell me what it is before I die of curiosity.”\u003c/p\u003e\n\u003cp\u003eHe stalled a few more seconds until it became a little awkward, then said, “I wanted to ask you if you would like to go with me to see Harley and Ozzy on Sunday.”\u003c/p\u003e\n\u003cp\u003eHis invitation caused my heart to inflate almost to the point I thought it might burst. The gesture was so innocent, yet so intimate. I fought the tears welling in my eyes because I was afraid he might withdraw his invitation if I acted as though it was more than a friendly invite. I turned my head and looked up at the ceiling to suck the moisture back in and said, “Yeah, I love kids. Sounds like fun. What time?”\u003c/p\u003e\n\u003cp\u003eI managed to make the tears in my eyes go somewhere besides my cheeks and I turned to look at him. “My visitation begins at one o’clock. Can you meet me around twelve-thirty at the garage?”\u003c/p\u003e\n\u003cp\u003eI couldn’t have been more blissed out, but I kept my elation in check because I didn’t want to ruin this. “Sure. I can be there at twelve-thirty.”\u003c/p\u003e\n\u003cp\u003eWe finished our assignment a little early and he took the opportunity to tell me about Harley and Ozzy and how he had parented them since his mom was usually MIA or drugged out. He told me comical things about their lives to keep the mood light, but the reality of the situation was just plain sad. Although I laughed at the stories about his adventures in parenting, I found myself secretly becoming furious with a dead woman. The things he had been forced to endure were unfair at best, but I could see how much he loved Harley and Ozzy and my guess would be that he wouldn’t take anything in the world for having to raise those two little boys.\u003c/p\u003e\n\u003cp\u003eWhen Sunday arrived, I came up with some kind of crazy lie to tell my mom about where I was going and I was out the door to meet Jessie at Earl’s garage. When I pulled up to meet him, I was actually on time, but he had still beat me there. He got out of his truck and walked over to my driver’s side window. My heart almost stopped because I thought maybe he had rethought the whole asking me to go thing, but he asked, “Do you mind if we take your car? I think it’s best we don’t leave a fancy convertible with an expensive sound system unattended in Collinsville,” he advised.\u003c/p\u003e\n\u003cp\u003e“I see your point,” I agreed.\u003c/p\u003e\n\u003cp\u003eHe went back and locked up his truck, then got into my car with me. “It’s going to be interesting to see their reaction to you today.”\u003c/p\u003e\n\u003cp\u003eThat sounded like a little bit of a warning. “Should I be scared or something?”\u003c/p\u003e\n\u003cp\u003eI put my car in reverse and backed up while he answered, “No, they will be fine once they see how you are.”\u003c/p\u003e\n\u003cp\u003e“And how am I exactly?” I asked.\u003c/p\u003e\n\u003cp\u003eHe hesitated as I begin to drive forward, and I briefly thought he wasn’t going to answer me at all, but then he softly said, “Wonderful.”\u003c/p\u003e\n\u003cp\u003eIt was one of those moments that deserved a kiss if we had been dating, but we weren’t, and it felt painfully obvious at the moment so I wanted to change the subject. “Will we stay at their foster parents house or will we take them somewhere?” \u003c/p\u003e","sourceLink":"https://allnovel.net/going-under-going-under-1/page-36.html","bookId":1877,"creation":"Oct 5, 2019 4:50:10 PM","modification":"Oct 5, 2019 4:50:10 PM"}
