{"id":83109,"no":5,"title":"Page 5","content":"\u003cp\u003e“She’s Henderson’s girl,” he said in such a matter of fact manner.\u003c/p\u003e\n\u003cp\u003e“I know that much,” I said, a little irritated by hearing the proof of her association with my nemesis.\u003c/p\u003e\n\u003cp\u003e“You’ve heard of America’s Sweetheart? Well, she’s East Franklin’s sweetheart. Everyone loves her and things always tend to go her way if you know what I mean. I don’t have to tell you how hot she is and she’s smarter than anyone else in our class. She’ll be our valedictorian for sure. Her parents are well off, so she gets everything she wants and she’s dated Forbes since the middle of our sophomore year. Their parents are big buddies, so they’re always going on all these family vacations together.”\u003c/p\u003e\n\u003cp\u003eI bet that lucky bastard was definitely getting in her pants every chance he got and that was probably fine with the parents as long as she was staying within her own social class.\u003c/p\u003e\n\u003cp\u003e“I saw you talking to her in the parking lot this morning. You trying to put the moves on her?”\u003c/p\u003e\n\u003cp\u003eThere were quite a few moves I’d like to put on her, but I said, “Nah, just thought I’d mess with Henderson by talking to her. I figured she’d run and tell him.”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t push Forbes because he pushes back and he doesn’t always play by the rules. He’s a loose canon,” he warned, then added, “Claire thinks she knows him, but she hasn’t seen the side of him I’ve seen. Trust me, he’s an underhanded dog.”\u003c/p\u003e\n\u003cp\u003eThe thought of Forbes being a threat made me want to laugh. “Dude, I’ve seen loose canons and Forbes Henderson is nothing more than a sparkler from a roadside fireworks stand to me.”\u003c/p\u003e\n\u003cp\u003e“There’s something I need to tell you about him and his pals. I overheard them talking about taking you out so you can’t play anymore. I don’t know the details, but it’s going down sometime before the first game. I think you should tell Coach.”\u003c/p\u003e\n\u003cp\u003eI appreciated the heads up, but I took care of myself and didn’t need anyone doing it for me. “No way, dude. I rather get my ass kicked than be a snitch.”\u003c/p\u003e\n\u003cp\u003e“It’s your funeral.”\u003c/p\u003e\n\u003cp\u003e“Not a word to Coach. I can handle whatever they can dish,” I warned. “But thanks for telling me. I know you didn’t have to do that. If you hear something else, will you let me know about it?”\u003c/p\u003e\n\u003cp\u003e“Sure, no problem.”\u003c/p\u003e\n\u003cp\u003eI considered the different scenarios of what taking me out meant. Most likely they would try to catch me somewhere outside of school and jump me or something like that. There was only one little flaw with their plan. Those little rich punks didn’t realize they were screwing with the wrong person.\u003c/p\u003e\n\u003cp\u003eWhen homeroom was over, I walked down the hall to my first period class. I passed East Franklin’s happy couple and Claire’s eyes briefly caught mine as she was being spun around by the guy trying to take away my chance at a football scholarship and ultimately the loss of any future worth having.\u003c/p\u003e\n\u003cp\u003eI turned my eyes away from her and the prick I hated, then went to my first period Calculus class. While I waited for class to begin, Claire’s riding companion walked into class and took a look around before spying me. She took the seat in front of me, then spun around in her desk and extended her hand. “We’ve not officially met. I’m Payton Archer and you are?”\u003c/p\u003e\n\u003cp\u003eHer hotness level was flaming, but she didn’t impress me nearly as much as Claire. I took her hand and said, “Jessie Boone.”\u003c/p\u003e\n\u003cp\u003eShe wasted no time cutting straight to the chase and asked, “So, Jessie Boone, what kind of move was that you tried to put on Claire in the parking lot?\u003c/p\u003e\n\u003cp\u003eI laughed and said, “That was not a move and if she thinks it was, then Henderson is seriously lacking in the skills department.”\u003c/p\u003e\n\u003cp\u003e“I won’t disagree about Forbes and his skills, but I’m calling bullshit. I know the game like your crotch knows the palm of your hand and I definitely saw a move, so I’m giving you the luxury of a warning. Do not mess with Claire because of what’s going on between you and Forbes. Do we have an understandment?”\u003c/p\u003e\n\u003cp\u003eI leaned forward and whispered, “Do you suffer from restless lip syndrome because they make medication for that?” My insult strangely brought a smile to her face.\u003c/p\u003e\n\u003cp\u003eOur calculus teacher, Miss Dulaney, started class and Payton whispered, “You might score some touchdowns on the football field, but you can forget about getting into Claire’s end zone.”\u003c/p\u003e\n\u003cp\u003e6 The Tardy Nazi\u003c/p\u003e\n\u003cp\u003eClaire\u003c/p\u003e\n\u003cp\u003eI sat in Mrs. Jenson’s homeroom watching her peer over her ancient reading glasses while she called attendance. What happened? I thought senior year was supposed to rock. It’s supposed to be one of the most fabulous times of my life, but as I looked around this classroom at my fellow classmates, I realized that this is not the awesome I was promised and I want a refund.\u003c/p\u003e\n\u003cp\u003eI stupidly placed myself on Mrs. Jenson’s tardy radar when I breezed into homeroom by the skin of my teeth as the bell rang. I attempted to sneak into a seat without calling attention to myself, but only managed to successfully gain the unwanted scrutiny of my new homeroom teacher when I stumbled over Griffin Jackson’s backpack in the aisle, causing the heel of one of my new boots to skid across the freshly waxed linoleum tile. Griffin quickly reached for my arm, touching my breast in the process, and saved me from sprawling out on my back in front of the entire class.\u003c/p\u003e\n\u003cp\u003eHe softly whispered, “Sorry, Claire,” and I wasn’t certain if he meant for touching my boob or leaving his backpack in the aisle, but it was my fault I stumbled because I was thinking about pale blue eyes and black, spikey hair.\u003c/p\u003e\n\u003cp\u003e“It’s okay, Griffin.”\u003c/p\u003e\n\u003cp\u003eOld lady Jenson made a spectacle of looking down her nose at me as I crossed the classroom to sit in the desk next to my friend and fellow cheerleader, Allie Bumphis. I pretended I didn’t notice Jenson’s eyes following me, but I perceived her stare for what it was; a nonverbal warning daring me to be late.\u003c/p\u003e\n\u003cp\u003eAllie leaned toward me slightly and whispered, “I saw you talking to the new quarterback in the parking lot. Do you know him?”\u003c/p\u003e\n\u003cp\u003e“Nope,” I said, popping the p, then added, “Sure don’t.”\u003c/p\u003e\n\u003cp\u003eMrs. Jenson cleared her throat and asked, “Ladies…do you have something you’d like to discuss with the class?”\u003c/p\u003e\n\u003cp\u003eIs she serious? We’re seniors, not kindergarteners. Who doesn’t let their students talk in homeroom on the first day of school? That’s unheard of.\u003c/p\u003e\n\u003cp\u003e“No, ma’am. I don’t have a thing I’d like to share.”\u003c/p\u003e\n\u003cp\u003eMan, I was a glad I didn’t have her for a class other than homeroom because that would suck. I put my elbow on my desk and propped my face in my palm. I glanced to my right and saw Trevor McMillin. He smiled at me like he was thrilled I noticed he was alive and I saw a big, white pimple on his forehead, so I took my hand away from my face when his zit reminded why I shouldn’t put my hands on my face. The last thing I needed was a big zit on my face.\u003c/p\u003e\n\u003cp\u003eAfter hearing the announcements and serving my sentence in homeroom with Jenson, the bell rang and I raced down the hall toward my locker where I knew I would find Payton. At our neighboring lockers, I found her glossing her lips with Perfect Peach, her signature color, while she looked into the small magnetic mirror mounted inside her locker.\u003c/p\u003e\n\u003cp\u003eShe ran her index finger along her bottom lip to perfect the line she had drawn with the wand, then reached into her long, blond hair and gave it a quick fluff. She smiled as though she liked what she saw and she should because she was beautiful.\u003c/p\u003e\n\u003cp\u003eShe turned to me as I reached for my locker handle. “Have you forgiven me, Claire Bear?”\u003c/p\u003e\n\u003cp\u003eI had a poor running record for staying mad at Payton and she knew I wouldn’t still be mad. “No. I could never stay mad at you.”\u003c/p\u003e\n\u003cp\u003e“Good, because I have to tell you about my crappy luck. I had to sit next to The Ladies’ Man in homeroom. Ugh!”\u003c/p\u003e\n\u003cp\u003eMarcus Lee had earned the title of The Ladies’ Man from Leon Phelps, the horny talk show host on classic Saturday Night Live. He was such a tool he actually thought the nickname was a compliment.\u003c/p\u003e\n\u003cp\u003eShe snarled her nose and shook with a rigor as she recalled her close encounter with Marcus. “He is such a creep. He gave me that up and down look with those weird grunting and moaning sounds he makes. I feel like I need a morning after pill and a dose of strong antibiotics.”\u003c/p\u003e\n\u003cp\u003eThe boy knew how to violate a girl with his eyes alone and I was glad I wouldn’t have to face him first thing every morning. I was painfully tormented with his daily bump and grind routine during my sophomore year, so I had my turn with him two years ago.\u003c/p\u003e\n\u003cp\u003eIt was too bad Payton faced being visually and verbally molested by Marcus every morning. “Sorry, been there and done that and it’s not pretty, but I wish you the best of luck with that horn dog. I got stuck with the tardy nazi for homeroom. She’ll send me to detention when I exceed my tardy limit and I’ll end up being stuck with him, too.”\u003c/p\u003e\n\u003cp\u003eSuddenly, I was grabbed from behind and as I was spun around, I briefly made eye contact with the sexy badass’ beautiful pale blues before he made a face of disgust and entered Miss Dulaney’s Calculus class. Good. That meant I didn’t have first period with him.\u003c/p\u003e\n\u003cp\u003eAfter my feet returned to the floor, I felt a kiss being planted on the back of my neck and I whirled around to face my assailant. I frogged Forbes on the arm with my fist as I said, “You better cut that out before Mr. Grisham sees us. You know he doesn’t tolerate any form of PDA.”\u003c/p\u003e\n\u003cp\u003eHe was unharmed by my weak attempt to loosen his hold on me. “Claire, you worry too much. He’s not gonna say anything because we’re seniors now.”\u003c/p\u003e\n\u003cp\u003eForbes’ best friend, Cooper, was standing next to us and spoke up to agree with me. “She’s right, Forbes. He’s a real hard ass on that PDA stuff. He busted me and Caitlyn Johnson when we were dating for holding hands in the hall.”\u003c/p\u003e\n\u003cp\u003eForbes didn’t loosen his hold as he said, “Jeez, do I look like I care what he says?” He pulled me tighter and pushed my hair to the side to plant another kiss on my neck and I felt a surge of chill bumps run down my body.\u003c/p\u003e\n\u003cp\u003e“Come on, Forbes, I don’t want to get in trouble on the first day of school,” I pleaded as I looked around the hall nervously for Mr. Grisham. The last thing I needed was my parents getting a call from the school for inappropriate physical contact at school. My mom was already convinced that Forbes and I were going at it every given opportunity we had and if things went his way, my mom wouldn’t far off the mark. \u003c/p\u003e","sourceLink":"https://allnovel.net/going-under-going-under-1/page-5.html","bookId":1877,"creation":"Oct 5, 2019 4:50:10 PM","modification":"Oct 5, 2019 4:50:10 PM"}
