{"id":82663,"no":21,"title":"Page 21","content":"\u003cp\u003eTWENTY-ONE\u003c/p\u003e\n\u003cp\u003eSECRETS\u003c/p\u003e\n\u003cp\u003eOn Friday Kay stayed home from her classes, calling Dr. Wexler to tell him she was suffering from a migraine headache. I\u0027ll be fine by Monday, she told the man, and he said he hoped she felt better soon and wished her a good weekend.\u003c/p\u003e\n\u003cp\u003eKay put the receiver down and lay in the bed, the curtains closed, the room darkened. She\u0027d switched on the light a few minutes before and then hurriedly turned it off again, finding it stung her eyes. Evan and Laurie were down in the kitchen making breakfast for her; hearing them clattering around, she knew she\u0027d have to clean up. after them later. But it was nice of them, and no matter what was burned she was going to pretend to enjoy it.\u003c/p\u003e\n\u003cp\u003eShe hadn\u0027t really lied to Dr. Wexler; her head was pounding.\u003c/p\u003e\n\u003cp\u003eBut she knew it wasn\u0027t migraine. She felt as if her nerves were trembling, felt as if an icy hand caressed her shoulders. She\u0027d tried for weeks now to pretend that nothing was wrong, that what she was feeling inside was anxiety, that soon the anxiety would pass and she\u0027d be the same sensible, practical Kay Reid she\u0027d always been.\u003c/p\u003e\n\u003cp\u003eBut now she couldn\u0027t do that anymore.\u003c/p\u003e\n\u003cp\u003eSomething was happening to her that she cou1dn\u0027t explain away as anxiety or anything remotely familiar. It had begun with those strange dreams. At first she\u0027d been an interested, if fearful, observer in them, but now, as they intensified and drew her slowly into them, she\u0027d become a participant unable to escape. And it always seemed that she was locked within another body, one with a ragged scar on the thigh, and she viewed scenes of carnage and merciless battle through hard, slitted eyes that were not her own. She\u0027d wanted to talk about those dreams to Evan, to tell him that fear and confusion were writhing within her, but she\u0027d been ashamed to admit she was becoming more and more afraid of something shadowy and intangible. After all, wouldn\u0027t that be admitting that there might be something to fear in Evan\u0027s dreams as well? No. She couldn\u0027t do that.\u003c/p\u003e\n\u003cp\u003eEvan seemed too preoccupied with something else to listen to her, anyway. In the past few days he\u0027d eaten hardly any dinner at all; his eyes looked tired and hollow because he\u0027d been staying up so late, watching television or trying to work downstairs in the basement.\u003c/p\u003e\n\u003cp\u003eBut Kay could have counted on both her hands the number of keys she\u0027d heard strike paper. Those were familiar symptoms, and they were setting her nerves on edge as badly as were her nightmares.\u003c/p\u003e\n\u003cp\u003eThe one the night before had been the worst yet. She\u0027d awakened in the gray hours with a cry of pain caught in her throat.\u003c/p\u003e\n\u003cp\u003eThrough the whorls of smoke and dust, the hordes of swarthy, black-bearded invaders had advanced, swinging blood-edged swords; archers on horse back wheeled across fallen walls and around roaring fires where corpses crackled and split. She and three comrades had fought back to back, swinging their gore-splattered axes from side to side like a ferocious, maddened fighting machine.\u003c/p\u003e\n\u003cp\u003eShe\u0027d cleaved one of the enemy with a blow that had burst his skull into fragments, and then she\u0027d heard a name - Oliviadre - which she\u0027d recognized as her own, called in warning. Whirling to the side, she\u0027d met the strike of the sword with her battle-ax and slashed the invader\u0027s hand off at the wrist. The stump had gouted blood, and it had been a simple blow to end his life. Behind her, Coliae had fallen with an arrow in her throat; Demusa shrieked her war cry even as a blade struck her shoulder and a second blade pierced her chest; Antibre was struck in the face by a dashing sword, and even as she fell to her knees, she cleaved the head from the warrior who\u0027d struck her down. Through the smoke the warriors came forward, shoulder to shoulder, their chests heaving. Oliviadre backed over a heap of fallen comrades, hand clenched around the handle of her weapon.\u003c/p\u003e\n\u003cp\u003eAll around burned fires of defeat: the great city, the great nation, finally trodden down beneath the boot of the destroyer. Torn bodies littered the stone pathways, and blood splattered murals of glorious, breathtaking color.\u003c/p\u003e\n\u003cp\u003eAnd now Oliviadre, her gaze sliding from side to side like a cunning animal\u0027s, saw the fear in their eyes, but knew the time of her own death was fast approaching. One of the warriors, a large man both courageous and foolhardy, rushed forward, his arm coming back to fling a spear. Oliviadre shrieked in rage, felt the hot graze of the spear as she stepped quickly to the side; at once she was upon the man, striking, striking, striking. The mutilated body fell, head hanging from strings. She spat upon it and readied herself for the others. They hesitated, sensing in her the fury that had almost brought Athens to its knees over a hundred years before. A bow hissed, and an arrow flashed over the heads of the men. It struck Oliviadre in the shoulder, forcing her back a few paces. The warriors, seeing the stream of blood, pushed forward.\u003c/p\u003e\n\u003cp\u003eUntil Oliviadre\u0027s wary retreat was stopped by a firescorched, broken ruin of a wall. The warriors paused, looking for an opening.\u003c/p\u003e\n\u003cp\u003eBut Oliviadre gave them no chance. At once she screamed the chilling war cry of the eagle, and then she was leaping over the mounds of corpses onto the terrified men. She struck one down with a single blow, slashed out and saw an arm fall, still gripping a sword; a searing, burning pain at her spine; slashing, slashing, spraying red droplets across crumbling faces, slashing; volcanic pain at the back of her head; still slashing, the ax heavier now, the warriors crowding in closer as she fell to her knees; one of them lifting his sword high, and then...\u003c/p\u003e\n\u003cp\u003eDarkness.\u003c/p\u003e\n\u003cp\u003eGray light.\u003c/p\u003e\n\u003cp\u003eMorning on McClain Terrace. God, my head! Got to call Dr.\u003c/p\u003e\n\u003cp\u003eWexler...\u003c/p\u003e\n\u003cp\u003e\"Breakfast!\" Laurie said, coming into the room with Evan close behind her, carrying a plate with bacon and eggs and a glass of orange juice on a tray. She put the tray carefully across her mother\u0027s lap. \"We burned the toast up, though,\" Laurie said cheerily.\u003c/p\u003e\n\u003cp\u003e\"Oh, that\u0027s all right. It looks very good.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you want a light on in here?\" Evan asked her.\u003c/p\u003e\n\u003cp\u003e\"No. Please. My head\u0027s still aching.\" She reached to the night table for a bottle of Tylenol. Two tablets remained; she swallowed them with the orange juice.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not feeling any better at all?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. The final image in her dream remained fixed behind her eyes: a warrior lifting his sword, muscles rippling in his arms, to strike across her skull. No. That wasn\u0027t me. That was...Oliviadre. Oliviadre was struck by that sword, not me. So why do I feel this terrible, throbbing pain? She winced and touched her forehead.\u003c/p\u003e\n\u003cp\u003e\"Does it hurt bad, Mommy?\" Laurie asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, it does.\"\u003c/p\u003e\n\u003cp\u003eEvan picked up the empty Tylenol bottle. \"I\u0027d better drive down to the drugstore and get you another bottle of these, then.\" He looked at her for a moment, seeing her obvious pain in the lines around her eyes. \"Do you want to see a doctor?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, it\u0027s not that bad,\" Kay said quickly. She took a tentative bite of an egg, reached for the salt shaker on the tray. \"I\u0027ll be just fine.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve been working too hard,\" Evan said. \"Probably reading too much.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s probably it. It\u0027ll be good for me to rest today because I\u0027ve got those tests to give next week.\"\u003c/p\u003e\n\u003cp\u003e\"Am I going to school today?\" Laurie asked.\u003c/p\u003e\n\u003cp\u003e\"No,\" Kay said. \"Why don\u0027t you stay home and keep me company?\"\u003c/p\u003e\n\u003cp\u003e\"But Daddy can do that!\" Laurie protested. \"Mrs. Omarian was going to finish her story today!\"\u003c/p\u003e\n\u003cp\u003eKay grasped her little girl\u0027s hand. \"I thought you\u0027d want to stay home, honey. You can watch television, and go outside to play, and - \"\u003c/p\u003e\n\u003cp\u003e\"The queen!\" Laurie said. \"I\u0027m going to miss the part about the queen!\"\u003c/p\u003e\n\u003cp\u003eEvan\u0027s eyes flickered quickly over to Kay, then back to Laurie\u0027s face again. \"What queen?\"\u003c/p\u003e\n\u003cp\u003e\"The real queen!\" Laurie said. \"The one right here in this place!\"\u003c/p\u003e\n\u003cp\u003e\"In this place? What place do you mean?\"\u003c/p\u003e\n\u003cp\u003eThe little girl shook her head, irritated that her father didn\u0027t understand. \"Right here!\" she said emphatically. \"She lives in a big castle!\"\u003c/p\u003e\n\u003cp\u003eKay began to stroke the child\u0027s hair. \"Stay home with me, honey. We\u0027ll have a good time together.\"\u003c/p\u003e\n\u003cp\u003eLaurie paused for a moment. \"Awwwwww, I miss out on everything!\"\u003c/p\u003e\n\u003cp\u003e\"Tell you what, princess,\" Evan said. \"Why don\u0027t you drive with me over to the drugstore? Okay?\"\u003c/p\u003e\n\u003cp\u003eAnother pause, and then she finally nodded. \"I guess so.\" As they crossed the lawn to the driveway, Evan found himself staring at the Demargeon house. Nothing moved over there; the Demargeons\u0027\u003c/p\u003e\n\u003cp\u003ecar was gone. Evan, with Laurie on the seat beside him, backed the station wagon into the street and turned toward the Circle.\u003c/p\u003e\n\u003cp\u003e\"You must like Mrs. Omarian a lot,\" Evan said while he drove.\u003c/p\u003e\n\u003cp\u003e\"I do. She\u0027s nice.\"\u003c/p\u003e\n\u003cp\u003e\"Are there many others who go to the Sunshine School?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"It\u0027s hot. Can I roll my window down?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. Go ahead.\" Evan came to a stop sign, slowed and stopped, looked both ways, and. then drove on, past silent houses.\u003c/p\u003e\n\u003cp\u003e\"Mrs. Omarian must tell you some good stories,\" he said in another moment.\u003c/p\u003e\n\u003cp\u003e\"Oh, she tells very good stories. Just to us and not to the boys, either, because she says we\u0027re special.\u003c/p\u003e\n\u003cp\u003e\"Of course you\u0027re special,\" Evan said. \"How many little boys go to the Sunshine School?\"\u003c/p\u003e\n\u003cp\u003e\"Oh...four or five. It\u0027s mostly girls like me.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, glanced in his rearview mirror, got a quick glimpse of the museum\u0027s roof before he looked away.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to hear some of Mrs. Omarian\u0027s stories,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Especially about this queen who lives in a castle.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t,\" Laurie said. \"Mrs. Omarian said they\u0027re just for us because we\u0027re special. She said daddies aren\u0027t supposed to know.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" Evan said easily. \"Secrets, huh?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s fun to have secrets.\"\u003c/p\u003e\n\u003cp\u003eEvan\u0027s vision clouded over. He was only dimly aware that he was still driving through the streets of Bethany\u0027s Sin, because some other part of him stood in a corridor, surrounded by swirling dust and heat, watching a dark shape with burning eyes slowly come closer and closer to stand just before him now. A hand pierced the veil of dust, reaching out for him. Took his arm in a cold, hard grip, pulled him forward. Daddy, someone said. His heart pounded, but there was nothing he could do to resist; the thing pulled him onward, along the corridor to a huge room where others waited. Daddy! A voice, very close. The floor of rough stones, the ceiling of glass and the moon burning white in a black sky. Things with flaming, hideous eyes ringing the room. A slab of black rock in the center, and someone standing there. Daddy, please! Laurie\u0027s voice. Kay. Kay standing there, but a...different Kay. A Kay with two faces: one half snarling, the single eye blazing blue and filled with hate; the other half screaming, eye widened in fear. Behind her, other figures, waiting. Daddy, you\u0027re...Kay lifting one arm, the hand holding a battle-ax that glowed with the same spectral power; her other hand clenched for him, the fingers trembling in a frenzy...\u003c/p\u003e\n\u003cp\u003e\"...going too fast!\" Laurie screamed, close to his ear.\u003c/p\u003e\n\u003cp\u003eAnd then he jerked himself back away from the hideous place and saw the stop sign coming up fast and knew that even as he jammed on the brakes the car\u0027s momentum would carry them across and he prayed to God there would be no other cars coming into that intersection. The tires squealed, squealed, squealed. The car shuddered violently. Ahead a looming black figure, twisting aside.\u003c/p\u003e\n\u003cp\u003e\"Christ!\" Evan said, gritting his teeth and easing the station wagon to a halt in the middle of the intersection. He looked to Laurie, who was shaking and biting her lip, her, eyes wide. \"I\u0027m sorry, princess,\"\u003c/p\u003e\n\u003cp\u003ehe said. \"Christ, I\u0027m sorry! Are you all right?\"\u003c/p\u003e\n\u003cp\u003eShe nodded, her eyes darting.\u003c/p\u003e\n\u003cp\u003e\"Christ, I\u0027m sorry,\" he said again. \"I didn\u0027t mean to do that. I don\u0027t know what I was thinking.\" And suddenly he was aware of another presence, and eyes drilling through him. He smelled an animal smell and looked sharply to the side.\u003c/p\u003e\n\u003cp\u003eBeside the station wagon there was a gleaming, massive-flanked black horse, nostrils wide, still nervously tossing its huge triangular head. Red fire seemed to burn in that horse\u0027s eyes. And astride the animal, riding bare back, was Kathryn Drago, her hand clenched in the horse\u0027s mane. \"Steady, Joker,\" she was saying softly.\u003c/p\u003e\n\u003cp\u003e\"Steady. Steady.\" The horse jerked its head and then stood quiet while the woman stroked its neck. And then she gazed across at Evan. \"That was very careless of you, \u0027 Mr. Reid,\" she said coldly.\u003c/p\u003e\n\u003cp\u003e\"Y0u could\u0027ve killed my horse while we were crossing the road.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" he told her. \"I didn\u0027t see you there.\"\u003c/p\u003e\n\u003cp\u003e\"We were in full view,\" the woman said. \"Do you make it a point to break traffic laws?\"\u003c/p\u003e\n\u003cp\u003e\"My wife\u0027s not feeling well,\" Evan said, for lack of a better excuse. \"I\u0027m on my way to the drugstore.\"\u003c/p\u003e\n\u003cp\u003eThe woman continued stroking the horse\u0027s neck. The animal rumbled with pleasure and seemed calm now. \"Kay\u0027s ill?\" she said, her visage softening a fraction. \"Is it serious?\"\u003c/p\u003e\n\u003cp\u003e\"Headache,\" he said. \"But she\u0027s staying home from school today\"\u003c/p\u003e\n\u003cp\u003e\"I see.\" She peered through the window, beyond Evan. \"That\u0027s your little girl?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, it is.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s very beautiful. Hello, there.\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Lo,\" Laurie said.\u003c/p\u003e\n\u003cp\u003eDrago\u0027s eyes moved back to Evan\u0027s. \"You should be more careful. Someone could have been hurt.\"\u003c/p\u003e\n\u003cp\u003e\"Is that your horse?\" Laurie asked her, leaning forward to peer up at her.\u003c/p\u003e\n\u003cp\u003e\"His name\u0027s Joker,\" Drago said. The horse\u0027s ears twitched. \"I\u0027ve been exercising him this morning. He\u0027s a fine horse, isn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s so pretty!\" Laurie said, the near-accident now fading into the past. \"I like horses!\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s good. I have twenty horses at my stables. Perhaps your mother and father will bring you to go riding someday soon.\"\u003c/p\u003e\n\u003cp\u003e\"Could I, Daddy?\" Laurie looked to him.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll see,\" he said, smoothing her hair. When he looked into Drago\u0027s eyes he saw something Hash there, something quick and dark and dangerous\u003c/p\u003e\n\u003cp\u003e\"I hope you\u0027ll bring her out,\" Drago said. \"Every woman should know how to master a horse.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s got time for that.\"\u003c/p\u003e\n\u003cp\u003e\"Indeed she does,\" the woman said, and smiled very slightly.\u003c/p\u003e\n\u003cp\u003eA car\u0027s horn blew for Evan to clear the intersection.\u003c/p\u003e\n\u003cp\u003eHe said, \"I\u0027m sorry this happened, Dr. Drago. I\u0027ll take more care in the future.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she said. \"You should.\" And then she expertly wheeled the horse around with one hand and her heels, and rode off in the opposite direction. Evan waved to the driver of the other car and then drove on toward the Circle.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s so nice,\" Laurie said. \"I\u0027d like to go see her horses.\"\u003c/p\u003e\n\u003cp\u003eEvan was silent. The Circle was ahead, with its neat little shops.\u003c/p\u003e\n\u003cp\u003eIn the center he noticed that most of the flowers had died under the extreme heat.\u003c/p\u003e\n\u003cp\u003eAnd on the outskirts of Bethany\u0027s Sin, near the large welcoming sign, Neely Ames paused behind the red lawn mower to mop his face with his arm. The sun was searing him, and there was a lot more ground to cover before he\u0027d be finished. He felt as if his eyelids were puffed from the heat, and around him trees drooped toward the earth.\u003c/p\u003e\n\u003cp\u003eHe was beginning to look forward to that special sassafras tea Mrs.\u003c/p\u003e\n\u003cp\u003eBartlett had ready for him almost every night now.\u003c/p\u003e\n\u003cp\u003eIt was always so cold, and made him sleep so well. \u003c/p\u003e","sourceLink":"https://allnovel.net/bethany-s-sin/page-21.html","bookId":2472,"creation":"Oct 5, 2019 4:45:58 PM","modification":"Oct 5, 2019 4:45:58 PM"}
