{"id":74194,"no":7,"title":"Page 7","content":"\u003cp\u003eI lead the way, James clinging to my hand.\u003c/p\u003e\n\u003cp\u003eIt’s crazy—the last time we were here, we were on the run from Warner. Me and Juliette. It was the first time she met James, the first time it felt like we could really have a life together. And then Kenji showed up and redirected the course of everything. I shake my head, remembering. It feels like a million years ago, somehow. So much has changed. I was practically a different guy back then. I feel much older and harder and angrier now. Difficult to believe it was only a few months ago.\u003c/p\u003e\n\u003cp\u003eThe front door is still messed up from when Warner and his guys busted it open, but we make do. I yank on the handle and then shove, hard, and the door swings inward.\u003c/p\u003e\n\u003cp\u003eSuddenly we’re all crossing the threshold.\u003c/p\u003e\n\u003cp\u003eI’m looking around, amazed to see everything almost exactly the way we left it. A few things are knocked over and the place needs a serious cleaning, but it’ll work. It’ll be a great, safe place to live for a while. I start flipping switches and the small rooms flicker to life, fluorescent lights humming steadily in the silence. James bolts toward his bedroom, and I check the cabinets for canned goods and nonperishable items; we’ve still got tons of Saran-wrapped packages for the Automat.\u003c/p\u003e\n\u003cp\u003eI breathe a sigh of relief.\u003c/p\u003e\n\u003cp\u003e“Who wants breakfast?” I ask, holding up a few packets.\u003c/p\u003e\n\u003cp\u003eKenji falls to his knees, shouting, “Hallelujah!” in the process; Ian practically tackles me. James comes racing out of his room shouting, “ME ME ME I DO I DO,” and Lily laughs her head off. Alia smiles and leans against the wall as Brendan and Winston collapse on the couch, groaning in relief. Castle is the only one who remains silent.\u003c/p\u003e\n\u003cp\u003e“All right, everyone,” Kenji says. “Adam and I will get the food going, and the rest of you can take turns washing up. Also, I hate to be super obvious here, but there’s only one bathroom, and we all have to share, so let’s please be aware of that. Adam’s got some supplies, but not too much, so let’s be frugal, okay? Let’s remember we’re living on rations now. Consideration is crucial.”\u003c/p\u003e\n\u003cp\u003eThere’s general consent and lots of nodding, and everyone busies themselves with a different kind of preparation. Everyone except Castle, who sits down in the single armchair and doesn’t move. He seems to be doing worse than Brendan and Winston, who happen to be in actual physical pain.\u003c/p\u003e\n\u003cp\u003eI’m still staring at the two of them when Ian slips away from the group to ask me if I have anything to help patch up Brendan and Winston. I assure him that I’ll use whatever supplies I’ve got to fix them up as best I can. I always have a little medical kit at home, but it’s not extensive, and I’m not a medic. But I know enough. I think I’ll be able to help. This cheers up Ian significantly.\u003c/p\u003e\n\u003cp\u003eIt’s only once Kenji and I are busy preparing food in the kitchen that he brings up the most pressing issue. The one I’m still not sure how to resolve.\u003c/p\u003e\n\u003cp\u003e“So what are we going to do about Juliette?” Kenji asks, tossing an Automat packet into a bowl. “I’m already worried we waited this long to go after her.”\u003c/p\u003e\n\u003cp\u003eI feel myself pale. I don’t know how to tell him I had no immediate plans to go back out there. Certainly not to fight—not after what happened to James. “I don’t know,” I say. “I’m not sure what we can do.”\u003c/p\u003e\n\u003cp\u003eKenji stares at me, confused. “What do you mean? We have to get her out of there. Which means we have to break her out of there, which means we’ve got to plan another rescue mission.” He shoots me a look. “I thought that was obvious.”\u003c/p\u003e\n\u003cp\u003eI clear my throat. “But what about James? And Brendan and Winston? And Castle? We’re not doing too well over here. Is it okay to just leave them here and—”\u003c/p\u003e\n\u003cp\u003e“Dude, what the hell are you talking about? Aren’t you in love with this girl? Where’s the fire under your ass? I thought you would be dying to get to her right now—”\u003c/p\u003e\n\u003cp\u003e“I am,” I say urgently. “Of course I am. I’m just worried—it’s so soon after they bombed Point that I just—”\u003c/p\u003e\n\u003cp\u003e“The longer we wait, the worse it’s going to get.” Kenji shakes his head. “We have to go as soon as possible. If we don’t, she’ll be stuck there forever, and Warner will use her as his torture monster. He’ll probably kill her in the process without even meaning to.”\u003c/p\u003e\n\u003cp\u003eI grip the edge of the counter and stare into the sink.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eShit shit shit.\u003c/p\u003e\n\u003cp\u003eI spin around at the sound of James’s voice, listen for a moment as he laughs at something Alia said. My heart constricts just thinking about walking away from him again. But I know I have a responsibility to Juliette. What would she do if I weren’t there to help her? She needs me.\u003c/p\u003e\n\u003cp\u003e“Okay,” I sigh. “Of course. What do we have to do?”\u003c/p\u003e\n\u003cp\u003eFIFTEEN\u003c/p\u003e\n\u003cp\u003eAfter breakfast, which was actually closer to lunch, I tend to Brendan and Winston for a bit, and set them up on the floor so they can get some proper rest. James and I had collected a decent stash of ratty blankets and pillows over the years, so there’s just enough to go around, and thank God for that, because it’s cold as hell. We even wrapped a blanket around Castle’s shoulders. He’s still barely moving, but we forced him to eat, so at least he’s got a little color in his cheeks now.\u003c/p\u003e\n\u003cp\u003eWith Brendan and Winston settled, Ian and Alia and Lily fed and comfortable, James safe and sound, and Castle resting, Kenji and I are finally ready to initiate some new plans.\u003c/p\u003e\n\u003cp\u003e“I’m going to go out,” Kenji says. “Get on base and get nosy. Listen for rumors and whispers of what’s going on—maybe even find Juliette, give her a heads-up that we’re coming for her soon.”\u003c/p\u003e\n\u003cp\u003eI nod. “That’s a great start.”\u003c/p\u003e\n\u003cp\u003e“Once I know more about what’s going on, we can make a firm plan, scoop her up, and bring her home.”\u003c/p\u003e\n\u003cp\u003e“So as soon as she’s back,” I say, “we’ll have to move again.”\u003c/p\u003e\n\u003cp\u003e“Probably, yeah.”\u003c/p\u003e\n\u003cp\u003eI nod a few times. “Okay. All right.” I swallow hard. “I’ll wait here until you get back.”\u003c/p\u003e\n\u003cp\u003e“Sounds good.” Kenji grins, and then he’s gone. Disappeared. The front door is yanked open and yanked closed, and I’m staring at the wall and trying not to freak out too much about what’s going to happen next.\u003c/p\u003e\n\u003cp\u003eAnother mission. Which means another chance to screw everything up and get ourselves killed. And then, if we’re successful, we’re rewarded with more running, more instability, more chaos.\u003c/p\u003e\n\u003cp\u003eI close my eyes.\u003c/p\u003e\n\u003cp\u003eI love Juliette. I really do. I want to help her and support her and be there for her. I want us to have a future together. But sometimes I wonder if it’s ever going to happen.\u003c/p\u003e\n\u003cp\u003eThis isn’t easy to admit, but part of me doesn’t want to put James at risk again—on the run again—for a girl who broke up with me. A girl who walked away from us.\u003c/p\u003e\n\u003cp\u003eI don’t know what the right thing is anymore.\u003c/p\u003e\n\u003cp\u003eI don’t know if my allegiance is to James or Juliette.\u003c/p\u003e\n\u003cp\u003eSIXTEEN\u003c/p\u003e\n\u003cp\u003eKenji is back after only a couple of hours. His face ashen, his hands trembling. He’s breathing hard and his eyes are unfocused and he sits down on the couch without a word and I’m already panicking.\u003c/p\u003e\n\u003cp\u003e“What happened?” I ask.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Lily says.\u003c/p\u003e\n\u003cp\u003e“You okay, bro?” This from Ian.\u003c/p\u003e\n\u003cp\u003eWe pepper him with questions and he doesn’t answer. He stares, unblinking, a replica of Castle, who’s sitting in a chair across from him.\u003c/p\u003e\n\u003cp\u003eFinally, after a long moment of silence, he speaks.\u003c/p\u003e\n\u003cp\u003eThree words.\u003c/p\u003e\n\u003cp\u003e“Juliette is dead.”\u003c/p\u003e\n\u003cp\u003eChaos.\u003c/p\u003e\n\u003cp\u003eQuestions are flying and screams are muffled and everyone is shocked, horrified, freaking out.\u003c/p\u003e\n\u003cp\u003eI’m stunned.\u003c/p\u003e\n\u003cp\u003eMy brain feels paralyzed, unwilling to process or digest this information. Why? I want to ask. How? How? How is it possible?\u003c/p\u003e\n\u003cp\u003eBut I can’t speak. I’m frozen in horror. Grief.\u003c/p\u003e\n\u003cp\u003e“It wasn’t Warner who came after her,” Kenji is saying, tears falling fast down his face. “It was Anderson. Those were Anderson’s men. They made the announcement just a couple hours ago,” he says, choking on the words. “They said they bombed Omega Point, captured Juliette, and killed her just this morning. The supreme has already headed back to the capital.”\u003c/p\u003e\n\u003cp\u003e“No,” I gasp.\u003c/p\u003e\n\u003cp\u003e“We should’ve gone after her,” Kenji is saying. “I should’ve stayed behind—I should’ve tried to find her—it’s my fault,” he says, hands in his hair, fighting back tears. “It’s my fault she’s dead. I should’ve gone after her—”\u003c/p\u003e\n\u003cp\u003e“It’s not your fault,” Ian says to him, rushing over and grabbing his arms. “Don’t you dare put that on yourself.”\u003c/p\u003e\n\u003cp\u003e“We lost a lot of people,” Lily says. “People dear to us that we couldn’t save. This is not your fault. I promise. We did our best.”\u003c/p\u003e\n\u003cp\u003eEveryone is consoling Kenji now, trying to reassure him that there’s no guilt necessary. No person to blame for all this.\u003c/p\u003e\n\u003cp\u003eBut I can’t agree.\u003c/p\u003e\n\u003cp\u003eI trip backward until I hit the wall, leaning against it for support. I know who to blame. I know where the fault lies.\u003c/p\u003e\n\u003cp\u003eJuliette is dead because of me. \u003c/p\u003e","sourceLink":"https://allnovel.net/fracture-me-shatter-me-2-5/page-7.html","bookId":1774,"creation":"Oct 5, 2019 10:30:25 AM","modification":"Oct 5, 2019 10:30:25 AM"}
