{"id":70891,"no":14,"title":"Page 14","content":"\u003cp\u003e“You can say that again,” Matt says, striding up to our table. He says to Claire, “You’re gorgeous.”\u003c/p\u003e\n\u003cp\u003eShe giggles and plays with her earring.\u003c/p\u003e\n\u003cp\u003eMatt has a mortified-looking boy in tow. He nudges him. “So, ladies, Jackson and I were wondering if you’d like to double date.”\u003c/p\u003e\n\u003cp\u003e“Double date?” I ask with a laugh.\u003c/p\u003e\n\u003cp\u003e“Right,” Matt says, looking at me. “Jackson wants to dance with Kate and I want to dance with Claire.”\u003c/p\u003e\n\u003cp\u003eClaire’s mouth falls open.\u003c/p\u003e\n\u003cp\u003e“But we’re DJing,” I say, gesturing at the computer.\u003c/p\u003e\n\u003cp\u003eMatt looks around the streamer-covered pavilion. “Quincy! Get over here.” A tiny boy no older than nine comes sprinting over to Matt. “You know how to work iTunes?”\u003c/p\u003e\n\u003cp\u003eQuincy’s head bobs up and down quickly.\u003c/p\u003e\n\u003cp\u003e“Great, you’re DJing for a couple songs while Jackson and I take these lovely ladies on a date.” He stretches out an elbow to Claire, who takes his arm. I raise my eyebrows, smiling, and follow them out onto the dance floor with Jackson.\u003c/p\u003e\n\u003cp\u003eJackson sets his shaking hands on my waist and avoids my eyes. Sweat forms on his forehead and he rocks back and forth. I’m slow dancing with a penguin.\u003c/p\u003e\n\u003cp\u003eI’ve gotta start living.\u003c/p\u003e\n\u003cp\u003eI look over at Matt, who’s twirling a laughing Claire. Jackson keeps glancing at her. Almost as much as Megan keeps glancing at Eric, who is sitting on a picnic table, whittling yet another stick. Pretty soon this entire forest is gonna be out of sticks if he doesn’t stop whittling.\u003c/p\u003e\n\u003cp\u003e“Do you think Claire’s pretty?” I ask Jackson.\u003c/p\u003e\n\u003cp\u003e“Matt told me that if I dance with you first, he’ll get her to dance with me.”\u003c/p\u003e\n\u003cp\u003eI’m laughing now. Matt smiles at me and I return the grin. “Do you want to dance?” I mouth at him.\u003c/p\u003e\n\u003cp\u003eMatt raises his eyebrows and steers Claire toward us. He asks, “Hey, Claire, do you mind dancing with Jackson so I can dance with Kate?” Matt whispers to her.\u003c/p\u003e\n\u003cp\u003e“Uhhh…” she says, glancing at Jackson.\u003c/p\u003e\n\u003cp\u003e“For me?” Matt asks. “I really want to dance with Kate.”\u003c/p\u003e\n\u003cp\u003e“Yeah, no problem,” Claire says, rolling her shoulders.\u003c/p\u003e\n\u003cp\u003eI wrap my arms around Matt’s neck and he pulls me in close. Over his shoulder, Megan gives us a disapproving glare, and Andrea looks like she wants to stab me, but whatever.\u003c/p\u003e\n\u003cp\u003eHe’s the perfect height for me. Only a few inches taller. His body fits snuggly against my curves. This is the first time I’ve experienced his cologne. It’s woodsy. He smells like walking in a forest.\u003c/p\u003e\n\u003cp\u003e“Your dress is pretty,” he whispers in my ear.\u003c/p\u003e\n\u003cp\u003e“You dance well.”\u003c/p\u003e\n\u003cp\u003e“You feel good.”\u003c/p\u003e\n\u003cp\u003eHe thinks I feel good?!\u003c/p\u003e\n\u003cp\u003e“You do too,” I mumble, nearly choking on the words.\u003c/p\u003e\n\u003cp\u003e“I love your hair,” he says, clutching a clump of it.\u003c/p\u003e\n\u003cp\u003e“I love your invisible shoes.” We look down at his bare feet, and laughing, we look up at each other. He shakes the dirty blond hair out of his eyes and holds my gaze, pulling me closer. My heart pounds against his chest.\u003c/p\u003e\n\u003cp\u003eI can barely think. All I can concentrate on are his skin and warmth and how I want to press my mouth to his. Like seven years ago. I want him to pull me behind the pavilion again.\u003c/p\u003e\n\u003cp\u003eMegan appears behind Matt and clears her throat. “I need you two to chaperone the dance now, got it?”\u003c/p\u003e\n\u003cp\u003e“It’s just one dance,” Matt says, letting me go. When he’s out of my arms, I feel like I’ve lost a limb.\u003c/p\u003e\n\u003cp\u003e“This is a job,” she says under her breath, throwing me a dirty look. “You aren’t paid to socialize with each other.”\u003c/p\u003e\n\u003cp\u003eSo Andrea and Carlie are allowed to go smoke cigarettes by the lake every night, but I can’t share one dance with Matt?\u003c/p\u003e\n\u003cp\u003e“It’s fine,” I tell Matt. “I’m sorry,” I tell Megan, then head over to DJ again. I change the music to rap and all the kids start jumping around in a mosh pit.\u003c/p\u003e\n\u003cp\u003eMatt goes back to pouring punch. He talks to Andrea, Ian, and Carlie, laughing with them, but Megan doesn’t seem to mind. It’s okay for them to socialize on the clock. If Megan pisses Carlie off, Carlie could put in a bad word with her mom, ensuring Megan doesn’t get the job at the regional conference.\u003c/p\u003e\n\u003cp\u003eMaybe it’s a good thing they’re trying to keep me away from Matt. It’s not like I’ve had the best judgment in the past. What if I end up sinning again? I don’t think I’m the kind of girl who’d ever end up pregnant, but like I told Parker, one thing leads to another.\u003c/p\u003e\n\u003cp\u003eLast night when I thought of Matt, my skin flushed. The thought of his woodsy cologne makes my stomach leap into my throat. Being around him makes my body go hot everywhere.\u003c/p\u003e\n\u003cp\u003eThat dance with Matt just might have been the best moment of my life.\u003c/p\u003e\n\u003cp\u003eOn Friday morning, before the campers leave for home, we all go to Woodsong Chapel for morning devotion. Megan tells the campers we have twenty minutes to sit and think about God and pray or do whatever we want, so long as we’re silent.\u003c/p\u003e\n\u003cp\u003eI decide not to go to the altar, but to bury my face between my knees and stare at the ants marching through the dirt between my flip-flops. To God, we’re all ants.\u003c/p\u003e\n\u003cp\u003eI stare up at the sunlight filtering through the trees and wonder how Emily could question whether God exists. This place is perfect. How could any of it be possible without a God?\u003c/p\u003e\n\u003cp\u003eHe speaks to people here.\u003c/p\u003e\n\u003cp\u003eI examine my hand. It’s perfect. Five fingers that allow me to touch, grasp, feel, move, hold, rub, test. How could something so perfect have come into being without God making it so?\u003c/p\u003e\n\u003cp\u003eNone of the campers have approached the altar—no one wants to be first, but then I see Matt stand and make his way past the log benches. He tips onto his knees and his cross necklace swings like a pendulum as he bows his head. I really want to know what he prays about. Who does he pray for?\u003c/p\u003e\n\u003cp\u003eAfter morning devotion, we walk the campers back to the welcome pavilion, where we’ll see them off. Everyone is exchanging email addresses and signing T-shirts and hugging good-bye.\u003c/p\u003e\n\u003cp\u003eI wrap my arms around Claire. “Go to some dances for me this year, okay?”\u003c/p\u003e\n\u003cp\u003e“I will,” she whispers. “Jackson asked for my email address!”\u003c/p\u003e\n\u003cp\u003e“Nice!” I say.\u003c/p\u003e\n\u003cp\u003eWhen I hug Sophie good-bye, I tell her how much her decoupage vase impressed me. “Stick with art, okay?”\u003c/p\u003e\n\u003cp\u003eShe smiles. “I will.”\u003c/p\u003e\n\u003cp\u003eThen I spot Matt on one knee, speaking quietly with Quincy, the boy who played DJ last night. Matt takes off his wood chip nametag and hands it to him. The little boy puts it around his neck, smiling. I quietly step toward them and see that a phone number is written on the other side. I have no idea what they talked about this week, what sort of bond they formed, but I want to bottle the look on Matt’s face.\u003c/p\u003e\n\u003cp\u003eBy noon, all of the campers have left to go home and I’m standing here, looking at the empty green field. Thinking about how some parts of this week weren’t that great, but a lot of it rocked. I smile, reliving the dance with Matt, remembering the cheeseburgers I made all by myself, thinking about how Claire grew more confident this week.\u003c/p\u003e\n\u003cp\u003eI ran outside again. On actual grass!\u003c/p\u003e\n\u003cp\u003eAll in only a week.\u003c/p\u003e\n\u003cp\u003eMegan toots her whistle. “Everybody gather around me…You need to be back here by six p.m. on Sunday evening, to prepare for Monday. Kate and Parker, if you could please be here by five p.m., Eric will give you some pointers on starting fires and first aid.”\u003c/p\u003e\n\u003cp\u003eParker and I catch each other’s eyes, and we nod at Megan.\u003c/p\u003e\n\u003cp\u003e“Great first week, guys,” Megan says with a smile, and everyone cheers.\u003c/p\u003e\n\u003cp\u003eEveryone goes to pack up their cabins and clean. By the time I get my suitcase back to my car beside the tree line, to get ready for my forty-five-minute drive home, nearly everyone else is gone. Andrea’s Camaro and Matt’s Jeep are still here, and so is Brad’s little blue Datsun, but I don’t see him anywhere.\u003c/p\u003e\n\u003cp\u003eAndrea and Matt are talking quietly beside his Jeep, so I avoid their faces and pop my trunk.\u003c/p\u003e\n\u003cp\u003e“Kate,” Matt calls out to me, even though he’s still standing with her.\u003c/p\u003e\n\u003cp\u003eShe gives me the Death Stare to end all Death Stares.\u003c/p\u003e\n\u003cp\u003e“Can you hold up a sec?” he asks me. I nod, and he turns his attention back to Andrea. I lift my suitcase into the trunk of my car, shut it, and then stand here, jingling my keys. I can’t hear what they’re saying.\u003c/p\u003e\n\u003cp\u003eA minute later, she climbs in her Camaro and shuts the door. The car bolts up the dusty road out of camp. Matt stares after her for a few heartbeats before walking my way.\u003c/p\u003e\n\u003cp\u003eWhat was Andrea talking about last week, when she said to Carlie, “You think he’d be over it by now”?\u003c/p\u003e\n\u003cp\u003eMatt stops right in front of me, taking in my eyes, ruffling his hair. “See you Sunday.”\u003c/p\u003e\n\u003cp\u003eI twist the purity ring Mom gave me around my finger. “Looking forward to it.”\u003c/p\u003e\n\u003cp\u003e“Yeah? Me too. You can make my breakfast on Monday.”\u003c/p\u003e\n\u003cp\u003e“I’ll try,” I say, laughing.\u003c/p\u003e\n\u003cp\u003eHe glances around, I guess to make sure we’re alone, and then pulls me into a bear hug. His touch makes my knees buckle. His breath is warm on my ear as he whispers, “What’s your last name again?”\u003c/p\u003e\n\u003cp\u003eHe doesn’t know my last name?! And we’ve been dancing and splashing in the pool and sitting in the darkness together? He was my first dance, my first kiss. Him not knowing my last name makes me feel embarrassed and nervous and excited all at once.\u003c/p\u003e\n\u003cp\u003e“It’s Kelly.”\u003c/p\u003e\n\u003cp\u003e“Kate Kelly?” His blue eyes look happy as his hands settle around my waist. “That’s pretty.”\u003c/p\u003e\n\u003cp\u003e“See you on Sunday.”\u003c/p\u003e\n\u003cp\u003e“Yep,” he says. He lets me go, then jogs over to the Jeep with no doors and hops in and buckles his seat belt. Matt looks back over his shoulder at me and grins and waves.\u003c/p\u003e\n\u003cp\u003e“You need doors!” I call out. “That Jeep is a death trap.”\u003c/p\u003e\n\u003cp\u003e“It’s an adventure!”\u003c/p\u003e\n\u003cp\u003eThe real adventure is waiting for Monday, when I’ll see him again.\u003c/p\u003e\n\u003cp\u003eI let out a loud groan when I reach my room and collapse onto the bed. I power up my laptop and shut my eyes, trying to relax. I never knew how important air-conditioning and Diet Coke were until now. Thank you, God, for AC and Diet Coke.\u003c/p\u003e\n\u003cp\u003eI check my email. Lots of junk. Two emails from Emily that I’m afraid to open. I drum my fingers on my laptop. I will go see her this weekend. I will. I bite down on my thumb, trying to ignore her voice running on repeat in my mind.\u003c/p\u003e\n\u003cp\u003e“You’re being a judgmental bitch,” she’d said.\u003c/p\u003e\n\u003cp\u003eI resolve to go see her on Sunday before heading back to camp—I worry she doesn’t have enough money to buy food.\u003c/p\u003e\n\u003cp\u003eAn email from Facebook pops up. Matthew Brown wants to be my friend. My hand shakes as I accept the friend request. I’m scared to check his profile, for fear of finding pictures of him with other girls or something, but I can’t help it.\u003c/p\u003e\n\u003cp\u003eWhen I see his picture, I grin. It’s of him and a woman that must be his mother. She has the same dirty blond hair, blue eyes, and warm smile. He’s kissing her cheek and she’s laughing.\u003c/p\u003e\n\u003cp\u003eI can’t stop staring at his blue eyes.\u003c/p\u003e\n\u003cp\u003eHeat rushes through my body as I remember him wading up to me in the pool, his eyes taking in every bit of me by moonlight.\u003c/p\u003e\n\u003cp\u003eAnother Facebook email pops up. “You have a message from Matthew Brown.” \u003c/p\u003e","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-14.html","bookId":1968,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
