{"id":70895,"no":18,"title":"Page 18","content":"\u003cp\u003eHe grins and sets his hands on my waist, pulling me closer. “That was a nice surprise,” he murmurs, then leans back in and kisses me more deeply. His lips are soft, moving gently, exploring. I wrap my arms around his neck and he digs his thumbs into my hips. I taste Tootsie Roll on his tongue.\u003c/p\u003e\n\u003cp\u003eA buzzer goes off when the game timer hits zero.\u003c/p\u003e\n\u003cp\u003eBut we just got started.\u003c/p\u003e\n\u003cp\u003esketch #358\u003c/p\u003e\n\u003cp\u003ewhat happened last night\u003c/p\u003e\n\u003cp\u003eBrother Michael is giving a sermon about caring for the elderly and Meals on Wheels or something, but I’ve got an itch. I grab a little offering envelope and one of those tiny pencils you only seem to see at church and on golf courses. Mom sniffs when she sees what I’m doing.\u003c/p\u003e\n\u003cp\u003eI start sketching Matt’s hand.\u003c/p\u003e\n\u003cp\u003eUnder a full moon and a sky full of stars, we sprinted out of the Fun Tunnel, laughing and holding hands, jumping in circles. When we reached his Jeep, Matt gently leaned me against the door and kissed me so fully, the whole world went dark. It was just me and him and our bodies and a spark that flicked on and wouldn’t go out. His fingers traced from my ear to my chin, from my chin to my cheek, from my cheek to my lips.\u003c/p\u003e\n\u003cp\u003eI take care to draw the creases of his hand. I make his nails rugged but clean.\u003c/p\u003e\n\u003cp\u003eHe dragged his fingers along the back of my neck as he pulled me forward so his mouth met mine.\u003c/p\u003e\n\u003cp\u003eI grin as I shade the dip between his forefinger and thumb.\u003c/p\u003e\n\u003cp\u003eMom keeps sniffing and Daddy keeps looking at me sideways and smiling, so I carefully fold the drawing and stick it in my Bible.\u003c/p\u003e\n\u003cp\u003eI put the little pencil back into its holder and try to focus on the sermon.\u003c/p\u003e\n\u003cp\u003etell me what you want from me\u003c/p\u003e\n\u003cp\u003esunday, june 10 ~ week 2 of 7\u003c/p\u003e\n\u003cp\u003ePart of me is still giddy about my date with Matt and can’t wait to see him again in a few hours when counselors return to camp. To be honest, he and I didn’t talk much the rest of the night. He drove me home, where we sat in the driveway and kissed and kissed and kissed. His fingers explored every inch of my face and I couldn’t stop touching his strong shoulders and dirty blond hair. Mom and Daddy were asleep when I finally dragged myself inside. I stayed awake for hours, thinking of Matt, and overslept and nearly missed Sunday school this morning. I kept thinking, Matt, Matt, Matt, and I felt so good inside it felt wrong.\u003c/p\u003e\n\u003cp\u003eBut the other half of me is terrified to see Emily today. We haven’t spoken since graduation, when we told each other good luck and walked away without even a hug. And according to Mom, Emily hasn’t contacted her parents since they kicked her out of the house.\u003c/p\u003e\n\u003cp\u003eThe only reason I know where she lives is because Mom got Mr. Munroe, the mailman, to spill the beans about where Emily’s mail is being forwarded to, and maybe I’m invading her privacy, but I need to give her part of my paycheck. To make sure she has enough to eat. It’s the right thing to do.\u003c/p\u003e\n\u003cp\u003eBefore driving to Nashville, I stop at Sonic to get a cherry limeade, to soothe my nerves, and find Will Whitfield there when I pull into the parking lot. He’s lounging at a picnic table, talking to Sam Henry and Drew Bates.\u003c/p\u003e\n\u003cp\u003eI order my drink, then watch the guys chat until Will looks over. He grins and beckons me. In high school, I never would’ve gotten out of my car at Sonic to talk to people, but I slowly open my door and make my way to him. Drew narrows his eyes while Sam shakes his Styrofoam cup, rattling the ice around.\u003c/p\u003e\n\u003cp\u003e“Hey,” Will says, standing up. “Want to join us?”\u003c/p\u003e\n\u003cp\u003e“Thanks, but I’m on my way to Nashville to see Emily Mansfield before going back to camp.”\u003c/p\u003e\n\u003cp\u003e“What happened to her anyway? I haven’t seen Jacob around in weeks. Are they okay?”\u003c/p\u003e\n\u003cp\u003eI clear my throat. “I guess they’re both sad about the breakup,” I lie.\u003c/p\u003e\n\u003cp\u003eWill tilts his head. “Oh.”\u003c/p\u003e\n\u003cp\u003e“We had a class together, right?” Sam asks me, chomping on his ice.\u003c/p\u003e\n\u003cp\u003e“Yeah,” I reply. “Art.”\u003c/p\u003e\n\u003cp\u003eHe points at me. “That’s it.” He grins like he’s seeing me for the first time, and I don’t know what’s more embarrassing—that I’m forgettable, or that my artwork is forgettable.\u003c/p\u003e\n\u003cp\u003eMy face flushes and I’m turning to climb back in my car when Will touches my elbow. “How was the date?”\u003c/p\u003e\n\u003cp\u003eI can’t stop my smile. “Fun. Unexpected. Crazy.”\u003c/p\u003e\n\u003cp\u003eWill laughs, nodding. “That sounds like Matt. You gonna see him again?”\u003c/p\u003e\n\u003cp\u003e“I’ll see him tonight at work—”\u003c/p\u003e\n\u003cp\u003e“I know that. But another date?”\u003c/p\u003e\n\u003cp\u003eI bite my lips together and sneak a peek at Drew, who’s still staring at me. “I hope so, yeah.”\u003c/p\u003e\n\u003cp\u003e“Nice,” Will says, patting my shoulder. “You look happy.”\u003c/p\u003e\n\u003cp\u003eDid Will and Parker tell Drew that I was surprised he’s gay and now he’s pissed? My face goes hot when Drew rolls his eyes at me. Will catches him doing it and leans over to whisper in my ear. “Don’t worry about him. He’s really protective of Parker because they’ve been friends forever.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Will whispers. “And you go to Parker’s church, therefore Drew believes you are evil.”\u003c/p\u003e\n\u003cp\u003eI laugh a sad laugh.\u003c/p\u003e\n\u003cp\u003e“Don’t worry about it,” Will says, patting my shoulder, but I know I will.\u003c/p\u003e\n\u003cp\u003eA roller-skating waitress brings me my cherry limeade, so I say good-bye to the guys and get back into my car.\u003c/p\u003e\n\u003cp\u003eI sip my drink through the straw, wondering if Sam will forget about me again. I want people I can call if my car breaks down on the side of the interstate. Judging by the way Drew treated me, he only seems to associate me with bad stuff. At the stoplight, I close my eyes and lean my forehead against the steering wheel. I don’t know where I get off thinking I deserve to be remembered.\u003c/p\u003e\n\u003cp\u003eIn Nashville, I park outside Emily’s new apartment. A few pieces of trash litter the parking lot, which has been overrun by cracks and weeds. I climb two flights of metal stairs to reach her door. A rip runs down the screen. She’s definitely here—I can hear a violin crooning inside. I ring the doorbell and try to figure out what to do with my hands while waiting. I settle for sticking my thumbs in the pockets of my jean shorts.\u003c/p\u003e\n\u003cp\u003eI hear locks unlocking and the door whips open to reveal Emily standing there in a white tank and khaki shorts. Her auburn hair is pulled back into a messy ponytail. Darkness rings her eyes. But they brighten a little when she sees me.\u003c/p\u003e\n\u003cp\u003e“Hey. Want to come in?” She pushes the screen open. I step inside. I had no idea her living room, bedroom, and dining room would all be merged into one. It’s so small. I turn in a circle. A piece of cardboard covers a broken window. Bits of linoleum are flaking away from the floor, like sunburned skin. I bite the inside of my cheek when I see a mousetrap.\u003c/p\u003e\n\u003cp\u003eI spin around to find the butterfly painting I painted for her sixteenth birthday hanging over a sagging couch. She remembered my art. My eyes burn.\u003c/p\u003e\n\u003cp\u003eShe relocks the door, slides the security chain into place, and eyes my shorts. I wore the short ones Mom bought me because I think Matt will like them. Now I wonder if I shouldn’t have.\u003c/p\u003e\n\u003cp\u003e“How did you find me?” she asks.\u003c/p\u003e\n\u003cp\u003e“Mom found out. From the mailman.”\u003c/p\u003e\n\u003cp\u003eHer mouth forms an O. “What are you doing here?”\u003c/p\u003e\n\u003cp\u003eI pull my lower lip between my teeth and reach into my back pocket and grab the money. “I wanted to bring you this. You know, in case you needed it.” I cough into a fist. “For your rent or groceries or whatever.”\u003c/p\u003e\n\u003cp\u003eHer eyes grow dark. “Why would you think I’d want your money?”\u003c/p\u003e\n\u003cp\u003e“I thought I could help—” I thrust the money toward her hand. She steps back.\u003c/p\u003e\n\u003cp\u003e“You haven’t answered my calls for a month and now you show up and give me money?”\u003c/p\u003e\n\u003cp\u003e“I want to help.”\u003c/p\u003e\n\u003cp\u003e“If you want to help, you could call me once in a while. Or maybe pick up when I call you?”\u003c/p\u003e\n\u003cp\u003eI don’t know how to tell her that just seeing her reminds me of what we did. I put the money back in my pocket and stand in front of the butterfly painting.\u003c/p\u003e\n\u003cp\u003e“You kept it,” I say quietly.\u003c/p\u003e\n\u003cp\u003eShe appears beside me and studies the purple butterfly, its wings bursting open to reveal orange, yellow, red, and white. “This painting gave me the courage to play for the Youth Philharmonic.”\u003c/p\u003e\n\u003cp\u003eIf I hadn’t painted this butterfly for her, would she have still gone to D.C.? Because last summer is when she started changing.\u003c/p\u003e\n\u003cp\u003eI touch my throat, staring down at the stained linoleum. Mom would have a fit if she knew Emily was living here. She’d insist on redecorating it, that’s for sure.\u003c/p\u003e\n\u003cp\u003e“Do you, um, want to sit down?” Emily asks. “Maybe we can go out for something to eat? I can’t afford much, but I get fifty percent off at the diner where I’m working nights.”\u003c/p\u003e\n\u003cp\u003e“I’m not sure,” I reply. “I have to be back at camp early.”\u003c/p\u003e\n\u003cp\u003e“How’s that going?”\u003c/p\u003e\n\u003cp\u003eI swallow. “Not too bad. Um…” Now that I’m here, I know how much I miss her. The pain is deeper, rawer than it is when she’s not around. I want to tell her that. But I need to know something first.\u003c/p\u003e\n\u003cp\u003e“Did you ask for forgiveness?”\u003c/p\u003e\n\u003cp\u003e“Ask who for forgiveness?” Sadness rings in her voice.\u003c/p\u003e\n\u003cp\u003e“God. You know, for what we did.”\u003c/p\u003e\n\u003cp\u003e“I want to move on already. Can’t you forgive me?”\u003c/p\u003e\n\u003cp\u003e“You care about my forgiveness but not God’s?”\u003c/p\u003e\n\u003cp\u003e“I care more about yours.”\u003c/p\u003e\n\u003cp\u003eThe tears start to well in my eyes. Is my friend going to Hell? And will I be there with her? I wipe my cheek with the heel of my hand.\u003c/p\u003e\n\u003cp\u003e“Your shorts are cute,” she says.\u003c/p\u003e\n\u003cp\u003e“That’s all you care about? My shorts?” I’m pissed, but part of me wants her to know why I’m wearing the shorts. Matt. How he can make doughnuts over a campfire and how he invented a new kind of dodgeball.\u003c/p\u003e\n\u003cp\u003e“Do you want something to drink?” she asks, gesturing at her tiny kitchen. “I have water, and, um…” She looks over her shoulder, blushing.\u003c/p\u003e\n\u003cp\u003eI shake my head.\u003c/p\u003e\n\u003cp\u003e“Look…” she says. “I’m sorry about what I said that day.”\u003c/p\u003e\n\u003cp\u003e“I don’t want to talk about it.” I find myself crossing my arms across my stomach and inching away from her.\u003c/p\u003e\n\u003cp\u003e“I was so angry,” she adds. “I can’t even explain what I felt like. I mean, my parents…it was like I killed part of them by doing what I did…And I needed you.”\u003c/p\u003e\n\u003cp\u003e“I needed you too. I still feel bad about what I did…Maybe if I hadn’t agreed, you wouldn’t have gone through with it,” I mumble, wiping my nose.\u003c/p\u003e\n\u003cp\u003e“It was my decision,” she says. “Only I should be allowed to regret it.”\u003c/p\u003e\n\u003cp\u003e“Do you?”\u003c/p\u003e\n\u003cp\u003eHer eyes close. “You really won’t forgive me for this, will you?”\u003c/p\u003e\n\u003cp\u003e“I forgive you, but we need God’s forgiveness too. It’s not about you—”\u003c/p\u003e\n\u003cp\u003e“That’s just it,” she exclaims. “It is about me. About me and Jacob.” She covers her face. “I wish you hadn’t come here—I was finally starting to calm down and get into a rhythm and now you’re back and I feel terrible again and—”\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I say quickly. “I just need time and to talk and some help and—” \u003c/p\u003e","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-18.html","bookId":1968,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
