{"id":70897,"no":20,"title":"Page 20","content":"\u003cp\u003eHe takes my hand, looking around. “Why don’t you come sleep in Dogwood with all of us tonight?”\u003c/p\u003e\n\u003cp\u003eI shake my head.\u003c/p\u003e\n\u003cp\u003e“Is it Andrea? Don’t worry about her. She’ll get over it. Maybe Bumblebee Brad will strike her fancy.”\u003c/p\u003e\n\u003cp\u003eI giggle nervously. “It’s not Andrea…”\u003c/p\u003e\n\u003cp\u003e“Then what is it?” He kisses my knuckles.\u003c/p\u003e\n\u003cp\u003e“It’s not right for guys and girls to share a bed before marriage,” I mumble.\u003c/p\u003e\n\u003cp\u003eWill and Parker walk past, carrying their sleeping bags. Will is moving his hips like Ian did earlier and she is laughing hysterically, trying to sidestep her boyfriend and his grinding.\u003c/p\u003e\n\u003cp\u003e“They shared a bed last week,” Matt says.\u003c/p\u003e\n\u003cp\u003e“So? We’ve been on one date.”\u003c/p\u003e\n\u003cp\u003e“A great date.” He grins down at me and wraps his arms around my waist. “The best date ever.”\u003c/p\u003e\n\u003cp\u003e“You’re just saying that because you beat me at Skee-Ball.”\u003c/p\u003e\n\u003cp\u003e“And basketball.”\u003c/p\u003e\n\u003cp\u003e“You have to rub it in, eh?” I say with a grin.\u003c/p\u003e\n\u003cp\u003e“It’s fine,” Matt says, pressing his forehead to mine. “You don’t have to sleep in Dogwood.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” I reply, sighing a little. But what if he goes to sleep in Dogwood with everybody else? Andrea’s in there…\u003c/p\u003e\n\u003cp\u003e“Want to go running in the morning?”\u003c/p\u003e\n\u003cp\u003eI nod, even though my knee is sore. Matt grabs my bedding and suitcase and leads me to Pinecone, where we share a long, passionate kiss good night on the porch. I make my bed and unpack my clothes. I read from the Bible and pray for Brad and his father and whatever’s going on there, then spend some time sketching and studying my work.\u003c/p\u003e\n\u003cp\u003eFifteen minutes later, a knock sounds on the door and I shove my sketchbook under my covers. I look up to see Matt standing outside.\u003c/p\u003e\n\u003cp\u003e“Can I come in?” he asks.\u003c/p\u003e\n\u003cp\u003eMy heart goes wild. Does he want to make out or something? If I let that start, will he want to spend the night? Will he want to sleep in my bed like Will sleeps in Parker’s?\u003c/p\u003e\n\u003cp\u003e“It’ll just take a second,” he says, grinning.\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eMatt walks in, and like last Sunday night, he drags a bed from inside onto the porch. I watch through the screen as he unrolls his sleeping bag and crawls inside.\u003c/p\u003e\n\u003cp\u003e“Good night, King Crab Kate,” he says softly.\u003c/p\u003e\n\u003cp\u003e“Good night,” I say, laughing. I turn out the light and lie down. I focus on the gap between us, wanting to fill the space between. I can’t help it.\u003c/p\u003e\n\u003cp\u003e“Sweet dreams,” I say, and face the opposite wall so I won’t give in and invite him inside.\u003c/p\u003e\n\u003cp\u003eI flip my pillow over to the cool side.\u003c/p\u003e\n\u003cp\u003eMonday morning, after a run with Matt and after my new group of campers have arrived, I spend my break praying in the Woodsong Chapel. I kneel down in front of a splintered log serving as an altar and bow my head, trying to forget about what happened yesterday with Emily, but it recycles over and over in my mind. Minutes later I hear pine needles and sticks crunching beneath feet. I glance up to find Brad making his way down the path.\u003c/p\u003e\n\u003cp\u003e“Hey,” I say.\u003c/p\u003e\n\u003cp\u003eHe nods back at me and kneels a few feet away. What’s he praying for? I say a prayer for him, and then go back to thanking God for my date with Matt and asking God for forgiveness for helping Emily. When I’m finished, I stand carefully, so I don’t mangle my knee. Brad stands too and gives me a smile.\u003c/p\u003e\n\u003cp\u003e“Where you off to?” he asks.\u003c/p\u003e\n\u003cp\u003e“Art pavilion. I’ve got a group coming in a few minutes.” We hike up the trail together and I reach out to drag my fingers across pine needles dripping from trees.\u003c/p\u003e\n\u003cp\u003e“So you and Matt, huh?” He grins, slipping his hands in his pockets.\u003c/p\u003e\n\u003cp\u003eMy face blushes and I grin back at him, not saying a word.\u003c/p\u003e\n\u003cp\u003e“I so called it.”\u003c/p\u003e\n\u003cp\u003e“Are you seeing anyone?” I ask.\u003c/p\u003e\n\u003cp\u003eHe digs his hands further down into his pockets. “Nah…”\u003c/p\u003e\n\u003cp\u003eI furrow my eyebrows. Brad is cute, sweet, and nice. Granted, I don’t feel a strong pull to him like I do with Matt, but I am sure plenty of girls could feel like that toward him.\u003c/p\u003e\n\u003cp\u003e“I want to get out of here after this summer,” he says quietly. “That’d be hard if I had someone.”\u003c/p\u003e\n\u003cp\u003e“What are you trying to get away from? Why did you mention your dad yesterday?”\u003c/p\u003e\n\u003cp\u003eHe runs a hand over his head and focuses on his feet. “It’s just me and him. He drinks…he’s gotten worse ever since Mom left.”\u003c/p\u003e\n\u003cp\u003e“Your mom left?” I exclaim. “Why?”\u003c/p\u003e\n\u003cp\u003e“’Cause Dad is a nasty drunk, that’s why.” His eyes shift to his upper arm, where I saw the bruises last week.\u003c/p\u003e\n\u003cp\u003e“Where did she go?”\u003c/p\u003e\n\u003cp\u003e“Not sure, don’t care,” Brad says quietly. “She left before Christmas. She missed my graduation.” His voice is soft.\u003c/p\u003e\n\u003cp\u003eI can’t imagine my parents missing my graduation. They’d buy a bong before that would happen.\u003c/p\u003e\n\u003cp\u003e“That’s why you stayed here last weekend?” I ask.\u003c/p\u003e\n\u003cp\u003eHe shrugs. “I can’t afford to live anywhere else but at camp this summer. I need to save my money so I can leave…I want to take my road trip and get a job at a park.”\u003c/p\u003e\n\u003cp\u003e“Does your dad hurt you?”\u003c/p\u003e\n\u003cp\u003eHe touches his bruised bicep. “That’s not what scares me,” he whispers, staring off into the trees. A bird chirps above us. “I’m scared that”—he pauses to take a breath—“If I stay, I’ll end up like him. And my grandfather.”\u003c/p\u003e\n\u003cp\u003eHe looks over at me, his eyes begging me not to tell.\u003c/p\u003e\n\u003cp\u003e“Have you talked to Megan? She got you this job, right? She might understand—”\u003c/p\u003e\n\u003cp\u003eHe quickly shakes his head. “You know how strict she is. And I don’t want my church involved. It’ll just piss Dad off more.”\u003c/p\u003e\n\u003cp\u003eIf I keep this a secret and Megan finds out, Brad would get fired. If she finds out I knew, I’d get fired too, and my church and parents would be disappointed in me for lying. Can something like this stay a secret for five weeks?\u003c/p\u003e\n\u003cp\u003eI’m tempted to invite him to live with us, but Mom and Daddy would get all nosy and try to fix the situation between Brad and his dad, and it seems like Brad wants to leave.\u003c/p\u003e\n\u003cp\u003e“Can you do a better job of hiding your car?” I tell Brad.\u003c/p\u003e\n\u003cp\u003e“I will.” He squeezes my shoulder. “Hey, I’m glad about you and Matt. You deserve it. You’re a good person.”\u003c/p\u003e\n\u003cp\u003eA good person.\u003c/p\u003e\n\u003cp\u003eI shut my eyes, smiling a sad smile. Should a good person lie?\u003c/p\u003e\n\u003cp\u003eI trudge over to the art pavilion and start pulling out paint brushes and paper for my lesson, but I can’t stop thinking of Brad and how’s he’s a good Christian, but he’s willing to break a big rule like this. It’s a good rule. If Brad got hurt bad on a weekend, nobody would discover him until Sunday night.\u003c/p\u003e\n\u003cp\u003eI’ve always heard that saying, “Some rules are meant to be broken,” but no one ever says that even if the rule is meant to be broken, usually something bad happens when you break it.\u003c/p\u003e\n\u003cp\u003eBrad needs more help than just me covering for him.\u003c/p\u003e\n\u003cp\u003eHe needs a real family and friends and love.\u003c/p\u003e\n\u003cp\u003eBut I guess not all of us get that.\u003c/p\u003e\n\u003cp\u003eSometimes we get a mess. Like Emily did. And then you have to work past that or drown where you stand.\u003c/p\u003e\n\u003cp\u003eBefore Tuesday Talent Night, Matt takes my elbow and pulls me behind Great Oak. I tiptoe around the bushes, in case of poison ivy.\u003c/p\u003e\n\u003cp\u003e“What?” I whisper. “It’s almost time to start the show.”\u003c/p\u003e\n\u003cp\u003e“I can’t wait.”\u003c/p\u003e\n\u003cp\u003e“Wait for what?”\u003c/p\u003e\n\u003cp\u003eSticks snap under my feet as he shoves me up against the wooden wall and presses his mouth to mine. Kissing me hard and fast. My skin prickles. I’m panting. He pulls my hips against his.\u003c/p\u003e\n\u003cp\u003e“What if Megan hears us?” I ask. Her office is on the other side of this wall.\u003c/p\u003e\n\u003cp\u003e“Sometimes you just can’t wait,” he says between kisses. “Like at Just Tacos.”\u003c/p\u003e\n\u003cp\u003e“I’m not a taco,” I reply, playfully pushing him.\u003c/p\u003e\n\u003cp\u003e“Yummy,” he says against my lips. I run my fingers underneath the hemp necklace I made for him, caressing his collarbone.\u003c/p\u003e\n\u003cp\u003eI can hear Ian and two campers practicing Madonna’s “Material Girl” for tonight. And apparently he enlisted Will for some additional harmonies.\u003c/p\u003e\n\u003cp\u003eI gently nudge Matt away. “To be continued?” I whisper.\u003c/p\u003e\n\u003cp\u003e“Can’t wait.” He grins and sneaks another kiss. “By the way, will you be my date to the dance on Thursday?”\u003c/p\u003e\n\u003cp\u003e“Sure,” I say with a smile, and kiss him again.\u003c/p\u003e\n\u003cp\u003eAfter the girls are in bed that night, I climb the hill to the cafeteria. It’s the only place besides Megan’s office with a phone. And it’s a pay phone, at that. I drop two quarters into it and dial Emily’s cell number.\u003c/p\u003e\n\u003cp\u003eShe picks up on the second ring. “Hello?” She sounds confused. Probably has no idea whose this number is.\u003c/p\u003e\n\u003cp\u003e“Hi. It’s me, Kate.”\u003c/p\u003e\n\u003cp\u003eI hear a click. And then a dial tone fills my ear. And then a voice comes on, saying that if I’d like to make another call, I have to deposit more change.\u003c/p\u003e\n\u003cp\u003eThat’s when I hear the noises. I hang up the phone and sneak around the side of the building. So Matt was right about Ian and Carlie doing it behind the cafeteria. Ew. I hustle away, cringing.\u003c/p\u003e\n\u003cp\u003eAt midnight I sit on my porch and open my sketchbook to start writing her a letter, trying to explain what I feel. She hung up on me. She kicked me out. Why can’t she understand I only want her to pray with me? I wipe a tear away with the heel of my hand.\u003c/p\u003e\n\u003cp\u003eWhen I had surgery, Emily sat in the waiting room the entire time. Afterward, she drove home with me and my parents and curled up in my bed with me. She poured my favorite candy, Milk Duds, into my palm. For days she kept my water glass full and read aloud from trashy Hollywood magazines and told me how, at school, Will Whitfield had asked how I was doing. She played P!nk songs as we lay in bed, singing so loud Daddy told us to shush because Fritz kept howling along.\u003c/p\u003e\n\u003cp\u003eI tear the sheet of paper out of my sketchbook and crumple the letter in my fist.\u003c/p\u003e\n\u003cp\u003eWhy say anything if the person you’re talking to doesn’t get what you’re saying?\u003c/p\u003e\n\u003cp\u003eIs our friendship over for good?\u003c/p\u003e\n\u003cp\u003e“This is inhumane.”\u003c/p\u003e\n\u003cp\u003eParker has said that, like, eighty gazillion times, but after she didn’t show up for the Critter Crawl last week, Megan warned her that if she skipped it again, her pay would be docked.\u003c/p\u003e\n\u003cp\u003eTherefore, while the rest of us counselors are grappling with the campers, Parker is standing with her arms crossed. Glaring.\u003c/p\u003e\n\u003cp\u003e“Dude, your girlfriend looks pissed,” Ian mutters to Will.\u003c/p\u003e\n\u003cp\u003eOne of my boy campers waves a glass jar containing a gigantic spider.\u003c/p\u003e\n\u003cp\u003e“That poor animal,” Parker says. “He might never see his family again.”\u003c/p\u003e\n\u003cp\u003eIan is in charge of the Thursday afternoon Critter Crawl, so he takes a stick and draws a big ring in the dirt road. Then he makes a smaller circle inside it. At the same time, Megan walks over to Parker. And even though Megan’s talking quietly, I can tell by Parker’s expression that she’s done something wrong.\u003c/p\u003e\n\u003cp\u003eWill nudges Ian, pointing at Megan. Ian rolls his eyes and turns his back so the kids can’t see, and makes a jerking-off motion with his hand. The guys speak quietly to each other, then start laughing. \u003c/p\u003e","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-20.html","bookId":1968,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
