{"id":70903,"no":26,"title":"Page 26","content":"\u003cp\u003eJordan goes on, “And you were in my art class last semester.”\u003c/p\u003e\n\u003cp\u003eI smile. “I liked the collage you made with pictures of Brett Favre and a bunch of monkeys.”\u003c/p\u003e\n\u003cp\u003eGrinning, Jordan pushes my shoulder. Ow! She’s strong. “Dad liked my collage a lot too. He put it up in his office.”\u003c/p\u003e\n\u003cp\u003eWe sip our root beers.\u003c/p\u003e\n\u003cp\u003e“I liked that painting you did of heaven,” Jordan says. “The one with the sailboat?”\u003c/p\u003e\n\u003cp\u003eJordan Woods noticed one of my paintings? That one won first place at the fair. “Thank you.”\u003c/p\u003e\n\u003cp\u003e“I would’ve told you at school, but I didn’t want to interrupt you during art. I could tell it was serious for you. Not like the shit goof-off time it was for me and Henry, you know? He made that papier-mâché sculpture of a dog peeing on a fire hydrant.” Jordan rolls her eyes, but she’s smiling.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t have minded if you interrupted me,” I say quietly.\u003c/p\u003e\n\u003cp\u003e“I don’t like it when people bother me during weights or drills. I need to concentrate.”\u003c/p\u003e\n\u003cp\u003eI don’t need concentration, though. I like activity around me. It gives me ideas. Makes me think in dynamic ways. Makes the colors explode.\u003c/p\u003e\n\u003cp\u003eJordan thought I didn’t want to be approached when I did.\u003c/p\u003e\n\u003cp\u003eWhat did I look like in high school? A girl who lived in Emily’s shadow, where it was safe. The only place I broke out of my shell was on the soccer field, and when that ended, I shrunk even further back into the shadow.\u003c/p\u003e\n\u003cp\u003eBut Jordan saw me even when I thought I was invisible. And she’s strong and does what she feels is right. And besides all the sexist jerks out there, no one has a problem with her going after her goals and dreams of playing quarterback in college.\u003c/p\u003e\n\u003cp\u003eBut can I still open myself up to new experiences and new people while doing what I feel is right? Especially if other people don’t necessarily believe what I believe?\u003c/p\u003e\n\u003cp\u003eWhy is believing in football different than believing in God? Why is one more socially acceptable than the other?\u003c/p\u003e\n\u003cp\u003eI look up at Jordan. “Are you looking forward to college?”\u003c/p\u003e\n\u003cp\u003e“I’m officially moving up to Indiana next week. I’ve already been practicing with the team. And Henry’s shipped his stuff up to Michigan.” She gazes over at him and I can see the pain on her face.\u003c/p\u003e\n\u003cp\u003e“Are you guys gonna keep dating?”\u003c/p\u003e\n\u003cp\u003e“You’re like the only person who’s asked me that!”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Yeah—everyone else is scared to ask, I think.” She gulps her root beer. “But I know we’ll be fine.”\u003c/p\u003e\n\u003cp\u003e“Michigan isn’t that far from Indiana, right?”\u003c/p\u003e\n\u003cp\u003e“Yup. It takes longer to drive across Tennessee than it does to drive from Michigan to Purdue. We’ll still see each other plenty.”\u003c/p\u003e\n\u003cp\u003eThat’s when Sam Henry walks up and wraps his arms around her waist from behind. He sweeps her hair back and kisses her neck.\u003c/p\u003e\n\u003cp\u003e“Bedtime?” he asks, grinning at her.\u003c/p\u003e\n\u003cp\u003e“It’s like eight-thirty!” she replies, shaking her head.\u003c/p\u003e\n\u003cp\u003e“I know.” He stretches his arms and yawns a fake yawn, acting all dramatic. “It’s super late. I’m so sleepy,” he teases.\u003c/p\u003e\n\u003cp\u003eJordan glances at his face, then focuses on me again. I see the want written on her face. I used to see it on Emily’s face when she was with Jacob. Is that the same look I wear when I want to be alone with Matt?\u003c/p\u003e\n\u003cp\u003e“Go ahead,” I say.\u003c/p\u003e\n\u003cp\u003e“Nice talking to you.”\u003c/p\u003e\n\u003cp\u003e“Thanks for what you said, about my painting,” I say to Jordan.\u003c/p\u003e\n\u003cp\u003eShe nods. “Friend me on Facebook so I can see your other art.”\u003c/p\u003e\n\u003cp\u003eI watch as she and Sam Henry walk across the yard, ignoring everyone trying to talk to them—it’s like they are in their own little bubble—and go up the back steps into her house. A minute later I see a light flick on upstairs, and then it goes out again.\u003c/p\u003e\n\u003cp\u003eJordan and Sam love each other, but they love their dreams too. They love each other enough that it’s okay to risk being apart. I rub my throat, thinking of Emily and her dream to play violin for the National Symphony. Like Jordan, she wanted that same balance with Jacob. And she lost that balance.\u003c/p\u003e\n\u003cp\u003eMatt and I are still figuring out our balance.\u003c/p\u003e\n\u003cp\u003eHolding hands, Parker and Will stride up to me. “Ready to get out of here?” she asks me.\u003c/p\u003e\n\u003cp\u003e“I’m fine to hang out if y’all want to stay longer. Well, except for this guy used the worst pick-up line ever on me.”\u003c/p\u003e\n\u003cp\u003e“Gross,” Parker says. “What did he say?”\u003c/p\u003e\n\u003cp\u003eI point out Jake Reynolds and tell her what he said. He sees us pointing and blows me a kiss.\u003c/p\u003e\n\u003cp\u003e“He is so hot,” Parker whispers to me.\u003c/p\u003e\n\u003cp\u003e“I know!”\u003c/p\u003e\n\u003cp\u003e“I can hear you,” Will says, shaking his head and grinning.\u003c/p\u003e\n\u003cp\u003e“But you’re eight times cuter than he is,” Parker says to Will.\u003c/p\u003e\n\u003cp\u003e“Only eight times?” he replies. “I’m at least ten times—”\u003c/p\u003e\n\u003cp\u003e“Do you guys need me to drive? Did you drink?” I interrupt. I wasn’t watching to see if they drank.\u003c/p\u003e\n\u003cp\u003e“We don’t drink,” Will replies, dragging a hand up and down Parker’s arm.\u003c/p\u003e\n\u003cp\u003e“I’m starving,” she says.\u003c/p\u003e\n\u003cp\u003e“I want a Monster burger,” he whines to her.\u003c/p\u003e\n\u003cp\u003e“You are such a baby.” She gets up on tiptoes and kisses his lips. “We’ll get you your burger.”\u003c/p\u003e\n\u003cp\u003e“You guys are making me ill,” I say.\u003c/p\u003e\n\u003cp\u003eWill squeezes my shoulder and laughs. “You and Matt are just as bad.”\u003c/p\u003e\n\u003cp\u003eI swat his elbow. “Let’s go get Will’s burger already.”\u003c/p\u003e\n\u003cp\u003eI got home from Jiffy Burger after midnight.\u003c/p\u003e\n\u003cp\u003eNow it’s two in the morning and my phone just rang, waking up Fritz, who’s curled up in bed with me. Matt’s calling for the first time all week. It’s not like I expected him to call, considering you could buy a small island for what it costs to call international, but to call in the middle of the night?\u003c/p\u003e\n\u003cp\u003eI answer and hear music blaring in the background. I can feel the bass through the phone. He has to yell in order for me to hear.\u003c/p\u003e\n\u003cp\u003e“Are you having fun?” I ask.\u003c/p\u003e\n\u003cp\u003e“I’d be having a lot more fun if you were here.” He sounds really tired or buzzed.\u003c/p\u003e\n\u003cp\u003eI hear a girl calling his name. Is that Andrea? The music is making my head throb.\u003c/p\u003e\n\u003cp\u003eI rub my eye. “Matt, I miss you.” I don’t want to be one of those girls who is totally dependent on her boyfriend, and I don’t think I am, but it hurts so much to hear him at a party with girls.\u003c/p\u003e\n\u003cp\u003e“I miss you,” I repeat. “And I don’t want to keep you away from your friends, but I’m kind of freaking out that you’re there partying with other girls.”\u003c/p\u003e\n\u003cp\u003eHe goes silent. Then the music begins to dim in the background. I think he’s walking away from the noise. The phone line goes silent except for his breathing.\u003c/p\u003e\n\u003cp\u003e“Today,” he says, “I went to this art gallery called Los Cabos. They have all these pieces made of amber…I bet you’d love it.”\u003c/p\u003e\n\u003cp\u003eI pause. “Me too.”\u003c/p\u003e\n\u003cp\u003e“I shouldn’t have called you from a party. I’m sorry…I shouldn’t even be at this party.”\u003c/p\u003e\n\u003cp\u003e“I just worry that some other girl will hit on you or something.”\u003c/p\u003e\n\u003cp\u003eHe laughs. “And you don’t think I worry about the same thing?”\u003c/p\u003e\n\u003cp\u003eI tell Matt about how that pervy guy Jake Reynolds hit on me at Jordan Woods’s party and Matt starts laughing and yelling and screaming into the phone. Turns out that Jake Reynolds is some big football star.\u003c/p\u003e\n\u003cp\u003e“You have no right to be pissed at me,” Matt says, chuckling. “I get hit on by some random girl in Cabo, but the number one pick in the NFL draft hit on you.”\u003c/p\u003e\n\u003cp\u003e“Huh?”\u003c/p\u003e\n\u003cp\u003e“Never mind.”\u003c/p\u003e\n\u003cp\u003eMatt and I are laughing together now. I’m not sure why we’re laughing, but it feels good.\u003c/p\u003e\n\u003cp\u003e“The reason I called is ’cause I’m coming home early,” he says. “The airline will change my ticket for the low cost of seventy-nine ninety-nine.”\u003c/p\u003e\n\u003cp\u003e“Matt,” I say, shaking my head. “You don’t need to do that.”\u003c/p\u003e\n\u003cp\u003e“But I do. All I’ve thought about since I got here is you.”\u003c/p\u003e\n\u003cp\u003eI drag my fingers through Fritz’s fur. “Eighty dollars is a lot of money.”\u003c/p\u003e\n\u003cp\u003e“Money’s just money.”\u003c/p\u003e\n\u003cp\u003eI’m smiling.\u003c/p\u003e\n\u003cp\u003eHe goes on, “I’ll be home on Friday, okay? I’ll call you then.”\u003c/p\u003e\n\u003cp\u003e“Be careful.”\u003c/p\u003e\n\u003cp\u003e“I will. I miss you.”\u003c/p\u003e\n\u003cp\u003eWe hang up. I let out a long breath and lie down on my pillow.\u003c/p\u003e\n\u003cp\u003eI remember this one time when I was little, Daddy and I were listening to a Beatles CD. He told me about how John Lennon had once said, “We’re bigger than Jesus.” And when I asked Daddy how John Lennon could say something so bad, he cleared his throat and said, “Well, it was kinda true at that time. The Beatles were more popular than Jesus.”\u003c/p\u003e\n\u003cp\u003eFor the first time ever, I’m beginning to feel like something—someone—is more important than anything.\u003c/p\u003e\n\u003cp\u003egiving\u003c/p\u003e\n\u003cp\u003efriday, july 6 ~ on break from camp\u003c/p\u003e\n\u003cp\u003eHow is Emily?\u003c/p\u003e\n\u003cp\u003eThat’s what Jacob’s text reads.\u003c/p\u003e\n\u003cp\u003eI’d been clutching my phone, waiting for Matt to call. I jumped when it beeped.\u003c/p\u003e\n\u003cp\u003eWhat do I write back to Jacob? That I have no idea? That she probably never wants to talk to me again?\u003c/p\u003e\n\u003cp\u003eI’m glad he’s thinking about her, even after she dumped him with no explanation. I don’t know what I’d do if Matt stopped thinking of me. Jacob truly loves her. Would he have understood about the baby? Would he have agreed with Emily’s choice? Would his love for her trump his morals and beliefs, whatever they are?\u003c/p\u003e\n\u003cp\u003eDoes being in love mean forgetting everything you know? Or is it about folding that love into your life? Because right now, I have no idea how to balance that.\u003c/p\u003e\n\u003cp\u003eLove weighs a million pounds.\u003c/p\u003e\n\u003cp\u003eMatt calls me when he gets home at about noon. “I gotta crash for a few hours. I had to get up at like three a.m. for my flight.”\u003c/p\u003e\n\u003cp\u003e“Sleep tight,” I tell him. I wish I could curl up with him and take a nap too, but I doubt his parents would go for that. His dad would totally interrupt us every two minutes to ask for help mowing the grass.\u003c/p\u003e\n\u003cp\u003e“Want to hang out tonight?” he asks.\u003c/p\u003e\n\u003cp\u003e“And do what?”\u003c/p\u003e\n\u003cp\u003e“My mom bought me The A-Team DVD collection for my birthday,” Matt says. “We could watch that.”\u003c/p\u003e\n\u003cp\u003e“What’s The A-Team?”\u003c/p\u003e\n\u003cp\u003e“You’ve never heard of it? That’s insane!”\u003c/p\u003e\n\u003cp\u003e“What is it?”\u003c/p\u003e\n\u003cp\u003eI hear him yawning. “It’s this show from the eighties where these military people get in trouble for a crime they didn’t commit and they are always on the run from the Man. And Mr. T is in it!”\u003c/p\u003e\n\u003cp\u003e“Who is Mr. T?”\u003c/p\u003e\n\u003cp\u003e“This big black wrestler dude with a Mohawk. He wears tons of gold jewelry.”\u003c/p\u003e\n\u003cp\u003e“You really want to spend our night watching a big black wrestler dude with a Mohawk?”\u003c/p\u003e\n\u003cp\u003e“I don’t care what we do,” he says with a laugh. “I know this bridge that goes over the interstate and hardly any cars ever drive on it. We can go watch the traffic if you want. And by watch the traffic, I mean make out.” \u003c/p\u003e","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-26.html","bookId":1968,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
