{"id":70908,"no":31,"title":"Page 31","content":"\u003cp\u003eHe’s the truth.\u003c/p\u003e\n\u003cp\u003e“Emily got pregnant,” I begin, glancing around to make sure no one else can hear me. The nearest campers are several feet away. Matt’s gaze never leaves mine as I talk. “She decided to get an abortion, which is something I would never ever do and I can’t understand how she could do that. But I agreed to help her anyway because she’s my friend.”\u003c/p\u003e\n\u003cp\u003eMatt rubs my wrist.\u003c/p\u003e\n\u003cp\u003eI keep going, “I drove her to the clinic and helped her get an abortion…I even loaned her money…” I sniffle and wipe a tear away. “I can’t stop thinking about the baby. I drove her there. I paid for it. I helped, you know, to end a life…”\u003c/p\u003e\n\u003cp\u003eMatt tucks my hair behind my ear. “You know what I think?” he mumbles, and fear rushes through me because his eyes move away. “You’re a good friend. I’m glad you were there with her.”\u003c/p\u003e\n\u003cp\u003e“But I sinned. The baby…”\u003c/p\u003e\n\u003cp\u003e“You were there for Emily. You did something you didn’t believe in because you’re strong. And you care. God definitely forgives you.”\u003c/p\u003e\n\u003cp\u003e“Are you just saying that?”\u003c/p\u003e\n\u003cp\u003eHe chuckles lightly. “I wouldn’t lie to the daughter of the killer of Vincent Moose.”\u003c/p\u003e\n\u003cp\u003eI wipe my nose, sniffling and giggling. We grow quiet again. Past Matt, I watch as Ian and Carlie follow our lead, kneeling together at the altar. Ian catches my eye and smiles.\u003c/p\u003e\n\u003cp\u003e“Are they official now?” I whisper to Matt, who looks over his shoulder at them.\u003c/p\u003e\n\u003cp\u003e“They’re getting there, I think…” He squeezes my hand, giving me a mischievous look. “No changing the subject on me. You should call Emily tonight.”\u003c/p\u003e\n\u003cp\u003e“No cell reception,” I reply.\u003c/p\u003e\n\u003cp\u003eHe gives me a look. “There’s a pay phone.”\u003c/p\u003e\n\u003cp\u003e“I’m not ready.” I can’t believe I told Matt my biggest secret. My biggest shame. But I don’t feel like I’m standing on the edge of a cliff anymore. I feel like I’m standing on the edge of a cliff with his arms around me.\u003c/p\u003e\n\u003cp\u003e“Is that what you wrote on your paper?” Matt asks, nodding toward the fire. “The abortion? The baby?”\u003c/p\u003e\n\u003cp\u003eI nod. “Sort of. What did you write about?”\u003c/p\u003e\n\u003cp\u003eHe glances up at the cross nestled in the trees. “I care about you,” he whispers. “And for the longest time, I didn’t date anybody. I didn’t fool around with anybody—”\u003c/p\u003e\n\u003cp\u003e“But on our first date, you said hooking up is different from dating and—”\u003c/p\u003e\n\u003cp\u003e“I haven’t hooked up with anyone,” he mumbles. “I never really got over Sarah. I never got over her until that day I saw you again.”\u003c/p\u003e\n\u003cp\u003eI exhale, wipe my eye, and then clasp my hands together.\u003c/p\u003e\n\u003cp\u003eHis mouth lifts into a smirk. “Do you believe in the sign? The rumor that God tells someone something every year at camp?”\u003c/p\u003e\n\u003cp\u003e“I want to believe in it…”\u003c/p\u003e\n\u003cp\u003eMatt goes on, “I think God gave you to me, and he gave me to you, so we can both move on.”\u003c/p\u003e\n\u003cp\u003e“Move on to what?”\u003c/p\u003e\n\u003cp\u003e“To each other.”\u003c/p\u003e\n\u003cp\u003e“To get over what happened to us?”\u003c/p\u003e\n\u003cp\u003eHe grins a little and takes my hand again. Flames flicker on his face as he looks straight in my eyes. “So we can live. You can forgive yourself and I can trust again.”\u003c/p\u003e\n\u003cp\u003eI bow my head, praying to Him to tell me this is true.\u003c/p\u003e\n\u003cp\u003e“This isn’t the time or place for this,” Megan says, appearing behind us, interrupting.\u003c/p\u003e\n\u003cp\u003e“Megan, give us a minute,” Matt says in a strong voice. “This is important.”\u003c/p\u003e\n\u003cp\u003e“Quickly, then,” she says, and goes back to her seat on the log bench.\u003c/p\u003e\n\u003cp\u003eMatt is the rock. He makes me want to stand up for what I think is right. Maybe all that matters is that he’s right for me, and I’m right for him.\u003c/p\u003e\n\u003cp\u003e“I care about you too,” I whisper.\u003c/p\u003e\n\u003cp\u003e“I’m sorry about what happened with Emily that day. I shouldn’t have stayed the night.”\u003c/p\u003e\n\u003cp\u003e“I wanted you there.”\u003c/p\u003e\n\u003cp\u003eHe leans his forehead against mine. “Remember when I told you about how you saved me when we were younger?”\u003c/p\u003e\n\u003cp\u003e“Yes,” I whisper.\u003c/p\u003e\n\u003cp\u003eHe sighs deeply. “I didn’t tell you the whole truth. Before I met you, I was so sad. I wanted to end it.”\u003c/p\u003e\n\u003cp\u003eIs he saying what I think he’s saying?\u003c/p\u003e\n\u003cp\u003e“But then I prayed here at camp. I hoped I would get the sign. And then I met you. And you were so nice, and you liked my music, it gave me a reason to keep on for a while. Then Jenn was born and I felt like I had a reason to exist.”\u003c/p\u003e\n\u003cp\u003eTears are flowing down my cheeks now.\u003c/p\u003e\n\u003cp\u003e“I guess what I mean is,” he says, “I’m here because of you.”\u003c/p\u003e\n\u003cp\u003esketch #378\u003c/p\u003e\n\u003cp\u003eheaven\u003c/p\u003e\n\u003cp\u003eThat night after the kids are asleep, I decide to take a walk out to the big field, to look at the stars. I sit down on the grass and sketch by moonlight, drawing the constellations. My paper looks like a game of Connect the Dots.\u003c/p\u003e\n\u003cp\u003eEver since Matt asked where Heaven is, I’ve thought about it when I’m outside at night. Staring at the stars reminds me of how tiny I am, how I’m just one person. Being in the darkness makes me wonder if there really is a God and a Heaven and a Hell. Even though I can feel God inside me, a small part of me still worries that when I die, nothing will be there.\u003c/p\u003e\n\u003cp\u003eThe Earth existed before I was born, and it will exist when I die.\u003c/p\u003e\n\u003cp\u003eWhat if all that is me is just gone?\u003c/p\u003e\n\u003cp\u003eThe thought of that makes me feel more alone than ever. I miss Emily. I miss Matt. I can’t imagine spending my time on Earth without them. Because eternity is a long, lonely time.\u003c/p\u003e\n\u003cp\u003eI connect the dots of the Big Dipper. Then I hear the sound of feet crunching grass.\u003c/p\u003e\n\u003cp\u003eI look up to find him. I stare and he stares back, and then we’re together.\u003c/p\u003e\n\u003cp\u003eI’m kissing him so fast and hard I get dizzy. Before I got my first real boyfriend, I thought about the kissing, but I never imagined the details—how his lips would be warm and wet and how his calloused fingers would feel rough yet soft against my skin. His hands settle in my hair, weaving through the strands. I hug him tight to me, trying to ignore the feelings building in my body. We kiss again and I can tell his body is buzzing like mine.\u003c/p\u003e\n\u003cp\u003eWhen I get back to Bluebird later that night, I finish connecting the dots of the constellations.\u003c/p\u003e\n\u003cp\u003eIs Matt right? Did God connect us together?\u003c/p\u003e\n\u003cp\u003eWhat will Matt say when I tell him I can’t move this fast? I’m falling in love with him, but I can’t let myself get into a situation where he and I could have sex. I just can’t.\u003c/p\u003e\n\u003cp\u003efriends\u003c/p\u003e\n\u003cp\u003emonday, july 16 ~ week 6 of 7\u003c/p\u003e\n\u003cp\u003eWill is grinning at me.\u003c/p\u003e\n\u003cp\u003eToday I’m using my break to work on an acrylic painting of the big field. And Will just showed up in the art pavilion out of nowhere.\u003c/p\u003e\n\u003cp\u003e“What’s up?” I ask him, wiping the hair out of my face and going back to my painting.\u003c/p\u003e\n\u003cp\u003eHe comes toward me, dipping his hands into his khaki shorts pockets. “I was just thinking about how if I didn’t have Parker and you asked me to prom now, I definitely would say yes.”\u003c/p\u003e\n\u003cp\u003eThat statement hurts, but it’s a good hurt. “Why?”\u003c/p\u003e\n\u003cp\u003eHe lifts his shoulders. “You’re more relaxed. And confident. You’re pretty. I don’t know if it’s Parker’s makeover that she’s always bragging about—”\u003c/p\u003e\n\u003cp\u003e“I’m happy,” I interrupt.\u003c/p\u003e\n\u003cp\u003e“That’s probably it then, eh?”\u003c/p\u003e\n\u003cp\u003eI tuck my hair behind my ears. “I’m kinda glad you didn’t say yes to prom, you know?”\u003c/p\u003e\n\u003cp\u003e“I get that. Matt’s a good fit for you.”\u003c/p\u003e\n\u003cp\u003e“Like Parker is for you.”\u003c/p\u003e\n\u003cp\u003e“Damn straight.”\u003c/p\u003e\n\u003cp\u003eI point at him with my paintbrush. “No cursing in my art pavilion.”\u003c/p\u003e\n\u003cp\u003eHe grins. “Yes, ma’am.”\u003c/p\u003e\n\u003cp\u003eAt lunch, I’m sitting with my campers, talking about how we’ll make friendship bracelets later, when Matt leans over my shoulder.\u003c/p\u003e\n\u003cp\u003e“Boo,” he says, making the girls laugh.\u003c/p\u003e\n\u003cp\u003eI smile at him, feeling the heat from his cheek warming mine. “What’s up?”\u003c/p\u003e\n\u003cp\u003eHe holds his tray above mine and scrapes his green beans onto my plate. “Don’t you want them?”\u003c/p\u003e\n\u003cp\u003e“I know how much you love them,” he replies with a smile.\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“No problem.” He squeezes my shoulder and begins to walk away.\u003c/p\u003e\n\u003cp\u003e“I love you, Matt,” I tell his back. Completely out of the blue. I cover my mouth. Wait for this eternity of a silence to end.\u003c/p\u003e\n\u003cp\u003eSlowly he turns around and leans down to quickly kiss my cheek in front of all the campers, who all start going “Wooo!”\u003c/p\u003e\n\u003cp\u003e“I love you too.”\u003c/p\u003e\n\u003cp\u003eWe smile at each other. He throws his backpack over a shoulder, puts his tray away, and heads toward the pool. I’m still beaming when I look up to find Megan staring my way, shaking her head. Whatever.\u003c/p\u003e\n\u003cp\u003eOn Wednesday, Parker and I are sitting on the dock taking a break, dangling our feet in the lake. She’s wearing a white bikini and I’m wearing a new navy blue one I just bought.\u003c/p\u003e\n\u003cp\u003e“I don’t want camp to end,” I tell her.\u003c/p\u003e\n\u003cp\u003e“You’re not looking forward to college?”\u003c/p\u003e\n\u003cp\u003e“I am…but I’ll miss you and Matt and Will.”\u003c/p\u003e\n\u003cp\u003e“Even if we’re at different colleges, Will and I will be in Nashville with you, and Matt’s less than thirty minutes away, right?”\u003c/p\u003e\n\u003cp\u003eI nudge a bit of algae with my toe. “Yeah…”\u003c/p\u003e\n\u003cp\u003e“I can’t wait for camp to be over. Will and I want to take a road trip to Florida the week before college.”\u003c/p\u003e\n\u003cp\u003e“With his parents? Or your mom or dad?”\u003c/p\u003e\n\u003cp\u003eShe steals a breath before answering. “Just us.”\u003c/p\u003e\n\u003cp\u003e“Oh.” I jiggle my feet, splashing. “Sounds fun. I kinda wish I could’ve gone with Matt to Cabo during the Fourth of July break. He told me about this art gallery he found there and now I really want to see it.”\u003c/p\u003e\n\u003cp\u003eParker narrows her eyes at me, her mouth arranged in a knowing smile. “You’ve changed a lot this summer.”\u003c/p\u003e\n\u003cp\u003eI sit on my hands. “Is that a bad thing?”\u003c/p\u003e\n\u003cp\u003e“Not at all. I feel like you’re getting to know yourself better, and that’s a good thing.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eShe swings her feet back and forth. “I spent too long worrying about what other people think.”\u003c/p\u003e\n\u003cp\u003eI dangle my feet in the water and splash.\u003c/p\u003e\n\u003cp\u003e“So you and Matt are back together?” she asks.\u003c/p\u003e\n\u003cp\u003e“I think so…but…”\u003c/p\u003e\n\u003cp\u003e“But?”\u003c/p\u003e\n\u003cp\u003e“Can I ask a question?”\u003c/p\u003e\n\u003cp\u003e“Yeah,” she says slowly.\u003c/p\u003e\n\u003cp\u003e“I know you said that your relationship with God is private, but I’m wondering, um, if you’re okay with the physical parts of your relationship with Will? Um, that you talked about that day at lunch at the mall?”\u003c/p\u003e\n\u003cp\u003eShe stares across the lake. “It’s kind of between me and Will. Like, any decisions we make, we make together.”\u003c/p\u003e\n\u003cp\u003eThe conversation with Daddy comes to mind. I can believe in God if I want to believe in God. Parker can do what she wants to do with Will. It’s her decision. Just like I have choices to make when it comes to my boyfriend.\u003c/p\u003e\n\u003cp\u003e“The reason I broke things off with Matt before is because we went too far too fast.”\u003c/p\u003e\n\u003cp\u003eParker nods. \u003c/p\u003e","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-31.html","bookId":1968,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
