{"id":70883,"no":6,"title":"Page 6","content":"\u003cp\u003e“You’re cooking?” I ask.\u003c/p\u003e\n\u003cp\u003e“It’s my day to fix breakfast for everybody. Want some expert tips on scrambling eggs and making doughnuts over a campfire?”\u003c/p\u003e\n\u003cp\u003e“You can make doughnuts over a campfire?” I exclaim.\u003c/p\u003e\n\u003cp\u003e“Oh sure.” He smirks a little. “I can’t do anything fancy like Boston cream pie or anything, but I can make killer cinnamon doughnut holes.”\u003c/p\u003e\n\u003cp\u003e“I love those,” I say quietly.\u003c/p\u003e\n\u003cp\u003e“Well, I’d love some company.” He stands up, clutching a shaved tree branch.\u003c/p\u003e\n\u003cp\u003e“What’s that for?” I ask.\u003c/p\u003e\n\u003cp\u003e“My walking stick? It assists me in walking.”\u003c/p\u003e\n\u003cp\u003eI giggle. “Are you injured?”\u003c/p\u003e\n\u003cp\u003e“Naw. Of course not. I’m the lifeguard! Who would hire an injured lifeguard?”\u003c/p\u003e\n\u003cp\u003e“My mistake.”\u003c/p\u003e\n\u003cp\u003e“Your mistake indeed.”\u003c/p\u003e\n\u003cp\u003e“You’re hilarious,” I find myself saying.\u003c/p\u003e\n\u003cp\u003eHe elbows my arm and glances over at me. Using his walking stick, he makes his way to the cafeteria on the hill. The building’s green paint is flaking off and the air smells like grease. He unlocks the doors and we raid the fridge for eggs, bacon, juice, and biscuit dough.\u003c/p\u003e\n\u003cp\u003e“Grab that big can of Crisco off the shelf, please,” he says, nodding toward it.\u003c/p\u003e\n\u003cp\u003eWe lug all the supplies back down to the fire pit area next to Great Oak. He says, “Let’s get us some firewood.” Out in the woods, we pick up logs.\u003c/p\u003e\n\u003cp\u003e“That one’s too wet,” he says.\u003c/p\u003e\n\u003cp\u003eI drop it and pick up another.\u003c/p\u003e\n\u003cp\u003e“That one’s too big,” he says.\u003c/p\u003e\n\u003cp\u003eI drop it and pick up another.\u003c/p\u003e\n\u003cp\u003e“Get some tiny branches for kindling, please,” he says.\u003c/p\u003e\n\u003cp\u003eMatt arranges the logs in the fire pit, then grabs a wad of paper towels and stuffs them under the sticks. Then he turns the Crisco can upside down and lets the goop drip onto the wood. He lights a match and throws it on the wood pile. A flame bursts up.\u003c/p\u003e\n\u003cp\u003eI jump back, panting. “Are you a pyromaniac?” I blurt.\u003c/p\u003e\n\u003cp\u003e“Crisco’s amazing,” he says, smiling. Squatting, he begins tossing tiny sticks and grass onto the fire until the flame gets hot enough to catch the thicker logs.\u003c/p\u003e\n\u003cp\u003e“Isn’t that cheating?”\u003c/p\u003e\n\u003cp\u003eHe laughs. “I wasn’t aware there are rules for starting a campfire when you’re starving for breakfast. I mean, sure, if this was a Boy Scout competition I totally would’ve been disqualified.”\u003c/p\u003e\n\u003cp\u003e“Maybe I’ll use your Crisco trick when it’s time for me start my own fires,” I tell him.\u003c/p\u003e\n\u003cp\u003e“I just converted you to my Crisco Cult!”\u003c/p\u003e\n\u003cp\u003eI laugh. “Now what do I do, oh master of the Crisco Cult?”\u003c/p\u003e\n\u003cp\u003e“Grab that cast-iron kettle and hang it over the fire,” he tells me. “And dump the rest of the Crisco in it so it’ll melt. Then we’ll fry up the doughnuts in it.”\u003c/p\u003e\n\u003cp\u003e“What doughnuts are we gonna fry?” I ask, glancing at our supplies.\u003c/p\u003e\n\u003cp\u003e“Take the biscuit dough and start rolling it into balls.”\u003c/p\u003e\n\u003cp\u003eThe first thing Matt does is get the coffee brewing (he has a secret stash). It’s a humid June morning and the fire’s roaring, so I’m wiping sweat off my face like crazy. For a second I’m terrified Matt thinks I look hideous, but then I glance over at him and find that his face is covered in dirt and he’s all sweaty too.\u003c/p\u003e\n\u003cp\u003eOnce Matt has the eggs cooking in the skillet, he pours us each a cup of coffee. I watch as he briefly shuts his eyes and murmurs a blessing.\u003c/p\u003e\n\u003cp\u003eHe sips his coffee and asks, “Why didn’t you share a cabin with us last night? Were you afraid that I snore too loud?”\u003c/p\u003e\n\u003cp\u003eI bite back a laugh. “Nah. I just don’t think my parents would like it if they knew I was sharing a room with boys. And what if the regional conference finds out? They’d be mad.”\u003c/p\u003e\n\u003cp\u003eMatt slaps his palm with the spatula. “Eh. They’d never know. But I know what you mean. My mom would kill me.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Oh yeah. She’s the youth minister at Bell Buckle Chapel and spends most of her time teaching sex ed and trying to keep teenagers out of each other’s beds. Especially her own kids. My brother Jeremiah’s practically a man whore.”\u003c/p\u003e\n\u003cp\u003eI stop moving. “A man whore?”\u003c/p\u003e\n\u003cp\u003eHe chuckles. “He’s got a new girlfriend every day.” He points at me with the spatula. “I’m not exaggerating. One time, this girl Laura came to lunch at our house and by dinner she’d been replaced by someone named Mary.”\u003c/p\u003e\n\u003cp\u003eI laugh, rolling biscuit dough into a ball. “And what about you? Are you a man whore?” I stutter, trying not to seem interested in his answer.\u003c/p\u003e\n\u003cp\u003e“I wish,” he says with a sigh. When he sees the look on my face, he quickly says, “Just kidding. I’m a one-girl kind of guy.”\u003c/p\u003e\n\u003cp\u003e“So it’s just Andrea?” I ask, baiting him.\u003c/p\u003e\n\u003cp\u003eHe pauses and picks up his coffee cup from the picnic table. He sips. “Naw. I’m single right now. You?”\u003c/p\u003e\n\u003cp\u003e“I’m single all the time.” I blush.\u003c/p\u003e\n\u003cp\u003e“So…you have a moratorium on dating?”\u003c/p\u003e\n\u003cp\u003e“No,” I say slowly. “I just haven’t dated anyone.”\u003c/p\u003e\n\u003cp\u003e“Ever?”\u003c/p\u003e\n\u003cp\u003eI hesitate. “Ever. Unless you count our date to the Thursday Night Dance that time.” He’s so easy to talk to, I can’t help but tell the truth, no matter how embarrassing it is.\u003c/p\u003e\n\u003cp\u003eHe takes a swig of coffee. “Are you picky?”\u003c/p\u003e\n\u003cp\u003eI don’t know how to answer that. This is probably the longest conversation I’ve ever had with a boy. Well, besides Jacob, and he belonged to Emily. I still can’t believe she broke up with him.\u003c/p\u003e\n\u003cp\u003eI sip some coffee.\u003c/p\u003e\n\u003cp\u003e“I’m picky too,” he says before I can respond.\u003c/p\u003e\n\u003cp\u003eI change the subject. “Now what do we do?”\u003c/p\u003e\n\u003cp\u003e“Throw some bacon in that skillet, woman.”\u003c/p\u003e\n\u003cp\u003e“‘Woman’?” I burst out laughing.\u003c/p\u003e\n\u003cp\u003eHe adjusts his bandana, smiling at me, and my stomach leaps into my throat, and I feel this longing deep inside—a longing to have a friend.\u003c/p\u003e\n\u003cp\u003esketch #336\u003c/p\u003e\n\u003cp\u003ewhat happened on may 5\u003c/p\u003e\n\u003cp\u003eAfter making breakfast with Matt, I sharpen my pencil so I can sketch, to keep my mind off my pathetic dating history. But my plan doesn’t work.\u003c/p\u003e\n\u003cp\u003eOne day in May, I pulled open the front door and Jacob marched in, brushed past me, and headed for my living room. No hello, no hi, no nothing. I dug my fingernails into my palms and took a deep breath. I trudged into the living room and sat down beside him on the couch. His face was buried in his palms. Emily had broken up with him a week before, right after the abortion.\u003c/p\u003e\n\u003cp\u003eI had never seen him that upset. Come to think of it, I’d never seen him upset at all. Jacob always had been a carefree kind of guy. I sketch his hair: black curls pulled back into a low ponytail. I draw the sticker-covered skateboard he always carries around, as he smiles and talks to everybody. Like Emily, he’s insanely musically talented. Sometimes he wears a kilt and plays silly music on the bagpipes. Once he played “Happy Birthday” for me and I couldn’t stop smiling. Lots of girls wanted him, but he’d been with Emily since they were fourteen years old.\u003c/p\u003e\n\u003cp\u003eI draw the blank TV screen that Jacob had stared at that day. Draw tears leaking from his eyes.\u003c/p\u003e\n\u003cp\u003eFor a moment I wondered if he knew about the abortion, about what I had helped Emily do to his baby, when he spoke. “What did I do wrong? Why did she break up with me? Please—” His voice broke.\u003c/p\u003e\n\u003cp\u003eI continued to dig my thumbnail into my palm. “She hasn’t told me.”\u003c/p\u003e\n\u003cp\u003eHe glanced up, flashing me a look. “That’s bullshit.”\u003c/p\u003e\n\u003cp\u003eI sucked in a breath through my nose. “I’ll try to get her to talk to you, but I can’t promise anything.”\u003c/p\u003e\n\u003cp\u003e“I need to know what’s wrong, Kate. Tell me.” His eyes dug into mine. “Does she not love me anymore?”\u003c/p\u003e\n\u003cp\u003eI wanted to tell him that Emily loved him so much, but she wanted her future more than a life with the baby they hadn’t planned for. But she couldn’t stop thinking about the decision she’d made without Jacob, so she broke up with him. If Emily had had the baby, would she have had Emily’s auburn hair? Would he have had Jacob’s black curls?\u003c/p\u003e\n\u003cp\u003eAnd then I started crying for Jacob and Emily, who wanted to be together so badly. They loved each other, but her guilt was messing that all up.\u003c/p\u003e\n\u003cp\u003eThat’s not the only reason I cried.\u003c/p\u003e\n\u003cp\u003eDeep down, I was jealous of that love and I wanted a boy to show up crying for me because he loved me so much.\u003c/p\u003e\n\u003cp\u003e“She loves you,” I told him.\u003c/p\u003e\n\u003cp\u003eHe abruptly stood up. “This is not what love is,” he said, and left my house.\u003c/p\u003e\n\u003cp\u003eI start an outline of my body, sitting alone on the couch after Jacob left.\u003c/p\u003e\n\u003cp\u003eThen I scribble over it and start a new picture. A picture of Matt teaching me to use Crisco to start a campfire. I smile and reach for my yellow coloring pencil to draw the flames licking at my feet.\u003c/p\u003e\n\u003cp\u003esnake!\u003c/p\u003e\n\u003cp\u003esaturday, june 2 ~ week 1 of 7\u003c/p\u003e\n\u003cp\u003eBefore going swimming, kayaking, and canoeing this afternoon, Megan’s giving us time to plan our individual sessions. Will’s in charge of the Monday ice cream night, so he’s fiddling with homemade ice cream makers. Brad’s been counting hula hoops, unfolding a giant parachute, and inspecting a tug-of-war rope because he’s in charge of field games. Andrea’s the camp videographer, so she’s playing with various cameras and her laptop. Carlie’s writing out clues for the treasure hunt.\u003c/p\u003e\n\u003cp\u003eMatt already cleaned the pool, so he’s lounging in a camping chair, lazily strumming his guitar, playing what sounds like a Hawaiian version of “Kumbaya.”\u003c/p\u003e\n\u003cp\u003eI’m inventorying the paintbrushes when Will plops down on the picnic table bench beside my closet.\u003c/p\u003e\n\u003cp\u003e“You okay?” he whispers, glancing over his shoulder at Parker. She sees him talking to me and her face looks pained. It’s like she’d rather him talk to a Playboy Bunny than me.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” I tell him, placing paintbrushes in a plastic box and storing it on the shelf.\u003c/p\u003e\n\u003cp\u003e“Matt said you seemed upset this morning.”\u003c/p\u003e\n\u003cp\u003eI focus on my watercolor painting of White Oak and remember the time I found a frog in a bush outside the cabin. He was so scared, he peed on my hand. Part of the reason I like art so much is the escape. The escape into a world that I fill with my colors and music.\u003c/p\u003e\n\u003cp\u003e“I’m sorry Parker yelled at you last night,” Will says, lounging against the table.\u003c/p\u003e\n\u003cp\u003eI organize the boxes of crayons into a straight line. “I’m sorry if I hurt her,” I tell him. “I didn’t mean to.” I just don’t want someone else to go through the same pain as Emily and me.\u003c/p\u003e\n\u003cp\u003e“You should tell her that, not me.”\u003c/p\u003e\n\u003cp\u003eI let out a sigh. “She doesn’t want to talk to me.”\u003c/p\u003e\n\u003cp\u003e“How do you know? She’s a pretty forgiving person.”\u003c/p\u003e\n\u003cp\u003eI don’t say anything.\u003c/p\u003e\n\u003cp\u003eAfter a few seconds, he goes, “She forgave me.”\u003c/p\u003e\n\u003cp\u003e“What did you do wrong?”\u003c/p\u003e\n\u003cp\u003eHis eyes meet mine. “Left her when she needed me most.”\u003c/p\u003e\n\u003cp\u003eI want to tell him that I don’t have a best friend anymore.\u003c/p\u003e\n\u003cp\u003e“Listen,” Will says, drumming fingers on the picnic table. “This is none of my business and I hope you don’t take it the wrong way, but I want to tell you something about your church.” \u003c/p\u003e","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-6.html","bookId":1968,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
