{"id":70884,"no":7,"title":"Page 7","content":"\u003cp\u003eI brace myself. “Yeah?”\u003c/p\u003e\n\u003cp\u003e“Forrest Sanctuary destroyed Parker after her mom left.”\u003c/p\u003e\n\u003cp\u003eI smooth my hair. Until last night, I had had no idea Parker was so badly affected. I mean, she and I were never all that close growing up—I had Emily, after all. And Parker was always fooling around with random guys in high school. So I ask Will about that.\u003c/p\u003e\n\u003cp\u003e“Why do you think she was so screwed up?” Will asks slowly. “It must suck to give your whole life to a church, only to watch everyone disappear when you need help.”\u003c/p\u003e\n\u003cp\u003eThis reminds me of how Emily’s parents kicked her out after the abortion. How I played it differently. I stuck by, only to have her call me a judgmental bitch.\u003c/p\u003e\n\u003cp\u003eI feel bad for not having noticed what Parker was going through.\u003c/p\u003e\n\u003cp\u003e“So Parker’s mad at me because I go to her church?” I ask quietly. “Because she’s mad at our church?”\u003c/p\u003e\n\u003cp\u003eWill lifts his shoulders. “I think she’s just, um, wary of people?”\u003c/p\u003e\n\u003cp\u003eIn high school, people called me a prude and Jesus Freak because I had no problem telling people that I care about church and God. It didn’t make people rush to invite me to the movies on Friday night, that’s for sure. But I had Emily to hang out with, and I had soccer, so all was okay.\u003c/p\u003e\n\u003cp\u003eUntil it wasn’t.\u003c/p\u003e\n\u003cp\u003eI say, “Parker’s lucky to have you.”\u003c/p\u003e\n\u003cp\u003eHe grins. “I’m lucky she agreed to give me another shot.”\u003c/p\u003e\n\u003cp\u003eNo guy has ever stood up for me this way. I glance over my shoulder at Matt.\u003c/p\u003e\n\u003cp\u003e“Is Parker feeling better now?” I ask Will. “Since her mom left?”\u003c/p\u003e\n\u003cp\u003e“I like to think so. But as you saw last night, she’s definitely not anywhere close to being fine…She doesn’t really have any friends who are girls.”\u003c/p\u003e\n\u003cp\u003eI know how that feels.\u003c/p\u003e\n\u003cp\u003e“I’m around if you want to talk more,” he says, then leaps up and dashes across the trail to Great Oak, where he pulls Parker into his arms and pecks her lips. She grins.\u003c/p\u003e\n\u003cp\u003eMy mouth edges into a smile.\u003c/p\u003e\n\u003cp\u003eWe’re walking down the path toward the lake, where Matt will train us to canoe and kayak. I look for trail markers that I can remember when walking my campers to the lake. Breadcrumbs, like Hansel and Gretel, but all I see are trees, trees, and more trees.\u003c/p\u003e\n\u003cp\u003eParker is a little ways behind me, so I slow down.\u003c/p\u003e\n\u003cp\u003e“Hi,” I say, clearing my throat.\u003c/p\u003e\n\u003cp\u003eShe just looks at me and passes on by like I said nothing. I open my mouth to speak again, but nada comes out. The thing is, I wasn’t in the wrong last night. This is a job at church camp. Should guy and girl counselors really be sleeping in the same cabin together?\u003c/p\u003e\n\u003cp\u003eRules exist for a reason, right?\u003c/p\u003e\n\u003cp\u003eMaybe I’d been less than tactless, accusing Parker of sinning, but I was just trying to help. And I feel bad for not noticing her pain during high school, but it’s not like she paid much attention to me then, either. She never checked on me after my surgery or asked why I didn’t play soccer anymore. The first time she confronts me, she bites my head off, leaving me embarrassed and alone.\u003c/p\u003e\n\u003cp\u003eOr have I made myself that way?\u003c/p\u003e\n\u003cp\u003eAm I embarrassed and alone because of who I am as a person?\u003c/p\u003e\n\u003cp\u003e“You lost?”\u003c/p\u003e\n\u003cp\u003eI look up to find Eric standing in front of me, narrowing his eyes. His camo outfit truly blends in with the trees. The rest of the group is way ahead of us.\u003c/p\u003e\n\u003cp\u003e“Just thinking, I guess.”\u003c/p\u003e\n\u003cp\u003e“You can’t do that when you’ve got ten girls to watch out for, okay? You can’t take your eyes off them even for a second, or you could lose one.”\u003c/p\u003e\n\u003cp\u003e“Okay, I’m sorry,” I say, hardly believing how intense this guy is.\u003c/p\u003e\n\u003cp\u003eHe stalks off. I follow everyone down to the algae-spotted lake, where Matt is pushing canoes and kayaks into the water. Shirtless. His tan biceps and smooth chest just about make my heart stop.\u003c/p\u003e\n\u003cp\u003e“Ogle much?” Andrea asks me.\u003c/p\u003e\n\u003cp\u003eMy face goes hot. Matt looks up as he unties a canoe and pushes it into the water. He gives me a little wave.\u003c/p\u003e\n\u003cp\u003eMatt makes everybody put on a lifejacket and hands each of us an oar. Will and Parker share a canoe, and so do Andrea and Carlie, but the rest of us get our own kayaks.\u003c/p\u003e\n\u003cp\u003eMatt takes my hand, helping me step into my kayak, the rough callouses of his skin scraping against mine.\u003c/p\u003e\n\u003cp\u003e“Okay, everybody,” he yells, clapping once. “The rules of canoeing are simple. If you want to go right, then put the paddle in the water on your other right.”\u003c/p\u003e\n\u003cp\u003eI laugh.\u003c/p\u003e\n\u003cp\u003eAndrea drops her oar in the water and it starts floating off, so Matt leaps into the water and rescues the oar and returns it to her with a smile. I bet she dropped it on purpose, just so she could see him get all wet. I don’t blame her.\u003c/p\u003e\n\u003cp\u003eI paddle around the lake slowly, drifting in various directions. Will’s pointing into the water and Parker’s peering down, smiling. Is it a turtle? A school of fish?\u003c/p\u003e\n\u003cp\u003eEric circles the lake like it’s his job to secure the perimeter from bears or something.\u003c/p\u003e\n\u003cp\u003eMy kayak gets stuck on the side of the bank, and when I touch my oar to the bank, to push away from the land, a coiled brown and white snake catches my eye.\u003c/p\u003e\n\u003cp\u003eI scream.\u003c/p\u003e\n\u003cp\u003eI scream again. I thrust my paddle into the water and start paddling away as quickly as I can. Can the snake come in the water? I think they can swim.\u003c/p\u003e\n\u003cp\u003eWas it a copperhead? A rattlesnake? A water moccasin?\u003c/p\u003e\n\u003cp\u003eI look up from paddling to see Matt dive off the dock and swim my way. I stop thrusting my oar into the water and lean over onto my thighs, swallowing. Everyone is staring at me like I’m a major moron, which I guess I am. But what if the snake had bitten me?\u003c/p\u003e\n\u003cp\u003eA minute later Matt surfaces next to me and shakes the water out of his hair. “You okay? What happened?”\u003c/p\u003e\n\u003cp\u003eI chew my lip. “I saw a snake.”\u003c/p\u003e\n\u003cp\u003eHis eyes dart around, probably to make sure the snake isn’t about to retaliate because I ruined its nap. “Snakes scare the bejesus out of me.”\u003c/p\u003e\n\u003cp\u003e“I’d never seen one before.” My body is trembling.\u003c/p\u003e\n\u003cp\u003e“They’re more scared of us than we are of them,” he says, treading water, bobbing like a cork. “But they are still scary as hell.”\u003c/p\u003e\n\u003cp\u003eI’m disappointed that he curses, but I keep my mouth closed. I’m not messing up the good start with him.\u003c/p\u003e\n\u003cp\u003eHe says, “Can you get yourself back? Or do you want me to try to squeeze in and paddle for you?”\u003c/p\u003e\n\u003cp\u003eMy heart pounds at the idea of him squeezing into a kayak with me.\u003c/p\u003e\n\u003cp\u003e“There’s not enough room in here,” I say, smiling.\u003c/p\u003e\n\u003cp\u003e“Too bad,” he teases. He grabs my hand. I suck in a deep breath. “You sure you can make it?” he asks.\u003c/p\u003e\n\u003cp\u003e“Totally sure.” I paste a smile on.\u003c/p\u003e\n\u003cp\u003e“Okay—I’m gonna go rescue that runaway over there,” he says, jerking his head toward an orphaned canoe nestled up against the banks. “Race you back to the docks.”\u003c/p\u003e\n\u003cp\u003eHe takes off swimming in the opposite direction and I start paddling as hard as I can, smiling to myself about our race. He doesn’t seem to be going all that fast. I hope he’s not the type of guy who lets a girl win.\u003c/p\u003e\n\u003cp\u003eAfter a billion years of paddling, I beat him back to the docks. I shakily climb out of the kayak onto dry land and face an inquisition.\u003c/p\u003e\n\u003cp\u003e“What happened? Are you okay?” Will asks, crossing his arms.\u003c/p\u003e\n\u003cp\u003e“I had a run-in with a snake.”\u003c/p\u003e\n\u003cp\u003e“A snake?” Megan asks, playing with her whistle.\u003c/p\u003e\n\u003cp\u003e“I doubt she saw a snake,” Eric announces, wiping sweat from his brow with the back of his hand.\u003c/p\u003e\n\u003cp\u003e“I promise you,” I say, catching my breath. “It was a snake.”\u003c/p\u003e\n\u003cp\u003e“I have a book you should read before campers arrive on Monday morning,” Eric says, puffing his chest out. “It will tell you everything you need to know about dangerous animals in Tennessee.” Eric looks pointedly at Megan.\u003c/p\u003e\n\u003cp\u003eShe blushes. “Yes, you should read it,” she tells me. “And please, no more screaming.”\u003c/p\u003e\n\u003cp\u003e“Are you sure you saw a snake?” Eric asks, scanning the banks.\u003c/p\u003e\n\u003cp\u003e“Yes, I saw one,” I say again, wringing my hand. “Maybe you should read the chapter on snakes in your book.”\u003c/p\u003e\n\u003cp\u003e“I don’t think there are any snakes around this lake,” Eric says. Is he pretending he didn’t hear what I said?\u003c/p\u003e\n\u003cp\u003e“I dunno if that’s true,” Matt says, leaping onto the docks from the canoe he just rescued. “Last year I killed a copperhead that was swimming near here.”\u003c/p\u003e\n\u003cp\u003eMy heart swells as I smile at him.\u003c/p\u003e\n\u003cp\u003e“I’ve got a picture of it on my phone!” Andrea says, nodding quickly. “He smashed it with an oar!”\u003c/p\u003e\n\u003cp\u003eEric checks his ginormous watch that’s the size of a compass. “Whatever.”\u003c/p\u003e\n\u003cp\u003eI suddenly want to start studying everything I can about the outdoors so I can one-up him, like Matt just did.\u003c/p\u003e\n\u003cp\u003e“Regardless of whether there are snakes in the lake,” Megan says, “you can’t react like that in front of children, Kate. It’s unprofessional and it will scare the kids.”\u003c/p\u003e\n\u003cp\u003eI look around at the other counselors and nod. Parker raises her eyebrows at me.\u003c/p\u003e\n\u003cp\u003eI turn to gaze across the lake at the deep green woods. When I was younger, I learned about how Henry David Thoreau went out into the wilderness and lived by himself at Walden Pond for a long time and wrote his magnum opus. I’m not saying I want to go write a magnum opus or anything, but I’d love to have a tiny cabin to myself in the mountains, where I could paint landscapes until my hand falls off and not be around people like Monkey Megan and Eric “I refuse to play the animal introduction game” and Alligator Andrea, who probably is an alligator disguised as a sorority girl.\u003c/p\u003e\n\u003cp\u003eParker appears beside me and whispers, “I would’ve screamed if I saw a snake too. And I want to be a vet!”\u003c/p\u003e\n\u003cp\u003eI slip my thumbs into my belt loops. “I’m, uh…can we talk about last night?”\u003c/p\u003e\n\u003cp\u003eMegan blows her whistle and beckons for us to follow her back up the trail, and Parker walks off with Will without responding to me.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you killed a poor snake!” Parker snaps at Matt, passing by him.\u003c/p\u003e\n\u003cp\u003e“It was swimming near a group of eight-year-old campers who were canoeing. What was I supposed to do?” Matt replies, drying his face with a towel. He waits for me to catch up. “You okay?”\u003c/p\u003e\n\u003cp\u003e“I never want to see a snake again.”\u003c/p\u003e\n\u003cp\u003e“Me neither.” He jerks his head toward Parker. “For multiple reasons.”\u003c/p\u003e\n\u003cp\u003eI laugh. “Thanks for swimming out to save me.”\u003c/p\u003e\n\u003cp\u003eHe looks over at my face. “You saved me once too.”\u003c/p\u003e\n\u003cp\u003esketch #340\u003c/p\u003e\n\u003cp\u003ewhat happened seven years ago\u003c/p\u003e\n\u003cp\u003eAt twilight, I rock back and forth on Cardinal’s porch swing. I use a piece of charcoal to sketch, making sure to keep my hands away from my face and clothes, so black dust doesn’t get everywhere.\u003c/p\u003e\n\u003cp\u003eI draw thirteen-year-old Matt with glasses and a bit of acne on his face.\u003c/p\u003e\n\u003cp\u003eI hate it when Christians don’t act Christian-like. The boys in our group had been teasing him for writing music and lyrics.\u003c/p\u003e\n\u003cp\u003e“Only girls do shit like that,” a boy had said to Matt, making him turn redder than a strawberry. He clutched the neck of his guitar, glancing at me. Most of the other kids looked away, but I held his stare and tried to show him he wasn’t alone.\u003c/p\u003e\n\u003cp\u003eI got the impression this wasn’t the only time he’d been bullied. He never smiled and hardly ever spoke. \u003c/p\u003e","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-7.html","bookId":1968,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
