{"id":70885,"no":8,"title":"Page 8","content":"\u003cp\u003eBut now, as a guy about to be a junior in college, he seems sure of himself. He’s grown into his skin.\u003c/p\u003e\n\u003cp\u003eI draw a picture of eleven-year-old me pulling Emily over to Matt.\u003c/p\u003e\n\u003cp\u003e“Can we hear one of your songs?” I asked him.\u003c/p\u003e\n\u003cp\u003eHe smiled and began to strum his guitar while watching my eyes.\u003c/p\u003e\n\u003cp\u003eBy Wednesday night, he’d written a new one. Something about comparing a girl’s beauty to that of a redbird.\u003c/p\u003e\n\u003cp\u003e“Vibrant, free, elegant, and lovely.” ☺\u003c/p\u003e\n\u003cp\u003eWhen he sang it for me, I kept my head down and buried my clasped hands between my thighs. The song ended, and he reached out a hand, grabbed my shoulder, and squeezed.\u003c/p\u003e\n\u003cp\u003e“Thank you,” he said.\u003c/p\u003e\n\u003cp\u003eI never knew what he was thanking me for, but I said you’re welcome and the next night he gave me my first kiss.\u003c/p\u003e\n\u003cp\u003eThis afternoon, when I asked how I saved him, he didn’t answer.\u003c/p\u003e\n\u003cp\u003eI touch my lips, probably getting charcoal on them. How did I save him?\u003c/p\u003e\n\u003cp\u003eI use my red coloring pencil to fill in an outline of a redbird.\u003c/p\u003e\n\u003cp\u003ehis snores are louder than a bulldozer\u003c/p\u003e\n\u003cp\u003esunday, june 3 ~ week 1 of 7\u003c/p\u003e\n\u003cp\u003e“This is inhumane.”\u003c/p\u003e\n\u003cp\u003eParker is upset about creek stomping.\u003c/p\u003e\n\u003cp\u003eOnce a week, we’ll take campers down to Cumberland Creek, where we’ll wade around and catch crayfish. Some crayfish are the size of a quarter. Some are the size of a brick.\u003c/p\u003e\n\u003cp\u003e“We should just let the kids walk through the creek and splash around,” Parker complains to Megan. “We don’t have to remove poor animals from their little homes under rocks. From their families!”\u003c/p\u003e\n\u003cp\u003e“Is she always this opinionated?” Megan asks Will.\u003c/p\u003e\n\u003cp\u003eHe smiles and gives a little shrug. “It does seem kind of inhumane.”\u003c/p\u003e\n\u003cp\u003eParker loops her arm around Will’s elbow and pecks his cheek. Megan watches them, not disapprovingly but longingly—it’s almost as if she’s as jealous of their relationship as I am. Then she focuses on Eric. Still wearing his combat boots and camo pants, he’s standing on the bank whittling a stick. The rest of us are in water shoes and shorts and bathing suits, in case we slip and fall in the chilly creek.\u003c/p\u003e\n\u003cp\u003e“Are you coming in, Eric?” Megan asks.\u003c/p\u003e\n\u003cp\u003eHe scrapes the stick with his knife. “I’m good. I’ve got this activity down pat.”\u003c/p\u003e\n\u003cp\u003eShe nods slowly and after staring at him for a moment too long, she turns to face the rest of us. She blows her whistle, and I wince.\u003c/p\u003e\n\u003cp\u003e“Let’s get going,” she says. “Pay attention to where the deep spots are, so you can point them out to campers. The most important thing to remember about this activity is that you should always have a first aid kit handy. Be careful not to slip and fall. Try picking up some crayfish.”\u003c/p\u003e\n\u003cp\u003e“Get them right behind the claws,” Eric calls out from the banks. “That way they don’t pinch you. The big ones could snap your finger off.”\u003c/p\u003e\n\u003cp\u003e“Right,” Megan agrees.\u003c/p\u003e\n\u003cp\u003eParker harrumphs behind me.\u003c/p\u003e\n\u003cp\u003eWill and Matt move ahead of the group, stopping to flip over stones in the water, to look under them.\u003c/p\u003e\n\u003cp\u003e“Eric is still pissed he didn’t get the camp director position, huh?” Andrea whispers to Carlie.\u003c/p\u003e\n\u003cp\u003e“Yeah, and Megan is up for that big Bible education job at the regional conference,” Carlie whispers back. “Mom told me that the conference is watching how well she runs camp before giving her the job.”\u003c/p\u003e\n\u003cp\u003e“She’s seriously uptight this year.”\u003c/p\u003e\n\u003cp\u003e“She’s got a hard-on for Eric, that’s why,” Carlie says. “She needs to majorly get laid.”\u003c/p\u003e\n\u003cp\u003eI accidentally stick my tongue out at the thought of that, and Parker laughs at the face I’m making. I trudge through shin-high water to wade next to her.\u003c/p\u003e\n\u003cp\u003e“Is this your first job?” I whisper to her.\u003c/p\u003e\n\u003cp\u003e“No.” She bends down to pick up a shell. “I worked at Chuck E. Cheese last summer. It was baaaad.”\u003c/p\u003e\n\u003cp\u003eI watch as she examines the shell, turning it over in her palm. “This is my first job,” I say. “I didn’t realize it would be so much like high school. All over again. You know?”\u003c/p\u003e\n\u003cp\u003e“My dad says gossip never goes away, no matter where you are in life.”\u003c/p\u003e\n\u003cp\u003e“Great,” I say in a flat tone, making Parker smile. “My dad has never mentioned if gossip is bad at his work or not.” He’s a tax attorney, which is like the most boring kind of lawyer there is.\u003c/p\u003e\n\u003cp\u003eParker carefully places the shell back down in the creek and wades off with Will, taking his hand in hers. It reminds me of the buddy system.\u003c/p\u003e\n\u003cp\u003eWhen I was little, we weren’t supposed to go anywhere at camp without our buddy. Emily was always mine. We used to hold hands as we waded in the creek. We did cannonballs off the side of the pool together.\u003c/p\u003e\n\u003cp\u003eI never imagined that one day I would have no buddy beside me.\u003c/p\u003e\n\u003cp\u003eThat’s when Matt slows down to wade next to me.\u003c/p\u003e\n\u003cp\u003e“Hey, King Crab Kate,” he croons, making me beam.\u003c/p\u003e\n\u003cp\u003e“Hi, Miniature Poodle Matt.”\u003c/p\u003e\n\u003cp\u003eWe angle off from the group, and at first the silence is scary and makes me want to chew all my fingernails off, but then I peek over at his face and see the calm smile there. I bend down to turn over a rock. I find three tiny crayfish the size of my thumb but let them scurry away. The bubbling water noises make my heart slow down.\u003c/p\u003e\n\u003cp\u003eI rise to my full height again, to find Matt waiting for me, and we keep trudging down the creek. The water is chilly but the air is hotter than a sauna.\u003c/p\u003e\n\u003cp\u003e“So what’s this about you and a banana in the dining hall?” I ask, even though part of me doesn’t want to know.\u003c/p\u003e\n\u003cp\u003eHe drags a hand through his hair, ruffling it. “I wish you hadn’t heard that.”\u003c/p\u003e\n\u003cp\u003e“Why are you in a frat?”\u003c/p\u003e\n\u003cp\u003eHis eyebrows furrow. “They’re my friends. The guys were just messing around,” he says, flushing.\u003c/p\u003e\n\u003cp\u003eI wouldn’t want friends who make me do questionable things with a banana, but I let it go because I don’t want to embarrass him.\u003c/p\u003e\n\u003cp\u003eParker told me that after her mom left, she needed friends more than anything. Did she hook up a lot because she was lonely? At the time, all I saw was that she fooled around with too many people, when now I know that she was hurting.\u003c/p\u003e\n\u003cp\u003eSo maybe there are two sides to Matt wanting to be in a fraternity.\u003c/p\u003e\n\u003cp\u003e“I don’t know much about frats,” I say. “How many guys are in it?”\u003c/p\u003e\n\u003cp\u003e“We have ninety-seven members right now. We’ll take on more in the fall.”\u003c/p\u003e\n\u003cp\u003e“That’s a lot of friends.”\u003c/p\u003e\n\u003cp\u003eHe nods and smiles. “I know some of the guys better than others.”\u003c/p\u003e\n\u003cp\u003e“But what’s up with the banana?” I laugh softly.\u003c/p\u003e\n\u003cp\u003e“It’s not for a lady’s ears.”\u003c/p\u003e\n\u003cp\u003eHe bends down and moves a rock. He spots a crayfish and picks him up, looks him in the eye, and then puts him back down beside the rock.\u003c/p\u003e\n\u003cp\u003e“You’re majoring in literature?” I ask Matt.\u003c/p\u003e\n\u003cp\u003eA smile appears on his face. “Yeah.”\u003c/p\u003e\n\u003cp\u003e“What do you like to read?”\u003c/p\u003e\n\u003cp\u003e“Anything, really. I love everything from Dickens to John Grisham to John Green to Judy Blume.”\u003c/p\u003e\n\u003cp\u003eJudy Blume? I’ve smiled more this morning than I have in months. “What’s your favorite book?”\u003c/p\u003e\n\u003cp\u003e“The Once and Future King, by T. H. White.”\u003c/p\u003e\n\u003cp\u003e“I haven’t heard of it. What’s it about?” I ask.\u003c/p\u003e\n\u003cp\u003e“King Arthur and how he pulled the sword from the stone and became the king of Camelot…What’s your favorite book?”\u003c/p\u003e\n\u003cp\u003e“Where the Red Fern Grows. About the dogs and coon hunting?”\u003c/p\u003e\n\u003cp\u003e“I hate that book,” I hear Parker muttering to Will. “All those poor raccoons got killed to make hats.”\u003c/p\u003e\n\u003cp\u003e“I love that book,” Matt says, grinning over at me. “I think that’s the first book I ever cried at. When the dog got into the fight with the mountain lion.”\u003c/p\u003e\n\u003cp\u003e“You cried?”\u003c/p\u003e\n\u003cp\u003e“You’re not a real man unless you can admit you cry.”\u003c/p\u003e\n\u003cp\u003e“Oh really?” I tease.\u003c/p\u003e\n\u003cp\u003e“Shush,” he says, laughing as he picks up a tree branch from the banks. He snaps a stick from it, then drops the branch in the water. The current carries it away. “What other books do you like?”\u003c/p\u003e\n\u003cp\u003e“I don’t read a lot,” I admit. “I’m more into art.”\u003c/p\u003e\n\u003cp\u003e“Is that why you carry around the little portfolio and pencils?”\u003c/p\u003e\n\u003cp\u003eI peel a strand of hair away from my damp forehead and nod. “Do you want to become a writer or something? Is that why you’re majoring in literature?”\u003c/p\u003e\n\u003cp\u003eHe squats and dips his hand down beneath the surface, scooping up water. “Maybe. I mean, I’d like to do that eventually, you know, when I find the right idea for a story, but I think I’ll probably become an English teacher in the meantime. Like my dad.”\u003c/p\u003e\n\u003cp\u003e“But don’t you have to wear shoes at school?”\u003c/p\u003e\n\u003cp\u003eHe splashes my shin. “What are you going to major in?”\u003c/p\u003e\n\u003cp\u003e“I have no clue,” I say. “Daddy thinks I should do the pre-law track, but I don’t think it sounds all that exciting.”\u003c/p\u003e\n\u003cp\u003e“Agreed,” he says, laughing. “One time I looked at an LSAT study guide, just to see what going to law school might be like, and I fell asleep. I drooled all over it.”\u003c/p\u003e\n\u003cp\u003eI laugh, and two steps later, I slip and nearly wipe out. Matt grabs me, stopping me from crashing down into the water. He helps me to my feet.\u003c/p\u003e\n\u003cp\u003e“Is your knee okay?” He peers down at my scar.\u003c/p\u003e\n\u003cp\u003eI’m grasping his elbows. “I’m fine.”\u003c/p\u003e\n\u003cp\u003eThe creek forks and splits to the right, but we keep walking straight.\u003c/p\u003e\n\u003cp\u003eAndrea wades past us, peering over at me.\u003c/p\u003e\n\u003cp\u003eHaving never stepped a foot in the creek, Eric is waiting for us at the other end. My water shoes make squishy noises when I step out onto the grass.\u003c/p\u003e\n\u003cp\u003e“Did you catch any crawdaddies?” Eric asks me.\u003c/p\u003e\n\u003cp\u003eI shake my head, glancing at Parker. “I wouldn’t want to hurt them.”\u003c/p\u003e\n\u003cp\u003eShe finds my eyes.\u003c/p\u003e\n\u003cp\u003e“If you didn’t even try, how will you teach campers how to do it?” Megan asks me, clucking her tongue. I’m surprised she hasn’t blown her whistle in my face and asked if I can do anything right.\u003c/p\u003e\n\u003cp\u003e“I don’t see why campers have to do it at all,” I say.\u003c/p\u003e\n\u003cp\u003e“Me neither,” Matt says, adjusting his bandana. “They could just enjoy nature.”\u003c/p\u003e\n\u003cp\u003e“Creek stomping is a rite of passage at Cumberland Creek Camp!” Megan’s face looks like it might explode.\u003c/p\u003e\n\u003cp\u003eI watch Brad as he mouths “rite of passage” with his jaw draped open.\u003c/p\u003e\n\u003cp\u003eTo fill the silence (I guess), Eric announces to the group, “Some campers might want to save their crayfish for the Critter Crawl, but they aren’t usually good contenders.”\u003c/p\u003e\n\u003cp\u003e“What is the Critter Crawl?” Parker asks.\u003c/p\u003e\n\u003cp\u003e“Every week we’ll have a contest where each group finds an animal to compete in a race,” Eric replies. “Like granddaddy longlegs and beetles and worms. We put the animals in a ring and whichever one escapes the ring first wins.”\u003c/p\u003e\n\u003cp\u003eParker sets her hands on her waist. “I am so calling PETA.”\u003c/p\u003e\n\u003cp\u003eI had forgotten all about hobo packs.\u003c/p\u003e\n\u003cp\u003eI loved them when I was a little girl. It’s Sunday evening, the day before camp is to start, and we’re preparing to cook over the campfire.\u003c/p\u003e\n\u003cp\u003e“It should taste like beef stew if you make it right,” Megan tells us. “Everyone watch how Carlie does it. Her hobo packs are always delicious!” Megan has a bright smile on her face. \u003c/p\u003e","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-8.html","bookId":1968,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
