{"id":70886,"no":9,"title":"Page 9","content":"\u003cp\u003eWhen her back is turned, Carlie sticks a finger in her mouth, fake-gagging herself. “I wish she’d stop sucking up to me. As if I have any control over who my mom hires.”\u003c/p\u003e\n\u003cp\u003e“We should use Megan’s brownnosing to our advantage,” Ian says. “Tell her we need a karaoke machine!”\u003c/p\u003e\n\u003cp\u003eMatt asks, “I really want a hot tub.”\u003c/p\u003e\n\u003cp\u003eI laugh, making Matt grin. “I want a fountain soda machine,” I say.\u003c/p\u003e\n\u003cp\u003eWe all gather around the picnic tables to assemble our hobo packs. First we each rip off a long strip of aluminum foil. I take pieces of beef and spread them across my foil, then pile mushrooms, carrots, potatoes, and green beans on top. Add salt and pepper to taste. Wrap it up like a burrito and place it right in the fire, on top of the logs.\u003c/p\u003e\n\u003cp\u003eAnd of course mine immediately starts falling apart. The foil splits open. The veggies and beef fall onto the wood. I groan loudly. I spent twenty minutes preparing that!\u003c/p\u003e\n\u003cp\u003e“Try wrapping it tighter,” Megan tells me, clucking her tongue.\u003c/p\u003e\n\u003cp\u003e“Like a burrito,” Eric interrupts.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I say. “I’ll start over.”\u003c/p\u003e\n\u003cp\u003e“You have to be able to show campers how to do this right,” Eric says, pushing the skewer into me even deeper.\u003c/p\u003e\n\u003cp\u003e“Like a burrito,” Megan repeats.\u003c/p\u003e\n\u003cp\u003e“Like at Just Tacos!” Matt calls over his shoulder to me. He’s already feasting over at the picnic table.\u003c/p\u003e\n\u003cp\u003eI snort. “Did they have hobo packs at Just Tacos?”\u003c/p\u003e\n\u003cp\u003e“Probably. They had everything in the world there,” Matt replies. “It wasn’t just tacos!”\u003c/p\u003e\n\u003cp\u003eIan and Brad just pulled their hobo packs out of the fire and are moving back to the picnic tables. Carlie turns hers over, using tongs. The fire crackles and hisses as she nestles her pack back down in the embers.\u003c/p\u003e\n\u003cp\u003eI go back over to my cutting board and start slicing beef, carrots, and potatoes all over again, to make a new pack. I’m not even hungry, but if I just say to heck with it, Megan will probably get angry with me, and I’m sick of that blasted whistle.\u003c/p\u003e\n\u003cp\u003eAt the table beside mine, Andrea and Matt are whispering as they eat.\u003c/p\u003e\n\u003cp\u003e“Please?” she says, pushing a chunk of beef around with a plastic fork. “Let’s do something during free time tonight.”\u003c/p\u003e\n\u003cp\u003e“I think I’m gonna work on this new dodgeball court thing I want to build,” he replies, popping a cooked carrot into his mouth. “Do you want to help me?”\u003c/p\u003e\n\u003cp\u003e“I was hoping we could take a hike or go down to the lake. Alone? Together?”\u003c/p\u003e\n\u003cp\u003eHe goes quiet for several seconds. “I really want to get started on my dodgeball idea.”\u003c/p\u003e\n\u003cp\u003e“Fine.”\u003c/p\u003e\n\u003cp\u003eI want to ask him about his dodgeball court idea, but I stay silent, so that maybe Andrea will forget I exist.\u003c/p\u003e\n\u003cp\u003eI mix all of my hobo pack materials, taking more care this time, and then wrap up my aluminum foil as tightly as I can. The last thing I want is for my hobo pack to disintegrate twice in one night.\u003c/p\u003e\n\u003cp\u003eCan a person get banned from camping?\u003c/p\u003e\n\u003cp\u003eThis time my hobo pack stays in one piece as it cooks, and Will fishes it out for me with tongs. He drops it onto my tin plate. Careful not to burn my fingers, I rip the aluminum open and the smell of beef stew wafts up to my nose. Okay, so I was hungry.\u003c/p\u003e\n\u003cp\u003eMatt, Ian, Brad, and Will finish up their food and decide to go play a game of two-on-two up at the basketball court. I pick at my dinner and eavesdrop on Andrea and Carlie.\u003c/p\u003e\n\u003cp\u003e“Give it time. If you really like him—” Carlie says.\u003c/p\u003e\n\u003cp\u003e“I do really like him.” Andrea’s voice is hard.\u003c/p\u003e\n\u003cp\u003e“Then you can wait for him to work stuff out,” Carlie whispers.\u003c/p\u003e\n\u003cp\u003e“He’s getting even more distant.” Andrea shuts her eyes and sucks on her bottom lip. “I wish I’d get the sign this year. I wish God would show me how I’m supposed to work things out with him. I wish I’d never fallen for him in the first place.”\u003c/p\u003e\n\u003cp\u003e“You can’t help how you feel. He needed somebody, and you were a good friend to him,” Carlie says quietly, putting an arm around Andrea. “You’re a great person.”\u003c/p\u003e\n\u003cp\u003eCarlie looks up at that moment and catches me staring. “This isn’t your business,” she says.\u003c/p\u003e\n\u003cp\u003eMy face heats up. I wad my aluminum foil into a ball and throw it in the garbage bin, then stand and just walk. I have no idea where I’m going. I could go get my knee brace that’s made of more steel than a skyscraper and see if I can do some jogging in it, to try to get used to it. Maybe if I go out and roam the trails, God will give me the sign. Sorry to act selfish, but I feel like I need the sign more than Andrea does.\u003c/p\u003e\n\u003cp\u003eI pass by Parker, who’s telling Eric (Camper Extraordinaire), that the Critter Crawl is “an unbelievable act of cruelty and must be called off immediately.”\u003c/p\u003e\n\u003cp\u003eI shove my hands in the pockets of my jean shorts and make my way up the trail. If Emily were here, I bet we would’ve died laughing when my hobo pack fell apart in the fire. Then she would’ve shared hers with me.\u003c/p\u003e\n\u003cp\u003eThe sunset looks like a rainbow. Stars are beginning to peek through the colors. I pass by the basketball court, where the guys are playing shirts versus skins. Will and Matt are on skins and Brad and Ian are shirts. Matt takes a jump shot and makes it—nothing but net. When his bare feet hit the ground, he looks up. He drags a hand through his shaggy blond hair, then waves at me.\u003c/p\u003e\n\u003cp\u003eI wave back.\u003c/p\u003e\n\u003cp\u003eWill playfully shoves Matt’s shoulder, and Matt grins, continuing to look my way.\u003c/p\u003e\n\u003cp\u003eI smile at him and keep walking toward Cardinal.\u003c/p\u003e\n\u003cp\u003eWhat was Andrea talking about? What can’t Matt get past?\u003c/p\u003e\n\u003cp\u003eHow did I save him?\u003c/p\u003e\n\u003cp\u003ePast midnight, someone knocks on the screen door of Cardinal.\u003c/p\u003e\n\u003cp\u003eI’m tired. I’m sweaty. It’s been a rough two days of learning how bad I am at everything outdoorsy, like fishing off the docks. Only I could manage to knock an entire can of bait into the lake.\u003c/p\u003e\n\u003cp\u003eOnly seven weeks of camp to go.\u003c/p\u003e\n\u003cp\u003eMy bed screeches as I roll over and peer up to find Matt standing outside. The moon casts a glow around his body. I swing myself out of bed and go open the screen door for him. He’s wearing a pair of light blue scrubs as pajama pants, and no shirt. I already saw him shirtless playing basketball and swimming at the lake, but still, my stomach flips and flops.\u003c/p\u003e\n\u003cp\u003e“Hey,” he says, checking out my XXXXXL T-shirt. Note to self: wear cuter pajamas in case boys drop by randomly after midnight.\u003c/p\u003e\n\u003cp\u003e“What are you doing here?”\u003c/p\u003e\n\u003cp\u003e“I don’t like the idea of you sleeping in here all by yourself.” He stifles a yawn.\u003c/p\u003e\n\u003cp\u003e“I’ll be fine,” I say, my shoulders tensing. “I can’t let you sleep in here with me.”\u003c/p\u003e\n\u003cp\u003eHe waves a hand. “I’m gonna sleep out on the porch.” He steps past and begins dragging a bed through the door. The metal frame creaks and groans.\u003c/p\u003e\n\u003cp\u003e“This isn’t necessary,” I say. My heartbeat races and races.\u003c/p\u003e\n\u003cp\u003eHe drops the bed with a clang on the porch and stretches his sleeping bag out on the thin mattress. “What if the bogeyman is out here?”\u003c/p\u003e\n\u003cp\u003e“The bogeyman?” I laugh. “A myth.”\u003c/p\u003e\n\u003cp\u003eMatt fluffs his pillow. “How about that dude with a hook for a hand?” He drops the pillow and makes a claw with his fingers and growls.\u003c/p\u003e\n\u003cp\u003e“Are you saying that you’re the bogeyman?” I ask.\u003c/p\u003e\n\u003cp\u003eHe smiles. “I’d already have captured you if I was.”\u003c/p\u003e\n\u003cp\u003e“What if you get eaten up by mosquitoes? Or a black widow spider?”\u003c/p\u003e\n\u003cp\u003e“Eh, it’s worth the risk.” His mouth stretches into another yawn.\u003c/p\u003e\n\u003cp\u003e“Thanks for sleeping out here.”\u003c/p\u003e\n\u003cp\u003eHe nods and yawns again. “I’m about to pass out.”\u003c/p\u003e\n\u003cp\u003eWhere has he been all night? Has he been hanging out with Andrea up until now? I play with the hem of my long T-shirt. “See you tomorrow?”\u003c/p\u003e\n\u003cp\u003e“It already is tomorrow,” he groans, flopping down on the bed. It screeches and wobbles.\u003c/p\u003e\n\u003cp\u003eI go curl up in my sheets.\u003c/p\u003e\n\u003cp\u003e“Sweet dreams, Kate,” he calls out.\u003c/p\u003e\n\u003cp\u003e“You too.”\u003c/p\u003e\n\u003cp\u003eSeconds later I hear him snoring up a storm on the porch and it makes me laugh. Didn’t he say that Will is the bad snorer? Matt sounds like a bulldozer. I bring two fingers to my lips, laughing, and smile myself to sleep.\u003c/p\u003e\n\u003cp\u003esketch #346\u003c/p\u003e\n\u003cp\u003ewhat happened last night\u003c/p\u003e\n\u003cp\u003eBefore campers start arriving at 9:00 a.m., I walk up to the cafeteria. The entire area is hilly and mountainous, but the building rests at the highest spot of the camp. From here, you can see everything. I sit Indian style on a bench, where I can stare at the valley full of cedar trees. I can smell their sappy smell.\u003c/p\u003e\n\u003cp\u003eI pull my pencil from behind my ear and open my sketchpad to a blank page. Chewing on the eraser, I think about last night. How Matt slept outside Cardinal. It was the first time in a long time I didn’t feel alone.\u003c/p\u003e\n\u003cp\u003eI begin with the bed and mattress that he pulled through the door onto the porch, sketching the legs and beams that support the steel. I make thick lines across the mattress, to denote the blue stripes. After taking a quick glance around me to make sure I’m alone, I outline what Matt’s body looks like without a shirt, showing him wearing only blue hospital scrub pants. I pay careful attention to his muscles. Not because I’m being a pervert or anything, but because the human body is the hardest thing to draw. It requires precision and patience and a steady hand.\u003c/p\u003e\n\u003cp\u003eThat’s when I hear footsteps. I snap the book closed against my chest. I look up to see Will, Brad, and Matt running together. Will and Brad are huffing and puffing, trying to keep up with Matt the marathoner.\u003c/p\u003e\n\u003cp\u003eI lift my hand to wave. All three wave back, which makes my heart swell.\u003c/p\u003e\n\u003cp\u003e“Come run with us,” Matt calls out to me. “Get that knee in shape.”\u003c/p\u003e\n\u003cp\u003eCan my knee handle running again? I’m not sure, but I’m willing to take the risk to spend time with Matt. “Okay! Meet me at my cabin in ten minutes.”\u003c/p\u003e\n\u003cp\u003eHe disappears down the dirt steps, heading toward the art pavilion. I walk as quickly as I can back to Cardinal and throw on a sports bra, shorts, a tank top, and sneakers. Carefully, I put on my steel knee brace that makes me sound like a walking industrial paper slicer. I step out onto the porch, where Matt is waiting for me.\u003c/p\u003e\n\u003cp\u003e“Where are Brad and Will?” I ask, tightening my black ponytail.\u003c/p\u003e\n\u003cp\u003e“They gave up already.” Matt stretches out a hand to me and I take it. “You got this.”\u003c/p\u003e\n\u003cp\u003eWe walk, my hand lightly tucked inside his. I don’t think I can handle running on trails full of hazards like rocks, sticks, and tree roots, so we go to the big field.\u003c/p\u003e\n\u003cp\u003e“Nice and slow,” Matt says, and I lurch into a jog, keeping my breath steady. Thanks to my exercise bike, I’ve saved some of my endurance.\u003c/p\u003e\n\u003cp\u003e“You’ve still got your form,” he says, looking me up and down while running. I hope he’s seeing me as I want to be seen: black hair flowing in the wind, smiling, moving swiftly and gracefully.\u003c/p\u003e\n\u003cp\u003eWe run five laps around the big field, hardly speaking a word. When I look over at his face, I find his mouth shut in a tight smile.\u003c/p\u003e\n\u003cp\u003e“What were you doing this morning? In the notebook?” he asks.\u003c/p\u003e\n\u003cp\u003e“Drawing.”\u003c/p\u003e\n\u003cp\u003e“I’d love to see your work sometime.”\u003c/p\u003e\n\u003cp\u003eI don’t share my sketchpad with anybody. “Maybe,” I say softly, not meaning it. \u003c/p\u003e","sourceLink":"https://allnovel.net/things-i-can-t-forget-hundred-oaks-3/page-9.html","bookId":1968,"creation":"Oct 5, 2019 10:18:32 AM","modification":"Oct 5, 2019 10:18:32 AM"}
