{"id":33451,"no":12,"title":"CHAPTER XII. TOM’S JOURNEY.","content":"AS TOM went home his mind was in a whirl of mingled excitement and bewilderment. Neither he nor any one else in the village had harbored a moment’s doubt on the subject of the wandering tramp. It was firmly believed that he had been consumed in the burning barn. Now it turned out that he was not a victim of the conflagration, but was alive and well in the city of New York.\n\u003cbr\u003e \n\u003cbr\u003e “He must be better off than he was when I met him,” thought Tom, “or he wouldn’t be able to send me a ten-dollar bill.”\n\u003cbr\u003e \n\u003cbr\u003e His thoughts recurred to the fire and to Darius Darke.\n\u003cbr\u003e \n\u003cbr\u003e If the tramp had not accidentally set the old barn on fire, who had? Was it possible that Darius had set it on fire out of spite against the owner? This was hardly likely, since John Simpson had allowed him to sleep there, and probably given him money, which would account for his ability to send the ten-dollar bill.\n\u003cbr\u003e \n\u003cbr\u003e Tom finally settled upon this theory. The tramp, he decided, had accidentally set the barn on fire while smoking, but had managed to escape. The fear of being charged with incendiarism would naturally prompt73 him to escape while he could. What Mr. Darke had to communicate to him he could not conjecture, but he was resolved to meet him at the time specified. It must be important, or he would not have offered to defray his expenses.\n\u003cbr\u003e \n\u003cbr\u003e One difficulty presented itself. He was forbidden to mention the existence of Darius Darke. How, then, could he account to his mother for his wish to visit New York—a journey which he had never made alone? In fact, he had been in the great city but twice in his life.\n\u003cbr\u003e \n\u003cbr\u003e It was now Thursday, and it was not necessary yet to mention the matter. He might think of some plausible pretext before Monday.\n\u003cbr\u003e \n\u003cbr\u003e He did not wait in vain.\n\u003cbr\u003e \n\u003cbr\u003e On Friday, when engaged in copying in the minister’s study, he overheard Mr. Julian say to his wife:\n\u003cbr\u003e \n\u003cbr\u003e “I ought to go to New York in a day or two, but I hardly know how to spare the time.”\n\u003cbr\u003e \n\u003cbr\u003e “On business?” inquired his wife.\n\u003cbr\u003e \n\u003cbr\u003e “Yes; I draw a certain amount of interest money every quarter from Mr. Mellish, of Mellish \u0026amp; Co., No. — Wall Street, who has charge of some securities of mine. It was due a week since, and I may have occasion for it.”\n\u003cbr\u003e \n\u003cbr\u003e “Why can’t you spare time to go?”\n\u003cbr\u003e \n\u003cbr\u003e “I am to make a tour of inspection among the schools next week, and I have, besides, some extra writing to do.”\n\u003cbr\u003e \n\u003cbr\u003e Mr. Julian chanced to be chairman of the school committee in Wilton, and the supervision of the schools brought him considerable labor.\n\u003cbr\u003e \n\u003cbr\u003e 74\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Julian,” said Tom, looking up from his writing, “couldn’t I do the business for you?”\n\u003cbr\u003e \n\u003cbr\u003e The minister looked surprised.\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know but you could,” he said, after a pause of consideration. “Do you know your way about New York?”\n\u003cbr\u003e \n\u003cbr\u003e “Not very well, but I’ll find it,” answered Tom, promptly.\n\u003cbr\u003e \n\u003cbr\u003e “What put it in your head to propose going?” asked Mr. Julian.\n\u003cbr\u003e \n\u003cbr\u003e “I saw a copy of the New York Herald the other day. It contained a good many advertisements for help. I should look around and see if I couldn’t hear of some place.”\n\u003cbr\u003e \n\u003cbr\u003e “Not a bad idea,” said the minister, approvingly. “Well, I believe I will trust you. When do you want to go?”\n\u003cbr\u003e \n\u003cbr\u003e “On Monday,” said Tom, promptly.\n\u003cbr\u003e \n\u003cbr\u003e “Very well, Monday let it be—that is, of course, if your mother doesn’t object. I shall pay your railway fares, and give you money enough to buy your dinner.”\n\u003cbr\u003e \n\u003cbr\u003e “Thank you, sir.”\n\u003cbr\u003e \n\u003cbr\u003e Tom would have declined taking money for his expenses, but he could not do so without betraying his own secret. He therefore made no objection.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Thatcher felt a little nervous about Tom’s going to the city alone. He was old enough to be trusted to make such a journey, but his mother had traveled so little that she felt timid.\n\u003cbr\u003e \n\u003cbr\u003e “You must be very careful, Tom,” she urged. “I75 hear there are a great many wicked men in New York, who may lie in wait for you, and lead you astray.”\n\u003cbr\u003e \n\u003cbr\u003e “I think, mother,” said Tom, good-humoredly, “they won’t think me of sufficient importance. Besides, you know, I am only to be in the city a few hours.”\n\u003cbr\u003e \n\u003cbr\u003e “I shall feel anxious till you get back, Tom.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t believe anybody will try to carry me off, mother. If they do they’ll have a tough job. I’ll make it lively for them.”\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Thatcher, privately, was of the opinion that Mr. Julian had acted imprudently in trusting a boy with so important a commission, but she saw that Tom had no fears, and acquiesced in his going.\n\u003cbr\u003e \n\u003cbr\u003e The morning train for New York left the Wilton station at half-past eight o’clock.\n\u003cbr\u003e \n\u003cbr\u003e Rather to Tom’s surprise, Rupert Simpson was a passenger by this train. As Tom entered the cars, he found Rupert already installed in a seat by the window. There was no other seat vacant except the one beside him.\n\u003cbr\u003e \n\u003cbr\u003e “Is that seat taken, Rupert?” asked Tom.\n\u003cbr\u003e \n\u003cbr\u003e Rupert surveyed our hero in undisguised surprise and awe.\n\u003cbr\u003e \n\u003cbr\u003e “No,” he answered. “Where are you going?”\n\u003cbr\u003e \n\u003cbr\u003e “To New York,” answered Tom, seating himself. “I suppose you are going there, too.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. I didn’t expect to meet you here.”\n\u003cbr\u003e \n\u003cbr\u003e “No, I suppose not.”\n\u003cbr\u003e \n\u003cbr\u003e “What are you going for?”\n\u003cbr\u003e \n\u003cbr\u003e “On business,” returned Tom.\n\u003cbr\u003e \n\u003cbr\u003e 76 “What sort of business can you possibly have in New York?” demanded Rupert, impatiently.\n\u003cbr\u003e \n\u003cbr\u003e Tom was in good spirits, and disposed to be on good terms with everybody. Otherwise he might, perhaps, have taken offense at Rupert’s tone.\n\u003cbr\u003e \n\u003cbr\u003e “It isn’t business of my own,” he answered, “that is not entirely. I am going up for Mr. Julian.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s strange.”\n\u003cbr\u003e \n\u003cbr\u003e “Is it? Why?”\n\u003cbr\u003e \n\u003cbr\u003e “It is strange that he should trust any business to a boy like you.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know but it is. I think I can attend to it, though.”\n\u003cbr\u003e \n\u003cbr\u003e “What sort of business is it?” continued Rupert, giving way to curiosity.\n\u003cbr\u003e \n\u003cbr\u003e “I don’t think I ought to tell, as it is his business, not mine.”\n\u003cbr\u003e \n\u003cbr\u003e “No doubt it is of great consequence,” sneered Rupert.\n\u003cbr\u003e \n\u003cbr\u003e “It is of some importance, certainly. Are you going on business, too?”\n\u003cbr\u003e \n\u003cbr\u003e “I am going to stay a week with some friends on Madison Avenue,” answered Rupert. “I suppose you have heard of Madison Avenue?”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know that I have. I don’t know much about the city.”\n\u003cbr\u003e \n\u003cbr\u003e “It is one of the finest streets in the city, and my friends live in an elegant house.”\n\u003cbr\u003e \n\u003cbr\u003e “You will have a fine time, no doubt,” said Tom.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, yes, I am sure to. I shall go all about.”\n\u003cbr\u003e \n\u003cbr\u003e 77 “I wish I were in your place, Rupert.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, it wouldn’t suit you. You wouldn’t know how to behave among fashionable people.”\n\u003cbr\u003e \n\u003cbr\u003e “Why wouldn’t I?” asked Tom, spiritedly.\n\u003cbr\u003e \n\u003cbr\u003e “Because you are only a shoe-pegger. You are not used to good society.”\n\u003cbr\u003e \n\u003cbr\u003e “I consider my mother and sister to be good society,” said Tom, quickly.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, no doubt they are good sort of people,” said Rupert, condescendingly, “but they are not fashionable.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t see much difference between you and me on that score,” said Tom. “Your father and mine used to work at the shoe bench together.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you mean to insult me?” asked Rupert, flushing with vexation.\n\u003cbr\u003e \n\u003cbr\u003e “No, I am only telling the truth.”\n\u003cbr\u003e \n\u003cbr\u003e Rupert looked offended, and became silent and sullen. By this time there was another vacant seat on the opposite side of the car. Tom rose and took it, finding that Rupert did not enjoy his society. On the whole he was not sorry, for he had feared that he might be unable to shake him off, and he did not wish any one from Wilton to be present at his interview with Darius Darke.\n\u003cbr\u003e \n\u003cbr\u003e An hour and a half passed quickly. By ten o’clock Tom was in New York—two hours before the time appointed for the meeting.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2060/58623.html","bookId":568,"creation":"Aug 5, 2019 4:56:18 AM","modification":"Aug 5, 2019 4:56:18 AM"}
