{"id":33455,"no":16,"title":"CHAPTER XVI. TOM’S VISIT TO PEARL STREET.","content":"“LET ME look at the papers,” said Mr. Darke. As he did so he whistled.\n\u003cbr\u003e \n\u003cbr\u003e “Tom,” he said, “this small bundle of papers is worth ten thousand dollars.”\n\u003cbr\u003e \n\u003cbr\u003e “Is it possible?” exclaimed Tom, in amazement.\n\u003cbr\u003e \n\u003cbr\u003e “Yes; I have made a rough estimate of their value. Now what are you going to do with them?”\n\u003cbr\u003e \n\u003cbr\u003e “Return them, of course.”\n\u003cbr\u003e \n\u003cbr\u003e “I thought you would say so. Luckily you will have no difficulty about it. On the envelope is the owner’s name and address—Samuel Perkins, No. 597 Pearl Street.”\n\u003cbr\u003e \n\u003cbr\u003e “I will go there at once,” said Tom, promptly.\n\u003cbr\u003e \n\u003cbr\u003e “Do so. The owner will be anxious if he has discovered his loss. When shall I see you again?”\n\u003cbr\u003e \n\u003cbr\u003e “I will come to the city day after to-morrow.”\n\u003cbr\u003e \n\u003cbr\u003e “I shall want to see you. I shall still be at the Astor House.”\n\u003cbr\u003e \n\u003cbr\u003e While Tom is on the way to Pearl Street, we will precede him.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Perkins, on his return to his office, was for an hour or two engaged in business duties. Then a business98 friend, with whom he was also socially intimate, came in, and they found time for a chat.\n\u003cbr\u003e \n\u003cbr\u003e “By the way, Darrell,” said Mr. Perkins, “I have been making a purchase. What do you say to my new overcoat?”\n\u003cbr\u003e \n\u003cbr\u003e “It seems a very good one. Where did you buy it?”\n\u003cbr\u003e \n\u003cbr\u003e Mr. Perkins told him.\n\u003cbr\u003e \n\u003cbr\u003e “I bought it ready made, contrary to my usual custom, but it fits as snugly as a kid glove.”\n\u003cbr\u003e \n\u003cbr\u003e “Where is the old one. If you have no use for it, I would like it for a poor man of my acquaintance.”\n\u003cbr\u003e \n\u003cbr\u003e “Too late, Darrell. I gave it away in the store.”\n\u003cbr\u003e \n\u003cbr\u003e “How was that?”\n\u003cbr\u003e \n\u003cbr\u003e “I saw a bright-looking boy pricing a coat. He was apparently a country boy, and had no outer garment. You know I am not very gigantic; so, concluding that my old coat would fit him, I offered it, and it was gratefully accepted.”\n\u003cbr\u003e \n\u003cbr\u003e “Then I am too late. By the way, I hope there was nothing in the pockets?”\n\u003cbr\u003e \n\u003cbr\u003e He was startled at the effect of his words. Mr. Perkins jumped to his feet, while a look of absolute dismay overspread his face. He plunged both hands hastily into the pockets of his new coat, and exclaimed:\n\u003cbr\u003e \n\u003cbr\u003e “What a cursed fool I have been!”\n\u003cbr\u003e \n\u003cbr\u003e “What’s the matter, Perkins?” asked his friend.\n\u003cbr\u003e \n\u003cbr\u003e “The matter? Matter enough! In the pocket of the coat I gave away was a package of securities amounting to about ten thousand dollars in value.”\n\u003cbr\u003e \n\u003cbr\u003e “Good heavens!”\n\u003cbr\u003e \n\u003cbr\u003e 99\n\u003cbr\u003e \n\u003cbr\u003e “And they didn’t belong to me. They belong to my ward. I got them out of the safe deposit vaults to-day.”\n\u003cbr\u003e \n\u003cbr\u003e “That is serious. Do you know where the boy lives?”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know his name.”\n\u003cbr\u003e \n\u003cbr\u003e Darrell whistled.\n\u003cbr\u003e \n\u003cbr\u003e “Are the securities negotiable?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e “A part of them.”\n\u003cbr\u003e \n\u003cbr\u003e “I wish I could advise you what to do. Was your name on the envelope?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” answered Perkins, brightening at the suggestion!\n\u003cbr\u003e \n\u003cbr\u003e “It is too much to hope the boy will return them to you.”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know about that. He looked honest. He is a boy in whom I should have considerable confidence,” said the merchant, slowly.\n\u003cbr\u003e \n\u003cbr\u003e Darrell shook his head.\n\u003cbr\u003e \n\u003cbr\u003e “Your only hope is to offer a liberal reward. I advise you to insert an advertisement in the papers offering a reward of—say five hundred dollars.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll do it.”\n\u003cbr\u003e \n\u003cbr\u003e Mr. Perkins seized a pen, and proceeded to draw up such an advertisement as his friend had suggested, when the door of the office opened, and Tom walked quietly into the room.\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Perkins,” said he, “I have found something which belongs to you.”\n\u003cbr\u003e \n\u003cbr\u003e The merchant looked up. No sooner did he see and100 recognize Tom than he sprang vivaciously from his chair.\n\u003cbr\u003e \n\u003cbr\u003e “Did you find the papers?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e “Here they are, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “There, Darrell, what did I tell you?” he demanded, triumphantly. “Didn’t I say the boy would prove honest?”\n\u003cbr\u003e \n\u003cbr\u003e “One case in a hundred.”\n\u003cbr\u003e \n\u003cbr\u003e “I hope you didn’t think I would keep the papers after you had been so kind as to give me the overcoat!” said Tom, hastily. “I am not so mean as that. I would have come sooner, but it was only about fifteen minutes ago that I found the package.”\n\u003cbr\u003e \n\u003cbr\u003e Mr. Perkins nodded his head in vigorous approval.\n\u003cbr\u003e \n\u003cbr\u003e “Do you hear that, Darrell?” he asked. “Did you know the value of these papers?” he asked of Tom.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, sir; a gentleman of my acquaintance told me they were worth about ten thousand dollars.”\n\u003cbr\u003e \n\u003cbr\u003e “Very correct. Do you know what I was about to do when you came in?”\n\u003cbr\u003e \n\u003cbr\u003e “No, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “I had just discovered my loss. I was writing an advertisement offering a reward of five hundred dollars if you would bring them back.”\n\u003cbr\u003e \n\u003cbr\u003e “I hope you don’t think I needed a reward for doing my duty.”\n\u003cbr\u003e \n\u003cbr\u003e “Some boys would.”\n\u003cbr\u003e \n\u003cbr\u003e “I am not one of that kind,” said Tom, proudly.\n\u003cbr\u003e \n\u003cbr\u003e “I am now willing to pay you that reward. You have relieved my mind of a great load.”\n\u003cbr\u003e \n\u003cbr\u003e 101 “I will not accept a dollar, sir,” said Tom, firmly.\n\u003cbr\u003e \n\u003cbr\u003e “Yet I judge that you are a poor boy?”\n\u003cbr\u003e \n\u003cbr\u003e “Poor, but honest.”\n\u003cbr\u003e \n\u003cbr\u003e “Where do you live?”\n\u003cbr\u003e \n\u003cbr\u003e “In Wilton, about thirty miles from the city.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you want a place?”\n\u003cbr\u003e \n\u003cbr\u003e “This morning I should have said yes. Now, I think I have other plans.”\n\u003cbr\u003e \n\u003cbr\u003e “What are they?”\n\u003cbr\u003e \n\u003cbr\u003e As briefly as he could, Tom explained what he intended to do.\n\u003cbr\u003e \n\u003cbr\u003e Samuel Perkins listened with attentive interest.\n\u003cbr\u003e \n\u003cbr\u003e “How soon do you propose to start for California?” he asked.\n\u003cbr\u003e \n\u003cbr\u003e Tom answered that he should try to get away in a few days, if he found that his mother had no objection.\n\u003cbr\u003e \n\u003cbr\u003e “Before you start, come to me; I may have a business commission for you.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well, sir. Now, if you will excuse me, I will go. I want to catch the next train for Wilton.”\n\u003cbr\u003e \n\u003cbr\u003e “A moment. What is your name?”\n\u003cbr\u003e \n\u003cbr\u003e “Thomas Thatcher.”\n\u003cbr\u003e \n\u003cbr\u003e “I will remember it. Good-by, and good luck to you.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s a boy of sterling merit,” said Perkins. “If he does not go to California I will give him a good place.”\n\u003cbr\u003e \n\u003cbr\u003e “If you have no place for him, I will engage him. It is not every boy who would so resolutely refuse five hundred dollars.”\n\u003cbr\u003e \n\u003cbr\u003e 102 “You are right there.”\n\u003cbr\u003e \n\u003cbr\u003e As for Tom, it did not strike him that he had done anything especially worthy of commendation in rejecting the reward which Mr. Perkins offered him. He had been so strictly trained in honesty that it had not occurred to him as possible that he could act in any other way than to return the papers. But for the unexpected good fortune which had come to him from another quarter, he would have accepted gratefully the offer of a place in Mr. Perkins’ establishment. As it was, he felt it his duty to go to California, and clear up, if he could, the mystery of his father’s fate.\n\u003cbr\u003e \n\u003cbr\u003e When he entered the yard of his humble home, Tillie espied him from the window, and her sharp young eyes instantly took notice of the overcoat.\n\u003cbr\u003e \n\u003cbr\u003e “Where could he have got it?” thought his mother.\n\u003cbr\u003e \n\u003cbr\u003e Tillie was asking that question of Tom himself a minute afterward.\n\u003cbr\u003e \n\u003cbr\u003e “Girls are always curious,” he answered, good-humoredly. “I picked it off a bush.”\n\u003cbr\u003e \n\u003cbr\u003e “Now, Tom, don’t tease me so.”\n\u003cbr\u003e \n\u003cbr\u003e “A gentleman made me a present of it.”\n\u003cbr\u003e \n\u003cbr\u003e “I wish he’d give me a cloak, then.”\n\u003cbr\u003e \n\u003cbr\u003e “You and mother shall both have cloaks, and dresses, too,” answered Tom, cheerfully.\n\u003cbr\u003e \n\u003cbr\u003e “You speak as if you had come into a fortune, Tom,” said his mother.\n\u003cbr\u003e \n\u003cbr\u003e “I have been very lucky to-day. I will tell you all about it presently.”\n\u003cbr\u003e \n\u003cbr\u003e Tom preferred to say what he had to his mother alone, as his sister was too young to be trusted with a secret.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2060/58627.html","bookId":568,"creation":"Aug 5, 2019 4:56:18 AM","modification":"Aug 5, 2019 4:56:18 AM"}
