{"id":33469,"no":30,"title":"CHAPTER XXX. THE MAN WITHOUT A SCALP.","content":"THIS WAS what Tom saw on looking behind him:\n\u003cbr\u003e \n\u003cbr\u003e A very tall man, bestriding a raw-boned horse, who looked as if, like Dr. Tanner, he had just emerged from a forty days’ fast.\n\u003cbr\u003e \n\u003cbr\u003e The man was very nearly as thin as the horse, with a long face, set off, but scarcely adorned, by a rough, red beard. He was attired in a suit of rusty black, and looked not unlike a wandering missionary.\n\u003cbr\u003e \n\u003cbr\u003e “He’s tryin’ to catch up with us, Tom,” said Mr. Brush. “Suppose we halt and give him a better show.”\n\u003cbr\u003e \n\u003cbr\u003e Tom had no objections. In their lonely journey it was rather agreeable to meet a new acquaintance, however unprepossessing he might appear.\n\u003cbr\u003e \n\u003cbr\u003e “Good morning, fellow pilgrims,” said the new-comer, as he came up abreast of our two friends.\n\u003cbr\u003e \n\u003cbr\u003e “Good mornin’ yourself,” said Brush. “What’s the news?”\n\u003cbr\u003e \n\u003cbr\u003e “Just what I would like to know,” said the other. “I haven’t heard a word from civilization for weeks. Whom have I the honor of addressing?”\n\u003cbr\u003e \n\u003cbr\u003e “My name is Peter Brush, at your service. This boy is my friend, Tom Thatcher. We are on our way to Californy, and we may get there if we don’t run a-foul164 of any murderous Indians. I ain’t quite ready to part with my scalp yet, so I hope they’ll keep away.”\n\u003cbr\u003e \n\u003cbr\u003e “It’s very painful, being scalped,” said the new arrival, meditatively.\n\u003cbr\u003e \n\u003cbr\u003e “I reckon so.”\n\u003cbr\u003e \n\u003cbr\u003e “I know it. For I had that little operation performed on me.”\n\u003cbr\u003e \n\u003cbr\u003e Peter Brush drew in his horse, and stared at the stranger in profound surprise.\n\u003cbr\u003e \n\u003cbr\u003e “What was that you were sayin’?” he ejaculated.\n\u003cbr\u003e \n\u003cbr\u003e “I’ve been scalped myself, and I know how it seems.”\n\u003cbr\u003e \n\u003cbr\u003e “Stranger——”\n\u003cbr\u003e \n\u003cbr\u003e “Lycurgus B. Spooner, M.D. That is my name and title.”\n\u003cbr\u003e \n\u003cbr\u003e “Then Mr. Spooner—or, Dr. Spooner—won’t you oblige me by removin’ your hat?”\n\u003cbr\u003e \n\u003cbr\u003e Dr. Spooner did so, and displayed a thick mass of red hair.\n\u003cbr\u003e \n\u003cbr\u003e “I don’t see any signs of scalpin’,” said Mr. Brush, puzzled.\n\u003cbr\u003e \n\u003cbr\u003e The doctor removed his wig, and displayed the marks of the unpleasant surgical operation to which he had been subjected by the Indians.\n\u003cbr\u003e \n\u003cbr\u003e “How was it you didn’t die?” asked Tom.\n\u003cbr\u003e \n\u003cbr\u003e “The confounded redskins thought I was dead, and left me lying on the prairie. But I wasn’t so far gone as they supposed. After awhile I came to, and a party of travelers coming up, took care of me. I recovered after a time, and tried to make up for my loss by a wig.”\n\u003cbr\u003e \n\u003cbr\u003e 165\n\u003cbr\u003e \n\u003cbr\u003e “How long ago was that?”\n\u003cbr\u003e \n\u003cbr\u003e “Four years.”\n\u003cbr\u003e \n\u003cbr\u003e “And how do you get along without a scalp?” asked Peter Brush, curiously.\n\u003cbr\u003e \n\u003cbr\u003e “Don’t miss it,” answered Spooner, laconically. “I used to have headaches, but now I never have ’em.”\n\u003cbr\u003e \n\u003cbr\u003e “And you think it’s on account of the scalpin’?”\n\u003cbr\u003e \n\u003cbr\u003e “I shouldn’t be surprised.”\n\u003cbr\u003e \n\u003cbr\u003e “I sometimes have headaches myself, but I don’t care about curin’ ’em that way.”\n\u003cbr\u003e \n\u003cbr\u003e Tom laughed.\n\u003cbr\u003e \n\u003cbr\u003e “I agree with you, Mr. Brush.”\n\u003cbr\u003e \n\u003cbr\u003e “If you have a fancy for being scalped,” said Dr. Spooner, “it is very possible that an opportunity may be afforded you before long.”\n\u003cbr\u003e \n\u003cbr\u003e Tom was naturally startled, and none the less because the doctor’s declaration was made in the coolest and most indifferent manner.\n\u003cbr\u003e \n\u003cbr\u003e “What do you mean?” asked Peter Brush, hurriedly.\n\u003cbr\u003e \n\u003cbr\u003e “Look at that, and you won’t need to ask.”\n\u003cbr\u003e \n\u003cbr\u003e With his whip-handle he pointed to the left. There, at only a few rods distance, was a sight which made Tom’s blood run cold in his veins.\n\u003cbr\u003e \n\u003cbr\u003e Stiff and stark lay the bodies of two emigrants, with their scalps removed, evidently the victims of a ruthless band of savages.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2060/58641.html","bookId":568,"creation":"Aug 5, 2019 4:56:18 AM","modification":"Aug 5, 2019 4:56:18 AM"}
