{"id":33475,"no":36,"title":"CHAPTER XXXVI. TOM’S DEADLY PERIL.","content":"THE THREE captives, on awakening, regarded their captors with looks of anxiety. They tried to read their fate in those dusky faces, but in vain.\n\u003cbr\u003e \n\u003cbr\u003e There was a little conversation between the chief and an elderly Indian, who proved to be an interpreter, having a fair knowledge of the English language for an Indian, and then the latter approached our three friends.\n\u003cbr\u003e \n\u003cbr\u003e He singled out Dr. Spooner as the supposed head of the party, and to him addressed himself.\n\u003cbr\u003e \n\u003cbr\u003e “White man,” he said, “the chief bids me tell you your fate.”\n\u003cbr\u003e \n\u003cbr\u003e It need hardly be said that he had attentive listeners.\n\u003cbr\u003e \n\u003cbr\u003e “You and you,” pointing out Brush, “may go, but your horses and guns remain with us.”\n\u003cbr\u003e \n\u003cbr\u003e “I am very much obliged to you, colonel,” said Peter Brush, greatly relieved. “You’re welcome to the horse and rifle, and my friend, the doctor, will no doubt say the same. How soon can we go?”\n\u003cbr\u003e \n\u003cbr\u003e “At once. You shall be unbound, and free to keep on your way to the great waters.”\n\u003cbr\u003e \n\u003cbr\u003e “And the boy may go, too?” said the doctor, who was more cool and self-possessed than Mr. Brush, and had187 at once noted the omission to include Tom in the proposed release.\n\u003cbr\u003e \n\u003cbr\u003e “Of course! Didn’t he say Tom, too?” said Peter Brush, hastily.\n\u003cbr\u003e \n\u003cbr\u003e “The boy must stay!” said the Indian interpreter, gravely.\n\u003cbr\u003e \n\u003cbr\u003e “But why must he stay? He is under my care. I can’t go without him?” said Brush, eagerly.\n\u003cbr\u003e \n\u003cbr\u003e “White boy must stay!” repeated the Indian.\n\u003cbr\u003e \n\u003cbr\u003e “What do you propose to do with him?” asked Dr. Spooner, uneasily.\n\u003cbr\u003e \n\u003cbr\u003e The Indian continued:\n\u003cbr\u003e \n\u003cbr\u003e “For more than a moon the young chief has been sick and weak. A bad spirit has entered into him and torments him.”\n\u003cbr\u003e \n\u003cbr\u003e “But what has all this to do with Tom?” asked Brush, impatiently.\n\u003cbr\u003e \n\u003cbr\u003e “Let him tell his story in his own way, friend Brush,” said the doctor. “We shall know soon enough.”\n\u003cbr\u003e \n\u003cbr\u003e The interpreter continued:\n\u003cbr\u003e \n\u003cbr\u003e “The Great Spirit is vexed. He has sent one of the bad spirits to trouble Miantonimo. He must be appealed.”\n\u003cbr\u003e \n\u003cbr\u003e “But what has that to do with Tom?” asked Peter Brush, again.\n\u003cbr\u003e \n\u003cbr\u003e “Hush!” said Lycurgus Spooner.\n\u003cbr\u003e \n\u003cbr\u003e “He has revealed it to his children that Miantonimo will not get well till a white boy has been sacrificed in his stead.”\n\u003cbr\u003e \n\u003cbr\u003e 188\n\u003cbr\u003e \n\u003cbr\u003e A look of anxiety and horror swept over the face of Dr. Spooner. Peter Brush did not seem to catch the meaning of the last words.\n\u003cbr\u003e \n\u003cbr\u003e “Surely,” said Lycurgus, “you would not kill an innocent boy?”\n\u003cbr\u003e \n\u003cbr\u003e “The Great Spirit has said it,” said the Indian, gravely.\n\u003cbr\u003e \n\u003cbr\u003e “Kill Tom!” ejaculated Peter Brush, horror-stricken. “He don’t mean that, does he, doctor?”\n\u003cbr\u003e \n\u003cbr\u003e “The boy must die!” said the interpreter.\n\u003cbr\u003e \n\u003cbr\u003e “Then you may kill me, too, you bloody butcher!” exclaimed Peter Brush, tugging fiercely at his fettered hands.\n\u003cbr\u003e \n\u003cbr\u003e “Calm yourself, friend Brush,” said Lycurgus Spooner. “Let me speak with the Indians. Perhaps I can convince them of their folly.”\n\u003cbr\u003e \n\u003cbr\u003e “I’d like to argy the point myself,” said Peter.\n\u003cbr\u003e \n\u003cbr\u003e Of course, Tom had heard all this, and the thought of the fate which seemed inevitable blanched his cheek and sent a cold chill to his heart.\n\u003cbr\u003e \n\u003cbr\u003e What! at the age of sixteen must he die a violent death, because a young Indian boy was sick, a victim to the cruel superstition of a band of savages?\n\u003cbr\u003e \n\u003cbr\u003e “God help me!” he murmured, with pale lips. “For the sake of my dear mother and sister, save me from this fearful fate!”\n\u003cbr\u003e \n\u003cbr\u003e “This is terrible!” ejaculated Peter Brush, while in his excitement the big drops of perspiration gathered on his brow. “Kill me, Mr. Indian, and let the boy live. He is young, and his life is worth more than mine.”\n\u003cbr\u003e \n\u003cbr\u003e 189 “No good!” said the Indian. “A boy is sick. A boy must die.”\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Brush,” said Tom gratefully, “I will never forget this unselfish offer. You have offered your life for mine. You are a true friend.”\n\u003cbr\u003e \n\u003cbr\u003e “But the brutes won’t accept my offer,” said Peter Brush, bitterly. “They are bound to shed your innocent blood, my poor boy. If I only had my revolver here, and loaded, I would kill some of them, or my name isn’t Peter Brush.”\n\u003cbr\u003e \n\u003cbr\u003e “Be careful what you say, or they will kill you, too,” said Tom, in a warning voice.\n\u003cbr\u003e \n\u003cbr\u003e The interpreter stood aside. At a signal from the chief, two men advanced toward Tom. They took him up in their arms, and carried him to a young tree, of slender trunk, and deftly bound him with his back to the tree, facing toward the group.\n\u003cbr\u003e \n\u003cbr\u003e “Are they going to kill Tom before our very eyes?” said Peter Brush, in a tone of horror.\n\u003cbr\u003e \n\u003cbr\u003e “It is indeed terrible!” said Lycurgus Spooner, in a state of agitation almost as great.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, Tom, Tom, I wish I’d left you with that swindling Jim Dobson. He would only have robbed you, while I have led you to your death.”\n\u003cbr\u003e \n\u003cbr\u003e “You couldn’t help it, Mr. Brush,” said Tom, his lips quivering. “It is hard, but I’ll try to meet it.”\n\u003cbr\u003e \n\u003cbr\u003e “You thought God was going to help you!” exclaimed Brush, bitterly.\n\u003cbr\u003e \n\u003cbr\u003e “It is not too late yet. He may save me yet. But Mr. Brush, I have a favor to ask of you.”\n\u003cbr\u003e \n\u003cbr\u003e 190 “What is it? I will do anything in my power, Tom.”\n\u003cbr\u003e \n\u003cbr\u003e “And I too, my poor lad,” said Dr. Spooner.\n\u003cbr\u003e \n\u003cbr\u003e “Write to my mother, and let her know that I am dead, but don’t let her know how I died. Let her think that I caught cold and died of a fever. She won’t feel so bad. There’s some money that I have in the —— bank, in New York. Let her know about that. They will give it to her, if she calls for it.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, Tom, I will do it,” said Peter Brush, stifling a sob—“that is, if I live. I don’t think I can stand it to see those red devils kill you.”\n\u003cbr\u003e \n\u003cbr\u003e While this conversation was going on the Indians remained quiet. Probably they understood that Tom was giving to his two friends the last messages he was ever to deliver, and a sense of propriety, possibly a feeling of sympathy, would not permit them to interfere.\n\u003cbr\u003e \n\u003cbr\u003e For it must be remembered that they were about to kill Tom from no feeling of hostility, but merely because in their superstition they thought God required a sacrifice, and would in return restore the young chief to health.\n\u003cbr\u003e \n\u003cbr\u003e Poor Tom! his fate seemed sealed. The Indian chief, who on account of his relationship was considered the fitting instrument for accomplishing the sacrifice, took his stand at the distance of a hundred feet from the tree to which Tom was bound, and raised his rifle.\n\u003cbr\u003e \n\u003cbr\u003e Tom closed his eyes, and with an unspoken prayer, commended his soul to God, when a most surprising incident startled all who were looking on.\n\u003cbr\u003e \n\u003cbr\u003e 191 The Indian boy rose suddenly to his feet, flung off the blanket in which he was wrapped, and rushing to the tree, flung his arms around Tom, with a loud cry.\n\u003cbr\u003e \n\u003cbr\u003e His father dropped the rifle with which he was about to act the part of executioner, and gazed as if spell-bound upon the two boys.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2060/58647.html","bookId":568,"creation":"Aug 5, 2019 4:56:18 AM","modification":"Aug 5, 2019 4:56:18 AM"}
