{"id":33484,"no":45,"title":"CHAPTER XLV. HOW THINGS WENT ON AT HOME.","content":"WE GO back to the time of Tom’s leaving home.\n\u003cbr\u003e \n\u003cbr\u003e His departure from Wilton excited considerable surprise, more especially as people could not find out where he had gone. Many were the inquiries made of Mrs. Thatcher, but she answered as Tom had requested her, “Tom has gone West.”\n\u003cbr\u003e \n\u003cbr\u003e “Indeed, has he gone far West?”\n\u003cbr\u003e \n\u003cbr\u003e “I can’t tell you precisely how far West he has gone,” answered Mrs. Thatcher, smiling.\n\u003cbr\u003e \n\u003cbr\u003e “Will he be gone long?”\n\u003cbr\u003e \n\u003cbr\u003e “That depends on how successful he is in his business.”\n\u003cbr\u003e \n\u003cbr\u003e “I suppose he has taken some agency?” remarked Miss Woodward (an inquiring old maid).\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Thatcher said neither yes nor no, but somehow Miss Woodward got the idea that she said yes, and so reported throughout the village.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Thatcher and Tillie moved to the comfortable farm-house of Mr. Hiram Bacon, as had been arranged before Tom went away, and this made Tom’s departure a little less mysterious, since he was leaving his mother and sister in a good home.\n\u003cbr\u003e \n\u003cbr\u003e Still there was considerable curiosity felt, and there234 seemed a chance of finding out something when Tom wrote home.\n\u003cbr\u003e \n\u003cbr\u003e “Have you heard from Tom yet?” asked the indefatigable Miss Woodward, a little later.\n\u003cbr\u003e \n\u003cbr\u003e “Where did he write from?” asked the old maid, eagerly.\n\u003cbr\u003e \n\u003cbr\u003e “From St. Louis,” answered our hero’s mother, with a little hesitation.\n\u003cbr\u003e \n\u003cbr\u003e “Ah! St. Louis is a good way off. Is he going any further?”\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps so.”\n\u003cbr\u003e \n\u003cbr\u003e Another letter came to Mrs. Thatcher from St. Joseph, announcing that Tom was going across the plains, and that it might be a good while before he would be able to write again.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Thatcher did not mention this second letter, but the postmaster noticed the postmark, and through him it became known.\n\u003cbr\u003e \n\u003cbr\u003e Among those who heard of it was John Simpson. Rupert had picked up the news somewhere in the village.\n\u003cbr\u003e \n\u003cbr\u003e “St. Joseph!” exclaimed Mr. Simpson, startled. “Why, it looks as if the boy was on his way to California.”\n\u003cbr\u003e \n\u003cbr\u003e “How could he go to California?” said Rupert, rather enviously. “Doesn’t it cost a good deal of money?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “He’s as poor as poverty.”\n\u003cbr\u003e \n\u003cbr\u003e “True; but he has found money enough to go to St. Joseph, and that is no trifle.”\n\u003cbr\u003e \n\u003cbr\u003e 235\n\u003cbr\u003e \n\u003cbr\u003e Mr. Simpson felt uneasy. Was it because he feared that the ghastly mystery connected with Rocky Gulch would be unearthed, and his reputation blasted. At any rate, he decided to see Mrs. Thatcher himself, and find out what he could.\n\u003cbr\u003e \n\u003cbr\u003e He did not call at the new home of the widow of his old partner, but chanced one day to meet her in the street.\n\u003cbr\u003e \n\u003cbr\u003e “Good-morning, Mrs. Thatcher,” said the squire, affably.\n\u003cbr\u003e \n\u003cbr\u003e “Good-morning, sir,” responded Mrs. Thatcher, coldly.\n\u003cbr\u003e \n\u003cbr\u003e “I hear your son is away. You must miss him.”\n\u003cbr\u003e \n\u003cbr\u003e “I do miss him, Mr. Simpson.”\n\u003cbr\u003e \n\u003cbr\u003e “Has he gone far?”\n\u003cbr\u003e \n\u003cbr\u003e “He has gone to the West.”\n\u003cbr\u003e \n\u003cbr\u003e “Far West?”\n\u003cbr\u003e \n\u003cbr\u003e “I have not heard from him lately.”\n\u003cbr\u003e \n\u003cbr\u003e “Ha! There is something she wishes to conceal,” thought John Simpson.\n\u003cbr\u003e \n\u003cbr\u003e “I am afraid he won’t get back the money his traveling expenses must cost him.”\n\u003cbr\u003e \n\u003cbr\u003e “He was obliged to do something, Mr. Simpson. There was no chance left for him in Wilton.”\n\u003cbr\u003e \n\u003cbr\u003e “When you write to him, tell him that I will give him back his old place if he sees fit to come back.”\n\u003cbr\u003e \n\u003cbr\u003e “I will tell him,” said Mrs. Thatcher, but she expressed no gratitude, for she felt none.\n\u003cbr\u003e \n\u003cbr\u003e Why did John Simpson make this offer? Because he wanted to keep Tom away from California. After so236 many years, there seemed little enough chance of the boy’s learning anything of the circumstances attending his father’s fate, but a guilty conscience makes men cowards, and John Simpson was troubled with an uneasy idea that some time, in some way to him unknown his crime might be made known.\n\u003cbr\u003e \n\u003cbr\u003e There was another circumstance that puzzled him. How did Tom Thatcher obtain the necessary funds for so expensive a journey? Probably, he said to himself, Mrs. Thatcher had mortgaged her house, and given Tom the money. He determined to find out if he could.\n\u003cbr\u003e \n\u003cbr\u003e “You must excuse what I am about to say, Mrs. Thatcher,” he began, clearing his throat to begin with, “but I am afraid you did a foolish thing in raising money on your place to pay the expenses of such a wild-goose chase.”\n\u003cbr\u003e \n\u003cbr\u003e “Who told you I had mortgaged my place, Mr. Simpson?” demanded the widow, looking the rich man full in the face.\n\u003cbr\u003e \n\u003cbr\u003e “Why, no one,” stammered the squire, taken aback by her directness, “but I of course inferred it, knowing that Tom had no money of his own.”\n\u003cbr\u003e \n\u003cbr\u003e “Then you inferred a mistake,” said Mrs. Thatcher. “The place is not mortgaged.”\n\u003cbr\u003e \n\u003cbr\u003e “You don’t say so!” said Simpson, more than ever bewildered.\n\u003cbr\u003e \n\u003cbr\u003e “I do not propose to mortgage my place at present.”\n\u003cbr\u003e \n\u003cbr\u003e “When you do,” said Simpson, recovering himself, “come to me. I will do as well by you as any one.”\n\u003cbr\u003e \n\u003cbr\u003e It would indeed have suited him to obtain a lien upon237 Mrs. Thatcher’s humble homestead, that he might have her in his power.\n\u003cbr\u003e \n\u003cbr\u003e She neither said yes nor no, but “I will bear in mind your offer, Mr. Simpson.”\n\u003cbr\u003e \n\u003cbr\u003e He walked slowly away, puzzling over the problem of where Tom obtained his money. Was there some one behind who backed him? Was there some one who had sent him to California, and, if so, why? He must know whether Tom had gone there.\n\u003cbr\u003e \n\u003cbr\u003e Now, the postmaster had obtained his office through Mr. Simpson’s influence, and was therefore likely to do him a favor.\n\u003cbr\u003e \n\u003cbr\u003e “Mr. Jackson,” he said, when alone with that functionary, “does Mrs. Thatcher write to her son Tom?”\n\u003cbr\u003e \n\u003cbr\u003e “I haven’t noticed any letter, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “When she brings one, please notice the address, and let me know it. I am afraid the boy will spend all his mother’s property if no one interferes. I want to write to him to come back. I will give him employment.”\n\u003cbr\u003e \n\u003cbr\u003e “Very kind of you, sir,” said the postmaster, obsequiously.\n\u003cbr\u003e \n\u003cbr\u003e “He is the son of my old associate,” said John Simpson, with an assumption of generosity, “and I naturally feel an interest in him and his mother.”\n\u003cbr\u003e \n\u003cbr\u003e But for weeks Mrs. Thatcher brought no letters to the office. Tom was on the plains, and she knew not where to address him.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2060/58656.html","bookId":568,"creation":"Aug 5, 2019 4:56:18 AM","modification":"Aug 5, 2019 4:56:18 AM"}
