{"id":33485,"no":46,"title":"CHAPTER XLVI. MRS. THATCHER LOSES HER NEW HOME.","content":"ONE DAY, about four months after Tom’s departure, John Simpson sat at his writing-desk, busy about some accounts, when Rupert entered the room in visible excitement.\n\u003cbr\u003e \n\u003cbr\u003e “Father,” he said, “what do you think? Hiram Bacon died last night.”\n\u003cbr\u003e \n\u003cbr\u003e In a village like Wilton the death of a well-known citizen, especially if it is sudden, creates excitement.\n\u003cbr\u003e \n\u003cbr\u003e “You must be mistaken, Rupert,” said his father. “I saw Mr. Bacon no later than yesterday afternoon in the post-office.”\n\u003cbr\u003e \n\u003cbr\u003e “He’s dead now,” persisted Rupert. “He was found dead in bed this morning. The doctor says he died of heart disease.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s very sudden,” said John Simpson, no longer incredulous. “I can hardly believe it.”\n\u003cbr\u003e \n\u003cbr\u003e “I wonder where Tom Thatcher’s mother will live now,” continued Rupert.\n\u003cbr\u003e \n\u003cbr\u003e “I didn’t think of that,” said his father, his face lighting up with satisfaction. “To be sure, it will be a great loss to her. She will lose a comfortable living.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m glad of it,” said Rupert.\n\u003cbr\u003e \n\u003cbr\u003e “Rupert, Rupert, don’t rejoice over the misfortunes of your neighbors,” but he spoke very mildly.\n\u003cbr\u003e \n\u003cbr\u003e 239\n\u003cbr\u003e \n\u003cbr\u003e “I can’t help it father. I hate Tom Thatcher and all his relations.”\n\u003cbr\u003e \n\u003cbr\u003e “You shouldn’t hate anybody, my son,” said Mr. Simpson; but his rebuke was very light.\n\u003cbr\u003e \n\u003cbr\u003e “Don’t you hate anybody, father?”\n\u003cbr\u003e \n\u003cbr\u003e “Ahem! not that I am aware of, my son.”\n\u003cbr\u003e \n\u003cbr\u003e But when Rupert had left the room Mr. Simpson’s face betrayed his satisfaction.\n\u003cbr\u003e \n\u003cbr\u003e “You won’t be quite so independent now, Mrs. Thatcher, I am thinking,” he soliloquized. “You’ll have a hard time getting along now. You’ll have to mortgage your place after all, and I will be on hand to advance the money. You won’t get any help from that vagabond son of yours. I shall live to see you all in the poor-house.”\n\u003cbr\u003e \n\u003cbr\u003e There did not seem to be much difference between Rupert and the father who had just been preaching charity to him, but Mr. Simpson never quite removed the mask which concealed his real character, even in the presence of his own son, who, nevertheless, understood him better than the father suspected.\n\u003cbr\u003e \n\u003cbr\u003e Yet weeks and even months passed, and Mrs. Thatcher did not appear to stand in need of money, nor, so far as John Simpson could find out, did she make any effort to mortgage her place. He did not know what the reader is already aware of—that she was living on the hundred dollars which Tom had left with her, added to the scanty amount which she was able to earn with her needle.\n\u003cbr\u003e \n\u003cbr\u003e But though she still was able to live day by day, her240 face became more sad and anxious. She was famishing for news from Tom, yet no letter came from him. She knew, of course, that there would be a difficulty about writing when he was on the plains, but making all allowances for that, the time had come when she might expect to hear something. She could not know that at that very moment he was in captivity with the Indians, and if it had been made known to her it would only have increased her anxieties.\n\u003cbr\u003e \n\u003cbr\u003e In her trouble the minister, Rev. Mr. Julian, was a friend and comforter. With him she shared her anxieties, and he said what he could to relieve her anxiety, though he, too, began to feel that something might have happened to his friend’s son.\n\u003cbr\u003e \n\u003cbr\u003e “Don’t get discouraged, my dear friend,” said the minister. “It is a long and wearisome journey across the plains. I believe Tom is quite safe, and that you will soon receive tidings from him.”\n\u003cbr\u003e \n\u003cbr\u003e “I wish I could feel so,” said Mrs. Thatcher, sadly. “Mr. Julian, he is my only boy. I have Tillie, but my hopes rested with him. I looked to Tom to be the prop of my old age. Without him my life will be worth nothing.”\n\u003cbr\u003e \n\u003cbr\u003e “Don’t say that, Mrs. Thatcher. You will still have your daughter to live for. But don’t give up Tom. He is a manly boy, and will come back to you well and prosperous, if God wills.”\n\u003cbr\u003e \n\u003cbr\u003e “But if he is well why doesn’t he write? He is not a boy to give me unnecessary anxiety by neglect.”\n\u003cbr\u003e \n\u003cbr\u003e “I can’t explain that, but I can easily believe that the western mails are irregular.”\n\u003cbr\u003e \n\u003cbr\u003e 241 This thought gave Mrs. Thatcher courage for a time, but soon another cause of anxiety presented itself. When at Mr. Bacon’s, she had drawn upon her reserve fund of money more freely because she thought her position a permanent one. When she unexpectedly lost it this fund had considerably diminished.\n\u003cbr\u003e \n\u003cbr\u003e She found herself at length with but five dollars left, and the thought forced itself upon her that she must mortgage her little place. Just at this juncture she received a call from John Simpson.\n\u003cbr\u003e \n\u003cbr\u003e “Have you heard anything from Tom?” asked the manufacturer blandly, as he took a seat in Mrs. Thatcher’s little sitting-room.\n\u003cbr\u003e \n\u003cbr\u003e “No, Mr. Simpson,” answered the widow, with a spasm of pain.\n\u003cbr\u003e \n\u003cbr\u003e “Isn’t that rather strange?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, Mr. Simpson, you don’t know how anxious I am about him,” said the poor mother, sadly.\n\u003cbr\u003e \n\u003cbr\u003e “Very natural, but I always thought it was unwise to let him go so far away. Don’t you think so yourself?”\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps you are right, but I acted for the best. Then there was nothing for Tom to do here. You had dismissed him from the shop.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, I know, but I would have taken him back again after awhile.”\n\u003cbr\u003e \n\u003cbr\u003e “Why didn’t you tell him so. Then he would have been here now.”\n\u003cbr\u003e \n\u003cbr\u003e “Things may turn out for the best after all, Mrs. Thatcher,” said Mr. Simpson, evading a direct reply.242 “Meanwhile, I came in to see if there was any way in which I could help you.”\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Thatcher looked surprised. John Simpson was about the last person from whom she would have expected an offer of assistance.\n\u003cbr\u003e \n\u003cbr\u003e “In what way?” she asked.\n\u003cbr\u003e \n\u003cbr\u003e “I was thinking you might want to raise money on the place,” suggested Simpson, blandly.\n\u003cbr\u003e \n\u003cbr\u003e “I do need money,” said the widow, hesitatingly.\n\u003cbr\u003e \n\u003cbr\u003e “Of course you do; you couldn’t well help it,” said the manufacturer briskly. “Now I have come here prepared to make you an offer.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, sir?” said Mrs. Thatcher, inquiringly.\n\u003cbr\u003e \n\u003cbr\u003e “I will lend you four hundred dollars at six per cent. interest, and take a mortgage on the house and lot.”\n\u003cbr\u003e \n\u003cbr\u003e “That is less than half the value of the place,” said the widow.\n\u003cbr\u003e \n\u003cbr\u003e “What can you be thinking of, Mrs. Thatcher? Pray at what sum do you value this property?”\n\u003cbr\u003e \n\u003cbr\u003e “It ought to be worth a thousand dollars.”\n\u003cbr\u003e \n\u003cbr\u003e John Simpson shook his head.\n\u003cbr\u003e \n\u003cbr\u003e “It wouldn’t bring over six hundred,” he said.\n\u003cbr\u003e \n\u003cbr\u003e “That can’t be possible,” said Mrs. Thatcher, anxiously.\n\u003cbr\u003e \n\u003cbr\u003e “It is not only possible, but true,” said the rich man, positively. “Property has depreciated dreadfully, dreadfully.”\n\u003cbr\u003e \n\u003cbr\u003e “Then I don’t know what is going to become of us if Tom doesn’t come back,” said Mrs. Thatcher, in a tone of discouragement.\n\u003cbr\u003e \n\u003cbr\u003e 243 “Oh, something will turn up,” said Simpson, carelessly. “Well, widow, about the mortgage, what do you say?”\n\u003cbr\u003e \n\u003cbr\u003e “I will consult Mr. Julian.”\n\u003cbr\u003e \n\u003cbr\u003e John Simpson frowned.\n\u003cbr\u003e \n\u003cbr\u003e “He is a minister. What does he know about business?”\n\u003cbr\u003e \n\u003cbr\u003e “He has business of his own to attend to. Besides, he is my friend.”\n\u003cbr\u003e \n\u003cbr\u003e “Better say the word now, widow. I may draw back from the agreement.”\n\u003cbr\u003e \n\u003cbr\u003e “Then I must apply to some one else. Even according to your own statement the place is worth six hundred dollars, and ought to command as large a mortgage anywhere.”\n\u003cbr\u003e \n\u003cbr\u003e “I said it wouldn’t fetch six hundred dollars.”\n\u003cbr\u003e \n\u003cbr\u003e “I will not take such an important step, Mr. Simpson, without consulting some one.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well,” said Simpson, displeased, “take your own way, but it will be at your own risk.”\n\u003cbr\u003e \n\u003cbr\u003e “Let it be so, then,” said Mrs. Thatcher, calmly, and John Simpson left her, foiled for the present, but confident that he would eventually carry his point.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2060/58657.html","bookId":568,"creation":"Aug 5, 2019 4:56:18 AM","modification":"Aug 5, 2019 4:56:18 AM"}
