{"id":33448,"no":9,"title":"CHAPTER IX. AN UNEXPECTED CHARGE.","content":"“MOTHER,” said Tom, the next morning when they met at the breakfast-table, “I have some bad news for you.”\n\u003cbr\u003e \n\u003cbr\u003e “Bad news!” repeated Mrs. Thatcher, turning pale. “What is it?”\n\u003cbr\u003e \n\u003cbr\u003e “Don’t let it trouble you too much, mother, for it doesn’t depress me.”\n\u003cbr\u003e \n\u003cbr\u003e “Don’t keep me any longer in suspense, Tom,” said his mother, anxiously. “Whatever it is, let me know it at once.”\n\u003cbr\u003e \n\u003cbr\u003e “Then,” said Tom, “I am out of work. Mr. Simpson has discharged me.”\n\u003cbr\u003e \n\u003cbr\u003e “What for? Is business slack?” inquired Mrs. Thatcher.\n\u003cbr\u003e \n\u003cbr\u003e “No, business is very good. The fact is, Mr. Simpson is angry with me.”\n\u003cbr\u003e \n\u003cbr\u003e “Have you given him any cause, my son?”\n\u003cbr\u003e \n\u003cbr\u003e “I will tell you all about it and let you judge. Last evening I called upon him and asked him questions about my father, and how much money he had when they parted in California.”\n\u003cbr\u003e \n\u003cbr\u003e “But, Tom, what good can all this do now?” said his mother.\n\u003cbr\u003e \n\u003cbr\u003e 56 “Perhaps none, mother; but you must admit that I have reason to feel interested in the fate of my poor father.”\n\u003cbr\u003e \n\u003cbr\u003e “How did Mr. Simpson receive you?”\n\u003cbr\u003e \n\u003cbr\u003e “Very coldly. Still he answered some of my questions. But when I spoke of the great change it would have made in our circumstances if father had lived, and brought home the money which even Squire Simpson admits that he had gained, he began to tell how much he had done for us.”\n\u003cbr\u003e \n\u003cbr\u003e “What has he ever done for us?” asked Mrs. Thatcher, wonderingly.\n\u003cbr\u003e \n\u003cbr\u003e “I will tell you in his own words—he has employed me in his shop. When he said that, I said that he had given me no more than any one else—even less than is paid in other shoe towns—he became angry, and told me that he would discharge me, and I would then have the chance of seeking higher wages somewhere else.”\n\u003cbr\u003e \n\u003cbr\u003e “Did he really mean it?” asked Mrs. Thatcher, in alarm.\n\u003cbr\u003e \n\u003cbr\u003e “Did he mean it, mother? If you had seen him and heard him, as I did, you wouldn’t have needed to ask that question. He meant it fast enough. Why, mother, I actually believe that he hates me.”\n\u003cbr\u003e \n\u003cbr\u003e “But why should he hate you? Why should any one hate you, my boy?”\n\u003cbr\u003e \n\u003cbr\u003e “I haven’t given any one a good cause for doing it. But all the same he hates me, and that is why he has discharged me. I am to go to the shop this morning and collect what is due me, and that will be the end of it.”\n\u003cbr\u003e \n\u003cbr\u003e 57 “Tom, I will go and see Mr. Simpson myself. I will ask him to take you back.”\n\u003cbr\u003e \n\u003cbr\u003e “No, mother,” said Tom, decidedly; “I am too proud to beg to be taken back.”\n\u003cbr\u003e \n\u003cbr\u003e “It won’t be you who ask it. It will be I.”\n\u003cbr\u003e \n\u003cbr\u003e “It would humble me all the same.”\n\u003cbr\u003e \n\u003cbr\u003e “But, Tom, we find it hard enough to live when you are at work. If you are out of work we shall starve.”\n\u003cbr\u003e \n\u003cbr\u003e “No, you won’t, mother. In one way or another I will manage to earn fifty cents a day, and I hope more. Now I am going to the shop to collect my money.”\n\u003cbr\u003e \n\u003cbr\u003e Tom went out, leaving his mother in low spirits. She was not so hopeful as he of his ability to make up the sum which he had lost by his discharge from the shop.\n\u003cbr\u003e \n\u003cbr\u003e In the shoe-shop Tom found plenty of sympathy. There was even a strong feeling of indignation excited against Mr. Simpson, for Tom Thatcher was a popular favorite. He collected his money—three day’s wages—and left the shop.\n\u003cbr\u003e \n\u003cbr\u003e On the way he met John Simpson. The boy would have avoided him, but the manufacturer called him by name.\n\u003cbr\u003e \n\u003cbr\u003e “Look here, you Tom Thatcher,” he said, “I have a word to say to you.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well, sir,” said Tom, proudly.\n\u003cbr\u003e \n\u003cbr\u003e “I know very well what you were up to last night.”\n\u003cbr\u003e \n\u003cbr\u003e “I was at your fire, if you mean that, sir.”\n\u003cbr\u003e \n\u003cbr\u003e “I believe,” said John Simpson, sternly, “that you were the incendiary.”\n\u003cbr\u003e \n\u003cbr\u003e Tom started, in uncontrollable surprise.\n\u003cbr\u003e \n\u003cbr\u003e 58 “I believe that you set the barn on fire in order to be revenged upon me for discharging you from my employment.”\n\u003cbr\u003e \n\u003cbr\u003e “Good Heavens, sir, what are you saying! You yourself attributed it to the man whom you let sleep in the barn.”\n\u003cbr\u003e \n\u003cbr\u003e “I only did it to screen you. I didn’t want the son of my old comrade to be suspected of such a crime. I am willing that the matter should stand so.”\n\u003cbr\u003e \n\u003cbr\u003e “But I am not,” said Tom, with spirit. “Your charge is a base falsehood. I can prove by my mother that I was fast asleep in my room for three hours before the fire. You know who set the fire better than I.”\n\u003cbr\u003e \n\u003cbr\u003e “What do you mean?” gasped the rich man, turning pale.\n\u003cbr\u003e \n\u003cbr\u003e “That I know absolutely nothing about it.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, that was all, was it?” returned Simpson, relieved, and he walked away.\n\u003cbr\u003e \n\u003cbr\u003e Tom looked after him, puzzled by his manner.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2060/58620.html","bookId":568,"creation":"Aug 5, 2019 4:56:18 AM","modification":"Aug 5, 2019 4:56:18 AM"}
