{"id":98321,"no":37,"title":"Page 37","content":"\u003cp\u003eI back away from it. Back away from the message it sends. Back all the way to the door while I keep the light shining on its glossy black barrel.\u003c/p\u003e\n\u003cp\u003eThen I turn and run smack into his rock-hard chest.\u003c/p\u003e\n\u003cp\u003e55\u003c/p\u003e\n\u003cp\u003e“CASSIE?” HE SAYS, grabbing my arms to keep me from falling straight back onto my butt. “What are you doing out here?” He glances over my shoulder into the barn.\u003c/p\u003e\n\u003cp\u003e“I thought I heard a noise.” Dumb! Now he might decide to investigate. But it’s the first thing that pops into my head. Blurting out first thoughts is something I really should work on—if I live past the next five minutes. My heart is pounding so hard, I can feel my ears ringing.\u003c/p\u003e\n\u003cp\u003e“You thought you…? Cassie, you shouldn’t come out here at night.”\u003c/p\u003e\n\u003cp\u003eI nod and force myself to look into his eyes. Evan Walker is a noticer. “I know, it was stupid. But you’d been gone a long time.”\u003c/p\u003e\n\u003cp\u003e“I was stalking some deer.” He’s a big, Evan-shaped shadow in front of me, a shadow with a high-powered rifle against the backdrop of a million suns.\u003c/p\u003e\n\u003cp\u003eI bet you were. “Let’s go inside, okay? I’m freezing to death.”\u003c/p\u003e\n\u003cp\u003eHe doesn’t move. He’s looking into the barn.\u003c/p\u003e\n\u003cp\u003e“I checked it out,” I say, trying to keep my voice steady. “Rats.”\u003c/p\u003e\n\u003cp\u003e“Rats?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Rats.”\u003c/p\u003e\n\u003cp\u003e“You heard rats? In the barn? From inside the house?”\u003c/p\u003e\n\u003cp\u003e“No. How could I hear rats from there?” An exasperated roll of the eyes would be good right about now. Not the nervous laugh that escapes instead. “I came out on the porch for some fresh air.”\u003c/p\u003e\n\u003cp\u003e“And you heard them from the porch?”\u003c/p\u003e\n\u003cp\u003e“They were very big rats.” Flirty smile! I whip out what I hope passes for one of those, then I hook my arm through his and pull him toward the house. It’s like trying to move a concrete pole. If he goes inside the barn and sees the exposed rifle, it’s over. Why the hell didn’t I cover up the rifle?\u003c/p\u003e\n\u003cp\u003e“Evan, it’s nothing. I got spooked, that’s all.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003eHe shoves the barn door closed, and we head back to the farmhouse, his arm draped protectively over my shoulders. He lets the arm fall when we reach the door.\u003c/p\u003e\n\u003cp\u003eNow, Cassie. Quick side step to the right, Luger from your waistband, proper two-handed grip, knees slightly bent, squeeze, don’t pull. Now.\u003c/p\u003e\n\u003cp\u003eWe step inside the warm kitchen. The opportunity passes.\u003c/p\u003e\n\u003cp\u003e“So I take it you didn’t bag any deer,” I say casually.\u003c/p\u003e\n\u003cp\u003e“No.” He leans the rifle against the wall, shrugs out of his coat. His cheeks are bright red from the cold.\u003c/p\u003e\n\u003cp\u003e“Maybe you shot at something else,” I say. “Maybe that’s what I heard.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “I didn’t shoot at anything.” He blows on his hands. I follow him into the great room, where he bends in front of the fireplace to warm his hands. I’m standing behind the sofa a few feet away.\u003c/p\u003e\n\u003cp\u003eMy second chance to take him down. Hitting him from this close would not be a challenge. Or it wouldn’t be if his head resembled an empty can of creamed corn, the only kind of target I was used to.\u003c/p\u003e\n\u003cp\u003eI pull the gun from my waistband.\u003c/p\u003e\n\u003cp\u003eFinding my rifle in his barn didn’t leave me with many options. It was like being under that car on the highway: hide or face. Doing nothing about it, pretending everything was fine between us, accomplished nothing. Shooting him in the back of the head would accomplish something—it would kill him—but after the Crucifix Soldier, it had become one of my priorities never to kill another innocent person. Better to show my hand now while that hand holds a gun.\u003c/p\u003e\n\u003cp\u003e“There’s something I should tell you,” I say. My voice is shaking. “I lied about the rats.”\u003c/p\u003e\n\u003cp\u003e“You found the rifle.” Not a question.\u003c/p\u003e\n\u003cp\u003eHe turns. With his back to the fire, his face is in shadow; I can’t read his expression, but his tone is casual. “I found it a couple of days ago off the highway—remembered you said you dropped one when you ran—then I saw those initials and I figured it had to be yours.”\u003c/p\u003e\n\u003cp\u003eFor a minute I don’t say anything. His explanation makes perfect sense. I just didn’t expect him to jump right into it like that.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you tell me?” I finally ask.\u003c/p\u003e\n\u003cp\u003eHe shrugs. “I was going to. Guess I forgot. What are you doing with that gun, Cassie?”\u003c/p\u003e\n\u003cp\u003eOh, I was thinking about blowing your head off, that’s all. Thought you might be a Silencer or maybe a traitor to your species or something along those lines. Ha-ha!\u003c/p\u003e\n\u003cp\u003eI follow his eyes to the weapon in my hand, and suddenly I feel like bursting into tears.\u003c/p\u003e\n\u003cp\u003e“We have to trust each other,” I whisper. “Don’t we?”\u003c/p\u003e\n\u003cp\u003e“Yes,” he says, moving toward me now. “We do.”\u003c/p\u003e\n\u003cp\u003e“But how…how do you make yourself trust someone?” I say. He’s beside me now. He doesn’t reach for the gun. He’s reaching for me with his eyes. And I want him to catch me before I fall too far away from the Evan-I-thought-I-knew, who saved me to save himself from falling. He’s all I’ve got now. He’s my itty-bitty bush growing out of the cliff that I cling to. Help me, Evan. Don’t let me fall. Don’t let me lose the part of me that makes me human.\u003c/p\u003e\n\u003cp\u003e“You can’t make yourself believe anything,” he answers softly. “But you can let yourself believe. You can allow yourself to trust.”\u003c/p\u003e\n\u003cp\u003eI nod, looking up into his eyes. So chocolaty warm. So melty and sad. Damn it, why does he have to be so damn beautiful? And why do I have to be so damn aware of it? And how is my trusting him any different from Sammy’s taking the soldier’s hand before climbing onto that bus? The weird thing is his eyes remind me of Sammy’s—filled with a longing to know if everything will be all right. The Others answered that question with an unequivocal no. So what does that make me if I give Evan the same answer? “I want to. Really, really bad.”\u003c/p\u003e\n\u003cp\u003eI don’t know how it happened, but my gun is now in his hand. He takes my hand and leads me around to the sofa. Sets the gun on top of Love’s Desperate Desire, sits close to me, but not too close, and rests his elbows on his knees. He rubs his large hands together as if they’re still cold. They’re not; I had just held one.\u003c/p\u003e\n\u003cp\u003e“I don’t want to leave here,” he confesses. “For a lot of reasons that seemed very good until I found you.” He claps his hands together softly in frustration; it isn’t coming out right. “I know you didn’t ask to be my reason for going on with…with everything. But from the moment I found you…” He turns and grabs my hands in his, and suddenly I’m a little scared. His grip is hard, his eyes swim with tears. It’s like I’m holding him back from tumbling over the edge of a cliff.\u003c/p\u003e\n\u003cp\u003e“I had it all wrong,” he says. “Before I found you, I thought the only way to hold on was to find something to live for. It isn’t. To hold on, you have to find something you’re willing to die for.”\u003c/p\u003e\n\u003cp\u003e56\u003c/p\u003e\n\u003cp\u003eTHE WORLD IS SCREAMING.\u003c/p\u003e\n\u003cp\u003eJust the icy wind racing through the open hatch of the Black Hawk, but that’s what it sounds like. At the height of the plague, when people were dying by the hundreds every day, the panicky residents of Tent City would sometimes toss an unconscious person into the fire by mistake, and you didn’t just hear their screams as they were burned alive, you felt them like a punch to your heart.\u003c/p\u003e\n\u003cp\u003eSome things you can never leave behind. They don’t belong to the past. They belong to you.\u003c/p\u003e\n\u003cp\u003eThe world is screaming. The world is being burned alive.\u003c/p\u003e\n\u003cp\u003eThrough the chopper windows, you can see the fires dotting the dark landscape, amber blotches against the inky backdrop, multiplying as you near the outskirts of the city. These aren’t funeral pyres. Lightning from summer storms started them, and the autumn winds carried the smoldering embers to new feeding grounds, because there was so much to eat, the pantry was stuffed. The world will burn for years. It will burn until I’m my father’s age—if I live that long.\u003c/p\u003e\n\u003cp\u003eWe’re skimming ten feet above treetop level, the rotors muffled by some kind of stealth technology, approaching downtown Dayton from the north. A light snow is falling; it shimmers around the fires below like golden halos, shedding light, illuminating nothing.\u003c/p\u003e\n\u003cp\u003eI turn from the window and see Ringer across the aisle, staring at me. She holds up two fingers. I nod. Two minutes to the drop. I pull the headband down to position the lens of the eyepiece over my left eye and adjust the strap.\u003c/p\u003e\n\u003cp\u003eRinger is pointing at Teacup, who’s in the chair next to me. Her eyepiece keeps slipping. I tighten the strap; she gives me a thumbs-up, and something sour rises in my throat. Seven years old. Dear Jesus. I lean over and shout in her ear, “You stay right next to me, understand?”\u003c/p\u003e\n\u003cp\u003eTeacup smiles, shakes her head, points at Ringer. I’m staying with her! I laugh. Teacup’s no dummy.\u003c/p\u003e\n\u003cp\u003eOver the river now, the Black Hawk skimming only a few feet above the water. Ringer is checking her weapon for the thousandth time. Beside her, Flintstone is tapping his foot nervously, staring forward, looking at nothing.\u003c/p\u003e\n\u003cp\u003eThere’s Dumbo inventorying his med kit, and Oompa bending his head in an attempt to keep us from seeing him stuff one last candy bar into his mouth.\u003c/p\u003e\n\u003cp\u003eFinally, Poundcake with his head down, hands folded in his lap. Reznik named him Poundcake because he said he was soft and sweet. He doesn’t strike me as either, especially on the firing range. Ringer’s a better marksman overall, but I’ve seen Poundcake take out six targets in six seconds.\u003c/p\u003e\n\u003cp\u003eYeah, Zombie. Targets. Plywood cutouts of human beings. When it comes down to the real deal, how will his aim be then? Or any of ours?\u003c/p\u003e\n\u003cp\u003eUnbelievable. We’re the vanguard. Seven kids who just six months ago were, well, just kids; we’re the counterpunch to attacks that left seven billion dead.\u003c/p\u003e\n\u003cp\u003eThere’s Ringer, staring at me again. As the chopper begins to descend, she unbuckles her harness and steps across the aisle. Places her hands on my shoulders and shouts in my face, “Remember the circle! We’re not going to die!”\u003c/p\u003e\n\u003cp\u003eWe dive into the drop zone fast and steep. The chopper doesn’t land; it hovers a few inches above the frozen turf while the squad hops out. From the open hatchway, I look over and see Teacup struggling with her harness. Then she’s loose and jumps out ahead of me. I’m the last to go. In the cockpit, the pilot looks over his shoulder, gives me a thumbs-up. I return the signal.\u003c/p\u003e\n\u003cp\u003eThe Black Hawk rockets into the night sky, turning hard north, its black hull blending quickly into the dark clouds until they swallow it, and it’s gone.\u003c/p\u003e\n\u003cp\u003eThe air in the little park by the river has been blasted clear of snow by the rotors. After the chopper leaves, the snow returns, spinning angrily around us. The sudden quiet that follows the screaming wind is deafening. Straight ahead a huge human shadow looms: the statue of a Korean War veteran. To the statue’s left is the bridge. Across the bridge and ten blocks southwest is the old courthouse where several infesteds have amassed a small arsenal of automatic weapons and grenade launchers, as well as FIM-92 Stinger missiles, according to the Wonderland profile of one infested captured in Operation Li’l Bo Peep. It’s the Stingers that brought us here. Our air capability has been devastated by the attacks; it’s imperative we protect the few resources we have left. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-5th-wave-the-5th-wave-1/page-37.html","bookId":1642,"creation":"Oct 5, 2019 6:33:41 PM","modification":"Oct 5, 2019 6:33:41 PM"}
