{"id":98329,"no":45,"title":"Page 45","content":"\u003cp\u003e“We better go,” he says tightly, glancing up at the sky. The clouds that moved in the day before still linger, hiding the stars. “We’re exposed here.”\u003c/p\u003e\n\u003cp\u003eSuddenly, Evan snaps his head to the left and goes all statuelike.\u003c/p\u003e\n\u003cp\u003e“What is it?” I whisper.\u003c/p\u003e\n\u003cp\u003eHe holds up his hand. Gives a sharp shake of his head. Peers into the near perfect darkness. I don’t see anything. Don’t hear anything. But I’m not a hunter like Evan.\u003c/p\u003e\n\u003cp\u003e“A damned flashlight,” he murmurs. He presses his lips to my ear. “What’s closer, the woods on the other side of the road or the ravine?”\u003c/p\u003e\n\u003cp\u003eI shake my head. I really don’t know. “The ravine, I guess.”\u003c/p\u003e\n\u003cp\u003eHe doesn’t hesitate. He grabs my hand, and we take off in a quick trot toward where I hoped the ravine was. I don’t know how far we ran till we came to it. Probably not as far as it seemed, because it seemed like we ran forever. Evan lowers me down the rocky face to the bottom, then jumps in beside me.\u003c/p\u003e\n\u003cp\u003e“Evan?”\u003c/p\u003e\n\u003cp\u003eHe presses his finger to his lips. Scoots up the side to peek over the edge. He motions to his pack, and I fish around until I find his binoculars. I tug on his pant leg—What’s going on?—but he shakes off my hand. He taps his fingers against his thigh, thumb tucked. Four of them? Is that what he meant? Or is he using some kind of hunter’s code, like, Get down on all fours!\u003c/p\u003e\n\u003cp\u003eHe doesn’t move for a long time. Finally he shimmies back down and puts his lips to my ear again.\u003c/p\u003e\n\u003cp\u003e“They’re coming this way.” He squints in the gloom toward the opposite wall of the ravine, which is much steeper than the one we came down, but there are woods on the other side, or what’s left of them: shattered stumps of trees, tangles of broken branches and vines. Good cover. Or at least better cover than being totally exposed in a gully where the bad guys can pick you off like fish in a barrel. He bites his lip, weighing the odds. Do we have time to scale the other side before being spotted?\u003c/p\u003e\n\u003cp\u003e“Stay down.”\u003c/p\u003e\n\u003cp\u003eHe swings his rifle off his shoulder and braces his boots against the unsteady surface, resting his elbows on the ground above. I’m standing directly beneath him, cradling the M16. Yeah, he told me to stay down, I know. But I’m not about to huddle in a heap waiting for the end. I’ve been there before, and I’m never going back.\u003c/p\u003e\n\u003cp\u003eEvan fires; the twilight stillness shatters. The kickback of the rifle knocks him off balance, his foot slips, and he falls straight down. Luckily, there’s a moron directly beneath him to break his fall. Lucky for him. Not so lucky for the moron.\u003c/p\u003e\n\u003cp\u003eHe rolls off me, yanks me to my feet, and shoves me toward the opposite side. But it’s kind of difficult to move fast when you can’t breathe.\u003c/p\u003e\n\u003cp\u003eA flare drops into the ravine, ripping apart the dark with a hellish red glare. Evan slides his hands under my arms and hurls me toward the top. I catch hold of the edge with my fingertips and furiously dig into the wall with my toes, like some crazy bicyclist. Then Evan’s hands on my butt for the final heave-ho, and I’m on the other side.\u003c/p\u003e\n\u003cp\u003eI swing around to help him up, but he shouts for me to run—no reason to be quiet now—as a small, pineapple-shaped object plops into the ravine behind him.\u003c/p\u003e\n\u003cp\u003eI scream, “Grenade!” which gives Evan an entire second to take cover.\u003c/p\u003e\n\u003cp\u003eThat’s not quite enough time.\u003c/p\u003e\n\u003cp\u003eThe blast drops him, and at that moment a figure wearing fatigues appears on the opposite side of the ravine. I open up with my M16, screaming incoherently at the top of my lungs. The figure scrambles backward, but I keep firing at the spot where he stood. I don’t think he was expecting Cassie Sullivan’s answer to his invitation to party down post–alien apocalypse style.\u003c/p\u003e\n\u003cp\u003eI empty my clip, slap home a fresh one. Count to ten. Make myself look down, sure of what I’m going to see when I do. Evan’s body at the bottom of the ravine, ripped to shreds, all because I was the one thing he found worth dying for. Me, the girl who let him kiss her but never kissed him first. The girl who never thanked him for saving her life but paid him back with sarcasm and accusations. I know what I’m going to see when I look down, but that’s not what I see.\u003c/p\u003e\n\u003cp\u003eEvan is gone.\u003c/p\u003e\n\u003cp\u003eThe little voice inside my head whose job it is to keep me alive shouts, Run!\u003c/p\u003e\n\u003cp\u003eSo I run.\u003c/p\u003e\n\u003cp\u003eLeaping over fallen trees and winter dry scrub, and now the familiar pop-pop-pop of rapid-arms fire.\u003c/p\u003e\n\u003cp\u003eGrenades. Flares. Assault weapons. These aren’t Twigs after us. These are pros.\u003c/p\u003e\n\u003cp\u003eOutside the fiendish glow of the flare, I hit a wall of dark, then run smack into a tree. The impact knocks me off my feet. I don’t know how far I ran, but it must be a good distance, because I can’t see the ravine, can’t hear anything but my own heartbeat roaring in my ears.\u003c/p\u003e\n\u003cp\u003eI scuttle forward to a fallen pine tree and huddle behind it, waiting for the breath I left back at the ravine to catch up with me. Waiting for another flare to drop into the woods in front of me. Waiting for the Silencers to come crashing through the underbrush.\u003c/p\u003e\n\u003cp\u003eA rifle pops in the distance, followed by a high-pitched scream. Then an answering barrage of automatic weapons and another grenade explosion, and then silence.\u003c/p\u003e\n\u003cp\u003eWell, it isn’t me they’re shooting at, so it must be Evan, I think. Which makes me feel better and a whole lot worse, because he’s out there alone against pros, and where am I? Hiding behind a tree like a girl.\u003c/p\u003e\n\u003cp\u003eBut what about Sams? I can run back into a fight I’ll probably lose, or stay down to stay alive long enough to keep my promise.\u003c/p\u003e\n\u003cp\u003eIt’s an either/or world.\u003c/p\u003e\n\u003cp\u003eAnother crack! of a rifle. Another girly scream.\u003c/p\u003e\n\u003cp\u003eMore silence.\u003c/p\u003e\n\u003cp\u003eHe’s picking them off one by one. A farm boy with no combat experience against a squad of professional soldiers. Outnumbered. Outgunned. Cutting them down with the same brutal efficiency as the Silencer on the interstate, the hunter in the woods who chased me under a car and then mysteriously disappeared.\u003c/p\u003e\n\u003cp\u003eCrack!\u003c/p\u003e\n\u003cp\u003eScream.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eI don’t move. I wait behind my log, terrified. Over the past ten minutes, it’s become such a dear friend, I consider naming it: Howard, my pet log.\u003c/p\u003e\n\u003cp\u003eYou know, when I first saw you in the woods, I thought he was your bear.\u003c/p\u003e\n\u003cp\u003eThe snap and crunch of dead leaves and twigs underfoot. A darker shadow against the dark of the woods. The soft call of the Silencer. My Silencer.\u003c/p\u003e\n\u003cp\u003e“Cassie? Cassie, it’s safe now.”\u003c/p\u003e\n\u003cp\u003eI heave myself upright and point my rifle directly at Evan Walker’s face.\u003c/p\u003e\n\u003cp\u003e68\u003c/p\u003e\n\u003cp\u003eHE PULLS UP QUICKLY, but the look of confusion comes slowly.\u003c/p\u003e\n\u003cp\u003e“Cassie, it’s me.”\u003c/p\u003e\n\u003cp\u003e“I know it’s you. I just don’t know who you are.”\u003c/p\u003e\n\u003cp\u003eHis jaw tightens. His voice is strained. Anger? Frustration? I can’t tell. “Lower the gun, Cassie.”\u003c/p\u003e\n\u003cp\u003e“Who are you, Evan? If that’s evan your name. Even your name.”\u003c/p\u003e\n\u003cp\u003eHe smiles wanly. And then he falls to his knees, sways, topples over, and lies still.\u003c/p\u003e\n\u003cp\u003eI wait, the gun trained on the back of his head. He doesn’t move. I hop over Howard and poke him with my toe. He still doesn’t move. I kneel beside him, resting the butt of my rifle on my thigh, and press my fingers against his neck, feeling for a pulse. He’s alive. His pants are shredded from the thighs down. Wet to the touch. I smell my fingertips. Blood.\u003c/p\u003e\n\u003cp\u003eI lean my M16 against the fallen tree and roll Evan onto his back. His eyelids flutter. He reaches up and touches my cheek with his bloody palm.\u003c/p\u003e\n\u003cp\u003e“Cassie,” he whispers. “Cassie for Cassiopeia.”\u003c/p\u003e\n\u003cp\u003e“Stop it,” I say. I notice his rifle lying next to him and kick it out of his reach. “How bad are you hurt?”\u003c/p\u003e\n\u003cp\u003e“I think pretty bad.”\u003c/p\u003e\n\u003cp\u003e“How many were there?”\u003c/p\u003e\n\u003cp\u003e“Four.”\u003c/p\u003e\n\u003cp\u003e“They never had a chance, did they?”\u003c/p\u003e\n\u003cp\u003eLong sigh. His eyes lift up to mine. I don’t need him to speak; I can see the answer in his eyes. “Not much, no.”\u003c/p\u003e\n\u003cp\u003e“Because you don’t have the heart to kill, but you have the heart to do what you have to do.” I hold my breath. He must know where I’m going with this.\u003c/p\u003e\n\u003cp\u003eHe hesitates. Nods. I can see the pain in his eyes. I look away so he can’t see the pain in mine. But you started down this road, Cassie. No turning back now.\u003c/p\u003e\n\u003cp\u003e“And you’re very good at what you have the heart to do, aren’t you?”\u003c/p\u003e\n\u003cp\u003eWell, that’s the question, isn’t it? Yours, too: What do you have the heart to do, Cassie?\u003c/p\u003e\n\u003cp\u003eHe saved my life. How could he also be the one who tried to take it? It doesn’t make sense.\u003c/p\u003e\n\u003cp\u003eDo I have the heart to let him bleed to death because now I know he lied to me—that he isn’t gentle Evan Walker the reluctant hunter, the grieving son and brother and lover, but something that might not even be human? Do I have what it takes to follow the first rule down to its final, brutal, unforgiving conclusion and put a bullet through his finely sculpted forehead?\u003c/p\u003e\n\u003cp\u003eOh, crap, who are you kidding?\u003c/p\u003e\n\u003cp\u003eI start to unbutton his shirt. “Got to get these clothes off,” I mutter.\u003c/p\u003e\n\u003cp\u003e“You don’t know how long I’ve waited to hear you say that.” Smile. Lopsided. Sexy.\u003c/p\u003e\n\u003cp\u003e“You’re not charming your way out of this one, buddy. Can you sit up a little? A little more. Here, take these.” A couple of pain pills from the first aid kit. He swallows them with two long gulps of water from a bottle I hand him.\u003c/p\u003e\n\u003cp\u003eI pull off his shirt. He’s looking up into my face; I avoid his gaze. While I tug off his boots, he unbuckles his belt and pulls down the zipper. He lifts his butt, but I can’t get his pants off—they’re plastered to his body with tacky blood.\u003c/p\u003e\n\u003cp\u003e“Rip them,” he says. He rolls over onto his stomach. I try, but the material keeps slipping through my fingers when I pull.\u003c/p\u003e\n\u003cp\u003e“Here, use this.” He holds up a bloody knife. I don’t ask him where the blood came from.\u003c/p\u003e\n\u003cp\u003eI cut from hole to hole slowly; I’m terrified of cutting him. Then I strip the pants away from each leg, like peeling a banana. That’s it, the perfect metaphor: peeling a banana. I have to know what the truth is, and you can’t get to the tasty fruit without stripping off the outer layer.\u003c/p\u003e\n\u003cp\u003eSpeaking of fruit, I’m down—I mean, he’s down—to his underwear.\u003c/p\u003e\n\u003cp\u003eConfronted with them, I ask, “Do I need to look at your butt?”\u003c/p\u003e\n\u003cp\u003e“I’ve been wondering about your opinion.”\u003c/p\u003e\n\u003cp\u003e“Enough with the lame attempts at humor.” I slice the material at both hips and peel back the underwear, exposing him. His butt is bad. I mean bad as in peppered with shrapnel wounds. Otherwise, it’s pretty good.\u003c/p\u003e\n\u003cp\u003eI dab at the blood with some gauze from the kit, fighting back hysterical giggles. I blame it on the unbearable stress, not on the fact that I’m wiping Evan Walker’s ass.\u003c/p\u003e\n\u003cp\u003e“God, you’re a mess.”\u003c/p\u003e\n\u003cp\u003eHe’s gasping for air. “Just try to stop the bleeding for now.”\u003c/p\u003e\n\u003cp\u003eI pack the wounds on this side of him the best I can. “Can you roll back over?” I ask.\u003c/p\u003e\n\u003cp\u003e“I’d rather not.”\u003c/p\u003e\n\u003cp\u003e“I need to see the front.” Oh my God. The front?\u003c/p\u003e\n\u003cp\u003e“The front’s okay. Really.”\u003c/p\u003e\n\u003cp\u003eI sit back, exhausted. Guess that’s one thing I’ll take his word for. “Tell me what happened.”\u003c/p\u003e\n\u003cp\u003e“After I got you out of the ravine, I ran. Found a shallow spot to climb out. Circled around them. The rest you probably heard.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-5th-wave-the-5th-wave-1/page-45.html","bookId":1642,"creation":"Oct 5, 2019 6:33:41 PM","modification":"Oct 5, 2019 6:33:41 PM"}
