{"id":98290,"no":6,"title":"Page 6","content":"\u003cp\u003eWe went outside and I said, “Where’s the car?”\u003c/p\u003e\n\u003cp\u003eAnd Dad said the car wasn’t working. No cars were working. The streets were littered with stalled-out cars and buses and motorcycles and trucks, smashups and clusters of wrecks on every block, cars folded around light poles and sticking out of buildings. A lot of people were trapped when the EMP hit; the automatic locks on the doors didn’t work, and they had to break out of their own cars or sit there and wait for someone to rescue them. The injured people who could still move crawled onto the roadside and sidewalks to wait for the paramedics, but no paramedics came because the ambulances and the fire trucks and the cop cars didn’t work, either. Everything that ran on batteries or electricity or had an engine died at eleven A.M.\u003c/p\u003e\n\u003cp\u003eDad walked as he talked, keeping a tight grip on my wrist, like he was afraid something might swoop down out of the sky and snatch me away.\u003c/p\u003e\n\u003cp\u003e“Nothing’s working. No electricity, no phones, no plumbing…”\u003c/p\u003e\n\u003cp\u003e“We saw a plane crash.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “I’m sure they all did. Anything and everything in the sky when it hit. Fighter jets, helicopters, troop transports…”\u003c/p\u003e\n\u003cp\u003e“When what hit?”\u003c/p\u003e\n\u003cp\u003e“EMP,” he said. “Electromagnetic pulse. Generate one large enough and you knock out the entire grid. Power. Communications. Transportation. Anything that flies or drives is zapped out.”\u003c/p\u003e\n\u003cp\u003eIt was a mile and a half from my school to our house. The longest mile and a half I’ve ever walked. It felt as if a curtain had fallen over everything, a curtain painted to look exactly like what it was hiding. There were glimpses, though, little peeks behind the curtain that told you something had gone very wrong. Like all the people standing on their front porches holding their dead phones, looking up at the sky, or bending over the open hoods of their cars, fiddling with wires, because that’s what you do when your car dies—you fiddle with wires.\u003c/p\u003e\n\u003cp\u003e“But it’s okay,” he said, squeezing my wrist. “It’s okay. There’s a good chance our backup systems weren’t crippled, and I’m sure the government has a contingency plan, protected bases, that sort of thing.”\u003c/p\u003e\n\u003cp\u003e“And how does pulling our plug fit into their plan to help us along in the next stage of our evolution, Dad?”\u003c/p\u003e\n\u003cp\u003eI regretted the words the instant I said them. But I was freaking out. He didn’t take it the wrong way. He looked at me and smiled reassuringly and said, “Everything’s going to be okay,” because that’s what I wanted him to say and it’s what he wanted to say and that’s what you do when the curtain is falling—you give the line that the audience wants to hear.\u003c/p\u003e\n\u003cp\u003e7\u003c/p\u003e\n\u003cp\u003eAROUND NOON on my mission to keep my promise, I stop for a water break and a Slim Jim. Every time I eat a Slim Jim or a can of sardines or anything prepackaged, I think, Well, there’s one less of that in the world. Whittling away the evidence of our having been here one bite at a time.\u003c/p\u003e\n\u003cp\u003eOne of these days, I’ve decided, I’m going to work up the nerve to catch a chicken and wring its delicious neck. I would kill for a cheeseburger. Honestly. If I stumbled across someone eating a cheeseburger, I would kill them for it.\u003c/p\u003e\n\u003cp\u003eThere are plenty of cows around. I could shoot one and carve it up with my bowie knife. I’m pretty sure I’d have no problem slaughtering a cow. The hard part would be cooking it. Having a fire, even in daylight, was the surest way to invite them to the cookout.\u003c/p\u003e\n\u003cp\u003eA shadow shoots across the grass a dozen yards in front of me. I jerk my head back, knocking it hard against the side of a Honda Civic I was leaning against while I enjoyed my snack. It wasn’t a drone. It was a bird, a seagull of all things, skimming along with barely a flick of its outstretched wings. A shiver of revulsion goes down my spine. I hate birds. I didn’t before the Arrival. I didn’t after the 1st Wave. I didn’t after the 2nd Wave, which really didn’t affect me that much.\u003c/p\u003e\n\u003cp\u003eBut after the 3rd Wave, I hated them. It wasn’t their fault, I knew that. It was like a man in front of a firing squad hating the bullets, but I couldn’t help it.\u003c/p\u003e\n\u003cp\u003eBirds suck.\u003c/p\u003e\n\u003cp\u003e8\u003c/p\u003e\n\u003cp\u003eAFTER THREE DAYS on the road, I’ve determined that cars are pack animals.\u003c/p\u003e\n\u003cp\u003eThey prowl in groups. They die in clumps. Clumps of smashups. Clumps of stalls. They glimmer in the distance like jewels. And suddenly the clumps stop. The road is empty for miles. There’s just me and the asphalt river cutting through a defile of half-naked trees, their leaves crinkled and clinging desperately to their dark branches. There’s the road and the naked sky and the tall, brown grass and me.\u003c/p\u003e\n\u003cp\u003eThese empty stretches are the worst. Cars provide cover. And shelter. I sleep in the undamaged ones (I haven’t found a locked one yet). If you can call it sleep. Stale, stuffy air; you can’t crack the windows, and leaving the door open is out of the question. The gnaw of hunger. And the night thoughts. Alone, alone, alone.\u003c/p\u003e\n\u003cp\u003eAnd the baddest of the bad night thoughts:\u003c/p\u003e\n\u003cp\u003eI’m no alien drone designer, but if I were going to make one, I’d make sure that its detection device was sensitive enough to pick up a body’s heat signature through a car roof. It never failed: The moment I started to drift off, I imagined all four doors flying open and dozens of hands reaching for me, hands attached to arms attached to whatever they are. And then I’m up, fumbling with my M16, peeking over the backseat, then doing a 360, feeling trapped and more than a little blind behind the fogged-up windows.\u003c/p\u003e\n\u003cp\u003eDawn comes. I wait for the morning fog to burn off, then sip some water, brush my teeth, double-check my weapons, inventory my supplies, and hit the road again. Look up, look down, look all around. Don’t pause at the exits. Water’s fine for now. No way am I going anywhere near a town unless I have to.\u003c/p\u003e\n\u003cp\u003eFor a lot of reasons.\u003c/p\u003e\n\u003cp\u003eYou know how you can tell when you’re getting close to one? The smell. You can smell a town from miles away.\u003c/p\u003e\n\u003cp\u003eIt smells like smoke. And raw sewage. And death.\u003c/p\u003e\n\u003cp\u003eIn the city it’s hard to take two steps without stumbling over a corpse. Funny thing: People die in clumps, too.\u003c/p\u003e\n\u003cp\u003eI begin to smell Cincinnati about a mile before spotting the exit sign. A thick column of smoke rises lazily toward the cloudless sky.\u003c/p\u003e\n\u003cp\u003eCincinnati is burning.\u003c/p\u003e\n\u003cp\u003eI’m not surprised. After the 3rd Wave, the second most common thing you found in cities, after the bodies, were fires. A single lightning strike could take out ten city blocks. There was no one left to put the fires out.\u003c/p\u003e\n\u003cp\u003eMy eyes start to water. The stench of Cincinnati makes me gag. I stop long enough to tie a rag around my mouth and nose and then quicken my pace. I pull the rifle off my shoulder and cradle it as I quickstep. I have a bad feeling about Cincinnati. The old voice inside my head is awake.\u003c/p\u003e\n\u003cp\u003eHurry, Cassie. Hurry.\u003c/p\u003e\n\u003cp\u003eAnd then, somewhere between Exits 17 and 18, I find the bodies.\u003c/p\u003e\n\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003eTHERE ARE THREE OF THEM, not in a clump like city folk, but spaced out in the median strip. The first one is an older guy, around my dad’s age, I guess. Wearing blue jeans and a Bengals warm-up. Facedown, arms outstretched. He was shot in the back of the head.\u003c/p\u003e\n\u003cp\u003eThe second, about a dozen feet away, is a young woman, a little older than I am and dressed in a pair of men’s pajama pants and Victoria’s Secret tee. A streak of purple in her short-cropped hair. A skull ring on her left index finger. Black nail polish, badly chipped. And a bullet hole in the back of her head.\u003c/p\u003e\n\u003cp\u003eAnother few feet and there’s the third. A kid around eleven or twelve. Brand-new white basketball high-tops. Black sweatshirt. Hard to tell what his face used to look like.\u003c/p\u003e\n\u003cp\u003eI leave the kid and go back to the woman. Kneel in the tall brown grass beside her. Touch her pale neck. Still warm.\u003c/p\u003e\n\u003cp\u003eOh no. No, no, no.\u003c/p\u003e\n\u003cp\u003eI trot back to the first guy. Kneel. Touch the palm of his outstretched hand. Look over at the bloody hole between his ears. Shiny. Still wet.\u003c/p\u003e\n\u003cp\u003eI freeze. Behind me, the road. In front of me, more road. To my right, trees. To my left, more trees. Clumps of cars on the southbound lane, the nearest grouping about a hundred feet away. Something tells me to look up. Straight up.\u003c/p\u003e\n\u003cp\u003eA fleck of dull gray against the backdrop of dazzling autumnal blue.\u003c/p\u003e\n\u003cp\u003eMotionless.\u003c/p\u003e\n\u003cp\u003eHello, Cassie. My name is Mr. Drone. Nice to meet you!\u003c/p\u003e\n\u003cp\u003eI stand up, and when I stand up—the moment I stand up; if I had stayed frozen there a millisecond longer, Mr. Bengals and I would be sporting matching holes—something slams into my leg, a hot punch just above my knee that knocks me off balance, sending me sprawling backward onto my butt.\u003c/p\u003e\n\u003cp\u003eI didn’t hear the shot. There was the cool wind in the grass and my own hot breath under the rag and the blood rushing in my ears—that’s all there was before the bullet struck.\u003c/p\u003e\n\u003cp\u003eSilencer.\u003c/p\u003e\n\u003cp\u003eThat makes sense. Of course they’d use silencers. And now I have the perfect name for them: Silencers. A name that fits the job description.\u003c/p\u003e\n\u003cp\u003eSomething takes over when you’re facing death. The front part of your brain lets go, gives up control to the oldest part of you, the part that takes care of your heartbeat and breathing and the blinking of your eyes. The part nature built first to keep your ass alive. The part that stretches time like a gigantic piece of toffee, making a second seem like an hour and a minute longer than a summer afternoon.\u003c/p\u003e\n\u003cp\u003eI lunge forward for my rifle—I had dropped the M16 when the round punched home—and the ground in front of me explodes, showering me with shredded grass and hunks of dirt and gravel.\u003c/p\u003e\n\u003cp\u003eOkay, forget the M16.\u003c/p\u003e\n\u003cp\u003eI yank the Luger from my waistband and do a sort of running hop—or a hopping run—toward the closest car. There isn’t much pain—although my guess is that we’re going to get very intimate later—but I can feel the blood soaking into my jeans by the time I reach the car, an older model Buick sedan.\u003c/p\u003e\n\u003cp\u003eThe rear windshield shatters as I dive down. I scoot on my back till I’m all the way under the car. I’m not a big girl by any stretch, but it’s a tight fit, no room to roll over, no way to turn if he shows up on the left side.\u003c/p\u003e\n\u003cp\u003eCornered.\u003c/p\u003e\n\u003cp\u003eSmart, Cassie, real smart. Straight As last semester? Honor roll? Riiiiiight.\u003c/p\u003e\n\u003cp\u003eYou should have stayed in your little stretch of woods in your little tent with your little books and your cute little mementos. At least when they came for you, there’d be room to run.\u003c/p\u003e\n\u003cp\u003eThe minutes spin out. I lie on my back and bleed onto the cold concrete. Rolling my head to the right, to the left, raising it a half inch to look past my feet toward the back of the car. Where the hell is he? What’s taking so long? Then it hits me:\u003c/p\u003e\n\u003cp\u003eHe’s using a high-powered sniper rifle. Has to be. Which means he could have been over a half mile away when he shot me.\u003c/p\u003e\n\u003cp\u003eWhich also means I have more time than I first thought. Time to come up with something besides a blubbery, desperate, disjointed prayer.\u003c/p\u003e\n\u003cp\u003eMake him go away. Make him be quick. Let me live. Let him end it…\u003c/p\u003e\n\u003cp\u003eShaking uncontrollably. I’m sweating; I’m freezing cold.\u003c/p\u003e\n\u003cp\u003eYou’re going into shock. Think, Cassie.\u003c/p\u003e\n\u003cp\u003eThink.\u003c/p\u003e\n\u003cp\u003eIt’s what we’re made for. It’s what got us here. It’s the reason I have this car to hide under. We are human.\u003c/p\u003e\n\u003cp\u003eAnd humans think. They plan. They dream, and then they make the dream real.\u003c/p\u003e\n\u003cp\u003eMake it real, Cassie.\u003c/p\u003e\n\u003cp\u003eUnless he drops down, he won’t be able to get to me. And when he drops down…when he dips his head to look at me…when he reaches in to grab my ankle and drag me out… \u003c/p\u003e","sourceLink":"https://allnovel.net/the-5th-wave-the-5th-wave-1/page-6.html","bookId":1642,"creation":"Oct 5, 2019 6:33:41 PM","modification":"Oct 5, 2019 6:33:41 PM"}
