{"id":98293,"no":9,"title":"Page 9","content":"\u003cp\u003eDad had heard about the camp a few weeks back, when Mom started showing early symptoms of the Pestilence. He tried to get Mom to go, but she knew there was nothing anyone could do. If she was going to die, she wanted to do it in her own home, not in some bogus hospice in the middle of the woods. Then later, as she was entering the final hours, the rumor came around that the hospital had been turned into a rendezvous point, a kind of survivor safe house, far enough from town to be reasonably safe in the next wave, whatever that was going to be (though the smart money was on some kind of aerial bombardment), but close enough for the People in Charge to find when they came to rescue us—if there were People in Charge and if they came.\u003c/p\u003e\n\u003cp\u003eThe unofficial boss of the camp was a retired marine named Hutchfield. He was a human LEGO person: square hands, square head, square jaw. Wore the same muscle tee every day, stained with something that might have been blood, though his black boots always sported a mirror finish. He shaved his head (though not his chest or back, which he really should have considered). He was covered in tattoos. And he liked guns. Two on his hip, one tucked behind his back, another slung over his shoulder. No one carried more guns than Hutchfield. Maybe that had something to do with his being the unofficial boss.\u003c/p\u003e\n\u003cp\u003eSentries had spotted us coming, and when we reached the dirt road that led into the woods to the camp, Hutchfield was there with another guy named Brogden. I’m pretty sure we were supposed to notice the firepower draped all over their bodies. Hutchfield ordered us to split up. He was going to talk to Dad; Brogden got me and Sams. I told Hutchfield what I thought about that idea. You know, like where exactly on his tattooed behind he could stick it.\u003c/p\u003e\n\u003cp\u003eI’d just lost one parent. I wasn’t too keen on the idea of losing another.\u003c/p\u003e\n\u003cp\u003e“It’s all right, Cassie,” my father said.\u003c/p\u003e\n\u003cp\u003e“We don’t know these guys,” I argued with him. “They could be just another bunch of Twigs, Dad.” Twigs was street for “thugs with guns,” the murderers, rapists, black marketers, kidnappers, and just your general punks who showed up midway through the 3rd Wave, the reason people barricaded their houses and stockpiled food and weapons. It wasn’t the aliens that first made us gear up for war; it was our fellow humans.\u003c/p\u003e\n\u003cp\u003e“They’re just being careful,” Dad argued back. “I’d do the same thing in their position.” He patted me. I was like, Damn it, old man, if you give me that g.d. condescending little pat one more time… “It’ll be fine, Cassie.”\u003c/p\u003e\n\u003cp\u003eHe went off with Hutchfield, out of earshot but still in sight. That made me feel a little better. I hauled Sammy onto my hip and did my best to answer Brogden’s questions without popping him with my free hand.\u003c/p\u003e\n\u003cp\u003eWhat were our names?\u003c/p\u003e\n\u003cp\u003eWhere were we from?\u003c/p\u003e\n\u003cp\u003eWas anyone in our party infected?\u003c/p\u003e\n\u003cp\u003eWas there anything we could tell him about what was going on?\u003c/p\u003e\n\u003cp\u003eWhat had we seen?\u003c/p\u003e\n\u003cp\u003eWhat had we heard?\u003c/p\u003e\n\u003cp\u003eWhy were we here?\u003c/p\u003e\n\u003cp\u003e“You mean here at this camp, or are you being existential?” I asked.\u003c/p\u003e\n\u003cp\u003eHis eyebrows drew together into a single harsh line, and he said, “Huh?”\u003c/p\u003e\n\u003cp\u003e“If you’d asked me that before all this shit happened, I’d have said something like, ‘We’re here to serve our fellow man or contribute to society.’ If I wanted to be a smartass, I’d say, ‘Because if we weren’t here, we’d be somewhere else.’ But since all this shit has happened, I’m going to say it’s because we’re just dumb lucky.”\u003c/p\u003e\n\u003cp\u003eHe squinted at me for a second before saying snarkily, “You are a smartass.”\u003c/p\u003e\n\u003cp\u003eI don’t know how Dad answered that question, but apparently it passed inspection, because we were allowed into camp with full privileges, which meant Dad (not me, though) was allowed to have his pick of weapons from the cache. Dad had a thing about guns. Never liked them. Said guns might not kill people, but they sure made it easier. Now he didn’t think they were dangerous so much as he thought they were ridiculously lame.\u003c/p\u003e\n\u003cp\u003e“How effective do you think our guns are going to be against a technology thousands, if not millions, of years ahead of ours?” he asked Hutchfield. “It’s like using a club and stones against a tactical missile.”\u003c/p\u003e\n\u003cp\u003eThe argument was lost on Hutchfield. He was a marine, for God’s sake. His rifle was his best friend, his most trusted companion, the answer to every possible question.\u003c/p\u003e\n\u003cp\u003eI didn’t get that back then. I get it now.\u003c/p\u003e\n\u003cp\u003e13\u003c/p\u003e\n\u003cp\u003eIN GOOD WEATHER, everyone stayed outside until it was time to go to bed. That ramshackle building had a bad vibe. Because of why it was built. Why it existed. What had brought it—and us—into these woods. Some nights the mood was light, almost like a summer camp where by some miracle everybody liked one another. Someone would say they heard the sound of a helicopter that afternoon, which would set off a round of hopeful speculation that the People in Charge were getting their acts together and preparing for the counterpunch.\u003c/p\u003e\n\u003cp\u003eOther times the mood was darker and angst was heavy in the twilight air. We were the lucky ones. We’d survived the EMP attack, the obliteration of the coasts, the plague that wasted everyone we knew and loved. We’d beaten the odds. We’d stared into the face of Death, and Death blinked first. You’d think that would make us feel brave and invincible. It didn’t.\u003c/p\u003e\n\u003cp\u003eWe were like the Japanese who survived the initial blast of the Hiroshima bomb. We didn’t understand why we were still here, and we weren’t completely sure we wanted to be.\u003c/p\u003e\n\u003cp\u003eWe told the stories of our lives before the Arrival. We cried openly over the ones we lost. We wept secretly for our smartphones, our cars, our microwave ovens, and the Internet.\u003c/p\u003e\n\u003cp\u003eWe watched the night sky. The mothership would stare down at us, a pale green, malevolent eye.\u003c/p\u003e\n\u003cp\u003eThere were debates about where we should go. It was pretty much understood we couldn’t squat in these woods indefinitely. Even if the Others weren’t coming anytime soon, winter was. We had to find better shelter. We had several months’ worth of supplies—or less, depending upon how many more refugees wandered into camp. Did we wait for rescue or hit the road to find it? Dad was all for the latter. He still wanted to check out Wright-Patterson. If there were People in Charge, the odds were a lot better we’d find them there.\u003c/p\u003e\n\u003cp\u003eI got sick of it after a while. Talking about the problem had replaced actually doing something about it. I was ready to tell Dad we should tell these douchebags to stuff it, take off for Wright-Patterson with whoever wanted to go with us and screw the rest.\u003c/p\u003e\n\u003cp\u003eSometimes, I thought, strength in numbers was a highly overrated concept.\u003c/p\u003e\n\u003cp\u003eI brought Sammy inside and put him to bed. Said his prayer with him. “‘Now I lay me down to sleep…’” To me, just random noise. Gibberish. I wasn’t sure exactly what it was, but I felt that, when it came to God, there was a broken promise in there somewhere.\u003c/p\u003e\n\u003cp\u003eIt was a clear night. The moon was full. I felt comfortable enough to take a walk in the woods.\u003c/p\u003e\n\u003cp\u003eSomebody in camp had picked up a guitar. The melody skipped along the trail, following me into the woods. It was the first music I’d heard since the 1st Wave.\u003c/p\u003e\n\u003cp\u003e“And, in the end, we lie awake\u003c/p\u003e\n\u003cp\u003eAnd we dream of making our escape.”\u003c/p\u003e\n\u003cp\u003eSuddenly I just wanted to curl into a little ball and cry. I wanted to take off through those woods and keep running until my legs fell off. I wanted to puke. I wanted to scream until my throat bled. I wanted to see my mother again, and Lizbeth and all my friends, even the friends I didn’t like, and Ben Parish, just to tell him I loved him and wanted to have his baby more than I wanted to live.\u003c/p\u003e\n\u003cp\u003eThe song faded, was drowned out by the definitely less melodic song of the crickets.\u003c/p\u003e\n\u003cp\u003eA twig snapped.\u003c/p\u003e\n\u003cp\u003eAnd a voice came out of the woods behind me.\u003c/p\u003e\n\u003cp\u003e“Cassie! Wait up!”\u003c/p\u003e\n\u003cp\u003eI kept walking. I recognized that voice. Maybe I’d jinxed myself, thinking about Ben. Like when you’re craving chocolate and the only thing in your backpack is a half-crushed bag of Skittles.\u003c/p\u003e\n\u003cp\u003e“Cassie!”\u003c/p\u003e\n\u003cp\u003eNow he was running. I didn’t feel like running, so I let him catch up to me.\u003c/p\u003e\n\u003cp\u003eThat was one thing that hadn’t changed: The one sure way of not being alone was wanting to be alone.\u003c/p\u003e\n\u003cp\u003e“Whatcha doing?” Crisco asked. He was pulling hard for air. Bright red cheeks. Shiny temples, maybe from all the hair grease.\u003c/p\u003e\n\u003cp\u003e“Isn’t it obvious?” I shot back. “I’m building a nuclear device to take out the mothership.”\u003c/p\u003e\n\u003cp\u003e“Nukes won’t do it,” he said, squaring his shoulders. “We should build Fermi’s steam cannon.”\u003c/p\u003e\n\u003cp\u003e“Fermi?”\u003c/p\u003e\n\u003cp\u003e“The guy who invented the bomb.”\u003c/p\u003e\n\u003cp\u003e“I thought that was Oppenheimer.”\u003c/p\u003e\n\u003cp\u003eHe seemed impressed I knew something about history.\u003c/p\u003e\n\u003cp\u003e“Well, maybe he didn’t invent it, but he was the godfather.”\u003c/p\u003e\n\u003cp\u003e“Crisco, you’re a freak,” I said. That sounded harsh, so I added, “But I didn’t know you before the invasion.”\u003c/p\u003e\n\u003cp\u003e“You dig this big hole. Put a warhead at the bottom. Fill the hole with water and cap it off with a few hundred tons of steel. The explosion turns the water instantly into steam, which shoots the steel into space at six times the speed of sound.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” I said. “Somebody should definitely do that. Is that why you’re stalking me? You want me to help you build a nuclear steam cannon?”\u003c/p\u003e\n\u003cp\u003e“Can I ask you something?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“I’m serious.”\u003c/p\u003e\n\u003cp\u003e“So am I.”\u003c/p\u003e\n\u003cp\u003e“If you had twenty minutes to live, what would you do?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” I answered. “But it wouldn’t have anything to do with you.”\u003c/p\u003e\n\u003cp\u003e“How come?” He didn’t wait for an answer. He probably figured it wasn’t something he wanted to hear. “What if I was the last person on Earth?”\u003c/p\u003e\n\u003cp\u003e“If you were the last person on Earth, I wouldn’t be here to do anything with you.”\u003c/p\u003e\n\u003cp\u003e“Okay. What if we were the last two people on Earth?”\u003c/p\u003e\n\u003cp\u003e“Then you’d still end up being the last, because I’d kill myself.”\u003c/p\u003e\n\u003cp\u003e“You don’t like me.”\u003c/p\u003e\n\u003cp\u003e“Really, Crisco? What was your first clue?”\u003c/p\u003e\n\u003cp\u003e“Say we saw them, right here, right now, coming down to finish us off. What would you do?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Ask them to kill you first. What’s the point, Crisco?”\u003c/p\u003e\n\u003cp\u003e“Are you a virgin?” he asked suddenly.\u003c/p\u003e\n\u003cp\u003eI stared at him. He was totally serious. But most thirteen-year-old boys are when it comes to hormonal issues.\u003c/p\u003e\n\u003cp\u003e“Screw you,” I said, and brushed past him, heading back toward the camp.\u003c/p\u003e\n\u003cp\u003eBad choice of words. He trotted after me and not one strand of plastered-down hair moved as he ran. It was like a shiny black helmet.\u003c/p\u003e\n\u003cp\u003e“I’m serious, Cassie,” he puffed. “These are the times when any night could be your last night.”\u003c/p\u003e\n\u003cp\u003e“Dork, it was that way before they came, too.”\u003c/p\u003e\n\u003cp\u003eHe grabbed my wrist. Tugged me around. Pushed his wide, greasy face close to mine. I had an inch on him, but he had twenty pounds on me.\u003c/p\u003e\n\u003cp\u003e“Do you really want to die without knowing what it’s like?”\u003c/p\u003e\n\u003cp\u003e“How do you know I don’t?” I said, yanking free. “Don’t ever touch me again.” Changing the subject. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-5th-wave-the-5th-wave-1/page-9.html","bookId":1642,"creation":"Oct 5, 2019 6:33:41 PM","modification":"Oct 5, 2019 6:33:41 PM"}
