{"id":67030,"no":21,"title":"Page 21","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I’m sure there’s a door here—if you help me, we can find it.” She was moving up and down and around, running her fingers all along the wall like some kind of expert at finding hidden doorways. It hadn’t slipped past him that she’d been vague about her ability to read the book. She certainly appeared to be reading it. Why would she lie?\u003c/p\u003e\n\u003cp\u003eIn the end, it was a small hidden panel that tripped the switch. A door slid open, revealing a yawning tunnel of metal. Dim yellow recessed lights studded the ceiling in a line disappearing out of sight. Marina was already moving down the hallway, and Gabe didn’t bother to warn her about a potential hazard. But he did pull his Colt from its holster once again.\u003c/p\u003e\n\u003cp\u003eAlthough Gabe had fairly well guessed that the tunnel was heading toward Lake Superior, when it finally ended, a surprise awaited. Another door slid open, and he and Marina stepped into what could only be called a fish bowl. He and Marina being the fish.\u003c/p\u003e\n\u003cp\u003eAll three sides of the chamber were made of glass, or some heavy duty plastic. The dark green waters of the depths of Lake Superior surged against the walls, covering them to the ceiling, and, as Gabe realized, likely well above the ceiling. They were in an underwater chamber.\u003c/p\u003e\n\u003cp\u003eAn antechamber to some type of underwater craft that was missing.\u003c/p\u003e\n\u003cp\u003e-20-\u003c/p\u003e\n\u003cp\u003eJuly 8, 2007\u003c/p\u003e\n\u003cp\u003eAllentown, Pennsylvania\u003c/p\u003e\n\u003cp\u003e“What the hell is this?” Vince Bruger snapped, looking at a lump of black metal sitting on his desk. A long, metal rod crossed over a messy stack of files. Dirt clung to each end. A young woman dressed in blues, with a shiny badge and a name plate that read BURNETT, startled to her feet.\u003c/p\u003e\n\u003cp\u003e“All right, Dr. Everett. I should be at your house in less than an hour.” Walking in Bruger’s footsteps, Helen Darrow flipped her cell phone shut with a flick of her thumb as she entered the chief’s office. She glanced at wide-eyed Officer Burnett who looked like she’d just gotten out of the Academy. Yesterday. Maybe this morning.\u003c/p\u003e\n\u003cp\u003e“We found this approximately five miles from the epicenter of the earthquake,” Burnett explained. “Knew Agent Darrow was going to be here and figured she’d want to see it.”\u003c/p\u003e\n\u003cp\u003e“On my desk?”\u003c/p\u003e\n\u003cp\u003eHelen had to give the newbie credit. Even though Bruger looked like he wanted to jump down her throat, Burnett’s response came out smooth and steady. And loud enough to be heard.\u003c/p\u003e\n\u003cp\u003eHelen stepped toward the desk, her fingers tingling; a sure sign that something was about to give. The last time she’d had that powerful feeling, that singing, twitching in her fingertips, she’d apprehended Mad Melia, a nurse who liked to help her patients into their afterlife earlier than their maker intended, after nearly missing her hiding in the back of a Jeep Cherokee. A woman’s instinct, she had learned, was never to be ignored.\u003c/p\u003e\n\u003cp\u003eAt last. Something.\u003c/p\u003e\n\u003cp\u003eJust the kind of thing she’d been hoping for.\u003c/p\u003e\n\u003cp\u003eAfter her conversation two days earlier with Dr. Everett, Helen had been convinced that he was right—the earthquakes were no quakes at all, but underground explosions. So she’d had to turn her team’s attention to finding out how they’d been caused.\u003c/p\u003e\n\u003cp\u003eShe and Bruger poked at the box and the long rod. A small screen and two dials were the only break on the smooth metal surface of the box. No other markings or identification at first glance.\u003c/p\u003e\n\u003cp\u003e“This could be a drill of some kind. Like they use for oil.” She looked at her watch. “I’m going to have to leave for my meeting with Everett right now. I’ll have Mingo start looking at these in the mean time; but I’ll see if Everett will take a look and confirm whether they’d be used for this kind of operation.”\u003c/p\u003e\n\u003cp\u003eBruger growled his agreement. The poor man looked like she felt: dead tired and stressed. But Helen at least had the advantage of makeup to hide her secrets.\u003c/p\u003e\n\u003cp\u003eMoments later she was off on the highway, heading northeast from Allentown over the state border into Jersey.\u003c/p\u003e\n\u003cp\u003eWhen she reached his home, Dr. Everett was pruning his rosebushes. Helen had only spoken to the man twice, but each time he’d managed to mention two topics unrelated to the geological discussion at hand: his wife Darlene, who obviously ran the roost, and his fifty-three rose bushes. And their fifty different hues. She wondered which ones were duplicates, but decided to keep that thought to herself.\u003c/p\u003e\n\u003cp\u003e“Agent Darrow! It’s a pleasure to see you again.” He put the clippers down and gestured to a round table and a set of wicker chairs under a tilted umbrella. The fragrance of rose was in the air; not surprising because the bushes created a half-circle of pink, magenta, yellow, and crimson around the patio.\u003c/p\u003e\n\u003cp\u003e“Dr. Everett. Thank you for meeting with me. I had originally intended to talk with you in more detail about your experience in Nevada, as you’d mentioned it; but now I have even more specific questions. And something to show you.”\u003c/p\u003e\n\u003cp\u003e“Please. Ask away. Darlene will be bringing some lemonade and iced tea—she was peering out the window when you drove up.”\u003c/p\u003e\n\u003cp\u003eIt was almost too quaint, too cute, Helen thought. The half-retired geology professor and his love of gardening, and the bustling, grandmotherly wife who would bring them lemonade, iced tea, and, if the cliché rang through, a plate of cookies. She was hoping for oatmeal raisin.\u003c/p\u003e\n\u003cp\u003eBut before she had the chance to tell Dr. Everett what they’d found, the screen door slammed and a tall, slender, gorgeous woman of no more than forty hurried down the steps. No grandmotherly type here.\u003c/p\u003e\n\u003cp\u003e“Hi, you must be Agent Darrow. I’ve got something to drink for you, but I can’t stay and chat because I’ve got to run to the store. I just ran out of blue paint!” The youngish woman, only a few years older than Helen, had pale dots of blue all over her hands and bare legs. She dropped the tray quickly, and none-too gently on the table in front of them, planted a kiss on her husband’s bare forehead, and hurried off, keys jangling.\u003c/p\u003e\n\u003cp\u003e“What was that?” Helen couldn’t help but say, reaching for a glass filled with ice. Lemonade and iced tea, combined, was one of her weaknesses.\u003c/p\u003e\n\u003cp\u003eDr. Everett laughed. “She never stops. She was one of my students, way back when, and … well, you can imagine the problems we had, especially twenty years ago! Anyway, Agent Darrow, I know you must be very busy. Please, tell me what you’ve found.”\u003c/p\u003e\n\u003cp\u003e“Well, you’d told me that in order to create an underground explosion, somehow the explosive needed to be put under the area.”\u003c/p\u003e\n\u003cp\u003eHe was nodding as he gulped half a glass of lemonade. When he took the glass away from his mouth, he said, “Yes, and that was the problem. Any equipment that could be used to dig under the ground, or drill, as we would say, would be so large as to be noticeable. In fact, we often use directional drilling when digging for oil, and those rigs are even larger. Let me explain directional drilling.\u003c/p\u003e\n\u003cp\u003e“There’s a bit on the end of a long string of pipe that drills the hole. Once they reach the desired depth, the drillers use pressure to direct the angle of the hole horizontally. So they drill down, and then over to the location they need to be.\u003c/p\u003e\n\u003cp\u003e“But as I told you on the phone, these are large machines and the rigs certainly couldn’t be carted into an area and used without being noticed.”\u003c/p\u003e\n\u003cp\u003eHelen’s hopes fell. The metal rod they’d found couldn’t have been used for something so heavy-duty. “So these machines can drill at an angle, underground. And they could drill deep. How far away from the site could they be?”\u003c/p\u003e\n\u003cp\u003e“Definitely, they can drill deep. And with present technology, the bottom hole location could be several hundred feet, or even up to a couple of miles, away from the surface location. But what have you found?”\u003c/p\u003e\n\u003cp\u003e“I thought we might have found the drill, but it’s very small.”\u003c/p\u003e\n\u003cp\u003e“Excellent!”\u003c/p\u003e\n\u003cp\u003e“It’s very small, though. Very small. It’s only six inches in diameter. And eight feet long.” She waited. Was her theory possible?\u003c/p\u003e\n\u003cp\u003e“That’s too small. A drill of that size couldn’t … well, I should not say couldn’t, should I? I suppose it’s conceivable … .if the material was right. But … .”\u003c/p\u003e\n\u003cp\u003e“This is the best part. We think it was remotely controlled by someone on the surface. Set into the ground to dig, and directionally controlled as it burrowed into the ground, miles away, to where the explosive detonated. We have a box that could be the controller.”\u003c/p\u003e\n\u003cp\u003e“Incredible. Impossibly incredible! Could I see it? I would love to see it and examine it.”\u003c/p\u003e\n\u003cp\u003e“Yes. I’d like your opinion as to whether my theory is plausible, and whether the equipment we found is capable of digging down through the earth’s crust at that distance.”\u003c/p\u003e\n\u003cp\u003eEverett had drained a second glass of lemonade, and now he muffled a gentle belch. “Excuse me.” He rubbed his hands gleefully. “When can we go? But, wait … .the size of the explosives. In order to create an earthquake of that magnitude, it would have to be a very powerful explosive. Based on what occurred in Nevada, the explosive would have to be huge.”\u003c/p\u003e\n\u003cp\u003e“Yes, indeed. That’s the next phase. We think we know how they got it down there; but how they made the explosives so powerful … we’ll need to investigate. Is there anyway we could get to the explosion site, there underground, to see what actually happened?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so, my dear. If any caves or caverns exist at that depth, which I doubt, they would have been destroyed by the explosion.\u003c/p\u003e\n\u003cp\u003e“And there is one other consideration.” Dr. Everett’s face settled in to serious lines. “There would have to be very loud noises during the drilling. People would hear it. We’d see it. Unless … well, perhaps if the drill is small enough to do what we think it did, perhaps … perhaps they had a way to drill without causing loud noises. If this is the case, then whoever did this is far advanced in directional drilling.”\u003c/p\u003e\n\u003cp\u003eJust then Helen’s cell phone buzzed against her thigh. She snapped it off its holder and checked the number. “Excuse me, Dr. Everett. This is my boss and I need to take it.” She opened the phone. “Darrow here.”\u003c/p\u003e\n\u003cp\u003e“Helen. New development on the AvaChem case: Barbara Melton was just found dead at her home in Baltimore.” \u003c/p\u003e","sourceLink":"https://allnovel.net/siberian-treasure/page-21.html","bookId":2353,"creation":"Oct 5, 2019 10:03:32 AM","modification":"Oct 5, 2019 10:03:32 AM"}
