{"id":86377,"no":22,"title":"Page 22","content":"\u003cp\u003e“Not really.” Dismissing Reyes because he can’t help her cause, Elena stands next to Carlos’s plate and reaches out to take a bite of his taquito. “I forgot to welcome you home, Carlos. How’s your leg?”\u003c/p\u003e\n\u003cp\u003e“I got to be honest, Elena,” Carlos says as she kisses him on the cheek and leaves a big red lipstick mark. “Since you came in, I haven’t felt any pain. You’re more entertainin’ than television, and more effective than Vicodin.”\u003c/p\u003e\n\u003cp\u003eShe takes her attention off of Carlos and focuses on me. I moan as she takes my cheek and squeezes it between her fingers. “I love you Fuentes boys like you were my own. Mwah!”\u003c/p\u003e\n\u003cp\u003eShe comes in close. I can clearly see a stray chin hair she needs to pluck, and her strong perfume burns my nostrils.\u003c/p\u003e\n\u003cp\u003eHer lips start to pucker and I cringe. “Please don’t get lipstick on me.”\u003c/p\u003e\n\u003cp\u003e“Oh, you know you love it,” she responds. I try to shield my face, but she plants a wet one on my cheek with her big lips.\u003c/p\u003e\n\u003cp\u003e“Did she get me bad?” I ask Alex.\u003c/p\u003e\n\u003cp\u003eAlex cocks his head to the side, analyzing the mark. “Yeah. She got you good, bro.”\u003c/p\u003e\n\u003cp\u003eAlex doesn’t wait for Elena to make her mark on him. Instead, I watch as he opens his arms out wide for a hug. When she goes to kiss him, he ducks and plants one on her cheek.\u003c/p\u003e\n\u003cp\u003e“You’re sneaky,” she says, wagging her finger. “If you ever cheat on Brittany, I’ll seriously cut your dick off.”\u003c/p\u003e\n\u003cp\u003e“You’d have to get in line behind Brittany if that ever happened. Listen, Elena, I’ll call Jorge and see what’s up. He’s not havin’ an affair.”\u003c/p\u003e\n\u003cp\u003e“Anyone home?” Jorge’s voice echoes through the house.\u003c/p\u003e\n\u003cp\u003eMy chair scrapes the floor as I make a quick move to help Alex restrain Elena so she doesn’t go all ape shit on Jorge. When Reyes wants to get involved, I hold a hand up to stop him.\u003c/p\u003e\n\u003cp\u003e“This is normal,” I tell him.\u003c/p\u003e\n\u003cp\u003e“For who?” he responds.\u003c/p\u003e\n\u003cp\u003e“I wasn’t cheatin’ on you,” Jorge says, looking like a mess. “Nina wanted someone to talk to after she broke up with her boyfriend, that’s all. Stop actin’ like a jealous wife.”\u003c/p\u003e\n\u003cp\u003e“I’m not jealous,” Elena cries out, clawing through us to get to him. “Culero, get a clue. When an ex-girlfriend wants to talk to you, that’s code for ‘I want you back.’ ”\u003c/p\u003e\n\u003cp\u003eThe doorbell rings again.\u003c/p\u003e\n\u003cp\u003e“I’ll get it,” Alex says. I’m not paying attention until his loud, commanding voice carries across the house, saying, “Luis, you have a visitor.”\u003c/p\u003e\n\u003cp\u003e26\u003c/p\u003e\n\u003cp\u003eNikki\u003c/p\u003e\n\u003cp\u003eI stood outside Luis’s house for a few minutes before I got up the nerve to ring the bell. They’re obviously having a party. I can see a house full of people through the front window.\u003c/p\u003e\n\u003cp\u003eAlex answered the door. He knows who I am. Every few months my parents invite him and his wife and son to our house for dinner or Sunday brunch. He calls Luis to the door and my heart pounds in anticipation.\u003c/p\u003e\n\u003cp\u003eLuis comes to the door with a big red lipstick mark on his cheek. “What are you doing here?” he asks, his voice tense. He’s obviously not happy to see me.\u003c/p\u003e\n\u003cp\u003e“Come on in,” Alex says, putting his arm around me and urging me inside.\u003c/p\u003e\n\u003cp\u003e“You still got that lipstick crap on your face, bro,” Alex mumbles to Luis as we pass him.\u003c/p\u003e\n\u003cp\u003eLuis curses, then starts wiping his cheek vigorously. “My cousin likes to mark us,” he explains. “It’s kind of an unnecessary and annoyin’ tradition.”\u003c/p\u003e\n\u003cp\u003eI pass a police officer standing next to Luis’s mom. Carlos is here, too, along with another couple. The couple must be having a heated argument, because they don’t look happy with each other.\u003c/p\u003e\n\u003cp\u003eCarlos points to me. “Is this the girl?” he asks Luis. “The one from the poem.”\u003c/p\u003e\n\u003cp\u003e“What poem?” I ask, suddenly curious.\u003c/p\u003e\n\u003cp\u003e“There is no poem,” Luis insists. “My brother is delusional from the pain meds he’s on. Don’t listen to him.”\u003c/p\u003e\n\u003cp\u003e“Are you okay?” I ask Carlos.\u003c/p\u003e\n\u003cp\u003eCarlos lifts up his pant leg, revealing a nasty cut stitched together with a row of staples traveling from his thigh all the way down to his calf. “This is proof that freedom ain’t free.”\u003c/p\u003e\n\u003cp\u003e“Ouch. How did it happen?” I ask, cringing. Just looking at it is painful.\u003c/p\u003e\n\u003cp\u003e“Shrapnel from an IED.” He narrows his eyes at me. “You Mexicana?”\u003c/p\u003e\n\u003cp\u003e“Carlos!” his mom calls out in a scolding tone.\u003c/p\u003e\n\u003cp\u003e“Seriously, bro, shut up,” Luis says.\u003c/p\u003e\n\u003cp\u003eCarlos holds up his hands in surrender. “What, it’s a crime to ask a girl if she’s Mexican?”\u003c/p\u003e\n\u003cp\u003e“No. It’s just rude,” Luis says.\u003c/p\u003e\n\u003cp\u003eCarlos laughs heartily. “Bro, when have you known me not to be rude?”\u003c/p\u003e\n\u003cp\u003eI answer Carlos, “I’m American more than Mexican. Does it matter?”\u003c/p\u003e\n\u003cp\u003e“Only if you deny your heritage. Don’t want to dilute the culture, you know.”\u003c/p\u003e\n\u003cp\u003e“Carlos is one to talk,” Alex chimes in. “His girlfriend is as white as they come.”\u003c/p\u003e\n\u003cp\u003e“Are you kiddin’, Alex? Have you looked at your lily-white wife lately?” Carlos argues playfully.\u003c/p\u003e\n\u003cp\u003e“Hey,” Alex says. “Before you rip on white people, you might want to remember that your nephew is half white.”\u003c/p\u003e\n\u003cp\u003e“Not the half that counts,” Carlos says proudly. “Listen, I’m an American and fight for this country, but that don’t mean I ignore my Mexican heritage like it’s somethin’ to be ashamed of.”\u003c/p\u003e\n\u003cp\u003e“I’m not ashamed of it,” I say. “I don’t know Spanish or walk around waving a Mexican flag. I’m not going to fake it, when I don’t know much about it.”\u003c/p\u003e\n\u003cp\u003e“It’s not too late to learn,” Carlos says.\u003c/p\u003e\n\u003cp\u003e“Luis, are you going to introduce me to your friend?” his mother cuts in.\u003c/p\u003e\n\u003cp\u003eLuis hesitates, so I step forward. “I’m Nikki,” I say with a smile.\u003c/p\u003e\n\u003cp\u003e“Nikki Cruz,” Alex says. “Dr. Cruz’s daughter.”\u003c/p\u003e\n\u003cp\u003e“Ah, I remember you.” She tilts her head, deep in thought. “Weren’t you at Alex’s wedding?” I silently pray she doesn’t mention that I kneed Luis’s nuts on the dance floor. That’s an incident I’d rather not dredge up right now.\u003c/p\u003e\n\u003cp\u003eCarlos isn’t going to let this one slip by. He perks up. “Oh, yeah! Nikki, weren’t you the one who kicked Luis in the—”\u003c/p\u003e\n\u003cp\u003e“Nikki goes to Fairfield,” Luis explains. “We’re in chemistry class together.”\u003c/p\u003e\n\u003cp\u003eSo now everyone is silent, waiting for me to talk. I turn to Luis and mumble quietly, “Can we talk?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Follow me.” I follow him through the kitchen and out the back door. “All right,” he says. “Talk.”\u003c/p\u003e\n\u003cp\u003eI clear my throat and look up at the sky, knowing that Luis wants to go up there one day. Will he pursue his dreams, or has he changed his plans? “I was thinking about what you said in chemistry today. You know, the part about me judging you before I had all the facts. Well, after thinking about it … you were right.”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “It doesn’t really matter.”\u003c/p\u003e\n\u003cp\u003e“It does to me,” I say.\u003c/p\u003e\n\u003cp\u003e“Why? You’ve made up your mind about me.” He gives a short laugh. “Everyone has.”\u003c/p\u003e\n\u003cp\u003e“Tell me right now you’re not dealing drugs and I’ll believe you. Look in my eyes and tell me the truth.”\u003c/p\u003e\n\u003cp\u003eHe looks me straight in my eyes. “I’m not a dealer,” he says, his gaze not faltering one bit. “The drugs weren’t mine. I’m not Marco, so stop puttin’ both of us in the same category.”\u003c/p\u003e\n\u003cp\u003e“You’re friends with him.”\u003c/p\u003e\n\u003cp\u003e“I’m also friends with Derek. Listen, I don’t know what the hell happened between you and Marco. To be honest I don’t really want to know, ’cause if I did I’d probably want to kick the shit outta him.”\u003c/p\u003e\n\u003cp\u003e“I don’t need you to protect me.”\u003c/p\u003e\n\u003cp\u003e“What if I want to?” I watch as he looks up at the sky and stares at the stars. “Damn, Nik, you have no clue what crazy thoughts have been runnin’ through my head since we were on Derek’s boat, and then after hookin’ up Saturday night … You want to ignore what happened, but I can’t.”\u003c/p\u003e\n\u003cp\u003e“The truth is, I can’t, either.” I swallow the lump forming in my throat. “I have to know if you’re in the LB, because if you are I can’t do this.”\u003c/p\u003e\n\u003cp\u003e“Look at me,” he says. When I do he sighs. “I’m not a gangbanger, Nik.”\u003c/p\u003e\n\u003cp\u003e“You were right to call me out. I wanted to think the worst about you, because if I did I could ignore the connection I feel when we’re together. It’s like I get you, and you get me, and then Saturday night when we were alone in the pool house—”\u003c/p\u003e\n\u003cp\u003e“You said it was fun.”\u003c/p\u003e\n\u003cp\u003e“I told you it was fun just to throw you off. Hunter once told me most guys can screw a girl they love just as easily as they can have a one-night stand. Marco was the last guy I dated, and he practically destroyed my heart and soul and everything in between. It was more than fun Saturday night, Luis. I need to know if you think we can make it work.”\u003c/p\u003e\n\u003cp\u003e“Wow. The way my week has been goin’, that’s the last thing I expected to hear.” Luis runs a hand through his hair. I can sense the stress radiating off him. “My life is so fuckin’ complicated right now.”\u003c/p\u003e\n\u003cp\u003e“Sorry,” I say. “I don’t mean to complicate things more.” I focus on the ground because I don’t want to see his face when he tells me that I’m delusional.\u003c/p\u003e\n\u003cp\u003e“It’s not your fault.” He takes a deep breath, then slowly lets it out. “Nik, I gotta be honest. I don’t know if it’s a good idea to get involved with me right now.”\u003c/p\u003e\n\u003cp\u003e“I get it,” I say. “You don’t have to explain.” He hadn’t tried to hide the fact he was a player from the second I met him. I was stupid to think getting closer to him and feeling a connection meant I’d suddenly changed him.\u003c/p\u003e\n\u003cp\u003e“No, you don’t get it.” The sides of his lips turn up in a small smile. My breath hitches when he reaches out and slides his hand to the back of my neck and urges me to look at him. “I don’t want to be with anyone else, mi chava. I want you to be my girlfriend.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Yeah, really.”\u003c/p\u003e\n\u003cp\u003eHis words soothe my increasing doubts. “I don’t want to be with anyone else either,” I say.\u003c/p\u003e\n\u003cp\u003eI haven’t wanted to let anyone get close to me, but that was before Luis came back into my life. Maybe this push-pull thing is us trying to figure out where we stand. Times have changed, I’ve changed, and I’m ready to put the past behind me.\u003c/p\u003e\n\u003cp\u003eA moment passes and I feel a sense of peace cover me like a blanket. I hope he doesn’t see tears threatening to fall from my eyes.\u003c/p\u003e\n\u003cp\u003e“Come here,” he says, pulling me close. “You’re shaking.”\u003c/p\u003e\n\u003cp\u003eI close my eyes and a tear falls down my cheek. Luis has managed to slice right through my invisible protective armor and I feel so vulnerable. “I’m scared.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chain-reaction-perfect-chemistry-3/page-22.html","bookId":2769,"creation":"Oct 5, 2019 5:13:53 PM","modification":"Oct 5, 2019 5:13:53 PM"}
