{"id":86384,"no":30,"title":"Page 30","content":"\u003cp\u003eHe raises an eyebrow when the L word escapes from my lips.\u003c/p\u003e\n\u003cp\u003eOops. That was not supposed to happen.\u003c/p\u003e\n\u003cp\u003e“I didn’t mean love as in the ‘I love you’ kind of way,” I’m quick to point out, then slap my hand over my face to hide my embarrassment.\u003c/p\u003e\n\u003cp\u003eHe sits up and gently nudges my hand down. “Don’t worry, mi chava,” he says, then winks at me. “I know what you meant. Listen, you don’t know what my brothers went through. They did what they needed to do. Don’t judge them. You don’t know what it’s like to be us … to be poor and live in the middle of a street war. You never had to live with drive-bys and watchin’ your best friend die in your arms. It sucks.”\u003c/p\u003e\n\u003cp\u003e“You’re right, I can’t imagine what it’s like. I’m just glad you’re not a part of it.”\u003c/p\u003e\n\u003cp\u003eHe nods, then spends the rest of the time working while I watch.\u003c/p\u003e\n\u003cp\u003e“Can I help you?” I ask. “I feel bad just sitting here while you’re working.”\u003c/p\u003e\n\u003cp\u003eHis hand appears from under one of the cars. “Hand me the oil filter wrench.”\u003c/p\u003e\n\u003cp\u003eI look at the tools laid out. Umm … they all look the same to me. I look back at his waiting hand. “You stumped me.”\u003c/p\u003e\n\u003cp\u003eI hear him laugh. “Sorry. It’s the thing that looks like a claw with red rubber handles.”\u003c/p\u003e\n\u003cp\u003eConsidering there’s only one thing with red rubber handles, I have a pretty good idea which one it is. I pick it up and place it in his waiting hand.\u003c/p\u003e\n\u003cp\u003eWhen he’s finished, he slides back out. “You remind me of my sister-in-law. She knows shit about cars, except how to put the key in the ignition.”\u003c/p\u003e\n\u003cp\u003eI raise my hand. “I know how to do that.”\u003c/p\u003e\n\u003cp\u003e“Please tell me your dad at least taught you how to change a tire.”\u003c/p\u003e\n\u003cp\u003e“I don’t have to know how to change a tire.” I reach into my purse and pull out the handy card I always carry with me for those types of emergencies. “My dad got me a Triple-A membership for that.”\u003c/p\u003e\n\u003cp\u003eHe rolls his eyes. “You should know how to change a tire. Remind me to teach you one day.”\u003c/p\u003e\n\u003cp\u003eWe spend the rest of the time talking. It’s scary. The more I know about Luis, the more I like him. We’re so totally different, but I get him. We never run out of stuff to talk about, and even when there’s a lull in the conversation it’s not awkward.\u003c/p\u003e\n\u003cp\u003e“Would you ever consider applyin’ to Purdue?” he asks me when he’s underneath the fourth car in line for an oil change.\u003c/p\u003e\n\u003cp\u003eHe already told me that’s his first choice of schools. “I don’t know. It wasn’t on my top ten list. Why?”\u003c/p\u003e\n\u003cp\u003e“I thought maybe, you know, if you and I were still …” His voice drops off. “Forget it, Nik. I think I’ve breathed in too many oil fumes.”\u003c/p\u003e\n\u003cp\u003eIf we’re still together by the end of the year, it would be great if we could go to the same college. I feel so close to Luis right now, and we’re growing closer every day. I have to remind myself not to get sucked in.\u003c/p\u003e\n\u003cp\u003eI need to tell him how I feel.\u003c/p\u003e\n\u003cp\u003eI tap on his knee. “I think we’re getting too serious.”\u003c/p\u003e\n\u003cp\u003e“You’re a pessimist,” he says, rolling out from under the car again. “Have some faith.” He pulls me down to him and caresses my back. I can feel the warmth of his hands penetrate through my shirt. “I have dirty hands,” he says. “Your shirt is probably ruined.”\u003c/p\u003e\n\u003cp\u003eThe sound of footsteps coming toward us makes us part.\u003c/p\u003e\n\u003cp\u003e“What’s up, man,” Marco says. He’s standing with a huge scary-looking guy.\u003c/p\u003e\n\u003cp\u003eI clutch Luis’s bicep tightly.\u003c/p\u003e\n\u003cp\u003e“You gonna introduce me to your friend?” the scary guys asks.\u003c/p\u003e\n\u003cp\u003eI can feel Luis’s bicep flex. “Nikki, this is Chuy. He’s a buddy of mine.”\u003c/p\u003e\n\u003cp\u003eChuy puts his cigar in the side of his mouth and stares at me long and hard. It makes me feel like he’s assessing my value. “You go to Fairfield High?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I’ve never seen you around before.”\u003c/p\u003e\n\u003cp\u003e“She lives on the other side of town,” Marco chimes in. “Right, Nik?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“Listen, guys,” Luis says. I sense that he’s deliberately taking the focus off of me. “If you’re lookin’ for Enrique, last I saw he was in the garage.”\u003c/p\u003e\n\u003cp\u003e“I’m not lookin’ for Enrique,” Chuy says. “I was lookin’ for you, Fuentes. I’ve got a task for you.”\u003c/p\u003e\n\u003cp\u003eI feel my heart stop beating as I realize what’s happening.\u003c/p\u003e\n\u003cp\u003eLuis has been recruited into the LB.\u003c/p\u003e\n\u003cp\u003e35\u003c/p\u003e\n\u003cp\u003eLuis\u003c/p\u003e\n\u003cp\u003eNikki’s shocked face when Chuy said he was looking for me says she knows what Chuy’s visit is all about. She picks up her backpack and purse off the ground. “I need to go home. Now.”\u003c/p\u003e\n\u003cp\u003e“What are you in a hurry for?” Chuy asks. “You have a problem with me talkin’ with your boyfriend?”\u003c/p\u003e\n\u003cp\u003e“No, she doesn’t. Let’s talk inside,” I tell him. Damn. The last thing I want is Nikki to start asking questions again.\u003c/p\u003e\n\u003cp\u003eChuy takes his time as he disappears into the shop. Marco falls in line behind him.\u003c/p\u003e\n\u003cp\u003eI turn to Nikki. “I’ll be right back,” I tell her. “It’s not what you think.”\u003c/p\u003e\n\u003cp\u003eShe’s looking at me as if I’m a stranger, not her boyfriend. “I want to go home.”\u003c/p\u003e\n\u003cp\u003e“I’ll take you in a minute. Just … stay here,” I say. “Please.”\u003c/p\u003e\n\u003cp\u003eI walk inside, anxious to get rid of Chuy and Marco. “Where did Chuy go?” I ask Enrique. Isa is still here, talking to him as he works on her car.\u003c/p\u003e\n\u003cp\u003e“In my office,” Enrique says. He can’t say anything against Chuy because of his unwavering loyalty and honor he pledged to the Latino Blood a long time ago.\u003c/p\u003e\n\u003cp\u003eChuy is sitting at Enrique’s desk, like it’s his own. Marco is standing next to him like a bodyguard.\u003c/p\u003e\n\u003cp\u003eI close the door just in case Nikki decides she wants to listen in on our conversation. “All right, what’s goin’ down?”\u003c/p\u003e\n\u003cp\u003eChuy taps his ash right on Enrique’s desk. “This guy owes me five Gs. I need you and Marco to collect it. Tonight.”\u003c/p\u003e\n\u003cp\u003eHe reaches into his back pocket and pulls out a piece of paper. I scan the address. Augusta Lane. “That’s deep in Fremont 5 territory,” I tell him.\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003eAll I can think about is the look of betrayal on Nikki’s face as I left her by the car outside. “I can’t go into F5 territory without gettin’ my head blown off,” I blurt out.\u003c/p\u003e\n\u003cp\u003e“Yes, you can. And yes, you will.” He gestures to the door. “That honey of yours out there looks real nice. I could use a hot chick like that to sell for me over at DePaul. The college boys love to buy from pretty girls. Ain’t that right, Marco?”\u003c/p\u003e\n\u003cp\u003eMarco nods. “That’s right. Mariana’s makin’ a killin’ over there.”\u003c/p\u003e\n\u003cp\u003eThis is bullshit. “Nikki’s off limits,” I say, loud and clear so there’s no mistaking that she’s never to be thought of as an asset to the LB. I’ll be damned if I drag Nikki into the LB.\u003c/p\u003e\n\u003cp\u003e“It’s time I let you in on a little secret,” Chuy says, sitting up now. “There’s a safety-deposit box at Chicago Community Bank with your name on it. Once you turn eighteen, you have access to it. I’ve got the key.” He pulls out a shiny silver key from his pocket and slides it over to me. “After your birthday you’re gonna get me whatever’s in that box. You come back from the F5 tonight and show me that you can handle the heat. Loyalty, Luis. You have to earn it, then you reap the benefits.”\u003c/p\u003e\n\u003cp\u003eI pick up the key and put it in my back pocket. “Who put it in my name?”\u003c/p\u003e\n\u003cp\u003e“That’s not important. What’s important is you provin’ your loyalty.” He lets out a stream of smoke. “You do this, and you’ll see more money than you ever dreamed of, kid.”\u003c/p\u003e\n\u003cp\u003eMarco follows Chuy out of the office. I step in front of him before he reaches the door. “What do you have to do with this, Marco?” I ask him.\u003c/p\u003e\n\u003cp\u003e“I just follow rules.”\u003c/p\u003e\n\u003cp\u003e“That’s what you want to be, a follower?”\u003c/p\u003e\n\u003cp\u003e“I’ve got no other choice, and neither do you. This is big, Luis. I know it. Chuy knows it. It’s about time you get with the program.” He pushes past me. “The sooner you break it off with Nikki, the better. She’ll just complicate things. I’ll meet you at the warehouse in an hour.”\u003c/p\u003e\n\u003cp\u003eAfter he leaves, I scan the piece of paper with the address on it once more. My nerves are about to snap.\u003c/p\u003e\n\u003cp\u003eNikki is waiting for me in the garage, talking to Isa. I don’t want to lie to her any more than I already have, but I don’t want to risk losing her.\u003c/p\u003e\n\u003cp\u003e“Hey,” I say as I walk up to her.\u003c/p\u003e\n\u003cp\u003e“Take me home, Luis,” she orders. “I should have known not to trust you.”\u003c/p\u003e\n\u003cp\u003e36\u003c/p\u003e\n\u003cp\u003eNikki\u003c/p\u003e\n\u003cp\u003eTrust. He begged for my trust, when all along he was affiliating himself with the Latino Blood … with Marco. My heart isn’t melting. It’s breaking.\u003c/p\u003e\n\u003cp\u003eI storm outside and straddle the back of his motorcycle.\u003c/p\u003e\n\u003cp\u003e“Let me explain,” Luis says. I shake my head, unwilling to listen. My suspicions were right all along. “It’s not what you think.”\u003c/p\u003e\n\u003cp\u003eLove. Is it just a word boys use to manipulate girls?\u003c/p\u003e\n\u003cp\u003e“I don’t want to listen to anything you have to say,” I tell him. “If you won’t take me home, I’ll walk.”\u003c/p\u003e\n\u003cp\u003eI start to get off the bike. He curses under his breath, then says, “You don’t have to walk. I’ll take you home.”\u003c/p\u003e\n\u003cp\u003eI get on the bike again and grab the back instead of holding on to him. If I touch him, I could lose my nerve and let him explain away why everything points to him being a Latino Blood. I’m afraid I’ll believe him, because I want to believe him. It’s not what you think, he’d said.\u003c/p\u003e\n\u003cp\u003eHe pulls up to my driveway. “Nik,” he says as I hop off and head for the door. “Nik!”\u003c/p\u003e\n\u003cp\u003eI stop, but don’t turn around.\u003c/p\u003e\n\u003cp\u003e“You come from this rich family and live in this rich neighborhood. I don’t. Guys like Marco and Chuy … they’re my people.”\u003c/p\u003e\n\u003cp\u003e“I’m your people, too,” I murmur softly.\u003c/p\u003e\n\u003cp\u003e“Not in the same way.” I feel his hands on my shoulders. “I’m not a Latino Blood, Nikki.” He turns me around and holds out his arms. “See, I’m not marked. I’m not gonna say I’m not hangin’ with the Blood, but I’m not one of them.”\u003c/p\u003e\n\u003cp\u003e“I don’t want you hanging with them.”\u003c/p\u003e\n\u003cp\u003e“That’s like me tellin’ you not to hang with Kendall.”\u003c/p\u003e\n\u003cp\u003eHe’s right, even if I don’t want him to be. The Latino Blood has a presence on the south side of Fairfield where he lives.\u003c/p\u003e\n\u003cp\u003e“I don’t know, Luis,” I say, stepping away from him so I can think clearly. “I have a feeling you’re not telling me the whole truth. I need you, and I’m afraid you’re already a Blood.”\u003c/p\u003e\n\u003cp\u003e“I’m just hangin’ with them, that’s all.”\u003c/p\u003e\n\u003cp\u003e“I’ve been told that before. By Marco. We all know how that turned out.”\u003c/p\u003e\n\u003cp\u003e“Nikki, I’m not Marco. I’m not in the Blood. And I’m not gonna leave you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chain-reaction-perfect-chemistry-3/page-30.html","bookId":2769,"creation":"Oct 5, 2019 5:13:53 PM","modification":"Oct 5, 2019 5:13:53 PM"}
