{"id":86387,"no":33,"title":"Page 33","content":"\u003cp\u003eI’ve reached that point.\u003c/p\u003e\n\u003cp\u003e“Hey, amigo,” Marco says. I can tell by his bloodshot eyes that he’s completely wasted. “I thought you were goin’ out with your novia tonight.”\u003c/p\u003e\n\u003cp\u003e“She’s not my novia anymore.” I grab a beer and chug it. It’s cheap stuff, but I’m guessing it’ll do the job.\u003c/p\u003e\n\u003cp\u003e“Congratulations. You finally dumped the bitch.” He holds up his own can of beer in a congratulatory salute. “On to bigger and better.”\u003c/p\u003e\n\u003cp\u003e“Right.” I crush the first can in my hand and reach for another. Then another. By the time I’m on my fifth beer, I’m feeling damn good. Like I don’t give a shit about anyone, especially Nikki.\u003c/p\u003e\n\u003cp\u003eI need to tell her tonight was a mistake, and it’ll never happen again. I won’t give her the satisfaction of letting her think she hurt me. I pull out my cell and call her.\u003c/p\u003e\n\u003cp\u003e“Hey, Nik,” I say when she answers. “I’m with Marco.” I put my arm around my homie and say, “We were just tradin’ stories about you. Ain’t that right, amigo?”\u003c/p\u003e\n\u003cp\u003eMarco laughs. I know she can hear him. I’m being a complete pendejo and I’m making this up as I go along, but in my drunken state I don’t have a filter. She might as well have stabbed me in the heart.\u003c/p\u003e\n\u003cp\u003e“I’m hanging up,” she warns.\u003c/p\u003e\n\u003cp\u003e“No!” I yell into the receiver. “I need to say one more thing.”\u003c/p\u003e\n\u003cp\u003e“What?” she asks.\u003c/p\u003e\n\u003cp\u003eTime to be the asshole she thinks I am.\u003c/p\u003e\n\u003cp\u003eI concentrate on not slurring my words, but I don’t know if I’m successful. “I’m done with you.”\u003c/p\u003e\n\u003cp\u003eShe hangs up on me. My words hurt her. I know I’m gonna regret that call in the morning, but right now I’m flying high and don’t give a rat’s ass.\u003c/p\u003e\n\u003cp\u003eI stumble over to the cooler and grab another beer. By the time I finish it, I’m seeing double and I’m completely unable to think … about anything. I don’t even remember what I said to Nikki, or even if I really called her or if I just thought that I called her.\u003c/p\u003e\n\u003cp\u003e“Hey, Luis,” Mariana says, coming up to me. “You’re wasted.”\u003c/p\u003e\n\u003cp\u003e“Tell me somethin’ I don’t know.”\u003c/p\u003e\n\u003cp\u003e“Is there trouble in paradise?”\u003c/p\u003e\n\u003cp\u003eI shake my head and hold up the beer can. “This is my paradise.”\u003c/p\u003e\n\u003cp\u003e“I know what will get your mind off of Nikki.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Me.” She kisses me, and I’m too weak and too stupid drunk to think about pushing her away. She’s not what I want. She knows it, but she doesn’t care. I could close my eyes and pretend she’s Nikki … that would really prove I’m an asshole.\u003c/p\u003e\n\u003cp\u003eMariana leads me to a room off to the side. I sit on an old, beaten-up couch and she straddles me, but my body won’t cooperate—as if it knows what it wants and Mariana’s not it. “I’m in love with her,” I say, stopping Mariana before this goes any further.\u003c/p\u003e\n\u003cp\u003e“Why?” Mariana asks, annoyed.\u003c/p\u003e\n\u003cp\u003e“She’s my angel.”\u003c/p\u003e\n\u003cp\u003eMariana slides off me and heads for the door. “You don’t know what you’re missin’, Luis.”\u003c/p\u003e\n\u003cp\u003eYeah, I do. I’ve had one-night stands before … they’re all the same. With Nikki it matters … which is why tonight hurts so fucking bad.\u003c/p\u003e\n\u003cp\u003e“Sorry,” I tell Mariana.\u003c/p\u003e\n\u003cp\u003eShe doesn’t answer. Instead, she walks out and slams the door behind her.\u003c/p\u003e\n\u003cp\u003eIn the early morning, I wake up and realize that I fell asleep at the warehouse. Everyone is gone except for the few LBs that call this shithole their home.\u003c/p\u003e\n\u003cp\u003eMy head is spinning even before I manage to lift myself into a sitting position. I wonder if I look as shitty as I feel. Glancing down at the empty cans of beer beside me makes my stomach churn. I’m gonna puke.\u003c/p\u003e\n\u003cp\u003eI stumble outside and hurl until there’s nothin’ left. I’m so weak I can hardly stand.\u003c/p\u003e\n\u003cp\u003e“Rough night?” Chuy asks, coming up beside me.\u003c/p\u003e\n\u003cp\u003e“Sí.”\u003c/p\u003e\n\u003cp\u003e“I used to get fucked up like that when I was your age. Fun times, huh?”\u003c/p\u003e\n\u003cp\u003e“I’m not havin’ fun right now,” I tell him as another wave of nausea hits me.\u003c/p\u003e\n\u003cp\u003eHe laughs as I puke my guts out again. “You still got that key I gave you?”\u003c/p\u003e\n\u003cp\u003e“I haven’t had a chance to go to the bank,” I tell him. “Besides, I think I’m bein’ followed.”\u003c/p\u003e\n\u003cp\u003eHe laughs cynically. “I’m havin’ you followed, Luis. You’re valuable to me, and the Blood.”\u003c/p\u003e\n\u003cp\u003eI’ve got to watch my back even closer now, dammit.\u003c/p\u003e\n\u003cp\u003eChuy pats my back, hard enough to rattle my sensitive stomach. “All right, amigo. You get one more week and then I’ve got to put the pressure on. Consider this a warning. Go home,” he orders. “Alex and Carlos are there, but don’t tell them you were here.”\u003c/p\u003e\n\u003cp\u003e“How do you know where they are?”\u003c/p\u003e\n\u003cp\u003e“Haven’t you realized it by now, Luis?” Chuy says. “I’ve got eyes and ears everywhere. Hell, even when I was in the can I knew your every move. When you were in Colorado, I had my guys track you.”\u003c/p\u003e\n\u003cp\u003e“Why me?”\u003c/p\u003e\n\u003cp\u003e“When you’re ready to know, I’ll tell ya. Now get your sorry ass out of here.”\u003c/p\u003e\n\u003cp\u003eI walk through the door of my house, but can’t make it to the bathroom so I run back outside to puke in the bushes. I ignore the stares from my family as I stumble through the house and head straight for my bedroom. Sleep. All I need is sleep. I fall facedown onto my mattress.\u003c/p\u003e\n\u003cp\u003e“Luis!” mi\u0027amá says from the doorway. She’s pissed, and I’m not in the mood to hear her yell at me. “Where were you? I’ve been calling you all night, without an answer. What’s the use in having a cell phone if you refuse to answer it for your own mother?” She narrows her eyes at me. “What’s wrong with you? Are you on drugs, Luis?”\u003c/p\u003e\n\u003cp\u003eOut of the corner of my eye I think I just saw her cross herself. If she starts lighting the memorial candles and begins praying to Papá, I’m seriously going to lose it.\u003c/p\u003e\n\u003cp\u003e“I was drunk,” I tell her. “And now I’m hungover. Answerin’ your call would’ve killed the buzz, so I ignored it.”\u003c/p\u003e\n\u003cp\u003eI hear her suck in a shocked breath, then I feel something whack me in the back of my head. Her shoe.\u003c/p\u003e\n\u003cp\u003e“Isn’t that child abuse?” I ask her.\u003c/p\u003e\n\u003cp\u003e“It would be, if you were a child. You’re eighteen, Luis. You’re a man now. Act like it!”\u003c/p\u003e\n\u003cp\u003eShe slams the door shut. The sound is like a jackhammer banging against my skull, which I’m sure is exactly what she intended. Mi\u0027amá isn’t subtle, that’s for damn sure.\u003c/p\u003e\n\u003cp\u003eThe room is finally a sanctuary, and I close my eyes. My peace is short-lived, though, because I hear the door creak as someone opens it.\u003c/p\u003e\n\u003cp\u003e“You gonna hit me with your other shoe?” I mumble against the pillow.\u003c/p\u003e\n\u003cp\u003e“Nah,” Alex’s voice echoes through my head. “Mi\u0027amá told Carlos and me to come in here to make sure you’re not dead, which is pretty much what she thought when you didn’t answer your cell last night.”\u003c/p\u003e\n\u003cp\u003eAlex and Carlos—the tag team from hell. They’re the last people I need shit from right now. If they decide to trail me, too, I’ll have an entire entourage.\u003c/p\u003e\n\u003cp\u003e“I’m fine.”\u003c/p\u003e\n\u003cp\u003e“Then sit up and talk to us.”\u003c/p\u003e\n\u003cp\u003e“Okay, in that case I’m not fine. Go away.” I moan. “Unless you want me to puke all over you.”\u003c/p\u003e\n\u003cp\u003e“What happened with you and Nikki last night?” Alex asks.\u003c/p\u003e\n\u003cp\u003e“Nada. We’re history.”\u003c/p\u003e\n\u003cp\u003eCarlos chuckles. “Yeah, right. Believe me, I’ve been in the same condition you’re in, bro. Gettin’ shitfaced over a girl isn’t a solution. Talk to her and work it out.”\u003c/p\u003e\n\u003cp\u003e“I’m not talkin’ about it.”\u003c/p\u003e\n\u003cp\u003eI open one eye and see Alex crouching beside the bed. “I’m not lettin’ you fuck up like we did.”\u003c/p\u003e\n\u003cp\u003e“Face the facts, Alex. I’m already a fuckup, and I don’t intend to change that fact anytime soon.”\u003c/p\u003e\n\u003cp\u003e40\u003c/p\u003e\n\u003cp\u003eNikki\u003c/p\u003e\n\u003cp\u003eEverything has changed in the blink of an eye. Luis, me … us. I spent the rest of Saturday night crying in bed, wondering how everything spiraled out of control. Luis’s call in the middle of the night didn’t help. God, how my heart raced when I saw his number come up. I hoped he would tell me that he’d wait for me to open my heart to him, that it didn’t matter how long it took. If he really loved me … Oh, it doesn’t matter. He said it was over.\u003c/p\u003e\n\u003cp\u003eThe problem is that the feelings I had for him, and still have for him, are so intense they scare me. I wanted to make love to him, body and soul, but my fear made me pull away. In the end, all I could give him was my body. It wasn’t good enough.\u003c/p\u003e\n\u003cp\u003eOn Monday I try my hardest to avoid seeing Luis at school, but every time I open my eyes I spot him either at his locker or walking down the hall with friends. He makes no eye contact with me, even in chemistry when we’re facing each other across the lab tables.\u003c/p\u003e\n\u003cp\u003e“Are you coming to watch the soccer game with me after school?” Kendall asks me after chemistry on Tuesday.\u003c/p\u003e\n\u003cp\u003e“No. Definitely not,” I tell her.\u003c/p\u003e\n\u003cp\u003eShe stops and gives me one of her pity looks. “Why won’t you tell me what happened Saturday night?”\u003c/p\u003e\n\u003cp\u003e“Luis and I broke up.”\u003c/p\u003e\n\u003cp\u003e“I know that part. Want to share why?”\u003c/p\u003e\n\u003cp\u003e“When I’m ready. I’m just not ready now.”\u003c/p\u003e\n\u003cp\u003eShe sighs. “All right. I’m here for you.”\u003c/p\u003e\n\u003cp\u003e“You’re always here for me. It’s time you get another best friend who doesn’t carry around so much baggage.”\u003c/p\u003e\n\u003cp\u003e“Not gonna happen.” She gives me a warm smile. “You’re my inspiration.”\u003c/p\u003e\n\u003cp\u003e“For what? A drama queen?”\u003c/p\u003e\n\u003cp\u003e“No. Do you realize how many dogs you’ve helped rescue? You’re the girl that doesn’t give up on the underdog.”\u003c/p\u003e\n\u003cp\u003e“I feel like I’m the underdog.”\u003c/p\u003e\n\u003cp\u003e“Then you know never to give up on yourself. You’re stronger than you think you are, Nikki.”\u003c/p\u003e\n\u003cp\u003eEvery minute of every day I’m tempted to text hey to Luis. Or call him, just to hear his voice.\u003c/p\u003e\n\u003cp\u003eOn Wednesday, Mariana and Luis are talking at his locker. They sit next to each other at lunch. In chemistry, he makes a joke and she laughs so hard I think her lungs are going to burst.\u003c/p\u003e\n\u003cp\u003eOn Thursday after school, I’m thankful I’m scheduled to work at the shelter. Being with the dogs will help me get my mind off of Luis.\u003c/p\u003e\n\u003cp\u003eI check in at the front desk, then head back to the cages. My heart skips a beat when Granny’s cage is empty and the pink identification card is missing from the slot on her cage door.\u003c/p\u003e\n\u003cp\u003eDid she die in the middle of the night, all alone and scared? Or is she so skinny from not eating they had to take her to the vet? I rush over to Sue in complete panic mode.\u003c/p\u003e\n\u003cp\u003e“What happened to Granny?” I ask her.\u003c/p\u003e\n\u003cp\u003e“She was adopted.” The phone rings. “I thought you knew about it,” she says before she answers the call.\u003c/p\u003e\n\u003cp\u003eHow would I know? I didn’t do the paperwork on her. I open the adoption log book and scan the approved applications. When I read the name Granny on top of the latest application my heart swells with happiness that she finally has a home. \u003c/p\u003e","sourceLink":"https://allnovel.net/chain-reaction-perfect-chemistry-3/page-33.html","bookId":2769,"creation":"Oct 5, 2019 5:13:53 PM","modification":"Oct 5, 2019 5:13:53 PM"}
