{"id":86388,"no":34,"title":"Page 34","content":"\u003cp\u003eUntil I look at the bottom of the page at the name of the person who adopted her. Luis Fuentes.\u003c/p\u003e\n\u003cp\u003eI gasp. “He didn’t.”\u003c/p\u003e\n\u003cp\u003e“Your friend came in right before we closed last night and adopted her,” one of the other volunteers tells me.\u003c/p\u003e\n\u003cp\u003eLuis knew I wanted her. How dare he come and snatch her. He took Granny just to spite me. Oh, how could I ever have thought I wanted to be with someone who’d adopt a dog just for revenge?\u003c/p\u003e\n\u003cp\u003eMy mind is in a rage as I spend my assigned time cleaning out cages and walking the dogs. After I clock out, I get in my car and race to Luis’s house.\u003c/p\u003e\n\u003cp\u003eI knock on the door.\u003c/p\u003e\n\u003cp\u003eNo answer.\u003c/p\u003e\n\u003cp\u003eI pound on the door.\u003c/p\u003e\n\u003cp\u003eStill no answer.\u003c/p\u003e\n\u003cp\u003eI put my ear to the door and hear the television, so I know someone’s got to be home.\u003c/p\u003e\n\u003cp\u003eI shimmy through the space between the bushes and the front window. I eye Luis sitting on the couch with Granny in his lap, then knock on the glass to get his attention. He looks at me, and I give him the universal sign language for “open the damn door” by pointing to it.\u003c/p\u003e\n\u003cp\u003eBy the time I shimmy back to the front stoop, he’s opened the door. “I puked in those bushes a few days ago. You might want to be careful where you step.”\u003c/p\u003e\n\u003cp\u003eEww. I’m careful not to step in anything unidentifiable, but since the bushes are in the way, it’s no use. “I can’t believe you stole my dog.”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t steal a dog, Nik. How cruel do you think I am?”\u003c/p\u003e\n\u003cp\u003e“I meant Granny, and you know it.”\u003c/p\u003e\n\u003cp\u003e“How can I steal a dog I officially adopted at a shelter?”\u003c/p\u003e\n\u003cp\u003eI narrow my eyes at him. “You knew I wanted her.”\u003c/p\u003e\n\u003cp\u003e“Yeah, so? You know the sayin’ … you snooze, you lose. You want to hear it in Spanish?”\u003c/p\u003e\n\u003cp\u003eHe’s doing his best to upset me and it’s working. “No. You didn’t even want a dog.”\u003c/p\u003e\n\u003cp\u003e“I do now. Granny and I are bondin’.” He crosses his fingers. “We’re like this.”\u003c/p\u003e\n\u003cp\u003e“This whole adopting thing isn’t really about Granny. This is about us.”\u003c/p\u003e\n\u003cp\u003e“There is no ‘us’ anymore, remember?”\u003c/p\u003e\n\u003cp\u003eHis words sting. “So you steal the one dog at the shelter you know I have a special attachment to just to piss me off and rub it in?”\u003c/p\u003e\n\u003cp\u003e“Oh, please. You were smotherin’ the poor thing. I didn’t get her for some retaliation against you. There were a few burglaries in the neighborhood and we need a good watchdog.”\u003c/p\u003e\n\u003cp\u003e“She’s blind, Luis!” I yell. “She can’t watch anything. I don’t even think she can bark. Granny’s got one foot in the grave.”\u003c/p\u003e\n\u003cp\u003eHe pretends like my words are an insult to him and his dog. “Shh, don’t let her hear you say that.”\u003c/p\u003e\n\u003cp\u003e“You’re kidding, right?”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “Listen, the lady at the shelter approved my application. You got a problem with it, talk to the shelter. I don’t give a shit what you think anymore.”\u003c/p\u003e\n\u003cp\u003eIf I were a cartoon, a big great gust of steam would be coming out of my ears right now. “What about Saturday night, Luis? You told me you loved me.”\u003c/p\u003e\n\u003cp\u003e“Isn’t that what guys are supposed to say before they screw their girlfriend? I thought it was a prerequisite.”\u003c/p\u003e\n\u003cp\u003e“You don’t mean that.”\u003c/p\u003e\n\u003cp\u003e“What do you want me to say, that I want to get back with you just so you could think of another guy while we’re in bed together? No, thanks.”\u003c/p\u003e\n\u003cp\u003eGranny waddles to the front door. Luis reaches down and picks her up. Seeing him holding her so gently in his arms shows off the warm and caring side he’s trying to hide from me.\u003c/p\u003e\n\u003cp\u003e“You don’t know what I think about, Luis. And don’t tell me you weren’t keeping secrets from me. You were obviously doing something shady for that Chuy guy. I know he wasn’t recruiting you to join the Boy Scouts. I chose to ignore all the warning signs and trust you. You lied to me, didn’t you? You keep more secrets than the Pentagon.”\u003c/p\u003e\n\u003cp\u003e“I lie to everyone. It’s no big deal.”\u003c/p\u003e\n\u003cp\u003e“It’s a big deal to me.” I point to his arm. “That didn’t happen in the garage. You were in a knife fight.”\u003c/p\u003e\n\u003cp\u003e“Wrong. Try gunfight.” He puts Granny on the grass so she can waddle around and he holds his hands up. “Okay, fine. You got me. You’re lookin’ at the newest Latino Blood recruit, baby. I’ve been dealin’ drugs and gangbangin’ with Marco behind your back. That’s my secret. What’s yours?”\u003c/p\u003e\n\u003cp\u003eI swallow and prepare myself to reveal the truth. It doesn’t matter anymore, so why are tears running down my face? I wish I could hold them back, but I can’t. I’m angry, I’m hurt, I’m sad … He’s just like Marco. I tried to deny it, but the truth slaps me in the face.\u003c/p\u003e\n\u003cp\u003e“I was pregnant with Marco’s baby the day he broke up with me.” Luis steps back, shock written all over his face. “I lost the baby right after we left Alex’s wedding and I almost died. This thing coming between us wasn’t about me and Marco!” I yell, getting riled up now. “It was about trust. And in the back of my head I knew you were lying to me about the Blood. Don’t blame me for holding back, Luis. I was almost ready to let go and try to trust again. It took me a while, and I wasn’t really good at it, but at least I was trying, which is more than I can say for you. It was you who was holding back all along.” I pull the meteorite out of my purse. “Maybe I couldn’t say it yet, but I tried to show you how much I cared.” Tears stream down my cheeks as I chuck the meteorite into the street.\u003c/p\u003e\n\u003cp\u003eI expect him to go running after it, but he doesn’t. His eyes are fixed on me.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you tell me?” he says softly. He reaches out to me.\u003c/p\u003e\n\u003cp\u003eI whack his hand away. “Don’t you dare touch me ever again!”\u003c/p\u003e\n\u003cp\u003e41\u003c/p\u003e\n\u003cp\u003eLuis\u003c/p\u003e\n\u003cp\u003eA week later, as I hop on my motorcycle in the library parking lot after working on my essay for Purdue’s application, a car that I’ve noticed trailing me for the past two weeks stops in front of me and blocks my path.\u003c/p\u003e\n\u003cp\u003eA guy steps out of the car. I’ve seen him at the warehouse a couple of times, but I’ve never talked to him. He’s an OG. “Chuy wants to talk to you.”\u003c/p\u003e\n\u003cp\u003e“Later,” I tell them.\u003c/p\u003e\n\u003cp\u003e“No, you don’t get it.” A big guy steps out of the back. “He wants to talk to you now.”\u003c/p\u003e\n\u003cp\u003eI leave the motorcycle in the parking lot and get in the backseat. I’ve been avoiding this meeting. The key Chuy gave me has been like a weight on my conscience.\u003c/p\u003e\n\u003cp\u003eChuy is sitting in the backseat, waiting for me. We’re driven randomly through town.\u003c/p\u003e\n\u003cp\u003eI take the key out of my wallet. “I can’t do it. I thought I could, but I can’t.” The way Nikki looked at me with complete and utter hatred when I tried to console her after she told me she’d been pregnant with Marco’s baby made me realize it was really over for good. She hated Marco, hated the LB, and now she put me in the same category because I’ve betrayed her, just like Marco. The entire week I’ve tried to feel him out to see if he knows about the pregnancy, but he hasn’t taken the bait. Either he doesn’t know about it, or he’s determined to keep it a secret.\u003c/p\u003e\n\u003cp\u003e“I know you feel a pull toward the LB,” Chuy says. “But you don’t know why.”\u003c/p\u003e\n\u003cp\u003eI stay silent. Every word he just spoke is the truth. I won’t admit it because I’m ashamed of it.\u003c/p\u003e\n\u003cp\u003e“No need to hide your true feelings. Tu papá wanted you to be in the Blood, Luis. He made sure you were watched over and protected. He brought you to the warehouse a week after you were born, to be blessed in with LB written on your forehead in his own blood … a full-fledged Latino Blood.”\u003c/p\u003e\n\u003cp\u003eNo fucking way. “My father died before I was born,” I say. “Alex told me he was there, he saw our papá get shot … what you’re sayin’ doesn’t make sense, unless—”\u003c/p\u003e\n\u003cp\u003e“Your father wasn’t a Fuentes,” Chuy says, interrupting my confusion. He pulls a picture out of his suit pocket and hands it to me. “I was there.”\u003c/p\u003e\n\u003cp\u003eI look at the picture of Hector Martinez with a huge grin on his face as he holds a baby in the air like a king presenting his newborn baby to the people. The prince. In the middle of the baby’s forehead, written in blood, are the letters LB—Latino Blood.\u003c/p\u003e\n\u003cp\u003e“That’s you,” Chuy says. “And your papá. Your real papá.”\u003c/p\u003e\n\u003cp\u003eAs soon as the words leave Chuy’s mouth, a feeling of dread washes over me. It can’t be true. But there have been signs. I’ve never seen my birth certificate. When Alex was shot Carlos donated blood, but mi familia never even approached me to do the same. It always rubbed me raw. Were they worried that I’d find out Alex and I weren’t a match, or that I’d somehow find out we were only half brothers? Chuy said I was blessed into the Latino Blood, but mi papá died before I was born. I couldn’t have been blessed in, unless my father was a member of the LB at the time.\u003c/p\u003e\n\u003cp\u003eI need answers, and I need them now. Did mi\u0027amá shield me from the gang life because she didn’t want me finding out the truth?\u003c/p\u003e\n\u003cp\u003eI used to know where my loyalties lie. Now I’m not so sure.\u003c/p\u003e\n\u003cp\u003e“Drive me back to the library,” I say to the dude driving. “I need to get out of here.”\u003c/p\u003e\n\u003cp\u003eThe guy looks to Chuy for direction. Chuy nods his approval. Even when they drop me off by the library and let me out of the car, I feel trapped. He knows where to find me, how to lure me back with threats I can’t ignore. I left the picture in Chuy’s car, hoping to leave the image of Hector proudly holding that baby—me—behind.\u003c/p\u003e\n\u003cp\u003eI find myself driving to Alex’s apartment. I knock on the door, hoping he’s home. I need answers, and he’s the one person who can give them to me. Alex comes to the door. “Luis, what’s wrong?” he says.\u003c/p\u003e\n\u003cp\u003e“Are you my brother?” I ask plain and simple.\u003c/p\u003e\n\u003cp\u003e“Of course I’m your brother,” he says, confused.\u003c/p\u003e\n\u003cp\u003e“Let me be more specific, then. Am I your half brother?”\u003c/p\u003e\n\u003cp\u003eHe doesn’t answer. He stares at me, with those Latino Blood tattoos on his own chest and arms mocking me.\u003c/p\u003e\n\u003cp\u003e“Fuck you, Alex!”\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Brittany says, coming into view with Paco in her arms. “Luis, you look sick. I hope you didn’t catch the flu from Paco. Are you okay?”\u003c/p\u003e\n\u003cp\u003e“Weese!” Paco yells, clapping and excited to see me.\u003c/p\u003e\n\u003cp\u003e“No, I’m not okay.” I look at Alex with contempt. “Does Brit know?”\u003c/p\u003e\n\u003cp\u003eAlex nods slowly.\u003c/p\u003e\n\u003cp\u003e“Do I know what?” Brittany says innocently as she wraps Paco tight in a blanket. “What’s going on between you two?”\u003c/p\u003e\n\u003cp\u003e“Alex was just confirmin’ that I’m not his brother,” I say.\u003c/p\u003e\n\u003cp\u003eAlex stands in front of me, face-to-face. “You are my brother, dammit.”\u003c/p\u003e\n\u003cp\u003e“Yeah, half. What’s the other half, huh? Tell me.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what you heard, but—”\u003c/p\u003e\n\u003cp\u003e“Hector Martinez is my father, isn’t he?”\u003c/p\u003e\n\u003cp\u003eI glance at Alex’s shoulder where Hector shot him not long after he killed Paco. \u003c/p\u003e","sourceLink":"https://allnovel.net/chain-reaction-perfect-chemistry-3/page-34.html","bookId":2769,"creation":"Oct 5, 2019 5:13:53 PM","modification":"Oct 5, 2019 5:13:53 PM"}
