{"id":86359,"no":4,"title":"Page 4","content":"\u003cp\u003eShe glares at him, then looks up at the ceiling. “Dios mío ayúdame.”\u003c/p\u003e\n\u003cp\u003eShe grabs Alex’s bowtie and wraps it around his neck. As if she’s a pro, she has it tied in less than thirty seconds.\u003c/p\u003e\n\u003cp\u003e“Thanks, Ma,” Alex says.\u003c/p\u003e\n\u003cp\u003eWhen she finishes, she looks up at Alex and cups his face in her hands. “My oldest hijo is getting married. Your father would be so proud of you, Alejandro. Graduating from college, and now getting married. Just … don’t forget where you came from. ¿Me Entiendes?”\u003c/p\u003e\n\u003cp\u003e“I won’t,” he assures her.\u003c/p\u003e\n\u003cp\u003eMi\u0027amá pins his boutonniere on his lapel, then steps back and looks at all three of us. Her hands press against her heart and her eyes get watery. “My boys are all grown up.”\u003c/p\u003e\n\u003cp\u003e“Don’t cry, Ma,” Alex tells her.\u003c/p\u003e\n\u003cp\u003e“I’m not,” she lies as a tear escapes the corner of her eye and runs down her face. She quickly brushes it away, then straightens and heads for the door. “Carlos and Luis, you should collect the rest of the groomsmen and tell them to line up soon.” She glances at Alex. “Finish getting dressed, Alejandro. The procession is about to start.”\u003c/p\u003e\n\u003cp\u003eShe closes the door, leaving us alone.\u003c/p\u003e\n\u003cp\u003eI watch as Alex walks over to the window overlooking Lake Michigan. Chairs set up on the private beach are filled with guests waiting for him and his bride.\u003c/p\u003e\n\u003cp\u003e“I can’t do this,” he says.\u003c/p\u003e\n\u003cp\u003eI step closer, hoping to get a hint that he’s joking.\u003c/p\u003e\n\u003cp\u003eHe’s not.\u003c/p\u003e\n\u003cp\u003eI glance at the clock on the wall. “Umm, Alex, you do realize that the weddin’ is supposed to start in ten minutes, don’t you?” I ask.\u003c/p\u003e\n\u003cp\u003e“I’ll handle this,” Carlos says, taking control. He braces his hands on Alex’s shoulders. “Did’ja cheat on Brittany?”\u003c/p\u003e\n\u003cp\u003eAlex shakes his head.\u003c/p\u003e\n\u003cp\u003e“You in love with another chick?”\u003c/p\u003e\n\u003cp\u003eAnother shake.\u003c/p\u003e\n\u003cp\u003eCarlos leans away from Alex and crosses his arms on his chest. “Then you’re goin’ through with it. I didn’t get leave and fly all the way to Chicago for you to call it off, Alex. And besides, you love the gringa and promised you’d marry her after you both graduated college. This is a done deal. No backin’ out now.”\u003c/p\u003e\n\u003cp\u003e“What’d you do, Alex?” I ask, completely confused now.\u003c/p\u003e\n\u003cp\u003eHe sighs heavily. “I haven’t told her the news that at the end of the summer we’re movin’ back to Chicago.”\u003c/p\u003e\n\u003cp\u003eOur entire family has lived in Colorado for almost three years. Moving back here isn’t gonna fly with Brittany. “What do you mean, you’re movin’ back to Chicago?”\u003c/p\u003e\n\u003cp\u003e“It’s a long story. Brit’s parents are handin’ over custody of her sister, Shelley, to the state of Illinois. She’s twenty-one and can go on state fundin’ for her care. That means she’ll be pulled from Sunny Acres and moved back here. Brit doesn’t know yet. She also doesn’t know I got into Northwestern for grad school. I accepted.”\u003c/p\u003e\n\u003cp\u003e“And you didn’t tell her any of it?” Carlos asks. “Oh, man, you are screwed.”\u003c/p\u003e\n\u003cp\u003eAlex rubs the back of his neck and winces. “I kinda never even told her I applied to Northwestern. She thinks we’re stayin’ in Boulder after the weddin’.”\u003c/p\u003e\n\u003cp\u003eI know full well my brother’s soon-to-be wife doesn’t want to come back to Illinois. I’ve heard her talk about her fear of coming back to the place where Alex got shot, and beat up within an inch of his life to get jumped out of the Latino Blood. He’s told her it’s safe now, since the gang broke off into different factions and the new head of the gang, Chuy Soto, is in jail. We’ve all assured Brittany that Alex doesn’t have a target on his back, but she’s skeptical.\u003c/p\u003e\n\u003cp\u003eI know it took a lot for Alex to convince Brittany to have their wedding back here. I think she agreed for the sole reason that she hoped her parents would attend the ceremony—despite their hatred of my brother.\u003c/p\u003e\n\u003cp\u003eThey hate him because he’s Mexican.\u003c/p\u003e\n\u003cp\u003eAnd he’s poor.\u003c/p\u003e\n\u003cp\u003eAnd he was in a gang.\u003c/p\u003e\n\u003cp\u003eHe’s still batting two out of three, which makes him an unacceptable match for their daughter. She comes from a rich, white, and stuck-up family. I have to give Mr. Ellis, her dad, some credit. He did try to get to know Alex. A while back when he came for a visit to Boulder, he invited Alex to play golf. That was a bad idea. My brother is not the golfing type. One look at his old gang tattoos should’ve been a clue.\u003c/p\u003e\n\u003cp\u003eBrittany’s parents haven’t shown up. Not yet, at least. Brittany hopes to have her parents at her side when she walks down the aisle, but plan B is to walk down with Carlos’s girlfriend’s dad, Dr. Westford. Either way, my brother will be waiting for her at the end of the aisle.\u003c/p\u003e\n\u003cp\u003eAlex shrugs into his black tuxedo jacket and heads for the door. “Just promise me one thing. If she kicks me out of our room tonight, let me sleep in one of yours.”\u003c/p\u003e\n\u003cp\u003e“Sorry, bro,” Carlos says. “I’ve been away from Kiara for nine months. I ain’t sharin’ my hotel room with anyone but her. Besides, your virgin bride’ll want to consummate the marriage.”\u003c/p\u003e\n\u003cp\u003eAlex rolls his eyes. I’m pretty sure they consummated their relationship years ago. I’m also pretty sure Carlos knows that fact.\u003c/p\u003e\n\u003cp\u003e“You’ve got to tell her,” I say. “Before the weddin’.”\u003c/p\u003e\n\u003cp\u003e“There’s no time,” Carlos chimes in, totally amused. “Nice to start your marriage with lies and deceit. You’re a stellar role model, bro.” He pats Alex’s back.\u003c/p\u003e\n\u003cp\u003e“Cállate, Carlos. I’ll tell her.”\u003c/p\u003e\n\u003cp\u003e“Before the ceremony, or after?” I ask.\u003c/p\u003e\n\u003cp\u003eFrom the open windows, harp music starts flowing into the room.\u003c/p\u003e\n\u003cp\u003eThe three of us look at one another.\u003c/p\u003e\n\u003cp\u003eWe know our family will never be the same.\u003c/p\u003e\n\u003cp\u003e“Well, guys, this is it,” Alex says as he opens the door. He stops suddenly and bows his head. He squeezes his eyes shut. “I wish Paco were here,” he mumbles.\u003c/p\u003e\n\u003cp\u003ePaco was Alex’s best friend. He died when he and Alex were seniors in high school. My brother has never gotten over it.\u003c/p\u003e\n\u003cp\u003e“Me too,” I say, crossing myself as I think of the one guy who we treated like an honorary Fuentes.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Carlos says. “But he’s here. You know he’s watchin’.”\u003c/p\u003e\n\u003cp\u003eAlex nods, then straightens. If it weren’t for Paco, Alex wouldn’t be here. He’d be in a coffin, too.\u003c/p\u003e\n\u003cp\u003eMy brothers aren’t aware that I know how Paco died. Hector Martinez, the head of the Latino Blood, shot Paco. Hector also killed my father, and even shot Alex. Hector was the enemy. My life would have been very different if the enemy weren’t dead, because I would have dedicated my life to getting revenge.\u003c/p\u003e\n\u003cp\u003eI was eleven when I found out who shot Papá when Alex was six years old and mi’amá was pregnant with me. I held back the urge for revenge, but I felt it like a fire slowly burning inside me until Hector’s death years ago made my family safe.\u003c/p\u003e\n\u003cp\u003eJust the thought of Hector Martinez can get me riled up. I take a deep breath and follow Alex and Carlos to the processional. We stand near the priest with the rest of the wedding party, and for the moment I forget about the past.\u003c/p\u003e\n\u003cp\u003e“Alex, you got the arras?” Carlos asks him.\u003c/p\u003e\n\u003cp\u003eThe arras are the thirteen gold coins he’ll give Brittany as a symbol of his trust and confidence in her. They’ve been passed down from my grandparents to my parents, which is a good thing, ’cause there’s no way my brother would be able to afford the coins otherwise. They’re not having a traditional Mexican wedding since Brittany isn’t Mexicana, but they’ve put some Mexican traditions in the ceremony.\u003c/p\u003e\n\u003cp\u003eAlex pats his pockets. “Shit. I left the arras in the room.”\u003c/p\u003e\n\u003cp\u003e“I’ll go get ’em,” I say, then head back to the makeshift dressing room.\u003c/p\u003e\n\u003cp\u003e“Hurry,” I hear Carlos and Alex call out behind me.\u003c/p\u003e\n\u003cp\u003eI swing open the door to the dressing room and find I’m not alone. A girl about my age is in the room, looking out the window. Her white dress contrasts with her honey-colored skin, and just the sight of her makes me stop in my tracks. She’s smokin’ hot, with dark wavy hair running down her back and a face that reminds me of an angel. She’s obviously a guest at the wedding, but I’ve never met her before. I’d definitely remember her if I had.\u003c/p\u003e\n\u003cp\u003eI flash her a smile. “¡Hola! Yo soy Luis. ¿Quieres charlar conmigo?”\u003c/p\u003e\n\u003cp\u003eShe doesn’t say anything.\u003c/p\u003e\n\u003cp\u003eI point to the door. “Umm … la boda va a empezar,” I tell her, but it’s clear by the way she rolls her eyes that she doesn’t really care.\u003c/p\u003e\n\u003cp\u003e“Dude, speak English,” she says. “This isn’t Mexico.”\u003c/p\u003e\n\u003cp\u003eWhoa. Chica with an attitude in the house. “Sorry,” I say. “Thought you might be Mexican.”\u003c/p\u003e\n\u003cp\u003e“I’m American,” she says, then holds up a blinged-out cell phone and waves it in the air. “And I’m on the phone. It’s a private conversation. Do you mind?”\u003c/p\u003e\n\u003cp\u003eThe side of my mouth quirks up. She might claim she’s a full-blooded American, but I’d bet my left nut she’s got some Mexican blood running through her feisty veins.\u003c/p\u003e\n\u003cp\u003eI pick up the arras and give her a smile. “Save a dance at the reception for me, mi chava.”\u003c/p\u003e\n\u003cp\u003eShe hangs up with whoever she was talking with and sneers at me. “Ugh, you’re one of those guys who flirt and smile to get with a girl, then they dump that poor girl on their ass when they least expect it.”\u003c/p\u003e\n\u003cp\u003e“Oh, so you’ve heard about me,” I say, then wink at her. She starts to walk out of the room in a huff, but I reach out to stop her. “I was just kiddin’. Don’t take life too seriously, mi chava.”\u003c/p\u003e\n\u003cp\u003eThe angel gets in my face. She does it to intimidate me, but all it does is fire me up. “How dare you tell me not to take life too seriously! You don’t even know me.”\u003c/p\u003e\n\u003cp\u003eI don’t usually mess around with girls with attitude. I’ve been around enough of ’em to know that muy creídas are more trouble than they’re worth. They’ve always intrigued me, though. I can’t help it. I think it’s in the Fuentes blood to mess around with girls who most definitely don’t want to get messed with.\u003c/p\u003e\n\u003cp\u003e“Luis, you’re holding up the ceremony,” mi\u0027amá calls loudly from the hall. She walks into the room, then raises an eyebrow at the sight of me standing close enough to the angel that if I bent forward the slightest bit I’d be kissing her. “What’s going on in here?” she demands, as if we were about to get it on and she got here just in time to break it up.\u003c/p\u003e\n\u003cp\u003e“Yeah, what’s goin’ on?” I ask the girl, deliberately putting her on the spot.\u003c/p\u003e\n\u003cp\u003eThe girl holds up the cell. “I was in the middle of a call when he came in here and started to hit on me.”\u003c/p\u003e\n\u003cp\u003e“That’s my son. And you are …” Mamá says, her eyes narrowed into slits. Oh, man. She’s in interrogation mode. You don’t want to meet mi\u0027amá when she’s got her mind set on getting information out of you.\u003c/p\u003e\n\u003cp\u003e“Nikki Cruz,” the girl says with pride. “My dad was Alex’s surgeon.” \u003c/p\u003e","sourceLink":"https://allnovel.net/chain-reaction-perfect-chemistry-3/page-4.html","bookId":2769,"creation":"Oct 5, 2019 5:13:53 PM","modification":"Oct 5, 2019 5:13:53 PM"}
