{"id":103518,"no":23,"title":"Page 23","content":"\u003cp\u003ePart V\u003c/p\u003e\n\u003cp\u003eLamb\u003c/p\u003e\n\u003cp\u003eI am light, now I fly, now I see myself beneath myself, now a god dances through me.\u003c/p\u003e\n\u003cp\u003eFRIEDRICH NIETZSCHE\u003c/p\u003e\n\u003cp\u003eChapter 23\u003c/p\u003e\n\u003cp\u003eWe rode Vana north toward the Silk Road, skirting the great Indian desert that had almost killed Alexander the Great\u0027s forces as they returned to Persia after conquering half of the known world, three centuries before. Although it would have saved a month to cut through the desert, Joshua was not confident about his ability to conjure enough water for Vana. A man should learn the lessons of history, and although I insisted that Alexander\u0027s men had probably been tired from all that conquering, while Josh and I had basically been sitting around at the beach for two years, he insisted we take the less hostile route through Delhi, and north into what is now Pakistan until we joined the Silk Road once again.\u003c/p\u003e\n\u003cp\u003eA little ways down the Silk Road I thought we received another message from Mary. We had stopped to have a short rest. When we resumed the journey, Vana happened to walk over where she had just done her business and the pile was pressed into the perfect likeness of a woman\u0027s face, dark poo against the light gray dust.\u003c/p\u003e\n\u003cp\u003e\"Look, Josh, there\u0027s another message from your mother.\"\u003c/p\u003e\n\u003cp\u003eJosh glanced and looked away. \"That\u0027s not my mother.\"\u003c/p\u003e\n\u003cp\u003e\"But look, in the elephant poop, it\u0027s a woman\u0027s face.\"\u003c/p\u003e\n\u003cp\u003e\"I know, but it\u0027s not my mother. It\u0027s distorted because of the medium. It doesn\u0027t even look like her. Look at the eyes.\"\u003c/p\u003e\n\u003cp\u003eI had to climb to the back of the elephant to get another angle on it. He was right, it wasn\u0027t his mother. \"I guess you\u0027re right. The medium obscured the message.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I\u0027m saying.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll bet it looks like someone\u0027s mom, though.\"\u003c/p\u003e\n\u003cp\u003eWith the detour around the desert, we were nearly two months getting to Kabul. Although Vana was an intrepid walker, as I have mentioned, she was a less than agile climber, so we often had to take long detours to get her through the mountains of Afghanistan. Josh and I both knew that we could not take her into the high, rocky desert once we passed Kabul, so we agreed to leave the elephant with Joy, if we could find the erstwhile courtesan.\u003c/p\u003e\n\u003cp\u003eOnce in Kabul we asked around the market for any news of a Chinese woman named Tiny Feet of the Divine Dance of Joyous Orgasm, but no one had heard of her, nor had they seen a woman simply named Joy. After a full day of searching, Joshua and I were about to abandon the search for our friend when I remembered something she had once said to me. I asked a local tea seller.\u003c/p\u003e\n\u003cp\u003e\"Is there a woman who lives around here, a very rich woman perhaps, who calls herself the Dragon Lady or something like that?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes sir,\" the fellow said, and he shuddered as he spoke, as if a bug had run across his neck. \"She is called the Cruel and Accursed Dragon Princess.\"\u003c/p\u003e\n\u003cp\u003e\"Nice name,\" I said to Joy as we rode through the massive stone gates into the courtyard of her palace.\u003c/p\u003e\n\u003cp\u003e\"A woman alone, it helps to have your reputation precede you,\" said the Cruel and Accursed Dragon Princess. She looked almost exactly as she had almost nine years ago when we had left, except perhaps that she wore a little more jewelry. She was petite, and delicate, and beautiful. She wore a white silk robe embroidered with dragons and her blue-black hair hung down her back almost to her knees, held in place by a single silver band that just kept it from sweeping around her shoulders when she turned. \"Nice elephant,\" she added.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s a present,\" Joshua said.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s lovely.\"\u003c/p\u003e\n\u003cp\u003e\"Do you have a couple of camels you can spare, Joy?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Oh, Biff, I had really hoped that you two would sleep with me tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027d love to, but Josh is still sworn off the muffin.\"\u003c/p\u003e\n\u003cp\u003e\"Young men? I have a number of man-boys I keep around for, well, you know.\"\u003c/p\u003e\n\u003cp\u003e\"Not those either,\" Joshua said.\u003c/p\u003e\n\u003cp\u003e\"Oh Joshua, my poor little Messiah. I\u0027ll bet no one made you Chinese food for your birthday this year either?\"\u003c/p\u003e\n\u003cp\u003e\"We had rice,\" Joshua said.\u003c/p\u003e\n\u003cp\u003e\"Well, we\u0027ll see what the Accursed Dragon Princess can do to make up for that,\" said Joy.\u003c/p\u003e\n\u003cp\u003eWe climbed down from the elephant and exchanged hugs with our old friend, then a stern guard in bronze chain mail led Vana away to the stables and four guards with spears flanked us as Joy led us into the main house.\u003c/p\u003e\n\u003cp\u003e\"A woman alone?\" I said, looking at the guards that seemed to stand at every doorway.\u003c/p\u003e\n\u003cp\u003e\"In my heart, darling,\" Joy said. \"These aren\u0027t friends, family, or lovers, these are employees.\"\u003c/p\u003e\n\u003cp\u003e\"Is that the Accursed part of your new title?\" Joshua said.\u003c/p\u003e\n\u003cp\u003e\"I could drop it, just be the Cruel Dragon Princess, if you two want to stay on.\"\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t. We\u0027ve been called home.\"\u003c/p\u003e\n\u003cp\u003eJoy nodded dolefully and led us into the library (filled with Balthasar\u0027s old books), where coffee was served by young men and women who Joy had obviously brought from China. I thought of all the girls, my friends and my lovers, who had been killed by the demon so long ago, and swallowed my coffee around a lump in my throat.\u003c/p\u003e\n\u003cp\u003eJoshua was as excited as I had seen him in a long time. It might have been the coffee. \"You won\u0027t believe the wonderful things I\u0027ve learned since I left here, Joy. About being the agent of change (change is at the root of belief, you know), and about compassion for everyone because everyone is part of another, and most important, that there is a bit of God in each of us - in India they call it the Divine Spark.\"\u003c/p\u003e\n\u003cp\u003eHe rambled on like that for an hour, and eventually my melancholy passed and I was infected by Joshua\u0027s enthusiasm for the things he had learned from the Magi.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I added, \"and Josh can climb inside a standard-size wine amphora. You have to bust him out with a hammer, but it\u0027s interesting to watch.\"\u003c/p\u003e\n\u003cp\u003e\"And you, Biff?\" Joy asked, smiling into her cup.\u003c/p\u003e\n\u003cp\u003e\"Well, after supper I\u0027ll show you a little something I like to call Water Buffalo Teasing the Seeds out of the Pomegranate.\"\u003c/p\u003e\n\u003cp\u003e\"That sounds - \"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry, it\u0027s not that hard to learn. I have pictures.\"\u003c/p\u003e\n\u003cp\u003eWe were four days at Joy\u0027s palace, enjoying comfort, food, and drink such as we hadn\u0027t experienced since we\u0027d last seen her. I could have stayed forever, but on the morning of the fifth day Joshua stood at the entrance to Joy\u0027s bedchamber, his satchel slung over his shoulder. He didn\u0027t say a word. He didn\u0027t have to. We shared breakfast with Joy and she met us at the gate to say good-bye.\u003c/p\u003e\n\u003cp\u003e\"Thanks for the elephant,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Thanks for the camels,\" Joshua said.\u003c/p\u003e\n\u003cp\u003e\"Thanks for the sex book,\" Joy said.\u003c/p\u003e\n\u003cp\u003e\"Thanks for the sex,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Oh, I forgot, you owe me a hundred rupees,\" Joy said. I had told her about Kashmir. The Cruel and Accursed Dragon Princess grinned at me. \"Just kidding. Be well, my friend. Keep that amulet I gave you and remember me, huh?\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\" I kissed her and climbed on my camel\u0027s back, then coaxed him to his feet.\u003c/p\u003e\n\u003cp\u003eJoy embraced Joshua and kissed him on the lips, hard and long. He didn\u0027t seem to be trying to push her away.\u003c/p\u003e\n\u003cp\u003e\"Hey, we had better go, Josh,\" I said.\u003c/p\u003e\n\u003cp\u003eJoy held the Messiah at arm\u0027s length and said, \"You are always welcome here, you know that?\"\u003c/p\u003e\n\u003cp\u003eJosh nodded, then climbed on his camel. \"Go with God, Joy,\" he said. As we rode through the gates of the palace the guards shot fire arrows that trailed long tails of sparks over us until they exploded above the road ahead: Joy\u0027s last good-bye to us, a tribute to the friendship and arcane knowledge we had all shared. It scared the bejeezus out of the camels.\u003c/p\u003e\n\u003cp\u003eAfter we had been on the road awhile, Joshua asked, \"Did you say goodbye to Vana?\"\u003c/p\u003e\n\u003cp\u003e\"I intended to, but when I went to the stable she was practicing her yoga and I didn\u0027t want to disturb her.\"\u003c/p\u003e\n\u003cp\u003e\"No kidding?\"\u003c/p\u003e\n\u003cp\u003e\"Really, she was sitting in one of the postures you taught her.\"\u003c/p\u003e\n\u003cp\u003eJoshua smiled. It didn\u0027t hurt anything for him to believe that.\u003c/p\u003e\n\u003cp\u003eThe journey on the Silk Road through the high deserts took us over a month, but it was fairly uneventful, except for one attack by a small group of bandits. When I caught the first two spears they flung at me and flung them right back, wounding the two who had thrown them, they turned and ran. The weather was mild, or as mild as one can expect in a deadly and brutal desert, but by now Joshua and I had traveled so much in this sort of harsh country that there was little that affected us. Just before we reached Antioch, however, a sandstorm whipped up out of the desert that left us hiding between our camels for two days, breathing through our shirts and washing the mud out of our mouths every time we took a drink. The storm settled enough to travel, and we were at a veritable gallop in the streets of Antioch when Joshua located an inn by impacting with its sign on his forehead. He was knocked back off his camel and sat up in the street with blood streaming down his face.\u003c/p\u003e\n\u003cp\u003e\"Are you hurt badly?\" I asked, kneeling beside him. I could barely see in the driving dust.\u003c/p\u003e\n\u003cp\u003eJoshua looked at the blood on his hands where he had touched his forehead. \"I don\u0027t know. It doesn\u0027t hurt that badly, but I can\u0027t tell.\"\u003c/p\u003e\n\u003cp\u003e\"Inside,\" I said, helping him to his feet and through the door of the inn.\u003c/p\u003e\n\u003cp\u003e\"Shut the door,\" the innkeeper shouted as the wind whipped through the room. \"Were you born in a barn?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" said Joshua.\u003c/p\u003e\n\u003cp\u003e\"He was,\" I said. \"Angels on the roof, though.\"\u003c/p\u003e\n\u003cp\u003e\"Shut the damn door,\" said the innkeeper.\u003c/p\u003e\n\u003cp\u003eI left Joshua sitting there by the door while I went out and found shelter for the camels. When I returned Joshua was wiping his face with a linen cloth that someone had handed to him. A couple of men stood over him, eager to help. I handed the cloth to one of them and examined Josh\u0027s wounds. \"You\u0027ll live. A big bump and two cuts, but you\u0027ll live. You can\u0027t do the healing thing on - \"\u003c/p\u003e\n\u003cp\u003eJoshua shook his head.\u003c/p\u003e\n\u003cp\u003e\"Hey, look at this,\" one of the travelers who had helped Joshua said, holding up the piece of linen Joshua had used to wipe his face. The dust and blood from Josh\u0027s face had left a perfect likeness on the linen, even handprints where he\u0027d gotten blood from his head wound. \"Can I keep this?\" the fellow said. He was speaking Latin, but with a strange accent.\u003c/p\u003e\n\u003cp\u003e\"Sure,\" I said. \"Where are you fellahs from?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re from the Ligurian tribe, from the territories north of Rome. A city on the Po river called Turin. Have you heard of it?\"\u003c/p\u003e\n\u003cp\u003e\"No, I haven\u0027t. You know, you fellahs can do what you want with that cloth, but out on my camel I\u0027ve got some erotic drawings from the East that are going to be worth something someday. I can let you have them for a very fair price.\"\u003c/p\u003e\n\u003cp\u003eThe Turinians went off holding their pathetic swath of muddy cloth like it was some kind of holy relic. Ignorant bastards wouldn\u0027t know art if you nailed them to it. I bandaged Joshua\u0027s wounds and we checked into the inn for the night.\u003c/p\u003e\n\u003cp\u003eIn the morning we decided to keep our camels and take the land route home through Damascus. As we passed out of the gates of Damascus on the final leg home, Joshua started to worry.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not ready to be the Messiah, Biff. If I\u0027m being called home to lead our people I don\u0027t even know where to start. I understand the things I want to teach, but I don\u0027t have the words yet. Melchior was right about that. Before anything you have to have the word.\"\u003c/p\u003e\n\u003cp\u003e\"Well it\u0027s not just going to come to you in a flash here on the Damascus road, Josh. That sort of thing doesn\u0027t happen. You\u0027re obviously supposed to learn what you need to know in its own time. To everything a season, yada, yada, yada...\"\u003c/p\u003e\n\u003cp\u003e\"My father could have made learning all this easier. He could have just told me what I was supposed to do.\"\u003c/p\u003e\n\u003cp\u003e\"I wonder how Maggie\u0027s doing. You think she got fat?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m trying to talk about God here, about the Divine Spark, about bringing the kingdom to our people.\"\u003c/p\u003e\n\u003cp\u003e\"I know you are, so am I. Do you want to do all of that without help?\"\u003c/p\u003e\n\u003cp\u003e\"I guess not.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s why I was thinking about Maggie. She was smarter than us before we left, she\u0027s probably smarter than us now.\"\u003c/p\u003e\n\u003cp\u003e\"She was smart, wasn\u0027t she? She wanted to be a fisherman,\" said Josh, grinning. I could tell that the thought of seeing Maggie tickled him.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t tell her about all the whores, Josh.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Or Joy and the girls. Or the old woman with no teeth.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t tell her about any of them, not even the yak.\"\u003c/p\u003e\n\u003cp\u003e\"There was nothing with the yak. The yak and I weren\u0027t even on speaking terms.\"\u003c/p\u003e\n\u003cp\u003e\"You know, she probably has a dozen children by now.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" I sighed. \"They should be mine.\"\u003c/p\u003e\n\u003cp\u003e\"And mine.\" Joshua sighed back.\u003c/p\u003e\n\u003cp\u003eI looked at him as he rode beside me in a sea of gently loping camel waves. He was staring off at the horizon, looking forlorn. \"Yours and mine? You think they should be yours and mine?\"\u003c/p\u003e\n\u003cp\u003e\"Sure, why not. You know I love all the little - \"\u003c/p\u003e\n\u003cp\u003e\"You are such a doofus sometimes.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think she\u0027ll remember us? I mean, how we all were back then?\"\u003c/p\u003e\n\u003cp\u003eI thought about it and shuddered. \"I hope not.\"\u003c/p\u003e\n\u003cp\u003eNo sooner did we pass into Galilee than we began to hear about what John the Baptist was doing in Judea.\u003c/p\u003e\n\u003cp\u003e\"Hundreds have followed him into the desert,\" we heard in Gischala.\u003c/p\u003e\n\u003cp\u003e\"Some say he is the Messiah,\" one man told us in Baca.\u003c/p\u003e\n\u003cp\u003e\"Herod is afraid of him,\" said a woman in Cana.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s another crazy holy man,\" said a Roman soldier in Sepphoris. \"The Jews breed them like rabbits. I hear he drowns anyone who doesn\u0027t agree with him. First sensible idea I\u0027ve heard since I was sent to this accursed territory.\"\u003c/p\u003e\n\u003cp\u003e\"May I have your name, soldier?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Caius Junius, of the Sixth Legion.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you. We\u0027ll keep you in mind.\" To Josh I said, \"Caius Junius: front of the line when we start shoving Romans out of the kingdom into the fiery abyss.\"\u003c/p\u003e\n\u003cp\u003e\"What did you say?\" said the Roman.\u003c/p\u003e\n\u003cp\u003e\"No, no, don\u0027t thank me, you earned it. Right at the front of the line you go, Caius.\"\u003c/p\u003e\n\u003cp\u003e\"Biff!\" Josh barked, and once he had my attention he whispered, \"Try not to get us thrown into prison before we get home, please.\"\u003c/p\u003e\n\u003cp\u003eI nodded and waved to the legionnaire as we rode away. \"Just crazy Jew talk. Pay no attention. Whimper Fidelis,\" I said.\u003c/p\u003e\n\u003cp\u003e\"We have to find John after we see our families,\" Joshua said.\u003c/p\u003e\n\u003cp\u003e\"Do you think that he\u0027s really claiming to be the Messiah?\"\u003c/p\u003e\n\u003cp\u003e\"No, but it sounds like he knows how to get the word out.\"\u003c/p\u003e\n\u003cp\u003eWe rode into Nazareth a half hour later.\u003c/p\u003e\n\u003cp\u003eI suppose we expected more upon our arrival. Cheering maybe, little children running at our heels begging for tales of our great adventures, tears and laughter, kisses and hugs, strong shoulders to bear the conquering heroes through the streets. What we\u0027d forgotten was that while we were traveling, having adventures, and experiencing wonders, the people of Nazareth had been living through the same old day-to-day crap - a lot of days had passed, and a lot of crap. When we rode up to Joshua\u0027s old house, his brother James was working outside under the awning, shaving a piece of olive wood into a strut for a camel saddle. I knew it was James the moment I saw him. He had Joshua\u0027s narrow hooked nose and wide eyes, but his face was more weathered than Josh\u0027s, and his body heavier with muscle. He looked ten years older than Joshua rather than the two years younger that he was.\u003c/p\u003e\n\u003cp\u003eHe put down his spoke shave and stepped out in the sunlight, holding up a hand to shield his eyes.\u003c/p\u003e\n\u003cp\u003e\"Joshua?\"\u003c/p\u003e\n\u003cp\u003eJoshua tapped his camel on the back of his knees with the long riding crop and the beast lowered him to the ground.\u003c/p\u003e\n\u003cp\u003e\"James!\" Joshua climbed off the camel and went to his brother, his arms out as if to embrace him, but James stepped back.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll go tell Mother that her favorite son has returned.\" James turned away and I saw the tears literally shoot out of Joshua\u0027s eyes into the dust.\u003c/p\u003e\n\u003cp\u003e\"James,\" Joshua was pleading. \"I didn\u0027t know. When?\"\u003c/p\u003e\n\u003cp\u003eJames turned and looked his half brother in the eye. There was no pity there, no grief, just anger. \"Two months ago, Joshua. Joseph died two months ago. He asked for you.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know,\" Joshua said, still holding his arms out for the embrace that wasn\u0027t going to come.\u003c/p\u003e\n\u003cp\u003e\"Go inside. Mother has been waiting for you. She starts every morning wondering if this is the day you\u0027ll return. Go inside.\" He turned away as Joshua went past him into the house, then James looked up at me. \"The last thing he said was \u0027Tell the bastard I love him.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"The bastard?\" I said as I coaxed my camel to let me down.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what he always called Joshua. \u0027I wonder how the bastard is doing. I wonder where the bastard is today?\u0027 Always talking about the bastard. And Mother yammering on always about how Joshua did this, and Joshua did that, and what great things Joshua would do when he returned. And all the while I\u0027m the one looking out for my brothers and sisters, taking care of them when Father got sick, taking care of my own family. Still, was there any thanks? A kind word? No, I was doing nothing more than paving Joshua\u0027s road. You have no idea what it\u0027s like to always be second to Joshua.\"\u003c/p\u003e\n\u003cp\u003e\"Really,\" I said. \"You\u0027ll have to tell me about that sometime,\" I said. \"Tell Josh if he needs me I\u0027ll be at my father\u0027s house. My father is still alive, isn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, and your mother too.\"\u003c/p\u003e\n\u003cp\u003e\"Oh good, I didn\u0027t want to put one of my brothers through breaking the painful news.\" I turned and led my camel away.\u003c/p\u003e\n\u003cp\u003e\"Go with God, Levi,\" James said.\u003c/p\u003e\n\u003cp\u003eI turned. \"James, it is written, \u0027To the work you are entitled, but not the fruits thereof.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never heard that. Where is that written?\"\u003c/p\u003e\n\u003cp\u003e\"In the Bhagavad Gita, James. It\u0027s a long poem about going into battle, and this warrior\u0027s god tells him not to worry about killing his kinsmen in battle, because they are already dead, they just don\u0027t know it yet. I don\u0027t know what made me think of it.\"\u003c/p\u003e\n\u003cp\u003eMy father hugged me until I thought he\u0027d broken my ribs, then he handed me off to my mother, who did the same until she seemed to come to her senses, then she began to cuff me about the head and shoulders with her sandal, which she had whipped off with surprising speed and dexterity for a woman her age.\u003c/p\u003e\n\u003cp\u003e\"Seventeen years you\u0027re gone and you couldn\u0027t write?\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know how to read.\"\u003c/p\u003e\n\u003cp\u003e\"So you couldn\u0027t send word, smart mouth?\"\u003c/p\u003e\n\u003cp\u003eI fended off the blows by directing their energy away from me, as I had been taught at the monastery, and soon two small boys who I didn\u0027t recognize were catching the brunt of the beating. Fearing lawsuits from small strangers, I caught my mother\u0027s arms and hugged them to her sides as I looked at my father, nodded to the two little ones, and raised my eyebrows as if to say, Who are the squirts?\u003c/p\u003e\n\u003cp\u003e\"Those are your brothers, Moses and Japeth,\" my father said. \"Moses is six and Japeth is five.\"\u003c/p\u003e\n\u003cp\u003eThe little guys grinned. Both were missing front teeth, probably sacrificed to the squirming harpy I was currently holding at bay. My father beamed as if to say, I can still build the aqueduct - lay a little pipe, if you know what I mean - when I need to.\u003c/p\u003e\n\u003cp\u003eI scowled as if to say, Look, I was barely able to hold on to my respect for you when I found out what you did to make the first three of us; these little fellows are only evidence that you\u0027ve no memory for suffering.\u003c/p\u003e\n\u003cp\u003e\"Mother, if I let you go will you calm down?\" I looked over her shoulder at Japeth and Moses. \"I used to tell people she was besought by a demon, do you guys do that?\" I winked at them.\u003c/p\u003e\n\u003cp\u003eThey giggled as if to say, Please, end our suffering, kill us, kill us now, or kill this bitch that plagues us like the torments of Job. Okay, maybe I was just imagining that\u0027s what they were saying. Maybe they were just giggling.\u003c/p\u003e\n\u003cp\u003eI let my mother go and she backed off. \"Japeth, Moses,\" Mother said, \"come meet Biff. You\u0027ve heard your father and me talk about our oldest disappointment - well, this is him. Now run and get your other brothers, I\u0027ll go fix something nice.\"\u003c/p\u003e\n\u003cp\u003eMy brothers Shem and Lucius brought their families and joined us for dinner and we all lay around the table as Mother served us something nice, I\u0027m not sure what it was. (I know I\u0027ve said that I was the oldest of three brothers, and obviously, with the squirts, it was five, but dammit, by the time I met Japeth and Moses I was too old to have the time to torment them, so they never really paid their dues as brothers. They were more like, oh, pets.) \"Mother, I\u0027ve brought you a gift from the East,\" I said, running out to the camel to retrieve a package.\u003c/p\u003e\n\u003cp\u003e\"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a breeding mongoose,\" I said, tapping on the cage. The little scamp tried to bite the pad off of my finger.\u003c/p\u003e\n\u003cp\u003e\"But there\u0027s only one.\"\u003c/p\u003e\n\u003cp\u003e\"Well, there were two, but one escaped, so now there\u0027s one. They\u0027ll attack a snake ten times their size.\"\u003c/p\u003e\n\u003cp\u003e\"It looks like a rat.\"\u003c/p\u003e\n\u003cp\u003eI lowered my voice and whispered conspiratorially, \"In India, the women train them to sit on their heads like hats. Very fashionable. Of course the fad hasn\u0027t reached Galilee yet, but in Antioch, no self-respecting woman will go out of the house without wearing a mongoose.\"\u003c/p\u003e\n\u003cp\u003e\"Really,\" said Mother, looking at the mongoose in a new light. She took the cage and stowed it gently away in the corner, as if it contained a delicate egg, rather than a vicious miniature of herself. \"So,\" said Mother, waving to her two daughters-in-law and the half-dozen grandchildren that loitered near the table, \"your brothers married and gave me grandchildren.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m happy for them, Mother.\"\u003c/p\u003e\n\u003cp\u003eShem and Lucius hid their grins behind a crust of flatbread the same way they did when we were little and Mother was giving me hell.\u003c/p\u003e\n\u003cp\u003e\"All the places you traveled, you never met a nice girl you could settle down with?\"\u003c/p\u003e\n\u003cp\u003e\"No, Mother.\"\u003c/p\u003e\n\u003cp\u003e\"You can marry a gentile, you know. It would break my heart, but why did the tribes almost wipe out the Benjamites if it wasn\u0027t so a desperate boy could marry a gentile if he needs to? Not a Samaritan, but, you know, some other gentile. If you have to.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks, Mother, I\u0027ll keep that in mind.\"\u003c/p\u003e\n\u003cp\u003eMother pretended to find some lint or something on my collar, which she picked at while she said, \"So your friend Joshua never married either? You heard about his little sister Miriam, didn\u0027t you?\" Here her voice went to a conspiratorial whisper. \"Started wearing men\u0027s clothes and ran off to the island of Lesbos.\" Back to normal nudging tone. \"That\u0027s Greek, you know? You boys didn\u0027t go to Greece on your travels, did you?\"\u003c/p\u003e\n\u003cp\u003e\"No, Mother, I really have to go.\"\u003c/p\u003e\n\u003cp\u003eI tried to stand and she grabbed me. \"It\u0027s because your father has a Greek name, isn\u0027t it? I told you, Alphaeus, change the name, but you said you were proud of it. Well, I hope you\u0027re proud of it now. What\u0027s next, Lucius here will start hanging Jews on crosses like the other Romans?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not a Roman, Mother,\" Lucius said wearily. \"Lots of good Jews have Latin names.\"\u003c/p\u003e\n\u003cp\u003e\"Not that it matters, Mother, but how do you think they get more Greeks?\"\u003c/p\u003e\n\u003cp\u003eTo my mother\u0027s credit, she stopped for a second to think. I used the lull to escape.\u003c/p\u003e\n\u003cp\u003e\"Nice to see you guys.\" I nodded to all of my relatives, old and new. \"I\u0027ll come by and visit before I go. I have to go check on Joshua.\" And I was out the door.\u003c/p\u003e\n\u003cp\u003eI threw the door open at Joshua\u0027s old house without even knocking, nearly coldcocking Joshua\u0027s brother Judah in the process. \"Josh, you\u0027ve got to bring the kingdom soon or I\u0027m going to have to kill my mother.\"\u003c/p\u003e\n\u003cp\u003e\"She still plagued by demons?\" asked Judah, who looked exactly as he had when he was four, except for the beard and the receding hairline, but he was as wide-eyed and goofy of smile as he had ever been.\u003c/p\u003e\n\u003cp\u003e\"No, I was just being hopeful when I used to say that.\"\u003c/p\u003e\n\u003cp\u003e\"Will you join us for supper?\" said Mary. Thank God she had aged: gone a little thicker around the hips and waist, developed some lines at the corner of her eyes and mouth. Now she was just the second or third most beautiful creature on earth.\u003c/p\u003e\n\u003cp\u003e\"Love to,\" I said.\u003c/p\u003e\n\u003cp\u003eJames must have been home with his wife and children, as I guessed were the other sisters and brothers, except for Miriam, and I\u0027d already been apprised of her whereabouts. At the table it was only Mary, Joshua, Judah, his pretty wife, Ruth, and two little redheaded girls that looked like their mother.\u003c/p\u003e\n\u003cp\u003eI expressed my condolences for the family\u0027s loss, and Joshua filled me in on the timing of events. About the time that I spotted Mary\u0027s portrait on the temple wall in Nicobar, Joseph had taken ill with some disease of the water. He started peeing blood, and in a week he was bedridden. He lingered only a week longer before he died. He\u0027d been buried for two months now. I looked at Joshua as Mary related this part of the story and he shook his head, meaning, too long in the grave, there\u0027s nothing I can do. Mary had known nothing about a message calling us home.\u003c/p\u003e\n\u003cp\u003e\"Even if you two had only been in Damascus you\u0027d have been lucky to get here in time. He went so fast.\" She was strong, had recovered somewhat from the loss, but Joshua appeared to still be in shock.\u003c/p\u003e\n\u003cp\u003e\"You have to go find Joshua\u0027s cousin John,\" Mary said. \"He\u0027s been preaching about the coming of the kingdom, of preparing the way for the Messiah.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve heard,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll stay here with you, Mother,\" Joshua said. \"James is right, I have responsibilities. I\u0027ve shirked them too long.\"\u003c/p\u003e\n\u003cp\u003eMary touched her son\u0027s face and looked in his eyes. \"You will leave in the morning and you will find John the Baptist in Judea and you will do what God has ordained you do since he placed you in my womb. Your responsibilities are not to a bitter brother or an old woman.\"\u003c/p\u003e\n\u003cp\u003eJoshua looked at me. \"Can you leave in the morning? I know it\u0027s soon after being gone so long.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, I thought I\u0027d stay, Josh. Your mother needs someone to look after her, and she\u0027s still a relatively attractive woman. I mean, a guy could do worse.\"\u003c/p\u003e\n\u003cp\u003eJudah aspirated an olive pit and began coughing furiously until Joshua pounded him on the back and the pit shot across the room, leaving Judah gasping and staring at me through watery red eyes.\u003c/p\u003e\n\u003cp\u003eI put my hand on Joshua and Judah\u0027s shoulders. \"I think I can learn to love you both as sons.\" I looked at the pretty but shy Ruth, who was tending the little girls. \"And you, Ruth, I hope that you can learn to love me as a slightly older, but incredibly attractive close uncle. And you, Mary - \"\u003c/p\u003e\n\u003cp\u003e\"Will you go with Joshua to Judea, Biff?\" Mary interrupted.\u003c/p\u003e\n\u003cp\u003e\"Sure, first thing in the morning.\"\u003c/p\u003e\n\u003cp\u003eJoshua and Judah were still staring at me as if they\u0027d both been smacked in the face with a large fish. \"What?\" I said. \"How long have you guys known me? Jeez. Grow a sense of humor.\"\u003c/p\u003e\n\u003cp\u003e\"Our father died,\" said Joshua.\u003c/p\u003e\n\u003cp\u003e\"Yeah, but not today,\" I said. \"I\u0027ll meet you here in the morning.\"\u003c/p\u003e\n\u003cp\u003eThe next morning, as we rode through the square, we passed Bartholomew, the village idiot, who looked no worse or less filthy for the years gone by, and who seemed to have come to some sort of understanding with his doggy friends. Instead of jumping all over him as they always had, now they sat quietly before him in a group, as if listening to a sermon.\u003c/p\u003e\n\u003cp\u003e\"Where have you been?\" Bart called to us.\u003c/p\u003e\n\u003cp\u003e\"In the East.\"\u003c/p\u003e\n\u003cp\u003e\"Why did you go there?\"\u003c/p\u003e\n\u003cp\u003e\"We were looking for the Divine Spark,\" Joshua said. \"But we didn\u0027t know that when we left.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"To Judea, to find John the Baptist.\"\u003c/p\u003e\n\u003cp\u003e\"He should be easier to find than the Spark. Can I come?\"\u003c/p\u003e\n\u003cp\u003e\"Sure,\" I said. \"Bring your things.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have any things.\"\u003c/p\u003e\n\u003cp\u003e\"Then bring your stench.\"\u003c/p\u003e\n\u003cp\u003e\"That will follow on its own,\" Bartholomew said.\u003c/p\u003e\n\u003cp\u003eAnd thus we became three. \u003c/p\u003e","sourceLink":"https://allnovel.net/lamb-the-gospel-according-to-biff-christ-s-childhood-pal/page-23.html","bookId":2643,"creation":"Oct 5, 2019 10:27:20 PM","modification":"Oct 5, 2019 10:27:20 PM"}
