{"id":90201,"no":11,"title":"Page 11","content":"\u003cp\u003eI start giggling at their over enthusiasm.\u003c/p\u003e\n\u003cp\u003eTrick speaks around his donut, “They’re like little clouds of cinnamon goodness.”\u003c/p\u003e\n\u003cp\u003eGhost moans in agreement.\u003c/p\u003e\n\u003cp\u003eMax looks up at me and says, “These are so freakin’ good. Why the heck didn’t you open a bakery?”\u003c/p\u003e\n\u003cp\u003eNik finishes his first donut. He has glaze all over his lips and doesn’t even know.\u003c/p\u003e\n\u003cp\u003eHe looks adorable and adds, “Yeah, Tina, you’ve got a real talent for baking. I know we’ve only tried the cupcakes and donuts but I’ve never tried anything so good in my life.” Nik looks at Max and threatens, “If you tell Mom I said that I’ll kick your ass.”\u003c/p\u003e\n\u003cp\u003eI’m a little uncomfortable with all the praise so I explain, “I love working at Safira. It’s my whole life. Every girl’s dream is to work at a clothing store. Don’t get me wrong, there was a time in my life when I was actually considering opening a bakery. But this,” I point to the donuts, “is all me. And when I bake for someone, I give them a little part of myself. It’s like giving someone a part of my heart every time.” I look up thoughtfully and shrug, “I don’t know if I like the idea of people buying pieces of me. They’re mine to give away when I feel like it. And that makes them special.”\u003c/p\u003e\n\u003cp\u003eAll the guys have stopped eating and stare at me.\u003c/p\u003e\n\u003cp\u003e“That actually makes sense,” Nik says, his face soft.\u003c/p\u003e\n\u003cp\u003eI’m embarrassed and decide to cut my visit short.\u003c/p\u003e\n\u003cp\u003eI clear my throat and utter, “I need to get back so I’ll see you guys later.” I turn and leave without waiting for their goodbyes.\u003c/p\u003e\n\u003cp\u003eHalfway down the hall I’m stopped by a hand on my shoulder. I turn and face Nik.\u003c/p\u003e\n\u003cp\u003e“Tina, I actually wanted to see you for a minute.” His face is serious and I’m a little worried by it.\u003c/p\u003e\n\u003cp\u003eHe looks so handsome today. He’s rocking day old stubble on his cheeks and I want to put my fingers to it.\u003c/p\u003e\n\u003cp\u003eMust you be so beautiful, Nik?\u003c/p\u003e\n\u003cp\u003eI nod, “Uh, sure.”\u003c/p\u003e\n\u003cp\u003eAm I in trouble?\u003c/p\u003e\n\u003cp\u003e“Am I in trouble?” I ask.\u003c/p\u003e\n\u003cp\u003eI must sound apprehensive because he puts an arm around my shoulders and chuckles, “No, sweetheart.”\u003c/p\u003e\n\u003cp\u003eStill caught up in a Nik hold, he leads me down the hall to his office. I’m even more nervous when he shuts the door behind us.\u003c/p\u003e\n\u003cp\u003eHe pulls out a chair for me, ever the gentleman, then sits himself behind the large mahogany desk.\u003c/p\u003e\n\u003cp\u003eLooking a little anxious, he starts ,“So we’ve known each other a few weeks now, right?”\u003c/p\u003e\n\u003cp\u003eWhere is this going?\u003c/p\u003e\n\u003cp\u003eI nod, “Uh, yeah.”\u003c/p\u003e\n\u003cp\u003eHe comments, “This is never easy to tell someone.”\u003c/p\u003e\n\u003cp\u003eGrab your shit and run like hell!\u003c/p\u003e\n\u003cp\u003eQuiet, brain.\u003c/p\u003e\n\u003cp\u003eI quiet my voice and ask, “What is it Nik?”\u003c/p\u003e\n\u003cp\u003eHe blurts out, “I had you investigated.”\u003c/p\u003e\n\u003cp\u003eUh, what?\u003c/p\u003e\n\u003cp\u003e“Uh, sorry. What?” I’m so confused.\u003c/p\u003e\n\u003cp\u003eHe looks ashamed and explains. “When we met, and under the circumstances we met, I was really unsure of you. There have been a lot of women who have tried to get close to me for my money and I really needed to know if there was a possibility that you might be one of those people.”\u003c/p\u003e\n\u003cp\u003eI don’t have anything to hide from Nik. I actually feel sorry that he’s had those past experiences and that they’ve made him unsure of people’s intentions towards him. I’m sad for him.\u003c/p\u003e\n\u003cp\u003eIn saying that, I’m really distressed about the fact that he might know about Mia. When people find out about her, they start treating me differently and looking at me with pity. That’s normally the time I start avoiding them and I really don’t want to avoid Nik. I like Nik. I just would have hoped to be able to tell him about Mia in my own time.\u003c/p\u003e\n\u003cp\u003eI try to steady my thick voice, “Oh, Nik. I can understand that. And I don’t have anything to hide from you.” I force a laugh. “I’m not after your friendship for money.”\u003c/p\u003e\n\u003cp\u003eLooking shocked, he jolts slightly in his seat and agrees, “Oh, I know. I just didn’t want any secrets between us. And I wanted you to see the file yourself.”\u003c/p\u003e\n\u003cp\u003eSliding the file over to me, he smiles a small smile, “Knock yourself out”\u003c/p\u003e\n\u003cp\u003eI throw him a wary look before opening the file.\u003c/p\u003e\n\u003cp\u003eOh My God!\u003c/p\u003e\n\u003cp\u003eThere are at least ten pages. I’m shocked at how much the person put to this task was able to recover. There is my birth certificate, my address and phone numbers, most of my bank account statements (yikes), the deed to Safira’s building (well that cat’s out of the bag), business name certificate which shows my name registered as Safira Boutique’s owner, and a couple of pages of personal interests/schedules.\u003c/p\u003e\n\u003cp\u003eHoly Cannoli!\u003c/p\u003e\n\u003cp\u003eThis guy was actually watching me. That’s kind of creepy.\u003c/p\u003e\n\u003cp\u003eThere is nothing about Mia. Nothing about Jace Weathers. Or my Mom. He doesn’t know about Mom’s inheritance money. I relax slightly.\u003c/p\u003e\n\u003cp\u003eNik is waiting nervously for me to say something.\u003c/p\u003e\n\u003cp\u003eI hold up the file and ask, “Can I keep this?”\u003c/p\u003e\n\u003cp\u003eHe smiles again, “Of course.”\u003c/p\u003e\n\u003cp\u003eI smile back, “Thanks, Nik.”\u003c/p\u003e\n\u003cp\u003eFrowning down at the table, he softly says, “I hope I haven’t overstepped a line here. I would hate for things to become awkward between us.” He clears his throat. “I like having you around.”\u003c/p\u003e\n\u003cp\u003eI beam on the inside and assure, “No, not at all. It probably would’ve been weird if I found out some other way but you came right out and told me. And I understand why you did it.” I chuckle, “After all, who sends a guy candy?” I cover my face with my hands and laugh out of embarrassment.\u003c/p\u003e\n\u003cp\u003eHis shoulders slump and the look of relief is obvious on his face.\u003c/p\u003e\n\u003cp\u003eHe laughs at my reaction. “I have to admit, I thought it was a little weird but now that I know you I think it was really sweet.”\u003c/p\u003e\n\u003cp\u003eI lower my hands, turn my flushed face to his and smile, “So, we’re still friends right?”\u003c/p\u003e\n\u003cp\u003eHe grins, “Oh, yeah.”\u003c/p\u003e\n\u003cp\u003eAwesome.\u003c/p\u003e\n\u003cp\u003eChapter Eight\u003c/p\u003e\n\u003cp\u003eThe object of my affections\u003c/p\u003e\n\u003cp\u003e“He did what?” Lola looks like she’s about the spew fire.\u003c/p\u003e\n\u003cp\u003eI answer, “He had me investigated.” I go about my business and try to ignore the stares from Lola and Nat.\u003c/p\u003e\n\u003cp\u003e“But, why?” This from Nat. She’s quiet and sounds confused.\u003c/p\u003e\n\u003cp\u003eLola chides, “Oh, hell no, this conversation doesn’t go any further until we have Mimi add her wisdom to it.” She walks up to the counter, puts the phone on speaker, and dials what I assume is Mimi’s number.\u003c/p\u003e\n\u003cp\u003eThe phone starts ringing and then we hear Mimi give us her usual greeting, “Yo.”\u003c/p\u003e\n\u003cp\u003eLola clears her throat and begins, “Meems, we’re all here and need you to be a part of this conversation. The topic up for discussion is why Nik had Tina investigated.”\u003c/p\u003e\n\u003cp\u003eMimi actually sounds amused through the speaker, “Well, hot damn, that’s awesome!”\u003c/p\u003e\n\u003cp\u003eThe three of us at the store all say, “What?” a little too loudly.\u003c/p\u003e\n\u003cp\u003eMimi sounds exasperated, “C’mon guys, don’t you know what this means?”\u003c/p\u003e\n\u003cp\u003eThe silence is enough to let Mimi know we have no freakin’ idea.\u003c/p\u003e\n\u003cp\u003eShe sighs and enlightens, “It’s because he wants to keep her around! And I’m guessing since you guys know, that he told Tina about it which means he trusts her. Excuse me for being happy about this because, yes, it’s a breach of privacy but Tina doesn’t have anything to hide. So, teeny Tina, you’re in!”\u003c/p\u003e\n\u003cp\u003eI whisper, “I’m in?”\u003c/p\u003e\n\u003cp\u003eI look around to Lola and Nat whose expressions have changed so abruptly from scowls to small smiles.\u003c/p\u003e\n\u003cp\u003eMimi laughs over the speaker, “You’re in, babe. Listen, I have to go. See ya later.” She hangs up.\u003c/p\u003e\n\u003cp\u003eNat nudges my shoulder and admits, “I guess I was a little too shocked to see what Meems just pointed out.” She looks me in the eye with a meaningful look, “How much does he know?”\u003c/p\u003e\n\u003cp\u003eI know what she’s asking. Nat is the only one who knows I own Safira apart from my dad.\u003c/p\u003e\n\u003cp\u003eRawr Raaawr\u003c/p\u003e\n\u003cp\u003eA customer walks in and Lola straightens up, “I’ll take it.” She walks over to them with a big smile.\u003c/p\u003e\n\u003cp\u003eNat and I are alone so it’s safe to tell her ,“He knows I own Safira. He doesn’t know about Mia, Mom, or Jace. He doesn’t know about Mom’s inheritance money, either.”\u003c/p\u003e\n\u003cp\u003eNat looks thoughtful and clarifies, “So he thinks you have very little money and still wants to keep you around even though he was worried you were after him for money. That’s awesome.”\u003c/p\u003e\n\u003cp\u003eI’m glad the girls are letting this go. It wasn’t even that big of a deal to me. I get people having trust issues. It’s why I’ve only had one relationship in my twenty eight years. I want Nik to trust me. I understand that’ll take time and I’ll have to be patient. That’s all right with me. He’s the kind of guy who’s worth it. I want him around. So, I’ll be patient.\u003c/p\u003e\n\u003cp\u003eIt’s only been a few weeks and he’s already changed so much towards me. I know he was weirded out by my need to be affectionate and touchy. When he brought Nat and I lunch and I hugged him, he actually hugged me back. It wasn’t just a hug, he stroked my hair. And it felt nice. So nice that I want to hug him every time I see him and feel his big, muscular arms around me, keeping me safe.\u003c/p\u003e\n\u003cp\u003eKeeping you safe?\u003c/p\u003e\n\u003cp\u003eI guess I feel protected by him, which is strange, but it’s also nice. I just came from his office and I want to see him again. Like, now.\u003c/p\u003e\n\u003cp\u003eYou’re getting too attached.\u003c/p\u003e\n\u003cp\u003eNo, I’m not. I just like my new friend.\u003c/p\u003e\n\u003cp\u003eIt’s Wednesday morning and I’m feeling good.\u003c/p\u003e\n\u003cp\u003eAll my paperwork is up to date. I’ve discussed with my two silent partners (Max and Ghost) what the sponsorship money should be used for and was surprised when they actually agreed with me. We’re going to try to buy the building next door and extend The White Rabbit. We’re all eager to put in a bid for the building. I can’t believe we’ve arranged so much since the sponsorship was only made official on Monday.\u003c/p\u003e\n\u003cp\u003eYou wouldn’t even have the NT3 if not for Tina.\u003c/p\u003e\n\u003cp\u003eI wasn’t lying to Tina when I told her NT3 we’re going to turn me down. I didn’t even fit the criteria. Then hurricane Tina bursts through the door, literally, and Vanessa was smitten.\u003c/p\u003e\n\u003cp\u003eJust like I am.\u003c/p\u003e\n\u003cp\u003eOnly a little.\u003c/p\u003e\n\u003cp\u003eYeah, sure.\u003c/p\u003e\n\u003cp\u003eThey took a big chance on The White Rabbit and I have to make sure they aren’t disappointed. We’re making really good profit through the club nights alone, not counting hiring out the first floor during the week. I’ll make certain they don’t regret it.\u003c/p\u003e\n\u003cp\u003eI had Tina investigated. I knew when I got the file, I had to tell her. She’s a nice girl and I want her to trust me. The only way I can make sure she does that is by being one hundred percent honest with her. Only after I got the information, I was ashamed of myself. How could I think Tina was after me because of my money?\u003c/p\u003e\n\u003cp\u003eShe’s so giving and hasn’t one asked for a thing. I knew she’d have a problem with taking the VIP passes I gave her, that’s why I gave Max specific instructions to make her open it after he left. Then at the club, the girls all tried to return them. The truth is those passes were for only one night. But after spending time with them and then how they stood up for me to Sissy, I made a snap decision to make them permanent VIPs. When they screamed and hugged the life out of me, I’ll admit it felt good.\u003c/p\u003e\n\u003cp\u003eTina must be a fairy or some shit. I’ve never been affectionate. In fact, the thought of being affectionate used to make me sneer. But it’s different with her. Most women who hug or rub up against me in public want to be seen with me or want something from me. Tina, though, you can see it in her face when she hugs you, it’s genuine. It’s her emotions being put out there on display and she doesn’t care who sees.\u003c/p\u003e\n\u003cp\u003eStop smiling, pinhead.\u003c/p\u003e\n\u003cp\u003eI can’t stop. I’ve tried. She hugs me a lot and I like it. I want her hugs. Just for me.\u003c/p\u003e\n\u003cp\u003eI want to talk to her. I log onto the instant messenger.\u003c/p\u003e\n\u003cp\u003eNik123: Hey T, what’s shaking?\u003c/p\u003e\n\u003cp\u003eTheTomicBomb: Not much Niki. How r u?\u003c/p\u003e\n\u003cp\u003eNik123: Good. I’ll be even better if you have lunch with me…\u003c/p\u003e\n\u003cp\u003eTheTomicBomb: Well I want u 2 feel even better so I guess we’re having lunch 2gether! But this 1s on me. I owe u 4 saving me \u0026amp; Nat from starvation.\u003c/p\u003e\n\u003cp\u003eI don’t like this. When I invite someone out, I pay. Always. Not up for negotiation. But I have a plan.\u003c/p\u003e\n\u003cp\u003eNik123: Alright, you’re on.\u003c/p\u003e\n\u003cp\u003eTheTomicBomb: Great! Around 12:30?\u003c/p\u003e\n\u003cp\u003eNik123: I’ll come to the store and get you.\u003c/p\u003e\n\u003cp\u003eTheTomicBomb: See you soon! X\u003c/p\u003e\n\u003cp\u003eTheTomicBomb has logged off.\u003c/p\u003e\n\u003cp\u003eI got a big kiss that time. Nice.\u003c/p\u003e\n\u003cp\u003eI can see Nik exit The White Rabbit through the storefront window.\u003c/p\u003e\n\u003cp\u003eI run into the staff room, check myself in the mirror and grab my purse.\u003c/p\u003e\n\u003cp\u003eRawr Raaawr\u003c/p\u003e\n\u003cp\u003e“Goddamn, that’s an ugly sound,” I hear him say as I walk out of the staff room and look to the counter.\u003c/p\u003e\n\u003cp\u003eNik stands there looking so yummy.\u003c/p\u003e\n\u003cp\u003eHe turns to face me and gives me a dimpled smile “Ready to go, sweetheart?”\u003c/p\u003e\n\u003cp\u003eI stop a moment to take him in. Today he’s gone with a slightly casual look that I’ve never seen him wear. Wearing a tan colored skin-tight sweater that showcases his guns and broad chest, sleeves pushed up to the elbows, black jeans that make his muscular legs look amazing and white Adidas lace-ups. He pulls it off so well. Then again I nicknamed him Mr. Beautiful for a reason. He could wear a potato sack and still look great.\u003c/p\u003e\n\u003cp\u003eI walk right up to him, put an arm around his waist and look up, “Yep! Let’s do it.”\u003c/p\u003e\n\u003cp\u003eHe says goodbye to Nat and Mimi, puts an arm around my shoulder and walks me out of the door.\u003c/p\u003e\n\u003cp\u003eWe walk three blocks wrapped up in each other sharing a comfortable silence.\u003c/p\u003e\n\u003cp\u003eI spot the place I want to go for lunch, look up at him and ask, “You feel a steak?”\u003c/p\u003e\n\u003cp\u003eHe rolls his eyes at me and smiles, “Who doesn’t like a good steak?” He squeezes my shoulder and we walk over to the restaurant.\u003c/p\u003e\n\u003cp\u003eThe restaurant isn’t full but they are still pretty busy for lunch service. We make it to the host station and the lady there smiles when she sees us. I’m sure she thinks we’re a couple and I’m shocked at myself when I don’t care what she thinks. \u003c/p\u003e","sourceLink":"https://allnovel.net/friend-zoned-friend-zoned-1/page-11.html","bookId":2798,"creation":"Oct 5, 2019 5:41:23 PM","modification":"Oct 5, 2019 5:41:23 PM"}
