{"id":90207,"no":17,"title":"Page 17","content":"\u003cp\u003eThis is the best kiss I’ve ever had, hands down. It’s amazing. Nik is amazing. His lips are soft and his tongue is wicked. Stroking mine gently and with precision.\u003c/p\u003e\n\u003cp\u003eHe tastes like mint and cognac. He’s delicious. I’m lost and my hands move of their own accord. One hand cups his cheek while the other grips the lapel of his shirt. I pull him closer to me and I feel his bulge press into my belly. I unconsciously grind myself against it. I squeeze my legs together to stop the tingling. It doesn’t help.\u003c/p\u003e\n\u003cp\u003eBy thunder, he’s huge!\u003c/p\u003e\n\u003cp\u003eThe hand on my neck moves down my arm, around my naked lower back. He opens his palm and slides it down further into my dress. He massages my bare ass softly then grips it tight. My breath hitches and I bite back a moan. I nip his bottom lip then suck on it lightly. His other hand moves from my waist. His fingers creep up my ribs. His hand lightly cups my breast. I can’t stop it, I moan into his mouth. Nik stiffens. His hands fall to my sides then grip my hips tight.\u003c/p\u003e\n\u003cp\u003eNo! Put your damn hand on my boob!\u003c/p\u003e\n\u003cp\u003eBreathing heavily he puts his forehead to mine and closes his eyes. He whispers, “I’m sorry.” It’s no more than a whisper but he may as well have yelled it at me.\u003c/p\u003e\n\u003cp\u003eHe regrets kissing me. Which I suppose is good because friends don’t kiss. Like, ever.\u003c/p\u003e\n\u003cp\u003eWhat a crying shame.\u003c/p\u003e\n\u003cp\u003eHe kisses my cheek for a full second before he turns and leaves the office.\u003c/p\u003e\n\u003cp\u003eMy cheeks are flushed and I rest a hand on my heaving chest.\u003c/p\u003e\n\u003cp\u003eWhat the heck just happened?\u003c/p\u003e\n\u003cp\u003eI really have no idea because I’m tipsy from lust. But I know it changes everything.\u003c/p\u003e\n\u003cp\u003eHell’s bells.\u003c/p\u003e\n\u003cp\u003eI make my way back to the booth. The girls, Trick, and Max are there.\u003c/p\u003e\n\u003cp\u003eNat looks at me and I can’t help but giggle. Yep, still tipsy. She looks at me wide eyed. We’re both flushed. But at least she looks satisfied.\u003c/p\u003e\n\u003cp\u003e“Where’s Nik?” I ask Max.\u003c/p\u003e\n\u003cp\u003eHe shrugs and responds, “Said he had an emergency to take care of, babe. Probably won’t be back tonight.”\u003c/p\u003e\n\u003cp\u003eI nod and look to the table.\u003c/p\u003e\n\u003cp\u003eHe’s avoiding me.\u003c/p\u003e\n\u003cp\u003eIf he thinks I’m giving up his friendship without a fight, he’s got another thing coming.\u003c/p\u003e\n\u003cp\u003eHe can’t just give me four weeks of complete awesomeness and then rip it away from me because of a stupid kiss. Okay, it was an amazing stupid kiss.\u003c/p\u003e\n\u003cp\u003eI have to do something. I’m not losing Nik. I will fight for him.\u003c/p\u003e\n\u003cp\u003eYou better watch yourself, Niki.\u003c/p\u003e\n\u003cp\u003eChapter Twelve\u003c/p\u003e\n\u003cp\u003eFriendship can suck it\u003c/p\u003e\n\u003cp\u003eToday is Tuesday.\u003c/p\u003e\n\u003cp\u003eIt’s been three days since I’ve seen Tina and I’m very obviously avoiding her. She came to my office yesterday and I pleaded with Max to send her away. I told him to tell her I was so busy that I wasn’t seeing anyone. That was a lie. I was sitting at my desk making paper planes and trying to fly them into my waste basket which I’d placed by the door. After she left, Max came into my office, sat at my desk and stared holes into my head. He said, “Whatever you did to fuck up,” he pointed a finger at my chest, “make it better.”\u003c/p\u003e\n\u003cp\u003eWithout waiting for a reply, he left.\u003c/p\u003e\n\u003cp\u003eToday, I turn on my computer and find an instant message waiting for me.\u003c/p\u003e\n\u003cp\u003eTheTomicBomb: Hey stranger, remember me??! I want sushi 2day. U in?\u003c/p\u003e\n\u003cp\u003eWhat the hell?\u003c/p\u003e\n\u003cp\u003eI thought Tina was upset with me. It’s the reason I didn’t see her yesterday. I thought she was getting ready to tear me a new asshole. And it would’ve been deserved. Or cry, which would rip my heart to shreds. I mean I practically groped her while she was drunk. Not something a gentleman does. I took advantage of her.\u003c/p\u003e\n\u003cp\u003eIt was the best kiss of my life but I still took advantage of her.\u003c/p\u003e\n\u003cp\u003eI’m ashamed of myself. My mom brought me up better than that.\u003c/p\u003e\n\u003cp\u003eThis message doesn’t sound like she’s angry with me. In fact it sounds like she’s the same old Tina just wanting to have lunch with her friend.\u003c/p\u003e\n\u003cp\u003eDing\u003c/p\u003e\n\u003cp\u003eTheTomicBomb: If u ever resurface 4 air, let me know. I’ll bring u sushi :)\u003c/p\u003e\n\u003cp\u003eI can’t help my chuckle. I run my hand through my hair.\u003c/p\u003e\n\u003cp\u003eThe weight I’ve been carrying around all weekend disappears.\u003c/p\u003e\n\u003cp\u003eI’m so relieved she isn’t pissed at me. She should be. Thank god she’s doing the mature thing and pretending it never happened.\u003c/p\u003e\n\u003cp\u003eCan you pretend it never happened?\u003c/p\u003e\n\u003cp\u003eI can still feel her suck my bottom lip. When I put my hand down the back of her dress and realized she wasn’t wearing underwear I just about had a stroke. Sweet Jesus, that ass. It’s a nice ass. Soft as silk but firm, too. The perfect ass. Well, my idea of the perfect ass.\u003c/p\u003e\n\u003cp\u003eHer lips are soft, pouty, and so sweet they taste like bubble gum. I want to kiss her again and again.\u003c/p\u003e\n\u003cp\u003eYeah, I like kissing Tina. No, I love kissing Tina. Then she pushed herself up on my hard-on. I almost came like the story I told about my fifteen year old self losing my virginity.\u003c/p\u003e\n\u003cp\u003e…aaand you’re hard. Happy now?\u003c/p\u003e\n\u003cp\u003eKnowing she’d only ever been with the one guy and hasn’t been with him in five years. It made me feel good. Too good. Like, good that you shouldn’t feel about your friends good.\u003c/p\u003e\n\u003cp\u003eGoddamn it. I don’t know how it even happened. One minute we were laughing, the next I was pushing her up against the wall.\u003c/p\u003e\n\u003cp\u003eA sudden urge overcomes me.\u003c/p\u003e\n\u003cp\u003eI have to see her. I need to try and explain myself. I don’t know how I’m going to do that without explaining I’m getting some really strong feelings for her. And I know that’s not what she wants.\u003c/p\u003e\n\u003cp\u003eBut what if she does want it?\u003c/p\u003e\n\u003cp\u003eIf I knew Tina wanted to be with me, I’d snatch her up in a heartbeat. I got those kinds of feelings for her. The one feelings. I can’t believe it myself. The thought of her being with someone else makes acid burn my gut. I want to punch the wall just thinking about it.\u003c/p\u003e\n\u003cp\u003eWhat a mess.\u003c/p\u003e\n\u003cp\u003eAll because of goofy wax lips. I smile at the memory. This adorable little woman being dragged into my office by Max, too shy to even look at me then declaring me her friend… So much has changed. Never met anyone like her in my life. So giving with her heart. I’ll do anything to protect that heart. I want it to be mine to protect.\u003c/p\u003e\n\u003cp\u003eI smile to myself.\u003c/p\u003e\n\u003cp\u003eGot to go see my girl.\u003c/p\u003e\n\u003cp\u003eI see Nik exit The White Rabbit and a chill sweeps through me as my hands start to sweat.\u003c/p\u003e\n\u003cp\u003eWhat if he tells me we can’t be friends anymore?\u003c/p\u003e\n\u003cp\u003eI would just die. Actually drop dead and die.\u003c/p\u003e\n\u003cp\u003eI knew he was in his office yesterday and if I really wanted to I know Max wouldn’t have stopped me from barging in and demanding he talk to me. But I wanted to respect his privacy. He didn’t want to see me for a reason.\u003c/p\u003e\n\u003cp\u003eThis morning when I sent him a message asking to get sushi together I was hoping we could get on like nothing happened.\u003c/p\u003e\n\u003cp\u003eI know he regrets the most amazing kiss of my life. Which kind of sucks but having thought about it over the past two days, I’m okay with it. I was hoping Nik would be my one. I built him up so much in my mind I didn’t stop to protect myself from him. After all, look at how he treats Sissy? If he were to screw me and leave me, I’d be broken. I’ve been there before, it isn’t nice. I’m damaged goods because of it. It sucks to feel safe with someone and have them walk away like you’re nothing to them. That hurts. Like, really hurts. But I would’ve taken the risk with Nik.\u003c/p\u003e\n\u003cp\u003eAm I destined to be that girl?\u003c/p\u003e\n\u003cp\u003eYou know, that girl who loves once and then hates love and everybody in love when her relationship takes a nose dive?\u003c/p\u003e\n\u003cp\u003eNo! Hell, I hope not.\u003c/p\u003e\n\u003cp\u003eI don’t want to become a crazy cat lady!\u003c/p\u003e\n\u003cp\u003eNik regrets the kiss. That’s fine. I’ll be his friend if he’ll let me. I miss him already.\u003c/p\u003e\n\u003cp\u003eRawr Raaawr\u003c/p\u003e\n\u003cp\u003e“Gotta fix that damn bell, babe.” I look over to the doorway and Nik is flashing that charming smile at me. I don’t know why but I run over to him and jump into his arms. I wrap my legs high on his waist and hug him hard.\u003c/p\u003e\n\u003cp\u003eIt’s that damn dimple. It’s magical!\u003c/p\u003e\n\u003cp\u003e“Holy hell, babe. It’s only been three days,” he chuckles at me.\u003c/p\u003e\n\u003cp\u003eThe nerve!\u003c/p\u003e\n\u003cp\u003eI relax my grip on his neck, frown into his face and ask, “Where have you been?”\u003c/p\u003e\n\u003cp\u003eI must look pathetic because his face softens. He holds under my butt with one forearm and puts stray hair behind my ear with the other. His face shows he doesn’t want to end our friendship. In fact, there shines some intense emotion. But I can’t name it.\u003c/p\u003e\n\u003cp\u003eHooray!\u003c/p\u003e\n\u003cp\u003eHe looks me in the eye and says, “I’m sorry, sweetheart. I was snowed under.” His soft face smiles into mine and I want him to kiss me again. My eyes lower and I feel my heart beat faster.\u003c/p\u003e\n\u003cp\u003eNat yells out, “Will you two get a damn room already?” I look over to the counter and find Mimi and Nat smiling like a pair of clowns at me. Nat waves her fingertips daringly.\u003c/p\u003e\n\u003cp\u003eI mock-scowl at them and boom, “Get back to work!” Nik’s face moves to my neck and feel the puffs of breath as he laughs.\u003c/p\u003e\n\u003cp\u003eHe lifts his head and grins saying, “I think you said you wanted sushi today.” I nod. He whispers, “What my girl wants, my girl gets.”\u003c/p\u003e\n\u003cp\u003eMy heart skips a beat.\u003c/p\u003e\n\u003cp\u003eHe means you’re his friend and a girl, dumdass.\u003c/p\u003e\n\u003cp\u003eOh yeah! Of course he does. I wasn’t at all thinking how nice it would be being Nik’s girl.\u003c/p\u003e\n\u003cp\u003eNot. At. All. Nope. Not even a bit.\u003c/p\u003e\n\u003cp\u003eI say, “I should get my purse.” I let go of his neck but he doesn’t set me down. He holds me like a weigh about as much as a paperclip. And it’s nice. Really nice.\u003c/p\u003e\n\u003cp\u003eHe quips, “You know you aren’t paying so you don’t need your purse.” He grins at me then looks to Nat and Mimi and inquires, “You girls want sushi?”\u003c/p\u003e\n\u003cp\u003eThey both nod and look at Nik like he’s oh-so-dreamy. My friends have been replaced by robots.\u003c/p\u003e\n\u003cp\u003eI roll my eyes at them then turn back to him and utter, “You can put me down now, Nik.”\u003c/p\u003e\n\u003cp\u003eHe nods his head to the side and raises one brow, “I could. But I don’t want to. I like you in my arms.” He says the last bit on a whisper and my core spasms. Surely he’s not referring to the other night.\u003c/p\u003e\n\u003cp\u003eHe ran out of the room like it was on fire. Only he left me in the fire.\u003c/p\u003e\n\u003cp\u003eNo, definitely not.\u003c/p\u003e\n\u003cp\u003eI chuckle and slap his shoulder and whine, “C’mon Niki, I’m hungry.”\u003c/p\u003e\n\u003cp\u003eHe reluctantly sets me down and puts an arm around my shoulder. He turns to the girls and says, “We’ll bring you back sushi, girls. See ya.” He lifts his fingers as a goodbye and drags me out of Safira without my purse.\u003c/p\u003e\n\u003cp\u003eWe walk along, my arm tight around his waist the other resting on his belly, his wrapped around my shoulder. It feels so right.\u003c/p\u003e\n\u003cp\u003eI love this. It’s totally natural.\u003c/p\u003e\n\u003cp\u003eWe walk silently to the sushi bar. I dread talking about what happened. We’re seated at the bar and watching out for things we like on the conveyor.\u003c/p\u003e\n\u003cp\u003eIt’s time. I don’t look at him when I begin, “So, Saturday night was pretty intense, huh?”\u003c/p\u003e\n\u003cp\u003eHe stiffens beside me. He sighs and says, “Yeah, about that, I’m so sorry Tina. I don’t know what came over me. I…”\u003c/p\u003e\n\u003cp\u003eI cut him off with a fake laugh, “It’s fine Nik, really. Let’s just call it curiosity between friends. Now that it’s out of our systems we can get on with our lives, right?” I glance over at him and I become confused.\u003c/p\u003e\n\u003cp\u003eIt looks like Nik is in pain. His brows pull in, his eyes are unfocused at my shoulder, and his lips turn hard. He quickly removes the look and plasters on a smile. His eyes still hard.\u003c/p\u003e\n\u003cp\u003e“Yes. Sure. I’m still very sorry.” He says softly, almost mournfully, “It won’t happen again.”\u003c/p\u003e\n\u003cp\u003eIt won’t happen again.\u003c/p\u003e\n\u003cp\u003eWhy is my heart silently breaking if all I want is Nik’s friendship?\u003c/p\u003e\n\u003cp\u003eI want his kisses. I want it to happen again and again. I want more with Nik. I want his love. I don’t think I’d ever get enough of him. Or maybe I just think that because I wanted him to be the one for me. The one who helps me get passed my fears.\u003c/p\u003e\n\u003cp\u003eLet it go.\u003c/p\u003e\n\u003cp\u003e“So, are we still invited to Poker night?” I ask and wiggle my brows at him in a fake display of composure.\u003c/p\u003e\n\u003cp\u003eHe smiles softly, “Yeah. Wouldn’t be the same without you.”\u003c/p\u003e\n\u003cp\u003eHuzzah! Friends are we!\u003c/p\u003e\n\u003cp\u003eWednesday night I invited the girls over for a girl’s night at my apartment.\u003c/p\u003e\n\u003cp\u003eI baked caramel mud cupcakes with fudge sauce in the middle. These are Mimi’s all-time favorite.\u003c/p\u003e\n\u003cp\u003eI only have the one sofa so we spend it under the covers of my king sized bed.\u003c/p\u003e\n\u003cp\u003eMe and Nat on one side of the mattress, Lola and Meems on the other with Bear accepting cuddles and pats from all sides smack dab in the middle.\u003c/p\u003e\n\u003cp\u003eMimi starts the questioning as soon as we’re in bed. “Okay. I’m bringing something up that I know we are all curious about.” She looks right at me. “What’s the deal with you and Nik?”\u003c/p\u003e\n\u003cp\u003eI chew my tongue for a second. I don’t know what to tell them. I decide honesty is the best choice. I scratch the side of my neck, look down and tell them, “I thought Nik might be the one.”\u003c/p\u003e\n\u003cp\u003eI hear multiple gasps. I look up and see three pairs of wide eyes and open mouths gaping like fishes out of water.\u003c/p\u003e\n\u003cp\u003eI giggle.\u003c/p\u003e\n\u003cp\u003eLola chides, “How can you laugh at a time like this?!”\u003c/p\u003e\n\u003cp\u003eNat speaks softly, “That’s great, babe. He’s totally into you. Go for it.” She smiles.\u003c/p\u003e\n\u003cp\u003eWhen I make a scoffing sound she scowls at me and says, “What’s that all about?”\u003c/p\u003e\n\u003cp\u003eI play with the cover of my quilt and assure them, “He’s not into me. Not even a little.”\u003c/p\u003e\n\u003cp\u003eThe girls all look at each other and burst into hysterical laughter.\u003c/p\u003e\n\u003cp\u003eI feel myself becoming flushed. I like people laughing with me but I don’t like being laughed at.\u003c/p\u003e\n\u003cp\u003eI steel my voice and growl, “Don’t laugh at me.”\u003c/p\u003e\n\u003cp\u003eNat immediately stops laughing and responds, “I’m sorry honey, we aren’t laughing at you. You’re just so sweet you can’t even see Nik is head over heels for you.”\u003c/p\u003e\n\u003cp\u003eLola smiles and confirms, “He is Tina. You should see him. When you’re in a room he doesn’t even pay attention to anyone else.”\u003c/p\u003e\n\u003cp\u003eMimi nudges my foot with hers and swears, “Yeah, doll, he loves being wrapped up in all that is Tina. In a big way.” \u003c/p\u003e","sourceLink":"https://allnovel.net/friend-zoned-friend-zoned-1/page-17.html","bookId":2798,"creation":"Oct 5, 2019 5:41:23 PM","modification":"Oct 5, 2019 5:41:23 PM"}
