{"id":90224,"no":34,"title":"Page 34","content":"\u003cp\u003eI undo my belt and zipper to work my shirt back into my pants when the office door opens. I turn to see who it is.\u003c/p\u003e\n\u003cp\u003eOh Fuck!\u003c/p\u003e\n\u003cp\u003eI open the door to Nik’s office and freeze.\u003c/p\u003e\n\u003cp\u003eNik is standing with his zipper undone. Sissy is on her knees before Nik, wiping at the corners of her mouth trying to fix her lipstick which is all over Nik’s mouth. When she sees me, she smirks.\u003c/p\u003e\n\u003cp\u003eThere is a fist wrapped around my heart and it squeezes, hard.\u003c/p\u003e\n\u003cp\u003eI fight to keep breathing.\u003c/p\u003e\n\u003cp\u003eI lock my knees to stop them from shaking. I feel ill.\u003c/p\u003e\n\u003cp\u003eDread seeps through my body.\u003c/p\u003e\n\u003cp\u003eMy heart is breaking.\u003c/p\u003e\n\u003cp\u003eDisgust claws at my eyes and begs for me to look away. And I do.\u003c/p\u003e\n\u003cp\u003eUsing my hand I shield my view because, let’s face it, I don’t want to see Sissy smirk over the blowjob she just gave Nik. I croak, “I’m sorry. I didn’t mean to barge in.” It comes out thick, my mouth is suddenly dry.\u003c/p\u003e\n\u003cp\u003eHow pathetic am I?\u003c/p\u003e\n\u003cp\u003eI walk in to my boyfriend’s office and catch him cheating on me with a She-Devil and I apologize.\u003c/p\u003e\n\u003cp\u003eThen I turn my back and walk my shattered heart out.\u003c/p\u003e\n\u003cp\u003eI hear someone yell out my name but it sounds miles away.\u003c/p\u003e\n\u003cp\u003eHow the fuck did this happen?\u003c/p\u003e\n\u003cp\u003eI tuck my shirt into my pants and zip myself up. I look down at Sissy and rage coils tight in my gut.\u003c/p\u003e\n\u003cp\u003eThe stupid bitch is smirking.\u003c/p\u003e\n\u003cp\u003eI may have just lost the love of my life and she taunts me. My blood boils.\u003c/p\u003e\n\u003cp\u003eKill her.\u003c/p\u003e\n\u003cp\u003eNo control.\u003c/p\u003e\n\u003cp\u003eI put my hand to her throat, lift her up by it and squeeze hard. She sputters and slaps at my hands.\u003c/p\u003e\n\u003cp\u003eI ask in a quiet but deadly voice, “Get what you wanted, you sick twisted cunt?”\u003c/p\u003e\n\u003cp\u003eHer wide eyes are watering and she gasps for air. Her nails dig in to my hand.\u003c/p\u003e\n\u003cp\u003eI don’t care. I’ve lost control, maybe even my mind.\u003c/p\u003e\n\u003cp\u003eUsing the hand at her throat, I walk Sissy backwards into the wall. Her lips are turning blue and her eyes are drifting closed.\u003c/p\u003e\n\u003cp\u003eI vaguely hear, “What the fuck?” Then arms are all over me pulling me away.\u003c/p\u003e\n\u003cp\u003eMax turns my head to face him. He’s saying something but I can’t hear him. Ghost, Trick, and Max all have their arms on me, yelling things at me. I see their mouths moving but there is no sound.\u003c/p\u003e\n\u003cp\u003eSissy slides down the wall clutching her neck and gasping violently for air.\u003c/p\u003e\n\u003cp\u003eMy eyes drift to the door and I see Mimi, Nat, and Lola staring wide eyed and open mouthed at Sissy.\u003c/p\u003e\n\u003cp\u003eI shrug out of the hold the guys have me in and walk over to Nat. She’s my only hope at this point.\u003c/p\u003e\n\u003cp\u003eLifting my hands, I hold her face. She looks worried. I say confidently, “I swear to you on Tina’s life, nothing happened.”\u003c/p\u003e\n\u003cp\u003eI hold her face firm but her eyes drift to Sissy. She looks at Sissy a long time before she whispers, “I believe you.”\u003c/p\u003e\n\u003cp\u003eI pull her towards me and kiss her forehead. She moves her hands over mine which are holding her face. I rest my chin against her forehead and whisper, “Where is she?”\u003c/p\u003e\n\u003cp\u003eNat shrugs against me.\u003c/p\u003e\n\u003cp\u003eThis night can’t get any worse.\u003c/p\u003e\n\u003cp\u003eI stumble onto of the club.\u003c/p\u003e\n\u003cp\u003eLuckily, I got my purse before I left. My cell phone blasts Nik’s ringtone – Beyoncé’s ‘Halo’.\u003c/p\u003e\n\u003cp\u003eNo way am I answering.\u003c/p\u003e\n\u003cp\u003eB-Rock looks concerned but lets me on my way without stopping me.\u003c/p\u003e\n\u003cp\u003eAs I cross the street, I listen to Beyoncé sing the first verse.\u003c/p\u003e\n\u003cp\u003eRemember those walls I built,\u003c/p\u003e\n\u003cp\u003eWell, baby, they’re tumbling down,\u003c/p\u003e\n\u003cp\u003eAnd they didn’t even put up a fight,\u003c/p\u003e\n\u003cp\u003eThey didn’t even make a sound.\u003c/p\u003e\n\u003cp\u003eFuck off, Beyoncé. There’s no such thing as angels. No one wears a halo. And if they do it’s only to disguise the pointed horns that sit atop their heads.\u003c/p\u003e\n\u003cp\u003eI told Nik I didn’t trust my instincts when it came to men and it looks like I was right on the money.\u003c/p\u003e\n\u003cp\u003eWomen say it all the time. I didn’t even see it coming.\u003c/p\u003e\n\u003cp\u003eI thought we were happy.\u003c/p\u003e\n\u003cp\u003eA sob tears out of my throat just as I’m unlocking the door to Safira.\u003c/p\u003e\n\u003cp\u003eIt starts a torrent of tears. I sob so hard I can’t pull in a full breath.\u003c/p\u003e\n\u003cp\u003eIt takes me a minute to get in the door. Once I’m in, I lock it behind me. I turn off the alarm, keep the lights off and stumble. On my knees in the middle of my store. A store I don’t want to own anymore if it means I’ll have to see Nik every day. Still sobbing, my eyes blur and I can’t see but I crawl my way to the general direction of the store room.\u003c/p\u003e\n\u003cp\u003eHeartbreak and sorrow swirl through my limp body.\u003c/p\u003e\n\u003cp\u003eMy knees hurt. I wheeze, huff and puff.\u003c/p\u003e\n\u003cp\u003eScrew you, Panic attack!\u003c/p\u003e\n\u003cp\u003eI can’t breathe. I think I’m going to pass out.\u003c/p\u003e\n\u003cp\u003eAnd I do.\u003c/p\u003e\n\u003cp\u003eIt’s been an hour and I still can’t find Tina.\u003c/p\u003e\n\u003cp\u003eI’m sick with worry. We’ve looked everywhere.\u003c/p\u003e\n\u003cp\u003eWhere could she be?\u003c/p\u003e\n\u003cp\u003eDread fills me.\u003c/p\u003e\n\u003cp\u003eWhat if something happened to her?\u003c/p\u003e\n\u003cp\u003eNat told me she wouldn’t answer my calls so I stopped trying. Nat kept calling her from her phone but not getting an answer. I can tell by the look on her face that isn’t good.\u003c/p\u003e\n\u003cp\u003eI kicked Sissy out and told her if she even tried to press charges against me I’d out her for the coke addict she is. Her daddy would disown her if it came out. The stupid bitch told me all about it.\u003c/p\u003e\n\u003cp\u003eEveryone is crammed into my office and they all look like I’m about to go postal.\u003c/p\u003e\n\u003cp\u003eWhich I just might if we don’t find Tina soon.\u003c/p\u003e\n\u003cp\u003eNat gasps and slaps a hand over her head. She knows something.\u003c/p\u003e\n\u003cp\u003eI run to her and take her hands in mine. She whispers, “Safira.”\u003c/p\u003e\n\u003cp\u003eMy fuckin’ god.\u003c/p\u003e\n\u003cp\u003eHow stupid am I?\u003c/p\u003e\n\u003cp\u003eI don’t wait for anyone. I run out of the club into traffic and luckily make it to the other side unscathed. I try the door but it’s locked. I look inside but its pitch black. It doesn’t look like she’s here.\u003c/p\u003e\n\u003cp\u003eMy cell phone rings and I answer. I hear Ghost say calmly, “She’s in there man. Collapsed. Get in there.”\u003c/p\u003e\n\u003cp\u003eI drop my cell phone and use my elbow to try and break the thick glass of the door.\u003c/p\u003e\n\u003cp\u003eIt doesn’t budge.\u003c/p\u003e\n\u003cp\u003eI try again and again til my elbow pulses with pain and is raw and bleeding but it won’t break. I roar in anguish and move to the display window, I walk back a few steps then run and throw my shoulder into it.\u003c/p\u003e\n\u003cp\u003eIt breaks.\u003c/p\u003e\n\u003cp\u003eI’m covered in glass and I feel blood drip into my eye but I don’t care.\u003c/p\u003e\n\u003cp\u003eI walk between the mannequins through to the studio. And there she is.\u003c/p\u003e\n\u003cp\u003eI rush over to her and lift her limp body.\u003c/p\u003e\n\u003cp\u003eOut cold.\u003c/p\u003e\n\u003cp\u003eBlood drips from my forehead and eye onto her cheek.\u003c/p\u003e\n\u003cp\u003eI open the store, hail a cab, and take her home.\u003c/p\u003e\n\u003cp\u003eMy eyes flutter open then closed.\u003c/p\u003e\n\u003cp\u003eThey’re so heavy I can’t lift my lids.\u003c/p\u003e\n\u003cp\u003eI try again and after a few attempts I manage to squint a little.\u003c/p\u003e\n\u003cp\u003eThere is a low light coming from beside me and I try to lift my loose body into a sitting position. Just as I’m about to give up and lay back down, arms come under mine and help me.\u003c/p\u003e\n\u003cp\u003eMy head is pounding, it feel as though blood is rushing to my brain.\u003c/p\u003e\n\u003cp\u003eI look left and see a concerned Nat sits next to me on the bed. I look around the room and blanch.\u003c/p\u003e\n\u003cp\u003eThis is Nik’s room.\u003c/p\u003e\n\u003cp\u003eWhat am I doing in Nik’s room?\u003c/p\u003e\n\u003cp\u003e“What am I doing here?” I whisper.\u003c/p\u003e\n\u003cp\u003eNat puts her arm around me and explains, “I know you’re upset, T. But it was all a big misunderstanding.”\u003c/p\u003e\n\u003cp\u003eMy eyes widen in disbelief. I groan and put a shaking hand to my pounding skull.\u003c/p\u003e\n\u003cp\u003eShe goes on quietly, “You didn’t see what we saw, babe. He had Sissy backed up against a wall and was choking the life out of her. Does that sound like a man who was happily having an affair?”\u003c/p\u003e\n\u003cp\u003eHe did what?!\u003c/p\u003e\n\u003cp\u003eThat does sound unusual.\u003c/p\u003e\n\u003cp\u003eI remain quiet.\u003c/p\u003e\n\u003cp\u003eNat continues, “When you walked in on that scene, and it was a scene planned by Sissy by the way, Nik was devastated. He thinks he’s lost you, Tina. He’s a mess.”\u003c/p\u003e\n\u003cp\u003eI’m at war with myself.\u003c/p\u003e\n\u003cp\u003eI want to believe it. My heart says yes and my head counters with a big fat nuh uh.\u003c/p\u003e\n\u003cp\u003eNat squeezes my shoulder and states confidently, “Tina, when he looked in my eyes and said nothing happened, I believed him. He loves you. And he doesn’t even like her. I saw the look in his eye, it was pure and honest.”\u003c/p\u003e\n\u003cp\u003eAnd there it is.\u003c/p\u003e\n\u003cp\u003eNat would never lie to me. If she believes Nik, she has reason to.\u003c/p\u003e\n\u003cp\u003eAfter a moment of silence I ask quietly, “Can you get Nik for me please?”\u003c/p\u003e\n\u003cp\u003eShe smiles at me and responds, “Of course, beba.” I smile softly.\u003c/p\u003e\n\u003cp\u003eMy mom used to call me beba all the time. It means baby in Croatian.\u003c/p\u003e\n\u003cp\u003eShe exits the room and suddenly I’m nervous and sweating.\u003c/p\u003e\n\u003cp\u003eWhat if it Nik doesn’t want me anymore because I believed he’d do something like that to me?\u003c/p\u003e\n\u003cp\u003eThe door opens, I turn to look and see Nik stand hesitating in the doorway.\u003c/p\u003e\n\u003cp\u003eI try so hard to be strong but I crumple. I cover my face with my hands and burst into heart wrenching, uncontrollable sobs.\u003c/p\u003e\n\u003cp\u003eI feel the bed depress and in a moment I’m lifted onto Nik’s lap. He cradles me like a parent would their child.\u003c/p\u003e\n\u003cp\u003eHe coos, “It’s okay, sweetheart. You’re okay now.” And he kisses my head and rocks me til I calm.\u003c/p\u003e\n\u003cp\u003eI sob and sputter, “I’m s- s- sorry. Sissy’s a b- b- bitch.” I finish on a wail.\u003c/p\u003e\n\u003cp\u003eI feel Nik’s shake with laughter and he agrees, “Yeah, babe. She is. A big one.”\u003c/p\u003e\n\u003cp\u003eWe stay quiet for a while and hold each other. Nik breaks the silence.\u003c/p\u003e\n\u003cp\u003eHe whispers, “I would never, ever hurt you like that, Tina. If I ever thought I was going to cheat on you, I’d break up with you. But I don’t want to cheat on you.” He strokes my hair and continues “You’re my life. Nothing is more important to me than you. But I was there and I know what you think you saw. And it looked very bad. I’m sure if I’d walked in on you and another man in the same position I’d probably kill the guy.”\u003c/p\u003e\n\u003cp\u003eOh, thank god!\u003c/p\u003e\n\u003cp\u003eHe understands!\u003c/p\u003e\n\u003cp\u003eHe wipes under my eyes and I lift my face to look at him. When his eyes reach mine I gasp.\u003c/p\u003e\n\u003cp\u003eI shriek, “YOU’RE HURT!”\u003c/p\u003e\n\u003cp\u003eHis already scarred eyebrow is swollen and stitched. He has little cuts on his forehead and his elbow is bandaged up.\u003c/p\u003e\n\u003cp\u003eHe cringes and says, “Yeah. About that, I called a guy to replace your store window. I kinda ran through it.”\u003c/p\u003e\n\u003cp\u003eMy belly warms and my heart squeezes.\u003c/p\u003e\n\u003cp\u003eI whisper, “You ran through a wall of glass to get to me?”\u003c/p\u003e\n\u003cp\u003eHe looks miserable and nods. He whispers back, “I thought you were hurt, baby. I’d trek through the fires of hell to get to you if I had to.”\u003c/p\u003e\n\u003cp\u003eI lean forward, hold his jaw with my fingertips, and kiss his lips softly.\u003c/p\u003e\n\u003cp\u003eMy lips quiver as I whisper against them, “I love you so much, Nik. I was so hurt. I thought you didn’t want me anymore.”\u003c/p\u003e\n\u003cp\u003eHe pulls me close and kisses me deep. He pulls away and replies, “I know, baby. I’m so sorry you were hurt. I guess people have it out for us. But I love you.” He pecks my lips then continues. “The whole point of love is to trust someone with your heart and pray they don’t break it. It’s about faith in each other. I gave you my heart when I told you I loved you which means I’m giving you power over me.”\u003c/p\u003e\n\u003cp\u003eI bury my face into his neck and breathe him in.\u003c/p\u003e\n\u003cp\u003eI never thought of it like that before. I guess I hold the same amount of power over Nik as he has over me. Love is sacred. A gift from one person to another. Love binds people together, no matter how different they might be.\u003c/p\u003e\n\u003cp\u003eIs it scary?\u003c/p\u003e\n\u003cp\u003eHell, yes!\u003c/p\u003e\n\u003cp\u003eBut if we never did the scary things in life we’d lead awfully boring lives.\u003c/p\u003e\n\u003cp\u003eTake the chance.\u003c/p\u003e\n\u003cp\u003eBut I might get hurt.\u003c/p\u003e\n\u003cp\u003eYes, you might. But maybe you won’t.\u003c/p\u003e\n\u003cp\u003eYeah.\u003c/p\u003e\n\u003cp\u003eMaybe I won’t.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-four\u003c/p\u003e\n\u003cp\u003eThe secret life of Tina\u003c/p\u003e\n\u003cp\u003eIt’s been a little over a week since Sissy made her play for Nik.\u003c/p\u003e\n\u003cp\u003eYesterday was Monday and I felt a little sick. But I dragged my butt to work as most people do.\u003c/p\u003e\n\u003cp\u003eI ended up getting through half the day of moping around and sniffling before Meems and Nat sent me to Nik’s office with a note.\u003c/p\u003e\n\u003cp\u003eIt honestly felt like I was being sent to the principal’s office.\u003c/p\u003e\n\u003cp\u003eWhen I arrive at Nik’s office I see his face fall with worry at the state of obvious me. I drag myself over to him and hand him the note. His eyes narrow but he takes it from me and reads it silently.\u003c/p\u003e\n\u003cp\u003eNik puts the note on the desk and bursts out laughing.\u003c/p\u003e\n\u003cp\u003eI lean over the desk and read.\u003c/p\u003e\n\u003cp\u003eI will pay you one hundred dollars if you keep her for the rest of the day. I love her to death but she totally sucks when she’s sick. Love Nat x\u003c/p\u003e\n\u003cp\u003eWell, I never!\u003c/p\u003e\n\u003cp\u003eI feign hurt.\u003c/p\u003e\n\u003cp\u003eBut my friend is not wrong. I do suck when I’m sick. I become a petulant five year old.\u003c/p\u003e\n\u003cp\u003eNik catches me in a bear hug. He’s so warm. My sniffles are muffled and I’m sure I’m getting boogers on him. I say in a nasal voice, “Don’t hug me, babe, you’re going to get sick.”\u003c/p\u003e\n\u003cp\u003eHe rubs my back.\u003c/p\u003e\n\u003cp\u003eThat feels nice.\u003c/p\u003e\n\u003cp\u003eHe replies, “Don’t worry about me, sweetheart.” He pulls back and kisses my nose. “I never get sick.”\u003c/p\u003e\n\u003cp\u003eThis brings us to today.\u003c/p\u003e\n\u003cp\u003eI’m no longer sick, in fact, I feel great. I guess it was just a twenty four hour virus. Nik’s warm hugs and the endless tea he brought me yesterday seem to have worked.\u003c/p\u003e\n\u003cp\u003eEarly this morning I receive a multimedia message. It’s from Max and the subject says: An eye for an eye.\u003c/p\u003e\n\u003cp\u003eIt’s a photo. Of Nik.\u003c/p\u003e\n\u003cp\u003eThe photo has been taken about an inch from his sleeping face. His mouth is wide open because there are balled up tissues stuffed up his nostrils. The ends of the tissues flare out around his mouth. Beads of sweat roll down his forehead.\u003c/p\u003e\n\u003cp\u003eYep.\u003c/p\u003e\n\u003cp\u003eMr. I-Never-Get-Sick...got sick.\u003c/p\u003e\n\u003cp\u003eMy body shakes with silent laughter and I save the image to my Nik’s name on my phone so whenever he calls it’ll come up.\u003c/p\u003e\n\u003cp\u003eI knock lightly on Nat’s bedroom door and tell her I’ll be looking after Nik today. She nods and I leave my keys on her bedside table. Then I call Max and tell him he’s in charge today at The White Rabbit. He answers with an amused, “Yes ma’am.” \u003c/p\u003e","sourceLink":"https://allnovel.net/friend-zoned-friend-zoned-1/page-34.html","bookId":2798,"creation":"Oct 5, 2019 5:41:23 PM","modification":"Oct 5, 2019 5:41:23 PM"}
