{"id":8088,"no":7,"title":"Chapter 7","content":"Tyeglev was for a long time turning from side to side on his bench and I could not get to sleep, either. Whether his stories had excited my nerves or the strange night had fevered my blood — anyway, I could not go to sleep. All inclination for sleep disappeared at last and I lay with my eyes open and thought, thought intensely, goodness knows of what; of most senseless trifles — as always happens when one is sleepless. Turning from side to side I stretched out my hands. . . . My finger hit one of the beams of the wall. It emitted a faint but resounding, and as it were, prolonged note. . . . I must have struck a hollow place.\n\u003cbr\u003e \n\u003cbr\u003e I tapped again . . . this time on purpose. The same sound was repeated. I knocked again. . . . All at once Tyeglev raised his head.\n\u003cbr\u003e \n\u003cbr\u003e “Ridel!” he said, “do you hear? Someone is knocking under the window.”\n\u003cbr\u003e \n\u003cbr\u003e I pretended to be asleep. The fancy suddenly took me to play a trick at the expense of my “fatal” friend. I could not sleep, anyway.\n\u003cbr\u003e \n\u003cbr\u003e He let his head sink on the pillow. I waited for a little and again knocked three times in succession.\n\u003cbr\u003e \n\u003cbr\u003e Tyeglev sat up again and listened. I tapped again. I was lying facing him but he could not see my hand. . . . I put it behind me under the bedclothes.\n\u003cbr\u003e \n\u003cbr\u003e “Ridel!” cried Tyeglev.\n\u003cbr\u003e \n\u003cbr\u003e I did not answer.\n\u003cbr\u003e \n\u003cbr\u003e “Ridel!” he repeated loudly. “Ridel!”\n\u003cbr\u003e \n\u003cbr\u003e “Eh? What is it?” I said as though just waking up.\n\u003cbr\u003e \n\u003cbr\u003e “Don’t you hear, someone keeps knocking under the window, wants to come in, I suppose.”\n\u003cbr\u003e \n\u003cbr\u003e “Some passer-by,” I muttered.\n\u003cbr\u003e \n\u003cbr\u003e “Then we must let him in or find out who it is.”\n\u003cbr\u003e \n\u003cbr\u003e But I made no answer, pretending to be asleep.\n\u003cbr\u003e \n\u003cbr\u003e Several minutes passed. . . . I tapped again. Tyeglev sat up at once and listened.\n\u003cbr\u003e \n\u003cbr\u003e “Knock . . . knock . . . knock! Knock . . . knock . . . knock!”\n\u003cbr\u003e \n\u003cbr\u003e Through my half-closed eyelids in the whitish light of the night I could distinctly see every movement he made. He turned his face first to the window then to the door. It certainly was difficult to make out where the sound came from: it seemed to float round the room, to glide along the walls. I had accidentally hit upon a kind of sounding board.\n\u003cbr\u003e \n\u003cbr\u003e “Ridel!” cried Tyeglev at last, “Ridel! Ridel!”\n\u003cbr\u003e \n\u003cbr\u003e “Why, what is it?” I asked, yawning.\n\u003cbr\u003e \n\u003cbr\u003e “Do you mean to say you don’t hear anything? There is someone knocking.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, what if there is?” I answered and again pretended to be asleep and even snored.\n\u003cbr\u003e \n\u003cbr\u003e Tyeglev subsided.\n\u003cbr\u003e \n\u003cbr\u003e “Knock . . . knock . . . knock!”\n\u003cbr\u003e \n\u003cbr\u003e “Who is there?” Tyeglev shouted. “Come in!”\n\u003cbr\u003e \n\u003cbr\u003e No one answered, of course.\n\u003cbr\u003e \n\u003cbr\u003e “Knock . . . knock . . . knock!”\n\u003cbr\u003e \n\u003cbr\u003e Tyeglev jumped out of bed, opened the window and thrusting out his head, cried wildly, “Who is there? Who is knocking?” Then he opened the door and repeated his question. A horse neighed in the distance — that was all.\n\u003cbr\u003e \n\u003cbr\u003e He went back towards his bed.\n\u003cbr\u003e \n\u003cbr\u003e “Knock . . . knock . . . knock!”\n\u003cbr\u003e \n\u003cbr\u003e Tyeglev instantly turned round and sat down.\n\u003cbr\u003e \n\u003cbr\u003e “Knock . . . knock . . . knock!”\n\u003cbr\u003e \n\u003cbr\u003e He rapidly put on his boots, threw his overcoat over his shoulders and unhooking his sword from the wall, went out of the hut. I heard him walk round it twice, asking all the time, “Who is there? Who goes there? Who is knocking?” Then he was suddenly silent, stood still outside near the corner where I was lying and without uttering another word, came back into the hut and lay down without taking off his boots and overcoat.\n\u003cbr\u003e \n\u003cbr\u003e “Knock . . . knock . . . knock!” I began again. “Knock . . . knock . . . knock!”\n\u003cbr\u003e \n\u003cbr\u003e But Tyeglev did not stir, did not ask who was knocking, and merely propped his head on his hand.\n\u003cbr\u003e \n\u003cbr\u003e Seeing that this no longer acted, after an interval I pretended to wake up and, looking at Tyeglev, assumed an air of astonishment.\n\u003cbr\u003e \n\u003cbr\u003e “Have you been out?” I asked.\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” he answered unconcernedly.\n\u003cbr\u003e \n\u003cbr\u003e “Did you still hear the knocking?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “And you met no one?”\n\u003cbr\u003e \n\u003cbr\u003e “No.”\n\u003cbr\u003e \n\u003cbr\u003e “And did the knocking stop?”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t know. I don’t care now.”\n\u003cbr\u003e \n\u003cbr\u003e “Now? Why now?”\n\u003cbr\u003e \n\u003cbr\u003e Tyeglev did not answer.\n\u003cbr\u003e \n\u003cbr\u003e I felt a little ashamed and a little vexed with him. I could not bring myself to acknowledge my prank, however.\n\u003cbr\u003e \n\u003cbr\u003e “Do you know what?” I began, “I am convinced that it was all your imagination.”\n\u003cbr\u003e \n\u003cbr\u003e Tyeglev frowned. “Ah, you think so!”\n\u003cbr\u003e \n\u003cbr\u003e “You say you heard a knocking?”\n\u003cbr\u003e \n\u003cbr\u003e “It was not only knocking I heard.”\n\u003cbr\u003e \n\u003cbr\u003e “Why, what else?”\n\u003cbr\u003e \n\u003cbr\u003e Tyeglev bent forward and bit his lips. He was evidently hesitating.\n\u003cbr\u003e \n\u003cbr\u003e “I was called!” he brought out at last in a low voice and turned away his face.\n\u003cbr\u003e \n\u003cbr\u003e “You were called? Who called you?”\n\u003cbr\u003e \n\u003cbr\u003e “Someone. . . . ” Tyeglev still looked away. “A woman whom I had hitherto only believed to be dead . . . but now I know it for certain.”\n\u003cbr\u003e \n\u003cbr\u003e “I swear, Ilya Stepanitch,” I cried, “this is all your imagination!”\n\u003cbr\u003e \n\u003cbr\u003e “Imagination?” he repeated. “Would you like to hear it for yourself?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “Then come outside.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/972/29354.html","bookId":267,"creation":"Aug 1, 2019 8:13:36 AM","modification":"Aug 1, 2019 8:13:36 AM"}
