{"id":99227,"no":15,"title":"Page 15","content":"\u003cp\u003eIt clatters to the floor a few meters from me, skidding into Vel’s sonicblade. I can’t cower here. I have to do something. I’m not the only jumper for once, so my life isn’t more valuable than anyone else’s.\u003c/p\u003e\n\u003cp\u003eKnowing any movement could draw their lethal hunger, knowing I might feel a spear through my intestines at any second, I crawl along the floor toward the sonicblade. I could die.\u003c/p\u003e\n\u003cp\u003eWell, I’m willing.\u003c/p\u003e\n\u003cp\u003eI pinch the soft skin of my inner wrist. I need pain, need it to focus and stay in the here and now. I can’t give in to the fuzziness building inside my head.\u003c/p\u003e\n\u003cp\u003eThe swarm atop Velith finally processes that they aren’t sucking down sweet, delicious blood. Some fall into convulsions, a putrid froth boiling from their fanged maws. Some stagger away, weak and dying. Only two look as though they could fight. That’s three too many, and they’re all stalking March.\u003c/p\u003e\n\u003cp\u003eAt this point, they don’t register anyone else as a threat. We’re beaten. Food.\u003c/p\u003e\n\u003cp\u003eHe backs toward the terminal, trying to lead them away from me.\u003c/p\u003e\n\u003cp\u003eOh, no you don’t. We have too much to do yet. You’re not dying for me.\u003c/p\u003e\n\u003cp\u003e“Who better?” he says aloud.\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eAs it lunges to dismember him, I hurl the knife.\u003c/p\u003e\n\u003cp\u003eCHAPTER 18\u003c/p\u003e\n\u003cp\u003eThe blade whistles as it spins end over end and buries itself in the Morgut’s faceted eye. Lucky shot. Though its brain has shut down, it will take a while for the body to figure that out. Its high-pitched death shriek distracts the other two long enough for March to dive toward Vel’s body. At first I think he’s lost his mind because he rolls across him, smearing himself with the bounty hunter’s blood.\u003c/p\u003e\n\u003cp\u003eHe muffles a pained sound. I imagine it stings like hell, but now I get it. Suddenly, he’s tainted meat. They can’t just sink their teeth in and feast. He’ll need to be hosed off first.\u003c/p\u003e\n\u003cp\u003eDamned inconvenient, isn’t it, you greedy bastards?\u003c/p\u003e\n\u003cp\u003eThe other two chitter and clack, clawed forelegs waving with genuine menace. Maybe they’re discussing the best course of action or marveling at the ingenuity of their prey. Maybe they’re considering unconditional surrender because we might all be Ithtorians beneath the skin.\u003c/p\u003e\n\u003cp\u003eHey, I can dream.\u003c/p\u003e\n\u003cp\u003eBut even if they want to parlay, we have no way to talk to them, and I’m sure they don’t speak universal. Why would they bother? Humans certainly never troubled to learn bovine back when we were still eating cows.\u003c/p\u003e\n\u003cp\u003eVel might have translated—but he’s out. He needs medical attention, and Jael must be dead. I can help best by keeping out of trouble. They might have qualms about going after March with their fangs, but I have no such protection.\u003c/p\u003e\n\u003cp\u003eSo I stay low and scuttle along the floor, slippery with blood, bowels, and insect innards for which I have no name. The smell nearly compels me to add my dinner to the mess as I try to make my way toward the fallen Morgut with the knife in his head. If I can get that to March without being seen, he may have a chance. He stands in a battle-ready crouch, waiting for their strike, most likely in unison. They’ll use their claws, not fangs, but if they coordinate it well, he’s doomed.\u003c/p\u003e\n\u003cp\u003eThe room is queerly lit by fallen torch-tubes, a flickering yellow-green glow that gives the maintenance shop a surreal, hellish air. Smoky gas lingers, ebbs, and eddies, adding to the infernal atmosphere. I pass into pockets that make me light-headed. I’m tempted to rest my eyes until it passes. Sleep will make it better—\u003c/p\u003e\n\u003cp\u003eCan’t. Vel told me to stay awake.\u003c/p\u003e\n\u003cp\u003eI shake off the confusion with sheer will. Please don’t let them notice me. My own movements look oddly staccato as I slide behind boxes and barrels, and then crawl on my belly through the muck toward the twitching monster. The blade makes a sucking motion as I yank it out, and then the faint hum kicks in. Good, still functional.\u003c/p\u003e\n\u003cp\u003eI slap it across the floor so it bounces against his boot. Low G gives it extra lift when he kicks it upward and catches it by the handle as if we’ve orchestrated the maneuver hundreds of times before. The Morgut lunge for him as one, but he’s got a shot now.\u003c/p\u003e\n\u003cp\u003e“Fuck it,” March says, as he wheels into the fight. “I’ll play the doomed hero another day. Don’t worry, Jax.”\u003c/p\u003e\n\u003cp\u003eMy chest feels tight. Even now, he reassures me.\u003c/p\u003e\n\u003cp\u003eMaybe I’ve given him the edge he needs, but I can’t watch. I need to stay away from the action, or I may offer these monsters a hostage. Worse, they might stab me through the throat on the backswing.\u003c/p\u003e\n\u003cp\u003eI take refuge behind a crate of machine parts, come around the other side, and find Jael’s body. Blood still bubbles sluggishly out of his gut wound around the limb that skewered him. His face looks impossibly young, pure and clean, despite the filth that surrounds us.\u003c/p\u003e\n\u003cp\u003eWhen his eyes snap open, I recoil. In the distance I hear March swearing steadily. That’s good, means he’s still alive, for now. Holding his own.\u003c/p\u003e\n\u003cp\u003eBefore Jael speaks, I’m sure I know what he’s going to ask of me—a mercy killing. End his pain. But I don’t have a weapon. Lost my shockstick, the disruptor won’t charge, and March has the blade. How can I let this poor bastard suffer?\u003c/p\u003e\n\u003cp\u003e“Pull it out.” His voice comes out thick and wet. I can hear fluid in his throat, probably from his internal injuries. “Do it fast, damn you.”\u003c/p\u003e\n\u003cp\u003e“You’ll bleed to death.” Stupid to protest, he’s dying anyway.\u003c/p\u003e\n\u003cp\u003e“Don’t make me hurt you.”\u003c/p\u003e\n\u003cp\u003eI choke out a laugh at that. He can’t even lift his head, and he’s threatening me? Trembling from head to toe, I do as he asks. Wrap my hands around the severed leg and tug hard. With some part of my mind, I register that it sounds a lot like the knife coming out of the Morgut’s skull. It takes all my willpower not to hurl.\u003c/p\u003e\n\u003cp\u003e“Seal the wound with your palm.” Even as he barks the order, Jael lifts weak hands, trying to do it himself.\u003c/p\u003e\n\u003cp\u003eI don’t know how the hell he thinks this will help, but I can’t refuse a dying man his last request. Even if it means feeling his guts beneath my hand—\u003c/p\u003e\n\u003cp\u003eExcept the wound isn’t as wide as it ought to be, and unless the gas has completely fried my brain, it’s getting smaller. I touch him gingerly, exploring his lower abdomen, and I find only wet skin. Bloody, but whole.\u003c/p\u003e\n\u003cp\u003e“Okay, what the hell—”\u003c/p\u003e\n\u003cp\u003e“Not now,” he says, lurching to his feet. “Your boy needs help over there.”\u003c/p\u003e\n\u003cp\u003eWith that, he dives into the fray, armed with the foreleg the Morgut stabbed him with. The fury from remembered agony must lend him strength because Jael shoves it straight through the creature’s neck. My first shocked thought—He wasn’t kidding on the ship when he said he’d kill us all.\u003c/p\u003e\n\u003cp\u003eI have to see, have to know. So I scramble to my feet and slip-slide over to March, who’s on his knees, sonicblade still in hand. Entrails spill along the floor, twisting bits of flesh that seem so inexpressibly alien that I shudder just looking at them. He’s bleeding from about a hundred cuts, but he seems to be in one piece.\u003c/p\u003e\n\u003cp\u003eA sob escapes me. I touch him briefly on the shoulder, a gesture that says everything as I pass by.\u003c/p\u003e\n\u003cp\u003eVel played bait for the rest of us, and I already owe him so much. I want to know him better, perhaps more than he’ll ever allow. And it might be too late.\u003c/p\u003e\n\u003cp\u003eI kneel in his blood, feeling it sizzle against the fabric of my jumpsuit. I can’t tell how wounded he is through the tattered human suit he’s wearing.\u003c/p\u003e\n\u003cp\u003e“How bad?” March asks, coming up behind me.\u003c/p\u003e\n\u003cp\u003e“Don’t know. I need the knife. Let’s cut him free.”\u003c/p\u003e\n\u003cp\u003eMarch hands me the sonicblade, and I go to work, feeling like a serial killer skinning her victim. Amid all the other smells I detect the faint scent of decomposition. He needed to slough this skin soon anyway.\u003c/p\u003e\n\u003cp\u003e“Shit, you’re butchering him!” Jael lunges like he’s going to steal the weapon, but March steps in between us.\u003c/p\u003e\n\u003cp\u003e“Easy, she knows what she’s doing.” Well, that may be an overstatement. I’ll do my best, though. I always do. “How’s your gut?” March adds.\u003c/p\u003e\n\u003cp\u003eSince I’m slicing off Vel’s faux skin as if peeling fruit, I don’t see his shrug, but I hear it in Jael’s voice. “I’m all right.”\u003c/p\u003e\n\u003cp\u003eI delve in my jumpsuit pocket and find a fresh torch-tube, crack it so I can better judge the damage. I count a dozen bites on his thorax alone, but they don’t look deep. I need to keep cutting in order to finish assessing his condition. Not that I know what to do about it.\u003c/p\u003e\n\u003cp\u003eWhy don’t we have Doc with us? Fuck him for being safe on Lachion, puttering around his lab when we need him so bad. I don’t know enough about medicine to save Vel if he’s in critical condition. And Mary curse it, we don’t have much more than a first-aid kit on the ship. There’s a basic med center here on station, though, if we can get to it. The medical AI may know what to do for him; it should possess exobiological treatments.\u003c/p\u003e\n\u003cp\u003eAs I shift Vel to pull the rapidly rotting flesh away, I count five more bites. His mandible works slowly, and it takes his vocalizer a few seconds to translate it to a pained sound within our hearing range. I could almost cry in relief. In fact, I feel tears stinging at my eyes, but I won’t let them fall.\u003c/p\u003e\n\u003cp\u003e“That would’ve killed most guys,” March observes.\u003c/p\u003e\n\u003cp\u003e“I’m not most guys.” Jael kneels beside me, watching the procedure with horrified fascination. Vel’s features flash into sight. “Right then, what the fuck—”\u003c/p\u003e\n\u003cp\u003e“If I don’t get to ask,” I cut in, “then you don’t either. This isn’t the time for talk anyway. You two should really figure out a way to get that door open, just in case there are more of them. We’re in no shape to fight.”\u003c/p\u003e\n\u003cp\u003eFor once, I get the last word, and they both snap to work.\u003c/p\u003e\n\u003cp\u003eCHAPTER 19\u003c/p\u003e\n\u003cp\u003eWhile l work on Vel, they jury-rig wires between the terminal and the door. His blood stings my skin, and I spare a moment to hope it won’t kill me, if slower than it does the Morgut. Even if it might, I wouldn’t stop.\u003c/p\u003e\n\u003cp\u003e“If this works,” March says, “it’s going to take out half this room.”\u003c/p\u003e\n\u003cp\u003eDoesn’t it figure? Our security guy is laid out while the two mercs, who tend to solve problems with a hammer, take charge of getting us out of here. Vel could probably hit two buttons and get the door to open.\u003c/p\u003e\n\u003cp\u003eI resist the urge to stare at Jael, knowing he probably expects it. Everything we know about the Bred comes from rumors from the gutter press, sensational gossip seasoned liberally with speculation. Like an Ithtorian bounty hunter, who ever expects to meet one?\u003c/p\u003e\n\u003cp\u003eHis wounds appear to be coagulating nicely, but then, I don’t know what to expect, given his physiology. I lack all but basic emergency training. Then again, I can’t blow a security door either.\u003c/p\u003e\n\u003cp\u003e“Keep your head down, Jax.” To my surprise, this terse order comes from Jael.\u003c/p\u003e\n\u003cp\u003e“March, line up some crates in front of Vel, if you can. Give us some cover.”\u003c/p\u003e\n\u003cp\u003eHe nods to indicate that’s a good idea. “Don’t set it off until we’re settled,” he tells Jael.\u003c/p\u003e\n\u003cp\u003eHow morbid—the slimy floor provides a ready lubricant, so our makeshift barricade slides easily into place. March crouches beside me.\u003c/p\u003e\n\u003cp\u003e“Ready,” he calls.\u003c/p\u003e\n\u003cp\u003eInstinctively, I bow my body over Vel. Any debris that rains down will catch me in the back. Jael hits the switch to short out the terminal, and the current crackles along the wires, shorting out the electrical lock that holds the door in place. It blows wide with a boom, slamming backward into the corridor. \u003c/p\u003e","sourceLink":"https://allnovel.net/wanderlust-sirantha-jax-2/page-15.html","bookId":1647,"creation":"Oct 5, 2019 6:40:53 PM","modification":"Oct 5, 2019 6:40:53 PM"}
