{"id":99256,"no":44,"title":"Page 44","content":"\u003cp\u003eA muffled explosion rocks the ship, and at first I think we’ve been hit, but instead of crashing into the roof, we just keep going up. The shock field doesn’t have full vertical coverage, so once we get some altitude we’re home free.\u003c/p\u003e\n\u003cp\u003eThere’s only the cockpit and a small hub on this boxy little skiff, so we don’t have far to go. I see Dina sitting beside Vel, so Constance must be up front with the pilot. Jael collapses, and I nearly go down with him before I get my balance.\u003c/p\u003e\n\u003cp\u003eI know firsthand just how excruciating burns can be. Even through layers of narcotics, I remember lying in medical, feeling each one of my nerve endings curl and char over and over again. There’s no pain like it.\u003c/p\u003e\n\u003cp\u003e“What can I do?”\u003c/p\u003e\n\u003cp\u003eEyes still closed, he takes my hand in his. Damn near pulverizes my knuckles. In fact, given my bone condition, fractures might result. Since he took the shots for me, I’ll take this. It’ll heal. Maybe slower than someone else, but I’m not weak.\u003c/p\u003e\n\u003cp\u003eI refuse to be.\u003c/p\u003e\n\u003cp\u003e“This . . . really fucking stings,” he gasps, after a moment. “No matter how many times I’m shot, I never get used to it. Just . . . glad they didn’t have disruptors. Talk about painful.”\u003c/p\u003e\n\u003cp\u003e“You can heal even that?” I ask without thinking.\u003c/p\u003e\n\u003cp\u003eJael raises haunted eyes to mine. “Yeah. Even that.”\u003c/p\u003e\n\u003cp\u003eHe’d only know that if he’d healed the damage from it. I want to ask when. Was it in a battle he chose, or part of inhuman lab testing? He doesn’t talk about his early life, before the government disbanded the program, and cut the survivors loose.\u003c/p\u003e\n\u003cp\u003eIn a way, I probably understand him better than anyone. I’m pretty damn close to Bred myself, though I’m not ready to talk about it. What kind of freak am I, conceived in grimspace? I wonder if that has anything to do with why technology breaks down around me. Doc would want to run tests, but he’s on Lachion, healing the wounded from a war he won’t fight.\u003c/p\u003e\n\u003cp\u003e“You’ll be all right.” I force a smile and brush back a burnished lock of sweat-damp hair, intending it as a casual, appreciative gesture.\u003c/p\u003e\n\u003cp\u003eBut Jael leans his forehead against my palm. His eyelids drift down as if my touch offers some unfamiliar benediction. Tremors course through him in waves, and I can almost sense the reparation of damaged cells, wracking him. He acts like he needs this small point of contact for reasons I can’t begin to delve.\u003c/p\u003e\n\u003cp\u003e“Looks like we’re clear,” Hit announces over the comm. “I got stars on the screen and no sign of pursuit.”\u003c/p\u003e\n\u003cp\u003e“Yet. They will find us if we are not collected by another vessel,” Vel says.\u003c/p\u003e\n\u003cp\u003eDrawing back before I yield to the urge to hug Jael, I tap the comm panel on the arm of my seat. “Turn on the distress signal, and let’s hope for the best.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 53\u003c/p\u003e\n\u003cp\u003elf you’ve never tried hauling straight space in a skiff, you don’t know what you’re missing.\u003c/p\u003e\n\u003cp\u003eI don’t mean that in a good way, of course. It feels like I’ve driven in mudside vehicles that go faster than this. I can still see the jewel-bright hues of Venice Minor behind us, and even though we’ve been flying for a while, it would only take a real cutter an hour to catch up with us.\u003c/p\u003e\n\u003cp\u003eDina sabotaged a couple of their ships, but she didn’t have time to be thoroughly destructive. Just cut a few wires, here and there, remove a few parts. They’ll get one up and running soon, and then—\u003c/p\u003e\n\u003cp\u003eThe comm crackles, and Hit’s voice fills the tiny hub. “Two ships incoming, different trajectories. Both on intercept course.”\u003c/p\u003e\n\u003cp\u003e“Good to know,” I mutter.\u003c/p\u003e\n\u003cp\u003eBut it’s not like we have weapons or shields or anything to ready us for an attack. A larger ship will just nail us with magnetic tow cables and haul us into its hold. That’s how tiny this box is.\u003c/p\u003e\n\u003cp\u003e“Hope for the best.” Dina shifts in her seat to glare over her shoulder at me. “Does that work for you a lot?”\u003c/p\u003e\n\u003cp\u003eI lift a shoulder. “Never tried it before. We usually have a half-assed plan.”\u003c/p\u003e\n\u003cp\u003e“Life in your vicinity seldom lacks excitement,” Vel observes.\u003c/p\u003e\n\u003cp\u003eWas that a compliment? Or more like the ancient curse: May you live in interesting times? Ignoring that, I call the cockpit to respond, “I’d say take evasive action until we find out who it is and what they want, but I don’t know how well this thing handles.”\u003c/p\u003e\n\u003cp\u003e“I’ll see what I can do,” Hit comes back.\u003c/p\u003e\n\u003cp\u003e“How long before intercept?” I ask.\u003c/p\u003e\n\u003cp\u003eThere’s a pause while she presumably checks the data. And then Constance replies, “Approximately twenty minutes.”\u003c/p\u003e\n\u003cp\u003e“Stay strapped in,” the pilot adds.\u003c/p\u003e\n\u003cp\u003eMy shoulders feel knotted, a thread of tension wrapping around my spine. I hate that I can’t just jump us away from here. We’re so close to grimspace—the place where I began—that I can almost sense the beacons, pulsing in echo to my heartbeat. What will my next jump be like? Returning to my place of origin.\u003c/p\u003e\n\u003cp\u003eNo wonder each jump always felt like coming home.\u003c/p\u003e\n\u003cp\u003eWhether those two ships intend to help or harm us, there’s nothing I can do about it. I hate feeling helpless, and I’ve had that sensation too much lately. Unless they intend to destroy us, they won’t waste power on weapons, though. This vessel is simply too small and fragile.\u003c/p\u003e\n\u003cp\u003eJael sits beside me, silent and distant. I think he regrets that moment where he showed a hint of vulnerability, where he leaned his head against my hand. He won’t look at me, but I have other things to worry about. Like those two ships.\u003c/p\u003e\n\u003cp\u003eWe sit in tense silence, wondering about the outcome. Wondering who else is hunting us. Let me just say, that gets old. I’m afraid to hope that Tarn’s come through, sent someone to the rescue, but I’ll guarantee one of those ships belongs to dear old Mum. She doesn’t strike me as a good loser.\u003c/p\u003e\n\u003cp\u003e“They have arrived,” Constance advises us over the comm.\u003c/p\u003e\n\u003cp\u003eThe tiny skiff shakes, and something clunks against the side. Tow cables? I wish I were in the nav chair where I could see what’s going on. But this thing doesn’t have a nav chair, and Constance is doubtless more help to Hit, analyzing numbers and probabilities with lightning speed.\u003c/p\u003e\n\u003cp\u003e“Warning shots over our bow,” Hit reports. “We’ve got one set of tow cables on us, but the smaller ship appears to be powering up weapons.” Another pause. “Shots fired. They’re engaging.”\u003c/p\u003e\n\u003cp\u003eI tap the comm. “Can you make out ship names or numbers?”\u003c/p\u003e\n\u003cp\u003eAfter a brief pause, Constance answers, “I recognize the larger vessel from the docking bay on Venice Minor. They are attempting to pull us in.”\u003c/p\u003e\n\u003cp\u003e“Oh no, we’re not going back there. Can we break those cables somehow?” I sit forward and look at Vel, my resident answer man.\u003c/p\u003e\n\u003cp\u003eHe replies by calling the cockpit. “A localized electrical surge might short out their magnet. But it might also damage our vessel and leave us dead in space.”\u003c/p\u003e\n\u003cp\u003eMy mother intends to kill everyone aboard, maybe even me at this point. “Better dead in space than dead on Venice Minor.”\u003c/p\u003e\n\u003cp\u003eHit evidently shares the sentiment because she says, “I’ll have Constance see what she can do. If anyone can manage the calculations without blowing us all to shit, it’s her. Now hang on, I’m going to spiral, see if I can tangle up those tow wires.”\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eEvery time the ship rolls, my stomach does a slow spin as well. I imagine us like fish on a line, struggling with all our strength to break free. I hope we don’t get blown up in some dispute we have nothing to do with. Since we’re attached to the Syndicate ship, if it goes up, we’re likely close enough to take damage as well. And with no shields, no armor plating, we just aren’t sturdy enough to soak it.\u003c/p\u003e\n\u003cp\u003eI say a prayer to the gods of luck.\u003c/p\u003e\n\u003cp\u003e“Report,” I demand, tapping the button again.\u003c/p\u003e\n\u003cp\u003eAt this rate, Hit will cut off communications from the cabin to the cockpit. But she doesn’t sound irked. Rather, excitement infuses her voice.\u003c/p\u003e\n\u003cp\u003e“I’ve never seen anybody fly like this,” she answers. “Whoever’s handling the small ship has magic in his hands. He fires, hits, slings sideways, dives underneath the bigger ship, just daring a collision . . . it’s beautiful to watch. So far they haven’t landed a single shot on him.”\u003c/p\u003e\n\u003cp\u003eMarch. Stupid, I know, but my heart leaps in purely emotional response. Intellectually, I know it can’t be him. He’s on Lachion, and at this point, I don’t know whether he’s alive or dead.\u003c/p\u003e\n\u003cp\u003e“Get that cable off us,” Dina barks into the comm. “Or they’ll take us with them when they blow.”\u003c/p\u003e\n\u003cp\u003e“Working,” Constance responds. “I must be sure of my calculations, or I will damage this vessel beyond repair.”\u003c/p\u003e\n\u003cp\u003eBad choice, no choice. Either way, we wind up dead. Someone’s got to make the call, and they seem to think I’m in charge, most days.\u003c/p\u003e\n\u003cp\u003e“Do it,” I tell her. “If the battle’s going south out there, we’ll wind up as collateral damage. Welcome to my world.”\u003c/p\u003e\n\u003cp\u003eA jolt rocks the skiff as she complies with my order. The lights flicker, giving the cabin a surreal air. Jael shifts and gazes at me in the weird, stuttering light. I glimpse his eyes in staccato flashes, see his lips moving, but I hear no sound.\u003c/p\u003e\n\u003cp\u003eRed lights come on along the ceiling, lending everything a bloody glow. Then the onboard computer chimes a warning. “Warning. Electrical fault. Please seek safe landing facilities immediately. Life-support failure imminent.”\u003c/p\u003e\n\u003cp\u003eAnd then we go careening through space. I can tell the difference between a guided roll and the way we’re spinning. Hit has limited control, if any, and I don’t think the comm’s working anymore.\u003c/p\u003e\n\u003cp\u003eI’ve always hated tiny vessels, for good reason as it turns out. There’s only a thin barrier between merciless vacuum and us. What the hell’s going on? I’m tempted to unstrap and fight my way up front to see, but maybe I’m better off not knowing. I’d probably get myself hurt, too, slamming into walls.\u003c/p\u003e\n\u003cp\u003eDina swears steadily in front of me, creative curses that I’d be memorizing with great interest at any other time. The bounty hunter remains silent, still, and I can’t tell if he’s injured or praying to some strange Ithtorian god. We haven’t had a chance to go over religion or mythology yet, dammit.\u003c/p\u003e\n\u003cp\u003eJael touches my arm. His fingers feel warm and strong, and I consciously check the urge to reach for him. I tell myself it’s not personal; at a time like this, it’s natural to want to hold on to someone. Nobody wants to die alone.\u003c/p\u003e\n\u003cp\u003eThis time I can make out the words beneath the strident alarm as the ship’s computer counts down. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eI lean over as best I can. “What for?”\u003c/p\u003e\n\u003cp\u003eHe can’t possibly blame himself. That’s ridiculous. Too many factors converged to land us in this mess, nothing he could’ve prevented. But his eyes beg for forgiveness just the same.\u003c/p\u003e\n\u003cp\u003e“Because—”\u003c/p\u003e\n\u003cp\u003eBefore he finishes the thought, I feel another thunk on our side. Tow cable? At this point I can only guess, and try not to toss up.\u003c/p\u003e\n\u003cp\u003eI hope that means the smaller ship has won and that it’s someone we want to see, once we get inside. More to the point, someone with a jumper, and a functional phase drive who will take us far away from here. \u003c/p\u003e","sourceLink":"https://allnovel.net/wanderlust-sirantha-jax-2/page-44.html","bookId":1647,"creation":"Oct 5, 2019 6:40:53 PM","modification":"Oct 5, 2019 6:40:53 PM"}
