{"id":99257,"no":45,"title":"Page 45","content":"\u003cp\u003eWe roll, end over end, until something snaps taut. The skiff shudders. My head flies back, my mouth fills with a coppery tang, and I see a red field full of stars that winks to black.\u003c/p\u003e\n\u003cp\u003eThen I know nothing at all.\u003c/p\u003e\n\u003cp\u003eCHAPTER 54\u003c/p\u003e\n\u003cp\u003el awake in the halls of the dead.\u003c/p\u003e\n\u003cp\u003eEverything is pale as a fading dream. Then I open my eyes a little wider, take a second look. This seems like any other med bay: white counters, various drawers and compartments. A slim redhead sits at a terminal nearby, examining data on the screen, and there’s a droid as well, probably her assistant. This doesn’t look like a drug-induced hallucination. I’ve seen the woman somewhere before.\u003c/p\u003e\n\u003cp\u003eShe murmurs, “Don’t worry, we’re taking care of everything. According to Chancellor Tarn, Ielos is the next stop on your goodwill tour. We’ve got guards on board to make sure nothing else goes wrong.”\u003c/p\u003e\n\u003cp\u003eBut my brain is too rattled to make necessary connections. A dull throb lives behind my eyes, pain made distant by the welcome advent of medication. I’m too tired to ask anything at the moment, so I just drift.\u003c/p\u003e\n\u003cp\u003eOn awakening for the second time, I think:\u003c/p\u003e\n\u003cp\u003eWell, holy shit.\u003c/p\u003e\n\u003cp\u003eIt worked. I can’t believe our plan actually worked. I feel more like an interstellar hitchhiker than a dignitary who commands respect, but what the hell. If this vessel, whomever it belongs to, gets me to Ielos, I’ll take it. Now I can start keeping my promises, make up for all the trouble.\u003c/p\u003e\n\u003cp\u003eI realize I’ve lost another bag full of new clothes. Mary curse it, I may as well take up nudism. I haven’t been able to keep up with my belongings since the Sargsasso crash. I sigh.\u003c/p\u003e\n\u003cp\u003eThe sound snags the woman’s attention, and when she turns, I place her immediately. Rose looks better than she did on Lachion, more rested, but there’s no mistaking her tousled curls, frosted with silver. My heart immediately spikes with excited anticipation.\u003c/p\u003e\n\u003cp\u003e“You’re awake,” she says unnecessarily. “Good thing, too. We’re nearly there now. How are you feeling?”\u003c/p\u003e\n\u003cp\u003eI shrug, struggling toward a sitting position. “Been better, been worse. Is Doc on board?” That’s not who I want to ask about first. Of course it’s not.\u003c/p\u003e\n\u003cp\u003eMaybe . . . just maybe . . .\u003c/p\u003e\n\u003cp\u003eI’m afraid to let myself hope.\u003c/p\u003e\n\u003cp\u003e“Yes, he’s asleep. It’s technically the middle of the night. But someone had to stay. You took quite a knock on the head.”\u003c/p\u003e\n\u003cp\u003e“Sorry for stealing your sleep. But thank you for watching over me.” I can’t fight a sinking sensation. If March were here, surely he wouldn’t have left my side, not until I woke up.\u003c/p\u003e\n\u003cp\u003eThe fact that Rose has carefully avoided mentioning his name says it all. If I were stronger, I’d demand to know what happened, but at the moment, I just can’t. I have to pick my battles, and I don’t have the fortitude for this one. I refuse to hear it.\u003c/p\u003e\n\u003cp\u003eI’m not hanging around Med Bay for another second. With unsteady hands I push to my feet and wobble, watching the room swim. After a moment, I manage to let go of the cot and stand, swaying, under my own power. Given another minute or two, I’ll be able to walk. Shit. I need my bag. I’m sure it’s past time for an injection. I’m getting stronger, so I don’t want to retard my progress.\u003c/p\u003e\n\u003cp\u003e“Where’s my pack?”\u003c/p\u003e\n\u003cp\u003eThe redhead glances up from the screen at last. “Constance said to tell you she has all of your belongings, including the clothes you left on Venice Minor.”\u003c/p\u003e\n\u003cp\u003e“Thanks.” What a PA . . . helpful administrator doesn’t begin to cover it. That’s the best news I’ve had in quite a while.\u003c/p\u003e\n\u003cp\u003e“She’s odd,” Rose observes. “Very formal.”\u003c/p\u003e\n\u003cp\u003eSo they have no idea she’s a droid. I guess they’ve never run across the Lila model. No shock since she was retired in favor of the ones with giant breasts and shiny silver hair.\u003c/p\u003e\n\u003cp\u003e“Things are better on Lachion?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head as if in disbelief. “Much. The other clans swore fealty to Gunnar-Dahlgren after seeing how it went for Clan McCullough. In fifty turns, that’s never happened.”\u003c/p\u003e\n\u003cp\u003eMarch always said he knew killing. That seems like a sad epitaph.\u003c/p\u003e\n\u003cp\u003eI ache. “Where did you find a jumper?”\u003c/p\u003e\n\u003cp\u003e“There were a number of jumpers stranded on Lachion,” she tells me. “They had the bad timing to be delivering supplies when you showed up.”\u003c/p\u003e\n\u003cp\u003eFantastic. I wonder where all the Farwan jumpers wound up.\u003c/p\u003e\n\u003cp\u003e“Am I cleared to leave?”\u003c/p\u003e\n\u003cp\u003e“Absolutely,” she answers.\u003c/p\u003e\n\u003cp\u003eAfter a few steps, I regain my balance, and by the time I reach the door, I’ve stopped feeling like I might tip over. I need to check on everyone.\u003c/p\u003e\n\u003cp\u003eOut in the corridor, which is tinted a particularly bilious yellow, I stop the first person I see. “Excuse me, where are we bound?”\u003c/p\u003e\n\u003cp\u003eThe kid looks like he’s barely eighteen, running errands for somebody. “We’re taking the ambassador to Ielos.”\u003c/p\u003e\n\u003cp\u003eSo it’s true. Tension I didn’t even register flows out of me, making me aware of various aches and pains. Not debilitating, however—considering what we’ve been through, I feel strong, stronger than I have in months.\u003c/p\u003e\n\u003cp\u003eMy stride gains speed as I explore the ship. Various crewmen nod at me in passing, like they recognize me as a person in authority. That’s a new sensation.\u003c/p\u003e\n\u003cp\u003eI could go looking for Doc, but as Rose said, it’s the middle of the night. I don’t want to wake him. I’m also not sure I’m fit company right now.\u003c/p\u003e\n\u003cp\u003eMarch must be dead. If the war on Lachion let up sufficiently for Gunnar-Dahlgren to equip a ship in answer to Tarn’s plea, enough for Rose and Doc to take off from treating the wounded, then the outcome must be decided, one way or another. I guess they won, but . . . the price was too high.\u003c/p\u003e\n\u003cp\u003eThere’s no other reason he wouldn’t have come. Unlike most, his promises mean something. No words are sufficient to describe this loss. I thought I knew pain when Kai died, but this—\u003c/p\u003e\n\u003cp\u003eA hole has opened up inside me.\u003c/p\u003e\n\u003cp\u003eHe won the war for them, and it destroyed him. Though I’d known it would happen when I left him on Lachion, the incontrovertible evidence wrecks me.\u003c/p\u003e\n\u003cp\u003eMary, I can’t live without him. I don’t even want to try.\u003c/p\u003e\n\u003cp\u003eSome mechanistic part of me keeps me walking loops around the ship’s deck. It’s like I expect to come out somewhere else, but each time it carries me back where I began. The clansmen who make up the crew begin giving me odd looks.\u003c/p\u003e\n\u003cp\u003eI can’t resist the urge to find somewhere quiet to grieve. A primal scream is building inside me, so I duck into the first cabin that isn’t keyed to someone else. Must be vacant, or maybe it’s mine. I didn’t ask Rose about accommodations.\u003c/p\u003e\n\u003cp\u003eThe dark doesn’t surprise me, but the weirdly flickering vid screens all over the room certainly give me pause. And then I spy what’s on them. Sirantha Jax, asleep in Med Bay, pacing the corridors, and older clips still. Me, as I step off a vessel with Kai. Me, holding both fists in the air as I stagger out of a barroom brawl.\u003c/p\u003e\n\u003cp\u003eThis isn’t entertainment so much as a shrine. Someone is mourning me as if I were dead. There’s only one person who would surround himself with me like this. But it doesn’t make sense. I’m here. Why isn’t he with me?\u003c/p\u003e\n\u003cp\u003eAs my eyes adjust, I see a dark figure sprawled in a chair. I can’t make out his features, but all my senses insist it’s March. The door whooshes shut behind me.\u003c/p\u003e\n\u003cp\u003e“I wondered how soon you’d find me,” he says quietly.\u003c/p\u003e\n\u003cp\u003eI mumble something about it being a fair-sized ship. I want to be glad because, whatever else is wrong, at least he’s not dead. But what sits in this small, dark room might be worse, if anything could be.\u003c/p\u003e\n\u003cp\u003eI take a step toward him, but his stillness alarms me. Something prevents me from running to him. He feels . . . wrong somehow.\u003c/p\u003e\n\u003cp\u003eIf only I could see his eyes . . .\u003c/p\u003e\n\u003cp\u003eMy voice comes out raw. “Rose was careful not to mention you. I thought—”\u003c/p\u003e\n\u003cp\u003e“I know. I asked her not to. I’m sorry.” He doesn’t look at me. I can’t make out his features, but I can tell he’s still staring at his Jax collection on the screens.\u003c/p\u003e\n\u003cp\u003eThis isn’t how I envisioned our reunion, when I dared think about it at all. The silence wears on me, but I don’t know what to say to him. Words pile up in my throat, leaving me mute.\u003c/p\u003e\n\u003cp\u003eMarch became part of me as nobody else ever had, but this isn’t the man who pined for me, who would’ve killed the world if anything happened to me. Oddly enough, I feel as though I’m standing before a stranger.\u003c/p\u003e\n\u003cp\u003e“How did it go on Lachion?” I manage to ask.\u003c/p\u003e\n\u003cp\u003ePointless small talk. I already got the gist from Rose.\u003c/p\u003e\n\u003cp\u003e“Slaughtered the McCulloughs to a man,” he answers, low. “The tunnels ran with blood, and then the Teras turned on them. After that, we hunted them through all their holdings. I haven’t seen killing like that since I left Nicu Tertius.”\u003c/p\u003e\n\u003cp\u003eWhere, he told me, he slew thousands.\u003c/p\u003e\n\u003cp\u003e“I’m glad you made it.” That’s not what I want to say. It’s banal, but the unearthly chill streaming off of him makes me want to turn tail and run.\u003c/p\u003e\n\u003cp\u003eIntellectually, I understand the need for him to disconnect from his emotions. How could he annihilate his fellow man if he felt anything for them? This, then, is what Mair saved him from before. But the price for such detachment comes steep.\u003c/p\u003e\n\u003cp\u003eBecause I stand on the other side of the wall and I don’t know how to reach him. I don’t know what Mair did or how to bring him back. He promised I’d see him again, and he’s kept that vow. I touch the ring he gave me, hoping for inspiration. Where do we go from here?\u003c/p\u003e\n\u003cp\u003eWell, for me, there’s no direction except toward him. I ignore his body language; his muscles seem coiled and ready to fight. I don’t want to believe he’ll hurt me, but Mary, I’m afraid. He’s like a wounded beast that doesn’t recognize a friendly hand.\u003c/p\u003e\n\u003cp\u003eI reach toward his face with trembling fingertips. He lashes out, a move that would’ve broken my forearm if he’d connected. I leap back, shaken.\u003c/p\u003e\n\u003cp\u003eBut I don’t quit. Maybe I’m not Mair, but I’ll figure this out. I won’t lose him.\u003c/p\u003e\n\u003cp\u003e“You know what? I don’t care. I should, but I don’t. You could’ve put a million McCulloughs in the ground, and I wouldn’t care as long as it means you’re here with me.”\u003c/p\u003e\n\u003cp\u003eHe shudders. “I shouldn’t be. I should’ve cut and run once I saw you were all right. I could hurt you, Jax. Kill you in my sleep. Even though I remember how I used to feel about you, I can’t—” March makes a slashing gesture with one hand.\u003c/p\u003e\n\u003cp\u003eI catch on. He can’t access it, as if some necessary neurological pathway has been severed. Afraid to touch him, I seal a kiss into my palm and then blow it into the air. It’s a romantic gesture, not like me at all, but I intend it to be symbolic of how far I’m willing to go for him.\u003c/p\u003e\n\u003cp\u003e“I need you, March. I was scared as hell to admit it, but I can’t do without you, and if that makes me broken . . .” I shrug. “I’ll take you any way I can get you. And I don’t give a damn what you’ve done. You will never be rid of me.”\u003c/p\u003e\n\u003cp\u003e“You have no idea how much I don’t deserve you.” He pitches the comment low, almost dispassionate. \u003c/p\u003e","sourceLink":"https://allnovel.net/wanderlust-sirantha-jax-2/page-45.html","bookId":1647,"creation":"Oct 5, 2019 6:40:53 PM","modification":"Oct 5, 2019 6:40:53 PM"}
