{"id":83600,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Who’s Mrs. Porcelli?”\u003c/p\u003e\n\u003cp\u003e“She does my cooking and housekeeping.”\u003c/p\u003e\n\u003cp\u003eHow odd. His employer pays him enough to employ someone to do his cooking and cleaning. “Will I meet her or does she fall into the friend/family/identifying information category?”\u003c/p\u003e\n\u003cp\u003e“I haven’t decided, but it won’t be today because she’s already gone.”\u003c/p\u003e\n\u003cp\u003e“Because of me?”\u003c/p\u003e\n\u003cp\u003e“No. She’s gone home for the holidays.”\u003c/p\u003e\n\u003cp\u003eThat’s right. Christmas is only a few days away. “So she doesn’t live in Wagga Wagga, either?”\u003c/p\u003e\n\u003cp\u003e“No. I employ her the same way I do Daniel. They go where I go.”\u003c/p\u003e\n\u003cp\u003eThey go everywhere with him. How much does it cost to have employees like that? I can’t imagine it being cheap. “Daniel is on holiday as well?”\u003c/p\u003e\n\u003cp\u003e“Yes. All the vineyard employees are gone until Monday, so it’s just the two of us. Alone.”\u003c/p\u003e\n\u003cp\u003eWas that supposed to scare me? “So, no one’s around to hear my screams?”\u003c/p\u003e\n\u003cp\u003e“Now you’re catching on. Come with me and I’ll show you the rest of the house.”\u003c/p\u003e\n\u003cp\u003eWe enter the living room and there is a beautiful black baby grand in the corner. I’m in love. “You play?”\u003c/p\u003e\n\u003cp\u003eHe laughs at my assumption. “Not a note.”\u003c/p\u003e\n\u003cp\u003eI walk over and stroke the ivory keys. “It’s beautiful.”\u003c/p\u003e\n\u003cp\u003e“The interior designer thought it would be a pretty piece to take up some of the void since the room is so big.”\u003c/p\u003e\n\u003cp\u003eI toy with the keys, playing the chorus of a song I’d been working on before I left home. Its tune is perfect.\u003c/p\u003e\n\u003cp\u003e“It’s a shame it never gets played. I’m hoping it will get some use over the next few months.” The piano isn’t the only thing he hopes will get some action. “I’d love to hear you play.”\u003c/p\u003e\n\u003cp\u003e“We’ll see,” I say as I run my hand down the keys and walk away, even though I’m dying to sit down and put it to use. There’ll be plenty of time for that later. Three months to be exact.\u003c/p\u003e\n\u003cp\u003e“The bedrooms are this way.” I follow him down the hall and he uses the tour to inform me that the previous owner, who died in a freak accident, now haunts the room I will be sleeping in.\u003c/p\u003e\n\u003cp\u003eNice one. He wishes he could pull one over on me like that.\u003c/p\u003e\n\u003cp\u003e“I usually get along with ghosts and poltergeists pretty well, so I should be fine.”\u003c/p\u003e\n\u003cp\u003eHe takes me across the hall. “If you decide to stay in the guest room and get scared in that big lonely bed all by yourself, this is where you’ll find me.”\u003c/p\u003e\n\u003cp\u003eHis bedroom is gender neutral and contemporary. The bedding is a modern geometric pattern of mostly gray and white with yellow and black accents. Everything from the flooring to the ceiling coordinates. The bedroom is aesthetically appealing, but there’s nothing romantic about it, so it matches our relationship perfectly.\u003c/p\u003e\n\u003cp\u003eEvery room in the house is spotless, and I wonder if it is Mrs. Porcelli’s doing or if he likes things orderly because he is some kind of neat freak.\u003c/p\u003e\n\u003cp\u003eI think we are finished with the tour of the house, but he takes me to one more room we haven’t visited. “Last stop.”\u003c/p\u003e\n\u003cp\u003eHe opens the door to a room with wall-to-wall mirrors. The floor is covered with different kinds of exercise equipment, some I’ve never seen before. “Gee, someone likes to see himself while he works out.”\u003c/p\u003e\n\u003cp\u003e“The previous owner had a ballerina in the family and this was her studio.”\u003c/p\u003e\n\u003cp\u003e“Okay. That’s a little more acceptable.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome to use this gym any time you want. It has surround sound for music or you can watch the idiot box.” He points to a cabinet against the wall. “The flat screen and receiver are in there. It has Bluetooth so you can play your own music or you can stream anything you like.”\u003c/p\u003e\n\u003cp\u003eThere he goes assuming again. “You think I’m going to stay long enough to need a workout?”\u003c/p\u003e\n\u003cp\u003e“Since you’ve not given me an answer, that still remains to be seen.”\u003c/p\u003e\n\u003cp\u003eI walk over to an elliptical and step up. I make a few strides. “I exercise at home, but this isn’t what I do. Exercise equipment bores me.”\u003c/p\u003e\n\u003cp\u003eHe wiggles his eyebrows. “So what is your kind of workout?”\u003c/p\u003e\n\u003cp\u003eI slow the speed of my stride on the machine. “If you’re going to be like that, I don’t think I’m gonna tell you.”\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003eI think for a minute, trying to decide if I want to tell him. “I dance.”\u003c/p\u003e\n\u003cp\u003e“Dancing is great exercise.”\u003c/p\u003e\n\u003cp\u003eI pick up speed again and stare straight ahead. I don’t want to see his face when I tell him. “I pole dance.”\u003c/p\u003e\n\u003cp\u003eYep. That got his attention. “Pole dance? You mean, like a stripper?”\u003c/p\u003e\n\u003cp\u003e“Yes, but I don’t do it the way you’re imagining. It’s a beautiful art form when it’s done tastefully. I do it because I like it, and it’s a hell of a workout. Very strenuous. You use muscles you didn’t know you had. You’d be surprised what’s sore the next day.” I didn’t look at him, but I knew he was smirking.\u003c/p\u003e\n\u003cp\u003eHe walks around to stand in front of me and I look down at him from the elliptical. “You only do it for exercise?”\u003c/p\u003e\n\u003cp\u003eI nod. “Yeah. No one knows I take lessons except my instructor and classmates. And now you.”\u003c/p\u003e\n\u003cp\u003eHe licks his lips and rubs them together. “Just when I thought you couldn’t get any hotter, you go and tell me something like this and prove me wrong.”\u003c/p\u003e\n\u003cp\u003eI lift a brow at him. “There’s a lot you don’t know about me.”\u003c/p\u003e\n\u003cp\u003e“How long have you done it?”\u003c/p\u003e\n\u003cp\u003eHmm, I started my first year of college. “I guess it’s been about … four years.”\u003c/p\u003e\n\u003cp\u003e“You must be pretty good if you’ve done it for that long.”\u003c/p\u003e\n\u003cp\u003eI shrug because I’ve never been one to brag, but I’m damn good at it. “I guess. My background in gymnastics doesn’t hurt, either.”\u003c/p\u003e\n\u003cp\u003e“Gymnastics too,” he laughs. “So you’ve never danced on a stage in fuck-me pumps for a bunch of horny bastards?”\u003c/p\u003e\n\u003cp\u003eI think I just threw up in my mouth a little. “You say that like you’re pretty familiar with the scene.”\u003c/p\u003e\n\u003cp\u003eHe holds up his hand. “I’m pleading the Fifth.”\u003c/p\u003e\n\u003cp\u003e“That’s an American amendment. It doesn’t work for Australians.”\u003c/p\u003e\n\u003cp\u003e“You didn’t answer my question.”\u003c/p\u003e\n\u003cp\u003e“Neither did you.”\u003c/p\u003e\n\u003cp\u003eHe has a huge grin. “I may have seen a stripper on a pole once. Maybe twice.”\u003c/p\u003e\n\u003cp\u003eDamn liar.\u003c/p\u003e\n\u003cp\u003eI stop the elliptical and sigh loudly, as though he is wearing me down. “Yes and no.”\u003c/p\u003e\n\u003cp\u003e“Yes to what and no to what?”\u003c/p\u003e\n\u003cp\u003e“No, I’ve never danced on stage for horny bastards. But yes, I wear fuck-me pumps when I dance on the pole.”\u003c/p\u003e\n\u003cp\u003e“Now, you’re bloody hot in my book. What am I going to do with you?”\u003c/p\u003e\n\u003cp\u003e“I believe the answer to that question still remains to be seen, now doesn’t it?”\u003c/p\u003e\n\u003cp\u003e12\u003c/p\u003e\n\u003cp\u003eJack McLachlan\u003c/p\u003e\n\u003cp\u003eI’m installing a pole in this gym. ASAP.\u003c/p\u003e\n\u003cp\u003eWe have to stop talking about pole dancing and anything containing the term fuck me in it before I bend her over my weight bench. I put my hands in my pockets to disguise the hard-on our conversation has triggered. “Are you hungry? Good. Me too. Let’s go.”\u003c/p\u003e\n\u003cp\u003eShe laughs as she steps down from the elliptical. I suspect she knows what she’s done to me. “Is something wrong, Lachlan?”\u003c/p\u003e\n\u003cp\u003e“Nothing’s wrong. I’m a bit peckish and ready for a bite of lunch.”\u003c/p\u003e\n\u003cp\u003eMy hands are still in my pockets when we start to walk out of the gym. She loops her arm through mine as we walk toward the door. “Me, too. Where are we going for our picnic?”\u003c/p\u003e\n\u003cp\u003eHer touch only adds fuel to the flame in my jeans. “I haven’t decided. I thought we’d ride out on the ATV and pick a spot together.”\u003c/p\u003e\n\u003cp\u003e“That sounds like fun.”\u003c/p\u003e\n\u003cp\u003eWe swing back through the kitchen to pick up the basket of food and wine before we head out across the vineyard. I drive out to the middle of the property and stop when I find a somewhat flat grassy area about a mile from the house. “What do you think of this spot?”\u003c/p\u003e\n\u003cp\u003e“The view is gorgeous.”\u003c/p\u003e\n\u003cp\u003eWe get off the ATV and spread a blanket across the ground. We sit next to each other with the basket between us and she helps me spread the food. “Tell me how you got into the wine business.”\u003c/p\u003e\n\u003cp\u003eA little truth with a splash of lies on the side. “I guess you could say I was born into it. This is what my dad did for a living before he retired, so it’s what I do.”\u003c/p\u003e\n\u003cp\u003e“And it makes you happy? I mean, the traveling and being away from your family?”\u003c/p\u003e\n\u003cp\u003eThe cork pops loudly from the bottle of Shiraz. I take a glass from the basket and fill it with wine. “I’m paid quite well to like it. Besides, I get to meet interesting people such as yourself during my travels, so what’s not to like?”\u003c/p\u003e\n\u003cp\u003ePaige takes the offered glass. “But what about having a family? Don’t you want a wife and children?”\u003c/p\u003e\n\u003cp\u003eI stifle my laugh. “I decided a long time ago I would never marry.”\u003c/p\u003e\n\u003cp\u003eI watch her as she holds the glass up to inspect the color of the vino before she smells it. She’s a fast learner. “Maybe the right woman hasn’t come along and stolen your heart.”\u003c/p\u003e\n\u003cp\u003eI hope she isn’t suggesting she is the right woman because she’d be wrong. There is no right woman for this kind of life. “No wife wants to be the center of her husband’s world on a part-time basis, and that’s what a marriage with me would be like.”\u003c/p\u003e\n\u003cp\u003eShe takes a small drink, waits for the aftertaste, and then smiles. “It’s good. At least I think it is.”\u003c/p\u003e\n\u003cp\u003eI take a small drink. “I’ve had better and that’s why I’m here—to make this vineyard one of the best.”\u003c/p\u003e\n\u003cp\u003eShe reaches for a cheese cube and cracker. “You shouldn’t let your job keep you from having a family if it’s what you want.”\u003c/p\u003e\n\u003cp\u003eSo we are back to that again. “I watched my mom raise three kids in my dad’s absence. Don’t get me wrong. My dad is great, but he was never home. I’m not doing that to a wife and kids. It’s not fair.” Wow, where did that come from? \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-from-pain-beauty-1/page-12.html","bookId":1879,"creation":"Oct 5, 2019 4:53:18 PM","modification":"Oct 5, 2019 4:53:18 PM"}
