{"id":83619,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWe go back into the pool after we finish eating and I can tell that Lachlan is nervous. I assure him I’m fine, but he won’t venture past the steps, and we sit staggered in the water with me between his legs. The dam holding all my secrets is breached and I tell him things I thought I would take to my grave.\u003c/p\u003e\n\u003cp\u003eLachlan listens and says little. I’m not sure if it’s because he doesn’t know how to respond or if he’s too disturbed by what he’s hearing. It doesn’t matter because reaction isn’t what I need. Listening is, and it’s one of the things he does very well.\u003c/p\u003e\n\u003cp\u003eBy the time I finish telling Lachlan my childhood tales, the water has shriveled us like little old people. I hold my hand up to examine it. “I think this is a sign that it’s past time to get out.”\u003c/p\u003e\n\u003cp\u003e“I think you’re right.”\u003c/p\u003e\n\u003cp\u003eOnce we’re dried off, I wrap my towel around my waist. As I’m tucking it, I see Lachlan studying me. “What?”\u003c/p\u003e\n\u003cp\u003eHe drops his head to peer over his sunglasses at me. “I hope you haven’t caught too much sun today. You’re a wee bit red.”\u003c/p\u003e\n\u003cp\u003eI look at my shoulder and pull the strap of my bikini to the side. I hear Lachlan suck air through his teeth. “Damn, Laurelyn. I’m afraid that’s going to sting tonight.”\u003c/p\u003e\n\u003cp\u003eLachlan is not the least bit pink, so I move the top of my bikini down for an inspection. It doesn’t hurt or appear burned to me, but I won’t be able to tell anything until we’re out of the sun.\u003c/p\u003e\n\u003cp\u003eWe stop in the kitchen to drop off our lunch plates and Mrs. Porcelli’s eyes grow large when she sees me. “Oh, Laurelyn dear. There’s an aloe vera aftersun lotion in the medicine cabinet when you’re ready for it. There’s lidocaine in it and it should help with the pain.”\u003c/p\u003e\n\u003cp\u003eOh, shit. What have I done?\u003c/p\u003e\n\u003cp\u003eWe go into the bathroom together and I slip off my towel. Things aren’t so bad when I remove my bikini top. Sure, there’s a distinct contrast between my freshly sun-kissed skin and the white lines of my swimsuit, but it’s not terrible.\u003c/p\u003e\n\u003cp\u003eHe’s standing behind me surveying the damage. “I’m so sorry. I should’ve noticed when you started burning.”\u003c/p\u003e\n\u003cp\u003e“Don’t worry. I don’t stay pink for long.” He looks doubtful as he assesses my shoulders. “Really, Lachlan. You’ll see. This will be on its way to turning brown by morning.”\u003c/p\u003e\n\u003cp\u003e“In the meantime, why don’t you take a cool shower? That should help, and I’ll rub you down with lotion when you’re out.”\u003c/p\u003e\n\u003cp\u003eA rubdown by Lachlan? Being sunburned is sounding better and better. “That sounds perfect.”\u003c/p\u003e\n\u003cp\u003eHe’s right. The cool shower feels really nice. I notice my shoulders are a little tender to the water pelting down on them, but it’s nothing too uncomfortable.\u003c/p\u003e\n\u003cp\u003eWhen I’m finished showering, I pat my skin dry and step out to find Lachlan waiting for me with a bottle of aloe vera lotion. He holds it up and gives it a shake as he grins. “Do you want me to do it in here with you standing, or would you rather I do it with you lying on the bed?”\u003c/p\u003e\n\u003cp\u003eHmm, that sounds dirty. “I don’t know. Both options sound appealing.”\u003c/p\u003e\n\u003cp\u003e“I vote for the bed.”\u003c/p\u003e\n\u003cp\u003e“Then, the bed it is.”\u003c/p\u003e\n\u003cp\u003e“Here. Mrs. Porcelli sent these for you.” He holds out two pills in the palm of his hand. “It’s only ibuprofen to help with the discomfort.”\u003c/p\u003e\n\u003cp\u003e“But it doesn’t hurt.”\u003c/p\u003e\n\u003cp\u003e“It will, so please take the medicine. I don’t want you to be in pain.”\u003c/p\u003e\n\u003cp\u003eI take the pills and the glass of water he offers. I’m terrible at swallowing pills since I’ve made a habit of avoiding them. These aren’t big, so I manage to get them down, but not without some unattractive sputtering. When I’m done, I pass the glass back to him. “Happy now, Dr. Henry?”\u003c/p\u003e\n\u003cp\u003e“Very.”\u003c/p\u003e\n\u003cp\u003eI twist my towel around my hair before I crawl up onto the bed to lie on my stomach for my post-sun care. I rest my arms over my head and I feel the bed dip when Lachlan crawls up. “This may be a little cool, but it’ll feel good.”\u003c/p\u003e\n\u003cp\u003eHe squirts it directly on my back and I arch. “Shit, that’s cold!” I squeal.\u003c/p\u003e\n\u003cp\u003e“It’s not really. It just feels that way because your skin is feverish.”\u003c/p\u003e\n\u003cp\u003eHe rubs the cool lotion into my skin and it’s very soothing. My entire body goes lax as I enjoy what feels more like a massage than a post-sunburn lotion application.\u003c/p\u003e\n\u003cp\u003eI’m so relaxed, I’m almost asleep when I hear “Jolene” playing on my phone. My eyes pop open and I feel Lachlan leave my back. “I’ll get it for you.”\u003c/p\u003e\n\u003cp\u003eHe passes my phone to me. “Hey, Mom.”\u003c/p\u003e\n\u003cp\u003e“Laurie, I’ve been calling you for hours. Have you not checked your phone?”\u003c/p\u003e\n\u003cp\u003eShe sounds panicked, which panics me, and my first thought is that something has happened to Nanna or Pops. I sit up in the middle of the bed, preparing myself to hear the worst. “What’s happened, Mom?”\u003c/p\u003e\n\u003cp\u003e“I can’t believe you haven’t heard. It’s been all over the news.”\u003c/p\u003e\n\u003cp\u003eOkay, nothing has happened to my grandparents so I shift to my aggravation mode. “Mom, what’s going on?”\u003c/p\u003e\n\u003cp\u003e“Jared Beckett was killed in a skiing accident today.”\u003c/p\u003e\n\u003cp\u003eI should’ve known this would somehow involve the sperm donor. “And this is emergency news for me because?”\u003c/p\u003e\n\u003cp\u003e“Because he’s your brother, Laurie.”\u003c/p\u003e\n\u003cp\u003e“Whom I’ve never met.”\u003c/p\u003e\n\u003cp\u003e“He’s your father’s son.”\u003c/p\u003e\n\u003cp\u003e“Again, whom I’ve never met.” Am I the only one hearing the common denominator here?\u003c/p\u003e\n\u003cp\u003e“You need to come home.”\u003c/p\u003e\n\u003cp\u003eGood grief. “This isn’t a reason for me to come home.”\u003c/p\u003e\n\u003cp\u003e“You need to pay your condolences, Laurie.” Oh, hell. This is about getting me in with the sperm donor. What does she think is going to happen? He’s going to suddenly want me in his life now that he’s lost his only child?\u003c/p\u003e\n\u003cp\u003eI realize I’m stark naked and talking to my mom about the death of my sperm donor’s son when Lachlan holds out one of his T-shirts for me. I mouth thank you to him and slip the shirt over my head while my mom chatters nonsense about the need of being with family in times like this.\u003c/p\u003e\n\u003cp\u003e“We share DNA, but I’m no part of their family. They wouldn’t know me if we passed on the street.”\u003c/p\u003e\n\u003cp\u003e“Your father is going to want to know you.”\u003c/p\u003e\n\u003cp\u003eI stopped fantasizing about him wanting to know me a long time ago, but she never has. I’m almost twenty-three years old and she’s still holding out for something—I don’t know what. Maybe she thinks he’ll want to meet his daughter and it’ll lead him back to her.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Mom. I’m not coming home for this.”\u003c/p\u003e\n\u003cp\u003e“I think you’re making a mistake.”\u003c/p\u003e\n\u003cp\u003e“If I am, then I’ll be the one who has to live with it.” I’d always been the one to live with both of our mistakes anyway, so I was used to it.\u003c/p\u003e\n\u003cp\u003eShe isn’t happy with me when I end our call and it leaves me feeling unsettled, although I know I’m making a logical decision. Between the two of us, someone has to be rational and I can’t depend on it to be her. She isn’t well known for making the best choices when it comes to my father.\u003c/p\u003e\n\u003cp\u003e“I assume there’s trouble at home.”\u003c/p\u003e\n\u003cp\u003eYes, but only what my mom is making for me. “My father’s son was killed in a snow-skiing accident.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“He’s a half-brother I’ve never met and my mom is acting like I should be in mourning. Hell, when she said his name, it took a minute for me to realize whom she was talking about. He’s a stranger to me. I’m sorry for his family’s loss, but I don’t feel anything more. Is that wrong?”\u003c/p\u003e\n\u003cp\u003e“No, Laurelyn. You’re not wrong for the way you feel. Please, don’t let your mum make you feel guilty.”\u003c/p\u003e\n\u003cp\u003eI’m certain he thinks she is a terrible mother after everything he’s learned about her today. “You must think even worse of my mom now.”\u003c/p\u003e\n\u003cp\u003e“She doesn’t make the top-ten list of my favorites today. You, however, make the number-one position.” He pulls me close to kiss the top of my head. I love the way he makes my worries disappear.\u003c/p\u003e\n\u003cp\u003eHow can this be? This man, almost a stranger, brings me comfort and makes it easy for me to bare my soul to him. As I ask myself how it’s possible, I know the answer. I don’t have to guard my heart with Lachlan. I’m safe with him. And it’s nice.\u003c/p\u003e\n\u003cp\u003e30\u003c/p\u003e\n\u003cp\u003eJack McLachlan\u003c/p\u003e\n\u003cp\u003eLaurelyn doesn’t know it’s my birthday or that the only wish I have is to stay home with her. But I can’t. I have to go to my parents’ house for my annual birthday dinner with the whole family. What a ripper day this will be.\u003c/p\u003e\n\u003cp\u003eShe’s been living with me for two weeks and I’m surprised by the way I feel as I drive away, leaving her at the house. I want to go back for her. I consider whipping the Sunset around, but I remind myself of the rules I have in place and why meeting my family is one that can’t be broken.\u003c/p\u003e\n\u003cp\u003eI haven’t seen my family in almost three weeks, not since my mother sent me back to Avalon to be with Laurelyn on Christmas Day. Thank you, Mum. It was the best gift you could have given me.\u003c/p\u003e\n\u003cp\u003eMy mum has made a point to speak to me weekly about my relationship with my “girlfriend” and I’m not looking forward to showing up without her again. Margaret McLachlan is going to be very put out with me over Laurelyn’s absence. I shouldn’t have told her I’d bring her to my birthday dinner, but I didn’t have a reasonable excuse to give her when we discussed it.\u003c/p\u003e\n\u003cp\u003eI walk through the door and Mum flies into the foyer. She’s smiling and her eyes are wide with anticipation, but then I see them fill with disappointment when she notes the emptiness beside me. I feel like a shitty son. “Where is she?”\u003c/p\u003e\n\u003cp\u003e“I’m sorry, Mum. Laurelyn wasn’t feeling well. We think she has the stomach flu. She told me to tell you how sorry she is that she couldn’t make it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-from-pain-beauty-1/page-32.html","bookId":1879,"creation":"Oct 5, 2019 4:53:18 PM","modification":"Oct 5, 2019 4:53:18 PM"}
