{"id":83623,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI’m calmed, or at least appear to be, by the time she reaches me. I hold my arms out for her to come sit across my lap. I pull her close and bury my face in her hair.\u003c/p\u003e\n\u003cp\u003e“Wow, someone really missed me while he was gone. Is everything okay?”\u003c/p\u003e\n\u003cp\u003e“It is now.” I forgo telling her about my near breakdown when I couldn’t find her.\u003c/p\u003e\n\u003cp\u003e“Good.” She reaches for the buttons on my shirt and begins unfastening them. “You, sir, are overdressed. Go change into your trunks and swim with me.”\u003c/p\u003e\n\u003cp\u003e“Yes, ma’am.”\u003c/p\u003e\n\u003cp\u003eWhen I come out of the house, she’s already shoulder deep in the clear blue water so I don’t get to feast my eyes on her in the skimpy red bikini. “You just couldn’t wait, could you?”\u003c/p\u003e\n\u003cp\u003e“Nope. It’s been calling to me for hours and now I’m not alone, so I didn’t break your rule.”\u003c/p\u003e\n\u003cp\u003eI toss my towel next to hers and walk out to meet her in the ocean. She swims over and puts her arms around my shoulders. “I’ve never been anywhere so beautiful. Thank you for bringing me.”\u003c/p\u003e\n\u003cp\u003e“It’s my pleasure.”\u003c/p\u003e\n\u003cp\u003e“I’m pretty sure it’s going to bring you some.”\u003c/p\u003e\n\u003cp\u003e“Oh, is it?”\u003c/p\u003e\n\u003cp\u003e“The eight ball says chances are good.” She kisses my mouth and rests her forehead against mine. “Do you come here often?”\u003c/p\u003e\n\u003cp\u003e“I try to make rounds on Aurelia at least once a month during the summer.”\u003c/p\u003e\n\u003cp\u003e“Why do you always come alone?”\u003c/p\u003e\n\u003cp\u003e“I’ve never been with anyone I wanted to bring. Until you.”\u003c/p\u003e\n\u003cp\u003e“Oh.” That’s all she says and doesn’t press it further.\u003c/p\u003e\n\u003cp\u003eWhen we’re tired of swimming, we come out of the water to relax on the loungers. She’s stretched out with one of her long legs bent.\u003c/p\u003e\n\u003cp\u003e“I want to take you into town for dinner.”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“Maybe dancing afterwards?”\u003c/p\u003e\n\u003cp\u003e“Sure, that sounds like fun.”\u003c/p\u003e\n\u003cp\u003eAfter dinner at a romantic café, I take Laurelyn to a dance club I noticed when buying her birthday present. Lights flash around us in the dark and it’s packed shoulder to shoulder. It’s not really the relaxed dancing I had in mind, but she seems happy about being here.\u003c/p\u003e\n\u003cp\u003eShe grabs my arms and we move toward the dance floor. The music is loud and there’s a fast song playing. Laurelyn moves to it like it’s something she’s done a million times.\u003c/p\u003e\n\u003cp\u003e“Go out dancing much?”\u003c/p\u003e\n\u003cp\u003e“Yeah. Addison and I hit the dance scene in Nashville a lot.”\u003c/p\u003e\n\u003cp\u003eShe turns her back to me and grabs my hands. She places them on her hips and backs up until her whole body is rubbing against mine as she dances. She knows what she’s doing to me. She can feel the evidence grinding against her ass.\u003c/p\u003e\n\u003cp\u003eWe’re packed on the dance floor and everyone is in his or her own little world. No one is paying attention to us, so I slide my hand from her hip to between her legs. She leans her head against my chest. “You are so bad.”\u003c/p\u003e\n\u003cp\u003e“I can’t help myself when you’re rubbing on me like that.”\u003c/p\u003e\n\u003cp\u003e“Sorry. Want to get a drink?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I need one. A big one.”\u003c/p\u003e\n\u003cp\u003eWe get a couple of glasses of wine from the bar and migrate to the corner so we can hear each other over the pounding bass. “Have you been here before?”\u003c/p\u003e\n\u003cp\u003e“No. I saw this place today and thought it might be fun. Do you want to leave?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “No. I’m having fun.”\u003c/p\u003e\n\u003cp\u003eI feel someone bump into me from behind and I spill my wine down the front of my shirt. “Shit.”\u003c/p\u003e\n\u003cp\u003eI turn to look at the jerk behind me and he sees the damage he’s caused. “Man, I’m sorry. Please, let me buy you another drink and pay for your dry cleaning.”\u003c/p\u003e\n\u003cp\u003eI’m afraid dry cleaning isn’t going to save this. “That won’t be necessary.”\u003c/p\u003e\n\u003cp\u003eHe offers his hand. “I’m Chris and this is my wife, Trisha.”\u003c/p\u003e\n\u003cp\u003eI’m not really interested in introductions, but I choose to be friendly instead of telling these people to get lost so I can be alone with my girl. “I’m Lachlan and this is Laurelyn.”\u003c/p\u003e\n\u003cp\u003eI’m shaking his hand but he’s looking at Laurelyn. And for longer than I like. “Is the missus your wife or girlfriend?”\u003c/p\u003e\n\u003cp\u003e“Girlfriend.” Laurelyn gazes at me and we both grin.\u003c/p\u003e\n\u003cp\u003eThe music is loud, so the wife leans closer. “Have you been together long?”\u003c/p\u003e\n\u003cp\u003e“Six weeks,” I answer. That means we’re half-over. I wonder if she’s thinking the same thing.\u003c/p\u003e\n\u003cp\u003eTrish is screaming over the music. “Wow. Things are still in that new, fun, exciting stage for you.” Exciting is an understatement. I should tell them what kind of relationship we have just to freak their married asses out so they’ll go away.\u003c/p\u003e\n\u003cp\u003eWe laugh at our shared secret. I put my arm around her and pull her close. “There’s very little about us or our relationship that’s boring.”\u003c/p\u003e\n\u003cp\u003eLaurelyn holds her glass of wine out for me. “Will you hold this for a moment while I step to the restroom?”\u003c/p\u003e\n\u003cp\u003eTrisha takes the last gulp and then slides her empty glass toward the bartender. “I need to go too.”\u003c/p\u003e\n\u003cp\u003ePerfect. I’m left with my new best friend, Chris. “Your girlfriend is a Yank?”\u003c/p\u003e\n\u003cp\u003eI take a drink from Laurelyn’s glass since I’m wearing my wine. “Yes.”\u003c/p\u003e\n\u003cp\u003e“She’s very beautiful. I couldn’t help but notice her when you were dancing. I’d really like to fuck her.”\u003c/p\u003e\n\u003cp\u003eWhat? The music is loud and I decide I misunderstood what he said, so I tilt my head toward him. “What was that?”\u003c/p\u003e\n\u003cp\u003eHe steps closer and puts his hand on my shoulder. “My wife is really turned on by you. She wants to give you head while you watch me fuck your girlfriend. I mean, if you’re into watching. Our only rule is no kissing. We save that for each other.”\u003c/p\u003e\n\u003cp\u003eSwingers.\u003c/p\u003e\n\u003cp\u003eI know I do some weird shit when it comes to women, but this tops the fucking cake. I look like an altar boy next to this joker. I’m so stunned I don’t answer. I don’t know how to.\u003c/p\u003e\n\u003cp\u003eLaurelyn and Swinger Trisha come back from the bathroom and rejoin the circle. Laurelyn takes her drink from my hand and I watch her face, wondering if the wifey propositioned her while in the bathroom. Her demeanor seems unchanged, so I assume Trisha left her husband in charge of closing this deal.\u003c/p\u003e\n\u003cp\u003eShe loops her arm through her husband’s. “So, did you ask him, honey?”\u003c/p\u003e\n\u003cp\u003e“We’re in the middle of discussing it.” He grins at me. “So, what do you think? Are you guys up for it?”\u003c/p\u003e\n\u003cp\u003eI think Laurelyn is trying to read my face, but can’t. “Are we up for what?”\u003c/p\u003e\n\u003cp\u003eI pass my empty wine glass to Laurelyn. “Will you hold this for me, baby?”\u003c/p\u003e\n\u003cp\u003eI guess it can be called a sucker punch since he has no idea it’s coming, but I make a fist and slam Swinger Chris in the jaw, sending him face down onto the dance floor. I want him to get up so I can beat the shit out of him, but he’s smarter than that and stays down. “Get up.”\u003c/p\u003e\n\u003cp\u003eLaurelyn stands there in shock staring at me because she has no idea what this freak wants to do to her. “Lachlan! What are you doing?”\u003c/p\u003e\n\u003cp\u003eI point to Chris on the floor. “You want to know what I think? Is that a clear-enough answer for you?”\u003c/p\u003e\n\u003cp\u003eSecurity is stalking in my direction to throw me out, so I put both hands up. “No need. We’re out of here.”\u003c/p\u003e\n\u003cp\u003eI take Laurelyn by the arm and pull her toward the door. “What’s going on?”\u003c/p\u003e\n\u003cp\u003e“Not now,” I growl at her.\u003c/p\u003e\n\u003cp\u003eShe follows me outside and comes to a halt. “Why did you hit him?”\u003c/p\u003e\n\u003cp\u003eI keep walking toward the car. I’m afraid I’ll go back inside and kill him if I don’t get out of there.\u003c/p\u003e\n\u003cp\u003eWe get into the car and I grip the steering wheel. That’s when I realize how damn bad my hand hurts.\u003c/p\u003e\n\u003cp\u003e“Lachlan, you’re scaring me.”\u003c/p\u003e\n\u003cp\u003e“No more than I’m scaring myself.” I just lost my shit over some guy telling me he wanted to fuck her. He made me see red. I wanted to choke the life out of him for what he said.\u003c/p\u003e\n\u003cp\u003eShe’s staring at me. “I highly doubt that.”\u003c/p\u003e\n\u003cp\u003eI can’t talk to her about this right now. I’m too furious. I start the car and drive to the house in silence. I’m pissed off. She’s scared and confused. Not a great combination.\u003c/p\u003e\n\u003cp\u003eNeither of us says anything when we get to the house. She walks inside and goes straight to the bedroom. I go to the kitchen and search the freezer. I don’t find frozen peas, so I wrap ice in a dish towel and put it around my swollen hand. It hurts like hell, but I don’t regret hitting that asshole. I’d do it again in a heartbeat.\u003c/p\u003e\n\u003cp\u003eI calm down after I stand in the kitchen for a while. I decide I owe her an explanation, so I go into the bedroom to find her. She’s wearing her nightgown and standing in front of the sink washing her face. She watches me in the mirror as I come up to stand behind her.\u003c/p\u003e\n\u003cp\u003eI put the dishcloth-wrapped ice on the counter before I place my hands on her upper arms and kiss one of her bare shoulders. She reaches up to touch my injured hand. “You’re bleeding. You need to clean this so it doesn’t get infected.”\u003c/p\u003e\n\u003cp\u003eShe takes my hand. “Is there any antiseptic here? Or maybe some triple antibiotic ointment?”\u003c/p\u003e\n\u003cp\u003eI’m rarely here, so I don’t make a habit of keeping stuff like that around. “I doubt it.”\u003c/p\u003e\n\u003cp\u003eShe brings it closer for a better inspection. “You should at least wash it with soap and water.”\u003c/p\u003e\n\u003cp\u003eShe cuts on the water and soaps a lather onto her fingers. She washes my knuckles until the dried blood is gone and then blots it dry. “I’m afraid you’re going to owe your boss some new towels.”\u003c/p\u003e\n\u003cp\u003e“He’ll get over it.”\u003c/p\u003e\n\u003cp\u003eShe’s still holding my hand when she looks up at me. “Tell me what happened.”\u003c/p\u003e\n\u003cp\u003eI focus on her eyes as I remember his words, “I’d really like to fuck her.” The thought of anyone else having her makes me crazy.\u003c/p\u003e\n\u003cp\u003eI reach out to hold her face. I lean forward and kiss her, not knowing if she will let me or not, but she does. When I finish, I take her hand and pull her into the bedroom toward the bed. I sit on the edge and pull her hips toward me so she’s standing between my legs. Her fingers play in my tousled hair. \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-from-pain-beauty-1/page-37.html","bookId":1879,"creation":"Oct 5, 2019 4:53:18 PM","modification":"Oct 5, 2019 4:53:18 PM"}
