{"id":83626,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI have a career to return to in four weeks. At least, I hope I still have a career. Blake still owns half the rights to my songs from the record we were producing, and he can shove them up his ass. I’m writing new songs. It’s the wrecked affair with him I worry about. I pray word of it doesn’t get out and ruin everything I’ve worked so hard to achieve.\u003c/p\u003e\n\u003cp\u003eWow. I only have four weeks left with Lachlan.\u003c/p\u003e\n\u003cp\u003eOur precious time together feels like a candle with wicks burning at both ends. Once the flame meets in the middle, we’re over. I’ll never see him again, or hear his laugh or touch his skin. I’ll never share a bed with him again. Am I prepared for it when that time comes? I don’t think I am, but it doesn’t matter if I’m not. It’s coming, and I’d better figure out how to get ready.\u003c/p\u003e\n\u003cp\u003eI’m thankful to have the Martin and the baby grand at my disposal because Lachlan’s long hours give me a lot of time to compose. Being here inspires me. Hell, I should at least be honest about it. It’s Lachlan who inspires me. I know the stuff I’m writing is gold, but the inspiration behind the music is bittersweet, and I fear I’ve come to that place I didn’t want to be—writing hits because I’m terribly in love.\u003c/p\u003e\n\u003cp\u003eI’m tinkering with a melody on the baby grand when Mrs. Porcelli comes into the living room. “Dinner is ready and on the stove, Laurelyn, so I’m leaving.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Mrs. Porcelli. Have a nice evening.”\u003c/p\u003e\n\u003cp\u003eI play the chorus again, trying to decide if it’s right. “It’s a lovely song, Laurelyn.”\u003c/p\u003e\n\u003cp\u003e“You’ve been listening?”\u003c/p\u003e\n\u003cp\u003eShe nods. “I hope you don’t mind.”\u003c/p\u003e\n\u003cp\u003e“Not at all. I doubt you’ve had much choice but to listen. You think it’s good?”\u003c/p\u003e\n\u003cp\u003e“I think it’s great.”\u003c/p\u003e\n\u003cp\u003e“Thank you. I hope you’re not the only one who thinks so.”\u003c/p\u003e\n\u003cp\u003e“I also think he feels the same about you.” I look up from the piano at her. “The song is about Mr. McLachlan, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Is it that obvious?”\u003c/p\u003e\n\u003cp\u003e“I’m afraid so, dear. Have you played it for him?”\u003c/p\u003e\n\u003cp\u003e“Oh, no. I could never do that.” And I especially couldn’t if the song is that transparent.\u003c/p\u003e\n\u003cp\u003e“I think you should reconsider. He’d love it.”\u003c/p\u003e\n\u003cp\u003e“I’ll think about it,” I lie.\u003c/p\u003e\n\u003cp\u003e“Good. I’ll be choofing off now. Have a good evening.”\u003c/p\u003e\n\u003cp\u003eI work on my newest song until Lachlan comes home. Home. There’s that word again. I see him standing in the doorway watching me, and I stop singing the moment his eyes meet mine. How long as he been standing there?\u003c/p\u003e\n\u003cp\u003e“It’s beautiful. Don’t stop on my account.”\u003c/p\u003e\n\u003cp\u003e“I’ve been at it all day, so I’m ready to call it quits for the night.” I get up from the bench. “Dinner’s ready. Would you like to eat now?”\u003c/p\u003e\n\u003cp\u003e“Only if you’re joining me.”\u003c/p\u003e\n\u003cp\u003eI walk to the doorway to kiss him. “I’ve joined you every night for two months. I’m not stopping now.”\u003c/p\u003e\n\u003cp\u003eI fill our plates with salmon and rice pilaf while Lachlan chooses a vintage, and then we meet at the informal dining table. He pulls my chair out for me and pours my wine. It’s one of the many routines we’ve developed after living together for eight weeks.\u003c/p\u003e\n\u003cp\u003e“Do you remember me telling you I wanted to take you to Sydney a while back?”\u003c/p\u003e\n\u003cp\u003e“Yes, and you have tickets for the opera.”\u003c/p\u003e\n\u003cp\u003e“That’s right. Madama Butterfly. It’s this weekend and I still want you to come with me.”\u003c/p\u003e\n\u003cp\u003e“I’m in, but I have to warn you—I’m no fan of opera. I don’t understand it.”\u003c/p\u003e\n\u003cp\u003e“Honestly, I’m not a huge fan myself, but these tickets are a gift from one of my customers in Sydney. They’re balcony seats and I’m afraid he has the tickets for the other seats and will know if I don’t show.”\u003c/p\u003e\n\u003cp\u003e“You’re so considerate.”\u003c/p\u003e\n\u003cp\u003e“I’m not being considerate. I’m being business-minded. I don’t want to insult him and lose his account.”\u003c/p\u003e\n\u003cp\u003e“Well, then, you’re being considerate in your business-mindedness.”\u003c/p\u003e\n\u003cp\u003eHe laughs at me. “Business-mindedness. Say that fast ten times.”\u003c/p\u003e\n\u003cp\u003e“No, it was hard enough to say it once.”\u003c/p\u003e\n\u003cp\u003e“The trip won’t be a total bust. We’ll do the opera on Friday night and then I have other plans for us.”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“I’m not telling you. You’ll have to wait and find out on Saturday, Miss Beckett.”\u003c/p\u003e\n\u003cp\u003eI’m wearing a fitted black cocktail dress and a stole with a pair of tall heels. Devil shoes. That’s what I call them because they’re going to hurt like hell if I walk much in them. But damn, they make me look great, and that’s what I want—to be beautiful for Lachlan, even if it’s painful. I can stand the hurt.\u003c/p\u003e\n\u003cp\u003eI’m in front of the mirror fastening my diamond pendant around my neck when Lachlan comes into the bathroom. “You’re missing something.”\u003c/p\u003e\n\u003cp\u003eI inspect myself and take inventory. I don’t know what he’s referring to, but I take the opportunity to mess with him. “How did you know I wasn’t wearing panties?”\u003c/p\u003e\n\u003cp\u003eHis eyes widen and so does his smile as he reaches for the hem of my dress to assess the situation. “You’re not? Well, that happens to be very convenient.”\u003c/p\u003e\n\u003cp\u003eI swat his hand. “There’ll be none of that until later. What am I missing?”\u003c/p\u003e\n\u003cp\u003eHe pulls a black velvet box from the inner pocket of his jacket. “This.”\u003c/p\u003e\n\u003cp\u003eI look at the box sitting on his opened palm. “You spoil me, Lachlan.”\u003c/p\u003e\n\u003cp\u003e“And you love it. Admit it.”\u003c/p\u003e\n\u003cp\u003eI roll my eyes at him. It’s not that I don’t love being spoiled by Lachlan. I do, but it makes me uncomfortable when he gives me expensive gifts. Anything housed in a jewelry box is going to cost big bucks.\u003c/p\u003e\n\u003cp\u003eIt clicks as he pops its top and I see a pair of diamond solitaire earrings—big ones. I reach out and touch them. “They’re beautiful.”\u003c/p\u003e\n\u003cp\u003e“They are, but you’re more beautiful.”\u003c/p\u003e\n\u003cp\u003eHe always tells me that. I wonder if he said that to the others.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Nothing’s wrong.” I hold out my palm, grinning. “Give me my new earrings so I can put them on.”\u003c/p\u003e\n\u003cp\u003eHe takes them from the box and places them in my hand one at a time. I tilt my head to the side so my hair falls out of the way while I put the first solitaire in. Damn, it’s even bigger in my ear. I wonder how many carats these are? No doubt a lot.\u003c/p\u003e\n\u003cp\u003eAfter I put the second one in, I hold my head upright and Lachlan tucks my hair behind my ears for inspection. “Even if minor, diamonds always have some imperfections, but you make these perfect.”\u003c/p\u003e\n\u003cp\u003e“Thank you for the earrings and the compliment.”\u003c/p\u003e\n\u003cp\u003e“My pleasure. Are you ready to go?”\u003c/p\u003e\n\u003cp\u003e“I am.”\u003c/p\u003e\n\u003cp\u003eWe arrive at the Sydney Opera House and Lachlan has made arrangements to park in the concourse section near the entrance since there is no valet. My feet thank him. Otherwise, we’d be doing some trekking from the public parking area.\u003c/p\u003e\n\u003cp\u003eWe’re walking toward the entrance when a man with a huge camera steps in front of us and begins to snap pictures. The flash of light is almost blinding as I feel Lachlan’s hand at the small of my back, urging me to move along.\u003c/p\u003e\n\u003cp\u003eWhen we are in the building, I look at Lachlan and he doesn’t seem fazed by the bizarre incident at all. “That was strange. What do you think that was all about?”\u003c/p\u003e\n\u003cp\u003e“I’m sure it was a photographer assigned to cover opening night.”\u003c/p\u003e\n\u003cp\u003e“The newspaper should teach their staff to be courteous when photographing patrons. That was rude. And ridiculous. He acted like he had to snap as many pictures as possible before you punched him out—like a paparazzi going after a celebrity.”\u003c/p\u003e\n\u003cp\u003e“We should probably find our seats so I can speak with Mr. Brees, if he’s here.”\u003c/p\u003e\n\u003cp\u003eIn our private balcony section, we’re on the second of two rows. Lachlan leans over once we’re seated and whispers, “That’s not Mr. Brees sitting in front of us. You want to leave?”\u003c/p\u003e\n\u003cp\u003eIs he serious? “No. We’re here. We’re dressed up. Let’s act like we know something about opera.”\u003c/p\u003e\n\u003cp\u003e“Oh, I know all about opera. I’m just not a fan. My mother loves it, so I grew up hearing it. Madama Butterfly is her favorite, so I know it inside and out. We can blow this off and go do something else if you want.”\u003c/p\u003e\n\u003cp\u003e“No. I want to stay, especially since I didn’t know I was with an opera expert. You can explain it to me.”\u003c/p\u003e\n\u003cp\u003eHe laughs. “Awesome. That’s just what I wanted to do.”\u003c/p\u003e\n\u003cp\u003eThe curtain goes up, and after just a few moments, I’m lost. “I have no idea what’s going on.”\u003c/p\u003e\n\u003cp\u003e“Okay. It’s 1904 and the man, Pinkerton, is a US Naval officer. He’s about to marry a fifteen-year-old Japanese girl they call Butterfly, but he knows he’s going to divorce her when he finds a proper American wife.”\u003c/p\u003e\n\u003cp\u003e“Well, that’s pretty shitty.”\u003c/p\u003e\n\u003cp\u003e“Don’t blame me. I didn’t write it. Anyway, Butterfly loves Pinkerton so much, she converts from her Japanese religion to Christianity. Her uncle finds out she converted and comes to the house where they are being wed. He shows his ass, curses Butterfly, and renounces her. The end of this act is them preparing for their wedding night.”\u003c/p\u003e\n\u003cp\u003e“So this is like bow-chicka-wow-wow, only opera style?”\u003c/p\u003e\n\u003cp\u003eHe starts laughing and earns several shushes from the row of people in front of us. He leans closer and I feel a warm rush of breath against my ear as he whispers. “No, Madama Butterfly isn’t bow-chicka-wow-wow by any means, but I’ll sure show you some when we get back to the hotel.”\u003c/p\u003e\n\u003cp\u003eHis promise sends a flood of need between my legs and I become restless in my seat. Lachlan watches me and smiles. “Everything okay over there?”\u003c/p\u003e\n\u003cp\u003e“I’m good.”\u003c/p\u003e\n\u003cp\u003e“Are you really not wearing panties?” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-from-pain-beauty-1/page-40.html","bookId":1879,"creation":"Oct 5, 2019 4:53:18 PM","modification":"Oct 5, 2019 4:53:18 PM"}
