{"id":83597,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDaniel peers at Lachlan through the rearview mirror. “Where to, sir?”\u003c/p\u003e\n\u003cp\u003eHe surveys me for an answer. I think he’s hoping I’ll tell him I want to go home with him tonight, but I don’t. I haven’t agreed to this insanity yet.\u003c/p\u003e\n\u003cp\u003e“To Miss Beckett’s,” he tells Daniel.\u003c/p\u003e\n\u003cp\u003eI’m feeling the effects of my four cocktails. Liquid courage pulsates through my veins. I feel brave. And flirty. I put my hand on Lachlan’s thigh and use my fingertip to trace an imaginary infinity symbol. I feel the muscle in his thigh grow taut through his pants. “Mr. Henry, does Daniel have any idea what it is you do with the women you keep in your company?”\u003c/p\u003e\n\u003cp\u003eWithout being asked, Daniel reaches for the control on the radio and increases the volume of the music in the front of the car. I hear “Talk Dirty To Me” for a brief second before he changes the station to classical. Or maybe opera. I’m too buzzed to tell. Either way, I don’t care for it.\u003c/p\u003e\n\u003cp\u003eI lean forward. “Daniel. Change it back to Poison.”\u003c/p\u003e\n\u003cp\u003eI see him eye his employer in the rearview mirror. Lachlan gives him a curt nod and I hear Bret Michaels singing again.\u003c/p\u003e\n\u003cp\u003e“I love this song.”\u003c/p\u003e\n\u003cp\u003e“I do too, but I’d like it much better if you were singing it to me instead of Poison.”\u003c/p\u003e\n\u003cp\u003e“I’ve been known to take requests.”\u003c/p\u003e\n\u003cp\u003e“Me too. I can talk dirty by request anytime.”\u003c/p\u003e\n\u003cp\u003eI become hypersensitive to everything about this man. His breathing sounds louder and his scent stronger, so masculine. I love the feel of his leg beneath my finger. “You didn’t answer me. Does Daniel know what you do with women?”\u003c/p\u003e\n\u003cp\u003eIt’s dark and I can’t make out his expression. “I pay Daniel to be available when I need him. He isn’t my confidant, so we don’t discuss what I do with the women I date.”\u003c/p\u003e\n\u003cp\u003e“The women you date,” I whisper as I turn to stare out the window. The streetlights flash like strobes as we pass. If I say yes, I will be number thirteen. I can’t imagine that going well. Thirteen is always unlucky.\u003c/p\u003e\n\u003cp\u003eHe puts his hand on my knee and heat radiates up my thigh. “I want to know what you’re thinking.”\u003c/p\u003e\n\u003cp\u003eHis intimate gesture gains my full attention. “I would be number thirteen.”\u003c/p\u003e\n\u003cp\u003eI’m not certain, but I think he’s amused by my observation. “I suppose you would be.”\u003c/p\u003e\n\u003cp\u003eI’m superstitious. I always have been. “It’s an unlucky number.”\u003c/p\u003e\n\u003cp\u003e“I don’t think it is. I was born on the thirteenth.”\u003c/p\u003e\n\u003cp\u003eIf I do this, something will go wrong and this man will hurt me. I know it as sure as I’m sitting here next to him feeling how much he makes me want to say yes. “How can you think it’s possible to have something this hot without one of us getting burned?”\u003c/p\u003e\n\u003cp\u003eI see him grin in the darkness. “You think this thing between us is hot?”\u003c/p\u003e\n\u003cp\u003eDaniel pulls to a stop in front of Ben’s apartment building. I don’t reply to Lachlan—it’s never wise to throw fuel on a fire already raging out of control.\u003c/p\u003e\n\u003cp\u003eDaniel opens the door and I get out of the car behind Lachlan. We walk up the sidewalk to the building’s entrance and he shocks me by reaching for my hand. It’s such a sweet and intimate thing to do. “Do you have your own bedroom?”\u003c/p\u003e\n\u003cp\u003e“No. Addison and I share the guest room.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eWhat? Did he think I was sharing a bed with Ben? What if I were? He didn’t have a claim on me. Yet. “Where did you think I was sleeping?”\u003c/p\u003e\n\u003cp\u003e“I had no idea since these apartments are so small. However, I do know your friend’s brother would like nothing better than to have you in his bed. Then again, so would I, so I don’t guess I have room to say much.”\u003c/p\u003e\n\u003cp\u003eThere he goes again, saying whatever is on his mind. I’m not sure if I should appreciate his honesty or brace myself for whatever might come out of his mouth next. “Are you missing your filter, or is it an Aussie thing to blurt out every inappropriate thought you have?”\u003c/p\u003e\n\u003cp\u003eWe’re standing at the entrance to the building and I sense what’s coming next. I feel it in my bones. And my groin. He’s going to kiss me. And I want him to. Badly.\u003c/p\u003e\n\u003cp\u003eBut then that isn’t what he does.\u003c/p\u003e\n\u003cp\u003eHe pushes me until my back is against the building. He pins me with his hips so I’m trapped. There’s no escape—not that I would try. His eyes dart from mine to my mouth, then back up to my eyes. “I say exactly what’s on my mind because I don’t have time for silly games. I told you I don’t do pretenses, and this is me showing you what I mean. I want you to know exactly what’s on my mind.”\u003c/p\u003e\n\u003cp\u003eIt’s unnerving the way his eyes pierce mine. “And what’s on your mind right now?”\u003c/p\u003e\n\u003cp\u003eHis mouth is so close to mine, I feel his warm breath on my lips. “Right now, all I’m thinking about is how I’m going to get you in my bed so I can show you all the ways I can make you come.”\u003c/p\u003e\n\u003cp\u003eUmm … yes, please and thank you.\u003c/p\u003e\n\u003cp\u003eHe makes me want to get on all fours and crawl like a tigress. I’m burning from the inside out, and he hasn’t even kissed me yet. This man is talented. I wonder what he’d be able to do if we weren’t standing in a very public place.\u003c/p\u003e\n\u003cp\u003eHe takes my mouth with his hand and squeezes my jaw inward before he rubs his thumb over my lips. “I’ve been wanting to devour this mouth since the first time I saw you.”\u003c/p\u003e\n\u003cp\u003e“Then, why don’t you?” I feel audacious so I issue a challenge. “I dare you.”\u003c/p\u003e\n\u003cp\u003eI watch his face as I wait for him to take me up on my invite. Come on, I want you to do it. My chest heaves up and down so hard, I can see it moving in my peripheral vision, and my breathing is embarrassingly loud. I’m stunned by my sudden and unexpected urgency for him. I shove the bells and whistles I hear aside—the ones alerting me to how wrong this is—because I don’t want to heed my subconscious warnings. I only want to feel what this man is offering—to make my fantasies come true.\u003c/p\u003e\n\u003cp\u003eThe next moment, his lips are on mine and my mouth opens to invite his tongue inside to play. His hand slides from my face to the nape of my neck and pulls me hard against his body, holding me prisoner. Through the thin material of my dress, I can feel how hard he is for me.\u003c/p\u003e\n\u003cp\u003eHis tongue finds mine and begins a slow, seductive dance. This man knows how to kiss. He has the ability to weaken my knees, and my body is no longer my own to control. It belongs to him, to do with as he wishes. He’s my puppeteer.\u003c/p\u003e\n\u003cp\u003eI moan against his mouth and he slides his hands up the bare skin of my back through the opening of my dress. His mouth leaves mine and he drags it across my face to hover over my ear. “I can’t wait to have a naughty with you. You know it’s only a matter of time, and when I do, I’m going to make you come so hard.”\u003c/p\u003e\n\u003cp\u003eI hear the catch in my own breath. No one has ever said anything like that to me, even Blake, and Lachlan’s promise pools like pure liquid seduction between my thighs.\u003c/p\u003e\n\u003cp\u003eHis mouth is hovering over my ear when I hear his husky voice again. “You want that, don’t you?”\u003c/p\u003e\n\u003cp\u003e“Yes.” I don’t know whose voice I hear, but it sounds nothing like mine—it’s that of a desperate woman.\u003c/p\u003e\n\u003cp\u003e“There’s no reason you have to be in my bed for me to make you come.” He takes his hand out of the back of my dress. I feel it slide around my waist down toward the spot where I want his touch most. I pant with anticipation.\u003c/p\u003e\n\u003cp\u003eI hear the sound of someone clearing his voice and I jump because I’m startled. But Lachlan isn’t—he’s annoyed as he drops his hand from its southern destination. He sighs heavily and inspects the person interrupting us.\u003c/p\u003e\n\u003cp\u003eIt could have been anyone in the building—or the world—but of course, it isn’t. It’s Ben. His voice drips with contempt as he walks past us to the door. “Excuse me. I didn’t mean to interrupt.”\u003c/p\u003e\n\u003cp\u003eI’m embarrassed and don’t know what to say. “No, it’s fine. You weren’t interrupting anything.”\u003c/p\u003e\n\u003cp\u003eLiar, liar. My pants are so on fire. And so is the rest of me.\u003c/p\u003e\n\u003cp\u003eBen interrupted Lachlan at the very moment he was about to stroke my slut button. Oh, dammit, the timing couldn’t have been worse. “I’d like to introduce you to Lachlan Henry. This is Ben Donavon.”\u003c/p\u003e\n\u003cp\u003eThey stare at each other for a few seconds and I wait for them to whip out their dicks and start a pissing contest. Wow. The silence isn’t awkward at all.\u003c/p\u003e\n\u003cp\u003eLachlan extends his hand first. “Nice to meet you, Ben.”\u003c/p\u003e\n\u003cp\u003eBen takes his hand but doesn’t appear at all pleased about doing so. “I don’t recognize your name, but your face is familiar. Have we met before?”\u003c/p\u003e\n\u003cp\u003eLachlan releases his hand and shakes his head. “I don’t think so.”\u003c/p\u003e\n\u003cp\u003eBen continues to study Lachlan. “I’m pretty certain we have.”\u003c/p\u003e\n\u003cp\u003eLachlan rubs his chin with his palm. “I was at the university’s vintage dinner. That must be it.”\u003c/p\u003e\n\u003cp\u003e“No, that’s not it.”\u003c/p\u003e\n\u003cp\u003eLachlan shrugs and puts his hands in his pockets. “I don’t know what to tell you, mate.”\u003c/p\u003e\n\u003cp\u003eBen makes no attempt to hide that he wants me away from the opposition. “If you’re done here, I’ll walk you up.”\u003c/p\u003e\n\u003cp\u003eI’m so not done here. Not even close. “Umm, I’ll be up in a minute.”\u003c/p\u003e\n\u003cp\u003eHe doesn’t say anything as he slings the door open with more force than is necessary.\u003c/p\u003e\n\u003cp\u003eLachlan doesn’t wait for the door to shut before he brings up Ben’s attraction to me again. “That bloke wants you in a bad way.”\u003c/p\u003e\n\u003cp\u003eI don’t want to talk about Ben. I want to get back to Lachlan sliding his hand under my dress, so I move closer and put my arms around his shoulders. “Where were we?”\u003c/p\u003e\n\u003cp\u003eHe brings his mouth back to mine and tugs on my bottom lip with his teeth. “I will spontaneously combust if we are interrupted again. How about I make good on my promise tomorrow when you come out to the vineyard with me?”\u003c/p\u003e\n\u003cp\u003eI want to tell him I’m willing to take the risk, but he’s right. Being interrupted again would blow. “Okay.” \u003c/p\u003e","sourceLink":"https://allnovel.net/beauty-from-pain-beauty-1/page-9.html","bookId":1879,"creation":"Oct 5, 2019 4:53:18 PM","modification":"Oct 5, 2019 4:53:18 PM"}
