{"id":97288,"no":14,"title":"Page 14","content":"\u003cp\u003eThe moving finger writes, and having writ\u003c/p\u003e\n\u003cp\u003eMoves on. Nor all your piety and wit\u003c/p\u003e\n\u003cp\u003eCan call it back to cancel half a line\u003c/p\u003e\n\u003cp\u003eNor all your tears wash out a word of it.\u003c/p\u003e\n\u003cp\u003eI had tried hard to blame myself for Estrellita Rivera, but in a certain sense it wouldn\u0027t stick. I had been drinking, certainly, but not heavily, and my overall marksmanship that night could not be faulted. And it was proper for me to shoot at the robbers. They were armed, they were fleeing from one killing already, and there were no civilians in the line of fire. A bullet ricocheted. Those things happen.\u003c/p\u003e\n\u003cp\u003ePart of the reason I left the force was that those things happen and I did not want to be in a position where I could do wrong things for right reasons. Because I had decided that, while it might be true that the end does not justify the means, neither do the means justify the end.\u003c/p\u003e\n\u003cp\u003eAnd now I had deliberately programmed Henry Prager to kill himself.\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t seen it that way, of course. But I couldn\u0027t see that it made too much difference. I had begun by pressuring him into attempting a second murder, something he would never have done otherwise. He had killed Spinner, but if I had simply destroyed Spinner\u0027s envelope I\u0027d have left Prager with no need ever to kill again. But I\u0027d given him reason to try, and he had tried and failed, and then he\u0027d been backed into a corner and chosen, impulsively or deliberately, to kill himself.\u003c/p\u003e\n\u003cp\u003eI could have destroyed that envelope. I had no contract with Spinner. I\u0027d agreed only to open the envelope if I failed to hear from him. I could have given away the whole three thousand instead of a tenth of it. I had needed the money, but not that badly.\u003c/p\u003e\n\u003cp\u003eBut Spinner had made a bet, and he\u0027d turned out a winner. He had spelled it all out: \"Why I think you\u0027ll follow through is something I noticed about you a long time ago, namely that you happen to think there is a difference between murder and other crimes. I am the same. I have done bad things all my life but never killed anybody and never would. I have known people who have killed which I\u0027ve known for a fact or a rumor and would never get close to them. It is the way I am and I think that you are that way too…\"\u003c/p\u003e\n\u003cp\u003eI could have done nothing, and then Henry Prager would not have wound up in a body bag. But there is a difference between murder and other crimes, and the world is a worse place for the murderers it allows to walk unpunished, as Henry Prager would have walked had I done nothing.\u003c/p\u003e\n\u003cp\u003eThere should have been another way. Just as the bullet should not have ricocheted into a little girl\u0027s eye. And try telling all that to the moving finger.\u003c/p\u003e\n\u003cp\u003eMass was still going on when I left. I walked a couple of blocks, not paying much attention to where I was, and then I stopped at a Blarney Stone and took communion.\u003c/p\u003e\n\u003cp\u003eIT was a long night.\u003c/p\u003e\n\u003cp\u003eThe bourbon kept refusing to do its job. I moved around a lot, because every bar I hit had one person in it whose company put me on edge. I kept seeing him in the mirror and taking him with me wherever I went. The activity and the nervous energy probably burned off a lot of the alcohol before it had a chance to get to me, and the time I spent walking around was time I could have more profitably spent sitting in one place and drinking.\u003c/p\u003e\n\u003cp\u003eThe kind of bars I chose had something to do with keeping me relatively sober. I usually drink in dark quiet places where a shot is two ounces, three if they know you. Tonight I was hitting Blarney Stones and White Roses. The prices were considerably lower but the shot glasses were small, and when you paid for an ounce that\u0027s what you got, and even so it was apt to be about 30 percent water.\u003c/p\u003e\n\u003cp\u003eAt one place on Broadway they had the basketball game on. I watched the last quarter on a big color set. The Knicks were down by a point when the quarter started, and wound up dropping it by twelve or thirteen. That was the fourth game for the Celtics.\u003c/p\u003e\n\u003cp\u003eThe guy next to me said, \"And next year they lose Lucas and DeBusschere, and Reed\u0027s knees are still gonna be shit, and Clyde can\u0027t do it all, so where the fuck are we?\"\u003c/p\u003e\n\u003cp\u003eI nodded. What he said sounded reasonable to me.\u003c/p\u003e\n\u003cp\u003e\"Even at the end of three, dead even for three periods, and they got Cowens and What\u0027s-his-name with five fouls, and then they can\u0027t find the basket. I mean, they don\u0027t fucking try, you know?\"\u003c/p\u003e\n\u003cp\u003e\"Must be my fault,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Huh?\"\u003c/p\u003e\n\u003cp\u003e\"They started falling apart when I started watching. It must be my fault.\"\u003c/p\u003e\n\u003cp\u003eHe looked me over and backed off a step. He said, \"Easy, guy. I didn\u0027t mean nothing.\"\u003c/p\u003e\n\u003cp\u003eBut he\u0027d read me wrong. I\u0027d been absolutely serious.\u003c/p\u003e\n\u003cp\u003eI wound up at Armstrong\u0027s, where they pour perfectly fine drinks, but by then I\u0027d lost my taste for it. I sat in the corner with a cup of coffee. It was a quiet night, and Trina had time to join me.\u003c/p\u003e\n\u003cp\u003e\"I kept a weather eye open,\" she said, \"but saw of him neither hide nor hair.\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"The cowboy. Just my cute little way of saying he hasn\u0027t been around tonight. Wasn\u0027t I supposed to keep watch, like a good Junior G-Man?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, the Marlboro man. I thought I saw him tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Here?\"\u003c/p\u003e\n\u003cp\u003e\"No, earlier. I\u0027ve been seeing a lot of shadows tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Is something wrong?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Hey.\" She covered my hand with one of hers. \"What\u0027s the matter, baby?\"\u003c/p\u003e\n\u003cp\u003e\"I keep finding new people to light candles for.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t get you. You\u0027re not drunk, are you, Matt?\"\u003c/p\u003e\n\u003cp\u003e\"No, but not for lack of trying. I have had better days.\" I sipped coffee, put the cup down on the checkered cloth. I took out Spinner\u0027s silver dollar-correction, my dollar, I\u0027d bought and paid for it-and I gave it a spin. I said, \"Last night somebody tried to kill me.\"\u003c/p\u003e\n\u003cp\u003e\"God! Around here?\"\u003c/p\u003e\n\u003cp\u003e\"A few doors down the block.\"\u003c/p\u003e\n\u003cp\u003e\"No wonder you\u0027re-\"\u003c/p\u003e\n\u003cp\u003e\"No, that\u0027s not it. This afternoon I got even. I killed a man.\" I thought she would take her hand from atop mine, but she didn\u0027t. \"I didn\u0027t exactly kill him. He stuck a gun in his mouth and pulled the trigger. A little Spanish gun, they truck them in by the ton from the Carolinas.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you say you killed him?\"\u003c/p\u003e\n\u003cp\u003e\"Because I put him in a room and the gun was the only door out of it. I boxed him in.\"\u003c/p\u003e\n\u003cp\u003eShe looked at her watch. \"Fuck it,\" she said. \"I can leave early for a change. If Jimmie wants to sue me for half an hour, then the hell with him.\" She reached behind her neck with both hands to unfasten her apron. The movement emphasized the swell of her breasts.\u003c/p\u003e\n\u003cp\u003eShe said, \"Like to walk me home, Matt?\"\u003c/p\u003e\n\u003cp\u003eWe had used each other a few times over the months to keep the lonelies away. We liked each other in and out of bed, and both of us had the vital security of knowing it could never lead to anything.\u003c/p\u003e\n\u003cp\u003e\"Matt?\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t do you much good tonight, kid.\"\u003c/p\u003e\n\u003cp\u003e\"You could keep me from getting mugged on the way home.\"\u003c/p\u003e\n\u003cp\u003e\"You know what I mean.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, Mr. Detective, but you don\u0027t know what I mean.\" She touched my cheek with her forefinger. \"I wouldn\u0027t let you near me tonight anyway. You need a shave.\" Her face softened into a smile. \"I was offering a little coffee and company,\" she said. \"I think you could use it.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe I could.\"\u003c/p\u003e\n\u003cp\u003e\"Plain old coffee and company.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"Not tea and sympathy, nothing like that.\"\u003c/p\u003e\n\u003cp\u003e\"Just coffee and company.\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh. Now tell me it\u0027s the best offer you\u0027ve had all day.\"\u003c/p\u003e\n\u003cp\u003e\"It is,\" I said. \"But that\u0027s not saying a hell of a lot.\"\u003c/p\u003e\n\u003cp\u003eSHE made good coffee, and she managed to come up with a pint of Harper\u0027s to flavor it with. By the time I was done talking, the pint had gone from mostly full to mostly empty.\u003c/p\u003e\n\u003cp\u003eI told her most of it. I left out anything that would make Ethridge or Huysendahl identifiable, and I didn\u0027t spell out Henry Prager\u0027s smarmy little secret. I didn\u0027t mention his name, either, although she figured to dope it out for herself if she bothered to read the morning papers.\u003c/p\u003e\n\u003cp\u003eWhen I was finished she sat there for a few minutes, head tilted to one side, eyes half lidded, smoke drifting upward from her cigarette. At length she said she didn\u0027t see how I could have done things differently.\u003c/p\u003e\n\u003cp\u003e\"Because suppose you managed to let him know that you weren\u0027t a blackmailer, Matt. Suppose you got a little more evidence together and went to him. You would have exposed him, wouldn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"One way or another.\"\u003c/p\u003e\n\u003cp\u003e\"He killed himself because he was afraid of exposure, and that was while he thought you were a blackmailer. If he knew you were going to hand him over to the cops, wouldn\u0027t he have done the same thing?\"\u003c/p\u003e\n\u003cp\u003e\"He might not have had the chance.\"\u003c/p\u003e\n\u003cp\u003e\"Well, maybe he was better off having the chance. Nobody forced him to take it, it was his decision.\"\u003c/p\u003e\n\u003cp\u003eI thought it over. \"There\u0027s still something wrong.\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t exactly know. Something doesn\u0027t fit together the way it should.\"\u003c/p\u003e\n\u003cp\u003e\"You just have to have something to feel guilty about.\" I guess the line hit home enough to show in my face, because she blanched. \"I\u0027m sorry,\" she said. \"Matt, I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"For what?\"\u003c/p\u003e\n\u003cp\u003e\"I was just, you know, being cute.\"\u003c/p\u003e\n\u003cp\u003e\"Many a true word is et cetera.\" I stood up. \"It\u0027ll look better in the morning. Things generally do.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t leave.\"\u003c/p\u003e\n\u003cp\u003e\"I had the coffee and company, and thanks for both. Now I\u0027d better get on home.\"\u003c/p\u003e\n\u003cp\u003eShe was shaking her head. \"Stay over.\"\u003c/p\u003e\n\u003cp\u003e\"I told you before, Trina-\"\u003c/p\u003e\n\u003cp\u003e\"I know you did. I don\u0027t particularly want to fuck either, as a matter of fact. But I really don\u0027t want to sleep alone.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know if I can sleep.\"\u003c/p\u003e\n\u003cp\u003e\"Then hold me until I fall asleep. Please, baby?\"\u003c/p\u003e\n\u003cp\u003eWe went to bed together and held each other. Maybe the bourbon finally got around to working, or maybe I was more exhausted than I\u0027d realized, but I fell asleep like that, holding her.\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eI woke up with my head throbbing and a liverish taste in the back of my throat. A note on her pillow advised me to help myself to breakfast. The only breakfast I could face was in the bottle of Harper\u0027s, and I helped myself to it, and, along with a couple of aspirins from her medicine cabinet and a cup of lousy coffee from the deli downstairs, it took some of the edge off the way I felt.\u003c/p\u003e\n\u003cp\u003eThe weather was good and the air pollution lighter than usual. You could actually see the sky. I headed back to the hotel, picking up a paper on the way. It was almost noon. I don\u0027t usually get that much sleep.\u003c/p\u003e\n\u003cp\u003eI would have to call them, Beverly Ethridge and Theodore Huysendahl. I had to let them know that they were off the hook, that in fact they\u0027d never actually been on it in the first place. I wondered what their reactions would be. Probably a combination of relief and some indignation about having been gulled. Well, that would be their problem. I had enough of my own.\u003c/p\u003e\n\u003cp\u003eI\u0027d have to see them in person, obviously. I couldn\u0027t manage it over the phone. I didn\u0027t look forward to it, but did look forward to having it behind me. Two brief phone calls and two brief meetings and I would never have to see either of them again.\u003c/p\u003e\n\u003cp\u003eI stopped at the desk. There was no mail for me, but there was a phone message. Miss Stacy Prager had called. There was a number where I was to call her as soon as possible. It was the number I had dialed from the Lion\u0027s Head. \u003c/p\u003e","sourceLink":"https://allnovel.net/time-to-murder-and-create-matthew-scudder-2/page-14.html","bookId":2321,"creation":"Oct 5, 2019 6:25:58 PM","modification":"Oct 5, 2019 6:25:58 PM"}
