{"id":97283,"no":9,"title":"Page 9","content":"\u003cp\u003eWhen the waitress came over she ordered gin and tonic. \"I\u0027m rushing the season,\" she said. \"It\u0027s really too cold out for summer drinks. But I\u0027m such a warm person emotionally that I can carry it off, don\u0027t you think?\"\u003c/p\u003e\n\u003cp\u003e\"Whatever you say, Mrs. Ethridge.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you keep forgetting my first name? Blackmailers shouldn\u0027t be so formal with their victims. It\u0027s easy for me to call you Matt. Why can\u0027t you call me Beverly?\"\u003c/p\u003e\n\u003cp\u003eI shrugged. I didn\u0027t really know the answer myself. It was hard to be sure what was my own reaction to her and what was a part of the role I was playing. I didn\u0027t call her Beverly largely because she wanted me to, but that was an answer that only led to another question.\u003c/p\u003e\n\u003cp\u003eHer drink came. She put out her cigarette, sipped her gin and tonic. She breathed deeply, and her breasts rose and fell within the pink sweater.\u003c/p\u003e\n\u003cp\u003e\"Matt?\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been trying to figure out a way to raise the money.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s going to take me some time.\"\u003c/p\u003e\n\u003cp\u003eI played them all the same way, and they all came back with the same response. Everybody was rich and nobody could get a few dollars together. Maybe the country was in trouble, maybe the economy was as bad as everybody said it was.\u003c/p\u003e\n\u003cp\u003e\"Matt?\"\u003c/p\u003e\n\u003cp\u003e\"I need the money right away.\"\u003c/p\u003e\n\u003cp\u003e\"You son of a bitch, don\u0027t you think I\u0027d like to get this over with as soon as possible? The only way I could get the money is from Kermit, and I can\u0027t tell him what I need it for.\" She lowered her eyes. \"Anyway, he hasn\u0027t got it.\"\u003c/p\u003e\n\u003cp\u003e\"I thought he had more money than God.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"Not yet. He has an income, and it\u0027s substantial, but he doesn\u0027t come into the principal until he\u0027s thirty-five.\"\u003c/p\u003e\n\u003cp\u003e\"When does that happen?\"\u003c/p\u003e\n\u003cp\u003e\"In October. That\u0027s his birthday. The Ethridge money is all tied up in a trust that terminates when the youngest child turns thirty-five.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s the youngest?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. He\u0027ll come into the money in October. That\u0027s in six months. I\u0027ve decided, I\u0027ve even mentioned it to him, that I\u0027d like to have some money of my own. So that I won\u0027t be dependent upon him to the extent that I am now. That\u0027s the kind of request he can understand, and he\u0027s more or less agreed to it. So in October he\u0027ll give me money. I don\u0027t know how much, but it will certainly be more than fifty thousand dollars, and then I\u0027ll be able to work things out with you.\"\u003c/p\u003e\n\u003cp\u003e\"In October.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t have money in your hands then, though. There\u0027ll be a lot of paperwork involved. October\u0027s six months from now, and it\u0027ll be another six months easy before you\u0027ve got cash in hand.\"\u003c/p\u003e\n\u003cp\u003e\"Will it really take that long?\"\u003c/p\u003e\n\u003cp\u003e\"Easily. So we\u0027re not talking about six months, we\u0027re talking about a year, and that\u0027s too long. Even six months is too long. Hell, one month is too long, Mrs. Ethridge. I want to get out of this town.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like the climate.\"\u003c/p\u003e\n\u003cp\u003e\"But spring\u0027s here. These are New York \u0027s best months, Matt.\"\u003c/p\u003e\n\u003cp\u003e\"I still don\u0027t like it.\"\u003c/p\u003e\n\u003cp\u003eShe closed her eyes, and I studied her face in repose. The lighting in the room was perfect for her, paired electric candles glowing against the red flecked wallpaper. At the bar, one of the men got to his feet, picked up some of the change in front of him, and headed for the door. On the way out he said something, and one of the women laughed loudly. Another man entered the bar. Somebody put money in the jukebox, and Lesley Gore said it was her party and she would cry if she wanted to.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got to give me time,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t got it to give.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you have to get out of New York? What are you afraid of, anyway?\"\u003c/p\u003e\n\u003cp\u003e\"The same thing the Spinner was afraid of.\"\u003c/p\u003e\n\u003cp\u003eShe nodded thoughtfully. \"He was very nervous toward the end,\" she said. \"It made the bed part very interesting.\"\u003c/p\u003e\n\u003cp\u003e\"It must have.\"\u003c/p\u003e\n\u003cp\u003e\"I wasn\u0027t the only one on his string. He made that fairly obvious. Are you playing his whole string, Matt? Or just me?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a good question, Mrs. Ethridge.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I like it myself. Who killed him, Matt? One of his other customers?\"\u003c/p\u003e\n\u003cp\u003e\"You mean he\u0027s dead?\"\u003c/p\u003e\n\u003cp\u003e\"I read newspapers.\"\u003c/p\u003e\n\u003cp\u003e\"Sure. Sometimes your picture\u0027s in them.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, and wasn\u0027t that just my lucky day. Did you kill him, Matt?\"\u003c/p\u003e\n\u003cp\u003e\"Why would I do that?\"\u003c/p\u003e\n\u003cp\u003e\"So that you could take his nice little number away from him. I thought you shook him down. Then I read how they fished him out of the river. Did you kill him?\"\u003c/p\u003e\n\u003cp\u003e\"No. Did you?\"\u003c/p\u003e\n\u003cp\u003e\"Sure, with my little bow and arrow. Listen, wait a year for your money and I\u0027ll double it. A hundred thousand dollars. That\u0027s nice interest.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d rather take the cash and invest it myself.\"\u003c/p\u003e\n\u003cp\u003e\"I told you I can\u0027t get it.\"\u003c/p\u003e\n\u003cp\u003e\"How about your family?\"\u003c/p\u003e\n\u003cp\u003e\"What about them? They don\u0027t have any money.\"\u003c/p\u003e\n\u003cp\u003e\"I thought you had a rich daddy.\"\u003c/p\u003e\n\u003cp\u003eShe winced, and covered it by lighting another cigarette. Both our drinks were empty. I motioned to the waitress, and she brought fresh ones. I asked if there was any coffee made. She said there wasn\u0027t but she\u0027d make a pot if I wanted. She sounded as though she really hoped I wouldn\u0027t want her to. I told her not to bother.\u003c/p\u003e\n\u003cp\u003eBeverly Ethridge said, \"I had a rich great-grandfather.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"My own father followed in his father\u0027s footsteps. The gentle art of turning a million dollars into a shoestring. I grew up thinking the money would always be there. That\u0027s what made everything that happened in California so easy. I had a rich daddy and I never really had to worry about anything. He could always bail me out. Even the serious things weren\u0027t serious.\"\u003c/p\u003e\n\u003cp\u003e\"Then what happened?\"\u003c/p\u003e\n\u003cp\u003e\"He killed himself.\"\u003c/p\u003e\n\u003cp\u003e\"How?\"\u003c/p\u003e\n\u003cp\u003e\"Sat in the car in a closed garage with the motor running. What\u0027s the difference?\"\u003c/p\u003e\n\u003cp\u003e\"None, I guess. I always wonder how people do it, that\u0027s all. Doctors usually use guns, did you know that? They have access to the simplest, cleanest ways in the world, an O.D. of morphine, anything like that, and instead they generally blow their brains out and make a hell of a mess. Why did he kill himself?\"\u003c/p\u003e\n\u003cp\u003e\"Because the money was gone.\" She picked up her glass, but paused with it halfway to her mouth. \"That was why I came back east. All of a sudden he was dead, and instead of money there were debts. There was enough insurance so that my mother can live decently. She sold the house, moved to an apartment. With that and Social Security, she gets along.\" She took a long drink now. \"I don\u0027t want to talk about it.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"If you took those pictures to Kermit, you wouldn\u0027t get anything. You\u0027d just queer your own pitch. He wouldn\u0027t buy them, because he wouldn\u0027t care about my good name. He\u0027d just care about his own, which would mean getting rid of me and finding a wife as bloodless as he is.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s playing golf this week. A pro-am tournament, they have them the day before the regular tournaments. He gets a professional golfer for a partner, and if they finish in the money the pro gets a few dollars out of it. Ketmit gets the glory. It\u0027s his chief passion, golf.\"\u003c/p\u003e\n\u003cp\u003e\"I thought you were.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m nicely ornamental. And I can act like a lady. When I have to.\"\u003c/p\u003e\n\u003cp\u003e\"When you have to.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right. He\u0027s out of town now, getting ready for this tournament. So I can stay out as late as I want. I can do as I please.\"\u003c/p\u003e\n\u003cp\u003e\"Handy for you.\"\u003c/p\u003e\n\u003cp\u003eShe sighed. \"I guess I can\u0027t use sex this time, can I?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid not.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a shame. I\u0027m used to using it, I\u0027m damned good at it. Hell. A hundred thousand dollars a year from now is a lot of money.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s also a bird in the bush.\"\u003c/p\u003e\n\u003cp\u003e\"I wish to hell I had something to use on you. Sex doesn\u0027t work, and I don\u0027t have money. I have a couple of dollars in a savings account, my own money.\"\u003c/p\u003e\n\u003cp\u003e\"How much?\"\u003c/p\u003e\n\u003cp\u003e\"About eight thousand. I haven\u0027t had the interest entered in a long time. You\u0027re supposed to take the book in once a year. Somehow I never got around to it. I could give you what I\u0027ve got, a down payment.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"A week from today?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong with tomorrow?\"\u003c/p\u003e\n\u003cp\u003e\"Uh-uh.\" She shook her head emphatically. \"No. All I can buy for my eight thousand is time, right? So I\u0027m going to buy a week with it right off. A week from today you\u0027ll have the money.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t even know you\u0027ve got it.\"\u003c/p\u003e\n\u003cp\u003e\"No, you don\u0027t.\"\u003c/p\u003e\n\u003cp\u003eI thought it over. \"All right,\" I said finally. \"Eight thousand dollars a week from today. But I\u0027m not going to wait a year for the rest of it.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe I could turn some tricks,\" she said. \"Like four hundred and twenty of \u0027em at a hundred dollars a throw.\"\u003c/p\u003e\n\u003cp\u003e\"Or forty-two hundred at ten.\"\u003c/p\u003e\n\u003cp\u003e\"You fucker,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Eight thousand. A week from today.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll get it.\"\u003c/p\u003e\n\u003cp\u003eI offered to put her in a cab. She said she\u0027d get her own and that I could pay for the drinks this time. I stayed at the table for a few minutes after she left, then paid the check and went out. I crossed the street and asked Benny if there were any messages. There weren\u0027t, but a man had called and not left his name. I wondered if it was the man who had threatened to put me in the river.\u003c/p\u003e\n\u003cp\u003eI went over to Armstrong\u0027s and took my usual table. The place was crowded for a Monday. Most of the faces were familiar. I had bourbon and coffee, and the third time around I caught a glimpse of a face that looked familiar in an unfamiliar way. On her next circuit of the tables, I crooked a finger at Trina. She came over to me with her eyebrows up, and the expression accented the feline cast to her features.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t turn around,\" I said. \"At the bar in front, right between Gordie and the guy in the denim jacket.\"\u003c/p\u003e\n\u003cp\u003e\"What about him?\"\u003c/p\u003e\n\u003cp\u003e\"Probably nothing. Not right away, but in a couple of minutes, why don\u0027t you walk past him and get a look at him?\"\u003c/p\u003e\n\u003cp\u003e\"And then what, Cap\u0027n?\"\u003c/p\u003e\n\u003cp\u003e\"Then report back to Mission Control.\"\u003c/p\u003e\n\u003cp\u003e\"Aye-aye, sir.\"\u003c/p\u003e\n\u003cp\u003eI kept my eyes facing toward the door but concentrated on what I could see of him at the periphery of my vision, and it wasn\u0027t my imagination. He did keep glancing my way. It was hard to gauge his height, because he was sitting down, but he looked almost tall enough to play basketball. He had an outdoor face and modishly long sand-colored hair. I couldn\u0027t make out his features very well-he was the length of the room away from me-but I got an impression of cool, competent toughness.\u003c/p\u003e\n\u003cp\u003eTrina drifted back with a drink I hadn\u0027t gotten around to ordering. \"Camouflage,\" she said, setting it before me. \"I have given him the old once-over. What did he do?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing that I know of. Have you seen him before?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think so. In fact, I\u0027m sure I haven\u0027t, because I would remember him.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"He tends to stand out in a crowd. You know who he looks like? The Marlboro man.\"\u003c/p\u003e\n\u003cp\u003e\"From the commercials? Didn\u0027t they use more than one guy?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. He looks like all of them. You know, high rawhide boots and a wide-brimmed hat and smelling of horseshit, and the tattoo on his hand. He\u0027s not wearing boots or a hat, and he doesn\u0027t have the tattoo, but it\u0027s the same image. Don\u0027t ask me if he smells of horseshit. I didn\u0027t get close enough to tell.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/time-to-murder-and-create-matthew-scudder-2/page-9.html","bookId":2321,"creation":"Oct 5, 2019 6:25:58 PM","modification":"Oct 5, 2019 6:25:58 PM"}
