{"id":66764,"no":21,"title":"Page 21","content":"\u003cp\u003e“Explain what you meant about Eric. If he went to the clinic, then he must know he’s the baby’s father,” Shelly pressed. She spread the linen napkin over her lap and smoothed it out vigorously, as if a wrinkle were cause for disciplinary action. Her face was tight with anxiety.\u003c/p\u003e\n\u003cp\u003e“According to the report, the likelihood of Eric fathering children is highly improbable.” Jack hated to be the bearer of bad news, but he assumed Eric had told her. He’d figured their subsequent conversation, more than the report, was the cause of his son’s depression. “I read the clinic’s report myself. His sperm count is very low. There is a minuscule possibility he fathered the child, but he doesn’t see that. All he read were the words highly improbable.”\u003c/p\u003e\n\u003cp\u003eShelly lowered her eyes and Jack wondered if she was struggling not to weep. “That explains a great deal,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Oh?” Jack didn’t mean to pry, but if she was going to volunteer the information…\u003c/p\u003e\n\u003cp\u003e“It explains why he hasn’t called me. He doesn’t believe the baby’s his. He obviously thinks I cheated on him, and I resent that. His lack of faith in me is very hurtful, Jack.” She stared down at the table. “But despite all that, he’s continuing to make the rent payments. He knows I can’t handle them with what I’m earning.”\u003c/p\u003e\n\u003cp\u003eJack wanted to groan out loud. While he appreciated the fact that Eric was generous, it also meant it could be years before he moved out on his own. Jack was stuck with his son.\u003c/p\u003e\n\u003cp\u003e“I told Eric not to, that I’d make the payments on my own, but he’s still covering the rent.” She paused, shaking her head. “I’m grateful. I don’t know what I’d do if I had to manage rent plus everything else.”\u003c/p\u003e\n\u003cp\u003e“Forgive me for being blunt here,” Jack said, “but I need the truth. Is Eric the father of your baby?”\u003c/p\u003e\n\u003cp\u003eFor the first time Shelly’s eyes met his. “This baby is your son’s. As soon as he or she is born, I’ll be able to prove it without a doubt. Until then, I don’t think it would do any good for Eric and me to see each other again.”\u003c/p\u003e\n\u003cp\u003eThat answered Jack’s other question even before he had the opportunity to ask. “I see.”\u003c/p\u003e\n\u003cp\u003e“Thank you for your concern, Jack,” she said quietly. “I appreciate it. But it doesn’t matter what that clinic told Eric. Because I know differently. I’ll be giving birth to the evidence in less than five months.”\u003c/p\u003e\n\u003cp\u003eBy the end of dinner, Jack didn’t feel any closer to a solution. When he arrived home, Eric was sitting in front of the television eating from a large bag of potato chips.\u003c/p\u003e\n\u003cp\u003e“You’re late,” his son said, keeping his gaze focused on the television.\u003c/p\u003e\n\u003cp\u003e“I had dinner with Shelly in Seattle.”\u003c/p\u003e\n\u003cp\u003eEric reached for the remote control and turned off the TV. “You were with Shelly?” He frowned at Jack, as if waiting for him to elaborate. “Did she call you?” he finally asked.\u003c/p\u003e\n\u003cp\u003e“I called her.” Jack shrugged off his raincoat and considered the best way to approach this dilemma.\u003c/p\u003e\n\u003cp\u003e“Did you tell her about the sperm test?” Eric demanded. His son was on his feet now, outrage flashing from his eyes.\u003c/p\u003e\n\u003cp\u003e“There wasn’t any bread left this morning,” Jack said, “and the hot water was used up and then both towels were wet and—”\u003c/p\u003e\n\u003cp\u003e“You broke my trust because I ate the last stale piece of bread in the house? Is that what you’re telling me?”\u003c/p\u003e\n\u003cp\u003e“No…I was hoping that if I reasoned with Shelly, we might clear this up once and for all.”\u003c/p\u003e\n\u003cp\u003e“If you want me out of here, all you have to do is ask.” Eric stormed into what had once been the spare bedroom.\u003c/p\u003e\n\u003cp\u003e“I didn’t say I wanted you to move out,” Jack said, but his words held little conviction.\u003c/p\u003e\n\u003cp\u003e“Not a problem, Dad,” Eric said, rushing out of the room a minute later with his duffel bag. Clothes spilled out from all sides. “I’m out of here. You weren’t much of a father when I needed one as a kid. I don’t know what made me think you’d be any different now.”\u003c/p\u003e\n\u003cp\u003eJack groaned in frustration. He’d made a mess of this when all he’d been trying to do was get their lives back to normal. “Eric, listen, I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Sorry?” Eric repeated as if this was the most ridiculous comment he’d ever heard. “It’s a little late for that. Don’t worry, I won’t bother you anymore.”\u003c/p\u003e\n\u003cp\u003eWith that, he was gone and Jack wondered how long it would be before he heard from his son again.\u003c/p\u003e\n\u003cp\u003eCedar Cove was a wonderful place to be at Christmastime, Maryellen mused as she opened the gallery the first Friday in December. Evergreen boughs were strung along both sides of Harbor Street\u003c/p\u003e\n\u003cp\u003eand large festive candy canes hung from each of the streetlights. The gallery itself was decorated with tiny white lights and elegantly draped swags of spruce that scented the air. It was the smell of Christmas to Maryellen, the smell she associated with childhood holidays—and with her father. She had a sudden sharp memory of him, bringing in a fresh Christmas tree, stamping snow from his feet. Maryellen blinked back unexpected tears.\u003c/p\u003e\n\u003cp\u003eFor some reason, she found herself thinking of Jon. It’d been two weeks since Maryellen had last seen him, but, she suspected it wouldn’t be long before he arrived at the gallery with more of his photographs. Especially since she hadn’t brought them with her when she’d left his house. Maryellen had done her best to prepare emotionally for this next confrontation. She couldn’t allow what had happened to taint their business relationship. A thousand times since that night she’d wanted to kick herself for giving in to her baser instincts. She had plenty of excuses to justify her actions, but time and truth had knocked down every one of them. It wasn’t the wine or the moonlight, nor could she blame Jon for seducing her. She’d been fully involved.\u003c/p\u003e\n\u003cp\u003eAlmost as if Jon was aware that she was thinking of him, he showed up shortly after the gallery officially opened for business. Maryellen was busy with a customer when he came into the large open studio. She noticed that he had two framed photographs with him and guessed there were more in his vehicle.\u003c/p\u003e\n\u003cp\u003eMaryellen was still waiting on the customer as Jon made a second and then third trip, carrying photographs into the back room.\u003c/p\u003e\n\u003cp\u003e“I’m going to think it over,” Mrs. Whitfield said.\u003c/p\u003e\n\u003cp\u003eIt took Maryellen a moment to realize the doctor’s wife was referring to the watercolor she’d been considering as a Christmas gift for her husband.\u003c/p\u003e\n\u003cp\u003e“That’ll be fine,” Maryellen said. Then, with far too little warning, she was alone in the back room of the gallery with Jon.\u003c/p\u003e\n\u003cp\u003e“Hello,” she said stiffly, doing her best to remain cordial and polite. Before leaving his house, she’d told him their relationship, from that point forward, would be strictly business. She’d meant it.\u003c/p\u003e\n\u003cp\u003e“Hello.” His eyes probed her with such intensity she looked away.\u003c/p\u003e\n\u003cp\u003e“It’s a lovely morning, isn’t it?” she murmured.\u003c/p\u003e\n\u003cp\u003e“The sky’s a dull gray and it’s threatening to rain.”\u003c/p\u003e\n\u003cp\u003eShe smiled weakly. Obviously, small talk wasn’t working, but when had it ever with this man? “I see you’ve brought me a few pictures.”\u003c/p\u003e\n\u003cp\u003e“These are the ones you left at my house. If you hadn’t been in such a rush—”\u003c/p\u003e\n\u003cp\u003e“I appreciate your bringing them by,” she said, cutting him off before he could say something else to remind her of that evening.\u003c/p\u003e\n\u003cp\u003e“I came for another reason,” he said. He tucked his hands in the back pockets of his jeans. His pacing was making her nervous, and then she realized he was nervous, too. He stopped abruptly. “Are you free Sunday afternoon? There’s a dinner train I’ve always wanted to take and I was hoping you’d agree to come as my guest.”\u003c/p\u003e\n\u003cp\u003eThis was exactly what Maryellen had feared was going to happen. She held her breath so long that her lungs began to ache. “Thank you, but no.”\u003c/p\u003e\n\u003cp\u003e“No?” He sounded hurt and confused.\u003c/p\u003e\n\u003cp\u003e“I meant what I said earlier. It’s important that our relationship not become personal.”\u003c/p\u003e\n\u003cp\u003eHe frowned. “A little late for that,” he muttered.\u003c/p\u003e\n\u003cp\u003eShe ignored his remark. “I’m not interested in seeing you outside the gallery.” She couldn’t make it any plainer than that.\u003c/p\u003e\n\u003cp\u003e“You were the one who invited me to the Halloween party.”\u003c/p\u003e\n\u003cp\u003e“I know, and that was a mistake. The first of several. Listen, Jon, this is all rather embarrassing and awkward, but I’d consider it a favor if you forgot all about what happened.”\u003c/p\u003e\n\u003cp\u003eHis frown darkened. “That’s really what you want?”\u003c/p\u003e\n\u003cp\u003e“Please.”\u003c/p\u003e\n\u003cp\u003eIt looked as though he was going to argue with her, but then he shook his head. “I don’t have any other choice do I?”\u003c/p\u003e\n\u003cp\u003e“I know. Again, I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Fine, whatever.”\u003c/p\u003e\n\u003cp\u003eMaryellen wrote him a receipt for the pictures and held it out to him.\u003c/p\u003e\n\u003cp\u003eAn uncomfortable moment passed before he took the slip, turned and walked out of the gallery. As soon as he was gone, Maryellen closed her eyes and released her pent-up tension in the form of a deep sigh. She sagged onto the stool and tried to compose herself.\u003c/p\u003e\n\u003cp\u003e“Just a minute here,” Jon said, bursting back inside the room. “I don’t do a good job of pretending. Maybe you can forget what happened, but I can’t. Dammit, Maryellen, what we had was good. Surely you can see that?”\u003c/p\u003e\n\u003cp\u003e“No, I can’t. Please don’t make things any more difficult than they already are.” She should’ve known he wouldn’t be willing to drop this.\u003c/p\u003e\n\u003cp\u003e“I’m not the one making things difficult—you are. Let’s meet and talk this out. You decide when and where.”\u003c/p\u003e\n\u003cp\u003e“There’s nothing to discuss.”\u003c/p\u003e\n\u003cp\u003e“I don’t understand you,” Jon said, pacing again. The old boards creaked beneath his feet as he walked around a gorgeous blue porcelain vase she was getting ready to display. “If you want to pretend it didn’t happen, fine, be my guest, but I can’t. I wish to God I could because I haven’t been able to stop thinking about you. About us….”\u003c/p\u003e\n\u003cp\u003e“Rest assured the matter is out of my mind.”\u003c/p\u003e\n\u003cp\u003eHe snorted at that, recognizing her remark for the lie it was. “If you gave us a chance,” he argued, “you might discover we have something worthwhile here.”\u003c/p\u003e\n\u003cp\u003e“I doubt it,” she said as blandly as she could, wanting him to assume that this conversation was boring her. “I’m afraid you’ve misread the situation.\u003c/p\u003e\n\u003cp\u003eHe stared at her. “You do this sort of thing on a regular basis?”\u003c/p\u003e\n\u003cp\u003eShe laughed, hoping to sound amused when in reality she felt humiliated and ashamed. “Not in a while…Jon, I’m sorry if you read more into our night together than you should have, but—”\u003c/p\u003e\n\u003cp\u003e“I know, I know,” he said, and raised his hands to stop her. “I get the picture.”\u003c/p\u003e\n\u003cp\u003eShe sincerely hoped he did.\u003c/p\u003e\n\u003cp\u003e“Our relationship is strictly business.”\u003c/p\u003e\n\u003cp\u003eShe nodded, forcing herself to smile. It probably looked more like a grimace.\u003c/p\u003e\n\u003cp\u003eHe slowly surveyed the back room of the gallery. “That being the case, I won’t trouble you again.” \u003c/p\u003e","sourceLink":"https://allnovel.net/204-rosewood-lane-cedar-cove-2/page-21.html","bookId":1942,"creation":"Oct 5, 2019 10:02:25 AM","modification":"Oct 5, 2019 10:02:25 AM"}
