{"id":66765,"no":22,"title":"Page 22","content":"\u003cp\u003e“I appreciate that, Jon,” she said gratefully.\u003c/p\u003e\n\u003cp\u003e“Will you mail me a check once the photographs sell?” he asked.\u003c/p\u003e\n\u003cp\u003eMaryellen didn’t immediately make the connection. “Mail you a check? You mean you won’t be in again?”\u003c/p\u003e\n\u003cp\u003e“I don’t think it’s a good idea,” he said starkly.\u003c/p\u003e\n\u003cp\u003e“Ah…” He had her flustered now. “That’s exactly why I wanted to keep the personal out of this! There’s no need to end our professional relationship, is there? I mean, your pictures are wonderful, really wonderful, and—You will let someone else drop off your work, won’t you?”\u003c/p\u003e\n\u003cp\u003eThe question fell between them and hung there for several tense seconds. While she waited for him to consider her solution, Maryellen clenched her hands behind her back. This wasn’t what she wanted. She was proud to display his photographs. His work brought in customers and paid him well. It was a mutually beneficial relationship. A business relationship.\u003c/p\u003e\n\u003cp\u003eJon held her gaze, and in him she saw anger and regret.\u003c/p\u003e\n\u003cp\u003e“I think it’s time I made arrangements with another gallery,” he said with a shrug that looked anything but casual.\u003c/p\u003e\n\u003cp\u003eMaryellen bit back words that would ask him to reconsider, that would plead with him to stay. In a small voice she managed, “If this is what you prefer, then I can only wish you the best.”\u003c/p\u003e\n\u003cp\u003e“It isn’t what I’d prefer,” he told her flatly. “It’s what you want. Goodbye, Maryellen.”\u003c/p\u003e\n\u003cp\u003eA thickness formed in her throat as Jon turned and for the second time started to leave. “Oh, hell,” he muttered, turning back. He walked quickly toward her. “Don’t worry,” he said, taking her by the shoulders. “Like I said, I don’t plan to bother you again, but I would like one last memory before I go.”\u003c/p\u003e\n\u003cp\u003e“What?” she asked, her voice trembling, reacting to the shock of his touch.\u003c/p\u003e\n\u003cp\u003e“This,” he said hoarsely. Then he kissed her as if it was the only thing that had been on his mind from the moment she’d dashed out of his home. His kiss was hard and hot and unbearably slow. By the time he tore his mouth from hers, the blood was pounding in her ears.\u003c/p\u003e\n\u003cp\u003eMaryellen tried to prevent herself from giving him the satisfaction of a response, but when he released her, she staggered back two steps and gasped for air. Her hand went to her throat in an instinctive reaction.\u003c/p\u003e\n\u003cp\u003eMuttering something she couldn’t quite hear, Jon left and this time she knew it was for good. Her legs were unsteady and Maryellen felt close to tears. Making her way to the coffeepot, she poured herself a cup and was shocked by how badly her hand trembled as she filled the mug.\u003c/p\u003e\n\u003cp\u003eHe’d kissed her like that because he wanted her to remember him. To remember the night they’d spent together. His ploy had worked far too well. Maryellen shut her eyes, and their slow, seductive lovemaking played back in her mind. She recalled how he’d touched her, the feel of his strong, masculine hands as he’d explored her body, caressing her first with his fingers and then his tongue. She remembered in vivid detail the sensations she’d experienced as he made love to her. She’d wanted him with a passion that was difficult to renounce.\u003c/p\u003e\n\u003cp\u003eShe hadn’t set out to hurt Jon, but she could see that she had. In the process she was hurting herself, too. Jon didn’t understand why she’d rejected him. He didn’t know, and he never would. She’d sent him away for a reason that lay buried deep inside her.\u003c/p\u003e\n\u003cp\u003eShe’d walked this path once before and still bore the scars. Sometimes emotional wounds were harder to heal than physical ones. Sometimes they never healed at all.\u003c/p\u003e\n\u003cp\u003eStrings of Christmas tree lights were spread out on the living room floor when Zach woke on Saturday morning.\u003c/p\u003e\n\u003cp\u003e“Hi, Dad,” Eddie said when Zach looked in, yawning, on his way to the kitchen. His son sat amid the lights, straightening them and draping the long cords along the back of the sofa.\u003c/p\u003e\n\u003cp\u003e“What are you doing with those?” he asked. Rosie liked having the outside of the house decorated with Christmas lights, but he’d always found it a nuisance. He glanced at the clock and saw it was barely seven. Apparently Rosie was already up.\u003c/p\u003e\n\u003cp\u003e“Mom got them out,” Eddie explained, and stuck the plug into an outlet. Lights instantly blazed, nearly blinding Zach.\u003c/p\u003e\n\u003cp\u003eHe suspected this was his wife’s less-than-subtle hint that she wanted him to string up the lights this morning. Great, just great. She might’ve mentioned it earlier, but then they weren’t on the best of terms these days. Remaining civil during the Christmas holidays was going to be difficult if Thanksgiving was any indication. Somehow they’d made it through the day without a major blowup—probably because Rosie had spent most of the afternoon in the kitchen with her sister, no doubt complaining about him.\u003c/p\u003e\n\u003cp\u003e“Where’s your mother?” he asked irritably.\u003c/p\u003e\n\u003cp\u003e“She’s gone.”\u003c/p\u003e\n\u003cp\u003e“Gone?” Zach checked the time again. “Where is she now?”\u003c/p\u003e\n\u003cp\u003e“Christmas Bazaar at the high school.”\u003c/p\u003e\n\u003cp\u003e“What’s she doing there?”\u003c/p\u003e\n\u003cp\u003eEddie shrugged. “She didn’t tell me. Can we go to McDonald’s for breakfast? I’m getting tired of Pop-Tarts.”\u003c/p\u003e\n\u003cp\u003eZach stared at his son. This nine-year-old kid actually believed the alternative to Pop-Tarts was a meal outside the home. Rosie had gotten so lax in carrying out her responsibilities as a full-time wife and mother that their children didn’t even know that most families ate meals together around a table.\u003c/p\u003e\n\u003cp\u003e“Dad?”\u003c/p\u003e\n\u003cp\u003eEddie’s urgent cry cut into his thoughts. “Look!” He pointed to the television. “That’s what I want for Christmas.”\u003c/p\u003e\n\u003cp\u003eZach studied the screen and watched some remote-controlled monster truck propel itself over a huge dirt mound with a deafening roar.\u003c/p\u003e\n\u003cp\u003e“Mom said I could have it.”\u003c/p\u003e\n\u003cp\u003e“She did, did she?” Zach would talk to Rose about that. He wasn’t forking over a couple of hundred bucks for a stupid toy. Wandering into the kitchen, he discovered that the coffee wasn’t on but his wife had taken a moment to jot him a note, which she’d propped up next to the automatic drip pot.\u003c/p\u003e\n\u003cp\u003eWorking until four at the Bazaar. Put up the outside lights, okay? Allison’s at a slumber party and will need a ride home. If you have a chance, would you buy the Christmas tree? See you later.\u003c/p\u003e\n\u003cp\u003eRosie\u003c/p\u003e\n\u003cp\u003eHis wife had forgotten to mention she’d be working at the bazaar. That was predictable enough. But he’d hoped that for once they’d have a day together without obligations or demands. It used to be that buying the Christmas tree was a family event; they’d go to the lot together and everyone had a say. Decorating it was fun, with music playing in the background and popcorn popping and hot cider. These days, getting and trimming the tree was an afterthought, a nuisance that had to be fitted into the cracks in Rosie’s overbooked schedule.\u003c/p\u003e\n\u003cp\u003e“Can we go to McDonald’s for breakfast?” Eddie asked a second time.\u003c/p\u003e\n\u003cp\u003eZach didn’t answer him.\u003c/p\u003e\n\u003cp\u003e“Dad?”\u003c/p\u003e\n\u003cp\u003e“Sure,” he muttered, noting that there wasn’t any milk in the refrigerator. Not only had Rosie left him with a to-do list, but the house was devoid of groceries.\u003c/p\u003e\n\u003cp\u003eZach was furious all morning about his wife’s lack of attentiveness when it came to her family. He remembered what Janice Lamond had told him about the special Saturday she’d planned for her son. She was clearly the type of mother who made her child a priority.\u003c/p\u003e\n\u003cp\u003eAfter breakfast at McDonald’s, Zach collected Allison from her friend’s place, and then, with Eddie’s help, tackled putting up the Christmas lights.\u003c/p\u003e\n\u003cp\u003e“Are we going to buy our tree today?” Eddie asked while Zach stood on the ladder and attached the lights along the roofline of the house. He gazed down on his son, who was looking anxiously up at him.\u003c/p\u003e\n\u003cp\u003e“Ask your sister if she wants to come,” Zach called.\u003c/p\u003e\n\u003cp\u003e“Okay.” Eddie raced into the house. He wasn’t gone more than fifteen seconds. “Allison said she’ll come if she has to. We don’t need her, do we, Dad?”\u003c/p\u003e\n\u003cp\u003e“Tell her we need her.”\u003c/p\u003e\n\u003cp\u003eEddie stared up at him, his face a picture of disbelief and disgust. Zach couldn’t keep from laughing. With a twinge of regret he realized it was the first time he’d smiled all day. It wasn’t his children’s fault that Rosie chose to spend her day with strangers rather than her own family. Once she was home, Zach intended to have a very long talk with his wife.\u003c/p\u003e\n\u003cp\u003eBuying the Christmas tree proved to be one more annoying episode in a day that had started off badly and quickly gotten worse. By the time they returned to the house, the kids were bickering and hungry. When Zach pulled into the garage, he saw that Rosie’s car was there.\u003c/p\u003e\n\u003cp\u003e“We got the tree, Mom,” Eddie announced as he rushed into the kitchen.\u003c/p\u003e\n\u003cp\u003e“Hi,” Zach said, determined to put on a happy front until he had a private moment with his wife. “How was your day?”\u003c/p\u003e\n\u003cp\u003eRosie sat on the sofa with her feet up. “I’m exhausted. How did everything go at home?”\u003c/p\u003e\n\u003cp\u003e“Great,” Eddie said. “Dad and I got the Christmas lights up. We went out to breakfast at McDonald’s and then we stopped at the store and bought milk.”\u003c/p\u003e\n\u003cp\u003e“You got groceries?” Rosie asked, a look of relief in her eyes.\u003c/p\u003e\n\u003cp\u003e“Just milk and bread.” Again it was Eddie who answered. “Dad thought we should make tomato soup and toasted cheese sandwiches for lunch, and we needed stuff for that.”\u003c/p\u003e\n\u003cp\u003e“It sounds like you guys had a nice day.”\u003c/p\u003e\n\u003cp\u003e“Are we going to decorate the tree tonight?” Allison asked, her expression bored.\u003c/p\u003e\n\u003cp\u003e“Sure,” Zach said.\u003c/p\u003e\n\u003cp\u003e“Not tonight, sweetheart,” Rosie answered simultaneously.\u003c/p\u003e\n\u003cp\u003eAllison glanced from Zach to Rosie.\u003c/p\u003e\n\u003cp\u003e“I’ve just spent nine hours on my feet,” Rosie said. “The last thing I want to do now is decorate a tree. We can do it tomorrow after church.”\u003c/p\u003e\n\u003cp\u003e“I can’t,” Allison complained. “The French Club is having their bake sale in the mall, remember?”\u003c/p\u003e\n\u003cp\u003e“Oh, right.” Rosie rubbed a hand over her eyes. “I’m not supposed to help with that, am I?”\u003c/p\u003e\n\u003cp\u003e“Yes, Mom…” Their daughter sounded both hurt and provoked.\u003c/p\u003e\n\u003cp\u003e“Okay, okay.”\u003c/p\u003e\n\u003cp\u003e“What about dinner?” Zach asked.\u003c/p\u003e\n\u003cp\u003eThey’d already had pizza once that week and KFC another night. Zach realized this was an especially busy time of year, but it seemed important that they have at least one meal a week as a family.\u003c/p\u003e\n\u003cp\u003e“Who wants what?” Rosie asked.\u003c/p\u003e\n\u003cp\u003e“Pizza,” Eddie shouted.\u003c/p\u003e\n\u003cp\u003e“I’m not hungry,” Allison insisted.\u003c/p\u003e\n\u003cp\u003eZach frowned.\u003c/p\u003e\n\u003cp\u003e“I suppose you want meat loaf and mashed potatoes,” Rosie muttered just loudly enough for Zach to hear.\u003c/p\u003e\n\u003cp\u003e“That’d be nice,” he said, and then added, “for once.”\u003c/p\u003e\n\u003cp\u003e“Are we going to do the tree or not?” Allison asked, slouching on the sofa next to her mother.\u003c/p\u003e\n\u003cp\u003e“Apparently not,” Zach said.\u003c/p\u003e\n\u003cp\u003e“If that’s what your father wants.” Their voices mingled as, again, they spoke at the same time.\u003c/p\u003e\n\u003cp\u003eAllison stood and headed toward the hallway. “You two work it out and when you’ve decided what you want to do, let me know. I’ll be in my room.” \u003c/p\u003e","sourceLink":"https://allnovel.net/204-rosewood-lane-cedar-cove-2/page-22.html","bookId":1942,"creation":"Oct 5, 2019 10:02:25 AM","modification":"Oct 5, 2019 10:02:25 AM"}
