{"id":66773,"no":30,"title":"Page 30","content":"\u003cp\u003eJane’s experience wasn’t much better. She’d been looking for a man with money sense. Jeannie had once dated a very nice but very boring financial advisor whom she’d introduced to Jane at the Halloween party. Jane and Geoff had instantly hit it off. Jane insisted Geoff wasn’t nearly as boring as Jeannie had said. But then he’d given her a hot stock tip that was close to being insider information. Sure enough, Jane had invested her entire savings and almost immediately, the stock fell eight percent.\u003c/p\u003e\n\u003cp\u003e“What I learned from all this,” Rachel said, as she finished the polish job on Maryellen’s nails, “is that if one of us dumps a man, it’s for a damn good reason.”\u003c/p\u003e\n\u003cp\u003e“You can say that again,” Jane echoed.\u003c/p\u003e\n\u003cp\u003e“What about the guy you met?” Jeannie asked Maryellen.\u003c/p\u003e\n\u003cp\u003eShe blinked, pretending not to understand the question. “I didn’t meet anyone.”\u003c/p\u003e\n\u003cp\u003e“That guy you brought stuck to you like glue,” Terri called from the other side of the shop, where she was working on an older woman. “I had my eye on him big-time, but he wasn’t having anything to do with me.”\u003c/p\u003e\n\u003cp\u003e“I’m sure you’re imagining it.” The last person she wanted to discuss with her friends was Jon Bowman.\u003c/p\u003e\n\u003cp\u003e“Not likely,” Terri muttered, standing in front of the display of fingernail polish. She picked up a bottle and read the name on the bottom. “How about ‘More Than a Waitress’?” she asked her customer.\u003c/p\u003e\n\u003cp\u003eThankfully, attention was turned away from Maryellen.\u003c/p\u003e\n\u003cp\u003e“Are you going out with him?” Rachel asked, ambushing her with the question. “You might not have noticed how hot that guy was for you, but the rest of us sure did.”\u003c/p\u003e\n\u003cp\u003e“I haven’t seen him since before Christmas, but if I do, would you like me to give him your number?” This was the only way she could think of to convince Rachel that she wasn’t interested in dating Jon.\u003c/p\u003e\n\u003cp\u003e“No way. I’ve been with guys who’re hung up on someone else. It’s a real downer, if you know what I mean.” Coloring the last fingernail, Rachel set the timer and lowered the light over Maryellen’s perfect pink nails.\u003c/p\u003e\n\u003cp\u003eOnce they were dry, Maryellen hurried out of the shop. She was meeting her mother for dinner at the PancakePalace. Her entire schedule was off, due to a meeting with the gallery owners, who’d flown in unexpectedly. Luckily, Rachel could fit her in for a late-afternoon appointment.\u003c/p\u003e\n\u003cp\u003eFearing questions, Maryellen had been avoiding her family. Kelly, busy as she was with Tyler, had readily accepted her excuses, but Grace was having none of it. Given no other option, Maryellen agreed to meet her at the Palace, where the food was plentiful and cheap.\u003c/p\u003e\n\u003cp\u003eGrace already had a booth by the time Maryellen arrived. She slipped into the seat across from her and reached for the menu.\u003c/p\u003e\n\u003cp\u003e“How are you feeling?” her mother asked immediately.\u003c/p\u003e\n\u003cp\u003e“Wonderful.” That was a lie, but Maryellen didn’t want Grace to overreact to her situation. At this point, only her mother knew about the pregnancy; she hadn’t been ready to divulge the news to Kelly or any of her friends, especially while she felt ill. Every day for the last month, Maryellen had awakened with a queasy stomach. Invariably, a short time later, she was hanging her head over the toilet. She didn’t recall Kelly having these symptoms when she was pregnant. In any event, if her sister had suffered from morning sickness, Paul was there to love and encourage her and then hand her a washcloth. Maryellen had rarely felt more alone.\u003c/p\u003e\n\u003cp\u003eGrace set aside the menu. “So you’re in perfect health? Ha! I don’t believe that for a moment.”\u003c/p\u003e\n\u003cp\u003e“Mother,” Maryellen said, doing her best to remain cordial. “Don’t. Please don’t.”\u003c/p\u003e\n\u003cp\u003e“Don’t what?” Grace demanded and then seemed to have a change of heart. “Let’s start again, shall we?”\u003c/p\u003e\n\u003cp\u003e“Please. Tell me what’s going on with you. Please, Mom, just this once don’t drill me with questions I don’t want to answer.” She bit her lip and prayed her mother was listening.\u003c/p\u003e\n\u003cp\u003eGrace stared at her, obviously unhappy about her daughter’s request. “All right,” she said slowly. “There’s plenty of other news for us to discuss.”\u003c/p\u003e\n\u003cp\u003e“Like what?” Maryellen asked gratefully.\u003c/p\u003e\n\u003cp\u003e“Well, for one thing,” Grace said, cradling her water glass in both hands. “I went out to dinner with Cliff Harding last Saturday night.”\u003c/p\u003e\n\u003cp\u003eNow, this was news Maryellen had been waiting to hear. “Cliff called you?” In her opinion, he’d been patient for far too long.\u003c/p\u003e\n\u003cp\u003eHer mother blushed and looked down at the menu. “Actually, I phoned him.” She said this as if she’d committed some terrible breach of etiquette.\u003c/p\u003e\n\u003cp\u003e“Mom, that’s great!”\u003c/p\u003e\n\u003cp\u003e“I’ve never called a man in my life.” Even now Grace sounded unsure that she’d done the right thing.\u003c/p\u003e\n\u003cp\u003e“What convinced you?”\u003c/p\u003e\n\u003cp\u003e“Olivia,” her mother said without hesitation. “And two glasses of wine. She persuaded me Cliff was going to lose interest—and oh, I’ve been so lonely and miserable.”\u003c/p\u003e\n\u003cp\u003eMaryellen raised one eyebrow. “Wine can certainly loosen one’s inhibitions.” She was in a position to know.\u003c/p\u003e\n\u003cp\u003e“Olivia and I were celebrating,” her mother went on to explain. “Seth and Justine are expecting. And did you know they bought a restaurant? It’s all so exciting for them.”\u003c/p\u003e\n\u003cp\u003e“Yes, I’d heard about The Captain’s Galley. I’m sure they’ll do well and I—”\u003c/p\u003e\n\u003cp\u003eA flustered teenage waitress came for their order.\u003c/p\u003e\n\u003cp\u003eMaryellen waited until the girl was out of earshot. “You didn’t mention anything about me, did you?”\u003c/p\u003e\n\u003cp\u003e“No,” Grace murmured. “But I was tempted.”\u003c/p\u003e\n\u003cp\u003e“No one can know, Mom.”\u003c/p\u003e\n\u003cp\u003e“But why—”\u003c/p\u003e\n\u003cp\u003e“I have my reasons.”\u003c/p\u003e\n\u003cp\u003e“I want to talk to you about this, Maryellen, but every time I try, you clam up and get defensive. I’m your mother. Do you think I don’t realize you’re avoiding me? I want to know why.”\u003c/p\u003e\n\u003cp\u003eThat should be obvious. “I wish I’d never told you…I knew I’d regret it and I do.”\u003c/p\u003e\n\u003cp\u003e“It’s more than the pregnancy,” Grace whispered. “It’s what you said at lunch that day.”\u003c/p\u003e\n\u003cp\u003e“Mom, don’t.” The lump in her throat was growing thicker. “Please don’t. I can’t discuss that.”\u003c/p\u003e\n\u003cp\u003e“You said you’d been pregnant before. Fifteen years ago, you said. Was it before you were married or—”\u003c/p\u003e\n\u003cp\u003eMaryellen shook her head, refusing to discuss the most painful time in her life. “So what about your dinner date,” she said instead.\u003c/p\u003e\n\u003cp\u003eHer mother gazed at her, eyes dimmed with sadness. “Will you tell me one day?”\u003c/p\u003e\n\u003cp\u003eNot if Maryellen could find a way to avoid it. Her entire life had changed because of that pregnancy. The woman she was today, and would always be, was a result of having conceived Clint Jorstad’s baby. She might never have married him otherwise, never have taken a path she now knew had been so wrong. But as much as she wanted to lay the blame at her ex-husband’s feet, Maryellen was well aware of her own failings. It was easy to create excuses, to rationalize what she’d done. She’d been young and vulnerable and so incredibly naive.\u003c/p\u003e\n\u003cp\u003e“Will you tell me one day?” her mother repeated.\u003c/p\u003e\n\u003cp\u003e“Perhaps.” This pregnancy was a second chance—an opportunity she’d never expected. This time she’d follow the dictates of her heart.\u003c/p\u003e\n\u003cp\u003e“Have you told Kelly?” Her mother insisted on asking questions Maryellen didn’t want to answer.\u003c/p\u003e\n\u003cp\u003e“Not yet, but I will.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“Mom…I’ll tell Kelly when I’m ready to let other people know.” Maryellen loved her sister, but Kelly simply couldn’t keep a secret. The moment she learned the news, it would be all over town.\u003c/p\u003e\n\u003cp\u003e“Tell me about your dinner with Cliff,” Maryellen said again, eager to hear the details of her mother’s first official date after her divorce.\u003c/p\u003e\n\u003cp\u003e“We ate at a wonderful Italian place in Tacoma.”\u003c/p\u003e\n\u003cp\u003e“Away from prying eyes.” Maryellen nodded. “That was thoughtful. Did he kiss you?”\u003c/p\u003e\n\u003cp\u003eThe warm color that invaded her mother’s cheeks was answer enough. “Yes.” She picked up her fork and examined it carefully.\u003c/p\u003e\n\u003cp\u003e“Mom, you’re blushing.”\u003c/p\u003e\n\u003cp\u003e“The only man who’s kissed me in the last thirty-seven years was your father. Until Saturday, of course.”\u003c/p\u003e\n\u003cp\u003e“How was it?” Maryellen knew it was wrong to enjoy seeing her mother this flustered. She resisted the urge to laugh outright, but she was genuinely delighted by the fact that Cliff had planned such a romantic evening, and by her mother’s innocent reaction to it.\u003c/p\u003e\n\u003cp\u003e“The kiss was nice. Very nice.”\u003c/p\u003e\n\u003cp\u003e“Are you seeing him again?” Maryellen asked next.\u003c/p\u003e\n\u003cp\u003e“You’re as bad as Olivia.”\u003c/p\u003e\n\u003cp\u003e“Well, are you?” she pressed.\u003c/p\u003e\n\u003cp\u003e“Probably, although he hasn’t asked.”\u003c/p\u003e\n\u003cp\u003eThe waitress arrived with two Cobb salads. “Can I get you anything else?” she asked and put down their bill before they could even respond.\u003c/p\u003e\n\u003cp\u003eMaryellen watched the girl leave. “I guess not.”\u003c/p\u003e\n\u003cp\u003e“I’m afraid you and Olivia are making more of this evening with Cliff than you should.” She plucked a napkin from the dispenser. “It was only one dinner and we haven’t arranged another.”\u003c/p\u003e\n\u003cp\u003e“But you’d go out again if he asked.”\u003c/p\u003e\n\u003cp\u003e“Yes—Oh, I don’t know—dating frightens me. Everyone seems to think it’s the right thing to do, but if that’s true, then why do I feel so damn guilty?”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t. You’re divorced.”\u003c/p\u003e\n\u003cp\u003eGrace sighed. “Both you and Olivia have encouraged me to see Cliff, but I’m not sure I should….”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Oh, honey, don’t you know?” Her mother’s face was drawn with anxiety. “I need to know what happened to your father. There’s this knot in my stomach that’s been there since he disappeared.” She began to shred the paper napkin. “After I went to dinner with Cliff, I felt good. Kind of…liberated. Free. But it didn’t last. I could hardly sleep that night.”\u003c/p\u003e\n\u003cp\u003e“Mom, you’re divorced. You are free.”\u003c/p\u003e\n\u003cp\u003e“Perhaps legally, but I still feel married. Despite everything, I feel I belong with your father. I don’t know if that’ll change until I find out where he is and what drove him away.”\u003c/p\u003e\n\u003cp\u003e“Mom.” Maryellen’s hand covered her mother’s. “We might never know.”\u003c/p\u003e\n\u003cp\u003e“I realize that, but it doesn’t change how I feel.”\u003c/p\u003e\n\u003cp\u003eCharlotte sat in Dr. Fred Stevens’s waiting room, knitting furiously as the minutes ticked slowly by. She’d been seeing Dr. Fred for the past twenty years and she had complete faith in him. He’d been Clyde’s physician, and her husband, too, had trusted him implicitly.\u003c/p\u003e\n\u003cp\u003e“The doctor can see you now, Charlotte,” Pamela Johnson said, standing in the doorway that led to the examination rooms. \u003c/p\u003e","sourceLink":"https://allnovel.net/204-rosewood-lane-cedar-cove-2/page-30.html","bookId":1942,"creation":"Oct 5, 2019 10:02:25 AM","modification":"Oct 5, 2019 10:02:25 AM"}
