{"id":66779,"no":36,"title":"Page 36","content":"\u003cp\u003eMost Wednesdays, Grace enjoyed this class. She’d reluctantly agreed to it when Olivia had asked her a year earlier; she wasn’t athletically inclined and had never enjoyed exercising. What made it tolerable was knowing she could count on seeing her best friend at least once a week. But because the class was demanding, the only opportunities they had to talk were before and after the workout. Sometimes they found themselves standing in the parking lot, chatting for an hour or more.\u003c/p\u003e\n\u003cp\u003eThat night, by the time class was over, Grace had worked up a sweat. Thank goodness for the cool-down exercises, she thought; her heart was pounding furiously. Olivia’s face was red and her hair drenched. She’d driven herself harder than ever, working out her frustrations over Jack, Grace suspected.\u003c/p\u003e\n\u003cp\u003e“I needed that,” Olivia said as they made their way back to the ladies’ locker room. “I’m still so mad at Jack I could spit.”\u003c/p\u003e\n\u003cp\u003e“It isn’t just Jack,” Grace told her. “It’s everything. You’re worried about Justine and the baby. Your mother just had major surgery, and there’s all the emotional turmoil around that. Now Jack’s acting like a hurt little boy because he found you and Will and Stan having dinner one night and he wasn’t invited.”\u003c/p\u003e\n\u003cp\u003eOlivia wiped her face with a towel and reached for her shampoo.\u003c/p\u003e\n\u003cp\u003e“You’re being pulled from every side,” Grace went on. “Your mother, your daughter and Jack.”\u003c/p\u003e\n\u003cp\u003e“You’re right, I am,” Olivia admitted. She looped the towel around her neck. “That’s exactly the way I feel.” She sat down on the bench and sighed. “I really am worried about Justine, but she won’t listen to me. She thinks I’m an old fuddy-duddy because I’m concerned that she’s doing too much while she’s in the early stages of her pregnancy.”\u003c/p\u003e\n\u003cp\u003e“And then there’s Jack.”\u003c/p\u003e\n\u003cp\u003e“Ah yes, Jack.” Olivia’s voice softened somewhat. “I feel bad about our fight. I lost my temper.”\u003c/p\u003e\n\u003cp\u003e“Call him,” Grace said. “My guess is he’ll be thrilled to hear from you.”\u003c/p\u003e\n\u003cp\u003eOlivia considered the suggestion a moment, then shook her head. “Not yet. Give me time to calm down and I might reconsider.”\u003c/p\u003e\n\u003cp\u003e“Want to go out for dinner?” She wouldn’t have offered, since her budget was tight these days, but she knew Olivia still needed to talk.\u003c/p\u003e\n\u003cp\u003e“Come to my place. I’ve got plenty of leftovers. Mom’s friends made her enough meals to last a month. There’s a huge dish of broccoli lasagna.”\u003c/p\u003e\n\u003cp\u003e“You’re on.” Grace so seldom cooked meals anymore that anything homemade sounded heavenly.\u003c/p\u003e\n\u003cp\u003eTwo hours later, lulled by a tasty meal, a glass of red wine and the sweet alto voice of Anne Murray, they sat in Olivia’s living room. Charlotte was sound asleep in the back bedroom.\u003c/p\u003e\n\u003cp\u003eRelaxed, Grace accepted a second glass of wine and closed her eyes. “What would you think if I called Jack?” she asked. “We used to do that in high school, remember? If I had an argument with my boyfriend, you’d call and smooth the way for me.”\u003c/p\u003e\n\u003cp\u003eOlivia giggled softly, sitting beside Grace on the sofa. “Of course I remember, but it sounds a bit juvenile, don’t you think?”\u003c/p\u003e\n\u003cp\u003e“And your point is?” Grace asked.\u003c/p\u003e\n\u003cp\u003eOlivia laughed. “Go ahead. See what he says.”\u003c/p\u003e\n\u003cp\u003eGrace didn’t need to be told twice. This was silly, but fun, too. Olivia gave her the portable phone and Grace found Jack’s number on speed dial, then waited for the phone to ring.\u003c/p\u003e\n\u003cp\u003eJust before Jack answered, she changed her mind and passed the phone to Olivia. “I don’t know what to say.” She was afraid Olivia was going to cut the connection. Instead her friend held the phone to her ear.\u003c/p\u003e\n\u003cp\u003e“It’s me,” she said. “I wanted to apologize for blowing up at you this afternoon.”\u003c/p\u003e\n\u003cp\u003eOlivia didn’t say anything for several moments, then she slowly smiled. “You’re forgiven, too.” She laughed at whatever he said. “You can thank Grace. She was the one who insisted I had to patch this up. As usual, my friend was right.”\u003c/p\u003e\n\u003cp\u003eSoon after, Olivia disconnected and looked over at Grace. “Thanks,” she whispered.\u003c/p\u003e\n\u003cp\u003eGrace felt good. “You’re welcome.”\u003c/p\u003e\n\u003cp\u003e“Do you want me to call Cliff for you now?”\u003c/p\u003e\n\u003cp\u003eShe shook her head, but Olivia ignored her. “His number?”\u003c/p\u003e\n\u003cp\u003e“Olivia!”\u003c/p\u003e\n\u003cp\u003e“Don’t make me look it up,” she said. “And don’t tell me you don’t know what it is, either.”\u003c/p\u003e\n\u003cp\u003e“Oh, all right.”\u003c/p\u003e\n\u003cp\u003eTo her surprise Olivia didn’t immediately hand her the receiver. She waited until Cliff had answered, then said. “Hi, Cliff, this is Olivia Lockhart. I wanted to thank you for the flowers you sent Mom. They’re absolutely lovely.” After a brief discussion of Charlotte’s prognosis, she said, “I have someone here who wants to say hello.” She handed Grace the receiver.\u003c/p\u003e\n\u003cp\u003eGrace drew in a deep breath and tried to relax as she brought the phone to her ear. “Hello, Cliff.”\u003c/p\u003e\n\u003cp\u003e“Grace.” He sounded both surprised and pleased. “I thought Olivia was staying with her mother.”\u003c/p\u003e\n\u003cp\u003e“Not exactly—Charlotte’s staying here. But once she’s back in her own house, her friends want to take turns spending the night with her. I’m here because Olivia and I went to our aerobics class and then had dinner and a couple of glasses of wine.”\u003c/p\u003e\n\u003cp\u003e“Ah, that explains it. You’re feeling brave enough to talk to me.”\u003c/p\u003e\n\u003cp\u003e“Something like that.”\u003c/p\u003e\n\u003cp\u003e“We never did finish our conversation that Saturday, did we?”\u003c/p\u003e\n\u003cp\u003e“No,” Grace admitted.\u003c/p\u003e\n\u003cp\u003e“Are you willing to try again?”\u003c/p\u003e\n\u003cp\u003eIt was as if she really had reverted to being a teenager. “I’d like that very much,” she said shyly.\u003c/p\u003e\n\u003cp\u003e“So would I,” Cliff said, and then repeated. “So would I.”\u003c/p\u003e\n\u003cp\u003eSharon Castor, Rosie Cox’s attorney in the matter of her divorce from Zach, had explained that the next step was a settlement hearing. Both parties would meet with their attorneys at a mutually agreed-upon location to go over the final details of the case, including child custody.\u003c/p\u003e\n\u003cp\u003eThey were scheduled to meet at the library in the courthouse. The main problem had to do with the children. If they couldn’t agree on custody and division of property, they’d go before the judge in an informal hearing. Sharon had said the judge’s decision wasn’t binding, but it was most likely what would be decided if the suit went to trial. Meeting with the judge informally would save everyone time and expense, which suited Rosie. She wanted this over as quickly as possible. Now that the process had been set in motion, she was eager to get out of this disastrous marriage.\u003c/p\u003e\n\u003cp\u003eFor the first time since Zach had become a partner in the accounting firm, lack of money was an issue. While they were married, they’d lived on a budget and Rosie had been good about keeping their expenses within the confines of that—admittedly generous—monthly allotment. All of a sudden, she had less than half the money she’d had before, and it was difficult to meet expenses. The financial difficulties she’d experienced since Zach moved out of the house were bad enough. But he’d taken half the furniture and half the linens and half of just about everything else. A dozen times a day she’d reach for something to find it wasn’t there. It was a harsh reminder of her husband’s absence from the family.\u003c/p\u003e\n\u003cp\u003eSharon Castor and Rosie were seated in the library when Zach and his attorney arrived. Rosie had found Sharon’s number in the phone book. She’d chosen her without references or anyone’s recommendation because she was too embarrassed to admit to her friends that she needed an attorney. She wanted a female lawyer and she liked the name Castor. Rosie wasn’t a spiteful woman, but she wanted Zach to feel like he’d swallowed a dose of castor oil by the time she finished with him. He deserved no less after what he’d done to their family.\u003c/p\u003e\n\u003cp\u003eRosie and Sharon waited in silence while Zach and Otto sat across from them.\u003c/p\u003e\n\u003cp\u003eRosie set her clenched hands on the table and so did Zach. She avoided eye contact with either Zach or his attorney. A sick feeling invaded the pit of her stomach. It’d started earlier that morning and grown progressively worse all day.\u003c/p\u003e\n\u003cp\u003e“Did you fill out your portion of the parenting plan?” Otto Benson asked Sharon.\u003c/p\u003e\n\u003cp\u003e“We did.” Sharon shoved the paperwork across the table for Zach and his lawyer to review.\u003c/p\u003e\n\u003cp\u003eWhat amazed Rosie was how civilized they were all acting. Her life was being ripped apart and for pride’s sake she had to sit like a fifty-pound sack of flour and pretend everything was fine.\u003c/p\u003e\n\u003cp\u003eZach and Otto put their heads close together and started whispering.\u003c/p\u003e\n\u003cp\u003e“This isn’t going to work,” Otto said without emotion. “My client loves his children and he doesn’t feel they’ll receive adequate attention if they remain in their mother’s sole custody.”\u003c/p\u003e\n\u003cp\u003e“You can’t possibly believe that!” Rosie exploded. Zach was as much as saying she was an unfit mother.\u003c/p\u003e\n\u003cp\u003eSharon Castor placed her hand on Rosie’s forearm. “Do you mean your client believes the children would be better off living with him?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Otto answered for Zach.\u003c/p\u003e\n\u003cp\u003e“In a two-bedroom apartment?” Rosie burst out. This was a joke; it had to be. She was astonished that Zach would even suggest such a thing. Then it dawned on her. Zach wanted the house. He wanted to kick her out of her own home. Move her out and within short order he’d probably install Janice Lamond. The thought infuriated her.\u003c/p\u003e\n\u003cp\u003e“I could afford a larger apartment if I wasn’t forced to pay all your expenses. It would help if you got a job.” Zach’s voice was close to a snarl.\u003c/p\u003e\n\u003cp\u003eRosie glared at him, hardly able to believe that she’d once loved this man. Loved him enough to abandon her career and bear his children. Now just looking at him made her sick.\u003c/p\u003e\n\u003cp\u003e“That brings up a point I wanted to address,” Sharon Castor said, as emotionless as Benson had been. Rosie marveled at the other woman’s calm, but presumably she was accustomed to this kind of situation. “Rosie’s going to need classes for retraining and updating her teaching skills.”\u003c/p\u003e\n\u003cp\u003e“The hell she does,” Zach said and pounded the table so hard the papers nearly slid onto the floor. “Rosie has a college degree. What more does she need?”\u003c/p\u003e\n\u003cp\u003eRosie started at the violence she saw in him. It shocked her, but she supposed it shouldn’t. She’d never believed her husband of sixteen years would cheat on her, either. While she didn’t have proof Janice Lamond was sleeping with Zach, she certainly had her suspicions.\u003c/p\u003e\n\u003cp\u003e“It’s true my client has a degree in education, but it’s been a number of years since she was in the classroom. It would be impossible for her to get a position with the school district without some refresher courses.”\u003c/p\u003e\n\u003cp\u003e“Which you want me to pay for,” Zach snapped. His attorney whispered something to him. Zach seemed to want to argue, but after a moment, he gave a resigned nod.\u003c/p\u003e\n\u003cp\u003eRosie could tell he wasn’t pleased. Petty though it was, she was glad. She’d never thought herself capable of this kind of emotion, but she hurt so badly that she wanted him to feel just a small part of the agony she’d suffered in the last six weeks. \u003c/p\u003e","sourceLink":"https://allnovel.net/204-rosewood-lane-cedar-cove-2/page-36.html","bookId":1942,"creation":"Oct 5, 2019 10:02:25 AM","modification":"Oct 5, 2019 10:02:25 AM"}
