{"id":66782,"no":39,"title":"Page 39","content":"\u003cp\u003eFeeling as though it was now or never, she threw open her arms. “Kiss me, you fool,” she intoned dramatically. All at once, her life had become the lyrics to a Broadway musical—and she loved it.\u003c/p\u003e\n\u003cp\u003eJack reached for her and their lips met in a wild and thoroughly passionate kiss. Her legs were shaky and her head was swimming. It’d been a long time since they’d kissed with such abandon, almost as if they both understood that true intimacy was irrevocable. Making love meant everything between them would change….\u003c/p\u003e\n\u003cp\u003eJack shuddered as he wrapped her completely in his arms. The music had ended, so when his cell phone rang, it startled them both. He ignored it. Instead, he kissed her again, with the same frantic need as earlier. “Come to my house,” he whispered, his voice husky. “I changed the sheets this morning.”\u003c/p\u003e\n\u003cp\u003e“Jack!” This was supposed to be seductive?\u003c/p\u003e\n\u003cp\u003e“I’ve dreamed about us there, overlooking the Cove, making love.”\u003c/p\u003e\n\u003cp\u003eThe phone rang five more times before it finally stopped.\u003c/p\u003e\n\u003cp\u003eThe silence seemed louder than the ringing phone. Olivia took his face between her hands and gazed deeply into his eyes. “Does this have anything to do with Stan?” she asked, needing to know.\u003c/p\u003e\n\u003cp\u003eThey’d argued over Stan, and in her opinion, Jack was being utterly unreasonable. He seemed to think Stan wanted her back—which would be news to Marge, who’d been married to him for more than fifteen years.\u003c/p\u003e\n\u003cp\u003e“No,” he said, kissing her. “It has to do with you and me. Leave Stan out of it.”\u003c/p\u003e\n\u003cp\u003e“Why now?”\u003c/p\u003e\n\u003cp\u003e“Why not now?” he countered.\u003c/p\u003e\n\u003cp\u003eShe wasn’t sure how to reply. As she tried to think clearly, to emerge from the fog of kisses and music, the doorbell rang. Saved by the bell—again.\u003c/p\u003e\n\u003cp\u003eWhen she hurried to open the door she found Jack’s son, looking flustered, still leaning on the doorbell. “Dad?” he shouted urgently.\u003c/p\u003e\n\u003cp\u003e“Eric, what is it?” Jack asked, appearing behind Olivia.\u003c/p\u003e\n\u003cp\u003e“Shelly. She’s in labor. She doesn’t have anyone.”\u003c/p\u003e\n\u003cp\u003e“She phoned you?”\u003c/p\u003e\n\u003cp\u003e“No, a friend did. Her water broke last night and she’s about to deliver. Could be anytime now. Her friend couldn’t stay.” He paused. “I should be there, don’t you think? She might need me.”\u003c/p\u003e\n\u003cp\u003e“True,” Jack agreed.\u003c/p\u003e\n\u003cp\u003e“But she doesn’t want me around, at least that’s what she said the last time we spoke.” He splayed his fingers through his hair. “I should be there. I feel it.”\u003c/p\u003e\n\u003cp\u003e“Then go.”\u003c/p\u003e\n\u003cp\u003e“I’m packed up, ready to leave for Reno.”\u003c/p\u003e\n\u003cp\u003e“Yes, I know.”\u003c/p\u003e\n\u003cp\u003eEric seemed to be asking something and Olivia knew what it was, even if Jack didn’t. “Do you want your father to go with you?”\u003c/p\u003e\n\u003cp\u003e“Would you, Dad?”\u003c/p\u003e\n\u003cp\u003eOlivia loved Jack even more for the way he responded. He hugged his son, cast Olivia an apologetic look and said, “Let’s go.” He turned back to her and stretched out his hand. “Want to tag along?”\u003c/p\u003e\n\u003cp\u003eShe considered it for a moment, then decided against it. “You two go on. Call me when the babies are born.” Pleased that Jack had placed his son’s needs above his own, she took his hand in hers and gave him an encouraging squeeze.\u003c/p\u003e\n\u003cp\u003eThree hours later, her phone rang and it was Jack, calling from the hospital. “Identical twin boys,” he said triumphantly. “Eric stayed with Shelly, and she was happy he came to be with her. Both boys are strong and healthy.”\u003c/p\u003e\n\u003cp\u003e“Congratulations, Grandpa.”\u003c/p\u003e\n\u003cp\u003e“I am their grandfather,” he said. “Those babies are the spitting image of Eric. No one’s going to doubt who their father is again. Especially my son.”\u003c/p\u003e\n\u003cp\u003e“What’s he going to do about his job?” Eric had accepted the transfer and was expected to start at his new job in Reno in a week or so.\u003c/p\u003e\n\u003cp\u003e“I don’t know, that’s up to him. Fortunately he’s got a few days before he has to decide.”\u003c/p\u003e\n\u003cp\u003eSeth and Justine had decided to call their restaurant The Lighthouse. Justine liked the name because it reminded her of the home where she’d grown up, on Lighthouse Road\u003c/p\u003e\n\u003cp\u003e. The lighthouse at the far end of the cove was one of the community’s most distinctive landmarks. Seth seconded the name because it underlined the fact that this was a seafood restaurant.\u003c/p\u003e\n\u003cp\u003eThe idea of opening a restaurant had been in the back of his mind for years, but he loved fishing and the money was too good to turn down. Living aboard the sailboat, his expenses had been minimal and he’d invested wisely. After he’d married Justine, he realized that the long separations fishing demanded no longer appealed to him. Now, with a baby on the way, the time was right to start his new business.\u003c/p\u003e\n\u003cp\u003eHis father agreed and offered to invest in the restaurant as a silent partner. It was a bold move on both their parts. Seth had done his research and was well aware that almost half of new restaurants failed in their first year. He was determined to minimize the risks, to do everything right. Menu, staff, prices, décor, promotion—he and Justine had thought everything through. Seth was a decent cook, but he didn’t have the expertise and knowledge that running a full kitchen would require. He advertised for kitchen staff and asked other restaurant owners for advice. He soon learned that Jon Bowman had an excellent reputation. When Jon applied for the position, of chef, Seth studied his resumé, then called and asked for an interview.\u003c/p\u003e\n\u003cp\u003eOn the second Friday of March, Jon Bowman arrived, walking into the ongoing construction mess.\u003c/p\u003e\n\u003cp\u003eThe renovations were only partially finished. A crew of carpenters were constructing new booths while electricians hung the light fixtures. The floors had been sanded and refinished, the walls had their first coat of paint and the windows had been replaced. Seth and Justine had decided to keep the original mahogany bar, which was a classic.\u003c/p\u003e\n\u003cp\u003eSeth led Jon into the room that would be his office and gestured toward the chair. “I like what you’ve done,” Jon said as he sat down. “When are you planning to open?”\u003c/p\u003e\n\u003cp\u003e“We’re hoping for the first week in May.”\u003c/p\u003e\n\u003cp\u003eJon glanced over his shoulder as though to estimate how much still needed to be done. “Everything should be finished by then,” he said confidently.\u003c/p\u003e\n\u003cp\u003e“As you know, we’re looking for a chef. One who’ll oversee the menu and work with us closely as we grow.”\u003c/p\u003e\n\u003cp\u003e“That’s why I’m here. I’ve been cooking at André’s for the last three years. I created their menu, which has an emphasis on seafood.”\u003c/p\u003e\n\u003cp\u003e“And before then?” Seth had already reviewed the resumé, but he wanted to hear the details from Jon. He and Justine had made a point of visiting André’s twice to sample Jon’s signature dishes.\u003c/p\u003e\n\u003cp\u003e“I was at the VFW in Olympia. I have references if you want.” He handed Jon a single sheet of paper with a list of names and telephone numbers.\u003c/p\u003e\n\u003cp\u003e“Where did you get your training?” The resumé had been decidedly light on that kind of information.\u003c/p\u003e\n\u003cp\u003eHe tensed a little, but that might have been Seth’s imagination. “Picked it up here and there. I don’t have a lot of formal education. I started out as a short-order cook for a breakfast place in Tacoma and worked my way up. It isn’t like I’m going to have my own TV show soon, if that’s the kind of chef you’re looking for.”\u003c/p\u003e\n\u003cp\u003e“It isn’t,” Seth assured him. He couldn’t afford a celebrity chef, anyway. He remained curious about Jon’s background, but didn’t press the issue. “I understand you’re also a photographer.”\u003c/p\u003e\n\u003cp\u003eJon nodded. “I’m a damn good chef, but my passion is my camera.”\u003c/p\u003e\n\u003cp\u003eHe didn’t hide his love for his work and that suited Seth.\u003c/p\u003e\n\u003cp\u003e“If you’re willing to give me a chance, you won’t be sorry,” Jon said fervently.\u003c/p\u003e\n\u003cp\u003eEvery instinct Seth possessed told him to hire the man. “I’m going to start stocking the kitchen in a month’s time. Can you be ready by then?”\u003c/p\u003e\n\u003cp\u003eJon nodded. They discussed wages, benefits, recipes and other details. When they’d finished, Seth took him around the restaurant and was pleased when Jon offered him design and decorating tips. He liked his ideas and shared them with Justine that evening.\u003c/p\u003e\n\u003cp\u003e“I had a feeling Jon Bowman was going to be the one,” she told him as Seth worked in the kitchen, preparing dinner.\u003c/p\u003e\n\u003cp\u003e“I did, too.”\u003c/p\u003e\n\u003cp\u003eJustine sat in their living room with her legs propped up to keep down the swelling in her ankles. At six months, the swelling was only slight, but still a concern. Seth had taken over the cooking and been inventive with eliminating salt.\u003c/p\u003e\n\u003cp\u003e“I feel like a walrus,” she complained, planting her hands on the small round bulge of her abdomen.\u003c/p\u003e\n\u003cp\u003eSeth leaned over the back of the sofa and kissed her neck. “You look so beautiful,” he murmured. “Not like a walrus at all—although they do have their charms.”\u003c/p\u003e\n\u003cp\u003e“Get serious, Seth.”\u003c/p\u003e\n\u003cp\u003e“I am serious.”\u003c/p\u003e\n\u003cp\u003eShe turned her face to him and they kissed, and he realized—as he did every day—how much he loved his wife.\u003c/p\u003e\n\u003cp\u003e“Tell me what you know about Jon Bowman,” he said, a few minutes later as he dished up seafood fettuccine.\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“His background. Do you know anything about it?”\u003c/p\u003e\n\u003cp\u003eJustine needed to think. “Not much. He used to sell his pictures through the gallery on Harbor Street\u003c/p\u003e\n\u003cp\u003e. Why?”\u003c/p\u003e\n\u003cp\u003e“He seemed a bit…edgy when I asked about it.”\u003c/p\u003e\n\u003cp\u003e“Where did he go to school?”\u003c/p\u003e\n\u003cp\u003e“He didn’t say, but I talked to two of his references. Both were managers at restaurants where he’s been employed and they sang his praises.”\u003c/p\u003e\n\u003cp\u003e“Have you ever seen his photographs?”\u003c/p\u003e\n\u003cp\u003eJustine moved toward the table, where Seth held out her chair. “Maryellen showed me a few of them before Christmas. They’re absolutely fabulous. You can feel the emotion and the beauty.”\u003c/p\u003e\n\u003cp\u003e“Hmm. Maybe we should buy a few. Hang them in the entrance. What do you think?”\u003c/p\u003e\n\u003cp\u003e“I think my brilliant husband has just had another wonderful idea.”\u003c/p\u003e\n\u003cp\u003eThey smiled at each other, fully satisfied with their lives.\u003c/p\u003e\n\u003cp\u003eFifteen\u003c/p\u003e\n\u003cp\u003eRosie had the house completely to herself. A hundred times over the years she’d yearned for a few hours alone, especially before a major holiday. Zach never understood how much work went into these family celebrations. For Easter, there was a dinner to prepare, to which they usually invited friends and other family—although things would be different this year. Then there was dyeing eggs and making up Easter baskets for the children. Although Allison and Eddie were older, Rosie felt obliged to maintain tradition.\u003c/p\u003e\n\u003cp\u003eNow that she had the time to do all this without interruption, she found herself fighting off a sense of melancholy. The children were spending the day with their father, and it went without saying that Janice Lamond would find some reason to join them.\u003c/p\u003e\n\u003cp\u003eCurious though she was, Rosie refused to drill the children about the other woman. Naturally she was dying to know if Janice and her son were at the apartment at the same time as her kids. But she refused to drag them into this divorce, no matter how tempting it was to learn what she could about the other woman’s activities. \u003c/p\u003e","sourceLink":"https://allnovel.net/204-rosewood-lane-cedar-cove-2/page-39.html","bookId":1942,"creation":"Oct 5, 2019 10:02:25 AM","modification":"Oct 5, 2019 10:02:25 AM"}
