{"id":66787,"no":44,"title":"Page 44","content":"\u003cp\u003e“You mean when you absconded with my credit card?”\u003c/p\u003e\n\u003cp\u003e“You know, I’ve thought about the significance of that a hundred times since.”\u003c/p\u003e\n\u003cp\u003e“Finish your original sentence,” she said with mock sternness.\u003c/p\u003e\n\u003cp\u003e“That day I came by the library to exchange credit cards, I was strongly attracted to you. I’ll admit it shook me up because I’d been divorced for five years and I wasn’t interested in another relationship. And then, all at once, it was like a bomb went off and I saw the future in a totally new way.”\u003c/p\u003e\n\u003cp\u003eIt didn’t hurt Grace’s ego any to hear this, although his interest had unsettled her in the beginning. She found herself growing more and more comfortable with it, however. For a long time she’d needed answers regarding Dan, but as the months passed, a resolution seemed increasingly unlikely and she was growing accustomed to that reality.\u003c/p\u003e\n\u003cp\u003e“I realize now what attracted me. Or, at least, part of it.”\u003c/p\u003e\n\u003cp\u003eShe sent him a questioning glance.\u003c/p\u003e\n\u003cp\u003e“You believe Dan’s with another woman.”\u003c/p\u003e\n\u003cp\u003eShe nodded, swallowing down the hurt the words still evoked.\u003c/p\u003e\n\u003cp\u003e“You’ve dealt with the emotions felt by someone who’s been betrayed in his or her marriage—what I felt about Susan’s affair.”\u003c/p\u003e\n\u003cp\u003eHe could be right. In her heart of hearts, Grace was indeed convinced that Dan was with someone else. A woman he’d loved so much that he was willing to walk away from his entire life. So many things about his disappearance didn’t add up, and she had no other answers.\u003c/p\u003e\n\u003cp\u003eGrace exited the freeway in Tacoma and took the back road into the airport. The route Dan had taught her.\u003c/p\u003e\n\u003cp\u003e“Can I tell you my theory about the mix-up with our credit cards?” he asked.\u003c/p\u003e\n\u003cp\u003eShe laughed out loud. “I can’t wait to hear it.”\u003c/p\u003e\n\u003cp\u003e“Well, to my way of thinking, it was fate. Destiny. Call it what you will.”\u003c/p\u003e\n\u003cp\u003e“The waitress at the PancakePalace wasn’t responsible?”\u003c/p\u003e\n\u003cp\u003e“She was merely the instrument of fate.”\u003c/p\u003e\n\u003cp\u003eGrace was both amused and intrigued by his theory. “So, we were destined to meet.”\u003c/p\u003e\n\u003cp\u003e“Without a doubt.” He sounded convinced of it. “I’ve come to think of our meeting as a gift. A sort of compensation for all the pain that came with the divorce.”\u003c/p\u003e\n\u003cp\u003eGrace felt her throat constrict. “That’s very sweet, Cliff.”\u003c/p\u003e\n\u003cp\u003e“I mean it. Someday, when you’re ready, I hope we can be more than sweethearts.”\u003c/p\u003e\n\u003cp\u003eWhat an old-fashioned and rather endearing term, Grace mused. “I’d like that.”\u003c/p\u003e\n\u003cp\u003eHe grew quiet and looked out the window as they neared the terminal. “I know it’s important that you find Dan. Or at least find out what happened to him.”\u003c/p\u003e\n\u003cp\u003e“I’d like closure, but I might never have it. I accept that now. I have to get on with my life.”\u003c/p\u003e\n\u003cp\u003e“Do you mean that?” The expression in his eyes revealed a vulnerability that touched her deeply. “Because if you do, then I want you to consider us being together, Grace.”\u003c/p\u003e\n\u003cp\u003e“Are you talking about—” She swallowed tightly and pulled to the curb to let Cliff out. “Are you talking about us getting…serious?”\u003c/p\u003e\n\u003cp\u003eHis hand was on the door handle. “Yes,” he said simply.\u003c/p\u003e\n\u003cp\u003eWithout another word he opened the car door; she stopped him by placing her hand on his arm. “Have a safe flight.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eStill, her hand lingered. She leaned toward him and he moved closer for a kiss that lasted long enough for the car behind them to honk impatiently. Cliff glanced quickly over his shoulder, then turned back to her. “Is that your answer?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” she said, but she smiled warmly. “I’ll think on it while you’re gone.”\u003c/p\u003e\n\u003cp\u003e“Do that,” he said, his eyes smiling into hers.\u003c/p\u003e\n\u003cp\u003eOlivia was too excited to sit still. Stan was due any minute and with him would be James, Selina and their granddaughter, Isadora Delores Lockhart.\u003c/p\u003e\n\u003cp\u003e“What time is it?” Charlotte asked. Her mother was as excited about this visit as she was. “I don’t know why you agreed to let Stan pick them up from the airport.”\u003c/p\u003e\n\u003cp\u003e“Mom, it made sense. Stan lives in Seattle.”\u003c/p\u003e\n\u003cp\u003e“Yes, I know, but it seems to be taking him forever,” she murmured fretfully.\u003c/p\u003e\n\u003cp\u003e“They’re here!” Justine cried from her perch near the front window. Stan opened the screen door, and both Olivia and Charlotte flew out to the porch. Olivia ran down the steps, her arms open to hug her son the instant he climbed out of the car. Within minutes, Olivia held a sleepy Isadora in her arms. The baby pressed her head against Olivia’s shoulder, and her heart melted with love for this first grandchild.\u003c/p\u003e\n\u003cp\u003e“Grandma,” James said, hugging Charlotte. “You look terrific.”\u003c/p\u003e\n\u003cp\u003e“Well, I’m not dead yet,” Charlotte assured him and stepped forward, waiting for an introduction to Selina. “Guess my number didn’t come up.”\u003c/p\u003e\n\u003cp\u003eJames slid his arm around his wife’s waist and introduced her. Selina’s dark eyes gleamed with happiness as she hugged Charlotte and then each family member in turn.\u003c/p\u003e\n\u003cp\u003eSeth and Justine appeared as the excited greetings wound down.\u003c/p\u003e\n\u003cp\u003e“Look at you, big sister,” James said, patting Justine’s stomach. “Almost a mom.”\u003c/p\u003e\n\u003cp\u003e“I’ve got months to go,” she complained.\u003c/p\u003e\n\u003cp\u003e“Oh, then you’re just fat.”\u003c/p\u003e\n\u003cp\u003e“Be careful what you say,” Seth advised under his breath. The two men exchanged a brief hug.\u003c/p\u003e\n\u003cp\u003e“Welcome to the family,” James said to Seth.\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eBy the time Olivia shepherded everyone into the house, she felt weak with joy. It was so rare to have the entire family together. “Where’s Marge?” she asked her ex-husband. When they’d made plans for this reunion, Olivia had included his second wife.\u003c/p\u003e\n\u003cp\u003e“Marge couldn’t make it,” Stan said, sounding genuinely regretful. “She sends her apologies.”\u003c/p\u003e\n\u003cp\u003e“Please tell her she’s welcome anytime.”\u003c/p\u003e\n\u003cp\u003e“I will,” Stan promised. Olivia noticed, however, that he hadn’t asked about Jack. She put the observation away, to be examined later.\u003c/p\u003e\n\u003cp\u003eWhile Olivia and Charlotte started setting the table for dinner, Stan held Isadora. The baby nestled in his embrace and almost immediately went back to sleep. Olivia smiled to find her ex-husband sitting in her rocking chair with their granddaughter in his arms, He looked so natural and relaxed. The last time she’d seen him like that had been when James was an infant and the twins were five…. Olivia blinked away the nostalgic tears those memories brought. She hurried back to the kitchen.\u003c/p\u003e\n\u003cp\u003e“Tell me everything,” she instructed her son as Selina and Justine took over the task of getting food onto the dining-room table. “Is the Navy bringing you home? I’d love it if you were stationed here in Bremerton.”\u003c/p\u003e\n\u003cp\u003e“Sorry, Mom, but it looks like I’ve got another two-year stint in San Diego.”\u003c/p\u003e\n\u003cp\u003eIt was hard to disguise her disappointment, but Olivia tried. “I’m grateful Selina’s family is there.”\u003c/p\u003e\n\u003cp\u003e“My parents love James,” her daughter-in-law told her.\u003c/p\u003e\n\u003cp\u003e“But it wasn’t that way in the beginning,” James said, patting his wife on the behind as she walked past with a large green salad.\u003c/p\u003e\n\u003cp\u003e“With good reason,” Olivia chastised. “You got their daughter pregnant.” Only a month before Isadora was born had Olivia learned that James and Selina were married. She was disappointed that both her children had decided to marry without either parent present. First James, and then a few months later, Justine had eloped to Reno with Seth. Still, she believed the children had chosen their mates well, which was a source of great pleasure to her and Stan. Pleasure and relief.\u003c/p\u003e\n\u003cp\u003eSoon the family gathered around the table. Olivia and Charlotte had been cooking and baking for days, making certain that James had the opportunity to enjoy all his favorite dishes. There were stuffed green peppers and Caesar salad with homemade croutons, plus seafood spaghetti. James took two helpings of each.\u003c/p\u003e\n\u003cp\u003e“Save room for dessert,” Charlotte warned.\u003c/p\u003e\n\u003cp\u003e“Grandma, did you bake me a coconut cake?” James looked like a little boy again, excited about his favorite dessert.\u003c/p\u003e\n\u003cp\u003e“I did,” Charlotte assured him. “Just for you.”\u003c/p\u003e\n\u003cp\u003e“This is the cake James talks about?” Selina asked. “The one he told me takes three days to make? Would you be willing to share the recipe?” The shy question was directed at Charlotte.\u003c/p\u003e\n\u003cp\u003e“First you start with a fresh coconut.”\u003c/p\u003e\n\u003cp\u003eAt Selina’s astonished eyes, Olivia leaned close to her daughter-in-law and whispered, “There are shortcuts.”\u003c/p\u003e\n\u003cp\u003e“But I don’t take them,” Charlotte told her. “Not for James, at any rate.”\u003c/p\u003e\n\u003cp\u003e“He’s spoiled,” his wife insisted, her eyes dancing with laughter. “I can’t help spoiling him, too. He’s just so cute.”\u003c/p\u003e\n\u003cp\u003eThat remark evoked a round of good-natured teasing about how cute James was.\u003c/p\u003e\n\u003cp\u003eAfter dinner, they sat around the table, drinking coffee, reminiscing about the old days, laughing, sharing stories. A little while later, Selina left to put the baby to bed.\u003c/p\u003e\n\u003cp\u003eOlivia showed her up to James’s old room and Stan followed with the luggage.\u003c/p\u003e\n\u003cp\u003eStarting down the stairs, Stan put his hand on her shoulder and stopped Olivia. She found him studying the pictures that lined the staircase wall. Although they’d divorced many years ago, she kept their wedding photo there. Not for sentimental reasons, but because she felt it was important for their children.\u003c/p\u003e\n\u003cp\u003eStan’s gaze rested on Jordan’s school photograph, taken the year he drowned. “I sometimes wonder…”\u003c/p\u003e\n\u003cp\u003eHe didn’t finish, but it wasn’t necessary; Olivia had often entertained these same thoughts herself. She wondered what their lives would’ve been like if it had rained that day or if Jordan had decided to ride his bicycle instead of going to the lake with his friends.\u003c/p\u003e\n\u003cp\u003e“Mom,” James called from the living room. “Grandma’s doing the dishes.”\u003c/p\u003e\n\u003cp\u003e“I’d like to see her try,” Stan muttered, leaping down the remaining stairs. “Charlotte, sit down this instant! I’m washing the dishes.”\u003c/p\u003e\n\u003cp\u003e“You?” Apparently Marge had him better-trained than Olivia ever did.\u003c/p\u003e\n\u003cp\u003eStan paused when he saw the dining-room table, piled high with plates, cups, glasses and serving bowls. “I, uh, might need some help.”\u003c/p\u003e\n\u003cp\u003e“I’ll volunteer,” Seth offered.\u003c/p\u003e\n\u003cp\u003e“No,” Olivia insisted. “Justine’s exhausted. Take her home so she won’t be too worn-out for tomorrow.” The grand opening of The Lighthouse was scheduled that week, and tomorrow was an Open House for the Chamber of Commerce. After spending ten hours today preparing for the Open House, the couple needed some rest. Thankfully, Justine had left her job at the bank, and Seth no longer worked at the marina.\u003c/p\u003e\n\u003cp\u003eOlivia hugged them both, and shuffled her daughter and son-in-law toward the door. James joined the little group to say goodbye. “Hey, I think it’s great that you two are opening a restaurant,” he said, walking out with them.\u003c/p\u003e\n\u003cp\u003eOlivia hurried to the kitchen, rolling up her long silk sleeves as she went. She saw that Stan had cleared the table, while Charlotte had picked up her knitting and begun watching “Jeopardy,” her favorite television game show. \u003c/p\u003e","sourceLink":"https://allnovel.net/204-rosewood-lane-cedar-cove-2/page-44.html","bookId":1942,"creation":"Oct 5, 2019 10:02:25 AM","modification":"Oct 5, 2019 10:02:25 AM"}
