{"id":66794,"no":51,"title":"Page 51","content":"\u003cp\u003eCorrie came into the office carrying a cup of freshly brewed coffee. “You’re thinking about the dead guy again.” Because they still didn’t have a name for him, his wife referred to him as “the dead guy.”\u003c/p\u003e\n\u003cp\u003eRoy growled something unintelligible under his breath. “I’m not dropping it.”\u003c/p\u003e\n\u003cp\u003e“Troy doesn’t have the money to continue funding the investigation.”\u003c/p\u003e\n\u003cp\u003e“You don’t need to remind me of that.” After his last report, in which he had little information to add, Davis had said to let it go. Roy didn’t like hearing that, but there were plenty of other cases that needed his attention. Still, this one nagged at him, much the same way Dan Sherman’s disappearance had.\u003c/p\u003e\n\u003cp\u003e“We’ve already put out more money than we’ve taken in.”\u003c/p\u003e\n\u003cp\u003eRoy had heard that before, as well. From the beginning, Corrie hadn’t been keen on his delving into this investigation. He didn’t think she could explain her reasoning any more than he could rationalize the time and expense he’d poured into the case.\u003c/p\u003e\n\u003cp\u003e“I can’t stop thinking the dead guy came to Cedar Cove for a specific reason,” Roy murmured, turning the puzzle around in his mind. He didn’t believe for a moment that this was a random visit. Something else that had bothered him was how the man knew about Thyme and Tide. The bed-and-breakfast wasn’t on a main road. He had to go off the freeway and down several side roads in order to find it.\u003c/p\u003e\n\u003cp\u003eEither the John Doe had gotten completely lost in the storm, or he’d specifically chosen the Beldons’ place. If so, why?\u003c/p\u003e\n\u003cp\u003e“Maybe he’s a hit man,” Corrie suggested, then shook her head. “I’ve been reading too many mysteries.”\u003c/p\u003e\n\u003cp\u003eRoy had thought of that possibility himself. “In which case, he would’ve been carrying a weapon and he wasn’t.”\u003c/p\u003e\n\u003cp\u003e“Unless it was being planted for him.” Corrie shrugged. “It happens that way in the movies.”\u003c/p\u003e\n\u003cp\u003e“Hit men carry their own pieces.”\u003c/p\u003e\n\u003cp\u003eCorrie leaned against the edge of his desk. “When’s the last time you spoke to Bob Beldon?”\u003c/p\u003e\n\u003cp\u003eRoy had to think about that. “A couple of months ago, I think.” His wife had a gift for asking the right questions. “He swears he’d never seen the man before that night,” he said slowly.\u003c/p\u003e\n\u003cp\u003e“Yes, but I remember you telling me that something about his reaction was slightly off.”\u003c/p\u003e\n\u003cp\u003eThat niggling feeling came every now and then. Roy didn’t suspect Bob of anything underhanded, nor did he believe the other man was withholding information, but often people weren’t even aware of what they knew. Bob most likely had some vague sense of recognition—so vague he didn’t consider it worth mentioning. Maybe he’d met the dead guy in his previous job or on a vacation.\u003c/p\u003e\n\u003cp\u003e“I think I’ll pay Bob and Peggy a visit,” Roy said.\u003c/p\u003e\n\u003cp\u003eCorrie grinned knowingly. “I figured you might think that was a good idea.”\u003c/p\u003e\n\u003cp\u003ePeggy was working in her herb garden when he pulled into the driveway. He could see her with her straw hat and a large basket, snipping and gathering. Getting out of the car, he waved to her; she waved cheerfully back. Although the couple was around the same age as Corrie and him, they hadn’t socialized. He wasn’t sure why.\u003c/p\u003e\n\u003cp\u003eRoy saw another car parked in the driveway, one he didn’t recognize. Probably belonged to a guest. The front door opened before he could ring the bell and Pastor Dave Flemming stepped onto the porch. Dave served as a Methodist minister and was a likeable guy; Roy had met him on a number of occasions. He knew that Pastor Dave had officiated at Dan Sherman’s funeral, which had been small and private, and had met with Grace a couple of times since, helping her deal with the tragedy.\u003c/p\u003e\n\u003cp\u003e“Roy, how are you?” Pastor Dave said, extending his hand. “Good to see you.”\u003c/p\u003e\n\u003cp\u003e“You, too.”\u003c/p\u003e\n\u003cp\u003e“You’re popular today, Bob,” Dave said on his way out the door.\u003c/p\u003e\n\u003cp\u003e“You here to see me?” Bob asked.\u003c/p\u003e\n\u003cp\u003e“If you’ve got a minute.”\u003c/p\u003e\n\u003cp\u003e“Sure thing.” He held the screen door open and invited Roy inside. “Pastor Dave asked me to coach a church basketball team.”\u003c/p\u003e\n\u003cp\u003e“I didn’t know you were interested in sports.”\u003c/p\u003e\n\u003cp\u003e“I haven’t played in years,” Bob said as he led Roy into the kitchen. He offered him a glass of iced tea, which Roy declined with a shake of his head.\u003c/p\u003e\n\u003cp\u003eThey sat across the table from each other. “Apparently Grace mentioned to him that Dan and I were local sports heroes a hundred years ago,” Bob murmured.\u003c/p\u003e\n\u003cp\u003e“You and Dan went to school together?”\u003c/p\u003e\n\u003cp\u003eBob nodded. “We were good friends at one time. In fact, we enrolled in the Army on the buddy plan and took our training together.”\u003c/p\u003e\n\u003cp\u003eAs long as Roy had lived in Cedar Cove, he couldn’t remember the two men having more than a nodding acquaintance.\u003c/p\u003e\n\u003cp\u003e“I don’t think you came by to ask me about Dan, now did you?” Bob said.\u003c/p\u003e\n\u003cp\u003e“No. I’m still trying to find out who your visitor was.”\u003c/p\u003e\n\u003cp\u003e“You learn anything?” Bob leaned forward slightly.\u003c/p\u003e\n\u003cp\u003eRoy shook his head. “I know you’ve gone over the details of that night a number of times.”\u003c/p\u003e\n\u003cp\u003e“With you and with Troy.” Bob sounded bored.\u003c/p\u003e\n\u003cp\u003e“I appreciate your cooperation.”\u003c/p\u003e\n\u003cp\u003eBob nodded. “No problem.”\u003c/p\u003e\n\u003cp\u003e“Tell me your impressions again.”\u003c/p\u003e\n\u003cp\u003e“Let me think.” Bob leaned back in the chair and closed his eyes. “It was late. The news was over and Leno was just coming on. I saw the car’s headlights from the window and asked Peggy if we had any guests down on the books. She said we didn’t.”\u003c/p\u003e\n\u003cp\u003e“What was your first reaction when you saw him?” Roy asked.\u003c/p\u003e\n\u003cp\u003eHis eyes remained closed. “Hey—you know what? I thought he seemed familiar, which is odd because I didn’t get a good look at his face. I’d kind of forgotten about that, with all the commotion the next morning.”\u003c/p\u003e\n\u003cp\u003e“Familiar?” Roy pressed. “In what way?”\u003c/p\u003e\n\u003cp\u003eBob frowned. “I don’t know. Nothing definite.”\u003c/p\u003e\n\u003cp\u003e“His walk? The way he carried himself?”\u003c/p\u003e\n\u003cp\u003e“Maybe.”\u003c/p\u003e\n\u003cp\u003e“What else?”\u003c/p\u003e\n\u003cp\u003eBob opened his eyes and shook his head. “I had…an uneasy feeling.”\u003c/p\u003e\n\u003cp\u003e“Define uneasy,” Roy probed.\u003c/p\u003e\n\u003cp\u003eBob thought a moment and then shrugged. “It was like a gut reaction—that this man meant trouble.”\u003c/p\u003e\n\u003cp\u003e“Trouble,” Roy repeated.\u003c/p\u003e\n\u003cp\u003e“I guess I was partially right, seeing that he turned up dead in the morning.” Bob sighed loudly and shook his head. “Sorry I can’t help you more.”\u003c/p\u003e\n\u003cp\u003e“You have,” Roy said, which seemed to surprise Bob.\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“I’m beginning to think you did know this man. I want you to sleep on it. Let it work in your mind and get back to me if something else occurs to you.”\u003c/p\u003e\n\u003cp\u003e“You think he was here because of me?” Bob sounded shocked.\u003c/p\u003e\n\u003cp\u003e“Yes, Bob, I do.”\u003c/p\u003e\n\u003cp\u003eFinally Rosie was to have her day in court. She’d waited almost six months for this. Sharon Castor, her attorney, walked next to her as they approached the front of the courtroom and sat down.\u003c/p\u003e\n\u003cp\u003e“We have Judge Lockhart,” Sharon whispered.\u003c/p\u003e\n\u003cp\u003eHaving a female judge reassured Rosie, since another woman would understand her position more clearly than a man. Although he continued to deny it, Zach was involved with Janice Lamond. If he’d been honest about the affair, the divorce would have been over months ago. She blamed him for the delays, blamed him for everything. He, of course, blamed her. He accused Rosie of dragging things out and being unreasonable. She accused him of lying. On and on it went.\u003c/p\u003e\n\u003cp\u003e“That’s good, isn’t it?” Rosie whispered, leaning her head close to Sharon’s.\u003c/p\u003e\n\u003cp\u003e“Lockhart’s fair, if a bit unorthodox.”\u003c/p\u003e\n\u003cp\u003eThat wasn’t what Rosie wanted to hear. She wanted this procedure to be quick and straighforward. After six months of haggling over every detail, she was ready for the divorce to be done. Ready to make a new life for herself and put the bitterness and ill will behind her.\u003c/p\u003e\n\u003cp\u003eZach approached the table, his attorney at his side.\u003c/p\u003e\n\u003cp\u003eRosie didn’t look at Zach, but she felt his gaze burn through her. She stiffened her spine and refused to acknowledge him. Her eyes stung from lack of sleep. Her head throbbed with the worst headache in ten years and she felt she might be physically ill. Zach would never know any of this, however. She’d keel over in a dead faint before she’d let him know what his affair had done to her sense of worth, her dignity and her heart. This divorce had just about destroyed her emotionally.\u003c/p\u003e\n\u003cp\u003eThe judge was announced and all the people in the courtroom briefly rose and then immediately reclaimed their seats.\u003c/p\u003e\n\u003cp\u003e“Good morning, Your Honor,” Sharon Castor said, rising to her feet once more.\u003c/p\u003e\n\u003cp\u003e“Good morning.” Judge Lockhart flipped through the pages of the brief, scanning the details. “I see you’ve reached a settlement in the matter of alimony.”\u003c/p\u003e\n\u003cp\u003e“We have, Your Honor.”\u003c/p\u003e\n\u003cp\u003e“I’ve read through the parenting plan.”\u003c/p\u003e\n\u003cp\u003eRosie caught her breath. She’d held out as long as she could on the issue of joint custody. It wasn’t what she wanted. She assumed, from the amount of time Janice and Chris spent with Zach, that he intended to make them part of his life and thus part of her children’s lives. Knowing that, she fought him with everything she could. Their fights had grown ugly and vengeful. Rosie regretted the things they’d said and done, but in the heat of her anger, the venom had flowed out of her. She hadn’t known she was capable of behaving this way. Hadn’t known Zach was capable of treating her with such contempt.\u003c/p\u003e\n\u003cp\u003e“It appears that you’ve agreed to joint custody.”\u003c/p\u003e\n\u003cp\u003e“Yes, Your Honor.”\u003c/p\u003e\n\u003cp\u003eJudge Lockhart gestured at the document. “It states here that the children, ages fifteen and nine, are to live with their father three days a week in the first and third week of each month and four days a week in the second and fourth week. Is that correct?”\u003c/p\u003e\n\u003cp\u003e“Yes, Your Honor.”\u003c/p\u003e\n\u003cp\u003e“They are to pack up their belongings and transfer from their house to his apartment—and back—every three or four days. Isn’t that a lot of moving about for these children?” the judge asked, frowning.\u003c/p\u003e\n\u003cp\u003e“Your Honor.” Zach’s attorney stood. “It’s important to my client that he share custody of his children.”\u003c/p\u003e\n\u003cp\u003e“I have no squabbles with his motivation or the concept of shared custody,” Judge Lockhart said, “but to my way of thinking, it isn’t the parents who need a stable home life, it’s the children.”\u003c/p\u003e\n\u003cp\u003e“My client couldn’t agree with you more,” Otto Benson said, and Zach nodded.\u003c/p\u003e\n\u003cp\u003e“Ms. Castor, is your client in agreement as well?”\u003c/p\u003e\n\u003cp\u003eSharon looked at Rosie, who stood. She spoke directly to the judge. “I want what’s best for my children.”\u003c/p\u003e\n\u003cp\u003eJudge Lockhart studied both Zach and Rosie. “The family home is at 311 Pelican Court\u003c/p\u003e\n\u003cp\u003e. How long have you lived at this address?”\u003c/p\u003e\n\u003cp\u003e“Three years, Your Honor.”\u003c/p\u003e\n\u003cp\u003e“You intend to keep the home?” \u003c/p\u003e","sourceLink":"https://allnovel.net/204-rosewood-lane-cedar-cove-2/page-51.html","bookId":1942,"creation":"Oct 5, 2019 10:02:25 AM","modification":"Oct 5, 2019 10:02:25 AM"}
