{"id":90511,"no":14,"title":"Page 14","content":"\u003cp\u003eHis voice turned soft. “Lily.”\u003c/p\u003e\n\u003cp\u003eMy heart pounded and my nose tingled, the stupid shake in my voice sounded as I asked quietly, “Fifteen minutes?”\u003c/p\u003e\n\u003cp\u003eMore softness. Softer than soft. “Lily.” His voice pleading me to not push this.\u003c/p\u003e\n\u003cp\u003eDefeat evident, I dipped my chin to stop my quivering lips from showing as I whispered, “Okay. Five minutes.”\u003c/p\u003e\n\u003cp\u003eMoving closer to me, he caught my chin between his thumb and forefinger, lifting it. My watery eyes met his icy blues. I was momentarily stunned when I saw something akin to sympathy there.\u003c/p\u003e\n\u003cp\u003eUsing his free hand, he stroked my hair once, dropped his hand to his side and explained, “I’m not an unreasonable guy, Lily. I know you think I’m a dick and that’s cool. But I need you to know, I’m not unreasonable. Not ever.”\u003c/p\u003e\n\u003cp\u003eIt took me a whole thirty seconds to get what he meant.\u003c/p\u003e\n\u003cp\u003eMeaning if there was leeway to give, he would consider what I was asking. But he can’t offer me leeway when there is none.\u003c/p\u003e\n\u003cp\u003eBreaking my thoughts, he offered, “Calls made once a week. Five minutes with your parents.” Holding my chin firm, his eyes bore into mine. “Fifteen minutes with your sister.”\u003c/p\u003e\n\u003cp\u003eWhen I flung myself at him and buried my face into his neck, he held me tightly. My stupid tears flowing freely.\u003c/p\u003e\n\u003cp\u003eHe never rushed me.\u003c/p\u003e\n\u003cp\u003eHe wouldn’t drop me.\u003c/p\u003e\n\u003cp\u003eHe was my shield.\u003c/p\u003e\n\u003cp\u003eHe would protect me.\u003c/p\u003e\n\u003cp\u003eAgainst almost anything.\u003c/p\u003e\n\u003cp\u003eSo I guess you could say that things between Nox and I have both improved and declined. In the month that passed, I managed to pry some information out of him.\u003c/p\u003e\n\u003cp\u003eRegardless of how minimal the stupid facts are, I feel victorious.\u003c/p\u003e\n\u003cp\u003eFact.\u003c/p\u003e\n\u003cp\u003eNox loves iced tea. It reminds him of home.\u003c/p\u003e\n\u003cp\u003eOnce, I made the mistake of asking him if he wanted sugar. He responded immediately, “Sweet tea’s for pussies,” then walked away.\u003c/p\u003e\n\u003cp\u003eFact.\u003c/p\u003e\n\u003cp\u003eNox is fluent in three languages and passable in six others.\u003c/p\u003e\n\u003cp\u003eHe won’t tell me which ones.\u003c/p\u003e\n\u003cp\u003eFact.\u003c/p\u003e\n\u003cp\u003eWhen Nox was sixteen, he was caught drunk as a skunk at a strip club. The owner called his mama and she dragged him home by his ear.\u003c/p\u003e\n\u003cp\u003eFact.\u003c/p\u003e\n\u003cp\u003eNox hasn’t been with a woman in close to two years.\u003c/p\u003e\n\u003cp\u003eAccording to Boo.\u003c/p\u003e\n\u003cp\u003eFact.\u003c/p\u003e\n\u003cp\u003eGetting Nox to reveal pieces of himself is harder than pulling a tiger’s tooth.\u003c/p\u003e\n\u003cp\u003eFact.\u003c/p\u003e\n\u003cp\u003eDelilah Flynn prefers to sleep with a strong arm around her waist.\u003c/p\u003e\n\u003cp\u003eA few weeks ago I woke in a cold sweat with my heart pounding out of my chest. When I opened my eyes, I looked to the doorway and for once, I wished I’d seen Nox sleeping there.\u003c/p\u003e\n\u003cp\u003eSince we came back from our first motel room adventure, Nox had left me alone. And although I was glad he put his trust in me, that first night back, I missed his presence and the comfort it brought.\u003c/p\u003e\n\u003cp\u003eSince that first adventure, there have been two more.\u003c/p\u003e\n\u003cp\u003eBoth included shrieking siren alerts. Both included me being thrown into the back of a creepy black van. Both included me being blindfolded. Both included finding the most obscure, small motel to stay in, hours away.\u003c/p\u003e\n\u003cp\u003eBoth times, it was just me and Nox.\u003c/p\u003e\n\u003cp\u003eBoth times, Nox slept pressed into my back with an arm around my waist.\u003c/p\u003e\n\u003cp\u003eYou wouldn’t hear me complaining.\u003c/p\u003e\n\u003cp\u003eIn fact, my rigid body would turn soft at the contact.\u003c/p\u003e\n\u003cp\u003eI missed that.\u003c/p\u003e\n\u003cp\u003eSo when I woke in a cold sweat, heart racing at almost four in the morning, it was clear what I needed. A shower, you say?\u003c/p\u003e\n\u003cp\u003eHell no.\u003c/p\u003e\n\u003cp\u003eI needed a strong arm around me.\u003c/p\u003e\n\u003cp\u003eSlipping out of bed, I threw off my soaked nightie, replaced it with a tee and tiptoed out of my room. Creeping down the hall, I reached the door at the very end, wrapped my fingers around the door knob, and twisted.\u003c/p\u003e\n\u003cp\u003eOnly to feel resistance.\u003c/p\u003e\n\u003cp\u003eDamn it to heck!\u003c/p\u003e\n\u003cp\u003eNox locked his door at night.\u003c/p\u003e\n\u003cp\u003eMy gut sank.\u003c/p\u003e\n\u003cp\u003eI stood there in the hall, dressed in a baggy white tee and underwear, contemplating what to do next, when something clicked and the door opened. Nox stood there in boxers, looking tired and just woken. Without a word, I pushed my way inside, walked across the room, climbed into his bed facing away from him, and covered myself with the covers.\u003c/p\u003e\n\u003cp\u003eLaying my head down with a sigh, I waited.\u003c/p\u003e\n\u003cp\u003eAnd waited.\u003c/p\u003e\n\u003cp\u003ePatiently, I waited some more until I finally felt it. The bed depressed, and Nox slid in beside me.\u003c/p\u003e\n\u003cp\u003eTurning to me, his arm wrapped around my hips, and he pulled me back into his body.\u003c/p\u003e\n\u003cp\u003eNot a single word was spoken.\u003c/p\u003e\n\u003cp\u003eAnd that was okay.\u003c/p\u003e\n\u003cp\u003eWe didn’t need ‘em.\u003c/p\u003e\n\u003cp\u003eThat was not the last night I’d spent in Nox’s bed.\u003c/p\u003e\n\u003cp\u003eIn fact, more often than not, I slept in his bed rather than my own. He’d even started to leave his bedroom door unlocked, knowing that in the wee hours of the morning, I’d be making an appearance.\u003c/p\u003e\n\u003cp\u003eRock walked in on us sleeping one morning, and when we both lifted our heads to look up at him, he looked like he’d just found out unicorns were real.\u003c/p\u003e\n\u003cp\u003eThe best part of the situation?\u003c/p\u003e\n\u003cp\u003eNox grumbled, “You need somethin’?” Like it was no big deal.\u003c/p\u003e\n\u003cp\u003eRock’s eyebrows lifted so fast, I thought they’d fly off his face. “Nah. Just wanted to see if you wanted to spar before work, but,” Smirking like an ass, he finished with, “I see you’re tired.”\u003c/p\u003e\n\u003cp\u003eBacking out of the room, he shut the door and Nox tucked me into his side, mumbling, “Ass.”\u003c/p\u003e\n\u003cp\u003eI wrapped my arm around his side and sighed quietly, “Mmhmmm.”\u003c/p\u003e\n\u003cp\u003eThen we slept for the better part of the morning.\u003c/p\u003e\n\u003cp\u003eIt was peaceful.\u003c/p\u003e\n\u003cp\u003eIt was quiet.\u003c/p\u003e\n\u003cp\u003eIt was perfect.\u003c/p\u003e\n\u003cp\u003eFast forward three weeks…\u003c/p\u003e\n\u003cp\u003eI vaguely hear something penetrate the depths of my deep sleep.\u003c/p\u003e\n\u003cp\u003e“Boss?”\u003c/p\u003e\n\u003cp\u003eMy dream pulls me back in and just as I get to the good part, static sounds, then I hear a little more clearly, “Boss? Come in.”\u003c/p\u003e\n\u003cp\u003ePeeking through one eye, I check the clock on the nightstand.\u003c/p\u003e\n\u003cp\u003e7:47am.\u003c/p\u003e\n\u003cp\u003eOh, for the love of God. Why are people awake at this time?\u003c/p\u003e\n\u003cp\u003eGetting more of my bearings, I roll over on the bed. I do this with ease which immediately alerts me to the fact that Nox is already awake.\u003c/p\u003e\n\u003cp\u003e“The hell, Boss? Come in.” This comes from the two-way radio on the opposite nightstand.\u003c/p\u003e\n\u003cp\u003eThrowing my body across the bed, I press the button on the two-way. “Shower, Vito.”\u003c/p\u003e\n\u003cp\u003e“Lily? What the…? You know what, I don’t wanna know,” Vito responds gingerly.\u003c/p\u003e\n\u003cp\u003eI chuckle, “Shut up, Vito. I was asleep. And by the way, I need more pads.”\u003c/p\u003e\n\u003cp\u003eClearly confused, he asks, “Pads? What kind of pads?”\u003c/p\u003e\n\u003cp\u003e“The feminine hygiene kind. Aunt Flo will be here soon.”\u003c/p\u003e\n\u003cp\u003eI almost see the disgust on his face. “TMI, Lily. Seriously, babe. Just tell me what you need.”\u003c/p\u003e\n\u003cp\u003eFeeling sleepy again, I mumble, “Heavy flow.”\u003c/p\u003e\n\u003cp\u003eHe chuckles, “Oh yeah, like I could forget, huh? Got it. Anything else?”\u003c/p\u003e\n\u003cp\u003eWow. Asking a woman, soon to be on the rag, if they need anything is a dangerous question.\u003c/p\u003e\n\u003cp\u003eNow that I think about it, I add to my list. “Uh, yeah. Candy. Lots of it. And a magazine. Or three. And pancake mix. The good kind, not the stuff you got last time. It tasted like cardboard. Maybe some bacon, too. And don’t forget the syrup.”\u003c/p\u003e\n\u003cp\u003eHe scoffs, “Babe, I meant the essentials.”\u003c/p\u003e\n\u003cp\u003eRolling my eyes, I utter, “Vito, that is essential to a girl with her monthly friend.”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eI gotta butter him up a little. In a sing-song voice, I say, “C’mon, Vito. I’ll be sweet to you.”\u003c/p\u003e\n\u003cp\u003eLightning quick, he returns, “Oh Lily, baby. You get any sweeter and I’ll get a sugar rush.”\u003c/p\u003e\n\u003cp\u003eI’m stunned and thoroughly amused. “Vito, was that…? Did you just…? Was that flirting?”\u003c/p\u003e\n\u003cp\u003eHe says quietly, “That depends.”\u003c/p\u003e\n\u003cp\u003eConfused again. “On what?”\u003c/p\u003e\n\u003cp\u003eHe mutters huskily, “Depends on if you liked it, babe.”\u003c/p\u003e\n\u003cp\u003eHaving to think about this, I mumble, “Well, it was my first time, but yeah, it was nice.”\u003c/p\u003e\n\u003cp\u003eVito sounds shocked. “No one’s ever flirted with you before?”\u003c/p\u003e\n\u003cp\u003e“Nope.” I pop the p.\u003c/p\u003e\n\u003cp\u003eI can hear the smile in his voice. “It’s a crime, baby.”\u003c/p\u003e\n\u003cp\u003eJust then, the door to the bathroom opens and in walks Nox, wearing nothing but a towel.\u003c/p\u003e\n\u003cp\u003eMy brain smiles like the cat that got the cream. Seeing Nox like this is nothing unusual now. Modesty is a thing of the past.\u003c/p\u003e\n\u003cp\u003eNox narrows his eyes at the two-way in my hand and I roll my eyes at him. Pressing the button, I say, “Listen, I gotta go. Señor Anger just got out the shower. You need him?”\u003c/p\u003e\n\u003cp\u003eVito chuckles, “Nope. Not unless he needs anything.”\u003c/p\u003e\n\u003cp\u003eStill in bed, I look up at Nox and ask, “Need anything from the store?”\u003c/p\u003e\n\u003cp\u003eStepping into a pair of gunmetal-grey boxers, he pulls them up under his towel and replies, “Oatmeal. Apples. Eggs.”\u003c/p\u003e\n\u003cp\u003eStill holding the button on the two-way, I ask, “You get that, Vito?”\u003c/p\u003e\n\u003cp\u003e“Got it. Have a nice day, sweet, sweet Lily.” He overdoes it with the huskiness, and I chuckle before putting on a breathy voice, “Bye, baby.”\u003c/p\u003e\n\u003cp\u003eStill chuckling, I put the two-way back on the nightstand and watch Nox dress.\u003c/p\u003e\n\u003cp\u003eI love this part of the morning. He acts like I don’t exist and I act like he can’t see me. Today is a little different for me, though. I can’t seem to wipe the smile off my face. It doesn’t bother me that he doesn’t know what today is. It doesn’t bother me that no one knows what today is. I’m just happy that I made it to another birthday safe and well and surrounded by friends.\u003c/p\u003e\n\u003cp\u003eThe hot guy in my bed?\u003c/p\u003e\n\u003cp\u003eTotal bonus.\u003c/p\u003e\n\u003cp\u003eChapter Twelve\u003c/p\u003e\n\u003cp\u003eThe hair of the dog that bit ya\u003c/p\u003e\n\u003cp\u003eThree days later…\u003c/p\u003e\n\u003cp\u003eNox\u003c/p\u003e\n\u003cp\u003eI punch the bag. Hard.\u003c/p\u003e\n\u003cp\u003eOnce more. Harder.\u003c/p\u003e\n\u003cp\u003eThe feeling of pain shooting through my lightly wrapped knuckles, up my arm, then disappearing into my body feels good.\u003c/p\u003e\n\u003cp\u003ePain is good.\u003c/p\u003e\n\u003cp\u003ePain is an indication that you’re alive. Well, living, at the very least.\u003c/p\u003e\n\u003cp\u003ePain is also a good way to play games with your mind. A distraction method taught to me in the early stages of training.\u003c/p\u003e\n\u003cp\u003eAnd I need a fucking distraction.\u003c/p\u003e\n\u003cp\u003eWaking up with yet another hard-on pressed into Lily’s ass is enough to put anyone in a bad mood.\u003c/p\u003e\n\u003cp\u003eYeah. That’s right. Bad mood.\u003c/p\u003e\n\u003cp\u003eWhy bad?\u003c/p\u003e\n\u003cp\u003eBecause I feel like I’m getting my prick teased every fucking day with no relief! Sure I could jerk off, but that would leave me feeling like a creep. Jerking off in the bathroom next to our room is just…wrong.\u003c/p\u003e\n\u003cp\u003eFuck me.\u003c/p\u003e\n\u003cp\u003eDid I just say our room?\u003c/p\u003e\n\u003cp\u003eI punch the bag repeatedly while growling through gritted teeth.\u003c/p\u003e\n\u003cp\u003eThis is bad. Very bad.\u003c/p\u003e\n\u003cp\u003eNope. I don’t like it.\u003c/p\u003e\n\u003cp\u003eThree weeks.\u003c/p\u003e\n\u003cp\u003eThree fucking weeks of sleeping next to that girl.\u003c/p\u003e\n\u003cp\u003eThat girl. She’s just a girl.\u003c/p\u003e\n\u003cp\u003eOh, I’m going to hell. No doubt. Especially after last night’s dream.\u003c/p\u003e\n\u003cp\u003eWrapping up my morning training session, I step out of the workout room and into the hall. And there she is. Boo has her laughing at something. She has a nice laugh. It’s not small and sweet sounding. It’s not a giggle. It’s uninhibited and animated. When she laughs, I feel like I get a chance to see the real Lily. The one whose mind doesn’t stop her from living a good life. The one who isn’t paranoid or on edge all the time.\u003c/p\u003e\n\u003cp\u003eThe free Lily.\u003c/p\u003e\n\u003cp\u003eShe wears a pair of small, black workout shorts and a baggy white tee knotted at the belly. Then I see her feet and scowl.\u003c/p\u003e\n\u003cp\u003eWalking up to them, we meet halfway. I say, “Take the boots off.”\u003c/p\u003e\n\u003cp\u003eConfusion mars her face. “Why?”\u003c/p\u003e\n\u003cp\u003eBecause they look way too sexy on your long ass legs, and I can’t do anything about it.\u003c/p\u003e\n\u003cp\u003e“Because they don’t belong to you.” I say matter of factly.\u003c/p\u003e\n\u003cp\u003eHer eyes widen and she says concretely, “Uh, yes, they do.”\u003c/p\u003e\n\u003cp\u003eWhat?\u003c/p\u003e\n\u003cp\u003eOkay, so the military boots have hot pink laces, but you can’t buy those just anywhere. I feel I need to let her in on this.\u003c/p\u003e\n\u003cp\u003e“You can’t buy those boots just anywhere, Lily.”\u003c/p\u003e\n\u003cp\u003eBoo and Lily share a look, then smile. Lily utters, “Yes, Nox, I’m aware of that. Boo bought ‘em for me and I love ‘em, so I’m gonna keep ‘em on.”\u003c/p\u003e\n\u003cp\u003eI don’t get it.\u003c/p\u003e\n\u003cp\u003eTurning to Boo, I ask, “Why’d you get her boots? She doesn’t need boots.”\u003c/p\u003e\n\u003cp\u003eBoo hesitates for a moment before she says quietly, “Because it was her birthday, and that’s what she wanted, so that’s what she got.”\u003c/p\u003e\n\u003cp\u003eHer birthday?\u003c/p\u003e\n\u003cp\u003eI fucking forgot her birthday. Great. Now I feel like an asshole.\u003c/p\u003e\n\u003cp\u003eWhat do I say now?\u003c/p\u003e\n\u003cp\u003e“Uh, happy belated birthday. Guess you can keep the boots.”\u003c/p\u003e\n\u003cp\u003eRolling her eyes, she mutters, “Thanks, dickhead,” then pulls Boo along and they disappear down the stairs.\u003c/p\u003e\n\u003cp\u003eWatching her leave, I get an idea. It’s probably not a good one, but it’s something. Walking back into the workout room, I ask Rock, “You know it was Lily’s birthday?”\u003c/p\u003e\n\u003cp\u003eRock continues to punch the bag but replies, panting, “Yeah. Boo got her boots. Vito got her flowers. I got her an eReader.”\u003c/p\u003e\n\u003cp\u003eThe hell?\u003c/p\u003e\n\u003cp\u003eVito got her flowers? The little fucker. He and I need to have a talk.\u003c/p\u003e\n\u003cp\u003eI mutter, “Got her an eReader?”\u003c/p\u003e\n\u003cp\u003eRock shrugs, “She likes it. Always with the books.” He turns to me smirking, “Know what they say about women who read?”\u003c/p\u003e\n\u003cp\u003eI have no idea what they say about women who read, but I know he’ll say something dirty. And that’s not gonna help me and the semi I’ve been sporting for three weeks. Turning, I shoot him the bird and he chuckles to himself.\u003c/p\u003e\n\u003cp\u003eI have to find something. And in order to find it, I gotta do some digging.\u003c/p\u003e\n\u003cp\u003eTime to wrap a present.\u003c/p\u003e\n\u003cp\u003eLily\u003c/p\u003e\n\u003cp\u003e“The guy is completely fucked up but he’s so dreamy at the same time. I like the dominant characters. But you know what’s funny? If I had a guy treat me like the guy in the book, I’d run the other way. Fast.” I tell Boo. I’ve had her reading some erotica and she likes it. So, naturally, we’ve been talking smut.\u003c/p\u003e\n\u003cp\u003eBoo reclines in her lawn chair. “Oh, I get ya, honey. The dude is rich; he’s powerful, and he wants a sub. I’m not a sub. I’d never be a sub. But for him, I’d pretend to be a sub.” After a moment, she adds, “The girl, however…man! What she puts up with? And how he treats her sometimes? Oowee. She is fifty shades of cray.” \u003c/p\u003e","sourceLink":"https://allnovel.net/willing-captive/page-14.html","bookId":2800,"creation":"Oct 5, 2019 5:43:06 PM","modification":"Oct 5, 2019 5:43:06 PM"}
