{"id":90518,"no":21,"title":"Page 21","content":"\u003cp\u003eI like Funny Nox. He’s not at all like Moody Bastard Nox.\u003c/p\u003e\n\u003cp\u003eLeaning back, I take him in. Awestruck, I whisper, “It was perfect.”\u003c/p\u003e\n\u003cp\u003eMoving to the side, I take some tissue off the nightstand and wipe the come from his scarred stomach. When I’m done he holds out an arm, and I lie down next to him. He tucks me into him, lowers his mouth, and kisses me. Between kisses, he utters, “It was perfect. Thank you, baby.”\u003c/p\u003e\n\u003cp\u003ePecking his lips, I say against them, “That was fun.”\u003c/p\u003e\n\u003cp\u003eHis kisses start soft. Running his hands up and down my back, his hands linger lower. His fingers brush the elastic at my waist and his hands slowly venture into the back of my panties, gripping my butt tightly. He kneads the flesh there and I moan into his mouth.\u003c/p\u003e\n\u003cp\u003eTaking his mouth off mine, he lowers his head to my chest, closing his mouth over one taut nipple. He sucks hard and my eyes roll into the back of my head.\u003c/p\u003e\n\u003cp\u003eHe’s so good at this.\u003c/p\u003e\n\u003cp\u003eI feel a surge of wetness at my core and press my legs together, trying my hardest to hold it inside. Nox releases one nipple before taking the other one into his mouth, giving it the same treatment. He runs his thumb over the free nipple, and my core contracts with an uncontrollable jerk.\u003c/p\u003e\n\u003cp\u003eMy breathing turns heavy and I sigh low in my throat.\u003c/p\u003e\n\u003cp\u003eI want more.\u003c/p\u003e\n\u003cp\u003eI’m unsure of the protocol on men being able to get it up in ten minutes or under after a previous release, but I feel something hard poke my belly. Reaching down, I run a finger from the base of him to the very tip, and groaning, he bites my nipple. Hard.\u003c/p\u003e\n\u003cp\u003eMy already moist core floods as I grip his head tight and gasp.\u003c/p\u003e\n\u003cp\u003eThat. Was. Wicked.\u003c/p\u003e\n\u003cp\u003eHis hand slides from my hip, across my belly, down lower until he cups my panty-covered sex.\u003c/p\u003e\n\u003cp\u003eI’m suddenly mortified.\u003c/p\u003e\n\u003cp\u003eHis fingers start to slip inside and I grab hold of his hand, gripping it tightly while pressing my legs shut even further. I whisper, “Nox-”\u003c/p\u003e\n\u003cp\u003eBut he cuts me off. Cupping my cheek, he says softly, “No, princess. Don’t. I told you I wouldn’t pressure you. Ever. And it’s totally cool. We don’t have to do a damn thing. As long as I got you sleeping next to me, I’m good.”\u003c/p\u003e\n\u003cp\u003eInsert dreamy sigh here.\u003c/p\u003e\n\u003cp\u003eShutting my eyes, I lean forward, place my lips to his ear and mumble.\u003c/p\u003e\n\u003cp\u003eRubbing my back, he says, “I didn’t catch that.”\u003c/p\u003e\n\u003cp\u003eI whisper hiss, “I think I’m too wet. There’s something wrong with me!”\u003c/p\u003e\n\u003cp\u003eFeeling his smile on my jaw, his hand slides down my belly, under the waist band of my panties, but he doesn’t go further. His breath warms my cheek as he says hoarsely, “Open for me, baby.”\u003c/p\u003e\n\u003cp\u003eAs if that were the magic password, my legs part like the Red Sea did for Moses.\u003c/p\u003e\n\u003cp\u003eHis hand slides in and his fingers brush the very wet, very aroused magic button of my sex. He stills before burying his face in my neck, muttering, “So wet. So hot. So fucking hot.”\u003c/p\u003e\n\u003cp\u003eHe grinds his hot and hard erection into my hip and I’m beginning to think maybe being this wet is not a bad thing.\u003c/p\u003e\n\u003cp\u003eFeeling my uncertainty, Nox states, “Nothing wrong with you, baby. You’re beautiful. This is beautiful.” Looking up at me through crystal-clear blue eyes, he asks, “You still want this?”\u003c/p\u003e\n\u003cp\u003eNodding immediately, I utter, “More than I want my next breath.” Without another word, his hands come low on my hips, pulling down my panties. I lift my hips and then they’re gone.\u003c/p\u003e\n\u003cp\u003eI feel so exposed. Almost as if he can see right into me. Into my soul.\u003c/p\u003e\n\u003cp\u003eMy arms come up to cross over my breasts and Nox pushes them away. “Don’t hide from me. I love looking at you. You’re beautiful, baby. Don’t hide.”\u003c/p\u003e\n\u003cp\u003eReaching up, I pull his face down to mine and kiss him. He shifts so our bodies mesh together. Me on my back and him lying on top of me. My legs part and he fits between them, our sexes come together and it’s better than anything I’ve ever felt in my life. My core pulses and I moan into his mouth, pulling him deeper into the kiss.\u003c/p\u003e\n\u003cp\u003eHis length nestles between my wet folds and he thrusts slowly. The friction against my bud sparks something primal inside of me. I lift my legs and wrap them around his hips, moaning. He picks up pace, his thrusts becoming harder and a little faster. My heart rate elevates and my chest heaves. My stomach flips around like a fish out of water. Pin prickles fan out along my spine. Tightening my legs around his hips, he pushes harder onto my sweet spot and a keening cry bursts out of me.\u003c/p\u003e\n\u003cp\u003eMy hips jerk and the spasms start. His dick nestles further into my folds and I see stars.\u003c/p\u003e\n\u003cp\u003eI’m floating in a river of ecstasy, drinking a fruity cocktail of bliss with a cute little umbrella on the side. When the contractions slow, I lean my head back on the pillow and moan, “I love sex.”\u003c/p\u003e\n\u003cp\u003eNox’s head falls onto my stomach as his body shakes with laughter. I don’t even have the energy to be embarrassed about my wanton hussiness. That was effing awesome.\u003c/p\u003e\n\u003cp\u003eAfter a moment’s recovery, Nox lifts his head and I feel his hand at my mound. His eyes meet mine. He rubs me gently, up and down, and my eyes flutter.\u003c/p\u003e\n\u003cp\u003eIt’s perfect. He knows not to be too rough right now.\u003c/p\u003e\n\u003cp\u003eMy pulse quickens and the happy feelings start to sizzle. Still soaking wet, I feel his thick finger circle my entrance, as if asking permission. I lift my hips a little and the tip of his finger slips inside.\u003c/p\u003e\n\u003cp\u003eDamn!\u003c/p\u003e\n\u003cp\u003eThat feels a little funny.\u003c/p\u003e\n\u003cp\u003eNox watches me. I watch him. His finger slides deeper inside of me and his face becomes pained. “You’re so tight.”\u003c/p\u003e\n\u003cp\u003eAnd I cringe. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eHis face turns to stunned disbelief. “Baby, that’s not a bad thing. My cocks harder than a rock. I just have no idea how I’m gonna last more than ten seconds in your sweet pussy.”\u003c/p\u003e\n\u003cp\u003eOh, wow!\u003c/p\u003e\n\u003cp\u003eI haven’t heard Nox use dirty words before and unintentionally, my core moistens again.\u003c/p\u003e\n\u003cp\u003eNox groans when he feels it and starts a motion with his finger, sliding in and out of me. He mutters, “Fuckin’ hell. She likes the dirty talk.”\u003c/p\u003e\n\u003cp\u003eMy cheeks flame, but I have no time to react when his finger slides out of me and he pushes two inside of me. A twinge of pain hits me and my eyes close in hurt.\u003c/p\u003e\n\u003cp\u003eGeez, I hope that was it.\u003c/p\u003e\n\u003cp\u003eBut Nox keeps a slow motion and eventually I enjoy the feel of two of his thick fingers inside of me. He makes a scissor like motion with his fingers inside me and the pain returns. I whisper, “Ow.”\u003c/p\u003e\n\u003cp\u003eHis eyes sad, he asks softly, “You sure you wanna do this? The first time…it hurts, baby.”\u003c/p\u003e\n\u003cp\u003ePutting on my poker face, I nod and smile. He searches my face a little while before moving up my body so the tip of his shaft kisses my wetness.\u003c/p\u003e\n\u003cp\u003eHe says gently, “Bend your knees.”\u003c/p\u003e\n\u003cp\u003eSo I do. It opens me a little more and the tip of him slides into me.\u003c/p\u003e\n\u003cp\u003eI gasp and wince. It hurts a little, but not too bad. I suppose the wetness helps. He watches me closely, “’Kay, babe?”\u003c/p\u003e\n\u003cp\u003eNodding for him to continue, I grip his upper arms for support. He slides in a little more and the pain doubles.\u003c/p\u003e\n\u003cp\u003eOh shit. This really sucks!\u003c/p\u003e\n\u003cp\u003eNever being one to mask my emotions, Nox leans forward and kisses my nose. “I’m sorry, baby. I’ll go slow.”\u003c/p\u003e\n\u003cp\u003eI breathe deeply, desperately trying to steady myself when his thick length slides a little deeper. A burning pain slithers through me and it hurts so much I whimper. He starts to pull out, but I cry out, “Just do it. Please, honey. Just do it.”\u003c/p\u003e\n\u003cp\u003eHis eyes flash with concern but I hold his stare. He swallows hard before whispering, “Shit. I’m sorry, baby.”\u003c/p\u003e\n\u003cp\u003eHe slides all the way in.\u003c/p\u003e\n\u003cp\u003eSomething rips inside of me.\u003c/p\u003e\n\u003cp\u003eAnd the pain is so intense that my mouth opens in a silent scream.\u003c/p\u003e\n\u003cp\u003eI’m being torn apart.\u003c/p\u003e\n\u003cp\u003eWrapping his arms around me, he rocks me gently. Kissing my forehead, he mutters, “Sorry, baby. I’m so sorry. Fuck. I’m sorry.”\u003c/p\u003e\n\u003cp\u003eWincing, my eyes close. Tears fall out the sides of my eyes. I could only describe the pain as agony. I cry silently, but hold Nox tight and whisper through shuddering breaths, “I’m so happy. So happy. I’m glad it was you.”\u003c/p\u003e\n\u003cp\u003eWiping my tears away, he places sweet, soft kisses at the corners of my eyes. “Don’t cry, baby. You remember what you said this morning? About it being totally stupid to fall in love with me?”\u003c/p\u003e\n\u003cp\u003eAt that, my eyes open. He adds quietly, “Then you should start calling me a fuckin’ moron.”\u003c/p\u003e\n\u003cp\u003eOvercome with emotion, I burst into tears and whisper, “Me too.” Then I close my eyes and wail, “I’m the village idiot!”\u003c/p\u003e\n\u003cp\u003eNox bursts into laughter while I continue to wail. Wiping away my tears, he smiles down at me, “We’re quite a pair, huh?”\u003c/p\u003e\n\u003cp\u003eSniffling, I answer truthfully, “I don’t think it could get better than this for me. So, yeah, we’re quite a pair. The best kind of pair.”\u003c/p\u003e\n\u003cp\u003eThen suddenly, I realize that I’m no longer hurting.\u003c/p\u003e\n\u003cp\u003eTesting out how much I’m hurting, I wrap my legs around Nox and pull up, pushing him further into me. My eyes flutter and I hear Nox growl.\u003c/p\u003e\n\u003cp\u003eOh, damn. That feels kind of amazing.\u003c/p\u003e\n\u003cp\u003eNox places his hands by my head, supporting himself over my body while I rock against him. My eyes never leave his. This is feeling good but something is missing. Leaning up, he comes down to me, kissing me hungrily. My lips part and I feel his tongue lick along the inside of my top lip. And it’s so hot that my hips buck.\u003c/p\u003e\n\u003cp\u003eAgainst his mouth, I mutter, “Baby, move. Please.”\u003c/p\u003e\n\u003cp\u003eSo he does. And although I’m sore, it feels good. The friction is deliciously addictive. He thrusts slowly and I sigh.\u003c/p\u003e\n\u003cp\u003eThis is what sex should feel like.\u003c/p\u003e\n\u003cp\u003eAs if reading my mind, Nox shares, “Amazing. And it only gets better, princess.”\u003c/p\u003e\n\u003cp\u003eMy heart rate spikes. My body suddenly desperate for more, I beg, “Faster. Harder.”\u003c/p\u003e\n\u003cp\u003eKissing my lips fiercely, his thrusts become wild and my body feels warm and light. The vein in his temple pulses, and pulling away from my lips, he murmurs, “This is gonna be quick, Lily.”\u003c/p\u003e\n\u003cp\u003eThen just as I reach up and connect our lips again, he pulls out of me. Panting, he groans into my mouth and I feel his warm come spurt onto my mound and belly.\u003c/p\u003e\n\u003cp\u003eAnd it’s then that I realize we didn’t use a condom .\u003c/p\u003e\n\u003cp\u003eSo careless. So stupid. So freakin’ idiotic.\u003c/p\u003e\n\u003cp\u003eI guess I’m just lucky that he remembered to pull out or I’d have a possible pregnancy on my hands. And although that’s an option one day, it’s not something I want now. Not wanting to break the mood, I reach up and run my fingers down his cheek. I smile up at him and bite my lip. “That was amazing.”\u003c/p\u003e\n\u003cp\u003eHis eyes warm as he smiles down at me. “You’re a liar. It was horrible, not amazing.” I laugh at myself. Leaning down, he pecks my lips as he adds a promise. “But it will be.”\u003c/p\u003e\n\u003cp\u003eRunning my nose along his, I utter sleepily, “I’ll hold you to that.”\u003c/p\u003e\n\u003cp\u003eChapter Eighteen\u003c/p\u003e\n\u003cp\u003eThe eye of the storm\u003c/p\u003e\n\u003cp\u003eLily\u003c/p\u003e\n\u003cp\u003eWaking with a smile, I bury my face deeper into the crook of Nox’s neck.\u003c/p\u003e\n\u003cp\u003e“Mornin’, babe,” he mumbles, “Feelin’ okay?”\u003c/p\u003e\n\u003cp\u003eNot really sure how I feel yet, I clench between my legs and hiss, “Ow. Not ready for another round just yet, I’m afraid.”\u003c/p\u003e\n\u003cp\u003eWrapping his arms tighter around me, he suggests, “You should have a nice warm bath. You do that and I’ll bring you some breakfast.”\u003c/p\u003e\n\u003cp\u003eRaising my head, I look at him through sleepy eyes. “You do that and I’ll never go home.” And as soon as I say it, I want to eat the words while they’re still in the air. But it’s too late.\u003c/p\u003e\n\u003cp\u003eBoth our faces fall. An awkward silence follows.\u003c/p\u003e\n\u003cp\u003eI move to roll out of bed, but his hand closes around my wrist. Pulling me back to him, he tucks me into his side and sighs, “We knew it was gonna get brought up eventually, princess. We can’t pretend forever.”\u003c/p\u003e\n\u003cp\u003eThe bridge of my nose tingles and I whisper, “But I like pretending with you.”\u003c/p\u003e\n\u003cp\u003eHe kisses the top of my head and murmurs into my hair, “Me too, baby. Me too.”\u003c/p\u003e\n\u003cp\u003eThis morning flew by.\u003c/p\u003e\n\u003cp\u003eFirst, Nox started a bath for me. I climbed into said bath and spent around half an hour relaxing my sore muscles. Some of those muscles I didn’t even know I had. Secondly, we ate breakfast together. Today was not an oatmeal kind of day, so I made pancakes and much to Nox’s obvious disgust, I drenched them in butter and syrup before wolfing them down. Mostly without chewing. Thirdly, after my sugar rush, we worked out. Today was a rare occasion where all four of us did our sessions together.\u003c/p\u003e\n\u003cp\u003eAnd Boo. Oh, Boo.\u003c/p\u003e\n\u003cp\u003eThe entire time, she kept her eyes on me. Squished face and smiling like a freakin’ dork. It got to me so badly that I threw a padded baton at her.\u003c/p\u003e\n\u003cp\u003eTalk about awkward.\u003c/p\u003e\n\u003cp\u003eAnd lastly, after our session was done, Boo pulled me into her room for the four-one-one on last night. And it went a little something like this:\u003c/p\u003e\n\u003cp\u003eBouncing on the spot, she squeaked, “Sooo. How did it go?”\u003c/p\u003e\n\u003cp\u003eIt’s a total bummer on her behalf, after all the time she took explaining things to me, but I have to be honest. “It was awful.”\u003c/p\u003e\n\u003cp\u003eHer bouncing slowed. Then stopped. Her face bunched in confusion. “What?”\u003c/p\u003e\n\u003cp\u003eNodding, I explained, “Yep. Totally sucked. It was bad. Like bad bad. And painful. And seriously awkward.”\u003c/p\u003e\n\u003cp\u003eBoo’s mouth gaped.\u003c/p\u003e\n\u003cp\u003eBut then I added, “But it was perfect.”\u003c/p\u003e\n\u003cp\u003eLooking even more confused, she mouthed, “What?”\u003c/p\u003e\n\u003cp\u003eSmiling, I uttered, “Nox. It didn’t matter how it went. It mattered that it was him. And he was so good to me. So gentle and super sweet. Saying the right things when I needed them to be said. He was so perfect that it didn’t matter how it went. I was with him. So it was perfect.” Looking up at Boo, I smiled a genuinely happy smile, trying to convey just how perfect it was.\u003c/p\u003e\n\u003cp\u003eHer lips quivered and her eyes misted. She whispered, “That’s awesome, Dee.” Clearing her throat, she added, “It gets better though. Way better. And you get better at it, too.”\u003c/p\u003e\n\u003cp\u003eLeaning back, I pursed my lips. “Shit, Boo. It couldn’t get worse.” \u003c/p\u003e","sourceLink":"https://allnovel.net/willing-captive/page-21.html","bookId":2800,"creation":"Oct 5, 2019 5:43:06 PM","modification":"Oct 5, 2019 5:43:06 PM"}
