{"id":90523,"no":26,"title":"Page 26","content":"\u003cp\u003eHe came back for me. Just like he said he would.\u003c/p\u003e\n\u003cp\u003eStepping back a moment, I look back at Rock, and say to both of them, “I’m really happy, guys. Really happy.” They both smile. I add, “But I need answers.” My breath hitches, and my eyes burn. “Because I don’t know if I can get past this.”\u003c/p\u003e\n\u003cp\u003eRock nods in agreement while Nox runs a hand over his face. I don’t think I’m going to like what I hear.\u003c/p\u003e\n\u003cp\u003eRock starts, “We never lied to you, Lily. We thought he was dead.”\u003c/p\u003e\n\u003cp\u003eOkay. Good. Well, not good, but at least I know they didn’t lie to me on purpose.\u003c/p\u003e\n\u003cp\u003eNox rubs a hand at the back of his neck in restlessness. “I know you need to know, so maybe you can sit down for this. It’s kinda long.”\u003c/p\u003e\n\u003cp\u003eMoving to sit at the opposite end of the sofa, Nox looks hurt that I want to be so far away from him. It’s still so unreal. I’m nervous and scared. All I really want to do is jump onto his lap and kiss him until I can’t remember the last six months.\u003c/p\u003e\n\u003cp\u003eHe starts, “Okay. When the first explosion went off, and the windows were blown out, I saw something in the backyard. That’s why I told you to go with Boo. And when you finally did, I made my way out there, and realized it was Jett Harrison.”\u003c/p\u003e\n\u003cp\u003eNodding, I tell him, “Terah told me he had shrapnel all over his body.”\u003c/p\u003e\n\u003cp\u003eNox agrees, “Yeah. He was cut up pretty bad.”\u003c/p\u003e\n\u003cp\u003e“She said he died from it.”\u003c/p\u003e\n\u003cp\u003eBoth Rock and Nox shake their heads.\u003c/p\u003e\n\u003cp\u003eI’m confused. Terah wouldn’t lie to me.\u003c/p\u003e\n\u003cp\u003eI’m about to ask the question when Nox says clinically, “I killed him.”\u003c/p\u003e\n\u003cp\u003eMy body breaks out in goosebumps, and I suck in a quick breath. I exhale, “Oh.”\u003c/p\u003e\n\u003cp\u003eLooking down at his hands, he plays with a finger nervously. “He was there. In the back, all cut up. Gun in hand, ready to shoot. In pain, as he was, he didn’t see me coming. I picked up a shard of glass, and ran it through him.” He lifts his head. “Not sorry I did it.”\u003c/p\u003e\n\u003cp\u003eNeither am I.\u003c/p\u003e\n\u003cp\u003eRock adds, “That’s when the rest of the explosions went off. The house started collapsing, and…” He trails off and looks at Nox.\u003c/p\u003e\n\u003cp\u003eNox continues, “And it got me. Rafters collapsed on me. I don’t really remember much after that.”\u003c/p\u003e\n\u003cp\u003eNo. That’s not good enough.\u003c/p\u003e\n\u003cp\u003eMy face must convey this, because Nox explains, “The only person who knew I was alive was Mitch. And he didn’t tell anyone. Not a soul, babe.”\u003c/p\u003e\n\u003cp\u003e“Why?” I’m starting to dislike this Mitch.\u003c/p\u003e\n\u003cp\u003eNox looks me in the eye. “Because it was bad.” My eyes turn sad. “He didn’t know if I’d make it. I spent almost three months in an induced coma due to my brain swelling. My injuries were extensive. I have minor brain damage. I don’t remember or react to things like I used to. I’m still doing daily physical therapy.”\u003c/p\u003e\n\u003cp\u003eHe blinks a moment, as if he forgot what he was saying.\u003c/p\u003e\n\u003cp\u003eAnd it breaks my heart.\u003c/p\u003e\n\u003cp\u003eScooching closer to him, our knees touch, and I slide my hand into his. I prompt, “You’re still doing physical therapy?”\u003c/p\u003e\n\u003cp\u003eLooking embarrassed, he shakes his head. “Yeah. I’ve wanted to see you from the second I woke up. But I couldn’t, babe. If I could’ve, I would’ve.” He grins, “Learning to walk again is hard.”\u003c/p\u003e\n\u003cp\u003eOh shit.\u003c/p\u003e\n\u003cp\u003eI whisper, “I’m sorry, honey.”\u003c/p\u003e\n\u003cp\u003eHe smiles a megawatt smile, and suddenly I’m pissed. Gripping his hand tighter, I move even closer to him and turn to Rock. “So Mitch just decided to plant his DNA and fake his death?”\u003c/p\u003e\n\u003cp\u003eThe air in the room changes. I don’t know what I just said, but it’s obviously a touchy subject.\u003c/p\u003e\n\u003cp\u003eNox clears his throat. “No, princess. He didn’t plant my DNA. It was there, in the house.”\u003c/p\u003e\n\u003cp\u003eMy brows furrow in confusion.\u003c/p\u003e\n\u003cp\u003eNox lifts the right side of his pants leg.\u003c/p\u003e\n\u003cp\u003eLooking down, I cover my mouth with my hands and gasp.\u003c/p\u003e\n\u003cp\u003eMy heart races.\u003c/p\u003e\n\u003cp\u003eClosing my eyes, I bury my face in my hands and sob. I stutter through tears, “I- I- I’m sorry, honey. So sorry.”\u003c/p\u003e\n\u003cp\u003eHis arms come around me, and pull me to him. I wrap my arms around him, and bury my face in his neck. “So sorry, babe.”\u003c/p\u003e\n\u003cp\u003eHe rubs my back and explains gently, “It’s not that bad. It could’ve been worse. Prosthetics are actually pretty advanced these days. It took a little while to get used to, but I’ve got the hang of it. My body’s just weak from being in a coma, and I need to build up my strength again. The brain damage…that’s something they don’t know about. It varies with every case. I’m really just a little forgetful.”\u003c/p\u003e\n\u003cp\u003eWithout thinking, I pull back and blurt out, “We need to move. This place isn’t big enough for both of us, and you’ll need room to do PT. I’ll see if we can find a house to rent or something. Okay?”\u003c/p\u003e\n\u003cp\u003eHis brows rise in shock. Then his face softens. Placing his forehead on mine, he asks, “You wanna live with me?”\u003c/p\u003e\n\u003cp\u003eIt takes everything I have not to karate chop him for asking such a dumb question. I probe, “Do you love me?”\u003c/p\u003e\n\u003cp\u003eWithout hesitation, he answers, “More than anything in my life.” He confides, “It was so hard in recovery. So many times I wanted to give up. Give in. Every time I told myself I couldn’t do it anymore, I thought about you. And how proud you’d be of me for doing it, even though it was so fucking hard.”\u003c/p\u003e\n\u003cp\u003eMy eyes close, and I breathe deeply, trying desperately to control my emotions. I say softly, “I am. I’m so proud of you.”\u003c/p\u003e\n\u003cp\u003eThen my body reacts on its own accord. Leaning forward, I very softly press my lips to his. His hands slide up my neck and into my hair, tangling his fingers through it, deepening our kiss.\u003c/p\u003e\n\u003cp\u003eElation. Pure joy.\u003c/p\u003e\n\u003cp\u003eSomeone coughs.\u003c/p\u003e\n\u003cp\u003eShit. I forgot Rock was here.\u003c/p\u003e\n\u003cp\u003eStanding, he smiles, “If you guys are good, I have to get back.”\u003c/p\u003e\n\u003cp\u003eTurning to Nox, then back to Rock, I stand and make my way over to him. Already waiting with open arms, I all but run into his hug. He holds me tight and rocks me from side to side. I whisper, “Thank you, honey. Thank you so much.”\u003c/p\u003e\n\u003cp\u003eHe kisses my hair. “Anytime, babe. Love you.”\u003c/p\u003e\n\u003cp\u003eKissing his cheek, I utter, “Love you, too. Tell Boo I miss her. And- and that it hurts me, too.”\u003c/p\u003e\n\u003cp\u003eRock breathes deep. “He’s got a bag full of clothes by the door. I didn’t know how today was gonna go, so…”\u003c/p\u003e\n\u003cp\u003eHe trails off, and I whisper, “This is one of the best days of my life.”\u003c/p\u003e\n\u003cp\u003eAnd he beams.\u003c/p\u003e\n\u003cp\u003eReleasing me, he walks over to Nox who struggles to stand. Rock helps him. They man hug, but it’s not awkward or short. They grip each other tightly for a few seconds before Rock releases him and says, “Don’t give her too much shit, man. If I hear you’re giving her trouble, I’ll take care of you myself.”\u003c/p\u003e\n\u003cp\u003eNox laughs. “Yeah, you might have to come get me when she gets sick of my ass.”\u003c/p\u003e\n\u003cp\u003eAnd even though it sounds like a joke, I know it isn’t. It breaks my heart. Where did the confident, assured man I loved go?\u003c/p\u003e\n\u003cp\u003eMy heart tells me he’s still stuck somewhere in the rubble of the safe house.\u003c/p\u003e\n\u003cp\u003eI think it might be right.\u003c/p\u003e\n\u003cp\u003eWalking Rock to the door, I wave him off before turning to my man.\u003c/p\u003e\n\u003cp\u003eHe sits on the sofa looking uncertain and almost shy. Smiling softly, I tell him, “Right now, there’s no place I’d rather be than in bed with you.” His eyes flash. I ask, “Wanna get some sleep with me?”\u003c/p\u003e\n\u003cp\u003eReaching for his cane, he takes his time standing. Walking over to him, I wrap my arm around his waist and hold him close. The hand holding the cane shakes slightly and it makes my heart hurt. We walk down the hall to my room, and I help him out of his jacket. When I move to undo the top button of his jeans, he pulls my hand away and almost barks. “No.”\u003c/p\u003e\n\u003cp\u003eAnd it shocks me. So much that I step back from him with a hand on my chest.\u003c/p\u003e\n\u003cp\u003eLifting his head, he takes one look at me, and closes his eyes on a sigh. “Been back an hour and I’m already fucking things up.” Rubbing absently at his chest, he clears his throat and explains, “I don’t like people touching my leg. Or even seeing it. It affects me a lot. So much that I suffer anxiety.”\u003c/p\u003e\n\u003cp\u003eHe looks ashamed and embarrassed. And my gut rolls from the sight of him.\u003c/p\u003e\n\u003cp\u003eMy hand drops to my side, and I approach him cautiously. The vein in his temple throbs, and I know he’s likely freaking out. When we meet toe-to-toe, I lift my arms and wrap them around his waist, resting my cheek on his chest. I breathe him in.\u003c/p\u003e\n\u003cp\u003eSame smell. Same everything. Almost.\u003c/p\u003e\n\u003cp\u003eMemories flood back. Silently chuckling, I ask, “Remember when I got drunk?”\u003c/p\u003e\n\u003cp\u003eHe barks out a startled laugh. “Yeah. I do.” He strokes my hair. “My little hussy.” And I burst into laughter.\u003c/p\u003e\n\u003cp\u003eSuddenly, the teetering wall of awkwardness is broken.\u003c/p\u003e\n\u003cp\u003eWe hold each other, laughing, and I look up into his smiling eyes. My face falls, and I speak around my thick throat. “Thought you were dead.”\u003c/p\u003e\n\u003cp\u003eHis smiling eyes turn troubled. “I know, baby. I’m so sorry I didn’t come earlier.”\u003c/p\u003e\n\u003cp\u003eSniffling, I utter, “No. You did what you had to do, and I’m just grateful that I’ve got you back. I don’t care about anything else.” Reaching up, I cup his cheek, stroking his jaw with my thumb. “What I do know is that I never want to be without you ever again. So I’m doing something right now that I should’ve done when I had you.”\u003c/p\u003e\n\u003cp\u003eStepping back from him, I kneel, and he chokes out a startled laugh. Smiling like an idiot, I ask, “Adam Christian Taylor, born March eighteenth, nineteen-eighty-four in White Deer, Texas. I love you, and I will spend the rest of my life showing you just how much if you agree to marry me. I want you for life. You were never a fling or something to pass time. You mean the world to me. And I would be honored if you would be my husband.”\u003c/p\u003e\n\u003cp\u003eFace void, Nox staggers back towards the bed, sitting, leaving me kneeling in the middle of the floor.\u003c/p\u003e\n\u003cp\u003e…Awkward.\u003c/p\u003e\n\u003cp\u003eHe says, “Come here, Lily,” and pats his thigh.\u003c/p\u003e\n\u003cp\u003eA little hurt at his lack of enthusiasm, I pout and stay where I am. Giving me a firm look, he pats his thigh again and says, “I said get over here, Lily.” And it’s so much like the old Nox that I stand immediately, and move over to him.\u003c/p\u003e\n\u003cp\u003eWhen I’m a foot away from him, he takes hold of my wrist and pulls me down onto his lap. Immediately worried about his leg, I blurt out, “I don’t want to hurt you.”\u003c/p\u003e\n\u003cp\u003eAnd what he says next makes me warm all over. “Been hurting a long time. You can’t see this type of hurt, though. Broken hearts don’t mend easily. And you’re not hurting me right now, baby. But even if you were, it would hurt so sweet.” Turning to face him, I kiss his lips softly and sigh. He pulls back a little. “Also, I love that you love me enough to want to marry me, but where I come from, it’s a man’s duty to ask. And I love knowing that when I’m good and ready to propose to my girl, she’ll say yes. But I don’t have a lot left to give, so please give me this, and let me do it in my own time.” He leans into my hair and murmurs, “But it’ll come soon, baby. After all this, I know I can’t live without you.”\u003c/p\u003e\n\u003cp\u003eAnd just like that, my hurt pride shrugs and smiles while giving me a thumbs up.\u003c/p\u003e\n\u003cp\u003eMy eyes crinkle, and I place a slow kiss on his cheek. I answer softly, “Okay, honey.”\u003c/p\u003e\n\u003cp\u003eHe reaches into his pocket and smiles. “Good. Because this ring has been weighing me down for three months.”\u003c/p\u003e\n\u003cp\u003eMy eyes widen, and my mouth gapes, as I watch him open the red velvet box.\u003c/p\u003e\n\u003cp\u003eThe white gold ring is simple and elegant, with a row of baguette diamonds across the top.\u003c/p\u003e\n\u003cp\u003eBiting my lip, I squeak and he laughs while asking, “Delilah Flynn. I love you more than I thought possible. I want to live the rest of my life with you, if you’ll have me.” Just about to answer, he adds, “I don’t know if I’ll ever be the man I was before. I just want you to know that, because I’ll understand if you don’t want a damaged man as a husband.”\u003c/p\u003e\n\u003cp\u003eNot even bothering to acknowledge that last statement, I bend down as he reaches up.\u003c/p\u003e\n\u003cp\u003eOur lips meet in a slow but deep kiss and I mutter against him, “I can’t wait to be Lily Taylor.”\u003c/p\u003e\n\u003cp\u003eI feel him smile against my mouth. Pecking my lips, he asks something that makes me go rigid. “Want to meet my mom?”\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Four\u003c/p\u003e\n\u003cp\u003eParental Units\u003c/p\u003e\n\u003cp\u003eTwo weeks later…\u003c/p\u003e\n\u003cp\u003eLily\u003c/p\u003e\n\u003cp\u003eNox drives up to the place I used to call home, and I smile remembering this is where we first met.\u003c/p\u003e\n\u003cp\u003eMy fiancé didn’t like the fact that my dad and I have grown apart, so he came up with an idea that will, hopefully, bring us all together again. He requested a family dinner.\u003c/p\u003e\n\u003cp\u003eThat’s right. Nox requested a family dinner.\u003c/p\u003e\n\u003cp\u003eHe also filled me in on a little secret that no one knows about. His mom always knew her son was alive. And I came to know this when we went to visit her last week. I was nervous and a total mess. Nox laughed at me, “Babe, seriously. She knows all about you. I send her letters every week. She already loves you.”\u003c/p\u003e\n\u003cp\u003eI scoffed, “Oh, sure! She loves the little harlot that almost got her son killed!”\u003c/p\u003e\n\u003cp\u003eHe gave me the stink eye. “Don’t ever say that again. Ever.”\u003c/p\u003e\n\u003cp\u003eRolling my eyes, I turned my head and wore a secret smile.\u003c/p\u003e\n\u003cp\u003eEvery day I was getting a piece of the old Nox back. More bossiness and less doubt. I was loving every second of rediscovering my man.\u003c/p\u003e\n\u003cp\u003eWe had yet to do the deed again, but I was willing to be as patient as possible, especially after witnessing a full-blown anxiety attack that was so bad, that I had to strip him and wipe his shaking body down with a cool cloth.\u003c/p\u003e\n\u003cp\u003eIt seems Nox has nightmares. He says they’re getting better, and I’m inclined to believe him because in that first week, he had three, and this week, he hasn’t had a single one.\u003c/p\u003e\n\u003cp\u003eBut watching my man be all determined and strong is seriously winding me up. I can’t wait until we get back to the bedroom. \u003c/p\u003e","sourceLink":"https://allnovel.net/willing-captive/page-26.html","bookId":2800,"creation":"Oct 5, 2019 5:43:06 PM","modification":"Oct 5, 2019 5:43:06 PM"}
