{"id":90526,"no":29,"title":"Page 29","content":"\u003cp\u003eAccording to the Army (thanks to Mitch), Adam Christian Taylor went missing during a mission some years ago. He was declared dead with no body being found. Turns out, he was alive the whole time. He was found six months ago, gravely wounded and with a case of hardcore amnesia.\u003c/p\u003e\n\u003cp\u003eWink, wink.\u003c/p\u003e\n\u003cp\u003eAnd Nox hates it.\u003c/p\u003e\n\u003cp\u003eBut it was the only story Mitch insisted would work for Nox to have his old identity back. What Nox hates is being thanked for something he never did.\u003c/p\u003e\n\u003cp\u003eSteeling his jaw, he says, “Don’t thank me, sir.”\u003c/p\u003e\n\u003cp\u003eThe judge smiles, “’Course not. Just doing your duty.”\u003c/p\u003e\n\u003cp\u003eTerah takes hold of Nox’s hand, clearly trying to save him. She says to the judge, “I’m sorry, do you mind if I steal them away for some photos? Mom’s getting snappy happy .”\u003c/p\u003e\n\u003cp\u003eThe judge chuckles, “Not at all, dear.” He turns to us both. “I hope you have a long and happy life together. Truly, I do.”\u003c/p\u003e\n\u003cp\u003eWith that, we leave the courthouse and make our way to a local park.\u003c/p\u003e\n\u003cp\u003eA gazillion photos later, we head to the restaurant for our wedding dinner with our family. And when we get there, Nox pulls me back a little. “I don’t want any crying, babe.”\u003c/p\u003e\n\u003cp\u003eWhat?\u003c/p\u003e\n\u003cp\u003eShaking my head, I ask chuckling, “Why would I cry? I’m so effing happy, you dork!”\u003c/p\u003e\n\u003cp\u003e“Yeah, well-” Nox looks passed me and smiles, “Yeah. You’re gonna cry.”\u003c/p\u003e\n\u003cp\u003eTurning, I gasp in shock.\u003c/p\u003e\n\u003cp\u003eNo way. No way!\u003c/p\u003e\n\u003cp\u003eRock and Boo stand there , dressed to the nines, ready to celebrate with us.\u003c/p\u003e\n\u003cp\u003eAnd, of course, it happens.\u003c/p\u003e\n\u003cp\u003eMy eyes tingle for a whole second before I cover my mouth with my hand and burst into tears.\u003c/p\u003e\n\u003cp\u003eBoo rushes forward, dressed in a long tawny-pink number. She looks great. Taking me in a warm hug, I feel her body shake with mine. Crying happy tears.\u003c/p\u003e\n\u003cp\u003eRock pulls her away from me a second, only to wrap me up tight. He looks good in slacks and a grey shirt. Wiping my tears away, I announce, “You two look so effing hot!”\u003c/p\u003e\n\u003cp\u003eBoo barks a laugh, “Damn, Deedee. Never thought I could see someone look so beautiful before, but…” She motions to my very plain wedding dress and shrugs. Rock finishes for her, “You look like an angel, babe.”\u003c/p\u003e\n\u003cp\u003eMy heart warms.\u003c/p\u003e\n\u003cp\u003eI’m so happy right now!\u003c/p\u003e\n\u003cp\u003eClare comes forward with her hands on her hips and wide eyes, “Adam, we’re going to have words later. Why didn’t you tell me they were coming?”\u003c/p\u003e\n\u003cp\u003eRock smiles big and opens his arms to her, “Mama!”\u003c/p\u003e\n\u003cp\u003eBoo knocks him aside, “Wait in line, bub!” Then she runs to Clare, “Mama!”\u003c/p\u003e\n\u003cp\u003eI should’ve known they’d met before. Mama talked about them when we went to visit her that first time, but had never said she’d actually seen them in person.\u003c/p\u003e\n\u003cp\u003eWe approach our table, and everyone is introduced to each other. We spend the next hour chatting away and having a great time.\u003c/p\u003e\n\u003cp\u003eIt’s relaxed and low key.\u003c/p\u003e\n\u003cp\u003eAnd I love it.\u003c/p\u003e\n\u003cp\u003eNox and I decided to go against tradition. We wanted a small wedding and we wanted to pay for it ourselves. I know I come from money, but this was important to me. My independence means everything to me.\u003c/p\u003e\n\u003cp\u003eEveryone orders what they want for dinner (which is something my dad insisted on paying for and Nox agreed on) and I sit back a moment, taking in everything around me.\u003c/p\u003e\n\u003cp\u003eLooking around, I smile softly. Terah and Jon talk closely together, holding hands. Boo and Rock talk loudly and animatedly, obviously arguing about something stupid. Like always. Mom and Dad chat away to Clare. And Nox…\u003c/p\u003e\n\u003cp\u003eI turn to my husband.\u003c/p\u003e\n\u003cp\u003eI find him watching me with that gorgeous crooked smile in place.\u003c/p\u003e\n\u003cp\u003eLeaning close to me, he says, “Hey.”\u003c/p\u003e\n\u003cp\u003eMoving even closer to him, our noses touch, and I whisper, “Hi.”\u003c/p\u003e\n\u003cp\u003eHe kisses my lips gently, and my eyes close in sheer delight. I sigh through my nose and kiss him deeper. Pulling away gently, he asks on a grin, “So when are you gonna give me babies?”\u003c/p\u003e\n\u003cp\u003eAlmost choking on my tongue, I laugh quietly, “Not anytime soon. Maybe in a couple of years. You know, when I’ve had enough time to enjoy you.”\u003c/p\u003e\n\u003cp\u003eHis hand rests on my thigh and he squeezes. “I’m down for that.”\u003c/p\u003e\n\u003cp\u003eSmiling like an idiot, I rub my nose against his. “Good. Because even though I love kids, I’m not ready for them yet.”\u003c/p\u003e\n\u003cp\u003eKissing my lips once, he utters, “That’s fair, baby. Whatever you want, I’m good with.”\u003c/p\u003e\n\u003cp\u003eSuddenly, he asks seriously, “Are you happy?”\u003c/p\u003e\n\u003cp\u003eMy heart expands and warms.\u003c/p\u003e\n\u003cp\u003e“Yes. Completely.” I lose my smile. “Are you?”\u003c/p\u003e\n\u003cp\u003eHe thinks a moment, his brows furrowed. “Can’t think of a time I was even half as happy as today.”\u003c/p\u003e\n\u003cp\u003eMy heart stutters and I get dreamy-happy.\u003c/p\u003e\n\u003cp\u003eI watch as he looks around the table and smiles. Turning back to me, he wraps an arm around my shoulders and pulls me close. Kissing the top of my head, he utters, “Nothing’s gonna beat today. Got everyone I care about close, and that’s never happened in my life. I hate to say it, babe…” Looking at me with dead seriousness, he continues, “Never thought I’d be glad about having to protect someone. But, fuck me, I totally am. Hate what we went through to get here. But…we’re here. And that’s all I care about.”\u003c/p\u003e\n\u003cp\u003eLeaning my forehead into the side of his chin, I say softly, “Love you, Nox.”\u003c/p\u003e\n\u003cp\u003eHe sighs, “Love you more, princess. You have no idea how much.”\u003c/p\u003e\n\u003cp\u003eI close my eyes tightly, put a hand to his thigh and squeeze.\u003c/p\u003e\n\u003cp\u003eYeah.\u003c/p\u003e\n\u003cp\u003eI’m pretty sure I do.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eTwo years later…\u003c/p\u003e\n\u003cp\u003eNox\u003c/p\u003e\n\u003cp\u003eComing back from my run, I huff and puff while I make my way into our house.\u003c/p\u003e\n\u003cp\u003eMy heart pounds.\u003c/p\u003e\n\u003cp\u003eToday was a good one. I beat my personal best and I managed that on my new prosthetic running leg.\u003c/p\u003e\n\u003cp\u003eIt’s so fuckin’ cool. It’s an L shaped piece of carbon-fiber that makes me bounce more than run.\u003c/p\u003e\n\u003cp\u003eAnd I’m loving it. But I’m tired as hell now.\u003c/p\u003e\n\u003cp\u003eLily and I bought a house not too long after we got married. She was right. The apartment was too small. We needed a place where I could have a room as a gym, and eventually a nursery.\u003c/p\u003e\n\u003cp\u003eOur house is a modest four bedroom home in the suburbs.\u003c/p\u003e\n\u003cp\u003eIt took Mitch a little time to have my money cleaned and put into an account in my real name. Regardless of how much money we have, Lily insists on working. I don’t think this is a bad thing. In fact, I like that she knows what she wants. Although, I am surprised as hell that she went back to work with her dad at Flynn Logistics.\u003c/p\u003e\n\u003cp\u003eShe’s working her way up. And fast. In the past year, she’s had three promotions.\u003c/p\u003e\n\u003cp\u003eAnd this isn’t because she’s Daddy’s girl. It’s because she works damn hard, and she’s smart as hell.\u003c/p\u003e\n\u003cp\u003eI’m so proud of her.\u003c/p\u003e\n\u003cp\u003eI, however, am retired.\u003c/p\u003e\n\u003cp\u003eI’ve worked enough in my young life to realize that I was missing out on too much. So now, I enjoy my life with Lily.\u003c/p\u003e\n\u003cp\u003e“Lily?” I yell this into the kitchen.\u003c/p\u003e\n\u003cp\u003eNo answer. Walking down the hall and out the back door, I find her. Smiling, I take a look at what she’s doing and chuckle.\u003c/p\u003e\n\u003cp\u003eI walk down the steps to her, and take the clothes out of her hands. “Let me do that. It’s too high up for you.”\u003c/p\u003e\n\u003cp\u003eLily smiles at me like I’m her hero.\u003c/p\u003e\n\u003cp\u003eAlways her hero.\u003c/p\u003e\n\u003cp\u003eAll I did was hang some wet clothes for her.\u003c/p\u003e\n\u003cp\u003eShe asks, “So? How was it?”\u003c/p\u003e\n\u003cp\u003eStill catching my breath, I huff out a laugh. “Like running on water. So damn good. I don’t think I’ll ever take this one off.”\u003c/p\u003e\n\u003cp\u003eAnd she grins, “Maybe I can give you a reason to take it off.”\u003c/p\u003e\n\u003cp\u003eMy brows rise.\u003c/p\u003e\n\u003cp\u003eTurning, I ask hoarsely, “Oh yeah? How baby?”\u003c/p\u003e\n\u003cp\u003eLooking left, then right, she crooks her finger. Leaning down to her, she reaches up and cups my cheeks. She presses her lips to mine, and I breathe her in.\u003c/p\u003e\n\u003cp\u003eMy wife is amazing.\u003c/p\u003e\n\u003cp\u003ePulling back a little, she whispers, “I’ve got an itch that needs scratching.”\u003c/p\u003e\n\u003cp\u003ePlaying with her, my face turns serious. “Where is this itch?”\u003c/p\u003e\n\u003cp\u003eThe apples of her cheeks flush pink.\u003c/p\u003e\n\u003cp\u003eI love when they do that.\u003c/p\u003e\n\u003cp\u003eLicking her pink lips, her smiling, green eyes meet mine. “I need to show you somewhere I can lie down. The bedroom would be a good place to start.”\u003c/p\u003e\n\u003cp\u003eA good place to start?\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eShe had me at itch.\u003c/p\u003e\n\u003cp\u003eTurning, her hair swishes down her back, and I feel myself start to harden.\u003c/p\u003e\n\u003cp\u003eFuckin’ love that hair.\u003c/p\u003e\n\u003cp\u003eI watch her ass sway as she walks up the steps, and into the house.\u003c/p\u003e\n\u003cp\u003eTired?\u003c/p\u003e\n\u003cp\u003eNope.\u003c/p\u003e\n\u003cp\u003eNot anymore.\u003c/p\u003e\n\u003cp\u003eLily\u003c/p\u003e\n\u003cp\u003eAfter this afternoon’s spectacular love making, Nox left me to sleep it off. And I needed it.\u003c/p\u003e\n\u003cp\u003eThe man is insatiable.\u003c/p\u003e\n\u003cp\u003e…Oh, who am I kidding?\u003c/p\u003e\n\u003cp\u003eI’m just as bad.\u003c/p\u003e\n\u003cp\u003eMaybe worse.\u003c/p\u003e\n\u003cp\u003eRecently, it’s gotten really bad. I feel like such a hussy! But my husband loves me, and is always willing to help me scratch my itch.\u003c/p\u003e\n\u003cp\u003eSmiling like an idiot, I feel a small sharp pain in my belly.\u003c/p\u003e\n\u003cp\u003eOoh. That was not so nice.\u003c/p\u003e\n\u003cp\u003eThen another. And another.\u003c/p\u003e\n\u003cp\u003eStanding on wobbly legs, I make my way out to the hall.\u003c/p\u003e\n\u003cp\u003eLooking down at my feet, my eyes widen to the size of saucers.\u003c/p\u003e\n\u003cp\u003eOh shit.\u003c/p\u003e\n\u003cp\u003eNox\u003c/p\u003e\n\u003cp\u003e“Mom, I can’t tell her to stop working. It makes her happy. Do you think she’d even listen to me if I asked?” I say into the cell phone.\u003c/p\u003e\n\u003cp\u003eMom responds, “She won’t listen, but it doesn’t mean you don’t have to try. She’s in a delicate stage at this point, baby. You helping her out?”\u003c/p\u003e\n\u003cp\u003eSomewhat proud of myself, I state, “Hung the washing for her just this afternoon.”\u003c/p\u003e\n\u003cp\u003e“Nox.”\u003c/p\u003e\n\u003cp\u003eI can almost see Mama’s smile, “That’s my good boy.”\u003c/p\u003e\n\u003cp\u003eLeaning back on my chair, I admit, “I like helping her, anyways, it makes me feel like I’m doing something.”\u003c/p\u003e\n\u003cp\u003e“Nox.”\u003c/p\u003e\n\u003cp\u003eMom replies, “Oh baby, you’ve already worked too hard. You deserve a rest. Enjoy your time at home. You never were a lazy man. Maybe you could volunteer somewhere if you feel like you’re not doing anything useful.”\u003c/p\u003e\n\u003cp\u003e“Nox.”\u003c/p\u003e\n\u003cp\u003eI purse my lips as my brows rise. “That’s actually not a bad idea, Mama. I’ll make some enquiries come Monday.”\u003c/p\u003e\n\u003cp\u003e“Adam Christian Taylor!” Lily shouts.\u003c/p\u003e\n\u003cp\u003eMy brows furrow. “Hold on, Mama.” Turning to my wife, who stands at the end of the hall, I ask, “What is it, princess?”\u003c/p\u003e\n\u003cp\u003eSniffling and smiling, she states, “My water just broke.”\u003c/p\u003e\n\u003cp\u003eMy mouth gapes.\u003c/p\u003e\n\u003cp\u003eLily takes one look at my face and bursts into laughter, covering her mouth with her hand. Placing the other hand on her swollen belly, she nods. “Seriously. Just now.”\u003c/p\u003e\n\u003cp\u003eSuddenly panicked, I shout into the phone, “Lily’s water just broke, Mom! What do we do?”\u003c/p\u003e\n\u003cp\u003eMama chuckles, “Oh baby! It’s finally happening!” She suddenly becomes stern. “Don’t you panic, boy. Ya hear? You stay cool and calm for your wife. She needs you to be strong right now so she can leech off of it when she doesn’t have any strength left inside-a her.”\u003c/p\u003e\n\u003cp\u003eMy mom’s smart.\u003c/p\u003e\n\u003cp\u003eImmediately calming, I look over to a smiling Lily and state with a grin, “Gotta go, Mama. Having a baby.”\u003c/p\u003e\n\u003cp\u003eMom clucks, “You send Lily my love and call me as soon as he or she is here.”\u003c/p\u003e\n\u003cp\u003e“Okay, Mama. Love you.”\u003c/p\u003e\n\u003cp\u003e“Love you too, baby.”\u003c/p\u003e\n\u003cp\u003eLily bites her lip and says, “I think we should go.”\u003c/p\u003e\n\u003cp\u003eStanding, I take the keys to the car, pick up the pre-packed overnight bag, and walk over to my wife. Kissing her on her smiling lips, I agree, “Yeah, princess. Let’s do it.”\u003c/p\u003e\n\u003cp\u003eWrapping her arm around my waist, she squeezes tightly and hisses out a breath. “Dammit, that hurts!”\u003c/p\u003e\n\u003cp\u003eAnd I can’t help but chuckle.\u003c/p\u003e\n\u003cp\u003eI think she said the same thing the first time we made love.\u003c/p\u003e\n\u003cp\u003eRock\u003c/p\u003e\n\u003cp\u003eDear Uncle Rock,\u003c/p\u003e\n\u003cp\u003eMy name is Rocco Lennox Taylor.\u003c/p\u003e\n\u003cp\u003eWe haven’t met before, but my mom and dad talk about you and Aunt Boo all the time.\u003c/p\u003e\n\u003cp\u003eI was born only last week and I have a favor to ask.\u003c/p\u003e\n\u003cp\u003eYou see, I need a set of godparents. According to Mom and Dad, there aren’t a finer pair of people for the job than Aunt Boo and yourself.\u003c/p\u003e\n\u003cp\u003eMaybe I should tell you a little about myself. I weigh ten pounds even and am almost 20 inches long. I have spiky black hair, and my daddy’s blue eyes.\u003c/p\u003e\n\u003cp\u003eI love to eat and sleep at this point, not much more.\u003c/p\u003e\n\u003cp\u003eIf you think you’d like to take this mission, we’ll be celebrating my Christening in two weeks at our local church, here in California.\u003c/p\u003e\n\u003cp\u003eMy daddy says you know where we live, and that you’re always welcome.\u003c/p\u003e\n\u003cp\u003eMommy says if you can’t make it, it’s okay. Aunt Terah and Uncle Jon are acting as backups just in case.\u003c/p\u003e\n\u003cp\u003eI really hope you can make it. I’d really like to meet my namesake. If not now, then soon.\u003c/p\u003e\n\u003cp\u003eLots of love,\u003c/p\u003e\n\u003cp\u003eRocco\u003c/p\u003e\n\u003cp\u003eP.S. My fingers are way too tiny to be writing. This letter was written by my mommy.\u003c/p\u003e\n\u003cp\u003e“Shit.”\u003c/p\u003e\n\u003cp\u003eMy eyes blur and my throat thickens .\u003c/p\u003e\n\u003cp\u003eI re-read the letter.\u003c/p\u003e\n\u003cp\u003eCovering my face with a hand, I cry like a little bitch.\u003c/p\u003e\n\u003cp\u003eClearing my throat, I wipe my eyes, take the letter, and walk out of my room.\u003c/p\u003e\n\u003cp\u003eSmiling, I yell out, “Boo! Got some good news, babe…”\u003c/p\u003e\n\u003cp\u003eThe End \u003c/p\u003e","sourceLink":"https://allnovel.net/willing-captive/page-29.html","bookId":2800,"creation":"Oct 5, 2019 5:43:06 PM","modification":"Oct 5, 2019 5:43:06 PM"}
