{"id":84038,"no":16,"title":"Page 16","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eKatie grinned, but then it faded as she saw a sign for a town.\u003c/p\u003e\n\u003cp\u003e\"Checkersville. What do Ralph\u0027s notes say?\"\u003c/p\u003e\n\u003cp\u003eJenni immediately grew serious and studied the map. \"Ralph made a note that it’s got a small population. It\u0027s Emorton we need to worry about. It\u0027s a lot bigger.\"\u003c/p\u003e\n\u003cp\u003eKatie sighed, noting that according to the road sign they were ten miles out of Emorton. \"Okay, get ready.\"\u003c/p\u003e\n\u003cp\u003eJenni dutifully drew her gun and snapped off the safety.\u003c/p\u003e\n\u003cp\u003eThey hit the small town at seventy miles per hour. It was two blocks long in both directions and appeared completely deserted. The truck cleared the first block and Katie expertly swung it around a car stalled in the middle of the intersection.\u003c/p\u003e\n\u003cp\u003e\"So far so good,\" Jenni said with relief.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t curse it,\" Katie chided her and the truck started down the second block.\u003c/p\u003e\n\u003cp\u003eA man broke free of a building ahead of them, running fast, and screaming. It was not a zombie scream, but \"Stop! Stop!\"\u003c/p\u003e\n\u003cp\u003eThe truck sailed past him in a flash and Katie slammed on the brakes and shifted into reverse.\u003c/p\u003e\n\u003cp\u003e\"Get ready to open the door, Jenni.\"\u003c/p\u003e\n\u003cp\u003eJenni whipped around in her seat as Jack raised his head blearily, curious as to the drama.\u003c/p\u003e\n\u003cp\u003eThe man ran toward the stopped truck, sobbing, and clutching one of his arms. It was a mangled mess.\u003c/p\u003e\n\u003cp\u003e\"Go.\" Jenni said softly.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s infected.\"\u003c/p\u003e\n\u003cp\u003eKatie looked into the review mirror, saw the man\u0027s arm and slammed her fists hard against the steering wheel. \"Fuckfuckfuckfuckfuck.\"\u003c/p\u003e\n\u003cp\u003eThe man drew near the truck, waving his good arm, looking relieved.\u003c/p\u003e\n\u003cp\u003eBehind him three battered, torn, and running figures appeared.\u003c/p\u003e\n\u003cp\u003e\"Just go,\" Jenni sighed.\u003c/p\u003e\n\u003cp\u003eKatie glanced into the rear view mirror as Jack began to bark at the approaching zombies. \"Sorry,\" she whispered and shifted gears and truck lurched forward as more zombies, slower ones, shuffled into view.\u003c/p\u003e\n\u003cp\u003e\"No,\" the man shouted. His voice was full of disbelief, despair and terror. \"No! Don\u0027t leave me here!\"\u003c/p\u003e\n\u003cp\u003eJenni considered shooting him. But leaning out the window and actually hitting him in the head or anywhere vital enough to kill him instantly seemed just impossible. She tried not to look behind her, but her eyes strayed to the side mirror. She winced as she watched him be caught by the faster zombies and dragged down. Her hand lashed out and grabbed Katie\u0027s. Katie held it tightly and they both sat in silence as the town vanished behind them.\u003c/p\u003e\n\u003cp\u003eAfter a few miles, Katie withdrew her hand and put it back on the wheel as they drew near Emorton.\u003c/p\u003e\n\u003cp\u003e\"Ralph advised that we go down this side road. It will help us avoid the main part of town. FM 1342.\"\u003c/p\u003e\n\u003cp\u003eKatie nodded. \"Okay. Got it.\"\u003c/p\u003e\n\u003cp\u003eJenni looked at Katie again and thought of Katie\u0027s words last night. They did share a bond. She felt it. Yes, she had been a little confused about it last night, but not anymore. She understood now. And she felt comfortable now with the warmth in her heart when she looked at Katie. She had a new friend, a sister, a comrade and she could love her and not be afraid of being used or hurt.\u003c/p\u003e\n\u003cp\u003eKatie turned onto the farm road and they both sat tensely in the moving truck, both aware that the larger towns were deathtraps. Jack softly woofed from the back seat and Jenni turned to see he was staring straight ahead with a very serious look on his face.\u003c/p\u003e\n\u003cp\u003eThree large buildings loomed ahead. Emorton Elementary, Junior High and High school all in one row. The parking lot was crammed with cars and high gates surrounded the building. But the gates were down in one section.\u003c/p\u003e\n\u003cp\u003eTwo cars evidently had rammed into it and the car doors were open. No one was inside, but the doors were smeared with blood.\u003c/p\u003e\n\u003cp\u003e\"Not good,\" Katie said softly.\u003c/p\u003e\n\u003cp\u003eJenni flicked off the safety on her gun. \"They must have made the school the rescue center.\" She twisted around in her seat and studied the buildings as they passed. Blood and bits of bodies were littered across the courtyard in front of one of the buildings. The doors to what appeared to be the gym were wide open.\u003c/p\u003e\n\u003cp\u003e\"Katie, floor it!\"\u003c/p\u003e\n\u003cp\u003eTwo zombies raced out of the gym toward the truck and it was if a dam had broken. A torrent of moaning, screeching zombies poured out of the building, a mixture of adults and children, racing toward them. The slower, more mangled corpses lurched out behind them, intent to join in the feast.\u003c/p\u003e\n\u003cp\u003e\"There is a fuckload of zombies coming our way!\"\u003c/p\u003e\n\u003cp\u003eJack began to bark anxiously at the approaching mob and looked at Katie worriedly, as if wondering why she wasn\u0027t hurrying it up.\u003c/p\u003e\n\u003cp\u003eKatie was following the road around the school and the truck swiftly approached a knot of cars crashed into each other. They had to do a half loop to get around the school and this kept them in range of the chasing mob. To the other side of the road there was farmland and no easy escape.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re gonna cut us off!\" Jenni was horrified at how shrill and terrified she sounded. But then again, she was terrified.\u003c/p\u003e\n\u003cp\u003eThe first of the zombies scrambled past the crashed cars and onto the road a head of them. They immediately began to charge the truck.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re meals on wheels,\" Jenni said with a bitter laugh.\u003c/p\u003e\n\u003cp\u003e\"Chewy center is what it\u0027s all about,\" Katie said gloomily.\u003c/p\u003e\n\u003cp\u003eThe truck plowed through the first zombies, but more were spilling out of the fence. It was starting to get hairy. The truck barreled through them and Katie saw another turn in the road. And more zombies coming from that direction. Another part of the fence was down due to someone ramming into it.\u003c/p\u003e\n\u003cp\u003e\"Damn stupid people!\" Katie slammed on the brakes.\u003c/p\u003e\n\u003cp\u003eA series of cars were clogging the road. People had obviously abandoned them in haste and had probably run for the school. Now they were probably running for the truck. To their right was the fence, to their left a slight shoulder and an embankment.\u003c/p\u003e\n\u003cp\u003e\"Just go,\" Jenni shouted.\u003c/p\u003e\n\u003cp\u003eThe zombies reached the truck and began to slam their fists against the metal and the glass.\u003c/p\u003e\n\u003cp\u003eKatie reversed, shoving her foot hard down the accelerator, looking very satisfied as the truck bounced over a few zombie bodies. She aimed the truck for the narrow path to the side of the blockade of cars.\u003c/p\u003e\n\u003cp\u003e\"We might tip,\" Katie said.\u003c/p\u003e\n\u003cp\u003e\"Go down it! Off road through the field,\" Jenni said urgently. She glanced at the zombies banging on her window. \"Before they break in!\"\u003c/p\u003e\n\u003cp\u003eKatie didn\u0027t say a word, but expertly dodged one crashed car and started the truck down the embankment. The vehicle tilted scarily to one side and Jenni found herself clinging to the door to keep from falling into Katie. Some of the zombies were still with them and banging on the windows.\u003c/p\u003e\n\u003cp\u003eThe truck hit the field and the wheels plowed through the sun-hardened earth. Luckily, it was just a field of wild flowers and the truck was a 4X4. The zombies still followed. Some even clung to the edges of the truck bed. In the mirror, Jenni could see the zombies from the school flowing into the field.\u003c/p\u003e\n\u003cp\u003eKatie aimed the truck for the road on the other side of the field. \"How are we doing?\"\u003c/p\u003e\n\u003cp\u003e\"We got stowaways and lots more trying to catch up.\u003c/p\u003e\n\u003cp\u003eThere was a tremendous jolt as the truck struggled up the embankment and back onto the road. Jenni looked back to see two zombies go flying off the back of the truck and onto the road as they lost their grip. The last one had managed to get into the truck bed and was staggering toward the back window. Jack was barking wildly at this point.\u003c/p\u003e\n\u003cp\u003e\"Slam on the brakes!\"\u003c/p\u003e\n\u003cp\u003eKatie obeyed immediately.\u003c/p\u003e\n\u003cp\u003eThe zombie was flung forward and hit the back of the cab. It fell back into the bed out of sight.\u003c/p\u003e\n\u003cp\u003eJenni flung the door open, slipped out, and held her gun up.\u003c/p\u003e\n\u003cp\u003eThe zombie grabbed hold of the side of the truck and hauled itself up. It found itself looking straight into Jenni\u0027s determined gaze.\u003c/p\u003e\n\u003cp\u003e\"Pop,\" Jenni said, fired, and the zombie\u0027s head did pop like an enormous blister.\u003c/p\u003e\n\u003cp\u003e\"Get back in!\" Katie was struggling to keep Jack from jumping out.\u003c/p\u003e\n\u003cp\u003eJenni could see the two zombies who had fallen off closing fast. Not far behind them an enormous crowd of the undead students, parents and teachers from the schools.\u003c/p\u003e\n\u003cp\u003eJumping into the cab, she slammed the door shut and Jack licked her face with relief.\u003c/p\u003e\n\u003cp\u003eKatie drove on at top speed, her gaze flicking toward the gas gauge.\u003c/p\u003e\n\u003cp\u003e\"How far?\"\u003c/p\u003e\n\u003cp\u003e\"An hour, but just back roads from this point out,\" Jenni answered, trying to get the map turned the right way.\u003c/p\u003e\n\u003cp\u003e\"But we have the interstate to worry about…\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s alive, Katie. Jason is alive. I know it. And if there are zombies on the interstate, they may not go near the camping ground.\"\u003c/p\u003e\n\u003cp\u003eKatie nodded. \"I know, hon. I know. We\u0027re close. We\u0027re going to get him.\"\u003c/p\u003e\n\u003cp\u003eJenni nodded back. \"We have to,\" Jenni said softly. She did not add that she needed to save him to make up for her failures as a mother. Katie wouldn\u0027t understand.\u003c/p\u003e\n\u003cp\u003e\"We will save him,\" Katie assured her. \"We will.\"\u003c/p\u003e\n\u003cp\u003eJenni believed her.\u003c/p\u003e\n\u003cp\u003eChapter 6\u003c/p\u003e\n\u003cp\u003e1. Frayed Edges\u003c/p\u003e\n\u003cp\u003eKatie was still trembling from the episode at the schools. Leaving that poor man behind was bad enough, but seeing that torrent of zombified families coming out of the school buildings had left her feeling sick to the very pit of her stomach. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-first-days-as-the-world-dies-1/page-16.html","bookId":2481,"creation":"Oct 5, 2019 4:56:42 PM","modification":"Oct 5, 2019 4:56:42 PM"}
