{"id":84048,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"So. All the zombies are holed up in the school?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah and we considered having someone drive out there to doublecheck, but decided that could end up giving them the incentive they need to break out. Juan noticed that when they can\u0027t see humans directly, they tend to just mill around. It\u0027s when they spot living flesh that they go ape shit.\"\u003c/p\u003e\n\u003cp\u003eTravis watched the zombie woman languishing in the guts of her dead comrades, at one point trying to eat a bit of intestine only to spit it out. She continued to swim through the congealed blood and decaying flesh.\u003c/p\u003e\n\u003cp\u003eJenni watched the woman with a small smile on her face. Her fingers were itching to draw her gun and blast a hole through the woman\u0027s skull.\u003c/p\u003e\n\u003cp\u003eSomething about her desperation to get to them and eat them, coupled with her bright, candy-pink jogging suit and bouffant hairdo just annoyed the ever-loving fuck out of her.\u003c/p\u003e\n\u003cp\u003e\"Most of the ones I have seen are always running to eat me. I never see them just standing around.\"\u003c/p\u003e\n\u003cp\u003e\"Because we\u0027re back behind the barricades we\u0027ve had a chance to see them just stand there swaying or milling around until they spotted someone alive. But once they figure out we\u0027re back here, they attack and just keep attacking until we kill them.\" He sighed and rubbed his chin thoughtfully.\u003c/p\u003e\n\u003cp\u003e\"Sound sets them off, too. We used a radio to distract some of them once.\u003c/p\u003e\n\u003cp\u003eWhen you and Katie arrived, we set off a car alarm from the roof of the city hall.\"\u003c/p\u003e\n\u003cp\u003eJenni drew pictures in the earth with her fingers. \"I was wondering how you did that. It seems that each time Katie and I encounter zombies, they are on us in a second. We just run.\"\u003c/p\u003e\n\u003cp\u003e\"You and Katie had a rough time out there, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eJenni made a face and nodded. \"Yeah. Pretty much from yesterday morning on.\"\u003c/p\u003e\n\u003cp\u003e\"We didn\u0027t have it so bad here. With the townspeople being herded early into the school we really have had limited interaction with the zombies.\u003c/p\u003e\n\u003cp\u003eHonestly, we had secured the perimeter before we had a pack of them show up. I almost feels guilty that I didn\u0027t have to run for my life like other people have.\"\u003c/p\u003e\n\u003cp\u003e\"Well, it’s no fun, that\u0027s for damn sure. Just consider yourself lucky and don\u0027t feel guilty.\" Jenni looked down at what she had written in the earth next to some stick figures. It read \"Benji\". She quickly rubbed it out. She just couldn\u0027t think of those little fingers straining…straining…\u003c/p\u003e\n\u003cp\u003e\"You okay?\" Travis leaned forward and put a gentle hand on her shoulder.\u003c/p\u003e\n\u003cp\u003eJenni looked up into his face and said simply, \"No.\"\u003c/p\u003e\n\u003cp\u003eHe pressed his lips tightly together and nodded. \"Of course you\u0027re not.\u003c/p\u003e\n\u003cp\u003eSorry.\"\u003c/p\u003e\n\u003cp\u003eShe just looked down and shook her head. \"Is anyone okay? Really? I don\u0027t think I was okay before all this went down. I think I\u0027m actually somehow better now.\" Her brow furrowed \"That doesn\u0027t make sense, I know.\u003c/p\u003e\n\u003cp\u003eMy children are…but…something inside of me is maybe stronger.\"\u003c/p\u003e\n\u003cp\u003eTravis sighed and ran a hand over his hair. \"Adversity brings out the best or the worst in people. Perhaps you are just finding some strength inside you didn\u0027t know you had.\"\u003c/p\u003e\n\u003cp\u003eJenni tilted her head, her dark hair falling softly around her pale face.\u003c/p\u003e\n\u003cp\u003eShe considered this, then shrugged. \"I don\u0027t know. I\u0027m not sure. I just know that when…\" She faltered for a moment. \"…that when I saw what had happened to my children, who I was just stopped existing. I\u0027m weirdly happy in this world. Just having Katie and Jason makes me feel solid. Safe. Being here makes me feel that way.\"\u003c/p\u003e\n\u003cp\u003eTravis gave her that smile that warmed her to the very depths of her soul. \"I\u0027m glad you are dealing with all of this. I\u0027m glad you and Katie and Jason made it here. I\u0027m not sure what will happen next, but I know we\u0027re going to fight. And that at least is something.\"\u003c/p\u003e\n\u003cp\u003e\"I just want to kill them all. Kill them for killing…\" She stopped and looked down at her dirty fingers.\u003c/p\u003e\n\u003cp\u003eThe zombie woman finally reached the truck and began to bang on the side, moaning, screeching, desperate.\u003c/p\u003e\n\u003cp\u003e\"I want to kill her.\"\u003c/p\u003e\n\u003cp\u003e\"Then do it,\" Travis said.\u003c/p\u003e\n\u003cp\u003eJenni stood up slowly and Travis wordlessly handed her the makeshift spear.\u003c/p\u003e\n\u003cp\u003eWalking to the edge, Jenni looked down at the bloodied, upturned face and all that damned hair-sprayed blond hair. She felt Travis’ fingers slip under her coat and grab her belt to hold her steady. She cast a grateful look over her shoulder at Travis and lifted the spear. Her gaze narrowed on the woman\u0027s face and her glassy, blank eyes. So much like Lloyd\u0027s when he had looked up at her as he had stuffed more of Benji\u0027s tender baby flesh into his mouth.\u003c/p\u003e\n\u003cp\u003eJenni let out a hiss between her teeth and slammed the tip of the spear, which was the trowel, down hard into the woman\u0027s eye socket. She felt the flesh giving way, the eye slicing apart like a boiled egg and shoved it down as hard as she could. She felt things giving way, scraping, mushing, and tearing.\u003c/p\u003e\n\u003cp\u003eShe lifted and slammed it down again. Almost growling, she slammed it down over and over again until the female zombie slid down the side of the truck and lay still.\u003c/p\u003e\n\u003cp\u003eJenni took great breaths of the rank, cool air and slowly handed over the spear. Travis took it and reached out and gently touched her shoulder.\u003c/p\u003e\n\u003cp\u003e\"Better?\"\u003c/p\u003e\n\u003cp\u003e\"No. Not really. But it felt good.\" Jenni gave him an awkward smile.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a strange, strange girl in a strange, strange world,\" Travis decided and gave her a gentle hug.\u003c/p\u003e\n\u003cp\u003eJenni nestled into his arms and smiled to herself. She then slipped away from him and sat back down on the dirt watching another surviving zombie try to walk over his dead comrades to them.\u003c/p\u003e\n\u003cp\u003e\"Sure you don\u0027t want me to shoot him?\"\u003c/p\u003e\n\u003cp\u003eTravis laughed and it was a wonderful sound to her ears.\u003c/p\u003e\n\u003cp\u003e4. Breathing Space\u003c/p\u003e\n\u003cp\u003eKatie stirred only once during the night. It was when Jenni had finally come into the small room to go to bed and had leaned over and kissed her forehead tenderly. Katie had sleepily opened her eyes to see Jenni lying down on her own cot and had reached out to take her hand. She had fallen back to sleep, Jenni\u0027s fingers intertwined with hers.\u003c/p\u003e\n\u003cp\u003eIn the morning, she awakened to Jenni peacefully snoring and Jason sneaking out the door with Jack on his heels. She could smell hot, fresh coffee wafting through the building and pulled on her socks and boots immediately.\u003c/p\u003e\n\u003cp\u003eAlmost stumbling down the narrow staircase, she found her way to the community dining room where people were gathered for coffee and a breakfast of what had been left over from the fundraiser dinner.\u003c/p\u003e\n\u003cp\u003eSnagging a Danish, half of a club sandwich, and a hot cup of coffee, Katie found a corner and sat down to enjoy her meal. The townies weren\u0027t as open to her as the construction crew. The townspeople looked at her curiously, but seem locked in their own worlds. Of course, this was their town and it was now dead. They were probably in shock, in mourning, and not sure what to think of any of this, including the blond in the camouflage pants and black tank top.\u003c/p\u003e\n\u003cp\u003eJason joined her at the table, Jack hot on his heals with his ears perked and looking at the boy anxiously for any scraps. The teenager seemed a bit moody this morning and Katie didn\u0027t blame him. Being here, being safe, made her feel raw and more vulnerable emotionally. Being on the run, living on the edge of death, was numbing and comforting compared to a quiet moment to actually reflect on all they had endured and lost.\u003c/p\u003e\n\u003cp\u003e\"Mom\u0027s still asleep?\" he asked.\u003c/p\u003e\n\u003cp\u003eKatie looked at him, noting his use of the word \"mom.” \"Yeah, she seemed really tired.\"\u003c/p\u003e\n\u003cp\u003e\"She was out late with that guy,\" Jason said moodily.\u003c/p\u003e\n\u003cp\u003eKatie opened her mouth to say something and faltered. Of course he was upset. Jason\u0027s dad was dead and already his step mom seemed to have her eyes on another man. She took a bite of the Danish, noting it was close to being stale.\u003c/p\u003e\n\u003cp\u003eJason sighed and gave the dog a few bits of cold chicken, which were immediately gulped down. \"Dad was a shithead, but…\" He shrugged.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" Katie said. Not sure really what she was agreeing to, but Jason nodded back at her and set about eating.\u003c/p\u003e\n\u003cp\u003e\"It would be different if it was you,\" he said softly, so no one else could hear. \"At least you wouldn\u0027t be replacing Dad.\"\u003c/p\u003e\n\u003cp\u003eKatie reached across the table and touched his cheek. \"Jason, I think Jenni is just dealing with things the best way she can. I don\u0027t think you have to worry about anyone replacing your father right now.\"\u003c/p\u003e\n\u003cp\u003eTurning his face away, he shrugged. \"Whatever.\"\u003c/p\u003e\n\u003cp\u003eShe sighed softly and returned to eating. Jason didn\u0027t seem to want to talk, so she finished up, gave him a brief hug, patted Jack on the head, and headed downstairs.\u003c/p\u003e\n\u003cp\u003eWhen she stepped out into the fresh, cool air, she saw that the construction of the wall was complete. Made of concrete and at least two feet thick, the wall stood sturdy and defiant about five feet from the perimeter of the hurricane fence. It was, at the very least, ten feet high. She stared over the top of it at the buildings surrounding their little fort. There was no way to be sure, but it looked like most of them had been abandoned long before all of this went down, except for the Dollar Store across the street.\u003c/p\u003e\n\u003cp\u003eHands on hips, she surveyed the interior of the little fort and noted a fairly clear path along the edges, except for where some of the bigger machinery was clustered in a corner. She had noticed the day before that the bulldozers and heavy equipment was parked outside the wall. She flicked her gaze up to the enormous crane attached to the building with the faded Coca Cola advertisement. How it all worked was beyond her. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-first-days-as-the-world-dies-1/page-26.html","bookId":2481,"creation":"Oct 5, 2019 4:56:42 PM","modification":"Oct 5, 2019 4:56:42 PM"}
