{"id":84050,"no":28,"title":"Page 28","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll kick their asses,\" Jenni said firmly.\u003c/p\u003e\n\u003cp\u003e\"Of course.\" Katie forced a smile and looked toward Travis.\u003c/p\u003e\n\u003cp\u003eTheir companion lifted a ladder that laying on the ground nearby and leaned it against the truck barrier. He took a few moments to make sure it was steady. He looked back and gave them the thumbs up.\u003c/p\u003e\n\u003cp\u003eJuan handed the gasoline canisters over the fence to Travis and followed them over the fence.\u003c/p\u003e\n\u003cp\u003e\"Remember, as soon as we pull up, drop down and get in the truck.\u003c/p\u003e\n\u003cp\u003eNothing fancy. Just get in. We\u0027ll cover you,\" Travis said firmly.\u003c/p\u003e\n\u003cp\u003eJenni nodded. \"I got it.\"\u003c/p\u003e\n\u003cp\u003e\"No worries,\" Juan assured him.\u003c/p\u003e\n\u003cp\u003eTravis wiped his brow with his hand and looked toward Katie. \"You ready?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yeah. A little scared, but ready.\"\u003c/p\u003e\n\u003cp\u003eThe men on top of city hall gave the all clear signal.\u003c/p\u003e\n\u003cp\u003e\"Time to go,\" Travis muttered.\u003c/p\u003e\n\u003cp\u003e\"Good luck,\" Juan said and shook their hands.\u003c/p\u003e\n\u003cp\u003eJenni gave them both hard hugs. \"Run like the wind.\"\u003c/p\u003e\n\u003cp\u003e\"Trust me. I\u0027ll set a new world\u0027s record today,\" Katie said with a wry grin.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s hurry.\" Travis turned and headed up the ladder.\u003c/p\u003e\n\u003cp\u003eKatie followed, trying hard not to panic. She felt a little dizzy and sweat was trickling down between her shoulder blades. Maybe it was the sun, or the stress, or even both, but she felt lightheaded and slightly unreal.\u003c/p\u003e\n\u003cp\u003eReaching the top, she heaved herself onto the packed earth in the bed of the construction truck and looked around. The road looked clear. Juan passed the gasoline up to them and Travis set them near the edge.\u003c/p\u003e\n\u003cp\u003eNo one spoke for the tension lining their faces said it all. Travis motioned to Katie what he was going to do, then dropped over the side. Katie handed down the gasoline canisters to him. He secured them over his shoulders with long straps, wearing them like a pack on his back. When he was ready, she handed down his spear.\u003c/p\u003e\n\u003cp\u003eLooking around one more time, she took a deep breath and swung herself over the side. As she dropped, she caught her forearm on the edge of the truck and ended up with a nasty scrape. Wincing, she took a brief look at it, but there was really no time to worry about it. Travis uttered one word \"Run\" and they ran.\u003c/p\u003e\n\u003cp\u003eThey were halfway down the block, sprinting for the truck,] when Katie started to hear footsteps pounding on the brick road behind her.\u003c/p\u003e\n\u003cp\u003eJenni-oh so sweet but not always thinking straight Jenni-screamed,\u003c/p\u003e\n\u003cp\u003e\"Katie, there is one behind you!\"\u003c/p\u003e\n\u003cp\u003eTravis uttered, \"Shit!\"\u003c/p\u003e\n\u003cp\u003eKatie ran with the gun tucked into her holster and her arms pumping.\u003c/p\u003e\n\u003cp\u003eTravis ran a few feet in front of her. She was panicking as the stench of decay and death grew stronger and the footsteps got closer. The keening was louder, more hungry, more crazed.\u003c/p\u003e\n\u003cp\u003e\"Duck,\" Travis exclaimed, stopping and whirling about.\u003c/p\u003e\n\u003cp\u003eKatie ducked down, slipping around him as he lifted the spear up. She heard a meaty THWUANK and turned to see the spear jammed into the zombie’s mouth. It fell back, twisting on the ground, trying to get up. Katie drew her gun as Travis reached for the spear.\u003c/p\u003e\n\u003cp\u003e\"No time,\" she said, grabbing his arm. \"More might come.\"\u003c/p\u003e\n\u003cp\u003eTravis nodded and they both ran.\u003c/p\u003e\n\u003cp\u003eThe truck loomed large and red before them. Katie noted the gore and blood now dried to its heavy deer guard. Despite her frantic thoughts, she noted that there was nothing undead lurking under the heavy truck. Scanning the street beyond their destination, she saw nothing stirring. The zombies were behind them.\u003c/p\u003e\n\u003cp\u003eShe reached the truck first. She turned, her gun drawn, and aimed back down the street to cover Travis. She could see Juan and Jenni on the back of a truck, watching them.\u003c/p\u003e\n\u003cp\u003eKatie heard a metallic pop as Travis opened the gas tank. She dropped one hand and her fingers closed over the keys in her pocket. Her eyes scanned the far corner as her hand reached out and opened the driver\u0027s side door. Even in their haste, both Jenni and Katie had shut the truck doors when they had fled the evening before.\u003c/p\u003e\n\u003cp\u003e\"More are coming,\" Jenni suddenly shouted.\u003c/p\u003e\n\u003cp\u003eBoth Juan and Jenni began to motion frantically to hurry.\u003c/p\u003e\n\u003cp\u003e\"Travis,\" Katie said in a strained voice.\u003c/p\u003e\n\u003cp\u003e\"I heard them,\" Travis answered tersely.\u003c/p\u003e\n\u003cp\u003eThe glug glug glug of the gas being poured into the tank was a welcome sound, but the howls and screeches of the approaching zombies were not.\u003c/p\u003e\n\u003cp\u003eThey rounded the corner, a torrent of battered, bloodied, ripe dead bodies. Katie lifted her gun a little higher as she edged into the cab and put the keys in the ignition.\u003c/p\u003e\n\u003cp\u003e\"Travis,\" she said softly.\u003c/p\u003e\n\u003cp\u003e\"On the second one,\" he responded.\u003c/p\u003e\n\u003cp\u003eThe zombies were closing fast. There were at least a dozen. They were running so fast their limbs were popping, arms suddenly going limp, legs suddenly dragging. But there were enough of them that a good portion kept a steady sprint.\u003c/p\u003e\n\u003cp\u003e\"Travis,\" she said again.\u003c/p\u003e\n\u003cp\u003e\"Fuck it!\" He threw away the second gas container, an arc of clear fluid splashing the brick road. He shoved the gas cap in place and darted around to the passenger side.\u003c/p\u003e\n\u003cp\u003eKatie yanked her door shut and gunned the engine. It didn\u0027t start.\u003c/p\u003e\n\u003cp\u003eTravis slammed the passenger door. \"Go! Go! Go!\"\u003c/p\u003e\n\u003cp\u003e\"It won\u0027t!\"\u003c/p\u003e\n\u003cp\u003e\"Keep trying! It was bone dry. It will take a few tries!\"\u003c/p\u003e\n\u003cp\u003eKatie kept turning it on, pumping the gas, her eyes on the zombies just a few yards from the truck. The engine caught suddenly and roared to life. She shifted gears and floored it, the truck barreling through the zombies and toward the truck barrier where Jenni and Juan were jumping up and down on top of a dirt truck.\u003c/p\u003e\n\u003cp\u003e\"Drive fast so the zombies won\u0027t have a chance to catch up, then we get Juan and Jenni, and go,\" Travis said breathlessly.\u003c/p\u003e\n\u003cp\u003eKatie nodded.\u003c/p\u003e\n\u003cp\u003eThe truck was now a block away from the fort.\u003c/p\u003e\n\u003cp\u003eIt seemed impossible for there to be that many zombies at once, but the road ahead of them was filling like water fills a basin. All sizes, all ages, all rushing toward the truck, all howling. The battered, torn bodies of men, women, and children stumbled, staggered, ran and even sprinted toward them.\u003c/p\u003e\n\u003cp\u003eKatie slammed on the brakes. \"Oh, God.\"\u003c/p\u003e\n\u003cp\u003eTravis sat silently, watching the flood. \"They\u0027re out.\"\u003c/p\u003e\n\u003cp\u003eKatie licked her lips and glanced toward him. \"Yeah.\"\u003c/p\u003e\n\u003cp\u003eAt least a hundred zombies were flooding the street between the truck and Jenni. Katie could see Juan pulling Jenni back off the top of the dirt truck.\u003c/p\u003e\n\u003cp\u003e\"Turn and go,\" Travis said softly.\u003c/p\u003e\n\u003cp\u003eKatie spun the wheel around as she pushed down on the accelerator and the truck plowed through the zombies that had originally been giving them chase.\u003c/p\u003e\n\u003cp\u003eThey were jostled around in the cab as the huge wheels churned over the dead. The truck broke free and raced up the long stretch of road out of town.\u003c/p\u003e\n\u003cp\u003eKatie\u0027s gaze flicked to the rear view mirror. She saw some zombies still in pursuit, but most of the others were now beating their fists against the truck barricade.\u003c/p\u003e\n\u003cp\u003eTravis was very quiet behind her, breathing hard, reeking of gasoline.\u003c/p\u003e\n\u003cp\u003eHer shower was a moot point and she felt hot and sweaty. She glanced toward him to see he was running a hand slowly through his hair. Lifting his head, he said, \"We just do what we planned.\"\u003c/p\u003e\n\u003cp\u003eKatie licked her very dry lips and nodded. \"Yeah. Okay.\" Her throat felt tight and scratchy and she forced herself to take a calming breath.\u003c/p\u003e\n\u003cp\u003eHow they were going to get back into the fort would be dealt with later.\u003c/p\u003e\n\u003cp\u003eFor now they had a job to do and they were determined to do it.\u003c/p\u003e\n\u003cp\u003e2. Left Behind\u003c/p\u003e\n\u003cp\u003eJenni was dimly aware of Juan pulling her back as she strained forward, reaching her hand toward the red truck. She screamed loud and hard as it spun around and retreated as the throng of the dead filled the street between her perch on top of the enormous truck and Ralph\u0027s red truck that Katie was driving. Juan stumbled back with her in his arms as the dead began to bang on the side of the construction truck, moaning and screeching. The heavy sandbags held the truck sturdy and it was too high for the undead to scramble over.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re not climbers as far as we know, but let’s not give them the idea to try it,\" Juan said in her ear and half carried, half dragged her down the ladder.\u003c/p\u003e\n\u003cp\u003eShe struggled in his arms. \"Katie, no! She can\u0027t leave without me!\" Jenni felt like her head was going to explode as she thrashed about. Juan dropped her and they both fell behind the barricade. Safe but bruised, they were hidden from the zombies.\u003c/p\u003e\n\u003cp\u003eKatie couldn\u0027t leave her. Katie was safety. Katie was her friend. Her war buddy. Her comrade.\u003c/p\u003e\n\u003cp\u003eJenni scrambled to her feet, drawing her gun, grabbing ahold of the ladder.\u003c/p\u003e\n\u003cp\u003eJuan gripped her wrist tightly. \"No. They are gone already! They\u0027re safe.\u003c/p\u003e\n\u003cp\u003eLet them go!\"\u003c/p\u003e\n\u003cp\u003eJason was at the wall, waving at her from over the top. \"Mom, come back!\"\u003c/p\u003e\n\u003cp\u003eShe felt the world spinning around her and she covered her face for a moment. Mom…? Was she still a Mom?\u003c/p\u003e\n\u003cp\u003eThose tiny fingers…\u003c/p\u003e\n\u003cp\u003e\"Mom! Come back in!\"\u003c/p\u003e\n\u003cp\u003eBenji…gone…Mikey…gone…Jason…Jason calling to her.\u003c/p\u003e\n\u003cp\u003eShe stumbled forward and Juan helped her up onto the next ladder to scale the hurricane fence. She shoved her gun into her waistband and dropped to the other side.\u003c/p\u003e\n\u003cp\u003eShe turned back, the morning sun blinding her for a moment. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-first-days-as-the-world-dies-1/page-28.html","bookId":2481,"creation":"Oct 5, 2019 4:56:42 PM","modification":"Oct 5, 2019 4:56:42 PM"}
