{"id":84054,"no":32,"title":"Page 32","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eKatie had given her a second chance though. A second chance at life. A new life in a world that had changed all the rules, but that she found she could actually function in. Maybe that did make her loca, but she didn\u0027t care.\u003c/p\u003e\n\u003cp\u003eShe brushed a tear away and found her way to the communication center. Curtis sat there, still in his uniform, looking worn out and shellshocked. He had taken a shower and washed out his clothes and they clung damply to his skin, but he didn\u0027t seem to care.\u003c/p\u003e\n\u003cp\u003e\"Avoid Houston at all costs,\" a voice was saying over one of the speakers.\u003c/p\u003e\n\u003cp\u003e\"Stay on the minor roads. I\u0027ll meet up with you near Texarkana.\"\u003c/p\u003e\n\u003cp\u003e\"Come back again, good buddy,\" another voice said.\u003c/p\u003e\n\u003cp\u003eCurtis noticed her presence and looked up at her slowly.\u003c/p\u003e\n\u003cp\u003e\"Who are they?\"\u003c/p\u003e\n\u003cp\u003e\"Truckers. Looking for a place.\"\u003c/p\u003e\n\u003cp\u003e\"Did you tell them about us?\"\u003c/p\u003e\n\u003cp\u003e\"Too far out. Too little gas. A few may make it here in a day or two, but those things…\" He shook his head. \"We have to figure out how to make it safe for more people to come here.\"\u003c/p\u003e\n\u003cp\u003eJenni stepped into the room, Jack pressing past her to go greet Curtis.\u003c/p\u003e\n\u003cp\u003eThe doggy love actually brought a smile to Curtis’ face and he leaned down to rub the German Shepherd\u0027s ears.\u003c/p\u003e\n\u003cp\u003e\"Anything on with Katie?\"\u003c/p\u003e\n\u003cp\u003eCurtis sighed. \"Still real sick. Real sick.\"\u003c/p\u003e\n\u003cp\u003eJenni sat down on a cold, metal folding chair and clasped her hands tightly together. \"What do they think it is?\"\u003c/p\u003e\n\u003cp\u003e\"Travis is afraid it’s the zombie sickness,\" Curtis answered her, averting his gaze from her.\u003c/p\u003e\n\u003cp\u003eJenni sighed. \"But he\u0027s not sure.\"\u003c/p\u003e\n\u003cp\u003eCurtis nodded. \"Not sure.\"\u003c/p\u003e\n\u003cp\u003eJenni looked at the little communications center, then said, \"Can I sit here? And wait? Maybe they\u0027ll call?\"\u003c/p\u003e\n\u003cp\u003eCurtis returned his gaze to her and she gave him her best \"little girl lost\" look. He nodded. \"Sure. You can stay.\"\u003c/p\u003e\n\u003cp\u003eJenni smiled at him and pulled her knees up to her chin, her feet resting on the cold metal seat. \"Turn up the CB. Maybe someone is out there that we can talk to.\"\u003c/p\u003e\n\u003cp\u003eCurtis gave her a shy smile and nodded. \"Okay.\" He leaned over and turned it up and Jenni watched him, memorizing his actions.\u003c/p\u003e\n\u003cp\u003eThe first chance she got, she would find out what was really happening to Katie.\u003c/p\u003e\n\u003cp\u003e3. Beyond\u003c/p\u003e\n\u003cp\u003eTravis sat in darkness. The only light came from a small night light on the far side of the room. Katie lay curled on the bed, her blond curls in disarray around her face. She looked waxen, pale, and frightfully drawn. On the dresser next to him was a revolver. Ralph had instructed him very precisely how to handle it. And Nerit had very intently insisted that he could not falter, he could not flinch. If Katie rose from that bed as anything other than a living breathing human being, he had to put her out of her misery.\u003c/p\u003e\n\u003cp\u003eRubbing his hands together, he let out a low sigh. This was hard. Very hard. Harder than it should be. To sit here and wait for this woman to fade from the world into the world of the dead just to put a bullet between her eyes seemed a cruel fate considering the absolute joy he had felt in meeting her just two days ago.\u003c/p\u003e\n\u003cp\u003eIt had been one of the oddest moments of his life. He had just looked at her and knew her. He felt he should know her name and that they shared a past. It was as though they had been friends who had endured much together and then were separated by life. He had felt strongly he should open his mouth and say her name, but he didn\u0027t know her. But somehow he did. Even when she had mentioned her wife, and yeah, that had kinda threw him just a bit, in a way he had known.\u003c/p\u003e\n\u003cp\u003eIt was odd considering that Jenni, with her long flowing raven hair, pale skin, and luminous eyes was everything he had ever found desirable physically about a woman. In fact, she looked startling similar to his exfiancee Darlene. But it was the tall blond with the long, lean body, intense features, and wickedly sharp gaze that had instantly grabbed his attention.\u003c/p\u003e\n\u003cp\u003eHe had even noted how her eyes turned up slightly at the ends, speaking of Nordic blood in her genes.\u003c/p\u003e\n\u003cp\u003eI know you, he wanted to say. And she had seemed to want to say it back to him.\u003c/p\u003e\n\u003cp\u003eRaised a good Protestant, he didn\u0027t believe much in miracles or the mystical. But he did now. Zombies had pretty much settled that argument.\u003c/p\u003e\n\u003cp\u003eThey weren\u0027t natural, he knew that much. But seeing Katie and knowing she was important to not only him, but also all those in the fort, that had surpassed anything his logical mind had ever grasped before. But now he sat in this dark room, listening to her breathe, waiting for the end. He was convinced of it now.\u003c/p\u003e\n\u003cp\u003eAt times she called out softly for Lydia. At other times her father. Once or twice for Jenni.\u003c/p\u003e\n\u003cp\u003e\"Please,\" she had begged Travis once during a lucid moment. \"Take care of Jenni.\"\u003c/p\u003e\n\u003cp\u003eHe knew he would take care of Jenni. And Jason. And all the others. For Katie and her memory. She had endured more than he had. Seen things he could not imagine. His loss had been a Dear John letter left on his pillow.\u003c/p\u003e\n\u003cp\u003eHers had been seeing Lydia as one of those things.\u003c/p\u003e\n\u003cp\u003eThere was a sharp intake of breath from the bed…then nothing.\u003c/p\u003e\n\u003cp\u003eTears, hot and angry, filled his eyes and he picked up the gun.\u003c/p\u003e\n\u003cp\u003eIt was time.\u003c/p\u003e\n\u003cp\u003eTravis stood in the darkened bedroom gazing down at the gun. His tears were fierce in his eyes and his anger burned even hotter in his throat.\u003c/p\u003e\n\u003cp\u003eHe heard the bed creak and through his lashes saw her rise.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" he said, and lifted the gun.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eHe blinked and tears fell down his cheeks. \"Katie?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah?\"\u003c/p\u003e\n\u003cp\u003eTravis flipped on the overhead light and she sat blinking in the sudden brightness. She still looked pale and frail, but her eyes were bright again.\u003c/p\u003e\n\u003cp\u003eClear. Alive.\u003c/p\u003e\n\u003cp\u003e\"Oh, God, Katie! I thoughtShe kept blinking in the bright light, shielding her face with her hand. \"I told you nothing bit me.\"\u003c/p\u003e\n\u003cp\u003e\"Katie, you\u0027ve been so sick,\" Travis looked down at the gun and set it upon the dresser. As the heavy weight of it left his hand, a heavier weight lifted from his spirit. With great relief, he walked toward her.\u003c/p\u003e\n\u003cp\u003eFor a crazed split second, he saw her with empty eyes, mouth opened in a scream, rushing toward him, then it was gone and Katie was giving him a look that said pretty much what she was thinking.\u003c/p\u003e\n\u003cp\u003eShe thought he was nuts.\u003c/p\u003e\n\u003cp\u003e\"Sorry, about the gun, but you were burning up and we couldn\u0027t get the fever down for the longest time…\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I get for not getting the flu shot,\" Katie pushed a hand through her hair, wincing at the grubbiness of it. \"Gawd, I must be a sight.\"\u003c/p\u003e\n\u003cp\u003eTravis laughed suddenly and impulsively leaned down and hugged her.\u003c/p\u003e\n\u003cp\u003eIn just two days, she felt so tiny and frail. Already slim, the drain on her body resources had been powerful. She awkwardly hugged him back. She tried to stand up. Her body was determined to keep her seated.\u003c/p\u003e\n\u003cp\u003e\"Okay, I guess I was really sick.\" She fell back onto the bed and looked a little woozy.\u003c/p\u003e\n\u003cp\u003e\"Scary sick.\" Travis responded and sat next to her on the bed. He took hold of her hand and looked at her arm. \"We couldn\u0027t figure out if it was the zombie infection or not. Your scrape happened on one of the trucks. I didn\u0027t know if the blood and guts from the zombies may have infected you.\" Peeling back the bandage, he revealed a nicely healing wound. \"But we saw no signs of infection but you were burning up and we couldn\u0027t keep anything in you.\"\u003c/p\u003e\n\u003cp\u003eKatie grimaced and shook her head. She touched her hair again and made a face. \"Gawd, I\u0027m so gross right now. None of you could have known this, but when I get the flu I go down like an elephant. I always have and that is why I usually get the flu shot. I skipped this year due to a big case and just never finding the time. Who knows what diseases all those dead bodies have unleashed into the air?\" She shivered at the thought. Looking down she saw she was dressed in a nightgown that was probably Nerit\u0027s.\u003c/p\u003e\n\u003cp\u003e\"The flu,\" Travis said with relief. \"Thank God, just the fucking everyday flu.\" He leaned forward and ran his hands over his face.\u003c/p\u003e\n\u003cp\u003eKatie draped her arm over his broad shoulders and gave him a little hug.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a tough bitch. A little bug like that can\u0027t keep me down for long. I always bounce back.\"\u003c/p\u003e\n\u003cp\u003eHe looked up at her and said, \"You\u0027re something else, you know that.\"\u003c/p\u003e\n\u003cp\u003eShe gave him an impish smile. \"I was called the Bitch Queen of the Prosecution. That has to say something about me.\"\u003c/p\u003e\n\u003cp\u003e\"Tough as nails, eh?\"\u003c/p\u003e\n\u003cp\u003e\"Eat them for breakfast,\" Katie said.\u003c/p\u003e\n\u003cp\u003eShe looked frail, but her voice was strong. She had ridden out the worst of it and was on the mend. He could tell that by the brightness in her eyes.\u003c/p\u003e\n\u003cp\u003eNow that she was sitting next to him, smiling at him, he couldn\u0027t imagine why he had thought she would go out of the world so easily.\u003c/p\u003e\n\u003cp\u003e\"I was really worried about you.\" He took hold of her hand. It felt a little cold, fragile, the bones under her skin so very delicate. \"I thought you were gone. And we need you. You\u0027re smart, resourceful, and…and…\"\u003c/p\u003e\n\u003cp\u003e\"Bitchy.\"\u003c/p\u003e\n\u003cp\u003e\"No, very real. I feel like what I see is what you are. I like that about you.\u003c/p\u003e\n\u003cp\u003eThat is why I wanted to know you better the second I met you. I knew in my heart that you were the type of person that could help all of us survive and keep us human. Not just keeping us from being zombies, but keeping us compassionate.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-first-days-as-the-world-dies-1/page-32.html","bookId":2481,"creation":"Oct 5, 2019 4:56:42 PM","modification":"Oct 5, 2019 4:56:42 PM"}
