{"id":84061,"no":39,"title":"Page 39","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eKatie\u0027s body was jolted as the pallet swung about and she screamed.\u003c/p\u003e\n\u003cp\u003eThe moans and shouts of the zombies below made her tremble with fear.\u003c/p\u003e\n\u003cp\u003ePeople in the Fort where shouting and she could hear Jenni screaming her name.\u003c/p\u003e\n\u003cp\u003eTravis was holding on tight to the heavy chain that held the pallet up.\u003c/p\u003e\n\u003cp\u003eBill was holding on for dear life, nearly falling off himself.\u003c/p\u003e\n\u003cp\u003eThe pallet was swinging crazily from the crane.\u003c/p\u003e\n\u003cp\u003eThis is it, Katie thought. This is how it ends for me.\u003c/p\u003e\n\u003cp\u003eKatie kicked her legs, trying to somehow swim through the air and get a better grip on Travis. Her free hand finally managed to grip his strong, thick wrist. Her fingers barely fit around it. She was gagging on the sheer stench of the dead below and her terror felt as if it was choking her. Travis’ grip on her felt tenuous somehow and he gazed down at her with grim determination.\u003c/p\u003e\n\u003cp\u003eThe pallet that made up their makeshift elevator continued to throw them off balance. It swung in long loops over the heads of the undead, making them shriek all the more as the humans dangled teasingly from it.\u003c/p\u003e\n\u003cp\u003eHow had it come to this?\u003c/p\u003e\n\u003cp\u003eThe drive to the town had been uneventful. Travis had driven the old white truck while Katie had been squeezed in between him and Bill. Laura had sat quietly on Bill\u0027s lap, a crocheted purse hanging around her neck.\u003c/p\u003e\n\u003cp\u003eNerit had given it to her and had put the VCR tape and remote control into it.\u003c/p\u003e\n\u003cp\u003eLaura had seemed to find this acceptable and had stared out of the windshield all the way to town as her fingers stroked the purse.\u003c/p\u003e\n\u003cp\u003eTravis had traveled an alternate route, avoiding the main street into the heart of the town that lead to the fort. They had taken a series of side roads until they came up to the outside of the enormous hotel that\u0027s back faced the fort. The improvised wall that kept the zombies corralled had impressed both Travis and Katie. A storage container and sandbags: very ingenious. It was evident that Juan was very clever.\u003c/p\u003e\n\u003cp\u003eNo zombies had made their appearance as they parked the car. On the road they had seen a few, in the distance, usually running from a farmhouse, but none had appeared in the town. The evacuation to the school had been highly successful.\u003c/p\u003e\n\u003cp\u003eThe enormous crane, perched over the fort, had been already in movement, its long arm extending toward them. Travis had slid out of the truck and moved to the bed as Bill and Katie covered him, guns drawn. Bill kept one hand on Laura\u0027s shoulder as they got ready to return to the Fort.\u003c/p\u003e\n\u003cp\u003e\"…not fast…enough…\" Laura had begun to murmur.\u003c/p\u003e\n\u003cp\u003eShe had been so silent and it startled them to hear her.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s starting up,\" Bill had whispered.\u003c/p\u003e\n\u003cp\u003eThey had worked as quietly as possible, trying not to draw too much attention. By the cries and moans behind the barrier keeping them safe, they had known the zombies were well aware of their presence.\u003c/p\u003e\n\u003cp\u003eTravis had climbed up onto the pallet and when the large hook from the crane had descended far enough, he had hooked the pallet onto it.\u003c/p\u003e\n\u003cp\u003e\"Okay, remember where I told you to stand. It\u0027s all about weight distribution to keep us from tipping over,\" Travis had said.\u003c/p\u003e\n\u003cp\u003eLaura had whispered, \"…not…fast…enough…\"\u003c/p\u003e\n\u003cp\u003eKatie had helped Bill get Laura up onto the pallet. Katie had pressed Laura\u0027s hands to the ropes Travis had made as hand holds, and Laura had gripped them firmly, despite her continuous blank stare. Katie had taken up her position, slinging her rifle over one shoulder, while Bill and Travis took theirs.\u003c/p\u003e\n\u003cp\u003e\"Nervous?\" Travis had asked.\u003c/p\u003e\n\u003cp\u003e\"Not at all,\" Katie had lied.\u003c/p\u003e\n\u003cp\u003eThe pallet had lifted rather smoothly and when they were high enough to be safe, they had started a long, slow swing over the zombies toward the Fort.\u003c/p\u003e\n\u003cp\u003eThe stench of them had filled their nostrils, an almost burning sensation, and the screams from below were hellish and chilling. Katie had kept her gaze on the fort and had tried not to look down. Occasionally, she checked on Laura who stood near her, holding the ropes tightly. Her lips had been moving and Katie had barely heard her whisper, \"…not fast…enough.\"\u003c/p\u003e\n\u003cp\u003eBill had looked down and let out a whistle. \"Damn. There\u0027s a lot of zombies.\"\u003c/p\u003e\n\u003cp\u003eKatie couldn\u0027t help herself and she had looked down. It had made her gasp to see how many were beneath her, jumping up and down, swinging their arms, trying in vain to reach them.\u003c/p\u003e\n\u003cp\u003eLaura had looked down as well. Her voice had risen in volume. \"…not fast…enough…not fast enoughnotfastenoughnotfastenough…\"\u003c/p\u003e\n\u003cp\u003e\"Laura, calm down. Look away,\" Travis had said firmly.\u003c/p\u003e\n\u003cp\u003e\"Laura, don\u0027t look,\" Katie had said.\u003c/p\u003e\n\u003cp\u003eThen Laura had stopped her fevered muttering and looked at each of them one by one. \"We can never be fast enough,\" she had said clearly.\u003c/p\u003e\n\u003cp\u003eAnd had let go.\u003c/p\u003e\n\u003cp\u003e\"No!\" Katie had made a mad grab for the girl and had caught her hair for just a moment. But gravity grabbed the young woman and dragged her down into the hands of the zombies below.\u003c/p\u003e\n\u003cp\u003eBut Katie wasn\u0027t the only one who had lunged for her. Bill and Travis had reached out in vain and Bill, who was much heavier than all of them, shifted his weight too much and the pallet had leaned to one side and swung in a dangerous arc.\u003c/p\u003e\n\u003cp\u003eKatie, already holding on by just one hand, had lost her footing and fallen.\u003c/p\u003e\n\u003cp\u003e\"Katie!\" Travis had grabbed for her.\u003c/p\u003e\n\u003cp\u003eShe had managed to hold onto the handhold he had created, but she had dangled over the zombies, her weight making the pallet swing even more.\u003c/p\u003e\n\u003cp\u003eBill had almost fallen off trying to regain his footing and sprawled over the top of the supplies, gripping the netting fiercely. Travis hand had found her wrist and hand and had grabbed on.\u003c/p\u003e\n\u003cp\u003eAnd now she hung suspended, as the feeding frenzy below made her feel like throwing up. She could hear the slurping noises, the harsh crunching of bones, and it made her even more desperate to get up onto the pallet.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t move, don\u0027t swing us,\" Travis ordered her. \"I have you. Just hang there.\"\u003c/p\u003e\n\u003cp\u003eKatie stared into his eyes and trusted him.\u003c/p\u003e\n\u003cp\u003eSlowly, the pallet stopped its crazy swinging and came to hang over the zombies, slightly listing to one side. Finally, the crane began to move again.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m slipping,\" Katie whispered.\u003c/p\u003e\n\u003cp\u003e\"No, you\u0027re not,\" Travis responded firmly. \"I have you.\"\u003c/p\u003e\n\u003cp\u003eHer fingers gripped his wrist tighter. His hand had such a tight hold of her, she felt as if he was crushing her wrist and hand.\u003c/p\u003e\n\u003cp\u003eBill didn\u0027t dare move and kept whispering, \"Oh shit…oh…shit…she jumped.\"\u003c/p\u003e\n\u003cp\u003eKatie dared to look down and saw the dirt trucks beneath her and some very evil looking black spikes. Beyond that was the fence and, last of all, the concrete wall.\u003c/p\u003e\n\u003cp\u003eThe pallet began to descend and Katie sobbed with relief.\u003c/p\u003e\n\u003cp\u003e\"Katie! Katie! Katie!\" Jenni\u0027s voice wafted up to her.\u003c/p\u003e\n\u003cp\u003eSuddenly hands were all over her and for a moment, she had one of Travis\u0027 waking nightmares, and she thought they had her. But when Travis let go of her, she fell into Juan\u0027s arms. Jenni was next to him, tears on her cheeks, and she grabbed Katie\u0027s bruised hands.\u003c/p\u003e\n\u003cp\u003e\"You made it!\"\u003c/p\u003e\n\u003cp\u003eKatie felt wet tears flowing down her own face as she nodded and pulled Jenni into a tight hug. Jason threw his arms around both of them in a tight hug and Jack, at her heels, barked for attention.\u003c/p\u003e\n\u003cp\u003eKatie kissed both Jenni and Jason on the cheek firmly then hugged them both to her again. It felt delicious to be alive and with them once more.\u003c/p\u003e\n\u003cp\u003eTravis swooped down and hugged them all at once in a big bear hug.\u003c/p\u003e\n\u003cp\u003eJenni threw her arms around his neck and kissed him.\u003c/p\u003e\n\u003cp\u003e\"You saved Katie!\" Her expression was one of absolute joy.\u003c/p\u003e\n\u003cp\u003eTravis shook his head. \"Nah, she saved herself. She had such a tight hold of me, I think she broke my wrist.\"\u003c/p\u003e\n\u003cp\u003eJason didn\u0027t smile at Travis, but he hugged Katie again and whispered,\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so glad you\u0027re back.\u003c/p\u003e\n\u003cp\u003eKatie grinned at him and kissed his cheek again. She was amused when he blushed.\u003c/p\u003e\n\u003cp\u003eJuan walked up to them and looked toward the pallet. \"Okay, I gotta ask.\u003c/p\u003e\n\u003cp\u003eDid anyone get any smokes?\"\u003c/p\u003e\n\u003cp\u003eThere was a pause before Katie burst into laughter. She felt overwhelmed with emotions. Happiness, sadness, fear, relief, remorse, guilt all mingled together. But she let her relief override all of them and she flung her arms around Juan and kissed his cheek.\u003c/p\u003e\n\u003cp\u003e\"What? What? Why are all of you women crazy? I just want my smokes,\"\u003c/p\u003e\n\u003cp\u003eJuan protested.\u003c/p\u003e\n\u003cp\u003eTravis just shook his head, his arm slung around Jenni\u0027s shoulders. \"One track mind…one track mind.\"\u003c/p\u003e\n\u003cp\u003eKatie slung her arm around Travis\u0027 waist and gave him a sideways hug.\u003c/p\u003e\n\u003cp\u003e\"Thanks, by the way.\"\u003c/p\u003e\n\u003cp\u003eTravis kissed the top of her head. \"Sorry, but I\u0027m not going to let you die.\"\u003c/p\u003e\n\u003cp\u003e\"Good,\" Jenni said happily and grabbed Katie\u0027s hand.\u003c/p\u003e\n\u003cp\u003e\"Seriously,\" Juan said again. \"Did anyone grab some smokes?\"\u003c/p\u003e\n\u003cp\u003e2. Dead of Night\u003c/p\u003e\n\u003cp\u003eNight finally descended, pushing back the heat, and letting the cool evening breeze waft into the fort. It would have been even more welcomed if it hadn\u0027t brought the stench of the dead in with it.\u003c/p\u003e\n\u003cp\u003eTravis stood out in the middle of the construction site, drinking a soda, and surveying the property with Juan. Juan had done a good job of getting it a bit more organized, even creating one corner specifically as a living area. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-first-days-as-the-world-dies-1/page-39.html","bookId":2481,"creation":"Oct 5, 2019 4:56:42 PM","modification":"Oct 5, 2019 4:56:42 PM"}
