{"id":84068,"no":46,"title":"Page 46","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t feel bad, Lydia, because I hate them. I want them all to die. I don\u0027t care what they are or once were. And when I knew he would be one of those things, he stopped being human to me and I killed him. And I don\u0027t fucking feel bad!\"\u003c/p\u003e\n\u003cp\u003eLydia leaned down and gently kissed Katie\u0027s forehead. \"I know, baby. I know. But there is more, isn\u0027t there?\"\u003c/p\u003e\n\u003cp\u003eKatie drew back. \"I don\u0027t want to talk about it.\"\u003c/p\u003e\n\u003cp\u003e\"Katie, tell me.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t!\" Katie stood up and wiped at her face with trembling fingers.\u003c/p\u003e\n\u003cp\u003eLydia slowly stood up and took Katie\u0027s face between her hands. With infinite tenderness and love, she kissed Katie\u0027s lips. Katie clung to her and kissed her back.\u003c/p\u003e\n\u003cp\u003e\"I love you, Lydia. I should have…\"\u003c/p\u003e\n\u003cp\u003eLydia lightly kissed her again. \"Tell me.\"\u003c/p\u003e\n\u003cp\u003eKatie shivered and whispered against Lydia\u0027s soft lips, \"Oh, gawd…\"\u003c/p\u003e\n\u003cp\u003e\"Tell me.\"\u003c/p\u003e\n\u003cp\u003e\"I should have killed you!\"\u003c/p\u003e\n\u003cp\u003eLydia nodded and drew back. Her figure began to alter before Katie\u0027s eyes. Lydia looked down at her chest as a huge hole opened slowly and her emptiness was revealed. Raising milky eyes, Lydia whispered, \"You should have.\"\u003c/p\u003e\n\u003cp\u003eAnd then she rushed Katie screaming.\u003c/p\u003e\n\u003cp\u003eKatie awoke, tumbled off the plastic chair, and landed hard on the roof.\u003c/p\u003e\n\u003cp\u003eTravis was there in an instant, helping her up.\u003c/p\u003e\n\u003cp\u003e\"Geezus, you\u0027re shaking,\" he said with concern.\u003c/p\u003e\n\u003cp\u003eKatie looked around, terrified. Her fingers gripped his shirt tightly as she swung her head around, looking desperately for the ghoul from her nightmare. But the rooftop was empty except for them.\u003c/p\u003e\n\u003cp\u003e\"Travis,\" she sobbed.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here,\" he answered, his gaze concerned.\u003c/p\u003e\n\u003cp\u003e\"Travis, I let her down,\" Katie choked out, then collapsed against him, weeping.\u003c/p\u003e\n\u003cp\u003eHe wrapped his arms around her and held her tight, feeling her trembling violently against him. Tenderly, he stood stroking her hair as the woman cried, not understanding her rambling words. But he knew her heart was broken and his broke for her.\u003c/p\u003e\n\u003cp\u003eAt last, he helped her down the stairs back to her room. She walked slowly, weakly, and leaned heavily against him. When he entered, Jenni was just lying down. Seeing Katie, she immediately sprang up and took her from him.\u003c/p\u003e\n\u003cp\u003e\"Katie, honey, what is it?\"\u003c/p\u003e\n\u003cp\u003eTravis released Katie reluctantly and watched Jenni help her lay down.\u003c/p\u003e\n\u003cp\u003eHe stood awkwardly as Katie reached out to Jenni and they clasped hands.\u003c/p\u003e\n\u003cp\u003e\"Lydia,\" Katie said in a clear voice at last. \"She\u0027s still out there-one of them.\"\u003c/p\u003e\n\u003cp\u003eJenni knelt next to the cot and sighed. \"I know, Katie.\"\u003c/p\u003e\n\u003cp\u003eTravis said, rather lamely he thought later, \"I think she\u0027s upset.\"\u003c/p\u003e\n\u003cp\u003eJenni looked up at him and nodded. \"Yeah.\" She stood, pushed her cot up to Katie\u0027s, and lay down. \"I\u0027ll take care of her.\"\u003c/p\u003e\n\u003cp\u003eKatie seemed to relax as Jenni curled up next to her and held her hand.\u003c/p\u003e\n\u003cp\u003eTravis nodded and backed out of the room slowly. He turned and shut the door behind him.\u003c/p\u003e\n\u003cp\u003eJuan was coming up the stairs smoking despite all the \"Thank You For Not Smoking\" signs all over the city hall. The recovery team had brought back beer and cigarettes from the grocery store and Juan was a happy man. He hesitated when he saw Travis.\u003c/p\u003e\n\u003cp\u003e\"Ever see Chasing Amy? \" Juan asked after a beat.\u003c/p\u003e\n\u003cp\u003e\"No,\" Travis answered.\u003c/p\u003e\n\u003cp\u003e\"Eh, yer fucked,\" Juan decided.\u003c/p\u003e\n\u003cp\u003e\"Yeah.\" Travis looked at the door.\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m off to get shut eye. Loca and I are heading out tomorrow around noon.\"\u003c/p\u003e\n\u003cp\u003e\"Take it easy out there,\" Travis answered automatically.\u003c/p\u003e\n\u003cp\u003e\"As long as Loca doesn\u0027t shoot me in the ass, it should be just fine.\" Juan grinned and walked on.\u003c/p\u003e\n\u003cp\u003eTravis looked back at the closed door and thought of Jenni\u0027s expression when she had seen Katie. The compassion in her eyes had touched him deeply. Yeah, he shared something with Katie, but it didn\u0027t seem to compare to the bond the women had.\u003c/p\u003e\n\u003cp\u003eAnd it made him feel very alone.\u003c/p\u003e\n\u003cp\u003eHe walked on slowly, deep in thought.\u003c/p\u003e\n\u003cp\u003e4. Not Always As It Seems\u003c/p\u003e\n\u003cp\u003e“Coast is clear!\"\u003c/p\u003e\n\u003cp\u003eJuan nodded to Jenni and she quickly let herself down the ladder and onto the main street. It was empty of bodies and covered in about a half foot of rich fresh earth. It didn\u0027t smell nearly as bad as it had. She walked quickly and confidently to the city truck Juan had pointed out to her. He had once worked for the city as a maintenance guy and was sure it was reliable and ready to go.\u003c/p\u003e\n\u003cp\u003eJuan dropped down behind her, walking with his rifle in his hands. His long hair flowed curly and crazed from beneath his cowboy hat.\u003c/p\u003e\n\u003cp\u003e\"Almost seems like a normal day,\" he said.\u003c/p\u003e\n\u003cp\u003eJenni looked around and nodded. \"Want to go by McDonald\u0027s for a McGriddle?\"\u003c/p\u003e\n\u003cp\u003e\"Do not torture me, Loca. I loved those fuckers.\"\u003c/p\u003e\n\u003cp\u003eThe truck perimeter had been moved outward and now a new wall was being erected directly behind it. Also, the storage containers were moved off to their new location as the first of the \"locks\" was built. Everyone was working hard. Well, except for Old Man Watson. He sat around, smiling, nodding and look pretty oblivious to what was going down.\u003c/p\u003e\n\u003cp\u003eJenni drew closer to the truck and ducked down to make sure there was nothing under the truck. Satisfied, she peered into the cab, then opened the door and slid in. Juan followed suit and slammed his door.\u003c/p\u003e\n\u003cp\u003e\"Okay, we are taking the shortest route there. Anything jumps up and follows us, we don\u0027t do anything fancy unless we have to. Okay?\"\u003c/p\u003e\n\u003cp\u003eJenni nodded. \"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"Promise me.\"\u003c/p\u003e\n\u003cp\u003eJenni gave him her snootiest look. \"I promise.\"\u003c/p\u003e\n\u003cp\u003eJuan rolled his eyes and started the truck.\u003c/p\u003e\n\u003cp\u003eJenni settled back in her seat and rested her rifle across her knees. They had actually received a briefing from Mike. They were to stick together and at the first sign of more than one or two zombies, they were to run for safety. If possible, they were to get to a safe position and take out the zombies.\u003c/p\u003e\n\u003cp\u003eManpower was spread thin, so two men crews were being trained by Mike.\u003c/p\u003e\n\u003cp\u003eDespite their bickering, Juan and Jenni had actually done quite well together and felt confident.\u003c/p\u003e\n\u003cp\u003eJenni watched the buildings gliding by her window thoughtfully. Many of the businesses were shut down, their fronts boarded up.\u003c/p\u003e\n\u003cp\u003e\"The town was dying,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Pretty much dead. A developer came in and sold the city council on a big plan to revive it. In the old days, the hotel was actually a prime spot for the old Hollywood stars to come and relax while hunting out in these hills.\u003c/p\u003e\n\u003cp\u003eThe construction site was an old theater that one of those old stars from this area actually built for shows. We\u0027re talking early 20s. Not even talkies, but silent films. So the developer was going to tap into that and raise up a whole little bit of old Hollywood here. Even had others interested in buying up the old stores and making them into retro style diners, etc, etc. The big clincher of all this was lobbying to get gambling legalized in the county. It was a crazy idea, but the guy has…had money.\" Juan shrugged. \"I thought it sounded like a load of shit, but it gave a lot of us jobs.\"\u003c/p\u003e\n\u003cp\u003eJenni thought this over. \"I\u0027m sure Vegas thought the same thing, huh?\"\u003c/p\u003e\n\u003cp\u003eJuan laughed. \"Yeah, probably.\"\u003c/p\u003e\n\u003cp\u003eThe truck turned down a residential road and they both tensed. There was more of a chance of the undead in this area than in the shutdown downtown area.\u003c/p\u003e\n\u003cp\u003eJuan swerved around a bike in the middle of the road, dried blood and guts clinging to its frame.\u003c/p\u003e\n\u003cp\u003e\"Fucked up world,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003eJenni glanced into the large picture window of a house as they passed. A woman and little boy stood inside beating on the window. Neither one of them was alive.\u003c/p\u003e\n\u003cp\u003e\"There are still more, trapped inside houses.\"\u003c/p\u003e\n\u003cp\u003e\"And outside,\" Juan said and the truck bounced as they ran over a legless zombie.\u003c/p\u003e\n\u003cp\u003eJenni giggled a little.\u003c/p\u003e\n\u003cp\u003e\"Yer really a sick chica,\" Juan said, and his voice seemed to be tinged with appreciation.\u003c/p\u003e\n\u003cp\u003e\"Yep. Pretty much.\" She flashed her biggest smile at him.\u003c/p\u003e\n\u003cp\u003e\"Too bad yer gay. I might actually ask your sick ass out.\"\u003c/p\u003e\n\u003cp\u003eJenni rolled her eyes. \"Oh, please. I\u0027m so not gay.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, c\u0027mon. Everyone knows about you and Katie.\" Juan made a really obscene gesture with his mouth.\u003c/p\u003e\n\u003cp\u003eJenni immediately flipped him off. \"Not gay.\"\u003c/p\u003e\n\u003cp\u003e\"Yep.\"\u003c/p\u003e\n\u003cp\u003e\"Nope.\"\u003c/p\u003e\n\u003cp\u003e\"Yep.\"\u003c/p\u003e\n\u003cp\u003e\"Nope.\"\u003c/p\u003e\n\u003cp\u003e\"Yep.\"\u003c/p\u003e\n\u003cp\u003e\"Love the penis, I can assure you,\" Jenni said and wagged an eyebrow.\u003c/p\u003e\n\u003cp\u003eJuan nearly drove into a car. \"Shit, girl!\"\u003c/p\u003e\n\u003cp\u003e\"I do! I was a married woman! I love men. Not you, other men, but I love men.\"\u003c/p\u003e\n\u003cp\u003e\"So you and Katie aren\u0027t…\" Juan made another obscene gesture and Jenni smacked him.\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" He sounded rather disappointed.\u003c/p\u003e\n\u003cp\u003e\"I kinda like Travis, honestly.\"\u003c/p\u003e\n\u003cp\u003eJuan blinked. \"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I think he\u0027s got a hard on for your former girlfriend.\"\u003c/p\u003e\n\u003cp\u003eJenni blinked. \"Huh?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Katie. Though I\u0027m sure he thinks you are a fine piece of ass. Loca, but fine.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-first-days-as-the-world-dies-1/page-46.html","bookId":2481,"creation":"Oct 5, 2019 4:56:42 PM","modification":"Oct 5, 2019 4:56:42 PM"}
