{"id":84027,"no":5,"title":"Page 5","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"Okay. I can do that. But we should leave Jack in the truck. He\u0027s really groggy,\" Jenni answered. She looked frail in her pink nightgown and robe and bare feet.\u003c/p\u003e\n\u003cp\u003e\"Agreed. Now listen, again, carefully, we don\u0027t take any risks. We don\u0027t shoot anything unless we have to. That box at your feet-those are the only shotgun shells we have.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\" Jenni answered and frowned. \"We need more.\"\u003c/p\u003e\n\u003cp\u003e\"I know, but a convenience store is not really the place to find them. So no fancy shooting, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Gotcha, \"Jenni answered and slid out of the truck.\u003c/p\u003e\n\u003cp\u003eLeaping out of the truck, Katie quickly slid her small wallet out of her trouser pocket. In this moment, she was so glad she despised purses, otherwise the wallet would have been far away in her old car. Swiping the card, she watched the digital display anxiously.\u003c/p\u003e\n\u003cp\u003eIt flashed \"Authorizing\" over and over again.\u003c/p\u003e\n\u003cp\u003e\"You have to come in and swipe it. The scanner isn\u0027t working out there,\" a disembodied voice said.\u003c/p\u003e\n\u003cp\u003eBoth Katie and Jenni started at the sound of a young man\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eJenni whirled around, shotgun ready.\u003c/p\u003e\n\u003cp\u003e\"You have to come in and swipe the card,\" the voice persisted.\u003c/p\u003e\n\u003cp\u003eKatie realized the speaker on a column next to her was hissing. For a moment, she could not believe what she was hearing. The world was falling apart, Lydia was dead, and some teenager was still working his shift at the gas station?\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be right in,\" Katie answered and looked at Jenni. \"He mustn\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eJenni just blinked at her.\u003c/p\u003e\n\u003cp\u003eMystified, Katie strode swiftly across the parking lot and into the convenience store. The dimly lit interior threw off her vision for a moment, then she saw a very tall, scraggly teenager standing behind the counter beside a very short Hispanic girl.\u003c/p\u003e\n\u003cp\u003e\"The reader outside broke and we have to swipe inside,\" the boy explained again.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t know, do you?\" Katie arched an eyebrow and the boy looked at her warily.\u003c/p\u003e\n\u003cp\u003eSuddenly the Hispanic girl gasped and backed away from the counter.\u003c/p\u003e\n\u003cp\u003eKatie ducked from the door, then realized it was Jenni holding the shotgun.\u003c/p\u003e\n\u003cp\u003e\"Look, please don\u0027t hold us up! We don\u0027t have that much money!\" The boy held up his hands, his eyes huge.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not holding you up. You really don\u0027t know what is going on, do you?\" Katie walked swiftly to the counter, still clutching her credit card.\u003c/p\u003e\n\u003cp\u003e\"Uh, no.\" The boy was trying to look calm and brave, but he was sweating profusely.\u003c/p\u003e\n\u003cp\u003eThe girl behind him was holding onto his arm so tight that Katie could see blood pooling under nails.\u003c/p\u003e\n\u003cp\u003e\"The city has gone insane. It\u0027s burning! People are dead and…and…\"\u003c/p\u003e\n\u003cp\u003eShould she tell him that the dead apparently were getting up and eating everyone?\u003c/p\u003e\n\u003cp\u003e\"Zombies. It\u0027s zombies, \"Jenni said.\u003c/p\u003e\n\u003cp\u003eKatie sighed, rolled her eyes and exhaled slowly. \"What she said.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, right,\" the boy said sarcastically.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know if they are really zombies, but there is something going on that has people attacking other people like maniacs,\" Katie explained.\u003c/p\u003e\n\u003cp\u003e\"Kinda like you two?\"\u003c/p\u003e\n\u003cp\u003e\"No. With their bare hands.\" Katie watched the look of disbelief on the boy\u0027s face grow deeper. \"Look, swipe my card. We need gas to get the fuck out of here.\"\u003c/p\u003e\n\u003cp\u003eThe boy frowned. \"You\u0027re really not good with this holding up stuff, are you? You\u0027re not supposed to pay.\"\u003c/p\u003e\n\u003cp\u003e\"Just swipe the gawddamn card already!\" Katie waved it in his face.\u003c/p\u003e\n\u003cp\u003e\"We really should get lots of food. And some more gas canisters,\" Jenni said behind her.\u003c/p\u003e\n\u003cp\u003eThe boy swiped the card and looked at them with growing unease. \"You guys are on the run, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, like I told you. The city has gone insane-\"\u003c/p\u003e\n\u003cp\u003e\"With zombies,\" Jenni added helpfully.\u003c/p\u003e\n\u003cp\u003eKatie really didn\u0027t think the Hispanic girl could get any paler.\u003c/p\u003e\n\u003cp\u003eSuddenly there was a screech of tires outside and they all turned to see two cars pull up. Both were fully loaded with people, all Hispanic. Men with guns leaped out and ran into the store.\u003c/p\u003e\n\u003cp\u003e\"Papa!\" The Latina girl looked relieved and ran toward one of the men.\u003c/p\u003e\n\u003cp\u003eA flurry of Spanish followed and suddenly the girl looked like a ghost.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m leaving! My grandma ate my aunt!\"\u003c/p\u003e\n\u003cp\u003eAnd she was gone, running with her family out to their cars.\u003c/p\u003e\n\u003cp\u003eKatie turned back to look at the boy whose mouth was hanging open.\u003c/p\u003e\n\u003cp\u003eFrom behind her, Jenni said, \"Told you.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t believe you.\"\u003c/p\u003e\n\u003cp\u003e\"Then you are going to die,\" Katie said firmly and grabbed her card from him.\u003c/p\u003e\n\u003cp\u003eThe day was growing warmer as the sun rose steadily over the hills. The breeze brushing back her blond hair was almost hot and not very soothing. It felt grainy and harsh.\u003c/p\u003e\n\u003cp\u003eKatie sighed and kept watch as the pump slowly clunked away behind her filling up the old truck\u0027s tank. Jack, groggy from his early morning surgery, sat behind the steering wheel inside the cab watching her. Every few seconds he would look around nervously. She wondered how much the dog had seen as he lay in his crate secured in the back of the truck this morning.\u003c/p\u003e\n\u003cp\u003eThe dog glanced toward her and their eyes met. He let out a light woof and she got the impression he was telling her so far so good.\u003c/p\u003e\n\u003cp\u003eThe pump clicked off and she quickly set about screwing the cap back onto the gas tank.\u003c/p\u003e\n\u003cp\u003eShe was struggling to feel real. This world felt real. Seemed real. A teenage boy manned the register of a country road gas station while she pumped gas on fresh spring day. That fact seemed real.\u003c/p\u003e\n\u003cp\u003eBut it wasn\u0027t the true reality.\u003c/p\u003e\n\u003cp\u003eInside, her new companion was rushing around filling plastic bags while the boy dutifully swiped each and every item, charging them on her credit card. Meanwhile, Katie held the shotgun in one hand and kept a keen eye on the terrain around her. Save for a small red hatchback tucked into the hedges next to the gas station, the white truck was the only vehicle around.\u003c/p\u003e\n\u003cp\u003eThis was not an ordinary day.\u003c/p\u003e\n\u003cp\u003eLydia was dead. And Jenni\u0027s son and husband were somewhere far behind them running amok trying to…trying to…\u003c/p\u003e\n\u003cp\u003eKatie moved across the parking lot and swept her gaze back and forth, at times walking backwards, the shotgun at the ready, the shells jiggling in her pocket. Shoving the door open with her elbow, she entered the convenience store.\u003c/p\u003e\n\u003cp\u003eJenni rushed past her and Katie saw she had found some flip-flops on a shelf somewhere to wear.\u003c/p\u003e\n\u003cp\u003eJenni whirled about. \"Do you want coffee? I didn\u0027t get my coffee this morning.\"\u003c/p\u003e\n\u003cp\u003eKatie blinked and nodded. \"Yeah. Black.\"\u003c/p\u003e\n\u003cp\u003eJenni nodded and ran to the dispenser.\u003c/p\u003e\n\u003cp\u003e\"Look, if you are not holding me up, you better put that way because my manager will be here soon to relieve me.\"\u003c/p\u003e\n\u003cp\u003eKatie considered punching the boy.\u003c/p\u003e\n\u003cp\u003eThere were at least ten bags piled near the door. One of them had dog food.\u003c/p\u003e\n\u003cp\u003eJenni rushed up. \"Give me the keys. I\u0027m going to back the truck up.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Take the shotgun.\" Katie handed it over and whispered, \"I need to go to the ladies room.\"\u003c/p\u003e\n\u003cp\u003e\"I already went. Stuff some toilet paper in your jacket pocket. I could only grab one half-roll. It\u0027s really way too expensive to buy here.\" Jenni was out the door. She rushed across the parking lot with her bathrobe flowing behind her with the shotgun held firmly in her hands.\u003c/p\u003e\n\u003cp\u003eKatie looked over at the teenager. \"Don\u0027t you have a radio or a TV somewhere around here to listen to? To check and see if what we are saying is true?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s against the regulations. Our owner is a man of principles and he believes that we should not inflict our modern music and bad news on our customers, but greet them with a smile and a friendly conversation.\"\u003c/p\u003e\n\u003cp\u003e\"You had to memorize that, huh?\"\u003c/p\u003e\n\u003cp\u003eThe boy blinked blankly. \"Yeah. Look, lady, zombies don\u0027t exist. I think you\u0027re criminals on the run. And Lucy is always flaking and running away from work. I\u0027m not going to leave my shift and get fired.\"\u003c/p\u003e\n\u003cp\u003eKatie laughed, her hands resting on her hips, then shook her head.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to end up dead if you keep acting like a good little drone. The world is over. Finished. It\u0027s all different now. You better stop following and start acting.\" With that, she escaped into the bathroom.\u003c/p\u003e\n\u003cp\u003eAfter a few minutes, she washed her hands in lukewarm water and gazed at her face in the spotted and scuffed mirror. The lighting did her no favors.\u003c/p\u003e\n\u003cp\u003eShe looked washed out and drawn. She looked older and tired. Just about how she felt, now that she thought about it. Reaching for the door, she heard raised voices and felt her body quiver anxiously. Her stomach fluttered and she hesitated.\u003c/p\u003e\n\u003cp\u003eWhat if those things were outside and all she had were two pockets full of toilet paper and damp hands to defend herself?\u003c/p\u003e\n\u003cp\u003eShe realized the voices were arguing and not screaming and she heaved the door open and walked briskly toward the front of the store.\u003c/p\u003e\n\u003cp\u003eA man in an expensive silk suit, minus the coat, was standing in the front of the store shouting at Jenni. She stood quietly, head down. Katie took notice that the shotgun was hidden in the folds of Jenni\u0027s bathrobe.\u003c/p\u003e\n\u003cp\u003e\"…and I don\u0027t need a mental case ruining my morning. I have a very important meeting at eleven AM in the city and I don\u0027t need to deal with retarded country hicks.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-first-days-as-the-world-dies-1/page-5.html","bookId":2481,"creation":"Oct 5, 2019 4:56:42 PM","modification":"Oct 5, 2019 4:56:42 PM"}
