{"id":84074,"no":52,"title":"Page 52","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"The clinic. There is a kid on a motorbike heading around the block to get into the gate.\"\u003c/p\u003e\n\u003cp\u003e\"Gawddammit!\" It was obvious that Juan\u0027s voice was terrified.\u003c/p\u003e\n\u003cp\u003eKatie headed down the stairs, running as fast as she could. Even from across the great distance between Travis\u0027 post and the new entrance, Katie could hear Juan shouting.\u003c/p\u003e\n\u003cp\u003e\"Shut the gate! Shut the gate!\"\u003c/p\u003e\n\u003cp\u003eTravis caught up with Katie and they both sprinted to the post that would overlook the approach to the gate. More people came running, grabbing up their guns and spears. The squeal of the gears as the gate started to close filled the night air. Already some of the construction workers were trying to scramble up the ladders out of the new area to safety.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on?\" Jenni caught up to them at the platform and looked down the road.\u003c/p\u003e\n\u003cp\u003eThe guard at this post already had aimed his spotlight down the road and it illuminated the two teenagers on the motorbike just turning around the corner. Soon after them, the zombies followed.\u003c/p\u003e\n\u003cp\u003e\"The idiot\u0027s leading them right toward the open gate,\" Travis growled.\u003c/p\u003e\n\u003cp\u003eKatie glanced over into the new area and saw the gate was still closing.\u003c/p\u003e\n\u003cp\u003eJuan and two other men were trying to oil the gears and watch the mechanism controlling the gate as it slowly closed.\u003c/p\u003e\n\u003cp\u003e\"We didn\u0027t have enough fucking time,\" Juan shouted up toward them.\u003c/p\u003e\n\u003cp\u003e\"Not enough fucking time!\"\u003c/p\u003e\n\u003cp\u003eMore of the construction workers made it over into the fort, breathing heavily, terrified.\u003c/p\u003e\n\u003cp\u003eThe continuous loud screeching noise of the gate drawing closed ripped at her ears and Katie lifted her rifle to try to get a clear shot of the zombies. It was hard to get a bead on any of them with the kids on the sputtering motorbike swerving back and forth, both obviously panicking.\u003c/p\u003e\n\u003cp\u003eThe gate seemed to be taking forever to close. The motorbike scooted through the now narrow gap in the gates and a few people cheered. The zombies hit the gate and began to push through the gap that was only wide enough for one person to squeeze through at a time. Shots began to fill the air as people on the walls opened fire on the zombies still rushing down the road.\u003c/p\u003e\n\u003cp\u003e\"Juan!\" Jenni ran across the bridge between the two walls.\u003c/p\u003e\n\u003cp\u003eKatie followed, trying to avoid some of the men scrambling into the fort.\u003c/p\u003e\n\u003cp\u003eJenni reached the top of the other wall and knelt. The first zombie was pushing his way into the new area and the last two men with Juan were now climbing the ladders. Jenni aimed and fired and the first zombie\u0027s head split open. It was lodged between the two gates that were still trying to close.\u003c/p\u003e\n\u003cp\u003eJuan ran toward the opening, a shovel in one hand.\u003c/p\u003e\n\u003cp\u003eMeanwhile, the two kids were trying to climb up a ladder, both of them trying to use the same one, jostling each other in their haste. Katie ignored them and moved down the top of the wall to a better position to fire at anything coming through the gate. Jenni almost slid down the empty ladder in her desperation to help Juan.\u003c/p\u003e\n\u003cp\u003eJuan began to shove the dead corpse back out from between the gates with the shovel as the desperate hands of the zombies behind the corpse tried to reach out and grab him. Katie watched in horror as Jenni ran straight up to Juan.\u003c/p\u003e\n\u003cp\u003e\"Loca, what are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"Saving your ass,\" Jenni answered and swung her rifle upwards. She stood right next to Juan and started sighting the heads of those behind the dead zombie and fired through the narrow gap in the gates.\u003c/p\u003e\n\u003cp\u003e\"Jenni is fucking nuts,\" Travis said from beside Katie, then started down one of the ladders.\u003c/p\u003e\n\u003cp\u003eJuan\u0027s only advantage in the shoving match he was engaged in with the zombies was that the dead body was well lodged between the gates. It was slowly being pushed forward and soon the \"living\" zombies would be able to try to squeeze through. Travis landed in the new area and ran to help as Katie stood ready to fire at anything that broke in. Behind her, she could hear the shots of those trying to thin out the crowd of zombies at the back at the pack.\u003c/p\u003e\n\u003cp\u003eThe dead zombie body shuddered and to their horror a hand burst through his ribcage. A grotesquely gnawed face shoved itself past the other zombies ruined head. It was literally ripping apart the corpse to get to the living.\u003c/p\u003e\n\u003cp\u003e\"Fuck you,\" Jenni said, and blew its head off.\u003c/p\u003e\n\u003cp\u003eBut the damage was done and the first zombie\u0027s body crumpled and more of the animated ones pushed forward, trampling the \"dead\" ones beneath their feet.\u003c/p\u003e\n\u003cp\u003eTravis grabbed another shovel and joined Juan in shoving them back as the gate managed to close another inch or two. The whine of the mechanism filled their ears. Jenni kept trying to shoot at the zombies through the narrow gap and not get in the men\u0027s way.\u003c/p\u003e\n\u003cp\u003eKatie stood at her watch post feeling helpless. Her arms were aching from holding her rifle up for so long, but she didn\u0027t dare look away or blink.\u003c/p\u003e\n\u003cp\u003eButterflies were gnawing away at her stomach hungrily as she tried to think about how vulnerable both Travis and Jenni were.\u003c/p\u003e\n\u003cp\u003eMike appeared beside her and climbed down as fast as he could.\u003c/p\u003e\n\u003cp\u003eRunning to join the others, he grabbed a wood plank from a pile of lumber.\u003c/p\u003e\n\u003cp\u003eAvoiding the grasping hands of the dead, he let it fall against the zombies, who grabbed onto it, to either push it away or pull it away.\u003c/p\u003e\n\u003cp\u003e\"Good idea,\" Juan said. And he put the tip of the shovel against the board on the top as Travis pushed on the bottom. Instead of soft bodies that gave way, the shovels pushed against the hard firm surface of the plank and it gave the men adequate leverage. Mike and Jenni joined them and using the board as a shield, they shoved the zombies back through the gap. The gate shuddered and leaped closed. The men barely got the shovels out of the way in time.\u003c/p\u003e\n\u003cp\u003eKatie sighed with relief and lowered the rifle. A few arms, hands and feet were sticking out from between the closed gates. Some were even moving.\u003c/p\u003e\n\u003cp\u003eJenni picked up a shoved and began hacking at the limbs, severing them, blood flying, until Juan pulled her back. Jenni flung her arms around him and they both staggered backwards, then fell into a heap. Travis and Mike high-fived and Travis smiled up at Katie.\u003c/p\u003e\n\u003cp\u003e\"See, Katie. Easy.\"\u003c/p\u003e\n\u003cp\u003eKatie laughed and ran a hand over her forehead, feeling the thick sweat slick on her fingers.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re fucking crazy, Loca,\" Juan teased Jenni as he helped her to her feet.\u003c/p\u003e\n\u003cp\u003e\"I kept your ass alive!\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, so, what, I owe you?\"\u003c/p\u003e\n\u003cp\u003e\"Yep!\"\u003c/p\u003e\n\u003cp\u003eJuan pulled out his wallet and thumbed through some now obsolete bills. \"How about a buck.\"\u003c/p\u003e\n\u003cp\u003eJenni smacked him and they ended up in a shoving war.\u003c/p\u003e\n\u003cp\u003eIt was then that Belinda made her appearance, climbing down the ladder, tears streaming down her face. Katie saw Jenni quickly back away from Juan and Juan looked up expectantly.\u003c/p\u003e\n\u003cp\u003eBut Belinda ran to Mike, flung her arms around him, and they clung to each other. Travis even looked surprised. Juan\u0027s expression was beyond words.\u003c/p\u003e\n\u003cp\u003eKatie watched as Jenni walked up to Juan and put her hand lightly on his shoulder.\u003c/p\u003e\n\u003cp\u003eBut there was no time to really understand what was going on, because the fort was victorious once more and cheers were going up. People came swarming over the bridge to climb down the ladders to great their heroes.\u003c/p\u003e\n\u003cp\u003eTravis accepted their hugs and handshakes, smacks on the back, and even a kiss on the cheek or two, but he finally managed to make it up to Katie on the wall.\u003c/p\u003e\n\u003cp\u003eGrabbing her close, he kissed her lips lightly. \"I\u0027m not giving up, okay?\u003c/p\u003e\n\u003cp\u003eI\u0027m going to wait.\"\u003c/p\u003e\n\u003cp\u003eKatie was in tears and nodded and hugged him tightly back. \"It may be a long time. Maybe not ever.\"\u003c/p\u003e\n\u003cp\u003eTravis laughed and smiled down at her. \"I can wait…\"\u003c/p\u003e\n\u003cp\u003eThe image of Lydia flickered in her mind\u0027s eye and Katie closed her eyes and hugged Travis tight.\u003c/p\u003e\n\u003cp\u003e\"I can wait, Katie,\" a voice said. And she wasn\u0027t sure if it was Lydia or Travis and she was afraid.\u003c/p\u003e\n\u003cp\u003eChapter 19\u003c/p\u003e\n\u003cp\u003e1. Twists and Turns\u003c/p\u003e\n\u003cp\u003eJenni followed Juan through the throng of celebrants and up out of the new entryway. Mike and a few other workers were busy hacking off the limbs of the zombies who had managed to push an arm or a leg through the gates as it closed. Juan wasn\u0027t talking and Jenni knew why.\u003c/p\u003e\n\u003cp\u003eBelinda rushing to Mike had startled everyone. She had briefly seen Travis and Katie embracing and in that moment had realized what Juan had told her was true. The tall, handsome man with the sad eyes was in love with her best friend.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t bother her, though. Her crush on Travis had long faded. The more she hung out with him, the more she realized she just saw him as a guy friend. For awhile she had flirted with him outrageously and he had obviously enjoyed it, but he had never noticed or taken her cues that she was ready to be ravished. Now she was glad he had been oblivious. Being tangled up with Travis would have only complicated everything.\u003c/p\u003e\n\u003cp\u003eOf course it was complicated enough because Katie was gay. She felt pretty bad that Travis was setting himself up for a world of hurt.\u003c/p\u003e\n\u003cp\u003eOf course, Juan was feeling that hurt all too clearly right now.\u003c/p\u003e\n\u003cp\u003e\"Juan?\"\u003c/p\u003e\n\u003cp\u003e\"Loca, I\u0027m not in the mood,\" Juan answered briskly as he headed down into the fort.\u003c/p\u003e\n\u003cp\u003e\"I was just going to say how sorry-\"\u003c/p\u003e\n\u003cp\u003eJuan turned toward her, pointing at her with a fierce look on his face.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t.\"\u003c/p\u003e\n\u003cp\u003eJenni nodded. \"Okay.\"\u003c/p\u003e\n\u003cp\u003eJuan turned on the very muddy, gory heels of his cowboy boots and headed straight for the city hall. Peggy was there talking to the two newcomers. Curtis was there as well. Things already looked strained and heated and Juan marched right up to the young man and punched him square in his greasy face. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-first-days-as-the-world-dies-1/page-52.html","bookId":2481,"creation":"Oct 5, 2019 4:56:42 PM","modification":"Oct 5, 2019 4:56:42 PM"}
