{"id":84031,"no":9,"title":"Page 9","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"We were just trying to help,\" Jenni pouted.\u003c/p\u003e\n\u003cp\u003e\"I know,\" Katie answered and ran her fingers through her hair slowly.\u003c/p\u003e\n\u003cp\u003eShe massaged the tender, knots on the top of her head with her fingertips and tried to relax. Her whole body was tense and painful. She had just run over a woman and reduced her to road kill. And yet, she had no regrets. In this new world, violence was the way to redemption.\u003c/p\u003e\n\u003cp\u003eIf only she could have released Lydia…\u003c/p\u003e\n\u003cp\u003eJenni looked grumpy as she propped her feet up on the dashboard. \"He could have listened to us. We could have helped him.\"\u003c/p\u003e\n\u003cp\u003e\"Not everyone understands what is going on,\" Katie said after a beat.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m still adapting.\"\u003c/p\u003e\n\u003cp\u003eSighing, Jenni pulled the dog close to her.\u003c/p\u003e\n\u003cp\u003eThey lapsed into silence and continued down the road.\u003c/p\u003e\n\u003cp\u003e2. Keep Moving Until You Stop\u003c/p\u003e\n\u003cp\u003eKeep moving, Katie. Keep moving, her father\u0027s voice whispered in her mind.\u003c/p\u003e\n\u003cp\u003eHad he really said those words?\u003c/p\u003e\n\u003cp\u003eShe sighed and shifted in her seat. The air conditioning was blowing full blast making it nice and cool in the cab despite the hot sun blazing through the windshield. It was a pull on the tank of gas, but it was too hot to go without running it anymore. It was near four o\u0027clock in the afternoon and the hottest part of the day.\u003c/p\u003e\n\u003cp\u003eJack and Jenni had dozed off beside her. Jenni\u0027s head slightly rested on Katie\u0027s thigh and her black hair fell around her pale face. Her body was curled up under the hunting jacket. Jack the German Shepherd, no more than an overgrown puppy really, lay against her.\u003c/p\u003e\n\u003cp\u003eThey were both snoring.\u003c/p\u003e\n\u003cp\u003eIt soothed Katie\u0027s nerves for some strange reason.\u003c/p\u003e\n\u003cp\u003eDamn erratic weather had it cold in the mornings, roasting by noon, and cool in the evenings. Right now it was at full broil.\u003c/p\u003e\n\u003cp\u003eShe had finally kicked off her shoes. Her sleeveless silk tank and navy blue trousers seemed brutally out of place in her new existence. She would need to find some better clothes soon. But where, was a good question. For miles there had been nothing more than farmland and forest and occasionally a house set back from the road.\u003c/p\u003e\n\u003cp\u003eOn one small farm road, they had passed a farm that had its workers patrolling the grounds with guns. One of them had motioned for them to slow down, but Katie\u0027s gut had clenched at the sight of one of those workers heavily bandaged arm and they had sped by.\u003c/p\u003e\n\u003cp\u003eThey couldn\u0027t take chances anymore.\u003c/p\u003e\n\u003cp\u003eBut they weren\u0027t the only paranoid ones. They had to go around a very small town that had its roads blocked with armed men standing at the ready.\u003c/p\u003e\n\u003cp\u003eA huge makeshift sign had read \"No out of towners allowed.\" It made sense, actually, if the people from the big cities, like them, were trying to seek refuge in the countryside. There was no assurance that the city folk weren\u0027t bringing the infection with them.\u003c/p\u003e\n\u003cp\u003eLooming ahead of the truck were more hills and more trees. It felt peaceful and surreal. Usually at this time of the day she was either in court or buried under stacks of paperwork. Her tummy would be full of takeout food and she\u0027d be text-messaging Lydia back and forth as the day went on.\u003c/p\u003e\n\u003cp\u003eInstead…\u003c/p\u003e\n\u003cp\u003eShe looked down at Jenni and sighed.\u003c/p\u003e\n\u003cp\u003eJenni unnerved her. She was a very lovely young woman with her dark hair and eyes and luminous skin. Jenni was a battered wife and the faint bruising on her legs and one arm only confirmed her abuse. And, as Lydia had often pointed out, Katie wanted to save the world and everyone in it.\u003c/p\u003e\n\u003cp\u003eAlready Katie felt very protective toward Jenni. She would do everything she could to take care of both of them and give them both a chance to live.\u003c/p\u003e\n\u003cp\u003eThat thought gave her purpose, gave her the will to move on and not stare at the picture of Lydia captured on her cell phone.\u003c/p\u003e\n\u003cp\u003eAbove the trees, an enormous billboard suddenly rose up.\u003c/p\u003e\n\u003cp\u003eToombs Hunting Store-Stop now before you shoot!\u003c/p\u003e\n\u003cp\u003eShe laughed at the sign and shook her head. Country people were one of a kind. She reached down and gently stroked Jenni\u0027s hair.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re gonna be okay,\" she promised the sleeping woman.\u003c/p\u003e\n\u003cp\u003eThe truck crested a hill and down below was a town, if it could be called a town. Six buildings, four on the left, two on the right, lined the road. Behind the buildings were fields and trees and Katie could see a smattering of houses and trailers making up the town\u0027s \"burbs\".\u003c/p\u003e\n\u003cp\u003eA huge sign stood on top of the two story building on the right.\u003c/p\u003e\n\u003cp\u003eToombs Hunting Store-Guns, Supplies, Licenses and More! Stop now before you shoot!\u003c/p\u003e\n\u003cp\u003e\"Wonder if they have a zombie hunting license,\" Katie murmured as she slowly drove into the town.\u003c/p\u003e\n\u003cp\u003eThe store was very old, at least 150 years old, with thick stone walls and heavy iron bars over the windows. A big iron door had Toombs with deer antlers on either side of the name painted in yellow letters. It looked like an old-time jail.\u003c/p\u003e\n\u003cp\u003eLetting the truck idle, Katie looked around at the buildings before returning her gaze to the hunting store. It was eerily quiet and devoid of any visible people.\u003c/p\u003e\n\u003cp\u003eSuddenly, a shot rang out and Katie jumped. Jenni screamed as she woke and instantly Jack started barking.\u003c/p\u003e\n\u003cp\u003eKatie was so startled she wasn\u0027t sure what was going on. Then she saw a small child laying right beside the truck, a neat hole blown through its head.\u003c/p\u003e\n\u003cp\u003eIts torso and right arm were a mangled mess, as if its flesh had been ripped from its bones.\u003c/p\u003e\n\u003cp\u003e\"Shit,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Are you bit?\" A female voice rang out through what sounded like a bullhorn.\u003c/p\u003e\n\u003cp\u003eJenni held tightly to Jack, both of them shaken. Jack was growling.\u003c/p\u003e\n\u003cp\u003eLeaning over them, Katie rolled down the window low enough to yell,\u003c/p\u003e\n\u003cp\u003e\"No! We\u0027re not bit! We\u0027re looking for some help! Some guns! Supplies!\"\u003c/p\u003e\n\u003cp\u003e\"Get out of the car slowly and show us,\" the voice answered.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t!\" Jenni grabbed Katie\u0027s arm. \"They might hurt you.\"\u003c/p\u003e\n\u003cp\u003e\"They shot the zombie. I think they\u0027re okay.\"\u003c/p\u003e\n\u003cp\u003eJenni\u0027s hand trembled as she withdrew it and looked desperate.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay,\" Katie said again and whispered to Jack, \"Stay,\" and slid out.\u003c/p\u003e\n\u003cp\u003eHolding out her bare arms, shotgun in one hand, she slowly turned around. She caught a flash of color and looked up to see two elderly people on top of the gun shop. The woman was holding the bullhorn and the old man the gun.\u003c/p\u003e\n\u003cp\u003eJenni looked out at Katie fearfully, unsure of what was going on.\u003c/p\u003e\n\u003cp\u003e\"And the other one.\"\u003c/p\u003e\n\u003cp\u003e\"Jenni, get out. Leave the dog inside,\" Katie said firmly.\u003c/p\u003e\n\u003cp\u003eJenni slowly slid out of the truck and slid off her bathrobe. Her arms were bruised, but it was clear she had no blood on her.\u003c/p\u003e\n\u003cp\u003eThe elderly couple consulted each other and suddenly the old man disappeared from view.\u003c/p\u003e\n\u003cp\u003e\"You better get back in the truck until he unlocks the door. Got more running around here,\" the old woman said through the bullhorn, then set it down and picked up a rifle.\u003c/p\u003e\n\u003cp\u003eBoth women climbed back into the truck and Katie pulled the truck over as close as she could to the shop.\u003c/p\u003e\n\u003cp\u003e\"They could hurt us,\" Jenni said softly.\u003c/p\u003e\n\u003cp\u003e\"They would have already if they wanted to,\" Katie answered truthfully.\u003c/p\u003e\n\u003cp\u003eTwo more shots rang out and Katie looked over to see two people laying dead near the doorway of an old fashioned grocery store. It was then that she became aware that there were more zombies trapped inside the grocery. The two dead zombies had stumbled out of a rotating door as they jostled about, trying to get to the tasty morsels on the street. Most of the undead were pressed up against the windows clawing at the glass.\u003c/p\u003e\n\u003cp\u003eThe big metal door to the hunting store opened and an old man with thinning silver hair dressed in jeans and a plaid shirt motioned to them.\u003c/p\u003e\n\u003cp\u003eTurning off the truck, grabbing the keys, and snagging Jack\u0027s collar all in one deft movement, Katie slid out of the truck and hurried into the shop.\u003c/p\u003e\n\u003cp\u003eJenni slid out of the truck behind her, looking flushed and anxious, and followed her through the doorway.\u003c/p\u003e\n\u003cp\u003e\"Name is Ralph. Wife is up top. Her name is Nerit,\" he said as he bolted the door behind them.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Katie, this is Jenni, the dog is Jack,\" Katie said.\u003c/p\u003e\n\u003cp\u003e\"Nice to meet ya,\" Ralph said and immediately pet Jack, who gave him a big goofy doggy grin.\u003c/p\u003e\n\u003cp\u003e\"Thanks for letting us in. We\u0027re pretty desperate for more weapons. We didn\u0027t have much ammunition to begin with,\" Katie explained.\u003c/p\u003e\n\u003cp\u003e\"Got plenty here,\" Ralph said and motioned about the shop. \"This is a hunting store.\"\u003c/p\u003e\n\u003cp\u003e\"I can pay,\" Katie offered.\u003c/p\u003e\n\u003cp\u003e\"Money means nothing now, missy. We can do business later. Come meet the missus. Relax. We\u0027re safe in here.\"\u003c/p\u003e\n\u003cp\u003eThe old man wandered past them and started up the stairs.\u003c/p\u003e\n\u003cp\u003eAll around them were racks and racks of rifles and cases full of guns. In the back of the store were all sorts of camping gear.\u003c/p\u003e\n\u003cp\u003eRealizing they were staying awhile, Katie followed him. Her hand gripped her weapon a little less tightly as she felt the tension in her body drain out a little. Jenni followed and slipped her hand into Katie\u0027s other hand as they climbed.\u003c/p\u003e\n\u003cp\u003e\"Are you sure this is okay,\" Jenni whispered softly.\u003c/p\u003e\n\u003cp\u003eKatie cast her a reassuring smile over her shoulder. \"About as okay as anything is going to be today.\"\u003c/p\u003e\n\u003cp\u003eWhen they came out onto the roof, the absolute beauty of the hills around them struck Katie. Endless, rolling green hills, lush and beautiful spread out around them. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-first-days-as-the-world-dies-1/page-9.html","bookId":2481,"creation":"Oct 5, 2019 4:56:42 PM","modification":"Oct 5, 2019 4:56:42 PM"}
