{"id":30805,"no":1,"title":"Chapter I. Mr. Bradbury","content":"\u0026nbsp;But for the coach and pair carrying Mr. Bradbury to Chelton, Tony Vining and I would not have been haled before the Squire, but would have got off scot-free as any time before. \u0026nbsp;Tony and I had made the round of our snares. \u0026nbsp;Tony had poked a young rabbit into his jacket-pocket; I was carrying a hare in my bag, and we were sneaking homewards through the dusk, when Tim Kerrick, ash-plant in hand, and brace of keepers at heel, stepped out of the coppice. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What be you lads doin’ here?” Tim demanded, barring our way. \u0026nbsp;“You’re after no good, I’ll warrant. \u0026nbsp;What’s in your bag, John Howe?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I did not stay to answer. \u0026nbsp;I swung round and was away. \u0026nbsp;Tony raced off with me; old Tim and his keepers followed. \u0026nbsp;We led them about the coppice, but they pressed us hard, Tim roaring, “Stop, ye young varmint! \u0026nbsp;Stop! \u0026nbsp;It’ll be all the worse for ye. \u0026nbsp;Stop, I say!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dreading Tim’s ash-plant, we ran on with p. 10all speed. \u0026nbsp;The hare in the bag hung heavily on me; when we were out in the furze, I let the bag slip from me, and ran more swiftly. \u0026nbsp;I had need, for Tony was now well ahead, and Tim and the keepers were hot at my heels; I could hear Tim’s snorting as much for anger as the rigour of the chase. \u0026nbsp;Furze tore my breeches and stockings; as we took the bank above the road, a bramble almost led to my undoing; it caught the tail of my jacket, and for the moment held me. \u0026nbsp;Tim charged forward with a yell of triumph; it was premature, for, kicking his toe against a root, he tumbled forward on his nose; on the evidence of his curses he pitched headlong into the bramble. \u0026nbsp;I tore myself away from the thorn, and dashed up the bank after Tony.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Down then we plunged into the road; the keepers, not staying to help Tim to his feet, pressed closely on us. \u0026nbsp;And as we shot down into the road, destiny in a coach and pair—to wit, Mr. Bradbury—encountered us. \u0026nbsp;For scarcely were we on the road, and racing on, than with a flash of yellow lamplight through the dusk, cracking of whip, and rattle of wheels, the coach was driven round a bend in the way, blocking our path, and sending us up against the bank to save ourselves. \u0026nbsp;Tony cried out, p. 11for the horses almost trod him down; instantly the pair took fright, and swerved to left. \u0026nbsp;A wheel descending into a deep rut, the coach toppled over; a horse fell, and the driver was lost in a swirl of dust, confusion of struggling, plunging horses and smashing vehicle. \u0026nbsp;On this disaster we might have sped away; no more than my curiosity, or maybe, desire to give a hand to the driver, held me there leaning against the bank and for the moment staring. \u0026nbsp;But then I darted back with Tony, and caught at the bridle of the plunging horse; by then the driver was the master of its fellow. \u0026nbsp;Scarcely had we prevailed, than old Tim, cursing still, was upon us, roaring to his keepers, “Hold the young varmints! \u0026nbsp;Don’t let ’em get away!” \u0026nbsp;Promptly the keepers had Tony and me as securely as we held the horse; Tim was standing glowering at us, ash-plant quivering in his right hand, when out of the wrecked coach stepped Mr. Bradbury.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now in the days to be from my first meeting with Mr. Bradbury the demeanour and the characteristics of the gentleman were to be stamped so vividly upon my mind that perhaps I write of him here with a detail beyond my perception in the dusk, for the light of the carriage lamps had been put out. \u0026nbsp;I picture p. 12him as a keen-faced gentleman,—then of sixty years of age,—as lean and stooping slightly; his black cloak lined with white silk blowing out from his shoulders; his long white hands striving now to secure it at his breast, and now to hold his hat upon his head. \u0026nbsp;He would be wearing his coat of fine black cloth, black, flapped waistcoat, black silken breeches and black silken stockings, shining silver-buckled shoes, linen of superfine quality and whiteness,—I recall the glint of white jewels on his fingers. \u0026nbsp;His hair was snow-white, and bound with a black ribbon; his spectacles were as two owl-like eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ha-ha!” the gentleman exclaimed, observing Tony and me in the grip of the keepers. \u0026nbsp;“Whom have we here? \u0026nbsp;Gentlemen of the road?”—and chuckled in a dry, crackling way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Poachers,—lads from the village, Mr. Bradbury, sir,” Tim growled, touching his hat. \u0026nbsp;“These young dogs has been poachin’, and I be goin’ to dust their jackets, as they’ve needed dustin’ many a day. \u0026nbsp;’Twas them as frightened the hosses, an’ nigh broke your honour’s neck and the lad’s there. \u0026nbsp;You’ve took no hurt, sir, I hopes and trusts.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “None! \u0026nbsp;None!” Mr. Bradbury answered, indifferently. \u0026nbsp;“But my driver?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well enough, sir, thank ’ee,” the fellow p. 13said, busying himself with the traces of the fallen horse. \u0026nbsp;“No thanks to these young rascals.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ay! \u0026nbsp;Ay! \u0026nbsp;I’ll be walking on then to the hall,” said Mr. Bradbury, glancing at the ruined coach. \u0026nbsp;“And I’ll leave you free, Tim Kerrick, to dust the jackets and whatsoever else of the attire of these lads as may occur to you.” \u0026nbsp;He chuckled again, and pulled his flapping cloak about him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The road’s rough and broken with the rains, Mr. Bradbury,” said Tim. \u0026nbsp;“As like as not you’ll be tumblin’ into the ditch, or missin’ your way. \u0026nbsp;I’ll send one of my lads with you. \u0026nbsp;Hey, you Dick, have you your lantern there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I’ve it here, Mister Kerrick,” the keeper answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Light it, lad, light it, and go along with Mr. Bradbury! \u0026nbsp;Joe and me can finish our business with these varmint.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The keeper, relinquishing me to Tim’s custody, lit his lantern, and stood forward to attend Mr. Bradbury, who, leaning on his cane, was scrutinising Tony and me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Show the light on this lad here,” said Mr. Bradbury, suddenly, pointing to me. \u0026nbsp;As the light flashed on me, Mr. Bradbury peered at me through his spectacles; his face expressed nothing of his thought; shamefaced I stood p. 14before him. \u0026nbsp;“What’s your name, boy?” Mr. Bradbury demanded, sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “John Howe, sir,” I answered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Howe!—H’m—Kerrick!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sir?” said Tim, touching his hat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bring this lad to the Hall.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “After I’ve basted him, sir?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let the penalty be suspended. \u0026nbsp;Later, maybe. \u0026nbsp;Jacket or breeches then, as you will,” said Mr. Bradbury, chuckling. \u0026nbsp;“Who’s the other lad?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Parson’s son, sir,—young Vining.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bring them both before Mr. Chelton at the Hall,” Mr. Bradbury ordered. \u0026nbsp;“It’s only just that they should suffer equally, as Mr. Chelton thinks fit; one’s as culpable as the other. \u0026nbsp;Bring them both after me, Kerrick! \u0026nbsp;Now, my man, go ahead with the lantern.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Wrapped in his cloak, hat pressed down over his brows, Mr. Bradbury went up the road, leaving Tim to curse, since justice and an overdue vengeance on our skins had been taken arbitrarily from his hands.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2790/77216.html","bookId":1293,"creation":"Aug 5, 2019 2:38:10 AM","modification":"Aug 5, 2019 2:38:10 AM"}
