{"id":30818,"no":14,"title":"Chapter XIV. Modesty of Mr. Galt","content":"\u0026nbsp;Roger Galt was laughing triumphantly. \u0026nbsp;He roared in my ear, “So you’ll not go sailing overseas yet awhile, John Craike, to pleasure Uncle Charles. \u0026nbsp;Blunt’ll never earn his guineas for your kidnapping.” \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thanks to you! \u0026nbsp;Will they come after us, do you think?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s not a man among ’em has a horse can match mine. \u0026nbsp;Save Martin! \u0026nbsp;And he’ll not dare. \u0026nbsp;I vow by now Martin’s gallopin’ like the devil to Craike House with the bad news for Charles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, and you’re like to suffer for it at Craike’s hands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He answered lugubriously, “Ay, I’m like to suffer for it if I remain in this part of the country. \u0026nbsp;But I’ll be riding elsewhere,—when I’ve set you down. \u0026nbsp;I’m not so much afraid of Craike or aught that he may do, that I’ll dance to his fiddling always.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why d’ye help me now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “For no more than knowin’ that you’re Dick Craike’s son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 112“He was your friend?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ay, friend and master.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You said that he’d been put out of the way, as I’d be put out of the way. \u0026nbsp;What did you mean by that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was shipped overseas, I’ve heard tell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t know?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whither do you take me now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come to think of it now,” he answered, laughing, “I hadn’t thought of it before. \u0026nbsp;Not to Rogues’ Haven.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know Mr. Bradbury?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve heard tell of him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s with old Gavin Masters—whoever he may be. \u0026nbsp;Will you take me to him, or set me down on the way to Masters’ house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He answered uneasily, “I’ll set you down near his house. \u0026nbsp;I’ll not wait on old Sir Gavin, I’m that modest, Mr. Craike. \u0026nbsp;He’s a gentleman. \u0026nbsp;He’s a justice—as Charles Craike’s a justice.” \u0026nbsp;His laughter sounded out on the wind. \u0026nbsp;“Ay, I’ll take you near enough. \u0026nbsp;Get on, old horse! \u0026nbsp;Get on!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We were out then from the green cup in which the Stone House lay. \u0026nbsp;Looking back from the ridge, ere the trees took us into their company, I saw the old house stand grey to the morning; p. 113I saw a confusion of figures all about it; I saw a rider dashing from the gate and galloping of apace.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Martin!” growled Roger. \u0026nbsp;“He’s riding of for Rogues’ Haven to give Craike word. \u0026nbsp;I’ve a mind to cut him off.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is Martin? \u0026nbsp;Bart and he are brothers, aren’t they?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Martin and Bart Baynes, ay, they’re brothers, both rogues, spawn of old Mag Baynes’s son Adam,—he that was transported and died some year back. \u0026nbsp;Ay, transported he was, but died. \u0026nbsp;Craike’s men, Mart and Bart—rogues both!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where does Rogues’ Haven lie?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That way”—with a sweep of his hand towards the rocky uplands. \u0026nbsp;“Away, with the wood all about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why the name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t you see and hear enough, young sir, in Mag’s house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Smugglers—ay, and worse—is that why?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ay, ay; and there’s odd tales of old Edward, how his money come—” but he broke of—“I’m not forgettin’ you’re the old man’s grandson.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Forget that I am, and tell me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s odd tales. \u0026nbsp;Maybe he made his p. 114fortune in the East, like any India merchant. \u0026nbsp;He came as honest by it as many another, I’ve no doubt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean dishonestly. \u0026nbsp;What was my grandfather?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He answered, laughing, “A gentleman of fortune, folk say”—and galloped on through the trees and out upon the open moorlands.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Seated before him in saddle, with nigh as much discomfort to me as when he had borne me on to Mag’s farm in the night, I fell to pondering over the mystery of old Edward Craike. \u0026nbsp;How had he come by his money? \u0026nbsp;Mr. Bradbury would never tell me, fencing me delicately; Roger Galt would not, but “gentleman of fortune”—it might mean buccaneer, freebooter, pirate, as Henry Morgan or many another. \u0026nbsp;Ever my mother’s words recurred to me, “the doomed house”—“ill-gotten wealth”—the thought of her hate of Charles and terror of Rogues’ Haven. \u0026nbsp;And the name and the company old Edward kept? \u0026nbsp;Howbeit, I should know soon. \u0026nbsp;When once I was safe with Mr. Bradbury, and the justice Sir Gavin Masters, and the thief-catchers from London. \u0026nbsp;And how would my uncle take all this, and what should be his punishment, after his plot against me-defeated by this gentleman of the road whom he had vowed to hang, if he p. 115should play him false, as Roger Galt had played him!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But my thoughts were yet all awhirl, even as my body was jolted and jarred before Roger Galt on his great black horse, as now putting his mount to its full speed he galloped over the moors. \u0026nbsp;He descended at last on to a rough and broken road, striking back, as nearly as I might guess, for the highway on which Mr. Bradbury and I had been intercepted. \u0026nbsp;And, suddenly, rounding a bend in the road, we came face to face with four riders, at the sight of whom Roger pulled up abruptly—to snatch a pistol from his holster, loosing his hold upon me, and muttering, “Jump down! \u0026nbsp;Quick! \u0026nbsp;I’ll not stay!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They came onward riding swiftly, as I dropped stiffly to my feet. \u0026nbsp;Roger Galt, with a wave of his hand and a cry, “Good day to ye, lad,” turned his horse and was off at a gallop, ere I understood who came and why he fled. \u0026nbsp;And standing in the road, I swung round to meet the riders. \u0026nbsp;I saw Mr. Bradbury come riding swiftly through the morning; beside him a stout gentleman in a scarlet coat as flushed as his jovial face; after them two hard-looking fellows, who, by their grim visages and rigs, I took for the runners whom Mr. Bradbury had called down from London.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bradbury, with an exclamation, pulled up p. 116beside me; but the red-coated gentleman, roaring, “After him! \u0026nbsp;After him! \u0026nbsp;There’s Galt! \u0026nbsp;There’s our man!” set spurs to his mount and galloped apace down the track, with the two fellows clattering after.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bradbury dismounted stiffly; hands outstretched, he came to me, crying in that shrill voice of his, “Why, Mr. Craike—my dear sir! \u0026nbsp;My dear sir!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good morning, Mr. Bradbury,” I answered, as he took my hands. \u0026nbsp;“I’m glad to see you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But where in the devil’s name had they hid you? \u0026nbsp;With whom were you riding? \u0026nbsp;He had cause to fear my friend here, Sir Gavin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s Roger Galt. \u0026nbsp;He took me out of Charles Craike’s hands, when he held me prisoner in a farmhouse away on the moors miles from here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Galt! \u0026nbsp;A notorious fellow. \u0026nbsp;Highwayman! \u0026nbsp;There’s a price on his head.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yet my father’s friend and mine. \u0026nbsp;I’m safe through him. \u0026nbsp;But for him I should be aboard the ship of one Blunt, smuggler—may be worse; oh, it’s been the prettiest of plots, Mr. Bradbury, and I’ve the wildest of tales for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So!” he said swiftly. \u0026nbsp;“So! \u0026nbsp;Charles Craike thought to trick us, and you’ve tricked Charles Craike. \u0026nbsp;By heaven, he’ll answer for this—by heaven! \u0026nbsp;My dear sir, I’ve hunted high and low p. 117for you. \u0026nbsp;Charles Craike denied all knowledge of you. \u0026nbsp;Old Mr. Edward would not lift a finger. \u0026nbsp;Lord knows and I guess the story our precious gentleman has told him of you. \u0026nbsp;But I’ll lay Charles Craike by the heels yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Bradbury,” said I, “your friend here and the runners follow after Galt. \u0026nbsp;I’d have no hurt come to him, for through him, and him only, despite Craike, I’m here and safe ashore. \u0026nbsp;Not that they’re like to take him,” as I stared up the road and saw the riders pulling in, while Roger vanished from view. \u0026nbsp;“Charles Craike has sworn that Roger Galt shall pay for this; I’d not have your friend there play Craike’s part, and set his hands on Galt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll have a word with Sir Gavin,” Mr. Bradbury assented. \u0026nbsp;“Not that ’twill count, for Sir Gavin is set against the fellow, he’s been swearing indeed, for all I might say to the contrary, that not Charles Craike but Galt was responsible for the outrage upon us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You took little hurt from your fall, I trust, Mr. Bradbury.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Little save a bad shaking. \u0026nbsp;I was afoot almost at once. \u0026nbsp;And must step it every foot of the way to the village—there’s a tolerable inn there, whither I’ll now lead you, Mr. Craike.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what then?” I asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 118“Why, surely, we’ll proceed to wait upon your grandfather, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unless my Uncle Charles plans otherwise.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, we’ll ride thither this afternoon, sir, if you’re rested and well. \u0026nbsp;But the runners shall go beside our coach, lest Mr. Charles Craike still desire that we shall not meet your grandfather.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2790/77229.html","bookId":1293,"creation":"Aug 5, 2019 2:38:10 AM","modification":"Aug 5, 2019 2:38:10 AM"}
