{"id":30824,"no":20,"title":"Chapter XX. Soul of a Man","content":"\u0026nbsp;Mr. Bradbury took his leave shortly after dinner, driving off in his coach, attended by the Bow Street runners. \u0026nbsp;He was allowed no further opportunity of speech with me, my uncle engaging him in conversation; my grandfather sitting grim and silent by the fire. \u0026nbsp;From time to time, I found his eyes studying me, as I sat glumly apart; his face was expressionless of his sentiment to me. \u0026nbsp;My cousin Oliver had been aided from the room by Thrale on my uncle’s direction. \u0026nbsp;On Mr. Bradbury’s departure, the old man went to his room, leaning on his son; and I was left alone by the fire. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The fire was burning down into coals; the candles flickered on the chimney-piece; the reflections flitted like white moths over the mirrors; else the room was draped with shadows. \u0026nbsp;All about me I heard furtive sounds; out of the gloom I believed that the bleared eyes of the old rogues who served my grandfather surveyed me secretly,—this may have been no more than a phantasm of my mind, yet I could have sworn p. 162that, when the coals fell, and the red flame splashed into the well of darkness about me, I saw those wrinkled brown faces—surely burnt by the suns of the Spanish Main or the Indies. \u0026nbsp;Rogues’ Haven! \u0026nbsp;I was realising what manner of man was my grandfather; I was conjecturing that he had sailed across the seas in his heady youth, and grown rich with plunder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I have a belief—it dates from the time I passed at Rogues’ Haven—that the spirit of a man is stamped upon the house in which he dwells. \u0026nbsp;Surely the spirit of old Edward Craike impressed itself upon his gloomy home, and the mystery of the man was the mystery of the house. \u0026nbsp;Ay, the past of our race and the past of my grandfather alike affected the ancient house, meshed in a monstrous web of dark green ivy, clouded by gloomy woods, and blown upon by melancholy winds. \u0026nbsp;Now did faces peer our of the shadows at me, seated drearily by the fire? \u0026nbsp;Did I hear whispering, muttering, or did I but imagine voices in the wind come up from stormy sea to the black woods, to cry about the dwelling, and moan and sigh, and to creep in by breach and crack and cranny, to stir the dusty, moth-corrupted hangings, and fill the house with secret rustling, sighing?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle did not rejoin me till the night was far p. 163advanced. \u0026nbsp;He came in stepping so stealthily that at the sudden sight of him standing beside me, and watching me with haunted eyes, I started from my chair, and scarcely repressed a cry. \u0026nbsp;He smiled at me, but his gaiety of the early evening had passed from him; he dropped heavily into a chair facing me, giving me not a word. \u0026nbsp;I watched the shadows fall about his face, as the coals blackened out, and the candles, waving in the draughts, guttered, burned down, and smoked. \u0026nbsp;If a light leaped high from silver stick, I saw him white as ivory, lips twisted, eyes brooding. \u0026nbsp;He looked at me malevolently at times; I understood how much in truth he hated me; how my resemblance to my father tormented him; what was the repression compelled upon him by his father.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He said suddenly, “It’s a cruel trick of fate, nephew, brings you to this house!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How?” I asked. \u0026nbsp;“I’m not here by any wish of mine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Or by any wish of mine,” he said, with a bitter laugh. \u0026nbsp;“Fate, in the form of Bradbury! \u0026nbsp;Odd, kinsman, that my father should be so near to death, and I who have endured him all these years bid fair to lose in these last days of his my profit on it. \u0026nbsp;I’ve a notion, nephew, that in the few weeks you will remain here you’ll benefit by p. 164all I looked for. \u0026nbsp;Estimate my sentiment towards you!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “The hate that looked from your eyes a moment since.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A poor expression of it, nephew,” he said. \u0026nbsp;“There is no look, or word spoken or written, shall reveal a man’s soul. \u0026nbsp;The fellow Rousseau has essayed to reveal his soul, to be sure, and has revealed but the body of an ape. \u0026nbsp;I have a philosophy of my own, John Craike,—that my soul is not my body’s own; that aught I do, while my soul is in my body, counts nothing in the score against me. \u0026nbsp;If I do aught—pride myself on it or am ashamed—I need not plume myself, or fret me. \u0026nbsp;For it is not my deed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A comfortable creed,” said I. \u0026nbsp;“It would absolve you from aught that you have done or plan to do against your brother or your brother’s son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I take it so,” he answered, coolly. \u0026nbsp;“Nephew, this will of mine—I name it ‘will’—is no more mine, no more controllable by me than that wind blowing from the sea, and crying out about this dreary house. \u0026nbsp;The actions of our lives are inevitable as storm or summer sun. \u0026nbsp;My very promise to my father to do no hurt to you, while you are in this house, is no more mine than the injury I have essayed and failed to do you. \u0026nbsp;We p. 165are predestined, nephew, as surely as any hapless wretch who walked the plank, or drowned in scuttled ship, or burned with its burning—at my father’s hands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did not know,” I whispered, “the manner of his past. \u0026nbsp;And do you tell me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I tell you nothing that you must not know,” he said indifferently. \u0026nbsp;“Rogues’ Haven—this house is but a haven for old rogues,—rogues who were young and lusty with him once, and sinned at his command. \u0026nbsp;Sinned! \u0026nbsp;Nay, there is no sin; there is no virtue that is a man’s own. \u0026nbsp;Predestined!”—his laughter rang out over the winds that beat against the shutters—“Will you tell all this to my father, nephew? \u0026nbsp;Will you seek to blacken me to him that you may profit by it? \u0026nbsp;It will not change a whit his disposition to me. \u0026nbsp;He is not wholly past all love or hate, though he is near to death. \u0026nbsp;And lacking my philosophy, he is not past all terror. \u0026nbsp;He fears death; he fears dead men who, living, troubled him not at all. \u0026nbsp;He is afraid to go down to their company—their company—the maw of the worm or the fish, the decay of all who go down into the ground or sink in the sea. \u0026nbsp;His soul—it never was his soul! \u0026nbsp;He loved your father; he ever hated me. \u0026nbsp;Till he grew old, his will was stronger than my will. \u0026nbsp;My will grows stronger, nephew; p. 166I warn you my will may yet prevail over his old affection for your father, on which your hope with him rests wholly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will!” I repeated. \u0026nbsp;“It accords ill with your creed, my uncle.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will!” he said, laughing. \u0026nbsp;“Oh, it’s no more than the force given to the wind or the wave. \u0026nbsp;Predestined! \u0026nbsp;If I win yet, nephew, so it is fated; not any act of yours or mine may stay it. \u0026nbsp;I do not see the event. \u0026nbsp;No man may look beyond the minute that is now. \u0026nbsp;Nephew, I vow I saw you yawning; I prose; I weary you; I am a dull fellow,—and who would not be, living in this house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I am tired, that’s all. \u0026nbsp;I’ll go to bed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He caught the bell-rope, and old Thrale answering, he bade him light me to my room. \u0026nbsp;The fire upon its hearth burned brightly; the bed was warm and soft, but my comfort lulled in no way my apprehension of the night. \u0026nbsp;Though I locked the door and set a chair against it, I did not feel secure. \u0026nbsp;Knowing myself friendless in the house, with no more than the decaying will of an old man between me and my enemy. \u0026nbsp;Knowing the house peopled with old rogues, who, I conjectured, had been seamen on my grandfather’s ship, when he was young, and sinned unpardonable sins, and grew rich under a black flag. \u0026nbsp;p. 167I fell to picturing him in his youth and strength—the dark ruthless face, the powerful body, the strong, cruel hands. \u0026nbsp;I pictured him on the deck of his ship,—I conjured up its build for swiftness, its rakish masts, the swell of its white sails. \u0026nbsp;I conjured up illusions of glittering seas, blue as the sheen on copper in the sun; a phantasm of those old rogues, withered, bloated, tottering now, as lusty with youth. \u0026nbsp;Stark to the waist I saw them, their bodies muscular and brown as iron, and lithe as steel; the wicked aged faces that had peered at me out of the shadows now young, and red with drink and lust and greed; I saw these rogues now toiling at the guns,—through smoke I saw them: their hands grip cutlass, or knife, or pistol now for dish or glass or bottle. \u0026nbsp;I saw such treasure, as the massy plate upon the board that night, piled on red decks with bursting chests of rich apparel—dyed silks and satins, laces; gold pieces, precious gems, even as the red gems upon my grandfather’s fingers. \u0026nbsp;And I heard piteous lamentation in the wind screaming from the sea; cries of the dying and tormented in its wailing round the house, and in its rumbling above the chimney stacks the roar of guns; and the wash of waters in the sweeping of the pine and fir boughs. \u0026nbsp;The dark curtains of my bed were half-drawn; when the p. 168moon shone in, I saw a black flag flying and a death’s head on it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For my terrors, born of the evil brooding in this house, I could not rest. \u0026nbsp;I fell to wondering whether my grandsire slept soundly in his bed, or whether phantoms crowded upon him, and the winds cried menace to him—an old man black with sins and nigh to dying.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2790/77235.html","bookId":1293,"creation":"Aug 5, 2019 2:38:10 AM","modification":"Aug 5, 2019 2:38:10 AM"}
