{"id":30828,"no":24,"title":"Chapter XXIV. The Wood","content":"\u0026nbsp;Now I was not fated long to test the efficacy of my grandfather’s control over his son and his servants. \u0026nbsp;I’d have you know that twelve folk served my grandfather at Craike House, and that excepting Nick Barwise, the groom, these rogues were of the crew who served under Mr. Craike when he sailed his own ship, and that in his fantastic spirit he would have them by him after his return to England to assume his position as Craike of Craike House. \u0026nbsp;The gates were kept by Isaac, second son of the Barwise union, and his woman, the swart gipsy, whom I had observed on my arrival with Mr. Bradbury. \u0026nbsp;All this disreputable company, as much as my grandfather’s eccentricities, had won the house its ill-name—Rogues’ Haven, among the folk of the countryside; these rogues, too, were leagued with smugglers such as Blunt, who plied their traffic under the very nose of the justice Gavin Masters, and the coastguards. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle, since his father’s advanced years and decay pointed to his speedy death, had torn p. 192himself away from the diversions of London and society, of which he was adjudged an ornament. \u0026nbsp;Penniless, while he played devoted son, he had established an advantageous understanding with Blunt and his folk, who would alternate long voyages to America and the Indies, on Lord knows what nefarious traffic, with running smuggled stuff from the Continent to the English coast. \u0026nbsp;That my uncle fretted under the yoke of duty manifested itself daily in his covert sneers at his father; the chagrin of Charles, my grandfather remarked to me, had lent a zest to living.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The days I spent in Craike House passed dully and without noteworthy event. \u0026nbsp;I did not lose my dread of the house in the night; the impressions of my first night under its roof abated in no way, but the good-humour of my uncle, the servility of Thrale and his fellow-rogues, the companionship of Oliver, and the sports which I shared with him, lent me a confidence which was to prove groundless. \u0026nbsp;I passed much of my time in playing chess with my grandfather, in reading to him from old voyagers and romancers—of whose works he had by him a great store, or in listening to his narrative of his own sailings, which, if incomplete, gave me a portrait of him by no means calculated to advance my affection for him. \u0026nbsp;Yet that I p. 193advanced daily in his favour was patent; my uncle masked his chagrin under a bland demeanour, and a display of the graces and accomplishments which surely rendered his absence deplored by society. \u0026nbsp;But though my grandfather assured me of protection, and though my uncle professed a truce, I would have been wise to follow my first inclination—not to remain under the roof of Craike House, as I shall now relate.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n One morn, a month, I should say, from my coming to Rogues’ Haven, my grandfather informing me, through Thrale, that I was free to pass the day as I pleased, I bade Thrale unlock the door for me, and passed out of the house. \u0026nbsp;The gold sunlight lay upon the garden; if it dispelled for a time the gloom, it emphasised the disrepair of the old house, the ivy climbing to the chimney stacks and lacing the windows; a few it had obscured wholly. \u0026nbsp;As I looked up, I saw the sinister face of Mrs. Barwise looking from a high window; she bobbed back instantly. \u0026nbsp;I estimated the covert hostility of the rogues of Craike House; and, having a certain apprehension of walking abroad unarmed, I took out my knife and speedily fashioned me a heavy cudgel. \u0026nbsp;I went down then by a flight of stone steps into the old sunken garden to the right from p. 194the house,—steps crumbling and green with moss, and overshadowed by a tangle of roses and honeysuckle, descending into a cool depth which had been laid out once in ornate flower beds and lawns, but was now overrun with fox-gloves, prevailing through their sturdy strength over other flowers. \u0026nbsp;Yet the air was sweet with the white-starred jasmine over the crumbling walls, shutting the deep garden from the old plantation, which had become a dense wood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Once paths had curved to the sundial at the heart of the garden. \u0026nbsp;The dial was broken and corroded now; a bramble had caught it in its claws; sparrows fought and chirruped upon it in the sun. \u0026nbsp;Arbours had become thickets; through the broken wall I saw the wood go deep, but the sunlight struck through the trees upon a path among tall grasses and flowers spilled from the garden.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I climbed the broken wall and sauntered down the woodland path, taking delight in beauty, and presently departing from the track, passed down to left into a deep glade—silver and green in the sunlight; the dew was not yet dry on fern and grass. \u0026nbsp;And suddenly I saw the girl Evelyn Milne,—she sat upon a fallen log, moss-grown and bramble-clustered. \u0026nbsp;Her head was bare; her bonnet lying on the turf beside her; she sat bent p. 195with her hands clasped at her knees—a picture of melancholy and loneliness; yet the sun found the glossy sheen in her dark hair, and the whiteness of her neck and hands. \u0026nbsp;At the crack of a stick under my feet, she started up, and stood regarding me with sullen eyes. \u0026nbsp;I swept off my hat, but she offered me no greeting.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I stammered, “I ask your pardon, Miss Milne. \u0026nbsp;I did not think to disturb you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked about her hurriedly; leaning towards me then, she whispered, “Now you’re out of the house—away from them all, why not go on and on through the wood, and never return?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean,” I said, staring at her pale face, at her white hands fluttering at her bosom, “it would be safer for me, that I’ll never be safe in the house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean—it doesn’t matter what I mean. \u0026nbsp;Only, were I you, and had any friends away from here—were not alone as I am alone—I’d go. \u0026nbsp;I’d never return.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Miss Milne,” said I, “I do assure you that I’m not afraid. \u0026nbsp;Why should I run away?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Afraid!” she whispered still. \u0026nbsp;“You’re only a fool. \u0026nbsp;You’re only a boy. \u0026nbsp;Your life’s before you. \u0026nbsp;Why would you stay? \u0026nbsp;Hoping to profit, p. 196and be rich, when that old man is dead? \u0026nbsp;Is that why you’d stay? \u0026nbsp;There’s no price that’s worth your life—to you. \u0026nbsp;Why did you ever come to such a house, or, knowing them for what they are, remain?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are my folk,” I muttered, thinking her—from the wildness of her look, the sudden fevered shining of her eyes, the ceaseless fluttering of her thin hands—distraught from the terrors of the house; recalling how, day after day, she sat by me at table, uttering not a word, and addressed by no one; going then from table to be seen no more, till the next meal was served. \u0026nbsp;She had been no more to me than a pale grey shadow in the house of shadows.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nor had I felt in her more interest than to ask Oliver carelessly how she spent her days; and he had answered, “Hid in her room for the most, haunting the garden; she’s lifeless, bloodless, the wraith of a maid.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are my folk,” then, I muttered, staring at her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your folk! \u0026nbsp;Are you as they?” she whispered still. \u0026nbsp;“You think only of the money the old man has, and care not how ’twas come by. \u0026nbsp;You’ll smile and fawn on him—that man, that evil old man—as his son smiles and fawns. \u0026nbsp;Knowing—as you must know—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 197“The manner of man he is, and the manner of the men about him? \u0026nbsp;The danger I’m like to meet? \u0026nbsp;Miss Milne, I’m not afraid. \u0026nbsp;They failed once; do you know that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know—yes, I know. \u0026nbsp;They failed once; they’ll not fail again”—suddenly leaning forward clasping her hands, peering at me with wild bright eyes, and whispering, “Go! \u0026nbsp;Go now ere it’s too late. \u0026nbsp;Go! and take me with you from this house—this wicked house!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I was silent, and stared at her, colouring; thinking her surely mad—such the wildness and terror of her look; as realising, she seemed to struggle to control herself; facing me white and quivering, she said at last more calmly, “Mr. Craike, I hear so many secrets in the house. \u0026nbsp;I have lived here so many years—so many lonely years, and am so little accounted, that they do not heed me, or care, if I hear many things that, if they feared me, I would not hear and know. \u0026nbsp;Knowing—I do beseech you, do not stay within the house! \u0026nbsp;Oh, let no thought of loss, if you offend your grandfather, prevail with you! \u0026nbsp;Go!—ere it is too late!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I said, standing clumsily before her, no longer meeting her look, “Miss Milne, you ask me to assist you. \u0026nbsp;I know—surely by now I know—the house is no house for a maid; I’ll aid you to p. 198leave it. \u0026nbsp;Have you no kin or friends out of the house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No kin, no friends. \u0026nbsp;I have lived in this house since I was a little child. \u0026nbsp;No friends within the house; none in all the world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve a purse of gold,” I said. \u0026nbsp;“I’ll give it to you. \u0026nbsp;With it you may make your way to London and seek out Mr. Bradbury. \u0026nbsp;With this message from me—that he conduct you to my mother, who will befriend you. \u0026nbsp;Come—here’s the purse. \u0026nbsp;I’ll go with you through the wood. \u0026nbsp;You may take a coach from the village inn and drive to London. \u0026nbsp;But I stay here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She drew back from me. \u0026nbsp;She whispered, “No! \u0026nbsp;Go now, and take me with you! \u0026nbsp;How should I find my way to London alone, or seek out this man Bradbury, or your mother? \u0026nbsp;I have lived nigh all my life in this house; I am afraid. \u0026nbsp;Go with me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Miss Milne, I must remain,” I said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “For money?” she said, with scorn; but I answered, “Think that if you will. \u0026nbsp;For adventure, for a promise.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s like to end in death,” cried she, and drew back from me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, then, what have you heard?” I asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Plots! \u0026nbsp;Plots! \u0026nbsp;What use to tell you, if you p. 199will not heed me? \u0026nbsp;If I tell you, will you go from this house? \u0026nbsp;Will you take me out of it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not say I’ll go. \u0026nbsp;But I’ll help you, surely!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked at me with her eyes now dark and sullen; bitterly she said, “I’ve given you warning. \u0026nbsp;I’ll not tell you more. \u0026nbsp;Why should I tell you aught I know? \u0026nbsp;What do I know of you save that you seem a boy—a fool—and not yet lost as they. \u0026nbsp;Though coming of their stock—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do assure you,” I stammered, “I—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She burst out, “Stay—if you will! \u0026nbsp;Stay! \u0026nbsp;And yet I warn you.” \u0026nbsp;She slipped from me, and vanished like a wraith into the shadows of the wood.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2790/77239.html","bookId":1293,"creation":"Aug 5, 2019 2:38:10 AM","modification":"Aug 5, 2019 2:38:10 AM"}
