{"id":30829,"no":25,"title":"Chapter XXV. Insistence of Captain Blunt","content":"\u0026nbsp;Now attempting to follow Miss Milne, and have further conversation with her, I found myself presently in a wild tangle of the wood, so that I had much difficulty in forcing my way through it. \u0026nbsp;Not finding her, bramble-scratched and moss-stained at last I reached the wall, and followed it down, thinking to find the breach by which I had left the garden. \u0026nbsp;But as I approached it, I halted suddenly, hearing voices from the garden; and, knowing them for the voices of Blunt and Martin Baynes and my uncle, engaged in an unseemly wrangle, I rejoiced that I was still hidden by the creepers hanging over the wall. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Blunt was growling, “Ay, ay, you’ve given me to know you’ll be rich, when the old man’s gone. \u0026nbsp;You think to lay your hands then on the spoil he’s piled up and held all these years. \u0026nbsp;Ay, but the old man’s alive, and I’m sailin’ again with never a penny of profit to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And the lad’s come to the old man,” Martin broke in, “and by all saying he’s likely to have p. 202every penny, and you not the colour of a farthing. \u0026nbsp;What d’ye say to that, Mr. Craike? what d’ye say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle answered disdainfully, “You get nothing from me. \u0026nbsp;You’re a pretty pair of rogues to come and threaten. \u0026nbsp;I trust you, Baynes, to hold the rogue and you to take him aboard, Blunt; and he slips through your hands. \u0026nbsp;I wonder at your audacity.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fine talk!” cried Blunt; and Martin burst out, “You’ll pay nothing! \u0026nbsp;Will you not? \u0026nbsp;What if I go to old Sir Gavin? \u0026nbsp;What if I give him the tale? \u0026nbsp;He’d listen and he’d set you by the heels, as gladly as he’d set Roger Galt. \u0026nbsp;Though you’re one of his kind—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have it,” my uncle assented, “one of Sir Gavin’s kind. \u0026nbsp;Do you threaten me, Martin Baynes, you, for all the repute of the Stone House and Mistress Baynes and her grandsons? \u0026nbsp;Are there not strange tales of the Stone House—of travellers lost on the moors? \u0026nbsp;Of a pedlar whose dog was heard wailing at the gates of the Stone House, as dogs wail for their dead masters? \u0026nbsp;Do you threaten me, Martin Baynes? \u0026nbsp;And you, Blunt? \u0026nbsp;Did you never sail further than the coasts of France? \u0026nbsp;Did you never plunder an English ship? \u0026nbsp;Were you never more than smuggler?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 203“Never more,” cried Blunt, “than Edward Craike, and never so much.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A gentleman of fortune,” said my uncle, “a voyager born a hundred years and odd after his time. \u0026nbsp;Tush, that my father profited by his voyages is nothing, Blunt; he plundered no English ships; if his men spilt any blood, it was not English.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Barwise in his cups—” Blunt began.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Barwise is just such a besotted fellow,” cried my uncle, “as should pitch you the tale you’d wish to hear, Blunt. \u0026nbsp;Now ere you two presume to threaten me, think who’ll believe you? \u0026nbsp;If I sought to keep John Howe out of the house, and have him shipped overseas—what of it? \u0026nbsp;What should this count against me save with a few virtuous fools to whose praise or blame I am indifferent? \u0026nbsp;D’ye think I’ve no credit with His Majesty’s Ministers? \u0026nbsp;D’ye think that the Town would ever regard me as other than a man of birth and fashion? \u0026nbsp;What if there be rumours of my father’s past, or scandal against me? \u0026nbsp;Your words would avail you nothing. \u0026nbsp;But you, you rogues; the word from me would hang you both. \u0026nbsp;Tush, when you threaten me, you’re fools.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We want no more than payment,” Blunt growled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 204“That I’d not have to give you, if you’d earned it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s money in the house,” Blunt urged. \u0026nbsp;“There’s plate. \u0026nbsp;There’s talk of a great chest of gold and jewels.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would,” said my uncle softly, “I might dip my hands into it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “D’ye not know of it?” Blunt asked. \u0026nbsp;“D’ye not know it’s talk among all the folk of the house that the old man hid the richest stuff he ever took?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not know this, Blunt—upon my honour.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I know,” Martin struck in, “that whatsoever the old man has is like to go to his grandson. \u0026nbsp;And that the old man’s threatened you, if you so much as lift a finger against the boy, he’ll not spare you. \u0026nbsp;I have it from old Thrale.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tush,” said my uncle, “I’ve listened too long, my friends. \u0026nbsp;Your threats do not perturb me. \u0026nbsp;I hold the cards, not you. \u0026nbsp;I know nothing of such a chest. \u0026nbsp;Pray, go! \u0026nbsp;Well for you to be sailing, Blunt. \u0026nbsp;Sir Gavin is no fool, and the Wasp lies off the coast too long for your security. \u0026nbsp;And well for you, Martin Baynes, to be sailing with Blunt; you’re idle; you’re mischievous; you’d be well away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 205“Ay, and the lad?” Blunt asked. \u0026nbsp;“Would you have him sail with us yet?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have no preference.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ay, but if you knew he was safe aboard, and sailing with me—not for France, for pickings in the Indies—would you find me the hundred guineas then, Mr. Craike, ere I sailed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should find one hundred guineas with ease,” my uncle answered. \u0026nbsp;“I suggest nothing, direct nothing—have no share in any plot against my nephew. \u0026nbsp;Yet if I knew—and none here knew—that he was safely under hatches, Blunt, I’d pay this hundred guineas ere you sailed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’ll be out of the house this night, aboard by the morning,” Blunt vowed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I heard my uncle’s light laughter; I heard him humming a tune as he walked away. \u0026nbsp;Blunt and Martin came scrambling over the wall, and not detecting me hidden under the creepers, tramped away through the wood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2790/77240.html","bookId":1293,"creation":"Aug 5, 2019 2:38:10 AM","modification":"Aug 5, 2019 2:38:10 AM"}
