{"id":30833,"no":29,"title":"Chapter XXIX. Intervention of Mr. Bradbury","content":"\u0026nbsp;At the immediate confusion and rush of figures I started up to assist my uncle; Thrale and his fellow-servants were before me. \u0026nbsp;My uncle cried out, “Stand back, nephew! \u0026nbsp;Stand back all of you; let him have air!”—and the crowding of the old men about the chair withheld me from my grandfather. \u0026nbsp;So the event held me that I was insensible to other sound than the gasping of the old man; I caught a glimpse of his face, livid and sweating, as his head rested against my uncle’s breast; his eyes were agonised. \u0026nbsp;I saw Nick Barwise thrust the old men aside; supported by him and my uncle my grandfather was aided from the room, while the old rogues fluttered and squeaked and gibbered about him. \u0026nbsp;As they led him past me, I realised that Evelyn Milne was back in the room and was plucking at my sleeve and crying in my ear, “Are you deaf? \u0026nbsp;Are you daft? \u0026nbsp;Hark to the knocking on the door! \u0026nbsp;Why don’t you bid them open?” \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And I heard the clashing of the knocker and p. 226the beating on the door above the wind, as if death or the devil came in the storm, and clamoured for admission. \u0026nbsp;I heard my uncle crying out, “Keep the door fast! \u0026nbsp;No one comes in this night!” \u0026nbsp;I stood confused, hoping that the knocking told the arrival of Mr. Bradbury at the house, and dreading lest Blunt and his rogues were come to take me openly and violently; still the knocking sounded over the beating wind. \u0026nbsp;The old men, crowding out after my grandfather, muttered and laughed in wicked glee, that surely at last the end was come. \u0026nbsp;And only the girl and Oliver and I were left in the room with the candles casting their ghostly lights upon us; and the weird shadows, dancing all about us; always the gale cried out about the house; the heavy, steady knocking sounded on the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who should come?” the girl cried to me. \u0026nbsp;“Who should knock so? \u0026nbsp;Your friends—have you friends like to come? \u0026nbsp;Or friends of Charles Craike and the folk within the house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dazed yet, but calling to mind Sir Gavin’s promise, I said, “I think my friends—I hope—I’ll go and open the door!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no!” cried she. \u0026nbsp;“Stay here in the light! \u0026nbsp;You’re safer in the light. \u0026nbsp;I’ll go!” and instantly sped from the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 227With my back to the fire, and my fingers set upon the pistol, I stood and looked at Oliver; he sat at table still, seeming drunken and insensible of the old man’s sudden sickness, the tumult of the storm, the knocking at the door. \u0026nbsp;But his dull, tragical, young eyes meeting mine, I was amazed to hear him give expression to my first fantastic thought, “Death and the Devil knock! \u0026nbsp;They’re come for him! \u0026nbsp;Hark!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The door from the hall swung open. \u0026nbsp;I saw the faces—the old brown faces and the evil eyes of the rogues; I knew how they hated me; what shift I should have at their hands, if but the word came down that their stricken master was dead. \u0026nbsp;I heard them gibe and mutter; I heard the woman Barwise’s voice cracked and shrill, “Ay, he’ll not lord it over us. \u0026nbsp;No longer! \u0026nbsp;Ay, by the Lord he’ll not!”—but her sudden scream, “Who’s that? \u0026nbsp;Who let you in?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bradbury cried out from the hall, “By your leave, Mistress Barwise,—by your leave!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this I rushed to the door, and met him thrusting his way among the crowding rogues. \u0026nbsp;He came in calm and trim, flinging back his cloak, and drawing off his gloves. \u0026nbsp;He gave me his hand, and exclaiming, “Ah, my dear sir!” demanded, “What’s to do here? \u0026nbsp;What’s all p. 228this chattering and clattering? \u0026nbsp;Why am I kept waiting at the door on a night like this? \u0026nbsp;What’s to do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My grandfather!” I gasped. \u0026nbsp;“Sick! \u0026nbsp;Dying maybe—”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So!” he said, swiftly, and an instant I saw perturbation in his look. \u0026nbsp;He had not come alone. \u0026nbsp;I saw three tall fellows, great-coated armed with bludgeons, standing in the doorway, and at their back the malignant, baffled faces of the rogues. \u0026nbsp;The two runners and a third fellow—a huge figure, vaguely familiar to me, though he was muffled about his jaws, and kept his hat tilted over his nose, so that I could not see his face. \u0026nbsp;Oliver lay back in his chair, seeming sodden with drink.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thrale!” cried Mr. Bradbury, “Mistress Barwise—some of you!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The woman, pushing her way forward, stood before him, her arms akimbo, demanding, insolently, “Well, sir—well?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Announce to Mr. Charles Craike my arrival. \u0026nbsp;Tell him that I require to see him at once. \u0026nbsp;At once! \u0026nbsp;D’ye hear me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hoity-toity!” cried the woman, bridling. \u0026nbsp;“Who are you to be orderin’ me?”—but quailed and recoiled before Mr. Bradbury’s sudden darkling anger.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 229“D’ye hear me?” Mr. Bradbury repeated. \u0026nbsp;“D’ye understand me, baggage? \u0026nbsp;At once!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is this?”—and my uncle, seeming to have been summoned on the admission of Mr. Bradbury and his men, stood in the doorway.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, my dear sir!” Mr. Bradbury exclaimed, stepping forward, his hand outstretched.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Bradbury,” said my uncle coolly, “your coming’s most inopportune!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I realise it,” Mr. Bradbury agreed readily. \u0026nbsp;“Most inopportune!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My father’s sudden seizure! \u0026nbsp;He’s nigh to death.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My profound sympathy, sir, with you in your natural grief. \u0026nbsp;My profound sympathy! \u0026nbsp;Pray conduct me to him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Bradbury, you assume an extraordinary air of authority,” my uncle protested. \u0026nbsp;“My father cannot see you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Authority!” said Mr. Bradbury, coldly. \u0026nbsp;“My dear sir, I take my authority from my clients. \u0026nbsp;I take it from Mr. Edward Craike. \u0026nbsp;I am here to act at once in his interests, and in the interests of my client here, Mr. John Craike.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The gentleman faced him, and barred his way. \u0026nbsp;He said, “I regret, Mr. Bradbury, that you cannot see my father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 230“And I say to you, Mr. Craike, that I insist on seeing him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By gad, sir, you insist! \u0026nbsp;Will you force your way to him, dying?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ask you, sir, to spare me the necessity. \u0026nbsp;I am here this night by Mr. Craike’s desire, expressed to me on my lash visit. \u0026nbsp;His business with me, he instructed me, would be of supreme importance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I tell you he’s near death.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who then?” said Mr. Bradbury, with a wave of his hand, “should give orders in this house except his grandson and heir?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I heard the mutter of voices and the shrill, crackling laughter from the door; I saw my uncle’s eyes blaze at me like gems; the woman Barwise glare at me and clench her hands in her skirts. \u0026nbsp;I took my cue instantly from Mr. Bradbury. \u0026nbsp;“And I,” I said, “insist that Mr. Bradbury accompany me at once to my grandfather. \u0026nbsp;Come, sir!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle looked upon me; the mask was lifted; and all his hate of me was revealed upon his face. \u0026nbsp;I took a candle from the shelf, and signed to Mr. Bradbury to follow me. \u0026nbsp;I thought that Charles Craike would bar my way, or strike me down, or cry out to the rogues not to let me pass; to my amaze my uncle stepped aside with a contemptuous bow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 231“Bid your men follow us!” I said to Mr. Bradbury; so we went out among the rogues in the hall, and up the stairway and by the gallery to my grandfather’s room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait here,” said Mr. Bradbury to his men; and opening the door, drew back the curtain and stepped with me into the room. \u0026nbsp;My grandfather, wrapped in his gown, lay in his chair. \u0026nbsp;He seemed the very figure of death; the candlelight and the dancing fire showed his face livid; his eyes staring at us were anguished; no one was with him except Thrale, who held a glass. \u0026nbsp;My grandfather’s hands gripped the arms of his chair; the sweat dripped from his face. \u0026nbsp;All the while the lamenting winds were beating on the windows, the curtains of the bed were waving; the flickering lights and shadows dancing a ghostly dance about the room. \u0026nbsp;His voice came gasping. \u0026nbsp;“Bradbury! \u0026nbsp;Ah, not too late,—though death’s crying out for me this night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am here,” said Mr. Bradbury simply, “somewhat ahead of the appointed time, Mr. Craike. \u0026nbsp;I have with me the document drawn in accordance with your instructions. \u0026nbsp;I ask but your approval and signature, sir. \u0026nbsp;Go, Thrale! \u0026nbsp;Your grandson, sir, must not remain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, bid him wait outside the door. \u0026nbsp;Go, lad, go!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 232I went out after Thrale, and Mr. Bradbury locked the door upon me. \u0026nbsp;I waited in the corridor with the three fellows standing grim about me. \u0026nbsp;I wondered that presently Mr. Bradbury should summon the two runners into the room, leaving me with his third attendant. \u0026nbsp;I heard the tempest battering upon the old house, and shuddered for the deathly chill of the corridor and for the shadows seeming to cower beyond the radius of the candlelight. \u0026nbsp;The tall fellow by me was growling presently at my ear, “D’ye not know me, master? \u0026nbsp;Roger Galt, as got ye out of the Stone House. \u0026nbsp;Didn’t think to see me here, did ye? \u0026nbsp;‘Set a thief to catch a thief,’ says Mr. Bradbury. \u0026nbsp;Hist!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2790/77244.html","bookId":1293,"creation":"Aug 5, 2019 2:38:10 AM","modification":"Aug 5, 2019 2:38:10 AM"}
