{"id":30807,"no":3,"title":"Chapter III. Mrs. Mary Howe","content":"\u0026nbsp;My mother was looking out from the gate into the moonlit street when I reached home. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I saw her white cap poking from among the evergreens, as I rounded the corner. \u0026nbsp;She was white and shaking when she hurried to meet me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear, where have you been?” she cried. \u0026nbsp;“I’ve been waiting for you these three hours or more. \u0026nbsp;I’ve been so much afraid.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m sorry, mother,” I answered, as I kissed her. \u0026nbsp;“I’ve been with Tony. \u0026nbsp;Nothing’s amiss. \u0026nbsp;I went with him up to the Hall, and saw the Squire, that’s all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ve been in trouble, then? \u0026nbsp;Oh, you’ve been caught poaching with young Vining! \u0026nbsp;That’s what you mean, isn’t it?” she said, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, that’s it, mother, but Squire only laughed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She said no more, but stepped before me through the garden—now all silvered with the moon and scented with gillie-flowers and stocks and sweet moss-roses—into the cottage. \u0026nbsp;She p. 30kept our dwelling as neat and trim within as the garden about it. \u0026nbsp;The room we entered was freshly lime-washed; the windows were hung with snow-white curtains and gay with flowers in boxes. \u0026nbsp;Settle and chairs and table were oaken, and dark with age; an old Dutch clock, brass candlesticks and canisters stood on the chimney-piece; blue and white ware and lustre were ranged upon the shelves, with pewter polished silver-white even as the brasses shone like gold. \u0026nbsp;My supper was set on bleached white linen—a cold pasty, bread and cheese, and cider in a covered jug; though I was well-nigh starving for the lateness of the hour, and though my mother hastened to cut a wedge from the pasty for me, I could not eat or drink till I had told the tale of our adventure and of Mr. Bradbury’s interest. \u0026nbsp;At the first mention of Mr. Bradbury’s name, I believed that she started, and that the colour crept into her cheeks. \u0026nbsp;My mother was pale and tall and fine,—all white and black, ivory-white of skin, dark of eye and hair—wearing black stuff gowns, snow-white mob-caps and aprons, save of a Sunday, when she put on her silk dress, in which she made a figure fitter to the Hall than to the village,—so it seemed to me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Observing her stirred from her placidity, I asked, “Who’s Mr. Bradbury, mother? \u0026nbsp;p. 31Squire’s lawyer, I know, but what can be his interest in us? \u0026nbsp;Why didn’t he let Tim baste Tony and me? \u0026nbsp;And why did he question the Squire about you and me, and how long we’d lived in the village? \u0026nbsp;And then the way he watched me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She said quietly, though there was a tremor in her voice, “Sit down and eat your supper, John. \u0026nbsp;It’s late and I’m weary. \u0026nbsp;Mr. Bradbury is the servant of many great families. \u0026nbsp;Once—years ago—he knew me, before I was wed to Richard Howe. \u0026nbsp;And—and—he knew your father. \u0026nbsp;You’re very like your father.” \u0026nbsp;Watching her, I believed that I saw dread in her eyes, and that her lips were trembling. \u0026nbsp;Meeting my look, she added steadily, “That is all, John. \u0026nbsp;Promise me that you’ll not go poaching with Tony again!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, it’s easy enough to promise, mother,” I said, sitting down to my supper, “but it’s not so easy to keep my word.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why? \u0026nbsp;It should be easy!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, and it would be, if I had anything else to occupy me. \u0026nbsp;You see, I’m weary of wasting my days in Chelton. \u0026nbsp;You’d have me a scholar; and that I’ll never be. \u0026nbsp;Mr. Vining would tell you so, for I’m sure he tells me as much every day of the week. \u0026nbsp;And what should Tony and I be doing except getting into mischief?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 32“I’ve asked you, John,” she said, simply, “to wait just a little longer. \u0026nbsp;I couldn’t have you go to London. \u0026nbsp;Remembering your father! \u0026nbsp;You’re safe here. \u0026nbsp;I wish you could be happy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But here I am turned seventeen. \u0026nbsp;I’ve not the head for book-learning. \u0026nbsp;And what’s the purpose of it all? \u0026nbsp;Do you want me to be a schoolmaster or a clergyman?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” she said quickly, “to be a gentleman. \u0026nbsp;This Mr. Bradbury—did he say anything else to you? \u0026nbsp;Anything about your father?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only what I’ve told you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She nodded, but said no more; sitting silent and abstracted until I had eaten my supper; rising then to clear away the meal, whilst I, taking down my Latin grammar, set myself to conning my lesson for the morrow, apprehending that Mr. Vining’s cane would make amends for the punishment of which Mr. Bradbury’s intervention had disappointed Tim Kerrick. \u0026nbsp;But if my eyes were fixed on the page, my thoughts were straying back to Mr. Bradbury, from his appearance out of his wrecked coach to the moment when I had left him standing chuckling beside Squire Chelton. \u0026nbsp;My mother, coming back quietly, sat down with her sewing; so we remained till the hands of the clock pointed to the hour of eleven. \u0026nbsp;And even as I shut my Latin p. 33grammar to prepare for bed, and my mother rose to set away her sewing, a tapping sounded on the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My mother started; whispered to me, “Who should come so late?”—and, going to the door, demanded, “Who is there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A low voice answered, “Mr. Bradbury, seeking Mrs. Mary Howe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I heard my mother gasp, and saw her throw her hands up; controlling herself then she unbarred the door, and curtsied, as Mr. Bradbury, wrapped in his black cloak, entered the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Forgive me, Mrs. Howe,” he said, with his stiff bow. \u0026nbsp;“I’d not have come so late, but that I desired my business with you and your son to be kept secret, and that it brooked of no delay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Whilst I stood gaping at Mr. Bradbury, my mother barred the door, and dusting a chair, then set it by the table for him. \u0026nbsp;When he sat down, she remained standing facing him; though her eyes seemed to regard him with terror, and her breath came swiftly, she uttered not a word, or asked the purpose of his visit. \u0026nbsp;He looked at her, and smiled to himself; sought his jewelled box in his pocket, and took snuff deliberately. \u0026nbsp;He said at last, “I was not mistaken, Mrs. Howe. \u0026nbsp;The boy’s looks and likeness did not mislead me. \u0026nbsp;p. 34Need I express myself as very happy to renew our acquaintance?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My mother, leaning forward, said slowly, “Since my son told me, sir, of your interest, I did not doubt that you would come here. \u0026nbsp;Let me say only this: that had I dreamt that you would ever come to Chelton, and recognise him so easily, I’d not have stayed in the village. \u0026nbsp;I’d have sought another hiding-place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mrs. Howe,” he said, smiling, “you’re frank with me. \u0026nbsp;I’m happy that you should be. \u0026nbsp;You will be frank with me in answering all I have to ask you.” \u0026nbsp;She watched him silently; he waved his hand towards me, asking, “Isn’t it time for the lad to be abed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He stays here, Mr. Bradbury,” she answered with composure. \u0026nbsp;“What you may have to say need be no secret from him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He nodded, his look expressing satisfaction, but his keen eyes darting at her, as though to read her thought; she continued steadily to watch him. \u0026nbsp;He said, “Your answer gives me confidence, Mrs. Howe. \u0026nbsp;I’m happy that you’re willing that the boy remain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Bradbury,” cried she, with mounting colour, “pray ask your questions!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “First let me put this to you—the boy’s father—?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 35“I think him dead. \u0026nbsp;He passed by the name of Richard Howe in London. \u0026nbsp;When he left me I believed at first that he must have returned to his home. \u0026nbsp;He has gone out of my life. \u0026nbsp;I—I cannot think him living”—with a sudden gasp and start of tears. \u0026nbsp;“Mr. Bradbury, you do not come from him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Alas no!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “From whom, then? \u0026nbsp;From them?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not answer, saying, as if he had not heard her question, “To anyone knowing my honoured client, old Mr. Edward Craike, this young gentleman would pass unquestionably as his grandson.—His look would establish his identity as Richard’s son. \u0026nbsp;If—forgive me—proof of your marriage were available? \u0026nbsp;You use—your maiden name!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I felt my cheeks burn, and started forward; he waved me impatiently aside; my mother interrupted hastily, her face expressionless, but the colour staining her face, “You need not ask your question, Mr. Bradbury.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He proceeded coolly, “Mr. Richard Craike has been lost to his family for many years. \u0026nbsp;Having known Richard I appreciate easily the reasons which actuated him in cutting himself wholly from his family and in passing under an assumed name. \u0026nbsp;Richard’s death—again forgive me, p. 36madam, should render his son heir to Mr. Edward Craike,—a gentleman of considerable fortune,—as I need not remind you.” \u0026nbsp;He smeared his lip with snuff, and paused, eyeing her closely. \u0026nbsp;She answering nothing, he said swiftly, “You do not help me, Mrs. Craike.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pray, sir, go on,” she said, impatiently. \u0026nbsp;“Say what you have to say.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He said, still in that hard tone of his, “From one who had suffered at the hands of the Craike family—more particularly at the hands of Mr. Charles Craike, and at the hands of Mrs. Charles,—since deceased,—of Mr. Charles, then, heir in the event of Richard’s death, it might be idle for me to seek any assistance only to serve the interests of my client—Mr. Edward—as I conceive these interests. \u0026nbsp;Idle to plead the loneliness of an old, unhappy man, having lost the one thing that made life precious to him—his elder son, the very light of his eyes. \u0026nbsp;But if I urge, Mrs. Craike, that the opportunity presents itself,—not only of insuring the fortunes of Richard’s son-but also of retaliating upon Charles Craike, of excluding him, his son, Oliver, from a rich inheritance,—what then, Mrs. Craike?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked up at him, her eyes curiously alight, her lips curling, but for the moment did not answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 37“And Charles Craike being responsible—possibly responsible—for the disappearance of his brother”—he proceeded, tapping impatiently upon his snuff-box, “what then, Mrs. Craike?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Bradbury,” she said instantly, “this is a question I shall not answer now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Edward Craike is of advanced years and broken health. \u0026nbsp;His death is shortly to be expected,” he said. \u0026nbsp;“Your decision is of some urgency. \u0026nbsp;Nor do I desire my visits to you to be a matter of gossip at Chelton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may come to-morrow night,” she answered indifferently, “as you have come to-night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ay, surely,” he said, rising stiffly, “but you should be able to answer me immediately.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have said to-morrow night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You, madam, guaranteeing that you will remain here in the meantime on my assurance that I do not seek to promote the interests of Mr. Charles Craike. \u0026nbsp;You will not seek to elude me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have my promise, Mr. Bradbury,” she said quietly; and moving to the door, unbarred it. \u0026nbsp;She curtsied to his stiff bow; wrapping his cloak about him he passed out swiftly.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2790/77218.html","bookId":1293,"creation":"Aug 5, 2019 2:38:10 AM","modification":"Aug 5, 2019 2:38:10 AM"}
