{"id":30837,"no":33,"title":"Chapter XXXIII. Carrion Crows","content":"\u0026nbsp;My uncle, rushing forward, dropped on his knees beside him, and lifted up his head. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I took the glass from the press, and poured a little of the spirit into it, and handed this to my uncle, who moistened my grandfather’s lips with it, and sought to dribble a few drops down his throat. \u0026nbsp;And nearer, nearer yet, crept the rogues; recoiling from the living, they feared him still, lest even now he should arise, and his voice send them scurrying as so little a while before. \u0026nbsp;But he lay still,—his eyes open and glassy; his lips parted. \u0026nbsp;My uncle lowered his head to the floor, and rising, said, “I think him dead”—but with no tremor in his voice or hint of sorrow or compassion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And instantly the woman Barwise laughed horribly, and screamed, “Dead, and we’ve naught to fear!”—and pointing her hand at me, “What now, Mr. John—what now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle, in a harsh voice cried out, “Be silent, woman! \u0026nbsp;Respect the dead! \u0026nbsp;Out of the room, all of you!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 260She answered with defiance, “Not now! \u0026nbsp;While he was livin’, we couldn’t have what we’re here for. \u0026nbsp;And I for one stays here, and don’t stir for you; that’s what I say, and that’s what ye all say, if ye’re men.” \u0026nbsp;Whereat her sons thrust their way forward, and the old men piped shrilly, “Ay, ay, that’s what we all say. \u0026nbsp;Ay, ay!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle said disdainfully, “I can tell you only that, if you think to find treasure in the house, you deceive yourselves grievously. \u0026nbsp;Do you think that my father was such a fool as to hoard money or jewels in this house with such a company as you about him? \u0026nbsp;I promise you that all he had was long since converted into East India stock and the like; he kept nothing by him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But that’s a lie!” Thrale piped. \u0026nbsp;“He had treasure by him. \u0026nbsp;Many’s the time he’s been laughing to himself for thinking that we who’d fought and bled, and risked the sea and the shot and the rope, sought our share of it, and never took a dollar of it. \u0026nbsp;I’ve been minded to stick this knife into him many a time!”—and his skeleton-hand showed a lean, glittering blade, “Oh, and I come in one day and he don’t hear me, and he has a box and a death’s head, and ’tis all on fire with baubles. \u0026nbsp;All aflame! \u0026nbsp;What’s come of ’em, Mr. Charles, what’s come of ’em?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 261“I tell you—” my uncle began; but their yell of derision silenced him; a wicked ring of faces was about us: old faces stained with all the sins, old eyes bright for the lust of treasure, old hands clutching and covetous; their voices sounding as the cawing of crows; like carrion crows they flapped about us, and the dead man lying stretched across the hearth. \u0026nbsp;The tall Barwise sons watched them, grinning and muttering between themselves. \u0026nbsp;Four of Blunt’s men had sneaked back into the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle, smiling contemptuously upon the rogues, asked quietly, “Do you know anything of this, nephew?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I answered steadily, “Nothing! \u0026nbsp;Nothing!”—but must have flushed for my lie; the woman Barwise cried out instantly, “He’s lying! \u0026nbsp;He’s lying! look at him,—all red-faced now, when he was sick and white afore”—and rushing on me, clawing at my jacket, “Where’s it hid? \u0026nbsp;You know! \u0026nbsp;Where’s it hid?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But instantly my uncle intervened—concerned now for my knowledge, and by the dread that all these rogues should share the secret. \u0026nbsp;He ordered her, “Stand back, woman! \u0026nbsp;Do you hear me? \u0026nbsp;Stand back!” in so threatening a tone that she recoiled and loosed me.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle, gripping me by the shoulder, drew p. 262me beside him; I had taken up the pistols fallen from his father’s hands; now we stood with our backs against the chimney-piece, and my grandfather’s body lay between us and the rogues. \u0026nbsp;Oliver came shouldering his way among them to our side, a hunting crop clutched in his hand. \u0026nbsp;Mistress Barwise, as beside herself, screamed out a curse at us, and shook her fist, so inciting them that in a sullen surge they were sweeping forward, when my uncle, livid with rage, cried out, “Back, you fools,—back! \u0026nbsp;Do you know this, that while you waste your time here, Bradbury returns, with Gavin Masters and his folk, who’ve sworn to smoke us out of this hold? \u0026nbsp;Do you know this and palter?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ay, then stand aside,” retorted Mistress Barwise, “and let us have the handling of the lad there. \u0026nbsp;He knows for sure, and we have the means to make him talk”—and pointed to the fire. \u0026nbsp;“He’ll speak for the burning of his bare flesh. \u0026nbsp;He’ll speak, if he knows to keep his mouth shut now, means to keep it shut come Judgment Day!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll not lay hands upon him!” said my uncle, as I made play with the loaded pistol. \u0026nbsp;“Give me a word with him alone! \u0026nbsp;All of you out of the room now! \u0026nbsp;Let me but reason with him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 263“And plot to rob us!” Thrale squeaked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, nay!” my uncle protested, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Barwise woman, swinging round, muttered and whispered with old Thrale; turning back to us presently to say, “We’ll go—but only outside the door. \u0026nbsp;But we’ll keep the key, lest you think to lock us out.” \u0026nbsp;Oliver had drawn away from the hearth to the wall.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Surely take the key, Barwise,” said my uncle. \u0026nbsp;“But a few words with my nephew, and you’ll know whether he will confide in me or no. \u0026nbsp;And if he prove intractable, I promise you that I’ll hand him over to you for discipline”—I believed that the gentleman found himself at a loss to prevent their participation in my secret.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Out of the room, then, all of you,” she ordered them, and drove them before her like so many hens; they protested with many oaths; she screaming at them in kind so berated them that they were out at last. \u0026nbsp;She paused by the door to take the key from the lock. \u0026nbsp;Of a sudden Oliver leaped forward and thrust her after them; banged the door with a crash, and turned the key. \u0026nbsp;Her cry of rage was shrill as the wind itself; she plunged against the door and beat upon it like a madwoman, screaming out, “Break it down! \u0026nbsp;Break it down! \u0026nbsp;They’re tricking us!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 264Oliver set the bar in its place, and turned back to us grinning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle smiled his approval, “I never gave you credit for any wit,” he said; “I offer you apology. \u0026nbsp;I confess I was at a loss,—I thank you for having given me the opportunity of a little talk with my nephew. \u0026nbsp;Be sure of the bar, Oliver; the door will hold them out, I trust, till Bradbury returns.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Oliver, coming back to the hearth, growled, “Help me first to lift the old man. \u0026nbsp;Is he to lie here longer in this blood?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nay, nay,” said my uncle hastily; and among us, we lifted my grandfather’s body and laid it upon the bed, and drew the curtains; all the while the clamour at the door continued; the winds yet beat upon the house. \u0026nbsp;My uncle, returning to the fireside, sat down in his father’s chair—for all the raging of the rogues without seeming as indolent and unruffled as in the arbour.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nephew,” he said, “I would our conversation could have been conducted with proper privacy. \u0026nbsp;Oliver, oblige me by withdrawing to the door.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Oliver answered boldly, “I stay here!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You heard me, Oliver!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I heard you, sir! \u0026nbsp;And you have never heard p. 265me ere this night. \u0026nbsp;By God, sir, you should have taught me by now to be ashamed at nothing; yet—yet—to know the part that you have played this night,—you to have raised these rogues against my cousin and the old man there!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle smiling, though his brow grew black, cried out, “If I’d my cane, sir, I’d discipline you now. \u0026nbsp;Are you drunk yet from dinner? \u0026nbsp;Or do you think to win your cousin’s patronage at my expense? \u0026nbsp;You think him heir to Craike and all my father had. \u0026nbsp;I having nothing, you range yourself beside him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am ashamed,” said Oliver, regarding him with dark and lowering look. \u0026nbsp;“By God, sir, I’ve been silent long enough. \u0026nbsp;I’ll endure no more. \u0026nbsp;Now this I’ll say to my cousin—if he’ll believe me; if he’ll think I have no motive but to be his friend, and save my father from fresh roguery and shame—I stand beside him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “When the door goes down, my good fellow, as presently it will,” my uncle sneered, “they’ll have your life and his.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Oliver stretched out his hand to me; I gripped it; side by side we faced my uncle.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He said, “I have no time to bandy words with you, my son. \u0026nbsp;I say this to you, John, that the Barwise sons are pledged to me, and will obey me, and Blunt’s men also will obey me! \u0026nbsp;p. 266It is my condition only that you tell me where my father’s hoard is hid; for clearly he revealed it to you while you were with him; and that the agreement between us be, that we shall share this treasure. \u0026nbsp;It’s hid in the house,—I assume in this very room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you assume,” I said, “my grandfather revealed it to me. \u0026nbsp;You assume too much, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dear lad, your very face reveals your knowledge to me. \u0026nbsp;Come, write, sign—there are pens and paper in the press there!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I answer this,” I said; “whatever come or have come to me from my grandfather, you shall not share. \u0026nbsp;You would have had me kidnapped and shipped out of England. \u0026nbsp;You have ever been an enemy to mine and me. \u0026nbsp;What of my father?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nephew,” he said, “hark to the pack outside the door!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He rose; his look surveyed the room—the hangings were waving in the draught. \u0026nbsp;He pointed suddenly to the tapestry drawn yet a little aside from the sliding panel; and at my start and confusion he laughed triumphantly, and strode forward. \u0026nbsp;I lost my head; I sought to interpose; he thrust me from him, and rushing to the wall drew back the hangings. \u0026nbsp;All this while the rogues without battered upon the door; p. 267I heard it groan and split, and knew that it was going down before their blows.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle’s fingers strayed over the panels; touched the spring; the panels parted. \u0026nbsp;He cried out gaily, “Oh, ’tis here, nephew—’tis here! \u0026nbsp;And I asked but a half, nephew,—what now? \u0026nbsp;What now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you steal?” Oliver growled. \u0026nbsp;“Are you thief?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He answered, snarling, “Ah, God, what I’ve endured these years, and now this boy would rob me. \u0026nbsp;I’ll have what’s mine. \u0026nbsp;I care not how you fare, nephew—whether they do you to death, or drag you aboard the Black Wasp—I care not. \u0026nbsp;I’ll have what’s mine, and be away ere Bradbury comes!”—and thrust the panels back, and fumbled with the lock, but could make nothing of it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I laughed at him. \u0026nbsp;“My uncle,” cried I, “it’s for me to dictate terms. \u0026nbsp;Your interest with these rogues for me, and I’ll make you rich; but the secret of the lock I’ll keep!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He whirled round upon me, his mask off, his face malignant, his lips snarling. \u0026nbsp;He let the tapestry fall before the hollow in the wall. \u0026nbsp;He pointed to the door. \u0026nbsp;It had parted asunder, the wreckage fell against the bar.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2790/77248.html","bookId":1293,"creation":"Aug 5, 2019 2:38:10 AM","modification":"Aug 5, 2019 2:38:10 AM"}
