{"id":30838,"no":34,"title":"Chapter XXXIV. Flight of Crows","content":"\u0026nbsp;Mrs. Barwise headed them still—Lord, what a strength must have been hers in youth; even now her withered hands tore at the wreckage of the door. \u0026nbsp;Her sons and she had cleared a way presently; the bar was drawn, and all the rogues were in the room once more. \u0026nbsp;But, setting my back against the chimney-piece, with Oliver beside me, I levelled my pistol as they came on, menacing, and I cried out, “Keep back! \u0026nbsp;You’ll not lay hands on me. \u0026nbsp;Back, I say!” \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this Mrs. Barwise checked her onrush; and whirled round towards my uncle stepping back from the wall. \u0026nbsp;The rogues at her back halted and peered at us, muttering among themselves; Nick and Isaac Barwise and Blunt’s men yet held apart. \u0026nbsp;The woman demanded furiously of my uncle, “Well? \u0026nbsp;Well? \u0026nbsp;What’s the answer? \u0026nbsp;You’ve not tricked us after all, d’ye see? \u0026nbsp;D’ye see? \u0026nbsp;What’s his answer?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He said coolly, “I’ve no answer for you. \u0026nbsp;Ask him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As she swung round and faced me, I said, as p. 270bravely as I might, though shaking still for terror of them, “My answer is that there’s no treasure. \u0026nbsp;Ay, and were there treasure, every gold piece or jewel of it would belong to me, even as, now my grandfather is dead, this house belongs to me. \u0026nbsp;And I say to you you’d best be packing while you may. \u0026nbsp;You there from the Black Wasp, d’ye know that while you’re paltering here your ship’s cut out? \u0026nbsp;D’ye know the King’s men are aboard her?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bold words, but lies!” cried Mistress Barwise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No! \u0026nbsp;For but yesterday I was with old Sir Gavin, who’s sworn to put an end to smuggling on the coast here. \u0026nbsp;Your ship was never to put to sea. \u0026nbsp;Not Blunt himself would have got her from the teeth of the King’s ship. \u0026nbsp;Would you be taken here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The four seamen muttered among themselves; I saw them drawing to the doorway—scuttling out; only the old rogues and the Barwise sons yet held their ground, and Mrs. Barwise sought still to enflame them to her purpose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Words—ay, but we’ve not come for words from you, master,” she burst out. \u0026nbsp;“Where’s the baubles, master? \u0026nbsp;Where’s the gold? \u0026nbsp;Our baubles and our gold!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ay, ay, ours! \u0026nbsp;That’s what we’re here to p. 271know! \u0026nbsp;Where’s the stuff hid?”—came the chorus.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I faced them still,—Oliver with his swinging whip beside me. \u0026nbsp;I said, “Keep back! \u0026nbsp;I’ve a word for you, as a word for Blunt’s men. \u0026nbsp;I tell you Mr. Bradbury comes this night, with his men, and Sir Gavin’s folk, and all the gentry round. \u0026nbsp;He comes to make an end here—to sweep this house clean—for me! \u0026nbsp;You’ve threatened murder; you’ve robbed and broken; you’ve set every man of you his neck in reach of a rope to-night; I warn you all, for you served my grandfather, that soon, perhaps now, the house must be surrounded. \u0026nbsp;You’ve escaped hanging so long, how d’ye like the prospect of swinging at the end of a rope at the end of your days? \u0026nbsp;Take what you’ve looted—plate and what not?—and go! \u0026nbsp;You’ll take no more. \u0026nbsp;There is no treasure!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lies!” screamed the woman, as they quailed and wavered. \u0026nbsp;“Where’s the blunt first? \u0026nbsp;Don’t go till you’ve laid hands on what’s your own.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go now!” I shouted, to be heard above the instant uproar. \u0026nbsp;“Go now before it is too late!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As they wavered, she shrieked out, “Pull him down! \u0026nbsp;Take him and hold him but the moment, and I’ll have the truth out of him—with the irons and the fire!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 272They surged forward, but before my levelled pistol and Oliver’s uplifted hunting crop, they wavered still; having each and every man of them so little left of life, and valuing it at a price above visionary treasure. \u0026nbsp;My uncle, leaning unconcerned against his father’s chair, neither incited them nor assisted us; Nick and Isaac Barwise seemed to await their orders from him, yet holding themselves apart from the old rogues.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And suddenly I saw Mr. Bradbury standing within the doorway, his hair all blown with the wind—else, as cool and unperturbed as ever I had known him; seeing him come in, with Galt and the two runners at his back, I cried out triumphantly, “Too late! \u0026nbsp;Too late!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mistress Barwise uttered a shrill scream, and rushed back among the rogues; they broke, fell back; scuttled like rats about the room; seeking the door, and finding Roger and the runners standing grimly before it, they huddled together against the wall. \u0026nbsp;Mr. Bradbury, stepping forward, demanded swiftly, “What is this? \u0026nbsp;Where is Mr. Craike?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I pointed to the bed, “My grandfather lies there,” I said. \u0026nbsp;“He died an hour since, sir—died while he faced these rogues. \u0026nbsp;What now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bradbury whispered, “Sir Gavin waits p. 273below! \u0026nbsp;We hold the hall-door and the stair. \u0026nbsp;We come well-armed,—we’re none too many.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And these rogues!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Bid them go! \u0026nbsp;If they go quietly, so much the better for us, so much the less scandal. \u0026nbsp;We’re not so many that they may not pass,—unless you’d hold them here! \u0026nbsp;Yet bid them go! \u0026nbsp;We’re not too many!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I faced them then; I cried out, to be heard above a gust of the falling wind, “You’ve yet a chance to get away. \u0026nbsp;Go now—all of you—out of this house! \u0026nbsp;You served my grandfather, and for that I’ve no mind to punish you for what you’ve done this night. \u0026nbsp;Take what’s your own—no more, and be away from this house within an hour. \u0026nbsp;D’ye hear me? \u0026nbsp;Go!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Galt and the runners stood aside at a wave of Mr. Bradbury’s hand. \u0026nbsp;Like a flight of carrion crows the rogues sped from the room; save only Mistress Barwise, and she, her eyes blazing, her mouth spitting curses, her hands clawing the air, as she backed from the room, wore rather the aspect of an aged cat than of a carrion crow. \u0026nbsp;Pell-mell they fled, as swiftly as their withered shanks would bear them; clattered along the corridor, and were gone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So there were left in the room with the dead only Mr. Bradbury and his men, my kinsfolk and p. 274myself. \u0026nbsp;My uncle, lounging in his father’s chair, with a poor assumption of his old effrontery, asked of Mr. Bradbury, “By what authority, pray tell me, does this lad ape the master of the house? \u0026nbsp;As heir to Craike?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall leave the question unanswered, Charles,” said Mr. Bradbury gravely, motioning towards the bed. \u0026nbsp;“This is neither the time nor the place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By what authority?” my uncle repeated, his eyes suddenly alight.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Surely as your elder brother’s son,” said Mr. Bradbury. \u0026nbsp;“My honoured and lamented client’s will—signed by his hand this night—and taken by me from this house and lodged in safety, will be produced and read by me in due course.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By what authority?” cried my uncle, with bitter anger. \u0026nbsp;“Answer my question, Bradbury!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Till I read this will, and divulge its provisions to you,” said Mr. Bradbury steadily, “may I say that Mr. John Craike must enjoy in this house an authority not inferior to your own? \u0026nbsp;By no means inferior, my dear sir!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But ere my uncle might retort, there came a sound of scuffling from the door—a shrill scream—one of the runners growling, “You’ll not go in, mistress—I tell you you’ll not go in!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n p. 275And the shrill voice piping, “I’ll see Mr. Charles, I will see Mr. Charles!”—with a string of oaths ending in choking, coughing; surely ’twas Mother Mag.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle rose from his chair, and demanded angrily, “What’s this to-do? \u0026nbsp;What does the woman want? \u0026nbsp;Let her come in!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let her come in!” repeated Mr. Bradbury; and, while I stared, Mother Mag, escaping from the runner, was in the room. \u0026nbsp;She stood there, bent nigh double, her skinny hands clawing at her shawl; she said no word, but spying Charles, crept forward to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it, woman?” Mr. Bradbury asked, sharply; she blinked still at Charles, muttering, “I’ve a word for Mr. Craike—no more!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Speak!” said my uncle, indifferently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Martin would have me come!” croaked she. \u0026nbsp;“Martin would have me come every step o’ the way, though it’s a weary, weary way, and the devil’s loose to-night. \u0026nbsp;With a word for Mr. Charles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Speak!” cried my uncle again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No more than this—no more: ‘Adam Baynes’ come home again!’ \u0026nbsp;Adam Baynes—!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But I recalled the words of Roger Galt as he bore me away from the Stone House, that Adam Baynes, this woman’s son, had been p. 276transported overseas and had died; and I wondered that, if the man lived and Roger had lied, the woman showed no joy in her son’s return—surely he had escaped—but only terror; that, shuddering and shaking, she stood blinking at my uncle, and muttering to herself, clutching her blue shawl about her throat, and sweeping her wind-blown hair from her face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bradbury cried out sharply, “What is the meaning of all this, Charles? \u0026nbsp;Who is this Adam Baynes? \u0026nbsp;What concern is it of yours?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is this woman’s son,” my uncle answered, seeming to strive for mastery of himself. \u0026nbsp;“He was a servant of this house—once; that is all! \u0026nbsp;Well, mistress, well? \u0026nbsp;You’ve brought your grandson’s message. \u0026nbsp;Tell Martin Baynes he’ll hear from me! \u0026nbsp;That is all! \u0026nbsp;Go now! \u0026nbsp;I’ve other concerns.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She peered at him; muttered to herself; and tottered towards the door. \u0026nbsp;Mr. Bradbury started forward as though to stay her; instantly my uncle intervened, protesting, “Let the woman go, Bradbury. \u0026nbsp;She’s of no concern to you or me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n While Mr. Bradbury hesitated, the woman slipped past the runners, and was gone; my uncle turned back to the fire, and again sat down in his father’s chair. \u0026nbsp;I watched him, wondering p. 277at the terror on his face, his twisting lips, his flickering eyes—at what new dread was borne upon him by the woman’s words, “Adam Baynes’ come home again!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Roger Galt was growling from the doorway. \u0026nbsp;“Who’s Adam Baynes? \u0026nbsp;Mother Mag’s son never went overseas, after all. \u0026nbsp;Mother Mag’s son stayed here and died from a pistol-ball in the breast!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bradbury, turning back to my uncle, cried out sharply, “Who’s this fellow, Charles? \u0026nbsp;Why should this woman bring word to you? \u0026nbsp;Who should come from overseas, that you should fear, and shudder so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n My uncle answering nothing, Mr. Bradbury called out sharply to the runners, “Hold that woman! \u0026nbsp;Don’t let her leave the house. \u0026nbsp;Hold her! \u0026nbsp;There’s more in this.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But though we started to the door, and Roger and the runners went scurrying down the corridor, Mother Mag had vanished like a ghost in the darkness of the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2790/77249.html","bookId":1293,"creation":"Aug 5, 2019 2:38:10 AM","modification":"Aug 5, 2019 2:38:10 AM"}
