{"id":30811,"no":7,"title":"Chapter VII. The Riders","content":"\u0026nbsp;I remember that once an itinerant showman, passing through Chelton, essayed Mazeppa; none the less, the sorry performance took my fancy. \u0026nbsp;Now, when I became conscious, I had a sense that I was borne forward so through the night bound upon a horse; my next sensation, after the throbbing of my head, was the friction of the saddle beneath me. \u0026nbsp;I realised at last that I was, indeed, held upon the horse; not cords, but the strong arm of the rider held me before him in saddle; he was riding with me at a great speed through the night. \u0026nbsp;I must have cried out, for I recall his hoarse voice in my ear, “Keep your mouth shut, my lad, or ’twill be the worse for you!”—and the grip of his arm tightened about me. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now I was no light burden, and I was stoutly built for a stripling; even so, he carried me easily, and when my head cleared and my strength came back, the grip of his arm held me securely. \u0026nbsp;I must needs sit before him helpless, though the saddle galled me sorely; my brows throbbed, and p. 60my mind was dark with apprehensions. \u0026nbsp;To be sure my coming to Rogues’ Haven must have been dreaded by my uncle; and to be sure this was some trick of his to prevent my presentation to my grandfather; but what should be the end of this adventure, and to what fate would my enemies consign me? \u0026nbsp;I told myself that surely, if they had planned to make an end of me, they would have done so immediately on the taking of the coach, and not have borne me off in this mysterious manner through the night.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And what of Mr. Bradbury? \u0026nbsp;Had he died in his fall? \u0026nbsp;Had they done him further violence? \u0026nbsp;I had grown to have a high regard for the gentleman, yet I fear my immediate concern for his fate was chiefly that he should be alive to bring me speedy aid. \u0026nbsp;Lying passive in the grip of that strong arm, I believed that one other horseman bore us company; I could hear hoof-beats and the jingle of accoutrements; once, as the moon flashed through the racing clouds, I caught a glimpse of a dark rider a little ahead. \u0026nbsp;My captor pushed his horse forward at scarcely less speed, though the moon, ere the clouds hid it, revealed to me that we were riding over rough country. \u0026nbsp;I saw the boughs of gnarled and twisted trees toss to the stormy heaven; I saw a waste of rock and furze before me; I believed that we were yet at p. 61no great distance from the coast, for the salt was upon my lips, as though the gale sweeping up bore scud with it. \u0026nbsp;Momentarily we paused upon an upland; such was the force of the wind that it seemed the horse must be rolled over with us; then, with the wind blowing at our backs, we struck away inland.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The blow had torn my scalp; the blood was wet upon my brows; my head was racked with the movement of the horse beneath us; my body cruelly galled. \u0026nbsp;All this was nothing to the ever-increasing terror of the thought—what would they do to me, now that they had me captive? \u0026nbsp;Once I cried out, “What’s your purpose with me, in God’s name?” but the sole answer was the tightening of the grip upon me. \u0026nbsp;Bending back my head, I tried to make out in the dark what manner of man was holding me; save for the shoulders, the thick neck, and the great head, I could discern nothing; I heard his jeering laughter above me. \u0026nbsp;How long, how far we rode, I could not conjecture; the time seemed endless for my pains and terrors. \u0026nbsp;Ever the thought tormented me—what would they do with me? \u0026nbsp;Put me aboard some ship to carry me overseas? \u0026nbsp;No, for it seemed that they were bearing me away from the coast, and mounting slowly to wild and rugged country; would they hold me prisoner p. 62there, or murder me out of the ken of folk? \u0026nbsp;And, if Mr. Bradbury lived, how would he endure defeat by Charles Craike, through whose agency surely I came to be in this plight?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n We were riding at last over more level country from the increasing swiftness of our flight; we slackened speed going among trees; I heard the rushing of the wind through their complaining boughs. \u0026nbsp;We mounted a low hill, and swiftly descended. \u0026nbsp;Again the moon was clear; I believed that we were going down into a cup in the moors; that rocks and woods were all about us. \u0026nbsp;And ahead at last I saw a light flicker like a will-o’-the-wisp,—a spark of light that increased to the square shining of a window—a greenish light; the moon breaking again from the clouds I saw that we rode down to a house alone in this lonely hollow of the moors. \u0026nbsp;We rode soon over level ground; we reached a high stone wall; the rider ahead of us had leaped down and was unlocking an iron gate; we passed through, and the gate crashed to behind us. \u0026nbsp;At a walk now we clattered over cobbles up to the front of the house; I saw the green shining off the curtained window from the grey front of moonlit stone. \u0026nbsp;It was a house of two stories in height, a drear grey house, grey-roofed and over-topped by chimney stacks; looking up I believed that I saw p. 63iron bars before the unshuttered windows. \u0026nbsp;My captor roared out, “Hallo, there!” as we pulled up before the door; and gripping me by my collar lowered me to the ground, dropping down after me, and lugging me with him into the porch. \u0026nbsp;The door opened with a clash and clatter like the iron-bound door of a prison. \u0026nbsp;And blinking for the light from a lantern, I saw peering out a crone, bent nigh double, one skinny claw holding up the lantern, so that it shone upon her shrivelled livid face, her red-lidded, pale green eyes, on her grey hair wind-blown, and the blue shawl she clutched at her throat. \u0026nbsp;I saw her looking malevolently at me, and heard her tittering laughter, as my captor thrust me past her into the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The door clashed after us. \u0026nbsp;He lugged me through a dark stone hall, and brought me into the green-curtained room; so thick was the air with the smoke of peat and the reek of an oil-lamp that in a moment my eyes were blinded; and I was coughing, choking.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2790/77222.html","bookId":1293,"creation":"Aug 5, 2019 2:38:10 AM","modification":"Aug 5, 2019 2:38:10 AM"}
