{"id":3323,"no":30,"title":"SANSA","content":"On the morning her new gown was to be ready, the serving maid filled Sansa’s tub with steaming hot water and scrubbed her head to toe until she glowed pink. Cersei’s own bedmaid trimmed her nails and brushed and curled her auburn hair so it fell down her back in soft ringlets. She brought a dozen of the queen’s favorite scents as well. Sansa chose a sharp sweet fragrance with a hint of lemon in it under the smell of flowers. The maid dabbed some on her finger and touched Sansa behind each ear, and under her chin, and then lightly on her nipples.\u0026nbsp; Cersei herself arrived with the seamstress, and watched as they dressed Sansa in her new clothes. The smallclothes were all silk, but the gown itself was ivory samite and cloth-of-silver, and lined with silvery satin. The points of the long dagged sleeves almost touched the ground when she lowered her arms. And it was a woman’s gown, not a little girl’s, there was no doubt of that. The bodice was slashed in front almost to her belly, the deep vee covered over with a panel of ornate Myrish lace in dove-grey. The skirts were long and full, the waist so tight that Sansa had to hold her breath as they laced her into it. They brought her new shoes as well, slippers of soft grey doeskin that hugged her feet like lovers. “You are very beautiful, my lady,” the seamstress said when she was dressed.\u0026nbsp; “I am, aren’t I?” Sansa giggled, and spun, her skirts swirling around her. “Oh, I am.” She could not wait for Willas to see her like this. He will love me, he will, he must... he will forget Winterfell when he sees me, I’ll see that he does.\u0026nbsp; Queen Cersei studied her critically. “A few gems, I think. The moonstones Joffrey gave her.”\u0026nbsp; “At once, Your Grace,” her maid replied.\u0026nbsp; When the moonstones hung from Sansa’s ears and about her neck, the queen nodded. “Yes. The gods have been kind to you, Sansa. You are a lovely girl. It seems almost obscene to squander such sweet innocence on that gargoyle.”\u0026nbsp; “What gargoyle?” Sansa did not understand. Did she mean Willas? How could she know? No one knew, but her and Margaery and the Queen of Thorns... oh, and Dontos, but he didn’t count. Cersei Lannister ignored the question. “The cloak,” she commanded, and the women brought it out: a long cloak of white velvet heavy with pearls. A fierce direwolf was embroidered upon it in silver thread. Sansa looked at it with sudden dread. “Your father’s colors,” said Cersei, as they fastened it about her neck with a slender silver chain.\u0026nbsp; A maiden’s cloak. Sansa’s hand went to her throat. She would have torn the thing away if she had dared.\u0026nbsp; “You’re prettier with your mouth closed, Sansa,” Cersei told her. “Come along now, the septon is waiting. And the wedding guests as well.”\u0026nbsp; “No,” Sansa blurted. “No.”\u0026nbsp; “Yes. You are a ward of the crown. The king stands in your father’s place, since your brother is an attainted traitor. That means he has every right to dispose of your hand. You are to marry my brother Tyrion.”\u0026nbsp; My claim, she thought, sickened. Dontos the Fool was not so foolish after all; he had seen the truth of it. Sansa backed away from the queen. “I won’t.” I’m to marry Willas, I’m to be the lady of Highgarden, please...\u0026nbsp; “I understand your reluctance. Cry if you must. In your place, I would likely rip my hair out. He’s a loathsome little imp, no doubt of it, but marry him you shall.”\u0026nbsp; “You can’t make me.”\u0026nbsp; “Of course we can. You may come along quietly and say your vows as befits a lady, or you may struggle and scream and make a spectacle for the stableboys to titter over, but you will end up wedded and bedded all the same.” The queen opened the door. Ser Meryn Trant and Ser Osmund Kettleblack were waiting without, in the white scale armor of the Kingsguard. “Escort Lady Sansa to the sept,” she told them. “Carry her if you must, but try not to tear the gown, it was very costly-”\u0026nbsp; Sansa tried to run, but Cersei’s handmaid caught her before she’d gone a yard. Ser Meryn Trant gave her a look that made her cringe, but Kettleblack touched her almost gently and said, “Do as you’re told, sweetling, it won’t be so bad. Wolves are supposed to be brave, aren’t they?”\u0026nbsp; Brave. Sansa took a deep breath. I am a Stark, yes, I can be brave. They were all looking at her, the way they had looked at her that day in the yard when Ser Boros Blount had torn her clothes off. It had been the Imp who saved her from a beating that day, the same man who was waiting for her now. He is not so bad as the rest of them, she told herself. “I’ll go.”\u0026nbsp; Cersei smiled. “I knew you would.”\u0026nbsp; Afterward, she could not remember leaving the room or descending the steps or crossing the yard. It seemed to take all her attention just to put one foot down in front of the other. Ser Meryn and Ser Osmund walked beside her, in cloaks as pale as her own, lacking only the pearls and the direwolf that had been her father’s. Joffrey himself was waiting for her on the steps of the castle sept. The king was resplendent in crimson and gold, his crown on his head. “I’m your father today,” he announced.\u0026nbsp; “You’re not,” she flared. “You’ll never be.”\u0026nbsp; His face darkened. “I am. I’m your father, and I can marry you to whoever I like. To anyone. You’ll marry the pig boy if I say so, and bed down with him in the sty.” His green eyes glittered with amusement. “Or maybe I should give you to Ilyn Payne, would you like him better?”\u0026nbsp; Her heart lurched. “Please, Your Grace,” she begged. “If you ever loved me even a little bit, don’t make me marry your uncle?” Tyrion Lannister stepped through the doors of the sept. “Your Grace,” he said to Joffrey. “Grant me a moment alone with Lady Sansa, if you would be so kind?”\u0026nbsp; The king was about to refuse, but his mother gave him a sharp look. They drew off a few feet.\u0026nbsp; Tyrion wore a doublet of black velvet covered with golden scrollwork, thigh-high boots that added three inches to his height, a chain of rubies and lions’ heads. But the gash across his face was raw and red, and his nose was a hideous scab. “You are very beautiful, Sansa,” he told her.\u0026nbsp; “It is good of you to say so, my lord.” She did not know what else to say. Should I tell him he is handsome? He’ll think me a fool or a liar. She lowered her gaze and held her tongue.\u0026nbsp; “My lady, this is no way to bring you to your wedding. I am sorry for that. And for making this so sudden, and so secret. My lord father felt it necessary, for reasons of state. Else I would have come to you sooner, as I wished.” He waddled closer. “You did not ask for this marriage, I know. No more than I did. If I had refused you, however, they would have wed you to my cousin Lancel. Perhaps you would prefer that. He is nearer your age, and fairer to look upon. If that is your wish, say so, and I will end this farce.”\u0026nbsp; I don’t want any Lannister, she wanted to say. I want Willas, I want Highgarden and the puppies and the barge, and sons named Eddard and Bran and Rickon. But then she remembered what Dontos had told her in the godswood. Tyrell or Lannister, it makes no matter, it’s not me they want, only my claim. “You are kind, my lord,” she said, defeated. “I am a ward of the throne and my duty is to marry as the king commands.”\u0026nbsp; He studied her with his mismatched eyes. “I know I am not the sort of husband young girls dream of, Sansa,” he said softly, “but neither am I Joffrey.”\u0026nbsp; “No,” she said. “You were kind to me. I remember.”\u0026nbsp; Tyrion offered her a thick, blunt-fingered hand. “Come, then. Let us do our duty.”\u0026nbsp; So she put her hand in his, and he led her to the marriage altar, where the septon waited between the Mother and the Father to join their lives together. She saw Dontos in his fool’s motley, looking at her with big round eyes. Ser Balon Swann and Ser Boros Blount were there in Kingsguard white, but not Ser Loras. None of the Tyrells are here, she realized suddenly. But there were other witnesses aplenty; the eunuch Varys, Ser Addam Marbrand, Lord Philip Foote, Ser Bronn, Jalabhar Xho, a dozen others. Lord Gyles was coughing, Lady Ermesande was at the breast, and Lady Tanda’s pregnant daughter was sobbing for no apparent reason. Let her sob, Sansa thought. Perhaps I shall do the same before this day is done.\u0026nbsp; The ceremony passed as in a dream. Sansa did all that was required of her. There were prayers and vows and singing, and tall candles burning, a hundred dancing lights that the tears in her eyes transformed into a thousand. Thankfully no one seemed to notice that she was crying as she stood there, wrapped in her father’s colors; or if they did, they pretended not to. In what seemed no time at all, they came to the changing of the cloaks.\u0026nbsp; As father of the realm, Joffrey took the place of Lord Eddard Stark. Sansa stood stiff as a lance as his hands came over her shoulders to fumble with the clasp of her cloak. One of them brushed her breast and lingered to give it a little squeeze. Then the clasp opened, and Joff swept her maiden’s cloak away with a kingly flourish and a grin.\u0026nbsp; His uncle’s part went less well. The bride’s cloak he held was huge and heavy, crimson velvet richly worked with lions and bordered with gold satin and rubies. No one had thought to bring a stool, however, and Tyrion stood a foot and a half shorter than his bride. As he moved behind her, Sansa felt a sharp tug on her skirt. He wants me to kneel, she realized, blushing. She was mortified. It was not supposed to be this way. She had dreamed of her wedding a thousand times, and always she had pictured how her betrothed would stand behind her tall and strong, sweep the cloak of his protection over her shoulders, and tenderly kiss her cheek as he leaned forward to fasten the clasp.\u0026nbsp; She felt another tug at her skirt, more insistent. I won’t. Why should I spare his feelings, when no one cares about mine?\u0026nbsp; The dwarf tugged at her a third time. Stubbornly she pressed her lips together and pretended not to notice. Someone behind them tittered. The queen, she thought, but it didn’t matter. They were all laughing by then, Joffrey the loudest. “Dontos, down on your hands and knees,” the king commanded. “My uncle needs a boost to climb his bride.”\u0026nbsp; And so it was that her lord husband cloaked her in the colors of House Lannister whilst standing on the back of a fool.\u0026nbsp; When Sansa turned, the little man was gazing up at her, his mouth tight, his face as red as her cloak. Suddenly she was ashamed of her stubbornness. She smoothed her skirts and knelt in front of him, so their heads were on the same level. “With this kiss I pledge my love, and take you for my lord and husband.”\u0026nbsp; “With this kiss I pledge my love,” the dwarf replied hoarsely, “and take you for my lady and wife.” He leaned forward, and their lips touched briefly.\u0026nbsp; He is so ugly, Sansa thought when his face was close to hers. He is even uglier than the Hound. The septon raised his crystal high, so the rainbow light fell down upon them. “Here in the sight of gods and men,” he said, “I do solemnly proclaim Tyrion of House Lannister and Sansa of House Stark to be man and wife, one flesh, one heart, one soul, now and forever, and cursed be the one who comes between them.”\u0026nbsp; She had to bite her lip to keep from sobbing.\u0026nbsp; The wedding feast was held in the Small Hall. There were perhaps fifty guests; Lannister retainers and allies for the most part, joining those who had been at the wedding. And here Sansa found the Tyrells. Margaery gave her such a sad look, and when the Queen of Thorns tottered in between Left and Right, she never looked at her at all. Elinor, Alla, and Megga seemed determined not to know her. My friends, Sansa thought bitterly.\u0026nbsp; Her husband drank heavily and ate but little. He listened whenever someone rose to make a toast and sometimes nodded a curt acknowledgment, but otherwise his face might have been made of stone. The feast seemed to go on forever, though Sansa tasted none of the food. She wanted it to be done, and yet she dreaded its end. For after the feast would come the bedding. The men would carry her up to her wedding bed, undressing her on the way and making rude jokes about the fate that awaited her between the sheets, while the women did Tyrion the same honors. Only after they had been bundled naked into bed would they be left alone, and even then the guests would stand outside the bridal chamber, shouting ribald suggestions through the door. The bedding had seemed wonderfully wicked and exciting when Sansa was a girl, but now that the moment was upon her she felt only dread. She did not think she could bear for them to rip off her clothes, and she was certain she would burst into tears at the first randy jape.\u0026nbsp; When the musicians began to play, she timidly laid her hand on Tyrion’s and said, “My lord, should we lead the dance?”\u0026nbsp; His mouth twisted. “I think we have already given them sufficent amusement for one day, don’t you?”\u0026nbsp; “As you say, my lord.” She pulled her hand back.\u0026nbsp; Joffrey and Margaery led in their place. How can a monster dance so beautifully? Sansa wondered. She had often daydreamed of how she would dance at her wedding, with every eye upon her and her handsome lord. in her dreams they had all been smiling. Not even my husband is smiling.\u0026nbsp; Other guests soon joined the king and his betrothed on the floor. Elinor danced with her young squire, and Megga with Prince Tommen. Lady Merryweather, the Myrish beauty with the black hair and the big dark eyes, spun so provocatively that every man in the hall was soon watching her. Lord and Lady Tyrell moved more sedately. Ser Kevan Lannister begged the honor of Lady Janna. Fossoway, Lord Tyrell’s sister. Merry Crane took the floor with the exile prince Jalabhar Xho, gorgeous in his feathered finery. Cersei Lannister partnered first Lord Redwyne, then Lord Rowan, and finally her own father, who danced with smooth unsmiling grace.\u0026nbsp; Sansa sat with her hands in her lap, watching how the queen moved and laughed and tossed her blonde curls. She charms them all, she thought dully. How I hate her. She looked away, to where Moon Boy danced with Dontos.\u0026nbsp; “Lady Sansa.” Ser Garlan Tyrell stood beside the dais. “Would you honor me? If your lord consents?”\u0026nbsp; The Imp’s mismatched eyes narrowed. “My lady can dance with whomever she pleases.”\u0026nbsp; Perhaps she ought to have remained beside her husband, but she wanted to dance so badly... and Ser Garlan was brother to Margaery, to Willas, to her Knight of Flowers. “I see why they name you Garlan the Gallant, ser,” she said, as she took his hand.\u0026nbsp; “My lady is gracious to say so. My brother Willas gave me that name, as it happens. To protect me.”\u0026nbsp; “To protect you?” She gave him a puzzled look.\u0026nbsp; Ser Garlan laughed. “I was a plump little boy, I fear, and we do have an uncle called Garth the Gross. So Willas struck first, though not before threatening me with Garlan the Greensick, Garlan the Galling, and Garlan the Gargoyle.”\u0026nbsp; It was so sweet and silly that Sansa had to laugh, despite everything. Afterward she was absurdly grateful. Somehow the laughter made her hopeful again, if only for a little while. Smiling, she let the music take her, losing herself in the steps, in the sound of flute and pipes and harp, in the rhythm of the drum... and from time to time in Ser Garlan’s arms, when the dance brought them together. “My lady wife is most concerned for you,” he said quietly, one such time.\u0026nbsp; “Lady Leonette is too sweet. Tell her I am well.”\u0026nbsp; “A bride at her wedding should be more than well.” His voice was not unkind. “You seemed close to tears.”\u0026nbsp; “Tears of joy, ser.”\u0026nbsp; “Your eyes give the lie to your tongue.” Ser Garlan turned her, drew her close to his side. “My lady, I have seen how you look at my brother. Loras is valiant and handsome, and we all love him dearly... but your Imp will make a better husband. He is a bigger man than he seems, I think.”\u0026nbsp; The music spun them apart before Sansa could think of a reply. It was Mace Tyrell opposite her, red-faced and sweaty, and then Lord Merryweather, and then Prince Tommen. “I want to be married too,” said the plump little princeling, who was all of nine. “I’m taller than my uncle!”\u0026nbsp; “I know you are,” said Sansa, before the partners changed again. Ser Kevan told her she was beautiful, Jalabhar Xho said something she did not understand in the Summer Tongue, and Lord Redwyne wished her many fat children and long years of joy. And then the dance brought her face-to-face with Joffrey.\u0026nbsp; Sansa stiffened as his hand touched hers, but the king tightened his grip and drew her closer. “You shouldn’t look so sad. My uncle is an ugly little thing, but you’ll still have me.”\u0026nbsp; “You’re to marry Margaery!”\u0026nbsp; “A king can have other women. Whores. My father did. One of the Aegons did too. The third one, or the fourth. He had lots of whores and lots of bastards.” As they whirled to the music, Joff gave her a moist kiss. “My uncle will bring you to my bed whenever I command it.”\u0026nbsp; Sansa shook her head. “He won’t.”\u0026nbsp; “He will, or I’ll have his head. That King Aegon, he had any woman he wanted, whether they were married or no.”\u0026nbsp; Thankfully, it was time to change again. Her legs had turned to wood, though, and Lord Rowan, Ser Tallad, and Elinor’s squire all must have thought her a very clumsy dancer. And then she was back with Ser Garlan once more, and soon, blessedly, the dance was over.\u0026nbsp; Her relief was short-lived. No sooner had the music died than she heard Joffrey say, “It’s time to bed them! Let’s get the clothes off her, and have a look at what the she-wolf’s got to give my uncle!” Other men took up the cry, loudly.\u0026nbsp; Her dwarf husband lifted his eyes slowly from his wine cup. “I’ll have no bedding.”\u0026nbsp; Joffrey seized Sansa’s arm. “You will if I command it.”\u0026nbsp; The Imp slammed his dagger down in the table, where it stood quivering. “Then you’ll service your own bride with a wooden prick. I’ll geld you, I swear it.”\u0026nbsp; A shocked silence fell. Sansa pulled away from Joffrey, but he had a grip on her, and her sleeve ripped. No one even seemed to hear. Queen Cersei turned to her father. “Did you hear him?”\u0026nbsp; Lord Tywin rose from his seat. “I believe we can dispense with the bedding. Tyrion, I am certain you did not mean to threaten the king’s royal person.”\u0026nbsp; Sansa saw a spasm of rage pass across her husband’s face. “I misspoke,” he said. “It was a bad jape, sire.”\u0026nbsp; “You threatened to geld me!” Joffrey said shrilly.\u0026nbsp; “I did, Your Grace,” said Tyrion, “but only because I envied your royal manhood. Mine own is so small and stunted.” His face twisted into a leer. “And if you take my tongue, you will leave me no way at all to pleasure this sweet wife you gave me.”\u0026nbsp; Laughter burst from the lips of Ser Osmund Kettleblack. Someone else sniggered. But Joff did not laugh, nor Lord Tywin. “Your Grace,” he said, “my son is drunk, you can see that.”\u0026nbsp; “I am,” the Imp confessed, “but not so drunk that I cannot attend to my own bedding.” He hopped down from the dais and grabbed Sansa roughly. “Come, wife, time to smash your portcullis. I want to play come-into-the-castle.”\u0026nbsp; Red-faced, Sansa went with him from the Small Hall. What choice do I have? Tyrion waddled when he walked, especially when he walked as quickly as he did now. The gods were merciful, and neither Joffrey nor any of the others moved to follow.\u0026nbsp; For their wedding night, they had been granted the use of an airy bedchamber high in the Tower of the Hand. Tyrion kicked the door shut behind them. “There is a flagon of good Arbor gold on the sideboard, Sansa. Will you be so kind as to pour me a cup?”\u0026nbsp; “Is that wise, my lord?”\u0026nbsp; “Nothing was ever wiser. I am not truly drunk, you see. But I mean to be.”\u0026nbsp; Sansa filled a goblet for each of them. It will be easier if I am drunk as well. She sat on the edge of the great curtained bed and drained half her cup in three long swallows. No doubt it was very fine wine, but she was too nervous to taste it. It made her head swim. “Would you have me undress, my lord?”\u0026nbsp; “Tyrion.” He cocked his head. “My name is Tyrion, Sansa.”\u0026nbsp; “Tyrion. My lord. Should I take off my gown, or do you want to undress me?” She took another swallow of wine.\u0026nbsp; The imp turned away from her. “The first time I wed, there was us and a drunken septon, and some pigs to bear witness. We ate one of our witnesses at our wedding feast. Tysha fed me crackling and I licked the grease off her fingers, and we were laughing when we fell into bed.”\u0026nbsp; “You were wed before? I... I had forgotten.”\u0026nbsp; “You did not forget. You never knew.”\u0026nbsp; “Who was she, my lord?” Sansa was curious despite herself.\u0026nbsp; “Lady Tysha.” His mouth twisted. “Of House Silverfist. Their arms have one gold coin and a hundred silver, upon a bloody sheet. Ours was a very short marriage... as befits a very short man, I suppose.”\u0026nbsp; Sansa stared down at her hands and said nothing.\u0026nbsp; “How old are you, Sansa?” asked Tyrion, after a moment.\u0026nbsp; “Thirteen,” she said, “when the moon turns.”\u0026nbsp; “Gods have mercy.” The dwarf took another swallow of wine. “Well, talk won’t make you older. Shall we get on with this, my lady? if it please you?”\u0026nbsp; “It will please me to please my lord husband.”\u0026nbsp; That seemed to anger him. “You hide behind courtesy as if it were a castle wall.”\u0026nbsp; “Courtesy is a lady’s armor,” Sansa said. Her septa had always told her that.\u0026nbsp; “I am your husband. You can take off your armor now.”\u0026nbsp; “And my clothing?”\u0026nbsp; “That too.” He waved his wine cup at her. “My lord father has commanded me to consummate this marriage.”\u0026nbsp; Her hands trembled as she began fumbling at her clothes. She had ten thumbs instead of fingers, and all of them were broken. Yet somehow she managed the laces and buttons, and her cloak and gown and girdle and undersilk slid to the floor, until finally she was stepping out of her smallclothes. Gooseprickles covered her arms and legs. She kept her eyes on the floor, too shy to look at him, but when she was done she glanced up and found him staring. There was hunger in his green eye, it seemed to her, and fury in the black. Sansa did not know which scared her more.\u0026nbsp; “You’re a child,” he said.\u0026nbsp; She covered her breasts with her hands. “I’ve flowered.”\u0026nbsp; “A child,” he repeated, “but I want you. Does that frighten you, Sansa?”\u0026nbsp; “Yes.”\u0026nbsp; “Me as well. I know I am ugly -\u0026nbsp; “No, my -if\u0026nbsp; He pushed himself to his feet. “Don’t lie, Sansa. I am malformed, scarred, and small, but...” she could see him groping “... abed, when the candles are blown out, I am made no worse than other men. In the dark, I am the Knight of Flowers.” He took a draught of wine. “I am generous. Loyal to those who are loyal to me. I’ve proven I’m no craven. And I am cleverer than most, surely wits count for something. I can even be kind. Kindness is not a habit with us Lannisters, I fear, but I know I have some somewhere. I could be... I could be good to you.”\u0026nbsp; He is as frightened as I am, Sansa realized. Perhaps that should have made her feel more kindly toward him, but it did not. All she felt was pity, and pity was death to desire. He was looking at her, waiting for her to say something, but all her words had withered. She could only stand there trembling.\u0026nbsp; When he finally realized that she had no answer for him, Tyrion Lannister drained the last of his wine. “I understand,” he said bitterly. “Get in the bed, Sansa. We need to do our duty.”\u0026nbsp; She climbed onto the featherbed, conscious of his stare. A scented beeswax candle burned on the bedside table and rose petals had been strewn between the sheets. She had started to pull up a blanket to cover herself when she heard him say, “No.”\u0026nbsp; The cold made her shiver, but she obeyed. Her eyes closed, and she waited. After a moment she heard the sound of her husband pulling off his boots, and the rustle of clothing as he undressed himself. When he hopped up on the bed and put his hand on her breast, Sansa could not help but shudder. She lay with her eyes closed, every muscle tense, dreading what might come next. Would he touch her again? Kiss her? Should she open her legs for him now? She did not know what was expected of her.\u0026nbsp; “Sansa.” The hand was gone. “Open your eyes.”\u0026nbsp; She had promised to obey; she opened her eyes. He was sitting by her feet, naked. Where his legs joined, his man’s staff poked up stiff and hard from a thicket of coarse yellow hair, but it was the only thing about him that was straight.\u0026nbsp; “My lady,” Tyrion said, “you are lovely, make no mistake, but... I cannot do this. My father be damned. We will wait. The turn of a moon, a year, a season, however long it takes. Until you have come to know me better, and perhaps to trust me a little.” His smile might have been meant to be reassuring, but without a nose it only made him look more grotesque and sinister.\u0026nbsp; Look at him, Sansa told herself, look at your husband, at all of him, Septa Mordane said all men are beautiful, find his beauty, try. She stared at the stunted legs, the swollen brutish brow, the green eye and the black one, the raw stump of his nose and crooked pink scar, the coarse tangle of black and gold hair that passed for his beard. Even his manhood was ugly, thick and veined, with a bulbous purple head. This is not right, this is not fair, how have I sinned that the gods would do this to me, how?\u0026nbsp; “On my honor as a Lannister,” the Imp said, “I will not touch you until you want me to.”\u0026nbsp; It took all the courage that was in her to look in those mismatched eyes and say, “And if I never want you to, my lord?”\u0026nbsp; His mouth jerked as if she had slapped him. “Never?”\u0026nbsp; Her neck was so tight she could scarcely nod.\u0026nbsp; “Why,” he said, “that is why the gods made whores for imps like me.” He closed his short blunt fingers into a fist, and climbed down off the bed. \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1623/48051.html","bookId":125,"creation":"Aug 1, 2019 4:31:00 AM","modification":"Aug 1, 2019 4:31:00 AM"}
