{"id":3357,"no":64,"title":"JAIME","content":"The king is dead, they told him, never knowing that Joffrey was his son as well as his sovereign.\u0026nbsp; “The Imp opened his throat with a dagger,” a costermonger declared at the roadside inn where they spent the night. “He drank his blood from a big gold chalice.” The man did not recognize the bearded one-handed knight with the big bat on his shield, no more than any of them, so he said things he might otherwise have swallowed, had he known who was listening.\u0026nbsp; “It was poison did the deed,” the innkeep insisted. “The boy’s face turned black as a plum.”\u0026nbsp; “May the Father judge him justly,” murmured a septon.\u0026nbsp; “The dwarf’s wife did the murder with him,” swore an archer in Lord Rowan’s livery. “Afterward, she vanished from the hall in a puff of brimstone, and a ghostly direwolf was seen prowling the Red Keep, blood dripping from his jaws.”\u0026nbsp; Jaime sat silent through it all, letting the words wash over him, a horn of ale forgotten in his one good hand. Joffrey. My blood. My firstborn. My son. He tried to bring the boy’s face to mind, but his features kept turning into Cersei’s. She will be in mourning, her hair in disarray and her eyes red from crying, her mouth trembling as she tries to speak. She will cry again when she sees me, though she’ll fight the tears. His sister seldom wept but when she was with him. She could not stand for others to think her weak. Only to her twin did she show her wounds. She will look to me for comfort and revenge.\u0026nbsp; They rode hard the next day, at Jaime’s insistence. His son was dead, and his sister needed him. When he saw the city before him, its watchtowers dark against the gathering dusk, Jaime Lannister cantered up to Steelshanks Walton, behind Nage with the peace banner.\u0026nbsp; “What’s that awful stink?” the northman complained.\u0026nbsp; Death, thought Jaime, but he said, “Smoke, sweat, and shit. King’s Landing, in short. If you have a good nose you can smell the treachery too. You’ve never smelled a city before?”\u0026nbsp; “I smelled White Harbor. It never stank like this.”\u0026nbsp; “White Harbor is to King’s Landing as my brother Tyrion is to Ser Gregor Clegane.”\u0026nbsp; Nage led them up a low hill, the seven-tailed peace banner lifting and turning in the wind, the polished seven-pointed star shining bright upon its staff. He would see Cersei soon, and Tyrion, and their father. Could my brother truly have killed the boy? Jaime found that hard to believe.\u0026nbsp; He was curiously calm. Men were supposed to go mad with grief when their children died, he knew. They were supposed to tear their hair out by the roots, to curse the gods and swear red vengeance. So why was it that he felt so little? The boy lived and died believing Robert Baratheon his sire.\u0026nbsp; Jaime had seen him born, that was true, though more for Cersei than the child. But he had never held him. “How would it look?” his sister warned him when the women finally left them. “Bad enough Joff looks like you without you mooning over him.” Jaime yielded with hardly a fight. The boy had been a squalling pink thing who demanded too much of Cersei’s time, Cersei’s love, and Cersei’s breasts. Robert was welcome to him.\u0026nbsp; And now he’s dead. He pictured Joff lying still and cold with a face black from poison, and still felt nothing. Perhaps he was the monster they claimed. If the Father Above came down to offer him back his son or his hand, Jaime knew which he would choose. He had a second son, after all, and seed enough for many more. If Cersei wants another child I’ll give her one... and this time I’ll hold him, and the Others take those who do not like it. Robert was rotting in his grave, and Jaime was sick of lies.\u0026nbsp; He turned abruptly and galloped back to find Brienne. Gods know why I bother. She is the least companionable creature I’ve ever had the misfortune to meet. The wench rode well behind and a few feet off to the side, as if to proclaim that she was no part of them. They had found men’s garb for her along the way; a tunic here, a mantle there, a pair of breeches and a cowled cloak, even an old iron breastplate. She looked more comfortable dressed as a man, but nothing would ever make her look handsome. Nor happy. Once out of Harrenhal, her usual pighead stubbornness had soon reasserted itself. “I want my arms and armor back,” she had insisted. “Oh, by all means, let us have you back in steel,” Jaime replied. “A helm, especially. We’ll all be happier if you keep your mouth shut and your visor down.”\u0026nbsp; That much Brienne could do, but her sullen silences soon began to fray his good humor almost as much as Qyburn’s endless attempts to be ingratiating. I never thought I would find myself missing the company of Cleos Frey, gods help me. He was beginning to wish he had left her for the bear after all.\u0026nbsp; “King’s Landing,” Jaime announced when he found her. “Our journey’s done, my lady. You’ve kept your vow, and delivered me to King’s Landing. All but a few fingers and a hand.” Brienne’s eyes were listless. “That was only half my vow. I told Lady Catelyn I would bring her back her daughters. Or Sansa, at the least. And now...”\u0026nbsp; She never met Robb Stark, yet her grief for him runs deeper than mine for Joff. Or perhaps it was Lady Catelyn she mourned. They had been at Brindlewood when they had that news, from a red-faced tub of a knight named Ser Bertram Beesbury, whose arms were three beehives on a field striped black and yellow. A troop of Lord Piper’s men had passed through Brindlewood only yesterday, Beesbury told them, rushing to King’s Landing beneath a peace banner of their own. “With the Young Wolf dead Piper saw no point to fighting on. His son is captive at the Twins.” Brienne gaped like a cow about to choke on her cud, so it fell to Jaime to draw out the tale of the Red Wedding.\u0026nbsp; “Every great lord has unruly bannermen who envy him his place,” he told her afterward. “My father had the Reynes and Tarbecks, the Tyrells have the Florents, Hoster Tully had Walder Frey. Only strength keeps such men in their place. The moment they smell weakness... during the Age of Heroes, the Boltons used to flay the Starks and wear their skins as cloaks.” She looked so miserable that Jaime almost found himself wanting to comfort her.\u0026nbsp; Since that day Brienne had been like one half-dead. Even calling her “wench” failed to provoke any response. The strength is gone from her. The woman had dropped a rock on Robin Ryger, battled a bear with a tourney sword, bitten off Vargo Float’s ear, and fought Jaime to exhaustion... but she was broken now, done. “I’ll speak to my father about returning you to Tarth, if it please you,” he told her. “Or if you would rather stay, I could perchance find some place for you at court.”\u0026nbsp; “As a lady companion to the queen?” she said dully.\u0026nbsp; Jaime remembered the sight of her in that pink satin gown, and tried not to imagine what his sister might say of such a companion. “Perhaps a post with the City Watch...”\u0026nbsp; “I will not serve with oathbreakers and murderers.”\u0026nbsp; Then why did you ever bother putting on a sword? he might have said, but he bit back the words. “As you will, Brienne.” One-handed, he wheeled his horse about and left her.\u0026nbsp; The Gate of the Gods was open when they reached it, but two dozen wayns were lined up along the roadside, loaded with casks of cider, barrels of apples, bales of hay, and some of the biggest pumpkins Jaime had ever seen. Almost every wagon had its guards; men-at-arms wearing the badges of small lordlings, sellswords in mail and boiled leather, sometimes only a pink-cheeked farmer’s son clutching a homemade spear with a firehardened point. Jaime smiled at them all as he trotted past. At the gate, the gold cloaks were collecting coin from each driver before waving the wagons through. “What’s this?” Steelshanks demanded.\u0026nbsp; “They got to pay for the right to sell inside the city. By command of the King’s Hand and the master of coin.”\u0026nbsp; Jaime looked at the long line of wayns, carts, and laden horses. “Yet they still line up to pay?”\u0026nbsp; “There’s good coin to be made here now that the fighting’s done,” the miller in the nearest wagon told them cheerfully. “It’s the Lannisters hold the city now, old Lord Tywin of the Rock. They say he shits silver.”\u0026nbsp; “Gold,” Jaime corrected dryly. “And Littlefinger mints the stuff from goldenrod, I vow.”\u0026nbsp; “The Imp is master of coin now,” said the captain of the gate. “Or was, till they arrested him for murdering the king.” The man looked the northmen over suspiciously. “Who are you lot?”\u0026nbsp; “Lord Bolton’s men, come to see the King’s Hand.”\u0026nbsp; The captain glanced at Nage with his peace banner. “Come to bend the knee, you mean. You’re not the first. Go straight up to the castle, and see you make no trouble.” He waved them through and turned back to the wagons.\u0026nbsp; If King’s Landing mourned its dead boy king, Jaime would never have known it. On the Street of Seeds a begging brother in threadbare robes was praying loudly for Joffrey’s soul, but the passersby paid him no more heed than they would a loose shutter banging in the wind. Elsewhere milled the usual crowds; gold cloaks in their black mail, bakers’ boys selling tarts and breads and hot pies, whores leaning out of windows with their bodices half unlaced, gutters redolent of nightsoil. They passed five men trying to drag a dead horse from the mouth of an alley, and elsewhere a juggler spinning knives through the air to delight a throng of drunken Tyrell soldiers and small children.\u0026nbsp; Riding down familiar streets with two hundred northmen, a chainless maester, and an ugly freak of a woman at his side, Jaime found he scarcely drew a second look. He did not know whether he ought to be amused or annoyed. “They do not know me,” he said to Steelshanks as they rode through Cobbler’s Square.\u0026nbsp; “Your face is changed, and your arms as well,” the northman said, “and they have a new Kingslayer now.”\u0026nbsp; The gates to the Red Keep were open, but a dozen gold cloaks armed with pikes barred the way. They lowered their points as Steelshanks came trotting up, but Jaime recognized the white knight commanding them. “Ser Meryn.”\u0026nbsp; Ser Meryn Trant’s droopy eyes went wide. “Ser Jaime?”\u0026nbsp; “How nice to be remembered. Move these men aside.”\u0026nbsp; It had been a long time since anyone had leapt to obey him quite so fast. Jaime had forgotten how well he liked it.\u0026nbsp; They found two more Kingsguard in the outer ward; two who had not worn white cloaks when Jaime last served here. How like Cersei to name me Lord Commander and then choose my colleagues without consulting me. “Someone has given me two new brothers, I see,” he said as he dismounted.\u0026nbsp; “We have that honor, ser.” The Knight of Flowers shone so fine and pure in his white scales and silk that Jaime felt a tattered and tawdry thing by contrast.\u0026nbsp; Jaime turned to Meryn Trant. “Ser, you’ve been remiss in teaching our new brothers their duties.”\u0026nbsp; “What duties?” said Meryn Trant defensively.\u0026nbsp; “Keeping the king alive. How many monarchs have you lost since I left the city? Two, is it?” Then Ser Balon saw the stump. “Your hand...”\u0026nbsp; Jaime made himself smile. “I fight with my left now. It makes for more of a contest. Where will I find my lord father?”\u0026nbsp; “In the solar with Lord Tyrell and Prince Oberyn.”\u0026nbsp; Mace Tyrell and the Red Viper breaking bread together? Strange and stranger. “Is the queen with them as well?”\u0026nbsp; “No, my lord,” Ser Balon answered. “You’ll find her in the sept, praying over King Joff -\u0026nbsp; “You!”\u0026nbsp; The last of the northmen had dismounted, Jaime saw, and now Loras Tyrell had seen Brienne.\u0026nbsp; “Ser Loras.” She stood stupidly, holding her bridle.\u0026nbsp; Loras Tyrell strode toward her. “Why?” he said. “You will tell me why. He treated you kindly, gave you a rainbow cloak. Why would you kill him?”\u0026nbsp; “I never did. I would have died for him.”\u0026nbsp; “You will.” Ser Loras drew his longsword.\u0026nbsp; “It was not me.”\u0026nbsp; “Emmon Cuy swore it was, with his dying breath.”\u0026nbsp; “He was outside the tent, he never saw -”\u0026nbsp; “There was no one in the tent but you and Lady Stark. Do you claim that old woman could cut through hardened steel?”\u0026nbsp; “There was a shadow I know how mad it sounds, but... I was helping Renly into his armor, and the candles blew out and there was blood everywhere. It was Stannis, Lady Catelyn said. His... his shadow. I had no part in it, on my honor...”\u0026nbsp; “You have no honor. Draw your sword. I won’t have it said that I slew you while your hand was empty.”\u0026nbsp; Jaime stepped between them. “Put the sword away, ser.”\u0026nbsp; Ser Loras edged around him. “Are you a craven as well as a killer, Brienne? Is that why you ran, with his blood on your hands? Draw your sword, woman!”\u0026nbsp; “Best hope she doesn’t.” Jaime blocked his path again. “Or it’s like to be your corpse we carry out. The wench is as strong as Gregor Clegane, though not so pretty.”\u0026nbsp; “This is no concern of yours.” Ser Loras shoved him aside.\u0026nbsp; Jaime grabbed the boy with his good hand and yanked him around. “I am the Lord Commander of the Kingsguard, you arrogant pup. Your commander, so long as you wear that white cloak. Now sheathe your bloody sword, or I’ll take it from you and shove it up some place even Renly never found.”\u0026nbsp; The boy hesitated half a heartbeat, long enough for Ser Balon Swann to say, “Do as the Lord Commander says, Loras.” Some of the gold cloaks drew their steel then, and that made some Dreadfort men do the same. Splendid, thought Jaime, no sooner do I climb down off my horse than we have a bloodbath in the yard.\u0026nbsp; Ser Loras Tyrell slammed his sword back into its sheath.\u0026nbsp; “That wasn’t so difficult, was it?”\u0026nbsp; “I want her arrested.” Ser Loras pointed. “Lady Brienne, I charge you with the murder of Lord Renly Baratheon.”\u0026nbsp; “For what it’s worth,” said Jaime, “the wench does have honor. More than I have seen from you. And it may even be she’s telling it true. I’ll grant you, she’s not what you’d call clever, but even my horse could come up with a better lie, if it was a lie she meant to tell. As you insist, however... Ser Balon, escort Lady Brienne to a tower cell and hold her there under guard. And find some suitable quarters for Steelshanks and his men, until such time as my father can see them.”\u0026nbsp; “Yes, my lord.”\u0026nbsp; Brienne’s big blue eyes were full of hurt as Balon Swann and a dozen gold cloaks led her away. You ought to be blowing me kisses, wench, he wanted to tell her. Why must they misunderstand every bloody thing he did? Aerys. It all grows from Aerys. Jaime turned his back on the wench and strode across the yard.\u0026nbsp; Another knight in white armor was guarding the doors of the royal sept; a tall man with a black beard, broad shoulders, and a hooked nose. When he saw Jaime he gave a sour smile and said, “And where do you think you’re going?”\u0026nbsp; “Into the sept.” Jaime lifted his stump to point. “That one right there. I mean to see the queen.”\u0026nbsp; “Her Grace is in mourning. And why would she be wanting to see the likes of you?”\u0026nbsp; Because I’m her lover, and the father of her murdered son, he wanted to say. “Who in seven hells are you?”\u0026nbsp; “A knight of the Kingsguard, and you’d best learn some respect, cripple, or I’ll have that other hand and leave you to suck up your porridge of a morning.”\u0026nbsp; “I am the queen’s brother, ser.”\u0026nbsp; The white knight thought that funny. “Escaped, have you? And grown a bit as well, m’lord?”\u0026nbsp; “Her other brother, dolt. And the Lord Commander of the Kingsguard. Now stand aside, or you’ll wish you had.”\u0026nbsp; The dolt took a long look this time. “Is it... Ser Jaime.” He straightened. “My pardons, milord. I did not know you. I have the honor to be Ser Osmund Kettleblack.”\u0026nbsp; Where’s the honor in that? “I want some time alone with my sister. See that no one else enters the sept, ser. If we’re disturbed, I’ll have your bloody head.”\u0026nbsp; “Aye, ser. As you say.” Ser Osmund opened the door.\u0026nbsp; Cersei was kneeling before the altar of the Mother. Joffrey’s bier had been laid out beneath the Stranger, who led the newly dead to the other world. The smell of incense hung heavy in the air, and a hundred candles burned, sending up a hundred prayers. Joff’s like to need every one of them, too.\u0026nbsp; His sister looked over her shoulder. “Who?” she said, then, “Jaime?” She rose, her eyes brimming with tears. “Is it truly you?” She did not come to him, however. She has never come to me, he thought. She has always waited, letting me come to her. She gives, but I must ask. “You should have come sooner,” she murmured, when he took her in his arms. “Why couldn’t you have come sooner, to keep him safe? My boy...”\u0026nbsp; Our boy. “I came as fast I could.” He broke from the embrace, and stepped back a pace. “It’s war out there, Sister.”\u0026nbsp; “You look so thin. And your hair, your golden hair...\u0026nbsp; “The hair will grow back.” Jaime lifted his stump. She needs to see. “This won’t.”\u0026nbsp; Her eyes went wide. “The Starks...”\u0026nbsp; “No. This was Vargo Hoat’s work.”\u0026nbsp; The name meant nothing to her. “Who?”\u0026nbsp; “The Goat of Harrenhal. For a little while.”\u0026nbsp; Cersei turned to gaze at Joffrey’s bier. They had dressed the dead king in gilded armor, eerily similar to Jaime’s own. The visor of the helm was closed, but the candles reflected softly off the gold, so the boy shimmered bright and brave in death. The candlelight woke fires in the rubies that decorated the bodice of Cersei’s mourning dress as well. Her hair fell to her shoulders, undressed and unkempt. “He killed him, Jaime. just as he’d warned me. One day when I thought myself safe and happy he would turn my joy to ashes in my mouth, he said.”\u0026nbsp; “Tyrion said that?” Jaime had not wanted to believe it. Kinslaying was worse than kingslaying, in the eyes of gods and men. He knew the boy was mine. I loved Tyrion. I was good to him. Well, but for that one time... but the imp did not know the truth of that. Or did he? “Why would he kill Joff ?”\u0026nbsp; “For a whore.” She clutched his good hand and held it tight in hers. “He told me he was going to do it. Joff knew. As he was dying, he pointed at his murderer. At our twisted little monster of a brother.” She kissed Jaime’s fingers. “You’ll kill him for me, won’t you? You’ll avenge our son.”\u0026nbsp; Jaime pulled away. “He is still my brother.” He shoved his stump at her face, in case she failed to see it. “And I am in no fit state to be killing anyone.”\u0026nbsp; “You have another hand, don’t you? I am not asking you to best the Hound in battle. Tyrion is a dwarf, locked in a cell. The guards would stand aside for you.”\u0026nbsp; The thought turned his stomach. “I must know more of this. Of how it happened.”\u0026nbsp; “You shall,” Cersei promised. “There’s to be a trial. When you hear all he did, you’ll want him dead as much as I do.” She touched his face. “I was lost without you, Jaime. I was afraid the Starks would send me your head. I could not have borne that.” She kissed him. A light kiss, the merest brush of her lips on his, but he could feel her tremble as he slid his arms around her. “I am not whole without you.”\u0026nbsp; There was no tenderness in the kiss he returned to her, only hunger. Her mouth opened for his tongue. “No,” she said weakly when his lips moved down her neck, “not here. The septons...”\u0026nbsp; “The Others can take the septons.” He kissed her again, kissed her silent, kissed her until she moaned. Then he knocked the candles aside and lifted her up onto the Mother’s altar, pushing up her skirts and the silken shift beneath. She pounded on his chest with feeble fists, murmuring about the risk, the danger, about their father, about the septons, about the wrath of gods. He never heard her. He undid his breeches and climbed up and pushed her bare white legs apart. One hand slid up her thigh and underneath her smallclothes. When he tore them away, he saw that her moon’s blood was on her, but it made no difference.\u0026nbsp; “Hurry,” she was whispering now, “quickly, quickly, now, do it now, do me now. Jaime Jaime Jaime.” Her hands helped guide him. “Yes,” Cersei said as he thrust, “my brother, sweet brother, yes, like that, yes, I have you, you’re home now, you’re home now, you’re home.” She kissed his ear and stroked his short bristly hair. Jaime lost himself in her flesh. He could feel Cersei’s heart beating in time with his own, and the wetness of blood and seed where they were joined.\u0026nbsp; But no sooner were they done than the queen said, “Let me up. If we are discovered like this...”\u0026nbsp; Reluctantly he rolled away and helped her off the altar. The pale marble was smeared with blood. Jaime wiped it clean with his sleeve, then bent to pick up the candles he had knocked over. Fortunately they had all gone out when they fell. If the sept had caught fire I might never have noticed.\u0026nbsp; “This was folly.” Cersei pulled her gown straight. “With Father in the castle... Jaime, we must be careful.”\u0026nbsp; “I am sick of being careful. The Targaryens wed brother to sister, why shouldn’t we do the same? Marry me, Cersei. Stand up before the realm and say it’s me you want. We’ll have our own wedding feast, and make another son in place of Joffrey.”\u0026nbsp; She drew back. “That’s not funny.”\u0026nbsp; “Do you hear me chuckling?”\u0026nbsp; “Did you leave your wits at Riverrun?” Her voice had an edge to it. “Tommen’s throne derives from Robert, you know that.”\u0026nbsp; “He’ll have Casterly Rock, isn’t that enough? Let Father sit the throne. All I want is you.” He made to touch her cheek. Old habits die hard, and it was his right arm he lifted.\u0026nbsp; Cersei recoiled from his stump. “Don’t... don’t talk like this. You’re scaring me, Jaime. Don’t be stupid. One wrong word and you’ll cost us everything. What did they do to you?”\u0026nbsp; “They cut off my hand.”\u0026nbsp; “No, it’s more, you’re changed.” She backed off a step. “We’ll talk later. on the morrow. I have Sansa Stark’s maids in a tower cell, I need to question them... you should go to Father.”\u0026nbsp; “I crossed a thousand leagues to come to you, and lost the best part of me along the way. Don’t tell me to leave.”\u0026nbsp; “Leave me,” she repeated, turning away.\u0026nbsp; Jaime laced up his breeches and did as she commanded. Weary as he was, he could not seek a bed. By now his lord father knew that he was back in the city.\u0026nbsp; The Tower of the Hand was guarded by Lannister household guards, who knew him at once. “The gods are good, to give you back to us, ser,” one said, as he held the door.\u0026nbsp; “The gods had no part in it. Catelyn Stark gave me back. Her, and the Lord of the Dreadfort.”\u0026nbsp; He climbed the stairs and pushed into the solar unannounced, to find his father sitting by the fire. Lord Tywin was alone, for which Jaime was thankful. He had no desire to flaunt his maimed hand for Mace Tyrell or the Red Viper just now, much less the two of them together.\u0026nbsp; “Jaime,” Lord Tywin said, as if they’d last seen each other at breakfast. “Lord Bolton led me to expect you earlier. I had hoped you’d be here for the wedding.”\u0026nbsp; “I was delayed.” Jaime closed the door softly. “My sister outdid herself, I’m told. Seventy-seven courses and a regicide, never a wedding like it. How long have you known I was free?”\u0026nbsp; “The eunuch told me a few days after your escape. I sent men into the riverlands to look for you. Gregor Clegane, Samwell Spicer, the brothers Plumm. Varys put out the word as well, but quietly. We agreed that the fewer people who knew you were free, the fewer would be hunting you.”\u0026nbsp; “Did Varys mention this?” He moved closer to the fire, to let his father see.\u0026nbsp; Lord Tywin pushed himself out of his chair, breath hissing between his teeth. “Who did this? If Lady Catelyn thinks -”\u0026nbsp; “Lady Catelyn held a sword to my throat and made me swear to return her daughters. This was your goat’s work. Vargo Hoat, the Lord of Harrenhal!”\u0026nbsp; Lord Tywin looked away, disgusted. “No longer. Ser Gregor’s taken the castle. The sellswords deserted their erstwhile captain almost to a man, and some of Lady Whent’s old people opened a postern gate. Clegane found Hoat sitting alone in the Hall of a Hundred Hearths, half-mad with pain and fever from a wound that festered. His ear, I’m told.”\u0026nbsp; Jaime had to laugh. Too sweet! His ear! He could scarcely wait to tell Brienne, though the wench wouldn’t find it half so funny as he did. “Is he dead yet?”\u0026nbsp; “Soon. They have taken off his hands and feet, but Clegane seems amused by the way the Qohorik slobbers.”\u0026nbsp; Jaime’s smile curdled. “What about his Brave Companions?”\u0026nbsp; “The few who stayed at Harrenhal are dead. The others scattered. They’ll make for ports, I’ll warrant, or try and lose themselves in the woods.” His eyes went back to Jaime’s stump, and his mouth grew taut with fury. “We’ll have their heads. Every one. Can you use a sword with your left hand?”\u0026nbsp; I can hardly dress myself in the morning. Jaime held up the hand in question for his father’s inspection. “Four fingers, a thumb, much like the other. Why shouldn’t it work as well?”\u0026nbsp; “Good.” His father sat. “That is good. I have a gift for you. For your return. After Varys told me...-”\u0026nbsp; “Unless it’s a new hand, let it wait.” Jaime took the chair across from him. “How did Joffrey die?”\u0026nbsp; “Poison. It was meant to appear as though he choked on a morsel of food, but I had his throat slit open and the maesters could find no obstruction.”\u0026nbsp; “Cersei claims that Tyrion did it.”\u0026nbsp; “Your brother served the king the poisoned wine, with a thousand people looking on.”\u0026nbsp; “That was rather foolish of him.”\u0026nbsp; “I have taken Tyrion’s squire into custody. His wife’s maids as well. We shall see if they have anything to tell us. Ser Addam’s gold cloaks are searching for the Stark girl, and Varys has offered a reward. The king’s justice will be done.”\u0026nbsp; The king’s justice. “You would execute your own son?”\u0026nbsp; “He stands accused of regicide and kinslaying. If he is innocent, he has nothing to fear. First we must needs consider the evidence for and against him.”\u0026nbsp; Evidence. In this city of liars, Jaime knew what sort of evidence would be found. “Renly died strangely as well, when Stannis needed him to.”\u0026nbsp; “Lord Renly was murdered by one of his own guards, some woman from Tarth.”\u0026nbsp; “That woman from Tarth is the reason I’m here. I tossed her into a cell to appease Ser Loras, but I’ll believe in Renly’s ghost before I believe she did him any harm. But Stannis -”\u0026nbsp; “It was poison that killed Joffrey, not sorcery.” Lord Tywin glanced at Jaime’s stump again. “You cannot serve in the Kingsguard without a sword hand -”\u0026nbsp; “I can,” he interrupted. “And I will. There’s precedent. I’ll look in the White Book and find it, if you like. Crippled or whole, a knight of the Kingsguard serves for life.”\u0026nbsp; “Cersei ended that when she replaced Ser Barristan on grounds of age. A suitable gift to the Faith will persuade the High Septon to release you from your vows. Your sister was foolish to dismiss Selmy, admittedly, but now that she has opened the gates -” “- someone needs to close them again.” Jaime stood. “I am tired of having highborn women kicking pails of shit at me, Father. No one ever asked me if I wanted to be Lord Commander of the Kingsguard, but it seems I am. I have a duty -”\u0026nbsp; “You do.” Lord Tywin rose as well. “A duty to House Lannister. You are the heir to Casterly Rock. That is where you should be. Tommen should accompany you, as your ward and squire. The Rock is where he’ll learn to be a Lannister, and I want him away from his mother. I mean to find a new husband for Cersei. Oberyn Martell perhaps, once I convince Lord Tyrell that the match does not threaten Highgarden. And it is past time you were wed. The Tyrells are now insisting that Margaery be wed to Tommen, but if I were to offer you instead -”\u0026nbsp; “NO!” Jaime had heard all that he could stand. No, more than he could stand. He was sick of it, sick of lords and lies, sick of his father, his sister, sick of the whole bloody business. “No. No. No. No. No. How many times must I say no before you’ll hear it? Oberyn Martell? The man’s infamous, and not just for poisoning his sword. He has more bastards than Robert, and beds with boys as well. And if you think for one misbegotten moment that I would wed Joffrey’s widow...”\u0026nbsp; “Lord Tyrell swears the girl’s still maiden.”\u0026nbsp; “She can die a maiden as far as I’m concerned. I don’t want her, and I don’t want your Rock!”\u0026nbsp; “You are my son -”\u0026nbsp; “I am a knight of the Kingsguard. The Lord Commander of the Kingsguard! And that’s all I mean to be!”\u0026nbsp; Firelight gleamed golden in the stiff whiskers that framed Lord Tywin’s face. A vein pulsed in his neck, but he did not speak. And did not speak. And did not speak.\u0026nbsp; The strained silence went on until it was more than Jaime could endure. “Father...” he began.\u0026nbsp; “You are not my son.” Lord Tywin turned his face away. “You say you are the Lord Commander of the Kingsguard, and only that. Very well, ser. Go do your duty.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1623/48085.html","bookId":125,"creation":"Aug 1, 2019 4:32:41 AM","modification":"Aug 1, 2019 4:32:41 AM"}
