{"id":90390,"no":1,"title":"Page 1","content":"\u003cp\u003ePrologue\u003c/p\u003e\n\u003cp\u003eThe wedding\u003c/p\u003e\n\u003cp\u003eThe White Rabbit is packed with wedding guests. I look to the bride and groom.\u003c/p\u003e\n\u003cp\u003eSo happy.\u003c/p\u003e\n\u003cp\u003eI smile and watch my very pregnant best friend, Valentina, dance with her brand spanking new husband, Nikolai. The song Tina chose for their first dance as man and wife is ‘Amazing’ by Cassie Davis.\u003c/p\u003e\n\u003cp\u003eIt’s perfect.\u003c/p\u003e\n\u003cp\u003eNik holds Tina close, rubs his nose gently up the length of hers and whispers something against her lips. Tina smiles and responds with closed eyes. I roll my eyes.\u003c/p\u003e\n\u003cp\u003eWhat dorks.\u003c/p\u003e\n\u003cp\u003eLove sure does funny things to people.\u003c/p\u003e\n\u003cp\u003eTina met Nik just over a year ago and spent the beginning of their friendship denying her feelings for him. They remained friends for a while, but anyone with a brain could see the sexual tension between them was so thick you could slice it with a knife.\u003c/p\u003e\n\u003cp\u003eTo cut a long story short, my sweet best friend watched Nik for two weeks through the windows of her store, Safira. Nik would come outside of the club he owns, The White Rabbit, for a cigarette break. Tina would watch his scowling face and become sad.\u003c/p\u003e\n\u003cp\u003eTina doesn’t like to be sad.\u003c/p\u003e\n\u003cp\u003eSo she decided to anonymously send Nik some candy with a note attached. Talking about this now makes Tina laugh. Truth is, she was mortified when Nik sent his brother, Max, over to the store to fetch whoever wrote the note. You see, Tina wrote the note unknowingly on Safira stationary. And the rest is history.\u003c/p\u003e\n\u003cp\u003eTogether, they make a whole.\u003c/p\u003e\n\u003cp\u003eYou would never guess from looking at Tina the sorrow and tragedy she has gone through in her short life. Losing her mom and daughter in the same accident left her hollow for a long time.\u003c/p\u003e\n\u003cp\u003eIt left me hollow too.\u003c/p\u003e\n\u003cp\u003eSee, we lived in Cali. We grew up together. Our parents are Croatian and friends which somehow meant we were automatically friends, too. So, I spent most of my childhood looking out for sweet little Tina who doesn’t have a nasty bone in her body. I love her more than anything. She believes I saved her life when I moved in with her after her daughter and mom passed away, but the truth is, she saved mine.\u003c/p\u003e\n\u003cp\u003eThere is nothing more heart-wrenching than watching your dearest friend deteriorate before your eyes. Tina became a hollow shell, and living in Cali was only making her worse, so she moved to New York. I lasted two years before I packed my shit and followed her down. Living without Tina close by is something I never want to experience again. My heart was shrinking by the day.\u003c/p\u003e\n\u003cp\u003eI’m not what you would call a ‘nice person’. I tolerate people on the best of days.\u003c/p\u003e\n\u003cp\u003eDon’t get me wrong, once you pass the friendship barrier I’ve got up around me, you’re in.\u003c/p\u003e\n\u003cp\u003eBut Tina is a part of my heart. She helps me be a good person. She makes me want to be a better person. Going through what she has, she should be a shrew. But she’s my everyday reminder that life goes on and you have to go with the flow or risk being sucked into a vicious current.\u003c/p\u003e\n\u003cp\u003eI glance over at the bar. Lola and Trick are wrapped up in each other. Not unusual.\u003c/p\u003e\n\u003cp\u003eLola loves Trick with all her heart, but Trick is having a hard time committing to her. I’m unsure why. She’s smart, loyal and loving. Trick is funny and a total knucklehead, but he’s lovable too. You can’t help but laugh at his awful jokes. There’s more to Trick than he’s letting on, but until he lets it loose, we won’t know.\u003c/p\u003e\n\u003cp\u003eMy eyes continue to scan the room. Max and Mimi sit with Ceecee, Max’s daughter. Max and Ceecee are laughing at something, and Mimi is scowling. She’s obviously being made fun of. A smile spreads across my face. Max and Ceecee live with Tina and Nik, so I see them a lot.\u003c/p\u003e\n\u003cp\u003eI love them both.\u003c/p\u003e\n\u003cp\u003eMax is a good friend and really great at talking people off their metaphorical ledges. And Ceecee is so adorable, you just want to eat her up. She was left a paraplegic after an accident when she was just a baby. So they’re another good example of how life goes on and can be good again.\u003c/p\u003e\n\u003cp\u003eMimi, or Meems, has completely transformed since I got to New York. She was as surly as they come. Not at all a touchy-feely person. Ever since we’ve been hanging with the guys, she’s smiling and laughing more.\u003c/p\u003e\n\u003cp\u003eThe guys are what we call…well, the guys. The group consists of Nik, his brother Max, their cousin Trick an old childhood friend, Ghost.\u003c/p\u003e\n\u003cp\u003eGhost.\u003c/p\u003e\n\u003cp\u003eDamn the man.\u003c/p\u003e\n\u003cp\u003eYeah, damn him.\u003c/p\u003e\n\u003cp\u003eGhost is somewhat like me. He’s not a people person either. In saying that, we aren’t friends.\u003c/p\u003e\n\u003cp\u003eThe man is a royal pain in my ass. He chooses the perfect moment of every occasion to whisper something in my ear that’s always enough to make me lose my shit.\u003c/p\u003e\n\u003cp\u003eIt doesn’t take a lot to make me lose my shit.\u003c/p\u003e\n\u003cp\u003eGhost, whose real name is Asher, and I had a ‘moment’ last year. If a ‘moment’ includes being dragged down the hall of a club, having your panties ripped off, then being fucked on a conference table while you beg and scream for more, then, yes, we shared a moment. It was a one-time thing, though. We’ve never spoken about it, but it was the best sex I’ve ever had in my entire life. And I’m no stranger to sex. I love sex, and I’m not afraid to have it as long as protection is used.\u003c/p\u003e\n\u003cp\u003eI wouldn’t say I’m a slut. I’m just in touch with my inner slut. And, let me tell you, she rocks.\u003c/p\u003e\n\u003cp\u003eYou’re such a dumbass.\u003c/p\u003e\n\u003cp\u003eI hate myself for looking out for Ghost. Even if it is on the sly.\u003c/p\u003e\n\u003cp\u003eThe man is insufferable. A total dickhead. No manners what-so-ever. None.\u003c/p\u003e\n\u003cp\u003eSo why can’t you stop thinking about his winkie?\u003c/p\u003e\n\u003cp\u003eGod. I suck.\u003c/p\u003e\n\u003cp\u003eAn arm comes around my shoulder and squeezes. I look around to see my father and mother flanking me.\u003c/p\u003e\n\u003cp\u003e“Such nice wedding, no? I so happy for Valentina.” My dad’s English is not good.\u003c/p\u003e\n\u003cp\u003eHe’s lived in America for thirty years and still has a heavy accent. He isn’t the only one. Tina’s father, Marko, is very much the same. Working with Croats and having the majority of your friends being Croats, they forgot to be American. Even a little.\u003c/p\u003e\n\u003cp\u003eMy mom nudges my dad and says, “Boris, don’t talk wedding things in front of Natalia. You know how she is.” Mom’s English is pretty darn good. She’s a little dramatic. Not that I blame her. Raising three hot-headed girls will do that to you. My dad has been trying to marry me off to a nice Croatian boy since I was eighteen, and whenever he works marriage into a conversation, I normally just walk away with him still flapping his lips.\u003c/p\u003e\n\u003cp\u003eDad glares at mom. “Ana…”\u003c/p\u003e\n\u003cp\u003eMom cuts him off with a firm, “Boris.” Dad pouts and looks away.\u003c/p\u003e\n\u003cp\u003eMom 1 – Dad 0.\u003c/p\u003e\n\u003cp\u003e“I can see Nina over by the bar. I think I’ll join her for a drink.” I remove myself from my father’s clutches and walk away.\u003c/p\u003e\n\u003cp\u003eI walk two steps and hear my dad yell out, “Pamet u glavu! Nemoj mi sramotit!” I smirk. I’ve been hearing this since I was a child. It basically means Use your brain and Don’t embarrass me. Every Croatian child hears this growing up, and most likely, still does. I’m almost twenty-nine and am still hearing it!\u003c/p\u003e\n\u003cp\u003eMy sisters are at the bar chatting, and very obviously flirting with the handsome blonde barman.\u003c/p\u003e\n\u003cp\u003eHe is actually handsome.\u003c/p\u003e\n\u003cp\u003eNot hot exactly. He looks classy.\u003c/p\u003e\n\u003cp\u003eI’ve seen him several times, but don’t know his name. We all meet up at The White Rabbit every Saturday night to drink and unwind. Nik made us girls permanent VIPs. We have our own booth and everything!\u003c/p\u003e\n\u003cp\u003eI smirk internally and decide to be a real bitch. I’m going to spoil their fun.\u003c/p\u003e\n\u003cp\u003eI put on my best sultry smile, walk in-between my sisters and lean over the bar towards the barman.\u003c/p\u003e\n\u003cp\u003e“Hi.” I tilt my head and search his face as if I’m really just seeing him for the first time. “I’m sure you’re new. I would’ve remembered you if I’d seen you here before.” I lightly chew on the nail of my pinky finger, accentuating my naturally pouty lips.\u003c/p\u003e\n\u003cp\u003eThe barman stares at my lips, swallows and replies a choked, “Hi.” He clears his throat and tries again. “Hi. Actually, I know you, Nat. I see you every Saturday night with the Safira party.”\u003c/p\u003e\n\u003cp\u003eI put on my best humiliated face and lean even closer, so he can see my cleavage. “I’m sorry. Maybe I can make it up to you…”\u003c/p\u003e\n\u003cp\u003e“Stefan. But everyone calls me Sheriff.” He takes my hand and kisses it.\u003c/p\u003e\n\u003cp\u003eI take his hand, kiss the tip of his middle finger very lightly and run it along my bottom lip. Stefan’s mouth parts slightly and his body tightens. He looks to be in pain. I whisper, “Let me make it up to you sometime…Sheriff.” Then I wink and walk away, leaving my sisters fuming.\u003c/p\u003e\n\u003cp\u003eHa-ha…Take that, ya whores!\u003c/p\u003e\n\u003cp\u003eMy sisters and I have a love-hate relationship. We love to hate each other. We all look alike, have the same attitude and are extremely short-fused. But we love each other to death, and if someone hurt one of my sisters, they’d have to answer to me. Or my fist. Repeatedly.\u003c/p\u003e\n\u003cp\u003eI make my way to the restroom. As soon as I walk in, I hear retching.\u003c/p\u003e\n\u003cp\u003e“Everything okay in there?” I yell out.\u003c/p\u003e\n\u003cp\u003e“Fine! Bean doesn’t like mama dancing around too much.” Poor Tina.\u003c/p\u003e\n\u003cp\u003eI chuckle. “Either that, or it’s an attention seeker.”\u003c/p\u003e\n\u003cp\u003eTina chuckles and retorts, “Just like Aunt Nat!”\u003c/p\u003e\n\u003cp\u003eI pull out the fakest laugh I can, which sounds a bit like an old man’s guffaw. Tina bursts out laughing in the stall, but she quickly starts retching again. The poor thing gets morning sickness all day long. I remember her being just the same when she was pregnant with Mia, Tina’s daughter who died a few years back.\u003c/p\u003e\n\u003cp\u003e“Do you want me to get you some lemonade?” I ask.\u003c/p\u003e\n\u003cp\u003eShe groans and replies hoarsely, “Yes, please, honey.”\u003c/p\u003e\n\u003cp\u003eBefore I leave, I check my reflection in the mirror. I love my hair. It’s long and slightly wavy. It used to be a deep magenta/violet, but I recently dyed it a vivid red. With my red pouting lips, green eyes and curvy body, I could easily be mistaken for Jessica Rabbit. And I love playing the role of seductress.\u003c/p\u003e\n\u003cp\u003eI exit the restroom and head back to the bar to my unhappy sisters. Once there, they both glare at me. “What the feck was that about, slut?” My older sister, Nina, spits.\u003c/p\u003e\n\u003cp\u003e“Yeah, he went all goo-goo over you, and now he won’t come back here, tramp!” My younger sister, Helena, sneers.\u003c/p\u003e\n\u003cp\u003eAhh, feel the love.\u003c/p\u003e\n\u003cp\u003eWhen a person looks at us together, they can tell we’re sisters. We’re only a year apart from each other. The only difference between us is Nina’s hair is dyed blonde and Helena’s hair is dyed black.\u003c/p\u003e\n\u003cp\u003eNina is a hairdresser and has her own salon in Cali. I hate having to pay to get my hair done in New York when my sister is a hairdresser. Helena is still studying. She wants to be a physical therapist.\u003c/p\u003e\n\u003cp\u003e“Back off, whores. It was totally obvious what you were doing. Stop embarrassing yourselves.” I say out the side of my mouth.\u003c/p\u003e\n\u003cp\u003eAnyone looking at us would see three sisters smiling and having a nice chat. No one would guess what we were really saying to each other. Every cuss word and insult is uttered with the utmost affection though, I promise.\u003c/p\u003e\n\u003cp\u003eNina smiles and wraps an arm around my shoulders. “He was totally into me. Back off, hag.”\u003c/p\u003e\n\u003cp\u003eHelena fake laughs and lightly pushes Nina. “Oh please, he didn’t want you, Nina. No one wants a girl with a moustache.”\u003c/p\u003e\n\u003cp\u003eWe all burst out laughing and wrap our arms around the others’ waists. We really do love each other. We just have a weird way of expressing it.\u003c/p\u003e\n\u003cp\u003eI joke, “Maybe we should do the sister act. You know, if you want one of us, you have to take all of us.”\u003c/p\u003e\n\u003cp\u003eNina replies, “Oh, yeah, because one hoe isn’t enough. He needs three.”\u003c/p\u003e\n\u003cp\u003eHelena teases, “Sure. We could invite mom and dad to watch.”\u003c/p\u003e\n\u003cp\u003eAll of us stop and blink at each other. At the same time, we scrunch our faces and mutter, “Ewww.”\u003c/p\u003e\n\u003cp\u003eStefan comes past our side of the bar, and I yell out, “Sheriff, I need some lemonade. Stat. The bride is retching again.” He stops suddenly, turns, and the lemonade appears in front of me like magic.\u003c/p\u003e\n\u003cp\u003eI take the bottle, kiss my sisters’ cheeks and head back to the restrooms. I pass the lemonade under the stall, and Tina cheers, “Hooray! No more vomit breath.”\u003c/p\u003e\n\u003cp\u003eI chuckle and ask, “Do you want me to stay with you, sweetie?”\u003c/p\u003e\n\u003cp\u003eShe answers immediately and firmly, “No! There’s nothing worse than listening to someone vomit. Actually, there is. Smelling someone else’s vomit!”\u003c/p\u003e\n\u003cp\u003eI give in. “Okay, well, I’ve got my cell on me if you need me.”\u003c/p\u003e\n\u003cp\u003eAs I walk out the restroom door, someone crashes into me from behind. Hard. I teeter and almost fall, but strong arms wrap around my middle and hold me firmly.\u003c/p\u003e\n\u003cp\u003eMy head sways and I suddenly feel lightheaded. I close my eyes and breathe deep.\u003c/p\u003e\n\u003cp\u003eOh, damn.\u003c/p\u003e\n\u003cp\u003eI know that scent. I fantasize about that fragrance. My eyes flutter open, and I look up to focus on the rat bastard.\u003c/p\u003e\n\u003cp\u003eGhost looks down at me with what appears to be concern in his eyes. “Okay, pretty girl?”\u003c/p\u003e\n\u003cp\u003eI hate that I love how he calls me that.\u003c/p\u003e\n\u003cp\u003eStill in a daze, I stupidly croak, “You smell good.”\u003c/p\u003e\n\u003cp\u003eA round of applause, please. Bravo.\u003c/p\u003e\n\u003cp\u003eMy back is pressed up against his stomach and chest. He isn’t built like Nik. Ghost is more slender than Nik, and almost as tall and strapping. He has the lean, muscular physique of a swimmer, although his arms are built bigger than a swimmer’s. The feel of the ridges of his abs in my back makes my vajayjay dance. His messy blonde hair sits atop his head looking perfectly styled, even though he runs his hand through his hair every five minutes, and he looks outrageously handsome in a tux and bowtie. His warm brown eyes are dancing.\u003c/p\u003e\n\u003cp\u003eHe replies in a husky, soft voice, “Oh, yeah?” He leans down and buries his nose in my hair. He breathes me in. “Well, I gotta say, you smell good, too, pretty girl.”\u003c/p\u003e\n\u003cp\u003eI quickly straighten and spit, “God, why are you such an asshole?!” Before he can respond, I’m gone.\u003c/p\u003e\n\u003cp\u003eThat was a little uncalled for.\u003c/p\u003e\n\u003cp\u003eShut up, brain.\u003c/p\u003e\n\u003cp\u003eThe evening begins to slow. People are leaving the wedding reception. It’s almost two a.m.\u003c/p\u003e\n\u003cp\u003eI’m seated at the bar, talking and flirting with Sheriff who has opened up to me quite a bit. \u003c/p\u003e","sourceLink":"https://allnovel.net/love-thy-neighbour-friend-zoned-2/page-1.html","bookId":2799,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
