{"id":90391,"no":2,"title":"Page 2","content":"\u003cp\u003eHe’s easy to talk to, funny and attractive. I take a moment to ponder why I never noticed this before.\u003c/p\u003e\n\u003cp\u003eThen I take a closer look at him. He’s blonde, brown eyed, tall and muscular.\u003c/p\u003e\n\u003cp\u003eGhost.\u003c/p\u003e\n\u003cp\u003eHe looks like Ghost. That’s why.\u003c/p\u003e\n\u003cp\u003eI don’t want an imitation Ghost. I’ve had the real thing, and I know how good it is. There’s no faking that.\u003c/p\u003e\n\u003cp\u003eStefan reaches over and takes my hand. He says, “Sorry, Nat. I got to clean up. It was great talking to you. Hope I get the chance again this Saturday.” He kisses my hand, and I smile softly at him.\u003c/p\u003e\n\u003cp\u003e“Me too. Don’t be a stranger, Sheriff.” I reply.\u003c/p\u003e\n\u003cp\u003eI’m about to stand when an arm goes around my waist. I look up and see Ghost frowning down at me. His bowtie is undone and it hangs around his collar.\u003c/p\u003e\n\u003cp\u003eSo hot.\u003c/p\u003e\n\u003cp\u003eHe orders, “Dance. Now.”\u003c/p\u003e\n\u003cp\u003eThen he tightens his hold around my waist and drags me to the dance floor. We’re the only ones on it. He takes my hands, winds them around the back of his neck and steps closer to me. He holds me tight with one hand on the middle of my back, while the other is half on my lower back, half on my ass. He has me wrapped up.\u003c/p\u003e\n\u003cp\u003eI’m unsure what’s going on right now, so I react the only way I’m programmed to.\u003c/p\u003e\n\u003cp\u003eIn anger.\u003c/p\u003e\n\u003cp\u003eI blink then hiss, “What is wrong with you?”\u003c/p\u003e\n\u003cp\u003eHe blinks. His brow furrows and his eyes flash, then he hisses right back, “With me? What the fuck is wrong with you?”\u003c/p\u003e\n\u003cp\u003eOuch.\u003c/p\u003e\n\u003cp\u003eI don’t like Ghost being angry with me. What did I do now?\u003c/p\u003e\n\u003cp\u003e“Nothing’s wrong with me. I’m having a ball.” I roll my eyes and sigh. “Are we going to do this every single time?”\u003c/p\u003e\n\u003cp\u003eGhost stops swaying us and says sharply, “I don’t make it this way, Nat. You do. Ever since we… You’ve been ten times the bitch you normally are. What you don’t get is,” he leans down and whispers, “that does something to me. It makes me wanna soothe the tiger in you. Bend you over another table and pound you into submission. Because that works with you.” His lips brush my ear. “From a tiger into a mewing kitten. And I like that side of you. I like all sides of you, pretty girl. You think you’re putting me off with this supreme bitch act? Nope, all you’re doing is making me hard.”\u003c/p\u003e\n\u003cp\u003eI lean back, look into his eyes and croak, “I think we should avoid each other.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head slowly and smirks. “I think we should fuck again. Tonight.”\u003c/p\u003e\n\u003cp\u003eMy stomach dips and my core moistens just thinking about the possibility of having Ghost again.\u003c/p\u003e\n\u003cp\u003eGet the hell out of his clutches, stupid!\u003c/p\u003e\n\u003cp\u003eI lower my head and shake it. I whisper, “No. It was a mistake. Never to be repeated. I got to go. Please leave me alone, Ghost.”\u003c/p\u003e\n\u003cp\u003eGhost stiffens and replies quietly, “If that’s what you want, pretty girl.”\u003c/p\u003e\n\u003cp\u003eI look up into his eyes and still. He doesn’t look angry. He looks hurt and resigned.\u003c/p\u003e\n\u003cp\u003eI don’t understand it.\u003c/p\u003e\n\u003cp\u003eMy heart squeezes and I beg, “Please, Ghost. We’re not good for each other. We need to start avoiding each other.”\u003c/p\u003e\n\u003cp\u003eHis brow furrows as he nods. His arms loosen and he walks away from me.\u003c/p\u003e\n\u003cp\u003eGhost walking away from me leaves me feeling alone and bitter.\u003c/p\u003e\n\u003cp\u003eWhy did I do that?\u003c/p\u003e\n\u003cp\u003eBecause you’d fall for the broken man which would leave you lonely, regardless.\u003c/p\u003e\n\u003cp\u003eOh, yeah.\u003c/p\u003e\n\u003cp\u003eThanks, brain.\u003c/p\u003e\n\u003cp\u003eChapter One\u003c/p\u003e\n\u003cp\u003eMy neighbors suck\u003c/p\u003e\n\u003cp\u003eSeven months later…\u003c/p\u003e\n\u003cp\u003eTatiana pulls my hair hard.\u003c/p\u003e\n\u003cp\u003eYowza!\u003c/p\u003e\n\u003cp\u003eI squint in pain, remove her grabby hands, and softly reprimand her, “Hey peaches, that’s Teta Nat’s. You’re just going to have to grow some of your own if you want some hair.” Teta means Aunt in Croatian. Tina insists we use Teta instead of Aunt.\u003c/p\u003e\n\u003cp\u003eShe smiles a gummy smile and jumps around in my arms. I can’t help but smile right back at her.\u003c/p\u003e\n\u003cp\u003eShe is too damn cute.\u003c/p\u003e\n\u003cp\u003eTatiana is three months old. All eight of us were present at her birth. You really can’t separate us…if one of us gets called, we start a phone tree to alert the others.\u003c/p\u003e\n\u003cp\u003eTatiana looks just like Tina when she was a baby; chubby and cute as hell with dark hair. The only difference is my sweet little girlie has Nik’s amber eyes rather than Tina’s green ones. Tina was overjoyed at this. She loves Nik’s eye color.\u003c/p\u003e\n\u003cp\u003eI walk over to the storeroom and knock before I enter. Tina sits behind the desk going through paperwork. She smiles as we enter. She coos to her daughter. “Hi, my beautiful girl. Are you giving Teta Nat a hard time? You eating her hair again? My cheeky little thing.” She takes Tatiana out of my hands and pops her onto her hip. Tina’s smiling face falls when she looks over to me. She asks, “Everything okay?”\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eMy heart aches whenever I’m around Tatiana. I’ll never have children. Watching Tina with Tats brings me as much sorrow as it does happiness.\u003c/p\u003e\n\u003cp\u003eA random doctor’s appointment last year led me to being diagnosed with PCOS. I have cysts on my ovaries and uterus. I have around eighty cysts on each ovary.\u003c/p\u003e\n\u003cp\u003eThat’s a lot.\u003c/p\u003e\n\u003cp\u003eThe doctor advised me to be prepared for the fact that I’ll never have children. My ovaries and uterus are too scarred and damaged for me to conceive.\u003c/p\u003e\n\u003cp\u003eI force a large smile and reply, “Of course. Just a little edgy with the move, that’s all.”\u003c/p\u003e\n\u003cp\u003eTina smiles. “Don’t you even worry about the move. I asked the girls to help out. The guys offered to help, but I told them this was girl-bonding time.”\u003c/p\u003e\n\u003cp\u003eSmiling back at her, I sigh. “What would I do without you?”\u003c/p\u003e\n\u003cp\u003eShe scrunches her nose and tilts her head up. “You’d have to buy cupcakes.” She blinks and goes on “That’s about it.” We both laugh.\u003c/p\u003e\n\u003cp\u003eTina’s cupcakes are the bomb. Actually, anything Tina bakes is out of this world.\u003c/p\u003e\n\u003cp\u003eTina owns Safira Boutique. Safira’s is a clothing store, but we also sell accessories and lingerie. Mimi, Lola and I work with Tina. Right across the street is The White Rabbit, which is where all the guys work. We’re pretty close knit which makes avoiding Ghost not so easy.\u003c/p\u003e\n\u003cp\u003eFor seven months, I’ve managed to stay away from him. We haven’t so much as said hello to each other in this time. What’s crazy is I miss his stupid little aggravating comments and how he called me pretty girl. What’s not crazy is that, of course, I want the bad boy.\u003c/p\u003e\n\u003cp\u003eBut isn’t that always the way it goes?\u003c/p\u003e\n\u003cp\u003eEvery girl wants a bad boy who is only good to her.\u003c/p\u003e\n\u003cp\u003eWe all want to tame a wild beast. And Ghost is as wild as a man comes. He’s unpredictable, broody and emotionless. He may as well be a wild animal. I’ve never even heard him laugh before.\u003c/p\u003e\n\u003cp\u003eThe Ghost of my fantasies is loving, dominant and funny. That Ghost doesn’t exist. He’s in my head.\u003c/p\u003e\n\u003cp\u003eMy memories of the night Ghost and I had crazy monkey sex are as clear as daylight.\u003c/p\u003e\n\u003cp\u003eThey haunt me.\u003c/p\u003e\n\u003cp\u003eEvery. Freaking. Night.\u003c/p\u003e\n\u003cp\u003eMy belly tightens and I flush whenever I think about it.\u003c/p\u003e\n\u003cp\u003eTina pulls me back to reality with an amused, “Hellllloooooo? Anyone in there?” She flaps her hand in front of my face.\u003c/p\u003e\n\u003cp\u003eMy face forms a scowl and I poke her lightly in the ribs. She giggles and I smile. My friend is a goofball, but she’s so adorable that it just makes her even cuter. We make each other laugh all the time. It’s the real basis of our friendship.\u003c/p\u003e\n\u003cp\u003eI sigh and say, “Please tell me you baked.”\u003c/p\u003e\n\u003cp\u003eHer face falls immediately and I know she didn’t. Tina wears her heart on her sleeve. I love that.\u003c/p\u003e\n\u003cp\u003e“Oh, honey, I promise I will soon. It’s just with Tatiana and the housework, and Ceecee, I’ve been all over the place!” She sounds panicked.\u003c/p\u003e\n\u003cp\u003eI quietly laugh and reassure her, “Sweetie, I was only kidding! It’s not a cupcake emergency day.”\u003c/p\u003e\n\u003cp\u003eShe looks only slightly reassured and promises, “Tomorrow. Cupcakes.”\u003c/p\u003e\n\u003cp\u003eToot toot! Yum!\u003c/p\u003e\n\u003cp\u003eI glance at the wall clock. 3:24pm. A few hours and I’ll be moved into my new place.\u003c/p\u003e\n\u003cp\u003eWicked.\u003c/p\u003e\n\u003cp\u003eThe moving truck has arrived, and we’re all working on getting the boxes inside my fabulous new apartment. The price was a little over my budget, but the security in this place is amazing! There’s a code to get through the front door and a different code to use the elevator. Each apartment has a security system, and the premises are monitored. I was happy to spend an extra fifty a month on rent to be secure in my little home.\u003c/p\u003e\n\u003cp\u003eThe moving guys help put my furniture in as promised. Once all the heavy items are inside, the girls and I take over. Lola, Mimi and Tina are opening boxes and moving them in and out of rooms.\u003c/p\u003e\n\u003cp\u003eThis is why you need girls to unpack a girl’s apartment. They all know where things should go!\u003c/p\u003e\n\u003cp\u003eWith the four of us going at it, it only takes two hours, and I’m ecstatic when we finish.\u003c/p\u003e\n\u003cp\u003eLola disappears for a minute then returns with some champagne. Not the cheap stuff but Dom Perignon.\u003c/p\u003e\n\u003cp\u003eSix hundred dollar champagne! I’m giddy!\u003c/p\u003e\n\u003cp\u003eThis has to be thanks to Nik. God, I love that man.\u003c/p\u003e\n\u003cp\u003eI look over to Tina and grin. “I love your husband.” Tina smiles and shrugs.\u003c/p\u003e\n\u003cp\u003eMimi pops open the bottle and we all whoop and cheer. She pours glasses for us, and we all drink with enthusiasm, apart from Tina who takes only a tiny sip because she’s breastfeeding Tats.\u003c/p\u003e\n\u003cp\u003eAfter we drink, they all hug and kiss me. I thank them for their help and wave them off. I shut the door and lean my head against it.\u003c/p\u003e\n\u003cp\u003eAlone at last.\u003c/p\u003e\n\u003cp\u003eI love my friends, but I seriously love my alone time too.\u003c/p\u003e\n\u003cp\u003eI turn my back to the door, scan my newly outfitted apartment and smile.\u003c/p\u003e\n\u003cp\u003eIt looks awesome!\u003c/p\u003e\n\u003cp\u003eI didn’t add a lot of new things to it, but what I had, mixed with the new things I bought, makes the apartment look classy and chic. Tina gave me her old sofa, which is so damn comfortable I can’t risk sitting on it before going out, or I know I’ll change my mind and end up falling asleep in front of the TV. She also gave me some bits and pieces from our old place because Nik already has things to match his home.\u003c/p\u003e\n\u003cp\u003eThe apartment isn’t large, but it’s open plan with only the bedroom and bathroom separate.\u003c/p\u003e\n\u003cp\u003eI love it.\u003c/p\u003e\n\u003cp\u003eThe kitchen was only remodeled a year ago. It has a wicked marble-look breakfast bar and new wooden cabinets for my dishes and pans. The sink is double width and the faucets are shiny. The lounging area is a little cramped for such a huge TV. I bought a brand spanking new 60-inch TV which the movers kindly helped me put up on the wall. I love watching TV. Nothing makes me happier than curling up on the couch and watching a movie.\u003c/p\u003e\n\u003cp\u003eOkay, so call me antisocial.\u003c/p\u003e\n\u003cp\u003eDon’t get me wrong, I love going out. On weekends. If I have to work the next day, (which I do almost every day) there is no way I’m dragging my butt out of bed early. Tina calls me a zombie. My friend is not wrong. Once I’m asleep, it’s lights out. I don’t hear or see anything after that. Only if a person shakes me awake will I stir. Slightly. If anyone is stupid enough to wake me, that is.\u003c/p\u003e\n\u003cp\u003eI sigh then push myself off the door. I walk down the hall to my new bathroom which is also newly remodeled and immaculate, and turn on the shower. I undress, step in and let the hot water wash away any negativity that sticks to me.\u003c/p\u003e\n\u003cp\u003eSerenity now.\u003c/p\u003e\n\u003cp\u003eI scrub til my skin is almost raw. I turn off the water, step out and wrap my hair in a turban. I moisturize my face, walk naked to my room, get some silk panties on followed by my jammies, and I’m ready to watch TV.\u003c/p\u003e\n\u003cp\u003eMy jammies are so damn comfortable. They’re pretty ratty, but comfort trumps everything when you’re not in a relationship. My black spaghetti strap tank comes just above my belly button, and my red Minnie Mouse pajama pants and my Minnie Mouse head slippers complete my ensemble.\u003c/p\u003e\n\u003cp\u003eBut my panties are always silk and sexy. I like to splurge on myself when it comes to lingerie. Even if no one sees it, it makes me feel sexy.\u003c/p\u003e\n\u003cp\u003eI brush my hair out, take the Strawberry Cheesecake ice-cream out of the freezer, grab a spoon and sink into the sofa with a plop. I turn on the TV and get excited when I find an old eighties teen movie.\u003c/p\u003e\n\u003cp\u003eScore!\u003c/p\u003e\n\u003cp\u003eI love old eighties teen movies! So much angst and bitterness. Just like me!\u003c/p\u003e\n\u003cp\u003eBeing a teenager was awesome. No problems, all you really had to worry about was who you were crushing on that week. And high school. And the latest fashions. And pimples. And hormones.\u003c/p\u003e\n\u003cp\u003eYou know what, I take it back.\u003c/p\u003e\n\u003cp\u003eBeing a teenager sucked ass.\u003c/p\u003e\n\u003cp\u003eI’m lost in the movie when I hear a loud thump followed by a female giggling. I blink then smirk.\u003c/p\u003e\n\u003cp\u003eMy neighbor is getting lucky tonight.\u003c/p\u003e\n\u003cp\u003eGood for them.\u003c/p\u003e\n\u003cp\u003eTen minutes passes and another loud thump hits the wall behind the TV. My TV jiggles and I’m suddenly worried that my two thousand dollar TV will fall off the wall and smash into pieces.\u003c/p\u003e\n\u003cp\u003eAnother thump, then another hits the wall followed by a long female moan.\u003c/p\u003e\n\u003cp\u003eOh, shit. Really?\u003c/p\u003e\n\u003cp\u003eAgainst my damn wall?\u003c/p\u003e\n\u003cp\u003eLet them go, they’re just having some fun.\u003c/p\u003e\n\u003cp\u003eAnd ruining my damn movie!\u003c/p\u003e\n\u003cp\u003eAnother five minutes of thumps hitting my wall and I’ve had it. I turn off the TV and head to bed. I crawl in and let out a happy sigh.\u003c/p\u003e\n\u003cp\u003eI love sleep so much!\u003c/p\u003e\n\u003cp\u003eI pull the covers up to my chin then breathe in deep. Upon the exhale, I hear a woman’s muffled yell, “OH, GOD! YES! YES! YESSSSSssssssss!” Then silence.\u003c/p\u003e\n\u003cp\u003eWell, that was fun.\u003c/p\u003e\n\u003cp\u003eAt least someone’s getting some.\u003c/p\u003e\n\u003cp\u003eTouché, brain.\u003c/p\u003e\n\u003cp\u003eI curl up deeper into my bed and fall asleep.\u003c/p\u003e\n\u003cp\u003e“Oh, God. Yes! Yes, baby! Yes!”\u003c/p\u003e\n\u003cp\u003eWhat the feck?\u003c/p\u003e\n\u003cp\u003eMy eyelids flutter open and immediately I know something is wrong.\u003c/p\u003e\n\u003cp\u003eIt’s still dark out. So, why am I awake?\u003c/p\u003e\n\u003cp\u003eI glance over at the digital alarm clock which reads 12:37am.\u003c/p\u003e\n\u003cp\u003e“Harder, baby! Yes! Ohhhhhhhh, God! Yes!” The freakin’ female wailer is back.\u003c/p\u003e\n\u003cp\u003eStupid neighbors.\u003c/p\u003e\n\u003cp\u003eI put the pillow over my head and groan.\u003c/p\u003e\n\u003cp\u003e“Oh, yes! Fuck me! Deeper!”\u003c/p\u003e\n\u003cp\u003eOh, just put a freakin’ bullet in my brain, would ya?\u003c/p\u003e\n\u003cp\u003e“Yes! Yes! YESSSSSSsssssss!” Then silence.\u003c/p\u003e\n\u003cp\u003eI listen for a moment but hear nothing, so I snuggle my pillow and fall back asleep.\u003c/p\u003e\n\u003cp\u003e“Oh, God! Baby, just like that! Yes! Oh my God! Yes!” \u003c/p\u003e","sourceLink":"https://allnovel.net/love-thy-neighbour-friend-zoned-2/page-2.html","bookId":2799,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
