{"id":90418,"no":29,"title":"Page 29","content":"\u003cp\u003eShe puffs out a frustrated breath. “I’m sick of them treating me like a child. I know I’ll always be the baby of the family, but there’s a point where it needs to stop. The over-protectiveness. The babying. It’s too much. I hate it.”\u003c/p\u003e\n\u003cp\u003eNodding in agreement, I say seriously, “Well, now they know. That’s for sure. I think you might need to say something to Asher though.” I chuckle at the memory of his expression. “He looked seriously freaked out.”\u003c/p\u003e\n\u003cp\u003eI imitate his wide-eyed, stunned expression and we burst into laughter again. She says softly, “You call him Asher.”\u003c/p\u003e\n\u003cp\u003eShit. I did, didn’t I?\u003c/p\u003e\n\u003cp\u003eWith a small smile, she goes on, “No one calls him Asher except Mom.” I open my mouth to try to explain myself but she cuts me off by saying quietly, “That’s really cool.” And somehow, I know she’ll keep my secret.\u003c/p\u003e\n\u003cp\u003eStanding, I pull her up with me and pull her to my side. I hold her hand and say, “I could use a drink. C’mon.”\u003c/p\u003e\n\u003cp\u003eWe walk out of the bathroom and over to the bar.\u003c/p\u003e\n\u003cp\u003eSomeone clears their throat and I look up.\u003c/p\u003e\n\u003cp\u003eNat stands smiling behind Isa, holding onto her hand in a show of support. Isa says to the entire booth, “I’m sorry for making a scene. I apologize for almost ruining your night.” She turns to me looking sheepish. “Sorry, Ghost. You were the closest guy to me who wasn’t a relative and I was making a point.”\u003c/p\u003e\n\u003cp\u003eGiving her a small smile and rubbing the back of my neck awkwardly, I say, “Well, I guess you sure showed them, huh?”\u003c/p\u003e\n\u003cp\u003eIsa smiles a megawatt smile at me and I see Nat lower her head as her body shakes with silent laughter. Nik clears his throat and says, “That’s okay, honey. I know I forget you’re a woman now and…” His face softens as he continues, “…I know you’re not a baby anymore.”\u003c/p\u003e\n\u003cp\u003eMax stands and wraps Isa in a big hug. They hold each other and talk quietly for a while and I know they’ve worked it out when I see them both smile.\u003c/p\u003e\n\u003cp\u003eWhen they take their seats, I reach for my cola. I take a sip just as Max says, “Hey Ghost, where’s Tasha these days?”\u003c/p\u003e\n\u003cp\u003eI open my mouth to speak and swallow at the same time. I choke on my drink, coughing and sputtering. Some cola goes up my nose and the rest ends up all over me. Nat bursts into laughter. She shakes her head, muttering, “Spaz.”\u003c/p\u003e\n\u003cp\u003eGetting my shit together, I clear my throat and tell Max, “I don’t see her anymore.” I don’t know where it comes from, but I can’t seem to stop myself from saying aloud, “Actually, I’m sorta seeing someone.”\u003c/p\u003e\n\u003cp\u003eAnd as soon as I say it, I wish I had one of those magic poof balls that the villains use in the old time movies. You know? The ones that go poof making a huge cloud of smoke giving the villain time to disappear.\u003c/p\u003e\n\u003cp\u003eYeah. Those.\u003c/p\u003e\n\u003cp\u003eNat stiffens by my side and I see Isa smile big. Suddenly I’m bombarded with questions. Max leans forward and asks incredulously, “Seeing someone? As in dating?”\u003c/p\u003e\n\u003cp\u003eI nod and Trick says wide-eyed, “Wow. Who is she?”\u003c/p\u003e\n\u003cp\u003eI open my mouth to answer but Nik cuts me off by asking, “How long you been seeing this broad?”\u003c/p\u003e\n\u003cp\u003eScowling at Nik, I suddenly want to smack him for calling Nat a ‘broad’. Only I get to call her a broad because she’s mine. She’s a…I would say lady, but…yeah, no. Let’s call her a spitfire.\u003c/p\u003e\n\u003cp\u003eTina looks dreamy-happy when she states, “Oh Ghost, honey, we need to meet her!”\u003c/p\u003e\n\u003cp\u003eMimi side-eyes Nat and repeats, “Yeah. We’d love to meet her.”\u003c/p\u003e\n\u003cp\u003eLola looks from me to Nat looking sad. She says sulkily, “Well that sucks.” Trick nudges her and she amends her previous statement to, “I mean that’s great.” Forcing the fakest smile I’ve ever seen her wear.\u003c/p\u003e\n\u003cp\u003eMaria and Leti look like they’re about to burst from happiness. And I suddenly feel courageous. I tell them, “Yeah, she’s- uh- she’s something else.” Reaching under the booth, I squeeze Nat’s knee and go on, “She’s fuckin’ funny and cute as hell. She yells at me all the time. Doesn’t take my shit.” I feel Nat’s hand cover mine. Her thumb caresses the back of my hand and I continue, “She listens to me even when I’m being an ass. There’s something different about this one. I want her. To keep. She says she loves me.”\u003c/p\u003e\n\u003cp\u003eAll the girls gasp and make gooey faces while clutching their hands to their chests. All except Nat and Mimi, that is. Mimi smiles gently and Nat remains stone-faced.\u003c/p\u003e\n\u003cp\u003eTina leans forward and asks quietly, “Do you? You know? Love her?”\u003c/p\u003e\n\u003cp\u003eSqueezing Nat’s knee again, I reply, “She’s teachin’ me how.”\u003c/p\u003e\n\u003cp\u003eIf Tina could melt into a puddle, she would’ve just now. Shit, she actually looks like she could cry.\u003c/p\u003e\n\u003cp\u003eMax looks shocked. So does Trick. And Nik.\u003c/p\u003e\n\u003cp\u003eOkay, they all do, and normally I’d give a fuck or two, but not a single fuck was given this day. If she’d let me, I’d tell them all right now that she’s mine.\u003c/p\u003e\n\u003cp\u003eAnd I’m keeping her.\u003c/p\u003e\n\u003cp\u003eOh. My. Fucking. God.\u003c/p\u003e\n\u003cp\u003eDid that just happen? Did Ash just tell everyone that he was dating me and that I was teaching him how to love?\u003c/p\u003e\n\u003cp\u003eSwoon, baby.\u003c/p\u003e\n\u003cp\u003eThat right there was swoon-tastic. He is so getting laid tonight. I might even beg to suck his cock. I know how much he likes that.\u003c/p\u003e\n\u003cp\u003eIf I’m being honest, I like it as much as he does.\u003c/p\u003e\n\u003cp\u003eI take a sip of my drink just as Ash slides his hand from my knee up my thigh. I try to swallow but it goes down the wrong way, so I sputter and cough my ass off. I cough long and hard for a good minute when Ash throws my previous insult back at me. He chuckles and mutters, “Spaz.”\u003c/p\u003e\n\u003cp\u003eStill holding my thigh under the table, he slides it a little higher, looks down to me with a scowl and says, “Did you lock my car?”\u003c/p\u003e\n\u003cp\u003eSuddenly horny and confused, I tell him, “What the fuck are you talking about, asshat?”\u003c/p\u003e\n\u003cp\u003eHe sighs loudly and the whole booth looks up at us.\u003c/p\u003e\n\u003cp\u003eWhy is he making a scene?\u003c/p\u003e\n\u003cp\u003eHe says, “There’s a way to lock it. My baby gets stolen, it’s on you.”\u003c/p\u003e\n\u003cp\u003eOh! I get ya, baby. Wink, wink.\u003c/p\u003e\n\u003cp\u003eI glare at him and say, “Well, if you’d shown me in the first place, you wouldn’t be questioning me right now.”\u003c/p\u003e\n\u003cp\u003eAsh shakes his head, exhaling loudly and muttering, “Ain’t gonna be a next time.” Then nods his head. “Come on.”\u003c/p\u003e\n\u003cp\u003eIsa moves out of the booth trying hard to hide her smile. Ash stands and I follow him out. I meet Tina’s eyes, and mouth, “Asshole!”\u003c/p\u003e\n\u003cp\u003eShe throws me a sympathetic look and waves to me. Running to catch up with him, I tell him, “You could’ve warned me, Ash.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head and says, “Need to be inside you, pretty girl. Now.”\u003c/p\u003e\n\u003cp\u003eTaking hold of my forearm, he almost drags me out of the club and over to his shiny black Impala. A word to describe this car. Hot. Sex incarnate would be another.\u003c/p\u003e\n\u003cp\u003eThe doors unlock and he walks around the car. He sits in the passenger front side, pushing the bench seat back as far as it’ll go. He pats his lap, looking up at me through hooded eyes.\u003c/p\u003e\n\u003cp\u003eOh, I like this.\u003c/p\u003e\n\u003cp\u003eThe parking lot is dimly lit but if anyone walked past his car, they’d see us pretty damn clearly. And that makes this all the hotter. He unbuckles his shiny silver belt, undoes the top button to his jeans, lowers his zipper, then reaches into them and pulls himself free.\u003c/p\u003e\n\u003cp\u003eDamnnnn!\u003c/p\u003e\n\u003cp\u003eEvery time I see it, my heart skips a beat.\u003c/p\u003e\n\u003cp\u003eIt’s a nice dick. Thick, long and strong. And it’s all mine.\u003c/p\u003e\n\u003cp\u003eCareful of my head, I climb over to straddle him. Once my knees are settled nicely, he slides his hands down my back, under my dress to cup my ass. He stills before he looks up at me, his expression stunned. He says hoarsely, “Pretty girl, please tell me you haven’t been sitting at the booth all night without panties on.”\u003c/p\u003e\n\u003cp\u003eI smile the most angelic smile I can muster and his head falls back with a groan. My dress is moved up, bunched around my hips. He lifts me a little, positions himself at my entry and before I can say a word, he drives home. I reach up to clutch his shoulders, close my eyes and moan loudly. He doesn’t move a muscle. I lower my face to his neck and feel his pulse thumping through my lips with every sensual kiss I place there. Running my tongue up the side of his neck, I stop to kiss his jaw. I breathe him in, a strong and completely male scent. Woodsy and musky and totally panty-wetting. Knowing it’ll drive him crazy, I nip his earlobe and whisper, “I love you, Ash.”\u003c/p\u003e\n\u003cp\u003eHis arms tangle me up, he groans long and thrusts up into me, so deep that my eyes flutter back as my core clenches around him. My pussy weeps happy tears. He reaches up and holds my chin down to him. His kisses are wet and sexy. His tongue plunders into my mouth using the same rhythm as his thrusts. My breathing turns erratic, my core clenches tight and I moan into his mouth.\u003c/p\u003e\n\u003cp\u003eHe reaches down between us and presses his thumb to my clit, rolling it in soft lazy circles. My face heats, my heart races and I gasp suddenly when my core contracts uncontrollably in release. Ash growls into my mouth. He says, “My dirty girl. I fucking love you like this. All mine, baby.”\u003c/p\u003e\n\u003cp\u003eI whimper as he captures my mouth in a possessive kiss that rocks my very soul. He mutters into my mouth, “Here it comes, pretty girl. All yours.”\u003c/p\u003e\n\u003cp\u003eHis thrusts become erratic, his arms tighten around my back and he holds me tight as he finds his release. I feel him jerk inside of me and it heightens my already blissful high.\u003c/p\u003e\n\u003cp\u003eHis body relaxes against mine, his breathing steadies and his shoulders slump. He pulls back to search my face and says, “This is mine,” then he reaches down to cup my still impaled pussy, and it’s so hot that I gasp a little before nodding vigorously.\u003c/p\u003e\n\u003cp\u003eSomehow, he doesn’t look convinced but he nods lightly before he demands, “Lips, baby.”\u003c/p\u003e\n\u003cp\u003eLeaning my face closer to his, I suddenly move back and ask, “Why’d you do that? You know, in there?”\u003c/p\u003e\n\u003cp\u003eConfusion settles over his face. He sighs quietly, “I really don’t know. It felt like a compulsion. Like I couldn’t stop it.”\u003c/p\u003e\n\u003cp\u003eNodding in stunned disbelief, I whisper, “That’s an acceptable answer.”\u003c/p\u003e\n\u003cp\u003eHe blinks once before his wide new Asher happy smile appears. I grip the front of his shirt and rub my cheek against his. I move slightly so our noses touch and run my nose up his, softly and sweetly. I ask him quietly, “So, I’m still your obsession?”\u003c/p\u003e\n\u003cp\u003eHis hands rub my back in long, soothing strokes. Pecking a small kiss on my lips, he answers, “The one and only. Never stopped, pretty girl.”\u003c/p\u003e\n\u003cp\u003eSwallowing hard, I suddenly start to sweat when I ask in a barely-there whisper, “You’re trying hard, right?”\u003c/p\u003e\n\u003cp\u003eHe presses into me in a deliberately slow, open-mouthed kiss that would set anyone’s tongues wagging. He replies, “Yeah. I am. Which makes me think you’re worth it.”\u003c/p\u003e\n\u003cp\u003eI smile into his mouth and utter, “I am.”\u003c/p\u003e\n\u003cp\u003eWe both chuckle at my cockiness. A second passes before I say, “Ash?”\u003c/p\u003e\n\u003cp\u003e“Yeah, girl?”\u003c/p\u003e\n\u003cp\u003eI whisper, “My ass is asleep.”\u003c/p\u003e\n\u003cp\u003eHis body shakes against mine and I lean back to watch him laugh.\u003c/p\u003e\n\u003cp\u003eNothing could be better than this.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Four\u003c/p\u003e\n\u003cp\u003eThe Ghost returns\u003c/p\u003e\n\u003cp\u003eTaking a break from my work, I head on over to the chillout room, walk to the sofa and land with a plop.\u003c/p\u003e\n\u003cp\u003eWatching Nat all day long is giving me some serious issues. Everyone’s gonna know about us if I walk around all day with a hard-on. And not just a stiffy but a full-on raging hard-on. It’s like my dick knows she’s on the screen and wants to get closer to her.\u003c/p\u003e\n\u003cp\u003eI spent most of last night thinking about what’s happening here. I came to a conclusion.\u003c/p\u003e\n\u003cp\u003eNat is a witch and she’s cast a spell on me.\u003c/p\u003e\n\u003cp\u003eYep. That’s the only explanation I could come up with. Why else can’t I stop thinkin’ about her?\u003c/p\u003e\n\u003cp\u003eI think about her all the time. When I’m at work. When I’m at home. When I’m at the gym. When I’m in bed with her, fuckin’ holding her. She’s in my brain, hijacking my thoughts all the time. And it annoys me, but when I see her, I don’t give a fuck about anything other than touching her or holding her or even just talking to her.\u003c/p\u003e\n\u003cp\u003eA scowl forms on my face and my lip curls.\u003c/p\u003e\n\u003cp\u003eI don’t do warm fuzzies.\u003c/p\u003e\n\u003cp\u003eSee?\u003c/p\u003e\n\u003cp\u003eWitch.\u003c/p\u003e\n\u003cp\u003eClosing my eyes, I lean my head back on the sofa and sigh. Last night she asked me if I was trying and I am. I really am. But I don’t know where to go from here. I need advice.\u003c/p\u003e\n\u003cp\u003eThe seat depresses and I feel something cold press into my hand. Opening my eyes I see Nik on the seat next to me, watching me through narrowed eyes. “Who shit in your cereal?”\u003c/p\u003e\n\u003cp\u003eI open the soda he’s placed in my hand and sip without answering.\u003c/p\u003e\n\u003cp\u003eHe nods long and slow before muttering, “Ahh. Woman problems.”\u003c/p\u003e\n\u003cp\u003eScowling at him, I lie, “You’re way off, bro.”\u003c/p\u003e\n\u003cp\u003eHe leans back from me, eyebrows raised. “Oh yeah? I’m wrong? You’re forgetting who’s got a pregnant wife at home.” He nods. “That look? I know that look. Fuck. I invented that look. You owe me royalties for using it.”\u003c/p\u003e\n\u003cp\u003eI can’t help but chuckle. Nik knows how to make a funny.\u003c/p\u003e\n\u003cp\u003eGiving in, I ask, “When you first realized you were in love with Tina…what did that feel like?”\u003c/p\u003e\n\u003cp\u003eHe leans back with his arms resting behind his head. He sighs through his smile and says, “Still feelin’ it, man. Still affects me.” Turning to face me, he goes on, “Feels like no one else matters, just her. Like she’s the center of my world. Every time I see her, I just want to touch her. I want everyone to know she’s mine. She makes me happy. I know I’ll never love anyone as much as I love her. Well, maybe Tatiana and the new baby, but Tina, she’s always gonna be my girl. A fuckin’ hurricane.”\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eThat’s how I feel about Nat.\u003c/p\u003e\n\u003cp\u003eI frown at my thoughts. Nik continues, “Now I’m not saying you’re seeing her or whatever, but if Nat was my girl…” I turn to glare at him and he bursts into laughter. Through his laughter, he says, “…If she were my girl, I know she’d want it all.” \u003c/p\u003e","sourceLink":"https://allnovel.net/love-thy-neighbour-friend-zoned-2/page-29.html","bookId":2799,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
