{"id":90394,"no":5,"title":"Page 5","content":"\u003cp\u003eMy eyes fill with tears.\u003c/p\u003e\n\u003cp\u003eI’m terrified.\u003c/p\u003e\n\u003cp\u003eAn arm wraps around my waist and I yelp. Just as I’m about to scratch the robber’s eyes out, lips come to my ear and he whispers, “Calm down, pretty girl. It’s just me.”\u003c/p\u003e\n\u003cp\u003eMy body becomes limp with relief and I choke on a sob. I dip my chin and burst into tears.\u003c/p\u003e\n\u003cp\u003eHe turns me, and I lean my forehead onto his chest as he holds me tight. He rocks my body from side to side and coos, “It’s okay, babe. It’s just me.”\u003c/p\u003e\n\u003cp\u003eWhen I finally manage to calm down, I lean back and look into Ghost’s face. He looks concerned as he wipes away my tears. I sniffle and he puts on a small smile. Just as he opens his mouth to speak, I punch him.\u003c/p\u003e\n\u003cp\u003eRight on the nose.\u003c/p\u003e\n\u003cp\u003eHe stumbles back holding his nose and moaning. I screech, “Don’t you ever, ever do that again!”\u003c/p\u003e\n\u003cp\u003eThen I turn on my heel and storm back into my apartment. I lock the door behind me, run to my room and face plant into my bed. Within seconds, I hear the front door open. I sigh. A few seconds later, I feel the bed sink next to me.\u003c/p\u003e\n\u003cp\u003e“Who taught you to punch like that?”\u003c/p\u003e\n\u003cp\u003eI reply a muffled, “My dad.” After a few moments of silence, I lift my face and tell him, “I have two sisters. Dad wanted us be to be able to defend ourselves. All it really did was make us short-fused and dangerous. There were more cat fights in our house than you could count. Nina once stabbed me with a fork because I ruined her sweater. Helena ripped a chunk of hair out of my head when I was in high school, and I had to wear a hat for a year.”\u003c/p\u003e\n\u003cp\u003eGhost’s eyes widen. “That’s fucked up.”\u003c/p\u003e\n\u003cp\u003eI sigh and smile wistfully. “Yeah. It is.”\u003c/p\u003e\n\u003cp\u003e“So you don’t get on with your family?”\u003c/p\u003e\n\u003cp\u003eI scrunch my face and state, “My family is awesome. We’re just a bit hot-headed is all.”\u003c/p\u003e\n\u003cp\u003eAfter a moment’s silence, I ask, “Do you have any brothers or sisters?”\u003c/p\u003e\n\u003cp\u003eGhost replies without emotion, “Nik, Max and Trick are my brothers.”\u003c/p\u003e\n\u003cp\u003eThat’s really sweet, but I’ll never admit it to him. I find myself curious to know about his family. More importantly, to find out about what makes Ghost the way he is.\u003c/p\u003e\n\u003cp\u003eI roll my eyes and ask, “For real brothers and sisters?”\u003c/p\u003e\n\u003cp\u003eHe sighs. “No. Don’t have a family either, so can you drop it?”\u003c/p\u003e\n\u003cp\u003eMy eyes narrow. “What the feck were you doing in my kitchen this morning? You scared the shit out of me.”\u003c/p\u003e\n\u003cp\u003eGhost rubs his nose. “Yeah, sorry about that. I ran out of milk so I came to borrow some. Isn’t that what friends do?”\u003c/p\u003e\n\u003cp\u003eOnly now do I notice we’re both in pajamas. Ghost wears a tight white tee and blue pajama pants. I wear my Minnie Mouse pants and tank combo.\u003c/p\u003e\n\u003cp\u003eI chuckle softly and clarify, “You broke into my apartment to steal my milk?”\u003c/p\u003e\n\u003cp\u003eGhost smiles, runs a hand through his longish sandy hair and bites his tongue.\u003c/p\u003e\n\u003cp\u003eOh, geez. He looks like a little boy when he does that.\u003c/p\u003e\n\u003cp\u003eAdorable.\u003c/p\u003e\n\u003cp\u003eHe says apologetically, “Sorry. I didn’t mean to scare you.”\u003c/p\u003e\n\u003cp\u003eMy stomach rumbles. I glance over at the clock. 8:57am.\u003c/p\u003e\n\u003cp\u003eI ask slowly, “Want some French Toast?” Ghost looks stunned. I rush to continue, “I can’t make it just for one person. The recipe I know is for two people. I always make too much for myself, so if you want some, I’ll make it for both of us otherwise the rest will go to waste.”\u003c/p\u003e\n\u003cp\u003eAnd pause for air.\u003c/p\u003e\n\u003cp\u003eHe grins. “Uh, yeah. Sure. As long as you have bacon too.”\u003c/p\u003e\n\u003cp\u003eI roll my eyes and mutter, “Who on earth makes French toast without bacon or syrup? ”\u003c/p\u003e\n\u003cp\u003eWe both stand and walk to the kitchen. I start removing things from the fridge and cupboards. I ask Ghost to get some plates and just as I’m about to tell him where to get them, he goes to the exact place my plates are kept, removes two and places them on the counter.\u003c/p\u003e\n\u003cp\u003eMy eyes narrow. “Ghost, have you been in my apartment before last night?”\u003c/p\u003e\n\u003cp\u003eHis back is to me but he visibly stiffens.\u003c/p\u003e\n\u003cp\u003eOh my God!\u003c/p\u003e\n\u003cp\u003eI lean closer to him and whisper-hiss, “Oh my God! You have! When?”\u003c/p\u003e\n\u003cp\u003eHe turns, holds up his hands in surrender and explains, “The day after that first night. I came home while you were still at work and cased the place. I was just checking how secure it was. That’s all.”\u003c/p\u003e\n\u003cp\u003eMy fists ball and I close my eyes. “How thorough were you?”\u003c/p\u003e\n\u003cp\u003eHe replies immediately. “Pretty damn thorough.”\u003c/p\u003e\n\u003cp\u003eEyes still closed, I ask a hushed, “Did you go into my room?”\u003c/p\u003e\n\u003cp\u003eHe doesn’t say a word. So there’s my answer.\u003c/p\u003e\n\u003cp\u003eMy face flushes and I whisper, “Did you go through my underwear drawer?”\u003c/p\u003e\n\u003cp\u003eHe doesn’t answer this either.\u003c/p\u003e\n\u003cp\u003eOH MY GOD! That means he saw…\u003c/p\u003e\n\u003cp\u003e“Oh my God!” I shout and cover my face with my hands.\u003c/p\u003e\n\u003cp\u003eGhost sputters, “I- I- I only looked for a second. Don’t be embarrassed. It’s normal. Lots of women use vibrators…”\u003c/p\u003e\n\u003cp\u003eMy face turns beet red and I yell, “Stop talking!”\u003c/p\u003e\n\u003cp\u003e“…I know quite a few women who pleasure themselves…”\u003c/p\u003e\n\u003cp\u003eI screech, “Shut up, Ghost!”\u003c/p\u003e\n\u003cp\u003e“…I mean, I was surprised at first. You don’t seem like the kind of woman who needs a vibrator…”\u003c/p\u003e\n\u003cp\u003eI walk over to him and cover his mouth with both my hands. He closes his eyes. I whisper, “We will never speak of this again. Ever.” He stays quiet for a long moment but nods once.\u003c/p\u003e\n\u003cp\u003eI let go of his mouth, turn around and go about making our breakfast.\u003c/p\u003e\n\u003cp\u003eMy eyes close in bliss as I bite into another piece of syrup-covered bacon.\u003c/p\u003e\n\u003cp\u003eNot only is she sexy, but she cooks too.\u003c/p\u003e\n\u003cp\u003eNice.\u003c/p\u003e\n\u003cp\u003eWe’ve been fairly silent over breakfast. Ever since the vibrator conversation, she hasn’t said much.\u003c/p\u003e\n\u003cp\u003eI don’t know what the big deal is.\u003c/p\u003e\n\u003cp\u003eIt’s hot.\u003c/p\u003e\n\u003cp\u003eI’d bet at least fifty percent of women own one. I like a woman who isn’t afraid to please herself.\u003c/p\u003e\n\u003cp\u003eI clear my throat. “This is great. I didn’t know you cooked.”\u003c/p\u003e\n\u003cp\u003eNat looks up and smiles. “Well you never asked, did you? Not much of a conversationalist, are you Ash?”\u003c/p\u003e\n\u003cp\u003eI love when she says my name.\u003c/p\u003e\n\u003cp\u003ePoking at my bacon, I admit quietly, “No. Not much. No.”\u003c/p\u003e\n\u003cp\u003e“Why is that? You’re clearly intelligent. You wouldn’t be able to do all that fancy security stuff if you were dumb. Why don’t you talk much?”\u003c/p\u003e\n\u003cp\u003eI shrug and explain, “I prefer to listen. You can find out a lot about a person if they think you aren’t interested in what they’re saying. It helps me figure out the type of person they are.”\u003c/p\u003e\n\u003cp\u003eShe plays with her food and asks quietly, “Do you listen to me when I talk?” I nod and she asks, “What have you learnt about me?”\u003c/p\u003e\n\u003cp\u003eI lean back on my chair. “I’ve learnt looks can be deceiving.”\u003c/p\u003e\n\u003cp\u003eHer brow furrows. “What’s that supposed to mean?”\u003c/p\u003e\n\u003cp\u003eI shake my head and accuse, “Hell, no. If I tell you, you’ll just punch me again!”\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes and vows, “I promise not to punch you again. Today.”\u003c/p\u003e\n\u003cp\u003eI utter, “Okay. You asked for it, pretty girl.” I exhale loudly and rest my forearms on the small dining table leaning closer to her. “You act like a tough girl, but the things that hurt other people hurt you just as much. You just don’t say anything about it. You never show your true emotions and are very guarded with people you meet. You use sarcasm to deflect truth and you don’t trust easily. You sometimes use your looks to get what you want. You hide behind bright red hair, pretty dresses and sexy lips. You’re also unpredictable. Basically, you are a guy’s wet dream and worst nightmare all rolled into one. You’re the woman a guy falls in love with but doesn’t really know. He falls in love with one version of you. You’ll only show the real you when you feel safe in the relationship and it might not be what that man wants in the end.”\u003c/p\u003e\n\u003cp\u003eHer eyes have lost focus. She stares vacantly into my chest.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eThis is why I don’t talk to people. I usually say shit that makes people angry or upset. It’s not that I don’t have manners, I just don’t really understand emotions.\u003c/p\u003e\n\u003cp\u003eI run a hand through my hair and start, “Nat, I’m sorry-”\u003c/p\u003e\n\u003cp\u003eBut she cuts me off with a shake of the head and quietly states, “You’re good at that. You should become a police profiler or something. That’s pretty much right. All of it.” She ends on a whisper.\u003c/p\u003e\n\u003cp\u003eI clear my throat. “I don’t mean any offence. I just call it like I see it. I don’t really know how to lie. I’d prefer to just get the truth out there. No beating around bushes, ya know?”\u003c/p\u003e\n\u003cp\u003eShe smiles a small smile. “You’re the kind of friend I need, Ghost. Lying doesn’t fly with me. I hate it.”\u003c/p\u003e\n\u003cp\u003eQuick save.\u003c/p\u003e\n\u003cp\u003eGreat.\u003c/p\u003e\n\u003cp\u003eI have no idea why I’m so relieved. When Nat told me we should avoid each other all those months ago, I was pissed.\u003c/p\u003e\n\u003cp\u003eAnd a little hurt.\u003c/p\u003e\n\u003cp\u003eThat one passionate time with her was enough for me to think we had potential to be casual, but she obviously thought I was only worth a one-time thing. So when she demanded we stop talking, I thought screw her. But seeing her at the club and not being able to even sit close enough to hear her voice was wearing on me. I won’t ever admit it to her, but somehow, she soothes me. I used to sit next to her in the booth only to sit back, close my eyes and let the sound of her voice penetrate me. The sweet, smooth sound would banish any memories of my dad. So when she started dodging me, I was up at night a lot more than I used to be, and the only other thing that would help would be finding a random girl and screwing her til my mind was so exhausted all I could do was sleep, if only for a few hours.\u003c/p\u003e\n\u003cp\u003eSomething about Nat makes me crazy. I can’t quite put my finger on what that is.\u003c/p\u003e\n\u003cp\u003eShe’s something else.\u003c/p\u003e\n\u003cp\u003eI’ll tell you one thing, since we fucked, all I’ve wanted to do is get another shot at her. After losing that chance, I promised myself if I ever got the opportunity again, I would take it nice and slow. I’d savor the experience. The last time was rushed, explosive and fierce. I wouldn’t change it for anything though. She came twice just from my cock. That’s never happened before.\u003c/p\u003e\n\u003cp\u003eIt was phenomenal.\u003c/p\u003e\n\u003cp\u003eJust thinking about it makes me hard.\u003c/p\u003e\n\u003cp\u003eAnd… you’re getting hard.\u003c/p\u003e\n\u003cp\u003eFuck. That’s just great.\u003c/p\u003e\n\u003cp\u003eNow that I think about it, there is one thing I’d change about that night.\u003c/p\u003e\n\u003cp\u003eI’d kiss her.\u003c/p\u003e\n\u003cp\u003eGhost shuffles around on his chair.\u003c/p\u003e\n\u003cp\u003e“You okay there?” I ask.\u003c/p\u003e\n\u003cp\u003eHe replies a choked, “Yeah. Fine.” He looks kind of flushed.\u003c/p\u003e\n\u003cp\u003e“You need some water or juice?”\u003c/p\u003e\n\u003cp\u003eHe looks grateful as he splutters, “Water! Yes, water. Perfect. Thanks.” I place the water on his side of the table and finish up my breakfast. I pop the last piece of French toast into my mouth and moan.\u003c/p\u003e\n\u003cp\u003eHow great is food?!\u003c/p\u003e\n\u003cp\u003eI look up just as Ghost swallows hard and gets up and walks stiffly to the bathroom.\u003c/p\u003e\n\u003cp\u003eWhat a strange man!\u003c/p\u003e\n\u003cp\u003eI love food. There’s a type of food to deal with any emotion.\u003c/p\u003e\n\u003cp\u003eDepressed?\u003c/p\u003e\n\u003cp\u003eFried food.\u003c/p\u003e\n\u003cp\u003eHappy?\u003c/p\u003e\n\u003cp\u003eBaked goods.\u003c/p\u003e\n\u003cp\u003eContent?\u003c/p\u003e\n\u003cp\u003eIce cream.\u003c/p\u003e\n\u003cp\u003eI could make a whole chart up.\u003c/p\u003e\n\u003cp\u003eGhost exits the bathroom and trying to make conversation, I ask, “What are you doing today, friend?”\u003c/p\u003e\n\u003cp\u003eHe grins. “I don’t really know. It’s the only day off I get, so I try to cram a whole lotta crap into it.”\u003c/p\u003e\n\u003cp\u003eI nod in agreement. “Me too. I need to go grocery shopping though. You would’ve noticed this morning when you broke into my apartment to steal milk that I only had a drop left.”\u003c/p\u003e\n\u003cp\u003eHe chuckles. “Yeah. You need more milk.”\u003c/p\u003e\n\u003cp\u003e“You need anything from the store?” I ask cautiously.\u003c/p\u003e\n\u003cp\u003eHe looks shocked at my offer. I mean, I am pretty shocked at my offer. Ghost has been back in my life for about twelve hours, but in that time, he’s revealed more about himself to me than what he had in a year. And I want to know about him.\u003c/p\u003e\n\u003cp\u003eThat’s my reasoning and I’m sticking to it.\u003c/p\u003e\n\u003cp\u003eHe finally responds, “Yeah, I do have to get groceries.” He looks unsure but asks, “Can we just go together? I normally browse around because I don’t write a list.”\u003c/p\u003e\n\u003cp\u003eHe doesn’t write a list?\u003c/p\u003e\n\u003cp\u003eSacrilege!\u003c/p\u003e\n\u003cp\u003eI’m kind of excited about going grocery shopping with Ghost. “Sure. No problem.” I shrug and respond in a bored tone.\u003c/p\u003e\n\u003cp\u003eHe says to meet in the hall in a half hour. In that time, I shower and dress.\u003c/p\u003e\n\u003cp\u003eThen we’re off.\u003c/p\u003e\n\u003cp\u003eNat tries to get us to drive to the store in her car.\u003c/p\u003e\n\u003cp\u003eNot happening.\u003c/p\u003e\n\u003cp\u003eNo offence to women, but when I’m in a car with any woman, it could even be her car, I’m driving.\u003c/p\u003e\n\u003cp\u003eMight have something to do with the fact that my car is my baby. I worked my ass off and saved any spare cash I had to put towards doing her up. My 68 Chevy Impala. Black exterior with matching black custom interior. Leather sent over from Italy. Some would say I’m stupid to have spent so much on it, but fuck. She makes me happy.\u003c/p\u003e\n\u003cp\u003eAfter arguing for ten minutes, I stroll over to my car, start it and drive over to her. I have to hide my smile.\u003c/p\u003e\n\u003cp\u003eShe looks so damn cute.\u003c/p\u003e\n\u003cp\u003eShe wears a scowl. Her body is stiff. She has her arms crossed over her chest and she’s wearing a huge pout.\u003c/p\u003e\n\u003cp\u003eI beep the horn and she jumps in fright. I can’t help but chuckle. Finally, she rolls her eyes, gives in and we’re off.\u003c/p\u003e\n\u003cp\u003eShe doesn’t talk to me til we get to the grocery store, and even then she only asks, “Want to share a cart?” I nod.\u003c/p\u003e\n\u003cp\u003eShe takes us straight to the fruit and vegetable section and puts random items in the cart: strawberries, half a cantaloupe, carrots, tomatoes, celery, apples and avocado. She looks over to me. “What produce do you need?”\u003c/p\u003e\n\u003cp\u003eI’m confused.\u003c/p\u003e\n\u003cp\u003eI need produce?\u003c/p\u003e\n\u003cp\u003eI’m pretty sure I’ve been living just fine without them. I take the cart and steer it into the meat section. I hear Nat mutter, “Okay, no fruit and veg. Check.” \u003c/p\u003e","sourceLink":"https://allnovel.net/love-thy-neighbour-friend-zoned-2/page-5.html","bookId":2799,"creation":"Oct 5, 2019 5:42:29 PM","modification":"Oct 5, 2019 5:42:29 PM"}
