{"id":70531,"no":12,"title":"Page 12","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Not funny.”\u003c/p\u003e\n\u003cp\u003e“Look. The division of duties ain’t the same on the ranch as it is in a traditional nine-to-five workplace. We do what needs done. Sometimes there’s a helluva lot that needs done. During calving season. During haying and branding. Like when Skylar was pregnant with the twins? I sure as hell wasn’t gonna make Kade stick around and check the herd in the middle of the night. Especially when he lives a lot farther away than Dad or me. Besides, he wouldn’t have been worth a shit anyway, worryin’ about his wife.”\u003c/p\u003e\n\u003cp\u003e“Calving is a busy time?”\u003c/p\u003e\n\u003cp\u003e“Exhausting. I don’t get more’n a couple hours sleep for at least three weeks. In the last few years, Kade handled the daytime chores. Dad switches back and forth between helpin’ both of us. If Dad gets too tired, then Ma pitches in. I’m usually out at the bunkhouse with my cousins during that time, since we’ve staggered the calving season. So, see? It all works out.” He got up and grabbed the coffee pot, refilled both their cups. “For instance, Kade is takin’ care of things while I’m here with you.”\u003c/p\u003e\n\u003cp\u003e“I’ll remember to thank him,” Ginger murmured. “And you. Thank you, Kane. I know you probably had more important things to do than babysit me.”\u003c/p\u003e\n\u003cp\u003e“I’m here because I want to be. You know that, right?”\u003c/p\u003e\n\u003cp\u003e“I’m a little more convinced now than I was when you first showed up at the hospital.”\u003c/p\u003e\n\u003cp\u003eAt his smoky gaze, and his gravelly “Is that so?” heat curled in her belly.\u003c/p\u003e\n\u003cp\u003e“While you’re restin’ today, do you mind if I take Hayden into town for the high school basketball game? We don’t have to stay for all four quarters, but he’s been lookin’ forward to it. Thought we could pick up something for supper and bring it home.”\u003c/p\u003e\n\u003cp\u003e“I don’t see why not. It’ll be good for him to get out.”\u003c/p\u003e\n\u003cp\u003eKane was quiet as he fiddled with his coffee mug.\u003c/p\u003e\n\u003cp\u003e“I see the wheels a’turnin’, cowboy. What’s on your mind?”\u003c/p\u003e\n\u003cp\u003e“This might sound weird, but would Dash want to come to the game? There’s this scrimmage thing at halftime, and Hayden’s been practicing his sprint drills. We’d intended to ask you as a surprise, but bein’s you’re laid up… I think it’s important that Hayden has family there.”\u003c/p\u003e\n\u003cp\u003eKane continually shocked her with his attention to detail and the genuine affection he held for her son.\u003c/p\u003e\n\u003cp\u003e“Sometimes Dad—”\u003c/p\u003e\n\u003cp\u003e“Is perfectly capable of making up his own mind,” Dash supplied as he rolled up to the table.\u003c/p\u003e\n\u003cp\u003e“Morning, Dad.”\u003c/p\u003e\n\u003cp\u003e“Ginger. How are you feeling?”\u003c/p\u003e\n\u003cp\u003eAdmitting she felt fantastic might encourage him to ask why she felt so fantastic. She couldn’t admit two orgasms courtesy of Kane McKay were just what she needed. She shrugged. “Okay. How about you?”\u003c/p\u003e\n\u003cp\u003e“I’m feeling a little stir crazy, if you want to know the truth. Since tomorrow is a holiday, the bus won’t be picking me up to take me to the senior’s center.”\u003c/p\u003e\n\u003cp\u003e“I forgot there was no school tomorrow,” Ginger said.\u003c/p\u003e\n\u003cp\u003eDash addressed Kane. “Were you serious about letting me tag along today?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“I appreciate it. I wouldn’t want to miss the opportunity to cheer on my grandson.”\u003c/p\u003e\n\u003cp\u003e“Good. Is the mechanical handicapped platform in the van easy to run?” Kane brought Dash a cup of coffee.\u003c/p\u003e\n\u003cp\u003e“Far as I know. Ginger doesn’t have a problem with it.”\u003c/p\u003e\n\u003cp\u003eInteresting that Kane hadn’t asked her if the equipment was hard to handle.\u003c/p\u003e\n\u003cp\u003e“We’ll have to get an earlier start. But don’t let on you know about Hayden’s surprise,” Kane warned.\u003c/p\u003e\n\u003cp\u003e“I was an attorney for fifty years, boy. I know how to keep a secret.”\u003c/p\u003e\n\u003cp\u003e“You’ve got a damn fine poker face too,” he muttered.\u003c/p\u003e\n\u003cp\u003eDash gave him a sly grin. “A necessity, being a judge and living in a small community.”\u003c/p\u003e\n\u003cp\u003e“Well, I want a chance to earn back my twenty-five bucks.”\u003c/p\u003e\n\u003cp\u003eGinger looked at Kane. “You lost to my dad?”\u003c/p\u003e\n\u003cp\u003e“Yep. That’ll teach me to go all in.” Kane drained his coffee. “What do you guys want for breakfast?\u003c/p\u003e\n\u003cp\u003eEggs? Toast? Cereal?”\u003c/p\u003e\n\u003cp\u003e“Cereal is fine with me,” Dash said.\u003c/p\u003e\n\u003cp\u003eGinger rolled her eyes. Another thing her father and her son had in common: love of sugar-laden cereals. “I’ll have eggs.”\u003c/p\u003e\n\u003cp\u003e“Hang on. I’ve gotta wake up my egg cracker.” Kane strode off.\u003c/p\u003e\n\u003cp\u003eShe felt her father staring at her. “What?”\u003c/p\u003e\n\u003cp\u003e“I can’t place it. You seem different today. More relaxed or something.”\u003c/p\u003e\n\u003cp\u003eGinger slipped on her poker face. “I must be on the mend.”\u003c/p\u003e\n\u003cp\u003e“You slept all right?”\u003c/p\u003e\n\u003cp\u003eWhy was he pushing her on this? Normally he couldn’t give a rip about her sleep patterns.\u003c/p\u003e\n\u003cp\u003eShit. He knew. Her dad knew that Kane had snuck into her room last night.\u003c/p\u003e\n\u003cp\u003eStay calm.\u003c/p\u003e\n\u003cp\u003eFor fuck’s sake. She was a thirty-seven-year-old woman. This was her house. If she wanted to invite a man into her bed, it was none of her dad’s business. She’d buck up, and just…\u003c/p\u003e\n\u003cp\u003eLie her ass off.\u003c/p\u003e\n\u003cp\u003e“Yeah. That pain pill really knocked me out.”\u003c/p\u003e\n\u003cp\u003eHer dad harrumphed.\u003c/p\u003e\n\u003cp\u003eHayden trudged into the kitchen. His sleep-tousled blond hair stuck up every direction and his glasses were on crooked. He snuggled into her, wrapping his arms around her neck. Wouldn’t be too much longer before he wouldn’t want morning snuggles and hugs. She kissed the top of his head. “Morning.”\u003c/p\u003e\n\u003cp\u003e“Hayden, it might be better if you didn’t squish your mama, and sat next to her instead of on her.”\u003c/p\u003e\n\u003cp\u003eHayden shook his head and burrowed deeper into her neck.\u003c/p\u003e\n\u003cp\u003eKane frowned but didn’t say a word.\u003c/p\u003e\n\u003cp\u003eHer son used to be clingy, but not so much in the past two years, so she was perplexed by his suddenly shy behavior.\u003c/p\u003e\n\u003cp\u003eKane set out two bowls, spoons, a carton of soymilk and a box of Frosted Cheerios.\u003c/p\u003e\n\u003cp\u003eHer father helped himself to breakfast. The only sounds were the hum of the heater and the crunching cereal.\u003c/p\u003e\n\u003cp\u003e“I hear there’s a basketball game today. Grandpa is going.”\u003c/p\u003e\n\u003cp\u003e“I wanted you to come to the basketball game, Mommy.”\u003c/p\u003e\n\u003cp\u003e“I know, baby. And I’m sorry that I’ll be stuck here while you’re having a good time with Grandpa and Kane.”\u003c/p\u003e\n\u003cp\u003e“His name is Buck,” Hayden said snottily.\u003c/p\u003e\n\u003cp\u003e“Actually, my name is Kane. Buck was a nickname I tried out for a while, hopin’ it’d distinguish me from my twin brother and my McKay cousins, whose names, for some reason, all seem to start with the letter C or K.”\u003c/p\u003e\n\u003cp\u003e“I wasn’t talking to you,” Hayden retorted.\u003c/p\u003e\n\u003cp\u003eShocked, Ginger leaned back and looked at her son sternly. “Hayden Michael Paulson. What is wrong with you? That was just plain rude. Apologize to Kane right now.”\u003c/p\u003e\n\u003cp\u003eSilence. Surly, stubborn silence.\u003c/p\u003e\n\u003cp\u003eGinger waited about another fifteen seconds. Then she instructed, “Back to your room. You can come out only when you’re ready to be civilized and apologize to Kane.”\u003c/p\u003e\n\u003cp\u003e“But Mom—”\u003c/p\u003e\n\u003cp\u003e“No buts. Go on.”\u003c/p\u003e\n\u003cp\u003eHe climbed off her lap and ran to his room, slamming the door behind him.\u003c/p\u003e\n\u003cp\u003eShe closed her eyes. Kids and drama went hand in hand. Chances were high Hayden’s snit would only last a few minutes. But she’d learned early on if she let him exhibit bratty behavior, he’d use it whenever possible to get his way.\u003c/p\u003e\n\u003cp\u003e“Ginger?” Kane said.\u003c/p\u003e\n\u003cp\u003ePlease. Don’t offer me parenting advice right now. “What?”\u003c/p\u003e\n\u003cp\u003e“Would you like a reheat?”\u003c/p\u003e\n\u003cp\u003e“Yes. Thank you.”\u003c/p\u003e\n\u003cp\u003eHe’d filled her cup and cleared her father’s bowl.\u003c/p\u003e\n\u003cp\u003eSure enough, less than five minutes later, the bedroom door opened and Hayden appeared. He started to climb onto her lap, but she shook her head and pointed to Kane.\u003c/p\u003e\n\u003cp\u003eHayden stood behind his grandfather’s wheelchair, his fingers curled around the handgrips. “Umm.\u003c/p\u003e\n\u003cp\u003eI’m sorry for being rude to you, Buck.”\u003c/p\u003e\n\u003cp\u003e“Thanks for the apology, sport.”\u003c/p\u003e\n\u003cp\u003e“So you’re not mad?”\u003c/p\u003e\n\u003cp\u003e“Nope. Takes courage to admit you were wrong.”\u003c/p\u003e\n\u003cp\u003eHayden slid into the chair next to her. “What am I supposed to call you? I’ve always called you Buck, but everyone else calls you Kane.”\u003c/p\u003e\n\u003cp\u003e“My nieces Eliza, Peyton, Shannie and Liesl call me Buck. So do Kyler, Gib, Thane, Anton, Parker, Braxton, Spencer, Westin… Shoot, I know I’m forgetting a couple that can talk now.”\u003c/p\u003e\n\u003cp\u003e“You consider all your McKay cousins’ offspring your nieces and nephews?” Ginger asked.\u003c/p\u003e\n\u003cp\u003e“Pretty much. Me’n Kade were with them all the time growin’ up. And we’re ranching together, so the kids think of me the same as their other McKay uncles.” He winked. “I’ve gotta admit to havin’ a real soft spot for Kade’s girls.”\u003c/p\u003e\n\u003cp\u003e“Anton and Ky are cool,” Hayden offered. “They’re always talking about all their cousins.” He dumped cereal in his bowl and poured soymilk over it.\u003c/p\u003e\n\u003cp\u003e“Seems my cousins’ wives are in a race to see who can have the most kids in the shortest amount of time.”\u003c/p\u003e\n\u003cp\u003e“Who’s winning?”\u003c/p\u003e\n\u003cp\u003e“Colby and Channing were, but with Cam and Domini adopting Liesl and the twins a few months back…they’re tied. Four and four.”\u003c/p\u003e\n\u003cp\u003eGinger looked at Kane. “Lots of twins in the McKay family tree.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Mostly fraternal. Kade and I are the only identical twins in our McKay generation, but it seems genetics—and adoption—is makin’ up for it in this next generation.”\u003c/p\u003e\n\u003cp\u003eKane’s phone buzzed and he plucked it out of his front shirt pocket. “Mornin’ Ma.” Pause. “No.”\u003c/p\u003e\n\u003cp\u003eAnother pause. “Because it ain’t a story Ginger wants spread all over town.” He held the phone away from his ear as his mother railed on him.\u003c/p\u003e\n\u003cp\u003eGinger detected humor in his tone, not anger as he said, “Sorry. No, I am sincerely sorry, Ma. Yes ma’am.” Then he hung up. \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-12.html","bookId":2689,"creation":"Oct 5, 2019 10:17:19 AM","modification":"Oct 5, 2019 10:17:19 AM"}
