{"id":70533,"no":14,"title":"Page 14","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eKane scratched his head. “How about if you repeat that in plain English?”\u003c/p\u003e\n\u003cp\u003e“This particular bathroom is impossible for me to use.”\u003c/p\u003e\n\u003cp\u003e“Do you need help?”\u003c/p\u003e\n\u003cp\u003eThe muscle in Dash’s jaw tightened. “No. That’s not the issue.”\u003c/p\u003e\n\u003cp\u003eLike hell that wasn’t the issue. Like father like daughter. Neither one wanted to accept his help.\u003c/p\u003e\n\u003cp\u003eRather than snap, or embarrass the man, or point out the obvious, Kane said, “Fine. Let’s get you back home.”\u003c/p\u003e\n\u003cp\u003e“I thought you’d prefer to stay until the end of the game.”\u003c/p\u003e\n\u003cp\u003e“In the future, maybe it’d be better if you asked my plans instead of assuming they’ll conflict with yours.”\u003c/p\u003e\n\u003cp\u003eDash had no response.\u003c/p\u003e\n\u003cp\u003eKane buttoned his sheepskin coat and slipped on his gloves. “Everyone ready to go?”\u003c/p\u003e\n\u003cp\u003e“Wait a sec. I gotta say goodbye to someone.” Hayden raced off and ducked beneath the bleachers.\u003c/p\u003e\n\u003cp\u003eThe silence between him and Dash was decidedly chilly and didn’t owe a damn thing to the frigid temperatures outside.\u003c/p\u003e\n\u003cp\u003e“McKay, I apologize. I can be a bit of a curmudgeon sometimes.”\u003c/p\u003e\n\u003cp\u003eAt least the members of the Paulson family didn’t have a problem admitting when they were wrong.\u003c/p\u003e\n\u003cp\u003e“I understand. We’re cool. Know what’s funny? My mama used that same word to describe my grandpa. Course, me’n Kade thought it meant mean.”\u003c/p\u003e\n\u003cp\u003eDash smiled. “Thanks for bringing me here today.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome.”\u003c/p\u003e\n\u003cp\u003eHayden bounded back, grinning from ear to ear. “This is so great. I wish we could do guy stuff like this with all of us every weekend.”\u003c/p\u003e\n\u003cp\u003eKane looked at Dash, who rather pointedly focused his gaze on his hands in his lap and didn’t respond.\u003c/p\u003e\n\u003cp\u003e“Me too, sport,” Kane said. “Me too.”\u003c/p\u003e\n\u003cp\u003eChapter Seven\u003c/p\u003e\n\u003cp\u003e“Kimi, don’t feel obligated to stay if you have other things to do,” Ginger said, after twenty minutes of general small talk.\u003c/p\u003e\n\u003cp\u003e“I’m happy to stick around. And to be honest? You’d be doin’ me a favor by lettin’ me stay.”\u003c/p\u003e\n\u003cp\u003eGinger eyed the petite blonde. How this small woman birthed twins boggled her mind. “How would you getting stuck with me be a favor?”\u003c/p\u003e\n\u003cp\u003eKimi cracked open a can of diet soda and poured the fizzy liquid over a glass of ice. “First off, it’s Sunday. Which means football, which I don’t care a lick about. But my husband and his brother Carson are huge fans. They turn the TV so damn loud I can’t stand to be in the same room with them.” She winked.\u003c/p\u003e\n\u003cp\u003e“I’m pretty sure that’s what they’re countin’ on.”\u003c/p\u003e\n\u003cp\u003e“You’re left to your own devices every Sunday?”\u003c/p\u003e\n\u003cp\u003e“It ain’t so bad. About half the time I head over to my sister Caro’s place, since Carson is parked in my den. But today, Caro has all her grandkids over. Now don’t get me wrong, I adore my grandnephews and grandnieces. There are just so darn many of them. Cryin’, fightin’, screamin’, kids and dogs runnin’ in and out of the house. Plus diapers, and at least one of them always vomits. Caro’s in her element, but she’s used to bein’ surrounded by kids, as she had half a dozen.”\u003c/p\u003e\n\u003cp\u003eKimi set the soda on a coaster next to Ginger, and then poured herself a soda on ice too.\u003c/p\u003e\n\u003cp\u003e“Of course, my granddaughters are perfect angels. Here. See for yourself.” From a saddle-shaped purse, Kimi whipped out a four-by-six photo album and handed it over. “Since Sky works so much during the week, her and Kade’s weekends are devoted to their girls, and I can’t fault them for that. Even when I don’t get to see my girlies as much as I’d like.”\u003c/p\u003e\n\u003cp\u003e“Do you ever hang out with Kane on Sundays?”\u003c/p\u003e\n\u003cp\u003e“Rarely.”\u003c/p\u003e\n\u003cp\u003e“Why’s that?”\u003c/p\u003e\n\u003cp\u003eKimi shrugged. “Used to be he’d still be enjoying female companionship from his Saturday night adventures in whatever bar he’d been trolling in the night before.”\u003c/p\u003e\n\u003cp\u003e“Used to be?”\u003c/p\u003e\n\u003cp\u003e“Not for lack of women vying for his attention. My boys are good lookin’ men. Lord, they’ve been rating a second and third glance from women of all ages since they turned fourteen. Kane took advantage of Raising Kane\u003c/p\u003e\n\u003cp\u003ethat female attention, way more than Kade ever did. But in the last few years, it’s like Kane had a complete personality makeover.”\u003c/p\u003e\n\u003cp\u003eGetting the goods on Kane McKay straight from his mother’s mouth? Too good an opportunity to pass up. “How’s he changed?”\u003c/p\u003e\n\u003cp\u003e“His cousin Dag died. Colt went into rehab. Cord got married. Kade got married. Then they sold the Boars Nest to Cam. It was like everybody grew up and moved on. Everyone but him. And don’t get me started on that ridiculous name change.\u003c/p\u003e\n\u003cp\u003e“I’ve thought a lot about it and the bottom line is this—I don’t think Kane wanted to give up his party-boy ways. It’s made him a little bitter, so he keeps to himself. It bugs the crap out of me that he’s alone so much.” Kimi sighed. “Then again, near as I can figure, he’s not bouncing on every woman with a pulse in the tri-county area. Good Lord. That man had lousy taste in women.”\u003c/p\u003e\n\u003cp\u003eCheeks burning, Ginger sipped her soda, keeping her mouth shut.\u003c/p\u003e\n\u003cp\u003eBut Kimi was perceptive and recognized Ginger’s intentional silence. “If you’ve got something to say about Kane, by all means, spit it out.”\u003c/p\u003e\n\u003cp\u003eHer internal debate lasted all of fifteen seconds. “No offense, Kimi. I hate to say you’re wrong about your son…but you’re wrong. Kane keeps to himself because he’s just plain tired. Sounds to me like he’s picked up a considerable amount of slack since Kade became a family man.” Ginger lifted a finger when Kimi started to argue. “He wasn’t whining or complaining when we talked about it, just explaining.\u003c/p\u003e\n\u003cp\u003e“Kane spends time with Hayden at least once a week. Maybe he isn’t hanging out with his married McKay cousins, but he plays poker with his single McKay cousins every other week. Maybe the difference is Kane doesn’t feel compelled to live up to his former wild reputation. And near as I can tell? He isn’t bitter. But I suspect he is lonely.”\u003c/p\u003e\n\u003cp\u003eKimi flat-out gaped at her. Then she got up and walked into the kitchen. She stared out the window, keeping her back to Ginger.\u003c/p\u003e\n\u003cp\u003eWay to insult Kane’s mother first thing. Sometimes you have the tact of your mother.\u003c/p\u003e\n\u003cp\u003eGinger waited for Kimi to either leave in a huff or lash out at her, figured she deserved either or both reactions.\u003c/p\u003e\n\u003cp\u003eFinally she came back and sat next to Ginger on the couch. Ginger’s stomach churned seeing tear tracks on Kimi’s face.\u003c/p\u003e\n\u003cp\u003e“Sorry if I stepped over the line.”\u003c/p\u003e\n\u003cp\u003e“You didn’t.” Kimi laughed. “Okay, you did. It’s just…you think you know your child. Straight down to the bone. Then someone shows you how arrogant that is. I should never assume anything. It makes me mad when other people do it, and I’ve done the same damn thing with my own child. So I don’t know which is worse, how impressed I am by your insight into my son, or how embarrassed I am because of my lack of it.”\u003c/p\u003e\n\u003cp\u003eSomewhat relieved, Ginger sagged into the couch. “I entrust Kane with the most important thing in my life—my son—so I probably see him in another light than you do.”\u003c/p\u003e\n\u003cp\u003eA shrewd look entered Kimi’s eyes. “How do you see my son?”\u003c/p\u003e\n\u003cp\u003eI’d like to see the gorgeous, thoughtful, kind, sweet, funny man naked a whole lot more, especially with his innate ability to make my earlobes sweat when he puts those calloused hands on me.\u003c/p\u003e\n\u003cp\u003e“Not only is Kane multi-faceted, Kimi, he’s great at multi-tasking. I don’t know what I would’ve done if he hadn’t volunteered to stay here and take care of us after my accident.” Ginger tilted her head back and stared at the ceiling.\u003c/p\u003e\n\u003cp\u003e“Speaking of caretakers, are you Dash’s primary caretaker?”\u003c/p\u003e\n\u003cp\u003e“Yes. And no. We built this one-level house to accommodate his wheelchair. Everything is handicapped-accessible. I hired a male nurse to deal with Dad’s personal hygiene stuff because the stubborn man refuses to let me help him.”\u003c/p\u003e\n\u003cp\u003e“Men need their pride,” Kimi said softly. “My father hated being seen as weak. But Cal’s dad, God rest his soul, accepted he’d never be the man he was and kept a great sense of humor about his ‘failings’\u003c/p\u003e\n\u003cp\u003euntil the day he died.”\u003c/p\u003e\n\u003cp\u003e“At this point…my Dad is between those two mindsets. Luckily he’s still a social guy, so he’s off to the senior center or community center three times a week. Although he’s retired, he comes into the office and helps me.”\u003c/p\u003e\n\u003cp\u003e“Cal said Dash intends to pass all the McKay legal work on to you.”\u003c/p\u003e\n\u003cp\u003e“There’s a lot more to it than I imagined.”\u003c/p\u003e\n\u003cp\u003e“Big ranch. Big secrets. I hope you’re up for it.”\u003c/p\u003e\n\u003cp\u003eThat was a strange thing for Kimi to say.\u003c/p\u003e\n\u003cp\u003eThe silence didn’t last long and Ginger appreciated Kimi kept the conversation rolling.\u003c/p\u003e\n\u003cp\u003e“I’m not surprised Dash kept his health issues a secret while he was dealing with Linda’s illness.”\u003c/p\u003e\n\u003cp\u003eKimi clucked her tongue. “Linda was such a sweet woman.”\u003c/p\u003e\n\u003cp\u003e“That’s what I hear. I didn’t know her at all.”\u003c/p\u003e\n\u003cp\u003e“Is that because you were close with your mother? I don’t believe I’ve ever heard her mentioned.”\u003c/p\u003e\n\u003cp\u003eGinger tensed up at the mere mention of her mother. “As you probably know from local gossip, my parents’ divorce was less than amicable. My relationship with my mother wasn’t that great growing up, but it worsened after I left for college.”\u003c/p\u003e\n\u003cp\u003e“Why? You’d think she’d be proud to have such a successful, smart, driven woman for a daughter.”\u003c/p\u003e\n\u003cp\u003e“Wrong. She hated I’d followed in my dad’s footsteps. Then Hayden’s birth knocked her for a loop, because frankly, she wasn’t ready to be a grandma. Plus, it embarrassed her I’d become an unmarried single mother and refused to disclose the name of Hayden’s sperm donor. She cut all ties with me when we moved to Wyoming.” \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-14.html","bookId":2689,"creation":"Oct 5, 2019 10:17:19 AM","modification":"Oct 5, 2019 10:17:19 AM"}
