{"id":70535,"no":16,"title":"Page 16","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eKane picked up the pace.\u003c/p\u003e\n\u003cp\u003eGinger loosened her jaw, loving his loss of control with every grunting thrust into the wet recess of her mouth. Her panties were soaked. Her sex throbbed with want, jealous her mouth was being so thoroughly filled.\u003c/p\u003e\n\u003cp\u003eThe strokes increased. Kane’s breathing turned even more ragged. “I’m close. Jesus. Fuck.” Two more deep thrusts and he stilled. His cock twitched on the back of her tongue and he groaned, “Swallow.\u003c/p\u003e\n\u003cp\u003eNow. All of it. Christ.” His hips continued to bump against her face.\u003c/p\u003e\n\u003cp\u003eHer cheeks were compressed tightly to the rigid shaft. Her throat muscles contracted around the head as his seed flowed down the back of her throat. A pleasant buzz reverberated in her head.\u003c/p\u003e\n\u003cp\u003eFirst time she’d experienced that euphoric feeling from giving a blowjob. Usually her orgasms gave her that floating, melting sensation.\u003c/p\u003e\n\u003cp\u003eSeriously fucking hot, seriously fucking heady, this obedience stuff.\u003c/p\u003e\n\u003cp\u003e“Hey. Red. Look at me.”\u003c/p\u003e\n\u003cp\u003eShe blinked at him.\u003c/p\u003e\n\u003cp\u003eSatisfaction and pure possession were etched on his face. And his mouth. That sinful, talented, knowing mouth, curled into a naughty smile. “You liked that.”\u003c/p\u003e\n\u003cp\u003eGinger couldn’t even nod with the fierce grip he had on her head.\u003c/p\u003e\n\u003cp\u003eKane’s cock remained in her throat. “Beautiful, sexy Ginger. Prim and proper mama no more. Christ, woman, you blew my fuckin’ mind.”\u003c/p\u003e\n\u003cp\u003eShe kept her eyes riveted to the fire blazing in the blue depths. She finally understood his need for control—because his sexual hunger could be overpowering. All encompassing. Addictive.\u003c/p\u003e\n\u003cp\u003e“But you can let go of my dick now. In fact, sugar, you’re teeth are startin’ to hurt a little.”\u003c/p\u003e\n\u003cp\u003eWhat? She was keeping his cock in place? Not him? That was new. She relaxed her jaw.\u003c/p\u003e\n\u003cp\u003eKane’s greedy gaze was locked on his semi-hard cock slipping from between her lips. “Soon as you catch your breath, we’re goin’ again.”\u003c/p\u003e\n\u003cp\u003eShe nuzzled his hip, breathing his musky scent deep into her lungs. Her fingernails were still embedded in his thigh with enough force she’d marked him.\u003c/p\u003e\n\u003cp\u003eHe seemed content to stroke her hair, brushing back the tendrils sticking to her sweat dampened face.\u003c/p\u003e\n\u003cp\u003eSeveral insistent knocks on the door brought them both out their sexual trance.\u003c/p\u003e\n\u003cp\u003e“Mommy?”\u003c/p\u003e\n\u003cp\u003eGinger’s head snapped up.\u003c/p\u003e\n\u003cp\u003eKane said, “Shit,” and quickly—and rather comically—dragged on his pajama bottoms and pulled on his tank top, inside out.\u003c/p\u003e\n\u003cp\u003eGood thing she had her clothes on and she looked sleep tousled, not sex-ravaged. Kane unlocked the door, ending up behind it as it opened.\u003c/p\u003e\n\u003cp\u003eHayden rushed in and started to fling himself at her, but Kane deftly stopped him mid-leap.\u003c/p\u003e\n\u003cp\u003e“Gently, sport. Your mama still ain’t up to tackle hugs.”\u003c/p\u003e\n\u003cp\u003eIf it surprised Hayden that Kane was in her room, he didn’t show it. He burrowed into her.\u003c/p\u003e\n\u003cp\u003e“Sweetie? What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“I had a bad dream. And you died and Grandpa changed into a tornado, with robot arms and he chased me in his wheelchair. He was gonna cut off my head!”\u003c/p\u003e\n\u003cp\u003e“Sounds scary. But I’m thinking no more Transformers before bed,” she murmured, looking up at Kane.\u003c/p\u003e\n\u003cp\u003eKane mouthed, “Sorry.”\u003c/p\u003e\n\u003cp\u003e“Can I sleep with you?”\u003c/p\u003e\n\u003cp\u003eHayden rarely asked to crawl in bed with her so she knew he was shaken up. She kissed the top of his head. “Of course. Do you need a drink or anything first?”\u003c/p\u003e\n\u003cp\u003e“No. Just need you, Mommy.”\u003c/p\u003e\n\u003cp\u003eHer heart tumbled. “I’m here. Not going anywhere, okay?”\u003c/p\u003e\n\u003cp\u003e“Okay.” He released a heavy sigh. “I’m tired.”\u003c/p\u003e\n\u003cp\u003e“Maybe Kane can tuck us both in.”\u003c/p\u003e\n\u003cp\u003e“No problem.”\u003c/p\u003e\n\u003cp\u003eGinger rolled back onto the mattress. Hayden snuggled beside her, heeding Kane’s warning not to jiggle her sling. They wiggled until comfortable positions were attained.\u003c/p\u003e\n\u003cp\u003eKane tugged the blankets over them. “Do you want pillows to prop up your cast?”\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003eHe clicked off the lights. “I’ll leave the door open in case you need anything.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eUsually Hayden was a restless sleeper but it didn’t take long before his breathing leveled. He mumbled, “Love you, Mommy.”\u003c/p\u003e\n\u003cp\u003e“Love you too, baby.”\u003c/p\u003e\n\u003cp\u003eShe thought she’d be too keyed up from the sexual shenanigans with Kane to fall asleep right away.\u003c/p\u003e\n\u003cp\u003eBut right after closing her eyes, she drifted off.\u003c/p\u003e\n\u003cp\u003eChapter Eight\u003c/p\u003e\n\u003cp\u003eBy the time Ginger hobbled into the kitchen the next morning, Kane had already showered, shoveled the steps and the wheelchair ramp and brewed a pot of coffee.\u003c/p\u003e\n\u003cp\u003eYeah, he was a little anxious.\u003c/p\u003e\n\u003cp\u003eShe didn’t wait for him to bring her a cup; she walked right past him poured her own. “You’ve been a busy bee this morning,” she said, gazing out the window.\u003c/p\u003e\n\u003cp\u003e“I’m used to getting up early. Did Hayden settle down all right last night?”\u003c/p\u003e\n\u003cp\u003e“Surprisingly, yes. He’s still completely sacked out.”\u003c/p\u003e\n\u003cp\u003e“I checked on you guys about three and you were both sound asleep.”\u003c/p\u003e\n\u003cp\u003eGinger turned around. “Why’d you check on us?”\u003c/p\u003e\n\u003cp\u003e“Habit. I’ve been checkin’ in on you at some point every night since I got here.”\u003c/p\u003e\n\u003cp\u003eShe stared at him. Hard. “So? Do I drool? Snore? Babble in my sleep?”\u003c/p\u003e\n\u003cp\u003e“You’re not usually this cranky before you’ve had your first shot of caffeine. Something botherin’\u003c/p\u003e\n\u003cp\u003eyou?”\u003c/p\u003e\n\u003cp\u003e“Just…never mind. Drop it, okay?”\u003c/p\u003e\n\u003cp\u003eKane stopped in front of her. “No. Talk to me.”\u003c/p\u003e\n\u003cp\u003e“You’re doing everything. I’m doing nothing. I’m tired of being helpless. I need a real shower so badly I can smell myself. I look horrible. I hate the way the pain pills knock me out. I hate that if I don’t take them I hurt.”\u003c/p\u003e\n\u003cp\u003e“Anything else?”\u003c/p\u003e\n\u003cp\u003eGinger lifted her head. “Like my total helplessness, my total dependence on you isn’t enough reason for me to be cranky?” She scowled at him. “Why in the hell are you so damn chipper this morning?”\u003c/p\u003e\n\u003cp\u003e“Do you want a blow by blow account of what’s put a big ol’ grin on my face?”\u003c/p\u003e\n\u003cp\u003e“Smartass.” She hid her smile behind her coffee cup. “I didn’t expect you’d be happy. I thought you’d be upset we were interrupted.”\u003c/p\u003e\n\u003cp\u003e“I didn’t expect anything less than you givin’ Hayden your full attention when he needed it.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. I thought maybe you were peckish because I hadn’t kissed you good mornin’ yet. Come to think of it, I didn’t kiss you goodnight, either.”\u003c/p\u003e\n\u003cp\u003e“Slacking on your caretaking duties, McKay.”\u003c/p\u003e\n\u003cp\u003e“Do you want me to kiss you?”\u003c/p\u003e\n\u003cp\u003eHer gaze darted to Dash’s room.\u003c/p\u003e\n\u003cp\u003e“I checked on him too. He’s still snoring away.” Kane set her coffee cup on the counter and held her face in his hands. “Good mornin’, beautiful.” He kissed her with as much tenderness he could muster, needing her acceptance. Her surrender.\u003c/p\u003e\n\u003cp\u003eGinger tried to crank the heat up, but he wouldn’t allow it. He gently bit down on her lower lip and briefly held it hostage between his teeth. “Ah. Ah. Ah. My pace. And I’m wantin’ slow, wet and sweet kisses from you right now, counselor.”\u003c/p\u003e\n\u003cp\u003e“Kane. I want more than kisses.”\u003c/p\u003e\n\u003cp\u003eHis cock, already stirring with interest, went fully erect. “Same goes, but I ain’t gonna start something we can’t finish. Neither your daddy nor your son needs to see me bending you facedown across the counter as I fuck you like a madman.”\u003c/p\u003e\n\u003cp\u003eThe pulse in her throat jumped.\u003c/p\u003e\n\u003cp\u003eWith deliberate slowness, Kane bent down, breathing on the spot before he placed his lips on it. “I love the way you taste right here.”\u003c/p\u003e\n\u003cp\u003eGinger shivered, releasing a husky moan.\u003c/p\u003e\n\u003cp\u003e“I want you under me, on top of me, in front of me, every which way I’ve ever thought about takin’\u003c/p\u003e\n\u003cp\u003eyou and then some. But let’s be realistic, Red. It’s probably not gonna happen tonight.”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e“Having second thoughts about getting mixed up with a single mother who’s rarely alone?”\u003c/p\u003e\n\u003cp\u003e“Nope. I’m thinkin’ we’re gonna hafta get creative to carve out our own alone time.” He kissed a path to her ear. “Tomorrow’s a school day, and the bus picks Hayden up out front, right?”\u003c/p\u003e\n\u003cp\u003e“Yes. No. Umm. Maybe.”\u003c/p\u003e\n\u003cp\u003e“Which is it?”\u003c/p\u003e\n\u003cp\u003e“Shit, I don’t know. Yes, tomorrow is a school day. And God, I cannot think straight when you whisper in my ear, Kane McKay. You could recite the constitutional amendments and I’d get turned on.”\u003c/p\u003e\n\u003cp\u003eKane smiled against her temple. “And the senior bus picks your dad up…early?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“So let’s plan on spending tomorrow—the whole day—alone together, in bed.”\u003c/p\u003e\n\u003cp\u003eShe leaned back to look at him. “That’d be perfect. But I have to work. I’ve already missed—”\u003c/p\u003e\n\u003cp\u003e“Too bad. Doc Monroe said you needed a minimum of five days recovery time. Tomorrow is the fifth day. Doctor’s orders are doctor’s orders, sugar. And it’s my job to make sure they’re followed to the letter.”\u003c/p\u003e\n\u003cp\u003eAfter a brief pause, Ginger giggled.\u003c/p\u003e\n\u003cp\u003eGiggled.\u003c/p\u003e\n\u003cp\u003eThe brilliant, sexy, headstrong bombshell with too many responsibilities and too little personal time…actually giggled like a girl.\u003c/p\u003e\n\u003cp\u003eThat’s when Kane knew he was done for.\u003c/p\u003e\n\u003cp\u003eHe smashed his mouth to hers, kissing her with the passion that he could finally unleash tomorrow.\u003c/p\u003e\n\u003cp\u003eShe matched his every tongue tangling, lip gliding, teeth nipping move, adding a few of her own, until he was dizzy with lust. Why did he have the strangest urge to break out into song like some cheesy romantic comedy hero?\u003c/p\u003e\n\u003cp\u003eHero. Right. He was far from being a hero, but it looked as if he was about to get the girl of his dreams—for one day, anyway.\u003c/p\u003e\n\u003cp\u003eKane eased back from the reckless kiss, pressing his forehead to hers.\u003c/p\u003e\n\u003cp\u003e“Is it tomorrow yet?” she murmured. \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-16.html","bookId":2689,"creation":"Oct 5, 2019 10:17:19 AM","modification":"Oct 5, 2019 10:17:19 AM"}
