{"id":70544,"no":25,"title":"Page 25","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHayden said, “We’re staying for the after party, right Mom?”\u003c/p\u003e\n\u003cp\u003eHer gaze hooked Kane’s and his blank expression felt like a punch in the solar plexus. “I’m not sure.”\u003c/p\u003e\n\u003cp\u003e“Aw, please? That’s when we watch a movie and eat popcorn and stuff. Buck sneaks us candy too.”\u003c/p\u003e\n\u003cp\u003e“We always have such a good time with the boys, don’t we, Buck?” With saccharine sweetness, Daphne said, “If you have other plans, Hayden is welcome to sit with us. He usually does since he always seems to be here by himself.”\u003c/p\u003e\n\u003cp\u003eOoh. Snap.\u003c/p\u003e\n\u003cp\u003e“Please?” Hayden pleaded.\u003c/p\u003e\n\u003cp\u003eKane said not a word.\u003c/p\u003e\n\u003cp\u003e“We’ll see.”\u003c/p\u003e\n\u003cp\u003e“But Mom—”\u003c/p\u003e\n\u003cp\u003e“I said we’ll see. Excuse me.” She spun on her heel and dodged kids on her way to the punchbowl.\u003c/p\u003e\n\u003cp\u003eHer hand shook as she poured the creamy lime green goo into a plastic cup. She grabbed a brownie.\u003c/p\u003e\n\u003cp\u003eGinger hadn’t attended many of these functions, believing, probably mistakenly, that Hayden needed guy time, whether it was with Kane or with the other boys in the program. Now as she looked around, she saw she was in the minority. Most mothers were here with their sons.\u003c/p\u003e\n\u003cp\u003eDid people think she didn’t show up because she didn’t care? Or she was too busy? Did they think she used the Little Buddies program as a daycare service?\u003c/p\u003e\n\u003cp\u003eOh. God. What if people assumed she thought that her participation in the program was beneath her?\u003c/p\u003e\n\u003cp\u003eShe’d run into that lawyers-are-idiots mindset many times. Or worse, lawyers-are-money-grubbing-charlatans. Or lawyers talk above everyone else. Even Kane had made a couple of cracks about not being on her intellectual level.\u003c/p\u003e\n\u003cp\u003eNormally she couldn’t give a rip what other people thought about her, but it bothered her to think they were feeling sorry for Hayden because of her actions—or lack thereof.\u003c/p\u003e\n\u003cp\u003e“If you have things to do today, Red, I can run Hayden home after the movie. No big deal.”\u003c/p\u003e\n\u003cp\u003eNo big deal. Maybe not to Kane, but it was to her. Rather than snapping at him, Ginger stuffed the entire brownie in her mouth. She chewed. And chewed.\u003c/p\u003e\n\u003cp\u003eAnd chewed.\u003c/p\u003e\n\u003cp\u003eDammit. It hadn’t looked that big on the napkin.\u003c/p\u003e\n\u003cp\u003eKane stepped in front of her. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003eShe pointed to her mouth and chewed. Then she took a swig of the punch and about gagged. She hated lime sherbet and mixed with 7-Up? It tasted like pond scum. She swallowed the sticky lump, but she still had to clear her throat several times. “Thanks for the offer, but I’m taking Hayden with me.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“I don’t have to explain my reasons to you, Kane.”\u003c/p\u003e\n\u003cp\u003e“Yes, you do, when he’s looked forward to this movie day for the last couple weeks.”\u003c/p\u003e\n\u003cp\u003eWhy hadn’t she known that about her son? Ginger hated to be on the defensive and her first response was always to lash out. “I’m Hayden’s parent, you aren’t.”\u003c/p\u003e\n\u003cp\u003eHis blue eyes turned ice cold.\u003c/p\u003e\n\u003cp\u003eBut she’d stepped in it too deeply to back down. “I’ve been working late nights this week. I’ve barely seen him so I planned something special for the two of us. Besides, it seems you’ve already lined up an after-party movie date with Lock and Daphne. I wouldn’t want Hayden to be a third wheel.”\u003c/p\u003e\n\u003cp\u003e“Don’t punish Hayden for your jealousy.”\u003c/p\u003e\n\u003cp\u003e“Me? Jealous? Please.”\u003c/p\u003e\n\u003cp\u003e“Daphne is an annoyance to me. That’s all. But you? You, are…” He snarled, “If I wasn’t tryin’ so goddamn hard to keep my cool right now…”\u003c/p\u003e\n\u003cp\u003e“You’d what?” she taunted.\u003c/p\u003e\n\u003cp\u003eHis voice dropped to a low rumble. “I’d throw you over my shoulder, take you home and spank you.”\u003c/p\u003e\n\u003cp\u003eThe gleam in his eye suggested his idea of spanking would only have the slightest playful edge.\u003c/p\u003e\n\u003cp\u003eSomething warm and liquid pooled in her belly, despite the anger still lingering in the air between them.\u003c/p\u003e\n\u003cp\u003eKane stepped back and rubbed the bridge of his nose. “Look. Whatever you decide to do, at least let Hayden stay for the contest announcement winners.”\u003c/p\u003e\n\u003cp\u003e“Fine.”\u003c/p\u003e\n\u003cp\u003e“And, counselor?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHis gaze landed on her mouth. “You’ve got brownie in your teeth.”\u003c/p\u003e\n\u003cp\u003eDamn man. At least he hadn’t pointed out her food avoidance tactic again.\u003c/p\u003e\n\u003cp\u003eAfter a quick trip to the bathroom to remove the brownie evidence, Ginger struck up a conversation with Hayden’s first grade teacher. She ignored Kane McKay, although it was difficult with the way Hayden was practically hanging off him.\u003c/p\u003e\n\u003cp\u003eMaybe Hayden had gotten the idea from Daphne.\u003c/p\u003e\n\u003cp\u003eOoh. Double snap.\u003c/p\u003e\n\u003cp\u003eThe announcement of the contest winners quieted the room. Hayden won third place and a red ribbon.\u003c/p\u003e\n\u003cp\u003eTwo older kids took the top spots. A lot older. How long were boys allowed to remain in the Little Buddies program anyway? She’d never thought to ask and wow, did that make her feel even more out of the loop.\u003c/p\u003e\n\u003cp\u003eHayden bounded over, waving his ribbon, Kane meandering behind him. “I got third!”\u003c/p\u003e\n\u003cp\u003e“I see. That’s awesome. I’m proud of you. Grandpa will be excited for you too.”\u003c/p\u003e\n\u003cp\u003e“Are we staying for the movie?” he asked.\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“But—”\u003c/p\u003e\n\u003cp\u003e“If you argue, maybe I won’t take you to Spearfish.”\u003c/p\u003e\n\u003cp\u003eHis eyes widened beneath his glasses. “I didn’t know we were going to Spearfish.”\u003c/p\u003e\n\u003cp\u003eNeither did I. “That’s because it’s a surprise.”\u003c/p\u003e\n\u003cp\u003eHayden looked torn. He glanced at the volunteers setting up the movie screen and the chairs, then at Kane. Then back at her.\u003c/p\u003e\n\u003cp\u003eKane put his hand on Hayden’s shoulder. “Go on and have a good time with your mom. She mentioned she’d worked late all week and she was lookin’ forward to spendin’ time with you. We can catch the next movie, okay?”\u003c/p\u003e\n\u003cp\u003e“Okay. Thanks, Buck. See you later.”\u003c/p\u003e\n\u003cp\u003e“Drive safe and have fun,” Kane said to her and walked away. Back to Daphne.\u003c/p\u003e\n\u003cp\u003eAnd whose fault is that?\u003c/p\u003e\n\u003cp\u003eGinger let Hayden pick out a new model airplane at the hobby store. She’d also bought him a new Xbox game. The kid’s athletic shoes were too small. While Hayden tried on every pair in the store, she browsed the snow boot section. She found a pair that weren’t…hideous. Would Kane be happy she’d taken his warnings about frostbitten toes seriously?\u003c/p\u003e\n\u003cp\u003eHe’d probably be happier if you owned up to the fact you were consumed by the green-eyed monster today and probably deserved the spanking he’s threatened.\u003c/p\u003e\n\u003cp\u003eWhy did the suggestion of Kane’s big hand connecting with her bare ass cause her belly to flutter?\u003c/p\u003e\n\u003cp\u003eHis growling challenge brought out a strangely submissive need—another new feeling for her.\u003c/p\u003e\n\u003cp\u003e“Mom?”\u003c/p\u003e\n\u003cp\u003eShe focused on her son. “Sorry. What did you say?”\u003c/p\u003e\n\u003cp\u003e“Can I buy this for Buck?”\u003c/p\u003e\n\u003cp\u003eThe ball cap in his hand was the same midnight blue as Kane’s eyes. Above the bill was a patch that read Superstar! in red, white and blue lettering.\u003c/p\u003e\n\u003cp\u003e“He likes to wear ball caps when he plays poker with his cousins. He told me the luck had run out of the last one. I think this one would bring him good luck.”\u003c/p\u003e\n\u003cp\u003e“It’s very nice you’re thinking of him.”\u003c/p\u003e\n\u003cp\u003e“He’s always bringing me cool stuff and I never give him nothin’—”\u003c/p\u003e\n\u003cp\u003e“Anything,” Ginger automatically corrected.\u003c/p\u003e\n\u003cp\u003e“I never give him anything, well, except the stuff I’ve made for him.”\u003c/p\u003e\n\u003cp\u003eDid Kane keep the Lego cars and airplanes, and robot inventions Hayden gave him? Did he display them around his house? Or hide them in a drawer?\u003c/p\u003e\n\u003cp\u003eYou’d know if you’d ever been to Kane’s house.\u003c/p\u003e\n\u003cp\u003eThat jarred her. She knew he lived in a trailer on McKay land off of Highway 14A. Hayden had spent time out there, considerable time in the summer. Which was why it seemed weird she’d never picked her son up at Kane’s house. Kane had always brought Hayden home.\u003c/p\u003e\n\u003cp\u003eMaybe it was time she went to him. She owed him an apology anyway—she had been jealous.\u003c/p\u003e\n\u003cp\u003e“Come on, Mom, let’s go.”\u003c/p\u003e\n\u003cp\u003eHayden fell asleep on the way home. Ginger’s thoughts were as scattered as the patches of snow blowing across the interstate. By the time they reached home, it was after eight and they were both starving.\u003c/p\u003e\n\u003cp\u003eAfter a quick supper, she was still restless.\u003c/p\u003e\n\u003cp\u003eHer father’s interest in model airplane building had rubbed off on his grandson. They conspired on the best way to start this newest project and Ginger knew they’d be engrossed all night.\u003c/p\u003e\n\u003cp\u003eShe rarely went out on the weekends. Definitely never just happened to “drop by” a man’s house more than twenty miles away. She slipped on an emerald green cashmere sweater with a deep “V” in the front that showcased her cleavage. She shimmied on a pair of western jeans. She fluffed her hair. Touched up her makeup. And put on her new sheepskin-lined snow boots.\u003c/p\u003e\n\u003cp\u003eHer father noticed her improved appearance, but didn’t comment. But Hayden said, “Hey, Mom, where you going?”\u003c/p\u003e\n\u003cp\u003e“Out for a little while. Grandpa’s in charge, so when he says go to bed, I expect you to listen to him.”\u003c/p\u003e\n\u003cp\u003eShe kissed the top of his head. “See you in the morning.” She bussed her father’s cheek and whispered, “I have my cell if you need anything. Don’t wait up.”\u003c/p\u003e\n\u003cp\u003eHer nerves nearly got the best of her when she pulled up to Kane’s trailer and saw four other pickups parked in the drive. Was he having a party?\u003c/p\u003e\n\u003cp\u003eWhat if one of those trucks was Daphne’s?\u003c/p\u003e\n\u003cp\u003eShe stomped up the steps and pounded on the aluminum screen door.\u003c/p\u003e\n\u003cp\u003eThe porch light went on. The inner door opened. A tall, lanky and deeply dimpled cutie poked his head out. “Please tell me that you’re the surprise entertainment. And you’ll be actin’ out the, ‘I’m havin’\u003c/p\u003e\n\u003cp\u003ecar trouble and these winter clothes are so constricting’ fantasy.”\u003c/p\u003e\n\u003cp\u003e“No pasties under my coat. But I can come back later if this is a bad time?”\u003c/p\u003e\n\u003cp\u003eThe kid was jerked out of the doorway and Kane opened the screen door. “Ginger? What the devil are you doin’ here?” \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-25.html","bookId":2689,"creation":"Oct 5, 2019 10:17:19 AM","modification":"Oct 5, 2019 10:17:19 AM"}
