{"id":70545,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNot good. “Sorry to disappoint you. Sounds like you were expecting a stripper?” she said tightly.\u003c/p\u003e\n\u003cp\u003e“For Christsake, Dalton, what the hell did you say to her?” Kane shook his head at whatever was said behind him. “Ignore my bonehead cousin and come on in.”\u003c/p\u003e\n\u003cp\u003eAll of a sudden this seemed like a really lousy idea. “I didn’t mean to crash your party.”\u003c/p\u003e\n\u003cp\u003e“It ain’t a party. Just a poker game and…Jesus Christ. Are you wearing…snow boots?”\u003c/p\u003e\n\u003cp\u003eShe swiveled her toe in the snow. “Yes. That’s why I came over.”\u003c/p\u003e\n\u003cp\u003eHis intense gaze didn’t waver from her eyes. “You drove all the way out here to show me your new snow boots?”\u003c/p\u003e\n\u003cp\u003e“Yes, since you nag at me for not wearing proper winter wear, I thought I’d prove that I do listen to you. You are a smart man, who’s usually right, and I am an idiot.”\u003c/p\u003e\n\u003cp\u003eKane continued to give her an inscrutable look.\u003c/p\u003e\n\u003cp\u003e“Shit. Sorry. Dumb idea. I’ll go.”\u003c/p\u003e\n\u003cp\u003eThen he was right in her face. “You take one step off the porch, Red, and I’ll tackle you in the snow and drag your ass inside my house by the heels of your new snow boots.”\u003c/p\u003e\n\u003cp\u003eOh. Wow. That caveman growl was sexy as hell.\u003c/p\u003e\n\u003cp\u003e“What the fuck, Kane? I know your mama raised you better than to let a beautiful woman shiver outside in this frigid weather. Come on in, darlin’. I’ll warm you up.”\u003c/p\u003e\n\u003cp\u003eLaughter.\u003c/p\u003e\n\u003cp\u003e“You touch her, I break your hand,” Kane snarled.\u003c/p\u003e\n\u003cp\u003eReally Neanderthal behavior. Really hot behavior.\u003c/p\u003e\n\u003cp\u003eKane grabbed her by her coat sleeve and led her inside.\u003c/p\u003e\n\u003cp\u003eFour guys—all dark-haired, ranging in age from early twenties to late twenties—grinned at her and crowded around her, despite Kane’s back-off vibe.\u003c/p\u003e\n\u003cp\u003e“Hey, Ginger, nice to see you,” Bennett McKay said. “You’re lookin’ fantastic as usual.”\u003c/p\u003e\n\u003cp\u003eKane made a growling noise.\u003c/p\u003e\n\u003cp\u003e“Thanks, Ben.”\u003c/p\u003e\n\u003cp\u003eBrandt McKay leaned forward. “I ain’t gonna offer my hand, bein’s psycho here—” he pointed to Kane, “—would probably cut it off. But I’ll echo Ben’s sentiments. You are lookin’ mighty fine tonight.”\u003c/p\u003e\n\u003cp\u003e“Thank you, Brandt. Is every one of you McKays born with a silver tongue?”\u003c/p\u003e\n\u003cp\u003e“Absolutely,” the cute, lanky one said. “The more we use our tongues the better we get with them.”\u003c/p\u003e\n\u003cp\u003eHe held out his hand. “Dalton McKay, at your service.”\u003c/p\u003e\n\u003cp\u003eGinger bit back a smile the same time Kane reached around and cuffed the impudent Dalton in the back of the head. “Dalton, don’t make me grind you into dust.”\u003c/p\u003e\n\u003cp\u003e“Always with the violence, cuz. Do you want Miz Ginger here to think we’re all as uncivilized as you?” Tell McKay winked at her. “Some of us do have manners.”\u003c/p\u003e\n\u003cp\u003eGinger had grown up surrounded by hot guys in California. Surfer types. The All-American types.\u003c/p\u003e\n\u003cp\u003eThe brooding types. The small town sports hero wannabe Hollywood-star types. But the Wyoming McKays were in a class by themselves. Talk about an irresistible natural charm. Lord. No wonder every woman wanted a piece of them.\u003c/p\u003e\n\u003cp\u003e“Speaking of bad manners, I’m sorry I interrupted.”\u003c/p\u003e\n\u003cp\u003eKane said, “No, they were just leavin’.” He stared at each one of his cousins hard.\u003c/p\u003e\n\u003cp\u003e“Ah, yeah. Right. Poker night is over at…ten o’clock on a Saturday night?” Ben said, glancing at his watch.\u003c/p\u003e\n\u003cp\u003e“I’m tired of givin’ all my money to Dalton anyway,” Tell complained. “Let’s hit the Golden Boot.”\u003c/p\u003e\n\u003cp\u003e“Hell yeah,” Dalton said. “I’ll buy the first round.”\u003c/p\u003e\n\u003cp\u003e“You guys do what you want. I’m out. I’m headin’ home,” Brandt said.\u003c/p\u003e\n\u003cp\u003e“Home?” Dalton repeated.\u003c/p\u003e\n\u003cp\u003eBrandt glared at him.\u003c/p\u003e\n\u003cp\u003e“Dalton. Let it be,” Tell warned.\u003c/p\u003e\n\u003cp\u003e“The fuck I will. We both know he ain’t goin’ home, bein’s she called less than ten minutes ago.”\u003c/p\u003e\n\u003cp\u003eDalton sneered. “Forget about her—”\u003c/p\u003e\n\u003cp\u003eBoth Brandt and Tell cuffed their younger brother upside the head, shutting him up. “Thanks for the game, Kane. We’ll see you in church tomorrow mornin’, right?”\u003c/p\u003e\n\u003cp\u003e“Get the fuck out.”\u003c/p\u003e\n\u003cp\u003eAmused male laughter.\u003c/p\u003e\n\u003cp\u003eGinger ducked her head to keep from joining in.\u003c/p\u003e\n\u003cp\u003eFour men donned boots, hats and outwear, taking their own sweet time, bullshitting among themselves, trying to engage her in conversation, while Kane folded his arms over his chest and glared at them.\u003c/p\u003e\n\u003cp\u003eFinally the trucks roared off and they were alone.\u003c/p\u003e\n\u003cp\u003eKane began to stalk her with that look in his eye. The look that told her when he caught her, he’d do all sort of naughty, wicked things to her, without apology, and probably, without her permission.\u003c/p\u003e\n\u003cp\u003eGinger stopped.\u003c/p\u003e\n\u003cp\u003eKane didn’t until he crowded her against the wall. “Why are you really here?”\u003c/p\u003e\n\u003cp\u003eDamn, he smelled good. Even with whiskey on his breath. His body heat permeated her clothing, seeping into her skin, setting her needs on fire. She wanted to lick him up one side and down the other.\u003c/p\u003e\n\u003cp\u003eBury her face in his neck. His chest. His groin.\u003c/p\u003e\n\u003cp\u003e“Ginger?” he prompted. “Are you gonna answer the question?”\u003c/p\u003e\n\u003cp\u003eQuestion. Right. Refocus. “Umm. I’m here because you were right today. I lied. I was jealous of Daphne. Really jealous and I feel stupid about it because that’s never happened to me before.”\u003c/p\u003e\n\u003cp\u003eHe offered her a feral smile. “A lawyer recanting? Sugar, you sure your license to practice law ain’t gonna be revoked?”\u003c/p\u003e\n\u003cp\u003e“Funny.”\u003c/p\u003e\n\u003cp\u003e“What else?”\u003c/p\u003e\n\u003cp\u003e“I wanted to tell you I’m sorry for acting like a jerk to you. And I’m also sorry for the snotty way I pointed out that I’m Hayden’s parent, when you’ve been so good for him, Kane. I see you with him and I—\u003c/p\u003e\n\u003cp\u003e”\u003c/p\u003e\n\u003cp\u003e“Red,” he said sharply.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Shut up.”\u003c/p\u003e\n\u003cp\u003eBut she couldn’t seem to stop babbling. “I’m sorry I broke up your poker party too. And. Well. Umm.\u003c/p\u003e\n\u003cp\u003eThat’s it. I should be going.”\u003c/p\u003e\n\u003cp\u003e“Like hell.” Then Kane crushed her lips beneath his and rocked her world with a tongue-thrusting kiss.\u003c/p\u003e\n\u003cp\u003eThen his hands were tearing at her clothes. Coat. Gone. Shirt. Hanging open. Jeans. Unbuttoned and unzipped. Kane’s hand followed the curve of her belly over the rise of her mound. He slipped one finger between her wet folds and plunged it inside her pussy.\u003c/p\u003e\n\u003cp\u003eShe gasped, breaking the kiss.\u003c/p\u003e\n\u003cp\u003eKane nestled his face in her cleavage, rubbing his beard across the tops of her breasts. “Take them off.”\u003c/p\u003e\n\u003cp\u003eA little dazed, she said, “What? The boots?”\u003c/p\u003e\n\u003cp\u003e“The boots, the jeans, your panties. All of it. Off. Now.”\u003c/p\u003e\n\u003cp\u003e“You’ll have to quit finger fucking me.”\u003c/p\u003e\n\u003cp\u003eHis mouth brushed her ear and he removed his hand. “I love it when you talk dirty. I love it more when you act dirty.”\u003c/p\u003e\n\u003cp\u003eGinger pushed him back a step and kicked off her boots. Her hands weren’t cooperating and she struggled to peel off her jeans. Once she was naked from the waist down, Kane pressed her against the wall again, plastering his chest to hers. His cock dug into her belly.\u003c/p\u003e\n\u003cp\u003eShe realized he’d only lowered his Wranglers past his knees. But he had unsnapped his shirt so she could run her hands all over him. Thoughtful.\u003c/p\u003e\n\u003cp\u003e“Spread your legs.”\u003c/p\u003e\n\u003cp\u003eThe instant she widened her stance, his fingers were pushing inside her again. He fucked in and out while using his teeth on her nipple. Then he pulled his fingers free and held them to her lips with a guttural\u003c/p\u003e\n\u003cp\u003e“Lick them.”\u003c/p\u003e\n\u003cp\u003eKeeping her eyes locked on his, Ginger parted her lips and sucked his fingers inside her mouth. The taste of her own juices on the roughness of his skin sent a spike of desire straight to her core. She felt her pussy soften. Moisten.\u003c/p\u003e\n\u003cp\u003eHe tugged his fingers free and traced the damp digits down her chin, her throat, between her breasts and right back into her pussy. He thrust harder, deeper.\u003c/p\u003e\n\u003cp\u003eThe friction only made her eager for the thicker, longer length of his cock to fill her completely.\u003c/p\u003e\n\u003cp\u003e“Kane—”\u003c/p\u003e\n\u003cp\u003eHis mouth cut off her protest. The wild, desperate kiss had her whimpering, clawing at him.\u003c/p\u003e\n\u003cp\u003eKane’s tongue and fingers slid free from inside her body simultaneously. His hands circled her waist.\u003c/p\u003e\n\u003cp\u003e“Jump up and wrap your legs around me.”\u003c/p\u003e\n\u003cp\u003eGinger was too far gone to care about him bearing too much of her weight. Those big, strong, wonderfully rough hands grabbed a handful of her ass, holding her in place as his cock impaled her.\u003c/p\u003e\n\u003cp\u003e“Jesus, you feel amazing.” He rammed into her hard. “Wet.”\u003c/p\u003e\n\u003cp\u003e“More.”\u003c/p\u003e\n\u003cp\u003e“Hang on.”\u003c/p\u003e\n\u003cp\u003eShe wreathed her arms around his neck, scattering kisses and little love bites wherever her mouth landed.\u003c/p\u003e\n\u003cp\u003eKane made sexy, masculine groans and grunts as he fucked her like a man possessed.\u003c/p\u003e\n\u003cp\u003eHarsh breathing, the scent of sex, the rapid pistoning of Kane’s pelvis spun Ginger out of control. She flew apart on his next thrust, digging her nails into his back, arching hard for more contact on her clit, squeezing her legs, her ass, her pussy, trying to make the orgasm last as long as possible.\u003c/p\u003e\n\u003cp\u003eAnd it did.\u003c/p\u003e\n\u003cp\u003eKane followed her over the edge. She swallowed his surprised shout in a blistering kiss, holding on as he came.\u003c/p\u003e\n\u003cp\u003eHe slowed his frantic thrusting, then stopped moving entirely, gentling the kiss. Ginger knew she made mewling, whimpering moans, but she loved his surprising tenderness in the aftermath of their no-holds-barred passion.\u003c/p\u003e\n\u003cp\u003eWetness trickled down the inside of her thigh as Kane brought her back down to her feet. Luckily the wall held her up because her legs were wobbly.\u003c/p\u003e\n\u003cp\u003eThey were both still breathing hard.\u003c/p\u003e\n\u003cp\u003eKane strung a line of kisses from the hollow of her throat, across her jawline to the section of skin in front of her ear. “That was the very best apology I’ve ever received.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “So I’m forgiven?”\u003c/p\u003e\n\u003cp\u003e“And then some.” He nuzzled her cheek. Her throat. Her hair. “I wish you could stay with me tonight.” \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-26.html","bookId":2689,"creation":"Oct 5, 2019 10:17:19 AM","modification":"Oct 5, 2019 10:17:19 AM"}
