{"id":70549,"no":30,"title":"Page 30","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eDalton’s eyes widened. “Christ, cuz, you bet that kinda money on keepin’ your dick in your pants?”\u003c/p\u003e\n\u003cp\u003e“It ain’t a cash bet. If I can do it, Marshall’s givin’ me a quarter share in this up and comin’ buckin’\u003c/p\u003e\n\u003cp\u003ebull named Atomic Fireball.” Chase pointed his beer bottle at the guys at the table. “So you all need to be getting some serious ass to make up for my lack of it.”\u003c/p\u003e\n\u003cp\u003eTell and Dalton high-fived, and Tell said, “We’ve got ya covered.”\u003c/p\u003e\n\u003cp\u003e“With who?” Brandt demanded.\u003c/p\u003e\n\u003cp\u003e“The Sweeney twins. Kristol and Marisol. And here’s the kicker.” Dalton leaned in. “They wanna play musical brothers. Hell, when we go out, we ain’t ever sure which one we’ll end up with that night.”\u003c/p\u003e\n\u003cp\u003eThey high-fived again.\u003c/p\u003e\n\u003cp\u003eKane shifted in his seat. He remembered those days. Mostly. Quite a few days, even a few months were a blur, but he’d been in plenty of threesomes with Colt and their woman of the night. Funny thing was, he couldn’t recall the faces of the female players.\u003c/p\u003e\n\u003cp\u003eBut he could recount every freckle on Ginger’s skin.\u003c/p\u003e\n\u003cp\u003eWhat did that say about him?\u003c/p\u003e\n\u003cp\u003eYou’re pussy-whipped, boy. Big time.\u003c/p\u003e\n\u003cp\u003e“How about you, Bennett?” Chase asked.\u003c/p\u003e\n\u003cp\u003e“I’ve got a hook up whenever I want it.” He shrugged. “And gentlemen don’t kiss and tell.”\u003c/p\u003e\n\u003cp\u003e“Since when are the McKays considered gentlemen?” Dalton volleyed back.\u003c/p\u003e\n\u003cp\u003eLaughter.\u003c/p\u003e\n\u003cp\u003eKane expected the question to be directed at him next, because none of his cousins had uttered a peep about Ginger showing up on his doorstep two weeks ago. And it’d been apparent the only briefs he and the fiery redhead had intended to discuss were the ones on his body.\u003c/p\u003e\n\u003cp\u003eBrandt’s phone rang.\u003c/p\u003e\n\u003cp\u003eTell and Dalton exchanged a look before Brandt picked up.\u003c/p\u003e\n\u003cp\u003e“Jessie? Why’re you—” He stood abruptly. “No. It’s okay. I can be there in twenty-five minutes.\u003c/p\u003e\n\u003cp\u003eCome on, Jess, calm down. I’m on my way.” Brandt clicked his phone shut. “Sorry guys, I’ve gotta go.”\u003c/p\u003e\n\u003cp\u003e“What’s goin’ on this time?” Dalton asked. “Is her kitty-cat stuck in a tree?”\u003c/p\u003e\n\u003cp\u003e“And big, brave, Brandt is the only one who can rescue her poor little pussy?”\u003c/p\u003e\n\u003cp\u003eKane sucked in a breath. Talk about harsh.\u003c/p\u003e\n\u003cp\u003eBrandt stiffened. “Fuck off, both of you. Jessie had a pipe freeze in her trailer.”\u003c/p\u003e\n\u003cp\u003e“So have her call a plumber,” Tell said.\u003c/p\u003e\n\u003cp\u003e“Tomorrow,” Dalton added.\u003c/p\u003e\n\u003cp\u003e“Why you guys bein’ such a dicks about me wantin’ to help her?” Brandt demanded.\u003c/p\u003e\n\u003cp\u003eTell leaned back and crossed his arms over his chest. “Because she’s always needin’ your help, bro.\u003c/p\u003e\n\u003cp\u003eAnd every time she calls, you drop whatever you’re doin’ and go to her.”\u003c/p\u003e\n\u003cp\u003e“Run to her is more like it,” Dalton corrected.\u003c/p\u003e\n\u003cp\u003e“Do you need me to remind you that dad kicked her off the place she shared with Luke? Left her damn near destitute?”\u003c/p\u003e\n\u003cp\u003e“No. It’s the reason we all took a stand against Dad.” Tell spit tobacco juice into an empty beer can.\u003c/p\u003e\n\u003cp\u003e“Look, we get that you have feelings for her, Brandt. And without bein’ an ass, she ain’t reciprocating those feelings or else you’d be together.”\u003c/p\u003e\n\u003cp\u003e“Luke’s been dead a little over a year,” Brandt snapped. “She ain’t hardly had time to get used to bein’ a wife and then she was a widow. So yeah, maybe I feel guilty for what Dad done. Hell, I feel guilty for what Luke done to her. What am I supposed to do?”\u003c/p\u003e\n\u003cp\u003e“Say no,” Dalton said quietly.\u003c/p\u003e\n\u003cp\u003eBrandt whirled on him. “What the fuck did you say?”\u003c/p\u003e\n\u003cp\u003e“You heard me. Say no.”\u003c/p\u003e\n\u003cp\u003e“She’s usin’ you. Knowin’ Jessie, she ain’t even aware she’s doin’ it.”\u003c/p\u003e\n\u003cp\u003eTell nodded and Dalton kept talking. “In the year before Luke died, she’d started callin’ you when she couldn’t rely on Luke to get anything done. Don’t deny it.”\u003c/p\u003e\n\u003cp\u003eKane’s gut twisted. Brandt carrying a torch for Jessie would only end badly. But he admired Brandt’s brothers for addressing something that’d been building for a long time.\u003c/p\u003e\n\u003cp\u003e“We all care about Jessie. But there comes a point where you’ve gotta man up.”\u003c/p\u003e\n\u003cp\u003eBrandt sagged against the wall as he pulled on his boots in angry, jerking movements. “Meanin’\u003c/p\u003e\n\u003cp\u003ewhat?”\u003c/p\u003e\n\u003cp\u003e“Let her know you don’t wanna be her handyman. If she ain’t interested in bein’ with you, walk away.” Tell’s voice dropped. “Me’n Dalton see how it’s rippin’ you up. Seein’ her everyday… We’re all still hurtin’ about Luke. Seein’ her makes it worse.”\u003c/p\u003e\n\u003cp\u003e“For some of us more than others.” Brandt stomped his feet into his boots and clapped his hat on his head.\u003c/p\u003e\n\u003cp\u003e“What the fuck’s that supposed to mean?” Dalton demanded.\u003c/p\u003e\n\u003cp\u003e“Grieving over Luke hasn’t stopped you and Tell from getting all the pussy you possibly can every goddamn weekend, has it?”\u003c/p\u003e\n\u003cp\u003eTell and Dalton stood simultaneously.\u003c/p\u003e\n\u003cp\u003e“Just cause you can’t get the pussy you want—Jessie’s—don’t mean you can take it out on us,”\u003c/p\u003e\n\u003cp\u003eDalton said hotly.\u003c/p\u003e\n\u003cp\u003e“There are plenty of women around here who’d take you on if you’d take the fuckin’ blinders off,”\u003c/p\u003e\n\u003cp\u003eTell said.\u003c/p\u003e\n\u003cp\u003e“Like the skanky bar rats you two are screwing on a regular basis?” Brandt shot back. “No thanks.”\u003c/p\u003e\n\u003cp\u003e“Fine. Jack off all alone in your trailer until your goddamn hand falls off, thinking about your precious Jessie. But I can guaran-damn-tee she ain’t sitting around home, thinking about you,” Dalton sneered.\u003c/p\u003e\n\u003cp\u003eKane intervened. “Enough. Everybody sit down and calm down.”\u003c/p\u003e\n\u003cp\u003e“Shut up, Kane. This don’t concern you,” Tell said.\u003c/p\u003e\n\u003cp\u003e“The fuck it don’t. I won’t sit here and watch brothers cut each other down to the bone just because you can. Just because you’re all hurtin’. Jesus. I can’t imagine what it’d be like to lose Kade.” He gestured to Bennett and Chase. “I’d bet they feel the same way about Quinn. For Christsake, our fathers can still turn on one another in a heartbeat. Don’t make their mistakes. Don’t do something or say something you can’t undo.”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eDalton spoke first. “Will you at least help us talk some sense into him? Bein’ at Jessie’s beck and call ain’t good for either of them. Jessie needs to learn to do things herself.”\u003c/p\u003e\n\u003cp\u003eKane looked at Brandt, slumped against the door. “Come clean, cuz. Do they have a reason to be concerned about this?”\u003c/p\u003e\n\u003cp\u003e“Do we have a reason to be concerned about you and Colt takin’ cheap shots at each other every chance you get? Jesus. What’s goin’ on with you two?”\u003c/p\u003e\n\u003cp\u003eI don’t know. They’d never gone this long without trying to patch up their differences. Kane pointed at Brandt. “This ain’t about me. So I’ll ask you again. Do your brothers have a reason to be concerned?”\u003c/p\u003e\n\u003cp\u003eBrandt didn’t answer immediately. Finally, he said, “I don’t know how to say no to her. The hell of it is, I don’t want to say no to her. I wanna be there for her because Luke never was. I fuckin’ hate that she only sees me as the guy who’ll change her battery, or help her haul feed, or fix her goddamn pipes. I shouldn’t care about her so damn much. She’s my brother’s wife.”\u003c/p\u003e\n\u003cp\u003eNo one corrected him that she was now Luke’s widow.\u003c/p\u003e\n\u003cp\u003e“Your brothers are right,” Bennett said. “You have to find out how Jessie feels. Maybe part of the reason she’s callin’ you all the time is because she wants you. Havin’ you do ‘man stuff’ for her is the only way she can get you to come over.”\u003c/p\u003e\n\u003cp\u003e“You really think so?” Brandt asked.\u003c/p\u003e\n\u003cp\u003eHeads nodded. None of them really believed it, but they were too conscious of Brandt’s difficult position to point it out.\u003c/p\u003e\n\u003cp\u003e“Look, sorry I was a dick. I appreciate your concern and I’ll think over what you said.” He gave his brothers an apologetic look. “All of you.”\u003c/p\u003e\n\u003cp\u003eThen he was gone.\u003c/p\u003e\n\u003cp\u003eBeer was consumed in the quiet. Kane changed out all the poker chips on the table for real money, just to have something to do.\u003c/p\u003e\n\u003cp\u003e“Well, that was fun… not,” Tell said.\u003c/p\u003e\n\u003cp\u003e“Good strategy, bringing it up in front of witnesses when we weren’t out feedin’ cattle or something,”\u003c/p\u003e\n\u003cp\u003eDalton said to Tell. “He’da put us both on the ground and beat the livin’ shit outta us.”\u003c/p\u003e\n\u003cp\u003eChase looked back and forth between them. “Seriously?”\u003c/p\u003e\n\u003cp\u003e“Uncle Carson’s kids ain’t the only ones to settle sibling matters with their fists.” Tell drained his beer. “Christ. Brandt and Luke used to get into a knock-down, drag-out fistfight at least once a month.\u003c/p\u003e\n\u003cp\u003eMe’n Dalton let them have at and stayed on the sidelines. It never solved a damn thing anyway.”\u003c/p\u003e\n\u003cp\u003eYeah, Kane understood that reaction but it’d never seemed to matter to him or Colt. They tended to let fists fly first and then worry about the talking bullshit afterward.\u003c/p\u003e\n\u003cp\u003e“Were their fights about ranch business?”\u003c/p\u003e\n\u003cp\u003e“Sometimes. But mostly, in the last year, they were about Jessie.”\u003c/p\u003e\n\u003cp\u003e“I tell you what. I ain’t ever gonna be at the beck and call of any woman.”\u003c/p\u003e\n\u003cp\u003e“Amen, brother.” Dalton and Tell high-fived. As did Bennett and Chase.\u003c/p\u003e\n\u003cp\u003eFools. He’d love to be at Ginger’s beck and call. He’d just be goddamn happy if she called him at all.\u003c/p\u003e\n\u003cp\u003eIt’d been two days since he’d heard from her.\u003c/p\u003e\n\u003cp\u003eDalton stood. “I ain’t really in the mood to play poker anymore.”\u003c/p\u003e\n\u003cp\u003eTell followed his lead. “Me neither. Thanks, cuz. Keep the beer cold for next time, huh?”\u003c/p\u003e\n\u003cp\u003e“You got it.”\u003c/p\u003e\n\u003cp\u003eChase and Bennett were also donning their winter clothing.\u003c/p\u003e\n\u003cp\u003e“That was a bit of a buzzkill,” Bennett said. \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-30.html","bookId":2689,"creation":"Oct 5, 2019 10:17:19 AM","modification":"Oct 5, 2019 10:17:19 AM"}
