{"id":70556,"no":37,"title":"Page 37","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Then you’d better strip them clothes off and crawl in bed.”\u003c/p\u003e\n\u003cp\u003e“Kane—”\u003c/p\u003e\n\u003cp\u003eHe was right in her face. “No arguin’ with me. Do it. Now.”\u003c/p\u003e\n\u003cp\u003eGinger’s hazel eyes sparked defiance for a second. But she whirled around and stomped to the bedroom. About halfway down the hallway, she tossed out, “This’d better be good, McKay.”\u003c/p\u003e\n\u003cp\u003eAny leniency he might’ve had vanished with that challenge.\u003c/p\u003e\n\u003cp\u003eHe snatched a bottle of lube and his other supplies from the bathroom. He locked the bedroom door and saw the outline of her body beneath the covers. “Ginger, I’m givin’ you a choice. Handcuffs or rope?”\u003c/p\u003e\n\u003cp\u003eSlowly, the covers peeled back. Her hair appeared first, since it stuck straight up from static electricity. “You’re serious.”\u003c/p\u003e\n\u003cp\u003e“Yep. Choose or I will.”\u003c/p\u003e\n\u003cp\u003eGinger smoothed her hair back and studied him. “Rope.”\u003c/p\u003e\n\u003cp\u003eKane lifted his hand and let the length of rope dangle from his fingertips. “On your knees, arms above your head, palms on the mattress.”\u003c/p\u003e\n\u003cp\u003eIt might’ve surprised him that she turned over and assumed the position without argument.\u003c/p\u003e\n\u003cp\u003eHe used a slipknot to bind her wrists, a binding that’d be easy to get out of, if she knew the secret. But if she didn’t, well, that gave him more time to play.\u003c/p\u003e\n\u003cp\u003e“You look gorgeous, all stretched out before me.”\u003c/p\u003e\n\u003cp\u003eShe didn’t respond.\u003c/p\u003e\n\u003cp\u003e“This is where you say, ‘thank you’.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003e“See? That wasn’t so hard. Now widen your knees. That’s good.” Kane climbed behind her. He skimmed his hands over her body, starting at the crease where her ass met her thigh, and moving up her back. “You are cold.” He levered his fully clothed body over her naked form. He placed a kiss on her nape, loving how quickly goose bumps bloomed across her skin.\u003c/p\u003e\n\u003cp\u003e“So warm me up.” She remained with her forehead to the mattress, almost in a submissive manner.\u003c/p\u003e\n\u003cp\u003eKane didn’t give her a warning. His open palm connected with the center of her right ass cheek.\u003c/p\u003e\n\u003cp\u003eShe gasped.\u003c/p\u003e\n\u003cp\u003eHe smacked the left cheek.\u003c/p\u003e\n\u003cp\u003eAnother gasp.\u003c/p\u003e\n\u003cp\u003eThen he went a little wild; the visual of his red handprint on her white skin brought out his primitive side. He peppered her ass with strategically placed swats, some hard, some playful, so Ginger never knew what to expect.\u003c/p\u003e\n\u003cp\u003eHis cock was fully erect and digging into his zipper. Despite being chilled only ten minutes ago, his skin was on fire; he was actually sweating.\u003c/p\u003e\n\u003cp\u003eKane smelled her arousal, saw the slightest movement of her ass pushing back, silently asking for more. He obliged her until he couldn’t stand it. He had to feel that beautifully heated flesh on his face. He had to taste it.\u003c/p\u003e\n\u003cp\u003eHe shoved back, first running his tongue down the crack of her ass. Then he rubbed his face over her flaming butt cheeks, letting his goatee tickle and tease.\u003c/p\u003e\n\u003cp\u003eGinger whimpered. Her hands clenched into fists.\u003c/p\u003e\n\u003cp\u003eKane used his tongue to bathe the red hand marks. Lapping. Licking. Leaving openmouthed kisses from the sexy dimples above her ass cheeks to the curve at the bottom. He lost his mind in the feel of her, the scent of her, her willingness to explore his kinky side without hesitation.\u003c/p\u003e\n\u003cp\u003eHe gripped her lower body at the base of her thighs and lifted, using his thumbs to pull apart her cheeks, revealing that pink pucker and the glistening mouth of her sex. Kane plunged his tongue into her cunt and then dragged it up, over the bud of her anus. He flicked the very tip of his tongue over that tiny closed hole, painting it with his saliva. When he stopped, Ginger made a keening wail, sounding mighty displeased he’d halted his attentions. Then he rammed his tongue in deep and repositioned his hand so his middle finger could rapidly flick her clit.\u003c/p\u003e\n\u003cp\u003eShe came with a half gasp, half scream.\u003c/p\u003e\n\u003cp\u003eAfter the orgasmic pulses stopped and she slumped forward, Kane released his hold on her, smoothing his hands across her still heated skin. He unbuckled his belt, freed his cock from the confines of his zipper and dropped his jeans and his boxers to his knees. He grabbed the bottle of lube and slicked up his shaft.\u003c/p\u003e\n\u003cp\u003eThen he squirted the gel on his fingers and worked both fingers into her ass, preparing her with decisive strokes.\u003c/p\u003e\n\u003cp\u003eHe leaned across her body, bracing his left hand by her left shoulder. “You okay?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh,” was her muffled response.\u003c/p\u003e\n\u003cp\u003e“I’ve decided since you’ve been so good, that it’s time I give back your vibrator.”\u003c/p\u003e\n\u003cp\u003e“Now?”\u003c/p\u003e\n\u003cp\u003e“Yes, right now.” Kane nuzzled the back of her head, breathing in the lavender scent of her shampoo.\u003c/p\u003e\n\u003cp\u003e“My cock pounding into your ass and your vibrator in your cunt. You’ll be double teamed, but by one man.”\u003c/p\u003e\n\u003cp\u003e“Oh God.”\u003c/p\u003e\n\u003cp\u003eHe didn’t need to lube up the vibrator since she was already wet and loose from her orgasm. He inserted the phallus completely into her pussy and turned it on.\u003c/p\u003e\n\u003cp\u003eHer body trembled, from her bound arms to her toes curled into the mattress.\u003c/p\u003e\n\u003cp\u003eKane prodded her tiny entrance, slipping just the cockhead in past the contracting muscle, which tried to keep out the intrusion. Oh hell, between the tightness of her body, the vibration from her sex toy and his anticipation, this wasn’t going to take long. He shoved into her ass until the root of his cock was pressed against her anal opening and his balls slapped against her pussy.\u003c/p\u003e\n\u003cp\u003eGinger arched up.\u003c/p\u003e\n\u003cp\u003eHe stopped, despite how fast his heart hammered. His body shook and it didn’t have a damn thing to do with the vibrator. “How does that feel?”\u003c/p\u003e\n\u003cp\u003e“I can’t even… It feels full. Really, really full.”\u003c/p\u003e\n\u003cp\u003eKane withdrew from her back channel, again letting just the tip remain inside her. He snapped his hips, bumping the vibrator into his groin as he plunged in completely. Then he set to fucking her like a man possessed, his fingers digging into the reddened, soft globes of her ass. The visual was hotter than fire, seeing that hole stretching to accommodate his dick, his big hands spreading her wide and holding her in place for his assault.\u003c/p\u003e\n\u003cp\u003eHis sac was already drawn up. Kane craved the rush of sensation as his cock emptied, feeling those close-fitting anal walls clamping down, milking every ounce of seed from his aching balls.\u003c/p\u003e\n\u003cp\u003eNow, now, now became the rhythm in his head, his blood, his body as he fucked her. He closed his eyes, lost to everything but the overpowering need. When that familiar pulling began at the top of his head, tightening every muscle from his scalp to his Achilles, he groaned. When the first spurt shot out the end of his dick, he gritted out, “Bear down on me, harder. Fucking Christsake that’s good. So goddamn…” He reamed her one last time, letting the white noise of pure sexual pleasure in his head take over, if only for a minute.\u003c/p\u003e\n\u003cp\u003eThe buzzing against the underside of his shaft roused him from that happy pecker place. Staying embedded in her ass, he reached down between them and slid the vibrator out of her cunt, rubbing it up over her slit.\u003c/p\u003e\n\u003cp\u003e“Kane—”\u003c/p\u003e\n\u003cp\u003e“Come for me, sugar.” He nestled the rounded end on her clit and held it there.\u003c/p\u003e\n\u003cp\u003eGinger bucked against him, dislodging the vibrator.\u003c/p\u003e\n\u003cp\u003e“Hold still. Let it happen.”\u003c/p\u003e\n\u003cp\u003eAlthough she stopped wiggling, her breath remained uneven. Kane wanted to press his mouth between her shoulder blades and taste the perspiration dotting her skin. He wanted to lay his head there and hear her heart beating.\u003c/p\u003e\n\u003cp\u003eThen she tensed and the throbbing pulses from her orgasm constricted her anal passage around his dick, and he felt every spasm as she came.\u003c/p\u003e\n\u003cp\u003eKane eased out and retreated to the bathroom to clean up. He returned, placing the cool cloth over her ravaged tissues and unwound the rope.\u003c/p\u003e\n\u003cp\u003eGinger slid forward to rest on her belly and groaned.\u003c/p\u003e\n\u003cp\u003eWas that a good groan? Or a bad groan?\u003c/p\u003e\n\u003cp\u003eHe reached for her hand, noticing the red rope burns on her wrists. Holy shit. What was she supposed to say when her clients saw those rope marks? “Oh, ignore those. My rough and raunchy secret lover likes to tie me up when he fucks me in the ass.”\u003c/p\u003e\n\u003cp\u003eMaybe you should be more worried about what her son will say when he sees them.\u003c/p\u003e\n\u003cp\u003eOr her father.\u003c/p\u003e\n\u003cp\u003eKane froze. What the fuck was wrong with him? Ginger wasn’t some bar wench who was up for anything-goes domination bedroom games. Ginger was a well-respected woman in the community. A mother. A daughter.\u003c/p\u003e\n\u003cp\u003eA classy broad too good for the likes of you.\u003c/p\u003e\n\u003cp\u003eNo kidding. No wonder she didn’t want to go public with their relationship. She probably never would. And once again he was reminded of the chasm between them. How much longer would she be willing to play the dirty-rancher-seduces-the-horny-lawyer bedroom games? Chances were pretty good once she caught sight of the hickeys and rope marks on her body it’d be over.\u003c/p\u003e\n\u003cp\u003eHe lifted her arm, tenderly kissing the red marks. “I got a little rough.”\u003c/p\u003e\n\u003cp\u003eNo answer.\u003c/p\u003e\n\u003cp\u003eHer cell phone rang. Since she didn’t look like she had the energy to pick it up—or maybe she was too embarrassed to look at him—Kane handed it to her without a word.\u003c/p\u003e\n\u003cp\u003eShe rolled onto her back. “Hello? Hey, Hayden. Really? I can’t wait to hear about your adventure.\u003c/p\u003e\n\u003cp\u003eTell Ms. Dunnigan I’ll come and get you. Okay. Bye.” She tossed the phone on the bed. “I need to go to the office right now. I hope the senior bus can deliver Dad home. I really don’t want to dig my car and our van out of the snowdrifts.”\u003c/p\u003e\n\u003cp\u003e“I can help you do all that. But first…” Kane captured her mouth, intending to give her a possessive kiss, but changed his mind at the last second, trying to keep it relaxed.\u003c/p\u003e\n\u003cp\u003eGinger pulled away immediately. “Enough, don’t you think?” She rolled off the bed, snagged her clothes and shut the bathroom door with a decisive click.\u003c/p\u003e\n\u003cp\u003eYeah. The word enough summed up everything he was feeling—and none of it was good.\u003c/p\u003e\n\u003cp\u003eChapter Sixteen\u003c/p\u003e\n\u003cp\u003eBrandt’s cell phone buzzed in his front shirt pocket for the fourth time. He ignored it, knowing it was her. Knowing she was having some other crisis and desperately needed his help.\u003c/p\u003e\n\u003cp\u003eSad thing was he was so desperate for the sound of his brother’s widow’s voice he almost answered it.\u003c/p\u003e\n\u003cp\u003eWhat if she needs you? What if it’s something serious? \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-37.html","bookId":2689,"creation":"Oct 5, 2019 10:17:19 AM","modification":"Oct 5, 2019 10:17:19 AM"}
