{"id":70558,"no":39,"title":"Page 39","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Hello?”\u003c/p\u003e\n\u003cp\u003e“Jessie! I was hopin’ you were around. What are you doin’ right now?”\u003c/p\u003e\n\u003cp\u003eSitting around all dressed up with no place to go. “Not much. What’s up?”\u003c/p\u003e\n\u003cp\u003e“Well, I’m in Moorcroft with a few members of my new dart league team. Guess what? We just kicked the crap outta the Moorcroft Deadly Tips dart team, and we are seriously in the mood to celebrate.\u003c/p\u003e\n\u003cp\u003eAnd I thought, Jessie lives close, I’ll see if she’s in the party mood.”\u003c/p\u003e\n\u003cp\u003e“Where are you?”\u003c/p\u003e\n\u003cp\u003e“Ziggy’s. Come on down. It’ll be fun.”\u003c/p\u003e\n\u003cp\u003e“You surrounded by hot cowboys?”\u003c/p\u003e\n\u003cp\u003eKeely laughed. “Absolutely. And I’ve even got a designated driver lined up so if we get shitfaced, we have a ride.”\u003c/p\u003e\n\u003cp\u003eJessie froze. Sometimes Keely cajoled her McKay male cousins into helping her outwit her five older brothers, since they continued to treat Keely like a twelve-year-old girl. She also knew Brandt had gotten roped into being Keely’s cohort on several occasions. “Who’s lined up as your DD?”\u003c/p\u003e\n\u003cp\u003eThe phone rattled as Keely spoke to someone else. “Hey, darlin’, what’s your name again? Robbie?\u003c/p\u003e\n\u003cp\u003eMy new friend Robbie,” Keely cooed, “has a tryout early tomorrow morning for a team ropin’ event, and he’s not drinkin’ tonight, so he’ll be our DD as long as we dance with him until closing time.” Keely whispered, “He’s hot, Jess, like really freakin’ hot, and he loves to dance as much as you do. You should come and check him out.”\u003c/p\u003e\n\u003cp\u003eShe hesitated.\u003c/p\u003e\n\u003cp\u003e“Please? I haven’t seen you in forever. I’m only in town this one night. When was the last time you went out and had fun?”\u003c/p\u003e\n\u003cp\u003e“It’s been a long damn time, Keely.”\u003c/p\u003e\n\u003cp\u003e“Then I say you’re past due to cut loose.”\u003c/p\u003e\n\u003cp\u003eYears past due. Jessie glanced at her reflection in the window glass above the sink. She didn’t look half-bad for a twenty-six-year-old widow. She wasn’t ready for any kind of intimate relationship, not even a one-night stand, but it’d do her good to make friends in the community. It’d do her good to start her life again.\u003c/p\u003e\n\u003cp\u003eIf you don’t grab this opportunity, you’ll regret it.\u003c/p\u003e\n\u003cp\u003eEvery journey started with one step. It was past time to stop living in the past.\u003c/p\u003e\n\u003cp\u003e“Okay, you convinced me. But you’re buying the first round.”\u003c/p\u003e\n\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003eTwo weeks later…\u003c/p\u003e\n\u003cp\u003eMore snow.\u003c/p\u003e\n\u003cp\u003eKane sipped his coffee and stared out the window to the sea of whiteness. He’d promised Colt he’d pick up a load of cake—supplemental cattle feed—before they all got busy with calving season. Best to wait to see if the road conditions improved before he loaded up the trailer.\u003c/p\u003e\n\u003cp\u003eOn his way to the bedroom, he nearly tripped over Shep, stretched out in the middle of the floor. Shep slunk toward the door.\u003c/p\u003e\n\u003cp\u003e“Ready to go out?”\u003c/p\u003e\n\u003cp\u003eHis tail thumped.\u003c/p\u003e\n\u003cp\u003eKane petted his head. After the dog lumbered outside, Kane started his computer. Might as well get something accomplished besides pining for Ginger.\u003c/p\u003e\n\u003cp\u003eMan. He was so whipped over that woman. Seriously fucking whipped. It was a no-brainer they both enjoyed their explosive sexual chemistry, but they’d clicked out of bed too. Things had changed between them since they’d gotten snowed in. Sure, they’d kept up their lunch dates during the week, but two out of the four times they’d been together, they hadn’t even had sex. They’d had…lunch.\u003c/p\u003e\n\u003cp\u003eAnd the hell of it was, he hadn’t minded. He liked talking to her. Laughing with her. Making sandwiches with her. Ginger hadn’t invited him over for supper again, but she’d tagged along when he’d taken Hayden to the rodeo, although the twisty drive had made her sick. They exchanged text messages several times a day.\u003c/p\u003e\n\u003cp\u003eAs much as Kane wanted to push their relationship to the next level—telling family they were a couple—in some ways, he liked romancing her in secret.\u003c/p\u003e\n\u003cp\u003eHe focused on updating the cattle records. By the time he’d finished and glanced at the clock, he realized two hours had passed. Kade would be along soon.\u003c/p\u003e\n\u003cp\u003eShit. He’d forgotten about Shep. Kane returned to the living room and opened the front door, seeing one set of tracks leading away from the house, but he couldn’t see beyond the carport. Feeling guilty, he donned his winter weather gear and trudged outside.\u003c/p\u003e\n\u003cp\u003eFirst place he checked was the barn. “Shep? Come on out. I know you’re probably pissed off and hungry.” He checked the stalls and the tack room. No sign of the dog in his usual spots. Kane checked them all twice.\u003c/p\u003e\n\u003cp\u003eAlthough the sun wasn’t shining, the white reflection of the snow made everything blindingly bright.\u003c/p\u003e\n\u003cp\u003eAfter he retrieved his sunglasses from his truck, he followed the tracks leading away from the house. They were scattered pell-mell as if the dog had sniffed everything in sight. Around the tractor, to the gate leading to the pasture, to the stock tank. But no sign of him.\u003c/p\u003e\n\u003cp\u003eKane hunkered deeper into his coat against the icy blast of wind. He would’ve worn his Carhartt coveralls if he’d thought he was going on a wild dog chase.\u003c/p\u003e\n\u003cp\u003eHe called out, “Shep?”\u003c/p\u003e\n\u003cp\u003eNo answering bark.\u003c/p\u003e\n\u003cp\u003eThe tracks morphed into a straight line, rather than the random sniff and explore variety he’d been seeing. Snow eddied around him, cutting visibility. He hurried. He’d have to find the dog before the elements erased the tracks.\u003c/p\u003e\n\u003cp\u003eKane stopped to catch his breath and looked back to see how far he’d gone. He was maybe a quarter mile from his trailer. He spun back around, taking in the dark outline of the lone cottonwood tree, an anomaly out here on the high plains. The big tree towered above the gnarled scrub oaks clustered in ravines. A creek popped up in the spring and trickled through the shallow gouge in the earth before summer heat returned it to a dry creek bed again. It’d always been one of Shep’s favorite places. He’d lounge in the shade while keeping an eye on the cattle drinking at the stock tank.\u003c/p\u003e\n\u003cp\u003eHe squinted, focusing on the base of the tree.\u003c/p\u003e\n\u003cp\u003eWas that a black lump?\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eHe ran, the snowdrifts slowed his progress and he felt as if he wore cement shoes.\u003c/p\u003e\n\u003cp\u003eBy the time Kane reached the tree, he was out of breath. And when he saw his dog, curled up in a ball, he knew he was too late.\u003c/p\u003e\n\u003cp\u003e“Goddammit, Shep.” Kane dropped to his knees in the snow. Shep’s head rested on his front paws, as if he’d just laid down for a brief rest. His eyes were even closed, which was uncommon with his always-alert dog. His fluffy tail was tucked under his nose. The wind ruffled his black fur, blowing away the crystals of snow that’d accumulated on his still form.\u003c/p\u003e\n\u003cp\u003eHe flashed back to the first time he’d seen Shep. His dad’s buddy Walt Collier had suffered a stroke, forcing him to move into the Sundance nursing home and give up his dog. Old Walt had owned Shep since he was a puppy. Around that same time Kane had moved into his trailer and was feeling a mite lonely.\u003c/p\u003e\n\u003cp\u003eWhen Kane’s dad asked if he’d be interested in taking the dog, he’d immediately said yes.\u003c/p\u003e\n\u003cp\u003eThe first month had been rough. Shep mourned Walt. He hadn’t shown much of an appetite or interest in tagging along with Kane out on the range. Kane had begun to wonder if his company wasn’t even fit for a depressed dog.\u003c/p\u003e\n\u003cp\u003eBut one afternoon when the cattle came in from the pasture to drink from the stock tank, a couple of calves raced off. Shep gave chase, snapping at them, driving them back to the herd where they belonged.\u003c/p\u003e\n\u003cp\u003eAfter that day, Shep had been a great cattle dog and a great companion.\u003c/p\u003e\n\u003cp\u003e“Damn, dog. Had to make a dramatic exit, didn’t ya?” He’d seen things like this happen too often on the ranch to chalk it up to coincidence. Animal instincts never ceased to amaze him.\u003c/p\u003e\n\u003cp\u003eKane stayed crouched down, his gloved hand absently petting Shep’s head. He hadn’t realized he was crying until he couldn’t move his face, which had become covered in frozen tears.\u003c/p\u003e\n\u003cp\u003e“Kane!”\u003c/p\u003e\n\u003cp\u003eHe didn’t turn around at his brother’s shout. He’d come out here anyway.\u003c/p\u003e\n\u003cp\u003eKade stopped behind him, huffing and puffing after trudging through the knee-deep snow.\u003c/p\u003e\n\u003cp\u003e“Kane, what the hell are you doin’… Oh shit.”\u003c/p\u003e\n\u003cp\u003eKane didn’t say a word. Couldn’t speak around the lump lodged in his throat.\u003c/p\u003e\n\u003cp\u003e“Aw, man, I’m sorry. Really fuckin’ sorry.” Pause. “How long…?”\u003c/p\u003e\n\u003cp\u003e“He went out this mornin’ and didn’t come back so I went lookin’ for him.” More tears fell and he didn’t bother to swipe them away. “Damn dog.”\u003c/p\u003e\n\u003cp\u003eAfter a bit, Kade clamped his hand on Kane’s shoulder. “This just sucks.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” Kane stood and shivered. “I’m gonna head back to the barn and get a shovel. The ground’ll be a bitch to dig since it’s so fuckin’ frozen, but I ain’t gonna just leave him out here as buzzard and coyote bait…” Kane’s voice broke.\u003c/p\u003e\n\u003cp\u003eKade squeezed his shoulder. “Lemme take care of this for you, bro.”\u003c/p\u003e\n\u003cp\u003eKane looked at his twin, knowing the sunglasses masked his red eyes, but also knowing Kade didn’t need to see his eyes to know he’d been crying. “Thanks for the offer, but I should—”\u003c/p\u003e\n\u003cp\u003e“No man oughta hafta bury his own dog, Kane. I’ve been around Shep a lot too. This is the least I can do for you and for him.”\u003c/p\u003e\n\u003cp\u003eNo sense arguing. Kane said, “Thanks. I’ll get the shovel.”\u003c/p\u003e\n\u003cp\u003e“I know where the shovels are. How about if you head to town and get that cake loaded? Then I’ll meetcha at Dewey’s for lunch.”\u003c/p\u003e\n\u003cp\u003eKane nodded. They plodded through the snow in silence. Kade cut to the left toward the barn when the buildings came into view, while Kane went straight for his truck. He loaded the trailer. He hadn’t meant to look back, but just as he started down the driveway, he glanced in his rearview and saw his brother traipsing through the snow, dragging two shovels.\u003c/p\u003e\n\u003cp\u003eHe cranked on the radio for the drive into town, but he flipped it off when Blake Shelton’s “Old Red”\u003c/p\u003e\n\u003cp\u003ecame on.\u003c/p\u003e\n\u003cp\u003eAt the feed store he wasn’t in the mood to make idle chitchat with Denny, but this was a small community, and Kane had been trying like the devil the last few years to overcome his previous brusque reputation. Once he and Denny finished jawing about the weather, the Broncos’ lousy season, the rash of new McKay babies and the upcoming calving season, Kane was ready to load up. \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-39.html","bookId":2689,"creation":"Oct 5, 2019 10:17:19 AM","modification":"Oct 5, 2019 10:17:19 AM"}
