{"id":70562,"no":43,"title":"Page 43","content":"\u003cp\u003e“Then it’s probably the real deal and she’s running scared.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m pretty sure I’m not the type of guy she thought she’d end up with,” he said, hating he sounded like a fucking whiner.\u003c/p\u003e\n\u003cp\u003eColt frowned at him. “What the fuck are you talkin’ about? You feelin’ like you’re not good enough for her? So she’s a lawyer. Big deal. That just means when you do something stupid and get your ass tossed in jail she can give you a helluva defense.”\u003c/p\u003e\n\u003cp\u003eKane laughed. “Asshole.”\u003c/p\u003e\n\u003cp\u003e“Listen to me. Don’t be a dumbass and waste any more time. Do the adult thing and quit mopin’\u003c/p\u003e\n\u003cp\u003earound. It’s annoying as hell.”\u003c/p\u003e\n\u003cp\u003e“How the hell do you know I’ve been moping? You ain’t been around.”\u003c/p\u003e\n\u003cp\u003e“Like anything can be a goddamned secret for long in this family.”\u003c/p\u003e\n\u003cp\u003eBefore he could tell Colt to mind his own fucking business, the door blew open and a whole mass of people crowded in. Kade, Cord, Colby, Cam and Quinn.\u003c/p\u003e\n\u003cp\u003eKade spoke up. “We’re staging an intervention.”\u003c/p\u003e\n\u003cp\u003eKane glared at Colt. “Was this your doin’?”\u003c/p\u003e\n\u003cp\u003e“Yep.” Colt smirked. “Payback’s a bitch, ain’t it?”\u003c/p\u003e\n\u003cp\u003eUnbelievable.\u003c/p\u003e\n\u003cp\u003eAll the guys grabbed a cup of coffee and took a seat.\u003c/p\u003e\n\u003cp\u003eWhen he couldn’t take their amused stares and total silence any longer, he snapped, “What?”\u003c/p\u003e\n\u003cp\u003eEvidently Kade was the designated spokesman. “We’ve all been where you are, so we’re gonna give you the benefit of our experience.” Kade leaned forward. “Buy a goddamned ring and marry the woman.\u003c/p\u003e\n\u003cp\u003eDon’t take no for an answer.”\u003c/p\u003e\n\u003cp\u003eHeads nodded in agreement.\u003c/p\u003e\n\u003cp\u003eKane looked at his relatives like they’d all gone insane, because the road to happily ever after hadn’t been easy for any of them. “That’s your advice? That’s why you’re all here?”\u003c/p\u003e\n\u003cp\u003eColby exchanged a look with Quinn and Colt and said, “Partially.”\u003c/p\u003e\n\u003cp\u003e“They’re using this ‘intervention’ as an excuse to avoid their wives, since they’re all pregnant,” Cam tossed in.\u003c/p\u003e\n\u003cp\u003e“Fuck off, Cam,” Colby said.\u003c/p\u003e\n\u003cp\u003e“But it’s true,” Cam argued.\u003c/p\u003e\n\u003cp\u003e“They’re all pregnant?” Kane asked. “Did you guys plan that or something?”\u003c/p\u003e\n\u003cp\u003e“No. Blame the last blizzard,” Colby said.\u003c/p\u003e\n\u003cp\u003eQuinn nodded.\u003c/p\u003e\n\u003cp\u003eKade said, “Well, Skylar ain’t pregnant.”\u003c/p\u003e\n\u003cp\u003eColt said, “And Indy was pregnant before the blizzard.”\u003c/p\u003e\n\u003cp\u003e“Far as I know, AJ ain’t pregnant.” Cord grinned. “Yet, but it sure ain’t for lack of tryin’.”\u003c/p\u003e\n\u003cp\u003eCam sighed. “As for why they’re here tonight, they each told their missus that they had to talk some sense into you about Ginger. Which if they’re anything like Domini, they’re all teared up thinking we’re the greatest guys in the world, looking out for you.”\u003c/p\u003e\n\u003cp\u003eKane snorted.\u003c/p\u003e\n\u003cp\u003e“As much as we do care about you finally strapping on that old ball and chain like the rest of us,”\u003c/p\u003e\n\u003cp\u003eQuinn said, “we are here for another reason.”\u003c/p\u003e\n\u003cp\u003e“Which is?”\u003c/p\u003e\n\u003cp\u003eColby crossed his arms over his chest. “Poker.”\u003c/p\u003e\n\u003cp\u003eThat jarred him. “What?”\u003c/p\u003e\n\u003cp\u003e“We know you’re playin’ poker regularly with Brandt, Tell, Dalton, Bennett and Chase. We’re pissed you didn’t invite us, and we want in.”\u003c/p\u003e\n\u003cp\u003e“Seriously?”\u003c/p\u003e\n\u003cp\u003e“Yep. We admire the hell outta you, Kane,” Cord said. “You’ve actually tried to fix the rift between our families and Uncle Casper’s. None of us could do it, even when we all wanted to. Hell, even when some of us tried.”\u003c/p\u003e\n\u003cp\u003e“So the next poker game after calving? We all expect an invite,” Cord said.\u003c/p\u003e\n\u003cp\u003e“Besides, if it was just supposed to be a gathering of the single McKays, then you’re gonna get kicked outta the club pretty soon, anyway,” Kade pointed out.\u003c/p\u003e\n\u003cp\u003eKane muttered, “God I hope so.”\u003c/p\u003e\n\u003cp\u003eCam threw a deck of cards on the table. “We’ve got an hour before we need to check cattle.”\u003c/p\u003e\n\u003cp\u003e“Love the way you said ‘we’, little bro, when you’ve got no intention of climbin’ on an ATV when it’s ten below outside,” Colt said.\u003c/p\u003e\n\u003cp\u003e“Hey. I’m handicapped.”\u003c/p\u003e\n\u003cp\u003eBoos rang out, followed by laughter and trash-talking.\u003c/p\u003e\n\u003cp\u003eKade leaned over. “Seriously. Don’t wait to tell Ginger how you feel about her until you think she’s ready to hear it. If she’s anything like Sky, and I suspect she is, she already knows how you feel. She just needs tangible proof.”\u003c/p\u003e\n\u003cp\u003e“Thanks for the advice, but I ain’t getting a tattoo.”\u003c/p\u003e\n\u003cp\u003e“Oh, you’ll be surprised what you’ll do in the name of love.”\u003c/p\u003e\n\u003cp\u003e“Are you two done sharin’ hairdo tips and secrets so we can play poker?” Colt rubbed his hands together with glee. “I’m feelin’ lucky.”\u003c/p\u003e\n\u003cp\u003eThat reminded Kane he was wearing his lucky ball cap. It also reminded him that he missed Hayden as much as he missed Ginger. Rather than dwell on what he couldn’t change tonight, but what he was goddamned sure he was gonna change as soon as humanly possible, he readjusted his cap and grabbed the cards. “Ante up, boys.”\u003c/p\u003e\n\u003cp\u003eChapter Eighteen\u003c/p\u003e\n\u003cp\u003eGinger missed Kane. It was an odd feeling. She’d never had a man in her life that she cared enough about to miss.\u003c/p\u003e\n\u003cp\u003eAnd it’d only been a week.\u003c/p\u003e\n\u003cp\u003eDespite feeling lousy, Ginger allowed Hayden to invite his friends Kyler and Anton McKay for a sleepover. The boys amused themselves, but seeing Kyler reminded Ginger of Kane. The boy was all McKay with his dark hair, blue eyes and boyish cowboy charm.\u003c/p\u003e\n\u003cp\u003eWeek two didn’t fly by any faster than week one had.\u003c/p\u003e\n\u003cp\u003eWhen Ginger threw up her breakfast, lunch and supper for three days straight, she knew she’d have to break down and make a doctor’s appointment. It’d been a lousy winter regarding her health, between the accident and the sinus infection that’d dragged on for a solid month. Her immune system was slacking; she’d caught every virus that’d come down the pike. Grateful as she was that neither Hayden nor her father had contracted anything from her, she was damn sick of being sick.\u003c/p\u003e\n\u003cp\u003eDoc Monroe ordered a bunch of tests. The worst one was the influenza A test, when the nurse stuck a tube up her nose to gather mucus. Urine and blood work were a piece of cake in comparison.\u003c/p\u003e\n\u003cp\u003eShe sat in the exam room, staring at her sock-clad feet. She’d felt so rotten and off-balance the last three weeks she hadn’t even worn high-heeled shoes.\u003c/p\u003e\n\u003cp\u003eTen minutes ticked by. She rolled down on the exam table. Even that simple movement sent her stomach churning. She curled into a ball, pulling the blanket under her chin. Maybe if she closed her eyes the room would stop spinning.\u003c/p\u003e\n\u003cp\u003e“Ginger?”\u003c/p\u003e\n\u003cp\u003eShe jumped and sat up, completely disoriented. “Sorry, I fell asleep.”\u003c/p\u003e\n\u003cp\u003e“It’s okay. We’re overbooked today.”\u003c/p\u003e\n\u003cp\u003eGinger rearranged the sheet across her thighs after she tugged down the hospital gown. She looked at Joely, flipping back and forth between pages in her medical chart. “So Doc, what’s the prognosis?\u003c/p\u003e\n\u003cp\u003eInfluenza A?”\u003c/p\u003e\n\u003cp\u003e“No. You tested negative.”\u003c/p\u003e\n\u003cp\u003e“Shit. Is it swine flu?”\u003c/p\u003e\n\u003cp\u003e“You tested negative for that too.”\u003c/p\u003e\n\u003cp\u003eWhen Dr. Monroe set the clipboard aside and pinched the bridge of her nose, Ginger had her first feeling of alarm. “What’s wrong with me?”\u003c/p\u003e\n\u003cp\u003e“A couple of questions first. You were on a ten-day cycle of antibiotics after your accident, correct?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“And then, according to your patient’s report, you filled a fourteen-day-cycle prescription of antibiotics for a sinus infection four weeks before that?”\u003c/p\u003e\n\u003cp\u003e“Yes. But it didn’t seem to work, so I refilled it again a couple of weeks ago.”\u003c/p\u003e\n\u003cp\u003e“First of all, you should’ve set up an appointment instead of getting a refill, an oversight I’ve corrected by canceling your standing prescription at DeWitt’s. I’m curious to know the details of your sinus infection symptoms, and why you didn’t feel the antibiotic worked.”\u003c/p\u003e\n\u003cp\u003eGinger frowned. “Besides my head being stuffy? I constantly have a headache. My equilibrium is off and I get motion sick very easily. So I’m nauseous and dog-tired all the time.”\u003c/p\u003e\n\u003cp\u003eDr. Monroe crossed her arms over her chest. “Ginger. You’re a smart woman. How could you not read the warning labels on the drug information sheet? I know you got them. I know you scour them if it’s Hayden’s medication. But you don’t do that for yourself?”\u003c/p\u003e\n\u003cp\u003eNot a good sign, getting her ass chewed by her doctor.\u003c/p\u003e\n\u003cp\u003e“Here’s the CliffsNotes version of pharmacology. Antibiotics can render birth control pills ineffective, especially the low dosage type you’re currently taking. I would’ve made a point of discussing it with you if I’d known you were sexually active—”\u003c/p\u003e\n\u003cp\u003e“This hasn’t ever been an issue before because I’ve been a freakin’ monk since I moved here.”\u003c/p\u003e\n\u003cp\u003e“When did your abstinence status change?”\u003c/p\u003e\n\u003cp\u003e“After my accident. When Kane stayed with us. It just sort of…happened.”\u003c/p\u003e\n\u003cp\u003e“So it was a one-time thing?”\u003c/p\u003e\n\u003cp\u003eGinger bit her lip, tempted to lie. “No, it wasn’t a one-time thing. God. He’s become like this…addiction. We’re doing it all the freakin’ time. I can’t keep my hands off him and Kane can’t keep his hands off me. I’ve never felt this way about any man.” Ginger inhaled slowly and steadily. “It’s like my hormones have taken control of my life.”\u003c/p\u003e\n\u003cp\u003e“Your hormones are in control, Ginger, because you’re pregnant.”\u003c/p\u003e\n\u003cp\u003eHer mouth dropped open and all the air emptied from her lungs. “What?”\u003c/p\u003e\n\u003cp\u003e“You honestly had no clue?” Dr. Monroe asked gently, but with a hint of skepticism.\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e“Your last menstrual cycle ended…just after New Year’s?” \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-43.html","bookId":2689,"creation":"Oct 5, 2019 10:17:19 AM","modification":"Oct 5, 2019 10:17:19 AM"}
