{"id":70524,"no":5,"title":"Page 5","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe raced inside, fearing the worst, since Hayden and Kane were supposed to be on an overnight camping trip—the only reason she’d agreed to a girls’ night out in the first place. Fortunately, Hayden had only forgotten his inhaler. Once he’d gotten home and used it, he hadn’t wanted to leave again so Kane had waited around to talk to her. Which was sweet and thoughtful and made her feel like complete shit.\u003c/p\u003e\n\u003cp\u003eShe’d double-checked on her son amidst Kane’s reassurances the boy was fine. In that moment Ginger was grateful that Kane was attuned to Hayden’s unpredictable physical ailments and she appreciated Kane didn’t think less of Hayden for them.\u003c/p\u003e\n\u003cp\u003eGinger had slumped against the wall across from Hayden’s room, feeling guilty. Feeling relieved.\u003c/p\u003e\n\u003cp\u003eFeeling overwhelmed.\u003c/p\u003e\n\u003cp\u003eKane moved close enough to her she felt the heat radiating from his body. “Ginger? You okay?”\u003c/p\u003e\n\u003cp\u003e“No. I feel like a horrible mother. Not being here when Hayden needed me.”\u003c/p\u003e\n\u003cp\u003e“He didn’t want to worry you because he really was fine. If I thought it’d been something serious, I would’ve called you. You know that, right?”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“If you’re worried I’ll think you’re a horrible mother? Think again.”\u003c/p\u003e\n\u003cp\u003e“Why’s that?”\u003c/p\u003e\n\u003cp\u003eHe laughed softly. “Sugar, I ain’t one to cast stones. There’s nothin’ wrong with goin’ out and havin’\u003c/p\u003e\n\u003cp\u003ea good time once in a while. Especially since I know you’re rarely whoopin’ it up at the Golden Boot.\u003c/p\u003e\n\u003cp\u003eWhich is a damn cryin’ shame.”\u003c/p\u003e\n\u003cp\u003e“Why do you say that?”\u003c/p\u003e\n\u003cp\u003e“Because you’re a smart, pretty woman who I suspect is a lot of fun once you let your hair down.”\u003c/p\u003e\n\u003cp\u003eIn such close proximity and in dim light, Kane’s eyes glowed dark indigo. Such compelling eyes fringed by ridiculously long black eyelashes.\u003c/p\u003e\n\u003cp\u003e“You’re lookin’ at me like you’re considering cuttin’ loose.”\u003c/p\u003e\n\u003cp\u003eCan I cut loose with you?\u003c/p\u003e\n\u003cp\u003eBracing his hands on either side of her head, Kane studied her curiously. “Did you mean to say that out loud?”\u003c/p\u003e\n\u003cp\u003eOh crap. She shook her head.\u003c/p\u003e\n\u003cp\u003e“Didn’t think so.” Kane’s moist lips teased her ear and followed her jawline. A delicious slow, warm shudder worked through her entire body. He brushed his mouth across hers. Once. Then he eased back slightly to gauge her reaction.\u003c/p\u003e\n\u003cp\u003eUnconsciously, Ginger licked her lips.\u003c/p\u003e\n\u003cp\u003eA half growl rumbled from his chest and Kane captured her mouth and he kissed her.\u003c/p\u003e\n\u003cp\u003eMan, had he ever kissed her. A tongue-plundering, lip-gliding, hot, wet and conquering kiss. She figured she’d have a real screaming orgasm if she kept kissing Kane McKay, so she kept her lips locked on his. Lord, his kisses alone made her dizzy with desire. Drunk on his wicked sensuality.\u003c/p\u003e\n\u003cp\u003eThe kiss ebbed and flowed, relaxed and intensified, and seemed to go on forever, but not nearly long enough.\u003c/p\u003e\n\u003cp\u003eWho knows how much farther it would’ve gone if Hayden hadn’t called out for her.\u003c/p\u003e\n\u003cp\u003eKane retreated immediately. Ginger began to apologize, but Kane very gently put his finger over her kiss-swollen lips. “No need. I’ll let myself out.”\u003c/p\u003e\n\u003cp\u003eAfter she’d soothed her son, she half hoped Kane had changed his mind. But he’d been gone and they’d never spoken of the kiss again.\u003c/p\u003e\n\u003cp\u003eKane glanced out the window at the setting sun. As much as he didn’t want to leave, he had a couple of things to tend before dark. He grabbed his coat and stopped in front of Dash. “I’ll be back in a bit.”\u003c/p\u003e\n\u003cp\u003eDash waved him off. “No rush. I imagine she’ll sleep for a while yet.”\u003c/p\u003e\n\u003cp\u003e“Where are you going?” Hayden asked, looking up from the chess game.\u003c/p\u003e\n\u003cp\u003e“Home to do some chores. Got to make sure Shep has food.”\u003c/p\u003e\n\u003cp\u003e“I wish you could bring Shep here.”\u003c/p\u003e\n\u003cp\u003e“Me too. But I’ve stashed him in the barn where it’s warm and dry.” Kane missed his dog, but he knew he couldn’t keep Shep in Ginger’s house, despite Hayden’s continuous claims he wasn’t allergic to dogs, just cats.\u003c/p\u003e\n\u003cp\u003e“Can I come along?”\u003c/p\u003e\n\u003cp\u003eKane looked at Dash, then back at Hayden. “Tell you what, if you stay here and keep an eye on your mama, I’ll take you tomorrow and you can help me check cattle, okay?”\u003c/p\u003e\n\u003cp\u003e“Okay.” Hayden returned his focus to the chessboard.\u003c/p\u003e\n\u003cp\u003eThe cold air bit into him and he wasn’t surprised to see the temperature had dropped to a single digit.\u003c/p\u003e\n\u003cp\u003eHe huddled in his coat and cranked the heat in his truck. Icy fingers of snow slithered across the road.\u003c/p\u003e\n\u003cp\u003eSomehow he managed to block out the conversation with Ginger because chances we’re high she either wouldn’t remember it, or she’d ignore it.\u003c/p\u003e\n\u003cp\u003eAt his place he parked under the carport. He checked the house first, finding it eerily quiet inside. He didn’t bother to take off his boots as he wandered to his bedroom. He’d purchased the trailer after his cousin Cam bought the Boars Nest from him and Colt. By that time Colt had already built his new house, Kade was married to Skylar and Kane was used to living alone.\u003c/p\u003e\n\u003cp\u003eAs a bachelor, Kane had no desire to design room layouts or choose kitchen cabinetry and countertops or pick plumbing fixtures. He’d wanted a ready-made house and this mobile home bought at an oil company auction fit him perfectly. Not too big, not too small and easily moved onto McKay land.\u003c/p\u003e\n\u003cp\u003eKane poked his head into the extra bedroom and debated on grabbing his laptop, but knowing Hayden’s tendency to monopolize his time, he doubted he’d have a chance to work on updating cattle records.\u003c/p\u003e\n\u003cp\u003eHe’d taken a six-pack of Bud Light from the fridge when he saw his brother Kade’s rig park out front.\u003c/p\u003e\n\u003cp\u003eIt was about the time Kade headed home to his wife and kids in Moorcroft.\u003c/p\u003e\n\u003cp\u003eThe instant he stepped outside, a purple fur-lined hood bobbed as the pink streak raced toward him.\u003c/p\u003e\n\u003cp\u003e“Uncle Buck!”\u003c/p\u003e\n\u003cp\u003eKane grinned at his oldest niece. The girl was a spitfire, all sweet girlie goodness one second, wild and ornery as a mustang the next.\u003c/p\u003e\n\u003cp\u003eShe threw herself at him.\u003c/p\u003e\n\u003cp\u003e“Eliza, did you sweet-talk your daddy into lettin’ you help him today?”\u003c/p\u003e\n\u003cp\u003e“Sweet-talk.” Kade snorted. “She browbeat me. Up at the crack of nothin’ waitin’ by the damn door for me this mornin’ and she wouldn’t take no for an answer.”\u003c/p\u003e\n\u003cp\u003e“A stubborn McKay child. Imagine that.” Kane whispered, “That’s my girl. What’s up?”\u003c/p\u003e\n\u003cp\u003e“Me’n Grammy baked cookies today! With rainbow sprinkles and we bringed you some, ’cause Grammy said it’s a shame you don’t got a woman to bake sweets for you.”\u003c/p\u003e\n\u003cp\u003eKane exchanged a look with his brother. Then he smooched Eliza’s forehead. “I don’t need a woman when I have you. Come on. You can help me feed Shep. He’s probably mighty lonesome out in the barn.”\u003c/p\u003e\n\u003cp\u003e“Why’s he in the barn? Was he bad?”\u003c/p\u003e\n\u003cp\u003eHe laughed. “No, I’m helpin’ out Hayden’s mama for a few days and Shep can’t come with me.”\u003c/p\u003e\n\u003cp\u003e“But why not?”\u003c/p\u003e\n\u003cp\u003e“Because he can’t sleep in Ginger’s house and they don’t have a barn. He’ll be better off here.”\u003c/p\u003e\n\u003cp\u003eHer enormous blue eyes pooled with tears. “Oh no. Poor Shep’s all alone?”\u003c/p\u003e\n\u003cp\u003eAh hell, he’d done it now. His softhearted, hardheaded niece constantly dragged home injured critters—birds, frogs, turtles, feral cats. “He’ll be fine, Eliza.”\u003c/p\u003e\n\u003cp\u003e“I wanna see for myself,” she harrumphed, exactly like her mother, and marched to the barn.\u003c/p\u003e\n\u003cp\u003eKade sighed. “Thanks a lot. She ain’t gonna leave here without Shep. That girl, I swear I’m gonna have a zoo instead of a ranch.”\u003c/p\u003e\n\u003cp\u003e“A llama, a goat, two sheep, chickens, cats, dogs and horses… Yep, as soon as Eliza Belle convinces you to buy an ostrich you can rename the place McKay’s Menagerie.”\u003c/p\u003e\n\u003cp\u003e“Fuck off.”\u003c/p\u003e\n\u003cp\u003eKane laughed. “You love it. Although the inside of your house is as much of a zoo as the outside.”\u003c/p\u003e\n\u003cp\u003e“True. I swear all three girls talk at the same time, from the moment I pick them up until we tuck them in bed.”\u003c/p\u003e\n\u003cp\u003eBetween Eliza and fraternal twins Peyton and Shannie, Kade and Sky definitely had their hands full.\u003c/p\u003e\n\u003cp\u003e“You ain’t really complainin’.”\u003c/p\u003e\n\u003cp\u003e“That’s also true.”\u003c/p\u003e\n\u003cp\u003e“If Eliza wants to babysit Shep for a couple of days, I’d appreciate it. That way I won’t worry about him.”\u003c/p\u003e\n\u003cp\u003eEliza and Shep loped out of the barn. Kane bent down and ruffled the dog’s ears. “What do you say, Shep? Wanna stay with Miz Eliza for a couple days?”\u003c/p\u003e\n\u003cp\u003eShep wagged his tail.\u003c/p\u003e\n\u003cp\u003e“Yay!”\u003c/p\u003e\n\u003cp\u003eKane looked at Kade. “Got time for a beer before you head back?”\u003c/p\u003e\n\u003cp\u003e“Just one.”\u003c/p\u003e\n\u003cp\u003eOnce they were inside, Eliza made herself at home. She shed her coat, the Hello Kitty snow boots Kane had bought her for Christmas, and opened the kitchen cupboard where Kane kept the dog food. She chattered away while Shep chowed down.\u003c/p\u003e\n\u003cp\u003eKane handed his brother a beer.\u003c/p\u003e\n\u003cp\u003eKade twisted the cap off the beer, took a long pull and looked at Kane suspiciously. “So, what’s really goin’ on with you and Ginger Paulson?”\u003c/p\u003e\n\u003cp\u003e“Nothin’.” Kane flicked the metal beer cap into the garbage can. “She fell down her office stairs.\u003c/p\u003e\n\u003cp\u003eEnded up with her arm in a sling, her lower leg in a cast and she’s got no one else to help her out, so I volunteered.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eBecause I am crazy about her. “Just bein’ a good neighbor.”\u003c/p\u003e\n\u003cp\u003eKade waggled the beer bottle at him. “Bullshit. I know you, bro. Need I remind you what happened with Brandi?”\u003c/p\u003e\n\u003cp\u003e“Christ. No. It ain’t the same. Not at all.” Brandi, the mother who’d been so desperate to hook him, had shown up at his trailer late one night. She’d removed her trench coat to reveal her naked body beneath it. Things had gone downhill when he’d learned she’d left her six-year-old son home alone so she could strip for him. He hadn’t exactly been nice to her, requesting reassignment, and she’d caused problems for him. \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-5.html","bookId":2689,"creation":"Oct 5, 2019 10:17:18 AM","modification":"Oct 5, 2019 10:17:18 AM"}
