{"id":70526,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eIf Ginger was surprised by how quickly she acquiesced, she was even more surprised by Kane’s thoroughness. His gentleness.\u003c/p\u003e\n\u003cp\u003eHe rinsed her hair. Her face. Her eyes.\u003c/p\u003e\n\u003cp\u003e“I can take it from here,” she said curtly.\u003c/p\u003e\n\u003cp\u003e“Like hell. I’m gonna help you to your feet whether you like it or not.” He wrapped his arms around her midsection.\u003c/p\u003e\n\u003cp\u003eShe sucked in a breath when the muscular backs of his forearms brushed the underswell of her breasts. Her nipples constricted. Her whole body quivered.\u003c/p\u003e\n\u003cp\u003e“Steady. I know you’re cold. Let’s get you upright first. Then we’ll see about getting you dried off and warmed up.” He lifted her with almost no effort. Instead of letting her go, he held her tightly against his body.\u003c/p\u003e\n\u003cp\u003eShe whimpered.\u003c/p\u003e\n\u003cp\u003e“Am I hurtin’ you?”\u003c/p\u003e\n\u003cp\u003e“No. I’m just…mortally embarrassed.”\u003c/p\u003e\n\u003cp\u003e“Listen to me. I am here to help you. With everything. Including this kinda stuff. So all you need to do, Ginger, is let me help you. Can you do that?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “Tough shit.”\u003c/p\u003e\n\u003cp\u003eShe nearly smiled through her chattering teeth.\u003c/p\u003e\n\u003cp\u003e“No more of this ‘you don’t need my help’ attitude. From now on, I’m gonna stick to your goddamn side like glue, understand?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“Good.” He released her. “Now brace your hand on the sink and I’ll dry you off.”\u003c/p\u003e\n\u003cp\u003eWith brisk, but calm efficiency, Kane toweled off every section of her wet body. She had to admit that he didn’t let his gaze linger on her naked body parts. Until he had to help her get dressed. He muttered something about going straight to hell.\u003c/p\u003e\n\u003cp\u003eKane slipped the straps of her favorite lime green bra up her arms and pulled the cups to cover her breasts. After he snapped the front clasp of the separate sections together, his fingertips swept the deep “V”\u003c/p\u003e\n\u003cp\u003eof her cleavage, lingering on the upper curves.\u003c/p\u003e\n\u003cp\u003eHer nipples hardened at his touch, despite the echo of her father’s warning about Kane’s deftness with female undergarments. He’s helped plenty of women out of their clothes.\u003c/p\u003e\n\u003cp\u003eHe lifted a brow at her shirt choice. “A button-up, long-sleeved western shirt?”\u003c/p\u003e\n\u003cp\u003e“I thought it’d be easier to put on.”\u003c/p\u003e\n\u003cp\u003e“Not easier to snap with one hand. Let’s start with your bum arm.” Once he had the shirt snapped, he slipped the sling over her head. “Careful.”\u003c/p\u003e\n\u003cp\u003eGinger fought the urge to tell him to hurry, because hello? She was naked from the waist down. The glint in Kane’s eye warned that if she complained, he’d take even longer dressing her.\u003c/p\u003e\n\u003cp\u003eWhen he dropped to his knees, she couldn’t tear her eyes away from his dark head so close to her pussy. If he moved his face, just a couple of inches, he could put his mouth right where she most wanted it.\u003c/p\u003e\n\u003cp\u003eWould he comment about her being a natural redhead?\u003c/p\u003e\n\u003cp\u003eBut Kane didn’t say a word. He didn’t slowly, sensuously ease the soft cotton yoga pants up her legs.\u003c/p\u003e\n\u003cp\u003eOne fast tug and the waistband hugged her hips.\u003c/p\u003e\n\u003cp\u003eNot only did Ginger feel ashamed of her less-than-perfect body, she was embarrassed by her conflicting emotions—on one hand wanting Kane to notice her, on the other hand wanting to cringe away from his scrutiny.\u003c/p\u003e\n\u003cp\u003eKane stood and hung up the towels.\u003c/p\u003e\n\u003cp\u003eHow much of a freak did it make her that she felt more vulnerable dressed than she had stark naked?\u003c/p\u003e\n\u003cp\u003eKeeping her head bowed, she whispered, “Thank you.”\u003c/p\u003e\n\u003cp\u003eThen Kane was right there, tipping her face up to meet his gaze. “Hey now, what’s with the waterworks? I just got you dried off.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry I’m such a pain in the ass.”\u003c/p\u003e\n\u003cp\u003eHe studied her. “Why do you have such a hard time askin’ for help?”\u003c/p\u003e\n\u003cp\u003e“Because I’ve never needed it before.”\u003c/p\u003e\n\u003cp\u003e“Well, you need it now.”\u003c/p\u003e\n\u003cp\u003e“Thanks for pointing that out.”\u003c/p\u003e\n\u003cp\u003e“I’m gonna be pointing it out over and over until it’s through that thick skull of yours, so suck it up.\u003c/p\u003e\n\u003cp\u003eGet used to takin’ my help, Ginger, because I’m just as goddamn stubborn as you are. And I ain’t gonna wait for you to ask me for it.”\u003c/p\u003e\n\u003cp\u003eHayden knocked and rushed in without waiting for the obligatory “come in”, oblivious to the fact she and Kane had been within kissing distance.\u003c/p\u003e\n\u003cp\u003e“Mom? You okay?”\u003c/p\u003e\n\u003cp\u003e“Yeah, baby, I’m fine.”\u003c/p\u003e\n\u003cp\u003eHayden squinted at her hair. “Except you look like a mad porcupine.”\u003c/p\u003e\n\u003cp\u003eHer hair snarled like a Brillo pad if she forgot to put conditioner in, which she had. Combing it without the benefit of conditioner? Near impossible, especially since she’d be forced to use her left hand.\u003c/p\u003e\n\u003cp\u003eThe thought of hobbling around her house with her hair looking like an electrocuted porcupine made her want to cry.\u003c/p\u003e\n\u003cp\u003e“Hayden, buddy, why don’t you give your mama a minute?”\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to—”\u003c/p\u003e\n\u003cp\u003e“She knows. Go on.”\u003c/p\u003e\n\u003cp\u003eIf Ginger couldn’t even look at herself in the mirror she couldn’t imagine what Kane saw when he looked at her.\u003c/p\u003e\n\u003cp\u003eSilence, thick as steam, floated around them.\u003c/p\u003e\n\u003cp\u003eKane curled his hands around her face. “You don’t look like a mad porcupine. Maybe just a rabid squirrel.”\u003c/p\u003e\n\u003cp\u003eShe laughed and sobbed simultaneously.\u003c/p\u003e\n\u003cp\u003eHis too-kind eyes searched hers. “Find me a brush and I’ll comb out your hair.”\u003c/p\u003e\n\u003cp\u003e“You’d do that?”\u003c/p\u003e\n\u003cp\u003eHis hands fell to his sides. “Why? Don’t you trust me?” he said with an edge to his voice.\u003c/p\u003e\n\u003cp\u003eWay to insult the man when he’s gone above and beyond. Ginger backtracked. “It’s not that.”\u003c/p\u003e\n\u003cp\u003e“Then what? Because it doesn’t take a damn doctorate to untangle hair, Ginger.”\u003c/p\u003e\n\u003cp\u003eWhat did that have to do with anything? Kane wasn’t feeling intimidated by her…was he?\u003c/p\u003e\n\u003cp\u003eThat was beyond ridiculous. The man was…a super hero—according to her son. And from what she’d seen so far? She’d have to agree.\u003c/p\u003e\n\u003cp\u003e“Red?” he prompted brusquely.\u003c/p\u003e\n\u003cp\u003eKeep it light. “I was just wondering if it’d be presumptuous to ask you for a pedicure too.”\u003c/p\u003e\n\u003cp\u003e“Definitely.” He flashed her that knee-weakening grin.\u003c/p\u003e\n\u003cp\u003eIn her bedroom, she perched on the edge of her bed. Kane followed a beat later, wielding a brush and a comb. He closed the door behind him and propped a knee on the mattress. “If I pull too hard, let me know.”\u003c/p\u003e\n\u003cp\u003eGinger let her eyes drift shut, allowing herself to enjoy the feel of Kane’s hands on her head, straightening and smoothing the coarse strands, one section at a time.\u003c/p\u003e\n\u003cp\u003e“I see them wheels turnin’, counselor. You’re wondering how many heads of women’s hair I’ve combed before yours, aren’t you?”\u003c/p\u003e\n\u003cp\u003eWas she that transparent? “Maybe.”\u003c/p\u003e\n\u003cp\u003e“No women, but I have untangled wild child Eliza’s hair a time or two.”\u003c/p\u003e\n\u003cp\u003eGrateful for the subject change, she asked, “Do you spend much time with Kade and Skylar’s girls?”\u003c/p\u003e\n\u003cp\u003e“As much as I can. Eliza more than the twins, since she’s older.” He chuckled. “Last year? She was complaining to her parents about them goin’ away for ‘alone’ time and demanded alone time too.”\u003c/p\u003e\n\u003cp\u003e“What did they do?”\u003c/p\u003e\n\u003cp\u003e“Sent her to my house for the weekend. We ate junk food and watched girlie movies and played High Ho! Cherry-O and Go Fish. However, I drew the line at playin’ Barbies or painting her nails,” he said dryly. “So your pedicure chances are slim to none.”\u003c/p\u003e\n\u003cp\u003eGinger laughed.\u003c/p\u003e\n\u003cp\u003e“And while I was workin’ on the tractor? Little sneak ran off to play with Shep in the shelterbelt. She came back an hour later with her hair in knots. I figured Kade and Sky would throw a fit if I chopped off Little Miss’s long locks, which woulda been a damn sight easier than combin’ through it. Took me two solid hours to untangle that rat’s nest.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t fool her. Warm amusement for his niece’s antics lurked beneath the words. It appeared the man was great with all kids, not just hers.\u003c/p\u003e\n\u003cp\u003e“So yesterday when I went to check on Shep, Kade and Miz Eliza showed up. She got teary eyed that my dog was ‘all alone’ and convinced her daddy to take him home for the weekend.” He sighed. “Poor Shep will probably have pink ribbons attached to his collar when I pick him up.”\u003c/p\u003e\n\u003cp\u003eGinger had forgotten Kane had a dog. And he hadn’t asked to bring him along, knowing Hayden’s allergies. “I’m sorry you had to make other arrangements for Shep, Kane.”\u003c/p\u003e\n\u003cp\u003eThe brush stopped.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“I like hearin’ the sexy way you say my name.”\u003c/p\u003e\n\u003cp\u003eA blush spread across her cheeks. Her heart pounded. “Oh. Really?”\u003c/p\u003e\n\u003cp\u003e“There’s no need to apologize since I volunteered to be here and Shep would’ve been fine sleepin’ in the barn.”\u003c/p\u003e\n\u003cp\u003eSilence stretched. Not uncomfortable. The gentle, yet thorough way his hands stroked her hair was as relaxing as it was arousing. Unconsciously, Ginger rubbed her thighs together. How amazing would those stroking motions feel all over? Her breasts? Her belly? Her pussy? A sound of pure pleasure escaped before she could stop it.\u003c/p\u003e\n\u003cp\u003e“You like this,” he murmured in her ear.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Me too.” Then he didn’t say another word, but he seemed to take even more care, even more time.\u003c/p\u003e\n\u003cp\u003eThe soft sound of the bristles gliding through her hair slowed.\u003c/p\u003e\n\u003cp\u003e“As much as I like seein’ this red mass down around your pretty face, I’m gonna pull it into a ponytail.” Once her hair was slicked back, he said, “You wanna check my handiwork to see if it’s up to your standards?”\u003c/p\u003e\n\u003cp\u003e“I trust you.”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t trust me. ’Cause I’ve been havin’ all sorts of naughty thoughts about you.”\u003c/p\u003e\n\u003cp\u003e“Since when?”\u003c/p\u003e\n\u003cp\u003e“Truthfully? Since always.” His silky voice drifted across her ear. “But it’s gotten much more intense in the last hour since I busted in on you in the bathroom.” \u003c/p\u003e","sourceLink":"https://allnovel.net/raising-kane-rough-riders-9/page-7.html","bookId":2689,"creation":"Oct 5, 2019 10:17:18 AM","modification":"Oct 5, 2019 10:17:18 AM"}
