{"id":18835,"no":14,"title":"CHAPTER XIII","content":"\u0026nbsp;In the meantime, another ship, the Phoenix, arrived at Jamestown with a large amount of provisions and more settlers. Peace and prosperity sent their flickering smiles to warm the hearts of all. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The honest captain of the Phoenix brought with him a letter ordering Smith to go again in search of the South Sea. This command exactly suited the adventurous spirit of the gallant soldier, and taking with him fourteen men, among them Adam Clotworthy, he started up the Chesapeake.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sailing along its low shores fringed with fragrant verdure, and interlaced with silver ribbons, where the York and Potomac pour in their waters, they met with many adventures. Far up its waters they journeyed until the mouth of the Susquehanna was reached. Then turning southward again, they entered a wide basin where in time to come ships from many foreign lands would disgorge their load of human freight, gathered at every port beyond the seas. Golden-haired, ruddy-cheeked giants of the Norseland would tower above the dark-eyed, small-statured sons of Italy.97 Fair Baltimore—set as a glowing ruby between the diamonds of the North and the opals of the South.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Journeying up the Potomac, they came upon Japazaws, a werowance of Powhatan. Just as the sun was lighting up the horizon, Captain Smith moored his barge and stepped ashore. Before even greeting the chief, he and his men knelt for morning prayer, then rising to their feet joined in the second canticle. Instantly the crowd of dusky savages turned as one man to greet the rising sun, and a “fearful song” to Aurora blended its wail with the Te Deum chanted to the Trinity. After this “fearsome chant” had ended, Japazaws made a ring of dried tobacco upon the ground into which the braves cast pieces of copper, at the same time prostrating themselves upon the ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bidding good-by to Japazaws, our party sailed down to the York River, and leisurely ascending its broad waters, came into the Pamunkey.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2860/79046.html","bookId":1207,"creation":"Aug 2, 2019 10:31:23 AM","modification":"Aug 2, 2019 10:31:23 AM"}
