{"id":99460,"no":9,"title":"Page 9","content":"\u003cp\u003e\u0026nbsp;5\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;MEASURE OF REVENGE\u003c/p\u003e\n\u003cp\u003eMaia looked up as the door to Jordan’s apartment banged open and he raced inside, almost skidding on the slippery hardwood floor. “Anything?” he asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head. His face fell. After they’d killed the Endarkened, she’d called the pack to come help them deal with the mess. Unlike demons, Endarkened didn’t just evaporate when you killed them. Disposal was required. Normally they would have summoned the Shadowhunters and Silent Brothers, but the doors to the Institute and the Bone City were closed now. Instead Bat and the rest of the pack had showed up with a body bag, while Jordan, still bleeding from the fight with the Endarkened, had gone to look for Simon.\u003c/p\u003e\n\u003cp\u003eHe hadn’t come back for hours, and when he had, the look in his eyes had told Maia the whole story. He had found Simon’s phone, smashed to pieces, abandoned at the bottom of the fire escape like a mocking note. Otherwise there’d been no sign of him at all.\u003c/p\u003e\n\u003cp\u003eNeither of them had slept after that, of course. Maia had gone back to wolf pack headquarters with Bat, who had promised—if a little hesitantly—that he would tell the wolves to look for Simon, and try (emphasis on try) to reach the Shadowhunters in Alicante. There were lines open to the Shadowhunter capital, lines that only the heads of packs and clans could use.\u003c/p\u003e\n\u003cp\u003eMaia had returned to Jordan’s apartment at dawn, despairing and exhausted. She was standing in the kitchen when he came in, a wet paper towel pressed to her forehead. She took it away as Jordan looked at her, and felt the water run down her face like tears. “No,” she said. “No news.”\u003c/p\u003e\n\u003cp\u003eJordan slumped against the wall. He was wearing only a short-sleeved T-shirt, and the inked designs of lines from the Upanishads were darkly visible around his biceps. His hair was sweaty, plastered to his forehead, and there was a red line on his neck where the strap of his weapons pack had cut into the skin. He looked miserable. “I can’t believe this,” he said, for what felt to Maia like the millionth time. “I lost him. I was responsible for him, and I goddamned lost him.”\u003c/p\u003e\n\u003cp\u003e“It’s not your fault.” She knew it wouldn’t make him feel any better, but she couldn’t help saying it. “Look, you can’t fight off every vampire and baddie in the tristate area, and the Praetor shouldn’t have asked you to try. When Simon lost the Mark, you asked for backup, didn’t you? And they didn’t send anyone. You did what you could.”\u003c/p\u003e\n\u003cp\u003eJordan looked down at his hands, and said something under his breath. “Not good enough.” Maia knew she should go over to him, put her arms around him, comfort him. Tell him he wasn’t to blame.\u003c/p\u003e\n\u003cp\u003eBut she couldn’t. The weight of guilt was as heavy on her chest as an iron bar, words unsaid choking her throat. It had been that way for weeks now. Jordan, I have to tell you something. Jordan, I have to. Jordan, I.\u003c/p\u003e\n\u003cp\u003eJordan—\u003c/p\u003e\n\u003cp\u003eThe sound of a ringing phone cut through the silence between them. Almost frantically Jordan dug into his pocket and yanked his mobile out; he flipped it open as he put it to his ear. “Hello?”\u003c/p\u003e\n\u003cp\u003eMaia watched him, leaning so far forward that the countertop cut into her rib cage. She could hear only murmurs on the other end of the phone, though, and was nearly screaming with impatience by the time Jordan closed the phone and looked over at her, a spark of hopefulness in his eyes. “That was Teal Waxelbaum, second in command at the Praetor,” he said. “They want me at headquarters right away. I think they’re going to help look for Simon. Will you come? If we head out now, we should be there by noon.”\u003c/p\u003e\n\u003cp\u003eThere was a plea in his voice, under the current of anxiety about Simon. He wasn’t stupid, Maia thought. He knew something was wrong. He knew—\u003c/p\u003e\n\u003cp\u003eShe took a deep breath. The words crowded her throat—Jordan, we have to talk about something—but she forced them back down. Simon was the priority now.\u003c/p\u003e\n\u003cp\u003e“Of course,” she said. “Of course I’ll come.”\u003c/p\u003e\n\u003cp\u003e\u0026nbsp; \u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe first thing Simon saw was the wallpaper, which wasn’t that bad. A bit dated. Definitely peeling. Serious mold problem. But overall, not the worst thing he’d ever opened his eyes to. He blinked once or twice, taking in the heavy stripes that cut through the floral pattern. It took him a second to realize that those stripes were, in fact, bars. He was in a cage.\u003c/p\u003e\n\u003cp\u003eHe quickly rolled onto his back and stood, not checking to see how high the cage was. His skull made contact with the bars on top, knocking his gaze downward as he cursed out loud.\u003c/p\u003e\n\u003cp\u003eAnd then he saw himself.\u003c/p\u003e\n\u003cp\u003eHe was wearing a flowing, puffy white shirt. Even more troubling was the fact that he also appeared to be wearing a pair of very tight leather pants.\u003c/p\u003e\n\u003cp\u003eVery tight.\u003c/p\u003e\n\u003cp\u003eVery leather.\u003c/p\u003e\n\u003cp\u003eSimon looked down at himself and took it all in. The billows of the shirt. The deep, chest-exposing V. The tightness of the leather.\u003c/p\u003e\n\u003cp\u003e“Why is it,” he said after a moment, “that whenever I think I’ve found the most terrible thing that could happen to me, I’m always wrong.”\u003c/p\u003e\n\u003cp\u003eAs if on cue the door opened, and a tiny figure rushed into the room. A dark shape closed the door instantly behind her, with Secret Service–like speed.\u003c/p\u003e\n\u003cp\u003eShe tiptoed up to the cage and squeezed her face between two bars. “Siiimon,” she breathed.\u003c/p\u003e\n\u003cp\u003eMaureen.\u003c/p\u003e\n\u003cp\u003eSimon would normally have at least tried to ask her to let him out, to find a key, to assist him. But something in Maureen’s appearance told him that would not be helpful. Specifically, the crown of bones she was wearing. Finger bones. Maybe foot bones. And the bone crown was bejeweled—or possibly bedazzled. And then there was the ragged rose-and-gray ball gown, widened at the hips in a style that reminded him of those costume dramas set in the eighteenth century. It was not the kind of outfit that inspired confidence.\u003c/p\u003e\n\u003cp\u003e“Hey, Maureen,” he said cautiously.\u003c/p\u003e\n\u003cp\u003eMaureen smiled and pressed her face harder into the opening.\u003c/p\u003e\n\u003cp\u003e“Do you like your outfit?” she asked. “I have a few for you. I got you a frock coat and a kilt and all kinds of stuff, but I wanted you to wear this one first. I did your makeup too. That was me.”\u003c/p\u003e\n\u003cp\u003eSimon didn’t need a mirror to know he was wearing eyeliner. The knowledge was instant, and complete.\u003c/p\u003e\n\u003cp\u003e“Maureen—”\u003c/p\u003e\n\u003cp\u003e“I’m making you a necklace,” she said, cutting him off. “I want you to wear more jewelry. I want you to wear more bracelets. I want things around your wrists.”\u003c/p\u003e\n\u003cp\u003e“Maureen, where am I?”\u003c/p\u003e\n\u003cp\u003e“You’re with me.”\u003c/p\u003e\n\u003cp\u003e“Okay. Where are we?”\u003c/p\u003e\n\u003cp\u003e“The hotel, the hotel, the hotel . . .”\u003c/p\u003e\n\u003cp\u003eThe Hotel Dumort. At least that made some kind of sense.\u003c/p\u003e\n\u003cp\u003e“Okay,” he said. “And why am I . . . in a cage?”\u003c/p\u003e\n\u003cp\u003eMaureen started humming a song to herself and ran her hand along the bars of the cage, lost in her own world.\u003c/p\u003e\n\u003cp\u003e“Together, together, together . . . now we’re together. You and me. Simon and Maureen. Finally.”\u003c/p\u003e\n\u003cp\u003e“Maureen—”\u003c/p\u003e\n\u003cp\u003e“This will be your room,” she said. “And once you’re ready, you can come out. I’ve got things for you. I’ve got a bed. And other things. Some chairs. Things you’ll like. And the band can play!”\u003c/p\u003e\n\u003cp\u003eShe twirled, almost losing her balance under the strange weight of the dress.\u003c/p\u003e\n\u003cp\u003eSimon felt he should probably choose his next words very carefully. He knew he had a calming voice. He could be sensitive. Reassuring.\u003c/p\u003e\n\u003cp\u003e“Maureen . . . you know . . . I like you . . .”\u003c/p\u003e\n\u003cp\u003eOn this, Maureen stopping spinning and gripped the bars again.\u003c/p\u003e\n\u003cp\u003e“You just need time,” she said with a terrifying kindness in her voice. “Just time. You’ll learn. You’ll fall in love. We’re together now. And we’ll rule. You and me. We will rule my kingdom. Now that I’m queen.”\u003c/p\u003e\n\u003cp\u003e“Queen?”\u003c/p\u003e\n\u003cp\u003e“Queen. Queen Maureen. Queen Maureen of the night. Queen Maureen of the darkness. Queen Maureen. Queen Maureen. Queen Maureen of the dead.”\u003c/p\u003e\n\u003cp\u003eShe took a candle that burned in a sconce on the wall and suddenly poked it between the bars and in Simon’s general direction. She tipped it ever so slightly, and smiled as the white wax dropped in tear-like forms to the rotted remains of the scarlet carpet on the floor. She bit her lower lip in concentration, turning her wrist gently, pooling the drips together.\u003c/p\u003e\n\u003cp\u003e“You’re . . . a queen?” Simon said faintly. He’d known Maureen was the leader of the New York vampire clan. She’d killed Camille, after all, and taken her place. But clan leaders weren’t called kings or queens. They dressed normally, like Raphael did, not in costumey getups. They were important figures in the community of the Night’s Children.\u003c/p\u003e\n\u003cp\u003eBut Maureen, of course, was different. Maureen was a child, an undead child. Simon remembered her rainbow arm warmers, her little breathy voice, her big eyes. She’d been a little girl with all the innocence of a little girl when Simon had bitten her, when Camille and Lilith had taken her and changed her, injecting an evil into her veins that had taken all that innocence and corrupted it into madness.\u003c/p\u003e\n\u003cp\u003eIt was his fault, Simon knew. If Maureen hadn’t known him, hadn’t followed him around, none of this would have happened to her.\u003c/p\u003e\n\u003cp\u003eMaureen nodded and smiled, concentrating on her wax pile, which was now looking like a tiny volcano. “I need . . . to do things,” she said abruptly, and dropped the candle, still burning. It snuffed itself out as it hit the ground, and she bustled toward the door. The same dark figure opened it the instant she approached. And then Simon was alone again, with the smoking remains of the candle and his new leather pants, and the horrible weight of his guilt.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp; \u0026nbsp;\u003c/p\u003e\n\u003cp\u003eMaia had been silent the whole way to the Praetor, as the sun had risen higher in the sky and the surroundings had turned from the crowded buildings of Manhattan to the traffic-clogged Long Island Expressway, to the pastoral small towns and farms of the North Fork. They were close to the Praetor now, and could see the ice-blue waters of the Sound on their left, rippling in the cool wind. Maia imagined plunging into them, and shuddered at the thought of the cold.\u003c/p\u003e\n\u003cp\u003e“Are you all right?” Jordan had hardly spoken most of the way either. It was chilly inside his truck, and he wore leather driving gloves, but they didn’t conceal his white-knuckle grip on the wheel. Maia could feel the anxiety rolling off him in waves.\u003c/p\u003e\n\u003cp\u003e“I’m fine,” she said. It wasn’t true. She was worried about Simon, and she was still fighting the words she couldn’t say that choked her throat. Now wasn’t the right time to say them, not with Simon missing, and yet every moment she didn’t say them felt like a lie.\u003c/p\u003e\n\u003cp\u003eThey swung onto the long white drive that stretched into the distance, toward the Sound. Jordan cleared his throat. “You know I love you, right?”\u003c/p\u003e\n\u003cp\u003e“I know,” Maia said quietly, and fought the urge to say “Thank you.” You weren’t supposed to say “Thank you” when someone said they loved you. You were supposed to say what Jordan was clearly expecting—\u003c/p\u003e\n\u003cp\u003eShe looked out the window and started, jerked out of her reverie. “Jordan, is it snowing?”\u003c/p\u003e\n\u003cp\u003e“I don’t think so.” But white flakes were drifting past the windows of the truck, building up on the windshield. Jordan brought the truck to a stop and rolled one of the windows down, opening his hand to catch a flake. He drew it back, his expression darkening. “That’s not snow,” he said. “That’s ash.”\u003c/p\u003e\n\u003cp\u003eMaia’s heart lurched as he shoved the truck back into gear and they pitched forward, spinning around the corner of the drive. Up ahead of them, where the Praetor Lupus headquarters should have been rising, gold against the gray noon sky, was a gout of black smoke. Jordan swore and slewed the wheel to the left; the truck bumped into a ditch and sputtered out. He kicked his door open and jumped down; Maia followed a second later.\u003c/p\u003e\n\u003cp\u003eThe Praetor Lupus headquarters had been built on a huge parcel of green land that sloped down to the Sound. The central building was built of golden stone, a Romanesque manor house surrounded by arched porticoes. Or it had been. It was a mass of smoking wood and stone now, charred like bones in a crematorium. White powder and ashes blew thickly across the gardens, and Maia choked on the stinging air, bringing up a hand to shield her face.\u003c/p\u003e\n\u003cp\u003eJordan’s brown hair was thickly snowflaked with ash. He stared around him, his expression shocked and uncomprehending. “I don’t—”\u003c/p\u003e\n\u003cp\u003eSomething caught Maia’s eye, a flicker of movement through the smoke. She grabbed Jordan’s sleeve. “Look—there’s someone there—”\u003c/p\u003e\n\u003cp\u003eHe took off, skirting the smoking ruin of the Praetor building. Maia followed him, though she couldn’t help but hang back in horror, staring at the charred remnants of the structure that protruded from the earth—walls holding up a no-longer-existing roof, windows that had blown out or melted, glimpses here and there of white that could have been brick or bones . . .\u003c/p\u003e\n\u003cp\u003eJordan stopped ahead of her. Maia moved up to stand beside him. Ash was clinging to her shoes, the grit of it in among the laces. She and Jordan were in the main body of the burned-out buildings. She could see the water in the near distance. The fire hadn’t spread, though there were charred dead leaves and blowing ash here, too—and in among the clipped hedgerows, there were bodies.\u003c/p\u003e\n\u003cp\u003eWerewolves—of all ages, though mostly young—lay sprawled along the manicured paths, their bodies being slowly covered by ash as if they were being swallowed by a blizzard.\u003c/p\u003e\n\u003cp\u003eWerewolves had an instinct to surround themselves with others of their kind, to live in packs, to draw strength from one another. This many dead lycanthropes felt like a tearing ache, a hole of loss in the world.She remembered the words from Kipling, written on the walls of the Praetor. For the strength of the pack is the wolf, and the strength of the wolf is the pack.\u003c/p\u003e\n\u003cp\u003eJordan was gazing around, his lips moving as he murmured the names of the dead—Andrea, Teal, Amon, Kurosh, Mara. At the edge of the water Maia suddenly saw something move—a body, half-submerged. She broke into a run, Jordan on her heels. She skidded through the ash, to where the grass gave way to sand, and dropped down beside the corpse.\u003c/p\u003e\n\u003cp\u003eIt was Praetor Scott, corpse bobbing facedown, his gray-blond hair soaked, the water around him stained pinkish red. Maia bent down to turn him over, and nearly gagged. His eyes were open, staring sightlessly at the sky, his throat sliced wide open.\u003c/p\u003e\n\u003cp\u003e“Maia.” She felt a hand on her back—Jordan’s. “Don’t—”\u003c/p\u003e\n\u003cp\u003eHis sentence was cut off by a gasp, and she whirled around, only to feel a sense of horror so intense that it nearly blacked out her vision. Jordan stood behind her, one hand outstretched, a look of utter shock on his face.\u003c/p\u003e\n\u003cp\u003eFrom the center of his chest protruded the blade of a sword, its metal stamped with black stars. It looked utterly bizarre, as if someone had taped it there, or as if it were some sort of theatrical prop.\u003c/p\u003e\n\u003cp\u003eBlood began to spread out in a circle around it, staining the front of his jacket. Jordan gave another bubbling gasp and slid to his knees, the sword retracting, slipping back out of his body as he collapsed to the ground and revealed what was behind him.\u003c/p\u003e\n\u003cp\u003eA boy carrying a massive black and silver sword stood looking at Maia over Jordan’s kneeling body. The hilt was slicked with blood—in fact, he was bloody all over, from his pale hair to his boots, spattered with it as if he had stood in front of a fan blowing scarlet paint. He was grinning all over his face.\u003c/p\u003e\n\u003cp\u003e“Maia Roberts and Jordan Kyle,” he said. “Have I heard a lot about you.”\u003c/p\u003e\n\u003cp\u003eMaia dropped to her knees, just as Jordan slumped sideways. She caught him, easing him down into her lap. She felt numb all over with horror, as if she were lying at the icy bottom of the Sound. Jordan was shuddering in her arms, and she put them around him as blood ran out of the corners of his mouth.\u003c/p\u003e\n\u003cp\u003eShe looked up at the boy standing over her. For a dizzy moment she thought he had stepped out of one of her nightmares of her brother, Daniel. He was beautiful, like Daniel had been, though they could not have looked more different. Daniel’s skin had been the same brown as hers, while this boy looked like he had been carved out of ice. White skin, sharp pale cheekbones, salt-white hair that fell over his forehead. His eyes were black, shark’s eyes, flat and cold.\u003c/p\u003e\n\u003cp\u003e“Sebastian,” she said. “You’re Valentine’s son.”\u003c/p\u003e\n\u003cp\u003e“Maia,” Jordan whispered. Her hands were over his chest, and they were soaked in blood. So was his shirt, and the sand under them, the grains of it clumped together by sticky scarlet. “Don’t stay—run—”\u003c/p\u003e\n\u003cp\u003e“Shh.” She kissed his cheek. “You’ll be all right.”\u003c/p\u003e\n\u003cp\u003e“No, he won’t,” Sebastian said, sounding bored. “He’s going to die.”\u003c/p\u003e\n\u003cp\u003eMaia’s head jerked up. “Shut up,” she hissed. “Shut up, you—you thing—”\u003c/p\u003e\n\u003cp\u003eHis wrist made a fast snapping motion—she had never seen anyone else move that fast, except maybe Jace—and the tip of the sword was at her throat. “Quiet, Downworlder,” he said. “Look how many lie dead around you. Do you think I would hesitate to kill one more?”\u003c/p\u003e\n\u003cp\u003eShe swallowed but didn’t lean away. “Why? I thought your war was with the Shadowhunters—”\u003c/p\u003e\n\u003cp\u003e“It’s rather a long story,” he drawled. “Suffice it to say that the London Institute is annoyingly well protected, and the Praetor has paid the price. I was going to kill someone today. I just wasn’t sure who when I woke up this morning. I do love mornings. So full of possibilities.”\u003c/p\u003e\n\u003cp\u003e“The Praetor has nothing to do with the London Institute—”\u003c/p\u003e\n\u003cp\u003e“Oh, you’re wrong there. There’s quite a history. But it’s unimportant. You’re correct that my war is with the Nephilim, which means I am also at war with their allies. This”—and he swung his free hand back to indicate the burned ruins behind him—“is my message. And you will deliver it for me.”\u003c/p\u003e\n\u003cp\u003eMaia began to shake her head, but felt something grip her hand—it was Jordan’s fingers. She looked down at him. He was bone white, his eyes searching hers. Please, they seemed to say. Do what he asks.\u003c/p\u003e\n\u003cp\u003e“What message?” she whispered.\u003c/p\u003e\n\u003cp\u003e“That they should remember their Shakespeare,” he said. “ ‘I’ll never pause again, never stand still, till either death hath closed these eyes of mine, or fortune given me measure of revenge.’ ” Lashes brushed his bloody cheek as he winked. “Tell all the Downworlders,” he said. “I am in pursuit of vengeance, and I will have it. I will deal this way with any who ally themselves with Shadowhunters. I have no argument with your kind, unless you follow the Nephilim into battle, in which case you will be food for my blade and the blades of my army, until the last of you is cut from the surface of this world.” He lowered the tip of his sword, so that it brushed down the buttons of her shirt, as if he meant to slice it off her body. He was still grinning when he drew the sword back. “Think you can remember that, wolf girl?”\u003c/p\u003e\n\u003cp\u003e“I . . .”\u003c/p\u003e\n\u003cp\u003e“Of course you can,” he said, and glanced down at Jordan’s body, which had gone still in her arms. “Your boyfriend’s dead, by the way,” he added. He slid his sword into the scabbard at his waist and walked away, his boots sending up puffs of ash as he went.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp; \u0026nbsp;\u003c/p\u003e\n\u003cp\u003eMagnus hadn’t been inside the Hunter’s Moon since it had been a speakeasy during the years of Prohibition, a place where mundanes had gathered quietly to drink themselves blackout drunk. Sometime in the 1940s it had been taken over by Downworlder owners, and had catered to that clientele—primarily werewolves—ever since. It had been seedy then and was seedy now, the floor covered with a layer of sticky sawdust. There was a wooden bar with a flecked countertop, marked with decades of rings left by damp glasses and long claw scratches. Sneaky Pete, the bartender, was in the middle of serving a Coke to Bat Velasquez, the temporary head of Luke’s Manhattan wolf pack. Magnus squinted at him thoughtfully.\u003c/p\u003e\n\u003cp\u003e“Are you eyeing up the new wolf pack leader?” asked Catarina, who was squeezed into the shadowy booth beside Magnus, her blue fingers curled around a Long Island Iced Tea. “I thought you were over werewolves after Woolsey Scott.”\u003c/p\u003e\n\u003cp\u003e“I’m not eyeing him up,” Magnus said loftily. Bat wasn’t bad-looking, if you liked them square-jawed and broad-shouldered, but Magnus was deep in thought. “My mind was on other things.”\u003c/p\u003e\n\u003cp\u003e“Whatever it is, don’t do it!” said Catarina. “It’s a bad idea.”\u003c/p\u003e\n\u003cp\u003e“And why do you say that?”\u003c/p\u003e\n\u003cp\u003e“Because they’re the only kind you have,” she said. “I have known you a long time, and I am absolutely certain on this subject. If you are planning to become a pirate again, it’s a bad idea.”\u003c/p\u003e\n\u003cp\u003e“I don’t repeat my mistakes,” Magnus said, offended.\u003c/p\u003e\n\u003cp\u003e“You’re right. You make all new and even worse mistakes,” Catarina told him. “Don’t do it, whatever it is. Don’t lead a werewolf uprising, don’t do anything that might accidentally contribute to the apocalypse, and don’t start your own line of glitter and try to sell it at Sephora.”\u003c/p\u003e\n\u003cp\u003e“That last idea has real merit,” Magnus remarked. “But I’m not contemplating a career change. I was thinking about . . .”\u003c/p\u003e\n\u003cp\u003e“Alec Lightwood?” Catarina grinned. “I’ve never seen anyone get under your skin like that boy.”\u003c/p\u003e\n\u003cp\u003e“You haven’t known me forever,” Magnus muttered, but it was halfhearted.\u003c/p\u003e\n\u003cp\u003e“Please. You made me take the Portal job at the Institute so you wouldn’t have to see him, and then you showed up anyway, just to say good-bye. Don’t deny it; I saw you.”\u003c/p\u003e\n\u003cp\u003e“I didn’t deny anything. I showed up to say good-bye; it was a mistake. I shouldn’t have done it.” Magnus tossed back a slug of his drink.\u003c/p\u003e\n\u003cp\u003e“Oh, for goodness’ sake,” Catarina said. “What is this about, really, Magnus? I’ve never seen you so happy as you were with Alec. Usually when you’re in love, you’re miserable. Look at Camille. I hated her. Ragnor hated her—”\u003c/p\u003e\n\u003cp\u003eMagnus put his head down on the table.\u003c/p\u003e\n\u003cp\u003e“Everyone hated her,” Catarina went on ruthlessly. “She was devious and mean. And so your poor sweet boyfriend got suckered by her; well, really, is that any reason to end a perfectly good relationship? It’s like siccing a python on a bunny rabbit and then being angry when the bunny rabbit loses.”\u003c/p\u003e\n\u003cp\u003e“Alec is not a bunny rabbit. He’s a Shadowhunter.”\u003c/p\u003e\n\u003cp\u003e“And you’ve never dated a Shadowhunter before. Is that what this is?” \u003c/p\u003e","sourceLink":"https://allnovel.net/city-of-heavenly-fire-the-mortal-instruments-6/page-9.html","bookId":2008,"creation":"Oct 5, 2019 6:43:45 PM","modification":"Oct 5, 2019 6:43:45 PM"}
