{"id":65951,"no":24,"title":"Page 24","content":"\u003cp\u003eRecalling it now, Kira knew, suddenly and with clarity, what it all meant. It was so simple.\u003c/p\u003e\n\u003cp\u003eThe three of them — the new little Singer who would one day take the chained Singer\u0027s place; Thomas the Carver, who with his meticulous tools wrote the history of the world; and she herself, the one who colored that history — they were the artists who could create the future.\u003c/p\u003e\n\u003cp\u003eKira could feel it in her fingertips: her ability to twist and weave the colors into the scenes of amazing beauty that she had made all alone, before they assigned her the task of the robe. Thomas had told her that once he too had carved astonishing things into wood that seemed to come alive in his hands. And she could hear the high, haunting melody that the child had sung in her magical voice, solitary in her room, before they had forced her from it and given her their own song to sing.\u003c/p\u003e\n\u003cp\u003eThe guardians with their stern faces had no creative power. But they had strength and cunning, and they had found a way to steal and harness other people\u0027s powers for their own needs. They were forcing the children to describe the future they wanted, not the one that could be.\u003c/p\u003e\n\u003cp\u003eKira watched the garden tremble and move as it slept. She saw the newly planted woad settle in, nestled where she had laid it gently beside the yellow bedstraw. \"Mostly it dies after flowering once,\" Annabella had said, describing woad. \"But sometimes you find a small shoot lives.\"\u003c/p\u003e\n\u003cp\u003eIt was those small living shoots she had planted, and something in Kira knew without a doubt that they would survive. She knew something else as well, and with the realization, she rose from the damp grass to go indoors, to find her father and tell him that she could not be his eyes. That she must stay.\u003c/p\u003e\n\u003cp\u003eMatt was the one who would lead Christopher home.\u003c/p\u003e\n\u003cp\u003eLate at night they gathered, at the edge of the path that led away from the village, the same path that would wind past Annabella\u0027s clearing and continue onward for days to the village of the healing people. Matt was prancing about, eager to begin the journey, proud of his role as the leader. Branch, also eager to set off on an adventure, sniffed and wandered here and there.\u003c/p\u003e\n\u003cp\u003e\"I know you be missing me horrid,\" Matt confided, \"and maybe I be gone a long time, because maybe they be wanting me to visit.\"\u003c/p\u003e\n\u003cp\u003eHe turned to Christopher. \"They gots plenty of food all the time? For visitors? And doggies?\"\u003c/p\u003e\n\u003cp\u003eChristopher, smiling, nodded yes.\u003c/p\u003e\n\u003cp\u003eThen Matt took Kira aside to whisper an important secret. \"I know you can\u0027t be getting a hubby because of your horrid gimp,\" he said in a low, apologetic voice.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right,\" she reassured him.\u003c/p\u003e\n\u003cp\u003eHe tugged at her sleeve eagerly. \"I been wanting to tell you that them other people — them broken ones? They gets married. And I seen a boy there, a two-syllable boy, not even broken, just about the same age as you.\u003c/p\u003e\n\u003cp\u003e\"I bet you could marry him,\" Matt announced in a solemn whisper, \"iffen you want to.\"\u003c/p\u003e\n\u003cp\u003eKira hugged him. \"Thanks, Matt,\" she whispered back. \"I don\u0027t want to.\"\u003c/p\u003e\n\u003cp\u003e\"His eyes be a very amazing blue,\" Matt said importantly, as if it might matter.\u003c/p\u003e\n\u003cp\u003eBut Kira smiled and shook her head no.\u003c/p\u003e\n\u003cp\u003eThomas carried the bundle of food they had saved and packed; there, at the beginning of the path, he transferred it to Christopher\u0027s strong back. Then the two shook hands.\u003c/p\u003e\n\u003cp\u003eKira waited silently.\u003c/p\u003e\n\u003cp\u003eHer father understood her decision. \"You will come when you can,\" he said to her. \"Matt will go back and forth. He will be our tie. And one day he will bring you.\"\u003c/p\u003e\n\u003cp\u003e\"One day our villages will know each other,\" Kira assured him. \"I can feel that already.\" It was true. She could feel the future through her hands, in the pictures her hands were urging her to make. She could feel the broad undecorated expanse waiting, across the shoulders of the robe.\u003c/p\u003e\n\u003cp\u003e\"I have a gift for you,\" her father told her.\u003c/p\u003e\n\u003cp\u003eShe looked at him, puzzled. He had come empty-handed and had lived in hiding for the past few days. But now he put something soft into her hands, something that had a quality of comfort.\u003c/p\u003e\n\u003cp\u003eShe could sense but could not see, in the darkness, what it was.\u003c/p\u003e\n\u003cp\u003e\"Threads?\" she asked. \"A bundle of threads?\"\u003c/p\u003e\n\u003cp\u003eHer father smiled. \"I had time, sitting alone, while I waited to return. And my hands are very clever because they have learned to do things unseeing.\u003c/p\u003e\n\u003cp\u003e\"Bit by bit I unraveled the fabric of my blue shirt,\" he explained. \"The boy found me another to wear.\"\u003c/p\u003e\n\u003cp\u003e\"I filched it,\" Matt announced with matter-of-fact pride.\u003c/p\u003e\n\u003cp\u003e\"So you will have blue threads,\" her father went on, \"while you wait for your plants to come to life.\"\u003c/p\u003e\n\u003cp\u003e\"Goodbye,\" Kira whispered, and hugged her father. She watched through the darkness as the blind man, the renegade boy, and the bent-tailed dog set off down the path. Then, when she could see them no longer, she turned and walked back to what lay waiting. The blue was gathered in her hand, and she could feel it quiver, as if it had been given breath and was beginning to live. \u003c/p\u003e","sourceLink":"https://allnovel.net/gathering-blue-the-giver-quartet-2/page-24.html","bookId":1702,"creation":"Oct 5, 2019 9:59:33 AM","modification":"Oct 5, 2019 9:59:33 AM"}
