{"id":26412,"no":29,"title":"The Court Circular","content":"\u0026nbsp;The Anglican system of submission has been transplanted intact to the soil of America. When King George the Third lost the sovereignty of the colonies, the bishops of his divinely inspired church lost the control of the clergy across the seas; but this revolution was purely one of Church politics—in doctrine and ritual the \"Protestant Episcopal Church of America\" remained in every way Anglican. The little children of our free republic are taught the same slave-catechism, \"to order myself lowly and reverently to all my betters.\" The only difference is that instead of being told \"to honour and obey the King,\" they are told \"to honour and obey the civil authority.\" \n\u003cdiv\u003e\n It is the Church of Good Society in England, and it is the same in\n\u003c/div\u003e \n\u003cdiv\u003e\n Boston, New York, Philadelphia, Baltimore, Washington, Charleston. Just\n\u003c/div\u003e \n\u003cdiv\u003e\n as our ruling classes have provided themselves with imitation English\n\u003c/div\u003e \n\u003cdiv\u003e\n schools and imitation English manners and imitation English clothes—so\n\u003c/div\u003e \n\u003cdiv\u003e\n in their Heaven they have provided an imitation English monarch. I\n\u003c/div\u003e \n\u003cdiv\u003e\n wonder how many Americans realize the treason to democracy they are\n\u003c/div\u003e \n\u003cdiv\u003e\n committing when they allow their children to be taught a symbolism and\n\u003c/div\u003e \n\u003cdiv\u003e\n liturgy based upon absolutist ideas. I take up the hymn-book—not the\n\u003c/div\u003e \n\u003cdiv\u003e\n English, but the sturdy, independent, democratic American hymn-book.\n\u003c/div\u003e \n\u003cdiv\u003e\n I have not opened it for twenty years, yet the greater part of its\n\u003c/div\u003e \n\u003cdiv\u003e\n contents is as familiar to me as the syllables of my own name. I read:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;Holy, holy, holy! All the saints adore Thee, \u0026nbsp;Casting down their\n\u003c/div\u003e \n\u003cdiv\u003e\n golden crowns around the glassy sea; Cherubim and seraphim bowing down\n\u003c/div\u003e \n\u003cdiv\u003e\n before Thee, Which wert, and art, and ever more shall be!\n\u003c/div\u003e \n\u003cdiv\u003e\n One might quote a hundred other hymns made thus out of royal imagery. I turn at random to the part headed \"General,\" and find that there is hardly one hymn in which there is not \"king..... throne,\" or some image of homage and flattery. The first hymn begins—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Ancient of days, Who sittest, throned in glory;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; To Thee all knees are bent, all voices pray.\n\u003c/div\u003e \n\u003cdiv\u003e\n And the second—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Christ, whose glory fills the skies—-\n\u003c/div\u003e \n\u003cdiv\u003e\n And the third—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Lord of all being, throned afar,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; Thy glory flames from sun and star.\n\u003c/div\u003e \n\u003cdiv\u003e\n There is a court in Heaven above, to which all good Britons look up, and about which they read with exactly the same thrills as they read the Court Circular. The two courts have the same ethical code and the same manners; their Sovereigns are jealous, greedy of attention, self-conscious and profoundly serious, punctilious and precise; their existence consisting of an endless round of ceremonies, and they being incapable of boredom. No member of the Royal Family can escape this regime even if he wishes; and no more can any member of the Holy Family—not even the meek and lowly Jesus, who chose a carpenter\u0027s wife for his mother, and showed all his earthly days a preference for low society.\n\u003c/div\u003e \n\u003cdiv\u003e\n This unconventional Son lived obscurely; he never carried weapons, he could not bear to have so much as a human ear cut off in his presence. But see how he figures in the Court Circular:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;The Son of God goes forth to war,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; A kingly crown to gain:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; His blood-red banner streams afar:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; Who follows in His train?\n\u003c/div\u003e \n\u003cdiv\u003e\n This carpenter\u0027s son was one of the most unpretentious men on earth; utterly simple and honest—he would not even let anyone praise him. When some one called him \"good Master,\" he answered, quickly, \"Why callest thou me good? There is none good save one, that is, God.\" But this simplicity has been taken with deprecation by his church, which persists in heaping compliments upon him in conventional, courtly style:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;The company of angels\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; Are praising Thee on high;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; And mortal men, and all things\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; Created, make reply: \u0026nbsp;All Glory, laud and honour,\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp; To Thee, Redeemer, King.....\n\u003c/div\u003e \n\u003cdiv\u003e\n The impression a modern man gets from all this is the unutterable boredom that Heaven must be. Can one imagine a more painful occupation than that of the saints—casting down their golden crowns around the glassy sea—unless it be that of the Triumvirate itself, compelled to sit through eternity watching these saints, and listening to their mawkish and superfluous compliments!\n\u003c/div\u003e \n\u003cdiv\u003e\n But one can understand that such things are necessary in a monarchy; they are necessary if you are going to have Good Society, and a Good Society church. For Good Society is precisely the same thing as Heaven; that is, a place to which only a few can get admission, and those few are bored. They spend their time going through costly formalities—not because they enjoy it, but because of its effect upon the populace, which reads about them and sees their pictures in the papers, and now and then is allowed to catch a glimpse of their physical Presences, as at the horse-show, or the opera, or the coaching-parade.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3228/88198.html","bookId":689,"creation":"Aug 4, 2019 1:14:53 AM","modification":"Aug 4, 2019 1:14:53 AM"}
