{"id":67477,"no":118,"title":"Page 118","content":"\u003cp\u003e“So you talked to her?” She found that hard to believe.\u003c/p\u003e\n\u003cp\u003e“She was too far away and, as I said, I was inside. But I ran out of the place and took off after her.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“She was gone. Disappeared.”\u003c/p\u003e\n\u003cp\u003e“You didn’t catch up to her? You didn’t speak to her? You didn’t even see her up close?”\u003c/p\u003e\n\u003cp\u003eHe glowered into the night. “It was Allie.”\u003c/p\u003e\n\u003cp\u003eCassie felt cheated. “Everyone thinks they catch sight of her. Here, there, in Portland, or in LA, or wherever. People call in, I know. Mom told me. I even thought I saw her a couple of times, but she was never close enough to talk to or to catch up with.” Disgusted and deflated, she added, “It’s probably just what people want to see, or a trick of light. You really think Allie, who’s been missing all this time, is going to just take a stroll along the riverfront in Oregon City? Does that make any sense?”\u003c/p\u003e\n\u003cp\u003eHe leaned back against the seat. “I don’t know. Does anything?”\u003c/p\u003e\n\u003cp\u003eShe stared through the window and through the foggy glass, watched as a man and a woman linked arm in arm, both wearing jeans and bundled in thick jackets, crossed against the light. He suddenly grabbed her hand with the swiftness of a striking snake, opening her fingers and plucking the key from her before she could even cry out.\u003c/p\u003e\n\u003cp\u003e“Hey!” Heart thudding, she scrabbled for the door handle as he jammed the key into the ignition. He switched on the electrical system without engaging the engine and rolled his window down a crack just as she got her door open. Then he clicked open the glove box and reached inside. As he did a large plastic bag fell out of the crammed compartment. The clear sack tumbled onto the floor at Cassie’s feet.\u003c/p\u003e\n\u003cp\u003eCassie scooped it up and tried to make out the contents. “What’s this?” she asked, shaking the bag and seeing small makeup bottles, false eyelashes, and small prosthetics often used by makeup people to change an actor’s appearance.\u003c/p\u003e\n\u003cp\u003eHe hesitated, then grinned sheepishly as he plucked the plastic bag from her fingers. “Sometimes I need a disguise.”\u003c/p\u003e\n\u003cp\u003e“False eyelashes?”\u003c/p\u003e\n\u003cp\u003e“Whatever.” Again the smile, one used to distract her. “I like to go incognito.”\u003c/p\u003e\n\u003cp\u003e“As a woman?”\u003c/p\u003e\n\u003cp\u003e“Or a very pretty man.” He shrugged, chuckling a bit, then stuffed the bag into the box, where he scrounged around and retrieved a pack of cigarettes. Then he slammed the box closed and locked it. “I told you. I just need a cigarette.”\u003c/p\u003e\n\u003cp\u003e“Fine,” she said, not really caring what his secrets were. It was late and she was getting more irritated by the second. “But I drove all the way down here to talk to you. In the middle of the damned night. And all you tell me is that you think you saw Allie from a distance. Be sure to tell Whitney Stone so she can blow it up, make a story out of nothing.”\u003c/p\u003e\n\u003cp\u003e“I know. I know. Stone’s been on my ass, too,” he muttered. “Along with about a million other reporters.” He blew out a stream of smoke. “But there’s more.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she said, her voice tight. She was starting to think he was completely full of shit.\u003c/p\u003e\n\u003cp\u003eA car rounded the corner and she yanked the door firmly shut. The sports car roared past, music blaring, bass throbbing.\u003c/p\u003e\n\u003cp\u003e“Check out this text,” McNary said, pulling out his cell phone and tossing it to her.\u003c/p\u003e\n\u003cp\u003e“From Allie?” She didn’t believe it, but glanced down at the phone.\u003c/p\u003e\n\u003cp\u003e“Yeah.” He drew deeply on his filter tip. “Think so.”\u003c/p\u003e\n\u003cp\u003eThe screen message said: I’m okay.\u003c/p\u003e\n\u003cp\u003eDisbelieving, she said, “This isn’t Allie’s number.”\u003c/p\u003e\n\u003cp\u003e“It’s no one’s number, I tried to call it back. It’s a phone with a different SIM card or a prepaid burner phone or something. Untraceable.”\u003c/p\u003e\n\u003cp\u003e“To you, maybe. But the police might have ways. But still . . . just a text that says ‘I’m okay’? Anyone could have sent it.”\u003c/p\u003e\n\u003cp\u003e“She wanted to let me know she’s all right.” He didn’t believe it, though. His expression was of uncertainty and bewilderment, but then, he was an actor.\u003c/p\u003e\n\u003cp\u003e“Why text. Why not call? Or leave a decent message explaining where she is? Why not use her real phone, or better yet, if she can text, why doesn’t she just show up so everyone who cares about her isn’t worried sick!” Cassie was getting angry now, the smoldering rage that had been with her since before she’d admitted herself to Mercy Hospital beginning to catch fire again. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-118.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
