{"id":67480,"no":121,"title":"Page 121","content":"\u003cp\u003eShe’d let herself get scared spitless over nothing. Slowly releasing the breath she hadn’t known she was holding, she dashed through the rain and heard no more footsteps chasing after her. She went past the hospital in search of her car.\u003c/p\u003e\n\u003cp\u003eThe night, aside from a few cars on the street, was still. She’d been foolish, letting her imagination get the better of her. Again. If she wasn’t careful she’d end up back in Mercy Hospital trying to convince Dr. Sherling that she really was sane.\u003c/p\u003e\n\u003cp\u003eStill, she kept running until she spied her Honda, where she’d left it, parked on the other side of the hospital, closer to the main entrance. Unlocking it on the fly with her key fob, she heard the familiar sound of its beep and saw its lights flash as the locks released. Good. She was breathing hard by now. As she reached the driver’s side, she took a sweeping glance of the back seat, saw it was empty, no bogeyman lying in wait, then slid inside.\u003c/p\u003e\n\u003cp\u003eChiding herself for her case of nerves most likely from being a horror film fanatic, she started the car, locked its doors, and tore out of the parking space. She’d call Trent once she was out of the city and she could talk in her normal voice again, once the panic in her bloodstream had totally dissipated. She’d have to cop to the fact that McNary had lured her for God knew what reason on a wild goose chase. She wasn’t looking forward to that.\u003c/p\u003e\n\u003cp\u003eAs she wound her way to the freeway, she passed a coffee shop that was closed for the night. Her headlights reflected on the glass of the storefront and, for just a second, she thought she caught a glimpse of a woman who looked like Allie tucked into the alcove of the doorway. But the woman’s face and upper body were in shadow, only her booted feet and bottom of her jeans really discernible. It was just an image, a thought, probably powered by the fact that she’d been talking about and thinking of her sister all night.\u003c/p\u003e\n\u003cp\u003eAt the next red light, she slowed and while the Honda idled she stared into the rearview mirror. Had it been Allie?\u003c/p\u003e\n\u003cp\u003e“Stop it,” she said aloud, but her mind kept circling back.\u003c/p\u003e\n\u003cp\u003eHad she even seen someone in the doorway?\u003c/p\u003e\n\u003cp\u003eIf so, was it a woman?\u003c/p\u003e\n\u003cp\u003eAnd then the shadow moved, a figure slipped from the alcove and stood on the street in the pouring rain.\u003c/p\u003e\n\u003cp\u003e“Allie,” Cassie mouthed, dumbstruck. She rolled down her window. “Allie!” she yelled.\u003c/p\u003e\n\u003cp\u003eThe light turned green. Behind her, a car was approaching. Fast. The driver laid on his horn, then blinked his lights, nearly blinding her, as a bus heading in the opposite direction rolled through the intersection.\u003c/p\u003e\n\u003cp\u003eCassie froze. The bus slowed, exhaust pluming, obscuring the face of the building as the van behind her zoomed past, the driver shaking his head. Once the rig was out of the way, Cassie hit the gas and did a quick and very illegal U-turn.\u003c/p\u003e\n\u003cp\u003eOverhead, a traffic cam flashed.\u003c/p\u003e\n\u003cp\u003eCrap!\u003c/p\u003e\n\u003cp\u003eWell, it was just too damned bad. So she got a ticket? So what? It didn’t matter if she could just get to Allie!\u003c/p\u003e\n\u003cp\u003eThe bus, not expecting her to be suddenly upon it, rolled into the lane in front of her. Cassie stood on her brakes.\u003c/p\u003e\n\u003cp\u003eHer car screeched to a halt, sliding on the wet pavement as the lumbering city bus rolled away, gathering steam and belching exhaust.\u003c/p\u003e\n\u003cp\u003eHer pulse on overdrive, her headache throbbing, Cassie glanced into the shadowy alcove of the doorway to the coffee shop.\u003c/p\u003e\n\u003cp\u003eIt was empty.\u003c/p\u003e\n\u003cp\u003eThe woman who’d been waiting there had vanished.\u003c/p\u003e\n\u003cp\u003eCHAPTER 26\u003c/p\u003e\n\u003cp\u003eSlap. Slap. Slap.\u003c/p\u003e\n\u003cp\u003eBrandi Potts’s new running shoes pinched her toes a little and were getting wet as she ran through the city streets. It was later than she liked to run, as it was after midnight. If she weren’t so fast and didn’t always travel with her small canister of pepper spray, she might have been worried. But tonight, pounding through the Portland streets, music pulsing from her iPhone, she felt invincible, just as she always did when her endorphins kicked in. Right now, with the rainfall increasing and only a couple of miles left on her run, those little feel-goods were definitely horse-kicking in.\u003c/p\u003e\n\u003cp\u003eAround a corner, across a street against the light, faster and faster she tore along the sidewalks and paths, feeling the exhilaration of rain against her face, listening to an up-tempo song from Katy Perry as she cut through the park. The thought of a hot shower, good book, and tumbling into bed were her incentive. That, and needing to have a personal best in her next race. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-121.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
