{"id":67486,"no":127,"title":"Page 127","content":"\u003cp\u003e“As I said, we’ve got a couple of uniforms checking out her apartment to see if anyone’s home. Thought you and I might roll over there.”\u003c/p\u003e\n\u003cp\u003eNash stared down at the victim’s face, a beautiful face, a young face, wet with the rain. As always, Nash felt an overwhelming sense of despair when she viewed a young life taken by another. The senselessness of it all. She wondered at the psyche of human beings. Who would shoot this woman? Her gaze traveled from Brandi Potts’s face to her torso and the thick, dark stain beneath her, staining her tight running jacket.\u003c/p\u003e\n\u003cp\u003eAs if reading her thoughts, Double T said, “Found this searching for shell casings.” He held up a small canister that winked in the weak lamplight.\u003c/p\u003e\n\u003cp\u003e“Mace?”\u003c/p\u003e\n\u003cp\u003e“Pepper spray.”\u003c/p\u003e\n\u003cp\u003e“It was hers?” She nodded toward the dead woman.\u003c/p\u003e\n\u003cp\u003e“Won’t know until we fingerprint it. Maybe not then. Waiting for the crime scene guys.” He glanced down the street. “Where the hell are they? Shoulda been here by now.”\u003c/p\u003e\n\u003cp\u003e“What about the ME?”\u003c/p\u003e\n\u003cp\u003e“On his way, too.” Double T looked down at the body again. “Looks like the shooting occurred less than half an hour ago. That’s according to the witnesses, and the body’s still warm.”\u003c/p\u003e\n\u003cp\u003eSo less than an hour ago, this woman was alive. Until someone decided to change all that. Nash’s gut tightened. “I’ll want to talk to any witnesses. Keep them here.” She looked again at the corpse, lips blue, skin ashen. “Where’s the mask?”\u003c/p\u003e\n\u003cp\u003e“In my car. The first responders had the presence of mind to take pictures before removing it. They had to take it off to try to save the vic, but she was gone already.”\u003c/p\u003e\n\u003cp\u003e“Forensics isn’t going to like it.”\u003c/p\u003e\n\u003cp\u003e“Too bad.” He walked her to his Jeep and she noticed a small crowd was gathering around the barricades, people milling as near to the scene as they could get, vultures wearing rain hats and hoods, sweatshirts and slickers, even a couple with umbrellas, all twisting their necks to catch a peek.\u003c/p\u003e\n\u003cp\u003e“We need a shot of the people who’ve come out in the rain to get a look.”\u003c/p\u003e\n\u003cp\u003e“Already got an officer on it.”\u003c/p\u003e\n\u003cp\u003e“It’s amazing that many people are up.”\u003c/p\u003e\n\u003cp\u003e“Big city. Night dwellers.”\u003c/p\u003e\n\u003cp\u003e“Well, I want to know who they are, what they saw.” The story was definitely breaking as a reporter and cameraman were already talking to the by-the-book cop, trying to get information. Looking up, Nash saw lights from the surrounding apartments coming to life, the occupants inside standing at the windows or on the decks. A second news van arrived and was trying to wedge into a parking spot. “Looks like we’re having a damned party here.”\u003c/p\u003e\n\u003cp\u003e“You know this is always how it is.” Unruffled by the looky-loos who bugged the crap out of Nash, Double T unlocked his vehicle, then reached onto the front seat and withdrew a plastic envelope. He handed it to Nash.\u003c/p\u003e\n\u003cp\u003eThrough the clear plastic, she viewed the image, which was, as Double T had said, a warped, laminated picture of Jenna Hughes cut into a mask, complete with an elastic band. Jenna’s eyes were missing, the two jagged black holes that remained only making the bizarre image appear more evil. “Jesus,” Nash whispered as she flipped the envelope over and saw that on the back of the mask, just as Double T had said, was a single word scrawled wildly in red letters: Mother.\u003c/p\u003e\n\u003cp\u003eThe meaning was obvious.\u003c/p\u003e\n\u003cp\u003e“So Jenna Hughes is Cassie and Allie Kramer’s mother. Allie’s missing, but Cassie’s back in the area.”\u003c/p\u003e\n\u003cp\u003eDouble T nodded. “Yep.”\u003c/p\u003e\n\u003cp\u003eHer eyes narrowed on the back of the mask and the stark clue. “Makes you wonder.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“Hopefully, the killer left prints.”\u003c/p\u003e\n\u003cp\u003e“Yep. We’ll look into it.”\u003c/p\u003e\n\u003cp\u003e“Does Jenna Hughes have any other kids?”\u003c/p\u003e\n\u003cp\u003e“Not that I know of.”\u003c/p\u003e\n\u003cp\u003e“What about any other family members who are on the outs with her or jealous of her and her daughters? Someone with a grudge. A major grudge.”\u003c/p\u003e\n\u003cp\u003e“Again, unknown.”\u003c/p\u003e\n\u003cp\u003e“We should double-check.”\u003c/p\u003e\n\u003cp\u003eHe nodded, rain dripping from the brim of his cap just as the ME’s van arrived. A second later the forensic team’s vehicle appeared. “Showtime,” she said, handing the plastic case back to her partner. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-127.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
