{"id":67487,"no":128,"title":"Page 128","content":"\u003cp\u003e“Let’s talk to the witnesses.”\u003c/p\u003e\n\u003cp\u003eHe locked the mask in his Jeep again, then hitched his chin to a heavy-set woman of about fifty. Pale as death, she was bundled in a ski jacket, jeans, and boots. She held an oversize umbrella aloft even though she stood under the awning of a store whose window display was filled with baby clothes and toys.\u003c/p\u003e\n\u003cp\u003e“Not a native,” Nash observed, and ignored a sharp little pang when she noticed a pink raincoat and matching boots in the window. Quickly, she moved her gaze, turning her attention to the witness.\u003c/p\u003e\n\u003cp\u003e“Peggy Gates. Just moved here from Phoenix.”\u003c/p\u003e\n\u003cp\u003e“Big change.”\u003c/p\u003e\n\u003cp\u003e“Yep. She’s recently divorced and living temporarily with her sister. Unit 806-B at the Jamison,” he said, indicating a building that rose at least fifteen stories. “Anyway, she says she couldn’t sleep, walked out on the balcony to look upriver. They’ve got a view of the Marquam and Hawthorne bridges, I guess. But ‘something’ on the street below caught her eye. Probably movement. She didn’t actually see the attack, but noticed a woman running toward the river, that direction.”\u003c/p\u003e\n\u003cp\u003e“She’s certain it was a woman?”\u003c/p\u003e\n\u003cp\u003e“No. She admitted it might be a small, thin man with long, dark hair, but the way the person moved, she’s leaning toward a female.”\u003c/p\u003e\n\u003cp\u003eNash let her gaze follow along the path Gates had described.\u003c/p\u003e\n\u003cp\u003e“From her balcony, Gates could only see the victim’s head, but she realized the person needed help, so she hurried downstairs to check it out and flipped out when she saw the mask.”\u003c/p\u003e\n\u003cp\u003e“She didn’t call nine-one-one immediately?”\u003c/p\u003e\n\u003cp\u003e“She had to run back upstairs for her phone. Then she called. But by then she heard sirens heading this way.”\u003c/p\u003e\n\u003cp\u003e“The bouncer called it in.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“The guy next to her, I’m guessing.”\u003c/p\u003e\n\u003cp\u003e“Bingo.”\u003c/p\u003e\n\u003cp\u003eStanding a few feet from Gates was a burly African-American man who stood over six feet tall. His head was shaved and earrings glittered in the lamplight. In the driving rain he was bareheaded and wearing only a thin jacket over jeans and a black T-shirt. With his muscular arms folded over his chest, he looked like a black version of Mr. Clean.\u003c/p\u003e\n\u003cp\u003e“Conrad Jones,” Double T said. “Works down at The Ring, three blocks east.”\u003c/p\u003e\n\u003cp\u003e“Guess I’d better talk to them.”\u003c/p\u003e\n\u003cp\u003eAs she walked to the small group beneath the awning, she thought again about the mask and the word Mother scrawled over its back. It seemed like a too-obvious clue pointing toward either Allie or Cassie Kramer.\u003c/p\u003e\n\u003cp\u003eAn icy drop of rain slid down her neck and she shivered. It definitely felt like she was being played, and Detective Rhonda Nash didn’t like it one bit.\u003c/p\u003e\n\u003cp\u003e“In here.”\u003c/p\u003e\n\u003cp\u003eTrent’s voice stopped Cassie cold.\u003c/p\u003e\n\u003cp\u003eShe’d prayed he was asleep as she stepped through the front door of his house. She was late. Very late. He was obviously waiting up for her in the den.\u003c/p\u003e\n\u003cp\u003eCassie had lost track of time. Again. Worse yet, she didn’t know where she’d been. She remembered feeling as if she’d seen Allie and then following the bus and then . . . nothing. She couldn’t remember leaving the city, merging onto I-84 to head east. Somehow, she’d maneuvered her way back to Falls Crossing and Trent’s ranch, but she’d zoned out, driving by rote, her gas tank nearly as drained as the battery of her mobile phone.\u003c/p\u003e\n\u003cp\u003eShe’d finally snapped out of her reverie or whatever it was and become aware of where she was when she’d turned onto the lane leading to this farmhouse and parked near the garage. Then, gathering her courage and hoping Trent was fast asleep, she’d dashed through the storm to the wide porch, getting soaked in the process.\u003c/p\u003e\n\u003cp\u003eShe’d been careful of the door, winced when she heard it creak, and then had been greeted by Trent’s low voice.\u003c/p\u003e\n\u003cp\u003eNow she closed the door behind her.\u003c/p\u003e\n\u003cp\u003eA low woof from the den followed by clicking toenails on hardwood told Cassie that she’d woken the dog as well. She’d hoped to sneak in quietly, not waking either man or beast. It looked like she failed on both counts.\u003c/p\u003e\n\u003cp\u003eHud appeared in the doorway to the den, his tail wagging wildly and thudding against the jamb when he saw her. Wriggling, he sidled up to greet her with happy little yips. “Late, huh?” She bent down to pat his soft head. “Yeah. You’re a good boy,” she assured the dog, then straightened. Her hair was wet, her jeans damp, and the cold seemed to seep all the way to her bones. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-128.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
