{"id":67494,"no":135,"title":"Page 135","content":"\u003cp\u003eWhen the blackouts happened.\u003c/p\u003e\n\u003cp\u003eThe words rang in her brain and she blinked.\u003c/p\u003e\n\u003cp\u003eWhen they happened . . . the timing . . . could someone know?\u003c/p\u003e\n\u003cp\u003eHer mind started spinning. No. That was crazy, wasn’t it? Or could someone know about the blackouts? Someone who could use them to his or her advantage? How? She bit her lip. Of course people did know of her condition. It was documented in the hospital. But that was the very hospital where she’d thought she’d seen the nurse in the cape, the nurse who’d told her Allie was alive.\u003c/p\u003e\n\u003cp\u003eCassie shook her head. Was this too far-fetched? But it felt so right.\u003c/p\u003e\n\u003cp\u003eHer mental state wasn’t exactly a secret. While she hadn’t announced the fact that she’d checked herself into the psych ward at Mercy Hospital, the press had gotten wind of it and the story, along with the mystery of Allie’s disappearance, had been tabloid fodder for weeks. How many times had she spied her own face squared off with Allie’s, the two pictures photoshopped together and superimposed over the shadowy image of a creepy old hospital in the background? Anyone who walked through a checkout line at most stores in America could learn about the time she’d spent under a psychiatrist’s care in a Portland hospital.\u003c/p\u003e\n\u003cp\u003eBut who?\u003c/p\u003e\n\u003cp\u003eAnd why?\u003c/p\u003e\n\u003cp\u003eIf someone realized she could lose track of time, then ostensibly she could be made to appear culpable because of her own weakness. Really? Could that be done? It would have to be someone very close. Someone she knew or someone just a little further away, in the fringes of her acquaintances, someone hiding in the perimeter, watching her, someone who lurked nearer than she imagined?\u003c/p\u003e\n\u003cp\u003eA shiver ran down her spine.\u003c/p\u003e\n\u003cp\u003eOr was she just making excuses? Letting her paranoia run wild? She needed to pull herself together. Before her damned meeting with Detective Nash.\u003c/p\u003e\n\u003cp\u003eShe heard Trent approach, felt his touch on her shoulder as he stood next to her. “Hey.”\u003c/p\u003e\n\u003cp\u003eFrom the corner of her eye, she noticed the concern on his features, the shadows under his eyes. He, too, was suffering.\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to upset you, but you needed to be forearmed. I don’t want you to be blindsided. Okay? You need to be ready.”\u003c/p\u003e\n\u003cp\u003eShe wanted to sink against him, but resisted. “This isn’t just an interview, is it? The cops are going to arrest me.”\u003c/p\u003e\n\u003cp\u003e“Nah.” He shook his head, his eyes narrowing a bit, the first signs of crow’s-feet gathering near the corners of his eyes. “Don’t think so. Neither does Carter.”\u003c/p\u003e\n\u003cp\u003eShe stared. “You discussed it with him?” For years her husband and stepfather couldn’t stand to be in the same room with each other. Now they were allies? In cahoots? Talking behind her back?\u003c/p\u003e\n\u003cp\u003e“No, but I’m pretty sure he would have advised you not to talk without a lawyer present if he thought there was any threat of you being arrested.”\u003c/p\u003e\n\u003cp\u003e“I don’t know how many ways to say it, but I’m innocent. I don’t need a damned lawyer.”\u003c/p\u003e\n\u003cp\u003eHe didn’t reply. And the silence stretched between them, only the sigh of the wind and rustle of leaves in the trees audible. The hand on her shoulder gripped a little tighter as he finally said, “We’ll get through this.”\u003c/p\u003e\n\u003cp\u003e“Will we?” She sounded bitter and told herself he was only trying to help.\u003c/p\u003e\n\u003cp\u003e“Come on, Cass. You know it.” He hugged her, rotating her so that he could brush a kiss across her forehead.\u003c/p\u003e\n\u003cp\u003eHer heart nearly broke.\u003c/p\u003e\n\u003cp\u003e“You ready to come into the house now or do you want to stand out here and freeze?”\u003c/p\u003e\n\u003cp\u003e“I’ll be in. Just a sec, though. I need to grab a change of clothes—these are yesterday’s—from the car. Oh, and my cell. And a damned charger if I brought one.”\u003c/p\u003e\n\u003cp\u003e“If you didn’t, I’m pretty sure I’ve got one you can borrow.”\u003c/p\u003e\n\u003cp\u003e“Great.”\u003c/p\u003e\n\u003cp\u003eTogether they walked to her car. Her phone was where she’d left it on the passenger seat. “It’s probably dead,” she said, opening the door, “and filled with a kabillion messages from Whitney Stone. She still wants more information for upcoming episodes.”\u003c/p\u003e\n\u003cp\u003e“It’s hell to be popular,” he said, and she shot him a look that could cut through granite. He held up his hands, palms out, as if surrendering. “Hey, just trying to lighten the mood.” \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-135.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
