{"id":67499,"no":140,"title":"Page 140","content":"\u003cp\u003e“Whoa, whoa. Wait. Back up. Why is this the first time we’ve heard about a woman with information about Allie Kramer?”\u003c/p\u003e\n\u003cp\u003e“Well, that’s the ‘off the grid’ part. Turns out the woman was wearing an old-time nurse’s uniform, you know, with the stiff cap, white dress, and shoes? And there’s no nurse at the hospital fitting that description.”\u003c/p\u003e\n\u003cp\u003e“Of course,” she said dryly, her sandwich temporarily forgotten. “So . . . what’re you saying?”\u003c/p\u003e\n\u003cp\u003e“According to Carter—because I talked to him after I got the call from Sparks—Cassie Kramer didn’t want to come off sounding like some kind of a nut.”\u003c/p\u003e\n\u003cp\u003e“You mean more of a nut.”\u003c/p\u003e\n\u003cp\u003e“Yeah. That’s what I mean.”\u003c/p\u003e\n\u003cp\u003e“So now she’s got the OSP chasing ghosts?” she asked. She picked up her sandwich again.\u003c/p\u003e\n\u003cp\u003e“Maybe.”\u003c/p\u003e\n\u003cp\u003e“Good use of the taxpayers’ dollars,” she observed.\u003c/p\u003e\n\u003cp\u003e“There’s more.”\u003c/p\u003e\n\u003cp\u003e“Of course there is. Hopefully not more detective work courtesy of a patient in a mental ward.”\u003c/p\u003e\n\u003cp\u003e“Nope. According to Carter, they’re bringing in another mask.”\u003c/p\u003e\n\u003cp\u003e“What?” She was raising half the sandwich to her mouth, but stopped. “A mask? Like the ones found on the victims?”\u003c/p\u003e\n\u003cp\u003e“That’s right. Of Allie Kramer again, and yeah, all messed up. Disfigured.”\u003c/p\u003e\n\u003cp\u003eNash leaned back in her chair, her gaze pinned on her partner, her interest spiked. She felt a little uptick in her pulse. The mask actually linked Cassie to the crimes, was concrete physical evidence. “Why does she have a mask? How did she get it?”\u003c/p\u003e\n\u003cp\u003eOne side of his mouth lifted. “Get this: She claims it was left in her apartment in California, she found it in a suitcase after she thought her place was broken into.”\u003c/p\u003e\n\u003cp\u003e“She file a report?”\u003c/p\u003e\n\u003cp\u003e“No. Nothing was taken, nothing disturbed. She’s not really sure when the mask was left in her bag. It was a piece of luggage she hadn’t used for a while, or so she claims. The only reason she thinks it was left when she was in California this last time was because not only did she find it when she started packing up, but somehow the neighbor’s cat had gotten in and was trapped in her place and scared the hell out of her.”\u003c/p\u003e\n\u003cp\u003e“Whoa, whoa. Wait a second. Start over. Tell me the chain of events, I want to get this straight.” Nash pushed the remains of her sandwich aside and grabbed her pencil again before turning over a new page on her tablet. As Double T explained everything he’d heard about Cassie Kramer supposedly finding a mask in her luggage that sounded just like the ones left at the crime scenes, Nash took notes. It didn’t make any sense. If Cassie were the killer, why would she come up with a mask herself? To throw the police off? As yet, information about the masks being left on the victims hadn’t been leaked to the press. The few people who had seen the bodies, witnesses and cops, had so far held their tongues. So how the hell had Cassie Kramer come up with one?\u003c/p\u003e\n\u003cp\u003e“This really connects her,” Nash thought aloud.\u003c/p\u003e\n\u003cp\u003e“Or makes her a victim?”\u003c/p\u003e\n\u003cp\u003e“You mean makes her look like a victim.” Nash was playing devil’s advocate, as Double T’s doubts echoed her own, but she didn’t want to ignore the obvious just on principle or gut feelings.\u003c/p\u003e\n\u003cp\u003e“You don’t think she’s a vic?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“So you’re second-guessing yourself, too.”\u003c/p\u003e\n\u003cp\u003e“Just looking at the big picture,” she said, but still had the niggling feeling that something was off. She set her pencil down and rotated the computer monitor so that it was more visible to her partner. “Look who was out cruising late last night and got caught pulling a U-ey.”\u003c/p\u003e\n\u003cp\u003eDouble T let out a long, low whistle as he stared at the snapshot of Cassie Kramer behind the wheel of a Honda. “Nail-in-the-coffin time. All we need now is a murder weapon with her fingerprints on it.”\u003c/p\u003e\n\u003cp\u003e“Or a confession.” She started in on what was left of her sandwich again, but she barely tasted it as her mind was reeling ahead to the interview with Cassie Kramer, the questions she would ask. “This afternoon should be interesting.”\u003c/p\u003e\n\u003cp\u003e“Hopefully she doesn’t lawyer up.” He wadded up the waxy paper in which his sandwich had been wrapped and tossed it toward the wastebasket near her desk. Banking off the wall of her file cabinet, he hit the shot. “Two points.” He flashed her a smile. “See, the day’s getting better already.” \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-140.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
