{"id":67503,"no":144,"title":"Page 144","content":"\u003cp\u003e“You wrote back?” Nash said, staring at the screen. “But no response?”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“Why do you think it’s from Allie?”\u003c/p\u003e\n\u003cp\u003e“Who else?” Cassie asked.\u003c/p\u003e\n\u003cp\u003e“Someone pranking you?”\u003c/p\u003e\n\u003cp\u003e“It could be, but . . . I don’t know. I thought you might want to see it.”\u003c/p\u003e\n\u003cp\u003eNash nodded. “Can I keep this?”\u003c/p\u003e\n\u003cp\u003e“Yes.” Cassie hated handing over her phone, but knew the information on it could be accessed by the police through the phone company; all they needed was a search warrant, and though the detective would be searching through her phone’s contacts, texts, call log, and apps, she didn’t care. She didn’t have anything to hide and she wanted to prove it.\u003c/p\u003e\n\u003cp\u003eNevertheless, it made her nervous.\u003c/p\u003e\n\u003cp\u003eNash asked more questions about the night before. Over and over again, as if she hoped to trip Cassie up, but Cassie held firm, never once straying from her actions, both in Portland and in LA, keeping her missing hours to herself.\u003c/p\u003e\n\u003cp\u003eFinally, exhausting all her inquiries, Nash said, “I think Detective Hayes will want to talk to you.”\u003c/p\u003e\n\u003cp\u003e“Again,” Cassie corrected, her heart sinking. She was already going out of her mind, wanted to leave this place ASAP. “Is he here?”\u003c/p\u003e\n\u003cp\u003e“No. The interview will be by phone. We’re kind of changing it up a bit, if that’s okay with you.”\u003c/p\u003e\n\u003cp\u003e“Fine,” Cassie lied, but wondered if she were making a big mistake, if the police would twist her words, if she really should have refused to talk to them without an attorney as Trent had advised.\u003c/p\u003e\n\u003cp\u003e“It wouldn’t hurt to have counsel present,” Trent had suggested. He’d been driving, Cassie in the passenger seat of his pickup as they’d left his place. She’d glanced in the side view and had caught sight of Hud waiting on the porch. Her heart had squeezed and she’d felt a premonition of doom, had almost insisted Trent turn the truck around. But it would have only put off the inevitable.\u003c/p\u003e\n\u003cp\u003e“I’ve got nothing to hide,” she’d finally said, determined to get the damned interview over with.\u003c/p\u003e\n\u003cp\u003e“I know, but—”\u003c/p\u003e\n\u003cp\u003e“I can handle it,” she’d snapped, just as his cell phone had beeped. He’d glanced at the display. “It’s Carter,” he’d said, and answered, driving one-handed on the county road leading to I-84 heading west. The conversation had been quick and one-sided. “. . . Well, at least that’s something. Hopefully something will come of it . . . Yeah, we’re on our way there now. Thanks . . . How long? You would know better than me, I think. A couple of hours? . . . Yeah, both of us . . . call when you know more.... Okay. Thanks.”\u003c/p\u003e\n\u003cp\u003eHe’d hung up and said, “Carter says ‘Good luck.’ ”\u003c/p\u003e\n\u003cp\u003e“I’ll probably need it.”\u003c/p\u003e\n\u003cp\u003e“He’s also said Sparks ran down a lead on the Santa Fe. He and Carter are on their way to Molalla. They matched one of the 2007 Hyundais to a dealership out there.”\u003c/p\u003e\n\u003cp\u003e“And?”\u003c/p\u003e\n\u003cp\u003e“And this particular dealer sells all his cars with a license plate holder that not only has his name on it, but a little art.”\u003c/p\u003e\n\u003cp\u003e“Let me guess,” she said, astonished that Rinko’s obtuse lead would go anywhere. “It’s got a horse on it.”\u003c/p\u003e\n\u003cp\u003e“Actually a cowboy riding a bucking bronco in honor of the Molalla Buckeroo, a rodeo event the town holds every year. Apparently Belva Nelson lives in some little farm outside the city limits with her niece and husband. The niece’s name is Sonja Watkins. Ring any bells?”\u003c/p\u003e\n\u003cp\u003e“No.” She’d been certain. She’d never heard of either woman. “Who are they? How are they connected?”\u003c/p\u003e\n\u003cp\u003e“Carter isn’t sure, but here’s the kicker: Belva Nelson is in her seventies and an RN. She worked in Portland, but she’s retired now.”\u003c/p\u003e\n\u003cp\u003eCassie’s heart had skipped a beat. “Did she work at Mercy? In the psych ward?” Was it possible? Had Carter and Sparks located someone who purported to know that Allie was alive?\u003c/p\u003e\n\u003cp\u003e“Unknown. They’re working on it. This isn’t really a job for the state police. It’s Portland’s case, but Sparks is intrigued and is doing this on his own time.”\u003c/p\u003e\n\u003cp\u003e“Belva Nelson,” she’d repeated, but the name still meant nothing to her. “How . . . I mean how did she get into the hospital?” \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-144.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
