{"id":67509,"no":150,"title":"Page 150","content":"\u003cp\u003eIt will be short-lived. A temporary necessity. She swallowed hard, heard her own lie. She was only bolstering herself.\u003c/p\u003e\n\u003cp\u003e“Help me, Father,” she whispered and sketched the sign of the cross over her chest with one hand while holding tight to the wheel with her other. She noticed the crucifix dangling on a rosary she’d hung over her rearview mirror. The tiny silver cross swung backward, to and fro, as she negotiated the sharp S curves.\u003c/p\u003e\n\u003cp\u003eShould she go to the police?\u003c/p\u003e\n\u003cp\u003eShe bit her lip.\u003c/p\u003e\n\u003cp\u003eHad she broken any laws?\u003c/p\u003e\n\u003cp\u003eIt could be dangerous. No, Belva, it will be dangerous. Already people are paying the ultimate price. Deep in your soul, you know you’re involved. Even if you don’t acknowledge it, God knows. He sees.\u003c/p\u003e\n\u003cp\u003eOh, Lord, what to do? She had asked herself the same question over and over.\u003c/p\u003e\n\u003cp\u003eIt had all started so long ago.\u003c/p\u003e\n\u003cp\u003eShe’d been young and foolish at the time when she’d promised to keep her mouth shut and take the money she and her husband had so desperately needed. The economy had been lousy at the time and Jim had always had trouble holding down a job, even in good years. His affinity for whiskey had cost him a career and eventually his life.\u003c/p\u003e\n\u003cp\u003eBut never should she have listened to him and accepted payment for her silence. It was as if the devil himself had been whispering into her all-too-willing ears. She’d been a licensed RN at the time, but because of Jim moving from job to job, she’d never settled into one clinic or hospital for more than a year or so.\u003c/p\u003e\n\u003cp\u003eAnd so she’d ended up at Mercy.\u003c/p\u003e\n\u003cp\u003eAs a temporary employee, a nurse that “floated” from one area or floor to the next, to help out wherever she was needed most. Her job wasn’t secure in the least, and her hours had been cut over and over again.\u003c/p\u003e\n\u003cp\u003eSo she’d done the unthinkable.\u003c/p\u003e\n\u003cp\u003eShe’d not only sold out; she’d sold her soul in the process.\u003c/p\u003e\n\u003cp\u003eGod forgive me.\u003c/p\u003e\n\u003cp\u003eFor a second she thought God was speaking to her, that the little crucifix seemed to glow in the darkness, almost as if it were reflecting light, but that, of course, was impossible in this Stygian night where the rain mixed with fog, and she felt more isolated than she ever had in her life.\u003c/p\u003e\n\u003cp\u003eShe turned off at the lane that was barely visible, just twin ruts choked with weeds that cut through the ferns, berry vines, and fir trees. Branches scraped the sides of the SUV and mud splattered up from potholes as she veered into a clearing wherein her father’s old fishing cabin still sat. The wood walls had grayed, the roof was covered in moss, and the lean-to carport had collapsed years before. The porch sagged and a few stones had fallen off the chimney, but the rest of the cabin was sturdy enough, just dirty and in the middle of no-damned-where.\u003c/p\u003e\n\u003cp\u003eThis was definitely no way to live, she thought as the beams of her headlights washed against the windows.\u003c/p\u003e\n\u003cp\u003eFor just a second, she thought she saw a shadow behind the glass, a movement of the tattered curtains her mother had sewn decades before. But as she stared more closely, she saw nothing and decided her nerves were just stretched tight.\u003c/p\u003e\n\u003cp\u003eHer cell phone beeped and she jumped, her heart nearly collapsing. The screen lit up and she saw the message was from Sonja.\u003c/p\u003e\n\u003cp\u003eCops were here. Looking 4u.\u003c/p\u003e\n\u003cp\u003eBelva stared at the screen for a few minutes as she tried to calm down. The phone was a disposable that she’d bought a while back, supposedly untraceable, as was Sonja’s, but who really knew? She should never have stepped into this mess, should have gone directly to the police. Maybe the fact that they were tracking her down was a good sign. She wrote back: I will take care of it.\u003c/p\u003e\n\u003cp\u003eHow? You’re making promises you can’t keep.\u003c/p\u003e\n\u003cp\u003eK. Sonja had responded. Short for okay.\u003c/p\u003e\n\u003cp\u003eThat was it. Sonja was making as little contact as possible, as they’d agreed. “Message received,” Belva said and climbed out of the car. Once more she considered going to the police. Maybe they could protect her because once she broke her silence, she knew there would be hell to pay. In so many ways. She wasn’t the only one involved. Innocent people would be hurt.\u003c/p\u003e\n\u003cp\u003eThey already have, if your suspicions are correct.\u003c/p\u003e\n\u003cp\u003eAgain she made the sign of the cross and sent up a prayer as she made her way up the creaky stairs. Dear Lord, the night was cold. Damp. Fog drifting in smoke-like tendrils through the trees. She unlocked the door and stepped inside. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-150.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
