{"id":67518,"no":159,"title":"Page 159","content":"\u003cp\u003eHow did she know that Allie Kramer was alive and okay?\u003c/p\u003e\n\u003cp\u003eSonja Watkins wasn’t saying. If Belva Nelson’s niece had known any more, which Nash wholeheartedly believed, Ms. Watkins was keeping it to herself. Watkins had even mentioned she might not talk to the police any further except with an attorney present.\u003c/p\u003e\n\u003cp\u003eWhich probably meant she was guilty of some bigger crime.\u003c/p\u003e\n\u003cp\u003eNash intended to find out just what that was, after she talked to the retired nurse, the very nurse who, Nash had learned, had been in attendance at St. Mary’s Hospital when Jenna Hughes had delivered her first baby.\u003c/p\u003e\n\u003cp\u003e“Hey! Take it easy. She’s not goin’ anywhere,” Double T warned as her little Ford slid a bit and the forest grew more dense.\u003c/p\u003e\n\u003cp\u003e“You don’t know that. She might already be running like a damned rabbit!”\u003c/p\u003e\n\u003cp\u003e“She picked a great place for it. This is like the ends of the earth.”\u003c/p\u003e\n\u003cp\u003eNash almost smiled. Almost. Instead she adjusted the defroster as the windows were starting to cloud. Outside, it was dark as pitch, a wind blowing harshly, tree branches swaying in a wild macabre dance as they were caught in the glare of the Focus’s headlights. Not another car was on the skinny ribbon of asphalt that threatened to turn to gravel around each new bend.\u003c/p\u003e\n\u003cp\u003e“Jesus,” Double T said. “When she decided to hide, she wasn’t kidding around.”\u003c/p\u003e\n\u003cp\u003e“She was scared.”\u003c/p\u003e\n\u003cp\u003e“Don’t blame her. But up here in the middle of nowhere? This is better than the city?” Snorting in disgust, he clung to the handhold. “Don’t think so.”\u003c/p\u003e\n\u003cp\u003e“We’re almost there.”\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003eWhat did the nurse know about Allie Kramer’s disappearance? About the homicides?\u003c/p\u003e\n\u003cp\u003eWhoever was behind the murders hadn’t killed people randomly, then placed weird masks over their faces. No way. The killer had picked people associated with the film. Nash didn’t believe the choice of Holly Dennison and Brandi Potts as victims had been coincidental. Did Belva Nelson know why?\u003c/p\u003e\n\u003cp\u003eNash frowned. The pieces of the puzzle were finally starting to fit together, but there were still huge holes that Nash didn’t understand.\u003c/p\u003e\n\u003cp\u003eShe hoped Belva Nelson could fill in the gaps.\u003c/p\u003e\n\u003cp\u003eIn the meantime Nash had instructed Jenkins to cross-check any information on the birth of Jenna Nash’s secret child with everyone associated with Dead Heat, on the off-chance that Jenna’s first-born was somehow associated with the movie. It seemed far-fetched, as the connection to Jenna Hughes alone would explain the masks, at least to a deranged mind. So why bother using people connected to the movie as victims? And, in Potts’s case, an obscure connection. Not many people knew that Brandi Potts was an extra on the film. Only those close to the production of Dead Heat, those in the inner circle, would even know Potts existed.\u003c/p\u003e\n\u003cp\u003eA rush of adrenaline shot through Nash. Someone connected with the movie had to have had a personal vendetta against Allie Kramer. Cassie Kramer? Brandon McNary? Some other person who had become Allie’s enemy? Or the missing star of Dead Heat herself? Just how diabolical was Allie Kramer? Her beauty was only surpassed by her intelligence, which, according to IQ tests, was off the charts.\u003c/p\u003e\n\u003cp\u003eSo many questions.\u003c/p\u003e\n\u003cp\u003eSo few answers.\u003c/p\u003e\n\u003cp\u003eYet.\u003c/p\u003e\n\u003cp\u003eBut she had others working on the information. Detective Natalie Jenkins was determined to find out the identity of the family that had adopted Jenna Hughes’s firstborn, and privacy codes or agreements be damned. Someone knew who had adopted the girl.\u003c/p\u003e\n\u003cp\u003e“Hey!” Double T said, interrupting her thoughts and pointing to an overgrown lane where the trees opened a bit. “I think we’re here.”\u003c/p\u003e\n\u003cp\u003eShe might have sped right past except for the county deputy’s car about fifty feet into the private road. With lights flashing, the cruiser blocked further access to the property. Nash pulled in behind the cruiser. She and Double T climbed out of her Ford and with heads bent against the rain, made their way through the muck and mud to the cruiser, where a deputy in rain gear stood guard. Rain was sliding from his weatherproof jacket and dripping from the bill of his cap. He was young, around twenty-five, and pale as death in the darkness, his mouth a thin line, his beady blue eyes nearly luminescent.\u003c/p\u003e\n\u003cp\u003eQuick introductions ensued as he inspected their badges, shining the beam of his flashlight over the IDs. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-159.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
