{"id":67520,"no":161,"title":"Page 161","content":"\u003cp\u003eJenna’s revelation about another child, Cassie’s half sister, had caught her off-guard, suggesting that the unknown sibling might be a killer was more than disturbing and it had haunted her on the drive into Portland from Jenna and Shane’s ranch. Was it possible? Could it be that she’d even met the woman and not realized they were blood, that they shared the same DNA, the very same mother? The idea gave her goose bumps.\u003c/p\u003e\n\u003cp\u003e“Come on,” Trent said, a hand in hers when they climbed the stairs to the cavernous second-story ballroom.\u003c/p\u003e\n\u003cp\u003eThrough wide open doors, she surveyed the sunken room. Massive chandeliers, dripping with teardrops of crystal and lit by dozens of lights, were suspended from an intricately carved ceiling. On an exterior wall, windows stretched two stories and offered guests an unlimited view of the city. Across an expansive marble floor, French doors opened to a long balcony, that had been built over the main entrance a floor below. Guests gathered and moved through the center of the room.\u003c/p\u003e\n\u003cp\u003e“I wish Allie was here to see this.”\u003c/p\u003e\n\u003cp\u003e“I think she is . . . kind of,” Trent said just as Cassie saw the first of a group of sets, each decorated as individual rooms that had been butted up against the surrounding walls.\u003c/p\u003e\n\u003cp\u003eCassie’s heart dropped as she eyed the mini-rooms more closely and she realized each had been designed to be an exact replica of one of the sets for Dead Heat. “What?” she whispered, disbelieving because in each of the individual rooms, a life-sized mannequin of Allie dressed to look like Shondie Kent, the heroine of the film, had been staged. “Oh, no.”\u003c/p\u003e\n\u003cp\u003eFrom the wide entrance of the sunken ballroom she was able to view each individual scenario:\u003c/p\u003e\n\u003cp\u003eShondie in a business suit and glasses, leaning back in a desk chair, one high-heeled foot resting on the desktop.\u003c/p\u003e\n\u003cp\u003eShondie without makeup, tears streaming from beneath oversized sunglasses as she walked through a park.\u003c/p\u003e\n\u003cp\u003eShondie wrapped in a long negligee, posed provocatively on a bed with mussed covers, a fake mirror positioned over a fireplace. In the mirror’s reflection a man’s naked muscular back and neck were visible—Brandon McNary’s character’s backside.\u003c/p\u003e\n\u003cp\u003eThis was so wrong.\u003c/p\u003e\n\u003cp\u003eThere were other scenes as well, each with a mannequin of Allie.\u003c/p\u003e\n\u003cp\u003eThe most heart-stopping set was of Shondie running down a dark alley, storefronts visible, as she glanced over her shoulder. She was wearing the very same outfit that Lucinda Rinaldi had been dressed in, an identical white jacket, when the fateful bullet had been fired and she’d been shot.\u003c/p\u003e\n\u003cp\u003e“Oh, Jesus.” Cassie’s throat turned to dust. Memories in short bursts flashed through her mind. Another place. Other mannequins. All dressed like Jenna Hughes in her starring roles. All macabre likenesses created by a crazed fan who nearly killed Cassie and her mother. She was suddenly chilled to the bone as she recalled that horrid time, ice water running through her veins.\u003c/p\u003e\n\u003cp\u003eCassie wanted to run from the room.\u003c/p\u003e\n\u003cp\u003e“What the hell was Arnette thinking?” Trent’s gaze wandered from one scene to the next, each one showcasing the film’s missing star.\u003c/p\u003e\n\u003cp\u003e“He’s thinking that if he can’t have Allie, he’ll come up with the next best thing,” she guessed as she stared at a lifelike mannequin of Shondie in a hospital room. Lying on an old-fashioned hospital bed, Shondie appeared glassy-eyed, out of touch. Her dark hair was disheveled, her makeup nonexistent, her arms restrained by thick cuffs, almost as if she were handcuffed to the bed. On one of the partitions of the all-white room was a door with a small glass and mesh window. Peeking through the window was a blond nurse in a pointed white cap.\u003c/p\u003e\n\u003cp\u003eOne identical to the one worn by Belva Nelson on her secretive nighttime visit to Cassie’s hospital room.\u003c/p\u003e\n\u003cp\u003eThe hairs on the back of Cassie’s neck came to attention.\u003c/p\u003e\n\u003cp\u003eApprehension collected in her heart.\u003c/p\u003e\n\u003cp\u003eWas this a coincidence?\u003c/p\u003e\n\u003cp\u003eOr part of some grand terrorizing scheme she didn’t understand?\u003c/p\u003e\n\u003cp\u003eCassie thought of her recent stay in a mental hospital. She’d never seen restraints used at Mercy, but, of course Dead Heat was a retro film, hence the white-uniformed nurse.\u003c/p\u003e\n\u003cp\u003e“Thank God Mom didn’t come,” she said, staring at the mannequins, her insides curdling.\u003c/p\u003e\n\u003cp\u003eJenna had many reasons not to attend, and she’d decided to stay home. Thank God. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-161.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
