{"id":67524,"no":165,"title":"Page 165","content":"\u003cp\u003eDon’t do this, Cassie. You’re making yourself crazy.\u003c/p\u003e\n\u003cp\u003eAlongside Whitney was the goon who had been her cameraman in LA. She offered one of her dazzling but oh-so-cold smiles. “I’ve been trying to talk to you.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“Do you have a minute?” she asked, as if they were best friends, two women in “the industry” out on the town.\u003c/p\u003e\n\u003cp\u003e“I really don’t.”\u003c/p\u003e\n\u003cp\u003e“So, I’m curious, what do you think of the decorations?” she plowed on. “A little macabre, don’t you think? All these scenes with the mannequins dressed like Allie.”\u003c/p\u003e\n\u003cp\u003e“Like Shondie,” Cassie corrected.\u003c/p\u003e\n\u003cp\u003eWhitney tilted her hand. Samey-same. “It’s a bit bizarre, don’t you think? The life-sized dolls. They’re really not all that different from the wax figures of your mother ten years ago, are they?”\u003c/p\u003e\n\u003cp\u003eCassie felt her insides begin to shred. What was this?\u003c/p\u003e\n\u003cp\u003e“You were involved then, too. Right? You were in the killer’s lair where he had all the images.”\u003c/p\u003e\n\u003cp\u003e“Look, I think I made it clear before, in the park in LA. I don’t want to talk to you.” With a fragile hold on her patience Cassie added, “So, please, just leave me alone and give my family some privacy.”\u003c/p\u003e\n\u003cp\u003e“Your family,” Whitney repeated. A nasty little gleam appeared in her eyes. “It’s a little bigger than you thought, isn’t it?”\u003c/p\u003e\n\u003cp\u003eOh, God, she knows. Crap!\u003c/p\u003e\n\u003cp\u003e“Did you know you had a half sister? An older sister?”\u003c/p\u003e\n\u003cp\u003eSo there it was. If Whitney Stone knew, the whole world would soon enough. “No comment,” Cassie said succinctly and saw the goon smile as if he were satisfied that she’d finally gotten a little of her own back.\u003c/p\u003e\n\u003cp\u003e“How’s the toe?” she asked just as Trent placed an arm on her shoulder. Yeah, she hadn’t actually run over it, but she had to make her points.\u003c/p\u003e\n\u003cp\u003eThe cameraman’s smile fell away and Whitney pulled a face reminiscent of the reaction of someone sucking on a lemon. Then she zeroed in on Trent and her cool facade fell easily into place again. “The husband,” she said. To Cassie, “So the divorce is off? You’re ignoring those rumors about Allie and him?”\u003c/p\u003e\n\u003cp\u003e“We’re done here,” Trent said, his fingers tightening over Cassie’s arm and rotating her toward one of the sets from the movie, a scene where Shondie, terrorized, was cowering in a dark library, books scattered on the floor around her. “Haven’t you learned your lesson? Avoid her.”\u003c/p\u003e\n\u003cp\u003eCassie tried to take a sip from her drink and felt someone bump her from behind. She jumped, though some of the cocktail splashed on her. “Ooh!”\u003c/p\u003e\n\u003cp\u003e“Sorry,” Lucinda said as she backed up her wheelchair and looked up at Cassie without a drip of remorse. In fact, Cassie wondered if the “accident” had been intentional. Lucinda went on, “I just can’t quite get the hang of this thing.”\u003c/p\u003e\n\u003cp\u003e“I thought you were walking,” Cassie said, remembering Lucinda struggling at the rehabilitation center.\u003c/p\u003e\n\u003cp\u003e“Oh, I am. But when I go out, I use this.” She patted the arm of the wheelchair as a couple Cassie didn’t recognize squeezed past.\u003c/p\u003e\n\u003cp\u003eThey sloshed drinks and, giggling, muttered “sorry” several times as they tried to maneuver around Lucinda and her chair.\u003c/p\u003e\n\u003cp\u003e“Morons!” Lucinda said to Cassie. “So I hear you’re writing a screenplay or a script or something. About the film and Allie’s disappearance.”\u003c/p\u003e\n\u003cp\u003eHow did she know this?\u003c/p\u003e\n\u003cp\u003e“I’m thinking about it, but really, I’m more interested in finding my sister.”\u003c/p\u003e\n\u003cp\u003e“Aren’t we all?” Lucinda said, pointedly eyeing Trent. “I sure would like to talk to her and find out why she bailed on the very day that I end up getting shot. You ever consider that, huh?”\u003c/p\u003e\n\u003cp\u003eCassie nodded, sipping the drink.\u003c/p\u003e\n\u003cp\u003e“It could have been any one of us. You. Allie. But I’m the one who got lucky.” Her lips, painted a shiny peach, twisted bitterly. “Wonder how that happened? Your character was supposed to be the one running behind, then the scene was rewritten and on the day of the final take for the reshoot, Allie just vanishes and I end up with a bullet in my spine. What’re the chances of that?” \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-165.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
