{"id":67395,"no":36,"title":"Page 36","content":"\u003cp\u003eShe took the side streets near her home.\u003c/p\u003e\n\u003cp\u003eNo car followed.\u003c/p\u003e\n\u003cp\u003eNo vehicle slowed at the corner, then kept going.\u003c/p\u003e\n\u003cp\u003eNo suspicious van kept a long distance from her, then cruised by the massive house that sheltered her apartment from the street.\u003c/p\u003e\n\u003cp\u003eNo. It was all in her mind.\u003c/p\u003e\n\u003cp\u003eLetting out her breath, she parked, locked the car on the fly, and felt more at ease than she had in days. She walked back through her apartment door, dropped her keys onto the kitchen counter, then found a glass and poured herself a drink of water from the faucet over the sink. She made a note to herself to get some bottled water as she took a long swallow. Then she took out her phone, leaned against the counter, and listened to the message from Trent again.\u003c/p\u003e\n\u003cp\u003eThe sound of his voice called up memories best forgotten. The deep timbre, the slight bit of a drawl reminding her of his Texas childhood, his inflection.\u003c/p\u003e\n\u003cp\u003eHer hand tightened on the phone as she reminded herself that she despised him. When the message finished, she considered playing it once more, just to hear him and allow herself to be taken back to a time when they’d been happy. Before he’d been tempted by Allie. Before he’d admitted as much. Before she’d realized their marriage had no chance. Before her sister had disappeared. Her throat thickened. Unshed tears burned behind her eyes.\u003c/p\u003e\n\u003cp\u003e“Idiot,” she whispered, not knowing if she was thinking of him or herself as she quickly erased the message. It irritated the hell out of her that he had the gall to phone on behalf of her mother.\u003c/p\u003e\n\u003cp\u003eNonetheless, before her cell’s battery completely gave up the ghost, she punched in the digits of a familiar number.\u003c/p\u003e\n\u003cp\u003eIt was time for that talk Jenna wanted so desperately.\u003c/p\u003e\n\u003cp\u003eCHAPTER 9\u003c/p\u003e\n\u003cp\u003e“I’ll be fine,” Cassie reassured her mother for what had to be the dozenth time in their telephone conversation. She was standing in the kitchen, one hip resting against the counter near the sink and staring out the window where in the coming twilight she spied a black cat on the top of the fence near the bougainvillea. Of course Jenna was worried, she thought, watching as the cat, ever patient, stalked a tiny bird fluttering in the blooms. With Allie missing and Cassie checking herself out of the mental hospital and hopping a flight to LA, Jenna was obviously attempting not to freak out about the safety of her kids.\u003c/p\u003e\n\u003cp\u003eBecause they were both adults.\u003c/p\u003e\n\u003cp\u003e“I’m trying not to be a mother bear, you know, overprotective and all, but . . . I worry, Cass. You know it. And with Allie missing . . .” Her voice trailed off and, damn it, Cassie imagined Jenna struggling against tears.\u003c/p\u003e\n\u003cp\u003eCassie turned away from the window and closed her eyes. “I know. I get it.” She felt bad. Her mother, who had been famous and yes, rich at one time, had lost a lot in her life. Jenna’s sister, Jill, had been killed in a freak accident while filming White Out, a movie produced by Jenna’s husband, Robert Kramer, a film that, because of the tragedy, had never been released. Losing Jill had been a horrible blow. Losing Allie would devastate Jenna. “I’ll be back soon.”\u003c/p\u003e\n\u003cp\u003e“Promise?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“How soon?”\u003c/p\u003e\n\u003cp\u003e“Couple of days. I’ll keep you posted.”\u003c/p\u003e\n\u003cp\u003eA pause. Probably Jenna was remembering all the times Cassie, as a rebellious teen, had lied through her teeth and broken more promises than she could recall.\u003c/p\u003e\n\u003cp\u003e“All right,” Jenna acquiesced.\u003c/p\u003e\n\u003cp\u003eCassie envisioned her mother’s face, worry lines evident between her eyebrows, green eyes clouded with concern, upper teeth gnawing at her lower lip. “I’ll let you know when I’m close,” she said.\u003c/p\u003e\n\u003cp\u003e“You’re sure your car will make it?”\u003c/p\u003e\n\u003cp\u003e“Positive,” she answered too quickly. Another lie. She had no idea how dependable the car would be, but she covered it up. “Hey, it’s a Honda. They run forever. Come on, Mom, don’t freak out about that.”\u003c/p\u003e\n\u003cp\u003e“Okay. I’ll check that one off the list.” Jenna actually chuckled weakly. “I’ll see you soon then.”\u003c/p\u003e\n\u003cp\u003e“Yes. And Mom?”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“Next time, don’t call Trent, okay? He and I are over.”\u003c/p\u003e\n\u003cp\u003e“You say so, but—”\u003c/p\u003e\n\u003cp\u003e“Don’t bring up the marriage thing. I’ll take care of it. But now he doesn’t need to know anything about me. It’s . . . what I do is none of his business.” \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-36.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
