{"id":67398,"no":39,"title":"Page 39","content":"\u003cp\u003e“That’s a start,” her younger sister finally got out.\u003c/p\u003e\n\u003cp\u003e“Maybe a bitch?”\u003c/p\u003e\n\u003cp\u003eAllie’s lips twisted, her facade slipped for a millisecond. But Allie was an uncanny actress, one who could easily turn her emotions on and off and she recovered with, “Definitely a bitch.”\u003c/p\u003e\n\u003cp\u003eThat sounded more like Allie. “Then maybe we’re not just sisters, maybe we’re more like twins,” Cassie said tightly.\u003c/p\u003e\n\u003cp\u003e“Puleeez. We are not alike,” Allie insisted, pointing at Cassie. “You know the difference between us?” She’d paused for effect, her elfin face expectant, her chin tipped upward. Without much makeup a fine dusting of freckles still bridged her perfect little nose.\u003c/p\u003e\n\u003cp\u003e“I’m sure you’re going to tell me.”\u003c/p\u003e\n\u003cp\u003eCassie could click off the traits that distinguished Allie from her. Allie had been shyer as a young woman and blessed with a nearly photographic memory, which made it as easy for her to quote Shakespeare as find applications for the Pythagorean theorem or whatever in the third grade. Allie had been a brainiac turned computer nerd who’d hated school as it had bored her. Improbably, she’d blossomed into a beauty and eventually conquered Hollywood and was on her way to captivating the American public. Cassie had been, for the most part, a failure. Though tougher and bolder than her little sister, Cassie didn’t have the drive and the all-consuming ambition that were both integral parts of what made up Allie Kramer.\u003c/p\u003e\n\u003cp\u003eAllie reminded Cassie, “You were practically a dropout in school and after barely graduating, you left, not because of some big dream you’d had to follow in Mom’s footsteps and become an actress. Uh-huh. You ran away, not to something, but from your shitty life in Oregon.” Bingo. The truth. Ugly as it was. Inwardly Cassie recoiled but tried not to show how much her words hurt. “So, Cassie, how did that work out for you?” Allie’s voice shook a bit and her eyes glistened with unshed tears, but she stared hotly at her sister.\u003c/p\u003e\n\u003cp\u003e“I—”\u003c/p\u003e\n\u003cp\u003e“What?” She turned her palms to the ceiling, silently suggested she had no clue as to what her sister was about to say, but before Cassie could speak, Allie went on. “And don’t bring up the writing, okay? That’s insulting to those of us who can act. Writing’s just an excuse. Every damned actor who can’t make it thinks he or she will write or maybe direct. And you know what?” she asked, her perfect little chin projecting, fury radiating from her. “Most of them fail. Even if they end up writing a book about their own pathetic lives, it’s usually ghosted. Someone else does all the real work, the real composing. So face it. You’re a mess, Cassie. A mental case. A weak woman who can’t even keep her own husband from straying.”\u003c/p\u003e\n\u003cp\u003eCassie’s jaw had hardened. That was below the belt.\u003c/p\u003e\n\u003cp\u003eBut Allie wasn’t finished. “Trent and you? You know it’s a joke!”\u003c/p\u003e\n\u003cp\u003e“He’s my husband.”\u003c/p\u003e\n\u003cp\u003e“And he wants to fuck me.”\u003c/p\u003e\n\u003cp\u003eCassie’s guts clenched. “And that’s what you live for, isn’t it? Making men, any man, want you. Even the married ones. What does that say about you?”\u003c/p\u003e\n\u003cp\u003e“What does it say about them?” she countered. “Or their wives? So who’s really to blame?”\u003c/p\u003e\n\u003cp\u003e“Not you, obviously.” Cassie’s voice had been low and menacing. She’d felt her eyes narrow as her temper took over. “Never you, right?”\u003c/p\u003e\n\u003cp\u003e“Don’t turn this around. Don’t blame me. Okay, finally, we’ve hit what you’re good at: blaming me.”\u003c/p\u003e\n\u003cp\u003e“Untrue.”\u003c/p\u003e\n\u003cp\u003e“Ask Mom.”\u003c/p\u003e\n\u003cp\u003e“Leave her out of it.” So now they were down to the bones of it. Their mother. No, make that their beautiful, successful mother who was at the heart of all their disputes. Not that Jenna hadn’t been fair to each of them, loving both of her daughters equally, if differently. And truth to tell, Cassie had been a lot more difficult a daughter to raise. She knew that.\u003c/p\u003e\n\u003cp\u003e“I wish to hell that you weren’t my sister!” Allie suddenly shouted, her voice rising.\u003c/p\u003e\n\u003cp\u003eCassie had wanted to strike out, to knock her down, to wipe that superior attitude off her face and grind it into the ground. She would have loved to let loose and get into one of the fights they’d had as children. When she’d been bigger than her younger sister, when she’d always prevailed, when she could make Allie with one look go running to their mother.\u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-39.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
