{"id":67409,"no":50,"title":"Page 50","content":"\u003cp\u003eWho else has a key to your place?\u003c/p\u003e\n\u003cp\u003e“No one,” she said out loud. “No—” Oh, hell.\u003c/p\u003e\n\u003cp\u003eHadn’t she loaned a key to Allie a few months after she’d moved in? Allie had needed a place to crash when her place was being painted and Cassie had thought it was time they mended some seriously broken fences. Allie had never stayed in the apartment, nor had she bothered returning the key.\u003c/p\u003e\n\u003cp\u003eAllie?\u003c/p\u003e\n\u003cp\u003eIn here?\u003c/p\u003e\n\u003cp\u003eSkulking around?\u003c/p\u003e\n\u003cp\u003eNo, no, that didn’t make sense. But, if someone had abducted Allie, there was a chance that he had control of whatever possessions she had on her, which would, of course, include her key ring.\u003c/p\u003e\n\u003cp\u003eAnd the “borrowed” key.\u003c/p\u003e\n\u003cp\u003eCHAPTER 12\u003c/p\u003e\n\u003cp\u003eInsomnia had become Detective Rhonda Nash’s best friend. One she hated. It crawled into bed with her each night and wouldn’t let go. Even though she worked long hours, exercised her butt off whenever she had a minute, tried her best to meditate in what little free time she had, felt exhausted when she tumbled into bed, Ronnie just couldn’t fall asleep until the wee hours of the morning.\u003c/p\u003e\n\u003cp\u003eHer damned brain wouldn’t shut off. No amount of warm milk, counting sheep, deep breathing, clearing her mind, or swearing and punching her pillow could change her routine or keep insomnia at bay.\u003c/p\u003e\n\u003cp\u003eLast night had been no different from those of the past three months, she thought, as she found an open slot in the parking structure, then cut the engine of her Ford Focus. Her mind already on the day stretching before her, she grabbed her laptop, locked the car, then hurried down four flights of stairs. Emerging from the open-air building she flipped up the hood of her raincoat. A soft Oregon drizzle was falling from the heavens. As it was not yet seven in the morning, the sky was still dark, streetlights glowing, the city starting to come alive. Buses rumbled down the one-way streets while bikes sped past, tires hissing on the wet pavement as the riders cut through the few cars, trucks, and vans already moving through the west side of the Willamette River.\u003c/p\u003e\n\u003cp\u003eNash jaywalked quickly, crossing the street between the lights to dash through the doors of the Justice Center, taking the elevator up to the Homicide Division.\u003c/p\u003e\n\u003cp\u003eAs the rain puddled onto the lift’s floor she thought she probably should find a different, less stressful job, should give up all the cop crap and the tension that came with it, but she couldn’t. Becoming a detective had been her life’s ambition. So here she was pushing forty, married to a career that wouldn’t leave her alone at night, one that invaded her dreams and chased her out of bed before dawn while her friends were busy balancing their careers and home life, husbands and children, school and work schedules.\u003c/p\u003e\n\u003cp\u003eBut she couldn’t see herself as a nine-to-fiver, or a doting stay-at-home mother and wife. “Diff’rent strokes for diff’rent folks,” she said under her breath.\u003c/p\u003e\n\u003cp\u003eBesides, she loved her job, especially in the early morning, which was the most peaceful time of day in the office after the crazies of the night had been dealt with and before the morning shift got into full swing. This was a time when she could think and plan her day, a time before her partner showed up, or many of the other desks in the large room cut up into cubicles were filled with other cops on phones, writing reports, questioning suspects, or generally taking up space.\u003c/p\u003e\n\u003cp\u003eNash hated the lack of privacy involved. She would have preferred her own office complete with walls, maybe a window, and a door that she could open or close depending upon her workload and mood.\u003c/p\u003e\n\u003cp\u003eAs she stepped into the division, she noticed that she wasn’t alone. A few other cops were already seated at their desks, on their phones, reading files, or keying info into their computers. A couple of them were standing together, a newbie named Trish Bellegarde was trying not to be rude to Kowalski, who had trapped her into a conversation. Nash had been there. Kowalski was a decent enough detective, the “old man” in the department. He sported a white crew cut, jowls, glasses that he was always polishing, and a good ol’ boy attitude that was a pain in the butt. Retirement loomed for Kowalski and for that Nash was grateful. She just didn’t like the guy.\u003c/p\u003e\n\u003cp\u003eAfter hanging her coat in a locker and leaving her bag in a drawer at her desk, she went into the lunchroom, found a carafe of coffee, and poured herself a lukewarm cup. Good enough, for now. Back at her desk she discovered she’d already acquired a dozen or so e-mail messages since she’d left the office sometime after six the night before. As she sipped from her cup with her free hand, she scrolled through the missives, sorted out reports and filed them along with autopsies and statements, then saw a more personal note from Whitney Stone. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-50.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
