{"id":67416,"no":57,"title":"Page 57","content":"\u003cp\u003eA text had come in while she was on the phone, from a private number she didn’t recognize:\u003c/p\u003e\n\u003cp\u003esantafe07.\u003c/p\u003e\n\u003cp\u003eWhat? She texted back:\u003c/p\u003e\n\u003cp\u003eWho is this? What do you mean?\u003c/p\u003e\n\u003cp\u003eShe hit send before realizing someone had probably texted the wrong number.\u003c/p\u003e\n\u003cp\u003eOr not?\u003c/p\u003e\n\u003cp\u003eWhat did anything having to do with Santa Fe, New Mexico, have to do with her? And 07? Did something happen there in 2007? Or was the 07 part of another number? Had Allie had a movie out in that year? Been on location in Santa Fe . . . no, her career started after that.\u003c/p\u003e\n\u003cp\u003e“It’s nothing,” she warned herself. She didn’t even know the person who’d texted. Still, it bothered her, so when no one responded immediately to her text, she dialed the phone number, which she could tell from the first three digits had originated in Oregon. Maybe if she knew who’d called?\u003c/p\u003e\n\u003cp\u003eA recording stated: “You have reached the voice mail of Dr. Virginia Sherling. Please leave your name, number, and a brief message and I’ll get back to you.”\u003c/p\u003e\n\u003cp\u003eDr. Sherling? Cassie’s own psychiatrist at Mercy Hospital? Why would she send a cryptic text? That couldn’t be right. But there was no way Cassie was going to leave a message back and risk talking to the doctor who would try to convince her to return to the hospital.\u003c/p\u003e\n\u003cp\u003eAt the sound of the beep, Cassie disconnected.\u003c/p\u003e\n\u003cp\u003eThrough the windshield she watched the older boy push the little girl into the water with enough force to send her sprawling. The girl screamed bloody murder, then got up and gave him a reciprocal shove while the nanny, caught up in her texting, looked up sharply. Scowling, the nanny reluctantly slid the phone into a huge bag then marched her charges out of the spurting fountain while they both cried and balked, blaming each other in true sibling fashion.\u003c/p\u003e\n\u003cp\u003eLike she and Allie had done.\u003c/p\u003e\n\u003cp\u003eRather than take a melancholy trip down memory lane, Cassie finished her coffee, wadded up her empty bag and cup, then climbed out of her car in search of a trash can. The nanny was bundling the kids into their double stroller. The breeze had died, and in the distance Cassie heard the steady hum of traffic on the freeway. She thought she caught a whiff of smoke, but the nanny was long over her cigarette and halfway to her car.\u003c/p\u003e\n\u003cp\u003eOdd.\u003c/p\u003e\n\u003cp\u003eShe made her way to the garbage can the nanny had used that was positioned near the restrooms and a covered picnic area. Glancing around, she searched for the source of the scent. No one else was in the park except two people who were seated in a silver SUV, a Toyota with tinted windows, and parked several spaces away from her Honda. It must’ve pulled up when she was lost in thought, she decided, as she hadn’t noticed it pull in. She shot a look its way and noticed that the driver was a woman in sunglasses who, like Cassie, had been staring through the windshield observing the action, or now, lack thereof, in the park. The SUV’s windows were rolled down. Cassie caught a glimpse of the occupant in the passenger seat, a burly man whose hairy arm was stretched through the open window, a cigarette dangling from his fingers. His eyes, too, were shaded.\u003c/p\u003e\n\u003cp\u003eThe hairs on the back of Cassie’s neck rose. She sensed both occupants of the Toyota were staring at her, following her with their shaded eyes, not moving their heads, not saying a word.\u003c/p\u003e\n\u003cp\u003eCassie checked the park and her heart sank. The nanny and kids had almost disappeared through a far entrance, the jogger long gone, the woman who’d been feeding the birds already driving away.\u003c/p\u003e\n\u003cp\u003eStop it. It’s no big deal. Weren’t you just doing the same thing? Sitting in your car, observing everyone else. The park is a public place, for crying out loud.\u003c/p\u003e\n\u003cp\u003eStill, she felt uneasy as she headed back toward her car.\u003c/p\u003e\n\u003cp\u003eAs she did a door clicked open and the woman stepped out of the SUV.\u003c/p\u003e\n\u003cp\u003eShe was slim. Attractive. With thick black hair cut at an angle, her oversize sunglasses hiding her face. She raised a hand. “Cassie?” she called and her voice was vaguely familiar. “Cassie Kramer?” Two inches shorter than Cassie, she walked purposely across the spaces separating their vehicles. Before she said, “Whitney Stone,” Cassie recognized the reporter.\u003c/p\u003e\n\u003cp\u003eAnd her heart nosedived.\u003c/p\u003e\n\u003cp\u003eShe braced herself.\u003c/p\u003e\n\u003cp\u003eWhitney Stone was smiling, white teeth flashing above a pointed chin, her arm outstretched as if she and Cassie were long-lost friends or at the very least acquaintances. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-57.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
