{"id":67419,"no":60,"title":"Page 60","content":"\u003cp\u003e“You went through a horrific tragedy before, when your mother was stalked by that maniac. You were nearly killed and Allie witnessed—”\u003c/p\u003e\n\u003cp\u003e“Don’t even go there!”\u003c/p\u003e\n\u003cp\u003e“It’s part of your history. Of Allie’s history. Certainly of Jenna Hughes’s history, and there’s a new interest in what happened then.”\u003c/p\u003e\n\u003cp\u003e“No,” Cassie said through clenched teeth. Her darkest fears were coming to light. She couldn’t relive the horror.\u003c/p\u003e\n\u003cp\u003e“You lost a boyfriend,” Whitney went on, and Cassie felt a numbing cold when she realized the story had already been researched. “He was murdered.”\u003c/p\u003e\n\u003cp\u003e“I don’t know why you want to bring this up now.”\u003c/p\u003e\n\u003cp\u003e“Because the public wants to know and they’re going to. I’m doing a report on what happened ten years ago.”\u003c/p\u003e\n\u003cp\u003eKnowing it would do no good, Cassie couldn’t help herself from begging. “No . . . please. There’s no reason to dredge all that up again.” Images of ice and snow, blood and freezing water, frozen visages of Jenna in her most popular roles sped through her memory. But the image that was most indelibly painted in her mind: Josh, slumped behind the wheel of his truck, a dark oozing gash visible on his throat. She could still hear the loud music pulsing through the frigid night, still recall the pure fear and shock she’d felt.\u003c/p\u003e\n\u003cp\u003eHer knees threatened to buckle. She felt suddenly cold to the bone as she thought of the madman who’d terrorized them, how close she and Jenna had come to becoming his final victims. She was shaking so badly she leaned against her car for support.\u003c/p\u003e\n\u003cp\u003eWatching her, Whitney seemed to pull back with genuine concern. “The story about Jenna’s stalker airs this week. I just thought you might want to add something that I could edit in.”\u003c/p\u003e\n\u003cp\u003e“Go to hell,” Cassie ground out, pulling herself together. “Leave me and my family alone, you bloodsucking bitch.”\u003c/p\u003e\n\u003cp\u003e“Wait!” Whitney Stone raised a hand. She was irritated as hell, but tried to hide it under a smooth coat of civility. “Okay, I get it, you don’t want to talk to the press, but I just have a few questions. As I said, to help. And really, come on, it’ll be good publicity with the movie coming out in a couple of months.”\u003c/p\u003e\n\u003cp\u003eCassie slid into the driver’s seat. “I’ve said all I’m going to.”\u003c/p\u003e\n\u003cp\u003eWhitney grabbed on to the open driver’s window. “I thought you might want to tell your side of the story. You know, what happened then. What’s happening now. I’m going to run it, you know, as I’ve already started airing my investigation. So, with or without your input the story will air, but I would love to hear what you think, to try and work with you.”\u003c/p\u003e\n\u003cp\u003e“I have nothing to say.” She jabbed her key into the ignition.\u003c/p\u003e\n\u003cp\u003eThe car started but Whitney was still hanging on. “The police questioned you for hours. You were reportedly the last person to see your sister before she disappeared. And it’s common knowledge that you two had your ups and downs.”\u003c/p\u003e\n\u003cp\u003eCassie tried to keep her cool, but the woman was irritating the hell out of her and the cameraman had positioned himself so that if she backed up, she might hit him. “How long have you been following me? How did you know that I’d be here? Now. In this park?”\u003c/p\u003e\n\u003cp\u003eA tiny muscle worked in the reporter’s jaw. “I was going to talk to you at your house and I got there just as you were leaving so—”\u003c/p\u003e\n\u003cp\u003e“You know where I live?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003eCassie mentally reviewed the stops she’d made before landing here. “You followed me to the post office and through the coffee drive-in . . . For God’s sake—” She snapped. “All the way from Portland to LA? You’re unbelievable.” She glanced at the hulk who was blocking her exit. “Get out of my way and leave me the hell alone.” Before waiting for an answer, she shoved her Honda into reverse. “You’d better move,” she told the cameraman.\u003c/p\u003e\n\u003cp\u003e“I know you want to find out what happened to your sister,” Whitney pleaded. “I do, too.”\u003c/p\u003e\n\u003cp\u003e“For a story.”\u003c/p\u003e\n\u003cp\u003e“Maybe we could help each other.”\u003c/p\u003e\n\u003cp\u003e“Tell your boy there to watch out. I’m not stopping.” \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-60.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
