{"id":67432,"no":73,"title":"Page 73","content":"\u003cp\u003eSo she was giving up searching for Mr. Right for the night.\u003c/p\u003e\n\u003cp\u003eMaking her way to the front door was a trick. The rum hadn’t seemed to have much of a kick as she’d sat on the barstool and sipped her drinks, but now, as she wended through nearly empty tables, the liquor had definitely found its way into her bloodstream, making walking steadily a trick.\u003c/p\u003e\n\u003cp\u003eOutside the wind was cool, a stiff breeze blowing in from the Pacific, the smooth sound of the tide drowned by the few cars rolling past. Above the streetlights, Holly could barely make out the stars overhead, not that she really cared. She wondered if Marlie Babcock had intentionally sent her on a wild goose chase. Marlie was just mean enough. Holly should never have trusted her, another set designer whose connection to Luca had been a previous film they’d both worked on.\u003c/p\u003e\n\u003cp\u003eBig deal, she thought now, wobbling a little.\u003c/p\u003e\n\u003cp\u003eIt crossed her mind that she probably shouldn’t drive because she was a stage or two beyond buzzed, but the thought of calling a taxi or Uber or phoning a friend and leaving her car, a leased BMW convertible, in the parking lot all night freaked her out. And she didn’t dare dial Barb, who would look at her disapprovingly and probably revoke her babysitting privileges. Besides, it was only a few blocks to her apartment, less than a mile, really, and she’d be careful behind the wheel.\u003c/p\u003e\n\u003cp\u003eOf course she would.\u003c/p\u003e\n\u003cp\u003eAs she reached the parking lot, she thought she heard her cell phone ring. At this late hour? Not good news. She fumbled a bit, found the iPhone in an inner pocket, and checked the screen. No call. She’d been mistaken, but she did notice that she’d missed two texts from her sister saying that she was canceling on the babysitting gig in the morning. Little Adele was running a fever of 103. “Poor baby,” Holly said, disappointed. Well, this way she could sleep in. As she was sliding the phone into the side pocket of her bag, she thought she caught movement out of the corner of her eye, a play of light and shadow that seemed out of place.\u003c/p\u003e\n\u003cp\u003eShe blinked and saw that there was definitely someone in the lot. A dark figure lurking between the parked vehicles. The hairs on the back of her arms came to attention and her heart jump-started, pounding erratically before she decided it was probably a drunk guy taking a leak. Gross. But it happened. In fact, she’d seen it here more than once before.\u003c/p\u003e\n\u003cp\u003eShe turned away and found her car, the locks opening as the signal from the key fob in her purse came into range. She nearly stumbled again and from the corner of her eye saw that the guy was moving, probably zipping up—well, she hoped he was pulling up his zipper—as she reached for the door handle.\u003c/p\u003e\n\u003cp\u003e“Holly?”\u003c/p\u003e\n\u003cp\u003eWhat? A woman’s voice?\u003c/p\u003e\n\u003cp\u003eShe twisted her head and realized that “the guy” she’d first seen was really a woman who definitely had not been relieving herself. And she was walking briskly through the parked cars, her footsteps distinct against the asphalt. “You’re Holly Dennison.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.” Wasn’t the voice familiar? If so, why was she suddenly uneasy again? The parking lot instantly seemed darker and more isolated than it had moments before.\u003c/p\u003e\n\u003cp\u003e“I thought so.” The woman was drawing nearer, her face still shadowed, still unrecognizable. Dark hair. Or a hood?\u003c/p\u003e\n\u003cp\u003eBut that voice. Holly definitely knew it, but couldn’t place the name and now the other woman was only a few feet away. Holly squinted, ignoring the little drip of fear, a warning, that rippled through her blood. “Do I know—?”\u003c/p\u003e\n\u003cp\u003eA loud motorcycle roared past the lot.\u003c/p\u003e\n\u003cp\u003eHolly jumped, her attention switched to the street.\u003c/p\u003e\n\u003cp\u003eIn that split second, the woman in black pounced.\u003c/p\u003e\n\u003cp\u003eBam!\u003c/p\u003e\n\u003cp\u003eHer body weight knocked Holly off her feet. Holly slammed against her car, her head cracking against the driver’s door, and then her body slithered to the ground.\u003c/p\u003e\n\u003cp\u003ePain slammed through her brain.\u003c/p\u003e\n\u003cp\u003eShit! What the hell?\u003c/p\u003e\n\u003cp\u003eShe dropped her purse, her phone skittering out, the screen illuminating.\u003c/p\u003e\n\u003cp\u003eNo! This couldn’t be happening! This stranger, this woman couldn’t be attacking her! She started to scream.\u003c/p\u003e\n\u003cp\u003eA gloved hand, a strong gloved hand, slammed across her mouth and muffled any sounds she could make as her attacker forced her onto her back and straddled her chest.\u003c/p\u003e\n\u003cp\u003eOh. Dear. God.\u003c/p\u003e\n\u003cp\u003eFear crystallized in her brain. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-73.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
