{"id":67438,"no":79,"title":"Page 79","content":"\u003cp\u003e“Does it matter?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Maybe not.”\u003c/p\u003e\n\u003cp\u003eShe checked her watch. “What did you want to say?”\u003c/p\u003e\n\u003cp\u003e“I want to work things out.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” she asked automatically. “No—wait.” She held up a hand. “I’m not in the mood for this.”\u003c/p\u003e\n\u003cp\u003e“I came down here for you.”\u003c/p\u003e\n\u003cp\u003e“Come on.” Enough. Tugging on her bag she made her way to the driver’s door of her Honda. She didn’t know what Trent’s game was, if he even had one, but she didn’t have time for it, not now, most likely not ever. “Go to hell.”\u003c/p\u003e\n\u003cp\u003e“You keep saying that,” he said, infuriatingly unconcerned.\u003c/p\u003e\n\u003cp\u003e“I really have to go.” She tugged the door open, then tossed her bag into the passenger seat.\u003c/p\u003e\n\u003cp\u003e“And you’ll be back?”\u003c/p\u003e\n\u003cp\u003e“For the rest of my things.”\u003c/p\u003e\n\u003cp\u003eOne eyebrow raised. He didn’t believe her.\u003c/p\u003e\n\u003cp\u003e“You don’t trust me,” she charged, and slid into the driver’s seat.\u003c/p\u003e\n\u003cp\u003e“I think it’s the other way ’round.”\u003c/p\u003e\n\u003cp\u003e“I have a reason.” She yanked the door shut.\u003c/p\u003e\n\u003cp\u003e“You never gave me a chance to explain.”\u003c/p\u003e\n\u003cp\u003eRolling down the window, she said, “Look, Trent. I don’t even know why I’m talking to you. You had plenty of chances and I’m not doing this.”\u003c/p\u003e\n\u003cp\u003e“Cass—” His voice was low and when he said her name like that it just killed her inside.\u003c/p\u003e\n\u003cp\u003e“Don’t. Just don’t, okay?” A thunderstorm of emotions was threatening her, but she couldn’t deal with them so she pulled herself together and turned on the ignition. As the little car sputtered to life, she added, “I said I’ll be back and I will.”\u003c/p\u003e\n\u003cp\u003e“I’ll be waiting.” For the briefest of seconds she thought of canceling with Laura and having things out with him, once and for all, but she changed her mind. This was her one chance to catch up with the person who could be Allie’s closest confidante, and she wasn’t going to blow it on rehashing the problems in her marriage with Trent. At least not at the moment. Telling herself she was being a damned fool, she found her new key on her ring, unwound it from the others. “Go inside. I’ll be back in an hour, maybe two.” She handed him the key and didn’t let her fingers linger on his. “If you want coffee, you’ll have to go get a cup at Starbucks or Java Buzz, two blocks south. There’s nothing in my place. Now, I’ve really got to go.”\u003c/p\u003e\n\u003cp\u003eShe didn’t wait for him to argue, just tore out of the lot. A glance into the rearview mirror showed that he was still standing where she’d left him. Long legs shoulder-length apart, jaw rock hard, shaded eyes turned in her direction.\u003c/p\u003e\n\u003cp\u003eShe dragged her gaze away from his all-too-sexy image. That was the trouble with him, he was innately sensual and didn’t seem to know it, that’s why he was so attractive. She let out a sigh. She’d sworn that she was over him, but, obviously, she’d been lying to herself.\u003c/p\u003e\n\u003cp\u003eCHAPTER 18\u003c/p\u003e\n\u003cp\u003eAt three minutes to nine, Cassie stepped through the doors of Salon Laura.\u003c/p\u003e\n\u003cp\u003eThe spa-like business was located a couple of blocks off Rodeo Drive, tucked into the first floor of a stucco and glass building in the high-rent district. Behind a sleek black counter a big-eyed, too-cool-to-smile receptionist, whose platinum hair was short and carefully mussed, told her what she’d already guessed, that, “No, Miss Merrick isn’t in today, but I see you have an appointment with Verna.”\u003c/p\u003e\n\u003cp\u003eAn appointment she didn’t need.\u003c/p\u003e\n\u003cp\u003eCassie wanted to speak to Laura.\u003c/p\u003e\n\u003cp\u003e“But Laura, er, Miss Merrick is coming in, right? I thought that’s what she said.”\u003c/p\u003e\n\u003cp\u003eShe was offered a bored expression and a single raised skeptical eyebrow. “That’s not what she told me. Or like anyone else here.” Then, with a word to another girl, the receptionist grudgingly guided Cassie through a frosted glass door and down a tiled hallway lit by sconces. Soft Asian-inspired music played from hidden speakers and the scents of lavender and eucalyptus seeped into the hallway from double doors leading to the day spa.\u003c/p\u003e\n\u003cp\u003eAround a final corner the hallway opened into a brightly lit area designated for hair stylists. Along one wall were individual stations, separated by half walls, each with a chair, sink, mirror, and private closet. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-she-s-gone-west-coast-3/page-79.html","bookId":2675,"creation":"Oct 5, 2019 10:05:06 AM","modification":"Oct 5, 2019 10:05:06 AM"}
