{"id":10285,"no":114,"title":"CHAPTER 114","content":"“They say the king gives justice and protects the weak.” She started to climb off the rock, awkwardly, but the ice had made it slippery and her foot went out from under her. Jon caught her before she could fall, and helped her safely down. The woman knelt on the icy ground. “M’lord, I beg you-”\u0026nbsp; “Don’t beg me anything. Go back to your hall, you shouldn’t be here. We were commanded not to speak to Craster’s women.”\u0026nbsp; “You don’t have to speak with me, m’lord. just take me with you, when you go, that’s all I ask.” All she asks, he thought. As if that were nothing.\u0026nbsp; “I’ll... I’ll be your wife, if you like. My father, he’s got nineteen now, one less won’t hurt him none.”\u0026nbsp; “Black brothers are sworn never to take wives, don’t you know that? And we’re guests in your father’s hall besides.”\u0026nbsp; “Not you,” she said. “I watched. You never ate at his board, nor slept by his fire. He never gave you guest-right, so you’re not bound to him. It’s for the baby I have to go.”\u0026nbsp; “I don’t even know your name.”\u0026nbsp; “Gilly, he called me. For the gillyflower.”\u0026nbsp; “That’s pretty.” He remembered Sansa telling him once that he should say that whenever a lady told him her name. He could not help the girl, but perhaps the courtesy would please her. “Is it Craster who frightens you, Gilly?”\u0026nbsp; “For the baby, not for me. If it’s a girl, that’s not so bad, she’ll grow a few years and he’ll marry her. But Nella says it’s to be a boy, and she’s had six and knows these things. He gives the boys to the gods. Come the white cold, he does, and of late it comes more often. That’s why he started giving them sheep, even though he has a taste for mutton. Only now the sheep’s gone too. Next it will be dogs, till... She lowered her eyes and stroked her belly.\u0026nbsp;\u0026nbsp; “What gods?” Jon was remembering that they’d seen no boys in Craster’s Keep, nor men either, save Craster himself.\u0026nbsp; “The cold gods,” she said. “The ones in the night. The white shadows.”\u0026nbsp; And suddenly Jon was back in the Lord Commander’s Tower again. A severed hand was climbing his calf and when he pried it off with the point of his longsword, it lay writhing, fingers opening and closing. The dead man rose to his feet, blue eyes shining in that gashed and swollen face. Ropes of torn flesh hung from the great wound in his belly, yet there was no blood.\u0026nbsp; “What color are their eyes?” he asked her.\u0026nbsp; “Blue. As bright as blue stars, and as cold.”\u0026nbsp; She has seen them, he thought. Craster lied.\u0026nbsp; “Will you take me? just so far as the Wall-”\u0026nbsp; “We do not ride for the Wall. We ride north, after Mance Rayder and these Others, these white shadows and their wights. We seek them, Gilly. Your babe would not be safe with us.”\u0026nbsp; Her fear was plain on her face. “You will come back, though. When your warring’s done, you’ll pass this way again.”\u0026nbsp; “We may.” If any of us still live. “That’s for the Old Bear to say, the one you call the Lord Crow. I’m only his squire. I do not choose the road I ride.”\u0026nbsp; “No.” He could hear the defeat in her voice. “Sorry to be of trouble, m’lord. I only... they said the king keeps people safe, and I thought...” Despairing, she ran, Sam’s cloak flapping behind her like great black wings.\u0026nbsp; Jon watched her go, his joy in the morning’s brittle beauty gone. Damn her, he thought resentfully, and damn Sam twice for sending her to me. What did he think I could do for her? We’re here to fight wildlings, not save them.\u0026nbsp; Other men were crawling from their shelters, yawning and stretching. The magic was already faded, icy brightness turning back to common dew in the light of the rising sun. Someone had gotten a fire started; he could smell woodsmoke drifting through the trees, and the smoky scent of bacon. Jon took down his cloak and snapped it against the rock, shattering the thin crust of ice that had formed in the night, then gathered up Longclaw and shrugged an arm through a shoulder strap. A few yards away he made water into a frozen bush, his piss steaming in the cold air and melting the ice wherever it fell. Afterward he laced up his black wool breeches and followed the smells.\u0026nbsp; Grenn and Dywen were among the brothers who had gathered round the fire. Hake handed Jon a hollow heel of bread filled with burnt bacon and chunks of salt fish warmed in bacon grease. He wolfed it down while listening to Dywen boast of having three of Craster’s women during the night.\u0026nbsp; “You did not,” Grenn said, scowling. “I would have seen.”\u0026nbsp; Dywen whapped him up alongside his ear with the back of his hand. “You? Seen? You’re blind as Maester Aemon. You never even saw that bear.”\u0026nbsp; “What bear? Was there a bear?”\u0026nbsp;\u0026nbsp; “There’s always a bear,” declared Dolorous Edd in his usual tone of gloomy resignation. “One killed my brother when I was young. Afterward it wore his teeth around its neck on a leather thong. And they were good teeth too, better than mine. I’ve had nothing but trouble with my teeth.”\u0026nbsp; “Did Sam sleep in the hall last night?” Jon asked him.\u0026nbsp; “I’d not call it sleeping. The ground was hard, the rushes ill-smelling, and my brothers snore frightfully. Speak of bears if you will, none ever growled so fierce as Brown Bernarr. I was warm, though. Some dogs crawled atop me during the night. My cloak was almost dry when one of them pissed in it. Or perhaps it was Brown Bernarr. Have you noticed that the rain stopped the instant I had a roof above me? It will start again now that I’m back out. Gods and dogs alike delight to piss on me.”\u0026nbsp; “I’d best go see to Lord Mormont,” said Jon.\u0026nbsp; The rain might have stopped, but the compound was still a morass of shallow lakes and slippery mud. Black brothers were folding their tents, feeding their horses, and chewing on strips of salt beef. Jarman Buckwell’s scouts were tightening the girths on their saddles before setting out. “Jon,” Buckwell greeted him from horseback. “Keep a good edge on that bastard sword of yours. We’ll be needing it soon enough.”\u0026nbsp; Craster’s hall was dim after daylight. Inside, the night’s torches had burned low, and it was hard to know that the sun had risen. Lord Mormont’s raven was the first to spy him enter. Three lazy flaps of its great black wings, and it perched atop Longclaw’s hilt. “Corn?” It nipped at a strand of Jon’s hair.\u0026nbsp; “Ignore that wretched beggar bird, Jon, it’s just had half my bacon.” The Old Bear sat at Craster’s board, breaking his fast with the other officers on fried bread, bacon, and sheepgut sausage. Craster’s new axe was on the table its gold inlay gleaming faintly in the torchlight. its owner was sprawled unconscious in the sleeping loft above, but the women were all up, moving about and serving. “What sort of day do we have? “\u0026nbsp; “Cold, but the rain has stopped.”\u0026nbsp; “Very good. See that my horse is saddled and ready. I mean for us to ride within the hour. Have you eaten? Craster serves plain fare, but filling.”\u0026nbsp; I will not eat Craster’s food, he decided suddenly. “I broke my fast with the men, my lord.” Jon shooed the raven off Longclaw. The bird hopped back to Mormont’s shoulder, where it promptly shat. “You might have done that on Snow instead of saving it for me,” the Old Bear grumbled. The raven quorked.\u0026nbsp; He found Sam behind the hall, standing with Gilly at the broken rabbit hutch. She was helping him back into his cloak, but when she saw Jon she stole away. Sam gave him a look of wounded reproach. “I thought you would help her.”\u0026nbsp; “And how was I to do that?” Jon said sharply. “Take her with us, wrapped up in your cloak? We were commanded not to-”\u0026nbsp; “I know,” said Sam guiltily, “but she was afraid. I know what it is to be afraid. I told her...” He swallowed.\u0026nbsp;\u0026nbsp; “What? That we’d take her with us?”\u0026nbsp; Sam’s fat face blushed a deep red. “On the way home.” He could not meet Jon’s eyes. “She’s going to have a baby.”\u0026nbsp; “Sam, have you taken leave of all your sense? We may not even return this way. And if we do, do you think the Old Bear is going to let you pack off one of Craster’s wives?”\u0026nbsp; “I thought... maybe by then I could think of a way.”\u0026nbsp; “I have no time for this, I have horses to groom and saddle.” Jon walked away as confused as he was angry. Sam’s heart was a big as the rest of him, but for all his reading he could be as thick as Grenn at times. It was impossible, and dishonorable besides. So why do I feel so ashamed?\u0026nbsp; Jon took his accustomed position at Mormont’s side as the Night’s Watch streamed out past the skulls on Craster’s gate. They struck off north and west along a crooked game trail. Melting ice dripped down all about them, a slower sort of rain with its own soft music. North of the compound, the brook was in full spate, choked with leaves and bits of wood, but the scouts had found where the ford lay and the column was able to splash across. The water ran as high as a horse’s belly. Ghost swam, emerging on the bank with his white fur dripping brown. When he shook, spraying mud and water in all directions, Mormont said nothing, but on his shoulder the raven screeched.\u0026nbsp; “My lord,” Jon said quietly as the wood closed in around them once more. “Craster has no sheep. Nor any sons.”\u0026nbsp; Mormont made no answer.\u0026nbsp; “At Winterfell one of the serving women told us stories,” Jon went on. “She used to say that there were wildlings who would lay with the Others to birth half-human children.”\u0026nbsp; “Hearth tales. Does Craster seem less than human to you?”\u0026nbsp; In half a hundred ways. “He gives his sons to the wood.”\u0026nbsp; A long silence. Then: “Yes.” And “Yes,” the raven muttered, strutting. “Yes, yes, yes.”\u0026nbsp; “You knew?”\u0026nbsp; “Smallwood told me. Long ago. All the rangers know, though few will talk of it.”\u0026nbsp; “Did my uncle know?”\u0026nbsp; “All the rangers,” Mormont repeated. “You think I ought to stop him. Kill him if need be.” The Old Bear sighed. “Were it only that he wished to rid himself of some mouths, I’d gladly send Yoren or Conwys to collect the boys. We could raise them to the black and the Watch would be that much the stronger. But the wildlings serve crueler gods than you or I. These boys are Craster’s offerings. His prayers, if you will.”\u0026nbsp; His wives must offer different prayers, Jon thought.\u0026nbsp; “How is it you came to know this?” the Old Bear asked him. “From one of Craster’s wives?”\u0026nbsp; “Yes, my lord,” Jon confessed. “I would sooner not tell you which. She was frightened and wanted help.”\u0026nbsp; “The wide world is full of people wanting help, Jon. Would that some could find the courage to help themselves. Craster sprawls in his loft even now, stinking of wine and lost to sense. On his board below lies a sharp new axe. Were it me, I’d name it ‘Answered Prayer’ and make an end.”\u0026nbsp;\u0026nbsp; Yes. Jon thought of Gilly. She and her sisters. They were nineteen, and Craster was one, but...\u0026nbsp; “Yet it would be an ill day for us if Craster died. Your uncle could tell you of the times Craster’s Keep made the difference between life and death for our rangers.”\u0026nbsp; “My father...” He hesitated.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1522/45525.html","bookId":1301,"creation":"Aug 2, 2019 2:58:34 AM","modification":"Aug 2, 2019 2:58:34 AM"}
