{"id":10313,"no":142,"title":"CHAPTER 142","content":"“Aye, and strike somewhere else. The Others take all such cowards. They would never dare, no more than the Bastard of Bolton, if our main strength were not a thousand leagues south.” Ser Rodrik looked at Bran. “What else did the lad tell you?”\u0026nbsp; “He said the water would flow over our walls. He saw Alebelly drowned, and Mikken and Septon Chayle too.”\u0026nbsp; Ser Rodrik frowned. “Well, should it happen that I need to ride against these raiders myself, I shan’t take Alebelly, then. He didn’t see me drowned, did he? No? Good.”\u0026nbsp; It heartened Bran to hear that. Maybe they won’t drown, then, he thought. If they stay away from the sea.\u0026nbsp; Meera thought so too, later that night when she and Jojen met Bran in his room to play a three-sided game of tiles, but her brother shook his head. “The things I see in green dreams can’t be changed.”\u0026nbsp; That made his sister angry. “Why would the gods send a warning if we can’t heed it and change what’s to come?”\u0026nbsp; “I don’t know,” Jojen said sadly.\u0026nbsp; “If you were Alebelly, you’d probably jump into the well to have done with it! He should fight, and Bran should too.”\u0026nbsp; “Me?” Bran felt suddenly afraid. “What should I fight? Am I going to drown too?”\u0026nbsp; Meera looked at him guiltily. “I shouldn’t have said.”\u0026nbsp; He could tell that she was hiding something. “Did you see me in a green dream?” he asked Jojen nervously. “Was I drowned?”\u0026nbsp; “Not drowned.” Jojen spoke as if every word pained him. “I dreamed of the man who came today, the one they call Reek. You and your brother lay dead at his feet, and he was skinning off your faces with a long red blade.”\u0026nbsp; Meera rose to her feet. “If I went to the dungeon, I could drive a spear right through his heart. How could he murder Bran if he was dead?”\u0026nbsp; “The gaolers will stop you,” Joien said. “The guards. And if you tell them why you want him dead, they’ll never believe.”\u0026nbsp; “I have guards too,” Bran reminded them. “Alebelly and Poxy Tym and Hayhead and the rest.”\u0026nbsp; Jojen’s mossy eyes were full of pity. “They won’t be able to stop him, Bran. I couldn’t see why, but I saw the end of it. I saw you and Rickon in your crypts, down in the dark with all the dead kings and their stone wolves.”\u0026nbsp;\u0026nbsp; No, Bran thought. No. “If I went away... to Greywater, or to the crow, someplace far where they couldn’t find me...”\u0026nbsp; “It will not matter. The dream was green, Bran, and the green dreams do not lie.” \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1522/45556.html","bookId":1301,"creation":"Aug 2, 2019 3:00:21 AM","modification":"Aug 2, 2019 3:00:21 AM"}
