{"id":10351,"no":180,"title":"CHAPTER 180","content":"That need not be the one I dreamed of.\u0026nbsp; Even so, Ebben would have loosed a shaft at it, but the squire stopped him. “The bird’s well out of bowshot.”\u0026nbsp; “I don’t like it watching us.”\u0026nbsp; The squire shrugged. “Nor me, but you won’t stop it. Only waste a good arrow.”\u0026nbsp; Qhorin sat in his saddle, studying the eagle for a long time. “We press on,” he finally said. The rangers resumed their descent.\u0026nbsp; Ghost, Jon wanted to shout, where are you?\u0026nbsp; He was about to follow Qhorin and the others when he glimpsed a flash of white between two boulders. A patch of old snow, he thought, until he saw it stir. He was off his horse at once. As he went to his knees,\u0026nbsp; Ghost lifted his head. His neck glistened wetly, but he made no sound when Jon peeled off a glove and touched him. The talons had torn a bloody path through fur and flesh, but the bird had not been able to snap his neck.\u0026nbsp; Qhorin Halfhand was standing over him. “How bad?”\u0026nbsp; As if in answer, Ghost struggled to his feet.\u0026nbsp; “The wolf is strong,” the ranger said. “Ebben, water. Stonesnake, your skin of wine. Hold him still, Jon.”\u0026nbsp; Together they washed the caked blood from the direwolf’s fur. Ghost struggled and bared his teeth when Qhorm poured the wine into the ragged red gashes the eagle had left him, but Jon wrapped his arms around him and murmured soothing words, and soon enough the wolf quieted.\u0026nbsp; By the time they’d ripped a strip from Jon’s cloak to wrap the wounds, full dark had settled. Only a dusting of stars set the black of sky apart from the black of stone. “Do we press on?” Stonesnake wanted to know.\u0026nbsp; Qhorin went to his garron. “Back, not on.”\u0026nbsp; “Back?” Jon was taken by surprise.\u0026nbsp; “Eagles have sharper eyes than men. We are seen. So now we run.” The Halfhand wound a long black scarf around his face and swung up into the saddle.\u0026nbsp; The other rangers exchanged a look, but no man thought to argue. One by one they mounted and turned their mounts toward home. “Ghost, come,” he called, and the direwolf followed, a pale shadow moving through the night.\u0026nbsp; All night they rode, feeling their way up the twisting pass and through the stretches of broken ground. The wind grew stronger. Sometimes it was so dark that they dismounted and went ahead on foot, each man leading his garron. Once Ebben suggested that some torches might serve them well, but Qhorin said, “No fire,” and that was the end of that. They reached the stone bridge at the summit and began to descend again. Off in the darkness a shadowcat screamed in fury, its voice bouncing off the rocks so it seemed as though a dozen other ‘cats were giving answer. Once Jon thought he saw a pair of glowing eyes on a ledge overhead, as big as harvest moons.\u0026nbsp; In the black hour before dawn, they stopped to let the horses drink and fed them each a handful of oats and a twist or two of hay. “We are not far from the place the wildlings died,” said Qhorin. “From there, one man could hold a hundred. The right man.” He looked at Squire Dalbridge.\u0026nbsp; The squire bowed his head. “Leave me as many arrows as you can spare, brothers.” He stroked his longbow. “And see my garron has an apple when you’re home. He’s earned it, poor beastie.” He’s staying to die, Jon realized.\u0026nbsp; Qhorin clasped the squire’s forearm with a gloved hand. “If the eagle flies down for a look at you...”\u0026nbsp; “...he’ll sprout some new feathers.”\u0026nbsp; The last Jon saw of Squire Dalbridge was his back as he clambered up the narrow path to the heights.\u0026nbsp; When dawn broke, Jon looked up into a cloudless sky and saw a speck moving through the blue. Ebben saw it too, and cursed, but Qhorin told him to be quiet. “Listen.”\u0026nbsp; Jon held his breath, and heard it. Far away and behind them, the call of a hunting horn echoed against the mountains.\u0026nbsp; “And now they come,” said Qhorin. \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1522/45594.html","bookId":1301,"creation":"Aug 2, 2019 3:02:19 AM","modification":"Aug 2, 2019 3:02:19 AM"}
