{"id":10200,"no":29,"title":"CHAPTER 28","content":"“You’ll miss me all the time in your Red Keep,” she said as she led him to her room. “All alone in your cold bed in your Tower of the Hand.”\u0026nbsp; “Too true.” Tyrion would gladly have kept her with him, but his lord father had forbidden it. You will not take the whore to court, Lord Tywin had commanded. Bringing her to the city was as much defiance as he dared. All his authority derived from his father, the girl had to understand that. “You won’t be far,” he promised. “You’ll have a house, with guards and servants, and I’ll visit as often as I’m able.”\u0026nbsp; Shae kicked shut the door. Through the cloudy panes of the narrow window, he could make out the Great Sept of Baelor crowning Visenya’s Hill but Tyrion was distracted by a different sight. Bending, Shae took her gown by the hem, drew it over her head, and tossed it aside. She did not believe in smallclothes. “You’ll never be able to rest,” she said as she stood before him, pink and nude and lovely, one hand braced on her hip. “You’ll think of me every time you go to bed. Then you’ll get hard and you’ll have no one to help you and you’ll never be able to sleep unless you”-she grinned that wicked grin Tyrion liked so well-”is that why they call it the Tower of the Hand, m’lord?”\u0026nbsp; “Be quiet and kiss me,” he commanded.\u0026nbsp;\u0026nbsp; He could taste the wine on her lips, and feel her small firm breasts pressed against him as her fingers moved to the lacings of his breeches. “My lion,” she whispered when he broke off the kiss to undress. “My sweet lord, my giant of Lannister.” Tyrion pushed her toward the bed. When he entered her, she screamed loud enough to wake Baelor the Blessed in his tomb, and her nails left gouges in his back. He’d never had a pain he liked half so well.\u0026nbsp; Fool, he thought to himself afterward, as they lay in the center of the sagging mattress amidst the rumpled sheets. Will you never learn, dwarf? She’s a whore, damn you, it’s your coin she loves, not your cock. Remember Tysha? Yet when his fingers trailed lightly over one nipple, it stiffened at the touch, and he could see the mark on her breast where he’d bitten her in his passion.\u0026nbsp; “So what will you do, m’lord, now that you’re the Hand of the King?” Shae asked him as he cupped that warm sweet flesh.\u0026nbsp; “Something Cersei will never expect,” Tyrion murmured softly against her slender neck. “I’ll do... justice.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1522/45431.html","bookId":1301,"creation":"Aug 2, 2019 2:54:19 AM","modification":"Aug 2, 2019 2:54:19 AM"}
