{"id":10213,"no":42,"title":"CHAPTER 41","content":"The raven flapped big black wings. “Me, me, me.”\u0026nbsp; “If you are ever Lord Commander, you may do as you please,” Mormont told the ranger, “but it seems to me that I have not died yet, nor have the brothers put you in my place.”\u0026nbsp; “I’m First Ranger now, with Ben Stark lost and Ser Jaremy killed,” Smallwood said stubbornly. “The command should be mine.”\u0026nbsp; Mormont would have none of it. “I sent out Ben Stark, and Ser Waymar before him. I do not mean to send you after them and sit wondering how long I must wait before I give you up for lost as well.” He pointed. “And Stark remains First Ranger until we know for a certainty that he is dead. Should that day come, it will be me who names his successor, not you. Now stop wasting my time. We ride at first light, or have you forgotten?”\u0026nbsp; Smallwood pushed to his feet. “As my lord commands.” On the way out, he frowned at Jon, as if it were somehow his fault.\u0026nbsp; “First Ranger!” The Old Bear’s eyes lighted on Sam. “I’d sooner name you First Ranger. He has the effrontery to tell me to my face that I’m too old to ride with him. Do I look old to you, boy?” The hair that had retreated from Mormont’s spotted scalp had regrouped beneath his chin in a shaggy grey beard that covered much of his chest. He thumped it hard. “Do I look frail?”\u0026nbsp;\u0026nbsp; Sam opened his mouth, gave a little squeak. The Old Bear terrified him. “No, my lord,” Jon offered quickly. “You look strong as a... a...\u0026nbsp; “Don’t cozen me, Snow, you know I won’t have it. Let me have a look at these maps.” Mormont pawed through them brusquely, giving each no more than a glance and a grunt. “Was this all you could find?”\u0026nbsp; “I... m-m-my lord,” Sam stammered, “there... there were more, b-b-but... the dis-disorder...”\u0026nbsp; “These are old,” Mormont complained, and his raven echoed him with a sharp cry of “Old, old.”\u0026nbsp; “The villages may come and go, but the hills and rivers will be in the same places,” Jon pointed out.\u0026nbsp; “True enough. Have you chosen your ravens yet, Tarly?”\u0026nbsp; “M-m-maester Aemon m-means to p-pick them come evenfall, after the f-f-feeding.”\u0026nbsp; “I’ll have his best. Smart birds, and strong.”\u0026nbsp; “Strong,” his own bird said, preening. “Strong, strong.”\u0026nbsp; “If it happens that we’re all butchered out there, I mean for my successor to know where and how we died.”\u0026nbsp; Talk of butchery reduced Samwell Tarly to speechlessness. Mormont leaned forward. “Tarly, when I was a lad half your age, my lady mother told me that if I stood about with my mouth open, a weasel was like to mistake it for his lair and run down my throat. If you have something to say, say it. Otherwise, beware of weasels.” He waved a brusque dismissal. “Off with you, I’m too busy for folly. No doubt the maester has some work you can do.”\u0026nbsp; Sam swallowed, stepped back, and scurried out so quickly he almost tripped over the rushes.\u0026nbsp; “Is that boy as big a fool as he seems?” the Lord Commander asked when he’d gone. “Fool,” the raven complained. Mormont did not wait for Jon to answer. “His lord father stands high in King Renly’s councils, and I had half a notion to dispatch him... no, best not. Renly is not like to heed a quaking fat boy. I’ll send Ser Arnell. He’s a deal steadier, and his mother was one of the green-apple Fossoways.”\u0026nbsp; “If it please my lord, what would you have of King Renly?”\u0026nbsp; “The same things I’d have of all of them, lad. Men, horses, swords, armor, grain, cheese, wine, wool, nails... the Night’s Watch is not proud, we take what is offered.” His fingers drummed against the roughhewn planks of the table. “If the winds have been kind, Ser Alliser should reach King’s Landing by the turn of the moon, but whether this boy Joffrey will pay him any heed, I do not know. House Lannister has never been a friend to the Watch.”\u0026nbsp; “Thorne has the wight’s hand to show them.” A grisly pale thing with black fingers, it was, that twitched and stirred in its jar as if it were still alive.\u0026nbsp; “Would that we had another hand to send to Renly.”\u0026nbsp; “Dywen says you can find anything beyond the Wall.”\u0026nbsp; “Aye, Dywen says. And the last time he went ranging, he says he saw a bear fifteen feet tall.” Mormont snorted. “My sister is said to have taken a bear for her lover. I’d believe that before I’d believe one fifteen feet tall. Though in a world where dead come walking... ah, even so, a man\u0026nbsp; must believe his eyes. I have seen the dead walk. I’ve not seen any giant bears.” He gave Jon a long, searching look. “But we were speaking of hands. How is yours?”\u0026nbsp; “Better.” Jon peeled off his moleskin glove and showed him. Scars covered his arm halfway to the elbow, and the mottled pink flesh still felt tight and tender, but it was healing. “It itches, though. Maester Aemon says that’s good. He gave me a salve to take with me when we ride.”\u0026nbsp; “You can wield Longclaw despite the pain?”\u0026nbsp; “Well enough.” Jon flexed his fingers, opening and closing his fist the way the maester had shown him. “I’m to work the fingers every day to keep them nimble, as Maester Aemon said.”\u0026nbsp; “Blind he may be, but Aemon knows what he’s about. I pray the gods let us keep him another twenty years. Do you know that he might have been king?”\u0026nbsp; Jon was taken by surprise. “He told me his father was king, but not... I thought him perhaps a younger son.”\u0026nbsp; “So he was. His father’s father was Daeron Targaryen, the Second of His Name, who brought Dorne into the realm. Part of the pact was that he wed a Dornish princess. She gave him four sons. Aemon’s father Maekar was the youngest of those, and Aemon was his third son. Mind you, all this happened long before I was born, ancient as Smallwood would make me.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1522/45447.html","bookId":1301,"creation":"Aug 2, 2019 2:55:01 AM","modification":"Aug 2, 2019 2:55:01 AM"}
