{"id":10222,"no":51,"title":"CHAPTER 50","content":"Bywater glanced over the names and smiled. “As you will.”\u0026nbsp; “There’s one,” Tyrion said quietly. “Deem. Tell the captain it would not be taken amiss if that one should happen to be swept overboard before they reach Eastwatch.”\u0026nbsp; “I’m told those northern waters are very stormy, my lord.” Ser Jacelyn bowed and took his leave, his cloak rippling behind him. He trod on Slynt’s cloth-of-gold cape on his way.\u0026nbsp; Tyrion sat alone, sipping at what remained of the fine sweet Dornish wine. Servants came and went, clearing the dishes from the table. He told them to leave the wine. When they were done, Varys came gliding into the hall, wearing flowing lavender robes that matched his smell. “Oh sweetly done, my good lord.”\u0026nbsp; “Then why do I have this bitter taste in my mouth?” He pressed his fingers into his temples. “I told them to throw Allar Deem into the sea. I am sorely tempted to do the same with you.”\u0026nbsp; “You might be disappointed by the result,” Varys replied. “The storms come and go, the waves crash overhead, the big fish eat the little fish, and I keep on paddling. Might I trouble you for a taste of the wine that Lord Slynt enjoyed so much?”\u0026nbsp; Tyrion waved at the flagon, frowning.\u0026nbsp; Varys filled a cup. “Ah. Sweet as summer.” He took another sip. “I hear the grapes singing on my tongue.”\u0026nbsp; “I wondered what that noise was. Tell the grapes to keep still, my head is about to split. It was my sister. That was what the oh-so-loyal Lord Janos refused to say. Cersei sent the gold cloaks to that brothel.”\u0026nbsp; Varys tittered nervously. So he had known all along.\u0026nbsp; “You left that part out,” Tyrion said accusingly.\u0026nbsp; “Your own sweet sister,” Varys said, so grief-stricken he looked close to tears. “It is a hard thing to tell a man, my lord. I was fearful how you might take it. Can you forgive me?”\u0026nbsp; “No,” Tyrion snapped. “Damn you. Damn her.” He could not touch Cersei, he knew. Not yet, not even if he’d wanted to, and he was far from certain that he did. Yet it rankled, to sit here and make a mummer’s show of justice by punishing the sorry likes of Janos Slynt and Allar Deem, while his sister continued on her savage course. “In future, you will tell me what you know, Lord Varys. All of what you know.”\u0026nbsp; The eunuch’s smile was sly. “That might take rather a long time, my good lord. I know quite a lot.”\u0026nbsp; “Not enough to save this child, it would seem.”\u0026nbsp; “Alas, no. There was another bastard, a boy, older. I took steps to see him removed from harm’s way... but I confess, I never dreamed the babe would be at risk. A baseborn girl, less than a year old, with a whore for a mother. What threat could she pose?”\u0026nbsp;\u0026nbsp; “She was Robert’s,” Tyrion said bitterly. “That was enough for Cersei, it would seem.”\u0026nbsp; “Yes. It is grievous sad. I must blame myself for the poor sweet babe and her mother, who was so young and loved the king.”\u0026nbsp; “Did she?” Tyrion had never seen the dead girl’s face, but in his mind she was Shae and Tysha both. “Can a whore truly love anyone, I wonder? No, don’t answer. Some things I would rather not know.” He had settled Shae in a sprawling stone-and-timber manse, with its own well and stable and garden; he had given her servants to see to her wants, a white bird from the Summer Isles to keep her company, silks and silver and gemstones to adorn her, guards to protect her. And yet she seemed restive. She wanted to be with him more, she told him; she wanted to serve him and help him. “You help me most here, between the sheets,” he told her one night after their loving as he lay beside her, his head pillowed against her breast, his groin aching with a sweet soreness. She made no reply, save with her eyes. He could see there that it was not what she’d wanted to hear.\u0026nbsp; Sighing, Tyrion started to reach for the wine again, then remembered Lord Janos and pushed the flagon away. “It does seem my sister was telling the truth about Stark’s death. We have my nephew to thank for that madness.”\u0026nbsp; “King Joffrey gave the command. Janos Slynt and Ser Ilyn Payne carried it out, swiftly, without hesitation...”\u0026nbsp; “... almost as if they had expected it. Yes, we have been over this ground before, without profit. A folly.”\u0026nbsp; “With the City Watch in hand, my lord, you are well placed to see to it that His Grace commits no further... follies? To be sure, there is still the queen’s household guard to consider...”\u0026nbsp; “The red cloaks?” Tyrion shrugged. “Vylarr’s loyalty is to Casterly Rock. He knows I am here with my father’s authority. Cersei would find it hard to use his men against me... besides, they are only a hundred. I have half again as many men of my own. And six thousand gold cloaks, if Bywater is the man you claim.”\u0026nbsp; “You will find Ser Jacelyn to be courageous, honorable, obedient... and most grateful.”\u0026nbsp; “To whom, I wonder?” Tyrion did not trust Varys, though there was no denying his value. He knew things, beyond a doubt. “Why are you so helpful, my lord Varys?” he asked, studying the man’s soft hands, the bald powdered face, the slimy little smile.\u0026nbsp; “You are the Hand. I serve the realm, the king, and you.”\u0026nbsp; “As you served Jon Arryn and Eddard Stark?”\u0026nbsp; “I served Lord Arryn and Lord Stark as best I could. I was saddened and horrified by their most untimely deaths.”\u0026nbsp; “Think how I feel. I’m like to be next.”\u0026nbsp; “Oh, I think not,” Varys said, swirling the wine in his cup. “Power is a curious thing, my lord. Perchance you have considered the riddle I posed you that day in the inn?”\u0026nbsp; “It has crossed my mind a time or two,” Tyrion admitted. “The king, the priest, the rich man-who lives and who dies? Who will the swordsman obey? It’s a riddle without an answer, or rather, too many answers. All depends on the man with the sword.”\u0026nbsp;\u0026nbsp; “And yet he is no one,” Varys said. “He has neither crown nor gold nor favor of the gods, only a piece of pointed steel.”\u0026nbsp; “That piece of steel is the power of life and death.”\u0026nbsp; “Just so... yet if it is the swordsmen who rule us in truth, why do we pretend our kings hold the power? Why should a strong man with a sword ever obey a child king like Joffrey, or a wine-sodden oaf like his father? “\u0026nbsp; “Because these child kings and drunken oafs can call other strong men, with other swords.”\u0026nbsp; “Then these other swordsmen have the true power. Or do they? Whence came their swords? Why do they obey?” Varys smiled. “Some say knowledge is power. Some tell us that all power comes from the gods. Others say it derives from law. Yet that day on the steps of Baelor’s Sept, our godly High Septon and the lawful Queen Regent and your everso-knowledgeable servant were as powerless as any cobbler or cooper in the crowd. Who truly killed Eddard Stark do you think? Joffrey, who gave the command? Ser Ilyn Payne, who swung the sword? Or... another?”\u0026nbsp; Tyrion cocked his head sideways. “Did you mean to answer your damned riddle, or only to make my head ache worse?”\u0026nbsp; Varys smiled. “Here, then. Power resides where men believe it resides. No more and no less.”\u0026nbsp; “So power is a mummer’s trick?”\u0026nbsp; “A shadow on the wall,” Varys murmured, “yet shadows can kill. And ofttimes a very small man can cast a very large shadow.”\u0026nbsp; Tyrion smiled. “Lord Varys, I am growing strangely fond of you. I may kill you yet, but I think I’d feel sad about it.”\u0026nbsp; “I will take that as high praise.”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1522/45456.html","bookId":1301,"creation":"Aug 2, 2019 2:55:27 AM","modification":"Aug 2, 2019 2:55:27 AM"}
