{"id":10226,"no":55,"title":"CHAPTER 54","content":"“Well, use that tree right there.” He pointed. “You don’t know what’s out there, Arry. I heard wolves before.”\u0026nbsp; Yoren wouldn’t like it if she fought with him. She tried to look afraid. “Wolves? For true?”\u0026nbsp; “I heard,” he assured her.\u0026nbsp; “I don’t think I need to go after all.” She went back to her blanket and pretended to sleep until she heard Hot Pie’s footsteps going away. Then she rolled over and slipped off into the woods on the other side of the camp, quiet as a shadow. There were sentries out this way too, but Arya had no trouble avoiding them. just to make sure, she went out twice as far as usual. When she was sure there was no one near, she skinned down her breeches and squatted to do her business.\u0026nbsp; She was making water, her clothing tangled about her ankles, when she heard rustling from under the trees. Hot Pie, she thought in panic, he followed me. Then she saw the eyes shining out from the wood, bright with reflected moonlight. Her belly clenched tight as she grabbed for Needle, not caring if she pissed herself, counting eyes, two four eight twelve, a whole pack...\u0026nbsp; One of them came padding out from under the trees. He stared at her, and bared his teeth, and all she could think was how stupid she’d been and how Hot Pie would gloat when they found her half-eaten body the next morning. But the wolf turned and raced back into the darkness, and quick as that the eyes were gone. Trembling, she cleaned herself and laced up and followed a distant scraping sound back to camp, and to Yoren. Arya climbed up into the wagon beside him, shaken. “Wolves,” she whispered hoarsely. “In the woods.”\u0026nbsp; “Aye. They would be.” He never looked at her.\u0026nbsp; “They scared me.”\u0026nbsp; “Did they?” He spat. “Seems to me your kind was fond o’ wolves.”\u0026nbsp; “Nymeria was a direwolf.” Arya hugged herself. “That’s different. Anyhow, she’s gone. Jory and I threw rocks at her until she ran off, or else the queen would have killed her.” it made her sad to talk about it. “I bet if she’d been in the city, she wouldn’t have let them cut off Father’s head.”\u0026nbsp; “Orphan boys got no fathers,” Yoren said, “or did you forget that?” The sourleaf had turned his spit red, so it looked like his mouth was bleeding. “The only wolves we got to fear are the ones wear manskin, like those who done for that village.”\u0026nbsp; “I wish I was home,” she said miserably. She tried so hard to be brave, to be fierce as a wolverine and all, but sometimes she felt like she was just a little girl after all.\u0026nbsp; The black brother peeled a fresh sourleaf from the bale in the wagon and stuffed it into his mouth. “Might be I should of left you where I found you, boy. All of you. Safer in the city, seems to me.”\u0026nbsp; “I don’t care. I want to go home.”\u0026nbsp; “Been bringing men to the Wall for close on thirty years.” Froth shone on Yoren’s lips, like bubbles of blood. “All that time, I only lost three. Old man died of a fever, city boy got snakebit taking a shit, and one fool tried to kill me in my sleep and got a red smile for his trouble.” He drew the dirk across his throat, to show her. “Three in thirty years.” He spat out the old sourleaf. “A ship now, might have been wiser. No chance o’ finding more men on the way, but still...\u0026nbsp; clever man, he’d go by ship, but me... thirty years I been taking this kingsroad.” He sheathed his dirk. “Go to sleep, boy. Hear me?”\u0026nbsp; She did try. Yet as she lay under her thin blanket, she could hear the wolves howling... and another sound, fainter, no more than a whisper on the wind, that might have been screams.\u0026nbsp; \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1522/45460.html","bookId":1301,"creation":"Aug 2, 2019 2:55:38 AM","modification":"Aug 2, 2019 2:55:38 AM"}
