{"id":10259,"no":88,"title":"CHAPTER 88","content":"“No.” He did not like to talk about the dreams.\u0026nbsp; “A prince should lie better than that.” Osha laughed. “Well, your dreams are your business. Mine’s in the kitchens, and I’d best be getting back before Gage starts to shouting and waving that big wooden spoon of his. By your leave, my prince.”\u0026nbsp; She should never have talked about the wolf dreams, Bran thought as Hodor carried him up the steps to his bedchamber. He fought against sleep as long as he could, but in the end it took him as it always did. On this night he dreamed of the weirwood. it was looking at him with its deep red eyes, calling to him with its twisted wooden mouth, and from its pale branches the three-eyed crow came flapping, pecking at his face and crying his name in a voice as sharp as swords.\u0026nbsp; The blast of horns woke him. Bran pushed himself onto his side, grateful for the reprieve. He heard horses and boisterous shouting. More guests have come, and half-drunk by the noise of them. Grasping his bars he pulled himself from the bed and over to the window seat. On their banner was a giant in shattered chains that told him that these were Umber men, down from the northlands beyond the Last River.\u0026nbsp; The next day two of them came together to audience; the Greatjon’s uncles, blustery men in the winter of their days with beards as white as the bearskin cloaks they wore. A crow had once taken Mors for dead and pecked out his eye, so he wore a chunk of dragonglass in its stead. As Old Nan told the tale, he’d grabbed the crow in his fist and bitten its head off, so they named him Crowfood. She would never tell Bran why his gaunt brother Hother was called Whoresbane.\u0026nbsp; No sooner had they been seated than Mors asked for leave to wed Lady Hornwood. “The Greatjon’s the Young Wolf’s strong right hand, all know that to be true. Who better to protect the widow’s lands than an Umber, and what Umber better than me?”\u0026nbsp; “Lady Donella is still grieving,” Maester Luwin said.\u0026nbsp; “I have a cure for grief under my furs.” Mors laughed. Ser Rodrik thanked him courteously and promised to bring the matter before the lady and the king.\u0026nbsp;\u0026nbsp; Hother wanted ships. “There’s wildlings stealing down from the north, more than I’ve ever seen before. They cross the Bay of Seals in little boats and wash up on our shores. The crows in Eastwatch are too few to stop them, and they go to ground quick as weasels. It’s longships we need, aye, and strong men to sail them. The Greatjon took too many. Half our harvest is gone to seed for want of arms to swing the scythes.”\u0026nbsp; Ser Rodrik pulled at his whiskers. “You have forests of tall pine and old oak. Lord Manderly has shipwrights and sailors in plenty. Together you ought to be able to float enough longships to guard both your coasts.”\u0026nbsp; “Manderly?” Mors Umber snorted. “That great waddling sack of suet? His own people mock him as Lord Lamprey, I’ve heard. The man can scarce walk. If you stuck a sword in his belly, ten thousand eels would wriggle out.”\u0026nbsp; “He is fat,” Ser Rodrik admitted, “but he is not stupid. You will work with him, or the king will know the reason why.” And to Bran’s astonishment, the truculent Umbers agreed to do as he commanded, though not without grumbling.\u0026nbsp; While they were sitting at audience, the Glover men arrived from Deepwood Motte, and a large party of Tallharts from Torrhen’s Square. Galbart and Robett Glover had left Deepwood in the hands of Robett’s wife, but it was their steward who came to Winterfell. “My lady begs that you excuse her absence. Her babes are still too young for such a journey, and she was loath to leave them.” Bran soon realized that it was the steward, not Lady Glover, who truly ruled at Deepwood Motte. The man allowed that he was at present setting aside only a tenth of his harvest. A hedge wizard had told him there would be a bountiful spirit summer before the cold set in, he claimed. Maester Luwin had a number of choice things to say about hedge wizards. Ser Rodrik commanded the man to set aside a fifth, and questioned the steward closely about Lord Hornwood’s bastard, the boy Larence Snow. in the north, all highborn bastards took the surname Snow This lad was near twelve, and the steward praised his wits and courage.\u0026nbsp; “Your notion about the bastard may have merit, Bran,” Maester Luwin said after. “One day you will be a good lord for Winterfell, I think.,,\u0026nbsp; “No I won’t.” Bran knew he would never be a lord, no more than he could be a knight. “Robb’s to marry some Frey girl, you told me so yourself, and the Walders say the same. He’ll have sons, and they’ll be the lords of Winterfell after him, not me.”\u0026nbsp; “It may be so, Bran,” Ser Rodrik said, “but I was wed three times and my wives gave me daughters. Now only Beth remains to me. My brother Martyn fathered four strong sons, yet only Jory lived to be a man. When he was slain, Martyn’s line died with him. When we speak of the morrow nothing is ever certain.”\u0026nbsp; Leobald Tallhart had his turn the following day. He spoke of weather portents and the slack wits of smallfolk, and told how his nephew itched for battle. “Benfred has raised his own company of lances. Boys, none older than nineteen years, but every one thinks he’s another young wolf. When I told them they were only young rabbits, they laughed at me. Now they call themselves the Wild Hares and gallop about the country with rabbitskins tied to the ends of their lances, singing songs of chivalry.”\u0026nbsp;\u0026nbsp; Bran thought that sounded grand. He remembered Benfred Tallhart, a big bluff loud boy who had often visited Winterfell with his father, Ser Helman, and had been friendly with Robb and with Theon Greyjoy. But Ser Rodrik was clearly displeased by what he heard. “If the king were in need of more men, he would send for them,” he said. “Instruct your nephew that he is to remain at Torrhen’s Square, as his lord father commanded.”\u0026nbsp; “I will, ser,” said Leobald, and only then raised the matter of Lady Hornwood. Poor thing, with no husband to defend her lands nor son to inherit. His own lady wife was a Hornwood, sister to the late Lord Halys, doubtless they recalled. “An empty hall is a sad one. I had a thought to send my younger son to Lady Donella to foster as her own. Beren is near ten, a likely lad, and her own nephew. He would cheer her, I am certain, and perhaps he would even take the name Hornwood\u0026nbsp; “If he were named heir?” suggested Maester Luwin.\u0026nbsp; “... so the House might continue,” finished Leobald.\u0026nbsp; Bran knew what to say. “Thank you for the notion, my lord,” he blurted out before Ser Rodrik could speak. “We will bring the matter to my brother Robb. Oh, and Lady Hornwood.”\u0026nbsp; Leobald seemed surprised that he had spoken. “I’m grateful, my prince,” he said, but Bran saw pity in his pale blue eyes, mingled perhaps with a little gladness that the cripple was, after all, not his son. For a moment he hated the man.\u0026nbsp; Maester Luwin liked him better, though. “Beren Tallhart may well be our best answer,” he told them when Leobald had gone. “By blood he is half Hornwood. If he takes his uncle’s name...”\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1522/45496.html","bookId":1301,"creation":"Aug 2, 2019 2:57:19 AM","modification":"Aug 2, 2019 2:57:19 AM"}
