{"id":10267,"no":96,"title":"CHAPTER 96","content":"“You expect her to sleep with all the noise?” Clegane said. “What was the trouble? “\u0026nbsp; “Fools at the gate,” Ser Boros admitted. “Some loose tongues spread tales of the preparations for Tyrek’s wedding feast, and these wretches got it in their heads they should be feasted too. His Grace led a sortie and sent them scurrying.”\u0026nbsp; “A brave boy,” Clegane said, mouth twitching.\u0026nbsp; Let us see how brave he is when he faces my brother, Sansa thought. The Hound escorted her across the drawbridge. As they were winding their way up the steps, she said, “Why do you let people call you a dog? You won’t let anyone call you a knight.”\u0026nbsp; “I like dogs better than knights. My father’s father was kennelmaster at the Rock. One autumn year, Lord Tytos came between a lioness and her prey. The lioness didn’t give a shit that she was Lannister’s own sigil. Bitch tore into my lord’s horse and would have done for my lord too, but my grandfather came up with the hounds. Three of his dogs died running her off. My grandfather lost a leg, so Lannister paid him for it with lands and a towerhouse, and took his son to squire. The three dogs on our banner are the three that died, in the yellow of autumn grass. A hound will die for you, but never lie to you. And he’ll look you straight in the face.” He cupped her under the jaw, raising her chin, his fingers pinching her painfully. “And that’s more than little birds can do, isn’t it? I never got my song.”\u0026nbsp; “I... I know a song about Florian and Jonquil.”\u0026nbsp; “Florian and Jonquil? A fool and his cunt. Spare me. But one day I’ll have a song from you, whether you will it or no.”\u0026nbsp; “I will sing it for you gladly.”\u0026nbsp; Sandor Clegane snorted. “Pretty thing, and such a bad liar. A dog can smell a lie, you know. Look around you, and take a good whiff. They’re all liars here... and every one better than you.”\u0026nbsp; \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1522/45507.html","bookId":1301,"creation":"Aug 2, 2019 2:57:40 AM","modification":"Aug 2, 2019 2:57:40 AM"}
