{"id":80855,"no":20,"title":"Page 20","content":"\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eMEGAN\u003c/p\u003e\n\u003cp\u003eTen years later…\u003c/p\u003e\n\u003cp\u003e“Hafy Bifby.”\u003c/p\u003e\n\u003cp\u003e“What was that?”\u003c/p\u003e\n\u003cp\u003eChris moves his mouth away from my pussy, licking his lips. “I said ‘happy birthday.’” I giggle as he dives back between my legs, licking and sucking his way to my orgasm.\u003c/p\u003e\n\u003cp\u003eI stretch my arms over my head, spreading my legs wider. This isn’t a bad way to start my twenty-eighth year. I grip his hair in my hands, grinding against his face, never getting tired of the way he feels on my body.\u003c/p\u003e\n\u003cp\u003eWe’ve been through so much, and getting to this moment was hard fought, but goddamn, was it worth it.\u003c/p\u003e\n\u003cp\u003eSurprisingly, my parents were thrilled that Chris and I were together, and we didn’t realize it at the time, but having that support meant all the difference. I opted out of my last year of high school and graduated early. Chris and I didn’t go public until it was official, but the backlash was awful. He coached the high school to a state championship with an undefeated season and still they wanted him out. The school board created a new contract for him to sign that was just bullshit to push him out of the door. He didn’t need the money or the attention, so he just went quietly, not making a scene. My heart broke for him, because all he ever wanted to do was to be involved in football, even if it was coaching.\u003c/p\u003e\n\u003cp\u003eAfter a year of sulking about it, I suggested he get involved in a local ‘big brother’ football camp. Ever since then, he’s found his purpose again. He’s been there eight years, and loves seeing the boys grow and develop.\u003c/p\u003e\n\u003cp\u003eI was pretty much treated the same way I was before senior year of high school, like the awkward girl no one knew what to do with. But I was used to it, so it was no skin off my nose. I got pregnant the minute Chris got inside me, giving birth to our son, Chris Junior, nine months later. After that, we had our daughter Fae, and then our other daughter Mara. My pregnancy with Mara was difficult, so after that, we decided it was time to close the baby chapter. Our family is happy and healthy, and that’s all I ever wanted.\u003c/p\u003e\n\u003cp\u003e“Fuck, baby, I can’t wait. I need to get inside you.”\u003c/p\u003e\n\u003cp\u003e“It’s my birthday! Don’t I get a say?”\u003c/p\u003e\n\u003cp\u003e“After this, I need to take the edge off.” Chris scoots up the bed, thrusting inside me, hard and fast. “Goddamn, eating that pussy gets me so fucking hard.”\u003c/p\u003e\n\u003cp\u003eHe reaches between us, rubbing my clit, and then leans down to kiss me, letting me taste myself. The flavor of my need combined with his hard cock fucking me tests my limits. Chris pulls back, putting a hand over my mouth as I shout my release. I feel myself squirt on his cock, drenching him in my cum.\u003c/p\u003e\n\u003cp\u003e“Fuck.” He buries his face in my neck, biting me there while he empties inside me. The feeling of his warm cum flooding me makes me twitch and sparks off another, smaller orgasm.\u003c/p\u003e\n\u003cp\u003e“Mom! Grandma is here to take me to soccer practice!” I hear Fae yell from the bottom of the stairs.\u003c/p\u003e\n\u003cp\u003e“Tonight the kids are going to your parents’,” Chris says as he licks my nipple, sucking it into his mouth.\u003c/p\u003e\n\u003cp\u003e“What are we going to do with an empty house and all this time on our hands?” I giggle as I rub his hairy chest. God, he’s forty and just getting sexier with every year that passes.\u003c/p\u003e\n\u003cp\u003e“I’m sure we can think of something.”\u003c/p\u003e\n\u003cp\u003e“How about you put on that Darth Vader mask I got you and you punish me for being a rebel?”\u003c/p\u003e\n\u003cp\u003eHe gets a wicked look in his eye and nods his head. “I think I’d enjoy showing you my Lightsaber.”\u003c/p\u003e\n\u003cp\u003eWe fall into giggling pile as we roll around in our happily ever after.\u003c/p\u003e\n\u003cp\u003eTHE END \u003c/p\u003e","sourceLink":"https://allnovel.net/coach-breeding-1/page-20.html","bookId":1800,"creation":"Oct 5, 2019 4:30:28 PM","modification":"Oct 5, 2019 4:30:28 PM"}
