{"id":40609,"no":11,"title":"CHAPTER X. DAVID BALL FROM MONTANA.","content":"\u0026nbsp;Finding that Joe could be depended upon, Mr. Mallison put him in charge of all of the boats at the hotel, so that our hero had almost as much work ashore as on the lake. \n\u003cdiv\u003e\n During the week following, the events just narrated, many visitors left the hotel and others came in. Among those to go were Felix Gussing and the two young ladies. The dude bid our hero a cordial good-bye, for he now knew Joe quite well.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-bye, Mr. Gussing,” said Joe. “I hope we meet again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps we shall, although I generally go to a different place each summer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I don\u0027t expect to stay in Riverside all my life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see. If you make a move, I hope you do well,” returned Felix.\n\u003c/div\u003e \n\u003cdiv\u003e\n On the day after the dude left, a man came to the hotel who, somehow, looked familiar to our hero. He came dressed in a light overcoat and a slouch hat, and carried a valise and a suit case.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ve seen him before, but where?” Joe asked himself not once but several times.\n\u003c/div\u003e \n\u003cdiv\u003e\n The man registered as David Ball, and put down his address as Butte, Montana. He said he was a mining expert, but added that he was sick and the doctors had ordered him to come East for a rest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “\u0027ve heard of Riverside being a nice place,” said he, “so I came on right after striking Pittsburg.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We shall do all we can to make your stay a pleasant one,” said the hotel proprietor, politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All I want is a nice sunny room, where I can get fresh air and take it easy,” said the man.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was willing to pay a good price, and so obtained one of the best rooms in the house, one overlooking the river and the lake. He ate one meal in the dining room, but after that he had his meals sent to his apartment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he sick?” asked Joe, after watching the man one day.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He certainly doesn\u0027t seem to be well,” answered Andrew Mallison.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It runs in my mind that I have seen him before, but I can\u0027t place him,” went on our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must be mistaken, Joe. I questioned him and he says this is his first trip to the East, although he has frequently visited St. Louis and Chicago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n On the following day the man called for a physician and Doctor Gardner was sent for.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ve got pains here,” said the man from the West, and pointed to his chest. “Do you think I am getting consumption?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Riverside physician made a careful examination and then said the man had probably strained himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Reckon I did,” was the ready answer. “I was in the mine and a big rock came down on me. I had to hold it up for ten minutes before anybody came to my aid. I thought I was a dead one sure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will give you some medicine and a liniment,” said the doctor. “Perhaps you\u0027ll feel better after a good rest.” And then he left.\n\u003c/div\u003e \n\u003cdiv\u003e\n That afternoon Joe had to go up into the hotel for something and passed the room of the new boarder. He saw the man standing by the window, gazing out on the water.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m dead certain I\u0027ve seen him before,” mused our hero. “It is queer I can\u0027t think where.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Doctor Gardner wanted to be taken across the lake and Joe himself did the job. As he was rowing he asked about the man who had signed the hotel register as David Ball from Montana.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he very sick, doctor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I can\u0027t say that he is,” was the physician\u0027s answer. “He looks to be as healthy as you or I.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s queer he keeps to his room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps something happened out at his mine to unsettle his nerves. He told me of some sort of an accident.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he a miner?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is a mine owner, so Mr. Mallison told me, but he never heard of the man before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The stranger received several letters the next day and then a telegram. Shortly after that he took to his bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am feeling worse,” said he to the bell boy who answered his ring. “I want you to send for that doctor again. Ask him to call about noon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” answered the boy, and Doctor Gardner was sent for without delay. He came and made another examination and left some medicine.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll take the medicine regularly,” said the stranger, who was in bed. But when the doctor had left he quietly poured half of the contents of the bottle into the wash bowl, where it speedily drained from sight!\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t catch me drinking such rot,” he muttered to himself. “I\u0027d rather have some good liquor any day,” and he took a long pull from a black bottle he had in his valise.\n\u003c/div\u003e \n\u003cdiv\u003e\n About noon a carriage drove up to the hotel and two men alighted.\n\u003c/div\u003e \n\u003cdiv\u003e\n One led the way into the hotel and asked to see the register.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027d like to see Mr. David Ball,” said he to the clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Ball is sick.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I have heard and that is why I wish to see him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll send up your card.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t happen to have a card. Tell him Mr. Anderson is here, from Philadelphia, with a friend of his.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The message was sent to the sick man\u0027s room, and word came down that he would see the visitors in a few minutes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He says he is pretty sick and he can\u0027t talk business very long,” said the bell boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We won\u0027t bother him very much,” answered the man who had given his name as Anderson.\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe happened to be close by during this conversation and he looked the man called Anderson over with care.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ve seen that man, too!” he declared to himself. “But where? I declare he is as much of a mystery as the sick one!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Our hero\u0027s curiosity was now aroused to the highest pitch, and when the two men walked up to David Ball\u0027s room he followed to the very doorway.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come in,” came from the room, and a deep groan followed. On the bed lay the man from Montana, wrapped in several blankets and with a look of anguish on his features.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Feeling pretty bad, eh?” said Anderson, as he stalked in. “I am downright sorry for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m afraid I am going to die,” groaned the man in bed. “The doctor says I am in bad shape. He wants me to take a trip to Europe, or somewhere else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is Mr. Maurice Vane,” went on Anderson. “We won\u0027t trouble you any more than is necessary, Mr. Ball.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry to disturb you,” said Maurice Vane. He was a kindly looking gentleman. “Perhaps we had better defer this business until some other time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, no, one time is as bad as another,” came with another groan from the bed. “Besides, I admit I need money badly. If it wasn\u0027t for that—“. The man in bed began to cough. “Say, shut the door,” he went on, to the first man who had come in.\n\u003c/div\u003e \n\u003cdiv\u003e\n The door was closed, and for the time being Joe heard no more of the conversation.\n\u003c/div\u003e \n\u003cdiv\u003e\n It must be admitted that our hero was perplexed, and with good reason. He felt certain that the man in bed was shamming, that he was hardly sick at all. If so, what was his game?\n\u003c/div\u003e \n\u003cdiv\u003e\n “Something is surely wrong somewhere,” he reasoned. “I wish I could get to the bottom of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The room next to the one occupied by David Ball was empty and he slipped into this. The room contained a closet, and on the other side was another closet, opening into the room the men were in. The partition between was of boards, and as the other door stood wide open, Joe, by placing his head to the boards, could hear fairly well.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have the stock?” he heard Maurice Vane ask.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, in my valise. Hand me the bag and I\u0027ll show you,” answered the man in bed. “Oh, how weak I feel!” he sighed.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a silence and then the rustling of papers.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what is your bottom price for these?” went on Maurice Vane.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thirty thousand dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I told Mr. Vane you might possibly take twenty-five thousand,” came from the man called Anderson.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They ought to be worth face value—fifty thousand dollars,” said the man in bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n A talk in a lower tone followed, and then more rustling of papers.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will call to-morrow with the cash,” said Maurice Vane, as he prepared to leave. “In the meantime, you promise to keep these shares for me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll keep them until noon. I\u0027ve got another offer,” said the man in bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We\u0027ll be back,” put in the man called Anderson. “So don\u0027t you sell to anybody else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the two visitors left and went downstairs. Five minutes later they were driving away in the direction of the railroad station.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This certainly beats anything I ever met before,” said Joe, to himself as he watched them go. “I\u0027ll wager all I am worth that I\u0027ve met that Anderson before, and that he is a bad man. I do wish I could get at the bottom of what is going on.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In the evening he had occasion to go upstairs in the hotel once more. To his surprise he saw Mr. David Ball sitting in a rocking-chair, calmly smoking a cigar and reading a paper.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He isn\u0027t as sick as he was this morning,” he mused. “In fact, I don\u0027t think he is sick at all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He wished to be on hand the following morning, when the strangers came back, but an errand took him up the lake. He had to stop at several places, and did not start on the return until four in the afternoon.\n\u003c/div\u003e \n\u003cdiv\u003e\n On his way back Joe went ashore close to where the old lodge was located, and something, he could not tell what, made him run over and take a look at the spot that had proved a shelter for Ned and himself during the heavy storm. How many things had occurred since that fatal day!\n\u003c/div\u003e \n\u003cdiv\u003e\n As our hero looked into one of the rooms he remembered the strange men he had seen there—the fellows who had talked about mining stocks. Then, of a sudden, a revelation came to him, like a thunderbolt out of a clear sky.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ve got it! I\u0027ve got it!” he cried. “Mr. David Ball is that fellow who called himself Malone, and Anderson is the man named Caven! They are both imposters!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2981/82205.html","bookId":342,"creation":"Aug 5, 2019 1:30:53 PM","modification":"Aug 5, 2019 1:30:53 PM"}
