{"id":40614,"no":16,"title":"CHAPTER XV. WHAT HAPPENED TO JOSIAH BEAN.","content":"\u0026nbsp;In the meantime Josiah Bean and the slick-looking individual turned into Broad street and made their way to a certain establishment known as the Eagle\u0027s Club. \n\u003cdiv\u003e\n Here Henry Davis called another man aside.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Say, Foxy, do you know anybody down to Barwell \u0026amp; Cameron\u0027s?” he asked, in a low tone, so that the old farmer could not hear.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—a clerk named Chase.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then come down and introduce me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s the game?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind—there\u0027s a tenner in it for you if it works.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I\u0027m on, Bill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hush—my name is Henry Davis.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, Hank,” returned Foxy, carelessly.\n\u003c/div\u003e \n\u003cdiv\u003e\n He came forward and was introduced to the old farmer in the following fashion:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Richard Barlow—of Barlow \u0026amp; Small, manufacturers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n All three made their way to the establishment of Barwell \u0026amp; Cameron, and then Henry Davis was introduced under that name to a clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n As soon as Foxy had departed the slick-looking individual turned to the clerk and called the old farmer forward.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is my esteemed friend, Mr. Josiah Bean, of Haydown Center. He has business with Mr. Cameron, I believe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m here to collect six hundred dollars,” said Josiah Bean. “Mr. Cameron writ me some letters about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, sir. Sit down, gentlemen, and I\u0027ll tell Mr. Cameron.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The two were kept waiting for a few minutes and were then ushered into a private office. Through Chase, the clerk, Henry Davis was introduced and then Josiah Bean. All the papers proved to be correct, and after the old farmer had signed his name he was given a check.\n\u003c/div\u003e \n\u003cdiv\u003e\n “See here, I want the cash,” he demanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well,” said Mr. Cameron. “Indorse the check and I\u0027ll have the money drawn for you across the street.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The farmer wrote down his name once more, and a few minutes later received his six hundred dollars in twelve brand-new fifty-dollar bills.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Gosh! Them will be nice fer Mirandy to look at,” was his comment, as he surveyed the bills.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Be careful that you don\u0027t lose them, Mr. Bean,” cautioned Henry Davis, as the two left the establishment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Reckon the best thing I can do is to git back to hum this afternoon,” remarked Josiah Bean, when he was on the street.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, now you are in town you\u0027ll have to look around a bit,” said the slick-looking individual. “You can take a train back to-morrow just as well. Let me show you a few of the sights.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This tickled the old farmer and he agreed to remain over until the next noon. Then Henry Davis dragged the old man around to various points of interest and grew more familiar than ever.\n\u003c/div\u003e \n\u003cdiv\u003e\n While they were at the top of one of the big office buildings Henry Davis pretended to drop his pocketbook.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How careless of me!” he cried.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Got much in it?” queried Josiah Bean.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Three thousand dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do tell! It\u0027s a powerful sight o\u0027 money to carry so careless like.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is. Maybe you had better carry it for me, Mr. Bean.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not me! I ain\u0027t goin\u0027 to be responsible fer nobody\u0027s money but my own—an\u0027 Mirandy\u0027s.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better see if your own money is safe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Josiah Bean got out his wallet and counted the bills.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Safe enough.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you sure? I thought there was only five hundred and fifty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, six hundred.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll bet you ten dollars on it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What! can\u0027t I count straight,” gasped the old farmer, much disturbed. “Six hundred I tell you,” he added, after he had gone over the amount once more.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If there is I\u0027ll give you the ten dollars,” answered the slick one. “Let me count the bills.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, there ye be, Mr. Davis.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Henry Davis took the wallet and pretended to count the bills.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hullo, what\u0027s that?” he cried, whirling around.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s wot?” demanded Josiah Bean, also looking around.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought I heard somebody cry fire.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t say thet! Say, let\u0027s git out o\u0027 here—I don\u0027t want to look at the sights.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right—here\u0027s your money. I guess it\u0027s six hundred after all,” answered the slick-looking individual, passing over the wallet.\n\u003c/div\u003e \n\u003cdiv\u003e\n They hurried to the elevator and got into quite a crowd of people.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait for me here,” said Henry Davis, as they walked past the side corridor. “I want to step in yonder office and send a message to a friend.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He ran off, leaving the old farmer by himself. Josiah Bean looked around him nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess that wasn\u0027t no cry o\u0027 fire after all,” he mused. “Well, if there\u0027s a fire I kin git out from here quick enough.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The office building was a large one, running from one street to the next. On the street in the rear was a bookstore, the proprietor of which had advertised for a clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe had applied for the position and was waiting for the proprietor to address him when, on chancing to look up, he saw Henry Davis rush past as if in a tremendous hurry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hullo, that\u0027s the fellow who was with the old farmer,” he told himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What can I do for you, young man?” asked the proprietor of the bookshop, approaching at that instant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe you wish a clerk,” answered our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you had experience in this line?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you won\u0027t do. I must have someone who is experienced.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am willing to learn.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It won\u0027t do. I want an experienced clerk or none at all,” was the sharp answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n Leaving the bookstore, Joe stood out on the sidewalk for a moment and then walked around the corner.\n\u003c/div\u003e \n\u003cdiv\u003e\n A moment later he caught sight of Josiah Bean, gazing up and down the thoroughfare and acting like one demented.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s the matter?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Matter?” bawled the old farmer. “I\u0027ve been took in! Robbed! Swindled! Oh, wot will Mirandy say!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who robbed you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thet Mr. Davis I reckon! He counted the money last, an\u0027 now it\u0027s gone!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I saw Mr. Davis a minute ago.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Around the corner, walking as fast as he could.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027s got my money! Oh, I must catch him!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll help you,” answered Joe, with vigor. “I thought he looked like a slick one,” he added.\n\u003c/div\u003e \n\u003cdiv\u003e\n He led the way and Josiah Bean came behind. The old farmer looked as if he was ready to drop with fright. The thought of losing his wife\u0027s money was truly horrifying.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mirandy won\u0027t never forgive me!” he groaned. “Oh, say, boy, we\u0027ve got to catch that rascal!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If we can,” added our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had noted the direction taken by the swindler, and now ran across the street and into a side thoroughfare leading to where a new building was being put up.\n\u003c/div\u003e \n\u003cdiv\u003e\n Here, from a workman, he learned that the sharper had boarded a street car going south. He hailed the next car and both he and the old farmer got aboard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This ain\u0027t much use,” said Josiah Bean, with quivering lips. “We dunno how far he took himself to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let us trust to luck to meet him,” said Joe.\n\u003c/div\u003e \n\u003cdiv\u003e\n They rode for a distance of a dozen blocks and then the car came to a halt, for there was a blockade ahead.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We may as well get off,” said our hero. “He may be in one of the forward cars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They alighted and walked on, past half a dozen cars. Then our hero gave a cry of triumph.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There he is!” he said, and pointed to the swindler, who stood on a car platform, gazing anxiously ahead.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2981/82210.html","bookId":342,"creation":"Aug 5, 2019 1:30:53 PM","modification":"Aug 5, 2019 1:30:53 PM"}
