{"id":40628,"no":30,"title":"CHAPTER XXIX. THE FATE OF TWO EVILDOERS.","content":"\u0026nbsp;“Are you going to let them arrest us?” whispered Pat Malone, as the whole party moved through the woods towards a wagon road which ran nearly parallel to the railroad tracks. \n\u003cdiv\u003e\n “Not if I can help it,” Caven whispered back. “We must watch our chances.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Half a mile was covered and they came out on the road. It was growing dark and there were signs of a storm in the air.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s going to rain,” said Joe, and he was right.\n\u003c/div\u003e \n\u003cdiv\u003e\n “See here, I don\u0027t want to get wet to the skin,” growled Caven. “I\u0027ll catch my death of cold.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is a barn just ahead,” said Bill Badger. “Let us get inside.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe was willing, and soon all were in the barn. It was now raining at a heavy rate and they were glad to be under shelter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “With a barn there ought to be a house,” remarked our hero. “But I don\u0027t see any.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It grew still darker, and the rain came down in perfect sheets. The roof of the barn leaked, and they had to move from one spot to another, to keep out of the drippings.\n\u003c/div\u003e \n\u003cdiv\u003e\n While this was going on Gaff Caven was working at the handkerchief that bound his wrists and soon had it loose. Pat Malone also liberated himself. Caven winked suggestively at his confederate.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Watch me,” he whispered. “When I give the signal we\u0027ll knock \u0027em both down and run for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But the pistol—” began Malone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll take care of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In moving around the old barn Caven spotted a club and moved close to it. Suddenly he snatched the weapon up and hit Bill Badger on the arm with it. The pistol flew into a corner and went off, sending a bullet into a board.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Run!” yelled Caven, and leaped for the open doorway. Malone came beside him, and both ran off through the rain as fast as their legs could carry them.\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe was startled and made after the pair. But at a groan from Bill Badger he paused.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you badly hurt?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He gave me a stiff crack on the arm,” growled the young westerner.\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe ran for the corner and caught up the pistol. Then he leaped for the open doorway.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stop, both of you!” he called out. “Stop, or I\u0027ll fire!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don\u0027t you dare!” shrieked Pat Malone, and ran faster than ever, behind the nearest of the trees. Joe aimed the weapon, but before he could pull the trigger both of the bad men were out of sight.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Go after them, if you want to,” said Bill Badger. “I\u0027ll go too.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are not badly hurt?” queried our hero, sympathetically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but if I catch that fellow I\u0027ll give it to him good,” grumbled the young westerner.\n\u003c/div\u003e \n\u003cdiv\u003e\n Both now left the barn and made after Caven and Malone. Once they caught sight of the rascals, moving in the direction of the railroad tracks.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are going to catch a train if they can!” cried our hero. “I hear one coming.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s a freight most likely,” was Bill Badger\u0027s answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was right, and soon the long line of freight cars hove into sight around a bend and on an upgrade. Far in the distance they beheld Caven and Malone scooting for the train with all speed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are going to make it,” sighed Joe. “Too bad!”\n\u003c/div\u003e \n\u003cdiv\u003e\n They continued to run, but before they could get anywhere near the tracks they saw Caven leap for the train and get between two of the cars. Then Malone got aboard also, and the freight train passed out of sight through the cut.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That ends the chase,” said Joe, halting. “They were slick to get away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If we only knew where they would get off we could send word ahead,” suggested his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, we don\u0027t know, and after this they will probably keep their eyes wide open and keep out of sight as much as possible. Anyway, I don\u0027t think they\u0027ll bother Mr. Vane any more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It\u0027s not likely. I\u0027m a witness to what they were up to,” answered the young westerner.\n\u003c/div\u003e \n\u003cdiv\u003e\n Both Joe and Bill Badger were soaked from the rain and resolved to strike out for the nearest farmhouse or village. They kept along the railroad tracks, and presently came to a shanty where there was a track-walker.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How far to the nearest village?” asked our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Half a mile.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How is it you are out here in the rain?” went on the track-walker.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We got off our train and it went off without us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I see. Too bad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Again our hero and his companion hurried on, and soon came in sight of a small village. They inquired their way to a tavern, and there dried their clothing and procured a good, hot meal, which made both feel much better.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am going to send a telegram to Mr. Vane,” said Joe, and did so without further delay. He was careful of the satchel and did not leave it out of his sight.\n\u003c/div\u003e \n\u003cdiv\u003e\n They found they could get a train for the West that evening at seven o\u0027clock and at the proper time hurried to the depot.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m glad I met you,” said Joe, to his newly-made friend. “Now, what do you think I owe you for what you did?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As we didn\u0027t land the fellows in jail you don\u0027t owe me anything,” said Bill Badger, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well then, you can pay the extra expense, and let that fill the bill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll certainly do that,” said Joe, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n As they rode along Bill Badger told something of himself and of the mine his father owned, and then Joe told something of his own story.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you say your name is Joe Bodley?” asked the young westerner, with deep interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you are looking for a man by the name of William A. Bodley?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It seems to me I know a man by that name, although the miners all call him Bill Bodley.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is this Bill Bodley?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Out in Montana somewhere. He worked for my father once, about three years ago. He was rather a strange man, about fifty years old. He had white hair and a white beard, and acted as if he had great trouble on his mind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You do not know where he is now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but perhaps my father knows.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I\u0027m going to see your father as soon as I can,” said Joe, decidedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mind you, I don\u0027t say that this Bill Bodley is the man you are after, Joe. I don\u0027t want to raise any false hopes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you ever hear where the man came from?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he told somebody that he once owned a farm in Kansas or Iowa.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This William A. Bodley once owned a farm at Millville, Iowa.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that so! Then he may be the same man after all. To tell the truth, he looked a little bit like you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Was he a good man?” asked Joe, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, indeed. But some of the men poked fun at him because he was so silent and strange at times. I liked him and so did father. He left us to go prospecting in the mountains.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Thus the talk ran on for half an hour, when the train came to a sudden halt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are we at a station?” asked Bill Badger.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know,” said Joe.\n\u003c/div\u003e \n\u003cdiv\u003e\n Both looked out of the window but could see nothing except hills and forests.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We are in the foothills,” said the young westerner. “Something must be wrong on the tracks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “More fallen trees perhaps.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Or a landslide. They have them sometimes, when it rains as hard as it did to-day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They left the car with some others and soon learned that there had been a freight collision ahead and that half a dozen freight cars had been smashed to splinters.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think it can be the freight that Caven and Malone boarded?” came from our hero, on hearing this news.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It might be,” answered Bill Badger. “Let us take a look. Our train won\u0027t move for hours now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They walked to the scene of the wreck. One of the cars had been burnt up but the conflagration was now under control and a wrecking crew was already at work clearing the tracks so that they might be used.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Anybody hurt?” asked Joe of a train hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, two men killed. They were riding between the cars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tramps?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They didn\u0027t look like tramps. But they hadn\u0027t any right to ride on the freight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are they?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Over in the shanty yonder.”\n\u003c/div\u003e \n\u003cdiv\u003e\n With a queer sensation in his heart Joe walked to the little building, accompanied by Bill Badger. A curious crowd was around and they had to force their way to the front.\n\u003c/div\u003e \n\u003cdiv\u003e\n One look was enough. Gaff Caven and Pat Malone lay there, cold in death. They had paid the penalty of their crimes on earth and gone to the final judgment.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2981/82224.html","bookId":342,"creation":"Aug 5, 2019 1:30:53 PM","modification":"Aug 5, 2019 1:30:53 PM"}
