{"id":40602,"no":4,"title":"CHAPTER III. A HOME IN RUINS.","content":"\u0026nbsp;As Joe rowed toward his home on the mountain side, a good mile from Riverside, he could not help but think of the two mysterious men and of what they had said. \n\u003cdiv\u003e\n “They were certainly rascals,” he mused. “And from their talk they must have come from New York and are now going to try some game in Philadelphia.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The hermit\u0027s boy was tired out by the day\u0027s outing, yet he pulled a fairly quick stroke and it was not long before he reached the dock at which he and Hiram Bodley were in the habit of leaving their boat. He cleaned the craft out, hid the oars in the usual place, and then, with his fishing lines in one hand and a good sized fish in the other, started up the trail leading to the place that he called home.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What a place to come to, alongside of the one Ned lives in,” he said to himself. “I suppose the Talmadges think this is a regular hovel. I wish we could afford something better,—or at least live in town. It\u0027s lonesome here with nobody but old Uncle Hiram around.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As Joe neared the cabin something seemed to come over him and, for some reason he could not understand, he felt very much depressed in spirits. He quickened his pace, until a turn of the trail brought the homestead into view.\n\u003c/div\u003e \n\u003cdiv\u003e\n A cry of alarm broke from his lips and with good reason. The little shelter had stood close to a large hemlock tree. The lightning had struck the tree, causing it to topple ever. In falling, it had landed fairly and squarely upon the cabin, smashing it completely. One corner of the cabin was in ashes, but the heavy rain had probably extinguished the conflagration.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Uncle Hiram!” cried the boy, as soon as he recovered from his amazement. “Uncle Hiram, where are you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no answer to this call and for the moment Joe\u0027s heart seemed to stop beating. Was the old hermit under that pile of ruins? If so it was more than likely he was dead.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dropping his fish and his lines, the youth sprang to the front of the cabin. The door had fallen to the ground and before him was a mass of wreckage with a small hollow near the bottom. He dropped on his knees and peered inside.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Uncle Hiram!” he called again.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no answer, and he listened with bated breath. Then he fancied he heard a groan, coming from the rear of what was left of the cabin. He ran around to that point and pulled aside some boards and a broken window sash.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Uncle Hiram, are you here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Joe!” came in a low voice, full of pain. The man tried to say more but could not.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hauling aside some more boards, Joe now beheld the hermit, lying flat on his back, with a heavy beam resting on his chest. He was also suffering from a cut on the forehead and from a broken ankle.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is too bad, Uncle Hiram!” he said, in a trembling voice. “I\u0027ll get you out just as soon as I can.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Be—be careful, Joe—I—I—my ribs must be broken,” gasped the hermit.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll be careful,” answered the boy, and began to pull aside one board after another. Then he tugged away at the beam but could not budge it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Raise it up Joe—it—is—crushing the life ou—out of me,” said the hermit faintly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll pry it up,” answered the boy, and ran off to get a block of wood. Then he procured a stout pole and with this raised the heavy beam several inches.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you crawl out, Uncle Hiram?”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was no answer, and Joe saw that the man had fainted from exhaustion. Fixing the pole so it could not slip, he caught hold of the hermit and dragged him to a place of safety.\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe had never had to care for a hurt person before and he scarcely knew how to proceed. He laid the hermit on the grass and washed his face with water. Soon Hiram Bodley opened his eyes once more.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My chest!” he groaned. “All of my ribs must be broken! And my ankle is broken, too!” And he groaned again.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I had better get a doctor, Uncle Hiram.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A doctor can\u0027t help me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps he can.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I haven\u0027t any faith in doctors. A doctor operated on my mother and killed her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But Doctor Gardner is a nice man. He will do all he can for you, I am sure,” urged Joe.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Dr. Gardner is a good fellow I admit. If you—can—can get him—I\u0027ll—I\u0027ll—” The sufferer tried to go on but could not.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I can get him. But I hate to leave you alone.” And Joe stared around helplessly. He wished he had Ned with him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind—give me a drink—then go,” answered Hiram Bodley. He had often taken Doctor Gardner out to hunt with him and liked the physician not a little.\n\u003c/div\u003e \n\u003cdiv\u003e\n Inside of five minutes Joe was on the way to the doctor\u0027s residence, which was on the outskirts of Riverside. He had left the hermit as comfortable as possible, on a mattress and covered with a cloth to keep off the night air,—for it was now growing late and the sun had set behind the mountains.\n\u003c/div\u003e \n\u003cdiv\u003e\n Tired though he was the boy pulled with might and main, and so reached the dock of the physician\u0027s home in a short space of time. Running up the walk of the neatly-kept garden, he mounted the piazza and rang the bell several times.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What\u0027s the matter?” asked Doctor Gardner, who came himself to answer the summons.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Our cabin is in ruins, because of the storm, and Mr. Bodley is badly hurt,” answered Joe, and related some of the particulars.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is certainly too bad, my boy,” said the physician. “I\u0027ll come at once and do what I can for him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He ran for a case of instruments and also for some medicines, and then followed Joe back to the boat.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You act as if you were tired,” said the doctor, after he had watched Joe at the oars for several minutes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am tired, sir—I\u0027ve been rowing a good deal to-day. But I guess I can make it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me row,” said the physician, and took the oars. He was a fine oarsman, and the trip was made in half the time it would have taken Joe to cover the distance.\n\u003c/div\u003e \n\u003cdiv\u003e\n At the dock there was a lantern, used by Joe and the hermit when they went fishing at night. This was lit, and the two hurried up the trail to the wreck of the cabin.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hiram Bodley was resting where Joe had left him. He was breathing with difficulty and did not at first recognize the doctor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take it off!” he murmured. “Take it off! It is—is crushing th—the life out of—of me!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Bodley—Hiram, don\u0027t you know me?” asked Doctor Gardner, kindly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh! So it\u0027s you? I guess you can\u0027t do much, doctor, can you? I—I\u0027m done for!” And a spasm of pain crossed the sufferer\u0027s face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “While there is life there is hope,” answered the physician, noncommittally. He recognized at once that Hiram Bodley\u0027s condition was critical.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He\u0027ll get over it, won\u0027t he?” questioned Joe, quickly.\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctor did not answer, but turned to do what he could for the hurt man. He felt of his chest and listened to his breathing, and then administered some medicine.\n\u003c/div\u003e \n\u003cdiv\u003e\n “His ankle is hurt, too,” said Joe.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind the ankle just now, Joe,” was the soft answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was something in the tone that alarmed the boy and he caught the physician by the arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Doctor, tell me the truth!” he cried. “Is he is he going to die?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid so, my lad. His ribs are crushed and one of them has stuck into his right lung.”\n\u003c/div\u003e \n\u003cdiv\u003e\n At these words the tears sprang into the boy\u0027s eyes and it was all he could do to keep from crying outright. Even though the old hermit had been rough in his ways, Joe thought a good deal of the man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Cannot you do something, doctor,” he pleaded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not here. We might do something in a hospital, but he would not survive the journey. He is growing weaker every moment. Be brave, my lad. It is a terrible trial, I know, but you must remember that all things are for the best.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe knelt beside the sufferer and took hold of his hand. Hiram Bodley looked at him and then at the doctor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I can\u0027t live—I know it,” he said hoarsely. “Joe, stay by me till I die, won\u0027t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes!” faltered the boy. “Oh, this is awful!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027m sorry to leave you so soon, Joe—I—I thought I\u0027d be—be able to do something for you some day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have done something for me, Uncle Hiram.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All I\u0027ve got goes to you, Joe. Doctor, do you hear that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It—it ain\u0027t much, but it\u0027s something. The blue box—I put it in the blue box—” Here the sufferer began to cough.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The blue box?” came from Joe questioningly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Joe, all in the blue box—the papers and the money—And the blue box is—is—” Again the sufferer began to cough. “I—I want water!” he gasped.\n\u003c/div\u003e \n\u003cdiv\u003e\n The water was brought and he took a gulp. Then he tried to speak again, but the effort was in vain. The doctor and Joe raised him up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Uncle Hiram! Speak to me!” cried the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n But Hiram Bodley was past speaking. He had passed to the Great Beyond.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2981/82198.html","bookId":342,"creation":"Aug 5, 2019 1:30:53 PM","modification":"Aug 5, 2019 1:30:53 PM"}
