{"id":40603,"no":5,"title":"CHAPTER IV. THE SEARCH FOR THE BLUE BOX.","content":"\u0026nbsp;Three days after his tragic death Hiram Bodley was buried. Although he was fairly well known in the lake region only a handful of people came to his funeral. Joe was the chief mourner, and it can honestly be said that he was much downcast when he followed the hermit to his last resting place. \n\u003cdiv\u003e\n After the funeral several asked Joe what he intended to do. He could not answer the question.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you found that blue box?” questioned Doctor Gardner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir, I have not thought of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Probably it contains money and papers of value, Joe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am going to look for it to-day,” said the boy. “I—I couldn\u0027t look for it while—while—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I understand. Well, I trust you locate the box and that it contains all you hope for,” added the physician.\n\u003c/div\u003e \n\u003cdiv\u003e\n As luck would have it, Ned Talmadge\u0027s family had just gone away on a trip to the West, so Mr. Talmadge could offer the boy no assistance. But Ned was on hand and did what he could.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don\u0027t know what you\u0027ll do next, do you, Joe?” asked Ned, as he and Joe returned to the wreck of the cabin.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, if you haven\u0027t any money I\u0027ll do what I can for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Ned; you are very kind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It must be hard to be thrown out on the world in this fashion,” went on the rich boy, sympathetically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is hard. After all, I thought a good deal of Uncle Hiram. He was strange in his ways, but he had a good heart.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wasn\u0027t he shot in the head once by accident in the woods?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe that made him queer at times.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ve got six dollars and a half of my spending money saved up. You may have that if you wish,” continued Ned, generously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027d rather not take it, Ned.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I can, I want to be independent. Besides, I think there is money around somewhere,” and Joe mentioned the missing blue box.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You must hunt for that blue box by all means!” cried the rich boy. “I\u0027ll help you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n After the death of Hiram Bodley, Joe and two of the lake guides had managed to repair one room of the broken-down cabin, and from this the funeral had taken place.\n\u003c/div\u003e \n\u003cdiv\u003e\n The room contained a bed, a table, two benches and a few dishes and cooking utensils The floor was bare and the window was broken out. It was truly a most uninviting home.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course you are not going to stay here, now you are alone?” said Ned, after a look around.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t know where else to go, Ned.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not move into town!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps I will. But I want to find that blue box before I decide on anything.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Without delay the two boys set to work among the ruins, looking into every hole and corner they could think of and locate. They pulled away heavy boards and logs, and Joe even got a spade and dug up the ground at certain points.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It doesn\u0027t seem to be here,” said Ned, after an hour had passed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It must be here,” cried Joe.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps it was buried under a tree.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That may be true. Anyway, I am certain it is somewhere around this cabin.”\n\u003c/div\u003e \n\u003cdiv\u003e\n After that the hunt was continued for another hour, and they visited several spots in that locality where Joe thought the blue box might have been placed. But it was all to no purpose, the box failed to come to light.\n\u003c/div\u003e \n\u003cdiv\u003e\n At last the two boys sat down on a bench in front of the cabin. Both were tired out, Ned especially so. Joe was much downcast and his friend did what he could to cheer him up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The box is bound to come to light some day,” said Ned. “That is, unless some of those men carried it off.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What men, Ned?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The fellows who helped to mend the cabin just before the funeral.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I don\u0027t think they would steal the box. Bart Andrews and Jack Thompson are as honest as the day is long.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, it\u0027s mighty queer you can\u0027t find some trace of the blue box.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The boys talked the matter over for some time, and then Ned announced that he must go home.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can go with me if you wish,” he said. “It will be better than staying here all alone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But Joe declined the offer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll stay here, and begin the hunt again the first thing in the morning,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, if you want anything, come and see me, Joe; won\u0027t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will, Ned.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ned had come over in his own boat and now Joe walked down to the lake with him. His friend gone, the hermit\u0027s boy returned to the dilapidated cabin.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was hungry but he had no heart to eat. He munched some bread and cheese which a neighbor had brought over. He felt utterly alone in the great worlds and when he thought of this a strange feeling came over him.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a bitter night for the poor boy, but when morning came his mind was made up. He would make his own way in the world, asking aid from no one, not even Ned.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And if I can\u0027t find the blue box I\u0027ll get along without it,” he told himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n As soon as it was light he procured breakfast and then started on another hunt for the missing box. The entire day was spent in the search, but without results. Towards night, Joe went down to the lake. Here he caught a couple of small fish, which he fried for his supper.\n\u003c/div\u003e \n\u003cdiv\u003e\n All told, Joe had exactly a dollar and a half of his own and nine dollars which he had found in the hermit\u0027s pocketbook.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ten dollars and a half,” he mused, as he counted the amount over. “Not very much to go out into the world with. If I want to do anything in town I\u0027ll have to buy some clothes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n From this it will be surmised that Joe was thinking of giving up his roving life around the lake and mountains, and this was true.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hunting and fishing appealed to him only in an uncertain way, and he longed to go forth into the busy world and make something of himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had two suits of clothing, but both were very much worn, and so were his shoes and his cap. Hiram Bodley had left some old clothing, but they were too big for the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I guess I\u0027ll get Jasok the peddler to come up here and make me an offer for what is here,” he told himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jasok was a Hebrew peddler who drove around through the lake region, selling tinware and doing all sorts of trading. It was time for him to visit that neighborhood and Joe went to the nearest house on the main road and asked about the man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He will most likely be along to-morrow, Joe,” said the neighbor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he comes, Mr. Smith, will you send him over to my place? Tell him I want an offer for the things.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Going to sell out, Joe?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you going to do after that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Try for some job in town.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s a good idea. Hunting and fishing isn\u0027t what it used to be. What do you want for the things?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All I can get,” and a brief smile hovered on Joe\u0027s face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wouldn\u0027t sell out too cheap. Jasok is a great fellow to drive a bargain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he won\u0027t give me a fair price, I\u0027ll load the things on the rowboat and sell them in town.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That\u0027s an idea. Do you want to sell Hiram\u0027s double-barrel shot gun?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I\u0027ll give you ten dollars for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was going to ask twelve, Mr. Smith. It\u0027s a pretty good gun.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So it is, although it is a little bit old-fashioned. Well, bring it over and I\u0027ll allow you twelve dollars,” answered the neighbor, who was willing to assist Joe all he could.\n\u003c/div\u003e \n\u003cdiv\u003e\n Joe went back for the gun without delay, and received his money. Then he returned to the cabin and brought out all the goods he wished to sell.\n\u003c/div\u003e \n\u003cdiv\u003e\n By the middle of the next day the Hebrew peddler appeared. At first he declared that all of the things Joe had to sell were not worth two dollars.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, if you think that, we won\u0027t talk about it,” said Joe, briefly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Da vos all vorn out,” said Jasok. “De clothes vos rags, and de furniture an\u0027 dishes was kracked.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you don\u0027t want them, I\u0027ll take them to town and sell them. I am sure Moskowsky will buy them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Now it happened that Moskowsky was a rival peddler who also boasted of the ownership of a second-hand store. To think that the goods might go to this man nettled Jasok exceedingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Vell, I likes you, Cho,” he said. “I vos your friend, an\u0027 I gif you dree dollars for dem dings.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can have them for ten dollars,” answered the boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n A long talk followed, and in the end the Hebrew peddler agreed to pay seven dollars and a half, providing Joe would help to carry the goods to the main road, where the wagon had been left. The money was paid over, and by nightfall all of the goods were on the wagon, and Joe was left at the cabin with nothing but the suit on his back. But he had thirty dollars in his pocket, which he counted over with great satisfaction.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ought to be able to get something to do before that is gone,” he told himself. “If I don\u0027t, it will be my own fault.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2981/82199.html","bookId":342,"creation":"Aug 5, 2019 1:30:53 PM","modification":"Aug 5, 2019 1:30:53 PM"}
