{"id":98596,"no":25,"title":"Page 25","content":"\u003cp\u003eShe believed in my father and went to his meetings. He walked out with her in the desert after the storms and kept her company while she found hollows filled with rain and painted with water. He wanted to make things—changes—that would last. She always understood that what she did would fade away.\u003c/p\u003e\n\u003cp\u003eWhen I see Cassia dancing without knowing she’s doing it—turning and turning in delight as she looks at the paintings and carvings in the cave—I understand why my parents both believed as they did.\u003c/p\u003e\n\u003cp\u003eIt’s beautiful and it’s real, but our time together could be as fleeting as snow on the plateau. We can either try to change everything or just make the most of whatever time we have.\u003c/p\u003e\n\u003cp\u003eChapter 26\u003c/p\u003e\n\u003cp\u003eCASSIA\u003c/p\u003e\n\u003cp\u003eKy leaves one flashlight on so that we can see each other while we talk. When Eli and Indie fall asleep, and Ky and I are the only two left, he switches off the light to save it. The girls on the cave walls dance back into darkness and we are truly alone.\u003c/p\u003e\n\u003cp\u003eThe air in the cave feels heavy between us.\u003c/p\u003e\n\u003cp\u003e“One night,” Ky says. In his voice, I hear the Hill. I hear the wind on the Hill, and the brush of branches against our sleeves, and the way he sounded when he first told me he loved me. We have stolen time from the Society before. We can do it again. It will not be as much as we want.\u003c/p\u003e\n\u003cp\u003eI close my eyes and wait.\u003c/p\u003e\n\u003cp\u003eBut he doesn’t go on. “Come with me outside,” he says, and I feel his hand on mine. “We won’t go far.” I can’t see him; but I hear a complicated mix of emotion in his voice and feel it in the way he touches me. Love, concern, and something unusual, something bittersweet.\u003c/p\u003e\n\u003cp\u003eOutside, Ky and I walk down the path a little way. I lean back against the rock and he stands before me, reaching up to put his hand along my neck, under my hair and the collar of my coat. His hand feels rough, cut from carving and climbing, but his touch is gentle and warm. The night wind sings through the canyon and Ky’s body shields me from the cold.\u003c/p\u003e\n\u003cp\u003e“One night . . .” I prompt him again. “What’s the rest of the story?”\u003c/p\u003e\n\u003cp\u003e“It wasn’t a story,” Ky says softly. “I was about to ask you something.”\u003c/p\u003e\n\u003cp\u003e“What?” The two of us draw together under the sky, our breath white and our voices hushed.\u003c/p\u003e\n\u003cp\u003e“One night,” Ky says, “doesn’t seem like too much to ask.”\u003c/p\u003e\n\u003cp\u003eI don’t speak. He moves closer and I feel his cheek against mine and breathe in the scent of sage and pine, of old dust and fresh water and of him.\u003c/p\u003e\n\u003cp\u003e“For one night, can we just think of each other? Not the Society or the Rising or even our families?”\u003c/p\u003e\n\u003cp\u003e“No,” I say.\u003c/p\u003e\n\u003cp\u003e“No what?” He tangles one of his hands in my hair, the other draws me closer still.\u003c/p\u003e\n\u003cp\u003e“No, I don’t think we can,” I say. “And no, it isn’t too much to ask.”\u003c/p\u003e\n\u003cp\u003eChapter 27\u003c/p\u003e\n\u003cp\u003eKY\u003c/p\u003e\n\u003cp\u003eI never named anything I’ve written before\u003c/p\u003e\n\u003cp\u003eno reason to\u003c/p\u003e\n\u003cp\u003esince\u003c/p\u003e\n\u003cp\u003eit would all have the same title anyway\u003c/p\u003e\n\u003cp\u003e—for you—\u003c/p\u003e\n\u003cp\u003ebut I would call this one\u003c/p\u003e\n\u003cp\u003eone night\u003c/p\u003e\n\u003cp\u003ethat night\u003c/p\u003e\n\u003cp\u003ewhen we let the world be only you\u003c/p\u003e\n\u003cp\u003eand only me\u003c/p\u003e\n\u003cp\u003ewe stood on it while it spun\u003c/p\u003e\n\u003cp\u003egreen and blue and red\u003c/p\u003e\n\u003cp\u003ethe music ended\u003c/p\u003e\n\u003cp\u003ebut we\u003c/p\u003e\n\u003cp\u003ewere still\u003c/p\u003e\n\u003cp\u003eChapter 28\u003c/p\u003e\n\u003cp\u003eCASSIA\u003c/p\u003e\n\u003cp\u003eWhen the sun comes into the Carving, we are already on the move again. The path is so narrow that we usually have to walk single file, but Ky stays near me, his hand on the small of my back, our fingers brushing and clinging every chance we get.\u003c/p\u003e\n\u003cp\u003eWe have never had such a thing before—a whole night to talk, to kiss and hold on—and the thought and we never will again keeps coming back to me, will not stay buried where it should, even in the beautiful light of the Carving morning.\u003c/p\u003e\n\u003cp\u003eWhen the others woke, Ky told us what he thought our plan should be: get back to the township by evenfall and try to slip into one of the houses farthest from where he saw the light. Then we’ll keep watch. If there’s still only one light, we can try to approach in the morning. There are four of us and, Ky thinks, only one or two of them.\u003c/p\u003e\n\u003cp\u003eOf course, Eli is so young.\u003c/p\u003e\n\u003cp\u003eI glance back at him. He doesn’t notice. He walks on with his head down. Though I’ve seen him smile, I know the loss of Vick weighs heavily on both of them. “Eli wanted me to say the Tennyson poem over Vick,” Ky told me. “I couldn’t do it.”\u003c/p\u003e\n\u003cp\u003eIn the lead, Indie shifts her pack and looks back at us to make sure we still follow. I wonder what would have happened to her if I had died. Would she have cried for me, or would she have gone through my things, taken what she needed, and moved on?\u003c/p\u003e\n\u003cp\u003eWe steal into the township at dusk, Ky in the lead.\u003c/p\u003e\n\u003cp\u003eI didn’t look closely when we came through before, and now the homes intrigue me as we move quickly down the street. People must have built their own, each house different in some way from the one next to it. And they could walk into each other’s residences, cross each other’s thresholds whenever they wanted. The dirt paths speak of this; unlike the ones in the Borough, the paths here do not go straight from front door to sidewalk. They wind, they web, they interconnect. The people have not been gone long enough for their comings and goings to have been completely erased. I see them there in the dirt. I almost hear their echo in the canyon, the callings-out: hello, good-bye. How are you?\u003c/p\u003e\n\u003cp\u003eThe four of us crowd inside a tiny weathered house with a watermarked door. “I don’t think anyone saw us,” Ky says.\u003c/p\u003e\n\u003cp\u003eI barely hear him. I’m staring at the pictures painted on the walls. The figures were painted with a different hand than the ones in the cave, but again they are beautiful. They have no wings on their backs. They do not look surprised at flight. Their eyes are not turned up to the sky, but instead look down toward the ground, as though they will keep that sight of earth as a memory for higher days.\u003c/p\u003e\n\u003cp\u003eBut still I think I recognize them.\u003c/p\u003e\n\u003cp\u003e“Angels,” I say.\u003c/p\u003e\n\u003cp\u003e“Yes,” Ky says. “Some of the farmers still believed in them. In my father’s time, anyway.”\u003c/p\u003e\n\u003cp\u003eThe dark falls a little deeper and the angels turn into shadows behind us. Then Ky sees it, in the small house across the way. He points out the light to us. “It’s in the same house as the night before.”\u003c/p\u003e\n\u003cp\u003e“I wonder what’s happening inside,” Eli says. “Who do you think is in there? A thief? Do you think they’re robbing the homes?”\u003c/p\u003e\n\u003cp\u003e“No,” Ky says. He glances over at me in the shadowy night. “I think they are home.”\u003c/p\u003e\n\u003cp\u003eKy and I are both at the window at first light, watching, so we are the ones who see the man first.\u003c/p\u003e\n\u003cp\u003eHe comes out of the house, alone, carrying something, and walks through the dust, along the path closer to us, down to a little stand of trees that I noticed when we first came in. Ky motions to all of us to be quiet. Indie and Eli go to the other window in the front of the house and look out, too. We all watch carefully over the edge of the windowsills.\u003c/p\u003e\n\u003cp\u003eThe man stands tall and strong; he’s dark and tanned. He reminds me of Ky in some ways: his coloring, that quiet movement. But there’s a tiredness in him and he seems unaware of anything except what he carries, and in that moment I realize it’s a child.\u003c/p\u003e\n\u003cp\u003eHer dark hair streams over his arms and her dress is white. An Official color, but of course she’s no Official. The dress is lovely, as though she’s going to a Banquet, but she’s much too young.\u003c/p\u003e\n\u003cp\u003eAnd much too still.\u003c/p\u003e\n\u003cp\u003eI put my hand to my mouth.\u003c/p\u003e\n\u003cp\u003eKy glances over at me and nods. His eyes are sad and weary and kind.\u003c/p\u003e\n\u003cp\u003eShe’s dead.\u003c/p\u003e\n\u003cp\u003eI glance over at Eli. Is he all right? Then I remember that he’s seen much more death than this. Maybe he’s even seen a child dead before.\u003c/p\u003e\n\u003cp\u003eBut I never have. Tears fill my eyes. Someone so young, so tiny. How?\u003c/p\u003e\n\u003cp\u003eThe man puts her gently on the ground, in the dead grass under the trees. Something, a sound carried on the canyon wind, reaches our ears. Singing.\u003c/p\u003e\n\u003cp\u003eIt takes a long time to bury someone.\u003c/p\u003e\n\u003cp\u003eWhile the man digs the hole, slowly and steadily, it begins to rain again. It’s not a heavy rain, but a sustained spatter of water against dirt and mud, and I wonder why he brought her out with him. Maybe he wanted her to have rain on her face, one last time.\u003c/p\u003e\n\u003cp\u003eMaybe he just didn’t want to be alone.\u003c/p\u003e\n\u003cp\u003eI can’t stand it anymore. “We have to go help him,” I whisper to Ky, but Ky shakes his head.\u003c/p\u003e\n\u003cp\u003e“No,” he says. “Not yet.”\u003c/p\u003e\n\u003cp\u003eThe man climbs back out of the hole and walks over to the girl. But he doesn’t put her in the grave; he brings her near it and puts her body down.\u003c/p\u003e\n\u003cp\u003eAnd then I notice the blue lines all over his arms.\u003c/p\u003e\n\u003cp\u003eHe reaches down and lifts up the girl’s arm.\u003c/p\u003e\n\u003cp\u003eHe pulls out something. Blue. He marks it on her skin. The rain keeps washing it off and yet he keeps drawing, over and over and over. I can’t tell if he still sings. Finally the rain stops and the blue stays.\u003c/p\u003e\n\u003cp\u003eEli’s not watching anymore. He sits with his back to the wall underneath his window and I crawl over across the floor to sit next to him, not wanting my movement to catch the eye of the man outside. I put my arm around Eli and he slides closer.\u003c/p\u003e\n\u003cp\u003eIndie and Ky keep watching.\u003c/p\u003e\n\u003cp\u003eSo young, I keep thinking. I hear a thump, thump sound and for a moment I can’t tell if it is the beating of my heart or the sound of the dirt as it falls on the little girl in her grave.\u003c/p\u003e\n\u003cp\u003e“I’m going now,” Ky whispers finally. “The rest of you, wait here.”\u003c/p\u003e\n\u003cp\u003eI turn and look at him, surprised. I raise my head so I can see out the window again. The man has finished burying. He lifts a flat gray stone and puts it over the spot now filled in with dirt. I don’t hear singing. “No,” I whisper.\u003c/p\u003e\n\u003cp\u003eKy looks at me, raises his eyebrows.\u003c/p\u003e\n\u003cp\u003e“You can’t,” I say. “Let’s wait until tomorrow. Look at what he’s had to do.”\u003c/p\u003e\n\u003cp\u003eKy’s voice is gentle but firm. “We gave him all the time we could. We have to find out more now.”\u003c/p\u003e\n\u003cp\u003e“And he’s alone,” Indie says. “Vulnerable.”\u003c/p\u003e\n\u003cp\u003eI look at Ky, shocked, but he doesn’t discount what Indie says. “It’s the right time,” he says.\u003c/p\u003e\n\u003cp\u003eBefore I can say more, he opens the door and leaves.\u003c/p\u003e\n\u003cp\u003eChapter 29\u003c/p\u003e\n\u003cp\u003eKY\u003c/p\u003e\n\u003cp\u003eDo what you want,” the man calls out when I reach the edge of the graveyard. “It doesn’t matter. I am the last.”\u003c/p\u003e\n\u003cp\u003eIf I hadn’t already known he was a farmer, his accent and the formality of his speech would have given him away. My father sometimes had a hint of their inflection in his voice when he came back from the canyons.\u003c/p\u003e\n\u003cp\u003eI told the others to stay behind but of course Indie didn’t listen. I hear her coming up behind me and hope that Cassia and Eli had the sense to stay in the house.\u003c/p\u003e\n\u003cp\u003e“Who are you?” the man asks.\u003c/p\u003e\n\u003cp\u003eIndie answers behind me. I don’t turn around. “Aberrations,” she says. “People the Society wants dead.”\u003c/p\u003e\n\u003cp\u003e“We came into the canyons to find the farmers because we thought you might help us,” I say.\u003c/p\u003e\n\u003cp\u003e“We’re done with that,” the man says. “Finished.”\u003c/p\u003e\n\u003cp\u003eFootsteps. Behind us. I want to turn around and call to Cassia and Eli to return to the house but I can’t turn my back on the man.\u003c/p\u003e\n\u003cp\u003e“So there are four of you,” he says. “Any more?” \u003c/p\u003e","sourceLink":"https://allnovel.net/crossed-matched-2/page-25.html","bookId":1644,"creation":"Oct 5, 2019 6:36:01 PM","modification":"Oct 5, 2019 6:36:01 PM"}
