{"id":98603,"no":32,"title":"Page 32","content":"\u003cp\u003eBut even in my version of what should happen I can’t change who we are and the fact that there are others we love.\u003c/p\u003e\n\u003cp\u003eIt didn’t take long for other people to appear in their minds. Bram watched them with sad, waiting eyes. Eli appeared. Their parents walked past, turning their heads for a glimpse of the children they loved.\u003c/p\u003e\n\u003cp\u003eAnd Xander was there, too.\u003c/p\u003e\n\u003cp\u003eBack inside the cave, Eli is awake and searching through the papers with Indie. “We can’t look forever,” he says. His voice sounds panicked. “The Society’s going to find us.”\u003c/p\u003e\n\u003cp\u003e“Just a little longer,” Cassia says. “I’m certain there’s something here.”\u003c/p\u003e\n\u003cp\u003eIndie puts down the book she held and lifts her pack to her shoulder. “I’m going down,” she says. “I’ll look in the houses again, see if there’s anything we missed.” Her eyes meet mine on her way out of the cave and I know Cassia notices.\u003c/p\u003e\n\u003cp\u003e“Do you think they’ve caught Hunter?” Eli asks.\u003c/p\u003e\n\u003cp\u003e“No,” I say. “I think Hunter will finish things on his terms somehow.”\u003c/p\u003e\n\u003cp\u003eEli shivers. “That Cavern—it felt all wrong.”\u003c/p\u003e\n\u003cp\u003e“I know,” I say. Eli rubs his eyes with the heels of his hand and reaches for another book. “You should rest more, Eli,” I tell him. “We’ll keep looking.”\u003c/p\u003e\n\u003cp\u003eEli stares up at the walls around us. “I wonder why they didn’t paint anything in here,” he says.\u003c/p\u003e\n\u003cp\u003e“Eli,” I say more firmly. “Rest.”\u003c/p\u003e\n\u003cp\u003eHe rolls himself back up in a blanket, this time in the corner of the library cave to be near us. Cassia is careful to keep the light of the flashlight away from him. She has twisted her hair back out of her way and her eyes look shadowed with exhaustion.\u003c/p\u003e\n\u003cp\u003e“You should rest too,” I say.\u003c/p\u003e\n\u003cp\u003e“Something is here,” she says. “I have to find it.” She smiles at me. “I felt the same way when I was looking for you. Sometimes I think I’m strongest when I’m searching.”\u003c/p\u003e\n\u003cp\u003eIt’s true. She is. I love that about her.\u003c/p\u003e\n\u003cp\u003eIt’s why I had to lie to her about Xander’s secret. If I hadn’t, she wouldn’t have stopped trying to find out what it was.\u003c/p\u003e\n\u003cp\u003eI stand up. “I’m going to help Indie,” I tell Cassia. It’s time to find out what Indie is hiding.\u003c/p\u003e\n\u003cp\u003e“All right,” Cassia says. She lifts her hand from the book and lets the page she was reading become lost and unmarked. “Be careful.”\u003c/p\u003e\n\u003cp\u003e“I will,” I say. “I’ll be back soon.”\u003c/p\u003e\n\u003cp\u003eIndie’s not hard to find. A flickering light in one of the houses below gives her away, as she knew it would. I make my way down the cliff path, which has grown slippery with the rain.\u003c/p\u003e\n\u003cp\u003eWhen I get to the house I look in the window first. The glass pane is wavy with age and water, but I can see Indie inside. The flashlight sits next to her and in her hands she holds something else that gives off light.\u003c/p\u003e\n\u003cp\u003eA miniport.\u003c/p\u003e\n\u003cp\u003eShe hears me coming. I knock the port out of her hand but my fingers don’t close around it in time. The port hits the ground but doesn’t break. Indie sighs in relief. “Go ahead,” she says. “Look at it if you want.”\u003c/p\u003e\n\u003cp\u003eShe keeps her voice low. In it I hear the sound of wanting something very much. Underneath it I hear the sound of the river in the canyon. Indie reaches out and puts her hand on my arm. It is the first time I have ever seen her willingly touch someone, and it stops me from smashing the miniport against the floorboards.\u003c/p\u003e\n\u003cp\u003eI look at the screen and a familiar face looks back.\u003c/p\u003e\n\u003cp\u003e“Xander,” I say in surprise. “You have a picture of Xander. But how—” It only takes me a moment to realize what happened. “You stole Cassia’s microcard.”\u003c/p\u003e\n\u003cp\u003e“That’s what she helped me hide on the air ship,” Indie says, without a trace of guilt. “She didn’t know. I hid it in with her tablets, and I kept it until I had a way to see what was on it.” She reaches over and switches the port back off.\u003c/p\u003e\n\u003cp\u003e“Is this what you found in the library cave?” I ask her. “The miniport?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “I stole this before we came into the canyons.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“I took it from the leader of the boys in the village the night before we ran. He should have been more careful. All Aberrations know how to steal.”\u003c/p\u003e\n\u003cp\u003eNot all, Indie, I think. Only some of us.\u003c/p\u003e\n\u003cp\u003e“Do they know where we are?” I ask. “Does it transmit location?” Vick and I were never sure what the miniports could do.\u003c/p\u003e\n\u003cp\u003eShe shrugs. “I don’t think so. The Society’s coming anyway, after what happened in the Cavern. But the miniport isn’t what I wanted to show you. I was only passing time until you came.” I start to say something about how she shouldn’t have stolen from Cassia, but then Indie reaches into her pack and pulls out a folded square of a thick fabric. Canvas.\u003c/p\u003e\n\u003cp\u003e“This is what you need to see.” She unfolds the material. It’s a map. “I think it’s the way to the Rising,” she says. “Look.”\u003c/p\u003e\n\u003cp\u003eThe words on the map are encoded, but the landscape is familiar: the edge of the Carving and the plain beyond. Instead of showing the mountains where the farmers went, it shows more of the stream where Vick died, which runs across the plain and down the map. The stream ends in a black inky darkness that has white coded words written across it. “I think that’s the ocean,” Indie says, touching the black space on the map. “And those words mark an island.”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you give it to Cassia?” I ask. “She’s a sorter.”\u003c/p\u003e\n\u003cp\u003e“I wanted to give it to you,” Indie says. “Because of who you are.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” I ask.\u003c/p\u003e\n\u003cp\u003eShe shakes her head impatiently. “I know you can break the code. I know you can sort.”\u003c/p\u003e\n\u003cp\u003eIndie’s right. I can sort. Already I’ve figured out what the white words say: Turn Again Home.\u003c/p\u003e\n\u003cp\u003eIt’s from the Tennyson poem. It’s Rising territory. Home, they’ve called it. And the way to get to it is by following the stream where the Society dropped poison and Vick died.\u003c/p\u003e\n\u003cp\u003e“How do you know I can sort?” I ask Indie, putting down the map and pretending I haven’t decoded it yet.\u003c/p\u003e\n\u003cp\u003e“I’ve been listening,” she says. And then she leans forward. With the two of us sitting in the glow of the flashlight, it seems like the rest of the world has gone black and I’m left alone with her and what she thinks of me. “I know who you are.” She leans even closer. “And who you’re supposed to be.”\u003c/p\u003e\n\u003cp\u003e“Who am I supposed to be?” I ask her. I don’t lean away. She smiles.\u003c/p\u003e\n\u003cp\u003e“The Pilot,” she says.\u003c/p\u003e\n\u003cp\u003eI laugh and sit back. “No. What about that poem you told Cassia? That talks about a woman being the Pilot.”\u003c/p\u003e\n\u003cp\u003e“It’s not a poem,” Indie says fiercely.\u003c/p\u003e\n\u003cp\u003e“A song,” I say, realizing. “The words used to have music behind them.” I should have known.\u003c/p\u003e\n\u003cp\u003eIndie exhales in frustration. “It doesn’t matter how the Pilot comes or if it’s a woman or a man. The idea is the same. I understand that now.”\u003c/p\u003e\n\u003cp\u003e“I’m still not the Pilot.”\u003c/p\u003e\n\u003cp\u003e“You are,” she says. “You don’t want to be, so you’re running away from the Rising. Someone needs to bring you back to the rebellion. That’s what I’m trying to do.”\u003c/p\u003e\n\u003cp\u003e“The Rising isn’t what you imagine,” I say. “It’s not Aberrations and Anomalies and rebels and rogues running free. It’s a structure. A system.”\u003c/p\u003e\n\u003cp\u003eShe shrugs. “Whatever it is, I want to be part of it. I’ve been thinking about it my whole life.”\u003c/p\u003e\n\u003cp\u003e“If you think this will take us to the Rising, why give it to me?” I ask Indie, holding up the map. “Why not give it right to Cassia?”\u003c/p\u003e\n\u003cp\u003e“We’re the same,” she whispers. “You and me. We’re more alike than you and Cassia. We could leave right now.”\u003c/p\u003e\n\u003cp\u003eShe’s right. I do see myself in Indie. I feel a pity so deep for her that it might be something else entirely. Empathy. You have to believe in something to survive. She’s picked the Rising. I chose Cassia.\u003c/p\u003e\n\u003cp\u003eIndie’s been quiet for a long time. Hiding. Running. On the move. I put my hand next to hers. I don’t touch her fingers. But she can see the marks on them. I have scars from living here the first time that no Citizen of the Society would have.\u003c/p\u003e\n\u003cp\u003eShe looks at my hand. “How long?” she asks.\u003c/p\u003e\n\u003cp\u003e“How long what?”\u003c/p\u003e\n\u003cp\u003e“How long have you been an Aberration?”\u003c/p\u003e\n\u003cp\u003e“Since I was a child,” I say. “I was three years old when they Reclassified us.”\u003c/p\u003e\n\u003cp\u003e“And who caused it?”\u003c/p\u003e\n\u003cp\u003eI don’t want to answer but I can tell we’re on the edge. It’s as though she holds to the walls of a canyon. If I move wrong she will look over her shoulder, let go, and take her chances with the fall. I have to give her a little piece of my story.\u003c/p\u003e\n\u003cp\u003e“My father,” I answer. “We were Citizens in the Society. We lived in one of the Border Provinces. Then the Society accused him of having ties with a rebellion and sent us all out to the Outer Provinces.”\u003c/p\u003e\n\u003cp\u003e“Was he a rebel?” she asks.\u003c/p\u003e\n\u003cp\u003e“Yes,” I say. “And then when we moved to the Outer Provinces he convinced our village to join with him. Almost everyone died.”\u003c/p\u003e\n\u003cp\u003e“You still love him, though,” she says.\u003c/p\u003e\n\u003cp\u003eI’m on the edge with her now. She knows it. I have to tell the truth if I’m going to keep her hanging on.\u003c/p\u003e\n\u003cp\u003eI take a deep breath. “Of course I do.”\u003c/p\u003e\n\u003cp\u003eI said it.\u003c/p\u003e\n\u003cp\u003eHer hand rests on the ground next to me against the splintered floorboards. The rain outside the window falls in gold and silver dashes in the beam from my flashlight. Without thinking I touch her fingers gently.\u003c/p\u003e\n\u003cp\u003e“Indie,” I tell her, “I’m not the Pilot.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. She doesn’t believe me. “Just read the map,” she tells me. “Then you’ll know everything.”\u003c/p\u003e\n\u003cp\u003e“No,” I say. “I won’t know everything. I won’t know your story.” This is a cruel thing to do because when someone knows your story they know you. And they can hurt you. It’s why I give mine away in pieces, even to Cassia. “If I’m going to go with you, I have to know about you.” I’m lying. I won’t go with her to the Rising, no matter what. Does she know that?\u003c/p\u003e\n\u003cp\u003e“It all started when you ran,” I say, encouraging her.\u003c/p\u003e\n\u003cp\u003eShe looks at me, deciding. Suddenly—even though she is so sharp-edged—I want to reach out and hold her close. Not the way I hold Cassia. Just as someone who also knows what it means to be an Aberration.\u003c/p\u003e\n\u003cp\u003e“It all started when I ran,” she says.\u003c/p\u003e\n\u003cp\u003eI lean closer to listen. Indie speaks more softly than usual as she remembers. “I wanted to escape the work camp. When they dragged me back to the air ship I thought I’d lost my last chance to get away. I knew we’d die in the Outer Provinces. Then I saw Cassia on the ship. She didn’t belong there, or in the camp either. I’d been through her things and I knew that she wasn’t an Aberration.\u003c/p\u003e\n\u003cp\u003e“So why did she sneak on board the ship? What did she think she could find?” Indie looks straight into my eyes while she talks, and I can see she tells the truth. For the first time she’s completely open. She’s beautiful when she’s not holding back. \u003c/p\u003e","sourceLink":"https://allnovel.net/crossed-matched-2/page-32.html","bookId":1644,"creation":"Oct 5, 2019 6:36:01 PM","modification":"Oct 5, 2019 6:36:01 PM"}
