{"id":98605,"no":34,"title":"Page 34","content":"\u003cp\u003eOne novel, Ray Bradbury, third printing, for one datapod and four panes of glass from a Restoration site. Trader fee: two panes of glass.\u003c/p\u003e\n\u003cp\u003eOne page of the Book, for three vials medicine. Trader fee: nothing. Trader was executing a personal trade on his own behalf.\u003c/p\u003e\n\u003cp\u003eSo this is how the trades were done and why so many of the books here are torn, the pages loose. The farmers put books back together, but they also had to take them apart, determine their worth, trade them away in bits and pieces. The thought makes me sad, though of course it was what they had to do.\u003c/p\u003e\n\u003cp\u003eIt’s like what the Archivists do, and what I did when I kept the tablets and traded the compass.\u003c/p\u003e\n\u003cp\u003eThe tablets. Xander’s notes. Did he hide something secret inside? I tear into the packet and put the contents out on the table in two rows: one of blue tablets, one of scraps.\u003c/p\u003e\n\u003cp\u003eNone of the papers say anything about a secret.\u003c/p\u003e\n\u003cp\u003ePredicted occupations: Official.\u003c/p\u003e\n\u003cp\u003ePredicted chance of success: 99.9%.\u003c/p\u003e\n\u003cp\u003ePredicted life span: 80 years.\u003c/p\u003e\n\u003cp\u003eLine after line of information I already know or could have guessed.\u003c/p\u003e\n\u003cp\u003eI feel eyes on me. Someone stands in the door of the cave. I look up, shine my light across the sandy floor, begin to push the tablets and scraps into my bag. “Ky,” I begin. “I was just—”\u003c/p\u003e\n\u003cp\u003eThe figure is too tall to be Ky. Frightened, I move the light up to his face and he shields his eyes with his hands. Dried blood runs down his blue-marked arms.\u003c/p\u003e\n\u003cp\u003e“Hunter,” I say. “You came back.”\u003c/p\u003e\n\u003cp\u003e“I wanted to escape,” Hunter says.\u003c/p\u003e\n\u003cp\u003eAt first I think he means from the Cavern, and then I realize he’s answering the question Indie asked before we climbed—Which did you want?\u003c/p\u003e\n\u003cp\u003e“But you couldn’t go,” I say, realizing. The papers left on the table in front of me flutter as he comes closer. “Because of Sarah.”\u003c/p\u003e\n\u003cp\u003e“She was dying,” Hunter said. “She couldn’t be moved.”\u003c/p\u003e\n\u003cp\u003e“The others wouldn’t wait for you?” I ask, shocked.\u003c/p\u003e\n\u003cp\u003e“There wasn’t time,” Hunter says. “It could have compromised the whole escape. Others who weren’t fast enough to cross decided to fight, but she was a child, and she was far too ill.” A muscle in his cheek twitches and when he blinks tears run down his face. He ignores them. “I made an agreement with the others who stayed. I helped them rig their explosives up on the Carving, and they let me leave to be with Sarah instead of waiting for the fight.” He shakes his head. “I don’t know why it didn’t work. The ships should have come down.”\u003c/p\u003e\n\u003cp\u003eI don’t know what to say. He’s lost his daughter and everyone he knew. “You can still go find the others on the plain,” I say. “It’s not too late.”\u003c/p\u003e\n\u003cp\u003e“I came back because there’s something I promised to do,” he says. “I forgot myself in the Cavern.” He walks over to one of the long flat boxes on the table and lifts off the lid. “While I’m here, I can show you how to find the rebellion.”\u003c/p\u003e\n\u003cp\u003eMy fingers tingle in anticipation and I leave the poem behind on the table. At last. Someone who knows something real about the Rising. “Thank you,” I say. “Will you come with us?” I can’t bear to think of him alone.\u003c/p\u003e\n\u003cp\u003eHunter looks up from the box. “There used to be a map here,” he says. “Someone’s taken it.”\u003c/p\u003e\n\u003cp\u003e“Indie,” I say. It must be. “She left a little while ago. I don’t know where she went.”\u003c/p\u003e\n\u003cp\u003e“There’s a light in one of the houses,” Hunter says.\u003c/p\u003e\n\u003cp\u003e“I’ll come with you,” I say, darting a glance over at where Eli sleeps in the corner of the cave.\u003c/p\u003e\n\u003cp\u003e“He’ll be safe,” Hunter says. “The Society isn’t here yet.”\u003c/p\u003e\n\u003cp\u003eI follow him out of the cave and down the rain-slicked path, eager to find Indie and take back what she’s hidden from us.\u003c/p\u003e\n\u003cp\u003eBut when we open the door to the little lit house, it’s Ky we see, firelight flickering on his face as he burns the map of where I wanted to go.\u003c/p\u003e\n\u003cp\u003eChapter 39\u003c/p\u003e\n\u003cp\u003eKY\u003c/p\u003e\n\u003cp\u003eI see Cassia first, and then Hunter behind her, and I know I’ve lost. Even if the map burns, Hunter can tell her where to find the Rising.\u003c/p\u003e\n\u003cp\u003eShe snatches the map from me and throws it to the ground, stomping on it to put out the flames. The edges crumple into fragments of black ash but most of the map is saved.\u003c/p\u003e\n\u003cp\u003eShe’s going to the Rising.\u003c/p\u003e\n\u003cp\u003e“You were going to keep this from me,” Cassia says. “If Hunter hadn’t come back, I would never have known how to find the rebellion.”\u003c/p\u003e\n\u003cp\u003eI don’t answer. There’s nothing to say.\u003c/p\u003e\n\u003cp\u003e“What else are you hiding?” Cassia asks me, her voice breaking. She picks up the map and holds it in her hands. Carefully. The way she used to hold poetry on the Hill. “You lied about Xander’s secret, didn’t you? What is it?”\u003c/p\u003e\n\u003cp\u003e“I can’t tell you.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“It’s not mine to tell,” I say. “It’s his.” It’s not just selfishness that keeps me from telling Cassia Xander’s secret. I know he wanted to tell her himself. I owe him that. He knew my secret—my status as an Aberration—and he never told anyone. Not even Cassia.\u003c/p\u003e\n\u003cp\u003eThis isn’t a game. He’s not my opponent and Cassia’s not a prize.\u003c/p\u003e\n\u003cp\u003e“But this, on here,” Cassia says, looking at the map, “is a choice. You were going to get rid of my—our—chance to choose.”\u003c/p\u003e\n\u003cp\u003eThe air in the house smells acrid and bitter from the burning cloth. I see with a chill that Cassia looks at me as a sorter would. Sifting facts. Calculating. Making a call. I know what she sees—the boy on the screen with the Society’s list scrolling up next to him. Not the one who stood with her on the Hill or the one who held her in the dark of the canyon with the moon above.\u003c/p\u003e\n\u003cp\u003e“Where’s Indie?” she asks.\u003c/p\u003e\n\u003cp\u003e“She went outside,” I say.\u003c/p\u003e\n\u003cp\u003e“I’ll find her,” Hunter says, and he disappears through the door and Cassia and I are alone.\u003c/p\u003e\n\u003cp\u003e“Ky,” she says, “this is the Rising.” A trace of excitement comes into her voice. “Don’t you want to be a part of something that could change everything?”\u003c/p\u003e\n\u003cp\u003e“No,” I say, and she steps back as if I’ve struck her physically.\u003c/p\u003e\n\u003cp\u003e“But we can’t run forever,” Cassia says.\u003c/p\u003e\n\u003cp\u003e“I’ve spent years holding still,” I say. “What do you think I was doing back in the Society?” Then my words come out in a rush and I can’t seem to stop. “You’re in love with the idea of the Rising, Cassia. But you don’t actually know what it is. You don’t know what it’s like to try to rebel and see everyone die around you. You don’t know.”\u003c/p\u003e\n\u003cp\u003e“You hate the Society,” Cassia says. Still trying to do the math, make the numbers add up. “But you don’t want to be part of the Rising.”\u003c/p\u003e\n\u003cp\u003e“I don’t trust the Society, and I don’t trust rebellions,” I say. “I don’t choose either of them. I’ve seen what they both can do.”\u003c/p\u003e\n\u003cp\u003e“Then what else is there?” she asks.\u003c/p\u003e\n\u003cp\u003e“We could join the farmers,” I say.\u003c/p\u003e\n\u003cp\u003eBut I don’t think she even hears me.\u003c/p\u003e\n\u003cp\u003e“Tell me why,” she says. “Why would you want to lie to me? Why would you take a choice from me?”\u003c/p\u003e\n\u003cp\u003eHer gaze has softened and she’s looking at me as Ky again—the person she loves—and somehow that’s even worse. All the reasons I lied run through my head: because I can’t lose you, because I was jealous, because I don’t trust anyone, because I can’t even trust myself, because, because, because.\u003c/p\u003e\n\u003cp\u003e“You know why,” I say, anger flaring in me suddenly. At everything. Everyone. The Society, the Rising, my father, myself, Indie, Xander, Cassia.\u003c/p\u003e\n\u003cp\u003e“No, I don’t,” she begins, but I don’t let her finish.\u003c/p\u003e\n\u003cp\u003e“Fear,” I say, holding her gaze. “We were both afraid. I was afraid of losing you. You were afraid, back in the Borough. When you took my choice away from me.”\u003c/p\u003e\n\u003cp\u003eShe steps back. I see it on her face that she knows what I’m talking about. She hasn’t forgotten it either.\u003c/p\u003e\n\u003cp\u003eSuddenly I’m back in that hot, shiny room with red hands and a blue uniform. Sweat runs down my back. I’m humiliated. I don’t want her to see me work. I wish that I could look up to catch a flash of her green eyes and let her know that I am still Ky. Not just another number.\u003c/p\u003e\n\u003cp\u003e“You sorted me,” I say.\u003c/p\u003e\n\u003cp\u003e“What else could I do?” she whispers. “They were watching.”\u003c/p\u003e\n\u003cp\u003eWe’ve talked this through on the Hill but it seems different down in the canyons. It feels clear to me here that I will never reach her.\u003c/p\u003e\n\u003cp\u003e“I tried to fix it,” she says. “I came all this way to find you.”\u003c/p\u003e\n\u003cp\u003e“To find me, or to find the Rising?” I ask.\u003c/p\u003e\n\u003cp\u003e“Ky,” she says. And stops.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I tell Cassia. “This is the one thing I can’t do for you. I can’t join the Rising.”\u003c/p\u003e\n\u003cp\u003eI’ve said it.\u003c/p\u003e\n\u003cp\u003eHer face looks pale in the darkness of the abandoned house. Somewhere above us the sky seeps rain and I think of snow falling. Pictures painted with water. Poetry breathed between kisses. Too beautiful to last.\u003c/p\u003e\n\u003cp\u003eChapter 40\u003c/p\u003e\n\u003cp\u003eCASSIA\u003c/p\u003e\n\u003cp\u003eHunter pushes open the door behind us and walks in. Indie is with him. “We don’t have time for this,” he says. “There is a Rising. You can find it by following that map. Can you read the code?”\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“Then the map is yours for telling me what was in the cave.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” I say. I roll it up carefully. The map is made of thick cloth and dark paints. You could use it in the rain and drop it in the water and it would last. But it can’t hold up against fire. I look over at Ky, my heart aching, wishing we could bridge the river of what just happened as neatly as one could mark a crossing on a map.\u003c/p\u003e\n\u003cp\u003e“I’m leaving for the mountains to find the others,” Hunter says. “Those of you who don’t want to join the Rising can come with me.”\u003c/p\u003e\n\u003cp\u003e“I want to find the Rising,” Indie says.\u003c/p\u003e\n\u003cp\u003e“We can all go as far as the plain together, at least,” I say. We can’t come such a long way only to break apart so quickly.\u003c/p\u003e\n\u003cp\u003e“You should all start now,” Hunter says. “I’ll catch up to you when I’m finished blocking the cave.”\u003c/p\u003e\n\u003cp\u003e“Blocking the cave?” Indie asks.\u003c/p\u003e\n\u003cp\u003e“We made a plan to seal off the cave and make it look like a landslide,” Hunter says. “We don’t want the Society to get our papers. I promised the other farmers I’d do it. But it will take me some time to prepare everything. You shouldn’t wait.”\u003c/p\u003e\n\u003cp\u003e“No,” I say. “We can wait.” We can’t leave Hunter behind again. And though I know our group—our small, fragmented little group that has somehow come together—must splinter eventually, I don’t want it to happen now.\u003c/p\u003e\n\u003cp\u003e“So that’s why you saved some of the explosives,” Ky says to Hunter. I can’t read Ky’s expression—his face is closed-off, remote. This is the Ky of the Society again and I feel a sudden ache of loss at the Ky of the Carving. “I can help you.” \u003c/p\u003e","sourceLink":"https://allnovel.net/crossed-matched-2/page-34.html","bookId":1644,"creation":"Oct 5, 2019 6:36:02 PM","modification":"Oct 5, 2019 6:36:02 PM"}
