{"id":98575,"no":4,"title":"Page 4","content":"\u003cp\u003eThe man continues. “Floods sometimes occurred in Tana pre-Society, but that has been controlled for many years now. We are one of the most productive farming Provinces in the Society.”\u003c/p\u003e\n\u003cp\u003eI don’t look back at Xander. Or the Official. Just at the map in front of me. I tried to trade before and it didn’t work then either. But the first time it was because I couldn’t bring myself to give away the poem Ky and I shared.\u003c/p\u003e\n\u003cp\u003eThen I notice that the man has stopped speaking. He looks at me directly. “Is there anything else?” he asks.\u003c/p\u003e\n\u003cp\u003eI should give up. Should smile and turn away to Xander and forget about this, accept that the man knows nothing and move on. But for some reason I think suddenly of one of those last red leaves holding on against the sky. I breathe. It falls.\u003c/p\u003e\n\u003cp\u003e“Yes,” I say softly.\u003c/p\u003e\n\u003cp\u003eGrandfather gave me two poems. Ky and I loved the Thomas one, but there were other words, too, and those are the ones that come to me now. I don’t remember all of it, that poem by Tennyson, but one stanza comes back to me clear in my mind as though it were written there all along. Perhaps it was the man’s mention of flooding that brought it back:“For tho’ from out our bourne of Time and Place\u003c/p\u003e\n\u003cp\u003eThe flood may bear me far,\u003c/p\u003e\n\u003cp\u003eI hope to see my Pilot face to face\u003c/p\u003e\n\u003cp\u003eWhen I have crossed the bar.”\u003c/p\u003e\n\u003cp\u003eAs I speak the words quietly, the man’s face changes. He becomes clever, alert, alive. I must have remembered correctly. “That’s an interesting poem,” he says. “Not, I think, one of the Hundred.”\u003c/p\u003e\n\u003cp\u003e“No,” I say. My hands tremble and I dare to hope again. “But still worth something.”\u003c/p\u003e\n\u003cp\u003e“I’m afraid not,” he says. “Unless you have the original.”\u003c/p\u003e\n\u003cp\u003e“No,” I say. “It was destroyed.” I destroyed it. I remember that moment at the Restoration site and how the paper fluttered up before it went down to burn.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” he says, and it sounds as though he is. “What is it you were hoping to trade for?” he asks, a hint of curiosity in his voice.\u003c/p\u003e\n\u003cp\u003eI point to the Outer Provinces. If I can just get to them, there’s a slim but real chance I can find Ky. “I know they’re taking the Aberrations there,” I say softly. “But I want to know exactly where and how I can get there. A map.”\u003c/p\u003e\n\u003cp\u003eHe shakes his head at me. No.\u003c/p\u003e\n\u003cp\u003eHe can’t tell me? Or he won’t? “I have something else,” I say.\u003c/p\u003e\n\u003cp\u003eI angle my back so that neither Xander nor the Official can see my hands; I reach into the bag. My fingers brush the foil of the tablets and the hard surface of the compass at the same time and I stop.\u003c/p\u003e\n\u003cp\u003eWhich should I trade?\u003c/p\u003e\n\u003cp\u003eSuddenly I’m dizzy, confused, remembering the time I had to sort Ky. The steam in the room, the sweat, the ache of the decision pressing against me . . .\u003c/p\u003e\n\u003cp\u003eStay clear, I tell myself. I glance over my shoulder at Xander and meet the blue of his eyes for one brief moment before he turns back to the Official. I remember Ky looking down at me from the air-train platform before they took him away and feel again the panic of time running out.\u003c/p\u003e\n\u003cp\u003eI make up my mind and reach into the bag, pulling out the item for trade. I hold it up just high enough for the man to see, trying to keep my hands from shaking and attempting to convince myself that I can give this up.\u003c/p\u003e\n\u003cp\u003eHe smiles and nods at me. “Yes,” he says. “That is worth something. But what you want would take days—weeks—to arrange.”\u003c/p\u003e\n\u003cp\u003e“I only have tonight,” I say.\u003c/p\u003e\n\u003cp\u003eBefore I can say anything more, the man takes the offering and leaves my hand empty. “Where are you going next?”\u003c/p\u003e\n\u003cp\u003e“The music hall,” I say.\u003c/p\u003e\n\u003cp\u003e“Check under your seat when you leave,” he whispers. “I will do the best I can.” Above us, the lights dim. His eyes do, too, and then, in the flat voice he first used he tells me, “We’re closing. You all need to go.”\u003c/p\u003e\n\u003cp\u003eXander leans over during the music. “Did you get what you needed?” he asks, his voice deep and low and his breath brushing my neck. On his other side, the Official stares ahead. He taps his fingers on the armrest of his chair, keeping time to the music.\u003c/p\u003e\n\u003cp\u003e“I don’t know yet,” I tell him. The Archivist said to look under my seat when I left, not before, but I am still tempted to try earlier. “Thank you for helping me.”\u003c/p\u003e\n\u003cp\u003e“It’s what I do,” Xander says.\u003c/p\u003e\n\u003cp\u003e“I know it is,” I say. I remember the gifts he gave me: the painting, the blue tablets neatly rowed in their compartments. Even the compass, I realize, my gift from Ky, was something Xander saved for me once, on that day back in the Borough when they took the artifacts.\u003c/p\u003e\n\u003cp\u003e“But you don’t know everything about me,” Xander says. A mischievous grin crosses his face.\u003c/p\u003e\n\u003cp\u003eI glance down at his hand around mine, his thumb brushing across my skin, and then I look back up into his eyes. Though he still smiles there’s something serious about his expression now. “No,” I agree. “I don’t.”\u003c/p\u003e\n\u003cp\u003eWe hold on to each other. The Society’s music plays around and over us, but our thoughts are always our own.\u003c/p\u003e\n\u003cp\u003eWhen I stand up, I brush my hand underneath the chair. Something’s there—a folded square of paper—and it comes away easily when I tug on it. Though I want to look now, I slip it into my pocket instead, wondering what I have, what I’ve traded for.\u003c/p\u003e\n\u003cp\u003eThe Official walks us back to the main hall of the camp. When we go inside, he glances around the hall, at the long tables and the single hulking port, and when he looks back at me there’s an expression in his eyes that I think might be pity. I lift my chin.\u003c/p\u003e\n\u003cp\u003e“You have ten minutes to say good-bye,” the Official tells us. His voice, now that we are back in the camp, sounds sharper than it did before. He pulls out his datapod and nods to the Officer waiting to take me back to my cabin.\u003c/p\u003e\n\u003cp\u003eXander and I both take a deep breath at the same time and then we laugh together. I like the sound of it, our laughter echoing around the almost empty hall. “What was he looking at for so long?” I ask Xander, nodding toward the Official.\u003c/p\u003e\n\u003cp\u003e“A display on the history of Matching,” Xander says quietly. He looks at me as though there’s some meaning there I should understand, but I don’t. I wasn’t paying close enough attention to the Official.\u003c/p\u003e\n\u003cp\u003e“Nine minutes,” he says without looking up.\u003c/p\u003e\n\u003cp\u003e“I still can’t believe they let you come,” I tell Xander. “I’m so glad they did.”\u003c/p\u003e\n\u003cp\u003e“The timing was optimal,” Xander says. “I’m leaving Oria. I’m only passing through Tana on my way to Camas Province.”\u003c/p\u003e\n\u003cp\u003e“What?” I blink in surprise. Camas is one of the Border Provinces, right along the edge of the Outer Provinces. I feel strangely untethered. Much as I love looking at the stars, I never learned to guide by them. I mark my course by people: Xander, a point on the map; my parents, another point; Ky, the final destination. When Xander moves, the geography of everything changes.\u003c/p\u003e\n\u003cp\u003e“I have my final work position,” Xander says. “It’s in Central. Like yours. But they want me to have experience in the Border Provinces first.”\u003c/p\u003e\n\u003cp\u003e“Why?” I ask him softly.\u003c/p\u003e\n\u003cp\u003eXander’s tone is sober. “There are things I need to learn there for my work assignment that I can’t learn anywhere else.”\u003c/p\u003e\n\u003cp\u003e“And then to Central,” I say. The idea of Xander in Central feels right and final. Of course he would belong in the capital of the Society. Of course they would see his potential and bring him there. “You’re really leaving.”\u003c/p\u003e\n\u003cp\u003eAn expression of what looks like anger flashes momentarily across his face. “Do you have any idea what it’s like being left?”\u003c/p\u003e\n\u003cp\u003e“Of course I do,” I say, stung.\u003c/p\u003e\n\u003cp\u003e“No,” he says. “Not the way Ky left you. He didn’t want to go. Do you know what it’s like for someone to choose to leave you?”\u003c/p\u003e\n\u003cp\u003e“I didn’t choose to leave you behind. We were Relocated.”\u003c/p\u003e\n\u003cp\u003eXander exhales. “You still don’t understand,” he says. “You left me before you left Oria.” He glances over at the Official and then back at me, his blue eyes serious. He’s changed, since I’ve seen him, become harder. More careful.\u003c/p\u003e\n\u003cp\u003eMore like Ky.\u003c/p\u003e\n\u003cp\u003eI know what he means now about my leaving. For Xander, I began to leave when I chose Ky.\u003c/p\u003e\n\u003cp\u003eXander looks down at our hands, still clasped together.\u003c/p\u003e\n\u003cp\u003eMy gaze follows his. His hand is strong, the knuckles rough. He can’t write with his hands, but they are quick and sure over the cards and in the games. This physical contact, though not with Ky, is still with someone I love. I hold on as if I won’t ever let go, and part of me doesn’t want to.\u003c/p\u003e\n\u003cp\u003eThe air in the main hall feels cool and I shiver. Would you call this season late fall? Early winter? I can’t tell. The Society, with their extra crops, has blurred the line between seasons, between when you can plant and harvest and when you must let things lie. Xander takes his hands away and leans forward, looking at me deep. I catch myself gazing at his mouth, remembering our kiss back in the Borough, that sweet innocent kiss before everything changed. I think Xander and I would kiss differently now.\u003c/p\u003e\n\u003cp\u003eIn a whisper that brushes along my collarbone, Xander asks, “Are you still going to the Outer Provinces to find him?”\u003c/p\u003e\n\u003cp\u003e“ Yes,” I whisper.\u003c/p\u003e\n\u003cp\u003eThe Official calls out the time. Only a few minutes left. Xander forces a smile, tries to speak lightly. “You really want this? You want Ky, whatever the cost?” I can almost imagine the words the Official taps into the datapod as he watches us now: Female Matchee expressed some agitation, soon after the male Matchee told her about his field assignment in Camas. Male was able to console her.\u003c/p\u003e\n\u003cp\u003e“No,” I say. “Not at any cost.”\u003c/p\u003e\n\u003cp\u003eXander draws in his breath sharply. “So where do you draw the line? What won’t you give up?”\u003c/p\u003e\n\u003cp\u003eI swallow. “My family.”\u003c/p\u003e\n\u003cp\u003e“But you don’t mind giving me up,” he says. His jaw tightens and he looks away. Look back, I think. Don’t you know that I love you, too? That you have been my friend for years? That I still feel Matched to you in some ways?\u003c/p\u003e\n\u003cp\u003e“I’m not,” I say softly. “I’m not giving you up. Look.” And then I risk it. I pull open the bag and show him what’s still inside, what I kept. The blue tablets. Though he gave them to me to find Ky, they are still Xander’s gift.\u003c/p\u003e\n\u003cp\u003eXander’s eyes widen. “You traded Ky’s compass?”\u003c/p\u003e\n\u003cp\u003e“Yes,” I say.\u003c/p\u003e\n\u003cp\u003eXander smiles and in the expression I see surprise and cunning and happiness all mingled there together. I’ve surprised Xander—and myself. I love Xander in ways that are perhaps more complicated than I first expected.\u003c/p\u003e\n\u003cp\u003eBut it’s Ky I have to find.\u003c/p\u003e\n\u003cp\u003e“It’s time,” the Official calls. The Officer looks in my direction.\u003c/p\u003e\n\u003cp\u003e“Good-bye,” I tell Xander, my voice catching.\u003c/p\u003e\n\u003cp\u003e“I don’t think so,” he says, and he leans down to kiss me the way I kissed him earlier, right near my mouth. If either of us moved a little, everything would change.\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eKY\u003c/p\u003e\n\u003cp\u003eVick and I lift one of the bodies and carry it toward a grave. I recite the words I say over all of the dead now:“For tho’ from out our bourne of Time and Place \u003c/p\u003e","sourceLink":"https://allnovel.net/crossed-matched-2/page-4.html","bookId":1644,"creation":"Oct 5, 2019 6:36:01 PM","modification":"Oct 5, 2019 6:36:01 PM"}
