{"id":70064,"no":38,"title":"Page 38","content":"\u003cp\u003eGRACE WATCHED HER LIFE FLASH BEFORE her eyes. Was this a dream? Or a nightmare? Part of her wanted to touch Lenny, to stick her hands in his sides like a doubting Thomas and prove that he was real. But something made her hesitate.\u003c/p\u003e\n\u003cp\u003e\"I saw you! I saw your body.\" She was shaking. \"I went to the morgue, for God\u0027s sake.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you put down the gun?\" Lenny\u0027s voice sounded soothing. Hypnotic. \"We can talk.\"\u003c/p\u003e\n\u003cp\u003eGrace was about to do as he asked when John Merrivale took a step toward her. Instinctively she swung the gun in his direction and stepped back, her finger hovering over the trigger. \"Don\u0027t move!\" she shouted.\u003c/p\u003e\n\u003cp\u003eJohn stepped back.\u003c/p\u003e\n\u003cp\u003e\"Sit down on that chair. Put your hands where I can see them.\"\u003c/p\u003e\n\u003cp\u003eJohn did as he was asked, sinking down into the lawn chair beside Lenny\u0027s.\u003c/p\u003e\n\u003cp\u003eGrace looked at Lenny. \"You, too.\"\u003c/p\u003e\n\u003cp\u003eLenny raised an eyebrow, in admiration as much as surprise. He, too, put his hands on his lap. Keeping the pistol trained on the pair of them, Grace reached into her backpack and pulled out the Dictaphone. She pressed the record button and set it down on the ground between them.\u003c/p\u003e\n\u003cp\u003e\"Talk,\" she commanded.\u003c/p\u003e\n\u003cp\u003eLenny couldn\u0027t take his eyes off Grace\u0027s face. So beautiful. But she\u0027s changed. I suppose she had to. She\u0027s stronger. That sweet, trusting little girl could not have survived.\u003c/p\u003e\n\u003cp\u003e\"What do you want to know?\"\u003c/p\u003e\n\u003cp\u003e\"Everything. I want to know everything, Lenny. I want to know the truth.\"\u003c/p\u003e\n\u003cp\u003eLenny Brookstein started talking. \u003c/p\u003e","sourceLink":"https://allnovel.net/after-the-darkness/page-38.html","bookId":2373,"creation":"Oct 5, 2019 10:15:31 AM","modification":"Oct 5, 2019 10:15:31 AM"}
