{"id":31434,"no":16,"title":"One Interne","content":"The Saturday Evening Post (5 November, 1932)\n\u003cbr\u003e \n\u003cbr\u003e Traditionally, the Coccidian Club show is given on the hottest night of spring, and that year was no exception. Two hundred doctors and students sweltered in the reception rooms of the old narrow house and another two hundred students pressed in at the doors, effectually sealing out any breezes from the Maryland night. The entertainment reached these latter clients only dimly, but refreshment was relayed back to them by a busy bucket brigade. Down cellar, the janitor made his annual guess that the sagging floors would hold up one more time.\n\u003cbr\u003e \n\u003cbr\u003e Bill Tulliver was the coolest man in the hall. For no special reason he wore a light tunic and carried a crook during the only number in which he took part, the rendition of the witty, scurrilous and interminable song which described the failings and eccentricities of the medical faculty. He sat in comparative comfort on the platform and looked out over the hot sea of faces. The most important doctors were in front — Doctor Ruff, the ophthalmologist; Doctor Lane, the brain surgeon; Doctor Georgi, the stomach specialist; Doctor Barnett, the alchemist of internal medicine; and on the end of the row, with his saintlike face undisturbed by the rivulets of perspiration that poured down the long dome of his head, Doctor Norton, the diagnostician.\n\u003cbr\u003e \n\u003cbr\u003e Like most young men who had sat under Norton, Bill Tulliver followed him with the intuition of the belly, but with a difference. He knelt to him selfishly as a sort of great giver of life. He wanted less to win his approval than to compel it. Engrossed in his own career, which would begin in earnest when he entered the hospital as an interne in July, his whole life was pointed toward the day when his own guess would be right and Doctor Norton’s would be wrong. In that moment he would emancipate himself — he need not base himself on the adding machine-calculating machine-probability machine-St. Francis of Assisi machine any longer.\n\u003cbr\u003e \n\u003cbr\u003e Bill Tulliver had not arrived unprovoked at this pitch of egotism. He was the fifth in an unbroken series of Dr. William Tullivers who had practised with distinction in the city. His father died last winter; it was not unnatural that even from the womb of school this last scion of a medical tradition should clamor for “self-expression.”\n\u003cbr\u003e \n\u003cbr\u003e The faculty song, immemorially popular, went on and on. There was a verse about the sanguinary Doctor Lane, about the new names Doctor Brune made up for the new diseases he invented, about the personal idiosyncrasies of Doctor Schwartze and the domestic embroilments of Doctor Gillespie. Doctor Norton, as one of the most popular men on the staff, got off easy. There were some new verses — several that Bill had written himself:\n\u003cbr\u003e \n\u003cbr\u003e “Herpes Zigler, sad and tired,\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp; Will flunk you out or kill ya,\n\u003cbr\u003e \n\u003cbr\u003e If you forget Alfonso wired\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp; For dope on h?mophilia.\n\u003cbr\u003e \n\u003cbr\u003e Bum tiddy-bum-bum,\n\u003cbr\u003e \n\u003cbr\u003e Tiddy-bum-bum.\n\u003cbr\u003e \n\u003cbr\u003e Three thousand years ago,\n\u003cbr\u003e \n\u003cbr\u003e Three thousand years ago.”\n\u003cbr\u003e \n\u003cbr\u003e He watched Doctor Zigler and saw the wince that puckered up under the laugh. Bill wondered how soon there would be a verse about him, Bill Tulliver, and he tentatively composed one as the chorus thundered on.\n\u003cbr\u003e \n\u003cbr\u003e After the show the older men departed, the floors were sloshed with beer and the traditional roughhouse usurped the evening. But Bill had fallen solemn and, donning his linen suit, he watched for ten minutes and then left the hot hall. There was a group on the front steps, breathing the sparse air, and another group singing around the lamp-post at the corner. Across the street arose the great bulk of the hospital about which his life revolved. Between the Michael’s Clinic and the Ward’s Dispensary arose a round full moon.\n\u003cbr\u003e \n\u003cbr\u003e The girl — she was hurrying — reached the loiterers at the lamppost at the same moment as Bill. She wore a dark dress and a dark, flopping hat, but Bill got an impression that there was a gayety of cut, if not of color, about her clothes. The whole thing happened in less than a minute; the man turning about — Bill saw that he was not a member of the grand confraternity — and was simply hurling himself into her arms, like a child at its mother.\n\u003cbr\u003e \n\u003cbr\u003e The girl staggered backward with a frightened cry; and everyone in the group acted at once.\n\u003cbr\u003e \n\u003cbr\u003e “Are you sure you’re all right?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, yes,” she gasped. “I think he just passed out and didn’t realize he was grabbing at a girl.”\n\u003cbr\u003e \n\u003cbr\u003e “We’ll take him over to the emergency ward and see if he can swallow a stomach pump.”\n\u003cbr\u003e \n\u003cbr\u003e Bill Tulliver found himself walking along beside the girl.\n\u003cbr\u003e \n\u003cbr\u003e “Are you sure you’re all right?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, yes.” She was still breathing hard; her bosom rose, putting out its eternal promises, as if the breath she had taken in were the last breather left in the world.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, catch it — oh, catch it and take it — oh, catch it,” she sighed. “I realized right away that they were students. I shouldn’t have gone by there tonight.”\n\u003cbr\u003e \n\u003cbr\u003e Her hair, dark and drawn back to her ears, brushed her shoulders. She laughed uncontrollably.\n\u003cbr\u003e \n\u003cbr\u003e “He was so helpless,” she said. “Lord knows I’ve seen men helpless — hundreds of them just helpless — but I’ll never forget the expression in his face when he decided to — to lean on me.”\n\u003cbr\u003e \n\u003cbr\u003e Her dark eyes shone with mirth and Bill saw that she was really self-reliant. He stared at her, and the impression of her beauty grew until, uncommitted by a word, by even a formal introduction, he felt himself going out toward her, watching the turn of her lips and the shifting of her cheeks when she smiled . . .\n\u003cbr\u003e \n\u003cbr\u003e All this was in the three or four minutes that he walked beside her; not till afterward did he realize how profound the impression had been.\n\u003cbr\u003e \n\u003cbr\u003e As they passed the church-like bulk of the administration building, an open cabriolet slowed down beside them and a man of about thirty-five jumped out. The girl ran toward him.\n\u003cbr\u003e \n\u003cbr\u003e “Howard!” she cried with excited gayety. “I was attacked. There were some students in front of the Coccidian Club building —”\n\u003cbr\u003e \n\u003cbr\u003e The man swung sharply and menacingly toward Bill Tulliver.\n\u003cbr\u003e \n\u003cbr\u003e “Is this one of them?” he demanded.\n\u003cbr\u003e \n\u003cbr\u003e “No, no; he’s all right.”\n\u003cbr\u003e \n\u003cbr\u003e Simultaneously Bill recognized him — it was Dr. Howard Durfee, brilliant among the younger surgeons, heartbreaker and swashbuckler of the staff.\n\u003cbr\u003e \n\u003cbr\u003e “You haven’t been bothering Miss —”\n\u003cbr\u003e \n\u003cbr\u003e She stopped him, but not before Bill had answered angrily:\n\u003cbr\u003e \n\u003cbr\u003e “I don’t bother people.”\n\u003cbr\u003e \n\u003cbr\u003e Unappeased, as if Bill were in some way responsible, Doctor Durfee got into his car; the girl got in beside him.\n\u003cbr\u003e \n\u003cbr\u003e “So long,” she said. “And thanks.” Her eyes shone at Bill with friendly interest, and then, just before the car shot away, she did something else with them — narrowed them a little and then widened them, recognizing by this sign the uniqueness of their relationship. “I see you,” it seemed to say. “You registered. Everything’s possible.”\n\u003cbr\u003e \n\u003cbr\u003e With the faint fanfare of a new motor, she vanished back into the spring night.\n\u003cbr\u003e II\n\u003cbr\u003e \n\u003cbr\u003e Bill was to enter the hospital in July with the first contingent of newly created doctors. He passed the intervening months at Martha’s Vineyard, swimming and fishing with Schoatze, his classmate, and returned tense with health and enthusiasm to begin his work.\n\u003cbr\u003e \n\u003cbr\u003e The red square broiled under the Maryland sun. Bill went in through the administration building where a gigantic Christ gestured in marble pity over the entrance hall. It was by this same portal that Bill’s father had entered on his interneship thirty years before.\n\u003cbr\u003e \n\u003cbr\u003e Suddenly Bill was in a condition of shock, his tranquility was rent asunder, he could not have given a rational account as to why he was where he was. A dark-haired girl with great, luminous eyes had started up from the very shadow of the statue, stared at him just long enough to effect this damage, and then with an explosive “Hello!” vanished into one of the offices.\n\u003cbr\u003e \n\u003cbr\u003e He was still gazing after her, stricken, haywire, scattered and dissolved — when Doctor Norton hailed him:\n\u003cbr\u003e \n\u003cbr\u003e “I believe I’m addressing William Tulliver the fifth —”\n\u003cbr\u003e \n\u003cbr\u003e Bill was glad to be reminded who he was.\n\u003cbr\u003e \n\u003cbr\u003e “— looking somewhat interested in Doctor Durfee’s girl,” continued Norton.\n\u003cbr\u003e \n\u003cbr\u003e “Is she?” Bill asked sharply. Then: “Oh, howdedo, Doctor?”\n\u003cbr\u003e \n\u003cbr\u003e Dr. Norton decided to exercise his wit, of which he had plenty. “In fact we know they spend their days together, and gossip adds the evenings.”\n\u003cbr\u003e \n\u003cbr\u003e “Their days? I should think he’d be too busy.”\n\u003cbr\u003e \n\u003cbr\u003e “He is. As a matter of fact, Miss Singleton induces the state of coma during which he performs his internal sculpture. She’s an anaesthetist.”\n\u003cbr\u003e \n\u003cbr\u003e “I see. Then they are — thrown together all day.”\n\u003cbr\u003e \n\u003cbr\u003e “If you regard that as a romantic situation.” Doctor Norton looked at him closely. “Are you settled yet? Can you do something for me right now?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, indeed.”\n\u003cbr\u003e \n\u003cbr\u003e “I know you don’t go on the ward till tomorrow, but I’d like you to go to East Michael and take a P. E. and a history.”\n\u003cbr\u003e \n\u003cbr\u003e “Certainly.”\n\u003cbr\u003e \n\u003cbr\u003e “Room 312. I’ve put your methodical friend Schoatze on the trail of another mystery next door.”\n\u003cbr\u003e \n\u003cbr\u003e Bill hurried to his room on the top of Michael, jumped into a new white uniform, equipped himself with instruments. In his haste he forgot that this was the first time he had performed an inquisition unaided. Outside the door he smoothed himself into a calm, serious manner. He was almost a white apostle when we walked into the room; at least he tried to be.\n\u003cbr\u003e \n\u003cbr\u003e A paunchy, sallow man of forty was smoking a cigarette in bed.\n\u003cbr\u003e \n\u003cbr\u003e “Good morning,” Bill said heartily. “How are you this morning?”\n\u003cbr\u003e \n\u003cbr\u003e “Rotten,” the man said. “That’s why I’m here.”\n\u003cbr\u003e \n\u003cbr\u003e Bill set down his satchel and approached him like a young cat after its first sparrow.\n\u003cbr\u003e \n\u003cbr\u003e “What seems to be the trouble?”\n\u003cbr\u003e \n\u003cbr\u003e “Everything. My head aches, my bones ache, I can’t sleep, I don’t eat, I’ve got fever. My chauffeur ran over me, I mean ran over me, I mean ran me, if you know what I mean. I mean from Washington this morning. I can’t stand those Washington doctors; they don’t talk about anything but politics.”\n\u003cbr\u003e \n\u003cbr\u003e Bill clapped a thermometer in his mouth and took his pulse. Then he made the routine examination of chest, stomach, throat and the rest. The reflexes were sluggish to the little rubber hammer. Bill sat down beside the bed.\n\u003cbr\u003e \n\u003cbr\u003e “I’d trade hearts with you any day,” he promised.\n\u003cbr\u003e \n\u003cbr\u003e “They all say I’ve got a good heart,” agreed the man. “What did you think of Hoover’s speech?”\n\u003cbr\u003e \n\u003cbr\u003e “I thought you were tired of politics.”\n\u003cbr\u003e \n\u003cbr\u003e ‘That’s true, but I got thinking of Hoover while you went over me.”\n\u003cbr\u003e \n\u003cbr\u003e “About Hoover?”\n\u003cbr\u003e \n\u003cbr\u003e “About me. What did you find out?”\n\u003cbr\u003e \n\u003cbr\u003e “We’ll want to make some tests. But you seem pretty sound really.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m not sound,” the patient snapped. “I’m not sound. I’m a sick man.”\n\u003cbr\u003e \n\u003cbr\u003e Bill took out a P. E. form and a fountain pen.\n\u003cbr\u003e \n\u003cbr\u003e “What’s your name?” he began.\n\u003cbr\u003e \n\u003cbr\u003e “Paul B. Van Schaik.”\n\u003cbr\u003e \n\u003cbr\u003e “Your nearest relative?”\n\u003cbr\u003e \n\u003cbr\u003e There was nothing in the case history on which to form any opinion. Mr. Van Schaik had had several children’s diseases. Yesterday morning he was unable to get out of bed and his valet had taken his temperature and found fever.\n\u003cbr\u003e \n\u003cbr\u003e Bill’s thermometer registered no fever.\n\u003cbr\u003e \n\u003cbr\u003e “Now we’re going to make just a little prick in your thumb,” he said, preparing glass slides, and when this had been accomplished to the tune of a short, dismal howl from the patient, he added: “We want just a little specimen from your upper arm.”\n\u003cbr\u003e \n\u003cbr\u003e “You want everything but my tears,” protested the patient.\n\u003cbr\u003e \n\u003cbr\u003e “We have to investigate all the possibilities,” said Bill sternly, plunging the syringe into the soft upper arm, inspiring more explosive protests from Mr. Van Schaik.\n\u003cbr\u003e \n\u003cbr\u003e Reflectively Bill replaced his instruments. He had obtained no clue as to what was the matter and he eyed the patient reproachfully.\n\u003cbr\u003e \n\u003cbr\u003e On a chance, he looked for enlarged cervical glands, and asked him if his parents were alive, and took a last look at throat and teeth.\n\u003cbr\u003e \n\u003cbr\u003e “Eyes normally prominent,” he wrote down, with a feeling of futility. “Pupils round and equal.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s all for the moment,” he said. “Try and get some rest.”\n\u003cbr\u003e \n\u003cbr\u003e “Rest!” cried Mr. Van Schaik indignantly. “That’s just the trouble. I haven’t been able to sleep for three days. I feel worse every minute.”\n\u003cbr\u003e \n\u003cbr\u003e As Bill went out into the hall, George Schoatze was just emerging from the room next door. His eyes were uncertain and there was sweat upon his brow.\n\u003cbr\u003e \n\u003cbr\u003e “Finished?” Bill asked.\n\u003cbr\u003e \n\u003cbr\u003e “Why, yes, in a way. Did Doctor Norton set you a job too?”\n\u003cbr\u003e \n\u003cbr\u003e “Yeah. Kind of puzzling case in here — contradictory symptoms,” he lied.\n\u003cbr\u003e \n\u003cbr\u003e “Same here,” said George, wiping his brow. “I’d rather have started out on something more clearly defined, like the ones Robinson gave us in class last year — you know, where there were two possibilities and one probability.”\n\u003cbr\u003e \n\u003cbr\u003e “Unobliging lot of patients,” agreed Bill.\n\u003cbr\u003e \n\u003cbr\u003e A student nurse approached him.\n\u003cbr\u003e \n\u003cbr\u003e “You were just in 312,” she said in a low voice. “I better tell you. I unpacked for the patient, and there was one empty bottle of whisky and one half empty. He asked me to pour him a drink, but I didn’t like to do that without asking a doctor.”\n\u003cbr\u003e \n\u003cbr\u003e “Quite right,” said Bill stiffly, but he wanted to kiss her hand in gratitude.\n\u003cbr\u003e \n\u003cbr\u003e Dispatching the specimens to the laboratory, the two internes went in search of Doctor Norton, whom they found in his office.\n\u003cbr\u003e \n\u003cbr\u003e “Through already? What luck, Tulliver?”\n\u003cbr\u003e \n\u003cbr\u003e “He’s been on a bust and he’s got a hangover,” Bill blurted out. “I haven’t got the laboratory reports yet, but my opinion is that’s all.”\n\u003cbr\u003e \n\u003cbr\u003e “I agree with you,” said Doctor Norton. “All right, Schoatze; how about the lady in 314?”\n\u003cbr\u003e \n\u003cbr\u003e “Well, unless it’s too deep for me, there’s nothing the matter with her at all.”\n\u003cbr\u003e \n\u003cbr\u003e “Right you are,” agreed Doctor Norton. “Nerves — and not even enough of them for the Ward clinic. What’ll we do with them?”\n\u003cbr\u003e \n\u003cbr\u003e “Throw em out,” said Bill promptly.\n\u003cbr\u003e \n\u003cbr\u003e “Let them stay,” corrected Doctor Norton. “They can afford it. They come to us for protection they don’t need, so let them pay for a couple of really sick people over in the free wards. We’re not crowded.”\n\u003cbr\u003e \n\u003cbr\u003e Outside the office, Bill and George fastened eyes.\n\u003cbr\u003e \n\u003cbr\u003e “Humbling us a little,” said Bill rather resentfully. “Let’s go up to the operating rooms; I want to convince myself all over again that this is a serious profession.” He swore. “I suppose for the next few months we’ll be feeling the bellies of four-flushers and taking the case histories of women who aren’t cases.”\n\u003cbr\u003e \n\u003cbr\u003e “Never mind,” said George cautiously. “I was just as glad to start with something simple like — like —”\n\u003cbr\u003e \n\u003cbr\u003e “Like what?”\n\u003cbr\u003e \n\u003cbr\u003e “Why, like nothing.”\n\u003cbr\u003e \n\u003cbr\u003e “You’re easily pleased,” Bill commented.\n\u003cbr\u003e \n\u003cbr\u003e Ascertaining from a bulletin board that Dr. Howard Durfee was at work in No. 4, they took the elevator to the operating rooms. As they slipped on the gowns, caps, and then the masks, Bill realized how quickly he was breathing.\n\u003cbr\u003e \n\u003cbr\u003e He saw HER before he saw anything else in the room, except the bright vermilion spot of the operation itself, breaking the universal whiteness of the scene. There was a sway of eyes toward the two internes as they came into the gallery, and Bill picked out her eyes, darker than ever in contrast with the snowy cap and mask, as she sat working the gas machine at the patient’s invisible head. The room was small. The platform on which they stood was raised about four feet, and by leaning out on a glass screen like a windshield, they brought their eyes to within two yards of the surgeon’s busy hands.\n\u003cbr\u003e \n\u003cbr\u003e “It’s a neat appendix — not a cut in the muscle,” George whispered. “That guy can play lacrosse tomorrow.”\n\u003cbr\u003e \n\u003cbr\u003e Doctor Durfee, busy with catgut, heard him.\n\u003cbr\u003e \n\u003cbr\u003e “Not this patient,” he said. “Too many adhesions.”\n\u003cbr\u003e \n\u003cbr\u003e His hands, trying the catgut, were sure and firm, the fine hands of a pianist, the tough hands of a pitcher combined. Bill thought how insecure, precariously involved, the patient would seem to a layman, and yet how safe he was with those sure hands in an atmosphere so made safe from time itself. Time had stopped at the door of the operating room, too profane to enter here.\n\u003cbr\u003e \n\u003cbr\u003e Thea Singleton guarded the door of the patient’s consciousness, a hand on a pulse, another turning the wheels of the gas machine, as if they were the stops on a silent organ.\n\u003cbr\u003e \n\u003cbr\u003e There were others in attendance — an assisting surgeon, a nurse who passed instruments, a nurse who made liaison between the table and the supplies — but Bill was absorbed in what subtle relationship there was between Howard Durfee and Thea Singleton; he felt a wild jealousy toward the mask with the brilliant, agile hands.\n\u003cbr\u003e \n\u003cbr\u003e “I’m going,” he said to George.\n\u003cbr\u003e \n\u003cbr\u003e He saw her that afternoon, and again it was in the shadow of the great stone Christ in the entrance hall. She was in street clothes, and she looked slick and fresh and tantalizingly excitable.\n\u003cbr\u003e \n\u003cbr\u003e “Of course. You’re the man the night of the Coccidian show. And now you’re an interne. Wasn’t it you who came into Room 4 this morning?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes. How did it go?”\n\u003cbr\u003e \n\u003cbr\u003e “Fine. It was Doctor Durfee.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” he said with emphasis. “I know it was Doctor Durfee.”\n\u003cbr\u003e \n\u003cbr\u003e He met her by accident or contrivance half a dozen times in the next fortnight, before he judged he could ask her for a date.\n\u003cbr\u003e \n\u003cbr\u003e “Why, I suppose so.” She seemed a little surprised. “Let’s see. How about next week — either Tuesday or Wednesday?”\n\u003cbr\u003e \n\u003cbr\u003e “How about tonight?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, not possibly.”\n\u003cbr\u003e \n\u003cbr\u003e When he called Tuesday at the little apartment she shared with a woman musician from the Peabody Institute, he said:\n\u003cbr\u003e \n\u003cbr\u003e “What would you like to do? See a picture?”\n\u003cbr\u003e \n\u003cbr\u003e “No,” she answered emphatically. “If I knew you better I’d say let’s drive about a thousand miles into the country and go swimming in some quarry.” She looked at him quizzically. “You’re not one of those very impulsive internes, are you, that just sweep poor nurses off their feet?”\n\u003cbr\u003e \n\u003cbr\u003e “On the contrary, I’m scared to death of you,” Bill admitted.\n\u003cbr\u003e \n\u003cbr\u003e It was a hot night, but the white roads were cool. They found out a little about each other: She was the daughter of an Army officer and had grown up in the Philippines, and in the black-and-silver water of the abandoned quarry she surprised him with such diving as he had never seen a girl do. It was ghostly inside of the black shadow that ringed the glaring moonlight, and their voices echoed loud when they called to each other.\n\u003cbr\u003e \n\u003cbr\u003e Afterward, with their heads wet and their bodies stung alive, they sat for awhile, unwilling to start back. Suddenly she smiled, and then looked at him without speaking, her lips just barely parted. There was the starlight set upon the brilliant darkness; and there were her pale cool cheeks, and Bill let himself be lost in love for her, as he had so wanted to do.\n\u003cbr\u003e \n\u003cbr\u003e “We must go,” she said presently.\n\u003cbr\u003e \n\u003cbr\u003e “Not yet.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, yet — very yet — exceedingly yet.”\n\u003cbr\u003e \n\u003cbr\u003e “Because,” he said after a moment, “you’re Doctor Durfee’s girl?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” she admitted after a moment, “I suppose I’m Doctor Durfee’s girl.”\n\u003cbr\u003e \n\u003cbr\u003e “Why are you?” he cried.\n\u003cbr\u003e \n\u003cbr\u003e “Are you in love with me?”\n\u003cbr\u003e \n\u003cbr\u003e “I suppose I am. Are you in love with Durfee?”\n\u003cbr\u003e \n\u003cbr\u003e She shook her head. “No, I’m not in love with anybody. I’m just — his girl.”\n\u003cbr\u003e \n\u003cbr\u003e So the evening that had been at first ecstatic was finally unsatisfactory. This feeling deepened when he found that for his date he had to thank the fact that Durfee was out of town for a few days.\n\u003cbr\u003e \n\u003cbr\u003e With August and the departure of more doctors on vacation, he found himself very busy. During four years he had dreamed of such work as he was doing, and now it was all disturbed by the ubiquity of “Durfee’s girl.” In vain he searched among the girls in the city, on those Sundays when he could go into the city, for some who would soften the hurt of his unreciprocated emotion. But the city seemed empty of girls, and in the hospital the little probationers in short cuffs had no appeal for him. The truth of his situation was that his initial idealism which had been centred in Doctor Norton had transferred itself to Thea. Instead of a God, it was now a Goddess who symbolized for him the glory and the devotion of his profession; and that she was caught up in an entanglement that bound her away from him, played havoc with his peace of mind.\n\u003cbr\u003e \n\u003cbr\u003e Diagnosis had become a workaday matter — almost. He had made a few nice guesses and Doctor Norton had given him full credit.\n\u003cbr\u003e \n\u003cbr\u003e “Nine times out of ten I’ll be right,” Norton said. “The rare thing is so rare that I’m out of the habit of looking for it. That’s where you young men come in; you’re cocked for the rare thing and that one time in ten you find it.”\n\u003cbr\u003e \n\u003cbr\u003e “It’s a great feeling,” said Bill. “I got a big kick out of that actinomycosis business.”\n\u003cbr\u003e \n\u003cbr\u003e “You look tired for your age,” said Doctor Norton suddenly. “At twenty-five you shouldn’t be existing entirely on nervous energy, Bill, and that’s what you’re doing. The people you grew up with say they never see you. Why not take a couple of hours a week away from the hospital, if only for the sake of your patients? You took so many chemistry tests of Mr. Doremus that we almost had to give him blood transfusions to build him up again.”\n\u003cbr\u003e \n\u003cbr\u003e “I was right,” said Bill eagerly.\n\u003cbr\u003e \n\u003cbr\u003e “But a little brutal. Everything would have developed in a day or two. Take it gently, like your friend Schoatze. You’re going to know a lot about internal medicine some day, but you’re trying to rush things.”\n\u003cbr\u003e \n\u003cbr\u003e But Bill was a man driven; he tried more Sunday afternoons with current débutantes, but in the middle of a conversation he would find his mind drifting back to those great red building blocks of an Idea, where alone he could feel the pulse of life.\n\u003cbr\u003e \n\u003cbr\u003e The news that a famous character in politics was leaving the Coast and coming to the hospital for the diagnosis of some obscure malady had the effect of giving him a sudden interest in politics. He looked up the record of the man and followed his journey east, which occupied half a column daily in the newspapers; party issues depended on his survival and eventual recovery.\n\u003cbr\u003e \n\u003cbr\u003e Then one August afternoon there was an item in the society column which announced the engagement of Helen, débutante daughter of Mrs. Truby Ponsonby Day, to Dr. Howard Durfee. Bill’s reconciled world turned upside down. After an amount of very real suffering, he had accepted the fact that Thea was the mistress of a brilliant surgeon, but that Dr. Durfee should suddenly cut loose from her was simply incredible.\n\u003cbr\u003e \n\u003cbr\u003e Immediately he went in search of her, found her issuing from the nurses’ ward in street clothes. Her lovely face, with the eyes that held for him all the mystery of people trying, all the splendor of a goal, all reward, all purpose, all satisfaction, was harried with annoyance; she had been stared at and pitied.\n\u003cbr\u003e \n\u003cbr\u003e “If you like,” she answered, when he asked if he could run her home, and then: “Heaven help women! The amount of groaning over my body that took place this afternoon would have been plenty for a war.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m going to help you,” he said. “If that guy has let you down —”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, shut up! Up to a few weeks ago I could have married Howard Durfee by nodding my head — that’s just what I wouldn’t tell those women this afternoon. I think you’ve got discretion, and that’ll help you a lot when you’re a doctor.”\n\u003cbr\u003e \n\u003cbr\u003e “I am a doctor,” he said somewhat stiffly.\n\u003cbr\u003e \n\u003cbr\u003e “No, you’re just an interne.”\n\u003cbr\u003e \n\u003cbr\u003e He was indignant and they drove in silence. Then, softening, she turned toward him and touched his arm.\n\u003cbr\u003e \n\u003cbr\u003e “You happen to be a gentleman,” she said, “which is nice sometimes — though I prefer a touch of genius.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ve got that,” Bill said doggedly. “I’ve got everything, except you.”\n\u003cbr\u003e \n\u003cbr\u003e “Come up to the apartment and I’ll tell you something that no one else in this city knows.”\n\u003cbr\u003e \n\u003cbr\u003e It was a modest apartment but it told him that at some time she had lived in a more spacious world. It was all reduced, as if she had hung on to several cherished things, a Duncan Phyfe table, a brass by Brancusi, two oil portraits of the ‘50’s.\n\u003cbr\u003e \n\u003cbr\u003e “I was engaged to John Gresham,” she said. “Do you know who he was?”\n\u003cbr\u003e \n\u003cbr\u003e “Of course,” he said. “I took up the subscription for the bronze tablet to him.”\n\u003cbr\u003e \n\u003cbr\u003e John Gresham had died by inches from radium poisoning, got by his own experiments.\n\u003cbr\u003e \n\u003cbr\u003e “I was with him till the end,” Thea went on quickly, “and just before he died he wagged his last finger at me and said, ‘I forbid you to go to pieces. That doesn’t do any good.’ So, like a good little girl, I didn’t go to pieces, but I toughened up instead. Anyhow, that’s why I never could love Howard Durfee the way he wanted to be loved, in spite of his nice swagger and his fine hands.”\n\u003cbr\u003e \n\u003cbr\u003e “I see.” Overwhelmed by the revelation, Bill tried to adjust himself to it. “I knew there was something far off about you, some sort of — oh, dedication to something I didn’t know about.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m pretty hard.” She got up impatiently. “Anyhow, I’ve lost a good friend today and I’m cross, so go before I show it. Kiss me good-by if you like.”\n\u003cbr\u003e \n\u003cbr\u003e “It wouldn’t mean anything at this moment.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, it would,” she insisted. “I like to be close to you. I like your clothes.”\n\u003cbr\u003e \n\u003cbr\u003e Obediently he kissed her, but he felt far off from her and very rebuffed and young as he went out the door.\n\u003cbr\u003e \n\u003cbr\u003e He awoke next morning with the sense of something important hanging over him; then he remembered. Senator Billings, relayed by crack trains, airplanes and ambulances, was due to arrive during the morning, and the ponderous body which had housed and expelled so much nonsense in thirty years was to be at the mercy of the rational at last.\n\u003cbr\u003e \n\u003cbr\u003e “I’ll diagnose the old boy,” he thought grimly, “if I have to invent a new disease.”\n\u003cbr\u003e \n\u003cbr\u003e He went about his routine work with a sense of fatigue that morning. Perhaps Doctor Norton would keep this plum to himself and Bill wouldn’t have a chance at him. But at eleven o’clock he met his senior in a corridor.\n\u003cbr\u003e \n\u003cbr\u003e “The senator’s come,” he said. “I’ve formed a tentative opinion. You might go in and get his history. Go over him quickly and give him the usual laboratory work-up.”\n\u003cbr\u003e \n\u003cbr\u003e “All right,” said Bill, but there was no eagerness in his voice. He seemed to have lost all his enthusiasm. With his instruments and a block of history paper, he repaired to the senator’s room.\n\u003cbr\u003e \n\u003cbr\u003e “Good morning,” he began. “Feeling a little tired after your trip?”\n\u003cbr\u003e \n\u003cbr\u003e The big barrel of a man rolled toward him.\n\u003cbr\u003e \n\u003cbr\u003e “Exhausted,” he squeaked unexpectedly. “All in.”\n\u003cbr\u003e \n\u003cbr\u003e Bill didn’t wonder; he felt rather that way himself, as if he had travelled thousands of miles in all sorts of conveyances until his insides, including his brains, were all shaken up together.\n\u003cbr\u003e \n\u003cbr\u003e He took the case history.\n\u003cbr\u003e \n\u003cbr\u003e “What’s your profession?”\n\u003cbr\u003e \n\u003cbr\u003e “Legislator.”\n\u003cbr\u003e \n\u003cbr\u003e “Do you use any alcohol?”\n\u003cbr\u003e \n\u003cbr\u003e The senator raised himself on one arm and thundered, “See here, young man; I’m not going to be heckled! As long as the Eighteenth Amendment —” He subsided.\n\u003cbr\u003e \n\u003cbr\u003e “Do you use any alcohol?” Bill asked again patiently.\n\u003cbr\u003e \n\u003cbr\u003e “Why, yes.”\n\u003cbr\u003e \n\u003cbr\u003e “How much?”\n\u003cbr\u003e \n\u003cbr\u003e “A few drinks every day. I don’t count them. Say, if you look in my suitcase you’ll find an X-ray of my lungs, taken a few years ago.”\n\u003cbr\u003e \n\u003cbr\u003e Bill found it and stared at it with a sudden feeling that everything was getting a little crazy.\n\u003cbr\u003e \n\u003cbr\u003e “This is an X-ray of a woman’s stomach,” he said.\n\u003cbr\u003e \n\u003cbr\u003e “Oh — well, it must have got mixed up,” said the senator. “It must be my wife’s.”\n\u003cbr\u003e \n\u003cbr\u003e Bill went into the bathroom to wash his thermometer. When he came back he took the senator’s pulse, and was puzzled to find himself regarded in a curious way.\n\u003cbr\u003e \n\u003cbr\u003e “What’s the idea?” the senator demanded. “Are you the patient or am I?” He jerked his hand angrily away from Bill. “Your hand’s like ice. And you’ve put the thermometer in your own mouth.”\n\u003cbr\u003e \n\u003cbr\u003e Only then did Bill realize how sick he was. He pressed the nurse’s bell and staggered back to a chair with wave after wave of pain chasing across his abdomen.\n\u003cbr\u003e III\n\u003cbr\u003e \n\u003cbr\u003e He awoke with a sense that he had been in bed for many hours. There was fever bumping in his brain, a pervasive weakness in his body, and what had wakened him was a new series of pains in his stomach. Across the room in an armchair sat Dr. George Schoatze, and on his knee was the familiar case-history pad.\n\u003cbr\u003e \n\u003cbr\u003e “What the hell,” Bill said weakly. “What the hell’s the matter with me? What happened?”\n\u003cbr\u003e \n\u003cbr\u003e “You’re all right,” said George. “You just lie quiet.”\n\u003cbr\u003e \n\u003cbr\u003e Bill tried to sit upright, but found he was too weak.\n\u003cbr\u003e \n\u003cbr\u003e “Lie quiet!” he repeated incredulously. “What do you think I am — some dumb patient? I asked you what’s the matter with me?”\n\u003cbr\u003e \n\u003cbr\u003e “That’s exactly what we’re trying to find out. Say, what is your exact age?”\n\u003cbr\u003e \n\u003cbr\u003e “My age!” Bill cried. “A hundred and ten in the shade! My name’s Al Capone and I’m an old hophead. Stick that on your God damn paper and mail it to Santa Claus. I asked you what’s the matter with me.”\n\u003cbr\u003e \n\u003cbr\u003e “And I say that’s what we’re trying to find out,” said George, staunch, but a little nervous. “Now, you take it easy.”\n\u003cbr\u003e \n\u003cbr\u003e “Take it easy!” cried Bill. “When I’m burning up with fever and a half-wit interne sits there and asks me how many fillings I’ve got in my teeth! You take my temperature, and take it right away!”\n\u003cbr\u003e \n\u003cbr\u003e “All right — all right,” said George conciliatingly. “I was just going to.”\n\u003cbr\u003e \n\u003cbr\u003e He put the thermometer in Bill’s mouth and felt for the pulse, but Bill mumbled, “I’ll shake my ode pulse,” and pulled his hand away. After two minutes George deftly extracted the thermometer and walked with it to the window, an act of treachery that brought Bill’s legs out of bed.\n\u003cbr\u003e \n\u003cbr\u003e “I want to read that thermometer!” he cried. “Now, you look here! I want to know what’s on that thermometer!”\n\u003cbr\u003e \n\u003cbr\u003e George shook it down quickly and put it in its case.\n\u003cbr\u003e \n\u003cbr\u003e “That isn’t the way we do things here,” he said.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, isn’t it? Well, then, I’ll go somewhere where they’ve got some sense.”\n\u003cbr\u003e \n\u003cbr\u003e George prepared a syringe and two small plates of glass.\n\u003cbr\u003e \n\u003cbr\u003e Bill groaned. “Do you think for a moment I’m going to let you do that? I taught you everything you know about blood chemistry. By God, I used to do your lessons for you, and you come here to make some clumsy stab into my arm!”\n\u003cbr\u003e \n\u003cbr\u003e Perspiring fluently, as was his wont under strain, George rang for a nurse, with the hope that a female presence would have a calming effect on Bill. But it was not the right female.\n\u003cbr\u003e \n\u003cbr\u003e “Another nitwit!” Bill cried as she came in. “Do you think I’m going to lie here and stand more of this nonsense? Why doesn’t somebody do something? Where’s Doctor Norton?”\n\u003cbr\u003e \n\u003cbr\u003e “He’ll be here this afternoon.”\n\u003cbr\u003e \n\u003cbr\u003e “This afternoon! I’ll probably be dead by this afternoon. Why isn’t he here this morning? Off on some social bat and I lie here surrounded by morons who’ve lost their heads and don’t know what to do about it. What are you writing there — that my ‘tongue protrudes in mid-line without tremor’? Give me my slippers and bathrobe. I’m going to report you two as specimens for the nerve clinic.”\n\u003cbr\u003e \n\u003cbr\u003e They pressed him down in bed, whence he looked up at George with infinite reproach.\n\u003cbr\u003e \n\u003cbr\u003e “You, that I explained a whole book of toxicology to, you’re presuming to diagnose me. Well, then, do it! What have I got? Why is my stomach burning up? Is it appendicitis? What’s the white count?”\n\u003cbr\u003e \n\u003cbr\u003e “How can I find out the white count when —”\n\u003cbr\u003e \n\u003cbr\u003e With a sigh of infinite despair at the stupidity of mankind, Bill relaxed, exhausted.\n\u003cbr\u003e \n\u003cbr\u003e Doctor Norton arrived at two o’clock. His presence should have been reassuring, but by this time the patient was too far gone in nervous tension.\n\u003cbr\u003e \n\u003cbr\u003e “Look here, Bill,” he said sternly. “What’s all this about not letting George look into your mouth?”\n\u003cbr\u003e \n\u003cbr\u003e “Because he deliberately gagged me with that stick,” Bill cried. “When I get out of this I’m going to stick a plank down that ugly trap of his.”\n\u003cbr\u003e \n\u003cbr\u003e “Now, that’ll do. Do you know little Miss Cary has been crying? She says she’s going to give up nursing. She says she’s never been so disillusioned in her life.”\n\u003cbr\u003e \n\u003cbr\u003e “The same with me. Tell her I’m going to give it up too. After this, I’m going to kill people instead of curing them. Now when I need it nobody has even tried to cure me. “\n\u003cbr\u003e \n\u003cbr\u003e An hour later Doctor Norton stood up.\n\u003cbr\u003e \n\u003cbr\u003e “Well, Bill, we’re going to take you at your word and tell you what’s what. I’m laying my cards on the table when I say we don’t know what’s the matter with you. We’ve just got the X-rays from this morning, and it’s pretty certain it’s not the gall bladder. There’s a possibility of acute food poisoning or mesenteric thrombosis, or it may be something we haven’t thought of yet. Give us a chance, Bill.”\n\u003cbr\u003e \n\u003cbr\u003e With an effort and with the help of a sedative, Bill got himself in comparative control; only to go to pieces again in the morning, when George Schoatze arrived to give him a hypodermoclysis.\n\u003cbr\u003e \n\u003cbr\u003e “But I can’t stand it,” he raged. “I never could stand being pricked, and you have as much right with a needle as a year-old baby with a machine gun.”\n\u003cbr\u003e \n\u003cbr\u003e “Doctor Norton has ordered that you get nothing by mouth.”\n\u003cbr\u003e \n\u003cbr\u003e “Then give it intravenously.”\n\u003cbr\u003e \n\u003cbr\u003e “This is best.”\n\u003cbr\u003e \n\u003cbr\u003e “What I’ll do to you when I get well! I’ll inject stuff into you until you’re as big as a barrel! I will! I’ll hire somebody to hold you down!”\n\u003cbr\u003e \n\u003cbr\u003e Forty-eight hours later, Doctor Norton and Doctor Schoatze had a conference in the former’s office.\n\u003cbr\u003e \n\u003cbr\u003e “So there we are,” George was saying gloomily. “He just flatly refuses to submit to the operation.”\n\u003cbr\u003e \n\u003cbr\u003e “H’m.” Doctor Norton considered. “That’ bad.”\n\u003cbr\u003e \n\u003cbr\u003e “There’s certainly danger of a perforation.”\n\u003cbr\u003e \n\u003cbr\u003e “And you say that his chief objection —”\n\u003cbr\u003e \n\u003cbr\u003e “— that it was my diagnosis. He says I remembered the word ‘volvulus’ from some lecture and I’m trying to wish it on him.” George added uncomfortably: “He always was domineering, but I never saw anything like this. Today he claims it’s acute pancreatitis, but he doesn’t have any convincing reasons.”\n\u003cbr\u003e \n\u003cbr\u003e “Does he know I agree with your opinion?”\n\u003cbr\u003e \n\u003cbr\u003e “He doesn’t seem to believe in anybody,” said George uncomfortably. “He keeps fretting about his father; he keeps thinking he could help him if he was alive.”\n\u003cbr\u003e \n\u003cbr\u003e “I wish that there was someone outside the hospital he had some faith in,” Norton said. An idea came to him: “I wonder —” He picked up the telephone and said to the operator: “I wish you’d locate Miss Singleton, Doctor Durfee’s anaesthetist. And when she’s free, ask her to come and see me.”\n\u003cbr\u003e \n\u003cbr\u003e Bill opened his eyes wearily when Thea came into his room at eight that night.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, it’s you,” he murmured.\n\u003cbr\u003e \n\u003cbr\u003e She sat on the side of his bed and put her hand on his arm.\n\u003cbr\u003e \n\u003cbr\u003e “H’lo, Bill,” she said.\n\u003cbr\u003e \n\u003cbr\u003e “H’lo.”\n\u003cbr\u003e \n\u003cbr\u003e Suddenly he turned in bed and put both arms around her arm. Her free hand touched his hair.\n\u003cbr\u003e \n\u003cbr\u003e “You’ve been bad,” she said.\n\u003cbr\u003e \n\u003cbr\u003e “I can’t help it.”\n\u003cbr\u003e \n\u003cbr\u003e She sat with him silently for half an hour; then she changed her position so that her arm was under his head. Stooping over him, she kissed him on the brow. He said:\n\u003cbr\u003e \n\u003cbr\u003e “Being close to you is the first rest I’ve had in four days.”\n\u003cbr\u003e \n\u003cbr\u003e After a while she said: “Three months ago Doctor Durfee did an operation for volvulus and it was entirely successful.”\n\u003cbr\u003e \n\u003cbr\u003e “But it isn’t volvulus!” he cried. “Volvulus is when a loop of the intestine gets twisted on itself. It’s a crazy idea of Schoatze’s! He wants to make a trick diagnosis and get a lot of credit.”\n\u003cbr\u003e \n\u003cbr\u003e “Doctor Norton agrees with him. You must give in, Bill. I’ll be right beside you, as close as I am now.”\n\u003cbr\u003e \n\u003cbr\u003e Her soft voice was a sedative; he felt his resistance growing weaker; two long tears rolled from his eyes. “I feel so helpless,” he admitted. “How do I know whether George Schoatze has any sense?”\n\u003cbr\u003e \n\u003cbr\u003e “That’s just childish,” she answered gently. “You’ll profit more by submitting to this than Doctor Schoatze will from his lucky guess.”\n\u003cbr\u003e \n\u003cbr\u003e He clung to her suddenly. “Afterward, will you be my girl?”\n\u003cbr\u003e \n\u003cbr\u003e She laughed. “The selfishness! The bargainer! You wouldn’t be very cheerful company if you went around with a twisted intestine.”\n\u003cbr\u003e \n\u003cbr\u003e He was silent for a moment. “Yesterday I made my will,” he said. “I divided what I have between an old aunt and you.”\n\u003cbr\u003e \n\u003cbr\u003e She put her face against his. “You’ll make me weep, and it really isn’t that serious at all.”\n\u003cbr\u003e \n\u003cbr\u003e “All right then.” His white, pinched face relaxed. “Get it over with.”\n\u003cbr\u003e \n\u003cbr\u003e Bill was wheeled upstairs an hour later. Once the matter was decided, all nervousness left him, and he remembered how the hands of Doctor Durfee had given him such a sense of surety last July, and remembered who would be at his head watching over him. He last thought as the gas began was sudden jealousy that Thea and Howard Durfee would be awake and near each other while he was asleep . . .\n\u003cbr\u003e \n\u003cbr\u003e . . . When he awoke he was being wheeled down a corridor to his room. Doctor Norton and Doctor Schoatze, seeming very cheerful, were by his side.\n\u003cbr\u003e \n\u003cbr\u003e “H’lo, hello,” cried Bill in a daze. “Say, what did they finally discover about Senator Billings?”\n\u003cbr\u003e \n\u003cbr\u003e “It was only a common cold, Bill,” said Doctor Norton. “They’ve shipped him back west — by dirigible, helicopter and freight elevator.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh,” said Bill; and then, after a moment, “I feel terrible.”\n\u003cbr\u003e \n\u003cbr\u003e “You’re not terrible,” Doctor Norton assured him. “You’ll be up on deck in a week. George here is certainly a swell guesser.”\n\u003cbr\u003e \n\u003cbr\u003e “It was a beautiful operation,” said George modestly. “That loop would have perforated in another six hours.”\n\u003cbr\u003e \n\u003cbr\u003e “Good anaesthesia job, too,” said Doctor Norton, winking at George. “Like a lullaby.”\n\u003cbr\u003e \n\u003cbr\u003e Thea slipped in to see Bill next morning, when he was rested and the soreness was eased and he felt weak but himself again. She sat beside him on the bed.\n\u003cbr\u003e \n\u003cbr\u003e “I made an awful fool of myself,” he confessed.\n\u003cbr\u003e \n\u003cbr\u003e “A lot of doctors do when they get sick the first time. They go neurotic.”\n\u003cbr\u003e \n\u003cbr\u003e “I guess everybody’s off me.”\n\u003cbr\u003e \n\u003cbr\u003e “Not at all. You’ll be in for some kidding probably. Some bright young one wrote this for the Coccidian Club show.” She read from a scrap of paper:\n\u003cbr\u003e \n\u003cbr\u003e “Interne Tulliver, chloroformed,\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp; Had dreams above his station;\n\u003cbr\u003e \n\u003cbr\u003e He woke up thinking he’d performed\n\u003cbr\u003e \n\u003cbr\u003e \u0026nbsp;\u0026nbsp; His own li’l operation.”\n\u003cbr\u003e \n\u003cbr\u003e “I guess I can stand it,” said Bill. “I can stand anything when you’re around; I’m so in love with you. But I suppose after this you’ll always see me as about high-school age.”\n\u003cbr\u003e \n\u003cbr\u003e “If you’d had your first sickness at forty you’d have acted the same way.”\n\u003cbr\u003e \n\u003cbr\u003e “I hear your friend Durfee did a brilliant job, as usual,” he said resentfully.\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” she agreed; after a minute she added: “He wants to break his engagement and marry me on my own terms.”\n\u003cbr\u003e \n\u003cbr\u003e His heart stopped beating. “And what did you say?”\n\u003cbr\u003e \n\u003cbr\u003e “I said No.”\n\u003cbr\u003e \n\u003cbr\u003e Life resumed itself again.\n\u003cbr\u003e \n\u003cbr\u003e “Come closer,” he whispered. “Where’s your hand? Will you, anyhow, go swimming with me every night all the rest of September?”\n\u003cbr\u003e \n\u003cbr\u003e “Every other night.”\n\u003cbr\u003e \n\u003cbr\u003e “Every night.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, every hot night,” she compromised.\n\u003cbr\u003e \n\u003cbr\u003e Thea stood up.\n\u003cbr\u003e \n\u003cbr\u003e He saw her eyes fix momentarily on some distant spot, linger there for a moment as if she were drawing support from it; then she leaned over him and kissed his hungry lips good-by, and faded back into her own mystery, into those woods where she hunted, with an old suffering and with a memory he could not share.\n\u003cbr\u003e \n\u003cbr\u003e But what was valuable in it she had distilled; she knew how to pass it along so that it would not disappear. For the moment Bill had had more than his share, and reluctantly he relinquished her.\n\u003cbr\u003e \n\u003cbr\u003e “This has been my biggest case so far,” he thought sleepily.\n\u003cbr\u003e \n\u003cbr\u003e The verse to the Coccidian Club song passed through his mind, and the chorus echoed on, singing him into deep sleep:\n\u003cbr\u003e \n\u003cbr\u003e Bumtiddy, bum-bum,\n\u003cbr\u003e \n\u003cbr\u003e Tiddy-bum-bum.\n\u003cbr\u003e \n\u003cbr\u003e Three thousand years ago,\n\u003cbr\u003e \n\u003cbr\u003e Three thousand years ago.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1357/40710.html","bookId":1452,"creation":"Aug 5, 2019 3:22:50 AM","modification":"Aug 5, 2019 3:22:50 AM"}
