{"id":90979,"no":13,"title":"Page 13","content":"\u003cp\u003eDee took the lead, with Summer following her lightly and Michael and Audrey after that.\u003c/p\u003e\n\u003cp\u003eJenny wanted the others to go ahead of her partly because she was afraid, and partly because she didn\u0027t want any of them trying to save her if she fell off.\u003c/p\u003e\n\u003cp\u003eHeights. She had always hated heights. But she was damned if she was going to let this bridge stop her from getting to Tom.\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t all that bad at the beginning. Steep, yes, and narrow, yes. And there were no handrails. If the whole structure had been six inches off the ground, Jenny could have walked it easily, without a chance of slipping. The problem was doing it twenty feet off the ground.\u003c/p\u003e\n\u003cp\u003eBut if she looked straight down and concentrated on her own feet, she couldn\u0027t see how they were climbing.\u003c/p\u003e\n\u003cp\u003eJust then, though, something drifted past her\u003c/p\u003e\n\u003cp\u003efeet-a wisp of mist. Alarmed, she looked to one side.\u003c/p\u003e\n\u003cp\u003eNo, they weren\u0027t cloud-height. They really were only twenty feet off the ground. But mist was rising around them.\u003c/p\u003e\n\u003cp\u003e\"Oh, spiffy,\" Michael said from somewhere ahead, and Summer\u0027s voice said, \"I can\u0027t see.\"\u003c/p\u003e\n\u003cp\u003eDee\u0027s voice floated back from even farther ahead. \"Reach back and hold hands with each other. I can feel my way along.\"\u003c/p\u003e\n\u003cp\u003eJenny reached forward and took a handful of Audrey\u0027s nylon jacket-Audrey only had one good arm to use. She shuffled forward, gritting her teeth. Everything around her was white. She could barely see her own hiking boots.\u003c/p\u003e\n\u003cp\u003eIn a few minutes, though, her head broke through the mist. She went on shuffling upward, inching out of it. Her legs were aching, and she hoped they were getting near the top.\u003c/p\u003e\n\u003cp\u003eIt was only when Audrey stopped short in front of her, and gasped, that she looked around.\u003c/p\u003e\n\u003cp\u003eThe mist was gone. What she saw beneath the bridge now was-unearthly.\u003c/p\u003e\n\u003cp\u003eIt was dark, and arching through the darkness were other bridges, delicate and airy, some fiery, some that looked like ice. They led to clumps of land that looked like islands floating in space.\u003c/p\u003e\n\u003cp\u003e\"Like Neverland,\" Jenny whispered. \"A bunch of Neverlands. What are they? And where are we?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I don\u0027t believe this,\" Audrey said just as softly.\u003c/p\u003e\n\u003cp\u003e\"I do,\" Dee said from the very top of the arch. Her\u003c/p\u003e\n\u003cp\u003ehead was thrown back on the slim dark column of her neck. Faint light from the bridges shifted on the planes of her cheekbones, and her eyes glowed. \"I do.\"\u003c/p\u003e\n\u003cp\u003eSome of the islands were brighter and more substantial-looking than any landscape Jenny had seen on Earth-sharper in detail, more exquisite in clarity. Others were dim and vague-as if they had been partly formed and then abandoned.\u003c/p\u003e\n\u003cp\u003eBetween the clumps of land Jenny could see stars -but not normal stars. These stars rippled and waved as if she were looking at them through a clear stream, or as if they were studded on a flowing length of black silk. There was something incredibly lost and lonely about them.\u003c/p\u003e\n\u003cp\u003e\"But what are those things? Those other islands?\" she said again.\u003c/p\u003e\n\u003cp\u003eAudrey gave herself a little shake and seemed to focus. \"I think-those are the nine worlds. From Norse mythology-Norse, like the runes. I told you about them once.\"\u003c/p\u003e\n\u003cp\u003e\"You mean-we\u0027re above the Shadow World somehow?\"\u003c/p\u003e\n\u003cp\u003e\"I guess. Now that-that\u0027s probably Asgard, the one way up there. It\u0027s got to be.\"\u003c/p\u003e\n\u003cp\u003eJenny tilted her head back. Far above them-the farthest away of any of the clumps-was an island world that seemed all silver and gold. She could just glimpse something like a shining mountain rising into a golden cloud on it. The bridge to it was very narrow and seemed to be on fire.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s where the gods live.\"\u003c/p\u003e\n\u003cp\u003e\"The gods?\" Jenny spoke to Audrey without looking down from the shining island.\u003c/p\u003e\n\u003cp\u003e\"So the myths say. Hmm, and I\u0027ll bet that\u0027s Vanaheim. World of primal water and plenty, where some of the less important gods live.\" Audrey pointed to an island painted in jewel-like colors, dark blue and dark green.\u003c/p\u003e\n\u003cp\u003e\"Vanaheim-any relation to Anaheim?\" Michael murmured. Audrey pinched her mouth on a smile, but ignored him.\u003c/p\u003e\n\u003cp\u003e\"And that\u0027s Alfheim, world of light and air,\" she said, nodding at an island that was much closer to them, shimmering in the colors of sunrise: yellow, pale blue, light green. \"Home of light elves-like good spirits. I\u0027m remembering all this, isn\u0027t that amazing? I must have been about eight when I learned it.\"\u003c/p\u003e\n\u003cp\u003e\"What about those?\" Dee said, pointing straight outward. Two island worlds were floating at about the same level as the bridge they stood on: one rocky and lashed by what looked like tornadoes, and the other so bright with orange fire that Jenny couldn\u0027t make out any details.\u003c/p\u003e\n\u003cp\u003e\"The rocky one\u0027s Jotunheim-the world of primal storms. And the other one has to be Muspelheim, the world of primal fire. Nothing lives there but killer giants.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" Michael said, staring downward and to the left.\u003c/p\u003e\n\u003cp\u003eAudrey looked. \"Hell\" she said simply.\u003c/p\u003e\n\u003cp\u003e\"I always thought hell would be hot,\" Summer said, her eyes widening like cornflowers blooming.\u003c/p\u003e\n\u003cp\u003e\"Hel with one l. It\u0027s the underworld, where everything sinks in the end. Ruled by Hella, queen of the dead.\"\u003c/p\u003e\n\u003cp\u003eIt looked like a frozen lake, colder and blacker than the empty space between the worlds. Jenny had never seen such a lightless, joyless place.\u003c/p\u003e\n\u003cp\u003eThe bridge to it was like a slide, broad and frosty.\u003c/p\u003e\n\u003cp\u003e\"We definitely wouldn\u0027t want to go there. Or to that one-the one that looks like a cavern. That\u0027s Svartalfheim, the subterranean world.\"\u003c/p\u003e\n\u003cp\u003e\"No more caves, thank you,\" Michael said.\u003c/p\u003e\n\u003cp\u003eThere was only one island left. It was the one directly below them, and both ends of the bridge they stood on seemed connected to it. From here, the surface was obscured by dark mist and shadows.\u003c/p\u003e\n\u003cp\u003eAudrey said, \"Niflheim, land of ice and shadows. The Shadow World.\" She shook her head. \"I still don\u0027t believe this.\"\u003c/p\u003e\n\u003cp\u003e\"Why not? It\u0027s no weirder than anything else we\u0027ve seen today,\" Dee said. \"But I only count eight worlds. Where\u0027s Earth?\"\u003c/p\u003e\n\u003cp\u003eAudrey looked around, then shrugged. \"Maybe we don\u0027t get to see that bridge until we finish the Game.\"\u003c/p\u003e\n\u003cp\u003e\"Who cares? Look, we wanted to walk between the worlds, right?\" Dee said, her eyes shining. \"And now we\u0027re doing it. So-shall we?\"\u003c/p\u003e\n\u003cp\u003eJenny nodded. She felt very tiny and insignificant standing here, and her throat was tight. And she had the feeling that it was going to be harder going down than going up-because now the fall was so much longer.\u003c/p\u003e\n\u003cp\u003eThey started moving. It was hard to walk in the place between the worlds-physically hard. After two or three steps Jenny began to feel muscle-burn in her calves and thigh muscles. She could hear Audrey panting in front of her.\u003c/p\u003e\n\u003cp\u003eAnd the barest glimpse of the fall on either side made Jenny\u0027s internal organs feel as if they were plunging out of her body.\u003c/p\u003e\n\u003cp\u003eHer legs wanted to freeze. She wanted to get down on her rump and scoot the rest of the way-no, get down on her stomach and slither. But that wasn\u0027t the worst.\u003c/p\u003e\n\u003cp\u003eShe was afraid she would faint.\u003c/p\u003e\n\u003cp\u003eIf I faint up here, I\u0027ll fall. Of course I\u0027ll fall. Nobody faints neatly forward. I\u0027ll slide off the side.\u003c/p\u003e\n\u003cp\u003eThe moment the thought of fainting occurred to her, it blocked everything else out. She was going to faint. Just thinking about it made her dizzy. She was so scared of fainting, she felt like jumping.\u003c/p\u003e\n\u003cp\u003eHysteria began to bubble up inside her. She shouldn\u0027t have thought about jumping. Now she was afraid she would jump, just because the idea had occurred to her. She had to try not to think about it.\u003c/p\u003e\n\u003cp\u003eThink of anything else. Think of Tom, think of getting to Tom. But the idea of jumping was now stuck in her mind. She started to picture it. She could get it all over with, turn to the side and just let go. God, no-she didn\u0027t want to, but she was afraid she\u0027d go crazy and do it. ...\u003c/p\u003e\n\u003cp\u003eThe voice came from her own brain, but it was so harsh it seemed alien. You keep on moving, girl!\u003c/p\u003e\n\u003cp\u003eJenny realized she was stopped, frozen. Staring down at her own feet in their brown leather hiking boots, and the white ribbon of bridge, and the formless darkness on either side.\u003c/p\u003e\n\u003cp\u003eJust put one foot in front of the other. The right foot. Put out your right foot.\u003c/p\u003e\n\u003cp\u003eI can\u0027t, she thought.\u003c/p\u003e\n\u003cp\u003eYes, you can!\u003c/p\u003e\n\u003cp\u003eBut if I faint-or jump -\u003c/p\u003e\n\u003cp\u003eYou expect everybody else to face their fears, and you can\u0027t face yours? You\u0027re not your only master if you can\u0027t even control your own feet! You\u0027re just a coward!\u003c/p\u003e\n\u003cp\u003eThe right boot jerked a little and stepped forward.\u003c/p\u003e\n\u003cp\u003eThat\u0027s right. Now the other one.\u003c/p\u003e\n\u003cp\u003eThe other boot came forward. Jenny was walking again.\u003c/p\u003e\n\u003cp\u003eShe could do it-command her own feet. Just put one foot in front of the other. And one more step. And one more.\u003c/p\u003e\n\u003cp\u003eDon\u0027t look to the side. One more step. And one more.\u003c/p\u003e\n\u003cp\u003eThere were only a few body-lengths of bridge in front of her. She could see where it ended. Ten feet. Five feet.\u003c/p\u003e\n\u003cp\u003eOn legs that had suddenly gone weak as angel-hair pasta, Jenny stumbled and fell onto safe ground.\u003c/p\u003e\n\u003cp\u003eDee bent over her. \"You okay?\"\u003c/p\u003e\n\u003cp\u003eWeakly Jenny patted one of Dee\u0027s hightops. \"I\u0027m terrific, thanks.\"\u003c/p\u003e\n\u003cp\u003e\"I shouldn\u0027t have let you be last. I forgot.\"\u003c/p\u003e\n\u003cp\u003eJenny sat up and wiped her forehead. \"I did fine by myself.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, you did. You seem to be doing a lot of that these days.\"\u003c/p\u003e\n\u003cp\u003eJenny was very happy.\u003c/p\u003e\n\u003cp\u003eThen it hit her. They were across. They\u0027d made it.\u003c/p\u003e\n\u003cp\u003eTom.\u003c/p\u003e\n\u003cp\u003eShe looked up so fast her vision swam.\u003c/p\u003e\n\u003cp\u003eAfter the alien grandeur of the place between the worlds, it was something of a comedown. They were on the central island in the artificial lake at Joyland Park. The lighthouse looked the same as it had all night, white and shining. The park around them was a riot of lights-but ordinary lights, illuminating ordinary rides like the SuperLooper and the Tumble-bug. Everything looked very ordinary.\u003c/p\u003e\n\u003cp\u003eBehind her, the bridge arched gracefully over the lake water, and the water reflected a wavering arch back. There was no mist, and no sign of any other worlds. The top of the arch wasn\u0027t more than forty feet high.\u003c/p\u003e\n\u003cp\u003e\"A hallucination, I guess,\" Audrey said slowly. \"One of Julian\u0027s things. And I suppose it must have been from me, since I\u0027m the only one who knew about those other worlds.\"\u003c/p\u003e\n\u003cp\u003eJenny opened her mouth, then shut it again. She thought Audrey must be right-but she wasn\u0027t sure. And the truth was that they would probably never be sure.\u003c/p\u003e\n\u003cp\u003eShe looked back at the lighthouse. \"Come on, people. This is it.\"\u003c/p\u003e\n\u003cp\u003eWhen she got up her legs were shaky, but she took the lead and Dee let her.\u003c/p\u003e\n\u003cp\u003eThe lighthouse looked bigger as they got closer. It\u003c/p\u003e\n\u003cp\u003ewas life-size, with a widow\u0027s walk around the top and a weathercock. And it was attached to some broad dark building that Jenny hadn\u0027t seen before because it wasn\u0027t lit up. A restaurant, maybe, she thought.\u003c/p\u003e\n\u003cp\u003eThere was a wooden door in the lighthouse\u0027s side, with a large iron handle.\u003c/p\u003e\n\u003cp\u003e\"Monster positions,\" Dee reminded Jenny as she reached for the handle. Then Dee stood ready to kick the door shut if anything unfriendly was behind it.\u003c/p\u003e\n\u003cp\u003e\"Tom and Zach will be at the top, of course,\" Michael said, resting with his hands on his thighs in anticipation.\u003c/p\u003e\n\u003cp\u003eBut they weren\u0027t.\u003c/p\u003e\n\u003cp\u003eIt was funny, how the end began. Jenny had been waiting for so long, working and fighting, and all the time waiting for the moment that she would see Tom. She was so used to waiting she wasn\u0027t really ready for it to end. She wasn\u0027t-prepared.\u003c/p\u003e\n\u003cp\u003eShe almost couldn\u0027t deal with it.\u003c/p\u003e\n\u003cp\u003eBut when it started happenings it happened fast, and prepared or not, she was thrown into it.\u003c/p\u003e\n\u003cp\u003eShe pulled on the iron handle, and the wooden door swung open. There was no need for Dee to kick it shut. Everything inside was illuminated, and nothing came rushing toward them.\u003c/p\u003e\n\u003cp\u003eBlack metal stairs curved up on Jenny\u0027s left, circling upward toward the top of the lighthouse. But straight in front of her she could see the interior of the broad building. The lighthouse had no back wall, and opened right into it.\u003c/p\u003e\n\u003cp\u003eIt was a wonderful place, with a huge diorama two stories high as a backdrop. It looked like a movie set\u003c/p\u003e\n\u003cp\u003eof a wharf scene, but the numbered flags on poles betrayed its real purpose. It was an indoor miniature golf course.\u003c/p\u003e\n\u003cp\u003e\"Treasure Island,\" Michael said, peering around her shoulder. \"Pirates, see?\"\u003c/p\u003e\n\u003cp\u003eIt was pirates. The diorama featured a mural painted on the far wall of the broad building, a marvelously realistic mural with a volcano in the background. Painted smoke and little neon lights for sparks showed that it was erupting. There was also a mammoth storm in the painted sky, and forked lightning that really flashed.\u003c/p\u003e\n\u003cp\u003eAt the bottom of the mural, just behind the golf course itself, two dinghies were landing on some fiberglass rocks. One boat was painted, with a pirate in an eye patch and hat, a lace cravat, and boots.\u003c/p\u003e\n\u003cp\u003eThe other boat was real, with Tom and Zach.\u003c/p\u003e\n\u003cp\u003eJenny touched her mouth. Then she was running.\u003c/p\u003e\n\u003cp\u003eThere weren\u0027t any words for what she felt next. When she\u0027d been separated from Tom in the paper house, it had been for hours. This time it had been days. She was exhausted, overstressed, starving, on the verge of collapse-and she\u0027d never been so happy in her life.\u003c/p\u003e\n\u003cp\u003eJust the sight of him brought back everything that was good and homelike to her mind. It was like coming back to her own room after being away a long time with strangers.\u003c/p\u003e\n\u003cp\u003eIt was where she belonged.\u003c/p\u003e\n\u003cp\u003eShe threw her arms around him. And then she just held on, her heart pounding and pounding.\u003c/p\u003e\n\u003cp\u003e\"Watch out, Jenny. He was here just a minute ago.\"\u003c/p\u003e\n\u003cp\u003eAnd Jenny, who had for so long associated Tom with protection, with safety and security and coziness, found herself feeling passionately protective of Tom. As if he were Summer. Looking into his dear face, handsome and rather brooding just now, and his wonderful green-flecked eyes, she said, \"Don\u0027t worry. I\u0027ll take care of you.\"\u003c/p\u003e\n\u003cp\u003e\"Just let me out, please,\" Tom said sharply, and then gave up and kissed her back. Jenny\u0027s solicitous feelings had thrown her into a perfect spasm of love for him, and it felt so good to kiss him again.\u003c/p\u003e\n\u003cp\u003e\"If you two could tear yourself apart for just a minute...\" Zach\u0027s voice said.\u003c/p\u003e\n\u003cp\u003eJenny looked up. Her cousin was in the back of the dinghy, yes, the same cousin she\u0027d lost, she thought a little deliriously. Exactly the same, with his wonderful beaky nose and his ash-blond hair pulled back in a casual ponytail and his keen gray eyes.\u003c/p\u003e\n\u003cp\u003e\"I missed you, too,\" she said and scrambled back to hug him.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re tied up,\" Tom said briskly.\u003c/p\u003e\n\u003cp\u003eJenny saw that his brown wrists were tied behind his back with some kind of thick cord. \"No problem,\" she said, just as briskly, and pulled out the Swiss Army knife. I\u0027ll never go anywhere without one again, she thought, and, crouching by Zach\u0027s feet, she began carefully sawing at the cord.\u003c/p\u003e\n\u003cp\u003e\"Hi, Dee,\" Tom said, calm as if he were meeting her Saturday at the ball game. \"Hey, Audrey, Mi-\" He broke off and bolted upright, and Jenny cut his hand.\u003c/p\u003e\n\u003cp\u003e\"Sit down,\" she said.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t seem to notice. \"Summer?\"\u003c/p\u003e\n\u003cp\u003e\"Hi, Tom,\" Summer said shyly.\u003c/p\u003e\n\u003cp\u003e\"Summer?\"\u003c/p\u003e\n\u003cp\u003e\"She wasn\u0027t dead, just asleep,\" Audrey said.\u003c/p\u003e\n\u003cp\u003eJenny said, \"Sit down, will you? We\u0027ll explain later.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah-sure,\" Tom said weakly. He sat down. Jenny finished cutting the cord enough so that he could pull out of it. Then, while he was rubbing his hands, she turned to Zach.\u003c/p\u003e\n\u003cp\u003e\"Are you both okay?\" she added. \"I mean-not hurt or anything?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re fine,\" Tom said absently. \"He just put us here a little while ago. We were in the lighthouse, before, and it wasn\u0027t too bad-except I was afraid you\u0027d come.\"\u003c/p\u003e\n\u003cp\u003e\"You knew I\u0027d come. I hope.\"\u003c/p\u003e\n\u003cp\u003e\"I hoped you wouldn\u0027t. I was afraid you would.\"\u003c/p\u003e\n\u003cp\u003e\"Tom\"-a strand on Zach\u0027s cord sprang apart- \"you don\u0027t have to worry about me.\" She looked up to find him looking down at her, in that new way, the way he had since the end of Julian\u0027s first Game. As if she were something infinitely precious, something that bewildered him, but amazed him-something he didn\u0027t deserve, but trusted.\u003c/p\u003e\n\u003cp\u003e\"Sure I have to worry about you, Thorny,\" he said simply. \"Just like you worry about me.\"\u003c/p\u003e\n\u003cp\u003eJenny smiled.\u003c/p\u003e\n\u003cp\u003e\"Nobody needs to worry right now. We\u0027ve won the Game, Tom. We went on the treasure hunt and now we\u0027ve found you. It\u0027s all over.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll still be happier out of here,\" he said, and Zach said, \"That goes for me doubled, tripled, and quadrupled.\"\u003c/p\u003e\n\u003cp\u003eJenny glanced around. She supposed it was a spooky place in a way-if you were sitting and anticipating trouble. There were real cave entrances below the mural, leading to other parts of the miniature golf range. There were mock buildings holding the same thing-golf holes-with names like Lafitte\u0027s Black Powder Works. It was dark inside all these places.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t tell me. You guys were afraid of the parrot,\" Michael said. Jenny followed his gaze to a section of the building beside the golf course, apparently an area for eating, because there were orange plastic tables and stools bolted to the ground. There was also a small stage with a sign that read: cap\u0027n bill\u003c/p\u003e\n\u003cp\u003eAND SEBASTIAN, THE WONDER PARROT. AlSO a mounted TV showing Woody Woodpecker cartoons, mercifully silent.\u003c/p\u003e\n\u003cp\u003e\"No, we were afraid of the eyes,\" Tom said, stepping out of the dinghy and over a length of thick rope that sagged between two wharf pillars.\u003c/p\u003e\n\u003cp\u003eJenny\u0027s head snapped up. \"The eyes?\"\u003c/p\u003e\n\u003cp\u003e\"The ones that sit in the shadows and look at you. And the whispering.\"\u003c/p\u003e\n\u003cp\u003eJaw squared, Jenny sawed through the last of Zach\u0027s cord and rubbed his wrists. So the other Shadow Men were around.\u003c/p\u003e\n\u003cp\u003eTom was staring at Audrey\u0027s arm. \"What happened to you?\"\u003c/p\u003e\n\u003cp\u003e\"Believe me, you\u0027re happier not knowing.\"\u003c/p\u003e\n\u003cp\u003e\"You guys all look like you\u0027ve been playing with the Raiders-and losing,\" Tom said.\u003c/p\u003e\n\u003cp\u003eIt was true, Jenny thought, following Zach over the rope. The prisoners they\u0027d come to rescue looked fine, just as they had when they\u0027d disappeared behind Julian\u0027s wall of fire. A little crumpled and stained about the clothes, but otherwise fine. Zach still had his 35 millimeter camera around his neck.\u003c/p\u003e\n\u003cp\u003eIt was the rescuers who were bloody and battered. Even Summer looked wounded, like a broken-stemmed flower. Audrey, usually the picture of elegance, looked more like a young hiker who\u0027d been in a bad accident. Dee\u0027s jeans were stained dark at the thigh. Michael looked as if he\u0027d been ducked in swamp water and then tumble-dried.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve been through a lot,\" Zach said, and for once his gray eyes weren\u0027t cool or unreadable. \"Thanks, Jenny.\"\u003c/p\u003e\n\u003cp\u003eJenny waved dismissively, but she felt a glow inside. \"What happened back there in the fire, anyway? One minute I was holding your hand, the next...\"\u003c/p\u003e\n\u003cp\u003e\"I fell,\" Zach said. \"Pure dumb luck. I tripped, and when I got up, I didn\u0027t know which way to go. I stumbled around and ended up back in Julian\u0027s base.\"\u003c/p\u003e\n\u003cp\u003e\"Out of the fire, into the frying pan,\" Michael said.\u003c/p\u003e\n\u003cp\u003e\"And then Tom came back for me.\" Zach looked at Tom, and something passed between them without words. The introverted photographer and the star athlete had never been particularly close before, but Jenny had the feeling that that had changed now. She was pleased.\u003c/p\u003e\n\u003cp\u003e\"Aww,\" Michael said.\u003c/p\u003e\n\u003cp\u003eAudrey said, \"Shut up-mon cher.\"\u003c/p\u003e\n\u003cp\u003eDee interrupted. \"Here\u0027s a map of the park.\" The\u003c/p\u003e\n\u003cp\u003emap was wood, painted to look like parchment, with iron chains around it.\u003c/p\u003e\n\u003cp\u003e\"It is an amusement park, then. We could see some of it out the lighthouse window,\" Tom said. \"Okay, look, here\u0027s my plan....\"\u003c/p\u003e\n\u003cp\u003eHis voice trailed off. Audrey, Michael, Dee, and Summer weren\u0027t looking at him. Instead, they were looking at Jenny expectantly.\u003c/p\u003e\n\u003cp\u003eTom looked at Zach, who was standing with his arms folded, something like amusement in his sharp-featured face.\u003c/p\u003e\n\u003cp\u003e\"Okay, uh-why don\u0027t you tell us your plan?\" Tom said to Jenny.\u003c/p\u003e\n\u003cp\u003eJenny was fighting amusement, too. \"I don\u0027t have one. We don\u0027t need one. We\u0027ve won, and we ought to be able to just walk out of here. The only thing I don\u0027t understand is why Julian hasn\u0027t shown up.\"\u003c/p\u003e\n\u003cp\u003eThey all looked at the various dark doorways and crevices.\u003c/p\u003e\n\u003cp\u003e\"Do you think maybe-he\u0027s watching us?\" Summer said.\u003c/p\u003e\n\u003cp\u003e\"Of course I\u0027m watching; that\u0027s what I do,\" a weary voice said. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-forbidden-game-the-kill-the-forbidden-game-3/page-13.html","bookId":2101,"creation":"Oct 5, 2019 5:46:09 PM","modification":"Oct 5, 2019 5:46:09 PM"}
