{"id":90982,"no":16,"title":"Page 16","content":"\u003cp\u003eThe elemental energy, the quicksilver brightness, was gone from Julian\u0027s figure. Jenny was still holding his hand, but it suddenly seemed less substantial. She held tighter-and her fingers met.\u003c/p\u003e\n\u003cp\u003eJulian\u0027s body was dissolving into mist and shadows. In a moment even those had disappeared.\u003c/p\u003e\n\u003cp\u003eJust like that. Like smoke up a chimney.\u003c/p\u003e\n\u003cp\u003eJenny sat back on her heels.\u003c/p\u003e\n\u003cp\u003eThen, slowly at first, but more quickly with each step, her friends gathered around her. Jenny felt Tom\u0027s arms, and felt that he was shaking.\u003c/p\u003e\n\u003cp\u003eShe buried her head in his shoulder and held him as he held her.\u003c/p\u003e\n\u003cp\u003eIt was Audrey and Michael who were the most helpful in what had to be done next. There were a lot of practical things to be handled.\u003c/p\u003e\n\u003cp\u003eHere in Pennsylvania the sun was just rising, and home in California it was 3:00 in the morning. Audrey and Michael went next door and woke the neighbors up and asked if they could use a phone.\u003c/p\u003e\n\u003cp\u003eThen Audrey called her parents and woke them up, and asked if they could please wire some money. And Michael called his father and woke him up, and asked him to explain to everybody else\u0027s parents that all the kids were safe.\u003c/p\u003e\n\u003cp\u003eThat was something for Jenny to hang on to, once Audrey and Michael had reported back. The thought that Michael\u0027s father would be calling Mr. and Mrs. Parker-Pearson and telling them Summer was coming home. Michael\u0027s father was a writer and slightly odd, but an adult, and therefore somewhat credible. Maybe they would even believe him.\u003c/p\u003e\n\u003cp\u003eJenny really couldn\u0027t wait to see Summer\u0027s little brother\u0027s face.\u003c/p\u003e\n\u003cp\u003eAnd she wanted to see her parents, too, and her own little brother.\u003c/p\u003e\n\u003cp\u003eThere were other things. Angela, P.C.\u0027s almost-girlfriend, who would have to be told that P.C. was really and truly dead. And there would be the police to deal with again, and impossible questions to answer.\u003c/p\u003e\n\u003cp\u003eBut she couldn\u0027t think about all that now. She was still thinking about Julian.\u003c/p\u003e\n\u003cp\u003eNothing died if it wasn\u0027t forgotten-and she would never forget him. There would always be some part of him in her mind. Because of him, all her life she\u0027d be more sensitive to the beauty of the world. To its-sensuality and immediacy. Julian had been a very immediate person.\u003c/p\u003e\n\u003cp\u003eThe most extraordinary person she would ever meet, Jenny thought. Whimsical, quixotic, wild-impossible.\u003c/p\u003e\n\u003cp\u003eHe had been so many things. Seductive as silver and deadly as a cobra. And vulnerable like a hurt child underneath it all.\u003c/p\u003e\n\u003cp\u003eLike a hurt child who could strike out with lethal accuracy, Jenny thought as she watched Audrey moving slowly around the living room, tidying things. He\u0027d hurt Audrey badly, and if he hadn\u0027t quite killed Summer, it had been close. He\u0027d let his Shadow Animals kill Gordie Wilson, who\u0027d only been guilty of skipping school and killing rabbits.\u003c/p\u003e\n\u003cp\u003eThe truth was that Julian had probably been too dangerous to live. The universe would be a much safer place without him.\u003c/p\u003e\n\u003cp\u003eBut poorer. And more boring, definitely more boring.\u003c/p\u003e\n\u003cp\u003eIt was Summer who said the astonishing thing.\u003c/p\u003e\n\u003cp\u003e\"You know,\" she said, after twisting around on the living room couch to see if the cab was coming, \"Julian said the world was evil and horrible-remember? But then he proved himself that it wasn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eJenny came out of her own thoughts and looked at Summer, amazed. That was it, exactly, of course. And that was why she could go on living, and even look forward to things. In a universe where that could happen, you had to go on living and hoping and doing your best. In a universe where that could happen, anything was possible.\u003c/p\u003e\n\u003cp\u003eThat was Julian\u0027s real gift, she thought.\u003c/p\u003e\n\u003cp\u003eBut there was another one, too, and she saw it as she looked at the others. They had all changed-Julian had changed them. Like the rune Dagaz, the catalyst, he\u0027d transformed everyone who met him.\u003c/p\u003e\n\u003cp\u003eAudrey and Michael-look at them. They were walking around holding hands. Audrey hadn\u0027t even bothered to put her hair up. Michael was patting her shoulder protectively.\u003c/p\u003e\n\u003cp\u003eAnd Dee and Audrey had been enemies a month ago. After tonight, Jenny didn\u0027t think they could ever be that way again.\u003c/p\u003e\n\u003cp\u003eZach, now-Zach was looking at Summer with puzzled interest in his keen gray eyes. Like a scientist who finds himself unexpectedly fascinated by a new form of flower.\u003c/p\u003e\n\u003cp\u003eWon\u0027t last a week, Jenny thought. But it was good for Zach to notice girls, just the same. To have a human interest, something besides his own imagination and his photographs.\u003c/p\u003e\n\u003cp\u003eJulian had taught Zach that imagination wasn\u0027t always better than reality.\u003c/p\u003e\n\u003cp\u003eSummer is different, too, Jenny thought. She\u0027s not half as muddled as she used to be. That\u0027s why Zach\u0027s staring.\u003c/p\u003e\n\u003cp\u003eNow, Dee...\u003c/p\u003e\n\u003cp\u003eJenny turned to look at her friend.\u003c/p\u003e\n\u003cp\u003eDee was sitting instead of pacing, with one long leg stretched in front of her. She was looking very thoughtful, her head bent, her thickly lashed eyes narrowed.\u003c/p\u003e\n\u003cp\u003eWell, Dee was Dee, and would never change, Jenny thought lovingly.\u003c/p\u003e\n\u003cp\u003eBut she was wrong. As she watched, Dee looked up at her and smiled.\u003c/p\u003e\n\u003cp\u003e\"You know, I\u0027ve been thinking. And I was thinking-it would mean a major change of plans, you see. It would mean a lot of studying, and I hate studying.\"\u003c/p\u003e\n\u003cp\u003eShe stopped, and Jenny blinked, then leaned forward.\u003c/p\u003e\n\u003cp\u003e\"Dee?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m thinking of maybe going to college after all. Maybe. I\u0027m just barely entertaining the idea.\"\u003c/p\u003e\n\u003cp\u003eDee had changed, too.\u003c/p\u003e\n\u003cp\u003e\"Aba would be happy,\" Jenny said, and then she dropped it, because she was afraid that Dee would turn balky. Dee really hated being pushed.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your own choice,\" was all she added.\u003c/p\u003e\n\u003cp\u003e\"Yes, it is. Everything really is, isn\u0027t it? Our own choice.\"\u003c/p\u003e\n\u003cp\u003eJenny looked down at the gold ring on her finger, then clasped her other hand over it. \"A lot is.\"\u003c/p\u003e\n\u003cp\u003eAnd Tom was different-the fact that Jenny was wearing that ring showed how different. He hadn\u0027t said a word about it; she didn\u0027t even think he minded.\u003c/p\u003e\n\u003cp\u003eHe understood.\u003c/p\u003e\n\u003cp\u003eIf he hadn\u0027t, Jenny could never have been happy. As it was, she knew he wouldn\u0027t hate her if she tried to dream Julian into a wonderful dream. He might not want to hear about it, but he wouldn\u0027t be upset.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t take her for granted anymore, and he didn\u0027t need to be possessive, either. Jenny thought that maybe he had changed the most of all.\u003c/p\u003e\n\u003cp\u003eOr maybe she had.\u003c/p\u003e\n\u003cp\u003e\"The cab\u0027s here,\" Michael said. \"Okay, so first we\u003c/p\u003e\n\u003cp\u003ehave to go to the doctor... .\" He stared at a scribbled list.\u003c/p\u003e\n\u003cp\u003e\"No, first we go to the Western Union office, then the doctor,\" Audrey said, taking the list from him. \"Then-\"\u003c/p\u003e\n\u003cp\u003e\"Then we eat,\" Michael said.\u003c/p\u003e\n\u003cp\u003e\"Apres vous,\" Dee said, gesturing them through the door. When Audrey hiked a copper eyebrow at her, she grinned. \"I can throw those fancy words around, too. Bonjour. O solo mio. Gesundheit.\"\u003c/p\u003e\n\u003cp\u003e\"D\u0027accord,\" Audrey said and grinned back at her.\u003c/p\u003e\n\u003cp\u003eZach and Summer went out. Jenny stopped for just an instant on the threshold, long enough to look back.\u003c/p\u003e\n\u003cp\u003eThe hallway was empty, the door to the basement was shut. That was good. If any adults would listen to Jenny, she would have them make sure that door was never opened again.\u003c/p\u003e\n\u003cp\u003eShe turned and went outside.\u003c/p\u003e\n\u003cp\u003eAs they headed for the cab, Michael said the kind of thing that only Michael could say. The kind of thing that came from having a science fiction author as a dad.\u003c/p\u003e\n\u003cp\u003e\"Look. What if-someday-somebody carved Julian\u0027s name back onto that runestave?\" he said.\u003c/p\u003e\n\u003cp\u003eTom stopped dead on the lush green grass for a moment. Then he started walking again, as Jenny put an arm through his. \"Don\u0027t even talk about it,\" he said. \"It\u0027ll never happen.\"\u003c/p\u003e\n\u003cp\u003e\"No, I guess not. Just as well.\"\u003c/p\u003e\n\u003cp\u003eAnd Jenny, her arm entwined with Tom\u0027s, agreed -but, deep inside, some tiny part of her wondered.\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t give in to the twinge of wistful sorrow she felt-she had a life to build. Things to consider. She couldn\u0027t just follow Tom to college now. She had to find out what she wanted to do with herself.\u003c/p\u003e\n\u003cp\u003eWhat do I like? she thought. Swimming. Computers. Cats. Helping people. Kids. Flowers.\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t know how she was going to put all those together-she\u0027d have to find a way. After all, she was Jenny Thornton, her only master.\u003c/p\u003e\n\u003cp\u003eBut just before she got into the cab, she looked up at the Pennsylvania sky. It was so blue-a bluer blue than California skies ever were in the morning. A beautiful, luminous color that seemed filled with promise.\u003c/p\u003e\n\u003cp\u003eIf, someday, Julian should be reborn, she wished him well.\u003c/p\u003e\n\u003cp\u003e[The End] \u003c/p\u003e","sourceLink":"https://allnovel.net/the-forbidden-game-the-kill-the-forbidden-game-3/page-16.html","bookId":2101,"creation":"Oct 5, 2019 5:46:09 PM","modification":"Oct 5, 2019 5:46:09 PM"}
