{"id":90968,"no":2,"title":"Page 2","content":"\u003cp\u003eWhy hadn\u0027t she thought of this? Her grandfather had probably always had that alarm system-but it wasn\u0027t the kind of thing a kid would notice.\u003c/p\u003e\n\u003cp\u003eBut I\u0027m not a kid anymore. I should have thought now.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s got to be a way to get in,\" Dee was saying.\u003c/p\u003e\n\u003cp\u003e\"Why?\" Audrey\u0027s voice was snappish-because she felt bad, Jenny knew. Because she was scared.\u003c/p\u003e\n\u003cp\u003e\"There doesn\u0027t always have to be a way just because you want one, Dee.\"\u003c/p\u003e\n\u003cp\u003eThink, Jenny. Think, think, think. You forgot the alarmis there anything else you\u0027ve forgotten?\u003c/p\u003e\n\u003cp\u003e\"If we\u0027re going to get philosophical-\" Michael began.\u003c/p\u003e\n\u003cp\u003e\"Mrs. Durash,\" said Jenny.\u003c/p\u003e\n\u003cp\u003eThey all looked at her.\u003c/p\u003e\n\u003cp\u003e\"She was my grandfather\u0027s housekeeper. Maybe she still takes care of the place. Maybe she has a key.\"\u003c/p\u003e\n\u003cp\u003e\"Brilliant!\" Dee said and finally removed the crowbar.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve got to find her telephone number-oh, God, if she still even lives here. There should be a phone at-at-oh, I guess the dairy bar. It\u0027s that way, I think. It\u0027s a long walk.\"\u003c/p\u003e\n\u003cp\u003eMichael looked cagey. \"I\u0027ll stay here and guard the bags.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll come with us, and like it,\" Audrey said. \"We can hide the bags in the bushes.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, dear,\" Michael muttered. \"Yes, dear, yes, dear...\"\u003c/p\u003e\n\u003cp\u003ePetro\u0027s Dairy Bar, like everything they had passed on the way, had an air of gently going to seed. Jenny stepped into the blue-and-white metal booth outside and was relieved to find a phone book dangling from a chain. She balanced it on her knee and thumbed pages.\u003c/p\u003e\n\u003cp\u003e\"Yes! B. Durash-there can\u0027t be another Durash in Monessen. It\u0027s got to be her.\"\u003c/p\u003e\n\u003cp\u003eShe stuck in a quarter and dialed before she realized she hadn\u0027t planned out what to say.\u003c/p\u003e\n\u003cp\u003e\"Hello.\" The voice on the other end made the word sound almost like yellow. There was a faint accent, earthy, not as slow as a drawl.\u003c/p\u003e\n\u003cp\u003e\"Hi. Hi. Uh, this is Jenny Thornton and-\" Debate team, Jenny thought. Vacation, hometown, late spring break-parents. Where are my parents supposed to be?\u003c/p\u003e\n\u003cp\u003e\"Is this Mrs. Durash?\" she blurted.\u003c/p\u003e\n\u003cp\u003eThere was a pause that seemed very long. Then: \"Mrs. Durash isn\u0027t here right now. This is her daughter-in-law.\"\u003c/p\u003e\n\u003cp\u003e\"Oh ... but she does live there? Mrs. Durash? And-look, okay, do you happen to know if she\u0027s the same Mrs. Durash that worked for Mr. Eric Evenson?\" I am making a total fool of myself, Jenny realized, staring at the graffiti on the glass door.\u003c/p\u003e\n\u003cp\u003eAnother pause. \"Ye-e-es, she\u0027s the caretaker for the Evenson house.\"\u003c/p\u003e\n\u003cp\u003eWonderful! Caretakers had to have keys. Jenny was so buoyed up that she forgot about making a fool of herself.\u003c/p\u003e\n\u003cp\u003e\"Thank you-that\u0027s great. I mean-it\u0027ll be really great to talk to her. Do you know when she\u0027ll be back?\"\u003c/p\u003e\n\u003cp\u003e\"She always goes over to her son\u0027s in Charleroi on Saturday. She\u0027ll be back around seven. Call then.\"\u003c/p\u003e\n\u003cp\u003e\"Seven p.m.?\" Michael said bitterly when Jenny repeated the conversation. He flopped onto the splintered green bench against the dairy bar wall. \"And we have to wait outside until then. I\u0027m not walking back until I get some ice cream.\"\u003c/p\u003e\n\u003cp\u003e\"Money,\" Audrey said with a toss of her copper head.\u003c/p\u003e\n\u003cp\u003eA bus roared up to the corner. Jenny stared at it absently as she thought. Nine hours to kill. They\u0027d be conspicuous in this little town. They\u0027d have to hide in her grandfather\u0027s backyard or-Something on the side of the bus came into focus.\u003c/p\u003e\n\u003cp\u003eJOYLAND PARK, ROLLER COASTER CAPITAL OF THE world. The poster was illustrated with roller coasters and merry-go-rounds.\u003c/p\u003e\n\u003cp\u003eThe wooden bench seemed to drop away beneath Jenny.\u003c/p\u003e\n\u003cp\u003eWhen she could breathe again, the bus was revving its engine to drive away. Jenny made her decision in an instant.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go!\"\u003c/p\u003e\n\u003cp\u003eDee bounded up, ready at once. Michael leaned his head against the wall and shut his eyes. Audrey said, \"Where?\"\u003c/p\u003e\n\u003cp\u003e\"On that bus. Come on, quick!\" Jenny ran up and grabbed the dusty glass door before it could straighten shut. \"Do you go to Joyland Park?\" she shouted.\u003c/p\u003e\n\u003cp\u003e\"Clairton, Duquesne, West Mifflin-West Mifflin\u0027s Joyland,\" he said laconically.\u003c/p\u003e\n\u003cp\u003e\"Right. Four, please.\"\u003c/p\u003e\n\u003cp\u003eThe others straggled up the steps. The bus was almost empty and smelled like old tires. They sat on the torn leather seats in the very back, and Audrey looked at Jenny.\u003c/p\u003e\n\u003cp\u003e\"Now will you please explain where we\u0027re going?\"\u003c/p\u003e\n\u003cp\u003e\"Joyland Park,\" Jenny said a little breathlessly.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Cause they\u0027ve got corn dogs,\" Michael said, very quietly.\u003c/p\u003e\n\u003cp\u003eJenny looked Audrey straight in the eye. \"Did you see that poster on the side of the bus? It was in my dream. I had a dream on the plane, while Michael was dreaming about Summer, and that poster was in it.\"\u003c/p\u003e\n\u003cp\u003eAudrey considered, teeth set in her cherry-glossed lower lip. \"It might be perfectly natural. You might have had the park on your mind, since you were coming back here and all.\"\u003c/p\u003e\n\u003cp\u003e\"Or it might be something else,\" Jenny said. \"Like -I don\u0027t know, some kind of a message.\" She shifted. \"Look, do any of you ever wonder if-well, if Summer is really dead?\"\u003c/p\u003e\n\u003cp\u003eAudrey looked shocked. Dee said dryly, \"We\u0027ve been telling the police so for a month.\"\u003c/p\u003e\n\u003cp\u003eBut Michael, eyes round and thoroughly awake now, said, \"She was alive in my dream. She talked just like her.\"\u003c/p\u003e\n\u003cp\u003eJenny felt uneasy. \"What did she say?\"\u003c/p\u003e\n\u003cp\u003e\"She was mad at us for leaving her. She was scared.\"\u003c/p\u003e\n\u003cp\u003eJenny felt even more uneasy. Audrey said, \"So you think maybe both dreams were connected or something? And that it was some kind of a message?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. It\u0027s so complicated. And I don\u0027t even know why anyone could possibly want to send us to an amusement park... .\" She could feel herself deflating.\u003c/p\u003e\n\u003cp\u003e\"Never mind.\" Dee grinned wickedly and thumped her on the back. \"You went with your instinct; that can\u0027t be wrong. And even if it wasn\u0027t a message-so what? It\u0027s an amusement park. Good, clean fun. Right, guys?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d rather go shopping,\" Audrey said. \"But it\u0027s a way to kill the time.\"\u003c/p\u003e\n\u003cp\u003eMichael slumped and jammed his knees against the battered metal seat in front of him. \"And kill our money. Did I ever tell you about this amusement park nightmare I had when I was a kid-?\"\u003c/p\u003e\n\u003cp\u003e\"Shut up, Michael,\" three female voices chorused, and he shut up.\u003c/p\u003e\n\u003cp\u003eIt was a long, rather lonely drive to West Mifflin. Joyland Park seemed to be one of the few places still in business in a rundown and isolated area. It was almost a surprise to find it out here, in the middle of nowhere.\u003c/p\u003e\n\u003cp\u003eMichael made an inarticulate noise of awe as they filed off the bus. \"Good grief,\" he said mildly. \"It\u0027s Noah\u0027s Ark.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the fun house,\" Jenny said. \"You go in the whale by the side there.\"\u003c/p\u003e\n\u003cp\u003eEven in the bright sunshine she felt strange as they walked through the gates. Maybe because it\u0027s changed, she told herself. This place really had changed. The fun house was the same, but a lot of other things were different.\u003c/p\u003e\n\u003cp\u003eThe old train ride roller coaster was gone, and there was a mine ride called the Pit in its place. There was a new metal coaster called the Steel Demon and a new water ride-the kind where you slosh around in giant inner tubes.\u003c/p\u003e\n\u003cp\u003eThe biggest shock was the new arcade. It was full of shining video games, holograms, virtual reality. Jenny missed the old penny arcade, which had been dark and somewhat spooky, filled with machines from the turn of the century. Ancient, beautifully carved wood and genuine brass-not this steel and neon stuff.\u003c/p\u003e\n\u003cp\u003eBut as time passed, she felt less anxious. She couldn\u0027t help it-the park was irresistible. She breathed in the smell of popcorn and ride-grease- and something else, something that was like a smell, but wasn\u0027t. A cotton-candy feeling of excitement.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see why Summer would want us to come here,\" Audrey said when they stopped to buy corn dogs.\u003c/p\u003e\n\u003cp\u003e\"No. I don\u0027t think it was a message after all.\" Jenny was glad to say it. Whatever horrible things they might have to face that night, they could enjoy themselves now.\u003c/p\u003e\n\u003cp\u003eMichael\u0027s blissful corn-dog smile broke up for a moment. \"Maybe it\u0027s better that way,\" he said indistinctly. \"I\u0027d rather be dead than be what Summer was in that dream.\"\u003c/p\u003e\n\u003cp\u003eThey went on the roller coasters, screaming, Jenny\u0027s loose hair blowing like a banner. The Steel Demon was good, but everyone agreed they liked the creaking, clattering old wooden coasters best. \"Scarier,\" Dee said with relish. \"Could break any minute -it feels like \"\u003c/p\u003e\n\u003cp\u003eThe mine ride was supposed to be scary. \"This is a gold mine?\" Audrey asked skeptically while lights strobed wildly to simulate dynamite exploding.\u003c/p\u003e\n\u003cp\u003e\"Use your imagination,\" Michael said, slipping an arm around her.\u003c/p\u003e\n\u003cp\u003eJenny looked away. It made her so homesick for Tom that she had to hold her eyes wide open and blinking, willing the tears back where they belonged.\u003c/p\u003e\n\u003cp\u003eThe fun house really was scary. A barrel-shaped brick \"wall\" revolved around them until nobody but Dee could walk straight. The floor shifted and swayed until Michael threatened to sue-or throw up.\u003c/p\u003e\n\u003cp\u003e\"C\u0027mere,\" Dee said gleefully, beckoning Jenny closer. Behind a glass wall a red figure was vaguely visible. As Jenny stepped up to look, the scene went dark. She leaned forward, her nose almost against the glass-and with a terrible yelling sound the figure swooped straight toward her. It rode down a wire, actually striking the glass. Jenny leaped back with a shriek.\u003c/p\u003e\n\u003cp\u003e\"Good, clean fun,\" Dee said, chuckling as Jenny leaned against a wall weakly.\u003c/p\u003e\n\u003cp\u003eJenny made a fist, but just then something about the red figure caught her eye.\u003c/p\u003e\n\u003cp\u003eIt was a red devil, with horns and split hooves and a tail. But its eyes-its eyes were blue. A blue that shone eerily under the black lights. And just before it was drawn back up the wire-it winked at her.\u003c/p\u003e\n\u003cp\u003eJenny\u0027s little fingers started to tingle.\u003c/p\u003e\n\u003cp\u003eAfter that, things in the park seemed wrong. The barker for the ringtoss game seemed to have an odd gleam in his eye. Even Leo the Paper-Eating Lion seemed vaguely sinister.\u003c/p\u003e\n\u003cp\u003e\"What in the name of God is it?\" Michael asked as he sat down heavily on a bench. He was staring at what looked like a car from a circus train, with a red roof and silver bars. Thrust between the bars was a lion\u0027s head, muzzle gaping open in a big friendly smile.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Leo the Paper-Eating Lion!\" The voice was bright and peppy and it came from the muzzle. The timing bothered Jenny; she felt something like the quick cold touch of an ice cube at her neck.\u003c/p\u003e\n\u003cp\u003e\"I eat all kinds of paper,\" the voice continued joyfully. \"I eat cardboard, too. Old gum wrappers, orange peel, popcorn containers. So feed me.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a trash can,\" Dee explained, squatting to look up the lion\u0027s muzzle. \"It sucks stuff up like a vacuum cleaner.\"\u003c/p\u003e\n\u003cp\u003eA mother wheeled a double stroller up to the car. Both kids stared at the lion with hard expressions.\u003c/p\u003e\n\u003cp\u003e\"Want to feed him?\" the mom said.\u003c/p\u003e\n\u003cp\u003eThe kid in front nodded, still unsmiling. She wadded up a paper napkin and threw it at the lion\u0027s mouth.\u003c/p\u003e\n\u003cp\u003e\"No, you have to give it to him. Here.\" The mom retrieved the napkin for the kid. The kid, still unsmiling, leaned forward, hand outstretched.\u003c/p\u003e\n\u003cp\u003e\"I bet I\u0027ll have a tummyache tomorrow!\" Leo caroled.\u003c/p\u003e\n\u003cp\u003eForward, forward-the little hand reaching-\u003c/p\u003e\n\u003cp\u003e\"Leo\u0027s always hungry... .\"\u003c/p\u003e\n\u003cp\u003eJenny jumped up and clapped her hand over the hole in the lion\u0027s muzzle just before the kid\u0027s fingers got there.\u003c/p\u003e\n\u003cp\u003eThe kid stared at her, never changing expression. The mom squeaked.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" Jenny said. Everyone was staring at her, even Dee and Audrey and Michael. She didn\u0027t move her hand. The kid sat back. The mother, after a flummoxed moment, turned the stroller sharply and wheeled it away.\u003c/p\u003e\n\u003cp\u003eThe back of Jenny\u0027s neck was still prickling as she slowly withdrew her hand. She\u0027d been afraid that-what?\u003c/p\u003e\n\u003cp\u003e\"All right,\" she said defiantly to the others. \"So it was a stupid thing to do. So sue me.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re all kind of jumpy-\" Michael began soothingly, and then proved it, by ducking as two small figures charged him with a blood-freezing battle yell.\u003c/p\u003e\n\u003cp\u003eJenny crouched defensively by the lion before she realized that the two figures were children.\u003c/p\u003e\n\u003cp\u003eThey dived under the wrought-iron bench and came up screaming triumph. \"We got it! We got another one!\"\u003c/p\u003e\n\u003cp\u003e\"Got what?\" Dee said, blocking them with her hightop.\u003c/p\u003e\n\u003cp\u003e\"A doubloon, dummy,\" the boy said in friendly tones, holding up something round and shining between dirty-nailed fingers. To Jenny, it looked like one of those chocolate candies covered with cheap gold foil. Then he pointed. \"Cancha read?\"\u003c/p\u003e\n\u003cp\u003eJenny twisted her neck. There was a large billboard behind them. Swashbuckling crimson letters announced:\u003c/p\u003e\n\u003cp\u003eALL-NEW ATTRACTION! COLLECT THREE GOLD DOUBLOONS AND BE THE FIRST TO SET FOOT ON ... TREASURE ISLAND.\u003c/p\u003e\n\u003cp\u003e\"You get three tokens and they letcha in free the day it opens. You get to go over the bridge first. They\u0027ve got \u0027em hidden all over the park.\"\u003c/p\u003e\n\u003cp\u003eSpotting something else interesting, the kids ran away. On the billboard a pirate\u0027s treasure chest slowly opened and shut, like a clam\u0027s shell. Behind it Jenny could see the central island of Joyland Park, a manmade island in an artificial lagoon. The last time\u003c/p\u003e\n\u003cp\u003eJenny had been here, it had been a sort of stage, with acrobatic shows and bands. Now it was clearly under construction, with a tall lighthouse in the middle. She couldn\u0027t see any bridge to it.\u003c/p\u003e\n\u003cp\u003eWhy should that make her feel uneasy?\u003c/p\u003e\n\u003cp\u003e\"Just pop those discards in my mouth! Leo\u0027s waiting...\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go,\" Jenny said. Her stomach was churning and she felt she had to distract herself. \"Let\u0027s do something stupid-something kiddie. Let\u0027s go fishing.\"\u003c/p\u003e\n\u003cp\u003eDark water swirled around and around a channel at the Fish Pond booth. \"Like a sushi bar,\" Michael said, watching the water come in one side and go out the other. \"You know, those kinds where the plates float around.\"\u003c/p\u003e\n\u003cp\u003eFor a quarter you could dip a line into the water. A claw at the end picked up a number and you got a prize.\u003c/p\u003e\n\u003cp\u003e\"When I was a kid all these prizes seemed like treasure,\" Jenny said. She lowered the claw into the opaque swirl.\u003c/p\u003e\n\u003cp\u003e\"A bite,\" Dee said. She raised her rod. At the end, dripping, was a wooden bar with a number on it. The attendant glanced at it, then tossed it back into the water. He handed Dee a plastic change purse. Pink.\u003c/p\u003e\n\u003cp\u003e\"Just what I always wanted.\"\u003c/p\u003e\n\u003cp\u003eJenny felt a pull on her line, a sharp tug, almost as if it were a live fish on the hook. She lifted it--and gasped.\u003c/p\u003e\n\u003cp\u003eOh, God! Oh, God...\u003c/p\u003e\n\u003cp\u003eBeside her, Michael\u0027s breath hissed in. He was staring, his chocolate-colored eyes wide and frightened.\u003c/p\u003e\n\u003cp\u003eThere was no wooden bar on the end of Jenny\u0027s line. Instead, hanging neatly over one claw of the hook, was a slender, dripping circlet of gold. Jenny didn\u0027t need to look at it twice.\u003c/p\u003e\n\u003cp\u003eIt was the ring.\u003c/p\u003e\n\u003cp\u003eThe ring Julian had given her. The one with seven words inscribed on the inside of the band, where they would rest against her skin and bind her with their magical power.\u003c/p\u003e\n\u003cp\u003eAll I refuse \u0026amp; thee I chuse. Meaning that Jenny refused all the world and chose-him. A promise that Julian had tried to hold her to. She was free of it, now-but the reminder was chilling.\u003c/p\u003e\n\u003cp\u003eShe\u0027d been wrong about them being able to enjoy themselves until tonight. Julian was watching her this minute, the way he\u0027d watched her for years. There was no getting away from him, not here, not anywhere.\u003c/p\u003e\n\u003cp\u003eNothing to do except go and face him.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go home,\" Jenny said, surprised at the steadiness of her own voice. She took the ring off the claw and dropped it into the dark, swirling water.\u003c/p\u003e\n\u003cp\u003eYou-uns want the key?\"\u003c/p\u003e\n\u003cp\u003e\"Well, my parents do. They were kind of jet-lagged so they stayed back at the hotel, you know. They just thought they\u0027d look the place over, you know. Gosh, Mrs. Durash, do you remember that old washing machine that belonged to my great-grandma? And the wringer? That was hysterical, huh, a wringer.\" I\u0027m being winsome, Jenny realized with a jolt. I\u0027m a con artist.\u003c/p\u003e\n\u003cp\u003eA smile softened Mrs. Durash\u0027s thin features. She was a small woman, slight, wearing what Jenny always remembered her wearing: a print dress and a sweater. \"I used to use that washing machine,\" she said warningly. She pronounced it warshing machine.\u003c/p\u003e\n\u003cp\u003e\"I know. That\u0027s what\u0027s so hysterical!\" If I get any cuter, I\u0027m going to throw up, Jenny thought. Oh, Lord-I think I just wrinkled my nose.\u003c/p\u003e\n\u003cp\u003eBut it worked. Mrs. Durash was rummaging in a shiny black purse. \"Let me tell you how to turn off the alarm system.\"\u003c/p\u003e\n\u003cp\u003eJenny let out a silent breath of thanksgiving, and listened as intently as she had to the opening instructions of the PSAT. She went down the porch stairs muttering, \"Three-six-five-five on the pad, then press Enter, Off, Enter. Three-six-five-five, then Enter ...\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve got a time limit,\" she added to the others who were waiting around the corner. \"The last thing she said was to have my parents call her tomorrow, because she didn\u0027t even know we were visiting. When they don\u0027t call, she\u0027s going to know something\u0027s wrong.\"\u003c/p\u003e\n\u003cp\u003e\"But we didn\u0027t get any sleep,\" Michael pointed out. \"And it\u0027s a mile back to your grandfather\u0027s house. At least.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s take a taxi, then,\" Audrey said impatiently.\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t.\" Dee jingled the fanny pack which contained their pooled funds. \"We paid thirteen ninety-five apiece to get into that park, not to mention all the corn dogs Michael ate. We\u0027ve spent all the money that was supposed to last us for days. We\u0027re broke, princess.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my fault,\" Jenny said after the first horrible moment. \"I should have thought. We\u0027ll just have to try to get everything done tonight-once we go, we won\u0027t need to worry about money. Some of us can sleep while the others look through my grandfather\u0027s things-we\u0027ll take turns, okay? And we can eat some of the Power Bars from the camping stuff we brought.\"\u003c/p\u003e\n\u003cp\u003e\"But if we don\u0027t find it tonight-?\"\u003c/p\u003e\n\u003cp\u003e\"We have to,\" Jenny said. \"We\u0027ll do it because we have to, Michael.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-forbidden-game-the-kill-the-forbidden-game-3/page-2.html","bookId":2101,"creation":"Oct 5, 2019 5:46:09 PM","modification":"Oct 5, 2019 5:46:09 PM"}
