{"id":15655,"no":11,"title":"CHAPTER XI. AT THE SAVINGS BANK.","content":"\u0026nbsp;Old Jerry laid down Paul’s coat, and opened the bank book, of which he had just obtained possession. He was eager to ascertain how much Paul had saved up. \n\u003cdiv\u003e\n “Forty dollars!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He could hardly believe his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n How in the world could Paul have managed to save up forty dollars?\n\u003c/div\u003e \n\u003cdiv\u003e\n “Forty dollars!” exclaimed old Jerry, gleefully. “I’m in luck for once. Of course it belongs to me. I am Paul’s guardian, and have a right to his earnings. He shouldn’t have kept it from me. I—I will go to the bank and draw it all tomorrow. Then I will put it in in my own name. That will make it all right.” And old Jerry rubbed his hands joyfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n After this theft, for it can be called by no other name, Jerry did not sleep much. He was too much excited by the unexpected magnitude of his discovery, and by his delight at adding so much to his own hoards. Then, again, he was afraid Paul might wake up, and, discovering his loss, demand from him the restitution of the book.\n\u003c/div\u003e \n\u003cdiv\u003e\n Generally Paul rose at six o’clock, as this enabled him to get his breakfast and get round to the telegraph company at seven. He generally waked about fifteen minutes before the hour, such was the force of habit.\n\u003c/div\u003e \n\u003cdiv\u003e\n This morning he woke at the usual time, but old[63] Jerry had got up softly and left the room twenty minutes before.\n\u003c/div\u003e \n\u003cdiv\u003e\n Turning over, Paul glanced toward the bed in the corner, and was surprised to see no signs of the old man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jerry gone out already!” he said to himself, in amazement “I wonder what’s come over him. I hope he isn’t sick.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul didn’t however borrow any trouble, for he concluded that Jerry had got tired of his bed, and gone out for a morning walk.\n\u003c/div\u003e \n\u003cdiv\u003e\n He lay till seven, and then, throwing off the quilt, rose from the lounge. He was already partly dressed, and only needed to put on his coat. Then, with a cheerful smile, he felt for his bank book, which he had placed in the inside pocket of his coat.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not there!\n\u003c/div\u003e \n\u003cdiv\u003e\n He started, and turned pale.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is my bank book?” he asked himself in alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then it flashed upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Old Jerry has taken it!” he said, sternly, “and has slunk off with it before I am up. That’s why he got up so early. But I’ll put a spoke in his wheel. I’ll go to the bank and give notice that my book has been stolen. He shan’t draw the money on it, if I can prevent it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But Paul was unable to carry out his intention of calling at the bank at the hour of opening, in order to give notice of his loss. On reporting for duty at the telegraph office, he was sent over to Jersey City, where he was detained until eleven o’clock. He felt uneasy, and thought of asking to have some other boy assigned to the duty, but it so happened that the superintendent was not in an amiable frame of mind, and he knew that his request would not be granted.\n\u003c/div\u003e \n\u003cdiv\u003e\n [66]\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, about five minutes after the bank was opened, old Jerry shambled in, and, sitting down at a table, wrote out an order for forty dollars in favor of Book No. 251,610 signing it “Paul Parton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This he took to the desk of the cashier.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Please give me the money on this,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n The cashier eyed him sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you Paul Parton?” he demanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “N-no,” faltered the old man; “I am Paul’s guardian.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you put in this money for him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “N-no.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he write this order?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Jerry would have had no scruples about asserting that it was written by Paul, but he knew that the statement would at once be recognized as false, as he had himself written it in the presence of the cashier.\n\u003c/div\u003e \n\u003cdiv\u003e\n “N-no,” he admitted, reluctantly; “but it makes no difference; Paul is busy, and can’t come. He’s a telegraph boy. H-he wanted me to draw it for him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It will be seen that old Jerry’s conscience was elastic, and that he had no scruple about lying.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That won’t answer,” replied the cashier, eying the old man suspiciously. “It is not according to our rules.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I want to use the money—that is, Paul does,” remonstrated old Jerry, disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That makes no difference.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I’ll get Paul to write an order,” said Jerry, as he left the bank.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That old man stole the boy’s book,” thought the cashier. “Now he is going home to forge an order in the boy’s name.”\n\u003c/div\u003e \n\u003cdiv\u003e\n That is exactly what old Jerry meant to do. He thought it best however, to wait till afternoon.\n\u003c/div\u003e \n\u003cdiv\u003e\n [67]\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, at twelve o’clock, Paul, then for the first time able to get away, hurried into the bank, breathless.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want to give notice that my bank book has been taken,” he said, panting.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your name, please?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Paul Parton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Number of book?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. 251,610.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your book was presented two hours since by an old man, who handed in an order for all the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The perspiration gathered on Paul’s brow.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you give it to him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; it is not according to our rules to pay, except to the written order of the depositor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad of that,” said Paul. “Don’t pay it if he comes again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We will not,” replied the cashier; and Paul left the building feeling greatly relieved.\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Jerry ought to have known that there was very little chance of a forged order being honored, for the bank possessed Paul’s autograph signature on its books, making the fact of the forgery evident at once, but it sometimes happens that men sharp in some matters are very obtuse in others. This was the case with old Jerry in the present instance.\n\u003c/div\u003e \n\u003cdiv\u003e\n About two o’clock he entered the bank once more. Paul had not come home at the noon hour—he seldom did, being in the habit of dining at a restaurant, and the old man thought him still ignorant of the theft. He was anxious to draw the money before the telegraph boy learned that his book had been appropriated.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had prepared an order, having taken one with him in blank, and made it out for forty dollars, signing it “Paul Parton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Armed with this, he walked up to the cashier’s[68] window, and without a word presented it in the book.\n\u003c/div\u003e \n\u003cdiv\u003e\n The cashier recognized him instantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” he said, “what do you want?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The money,” answered the old man, his features working with cupidity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You were here this morning?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y—yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I told you you could not draw out the money on your own order.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is Paul’s order,” returned Jerry, with unblushing falsehood.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he write it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Y—yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you said he was occupied by business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He—he came home at noon, and wrote the order.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is false!” said the cashier, sternly. “The boy has been here to report that his book has been stolen, and forbade us to pay out any money on it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The old man’s face was the picture of dismay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The—there’s some mistake,” he managed to mutter. “It must be some other boy. Paul asked me to draw the money. Besides, it isn’t his money at all. It—it rightfully belongs to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can draw no money on the order which you have forged,” said the cashier, sternly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then give me back the book,” said Jerry, beginning to get frightened.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall retain the book for the rightful owner,” said the official. “And now let me advise you never to come here again on any such errand, or I shall feel it my duty to hand you over to the police.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Without another word old Jerry shambled out of the bank, with a scared look on his face. This reference to the police startled him. It had not occurred to him that he was doing anything of which the law[69] could take cognizance. His exultation of the morning had quite passed away. He had flattered himself that his hoard would increase by forty dollars. Now he had found himself foiled in the attempt to convert Paul’s savings to his own use.\n\u003c/div\u003e \n\u003cdiv\u003e\n About six o’clock Paul returned to the humble home. Old Jerry was resting on the bed in the corner. He looked up nervously as the telegraph boy entered, and saw at once by the expression on Paul’s face that he knew all.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jerry,” said Paul, “why did you take my bank book?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I’m so poor, Paul,” whined Jerry, “I—I needed the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you turned thief,” returned the boy, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The money was mine by right—you shouldn’t have kept it from me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I deny it!” said Paul, with emphasis. “Have you got the book with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “N—no; they wouldn’t give it back to me,” complained Jerry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And they did right. If you ever play such a trick on me again, robbing me in my sleep, I’ll leave you. Suppose I should get hold of your bank book—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I haven’t any money in the bank. I’m so poor!” ejaculated the miser, panic stricken.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have reason to believe you have the bank book in your pocket at this moment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You—you wouldn’t rob me, Paul?” implored Jerry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How can I if you have no bank book? But you can rest easy. I am not in the habit of stealing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He went out to supper, leaving Jerry utterly discomposed. Not only had his plan failed, but his secret had been discovered.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2951/81117.html","bookId":463,"creation":"Aug 2, 2019 7:08:55 AM","modification":"Aug 2, 2019 7:08:55 AM"}
