{"id":15658,"no":14,"title":"CHAPTER XIV. ON THE TRACK OF NUMBER 91.","content":"\u0026nbsp;The policeman’s sudden appearance can be easily explained. He and his family occupied rooms in the same house with Mrs. Barclay, and he happened to be passing the door of her apartment when he heard the cry. \n\u003cdiv\u003e\n “What’s all this?” he demanded once more.\n\u003c/div\u003e \n\u003cdiv\u003e\n “None of your business!” returned Barclay, indignantly. “What call have you to intrude where you’re not wanted?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I often do that,” said the policeman, grimly. “Mrs. Barclay, who is this man?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My husband, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There, do you hear that?” demanded Barclay. “I have a right to be here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What were you about to do to your wife? What made her cry out?” asked the policeman, sharply. “I ask you that question, Mrs. Barclay.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My husband was carrying off that dress to pawn it,” replied the wife. “It does not belong to me, and it would have got me into trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What have you to say to that?” asked the officer, turning to Barclay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My wife would give me no money,” answered Barclay, sullenly, “and I threatened to pawn her dress.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She says it was not her dress.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought it was,” said Barclay.\n\u003c/div\u003e \n\u003cdiv\u003e\n [82]\n\u003c/div\u003e \n\u003cdiv\u003e\n “O, James,” began his wife, but a threatening look from her husband stopped her words.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And then you treated her roughly, it seems!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I didn’t. I just took her by the arm, to stop her getting the dress.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you any complaint to make, Mrs. Barclay?” asked the officer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not if he will give me the dress back. It doesn’t belong to me, and I don’t want to lose it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take the dress,” said Barclay, throwing it down.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mind you make no more trouble,” said the policeman in a warning voice, as he left the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did the cop come from?” asked Barclay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He lives in the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I wish he’d move out of it. Cops are no company for decent people.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It is small wonder that James Barclay did not enjoy the company of a class of men who, first and last, had given him considerable trouble.\n\u003c/div\u003e \n\u003cdiv\u003e\n His wife did not reply, but picked up the rumpled dress and began to smooth it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now, Ellen,” said Barclay, changing his tone out of policy, “I’ll make a bargain with you. I want to go over to New York, and hunt up that telegraph boy. Through him I can track my father and get some money. See, this is all I have in the world,” and he drew out four pennies from his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But the children, James.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The children can get along on half of it. Give me fifty cents, and I will give you ten dollars as soon as I make a raise. That’s pretty good interest, hey, old woman?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Barclay drew from her pocket two silver quarters and handed them to her husband.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There, take them, James,” she said, “and don’t forget your promise. I made that money by hard work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [83]\n\u003c/div\u003e \n\u003cdiv\u003e\n “It will be all right, Ellen,” said Barclay, thrusting the money carelessly into his vest pocket. “You can’t raise a crop without seed, you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He put on his hat and left the house whistling.\n\u003c/div\u003e \n\u003cdiv\u003e\n Arrived in New York, James Barclay lost no time in returning to his father’s old lodgings. Mrs. O’Connor, one of the tenants, chanced to be just coming out of the house with a bundle of clean clothes, which she was about to carry to a customer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Excuse me, ma’am,” said Barclay, politely, for he could be polite when he saw fit, “I believe you knew an old man who moved away from here recently?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Old Jerry? Yes, I knew him well. He lived here ever since I did, and what took him away so sudden I can’t tell.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry not to find him, for I know of something to his advantage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He didn’t leave word where he was going, more’s the pity. I wish he had, for I’d like to have called to see him and the bye some time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There was a boy, then, who lived with him? I believe I have heard him mentioned before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir, and a nice bye he was, and a smart one. He was rale kind to the old man, Paul was, and I don’t think old Jerry could have got along without him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was employed in a store, wasn’t he?” asked Barclay, assuming less knowledge than he possessed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, indade. Paul is a telegraph bye, and has been for ’most two years. He’s a favorite with the company, I’m thinkin’, as he ought to be, for he always attinds to his duties, and is up early and late.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So he’s a telegraph boy!” said Barclay, musingly. “I should like to see him, especially as you speak so well of him. He has a number, hasn’t he? I notice the boys have a number on their caps.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [84]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir. Paul is Number 91.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Number 91?” returned Barclay, briskly. “I think I can remember that. I’m much obliged to you, my good lady.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure, and you’re a very polite gintleman,” said Mrs. O’Connor, who was flattered at being called a lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why shouldn’t I be polite to a lady like you?” said Barclay. “Perhaps you can give me a little more information.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure, and I will if I can, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At what office can I find this Paul—Number 91, as you call him? I should like to speak to him about my aged relative.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t just recollect the number, sir, but the office where Paul goes is on Broadway, same side as the St. Nicholas Hotel, and not far away from it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you very much. You are really the most obliging lady I have met for a long time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure, sir, you flatter me. You must have kissed the blarney stone, I’m a thinkin’!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, ma’am, I haven’t; but I hope I know enough to be polite to a lady. You don’t seem like a stranger to me, for you are the image of a lady I used to know on the other side of the water, the Countess of Galway.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. O’Connor smiled and simpered, for she had never before been compared to a countess.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And can I do any more for you, sir?” she said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, thank you. You have given me all the information I require. Good day!”\n\u003c/div\u003e \n\u003cdiv\u003e\n As Barclay walked away, Mrs. O’Connor followed him with her eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He isn’t dressed very nice,” she said to herself, “but in his manners he’s a perfect gintleman. I’d like to see that Countess of Galway, that I look so much like.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2951/81120.html","bookId":463,"creation":"Aug 2, 2019 7:09:06 AM","modification":"Aug 2, 2019 7:09:06 AM"}
