{"id":15660,"no":16,"title":"CHAPTER XVI. AN UNEXPECTED MEETING.","content":"\u0026nbsp;“Number 91!” ejaculated James Barclay in surprise. \n\u003cdiv\u003e\n The surprise was reflected on Paul’s face when on looking up he recognized James Barclay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think we have met before,” said the burglar, grimly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Paul, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are the boy that lives with my father?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, if you are the son of Jerry Barclay,” Paul admitted, seeing that denial was useless.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s queer how things come about,” said Barclay, reflectively.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think you will have to excuse me,” said Paul, “for I am sent on an errand, and it won’t do for me to stop.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are you bound?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To the Astor House.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going to walk?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I will go with you, if you don’t mind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul was by no means desirous of Barclay’s company, but there seemed no way to shake him off. The street was free to all.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can come with me if you like,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll go. I’ve got something to say to you. But first I’ll say that I don’t bear any ill will against you for what you did the other night. You only did your duty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [91]\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s true. I’m glad you look upon it in that light.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I admire your pluck, blest if I don’t. All the same I was disappointed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you think it would be better to go into some other line of business, Mr. Barclay?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I do, but that was all that was open to me at that time. Now, I’ve got into something different.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul looked curious, but didn’t ask what that business was. He concluded that Barclay would tell him if he felt disposed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m a confidential agent,” continued Barclay, “and it’s likely to pay me well. Where has my father moved to?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul hesitated.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see you don’t want to tell me. My father moved to get out of my way, I expect.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, he did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know as I blame him much, being the kind of man he is. I’m his son, but money is his god. I asked for money, and he didn’t want to give it to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s what he said.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I was in need of money then. Now I’m not. Do you see that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n He drew from his vest pocket the roll of counterfeit notes which had been intrusted to him, and showed it to Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That doesn’t look as if I was in want of money, does it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, it doesn’t,” Paul admitted. In truth he was surprised at this unexpected wealth on the part of his companion, and it occurred to him to wonder whether he had engaged in another burglary in which he had been more successful.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I didn’t get it in the way you think,” he said,[92] answering Paul’s suspicious thought. “I got it in the way of business. Now will you tell me where my father lives?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t without his permission.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then tell him that I don’t want any money from him. I am able to pay my own way now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He says he is poor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you believe him, 91?” asked Barclay.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he must have some money,” answered Paul, cautiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So do I, decidedly. But he can keep it. Tell him that. I only want to see him about some family matters. It ain’t strange if a son wants to have a chat with his father after twelve years, is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I should say not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell the old man that I am willing to give him five dollars as a sign of good faith. If he will give me five, I’ll hand him ten.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell him that,” said Paul, rather surprised, and asking himself whether James Barclay was in earnest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You couldn’t give me small bills for a ten, could you?” asked Barclay, meaning to push his business by Paul’s help.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I couldn’t. I don’t carry any money about with me except a little silver.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind; I’ll get it somewhere else. Will you let me know tomorrow what my father says?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll call at your office about ten o’clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I may be away, but if I am not you can see me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long have you been with my father?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ever since I was five or six years old.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What made him take you? He isn’t so very charitable.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There was some money that went with me, I have heard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [93]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve no doubt of it. The old man is keen to look out for Number One. He prefers that to looking out for Number Ninety One.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul laughed at the joke, though he didn’t think it very brilliant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you expect he will leave you his money?” questioned Barclay, with a sharp glance at Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I have no claims upon him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s true, but you might take advantage of his being weak and old.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you take me for?” asked Paul indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Barclay laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t take you for an angel, and a few thousands might be a temptation to you as well as the next man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think your father has as much money as that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why shouldn’t he? He has been always scrimping and saving and never spending.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, it’s nothing to me,” said Paul. “If you ask my opinion, I think he’ll never make a will, and whatever he has will go to his natural heir. I suppose that’s you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, it’s me. If I’m dead, I’ve got a wife and two children.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They had reached Barclay Street, and the Astor House was close at hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must leave you now,” said Paul. “I go into the hotel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well. Don’t forget to tell my father what I told you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n That evening Paul, in redemption of his promise, said to the miser:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I saw your son, today, Jerry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The old man’s face wore a startled expression.\n\u003c/div\u003e \n\u003cdiv\u003e\n [94]\n\u003c/div\u003e \n\u003cdiv\u003e\n “You saw—James?” he faltered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he know you lived with me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but I don’t know how he found out. Perhaps he asked at our former lodgings.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What—what did he say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He asked where you had moved.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You didn’t tell him?” said Jerry, in alarm.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I said I could not without your permission.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good boy, Paul. Don’t tell him—ever. He—he would come here and ask for money. It would be very foolish, for I am wretchedly poor. Why didn’t you tell him that Paul?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think he would believe me if I did. But you are mistaken, he says, about his wanting money. He showed me a roll of bills, and said he had a good position.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He asked me for fifty dollars when he came to see me. He is a bold, bad man!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now he says he is willing to give you money. He says if you will give him five dollars back he will give you a ten dollar bill.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he say that?” asked old Jerry, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He told me to tell you that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Jerry’s face wore a look of perplexity. He hated to give up a chance of five dollars, but at the same time he felt afraid of his son. He could not believe him to be in earnest, for such liberality was by no means characteristic of him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he—seem to be in earnest?” he asked Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, he seemed to be, but you know him better than I do. He said he wanted to have a chat with you, as he had not seen you for so many years. What shall I say to him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Jerry didn’t immediately reply. Avarice and greed struggled in his mind with an instinctive fear of his son.\n\u003c/div\u003e \n\u003cdiv\u003e\n [95]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I’ll think of it,” he answered. “I can’t tell just yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shall I say that to him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—and—Paul—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t let him follow you home and find me out. He’ll try to do it. He is a—a bad man, as he was a bad boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will do as you say, Jerry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul was not sorry to carry back this message, for he, too, mistrusted James Barclay, and felt that his desire to see his father covered some sinister design.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2951/81122.html","bookId":463,"creation":"Aug 2, 2019 7:09:12 AM","modification":"Aug 2, 2019 7:09:12 AM"}
