{"id":15661,"no":17,"title":"CHAPTER XVII. A QUEER COMPACT.","content":"\u0026nbsp;James Barclay was very much in earnest in wishing to find his father’s new habitation, for he was convinced that the old man possessed a moderate fortune, and he felt that, sooner or later, it would come to him. If in any way he could persuade old Jerry to put it in his hands now, he would be handsomely provided for. \n\u003cdiv\u003e\n He was not to see Paul until the next morning. He secured lodgings at a low hotel on the Bowery, where twenty five cents per night was charged. The accommodation corresponded with the price, but Barclay, fresh from Sing Sing, was not inclined to be fastidious, and congratulated himself that again he was a free man.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was not unmindful of his business, but was on the lookout for a chance to exchange his counterfeit bills for good ones.\n\u003c/div\u003e \n\u003cdiv\u003e\n He strolled into a drinking saloon, and called for a drink. By his side a man, from the country, apparently, was just paying for a glass of whisky, and in so doing displayed a wallet filled with bills. Barclay felt interested in him at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My friend,” he said, “won’t you drink with me? I hate to drink alone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re very polite, stranger, but I—hic—I guess I’m about full.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “O, you can stand another glass, I am sure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I don’t mind,” hiccoughed the countryman. “You’re a—gen—gentleman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [97]\n\u003c/div\u003e \n\u003cdiv\u003e\n “So are you,” said Barclay, with a wink at the barkeeper. “What’ll you have?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The countryman expressed a wish for whisky straight, and was served with a glass.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the two sat down, and engaged in conversation. It was evident from the thick utterance of the gentleman of the rural districts, that he was no longer master of himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “By the way,” said Barclay, carelessly, “will you do me a favor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t lend you any money,” answered the other, with a remnant of prudence. “I promised my wife I wouldn’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “O, I don’t want a loan,” said Barclay. “Bless you, I’ve got money enough. But I see you’ve got a number of bills. Couldn’t you change a ten for me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The countryman saw no harm in this, and counted out ten dollars in small bills, for which he accepted a nice crisp ten dollar bill, which looked handsome, but, as we know, was not worth the paper it was printed upon.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Won’t you take another drink in acknowledgment of the favor?” asked Barclay. “It has saved my going to the bank.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The countryman was already so dizzy, that he had the good sense to refuse, after trying to balance himself on his feet without success.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll bid you good day,” said Barclay, who, for obvious reasons, desired now to terminate the acquaintance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Goo’ day,” said the other, in a husky voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was very well done!” soliloquized Barclay, as he counted the good money and put it by itself in an upper vest pocket. “The fellow’s so drunk that he’ll never know where he got the bad tenner. That’ll do for one day’s work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The next morning, a little before the time agreed[98] upon with Paul, he was crossing the City Hall Park, when he unexpectedly met the telegraph boy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good morning, Number 91,” he said. “I was just coming up to the office to look for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you are saved the trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; and now what word from my father? Where can I find him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He does not seem willing to see you,” answered Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n James Barclay frowned angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe you’re doing this, you young rascal, keeping me and the old man apart, so you can get hold of his money yourself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are welcome to think what you like, Mr. Barclay,” said Paul, with spirit. “Good morning!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Curse the kid!” muttered Barclay, following the telegraph boy with a vindictive glance.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s what I say, too, boss!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Barclay turned quickly, and found the speaker to be a bootblack, a boy about Paul’s size. It was Tom Rafferty, a boy introduced in the first chapter, with whose attempted imposition upon a smaller boy in the same line of business Paul had forcibly interfered.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you know the kid?” he said, inquiringly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d ought to,” answered Tom. “Shine yer boots, boss?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I’ll have a shine,” answered Barclay, thinking he might make this boy of service.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So you don’t like Number 91?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t,” was the emphatic reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s the matter with him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He thinks himself above me, jest because he is a telegraph boy, and I am a bootblack.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you known him long?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ever since he was so high,” said Tom, indicating the height of a boy of six.\n\u003c/div\u003e \n\u003cdiv\u003e\n [99]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know the old man he lives with?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Know old Jerry? Of course I do. Used to live in the same house, when dad was livin’.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So the boy has always lived with him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ever since I knowed him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Humph! Where do they live now?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Round in Pearl Street.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, they don’t. They’ve moved.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t know it. Must ’ave moved lately.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, it was. Now, boy—what’s your name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tom Rafferty.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, Tom, would you like a job?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wouldn’t I!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I want to find out where the boy and the old man live. I’ve got some business with the old man, but he don’t want to see me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wouldn’t Paul tell you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s it worth, boss?” asked Tom, with an eye to business.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It depends on how soon you can find out. How can you find out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll foller Paul when he goes home from the office.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’ll do. Do you think you can find out for me tonight, so as to let me know tomorrow morning?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I reckon I can, boss.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Meet me here tomorrow morning, and tell me where they live, and I’ll give you a dollar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom had not been expecting more than a quarter, and was very well pleased with Barclay’s liberality.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll do it, boss!” he said, striking the box, to indicate that the shine was completed. Apart from the money that was promised him, he was glad to thwart Paul, who didn’t want his customer to ascertain the address.\n\u003c/div\u003e \n\u003cdiv\u003e\n [100]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll meet you here about nine o’clock, and have another shine,” said Barclay, as he slipped ten cents—double pay—into Tom’s hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll find me on hand, and right side up with care,” said Tom. “You’re a gentleman I like to fall in with.”\n\u003c/div\u003e \n\u003cdiv\u003e\n James Barclay walked away, well pleased with the arrangement he had made.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s more’n one way of finding out what you want to know,” he soliloquized. “The old man ain’t sharp, or else he thinks I ain’t. I’ll give him a call when that troublesome telegraph boy is about his business. Me and the old man will have considerable business to discuss. He’s going to give me a share of his money, or I’ll shake the life out of him. It ain’t pleasant to discipline your dad, but when he don’t treat you like he ought, it’s the only way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom Rafferty, towards the close of the afternoon, loitered in the neighborhood of the telegraph office where Paul was employed. When Number 91 left the office and betook himself homeward, he did not notice that he was followed at the distance of a few rods by Tom Rafferty.\n\u003c/div\u003e \n\u003cdiv\u003e\n But such was the case.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2951/81123.html","bookId":463,"creation":"Aug 2, 2019 7:09:15 AM","modification":"Aug 2, 2019 7:09:15 AM"}
