{"id":15669,"no":25,"title":"CHAPTER XXV. OLD JERRY’S WEALTH.","content":"\u0026nbsp;Old Jerry certainly did look weak and miserable. His face seemed thinner and paler than usual; his thin gray hair looked quite disordered, and there were dark rings around his eyes. \n\u003cdiv\u003e\n “You look sick,” answered Paul, pityingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think I am going to die?” asked the old man, tremulously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, no, not yet awhile,” answered Paul, in a cheering voice. “But you must have a doctor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no; I can’t afford it,” said Jerry, in alarm. “Doctors charge so much. They—they seem to think a man is made of money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you rather die,” Paul exclaimed, impatiently, “than pay for a doctor’s attendance? What good will your money do you if you die?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You—you might ask the druggist for some medicine to help me. That would be much cheaper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That won’t do you; you need a doctor. If you don’t have one, you may die before morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Jerry was thoroughly frightened now. He made no further resistance, and Paul summoned a doctor having an office on Grand Street.\n\u003c/div\u003e \n\u003cdiv\u003e\n When he saw Jerry, and felt his pulse, he looked grave.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he is going to have a low fever,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is it catching?” asked Mrs. Hogan, nervously, for Paul had waked her up, and asked her to come in.\n\u003c/div\u003e \n\u003cdiv\u003e\n [140]\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctor smiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “O, no,” he said. “Don’t be alarmed. Pardon me for asking,” he said, turning to Paul, “but does your grandfather—I suppose he is your grandfather—eat regularly and sufficiently?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid not, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He has lowered his system, I should judge, by lack of nourishing food, and at present his vitality is very low.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can easily believe it, doctor,” said Paul. “I will speak to you on the subject later. Do you think he is going to have a fever?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, a low fever, as I said—the revenge of outraged nature for a violation of her rules.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Am I going to die?” asked Jerry, his parchment skin assuming a greenish hue. “I—I want to live; I am not ready to die.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That depends on whether you follow my rules.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will if—if you don’t make me spend too much money; I am poor—miserably poor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will see that your rules are followed, doctor,” said Paul, finding it hard to hide the disgust he felt at this characteristic manifestation of the old man’s miserly disposition.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see you are a sensible boy,” said the doctor, approvingly. “Perhaps I had better speak to you privately.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, doctor. As we have no other room, will you step into the entry?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctor followed Paul out.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Before you give your instructions,” said the telegraph boy, “I want to say that Jerry—he is not my grandfather—is a miser, and has deliberately deprived himself of the necessaries of life.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has he money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He has enough, I am sure, to pay what is needful, but it will be hard to get him to spend it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [141]\n\u003c/div\u003e \n\u003cdiv\u003e\n “He must have nourishing food, and stimulating medicines, or he cannot recover. His life is at stake.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will he need a nurse?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you can’t attend to him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I prefer to attend to my regular business, and hire some one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then do so, for the old man will require some weeks, at least, to recover from the low point to which he has brought himself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I can get Mrs. Hogan to take care of him. You may give her your directions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n First, however, Paul made the proposal to the good woman. “I’ll see that you are paid,” he said. “If I can’t get the money out of Jerry, I will pay it myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, Paul, dear, I wouldn’t want to take the little you have. You’ve no more than enough for yourself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will show you something, Mrs. Hogan, if you won’t let Jerry know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure I won’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul produced the hundred dollar bill, and filled the soul of Mrs. Hogan with amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did you get it?” she asked, in wonder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was given me by a gentleman whom I saved from being robbed of a good deal more,” he answered. “You see, Mrs. Hogan, I am not so poor as you suppose. I will pay you seven dollars a week, if that will satisfy you, for your care of Jerry, but I will try to get him to repay me the money, for his life depends on what we are able to do for him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctor, upon Mrs. Hogan’s acceptance of the office of nurse, gave her instructions. To begin with, though late, he directed that some tea and oatmeal should be prepared and administered to his patient to reinforce his failing strength.\n\u003c/div\u003e \n\u003cdiv\u003e\n [142]\n\u003c/div\u003e \n\u003cdiv\u003e\n It was nearly one o’clock when Paul threw himself down on the lounge with his clothes on, and fell into a sound sleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Jerry did not immediately improve. His strength was so far reduced that it required time to rebuild his enfeebled constitution. Mrs. Hogan proved a good nurse. Indeed, in her younger days she had acted in that capacity, and was not ignorant of the duties.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Paul came home the next evening, he found the nurse waiting to speak to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The doctor says Jerry must be undressed, and not lay with his clothes on,” she said, “but old Jerry is so obstinate that he won’t agree to it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jerry, you will feel a great deal better to take off your clothes,” said Paul, in a tone of expostulation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no!” objected Jerry, in a terrified tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And why not?” asked Mrs. Hogan. “Shure, the doctor knows what’s best for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But Jerry obstinately refused.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s a quare frake the old man has, not to be undressed like a good Christian,” observed Mrs. Hogan.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I know his objection,” said Paul. “We won’t trouble him just now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The next day at noon Paul called at the house, having a few minutes to spare. Mrs. Hogan met him with a smile of triumph.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’ve took off his clothes,” she said, “and I’ve put a night gown on him, and he’s lying as peaceful as can be.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t he refuse?” asked Paul, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, and a good reason why. He was out of his head, and so I asked Mr. McQuade, downstairs, to come up and help me. And niver a word the old man spoke, but seemed dazed like.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where are his clothes?” inquired Paul, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure there they are!” said the nurse, pointing[143] to a pile of wretched garments on a chair near the bedside.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll stay here ten minutes, Mrs. Hogan,” said Paul, “and give you a chance to go to your room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, Paul. I’ll go and make a bit of tay for the old man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul locked the door after her, and eagerly took up the shabby old suit which had been worn for years by old Jerry. He instituted a careful search, and found himself richly rewarded. In one pocket he found a bank book on the Bowery Savings Bank. His eyes opened with amazement when he found nearly three thousand dollars set down to the old man’s credit. There was another book, marked the union Dime Savings Bank, a bank in the upper part of the city. On this book deposits were entered to the amount of eight hundred and ninety dollars. Feeling something stiff behind the lining of the coat, Paul hastily ripped it open, and found a certificate of one hundred shares of Erie, then selling at forty eight dollars per share. This appeared to be all, except a few dollars in money.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is my duty to take care of them,” reflected Paul. “Mrs. Hogan is no doubt honest, but others might enter the chamber who would not scruple to rob the old man. I will take care of them, and deposit them in a safe place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He made a hasty calculation, and found that the two savings bank books contained deposits amounting to three thousand eight hundred dollars. The value of the Erie stock he afterwards ascertained to be four thousand eight hundred, making in all eight thousand six hundred dollars.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How strange that a man with so much money should be willing to live so miserably!” he thought. “Probably he has shortened his life by this means.”\n\u003c/div\u003e \n\u003cdiv\u003e\n At this point Mrs. Hogan reentered the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n [144]\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul had replaced the clothes on the chair, and she did not observe that they had been touched.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is there anything you want, Mrs. Hogan?” asked Paul. “If so, I can leave some money with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I might, maybe, need to send Mike out to the druggist.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here’s a dollar, then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure, Paul, you’re very kind to the old craythur, though he’s no kin to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I expect to be paid back some time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m sure you will. We’ll try to keep life in the craythur, though it’s little he enjoys it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps he enjoys it as much in his way as you or I.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure it’s little I’d enjoy if I lived like him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I agree with you, Mrs. Hogan. But I must be going.”\n\u003c/div\u003e \n\u003cdiv\u003e\n About three o’clock there was a knock at Mrs. Hogan’s door. A woman of thirty presented herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Shure, and it’s I that am glad to see you, Mrs. Barclay,” said the hospitable widow. “I haven’t set eyes on you since you went over to live in Jersey City.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t often get over here. Today I had to bring clothes to a customer, and thought I’d come and see you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The visitor was Ellen Barclay, whom a strange chance—or was it Providence?—had brought unwittingly to the poor home of her husband’s father.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2951/81131.html","bookId":463,"creation":"Aug 2, 2019 7:09:38 AM","modification":"Aug 2, 2019 7:09:38 AM"}
