{"id":15647,"no":3,"title":"CHAPTER III. OLD JERRY THE MISER.","content":"\u0026nbsp;At six o’clock every other day Paul was let off from the office, other days he stayed much later. \n\u003cdiv\u003e\n On this particular day he was dismissed at six, and bent his steps homeward. He paused in front of a tall, shabby brick tenement house, unsightly in its surroundings, and abounding inside in unsavory smells, and took his way up the creaking staircase to a room on the fourth floor. He opened the door and entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n The room was bare and cheerless in the extreme. The floor was uncarpeted, and if it had ever been painted it retained no vestiges of it. Two chairs, one broken, a small table which would have been dear at fifty cents, a low bedstead in one corner with a dirty covering—there were no sheets—and a small cot bed which Paul occupied—these were about all that could claim the name of furniture. There was, however, a wooden chest, originally a sailor’s, probably, which the telegraph boy used to hold the few extra clothes he possessed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Jerry was sitting on one side of the bedstead.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good evening, grandfather,” said Paul, cheerfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It isn’t a good ev’ning,” answered the old man, querulously. “I—I haven’t made a cent today.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought you got ten cents by begging,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I forgot that. I might have got more if you[19] hadn’t interfered. You are very hard on your poor old grandfather, Paul.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t bear to have you beg,” said Paul, his brows contracting. “I don’t want to have it said that I live with a beggar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It isn’t my fault that I am very poor, Paul.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you so very poor?” asked Paul, pointedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—of course I am. What do you mean, Paul?” asked the old man, his manner indicating alarm. “Don’t you know I am very poor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know you say so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course I am. Did any one ever tell you I wasn’t?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This room looks like it at any rate,” answered Paul, looking about with ill concealed disgust.\n\u003c/div\u003e \n\u003cdiv\u003e\n He didn’t choose to say anything of the discovery he had made, through his friend Johnny Woods, of old Jerry’s deposit in the Bowery Savings Bank.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, yes, and it is more than I can afford. Four dollars a month is an awful price. I have often thought I must find a cheaper room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You couldn’t easily find a poorer one,” said Paul, moodily. “Well, grandfather, have you had your supper?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I have eaten a piece of bread.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That isn’t enough for you, grandfather. If you will come out with me I will get you some supper at the Jim Fisk restaurant.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, no, Paul; I can’t afford it. It is sinful extravagance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can get you a cup of tea and some corn beef hash for eight cents. That isn’t much. Don’t you think you would enjoy a cup of tea?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Paul, it would do me good, if I could afford it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I will pay for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, Paul, you will die in the poorhouse if you[20] are so wasteful. The money that you have spent at that eating house would bring joy to the heart of your old grandfather.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here,” said Paul, who could not bring his mind to calling the old man grandfather, as he had often done before. “It’s no use talking. You may starve yourself if you want to, but I don’t mean to. I’m going out to supper now. If you go with me I’ll pay for your supper, and it shan’t cost you a cent. I am sure you would like a good cup of tea.”\n\u003c/div\u003e \n\u003cdiv\u003e\n For an instant an expression of longing crept over the face of the old miser, but it was soon succeeded by a look of cunning and greed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would cost eight cents, wouldn’t it, Paul?” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but that isn’t much. If you’d like a plate of roast beef and a cup of tea, I’ll buy it for you. They will cost only eleven cents. So put on your hat, and we will go out together.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait a minute, Paul,” said the old man. “Would you mind giving me the money instead—eleven cents?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t mind, but I would rather you would go out with me. How do you expect to keep soul and body together without anything but dry bread and cold water?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m so poor, Paul; I can’t afford anything better,” whined old Jerry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see it’s no use talking to you,” said Paul, in a vexed tone. “Well, if you prefer to have me give you the money, here it is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He took from his pocket a dime and a penny, and passed it over to the old man.\n\u003c/div\u003e \n\u003cdiv\u003e\n Old Jerry chuckled, and a smile crept over his wrinkled features, as he eagerly clutched the coins.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good boy, Paul!” he said. “That’s right, to be kind to your poor old grandfather.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [21]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I’m going out to supper,” said Paul, abruptly, for it was painful to him to witness this evidence of the old man’s infatuation. “I’ll be back soon.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s a guardian to be proud of,” he said, bitterly, as he made his way carefully down the rickety staircase. “Who can blame me for not liking him? I don’t believe I can make up my mind to call him grandfather again. After all, why should I? He is no relation of mine, and I am glad of it.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2951/81109.html","bookId":463,"creation":"Aug 2, 2019 7:08:29 AM","modification":"Aug 2, 2019 7:08:29 AM"}
