{"id":15674,"no":30,"title":"CHAPTER XXX. PAUL’S RECEPTION AT ROCKVILLE.","content":"\u0026nbsp;Paul found himself unable to start for Rockville in the afternoon. He was obliged to make arrangements at home for an indefinite absence, and procure from the savings bank a supply of money for current expenses, which he left in the hands of Mrs. Hogan. His outfit was provided by Mrs. Holbrook, who made it as ample as if Paul were the son of a well to do family, instead of a telegraph boy, dependent upon his own exertions for a scanty living in a shabby tenement house. \n\u003cdiv\u003e\n When his new patroness parted from him, she put a pocketbook into his hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is not intended for remuneration,” she said, “for I shall pay the telegraph company their usual charges. But I wish you to have money to use, as you may require it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you,” said Paul. “You are very kind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I am only considerate and just.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you any special directions to give, Mrs. Holbrook?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “None beyond what I have already given. I must trust greatly to your own good judgment and discretion. I am sure I can do so with confidence, after the good report Mr. Cunningham has made of you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you; I will try to deserve your confidence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may write to me from time to time, when you have anything to communicate.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [163]\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul promised to do so, and at nine o’clock took a train at the Grand Central Depot for Rockville.\n\u003c/div\u003e \n\u003cdiv\u003e\n Fairly seated in the cars, he opened the pocketbook given him by Mrs. Holbrook.\n\u003c/div\u003e \n\u003cdiv\u003e\n It contained three five dollar bills, and five dollars more in small notes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mrs. Holbrook is very liberal,” he reflected, complacently. “It will be a pleasure to be in her service. I am fortunate in finding such good friends.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul was fortunate, but his good fortune was deserved. He always tried to do his duty, was always courteous and obliging, and not afraid to work. Such boys generally find friends. If any of my readers think they are badly treated by their employers, and are poorly provided with friends, let them consider whether they have taken pains to deserve them.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul had never traveled, and two hours’ ride on the cars from New York to Rockville, on a pleasant, sunny morning, interested him very much.\n\u003c/div\u003e \n\u003cdiv\u003e\n He knew very little of the country, having spent most of his time in the lower part of the city. He began to think the world was more beautiful than he imagined.\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally, the cars came to a stop; the conductor called out “Rockville!” and Paul, with curious anticipation, stepped from the cars upon the platform.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was the usual crowd around the depot. On the platform stood a man with a whip in his hand, evidently a driver.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Carriage for the hotel, or any part of the village!” he called out.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul stepped up to him and inquired: “Can you tell me how far from here Mrs. Granville lives?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The widder Granville?” queried the driver.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose so. She is an old lady.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [164]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just so. Well, she lives about a mile away, on the Plainfield Road.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you take me there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, as you ain’t over and above hefty, I guess the horses can manage it,” added the driver, humorously. “Just hop on. We’ll be starting directly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul got on the front seat with the driver, feeling disposed to a social chat with that personage. There was but one other passenger, a lady, who was bound for the hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you going to visit the widder?” asked the knight of the whip.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am expecting to stay at her house a little while.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you know her?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I have never seen her. I bring a letter from her niece in New York, Mrs. Louisa Holbrook.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve heard tell of her. She was down here a week last summer. I guess she and the housekeeper couldn’t hitch hosses.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mrs. Mercer is the housekeeper, I believe,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Folks call her the housekeeper. I call her the boss,” said the driver. “She’s got the old lady under her thumb, if all accounts are true.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is she agreeable?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Amos, the driver, emitted a short laugh. “Wait till you see her,” he said, significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think Mrs. Granville stands in dread of her?” asked Paul, rather anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was beginning to think his task might be a hard one.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; the old lady is easy goin’, that is all. If she ever got roused she’d turn out to have a will of her own, or I’m greatly mistaken. Bless your soul, Mrs. Mercer wouldn’t dare to go too far, for she wants the old lady to leave her a good slice of her[165] property. But she gets round her in an underhand way. For instance, if her son wants to go off anywhere, and it isn’t convenient for him to drive the old lady out, Mrs. Mercer persuades her that she isn’t looking well, or that the wind is cold and raw, and she’d better stay at home. I shouldn’t be surprised if she’d get the old lady to make a will in her favor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what sort of a reception the housekeeper will give me,” said Paul, thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very likely she will not be over glad to see you, especially when she knows you’re a friend of Mrs. Holbrook. That lady saw through the housekeeper’s little schemes, and did what she could to put a spoke in her wheel—that’s why she hates her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, all I can do is to hope for the best.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Be yer expectin’ to stay long?” asked Amos, curiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That depends on whether the housekeeper will let me, from what you tell me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll find it dreadful dull.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps so, but I’m going to offer to drive out Mrs. Granville, and I’m willing to take care of the horse or horses, if she wants me to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Frost will like that, for he’s lazy, and will be glad to get rid of the work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose Frost is the housekeeper’s son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, that’s the one I mean.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What sort of a fellow is he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good enough for those who like him,” answered Amos, dryly. “I don’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Does he resemble his mother?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s a chip of the old block, but not half so smart. His mother thinks him an angel, and what she wants the old lady’s property for is not so much for herself as for her son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You think I won’t find him a pleasant companion, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n [166]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know you won’t.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I hope I shall like Mrs. Granville.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’s a good old lady and awful rich. The only weak thing about her is her trusting the housekeeper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should think she would prefer to have some relative with her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She won’t get any to stay with her till she discharges Mrs. Mercer. The housekeeper makes herself as disagreeable as possible to any relation, because she’s afraid they will get an influence over the old lady’s mind and interfere with her.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps she may think the same of me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Like as not. You can tell better in a few days. But there’s the house, the big white one on a little hill to the left.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a very nice one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, it’s a good house. Why shouldn’t it be? The old lady’s got plenty of money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you any idea how much?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s risin’ a hundred thousand dollars, I heard Squire Taylor say once. Squire Taylor is her lawyer, and he’s likely to know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No wonder the housekeeper has designs upon it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just so—I shouldn’t mind if the old lady would leave me a slice. You might put in a good word for me—Amos Drake—when you get acquainted.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll think of it,” answered Paul with a smile. “I owe you something for all the information you’ve given me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s all right. You seem a good sort of chap, and you’re welcome.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Amos drew up in front of the house, and reined in the horses; while Paul descended from the carriage.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How much is the fare?” asked Number 91.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Twenty cents.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s near enough,” said Paul, handing him a quarter.\n\u003c/div\u003e \n\u003cdiv\u003e\n [167]\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re a gentleman,” said Amos. “Now I’ll have a cigar when I get back to the hotel.” Paul walked up the path to the front door of the mansion and rang the bell.\n\u003c/div\u003e \n\u003cdiv\u003e\n In about a minute the door opened, and he found himself confronting a tall, grim looking woman with thin face and figure, and iron gray hair.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who are you, and what is your business?” she demanded in a chilly tone. Paul had no doubt in his own mind that it was the housekeeper.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My name is Paul Parton, from New York, and I have a letter for Mrs. Granville.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can give me the letter.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you, but I would prefer to give it to Mrs. Granville——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Humph! Are you one of her relations?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but I come from Mrs. Holbrook, her niece.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh,” said the housekeeper, grimly. “Well, I don’t think you can see Mrs. Granville; she’s got a headache, and can’t be disturbed.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2951/81136.html","bookId":463,"creation":"Aug 2, 2019 7:09:54 AM","modification":"Aug 2, 2019 7:09:54 AM"}
