{"id":15682,"no":38,"title":"CHAPTER XXXVIII. CONCLUSION.","content":"\u0026nbsp;Three months passed, during which Paul faithfully attended to his duties as a telegraph boy. He was held in high consideration by the superintendent, who was very naturally influenced by the fact that Paul had made so many influential friends. \n\u003cdiv\u003e\n But the time was coming when he would no longer be Number 91.\n\u003c/div\u003e \n\u003cdiv\u003e\n One night he received a note signed Eliot Wade, asking him to call in the evening at the Albemarle Hotel. He presented himself promptly, and was cordially greeted by the young man from St. Louis, to whom he had rendered an important service.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad to see you, Paul,” said the young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I am glad you have not forgotten me, Mr. Wade.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There was no danger of that. Well, Paul, I have come to New York for the purpose I mentioned to you—that of starting a branch establishment here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you secured a store, sir?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I shall be located at —— Broadway.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is a fine location.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope it will prove so. And now, Paul, are you engaged—in business, I mean?” he added, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am still a telegraph boy—Number 91.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you resign your position, and enter my service?”\n\u003c/div\u003e \n\u003cdiv\u003e\n [204]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Willingly, sir. In a year or two I shall be too old for a telegraph boy, and it will be well to learn some business. I suppose you will not want me for some time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “On the contrary, I need you at once. There will be a good deal of work attendant upon getting started, and I shall find plenty of work for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall be glad to begin next Monday, sir. I don’t want to leave the telegraph office without notice.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well; let it be so. Will twelve dollars a week satisfy you at first?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you really mean it, Mr. Wade?” asked Paul, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I shan’t earn so much.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Leave that to me,” said the young man, smiling. “I intend to have you earn that sum, and more next year.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul expressed his gratitude, and immediately gave notice at the telegraph office that he was about to leave.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I expected it, Number 91,” said the superintendent, “knowing what powerful friends you had secured. I am sorry to lose you, but I wish you success and prosperity in your new business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul thought best to make some change in his residence. He had already secured a separate room for himself in the old tenement house, Jerry’s sickness making it necessary. Now he persuaded old Jerry to pay the rent of a modest flat up town, to which he and James Barclay’s family removed. Paul hired a room not far away.\n\u003c/div\u003e \n\u003cdiv\u003e\n The location was not far from Central Park, and the better air and diet very much improved the health of the old man, who has become less miserly, and finds comfort in the society of his son’s family.\n\u003c/div\u003e \n\u003cdiv\u003e\n [205]\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul makes frequent calls on Mr. Cunningham, who receives him as a valued friend. Whether Paul’s partiality for Jennie Cunningham will lead to anything when he gets older, I must leave the reader to conjecture. It must be remembered that he is no longer a telegraph boy, but a rising young business man.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Granville retains her partiality for him, and makes no secret of the fact that she has remembered Paul in her will. Paul would be surprised if he knew the legacy he is to receive; but he wisely keeps the matter out of his thoughts, and earnestly hopes the old lady may live many years yet.\n\u003c/div\u003e \n\u003cdiv\u003e\n It is rather a curious circumstance that Mark Sterling is employed as a boy in the same establishment where Paul is a clerk.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Mark applied for the place he was not aware that the telegraph boy, upon whom he had looked down so scornfully, was also employed there. When he found it out, and that Paul was above him, he was tempted to resign; but the place was a good one, and he decided to wait awhile. He feared Paul would retaliate upon him, but he was soon undeceived.\n\u003c/div\u003e \n\u003cdiv\u003e\n The ex telegraph boy treated him so cordially, and showed such an obliging spirit, that Mark was won in spite of himself, and the two became friends. I have no doubt that the improved social condition of Paul, and the prospect that Mrs. Granville would leave him a legacy, influenced Mark. At any rate, he has now become a friend of Number 91.\n\u003c/div\u003e \n\u003cdiv\u003e\n The telegraph boys who used to serve in the same office with Paul are proud to point him out as a graduate of the office, and his rise in life encourages them to hope for future advancement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have had many boys in the office,” said the superintendent on a recent occasion, “but never one that came up to Number 91.”\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2951/81144.html","bookId":463,"creation":"Aug 2, 2019 7:10:13 AM","modification":"Aug 2, 2019 7:10:13 AM"}
