{"id":15649,"no":5,"title":"CHAPTER V. AN EXCITING INTERVIEW.","content":"\u0026nbsp;For a full minute Paul and the burglar faced each other without either moving. The telegraph boy of course waited for some aggressive movement on the part of his opponent. In that case he would not hesitate to fire. He felt the reluctance natural to any boy of humane instincts to take human life, and resolved, if possible, only to disable the ruffian. His heart quickened its pulsations, but in manner he was cool, cautious and collected. If the burglar had seen any symptoms of timidity or wavering, he would have sprung upon Paul. As it was, he was afraid to do so, and was enraged at himself because he felt cowed and intimidated by a boy. He resolved to inspire fear in Paul if he could. \n\u003cdiv\u003e\n “I have a great mind to kill you,” he growled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Two can play at that game,” said Paul, undaunted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here! You are making a fool of yourself. You are risking your life for nothing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am only doing my duty,” said Paul, firmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The kid’s in earnest,” thought the burglar. “I must try him on another tack.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here,” he said, changing his tone. “You are a poor boy, ain’t you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just you lower that weapon, and don’t interfere with me, and I will make it worth your while.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [29]\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean?” asked Paul, who, however, suspected the burglar’s meaning.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean this,” said the intruder, in an insinuating tone. “Let me open the safe and make off with the contents, and I’ll give you a liberal share of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you take me for?” demanded Paul, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “For a boy, of course. What do you care for the people in the house? They are rich and can afford to lose what will make us rich. Let me know where you live, and I’ll deal squarely with you. I mean it. All you’ve got to do is to go back to bed, and they’ll think you slept through and didn’t see me at all. What do you say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say no a thousand times!” answered Paul, boldly. “I may be poor all my life long, but I won’t be a thief.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The burglar’s face expressed the rage he felt. It was very hard for him to resist the impulse to spring upon Paul, but the resolute mien of the boy satisfied him that it would be very dangerous.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You refuse then?” he said, sullenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; you insult me by your proposal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish I had brought a pistol; then you wouldn’t have dared speak to me in that way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul was relieved to hear this. He had concluded that the burglar was unarmed, but didn’t know it positively. Now he could dismiss all fear.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” he said, “are you going?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The burglar eyed our hero during a minute of indecision, and decided that his plan was a failure. He certainly could not open the safe within range of a loaded revolver, and should he attack Paul, would not only risk his life, but rouse the house, and fall into the hands of the police, a class of men he made it his business to avoid. It was a bitter pill to swallow, but he must submit.\n\u003c/div\u003e \n\u003cdiv\u003e\n [30]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you promise not to shoot if I agree to leave the house?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Will you promise not to start the burglar alarm, but allow me to escape without interference?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, if you will agree never to enter this house again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You promise?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll go. If you break your word, boy, you’ll wish you had never been born,” he added, fiercely. “I’d hunt you night and day after I got out of jail, and kill you like a dog.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You need not be afraid. I will keep my word.” There was something in Paul’s tone and manner that inspired confidence.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ain’t a bad sort!” said the burglar, paying an involuntary tribute to the boy’s staunch honesty. “You’re a cool kind of kid, any way. What an honor you’d make to our profession!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul could not help smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose that’s a compliment,” he said. “Thank you. Now I must trouble you to go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m going! Remember your promise!”\n\u003c/div\u003e \n\u003cdiv\u003e\n In an instant the burglar was out of the window, through which he had made his entrance, and disappeared from sight. Paul did not approach the window, lest his doing so should excite alarm in the rogue. When a sufficient time had elapsed he ran to the window, closed it, and once more breathed freely. The danger was passed, and he began now to feel the tension to which his nerves had been subjected.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has anything happened, Paul?” asked a voice. Turning, Paul saw Mrs. Cunningham at the door. She had thrown a wrapper over her, and, attracted by the sound of voices, had entered the library.\n\u003c/div\u003e \n\u003cdiv\u003e\n [31]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has any burglar been here?” she asked, nervously, observing Paul with the revolver in his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered the telegraph boy; “I have just bidden the gentleman good night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time Jennie, too, made her appearance. “What is it, mamma? What is it, Paul?” she asked. “Why are you standing there with the revolver in your hand?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul told the story as briefly as the circumstances would admit.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was a mercy you were awake!” said Mrs. Cunningham. “Did you hear the noise of the man’s entrance?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know how I happened to wake up,” said Paul. “I generally sleep sound. But I opened my eyes, and immediately heard a noise in this room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But did you have time to dress?” asked Jennie.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I did not need to do so, for I threw myself on the bed with my clothes on.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And with your cap on?” inquired Jennie with an arch smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but when I rose from the bed I put it on without thinking. I don’t know whether I ought to have let the burglar get off free, but I thought it the easiest way to avoid trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You did right. I approve your conduct,” said Mrs. Cunningham. “You seem to have acted with remarkable courage and discretion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am very glad if you are pleased, madam,” said Paul, gratified at this cordial indorsement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Weren’t you awfully scared, Paul?” asked Jennie Cunningham.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I was a little scared, I admit,” answered Paul, with a smile, “but I didn’t think it wise to show it before the burglar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “My hand would have trembled so that I couldn’t hold the pistol,” declared the young lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n [32]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course; you are a girl, you know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t you think girls are brave, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “They are not called upon to be brave in the same way.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A good answer,” said Mrs. Cunningham. “And now, Jennie, we had better go back to bed. Will you not be afraid to sleep here the rest of the night after this adventure?” she asked, turning to Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Mrs. Cunningham. The burglar won’t feel like coming back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s that?” asked Jennie, pointing to some article on the floor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is the burglar’s jimmy,” said Paul, stooping to pick it up. “He left in such a hurry that he forgot to take it with him. I will carry it into my room, and take care of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul bade the two visitors good night and threw himself once more on the bed. The remainder of the night passed quietly. The midnight visitor did not reappear.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2951/81111.html","bookId":463,"creation":"Aug 2, 2019 7:08:37 AM","modification":"Aug 2, 2019 7:08:37 AM"}
