{"id":15651,"no":7,"title":"CHAPTER VII. PAUL RESOLVES TO MOVE.","content":"\u0026nbsp;After Jerry’s unwelcome visitor was well out of the way, Paul returned to the room. He found old Jerry trembling and very much distressed. The old man looked up with startled eyes when he opened the door. \n\u003cdiv\u003e\n “Oh, it’s you, Paul,” he said, in a tone of relief.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who did you think it was?” asked Paul, wishing to draw out the old man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I have had a visit from a bad man, who wanted to rob me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who was it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell you, Paul, but it’s a secret, mind. It was my son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t know you had a son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nor I. I thought he might be dead, for I have not seen him for twenty years. I am afraid he is very wicked.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How did he find you out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know. He—he frightened me very much. He wanted me to give him money—and I so miserably poor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul didn’t answer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You know how poor I am, Paul,” continued the old man appealingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You always say so, Jerry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The old man did not appear to notice that Paul had ceased to call him grandfather.\n\u003c/div\u003e \n\u003cdiv\u003e\n [40]\n\u003c/div\u003e \n\u003cdiv\u003e\n “And it’s true—of course it’s true. But he wants me to pay him fifty dollars. He is coming back tomorrow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But he can’t get it if you haven’t it to give.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I—I don’t know. He was always bad tempered—James was. I am afraid he might beat me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What! Beat his father!” exclaimed Paul, indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He might,” said the old man. “He wasn’t a good boy like you. He always gave me trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you really afraid he will come, grand—Jerry?” asked Paul, earnestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, he is sure to come—he said so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I think we had better move to another place where he can’t find us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—yes—let us go,” said the old man, hurriedly. “But, but,” he added, with a sudden thought, “we have paid the rent here to the end of the month. I can’t afford to lose that—I am so poor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It will only be a dollar and a half; I will pay it,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I think I shall go. When shall we leave, Paul?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This evening, Jerry, if I can get the time. I may have to stay up town to guard a house where the gentleman is absent, but it isn’t certain. If I do, I will be here early in the morning, before I go to work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This assurance seemed to abate the apprehensions of the old man, who, it was evident, stood in great fear of his son. Paul was obliged to take a hurried leave of him in order to have time for lunch before returning to the office.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who would have dreamed,” he said to himself, “that the bold burglar whom I encountered last night, was the son of old Jerry? One is as timid as a mouse, the other seems like a daring criminal. I[41] wonder why Jerry never told me that he had a son.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The discovery that Jerry had such a son made Paul still more unwilling to own a relationship to him. It was bad enough to pass for the grandson of a squalid miser, but it was worse to be thought the son or nephew of a burglar.\n\u003c/div\u003e \n\u003cdiv\u003e\n The day passed quietly. Paul was not sent out much, on the supposition that he might have to pass another night at the house of Mr. Cunningham.\n\u003c/div\u003e \n\u003cdiv\u003e\n About seven o’clock he rang the bell of the house in Fifty First Street.\n\u003c/div\u003e \n\u003cdiv\u003e\n The same servant admitted him. This time she received him with a smile, knowing that he stood high with her mistress.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come right in,” she said. “The mistress will see you in the sitting room.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you had any more visits from burglars?” asked Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; may be they’re waiting till night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Has Mr. Cunningham got back?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but he’s expected at eight.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul was glad to hear this, for he preferred not to remain over night, as he knew that old Jerry would need him.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Paul entered the sitting room Mrs. Cunningham received him cordially.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose you have not seen the burglar since,” said Mrs. Cunningham, innocently.\n\u003c/div\u003e \n\u003cdiv\u003e\n She little dreamed what a discovery he had made, and he did not think it wise to enlighten her.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He has not called upon me,” answered Paul, with justifiable evasion. “I don’t think I want to meet him again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope he will never present himself here,” said the lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He made me a promise that he would not,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n [42]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose he wouldn’t mind breaking it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, but he may conclude that you would be on your guard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is something in that,” said Mrs. Cunningham, looking relieved. “My husband has telegraphed me that he will be here at eight o’clock, but I don’t want him to run the risk of encountering such a man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you won’t need me to remain here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; but I wish you to stay till Mr. Cunningham returns. He will wish to see you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly, if you desire it,” said Paul, politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My daughter will entertain you,” continued the lady. “Here she is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good evening, Paul!” said Jennie, cordially extending her hand, as she entered the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good evening!” responded Paul, brightening up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you like to play a game of dominoes?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would be very glad to do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then we’ll play ‘muggins.’ There’s more fun in that than in the regular game.”\n\u003c/div\u003e \n\u003cdiv\u003e\n So the two sat down and were soon deeply immersed in the game.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know, Paul,” said Jennie, suddenly, “I feel as if I had known you for a long time, though it is only about twenty four hours since we met.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I feel the same,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’m awfully glad they sent you here instead of some other telegraph boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you would have liked another one better?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t think I should, but I ought not to say so. It may make you vain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are boys ever vain? I thought it was only girls.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s a very impolite speech. I shall have to give you a bad mark!”\n\u003c/div\u003e \n\u003cdiv\u003e\n [43]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I’ll take it all back!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’d better,” said Jennie, with playful menace. “I hope you’ll come up some time when you are not sent for on business!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I would like to very much, if your mother is willing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why shouldn’t she be willing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am only a poor telegraph boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t mind that. I don’t see why a telegraph boy isn’t as good as a boy in a store. My cousin Mark is in a store.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It will be seen that these young people were rapidly coming to a very good understanding. Paul was not in love, but he certainly did consider Jennie Cunningham quite the nicest girl he had ever met.\n\u003c/div\u003e \n\u003cdiv\u003e\n So the time passed till Mr. Cunningham returned. His wife informed him briefly of what had occurred. They both entered the room together. He was a man of middle age, a very pleasant and easy mannered gentleman.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you the boy who drove away the burglar?” he asked, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir, I believe so,” answered Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then let me add my thanks to those of my wife. You have done us a great service.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am very glad to have had the chance,” said Paul.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you will come to my office tomorrow morning,” continued Mr. Cunningham, “I will thank you in a more effective way. Come at ten o’clock. As you may find it difficult to leave the office otherwise, tell the superintendent that I have an errand for you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here is my business card.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Paid took the card and rose to go.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mamma,” said Jennie, “can’t you invite Paul to call and see us sometimes?”\n\u003c/div\u003e \n\u003cdiv\u003e\n [44]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly,” said the lady, smiling. “After what he has done he ought to have the freedom of the house. We shall be glad to see you as a visitor, Paul,” she said, kindly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Paul left the house in a flutter of pleasant excitement. He was quite determined to avail himself of an invitation so agreeable.\n\u003c/div\u003e \n\u003cdiv\u003e\n He crossed over to Third Avenue, and returned by the elevated railway to the home of old Jerry.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2951/81113.html","bookId":463,"creation":"Aug 2, 2019 7:08:44 AM","modification":"Aug 2, 2019 7:08:44 AM"}
