{"id":66006,"no":2,"title":"Page 2","content":"\u003cp\u003e\"It wasn\u0027t an accident I picked you up, you know,\" Carmen Greer said.\u003c/p\u003e\n\u003cp\u003eReacher\u0027s back was pressed against his door. The Cadillac was listing like a sinking ship, canted hard over on the shoulder. The slippery leather seat gave him no leverage to struggle upright. The woman had one hand on the wheel and the other on his seat back, propping herself above him. Her face was a foot away. It was unreadable. She was looking past him, out at the dust of the ditch.\u003c/p\u003e\n\u003cp\u003e\"You going to be able to drive off this slope?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe glanced back and up at the blacktop. Its rough surface was shimmering with heat, about level with the base of her window.\u003c/p\u003e\n\u003cp\u003e\"I think so,\" she said. \"I hope so.\"\u003c/p\u003e\n\u003cp\u003e\"I hope so, too,\" he said.\u003c/p\u003e\n\u003cp\u003eShe just stared at him. So why did you pick me up?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Why do you think?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know,\" he said. \"I thought I just got lucky. I guess I thought you were a kind person doing a stranger a favor.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e\"No, I was looking for a guy like you,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"I must have picked up a dozen guys,\" she said. \"And I\u0027ve seen hundreds. That\u0027s about all I\u0027ve been doing, all month long. Cruising around West Texas, looking at who needs a ride.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eShe shrugged the question away. A dismissive little gesture.\u003c/p\u003e\n\u003cp\u003e\"The miles I\u0027ve put on this car,\" she said. \"It\u0027s unbelievable. And the money I\u0027ve spent on gas.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" he asked again.\u003c/p\u003e\n\u003cp\u003eShe went quiet. Wouldn\u0027t answer. Just went into a long silence. The armrest on the door was digging into his kidney. He arched his back and pressed with his shoulders and adjusted his position. Found himself wishing somebody else had picked him up. Somebody content just to motor from A to B. He looked up at her.\u003c/p\u003e\n\u003cp\u003e\"Can I call you Carmen?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe nodded. \"Sure. Please.\"\u003c/p\u003e\n\u003cp\u003e\"O.K., Carmen,\" he said. \"Tell me what\u0027s going on here, will you?\"\u003c/p\u003e\n\u003cp\u003eHer mouth opened, and then it closed again. Opened, and closed.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know how to start,\" she said. \"Now that it\u0027s come to it.\"\u003c/p\u003e\n\u003cp\u003e\"Come to what?\"\u003c/p\u003e\n\u003cp\u003eShe wouldn\u0027t answer.\u003c/p\u003e\n\u003cp\u003e\"You better tell me exactly what you want,\" he said. \"Or I\u0027m getting out of the car right here, right now.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a hundred and ten degrees out there.\"\u003c/p\u003e\n\u003cp\u003e\"I know it is.\"\u003c/p\u003e\n\u003cp\u003e\"A person could die in this heat.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take my chances.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t get your door open,\" she said. \"The car is tilted too much.\"\u003c/p\u003e\n\u003cp\u003e\"Then I\u0027ll punch out the windshield.\"\u003c/p\u003e\n\u003cp\u003eShe paused a beat.\u003c/p\u003e\n\u003cp\u003e\"I need your help,\" she said again.\u003c/p\u003e\n\u003cp\u003e\"You never saw me before.\"\u003c/p\u003e\n\u003cp\u003e\"Not personally,\" she said. \"But you fit the bill.\"\u003c/p\u003e\n\u003cp\u003e\"What bill?\"\u003c/p\u003e\n\u003cp\u003eShe went quiet again. Came up with a brief, ironic smile.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s so difficult,\" she said. \"I\u0027ve rehearsed this speech a million times, but now I don\u0027t know if it\u0027s going to come out right.\"\u003c/p\u003e\n\u003cp\u003eReacher said nothing. Just waited.\u003c/p\u003e\n\u003cp\u003e\"You ever had anything to do with lawyers?\" she asked. \"They don\u0027t do anything for you. They just want a lot of money and a lot of time, and then they tell you there\u0027s nothing much to be done.\"\u003c/p\u003e\n\u003cp\u003e\"So get a new lawyer,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve had four,\" she said. \"Four, in a month. They\u0027re all the same. And they\u0027re all too expensive. I don\u0027t have enough money.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re driving a Cadillac.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s my mother-in-law\u0027s. I\u0027m only borrowing it.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re wearing a big diamond ring.\"\u003c/p\u003e\n\u003cp\u003eShe went quiet again. Her eyes clouded.\u003c/p\u003e\n\u003cp\u003e\"My husband gave it to me,\" she said.\u003c/p\u003e\n\u003cp\u003eHe looked at her. \"So can\u0027t he help you?\"\u003c/p\u003e\n\u003cp\u003e\"No, he can\u0027t help me,\" she said. \"Have you ever gone looking for a private detective?\"\u003c/p\u003e\n\u003cp\u003e\"Never needed one. I was a detective.\"\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t really exist,\" she said. \"Not like you see in the movies. They just want to sit in their offices and work with the phone. Or on their computers, with their databases. They won\u0027t come out and actually do anything for you. I went all the way to Austin. A guy there said he could help, but he wanted to use six men and charge me nearly ten thousand dollars a week.\"\u003c/p\u003e\n\u003cp\u003e\"For what?\"\u003c/p\u003e\n\u003cp\u003e\"So I got desperate. I was really panicking. Then I got this idea. I figured if I looked at people hitching rides, I might find somebody. One of them might turn out to be the right type of person, and willing to help me. I tried to choose pretty carefully. I only stopped for rough-looking men.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks, Carmen,\" Reacher said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t mean it badly,\" she said. \"It\u0027s not uncomplimentary.\"\u003c/p\u003e\n\u003cp\u003e\"But it could have been dangerous.\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"It nearly was, a couple of times. But I had to take the risk. I had to find somebody. I figured I might get rodeo guys, or men from the oil fields. You know, tough guys, roughnecks, maybe out of work, with a little time on their hands. Maybe a little anxious to earn some money, but I can\u0027t pay much. Is that going to be a problem?\"\u003c/p\u003e\n\u003cp\u003e\"So far, Carmen, everything is going to be a problem.\"\u003c/p\u003e\n\u003cp\u003eShe went quiet again.\u003c/p\u003e\n\u003cp\u003e\"I talked to them all,\" she said. \"You know, chatted with them a little, discussed things, like we did. I was trying to make some kind of judgment about what they were like, inside, in terms of their characters. I was trying to assess their qualities. Maybe twelve of them. And none of them were really any good. But I think you are.\"\u003c/p\u003e\n\u003cp\u003e\"You think I\u0027m what?\"\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027re my best chance so far,\" she said. \"Really, I do. A former cop, been in the army, no ties anywhere, you couldn\u0027t be better.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not looking for a job, Carmen.\"\u003c/p\u003e\n\u003cp\u003eShe nodded happily. \"I know. I figured that out already. But that\u0027s better still, I think. It keeps it pure, don\u0027t you see that? Help for help\u0027s sake. No mercenary aspect to it. And your background is perfect. It obligates you.\"\u003c/p\u003e\n\u003cp\u003eHe stared at her. \"No, it doesn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"You were a soldier,\" she said. \"And a policeman. It\u0027s perfect. You\u0027re supposed to help people. That\u0027s what cops do. \"\u003c/p\u003e\n\u003cp\u003e\"We spent most of our time busting heads. Not a whole lot of helping went on.\"\u003c/p\u003e\n\u003cp\u003e\"But it must have. That\u0027s what cops are for. It\u0027s like their fundamental duty. And an army cop is even better. You said it yourself, you do what\u0027s necessary.\"\u003c/p\u003e\n\u003cp\u003e\"If you need a cop, go to the county sheriff. Pecos, or wherever it is.\"\u003c/p\u003e\n\u003cp\u003e\"Echo,\" she said. \"I live in Echo. South of Pecos.\"\u003c/p\u003e\n\u003cp\u003e\"Wherever,\" he said. \"Go to the sheriff.\"\u003c/p\u003e\n\u003cp\u003eShe was shaking her head. \"No, I can\u0027t do that.\"\u003c/p\u003e\n\u003cp\u003eReacher said nothing more. Just lay half on his back, pressed up against the door by the car\u0027s steep angle. The engine was idling patiently, and the air was still roaring. The woman was still braced above him. She had gone silent. She was staring out past him and blinking, like she was about to cry. Like she was ready for a big flood of tears. Like she was tragically disappointed, maybe with him, maybe with herself.\u003c/p\u003e\n\u003cp\u003e\"You must think I\u0027m crazy,\" she said.\u003c/p\u003e\n\u003cp\u003eHe turned his head and looked hard at her, top to toe. Strong slim legs, strong slim arms, the expensive dress. It was riding up on her thighs, and he could see her bra strap at her shoulder. It was snow white against the color of her skin. She had clean combed hair and trimmed painted nails. An elegant, intelligent face, tired eyes.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not crazy,\" she said.\u003c/p\u003e\n\u003cp\u003eThen she looked straight at him. Something in her face. Maybe an appeal. Or maybe hopelessness, or desperation.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just that I\u0027ve dreamed about this for a month,\" she said. \"My last hope. It was a ridiculous plan, I guess, but it\u0027s all I had. And there was always the chance it would work, and with you I think maybe it could, and now I\u0027m screwing it up by coming across like a crazy woman.\"\u003c/p\u003e\n\u003cp\u003eHe paused a long time. Minutes. He thought back to a pancake house he\u0027d seen in Lubbock, right across the strip from his motel. It had looked pretty good. He could have crossed the street, gone in there, had a big stack with bacon on the side. Lots of syrup. Maybe an egg. He would have come out a half hour after she blew town. He could be sitting next to some cheerful trucker now, listening to rock and roll on the radio. On the other hand, he could be bruised and bleeding in a police cell, with an arraignment date coming up.\u003c/p\u003e\n\u003cp\u003e\"So start over,\" he said. \"Just say what you\u0027ve got to say. But first, drive us out of this damn ditch. I\u0027m very uncomfortable. And I could use a cup of coffee. Is there anyplace up ahead where we could get coffee?\"\u003c/p\u003e\n\u003cp\u003e\"I think so,\" she said. \"Yes, there is. About an hour, I think.\"\u003c/p\u003e\n\u003cp\u003e\"So let\u0027s go there. Let\u0027s get a cup of coffee.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re going to dump me and run,\" she said.\u003c/p\u003e\n\u003cp\u003eIt was an attractive possibility. She stared at him, maybe five long seconds, and then she nodded, like a decision was made. She put the transmission in D and hit the gas. The car had front-wheel drive, and all the weight was on the back, so the tires just clawed at nothing and spun. Gravel rattled against the underbody and a cloud of hot khaki dust rose up all around them. Then the tires caught and the car heaved itself out of the ditch and bounced up over the edge of the blacktop. She got it straight in the lane, and then she floored it and took off south.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know where to begin,\" she said.\u003c/p\u003e\n\u003cp\u003e\"At the beginning,\" he said. \"Always works best that way. Think about it, tell me over coffee. We\u0027ve got the time.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. Stared forward through the windshield, eyes locked on the empty shimmering road ahead. She was quiet for a mile, already doing seventy.\u003c/p\u003e\n\u003cp\u003e\"No, we don\u0027t,\" she said. \"It\u0027s real urgent.\"\u003c/p\u003e\n\u003cp\u003eFifty miles southwest of Abilene, on a silent county road ten miles north of the main east-west highway, the Crown Victoria waited quietly on the shoulder, its engine idling, its hood unlatched and standing an inch open for better cooling. All around it was flatness so extreme the curvature of the earth was revealed, the dusty parched brush falling slowly away to the horizon in every direction. There was no traffic, and therefore no noise beyond the tick and whisper of the idling engine and the heavy buzz of the earth baking and cracking under the unbearable heat of the sun.\u003c/p\u003e\n\u003cp\u003eThe driver had the electric door mirror racked all the way outward so he could see the whole of the road behind him. The Crown Vic\u0027s own dust had settled and the view was clear for about a mile, right back to the point where the blacktop and the sky mixed together and broke and boiled into a silvery shimmering mirage. The driver had his eyes focused on that distant glare, waiting for it to be pierced by the indistinct shape of a car.\u003c/p\u003e\n\u003cp\u003eHe knew what car it would be. The team was well briefed. It would be a white Mercedes Benz, driven by a man on his own toward an appointment he couldn\u0027t miss. The man would be driving fast, because he would be running late, because he was habitually late for everything. They knew the time of his appointment, and they knew his destination was thirty miles farther on up the road, so simple arithmetic gave them a target time they could set their watches by. A target time that was fast approaching.\u003c/p\u003e\n\u003cp\u003e\"So let\u0027s do it,\" the driver said.\u003c/p\u003e\n\u003cp\u003eHe stepped out of the car into the heat and clicked the hood down into place. Slid back into the seat and took a ball cap from the woman. It was one of three bought from a souvenir vendor on Hollywood Boulevard, thirteen ninety-five each. It was dark blue, with FBI machine-embroidered in white cotton thread across the front. The driver squared it on his head and pulled the peak low over his eyes. Moved the transmission lever into drive and kept his foot hard on the brake. Leaned forward a fraction and kept his eyes on the mirror.\u003c/p\u003e\n\u003cp\u003e\"Right on time,\" he said.\u003c/p\u003e\n\u003cp\u003eThe silver mirage was boiling and wobbling and a white shape pulled free of it and speared out toward them like a fish leaping out of water. The shape settled and steadied on the road, moving fast, crouching low. A white Mercedes sedan, wide tires, dark windows.\u003c/p\u003e\n\u003cp\u003eThe driver eased his foot off the brake and the Crown Vic crawled forward through the dust. He touched the gas when the Mercedes was still a hundred yards behind him. The Mercedes roared past and the Crown Vic pulled out into the hot blast of its slipstream. The driver straightened the wheel and accelerated. Smiled with his lips hard together. The killing crew was going to work again.\u003c/p\u003e\n\u003cp\u003eThe Mercedes driver saw headlights flashing in his mirror and looked again and saw the sedan behind him. Two peaked caps silhouetted in the front seat. He dropped his eyes automatically to his speedometer, which was showing more than ninety. Felt the cold oh-shit stab in his chest. Eased off the gas while he calculated how late he was already and how far he still had to go and what his best approach to these guys should be. Humility? Or maybe I\u0027m-too-important-to-be-hassled? Or what about a sort of come-on-guys, I\u0027m-working-too camaraderie?\u003c/p\u003e\n\u003cp\u003eThe sedan pulled alongside as he slowed and he saw three people, one of them a woman. Radio antennas all over the car. No lights, no siren. Not regular cops. The driver was waving him to the shoulder. The woman was pressing an ID wallet against her window. It had FBI in two-inch-high letters. Their caps said FBI. Serious-looking people, in some kind of duty fatigues. Serious-looking squad car. He relaxed a little. The FBI didn\u0027t stop you for speeding. Must be something else. Maybe some kind of security check, which made sense considering what lay thirty miles up the road. He nodded to the woman and braked and eased right, onto the shoulder. He feathered the pedal and coasted to a stop in a big cloud of dust. The Bureau car eased up and stopped behind him, the brightness of its headlight beams dimmed by the cloud.\u003c/p\u003e\n\u003cp\u003eThe way to do it is to keep them quiet and alive as long as possible. Postpone any kind of struggle. Struggling leads to evidence, blood and fibers and body fluids spraying and leaking all over the place. So they all three got out of the car at a medium speed, like they were harassed professionals dealing with something important, but not something right up there at the top of their agenda.\u003c/p\u003e\n\u003cp\u003e\"Mr. Eugene?\" the woman called. \"Al Eugene, right?\"\u003c/p\u003e\n\u003cp\u003eThe Mercedes driver opened his door and slid out of his seat and stood up in the heat and the glare. He was around thirty, not tall, dark and sallow, soft and rounded. He faced the woman, and she saw some kind of innate southern courtesy toward women place him at an immediate disadvantage.\u003c/p\u003e\n\u003cp\u003e\"What can I do for you, ma\u0027am?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Your cellular phone not working, sir?\" the woman asked.\u003c/p\u003e\n\u003cp\u003eEugene patted at the pocket of his suit coat.\u003c/p\u003e\n\u003cp\u003e\"Should be,\" he said.\u003c/p\u003e\n\u003cp\u003e\"May I see it, sir?\"\u003c/p\u003e\n\u003cp\u003eEugene took it out of his pocket and handed it over. The woman dialed a number and looked surprised.\u003c/p\u003e\n\u003cp\u003e\"Seems O.K.,\" she said. \"Sir, can you spare us five minutes?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe,\" Eugene said. \"If you tell me what for.\"\u003c/p\u003e\n\u003cp\u003e\"We have an FBI assistant director a mile up the road, needs to speak with you. Something urgent, I guess, or we wouldn\u0027t be here, and something pretty important, or we\u0027d have been told what it\u0027s all about.\"\u003c/p\u003e\n\u003cp\u003eEugene pulled back his cuff and looked at his watch.\u003c/p\u003e\n\u003cp\u003e\"I have an appointment,\" he said.\u003c/p\u003e\n\u003cp\u003eThe woman was nodding. \"We know about that, sir. We took the liberty of calling ahead and rescheduling for you. Five minutes is all we need.\"\u003c/p\u003e\n\u003cp\u003eEugene shrugged.\u003c/p\u003e\n\u003cp\u003e\"Can I see some ID?\" he asked.\u003c/p\u003e\n\u003cp\u003eThe woman handed over her wallet. It was made of worn black leather and had a milky plastic window on the outside. There was an FBI photo-ID behind it, laminated and embossed and printed with the kind of slightly old-fashioned typeface the federal government might use. Like most people in the United States, Eugene had never seen an FBI ID. He assumed he was looking at his first.\u003c/p\u003e\n\u003cp\u003e\"Up the road a-piece?\" he said. \"O.K., I\u0027ll follow you, I guess.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll drive you,\" the woman said. \"There\u0027s a checkpoint in place, and civilian cars make them real nervous. We\u0027ll bring you right back. Five minutes, is all.\"\u003c/p\u003e\n\u003cp\u003eEugene shrugged again.\u003c/p\u003e\n\u003cp\u003e\"O.K.,\" he said.\u003c/p\u003e\n\u003cp\u003eThey all walked as a group back toward the Crown Vic. The driver held the front passenger door for Eugene.\u003c/p\u003e\n\u003cp\u003e\"You ride up here, sir,\" he said. \"They\u0027re listing you as a class-A individual, and if we put a class-A individual in the backseat, then we\u0027ll get our asses kicked but good, that\u0027s for damn sure.\"\u003c/p\u003e\n\u003cp\u003eThey saw Eugene swell up a little from his assigned status. He nodded and ducked down and slid into the front seat. Either he hadn\u0027t noticed they still had his phone, or he didn\u0027t care. The driver closed the door on him and ducked around the hood to his own. The tall fair man and the woman climbed into the rear. The Crown Vic eased around the parked Benz and pulled left onto the blacktop. Accelerated up to about fifty-five.\u003c/p\u003e\n\u003cp\u003e\"Ahead,\" the woman said.\u003c/p\u003e\n\u003cp\u003eThe driver nodded.\u003c/p\u003e\n\u003cp\u003e\"I see it,\" he said. \"We\u0027ll make it.\"\u003c/p\u003e\n\u003cp\u003eThere was a plume of dust on the road, three or four miles into the distance. It was rising up and dragging left in the faint breeze. The driver slowed, hunting the turn he had scouted thirty minutes before. He spotted it and pulled left and crossed the opposite shoulder and bumped down through a depression where the road was built up like a causeway. Then he slewed to the right, tight in behind a stand of brush tall enough to hide the car. The man and the woman in the rear seat came out with handguns and leaned forward and jammed them into Eugene\u0027s neck, right behind the ears where the structure of the human skull provides two nice muzzle-shaped sockets.\u003c/p\u003e\n\u003cp\u003e\"Sit real still,\" the woman said.\u003c/p\u003e\n\u003cp\u003eEugene sat real still. Two minutes later, a big dark vehicle blasted by above them. A truck, or a bus. Dust clouded the sky and the brush rustled in the moving air. The driver got out and approached Eugene\u0027s door with a gun in his hand. He opened the door and leaned in and jammed the muzzle into Eugene\u0027s throat, where the ends of the collarbones make another convenient socket.\u003c/p\u003e\n\u003cp\u003e\"Get out,\" he said. \"Real careful.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" was all Eugene could say.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll tell you what,\" the woman said. \"Now get out.\"\u003c/p\u003e\n\u003cp\u003eEugene got out, with three guns at his head.\u003c/p\u003e\n\u003cp\u003e\"Step away from the car,\" the woman said. \"Walk away from the road.\"\u003c/p\u003e\n\u003cp\u003eThis was the tricky time. Eugene was glancing around as far and as fast as he dared move his head. His eyes were jumping. His body was twitching. He stepped away from the car. One pace, two, three. Eyes everywhere. The woman nodded.\u003c/p\u003e\n\u003cp\u003e\"Al,\" she called loudly.\u003c/p\u003e\n\u003cp\u003eHer two partners jumped away, long sideways strides. Eugene\u0027s head snapped around to face the woman who had called his name. She shot him through the right eye. The sound of the gun clapped and rolled across the hot landscape like thunder. The back of Eugene\u0027s head came off in a messy cloud and he went straight down and sprawled in a loose tangle of arms and legs. The woman stepped around him and crouched down and took a closer look. Then she stepped away and stood up straight with her legs and arms spread, like she was ready to be searched at the airport.\u003c/p\u003e\n\u003cp\u003e\"Check,\" she said.\u003c/p\u003e\n\u003cp\u003eThe two men stepped close and examined every inch of her skin and clothing. They checked her hair and her hands.\u003c/p\u003e\n\u003cp\u003e\"Clear,\" the small dark man said.\u003c/p\u003e\n\u003cp\u003e\"Clear,\" the tall fair man said.\u003c/p\u003e\n\u003cp\u003eShe nodded. A faint smile. No residue. No evidence. No blood or bone or brains anywhere on her person.\u003c/p\u003e\n\u003cp\u003e\"O.K.,\" she said.\u003c/p\u003e\n\u003cp\u003eThe two men stepped back to Eugene and took an arm and a leg each and dragged his body ten feet into the brush. They had found a narrow limestone cleft there, a crack in the rock maybe eight feet deep and a foot and a half across, wide enough to take a man\u0027s corpse sideways, too narrow to admit the six-foot wingspan of a vulture or a buzzard. They maneuvered the body until the trailing hand and the trailing foot fell into the hole. Then they lowered away carefully until they were sure the torso would fit. This guy was fatter than some. But he slid in without snagging on the rock. As soon as they were sure, they dropped him the rest of the way. He wedged tight, about seven feet down.\u003c/p\u003e\n\u003cp\u003eThe bloodstains were already drying and blackening. They kicked desert dust over them and swept the area with a mesquite branch to confuse the mass of footprints. Then they walked over and climbed into the Crown Vic and the driver backed up and swung through the brush. Bounced through the dip and up the slope to the roadway. The big car nosed back the way it had come and accelerated gently to fifty-five miles an hour. Moments later it passed by Eugene\u0027s white Mercedes, parked right where he\u0027d left it, on the other side of the road. It already looked abandoned and filmed with dust.\u003c/p\u003e\n\u003cp\u003e\"I have a daughter,\" Carmen Greer said. \"I told you that, right?\"\u003c/p\u003e\n\u003cp\u003e\"You told me you were a mother,\" Reacher said.\u003c/p\u003e\n\u003cp\u003eShe nodded at the wheel. \"Of a daughter. She\u0027s six and a half years old.\"\u003c/p\u003e\n\u003cp\u003eThen she went quiet for a minute.\u003c/p\u003e\n\u003cp\u003e\"They called her Mary Ellen,\" she said.\u003c/p\u003e\n\u003cp\u003e\"They?\"\u003c/p\u003e\n\u003cp\u003e\"My husband\u0027s family.\"\u003c/p\u003e\n\u003cp\u003e\"They named your kid?\"\u003c/p\u003e\n\u003cp\u003e\"It just happened, I guess. I wasn\u0027t in a good position to stop it.\"\u003c/p\u003e\n\u003cp\u003eReacher was quiet for a beat.\u003c/p\u003e\n\u003cp\u003e\"What would you have called her?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"Gloria, maybe. I thought she was glorious.\"\u003c/p\u003e\n\u003cp\u003eShe went quiet again.\u003c/p\u003e\n\u003cp\u003e\"But she\u0027s Mary Ellen,\" he said.\u003c/p\u003e\n\u003cp\u003eShe nodded. \"They call her Ellie, for short. Miss Ellie, sometimes.\"\u003c/p\u003e\n\u003cp\u003e\"And she\u0027s six and a half?\"\u003c/p\u003e\n\u003cp\u003e\"But we\u0027ve been married less than seven years. I told you that, too, right? So you can do the math. Is that a problem?\"\u003c/p\u003e\n\u003cp\u003e\"Doing the math?\"\u003c/p\u003e\n\u003cp\u003e\"Thinking about the implication.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head at the windshield. \"Not a problem to me. Why would it be?\"\u003c/p\u003e\n\u003cp\u003e\"Not a problem to me, either,\" she said. \"But it explains why I wasn\u0027t in a good position.\"\u003c/p\u003e\n\u003cp\u003eHe made no reply.\u003c/p\u003e\n\u003cp\u003e\"We got off to all kinds of a bad start,\" she said. \"Me and his family.\"\u003c/p\u003e\n\u003cp\u003eShe said it with a dying fall in her voice, the way a person might refer back to a tragedy in the past, a car wreck, a plane crash, a fatal diagnosis. The way a person might refer back to the day her life changed forever. She gripped the wheel and the car drove itself on, a cocoon of cold and quiet in the blazing landscape.\u003c/p\u003e\n\u003cp\u003e\"Who are they?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"The Greers,\" she said. \"An old Echo County family. Been there since Texas was first stolen. Maybe they were there to steal some of it themselves.\"\u003c/p\u003e\n\u003cp\u003e\"What are they like?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re what you might expect,\" she said. \"Old white Texans, big money from way back, a lot of it gone now but a lot of it still left, some history with oil and cattle ranching, river-baptized Protestants, not that they ever go to church or think about what the Lord might be saying to them. They hunt animals for pleasure. The father died some time ago, the mother is still alive, there are two sons, and there are cousins all over the county. My husband is the elder boy, Sloop Greer.\"\u003c/p\u003e\n\u003cp\u003e\"Sloop?\" Reacher said.\u003c/p\u003e\n\u003cp\u003eShe smiled for the first time since driving out of die ditch.\u003c/p\u003e\n\u003cp\u003e\"Sloop,\" she said again.\u003c/p\u003e\n\u003cp\u003e\"What kind of a name is that?\"\u003c/p\u003e\n\u003cp\u003e\"An old family name,\" she said. \"Some ancestor, I guess. Probably he was at the Alamo, fighting against mine.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds like a boat. What\u0027s the other boy called? Yacht? Tug? Ocean liner? Oil tanker?\"\u003c/p\u003e\n\u003cp\u003e\"Robert,\" she said. \"People call him Bobby.\"\u003c/p\u003e\n\u003cp\u003e\"Sloop,\" Reacher said again. \"That\u0027s a new one to me.\"\u003c/p\u003e\n\u003cp\u003e\"New to me, too,\" she said. \"The whole thing was new to me. But I used to like his name. It marked him out, somehow.\"\u003c/p\u003e\n\u003cp\u003e\"I guess it would.\"\u003c/p\u003e\n\u003cp\u003e\"I met him in California,\" Carmen said. \"We were in school together, UCLA.\"\u003c/p\u003e\n\u003cp\u003e\"Off of his home turf,\" Reacher said.\u003c/p\u003e\n\u003cp\u003eShe stopped smiling. \"Correct. Only way it could have happened, looking back. If I\u0027d have met him out here, you know, with the whole package out in plain view, it would never have happened. No way. I can promise you that. Always assuming I\u0027d even come out here, in the first place, which I hope I wouldn\u0027t have.\"\u003c/p\u003e\n\u003cp\u003eShe stopped talking and squinted ahead into the glare of the sun. There was a ribbon of black road and a bright shape up ahead on the left, shiny aluminum broken into moving fragments by the haze boiling up off the blacktop.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s the diner,\" she said. \"They\u0027ll have coffee, I\u0027m sure.\"\u003c/p\u003e\n\u003cp\u003e\"Strange kind of a diner if it didn\u0027t,\" he said.\u003c/p\u003e\n\u003cp\u003e\"There are lots of strange things here,\" she said.\u003c/p\u003e\n\u003cp\u003eThe diner sat alone on the side of the road, set on a slight rise in the center of an acre of beaten dirt serving as its parking lot. There was a sign on a tall pole and no shade anywhere. There were two pick-up trucks, carelessly parked, far from each other.\u003c/p\u003e\n\u003cp\u003e\"O.K.,\" she said, hesitant, starting to slow the car. \"Now you\u0027re going to run. You figure one of those guys with the pick-ups will give you a ride.\"\u003c/p\u003e\n\u003cp\u003eHe said nothing.\u003c/p\u003e\n\u003cp\u003e\"If you are, do it later, O.K.?\" she said. \"Please? I don\u0027t want to be left alone in a place like this.\"\u003c/p\u003e\n\u003cp\u003eShe slowed some more and bounced off the road onto the dirt. Parked right next to the sign pole, as if it was a shade tree offering protection from the sun. Its slender shadow fell across the hood like a bar. She pushed the lever into Park and switched off the engine. The air conditioner\u0027s compressor hissed and gurgled in the sudden silence. Reacher opened his door. The heat hit him like a steelyard furnace. It was so intense he could barely catch his breath. He stood dumb for a second and waited for her and then they walked together across the hot dirt. It was baked dry and hard, like concrete. Beyond it was a tangle of mesquite brush and a blinding white-hot sky as far as the eye could see. He let her walk half a pace ahead of him, so he could watch her. She had her eyes half-closed and her head bowed, like she didn\u0027t want to see or be seen. The hem on her dress had fallen to a decorous knee-length. She moved very gracefully, like a dancer, her upper body erect and perfectly still and her bare legs scissoring elegantly below it.\u003c/p\u003e\n\u003cp\u003eThe diner had a tiny foyer with a cigarette machine and a rack full of flyers about real estate and oil changes and small-town rodeos and gun shows. Inside the second door it was cold again. They stood together in the delicious chill for a moment. There was a register next to the door and a tired waitress sitting sideways on a counter stool. A cook visible in the kitchen. Two men in separate booths, eating. All four people looked up and paused, like there were things they could say but wouldn\u0027t.\u003c/p\u003e\n\u003cp\u003eReacher looked at each of them for a second and then turned away and led Carmen to a booth at the far end of the room. He slid across sticky vinyl and tilted his head back into a jet of cold air coming down from a vent in the ceiling. Carmen sat opposite and raised her head and he looked at her face-on for the first time.\u003c/p\u003e\n\u003cp\u003e\"My daughter looks nothing at all like me,\" she said. \"Sometimes I think that\u0027s the cruelest irony in this whole situation. Those big old Greer genes just about steamrollered mine, that\u0027s for sure.\"\u003c/p\u003e\n\u003cp\u003eShe had spectacular dark eyes with long lashes and a slight tilt to them, and a straight nose that made an open Y-shape against her brows. High cheekbones framed by thick black hair that shone navy in the light. A rosebud of a mouth with a subtle trace of red lipstick. Her skin was smooth and clear, the color of weak tea or dark honey, and it had a translucent glow behind it. It was actually a whole lot lighter in color than Reacher\u0027s own sunburned forearms, and he was white and she wasn\u0027t.\u003c/p\u003e\n\u003cp\u003e\"So who does Ellie look like?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Them,\" she said.\u003c/p\u003e\n\u003cp\u003eThe waitress brought ice water and a pad and a pencil and an upturned chin and no conversation. Carmen ordered iced coffee and Reacher ordered his hot and black.\u003c/p\u003e\n\u003cp\u003e\"She doesn\u0027t look like she\u0027s mine at all,\" Carmen said. \"Pink skin, yellow hair, a little chubby. But she\u0027s got my eyes.\"\u003c/p\u003e\n\u003cp\u003e\"Lucky Ellie,\" Reacher said.\u003c/p\u003e\n\u003cp\u003eShe smiled briefly. \"Thank you. Plan is she should stay lucky.\"\u003c/p\u003e\n\u003cp\u003eShe held the water glass flat against her face. Then she used a napkin to wipe the dew away. The waitress brought their drinks. The iced coffee was in a tall glass, and she spilled some of it as she put it down. Reacher\u0027s was in an insulated plastic carafe, and she shoved an empty china mug across the table next to it. She left the check face down halfway between the two drinks, and walked away without saying anything at all.\u003c/p\u003e\n\u003cp\u003e\"You need to understand I loved Sloop once,\" Carmen said.\u003c/p\u003e\n\u003cp\u003eReacher made no reply, and she looked straight at him.\u003c/p\u003e\n\u003cp\u003e\"Does it bother you to hear this kind of stuff?\" she asked.\u003c/p\u003e\n\u003cp\u003eHe shook his head, although the truth was it did bother him, a little. Loners aren\u0027t necessarily too comfortable with a stranger\u0027s intimacies.\u003c/p\u003e\n\u003cp\u003e\"You told me to start at the beginning,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said. \"I did.\"\u003c/p\u003e\n\u003cp\u003e\"So I will,\" she said. \"I loved him once. You need to understand that. And you need to understand that wasn\u0027t hard to do. He was big, and he was handsome, and he smiled a lot, and he was casual, and he was relaxed. And we were in school and we were young, and L.A. is a very special place, where anything seems possible and nothing seems to matter very much.\"\u003c/p\u003e\n\u003cp\u003eShe took a drinking straw from the canister on the table and unwrapped it.\u003c/p\u003e\n\u003cp\u003e\"And you need to know where I was coming from,\" she said. \"Truth is, I had it all completely backward. I wasn\u0027t some Mexican worrying about whether the white family would accept me. I was worrying about my family accepting this gringo boy. That\u0027s how it seemed to me. I come from a thousand acres in Napa, we\u0027ve been there forever, we were always the richest people I knew. And the most cultured. We had the art, and the history, and the music. We gave to museums. We employed white people. So I spent my time worrying about what my folks would say about me marrying out.\"\u003c/p\u003e\n\u003cp\u003eHe sipped his coffee. It was stewed and old, but it would do.\u003c/p\u003e\n\u003cp\u003e\"And what did they say?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"They went insane. I thought they were being foolish. Now I understand they weren\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"So what happened?\"\u003c/p\u003e\n\u003cp\u003eShe sipped her drink through the straw. Took a napkin from a canister and dabbed her lips. It came away marked with her lipstick.\u003c/p\u003e\n\u003cp\u003e\"Well, I was pregnant,\" she said. \"And that made everything a million times worse, of course. My parents are very devout, and they\u0027re very traditional, and basically they cut me off, I guess. They disowned me. It was like the whole Victorian thing, expelled from the snowy doorstep with a bundle of rags, except it wasn\u0027t snowing, of course, and the bundle of rags was really a Louis Vuitton valise.\"\u003c/p\u003e\n\u003cp\u003e\"So what did you do?\"\u003c/p\u003e\n\u003cp\u003e\"We got married. Nobody came, just a few friends from school. We lived a few months in L.A., we graduated, we stayed there until the baby was a month away. It was fun, actually. We were young and in love.\"\u003c/p\u003e\n\u003cp\u003eHe poured himself a second cup of coffee.\u003c/p\u003e\n\u003cp\u003e\"But?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"But Sloop couldn\u0027t find a job. I began to realize he wasn\u0027t trying very hard. Getting a job wasn\u0027t in his plan. College was four years of fun for him, then it was back to the fold, go take over Daddy\u0027s business. His father was ready to retire by then. I didn\u0027t like that idea. I thought we were starting up fresh, on our own, you know, a new generation on both sides. I felt I\u0027d given stuff up, and I thought he should, too. So we argued a lot. I couldn\u0027t work, because of being so pregnant, and I had no money of my own. So in the end we couldn\u0027t make the rent, so in the end he won the argument, and we trailed back here to Texas, and we moved in to the big old house with his folks and his brother and his cousins all around, and I\u0027m still there.\"\u003c/p\u003e\n\u003cp\u003eThe dying fall was back in her voice. The day her life changed forever.\u003c/p\u003e\n\u003cp\u003e\"And?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe looked straight at him. \"And it was like the ground opens up and you fall straight through to hell. It was such a shock, I couldn\u0027t even react at all. They treated me strange, and the second day I suddenly realized what was going on. All my life I\u0027d been like a princess, you know, and then I was just a hip kid among ten thousand others in L.A., but now I was suddenly just a piece of beaner trash. They never said it straight out, but it was so clear. They hated me, because I was the greaseball whore who\u0027d hooked their darling boy. They were painfully polite, because I guess their strategy was to wait for Sloop to come to his senses and dump me. It happens, you know, in Texas. The good old boys, when they\u0027re young and foolish, they like a little dark meat. Sometimes it\u0027s like a rite of passage. Then they wise up and straighten out. I knew that\u0027s what they were thinking. And hoping. And it was a shock, believe me. I had never thought of myself like that. Never. I\u0027d never had to. Never had to confront it. The whole world was turned upside down, in an instant. Like falling in freezing water. Couldn\u0027t breathe, couldn\u0027t think, couldn\u0027t even move.\"\u003c/p\u003e\n\u003cp\u003e\"But he didn\u0027t dump you, evidently.\"\u003c/p\u003e\n\u003cp\u003eShe looked down at the table.\u003c/p\u003e\n\u003cp\u003e\"No,\" she said. \"He didn\u0027t dump me. He started hitting me instead. First time, he punched me in the face. Then Ellie was born the next day.\"\u003c/p\u003e\n\u003cp\u003eThe Crown Victoria turned back into a normal Hertz rental behind a stand of trees eight miles off the highway, halfway between Abilene and Big Spring. The Virginia plates came off, and the Texas plates went back on. The plastic wheel covers were kicked back into place. The cellular antennas were peeled off the rear glass and laid back in the valise. The CB whips pulled clear of the sheet metal and joined them. The souvenir ball caps were nested together and packed away with the handguns. Eugene\u0027s mobile phone was smashed against a rock and the pieces hurled deep into the thicket. A little grit from the shoulder of the road was sprinkled onto the front passenger seat, so that the rental people would have to vacuum up any of Eugene\u0027s stray hairs and fibers along with it.\u003c/p\u003e\n\u003cp\u003eThen the big sedan pulled back onto the blacktop and wound its way back to the highway. It cruised comfortably, heading west, a forgettable vehicle filled with three forgettable people. It made one more stop, at a comfort area named for the Colorado River, where sodas were consumed and a call was made from an untraceable payphone. The call was to Las Vegas, from where it was rerouted to Dallas, from where it was rerouted to an office in a small town in the west of Texas. The call reported complete success so far, and it was gratefully received.\u003c/p\u003e\n\u003cp\u003e\"He Split my lip and loosened my teeth,\" Carmen Greer said.\u003c/p\u003e\n\u003cp\u003eReacher watched her face.\u003c/p\u003e\n\u003cp\u003e\"That was the first time,\" she said. \"He just lost it. But straight away he was full of remorse. He drove me to the emergency room himself. It\u0027s a long, long drive from the house, hours and hours, and the whole way he was begging me to forgive him. Then he was begging me not to tell the truth about what had happened. He seemed really ashamed, so I agreed. But I never had to say anything anyway, because as soon as we arrived I started into labor and they took me straight upstairs to the delivery unit. Ellie was born the next day.\"\u003c/p\u003e\n\u003cp\u003e\"And then what?\"\u003c/p\u003e\n\u003cp\u003e\"And then it was O.K.,\" she said. \"For a week, at least. Then he started hitting me again. I was doing everything wrong. I was paying too much attention to the baby, I didn\u0027t want sex because I was hurting from the stitches. He said I had gotten fat and ugly from the pregnancy.\"\u003c/p\u003e\n\u003cp\u003eReacher said nothing.\u003c/p\u003e\n\u003cp\u003e\"He got me believing it,\" she said. \"For a long, long time. That happens, you know. You\u0027ve got to be very self-confident to resist it. And I wasn\u0027t, in that situation. He took away all my self-esteem. Two or three years, I thought it was my fault, and I tried to do better.\"\u003c/p\u003e\n\u003cp\u003e\"What did the family do?\"\u003c/p\u003e\n\u003cp\u003eShe pushed her glass away. Left the iced coffee half-finished.\u003c/p\u003e\n\u003cp\u003e\"They didn\u0027t know about it,\" she said. \"And then his father died, which made it worse. He was the only reasonable one. He was O.K. But now it\u0027s just his mother and his brother. He\u0027s awful, and she\u0027s a witch. And they still don\u0027t know. It happens in secret. It\u0027s a big house. It\u0027s like a compound, really. We\u0027re not all on top of each other. And it\u0027s all very complicated. He\u0027s way too stubborn and proud to ever agree with them he\u0027s made a mistake. So the more they\u0027re down on me, the more he pretends he loves me. He misleads them. He buys me things. He bought me this ring.\"\u003c/p\u003e\n\u003cp\u003eShe held up her right hand, bent delicately at the wrist, showing off the platinum band with the big diamond. It looked like a hell of a thing. Reacher had never bought a diamond ring. He had no idea what they cost. A lot, he guessed.\u003c/p\u003e\n\u003cp\u003e\"He bought me horses,\" she said. \"They knew I wanted horses, and he bought them for me, so he could look good in front of them. But really to explain away the bruises. It was his stroke of genius. A permanent excuse. He makes me say I\u0027ve fallen off. They know I\u0027m still just learning to ride. And that explains a lot in rodeo country, bruises and broken bones. They take it for granted.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s broken your bones?\"\u003c/p\u003e\n\u003cp\u003eShe nodded, and started touching parts of her body, twisting and turning in the confines of the tight booth, silently recounting her injuries, hesitating slightly now and then like she couldn\u0027t recall them all.\u003c/p\u003e\n\u003cp\u003e\"My ribs, first of all, I guess,\" she said. \"He kicks me when I\u0027m on the floor. He does that a lot, when he\u0027s mad. My left arm, by twisting it. My collarbone. My jaw. I\u0027ve had three teeth reimplanted.\"\u003c/p\u003e\n\u003cp\u003eHe stared at her.\u003c/p\u003e\n\u003cp\u003eShe shrugged. \"The emergency room people think I\u0027m the worst rider in the history of the West.\"\u003c/p\u003e\n\u003cp\u003e\"They believe it?\"\u003c/p\u003e\n\u003cp\u003e\"Maybe they just choose to.\"\u003c/p\u003e\n\u003cp\u003e\"And his mother and brother?\"\u003c/p\u003e\n\u003cp\u003e\"Likewise,\" she said. \"Obviously I\u0027m not going to get the benefit of the doubt.\"\u003c/p\u003e\n\u003cp\u003e\"Why the hell did you stick around? Why didn\u0027t you just get out, the very first time?\"\u003c/p\u003e\n\u003cp\u003eShe sighed, and she closed her eyes, and she turned her head away. Spread her hands on the table, palms down, and then turned them over, palms up.\u003c/p\u003e\n\u003cp\u003eI can\u0027t explain it,\" she whispered. \"Nobody can ever explain it. You have to know what it\u0027s like. I had no confidence in myself. I had a newborn baby and no money. Not a dime. I had no friends. I was watched all the time. I couldn\u0027t even make a call in private.\"\u003c/p\u003e\n\u003cp\u003eHe said nothing. She opened her eyes and looked straight at him.\u003c/p\u003e\n\u003cp\u003e\"And worst of all, I had nowhere to go,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Home?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e\"I never even thought about it,\" she said. \"Taking the beatings was better than trying to crawl back to my family, with a white blond baby in my arms.\"\u003c/p\u003e\n\u003cp\u003eHe said nothing.\u003c/p\u003e\n\u003cp\u003e\"And the first time you pass up the chance, you\u0027ve had it,\" she said. \"That\u0027s how it is. It just gets worse. Whenever I thought about it, I still had no money, I still had a baby, then she was a one-year-old, then a two-year-old, then a three-year-old. The time is never right. If you stay that first time, you\u0027re trapped forever. And I stayed that first time. I wish I hadn\u0027t, but I did.\"\u003c/p\u003e\n\u003cp\u003eHe said nothing. She looked at him, appealing for something.\u003c/p\u003e\n\u003cp\u003e\"You have to take it on faith,\" she said. \"You don\u0027t know how it is. You\u0027re a man, you\u0027re big and strong, somebody hits you, you hit him back. You\u0027re on your own, you don\u0027t like someplace, you move on. It\u0027s different for me. Even if you can\u0027t understand it, you have to believe it.\"\u003c/p\u003e\n\u003cp\u003eHe said nothing.\u003c/p\u003e\n\u003cp\u003e\"I could have gone if I\u0027d left Ellie,\" she said. \"Sloop told me if I left the baby with him, he\u0027d pay my fare anyplace I wanted to go. First class. He said he\u0027d call a limo all the way from Dallas, right there and then, to take me straight to the airport.\"\u003c/p\u003e\n\u003cp\u003eHe said nothing.\u003c/p\u003e\n\u003cp\u003e\"But I wouldn\u0027t do that,\" she said quietly. \"I mean, how could I? So Sloop makes out this is my choice. Like I\u0027m agreeing to it. Like I want it. So he keeps on hitting me. Punching me, kicking me, slapping me. Humiliating me, sexually. Every day, even if he isn\u0027t mad at me. And if he is mad at me, he just goes crazy.\"\u003c/p\u003e\n\u003cp\u003eThere was silence. Just the rush of air from the cooling vents in the diner\u0027s ceiling. Vague noise from the kitchens. Carmen Greer\u0027s low breathing. The clink of fracturing ice in her abandoned glass. He looked across the table at her, tracing his gaze over her hands, her arms, her neck, her face. The neckline of her dress had shifted left, and he could see a thickened knot on her collarbone. A healed break, no doubt about it. But she was sitting absolutely straight, with her head up and her eyes defiant, and her posture was telling him something.\u003c/p\u003e\n\u003cp\u003e\"He hits you every day?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe closed her eyes. \"Well, almost every day. Not literally, I guess. But three, four times in a week, usually. Sometimes more. It feels like every day.\"\u003c/p\u003e\n\u003cp\u003eHe was quiet for a long moment, looking straight at her.\u003c/p\u003e\n\u003cp\u003eThen he shook his head.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re making it up,\" he said.\u003c/p\u003e\n\u003cp\u003eThe watchers stayed resolutely on station, even though there was nothing much to watch. The red house baked under the sun and stayed quiet. The maid came out and got in a car and drove away in a cloud of dust, presumably to the market. There was some horse activity around the barn. A couple of listless ranch hands walked the animals out and around, brushed them down, put them back inside. There was a bunkhouse way back beyond the barn, same architecture, same blood-red siding. It looked mostly empty, because the barn was mostly empty. Maybe five horses in total, one of them the pony for the kid, mostly just resting in their stalls because of the terrible heat.\u003c/p\u003e\n\u003cp\u003eThe maid came back and carried packages into the kitchen. The boy made a note of it in his book. The dust from her wheels floated slowly back to earth and the men with the telescopes watched it, with their tractor caps reversed to keep the sun off their necks.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re lying to me,\" Reacher said.\u003c/p\u003e\n\u003cp\u003eCarmen turned away to the window. Red spots the size of quarters crept high into her cheeks. Anger, he thought. Or embarrassment, maybe.\u003c/p\u003e\n\u003cp\u003e\"Why do you say that?\" she asked, quietly.\u003c/p\u003e\n\u003cp\u003e\"Physical evidence,\" he said. \"You\u0027ve got no bruising visible anywhere. Your skin is clear. Light makeup, too light to be hiding anything. It\u0027s certainly not hiding the fact you\u0027re blushing like crazy. You look like you\u0027ve just stepped out of the beauty parlor. And you\u0027re moving easily. You skipped across that parking lot like a ballerina. So you\u0027re not hurting anyplace. You\u0027re not stiff and sore. If he\u0027s hitting you almost every day, he must be doing it with a feather.\"\u003c/p\u003e\n\u003cp\u003eShe was quiet for a beat. Then she nodded.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s more to tell you,\" she said.\u003c/p\u003e\n\u003cp\u003eHe looked away.\u003c/p\u003e\n\u003cp\u003e\"The crucial part,\" she said. \"The main point.\"\u003c/p\u003e\n\u003cp\u003e\"Why should I listen?\"\u003c/p\u003e\n\u003cp\u003eShe took another drinking straw and unwrapped it. Flattened the paper tube that had covered it and began rolling it into a tight spiral, between her finger and thumb.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" she said. \"But I had to get your attention.\"\u003c/p\u003e\n\u003cp\u003eReacher turned his head and looked out of the window, too. The sun was moving the bar of shadow across the Cadillac\u0027s hood like the finger on a clock.\u003c/p\u003e\n\u003cp\u003eHis attention? He recalled opening his motel room door that morning. A brand-new day, ready and waiting to be filled with whatever came his way. He recalled the reflection of the cop in the mirror and the sticky whisper of the Cadillac\u0027s tires on the hot pavement as they slowed alongside him.\u003c/p\u003e\n\u003cp\u003e\"O.K., you got my attention,\" he said, looking out at the car.\u003c/p\u003e\n\u003cp\u003e\"It happened for five whole years,\" she said. \"Exactly like I told you, I promise. Almost every day. But then it stopped, a year and a half ago. But I had to tell it to you backward, because I needed you to listen to me.\"\u003c/p\u003e\n\u003cp\u003eHe said nothing.\u003c/p\u003e\n\u003cp\u003e\"This isn\u0027t easy,\" she said. \"Telling this stuff to a stranger.\"\u003c/p\u003e\n\u003cp\u003eHe turned back to face her. \"It isn\u0027t easy listening to it.\"\u003c/p\u003e\n\u003cp\u003eShe took a breath. \"You going to run out on me?\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"I almost did, a minute ago.\"\u003c/p\u003e\n\u003cp\u003eShe was quiet again.\u003c/p\u003e\n\u003cp\u003e\"Please don\u0027t,\" she said. \"At least not here. Please. Just listen a little more.\"\u003c/p\u003e\n\u003cp\u003eHe looked straight at her.\u003c/p\u003e\n\u003cp\u003e\"O.K., I\u0027m listening,\" he said.\u003c/p\u003e\n\u003cp\u003e\"But will you still help me?\"\u003c/p\u003e\n\u003cp\u003e\"With what?\"\u003c/p\u003e\n\u003cp\u003eShe said nothing.\u003c/p\u003e\n\u003cp\u003e\"What did it feel like?\" he asked. \"Getting hit?\"\u003c/p\u003e\n\u003cp\u003e\"Feel like?\" she repeated.\u003c/p\u003e\n\u003cp\u003e\"Physically,\" he said.\u003c/p\u003e\n\u003cp\u003eShe looked away. Thought about it.\u003c/p\u003e\n\u003cp\u003e\"Depends where,\" she said.\u003c/p\u003e\n\u003cp\u003eHe nodded. She knew it felt different in different places.\u003c/p\u003e\n\u003cp\u003e\"The stomach,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I threw up a lot,\" she said. \"I was worried, because there was blood.\"\u003c/p\u003e\n\u003cp\u003eHe nodded again. She knew what it felt like to be hit in the stomach.\u003c/p\u003e\n\u003cp\u003e\"I swear it\u0027s true,\" she said. \"Five whole years. Why would I make it up?\"\u003c/p\u003e\n\u003cp\u003e\"So what happened?\" he said. \"Why did he stop?\"\u003c/p\u003e\n\u003cp\u003eShe paused, like she was aware people might be looking at her. Reacher glanced up, and saw heads turn away. The cook, the waitress, the two guys at the distant tables. The cook and the waitress were faster about it than the two guys chose to be. There was hostility in their faces.\u003c/p\u003e\n\u003cp\u003e\"Can we go now?\" she asked. \"We need to get back. It\u0027s a long drive.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m coming with you?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the whole point,\" she said.\u003c/p\u003e\n\u003cp\u003eHe glanced away again, out of the window.\u003c/p\u003e\n\u003cp\u003e\"Please, Reacher,\" she said. \"At least hear the rest of the story, and then decide. I can let you out in Pecos, if you won\u0027t come all the way to Echo. You can see the museum. You can see Clay Allison\u0027s grave.\"\u003c/p\u003e\n\u003cp\u003eHe watched the bar of shadow touch the Cadillac\u0027s windshield. The interior would be like a furnace by now.\u003c/p\u003e\n\u003cp\u003e\"You should see it anyway,\" she said. \"If you\u0027re exploring Texas.\"\u003c/p\u003e\n\u003cp\u003e\"O.K.,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" she said.\u003c/p\u003e\n\u003cp\u003eHe made no reply.\u003c/p\u003e\n\u003cp\u003e\"Wait for me,\" she said. \"I need to go to the bathroom. It\u0027s a long drive.\"\u003c/p\u003e\n\u003cp\u003eShe slid out of the booth with uninjured grace and walked the length of the room, head down, looking neither left nor right. The two guys at the tables watched her until she was almost past them and then switched their blank gazes straight back to Reacher. He ignored them and turned the check over and dumped small change from his pocket on top of it, exact amount, no tip. He figured a waitress who didn\u0027t talk didn\u0027t want one. He slid out of the booth and walked to the door. The two guys watched him all the way. He stood in front of the glass and looked out beyond the parking lot. Watched the flat land bake under the sun for a minute or two until he heard her footsteps behind him. Her hair was combed and she had done something with her lipstick.\u003c/p\u003e\n\u003cp\u003e\"I guess I\u0027ll use the bathroom too,\" he said.\u003c/p\u003e\n\u003cp\u003eShe glanced right, halfway between the two guys.\u003c/p\u003e\n\u003cp\u003e\"Wait until I\u0027m in the car,\" she said. \"I don\u0027t want to be left alone in here. I shouldn\u0027t have come in here in the first place.\"\u003c/p\u003e\n\u003cp\u003eShe pushed out through the doors and he watched her to the car. She got in and he saw it shudder as she started the engine to run the air. He turned and walked back to the men\u0027s room. It was a fair-sized space, two porcelain urinals and one toilet cubicle. A chipped sink with a cold water faucet. A fat roll of paper towels sitting on top of the machine it should have been installed in. Not the cleanest facility he had ever seen.\u003c/p\u003e\n\u003cp\u003eHe unzipped and used the left-hand urinal. Heard footsteps outside the door and glanced up at the chromium valve that fed the flush pipes. It was dirty, but it was rounded and it reflected what was behind him like a tiny security mirror. He saw the door open and a man step inside. He saw the door close again and the man settle back against it. He was one of the customers. Presumably one of the pick-up drivers. The chromium valve distorted the view, but the guy\u0027s head was nearly to the top of the door. Not a small person. And he was fiddling blindly behind his back. Reacher heard the click of the door lock. Then the guy shifted again and hung his hands loose by his sides. He was wearing a black T-shirt. There was writing on it, but Reacher couldn\u0027t read it backward. Some kind of an insignia. Maybe an oil company.\u003c/p\u003e\n\u003cp\u003e\"You new around here?\" the guy asked. Reacher made no reply. Just watched the reflection. \"I asked you a question,\" the guy said. Reacher ignored him. \"I\u0027m talking to you,\" the guy said.\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s a big mistake,\" Reacher said. \"All you know, I might be a polite type of person. I might feel obligated to turn around and listen, whereupon I\u0027d be pissing all over your shoes.\"\u003c/p\u003e\n\u003cp\u003eThe guy shuffled slightly, caught out. Clearly he had some kind of set speech prepared, which was what Reacher had been counting on. A little improvised interruption might slow him down some. Maybe enough to get zipped up and decent. The guy was still shuffling, deciding whether to react.\u003c/p\u003e\n\u003cp\u003e\"So I guess it\u0027s down to me to tell you,\" he said. \"Somebody\u0027s got to.\" He wasn\u0027t reacting. No talent for repartee. \"Tell me what?\" Reacher asked. \"How it is around here.\" Reacher paused a beat. The only problem with coffee was its diuretic effect. \"And how is it around here?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Around here, you don\u0027t bring beaners into decent folks\u0027 places.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" Reacher said.\u003c/p\u003e\n\u003cp\u003e\"What part don\u0027t you understand?\"\u003c/p\u003e\n\u003cp\u003eReacher breathed out. Maybe ten seconds to go. \"I didn\u0027t understand any of it,\" he said.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t bring beaners in a place like this.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s a beaner?\" Reacher asked.\u003c/p\u003e\n\u003cp\u003eThe guy took a step forward. His reflection grew disproportionately larger. \"Latinos,\" he said. \"Eat beans all the time.\"\u003c/p\u003e\n\u003cp\u003e\"Latina,\" Reacher said. \"With an a. Gender counts with inflected languages. And she had iced coffee. Haven\u0027t seen her eat a bean all day.\"\u003c/p\u003e\n\u003cp\u003e\"You some kind of a smart guy?\"\u003c/p\u003e\n\u003cp\u003eReacher finished and zipped up with a sigh. Didn\u0027t flush. A place like that, it didn\u0027t seem like standard practice. He just turned to the sink and operated the faucet.\u003c/p\u003e\n\u003cp\u003e\"Well, I\u0027m smarter than you,\" he said. \"That\u0027s for damn sure. But then, that\u0027s not saying much. This roll of paper towels is smarter than you. A lot smarter. Each sheet on its own is practically a genius, compared to you. They could stroll into Harvard, one by one, full scholarships for each of them, while you\u0027re still struggling with your GED.\"\u003c/p\u003e\n\u003cp\u003eIt was like taunting a dinosaur. Some kind of a brontosaurus, where the brain is a very long distance from anyplace else. The sound went in, and some time later it was received and understood. Four or five seconds, until it showed in the guy\u0027s face. Four or five seconds after that, he swung with his right. It was a ponderous slow swing with a big bunched fist on the end of a big heavy arm, aiming wide and high for Reacher\u0027s head. It could have caused some damage, if it had landed. But it didn\u0027t land. Reacher caught the guy\u0027s wrist in his left palm and stopped the swing dead. A loud wet smack echoed off the bathroom tile.\u003c/p\u003e\n\u003cp\u003e\"The bacteria on this floor are smarter than you,\" he said.\u003c/p\u003e\n\u003cp\u003eHe twisted his hips ninety degrees so his groin was protected and he squeezed the guy\u0027s wrist with his hand. There had been a time when he could break bones by squeezing with his hand. It was more about blind determination than sheer strength.\u003c/p\u003e\n\u003cp\u003eBut right then, he didn\u0027t feel it.\u003c/p\u003e\n\u003cp\u003e\"This is your lucky day,\" he said. \"All I know, you could be a cop. So I\u0027m going to let you go.\"\u003c/p\u003e\n\u003cp\u003eThe guy was staring desperately at his wrist, watching it get crushed. The clammy flesh was swelling and going red.\u003c/p\u003e\n\u003cp\u003e\"After you apologize,\" Reacher said.\u003c/p\u003e\n\u003cp\u003eThe guy stared on, four or five seconds. Like a dinosaur.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" he said. \"I apologize.\"\u003c/p\u003e\n\u003cp\u003e\"Not to me, asshole,\" Reacher said. \"To the lady.\"\u003c/p\u003e\n\u003cp\u003eThe guy said nothing. Reacher turned up the pressure. Felt his thumb go slick with sweat, sliding up over the tip of his index finger. Felt the bones in the guys wrist click and move. The radius and the ulna, getting closer than nature intended.\u003c/p\u003e\n\u003cp\u003eO.K.,\" the guy gasped. \"Enough.\"\u003c/p\u003e\n\u003cp\u003eReacher released the wrist. The guy snatched it back and cradled his hand. Panting, looking up, looking down.\u003c/p\u003e\n\u003cp\u003e\"Give me the keys to your truck,\" Reacher said.\u003c/p\u003e\n\u003cp\u003eThe guy twisted awkwardly to get into his right pocket with his left hand. Held out a large bunch of keys.\u003c/p\u003e\n\u003cp\u003e\"Now go wait for me in the parking lot,\" Reacher said.\u003c/p\u003e\n\u003cp\u003eThe guy unlocked the door left-handed and shuffled out. Reacher dropped the keys in the unflushed urinal and washed his hands again. Dried them carefully with the paper towels and left the bathroom behind him. He found the guy out in the lot, halfway between the diner door and the Cadillac.\u003c/p\u003e\n\u003cp\u003e\"Be real nice, now,\" Reacher called to him. \"Maybe offer to wash her car or something. She\u0027ll say no, but it\u0027s the thought that counts, right? If you\u0027re creative enough, you get your keys back. Otherwise, you\u0027re walking home.\"\u003c/p\u003e\n\u003cp\u003eHe could see through the tinted glass that she was watching them approach, not understanding. He motioned with his hand that she should let her window down. A circular motion, like winding a handle. She buzzed the glass down, maybe two inches, just wide enough to frame her eyes. They were wide and worried.\u003c/p\u003e\n\u003cp\u003e\"This guy\u0027s got something to say to you,\" Reacher said.\u003c/p\u003e\n\u003cp\u003eHe stepped back. The guy stepped up. Looked down at the ground, and then back at Reacher, like a whipped dog. Reacher nodded, encouragingly. The guy put his hand on his chest, like an operatic tenor or a fancy maitred. Bent slightly from the waist, to address the two-inch gap in the glass.\u003c/p\u003e\n\u003cp\u003e\"Ma\u0027am,\" he said. \"Just wanted to say we\u0027d all be real pleased if y\u0027all would come back real soon, and would you like me to wash your car, seeing as you\u0027re here right now?\"\u003c/p\u003e\n\u003cp\u003e\"What?\" she said.\u003c/p\u003e\n\u003cp\u003eThey both turned separately to Reacher, the guy pleading, Carmen astonished.\u003c/p\u003e\n\u003cp\u003e\"Beat it,\" he said. \"I left your keys in the bathroom.\"\u003c/p\u003e\n\u003cp\u003eFour, five seconds later, the guy was back on his way to the diner. Reacher stepped around the hood to his door. Pulled it open.\u003c/p\u003e\n\u003cp\u003e\"I thought you were running out on me,\" Carmen said. \"I thought you\u0027d asked that guy for a ride.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d rather ride with you,\" he said.\u003c/p\u003e\n\u003cp\u003eThe Crown Victoria drove south to a lonely crossroads hamlet. There was an old diner on the right and a vacant lot on the left. A melted stop line on the road. Then a decrepit gas station, and opposite it a one-room schoolhouse. Dust and heat shimmer everywhere. The big car slowed and crawled through the junction at walking pace. It rolled past the school gate and then suddenly picked up speed and drove away.\u003c/p\u003e\n\u003cp\u003eLittle Ellie Greer watched it go. She was in a wooden chair at the schoolroom window, halfway through raising the lid of her big blue lunch box. She heard the brief shriek of rubber as the car accelerated. She turned her head and stared after it. She was a serious, earnest child, much given to silent observation. She kept her big dark eyes on the road until the dust settled. Then she turned back to matters at hand and inspected her lunch, and wished her mom had been home to pack it, instead of the maid, who belonged to the Greers and was mean. \u003c/p\u003e","sourceLink":"https://allnovel.net/echo-burning-jack-reacher-5/page-2.html","bookId":2343,"creation":"Oct 5, 2019 9:59:42 AM","modification":"Oct 5, 2019 9:59:42 AM"}
