{"id":43438,"no":9,"title":"CHAPTER III. CONSEQUENCES.","content":"\u0026nbsp;The first consequence of these principles is, that the laws alone can decree punishments for crimes, and this authority can only rest with the legislator, who represents collective society as united by a social contract. No magistrate (who is part of society) can justly inflict punishments upon another member of the same society. But since a punishment that exceeds the legally fixed limit is the lawful punishment plus another one, a magistrate can, under no pretext of zeal or the public good, add to the penalty already decreed against a delinquent citizen. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The second consequence is, that the sovereign, who represents society itself, can only form general laws, obligatory on all; he cannot judge whether[125] any one in particular has broken the social compact, for in that case the nation would be divided into two parties, one represented by the sovereign, asserting the violation of such contract; the other by the accused, denying the same. Hence the necessity of a third person to judge of the fact; in other words, of a magistrate, whose decisions shall simply consist of affirmations or denials of particular facts, and shall also be subject to no appeal.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The third consequence is this: if it were proved that the severity of punishments were simply useless (to say nothing of being directly opposed to the public good and to the very object of preventing crimes), even in that case it would be contrary not only to those beneficent virtues that flow from an enlightened reason, which prefers to rule over happy human beings than over a flock of slaves, the constant victims of timid cruelty, but it would be also contrary to justice and to the nature of the social contract itself.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2814/77772.html","bookId":410,"creation":"Aug 11, 2019 6:49:45 AM","modification":"Aug 11, 2019 6:49:45 AM"}
