{"id":68049,"no":1,"title":"Page 1","content":"\u003cp\u003eEarly in 1944 German Intelligence was piecing together evidence of a huge army in southeastern England. Reconnaissance planes brought back photographs of barracks and airflelds and fleets of ships in the Wash; General George S. Patton was seen in his unmistakable pink jodhpurs walking his white bulldog; there were bursts of wireless activity, signals between regiments in the area, confirming signs were reported by German spies in Britain.\u003c/p\u003e\n\u003cp\u003eThere was no army, of course. The ships were rubber-and-timber fakes, the barracks no more real than a movie set; Patton did not have a single man under his command; the radio signals were meaningless; the spies were double agents.\u003c/p\u003e\n\u003cp\u003eThe object was to fool the enemy into preparing for an invasion via the Pas de Calais, so that on D-Day the Normandy assault would have the advantage of surprise.\u003c/p\u003e\n\u003cp\u003eIt was a huge, near-impossible deception. Literally thousands of people were involved in perpetrating the trick. It would have been a miracle if none of Hitler\u0027s spies ever got to know about it.\u003c/p\u003e\n\u003cp\u003eWere there any spies? At the time people thought they were surrounded by what were then called Fifth Columnists. After the war a myth grew up that MI5 had rounded up the lot by Christmas 1939. The truth seems to be that there were very few; MI5 did capture nearly all of them.\u003c/p\u003e\n\u003cp\u003eBut it only needs one...\u003c/p\u003e\n\u003cp\u003eIt is known that the Germans saw the signs they were meant to see in East Anglia. It is also known that they suspected a trick, and that they tried very hard to discover the truth.\u003c/p\u003e\n\u003cp\u003eThat much is history. What follows is fiction.\u003c/p\u003e\n\u003cp\u003eStill and all, one suspects something like this must have happened.\u003c/p\u003e\n\u003cp\u003e\"The Germans were almost completely deceived, only Hitler guessed right, and he hesitated to back his hunch...\"\u003c/p\u003e\n\u003cp\u003eA. J. P. Taylor,\u003c/p\u003e\n\u003cp\u003eEnglish History 1914-1945 \u003c/p\u003e","sourceLink":"https://allnovel.net/eye-of-the-needle/page-1.html","bookId":2679,"creation":"Oct 5, 2019 10:07:56 AM","modification":"Oct 5, 2019 10:07:56 AM"}
