{"id":101562,"no":1,"title":"Page 1","content":"\u003cp\u003eFresh Meat\u003c/p\u003e\n\u003cp\u003eAlan Gordon\u003c/p\u003e\n\u003cp\u003eAlan is the author of the Fools\u0027 Guild Mysteries, published by St. Martin\u0027s Minotaur Books, continuing the adventures of Theophilos, a thirteenth-century jester. Titles in the series include Thirteenth Night (now available from Crum Creek Press), Jester Leaps In, A Death in the Venetian uarter, The Widow of Jerusalem, An Antic Disposition, The Lark\u0027s Lament, The Moneylender of Toulouse, and the upcoming The Parisian Prodigal. Alan sold his first short story to Alfred Hitchcock Mystery Magazine in 1990. Since then, he\u0027s had numerous mystery, fantasy, and science fiction stories in Hitchcock, Ellery Queen Mystery Magazine , Asimov\u0027s Science Fiction, and several anthologies. By day, Alan is a criminal defense attorney with the Legal Aid Society of New York, with over a hundred trials to his credit. He lives in New York City with his wife, Judy Downer, an editor, and son, Robert. He is a graduate of Swarthmore College, where he received the William Plumer Potter Award for Fiction, and the University of Chicago Law School.\u003c/p\u003e\n\u003cp\u003e\"Your order\u0027s ready, Mister Lehrmann,\" called Bert, emerging from the back room wiping his hands on a bloody towel. \"Two sides of beef, so fresh they were mooing yesterday.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks, Bert,\" said Lehrmann. \"That should keep us through the twenty-sixth. Okay if I bring the van around back?\"\u003c/p\u003e\n\u003cp\u003e\"No problem, Mister L,\" said Bert. \"What are you doing for Christmas? Family coming over?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m expecting some tonight. Maybe.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s nice,\" said Bert. \"Nothing like having family on Christmas Eve. Let\u0027s see, you just paid me for the month, so we\u0027ll put this on your tab for January, okay?\"\u003c/p\u003e\n\u003cp\u003e\"Works for me,\" said Lehrmann, signing the proffered receipt. His nose crinkled happily as he scanned the display case.\u003c/p\u003e\n\u003cp\u003e\"Those lamb chops look good,\" he said. \"Maybe I should get the dogs a treat for Christmas. Got a lamb you haven\u0027t cut up yet?\"\u003c/p\u003e\n\u003cp\u003e\"Sure thing,\" said Bert, adding it to the invoice.\u003c/p\u003e\n\u003cp\u003eLehrmann stepped outside to where the cargo van was parked, the LEHRMANN\u0027S GUARD DOGS ad on both sides. He pulled it around to the loading dock where Bert was already waiting with the beef and lamb on a dolly.\u003c/p\u003e\n\u003cp\u003e\"Those dogs eat better than most people,\" commented Bert as Lehrmann hauled the meat into the van. \"Not that I\u0027m complaining to my best customer. You really think they should get fresh, raw meat every day?\"\u003c/p\u003e\n\u003cp\u003e\"Part of their training,\" said Lehrmann. \"The bloodier, the better. Brings out the hunter in them.\"\u003c/p\u003e\n\u003cp\u003e\"Sure wouldn\u0027t want to run into one of your puppies on the job,\" said Bert.\u003c/p\u003e\n\u003cp\u003e\"You really wouldn\u0027t,\" said Lehrmann, slamming the rear doors shut. \"See you Monday, Bert. Have a good Christmas.\"\u003c/p\u003e\n\u003cp\u003eLehrmann raised and trained his dogs in a converted warehouse ten miles out of town, not far from the woods. A large, white sign marked the turnoff onto the farm road that led to it. The Spinellis came in at two for their last training session with Waldo. They were a family of four, living in one of the McMansions in the new development. The Doberman sensed them before he could even see them, and started baying a greeting.\u003c/p\u003e\n\u003cp\u003e\"Waldo, hush,\" Lehrmann said to the dog, and he quieted down immediately. Lehrmann opened the cage and attached the lead to Waldo\u0027s collar, then brought him out to the training pit while the other dogs watched with professional interest.\u003c/p\u003e\n\u003cp\u003e\"Afternoon, folks,\" he said. \"Everyone ready?\"\u003c/p\u003e\n\u003cp\u003e\"Ready as I\u0027ll ever be,\" said Mr. Spinelli nervously.\u003c/p\u003e\n\u003cp\u003e\"Hi, Waldo,\" said Sally, the fearless eleven-year-old, and Waldo wagged his tail. Sandy, her little brother, watched from behind her, his thumb in his mouth.\u003c/p\u003e\n\u003cp\u003e\"You can hang out for a few minutes while I get my padding on,\" said Lehrmann. \"Here.\"\u003c/p\u003e\n\u003cp\u003eHe tossed the reward bag to Mr. Spinelli, and the lead to Mrs. Spinelli, who gave a quick whistle. Waldo immediately sat at her feet.\u003c/p\u003e\n\u003cp\u003e\"Good dog,\" she said, patting his head.\u003c/p\u003e\n\u003cp\u003eLehrmann strapped the quilted padding over his arms and torso, then faced them.\u003c/p\u003e\n\u003cp\u003e\"Any time,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Waldo, come,\" commanded Mr. Spinelli, unclipping the lead from the dog\u0027s collar, and the dog followed him as he walked around. \"Good dog. Waldo, perimeter.\"\u003c/p\u003e\n\u003cp\u003eWaldo ran around the edge of the pit.\u003c/p\u003e\n\u003cp\u003e\"Waldo, here,\" said Mrs. Spinelli. The dog made a beeline for her. She looked at Lehrmann. \"Are you sure about this?\"\u003c/p\u003e\n\u003cp\u003e\"Go ahead,\" smiled Lehrmann.\u003c/p\u003e\n\u003cp\u003e\"Waldo, arm,\" she said, pointing at Lehrmann.\u003c/p\u003e\n\u003cp\u003eWaldo turned into a snarling, speeding set of teeth, hurtling toward Lehrmann. The dog leapt, and his jaws closed around the padding on the trainer\u0027s shoulder.\u003c/p\u003e\n\u003cp\u003e\"Waldo, here,\" said Mr, Spinelli.\u003c/p\u003e\n\u003cp\u003eThe dog relinquished his hold immediately and returned to the family.\u003c/p\u003e\n\u003cp\u003e\"Good dog,\" said Mr. Spinelli.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t forget the meat, Daddy,\" said Sally.\u003c/p\u003e\n\u003cp\u003e\"Good dog,\" repeated Mr. Spinelli, handing him a chunk of beef from the reward bag.\u003c/p\u003e\n\u003cp\u003eWaldo wolfed it down.\u003c/p\u003e\n\u003cp\u003e\"Dog biscuits won\u0027t do?\" asked Spinelli as Lehrmann stripped off the padding.\u003c/p\u003e\n\u003cp\u003e\"You want to keep him on your side, make it fresh meat,\" said Lehrmann. \"You do want to keep him on your side, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes,\" said Mrs. Spinelli.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve invested time and money to get not just a guardian, but a companion and a friend,\" said Lehrmann, coming forward to rub Waldo\u0027s neck. \"A long time ago, dogs found us, and learned how to protect us. In exchange, we learned how to feed them, and we fed them well. Co-evolution. Any dog can be trained to attack strangers, but a great dog, like Waldo here, won\u0027t be attacking strangers. He will be defending you, because you\u0027re his family and he loves you. Remember that.\"\u003c/p\u003e\n\u003cp\u003e\"We will,\" promised Mr. Spinelli.\u003c/p\u003e\n\u003cp\u003e\"Let me get him his new collar,\" said Lehrmann. \"Waldo, come.\"\u003c/p\u003e\n\u003cp\u003eWaldo swallowed the last of his food, and followed Lehrmann to his office in back. The trainer took out a thick, black leather collar and put it around the dog\u0027s neck. Waldo looked at him attentively.\u003c/p\u003e\n\u003cp\u003e\"Sorry you can\u0027t be here for Christmas, Waldo,\" said Lehrmann. \"But you get to spend it with your new family. They are good people, and they will treat you well. Make me proud.\"\u003c/p\u003e\n\u003cp\u003eThe dog nodded, and Lehrmann planted a quick kiss on the top of his head.\u003c/p\u003e\n\u003cp\u003e\"Here\u0027s your Christmas dog,\" Lehrmann said as he brought Waldo back out.\u003c/p\u003e\n\u003cp\u003e\"And here you are,\" said Mr. Spinelli, handing him a check.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll bring him back for visits,\" said Mrs. Spinelli.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like that,\" said Lehrmann. \"It\u0027s been a pleasure.\"\u003c/p\u003e\n\u003cp\u003eWaldo woofed at him once as they took him to their car.\u003c/p\u003e\n\u003cp\u003e\"Merry Christmas!\" cried the children.\u003c/p\u003e\n\u003cp\u003eLehrmann waved, then closed the door and turned back to the rest of the dogs. They looked at him in anticipation.\u003c/p\u003e\n\u003cp\u003e\"Playtime,\" he called, pressing a switch on the wall, and the doors all swung open at once.\u003c/p\u003e\n\u003cp\u003eThe dogs burst out of the cages and charged madly into the pit, racing and colliding with each other. There was a mad pileup at one end as several skidded into the padding on the curve, launching a number of wrestling matches. As they played, Lehrmann went methodically through the cages, cleaning each thoroughly. Then he went into the walk-in refrigerator and hauled out one of the sides of beef. Using an electric butcher\u0027s saw, he hacked it into dog-sized portions. He laid them out in inpidual bowls, then came back out to the arena.\u003c/p\u003e\n\u003cp\u003e\"Chow!\" he called, and the dogs abandoned their melee and raced to their cages. He closed the doors, then began distributing the bowls.\u003c/p\u003e\n\u003cp\u003eWhile the dogs ate, Lehrmann hauled out an artificial Christmas tree and began stringing lights over its branches.\u003c/p\u003e\n\u003cp\u003eFrom the woods at the rear of the warehouse, a man watched through a pair of binoculars, catching glimpses of Lehrmann as he passed by the windows, his arms full of wreaths and ribbons.\u003c/p\u003e\n\u003cp\u003e\"Very festive,\" muttered the man.\u003c/p\u003e\n\u003cp\u003eHe was wearing a ribbed black sweater that was fine for the Georgia winter, along with black jeans and boots. A ski cap covered his hair, but his chin and jaw were covered with a matted, gray beard. His legs were thick and powerful.\u003c/p\u003e\n\u003cp\u003eHe had been keeping his vigil from the woods the entire day, making sure that Lehrmann would be alone tonight. He had watched the Spinellis leave, knowing they were the last customers before Christmas, and smiled. His palms itched. He wiped them briefly on his sweater, then scratched the right one with the corner of his belt buckle. He looked through the binoculars again. Lehrmann was hanging a wreath on each of the dogs\u0027 cages.\u003c/p\u003e\n\u003cp\u003e\"Very festive indeed,\" said the man.\u003c/p\u003e\n\u003cp\u003eThe dogs made this one a challenge. He couldn\u0027t risk breaking into the warehouse and planting any bugs. He had used a combination of a long-range listening device that bounced an infrared beam off the windows, and a monitor that picked up any nearby cell phone signals. The arrangement still left gaps in the sound. And any time one of the damn dogs started barking, the infrared could have been a flashlight for all the dialogue he was picking up.\u003c/p\u003e\n\u003cp\u003eLehrmann was unfolding a six-foot cardboard Santa Claus and hanging it on a wall.\u003c/p\u003e\n\u003cp\u003e\"Now, that one is just plain tacky,\" said the watcher.\u003c/p\u003e\n\u003cp\u003eThe cell phone monitor chirped. He squatted down and turned the volume up.\u003c/p\u003e\n\u003cp\u003eLehrmann picked up his cell phone from his desk.\u003c/p\u003e\n\u003cp\u003e\"Lehrmann\u0027s Guard Dogs,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Hi, Sam,\" said a familiar voice, and he clutched the phone hard for a moment. \"You still there?\"\u003c/p\u003e\n\u003cp\u003e\"Hello, Mona,\" he said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Christmas Eve, Sam,\" she said. \"I thought you might like some company.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got company,\" he said.\u003c/p\u003e\n\u003cp\u003e\"You know what I mean,\" said Mona. \"Dogs don\u0027t count.\"\u003c/p\u003e\n\u003cp\u003e\"Man\u0027s best friend,\" said Lehrmann. \"Didn\u0027t you know that?\"\u003c/p\u003e\n\u003cp\u003e\"Only when the man has no woman,\" said Mona. \"You\u0027re in Georgia, Sam. Not Alaska. Georgia. A man in Georgia doesn\u0027t need to spend the only Christmas Eve of the year with a bunch of dogs.\"\u003c/p\u003e\n\u003cp\u003e\"You been drinking, Mona?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s going to be a beautiful night,\" she continued. \"Crisp and clear, with a full moon. A full moon on Christmas Eve, Sam. That doesn\u0027t happen that often. Maybe we\u0027ll see Santa\u0027s sleigh flying across it. Yes, I have been drinking, Sam. I\u0027m alone in Georgia on Christmas Eve, and I\u0027m drinking. Can\u0027t I come over? You shouldn\u0027t be alone with a bunch of dogs.\"\u003c/p\u003e\n\u003cp\u003e\"Dogs are loyal, Mona,\" he said. He wished immediately that he hadn\u0027t.\u003c/p\u003e\n\u003cp\u003eShe was silent. He thought for a moment that she had broken the connection, but then he heard her crying.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s Nicky?\" he asked, awkwardly changing the subject.\u003c/p\u003e\n\u003cp\u003e\"Nicky\u0027s a great, big, warm, wonderful pal,\" she said. \"I am going to cuddle with Nicky tonight. I could be with you, roasting marshmallows in the fire . . .\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have a fireplace,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Please let me back into your life, Sam,\" she said softly. \"You can\u0027t shut me out forever.\"\u003c/p\u003e\n\u003cp\u003e\"Good night, Mona,\" he said. \"Merry Christmas.\"\u003c/p\u003e\n\u003cp\u003eHe broke the connection.\u003c/p\u003e\n\u003cp\u003eThe man in the woods checked his watch, then glanced up at the sky. The sun was nearing the horizon. It would be an hour until nightfall. He looked through his binoculars to see Lehrmann sitting disconsolately at the desk, staring at his cell phone, then turning it off.\u003c/p\u003e\n\u003cp\u003e\"Poor Sam,\" said the watcher. \"Full moon and empty arms.\"\u003c/p\u003e\n\u003cp\u003eAn alarm signal went off, and Carson, a five-year-old German shepherd, looked up.\u003c/p\u003e\n\u003cp\u003e\"Easy, boy,\" said Lehrmann. \"Still got an hour. Plenty of time. Finish your dinner.\"\u003c/p\u003e\n\u003cp\u003eThe dog went back to his meal, but kept glancing up at the windows.\u003c/p\u003e\n\u003cp\u003eShe was drinking early today, thought Lehrmann. God knows that the holidays will do that to a person. Hell, he was all shook up from a two-minute conversation with her, and he was the sober one.\u003c/p\u003e\n\u003cp\u003e\"Hell of a time to call, Carson,\" he said, and the dog grimaced sympathetically.\u003c/p\u003e\n\u003cp\u003eLehrmann thought back to when she\u0027d first walked through his front door. What was it, three years ago? Three and a month. It was mid-November, and he was training a Rottweiler, a ten-month-old female.\u003c/p\u003e\n\u003cp\u003eThe woman was slim, brunette, and built like a runner. Her clothes were carefully casual in a way only large amounts of money could accomplish. She had ruby drops dangling from each ear, with more strung along a gold necklace that plunged between her breasts.\u003c/p\u003e\n\u003cp\u003eHe was playing tug-of-war with the Rottweiler, using a broomstick wrapped in several layers of cloth. The dog had clamped on tight, and was digging its claws into the mat, trying to pull the broomstick out of Lehrmann\u0027s hands. She looked like she might succeed. The woman leaned forward, resting her hands on the wall of the pit, and watched.\u003c/p\u003e\n\u003cp\u003e\"Here!\" Lehrmann said suddenly.\u003c/p\u003e\n\u003cp\u003eThe Rottweiler looked up at him, but refused to relinquish the broomstick.\u003c/p\u003e\n\u003cp\u003e\"Here!\" Lehrmann commanded her again.\u003c/p\u003e\n\u003cp\u003eThe dog reluctantly let go, and moved to sit by Lehrmann\u0027s right foot. She stayed there, a resentful glare on her face.\u003c/p\u003e\n\u003cp\u003e\"Good girl,\" Lehrmann praised her, and he handed her a small piece of beef. \"Can I help you, ma\u0027am?\"\u003c/p\u003e\n\u003cp\u003e\"If I\u0027m not interrupting,\" said the woman, smiling. \"Is that raw beef?\"\u003c/p\u003e\n\u003cp\u003e\"It is,\" said Lehrmann.\u003c/p\u003e\n\u003cp\u003e\"Then you won\u0027t mind if I don\u0027t shake hands just yet,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I have been known to wash them on occasion,\" said Lehrmann. \"Give me a minute. You could shake the dog\u0027s paw while you\u0027re waiting.\"\u003c/p\u003e\n\u003cp\u003e\"Will she do that without attacking me?\" asked the woman.\u003c/p\u003e\n\u003cp\u003e\"She won\u0027t attack unless she\u0027s told to,\" said Lehrmann. \"At least, that\u0027s how it\u0027s supposed to work.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll chance it,\" said the woman, coming into the pit. She squatted down to face the dog. \"Hello. My name is Mona Havelka. What\u0027s yours?\"\u003c/p\u003e\n\u003cp\u003e\"This is Nicky,\" said Lehrmann. \"Nicky, shake.\"\u003c/p\u003e\n\u003cp\u003eThe Rottweiler immediately held out a paw, and Mona shook it.\u003c/p\u003e\n\u003cp\u003e\"Very pleased to meet you, Nicky,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Here, give her this,\" said Lehrmann, holding up a piece of beef.\u003c/p\u003e\n\u003cp\u003eMona took it and held it out for Nicky, who took it carefully from her, then licked her hand.\u003c/p\u003e\n\u003cp\u003e\"No point in standing on ceremony now,\" said Mona, holding her hand out to Lehrmann. \"Are you the owner?\"\u003c/p\u003e\n\u003cp\u003e\"Sam Lehrmann,\" he said, shaking it. \"Pleased to meet you. Let me show you where to wash up.\"\u003c/p\u003e\n\u003cp\u003eHe escorted her to a washbasin in a tool room in back and tossed her a bar of soap.\u003c/p\u003e\n\u003cp\u003e\"Guests first,\" he said, turning on the taps. \"Hope you don\u0027t mind sharing.\"\u003c/p\u003e\n\u003cp\u003e\"A gentleman,\" she said, scrubbing her hands thoroughly. \"And such a romantic spot, too.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d be surprised,\" he grinned as she handed him the soap. \"So, how may I help you?\"\u003c/p\u003e\n\u003cp\u003e\"I came to see a man about a dog,\" she said as he washed up.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m the man,\" he said. \"What kind of dog have you got in mind?\"\u003c/p\u003e\n\u003cp\u003e\"Someone to protect me when I\u0027m sleeping.\"\u003c/p\u003e\n\u003cp\u003e\"Apartment or house?\"\u003c/p\u003e\n\u003cp\u003e\"A town house,\" she said. \"In town.\"\u003c/p\u003e\n\u003cp\u003e\"You looking for something with more bark or more bite?\" he asked as they walked back into the main room.\u003c/p\u003e\n\u003cp\u003eShe looked at him, and the smile left her eyes.\u003c/p\u003e\n\u003cp\u003e\"I want a bark that will put the fear of God into anyone stupid enough to break in,\" she said. \"And a bite that will send anyone stupid enough to ignore the bark straight to Hell.\"\u003c/p\u003e\n\u003cp\u003eHe rested his chin between his thumb and forefinger, and pondered her request for a moment.\u003c/p\u003e\n\u003cp\u003e\"I have this really vicious dachshund that might fit the bill,\" he said.\u003c/p\u003e\n\u003cp\u003eShe stared at him in disbelief.\u003c/p\u003e\n\u003cp\u003e\"No, seriously, I\u0027ve been trying to get rid of the little bastard for years,\" he continued, his nose crinkling for an instant.\u003c/p\u003e\n\u003cp\u003e\"An attack dachshund,\" she said, starting to laugh.\u003c/p\u003e\n\u003cp\u003e\"Well, pretty much an ankle biter,\" he conceded. \"But let him get a running start, and that baby will take out a decent chunk of thigh.\"\u003c/p\u003e\n\u003cp\u003e\"Really,\" she said. \"I had no idea.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the element of surprise,\" he explained. \"Gets them every time.\"\u003c/p\u003e\n\u003cp\u003e\"Be serious now,\" she said.\u003c/p\u003e\n\u003cp\u003e\"All right,\" he said, opening the gate to the pit. \"Nicky, here.\"\u003c/p\u003e\n\u003cp\u003eThe Rottweiler bounded up and sat before them expectantly. Lehrmann looked into the dog\u0027s eyes, then back at Mona\u0027s.\u003c/p\u003e\n\u003cp\u003e\"This one,\" he said. \"This one is your dog.\"\u003c/p\u003e\n\u003cp\u003eLehrmann went back into the refrigerator, removed the lamb, and placed it on the butcher block. Then he took the saw and simply cut it in half. He put one part back in the refrigerator, then carried the other to a large empty cage set back from the others and placed it inside. He made sure there was plenty of water, then went back to his office, where Carson was waiting, idly scratching his ear with his hind paw.\u003c/p\u003e\n\u003cp\u003e\"You done?\" Lehrmann asked.\u003c/p\u003e\n\u003cp\u003eThe dog nodded. Lehrmann let the dog out of the office, then went around the building, checking the locks.\u003c/p\u003e\n\u003cp\u003e\"How did you get to be so good with dogs?\" she asked him one night as they lay in bed together. Nicky was downstairs, exiled to her dog bed as usual when he stayed the night.\u003c/p\u003e\n\u003cp\u003e\"I grew up with them,\" he said. \"And when I started raising them, they grew up with me. We just got to know each other better than most humans and dogs do.\"\u003c/p\u003e\n\u003cp\u003e\"But the training,\" she persisted. \"They respond to you like nothing I\u0027ve ever seen.\"\u003c/p\u003e\n\u003cp\u003e\"Something in my voice, I guess,\" he said. \"I probably have all these auditory cues I use without even being aware of it.\"\u003c/p\u003e\n\u003cp\u003e\"And they pick up on them,\" she said. \"Maybe you\u0027ve gotten it all wrong. Maybe the dogs are the ones who trained you, not the other way around.\"\u003c/p\u003e\n\u003cp\u003e\"Could be,\" he said, letting his fingers trail gently down the curve of her body. \"I never thought of it like that before.\"\u003c/p\u003e\n\u003cp\u003eHe let his hand wander and explore, and she arched her back.\u003c/p\u003e\n\u003cp\u003e\"How did you get to be so good with me?\" she gasped, and he drew her to him in response.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re tight,\" he said to Carson as he punched in the numbers on the last lock and pulled the door shut. \"Carson, patrol.\"\u003c/p\u003e\n\u003cp\u003eThe dog began loping about the building.\u003c/p\u003e\n\u003cp\u003eThe watcher pulled out his cell phone and pressed a single button.\u003c/p\u003e\n\u003cp\u003e\"Did you get the security code?\" he asked quietly.\u003c/p\u003e\n\u003cp\u003e\"Affirmative.\"\u003c/p\u003e\n\u003cp\u003e\"Good,\" said the watcher.\u003c/p\u003e\n\u003cp\u003eHe broke the connection and waited impatiently. He had been spending the day in a state of forced calm, but now, with the moment so close, he was nervous, jumpy. You would think that the killing urge would die out over the years, he thought. That the rage would gradually fade given time. Time that heals all wounds. A laughable notion in his case. With each kill, the wound seemed to rip open more, the bloodlust increased, and the only thing he could think about was the next one. Maybe Lehrmann would satisfy the urge for a while. He thought he might. Lehrmann was going to be a good one. Lehrmann was his Christmas gift to himself.\u003c/p\u003e\n\u003cp\u003eEdwards lay prone in a cornfield, watching the front of the warehouse until he saw Lehrmann go back inside. Then he crawled backward through the dried stalks until he could get to a crouching position unobserved. Still staying low, he scuttled to the rear of a barn where the surveillance van was parked. He tapped twice, then three times, on the side door. It slid open, and he clambered inside.\u003c/p\u003e\n\u003cp\u003eKenner was behind the wheel. Hidalgo was in the back, monitoring the police radio.\u003c/p\u003e\n\u003cp\u003e\"Any of that coffee left?\" asked Edwards.\u003c/p\u003e\n\u003cp\u003e\"In the pot,\" said Hidalgo. \"Make it quick. It\u0027s almost time.\"\u003c/p\u003e\n\u003cp\u003eEdwards poured himself a cup, threw in three sugars and some creamer, and stirred it. He drank it in two gulps, then began putting on the padding.\u003c/p\u003e\n\u003cp\u003e\"Did you guys ever feel like we work for a crazy person?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Sometimes,\" said Kenner. \"Then I see my paycheck and the feeling goes away.\"\u003c/p\u003e\n\u003cp\u003e\"And he\u0027s not so crazy,\" said Hidalgo.\u003c/p\u003e\n\u003cp\u003e\"What makes you think so?\" asked Edwards, tightening the straps to make sure nothing crucial was exposed.\u003c/p\u003e\n\u003cp\u003e\"Because he\u0027s making you go in first,\" explained Hidalgo.\u003c/p\u003e\n\u003cp\u003e\"You got a point,\" said Edwards. \"Ever feel like I\u0027ve become a crazy person?\"\u003c/p\u003e\n\u003cp\u003e\"That we do,\" said Kenner, checking his watch, then his gun.\u003c/p\u003e\n\u003cp\u003eLehrmann went back to the large cage and checked his watch. Fifteen minutes. He stripped off his clothes and hung them from a pair of hooks. Then he took off his watch and placed it on a table so that it faced the cage. He checked the timer on the lock, then stepped inside and pulled the door shut. The lock engaged.\u003c/p\u003e\n\u003cp\u003eCarson came by and sat in front of the cage.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s locked,\" said Lehrmann, shaking the bars to prove it. \"Thanks for checking, buddy. I\u0027m good.\"\u003c/p\u003e\n\u003cp\u003eThe dog woofed once, then resumed his patrolling.\u003c/p\u003e\n\u003cp\u003eThe clanging of the cage echoed through the watcher\u0027s earpiece. He smiled.\u003c/p\u003e\n\u003cp\u003e\"Next,\" he said softly.\u003c/p\u003e\n\u003cp\u003eAt the Spinelli house, Waldo made a thorough inspection of every room. Then he heard a whistle, and galloped down the stairs to the front hallway.\u003c/p\u003e\n\u003cp\u003eSally was waiting for him with his leash.\u003c/p\u003e\n\u003cp\u003e\"Time for your walk, Waldo,\" she said, clipping it to his collar. \"Mom? I\u0027m taking Waldo for a walk around the block.\"\u003c/p\u003e\n\u003cp\u003e\"Sweetie, it\u0027s getting dark,\" called her mother from the kitchen. \"Don\u0027t be too long.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, come on, hon,\" said her husband. \"Think who\u0027s with her. She\u0027ll be the safest girl in the neighborhood. Take your time, kiddo. Show Waldo who\u0027s friendly and where the weirdos are.\"\u003c/p\u003e\n\u003cp\u003e\"\u0027Kay, \u0027bye,\" she called, leading him out the front door.\u003c/p\u003e\n\u003cp\u003eLehrmann looked through the bars at his watch. Five minutes. He sat cross-legged in the middle of the cage and took deep slow breaths. He held his hands out at his sides, palms up.\u003c/p\u003e\n\u003cp\u003eOutside the windows, the sky turned to night.\u003c/p\u003e\n\u003cp\u003e\"Om,\" he chanted. \"Om.\"\u003c/p\u003e\n\u003cp\u003eThe change always started inside his chest as his rib cage expanded. The surrounding muscles resisted for a moment, then began to stretch and re-form to accommodate the larger shape.\u003c/p\u003e\n\u003cp\u003e\"Om,\" he continued. \"Om.\"\u003c/p\u003e\n\u003cp\u003eIt spread up through his shoulders and neck, and down through his pelvis as the bones shifted, making crackling noises like twigs popping on a fire. The hair was sprouting now, thick, coarse, and gray.\u003c/p\u003e\n\u003cp\u003e\"Om,\" he said, clinging to the sound, concentrating all of his being in the chant.\u003c/p\u003e\n\u003cp\u003eThe arms and legs were at it now, the claws bursting through his fingers and toes. That pain was always the worst. The chant was coming out hoarsely. He was choking on it, but forced it out. Then came the jaws thrusting forward, the teeth, the fangs.\u003c/p\u003e\n\u003cp\u003eThe mind.\u003c/p\u003e\n\u003cp\u003e\"Om,\" he whimpered.\u003c/p\u003e\n\u003cp\u003eHe wanted to howl.\u003c/p\u003e\n\u003cp\u003eJust one howl.\u003c/p\u003e\n\u003cp\u003eWhat harm could one little howl do?\u003c/p\u003e\n\u003cp\u003eLet it out.\u003c/p\u003e\n\u003cp\u003e\"Om!\" he shouted.\u003c/p\u003e\n\u003cp\u003eHe took a deep breath.\u003c/p\u003e\n\u003cp\u003e\"Om,\" he chanted. \"Om.\"\u003c/p\u003e\n\u003cp\u003eHe sensed the other dogs watching him down the row of cages. Fascinated. Envious.\u003c/p\u003e\n\u003cp\u003eHis heartbeat slowed back to normal. Whatever the hell that was.\u003c/p\u003e\n\u003cp\u003eCarson came by and sat, looking at him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m good, buddy,\" said Lehrmann. \"Want to hand me the remote? Let\u0027s see what\u0027s on cable tonight.\"\u003c/p\u003e\n\u003cp\u003eCarson went over to the table where the remote control sat next to the watch. He picked it up gently with his teeth and brought it over to the cage where the werewolf sat, scratching his back. He put it on the floor, then nudged it between the bars with his nose.\u003c/p\u003e\n\u003cp\u003e\"Thanks, buddy,\" said Lehrmann, picking it up and turning on the monitor mounted on the wall outside. He tore off a chunk of the lamb carcass and shoved it through the bars to the dog. Carson grabbed it and went back on patrol.\u003c/p\u003e\n\u003cp\u003eThe usual Christmas fare. Repeats of specials he had seen dozens of times before. He flipped through them. There was the Island of Misfit Toys, and Linus wrapping his blanket to shore up that pathetic little tree. He growled with displeasure and turned it off.\u003c/p\u003e\n\u003cp\u003e\"Oh, I love this one!\" she cried. \"Best \u0027Christmas Carol\u0027 ever!\"\u003c/p\u003e\n\u003cp\u003eThey were cuddling on the couch downstairs, a bowl of popcorn and a pitcher of bourbon-laced eggnog on the coffee table. Nicky was curled up on the far end, forcing them together. He wondered if that was her intent.\u003c/p\u003e\n\u003cp\u003e\"The Mister Magoo one was the best,\" said Lehrmann.\u003c/p\u003e\n\u003cp\u003e\"Never saw that one,\" she said.\u003c/p\u003e\n\u003cp\u003e\"They used to show it when I was a kid,\" he said. \"The Ghost of Christmas Future scared the crap out of me.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s no surprise,\" she said. \"The future always scares you.\"\u003c/p\u003e\n\u003cp\u003eHe looked at her.\u003c/p\u003e\n\u003cp\u003e\"Where did that come from?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Oh, come off it, Sam,\" she said. \"It\u0027s Christmas Eve. Our third together. Only we\u0027re not completely together, are we?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m over here most nights, aren\u0027t I?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but I\u0027m a greedy little bitch, Sam,\" she said. \"I want them all. Where were you Tuesday night?\"\u003c/p\u003e\n\u003cp\u003e\"I was home.\"\u003c/p\u003e\n\u003cp\u003e\"Now, that\u0027s simply a lie,\" she said. \"I called you at home, and you didn\u0027t answer. And when I drove by, no one was there.\"\u003c/p\u003e\n\u003cp\u003e\"Wait, Tuesday. You\u0027re right, I wasn\u0027t home. I was at the warehouse most of the night. Waldo wasn\u0027t feeling well. He\u0027s this new Doberman puppy, and - \"\u003c/p\u003e\n\u003cp\u003e\"I called your cell, Sam.\"\u003c/p\u003e\n\u003cp\u003e\"Battery was dead. I forgot to recharge it.\"\u003c/p\u003e\n\u003cp\u003e\"And I went by the warehouse, Sam.\"\u003c/p\u003e\n\u003cp\u003eHe was silent for a moment.\u003c/p\u003e\n\u003cp\u003e\"You did,\" he said. \u003c/p\u003e","sourceLink":"https://allnovel.net/wolfsbane-and-mistletoe/page-1.html","bookId":2202,"creation":"Oct 5, 2019 10:05:10 PM","modification":"Oct 5, 2019 10:05:10 PM"}
