{"id":36827,"no":1,"title":"FORE-GLIMPSE","content":"\u0026nbsp;‘I would rather be an angel than God!’ \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The voice of the speaker sounded clearly through the hawthorn tree. \u0026nbsp;The young man and the young girl who sat together on the low tombstone looked at each other. \u0026nbsp;They had heard the voices of the two children talking, but had not noticed what they said; it was the sentiment, not the sound, which roused their attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The girl put her finger to her lips to impress silence, and the man nodded; they sat as still as mice whilst the two children went on talking.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * * * * *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The scene would have gladdened a painter’s heart. \u0026nbsp;An old churchyard. \u0026nbsp;The church low and square-towered, with long mullioned windows, the yellow-grey stone roughened by age and tender-hued with lichens. \u0026nbsp;Round it clustered many tombstones tilted in all directions. \u0026nbsp;Behind the church a line of gnarled and twisted yews.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The churchyard was full of fine trees. \u0026nbsp;On one side a magnificent cedar; on the other a great copper beech. \u0026nbsp;Here and there among the tombs and headstones many beautiful blossoming trees rose from the long green grass. \u0026nbsp;The laburnum glowed in the June afternoon sunlight; the lilac, the hawthorn and the clustering meadowsweet which fringed the edge of the lazy stream mingled their heavy sweetness in sleepy fragrance. \u0026nbsp;The yellow-grey crumbling walls were green in places with wrinkled harts-tongues, and were topped with sweet-williams and spreading house-leek and stone-crop and wild-flowers whose delicious sweetness made for the drowsy repose of perfect summer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But amid all that mass of glowing colour the two young figures seated on the grey old tomb stood out conspicuously. \u0026nbsp;The man was in conventional hunting-dress: red coat, white stock, black hat, white breeches, and top-boots. \u0026nbsp;The girl was one of the richest, most glowing, and yet withal daintiest figures the eye of man could linger on. \u0026nbsp;She was in riding-habit of hunting scarlet cloth; her black hat was tipped forward by piled-up masses red-golden hair. \u0026nbsp;Round her neck was a white lawn scarf in the fashion of a man’s hunting-stock, close fitting, and sinking into a gold-buttoned waistcoat of snowy twill. \u0026nbsp;As she sat with the long skirt across her left arm her tiny black top-boots appeared underneath. \u0026nbsp;Her gauntleted gloves were of white buckskin; her riding-whip was plaited of white leather, topped with ivory and banded with gold.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Even in her fourteenth year Miss Stephen Norman gave promise of striking beauty; beauty of a rarely composite character. \u0026nbsp;In her the various elements of her race seemed to have cropped out. \u0026nbsp;The firm-set jaw, with chin broader and more square than is usual in a woman, and the wide fine forehead and aquiline nose marked the high descent from Saxon through Norman. \u0026nbsp;The glorious mass of red hair, of the true flame colour, showed the blood of another ancient ancestor of Northern race, and suited well with the voluptuous curves of the full, crimson lips. \u0026nbsp;The purple-black eyes, the raven eyebrows and eyelashes, and the fine curve of the nostrils spoke of the Eastern blood of the far-back wife of the Crusader. \u0026nbsp;Already she was tall for her age, with something of that lankiness which marks the early development of a really fine figure. \u0026nbsp;Long-legged, long-necked, as straight as a lance, with head poised on the proud neck like a lily on its stem.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen Norman certainly gave promise of a splendid womanhood. \u0026nbsp;Pride, self-reliance and dominance were marked in every feature; in her bearing and in her lightest movement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her companion, Harold An Wolf, was some five years her senior, and by means of those five years and certain qualities had long stood in the position of her mentor. \u0026nbsp;He was more than six feet two in height, deep-chested, broad-shouldered, lean-flanked, long-armed and big-handed. \u0026nbsp;He had that appearance strength, with well-poised neck and forward set of the head, which marks the successful athlete.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The two sat quiet, listening. \u0026nbsp;Through the quiet hum of afternoon came the voices of the two children. \u0026nbsp;Outside the lich-gate, under the shade of the spreading cedar, the horses stamped occasionally as the flies troubled them. \u0026nbsp;The grooms were mounted; one held the delicate-limbed white Arab, the other the great black horse.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I would rather be an angel than God!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The little girl who made the remark was an ideal specimen of the village Sunday-school child. \u0026nbsp;Blue-eyed, rosy-cheeked, thick-legged, with her straight brown hair tied into a hard bunch with a much-creased, cherry-coloured ribbon. \u0026nbsp;A glance at the girl would have satisfied the most sceptical as to her goodness. \u0026nbsp;Without being in any way smug she was radiant with self-satisfaction and well-doing. \u0026nbsp;A child of the people; an early riser; a help to her mother; a good angel to her father; a little mother to her brothers and sisters; cleanly in mind and body; self-reliant, full of faith, cheerful.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The other little girl was prettier, but of a more stubborn type; more passionate, less organised, and infinitely more assertive. \u0026nbsp;Black-haired, black-eyed, swarthy, large-mouthed, snub-nosed; the very type and essence of unrestrained, impulsive, emotional, sensual nature. \u0026nbsp;A seeing eye would have noted inevitable danger for the early years of her womanhood. \u0026nbsp;She seemed amazed by the self-abnegation implied by her companion’s statement; after a pause she replied:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I wouldn’t! \u0026nbsp;I’d rather be up at the top of everything and give orders to the angels if I chose. \u0026nbsp;I can’t think, Marjorie, why you’d rather take orders than give them.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘That’s just it, Susan. \u0026nbsp;I don’t want to give orders; I’d rather obey them. \u0026nbsp;It must be very terrible to have to think of things so much, that you want everything done your own way. \u0026nbsp;And besides, I shouldn’t like to have to be just!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why not?’ the voice was truculent, though there was wistfulness in it also.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh Susan. \u0026nbsp;Just fancy having to punish; for of course justice needs punishing as well as praising. \u0026nbsp;Now an angel has such a nice time, helping people and comforting them, and bringing sunshine into dark places. \u0026nbsp;Putting down fresh dew every morning; making the flowers grow, and bringing babies and taking care of them till their mothers find them. \u0026nbsp;Of course God is very good and very sweet and very merciful, but oh, He must be very terrible.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘All the same I would rather be God and able to do things!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the children moved off out of earshot. \u0026nbsp;The two seated on the tombstone looked after them. \u0026nbsp;The first to speak was the girl, who said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘That’s very sweet and good of Marjorie; but do you know, Harold, I like Susie’s idea better.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Which idea was that, Stephen?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why, didn’t you notice what she said: “I’d like to be God and be able to do things”?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes,’ he said after a moment’s reflection. \u0026nbsp;‘That’s a fine idea in the abstract; but I doubt of its happiness in the long-run.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Doubt of its happiness? \u0026nbsp;Come now? what could there be better, after all? \u0026nbsp;Isn’t it good enough to be God? \u0026nbsp;What more do you want?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The girl’s tone was quizzical, but her great black eyes blazed with some thought of sincerity which lay behind the fun. \u0026nbsp;The young man shook his head with a smile of kindly tolerance as he answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It isn’t that—surely you must know it. \u0026nbsp;I’m ambitious enough, goodness knows; but there are bounds to satisfy even me. \u0026nbsp;But I’m not sure that the good little thing isn’t right. \u0026nbsp;She seemed, somehow, to hit a bigger truth than she knew: “fancy having to be just.”’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I don’t see much difficulty in that. \u0026nbsp;Anyone can be just!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Pardon me,’ he answered, ‘there is perhaps nothing so difficult in the whole range of a man’s work.’ \u0026nbsp;There was distinct defiance in the girl’s eyes as she asked:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘A man’s work! \u0026nbsp;Why a man’s work? \u0026nbsp;Isn’t it a woman’s work also?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, I suppose it ought to be, theoretically; practically it isn’t.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And why not, pray?’ \u0026nbsp;The mere suggestion of any disability of woman as such aroused immediate antagonism. \u0026nbsp;Her companion suppressed a smile as he answered deliberately:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Because, my dear Stephen, the Almighty has ordained that justice is not a virtue women can practise. \u0026nbsp;Mind, I do not say women are unjust. \u0026nbsp;Far from it, where there are no interests of those dear to them they can be of a sincerity of justice that can make a man’s blood run cold. \u0026nbsp;But justice in the abstract is not an ordinary virtue: it has to be considerate as well as stern, and above all interest of all kinds and of every one—’ \u0026nbsp;The girl interrupted hotly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I don’t agree with you at all. \u0026nbsp;You can’t give an instance where women are unjust. \u0026nbsp;I don’t mean of course individual instances, but classes of cases where injustice is habitual.’ \u0026nbsp;The suppressed smile cropped out now unconsciously round the man’s lips in a way which was intensely aggravating to the girl.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I’ll give you a few,’ he said. \u0026nbsp;‘Did you ever know a mother just to a boy who beat her own boy at school?’ \u0026nbsp;The girl replied quietly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ill-treatment and bullying are subjects for punishment, not justice.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, I don’t mean that kind of beating. \u0026nbsp;I mean getting the prizes their own boys contended for; getting above them in class; showing superior powers in running or cricket or swimming, or in any of the forms of effort in which boys vie with each other.’ \u0026nbsp;The girl reflected, then she spoke:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, you may be right. \u0026nbsp;I don’t altogether admit it, but I accept it as not on my side. \u0026nbsp;But this is only one case.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘A pretty common one. \u0026nbsp;Do you think that Sheriff of Galway, who in default of a hangman hanged his son with his own hands, would have done so if he had been a woman?’ \u0026nbsp;The girl answered at once:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Frankly, no. \u0026nbsp;I don’t suppose the mother was ever born who would do such a thing. \u0026nbsp;But that is not a common case, is it? \u0026nbsp;Have you any other?’ \u0026nbsp;The young man paused before he spoke:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘There is another, but I don’t think I can go into it fairly with you.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why not?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, because after all you know, Stephen, you are only a girl and you can’t be expected to know.’ \u0026nbsp;The girl laughed:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, if it’s anything about women surely a girl, even of my tender age, must know something more of it, or be able to guess at, than any young man can. \u0026nbsp;However, say what you think and I’ll tell you frankly if I agree—that is if a woman can be just, in such a matter.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Shortly the point is this: Can a woman be just to another woman, or to a man for the matter of that, where either her own affection or a fault of the other is concerned?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I don’t see any reason to the contrary. \u0026nbsp;Surely pride alone should ensure justice in the former case, and the consciousness of superiority in the other.’ \u0026nbsp;The young man shook his head:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Pride and the consciousness of superiority! \u0026nbsp;Are they not much the same thing. \u0026nbsp;But whether or no, if either of them has to be relied on, I’m afraid the scales of Justice would want regulating, and her sword should be blunted in case its edge should be turned back on herself. \u0026nbsp;I have an idea that although pride might be a guiding principle with you individually, it would be a failure with the average. \u0026nbsp;However, as it would be in any case a rule subject to many exceptions I must let it go.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harold looked at his watch and rose. \u0026nbsp;Stephen followed him; transferring her whip into the hand which held up the skirt, she took his arm with her right hand in the pretty way in which a young girl clings to her elders. \u0026nbsp;Together they went out at the lich-gate. \u0026nbsp;The groom drew over with the horses. \u0026nbsp;Stephen patted hers and gave her a lump of sugar. \u0026nbsp;Then putting her foot into Harold’s ready hand she sprang lightly into the saddle. \u0026nbsp;Harold swung himself into his saddle with the dexterity of an accomplished rider.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As the two rode up the road, keeping on the shady side under the trees, Stephen said quietly, half to herself, as if the sentence had impressed itself on her mind:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘To be God and able to do things!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harold rode on in silence. \u0026nbsp;The chill of some vague fear was upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3234/88481.html","bookId":683,"creation":"Aug 5, 2019 7:30:07 AM","modification":"Aug 5, 2019 7:30:07 AM"}
