{"id":36845,"no":19,"title":"CHAPTER XVIII—MORE BUSINESS","content":"\u0026nbsp;When Leonard tendered the eight hundred pounds in payment of his debt of five hundred, Mr. Cavendish at first refused to take it. \u0026nbsp;But when Leonard calmly but firmly refused to pay a single penny beyond the obligations already incurred, including interest on the full sum for one day, he acquiesced. \u0026nbsp;He knew the type of man fully; and knew also that in all probability it would not be long before he would come to the Firm again on a borrowing errand. \u0026nbsp;When such time should come, he would put an extra clause into his Memorandum of Agreement which would allow the Firm full power to make whatever extra charge they might choose in case of the slightest default in making payment. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leonard’s visits to town had not of late been many, and such as he had had were not accompanied with a plethora of cash. \u0026nbsp;He now felt that he had earned a holiday; and it was not till the third morning that he returned to Brindehow. \u0026nbsp;His father made no comment on his absence; his only allusion to the subject was:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Back all right! \u0026nbsp;Any news in town?’ \u0026nbsp;There was, however, an unwonted suavity in his manner which made Leonard a little anxious. \u0026nbsp;He busied himself for the balance of the morning in getting together all his unpaid accounts and making a schedule of them. \u0026nbsp;The total at first amazed almost as much as it frightened him. \u0026nbsp;He feared what Stephen would say. \u0026nbsp;She had already commented unfavourably on the one amount she had seen. \u0026nbsp;When she was face to face with this she might refuse to pay altogether. \u0026nbsp;It would therefore be wise to propitiate her. \u0026nbsp;What could he do in this direction? \u0026nbsp;His thoughts naturally turned to the missing letter. \u0026nbsp;If he could get possession of it, it would either serve as a sop or a threat. \u0026nbsp;In the one case she would be so glad to have it back that she would not stick at a few pounds; in the other it would ‘bring her to her senses’ as he put in his own mind his intention of blackmail.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He was getting so tightened up in situation that as yet he could only do as he was told, and keep his temper as well as he could.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Altogether it was in a chastened mood that he made his appearance at Normanstand later in the afternoon. \u0026nbsp;He was evidently expected, for he was shown into the study without a word. \u0026nbsp;Here Miss Rowly and Stephen joined him. \u0026nbsp;Both were very kind in manner. \u0026nbsp;After the usual greetings and commonplaces Stephen said in a brisk, businesslike way:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Have you the papers with you?’ \u0026nbsp;He took the bundle of accounts from his pocket and handed them to her. \u0026nbsp;After his previous experience he would have suggested, had he dared, that he should see Stephen alone; but he feared the old lady. \u0026nbsp;He therefore merely said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I am afraid you will find the amount very large. \u0026nbsp;But I have put down everything!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So he had; and more than everything. \u0026nbsp;At the last an idea struck him that as he was getting so much he might as well have a little more. \u0026nbsp;He therefore added several good-sized amounts which he called ‘debts of honour.’ \u0026nbsp;This would, he thought, appeal to the feminine mind. \u0026nbsp;Stephen did not look at the papers at once. \u0026nbsp;She stood up, holding them, and said to Miss Rowly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Now, if you will talk to Mr. Everard I will go over these documents quietly by myself. \u0026nbsp;When I have been through them and understand them all I shall come back; and we will see what can be done.’ \u0026nbsp;She moved gracefully out of the room, closing the door behind her. \u0026nbsp;As is usual with women, she had more than one motive for her action in going away. \u0026nbsp;In the first place, she wished to be alone whilst she went over the schedule of the debts. \u0026nbsp;She feared she might get angry; and in the present state of her mind towards Leonard the expression of any feeling, even contempt, would not be wise. \u0026nbsp;Her best protection from him would be a manifest kindly negation of any special interest. \u0026nbsp;In the second place, she believed that he would have her letter with the other papers, and she did not wish her aunt to see it, lest she should recognise the writing. \u0026nbsp;In her boudoir, with a beating heart, she untied the string and looked through the papers.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her letter was not among them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For a few seconds she stood stock still, thinking. \u0026nbsp;Then, with a sigh, she sat down and began to read the list of debts, turning to the originals now and again for details. \u0026nbsp;As she went on, her wonder and disgust grew; and even a sense of fear came into her thoughts. \u0026nbsp;A man who could be so wildly reckless and so selfishly unscrupulous was to be feared. \u0026nbsp;She knew his father was a comparatively poor man, who could not possibly meet such a burden. \u0026nbsp;If he were thus to his father, what might he be to her if he got a chance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The thought of what he might have been to her, had he taken the chance she had given him, never occurred to her. \u0026nbsp;This possibility had already reached the historical stage in her mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She made a few pencil notes on the list; and went back to the study. \u0026nbsp;Her mind was made up.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She was quite businesslike and calm, did not manifest the slightest disapproval, but seemed to simply accept everything as facts. \u0026nbsp;She asked Leonard a few questions on subjects regarding which she had made notes, such as discounts. \u0026nbsp;Then she held the paper out to him and without any preliminary remark said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Will you please put the names to these?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘How do you mean?’ he asked, flushing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The names of the persons to whom these sums marked “debt of honour” are due.’ \u0026nbsp;His reply came quickly, and was a little aggressive; he thought this might be a good time to make a bluff:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I do not see that that is necessary. \u0026nbsp;I can settle them when I have the money.’ \u0026nbsp;Slowly and without either pause or flurry Stephen replied, looking him straight in the eyes as she handed him the papers:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Of course it is not necessary! \u0026nbsp;Few things in the world really are! \u0026nbsp;I only wanted to help you out of your troubles; but if you do not wish me to . . . !’ \u0026nbsp;Leonard interrupted in alarm:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No! no! \u0026nbsp;I only spoke of these items. \u0026nbsp;You see, being “debts of honour” I ought not to give the names.’ \u0026nbsp;Looking with a keen glance at her set face he saw she was obdurate; and, recognising his defeat, said as calmly as he could, for he felt raging:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘All right! \u0026nbsp;Give me the paper!’ \u0026nbsp;Bending over the table he wrote. \u0026nbsp;When she took the paper, a look half surprised, half indignant, passed over her face. \u0026nbsp;Her watchful aunt saw it, and bending over looked also at the paper. \u0026nbsp;Then she too smiled bitterly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leonard had printed in the names! \u0026nbsp;The feminine keenness of both women had made his intention manifest. \u0026nbsp;He did not wish for the possibility of his handwriting being recognised. \u0026nbsp;His punishment came quickly. \u0026nbsp;With a dazzling smile Stephen said to him:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But, Leonard, you have forgotten to put the addresses!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Is that necessary?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Of course it is! \u0026nbsp;Why, you silly, how is the money to be paid if there are no addresses?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leonard felt like a rat in a trap; but he had no alternative. \u0026nbsp;So irritated was he, and so anxious to hide his irritation that, forgetting his own caution, he wrote, not in printing characters but in his own handwriting, addresses evolved from his own imagination. \u0026nbsp;Stephen’s eyes twinkled as he handed her the paper: he had given himself away all round.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leonard having done all that as yet had been required of him, felt that he might now ask a further favour, so he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘There is one of those bills which I have promised to pay by Monday.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Promised?’ said Stephen with wide-opened eyes. \u0026nbsp;She had no idea of sparing him, she remembered the printed names. \u0026nbsp;‘Why, Leonard, I thought you said you were unable to pay any of those debts?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Again he had put himself in a false position. \u0026nbsp;He could not say that it was to his father he had made the promise; for he had already told Stephen that he had been afraid to tell him of his debts. \u0026nbsp;In his desperation, for Miss Rowly’s remorseless glasses were full on him, he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I thought I was justified in making the promise after what you said about the pleasure it would be to help me. \u0026nbsp;You remember, that day on the hilltop?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n If he had wished to disconcert her he was mistaken; she had already thought over and over again of every form of embarrassment her unhappy action might bring on her at his hands. \u0026nbsp;She now said sweetly and calmly, so sweetly and so calmly that he, with knowledge of her secret, was alarmed:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But that was not a promise to pay. \u0026nbsp;If you will remember it was only an offer, which is a very different thing. \u0026nbsp;You did not accept it then!’ \u0026nbsp;She was herself somewhat desperate, or she would not have sailed so close to the wind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah, but I accepted later!’ he said quickly, feeling in his satisfaction in an epigrammatic answer a certain measure of victory. \u0026nbsp;He felt his mistake when she went on calmly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Offers like that are not repeated. \u0026nbsp;They are but phantoms, after all. \u0026nbsp;They come at their own choice, when they do come; and they stay but the measure of a breath or two. \u0026nbsp;You cannot summon them!’ \u0026nbsp;Leonard fell into the current of the metaphor and answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I don’t know that even that is impossible. \u0026nbsp;There are spells which call, and recall, even phantoms!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Indeed!’ \u0026nbsp;Stephen was anxious to find his purpose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leonard felt that he was getting on, that he was again acquiring the upper hand; so he pushed on the metaphor, more and more satisfied with himself:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And it is wonderful how simple some spells, and these the most powerful, can be. \u0026nbsp;A remembered phrase, the recollection of a pleasant meeting, the smell of a forgotten flower, or the sight of a forgotten letter; any or all of these can, through memory, bring back the past. \u0026nbsp;And it is often in the past that the secret of the future lies!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Rowly felt that something was going on before her which she could not understand. \u0026nbsp;Anything of this man’s saying which she could not fathom must be at least dangerous; so she determined to spoil his purpose, whatever it might be.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Dear me! \u0026nbsp;That is charmingly poetic! \u0026nbsp;Past and future; memory and the smell of flowers; meetings and letters! \u0026nbsp;It is quite philosophy. \u0026nbsp;Do explain it all, Mr. Everard!’ \u0026nbsp;Leonard was not prepared to go on under the circumstances. \u0026nbsp;His own mention of ‘letter,’ although he had deliberately used it with the intention of frightening Stephen, had frightened himself. \u0026nbsp;It reminded him that he had not brought, had not got, the letter; and that as yet he was not certain of getting the money. \u0026nbsp;Stephen also had noted the word, and determined not to pass the matter by. \u0026nbsp;She said gaily:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘If a letter is a spell, I think you have a spell of mine, which is a spell of my own weaving. \u0026nbsp;You were to show me the letter in which I asked you to come to see me. \u0026nbsp;It was in that, I think you said, that I mentioned your debts; but I don’t remember doing so. \u0026nbsp;Show it to me!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I have not got it with me!’ \u0026nbsp;This was said with mulish sullenness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why not?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I forgot.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘That is a pity! \u0026nbsp;It is always a pity to forget things in a business transaction; as this is. \u0026nbsp;I think, Auntie, we must wait till we have all the documents, before we can complete this transaction!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Leonard was seriously alarmed. \u0026nbsp;If the matter of the loan were not gone on with at once the jeweller’s bill could not be paid by Monday, and the result would be another scene with his father. \u0026nbsp;He turned to Stephen and said as charmingly as he could, and he was all in earnest now:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I’m awfully sorry! \u0026nbsp;But these debts have been so worrying me that they put lots of things out of my head. \u0026nbsp;That bill to be paid on Monday, when I haven’t a feather to fly with, is enough to drive a fellow off his chump. \u0026nbsp;The moment I lay my hands on the letter I shall keep it with me so that I can’t forget it again. \u0026nbsp;Won’t you forgive me for this time?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Forgive!’ she answered, with a laugh. \u0026nbsp;‘Why it’s not worth forgiveness! \u0026nbsp;It is not worth a second thought! \u0026nbsp;All right! \u0026nbsp;Leonard, make your mind easy; the bill will be paid on Monday!’ \u0026nbsp;Miss Rowly said quietly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I have to be in London on Monday afternoon; I can pay it for you.’ \u0026nbsp;This was a shock to Leonard; he said impulsively:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, I say! \u0026nbsp;Can’t I . . . ’ \u0026nbsp;His words faded away as the old lady again raised her lorgnon and gazed at him calmly. \u0026nbsp;She went on:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You know, my dear, it won’t be even out of my way, as I have to call at Mr. Malpas’s office, and I can go there from the hotel in Regent Street.’ \u0026nbsp;This was all news to Stephen. \u0026nbsp;She did not know that her aunt had intended going to London; and indeed she did not know of any business with Mr. Malpas, whose firm had been London solicitor to the Rowlys for several generations. \u0026nbsp;She had no doubt, however, as to the old lady’s intention. \u0026nbsp;It was plain to her that she wanted to help. \u0026nbsp;So she thanked her sweetly. \u0026nbsp;Leonard could say nothing. \u0026nbsp;He seemed to be left completely out of it. \u0026nbsp;When Stephen rose, as a hint to him that it was time for him to go, he said humbly, as he left:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Would it be possible that I should have the receipt before Monday evening? \u0026nbsp;I want to show it to my father.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Certainly!’ said the old lady, answering him. \u0026nbsp;‘I shall be back by the two o’clock train; and if you happen to be at the railway station at Norcester when I arrive I can give it to you!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He went away relieved, but vindictive; determined in his own mind that when he had received the money for the rest of the debts he would see Stephen, when the old lady was not present, and have it out with her.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3234/88499.html","bookId":683,"creation":"Aug 5, 2019 7:30:08 AM","modification":"Aug 5, 2019 7:30:08 AM"}
