{"id":36847,"no":21,"title":"CHAPTER XX—CONFIDENCES","content":"\u0026nbsp;Miss Rowly had received a bulky letter by the morning’s post. \u0026nbsp;She had not opened it, but had allowed it to rest beside her plate all breakfast-time. \u0026nbsp;Then she had taken it away with her to her own sitting-room. \u0026nbsp;Stephen did not appear to take any notice of it. \u0026nbsp;She knew quite well that it was from some one in London whom her aunt had asked to pay Leonard’s bills. \u0026nbsp;She also knew that the old lady had some purpose in her reticence, so she waited. \u0026nbsp;She was learning to be patient in these days. \u0026nbsp;Miss Rowly did say anything about it that day, or the next, or the next. \u0026nbsp;The third-morning, she received another letter which she had read in an enlightening manner. \u0026nbsp;She began its perusal with set brow frowning, then she nodded her head and smiled. \u0026nbsp;She put the letter back in its envelope and placed it in the little bag always carried. \u0026nbsp;But she said nothing. \u0026nbsp;Stephen wondered, but waited. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n That night, when Stephen’s maid had left her, there came a gentle tap at her door, and an instant after the door opened. \u0026nbsp;The tap had been a warning, not a request; it had in a measure prepared Stephen, who was not surprised to see her Aunt in dressing-gown, though it was many a long day since she had visited her niece’s room at night. \u0026nbsp;She closed the door behind her, saying:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘There is something I want to talk to you about, dearest, and I thought it would be better to do so when there could not be any possible interruption. \u0026nbsp;And besides,’ here there was a little break in her voice, ‘I could hardly summon up my courage in the daylight.’ \u0026nbsp;She stopped, and the stopping told its own story. \u0026nbsp;In an instant Stephen’s arm’s were round her, all the protective instinct in her awake, at the distress of the woman she loved. \u0026nbsp;The old lady took comfort from the warmth of the embrace, and held her tight whilst she went on:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is about these bills, my dear. \u0026nbsp;Come and sit down and put a candle near me. \u0026nbsp;I want you to read something.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Go on, Auntie dear,’ she said gravely. \u0026nbsp;The old lady, after a pause, spoke with a certain timidity:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘They are all paid; at least all that can be. \u0026nbsp;Perhaps I had better read you the letter I have had from my solicitors:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘“Dear Madam,—In accordance with your instructions we have paid all the accounts mentioned in Schedule A (enclosed). \u0026nbsp;We have placed for your convenience three columns: (1) the original amount of each account, (2) the amount of discount we were able to arrange, and (3) the amount paid. \u0026nbsp;We regret that we have been unable to carry out your wishes with regard to the items enumerated in Schedule B (enclosed). \u0026nbsp;We have, we assure you, done all in our power to find the gentlemen whose names and addresses are therein given. \u0026nbsp;These were marked ‘Debt of honour’ in the list you handed to us. \u0026nbsp;Not having been able to obtain any reply to our letters, we sent one of our clerks first to the addresses in London, and afterwards to Oxford. \u0026nbsp;That clerk, who is well used to such inquiries, could not find trace of any of the gentlemen, or indeed of their existence. \u0026nbsp;We have, therefore, come to the conclusion that, either there must be some error with regard to (a) names, (b) addresses, or (c) both; or that no such persons exist. \u0026nbsp;As it would be very unlikely that such errors could occur in all the cases, we can only conclude that there have not been any such persons. \u0026nbsp;If we may hazard an opinion: it is possible that, these debts being what young men call ‘debts of honour,’ the debtor, or possibly the creditors, may not have wished the names mentioned. \u0026nbsp;In such case fictitious names and addresses may have been substituted for the real ones. \u0026nbsp;If you should like any further inquiry instituted we would suggest that you ascertain the exact names and addresses from the debtor. \u0026nbsp;Or should you prefer it we would see the gentleman on your behalf, on learning from you his name and address. \u0026nbsp;We can keep, in the person of either one of the Firm or a Confidential Clerk as you might prefer, any appointment in such behalf you may care to make.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘“We have already sent to you the receipted account from each of the creditors as you directed, viz. ‘Received from Miss Laetitia Rowly in full settlement to date of the account due by Mr. Leonard Everard the sum of,’ etc. etc. \u0026nbsp;And also, as you further directed, a duplicate receipt of the sum-total due in each case made out as ‘Received in full settlement to date of account due by,’ etc. etc. \u0026nbsp;The duplicate receipt was pinned at the back of each account so as to be easily detachable.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘“With regard to finance we have carried out your orders, etc.”’ \u0026nbsp;She hurried on the reading. \u0026nbsp;“These sums, together with the amounts of nine hundred pounds sterling, and seven hundred pounds sterling lodged to the account of Miss Stephen Norman in the Norcester branch of the Bank as repayment of moneys advanced to you as by your written instructions, have exhausted the sum, etc.”’ \u0026nbsp;She folded up the letter with the schedules, laying the bundle of accounts on the table. \u0026nbsp;Stephen paused; she felt it necessary to collect herself before speaking.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Auntie dear, will you let me see that letter? \u0026nbsp;Oh, my dear, dear Auntie, don’t think I mistrust you that I ask it. \u0026nbsp;I do because I love you, and because I want to love you more if it is possible to do so.’ \u0026nbsp;Miss Rowly handed her the letter. \u0026nbsp;She rose from the arm of the chair and stood beside the table as though to get better light from the candle than she could get from where she had sat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She read slowly and carefully to the end; then folded up the letter and handed it to her aunt. \u0026nbsp;She came back to her seat on the edge of the chair, and putting her arms round her companion’s neck looked her straight in the eyes. \u0026nbsp;The elder woman grew embarrassed under the scrutiny; she coloured up and smiled in a deprecatory way as she said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Don’t look at me like that, darling; and don’t shake your head so. \u0026nbsp;It is all right! \u0026nbsp;I told you I had my reasons, and you said you would trust me. \u0026nbsp;I have only done what I thought best!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But, Auntie, you have paid away more than half your little fortune. \u0026nbsp;I know all the figures. \u0026nbsp;Father and uncle told me everything. \u0026nbsp;Why did you do it? \u0026nbsp;Why did you do it?’ \u0026nbsp;The old woman held out her arms as she said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Come here, dear one, and sit on my knee as you used to when you were a child, and I will whisper you.’ \u0026nbsp;Stephen sprang from her seat and almost threw herself into the loving arms. \u0026nbsp;For a few seconds the two, clasped tight to each other’s heart, rocked gently to and fro. \u0026nbsp;The elder kissed the younger and was kissed impulsively in return. \u0026nbsp;Then she stroked the beautiful bright hair with her wrinkled hand, and said admiringly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘What lovely hair you have, my dear one!’ \u0026nbsp;Stephen held her closer and waited.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, my dear, I did it because I love you!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I know that, Auntie; you have never done anything else my life!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘That is true, dear one. \u0026nbsp;But it is right that I should do this. \u0026nbsp;Now you must listen to me, and not speak till I have done. \u0026nbsp;Keep your thoughts on my words, so that you may follow my thoughts. \u0026nbsp;You can do your own thinking about them afterwards. \u0026nbsp;And your own talking too; I shall listen as long as you like!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Go on, I’ll be good!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My dear, it is not right that you should appear to have paid the debts of a young man who is no relation to you and who will, I know well, never be any closer to you than he is now.’ \u0026nbsp;She hurried on, as though fearing an interruption, but Stephen felt that her clasp tightened. \u0026nbsp;‘We never can tell what will happen as life goes on. \u0026nbsp;And, as the world is full of scandal, one cannot be too careful not to give the scandalmongers anything to exercise their wicked spite upon. \u0026nbsp;I don’t trust that young man! he is a bad one all round, or I am very much mistaken. \u0026nbsp;And, my dear, come close to me! \u0026nbsp;I cannot but see that you and he have some secret which he is using to distress you!’ \u0026nbsp;She paused, and her clasp grew closer still as Stephen’s head sank on her breast. \u0026nbsp;‘I know you have done something or said something foolish of which he has a knowledge. \u0026nbsp;And I know my dear one, that whatever it was, and no matter how foolish it may have been, it was not a wrong thing. \u0026nbsp;God knows, we are all apt to do wrong things as well as foolish ones; the best of us. \u0026nbsp;But such is not for you! \u0026nbsp;Your race, your father and mother, your upbringing, yourself and the truth and purity which are yours would save you from anything which was in itself wrong. \u0026nbsp;That I know, my dear, as well as I know myself! \u0026nbsp;Ah! better, far better! for the gods did not think it well to dower me as they have dowered you. \u0026nbsp;The God of all the gods has given you the ten talents to guard; and He knows, as I do, that you will be faithful to your trust.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a solemn ring in her voce as the words were spoken which went through the young girl’s heart. \u0026nbsp;Love and confidence demanded in return that she should have at least the relief of certain acquiescence; there is a possible note of pain in the tensity of every string! \u0026nbsp;Stephen lifted her head proudly and honestly, though her cheeks were scarlet, saying with a consciousness of integrity which spoke directly soul to soul:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You are right, dear! \u0026nbsp;I have done something very foolish; very, very foolish! \u0026nbsp;But it was nothing which any one could call wrong. \u0026nbsp;Do not ask me what it was. \u0026nbsp;I need only tell you this: that it was an outrage on convention. \u0026nbsp;It was so foolish, and based on such foolish misconception; it sprang from such over-weening, arrogant self-opinion that it deserves the bitter punishment which will come; which is coming; which is with me now! \u0026nbsp;It was the cause of something whose blackness I can’t yet realise; but of which I will tell you when I can speak of it. \u0026nbsp;But it was not wrong in itself, or in the eyes of God or man!’ \u0026nbsp;The old woman said not a word. \u0026nbsp;No word was needed, for had she not already expressed her belief? \u0026nbsp;But Stephen felt her relief in the glad pressure of her finger-tips. \u0026nbsp;In a voice less strained and tense Miss Rowly went on:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘What need have I for money, dear? \u0026nbsp;Here I have all that any woman, especially at my age, can need. \u0026nbsp;There is no room even for charity; you are so good to all your people that my help is hardly required. \u0026nbsp;And, my dear one, I know—I know,’ she emphasised the word as she stroked the beautiful hair, ‘that when I am gone my own poor, the few that I have looked after all my life, will, not suffer when my darling thinks of me!’ \u0026nbsp;Stephen fairly climbed upon her as she said, looking in the brave old eyes:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘So help me God, my darling, they shall never want!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Silence for a time; and then Miss Rowly’s voice again:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Though it would not do for the world to know that a young maiden lady had paid the debts of a vicious young man, it makes no matter if they be paid by an old woman, be the same maid, wife, or widow! \u0026nbsp;And really, my dear, I do not see how any money I might have could be better spent than in keeping harm away from you.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘There need not be any harm at all, Auntie.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Perhaps not, dear! \u0026nbsp;I hope not with all my heart. \u0026nbsp;But I fear that young man. \u0026nbsp;Just fancy him threatening you, and in your own house; in my very presence! \u0026nbsp;Oh! yes, my dear. \u0026nbsp;He meant to threaten, anyhow! \u0026nbsp;Though I could not exactly understand what he was driving at, I could see that he was driving at something. \u0026nbsp;And after all that you were doing for him, and had done for him! \u0026nbsp;I mean, of course, after all that I had done for him, and was doing for him. \u0026nbsp;It is mean enough, surely, for a man to beg, and from a woman; but to threaten afterwards. \u0026nbsp;Ach! \u0026nbsp;But I think, my dear, it is checkmate to him this time. \u0026nbsp;All along the line the only proof that is of there being any friendliness towards him from this house points to me. \u0026nbsp;And moreover, my dear, I have a little plan in my head that will tend to show him up even better, in case he may ever try to annoy us. \u0026nbsp;Look at me when next he is here. \u0026nbsp;I mean to do a little play-acting which will astonish him, I can tell you, if it doesn’t frighten him out of the house altogether. \u0026nbsp;But we won’t talk of that yet. \u0026nbsp;You will understand when you see it!’ \u0026nbsp;Her eyes twinkled and her mouth shut with a loud snap as she spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After a few minutes of repose, which was like a glimpse of heaven to Stephen’s aching heart, she spoke again:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘There was something else that troubled you more than even this. \u0026nbsp;You said you would tell me when you were able to speak of it . . . Why not speak now? \u0026nbsp;Oh! my dear, our hearts are close together to-night; and in all your life, you will never have any one who will listen with greater sympathy than I will, or deal more tenderly with your fault, whatever it may have been. \u0026nbsp;Tell me, dear! \u0026nbsp;Dear!’ she whispered after a pause, during which she realised the depth of the girl’s emotion by her convulsive struggling to keep herself in check.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All at once the tortured girl seemed to yield herself, and slipped inertly from her grasp till kneeling down she laid her head in the motherly lap and sobbed. \u0026nbsp;Miss Rowly kept stroking her hair in silence. \u0026nbsp;Presently the girl looked up, and with a pang the aunt saw that her eyes were dry. \u0026nbsp;In her pain she said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You sob like that, my child, and yet you are not crying; what is it, oh! my dear one? \u0026nbsp;What is it that hurts you so that you cannot cry?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And then the bitter sobbing broke out again, but still alas! without tears. \u0026nbsp;Crouching low, and still enclosing her aunt’s waist with her outstretched arms and hiding her head in her breast; she said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh! Auntie, I have sent Harold away!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘What, my dear? \u0026nbsp;What?’ said the old lady astonished. \u0026nbsp;‘Why, I thought there was no one in the world that you trusted so much as Harold!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is true. \u0026nbsp;There was—there is no one except you whom I trust so much. \u0026nbsp;But I mistook something he said. \u0026nbsp;I was in a blind fury at the time, and I said things that I thought my father’s daughter never could have said. \u0026nbsp;And she never thought them, even then! \u0026nbsp;Oh, Auntie, I drove him away with all the horrible things I could say that would wound him. \u0026nbsp;And all because he acted in a way that I see now was the most noble and knightly in which any man could act. \u0026nbsp;He that my dear father had loved, and honoured, and trusted as another son. \u0026nbsp;He that was a real son to him, and not a mock sop like me. \u0026nbsp;I sent him away with such fierce and bitter pain that his poor face was ashen grey, and there was woe in his eyes that shall make woe in mine whenever I shall see them in my mind, waking or sleeping. \u0026nbsp;He, the truest friend . . . the most faithful, the most tender, the most strong, the most unselfish! \u0026nbsp;Oh! Auntie, Auntie, he just turned and bowed and went away. \u0026nbsp;And he couldn’t do anything else with the way I spoke to him; and now I shall never see him again!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The young girl’s eyes ware still dry, but the old woman’s were wet. \u0026nbsp;For a few minutes she kept softly stroking the bowed heat till the sobbing grew less and less, and then died away; and the girl lay still, collapsed in the abandonment of dry-eyed grief.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then she rose, and taking off her dressing-gown, said tenderly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Let me stay with you to-night, dear one? \u0026nbsp;Go to sleep in my arms, as you did long ago when there was any grief that you could not bear.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So Stephen lay in those loving arms till her own young breast ceased heaving, and she breathed softly. \u0026nbsp;Till dawn she slept on the bosom of her who loved her so well.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3234/88501.html","bookId":683,"creation":"Aug 5, 2019 7:30:08 AM","modification":"Aug 5, 2019 7:30:08 AM"}
