{"id":36848,"no":22,"title":"CHAPTER XXI—THE DUTY OF COURTESY","content":"\u0026nbsp;Leonard was getting tired of waiting when he received his summons to Normanstand. \u0026nbsp;But despite his impatience he was ill pleased with the summons, which came in the shape of a polite note from Miss Rowly asking him to come that afternoon at tea-time. \u0026nbsp;He had expected to hear from Stephen. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Damn that old woman! \u0026nbsp;You’d think she was working the whole show!’ \u0026nbsp;However, he turned up at a little before five o’clock, spruce and dapper and well dressed and groomed as usual. \u0026nbsp;He was shown, as before, into the blue drawing-room. \u0026nbsp;Miss Rowly, who sat there, rose as he entered, and coming across the room, greeted him, as he thought, effusively. \u0026nbsp;He actually winced when she called him ‘my dear boy’ before the butler.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She ordered tea to be served at once, and when it had been brought she said to the butler:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Tell Mannerly to bring me a large thick envelope which is on the table in my room. \u0026nbsp;It is marked L.E. on the outside.’ \u0026nbsp;Presently an elderly maid handed her the envelope and withdrew. \u0026nbsp;When tea was over she opened the envelope, and taking from it a number of folios, looked over them carefully; holding them in her lap, she said quietly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You will find writing materials on the table. \u0026nbsp;I am all ready now to hand you over the receipts.’ \u0026nbsp;His eyes glistened. \u0026nbsp;This was good news at all events; the debts were paid. \u0026nbsp;In a rapid flash of thought he came to the conclusion that if the debts were actually paid he need not be civil to the old lady. \u0026nbsp;He felt that he could have been rude to her if he had actual possession of the receipts. \u0026nbsp;As it was, however, he could not yet afford to have any unpleasantness. \u0026nbsp;There was still to come that lowering interview with his father; and he could not look towards it satisfactorily until he had the assurance of the actual documents that he was safe. \u0026nbsp;Miss Rowly was, in her own way, reading his mind in his face. \u0026nbsp;Her lorgnon seemed to follow his every expression like a searchlight. \u0026nbsp;He remembered his former interview with her, and how he had been bested in it; so he made up his mind to acquiesce in time. \u0026nbsp;He went over to the table and sat down. \u0026nbsp;Taking a pen he turned to Miss Rowly and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘What shall I write?’ \u0026nbsp;She answered calmly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Date it, and then say, “Received from Miss Laetitia Rowly the receipts for the following amounts from the various firms hereunder enumerated.”’ \u0026nbsp;She then proceeded to read them, he writing and repeating as he wrote. \u0026nbsp;Then she added:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘“The same being the total amount of my debts which she has kindly paid for me.”’ \u0026nbsp;He paused here; she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why don’t you go on?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I thought it was Stephen—Miss Norman,’ he corrected, catching sight of her lorgnon, ‘who was paying them.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Good Lord, man,’ she answered, ‘what does it matter who has paid them, so long as they are paid?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But I didn’t ask you to pay them,’ he went on obstinately. \u0026nbsp;There was a pause, and then the old lady, with a distinctly sarcastic smile, said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It seems to me, young man, that you are rather particular as to how things are done for you. \u0026nbsp;If you had begun to be just a little bit as particular in making the debts as you are in the way of having them paid, there would be a little less trouble and expense all round. \u0026nbsp;However, the debts have been paid, and we can’t unpay them. \u0026nbsp;But of course you can repay me the money if you like. \u0026nbsp;It amounts in all to four thousand three hundred and seventeen pounds, twelve shillings and sixpence, and I have paid every penny of it out of my own pocket. \u0026nbsp;If you can’t pay it yourself, perhaps your father would like to do so.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The last shot told; he went on writing: ‘“Kindly paid for me,”’ she continued in the same even voice:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘“In remembrance of my mother, of whom she was an acquaintance.” \u0026nbsp;Now sign it!’ \u0026nbsp;He did so and handed it to her. \u0026nbsp;She read it over carefully, folded it, and put it in her pocket. \u0026nbsp;She then stood. \u0026nbsp;He rose also; and as he moved to the door—he had not offered to shake hands with her—he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I should like to see, Miss Norman.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I am afraid you will have to wait.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘She is over at Heply Regis. \u0026nbsp;She went there for Lady Heply’s ball, and will remain for a few days. \u0026nbsp;Good afternoon!’ \u0026nbsp;The tone in which the last two words were spoken seemed in his ears like the crow of the victor after a cock-fight.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he was going out of the room a thought struck her. \u0026nbsp;She felt he deserved some punishment for his personal rudeness to her. \u0026nbsp;After all, she had paid half her fortune for him, though not on his account; and not only had he given no thanks, but had not even offered the usual courtesy of saying good-bye. \u0026nbsp;She had intended to have been silent on the subject, and to have allowed him to discover it later. \u0026nbsp;Now she said, as if it was an after-thought:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘By the way, I did not pay those items you put down as “debts of honour”; you remember you gave the actual names and addresses.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why not?’ the question came from him involuntarily. \u0026nbsp;The persecuting lorgnon rose again:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Because they were all bogus! \u0026nbsp;Addresses, names, debts, honour! \u0026nbsp;Good afternoon!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He went out flaming; free from debt, money debts; all but one. \u0026nbsp;And some other debts—not financial—whose magnitude was exemplified in the grinding of his teeth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After breakfast next morning he said to his father:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘By the way, you said you wished to speak to me, sir.’ \u0026nbsp;There was something in the tone of his voice which called up antagonism.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Then you have paid your debts?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘All!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Good! \u0026nbsp;Now there is something which it is necessary I should call your attention to. \u0026nbsp;Do you remember the day on which I handed you that pleasing epistle from Messrs. Cavendish and Cecil?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Certainly, sir.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Didn’t you send a telegram to them?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I did.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You wrote it yourself?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Certainly.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I had a courteous letter from the money-lenders, thanking me for my exertions in securing the settlement of their claim, and saying that in accordance with the request in my telegram they had held over proceedings until the day named. \u0026nbsp;I did not quite remember having sent any telegram to them, or any letter either. \u0026nbsp;So, being at a loss, I went to our excellent postmaster and requested that he would verify the sending of a telegram to London from me. \u0026nbsp;He courteously looked up the file; which was ready for transference to the G.P.O., and showed me the form. \u0026nbsp;It was in your handwriting.’ \u0026nbsp;He paused so long that Leonard presently said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It was signed Jasper Everard. \u0026nbsp;Jasper Everard! my name; and yet it was sent by my son, who was christened, if I remember rightly, Leonard!’ \u0026nbsp;Then he went on, only in a cold acrid manner which made his son feel as though a February wind was blowing on his back:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I think there need not have been much trouble in learning to avoid confusing our names. \u0026nbsp;They are really dissimilar. \u0026nbsp;Have you any explanation to offer of the—the error, let us call it?’ \u0026nbsp;A bright thought struck Leonard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why, sir,’ he said, ‘I put it in your name as they had written to you. \u0026nbsp;I thought it only courteous.’ \u0026nbsp;The elder man winced; he had not expected the excuse. \u0026nbsp;We went on speaking in the same calm way, but his tone was more acrid than before:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Good! of course! \u0026nbsp;It was only courteous of you! \u0026nbsp;Quite so! \u0026nbsp;But I think it will be well in the future to let me look after my own courtesy; as regards my signature at any rate. \u0026nbsp;You see, my dear boy, a signature is queer sort of thing, and judges and juries are apt to take a poor view of courtesy as over against the conventions regarding a man, writing his own name. \u0026nbsp;What I want to tell you is this, that on seeing that signature I made a new will. \u0026nbsp;You see, my estate is not entailed, and therefore I think it only right to see that in such a final matter justice is done all round. \u0026nbsp;I therefore made a certain provision of which I am sure you will approve. \u0026nbsp;Indeed, since I am assured of the payment of your debts, I feel justified in my action. \u0026nbsp;I may say, inter alia, that I congratulate you on either the extent of your resources or the excellence of your friendships, or both. \u0026nbsp;I confess that the amounts brought to my notice were rather large; more especially in proportion to the value of the estate which you are some day to inherit. \u0026nbsp;For you are of course to inherit some day, my dear boy. \u0026nbsp;You are my only son, and it would be hardly—hardly courteous of me not to leave it to you. \u0026nbsp;But I have put a clause in my will to the effect that the trustee’s are to pay all debts of your accruing which can be proved against you, before handing over to you either the estate itself or the remainder after its sale and the settlement of all claims. \u0026nbsp;That’s all. \u0026nbsp;Now run away, my boy; I have some important work to do.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * * * * *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The day after her return from Heply Regis, Stephen was walking in the wood when she thought she heard a slight rustling of leaves some way behind her. \u0026nbsp;She looked round, expecting to see some one; but the leafy path was quite clear. \u0026nbsp;Her suspicion was confirmed; some one was secretly following her. \u0026nbsp;A short process of exclusions pointed to the personality of the some one. \u0026nbsp;Tramps and poachers were unknown in Normanstand, and there was no one else whom she could think of who had any motive in following her in such a way; it must be Leonard Everard. \u0026nbsp;She turned and walked rapidly in the opposite direction. \u0026nbsp;As this would bring her to the house Leonard had to declare his presence at once or else lose the opportunity of a private interview which he sought. \u0026nbsp;When she saw him she said at once and without any salutation:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘What are you doing there; why are you following me?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I wanted to see you alone. \u0026nbsp;I could not get near you on account of that infernal old woman.’ \u0026nbsp;Stephen’s face grew hard.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘On account of whom?’ she asked with dangerous politeness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Miss Rowly; your aunt.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Don’t you think, Mr. Everard,’ she said icily, ‘that it is at least an unpardonable rudeness to speak that way, and to me, of the woman I love best in all the world?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Sorry!’ he said in the offhand way of younger days, ‘I apologise. \u0026nbsp;Fact is, I was angry that she wouldn’t let me see you.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Not let you see me!’ she said as if amazed. \u0026nbsp;‘What do mean?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why, I haven’t been able to see you alone ever since I went to meet you on Caester Hill.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But why should you see me alone?’ she asked as if still in amazement. \u0026nbsp;‘Surely you can say anything you have to say before my aunt.’ \u0026nbsp;With an unwisdom for which an instant later he blamed himself he blurted out:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why, old girl, you yourself did not think her presence necessary when you asked me to meet you on the hill.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘When was that?’ \u0026nbsp;She saw that he was angry and wanted to test him; to try how far he would venture. \u0026nbsp;He was getting dangerous; she must know the measure of what she had to fear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He fell into the trap at once. \u0026nbsp;His debts being paid, fear was removed, and all the hectoring side of the man was aroused. \u0026nbsp;His antagonist was a woman; and he had already had in his life so many unpleasant scenes with women that this was no new experience. \u0026nbsp;This woman had, by her own indiscretion, put a whip into his hand; and, if necessary to secure his own way, by God! he meant to use it! \u0026nbsp;These last days had made her a more desirable possession in his eyes. \u0026nbsp;The vastness of her estate had taken hold on him, and his father’s remorseless intention with regard to his will would either keep him with very limited funds, or leave him eventually a pauper if he forestalled his inheritance. \u0026nbsp;The desire of her wealth had grown daily, and it was now the main force in bringing him here to-day. \u0026nbsp;And to this was now added the personal desire which her presence evoked. \u0026nbsp;Stephen, at all times beautiful, had never looked more lovely. \u0026nbsp;In the days since she had met him on the hilltop, a time that to her seemed so long ago, she had grown to be a woman, and there is some subtle inconceivable charm in completed womanhood. \u0026nbsp;The reaction from her terrible fear and depression had come, and her strong brilliant youth was manifesting itself. \u0026nbsp;Her step was springy and her eyes were bright; and the glow of fine health, accentuated by the militant humour of the present moment, seemed to light up her beautiful skin. \u0026nbsp;In herself she was desirable, very desirable; Leonard felt his pulses quicken and his blood leap as he looked at her. \u0026nbsp;Even his prejudice against her red hair had changed to something like hungry admiration. \u0026nbsp;Leonard felt for the first moment since he had known her that she was a woman; and that, with relation to her, he was a man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And at the moment all the man in him asserted itself. \u0026nbsp;It was with half love, as he saw it, and half self-assertion that he answered her question:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The day you asked me to marry you! \u0026nbsp;Oh! what a fool I was not to leap at such a chance! \u0026nbsp;I should have taken you in my arms then and kissed you till I showed you how much I loved you. \u0026nbsp;But that will all come yet; the kissing is still to come! \u0026nbsp;Oh! \u0026nbsp;Stephen, don’t you see that I love you? \u0026nbsp;Won’t you tell me that you love me still? \u0026nbsp;Darling!’ \u0026nbsp;He almost sprang at her, his arms extended to clasp her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Stop!’ \u0026nbsp;Her voice rang like a trumpet. \u0026nbsp;She did not mean to submit to physical violence, and in the present state of her feeling, an embrace from him would be a desecration. \u0026nbsp;He was now odious to her; she positively loathed him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Before her uplifted hand and those flashing eyes, he stopped as one stricken into stone. \u0026nbsp;In that instant she knew she was safe; and with a woman’s quickness of apprehension and resolve, made up her mind what course to pursue. \u0026nbsp;In a calm voice she said quietly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Mr. Everard, you have followed me in secret, and without my permission. \u0026nbsp;I cannot talk here with you, alone. \u0026nbsp;I absolutely refuse to do so; now or at any other time. \u0026nbsp;If you have anything especial to say to me you will find me at home at noon to-morrow. \u0026nbsp;Remember, I do not ask you to come. \u0026nbsp;I simply yield to the pressure of your importunity. \u0026nbsp;And remember also that I do not authorise you in any way to resume this conversation. \u0026nbsp;In fact, I forbid it. \u0026nbsp;If you come to my house you must control yourself to my wish!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then with a stately bow, whose imperious distance inflamed him more than ever, and without once looking back she took her way home, all agitated inwardly and with fast beating heart.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3234/88502.html","bookId":683,"creation":"Aug 5, 2019 7:30:08 AM","modification":"Aug 5, 2019 7:30:08 AM"}
