{"id":36851,"no":25,"title":"CHAPTER XXIV—FROM THE DEEPS","content":"\u0026nbsp;Presently the Captain handed Mrs. Stonehouse a pair of binoculars. \u0026nbsp;For an instant she looked through them, then handed them back and continued gazing out to where the two heads appeared—when they did appear on the crest of the waves like pin-heads. \u0026nbsp;The Captain said half to himself and half to the father: \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Mother’s eyes! \u0026nbsp;Mother’s eyes!’ and the father understood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As the ship swept back to the rescue, her funnels sending out huge volumes of smoke which the gale beat down on the sea to leeward, the excitement grew tenser and tenser. \u0026nbsp;Men dared hardly breathe; women wept and clasped their hands convulsively as they prayed. \u0026nbsp;In the emergency boat the men sat like statues, their oars upright, ready for instant use. \u0026nbsp;The officer stood with the falls in his hand ready to lower away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When opposite the lifebuoy, and about a furlong from Harold and Pearl, the Captain gave the signal ‘Stop,’ and then a second later: ‘Full speed astern.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ready, men! \u0026nbsp;Steady!’ \u0026nbsp;As the coming wave slipping under the ship began to rise up her side, the officer freed the falls and the boat sank softly into the lifting sea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Instantly the oars struck the water, and as the men bent to them a cheer rang out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * * * * *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harold and Pearl heard, and the man turning his head for a moment saw that the ship was close at hand, gradually drifting down to the weather side of them. \u0026nbsp;He raised the child in his arms, saying:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Now, Pearl, wave your hand to mother and say, hurrah!’ \u0026nbsp;The child, fired into fresh hope, waved her tiny hand and cried ‘Hurrah! \u0026nbsp;Hurrah!’ \u0026nbsp;The sound could not reach the mother’s ears; but she saw, and her heart leaped. \u0026nbsp;She too waved her hand, but she uttered no sound. \u0026nbsp;The sweet high voice of the child crept over the water to the ears of the men in the boat, and seemed to fire their arms with renewed strength.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A few more strokes brought them close, Harold with a last effort raised the child in his arms as the boat drove down on them. \u0026nbsp;The boatswain leaning over the bow grabbed the child, and with one sweep of his strong arm took her into the boat. \u0026nbsp;The bow oarsman caught Harold by the wrist. \u0026nbsp;The way of the boat took him for a moment under water; but the next man; pulling his oar across the boat, stooped over and caught him by the collar, and clung fast. \u0026nbsp;A few seconds more and he was hauled abroad. \u0026nbsp;A wild cheer from all on the Scoriac came, sweeping down on the wind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When once the boat’s head had been turned towards the ship, and the oars had bent again to their work, they came soon within shelter. \u0026nbsp;When they had got close enough ropes were thrown out, caught and made fast; and then came down one of the bowlines which the seamen held ready along the rail of the lower deck. \u0026nbsp;This was seized by the boatswain, who placed it round him under his armpits. \u0026nbsp;Then, standing with the child in his arms he made ready to be pulled up. \u0026nbsp;Pearl held out her arms to Harold, crying in fear:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No, no, let The Man take me! \u0026nbsp;I want to go with The Man!’ \u0026nbsp;He said quietly so as not to frighten her:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No, no, dear! \u0026nbsp;Go with him! \u0026nbsp;He can do this better than I can!’ \u0026nbsp;So she clung quietly to the seaman, holding her face pressed close against his shoulder. \u0026nbsp;As the men above pulled at the rope, keeping it as far as possible from the side of the vessel, the boatswain fended himself off with his feet. \u0026nbsp;In a few seconds he was seized by eager hands and pulled over the rail, tenderly holding and guarding the child all the while. \u0026nbsp;In an instant she was in the arms of her mother, who had thrown herself upon her knees and pressed her close to her loving heart. \u0026nbsp;The child put her little arms around her neck and clung to her. \u0026nbsp;Then looking up and seeing the grey pallor of her face, which even her great joy could not in a moment efface, she stroked it and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Poor mother! \u0026nbsp;Poor mother! \u0026nbsp;And now I have made you all wet!’ \u0026nbsp;Then, feeling her father’s hand on her head she turned and leaped into his arms, where he held her close.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harold was the next to ascend. \u0026nbsp;He came amid a regular tempest of cheers, the seamen joining with the passengers. \u0026nbsp;The officers, led by the Captain waving his cap from the bridge, joined in the paean.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boat was cast loose. \u0026nbsp;An instant after the engine bells tinkled: ‘Full speed ahead.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Stonehouse had no eyes but for her child, except for one other. \u0026nbsp;When Harold leaped down from the rail she rushed at him, all those around instinctively making way for her. \u0026nbsp;She flung her arms around him and kissed him, and then before he could stop her sank to her knees at his feet, and taking his hand kissed it. \u0026nbsp;Harold was embarrassed beyond all thinking. \u0026nbsp;He tried to take away his hand, but she clung tight to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No, no!’ she cried. \u0026nbsp;‘You saved my child!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harold was a gentleman and a kindly one. \u0026nbsp;He said no word till she had risen, still holding his hand, when he said quietly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘There! there! \u0026nbsp;Don’t cry. \u0026nbsp;I was only too happy to be of service. \u0026nbsp;Any other man on board would have done the same. \u0026nbsp;I was the nearest, and therefore had to be first. \u0026nbsp;That was all!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Stonehouse came to him and said as he grasped Harold’s hand so hard that his fingers ached:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I cannot thank you as I would. \u0026nbsp;But you are a man and will understand. \u0026nbsp;God be good to you as you have been good to my child; and to her mother and myself!’ \u0026nbsp;As he turned away Pearl, who had now been holding close to her mother’s hand, sprang to him holding up her arms. \u0026nbsp;He raised her up and kissed her. \u0026nbsp;Then he placed her back in her mother’s arms.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All at once she broke down as the recollection of danger swept back upon her. \u0026nbsp;‘Oh, Mother! \u0026nbsp;Mother!’ she cried, with a long, low wail, which touched every one of her hearers to the heart’s core.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The hot blankets are all ready. \u0026nbsp;Come, there is not a moment to be lost. \u0026nbsp;I’ll be with you when I have seen the men attended to!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So the mother, holding her in her arms and steadied by two seamen lest she should slip on the wet and slippery deck, took the child below.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harold was taken by another set of men, who rubbed him down till he glowed, and poured hot brandy and water into him till he had to almost use force against the superabundance of their friendly ministrations.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For the remainder of that day a sort of solemn gladness ruled on the Scoriac. \u0026nbsp;The Stonehouse family remained in their suite, content in glad thankfulness to be with Pearl, who lay well covered up on the sofa sleeping off the effects of the excitement and the immersion, and the result of the potation which the Doctor had forced upon her. \u0026nbsp;Harold was simply shy, and objecting to the publicity which he felt to be his fate, remained in his cabin till the trumpet had blown the dinner call.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3234/88505.html","bookId":683,"creation":"Aug 5, 2019 7:30:08 AM","modification":"Aug 5, 2019 7:30:08 AM"}
