{"id":36853,"no":27,"title":"CHAPTER XXVI—A NOBLE OFFER","content":"\u0026nbsp;That day Harold passed in unutterable gloom. \u0026nbsp;The reaction was strong on him; and all his woe, his bitter remembrance of the past and his desolation for the future, were with him unceasingly. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the dusk of the evening he wandered out to his favourite spot, the cable-tank on top of the aft wheelhouse. \u0026nbsp;Here he had been all alone, and his loneliness had the added advantage that from the isolated elevation he could see if anyone approached. \u0026nbsp;He had been out there during the day, and the Captain, who had noticed his habit had had rigged up a canvas dodger on the rail on the weather side. \u0026nbsp;When he sat down on the coiled hawsers in the tank he was both secluded and sheltered. \u0026nbsp;In this peaceful corner his thoughts ran freely and in sympathy with the turmoil of wind and wave.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n How unfair it all was! \u0026nbsp;Why had he been singled out for such misery? \u0026nbsp;What gleam of hope or comfort was left to his miserable life since he had heard the words of Stephen; those dreadful words which had shattered in an instant all the cherished hopes of his life. \u0026nbsp;Too well he remembered the tone and look of scorn with which the horrible truths had been conveyed to him. \u0026nbsp;In his inmost soul he accepted them as truths; Stephen’s soul had framed them and Stephen’s lips had sent them forth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n From his position behind the screen he did not see the approaching figure of Mr. Stonehouse, and was astonished when he saw his head rise above the edge of the tank as he climbed the straight Jacob’s ladder behind the wheelhouse. \u0026nbsp;The elder man paused as he saw him and said in an apologetic way:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Will you forgive my intruding on your privacy? \u0026nbsp;I wanted to speak to you alone; and as I saw you come here a while ago I thought it would be a good opportunity.’ \u0026nbsp;Harold was rising as he spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘By all means. \u0026nbsp;This place is common property. \u0026nbsp;But all the same I am honoured in your seeking me.’ \u0026nbsp;The poor fellow wished to be genial; but despite his efforts there was a strange formality in the expression of his words. \u0026nbsp;The elder man understood, and said as he hurried forward and sank beside him:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Pray don’t stir! \u0026nbsp;Why, what a cosy corner this is. \u0026nbsp;I don’t believe at this moment there is such peace in the ship!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Once again the bitterness of Harold’s heart broke out in sudden words:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I hope not! \u0026nbsp;There is no soul on board to whom I could wish such evil!’ \u0026nbsp;The old man said as he laid his hand softly on the other’s shoulder:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘God help you, my poor boy, if such pain is in your heart!’ \u0026nbsp;Mr. Stonehouse looked out at the sea, at last turning his face to him again he spoke:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘If you feel that I intrude on you I earnestly ask you to forgive me; but I think that the years between your age and mine as well as my feeling towards the great obligation which I owe you will plead for excuse. \u0026nbsp;There is something I would like to say to you, sir; but I suppose I must not without your permission. \u0026nbsp;May I have it?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘If you wish, sir. \u0026nbsp;I can at least hear it.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old man bowed and went on:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I could not but notice that you have some great grief bearing upon you; and from one thing or another—I can tell you the data if you wish me to do so—I have come to the conclusion that you are leaving your native land because of it.’ \u0026nbsp;Here Harold, wakened to amazement by the readiness with which his secret had been divined, said quickly, rather as an exclamation than interrogation:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘How on earth did you know that!’ \u0026nbsp;His companion, taking it as a query, answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Sir, at your age and with your strength life should be a joy; and yet you are sad: Companionship should be a pleasure; yet you prefer solitude. \u0026nbsp;That you are brave and unselfish I know; I have reason, thank God! to know it. \u0026nbsp;That you are kindly and tolerant is apparent from your bearing to my little child this morning; as well as your goodness of last night, the remembrance of which her mother and I will bear to our graves; and to me now. \u0026nbsp;I have not lived all these years without having had trouble in my own heart; and although the happiness of late years has made it dim, my gratitude to you who are so sad brings it all back to me.’ \u0026nbsp;He bowed, and Harold, wishing to avoid speaking of his sorrow, said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You are quite right so far as I have a sorrow; and it is because of it I have turned my back on home. \u0026nbsp;Let it rest at that!’ \u0026nbsp;His companion bowed gravely and went on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I take it that you are going to begin life afresh in the new country. \u0026nbsp;In such case I have a proposition to make. \u0026nbsp;I have a large business; a business so large that I am unable to manage it all myself. \u0026nbsp;I was intending that when I arrived at home I would set about finding a partner. \u0026nbsp;The man I want is not an ordinary man. \u0026nbsp;He must have brains and strength and daring.’ \u0026nbsp;He paused. \u0026nbsp;Harold felt what was coming, but realised, as he jumped at the conclusion, that it would not do for him to take for granted that he was the man sought. \u0026nbsp;He waited; Mr. Stonehouse went on:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘As to brains, I am prepared to take the existence of such on my own judgment. \u0026nbsp;I have been reading men, and in this aspect specially, all my life. \u0026nbsp;The man I have thought of has brains. \u0026nbsp;I am satisfied of that, without proof. \u0026nbsp;I have proof of the other qualities.’ \u0026nbsp;He paused again; as Harold said nothing he continued in a manner ill at ease:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My difficulty is to make the proposal to the man I want. \u0026nbsp;It is so difficult to talk business to a man to whom you under great obligation; to whom you owe everything. \u0026nbsp;He might take a friendly overture ill.’ \u0026nbsp;There was but one thing to be said and Harold said it. \u0026nbsp;His heart warmed to the kindly old man and he wished to spare him pain; even if he could not accept him proposition:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘He couldn’t take it ill; unless he was an awful bounder.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It was you I thought of!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I thought so much, sir;’ said Harold after a pause, ‘and I thank you earnestly and honestly. \u0026nbsp;But it is impossible.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, my dear sir!’ said the other, chagrined as well as surprised. \u0026nbsp;‘Think again! \u0026nbsp;It is really worth your while to think of it, no matter what your ultimate decision may be!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harold shook his head. \u0026nbsp;There was a long silence. \u0026nbsp;The old man wished to give his companion time to think; and indeed he thought that Harold was weighing the proposition in his mind. \u0026nbsp;As for Harold, he was thinking how best he could make his absolute refusal inoffensive. \u0026nbsp;He must, he felt, give some reason; and his thoughts were bent on how much of the truth he could safely give without endangering his secret. \u0026nbsp;Therefore he spoke at last in general terms:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I can only ask you, sir, to bear with me and to believe that I am very truly and sincerely grateful to you for your trust. \u0026nbsp;But the fact is, I cannot go anywhere amongst people. \u0026nbsp;Of course you understand that I am speaking in confidence; to you alone and to none other?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Absolutely!’ said Mr. Stonehouse gravely. \u0026nbsp;Harold went on:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I must be alone. \u0026nbsp;I can only bear to see people on this ship because it is a necessary way to solitude.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You “cannot go anywhere amongst people”! \u0026nbsp;Pardon me. \u0026nbsp;I don’t wish to be unduly inquisitive; but on my word I fail to understand!’ \u0026nbsp;Harold was in a great difficulty. \u0026nbsp;Common courtesy alone forbade that he should leave the matter where it was; and in addition both the magnificently generous offer which had been made to him, and the way in which accident had thrown him to such close intimacy with Pearl’s family, required that he should be at least fairly frank. \u0026nbsp;At last in a sort of cold desperation he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I cannot meet anyone . . . There it something that happened . . . Something I did . . . Nothing can make it right . . . All I can do is to lose myself in the wildest, grimmest, wilderness in the world; and fight my pain . . . my shame . . . !’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A long silence. \u0026nbsp;Then the old man’s voice came clear and sweet, something like music, in the shelter from the storm:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But perhaps time may mend things. \u0026nbsp;God is very good . . . !’ \u0026nbsp;Harold answered out of the bitterness of his heart. \u0026nbsp;He felt that his words were laden with an anger which he did not feel, but he did not see his way to alter them:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Nothing can mend this thing! \u0026nbsp;It is at the farthest point of evil; and there is no going on or coming back. \u0026nbsp;Nothing can wipe out what is done; what is past!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Again silence, and again the strong, gentle voice:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘God can do much! \u0026nbsp;Oh my dear young friend, you who have been such a friend to me and mine, think of this.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘God Himself can do nothing here! \u0026nbsp;It is done! \u0026nbsp;And that is the end!’ \u0026nbsp;He turned his head; it was all he could do to keep from groaning. \u0026nbsp;The old man’s voice vibrated with earnest conviction as he spoke:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You are young and strong and brave! \u0026nbsp;Your heart is noble! \u0026nbsp;You can think quickly in moments of peril; therefore your brain is sound and alert. \u0026nbsp;Now, may I ask you a favour? it is not much. \u0026nbsp;Only that you will listen, without interruption, to what, if I have your permission, I am going to say. \u0026nbsp;Do not ask me anything; do not deny; do not interrupt! \u0026nbsp;Only listen! \u0026nbsp;May I ask this?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘By all means! \u0026nbsp;It is not much!’ he almost felt like smiling as he spoke. \u0026nbsp;Mr. Stonehouse, after a short pause, as if arranging his thoughts, spoke:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Let me tell you what I am. \u0026nbsp;I began life with nothing but a fair education such as all our American boys get. \u0026nbsp;But from a good mother I got an idea that to be honest was the best of all things; from a strenuous father, who, however, could not do well for himself, I learned application to work and how best to use and exercise such powers as were in me. \u0026nbsp;From the start things prospered with me. \u0026nbsp;Men who knew me trusted me; some came with offers to share in my enterprise. \u0026nbsp;Thus I had command of what capital I could use; I was able to undertake great works and to carry them through. \u0026nbsp;Fortune kept growing and growing; for as I got wealthier I found newer and larger and more productive uses for my money. \u0026nbsp;And in all my work I can say before God I never willingly wronged any man. \u0026nbsp;I am proud to be able to say that my name stands good wherever it has been used. \u0026nbsp;It may seem egotistical that I say such things of myself. \u0026nbsp;It may seem bad taste; but I speak because I have a motive in so doing. \u0026nbsp;I want you to understand at the outset that in my own country, wherever I am known and in my own work, my name is a strength.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He paused a while. \u0026nbsp;Harold sat still; he knew that such man would not, could not, speak in such a way without a strong motive; and to learn that motive he waited.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘When you were in the water making what headway you could in that awful sea—when my little child’s life hung in the balance, and the anguish of my wife’s heart nearly tore my heart in two, I said to myself, “If we had a son I should wish him to be like that.” \u0026nbsp;I meant it then, and I mean it now! \u0026nbsp;Come to me as you are! \u0026nbsp;Faults, and past, and all. \u0026nbsp;Forget the past! \u0026nbsp;Whatever it was we will together try to wipe it out. \u0026nbsp;Much may be done in restoring where there has been any wrong-doing. \u0026nbsp;Take my name as your own. \u0026nbsp;It will protect you from the result of what ever has been, and give you an opportunity to find your place again. \u0026nbsp;You are not bad in heart I know. \u0026nbsp;Whatever you have done has not been from base motives. \u0026nbsp;Few of us are spotless as to facts. \u0026nbsp;You and I will show ourselves—for unless God wills to the opposite we shall confide in none other—that a strong, brave man may win back all that was lost. \u0026nbsp;Let me call you by my name and hold you as the son of my heart; and it will be a joy and pleasure to my declining years.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he had spoken, Harold’s thought’s had at first followed in some wonderment. \u0026nbsp;But gradually, as his noble purpose unfolded, based as it was on a misconception as to the misdoing of which he himself had spoken, he had been almost stricken dumb. \u0026nbsp;At the first realisation of what was intended he could not have spoken had he tried; but at the end he had regained his thoughts and his voice. \u0026nbsp;There was still wonderment in it, as realising from the long pause that the old man had completed his suggestion, he spoke:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘If I understand aright you are offering me your name! \u0026nbsp;Offering to share your honour with me. \u0026nbsp;With me, whom, if again I understand, you take as having committed some crime?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I inferred from what you said and from your sadness, your desire to shun your kind, that there was, if not a crime, some fault which needed expiation.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But your honour, sir; your honour!’ \u0026nbsp;There was a proud look in the old man’s eyes as he said quietly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It was my desire, is my desire, to share with you what I have that is best; and that, I take it, is not the least valuable of my possessions, such as they are! \u0026nbsp;And why not? \u0026nbsp;You have given to me all that makes life sweet; without which it would be unbearable. \u0026nbsp;That child who came to my wife and me when I was old and she had passed her youth is all in all to us both. \u0026nbsp;Had your strength and courage been for barter in the moments when my child was quivering between life and death, I would have cheerfully purchased them with not half but all! \u0026nbsp;Sir, I should have given my soul! \u0026nbsp;I can say this now, for gratitude is above all barter; and surely it is allowed to a father to show gratitude for the life of his child!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This great-hearted generosity touched Harold to the quick. \u0026nbsp;He could hardly speak for a few minutes. \u0026nbsp;Then instinctively grasping the old man’s hand he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You overwhelm me. \u0026nbsp;Such noble trust and generosity as you have shown me demands a return of trust. \u0026nbsp;But I must think! \u0026nbsp;Will you remain here and let me return to you in a little while?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He rose quickly and slipped down the iron ladder, passing into the darkness and the mist and the flying spray.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3234/88507.html","bookId":683,"creation":"Aug 5, 2019 7:30:08 AM","modification":"Aug 5, 2019 7:30:08 AM"}
