{"id":36858,"no":32,"title":"CHAPTER XXXI—THE LIFE-LINE","content":"\u0026nbsp;On the coast of Angleshire the weather in the early days of September had been stormy. \u0026nbsp;With the south-west wind had come deluges of rain, not a common thing for the time of year on the east coast. \u0026nbsp;Stephen, whose spirits always rose with high wind, was in a condition of prolonged excitement. \u0026nbsp;She could not keep still; every day she rode long distances, and found a wonderful satisfaction in facing the strong winds. \u0026nbsp;Like a true horsewoman she did not mind the wet, and had glorious gallops over the grassy ridge and down the slopes on the farther side, out on the open road or through the endless grass rides amid the pine woods. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the Tuesday morning the storm was in full sweep, and Stephen was in wild spirits. \u0026nbsp;Nothing would do her but to go out on the tower of the castle where she could walk about, and leaning on the crenellated parapet look over all the coast stretching far in front and sweeping away to the left and right. \u0026nbsp;The prospect so enchanted her, and the fierce sweep of the wind so suited her exalted mood, that she remained there all the morning. \u0026nbsp;The whole coast was a mass of leaping foam and flying spray, and far away to the horizon white-topped waves rolled endlessly. \u0026nbsp;That day she did not even ride out, but contented herself with watching the sea and the storm from the tower. \u0026nbsp;After lunch she went to her tower again; and again after tea. \u0026nbsp;The storm was now furious. \u0026nbsp;She made up her mind that after dinner she would ride down and see its happenings close at hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When she had finished dinner she went to her room to dress for her ride. \u0026nbsp;The rush and roar of the storm were in her ears, and she was in wild tumultuous spirits. \u0026nbsp;All her youth seemed to sweep back on her; or perhaps it was that the sickness of the last two years was swept away. \u0026nbsp;Somewhere deep down in Stephen’s heart, below her intention or even her consciousness, was a desire to be her old self if only for an hour. \u0026nbsp;And to this end externals were of help. \u0026nbsp;Without weighing the matter in her mind, and acting entirely on impulse, she told her maid to get the red habit she had not worn for years. \u0026nbsp;When she was dressed she sent round to have out her white Arab; while it was getting ready she went once more to the tower to see the storm-effect in the darkening twilight. \u0026nbsp;As she looked, her heart for an instant stood still. \u0026nbsp;Half-way to the horizon a great ship, ablaze in the bows, was driving through the waves with all her speed. \u0026nbsp;She was heading towards the little port, beyond which the shallows sent up a moving wall of white spray.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen tore down the turret stair, and gave hurried directions to have beds prepared in a number of rooms, fires everywhere, and plenty of provisions. \u0026nbsp;She also ordered that carriages should be sent at once to the fishing port with clothing and restoratives. \u0026nbsp;There would, she felt, be need for such help before a time to be measured by minutes should have passed; and as some of her servants were as yet strange to her ways she did not leave anything to chance. \u0026nbsp;One carriage was to go for the doctor who lived at Lannoy, the village over the hill, whence nothing could be seen of what was happening. \u0026nbsp;She knew that others within sight or hailing would be already on their way. \u0026nbsp;Work was afoot, and had she time, or thought of it, she would have chosen a more sedate garb. \u0026nbsp;But in the excitement no thought of herself came to her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In a few seconds she was in the saddle, tearing at full speed down the road that led to the port. \u0026nbsp;The wind was blowing so strongly in her face that only in the lulls could she hear the hoof-strokes of the groom’s horse galloping behind her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At first the height of the road allowed her to see the ship and the port towards which she was making. \u0026nbsp;But presently the road dipped, and the curving of the hill shut both from her sight; it was only when she came close that she could see either again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now the great ship was close at hand. \u0026nbsp;The flames had gained terribly, and it was a race for life or death. \u0026nbsp;There was no time do more than run her aground if life was to be saved at all. \u0026nbsp;The captain, who in the gaps of the smoke could be seen upon the bridge, knew his work well. \u0026nbsp;As he came near the shoal he ran a little north, and then turned sharply so as to throw the boat’s head to the south of the shoal. \u0026nbsp;Thus the wind would drive fire and smoke forward and leave the after part of the vessel free for a time.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The shock of her striking the sand was terrific, though the tinkle of the bell borne in on the gale showed that the engines had been slowed down. \u0026nbsp;The funnels were shaken down, and the masts broke off, falling forward. \u0026nbsp;A wild shriek from a hundred throats cleft the roaring of wind and wave. \u0026nbsp;The mast fell, the foremast, with all its cumbering top-hamper on the bridge, which was in an instant blotted out of existence, together with the little band of gallant men who stood on it, true to their last duty. \u0026nbsp;As the wind took the smoke south a man was seen to climb on the wreck of the mast aft and make fast the end of a great coil of rope which he carried. \u0026nbsp;He was a huge man with a full dark beard. \u0026nbsp;Two sailors working with furious haste helped him with the rope. \u0026nbsp;The waves kept raising the ship a little, each time bumping her on the sand with a shock. \u0026nbsp;The people on deck held frantically to the wreckage around them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the bearded man, stripping to his waist and cutting off his trousers above the knee, fastened an end of the rope round his waist. \u0026nbsp;The sailors stood ready one behind the other to pay it out. \u0026nbsp;As a great wave rolled under the ship, he threw himself into the sea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the meantime the coastguard had fixed Board of Trade rocket-apparatus, and in a few seconds the prolonged roar of a rocket was heard. \u0026nbsp;It flew straight towards the ship, rising at a high angle so as to fall beyond it. \u0026nbsp;But the force of the wind took it up as it rose, and the gale increased so that it rose nearly vertically; and in this position the wind threw it south of its objective, and short of it. \u0026nbsp;Another rocket was got ready at once, and blue lights were burned so that the course of the venturous swimmer might be noted. \u0026nbsp;He swam strongly; but the great weight of the rope behind kept pulling him back, and the southern trend of the tide current and the force of the wind kept dragging him from the pier. \u0026nbsp;Within the bar the waves were much less than without; but they were still so unruly that no boat in the harbour—which was not a lifeboat station—could venture out. \u0026nbsp;Indeed, in the teeth of the storm it would have been a physical impossibility to have driven one seaward.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As the gathered crowd saw Stephen approach they made way for her. \u0026nbsp;She had left her horse with the groom, and despite the drenching spray fought a way against the wind out on the pier. \u0026nbsp;As in the glare of the blue light, which brought many things into harsh unnatural perspective, she caught sight of the set face of the swimmer rising and falling with the waves, her heart leaped. \u0026nbsp;This was indeed a man! a brave man; and all the woman in her went out to him. \u0026nbsp;For him, and to aid him and his work, she would have given everything, done anything; and in her heart, which beat in an ecstasy of anxiety, she prayed with that desperate conviction of hope which comes in such moments of exaltation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But it soon became apparent that no landing could be effected. \u0026nbsp;The force of the current and the wind were taking the man too far southward for him ever to win a way back. \u0026nbsp;Then one of coastguards took the lead-topped cane which they use for throwing practice, and, after carefully coiling the line attached it so that it would run free, managed with a desperate effort to fling it far out. \u0026nbsp;The swimmer, to whom it fell close, fought towards it frantically; and as the cord began to run through the water, managed to grasp it. \u0026nbsp;A wild cheer rose from the shore and the ship. \u0026nbsp;A stout line was fastened to the shore end of the cord, and the swimmer drew it out to him. \u0026nbsp;He bent it on the rope which trailed behind him; then, seeing that he was himself a drag on it, with the knife which he drew from the sheath at the back of his waist, he cut himself free. \u0026nbsp;One of the coastguards on the pier, helped by a host of willing hands, began drawing the end of the rope on shore. \u0026nbsp;The swimmer still held the line thrown to him, and several men on the pier began to draw on it. \u0026nbsp;Unhappily the thin cord broke under the strain, and within a few seconds the swimmer had drifted out of possible help. \u0026nbsp;Seeing that only wild rocks lay south of the sea-wall, and that on them seas beat furiously, he turned and made out for sea. \u0026nbsp;In the light beyond the glare he could see vaguely the shore bending away to the west in a deep curve of unbroken white leaping foam. \u0026nbsp;There was no hope of landing there. \u0026nbsp;To the south was the headland, perhaps two miles away as the crow flies. \u0026nbsp;Here was the only chance for him. \u0026nbsp;If he could round the headland, he might find shelter beyond; or somewhere along the farther shore some opening might present itself. \u0026nbsp;Whilst the light from the blue fires still reached him he turned and made for the headland.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the meantime on ship and on shore men worked desperately. \u0026nbsp;Before long the end of the hawser was carried round on the high cliff, and pulled as taut as the force at hand could manage, and made fast. \u0026nbsp;Soon endless ropes were bringing in passengers and crew as fast as place could be found for them. \u0026nbsp;It became simply a race for time. \u0026nbsp;If the fire, working against the wind, did not reach the hawser, and if the ship lasted the furious bumping on the sandbank, which threatened to shake her to pieces each moment, all on board might yet be saved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen’s concern was now for the swimmer alone. \u0026nbsp;Such a gallant soul should not perish without help, if help could be on this side of heaven. \u0026nbsp;She asked the harbour-master, an old fisherman who knew every inch of the coast for miles, if anything could be done. \u0026nbsp;He shook his head sadly as he answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I fear no, my lady. \u0026nbsp;The lifeboat from Granport is up north, no boat from here could get outside the harbour. \u0026nbsp;There’s never a spot in the bay where he could land, even in a less troubled sea than this. \u0026nbsp;Wi’ the wind ashore, there’s no hope for ship or man here that cannot round the point. \u0026nbsp;And a stranger is no like to do that.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why not?’ she asked breathlessly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Because, my lady, there’s a wheen o’ sunken rocks beyond the Head. \u0026nbsp;No one that didn’t know would ever think to keep out beyond them, for the cliff itself goes down sheer. \u0026nbsp;He’s a gallant soul yon; an’ it’s a sore pity he’s goin’ to his death. \u0026nbsp;But it must be! \u0026nbsp;God can save him if He wishes; but I fear none other!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Even as he spoke rose to Stephen’s mind a memory of an old churchyard with great trees and the scent of many flowers, and a child’s voice that sounded harsh through the monotonous hum of bees:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘To be God, and able to do things!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Oh; to be God, if but an hour; and able to do things! \u0026nbsp;To do anything to help a brave man! \u0026nbsp;A wild prayer surged up in the girl’s heart:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh! God, give me this man’s life! \u0026nbsp;Give it to me to atone for the other I destroyed! \u0026nbsp;Let me but help him, and do with me as Thou wilt!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The passion of her prayer seemed to help her, and her brain cleared. \u0026nbsp;Surely something could be done! \u0026nbsp;She would do what she could; but first she must understand the situation. \u0026nbsp;She turned again to the old harbour-master:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘How long would it take him to reach the headland, if he can swim so far?’ \u0026nbsp;The answer came with a settled conviction bearing hope with it:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The wind and tide are wi’ him, an’ he’s a strong swimmer. \u0026nbsp;Perhaps half an hour will take him there. \u0026nbsp;He’s all right in himself. \u0026nbsp;He can swim it, sure. \u0026nbsp;But alack! it’s when he gets there his trouble will be, when none can warn him. \u0026nbsp;Look how the waves are lashing the cliff; and mark the white water beyond! \u0026nbsp;What voice can sound to him out in those deeps? \u0026nbsp;How could he see if even one were there to warn?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here was a hope at any rate. \u0026nbsp;Light and sound were the factors of safety. \u0026nbsp;Some good might be effected if she could get a trumpet; and there were trumpets in the rocket-cart. \u0026nbsp;Light could be had—must be had if all the fences round the headland had to be gathered for a bonfire! \u0026nbsp;There was not a moment to be lost. \u0026nbsp;She ran to the rocket-cart, and got a trumpet from the man in charge. \u0026nbsp;Then she ran to where she had left her horse. \u0026nbsp;She had plenty of escort, for by this time many gentlemen had arrived on horseback from outlying distances, and all offered their services. \u0026nbsp;She thanked them and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You may be useful here. \u0026nbsp;When all these are ashore send on the rocket-cart, and come yourselves to the headland as quick as you can. \u0026nbsp;Tell the coastguards that all those saved are to be taken to the castle. \u0026nbsp;In the rocket-cart bring pitch and tar and oil, and anything that will flame. \u0026nbsp;Stay!’ she cried to the chief boatman. \u0026nbsp;‘Give me some blue lights!’ \u0026nbsp;His answer chilled her:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I’m sorry, my lady, but they are all used. \u0026nbsp;There are the last of them burning now. \u0026nbsp;We have burned them ever since that man began to swim ashore.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Then hurry on the rocket-cart!’ she said as she sprang to the saddle, and swept out on the rough track that ran by the cliffs, following in bold curves the windings of the shore. \u0026nbsp;The white Arab seemed to know that his speed was making for life. \u0026nbsp;As he swept along, far outdistancing the groom, Stephen’s heart went out in silent words which seemed to keep time to the gallop:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, to be God, and be able to do things! \u0026nbsp;Give me this man’s life, oh, God! \u0026nbsp;Give me this man’s life, to atone for that noble one which I destroyed!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Faster and faster, over rough road, cattle track, and grassy sward; over rising and falling ground; now and again so close to the edge of the high cliff that the spume swept up the gulleys in the rocks like a snowstorm, the white Arab swept round the curve of the bay, and came out on the high headland where stood the fisher’s house. \u0026nbsp;On the very brink of the cliff all the fisher folk, men, women and children, stood looking at the far-off burning ship, from which the flames rose in leaping columns.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So intent were all on the cliff that they did not notice her coming; as the roar of the wind came from them to her, they could not hear her voice when she spoke from a distance. \u0026nbsp;She had drawn quite close, having dismounted and hung her rein over the post of the garden paling, when one of the children saw her, and cried out:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The lady! the lady! an’ she’s all in red!’ \u0026nbsp;The men were so intent on something that they did not seem to hear. \u0026nbsp;They were peering out to the north, and were arguing in dumb show as though on something regarding which they did not agree. \u0026nbsp;She drew closer, and touching the old fisherman on the shoulder, called out at his ear:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘What is it?’ \u0026nbsp;He answered without turning, keeping his eyes fixed:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I say it’s a man swimmin’. \u0026nbsp;Joe and Garge here say as it’s only a piece o’ wood or sea-wrack. \u0026nbsp;But I know I’m right. \u0026nbsp;That’s a man swimmin’, or my old eyes have lost their power!’ \u0026nbsp;His words carried conviction; the seed of hope in her beating heart grew on the instant into certainty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is a man. \u0026nbsp;I saw him swim off towards here when he had taken the rope on shore. \u0026nbsp;Do not turn round. \u0026nbsp;Keep your eyes on him so that you may not lose sight of him in the darkness!’ \u0026nbsp;The old man chuckled.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘This darkness! \u0026nbsp;Hee! hee! \u0026nbsp;There be no differ to me between light and dark. \u0026nbsp;But I’ll watch him! \u0026nbsp;It’s you, my lady! \u0026nbsp;I shan’t turn round to do my reverence as you tell me to watch. \u0026nbsp;But, poor soul, it’ll not be for long to watch. \u0026nbsp;The Skyres will have him, sure enow!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘We can warn him!’ she said, ‘when he comes close enough. \u0026nbsp;I have a trumpet here!’ \u0026nbsp;He shook his head sorrowfully:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah! my lady, what trumpet could sound against that storm an’ from this height?’ \u0026nbsp;Stephen’s heart sank. \u0026nbsp;But there was still hope. \u0026nbsp;If the swimmer’s ears could not be reached, his eyes might. \u0026nbsp;Eagerly she looked back for the coming of the rocket-cart. \u0026nbsp;Far off across the deep bay she could see its lamp sway as it passed over the rough ground; but alas! it would never arrive in time. \u0026nbsp;With a note of despair in her voice she asked:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘How long before he reaches the rocks?’ \u0026nbsp;Still without turning the old man answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘At the rate he’s going he will be in the sweep of the current through the rocks within three minutes. \u0026nbsp;If he’s to be saved he must turn seaward ere the stream grips him.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Would there be time to build a bonfire?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No, no! my lady. \u0026nbsp;The wood couldn’t catch in the time!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For an instant a black film of despair seemed to fall on her. \u0026nbsp;The surging of the blood in her head made her dizzy, and once again the prayer of the old memory rang in her brain:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh to be God, and able to do things!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the instant an inspiration flashed through her. \u0026nbsp;She, too could do things in a humble way. \u0026nbsp;She could do something at any rate. \u0026nbsp;If there was no time to build a fire, there was a fire already built.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The house would burn!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The two feet deep of old thatch held down with nets and battened with wreck timber would flare like a beacon. \u0026nbsp;Forthwith she spoke:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Good people, this noble man who has saved a whole shipload of others must not die without an effort. \u0026nbsp;There must be light so that he can see our warning to pass beyond the rocks! \u0026nbsp;The only light can be from the house. \u0026nbsp;I buy it of you. \u0026nbsp;It is mine; but I shall pay you for it and build you such another as you never thought of. \u0026nbsp;But it must be fired at once. \u0026nbsp;You have one minute to clear out all you want. \u0026nbsp;In, quick and take all can. \u0026nbsp;Quick! quick! for God’s sake! \u0026nbsp;It is for a brave man’s life!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The men and women without a word rushed into the house. \u0026nbsp;They too knew the danger, and the only hope there was for a life. \u0026nbsp;The assurance of the Countess took the sting from the present loss. \u0026nbsp;Before the minute, which she timed watch in hand, was over, all came forth bearing armloads of their lares and penates. \u0026nbsp;Then one of the younger men ran in again and out bearing a flaming stick from the fire. \u0026nbsp;Stephen nodded, he held it to the northern edge of the thatch. \u0026nbsp;The straw caught in a flash and the flame ran up the slope and along the edge of the roof like a quick match. \u0026nbsp;The squeaking of many rats was heard and their brown bodies streamed over the roof. \u0026nbsp;Before another minute had passed a great mass of flame towered into the sky and shed a red light far out over the waste of sea.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It lit up the wilderness of white water where the sea churned savagely amongst the sunken rocks; and it lit too the white face of a swimmer, now nearly spent, who rising and falling with each wave, drifted in the sea whose current bore him on towards the fatal rocks.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3234/88512.html","bookId":683,"creation":"Aug 5, 2019 7:30:08 AM","modification":"Aug 5, 2019 7:30:08 AM"}
