{"id":36864,"no":38,"title":"CHAPTER XXXVII—GOLDEN SILENCE","content":"\u0026nbsp;Each day that passed seemed to add to the trouble in the heart of these young people; to widen the difficulty of expressing themselves. \u0026nbsp;To Stephen, who had accepted the new condition of things and whose whole nature had bloomed again under the sunshine of hope, it was the less intolerable. \u0026nbsp;She had set herself to wait, as had countless thousands of women before her; and as due proportion will, till the final cataclysm abolishes earthly unions. \u0026nbsp;But Harold felt the growth, both positive and negative, as a new torture; and he began to feel that he would be unable to go through with it. \u0026nbsp;In his heart was the constant struggle of hope; and in opposition to it the seeming realisation of every new fancy of evil. \u0026nbsp;That bitter hour, when the whole of creation was for him turned upside down, was having its sad effect at last. \u0026nbsp;Had it not been for that horrid remembrance he would have come to believe enough in himself to put his future to the test. \u0026nbsp;He would have made an opportunity at which Stephen and himself would have with the fires of their mutual love burned away the encircling mist. \u0026nbsp;There are times when a single minute of commonsense would turn sorrow into joy; and yet that minute, our own natures being the opposing forces, will be allowed to pass. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Those who loved these young people were much concerned about them. \u0026nbsp;Mrs. Stonehouse took their trouble so much to heart that she spoke to her husband about it, seriously advising that one or other of them should make an effort to bring things in the right way for their happiness. \u0026nbsp;The woman was sure of the woman’s feeling. \u0026nbsp;It is from men, not women, that women hide their love. \u0026nbsp;By side-glances and unthinking moments women note and learn. \u0026nbsp;The man knew already, from his own lips, of the man’s passion. \u0026nbsp;But his lips were sealed by his loyalty; and he said earnestly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My dear, we must not interfere. \u0026nbsp;Not now, at any rate; we might cause them great trouble. \u0026nbsp;I am as sure as you are that they really love each other. \u0026nbsp;But they must win happiness by themselves and through themselves alone. \u0026nbsp;Otherwise it would never be to them what it ought to be; what it might be; what it will be!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So these friends were silent, and the little tragedy developed. \u0026nbsp;Harold’s patience began to give way under the constant strain of self-suppression. \u0026nbsp;Stephen tried to hide her love and fear, under the mask of a gracious calm. \u0026nbsp;This the other took for indifference.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At last there came an hour which was full of new, hopeless agony to Stephen. \u0026nbsp;She heard Harold, in a fragment of conversation, speak to Mr. Stonehouse of the need of returning to Alaska. \u0026nbsp;That sounded like a word of doom. \u0026nbsp;In her inmost heart she knew that Harold loved her; and had she been free she would have herself spoken the words which would have drawn the full truth to them both. \u0026nbsp;But how could she do so, having the remembrance of that other episode; when, without the reality of love, she had declared herself? . . . Oh! the shame of it . . . The folly! . . . And Harold knew it all! \u0026nbsp;How could he ever believe that it was real this time! . . .\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By the exercise of that self-restraint which long suffering had taught her, Stephen so managed to control herself that none of her guests realised what a blow she had received from a casual word. \u0026nbsp;She bore herself gallantly till the last moment. \u0026nbsp;After the old fashion of her youth, she had from the Castle steps seen their departure. \u0026nbsp;Then she took her way to her own room, and locked herself in. \u0026nbsp;She did not often, in these days, give way to tears; when she did cry it was as a luxury, and not from poignant cause. \u0026nbsp;Her deep emotion was dry-eyed as of old. \u0026nbsp;Now, she did not cry, she sat still, her hands clasped below her knees, with set white face gazing out on the far-off sea. \u0026nbsp;For hours she sat there lonely; staring fixedly all the time, though her thoughts were whirling wildly. \u0026nbsp;At first she had some vague purpose, which she hoped might eventually work out into a plan. \u0026nbsp;But thought would not come. \u0026nbsp;Everywhere there was the same beginning: a wild, burning desire to let Harold understand her feeling towards him; to blot out, with the conviction of trust and love, those bitter moments when in the madness of her overstrung passion she had heaped such insult upon him. \u0026nbsp;Everywhere the same end: an impasse. \u0026nbsp;He seemingly could not, would not, understand. \u0026nbsp;She knew now that the man had diffidences, forbearances, self-judgments and self-denials which made for the suppression, in what he considered to be her interest, of his own desires. \u0026nbsp;This was tragedy indeed! \u0026nbsp;Again and again came back the remembrance of that bitter regret of her Aunt Laetitia, which no happiness and no pain of her own had ever been able to efface:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘To love; and be helpless! \u0026nbsp;To wait, and wait, and wait; with heart all aflame! \u0026nbsp;To hope, and hope; till time seemed to have passed away, and all the world to stand still on your hopeless misery! \u0026nbsp;To know that a word might open up Heaven; and yet to have to remain mute! \u0026nbsp;To keep back the glances that could enlighten, to modulate the tones that might betray! \u0026nbsp;To see all you hoped for passing away . . . !’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At last she seemed to understand the true force of pride; which has in it a thousand forces of its own, positive, negative, restrainful. \u0026nbsp;Oh! how blind she had been! \u0026nbsp;How little she had learned from the miseries that the other woman whom she loved had suffered! \u0026nbsp;How unsympathetic she had been; how self-engrossed; how callous to the sensibilities of others! \u0026nbsp;And now to her, in her turn, had come the same suffering; the same galling of the iron fetters of pride, and of convention which is its original expression! \u0026nbsp;Must it be that the very salt of youth must lose its savour, before the joys of youth could be won! \u0026nbsp;What, after all, was youth if out of its own inherent power it must work its own destruction! \u0026nbsp;If youth was so, why not then trust the wisdom of age? \u0026nbsp;If youth could not act for its own redemption . . .\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here the rudiment of a thought struck her and changed the current of her reason. \u0026nbsp;A thought so winged with hope that she dared not even try to complete it! . . . She thought, and thought till the long autumn shadows fell around her. \u0026nbsp;But the misty purpose had become real.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After dinner she went up alone to the mill. \u0026nbsp;It was late for a visit, for the Silver Lady kept early hours. \u0026nbsp;But she found her friend as usual in her room, whose windows swept the course of the sun. \u0026nbsp;Seeing that her visitor was in a state of mental disturbance such as she had once before exhibited, she blew out the candles and took the same seat in the eastern window she had occupied on the night which they both so well remembered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen understood both acts, and was grateful afresh. \u0026nbsp;The darkness would be a help to her in what she had to say; and the resumption of the old seat and attitude did away with the awkwardness of new confidence. \u0026nbsp;During the weeks that had passed Stephen had kept her friend informed of the rescue and progress of the injured man. \u0026nbsp;Since the discovery of Harold’s identity she had allowed her to infer her feeling towards him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Shyly she had conveyed her hopes that all the bitter part of the past might be wiped out. \u0026nbsp;To the woman who already knew of the love that had always been, but had only awakened to consciousness in the absence of its object, a hint was sufficient to build upon. \u0026nbsp;She had noticed the gloom that had of late been creeping over the girl’s happiness; and she had been much troubled about it. \u0026nbsp;But she had thought it wiser to be silent; she well knew that should unhappily the time for comfort come, it must be precluded by new and more explicit confidence. \u0026nbsp;So she too had been anxiously waiting the progress of events. \u0026nbsp;Now; as she put her arms round the girl she said softly; not in the whisper which implies doubt of some kind, but in the soft voices which conveys sympathy and trust:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Tell me, dear child!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And then in broken words shyly spoken, and spoken in such a way that the silences were more eloquent than the words, the girl conveyed what was in her heart. \u0026nbsp;The other listened, now and again stroking the beautiful hair. \u0026nbsp;When all was said, there was a brief pause. \u0026nbsp;The Silver Lady spoke no word; but the pressure of her delicate hand conveyed sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In but a half-conscious way, in words that came so shrinkingly through the darkness that they hardly reached the ear bent low to catch them, came Stephen’s murmured thought:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, if he only knew! \u0026nbsp;And I can’t tell him; I can’t! dare not! \u0026nbsp;I must not. \u0026nbsp;How could I dishonour him by bearing myself towards him as to that other . . . worthless . . . ! \u0026nbsp;Oh! the happy, happy girls, who have mothers . . . !’ \u0026nbsp;All the muscles of her body seemed to shrink and collapse, till she was like an inert mass at the Silver Lady’s feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the other understood!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;After a long, long pause; when Stephen’s sobbing had died away; when each muscle of her body had become rigid on its return to normal calm; the Silver Lady began to talk of other matters, and conversation became normal. \u0026nbsp;Stephen’s courage seemed somehow to be restored, and she talked brightly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Before they parted the Silver Lady made a request. \u0026nbsp;She said in her natural voice:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Couldst thou bring that gallant man who saved so many lives, and to whom the Lord was so good in the restoration of his sight, to see me? \u0026nbsp;Thou knowest I have made a resolution not to go forth from this calm place whilst I may remain. \u0026nbsp;But I should like to see him before he returns to that far North where he has done such wonders. \u0026nbsp;He is evidently a man of kind heart; perhaps he will not mind coming to see a lonely woman who is no longer young. \u0026nbsp;There is much I should like to ask him of that land of which nothing was known in my own youth. \u0026nbsp;Perhaps he will not mind seeing me alone.’ \u0026nbsp;Stephen’s heart beat furiously. \u0026nbsp;She felt suffocating with new hope, for what could be but good from Harold’s meeting with that sweet woman who had already brought so much comfort into her own life? \u0026nbsp;She was abashed, and yet radiant; she seemed to tread on air as she stood beside her friend saying farewell. \u0026nbsp;She did not wish to speak. \u0026nbsp;So the two women kissed and parted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It had been arranged that two days hence the Stonehouse party were to spend the day at Lannoy, coming before lunch and staying the night, as they wanted in the afternoon to return a visit at some distance to the north of Lannoy. \u0026nbsp;Harold was to ride over with them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the Varilands party arrived, Stephen told them of Sister Ruth’s wish to see Harold. \u0026nbsp;Pearl at once proffered a request that she also should be taken at some other time to see the Silver Lady. \u0026nbsp;Harold acquiesced heartily; and it was agreed that some time in the late afternoon he should pay the visit. \u0026nbsp;Stephen would bring him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Strangely enough, she felt no awkwardness, no trepidation, as they rode up the steep road to the Mill.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the introduction had been effected, and half an hour had been consumed in conventional small talk, Stephen, obedience to a look from the Silver Lady, rose. \u0026nbsp;She said in they most natural way she could:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Now Sister Ruth, I will leave you two alone, if you do not mind. \u0026nbsp;Harold can tell you all you want to know about Alaska; and perhaps, if you are very good, he will tell some of his adventures! \u0026nbsp;Good afternoon, dear. \u0026nbsp;I wish you were to be with us to-night; but I know your rule. \u0026nbsp;I go for my ride. \u0026nbsp;Sultan has had no exercise for five days; and he looked at me quite reproachfully when we met this morning. \u0026nbsp;Au revoir, Harold. \u0026nbsp;We shall meet at dinner!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When she had gone Harold came back from the door, and stood in the window looking east. \u0026nbsp;The Silver Lady came and stood beside him. \u0026nbsp;She did not seem to notice his face, but in the mysterious way of women she watched him keenly. \u0026nbsp;She wished to satisfy her own mind before she undertook her self-appointed task.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;Her eyes were turned towards the headland towards which Stephen on her white Arab was galloping at breakneck speed. \u0026nbsp;He was too good a horseman himself, and he knew her prowess on horseback too well to have any anxiety regarding such a rider at Stephen. \u0026nbsp;It was not fear, then, that made his face so white, and his eyes to have such an illimitable sadness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Silver Lady made up her mind. \u0026nbsp;All her instincts were to trust him. \u0026nbsp;She recognised a noble nature, with which truth would be her surest force.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Come,’ she said, ‘sit here, friend; where another friend has often sat with me. \u0026nbsp;From this you can see all the coastline, and all that thou wilt!’ \u0026nbsp;Harold put a chair beside the one she pointed out; and when she was seated he sat also. \u0026nbsp;She began at once with a desperate courage:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I have wanted much to see thee. \u0026nbsp;I have heard much of thee, before thy coming.’ \u0026nbsp;There was something in the tone of her voice which arrested his attention, and he looked keenly at her. \u0026nbsp;Here, in the full light, her face looked sadly white and he noticed that her lips trembled. \u0026nbsp;He said with all the kindliness of his nature, for from the first moment he had seen her he had taken to her, her purity and earnestness and sweetness appealing to some aspiration within him:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You are pale! \u0026nbsp;I fear you are not well! \u0026nbsp;May I call your maid? \u0026nbsp;Can I do anything for you?’ \u0026nbsp;She waved her hand gently:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Nay! \u0026nbsp;It is nothing. \u0026nbsp;It is but the result of a sleepless night and much thought.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh! \u0026nbsp;I wish I had known! \u0026nbsp;I could have put off my visit; and I could have come any other time to suit you.’ \u0026nbsp;She smiled gently:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I fear that would have availed but little. \u0026nbsp;It was of thy coming that I was concerned.’ \u0026nbsp;Seeing his look of amazement, she went on quickly, her voice becoming more steady as she lost sight of herself in her task:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Be patient a little with me. \u0026nbsp;I am an old woman; and until recently it has been many and many years since the calm which I sought here has been ruffled. \u0026nbsp;I had come to believe that for me earthly troubles were no more. \u0026nbsp;But there has come into my life a new concern. \u0026nbsp;I have heard so much of thee, and before thy coming.’ \u0026nbsp;The recurrence of the phrase struck him. \u0026nbsp;He would have asked how such could be, but he deemed it better to wait. \u0026nbsp;She went on:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I have been wishful to ask thy advice. \u0026nbsp;But why should not I tell thee outright that which troubles me? \u0026nbsp;I am not used, at least for these many years, to dissemble. \u0026nbsp;I can but trust thee in all; and lean on thy man’s mercy to understand, and to aid me!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I shall do all in my power, believe me!’ said Harold simply. \u0026nbsp;‘Speak freely!’ \u0026nbsp;She pointed out of the window, where Stephen’s white horse seemed on the mighty sweep of green sward like a little dot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is of her that I would speak to thee!’ \u0026nbsp;Harold’s heart began to beat hard; he felt that something was coming. \u0026nbsp;The Silver Lady went on:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why thinkest thou that she rideth at such speed? \u0026nbsp;It is her habit!’ \u0026nbsp;He waited. \u0026nbsp;She continued:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Doth it not seem to thee that such reckless movement is the result of much trouble; that she seeketh forgetfulness?’ \u0026nbsp;He knew that she was speaking truly; and somehow the conviction was borne upon him that she knew his secret heart, and was appealing to it. \u0026nbsp;If it was about Stephen! \u0026nbsp;If her disquiet was about her; then God bless her! \u0026nbsp;He would be patient and grateful. \u0026nbsp;The Quaker’s voice seemed to come through his thought, as though she had continued speaking whilst he had paused:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘We have all our own secrets. \u0026nbsp;I have had mine; and I doubt not that thou hast had, may still have, thine own. \u0026nbsp;Stephen hath hers! \u0026nbsp;May I speak to thee of her?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I shall be proud! \u0026nbsp;Oh! madam, I thank you with all my heart for your sweet kindness to her. \u0026nbsp;I cannot say what I feel; for she has always been very dear to me!’ \u0026nbsp;In the pause before she spoke again the beating of his own heart seemed to re-echo the quick sounds of Stephen’s galloping horse. \u0026nbsp;He was surprised at the method of her speech when it did come; for she forgot her Quaker idiom, and spoke in the phrasing of her youth:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Do you love her still?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘With all my soul! \u0026nbsp;More than ever!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Then, God be thanked; for it is in your power to do much good. \u0026nbsp;To rescue a poor, human, grieving soul from despair!’ \u0026nbsp;Her words conveyed joy greater than she knew. \u0026nbsp;Harold did not himself know why the air seemed filled with sounds that seemed to answer every doubt of his life. \u0026nbsp;He felt, understood, with that understanding which is quicker than thought. \u0026nbsp;The Silver Lady went on now with a rush:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘See, I have trusted you indeed! \u0026nbsp;I have given away another woman’s secret; but I do it without fear. \u0026nbsp;I can see that you also are troubled; and when I look back on my own life and remember the trouble that sent me out of the world; a lonely recluse here in this spot far from the stress of life, I rejoice that any act of mine can save such another tragedy as my own. \u0026nbsp;I see that I need not go into detail. \u0026nbsp;You know that I am speaking truth. \u0026nbsp;It was before you came so heroically on this new scene that she told me her secret. \u0026nbsp;At a time when nothing was known of you except that you had disappeared. \u0026nbsp;When she laid bare her poor bleeding heart to me, she did it in such wise that for an instant I feared that it was a murder which she had committed. \u0026nbsp;Indeed, she called it so! \u0026nbsp;You understand that I know all your secret; all her part in it at least. \u0026nbsp;And I know that you understand what loving duty lies before you. \u0026nbsp;I see it in your eyes; your brave, true eyes! \u0026nbsp;Go! and the Lord be with thee!’ \u0026nbsp;Her accustomed idiom had returned with prayer. \u0026nbsp;She turned her head away, and, standing up, leaned against the window. \u0026nbsp;Bending over, he took her hand and said simply:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘God bless you! \u0026nbsp;I shall come back to thank you either to-night or to-morrow; and I hope that she will be with me.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He went quickly out of the room. \u0026nbsp;The woman stood for long looking out of the window, and following with tear-dimmed eyes the movement of his great black horse as he swept across country straight as the crow flies, towards the headland whither Stephen had gone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * * * * *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen passed over the wide expanse without thought; certainly without memory of it. \u0026nbsp;Never in her after-life could she recall any thought that had passed through her mind from the time she left the open gate of the windmill yard till she pulled up her smoking, panting horse beside the ruin of the fisher’s house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen was not unhappy! \u0026nbsp;She was not happy in any conscious form. \u0026nbsp;She was satisfied rather than dissatisfied. \u0026nbsp;She was a woman! \u0026nbsp;A woman who waited the coming of a man!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For a while she stood at the edge of the cliff, and looked at the turmoil of the tide churning on the rocks below. \u0026nbsp;Her heart went out in a great burst of thankfulness that it was her hand which had been privileged to aid in rescuing so dear a life. \u0026nbsp;Then she looked around her. \u0026nbsp;Ostensibly it was to survey the ruined house; but in reality to search, even then under her lashes, the whole green expanse sloping up to the windmill for some moving figure. \u0026nbsp;She saw that which made her throat swell and her ears to hear celestial music. \u0026nbsp;But she would not allow herself to think, of that at all events. \u0026nbsp;She was all woman now; all-patient, and all-submissive. \u0026nbsp;She waited the man; and the man was coming!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n For a few minutes she walked round the house as though looking at it critically for some after-purpose. \u0026nbsp;After the wreck Stephen had suggested to Trinity House that there should be a lighthouse on the point; and offered to bear the expense of building it. \u0026nbsp;She was awaiting the answer of the Brethren; and of course nothing would be done in clearing the ground for any purpose till the answer had come. \u0026nbsp;She felt now that if that reply was negative, she would herself build there a pleasure-house of her own.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then she went to the edge of the cliff, and went down the zigzag by which the man and horse had gone to their gallant task. \u0026nbsp;At the edge of the flat rock she sat and thought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And through all her thoughts passed the rider who even now was thundering over the green sward on his way to her. \u0026nbsp;In her fancy at first, and later in her ears, she could hear the sound of his sweeping gallop.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;It was thus that a man should come to a woman!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She had no doubts now. \u0026nbsp;Her quietude was a hymn of grateful praise!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The sound stopped. \u0026nbsp;With all her ears she listened, her heart now beginning to beat furiously. \u0026nbsp;The sea before her, all lines and furrows with the passing tide, was dark under the shadow of the cliff; and the edge of the shadow was marked with the golden hue of sunset.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And then she saw suddenly a pillar of shadow beyond the line of the cliff. \u0026nbsp;It rested but a moment, moved swiftly along the edge, and then was lost to her eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But to another sense there was greater comfort: she heard the clatter of rolling pebbles and the scramble of eager feet. \u0026nbsp;Harold was hastening down the zigzag.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Oh! the music of that sound! \u0026nbsp;It woke all the finer instincts of the woman. \u0026nbsp;All the dross and thought of self passed away. \u0026nbsp;Nature, sweet and simple and true, reigned alone. \u0026nbsp;Instinctively she rose and came towards him. \u0026nbsp;In the simple nobility of her self-surrender and her purpose, which were at one with the grandeur of nature around her, to be negative was to be false.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Since he had spoken with the Silver Lady Harold had swept through the air; the rush of his foaming horse over the sward had been but a slow physical progress, which mocked the on-sweep of his mind. \u0026nbsp;In is rapid ride he too had been finding himself. \u0026nbsp;By the reading of his own soul he knew now that love needs a voice; that a man’s love, to be welcomed to the full, should be dominant and self-believing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the two saw each other’s eyes there was no need for words. \u0026nbsp;Harold came close, opening wide his arms, Stephen flew to them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3234/88518.html","bookId":683,"creation":"Aug 5, 2019 7:30:08 AM","modification":"Aug 5, 2019 7:30:08 AM"}
