{"id":36831,"no":5,"title":"CHAPTER IV—HAROLD AT NORMANSTAND","content":"\u0026nbsp;Two years afterwards a great blow fell upon Harold. \u0026nbsp;His father, who had been suffering from repeated attacks of influenza, was, when in the low condition following this, seized with pneumonia, to which in a few days he succumbed. \u0026nbsp;Harold was heart-broken. \u0026nbsp;The affection which had been between him and his father had been so consistent that he had never known a time when it was not. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Squire Norman had returned to the house with him after the funeral, he sat in silence holding the boy’s hand till he had wept his heart out. \u0026nbsp;By this time the two were old friends, and the boy was not afraid or too shy to break down before him. \u0026nbsp;There was sufficient of the love of the old generation to begin with trust in the new.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently, when the storm was past and Harold had become his own man again, Norman said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And now, Harold, I want you to listen to me. \u0026nbsp;You know, my dear boy, that I am your father’s oldest friend, and right sure I am that he would approve of what I say. \u0026nbsp;You must come home with me to live. \u0026nbsp;I know that in his last hours the great concern of your dear father’s heart would have been for the future of his boy. \u0026nbsp;And I know, too, that it was a comfort to him to feel that you and I are such friends, and that the son of my dearest old friend would be as a son to me. \u0026nbsp;We have been friends, you and I, a long time, Harold; and we have learned to trust, and I hope to love, one another. \u0026nbsp;And you and my little Stephen are such friends already that your coming into the house will be a joy to us all. \u0026nbsp;Why, long ago, when first you came, she said to me the night you went away: “Daddy, wouldn’t it be nice if Harold could come here altogether?”’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And so Harold An Wolf came back with the Squire to Normanstand, and from that day on became a member of his house, and as a son to him. \u0026nbsp;Stephen’s delight at his coming was of course largely qualified by her sympathy with his grief; but it would have been hard to give him more comfort than she did in her own pretty way. \u0026nbsp;Putting her lips to his she kissed him, and holding his big hand in both of her little ones, she whispered softly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Poor Harold! \u0026nbsp;You and I should love each other, for we have both lost our mother. \u0026nbsp;And now you have lost your father. \u0026nbsp;But you must let my dear daddy be yours too!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At this time Harold was between fourteen and fifteen years old. \u0026nbsp;He was well educated in so far as private teaching went. \u0026nbsp;His father had devoted much care to him, so that he was well grounded in all the Academic branches of learning. \u0026nbsp;He was also, for his years, an expert in most manly exercises. \u0026nbsp;He could ride anything, shoot straight, fence, run, jump or swim with any boy more than his age and size.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In Normanstand his education was continued by the rector. \u0026nbsp;The Squire used often to take him with him when he went to ride, or fish, or shoot; frankly telling him that as his daughter was, as yet, too young to be his companion in these matters, he would act as her locum tenens. \u0026nbsp;His living in the house and his helping as he did in Stephen’s studies made familiarity perpetual. \u0026nbsp;He was just enough her senior to command her childish obedience; and there were certain qualities in his nature which were eminently calculated to win and keep the respect of women as well as of men. \u0026nbsp;He was the very incarnation of sincerity, and had now and again, in certain ways, a sublime self-negation which, at times, seemed in startling contrast to a manifestly militant nature. \u0026nbsp;When at school he had often been involved in fights which were nearly always on matters of principle, and by a sort of unconscious chivalry he was generally found fighting on the weaker side. \u0026nbsp;Harold’s father had been very proud of his ancestry, which was Gothic through the Dutch, as the manifestly corrupted prefix of the original name implied, and he had gathered from a constant study of the Sagas something of the philosophy which lay behind the ideas of the Vikings.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This new stage of Harold’s life made for quicker development than any which had gone before. \u0026nbsp;Hitherto he had not the same sense of responsibility. \u0026nbsp;To obey is in itself a relief; and as it is an actual consolation to weak natures, so it is only a retarding of the strong. \u0026nbsp;Now he had another individuality to think of. \u0026nbsp;There was in his own nature a vein of anxiety of which the subconsciousness of his own strength threw up the outcrop.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Little Stephen with the instinct of her sex discovered before long this weakness. \u0026nbsp;For it is a weakness when any quality can be assailed or used. \u0026nbsp;The using of a man’s weakness is not always coquetry; but it is something very like it. \u0026nbsp;Many a time the little girl, who looked up to and admired the big boy who could compel her to anything when he was so minded, would, for her own ends, work on his sense of responsibility, taking an elfin delight in his discomfiture.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The result of Stephen’s harmless little coquetries was that Harold had occasionally either to thwart some little plan of daring, or else cover up its results. \u0026nbsp;In either case her confidence in him grew, so that before long he became an established fact in her life, a being in whose power and discretion and loyalty she had absolute, blind faith. \u0026nbsp;And this feeling seemed to grow with her own growth. \u0026nbsp;Indeed at one time it came to be more than an ordinary faith. \u0026nbsp;It happened thus:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old Church of St. Stephen, which was the parish church of Normanstand, had a peculiar interest for the Norman family. \u0026nbsp;There, either within the existing walls or those which had preceded them when the church was rebuilt by that Sir Stephen who was standard-bearer to Henry VI., were buried all the direct members of the line. \u0026nbsp;It was an unbroken record of the inheritors since the first Sir Stephen, who had his place in the Domesday Book. \u0026nbsp;Without, in the churchyard close to the church, were buried all such of the collaterals as had died within hail of Norcester. \u0026nbsp;Some there were of course who, having achieved distinction in various walks of life, were further honoured by a resting-place within the chancel. \u0026nbsp;The whole interior was full of records of the family. \u0026nbsp;Squire Norman was fond of coming to the place; and often from the very beginning had taken Stephen with him. \u0026nbsp;One of her earliest recollections was kneeling down with her father, who held her hand in his, whilst with the other he wiped the tears from his eyes, before a tomb sculptured beautifully in snowy marble. \u0026nbsp;She never forgot the words he had said to her:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You will always remember, darling, that your dear mother rests in this sacred place. \u0026nbsp;When I am gone, if you are ever in any trouble come here. \u0026nbsp;Come alone and open out your heart. \u0026nbsp;You need never fear to ask God for help at the grave of your mother!’ \u0026nbsp;The child had been impressed, as had been many and many another of her race. \u0026nbsp;For seven hundred years each child of the house of Norman had been brought alone by either parent and had heard some such words. \u0026nbsp;The custom had come to be almost a family ritual, and it never failed to leave its impress in greater or lesser degree.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Whenever Harold had in the early days paid a visit to Normanstand, the church had generally been an objective of their excursions. \u0026nbsp;He was always delighted to go. \u0026nbsp;His love for his own ancestry made him admire and respect that of others; so that Stephen’s enthusiasm in the matter was but another cord to bind him to her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In one of their excursions they found the door into the crypt open; and nothing would do Stephen but that they should enter it. \u0026nbsp;To-day, however, they had no light; but they arranged that on the morrow they would bring candles with them and explore the place thoroughly. \u0026nbsp;The afternoon of the next day saw them at the door of the crypt with a candle, which Harold proceeded to light. \u0026nbsp;Stephen looked on admiringly, and said in a half-conscious way, the half-consciousness being shown in the implication:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You are not afraid of the crypt?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Not a bit! \u0026nbsp;In my father’s church there was a crypt, and I was in it several times.’ \u0026nbsp;As he spoke the memory of the last time he had been there swept over him. \u0026nbsp;He seemed to see again the many lights, held in hands that were never still, making a grim gloom where the black shadows were not; to hear again the stamp and hurried shuffle of the many feet, as the great oak coffin was borne by the struggling mass of men down the steep stairway and in through the narrow door . . . And then the hush when voices faded away; and the silence seemed a real thing, as for a while he stood alone close to the dead father who had been all in all to him. \u0026nbsp;And once again he seemed to feel the recall to the living world of sorrow and of light, when his inert hand was taken in the strong loving one of Squire Norman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He paused and drew back.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why don’t you go on?’ she asked, surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He did not like to tell her then. \u0026nbsp;Somehow, it seemed out of place. \u0026nbsp;He had often spoken to her of his father, and she had always been a sympathetic listener; but here, at the entrance of the grim vault, he did not wish to pain her with his own thoughts of sorrow and all the terrible memories which the similarity of the place evoked. \u0026nbsp;And even whilst he hesitated there came to him a thought so laden with pain and fear that he rejoiced at the pause which gave it to him in time. \u0026nbsp;It was in that very crypt that Stephen’s mother had been buried, and had they two gone in, as they had intended, the girl might have seen her mother’s coffin as he had seen his father’s, but under circumstances which made him shiver. \u0026nbsp;He had been, as he said, often in the crypt at Carstone; and well he knew the sordidness of the chamber of death. \u0026nbsp;His imagination was alive as well as his memory; he shuddered, not for himself, but for Stephen. \u0026nbsp;How could he allow the girl to suffer in such a way as she might, as she infallibly would, if it were made apparent to her in such a brutal way? \u0026nbsp;How pitiful, how meanly pitiful, is the aftermath of death. \u0026nbsp;Well he remembered how many a night he woke in an agony, thinking of how his father lay in that cold, silent, dust-strewn vault, in the silence and the dark, with never a ray of light or hope or love! \u0026nbsp;Gone, abandoned, forgotten by all, save perhaps one heart which bled . . . He would save little Stephen, if he could, from such a memory. \u0026nbsp;He would not give any reason for refusing to go in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He blew out the candle, and turned the key in the lock, took it out, and put it in his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Come, Stephen!’ he said, ‘let us go somewhere else. \u0026nbsp;We will not go into the crypt to-day!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why not?’ \u0026nbsp;The lips that spoke were pouted mutinously and the face was flushed. \u0026nbsp;The imperious little lady was not at all satisfied to give up the cherished project. \u0026nbsp;For a whole day and night she had, whilst waking, thought of the coming adventure; the thrill of it was not now to be turned to cold disappointment without even an explanation. \u0026nbsp;She did not think that Harold was afraid; that would be ridiculous. \u0026nbsp;But she wondered; and mysteries always annoyed her. \u0026nbsp;She did not like to be at fault, more especially when other people knew. \u0026nbsp;All the pride in her revolted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why not?’ she repeated more imperiously still.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Harold said kindly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Because, Stephen, there is really a good reason. \u0026nbsp;Don’t ask me, for I can’t tell you. \u0026nbsp;You must take it from me that I am right. \u0026nbsp;You know, dear, that I wouldn’t willingly disappoint you; and I know that you had set your heart on this. \u0026nbsp;But indeed, indeed I have a good reason.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen was really angry now. \u0026nbsp;She was amenable to reason, though she did not consciously know what reason was; but to accept some one else’s reason blindfold was repugnant to her nature, even at her then age. \u0026nbsp;She was about to speak angrily, but looking up she saw that Harold’s mouth was set with marble firmness. \u0026nbsp;So, after her manner, she acquiesced in the inevitable and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘All right! \u0026nbsp;Harold.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But in the inner recesses of her firm-set mind was a distinct intention to visit the vault when more favourable circumstances would permit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3234/88485.html","bookId":683,"creation":"Aug 5, 2019 7:30:08 AM","modification":"Aug 5, 2019 7:30:08 AM"}
