{"id":36834,"no":8,"title":"CHAPTER VII—THE NEED OF KNOWING","content":"\u0026nbsp;When Stephen announced her intention of going with her father to the Petty Sessions Court, there was consternation amongst the female population of Normanstand and Norwood. \u0026nbsp;Such a thing had not been heard of in the experiences of any of them. \u0026nbsp;Courts of Justice were places for men; and the lower courts dealt with a class of cases . . . It was quite impossible to imagine where any young lady could get such an idea . . . \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Laetitia Rowly recognised that she had a difficult task before her, for she was by now accustomed to Stephen’s quiet method of having her own way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She made a careful toilet before driving over to Normanstand. \u0026nbsp;Her wearing her best bonnet was a circumstance not unattended with dread for some one. \u0026nbsp;Behold her then, sailing into the great drawing-room at Normanstand with her mind so firmly fixed on the task before her as to be oblivious of minor considerations. \u0026nbsp;She was so fond of Stephen, and admired so truly her many beauties and fine qualities, that she was secure and without flaw in her purpose. \u0026nbsp;Stephen was in danger, and though she doubted if she would be able to effect any change, she was determined that at least she should not go into danger with her eyes unopened.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen entered hastily and ran to her. \u0026nbsp;She loved her great-aunt; really and truly loved her. \u0026nbsp;And indeed it would have been strange if she had not, for from the earliest hour which she could recollect she had received from her nothing but the truest, fondest affection. \u0026nbsp;Moreover she deeply respected the old lady, her truth, her resolution, her kindliness, her genuine common-sense ability. \u0026nbsp;Stephen always felt safe with her aunt. \u0026nbsp;In the presence of others she might now and again have a qualm or a doubt; but not with her. \u0026nbsp;There was an abiding calm in her love, answering love realised and respected. \u0026nbsp;Her long and intimate knowledge of Laetitia made her aware of her moods. \u0026nbsp;She could read the signs of them. \u0026nbsp;She knew well the meaning of the bonnet which actually seemed to quiver as though it had a sentience of its own. \u0026nbsp;She knew well the cause of her aunt’s perturbation; the pain which must be caused to her was perhaps the point of most resistance in herself—she having made up her mind to her new experience. \u0026nbsp;All she could do would be to try to reconcile her by the assurance of good intention; by reason, and by sweetness of manner. \u0026nbsp;When she had kissed her and sat beside her, holding her hand after her pretty way, she, seeing the elder woman somewhat at a loss, opened the subject herself:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You look troubled, auntie! \u0026nbsp;I hope it is nothing serious?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is, my dear! \u0026nbsp;Very serious! \u0026nbsp;Everything is serious to me which touches you.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Me, Auntie!’ \u0026nbsp;Hypocrisy is a fine art.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes! yes, Stephen. \u0026nbsp;Oh! my dear child, what is this I hear about your going to Petty Sessions with your father?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, that! \u0026nbsp;Why, Auntie dear, you must not let that trouble you. \u0026nbsp;It is all right. \u0026nbsp;That is necessary!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Necessary!’ the old lady’s figure grew rigid and her voice was loud and high. \u0026nbsp;‘Necessary for a young lady to go to a court house. \u0026nbsp;To hear low people speaking of low crimes. \u0026nbsp;To listen to cases of the most shocking kind; cases of low immorality; cases of a kind, of a nature of a—a—class that you are not supposed to know anything about. \u0026nbsp;Really, Stephen! . . . ’ \u0026nbsp;She was drawing away her hand in indignation. \u0026nbsp;But Stephen held it tight, as she said very sweetly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘That is just it, Auntie. \u0026nbsp;I am so ignorant that I feel I should know more of the lives of those very people!’ \u0026nbsp;Miss Laetitia interrupted:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ignorant! \u0026nbsp;Of course you are ignorant. \u0026nbsp;That is what you ought to be. \u0026nbsp;Isn’t it what we have all been devoting ourselves to effect ever since you were born? \u0026nbsp;Read your third chapter of Genesis and remember what came of eating of the fruit of the Tree of Knowledge.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I think the Tree of Knowledge must have been an orange tree.’ \u0026nbsp;The old lady looked up, her interest aroused:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Because ever since Eden other brides have worn its blossom!’ \u0026nbsp;Her tone was demure. \u0026nbsp;Miss Rowly looked sharply at her, but her sharpness softened off into a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘H’m!’ she said, and was silent. \u0026nbsp;Stephen seized the opportunity to put her own case:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Auntie dear, you must forgive me! \u0026nbsp;You really must, for my heart is set on this. \u0026nbsp;I assure you I am not doing it merely to please myself. \u0026nbsp;I have thought over the whole matter. \u0026nbsp;Father has always wished me to be in a position—a position of knowledge and experience—to manage Normanstand if I should ever succeed him. \u0026nbsp;From the earliest time I can remember he has always kept this before me, and though of course I did not at first understand what it meant, I have seemed in the last few years to know better. \u0026nbsp;Accordingly I learned all sorts of things under his care, and sometimes even without his help. \u0026nbsp;I have studied the estate map, and I have been over the estate books and read some of the leases and all such matters which they deal with in the estate office. \u0026nbsp;This only told me the bones of the thing. \u0026nbsp;I wanted to know more of our people; and so I made a point of going now and again to each house that we own. \u0026nbsp;Of seeing the people and talking with them familiarly; as familiarly as they would let me, and indeed so far as was possible considering my position. \u0026nbsp;For, Auntie dear, I soon began to learn—to learn in a way there was no mistaking—what my position is. \u0026nbsp;And so I want to get to know more of their ordinary lives; the darker as well as the lighter side. \u0026nbsp;I would like to do them good. \u0026nbsp;I can see how my dear daddy has always been a sort of power to help them, and I would like to carry on his work; to carry it further if I may. \u0026nbsp;But I must know.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her aunt had been listening with growing interest, and with growing respect too, for she realised the intense earnestness which lay behind the girl’s words and her immediate purpose. \u0026nbsp;Her voice and manner were both softened:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But, my dear, surely it is not necessary to go into the Court to know these things. \u0026nbsp;The results of each case become known.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘That is just it, Auntie,’ she answered quickly. \u0026nbsp;‘The magistrates have to hear the two sides of the case before even they can make up their minds. \u0026nbsp;I want to hear both sides, too! \u0026nbsp;If people are guilty, I want to know the cause of their guilt. \u0026nbsp;If they are innocent, I want to know what the circumstances can be which make innocence look like guilt. \u0026nbsp;In my own daily life I may be in the way of just such judgments; and surely it is only right that judgment should be just!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Again she paused; there rose before her mind that conversation in the churchyard when Harold had said that it was difficult for women to be just.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Rowly reflected too. \u0026nbsp;She was becoming convinced that in principle the girl was right. \u0026nbsp;But the details were repugnant as ever to her; concentrating her mind on the point where she felt the ground firm under her, she made her objection:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But, Stephen dear, there are so many cases that are sordid and painful!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The more need to know of sordid things; if sordidness plays so important a part in the tragedy of their lives!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But there are cases which are not within a woman’s province. \u0026nbsp;Cases that touch sin . . . ’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘What kind of sin do you mean? \u0026nbsp;Surely all wrong-doing is sin!’ \u0026nbsp;The old lady was embarrassed. \u0026nbsp;Not by the fact, for she had been for too many years the mistress of a great household not to know something of the subject on which she spoke, but that she had to speak of such a matter to the young girl whom she so loved.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The sin, my dear, of . . . of woman’s wrong-doing . . . as woman . . . of motherhood, without marriage!’ \u0026nbsp;All Stephen’s nature seemed to rise in revolt.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why, Auntie,’ she spoke out at once, ‘you yourself show the want of the very experience I look for!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘How? what?’ asked the old lady amazed and bristling. \u0026nbsp;Stephen took her hand and held it affectionately as she spoke:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You speak of a woman’s wrong-doing, when surely it is a man’s as well. \u0026nbsp;There does not seem to be blame for him who is the more guilty. \u0026nbsp;Only for poor women! . . . And, Auntie dear, it is such poor women that I should like to help . . . Not when it is too late, but before! \u0026nbsp;But how can I help unless I know? \u0026nbsp;Good girls cannot tell me, and good women won’t! \u0026nbsp;You yourself, Auntie, didn’t want to speak on the subject; even to me!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But, my dear child, these are not things for unmarried women. \u0026nbsp;I never speak of them myself except with matrons.’ \u0026nbsp;Stephen’s answer flashed out like a sword; and cut like one:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And yet you are unmarried! \u0026nbsp;Oh, Auntie dear, I did not and I do not mean to be offensive, or to hurt you in any way. \u0026nbsp;I know, dear, your goodness and your kindness to all. \u0026nbsp;But you limit yourself to one side!’ \u0026nbsp;The elder lady interrupted:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘How do you mean? one side! which side?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The punishment side. \u0026nbsp;I want to know the cause of that which brings the punishment. \u0026nbsp;There surely is some cross road in a girl’s life where the ways part. \u0026nbsp;I want to stand there if I can, with warning in one hand and help in the other. \u0026nbsp;Oh! Auntie, Auntie, can’t you see that my heart is in this . . . These are our people; Daddy says they are to be my people; and I want to know their lives right through; to understand their wants, and their temptations, and their weakness. \u0026nbsp;Bad and good, whatever it be, I must know it all; or I shall be working in the dark, and may injure or crush where I had looked to help and raise.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As she spoke she looked glorified. \u0026nbsp;The afternoon autumn sun shone full through the great window and lighted her up till she looked like a spirit. \u0026nbsp;Lighted her white diaphanous dress till it seemed to take shape as an ethereal robe; lighted her red hair till it looked like a celestial crown; lighted her great dark eyes till their black beauty became swept in the tide of glory.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The heart of the old woman who loved her best heaved, and her bosom swelled with pride. \u0026nbsp;Instinctively she spoke:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, you noble, beautiful creature! \u0026nbsp;Of course you are right, and your way is God’s way!’ \u0026nbsp;With tears that rained down her furrowed cheeks, she put her arms round the girl and kissed her fondly. \u0026nbsp;Still holding her in her arms she gave her the gentle counsel which was the aftermath of her moment of inspiration.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But Stephen dear, do be careful! \u0026nbsp;Knowledge is a two-edged sword, and it is apt to side with pride. \u0026nbsp;Remember what was the last temptation of the serpent to Eve: “Your eyes shall be opened, and ye shall be as gods, knowing good and evil.”’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I shall be very careful,’ she said gravely; and then added as if by an afterthought, ‘of course you understand that my motive is the acquisition of knowledge?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes?’ the answer was given interrogatively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Don’t you think, dear, that Eve’s object was not so much the acquisition of knowledge as the gratification of curiosity.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘That may be,’ said the elder lady in a doubtful tone; ‘but my dear, who is to enlighten us as to which is which? \u0026nbsp;We are apt in such matters to deceive ourselves. \u0026nbsp;The more we know, the better are we able to deceive others; and the better we are able to deceive others the better we are able to deceive ourselves. \u0026nbsp;As I tell you, dear, knowledge is two-edged and needs extra carefulness in its use!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘True!’ said Stephen reflectively. \u0026nbsp;Long after her aunt had gone she sat thinking.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n * * * * *\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Once again did Miss Rowly try to restrain Stephen from a project. \u0026nbsp;This was when a little later she wished to go for a few days to the University Mission House in the East end of London. \u0026nbsp;Ever since her visit to Oxford she had kept up a correspondence with her mother’s old friend. \u0026nbsp;It was this lady’s habit to spend a part of vacation in the Mission; and Stephen had had much correspondence with her regarding the work. \u0026nbsp;At last she wrote that if she might, she would like to come and see for herself. \u0026nbsp;The answer was a cordial invitation, armed with which she asked her father to allow her to go. \u0026nbsp;He at once assented. \u0026nbsp;He had been watching keenly the development of her character, and had seen with pride and satisfaction that as time went on she seemed to acquire greater resolution, larger self-dependence. \u0026nbsp;She was becoming more and more of his ideal. \u0026nbsp;Without losing any of her womanhood, she was beginning to look at things more from a man’s point of view than is usually done by, or possible to, women.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When she returned at the end of a week she was full of new gravity. \u0026nbsp;After a while this so far changed that her old lighter moods began to have their place, but it seemed that she never lost, and that she never would lose, the effect of that week of bitter experience amongst the ‘submerged tenth.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The effect of the mental working was shown by a remark made by Harold when home on his next college vacation. \u0026nbsp;He had been entering with her on a discussion of an episode on the estate:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Stephen, you are learning to be just!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At the moment she was chagrined by the remark, though she accepted it in silence; but later, when she had thought the matter over, she took from it infinite pleasure. \u0026nbsp;This was indeed to share man’s ideas and to think with the workings of man’s mind. \u0026nbsp;It encouraged her to further and larger ideas, and to a greater toleration than she had hitherto dreamed of.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Of all those who loved her, none seemed to understand so fully as Laetitia Rowly the change in her mental attitude, or rather the development of it. \u0026nbsp;Now and again she tried to deflect or modify certain coming forces, so that the educational process in which she had always had a part would continue in the right direction. \u0026nbsp;But she generally found that the girl had been over the ground so thoroughly that she was able to defend her position. \u0026nbsp;Once, when she had ventured to remonstrate with her regarding her attitude of woman’s equality with man, she felt as if Stephen’s barque was indeed entering on dangerous seas. \u0026nbsp;The occasion had arisen thus: Stephen had been what her aunt had stigmatised as ‘laying down the law’ with regard to the position a married woman, and Miss Rowly, seeing a good argumentative opening, remarked:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But what if a woman does not get the opportunity of being married?’ \u0026nbsp;Stephen looked at her a moment before saying with conviction:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is a woman’s fault if she does not get the opportunity!’ \u0026nbsp;The old lady smiled as she answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Her fault? \u0026nbsp;My dear, what if no man asks her?’ \u0026nbsp;This seemed to her own mind a poser.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Still her own fault! \u0026nbsp;Why doesn’t she ask him?’ \u0026nbsp;Her aunt’s lorgnon was dropped in horrified amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen went on impassively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Certainly! \u0026nbsp;Why shouldn’t she? \u0026nbsp;Marriage is a union. \u0026nbsp;As it is in the eye of the law a civil contract, either party to it should be at liberty to originate the matter. \u0026nbsp;If a woman is not free to think of a man in all ways, how is she to judge of the suitability of their union? \u0026nbsp;And if she is free in theory, why not free to undertake if necessary the initiative in a matter so momentous to herself?’ \u0026nbsp;The old lady actually groaned and wrung her hands; she was horrified at such sentiments. \u0026nbsp;They were daring enough to think; but to put them in words! . . .\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, my dear, my dear!’ she moaned, ‘be careful what you say. \u0026nbsp;Some one might hear you who would not understand, as I do, that you are talking theory.’ \u0026nbsp;Stephen’s habit of thought stood to her here. \u0026nbsp;She saw that her aunt was distressed, and as she did not wish to pain her unduly, was willing to divert the immediate channel of her fear. \u0026nbsp;She took the hand which lay in her lap and held it firmly whilst she smiled in the loving old eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Of course, Auntie dear, it is theory. \u0026nbsp;But still it is a theory which I hold very strongly!’ . . . Here a thought struck her and she said suddenly:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Did you ever . . . How many proposals did you have, Auntie?’ \u0026nbsp;The old lady smiled; her thoughts were already diverted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Several, my dear! \u0026nbsp;It is so long ago that I don’t remember!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh yes, you do, Auntie! \u0026nbsp;No woman ever forgets that, no matter what else she may or may not remember! \u0026nbsp;Tell me, won’t you?’ \u0026nbsp;The old lady blushed slightly as she answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘There is no need to specify, my dear. \u0026nbsp;Let it be at this, that there were more than you could count on your right hand!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And why did you refuse them?’ \u0026nbsp;The tone was wheedling, and the elder woman loved to hear it. \u0026nbsp;Wheedling is the courtship, by the young of the old.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Because, my dear, I didn’t love them.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But tell me, Auntie, was there never any one that you did love?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah! my dear, that is a different matter. \u0026nbsp;That is the real tragedy of a woman’s life.’ \u0026nbsp;In flooding reminiscent thought she forgot her remonstrating; her voice became full of natural pathos:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘To love; and be helpless! \u0026nbsp;To wait, and wait, and wait; with your heart all aflame! \u0026nbsp;To hope, and hope; till time seems to have passed away, and all the world to stand still on your hopeless misery! \u0026nbsp;To know that a word might open up Heaven; and yet to have to remain mute! \u0026nbsp;To keep back the glances that could enlighten; to modulate the tones that might betray! \u0026nbsp;To see all you hoped for passing away . . . to another! . . . ’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stephen bent over and kissed her, then standing up said:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I understand! \u0026nbsp;Isn’t it wrong, Auntie, that there should be such tragedies? \u0026nbsp;Should not that glance be given? \u0026nbsp;Why should that tone be checked? \u0026nbsp;Why should one be mute when a single word might, would, avert the tragedy? \u0026nbsp;Is it not possible, Auntie, that there is something wrong in our social system when such things can happen; and can happen so often?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She looked remorseless as well as irresistible in the pride of her youthful strength as with eyes that blazed, not flashing as in passion but with a steady light that seemed to burn, she continued:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Some day women must learn their own strength, as well as they have learned their own weakness. \u0026nbsp;They are taught this latter from their cradles up; but no one ever seems to teach them wherein their power lies. \u0026nbsp;They have to learn this for themselves; and the process and the result of the self-teaching are not good. \u0026nbsp;In the University Settlement I learned much that made my heart ache; but out of it there seemed some lesson for good.’ \u0026nbsp;She paused; and her aunt, wishing to keep the subject towards higher things, asked:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And that lesson, Stephen dear?’ \u0026nbsp;The blazing eyes turned to her so that she was stirred by them as the answer came:\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is bad women who seem to know men best, and to be able to influence them most. \u0026nbsp;They can make men come and go at will. \u0026nbsp;They can turn and twist and mould them as they choose. \u0026nbsp;And they never hesitate to speak their own wishes; to ask for what they want. \u0026nbsp;There are no tragedies, of the negative kind, in their lives. \u0026nbsp;Their tragedies have come and gone already; and their power remains. \u0026nbsp;Why should good women leave power to such as they? \u0026nbsp;Why should good women’s lives be wrecked for a convention? \u0026nbsp;Why in the blind following of some society fetish should life lose its charm, its possibilities? \u0026nbsp;Why should love eat its heart out, in vain? \u0026nbsp;The time will come when women will not be afraid to speak to men, as they should speak, as free and equal. \u0026nbsp;Surely if a woman is to be the equal and lifelong companion of a man, the closest to him—nay, the only one really close to him: the mother of his children—she should be free at the very outset to show her inclination to him just as he would to her. \u0026nbsp;Don’t be frightened, Auntie dear; your eyes are paining me! . . . There! perhaps I said too much. \u0026nbsp;But after all it is only theory. \u0026nbsp;Take for your comfort, Auntie dear, that I am free an heart-whole. \u0026nbsp;You need not fear for me; I can see what your dear eyes tell me. \u0026nbsp;Yes! \u0026nbsp;I am very young; perhaps too young to think such things. \u0026nbsp;But I have thought of them. \u0026nbsp;Thought them all over in every way and phase I can imagine.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She stopped suddenly; bending over, she took the old lady in her arms and kissed her fondly several times, holding her tight. \u0026nbsp;Then, as suddenly releasing her, she ran away before she could say a word.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3234/88488.html","bookId":683,"creation":"Aug 5, 2019 7:30:08 AM","modification":"Aug 5, 2019 7:30:08 AM"}
