{"id":17861,"no":30,"title":"CHAPTER XXX PAY DIRT","content":"\u0026nbsp;Dolt Haven seemed unable to answer for a few moments. Cromley gave him another drink of water, and then the man was able to gasp out directions for finding Noddy and his crony who, it seemed, were partly buried under a mass of rock, trees and dirt about half a mile away. \n\u003cdiv\u003e\n “We’ll do what we can,” offered Jerry, as he started off, followed by the others. And then Ned expressed a doubt that was in the minds of all when he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose this is a trick to get us away from the gold in the cave so they can sneak around and make off with it. Hadn’t one of us better stay on guard?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Tinny considered this for a moment. Ned had voiced his thought apart from Dolt, who was slowly walking along with Cromley, to show the place where Noddy and Jack were caught.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think Dolt is telling the truth,” said the mine owner. “No man would injure himself the way he is injured just to put over a fake story.[242] Besides, we’ll take him with us, and if there is any crooked work we’ll hold him for a hostage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Dolt seemed to guess that something like this was afoot, for as he limped along he said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “You needn’t be afraid—we’re through. We played a rotten trick on Bill, here, and I hope he forgives me. But we’re through! If ever I get back East again I’ll never have any more to do with Noddy Nixon or Jack Pender. They’re crooks, that’s what they are. I thought it was a square game they were playing, even when they kidnaped you,” and he looked at Cromley. “I know better now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This settled it, and, leaving the gold well hidden in the cave, they hastened to the place where Noddy and Jack had been caught under the landslide—a different one from that which had revealed the treasure chest.\n\u003c/div\u003e \n\u003cdiv\u003e\n It needed but a glance to show that Haven’s story was true. Noddy and Jack were in great danger. Both had been struck on the head and partially stunned, which made them unable to help themselves. And Haven was so weak from loss of blood and so unnerved from the shock that he was of little value as a rescuer.\n\u003c/div\u003e \n\u003cdiv\u003e\n With pieces of wood and tree limbs, for they had no shovels, the rescuers dug, pried, pushed, and pulled until they had lifted or cast aside most of the débris that covered Jack and Noddy. As[243] in the case of themselves, some interlocking tree branches and bushes, forming an arch over the twain, had alone saved them from being crushed to death. As it was, they were badly bruised, scratched, and cut, but no bones were broken.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Whew!” gasped Noddy, as he was pulled out. “That was awful! Who’d you get to help us, Dolt?”\n\u003c/div\u003e \n\u003cdiv\u003e\n He appeared dazed, and evidently did not know his rescuers. But when he saw the Motor Boys, Bill, and Tinny and realized that it was to them he owed, perhaps, his life, as did Jack Pender, the bully had the grace to blush.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You fellows need help and a doctor, I should say,” observed Tinny. “There’s some sort of settlement about five miles from here. We’ll do what we can for you until help comes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who’s going to get help?” gasped Dolt Haven. “I can’t—I’m all in!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll go,” offered Tinny. “I know the roads best,” he said, as Jerry was about to speak. “I can go more quickly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In about three hours a wagon was brought up the trail and the three conspirators, who really were sorely in need of medical attention, were taken away. The reaction after their rescue seemed to be too much for them, and they were all in a fainting condition as they were laid in the wagon.\n\u003c/div\u003e \n\u003cdiv\u003e\n [244]\n\u003c/div\u003e \n\u003cdiv\u003e\n That was the last the Motor Boys saw of Noddy Nixon and his two companions for a long time. It was decided that it was not worth while to prosecute them for kidnaping Cromley.\n\u003c/div\u003e \n\u003cdiv\u003e\n While getting assistance for Noddy, Jack, and Dolt, Tinny also engaged a wagon to come and get him and his friends, and to transport the gold. Nothing was said of the finding of the treasure chest, it being given out that the sacks of gold were merely some specimens of ore taken from a prospect the party was interested in.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was learned that Noddy and his two companions were making their way toward what they believed to be the location of Blue Rock when the landslide caught them. Dolt had, by good luck, merely stumbled upon the party at the cave, as he had no knowledge that they were there.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, it sure does seem good to be back,” observed Jerry the next day, as, lame and stiff, weary and worn, they approached the cabin at Leftover. “I wonder how Hang Gow is getting along?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I wonder if anything’s left of our mine,” said Tinny. “It seems a month since I last saw it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s Hang Gow now!” exclaimed Ned, as the Chinese cook came from the cabin. At the[245] sight of his master and friends the Celestial gave vent to a shrill cackling laugh and cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Glub soon leddy! Glub alle sammee leddy soon lite quick!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He vanished into his kitchen, from which soon issued a rattling of pots and pans that argued well and which brought a smile of peace and happiness to the face of Bob.\n\u003c/div\u003e \n\u003cdiv\u003e\n The bags of gold were unloaded from the wagon, the driver paid and sent away, and then the Motor Boys, Tinny and Bill breathed freely. They had brought their treasure home.\n\u003c/div\u003e \n\u003cdiv\u003e\n Out of the cabin, in the sunset glow of the evening, strolled Professor Snodgrass. He saw the sacks piled on a bench. Springing toward one he cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you found it! You found it, didn’t you? Where was it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What—the treasure?” asked Bob. “Well, it was in the chest at Blue Rock, but——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Treasure! I wasn’t speaking of treasure!” cried the little scientist. “I mean this pseudotinea—it is a bee moth—one of the rarest in this country!” and from a sack of gold he caught up a small butterfly with which he disappeared into the cabin.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, wouldn’t that freeze your ice-cream!” cried Bob. “Here we come back after a wonderful trip—been gone nearly a week and find a[246] million dollars’ worth of gold—and all the professor cares about is a bug that happens to light on a bag of nuggets! Can you beat it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We can’t—and we’ll not try,” remarked Ned.\n\u003c/div\u003e \n\u003cdiv\u003e\n Bob was wrong, however, about there being a million dollars’ worth of gold in the treasure chest of Blue Rock. There was a large sum, though, and Bill Cromley was given his full share when the division was made. For, after so many years, it was found impossible to trace the real owners of the treasure.\n\u003c/div\u003e \n\u003cdiv\u003e\n Hang Gow’s wonderful meal made them all feel better, and even Professor Snodgrass when he got over his rapture at finding the pseudotinea condescended to partake of a little. He looked about the table at his friends—the glow of health having replaced the pallor of his face that had been so noticeable when he first came to Leftover—and then he remarked casually:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where have you been all day?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All day!” shouted Jerry, with a laugh. “Don’t you remember that we went off nearly a week ago to rescue Bill? The kidnapers took him—the same ones that bound you. Noddy Nixon——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, I do seem to remember something about it,” said the professor, in dreamy tones. “But I have been so busy with my——” His voice trailed off, his eyes were fixed on something[247] crawling up the wall, and, making a dive for it, he captured another bug.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There’s no use telling him anything,” decided Ned, and the others agreed with this.\n\u003c/div\u003e \n\u003cdiv\u003e\n A good night’s rest put them all in fine shape the next morning. Tinny was making arrangements to send the treasure to the nearest bank for safe-keeping when a shout arose out at the mine shaft.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’s that?” cried Jerry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope no accident,” murmured Tinny.\n\u003c/div\u003e \n\u003cdiv\u003e\n They were reassured a moment later when one of the men came rushing in, his face alight with joy, and, as he held out some specimens, he cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pay dirt, boss! Pay dirt! We’ve struck the richest vein I ever saw! Leftover is going to run five thousand dollars to the ton!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hurray!” cried Tinny.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hurray!” shouted the Motor Boys.\n\u003c/div\u003e \n\u003cdiv\u003e\n Professor Snodgrass looked out of the room where he kept his specimens.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you see another pseudotinea?” he asked, blinking through his spectacles.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” answered Jerry softly, and the little scientist went back to his notebooks and specimens.\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course the streak of pay dirt, or ore, uncovered in Leftover did not assay five thousand dollars to the ton, or anything like that. But the[248] mine did prove valuable, and the Motor Boys telegraphed home the good news together with word of the finding of the treasure chest of Blue Rock.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And, now that our adventures are over and Thunder Mountain seems to have settled down, I think we can give our whole attention to mining—that’s what we came out here for,” said Ned one day, about a week after they had received word that Noddy Nixon and his cronies had gone back East.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You said it!” agreed Jerry. “The folks at home were complaining that we couldn’t settle down after the war. Well, we’ll show ’em!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s what!” added Bob. “I could live here forever—that is, as long as Hang Gow cooks the way he does.” And then he had to dodge a chunk of dirt thrown at him by Ned.\n\u003c/div\u003e \n\u003cdiv\u003e\n So, having accompanied the lads through the dangers and adventures of helping Tinny to develop Leftover and having been with them on their quest of the treasure chest, we shall take leave of the Motor Boys.\n\u003c/div\u003e  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3069/84852.html","bookId":985,"creation":"Aug 2, 2019 9:09:34 AM","modification":"Aug 8, 2019 12:48:25 AM"}
