{"id":17837,"no":6,"title":"CHAPTER VI LAYING A PLOT","content":"\u0026nbsp; \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Silence fell over the Motor Boys when they heard this confession of vain regret from the old miner. They could appreciate his feelings, knowing Noddy Nixon and Jack Pender as they did.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean he really came to you with an offer to hire you to guide him to the place where the treasure chest fell over the cliff at Blue Rock?” asked Jerry at length.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He did that!” said the miner. “Offered me a good sum, too. Why, hasn’t Noddy any money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, he has money—that’s one of the bad things against him,” stated Ned. “He can do things because of his money that other fellows can’t do. He has some his grandfather left him, I think, and it’s his own to do as he pleases with. His folks can’t control him. He’s a bad egg!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He sure is!” echoed Bob. “And always was.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I’m sorry for having blurted out what I did,” repeated Bill Cromley. “But I reckoned he was open and aboveboard. Of course any[50] one has a right to search for that treasure chest that wants to—it’s abandoned, so to speak.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then we have as good a right to it as anybody else, haven’t we?” asked Bob.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You certainly have,” asserted the miner. “I guess I must have said it was a case of findings is keepings to this Noddy Nixon or he wouldn’t have asked me to pilot him and that Jack Pender to Thunder Mountain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hum! Thunder Mountain,” mused Ned. “That’s where we’re going to help Tinny Mallison prospect his mine. I don’t just fancy Noddy Nixon being even in the same county with us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Me, either,” admitted Jerry. “But what are we going to do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I know one thing I’m not going to do!” declared Bill Cromley. He slapped his hand down on his leg with the report like that from a small pistol. “I’m not going to take his offer—that’s what I’m not going to do! It wasn’t clinched. He said he’d bring me some money to bind the bargain. Until I take that I’m not bound to him. That is the law of grubstaking, and that’s what applies here. I’m through with this Noddy Nixon! Shoot himself to get out of fighting! Bah!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How about us?” asked Jerry, struck by a sudden idea.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Eh? What’s that?” came from the miner.\n\u003c/div\u003e \n\u003cdiv\u003e\n [51]\n\u003c/div\u003e \n\u003cdiv\u003e\n “I say, what about us?” resumed Jerry. “Look here, fellows, and Mr. Cromley, I have a plan!” and his voice was eager. “We are going out West to form a partnership with Mr. Mallison. His mine may pan out rich, and, again, it may be a fizzle. But if we could have a chance of looking for this chest of gold, it would give us a two-to-one shot. What do you say, Mr. Cromley, will you come with us on the same terms—or better—than those you talked of with Noddy Nixon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You mean go to Thunder Mountain with you boys?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To Thunder Mountain and Blue Rock both!” stipulated Jerry.\n\u003c/div\u003e \n\u003cdiv\u003e\n His chums looked at him in some surprise. So did the old miner. Then, suddenly, as if having made up his mind in a flash, Mr. Cromley again clapped his hand down on his thigh and cried:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll do it! I’ll go with you! I’ll accept your offer. I was getting ready to go back to the West, anyhow, and this will be just the chance I want! I’m in with you boys from now on! I like your looks, and I ain’t forgot what you did at the fire.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He shook hands all around and thus the pact was sealed. Jerry and his chums knew that their parents would be glad that an experienced man was to accompany them to the wilds of Montana.[52] Of course Professor Snodgrass was much older than the boys, but as for worldly experience, the scientist had everything but that.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’ll be a good thing for us to take Bill Cromley along,” said Jerry to his chums.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And maybe Noddy Nixon won’t go up in the air when he hears about it!” predicted Ned with a laugh. “Oh, no!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Noddy did just that. He went back to see Bill Cromley the next day with Jack Pender, taking along a sum of money with which to bribe the old miner. And when the latter, with blazing eyes as he remembered Noddy’s war record, refused to have anything to do with the bully, Noddy burst out with invectives.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’re a four-flusher! That’s what you are—a four-flusher!” he shouted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “None of that now! I know what I’m doing,” replied Bill Cromley. “I don’t want anything more to do with you! I wouldn’t go to Thunder Mountain or Blue Rock with you for a million dollars!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Somebody else has seen him, Noddy!” whispered Jack. “It’s Jerry Hopkins and his bunch, you can bet on that! Those Motor Boys have butted in on us again!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll fix them if they have!” declared Noddy. “Say, how about that?” he demanded of Bill[53] Cromley. “Have you made a contract with those other fellows who were here yesterday?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “None of your business!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, well, I’ll find out!” threatened Noddy. This was not difficult to do, as gossip travels fast and easily, and the hired men on the farm were fluent talkers. So Noddy learned that the Motor Boys were soon to start for the West, taking with them Professor Snodgrass at least as far as Chicago, and Bill Cromley all the way to Montana.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, they got ahead of us, that’s all,” said Jack. “We can’t do anything about it. But I sure would like a chance to get my fingers in that chest of gold.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So should I, and we’re going to do it, too!” declared Noddy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How?” demanded Jack Pender.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll find a way!” threatened Noddy, who was furious over having been “done out of his rights,” as he expressed it.\n\u003c/div\u003e \n\u003cdiv\u003e\n Noddy would have picked a quarrel with the Motor Boys and have gotten into a fight with them the first time he met them after having learned about Bill Cromley’s defection, only Jack Pender, with more sense than he usually showed, pulled his crony away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s no way to do!” warned Jack. “We’ve got to get at them in some other way. We’ve got to trick them!”\n\u003c/div\u003e \n\u003cdiv\u003e\n [54]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I guess you’re right,” admitted Noddy, cooling down. “But how? We can go out West, of course. I’ve got a car and plenty of money. But we need some one who knows about Thunder Mountain and Blue Rock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I know the very man for that!” declared Jack.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dolt Haven!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who’s Dolt Haven?” Noddy asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A fellow I met in a pool parlor downtown the other day. I got to talking with him, and he let out something of having been a miner in Montana once. I spoke of Thunder Mountain and Blue Rock, though I didn’t say anything about the treasure chest. I let him think it was just a box of papers, or something like that, which might be worth looking for. He said he had heard the story of the runaway stage, but he didn’t seem to know anything about the chest of gold. Why can’t we take him with us to Thunder Mountain? Maybe we can get ahead of the Motor Boys.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Maybe!” eagerly agreed Noddy. “I’ll go and have a talk with this Dolt Haven.”\n\u003c/div\u003e \n\u003cdiv\u003e\n This character was a new but notorious hanger-on in one of the worst pool rooms of Cresville. He was just the sort of man Jack Pender and Noddy Nixon would chum with, and they found[55] him to their liking, as, no doubt, he found them.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sure I can take you to Thunder Mountain!” boasted Dolt. “I’m an old Westerner. I know all about that region. I’ve heard of this Bill Cromley, though I’m not acquainted with him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’ve got to get ahead of them somehow!” said Noddy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’ll do it!” declared Dolt, and then they laid their evil heads together in a plot. “We’ll follow them in your car, Noddy,” suggested Haven. “That won’t be hard to do, as you tell me you’ve done it before. We’ll see if we can’t get this Cromley away from the Motor Boys and get from him more information about this chest. You say it’s got valuable papers in?” he asked sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, papers—and maybe a little money,” admitted Noddy, with a quick look at Jack. “We’ll give you some of the money if we find it, and we’ll pay you to go out with us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right—I’m on!” cried Dolt Haven. “We’ll trail these boys and get Bill Cromley away from them. Leave it to me to get the information out of him. I’m with you lads on this!”\n\u003c/div\u003e \n\u003cdiv\u003e\n And they shook hands on their plot.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3069/84828.html","bookId":985,"creation":"Aug 2, 2019 9:03:25 AM","modification":"Aug 2, 2019 9:03:25 AM"}
