{"id":94846,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Unless it affects me, there are some things I’m content not to know. You should do the same more often.”\u003c/p\u003e\n\u003cp\u003e“Maybe next time.”\u003c/p\u003e\n\u003cp\u003e“The direction you’re heading, there’s not going to be a next time. The Khrynsani have come for whatever reason, they’ll do what they came to do—and then they’ll leave. When they do, Mermeia’s goblin community is going to let out a collective sigh of relief.”\u003c/p\u003e\n\u003cp\u003e“Not exactly welcoming their new king and his counselor with open arms?”\u003c/p\u003e\n\u003cp\u003e“Let’s just say many of us are reserving judgement. Anyone that chooses Sarad Nukpana as his chief advisor isn’t going to win many loyal subjects in this city. As long as Sathrik and his pet shamans are in town, I’ll be spending as little time as possible in the Goblin District. Too many Mal’Salins there who are best avoided.”\u003c/p\u003e\n\u003cp\u003e“Not eager for a family reunion?”\u003c/p\u003e\n\u003cp\u003e“I loved my wife,” Tam said point-blank. “I’ve never had similar feelings for her relatives. I’ll be staying here for the rest of the week.”\u003c/p\u003e\n\u003cp\u003eTime to put my cards on the table. “Sarad Nukpana wants something that Nigel had. Nigel doesn’t have it anymore and neither does Sarad Nukpana. I need to know what that something is and what it does. And I need to know it sooner rather than later.”\u003c/p\u003e\n\u003cp\u003eTam sensed my mood shift. Playful, it wasn’t.\u003c/p\u003e\n\u003cp\u003e“I don’t know what they were looking for,” he told me. “But if Sarad Nukpana wants it, it would be best if you weren’t in his way when he finds it.”\u003c/p\u003e\n\u003cp\u003eI put my cup and saucer on the side table. “The only people who know I’m asking questions are people I trust not to betray me.” I paused meaningfully. “Or lie to me.” I threw that in for good measure. I was sure Tam had a perfectly good reason for not being totally honest. Quentin hadn’t been totally honest with me either, and look what kind of trouble that had caused. I was tired of getting the runaround, and was feeling a little spiteful. What I was wearing around my neck earned me the right to instill some guilt. If I was lucky, it might bear useful fruit.\u003c/p\u003e\n\u003cp\u003eTam’s dark eyes widened beguilingly. “You trust me?”\u003c/p\u003e\n\u003cp\u003eFor a brief instant, he looked sincere. I was touched. Almost.\u003c/p\u003e\n\u003cp\u003eI couldn’t help but smile. “With my life, yes. But not with the rest of me.”\u003c/p\u003e\n\u003cp\u003eHis answering grin exceeded my own. He looked almost boyish. “Do you have somewhere safe to stay?” He indicated the pack at my feet. “It looks like you’re running away from home.”\u003c/p\u003e\n\u003cp\u003eI made a face. “You’re closer to the truth than you think. I had accommodations, really good ones, but they fell through. And I won’t be responsible for putting Khrynsani on Tarsilia’s doorstep again.”\u003c/p\u003e\n\u003cp\u003e“Then I insist that you stay here.”\u003c/p\u003e\n\u003cp\u003e“I thought you were staying here.”\u003c/p\u003e\n\u003cp\u003eHis dark eyes shone. “I am.”\u003c/p\u003e\n\u003cp\u003e“You don’t give up, do you?”\u003c/p\u003e\n\u003cp\u003eThe smile vanished. “I’m almost as persistent as Sarad Nukpana.”\u003c/p\u003e\n\u003cp\u003eI stood and picked up my pack. “I know. That’s why I won’t stay here. I need sleep, not a wrestling match.”\u003c/p\u003e\n\u003cp\u003eTam raised his right hand. “I promise to be the perfect gentleman.”\u003c/p\u003e\n\u003cp\u003e“Gentlemen—perfect or otherwise—don’t make promises they have no intention of keeping.”\u003c/p\u003e\n\u003cp\u003eTam stood smoothly, his expression solemn. “I never do.” Then solemn turned to something else as he reached out and tucked a wayward strand of hair behind my ear. “Would you like a bath as well?”\u003c/p\u003e\n\u003cp\u003eGetting naked in Tam’s immediate vicinity didn’t seem like the best—or at least not the most direct—way to get to sleep, but I couldn’t deny that I needed and desperately wanted a bath.\u003c/p\u003e\n\u003cp\u003e“Is that a polite way of telling me that I need a bath?”\u003c/p\u003e\n\u003cp\u003eTam stepped closer, his fingers trailing from my ear to lightly brush my throat. “I smell goblin blood on you.” His voice had turned husky.\u003c/p\u003e\n\u003cp\u003eI didn’t move. “He was asking for it.”\u003c/p\u003e\n\u003cp\u003e“No doubt, especially if the blood is Khrynsani.”\u003c/p\u003e\n\u003cp\u003eI saw no reason to deny it. “The blood is.” I paused. “Its owner was.”\u003c/p\u003e\n\u003cp\u003eTam looked at me then laughed quietly. “So I assumed. I’ll have the tub filled.”\u003c/p\u003e\n\u003cp\u003eTam’s tub was a wonderful place to think.\u003c/p\u003e\n\u003cp\u003eEven if Tam wasn’t a gentleman, at least he was trying. Tam was a businessman, and he considered me an investment. Tam never made an investment unless he knew it would pay him full dividends later. I reached for the soap. That was fine with me, later wasn’t now. For now, Tam had left me alone in his plush little apartment to make myself at home.\u003c/p\u003e\n\u003cp\u003eThere was more to Tam’s private domain than a bedroom behind his office. There was a sitting room with a plush couch and more overstuffed chairs; there were rugs you could sink in up to your ankles, one of which was strategically placed in front of a carved marble fireplace, along with the tub. I had looked at the carvings before getting into the tub. Same people, same activity. Apparently wooden doors weren’t the only medium Tam’s naughty artist friend worked in.\u003c/p\u003e\n\u003cp\u003eSoaking in the hot, scented water made me realize just how tired I was. But it also helped me think a little more clearly about my encounter with Sarad Nukpana.\u003c/p\u003e\n\u003cp\u003eIt stood to reason that since Nukpana had hired Quentin, he might have heard of me. Quentin worked for me. A natural, logical chain of progression. No scary conspiracy there. What it didn’t explain was why the goblin grand shaman had seemed downright tickled to see me. Maybe he was just the friendly type. Yeah, right. Just your friendly neighborhood psycho.\u003c/p\u003e\n\u003cp\u003eI leaned back in the tub to wet my hair. I didn’t think Tam knew about the amulet and why Nukpana wanted it. But based on Tam’s reaction to the mere possibility of my path crossing Nukpana’s, if I told him, I’d be locked in his bachelor hide-away until the Khrynsani left town. I looked around. It was really very nice. The throw on the bed looked suspiciously like Rheskilian sable. I grinned. Only one way to find out for sure, but I’d have to dry off first. Not a bad way to spend a couple of days, but it wouldn’t do a thing to explain what I was wearing around my neck, what it did, what it was doing to me, and why I couldn’t take it off. And most importantly, how the hell Sarad Nukpana knew me.\u003c/p\u003e\n\u003cp\u003eI sank lower into the tub. Drowning would solve all my problems.\u003c/p\u003e\n\u003cp\u003e“Turned into a mermaid yet?”\u003c/p\u003e\n\u003cp\u003eI jumped, water sloshed. Tam was closer than he should have been. No big surprise there. Though at least he was dressed. I relaxed a little, but was still careful to keep the amulet, as well as some other things Tam would find intriguing, well below the waterline. Just because Tam was dressed didn’t mean he couldn’t take off what he had just put on, and from his expression, he looked like he was giving that some serious thought.\u003c/p\u003e\n\u003cp\u003eHe was dressed for going out, and armed for staying there awhile. A goblin with a mission. I had a feeling that mission involved me. What a sweetheart, though I knew better than to tell him that to his face.\u003c/p\u003e\n\u003cp\u003e“Going to see anyone I know?” Or had just met.\u003c/p\u003e\n\u003cp\u003eTam’s expression gave nothing away. “I doubt it.”\u003c/p\u003e\n\u003cp\u003eI didn’t.\u003c/p\u003e\n\u003cp\u003e“Does it have anything to do with me?”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eWonderful. Tam is going to get himself killed and it’s going to be my fault.\u003c/p\u003e\n\u003cp\u003e“When was the last time you ate?” he asked, nimbly changing the subject.\u003c/p\u003e\n\u003cp\u003e“Let’s see…dinner last night at the Crown \u0026amp; Anchor. Didn’t happen. Ale and dried bread at Garadin’s in the middle of the night. Unfortunately that did happen. Then there were sugar knots from Maira’s this morning. Delicious.”\u003c/p\u003e\n\u003cp\u003eTam just shook his head. “I figured as much.”\u003c/p\u003e\n\u003cp\u003eThere was a discreet knock at the door. It was Kell with a tray of something that smelled like heaven. The big goblin was trying to avert his eyes from the sight of me in the tub, but he wasn’t having much luck. I slipped deeper into the water to help him out.\u003c/p\u003e\n\u003cp\u003eHe left the tray and the room, both quickly. I giggled.\u003c/p\u003e\n\u003cp\u003eTam smiled and met my eyes. “What is it?”\u003c/p\u003e\n\u003cp\u003e“I wouldn’t have pegged Kell the easily embarrassed type.”\u003c/p\u003e\n\u003cp\u003e“It’s not every day he finds a beautiful woman in my tub.”\u003c/p\u003e\n\u003cp\u003e“It’s not?”\u003c/p\u003e\n\u003cp\u003eTam’s eyes were unreadable. “No, it’s not.”\u003c/p\u003e\n\u003cp\u003eHe turned away and removed the plates from the tray and set them up on the table and opened a bottle of wine I was sure cost more than I made in two weeks. It looked like a feast. If Tam hadn’t been standing there, I’d have been out of the tub and at the table, naked or not.\u003c/p\u003e\n\u003cp\u003eTam tossed the robe he’d been wearing earlier across the chair next to the tub. “If you do not wish to get dressed immediately, you may wear this while you eat.”\u003c/p\u003e\n\u003cp\u003e“You’re leaving now?”\u003c/p\u003e\n\u003cp\u003e“I’ve already dined, and I have business to attend to.”\u003c/p\u003e\n\u003cp\u003eOh yeah. Killing or getting himself killed on account of me.\u003c/p\u003e\n\u003cp\u003e“If you need anything, Kell will get it for you,” Tam added.\u003c/p\u003e\n\u003cp\u003eHe bent and placed an almost chaste kiss on top of my head. Though the bending gave him ample view of everything under the water. “Sleep well. I’ll be back by eight bells tonight.”\u003c/p\u003e\n\u003cp\u003eAnd he left. Very sudden, very un-Tam like. I didn’t trust it.\u003c/p\u003e\n\u003cp\u003eI got out of the tub, dried off, and slipped into Tam’s silk robe. It was still warm and smelled like Tam. Nice. I sat down at the table and devoured everything Kell had brought. By the time I’d finished, I could barely keep my eyes open. I put my clothes—and my blades—next to the bed where I could reach them, then slipped out of the robe and into bed.\u003c/p\u003e\n\u003cp\u003eOh, and the throw on the bed? Definitely Rheskilian sable.\u003c/p\u003e\n\u003cp\u003eChapter 9\u003c/p\u003e\n\u003cp\u003eWhen I woke up, I knew it was far later than I wanted it to be, though the extra sleep was much needed and worth it. A glance out the window confirmed the late hour.\u003c/p\u003e\n\u003cp\u003eI planned to be gone before Tam returned. I had errands of my own to run. While I couldn’t march myself to the goblin embassy and demand that Sarad Nukpana explain himself, I could do something almost as productive and a lot less dangerous. I could ask Ocnus Rancil, and I wouldn’t ask nicely. \u003c/p\u003e","sourceLink":"https://allnovel.net/magic-lost-trouble-found-raine-benares-1/page-23.html","bookId":1620,"creation":"Oct 5, 2019 6:11:17 PM","modification":"Oct 5, 2019 6:11:17 PM"}
