{"id":94856,"no":34,"title":"Page 34","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I don’t think Sarad Nukpana intended the Magh’Sceadu for you or Piaras,” Garadin said, not completely misreading my thoughts. “Considering what they were made to do, sending them after you would have been heavy-handed, not to mention wasteful in Nukpana’s opinion. You have the beacon, he wants the Saghred, so he wants you alive.”\u003c/p\u003e\n\u003cp\u003eGaradin didn’t need to tell me that. I had figured out that sickening fact all by myself.\u003c/p\u003e\n\u003cp\u003e“Nukpana probably turned them loose in The Ruins to feed on the magical creatures there,” Garadin continued. “Less chance of attracting the city watch that way.”\u003c/p\u003e\n\u003cp\u003eMade sense to me. “The shamans lost control of them and paid the price. If I hadn’t been able to do whatever it was I did, we probably would have ended up the same way.”\u003c/p\u003e\n\u003cp\u003e“Possibly.”\u003c/p\u003e\n\u003cp\u003eI fought down a wave of nausea. No, probably.\u003c/p\u003e\n\u003cp\u003e“I’d say that you and Piaras together attracted their attention. You certainly got mine. One whiff of your magic and they probably snapped their leashes, so to speak, to get at you. Once they were on your trail, all the shamans could do was chase them down and try to regain control.”\u003c/p\u003e\n\u003cp\u003e“So the shamans were eaten?” Phaelan asked.\u003c/p\u003e\n\u003cp\u003eI didn’t like the sound of that last word at all. But from the horror that I had witnessed, that was the most apt description.\u003c/p\u003e\n\u003cp\u003e“Absorbed would be more accurate,” Garadin said. “Once a Magh’Sceadu has had its fill, a Khrynsani shaman uses what was taken to power their own sorceries. Then they turn it loose to fill its belly, or whatever, again. As to what a shaman does with that power boost, it’s generally big, nasty, and something even a group of the most talented shamans couldn’t, or wouldn’t want to, do alone.”\u003c/p\u003e\n\u003cp\u003eThat sounded too close to the Saghred’s idea of fun for my taste. I suddenly wanted more whiskey in my whiskey coffee.\u003c/p\u003e\n\u003cp\u003e“That ‘big and nasty’ wouldn’t extend to opening Gates by any chance?” I asked.\u003c/p\u003e\n\u003cp\u003eGaradin nodded. “That and a whole bevy of other nice, wholesome activities. I haven’t exactly gone out of my way to get direct knowledge. Like Gate creation, the rituals said to be used to make a Magh’Sceadu are repugnant to say the least. Blood, torture, and living sacrifices—it’s unclear whether any of these are actually required, but it gives the Khrynsani an excuse.”\u003c/p\u003e\n\u003cp\u003eA kidnapping could leave a trail. Absorbing didn’t leave anything. It went a long way toward explaining the sorcerers who had vanished recently without a trace. Magh’Sceadu didn’t leave leftovers.\u003c/p\u003e\n\u003cp\u003eI had a lot to think about, and I had a feeling no one I had run into this evening was going to wait patiently while I sorted everything out. I looked up. Garadin was watching me intently.\u003c/p\u003e\n\u003cp\u003e“What are you going to do about…?” He nodded in Piaras’s direction, not wanting to say his name out loud for fear of waking him.\u003c/p\u003e\n\u003cp\u003ePiaras was curled under the blanket, his breathing deep and even. I knew exactly what Garadin meant. Too many people knew what he was capable of. Too many of the wrong kind of people. I wasn’t the only reason those Magh’Sceadu came after us. I may not have even been the main reason. After putting the goblin guards to sleep, and then confronting Nukpana’s pet monsters, Piaras had glowed with power, and it hadn’t diminished until we had left The Ruins. He had left a trail for just about anything that wanted to follow us.\u003c/p\u003e\n\u003cp\u003e“He did good work tonight,” I said quietly.\u003c/p\u003e\n\u003cp\u003e“I know,” Garadin said. “I heard him.”\u003c/p\u003e\n\u003cp\u003e“So did a lot of other people.”\u003c/p\u003e\n\u003cp\u003e“You weren’t exactly discreet yourself.”\u003c/p\u003e\n\u003cp\u003e“But I’ve dealt with crazies before,” I said. “Some almost as bad as Sarad Nukpana. It’s what I do for a living. It’s my choice. Piaras didn’t have a choice.” I lowered my voice further. “Piaras used a repelling spell against the Magh’Sceadu. In goblin. You taught him that, right?”\u003c/p\u003e\n\u003cp\u003eGaradin’s gaze met mine unflinchingly. “I thought it was something he might need to know. How did he do?”\u003c/p\u003e\n\u003cp\u003e“Very proficient. Almost too much so.”\u003c/p\u003e\n\u003cp\u003e“Those spells are complex. Especially in goblin. The boy kept his head.” Garadin nodded his own in approval. “Good.”\u003c/p\u003e\n\u003cp\u003eI agreed it was good that Piaras kept his head. But I wasn’t happy that he had been put in a situation where he risked losing it in the first place.\u003c/p\u003e\n\u003cp\u003e“I’d just rather he not have to make a habit of defending himself against creatures like that. Normally I could arrange for him to stay in one of Markus’s safehouses, but they’re all full. Besides, I’d rather he be with people he knows. Any suggestions?” I asked Garadin.\u003c/p\u003e\n\u003cp\u003e“Home would be the best place for him.”\u003c/p\u003e\n\u003cp\u003e“But is it safe?”\u003c/p\u003e\n\u003cp\u003e“Tarsilia has some of the strongest house wards in the District,” Garadin said. “And I’ll move in until all this is settled.”\u003c/p\u003e\n\u003cp\u003e“Hopefully that’ll be soon, and with a win for our side.” I finished off my coffee. “Now, if everyone will excuse me, I need to take a nap and make a date with a Guardian.” I indicated the cabin’s other bunk, presently buried under maps and papers. “Can I borrow that for a few hours?” I asked Phaelan.\u003c/p\u003e\n\u003cp\u003eIn response, Phaelan stood and started cleaning it off. Except his idea of cleaning involved mostly transferring the pile from the bed to the top of a nearby trunk.\u003c/p\u003e\n\u003cp\u003eI pulled back the blanket and sat down on the edge of the bunk. “Wake me if we’re about to be slaughtered.” I meant it as a joke, but it didn’t quite come out that way.\u003c/p\u003e\n\u003cp\u003ePhaelan probably meant to smile. It didn’t quite make it either. “Other than Eiliesor, don’t worry about any interruptions. We’ll make sure it stays quiet for you.”\u003c/p\u003e\n\u003cp\u003eFrom his serious tone, I had no doubts. But as I lay down and pulled the blanket over myself, my last thought before drifting off hoped those wouldn’t turn out to be famous last words.\u003c/p\u003e\n\u003cp\u003eChapter 14\u003c/p\u003e\n\u003cp\u003eSleep didn’t take long finding me, and I didn’t take long finding Mychael Eiliesor. I had no idea how I found him, but if the beacon could talk, I was sure it could tell me.\u003c/p\u003e\n\u003cp\u003eI found myself in an unfamiliar and lavishly decorated bedroom. Only the best and most expensive furnishings and linens, and my eye for such things was very accurate. I’d come to realize that if I liked it, it was expensive. Another Benares family trait. I heard movement from the canopied bed. The embroidered bed curtains were pulled back, and the occupant shifted in sleep. I stopped breathing.\u003c/p\u003e\n\u003cp\u003eMychael Eiliesor lay on his side with a pale sheet draped loosely over his waist. One arm was curled under the pillow, and the other stretched across the bed. His coppery hair gleamed in the light of a single bedside lamp and one loose curl brushed his temple. My eyes were drawn lower, down the leanly muscled torso and beyond. If he was wearing anything, it wasn’t obvious to me. He moved and the sheet slipped farther. Nope, he definitely wasn’t wearing anything. I felt my face flush, which shouldn’t have been possible considering that I wasn’t really there. I looked away. Then I looked back. I couldn’t help myself.\u003c/p\u003e\n\u003cp\u003eHis glorious sea blue eyes were open and watching me. I didn’t like water, but I could drown in those eyes and die happy. I froze in shock. He could see me. I looked down at myself. I could see me. But I was asleep onboard the Fortune. I couldn’t be in both places at once. Or could I? But how?\u003c/p\u003e\n\u003cp\u003eEiliesor was now propped up on one elbow. He was still watching me, but now there was the beginning of a smile tugging at the corners of his mouth. Heart-stopping.\u003c/p\u003e\n\u003cp\u003e“This is unexpected,” he said.\u003c/p\u003e\n\u003cp\u003eHe was telling me.\u003c/p\u003e\n\u003cp\u003e“We need to talk,” I heard myself say. It didn’t sound quite like me, but then I wasn’t quite here, or there. I had a fluttering moment of panic and disorientation. Actually, I didn’t know where I was.\u003c/p\u003e\n\u003cp\u003eHis smile had turned into a grin. “We are talking.” Then his eyes widened slightly. “You’ve never done a sending before, have you?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “The past two days have been full of firsts.” I swallowed, and looked back down at my hands. “I’m not supposed to be this solid, am I?”\u003c/p\u003e\n\u003cp\u003e“I know of only two mages on Mid who can manifest that well, and you’re doing it through three layers of my best shields.”\u003c/p\u003e\n\u003cp\u003eThat did it. I had just gone from being merely creepy to truly scaring myself. I wondered if I could faint. I think it must have showed, because the Guardian started to get up.\u003c/p\u003e\n\u003cp\u003eI waved my hands. “No, no. Stay.” Seeing him get out of bed, now or anytime, would not soothe my rattled nerves. Quite the opposite.\u003c/p\u003e\n\u003cp\u003eHe stayed. But he moved so that he was sitting on the edge of the bed, the sheet gathered around his waist. He motioned me to a chair. I looked at it and wasn’t exactly sure if it would work; that is, whether I could actually sit down when I wasn’t really there. I gingerly sat down—and didn’t fall through. A pleasant surprise, disturbing, but pleasant. Much like the unobstructed view of the elf’s smoothly sculpted chest.\u003c/p\u003e\n\u003cp\u003eHaving never done this before, I wasn’t sure how long I would be able to stay, so I thought I’d better get to the point.\u003c/p\u003e\n\u003cp\u003e“I have questions; you have answers.”\u003c/p\u003e\n\u003cp\u003e“I have some questions myself,” he said.\u003c/p\u003e\n\u003cp\u003eI’ll bet he did. “I’ll make you a deal,” I told him. “You answer mine, and I’ll answer yours.”\u003c/p\u003e\n\u003cp\u003e“I’ll tell you what I can.”\u003c/p\u003e\n\u003cp\u003eI nodded. It was as much as I would be doing myself. There were some things about myself I’d rather a Conclave Guardian didn’t know.\u003c/p\u003e\n\u003cp\u003e“I’ll start,” he said. “Sarad Nukpana hired your partner to steal the beacon. He called you by name. You can use the beacon. This isn’t a coincidence.”\u003c/p\u003e\n\u003cp\u003e“You get right to the point, don’t you?”\u003c/p\u003e\n\u003cp\u003e“I don’t have time for anything else. Neither do you.”\u003c/p\u003e\n\u003cp\u003eLooking at our mutual situation from his point of view, I guess my involvement did look rather shady. To a point he was right. I couldn’t exactly walk the moral high road here. But knowing a thief didn’t make me one; and a psycho knowing my name didn’t make me one of those either, so I felt entitled to get on my high horse, however briefly. \u003c/p\u003e","sourceLink":"https://allnovel.net/magic-lost-trouble-found-raine-benares-1/page-34.html","bookId":1620,"creation":"Oct 5, 2019 6:11:17 PM","modification":"Oct 5, 2019 6:11:17 PM"}
