{"id":94860,"no":38,"title":"Page 38","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“So are secrets.”\u003c/p\u003e\n\u003cp\u003eMychael leaned forward. “We really shouldn’t discuss this any further in the open.”\u003c/p\u003e\n\u003cp\u003eI didn’t like it, but I had to agree with him. I waved Phaelan over.\u003c/p\u003e\n\u003cp\u003e“Would you join us in Tam’s office? Paladin Eiliesor feels the need for a little privacy.”\u003c/p\u003e\n\u003cp\u003eTam was sitting behind his desk. I think he felt the need to have a solid piece of furniture between us right now. He knew what I’d done to Eiliesor. Phaelan let the two crew members who had come with us into Sirens know we wouldn’t be coming out for a while. They stationed themselves near Tam’s office door. I was sure they’d have plenty of Guardian company.\u003c/p\u003e\n\u003cp\u003eTam had offered the hospitality of his personal bar, and Phaelan was taking him up on it. “Can I get you something?” he asked me.\u003c/p\u003e\n\u003cp\u003e“Sure.” A drink sounded like a wonderful idea. I was perched on the edge of one of Tam’s plush, overstuffed chairs and was feeling a little tense. Wonder why. I didn’t really think Tam had ordered me kidnapped last night, or that Mychael Eiliesor was going to do the same tonight, but caution had never been a bad thing for me.\u003c/p\u003e\n\u003cp\u003eI took the glass and a sip. The tang of Caesolian port burned with a cool fire. I had to hand it to Phaelan. When invited to help himself to a connoisseur’s private stock, he knew enough to go straight for the good stuff.\u003c/p\u003e\n\u003cp\u003eMy cousin and his drink made themselves at home in another chair.\u003c/p\u003e\n\u003cp\u003e“Kell told me you went out for dessert,” Tam said quietly, his hands folded on his desk. “Would you care to elaborate?”\u003c/p\u003e\n\u003cp\u003eI looked at Mychael Eiliesor, my question unspoken, but obvious.\u003c/p\u003e\n\u003cp\u003e“Tam knows why I’m here,” Eiliesor told me.\u003c/p\u003e\n\u003cp\u003eI blinked. “He does?”\u003c/p\u003e\n\u003cp\u003eTam was wearing a similar stunned expression. It was a look I’d never seen on him before, and unfortunately, I wasn’t in the mood to enjoy it. Apparently my involvement was news to him, too.\u003c/p\u003e\n\u003cp\u003e“Raine and I will be working together on this,” Eiliesor told Tam. He glanced at me, his eyes unreadable. “At least I hope that’s still the case.”\u003c/p\u003e\n\u003cp\u003eThe beacon picked that moment to wake up and say hello. Tam’s eyes widened even farther. There was nothing like having a secret that wasn’t so secret anymore. Actually, it was a relief. And since everyone in the room knew my hand, I might as well put my cards on the table. I pulled the amulet out of my shirt.\u003c/p\u003e\n\u003cp\u003eTam’s dark eyes were instantly riveted to my chest. It was familiar territory for them. “No,” was all he could manage.\u003c/p\u003e\n\u003cp\u003eI smiled. There was no humor in it. “Ta-da.”\u003c/p\u003e\n\u003cp\u003e“That’s impossible.” Tam found more words.\u003c/p\u003e\n\u003cp\u003e“It should be, but it’s not,” Eiliesor said.\u003c/p\u003e\n\u003cp\u003e“You knew?” Tam asked Phaelan, who amazingly enough was sitting quietly through all this.\u003c/p\u003e\n\u003cp\u003eMy cousin grinned. “It’d be difficult not to. I was there when she got it.”\u003c/p\u003e\n\u003cp\u003eI stared hard at Tam. “I might ask you the same.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“How you knew.”\u003c/p\u003e\n\u003cp\u003e“That depends on what you mean by ‘knew’?” Tam’s response to a question was very often another question. It wasn’t one of his more endearing qualities.\u003c/p\u003e\n\u003cp\u003e“Tam,” I warned.\u003c/p\u003e\n\u003cp\u003eHe glanced at Eiliesor.\u003c/p\u003e\n\u003cp\u003e“Tell her,” the Guardian said.\u003c/p\u003e\n\u003cp\u003eI set my drink aside. “Tam, I’ll make you a deal. You tell me all about yours, and I’ll tell you all about mine.”\u003c/p\u003e\n\u003cp\u003eThe goblin’s lips curved into a slow, wicked grin. “And in front of everyone.”\u003c/p\u003e\n\u003cp\u003eMy lips narrowed into a thin, angry line. “Just spill it.”\u003c/p\u003e\n\u003cp\u003eTam sat back in his desk chair. “About two weeks ago, my former teacher arrived in town. She asked to meet me for dinner. Since we hadn’t seen each other in a few months, I didn’t think much of it. During dinner, she asked a favor. She needed a safehouse, something isolated and easily defensible. My family owns property that I thought would fill her needs. The other morning she was here asking to extend their stay.”\u003c/p\u003e\n\u003cp\u003e“You really need to hire a cleaning service, Tam,” I said. “Other than that, nice house, very impressive.”\u003c/p\u003e\n\u003cp\u003eThe goblin raised one dark brow. “I beg your pardon?”\u003c/p\u003e\n\u003cp\u003e“Piaras and I were guests at your out-of-the-way cottage last night.”\u003c/p\u003e\n\u003cp\u003eHis expression darkened. “I suspected who would be staying there, so I thought it prudent to ask her a few questions. Apparently, I should have asked more. What she did tell me, I really didn’t like, but it wasn’t enough to refuse her request. I probably should have. Was she there last night?”\u003c/p\u003e\n\u003cp\u003e“Not that I know of,” I said. “But her wards were. She left her prince in a cozy, well-protected nest.”\u003c/p\u003e\n\u003cp\u003eTam frowned.\u003c/p\u003e\n\u003cp\u003e“Did she mention what they were doing in town?” I asked.\u003c/p\u003e\n\u003cp\u003e“She was predictably elusive on that point. Knowing about Sathrik’s visit told me that the less I knew about Chigaru’s visit, the better.”\u003c/p\u003e\n\u003cp\u003e“Did she ask anything of you other than your house?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“So she didn’t mention the beacon or the Saghred.”\u003c/p\u003e\n\u003cp\u003e“Not a breath. I found that out from Mychael.”\u003c/p\u003e\n\u003cp\u003e“Thanks in part to you,” Eiliesor told me, “things have moved faster than we anticipated. We’ve had to catch up. Fortunately, the Khrynsani are still a few steps behind.”\u003c/p\u003e\n\u003cp\u003e“I’m sure my former teacher thought I’d refuse to help if I knew the entire plan,” Tam continued. “She would have been right. She’s honorable and would never knowingly harm anyone, but she has the misfortune of thinking that Chigaru Mal’Salin shares her morals. I’ve met the prince, and while he’s a far superior alternative to his brother, he’s still a Mal’Salin. My teacher has been known to turn a blind eye in some instances.”\u003c/p\u003e\n\u003cp\u003e“He told me he only wants to keep the Saghred from his brother,” I said.\u003c/p\u003e\n\u003cp\u003e“You spoke with him?”\u003c/p\u003e\n\u003cp\u003e“It wasn’t my idea.”\u003c/p\u003e\n\u003cp\u003eI gave him the shortened version of last night’s events.\u003c/p\u003e\n\u003cp\u003eTam was incredulous. “And you came walking in here by yourself?”\u003c/p\u003e\n\u003cp\u003ePhaelan cleared his throat indignantly. “Me and eight of my best men hardly constitute ‘by yourself’.”\u003c/p\u003e\n\u003cp\u003e“Could you or your eight best defend Raine from a Khrynsani attack?” Tam snapped.\u003c/p\u003e\n\u003cp\u003e“Could you get a spell past your front teeth when there’s a fist coming at it?” Phaelan shot back.\u003c/p\u003e\n\u003cp\u003e“My escort was more than adequate,” I told them both. “And Paladin Eiliesor has arranged for a pair of his Guardians to become my new shadows. The two waiting outside, right?” I asked Eiliesor.\u003c/p\u003e\n\u003cp\u003e“That was the plan.”\u003c/p\u003e\n\u003cp\u003eI spread my hands. “See, plenty of protection.”\u003c/p\u003e\n\u003cp\u003e“Why her?” Tam asked Eiliesor.\u003c/p\u003e\n\u003cp\u003e“I have a theory,” was all he said.\u003c/p\u003e\n\u003cp\u003eSince that theory involved a nine-hundred-year-old Guardian being my father, it was a theory I didn’t want to think about, so I changed the subject.\u003c/p\u003e\n\u003cp\u003e“What about your spellsinger?” I asked Tam.\u003c/p\u003e\n\u003cp\u003e“What about him?”\u003c/p\u003e\n\u003cp\u003e“Who, what, when, and why did he take up kidnapping as a second career? He paid Ocnus Rancil to set me up. Since when is Ocnus working for him?”\u003c/p\u003e\n\u003cp\u003e“Ocnus works for the Mal’Salins,” Tam reminded me patiently.\u003c/p\u003e\n\u003cp\u003e“Yes, I know that; but what is Ocnus doing working…” I paused, thought and concluded in the span of two seconds.\u003c/p\u003e\n\u003cp\u003e“Your spellsinger is a Mal’Salin?” My voice felt the need to rise a couple of octaves; I felt the need to let it.\u003c/p\u003e\n\u003cp\u003e“Rahimat is my late wife’s nephew.”\u003c/p\u003e\n\u003cp\u003eI couldn’t believe what I was hearing. Then again, I could.\u003c/p\u003e\n\u003cp\u003e“Uncle Tam?”\u003c/p\u003e\n\u003cp\u003e“Well, yes.”\u003c/p\u003e\n\u003cp\u003e“And you didn’t tell me.”\u003c/p\u003e\n\u003cp\u003e“I didn’t see where it would improve the situation any; so, no I didn’t.”\u003c/p\u003e\n\u003cp\u003e“You mean improve your situation.”\u003c/p\u003e\n\u003cp\u003e“Same thing.”\u003c/p\u003e\n\u003cp\u003e“Hardly.”\u003c/p\u003e\n\u003cp\u003e“I had no idea Rahimat was working for Chigaru Mal’Salin, if that’s what you’re getting at,” Tam said. “Though I’m sure his being in Mermeia isn’t a coincidence. Planting him to spy on me isn’t like Primari Nuru, so I’d imagine it was the prince’s doing. She trusts me; the prince does not. Rahimat was on summer break from the Conclave college. He’s a spellsinger, and he told me he wanted to earn some extra money, so I put him to work.”\u003c/p\u003e\n\u003cp\u003eI had to bite my tongue. Uncle Tam wasn’t Rahimat’s only source of summer fun money. Most kids get a normal summer job. Mal’Salin teenagers kidnap and dabble in world domination. I guess they had to get on-the-job training somewhere.\u003c/p\u003e\n\u003cp\u003e“I wonder if he’ll show up for work tonight,” was what I said.\u003c/p\u003e\n\u003cp\u003e“From what you’ve told me, it’s unlikely,” Tam said. His eyes darkened even further. “But if he does, I can guarantee he’ll wish he hadn’t.”\u003c/p\u003e\n\u003cp\u003eEiliesor sat on the edge of Tam’s desk. “I’d like to know more about the note you received from Ocnus Rancil.”\u003c/p\u003e\n\u003cp\u003e“Sure. Which part?”\u003c/p\u003e\n\u003cp\u003eTam snorted. “The part that compelled you to abandon all common sense to go meet with him.”\u003c/p\u003e\n\u003cp\u003eI squared my shoulders. “That would be the same part where he claimed to know the location of the Saghred.”\u003c/p\u003e\n\u003cp\u003e“What?” Eiliesor was suddenly like a hound on a scent.\u003c/p\u003e\n\u003cp\u003e“Except he didn’t directly refer to the Saghred,” I added. “He called it an ‘artifact.’ Knowing what I know now, I think it’s the same thing, right?”\u003c/p\u003e\n\u003cp\u003e“It is. Do you remember his exact words?”\u003c/p\u003e\n\u003cp\u003e“Don’t have to. I still have the note.” I handed it to him.\u003c/p\u003e\n\u003cp\u003eThe Guardian read it. “It sounds like Master Rancil may have stumbled into some very valuable and dangerous information.”\u003c/p\u003e\n\u003cp\u003eTam grinned. “From what I heard last night in the Goblin District, Ocnus didn’t just stumble; he fell face first. He ran out of the District this morning and hasn’t been seen since. Word has it Nukpana is looking for Ocnus. Hard.” \u003c/p\u003e","sourceLink":"https://allnovel.net/magic-lost-trouble-found-raine-benares-1/page-38.html","bookId":1620,"creation":"Oct 5, 2019 6:11:17 PM","modification":"Oct 5, 2019 6:11:17 PM"}
