{"id":94861,"no":39,"title":"Page 39","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“If Rancil knows the Saghred’s location, why wouldn’t he just sell the information to Sarad Nukpana?” Eiliesor asked.\u003c/p\u003e\n\u003cp\u003e“Knowing Ocnus, he probably made the offer,” Tam said. “But if he’s up to his usual tricks, Nukpana wasn’t the only potential buyer. And with the Mal’Salin family split into two camps, working for the family has become even more complicated than it used to be.”\u003c/p\u003e\n\u003cp\u003ePhaelan tossed back the last of his drink. “Sounds like he’s holding out for the highest bidder.”\u003c/p\u003e\n\u003cp\u003e“Ocnus is known for playing both sides of the fence, so that wouldn’t surprise me,” I said.\u003c/p\u003e\n\u003cp\u003eTam chuckled. “Sarad Nukpana doesn’t like to be played.”\u003c/p\u003e\n\u003cp\u003e“Anything from the rumor mill on where Ocnus has gone to ground?” I asked. If Tam didn’t know, I had a real good idea.\u003c/p\u003e\n\u003cp\u003e“Not a peep.”\u003c/p\u003e\n\u003cp\u003e“Considering who’s after him, Ocnus has every reason to claw his way under the nearest rock,” Phaelan noted.\u003c/p\u003e\n\u003cp\u003eI smiled. It was a slow smile, and it was borderline malicious.\u003c/p\u003e\n\u003cp\u003e“I think I know just which one to turn over.”\u003c/p\u003e\n\u003cp\u003eChapter 16\u003c/p\u003e\n\u003cp\u003eNo doubt Ocnus had always wanted to be popular. Now I wanted to talk to him. So did Sarad Nukpana. But somehow, I didn’t think that was the kind of popularity Ocnus had in mind.\u003c/p\u003e\n\u003cp\u003eTracking the goblin snitch was simple enough. From time to time, Ocnus found it prudent not to be among his own people. Nothing like having a deal go sour to compel you to make yourself scarce. When the Goblin District was the last place he wanted to be, Ocnus had three favorite places to drown his sorrows: the Blind Bandit, the Sly Fox, and the Sleeping Giant. The Blind Bandit had burnt to the ground last month, the owner of the Sly Fox wanted to get his hands on Ocnus almost as much as Sarad Nukpana did, so that left the Sleeping Giant. Sure enough, Ocnus was in residence at the bar with his two hobgoblin bodyguards in tow.\u003c/p\u003e\n\u003cp\u003eBodyguard work came easily to hobgoblins. When you’re huge, furry, fanged, and yellow-eyed, you don’t need much else as a deterrent. Ocnus’s muscle-bound bookends were good at one thing—being big. To their credit, they did it very well. But speed, either of thought or action, wasn’t a burden either one carried.\u003c/p\u003e\n\u003cp\u003eThe Sleeping Giant was a dockside dive located on Cutthroat Alley. I know what it sounds like, but the locals liked the name. In fact, they thought they were being downright civic-minded by calling it what it really was. It told the nonlocal what was likely to happen to them if they dawdled there. If a nonlocal chose to ignore the warning that was their business, or life.\u003c/p\u003e\n\u003cp\u003ePhaelan was waiting for Ocnus with two of his crew and a pair of Guardians in an alley off the aforementioned alley that ran beside the tavern. Tam was back at Sirens. He had a business to take care of. I told him I would take care of Ocnus.\u003c/p\u003e\n\u003cp\u003eMychael Eiliesor was taking care of me.\u003c/p\u003e\n\u003cp\u003eThere was no way the Guardian was going to let me out of his sight. I guess I should have been grateful he didn’t take the hardline security solution of locking me up somewhere. I was sure he still considered that an option, but since there was no way he could get the Saghred by himself, it was in his best interests to stay on my good side. And that’s exactly where he was. Really close. While Eiliesor’s proximity was rather nice, it wasn’t very practical. If I needed to draw a blade, I’d have to knock him out of the way first. And considering his size in relation to mine, I knew that wasn’t physically possible.\u003c/p\u003e\n\u003cp\u003eI’d join Phaelan in a minute, but I wanted to talk to Eiliesor now. I had some questions. Nagging questions of the life-and-death variety. Eiliesor and I were behind some crates around the corner from Cutthroat Alley. Phaelan would let me know when Ocnus put in an appearance. I wanted the first hands around Ocnus’s throat to be mine.\u003c/p\u003e\n\u003cp\u003eEiliesor stood an arm’s length away, utterly still, his hands relaxed—and where they could immediately draw either sword or dagger. Always the Guardian, always on duty, always ready for anything. I wondered if he even knew how to relax. Not that I wanted him to start now, but I did wonder what a playful Mychael Eiliesor would be like.\u003c/p\u003e\n\u003cp\u003eHe must have felt me watching him. He looked down at me, his dark eyes unreadable in the alley’s faint light.\u003c/p\u003e\n\u003cp\u003e“What are you thinking?” His voice was a husky whisper. Raising your voice in this part of the waterfront was never a good idea. Maybe he knew that. Or maybe it was just for me. Either way, it was a very nice whisper.\u003c/p\u003e\n\u003cp\u003e“Nothing,” I lied.\u003c/p\u003e\n\u003cp\u003e“You were smiling.”\u003c/p\u003e\n\u003cp\u003e“Was not.”\u003c/p\u003e\n\u003cp\u003eOne corner of his mouth turned upward. “Yes, you were. What is it?”\u003c/p\u003e\n\u003cp\u003e“I was wondering if you’re ever off duty.”\u003c/p\u003e\n\u003cp\u003e“I am.”\u003c/p\u003e\n\u003cp\u003e“Do you ever act like it?”\u003c/p\u003e\n\u003cp\u003eHis blue eyes shone in the half-light. “I’ve been known to. Is that what prompted the smile?”\u003c/p\u003e\n\u003cp\u003e“It was. I just can’t imagine you being anything other than a Guardian.”\u003c/p\u003e\n\u003cp\u003e“I don’t know what you may have heard about me,” he began.\u003c/p\u003e\n\u003cp\u003e“By the book and all business.”\u003c/p\u003e\n\u003cp\u003eThe smile broadened slightly. “I do hold myself and my men to a higher level of accountability than some of my predecessors. It’s earned me a reputation that has its uses. Sometimes it makes my job, and the jobs of my men, a little easier.” The smile faded. “I take my position—and my responsibilities—very seriously. You’re in danger because of an object that is my responsibility, something I’m asking you to help us find.”\u003c/p\u003e\n\u003cp\u003eI shifted uncomfortably. “My reasons for agreeing to help aren’t exactly honorable, you know. I’m one big bull’s-eye for a lot of bad people until I can get this thing off of me, so I have a vested interest in helping you get what you want.”\u003c/p\u003e\n\u003cp\u003e“That doesn’t lessen the danger you’ll be in over the next few days, nor does it lessen my appreciation for your help—and my admiration of you.” The Guardian paused awkwardly. “Mistress Benares?” His voice was oddly formal.\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“I would like it very much if you would call me Mychael.”\u003c/p\u003e\n\u003cp\u003eI felt a smile coming on. I didn’t try to stop it. “I think I can do that.”\u003c/p\u003e\n\u003cp\u003eIf the light had been better, I would have sworn he had blushed. I felt a little warm myself.\u003c/p\u003e\n\u003cp\u003eNow for the question of the night. “Do you have a plan?” I asked, my voice small and quiet even to me.\u003c/p\u003e\n\u003cp\u003eMychael seemed genuinely puzzled. “Pardon me?”\u003c/p\u003e\n\u003cp\u003e“A plan. Say Ocnus actually knows where the Saghred is, and we get him to cough it up. Do you have a plan that’s going to get this thing off my neck while leaving my head attached to my shoulders?”\u003c/p\u003e\n\u003cp\u003e“I do, but the details depend on where the Saghred is.”\u003c/p\u003e\n\u003cp\u003eNow for the question I really didn’t want to ask. “What if the weasel’s lying? What if he doesn’t know a thing, and he just tried to con the wrong people? It wouldn’t be the first time. What then?”\u003c/p\u003e\n\u003cp\u003eMychael was silent for a little too long.\u003c/p\u003e\n\u003cp\u003e“You are a seeker—and your father’s daughter.”\u003c/p\u003e\n\u003cp\u003eI thought it’d be something like that.\u003c/p\u003e\n\u003cp\u003eHe moved a step closer to me. I didn’t move, and I didn’t mind.\u003c/p\u003e\n\u003cp\u003eHis voice was low. “If there is the possibility, however remote, that Ocnus Rancil knows where the Saghred is, I would prefer to get that information from him and then confirm it through more mundane means.”\u003c/p\u003e\n\u003cp\u003eI swallowed. “Because the Saghred’s dangerous.”\u003c/p\u003e\n\u003cp\u003e“That’s one reason.” Mychael paused uncomfortably. “No doubt you are a fine seeker, but your father had the beacon created to his skill level. He was an exceptionally gifted mage, one of the best our order has ever produced. He knew how to use the beacon to keep track of the Saghred. Unfortunately, that information vanished with him. But I am knowledgeable of how a beacon such as yours works—”\u003c/p\u003e\n\u003cp\u003e“So you can walk me through it, if necessary.”\u003c/p\u003e\n\u003cp\u003eHe smiled slightly. “If necessary. Hopefully it won’t be.”\u003c/p\u003e\n\u003cp\u003e“What are the chances that Eamaliel Anguis is my father?” I finally asked. “Really.”\u003c/p\u003e\n\u003cp\u003e“From the beacon’s reaction to you, almost a certainty.”\u003c/p\u003e\n\u003cp\u003eI was quiet for a longer moment, for an entirely different reason.\u003c/p\u003e\n\u003cp\u003e“A nine-hundred-year-old elven Guardian is my father.” I said it as much to myself as to the much younger elven Guardian standing in front of me. Like saying it would make it more believable. Or less terrifying.\u003c/p\u003e\n\u003cp\u003e“He was connected to the Saghred,” I said. “I’m connected to the Saghred. He’s nine-hundred-years old and still alive. I’m going to be…?”\u003c/p\u003e\n\u003cp\u003e“Just fine,” Mychael assured me.\u003c/p\u003e\n\u003cp\u003e“How do you know that?”\u003c/p\u003e\n\u003cp\u003e“Eamaliel had nearly continuous, daily contact with the Saghred for almost two years before he ever had the beacon made. And he wore the beacon for nearly a decade before anyone noticed he didn’t seem to be aging. You’ve never touched the Saghred, and you’ve only worn the beacon for two days. We’re going to find the Saghred, get the beacon off of you, and you’re going to be just fine.”\u003c/p\u003e\n\u003cp\u003e“No magical leftovers?”\u003c/p\u003e\n\u003cp\u003eMychael was silent.\u003c/p\u003e\n\u003cp\u003e“You’ve been reassuring until now,” I said. “More of the same would be nice.”\u003c/p\u003e\n\u003cp\u003e“There could be some residuals.”\u003c/p\u003e\n\u003cp\u003e“Residuals?”\u003c/p\u003e\n\u003cp\u003e“When Eamaliel keyed himself to the beacon, he essentially keyed himself to the Saghred. The beacon acted as a conduit, and transferred some of the Saghred’s power to him. You experienced a taste of that last night with the Magh’Sceadu. With beacons and objects of power, any link is usually severed when the beacon is removed.”\u003c/p\u003e\n\u003cp\u003e“Usually.”\u003c/p\u003e\n\u003cp\u003e“With something as powerful as the Saghred, the residuals can be significantly more than mere magical leftovers.”\u003c/p\u003e\n\u003cp\u003e“So some of what I can do now could stay with me?”\u003c/p\u003e\n\u003cp\u003e“It’s possible that all of what you can do now will stay with you.”\u003c/p\u003e\n\u003cp\u003e“Great. Every couple of hours I’m finding something new I can do.” I had a thought, and it made me faintly queasy. “Would Sarad Nukpana know this?” \u003c/p\u003e","sourceLink":"https://allnovel.net/magic-lost-trouble-found-raine-benares-1/page-39.html","bookId":1620,"creation":"Oct 5, 2019 6:11:17 PM","modification":"Oct 5, 2019 6:11:17 PM"}
