{"id":94877,"no":55,"title":"Page 55","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe goblin turned to me and smiled as if from a private joke. “Your catacombs, Mistress Benares.”\u003c/p\u003e\n\u003cp\u003eI knew there was a reason why I still didn’t like him.\u003c/p\u003e\n\u003cp\u003eI had expected the entrance to the catacombs to be in the floor. It had never occurred to me that it would be hidden in the wall. The vaults in the mausoleum were stacked four high, one on top of the other, and covered every wall. The vaults concealing the entrance to the catacombs were fake. Where there should be four bodies interred was an incredibly steep and narrow stair leading down into the center of the hill.\u003c/p\u003e\n\u003cp\u003eMychael held out his hand and stared at his palm. A pinpoint of white light flickered to life from the center of his hand, beneath the skin. It was no larger than a firefly. It spun, weaving a trail of light until a globe, the size of his fist, hung suspended above his open hand. It glowed steadily and seemed to solidify, the interior crackling with something akin to lightning. It floated down the stairs, then stopped, hovering, waiting for us.\u003c/p\u003e\n\u003cp\u003eMychael indicated that the goblin prince should precede us. “After you, Your Highness.”\u003c/p\u003e\n\u003cp\u003eChigaru raised one elegant brow.\u003c/p\u003e\n\u003cp\u003e“You have been in these catacombs before,” Mychael explained. “We have not. Rest assured, we’ll be right behind you.” He looked to Garadin. “Garadin, if you could remain here with Primari Nuru? Piaras, stay with Vegard. We won’t be long. Riston,” he said to the other Guardian with us, “you’re with me.”\u003c/p\u003e\n\u003cp\u003e“Sir?” Vegard asked uncertainly. He didn’t glance at the prince. He didn’t need to. Mychael understood.\u003c/p\u003e\n\u003cp\u003e“From the looks of things, there’s not much room to maneuver down there,” the paladin said. “Riston and his knives are a better fit. Just make sure there’s a hole for us to come out of.”\u003c/p\u003e\n\u003cp\u003eThe blond Guardian grinned. “Count on it, sir.”\u003c/p\u003e\n\u003cp\u003e“I am.” He again gestured to the prince. “Shall we?”\u003c/p\u003e\n\u003cp\u003ePrince Chigaru descended the stairs. Mychael and I followed, with Riston at our backs.\u003c/p\u003e\n\u003cp\u003eThe walls glistened in the globe’s pale light, moisture trickling down the sides to collect on the uneven floor, making footing uncertain at best. The air was cool and damp. Somewhere ahead in the darkness, water dripped methodically into a pool. I gathered my gown up as best as I could. Mychael was directly in front of me. I aimed a dirty look at the center of his back. What I wouldn’t have given for my old leathers and boots. Aside from our breathing, there was no other sound. The damp wasn’t nearly as bad as the cloying smell of decay—or the unexpected silence. Not from the residents—I didn’t expect any trouble from them. I did expect to hear or sense something from the Saghred. I suddenly felt faintly nauseous. Though that could be from being in such close quarters with centuries of Ramsden dead and a Mal’Salin prince.\u003c/p\u003e\n\u003cp\u003eThe globe’s light illuminated a white crust that shone in lines at differing heights along the rock walls. Salt. My subconscious knew what the lines meant, but my conscious mind didn’t want to dwell on it. There were many ways we could die tonight, and I didn’t want to add drowning to the list. The tide wouldn’t turn for hours, and we certainly weren’t going to be here that long. Knowing that didn’t help. Fear was irrational that way. If I survived all this, I wasn’t going to have to look far for fresh nightmare inspiration.\u003c/p\u003e\n\u003cp\u003eThe catacombs couldn’t be very extensive, at least I hoped not. There was only one tunnel with no branches that I could see in the dim light. Ledges had been hollowed out of the walls on both sides of us. These were packed with the yellowed bones of obviously more than one dearly departed, some to overflowing. A name and date was engraved on each ledge. Some were worn smooth with age and water.\u003c/p\u003e\n\u003cp\u003e“Thick as thieves down here, aren’t they?” Riston remarked.\u003c/p\u003e\n\u003cp\u003eI grinned. I couldn’t help it. It probably just meant I was on the verge of getting hysterical. “Makes you hope they all got along,” I quipped.\u003c/p\u003e\n\u003cp\u003eThe Guardian called my grin and raised me a wink.\u003c/p\u003e\n\u003cp\u003e“Riston, take the point,” Mychael said softly.\u003c/p\u003e\n\u003cp\u003e“Sir.” The Guardian slid his brace of throwing daggers around to his chest for quicker access. He flexed his fingers to warm them.\u003c/p\u003e\n\u003cp\u003eWe hadn’t gone far before my nausea turned into a wave of dizziness. I felt the Saghred’s presence before I heard it. My breath came shallow and quick, my skin was clammy, my mouth dry. I tried to swallow, but couldn’t.\u003c/p\u003e\n\u003cp\u003e“Stop. It’s here.”\u003c/p\u003e\n\u003cp\u003eA soft humming echoed through the tunnels.\u003c/p\u003e\n\u003cp\u003eMychael looked sharply at me. He heard it, too.\u003c/p\u003e\n\u003cp\u003e“Raine?”\u003c/p\u003e\n\u003cp\u003eI dimly realized his voice sounded farther away than it should. It didn’t bother me, and I think it should have.\u003c/p\u003e\n\u003cp\u003e“Fine.” I felt myself try to breathe. I stayed on my feet, so I think I succeeded. “I’m fine.”\u003c/p\u003e\n\u003cp\u003eI felt his arm slip around my waist. I don’t think he believed me. I steadied myself, then stepped away.\u003c/p\u003e\n\u003cp\u003e“Down there,” I said, forcing more air into my words than I had to spare. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eThe tunnel ended abruptly in a room only ten feet or so square. A white stone panel shone starkly in one wall on the edge of the globe’s light. It was a burial vault in miniature. It was only about a foot square and oddly translucent, like alabaster. It also bore a striking resemblance to the containment box Quentin had found the beacon in—and the small box Mychael now held in his hands. The frosted surface was smooth and unmarked except for a small, circular section that had been carved out of the stone.\u003c/p\u003e\n\u003cp\u003eYou didn’t have to be too smart to know what was meant to go there.\u003c/p\u003e\n\u003cp\u003ePrince Chigaru stepped around Riston for a closer look. “That was not here before,” he insisted.\u003c/p\u003e\n\u003cp\u003e“When was that?” Mychael asked.\u003c/p\u003e\n\u003cp\u003e“Three years,” the goblin said.\u003c/p\u003e\n\u003cp\u003eMychael and I exchanged glances. Plenty of time for a certain Saghred Guardian to do a little redecorating.\u003c/p\u003e\n\u003cp\u003eIt took a lot of squirming on my part, but I managed to remove the beacon from my bodice. Prince Chigaru’s eyes were instantly on me, his lean body tense with restraint.\u003c/p\u003e\n\u003cp\u003eI had one word for him. “Stay.”\u003c/p\u003e\n\u003cp\u003e“Wait,” Mychael told me. “Are you shielded?”\u003c/p\u003e\n\u003cp\u003eMy shoulders slumped. “Do you really think that’s going to do any good?” I sounded the way I felt. Tired.\u003c/p\u003e\n\u003cp\u003eHis jaw tightened. “Probably not.”\u003c/p\u003e\n\u003cp\u003eI knelt and put the beacon into the hollow. It grated against the accumulated salt, and some of it fell on the floor. That was all. Nothing happened. That didn’t mean something wasn’t different. It was, and it wasn’t at all what I expected. I looked more closely at the white stone panel.\u003c/p\u003e\n\u003cp\u003e“What is it?” Mychael asked.\u003c/p\u003e\n\u003cp\u003e“Does it look more transparent to you?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eI looked again—then stared in wonder at what lay beyond.\u003c/p\u003e\n\u003cp\u003e“It does to me,” I breathed. Then I became a part of it.\u003c/p\u003e\n\u003cp\u003eI was surrounded in pulsating light and movement. Flowing forms emerged from shifting colors, each separate and distinct. I realized with amazement turning to horror that the forms were alive. Most were faceless wraiths, their bodies pale and indistinct as they fled, terrified of me. Others didn’t flee, but passed just out of arms reach, with faint cries and whispered pleas, held at bay as if by some unseen hand. The remaining ones were more solid, though their bodies were wasted as if from the ravages of disease. They didn’t whisper or beg. They screamed in rage and frustration at not being able to reach me. Something stopped them from touching me, but nothing blocked their raw need. I tried to run, but the same force that held them at bay held me still.\u003c/p\u003e\n\u003cp\u003eI was inside the Saghred. The wraiths around me were all that remained of those sacrificed or absorbed over the ages. Not just goblins, but elves, humans and dwarfs—though some were too far gone to be recognized as any race.\u003c/p\u003e\n\u003cp\u003eA lone figure came toward me and stopped just beyond arm’s reach, silently staring. His elegantly pointed ears marked him as an elf, a beautiful pure-blooded high elf. His hair was silver, and his eyes were the gray of gathering storm clouds. Eyes identical to my own. A slow smile curled the corners of his lips. I could see why my mother hadn’t cared that he was nearly nine hundred years old.\u003c/p\u003e\n\u003cp\u003eEamaliel Anguis knew me and had been expecting me—all this time, all of my life.\u003c/p\u003e\n\u003cp\u003e“Daughter.”\u003c/p\u003e\n\u003cp\u003eLike most fatherless little girls, I’d always imagined what my father would look like. What stood before me wasn’t it. For one, I could see through him.\u003c/p\u003e\n\u003cp\u003eI couldn’t move. I didn’t even know if I was breathing.\u003c/p\u003e\n\u003cp\u003e“How?” I whispered the word, but it echoed in my head, not my ears.\u003c/p\u003e\n\u003cp\u003eHe smiled. It was a kind smile, encouraging, patient. “How are you here or how am I here?”\u003c/p\u003e\n\u003cp\u003eMy throat was too tight to speak. I just nodded.\u003c/p\u003e\n\u003cp\u003e“Because I needed to speak with you. Don’t be afraid. You can see me and the others, but your body remains outside the Saghred, in the arms of your Guardian. You are safe.”\u003c/p\u003e\n\u003cp\u003e“Are you alive?” I wasn’t sure if it was in poor taste to ask, but I had to.\u003c/p\u003e\n\u003cp\u003e“The Saghred does not take life,” he explained. “It absorbs it. I am alive, but on a different level than you are probably familiar with. Time is different on the inside.”\u003c/p\u003e\n\u003cp\u003eI felt myself try to grin. “A couple of my formerly incarcerated Benares relatives say the same thing.”\u003c/p\u003e\n\u003cp\u003eMy father looked at me as if trying to fit a lifetime of seeing me into a few seconds. His gaze was so intense that I wanted to look away, but looking away meant seeing floating wraiths. So I kept my eyes exactly where they were.\u003c/p\u003e\n\u003cp\u003e“You’re so beautiful,” he managed. “Just like your mother.”\u003c/p\u003e\n\u003cp\u003eUncomfortable under his scrutiny—and even more uncomfortable at the mention of my mother—I brushed at one of the gown’s jewel-strewn velvet panels. “This isn’t how I normally dress. The goblin king’s masked ball. We had to get on the grounds somehow. You might say I’m undercover. The gown and going to the ball wasn’t exactly my idea.” I stopped and tried to breathe. “I’m babbling, aren’t I?” \u003c/p\u003e","sourceLink":"https://allnovel.net/magic-lost-trouble-found-raine-benares-1/page-55.html","bookId":1620,"creation":"Oct 5, 2019 6:11:17 PM","modification":"Oct 5, 2019 6:11:17 PM"}
