{"id":94883,"no":61,"title":"Page 61","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eGaradin, Tarsilia, and Piaras were sailing to Mid with me. So was my cat, Boris. Once Garadin had drafted his weather wizard friend to help get us to Mid, he ran by my rooms to get Boris. Garadin was in a hurry. Boris did nothing in a hurry except eat. Garadin had to drag Boris out from under my bed. Boris had to claw the crap out of Garadin’s arms. I’d only seen my cat once after we’d set sail, chasing a fat rat. Boris was on his ideal vacation. I couldn’t say the same for myself.\u003c/p\u003e\n\u003cp\u003eMychael had told me I was safe, but safe was relative. An armada wasn’t enough to make me feel safe right now. Our trio of ships bristled with cannons and shielding spells. But what I feared most I had brought onboard myself. Not on the Fortune, but on one of the Conclave’s ships. The Saghred was in Mychael’s cabin, in its casket, under the strongest containment spells he and his Guardians could bind it with. Though it didn’t matter where the Saghred was, because I heard it the whole time, whispering without words, a constant stream running under my thoughts. I tried thinking other thoughts to drown out the whispers, but all that did was make it harder to go to sleep. I could see this was going to be a problem.\u003c/p\u003e\n\u003cp\u003eI wondered if my father had lain awake at night listening to the voices, and later the temptations. Though at this point, I’d settle for a good night’s sleep—and count on my own special brand of stubbornness as a defense. Garadin always told me I was stubborn as a rock. I never thought I’d actually have to put it to the test.\u003c/p\u003e\n\u003cp\u003eSo far I hadn’t experienced anything approaching the Saghred’s full power. I didn’t know what it would feel like, and I would really prefer to go the rest of my life without finding out. I just hoped I wouldn’t wake up in a few hours craving coffee, sugar knots, and world domination. The last one sounded like entirely too much work, but that didn’t mean I couldn’t be tempted by the Saghred’s other offers. I’d only heard a few, and I was sure there would be more.\u003c/p\u003e\n\u003cp\u003eI awoke to sunlight and sea air. Waking up meant I’d been asleep. Good for me. Nice morning, blue sky. The Fortune was under full sail and moving fast. I was alive. So were my friends. And most importantly, I didn’t feel the urge to take over anything. Life was good.\u003c/p\u003e\n\u003cp\u003eI still heard voices, but this time they weren’t coming from inside the Saghred. They were warm, living, breathing voices and sounds. Tarsilia speaking, Piaras laughing. Garadin knocking. Somehow I knew it was him.\u003c/p\u003e\n\u003cp\u003eI rolled over. “Come.”\u003c/p\u003e\n\u003cp\u003eThe door opened. Yep, it was Garadin. Nothing like getting a brand-new power from a soul-sucking rock to start your day.\u003c/p\u003e\n\u003cp\u003e“How did you sleep?” he asked.\u003c/p\u003e\n\u003cp\u003eI sat up, pulled the blanket around me and pushed what must have been some very scary looking hair out of my face. I hadn’t bothered braiding it before I turned in. I was only wearing a silk shirt. A big one. It wasn’t mine; it was Mychael’s. It was also nice and comfy. With the Khrynsani probably on my tail, there was no time for civilized niceties like packing. I had some clothes onboard, but nothing for sleeping. Phaelan said he could find me some girl clothes, but I knew where those clothes had come from, and I’d rather not wear anything one of his nighttime visitors hadn’t had time to put back on.\u003c/p\u003e\n\u003cp\u003e“I slept well enough,” I said. “All things considered.”\u003c/p\u003e\n\u003cp\u003e“All things?”\u003c/p\u003e\n\u003cp\u003e“The Saghred thinks I’m its new roommate.”\u003c/p\u003e\n\u003cp\u003eMy godfather didn’t respond immediately. “You’re the only one who can hear it. The shields are holding for the rest of us.” There were the beginnings of dark circles under his blue eyes. It looked like he’d been helping with those shields.\u003c/p\u003e\n\u003cp\u003e“Apparently I’m not the rest of us,” I said.\u003c/p\u003e\n\u003cp\u003e“I know. That’s what I wanted to talk to you about.”\u003c/p\u003e\n\u003cp\u003e“I figured as much.”\u003c/p\u003e\n\u003cp\u003eHe pushed off the door frame with his shoulder and crossed the cabin to the bunk. He sat on the edge near the foot.\u003c/p\u003e\n\u003cp\u003e“You might not want to do that,” I told him. “Rumor has it I’m dangerous right now.”\u003c/p\u003e\n\u003cp\u003eHe halfway smiled. “I’ve always known that.”\u003c/p\u003e\n\u003cp\u003eHe leaned forward, elbows resting on his knees, hands clasped loosely in front of him. He sat that way in silence. I had a feeling he was gathering words he knew I didn’t want to hear.\u003c/p\u003e\n\u003cp\u003e“Heard anything else from your father?”\u003c/p\u003e\n\u003cp\u003eI shook my head and sat up straighter against the pillows. “Just Nukpana.”\u003c/p\u003e\n\u003cp\u003eThat thought troubled him. It troubled me more.\u003c/p\u003e\n\u003cp\u003e“Anything now?”\u003c/p\u003e\n\u003cp\u003e“Not a peep from the grand shaman.” I managed a weak smile, though there was no humor behind it. “Maybe he got tired.”\u003c/p\u003e\n\u003cp\u003e“Maybe.” Garadin bowed his head and looked at the deck. “I had no idea Eamaliel Anguis was your father. Maranda never mentioned him. I asked her. Once. She said she didn’t want to talk about it, and I knew she didn’t want me to bring it up again. So I didn’t.”\u003c/p\u003e\n\u003cp\u003e“Sounds like she was stubborn.”\u003c/p\u003e\n\u003cp\u003eMy godfather smiled. “Like someone else I know.”\u003c/p\u003e\n\u003cp\u003eHe lifted his head and looked at me then, and I found myself not wanting to meet his eyes. I knew he saw me—but he was remembering my mother.\u003c/p\u003e\n\u003cp\u003e“She loved you.” His voice was soft and husky. “And I don’t have that secondhand. I saw it myself.”\u003c/p\u003e\n\u003cp\u003eIf he kept this up, my long-promised screaming fit was going to turn into a crying jag. I could only manage a ragged whisper in response. “Thank you.”\u003c/p\u003e\n\u003cp\u003eHe was fighting his own case of the misties. He patted my knee under the blanket. “Mychael’s a good man, and so is Justinius Valerian. We’ll get this taken care of, girl.”\u003c/p\u003e\n\u003cp\u003eI tried a shaky grin on for size. It didn’t quite fit. “One way or another.”\u003c/p\u003e\n\u003cp\u003e“No, just one way.” He pushed himself to his feet and straightened his robes. “There’s breakfast in the galley if you’re interested. Piaras might have left something for you.”\u003c/p\u003e\n\u003cp\u003eHe stopped at the door. “Mychael isn’t sending word ahead to Justinius that he has the stone,” he said quietly. “But I’m sure the goblins already have.”\u003c/p\u003e\n\u003cp\u003e“Well, that’ll just make the bad guys easier to spot,” I said. “Anyone on Mid who knows we have the rock got their information through the back door.”\u003c/p\u003e\n\u003cp\u003eGaradin met my comment with calm silence. The kind you had when you were right and you knew it—and so did the person who wanted you to be wrong. I chose to ignore it. I could think about it when we got to Mid. That gave me about four days to ignore my future.\u003c/p\u003e\n\u003cp\u003eI swung my legs over the side of the bunk. My muscles had other ideas. I winced. “I’ll get dressed and be out in a few minutes.”\u003c/p\u003e\n\u003cp\u003eMy godfather nodded and left.\u003c/p\u003e\n\u003cp\u003eI took my time dressing, and then strapped on my blades. What threatened me most right now couldn’t be hurt by steel, but I wasn’t going to let a few days at sea get me out of a healthy habit. Once on Mid, I was sure I’d get ample opportunity to use both spells and steel. There were plenty of people there who wanted what I had, what I could do. That meant they wanted me.\u003c/p\u003e\n\u003cp\u003eI’m a seeker. I find things. Fate sure does have a warped sense of humor. Now I’m what the bad guys are trying to find. Most times people are glad when they find what they’re looking for. Sometimes they’re sorry they asked. If you ask me, folks should be more careful what they ask for. I cinched the buckle on my brace of throwing knives. Some things are better left unfound. Like me.\u003c/p\u003e\n\u003cp\u003eI’d had some sleep, I’d get some breakfast, talk to my friends, then I’d find my favorite place near the bow. Wind in my hair, spray on my face. A little sun and fresh air. A little happiness. I take my happiness when and where I can find it. \u003c/p\u003e","sourceLink":"https://allnovel.net/magic-lost-trouble-found-raine-benares-1/page-61.html","bookId":1620,"creation":"Oct 5, 2019 6:11:17 PM","modification":"Oct 5, 2019 6:11:17 PM"}
