{"id":71173,"no":30,"title":"Page 30","content":"\u003cp\u003eAria snuggled into Ezra. She started dozing off again, thinking about dancing monkeys and sandy beaches when suddenly, there was pounding at the front door. Before Aria and Ezra could react, the door split open and two policemen burst inside. Aria screamed. Ezra sat up and straightened his boxers, which had pictures of fried eggs, sausages, and pancakes all over them. The words Tasty Breakfast! were scrolled around the waistband. Aria hid under the covers—she was wearing an oversized Hollis University T-shirt of Ezra’s that barely covered her thighs.\u003c/p\u003e\n\u003cp\u003eThe cops stomped through Ezra’s living room and into his bedroom. They shined their flashlights first over Ezra, then on Aria. She wrapped the sheets around her tighter, scanning the floor for her clothes and undies. They were gone.\u003c/p\u003e\n\u003cp\u003e“Are you Ezra Fitz?” demanded the cop, a burly, Popeye-armed man with slick black hair.\u003c/p\u003e\n\u003cp\u003e“Uh…yeah,” Ezra stammered.\u003c/p\u003e\n\u003cp\u003e“And you teach at Rosewood Day School?” Popeye asked. “Is this the girl? Your student?”\u003c/p\u003e\n\u003cp\u003e“What the hell is going on?” Ezra shrieked.\u003c/p\u003e\n\u003cp\u003e“You’re under arrest.” Popeye unhooked silver handcuffs from his belt. The other cop, who was shorter and fatter and had shiny skin that Aria could only describe as ham-colored, yanked Ezra out of bed. The threadbare, grayish sheets went with him, exposing Aria’s bare legs. She screamed and dropped to the other side of the bed to hide. She found a pair of plaid pajama pants balled up behind the radiator. She stuffed her legs into them as fast as she could.\u003c/p\u003e\n\u003cp\u003e“You have the right to remain silent,” Ham-face began. “Anything you say can and will be used against you in a court of law.”\u003c/p\u003e\n\u003cp\u003e“Wait!” Ezra screamed.\u003c/p\u003e\n\u003cp\u003eBut the cops didn’t listen. Ham-face spun Ezra around and snapped the cuffs on his wrists. He glanced disgustedly at Ezra’s futon. Ezra’s jeans and T-shirt were snarled up near the headboard. Aria suddenly noticed that the lacy black bra she’d had custom-fitted in Belgium was snagged on one of the bedposts. She quickly ripped it down.\u003c/p\u003e\n\u003cp\u003eThey shoved Ezra through the living room and out his own door, which hung precariously on one hinge. Aria ran after them, not even bothering to put on her checkerboard Vans, which waited in the second ballet position on the floor near the television. “You can’t do this!” she shouted.\u003c/p\u003e\n\u003cp\u003e“We’ll deal with you next, little girl,” Popeye growled.\u003c/p\u003e\n\u003cp\u003eShe hesitated in the dingy, dimly lit front hall. The cops restrained Ezra like he was a skinny, breakfast-boxer-clad mental patient. Ham-face kept stepping on his knobby bare feet. It made Aria love him even more.\u003c/p\u003e\n\u003cp\u003eAs they bumbled out the door and onto the front porch, Aria realized someone else was in the hall with her. Her mouth fell open.\u003c/p\u003e\n\u003cp\u003e“Sean,” Aria sputtered. “What…what are you doing here?”\u003c/p\u003e\n\u003cp\u003eSean was crumpled up against the gray mailbox unit, staring at Aria with dread and disappointment. “What are you doing here?” he demanded, staring pointedly at Ezra’s oversize pajama pants, which were threatening to fall down to her ankles. She quickly yanked them back up.\u003c/p\u003e\n\u003cp\u003e“I was going to explain,” Aria mumbled.\u003c/p\u003e\n\u003cp\u003e“Oh yeah?” Sean challenged, putting his hands on his hips. He looked sharper tonight, meaner. Not the soft Sean she knew. “How long have you been with him?”\u003c/p\u003e\n\u003cp\u003eAria silently stared at an Acme market coupon circular that had fallen on the floor.\u003c/p\u003e\n\u003cp\u003e“I’ve packed up all your stuff,” Sean went on, not even waiting for her answer. “It’s on the porch. There’s no way you’re coming back to my house.”\u003c/p\u003e\n\u003cp\u003e“But…Sean…” Aria said weakly. “Where will I go?”\u003c/p\u003e\n\u003cp\u003e“That’s not my problem,” he snapped, storming out the front door.\u003c/p\u003e\n\u003cp\u003eAria felt woozy. Through the open door, she could see the cops guiding Ezra down his front walk and pushing him into a Rosewood Police cruiser. After they slammed the back door, Ezra glanced toward his house again. He looked at Aria, then Sean, then back again. There was a betrayed look on his face.\u003c/p\u003e\n\u003cp\u003eA light switched on in Aria’s head. She followed Sean to the porch and grabbed his arm. “You called the police, didn’t you?”\u003c/p\u003e\n\u003cp\u003eSean crossed his arms over his chest and looked away. She felt dizzy and sick, and clutched the porch’s rusty blue-gray glider for balance.\u003c/p\u003e\n\u003cp\u003e“Well once I got this…” Sean whipped out his cell phone and brought it close to Aria’s face. On the screen was a picture of Aria and Ezra kissing in Ezra’s office. Sean hit the side arrow. There was another photo of them kissing, just from a different angle. “I figured I should let the authorities know a teacher was with a student.” His lips curled around the word student, as if it was disgusting to him. “And on school property,” he added.\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to hurt you,” Aria whispered. And then, she noticed the text message that accompanied the last photo. Her heart sank a few thousand feet deeper.\u003c/p\u003e\n\u003cp\u003eDear Sean, I think someone’s girlfriend has a LOT of explaining to do.\u003c/p\u003e\n\u003cp\u003e—A\u003c/p\u003e\n\u003cp\u003e32\u003c/p\u003e\n\u003cp\u003eNOT-SO-SECRET LOVERS\u003c/p\u003e\n\u003cp\u003e“And they were all over each other!” Emily took a huge sip of the sangria Maya had gotten for them from the planetarium bar. “All this time, I was afraid they could, like, change you, but it turns out that it’s fake! My sponsor’s back with her girlfriend and everything!”\u003c/p\u003e\n\u003cp\u003eMaya gave Emily a crazy look, poking her in the ribs. “You seriously thought they could change you?”\u003c/p\u003e\n\u003cp\u003eEmily leaned back. “I guess that is stupid, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Yes.” Maya smiled. “But I’m glad it doesn’t work too.”\u003c/p\u003e\n\u003cp\u003eAbout an hour ago, Becka and Wendy had dropped Emily off at Mona’s party and she had torn through the rooms, searching for Maya, terrified that she had left—or worse, that she was with someone else. She’d found Maya by herself near the DJ booth, wearing a black-and-white striped dress and patent-leather Mary Janes. Her hair was up in white butterfly clips.\u003c/p\u003e\n\u003cp\u003eThey had escaped outside to a little patch of grass in the planetarium’s garden. They could see the party still raging through the two-story, frosted-glass windows, but they couldn’t hear it. Shady trees, telescopes, and bushes pruned into the shapes of planets filled the garden. A few of the partygoers had spilled out and were sitting on the other side of the patio, smoking and laughing, and there was a couple making out by the giant, Saturn-shaped topiary, but Emily and Maya were pretty much sequestered. They hadn’t kissed or anything, but were merely staring up at the sky. It had to be almost midnight, which was normally Emily’s curfew, but she’d called her mom to say that she would be staying the night at Becka’s. Becka had agreed to corroborate the story, if need be.\u003c/p\u003e\n\u003cp\u003e“Look,” Emily said, pointing at the stars. “That section of stars up there, don’t they look like they could form an E if you drew lines between them?”\u003c/p\u003e\n\u003cp\u003e“Where?” Maya squinted.\u003c/p\u003e\n\u003cp\u003eEmily positioned Maya’s chin correctly. “There are stars next to them that form an M.” She smiled in the darkness. “E and M. Emily and Maya. It’s, like, a sign.”\u003c/p\u003e\n\u003cp\u003e“You and your signs,” Maya sighed. They were comfortably quiet for a second.\u003c/p\u003e\n\u003cp\u003e“I was furious at you,” Maya said softly. “Breaking up with me in the kiln like that. Refusing to even look at me in the greenhouse.”\u003c/p\u003e\n\u003cp\u003eEmily squeezed her hand and stared at the constellations. A tiny jet streaked past, a thousand feet up. “I’m sorry,” she said. “I know I haven’t exactly been fair.”\u003c/p\u003e\n\u003cp\u003eNow Maya eyed Emily carefully. Glittery bronzer illuminated her forehead, cheeks, and nose. She looked more beautiful than Emily had ever seen her. “Can I hold your hand?” she whispered.\u003c/p\u003e\n\u003cp\u003eEmily gazed at her own rough, square hand. It had held pencils and paintbrushes and pieces of chalk. Gripped the starting blocks before a swimming race. Clutched a balloon on the swim team’s homecoming float last year. It had held her boyfriend Ben’s hand…and it had even held Maya’s, but it seemed like this time it was more official. It was real.\u003c/p\u003e\n\u003cp\u003eShe knew there were people around. But Maya was right—everyone already knew. The hard part was over, and she’d survived. She’d been miserable with Ben, and she hadn’t been kidding anybody with Toby. Maybe she should be out there with this. As soon as Becka had said it, Emily knew she was right: she couldn’t change who she was. The idea was terrifying but thrilling.\u003c/p\u003e\n\u003cp\u003eEmily touched Maya’s hand. First lightly, then harder. “I love you, Em,” Maya said, squeezing back. “I love you so much.”\u003c/p\u003e\n\u003cp\u003e“I love you, too,” Emily repeated, almost automatically. And she realized—she did. More than anyone else, more than Ali, even. Emily had kissed Ali, and for a split second, Ali had kissed her back. But then Ali had pulled back, disgusted. She’d quickly started talking about some boy she was really into, a boy whose name she wouldn’t tell Emily because Emily might “really freak.” Now Emily wondered if there even had been a boy, or if Ali had said it to undo the tiny moment when she had kissed Emily for real. To say, I’m not a lesbo. No frickin’ way.\u003c/p\u003e\n\u003cp\u003eAll this time, Emily had fantasized about what things would have been like if Ali hadn’t disappeared, and if that summer and their friendship had proceeded as planned. Now she knew: it wouldn’t have gone on. If Ali hadn’t disappeared, she would have drifted farther and farther away from Emily. But maybe Emily would still have found her way to Maya.\u003c/p\u003e\n\u003cp\u003e“You okay?” Maya asked, noting Emily’s silence.\u003c/p\u003e\n\u003cp\u003e“Yeah.” They sat quietly for a few minutes, holding hands. Then Maya lifted her head, frowning at something inside the planetarium. Emily followed her eyes to a shadowy figure, staring straight at them. The figure knocked on the glass, making Emily jump.\u003c/p\u003e\n\u003cp\u003e“Who is that?” Emily murmured.\u003c/p\u003e\n\u003cp\u003e“Whoever it is,” Maya said, squinting, “they’re coming outside.”\u003c/p\u003e\n\u003cp\u003eEvery hair on Emily’s body stood up. A? She scooted backward. Then she heard an all-too-familiar voice. “Emily Catherine Fields! Get over here!”\u003c/p\u003e\n\u003cp\u003eMaya’s mouth dropped open. “Oh my God.”\u003c/p\u003e\n\u003cp\u003eEmily’s mother stepped under the courtyard spotlights. Her hair was uncombed, she wore no makeup, she had on a ratty T-shirt, and her sneaker lace was untied. She looked ridiculous among the throng of done-up partygoers. A few kids gaped at her.\u003c/p\u003e\n\u003cp\u003eEmily clumsily struggled off the grass. “W-what are you doing here?”\u003c/p\u003e\n\u003cp\u003eMrs. Fields grabbed Emily’s arm. “I cannot believe you. I get a call fifteen minutes ago saying you’re with her. And I don’t believe them! Silly me! I don’t believe them! I say they’re lying!”\u003c/p\u003e\n\u003cp\u003e“Mom, I can explain!”\u003c/p\u003e\n\u003cp\u003eMrs. Fields paused and sniffed the air around Emily’s face. Her eyes widened. “You’ve been drinking!” she screamed, enraged. “What has happened to you, Emily?” She glanced down at Maya, who was sitting very still on the grass, as if Mrs. Fields had put her in suspended animation. “You’re not my daughter anymore.”\u003c/p\u003e\n\u003cp\u003e“Mom!” Emily screamed. It felt like her mother had thrust a curling iron into her eye. That statement sounded so…legal and binding. So final. \u003c/p\u003e","sourceLink":"https://allnovel.net/perfect-pretty-little-liars-3/page-30.html","bookId":2380,"creation":"Oct 5, 2019 10:19:33 AM","modification":"Oct 5, 2019 10:19:33 AM"}
