{"id":34568,"no":21,"title":"CHAPTER XXI. A CONSULTATION.","content":"\u0026nbsp;Mr. Sharp was seated in his office. A complacent smile played over his features. Perhaps he was thinking of the adroit manner in which he had secured one hundred dollars of the sum intrusted to him for Robert Ford. The bottle and glass, on the table before him, testified that his present occupation could hardly be considered of a professional character. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n While Mr. Sharp was holding up the glass before him, and admiring the rich warm tint of its contents, Lewis Rand quietly opened the door of the office and walked in. Had Mr. Sharp been consulted, he would prefer to have been forewarned of the visit.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Business driving as ever,” remarked Lewis, in his dry sarcastic way, taking in at a quick glance the scene before him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, yes,” said Mr. Sharp, in some embarrassment, putting down his glass, its contents untasted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It may be remarked, that whenever Mr. Sharp was perplexed, it was his habit to run his hands vigorously through his blushing locks, till they stood upon his head erect, and bristled like so many porcupine quills. By the time this was well over his faculties returned, and “Richard was himself again.” To this he had recourse on the present occasion, immediately after which he resumed his usual air of easy assurance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am, as you see,” he remarked affably, “taking my little symposium, in humble imitation of the ancient Greeks 140and Romans,—‘Champagne,’ as somebody has said, ‘is admirably calculated to clear cobwebs from the brain.’”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “In that case,” dryly returned his client, who could not resist the temptation of a hit at his coadjutor, “I advise you by all means to try it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Truly,” replied Mr. Sharp, who was dimly conscious of the covert sarcasm, but deemed it politic not to notice it directly, “there is no profession that racks the brain like mine, sir. The mightiest intellects of ancient as well as of modern times——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Sharp here assumed a standing posture, and was about to pronounce a eulogy upon the different great men who had, during the last twenty centuries, graced the profession which he adorned.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But the lawyer was saved the trouble of proceeding, by the expression of a wish on the part of Lewis to attend to business.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly, by all means,” said Mr. Sharp, briskly resuming his seat, and drawing before him a sheet of blank paper. “Business before pleasure, or rather, with me, business is pleasure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have, as you know,” Lewis commenced, “lent the sum of three hundred dollars to Robert Ford, through your agency.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And very liberal it was in you, I am sure,” said Mr. Sharp, with benignant approval.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “By no means. I never professed to be a philanthropist, and I freely acknowledge that in this act I was influenced by any but benevolent motives. It was done solely with a view to promote my own interests.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Here he paused; and Mr. Sharp, while waiting for a further explanation, rubbed his hands and nodded genially, as if to indicate how thoroughly he indorsed the views of his principal.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 141“I need not remind you,” continued Lewis, not heeding this little manifestation, “of how great importance it is to me that Robert Ford, who is the only obstacle between me and his father’s fortune, should be kept entirely out of the way of any possibility of meeting his father. Such an encounter fortunately is not very probable, since neither is aware of the other’s presence in the city. When, however I consider how trifling a chance, such for instance as a glance at a Directory, might lead to that knowledge, I feel more and more how essential it is to my interests that some decisive step should be taken. I may say in confirmation of this, that my uncle, whose health is in a very critical state, has conceived a fancy, Heaven knows how, that my cousin is still alive, notwithstanding the evidence of his death in Chicago, which I placed in his hands.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is awkward.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, it is very awkward, especially as he has insisted on my drawing up an advertisement for this precious cousin of mine, and having it inserted in the daily papers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you have done so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not I. It would be suicidal. I drew up the advertisement, however, as he requested, and he supposes that it has been inserted.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Sharp surveyed Lewis with a glance of approval. It was a tribute to superior rascality.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now I will explain to you,” pursued Lewis, “why I have lent money to Robert Ford. My uncle is dangerously ill; he cannot live many weeks at farthest. It is absolutely essential that some attempt should be made to place my cousin where he cannot do me any harm. If the laws permitted it, I would gladly have him imprisoned for debt. That is, unluckily, out of the question. I have it in my power, however, to annoy him in such a way as perhaps to drive him from the city.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 142“What do you propose to do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seize the furniture in execution, either with or without legal sanction. Robert is far from being a man of the world, and there is no risk in going to lengths with him, which would be dangerous with others.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have it,” said Sharp, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your cousin is quite devoted to a heap of old machinery, out of which he expects to make a flying machine or something of the kind. To seize upon that would be the most serious blow you could inflict upon him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe you are right. Robert was always a visionary. If that should prove insufficient to drive him away, I will authorize you to offer him some pecuniary inducements in a guarded manner—some remunerative employment which will call him elsewhere, and which he will be the more tempted to undertake if his present occupation is gone. Only let him be kept out of the way until——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are called upon to lament the death of your venerable relation,” suggested Sharp.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then,” pursued Lewis, “he may go where he pleases, so far as I am concerned.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear sir, you should have been a lawyer. You would have been an ornament to the profession,” said Mr. Sharp, with complimentary emphasis.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Rather an equivocal compliment, I am afraid,” returned Lewis, dryly. “But in order to carry out this plan of ours, beyond a doubt, we must ascertain that my cousin will be unable to pay the money when called upon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I may pledge you,” said the lawyer, “that you need entertain no apprehensions on that score. From what I have seen I conjecture that at the time of your loan he had but little money on hand, and I know that he has expended a considerable sum since.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 143“It is best to be certain, however.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Undoubtedly. I will myself call down there this afternoon, if you think best, and ascertain this point without exciting his suspicions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do so; and should you find the prospect favorable, take measures to have the demand presented to-morrow. If not discharged, you know how to proceed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may rely upon my following your directions to the letter,” returned the attorney, as sweeping his fingers once more through his blushing locks, he bowed his client gracefully out.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2975/81975.html","bookId":348,"creation":"Aug 5, 2019 5:45:47 AM","modification":"Aug 5, 2019 5:45:47 AM"}
