{"id":34570,"no":23,"title":"CHAPTER XXIII. THE BLOW FALLS.","content":"\u0026nbsp;The next morning found Mr. Sharp closeted with a brother practitioner equally unprincipled with himself. There was this difference between them, however, that while Mr. Sharp concealed his real character beneath a specious show of affability and suavity, his companion, whom, by way of distinction, we will call Blunt, was rough in his manners, and had not art enough to compass the consummate duplicity of the other. Indeed, so accustomed was Mr. Sharp to its use, that he did not lay it aside even where he knew it to be useless. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear friend Blunt,” he exclaimed, with charming cordiality, “I am delighted to see you looking so well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Humph?” was the somewhat dubious rejoinder.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should have called upon you instead of sending for you to my office, but I have really been so harassed by business that I could not get a single spare moment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you presumed that I was not overburdened in that way, eh?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear Blunt,” said Sharp, with wounded feeling, “how can you imagine such a thing?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I only judged from what you said. You hadn’t time to call upon me, but judged that I had plenty of time to spend in calling upon you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear Blunt,” said Sharp, impressively, “if the extent of a man’s business were always commensurate with his merits——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 149“We should neither of us stand a very good chance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was not exactly what I intended to say,” said Sharp, blowing his nose, “your modesty, my dear Blunt——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Modesty! I am sure you’re joking now, Sharp, and although my time is not particularly valuable, I don’t care to stand here discussing personal qualities; so if you had any object in sending for me, out with it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are somewhat abrupt in your speech, my dear friend; an evidence of your sincerity, for which no one has a greater respect than myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have heard,” muttered Blunt, “that people are apt to set a high value on qualities which they lack.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “However,” pursued Sharp, evading a reply to his last remark, “I have a little professional business to offer you, if your engagement will permit.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No fear on that score,” said Blunt, dryly; “but this business—why don’t you do it yourself? You needn’t tell me it’s on account of a pressure of the other engagements, for I know better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is not the reason, as with your usual penetration you have discovered, my dear Blunt. Do not for a moment think I would attempt to deceive you. With others it might do; but with you I know there would be no chance of succeeding.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Sharp nodded with pleasant affability to his visitor, and resumed: “The fact is, it is a matter in which I do not wish to appear. One of my clients (Mr. Sharp brought out these words with an emphasis calculated to convey the idea that it was one of a very large number), for a reason which I need not mention, employed me some weeks since to lend a sum of money to a certain individual. This was only to establish a power over him which, some time, it might be convenient to use. That time has come; it is his desire that the note should be presented with a demand 150for immediate payment; in default of which a particular article in possession of the borrower should be seized in execution. This, as you may readily imagine, would have a tendency to harrow up my feelings, and——”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Therefore you intrust the business to me, who have no feelings to be harrowed up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “My dear Blunt, I desire you to undertake this, because of your superior strength of mind. I am well aware of my own deficiency in that respect.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, well, have it as you will. I won’t trouble you to assign reasons for throwing business into my hands. I sha’n’t let any scruples stand between me and my own interest. Where’s the note!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “One thing more,” said Sharp, slowly unclasping the wallet which contained the note. “This man—Robert Ford—thinks I lent him the money on my own responsibility, and naturally regards me as a firm friend. I called on him yesterday, and hinted that I had been forced to raise money to meet a pressing engagement, and had given up this note as collateral, on condition that it should not be presented. Very probably he may mention this. I don’t wish him to suspect that there is any understanding between us, as it will destroy what little influence I may have over him. You will be kind enough, therefore, to say nothing to undeceive him on that point, and if you could make it convenient to abuse me a little, just to show that there is no collusion between us, I should regard it as a particular favor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Abuse you! I will do it with the greatest pleasure in the world.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I knew it, my dear Blunt; it was what I expected of your friendship. But I must give you his direction. Have you all necessary instructions?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have not told me what I am to seize on execution?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very true, an important omission. You must know that 151this Ford, an estimable man, by the way, has taken a fancy to invent a flying machine, and to that end has collected an odd jumble of machinery. This is what I wish you to seize. Here is the address.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And where am I to bring it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You may as well bring it here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How unfortunate that you cannot complete the invention,” said Blunt, dryly. “If it is just as convenient I shouldn’t mind receiving the pay in advance; not,” he continued, with a pointed imitation of his companion’s manner,—“not that I doubt in the least your high-souled integrity, my dear Sharp, but simply because, just at present, singularly enough, I happen to be out of cash.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall be most happy to discharge your claim forthwith,” said Sharp, rather ostentatiously displaying a roll of bills, and placing a five in the hands of his agent.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Blunt examined the bill with some minuteness, a sudden suspicion having entered his mind as to its genuineness. Satisfied on this point, he slipped it into his vest pocket, saying, “All right, you shall hear from me in the course of the day.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n An hour afterwards a loud authoritative knock aroused Robert Ford, who, it is needless to say, was employed after his usual fashion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come in!”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The invitation was quickly accepted by a shock-headed man, stout and burly, who without ceremony drew out a note, and said, abruptly, “You are Robert Ford, I presume?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is my name, sir,” said the inventor, in some surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well. Here is a note with your signature, payable on demand. I presume it will be perfectly convenient for you to pay it now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Ford took the note with an absent air, and said, 152glancing at the man before him, “Excuse me, but I do not recollect having seen you before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very probably,” said Blunt, with sang froid. “We never had the pleasure of meeting before.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then,” said the inventor, “how comes it that you have a demand against me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you will take the trouble to examine the note, you will find that it comes through a third person, Richard Sharp. You probably remember him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I know him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Ford glanced at the paper in his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think there must be some mistake,” he said. “The sum should be two hundred dollars, not three.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is no mistake,” said Blunt, positively. “It is just as he gave it to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Sharp mentioned yesterday,” said Mr. Ford, with a sudden effort at recollection, “that he had parted with this note to some one, but on condition that it should not be presented. You had better see him about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have nothing further to do with him,” replied Blunt, “I believe he did mention something of the kind; but of course he cannot expect me to keep this note when I want the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, sir,” said Mr. Ford, “if, as you admit, Mr. Sharp made this condition, it is incumbent on you, as a man of honor, to keep it. I am sure it is very far from Mr. Sharp’s intention to trouble me for the payment of a sum which he loaned without the expectation of immediate repayment. I should wrong his disinterested generosity by harboring such a suspicion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “His disinterested generosity!” repeated Blunt, with a loud laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sir,” said the inventor, with calm dignity, “I must request you to forbear insinuating by word or manner anything 153derogatory to a man who has proved himself my benefactor, and, solely impelled by his interest in science, has offered me the aid of his purse, without even an application on my part.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well,” said Blunt, “although it’s rather amusing to me to hear Sharp spoken of as interested in science, I won’t quarrel with your opinion of him, especially as his character isn’t in question just now. The main point is, can you pay this note?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I cannot.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I shall be under the disagreeable necessity of calling two of my friends in waiting.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Two Irishmen, who appeared to have been waiting outside, entered at Blunt’s call.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take that machinery,” said Blunt, in a tone of command, “and carry it down stairs.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stay!” said Mr. Ford, in alarm; “what do you intend to do?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am only acting in self-defence,” said Blunt, doggedly. “You cannot pay your money. If I can’t get my pay in one way, I must in another; therefore, I take this machinery of yours in execution.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The thought of this calamity nearly overcame Mr. Ford. He did not pause to consider whether the seizure was legal or illegal, but, in an agitated voice, urged, “Take everything else, but spare me this. It is to me of inestimable value,—greater than you can possibly imagine.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s the very reason I take it,” said Blunt. “All the rest of your trumpery,” glancing contemptuously at the plain furniture, “wouldn’t be worth carrying away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “At least,” implored the inventor, “wait till to-morrow, till I can see Mr. Sharp.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And where would you be?” sneered Blunt. “Don’t 154think to catch me with such chaff; I’m too old a bird. I will take it while it is here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But,” urged Mr. Ford, “it can be of little value to you. You cannot sell it for one quarter of the debt.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps not. But that isn’t what I take it for.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “What then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “As a pledge for its final payment. I care nothing for the trumpery, while you, I know, do. When you come forward and pay the note, you shall have it back again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you promise that?” asked the inventor, more cheerfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will agree to wait a reasonable time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Little ceremony was used in the removal of the complicated machinery. Within ten minutes, all that had so fully occupied the thoughts of Mr. Ford, and furnished the pleasure and the occupation of his quiet life, was swept away, and he was left alone. That the labor was to no purpose, and the hopes which he cherished vain, imported little. To him, at least, they were realities, and upon them he had built a dazzling superstructure, which now suddenly crumbled into pieces at his feet.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Lewis Rand’s triumph was thus far complete.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2975/81977.html","bookId":348,"creation":"Aug 5, 2019 5:45:47 AM","modification":"Aug 5, 2019 5:45:47 AM"}
