{"id":34579,"no":32,"title":"CHAPTER XXXII. MARGARET’S SECOND FLIGHT.","content":"\u0026nbsp;Margaret lay sick for many weeks in her mother’s cottage, where, it will be remembered, she took refuge when, maddened by the discovery of Jacob’s falsehood, she fled from him, heedless of the fury of the elements. Physical exhaustion and mental excitement brought on a raging fever, attended by almost constant delirium. Her mother watched by her bedside with an affection that never tired. For a time it was doubtful what would be the issue. Margaret’s life trembled in the balance, and it required but little to incline it either way. Fortunately for Margaret, however, her constitution was naturally a strong one, and its native vigor triumphed at length over the assaults of disease, fierce though they had been. The fever spent its force, and she became rapidly better, though at first scarcely stronger than an infant. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The first indication of her amendment was her recognition of her mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The old lady was sitting in a rocking-chair beside the bed, when Margaret lifted her head from the pillow, and said, in a tone of curiosity,—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who are you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who am I?” inquired her mother. “Don’t you know me, Margaret?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You look some like my mother. Are you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Margaret, I am your own mother, who loves you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 204“I believe you are. How long have I been sick, mother?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is—let me see,” said the old lady, reflectively. “It must be six weeks. Yes, it will be six to-morrow.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “And for six weeks I have been confined to this room and this bed?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, my child.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do not call me child, mother. All the beauty and bloom of childhood, all its happy hopes and trustful spirit, have gone forever. There are some who are children all their lives. But I—it seems a great while since I was a child.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The simple old lady did not comprehend her daughter’s meaning. She understood her words literally.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, you are young yet, Margaret.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Young! don’t call me young, mother. I am older than you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Older than I?” said the old lady, who fancied Margaret’s brain a little disordered, and sought to restore it by reasoning; “but you know a child cannot be older than its mother. You are but thirty-seven, while I am seventy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t mean older in years, mother. Older in suffering, older in the experience of life. It isn’t years that make us old, mother, but our own passions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was uttered half in soliloquy.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid you will hurt yourself by talking, Margaret. You had better go to sleep; or would you like some gruel?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, mother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was silence for a few minutes. During this time Margaret was scanning attentively the little room and its furniture. Nothing could be plainer, and yet more comfortable. There was a rag carpet on the floor, and a few plain articles of furniture scattered about the room; there was a 205small clock on the mantel, whose drowsy ticking could be distinctly heard, so free was the neighborhood from noises of every description. It was such a retreat as the old would like for its quiet, while they would not be troubled by its monotony and lack of excitement. But Margaret was too impetuous and excitable to feel it otherwise than oppressive.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long have you lived here, mother?” she asked abruptly, after a silence of some minutes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seven years, Margaret; seven years come fall.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Seven years! seven years, mother! I should think you would have died of solitude long ago. You haven’t any neighbors, have you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “None very near. None that I go to see. I do not care to visit. Tabby, here, is company for me. Ain’t you, Tabby?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The large cat, that was lying at the other end of the room, rose at this appeal, and after stretching herself in a way to show her extraordinary size, walked slowly across the room, and submitted herself, with an appearance of pleasure, to the old lady’s caresses.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “See, Margaret; she answers for herself,” as the cat, in recognition of the attention shown her, purred loudly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know but you are right in choosing such a friend,” said Margaret, after a thoughtful pause. “She will treat you well as long as you do not abuse her. That cannot be said of all human friends. Yet I should not be able to live six months as you do, mother. My temperament needs excitement.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I fear it has not always brought you good, Margaret,” said the old lady, who could ill comprehend the turbulent spirit which her daughter inherited from a father of mixed French and Irish blood.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 206One afternoon a week later, Margaret, after turning restlessly for some minutes, asked her mother if she had not a newspaper in the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I get tired looking at the cat,” she exclaimed; “I want something else to think of.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know,” said the old lady, hesitatingly. “I don’t take a paper; but perhaps I can find one that came round a bundle, if that will do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, mother, anything. It don’t matter what.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After diligent search, the old lady managed to discover part of a last week’s daily paper that had come round a package which she had recently bought. Apologizing for the unsatisfactory result of her search, she placed it in Margaret’s hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In general, there is nothing very interesting in an old daily paper; but Margaret, who had been shut out from the world for nearly two months, and knew nothing of what had transpired during that time, seized the fragment with avidity, and read it entire, even to the advertisements. Finally her glance wandered to the deaths; she started as she met the name of Rand.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Died. At his residence in Fifth Avenue, Gerald Rand, Esq., 71.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He’s dead, then, at last,” she murmured, “and Jacob Wynne has got the thousand dollars which were promised him. Let him enjoy it while he may. It will not be long, unless,—but I must see him before I take any decisive step. He may have said what he did only to provoke me. Would to heaven it were so! Yes, I must see him; I must give him one more chance, and then, if he still scorns me,” this she said with fierce emphasis, “let him look to himself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 207“What have you read that excites you so much, Margaret?” questioned her mother, anxiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing particular.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You frightened me when you spoke so fiercely.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did I?” said Margaret. “I was only talking to myself. It’s a way I have. But, mother,” she continued, changing her tone suddenly, “do you think I shall be well enough to go out to-morrow?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-morrow!” repeated the old lady, lifting up both hands in extreme astonishment; “why, you must be raving crazy to think of such a thing! What in the world do you want to go out for?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Never mind now,” said her daughter, evasively. “I thought I should like to go out. But I suppose I am weaker than I think for.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, the fever has only just left you. It would be death to think of leaving the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “We won’t say anything more about it, mother. Only I get tired of staying in the same place so long. The time moves so slowly. What time is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Three o’clock.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It has been three for the last hour,” said Margaret, with a touch of impatience in her tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I declare the clock has stopped,” said the old lady, adjusting her spectacles; “I must have forgotten to wind it up. I declare it’s most time to get tea.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She filled the tea-kettle, and set it over the fire, Margaret looking on with languid attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her mother thought that Margaret had given up the idea of leaving the house. It was only an invalid’s fancy, she thought. But Margaret had a purpose in view, and only deferred carrying it out till her weakness had somewhat abated. On the third day, though still far from strong, she determined to leave the house. Knowing that her mother 208would never consent, she devised a stratagem to get her out of the way.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is there an orange in the house?” she asked, immediately after breakfast.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Margaret.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sorry; I think I could relish one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can get one at the store.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But that is a good ways off. Isn’t it, mother?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only quarter of a mile.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is too far for you to go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Too far? I go there several times a week, Margaret.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then if it will not be too much trouble, I should really like to have you go.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will go immediately. Isn’t there anything else you would like?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nothing, mother.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “God forgive me for deceiving her!” thought Margaret. “But I cannot do otherwise. He knows that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Scarcely was her mother out of the house than Margaret hastily rose from the bed, and with trembling fingers arrayed herself in the garments which had been so long laid aside. They had been carefully washed and mended by her mother, so that they looked comparatively respectable. She threw them on very hastily, fearing that her mother would return and detect her. She saw half a dollar on the mantel. This also she took, knowing that she should need money, and left the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When her mother returned with the orange she found, to her dismay, that her daughter had disappeared. On the table there was a scrap of paper, with these words traced hurriedly upon it:—\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Forgive the artifice I have employed, dear mother. I knew you would not let me go, and I must. There is 209something of great importance that I must attend to without delay. When that is over, I may come back to you.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Margaret.\n\u003c/div\u003e \n\u003cdiv\u003e\n “P. S. I took a half dollar from the mantel, as I may need it.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2975/81986.html","bookId":348,"creation":"Aug 5, 2019 5:45:47 AM","modification":"Aug 5, 2019 5:45:47 AM"}
