{"id":34556,"no":9,"title":"CHAPTER IX. THE LAWYER’S PROGRESS.","content":"\u0026nbsp;The day after his meeting with Helen and her father, the worthy attorney, Mr. Sharp, took his way leisurely to the boarding-house of Mrs. Morton. Although the object of his visit was clearly defined to his own mind, he scarcely knew in what manner he might best attain it. But Mr. Sharp was not a man to be abashed or daunted by small difficulties. Trusting, therefore, to what chance and the inspiration of the moment might suggest, he mounted the steps and rang the bell. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mrs. Morton, I presume,” he remarked, with great affability, as that lady opened the door in person.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are quite right, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I believe,” he remarked with suavity, “that I am correct in the supposition that you take boarders.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what he’s aiming at,” thought Mother Morton, glancing with something of suspicion at the white hat set jauntily on one side of his head. “I hope he won’t apply for board. I am always suspicious of those who are so smooth-tongued.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir,” she said aloud, “I do take boarders, but I am full now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed!” said Mr. Sharp, with a benignant smile, “I am delighted to hear of your prosperity. I was not, however, thinking of making an application for board in my own behalf, though I should undoubtedly esteem it a high privilege to be an inmate of a boarding-house which I am confident 57is so admirably conducted. Will you have the goodness to tell me whether you have a boarder or lodger named Dupont?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It is scarcely necessary to explain that this inquiry was employed by Mr. Sharp as a plausible method of accounting for his calling, and to pave the way for something else. He had no particular choice in the name, but thought Dupont would be as uncommon as any.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” was the unexpected reply of Mrs. Morton, “we have a lodger of that name. I believe he is in. Will you step in and see him, sir?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Unprepared for this answer, Mr. Sharp was for the moment undecided how to act. Being sufficiently quick-witted, however, he soon devised a way to extricate himself from his embarrassment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Poor man!” said he with a gentle sigh; “he’s much to be pitied.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pitied!” echoed the landlady, opening wide her eyes in astonishment. “Why?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “To a sensitive mind,” continued Mr. Sharp, in a tone of mild pathos, “bodily deformity must be a great drawback to one’s comfort and happiness.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Deformity!” repeated the landlady in increased surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Mr. Dupont is a humpback, is he not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A humpback!” returned Mrs. Morton, in a tone of some asperity. “You are quite mistaken, sir; I have no humpback among my boarders.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it cannot be the man I mean,” said the lawyer, rejoiced to have got out of the scrape so cleverly. “I beg ten thousand pardons for having put you to so much trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No trouble, sir,” was the civil reply.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Morton held the door, wondering why the visitor still remained, now that his errand was accomplished. The 58lawyer’s purpose, however, still remained to be effected. He was even now cudgelling his brains to devise a method of reaching it.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “A moment more,” he said, with suavity. “I think, as I passed last evening, that I saw a little girl enter with an elderly gentleman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Helen Ford?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes. She boards with you, does she not?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Helen and her father have a room up stairs. They board themselves. I only lodge them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pardon my curiosity, but I have an object in view. What is her father’s occupation?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is busy about some invention, and has been ever since he came here. A flying machine, I believe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, yes,” said the lawyer, to whom this was all new. “It is as I supposed. Can I see them? I picked up a small purse,” he added, by way of explanation, “just after they passed me in the street, and I thought it not unlikely that the young lady might have dropped it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly,” said the landlady, somewhat more favorably disposed to Mr. Sharp, in consequence of this evidence of his integrity. “Their room is on the fourth floor, at the head of the stairs. Perhaps I had better go up and show you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, by no means, madam, by no means,” said the lawyer, politely. “I know the value of your time, and would on no account subject you to so much unnecessary trouble. I shall easily find it from your directions.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Helen was looking out of the window, and her father was busied as usual, when a low tap was heard at the door.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Supposing it was Martha, who, in fact, with the exception of the landlady, was her only visitor, she cried, “Come in,” and then creeping softly to the door, jumped out playfully upon the one who entered. Her dismay may readily be 59conceived when, instead of the quiet seamstress, she found that she had narrowly escaped jumping into the arms of a tall man with a white hat.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am very sorry,—I did not know,—I thought it was Martha,” she faltered, in great confusion, her cheeks dyed with blushes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t apologize, I beg of you,” said the stranger, courteously. “It is I, on the contrary, who should apologize for intruding upon you, and,” he added, glancing to the corner of the room, “upon your respected parent. I am not mistaken,” he added, inquiringly, “in supposing him to be your father?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” said Helen, who, without understanding why, felt a little ill at ease from the elaborate politeness of her visitor.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I have not yet disclosed the motive of my visit. I chanced to be walking behind you and your father yesterday in the afternoon. You walked out at that time?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought I could not be mistaken. There are some countenances, my dear young lady, that we are not likely to forget.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Helen, unused as she was to flattery, did not understand that this was meant for a compliment. Therefore it quite failed of its effect. Perhaps this was quite as well, since, if understood, it would have confused rather than pleased her. She was too deficient in vanity to have felt flattered by a compliment from a stranger. Yet no one was more desirous of winning the approval of those whose friendship she valued. Helen was, in short, a truthful, unsophisticated child, perfectly transparent and straightforward, and imagined that others were equally so. So she only waited patiently for Mr. Sharp to announce the object of his call.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n 60“Afterwards I discovered this purse on the sidewalk,” continued the lawyer, displaying his own purse. “As you and your father had just passed, I conjectured that one or the other of you must have dropped it. I have, accordingly, called this morning to ascertain if I am correct in my supposition, and if so, to return the purse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” said Helen, shaking her head. “It cannot be ours.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I must seek farther for the owner. I beg you will pardon me for this intrusion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Helen said, rather awkwardly, that it was of no consequence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “May I inquire,” said Mr. Sharp, as if the idea suddenly struck him, “whether your father is not an inventor? I think I was told so by the very respectable lady down stairs.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” said Helen, more at her ease. “Papa has been busy a great while about his invention. It requires a great deal of time and patience.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Indeed! Would it be taking too great a liberty to inquire the nature of the proposed invention?”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is a flying machine,” said Helen. “Some people laugh at it,” she added, a little hurriedly. “It seems strange to them because they have never thought much about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let them laugh,” said Mr. Sharp, with warmth. “Let them laugh, my dear young lady,” he repeated in a tone of profound sympathy. “It is the way of the world. There has never been any great discovery or invention, from the earliest ages to the present time, that has not encountered ridicule. Wait till success crowns your father’s exertions, and then you will see how all will be changed.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “So papa thinks,” said Helen, quite grateful to the lawyer for his words of encouragement; “and it is that which makes him labor so patiently.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Undoubtedly. Would it be too great a liberty to ask 61permission to examine your father’s invention. It is a subject in which I feel a very deep interest. Indeed, I may say that I am something of an inventor myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Poor confiding Helen! How could she imagine that these words of sympathy covered an unblushing falsehood?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Papa will be very glad to show it to you,” she said. Then to her father: “Papa, this gentleman would like to examine your model.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly,” said Mr. Ford, courteously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This was a subject on which, despite his taciturnity, he could talk fluently. Mr. Sharp listened with an appearance of profound attention, occasionally asking a question, and remarking modestly that he had once entered upon a similar train of investigation, but that the imperative claims of business had brought it to an abrupt termination.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have not by any means,” he concluded, “lost my interest in scientific matters; and it would afford me great pleasure if you will permit me occasionally to look in upon you and note your progress. I dare not hope that I could offer any suggestions likely to be of service to one so far my superior in scientific attainments, but should it be in my power to aid you in any way, you can count on me with confidence.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Ford felt flattered, as was but natural, by this evidence of interest in his pursuits, and cordially invited Mr. Sharp to call whenever he found it convenient.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, Sharp,” said that gentleman, apostrophizing himself, as he made his way down stairs, “you’ve done well, old fellow, though at one time I trembled for you. You’ve flattered your way into the good graces of that chimerical old fool, and now you are in a fair way to accomplish something more, if needful.”\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next day found him closeted with Lewis Rand, from whom he received instructions as to his future course.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2975/81963.html","bookId":348,"creation":"Aug 5, 2019 5:45:47 AM","modification":"Aug 5, 2019 5:45:47 AM"}
