{"id":73439,"no":11,"title":"Page 11","content":"\u003cp\u003e“Come on, boy,” she soothed as she stepped through the French doors. Her heart lurched when she saw a dark shape reclined in a lawn chair. A curl of smoke wound to the trees, as eerie as a witch’s bent finger.\u003c/p\u003e\n\u003cp\u003e“Sutton?” a familiar raspy voice said.\u003c/p\u003e\n\u003cp\u003eEmma blinked, her eyes adjusting to the darkness. “Grandma.” She let go of Drake’s collar and he trotted across the lawn to sniff a cluster of azaleas.\u003c/p\u003e\n\u003cp\u003e“Who did you think it was? God?” Grandma Mercer waved her cigarette, motioning Emma forward. “Sit down.” Grandma Mercer made room for Emma on the end of her dark green lawn chair.\u003c/p\u003e\n\u003cp\u003eEmma reluctantly sat. To her surprise, Grandma proffered her pack of Merits. “Want one?”\u003c/p\u003e\n\u003cp\u003eEmma’s nose wrinkled. She’d always hated the smell of cigarette smoke. But would Sutton have said yes? “Um, I have a sore throat,” she lied. Then she cocked her head. “Why aren’t you with Mom and Dad?”\u003c/p\u003e\n\u003cp\u003e“They were meeting up with the Finches,” Sutton’s grandmother said, then made a face. “It’s such a chore seeing those people. They’re always trying to set me up with that awful woman’s widowed father. I may be old, but I can find my own dates, thank you very much.”\u003c/p\u003e\n\u003cp\u003eShe pinched her cigarette between wrinkled fingers and leveled a long look at Emma. “Sooo,” she said slowly, stretching the word out. “Are you really not going to say anything about my—what did you call it last time? ‘Filthy little habit that will kill you and age your skin prematurely’?”\u003c/p\u003e\n\u003cp\u003eEmma laughed out loud. That did sound like something her twin would say—and it was nice to know Sutton wasn’t a smoker either. “Nah. I’ve turned over a new leaf. Live and let live. Or in your case, live until smoking kills you,” she said with a wry smile.\u003c/p\u003e\n\u003cp\u003eGrandma Mercer tapped the ash in a glass she was using as an ashtray. “Sounds good to me. So, Sutton. How’s the college search going?” She crossed her legs. “Are you even going to college next year?”\u003c/p\u003e\n\u003cp\u003e“Um,” Emma stalled. Something about the question hit her in the gut and she suddenly found it hard to breathe. She’d never seen anything in Sutton’s belongings having to do with college visits or applications. Sutton had all the opportunities in the world, and yet she wasn’t taking advantage of any of them.\u003c/p\u003e\n\u003cp\u003eHey, not all of us were made for college. Maybe I had plans to become a big Hollywood actress.\u003c/p\u003e\n\u003cp\u003e“I’m just trying to keep my options open,” Emma finally said. “But I’m applying to loads of good schools.”\u003c/p\u003e\n\u003cp\u003e“Really?” Grandma Mercer asked, cocking a silver eyebrow. “Are you planning to stay in Arizona?”\u003c/p\u003e\n\u003cp\u003e“The U of A is good,” she said quietly. Ironically, the University of Arizona was one of the colleges she had begun applying to back when she lived in Vegas. They offered a lot of scholarships, and she liked their program in journalism. But the financial aid forms had to be way past due by now. Would she ever get to go back to that old life? Or would she have to apply to schools as Sutton Mercer? Could she do something like that? Living in Sutton’s room and taking her high school classes was one thing. But attending college on the Mercers’ dime, continuing to pretend she was Sutton in the dorms, felt different somehow. And the idea that Sutton’s murder would still be unsolved by then was unfathomable.\u003c/p\u003e\n\u003cp\u003eGrandma wrinkled her nose. “The U of A has a good sorority life, you mean. Life’s more than partying, you know.”\u003c/p\u003e\n\u003cp\u003eEmma stared at her sandals. “Trust me. I know.”\u003c/p\u003e\n\u003cp\u003eGrandma Mercer tapped her cigarette on the lawn chair’s handrail, a pensive look on her lined face. “Your father used to love a good party,” she said, sighing. “He’s a California boy at heart. But he and your mother quieted down quite a bit when they moved to Tucson.” She sniffed. “Of course, his job was worth relocating for.”\u003c/p\u003e\n\u003cp\u003e“They lived in California before Tucson?” Emma asked, unable to hide her surprise. The Mercers had never said anything either way, but they were so entrenched in the community here she’d just assumed they’d been here forever.\u003c/p\u003e\n\u003cp\u003eGrandma gave her a crazy look. “Well of course they did. They moved here just after they adopted you.”\u003c/p\u003e\n\u003cp\u003e“Oh, right. Duh,” Emma said faintly. It was strange to think that they’d once had an entirely different life.\u003c/p\u003e\n\u003cp\u003eGrandma sighed. “I’ve always missed them being right down the road from me. We used to have so much fun when Sutton was still alive.”\u003c/p\u003e\n\u003cp\u003eEmma’s heart clenched. Had she heard the old woman right?\u003c/p\u003e\n\u003cp\u003eI waited with bated breath. Grandma had said Sutton. Me.\u003c/p\u003e\n\u003cp\u003e“My sister loved babies,” Grandma Mercer went on, her thin lips breaking into a grin. “And she especially loved you. She fawned over you. Called you her little namesake.”\u003c/p\u003e\n\u003cp\u003eEmma’s eyes flicked back and forth as the words slowly sank in. The Sutton Grandma was talking about wasn’t her twin. Sutton was named after Grandma Mercer’s sister, her great-aunt.\u003c/p\u003e\n\u003cp\u003eGrandma reached for her martini glass and took a long sip. “If we lived closer, I could’ve kept a better eye on you—and kept you out of trouble. Your parents were always far too lenient. A few more weekends with me would have knocked the sass right out of you.” She glanced at Emma. But after a moment, her eyes softened and she laid her hand over Emma’s. Emma smiled, not expecting this tiny gesture of kindness.\u003c/p\u003e\n\u003cp\u003eGrandma pursed her lips, like there was something more she wanted to say but couldn’t quite find the words. “Anyway,” she said, her voice stern again as she removed her hand.\u003c/p\u003e\n\u003cp\u003e“Anyway,” Emma echoed, feeling awkward once more.\u003c/p\u003e\n\u003cp\u003eDrake raised his head and stared at the door, letting out a low whine. Emma swung around to follow his gaze. Laurel stood just behind the French doors leading into the kitchen, watching Emma and Grandma.\u003c/p\u003e\n\u003cp\u003eGrandma Mercer waved. “Guess your sister’s home.”\u003c/p\u003e\n\u003cp\u003eCaught, Laurel tossed a casual wave back, then retreated from sight. A moment later the light in her bedroom window snapped on.\u003c/p\u003e\n\u003cp\u003eGrandma Mercer tutted, then stubbed out her cigarette. “I hope Laurel didn’t see the smoke. Unlike you, I can’t trust her to keep a secret.”\u003c/p\u003e\n\u003cp\u003eEmma watched Laurel’s shadow moving around in the bedroom. “Actually, Laurel’s got a few secrets of her own,” she murmured. “You’d be surprised what she’s capable of.”\u003c/p\u003e\n\u003cp\u003eLike murdering her own sister, I thought grimly.\u003c/p\u003e\n\u003cp\u003e11\u003c/p\u003e\n\u003cp\u003eTOO HOT TO HANDLE\u003c/p\u003e\n\u003cp\u003eThe next evening, Emma stood in the parking lot of Clayton Resort. The low-lying, ultramodern red clay buildings were all lit up, seamlessly melting into the mountain backdrop. All around her was an undulating, impossibly green golf course, the flags rippling in the slight wind. Several sprinklers came on at once, misting the grassy areas. Two swimmers bobbed in the deep end of the horseshoe-shaped pool to the right, talking quietly. Everything looked so romantic and pristine, with not a detail out of place.\u003c/p\u003e\n\u003cp\u003eShe heard a slam behind her, and turned to see Charlotte, Madeline, and the Twitter Twins climbing from Madeline’s SUV. “I always say it’s best to plan a prank while trespassing,” Lili whispered with a smirk. Her hot-pink bikini poked out from beneath a too-tight white tank top, and she had a purple beach towel tucked under her arm.\u003c/p\u003e\n\u003cp\u003eEmma ran a hand over the light yellow cover-up she’d found in Sutton’s underwear drawer, feeling nervous. The girls were planning the top-secret Lying Game dance tonight, but they were trespassing in the hot springs on the resort property to do so. She would have thought she’d be used to breaking the law by now, but her rule-abiding, good-girl instincts died hard.\u003c/p\u003e\n\u003cp\u003eMy nerves were twisting for a different reason. I knew this place from one of my memories. It was here that my friends dragged me from the springs to the trunk of my car on the night of the snuff film prank, the same night Laurel nearly choked me to death. I’d written that off as a silly prank, but now I wondered. Maybe Laurel had been practicing for the real thing.\u003c/p\u003e\n\u003cp\u003eMadeline took a swig from an Evian bottle as Gabby and Lili trotted ahead. “I already have so many good ideas,” Gabby said over her shoulder.\u003c/p\u003e\n\u003cp\u003e“We should do overly cliché dance themes,” Lili babbled. “For sure we need a punch bowl and a cake that says something like DANCE OFF in pastel icing. And we have to hang tons of streamers.”\u003c/p\u003e\n\u003cp\u003eCharlotte, who was wearing a terry-cloth wrap that cinched under her arms, stopped short and grabbed Emma’s arm. “Where’s Laurel? I thought she was coming with you.”\u003c/p\u003e\n\u003cp\u003eEmma shrugged. “I checked her bedroom before I left, but she wasn’t there.”\u003c/p\u003e\n\u003cp\u003eMadeline bristled. “I bet she’s with my brother.”\u003c/p\u003e\n\u003cp\u003eEmma figured Madeline was right. She’d been trying to corner Thayer all day to ask how long Laurel had been at the hospital, but every time she’d seen him he was with Laurel.\u003c/p\u003e\n\u003cp\u003e“Aw,” Gabby swooned. “Maybe it’s good for Thayer to have a girlfriend.”\u003c/p\u003e\n\u003cp\u003e“Especially if she’s one of us,” Lili added.\u003c/p\u003e\n\u003cp\u003eMadeline shoved aside a tree branch; Emma ducked as it snapped back toward her face. “Thayer doesn’t need a girlfriend right now. He needs to get better.”\u003c/p\u003e\n\u003cp\u003e“Get better?” Lili repeated. “What do you mean?”\u003c/p\u003e\n\u003cp\u003eMadeline clapped her mouth closed. Thayer had told Emma that he’d been in rehab, but she was the only person outside of his family who knew.\u003c/p\u003e\n\u003cp\u003eUnless, of course, he’d told Laurel…\u003c/p\u003e\n\u003cp\u003e“I mean his leg,” Madeline said haltingly. “It needs to heal up.” And that was that.\u003c/p\u003e\n\u003cp\u003e“Hot springs, here we come!” Gabby trilled, pushing aside branches. Ahead of them was a clearing of flat red rocks. Three Jacuzzi-sized pools of natural water bubbled invitingly.\u003c/p\u003e\n\u003cp\u003eI felt a swoop of dread, looking around. Yep, these were the springs all right. That night, I’d gotten pissed at Laurel for wearing a necklace just like my locket, like she was trying to steal my style. She’d claimed later she’d worn it to stage the fight, but clearly she wanted more than my style. She wanted my life.\u003c/p\u003e\n\u003cp\u003eMadeline pulled her ikat-print caftan over her head and set it on a flat rock near the springs. Charlotte kept her towel on and walked tentatively toward the steaming pool. Emma and the Twitter Twins disrobed, too, leaving their stuff in a pile. Lili dipped her big toe into the water and declared the temperature perfect. As she slid in, she shut her eyes and let out an “Mmm.” Emma slipped into the water, too, feeling the warmth envelop her. For a moment, she let her stress float away.\u003c/p\u003e\n\u003cp\u003e“Okay, time to party-plan,” Gabby said, adjusting the gold-tone clasp in the middle of her bikini. “So we’re e-inviting everyone who’s anyone at Hollier, right?”\u003c/p\u003e\n\u003cp\u003e“Except the four people we don’t want,” Madeline said. She pushed her hands over the water, creating tiny ripples.\u003c/p\u003e\n\u003cp\u003e“Maybe we should invite a few cool kids from Wheeler,” Lili suggested.\u003c/p\u003e\n\u003cp\u003e“Like the soccer hotties.” Charlotte, who was sitting on the edge, just dipping her legs in, sounded excited.\u003c/p\u003e\n\u003cp\u003e“Definitely.” Emma drummed her fingers on the rocks. “So if we throw the dance at the school, how are we going to break in after hours once the door is locked?” \u003c/p\u003e","sourceLink":"https://allnovel.net/hide-and-seek-the-lying-game-4/page-11.html","bookId":2396,"creation":"Oct 5, 2019 10:27:54 AM","modification":"Oct 5, 2019 10:27:54 AM"}
