{"id":97578,"no":8,"title":"Page 8","content":"\u003cp\u003eGlass.\u003c/p\u003e\n\u003cp\u003eCurved glass.\u003c/p\u003e\n\u003cp\u003eAnd outside it...\u003c/p\u003e\n\u003cp\u003eGray stone.\u003c/p\u003e\n\u003cp\u003eTunnel walls.\u003c/p\u003e\n\u003cp\u003eClose.\u003c/p\u003e\n\u003cp\u003eOutside curved glass.\u003c/p\u003e\n\u003cp\u003eGromph Baenre, Archmage of Menzoberranzan, stared, unblink-ing, at the rough stone that lay just outside the wall of his prison. He was trapped inside curved glass. In utter silence. Inside a hollow sphere that lay on the floor of an unknown tunnel. Unable to move, unable to breathe, only sluggishly able to think.\u003c/p\u003e\n\u003cp\u003eHe stared at his own reflection, distorted by the concave surface of the glass. His face was coarse but unlined despite his seven cen-turies, thanks to the amulet of eternal youth pinned to hispiwafwi.\u003c/p\u003e\n\u003cp\u003eHis silver-white hair floated loosely around his head, unaffected by the gravity that existed only outside the sphere. His eyes were open and unblinking.\u003c/p\u003e\n\u003cp\u003eGrowing weary of his own face, he stared at the tunnel walls instead, noticing a bright vein of quartz. Noticing how wide it was, how large the crystals.\u003c/p\u003e\n\u003cp\u003eTime passed.\u003c/p\u003e\n\u003cp\u003eA while later - ten cycles, a year? - Gromph felt something tickle his mind.An awareness. A presence. Turning his mind toward it, Gromph sought it out. Struggling like an exhausted man trying to lift his head, he concentrated his will.\u003c/p\u003e\n\u003cp\u003eKyorli?\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eMore time passed.\u003c/p\u003e\n\u003cp\u003eHe stared at the vein of quartz, picking out a crystal within it. By concentrating on its facets - blurred though they were by the concave glass in front of his eyes - he could focus his thoughts.\u003c/p\u003e\n\u003cp\u003eWhat he knew was that he was inside a sphere of glass, the prod-uct of an imprisoning spell.\u003c/p\u003e\n\u003cp\u003eA spell cast by the lichdrow Dyrr.\u003c/p\u003e\n\u003cp\u003eHe was far beneath the city, in an unknown tunnel, encased in a spell that prevented even divination magic from finding him.\u003c/p\u003e\n\u003cp\u003eTrapped.\u003c/p\u003e\n\u003cp\u003eMore time passed. As it trickled by, Gromph tried to open his mouth, to force his eyelids to blink, to twitch his fingers.\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eHad he been able to draw a breath, he would have sighed. But even had he been able to move and speak - to cast a spell - it wouldn\u0027t have helped. The spell the lichdrow had cast on him was a powerful one, and Gromph knew it well. The only way it could be reversed was if a counterspell of equal power was cast on the sphere. And that spell could only be cast fromoutsidethe sphere, by someone else. If that wasn\u0027t difficult enough, the spell would only work if it was cast in the same location that the original imprisonment spell had been cast.\u003c/p\u003e\n\u003cp\u003eGromph recoiled from the irony of it. He was the Archmage of Menzoberranzan, the most powerful wizard in all of the City of Spiders, privy to the arcane workings of more spells than most mages dared dream of. Yet even if he had been able to cast a wish spell, it wouldn\u0027t have done him any good.\u003c/p\u003e\n\u003cp\u003eAfter another length of measureless time had gone by, Gromph felt the tickle in his mind return. It felt closer, more insistent.\u003c/p\u003e\n\u003cp\u003eAs before, it took an excruciating effort for Gromph to concen-trate his will.\u003c/p\u003e\n\u003cp\u003eKyorli?he sent.Help!\u003c/p\u003e\n\u003cp\u003eThe mind-tickle disappeared. Had his body been capable of it, Gromph\u0027s shoulderswould have slumped.\u003c/p\u003e\n\u003cp\u003eAll at once the world spun in a crazy arc. The vein of quartz disappeared and Gromph found the position of his head and feet reversed - though in his state, up and down were concepts that had little meaning. He round himself staring into the eyesor an enor-mous brown rat twice the size of the sphere, its face distorted by the curvature of the glass. Pink paws rested lightly on the top of the sphere, and whiskers twitched as the rat sniffed the cold glass.\u003c/p\u003e\n\u003cp\u003eAfter a sluggish moment, Gromph realized his error in percep-tion. The rat wasn\u0027t enormous, the sphere was tiny. The spell had shrunk him to less than rat size. His thoughts still sluggish, he at last noticed the kink at the end of the rat\u0027s hairless tail.\u003c/p\u003e\n\u003cp\u003eKyorli! Help me. Take me home.\u003c/p\u003e\n\u003cp\u003eGo?the rat replied, more of a feeling than a word.\u003c/p\u003e\n\u003cp\u003eYes, go. To the city. Go.\u003c/p\u003e\n\u003cp\u003eThe world spun crazily by. Gromph could see stone walls spin-ning past, could see them bump crazily up and down as the sphere, propelled by Kyorli\u0027s nose and paws, rolled along the uneven floor of the tunnel.\u003c/p\u003e\n\u003cp\u003eNo, not a tunnel but a tiny fissure in the rock. No more than a rat-sized crack.\u003c/p\u003e\n\u003cp\u003eThe walls continued to spin past. For a moment, the world opened up into looming darkness as Kyorli rolled the sphere across the floor of an enormous cavern. In the distance, Gromph saw a flash of lavender light: the visible spectrum of afaerzress. Then the patch of magical radiation was behind them, swallowed by darkness.\u003c/p\u003e\n\u003cp\u003eThe sphere rattled on, Gromph suspended unmoving at its cen-ter, enclosed in absolute silence.\u003c/p\u003e\n\u003cp\u003eA short time later, the sphere bounced to a stop against a wall.\u003c/p\u003e\n\u003cp\u003eWhat\u0027s wrong?Gromph asked.\u003c/p\u003e\n\u003cp\u003eKyorli\u0027s paws scrabbledagainst the sphere, turning it. Gromph found himself looking up at the wall of the cavern, where - several paces overhead - the tunnel continued through a wide crack.\u003c/p\u003e\n\u003cp\u003eUp! Kyorli\"said.\"City.\u003c/p\u003e\n\u003cp\u003eThe rat scurried up the wall, then down it again. Gromph\u0027s world tilted wildly as paws scrabbled uselessly against the outside of the sphere, spinning it around. After a moment, Kyorli scrambled back up the wall, entering the tunnel briefly, then came down again.\u003c/p\u003e\n\u003cp\u003eGromph realized he\u0027d been overestimating his familiar. Kyorli was only a rat - with no more than a rat\u0027s intelligence.\u003c/p\u003e\n\u003cp\u003eTry a different way,he suggested.\u003c/p\u003e\n\u003cp\u003eKyorli stared at him, whiskers twitching. Then, bobbing her head in a rat\u0027s equivalent of a nod, she began moving the sphere again. Gromph found himself rolled back down the tunnel they\u0027d just come along, across the cavern with the glowingfaerzress,and down another tunnel.\u003c/p\u003e\n\u003cp\u003eWhen the sphere stopped rolling again, Gromph found him-self staring at a river. Only a dozen paces wide but swiftly flowing. Gromph\u0027s hopes rose as he recognized it. He\u0027d traveled through that tunnel once before, years past. The waterway was one of the subter-ranean tributaries of the River Surbrin. It eventually flowed into Donigarten, the lake that was Menzoberranzan\u0027s water supply.\u003c/p\u003e\n\u003cp\u003eBut it flowed through an airless tunnel. If Kyorli tried to fol-low the sphere, she would drown. She could roll the sphere into the river and let the water carry Gromph to the city, but by the time she found her own way back to Menzoberranzan, the sphere might have been carried out of the lake again, down into the river\u0027s lower reaches. Gromph might wind up in an even worse position than before.\u003c/p\u003e\n\u003cp\u003eHe considered the problem, though slowly. His thoughts were still a near-stagnant puddle. After several long moments, during which Kyorli disappeared from sight and reappeared again half a dozen times, a thought came to him.\u003c/p\u003e\n\u003cp\u003eThefaerzress. The magical energies emitted by afaerzress were unstable, unpredictable in their effect. They might do strange things to Gromph, even kill him. But perhaps, if luck was with him, they might first mutate the effects of the spell that bound him.\u003c/p\u003e\n\u003cp\u003eTake me back to the cavern. The one with the glow.\u003c/p\u003e\n\u003cp\u003eThe world spun around him as Kyorli complied. The glow reap-peared, and the sphere rolled to a stop.\u003c/p\u003e\n\u003cp\u003eCloser.\u003c/p\u003e\n\u003cp\u003eThe lavender glow grew larger, brighter.\u003c/p\u003e\n\u003cp\u003eCloser.\u003c/p\u003e\n\u003cp\u003eThe glow expanded until it filled Gromph\u0027s peripheral vision.\u003c/p\u003e\n\u003cp\u003eCloser.\u003c/p\u003e\n\u003cp\u003eKyorli hesitated, nose twitching.\u003c/p\u003e\n\u003cp\u003eDanger,she sent.Too bright. Hurts.\u003c/p\u003e\n\u003cp\u003eYes,Gromph answered.Iknow. Then, giving his thought all of the authority of his will, he added one word more:Closer.\u003c/p\u003e\n\u003cp\u003eKyorli gave the sphere a final shove, then scampered away, terrified.\u003c/p\u003e\n\u003cp\u003eAs the sphere rolled and bumped along the uneven cavern floor, the glow spun closer. When the sphere came to rest, the glow sur-rounded it on every side. Still rigid, Gromph basked in the wash of magical radiation. Thefaerzress would either kill him or ...\u003c/p\u003e\n\u003cp\u003eHis muscles exploded with agony as sensation and movement returned. Chuckling with delight, he rose to his feet. The sphere rocked beneath him, forcing him to catch his balance. He reached into the pocket of hispiwafwiand pulled out a small chip of mica. Tossing it casually at his feet, he spoke the word that should have activated a shattering spell. Nothing happened. He might be able to move and speak, but spellcasting was impossible while he was trapped within the sphere. He\u0027d have to rely upon brute force to get to where he needed to be.\u003c/p\u003e\n\u003cp\u003eExperimenting, he threw his weightforward against the smooth surface - and wound up tumbling in a clumsy somersault as the sphere rolled in that direction.\u003c/p\u003e\n\u003cp\u003eIt took some doing, but at last Gromph figured out how to co-ordinate his hands and feet, scrambling forward like a rat and main-taining his balance as the sphere rolled across the floor. More than once, a bump or crack in the floor sent him spinning in the wrong direction, but gradually, acquiring several painful bruises along the way, he made his way back down the tunnel that led to the river.\u003c/p\u003e\n\u003cp\u003eKyorli, having overcome her fear now that her master was no lon-ger inside the bright wash of the faerzress, scampered along behind, from time to time correcting the course of the sphere with a nudge of her nose or paws. When they reached the swiftly flowing river, she fretted, running hack and forth on its bank.\u003c/p\u003e\n\u003cp\u003eMaster. Deep water. Swim?\u003c/p\u003e\n\u003cp\u003eNo, Kyorli. Only I will swim. You return to Menzoberranzan the way you came, through the tunnel that leads up. Go to Sorcere, fetch any of the wizards there, and lead them to the shore of the lake.\u003c/p\u003e\n\u003cp\u003eThe rat thought about that a moment, whiskers twitching. Gromph raised his hand, pressing his palm lightly against the inner surface of the sphere. Kyorli pressed her nose briefly to the spot, then turned and was gone.\u003c/p\u003e\n\u003cp\u003eGromph drew a deep breath, preparing for the plunge into the river. Then he chuckled. No need to hold his breath - the magic of the sphere was obviously still sustaining him, or he\u0027d have suffocated long ago in the tiny, confined space. Rocking the sphere forward, he plunged into the river.\u003c/p\u003e\n\u003cp\u003eOnce again the world spun around him, then there was water, the bump of stone walls that sent him reeling, and the occasional flash of a luminescent fish. After some time underwater - how long, Gromph still had no way of measuring, but several miles of tunnel must have swept past - he was thrown against the bottom of the sphere. It was rising rapidly, like a bubble, then it burst up through the water, bobbing on the surface of a large lake.\u003c/p\u003e\n\u003cp\u003eHe\u0027d done it! He\u0027d reached Donigarten!\u003c/p\u003e\n\u003cp\u003eRighting himself, Gromph attempted to continue as he had before, by rolling the sphere across the surface of the lake. But the sphere only spun in place. Realizing that he\u0027d made a potentially fatal error, Gromph cursed. Unless Kyorli made it back to Men-zoberranzan in time and swam out into the lake to help him, he would be at the mercy of the current. Gromph sent out a silent call but heard no answering voice. With a heavy sigh, he braced himself inside the rocking sphere, waiting to see where the current would carry him.\u003c/p\u003e\n\u003cp\u003eHe\u0027d surfaced near the northeastern tip of the island that lay at the center of the lake. Herds of rothe milled aimlessly on its banks. Behind the island, Gromph could make out the glowing spire of Narbondel. Someone had been casting magical fire into the enor-mous, natural rock pillar in Gromph\u0027s absence to mark the start of Menzoberranzan\u0027s \"day,\" but for how long? Had he been gone for a month, a year?\u003c/p\u003e\n\u003cp\u003eAs the sphere drifted closer to the island, Gromph once again tried to contact Kyorli but without success. Had the rat simply not had enough time yet to reach the city? Or was something else delaying her? When the lichdrow had imprisoned Gromph, an army of duergar, augmented by tanarukks, had been marching toward the city. Did Gracklstugh\u0027s forces block the approaches to Menzoberranzan? Even if they did, surely a rat could slip through their lines.\u003c/p\u003e\n\u003cp\u003eGromph tried again.\u003c/p\u003e\n\u003cp\u003eKyorli! Are you there?\u003c/p\u003e\n\u003cp\u003eFrom somewhere close at hand came a faint tickle of thought - Kyorli, swimming in the lake? Gromph reached out to it, but it was gone.\u003c/p\u003e\n\u003cp\u003eSomething nudged the sphere, rocking it gently.\u003c/p\u003e\n\u003cp\u003eKyorli?\u003c/p\u003e\n\u003cp\u003eGromph opened his eyes in time to see a hand break the surface of the lake beside him. Enormous purplish fingers wrapped around the sphere, then pulled it underwater. The fingers, coated in a thin layer of slime, smudged the outer surface of the sphere, but through the streaks, Gromph could see a bulbous face with four writhing tentacles where a nose and mouth should be. The illithid\u0027s eyes were white and devoid of pupils, but Gromph could sense that it was star-ing at him as it sculled gently with its free hand, maintaining a posi-tion just below the surface of the lake.\u003c/p\u003e\n\u003cp\u003eIts voice forced itself into Gromph\u0027s mind, probing like an infes-tation of roots through soft, unresisting soil.\u003c/p\u003e\n\u003cp\u003eA mage,it observed.How delicious! \u003c/p\u003e","sourceLink":"https://allnovel.net/extinction-war-of-the-spider-queen-4/page-8.html","bookId":2162,"creation":"Oct 5, 2019 6:28:25 PM","modification":"Oct 5, 2019 6:28:25 PM"}
