{"id":103259,"no":5,"title":"Page 5","content":"\u003cp\u003eHemlock Frosty came in four sections-a wide round base, a slightly smaller snowball that wedged into the base, then a trunk, then the head with the face and hat. Each section could be stuffed into the next larger one, so that storage for the other eleven months of the year was not too demanding. At a cost of $82.99, plus shipping, everyone packed away their Frostys with care.\u003c/p\u003e\n\u003cp\u003eAnd they unpacked them with great delight. Throughout the afternoon sections of Frostys could be seen inside most garages along Hemlock as the snowmen were dusted off and checked for parts. Then they were put together, built just like a real snowman, section on top of section, until they were seven feet tall and ready for the roof. Installation was not a simple matter. A ladder and a rope were required, along with the help of a neighbor. First, the roof had to be scaled with a rope around the waist, then Frosty, who was made of hard plastic and weighed about forty pounds, was hoisted up, very carefully so as not to scratch him over the asphalt shingles. When Frosty reached the summit, he was strapped to the chimney with a canvas band that Vic Frohmeyer had invented himself. A two-hundred-watt lamp was screwed into Frosty\u0027s innards, and an extension cord was dropped from the backside of the roof.\u003c/p\u003e\n\u003cp\u003eWes Trogdon was an insurance broker who\u0027d called in sick so he could surprise his kids by having their Frosty up first. He and his wife, Trish, washed their snowman just after lunch, then, under her close supervision, Wes climbed and grappled and adjusted until the task was complete. Forty feet high, with a splendid view, he looked up and down Hemlock and was quite smug that he had got the jump on everyone, including Frohmeyer.\u003c/p\u003e\n\u003cp\u003eWhile Trish made hot cocoa, Wes began hauling boxes of lights up from the basement to the driveway, where he laid them out and checked circuits. No one on Hemlock strung more Christmas lights than the Trogdons. They lined their yard, wrapped their shrubs, draped their trees, outlined their house, adorned their windows-fourteen thousand lights the year before.\u003c/p\u003e\n\u003cp\u003eFrohmeyer left work early so he could supervise matters on Hemlock, and he was quite pleased to see activity. He was momentarily jealous that Trogdon had beaten him to the punch, but what did it really matter? Before long they joined forces in the driveway of Mrs. Ellen Mulholland, a lovely widow who was already baking brownies. Her Frosty was up in a flash, her brownies devoured, and they were off to render more assistance. Kids joined them, including Spike Frohmeyer, a twelve-year-old with his father\u0027s flair for organization and community activism, and they went door to door in the late afternoon, hurrying before darkness slowed them.\u003c/p\u003e\n\u003cp\u003eAt the Kranks\u0027, Spike rang the doorbell but got no response. Mr. Krank\u0027s Lexus was not there, which was certainly not unusual at 5 P.M. But Mrs. Krank\u0027s Audi was in the garage, a sure sign that she was home. The curtains and shades were pulled. No answer at the door though, and the gang moved to the Seekers\u0027, where Ned was in the front yard washing his Frosty with his mother-in-law barking instructions from the steps.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re leaving now,\" Nora whispered into the phone in their bedroom.\u003c/p\u003e\n\u003cp\u003e\"Why are you whispering?\" Luther asked with agitation.\u003c/p\u003e\n\u003cp\u003e\"Because I don\u0027t want them to hear me.\"\u003c/p\u003e\n\u003cp\u003e\"Who is it?\"\u003c/p\u003e\n\u003cp\u003e\"Vic Frohmeyer, Wes Trogdon, looks like that Brixley fellow from the other end of the street, some kids.\"\u003c/p\u003e\n\u003cp\u003e\"A regular bunch of thugs, huh?\"\u003c/p\u003e\n\u003cp\u003e\"More like a street gang. They\u0027re at the Beckers\u0027 now.\"\u003c/p\u003e\n\u003cp\u003e\"God help them.\"\u003c/p\u003e\n\u003cp\u003e\"Where\u0027s Frosty?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"Same place he\u0027s been since January. Why?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"This is comical, Nora. You\u0027re whispering into the phone, in a locked house, because our neighbors are going door to door helping our other neighbors put up a ridiculous seven-foot plastic snowman, which, by the way, has absolutely nothing to do with Christmas. Ever think about that, Nora?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"We voted for Rudolph, remember?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s comical.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not laughing.\"\u003c/p\u003e\n\u003cp\u003e\"Frosty\u0027s taking a year off, okay? The answer is no.\"\u003c/p\u003e\n\u003cp\u003eLuther hung, up gently and tried to concentrate on his work. After dark, he drove home, slowly, all the way telling himself that it was silly to be worried about such trivial matters as putting a snowman on the roof. And all the way he kept thinking of Walt Scheel.\u003c/p\u003e\n\u003cp\u003e\"Come on, Scheel,\" he mumbled to himself. \"Don\u0027t let me down.\"\u003c/p\u003e\n\u003cp\u003eWalt Scheel was his rival on Hemlock, a grumpy sort who lived directly across the street. Two kids out of college, a wife battling breast cancer, a mysterious job with a Belgian conglom, an income that appeared to be in the upper range on Hemlock-but regardless of what he earned Scheel and the missus expected their neighbors to think they had a lot more. Luther bought a Lexus, Scheel had to have one. Bellington put in a pool, Scheel suddenly needed to swim in his own backyard, doctor\u0027s orders. Sue Kropp on the west end outfitted her kitchen with designer appliances-$8,000 was the rumor-and Bev Scheel spent $9,000 six months later.\u003c/p\u003e\n\u003cp\u003eA hopeless cook, Bev\u0027s cuisine tasted worse after the renovation, according to witnesses.\u003c/p\u003e\n\u003cp\u003eTheir haughtiness had been stopped cold, however, with the breast cancer eighteen months earlier. The Scheels had been humbled mightily. Keeping ahead of the neighbors didn\u0027t matter anymore. Things were useless. They had endured the disease with a quiet dignity, and, as usual, Hemlock had supported them like family. A year after the first chemo, the Belgian conglom had reshuffled itself. Whatever Walt\u0027s job had been, it was now something less.\u003c/p\u003e\n\u003cp\u003eThe Christmas before the Scheels had been too distracted to decorate. No Frosty for them, not much of a tree, just a few lights strung around the front window, almost an afterthought.\u003c/p\u003e\n\u003cp\u003eA year earlier, two houses on Hemlock had gone without Frostys-the Scheels\u0027 and one on the west end owned by a Pakistani couple who\u0027d lived there three months then moved away. It had been for sale, and Frohmeyer had actually considered ordering another Frosty and conducting a nighttime raid on the premises to erect it.\u003c/p\u003e\n\u003cp\u003e\"Come on, Scheel,\" Luther mumbled in traffic. \"Keep your Frosty in the basement.\"\u003c/p\u003e\n\u003cp\u003eThe Frosty idea had been cute six years earlier when first hatched by Frohmeyer. Now it was tedious. But, Luther confessed, certainly not tedious to the kids on Hemlock. He had been secretly delighted two years before when the storm gusts cleared the roofs and sent Frostys flying over half the city.\u003c/p\u003e\n\u003cp\u003eHe turned onto Hemlock, and as far as he could see the street was lined with identical snowmen sitting like glowing sentries above the houses. Just two gaps in their ranks-the Scheels and the Kranks. \"Thank you, Scheel,\" Luther whispered. Kids were riding bikes. Neighbors were outside, stringing lights, chatting across hedgerows.\u003c/p\u003e\n\u003cp\u003eA street gang was meeting in Scheel\u0027s garage, Luther noticed as he parked and walked hurriedly into his house. Sure enough, within minutes a ladder went up and Frohmeyer scurried up like a veteran roofer. Luther peeked through the blinds on his front door. There was Walt Scheel standing in the front yard with a dozen people, Bev, bundled up in a warm coat, on the front steps. Spike Frohmeyer was wrestling with an extension cord. There were shouts and laughter, everyone seemed to be hurling instructions to Frohmeyer as the next to the last Frosty on Hemlock was heaved up.\u003c/p\u003e\n\u003cp\u003eLittle was said over a dinner of sauceless pasta and cottage cheese. Nora was down three pounds, Luther four. After the dishes, he went to the treadmill in the basement where he walked for fifty minutes, burning 340 calories, more than he had just consumed. He took a shower and tried to read.\u003c/p\u003e\n\u003cp\u003eWhen the street was clear, he went for a walk. He would not be a prisoner in his home. He would not hide from his neighbors. He had nothing, to fear from these people.\u003c/p\u003e\n\u003cp\u003eThere was a twinge of guilt as he admired the two neat lines of snowmen guarding their quiet street. The Trogdons were piling more ornaments on their tree, and it brought back a few distant memories of Blair\u0027s childhood and those faraway times. He was not the nostalgic type. You live life today, not tomorrow, certainly not yesterday, he always said. The warm memories were quickly erased with thoughts of shopping and traffic and burning money. Luther was quite proud of his decision to take a year off.\u003c/p\u003e\n\u003cp\u003eHis belt was a bit looser. The beaches were waiting.\u003c/p\u003e\n\u003cp\u003eA bike rushed in from nowhere and slid to a stop. \"Hi, Mr. Krank.\"\u003c/p\u003e\n\u003cp\u003eIt was Spike Frohmeyer, no doubt heading home after some clandestine juvenile meeting. The kid slept less than his father, and the neighborhood was full of stories about Spike\u0027s nocturnal ramblings. He was a nice boy, but usually unmedicated.\u003c/p\u003e\n\u003cp\u003e\"Hello, Spike,\" Luther said, catching his breath. \"What brings you out?\"\u003c/p\u003e\n\u003cp\u003e\"Just checking on things,\" he said, as if he were the official night watchman.\u003c/p\u003e\n\u003cp\u003e\"What kind of things, Spike?\"\u003c/p\u003e\n\u003cp\u003e\"My dad sent me over to Stanton Street to see how many Rudolphs are up.\"\u003c/p\u003e\n\u003cp\u003e\"How many?\" Luther asked, playing along.\u003c/p\u003e\n\u003cp\u003e\"None. We smoked \u0027em again.\"\u003c/p\u003e\n\u003cp\u003eWhat a victorious night the Frohmeyers would have, Luther thought. Silly.\u003c/p\u003e\n\u003cp\u003e\"You putting yours up, Mr. Krank?\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m not, Spike. We\u0027re leaving town this year, no Christmas for us.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know you could do that.\"\u003c/p\u003e\n\u003cp\u003e\"This is a free country, Spike, you can do almost anything you want.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not leaving till Christmas Day,\" Spike said.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Noon\u0027s what I heard. You got plenty of time to get Frosty up. That way we can win the award again.\"\u003c/p\u003e\n\u003cp\u003eLuther paused for a second and once more marveled at the speed with which one person\u0027s private business could be so thoroughly kicked around the neighborhood.\u003c/p\u003e\n\u003cp\u003e\"Winning is overrated, Spike,\" he said wisely. \"Let another street have the award this year.\"\u003c/p\u003e\n\u003cp\u003e\"I guess so.\"\u003c/p\u003e\n\u003cp\u003e\"Now run along.\"\u003c/p\u003e\n\u003cp\u003eHe rolled away and said, \"See you later,\" over his shoulder.\u003c/p\u003e\n\u003cp\u003eThe kid\u0027s father was lying in ambush when Luther came strolling by, \"Evening, Luther,\" Vic said, as if the encounter was purely by chance. He leaned on his mailbox at the end of his drive.\u003c/p\u003e\n\u003cp\u003e\"Evening, Vic,\" Luther said, almost stopping. But at the last second he decided to keep walking. He stepped around Frohmeyer, who tagged along.\u003c/p\u003e\n\u003cp\u003e\"How\u0027s Blair?\"\u003c/p\u003e\n\u003cp\u003e\"Fine, Vic, thanks. How are your kids?\"\u003c/p\u003e\n\u003cp\u003e\"In great spirits. It\u0027s the best time of the year, Luther. Don\u0027t you think so?\" Frohmeyer had picked up the pace and the two were now side by side.\u003c/p\u003e\n\u003cp\u003e\"Absolutely. I couldn\u0027t be happier. Do miss Blair, though. It won\u0027t be the same without her.\"\u003c/p\u003e\n\u003cp\u003e\"Of course not.\"\u003c/p\u003e\n\u003cp\u003eThey stopped in front of the Beckers\u0027, next door to Luther\u0027s, and watched as poor Ned teetered on the top step of the ladder in a vain effort to mount an oversized star on the highest branch of the tree. His wife stood behind him, helping mightily with her instructions but not once holding the ladder, and his mother-in-law was a few steps back for the wide view. A fistfight seemed imminent.\u003c/p\u003e\n\u003cp\u003e\"Some things about Christmas I\u0027m not going to miss,\" Luther said.\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re really skipping out?\"\u003c/p\u003e\n\u003cp\u003e\"You got it, Vic. I\u0027d appreciate your cooperation.\"\u003c/p\u003e\n\u003cp\u003e\"Just doesn\u0027t seem right for some reason.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not for you to decide, is it?\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s not.\"\u003c/p\u003e\n\u003cp\u003e\"Good night, Vic.\" Luther left him there, amused by the Beckers. \u003c/p\u003e","sourceLink":"https://allnovel.net/skipping-christmas/page-5.html","bookId":2639,"creation":"Oct 5, 2019 10:23:05 PM","modification":"Oct 5, 2019 10:23:05 PM"}
