{"id":18512,"no":1,"title":"PREFACE.","content":"The contents of the present work, except the Introduction and the chapter on Gauges, consist mainly in a revision of a series of articles published in \"Engineering\" and the Journal of the Franklin Institute, under the head of \"The Principles of Shop Manipulation,\" during 1873 and 1874.\n\u003cbr\u003e \n\u003cbr\u003e The articles alluded to were suggested by observations made in actual practice, and by noting a \"habit of thought\" common among learners, which did not seem to accord with the purely scientific manner in which mechanical subjects are now so constantly treated.\n\u003cbr\u003e \n\u003cbr\u003e The favourable reception which the articles on \"Shop Manipulation\" met with during their serial publication, and various requests for their reproduction in the form of a book, has led to the present edition.\n\u003cbr\u003e \n\u003cbr\u003e The addition of a few questions at the end of each chapter, some of which are not answered in the text, it is thought will assist the main object of the work, which is to promote a habit of logical investigation on the part of learners.\n\u003cbr\u003e \n\u003cbr\u003e It will be proper to mention here, what will be more fully pointed out in the Introduction, that although workshop processes may be scientifically explained and proved, they must nevertheless be learned logically. This view, it is hoped, will not lead to anything in the book being construed as a disparagement of the importance of theoretical studies.\n\u003cbr\u003e \n\u003cbr\u003e Success in Technical Training, as in other kinds of education, must depend greatly upon how well the general mode of thought among learners is understood and followed; and if the present work directs some attention to this matter it will not fail to add something to those influences which tend to build up our industrial interests.  \n\u003cbr\u003e 10 John Street, Adelphi,\n\u003cbr\u003e \n\u003cbr\u003e London, 1875. \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2128/60240.html","bookId":485,"creation":"Aug 2, 2019 9:49:41 AM","modification":"Aug 2, 2019 9:49:41 AM"}
