{"id":74313,"no":19,"title":"Page 19","content":"\u003cp\u003eMe: I took him with me. The courts thought he stayed with my parents, but he moved in with me. Well, with Warren. We’ve been friends since we were fourteen. Both of his parents are deaf, which is how he knows ASL. Once I became emancipated, they allowed me and Brennan to stay with them. My parents still had guardianship over Brennan, but as far as they were concerned, I did them a huge favor by taking him off their hands.\u003c/p\u003e\n\u003cp\u003eSydney: Well, that was incredibly considerate of Warren’s parents.\u003c/p\u003e\n\u003cp\u003eMe: Yes, they’re great people. Not sure why Warren turned out the way he did, though.\u003c/p\u003e\n\u003cp\u003eShe laughs.\u003c/p\u003e\n\u003cp\u003eSydney: Did they continue to raise Brennan after you left for college?\u003c/p\u003e\n\u003cp\u003eMe: No, we actually only stayed with them for seven months. When I turned seventeen, I moved us into an apartment. I dropped out of school and got a GED so I could start college sooner.\u003c/p\u003e\n\u003cp\u003eSydney: Wow. So you raised your brother?\u003c/p\u003e\n\u003cp\u003eMe: Hardly. Brennan lived with me, but he was never the type who could be raised. He was fourteen when we got our own place. I was only seventeen. As much as I’d like to say I was the responsible, mature adult, I was quite the opposite. Our apartment became the hangout for everyone who knew us, and Brennan partied just as hard as I did.\u003c/p\u003e\n\u003cp\u003eSydney: That shocks me. You seem so responsible.\u003c/p\u003e\n\u003cp\u003eMe: I wasn’t as wild as I probably could have been, being on my own at that young an age. Luckily, all our money went to bills and rent, so I never got into any bad habits. We just liked to have fun. Our band was formed when Brennan was sixteen and I was nineteen, so that took up a lot of our time. That’s also the year I started dating Maggie, and I calmed down a lot after that.\u003c/p\u003e\n\u003cp\u003eSydney: You’ve been with Maggie since you were nineteen?\u003c/p\u003e\n\u003cp\u003eI nod but don’t text her back. My food has hardly been touched from all the texting, so I pick up my burger. She does the same, and we eat until both of us are finished. We stand up and clear off the table. Then she gives me a wave and heads off to her room. I sit on the couch and turn on the TV. After about fifteen minutes of channel surfing, I finally stop on a movie channel. The captioning has been turned off on the TV, but I don’t bother turning it back on. I’m too tired to read and follow along with the movie, anyway.\u003c/p\u003e\n\u003cp\u003eThe door to Sydney’s bedroom opens, and she walks out, looking slightly startled when she sees I’m still awake. She’s in one of her baggy shirts again, and her hair is wet. She walks back to her room, then comes out with her phone and sits on the couch with me.\u003c/p\u003e\n\u003cp\u003eSydney: I’m not tired. What are you watching?\u003c/p\u003e\n\u003cp\u003eMe: I don’t know, but it just started.\u003c/p\u003e\n\u003cp\u003eShe pulls her feet up and rests her head on the arm of the couch. Her eyes are on the TV, but my eyes are on her. I have to admit, the Sydney who went out tonight is a completely different Sydney from the one lying here. Her makeup is gone, her hair is no longer perfect, her clothes even have holes in them, and I can’t help but laugh just looking at her. If I were Hunter, I’d be punching myself in the face right now.\u003c/p\u003e\n\u003cp\u003eShe’s beginning to lean forward for her phone when she cuts her eyes in my direction. I want to look back at the TV and pretend she didn’t just catch me staring at her, but that would make this even more awkward. Luckily, she doesn’t seem to care that I was looking at her, because she gives her attention to her phone.\u003c/p\u003e\n\u003cp\u003eSydney: How are you watching this without captions?\u003c/p\u003e\n\u003cp\u003eMe: Too tired to read along right now. Sometimes I just like to watch movies without captions and try to guess what they’re saying.\u003c/p\u003e\n\u003cp\u003eSydney: I want to try it. Put it on mute, and we’ll deaf-watch it together.\u003c/p\u003e\n\u003cp\u003eI laugh. Deaf-watch? That’s a new one. I point the remote to the TV and press the mute button. She turns her attention back to the TV, but once again, I fail to look away from her.\u003c/p\u003e\n\u003cp\u003eI don’t understand my sudden obsession with staring at her, but I can’t seem to stop. She’s several feet away. We aren’t touching. We aren’t speaking. She isn’t even looking at me. Yet the simple fact that I’m staring at her makes me feel incredibly guilty, as if I’m doing something wrong. Staring is harmless, so why do I feel so guilty?\u003c/p\u003e\n\u003cp\u003eI attempt to talk myself out of the feelings of guilt, but deep down, I know exactly what’s happening.\u003c/p\u003e\n\u003cp\u003eI don’t feel guilty simply because I’m staring at her. I feel guilty for how it’s making me feel.\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003eThis makes twice in a row I’ve been woken up like this. I push away the hand that’s slapping me and open my eyes. Warren is standing over me. He slaps a piece of paper on my chest, then whacks his hand against the side of my head. He walks to the front door and grabs his keys, then leaves for work.\u003c/p\u003e\n\u003cp\u003eWhy is he going to work this early?\u003c/p\u003e\n\u003cp\u003eI pick up my phone, and it says 6:00 A.M. I guess he’s not leaving early.\u003c/p\u003e\n\u003cp\u003eI sit up on the couch and see Sydney still curled up at the other end, sound asleep. I pull the paper from Warren off my chest and look down at it.\u003c/p\u003e\n\u003cp\u003eHow about you go to your room and sleep in the bed with your girlfriend!\u003c/p\u003e\n\u003cp\u003eI wad up the note and stand, then take it to the trash can and bury it. I go back to the couch, put my hand on Sydney’s shoulder, and shake her awake. She rolls onto her back and rubs her eyes, then looks up at me.\u003c/p\u003e\n\u003cp\u003eShe smiles when she sees me. That’s it. All she did just now was smile, but all of a sudden, my chest is on fire, and it feels as if a wave of heat just rolled down the entire length of my body. I recognize this feeling, and it’s not good. It’s not good at all. I haven’t felt this way since I was nineteen.\u003c/p\u003e\n\u003cp\u003eSince I first began developing feelings for Maggie.\u003c/p\u003e\n\u003cp\u003eI point to Sydney’s room to let her know she should go to bed, then quickly turn around and head into my bedroom. I pull off my jeans and T-shirt and softly slide into bed next to Maggie. I wrap my arms around her, pull her against my chest, and spend the next half hour falling asleep to a broken record of reminders.\u003c/p\u003e\n\u003cp\u003eYou’re in love with Maggie.\u003c/p\u003e\n\u003cp\u003eMaggie’s perfect for you.\u003c/p\u003e\n\u003cp\u003eYou’re perfect for her.\u003c/p\u003e\n\u003cp\u003eShe needs you.\u003c/p\u003e\n\u003cp\u003eYou’re happy when you’re with her.\u003c/p\u003e\n\u003cp\u003eYou’re with the one and only girl you’re meant to be with.\u003c/p\u003e\n\u003cp\u003e10.\u003c/p\u003e\n\u003cp\u003eSydney\u003c/p\u003e\n\u003cp\u003eIt’s been two weeks since Ridge and I have worked on lyrics together. A few days after Maggie went home, Ridge ended up leaving for six days because of a family emergency. He was vague about what the emergency was, but it reminded me of when I still lived with Tori and he was absent from his balcony for several days. A family emergency was his excuse then, too.\u003c/p\u003e\n\u003cp\u003eBased on conversations I’ve heard Warren have on the phone with Brennan, I know it didn’t have anything to do with Brennan. But he’s never mentioned having family other than Brennan. When Ridge returned a few days ago, I asked him if everything was okay and he said things were fine. He didn’t seem to want to share any details, and I’m trying to remind myself that his personal life is none of my concern.\u003c/p\u003e\n\u003cp\u003eI’ve immersed myself in school, and every now and then, I’ll attempt to write lyrics on my own, but it isn’t the same when I don’t have the music to go along with it. Ridge has been home for a few days now, but he’s spent most of his time in his room catching up on work, and I can’t help but wonder if he’s kept his distance for other reasons.\u003c/p\u003e\n\u003cp\u003eI’ve been hanging out with Warren a lot and have learned more about his relationship with Bridgette. I haven’t had any more interactions with her, so as far as I know, she still assumes I’m deaf.\u003c/p\u003e\n\u003cp\u003eBased on what Warren has told me, their relationship is anything but typical. Warren never met Bridgette before she moved in six months ago, but she’s a longtime friend of Brennan’s. Warren says that he and Bridgette don’t get along at all, and during the day, they live separate lives. But at night, it’s a completely different story. He has tried to go into more detail than I care to hear, so I force him to shut up when he begins to overshare.\u003c/p\u003e\n\u003cp\u003eI’m really wishing he would shut up right now, because he’s in the midst of one of his oversharing moments. I have to leave for class in half an hour, and I’m trying to finish reading a last-minute chapter, but he’s intent on telling me all about last night and how he wouldn’t let her take her Hooters uniform off because he likes to role-play, and oh, my God, why does he think I care to hear this?\u003c/p\u003e\n\u003cp\u003eLuckily, Bridgette walks out of her room, and it’s more than likely the first time I’ve ever been happy to see her.\u003c/p\u003e\n\u003cp\u003e“Good morning, Bridgette,” Warren says, his eyes following her across the living room. “Sleep well?”\u003c/p\u003e\n\u003cp\u003e“Screw you, Warren,” she says in return.\u003c/p\u003e\n\u003cp\u003eI’m beginning to understand that this is their typical morning greeting. She walks into the kitchen and glances at me, then at Warren seated next to me on the couch. She narrows her eyes at him and turns toward the refrigerator. Ridge is at the dining-room table, concentrating on his laptop.\u003c/p\u003e\n\u003cp\u003e“I don’t like how she’s up your ass all the time,” Bridgette says with her back to me.\u003c/p\u003e\n\u003cp\u003eWarren looks at me and laughs. Apparently, Bridgette still assumes I can’t hear her, but I’m not finding much humor in the fact that she’s talking shit about me.\u003c/p\u003e\n\u003cp\u003eShe spins around and eyes Warren. “You think that’s funny?” she says to him. “The girl obviously has it bad for you, and you can’t even respect me enough to distance yourself from her until I’m out of the house?” She turns her back to us again. “First she gives Ridge some sob story so he’ll let her move in, and now she’s taking advantage of the fact that you know sign language so she can flirt with you.”\u003c/p\u003e\n\u003cp\u003e“Bridgette, stop.” Warren isn’t laughing anymore, because he can see how white my knuckles are, clasped around my book. I think he’s afraid Bridgette’s about to get hit upside the head with a hardback. He’s right to be afraid.\u003c/p\u003e\n\u003cp\u003e“You stop, Warren,” she says, turning back around to face him. “Either stop crawling into bed with me at night or stop shacking up on the couch with her during the day.”\u003c/p\u003e\n\u003cp\u003eI drop my book onto my lap with a loud slap, then kick my feet up and down against the floor out of frustration, anger, and flat-out annoyance. I can’t put up with this girl for another second.\u003c/p\u003e\n\u003cp\u003e“Bridgette, please!” I yell. “Shut up! Shut up, shut up, shut up! Christ! I don’t know why you think I’m deaf, and I’m definitely not a whore, and I’m not using sign language to flirt with Warren. I don’t even know sign language. And from now on, please stop yelling when you speak to me!”\u003c/p\u003e\n\u003cp\u003eBridgette cocks her pretty little head, and her mouth hangs open in shock. She silently stares at me for several seconds. No one in the room makes a move. She turns her attention to Warren, and the anger in her eyes is replaced with hurt. She immediately looks away once the hurt takes over, and she heads straight back to her room.\u003c/p\u003e\n\u003cp\u003eI glance over to see Ridge staring at me, more than likely wondering what the hell just happened. I lean my head back against the couch and sigh.\u003c/p\u003e\n\u003cp\u003eI was hoping that would feel good, but it didn’t feel good at all.\u003c/p\u003e\n\u003cp\u003e“Well,” Warren says, “there goes my chance to act out all the role-playing scenes I’ve been imagining. Thanks a lot, Sydney.”\u003c/p\u003e\n\u003cp\u003e“Screw you, Warren,” I say, understanding a little bit where Bridgette’s attitude comes from. \u003c/p\u003e","sourceLink":"https://allnovel.net/maybe-someday/page-19.html","bookId":2711,"creation":"Oct 5, 2019 10:30:59 AM","modification":"Oct 5, 2019 10:30:59 AM"}
