{"id":74363,"no":44,"title":"Page 44","content":"\u003cp\u003eHowever, until three weeks ago, I didn’t realize that the best life I could give her was a life without me in it. She needed the opposite of what I could offer her, and I know that now. She knows that now. And we accept it.\u003c/p\u003e\n\u003cp\u003eSo when you ask if I would choose her over you, you’re presenting a situation that I can’t give you a straight answer to. Because yes, at this point, I probably would walk away from you if she asked me to. The majority of my loyalty still lies with her. But if you’re asking who I need more? Who I want to be with more? Who my heart craves more? My heart decided that for me a long time ago, Sydney.\u003c/p\u003e\n\u003cp\u003eWhen I’ve read the last word, I pull the notebook against my chest and cry. He slides me off of him until I’m on my back, and he hovers over me, guiding my eyes up to meet his.\u003c/p\u003e\n\u003cp\u003e“It’s you,” he says aloud. “My heart . . . wants you.”\u003c/p\u003e\n\u003cp\u003eA sob breaks free from my chest when I hear his words. I immediately grab his shoulders and lift myself up, pressing my lips to the area directly over his heart. I kiss him over and over, silently thanking him for giving me reassurance that I haven’t been in this alone.\u003c/p\u003e\n\u003cp\u003eWhen I lower my head back to the pillow, he lies beside me, then pulls me against him. He touches my cheek with his hand and slowly leans in to kiss me. His mouth caresses mine so carefully it feels as if he’s holding my heart in his hand and is afraid he might drop it.\u003c/p\u003e\n\u003cp\u003eAs much as I’m convinced he would do everything he could to protect my heart, I’m still too scared to hand it over. I don’t want to give it to him until I know it’s the only heart he’s holding.\u003c/p\u003e\n\u003cp\u003e• • •\u003c/p\u003e\n\u003cp\u003eI don’t open my eyes, because I don’t want him to know I hear him leaving. I felt him kiss me. I felt him slide his arm out from beneath me. I heard him pull his shirt over his head. I heard him search for a pen. I heard him write me a letter, and I heard him place it on the pillow beside me.\u003c/p\u003e\n\u003cp\u003eI feel his hand as it presses into the mattress beside my head. His lips meet my forehead before he pulls away and walks out my bedroom door. When I hear the front door shut, I roll onto my side and pull the covers over my head to block out the sunlight. If I didn’t have to work today, I’d stay right here in this position and cry myself dry.\u003c/p\u003e\n\u003cp\u003eI brush my hand across the mattress in search of his letter. When I find it, I pull it under the covers with me and read it.\u003c/p\u003e\n\u003cp\u003eSydney,\u003c/p\u003e\n\u003cp\u003eA few months ago, we thought we had it all figured out. I was with the one girl I thought I would be with forever, and you were with a guy you thought deserved you way more than he did.\u003c/p\u003e\n\u003cp\u003eLook at us now.\u003c/p\u003e\n\u003cp\u003eWanting more than anything to be free to love each other but cursed by bad timing and loyal hearts. We both know where we want to be; we just don’t know how to get there. Or when we should get there. I wish things were as easy as they seemed when I was nineteen. We’d grab a calendar and pick a date, and we’d start a countdown until I could show up at your front door and start loving you.\u003c/p\u003e\n\u003cp\u003eHowever, I’ve learned that the heart can’t be told when and who and how it should love. The heart does whatever the hell it wants to do. The only thing we can control is whether we give our lives and our minds the chance to catch up to our hearts.\u003c/p\u003e\n\u003cp\u003eI know that’s what you want more than anything. Time to catch up.\u003c/p\u003e\n\u003cp\u003eAs much as I want to stay here and allow this to begin between us, there’s something I want from you even more than that.I want you to be with me in the end, and I know that can’t happen if I keep trying to rush our beginning. I know exactly why you were hesitant to let me in last night: you aren’t ready yet. Maybe I’m not, either. You’ve always said you wanted time to yourself, and the last thing I want is to start a relationship with you when I’ve barely given enough respect to the one that just ended with Maggie.\u003c/p\u003e\n\u003cp\u003eI don’t know when you’ll be ready for me. It might be next month or next year. Whenever it is, just know that I have absolutely no doubt that we can make this work. I know we can. If there are two people in this world capable of finding a way to love each other, it’s us.\u003c/p\u003e\n\u003cp\u003eRidge\u003c/p\u003e\n\u003cp\u003eP.S. I spent most of the night watching you sleep, so that’s one fantasy I got to check off the list. I also wrote lyrics to an entire song, which was unfortunate for Brennan. I didn’t have my guitar, so I forced him to make a rough cut of it at five o’clock this morning so I could leave it with you.\u003c/p\u003e\n\u003cp\u003eOne of these days, I’ll play it for you, along with all the other songs I plan to write for you while we’re apart. Until then, I’ll be waiting patiently.\u003c/p\u003e\n\u003cp\u003eJust say when.\u003c/p\u003e\n\u003cp\u003eI fold the letter and pull it against my chest. As much as it hurts to know he’s walking away, I also know that I need to let him. I asked for this. We need this. I need this. I need to get myself to a point where I know that we can finally be together without all the doubt running through my head. He’s right. My mind needs to catch up to my heart.\u003c/p\u003e\n\u003cp\u003eI run the back of my hand across my eyes, then open my texts.\u003c/p\u003e\n\u003cp\u003eMe: Can you come over? I need your help.\u003c/p\u003e\n\u003cp\u003eWarren: If this has to do with the fact that I gave Ridge your address last night, I’m sorry. He forced it out of me.\u003c/p\u003e\n\u003cp\u003eMe: This has nothing to do with that. I need to ask you for a huge favor.\u003c/p\u003e\n\u003cp\u003eWarren: Be there when I get off work tonight. Should I bring condoms?\u003c/p\u003e\n\u003cp\u003eMe: Funny guy.\u003c/p\u003e\n\u003cp\u003eI close out the text to Warren and open up the song Ridge just sent me. I reach into my drawer for my headphones, then fall back against my pillow and hit play.\u003c/p\u003e\n\u003cp\u003eIT’S YOU\u003c/p\u003e\n\u003cp\u003eBaby, everything you’ve ever done\u003c/p\u003e\n\u003cp\u003eUnderneath this here sun\u003c/p\u003e\n\u003cp\u003eIt doesn’t even matter anymore\u003c/p\u003e\n\u003cp\u003eOh, of this I’m sure\u003c/p\u003e\n\u003cp\u003eCuz you’ve taken me\u003c/p\u003e\n\u003cp\u003ePlaces I want to be\u003c/p\u003e\n\u003cp\u003eAnd you show me\u003c/p\u003e\n\u003cp\u003eEverything that I could ever\u003c/p\u003e\n\u003cp\u003eWant to see\u003c/p\u003e\n\u003cp\u003eYou, you know it’s\u003c/p\u003e\n\u003cp\u003eYou know it’s you\u003c/p\u003e\n\u003cp\u003eI think about you every single day\u003c/p\u003e\n\u003cp\u003eTrying to think of something better to say\u003c/p\u003e\n\u003cp\u003eMaybe hi, how are you\u003c/p\u003e\n\u003cp\u003eNot just anything will do\u003c/p\u003e\n\u003cp\u003eCuz you’ve taken me\u003c/p\u003e\n\u003cp\u003ePlaces I want to be\u003c/p\u003e\n\u003cp\u003eAnd you show me\u003c/p\u003e\n\u003cp\u003eEverything that I could ever\u003c/p\u003e\n\u003cp\u003eWant to see\u003c/p\u003e\n\u003cp\u003eYou, you know it’s\u003c/p\u003e\n\u003cp\u003eYou know it’s you\u003c/p\u003e\n\u003cp\u003e24.\u003c/p\u003e\n\u003cp\u003eRidge\u003c/p\u003e\n\u003cp\u003eMe: I’m looking at your schedule for March. You’re free on the 18th.\u003c/p\u003e\n\u003cp\u003eBrennan: Why do I feel like I’m about to be busy on the 18th?\u003c/p\u003e\n\u003cp\u003eMe: I’m planning a show, and I need your help. We’ll do it locally.\u003c/p\u003e\n\u003cp\u003eBrennan: What kind of show? Full band?\u003c/p\u003e\n\u003cp\u003eMe: No, just you and me. Maybe Warren if he’ll sign for us.\u003c/p\u003e\n\u003cp\u003eBrennan: Why do I feel like this has to do with Sydney?\u003c/p\u003e\n\u003cp\u003eMe: Why do I feel like I don’t care what you feel like?\u003c/p\u003e\n\u003cp\u003eBrennan: The ball is in her court, Ridge. You really should just leave things alone until she’s ready. I know how you feel about her, and I don’t want you to screw it up.\u003c/p\u003e\n\u003cp\u003eMe: March 18 is still three months away. If she hasn’t made up her mind by that date, then all I’m doing is giving her a little shove. And when did you start giving relationship advice? How long has it been since you were in one? Oh, wait. That would be never.\u003c/p\u003e\n\u003cp\u003eBrennan: If I agree to help you, will you STFU? What do you need me to do?\u003c/p\u003e\n\u003cp\u003eMe: Just carve out some time for me between now and then to run through some new songs.\u003c/p\u003e\n\u003cp\u003eBrennan: Is someone over his writer’s block?\u003c/p\u003e\n\u003cp\u003eMe: Yeah, well, someone once told me heartache is good for lyrical inspiration. Unfortunately, he was right.\u003c/p\u003e\n\u003cp\u003eBrennan: Sounds like a smart guy.\u003c/p\u003e\n\u003cp\u003eI close out my texts to Brennan and open one up to Warren.\u003c/p\u003e\n\u003cp\u003eMe: March 18. I need a local venue. A small one. Then I need you to get Sydney to go there with you that night.\u003c/p\u003e\n\u003cp\u003eWarren: Is she supposed to know you orchestrated this?\u003c/p\u003e\n\u003cp\u003eMe: No. Lie to her.\u003c/p\u003e\n\u003cp\u003eWarren: Not a problem. I’m good at lying.\u003c/p\u003e\n\u003cp\u003eI set my phone down, pick up my guitar, and walk out onto my balcony. It’s been almost a month since I last saw her. Neither of us has texted the other. I know Warren still keeps in contact with her, but he refuses to tell me anything, so I just stopped asking. As much as I miss her and as much as I want to beg her to just let this begin with us, I know time is better for both of us right now. There was still too much guilt rolled up in the thought of starting something too soon, despite how much we wanted to be together. Waiting until we’re both in a good place is definitely what needs to happen.\u003c/p\u003e\n\u003cp\u003eHowever, I feel as if I’m already there. Maybe it’s easier for me because I know where Maggie and I stand, and I know where my heart stands, but Sydney doesn’t have that reassurance. If time will give her that reassurance, then I’ll give her time. Just not too much. March 18 is only three months away. I hope to hell she’s ready by then, because I’m not sure I can keep myself away from her for longer than that.\u003c/p\u003e\n\u003cp\u003eI scoot my chair to the edge of the balcony and fold my arms over the railing, then look over at her old balcony. Every time I come out here and see her empty chair, it makes all of this so much harder. But I can’t seem to find anything inside my apartment that reminds me of her anymore. She left nothing when she moved, and she really never had anything while she was here. Being outside on this balcony is the closest I can come to feeling her since it seems we’re so far apart.\u003c/p\u003e\n\u003cp\u003eI lean back in my chair, pick up a pen, and begin writing the lyrics to another song, with nothing but her on my mind.\u003c/p\u003e\n\u003cp\u003eThe cool air running through my hair\u003c/p\u003e\n\u003cp\u003eNights like these, doesn’t seem fair\u003c/p\u003e\n\u003cp\u003eFor you and I to be so far away\u003c/p\u003e\n\u003cp\u003eThe stars all shimmer like a melody\u003c/p\u003e\n\u003cp\u003eLike they’re playing for you and me\u003c/p\u003e\n\u003cp\u003eBut only I can hear their sounds.\u003c/p\u003e\n\u003cp\u003eI pick up my guitar and work through the first few chords. I want these songs to be enough to convince her that we’re ready, so every single thing has to be perfect. I’m just nervous that I’m relying too much on Warren to help make it happen. I hope he’s more reliable in this situation with Sydney than he is with his rent checks.\u003c/p\u003e\n\u003cp\u003e25.\u003c/p\u003e\n\u003cp\u003eSydney\u003c/p\u003e\n\u003cp\u003e“I’m not going.”\u003c/p\u003e\n\u003cp\u003e“Yes, you are,” Warren says, kicking my legs off the coffee table. “I’m bored out of my mind. Bridgette works all weekend, and Ridge is off doing God knows what with God knows who.”\u003c/p\u003e\n\u003cp\u003eI immediately look up at him with my heart caught in my throat.\u003c/p\u003e\n\u003cp\u003eHe laughs. “That got your attention.” He reaches forward, grabs my hands, and pulls me off the couch. “I’m kidding. Ridge is at home working, being a mopey little shit, just like you’re trying to be. Now, go get pretty and come out with me tonight, or I’ll sit on the couch with you and force you to watch porn.”\u003c/p\u003e\n\u003cp\u003eI pull my hands from his and walk to the kitchen. I open a cabinet, then grab a cup. “I don’t want to go out tonight, Warren. I had class all day, and it’s my only night off from the library. I’m sure you can find someone else to go with you.” I grab a container of juice from the refrigerator and fill my glass. Leaning against the counter, I take a sip as I watch Warren pout in my living room. He’s kind of adorable when he pouts, which is why I always give him such a hard time.\u003c/p\u003e\n\u003cp\u003e“Listen up, Syd,” he says, walking toward the kitchen. He grabs a bar stool and pulls it out, then takes a seat. “I’m about to lay things out for you, okay?”\u003c/p\u003e\n\u003cp\u003eI roll my eyes. “I doubt I can stop you, so go ahead.” \u003c/p\u003e","sourceLink":"https://allnovel.net/maybe-someday/page-44.html","bookId":2711,"creation":"Oct 5, 2019 10:30:59 AM","modification":"Oct 5, 2019 10:30:59 AM"}
