{"id":74285,"no":6,"title":"Page 6","content":"\u003cp\u003eAfter several minutes, my phone vibrates. I drop to my bed and pick it up.\u003c/p\u003e\n\u003cp\u003eBrennan: Okay. See what she’s willing to take, and let me know.\u003c/p\u003e\n\u003cp\u003eI smile and toss the phone into the air and feel like yelling. After I calm down enough to text her, I pick up my phone and think. I don’t want to freak her out, because I know she’s completely new to this kind of thing.\u003c/p\u003e\n\u003cp\u003eMe: I was wondering if we could talk sometime soon? I have a proposition for you. And get your mind out of the gutter, it’s completely music-related.\u003c/p\u003e\n\u003cp\u003eSydney: Okay. I can’t say I’m looking forward to it, because it makes me nervous. You want me to call you when I get off work?\u003c/p\u003e\n\u003cp\u003eMe: You work?\u003c/p\u003e\n\u003cp\u003eSydney: Yes. Campus library. Morning shift mostly, except for this weekend.\u003c/p\u003e\n\u003cp\u003eMe: Oh. I guess that’s why I never noticed. I don’t usually get out of bed until after lunch.\u003c/p\u003e\n\u003cp\u003eSydney: So do you want me to call you after I get home?\u003c/p\u003e\n\u003cp\u003eMe: Just text me. You think we can meet up sometime this weekend?\u003c/p\u003e\n\u003cp\u003eSydney: Probably, but I’d have to talk to my boyfriend. Don’t want him to find out and think you’re using me for more than my lyrics.\u003c/p\u003e\n\u003cp\u003eMe: K. Sounds good.\u003c/p\u003e\n\u003cp\u003eSydney: If you want, you could come to my birthday party tomorrow night. Might be easier, because he’ll be here.\u003c/p\u003e\n\u003cp\u003eMe: It’s your birthday tomorrow? Happy early birthday. And that sounds good. What time?\u003c/p\u003e\n\u003cp\u003eSydney: Not sure. I’m not supposed to know about it. I’ll just text you tomorrow night once I find out more.\u003c/p\u003e\n\u003cp\u003eMe: K.\u003c/p\u003e\n\u003cp\u003eHonestly, I don’t like the fact that her boyfriend might be there. I want to talk to her about it alone, because I still haven’t decided what to do about what I know is going on between that asshole and her roommate. But I need her to agree to help me before her heart gets shattered, so maybe my silence has been a little selfish. I do admire the fact that she wants to be honest with him, even though he doesn’t deserve it. Which makes me think maybe this is something I should bring up to Maggie, even though it never occurred to me before that it might even remotely be an issue.\u003c/p\u003e\n\u003cp\u003eMe: Hey. How’s my girl?\u003c/p\u003e\n\u003cp\u003eMaggie: Busy. This thesis is kicking my ass. How’s my guy?\u003c/p\u003e\n\u003cp\u003eMe: Good. Really good. I think Brennan and I found someone who’s willing to write lyrics with us. She’s really good, and I’ve already finished almost two songs since you left last weekend.\u003c/p\u003e\n\u003cp\u003eMaggie: Ridge, that’s great! I can’t wait to read them. Maybe next weekend?\u003c/p\u003e\n\u003cp\u003eMe: You coming here, or am I going to you?\u003c/p\u003e\n\u003cp\u003eMaggie: I’ll come there. I need to spend some time at the nursing home. Love you.\u003c/p\u003e\n\u003cp\u003eMe: Love you. Don’t forget our video chat tonight.\u003c/p\u003e\n\u003cp\u003eMaggie: You know I won’t. Already have my outfit picked out.\u003c/p\u003e\n\u003cp\u003eMe: That better be a cruel joke. You know I don’t care to see clothes.\u003c/p\u003e\n\u003cp\u003eMaggie: ;)\u003c/p\u003e\n\u003cp\u003eEight more hours.\u003c/p\u003e\n\u003cp\u003eI’m hungry.\u003c/p\u003e\n\u003cp\u003eI toss the phone aside. I pull open my bedroom door and take a step back when the shit that’s been piled up on the other side begins to fall in on me. First it’s the lamp, then the end table it was resting on, then the end table the lamp and the other end table were piled on top of.\u003c/p\u003e\n\u003cp\u003eDammit, Warren.\u003c/p\u003e\n\u003cp\u003eThese pranks are starting to get out of hand. I press my arm into the couch that’s been shoved up against my bedroom door. I push it back out into the living room and jump over it, then head toward the kitchen.\u003c/p\u003e\n\u003cp\u003eI carefully spoon toothpaste onto an Oreo, then replace the top of the cookie and gently squeeze it. I put it back into the package with the rest of Warren’s Oreos and seal the package shut, just as my phone vibrates.\u003c/p\u003e\n\u003cp\u003eSydney: Can you do me a favor?\u003c/p\u003e\n\u003cp\u003eShe has no idea how many favors I’d do for her right now. I’m pretty much at her mercy.\u003c/p\u003e\n\u003cp\u003eMe: What’s up?\u003c/p\u003e\n\u003cp\u003eSydney: Can you look out your balcony door and tell me if you see anything suspicious going on at my apartment?\u003c/p\u003e\n\u003cp\u003eShit. Does she know? What does she want me to tell her? I know it’s selfish, but I really don’t want to tell her about her boyfriend until after I have the chance to talk to her about the lyrics.\u003c/p\u003e\n\u003cp\u003eMe: Okay. Hold on.\u003c/p\u003e\n\u003cp\u003eI walk to my balcony and glance across the courtyard. I don’t see anything out of the ordinary. It’s almost dark, though, so I can’t see much. I’m not sure what she wants me to find, so I choose not to be too descriptive when I respond.\u003c/p\u003e\n\u003cp\u003eMe: Looks quiet.\u003c/p\u003e\n\u003cp\u003eSydney: Really? Are the blinds open? You don’t see people?\u003c/p\u003e\n\u003cp\u003eI look again. The blinds are open, but the only thing I can see from here is the glare from the TV.\u003c/p\u003e\n\u003cp\u003eMe: Doesn’t look like anyone’s home. Aren’t you having a birthday party later tonight?\u003c/p\u003e\n\u003cp\u003eSydney: I thought so. I’m really confused.\u003c/p\u003e\n\u003cp\u003eThere’s movement in one of the windows, and I see her roommate going into the living room. Sydney’s boyfriend follows closely behind her, and they both sit on the couch, but all I can see is their feet.\u003c/p\u003e\n\u003cp\u003eMe: Wait. Your boyfriend and your roommate just sat on the couch.\u003c/p\u003e\n\u003cp\u003eSydney: Okay. Sorry to bother you.\u003c/p\u003e\n\u003cp\u003eMe: Wait. What about tonight? Are you still having a birthday party?\u003c/p\u003e\n\u003cp\u003eSydney: I don’t know. Hunter says he’s taking me out to eat as soon as I get home from work, but I sort of thought it was a lie. I know he and Tori had lunch together a couple of weeks ago, but they don’t know I know. They were obviously planning something, and I assumed it was a surprise party, but tonight’s the only night that could happen.\u003c/p\u003e\n\u003cp\u003eI wince. She actually caught them in a lie, and she thought they were together because they were planning something nice for her. Christ. I don’t even know the guy, and I have a huge urge to walk over there and beat the shit out of him.\u003c/p\u003e\n\u003cp\u003eIt’s her birthday. I can’t tell her on her birthday. I take a deep breath, then decide to text Maggie for advice.\u003c/p\u003e\n\u003cp\u003eMe: Question. You busy?\u003c/p\u003e\n\u003cp\u003eMaggie: Nope. Shoot.\u003c/p\u003e\n\u003cp\u003eMe: If it was your birthday and someone you knew found out I was cheating on you, would you want to know right then? Or would you hope that person would wait to tell you until it was no longer your birthday?\u003c/p\u003e\n\u003cp\u003eMaggie: If this is a hypothetical question, I’m going to kill you for this heart attack. If it’s not hypothetical, I’m going to kill you for this heart attack.\u003c/p\u003e\n\u003cp\u003eMe: You know it’s not me. It’s not your birthday. ;)\u003c/p\u003e\n\u003cp\u003eMaggie: Who’s cheating on whom?\u003c/p\u003e\n\u003cp\u003eMe: It’s Sydney’s birthday today. The girl I was telling you about who writes the lyrics. I happen to know her boyfriend is cheating on her, and I’m kind of in a position where I should tell her because she’s becoming suspicious.\u003c/p\u003e\n\u003cp\u003eMaggie: Jesus. I’d hate to be you right now. But if she’s suspicious and you know for a fact that he’s cheating, you need to tell her, Ridge. If you don’t say anything, you’re inadvertently lying.\u003c/p\u003e\n\u003cp\u003eMe: Ugh! That’s what I thought you’d say.\u003c/p\u003e\n\u003cp\u003eMaggie: Good luck. I’m still going to kill you for the heart attack next weekend.\u003c/p\u003e\n\u003cp\u003eI sit on the bed, then start a text to Sydney.\u003c/p\u003e\n\u003cp\u003eMe: I’m not sure how to say this, Sydney. You’re not driving right now, are you?\u003c/p\u003e\n\u003cp\u003eSydney: Oh, jeez. There are people there, aren’t there? Lots of them?\u003c/p\u003e\n\u003cp\u003eMe: No, there isn’t anyone there but the two of them. First, I need to apologize for not telling you this sooner. I didn’t know how, because we don’t know each other that well. Second, I’m sorry for doing it on your birthday, of all days, but I feel like an ass for even waiting this long. And third, I’m sorry you have to find out via text, but I don’t want you to have to walk back into your apartment without knowing the truth first.\u003c/p\u003e\n\u003cp\u003eSydney: You’re scaring me, Ridge.\u003c/p\u003e\n\u003cp\u003eMe: I’m just going to rip the Band-Aid off, okay? Something has been going on between your roommate and your boyfriend for a while.\u003c/p\u003e\n\u003cp\u003eI hit send and close my eyes, knowing I’m completely ruining her birthday. If not pretty much every day after today, too.\u003c/p\u003e\n\u003cp\u003eSydney: Ridge, they’ve been friends for longer than I’ve even known Hunter. I think you’ve misinterpreted everything.\u003c/p\u003e\n\u003cp\u003eMe: If sticking your tongue down someone’s throat while straddling him is friendship, then I’m sorry. But I’m positive I’m not misinterpreting anything. It’s been going on for weeks. I’m assuming they come out to the patio while you’re in the shower, because they’re never out there long. But it happens a lot.\u003c/p\u003e\n\u003cp\u003eSydney: If you’re being honest, why didn’t you tell me when we first started talking?\u003c/p\u003e\n\u003cp\u003eMe: How does one comfortably say this to another person, Sydney? When is there ever an appropriate time? I’m telling you now because you’re becoming suspicious, and it’s as appropriate a time as it can be.\u003c/p\u003e\n\u003cp\u003eSydney: Please tell me you have a warped sense of humor, because you have no idea what you’re doing to my heart right now.\u003c/p\u003e\n\u003cp\u003eMe: I’m sorry, Sydney. Really.\u003c/p\u003e\n\u003cp\u003eI wait patiently for a response. She doesn’t text me back. I contemplate texting her, but I know she needs time to absorb this.\u003c/p\u003e\n\u003cp\u003eDammit, I’m such an asshole. Now she’ll probably be pissed at me, but I can’t blame her. I guess I can kiss the lyrics good-bye.\u003c/p\u003e\n\u003cp\u003eMy door swings open, and Warren barges in, then hurls a cookie straight at me. I duck, and it hits the headboard behind me.\u003c/p\u003e\n\u003cp\u003e“Asshole!” Warren yells. He turns and marches back out of the bedroom and slams the door.\u003c/p\u003e\n\u003cp\u003e4.\u003c/p\u003e\n\u003cp\u003eSydney\u003c/p\u003e\n\u003cp\u003eI must be in shock. How the hell did the day turn out like this? How does one girl go from having a best friend, a boyfriend, a purse, and a roof over her head to being heartbroken and naked, standing frozen in a strange shower, staring at the wall for half an hour straight? I swear to God, if this is some huge elaborate birthday hoax at my expense, I’m never speaking to anyone. Ever again. Ever.\u003c/p\u003e\n\u003cp\u003eHowever, I know it’s not a hoax. A hoax is just wishful thinking. I knew the second I walked through the front door and headed straight for Hunter that everything Ridge had said was true. I flat-out asked Hunter if he was sleeping with Tori, and the looks on both of their faces would have been comical if they didn’t completely crush my heart and deplete my trust in one fell swoop. I wanted to sink to the floor and cry when he couldn’t deny it. Instead, I walked calmly to my bedroom and began packing my things.\u003c/p\u003e\n\u003cp\u003eTori came into the room, crying. She tried to tell me it meant nothing, that sex had always been a casual thing between them, even before they met me. Hearing her say it meant nothing to them hurt worse than anything. If it meant something to either of them, at least I could vaguely understand their betrayal. But the fact that she was claiming it meant nothing, yet it still happened, hurt me more than anything else she could have possibly said at that moment. I’m pretty sure that’s when I punched her.\u003c/p\u003e\n\u003cp\u003eIt doesn’t help matters that I lost my job just minutes after Ridge told me about Hunter and Tori. I think it’s frowned upon in most libraries when student workers begin crying and throwing books at the wall in the middle of their shift. But I can’t help the fact that I happened to be stocking the romance section the second I found out my boyfriend of two years was sleeping with my roommate. The sappy, romantic covers on the cart in front of me just really pissed me off.\u003c/p\u003e\n\u003cp\u003eI turn the water off in Ridge’s shower and step out, then get dressed.\u003c/p\u003e\n\u003cp\u003eI feel better physically after finally getting into dry clothes, but my heart is growing heavier and heavier with each passing minute. The more time that passes by, the more my reality begins to sink in. In the course of just two hours, I’ve lost the entire last two years of my life. \u003c/p\u003e","sourceLink":"https://allnovel.net/maybe-someday/page-6.html","bookId":2711,"creation":"Oct 5, 2019 10:30:59 AM","modification":"Oct 5, 2019 10:30:59 AM"}
