{"id":68156,"no":1,"title":"Page 1","content":"\u003cp\u003ePerho, Finland.\u0026nbsp;\u0026nbsp;The meeting took place in a comfortable weatherproofed cabin in a remote wooded area two hundred miles from Helsinki.\u0026nbsp;\u0026nbsp;The members of the Western branch of the Committee had arrived discreetly at irregular intervals.\u0026nbsp;\u0026nbsp;They came from eight different countries, but their visit had been quietly arranged by a senior minister in the Valtioneuvosto, the Finnish Council of State, and there was no record of entry in their passports.\u0026nbsp;\u0026nbsp;Upon their arrival, armed guards escorted them into the cabin, and\u0027when the last visitor appeared, the cabin door was locked and the guards took up positions in the full-throated January winds, alert for any sign of intruders.\u003c/p\u003e\n\u003cp\u003eThe members, seated around the large rectangular table, were men in powerful positions, high in the councils of their respective governments.\u0026nbsp;\u0026nbsp;They had all met before in their official capacities, and they trusted one another because they had no choice. For added security, each had been assigned a code name.\u003c/p\u003e\n\u003cp\u003eThe meeting lasted almost five hours, and the discussion was heated. Finally the chairman decided the time had come to call for a vote.\u0026nbsp;\u0026nbsp;He rose, standing tall, and turned to the man seated at his right.\u003c/p\u003e\n\u003cp\u003e\"Sigurd?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Odin?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Balder?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re moving too hastily.\u0026nbsp;\u0026nbsp;The danger-\"\u003c/p\u003e\n\u003cp\u003e\"Yes or no, please.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\" Freyr?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Sigmund?\"\u003c/p\u003e\n\u003cp\u003e\"Nein.\u0026nbsp;\u0026nbsp;If this should be exposed, our lives would be-\"\u003c/p\u003e\n\u003cp\u003e\"Thor?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Tyr?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"I vote yes.\u0026nbsp;\u0026nbsp;The resolution is passed.\u0026nbsp;\u0026nbsp;I will so inform the Controller.\u0026nbsp;\u0026nbsp;We will observe the usual precautions and leave at twenty-minute intervals.\u0026nbsp;\u0026nbsp;Thank you, gentlemen.\"\u003c/p\u003e\n\u003cp\u003eTwo hours and forty-five minutes later the cabin was deserted. A crew of experts carrying kerosene moved in and set the cabin on fire, the red flames licked by the hungry winds.\u003c/p\u003e\n\u003cp\u003eWhen the fire brigade from Perho finally reached the scene, there was nothing left to see but the smoldering embers that outlined the cabin against the hissing snow.\u003c/p\u003e\n\u003cp\u003eThe assistant to the fire chief approached the ashes, bent down, and sniffed.\u0026nbsp;\u0026nbsp;\"Kerosene,\" he said.\u0026nbsp;\u0026nbsp;\"Arson.\"\u003c/p\u003e\n\u003cp\u003eThe fire chief was staring at the ruins, a puzzled expression on his face.\u0026nbsp;\u0026nbsp;\"That\u0027s strange,\" he muttered.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"I was hunting in these woods last week.\u0026nbsp;\u0026nbsp;There was no cabin.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/windmills-of-the-gods/page-1.html","bookId":2360,"creation":"Oct 5, 2019 10:08:17 AM","modification":"Oct 5, 2019 10:08:17 AM"}
