{"id":68157,"no":2,"title":"Page 2","content":"\u003cp\u003eStanton Rogers was destined to be President of the United States.\u0026nbsp;\u0026nbsp;He was a charismatic politician, highly visible to an approving public, and backed by powerful friends.\u0026nbsp;\u0026nbsp;Unfortunately for Rogers, his libido got in the way of his career.\u003c/p\u003e\n\u003cp\u003eIt was not that Stanton Rogers fancied himself a Casanova.\u0026nbsp;\u0026nbsp;On the contrary, until that one fateful bedroom escapade he had been a model husband.\u0026nbsp;\u0026nbsp;He was handsome, wealthy, and although he had had ample opportunity to cheat on his wife, he had never given another woman a thought.\u003c/p\u003e\n\u003cp\u003eThere was a second, perhaps greater irony: Stanton Rogers\u0027 wife, Elizabeth, was social, beautiful, and intelligent, arld the two of them shared a common interest in almost everything, whereas Barbara, the woman Rogers fell in love with, and eventually married after a much headlined divorce, was five years older than Stanton, pleasant-faced rather than pretty, and seemed to have nothing in common with him. Stanton was athletic; Barbara hated all forms of exercise.\u0026nbsp;\u0026nbsp;Stanton was gregarious; Barbara preferred to be alone with her husband, or to entertain small groups.\u0026nbsp;\u0026nbsp;The biggest surprise was the political differences.\u0026nbsp;\u0026nbsp;Stanton was a liberal, while Barbara was an archconservative.\u003c/p\u003e\n\u003cp\u003ePaul Ellison, Stanton\u0027s closest friend, had said, \"You must be out of your mind, chum! You and Liz are the perfect married couple.\u0026nbsp;\u0026nbsp;Do you have any idea what a divorce is going to do to your career?\"\u003c/p\u003e\n\u003cp\u003eStanton Rogers had replied tightly, \"Back off, Paul.\u0026nbsp;\u0026nbsp;I\u0027m in love with Barbara.\u0026nbsp;\u0026nbsp;Besides, half the marriages in this country end in divorce. It won\u0027t do anything.\"\u003c/p\u003e\n\u003cp\u003eRogers had proved to be a poor prophet.\u0026nbsp;\u0026nbsp;The press kept the story of the bitterly fought divorce alive as long as they could, and the gossip papers played it up as luridly as possible, with pictures of Stanton Rogers\u0027 love nest and stories of secret midnight trusts. When the furor died dovlrn, Stanton Rogers\u0027 powerful political friends found a new white knight to champion: Paul Ellison.\u003c/p\u003e\n\u003cp\u003eEllison was a sound choice.\u0026nbsp;\u0026nbsp;While he had neither Stanton ]Rogers\u0027 good looks nor his charisma, he was intelligent, likable, and had the right background.\u0026nbsp;\u0026nbsp;He was short in stature, with regular, even features and candid blue eyes.\u0026nbsp;\u0026nbsp;He had been happily married for ten, years to the daughter of a steel magnate.\u003c/p\u003e\n\u003cp\u003eStanton Rogers and Paul Ellison had grown up together in New York. Their families had had adjoining summer homes in Southampton.\u0026nbsp;\u0026nbsp;They were, in the same class, first at Yale and later at Harvard Law School.\u0026nbsp;\u0026nbsp;Paul Ellison did well, but it was Stanton Rogers who was the star pupil. Once he was out of law school, Stanton Rogers\u0027 political star began rising meteorically, and if he was the comet, Paul Ellison was the tail.\u003c/p\u003e\n\u003cp\u003eThe divorce changed everything.\u0026nbsp;\u0026nbsp;It was now Stanton Rogers who became the appendage to Paul Ellison.\u0026nbsp;\u0026nbsp;The trail leading to the presidency took almost fifteen years.\u0026nbsp;\u0026nbsp;First Ellison became a highly popular, articulate Senator.\u0026nbsp;\u0026nbsp;He fought against waste in government and Washington bureaucracy.\u0026nbsp;\u0026nbsp;He was a populist, and believed in international detente. When he was finally elected President of the United States, his first appointment was Stanton Rogers, as presidential foreign affairs adviser.\u003c/p\u003e\n\u003cp\u003eMAMEWL McLuhan\u0027s theory that television would turn the world into a global village had become a reality.\u0026nbsp;\u0026nbsp;The inauguration of the forty-second President of the United States was carried by satellite to more than one hundred and ninety countries.\u003c/p\u003e\n\u003cp\u003eIn the Black Rooster, a Washington, D.C., hangout for newsmen, Ben Cohn, a veteran political reporter for the Washington Post, was seated at a table with four colleagues, watching the inauguration on the television set over the bar.\u003c/p\u003e\n\u003cp\u003eThe camera panned to show the massive crowds gathered on Pennsylvania Avenue, huddled inside their overcoats against the bitter January wind. Jason Merlin, Chief Justice of the United States Supreme Court, finished the swearing-in oath, and the-new President shook his hand and stepped up to the microphone.\u003c/p\u003e\n\u003cp\u003e\"Look at those idiots standing out there freezing their tails off\"\u0027 Ben Cohn commenteel \"Do you know why they aren\u0027t home like normal human beings, watching it on television?\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" asked one of the other reporters.\u003c/p\u003e\n\u003cp\u003e\"Because a man is making history, my friends.\u0026nbsp;\u0026nbsp;One day all those people are going to tell their grandchildren that they were there the day Paul Ellison was sworn in.\u0026nbsp;\u0026nbsp;And they\u0027re all going to brag. \"I was so close I could have touched him.\"\u0027 \"You\u0027re a cynic, Cohn.\"\u003c/p\u003e\n\u003cp\u003e\"And proud of it.\u0026nbsp;\u0026nbsp;Every politician in the world comes out of the same cookie cutter.\u0026nbsp;\u0026nbsp;They\u0027re all in it for what they can get out of it.\"\u003c/p\u003e\n\u003cp\u003eThe truth was that Ben Cohn was not as cynical as he sounded. He had covered Paul Ellison\u0027s career from the beginning, and while it was true that he had not been impressed at first, as Ellison moved up the political ladder Ben Cohn began to change his opinion.\u0026nbsp;\u0026nbsp;This politician was nobody\u0027s yes-man.\u0026nbsp;\u0026nbsp;He was an oak in a forest of willows.\u003c/p\u003e\n\u003cp\u003eOutside, the sky exploded into icy sheets of rain, Ben Cohn hoped the weather was not an omen of the four years that lay ahead.\u0026nbsp;\u0026nbsp;He turned his attention back to the television set and President E.Ilison\u0027s speech.\u003c/p\u003e\n\u003cp\u003e\"I speak today not only to our allies but to those countries in the Soviet cainp.\u0026nbsp;\u0026nbsp;I say to them now, as we prepare to move into the twenty-first century, that there is no longer any room for confrontation and that we must learn to make the phrase \u0027one world\u0027 become a reality. Vast chasms lie between us, but the first priority of this administration will be to build unshakable bridges across those chasms.\"\u003c/p\u003e\n\u003cp\u003eHis words rang out with a deep, heartfelt sincerity.\u0026nbsp;\u0026nbsp;He, means it, Ben Cohn thought.\u0026nbsp;\u0026nbsp;I hope no one assassinates the guy.\u003c/p\u003e\n\u003cp\u003eIN JUNeTiON City, Kansas, it was a potbellied stove kind of day, bleak and raw, and snowing hard.\u0026nbsp;\u0026nbsp;Mary Ashley cautiously steered her old station wagon toward the center of the highway, where the snowplows had been at work.\u0026nbsp;\u0026nbsp;The storm was going to make her late for the class she was teaching.\u003c/p\u003e\n\u003cp\u003eFrom the car radio came the Presiden\u0027s voice: \"Because I believe that there is no problem that cannot be solved by genuine goodwill on both sides, the concrete wall around East Berlin and the iron curtain that surrounds the Soviet satellite countries must come down.\"\u003c/p\u003e\n\u003cp\u003eMary Ashley thought, I\u0027m glad I voted for him.\u0026nbsp;\u0026nbsp;Paul Ellison is going to make a great President.\u003c/p\u003e\n\u003cp\u003eIN BucH\u003dST, the capital of Remania, it was evening.\u0026nbsp;\u0026nbsp;President Alexandres lonescu sat in his office surrounded by half a dozen aides, listening to the broadcast on a shortwave radio.\u003c/p\u003e\n\u003cp\u003e\"As you are aware,\" the American President was saying, \"three years ago, upon the death of Remania\u0027s President, Nicolae CeauSSescu, ]Remania broke off diplomatic relations with the United States.\u0026nbsp;\u0026nbsp;I want to inform you now that we have approached the government of Remania and its President, Alexandres Ionescu, and he has agreed to reestablish diplomatic relations with our country.\u003c/p\u003e\n\u003cp\u003e\"One of our first official acts will be to send an ambassador to Remania.\u0026nbsp;\u0026nbsp;And that is merely the beginning.\u0026nbsp;\u0026nbsp;I have no intention of stopping there.\u0026nbsp;\u0026nbsp;Albania broke off all diplomatic relations with the United States in 1946.\u0026nbsp;\u0026nbsp;I intend to reestablish those ties.\u0026nbsp;\u0026nbsp;In addition, I intend to strengthen our diplomatic relations with Bulgaria, with iczechoslovakia, and with East Germany.\u003c/p\u003e\n\u003cp\u003e\"Sending our ambassador to Remania is the beginning of a worldwide people-to-people movement.\u0026nbsp;\u0026nbsp;Let us never forget that all mankind shares a common origin, common problems, and a common ultimate fate.\u0026nbsp;\u0026nbsp;Let us remember that the problems we share are greater than the problems that divide us, and that what divides us is of our own making.\"\u003c/p\u003e\n\u003cp\u003eOver the shortwave radio came the sounds of cheers and applause.\u003c/p\u003e\n\u003cp\u003eIN A heavily guarded villa in Neuilly, a suburb of Paris, the Remanian revolutionary leader, Marin Groza, was watching President Ellison on channel 2 television.\u003c/p\u003e\n\u003cp\u003e\"I think our time has come, Ley.\u0026nbsp;\u0026nbsp;He really means it,\" said Marin Groza thoughtfully.\u003c/p\u003e\n\u003cp\u003eLey Pastemak, his security chief, replied, \"Won\u0027t this help Ionescu?\"\u003c/p\u003e\n\u003cp\u003eMarin Groza shook his head.\u0026nbsp;\u0026nbsp;\"lonescu is a tyrant, so in the end nothing will help him.\u0026nbsp;\u0026nbsp;But I must be careful with my timing.\u0026nbsp;\u0026nbsp;I failed when I tried to overthrow him before.\u0026nbsp;\u0026nbsp;I must not fail again.\"\u003c/p\u003e\n\u003cp\u003ePETE Connors had downed almost a fifth of Scotch while watching the inaugural speech.\u0026nbsp;\u0026nbsp;He poured himself another glassful and turned back to the image on the television set.\u0026nbsp;\u0026nbsp;\"You filthy Communist!\" he yelled at the screen.\u0026nbsp;\u0026nbsp;\"This is my country, and the CIAs not gonna let you give it away.\u0026nbsp;\u0026nbsp;We\u0027re gonna stop you, Ellison.\u0026nbsp;\u0026nbsp;You can bet your bottom dollar on it\" \u003c/p\u003e","sourceLink":"https://allnovel.net/windmills-of-the-gods/page-2.html","bookId":2360,"creation":"Oct 5, 2019 10:08:17 AM","modification":"Oct 5, 2019 10:08:17 AM"}
