{"id":96295,"no":25,"title":"Page 25","content":"\u003cp\u003eA friend of Donny’s called a day or two later. He had a paint job coming up, just walls, as the ceiling was okay. Three days for sure, maybe four, and he could pay the same ten bucks an hour. Could Nick use the work?\u003c/p\u003e\n\u003cp\u003eThey wrapped it up in three days, and he had the weekend and two more days free before Donny rang up to say that he’d bid on that job and got it, and could Nick come by first thing the next morning? Keller wrote down the address and said he’d be there.\u003c/p\u003e\n\u003cp\u003e“I’ll tell you,” he said to Julia, “I’m beginning to believe I can make a living this way.”\u003c/p\u003e\n\u003cp\u003e“I don’t know why not. If I can make a living teaching fourth grade—”\u003c/p\u003e\n\u003cp\u003e“But you’ve got qualifications.”\u003c/p\u003e\n\u003cp\u003e“What, a teaching certificate? You’ve got qualifications, too. You’re sober, you show up on time, you do what you’re told, you speak English, and you don’t think you’re too good for the job. I’m proud of you, Nicholas.”\u003c/p\u003e\n\u003cp\u003eHe was used to Donny and the others calling him Nick, and he was getting used to being called Nicholas by Julia. She still called him Keller in bed, but he could sense that would change, and that was okay. He’d been lucky, he realized, in that the name he’d found in St. Patrick’s Cemetery was one he could live with. That hadn’t been a consideration when he was squinting at weathered headstones, all he’d cared about was that the dates worked, but he saw now that he could have been saddled with a far less acceptable name than Nick Edwards.\u003c/p\u003e\n\u003cp\u003eHe’d taken to giving her half his pay for his share of the rent and household expenses. She’d protested at first that it was too much, but he insisted, and she didn’t fight too hard. And what did he need money for, aside from buying gas for the car? (Although it might not be a bad idea to save up for a new car, or at least a new used car, because he was fine until somebody asked to see his registration.)\u003c/p\u003e\n\u003cp\u003eAfter dinner, they took their coffee out on the front porch. It was pleasant out there, watching people walk by, watching the day fade into twilight. He saw what she meant about the shrubbery, though. It had been allowed to grow a little too tall, and cut off a little too much of the light and the view.\u003c/p\u003e\n\u003cp\u003eHe could probably work out how to trim it. As soon as he had a day off, he’d see what he could do.\u003c/p\u003e\n\u003cp\u003eOne night, after they had made love, she broke the silence to point out that she’d called him Nicholas. What was really interesting was that he hadn’t even noticed. It seemed appropriate for her to call him that, in bed as well as out of it, because that seemed to be his name.\u003c/p\u003e\n\u003cp\u003eThat was what it said on his Social Security card and his passport, both of which had turned up in the mail. The same day’s mail that brought the passport also contained an invitation to apply for a credit card. He’d been preapproved, he was told, and he wondered just what criteria had been used to preapprove him. He had a mailing address and a pulse, and evidently that was all they required of him.\u003c/p\u003e\n\u003cp\u003eNow, under the slow-moving blades of the ceiling fan, he said, “I guess I might not have to sell those stamps after all.”\u003c/p\u003e\n\u003cp\u003e“What are you talking about?”\u003c/p\u003e\n\u003cp\u003eShe seemed alarmed, and he couldn’t imagine why.\u003c/p\u003e\n\u003cp\u003e“I thought you lost them,” she said. “I thought you said your whole collection was stolen.”\u003c/p\u003e\n\u003cp\u003e“It was, but I bought five rare stamps in Des Moines, before everything went to hell. They’d be tough to unload, but they’re still the closest thing I’ve got to a negotiable asset. The car’s worth more and there’s a bigger market for it, but you have to have clear title, and I don’t.”\u003c/p\u003e\n\u003cp\u003e“You bought the stamps in Des Moines?”\u003c/p\u003e\n\u003cp\u003eHe got the stamps from his top dresser drawer, managed to find his tongs, and switched on the bedside lamp to show her the five little squares of paper. She asked a few questions — how old were they, what were they worth — and he wound up telling her all about them, and the circumstances of their purchase.\u003c/p\u003e\n\u003cp\u003e“I would have had plenty of cash for the trip back to New York,” he said, “if I hadn’t shelled out six hundred dollars for these. That left me with less than two hundred. But at the time that looked like more than enough, because I’d be charging everything, including my flight home. I had the stamps all paid for when the announcement came over the radio.”\u003c/p\u003e\n\u003cp\u003e“You mean you hadn’t heard about the assassination?”\u003c/p\u003e\n\u003cp\u003e“Nobody had, not when I was talking myself into buying the stamps. The best I can make out, Longford was eating rubber chicken with the Rotarians right around the time I was parking my car in Mr. McCue’s driveway. I didn’t grasp the significance right away, I thought it was coincidence, me being in Des Moines the same time a major political figure was assassinated. I had a completely different job to do, at least I thought I did, and, well — what’s the matter?”\u003c/p\u003e\n\u003cp\u003e“Don’t you see?”\u003c/p\u003e\n\u003cp\u003e“See what?”\u003c/p\u003e\n\u003cp\u003e“You didn’t kill the man. Governor Longford. You didn’t kill him.”\u003c/p\u003e\n\u003cp\u003e“Well, no kidding. It seems to me I told you that a long time ago.”\u003c/p\u003e\n\u003cp\u003e“No, you don’t get it. You know you didn’t do it, and I know you didn’t do it, but what you and I know is not enough to stop all those policemen from looking for you.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“But if you were sitting in some stamp shop in — where did you say?”\u003c/p\u003e\n\u003cp\u003e“Urbandale.”\u003c/p\u003e\n\u003cp\u003e“Some stamp shop in Urbandale, Iowa. If you were sitting there at the very moment the governor was shot, and if Mr. McWhatsit was sitting across from you—”\u003c/p\u003e\n\u003cp\u003e“McCue.”\u003c/p\u003e\n\u003cp\u003e“Whatever.”\u003c/p\u003e\n\u003cp\u003e“His name used to be McWhatsit,” he said, “but his girlfriend said she wouldn’t marry him unless he changed it.”\u003c/p\u003e\n\u003cp\u003e“Shut up, for God’s sake, and let me get this out. This is important. If you were there and he was there, and he’ll remember because of the announcement on the radio, then doesn’t that prove you weren’t downtown shooting the governor? It doesn’t? Why not?”\u003c/p\u003e\n\u003cp\u003e“They went on making that announcement all day,” he said. “McCue will remember the sale, and he might even remember that it happened right around the time he heard about the assassination. But he won’t be able to swear exactly when that was, and even if he did a prosecutor could make him look like an idiot on the witness stand.”\u003c/p\u003e\n\u003cp\u003e“And a good defense attorney—”\u003c/p\u003e\n\u003cp\u003eBut she stopped when she saw the way he was shaking his head. “No,” he said gently. “There’s something you don’t understand. Let’s say I could prove my innocence. Let’s say McCue could offer testimony that would absolutely get me off the hook, and while we’re at it let’s say that some other witness, some rock-solid pillar of the community, could come along to corroborate his testimony. It doesn’t matter.”\u003c/p\u003e\n\u003cp\u003e27\u003c/p\u003e\n\u003cp\u003e“It doesn’t matter. The case would never come to trial. I wouldn’t live that long.”\u003c/p\u003e\n\u003cp\u003e“The police would kill you?”\u003c/p\u003e\n\u003cp\u003e“Not the police. The cops, the FBI, they’re all the least of it. The police never caught up with Dot, they never even knew she existed, and look what happened to her.”\u003c/p\u003e\n\u003cp\u003e“Who then? Oh.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“You told me his name. Al?”\u003c/p\u003e\n\u003cp\u003e“Call-Me-Al. Which only means that’s not his name, but it’ll do if we need something to call him. I wonder if he even knew what he was going to use me for when he first began setting me up. Well, that’s something else that doesn’t matter. Longford’s dead and I’m the guy everybody’s looking for, but if I turn up, I’m the fly in Al’s ointment. If he finds me, I’m dead. If the cops find me first, I’m still dead.”\u003c/p\u003e\n\u003cp\u003e“He would be able to make that happen?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Nothing to it. He’s pretty resourceful, that’s clear enough. And it’s not all that difficult to arrange for something to happen to someone in custody.”\u003c/p\u003e\n\u003cp\u003e“It doesn’t seem—”\u003c/p\u003e\n\u003cp\u003e“Fair?”\u003c/p\u003e\n\u003cp\u003e“That’s what I was going to say. But who ever said life was fair?”\u003c/p\u003e\n\u003cp\u003e“Somebody must have,” he said. “At one time or another. But it wasn’t me.”\u003c/p\u003e\n\u003cp\u003eA little later she said, “Suppose… no, it’s silly.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Oh, it’s straight out of TV. A man’s framed and the only way out is to solve the crime.”\u003c/p\u003e\n\u003cp\u003e“Like O.J.,” he said, “searching all the golf courses in Florida for the real killer.”\u003c/p\u003e\n\u003cp\u003e“I told you it was silly. Would you even know where to start?”\u003c/p\u003e\n\u003cp\u003e“Maybe a graveyard.”\u003c/p\u003e\n\u003cp\u003e“You think he’s dead?”\u003c/p\u003e\n\u003cp\u003e“I think Al’s a believer in playing it safe, and that would be the safest way to play it. He used me as the fall guy, because he knew there was no trail that could lead back from me to him. But the actual shooter would know somebody, Al or somebody who worked for Al, so there’d be some linkage there.”\u003c/p\u003e\n\u003cp\u003e“But no one would be looking for it because everybody would think you were the real shooter.”\u003c/p\u003e\n\u003cp\u003e“Right. And meanwhile, just to guard against the possibility of anybody finding out what really happened, or the chance the shooter would brag about what he’d done, because he was drunk or to increase his chances of getting laid—”\u003c/p\u003e\n\u003cp\u003e“Would that work?”\u003c/p\u003e\n\u003cp\u003e“I suppose it might, with a certain sort of woman. The point is, once the governor was dead, the shooter made the jump from asset to liability. If I had to guess, I’d say he took his last breath within forty-eight hours of the assassination.”\u003c/p\u003e\n\u003cp\u003e“So he’s not playing golf with O.J.”\u003c/p\u003e\n\u003cp\u003e“Not a chance. But he might be sharing peanut butter and banana sandwiches with Elvis.”\u003c/p\u003e\n\u003cp\u003eThat Thursday they ran into a plumbing problem at work. It demanded a higher level of expertise than Donny’s, so they knocked off early and left the field to a master plumber from Metairie. Keller came straight home so he could tell Lucille to take the rest of the day off, but found Julia on the front porch. He could tell she’d been crying.\u003c/p\u003e\n\u003cp\u003eThe first thing she said was that there was coffee in the kitchen, and he went there and filled two cups to give her a minute to compose herself. He brought them to the porch, and by then she’d freshened up a little.\u003c/p\u003e\n\u003cp\u003e“He almost died this morning,” she said. “Lucille’s not an RN but she’s had some training. His heart stopped, and either it started up again on its own or she got it going. She called the school where I was working and I came home, and by then she’d called the doctor, and he was here when I got here.”\u003c/p\u003e\n\u003cp\u003e“You said almost died. He’s all right?”\u003c/p\u003e\n\u003cp\u003e“He’s alive. Is that what you meant?”\u003c/p\u003e\n\u003cp\u003e“I guess so.”\u003c/p\u003e\n\u003cp\u003e“He had a small stroke. It affected his speech, but it’s not too bad. He’s just a little harder to understand, but he made himself very clear when the doctor wanted to take him to a hospital.”\u003c/p\u003e\n\u003cp\u003e“He didn’t want that?”\u003c/p\u003e\n\u003cp\u003e“He said he’d rather die first, and the doctor’s a crusty old bastard himself, and said that’s what it would probably come to. Daddy shot back that he was going to die anyway, and so was the damn doctor, and what was so bad about dying? Then the doctor gave him a shot so he could get some rest, but I think maybe it was just to shut him up, and then he told me that the thing to do now was get him to the hospital.” \u003c/p\u003e","sourceLink":"https://allnovel.net/hit-and-run-keller-4/page-25.html","bookId":2315,"creation":"Oct 5, 2019 6:20:25 PM","modification":"Oct 5, 2019 6:20:25 PM"}
