{"id":96274,"no":4,"title":"Page 4","content":"\u003cp\u003eHe followed directions to the drugstore — it was as good a place as any to find a pay phone — and called the number. If he’d done that in the first place, he thought, the job would be done by now. Okay, fair enough, he’d make the call now, and if he got the green light he’d go right back and tell the fellow he must have misheard him, and they’d go through the farce again, only this time he’d use the gun or his hands and finish the job once and for all.\u003c/p\u003e\n\u003cp\u003eHe made the call. “No, today’s no good,” he was told. “Give us a call first thing tomorrow morning.”\u003c/p\u003e\n\u003cp\u003eAnd he’d done just that, only to get the same message yet again. “Tomorrow,” the man told him. “Tomorrow’s a sure bet. In fact tomorrow morning you don’t even have to check with us, okay? Because it’s all set up. Anytime tomorrow, morning or afternoon, you can just go and do what you gotta do.”\u003c/p\u003e\n\u003cp\u003e“We’re all set for tomorrow,” he told Dot.\u003c/p\u003e\n\u003cp\u003e“High time.”\u003c/p\u003e\n\u003cp\u003e“You said it. I’ll be glad to get back.”\u003c/p\u003e\n\u003cp\u003e“Back to your own bed.”\u003c/p\u003e\n\u003cp\u003e“The bed’s okay. Tell you the truth, it’s better than my own. I’m overdue for a new mattress.”\u003c/p\u003e\n\u003cp\u003e“The things you don’t know about a person.”\u003c/p\u003e\n\u003cp\u003e“What I miss,” he said, “is my TV.”\u003c/p\u003e\n\u003cp\u003e“Fifty-inch, hi-def, plasma, flat panel. Did I forget anything?”\u003c/p\u003e\n\u003cp\u003e“No, and neither did the manufacturer. It’s just about perfect.”\u003c/p\u003e\n\u003cp\u003e“You’ve talked so much about the damn thing I’m gonna have to get one myself. I feel for you, Keller, having to make do with motel TV.”\u003c/p\u003e\n\u003cp\u003e“What’s aggravating,” he said, “is there’s no TiVo.”\u003c/p\u003e\n\u003cp\u003e“Now there I have to agree with you,” she said. “TiVo changed my life. And there you are, poor baby, stuck in Des Moines with all the commercials you used to be able to speed through.”\u003c/p\u003e\n\u003cp\u003e“And I can’t pause the thing when I go to the bathroom, or back up when there’s a line of dialogue I missed, and—”\u003c/p\u003e\n\u003cp\u003e“For God’s sake, hurry up and come home,” she said, “or I’m gonna have to tell Al you need a hardship bonus.”\u003c/p\u003e\n\u003cp\u003eHe rang off and started walking over to the TV, then stopped himself. He’d looked up stamp dealers in the Yellow Pages the previous afternoon, and he checked again, and called James McCue to make sure he was open for business. No reason to pack the suitcase this time, as he knew he’d be coming back to the motel, so all he’d done was grab up his Scott catalog and his tongs and head out the door.\u003c/p\u003e\n\u003cp\u003eThat was what, a couple of hours ago? Now the governor of Ohio was dead, and he had to do something and wasn’t sure what. If he’d packed his bag and wiped his room down, he wouldn’t have to go back to it. But he’d probably be going there anyway, because where else could he go?\u003c/p\u003e\n\u003cp\u003e4\u003c/p\u003e\n\u003cp\u003eWhen he got to the Days Inn he took a slow turn around the parking lot, looking for any sign of police activity, or indeed anyone at all taking a special interest in the place. But it looked the way it always looked, and he parked his car in its usual spot and went to his room.\u003c/p\u003e\n\u003cp\u003eInside, he turned on the television set. The assassination of Governor Longford was all over the dial, unless you wanted to watch QVC or the Food Channel. Keller chose CNN and heard a couple of experts trying to estimate the likelihood of riots in Cleveland. The weather, one of them pointed out, was a significant variable. Heat and humidity added up to riot weather, she said, while a cold snap and rain kept folks indoors.\u003c/p\u003e\n\u003cp\u003eThat was sort of interesting, but Keller, stuck in Des Moines, couldn’t bring himself to care about the weather in Cleveland. He hung in there while they talked the subject to death, but hit the Mute button in a hurry when they rang in a Nexium commercial.\u003c/p\u003e\n\u003cp\u003eAt least the remote had a Mute button. You couldn’t fast-forward, you couldn’t pause, and you couldn’t reverse, but the one thing you could do was make the damn thing shut up, and he did.\u003c/p\u003e\n\u003cp\u003eShould he pack?\u003c/p\u003e\n\u003cp\u003eHe wasn’t going to try leaving Des Moines, not yet. Whether all of this was coincidence or something a good deal more sinister, he’d be safer holed up than running around in the open. He hadn’t done anything, not even what he’d come here to do, but that wouldn’t matter to anybody who picked him up with bogus ID and an unregistered handgun just a matter of miles from where Longford had been shot dead.\u003c/p\u003e\n\u003cp\u003eBy two shots from a handgun — that’s what someone had been saying, just before they got the weather report from Cleveland, and it just now registered. An unknown assailant brandishing a handgun who’d fired twice at point-blank range and escaped — how, for God’s sake? — into the crowd.\u003c/p\u003e\n\u003cp\u003eA Glock, he thought. A Glock automatic, the gun he’d been offered and turned down. The gun he’d handled.\u003c/p\u003e\n\u003cp\u003eHe could remember the way the grip had fit his hand. And how he’d turned the gun over in his hands, deliberating, before handing it back to the man with the hairy ears. He’d be willing to bet that was the gun they’d used, and that it still had his prints on it. That’s why they’d offered him two guns, and the important gun wasn’t the one he’d chosen, it was the one he’d touched and rejected.\u003c/p\u003e\n\u003cp\u003eWell, that really iced the cupcake. All they had to do was pick him up — for anything at all, really — and he was finished. They’d match his prints to the prints on the Glock, and what could he possibly say?\u003c/p\u003e\n\u003cp\u003eI touched the gun, but I went for the revolver instead, because automatics tend to jam, although this one evidently didn’t. And I didn’t want to shoot a governor with it, just some mope weeding his lawn, and I never did shoot anybody, so what difference does it make?\u003c/p\u003e\n\u003cp\u003eYeah, right.\u003c/p\u003e\n\u003cp\u003eIf his prints were on file, if he’d ever been arrested or ever held a government job, if he’d ever done any of the innumerable things that move them to ink your fingers and record your prints, he wouldn’t stand a chance. But he’d led a charmed life thus far, so any prints on the Glock would lead them nowhere for the time being. Until they got their hands on him and got his hands on an ink pad, at which point it was pretty much all over.\u003c/p\u003e\n\u003cp\u003eOr was he getting ahead of himself here? He didn’t know it was the Glock, didn’t know that they’d recovered the gun. For all he knew the shooter had taken it away with him, in which case it hardly mattered whose prints were on it. He couldn’t be sure that wasn’t how it had happened.\u003c/p\u003e\n\u003cp\u003eExcept somehow he did know, just as he’d somehow known all along that this was a setup. And maybe that was why he’d been so ginchy in Albuquerque, all those months ago. There had been something off about Call-Me-Al from the jump. Paying in advance for unspecified services, calling Dot from out of the blue and telling her money was on its way, then calling again to confirm it had arrived and assure her he’d be in touch. And, months later, making contact once more and sending Keller on his way to New Mexico.\u003c/p\u003e\n\u003cp\u003eIt was, he had to admit, not a bad way to hire a hit man. Nobody, not Dot and not the person who did the work, had any idea who Call-Me-Al might be, or where he lived, or anything else about him. So if things went wrong and Keller wound up in a cell, he couldn’t get himself a deal by giving up his employer. He could give up Dot, but that’s as far back as it would reach, because there was nobody for Dot to give up. Al was out of anybody’s reach.\u003c/p\u003e\n\u003cp\u003eSay you were planning an extremely high-profile assassination. You wanted a patsy, a fall guy, to give some latter-day Warren Commission a plausible explanation of what had taken place.\u003c/p\u003e\n\u003cp\u003eKeller had never spent a lot of time on conspiracy theories, and was by no means convinced that the official explanations were wrong; it seemed entirely possible to him that Lee Harvey Oswald, acting alone, had shot down John F. Kennedy, and that James Earl Ray had done the same for Martin Luther King. He wasn’t going to bet the rent money that it happened like that, but he wouldn’t bet the other way, either. Both subjects seemed unlikely assassins, but was either one of them as wildly improbable as Sirhan Sirhan, the killer so witless they had to name him twice? And there was no question that he’d shot Bobby Kennedy, because they’d caught him in the act.\u003c/p\u003e\n\u003cp\u003eBut never mind what actually happened. If you were orchestrating something like that, a fall guy was a handy thing to have. And the best sort of fall guy would be someone who did this sort of thing for a living. If you wanted to frame someone for murder, why not pick a murderer? Hire him to kill some nonentity, and time it so he’s in the right place at the right time, and then frame him for the real killing, the important killing. But don’t let him actually do it, because then he might wind up in a position to rat you out. This way, when the cops picked him up, he couldn’t say anything because he wouldn’t know anything, and the closest he could come to giving a good account of himself would be to start yammering about how he’d come here to Des Moines to kill someone else. Some poor schlump with no criminal ties and no one looking to kill him, some guy whose sole offense was overzealous lawn care.\u003c/p\u003e\n\u003cp\u003eWonderful. The cops would love that one. Jesus, if they did pick him up, he’d know better than to try to sell that story. Or, for that matter, any other story he could come up with just now.\u003c/p\u003e\n\u003cp\u003eHe was sitting in front of the television set, his eyes on the screen, but he was too caught up in his own train of thought for his mind to pay any real attention to what his eyes were seeing. None of it registered, until something about the image on the screen forced its way into his consciousness.\u003c/p\u003e\n\u003cp\u003eIt was a picture of a man, though why they were showing it was unclear, as the sound was still muted. Keller didn’t recognize the guy, and yet it seemed to him that there was something familiar about him. He was middle-aged, with a full head of dark hair and something furtive about him. Not the face of someone you’d be inclined to trust, and—\u003c/p\u003e\n\u003cp\u003eHe shot out a hand, groped for the remote. By the time he’d triggered the Mute button it was too late, the picture was gone, and the news itself gone with it. They played a commercial, one Keller especially hated, the one with the moth coming in to assure the sleeping woman of eight hours of restful sleep. Any woman he’d ever known, a moth came in and settled on her face, what she’d do was leap up and start screaming, then pick up a broom and chase the thing all over the house.\u003c/p\u003e\n\u003cp\u003eHe looked for a button to push to back the thing up, but this was TiVo-less TV, and you had to watch everything in real time. And he’d missed it, but who said CNN was the only game in town? He began switching channels, getting half-second glimpses of everything from a lacrosse match to a Texas Hold-’Em tournament, from a rerun of The Match Game to a hair replacement infomercial, and before he knew it he’d run the table and was back at CNN, staring once again at his own picture on the screen.\u003c/p\u003e\n\u003cp\u003eFurtive? Is that how he’d seen himself? No he just looked a little tentative, as if he was trying to work out what he was doing there, with his face on national TV for all the world to see.\u003c/p\u003e\n\u003cp\u003eThe sound was on now, and somebody was saying something, but he couldn’t take it in; it was all he could do to look at his own unfortunate face and the caption under it. THE FACE OF A KILLER, it said. \u003c/p\u003e","sourceLink":"https://allnovel.net/hit-and-run-keller-4/page-4.html","bookId":2315,"creation":"Oct 5, 2019 6:20:25 PM","modification":"Oct 5, 2019 6:20:25 PM"}
