{"id":57734,"no":13,"title":"Vol 1 Chapter 7-1","content":"\u003cp\u003eThe room Jie created was huge. He led the other three downstairs and left the three girls outside. In front of them was an area as big as a soccer field. They were amazed by it. Jie said with pride, \"I didn\u0027t know that you can change the room, but after figuring it out, you just have to focus and imagine on where you want to change while holding the room\u0027s handle outside. God will also amend any imperfections you have. Just like this training ground.\"\u003c/p\u003e\n\u003cp\u003eThis training ground was separated into a few areas. There was a target practice field, a long distance running field, an obstacle running field, and a close combat platform.\u003c/p\u003e\n\u003cp\u003e\"Starting today, everyday from 8am to 12pm, 1pm to 6pm, and 7pm to 12am. We will train non-stop. We won\u0027t see any results on our body with just these few days so we will start with shooting and close combat. You will also have to run and test your limits. Once you know your limits you can plan ahead in the movies. Anyway, there is a lot of training we have to do.\"\u003c/p\u003e\n\u003cp\u003eJie gave everyone a description of the purposes of each training area. Long distance running and obstacle running was obvious. Close combat was necessary, shooting was an important factor in sci-fi movies. Everyone agreed to his plans.\u003c/p\u003e\n\u003cp\u003eZheng asked, \"What about guns? Do we go exchange them for training? Or are we using your desert eagle?\"\u003c/p\u003e\n\u003cp\u003e\"Didn\u0027t I say you can create anything in your room? It\u0027s just that you can\u0027t take many of these things out of the room. Go take a look at that storehouse. I exchanged a magazine on guns, then created them according to the descriptions. You can also test the power of sci-fi weapons. Even though they are expensive, you should probably exchange for one when you have the points.\"\u003c/p\u003e\n\u003cp\u003eXiaoyi exclaimed then ran toward the target practice field. Lan sighed. \"You probably can\u0027t create magical weapons in this room, right?\"\u003c/p\u003e\n\u003cp\u003eJie nodded. \"No. I kept trying but couldn\u0027t create them. God probably put a restriction on this.\"\u003c/p\u003e\n\u003cp\u003eLan touched her forehead. \"The most difficult movies are probably the supernatural ones. God wouldn\u0027t let us get familiar with this type of weapon to increase their difficulty. Anyway, if I have the points I will probably only get one sci-fi weapon and spend the rest on magical weapons. That\u0027s what I am planning.\"\u003c/p\u003e\n\u003cp\u003eZheng and Jie nodded. Especially Zheng, that 1500 points didn\u0027t go to waste.\u003c/p\u003e\n\u003cp\u003eJie spent the rest of the afternoon teaching them how to use guns. Of course, other than testing out sci-fi guns for fun, they put their focus on normal guns, especially on their shooting accuracy. Lan and Xiaoyi spent the whole time doing target practice.\u003c/p\u003e\n\u003cp\u003eJie led Zheng to the combat platform. Jie only spent 100 points on his gun and the rest enhancing himself. He probably was also in the army back in the real world. He was much more experienced than Zheng in close combat. It only took a while for him to knock down Zheng.\u003c/p\u003e\n\u003cp\u003eJie shook his head. \"Not enough. Your speed and strength are there but you can\u0027t keep calm. You have much more strength than before so you can\u0027t control the punches you throw. Learn how to control your speed and power the first few days. Then you will have to learn to use your abilities. We will depend on you for the next movie.\"\u003c/p\u003e\n\u003cp\u003eZheng nodded. He definitely felt he couldn\u0027t control his strength, and he was rather curious about his Qi. Was it as amazing as the novels described it? The punches he received from Jie could knock a normal person out, but it was only painful at first then he felt a warm sensation moving through his body and the pain dissipated.\u003c/p\u003e\n\u003cp\u003eThe four of them had dinner at Jie\u0027s room. Then Zheng brought Lori back. On the way back, he was still thinking of the training. He figured out the function of Qi. Other than lessening pain, when he spread it through his body, his speed and strength would double. That was the only time he beat Jie in combat. Jie couldn\u0027t even do anything against that kind of power. But then he could barely move for ten minutes. Seemed like this could only be used in danger.\u003c/p\u003e\n\u003cp\u003eZheng still hadn\u0027t figured out how to use the Blood Energy yet. Since it was on the same rank as Qi, it shouldn\u0027t be too weak.\u003c/p\u003e\n\u003cp\u003e\"Ahem!\"\u003c/p\u003e\n\u003cp\u003eIt woke Zheng up from his thoughts. Lori was standing in front of him with a red face. She seemed mad at him. \"You\u0027re walking with me and your mind is elsewhere. Are you regretting you didn\u0027t create another beautiful woman when you saw those two women? I am just a teen, mature women are more attractive, is that what you\u0027re thinking?\"\u003c/p\u003e\n\u003cp\u003eHe held onto her hands and smiled. \"I am thinking about this afternoon\u0027s training. I will tell you everything if you want to know. Be confident with yourself. You know there were almost a hundred guys trying to date you in school. And you know I\u0027ve always liked you, how could I think about someone else?\"\u003c/p\u003e\n\u003cp\u003eShe looked at him for a while, then smiled. \"Then you will tell me in a bit how you spent these years. You just said you will tell me everything right?\"\u003c/p\u003e\n\u003cp\u003eZheng was startled then he forced out a smile.\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-1-chapter-6-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-1-chapter-7-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-1-chapter-7-1","bookId":1512,"creation":"Sep 10, 2019 6:20:19 AM","modification":"Sep 10, 2019 6:20:19 AM"}
