{"id":57857,"no":136,"title":"Vol 7: Chapter 3-1.","content":"\u003cp\u003e\u003cstrong\u003eVol 7: Chapter 3-1.\u003c/strong\u003e\u003c/p\u003e \n\u003cdiv\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003e\"Lan, give me the position and speed of the enemies.\"\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eZheng said to Lan through the communication device. In front of him was a forest.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eJie couldn\u0027t answer the last question that day. After a long silence, he muttered. \"I will tell you inside the next movie.\"\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eAlthough Zheng was still curious about Jie\u0027s identity, how he knew so much, yet didn\u0027t give them any advice. He was curious, but an unexplainable feeling stopped him from inquiring any further. They laughed and ate in Jie\u0027s room just like before, hiding the heavy topics inside their hearts.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eA few days later, Yinkong also chose her enhancement, one called Shining genetics. It also started at rank D and maxed out at rank AA, a total of five stages. Yinkong spent most of what she obtained from the last movie on this enhancement, including all the rewards and the majority of her points. To everyone\u0027s surprise, she gave 2000 points to Lan to get her mental capacity up. Lan could now scan up to forty kilometers with her ability. This number allowed them to monitor a lot of things in most movies.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eYinkong\u0027s enhancement increased her speed substantially. Its special ability, Shining, increases her speed further by several folds for ten seconds. As long as her reaction was up to par, she could kill anyone during this time. The enhancement also strengthened her mental fortitude. Judging from the description of it, she shouldn\u0027t have to worry about normal mind controls anymore.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eHonglu chose something interesting. He didn\u0027t use his only rank D reward for an enhancement but rather exchanged a magical item, a jade pendant with defensive ability. This pendant would block critical attacks automatically thirty times or until the energy within depletes, similar to Shiva\u0027s Dharmacakra. Of course its not as good since the Dharmacakra was a rank C item.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eEveryone had basically finished enhancing. The team\u0027s power level had increased by at least one magnitude. And more importantly, Lan\u0027s psyche scan helped them progressed to becoming an actual team. Everyone obtained their roles. Of course it was still not perfect but as more newbies come and go, this team will eventually be completed and become a team that could survive any movies easily.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eZheng finally found the time to choose a sci-fi weapon. He still had a rank C and D rewards. The rank C one had been decided to use toward an entry level movement technique. Afterward, he would have a rank D reward and 4770 points left. What seemed like so much from the last movie just used up like this. It was near impossible to save up.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eThe only thing Zheng required from the weapon was power and speed, of course, he would also like unlimited ammunition if possible. After looking over, it was Honglu that pointed him to an interesting weapon.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003e\"Air cannon!\"\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eA cylindrical item about the size of a hand. It was almost the same gadget from Doraemon, although this one cost a rank D reward and 2000 points. The description was this weapon has unlimited ammunition because it uses pressurized, condensed air for attack. The user has to provide the energy to use it. Qi and blood energy were also forms of energy it accepts, so this made it count as half a magical weapon. However, it was ineffective against spiritual beings.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eSince the description contained the words extremely powerful and unlimited ammunition, and also accepted his Qi and blood energy, Zheng made up his mind to exchange it. Most sci-fi weapons didn\u0027t need any rewards to exchange so the ones that did were usually more powerful or contained special effects. Zheng also hoped so.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eHe wasn\u0027t disappointed. He just had to channel energy into the air cannon then pull the trigger. It would suck in nearby air and shoot out a shock wave after about two seconds. After testing the power of the shock wave, the vibration could turn a plate armor into sand and had a reach of fifty meters. Instead of air cannon, it was more fitting to call it a pulse cannon.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eThis new sci-fi weapon made Zheng delighted. He also finally exchanged the movement technique and a large quantity of magical bullets. These bullets tended to be consumed in large quantities and were also inexpensive so he didn\u0027t hesitate exchanging them. After everything was set, Zheng only had 1270 points left.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eOnly three days until the next movie. Honglu suggested they perform a training battle against each other. Forbidding the use of powerful weapons and attacking critical areas. Zheng teamed up with Lan while the other four people formed a team. They would use the training to get accustomed to their new enhancements.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eLan\u0027s voice came through the communication device. \"Two people in the forest to your left, Heng and Yinkong. Heng was hiding on top of a tree, the tree wasn\u0027t too big. Yinkong was hiding under the shadows of a tree. She was not far off from the edge of the forest. Jie and Honglu are moving very fast. They should reach us in ten minutes. Hurry.\"\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eZheng sighed with a special feeling. The psyche scan was too useful. Lan became the eyes of the team, and if she could obtain the Soul Link ability and send what she sees directly into their minds, then their enemies would feel like totally naked in from of them, and couldn\u0027t even realize they were watching.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eZheng then sprinted toward the forest. When he was about to step in, an arrow came through the trees with great power, speed, and accuracy. It reached Zheng in the blink of an eye.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eHowever, Zheng had an incredible reaction speed, especially after the Vampire Count bloodline enhancement. His stats reached a very high point. Plus, this arrow was shot from afar. Although it was still powerful, Zheng easily brushed it aside. He then jumped six meters high and stood on top of a tree.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eThis was from the movement technique. When Zheng wanted to use the technique, his Qi would circulate inside his body in a special path. Then he would feel his body became light. A small jump could bring him up to several meters high. He fell in love with this feeling at once. This was just only the entry level technique, what about the higher ranked ones?\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eThe movement technique offset the speed and range limitation Zheng had. Especially in complex terrains like this. He could almost break out of the limitation that terrains put on close combat. After he got up on the tree, a figure jumped off a tree from afar.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eThat was definitely Heng, Zheng laughed to himself. He jumped at Heng\u0027s direction at once. The movement technique consumes a huge amount of Qi. He could only use it for several minutes but it was enough. He could reach Heng in under a minute with his current speed.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eAs he was jumping on the branches, a silver knife flew past him, almost touching his foot. That gave Zheng a shock since any little bit of injury during this training meant he would lose.\u003c/span\u003e\n \u003cbr\u003e \n \u003cspan style\u003d\"font-family: inherit;\"\u003eWhile he was shocked, a figure was running at him with high speed. She pulled out her flaming dagger and jumped up when she was seven meters away, with the dagger aiming at Zheng\u0027s feet. When Zheng finally looked down, the dagger was already ten centimeters away. It was too late to dodge.\u003c/span\u003e\n\u003c/div\u003e \n\u003cdiv\u003e \n \u003cbr\u003e\n\u003c/div\u003e \n\u003cdiv style\u003d\"clear: both;\"\u003e \n\u003c/div\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-7-chapter-2-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-7-chapter-3-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-7-chapter-3-01","bookId":1512,"creation":"Sep 10, 2019 6:20:19 AM","modification":"Sep 10, 2019 6:20:19 AM"}
