{"id":57738,"no":17,"title":"Vol 1 Chapter 8-2","content":"\u003cp\u003e\u003cstrong\u003eVol 1: Chapter 8-2.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWhen he saw the look of astonishment from everyone in Zheng’s group, he smiled. “I was just testing, but now I am certain. Can you explain the situation? I can’t imagine how I got here.”\u003c/p\u003e\n\u003cp\u003eJie and Lan were about to say something, but Zheng waved his hand and interrupted them. “When was the last time you saw this movie?”\u003c/p\u003e\n\u003cp\u003eXuan adjusted his glasses. “About seven years ago. I can still remember something this recent quite vividly.”\u003c/p\u003e\n\u003cp\u003eEveryone was shocked, remembering something from seven years like this. Then what were they? People without memories?\u003c/p\u003e\n\u003cp\u003eXuan turned to the other newbies. “Everyone’s probably seen the message, ‘Want to know the meaning of life? Want to live… a real life?’, from the internet right?”\u003c/p\u003e\n\u003cp\u003ePeople started to answer and their answers all agreed with it. Furthermore, everyone chose YES.\u003c/p\u003e\n\u003cp\u003e“This message appeared when I was coding. The crucial part is my computer was not connected to the internet at the time. I was not aware of any virus that could break through the firewall I coded. So I immediately started to crack the origin and source code of this message. And guess what I found out?”\u003c/p\u003e\n\u003cp\u003eXuan adjusted his glasses and continued in a calm manner. “This message is not coded using 0 or 1’s. The source code is not a computer program. It’s created with characters and symbols. If memory serves me right, the characters are a combination of the oracle bone script, cuneiform script, and hieroglyphics. Three of the oldest forms of writing in the world. There are also numerous unexplainable symbols.”\u003c/p\u003e\n\u003cp\u003e“I was curious, you have to know that when a computer breaks through the limit of 0s and 1s, artificial intelligence will develop. Especially when this message was coded with so many characters. So I chose the option with the most characters and symbols, which happened to be YES. The outcome was miraculous. I ended up here. Even though I don’t know what this place is, it should be far away from Beijing.”\u003c/p\u003e\n\u003cp\u003eZheng looked around at the stunned people, to be honest, he was shocked by it also. It seemed like the newbies were impressive this time. And who is this guy?\u003c/p\u003e\n\u003cp\u003eZheng hesitated then asked, “Who are you? Why do you think this place is far away from Beijing?”\u003c/p\u003e\n\u003cp\u003e“If I can’t deduce this with my IQ of 220 then I wasted my life. Let me introduce myself again. Chu Xuan, Colonel. I was in a secret military base in Beijing, the second top secret base of China. I don’t believe anyone can kidnap me out of there. Furthermore, my detector device shows that I haven’t left the base, yet I am obviously somewhere else.”\u003c/p\u003e\n\u003cp\u003eXuan showed them his watch. According to him, this watch was specifically designed for top researchers to prevent them from getting kidnapped. It remained connected to the computer in the military base, and sent signals of its location and how far it was away from the base.\u003c/p\u003e\n\u003cp\u003e“The only possible explanation is I left the dimension instantly. Since I am in a different dimension, the watch can’t connect to the base’s computer and thinks I am still there. So it seems like absurd explanation is actually correct.”\u003c/p\u003e\n\u003cp\u003eZheng looked at Jie. “Lan, go explain to them about this place and why we are here.”\u003c/p\u003e\n\u003cp\u003eLan’s eyes brightened then smiled. “Thank you guys. Hehe. I will make you guys a meal when we go back. Women are naturally weaker than men physically so these 100 points can go toward my cell vitality and muscle density.”\u003c/p\u003e\n\u003cp\u003eThen Lan explained this world to the newbies and that they were in Alien. The watch on their hand shows them their mission: kill the Aliens. Of course she kept the information about side quests from them. This was valuable info that only belonged to the four of them.\u003c/p\u003e\n\u003cp\u003eMost people either didn’t believe it or panicked. Other than Xuan who was looking around calmly, there were two more people looking at Zheng’s group. This was when Zheng noticed a Caucasian with a large build.\u003c/p\u003e\n\u003cp\u003eHe walked over to these two people. “What are your names? Can you understand Chinese?”\u003c/p\u003e\n\u003cp\u003eOne of them was slender but had dense muscles. He didn’t shake Zheng’s hand and took a step back. “You can call me Zero. I don’t want to answer any other questions.”\u003c/p\u003e\n\u003cp\u003eThe Caucasian shook Zheng’s hands openly. “Kampa Lovski. Of course I can understand Mandarin. Just that I am not used to it. Your hands are… strong.”\u003c/p\u003e\n\u003cp\u003eZheng then turned to look at the others. Aside from the three hooligans on the ground, there were two middle aged fat men, standing together cautiously and holding suitcases. These two were probably businessmen that knew each other in the real world. Two twenty-something young men. One of them was smart enough to inspect the surroundings, the other was flirting with the woman. Based on their clothing, they were probably white collar workers. They seemed to have calmed down.\u003c/p\u003e\n\u003cp\u003eZheng shook his head then shouted, “Everyone please introduce your occupation, age, and what you’re good at, so we can assign your responsibilities properly.”\u003c/p\u003e\n\u003cp\u003eThese people hesitated, then Xuan said, “Even though that’s what you are saying, we can’t confirm those are the truth. Do you have anything to prove you’re not lying? Like the things you’ve exchanged or your physical abilities?”\u003c/p\u003e\n\u003cp\u003eJie snorted. “You think it’s easy to survive in horror movies? Maybe people that lived through twenty movies could satisfy your request. They can definitely penetrate through steel with a punch.”\u003c/p\u003e\n\u003cp\u003eXuan shook his head. “No, you’re mistaken. I am not being sarcastic. But for our cooperation to go smoothly it’s better to eliminate our wariness.” Then he looked at Zero and Kampa.\u003c/p\u003e\n\u003cp\u003eHe added, “Then just let us take a look at the hemostatic spray and bandage.”\u003c/p\u003e\n\u003cp\u003eJie turned to Xiaoyi and nodded. Xiaoyi threw the spray and bandage toward Xuan. Xuan asked again, “Anyone have a knife? The sharper the better.”\u003c/p\u003e\n\u003cp\u003eZheng and his group looked at each other. They actually don’t have any close combat weapons. At this time Kampa took out a dagger from his pocket and threw it over to Xuan. Zheng just realized this Caucasian and Zero were focusing on Xuan.\u003c/p\u003e\n\u003cp\u003eXuan sliced his wrist decisively, as if that hand didn’t belong to him. Blood started pouring out like water. Lan and the other woman started to scream as they saw it. The rest of the newbies were startled also. Then Xuan sprayed his wrist with the hemostatic spray. Miraculously, the wound started to clot and the bleeding stopped after a few seconds. Then he bandaged the wound and handed the dagger, spray, and bandage to Kampa.\u003c/p\u003e\n\u003cp\u003eAs Zheng’s group looked, they noticed Kampa and Zero did the same thing. After they finished Kampa said, “I am a member of an international mercenary group. A top ranked gunner. My nickname is Overlord. To be honest, I would rather you to be lying. This is a terrible place.”\u003c/p\u003e\n\u003cp\u003eZero returned the spray and bandage to Xiaoyi, then he said coldly, “I don’t have a name, just call me Zero. I am an assassin specialized in long distance sniping. Unfortunately this movie doesn’t require my skill. And there are no sniper rifles here.”\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-1-chapter-8-1\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-1-chapter-8-3\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-1-chapter-8-2","bookId":1512,"creation":"Sep 10, 2019 6:20:19 AM","modification":"Sep 10, 2019 6:20:19 AM"}
