{"id":57934,"no":213,"title":"Vol 10: Chapter 13-1.","content":"\u003cp\u003e\u003cstrong\u003eVol 10: Chapter 13-1.\u003c/strong\u003e\u003c/p\u003e Zheng dragged Techoi into the valley then tore off his head. He smashed the head and starting running along the valley.\n\u003cbr\u003e \n\u003cbr\u003e \"Red Flame!\" Zheng activated the ability. The flame engulfed his body and slowly burned away the smell of blood on him. His recovery was also impressive. The wound on his leg was starting to heal up. He flipped over a wall then hid in the darkness.\n\u003cbr\u003e \n\u003cbr\u003e Two minutes later, a hoverboard flew across his head. A Caucasian yelled in an angry yet slightly panicking tone. \"Leader, I can\u0027t find him. There was a sense of flame just a moment ago but nothing is here now.\"\n\u003cbr\u003e \n\u003cbr\u003e He paused for a second then yelled. \"Team China\u0027s leader, I know you are here! Stop f*cking hiding in a shell like a turtle! Our leader said if you come out and fight us face to face, you will still have a chance. But if you are going to continue hiding, we don\u0027t mind using any means necessary!\"\n\u003cbr\u003e \n\u003cbr\u003e Zheng hid himself silently. The distance between him and Francis was about ten meters high. He couldn\u0027t reach the man that easily with the movement technique. So he could only continue waiting.\n\u003cbr\u003e \n\u003cbr\u003e Francis wasn\u0027t a threat, even when he shapeshifts into a bear. All he had was just strength. If they had to fight in close range, Zheng was confident in killing him within five minutes. But no, he was not the only one. They still had one person that never attacked, but gave him immense pressure, that clone of his. He didn\u0027t have the confidence to win against his clone, even though they never fought. His instincts told him to stay away.\n\u003cbr\u003e \n\u003cbr\u003e Francis seemed impatient. His hoverboard suddenly slanted at an angle and pointed the front at the ground. It fired several mini missiles at the area around Zheng. Before he could react, the explosion shockwaves had reached his body.\n\u003cbr\u003e \n\u003cbr\u003e The missiles didn\u0027t hit him directly, only the shockwaves, so it wasn\u0027t much of a problem. His body was strong enough to sustain these attacks. However, the houses and walls around him were affected by the explosions. Fires started burning and several houses were collapsing at his direction.\n\u003cbr\u003e \n\u003cbr\u003e Zheng clenched his teeth as he was about to charge out. At the same time, a rocket shot out from the darkness and hit the hoverboard. Francis was blasted off during the explosion and Zheng took this opportunity to come out and headed straight for him.\n\u003cbr\u003e \n\u003cbr\u003e Right as Zheng ran to where Francis was falling, gunshots started raining down at him and he was hit in the left arm. Fortunately, the movement technique was active at the time. So he was knocked away during the first bullet.\n\u003cbr\u003e \n\u003cbr\u003e A large figure walked out from the smoke a hundred meters away. It was three meters tall, wearing a uniform similar to the Nemsis\u0027s, only its chest was exposed, and a large eye on its chest looked at him.\n\u003cbr\u003e \n\u003cbr\u003e As soon as Zheng saw the gatling gun turned to him, he jumped backward. The collapsed buildings added to the complex structure of the valleys. He was able to easily enter the smoke in this terrain.\n\u003cbr\u003e \n\u003cbr\u003e The Nemesis howled, seemingly disappointed at Zheng\u0027s escape. It then turned to Francis who was still in a daze. It fired the gatling gun in the man\u0027s screams. However, the bullets stopped in front of Francis. A translucent field blocked them off but as the gatling gun continued firing, the field was getting dimmer.\n\u003cbr\u003e \n\u003cbr\u003e Looking that the bullets were going to reach him soon, Francis growled. His body enlarged and transformed into a bear. He charged into a wall and continued charging through the walls while his body took some hits.\n\u003cbr\u003e \n\u003cbr\u003e The whole building that he charged through collapsed. He was lucky that the collapsed building just blocked a rocket shot from the Nemesis. It felt like that was not enough and fired two more. Two more explosions at where the bear went but it was uncertain if the rockets hit the bear. The Nemesis howled and walked toward the fire.\n\u003cbr\u003e \n\u003cbr\u003e Zheng was panting as he ran in the valley. A few hundred meters later, he hid in a corner then immediately took out the knife. He cut open where the bullet hit then put his hand into the wound and picked the large bullet out.\n\u003cbr\u003e \n\u003cbr\u003e \"Didn\u0027t hit any bones.\" This was the best outcome for him, didn\u0027t hit any bones, didn\u0027t damage the nerves. Zheng let out a sigh of relief. When he took out the hemostasis spray, the wound had started healing. This bullet was large enough to completely break off a normal person\u0027s arm and he blocked it off with his muscle. His body had surpassed normal humans by a large margin.\n\u003cbr\u003e \n\u003cbr\u003e Zheng suddenly thought of a possibility. If it succeeds, he might have a chance to defeat team Devil. And if the clone wasn\u0027t overly strong, the firepower from One could reverse the current situation.\n\u003cbr\u003e \n\u003cbr\u003e Just then, with several explosions and the sound of walls collapsing, a large figure charged at his way. The black bear was focused on running away and ran through god knows how many walls. Explosions were following behind him at a hundred meters distance. He could imagine the Nemesis was following all the way.\n\u003cbr\u003e \n\u003cbr\u003e Zheng quickly simulated Xuan\u0027s mind. He calculated there was a 60% chance of killing Francis, and 30% chance of making One to remember him. But the possibility was too low for him to get near One.\n\u003cbr\u003e \n\u003cbr\u003e The bear was panting. There were several deep bullet wounds on his back. But he had thick muscles anyway so they weren\u0027t much of a threat. Though the wounds caused him to run more excitedly. He didn\u0027t care if it was a wall in front of him anymore. He knew the wall would collapse after he charge through. His strength enabled him to charge all the way here, destroying many houses, and even zombies on the way were crushed.\n\u003cbr\u003e \n\u003cbr\u003e Another wall appeared in front of the bear. He lowered his head and charged straight into the wall. As soon as he broke through the wall, a knife stabbed at his head from the side. Yet, the knife wasn\u0027t sharp enough. It stopped at the frontal bone by the thick layer of flesh. However, the wielder of the knife had such strength that he forced the knife to the side and tore off a big piece of flesh and skin from the bear\u0027s face.\n\u003cbr\u003e \n\u003cbr\u003e As soon as the bear opened its mouth to scream, Zheng jumped up and kicked its head. It was sent flying ten meters away through the wall. Zheng held onto the air cannon and knife then followed it out. \n\u003cdiv style\u003d\"clear: both;\"\u003e \n\u003c/div\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-10-chapter-12\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-10-chapter-13-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-10-chapter-13-01","bookId":1512,"creation":"Sep 10, 2019 6:20:19 AM","modification":"Sep 10, 2019 6:20:19 AM"}
