{"id":57948,"no":227,"title":"Vol 11: Chapter 5-1.","content":"\u003cp\u003e\u003cstrong\u003eVol 11: Chapter 5-1.\u003c/strong\u003e\u003c/p\u003e The group rode back to Hamunaptra on the dirigible. This adventure in the tomb was too intense and not only left them with injuries but they also needed to take a good rest. The ten minutes in the tomb strained their spirit.\n\u003cbr\u003e \n\u003cbr\u003e Zheng could not disagree with the proposition. He had sixty days to kill the Scorpion King anyway. In the movie, the protagonists only spent seven days. So he felt he shouldn\u0027t rush it in case God does something interesting again.\n\u003cbr\u003e \n\u003cbr\u003e \"This spear is good stuff. Powerful and convenient. The only issue is I have to get it back every time. I think there\u0027s a support item from God that returns arrows you shoot out. I will have to research the support items after I go back.\" Zheng muttered to himself as he looked down on the desert.\n\u003cbr\u003e \n\u003cbr\u003e \"God? What\u0027s that?\" Jonathan asked next to him. He was holding a glass of martini.\n\u003cbr\u003e \n\u003cbr\u003e Zheng turned his head around and laughed. \"You alright now? You and your sister slept from yesterday till noon today.\"\n\u003cbr\u003e \n\u003cbr\u003e Jonathan patted his shoulder. \"Fine, fine. It\u0027s just that I hadn\u0027t experienced such adventures for quite some time so it felt unfamiliar. Give it a few more times and it will get better. Haha.\"\n\u003cbr\u003e \n\u003cbr\u003e Zheng said. \"You sure you want a few more?\"\n\u003cbr\u003e \n\u003cbr\u003e Jonathan waved his hands. \"Uh. I was kidding.\"\n\u003cbr\u003e \n\u003cbr\u003e Zheng laughed then threw a cigarette to Jonathan. \"I made it difficult for you guys. I could have gone alone if I know more hieroglyphs. I can simulate Tengyi but it only allows me to use the few words he taught me better.\"\n\u003cbr\u003e \n\u003cbr\u003e Jonathan took a smoke and said in a surprise. \"Nice tobacco. I don’t know about the simulate since you aren\u0027t from our world. But I like adventures. In fact, we felt something\u0027s missing since the trip to the tomb.\"\n\u003cbr\u003e \n\u003cbr\u003e Zheng patted his shoulder. \"Missing the treasures, right? Haha. I have to thank you for this. I wouldn’t have known what to do otherwise.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No need for thanks. Though is there really a diamond the size of three soccer balls in the Scorpion King\u0027s treasures? It brings my expectations up.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am sorry. I said it is the size of one soccer ball.\"\n\u003cbr\u003e \n\u003cbr\u003e The group returned to Hamunaptra without any problems. The excavation was also going smoothly under the assistance of the Medjais. There was no need to worry about a shortage of supplies in the desert or desert pirates. In the few days that Zheng was away, they had excavated a large part of the second level.\n\u003cbr\u003e \n\u003cbr\u003e \"We encountered a little danger. A scarab chewed a worker\u0027s hand yesterday. Fortunately, it ran away instead of entering the worker\u0027s body.\" An elder reported to Ardeth. He looked terrified when he mentioned the scarab.\n\u003cbr\u003e \n\u003cbr\u003e Zheng slapped his own forehead. \"Oh right. I didn\u0027t think careful enough. Let the curator buy some flamethrowers from Cairo. We are only at the second level. The next few levels underneath have a lot of scarabs so you will need flamethrowers to take care of them. Also focus on the cliff by the statue of Ra. The Book of Amun-Ra was lost below the cliff. Preserve the altar after you dig it out. Anyway, remember to take good care of these two things when we are away.\"\n\u003cbr\u003e \n\u003cbr\u003e The elder nodded. Zheng turned to Ardeth. \"Can you get some things for me? I need explosives, lots of them. If you plan to come along, I think you also need some weapons.\"\n\u003cbr\u003e \n\u003cbr\u003e Ardeth laughed. \"Don\u0027t worry, my friend. I had already told my men to bring me weapons. Explosives aren\u0027t a problem. Though they are much less powerful than the ones you have.\"\n\u003cbr\u003e \n\u003cbr\u003e Zheng didn\u0027t say much more. He left Ardeth with the Medjais then went back to his tent to study the spear and bracelet. These were the most valuable items he obtained in The Mummy world. The Spear of Osiris was at least a rank B item.\n\u003cbr\u003e \n\u003cbr\u003e Its power was determined by his blood energy and qi. In other words, when he grows stronger, the spear would become more powerful. He channeled half his total energy last time and the throw reached a thousand meters away with a ten meter area of effect. Would these numbers double if he were to channel all his energy at once?\n\u003cbr\u003e \n\u003cbr\u003e The Bracelet of Anubis would allow him to summon the army of Anubis once he killed the Scorpion King. He could summon six mummies with blood energy currently. He had tested that if he used the summoning spell again, the previous six mummies would disappear and replaced by new ones. So he couldn\u0027t stay in a safe place to summon an army. But what if he had the bracelet?\n\u003cbr\u003e \n\u003cbr\u003e Three hundred warriors from the army of Anubis that was stronger than the mummies individually. If he completes this mission, their team\u0027s strength would reach an insane level.\n\u003cbr\u003e \n\u003cbr\u003e However, he could imagine how difficult this mission was by the power of this item.\n\u003cbr\u003e \n\u003cbr\u003e As Zheng carefully studied the two items, he suddenly found something. The tiny scratches on the items were actually filled with strange symbols and characters. He had seen some of these characters on the protective charms he exchanged. When he channeled energy into the spear, the energy flowed through these symbols and characters then the spear glowed in a golden light. That might probably be the source of its power.\n\u003cbr\u003e \n\u003cbr\u003e Zheng remembered some things Xuan said. If human ancestors created God, then the monsters in the movie worlds were probably enemies our ancestors encountered, and the Spear of Osiris and Bracelet of Anubis were weapons they created. Similar to items forged by Chinese immortals in legends, these items were created by the mysterious symbols and characters instead of modern technology. Which meant that they could be mass produced!\n\u003cbr\u003e \n\u003cbr\u003e \"Shit. This would be game breaking if every member has a spear and bracelet. We could start with a thousand warriors then everyone throw their spears. Haha.\"\n\u003cbr\u003e \n\u003cbr\u003e Zheng laughed in a self mockery. He knew this was impossible. He didn\u0027t know these symbols and characters. Tengyi might be able to recognize a few of them then Xuan could analyze it and create an item. However, Zheng wouldn\u0027t even be able to make a model with gold.\n\u003cbr\u003e \n\u003cbr\u003e \"I will revive everyone first. There\u0027s only so much I can do. Xuan, you will be first. Please don\u0027t reject me. Lend me your strength!\"\n\u003cbr\u003e \n\u003cbr\u003e Zheng put the items back into the ring then walked out of the tent into the excavation site.\n\u003cbr\u003e \n\u003cdiv\u003e \n \u003cbr\u003e\n\u003c/div\u003e \n\u003cdiv style\u003d\"clear: both;\"\u003e \n\u003c/div\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-11-chapter-4-03\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-11-chapter-5-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-11-chapter-5-01","bookId":1512,"creation":"Sep 10, 2019 6:20:19 AM","modification":"Sep 10, 2019 6:20:19 AM"}
