{"id":58137,"no":416,"title":"Vol 16 Chapter 4-1","content":"\u003cp\u003eThe stress turned Zheng\u0027s eyes red. He was ready to use Soru with instant Destruction then he saw a layer of ice appeared between Frodo and the Ringwraith.\u003c/p\u003e\n\u003cp\u003eDong! The dark sword hit the ice wall and a crack spread throughout but it didn\u0027t break.\u003c/p\u003e\n\u003cp\u003eGungnir stood by the bottom of the ice wall and shouted. \"I can\u0027t keep this up much longer, f*cking come and help!\" He waved his arms and the crack on the ice wall began to close up. It was very small when the dark sword landed on the ice wall again.\u003c/p\u003e\n\u003cp\u003eThe Ringwraith continued hacking on it again and again. The ice wall\u0027s recovery rate couldn\u0027t keep up.\u003c/p\u003e\n\u003cp\u003e\"Ice age!\" The stress was getting into Gungnir. He was an ability user and couldn\u0027t perform well in both close or long range fights. Given how powerful this Ringwraith was, he would instantly get slashed in halves if the Ringwraith got in close range. He lacked reaction speed and combat techniques. The ice wall was the only thing he could do in this situation.\u003c/p\u003e\n\u003cp\u003eGungnir crushed the serpent gem in his hand. The temperature in a two meter radius around him dropped substantially. He raised his arm and his arm transformed into ice and fused with the ice wall. Two seconds later, the ice wall extended outward and froze the hooves of the skeleton horse. However, these hooves were burning with fire and broke free almost instantly. The Ringwraith pulled the lead rope then the horse leaped forward.\u003c/p\u003e\n\u003cp\u003eThis was Gungnir\u0027s time to show off. The gem provided him with ice energy when he crushed it. He only unlocked the second stage of the genetic constraint and his Hie Hie no Mi enhancement wasn\u0027t at the highest rank so he couldn\u0027t fully utilize the devil fruit\u0027s power unless he use an ice attribute energy stone, which was a rank C reward. The energy stones he had was originally prepared for life and death situations. He could never expect to use one at the beginning of the movie, even if this one was obtained after he arrived. He decided he had to kill this Ringwraith. He wouldn\u0027t take a loss in any deals.\u003c/p\u003e\n\u003cp\u003eThe skeleton horse leaped and Gungnir raised his other arm. Both his arms had transformed into ice. The ice wall on top of him moved like a creature and turned into a ten meter big hand. The hand reached for the Ringwraith.\u003c/p\u003e\n\u003cp\u003eBang! It grabbed the Ringwraith and slapped downward. The hand pressed a deep hole on the ground.\u003c/p\u003e\n\u003cp\u003eGungnir let out a sigh of relief. He immediately ran over to the hand. The people around him was surprised and followed after. Zheng also came over. He estimated Gungnir\u0027s strength then ran toward the two Hobbits.\u003c/p\u003e\n\u003cp\u003eFrodo and Sam were completely shocked. They had never seen such intense battles in their lives.\u003c/p\u003e\n\u003cp\u003eZheng crouched with a smile and looked at them. \"We are fine. Don\u0027t worry. We promised Gandalf to escort you to The Prancing Pony and we will keep this promise.\"\u003c/p\u003e\n\u003cp\u003eThe Hobbits nodded repeatedly. They were obviously scared and didn\u0027t know what to say. They just continued to stare at the slab of ice.\u003c/p\u003e\n\u003cp\u003eXuan walked over to Zheng. \"What\u0027s your estimate? How much certainty you have in beating Gungnir?\"\u003c/p\u003e\n\u003cp\u003eZheng replied in a low voice. \"I don\u0027t know if he can turn his whole body into ice when he uses this ability. If he can, then I will have to burn him with red flame. I only have 60% chance of winning in this scenario. If he can only turn his arms into ice, I can kill him with Destruction.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" Xuan casually responded. Then he walked toward the huge slab of ice.\u003c/p\u003e\n\u003cp\u003eZheng immediately grabbed him and asked in an even lower voice. \"Tell me the truth. Are you scheming these two teams? Do you plan to wipe them along with the other two teams? This may sound absurd but I feel like it\u0027s something you will do.\"\u003c/p\u003e\n\u003cp\u003eXuan glanced at him. \"That\u0027s impossible. We don\u0027t have the conditions to accomplish this. The alliance is necessary or we have no way of taking on team East America and team Celestial. If we are to judge team Celestial based on team Devil, they aren\u0027t a team we can take on by ourselves. But I am surprised you finally learned to be merciless.\" He patted Zheng\u0027s shoulder as if he was gratified.\u003c/p\u003e\n\u003cp\u003eZheng didn\u0027t know whether to laugh or cry. He was scared of Xuan wiping the two teams with some trap without a word. The rewards from that would be so huge but he was more worried about team Celestial. He asked that question to remind Xuan of the risks and was labeled as merciless.\u003c/p\u003e\n\u003cp\u003eOn the other side, most people of the three teams had gathered around the slab of ice. The Ringwraith and skeleton horse were frozen in the center of the ice. The Ringwraith was still in the position of holding the lead rope and swinging his sword.\u003c/p\u003e\n\u003cp\u003e\"It was so powerful. The Ringwraiths in the movie don\u0027t have much strength but they are so powerful here. They are more like death knights than Ringwraiths.\" A teenager from team Northern Ice Land loudly said. He seemed like a veteran and not newbie.\u003c/p\u003e\n\u003cp\u003e\"True.\" Gungnir touched the ice and muttered to himself.\u003c/p\u003e\n\u003cp\u003e(I was trying to crush it but it looks unharmed. The toughness of this armor is stupid. What should I do? I caught it. I am not going to let someone else kill it. But if I use that skill, it will reveal my trump card. That\u0027s not going to go well if team Africa or team China have ill intentions.)\u003c/p\u003e\n\u003cp\u003eGungnir looked at the Ringwraith in silence. After a while, he said. \"Marvis, bring me Alex\u0027s spear.\"\u003c/p\u003e\n\u003cp\u003eThe girl with bow from his team ran over to the corpse of the young man and picked up the ice spear. She didn\u0027t even look at the corpse.\u003c/p\u003e\n\u003cp\u003eGungnir smiled at the others. His baby face was indeed charming. Without a word, he stabbed the spear into the ice. A crevice opened up on the ice and let his spear move through. The spear pierced the Ringwraith\u0027s helm.\u003c/p\u003e\n\u003cp\u003eSizz. A dense black mist came out through the crevice. The mist floated upward about ten meters then it dissipated.\u003c/p\u003e\n\u003cp\u003e\"That wasn\u0027t worth it. Only a rank D reward and 2000 points. I used a rank C energy stone.\" Gungnir sighed. He even threw the spear onto the ground to express his anger.\u003c/p\u003e\n\u003cp\u003eThe others couldn\u0027t tell if he was acting since he was the only one who killed a Ringwraith. The amount of rewards were only his words. Though no one said anything. He was the one who caught the Ringwraith after all. No one was qualified to complain even if he withheld this information.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s go. Our resting ends. The Ringwraith\u0027s power exceeded our expectation. This was only one Ringwraith. If the remaining eight appear at the same time, we can only run. We can\u0027t afford to take unnecessary breaks before we reach Bree!\" Zheng took a deep breath and said to the group.\u003c/p\u003e\n\u003cp\u003eHe displayed the qualities of a leader in that fight so most people in the three teams subconsciously started walking. Some veterans looked at each other and followed. Then the two leaders also followed. Half a minute later, the group entered the farm field.\u003c/p\u003e\n\u003cp\u003eWhat they didn\u0027t notice was Ringwraith\u0027s armor began breaking down into dust but the skeleton horse remained intact. Its eyes still shining a red light.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-16-chapter-3-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-16-chapter-4-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-16-chapter-4-01","bookId":1512,"creation":"Sep 10, 2019 6:20:20 AM","modification":"Sep 10, 2019 6:20:20 AM"}
