{"id":58143,"no":422,"title":"Vol 16 Chapter 6-1","content":"\u003cp\u003eZheng looked at the skeleton horse with surprise. To be honest, the horse didn\u0027t look disgusting. It was composed of bones but the bones were shiny black. There was not a bit of rotten meat. It was incredibly stylish that no words could describe it. Though the burning flame on its hooves and eyes looked worrying.\u003c/p\u003e\n\u003cp\u003eZheng just noticed the black armor covering the horse. A layer of symbols and characters were carved on the armor. The bones of the horse were also carved with these symbols and characters. They looked similar to the rune words Zheng had seen. Which meant this horse was indeed a magical creation and not an undead creature.\u003c/p\u003e\n\u003cp\u003e\"Since God said you can ride it, there shouldn\u0027t be any issues I hope.\" Zheng muttered. He flipped himself onto the horse. The horse was two meters tall, a lot bigger than regular horses. Its stylish appearance got Zheng excited for a bit.\u003c/p\u003e\n\u003cp\u003eHowever, the horse simply stood there no matter how much Zheng pulled the lead rope. Two minutes later, he had to stop in defeat.\u003c/p\u003e\n\u003cp\u003e\"Oh yeah, the Ringwraith was sending his black mist into the horse but there isn\u0027t any mist right now. Was that the non-Yang energy?\" Zheng suddenly thought.\u003c/p\u003e\n\u003cp\u003eHe immediately channeled his blood energy. The energy moved through his legs and into the horse without any obstacle. Once he channeled 20% of his total blood energy, the horse cried.\u003c/p\u003e\n\u003cp\u003eThe burning flame in its eyes turned to a blood color, the same color as his red flame. Same thing with the flame on its hooves. A red mist came out from its body. The mist looked denser than the black mist from before and gave the horse a feeling of bloodshed.\u003c/p\u003e\n\u003cp\u003eZheng pulled the lead rope again. The horse let out a whinny then began to run. It ran straight toward a tree in front then ran onto the tree as if it was the ground. Zheng didn’t feel the gravity pulling him downward. The anti-gravity attribute also applied to him. He only felt gravity pulling down on the horse\u0027s back no matter which direction the horse was standing on.\u003c/p\u003e\n\u003cp\u003eZheng pondered. The horse moved at a speed between the level 6 and level 7 Ringwraiths. Its speed was probably depended on the quantity and quality of the energy from its master. Zheng\u0027s blood energy wasn\u0027t a low rank so its speed was not slow either.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t familiar with this anti-gravity moving but he believed he only need a few to a dozen days of practice to master it. At that time, his strength would see an increase in complex or awful terrains by at least 50%. Even on normal grounds, the speed of the horse could save him from using energy for Explosion and the movement technique.\u003c/p\u003e\n\u003cp\u003e\"Good stuff. Man, got to capture a few more. Wait. We were killing the horses along with the Ringwraiths before. That was such a waste. The value of the horses are on par with the authentic Sky Sticks. Sigh. There are still two Ringwraiths alive. We have to capture these two Nightmares. And Gungnir only froze the first horse when he killed the first Ringwraith. Yes. I have to go seize that one before anyone else.\" Zheng murmured.\u003c/p\u003e\n\u003cp\u003eHe was aware of the usefulness of the horse. So he would rather be a bandit and seize the horse than giving it away with humility.\u003c/p\u003e\n\u003cp\u003eZheng pulled the lead rope and the horse stopped on a leaf. He called for Lan\u0027s name in his mind. Soon, Lan replied. \"Zheng! Are you all right? I didn\u0027t want to bother you when you were fighting. Where are you? I can\u0027t see you in my scan but I can sense the waves of your mind.\"\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t see me?\" Zheng connected to Lan\u0027s psyche scan and indeed, neither he nor the horse was in the image even when he found the withered tree he was standing on.\u003c/p\u003e\n\u003cp\u003e\"Could it be that the mist from the horse has the property of masking from psyche scan?\" He immediately thought of this possibility and cried with surprise. This was highly probable.\u003c/p\u003e\n\u003cp\u003eLan interrupted his orgasm and said. \"One of the Ringwraith got away and went after Xuan\u0027s group. Do you have any way to help them? They are in dire danger. The druid had been killed already.\"\u003c/p\u003e\n\u003cp\u003eZheng\u0027s heart skipped a beat. A scan of the other group was sent into his mind. On the ground lay a white wolf in halves. Richard was fighting with the Ringwraith in Berserker mode. If it wasn\u0027t the Hobbits attracting the attention of the Ringwraith, that dark sword would have killed Richard already.\u003c/p\u003e\n\u003cp\u003eXuan was acting strange. He stood by the Hobbits. Every time the Ringwraith was about to land the final blow on Richard, he had a Hobbit put on the One Ring, which would instantly attract the attention of the Ringwraith. The Hobbit then took off the ring after a few seconds to avoid becoming controlled. The next time Richard fell in danger, Xuan would have another Hobbit put on the ring. Still, Richard\u0027s movements were getting slower with time as the wounds on his body increased.\u003c/p\u003e\n\u003cp\u003eYinKong was hiding within the shadows of the trees and attacked the Ringwraith from behind. She managed to slice off the arm that held the shield despite the impressive speed and reaction of the Ringwraith. In return, the Ringwraith cut open a wound on her chest. Blood covered her chest.\u003c/p\u003e\n\u003cp\u003eChengXiao didn\u0027t have a weapon so he all he could do was worry.\u003c/p\u003e\n\u003cp\u003eZheng saw the scene through the Soul Link on Xuan. He was well aware Richard was the main force in this fight. If Richard were to get killed, the Ringwraith could finish everyone else in just several swings. YinKong had high attack power but only in assassination and ambushes. She was not as good as Richard on face to face fights.\u003c/p\u003e\n\u003cp\u003eSeeing that Richard was getting slower. The duration of his Berserker was about to end. Zheng felt anxious. With the attack power of the Ringwraith, it would take him one swing of the dark sword for each person. Zheng didn\u0027t want to see three more bodies in halves.\u003c/p\u003e\n\u003cp\u003e\"Please! Don\u0027t die! Wait for me! Please!\"\u003c/p\u003e\n\u003cp\u003eHe pulled the lead rope. The skeleton horse ran to the top of the tree then it dashed on top of the leaves. It looked like the horse turned into a red shadow as it sped toward the group.\u003c/p\u003e\n\u003cp\u003eZheng was panicking. All three of those were comrades that accompanied him through life and death situations. Even ChengXiao had died with him before. No one had another chance to get revived. They were also non-replaceable members of the team. Team China would not come to this point without them. And team China would lose all hope of chasing up to team Devil without them.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t die! We promised to fight together until the end and return to the real world together!\" Zheng\u0027s eyes turned red from the anxiousness.\u003c/p\u003e\n\u003cp\u003eRichard had gotten very slow now. The dark sword moved forward and stabbed a hole in his chest. He fell backward. At the same time, the Ringwraith pulled the lead rope and the horse leaped toward the Hobbits. Xuan was right in front of the Ringwraith.\u003c/p\u003e\n\u003cp\u003e\"No!\" Zheng roared.\u003c/p\u003e\n\u003cp\u003eBehind the Ringwraith where Xuan\u0027s vision was blocked, YinKong\u0027s body was becoming blurry. She held the sword with both hands then she swung the sword repeatedly at a speed invisible to the bare eyes. Her whole body turned blurry. As Xuan looked peacefully, the Ringwraith and skeleton horse trembled violently. Once the trembling stopped, they split up into pieces.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-16-chapter-5-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-16-chapter-6-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-16-chapter-6-01","bookId":1512,"creation":"Sep 10, 2019 6:20:20 AM","modification":"Sep 10, 2019 6:20:20 AM"}
