{"id":58262,"no":541,"title":"Vol 18 Chapter 10-2","content":"\u003cp\u003eYinKong followed the sound into the hallway. She ran ahead of everyone since she was the fastest and Zheng hesitated before he moved. As she left everyone’s sight after making a turn, an unnatural feeling struck her. She drew out Excalibur and held it in front of her throat.\u003c/p\u003e\n\u003cp\u003eClank!\u003c/p\u003e\n\u003cp\u003eThe invisible sword clashed with something. Sparks flew in every direction. YinKong was pushed back from the force of impact.\u003c/p\u003e\n\u003cp\u003e“Hoho. You blocked it. You added protection to your throat after dying to the string last time. An assassin shouldn’t have any fear, my little cousin. You can’t be an assassin anymore once fear sprouts in you.”\u003c/p\u003e\n\u003cp\u003eA man with long hair walked out of the darkness from the other end of the hall. He lightly flicked the string with his finger then looked over to YinKong with a smile. He was the person YinKong had been chasing after for so long, the ZhuiKong from team Devil.\u003c/p\u003e\n\u003cp\u003eYinKong did not charge up like she did the previous times. The gap of their strengths was wide. It wasn’t possible for her to take him head on. She was also cautious as she had noticed the strangeness of this place. No one caught up to her after the few seconds she stopped. She knew Freddy might have targeted her. This wasn’t the same dimension as the others were in. Lastly, she was wavering. Her hatred toward ZhuiKong wavered.\u003c/p\u003e\n\u003cp\u003eSeeing that YinKong was staring at him with a pair of cold eyes, ZhuiKong laughed. He slowly walked to her. “Do you really not plan to fight me? Do you think I am merely an illusion created by Freddy? Oh, my little cousin.”\u003c/p\u003e\n\u003cp\u003eYinKong did not move until ZhuiKong said these words. She leaped backward because a wave of killing intent exploded from ZhuiKong. The killing intent forced her to react with her instinct. She leaped out of the hand reaching forward.\u003c/p\u003e\n\u003cp\u003e“See? I am not just an illusion… I am the materialization of the one in your heart. Or should I say the materialization of your fear. Do you like such a real me?” He continued walking toward YinKong.\u003c/p\u003e\n\u003cp\u003eThe materialization of fear? It struck YinKong when she realized the hole in her heart had grown so big. A feeling different from hate had manifested from her. It was hope or a sense of expectation she had for ZhuiKong. She was hoping that ZhuiKong only killed their friends and comrades due to a concealed reason. This hope contradicted with the hatred she had. That was why she wasn’t as impulsive.\u003c/p\u003e\n\u003cp\u003eWavering was fatal to an assassin compared to intense emotions such as anger, affection, fear. Conflicts in the heart would halt her blade, because weapons waver between hitting its target or not like its user.\u003c/p\u003e\n\u003cp\u003eYinKong took a deep breath and calmed herself. “Yes. I shouldn’t waver. No matter if there’s a reason behind what you have done, their deaths have become a fact. The end result is I can only seek revenge from you. Is that it? This is the result you wish for.” Her eyes looked a little watery.\u003c/p\u003e\n\u003cp\u003eZhuiKong laughed. “You are basically right except the result is a little different. You aren’t seeking revenge. You became my toy. I can’t wait to slice the person that I loved so dearly into pieces. Do you know how I killed your stupid friends? I sliced them like this, one slice at a time.”\u003c/p\u003e\n\u003cp\u003eZhuiKong suddenly pulled out a head from behind. His dagger carved on the head. Blood and flesh was falling to the ground. Worse yet, the head was crying miserably as if it was alive.\u003c/p\u003e\n\u003cp\u003eYinKong clenched her teeth and tightened her grip on the sword. She stared at ZhuiKong coldly. That head belonged to one of her friends. She was a girl quite close to her. Despite knowing this was probably an illusion, anger boiled within her from sight of the brutal treatment.\u003c/p\u003e\n\u003cp\u003eThe extensive assassin training since YinKong was a child held her back from attacking. She wouldn’t even have felt such anger if it weren’t ZhuiKong. She gripped Excalibur tightly and watched the illusion show.\u003c/p\u003e\n\u003cp\u003eZhuiKong was entertaining himself without regard of what YinKong was thinking or doing. He tortured this human head until all the flesh and blood were shaved clean, leaving behind a white skull. Yet, the skull continued to cried in pain on his palm.\u003c/p\u003e\n\u003cp\u003e“Don’t you feel ecstatic, my little cousin? Watching someone you know so well die in my hands, and then dismembered, tortured, or perhaps even worse, destroy them mentally before their death, make them into a maniac and retard. Isn’t this feeling ecstatic? Haha.” He threw the skull to the ground and pulled out another head from behind. He carved the lead in the same manner.\u003c/p\u003e\n\u003cp\u003eThe skull rolled toward YinKong. The illusion was so real that she couldn’t notice any flaw despite knowing everything was fake. As she intended to step away from the skull, it stopped. A girl’s voice came out.\u003c/p\u003e\n\u003cp\u003e“It hurts, sis. It hurts. My whole body hurts. I can’t see. I can’t hear. Sis, kill me. It hurts so much… kill me. Sis…”\u003c/p\u003e\n\u003cp\u003eThe voice weeped as if a pitiful girl was talking to her sister. Yet, the scene of a skull talking and a man carving a crying human head was appalling and disgusting. It was enough to stop a normal man’s heart from fright.\u003c/p\u003e\n\u003cp\u003eYinKong could no longer contain her tears. Her mental defense collapsed when she saw those who she had known, heard the voices of her friends, and witnessed what ZuiKong was doing. She swung Excalibur as tears rained down her face. The sword crushed the skull. YinKong charged at ZuiKong in madness.\u003c/p\u003e\n\u003cp\u003eShe disappeared into the hallway.\u003c/p\u003e\n\u003cp\u003eZheng couldn’t help but bring the rest of the team back to the living room. Everyone followed the same script. No one remembered Kampa nor YinKong after their disappearances. Their names also vanished from the paper. If he didn’t still remember them, it would appear that the two never existed.\u003c/p\u003e\n\u003cp\u003e(Five people left. Xuan, ChengXiao, TengYi, LiuYu, and me. If my analysis is correct, things are coming to an end. The only question is what HongLu last said. What other method is there to wake a person than physically waking him? And how do you make the nightmare disappear?)\u003c/p\u003e\n\u003cp\u003eZheng pondered quietly in the living room. He thought about the ordeal the team was going through and whether or not they could persevere through the mental battle. All he could do was wait… wait until the thing he was clinging on broke apart.\u003c/p\u003e\n\u003cp\u003e(If the dream is really constructed with my mind as the foundation, then breaking apart my desire to live on will allow Freddy to drag me into the despair dream. The result will be decided at that instant. However, I still don’t get the last step. I have found the origin. I have found the key. I know my the desire I cling onto. But how do I stop the nightmare? How do I accomplish the last step HongLu said?)\u003c/p\u003e\n\u003cp\u003eZheng looked at the people around him again. He sighed then pinched his hair.\u003c/p\u003e\n\u003cp\u003e(I don’t have much time left. I need to figure it out before they all get dragged into the despair dream! What other way can you stop the nightmare?)\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-18-chapter-10-01\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-18-chapter-11-01\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-18-chapter-10-02","bookId":1512,"creation":"Sep 10, 2019 6:20:20 AM","modification":"Sep 10, 2019 6:20:20 AM"}
