{"id":58263,"no":542,"title":"Vol 18 Chapter 11-1","content":"\u003cp\u003eChengXiao, TengYi, and LiuYu finally felt the strangeness as Kampa and YinKong disappeared. They didn’t remember these members. It was an unconscious feeling. Was team China only consisted of the few of them? Leaving the one newbie out, did the team originally only had four people?\u003c/p\u003e\n\u003cp\u003eThe dream’s rules were also strange in that it could remove memories related to a person. Everyone had been through so many movies. Their bonds had grown very deep. Yet, they still forgot about their comrades. Zheng felt a chillness stroked his heart every time he thought about this.\u003c/p\u003e\n\u003cp\u003eThe recognition of this strangeness created doubts in the members. Yet, when they looked into their memories, they couldn’t recall the other members. There were no traces of them even in the movies prior to Nightmare on Elm Street.\u003c/p\u003e\n\u003cp\u003e“Were there really other members? And once they disappear, we will forget them?” ChengXiao asked in an out of character serious tone.\u003c/p\u003e\n\u003cp\u003eZheng nodded. “Right. Most members have disappeared at this point. We are the only ones left. You can’t even remember their names. I am the only one to still remember them.”\u003c/p\u003e\n\u003cp\u003eChengXiao scratched his head. “But my memories don’t have other people. How about you describe some characteristics. It could help us recall them.”\u003c/p\u003e\n\u003cp\u003eThis was the second day after Kampa and YinKong were gone. Zheng gave up looking for the two and waited for the movie to develop. He was pondering on the last step of ending this dream world. ChengXiao finally came to ask him due to the strange feeling they got.\u003c/p\u003e\n\u003cp\u003eZheng thought for a moment. “Uh. There’s a man named Zero. He’s a calm and reliable sniper.”\u003c/p\u003e\n\u003cp\u003e“Don’t remember.”\u003c/p\u003e\n\u003cp\u003e“And a man named Kampa. He’s the gunner.”\u003c/p\u003e\n\u003cp\u003e“Don’t remember.”\u003c/p\u003e\n\u003cp\u003e“Oh. And a girl name YinKong. Sixteen. Great figure. You always call her…”\u003c/p\u003e\n\u003cp\u003e“Big breast babyface!”\u003c/p\u003e\n\u003cp\u003eChengXiao’s eyes glowed. His hands squeezed the air in a disgusting manner. If his eyes didn’t look so awake, Zheng would have believed he had fallen into a dream, an erotic dream.\u003c/p\u003e\n\u003cp\u003eZheng nodded. “So you remember her? Weird.”\u003c/p\u003e\n\u003cp\u003e“I don’t.” ChengXiao replied. “But sixteen with great figure are the highest grade. Big breast babyface is a courteous title. Only such girls are worthwhile for such title!”\u003c/p\u003e\n\u003cp\u003e(Why don’t I feel any courtesy in the title? Has a pervert’s intuition broken the boundary of the dream?)\u003c/p\u003e\n\u003cp\u003eZheng didn’t know whether to laugh or not. He was distressed by being unable to figure out how to end the dream and ChengXiao lightened his mood. Guess a pervert could never change. Who could tell if he would ever change? It was going to be difficult. Unless ChengXiao himself decided to get rid of this trait, the only way would be…\u003c/p\u003e\n\u003cp\u003eZheng was stunned at this moment. He stared at ChengXiao with an unbelievable expression. He seemed utterly shocked.\u003c/p\u003e\n\u003cp\u003eChengXiao was also shocked at Zheng’s reaction. He thought something had happened and jumped up. He scanned the surrounding but did not find anything out of the ordinary.\u003c/p\u003e\n\u003cp\u003eHe said, “Please. Troll more creatively. We aren’t kids anymore.”\u003c/p\u003e\n\u003cp\u003eZheng calmed the shock ness and shook his head. “No. I wasn’t trying to scare you. I finally get what HongLu meant in the end. Fuck. This movie has no solutions for real. I don’t know what God is thinking. Could there be a deeper layer of meaning to this movie?”\u003c/p\u003e\n\u003cp\u003eChengXiao asked, “Who’s HongLu? Doesn’t sound like a girl’s name.”\u003c/p\u003e\n\u003cp\u003eZheng slightly shook his head again and replied in a serious tone, “Anyway, since I have found the last key, I should bear this responsibility. ChengXiao, if Freddy attacks you, keep your heart true to yourself. Don’t get lost in the dream. Get it?”\u003c/p\u003e\n\u003cp\u003eChengXiao laughed after a pause. “Don’t worry about me. My will is solid as steel. Who in this world can make me soft? And if she does… haha.”\u003c/p\u003e\n\u003cp\u003e(Please. Stop with such misleading phrases. But for real though, the gap in his heart and the way he deals with it would probably make him the least likely person to enter the despair dream. Does he even know how to spell despair?) Zheng thought about him maliciously.\u003c/p\u003e\n\u003cp\u003eTeam China had only five people left. What ought to be done would continue to go on, things like eating and getting through the night.\u003c/p\u003e\n\u003cp\u003eZheng thought that there was no use struggling at this point. He just needed to solve the puzzle and leave the world with the right method. As for now, he couldn’t offer any help to the rest of the team.\u003c/p\u003e\n\u003cp\u003eZheng returned to his room after dinner. He sat on the bed and meditated, focusing his attention at one point.\u003c/p\u003e\n\u003cp\u003e(If Freddy constructed this world using my consciousness as the foundation, then I should be able to use Qi, Blood Energy, Refined Qi, the flags, and even my created abilities. This has been true so far. However, brute force is not the solution to this movie so these powers aren’t of much help to our situation.\u003c/p\u003e\n\u003cp\u003e(The circumstance is rather simple. My desire is for the team to survive. Thus, the hardest blow to me is to make them disappear. Lori and my clone can also break my defense. Since my mind is the foundation, Freddy also won’t attack me before he takes down all the members. The dream world would collapse without me and the others will wake.\u003c/p\u003e\n\u003cp\u003e(He chose me because I revived the members so I know of their past and weaknesses. Which also explains why the newbies died in front of me while the others disappeared. Freddy in the original movie only has the power of a normal person. Anyone of us in my mind is way stronger than him. Even TengYi could kill him one on one. So he has to rely on using the gaps in our heart to drag us into the despair dream. The newbies on the other hand aren’t threatening to him so he didn’t need that extra step and left me with their corpses. What a bully.)\u003c/p\u003e\n\u003cp\u003eZheng was in the third stage. He sighed. The long hours staying in the third stage the past several days had given him a slight headache. However, simulation of HongLu increased by a fair percentage. Some answers became clear to him, such as the intention of this movie.\u003c/p\u003e\n\u003cp\u003eThe heart’s devil was the biggest obstacle to a person’s improvement. One could feel dejected and lose the will to fight due to the heart’s devil. The heart’s devil Zheng realized on the path between the early fourth stage and mid fourth stage could lead him to death.\u003c/p\u003e\n\u003cp\u003eThis movie was God’s arrangement as a trial of the heart. If he overcame his heart’s devil, he would step into mid fourth stage where he had the power to rival his clone. If he failed, he would die, along with the whole team that had grown so far.\u003c/p\u003e\n\u003cp\u003e(Since I haven’t overcome the gap in my heart, I can only follow HongLu’s advice. The last step… the only other way to make the nightmare go away… is to kill the person who’s dreaming or have the person kill himself. Is this what you meant, HongLu? You want me to kill Freddy and then myself.)\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-18-chapter-10-02\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-18-chapter-11-02\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-18-chapter-11-01","bookId":1512,"creation":"Sep 10, 2019 6:20:20 AM","modification":"Sep 10, 2019 6:20:20 AM"}
