{"id":57788,"no":67,"title":"Vol 4 Chapter 4-1","content":"\u003cp\u003e\u003cstrong\u003eVol 4: Chapter 4-1.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eZheng’s strength was gradually disappearing. His eyelids felt heavier and heavier. Hopelessness started to fill his heart.\u003c/p\u003e\n\u003cp\u003eStrength, Qi, and stamina were all disappearing; he even felt that his life energy was disappearing. His consciousness was fading away for every second that passed. It wasn’t until now that he got a clearer look of the woman. Her body was made out of numerous faces in pain. The faces of those that were killed by her.\u003c/p\u003e\n\u003cp\u003eZheng’s vision was going out of focus. He felt as if his spirit was being pulled out of his body by that pale hand. His sense of danger had reached an extreme, as if he was going to die in the next second. Suddenly he felt he heard a boom. A stream of hot energy gushed out from his head then repelled the pale hand. This energy had corrosive properties and also lit the hand on fire. The ghost on Zheng’s back was shortly burned into nothingness.\u003c/p\u003e\n\u003cp\u003eYet that energy not only burned the ghost, it circulated into every part of Zheng’s body. Zheng could feel the burning just like being scalded by boiling water. That pain was as intense as when he unlocked his constraint. Even though he shut off the pain signals in his body, he still shouted out in pain.\u003c/p\u003e\n\u003cp\u003eThe blood energy! Unlike how he used the blood energy instinctively in the last movie, this energy was now totally released from his head and filled his whole body. Zheng’s eyes were bloody red. The world from his eyes was painted with blood. And the ghost became a light green color weaved from numerous twisted human bodies.\u003c/p\u003e\n\u003cp\u003eThat huge woman was actually created from numerous ghosts. Zheng could make out several familiar faces: the red faced man from the beginning of this movie and even Bingyi were in there. In other words anyone that was killed by the Ju-On became part of it. It absorbed all their hatred. Looking through these ghosts, Zheng saw a woman with a twisted face in the center of the body that looked just like a mini version of the huge ghost. That was the main body of Kayako!\u003c/p\u003e\n\u003cp\u003eZheng was still out of strength. He rolled away on the ground then took out the communication device.\u003c/p\u003e\n\u003cp\u003eZheng muttered in a faint voice, “Zero, can you see the chest of the ghost? Kayako’s main body is around that location… Zero?”\u003c/p\u003e\n\u003cp\u003eYinkong’s voice came through the device, “… Zero was attacked from his back. I only managed to save him but he’s out of strength now… You have to wait ten minutes for him to recover enough strength to snipe.”\u003c/p\u003e\n\u003cp\u003eZheng fell into silence. He and Zero did the most damage to the ghost so both of them were attacked. As the ghost was gradually recovering, they were trapped in a dire situation. He couldn’t find a way to kill it… Was this the end of their lives? Getting wiped when there was only less than an hour left?\u003c/p\u003e\n\u003cp\u003e‘No, I don’t want to die, I will live!’\u003c/p\u003e\n\u003cp\u003e“Yinkong, protect Zero. I’ll leave him to you. I will hold the ghost for ten minutes… Then I’ll leave my life to you two!”\u003c/p\u003e\n\u003cp\u003eZheng struggled to get up from the ground. His stamina and Qi were almost empty and the blood energy didn’t have the property to enhance his stamina like Qi. It only increased his recovery rate. Zheng ran to the submachine gun on the ground. The ghost had recovered her upper body by this time and her legs were about to be completed.\u003c/p\u003e\n\u003cp\u003eZheng’s speed was much slower than before. The ghost swiped at him with that huge hand as he picked up the gun. He didn’t have any time to think and forced out his blood energy while he rolled away. His upper body nearly dodged the pale hand but it still grazed his shoulder.\u003c/p\u003e\n\u003cp\u003eFortunately the blood energy easily corroded the area of the hand that touched him. Then the energy spread to the rest of the hand and burned it away. Of course Zheng also felt that the energy in his body gradually lessening.\u003c/p\u003e\n\u003cp\u003eZheng took a deep breath then turned around and ran. But he laughed in bitterness after only a few steps.\u003c/p\u003e\n\u003cp\u003eAll the normal people had ran away from the park. Jie and Tengyi was guarding on the edge. While there were sirens coming from far away, the cops hadn’t reached this place yet. Yet the ghosts of Kayako began to appear on the edge of the park. Their number was getting higher and higher until the whole park was filled with ghosts. There were at least several hundred if not more. And the huge ghost behind him was almost done recovering and about to start crawling. He was out of strength, stamina, and Qi.\u003c/p\u003e\n\u003cp\u003e“Are we really… really going to die? No, I will live no matter what!”\u003c/p\u003e\n\u003cp\u003eZheng shouted in desperation. He gathered his last bit of strength and ran toward a large clock in the center of the park… It was about ten meters tall, right at the height of the huge ghost’s chest.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv style\u003d\"clear: both\"\u003e\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-4-chapter-3-3\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-4-chapter-4-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-4-chapter-4-1","bookId":1512,"creation":"Sep 10, 2019 6:20:19 AM","modification":"Sep 10, 2019 6:20:19 AM"}
