{"id":57795,"no":74,"title":"Vol 4 Chapter 7-1","content":"\u003cp\u003e\u003cstrong\u003eVol 4: Chapter 7-1.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe men’s eyes were fixed on the scenery of the four women playing in water. Even Zero couldn’t keep his eyes off. Though the little boy kept his head down shyly then after a while he pulled Zero’s arm.\u003c/p\u003e\n\u003cp\u003eZero bent down and the boy whispered something by his ears. Zero hesitated but as the boy shook his head in panic, he laughed then took the boy behind the trees.\u003c/p\u003e\n\u003cp\u003eA little later Zero came back with… a boy dressed in a female swimsuit. Ignoring the strange look from Jie and Zheng, he led the boy to the sea and gave his hand to Lan.\u003c/p\u003e\n\u003cp\u003e“He’s… a girl, now… but he’s also my little brother.\u003c/p\u003e\n\u003cp\u003e“I was born in a family belonging to a Chinese mafia in America. When I was fifteen, my father got killed, and the mafia was annexed by another mafia. My mom became a woman of that mafia’s boss, who was also a Chinese-American…\u003c/p\u003e\n\u003cp\u003e“I couldn’t forgive her! She betrayed me, betrayed my father! So I had to seek revenge! I hid my identity for over ten years and trained the skills I currently have. Then… I went back.\u003c/p\u003e\n\u003cp\u003e“Ironically, that woman had already died eight years ago, but she gave birth to a boy for that man. And that man… raised the boy as a girl to commemorate the woman. He grew up with long hair and wore dresses, just like a pretty little girl. And the most ironic thing is… I fell in love with him at first sight.\u003c/p\u003e\n\u003cp\u003e“In science they call this genetic sexual attraction. Two people who are blood related get attracted to each other instantly. There are many cases of it happening but I never thought it would happen to me… I couldn’t forgive them. I couldn’t forgive myself… So I decided to kill them then kill myself!\u003c/p\u003e\n\u003cp\u003e“The process was smooth. Mafiosi are not assassins. They can bully civilians but give me a sniper rifle and enough distance, I won’t be afraid of anyone… However after I killed him and my little brother, I found a diary that belonged to that woman. It wrote about my father, mother and that man I killed… My little brother was actually my father’s child. She was already pregnant that year and she passed away from depression after giving birth… But everything was already too late. Everything was already over…\u003c/p\u003e\n\u003cp\u003e“I pressed the button to activate a bomb on my computer and also the YES button. Then I got transferred here…”\u003c/p\u003e\n\u003cp\u003eZheng and Jie sighed. They didn’t know what to say to Zero. Even though his circumstances were weird, but that made him give up on reality. And those feelings of his toward this little brother…\u003c/p\u003e\n\u003cp\u003e“I will try my best to live on… for her. I wish to protect her, watch her grow up, then… let nature take its course. Perhaps she isn’t the little brother of my memory but she’s what I live for,” Zero said calmly.\u003c/p\u003e\n\u003cp\u003eZheng patted his shoulder and said, “As long as you have a reason to live for. What we fear most is when we can’t even find a reason to live… Just like the me before I came here. If I didn’t get her back, perhaps I would have died in Alien.”\u003c/p\u003e\n\u003cp\u003eJie also came up to comfort him. Zheng suddenly asked casually, “Right, Jie, you are a veteran. I’ve never heard how you came here.”\u003c/p\u003e\n\u003cp\u003eJie’s mind went blank for a bit then he laughed. “Just the common problems. Retired, got into a company, had conflict with my superiors, then got fired, stayed in an internet cafe then I came here… Haha, it’s not worth mentioning. It makes me rage just thinking about it. My past is not as glorious as Zero’s, I was just an otaku.”\u003c/p\u003e\n\u003cp\u003eThe three men chatted for a while then came Lan’s voice, “Hey, the three of you stop standing there like idiots. Come swim with us. The water feels so cool… Lori, stop hanging on my chest. My bikini is falling off.”\u003c/p\u003e\n\u003cp\u003eThey looked at each other then began taking off their pants without hesitation. They were all wearing trunks. As soon as they took off their clothes, they jumped into the sea.\u003c/p\u003e\n\u003cp\u003eNana, Lori, and the little girl swam to their respective men. Lan hesitated then swam over to Zheng. Though Yinkong swam away into the sea. Her black swimsuit contrasted with her snow white skin. She looked like a mermaid swimming in the sea.\u003c/p\u003e\n\u003cp\u003eZheng stared into the horizon. The black and white contrast of Yinkong combined with the deep blue sea made for unique scenery. Then something hit his chest. Lori hung onto his chest while laughing and Lan also came over to him. The two women then had fun tickling each other. Though maybe it was intentional or maybe it was not, Lan’s breasts brushed against his arm. He didn’t know whether to avoid it or not, and suffered while enjoying it…\u003c/p\u003e\n\u003cp\u003eTime always flies by when you feel happy. The evening came and they couldn’t help but leave the shore to look for a hotel. In the beginning, they were afraid that without any visas they couldn’t get a room. But Yinkong quickly solved the problem. She borrowed a computer from the staff and an American company sent them the visas and several million dollars. In the end, they got into a five star hotel.\u003c/p\u003e\n\u003cp\u003e“Zheng… come to the lobby at nine,” Lan said to him in a low voice as she walked pass. Then she went to her room without turning her head.\u003c/p\u003e\n\u003cp\u003eZheng’s mind went blank as he watched her go away. Then when Lori ran up to him from behind, he smiled bitterly. His feelings were mixed…\u003c/p\u003e\n\u003cp\u003eP.S. Zero created a girl.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv style\u003d\"clear: both\"\u003e\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-4-chapter-6-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-4-chapter-7-2\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-4-chapter-7-1","bookId":1512,"creation":"Sep 10, 2019 6:20:19 AM","modification":"Sep 10, 2019 6:20:19 AM"}
