{"id":57729,"no":8,"title":"Vol 1 Chapter 4-2","content":"\u003cp\u003eZheng thought for a moment and asked, \"And the fourth category? The first three seem to have included everything already.\"\u003c/p\u003e\n\u003cp\u003eJie said with a mysterious smile, \"The fourth category has the good stuff. You know everyone will break down when they\u0027ve been here long enough. So the last category is entertainment items.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s tobacco, weed, heroin, these are cheap. One reward point can be separated into 1000 parts. A kilo of heroin only takes 5 parts of a point. How\u0027s that? God analysed that a normal person only needs about 300 points in cell vitality and 350 points in immunization to inject heroin without constraints.\"\u003c/p\u003e\n\u003cp\u003e\"Other than these, you also exchange for time to live in a normal world through this category. There are also music albums, movies, and even women!\"\u003c/p\u003e\n\u003cp\u003eJie was laughing hysterically at this point. Zheng said, \"I am not interested in silicon.\"\u003c/p\u003e\n\u003cp\u003eJie patted Zheng\u0027s shoulder. \"What are you talking about, it\u0027s real women. God can create real women! They have intelligence, they have their personality, and even memories. When you buy a woman you can choose their face, body, age, race, every detail. You played that Artificial Girl game (by Illusion)? \u003cspan style\u003d\"font-size: 10px\"\u003e\u003csup\u003e\u003ca href\u003d\"#footnote_1\"\u003e[1]\u003c/a\u003e\u003c/sup\u003e\u0026nbsp;\u003c/span\u003eThis is much more detailed.\"\u003c/p\u003e\n\u003cp\u003eXiaoyi\u0027s eyes were shining, while Lan snorted.\u003c/p\u003e\n\u003cp\u003eJie stopped laughing and said in a serious tone, \"No one knows if they can live through the next movie. So I want to have a woman that I like by my side. You will know once you tried it, she\u0027s not a doll. Even though she\u0027s a life created by God, she\u0027s more realistic than a lot of women in the real world. And she really loves you. You can share the terrors you experience with her. God said once you get enough points to go back, you can keep your enhancements, all the items you exchanged, and this woman can go with you. If I can go back I will marry her. She\u0027s the one that I will love with the rest of my life.\"\u003c/p\u003e\n\u003cp\u003eThese words were said with sincerity and passion. In the modern age, people only cared about money and sex. Zheng and the others admired someone that can truly love someone.\u003c/p\u003e\n\u003cp\u003eLan touched her head. \"Stop this topic. Gentlemen, there\u0027s a lady here. Jie, tell us about God\u0027s lobby. What will happen after a mission?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing special. You will go to God\u0027s lobby after the mission. God is a sphere of light floating in the centre. You can communicate with it just by thinking. There are twenty rooms to the side, though they were never all filled. You will have your own room. Only people you give permission to can enter your room. Other than this, you will have ten days in the lobby between every mission.\"\u003c/p\u003e\n\u003cp\u003eLan was going to ask something else when Jie suddenly stood up. He ran to the door and looked out through the window. The rest of them was shocked and followed behind him. But they couldn\u0027t see anything in the corridor.\u003c/p\u003e\n\u003cp\u003eJie turned around and shouted, \"Red Queen, report what happened outside the room.\"\u003c/p\u003e\n\u003cp\u003eA little girl\u0027s voice sounded, \"Two Lickers are attacking the outer door. It will last forty seconds.\"\u003c/p\u003e\n\u003cp\u003e\"F*ck. I knew things won\u0027t be so easy. Those Lickers must\u0027ve sensed our smell. The outer door couldn\u0027t block them. Good thing we hid here already.\" Then Jie looked at his watch.\u003c/p\u003e\n\u003cp\u003eZheng and the others looked at their watches also. The countdown still had seventeen minutes remaining, there were three doors and a corridor between the Lickers. They couldn\u0027t fight the Lickers face to face with the weapons they had.\u003c/p\u003e\n\u003cp\u003eZheng didn\u0027t want to die here, especially when there was still hope. He shouted, \"Red Queen, how long can we last?\"\u003c/p\u003e\n\u003cp\u003eThat voice didn\u0027t respond. Then Zheng pointed his gun at the computer, \"I know you\u0027re programmed to prevent the spread of T-virus. In other words you want to kill anything that has a possibility of spreading it. That includes us, right? Make your decision, either you protect us with the defence system or you let the Lickers come in here. But we will destroy your main circuit before they do. Once you lose control of the Hive, how much of the virus will get to the outside world?\"\u003c/p\u003e\n\u003cp\u003eThe girl\u0027s voice finally came back, \"Can I ask why are you still struggling? You\u0027ve decided to stay here, aren\u0027t you going to sacrifice yourself?\"\u003c/p\u003e\n\u003cp\u003eLan answered before Zheng could say a word, \"Computers are not supposed to question humans. You have to be aware of being just a computer. Understand? Also since we are already here, we won\u0027t be able to spread the virus even if we live. Then why won\u0027t you protect us, Little Girl?\"\u003c/p\u003e\n\u003cp\u003e\"Understand. The Lickers won\u0027t be able to penetrate the defence system.\"\u003c/p\u003e\n\u003cp\u003eAt this time, there were loud bangs on the door at the other side of the corridor. You could see the Lickers through the window and the metal door was losing its form.\u003c/p\u003e\n\u003cp\u003e\"Impressive power, no wonder it\u0027s worth 100 points. If I had a RPG with unlimited grenades I could be earning points now,\" Jie laughed.\u003c/p\u003e\n\u003cp\u003eZheng asked without thinking, \"How much does it cost?\"\u003c/p\u003e\n\u003cp\u003e\"Of course it\u0027s going to be expensive. A normal RPG costs 2000 points. I would rather enhance myself if I have that many. And it isn\u0027t effective in every movie.\"\u003c/p\u003e\n\u003cp\u003eThe door had totally deformed, then the Lickers\u0027 claws ripped it apart and appeared in front of their eyes.\u003c/p\u003e\n\u003cp\u003eThey were several meters tall, a whole body of red muscles. They had no eyes, probably sensing targets through heat and smell. Their tongues could extend out three feet. Their claws were harder than steel.\u003c/p\u003e\n\u003cp\u003eZheng looked at the two Lickers then at his gun. He didn\u0027t think this gun could even injure it, not to mention kill it.\u003c/p\u003e\n\u003cp\u003eThe Lickers turned to them and one started to charge, the second followed. Bang! They could feel the door tremble.\u003c/p\u003e\n\u003cp\u003e\"Red Queen!\", Zheng and Jie yelled.\u003c/p\u003e\n\u003cp\u003eAt the same time a laser formed inside the corridor and moved toward the Lickers. When the Lickers were about to charge again, the laser moved past them, then disappeared. The Lickers stopped moving, then their upper body slowly fell off.\u003c/p\u003e\n\u003cp\u003eThe four exhaled. They felt so small in front of the Lickers. It would only take one claw to take a life. Even Jie was just a stronger normal person. He wouldn\u0027t be able to survive against these monsters.\u003c/p\u003e\n\u003cp\u003eJie sat on the ground and took out a few cigarettes. He also threw one over to Xiaoyi this time. \"Know that fear and terror? I\u0027ve experienced it many times already. I don\u0027t even know how I got myself through those three movies. Shit. This place is unbearable.\"\u003c/p\u003e\n\u003cp\u003eZheng and Lan smiled bitterly. The moment the Lickers charged over, they reacted worse than Jie. They could barely keep themselves standing with the shivering. Thank god the defence system saved them. Otherwise they couldn\u0027t even run away.\u003c/p\u003e\n\u003cp\u003e\"Keep waiting. This defence system is good enough. We could probably...\"\u003c/p\u003e\n\u003cp\u003eSuddenly the whole room darkened. They ran to the door and looked out. The corridor was totally black. The power had went out.\u003c/p\u003e\n\u003cp\u003e\"Shit. The plot. How did I forget about this? You still remember this plot?\" Jie kicked at the door and started screaming.\u003c/p\u003e\n\u003cp\u003eZheng tried to recall the plot. This movie was over ten years old already. Even though he\u0027d seen it he had forgotten the details. After a while, he and Lan both said, \"Kaplan shut down the Red Queen!\"\u003c/p\u003e\n\u003cp\u003eWhen the main characters were locked in a laboratory and a Licker was attacking the door, Kaplan turned off the Red Queen to save them. So then the four of them lost their defence. The only thing they had left was the last door.\u003c/p\u003e\n\u003cp\u003eThey gradually calmed down. They knew that any sound could catch the attention of Lickers. So they kept their mouths shut. Even then their breath sounds were still so noticeable in this darkness.\u003c/p\u003e\n\u003cp\u003eTime passed, then a heavy breathing sound came from the darkness, along with the abrasive sound between two metals. They didn\u0027t have to look to know what\u0027s outside.\u003c/p\u003e\n\u003cp\u003eZheng remembered it only takes a few minutes for the main characters to go back to the ground after the power went out. That was about the same time their mission ended.\u003c/p\u003e\n\u003cp\u003eZheng asked Lan in a low voice, \"What\u0027s the time on the watch?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Can\u0027t see in the dark. Maybe a few minutes.\"\u003c/p\u003e\n\u003cp\u003e\"Few minutes? That\u0027s how many minutes?\"\u003c/p\u003e\n\u003cp\u003eZheng couldn\u0027t open his mouth again. The breathing had approached their last door. Everyone\u0027s heart clenched. Then they heard the sound of scratching on the door.\u003c/p\u003e\n\u003cp\u003e\"How much longer? How much time left? Hurry!\"\u003c/p\u003e\n\u003cp\u003eZheng was staring at the door intensely. He held onto his gun, even though he knew this couldn\u0027t do anything against the Licker. That was the only form of support he had.\u003c/p\u003e\n\u003cp\u003eBang! With a loud bang, a sharp object almost penetrated the door. Their heart skipped a beat then they ran to the back of the room. Even Jie was keeping his body close to the wall.\u003c/p\u003e\n\u003cp\u003eThe door started to deform then finally a claw penetrated it and ripped this 10cm thick metallic door apart like butter. They could see that terrifying face of a Licker.\u003c/p\u003e\n\u003cp\u003e\"Ahhh!\", Zheng and Jie started screaming and shot at the Licker. They had lost their cool to the horror and along with the darkness, none of their bullets hit the Licker. The Licker threw away the piece of door on his hand and charged at the four.\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_1\"\u003e[1] Artificial Girl is a Japanese hentai dating game where you can adjust the girl to your choosing.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-1-chapter-4-1\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-1-chapter-5-1\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-1-chapter-4-2","bookId":1512,"creation":"Sep 10, 2019 6:20:19 AM","modification":"Sep 10, 2019 6:20:19 AM"}
