{"id":57802,"no":81,"title":"Vol 5 Chapter 2-2","content":"\u003cp\u003e\u003cstrong\u003eVol 5: Chapter 2-2.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThey were already negative one point now which made them feel heavily burdened. Their only choice was to fight. Either kill a person from the other team or the majority of the group would be erased in the end. Aside from Zheng, most of them wouldn’t be able to take the 2000 point hit.\u003c/p\u003e\n\u003cp\u003e“We’ve been thinking about how to avoid fighting the other team but who would’ve guessed now we have to think about how to kill someone from the other team… It feels convoluted.” Zheng smiled bitterly.\u003c/p\u003e\n\u003cp\u003eHe thought for a bit then continued. “Honglu, can you analyze the other team’s members? And why did God put us in this world before them?”\u003c/p\u003e\n\u003cp\u003eHonglu twirled a strand of hair. “Based on the information you’ve given, as long as a team has or used to have three unlocked member, then this team will encounter other teams… What I want to say is, we are definitely weaker than Team India. Otherwise God wouldn’t put us in this world first.”\u003c/p\u003e\n\u003cp\u003eTengyi asked, “Why? Wouldn’t we have to go through more dangers since we are here first? The desert, the tomb, the mummies, and that Imhotep. Aren’t these dangerous?”\u003c/p\u003e\n\u003cp\u003eHonglu started to pull another hair but Lan jerked his hand away. “Stop pulling your hair, you’re going to become bald.”\u003c/p\u003e\n\u003cp\u003eHonglu waved her hand away. “I won’t. My hair regeneration speed increased due to my special cerebral cortex. Even if I pull out all my hair, it won’t take long to grow back… My scalp gets very itchy when I think. It makes me want to scratch, but the itching will get worse the more you scratch. So I can only pulled my hair to create a little pain… Leave me alone.\u003c/p\u003e\n\u003cp\u003e“Tengyi, who do you think has more advantage in a battlefield. An army that get there first or the later army? Even if the battle took place in a swamp where the environment and organisms are deadly, the first army will have an advantage. Whether it’s setting up an ambush, or blockade, the group that’s more familiar with the environment will have the best hand.”\u003c/p\u003e\n\u003cp\u003e“Our team has a sniper, an assassin, fighters, and support. We’re only missing someone that can set traps like landmines. This team is already very strong and we also have two members that unlocked their constraint. If God still considers us the weak side… the the other team has a 70% chance of having some magical abilities…”\u003c/p\u003e\n\u003cp\u003eHonglu pulled another hair, but he didn’t blow it away. He twirled it around his finger and said, “If that’s the case, then I suggest not engaging them face to face. Magical abilities are unpredictable. And we have an advantage in long distance attacks… Zero will be the core in this battle! Snipe them all!”\u003c/p\u003e\n\u003cp\u003eZheng was in a daze. “I never thought you’d be the most violent one here. I just thought of you as a highly intelligent child… Right, how do you know all this? Even if you are intelligent, this seem like too much information.”\u003c/p\u003e\n\u003cp\u003eHonglu smiled deviously. For a moment he seemed like a normal boy. “There are computers in this world. Even though I am a research subject that doesn’t mean I am confined. I can go read on the internet when I have time. And in this age, there’s a genre of novels called fantasy.”\u003c/p\u003e\n\u003cp\u003eZheng was surprised then he laughed out loud. “That’s what a kid should be like. The you before was just like someone I knew… Maybe he can be counted as a friend. You were too similar to him.”\u003c/p\u003e\n\u003cp\u003eSuddenly the main characters who were walking in front of them stopped. They seemed to be discussing something. Then Evelyn left with her brother while O’Connell walked into an alley.\u003c/p\u003e\n\u003cp\u003eThe group looked at each other and without a word they continued following him into the alley. Right as they made the turn, they saw O’Connell standing there and looking at them cautiously.\u003c/p\u003e\n\u003cp\u003e“Fellow inmates, are you following me intentionally?” O’Connell taunted.\u003c/p\u003e\n\u003cp\u003eZheng was shocked. He remembered it was the same in Resident Evil. God gave them an identity in the movie world. They were security guards back then and prisoners right now.\u003c/p\u003e\n\u003cp\u003eZheng had an idea and laughed. “Hoho, I heard you talking about Hamunaptra…”\u003c/p\u003e\n\u003cp\u003eO’Connell immediately reached for his back but he forgot he was just released from the jail and there was no gun on him. Then he saw Zheng take out a strange gun and put up his hands.\u003c/p\u003e\n\u003cp\u003e“Haha, you must be mistaken, bro. What Hamunaptra…”\u003c/p\u003e\n\u003cp\u003eZheng put away his gun with a smile. “Hoho, I don’t want to say anything else. I mean no harm, just that I hope you can take us to Hamunaptra. I will be responsible for your safety… In fact, we were the ones that saved you before.”\u003c/p\u003e\n\u003cp\u003eO’Connell looked at him in confusion. Zheng smiled at Zero then pointed to a pointed steel bar on top of a building. It was at least a thousand meters away, they could barely see that bar. O’Connell also looked over then with a small buzz, the steel bar snapped. O’Connell looked at them in shock just to see Zero putting away a strange looking handgun.\u003c/p\u003e\n\u003cp\u003eIt was just after World War 1, so there weren’t even semi-automatics, not to mention a handgun with a range of over a thousand meters. The gun Zero had was tech from the twenty first century. Whether it was the silencer, or its range, or Zero’s ability; all shocked O’Connell. He stood there with his mouth open wide and after quite a while, he said, “… Don’t point the gun at me. Just don’t…”\u003c/p\u003e\n\u003cp\u003eThis could be considered physical threat. Zheng smiled slowly as he followed behind O’Connell. In fact, the whole time Honglu was observing his actions without him noticing. The boy showed a smile of acknowledgement after he took care of O’Connell…\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv style\u003d\"clear: both\"\u003e\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-5-chapter-2-1\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-5-chapter-2-3\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-5-chapter-2-2","bookId":1512,"creation":"Sep 10, 2019 6:20:19 AM","modification":"Sep 10, 2019 6:20:19 AM"}
