{"id":57815,"no":94,"title":"Vol 5 Chapter 6-3","content":"\u003cp\u003e\u003cstrong\u003eVol 5: Chapter 6-3.\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe group finally reached the downstream port. It was a commercial port. Most ships were cargo ships but there were the occasional tourist seen leaving on sightseeing cruises. It was difficult to board a cruise from this port. Of course, difficult was relative.\u003c/p\u003e\n\u003cp\u003eZheng still had two gold bars and many more gold nuggets. Just a few of those gold nuggets got them on the sightseeing cruise and even several VIP cabins. Money makes the mare go, and if you have more money you can make the mare fly.\u003c/p\u003e\n\u003cp\u003eFollowing the stream, they would reach Cairo by tomorrow evening. Fate and unknown enemies awaited them there… Would they live, die or struggle with their lives for that last bit of light?\u003c/p\u003e\n\u003cp\u003eZheng brought a bottle of tequila to the deck. He barely had the chance for such tranquility since he’d entered this world. In order to prevent what happened last time, he held onto the Book of the Dead himself. Even if someone wanted to see it or if Tengyi needed to do translations for him, he would not let the book leave his reach. No one could win a fight and take the book from him at such close quarters, not even if Zero and Yinkong teamed up.\u003c/p\u003e\n\u003cp\u003e“You drinking?” It was Jie’s voice from the other side of the deck.\u003c/p\u003e\n\u003cp\u003eWithout turning his head, Zheng took out another bottle of tequila from the ring. Jie sat down and opened the bottle then took a gulp.\u003c/p\u003e\n\u003cp\u003e“Are you… feeling tired already?” Jie drank half the bottle in one go then lay down on the deck.\u003c/p\u003e\n\u003cp\u003e“Uh? Yeah, tired.” Zheng sighed and also took a big gulp. The alcohol quickly made him feel hot.\u003c/p\u003e\n\u003cp\u003e“Because death may come at any moment?” Jie asked after a moment of silence.\u003c/p\u003e\n\u003cp\u003eZheng finished the bottle in one go then threw it off the cruise. “Everyone can die at any moment. After being on the brink of death for so long, aside from the bonds with people I love making me live on, life and death don’t matter that much anymore. Like the me before couldn’t disregard someone’s life so lightly, or just take it away so easily… What really makes me tired is having to fight with one hand and guard against my comrades with the other hand. If I can’t even leave my back to my comrades without worrying, that’s the real reason I am tired.”\u003c/p\u003e\n\u003cp\u003e“If… if…” Jie finished his bottle also, then muttered the words. “Bro. Have you ever wondered why Team India is stronger than us? The team names are assigned based on their regions in ancient times. Team India includes India, West Indies, and all the lands west extending to the Dead Sea and Saudi Arabia. Whereas Team China includes all the land from China. We have the most land and population among all the teams in God’s World. Then… why are we weaker than Team India? Aren’t you curious?”\u003c/p\u003e\n\u003cp\u003eZheng took out another bottle of alcohol then said calmly, “That’s why I have been waiting for you…”\u003c/p\u003e\n\u003cp\u003e“If… give me some time. If you can survive against Team India….this time, I will tell you everything. Afterward… no, there’s no afterward. Want to have a smoke?”\u003c/p\u003e\n\u003cp\u003eJie finished his sentence then took out a pack of cigarettes. He threw one over to Zheng then lit his cigarette and began to smoke. Zheng caught the cigarette and felt as if he was back to Resident Evil when he just met Jie. The cold man and the cigarette…\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003e\u003cem\u003eIn Cairo.\u003c/em\u003e\u003c/p\u003e\n\u003cp\u003eEveryone’s mind had changed since the first time they were in Cairo. Knowing that Team India had come, knowing that they were the stronger team, and they still had to kill one of their team members… But the existence of the Book of the Dead had given them hope. Describing how they felt in one word: complicated.\u003c/p\u003e\n\u003cp\u003eAfter they got off the cruise, O’Connell told Zheng, “According to our deal, we will go get the mummies… and you will kill that monster. Of course, we will also be responsible for the Book of Amun-Ra… but you must protect us in the meantime. Okay?”\u003c/p\u003e\n\u003cp\u003eZheng nodded. “Okay, we will protect you… from afar. After you bring the mummies out, we will contact you. Oh, you should bring a cat. It can help you avoid getting attacked by that mummy.”\u003c/p\u003e\n\u003cp\u003eAs Zheng’s group was walking away, O’Connell shouted, “Where are you going? How do we contact you? Hey…”\u003c/p\u003e\n\u003cp\u003e“We will come find you. Don’t get too close to us, you may die… And O’Connell, thanks for your help all this time. See you.”\u003c/p\u003e\n\u003cp\u003e—\u003c/p\u003e\n\u003cp\u003eSeveral people were sitting in a room quietly in some inn in Cairo. A girl who had her eyes closed the whole time said, “Team China came back to Cairo. They are by the port.”\u003c/p\u003e\n\u003cp\u003eThese people were sitting around a monk with their legs crossed. The monk said, “Who’s close by?”\u003c/p\u003e\n\u003cp\u003eA tall, slender man with pale skin took out a hand-sized device and took a look. “Minima and Muhammad Joseph.”\u003c/p\u003e\n\u003cp\u003eThe monk frowned. “Minima’s burst strength is too powerful and may cause a disturbance. Muhammad’s weapon is also not suitable for fighting in a city… Just have them test Team China’s power. Also get Arot over there as soon as possible. If those two get injured, Arot can keep them alive. It shouldn’t be a problem with his medical abilities… Test Team China’s power, let\u0027s see whether they’re prey or enemies on equal ground.”\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003cdiv style\u003d\"clear: both\"\u003e\u003c/div\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-5-chapter-6-2\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/terror-infinity/ti-vol-5-chapter-7-1\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/terror-infinity/ti-vol-5-chapter-6-3","bookId":1512,"creation":"Sep 10, 2019 6:20:19 AM","modification":"Sep 10, 2019 6:20:19 AM"}
