{"id":69134,"no":10,"title":"Page 10","content":"\u003cp\u003eTHERE were five of them: Sheriff Dowling, two plain-clothes detectives and two uniformed policemen. They stood in the living room watching Ashley, sitting in a chair, weeping hysterically.\u003c/p\u003e\n\u003cp\u003eSheriff Dowling said, \"You\u0027re the only one who can help us. Miss Patterson.\"\u003c/p\u003e\n\u003cp\u003eAshley looked up at the men and nodded. She took several deep breaths. \"I\u0027ll -\u0026nbsp;\u0026nbsp;I\u0027ll try.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s start at the beginning. Deputy Blake spent the night here?\"\u003c/p\u003e\n\u003cp\u003e\"Y-yes. I asked him to. I - I was desperately afraid.\"\u003c/p\u003e\n\u003cp\u003e\"This apartment has one bedroom.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"Where did deputy Blake sleep?\"\u003c/p\u003e\n\u003cp\u003eAshley pointed to the couch, which had a blanket and a pillow on it. \"He - he spent the night there.\"\u003c/p\u003e\n\u003cp\u003e\"What time did you go to bed?\"\u003c/p\u003e\n\u003cp\u003eAshley thought for a moment \"It - it must have been around midnight. I was nervous. We had some tea and talked for a while, and I felt calmer. I brought out blankets and a pillow for him, then I went into my bedroom.\" She was fighting for self-control.\u003c/p\u003e\n\u003cp\u003e\"Was that the last time you saw him?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"And you went to sleep?\"\u003c/p\u003e\n\u003cp\u003e\"Not immediately. I finally took a sleeping pill. The next thing I remember, I was awakened by a woman\u0027s screams coming from the alley.\" She began to tremble.\u003c/p\u003e\n\u003cp\u003e\"Do you think someone came into this apartment and lolled deputy Blake?\"\u003c/p\u003e\n\u003cp\u003e\"I - I don\u0027t know,\" Ashley said desperately. \"Someone has been getting in here. They even wrote a threatening message on my mirror.\"\u003c/p\u003e\n\u003cp\u003e\"He told me about that on the telephone.\"\u003c/p\u003e\n\u003cp\u003e\"He might have beard something and - and gone outside to investigate,\" Ashley said.\u003c/p\u003e\n\u003cp\u003eSheriff Dowling shook his head. \"I don\u0027t think he would have gone out naked.\"\u003c/p\u003e\n\u003cp\u003eAshley cried. \"I don\u0027t know! I don\u0027t know! It\u0027s a I nightmare.\" She covered her eyes with her hands.\u003c/p\u003e\n\u003cp\u003eSheriff Dowling said, \"I\u0027d like to look around the apartment. Do I need a search warrant?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not G-go ahead.\"\u003c/p\u003e\n\u003cp\u003eSheriff Dowling nodded to the detectives. One them went into the bedroom. The other one went into the kitchen.\u003c/p\u003e\n\u003cp\u003e\"What did you and deputy Blake talk about?\"\u003c/p\u003e\n\u003cp\u003eAshley took a deep breath. \"I - I told him about -\u0026nbsp;\u0026nbsp;about the things that have been happening to me. He was very - \" She looked up at the sheriff. \"Why would anyone kill him? Why?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Miss Patterson. We\u0027re going to find out.\"\u003c/p\u003e\n\u003cp\u003eLieutenant Elton, the detective who had gone into the kitchen, stood in the doorway. \"Could I see you for a moment, Sheriff?\"\u003c/p\u003e\n\u003cp\u003e\"Excuse me.\"\u003c/p\u003e\n\u003cp\u003eSheriff Dowling walked into the kitchen.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003eLieutenant Eiton said, \"I found this in the sink.\" He was holding up a bloodstained butcher knife by the edge of the blade. \"It hasn\u0027t been washed. I think we\u0027re going to get some prints.\"\u003c/p\u003e\n\u003cp\u003eKostoff, the second detective, came in from the bed-room and hurried into the kitchen. He was holding an emerald ring, mounted with diamonds. \"I found this in jewelry box in the bedroom. It fits the description we got from Quebec of the ring that Jean Claude Parent gave to Toni Prescott.\" The three men were looking at one another.\u003c/p\u003e\n\u003cp\u003e\"This doesn\u0027t make any sense,\" the sheriff said. Gingerly, he took the butcher knife and the ring and walked back into the living room. He held out the knife and said, \"Miss Patterson, is this your knife?\"\u003c/p\u003e\n\u003cp\u003eAshley looked at it. \"I -\u0026nbsp;\u0026nbsp;Yes. It could be. Why?\"\u003c/p\u003e\n\u003cp\u003eSheriff Dowling held out the ring. \"Have you ever seen this ring before?\"\u003c/p\u003e\n\u003cp\u003eAshley looked at it and shook her head. \"No.\"\u003c/p\u003e\n\u003cp\u003e\"We found it in your jewelry box.\"\u003c/p\u003e\n\u003cp\u003eThey watched her expression. She was completely bewildered.\u003c/p\u003e\n\u003cp\u003eShe whispered, \"I -\u0026nbsp;\u0026nbsp;Someone must have put it there....\"\u003c/p\u003e\n\u003cp\u003e\"Who would do a thing like that?\"\u003c/p\u003e\n\u003cp\u003eHer face was pale. \"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003eA detective walked in the front door. \"Sheriff?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Baker?\" He motioned the detective over to a corner. \"What have you got?\"\u003c/p\u003e\n\u003cp\u003e\"We found bloodstains on the corridor rug and in the elevator. It looks like the body was laid on a sheet, dragged into the elevator and dumped in the alley.\"\u003c/p\u003e\n\u003cp\u003e\"Holy shit!\" Sheriff Dowling turned to Ashley. \"Miss Patterson, you\u0027re under arrest. I\u0027m going to read you your rights. You have the right to remain silent. If you give up the right to remain silent, anything you say may be used against you in a court of law. You are entitled to an attorney. If you cannot afford an attorney, one will be appointed to you by the courts.\"\u003c/p\u003e\n\u003cp\u003eWhen they reached the sheriff\u0027s office. Sheriff Dowling said, \"Fingerprint her and book her.\"\u003c/p\u003e\n\u003cp\u003eAshley went through the procedure like an automaton. When it was finished, Sheriff Dowling said, \"You have the right to make one phone call.\"\u003c/p\u003e\n\u003cp\u003eAshley looked up at him and said dully, \"I have no one to call. \"I can\u0027t call my father. Sheriff Dowling watched Ashley being led into a cell.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be goddamned if I understand it. Did you see her polygraph test? I would swear she\u0027s innocent.\"\u003c/p\u003e\n\u003cp\u003eDetective Kostoff walked in. \"Sam had sex before he died. We ran an ultraviolet light over his body and the sheet he was wrapped in. We got a positive result for semen and vaginal stains. We - \"\u003c/p\u003e\n\u003cp\u003eSheriff Dowling groaned. \"Hold it!\" He had been putting off the moment when he would have to give his sister the news. It had to be done now. He sighed and said, \"I\u0027ll be back.\"\u003c/p\u003e\n\u003cp\u003eTwenty minutes later, he was at Sam\u0027s house.\u003c/p\u003e\n\u003cp\u003e\"Well, this is an unexpected pleasure,\" Serena said. \"Is Sam with you?\"\u003c/p\u003e\n\u003cp\u003e\"No, Serena. I have to ask you a question.\" This was going to be difficult.\u003c/p\u003e\n\u003cp\u003eShe was looking at him curiously. \"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Did - did you and Sam have sex within the last twenty-four hours?\"\u003c/p\u003e\n\u003cp\u003eThe expression on her face changed. \"What? We... No. Why do you want to - ? Sam\u0027s not coming back, is he?\"\u003c/p\u003e\n\u003cp\u003e\"I hate to tell you this, but he - \"\u003c/p\u003e\n\u003cp\u003e\"He left me for her, didn\u0027t he? I knew it would happen. I don\u0027t blame him. I was a terrible wife to him. I - \"\u003c/p\u003e\n\u003cp\u003e\"Serena, Sam\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003e\"I was always yelling at him. I really didn\u0027t mean it. I remember - \"\u003c/p\u003e\n\u003cp\u003eHe took her by the arms. \"Serena, Sam\u0027s dead.\"\u003c/p\u003e\n\u003cp\u003e\"One time we were going out to the beach and - \"\u003c/p\u003e\n\u003cp\u003eHe was shaking her. \"Listen to me. Sam is dead.\"\u003c/p\u003e\n\u003cp\u003e\" - and we were going to have a picnic.\"\u003c/p\u003e\n\u003cp\u003eAs he looked at her, he realized that she had heard him.\u003c/p\u003e\n\u003cp\u003e\"So we\u0027re at the beach and this man comes up and says, \u0027Give me your money.\u0027 And Sam says, \u0027Let me see your gun.\u0027 \"\u003c/p\u003e\n\u003cp\u003eSheriff Dowling stood there and let her talk. She was in a state of shock, in complete denial.\u003c/p\u003e\n\u003cp\u003e\"... that was Sam. Tell me about this woman he went away with. Is she pretty? Sam tells me I\u0027m pretty all the time, but I know I\u0027m not. He says it to make me feel good because he loves me. He\u0027ll never leave me. He\u0027ll be back. You\u0027ll see. He loves me.\" She went on talking.\u003c/p\u003e\n\u003cp\u003eSheriff Dowling went to the phone and dialed a number. \"Get a nurse over here.\" He went over and put his arms around his sister. \"Everything\u0027s going to be all right.\"\u003c/p\u003e\n\u003cp\u003e\"Did I tell you about the time that Sam and I - ?\" Fifteen minutes later, a nurse arrived.\u003c/p\u003e\n\u003cp\u003e\"Take good care of her,\" Sheriff Dowling said.\u003c/p\u003e\n\u003cp\u003eThere was a conference in Sheriff Dowling\u0027s office. \"There\u0027s a call for you on line one.\"\u003c/p\u003e\n\u003cp\u003eSheriff Dowling picked up the phone. \"Yeah?\"\u003c/p\u003e\n\u003cp\u003e\"Sheriff, this is Special Agent Ramirez at FBI headquarters in Washington. We have some information for you on the serial killer case. We didn\u0027t have any prints on file for Ashley Patterson because she had no criminal record, and before 1988, the DMV didn\u0027t require thumb-prints in the state of California to get a driver\u0027s license.\"\u003c/p\u003e\n\u003cp\u003e\"Go ahead.\"\u003c/p\u003e\n\u003cp\u003e\"In the beginning, we thought it had to be a computer glitch, but we checked it out and...\"\u003c/p\u003e\n\u003cp\u003eFor the next five minutes, Sheriff Dowling sat there listening, an incredulous expression on his face. When he finally spoke, he said, \"Are you sure there\u0027s no mistake? It doesn\u0027t seem... All of them... ? I see.... Thank you very much.\"\u003c/p\u003e\n\u003cp\u003eHe replaced the receiver and sat there for a long moment. Then he looked up. \"That was the FBI lab in Washington. They\u0027ve finished cross-checking the fingerprints on the bodies of the victims. Jean Claude Parent in Quebec was seeing an English woman named Toni Prescott when he was murdered.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Richard Melton in San Francisco was seeing an Italian lady named Alette Peters when he was killed.\" They nodded.\u003c/p\u003e\n\u003cp\u003e\"And last night Sam Blake was with Ashley Patterson.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003eSheriff Dowling took a deep breath. \"Ashley Patterson...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Toni Prescott...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Alette Peters...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re all the same fucking person.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/tell-me-your-dreams/page-10.html","bookId":2368,"creation":"Oct 5, 2019 10:12:53 AM","modification":"Oct 5, 2019 10:12:53 AM"}
