{"id":69137,"no":13,"title":"Page 13","content":"\u003cp\u003eWHEN David got home, Sandra was waiting for him. \"Good evening, darling.\"\u003c/p\u003e\n\u003cp\u003eHe took her in his arms and thought. My God, she\u0027s lovely. What idiot said that pregnant woman weren\u0027t beautiful?\u003c/p\u003e\n\u003cp\u003eSandra said excitedly, \"The baby lacked again today.\" She took David\u0027s band and put it on her belly. \"Can you feel him?\"\u003c/p\u003e\n\u003cp\u003eAfter a few moments, David said, \"No. He\u0027s a stubborn little devil.\"\u003c/p\u003e\n\u003cp\u003e\"By the way, Mr. Crowther called.\"\u003c/p\u003e\n\u003cp\u003e\"Crowther?\"\u003c/p\u003e\n\u003cp\u003e\"The real estate broker. The papers are ready to be signed.\" David felt a sudden sinking feeling. \"Oh.\"\u003c/p\u003e\n\u003cp\u003e\"I want to show you something,\" Sandra said eagerly. \"Don\u0027t go away.\"\u003c/p\u003e\n\u003cp\u003eDavid watched her hurry into the bedroom and thought. What am I going to do? I have to make a decision.\u003c/p\u003e\n\u003cp\u003eSandra came back into the room holding up several samples of blue wallpaper. \"We\u0027re doing the nursery in blue, and we\u0027ll do the living room of the apartment in blue and white, your favorite colors. Which color wallpaper do you like, the lighter shade or the darker?\"\u003c/p\u003e\n\u003cp\u003eDavid forced himself to concentrate. \"The lighter looks good.\"\u003c/p\u003e\n\u003cp\u003e\"I like it, too. The only problem is that the rug is going to be a dark blue. Do you think they should match?\"\u003c/p\u003e\n\u003cp\u003eI can\u0027t give up the partnership. I\u0027ve worked too hard for it. It means too much.\u003c/p\u003e\n\u003cp\u003e\"David. Do you think they should match?\"\u003c/p\u003e\n\u003cp\u003eHe looked at her. \"What? Oh. Yes. Whatever you think, honey.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so excited. It\u0027s going to be beautiful.\"\u003c/p\u003e\n\u003cp\u003eThere\u0027s no way we can afford it tf I don\u0027t get the partnership.\u003c/p\u003e\n\u003cp\u003eSandra looked around the little apartment. \"We can use some of this furniture, but I\u0027m afraid we\u0027re going to need a lot of new things.\" She looked at him anxiously. \"We can handle it, can\u0027t we, darling? I don\u0027t want to go overboard.\"\u003c/p\u003e\n\u003cp\u003e\"Right,\" David said absently.\u003c/p\u003e\n\u003cp\u003eShe snuggled against his shoulder. \"It\u0027s going to be like a whole new life, isn\u0027t it? The baby and the partnership and the penthouse went by there today wanted to see the playground and the school. The playground\u0027s beautiful. It has slides and swings and jungle gyms want you to come with me Saturday to look at it. Jeffrey\u0027s going to adore it.\"\u003c/p\u003e\n\u003cp\u003eMaybe I can convince Kincaid that this would be a good thing for the firm.\u003c/p\u003e\n\u003cp\u003e\"The school looks nice. It\u0027s just a couple blocks from our condo, and it\u0027s not too large think that\u0027s important.\"\u003c/p\u003e\n\u003cp\u003eDavid was listening to her now and thought, I can\u0027t let her down can\u0027t take away her dreams. I\u0027ll tell Kincaid in the morning that I\u0027m not taking the Patterson case. Patterson will have to find someone else.\u003c/p\u003e\n\u003cp\u003e\"We\u0027d better get ready, darling. We\u0027re due at the Quillers\u0027 at eight o\u0027clock.\"\u003c/p\u003e\n\u003cp\u003eThis was the moment of truth. David felt himself tense. \"There\u0027s something we have to talk about.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I went to see Ashley Patterson this morning.\"\u003c/p\u003e\n\u003cp\u003e\"Oh? Tell me about it. Is she guilty? Did she do those terrible things?\"\u003c/p\u003e\n\u003cp\u003e\"Yes and no.\"\u003c/p\u003e\n\u003cp\u003e\"Spoken like a lawyer. What does that mean?\"\u003c/p\u003e\n\u003cp\u003e\"She committed the murders... but she\u0027s not guilty.\"\u003c/p\u003e\n\u003cp\u003e\"David - !\"\u003c/p\u003e\n\u003cp\u003e\"Ashley has a medical condition called multiple personality disorder. Her personality is split, so that she does things without knowing she\u0027s doing them.\"\u003c/p\u003e\n\u003cp\u003eSandra was staring at him. \"How horrible.\"\u003c/p\u003e\n\u003cp\u003e\"There are two other personalities. I\u0027ve heard them.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve heard them?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. And they\u0027re real. I mean, she\u0027s not faking.\"\u003c/p\u003e\n\u003cp\u003e\"And she has no idea that she - ?\"\u003c/p\u003e\n\u003cp\u003e\"None.\"\u003c/p\u003e\n\u003cp\u003e\"Then is she innocent or guilty?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s for the courts to decide. Her father won\u0027t talk to Jesse Quiller, so I\u0027ll have to find some other attorney.\"\u003c/p\u003e\n\u003cp\u003e\"But Jesse\u0027s perfect. Why won\u0027t he talk to him?\" David hesitated. \"He wants me to defend her.\"\u003c/p\u003e\n\u003cp\u003e\"But you told him you can\u0027t, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"Then - ?\"\u003c/p\u003e\n\u003cp\u003e\"He won\u0027t listen.\"\u003c/p\u003e\n\u003cp\u003e\"What did he say, David?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"It doesn\u0027t matter.\"\u003c/p\u003e\n\u003cp\u003e\"What did he say?\"\u003c/p\u003e\n\u003cp\u003eDavid replied slowly, \"He said that I trusted him enough to put my mother\u0027s life in his hands, and he saved her, and now he was trusting me enough to put his daughter\u0027s life in my hands, and he is asking me to save her.\" Sandra was studying his face. \"Do you think you could?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Kincaid doesn\u0027t want me to take the case. If I did take it, I could lose the partnership.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" There was a long silence.\u003c/p\u003e\n\u003cp\u003eWhen he spoke, David said, \"I have a choice. I can say no to Dr. Patterson and become a partner in the firm, or I can defend his daughter and probably go on an unpaid leave, and see what happens afterward.\"\u003c/p\u003e\n\u003cp\u003eSandra was listening quietly.\u003c/p\u003e\n\u003cp\u003e\"There are people much better qualified to handle Ashley\u0027s case, but for some damn reason, her father won\u0027t hear of anyone else. I don\u0027t know why he\u0027s so stubborn about it, but he is. If I take the case and I don\u0027t get the partnership, we\u0027ll have to forget about moving. We\u0027ll have to forget about a lot of our plans, Sandra.\"\u003c/p\u003e\n\u003cp\u003eSandra said softly, \"I remember before we were married, you told me about him. He was one of the busiest doctors in the world, but he found time to help a penniless young boy. He was your hero, David. You said that if we ever had a son, you would want him to grow up to be like Steven Patterson.\"\u003c/p\u003e\n\u003cp\u003eDavid nodded.\u003c/p\u003e\n\u003cp\u003e\"When do you have to decide?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m seeing Kincaid first thing in the morning.\" Sandra took his hand and said, \"You don\u0027t need that much time. Dr. Patterson saved your mother. You\u0027re going to save his daughter.\" She looked around and smiled. \"Anyway, we can always do this apartment over in blue and white.\"\u003c/p\u003e\n\u003cp\u003eJesse Quiller was one of the top criminal defense attorneys in the country. He was a tall, rugged man with a homespun touch that made jurors identify with him. They felt that he was one of them, and they wanted to help him. That was one of the reasons he seldom lost a case. The other reasons were that he had a photographic memory and a brilliant mind.\u003c/p\u003e\n\u003cp\u003eInstead of vacationing, Quiller used his summers to teach law, and years earlier David had been one of his pupils. When David graduated, Quiller invited him to join his criminal law firm, and two years later, David had become a partner. David loved practicing criminal law and excelled at it. He made sure that at least 10 percent of his cases were pro bono. Three years after becoming a partner, David had abruptly resigned and gone to work for Kincaid, Turner, Rose \u0026amp; Ripley to practice corporate law.\u003c/p\u003e\n\u003cp\u003eOver the years, David and Quiller had remained close friends. They, and their wives, had dinner together once a week.\u003c/p\u003e\n\u003cp\u003eJesse Quiller had always fancied tall, sylphlike, sophisticated blondes. Then he had met Emily and fallen in love with her. Emily was a prematurely gray dumpling of a woman, from an Iowa farm - the exact opposite of other women Quiller had dated. She was a caretaker, mother earth. They made an unlikely couple, but the marriage worked because they were deeply in love with each other.\u003c/p\u003e\n\u003cp\u003eEvery Tuesday, the Singers and the Quillers had dinner and then played a complicated card game called Liverpool.\u003c/p\u003e\n\u003cp\u003eWhen Sandra and David arrived at the Quillers\u0027 beautiful home on Hayes Street, Jesse met them at the door. He gave Sandra a bug and said, \"Come in. We\u0027ve got the champagne on ice. It\u0027s a big day for you, hub? The new penthouse and the partnership. Or is it the partnership and the penthouse?\"\u003c/p\u003e\n\u003cp\u003eDavid and Sandra looked at each other. \"Emily\u0027s in the kitchen fixing a celebration dinner.\" He looked at their faces. \"I think it\u0027s a celebration dinner. Am I missing something?\"\u003c/p\u003e\n\u003cp\u003eDavid said, \"No, Jesse. It\u0027s just that we may have a -\u0026nbsp;\u0026nbsp;a little problem.\"\u003c/p\u003e\n\u003cp\u003e\"Come on in. Fix you a drink?\" He looked at Sandra.\u003c/p\u003e\n\u003cp\u003e\"No, thanks. I don\u0027t want the baby to get into bad habits.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a lucky kid, having parents like you,\" Quiller said warmly. He turned to David. \"What can I get for you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine,\" David said.\u003c/p\u003e\n\u003cp\u003eSandra started toward the kitchen. \"I\u0027ll go see if I can help Emily.\"\u003c/p\u003e\n\u003cp\u003e\"Sit down, David. You look serious.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in a dilemma,\" David admitted.\u003c/p\u003e\n\u003cp\u003e\"Let me guess. Is it the penthouse or the partnership?\"\u003c/p\u003e\n\u003cp\u003e\"Both.\"\u003c/p\u003e\n\u003cp\u003e\"Both?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. You know about the Patterson case?\"\u003c/p\u003e\n\u003cp\u003e\"Ashley Patterson? Sure. What\u0027s that got to do with - ?\" He stored. \"Wait a minute. You told me about Steven Patterson, in law school. He saved your mother\u0027s life.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. He wants me to defend his daughter. I tried to torn the case over to you, but he won\u0027t hear of anyone but me defending her.\"\u003c/p\u003e\n\u003cp\u003eQuiller frowned. \"Does he know you\u0027re not practicing criminal law anymore?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. That\u0027s what\u0027s so damn strange. There are dozens of lawyers who can do a hell of a lot better job than I can.\"\u003c/p\u003e\n\u003cp\u003e\"He knows that you were a criminal defense lawyer?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eQuiller said carefully, \"How does he feel about his daughter?\"\u003c/p\u003e\n\u003cp\u003eWhat a strange question, David thought \"She means more to him than anything in the world.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Suppose you took her case. The downside is that - \"\u003c/p\u003e\n\u003cp\u003e\"The downside is that Kincaid doesn\u0027t want me to take it. If I do, I have a feeling that I\u0027ll lose the partnership.\"\u003c/p\u003e\n\u003cp\u003e\"I see. And that\u0027s where the penthouse comes in?\" David said angrily, \"That\u0027s where my whole god-damn future comes in. It would be stupid for me to do this, Jesse. I mean really stupid!\"\u003c/p\u003e\n\u003cp\u003e\"What are you getting mad about?\" David took a deep breath. \"Because I\u0027m going to do it.\"\u003c/p\u003e\n\u003cp\u003eQuiller smiled. \"Why am I not surprised?\" David ran his hand across his forehead, \"if I turned him down, and his daughter was convicted and executed, and I did nothing to help, I - I couldn\u0027t live with myself.\"\u003c/p\u003e\n\u003cp\u003e\"I understand. How does Sandra feel about this?\" David managed a smile. \"You know Sandra.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. She wants you to go a bead with it.\"\u003c/p\u003e\n\u003cp\u003e\"Right.\"\u003c/p\u003e\n\u003cp\u003eQuiller leaned forward. \"I\u0027ll do everything I can to help you, David.\"\u003c/p\u003e\n\u003cp\u003eDavid sighed. \"No. That\u0027s part of my bargain. I have to handle this alone.\"\u003c/p\u003e\n\u003cp\u003eQuiller frowned. \"That doesn\u0027t make any sense.\"\u003c/p\u003e\n\u003cp\u003e\"I know. I tried to explain that to Dr. Patterson, but he wouldn\u0027t listen.\"\u003c/p\u003e\n\u003cp\u003e\"Have you told Kincaid about this yet?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m having a meeting with him in the morning.\"\u003c/p\u003e\n\u003cp\u003e\"What do you think will happen?\"\u003c/p\u003e\n\u003cp\u003e\"I know what\u0027s going to happen. He\u0027s going to advise me not to take the case and, if I insist, he\u0027ll ask me to take a leave of absence without pay.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s have lunch tomorrow. Rubicon, one o\u0027clock.\" David nodded. \"Fine.\"\u003c/p\u003e\n\u003cp\u003eEmily came in from the kitchen wiping her hands on a kitchen towel. David and Quiller rose.\u003c/p\u003e\n\u003cp\u003e\"Hello, David.\" Emily hustled up to him, and he gave her a kiss on the cheek.\u003c/p\u003e\n\u003cp\u003e\"I hope you\u0027re hungry. Dinner\u0027s almost ready. Sandra\u0027s in the kitchen helping me. She\u0027s such a dear.\" She picked up a tray and hurried back into the kitchen.\u003c/p\u003e\n\u003cp\u003eQuiller turned to David. \"You mean a great deal to Emily and me. I\u0027m going to give you some advice. You\u0027ve got to let go.\" David sat there, saying nothing. \"That was a long time ago, David. And what happened wasn\u0027t your fault. It could have happened to anyone.\"\u003c/p\u003e\n\u003cp\u003eDavid looked at Quiller. \"It happened to me, Jesse. I killed her.\"\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp;\u0026nbsp; *\u0026nbsp;\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eIt was deja vu. All over again. And again. David sat there, transported back to another time and another place.\u003c/p\u003e\n\u003cp\u003eIt had been a pro bono case, and David had said to Jesse Quiller, \"I\u0027ll handle it.\"\u003c/p\u003e\n\u003cp\u003eHelen Woodman was a lovely young woman accused of murdering her wealthy stepmother. There had been bitter public quarrels between the two, but all the evidence against Helen was circumstantial. After David had gone to the jail and met with her, he was convinced she was innocent. With each meeting, he had become more emotionally involved. In the end, he had broken a basic rule: Never fall in love with a client.\u003c/p\u003e\n\u003cp\u003eThe trial had gone well. David had refuted the prosecutor\u0027s evidence bit by bit, and he had won the jury over to his client\u0027s side. And unexpectedly, a disaster had occurred. Helen\u0027s alibi was that at the time of the murder she had been at the theater with a friend. Under questioning in court, her friend admitted that the alibi was a lie, and a witness had come forward to say that he had seen Helen at her stepmother\u0027s apartment at the time of the murder. Helen\u0027s credibility was completely gone. The jury convicted her of first-degree murder, and the judge sentenced her to be executed. David was devastated.\u003c/p\u003e\n\u003cp\u003e\"How could you have done this, Helen?\" he demanded. \"Why did you lie to me?\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t kill my stepmother, David. When I got to her apartment, I found her on the floor, dead. I was afraid you wouldn\u0027t believe me, so I - I made up the story about being at the theater.\"\u003c/p\u003e\n\u003cp\u003eHe stood there, listening, a cynical expression on his face.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m telling you the truth, David.\"\u003c/p\u003e\n\u003cp\u003e\"Are you?\" He turned and stormed out. Sometime during the night, Helen committed suicide. One week later, an ex-convict caught committing a burglary confessed to the murder of Helen\u0027s stepmother.\u003c/p\u003e\n\u003cp\u003eThe next day, David quit Jesse Quiller\u0027s firm. Quiller had tried to dissuade him.\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t your fault, David. She lied to you and - \"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the point. I let her. I didn\u0027t do my job. I didn\u0027t make sure she was telling me the truth. I wanted to believe her, and because of that, I let her down.\"\u003c/p\u003e\n\u003cp\u003eTwo weeks later, David was working for Kincaid, Turner, Rose \u0026amp; Ripley.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll never be responsible for another person\u0027s life,\" David had sworn. And now he was defending Ashley Patterson. \u003c/p\u003e","sourceLink":"https://allnovel.net/tell-me-your-dreams/page-13.html","bookId":2368,"creation":"Oct 5, 2019 10:12:53 AM","modification":"Oct 5, 2019 10:12:53 AM"}
