{"id":69139,"no":15,"title":"Page 15","content":"\u003cp\u003eSAN Jose had quickly taken on the atmosphere of a carnival town. Media from all over the world were pouring in. Every hotel was booked, and some of the members of the press were forced to take rooms in the outlying towns of Santa Clara, Sunnyvale and Palo Alto. David was besieged by reporters.\u003c/p\u003e\n\u003cp\u003e\"Mr. Singer, tell us about the case. Are you pleading your client not guilty...?\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to put Ashley Patterson on the stand...?\"\u003c/p\u003e\n\u003cp\u003e\"Is it true that the district attorney was willing to plea-bargain?\"\u003c/p\u003e\n\u003cp\u003e\"Is Dr. Patterson going to testify for his daughter...?\"\u003c/p\u003e\n\u003cp\u003e\"My magazine will pay fifty thousand dollars for an interview with your client...\"\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp;\u0026nbsp; *\u0026nbsp;\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eMickey Brennan was also pursued by the media.\u003c/p\u003e\n\u003cp\u003e\"Mr. Brennan, would you say a few words about the trial?\"\u003c/p\u003e\n\u003cp\u003eBrennan turned and smiled at the television cameras. \"Yes. I can sum up the trial in five words. \u0027We\u0027re going to win it.\u0027 No further comment.\"\u003c/p\u003e\n\u003cp\u003e\"Wait! Do you think she\u0027s insane...?\"\u003c/p\u003e\n\u003cp\u003e\"Is the state going to ask for the death penalty...?\"\u003c/p\u003e\n\u003cp\u003e\"Did you call it an open-and-shut case...?\"\u003c/p\u003e\n\u003cp\u003eDavid rented an office in San Jose close to the court-house, where he could interview his witnesses and prepare them for the trial. He had decided that Sandra would work out of Quiller\u0027s office in San Francisco until the trial started. Dr. Salem had arrived in San Jose.\u003c/p\u003e\n\u003cp\u003e\"I want you to hypnotize Ashley again,\" David said. \"Let\u0027s get all the information we can from her and the alters before the trial starts.\"\u003c/p\u003e\n\u003cp\u003eThey met Ashley in a holding room at the county detention center. She was trying hard to conceal her nervousness. To David, she looked like a deer trapped in the headlights of a Juggernaut.\u003c/p\u003e\n\u003cp\u003e\"Morning, Ashley. You remember Dr. Salem?\" Ashley nodded.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s going to hypnotize you again. Will that be all right?\"\u003c/p\u003e\n\u003cp\u003eAshley said, \"He\u0027s going to talk to the... the others?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Do you mind?\"\u003c/p\u003e\n\u003cp\u003e\"No. But I - I don\u0027t want to talk to them.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all right. You don\u0027t have to.\"\u003c/p\u003e\n\u003cp\u003e\"I hate this!\" Ashley burst out angrily.\u003c/p\u003e\n\u003cp\u003e\"I know,\" David said soothingly. \"Don\u0027t worry. It\u0027s going to be over soon.\" He nodded to Dr. Salem.\u003c/p\u003e\n\u003cp\u003e\"Make yourself comfortable, Ashley. Remember how easy this was. Close your eyes and relax. Just try to clear your mind. Feel your body relaxing. Listen to the sound of my voice. Let everything else go. You\u0027re getting very sleepy. Your eyes are getting very heavy. You want to go to sleep.... Go to sleep....\"\u003c/p\u003e\n\u003cp\u003eIn ten minutes, she was under. Dr. Salem signaled to David. David walked over to Ashley.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to talk to Alette. Are you in there, Alette?\"\u003c/p\u003e\n\u003cp\u003eAnd they watched Ashley\u0027s face soften and go through the same transformation they had seen earlier. And then, that soft, mellifluous Italian accent.\u003c/p\u003e\n\u003cp\u003e\"Buon giorno.\"\u003c/p\u003e\n\u003cp\u003e\"Good morning, Alette. How do you feel?\"\u003c/p\u003e\n\u003cp\u003e\"Male. This is a very difficult time.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s difficult for all of us,\" David assured her, \"but everything\u0027s going to be all right.\"\u003c/p\u003e\n\u003cp\u003e\"I hope so.\"\u003c/p\u003e\n\u003cp\u003e\"Alette, I\u0027d like to ask you a few questions.\"\u003c/p\u003e\n\u003cp\u003e\"Si...\"\u003c/p\u003e\n\u003cp\u003e\"Did you know Jim Cleary?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Did you know Richard Melton?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" There was a deep sadness in her voice. \"It was... it was terrible what happened to him.\"\u003c/p\u003e\n\u003cp\u003eDavid looked over at Dr. Salem. \"Yes, it was terrible. When was the last time you saw him?\"\u003c/p\u003e\n\u003cp\u003e\"I visited him in San Francisco. We went to a museum and then had dinner. Before I left, he asked me to go to his apartment with him.\"\u003c/p\u003e\n\u003cp\u003e\"And did you go?\"\u003c/p\u003e\n\u003cp\u003e\"No. I wish I had,\" Alette said regretfully. \"I might have saved his life.\" There was a short silence. \"We said good-bye, and drove back to Cupertino.\"\u003c/p\u003e\n\u003cp\u003e\"And that was the last time you saw him?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Alette.\"\u003c/p\u003e\n\u003cp\u003eDavid moved closer to Ashley and said, \"Toni? Are you there, Toni? I\u0027d like to talk to you.\"\u003c/p\u003e\n\u003cp\u003eAs they watched, Ashley\u0027s face went through another remarkable transformation. Her persona changed before their eyes. There was a new assurance, a sexual awareness. She began to sing in that clear, throaty voice:\u003c/p\u003e\n\u003cp\u003e\"Up and down the city road,\u003c/p\u003e\n\u003cp\u003eIn and out of the Eagle.\u003c/p\u003e\n\u003cp\u003eThat\u0027s the way the money goes,\u003c/p\u003e\n\u003cp\u003ePop! goes the weasel. \"\u003c/p\u003e\n\u003cp\u003eShe looked at David. \"Do you know why I like to sing that song, luv?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Because my mother hated it. She hated me.\"\u003c/p\u003e\n\u003cp\u003e\"Why did she hate you?\"\u003c/p\u003e\n\u003cp\u003e\"Well, we can\u0027t ask her now, can we?\" Toni laughed.\u003c/p\u003e\n\u003cp\u003e\"Not where she is. I couldn\u0027t do anything right for her. What kind of mother did you have, David?\"\u003c/p\u003e\n\u003cp\u003e\"My mother was a wonderful person.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re lucky then, aren\u0027t you? It\u0027s really the luck of the draw, I suppose. God plays games with us, doesn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003e\"Do you believe in God? Are you a religious person, Toni?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Maybe there\u0027s a God. If there is, he has a strange sense of humor, doesn\u0027t he? Alette is the religious one. She goes to church regularly, that one.\"\u003c/p\u003e\n\u003cp\u003e\"And do you?\"\u003c/p\u003e\n\u003cp\u003eToni gave a short laugh. \"Well, if she\u0027s there. I\u0027m there.\"\u003c/p\u003e\n\u003cp\u003e\"Toni, do you believe it\u0027s right to kill people?\"\u003c/p\u003e\n\u003cp\u003e\"No, of course not.\"\u003c/p\u003e\n\u003cp\u003e\"Then - \"\u003c/p\u003e\n\u003cp\u003e\"Not unless you have to.\"\u003c/p\u003e\n\u003cp\u003eDavid and Dr. Salem exchanged a look.\u003c/p\u003e\n\u003cp\u003e\"What do you mean by that?\"\u003c/p\u003e\n\u003cp\u003eHer tone of voice changed. She suddenly sounded defensive. \"Well, you know, like if you have to protect yourself. If someone\u0027s hurting you.\" She was getting agitated. \"If some git is trying to do dirty things to you.\" She was becoming hysterical.\u003c/p\u003e\n\u003cp\u003e\"Toni - \"\u003c/p\u003e\n\u003cp\u003eShe started sobbing. \"Why can\u0027t they leave me alone? Why did they have to - ?\" She was screaming.\u003c/p\u003e\n\u003cp\u003e\"Toni - \"\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e\"Toni...\"\u003c/p\u003e\n\u003cp\u003eNothing.\u003c/p\u003e\n\u003cp\u003eDr. Salem said, \"She\u0027s gone. I\u0027d like to wake Ashley up.\"\u003c/p\u003e\n\u003cp\u003eDavid sighed. \"All right.\"\u003c/p\u003e\n\u003cp\u003eA few minutes later, Ashley was opening her eyes.\u003c/p\u003e\n\u003cp\u003e\"How do you feel?\" David asked.\u003c/p\u003e\n\u003cp\u003e\"Tired. Did it...did it go all right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. We talked to Alette and Toni. They - \"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to know.\"\u003c/p\u003e\n\u003cp\u003e\"All right. Why don\u0027t you go rest now, Ashley? I\u0027ll be back to see you this afternoon.\"\u003c/p\u003e\n\u003cp\u003eThey watched a female jailer lead her away.\u003c/p\u003e\n\u003cp\u003eDr. Salem said, \"You have to put her on the stand, David. That will convince any jury in the world that - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve given it a lot of thought,\" David said. \"I don\u0027t think I can.\"\u003c/p\u003e\n\u003cp\u003eDr. Salem looked at him a moment. \"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"Brennan, the prosecuting attorney, is a killer. He would tear her apart can\u0027t take that chance.\"\u003c/p\u003e\n\u003cp\u003eDavid and Sandra were having dinner with the Quillers two days before the preliminaries of the trial were to begin.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve checked into the Wyndham Hotel,\" David said. \"The manager did me a special favor. Sandra\u0027s coming down with me. The town is crowded beyond belief.\"\u003c/p\u003e\n\u003cp\u003e\"And if it\u0027s that bad now,\" Emily said, \"imagine what it\u0027s going to be like when the trial starts.\"\u003c/p\u003e\n\u003cp\u003eQuiller looked at David. \"Anything can do to help?\"\u003c/p\u003e\n\u003cp\u003eDavid shook his head. \"I have a big decision to make. Whether to put Ashley on the stand or not.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a tough call,\" Jesse Quiller said. \"You\u0027re damned if you do and damned if you don\u0027t. The problem is that Brennan is going to build Ashley Patterson up as a sadistic, murdering monster. If you don\u0027t put her on the stand, that\u0027s the image the jurors will carry in then-minds when they go into the jury room to reach a verdict. On the other hand, from what you tell me, if you do put Ashley on the stand, Brennan can destroy her.\"\u003c/p\u003e\n\u003cp\u003e\"Brennan\u0027s going to have all his medical experts there to discredit multiple personality disorder.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got to convince them that it\u0027s real.\"\u003c/p\u003e\n\u003cp\u003e\"And I intend to,\" David said. \"Do you know what bothers me, Jesse? The jokes. The latest one going around is that wanted to ask for a change of venue, but decided not to because there are no places left where Ashley hasn\u0027t murdered someone. Do you remember when Johnny Carson was on television? He was funny and he always remained a gentleman. Now, the hosts on the late-night shows are all malicious. Then-humor at the expense of other people is savage.\"\u003c/p\u003e\n\u003cp\u003e\"David?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eJesse Quiller said quietly, \"It\u0027s going to get worse.\"\u003c/p\u003e\n\u003cp\u003eDavid Singer was unable to sleep the night before he was to go into court. He could not stem the negative thoughts swirling through his head. When he finally fell asleep, he heard a voice saying. You let your last client die. What if you let this one die?\u003c/p\u003e\n\u003cp\u003eHe sat up in bed, bathed in perspiration.\u003c/p\u003e\n\u003cp\u003eSandra opened her eyes. \"Are you all right?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. No. What the hell am I doing here? All I had to do was say no to Dr. Patterson.\"\u003c/p\u003e\n\u003cp\u003eSandra squeezed his aim and said softly, \"Why didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eHe grunted. \"You\u0027re right. I couldn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"All right then. Now, how about getting some sleep so you\u0027ll be nice and fresh in the morning?\"\u003c/p\u003e\n\u003cp\u003e\"Great idea.\"\u003c/p\u003e\n\u003cp\u003eHe was awake the rest of the night.\u003c/p\u003e\n\u003cp\u003eJudge Williams had been correct about the media. The reporters were relentless. Journalists were swarming in from around the world, avid to cover the story of a beautiful young woman being tried as a serial killer who sexually mutilated her victims.\u003c/p\u003e\n\u003cp\u003eThe fact that Mickey Brennan was forbidden to bring the names of Jim Cleary or Jean Claude Parent into the trial had been frustrating, but the media had solved the problem for him. Television talk shows, magazines and newspapers all carried lurid stories of the five murders and castrations. Mickey Brennan was pleased.\u003c/p\u003e\n\u003cp\u003eWhen David arrived at the courtroom, the press was out in full force. David was besieged.\u003c/p\u003e\n\u003cp\u003e\"Mr. Singer, are you still employed by Kincaid, Turner, Rose \u0026amp; Ripley...?\"\u003c/p\u003e\n\u003cp\u003e\"Look this way, Mr. Singer....\"\u003c/p\u003e\n\u003cp\u003e\"Is it true you were fired for taking this case...?\"\u003c/p\u003e\n\u003cp\u003e\"Can you tell us about Helen Woodman? Didn\u0027t you handle her murder trial...?\"\u003c/p\u003e\n\u003cp\u003e\"Did Ashley Patterson say why she did it...?\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to put your client on the stand...?\"\u003c/p\u003e\n\u003cp\u003e\"No comment,\" David said curtly.\u003c/p\u003e\n\u003cp\u003eWhen Mickey Brennan drove up to the courthouse, he was instantly surrounded by the media.\u003c/p\u003e\n\u003cp\u003e\"Mr. Brennan, how do you think the trial is going to go...?\"\u003c/p\u003e\n\u003cp\u003e\"Have you ever tried an alter ego defense before...?\" Brennan smiled genially. \"No. I can\u0027t wait to talk to all the defendants.\" He got the laugh that he wanted. \"If there are enough of them, they can have their own ball club.\" Another laugh. \"I\u0027ve got to get inside. I don\u0027t want to keep any of the defendants waiting.\"\u003c/p\u003e\n\u003cp\u003eThe voir dire started with Judge Williams asking general questions of the potential jurors. When she had finished, it was the defense\u0027s turn and then the prosecution\u0027s.\u003c/p\u003e\n\u003cp\u003eTo laymen, the selection of a jury seems simple: Choose the prospective juror who seemed friendly and dismiss the others. In fact, voir dire was a carefully planned ritual. Skilled trial lawyers did not ask direct questions that would bring yes or no answers. They asked general questions that would encourage the jurors to talk and reveal something of themselves and their true feelings.\u003c/p\u003e\n\u003cp\u003eMickey Brennan and David Singer had different agendas. In this case, Brennan wanted a preponderance of men on the jury, men who would be disgusted and shocked at the idea of a woman stabbing and castrating her victims. Brennan\u0027s questions were meant to pinpoint people who were traditional in their thinking, who would be less likely to believe in spirits and goblins and people who claimed they were inhabited by alters. David took the opposite approach.\u003c/p\u003e\n\u003cp\u003e\"Mr. Harris, is it? I\u0027m David Singer. I\u0027m representing the defendant. Have you ever served on a jury before, Mr. Hams?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"I appreciate your taking the time and trouble to do this.\"\u003c/p\u003e\n\u003cp\u003e\"It should be interesting, a big murder trial like this.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. I think it will be.\"\u003c/p\u003e\n\u003cp\u003e\"In fact, I\u0027ve been looking forward to it.\"\u003c/p\u003e\n\u003cp\u003e\"Have you?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah.\"\u003c/p\u003e\n\u003cp\u003e\"Where do you work, Mr. Hams?\"\u003c/p\u003e\n\u003cp\u003e\"At United Steel.\"\u003c/p\u003e\n\u003cp\u003e\"I imagine you and your fellow workers have talked about the Patterson case.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. As a matter of fact, we have.\"\u003c/p\u003e\n\u003cp\u003eDavid said, \"That\u0027s understandable. Everyone seems to be talking about it. What\u0027s the general opinion? Do your fellow workers think Ashley Patterson is guilty?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. I have to say they do.\"\u003c/p\u003e\n\u003cp\u003e\"And do you think so?\"\u003c/p\u003e\n\u003cp\u003e\"Well, it sure looks like it.\"\u003c/p\u003e\n\u003cp\u003e\"But you\u0027re willing to listen to the evidence before making up your mind?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. I\u0027ll listen to it.\"\u003c/p\u003e\n\u003cp\u003e\"What do you like to read, Mr. Hams?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not a big reader. I like to camp out and hunt and fish.\"\u003c/p\u003e\n\u003cp\u003e\"An outdoorsman. When you\u0027re camping out at night and you look at the stars, do you ever wonder if there are other civilizations up there?\"\u003c/p\u003e\n\u003cp\u003e\"You mean that crazy UFO stuff? I don\u0027t believe in all that nonsense.\"\u003c/p\u003e\n\u003cp\u003eDavid turned to Judge Williams. \"Pass for cause, Your Honor.\"\u003c/p\u003e\n\u003cp\u003eAnother juror interrogation:\u003c/p\u003e\n\u003cp\u003e\"What do you like to do in your spare time, Mr. Alien?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I like to read and watch television.\"\u003c/p\u003e\n\u003cp\u003e\"I like to do the same things. What do you watch on television?\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s some great shows on Thursday nights. It\u0027s hard to choose. The damn networks put all the good shows on at the same time.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right. It\u0027s a shame. Do you ever watch the X-Files?\u0027\u003c/p\u003e\n\u003cp\u003e\"Yeah. My kids love it.\"\u003c/p\u003e\n\u003cp\u003e\"What about Sabrina, the Teenage Witch?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. We watch that. That\u0027s a good show.\"\u003c/p\u003e\n\u003cp\u003e\"What do you like to read?\"\u003c/p\u003e\n\u003cp\u003e\"Anne Rice, Stephen King...\"\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp;\u0026nbsp; *\u0026nbsp;\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eAnother juror interrogation:\u003c/p\u003e\n\u003cp\u003e\"What do you like to watch on television, Mr. Mayer?\"\u003c/p\u003e\n\u003cp\u003e\"Sixty Minutes, the News Hour with Jim Lehrer, documentaries...\"\u003c/p\u003e\n\u003cp\u003e\"What do you like to read?\"\u003c/p\u003e\n\u003cp\u003e\"Mainly history and political books.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eJudge Tessa Williams sat on the bench, listening to the questioning, her face betraying nothing. But David could feel her disapproval every time she looked at him.\u003c/p\u003e\n\u003cp\u003eWhen the last juror was finally selected, the panel consisted of seven men and five women. Brennan glanced at David triumphantly. This is going to be a slaughter. \u003c/p\u003e","sourceLink":"https://allnovel.net/tell-me-your-dreams/page-15.html","bookId":2368,"creation":"Oct 5, 2019 10:12:53 AM","modification":"Oct 5, 2019 10:12:53 AM"}
