{"id":69126,"no":2,"title":"Page 2","content":"\u003cp\u003e\"All around the mulberry bush,\u003c/p\u003e\n\u003cp\u003eThe monkey chased the weasel.\u003c/p\u003e\n\u003cp\u003eThe monkey thought \u0027twas all in fun,\u003c/p\u003e\n\u003cp\u003ePop! goes the weasel.\"\u003c/p\u003e\n\u003cp\u003eToni Prescott knew exactly why she liked to sing that silly song. Her mum had hated it. \"Stop singing that stupid song. Do you hear me? You have no voice, anyway.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Mother.\" And Toni would sing it again and again, under her breath. That had been long ago, but the memory of defying her mother still gave her a glow.\u003c/p\u003e\n\u003cp\u003eToni Prescott hated working at Global Computer Graphics. She was twenty-two years old, impish, vivacious, and daring. She was half smoldering, half firecracker.\u003c/p\u003e\n\u003cp\u003eHer face was puckishly heart shaped, her eyes were a mischievous brown, her figure alluring. She had been born in London and she spoke with a delightful British accent She was athletic and loved sports, particularly winter sports: siding and bobsledding and ice-skating.\u003c/p\u003e\n\u003cp\u003eGoing to college in London, Toni had dressed conservatively during the day, but at night, she had donned miniskirts and disco gear and made the swinging rounds. She had spent her evenings and nights at the Electric Ballroom on Camden High Street, and at Subterania and the Leopard Lounge, mixing with the trendy West End crowd. She had a beautiful voice, sultry and sensuous, and at some of the clubs, she would go to the piano and play and sing, and the patrons would cheer her. That was when she felt most alive.\u003c/p\u003e\n\u003cp\u003eThe routine inside the clubs would always follow the same pattern:\u003c/p\u003e\n\u003cp\u003e\"Do you know you\u0027re a fantastic singer, Toni?\"\u003c/p\u003e\n\u003cp\u003e\"Ta.\"\u003c/p\u003e\n\u003cp\u003e\"Can I buy you a drink?\"\u003c/p\u003e\n\u003cp\u003eShe smiled. \"A Pimm\u0027s would be lovely.\"\u003c/p\u003e\n\u003cp\u003e\"My pleasure.\"\u003c/p\u003e\n\u003cp\u003eAnd it would end the same way. Her date would lean close to her and whisper in her ear, \"Why don\u0027t we go up to my flat and have a shag?\"\u003c/p\u003e\n\u003cp\u003e\"Buzz off.\" And Toni would be out of there. She would lie in her bed at night, thinking about how stupid men were and how bloody easy it was to control them. The poor sods did not know it, but they wanted to be controlled. They needed to be controlled.\u003c/p\u003e\n\u003cp\u003eAnd then came the move from London to Cupertino. In the beginning, it had been a disaster. Toni hated Cupertino and she loathed working at Global Computer Graphics. She was bored with hearing about plug-ins and dpi\u0027s and halftones and grids. She desperately missed the exciting nightlife of London. There were a few nightspots in the Cupertino area, and Toni frequented those: San Jose Live or P. J. Mulligan\u0027s or Hollywood Junction. She wore tight-fitting miniskirts and tube tops with open-toed shoes having five-inch heels or platform shoes with thick cork soles. She used a lot of makeup - thick, dark eye-liner, false eyelashes, colored eye shadow and bright lipstick. It was as though she were trying to hide her beauty.\u003c/p\u003e\n\u003cp\u003eSome weekends, Toni would drive up to San Francisco, where the real action was. She haunted the restaurants and clubs that had music bars. She would visit Harry Denton\u0027s and One Market restaurant and the California Cafe, and during the evening, while the musicians took their break, Toni would go to the piano and play and sing. The customers loved it. When Toni tried to pay her dinner bills, the owners would say, \"No, this is on the house. You\u0027re wonderful. Please come back again.\"\u003c/p\u003e\n\u003cp\u003eDid you hear that? Mother? \"You\u0027re wonderful. Please come back again.\"\u003c/p\u003e\n\u003cp\u003eOn a Saturday night, Toni was having dinner in the French Room at the Cliff Hotel. The musicians had fin-\u003c/p\u003e\n\u003cp\u003eished their set and left the bandstand. The maitre d\u0027 looked at Toni and nodded invitingly.\u003c/p\u003e\n\u003cp\u003eToni rose and walked across the room to the piano. She sat down and began to play and sing an early Cole Porter number. When she was finished, there was enthusiastic applause. She sang two more songs and returned to her table.\u003c/p\u003e\n\u003cp\u003eA bald, middle-aged man came up to her. \"Excuse me. May I join you for a moment?\"\u003c/p\u003e\n\u003cp\u003eToni started to say no, when he added, \"I\u0027m Norman Zimmerman. I\u0027m producing a road company of The King and I. I\u0027d like to talk to you about it.\"\u003c/p\u003e\n\u003cp\u003eToni had just read a glowing article about him. He was a theatrical genius.\u003c/p\u003e\n\u003cp\u003eHe sat down. \"You have a remarkable talent, young lady. You\u0027re wasting your time fooling around in places like this. You should be on Broadway.\"\u003c/p\u003e\n\u003cp\u003eBroadway. Did you hear that. Mother?\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to audition you for - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003eHe looked at her in surprise. \"This could open a lot of doors for you. I mean it. I don\u0027t think you know how talented you are.\"\u003c/p\u003e\n\u003cp\u003e\"I have a job.\"\u003c/p\u003e\n\u003cp\u003e\"Doing what, may I ask?\"\u003c/p\u003e\n\u003cp\u003e\"I work at a computer company.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell you what. I\u0027ll start by paying you double whatever you\u0027re getting now and - \"\u003c/p\u003e\n\u003cp\u003eToni said, \"I appreciate it, but I... I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003eZimmerman sat back in his chair. \"You\u0027re not interested in show business?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m very interested.\"\u003c/p\u003e\n\u003cp\u003e\"Then what\u0027s the problem?\"\u003c/p\u003e\n\u003cp\u003eToni hesitated, then said carefully, \"I\u0027d probably have to leave in the middle of the tour.\"\u003c/p\u003e\n\u003cp\u003e\"Because of your husband or - ?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not married.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand. You said you\u0027re interested in show business. This is the perfect showcase for you to - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry. I can\u0027t explain.\"\u003c/p\u003e\n\u003cp\u003eIf I did explain, he wouldn\u0027t understand, Toni thought miserably. No one would. It\u0027s the unholy curse I have to live with. Forever.\u003c/p\u003e\n\u003cp\u003eA few months after Toni started working at Global Computer Graphics, she learned about the Internet, the worldwide open door to meeting men.\u003c/p\u003e\n\u003cp\u003eShe was having dinner at the Duke of Edinburgh with Kathy Healy, a friend who worked for a rival computer company. The restaurant was an authentic pub from England that had been torn down, packed in containers and shipped to California. Toni would go there for Cockney fish and chips, prime ribs with Yorkshire pudding, bangers and mash and English sherry trifle. One foot on tile ground, she would say. I have to remember my roots.\u003c/p\u003e\n\u003cp\u003eToni looked up at Kathy. \"I want you to do me a favor.\"\u003c/p\u003e\n\u003cp\u003e\"Name it.\"\u003c/p\u003e\n\u003cp\u003e\"I want you to help me with the Internet, luv. Tell me how to use it.\"\u003c/p\u003e\n\u003cp\u003e\"Toni, the only computer I have access to is at work, and it\u0027s against company policy to - \"\u003c/p\u003e\n\u003cp\u003e\"Sod company policy. You know how to use the Internet, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003eToni patted Kathy Healy\u0027s hand and smiled. \"Great.\" The following evening, Toni went to Kathy Healy\u0027s office, and Kathy introduced Toni to the world of the Internet. After clicking on the Internet icon, Kathy entered her password and waited a moment to connect, then double clicked another icon and entered a chat room. Toni sat in amazement, watching rapid, typed conversations taking place among people all over the globe.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got to have that!\" Toni said. \"I\u0027ll get a computer for my flat. Would you be an angel and set me up on the Internet?\"\u003c/p\u003e\n\u003cp\u003e\"Sure. It\u0027s easy. All you do is click your mouse into the URL field, the uniform resource locator, and - \"\u003c/p\u003e\n\u003cp\u003e\"Like the song says, \u0027Don\u0027t tell me, show me.\"\u003c/p\u003e\n\u003cp\u003eThe next night, Toni was on the Internet, and from that time on, her life changed. She was no longer bored. The Internet became a magic carpet that flew her all over the world. When Toni got home from work, she would immediately turn on her computer and go on-line to explore various chat rooms that were available.\u003c/p\u003e\n\u003cp\u003eIt was so simple. She accessed the Internet, pressed a key and a window opened on the screen, split into an upper portion and a lower portion. Toni typed in \"Hello. Is anyone there?\"\u003c/p\u003e\n\u003cp\u003eThe lower portion of the screen flashed the words \"Bob. I\u0027m here. I\u0027m waiting for you.\"\u003c/p\u003e\n\u003cp\u003eShe was ready to meet the world.\u003c/p\u003e\n\u003cp\u003eThere was Hans in Holland.\u003c/p\u003e\n\u003cp\u003e\"Tell me about yourself, Hans.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a DJ in Amsterdam at a great club. I\u0027m into hip-hop, rave, world beat. You name it.\"\u003c/p\u003e\n\u003cp\u003eToni typed in her reply. \"Sounds great I love to dance. I can go all night long. I live in a horrible little town that has nothing to offer except a few disco nights.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds sad.\"\u003c/p\u003e\n\u003cp\u003e\"It bloody well is.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you let me cheer you up? What are the chances of our meeting?\"\u003c/p\u003e\n\u003cp\u003e\"Ta ta.\" She exited the chat room.\u003c/p\u003e\n\u003cp\u003eThere was Paul, in South Africa:\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been waiting for you to check back in, Toni.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here. I\u0027m dying to know all about you, Paul.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m thirty-two. I\u0027m a doctor at a hospital in Johannesburg. I - \"\u003c/p\u003e\n\u003cp\u003eToni angrily signed off. A doctor! Terrible memories came flooding through her. She closed her eyes a moment, her heart pounding. She took several deep breaths. No more tonight, she thought, shakily. She went to bed.\u003c/p\u003e\n\u003cp\u003eThe following evening, Toni was back on the Internet. On-line was Sean from Dublin:\u003c/p\u003e\n\u003cp\u003e\"Toni... That\u0027s a pretty name.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Sean.\"\u003c/p\u003e\n\u003cp\u003e\"Have you ever been to Ireland?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d love it. It\u0027s the land of leprechauns. Tell me what you look like, Toni. I\u0027ll bet you\u0027re beautiful.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right. I\u0027m beautiful. I\u0027m exciting and I\u0027m single. What do you do, Sean?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a bartender. I - \"\u003c/p\u003e\n\u003cp\u003eToni ended the chat session.\u003c/p\u003e\n\u003cp\u003eEvery night was different. There was a polo player in Argentina, an automobile salesman in Japan, a department store clerk in Chicago, a television technician in New York. The Internet was a fascinating game, and Toni enjoyed it to the fullest. She could go as far as she wanted and yet know that she was safe because she was anonymous.\u003c/p\u003e\n\u003cp\u003eAnd then one night, in an on-line chat room, she met Jean Claude Parent.\u003c/p\u003e\n\u003cp\u003e\"Bon soir. I am happy to meet you, Toni.\"\u003c/p\u003e\n\u003cp\u003e\"Nice to meet you, Jean Claude. Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"In Quebec City.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never been to Quebec. Would I like it?\" Toni expected to see the word yes on the screen.\u003c/p\u003e\n\u003cp\u003eInstead, Jean Claude typed, \"I do not know. It depends on what kind of person you are.\"\u003c/p\u003e\n\u003cp\u003eToni found his answer intriguing. \"Really? What kind of person would I have to be to enjoy Quebec?\"\u003c/p\u003e\n\u003cp\u003e\"Quebec is like the early North American frontier. It is very French. Quebecois are independent. We do not like to take orders from anyone.\"\u003c/p\u003e\n\u003cp\u003eToni typed in, \"Neither do I.\"\u003c/p\u003e\n\u003cp\u003e\"Then you would enjoy it. It is a beautiful city, sur-\u003c/p\u003e\n\u003cp\u003erounded by mountains and lovely lakes, a paradise for hunting and fishing.\"\u003c/p\u003e\n\u003cp\u003eLooking at the typed words appearing on her screen, Toni could almost feel Jean Claude\u0027s enthusiasm. \"It sounds great. Tell me about yourself.\"\u003c/p\u003e\n\u003cp\u003e\"Moi? There is not much to tell. I am thirty-eight years old, unmarried. I just ended a relationship, and I would like to settle down with the right woman. Et vous? Are you married?\"\u003c/p\u003e\n\u003cp\u003eToni typed back, \"No. I\u0027m looking for someone, too. What do you do?\"\u003c/p\u003e\n\u003cp\u003e\"I own a little jewelry store. I hope you will come and visit it one day.\"\u003c/p\u003e\n\u003cp\u003e\"Is that an invitation?\"\u003c/p\u003e\n\u003cp\u003e\"Mais oui. Yes.\"\u003c/p\u003e\n\u003cp\u003eToni typed in, \"It sounds interesting.\" And she meant it. Maybe I\u0027ll find a way to go there, Toni thought. Maybe he\u0027s the person who can save me.\u003c/p\u003e\n\u003cp\u003eToni communicated with Jean Claude Parent almost every night. He had scanned in a picture of himself, and Toni found herself looking at a very attractive, intelligent-looking man.\u003c/p\u003e\n\u003cp\u003eWhen Jean Claude saw the photograph of Toni that she scanned in, he wrote, \"You are beautiful, ma cherie. I knew you would be. Please come to visit me.\"\u003c/p\u003e\n\u003cp\u003e\"I will.\"\u003c/p\u003e\n\u003cp\u003e\"Soon?\"\u003c/p\u003e\n\u003cp\u003e\"Ta ta.\" Toni signed off.\u003c/p\u003e\n\u003cp\u003eOn the work floor the next morning, Toni heard Shane Miller talking to Ashley Patterson and thought. What the hell does he see in her? She\u0027s a right git. To Toni, Ashley was a frustrated, spinsterish Miss Goody Two-shoes. She doesn\u0027t bloody know how to have any fun, Toni thought. Toni disapproved of everything about her. Ashley was a stick-in-the-mud who liked to stay home at night and read a book or watch the History Channel or CNN. She had no interest in sports. Boring! She had never entered a chat room. Meeting strangers through a computer was something Ashley would never do, the cold fish. She doesn\u0027t know what she\u0027s missing, Toni thought. Without the on-line chat room, I never would have met Jean Claude.\u003c/p\u003e\n\u003cp\u003eToni thought about how much her mother would have hated the Internet. But then her mother had hated everything. She had only two means of communicating: screaming or whining. Toni could never please her. \"Can\u0027t you ever do anything right, you stupid child?\" Well, her mother had yelled at her once too often. Toni thought about the terrible accident in which her mother had died. Toni could still hear her screams for help. The memory of it made Toni smile.\u003c/p\u003e\n\u003cp\u003e\"A penny for a spool of thread,\u003c/p\u003e\n\u003cp\u003epenny for a needle.\u003c/p\u003e\n\u003cp\u003eat\u0027s the way the money goes,\u003c/p\u003e\n\u003cp\u003ep! goes the weasel.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/tell-me-your-dreams/page-2.html","bookId":2368,"creation":"Oct 5, 2019 10:12:53 AM","modification":"Oct 5, 2019 10:12:53 AM"}
