{"id":69144,"no":20,"title":"Page 20","content":"\u003cp\u003eWhen David returned to the courthouse, he visited Ashley in her cell. She was seated on the little cot, staring at the floor.\u003c/p\u003e\n\u003cp\u003e\"Ashley.\"\u003c/p\u003e\n\u003cp\u003eShe looked up, her eyes filled with despair.\u003c/p\u003e\n\u003cp\u003eDavid sat next to her. \"We have to talk.\"\u003c/p\u003e\n\u003cp\u003eShe watched him, silent.\u003c/p\u003e\n\u003cp\u003e\"These terrible things they\u0027re saying about you... none of them are true. But the jurors don\u0027t know that. They don\u0027t know you. We\u0027ve got to let them see what you\u0027re really like.\"\u003c/p\u003e\n\u003cp\u003eAshley looked at him and said dully, \"What am I really like?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a decent human being who has an illness. They\u0027ll sympathize with that.\"\u003c/p\u003e\n\u003cp\u003e\"What do you want me to do?\"\u003c/p\u003e\n\u003cp\u003e\"I want you to get on the witness stand and testify.\"\u003c/p\u003e\n\u003cp\u003eShe was staring at him, horrified. \"I - I can\u0027t. I don\u0027t know anything. I can\u0027t tell them anything.\"\u003c/p\u003e\n\u003cp\u003e\"Let me handle that. All you have to do is answer my questions.\"\u003c/p\u003e\n\u003cp\u003eA guard came up to the cell. \"Court\u0027s coming into session.\"\u003c/p\u003e\n\u003cp\u003eDavid rose and squeezed Ashley\u0027s hand. \"It\u0027s going to work. You\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003e\"All rise. Court is now in session. The Honorable Judge Tessa Williams presiding in the case of The People of the State of California Versus Ashley Patterson.\"\u003c/p\u003e\n\u003cp\u003eJudge Williams took her seat on the bench. David said, \"May I approach the bench?\"\u003c/p\u003e\n\u003cp\u003e\"You may.\"\u003c/p\u003e\n\u003cp\u003eMickey Brennan walked to the bench with David.\u003c/p\u003e\n\u003cp\u003e\"What is it, Mr. Singer?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to call a witness who\u0027s not on the discovery list.\"\u003c/p\u003e\n\u003cp\u003eBrennan said, \"It\u0027s awfully late in the trial to introduce new witnesses.\"\u003c/p\u003e\n\u003cp\u003e\"I would like to call Ashley Patterson as my next witness.\"\u003c/p\u003e\n\u003cp\u003eJudge Williams said, \"I don\u0027t - \"\u003c/p\u003e\n\u003cp\u003eMickey Brennan said quickly, \"The state has no objection, Your Honor.\"\u003c/p\u003e\n\u003cp\u003eJudge Williams looked at the two attorneys. \"Very well. You may call your witness, Mr. Singer.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you. Your Honor.\" He walked over to Ashley and held out his hand. \"Ashley...\"\u003c/p\u003e\n\u003cp\u003eShe sat there in a panic.\u003c/p\u003e\n\u003cp\u003e\"You must.\"\u003c/p\u003e\n\u003cp\u003eShe rose, her heart palpitating, and slowly made her way to the witness stand.\u003c/p\u003e\n\u003cp\u003eMickey Brennan whispered to Eleanor, \"I was praying that he\u0027d call her.\"\u003c/p\u003e\n\u003cp\u003eEleanor nodded. \"It\u0027s over.\"\u003c/p\u003e\n\u003cp\u003eAshley Patterson was being sworn in by the court cleric. \"You do solemnly swear to tell the truth, the whole truth and nothing but the truth, so help you God?\"\u003c/p\u003e\n\u003cp\u003e\"I do.\" Her voice was a whisper. Ashley took her seat in the witness box.\u003c/p\u003e\n\u003cp\u003eDavid walked over to her. He said gently, \"I know this is very difficult for you. You\u0027ve been accused of horrible crimes that you did not commit. All I want is for the jury to know the truth. Do you have any memory of committing any of those crimes?\"\u003c/p\u003e\n\u003cp\u003eAshley shook her head. \"No.\"\u003c/p\u003e\n\u003cp\u003eDavid glanced at the jury, and then went on. \"Did you know Dennis Tibble?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. We worked together at Global Computer Graphics Corporation.\"\u003c/p\u003e\n\u003cp\u003e\"Did you have any reason to kill Dennis Tibble?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" It was difficult for her to speak. \"I - I went to his apartment to give him some advice that he had asked me for, and that was the last time I saw him.\"\u003c/p\u003e\n\u003cp\u003e\"Did you know Richard Melton?\"\u003c/p\u003e\n\u003cp\u003e\"No...\"\u003c/p\u003e\n\u003cp\u003e\"He was an artist. He was murdered in San Francisco. The police found evidence of your DNA and fingerprints there.\"\u003c/p\u003e\n\u003cp\u003eAshley was shaking her head from side to side. \"I - I don\u0027t know what to say. I didn\u0027t know him!\"\u003c/p\u003e\n\u003cp\u003e\"You knew deputy Sam Blake?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. He was helping me. I didn\u0027t kill him!\"\u003c/p\u003e\n\u003cp\u003e\"Are you aware that you have two other personalities, alters, within you, Ashley?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Her voice was strained. \"When did you learn this?\"\u003c/p\u003e\n\u003cp\u003e\"Before the trial. Dr. Salem told me about it. I couldn\u0027t believe it. I - I still can\u0027t believe it. It\u0027s - it\u0027s to awful.\"\u003c/p\u003e\n\u003cp\u003e\"You had no previous knowledge of these alters.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"You had never heard of Toni Prescott or Alette Peters?\"\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003e\"Do you believe now that they exist within you?\"\u003c/p\u003e\n\u003cp\u003e\"Yes...I have to believe it. They must have done all these - these horrible things....\"\u003c/p\u003e\n\u003cp\u003e\"So you have no recollection of ever having met Richard Melton, you had no motive for killing Dennis Tibble or for killing deputy Sam Blake, who was at your apartment to protect you?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\" Her eyes swept over the crowded courtroom, and she felt a sense of panic.\u003c/p\u003e\n\u003cp\u003e\"One last question,\" David said. \"Have you ever been in trouble with the law?\"\u003c/p\u003e\n\u003cp\u003e\"Never.\"\u003c/p\u003e\n\u003cp\u003eDavid put his hand on hers. \"That\u0027s all for now.\" He tamed to Mickey Brennan. \"Your witness.\"\u003c/p\u003e\n\u003cp\u003eBrennan rose, a big smile on his face. \"Well, Miss Patterson, we finally get to talk to all of you. Did you ever, at any time, have sexual intercourse with Dennis Tibble?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Did you ever have sexual intercourse with Richard Melton?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Did you ever, at any time, have sexual intercourse; with deputy Samuel Blake?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s very interesting.\" Brennan glanced at the jury. \"Because traces of a vaginal discharge were found on the bodies of all three men. The DNA tests matched your DNA.\"\u003c/p\u003e\n\u003cp\u003e\"I...don\u0027t know anything about that.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe you\u0027ve been framed. Maybe some fiend got hold of it - \"\u003c/p\u003e\n\u003cp\u003e\"Objection! It\u0027s argumentative.\"\u003c/p\u003e\n\u003cp\u003e\"Overruled.\"\u003c/p\u003e\n\u003cp\u003e\" - and planted it on those three mutilated bodies. Do you have any enemies who would do such a thing to you?\"\u003c/p\u003e\n\u003cp\u003e\"I... don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"The FBI\u0027s fingerprint lab checked the fingerprints the police found at the scenes of the crimes. And I\u0027m sure this will surprise you - \"\u003c/p\u003e\n\u003cp\u003e\"Objection.\"\u003c/p\u003e\n\u003cp\u003e\"Sustained. Be careful, Mr. Brennan.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Your Honor.\"\u003c/p\u003e\n\u003cp\u003eSatisfied, David slowly sat down.\u003c/p\u003e\n\u003cp\u003eAshley was on the verge of hysteria. \"The alters must have - \"\u003c/p\u003e\n\u003cp\u003e\"The fingerprints at the scenes of the three murders were yours, and yours alone.\" Ashley sat there, silent.\u003c/p\u003e\n\u003cp\u003eBrennan walked over to a table, picked up a butcher knife wrapped in cellophane and held it up. \"Do you recognize this?\"\u003c/p\u003e\n\u003cp\u003e\"It - it could be one of... one of my - \"\u003c/p\u003e\n\u003cp\u003e\"One of your knives? It is. It has already been admitted into evidence. The stains on it match the blood of deputy Blake. Your fingerprints are on this murder weapon.\" Ashley was mindlessly shaking her head from side to side.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never seen a clearer case of cold-blooded murder or a more feeble defense. Hiding behind two nonexistent, imaginary characters is the most - \"\u003c/p\u003e\n\u003cp\u003eDavid was on his feet again. \"Objection.\"\u003c/p\u003e\n\u003cp\u003e\"Sustained. I\u0027ve already warned you, Mr. Brennan.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, Your Honor.\"\u003c/p\u003e\n\u003cp\u003eBrennan went on. \"I\u0027m sure that the jury would like to meet the characters you\u0027re talking about. You are Ashley Patterson, correct?\"\u003c/p\u003e\n\u003cp\u003e\"Yes...\"\u003c/p\u003e\n\u003cp\u003e\"Fine. I would like to talk to Toni Prescott.\"\u003c/p\u003e\n\u003cp\u003e\"I...I can\u0027t bring her out.\"\u003c/p\u003e\n\u003cp\u003eBrennan looked at her in surprise. \"You can\u0027t? Really? Well, then, how about Alette Peters?\"\u003c/p\u003e\n\u003cp\u003eAshley shook her head despairingly. \"I...don\u0027t control them.\"\u003c/p\u003e\n\u003cp\u003e\"Miss Patterson, I\u0027m trying to help you,\" Brennan said. \"I want to show the jury your alters who killed and mutilated three innocent men. Bring them out!\"\u003c/p\u003e\n\u003cp\u003e\"I...I can\u0027t.\" She was sobbing.\u003c/p\u003e\n\u003cp\u003e\"You can\u0027t because they don\u0027t exist! You\u0027re hiding behind phantoms. You\u0027re the only one sitting in that box, and you\u0027re the only one who\u0027s guilty. They don\u0027t exist, but you do, and I\u0027ll tell you what else exists - irrefutable, undeniable proof that you murdered three men and cold-bloodedly emasculated them.\" He turned to Judge Williams. \"Your Honor, the state rests.\"\u003c/p\u003e\n\u003cp\u003eDavid turned to look at the jury. They were all staring at Ashley and their faces were filled with repulsion. Judge Williams turned to David. \"Mr. Singer?\" David rose. \"Your Honor, I would like permission to have the defendant hypnotized so that - \"\u003c/p\u003e\n\u003cp\u003eJudge Williams said curtly, \"Mr. Singer, I warned you before that I will not have this trial turned into a sideshow. You can\u0027t hypnotize her in my courtroom. The answer is no.\"\u003c/p\u003e\n\u003cp\u003eDavid said fiercely, \"You have to let me do this. You don\u0027t know how important.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s enough, Mr. Singer.\" Her voice was ice. \"I\u0027m citing you a second time for contempt. Do you want to reexamine the witness or don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eDavid stood there, frustrated. \"Yes, Your Honor.\" He walked over to the witness box. \"Ashley, you know you\u0027re under oath?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She was taking deep breaths, fighting to control herself.\u003c/p\u003e\n\u003cp\u003e\"And everything you\u0027ve said is the truth as you know it?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"You know that there are two alters in your mind and body and soul who you have no control over?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Toni and Alette?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t commit any of those terrible murders?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"One of them did, and you\u0027re not responsible.\" Eleanor looked at Brennan questioningly, but he smiled and shook his head. \"Let him hang himself,\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"Helen - \" David stopped, white-faced at his slip. \"I mean, Ashley...want you to have Toni come out.\"\u003c/p\u003e\n\u003cp\u003eAshley looked at David and shook her head helplessly. \"I - I can\u0027t,\" she whispered.\u003c/p\u003e\n\u003cp\u003eDavid said, \"Yes, you can. Toni is listening to us right now. She\u0027s enjoying herself, and why shouldn\u0027t she? She got away with three murders.\" He raised his voice. \"You\u0027re very clever, Toni. Come on out and take a bow. No one can touch you. They can\u0027t punish you because Ashley is innocent, and they\u0027d have to punish her to get at you.\"\u003c/p\u003e\n\u003cp\u003eEveryone in the courtroom was staring at David. Ashley sat there, frozen.\u003c/p\u003e\n\u003cp\u003eDavid moved closer to her. \"Toni! Toni, can you hear me? I want you to come out. Now!\"\u003c/p\u003e\n\u003cp\u003eHe waited a moment. Nothing happened. He raised his voice. \"Toni! Alette! Come out! Come on out. We all know you\u0027re in there!\"\u003c/p\u003e\n\u003cp\u003eThere was not a sound in the courtroom.\u003c/p\u003e\n\u003cp\u003eDavid lost control. He was yelling, \"Come out Show your faces.... Damn it! Now! Now!\"\u003c/p\u003e\n\u003cp\u003eAshley dissolved in tears.\u003c/p\u003e\n\u003cp\u003eJudge Williams said furiously, \"Approach the bench, Mr. Singer.\"\u003c/p\u003e\n\u003cp\u003eSlowly, David walked over to the bench. \"Are you through badgering your client, Mr. Singer? I\u0027m going to send a report of your behavior to the state bar association. You\u0027re a disgrace to your profession, and I\u0027m going to recommend that you\u0027re disbarred.\"\u003c/p\u003e\n\u003cp\u003eDavid had no answer.\u003c/p\u003e\n\u003cp\u003e\"Do you have any more witnesses to call?\"\u003c/p\u003e\n\u003cp\u003eDavid shook his head defeated. \"No, Your Honor.\"\u003c/p\u003e\n\u003cp\u003eIt was over. He had lost Ashley was going to die.\u003c/p\u003e\n\u003cp\u003e\"The defense rests.\"\u003c/p\u003e\n\u003cp\u003eJoseph Kincaid was seated in the last row of the courtroom, watching, his face grim. He turned to Harvey Udell. \"Get rid of him.\" Kincaid got up and left.\u003c/p\u003e\n\u003cp\u003eUdell stopped David as he was leaving the courtroom.\u003c/p\u003e\n\u003cp\u003e\"David...\"\u003c/p\u003e\n\u003cp\u003e\"Hello, Harvey.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry about the way this turned out.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not - \"\u003c/p\u003e\n\u003cp\u003e\"Mr. Kincaid hates to do this, but, well, he thinks it would be better if you didn\u0027t come back to the firm. Good luck.\"\u003c/p\u003e\n\u003cp\u003eThe moment David stepped outside the courtroom, he was surrounded by television cameras and shouting reporters.\u003c/p\u003e\n\u003cp\u003e\"Do you have a statement, Mr. Singer...?\"\u003c/p\u003e\n\u003cp\u003e\"We hear Judge Williams says you\u0027re going to be disbarred....\"\u003c/p\u003e\n\u003cp\u003e\"Judge Williams says she\u0027s going to hold you for contempt of court. Do you think you - ?\"\u003c/p\u003e\n\u003cp\u003e\"The experts feel you\u0027ve lost this case. Do you plan to appeal...?\"\u003c/p\u003e\n\u003cp\u003e\"Our network legal experts say that your client will get the death penalty....\"\u003c/p\u003e\n\u003cp\u003e\"Have you made any plans for the future...?\" David got into his car without a word and drove away. \u003c/p\u003e","sourceLink":"https://allnovel.net/tell-me-your-dreams/page-20.html","bookId":2368,"creation":"Oct 5, 2019 10:12:53 AM","modification":"Oct 5, 2019 10:12:53 AM"}
