{"id":69153,"no":29,"title":"Page 29","content":"\u003cp\u003eTwo days later, she was called into Dr. Lewison\u0027s office. Dr. Keller was there. Ashley was to be discharged and would return to her home in Cupertino, where regular therapy and evaluation sessions had been arranged with a court approved psychiatrist.\u003c/p\u003e\n\u003cp\u003eDr. Lewison said, \"Well, today\u0027s the day. Are you excited?\"\u003c/p\u003e\n\u003cp\u003eAshley said, \"I\u0027m excited. I\u0027m frightened. I\u0027m - I don\u0027t know. I feel like a bird that\u0027s just been set free. I feel like I\u0027m flying.\" Her face was glowing.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad you\u0027re leaving, but I\u0027m - I\u0027m going to miss you,\" Dr. Keller said.\u003c/p\u003e\n\u003cp\u003eAshley took his hand and said warmly, \"I\u0027m going to miss you, too. I don\u0027t know how I... how I can ever thank you.\" Her eyes filled with tears. \"You\u0027ve given me my life back.\"\u003c/p\u003e\n\u003cp\u003eShe turned to Dr. Lewison. \"When I\u0027m back in California, I\u0027ll get a job at one of the computer plants there. I\u0027ll let you know how it works out and how I get on with the outpatient therapy. I want to make sure that what happened before never happens to me again.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think you have anything to worry about,\" Dr. Lewison assured her.\u003c/p\u003e\n\u003cp\u003eWhen she left. Dr. Lewison turned to Gilbert Keller. \"This makes up for a lot of the ones that didn\u0027t succeed, doesn\u0027t it, Gilbert?\"\u003c/p\u003e\n\u003cp\u003eIt was a sunny June day, and as she walked down Madison Avenue in New York City, her radiant smile made people turn back to look at her. She had never been so happy. She thought of the wonderful life ahead of her, and all that she was going to do. There could have been a terrible ending for her, she thought, but this was the happy ending she had prayed for.\u003c/p\u003e\n\u003cp\u003eShe walked into Pennsylvania Station. It was the busiest train station in America, a charmless maze of airless rooms and passages. The station was crowded with people. And each person has an interesting story to tell, she thought. They\u0027re all going to different places, living their own lives, and now. I\u0027m going to live my own life.\u003c/p\u003e\n\u003cp\u003eShe purchased a ticket from one of the machines. Her train was just pulling in. Serendipity, she thought.\u003c/p\u003e\n\u003cp\u003eShe boarded the train and took a seat. She was filled with excitement at what was about to happen. The train gave a jerk and then started picking up speed. I\u0027m on my way at last. And as the train headed toward the Hamptons, she began to sing softly:\u003c/p\u003e\n\u003cp\u003e\"All around the mulberry bush,\u003c/p\u003e\n\u003cp\u003eThe monkey chased the weasel.\u003c/p\u003e\n\u003cp\u003eThe monkey thought \u0027twas oil in fun,\u003c/p\u003e\n\u003cp\u003ePop! goes the weasel....\" \u003c/p\u003e","sourceLink":"https://allnovel.net/tell-me-your-dreams/page-29.html","bookId":2368,"creation":"Oct 5, 2019 10:12:53 AM","modification":"Oct 5, 2019 10:12:53 AM"}
