{"id":69131,"no":7,"title":"Page 7","content":"\u003cp\u003eASHLEY Patterson followed the investigation of Dennis Tibble\u0027s murder in the newspapers and on television every day. The police appeared to have reached a dead end.\u003c/p\u003e\n\u003cp\u003eIt\u0027s over, Ashley thought. There\u0027s nothing more to worry about.\u003c/p\u003e\n\u003cp\u003eThat evening deputy Sam Blake appeared at her apartment. Ashley looked at him, her mouth suddenly dry.\u003c/p\u003e\n\u003cp\u003e\"I hope I\u0027m not bothering you,\" deputy Blake said. \"I was on my way home, and I just thought I\u0027d drop in for a minute.\"\u003c/p\u003e\n\u003cp\u003eAshley swallowed. \"No. Come in.\"\u003c/p\u003e\n\u003cp\u003eDeputy Blake walked into the apartment. \"Nice place you have here.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll bet Dennis Tibble didn\u0027t like this kind of furniture.\"\u003c/p\u003e\n\u003cp\u003eAshley\u0027s heart began to pound. \"I don\u0027t know. He\u0027s never been in this apartment.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. I thought he might have, you know.\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t know, Deputy. I told you, I never dated him.\"\u003c/p\u003e\n\u003cp\u003e\"Right. May I sit down?\"\u003c/p\u003e\n\u003cp\u003e\"Please.\"\u003c/p\u003e\n\u003cp\u003e\"You see, I\u0027m having a big problem with this case, Miss Patterson. It doesn\u0027t fit into any pattern. Like I said, there\u0027s always a motive. I\u0027ve talked to some of the people over at Global Computer Graphics, and no one seems to have known Tibble very well. He kept pretty much to himself.\"\u003c/p\u003e\n\u003cp\u003eAshley listened, waiting for the blow to fall.\u003c/p\u003e\n\u003cp\u003e\"In fact, from what they tell me, you\u0027re the only one he was really interested in.\"\u003c/p\u003e\n\u003cp\u003eHad he found out something, or was he on a fishing expedition?\u003c/p\u003e\n\u003cp\u003eAshley said carefully, \"He was interested in me, Deputy, but I was not interested in him. I made that quite clear to him.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Well, I think it was nice of you to deliver those papers to his apartment.\"\u003c/p\u003e\n\u003cp\u003eAshley almost said, \"What papers?\" and then suddenly remembered. \"It - it was no trouble. It was on my way.\"\u003c/p\u003e\n\u003cp\u003e\"Right. Someone must have hated Tibble a lot to do what they did.\"\u003c/p\u003e\n\u003cp\u003eAshley sat there tense, saying nothing.\u003c/p\u003e\n\u003cp\u003e\"Do you know what I hate?\" Deputy Blake said. \"Unsolved murders. They always leave me frustrated. Because when a murder goes unsolved, I don\u0027t think it means that the criminals were that smart. I think it means that the police weren\u0027t smart enough. Well, so far, I\u0027ve been lucky. I\u0027ve solved all the crimes that have come my way.\" He got to his feet. \"I don\u0027t intend to give up on this one. If you can think of anything that will helpful, you\u0027ll call me, won\u0027t you, Miss Patterson?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, of course.\"\u003c/p\u003e\n\u003cp\u003eAshley watched him leave, and she thought. Did he come here as a warning? Does he know more than he\u0027s telling me?\u003c/p\u003e\n\u003cp\u003eToni was more absorbed than ever in the Internet. She enjoyed her chats with Jean Claude the most, but that did not stop her from having other chat-room correspondents. At every chance, she sat in front of her computer, and the typed messages flew back and forth, spilling onto the computer screen.\u003c/p\u003e\n\u003cp\u003e\"Toni? Where have you been? I\u0027ve been in the chat room waiting for you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m worth waiting for, luv. Tell me about yourself. What do you do?\"\u003c/p\u003e\n\u003cp\u003e\"I work at a pharmacy. I can be good to you. Do you do drugs?\"\u003c/p\u003e\n\u003cp\u003e\"Sod off.\"\u003c/p\u003e\n\u003cp\u003e\"Is that you, Toni?\"\u003c/p\u003e\n\u003cp\u003e\"The answer to your dreams. Is it Mark?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"You haven\u0027t been on the Internet lately.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been busy. I\u0027d like to meet you, Toni.\"\u003c/p\u003e\n\u003cp\u003e\"Tell me. Mark, what do you do?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a librarian.\"\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t that exciting! All those books and everything....\"\u003c/p\u003e\n\u003cp\u003e\"When can we meet?\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you ask Nostradamus?\"\u003c/p\u003e\n\u003cp\u003e\"Hello, Toni. My name is Wendy.\"\u003c/p\u003e\n\u003cp\u003e\"Hello, Wendy.\"\u003c/p\u003e\n\u003cp\u003e\"You sound like fun.\"\u003c/p\u003e\n\u003cp\u003e\"I enjoy life.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe I can help you enjoy it more.\"\u003c/p\u003e\n\u003cp\u003e\"What did you have in mind?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I hope you\u0027re not one of those narrow-minded people who are afraid to experiment and try exciting new things. I\u0027d like to show you a good time.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks, Wendy. You don\u0027t have the equipment I need\".\u003c/p\u003e\n\u003cp\u003eAnd then, Jean Claude Parent came back on.\u003c/p\u003e\n\u003cp\u003e\"Bonne nuit. Comment ca va? How are you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m great. How about you?\"\u003c/p\u003e\n\u003cp\u003e\"I have missed you. I wish very much to meet you in person.\"\u003c/p\u003e\n\u003cp\u003e\"I want to meet you, too. Thanks for sending me your photograph. You\u0027re a good-looking bloke.\"\u003c/p\u003e\n\u003cp\u003e\"And you are beautiful. I think it is very important for us to get to know each other. Is your company coming to Quebec for the computer convention?\"\u003c/p\u003e\n\u003cp\u003e\"What? Not that I know of. When is it?\"\u003c/p\u003e\n\u003cp\u003e\"In three weeks. Many big companies will be coming, I hope you will be here.\"\u003c/p\u003e\n\u003cp\u003e\"I hope so, too.\"\u003c/p\u003e\n\u003cp\u003e\"Can we meet in the chat room tomorrow at the same time?\"\u003c/p\u003e\n\u003cp\u003e\"Of course. Until tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"`A demain.\"\u003c/p\u003e\n\u003cp\u003eThe following morning, Shane Miller walked up to Ashley. \"Ashley, have you heard about the big computer convention coming up in Quebec City?\"\u003c/p\u003e\n\u003cp\u003eShe nodded. \"Yes. It sounds interesting.\"\u003c/p\u003e\n\u003cp\u003e\"I was just debating whether we should send a contingent up there.\u003c/p\u003e\n\u003cp\u003e\"All the companies are going,\" Ashley said. \"Symantec, Microsoft, Apple. Quebec City is putting on a big show for them. A trip like that could be kind of a Christmas bonus.\"\u003c/p\u003e\n\u003cp\u003eShane Miller smiled at her enthusiasm. \"Let me check it out.\"\u003c/p\u003e\n\u003cp\u003eThe following morning, Shane Miller called Ashley into his office.\u003c/p\u003e\n\u003cp\u003e\"How would you like to spend Christmas in Quebec City?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going? That\u0027s great,\" Ashley said, enthusiastically. In the past, she had spent the Christmas holidays with her father, but this year she had dreaded the prospect.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d better take plenty of warm clothes.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry. I will. I\u0027m really looking forward to this, Shane.\"\u003c/p\u003e\n\u003cp\u003eToni was in the Internet chat room. \"Jean Claude, the Company is sending a group of us to Quebec City!\"\u003c/p\u003e\n\u003cp\u003e\"Formidable! I am so pleased. When will you arrive?\"\u003c/p\u003e\n\u003cp\u003e\"In two weeks. There will be fifteen of us.\"\u003c/p\u003e\n\u003cp\u003e\"Merveilleux! I feel as though something very important is going to happen.\"\u003c/p\u003e\n\u003cp\u003e\"So do I.\" Something very important.\u003c/p\u003e\n\u003cp\u003eAshley anxiously watched the news every night, but, there still no new developments in the Dennis Tibble murder. She began to relax. If the police could not connect her with the case, there was no way they could a connection to her father. Half a dozen times she steeled herself to ask him about it, but each time she backed off. What if he were innocent? Could he ever forgive her for accusing him of being a murderer? And if he is guilty, I don\u0027t want to know, Ashley thought. I couldn\u0027t bear it. And if he has done those terrible things, in his mind, he would have done them to protect me. At least I won\u0027t have to face him this Christmas.\u003c/p\u003e\n\u003cp\u003eAshley telephoned her father in San Francisco. She said, without preamble, \"I\u0027m not going to be able to spend Christmas with you this year, Father. My company is sending me to a convention in Canada.\"\u003c/p\u003e\n\u003cp\u003eThere was a long silence. \"That\u0027s bad timing, Ashley. You and I have always spent Christmas together.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t help - \"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re all I have, you know.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Father, and... you\u0027re all I have.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what\u0027s important.\"\u003c/p\u003e\n\u003cp\u003eImportant enough to kill for?\u003c/p\u003e\n\u003cp\u003e\"Where is this convention?\"\u003c/p\u003e\n\u003cp\u003e\"In Quebec City. It\u0027s - \"\u003c/p\u003e\n\u003cp\u003e\"Ah. Lovely place. I haven\u0027t been there in years. I\u0027ll tell you what I\u0027ll do. I haven\u0027t anything scheduled at the hospital around that time. I\u0027ll fly up, and we\u0027ll have a Christmas dinner together.\"\u003c/p\u003e\n\u003cp\u003eAshley said quickly, \"I don\u0027t think it\u0027s - \"\u003c/p\u003e\n\u003cp\u003e\"You just make a reservation for me at whatever hotel you\u0027re staying at. We don\u0027t want to break tradition, do we?\"\u003c/p\u003e\n\u003cp\u003eShe hesitated and said slowly, \"No, Father.\"\u003c/p\u003e\n\u003cp\u003eHow can I face him?\u003c/p\u003e\n\u003cp\u003eAlette was excited. She said to Toni, \"I\u0027ve never been to Quebec City. Do they have museums there?\"\u003c/p\u003e\n\u003cp\u003e\"Of course they have museums there,\" Toni told her. \"They have everything. A lot of winter sports. Skiing, skating...\"\u003c/p\u003e\n\u003cp\u003eAlette shuddered. \"I hate cold weather. No sports for me. Even with gloves, my fingers get numb. I will stick to the museums....\"\u003c/p\u003e\n\u003cp\u003eOn the twenty-first of December, the group from Global Computer Graphics arrived at the Jean-Lesage International Airport in Sainte-Foy and were driven to the storied Chateau Frontenac in Quebec City. It was below zero outside, and the streets were blanketed with snow.\u003c/p\u003e\n\u003cp\u003eJean Claude had given Toni his home telephone number. She called as soon as she checked into her room. \"I hope I\u0027m not calling too late.\"\u003c/p\u003e\n\u003cp\u003e\"Mais non! I cannot believe you are here. When may I see you?\"\u003c/p\u003e\n\u003cp\u003e\"Well, we\u0027re all going to the convention center tomorrow morning, but I could slip away and have lunch with you.\"\u003c/p\u003e\n\u003cp\u003e\"Bon! There is a restaurant, Le Paris-Brest, on the Grande Allee Est. Can you meet me there at one o\u0027clock?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be there.\"\u003c/p\u003e\n\u003cp\u003eThe Centre des Congres de Quebec on Rene Levesque Boulevard is a four-story, glass-and-steel, state-of-the-art building that can accommodate thousands of conventioneers. At nine o\u0027clock in the morning, the vast halls were crowded with computer experts from all over the world, exchanging information on up-to-the-minute developments. They filled multimedia rooms, exhibit halls and video-conferencing centers. There were half a dozen and seminars going on simultaneously. Toni was bored. All talk and no action, she thought. At 12:45, she slipped out of the convention hall and took a taxi to the restaurant.\u003c/p\u003e\n\u003cp\u003eJean Claude was waiting for her. He took her hand and said warmly, \"Toni, I am so pleased you could come.\"\u003c/p\u003e\n\u003cp\u003e\"So am I.\"\u003c/p\u003e\n\u003cp\u003e\"I will try to make certain that your time here is very agreeable,\" Jean Claude told her. \"This is a beautiful city to explore.\"\u003c/p\u003e\n\u003cp\u003eToni looked at him and smiled. \"I know I\u0027m going to enjoy it.\"\u003c/p\u003e\n\u003cp\u003e\"I would like to spend as much time with you as I can.\"\u003c/p\u003e\n\u003cp\u003e\"Can you take the time off? What about the jewelry store?\"\u003c/p\u003e\n\u003cp\u003eJean Claude smiled. \"It will have to manage without me.\"\u003c/p\u003e\n\u003cp\u003eThe maitre brought menus.\u003c/p\u003e\n\u003cp\u003eJean Claude said to Toni, \"Would you like to try some of our French-Canadian dishes?\"\u003c/p\u003e\n\u003cp\u003e\"Fine.\"\u003c/p\u003e\n\u003cp\u003e\"Then please let me order for you.\" He said to the maitre d\u0027, \"Nous voudrions ie Brome Lake Duckling.\" He explained to Toni, \"It is a local dish, duckling cooked in calvados and stuffed with apples.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds delicious.\"\u003c/p\u003e\n\u003cp\u003eAnd it was.\u003c/p\u003e\n\u003cp\u003eDuring luncheon, they filled each other in on their pasts.\u003c/p\u003e\n\u003cp\u003e\"So. You\u0027ve never been married?\" Toni asked.\u003c/p\u003e\n\u003cp\u003e\"No. And you?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"You have not found the right man.\"\u003c/p\u003e\n\u003cp\u003eOh, God, wouldn\u0027t it be wonderful if it were that simple. \"No.\"\u003c/p\u003e\n\u003cp\u003eThey talked of Quebec City and what there was to do there.\u003c/p\u003e\n\u003cp\u003e\"Do you ski?\"\u003c/p\u003e\n\u003cp\u003eToni nodded. \"I love it.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, bon, moi aussi. And there is snowmobiling, ice-skating, wonderful shopping...\"\u003c/p\u003e\n\u003cp\u003eThere was something almost boyish about his enthusiasm. Toni had never felt more comfortable with anyone.\u003c/p\u003e\n\u003cp\u003eShane Miller arranged it so his group attended the convention mornings and had their afternoons free.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what to do here,\" Alette complained to Toni. \"It\u0027s freezing. What are you going to do?\"\u003c/p\u003e\n\u003cp\u003e\"Everything.\" Toni grinned.\u003c/p\u003e\n\u003cp\u003e\"A piu tardi.\"\u003c/p\u003e\n\u003cp\u003eToni and Jean Claude had lunch together every day, and every afternoon, Jean Claude took Toni on a tour. She had never seen any place like Quebec City. It was like finding a turn-of-the-century picturesque French village in North America. The ancient streets had colorful names like Break Neck Stairs and Below the Fort and Sailor\u0027s Leap. It was a Currier \u0026amp; Ives city, framed in snow.\u003c/p\u003e\n\u003cp\u003eThey visited La Citadelle, with its walls protecting Old Quebec, and they watched the traditional changing of the guard inside the walls of the fort. They explored the shopping streets. Saint Jean, Cartier, C6te de la Fabrique, and wandered through the Quartier Petit Champlain.\u003c/p\u003e\n\u003cp\u003e\"This is the oldest commercial district in North America,\" Jean Claude told her.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s super.\"\u003c/p\u003e\n\u003cp\u003eEverywhere they went, there were sparkling Christmas trees, nativity scenes and music for the enjoyment of the strollers.\u003c/p\u003e\n\u003cp\u003eJean Claude took Toni snowmobiling in the countryside. As they raced down a narrow slope, he called out, \"Are you having a good time?\"\u003c/p\u003e\n\u003cp\u003eToni sensed that it was not an idle question. She nodded and said softly, \"I\u0027m having a wonderful time.\"\u003c/p\u003e\n\u003cp\u003eAlette spent her time at museums. She visited the Basilica of Notre-Dame and the Good Shepherd Chapel and the Augustine Museum, but she had no interest in anything else that Quebec City offered. There were dozens of gourmet restaurants, but when she was not dining at the hotel, she ate at Le Commensal, a vegetarian cafeteria.\u003c/p\u003e\n\u003cp\u003eFrom time to time, Alette thought about her artist friend, Richard Melton, in San Francisco, and wondered what he was doing and if he would remember her.\u003c/p\u003e\n\u003cp\u003eAshley was dreading Christmas. She was tempted to call her father and tell him not to come. But what excuse can I give? You\u0027re a murderer. I don\u0027t want to see you?\u003c/p\u003e\n\u003cp\u003eAnd each day Christmas was coming closer.\u003c/p\u003e\n\u003cp\u003e\"I would like to show you my jewelry store,\" Jean Claude told Toni. \"Would you care to see it?\"\u003c/p\u003e\n\u003cp\u003eToni nodded. \"Love to.\"\u003c/p\u003e\n\u003cp\u003eParent Jewelers was located in the heart of Quebec City, on rue Notre-Dame. When she walked in the door, Toni was stunned. On the Internet, Jean Claude had said, \"I have a little jewelry store.\" It was a very large store, tastefully done. Half a dozen clerks were busy with customers.\u003c/p\u003e\n\u003cp\u003eToni looked around and said, \"It\u0027s - it\u0027s smashing.\"\u003c/p\u003e\n\u003cp\u003eHe smiled. \"Merci. I would like to give you a cadeau -\u0026nbsp;\u0026nbsp;a gift, for Christmas.\"\u003c/p\u003e\n\u003cp\u003e\"No. That isn\u0027t necessary. I - \"\u003c/p\u003e\n\u003cp\u003e\"Please do not deprive me of the pleasure.\" Jean Claude led Toni to a showcase filled with rings. \"Tell me what you like.\"\u003c/p\u003e\n\u003cp\u003eToni shook her head. \"Those are much too expensive. I couldn\u0027t - \"\u003c/p\u003e\n\u003cp\u003e\"Please.\"\u003c/p\u003e\n\u003cp\u003eToni studied him a moment, then nodded. \"All right.\" She examined the showcase again. In the center was a large emerald ring set with diamonds.\u003c/p\u003e\n\u003cp\u003eJean Claude saw her looking at it \"Do you like the emerald ring?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s lovely, but it\u0027s much too - \"\u003c/p\u003e\n\u003cp\u003e\"It is yours.\" Jean Claude took out a small key, unlocked the case and pulled out the ring.\u003c/p\u003e\n\u003cp\u003e\"No, Jean Claude - \"\u003c/p\u003e\n\u003cp\u003e\"Pour moi.\" He slipped it on Toni\u0027s finger. It was a perfect fit.\u003c/p\u003e\n\u003cp\u003e\"Voila!\u0026nbsp;\u0026nbsp;It is a sign.\"\u003c/p\u003e\n\u003cp\u003eToni squeezed his hand. \"I - I don\u0027t know what to say.\"\u003c/p\u003e\n\u003cp\u003e\"I cannot tell you how much pleasure this gives me. There is a wonderful restaurant here called Pavilion. Would you like to have dinner there tonight?\"\u003c/p\u003e\n\u003cp\u003e\"Anywhere you say.\"\u003c/p\u003e\n\u003cp\u003e\"I will call for you at eight o\u0027clock.\"\u003c/p\u003e\n\u003cp\u003eAt six o\u0027clock that night, Ashley\u0027s father telephoned. \"I\u0027m afraid I\u0027m going to have to disappoint you, Ashley. I won\u0027t be able to be there for Christmas. An important patient of mine in South America has had a stroke. I\u0027m flying to Argentina tonight.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m - I\u0027m sorry, Father,\" Ashley said. She tried to sound convincing.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll make up for it, won\u0027t we, darling?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Father. Have a good flight.\"\u003c/p\u003e\n\u003cp\u003eToni was looking forward to dinner with Jean Claude. It was going to be a lovely evening. As she dressed, she sang softly to herself.\u003c/p\u003e\n\u003cp\u003e\"Up and down the city road,\u003c/p\u003e\n\u003cp\u003eIn and out of the Eagle,\u003c/p\u003e\n\u003cp\u003eThat\u0027s the way the money goes,\u003c/p\u003e\n\u003cp\u003ePop! goes the weasel. \"\u003c/p\u003e\n\u003cp\u003eI think Jean Claude is in love with me, Mother.\u003c/p\u003e\n\u003cp\u003ePavilion is located in the cavernous Gare du Palais, Quebec City\u0027s old railroad station. It is a large restaurant with a long bar at the entrance and rows of tables spreading toward the back. At eleven o\u0027clock each night, a dozen tables are moved to the side to create a dance floor, and a disc jockey takes over with a variety of tapes ranging from reggae to jazz to blues.\u003c/p\u003e\n\u003cp\u003eToni and Jean Claude arrived at nine, and they were warmly greeted at the door by the owner.\u003c/p\u003e\n\u003cp\u003e\"Monsieur Parent. How nice to see you.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Andre. This is Miss Toni Prescott. Mr. Nicholas.\"\u003c/p\u003e\n\u003cp\u003e\"A pleasure, Miss Prescott. Your table is ready.\"\u003c/p\u003e\n\u003cp\u003e\"The food is excellent here,\" Jean Claude assured Toni, when they were seated. \"Let us start with champagne.\"\u003c/p\u003e\n\u003cp\u003eThey ordered paillard de veau and torpille and salad and a bottle of Valpolicella.\u003c/p\u003e\n\u003cp\u003eToni kept studying the emerald ring Jean Claude had given her. \"It\u0027s so beautiful!\" she exclaimed.\u003c/p\u003e\n\u003cp\u003eJean Claude leaned across the table. \"Tu aussi. I cannot tell you how happy I am that we have finally met.\"\u003c/p\u003e\n\u003cp\u003e\"I am, too,\" Toni said softly.\u003c/p\u003e\n\u003cp\u003eThe music began. Jean Claude looked at Toni. \"Would you like to dance?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d love to.\"\u003c/p\u003e\n\u003cp\u003eDancing was one of Toni\u0027s passions, and when she got out on the dance floor, she forgot everything else. She was a little girl dancing with her father, and her mother said, \"The child is clumsy.\"\u003c/p\u003e\n\u003cp\u003eJean Claude was holding her close. \"You\u0027re a wonderful dancer.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" Do you hear that, Mother?\u003c/p\u003e\n\u003cp\u003eToni thought, I wish this could go on forever.\u003c/p\u003e\n\u003cp\u003eOn the way back to the hotel, Jean Claude said, \"Ch`erie, would you like to stop at my house and have a nightcap?\"\u003c/p\u003e\n\u003cp\u003eToni hesitated. \"Not tonight, Jean Claude.\"\u003c/p\u003e\n\u003cp\u003e\"Tomorrow, peut-etre?\"\u003c/p\u003e\n\u003cp\u003eShe squeezed his hand. \"Tomorrow.\"\u003c/p\u003e\n\u003cp\u003eAt 3:00 A.M\u0026amp;#8222; Police Officer Rene Picard was in a squad car cruising down Grande Allee in the Quartier Montcalm when he noticed that the front door of a two-story redbrick house was wide open. He pulled over to the curb and stepped out to investigate. He walked to the front door and called, \"Bon soir. Y a-t-il, quelqu\u0027un?\"\u003c/p\u003e\n\u003cp\u003eThere was no answer. He stepped into the foyer and moved toward the large drawing room. \"C\u0027est la police. Y a-t-il, quelqu\u0027un?\"\u003c/p\u003e\n\u003cp\u003eThere was no response. The house was unnaturally quiet. Unbuttoning his gun holster, Officer Picard began to go through the downstairs rooms, calling out as he moved from room to room. The only response was an eerie silence. He returned to the foyer. There was a graceful staircase leading to the floor above. \"Allo!\" Nothing.\u003c/p\u003e\n\u003cp\u003eOfficer Picard started up the stairs. When he got to the top of the stairs, his gun was in his hand. He called out again, then started down the long hallway. Ahead, a bedroom door was ajar. He walked over to it, opened it wide and turned pale. \"Mon Dieu!\"\u003c/p\u003e\n\u003cp\u003eAt five o\u0027clock that morning, in the gray stone and yellow brick building on Story Boulevard, where Centrale de Police is located. Inspector Paul Cayer was asking, \"What do we have?\" Officer Guy Fontaine replied, \"The victim\u0027s name is\u003c/p\u003e\n\u003cp\u003eJean Claude Parent. He was stabbed at least a dozen times, and his body was castrated. The coroner says that the murder took place in the last three or four hours. We found a restaurant receipt from Pavilion in Parent\u0027s jacket pocket. He had dinner there earlier in the evening. - We got the owner of the restaurant out of bed.\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Monsieur Parent was at Pavilion with a woman named Toni Prescott, a brunette, very attractive, with an English accent. The manager of Monsieur Parent\u0027s jewelry store said that earlier that day. Monsieur Parent had brought a woman answering that description into the store and introduced her as Toni Prescott. He gave her an expensive emerald ring. We also believe that Monsieur Parent had sex with someone before he died, and that the murder weapon was a steel-blade letter opener. There were fingerprints on it. We sent them on to our lab and to the FBI. We are waiting to hear.\"\u003c/p\u003e\n\u003cp\u003e\"Have you picked up Toni Prescott?\"\u003c/p\u003e\n\u003cp\u003e\"Non.\"\u003c/p\u003e\n\u003cp\u003e\"And why not?\"\u003c/p\u003e\n\u003cp\u003e\"We cannot find her. We have checked all the local hotels. We have checked our files and the files of the FBI. She has no birth certificate, no social security number, no driver\u0027s license.\"\u003c/p\u003e\n\u003cp\u003e\"Impossible! Could she have gotten out of the city?\"\u003c/p\u003e\n\u003cp\u003eOfficer Fontaine shook his head. \"I don\u0027t think so, Inspector. The airport closed at midnight. The last train out of Quebec City left at five-thirty-five last night. The first train this morning will be at six-thirty-nine. We have sent a description of her to the bus station, the two taxi companies and the limousine company.\"\u003c/p\u003e\n\u003cp\u003e\"For God\u0027s sake, we have her name, her description and her fingerprints. She can\u0027t just have disappeared.\"\u003c/p\u003e\n\u003cp\u003eOne hour later, a report came in from the FBI. They were unable to identify the fingerprints. There was no record of Toni Prescott. \u003c/p\u003e","sourceLink":"https://allnovel.net/tell-me-your-dreams/page-7.html","bookId":2368,"creation":"Oct 5, 2019 10:12:53 AM","modification":"Oct 5, 2019 10:12:53 AM"}
