{"id":38133,"no":48,"title":"CHAPTER XLVIII.","content":"\u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; \u0026nbsp; His restless eye \n\u003cdiv\u003e\n Glanced forward frequently, as if some ill\n\u003c/div\u003e \n\u003cdiv\u003e\n He dared not meet were there.—Willis.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n After some days\u0027 delay, the brig put to sea, Morton on board. The cliffs behind Gibraltar came in sight at last, and a fresh levanter blew her out like an arrow upon the Atlantic. They were becalmed off the Azores. The sea was like glass; the turtles came up to sleep at the top; the tar melted out of the seams; and as the vessel moved on the long, lazy swells, the masts kept up their weary creaking from morning till night, and from night till morning. Morton walked the deck in a fever of impatience.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At length an east wind sprang up, and with studding sails spread like wings, the brig ran before it, reeling like a drunken sea-gull.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n On the forty-first day, the Neversink heights rose on the horizon. Vessels innumerable passed—steamers, merchantmen, war ships. The highlands of Staten Island, with its villages and villas, lay close on their left, and the Bay of New York opened before them, sparkling in the morning sun, and alive with moving sails. On the right lay a forest of masts; in front, the Castle lifted its ugly familiar front; and farther on, the spire of Trinity towered over the wilderness of brick.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Morton called a boat alongside, embarked his luggage, and went on shore. And, in spite of that depression which follows long and deep excitement, in spite of the anxieties that engrossed him, he felt a thrill of delight as his foot pressed American soil.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This pleasure, however, was short. The thought of Edith Leslie had been so long the solace of his confinement, that it seemed to have grown into a part of himself; at all events, now that his doubts were on the verge of decision, for good or evil, it drove every other thought from his mind. Reaching his hotel, he found that he could not set out for Boston till the afternoon; and to get rid of the interval, he turned over the Boston newspapers in the reading room, searching for the mention of any familiar names. Here he was more successful than he cared to be; for he presently discovered the name of Horace Vinal, figuring in the list of directors of a joint stock company.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The hound!\" muttered Morton; \"so he is alive yet!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And leaving the hotel, he walked up the crowded sidewalk of Broadway, in a mood any thing but tranquil.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2850/78664.html","bookId":1216,"creation":"Aug 5, 2019 10:18:34 AM","modification":"Aug 5, 2019 10:18:34 AM"}
