{"id":93297,"no":12,"title":"Page 12","content":"\u003cp\u003eRamsey came awake with a start, all his senses suddenly alert. And then he heard it again, a woman\u0027s soft cry of pain.\u003c/p\u003e\n\u003cp\u003eThrowing back the covers, he slid out of bed and went to the door.\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s there?\" He pressed his ear to the wood. \"Who is it?\"\u003c/p\u003e\n\u003cp\u003e\"Help me. Please help me.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t, I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"Please! I\u0027m so afraid.\"\u003c/p\u003e\n\u003cp\u003eHeart pounding, Edward went to the dresser. Picking up a sharpened stake, he slid it in the waistband of his pajamas; then, one hand clutching his cross, he opened the door.\u003c/p\u003e\n\u003cp\u003eA young woman crouched in the hallway, her face half-hidden beneath a fall of tangled black hair.\u003c/p\u003e\n\u003cp\u003e\"Please,\" she said with a gasp, her voice heavily accented. \"Please help me.\" She extended a slender hand toward him, a hand covered with blood.\u003c/p\u003e\n\u003cp\u003eCautiously, Edward peered up and down the hallway. Seeing no one, he reached for the girl and pulled her into his room, then closed and locked the door.\u003c/p\u003e\n\u003cp\u003eThe girl huddled on the floor, sobbing, her face hidden by her hair.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happened to you?\" Edward asked. \"Do you need a doctor?\"\u003c/p\u003e\n\u003cp\u003eShe did not answer, only continued to sob as though her heart would break.\u003c/p\u003e\n\u003cp\u003eKneeling beside her, Edward brushed the hair from her face, gasped in horror as he saw the two telltale wounds in her neck.\u003c/p\u003e\n\u003cp\u003eScrambling to his feet, he backed away from her, his hand clutching the cross so tightly it cut into his skin. \"Who are you?\"\u003c/p\u003e\n\u003cp\u003eShe looked up at him through blue-green eyes that had no doubt once been beautiful, but were now empty of all humanity. And then, moving slowly, she rose to her feet and walked toward him, her steps stiff, like a robot\u0027s.\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003eHe reached for the stake in his waistband. In a blur, she lunged toward him. Grabbing the stake from his hand with a strength that belied her slender build, she broke it in half and tossed the pieces away.\u003c/p\u003e\n\u003cp\u003eTerrified now, Edward struck out at her, his fist clipping her chin. With a feral growl, she picked him up and threw him across the room.\u003c/p\u003e\n\u003cp\u003eRamsey cried out as his head struck a corner of the dresser. Ignoring the pain, he grabbed a chair and smashed it over the woman\u0027s head, once, twice, three times, driving her backward until she dropped to her knees, a horrible, inhuman sound emerging from her throat as blood dripped down her forehead into her eyes.\u003c/p\u003e\n\u003cp\u003eKnowing she would soon recover, he turned and threw the chair through the window. Grabbing his jacket and keys, he bolted over the sill into the gray dawn of early morning, grateful that he had insisted on a room at ground level.\u003c/p\u003e\n\u003cp\u003eHe raced to his car, not daring to look behind him.\u003c/p\u003e\n\u003cp\u003e\"Edward, what happened?\" Marisa stood back so he could enter her apartment, then closed and locked the door behind him.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll tell you in a moment.\" Breathing heavily, he staggered into the front room and collapsed on the sofa.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re bleeding!\" Marisa exclaimed.\u003c/p\u003e\n\u003cp\u003e\"No,\" he said with a gasp. \"I\u0027m all right. It\u0027s not... not my blood.\"\u003c/p\u003e\n\u003cp\u003e\"Then whose?\"\u003c/p\u003e\n\u003cp\u003eHe held up a trembling hand to stay her questions. \"Wait... just... wait.\"\u003c/p\u003e\n\u003cp\u003eWith a nod, Marisa went into the kitchen and turned on the coffeemaker. A glance at the clock showed it was barely six a.m. She drummed her fingertips on the countertop, wondering what had happened to Ramsey. He looked as if he\u0027d seen a ghost. Or a vampire... but it was morning. Surely Alexi was asleep in his coffin, wherever that might be.\u003c/p\u003e\n\u003cp\u003eThe thought made her shudder. Thinking of Alexi brought Grigori to mind. He had told her he didn\u0027t sleep in a coffin, but she couldn\u0027t help picturing him laid out in a silk-lined casket, his arms folded over his chest, dead but not dead.\u003c/p\u003e\n\u003cp\u003eShe closed her eyes against the nausea that roiled in her stomach. She had let Grigori kiss her, had kissed him back, had wondered what it would be like to make love to him. How had she even considered such a thing? How had she forgotten, even for a moment, what he was?\u003c/p\u003e\n\u003cp\u003ePouring two cups of strong black coffee, she went out into the living room.\u003c/p\u003e\n\u003cp\u003eRamsey smiled faintly as he took the cup she offered him. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003eShe sat down at the opposite end of the sofa, cradling the mug between her hands. It was comforting somehow. \"Feeling better?\"\u003c/p\u003e\n\u003cp\u003eHe nodded, then, using as few words as possible, he told her what had happened.\u003c/p\u003e\n\u003cp\u003e\"But how could she be out in the daytime if she was a vampire?\"\u003c/p\u003e\n\u003cp\u003eEdward shook his head. \"She\u0027s not a vampire. She\u0027s a revenant. I suspect Alexi sent her.\"\u003c/p\u003e\n\u003cp\u003e\"To kill you?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I don\u0027t think so. I think she was supposed to take me to him.\" A sickly smile flickered across his pale face. \"I have a feeling I was supposed to be dinner.\"\u003c/p\u003e\n\u003cp\u003eMarisa stared at Ramsey. It was too awful even to think about, yet she couldn\u0027t stay the awful images his words conveyed.\u003c/p\u003e\n\u003cp\u003e\"A revenant.\" Marisa spoke the words aloud without realizing she had done so.\u003c/p\u003e\n\u003cp\u003e\"Yes. Fearful creatures. I\u0027ve only seen a few, but they are even more frightening than their masters.\"\u003c/p\u003e\n\u003cp\u003e\"Grigori told me Alexi had turned Antoinette into a revenant. You don\u0027t think...?\" She stared at Edward in horror.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\" He sipped at the coffee. \"It\u0027s possible. But I just don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Did you... is she...?\"\u003c/p\u003e\n\u003cp\u003eHe looked up at her, his face ashen, his eyes troubled. \"Dead?\" Slowly, he shook his head. \"No. There are only two ways to kill a revenant. Remove its head and heart, or kill its master.\"\u003c/p\u003e\n\u003cp\u003e\"I feel like I\u0027m living in the middle of a nightmare!\" Marisa exclaimed. \"None of this can be true. It\u0027s impossible.\"\u003c/p\u003e\n\u003cp\u003e\"I wish it were.\"\u003c/p\u003e\n\u003cp\u003e\"What are you going to do now?\"\u003c/p\u003e\n\u003cp\u003e\"I shouldn\u0027t have run. I should have tried to restrain her, make her tell me where Alexi takes his rest.\"\u003c/p\u003e\n\u003cp\u003e\"Are you mad? From what you told me, she sounds stronger than the two of us put together.\"\u003c/p\u003e\n\u003cp\u003e\"I might have been able to subdue her long enough to tie her up.\" He lifted one shoulder and let it fall. \"I panicked. There\u0027s no excuse for it.\"\u003c/p\u003e\n\u003cp\u003e\"I can think of several,\" Marisa muttered.\u003c/p\u003e\n\u003cp\u003e\"Grigori will see it as a weakness on my part.\"\u003c/p\u003e\n\u003cp\u003e\"Well, we mortals are allowed to be weak now and then.\"\u003c/p\u003e\n\u003cp\u003eRamsey smiled faintly. \"Would you mind if I stayed here today?\"\u003c/p\u003e\n\u003cp\u003e\"No, of course not.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think you should go to work.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t think she\u0027ll come after me, do you?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. It seems unlikely that Alexi would send her into the city in broad daylight, but... I\u0027d feel better if you stayed home.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re really busy at the office,\" Marisa remarked, \"but I\u0027ve got some sick time coming. I guess it wouldn\u0027t hurt to miss one day.\" She glanced at the clock. \"No one will be there yet. Why don\u0027t you get some rest?\"\u003c/p\u003e\n\u003cp\u003e\"Would you mind if I showered first?\"\u003c/p\u003e\n\u003cp\u003e\"Of course not. The bathroom is down the hall, first door to your left.\"\u003c/p\u003e\n\u003cp\u003eWith a nod, he carried his coffee cup into the kitchen. She heard him place it in the sink. A few minutes later she heard the shower go on.\u003c/p\u003e\n\u003cp\u003ePutting her cup on the coffee table, she sat back and closed her eyes. She never should have agreed to stay home. She would have been better off at work. At least there, she\u0027d have something else to think about.\u003c/p\u003e\n\u003cp\u003eRamsey returned fifteen minutes later. \"Thanks.\"\u003c/p\u003e\n\u003cp\u003e\"You look a lot better.\"\u003c/p\u003e\n\u003cp\u003e\"I feel a lot better.\" He regarded her for a moment, his expression thoughtful. \"Are you game to go vampire hunting?\"\u003c/p\u003e\n\u003cp\u003e\"Me? When?\"\u003c/p\u003e\n\u003cp\u003e\"Now. We should be safe enough if we stick together.\"\u003c/p\u003e\n\u003cp\u003e\"Are you going like that?\"\u003c/p\u003e\n\u003cp\u003eRamsey glanced down at his T-shirt and pajama bottoms and grinned. \"No, I have a change of clothes in my car.\" He winked at her. \"Pays to be prepared.\"\u003c/p\u003e\n\u003cp\u003e\"Can I have breakfast first?\"\u003c/p\u003e\n\u003cp\u003eRamsey laughed softly. \"Of course. I\u0027ll even fix it for you while you get dressed. What would you like?\"\u003c/p\u003e\n\u003cp\u003e\"French toast.\"\u003c/p\u003e\n\u003cp\u003eGiving her a thumbs-up sign, he went into the kitchen. She stood there for a moment; then, with a sigh, she went into the bathroom and shut the door.\u003c/p\u003e\n\u003cp\u003e\"So, where are we going to look first?\" Marisa asked. It was a little after nine. She had showered and dressed while Edward fixed breakfast; then, while she cleaned up the kitchen, Edward had changed his clothes. She\u0027d made a quick call to work to tell them she wouldn\u0027t be in.\u003c/p\u003e\n\u003cp\u003eNow she was sitting in the passenger seat of Ramsey\u0027s car, her heart racing as she anticipated her first vampire hunt.\u003c/p\u003e\n\u003cp\u003e\"I think we\u0027ll start at my room.\" Edward shifted the car into gear and pulled onto the street. \"I need to pick up the rest of my things anyway. Perhaps she left a trail of some kind.\"\u003c/p\u003e\n\u003cp\u003eMarisa nodded. That made sense.\u003c/p\u003e\n\u003cp\u003eEdward had been staying at a small hotel located uptown. He paid his bill, made up some excuse about the broken window, then packed his few belongings into a worn brown suitcase.\u003c/p\u003e\n\u003cp\u003eMarisa stood in the doorway, her gaze sweeping the room. Except for the broken window, there was no sign of a struggle.\u003c/p\u003e\n\u003cp\u003e\"She must have cleaned the place up,\" Edward remarked. \"See here? You can see where she tried to scrub the blood from the carpet. It\u0027s still damp.\" He swore under his breath. \"Looks like she got away without leaving a trace.\"\u003c/p\u003e\n\u003cp\u003e\"Now what?\"\u003c/p\u003e\n\u003cp\u003eEdward rubbed a hand over his jaw. \"I\u0027ve covered practically every mile of Griffith Park and the surrounding area, since most of the murders took place in that part of town. I\u0027ve also checked most of the nearby beaches. I\u0027ve never searched around here, but I think he must be nearby.\"\u003c/p\u003e\n\u003cp\u003e\"What makes you think that?\"\u003c/p\u003e\n\u003cp\u003e\"The revenant. I doubt if she\u0027d be able to drive a car. She couldn\u0027t take a bus either.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe a taxi.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe.\" He shuddered as he recalled looking into those soulless eyes. No cabdriver in his right mind would have picked her up once he caught a glimpse of those lifeless eyes. \"I\u0027m thinking Alexi\u0027s resting place must be within walking distance of my hotel.\"\u003c/p\u003e\n\u003cp\u003e\"So where do we look first?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not sure. Maybe I\u0027ve been operating under the wrong assumption. Maybe he doesn\u0027t hide away anymore. Maybe he\u0027s rented a house. Come on.\"\u003c/p\u003e\n\u003cp\u003eReturning to the car, Ramsey threw his suitcase in the trunk and then headed for the residential section of the city.\u003c/p\u003e\n\u003cp\u003e\"What are we looking for?\" Marisa asked.\u003c/p\u003e\n\u003cp\u003e\"A house that doesn\u0027t look lived in. Perhaps one that has bars on the windows. Certainly one that has all the curtains drawn. Probably a fenced yard. With a large dog.\"\u003c/p\u003e\n\u003cp\u003eThey spent the next four hours driving slowly up and down every street. Ramsey spotted two houses that he thought looked suspicious. He wrote down the addresses, as well as the license numbers of the cars parked in the driveways.\u003c/p\u003e\n\u003cp\u003eThey went to McDonald\u0027s for cheeseburgers and fries. Marisa ordered a chocolate shake; Edward ordered coffee.\u003c/p\u003e\n\u003cp\u003eThey found a table near the window in the back. \"What will you do after you... you\u0027ve dispatched Alexi?\" Marisa asked as she unwrapped her cheeseburger.\u003c/p\u003e\n\u003cp\u003e\"Take a long vacation, I think.\"\u003c/p\u003e\n\u003cp\u003eMarisa put ketchup on her fries, took a sip of her shake. \"Where do you live?\"\u003c/p\u003e\n\u003cp\u003e\"Nowhere.\"\u003c/p\u003e\n\u003cp\u003e\"Nowhere?\"\u003c/p\u003e\n\u003cp\u003e\"I have an apartment in Chicago, but I\u0027ve never really lived there. It\u0027s just a place to pick up my mail.\"\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t you ever wanted to settle down?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve never had time to think about it.\"\u003c/p\u003e\n\u003cp\u003eThey finished the meal in silence. Edward got a cup of coffee to go, and they left the restaurant.\u003c/p\u003e\n\u003cp\u003eThey drove up into the hills. This was horse property, and the houses were more expensive and farther apart. Often, it was necessary to drive up a long winding road to get to the house. Twice, they came to driveways with locked gates. Leaving the car, they made their way up hillsides to where they could see the houses. Both had been family homes, with children playing outside.\u003c/p\u003e\n\u003cp\u003eIt was near dark when they returned to Marisa\u0027s apartment. \"Well,\" she said as she unlocked her door, \"that was a wasted day.\"\u003c/p\u003e\n\u003cp\u003e\"Not really. At least we know where he isn\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Where who isn\u0027t?\"\u003c/p\u003e\n\u003cp\u003eMarisa\u0027s hand flew to her throat as Grigori materialized out of the shadows in the living room.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t do that!\" she exclaimed as she switched on the light. \"You scared me to death.\"\u003c/p\u003e\n\u003cp\u003e\"Where have you been?\"\u003c/p\u003e\n\u003cp\u003eShe tossed her handbag on the sofa. \"Out. I\u0027m gonna grab a Coke, Edward. Do you want one?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, please.\"\u003c/p\u003e\n\u003cp\u003eGrigori glared at Edward. \"Do you want to tell me where you\u0027ve been?\"\u003c/p\u003e\n\u003cp\u003eEdward sat down on the sofa and let out a weary sigh. \"Where do you think? We\u0027ve been looking for Alexi.\"\u003c/p\u003e\n\u003cp\u003e\"You took her with you!\"\u003c/p\u003e\n\u003cp\u003e\"It seemed the wisest course.\"\u003c/p\u003e\n\u003cp\u003eGrigori studied Ramsey a moment. \"He found you, didn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003eRamsey nodded. \"He sent someone after me.\"\u003c/p\u003e\n\u003cp\u003eGrigori went still. He stood there, knowing the question must be asked, afraid he already knew the answer.\u003c/p\u003e\n\u003cp\u003eMarisa came into the room. She handed Edward a glass, then sat down on the sofa beside him.\u003c/p\u003e\n\u003cp\u003eSilence cloaked the room like a shroud. And still Grigori stood there, his gaze fixed on Edward, though he was acutely conscious of Marisa, as well. He could hear the beat of their hearts, smell the blood flowing through their veins. Minutes passed. He was aware of their discomfort as the silence grew unbearable, knew that they, too, were aware of the vast chasm that yawned between them, an abyss that could never be bridged.\u003c/p\u003e\n\u003cp\u003eRamsey drummed his fingers on the arm of the sofa.\u003c/p\u003e\n\u003cp\u003eMarisa toyed with a lock of her hair.\u003c/p\u003e\n\u003cp\u003e\"Who?\" Grigori asked, his voice barely audible. \"Who did he send?\"\u003c/p\u003e\n\u003cp\u003e\"A woman,\" Ramsey replied in a voice equally soft.\u003c/p\u003e\n\u003cp\u003eGrigori closed his eyes a moment, summoning the strength to hear it all. \"What did she look like?\"\u003c/p\u003e\n\u003cp\u003e\"Tall. Long black hair. Blue-green eyes.\"\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t contain the anguished groan that rose in his throat. \"Antoinette... Did you... Is she\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\" A muscle worked in his jaw. \"Is she still alive?\"\u003c/p\u003e\n\u003cp\u003eRamsey nodded.\u003c/p\u003e\n\u003cp\u003eHands clenching and unclenching at his sides, Grigori groaned again. \"Annie... Annie...\"\u003c/p\u003e\n\u003cp\u003eMarisa shook her head, her heart breaking at the pain she read in Grigori\u0027s eyes. She could not begin to imagine what he was feeling, how awful it would be to know someone you loved had been transformed into something that was no longer human.\u003c/p\u003e\n\u003cp\u003eAnd then the pain in his eyes was gone, consumed by flames of rage. \"Tell me everything that happened,\" Grigori demanded, his voice gruff. \"Everything you did today.\"\u003c/p\u003e\n\u003cp\u003eRamsey complied, speaking in short, crisp sentences, as if he would be penalized for every unnecessary word.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve told me everything you remember?\"\u003c/p\u003e\n\u003cp\u003eRamsey nodded.\u003c/p\u003e\n\u003cp\u003e\"And you found no trace of Alexi?\" Grigori asked, his voice harsh and bitter, like acid.\u003c/p\u003e\n\u003cp\u003e\"No, nothing.\"\u003c/p\u003e\n\u003cp\u003e\"Do you think he\u0027ll send her after Edward again?\" Marisa asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, and we\u0027ll be waiting.\"\u003c/p\u003e\n\u003cp\u003e\"We?\" Edward asked, clearly surprised.\u003c/p\u003e\n\u003cp\u003eGrigori nodded. \"Tonight we\u0027ll find you a new place to stay. If he sent her once, he may send her again. And this time I\u0027ll be waiting.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not thinking of spending the day in my room, are you?\"\u003c/p\u003e\n\u003cp\u003e\"Exactly so.\"\u003c/p\u003e\n\u003cp\u003eEdward snorted. \"How are you going to do that?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry about me.\"\u003c/p\u003e\n\u003cp\u003e\"Believe me, I don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" Marisa said, discomfitted by the sudden tension between the two men. \"I don\u0027t know about you two, but I\u0027m hungry.\"\u003c/p\u003e\n\u003cp\u003eRamsey stood up. \"Yeah, me too. As long as he\u0027s here, I think I\u0027ll go get something to eat.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think that\u0027s a good idea,\" Marisa said. \"What\u0027s to stop Alexi from finding you?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s right,\" Grigori said. \"You shouldn\u0027t be out there alone.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got some steaks,\" Marisa said, \"or we can order something in.\"\u003c/p\u003e\n\u003cp\u003e\"I guess you\u0027re right,\" Edward agreed.\u003c/p\u003e\n\u003cp\u003e\"So, what\u0027ll it be?\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t matter to me,\" Ramsey said, \"whatever you want.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I don\u0027t really feel like cooking. Let\u0027s order some Chinese.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds good to me,\" Edward said. \"I\u0027ll take care of it.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\"\u003c/p\u003e\n\u003cp\u003e\"You want anything in particular?\"\u003c/p\u003e\n\u003cp\u003e\"No. Well, some sweet-and-sour chicken, maybe.\"\u003c/p\u003e\n\u003cp\u003e\"Right,\" he said, and went into the kitchen to use the phone.\u003c/p\u003e\n\u003cp\u003eMarisa looked up at Grigori. He was still standing in the middle of the floor, his thoughts obviously turned inward. She wondered what he was thinking, and then, seeing the dark, haunted look in his eyes, she decided she didn\u0027t really want to know.\u003c/p\u003e\n\u003cp\u003eIt had been a heck of a day, she mused ruefully, and the night ahead didn\u0027t look like it was going to be any better. \u003c/p\u003e","sourceLink":"https://allnovel.net/shades-of-gray-vampire-trilogy-1/page-12.html","bookId":2296,"creation":"Oct 5, 2019 6:01:06 PM","modification":"Oct 5, 2019 6:01:06 PM"}
