{"id":93299,"no":14,"title":"Page 14","content":"\u003cp\u003eRamsey felt the hair rise along the back of his neck as he stood in the doorway and surveyed the motel room. She hadn\u0027t made any effort to clean up this time. The sheets on the bed were soaked with blood. A broken lamp lay on the floor.\u003c/p\u003e\n\u003cp\u003eMoving cautiously, he entered the room and stared down at the sheets. So much blood. Was it hers?\u003c/p\u003e\n\u003cp\u003eHe went into the bathroom, and then returned to the main room. Pulling his handkerchief from his pocket, he wiped off everything Grigori might have touched, and then left the room. He locked the door behind him, wiping off the doorknob.\u003c/p\u003e\n\u003cp\u003eWhere was Grigori?\u003c/p\u003e\n\u003cp\u003eGetting into his car, he drove to Marisa\u0027s apartment.\u003c/p\u003e\n\u003cp\u003eHe swore under his breath when he saw the broken window. Had Antoinette come here looking for him? He swore again as he opened the door with the key Marisa had given him.\u003c/p\u003e\n\u003cp\u003eHolding his cross tightly in his hand, he studied the broken window. Dirt and shards of crockery lay scattered over the carpet, but it was the crimson trail leading across the floor that held his attention.\u003c/p\u003e\n\u003cp\u003eTaking a deep breath, he followed the bloody path. It led into Marisa\u0027s bedroom, disappearing inside the closet.\u003c/p\u003e\n\u003cp\u003eHe stood there for several minutes, his heart pounding like thunder in his ears as he contemplated who, or what, waited behind the portal.\u003c/p\u003e\n\u003cp\u003eHe flicked on the light and then, taking a deep breath, he opened the door.\u003c/p\u003e\n\u003cp\u003eAt first, he didn\u0027t notice anything unusual, and then he saw the blankets. Not certain he wanted to see what lay beneath, he lifted the bedding with a trembling hand, shuddered at what he saw. Grigori lay curled up on the floor, as still as death. Dried blood stained his shirt and pants, made a dark pool beneath him. His left cheek had been badly burned.\u003c/p\u003e\n\u003cp\u003eRamsey regarded Grigori for a long moment, wondering if the vampire was capable of feeling pain when he was lost in his deathlike sleep.\u003c/p\u003e\n\u003cp\u003eFor one fleeting moment, he was tempted to drive a stake through the creature\u0027s black heart, to cut off his head, then burn the body, thereby assuring that this vampire, at least, would never rise to drink human blood again.\u003c/p\u003e\n\u003cp\u003eMuttering an oath, Edward shook his head. Though he hated to admit it, he needed Chiavari\u0027s help. It was a bitter thing to admit. He had hunted vampires all over the world. None had ever eluded him, or frightened him, as did Alexi Kristov.\u003c/p\u003e\n\u003cp\u003eWith a last look at the vampire, Edward replaced the covers, and closed the door.\u003c/p\u003e\n\u003cp\u003eNeeding to keep busy, he went to a lumberyard and bought a sheet of plywood to cover the broken window. When that was done, he set to work scrubbing the blood out of the carpet, an impossible task, but it gave him something to do.\u003c/p\u003e\n\u003cp\u003eTime and again he considered going in search of Antoinette and Alexi, but it didn\u0027t seem wise to leave Grigori alone and unprotected. He didn\u0027t know what had happened to Antoinette, didn\u0027t know if she would strike again.\u003c/p\u003e\n\u003cp\u003eWhen he was finished, he sat back and surveyed the results. He didn\u0027t think Marisa would be pleased when she saw the faint brown stains. Maybe a professional carpet cleaner could get them out.\u003c/p\u003e\n\u003cp\u003eAt three, he called Marisa at work.\u003c/p\u003e\n\u003cp\u003e\"Yes, hello?\"\u003c/p\u003e\n\u003cp\u003e\"Marisa, this is Edward.\"\u003c/p\u003e\n\u003cp\u003eThere was a moment of silence: then he heard her take a deep breath. \"What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003e\"Is there any chance you can leave work early? I don\u0027t think we should be out after dark.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s happened?\"\u003c/p\u003e\n\u003cp\u003e\"Grigori was attacked.\"\u003c/p\u003e\n\u003cp\u003e\"Attacked! By who? Is he...?\"\u003c/p\u003e\n\u003cp\u003e\"No. He\u0027s hurt pretty bad, but I don\u0027t know what to do for him.\" He grunted softly. \"As for who attacked him, my guess is it was Antoinette. One of the reasons vampires make revenants is because of their ability to move about during the day. How soon can you get away?\"\u003c/p\u003e\n\u003cp\u003e\"In about half an hour.\"\u003c/p\u003e\n\u003cp\u003e\"Okay, I\u0027ll pick you up.\"\u003c/p\u003e\n\u003cp\u003e\"No. I don\u0027t think you should leave him alone. I\u0027ll take a cab. I\u0027ll be home about four-thirty.\"\u003c/p\u003e\n\u003cp\u003e\"Be careful.\"\u003c/p\u003e\n\u003cp\u003e\"You too.\"\u003c/p\u003e\n\u003cp\u003eMarisa hung up the receiver, and then sat staring at the phone. Grigori was hurt. What did that mean, exactly? She knew he could be injured. She had seen the scratches inflicted by Alexi. But she\u0027d also seen how rapidly he healed....\u003c/p\u003e\n\u003cp\u003eShe turned off her computer, called for a cab, then gathered her things together and went to tell Mr. Salazar that there was an emergency at home and she had to leave. She had told Grigori, in jest, that her boss was an ogre, but it wasn\u0027t entirely true. Salazar might be a tyrant where work was concerned, but he was extremely lenient with his employees.\u003c/p\u003e\n\u003cp\u003e\"Sure, Marisa,\" he said, \"take tomorrow off, too, if you need to. Donna can fill in for you.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, Mr. Salazar.\"\u003c/p\u003e\n\u003cp\u003e\"Sure, sure, no problem. Did you get the Wendall deposition typed up?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, it\u0027s on my desk, ready to go.\"\u003c/p\u003e\n\u003cp\u003e\"Good, good. Let me know if there\u0027s anything I can do.\"\u003c/p\u003e\n\u003cp\u003e\"I will, thank you.\"\u003c/p\u003e\n\u003cp\u003eThe cab was waiting when she left the building. She gave the driver her address, and then climbed into the backseat, fidgeting nervously as the taxi threaded its way through the heavy traffic on the freeway. She watched the sky turn from blue to gray and wished for summer and daylight saving time.\u003c/p\u003e\n\u003cp\u003eShe felt like screaming by the time they reached her apartment. She paid the driver, then ran up the stairs, her eyes widening when she saw the plywood that covered the front window.\u003c/p\u003e\n\u003cp\u003eHer heart was pounding as she opened the door. \"Edward?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah?\" He stepped out of the kitchen. \"I thought I\u0027d make dinner. Hope you don\u0027t mind.\"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t mind,\" Marisa replied. \"You\u0027ll make some woman a wonderful wife.\" She dropped her handbag on the sofa, muttering, \"What the hell?\" when she saw the faint brown stains on the carpet. \"Where\u0027s Grigori?\"\u003c/p\u003e\n\u003cp\u003e\"In the closet in your bedroom.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s he doing in the closet?\" she asked, the answer occurring to her before she had finished asking the question.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know if you want to see him.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s pretty badly cut up.\" Edward shook his head. \"He looks like somebody chewed him up and spit him out.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s how I feel, too.\"\u003c/p\u003e\n\u003cp\u003eMarisa looked up to see Grigori leaning against the doorjamb. She had often heard people say someone looked like death warmed over. In this case, it was the truth. His face was beyond pale, the skin dry and brittle-looking, like scorched paper. His shirt was in shreds, the cloth stained with so much blood she couldn\u0027t tell what color the material was supposed to be. The skin on his left cheek had been badly burned.\u003c/p\u003e\n\u003cp\u003eNausea roiled in her stomach, making her feel faint. Her first instinct was to turn and run away as fast and as far as her legs could carry her. And he knew it. She read the knowledge in his eyes, dark black eyes filled with anguish, burning with rage and agony that was far deeper than physical pain.\u003c/p\u003e\n\u003cp\u003e\"Come and sit down,\" Marisa said. She started toward him, one hand outstretched to help him.\u003c/p\u003e\n\u003cp\u003e\"Stay away from me.\"\u003c/p\u003e\n\u003cp\u003eHis voice slammed into her, halting her in mid-stride. She glanced over at Edward, who was standing near the front door, his crucifix clutched in both hands.\u003c/p\u003e\n\u003cp\u003e\"Ramsey, take Marisa and get out of here.\"\u003c/p\u003e\n\u003cp\u003e\"You said it wasn\u0027t safe for us to be out at night,\" she reminded him.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not safe here, either.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Look at him, Marisa,\" Edward said, coming to stand beside her. \"Come on, let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003e\"Are you crazy? He needs help.\"\u003c/p\u003e\n\u003cp\u003e\"Ramsey, get her out of here! Take her someplace crowded and well lit. The mall. Buy me a change of clothes.\" He didn\u0027t need a new shirt or pants, he had an extensive wardrobe at home, but he needed to get them out of the house. He hoped that the errand would give them something else to think about.\u003c/p\u003e\n\u003cp\u003eWith a nod, Edward reached for Marisa\u0027s hand. \"Come on, let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003e\"No.\" She shook off his hand. \"He needs help.\"\u003c/p\u003e\n\u003cp\u003e\"He doesn\u0027t need our help,\" Ramsey said. \"He needs blood.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t want to believe it, but the truth was staring her in the face.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s right,\" Grigori said tersely. He clenched his hands; the scent of their blood, her blood, fanning the hunger that was roaring through him, demanding to be fed, demanding that he replace what had been lost so his body could heal itself.\u003c/p\u003e\n\u003cp\u003eMarisa stared at him, seeing past the wounds that crisscrossed his body, past the pain in his eyes to the hunger growing within him. From somewhere deep inside came the urge to go to him, to offer him the sustenance he needed. The thought appalled her even as it beckoned.\u003c/p\u003e\n\u003cp\u003e\"No.\" Grigori shook his head. \"Not now, Marisa.\"\u003c/p\u003e\n\u003cp\u003eAnd before she could decipher that cryptic message, Ramsey was pulling her out of the apartment.\u003c/p\u003e\n\u003cp\u003eClinging tightly to his self-control, Grigori watched them go, watched her go. She had wanted to help him, wanted to offer him her life\u0027s blood. And he had wanted to take it, would have taken it save for the awful fear that, once he touched her, tasted her, he wouldn\u0027t be able to stop.\u003c/p\u003e\n\u003cp\u003eBut there was no need for self-control now, and he shed it like a snake shedding its skin, surrendering to the pain that hummed through every inch of his body, loosing the hunger that clawed at his vitals. He felt the sharp prick of his fangs against his tongue, knew his eyes burned red with the need pulsing through him.\u003c/p\u003e\n\u003cp\u003eRipping off what was left of his shirt, he tossed it into the trash, then staggered into the bathroom and washed the blood from his face and chest and arms. He looked at himself in the mirror, lifted a hand to his cheek, feeling the ragged edges of charred skin. It would be weeks before the burn healed. But it would heal and there would be no scar.\u003c/p\u003e\n\u003cp\u003eShirtless, he left the house. Resting had restored some of his strength. He masked his presence from those he passed until he found what he was looking for, a healthy young man walking alone down a deserted street. Ordinarily, he never hunted in the same city where he slept, but now need overruled caution.\u003c/p\u003e\n\u003cp\u003eHe blanked the man\u0027s mind, then bent over him, taking what he needed, drinking long and deep. The temptation to take it all rose up strong within him, but he took no more than the man could safely spare. He ran his tongue over the wounds to seal them, wiping all memory of his presence from the man\u0027s mind.\u003c/p\u003e\n\u003cp\u003eHe ghosted through the city streets, taking his prey unawares. How much simpler it would have been to take one mortal and drain him to the point of death, to drink not only his blood but his life as well, but he had vowed, a century ago, that he would never take a human life again unless his own life was at risk.\u003c/p\u003e\n\u003cp\u003eIt was after midnight when he returned to Marisa\u0027s apartment. He had expected to find Ramsey and Marisa asleep, but they were in the living room. Dialogue from a movie they weren\u0027t watching filled the silence of the room.\u003c/p\u003e\n\u003cp\u003eHe felt the censure in their eyes as they watched him close and lock the door. When he turned around, they were both looking elsewhere. It made him feel as if he didn\u0027t exist.\u003c/p\u003e\n\u003cp\u003eFor stretched seconds, no one spoke. And then Ramsey stood up. \"Your clothes are in a bag in the kitchen.\"\u003c/p\u003e\n\u003cp\u003eGrigori nodded.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to bed.\"\u003c/p\u003e\n\u003cp\u003e\"Hold on, Ramsey. Where were you this morning?\"\u003c/p\u003e\n\u003cp\u003eEdward let out a long sigh, and Marisa had the feeling that he had been waiting all night for this one question. And even as he seemed to gather the courage to answer, she wondered if things would have turned out differently if he had been at the motel that morning.\u003c/p\u003e\n\u003cp\u003e\"There was a five-car pile-up on the freeway,\" Ramsey said, meeting Grigori\u0027s eyes for the first time. \"Two fatalities. I got hung up in traffic.\"\u003c/p\u003e\n\u003cp\u003eGrigori nodded. \"Good night.\"\u003c/p\u003e\n\u003cp\u003eEdward glanced at Marisa, then left the room.\u003c/p\u003e\n\u003cp\u003e\"Well,\" Marisa said, not meeting his eyes, \"I think I\u0027ll go to bed, too.\"\u003c/p\u003e\n\u003cp\u003e\"Marisa.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" She kept her head lowered, her fingers toying with the cross dangling between her breasts.\u003c/p\u003e\n\u003cp\u003e\"Look at me.\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t, she thought, she couldn\u0027t face him now, knowing where he had been, what he\u0027d been doing.\u003c/p\u003e\n\u003cp\u003e\"Look at me.\"\u003c/p\u003e\n\u003cp\u003eIt was impossible to resist the power in his voice. Slowly, she lifted her head and met his gaze. \"Does it hurt?\" she asked, gesturing at his cheek.\u003c/p\u003e\n\u003cp\u003e\"Yes. Why? Do you think me incapable of feeling pain?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t hurt as much as the distrust in your eyes.\"\u003c/p\u003e\n\u003cp\u003eShe glanced away, then met his gaze again. \"Will I read about more dead bodies in the morning paper?\"\u003c/p\u003e\n\u003cp\u003e\"Not of my doing.\"\u003c/p\u003e\n\u003cp\u003eShe said nothing, but he knew she didn\u0027t believe him.\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t killed anyone, except to preserve my own existence, in over a hundred years.\"\u003c/p\u003e\n\u003cp\u003eShe regarded him for a long moment. The hideous knife wounds were already healing. Some were no more than faint red streaks against his pale flesh. Only the burn on his cheek seemed unimproved, the flesh charred and black.\u003c/p\u003e\n\u003cp\u003eHe wished suddenly that he had thought to stop at his resting place and put on a shirt, but he\u0027d had other, more urgent matters on his mind. She was staring at his face. Seeing the revulsion in her eyes, he covered his injured cheek with his hand.\u003c/p\u003e\n\u003cp\u003e\"Is there anything I can do for that?\" she asked.\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"The skin will rejuvenate, in time. Burns are always slow to heal.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\"\u003c/p\u003e\n\u003cp\u003e\"Marisa\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t what?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t look at me like that. Don\u0027t make me stay here.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not keeping you.\"\u003c/p\u003e\n\u003cp\u003eShe drew her knees to her chest and wrapped her arms around them, staring up at him through eyes that were wide and frightened, eyes filled with doubt and confusion. And a reluctant concern.\u003c/p\u003e\n\u003cp\u003e\"Did you want to be a vampire?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because I felt it was the only way I could avenge the deaths of my children.\"\u003c/p\u003e\n\u003cp\u003e\"How old were they?\"\u003c/p\u003e\n\u003cp\u003e\"My daughter was five, my son a year younger.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"It was a long time ago,\" he murmured, \"and yet the pain remains.\" He sank down on the floor, his back against the wall, one knee bent. He looked up at her, his expression bleak. \"All these years, and still I have not been able to destroy him. I hunted him for a hundred years, and then, when I found him, it was too late. Silvano\u0027s family had interred him in the bowels of a church and I could not reach him. Now, he is here, and still I cannot find his lair, cannot get close enough to destroy him!\"\u003c/p\u003e\n\u003cp\u003eHis hands clenched. \"In the past, I have been able to sense the presence of other vampyres, have been able to track them to their resting places. Why can\u0027t I find Alexi?\"\u003c/p\u003e\n\u003cp\u003eShe had no answer for him, could only stare at him, watching with disbelieving eyes as the lacerations on his chest continued to heal before her eyes, the red scars fading and then disappearing, until nothing remained but the ugly wound on his cheek.\u003c/p\u003e\n\u003cp\u003e\"What is it?\" he asked. \"What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head in wonder, then pointed at his chest, his arms. \"They\u0027re gone. The wounds, as if they were never there at all.\"\u003c/p\u003e\n\u003cp\u003eGrigori glanced down, then shrugged. \"I told you, we heal quickly.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\" But it was still an amazing thing to watch. \"Isn\u0027t it lonely, being a vampire? Not being able to tell anyone who you are?\" Sort of like being Superman, she thought, always pretending to be Clark Kent.\u003c/p\u003e\n\u003cp\u003e\"It can be lonely, at times,\" he admitted. In the beginning, he had missed his home, his family, but, gradually, he had grown accustomed to his solitary life, had even come to enjoy it. He had never lacked female companionship. The Dark Gift carried an aura of power. Any woman he had desired had been his for the taking. He had seduced them, but he had loved none of them. He had traveled the world, watched the changes two centuries had wrought, seen things, done things, beyond the powers of mortal man.\u003c/p\u003e\n\u003cp\u003e\"Eternity is such a long time. Doesn\u0027t life get... tiresome? How ever do you pass the time?\"\u003c/p\u003e\n\u003cp\u003eHe grinned at her. \"Do you picture me lurking in the shadows, always on the outside looking in, wishing I could be part of humanity again?\"\u003c/p\u003e\n\u003cp\u003e\"Well, yeah, I guess so.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not like that, Marisa. Think of people you know who work nights. What do they do?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. The same things I do, I guess.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"I read. Books, newspapers, the classics, mysteries. I go to the movies. I\u0027ve traveled the world. I stay at home and watch TV.\" He smiled at her. \"All the good shows are on at night, you know?\"\u003c/p\u003e\n\u003cp\u003eShe couldn\u0027t help it, she smiled back.\u003c/p\u003e\n\u003cp\u003e\"Not all of us are the evil monsters depicted in movies and novels.\"\u003c/p\u003e\n\u003cp\u003e\"Like Kristov?\"\u003c/p\u003e\n\u003cp\u003eGrigori nodded. \"Like Kristov.\"\u003c/p\u003e\n\u003cp\u003e\"Was he always like he is now?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. When I first met him, he seemed to be a fine gentleman. I couldn\u0027t understand why he wanted to spend time in our poor home.\"\u003c/p\u003e\n\u003cp\u003eBut he knew now. It hadn\u0027t been his company Kristov had sought, but Antoinette\u0027s. And when she had refused him, he had lashed out in a rage, killing those she had held most dear. He could hear Alexi\u0027s voice screaming in his mind:... she refused... to leave you or those brats... Well, she doesn\u0027t refuse me anymore. Pain clawed at him as he imagined Antoinette sharing a bed with Alexi, helpless to resist him, compelled to surrender to his every wish.\u003c/p\u003e\n\u003cp\u003e\"Grigori?\"\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"Where were you?\"\u003c/p\u003e\n\u003cp\u003e\"Remembering.\"\u003c/p\u003e\n\u003cp\u003eShe nodded. Judging from the look on his face, they weren\u0027t pleasant memories.\u003c/p\u003e\n\u003cp\u003e\"Have you ever made anyone else a vampire?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"No one has asked, and it is not something I would force on another.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s it like, to drink... to drink blood?\"\u003c/p\u003e\n\u003cp\u003e\"It is natural for me, Marisa. It is not repulsive. The taste can be\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\" he glanced fleetingly at the slender curve of her neck\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\"sweet, especially when it is offered willingly.\"\u003c/p\u003e\n\u003cp\u003e\"It sounds as if you like being a vampire.\" She shook her head, unable to accept the idea. \"I can\u0027t believe you don\u0027t miss being able to go out during the day, or eating a good meal, or... or\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\"\u003c/p\u003e\n\u003cp\u003e\"For me, becoming Vampyre was a blessing. I was born in a poor village in Tuscany. I couldn\u0027t read or write, and had no hope of learning to do so, nothing to look forward to but a life of hard work and an early death. When I became Vampyre, it opened up a whole new world for me. Literally, a whole new world. The vampyre who made me taught me how to hunt, how to survive. And when she\u0027d taught me all I needed to know to survive, she taught me to read and write. She taught me how to behave as a gentleman, to appreciate art and literature. When I realized I couldn\u0027t reach Alexi, I traveled to the far corners of the world, saw places and people I had never dreamed existed.\"\u003c/p\u003e\n\u003cp\u003e\"How did you find her, the vampire who made you?\"\u003c/p\u003e\n\u003cp\u003e\"She found me.\" His lips twitched in what might have been a smile. \"I used to go to my children\u0027s graves at night because I didn\u0027t like to think of them being there, alone, in the dark.\" The sadness of two hundred years flickered in his eyes. \"My little boy was afraid of the dark.\"\u003c/p\u003e\n\u003cp\u003e\"Grigori, I\u0027m so sorry.\" Without realizing she had moved, she was off the sofa, kneeling beside him, drawing him into her arms. \"So sorry...\"\u003c/p\u003e\n\u003cp\u003eShe held him close, one hand sliding up and down his bare back until, gradually, she was no longer comforting him, but caressing him. His skin was cool and firm beneath her fingertips; the muscles in his back and shoulders were corded and sharply defined.\u003c/p\u003e\n\u003cp\u003eHe remained unmoving in her arms, quiescent as her hands slid down his arms, over his belly, threaded through his hair. He felt the first stirring of desire unfurl within her, heard the sudden catch in her breath as she realized that his body was reacting to her touch. Did she think him incapable of desire? Her blood warmed; a flush stained her cheeks.\u003c/p\u003e\n\u003cp\u003eWhen she would have pulled away, he slid his arm around her waist to keep her close. \"Don\u0027t stop.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\"\u003c/p\u003e\n\u003cp\u003e\"Because I am Vampyre.\" he said caustically.\u003c/p\u003e\n\u003cp\u003e\"No... because... because I hardly know you.\u003c/p\u003e\n\u003cp\u003eBecause I\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\" The flush in her cheeks grew hotter and her gaze slid away from his. \"I\u0027m not, I don\u0027t\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\"\u003c/p\u003e\n\u003cp\u003e\"You have nothing to fear from me. I don\u0027t have any diseases, Marisa,\" he said, reading the thoughts she couldn\u0027t put into words. \"I can no longer father a child.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" She looked up at him then, and he saw the fear in her eyes.\u003c/p\u003e\n\u003cp\u003eSlowly, reluctantly, he released her. \"I would not take you against your will, cara.\"\u003c/p\u003e\n\u003cp\u003e\"You must have known a lot of women in two hundred years.\"\u003c/p\u003e\n\u003cp\u003e\"Many,\" he admitted. \"But when I\u0027m with you, I can remember none of them.\"\u003c/p\u003e\n\u003cp\u003e\"Except Antoinette.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said heavily. \"Antoinette.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s still your wife, isn\u0027t she?\"\u003c/p\u003e\n\u003cp\u003eHe drew a deep, painful breath and let it out in a long, slow sigh. \"The girl I married is dead. Nothing remains but an empty shell, a shadow of the woman I loved.\"\u003c/p\u003e\n\u003cp\u003eHe looked past her to the window. \"I must go. Be careful tomorrow. Have Ramsey drive you to work and pick you up. Don\u0027t go anywhere alone.\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to stay here again?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Where do you... sleep?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s better if you don\u0027t know.\" He caressed her cheek with the back of his hand, his knuckles sliding over her skin, making her shiver with pleasure. \"Be careful.\"\u003c/p\u003e\n\u003cp\u003e\"You too.\"\u003c/p\u003e\n\u003cp\u003e\"Always.\" He rose smoothly to his feet, then offered her his hand, pulling her up beside him. \"Remember what I said. Don\u0027t go anywhere alone.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be all right.\" She smiled at him, then went into the kitchen, returning moments later with a brown shopping bag. \"Don\u0027t forget your clothes.\"\u003c/p\u003e\n\u003cp\u003eHe hefted the bag, certain he would not care for Ramsey\u0027s taste in clothing, which ran to dull browns and obnoxious plaids, \"Thank Ramsey for me.\"\u003c/p\u003e\n\u003cp\u003e\"I will. Would it have made any difference this morning, if he\u0027d been there?\"\u003c/p\u003e\n\u003cp\u003eShe felt him tense as he considered her question. And then he nodded. \"He would have killed her without a qualm.\"\u003c/p\u003e\n\u003cp\u003e\"And you couldn\u0027t, could you?\"\u003c/p\u003e\n\u003cp\u003e\"No. Even knowing it was the only way to put her soul to rest, I couldn\u0027t do it.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m glad.\"\u003c/p\u003e\n\u003cp\u003e\"Are you? Why?\"\u003c/p\u003e\n\u003cp\u003e\"I just am.\"\u003c/p\u003e\n\u003cp\u003e\"Does it make me less a monster in your eyes?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not a monster.\"\u003c/p\u003e\n\u003cp\u003e\"You thought so not so very long ago.\"\u003c/p\u003e\n\u003cp\u003eShe had no answer for that.\u003c/p\u003e\n\u003cp\u003eHe placed his forefinger under her chin, tilted her head up, and brushed his lips across hers.\u003c/p\u003e\n\u003cp\u003e\"Till tonight, cara,\" he whispered tenderly, and then he was gone. \u003c/p\u003e","sourceLink":"https://allnovel.net/shades-of-gray-vampire-trilogy-1/page-14.html","bookId":2296,"creation":"Oct 5, 2019 6:01:06 PM","modification":"Oct 5, 2019 6:01:06 PM"}
