{"id":93305,"no":20,"title":"Page 20","content":"\u003cp\u003e\"Well, I\u0027m beat,\" Ramsey muttered. \"I think I\u0027ll turn in.\"\u003c/p\u003e\n\u003cp\u003e\"Good night, Edward.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t fail me tomorrow, Ramsey.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry. I\u0027ll take care of it.\"\u003c/p\u003e\n\u003cp\u003eGrigori nodded.\u003c/p\u003e\n\u003cp\u003e\"See you tomorrow,\" Edward said. He started out of the room, then paused and glanced over his shoulder at Marisa. \"Which room do you want to sleep in?\"\u003c/p\u003e\n\u003cp\u003eMarisa thought of trying to sleep in one of the children\u0027s beds and knew she couldn\u0027t do it, couldn\u0027t sleep in a bed where someone had died. Nor could she bring herself to sleep in the bed Grigori had shared with Antoinette. \"I think I\u0027ll sleep out here on the bench.\"\u003c/p\u003e\n\u003cp\u003e\"Okay. Good night.\"\u003c/p\u003e\n\u003cp\u003e\"Night.\"\u003c/p\u003e\n\u003cp\u003eGrigori went to the tiny window in the front of the house and stared out into the darkness. As clearly as if it were day, he could see the fields beyond, the weeds that grew in the furrows where he had once planted the crops that had sustained his family. He heard the beat of mighty wings as an owl plummeted earthward, talons outstretched, heard the terrified shriek of the bird\u0027s prey. The hunter and the hunted. Predator and prey. The endless cycle of life and death.\u003c/p\u003e\n\u003cp\u003eAll these years he had thought Antoinette dead. In his mind, he had buried her and grieved for her when she hadn\u0027t been dead at all. She had lived as Alexi\u0027s creature for two hundred years, and now, because of him, she would have to be destroyed. He wished that he had the right to pray, wished he could go into the village chapel where their children had been baptized and light a candle for Antoinette\u0027s immortal soul. But he had no right, no hope of being heard.\u003c/p\u003e\n\u003cp\u003e\"Grigori?\"\u003c/p\u003e\n\u003cp\u003eSlowly, he turned around to face Marisa. What a rare and wonderful creature she was. Such a fragile being, wrapped in her humanity. And yet her life, her warmth, drew him like a hearth fire on a winter night, beckoning to him, inviting him to come in from the dark and the cold.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry about Antoinette.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not your fault.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not yours, either.\"\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t it?\" Grief and guilt settled over him, entangling him in a web of regret from which there was no escape. He had given her the Dark Gift. He should be the one to destroy her, yet he dared not go into the crypt at night, not when he might encounter Alexi again. He was not strong enough to withstand another attack by the vampyre. And, deep in his heart, he feared he lacked the courage to do what must be done. How could he cut out her heart, take her head? How could he desecrate the body of the woman who had shared his bed, borne his children?\u003c/p\u003e\n\u003cp\u003e\"You should get some rest,\" Marisa said quietly.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine.\"\u003c/p\u003e\n\u003cp\u003e\"Sure you are.\"\u003c/p\u003e\n\u003cp\u003e\"Marisa\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m here.\" She held out her arms. He looked at her a moment, and then, unable to resist the comfort she offered, he crossed the floor, felt the burden of his guilt ease a little as Marisa wrapped her arms around him.\u003c/p\u003e\n\u003cp\u003eThey stood there for a long while, his forehead resting on the top of her head, her hand lightly stroking his back.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve got to go out,\" he said at length.\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003eHe lifted his head and gazed into her eyes.\u003c/p\u003e\n\u003cp\u003e\"Oh, but I thought\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\" She lifted a hand to her neck.\u003c/p\u003e\n\u003cp\u003e\"It was sweet, cara, but it wasn\u0027t enough.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think you should go out there. Can\u0027t you wait until tomorrow night when we\u0027re back home?\"\u003c/p\u003e\n\u003cp\u003e\"I am home.\"\u003c/p\u003e\n\u003cp\u003e\"You know what I mean.\"\u003c/p\u003e\n\u003cp\u003eGrigori shook his head. \"I can\u0027t wait.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\" She looked up at him, not understanding.\u003c/p\u003e\n\u003cp\u003e\"I need to feed,\" he said, wondering how to explain it to her. \"It isn\u0027t like the hunger mortals feel. It\u0027s... it\u0027s a need that won\u0027t be denied. Especially now. I need it, Marisa, in ways you can\u0027t begin to understand.\"\u003c/p\u003e\n\u003cp\u003e\"Does it hurt, when you don\u0027t... drink?\"\u003c/p\u003e\n\u003cp\u003e\"You have no idea.\" Hurt didn\u0027t begin to describe it. He doubted if there were any words that could fully portray the agony that came with abstinence. The hunger was a craving that could not be denied, a need that went beyond mere physical agony, especially now, when he had been badly hurt, when his strength was at a low ebb.\u003c/p\u003e\n\u003cp\u003e\"Then drink from me.\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Then take some of Ramsey\u0027s blood.\"\u003c/p\u003e\n\u003cp\u003eGrigori grunted softly. \"Yes, I\u0027m sure he\u0027d like that.\"\u003c/p\u003e\n\u003cp\u003e\"Well, this is an emergency. I don\u0027t want you going out there, not tonight. You\u0027re too weak.\"\u003c/p\u003e\n\u003cp\u003eHe raised one dark brow. \"You sound like my mother.\"\u003c/p\u003e\n\u003cp\u003e\"You wait here. I\u0027ll go talk to Edward.\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t wait for Grigori\u0027s assent, but hurried out of the room.\u003c/p\u003e\n\u003cp\u003eRamsey woke the minute she opened the door to the bedroom, his hand clutching his cross. \"What\u0027s wrong?\"\u003c/p\u003e\n\u003cp\u003e\"I need your help.\"\u003c/p\u003e\n\u003cp\u003e\"Sure.\" He sat up, wiping the sleep from his eyes. \"What is it?\"\u003c/p\u003e\n\u003cp\u003e\"I want you to give Grigori some of your blood.\"\u003c/p\u003e\n\u003cp\u003e\"Are you out of your mind? I\u0027m not feeding that ghoul.\"\u003c/p\u003e\n\u003cp\u003e\"Please, Edward. I don\u0027t want him to go out tonight. He\u0027s too weak. He\u0027d never be able to fight off Alexi.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not my problem.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes, it is. Have you forgotten he\u0027s our ticket back to the twentieth century?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I guess I did.\" He ran a hand through his hair, then shook his head. \"I can\u0027t do it. I\u0027ve spent my whole life destroying his kind. I\u0027m not about to start feeding them.\"\u003c/p\u003e\n\u003cp\u003e\"Please, Edward,\" she implored softly.\u003c/p\u003e\n\u003cp\u003e\"You still care for him, don\u0027t you? How could you? You know what he is.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" she replied miserably. \"But I can\u0027t help it. He\u0027s so alone.\"\u003c/p\u003e\n\u003cp\u003e\"Marisa\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\"\u003c/p\u003e\n\u003cp\u003e\"Please, Edward.\"\u003c/p\u003e\n\u003cp\u003eHe swore under his breath. \"All right, all right, I\u0027ll do it. For you.\" Rising, he tucked his shirt into his pants, ran a hand over his hair. And then, grabbing a stake from the foot of the bed, he followed Marisa out of the room.\u003c/p\u003e\n\u003cp\u003eGrigori grunted softly as Ramsey emerged from the bedroom. Even if he hadn\u0027t been able to hear the conversation in the bedroom, the look on Ramsey\u0027s face would have said it all. He was doing this for Marisa, and for no other reason.\u003c/p\u003e\n\u003cp\u003e\"Are you planning to use that?\" Grigori asked, gesturing at the stake clutched in Ramsey\u0027s hand.\u003c/p\u003e\n\u003cp\u003e\"If I have to. I don\u0027t mind being an appetizer, but I\u0027m not willing to be the whole banquet.\"\u003c/p\u003e\n\u003cp\u003eGrigori laughed in spite of himself.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not funny,\" Edward retorted. He sat down on the bench, his body quivering with tension, his eyes wary. \"Go on, get it over with.\" Ramsey flinched as Grigori sat down beside him.\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to do this,\" Grigori said curtly.\u003c/p\u003e\n\u003cp\u003eEdward glanced up at Marisa, and then back at the vampire. \"Yeah, I think I do.\"\u003c/p\u003e\n\u003cp\u003e\"Give me your left arm.\"\u003c/p\u003e\n\u003cp\u003eRamsey grunted. \"Sure you don\u0027t want to go for my throat?\"\u003c/p\u003e\n\u003cp\u003eGrigori shook his head. Nuzzling Ramsey\u0027s neck was the last thing he wanted to do.\u003c/p\u003e\n\u003cp\u003eRamsey took a deep breath, and then held out his arm.\u003c/p\u003e\n\u003cp\u003eGrigori rolled up Ramsey\u0027s shirtsleeve. He stared at the man\u0027s wrist, despising himself for his need, for the fierce hunger that could not be denied.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not too late to change your mind,\" Grigori said, his voice gruff with the need churning through him. The fact that Ramsey knew what he was feeling only made it worse.\u003c/p\u003e\n\u003cp\u003e\"Just do it.\" Edward hissed the words between tightly clenched teeth.\u003c/p\u003e\n\u003cp\u003e\"Make a fist.\"\u003c/p\u003e\n\u003cp\u003eEdward did as bidden, watching, in morbid fascination, as the vampire bent over his wrist. Never, in a million years, had he imagined he would be nourishing one of the undead.\u003c/p\u003e\n\u003cp\u003eGrigori swore under his breath as he lifted Ramsey\u0027s arm. He could hear the rapid beat of Ramsey\u0027s heart. The scent of the man\u0027s blood, the fear he was trying to control, filled his nostrils.\u003c/p\u003e\n\u003cp\u003eHe felt his fangs lengthen as he bent over Ramsey\u0027s arm.\u003c/p\u003e\n\u003cp\u003eEdward\u0027s right hand tightened around the stake until his knuckles went white with the strain.\u003c/p\u003e\n\u003cp\u003eMarisa stood across the room, her hand at her throat, feeling as though she were trapped in a living nightmare that had no end. Edward looked up, grimacing as he met her gaze. She tried to smile; instead, she felt tears well in her eyes. Tears of gratitude for Edward\u0027s sacrifice, tears of pity for Grigori.\u003c/p\u003e\n\u003cp\u003eAfter what seemed like an eternity but was probably less than a minute, Grigori released Ramsey\u0027s arm and stood up.\u003c/p\u003e\n\u003cp\u003e\"Thank you. I know how difficult that was for you,\" Grigori said stiffly. \"You should get something to drink.\"\u003c/p\u003e\n\u003cp\u003eEdward rolled his shirtsleeve down. \"Does this mean you\u0027ll be able to read my mind now?\"\u003c/p\u003e\n\u003cp\u003e\"I could always read your mind, Ramsey.\"\u003c/p\u003e\n\u003cp\u003eEdward stood up. He looked at Marisa, then at Grigori. \"I\u0027m going back to bed.\"\u003c/p\u003e\n\u003cp\u003e\"Ramsey.\"\u003c/p\u003e\n\u003cp\u003eEdward turned around. \"What do you want now, vampire?\"\u003c/p\u003e\n\u003cp\u003e\"Tomorrow,\" Grigori said, his voice ragged with pain. \"Be swift. And merciful.\"\u003c/p\u003e\n\u003cp\u003eWith a curt nod, Edward left the room.\u003c/p\u003e\n\u003cp\u003e\"She won\u0027t feel it, will she?\" Marisa asked, horrified to think that Antoinette might be aware of what was happening to her.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I hope not.\"\u003c/p\u003e\n\u003cp\u003e\"Where will you sleep tomorrow?\"\u003c/p\u003e\n\u003cp\u003eGrigori shrugged. \"I don\u0027t know. I\u0027ll find a place, don\u0027t worry.\"\u003c/p\u003e\n\u003cp\u003eShe went to sit beside him on the bench. \"Have you ever regretted becoming a vampire?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He had enjoyed being a vampyre. He was never tired, never sick. He didn\u0027t suffer from the usual aches and pains that plagued mankind. He could move with preternatural speed. He had watched nations rise and fall, seen man leave the earth behind and take to the stars. And yet... His gaze moved over Marisa in a long, heated caress. \"I\u0027ve never regretted it,\" he said heavily. \"Until now.\"\u003c/p\u003e\n\u003cp\u003e\"Would you be mortal again, if you could?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, but it isn\u0027t possible, even if I wished it.\"\u003c/p\u003e\n\u003cp\u003e\"Oh.\" Suddenly weary, she leaned back and closed her eyes, wishing, with all her heart, that she had never ventured out of her house on that rainy Halloween night.\u003c/p\u003e\n\u003cp\u003eSeveral minutes passed, and then she felt Grigori\u0027s arm slip around her shoulders. Grateful for his nearness, she snuggled against him, felt his hand stroke her cheek.\u003c/p\u003e\n\u003cp\u003eHe was still holding her when she fell asleep.\u003c/p\u003e\n\u003cp\u003eShe woke to the smell of coffee brewing. With a frown, she sat up. For a moment, she had almost imagined herself at home. Brushing the hair from her face, she stood up. It was then that she saw the dress lying across the foot of the bed. It was a pretty thing. The bodice was a rich, lustrous green silk with long, full sleeves and a square neckline edged in delicate rows of white lace; the full skirt was made of varying shades of light and dark green silk and satin. There was a note lying beside it. Curious, she picked it up. The message was brief: You shouldn\u0027t have to wear another woman\u0027s clothes. I hope the shoes fit.\u003c/p\u003e\n\u003cp\u003eGrigori\u0027s name was scrawled across the bottom of the paper.\u003c/p\u003e\n\u003cp\u003eHow had he known it made her uncomfortable to wear Antoinette\u0027s clothes?\u003c/p\u003e\n\u003cp\u003eSlipping out of her borrowed apparel, she drew the gown over her head, smoothed it over her hips. The skirt fell to the floor in a whisper of silk. She found the shoes at the foot of the bed. They were half boots, actually, made of kidskin.\u003c/p\u003e\n\u003cp\u003e\"A little fancy for every day,\" she remarked. But the silk felt heavenly against her skin. The boots, she discovered, fit perfectly.\u003c/p\u003e\n\u003cp\u003eFeeling a little like Juliet, she went into the kitchen.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" Edward said.\u003c/p\u003e\n\u003cp\u003e\"Hey yourself,\" Marisa replied with a grin. \"I see you got a new wardrobe, too.\"\u003c/p\u003e\n\u003cp\u003eRamsey grunted as he regarded his outfit. The shirt was stiff white linen with a fall of lace down the front. The trousers were mustard-colored, tighter than he normally wore. Grigori had provided a coat, as well. Made of dark brown wool, it was hanging over the back of a chair.\u003c/p\u003e\n\u003cp\u003e\"Not exactly my style,\" he muttered.\u003c/p\u003e\n\u003cp\u003e\"You look quite dashing.\"\u003c/p\u003e\n\u003cp\u003e\"And you look like a princess.\"\u003c/p\u003e\n\u003cp\u003eMarisa stared at him, startled by the compliment. \"Thank you.\" She glanced at the food on the table. \"If I didn\u0027t know better, I\u0027d think we had a fairy godmother.\"\u003c/p\u003e\n\u003cp\u003eRamsey grimaced. \"Grigori hardly qualifies for that position. Here,\" Edward said, handing her a cup of coffee.\u003c/p\u003e\n\u003cp\u003e\"Thanks.\" She took a drink, feeling the warmth steal through her. She jerked her chin toward the pan on the stove. \"You want me to do that?\"\u003c/p\u003e\n\u003cp\u003e\"No, sit down and take it easy. I\u0027m almost done.\"\u003c/p\u003e\n\u003cp\u003eMarisa glanced out the window, trying to judge the time. It felt early. Sitting down at the table, she sipped her coffee.\u003c/p\u003e\n\u003cp\u003e\"I hope you\u0027re hungry,\" Edward said.\u003c/p\u003e\n\u003cp\u003eMarisa stared at the plate he put in front of her. It was piled high with scrambled eggs, sausage, and sweet rolls. Edward sat down across from her, a cup of coffee cradled in his hands.\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you eating?\" Marisa asked.\u003c/p\u003e\n\u003cp\u003e\"No.\" A faint smile tugged at the corners of his mouth. \"I made enough for the two of us, but I don\u0027t have much of an appetite.\"\u003c/p\u003e\n\u003cp\u003e\"Did you... did you do it?\"\u003c/p\u003e\n\u003cp\u003e\"Not yet. I don\u0027t think it\u0027s something I want to do on a full stomach.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t envy you.\"\u003c/p\u003e\n\u003cp\u003eHe shrugged. \"I\u0027ve done it before. This is just the first time it\u0027s been a woman.\"\u003c/p\u003e\n\u003cp\u003eMarisa glanced out the window. The sky was blue. She could hear birds singing. \"It\u0027s still so hard to believe,\" she murmured.\u003c/p\u003e\n\u003cp\u003eEdward nodded. It was difficult to accept. Even now, after hunting the creatures for almost thirty years, it seemed unreal. He had seen things no one should see, done things no human being should have to do. He stared down at his hands, wondering that they weren\u0027t stained crimson with the blood he had shed. He thought of Antoinette, of the life that had been stolen from her, the torment she must have suffered while being enslaved to Alexi. It was so unfair, and yet no one had ever said life was fair.\u003c/p\u003e\n\u003cp\u003e\"Edward? Do you want me to go with you?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" He drained his cup, then stood up. \"Well...\"\u003c/p\u003e\n\u003cp\u003eShe looked up at him, wishing she knew what to say. Good luck seemed too flippant. \"Be careful.\"\u003c/p\u003e\n\u003cp\u003e\"Always.\" He put on his coat and stood there a moment more, looking unsure. Then he bent down and kissed her. It was a remarkably gentle kiss, filled with tenderness and uncertainty.\u003c/p\u003e\n\u003cp\u003eMarisa blinked up at him when he drew away, wondering if she looked as surprised as she felt.\u003c/p\u003e\n\u003cp\u003eEdward looked embarrassed. \"I\u0027m... I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right.\"\u003c/p\u003e\n\u003cp\u003e\"Marisa, I\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;\" He shoved his hands into his pants pockets. \"I guess I\u0027d better be going.\"\u003c/p\u003e\n\u003cp\u003e\"Hurry back,\" Marisa said. She stared after him as he left the room, her thoughts chaotic. She pressed her fingertips to her lips. Edward Ramsey had kissed her. She shook her head in amazement, wondering what ever had possessed him to do such a thing.\u003c/p\u003e\n\u003cp\u003eRamsey called himself ten kinds of a fool as he gathered up his supplies and left the house. She probably thought him an old fool, and she was right. He was forty-two years old and he had never been in love. Never had time for love. He\u0027d been hunting vampires since he was a teenager, traveling the world over, going wherever he was needed. He had seen most of the world, but he was abysmally ignorant when it came to women.\u003c/p\u003e\n\u003cp\u003eRamsey couldn\u0027t help grinning when he saw the horse tethered to a bush outside the front door. Grigori was quite the fairy godmother after all, he mused. First he\u0027d provided breakfast, now a ride.\u003c/p\u003e\n\u003cp\u003eTaking up the reins, he hauled himself into the saddle. He dropped the bag containing the stake, mallet, and cleaver over the saddle horn, and turned the horse south, toward the graveyard. Two miles, Grigori had said.\u003c/p\u003e\n\u003cp\u003eIt was surprisingly pleasant, riding across the countryside in the early morning light. The horse seemed a tractable beast, plodding .along at a fairly good clip. He had gone about a quarter of a mile when he passed a farmer walking along the road. The man waved at him, and Edward waved back. Farther on, he passed a woman drawing water from a well. She looked up at him and smiled. He saw a small herd of sheep, another of goats.\u003c/p\u003e\n\u003cp\u003eThe church loomed in the distance, the tall wooden cross on the roof rising like a prayer to the heavens.\u003c/p\u003e\n\u003cp\u003eEdward rode to the rear of the small whitewashed chapel. Dismounting, he tethered the horse to the fence. Lifting his bag from the saddle horn, he made his way through the wrought-iron gates and into the cemetery beyond. A heavy stillness lay over the graveyard, broken only by the sound of his own footsteps.\u003c/p\u003e\n\u003cp\u003eHe felt the hair prickle along the back of his neck as he went on, searching for the sepulcher that held Antoinette\u0027s body.\u003c/p\u003e\n\u003cp\u003eThe crypt was located in the far corner of the cemetery, overgrown with vines. Taking a deep breath, he slung his bag over his shoulder, and then put his hand on the latch.\u003c/p\u003e\n\u003cp\u003eThe door opened with a rusty creak, and he smiled in spite of himself. Perfect, he thought.\u003c/p\u003e\n\u003cp\u003eStanding in the open doorway, he saw Antoinette. She was lying on the floor. A wooden stake had been plunged into her heart. He knew, somehow, that it was the same one she had used on Alexi.\u003c/p\u003e\n\u003cp\u003eHe stared at her for a long time, glad that half of his job had already been done. Left as she was, she would not rise again, but should someone come upon the body and remove the stake... He could not let that happen.\u003c/p\u003e\n\u003cp\u003eTaking-a deep, calming breath, he withdrew the cleaver from his bag. One swift blow would do it. She was a newly made vampire. Unlike older vampires, who did not sleep so deeply, who sometimes awoke when they sensed his presence, she was helpless, vulnerable. Totally immersed in the dark sleep, she would be unfeeling, unaware.\u003c/p\u003e\n\u003cp\u003eBowing his head, he pressed his crucifix to his lips and uttered the ritual prayers that his father had taught him. The ancient words filled him with a sense of power, of peace. He felt the rightness of what he was about to do flow through him, strengthening him.\u003c/p\u003e\n\u003cp\u003eCrossing the floor, he stared down at her for a moment, and then he covered her face with a piece of cloth.\u003c/p\u003e\n\u003cp\u003e\"May your soul find peace,\" he murmured, and lifted the cleaver.\u003c/p\u003e\n\u003cp\u003eGrigori came awake with a strangled cry of pain and grief and knew, in his heart, that Antoinette had been destroyed. As though it were happening to him, he felt the blade sever her jugular. He felt her soul depart her body, glimpsed the joy that would be forever denied him as her spirit was welcomed into paradise, where she would be reunited with their children. Unlike him, Antoinette had not sought the Dark Gift. She had not traded her soul for vengeance. Ever a loyal and devoted wife and mother, she would now reap the eternal blessings of having lived a righteous life.\u003c/p\u003e\n\u003cp\u003eWith a sigh, he stared into the darkness that surrounded him. Tonight, he would go to her grave and bid her and his children a final farewell. \u003c/p\u003e","sourceLink":"https://allnovel.net/shades-of-gray-vampire-trilogy-1/page-20.html","bookId":2296,"creation":"Oct 5, 2019 6:01:06 PM","modification":"Oct 5, 2019 6:01:06 PM"}
