{"id":103036,"no":25,"title":"Page 25","content":"\u003cp\u003e24\u003c/p\u003e\n\u003cp\u003eWe SAT together on the low wall, Fifth Avenue, edge of Central Park.\u003c/p\u003e\n\u003cp\u003eThree nights had passed like this. We had watched.\u003c/p\u003e\n\u003cp\u003eFor as far as we could see uptown the line formed, five and six deep, men and women and children, singing, stamping their feet to keep warm, nuns and priests hurrying back and forth offering hot chocolate and tea to those who were freezing. Fires burned in large drums at intervals of so many feet. As far as the eye could see.\u003c/p\u003e\n\u003cp\u003eAnd downtown, on and on it went, past the glittering displays of Bergdorf Goodman and Henri Bendel, the furriers, the jewelers, the bookstores of midtown, until it wound its way into the cathedral.\u003c/p\u003e\n\u003cp\u003eDavid stood with folded arms, barely leaning on the wall, his ankles crossed. I was the one who sat like a kid, with my knee up, my ravaged one-eyed face upturned, my chin on my knuckled fist, resting my elbow on my knee, just listening to them.\u003c/p\u003e\n\u003cp\u003eFar ahead one could hear screams and shouts. Someone else had no doubt touched a clean napkin to the Veil, and once again the image had been transferred! And so it would be again sometime tomorrow night, and maybe once the night after and how many times nobody knew, except that the icon made the vera-icon out of the cloth touched to it, and the face blazed from cloth to cloth, like flame touched from wick to wick.\u003c/p\u003e\n\u003cp\u003e\"Come on,\" David said. \"We\u0027re getting cold here. Come, let\u0027s walk.\"\u003c/p\u003e\n\u003cp\u003eWe walked.\u003c/p\u003e\n\u003cp\u003e\"Why?\" I asked. \"Up there, to see the same thing we saw last night, and the night before? So that I can struggle to get to her again, knowing that any show of force, any preternatural gift only confirms the entire miracle! She won\u0027t listen to me ever again. You know she won\u0027t. And who is gathered on the steps now, who will immolate himself at dawn to confirm the miracle?\"\u003c/p\u003e\n\u003cp\u003e\"Mael is there.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, yes, the Druid priest, once a priest, always a priest. And so this will be his morning to fall like Lucifer in a blaze.\"\u003c/p\u003e\n\u003cp\u003eLast night it had been some ragged vagabond blood drinker, come from God knows where, unknown to us, but becoming a preternatural torch at dawn for the banks of video cameras and newspaper photographers. The papers were filled with the pictures of the blaze.\u003c/p\u003e\n\u003cp\u003eFilled with the pictures of the Veil itself.\u003c/p\u003e\n\u003cp\u003e\"Here, wait,\" I said. We had come to Central Park South. The crowd here was all singing in concert that old solemn, militant hymn:\u003c/p\u003e\n\u003cp\u003eHoly God, we praise thy Name Lord of All, we bow before thee!\u003c/p\u003e\n\u003cp\u003eI stood staring at them, dazed. The pain in my left eye socket seemed worse but what could be changing there, except that with each passing hour I felt the depth.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re fools, all of you!\" I shouted. \"Christianity is the bloodiest religion that ever existed in the world. I can bear witness!\"\u003c/p\u003e\n\u003cp\u003e\"Hush now, and do as I tell you,\" David said, pulling me along, so that we vanished amongst the ever-shifting people on the icy side-walks before anyone could have turned to look. Over and over he had restrained me this way. He was weary of it. I didn\u0027t blame him.\u003c/p\u003e\n\u003cp\u003eOnce, policemen had laid hands on me.\u003c/p\u003e\n\u003cp\u003eThey had caught me and tried to pull me out of the cathedral as I was trying to talk to her, and then when they had me outside, slowly they had all backed away. They had sensed I wasn\u0027t alive, the way mortals do. They had sensed, and they had muttered about the Veil and the miraculous, and there it had been, my impotence.\u003c/p\u003e\n\u003cp\u003ePolicemen were all over. Policemen everywhere stood on guard to help, to give out the warm tea, to put their pale shivering hands out over the flames in the drums.\u003c/p\u003e\n\u003cp\u003eNobody noticed us. Why should they? We were just two men, drab, part of the crowd, our gleaming skin was nothing much in this blinding whiteness of snow amid these ecstatic pilgrims, wandering from valley to valley of song.\u003c/p\u003e\n\u003cp\u003eThe bookstore windows were piled with Bibles, books on\u003c/p\u003e\n\u003cp\u003eChristology. There was a huge pyramid of a lavender-covered book called Veronica and Her Cloth by Ewa Kuryluk, and another stack of Holy Faces, Secret Places by Ian Wilson.\u003c/p\u003e\n\u003cp\u003ePeople sold pamphlets on the street, or even gave them away. I could hear accents from all parts of the country\u0026amp;iexcl;\u0026amp;ordf;from Texas, and Florida and Georgia and California.\u003c/p\u003e\n\u003cp\u003eBibles, Bibles, Bibles, being sold and given away.\u003c/p\u003e\n\u003cp\u003eA group of nuns gave out holy pictures of St. Veronica. But the hottest items were the color photographs of the Veil itself, snapped in the church by photographers and then reprinted by the thousands.\u003c/p\u003e\n\u003cp\u003e\"Amazing grace, amazing grace....\" sang one group in unison, rocking back and forth as they held their places in line.\u003c/p\u003e\n\u003cp\u003e\"Gloria, in excelsus deum!\" burst from a long-bearded man with his arms outstretched.\u003c/p\u003e\n\u003cp\u003eAs we drew nearer the church, we could see little clusters and crowds engaged in seminars everywhere. In the midst of one, a young man spoke, rapid, sincere:\u003c/p\u003e\n\u003cp\u003e\"In the fourteenth century, she was officially recognized as a saint, Veronica, and it was believed that the Veil was lost during the Fourth Crusade when the Venetians stormed Hagia Sophia.\" He stopped to push his glasses back on his nose. \"Of course the Vatican will take its time to rule on this, as it always does, but seventy-three icons have already been derived from the original icon, and this before the eyes of countless witnesses who are prepared to testify before the Holy See.\"\u003c/p\u003e\n\u003cp\u003eIn another place, there were several dark-clad men, priests perhaps, I couldn\u0027t tell, and around them rings of those listening, eyes squinting against the snow.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not saying the Jesuits cannot come,\" said one of the men. \"I just said that they aren\u0027t coming in here and taking over. Dora has asked that the Franciscans be the custodians of the Veil, if and when it leaves the cathedral.\"\u003c/p\u003e\n\u003cp\u003eAnd behind us, two women rapidly concurred that tests had already been done, the age of the cloth was beyond dispute.\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t even grow that kind of flax anymore in the world; you couldn\u0027t find a new piece of such fabric, the fabric itself in its newness and cleanness is a miracle.\"\u003c/p\u003e\n\u003cp\u003e\"... all bodily fluids, every part of the image, derived from fluids of a human body. They have not had to hurt the Veil to discover this! This is... this....\"\u003c/p\u003e\n\u003cp\u003e\"...enzyme action. But you know how these things get distorted.\"\u003c/p\u003e\n\u003cp\u003e\"No, not The New York Times. The New York Times isn\u0027t going to say that three archaeologists have ruled it authentic.\"\u003c/p\u003e\n\u003cp\u003e\"Not authentic, my friend, just beyond present scientific explanation.\"\u003c/p\u003e\n\u003cp\u003e\"God and the Devil are idiots!\" I said.\u003c/p\u003e\n\u003cp\u003eA group of women turned to stare at me. \"Accept Jesus as your Savior, son,\" said one of the women. \"Go look for yourself at the Veil. He died for our sins.\"\u003c/p\u003e\n\u003cp\u003eDavid pulled me away. No one paid us any mind. The little schools continued far and wide, the clumps of philosophers and witnesses, and those waiting for the spellbound to stumble down the steps from the church, with tears running down their faces.\u0026nbsp;\u0026nbsp;\"I saw it, I saw it, it was the Face of Christ.\" And back against the arch, cleaved to it, like a tall spidery shadow, the figure of the vampire Mael, almost invisible to them perhaps, waiting to step into the light of dawn with his arms outstretched in the form of a cross.\u003c/p\u003e\n\u003cp\u003eOnce again, he looked at us with sly eyes.\u003c/p\u003e\n\u003cp\u003e\"You too!\" he said, under his breath to us, sending his preternatural voice secretly to our ears. \"Come, face the sun, with your arms outstretched! Lestat, God chose you as his Messenger.\"\u003c/p\u003e\n\u003cp\u003e\"Come,\" David said. \"We\u0027ve seen enough for this night and many nights hereafter.\"\u003c/p\u003e\n\u003cp\u003e\"And where do we go?\" I asked. \"Stop, stop pulling my arm. David? Did you hear me?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve stopped,\" he said politely, lowering his voice as if to instruct me to lower mine. The snow fell so softly now. Fire crackled in the nearby black iron drum.\u003c/p\u003e\n\u003cp\u003e\"The books, what happened to them?\" How in God\u0027s name could I have forgotten.\u003c/p\u003e\n\u003cp\u003e\"What books?\" he asked. And he pulled me out of the way of the passersby, against a shopwindow, behind which a little crowd stood, enjoying the private warmth inside, looking towards the church.\u003c/p\u003e\n\u003cp\u003e\"The books of Wynken de Wilde. Roger\u0027s twelve books! What happened to them?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re there,\" he said. \"Up there in the tower. She left them for you. Lestat, I\u0027ve explained this to you. Last night, she spoke to you.\"\u003c/p\u003e\n\u003cp\u003e\"In the presence of all those others, it was impossible to speak the truth.\"\u003c/p\u003e\n\u003cp\u003e\"She told you the relics were yours now.\"\u003c/p\u003e\n\u003cp\u003e\"We have to get the books!\" I said. Oh, what a fool I was to forget those beautiful books.\u003c/p\u003e\n\u003cp\u003e\"Be calm, Lestat, be quiet. Stop making them stare at you. The flat is the same, I told you. She hasn\u0027t told anyone about it. She has surrendered it to us. She will not tell them that we were ever there.\u0026nbsp;\u0026nbsp;She has promised me. She has given the deed to the Orphanage to you, Lestat, don\u0027t you see? She has cut all ties with her former life.\u0026nbsp;\u0026nbsp;Her old religion is dead, abolished. She is reborn, the custodian of the Veil.\"\u003c/p\u003e\n\u003cp\u003e\"But we don\u0027t know!\" I roared. \"We\u0027ll never know. How can she accept it when we don\u0027t know and we can\u0027t know!\" (He pushed me against the wall.) \"I want to go back and get the books,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Of course, we will do this if you wish.\" How tired I was.\u003c/p\u003e\n\u003cp\u003eOn the pavements the people sang: \"And He walks with me, and He talks with me, and lets me call Him by name.\u0027 \"\u003c/p\u003e\n\u003cp\u003eThe apartment was undisturbed.\u003c/p\u003e\n\u003cp\u003eAs far as I could tell, she had never returned. None of us had.\u003c/p\u003e\n\u003cp\u003eDavid had come to check, and David had been telling the truth. All was as it had been.\u003c/p\u003e\n\u003cp\u003eExcept, in the tiny room where I had slept there stood only the chest. My clothes and the blanket on which they\u0027d lain, covered with the same dirt and pine needles from an ancient forest floor, were all gone.\u003c/p\u003e\n\u003cp\u003e\"Did you take them?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" he said. \"I believe she did. They are the tattered relics of the angelic messenger. The Vatican officials have them, as far as I know.\"\u003c/p\u003e\n\u003cp\u003eI laughed. \"And they\u0027ll analyze all that material, the bits of organic matter from the forest floor.\"\u003c/p\u003e\n\u003cp\u003e\"The clothes of the Messenger of God, it was already in the papers,\" he said. \"Lestat, you must come to your senses. You cannot blunder through the mortal world like this. You are a risk to yourself, to others. You are a risk to everything out there. You must contain your power.\"\u003c/p\u003e\n\u003cp\u003e\"Risk? After this, what I\u0027ve done, creating a miracle, like this, a new infusion of blood into the very religion that Memnoch loathed.\u0026nbsp;\u0026nbsp;Oh God!\"\u003c/p\u003e\n\u003cp\u003e\"Ssssshhhh. Quiet,\" he said. \"The chest, there. The books are in the chest.\"\u003c/p\u003e\n\u003cp\u003eAh, so the books had been in this little room, where I had slept. I was consoled, so consoled. I sat there, my legs crossed, rocking back and forth, crying. Oh, this is so weird to cry with one eye! God, are tears coming out of the left eye? I don\u0027t think so. I think he ripped away the ducts, what do you think?\u003c/p\u003e\n\u003cp\u003eDavid stood in the hallway. The light from the distant glass wall made his profile icy and calm.\u003c/p\u003e\n\u003cp\u003eI reached over and opened the lid of the chest. It was made of wood, a Chinese chest, carved deep with many figures. And there were the twelve books, each wrapped as we had wrapped them so carefully, and all padded and safe and dry. I didn\u0027t have to open them to know.\u003c/p\u003e\n\u003cp\u003e\"I want us to leave now,\" David said. \"If you begin crying out again, if you begin trying to tell people again....\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I know how tired you are, my friend,\" I said. \"I\u0027m sorry. I\u0027m so sorry.\" From riot after riot, he\u0027d torn me and dragged me out of the sight of mortal eyes.\u003c/p\u003e\n\u003cp\u003eI thought about those policemen again. I hadn\u0027t even been resisting them. I thought about the way they backed off one by one, as if from something so inherently unwholesome that their molecules told them to do it. Back off.\u003c/p\u003e\n\u003cp\u003eAnd she spoke of a Messenger from God. She was so certain.\u003c/p\u003e\n\u003cp\u003e\"We have to leave it now,\" he said. \"It\u0027s done. Others are coming.\u0026nbsp;\u0026nbsp;I don\u0027t want to see the others. Do you? Do you want to answer the questions of Santino or Pandora or Jesse or whoever might come!\u0026nbsp;\u0026nbsp;What more can we do? I want to leave now.\"\u003c/p\u003e\n\u003cp\u003e\"You believe I was his fool, don\u0027t you?\" I asked, looking up at him.\u003c/p\u003e\n\u003cp\u003e\"Whose fool? God\u0027s or the Devil\u0027s?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s just it,\" I said. \"I don\u0027t know. You tell me what you believe.\"\u003c/p\u003e\n\u003cp\u003e\"I want to go,\" he said, \"because if I do not go now, I will join them this morning on the church steps\u0026amp;iexcl;\u0026amp;ordf;Mael and whoever else is there. And there are others coming. I know them. I see them.\"\u003c/p\u003e\n\u003cp\u003e\"No, you can\u0027t do that! What if every particle of it was a lie! What if Memnoch wasn\u0027t the Devil, and God wasn\u0027t God, and the whole thing was some hideous hoax worked on us by monsters who are no better than we are! You can\u0027t ever think of joining them on the church steps! The earth is what we have! Cling to it! You don\u0027t know.\u0026nbsp;\u0026nbsp;You don\u0027t know about the whirlwind and Hell. You don\u0027t know. Only He knows the rules. Only He is supposed to speak the truth!\u0026nbsp;\u0026nbsp;And Memnoch over and over described Him as if He were Mad, a Moral Idiot.\"\u003c/p\u003e\n\u003cp\u003eHe turned slowly, the light playing with the shadows of his face.\u003c/p\u003e\n\u003cp\u003eSoftly he asked, \"His blood, Lestat, could it truly be inside you?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t start believing it!\" I said. \"Not you! No. Don\u0027t believe. I refuse to play. I refuse to take either side! I brought the Veil back so you and she would believe what I said, that\u0027s all I did, and this, this madness has happened!\"\u003c/p\u003e\n\u003cp\u003eI swooned.\u003c/p\u003e\n\u003cp\u003eI saw the Light of Heaven for an instant, or it seemed I did. I saw Him standing at the balustrade. I smelled that fierce horrid smell that had arisen so often from the earth, from battlefields, from the floors of Hell.\u003c/p\u003e\n\u003cp\u003eDavid knelt beside me, holding me by my arms.\u003c/p\u003e\n\u003cp\u003e\"Look at me, don\u0027t fade out on me now!\" he said. \"I want us to leave here, we\u0027re to go away. You understand? We\u0027ll go back home.\u0026nbsp;\u0026nbsp;And then I want you to tell me the whole story again, dictate it to me, word for word.\"\u003c/p\u003e\n\u003cp\u003e\"For what?\"\u003c/p\u003e\n\u003cp\u003e\"In the words we\u0027ll find the truth, in the details and in the plot we\u0027ll discover who did what for whom. Whether God used you, or Memnoch did! Whether Memnoch was lying the whole time! Whether God....\"\u003c/p\u003e\n\u003cp\u003e\"Ah, it makes your head ache, doesn\u0027t it? I don\u0027t want you to write it down. There will only be a version if you write it down, a version, and there are already so many versions, what has she told them of her night visitors who brought her the Veil, her benign demons who brought her the Veil? And they took my clothes! What if there is tissue from my skin on those clothes?\"\u003c/p\u003e\n\u003cp\u003e\"Come now, take the books, here, I\u0027ll help you, here, there are three sacks here but we need only two, you put this bundle in yours, and I\u0027ll take the other.\"\u003c/p\u003e\n\u003cp\u003eWe obeyed his orders. We had the books in the two sacks. We could go now.\u003c/p\u003e\n\u003cp\u003e\"Why did you leave them here when you sent all the other things back?\"\u003c/p\u003e\n\u003cp\u003e\"She wanted you to have them,\" he said. \"I told you. She wanted me to see that they were put in your hands. And she\u0027s given you all the rest. All ties are cut for her. This is a movement drawing fundamentalist and fanatic, cosmic Christians and Christians from East and West.\"\u003c/p\u003e\n\u003cp\u003e\"I have to try to get near her again.\"\u003c/p\u003e\n\u003cp\u003e\"No. Impossible. Come. Here. I have a heavy coat. You must put this on.\"\u003c/p\u003e\n\u003cp\u003e\"Are you going to care for me forever?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Perhaps.\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t I go to her now in the church and burn up the Veil! I could do it. I could do it with the power of my mind, make the Veil explode.\"\u003c/p\u003e\n\u003cp\u003e\"Then why don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eI shuddered. \"I... I....\"\u003c/p\u003e\n\u003cp\u003e\"Go ahead. You don\u0027t even have to go in the church. Your powers go before you. You could burn it up, maybe. It would be interesting if it didn\u0027t burn, wouldn\u0027t it? But suppose it did, suppose it just went black and burnt up like the wood in a grate when you light it with the telekinetic power of your mind. What then?\"\u003c/p\u003e\n\u003cp\u003eI broke into weeping. I couldn\u0027t do such a thing. I couldn\u0027t do it. I didn\u0027t know for sure! I just didn\u0027t. And if I had been the dupe of God, was that God\u0027s will for all of us?\u003c/p\u003e\n\u003cp\u003e\"Lestat!\" He glared at me, or rather I should say, he fixed me with his authoritative gaze. \"I\u0027m telling you now, listen to what I say.\u0026nbsp;\u0026nbsp;Don\u0027t get that close to them again! Don\u0027t make any more miracles for them. There is nothing more that you can do. Let her tell the tale her way with her angel messenger. It\u0027s passed into history already.\"\u003c/p\u003e\n\u003cp\u003e\"I want to talk one more time to the reporters!\"\u003c/p\u003e\n\u003cp\u003e\"No!\"\u003c/p\u003e\n\u003cp\u003e\"This time I\u0027ll be soft-voiced, I promise, I won\u0027t frighten anyone, I swear I won\u0027t, David.. ..\"\u003c/p\u003e\n\u003cp\u003e\"In time, Lestat, if you still want... in time... .\" He bent down and smoothed my hair. \"Now come with me. We\u0027re going.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/memnoch-the-devil-the-vampire-chronicles-5/page-25.html","bookId":2213,"creation":"Oct 5, 2019 10:19:37 PM","modification":"Oct 5, 2019 10:19:37 PM"}
