{"id":103015,"no":4,"title":"Page 4","content":"\u003cp\u003e3\u003c/p\u003e\n\u003cp\u003eI WALKED on only a few steps, saw revolving doors, pushed into the lobby of someplace or other, a restaurant I think, and found myself sitting at the bar. Just what I wanted, half empty, very dark, too warm, bottles glittering in the center of the circular counter. Some comforting noise from the diners beyond the open doors.\u003c/p\u003e\n\u003cp\u003eI put my elbows on the bar, my heels hooked on the brass rail. I sat there on die stool shivering, listening to mortals talk, listening to nothing, listening to the inevitable sloth and stupidity of a bar, head down, sunglasses gone\u0026amp;iexcl;\u0026amp;ordf;damn, I had lost my violet glasses!\u0026amp;iexcl;\u0026amp;ordf;yes, nice and dark here, very, very dark, a kind of late-night languor lying over everything, a club of some sort? I didn\u0027t know, didn\u0027t care.\u0026nbsp;\u0026nbsp;\"Drink, sir?\" Lazy, arrogant face.\u003c/p\u003e\n\u003cp\u003eI named a mineral water. And as soon as he set down the glass, I dipped my fingers into it and washed them. He was gone already.\u0026nbsp;\u0026nbsp;Wouldn\u0027t have cared if I had started baptizing babies with the water.\u0026nbsp;\u0026nbsp;Other customers were scattered at tables in the darkness ... a woman crying in some far-off corner and a man telling her harshly that she was attracting attention. She wasn\u0027t. Nobody gave a damn.\u0026nbsp;\u0026nbsp;I washed my mouth off with the napkin and water.\u003c/p\u003e\n\u003cp\u003e\"More water,\" I said. I pushed the polluted glass away from me.\u003c/p\u003e\n\u003cp\u003eSluggishly, he acknowledged my request, young blood, bland personality, ambitionless life, then drifted off.\u003c/p\u003e\n\u003cp\u003eI heard a little laugh nearby ...the man to my right, two stools away, perhaps, who\u0027d been there when I came in, youngish, scentless.\u0026nbsp;\u0026nbsp;Utterly scentless, which was most strange.\u003c/p\u003e\n\u003cp\u003eIn annoyance I turned and looked at him.\u003c/p\u003e\n\u003cp\u003e\"Going to run again?\" he whispered. It was the Victim.\u003c/p\u003e\n\u003cp\u003eIt was Roger, sitting there on the stool.\u003c/p\u003e\n\u003cp\u003eHe wasn\u0027t broken or battered or dead. He was complete with his head and his hands. He wasn\u0027t there. He only appeared to be there, very solid and very quiet, and he smiled at me, thrilled by my terror.\u0026nbsp;\u0026nbsp;\"What\u0027s the matter, Lestat?\" he asked in that voice I so loved after six months of listening to it. \"No one in all these centuries has ever come back to haunt you?\"\u003c/p\u003e\n\u003cp\u003eI said nothing. Not there. No, not there. Material, but not the same material as anything else. David\u0027s word. Different fabric. I stiffened. That\u0027s a pathetic understatement. I was rigid with incredulity and rage.\u003c/p\u003e\n\u003cp\u003eHe got up and moved over onto the stool close to me. He was getting more distinct and detailed by the second. Now I could catch something like a sound coming from him, a sound of something alive, or organized, but certainly no breathing human being.\u003c/p\u003e\n\u003cp\u003e\"And in a few minutes more I\u0027ll be strong enough perhaps to ask for a cigarette or a glass of wine,\" he said.\u003c/p\u003e\n\u003cp\u003eHe reached into his coat, a favorite coat, not the one in which I\u0027d killed him, another coat made for him in Paris, that he liked, and he drew out his flashy little gold lighter and made the flame shoot up, very blue and dangerous, butane.\u003c/p\u003e\n\u003cp\u003eHe looked at me. I could see that his black curly hair was combed, his eyes very clear. Handsome Roger. His voice sounded exactly the way it had when he was alive: international, originless, New Orleans-born and world-traveled. No British fastidiousness, and no Southern patience. His precise, quick voice.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m quite serious,\" he said. \"You mean in all these years, not one single victim has ever come back to haunt you?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re amazing. You really won\u0027t tolerate being afraid for a moment, will you?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003eNow he appeared completely solid. I had no idea whether anyone else could see him. No idea, but I suspected they could. He looked like anyone might look. I could see the buttons on his white cuffs, and the soft white flash of his collar at the back of the neck, where the fine hair came down over it. I could see his eyelashes, which had always been extraordinarily long.\u003c/p\u003e\n\u003cp\u003eThe bartender returned and set down the water glass for me, without looking at him. I still wasn\u0027t sure. The kid was too rude for that to be proof of anything except that I was in New York.\u003c/p\u003e\n\u003cp\u003e\"How are you doing this?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"The same way any other ghost does it,\" he said. \"I\u0027m dead. I\u0027ve been dead for over an hour and a half now, and I have to talk to you!\u0026nbsp;\u0026nbsp;I don\u0027t know how long I can stay here, I don\u0027t know when I\u0027ll start to ... God knows what, but you have to listen to me.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\" I demanded.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t be so nasty,\" he whispered, appearing truly hurt. \"You murdered me.\"\u003c/p\u003e\n\u003cp\u003e\"And you? The people you\u0027ve killed, Dora\u0027s mother? She ever come back to demand an audience with you?\"\u003c/p\u003e\n\u003cp\u003e\"Ooh, I knew it. I knew it!\" he said. He was visibly shaken. \"You know about Dora! God in Heaven, take my soul to Hell, but don\u0027t let him hurt Dora.\"\u003c/p\u003e\n\u003cp\u003e\"Stop being absurd. I wouldn\u0027t hurt Dora. It was you I was after.\u0026nbsp;\u0026nbsp;I\u0027ve followed you around the world. If it hadn\u0027t been for a passing respect for Dora, I would have killed you long before now.\"\u003c/p\u003e\n\u003cp\u003eThe bartender had reappeared. This brought the most ecstatic smile to my companion\u0027s lips. He looked right at the kid.\u003c/p\u003e\n\u003cp\u003e\"Yes, my dear boy, let me see, the very last drink unless I\u0027m very badly mistaken, make it bourbon. I grew up in the South. What do you have? No, I\u0027ll tell you what, son, just make it Southern Comfort.\" His laugh was private and convivial and soft.\u003c/p\u003e\n\u003cp\u003eThe bartender moved on, and Roger turned his furious eyes on me. \"You have to listen to me, whatever the Hell you are, vampire, demon, devil, I don\u0027t care, you cannot hurt my daughter.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t intend to hurt her. I would never hurt her. Go on to hell, you\u0027ll feel better. Good night.\"\u003c/p\u003e\n\u003cp\u003e\"You smug son of a bitch. How many years do you think I had?\" Droplets of sweat were breaking out on his face. His hair was moving a little in the natural draft through the room.\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t give less of a damn!\" I said. \"You were a meal worth waiting for.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got quite a swagger, don\u0027t you?\" he said acidly. \"But you\u0027re nothing as shallow as you pretend to be.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, you don\u0027t think so? Try me. You may find me \u0027as sounding brass or a tinkling cymbal.\u0027 \"\u003c/p\u003e\n\u003cp\u003eThat gave him pause.\u003c/p\u003e\n\u003cp\u003eIt gave me pause too. Where did those words come from? Why did they roll off my tongue like that? I was not likely to use that sort of imagery!\u003c/p\u003e\n\u003cp\u003eHe was absorbing all this, my preoccupation, my obvious self-doubt. How did it manifest itself, I wonder? Did I sag or fade slightly as some mortals do, or did I merely look confused?\u003c/p\u003e\n\u003cp\u003eThe bartender gave him the drink. Very tentatively now, he was trying to put his fingers around it and lift it. He managed and got it to his lips and took a taste. He was amazed, and thankful, and suddenly so full of fear that he almost disintegrated. The illusion was almost completely dispersed.\u003c/p\u003e\n\u003cp\u003eBut he held firm. This was so obviously the person I had just killed, hacked to pieces and buried all over Manhattan, that I felt physically sick staring at him. I realized only one thing was saving me from panic. He was talking to me. What had David said once, when he was alive, about talking to me? That he wouldn\u0027t kill a vampire because the vampire could talk to him? And this damned ghost was talking to me.\u003c/p\u003e\n\u003cp\u003e\"I have to talk to you about Dora,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I told you I will never hurt her, or anyone like her,\" I said.\u0026nbsp;\u0026nbsp;\"Look, what are you doing here with me! When you appeared, you didn\u0027t even know that I knew about Dora! You wanted to tell me about Dora?\"\u003c/p\u003e\n\u003cp\u003e\"Depth, I\u0027ve been murdered by a being with depth, how fortunate, someone who actually keenly appreciated my death, no?\" He drank more of the sweet-smelling Southern Comfort. \"This was Janis Joplin\u0027s drink, you know,\" he said, referring to the dead singer whom I, too, had loved. \"Look, listen to me out of curiosity, I don\u0027t give a damn. But listen. Let me talk to you about Dora and about me. I want you to know. I want you to really know who I was, not what you might think. I want you to look out for Dora. And then there\u0027s something back at the flat, something I want you...\"\u003c/p\u003e\n\u003cp\u003e\"Veronica\u0027s veil in the frame?\"\u003c/p\u003e\n\u003cp\u003e\"No! That\u0027s trash. I mean, it\u0027s four centuries old, of course, but it\u0027s a common version of Veronica\u0027s veil, if you have enough money.\u0026nbsp;\u0026nbsp;You did look around my place, didn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Why did you want to give that veil to Dora?\" I asked.\u003c/p\u003e\n\u003cp\u003eThis sobered him appropriately. \"You heard us talking?\"\u003c/p\u003e\n\u003cp\u003e\"Countless times.\"\u003c/p\u003e\n\u003cp\u003eHe was conjecturing, weighing things. He looked entirely reasonable, his dark Asian face evincing nothing but sincerity and great care.\u003c/p\u003e\n\u003cp\u003e\"Did you say \u0027look out for Dora\u0027?\" I asked. \"Is that what you asked me to do? Look out for her? Now that\u0027s another proposition and why the hell do you want to tell me the story of your life! You\u0027re running through your personal afterdeath judgment with the wrong guy! I don\u0027t care how you got the way you were. The things at the flat, why would a ghost care about such things?\"\u003c/p\u003e\n\u003cp\u003eThis was not wholly honest on my part. I was being far too flippant and we both knew it. Of course he cared about his treasures. But it was Dora that had made him rise from the dead.\u003c/p\u003e\n\u003cp\u003eHis hair was a deeper black now, and the coat had taken on more texture. I could see the weave of the silk and the cashmere in it. I could see his fingernails, professionally manicured, very neat and buffed. Same hands I threw in the garbage! I don\u0027t think all these details had been visible moments ago.\u003c/p\u003e\n\u003cp\u003e\"Jesus Christ,\" I whispered.\u003c/p\u003e\n\u003cp\u003eHe laughed. \"You\u0027re more afraid than I am.\"\u003c/p\u003e\n\u003cp\u003e\"Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\" he asked. \"I\u0027m sitting next to you.\u0026nbsp;\u0026nbsp;We\u0027re in a Village bar. What do you mean, where am I? As for my body, you know where you dumped the pieces of it as well as I.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s why you\u0027re haunting me.\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely not. Couldn\u0027t give less of a damn about that body. Felt that way the moment I left it. You know all this!\"\u003c/p\u003e\n\u003cp\u003e\"No, no, I mean, what realm are you in now, what is it, where are you, what did you see when you went... what...\"\u003c/p\u003e\n\u003cp\u003eHe shook his head with the saddest smile.\u003c/p\u003e\n\u003cp\u003e\"You know the answer to all that. I don\u0027t know where I am. Something\u0027s waiting for me, however. I\u0027m fairly certain of that. Something\u0027s waiting. Perhaps it\u0027s merely dissolution. Darkness. But it seems personal. It\u0027s not going to wait forever. But I don\u0027t know how I know.\u003c/p\u003e\n\u003cp\u003e\"And I don\u0027t know why I\u0027m being allowed to get through to you, whether it\u0027s sheer will, my will, I mean, of which I have a great deal by the way, or whether it\u0027s some sort of grant of moments, I don\u0027t know! But I went after you-1 followed you from the flat and back to it and then out with the body and I came here and I have to talk to you.\u0026nbsp;\u0026nbsp;I\u0027m not going to go without a struggle, until I\u0027ve spoken with you.\"\u003c/p\u003e\n\u003cp\u003e\"Something\u0027s waiting for you,\" I whispered. This was awe. Plain and simple. \"And then, after we\u0027ve had our chat, if you don\u0027t dissolve, where exactly are you going to go?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head and glared at the bottle on the center rack, flood of light, color, labels.\u003c/p\u003e\n\u003cp\u003e\"Tiresome,\" he said crossly. \"Shut up.\"\u003c/p\u003e\n\u003cp\u003eIt had a sting to it. Shut up. Telling me to shut up.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t go looking out for your daughter,\" I said.\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\" He threw an angry glance at me, and took another sip of his drink, then gestured to the bartender for another.\u003c/p\u003e\n\u003cp\u003e\"Are you going to get drunk?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think I can. You have to look out for her. It\u0027s all going to go public, don\u0027t you see? I have enemies who\u0027ll kill her, for no other reason than that she was my child. You don\u0027t know how careful I\u0027ve been, and you don\u0027t know how rash she is, how much she believes in Divine Providence. And then there\u0027s the government, the hounds of government, and my things, my relics, my books!\"\u003c/p\u003e\n\u003cp\u003eI was fascinated. For about three seconds, I\u0027d utterly forgotten that he was a ghost. Now my eyes gave me no evidence of it. None.\u0026nbsp;\u0026nbsp;But he was scentless, and the faint sound of life that emanated from him still had little to do with real lungs or a real heart.\u003c/p\u003e\n\u003cp\u003e\"All right, let me be blunt,\" he said. \"I\u0027m afraid for her. She has to get through the notoriety; enough time has to pass that my enemies forget about her. Most of them don\u0027t know about her. But somebody might. Somebody\u0027s bound to know, if you knew.\"\u003c/p\u003e\n\u003cp\u003e\"Not necessarily. I\u0027m not a human being.\"\u003c/p\u003e\n\u003cp\u003e\"You have to guard her.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t do such a thing. I won\u0027t\"\u003c/p\u003e\n\u003cp\u003e\"Lestat, will you listen to me?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to listen. I want you to go.\"\u003c/p\u003e\n\u003cp\u003e\"I know you do.\"\u003c/p\u003e\n\u003cp\u003e\"Look, I never meant to kill you, I\u0027m sorry, it was all a mistake, I should have picked someone. ...\" My hands were shaking. Oh, how fascinating all this would sound later, and right now I begged God, of all people, please make this stop, all of it, stop.\u003c/p\u003e\n\u003cp\u003e\"You know where I was born, don\u0027t you?\" he asked. \"You know that block of St. Charles near Jackson?\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"The boardinghouse,\" I said. \"Don\u0027t tell me the story of your life. There\u0027s no reason. Besides, it\u0027s over. You had your chance to write it down when you were alive, just like anyone else.\u0026nbsp;\u0026nbsp;What do you expect me to do with it?\"\u003c/p\u003e\n\u003cp\u003e\"I want to tell you the things that count. Look at me! Look at me, please, try to understand me and to love me and to love Dora for me!\u0026nbsp;\u0026nbsp;I\u0027m begging you.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t have to see his expression to understand this keen agony, this protective cry. Is there anything under God that can be done to us that will make us suffer as badly as seeing our child suffer? Our loved ones? Those closest to us? Dora, tiny Dora walking in the empty convent. Dora on a television screen, arms flung out, singing.\u003c/p\u003e\n\u003cp\u003eI must have gasped. I don\u0027t know. Shivered. Something. I couldn\u0027t clearing head for a moment, but it was nothing supernatural, only misery, and the realization that he was there, palpable, visible, expecting something from me, that he had come across, that he had survived long enough in this ephemeral form to demand a promise of me.\u003c/p\u003e\n\u003cp\u003e\"You do love me,\" he whispered. He looked serene and intrigued.\u003c/p\u003e\n\u003cp\u003eWay beyond flattery, Way beyond me.\u003c/p\u003e\n\u003cp\u003e\"Passion,\" I whispered. \"It was your passion.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I know. I\u0027m flattered. I wasn\u0027t run down by a truck in the street, or shot by a hit man. You killed me! You, arid you must be one of the best of them.\"\u003c/p\u003e\n\u003cp\u003e\"Best of what?\"\u003c/p\u003e\n\u003cp\u003e\"Whatever you call yourself. You\u0027re not human. Yet you are. You sucked my blood out of my body, took it into your own. You\u0027re thriving on it now. Surely you\u0027re not the only one.\" He looked away.\u0026nbsp;\u0026nbsp;\"Vampires,\" he said. \"I saw ghosts when I was a boy in our house in New Orleans.\"\u003c/p\u003e\n\u003cp\u003e\"Everybody in New Orleans sees ghosts.\"\u003c/p\u003e\n\u003cp\u003eHe laughed in spite of himself, a very short, quiet laugh. \"I know,\" he said, \"but really I did and I have, and I\u0027ve seen them in other places. But I never believed in God or the Devil or Angels or Vampires or Werewolves, or things like that, things that\u0026nbsp;\u0026nbsp;could affect fate, or change the course of some chaotic-seeming rhythm that governed the universe.\"\u003c/p\u003e\n\u003cp\u003e\"You believe in God now?\"\u003c/p\u003e\n\u003cp\u003e\"No. I have the sneaking suspicion that I\u0027ll hold firm as long as I can in this form\u0026amp;iexcl;\u0026amp;ordf;like all the ghosts I\u0027ve ever glimpsed\u0026amp;iexcl;\u0026amp;ordf;then I\u0027ll start to fade. I\u0027ll die out. Rather like a light. That\u0027s what\u0027s waiting for me. Oblivion, And it isn\u0027t personal. It just feels that way because my mind, what\u0027s left of it, what\u0027s clinging to the earth here, can\u0027t comprehend anything else. What do you think?\"\u003c/p\u003e\n\u003cp\u003e\"It terrifies me either way or any way.\" I was not going to tell him about the Stalker. I was not going to ask him about the statue. I knew now he had had nothing to do with the statue seeming animate. He had been dead, going up.\u003c/p\u003e\n\u003cp\u003e\"Terrifies you?\" he asked respectfully. \"Well, it\u0027s not happening to you. You make it happen to others. Let me explain about Dora.\" \"She\u0027s beautiful. I\u0027ll. ,. I\u0027ll try to look out for her.\"\u003c/p\u003e\n\u003cp\u003e\"No, she needs something more from you. She needs a miracle.\"\u003c/p\u003e\n\u003cp\u003e\"A miracle?\"\u003c/p\u003e\n\u003cp\u003e\"Look, you\u0027re alive, whatever you are, but you\u0027re not human. You can make a miracle, can\u0027t you? You could do this for Dora, it would be no problem for a creature of your abilities at all!\"\u003c/p\u003e\n\u003cp\u003e\"You mean some sort of fake religious miracle?\"\u003c/p\u003e\n\u003cp\u003e\"What else? She\u0027s never going to save the world without a miracle and she knows it. You could do it!\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re remaining earthbound and haunting me in this place to make a sleazy proposition like this!\" I said. \"You\u0027re unsalvageable.\u0026nbsp;\u0026nbsp;You are dead. But you\u0027re still a racketeer and a criminal. Listen to yourself. You want me to fake some spectacle for Dora? You think Dora would want that?\"\u003c/p\u003e\n\u003cp\u003eHe was flabbergasted, clearly. Much too much so to be insulted.\u003c/p\u003e\n\u003cp\u003eHe put the glass down and sat there, composed and calm, appearing to scan the bar. Looking dignified and about ten years younger than he had been when I killed him. I don\u0027t guess anyone wants to come back as a ghost except in beautiful form. It was only natural.\u0026nbsp;\u0026nbsp;And I felt a deepening of my inevitable and fatal fascination, this, my Victim. Monsieur, your blood is inside me!\u003c/p\u003e\n\u003cp\u003eHe turned.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right,\" he said in the most torn whisper. \"You\u0027re absolutely right. I can\u0027t make some deal with you to fake miracles for her. It\u0027s monstrous. She\u0027d hate it.\"\u003c/p\u003e\n\u003cp\u003e\"Now you\u0027re talking like the Grateful Dead,\" I said.\u003c/p\u003e\n\u003cp\u003eHe gave another lithe contemptuous laugh. Then with a low sombre emotion, he said, \"Lestat, you have to take care of her ... for a while,\"\u003c/p\u003e\n\u003cp\u003eWhen I didn\u0027t answer, he persisted gently: \"Just for a little while, until the reporters have stopped, and the horror of it is over; until her faith is restored, and she\u0027s whole and Dora after all, and back to her life. She has her life, yet, She can\u0027t be hurt because of me, Lestat, not because of me, it\u0027s not fair.\"\u003c/p\u003e\n\u003cp\u003e\"Fair?\"\u003c/p\u003e\n\u003cp\u003e\"Call me by my name,\" he said. \"Look at me.\"\u003c/p\u003e\n\u003cp\u003eI looked at him. It was exquisitely painful. He was miserable. I didn\u0027t know whether human beings could express this same intensity of misery. I actually didn\u0027t know.\u003c/p\u003e\n\u003cp\u003e\"My name\u0027s Roger,\" he said. He seemed even younger now, as though he were traveling backwards in time, in his mind, or merely becoming innocent, as if the dead, if they are going to stick around, have a right to remember their innocence.\u003c/p\u003e\n\u003cp\u003e\"I know your name,\" I said. \"I know everything about you, Roger.\u003c/p\u003e\n\u003cp\u003eRoger, the Ghost. And you never let Old Captain touch you; you just let him adore you, and educate you, and take you places, and buy you beautiful things, and you never even had the decency to go to bed with him.\"\u003c/p\u003e\n\u003cp\u003eI said those things, about the images I\u0027d drunk with his blood, but without malice. I was just talking in wonder of how bad we all are, the lies we tell.\u003c/p\u003e\n\u003cp\u003eHe said nothing for the moment.\u003c/p\u003e\n\u003cp\u003eI was overwhelmed. It was grief veritably blinding me, and bitterness and a deep ugly horror for what I had done to him, and to others, and that I had ever harmed any living creature. Horror.\u003c/p\u003e\n\u003cp\u003eWhat was Dora\u0027s message? How were we to be saved? Was it the same old canticle of adoration?\u003c/p\u003e\n\u003cp\u003eHe watched me. He was young, committed, a magnificent semblance of life. Roger.\u003c/p\u003e\n\u003cp\u003e\"All right,\" he said, the voice soft and patient, \"I didn\u0027t sleep with Old Captain, you\u0027re right, but he never really wanted that of me, you see, it wasn\u0027t like that, he was far too old. You don\u0027t know what it was really like. You might know the guilt I feel. But you don\u0027t know later how much I regretted not having done it. Not having known that with Old Captain. And that\u0027s not what made me go wrong. It wasn\u0027t that. It wasn\u0027t the big deception or heist that you imagine it to be. I loved the things he showed me. He loved me. He lived two, three more years, probably because of me. Wynken de Wilde, we loved Wynken de Wilde together. It should have turned out different. I was with Old Captain when he died, you know. I never left the room.\u0026nbsp;\u0026nbsp;I\u0027m faithful that way when I am needed by those I loved.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, you were with your wife, Terry, too, weren\u0027t you?\" It was cruel of me to say this, but I\u0027d spoken without thinking, seeing her face again as he shot her. \"Scratch that, if you will,\" I said. \"I\u0027m sorry. Who in the name of God is Wynken de Wilde?\"\u003c/p\u003e\n\u003cp\u003eI felt so utterly miserable. \"Dear God, you\u0027re haunting me,\" I said. \"And I\u0027m a coward in my soul! A coward. Why did you say that strange name? I don\u0027t want to know. No, don\u0027t tell me\u0026amp;iexcl;\u0026amp;ordf;This is enough for me. I\u0027m leaving. You can haunt this bar till doomsday if you want. Get some righteous individual to talk to you.\"\u003c/p\u003e\n\u003cp\u003e\"Listen to me,\" he said. \"You love me. You picked me. All I want to do is fill in the details.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll take care of Dora, somehow or other, I\u0027ll figure some way to help her, I\u0027ll do something. And I\u0027ll take care of all the relics, I\u0027ll get them out of there and into a safe place and hold on to them for Dora, until she feels she can accept them.\"\u003c/p\u003e\n\u003cp\u003e\"Yes!\"\u003c/p\u003e\n\u003cp\u003e\"Okay, let me go.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not holding you,\" he said.\u003c/p\u003e\n\u003cp\u003eYes, I did love him. I did want to look at him. I did want him to tell me everything, every last little detail! I reached out and touched his hand. Not alive. Not human flesh. Something with vitality, however.\u0026nbsp;\u0026nbsp;Something burning and exciting.\u003c/p\u003e\n\u003cp\u003eHe merely smiled.\u003c/p\u003e\n\u003cp\u003eHe reached across with his right hand and clamped his fingers around my right wrist and drew near. I could feel his hair touching my forehead, teasing my skin, just a loose wisp of hair. Big dark eyes looking at me.\u003c/p\u003e\n\u003cp\u003e\"Listen to me,\" he said again. Scentless breath.\u003c/p\u003e\n\u003cp\u003e\"Yes... .\"\u003c/p\u003e\n\u003cp\u003eHe started talking to me in a low, rushed voice. He began to tell me the tale. \u003c/p\u003e","sourceLink":"https://allnovel.net/memnoch-the-devil-the-vampire-chronicles-5/page-4.html","bookId":2213,"creation":"Oct 5, 2019 10:19:37 PM","modification":"Oct 5, 2019 10:19:37 PM"}
