{"id":91659,"no":8,"title":"Page 8","content":"\u003cp\u003e\"That will leave only four here at the farmhouse, excluding yourself,\" the angry assassin reasoned. Ghost did not understand the problem.\u003c/p\u003e\n\u003cp\u003e\"If we are forced to maintain a continual guard over the girl-\"\u003c/p\u003e\n\u003cp\u003e\"The girl?\" Ghost didn\u0027t mean to sound so startled.\u003c/p\u003e\n\u003cp\u003eThe assassin, and several others, cocked an eye curiously. \"The girl that Mishalak died for,\" he said contemptuously. Ghost saw a problem building, and he scowled immediately to force the upstart back on the defensive.\u003c/p\u003e\n\u003cp\u003e\"I do not question your decision to let her live,\" the assassin quickly explained. \"Nor do I deny that Mishalak deserved death for drawing a weapon against you, the task-master. But if only four of us remain to guard the farmhouse, then the girl becomes a threat.\"\u003c/p\u003e\n\u003cp\u003eIt all made perfect sense to the cunning impersonator. Vander\u0027s soft heart had caused problems before now. Oftentimes the firbolg was too intent on honor, placing the foolish notion above his duty. Ghost spent a moment considering how he might punish the giant, then smiled widely as a typically fiendish idea came into his head.\u003c/p\u003e\n\u003cp\u003e\"You are correct,\" he said to the assassin. \"It is time for you to end that threat.\" The man nodded eagerly, and Ghost\u0027s smile widened, the wicked man thinking how furious Vander would become, and how helpless, impotenf, \\knder would be. The proud firbolg would hate that most of all.\u003c/p\u003e\n\u003cp\u003e\"End that threat this night,\" Ghost purred, \"but, first, you and your friends might have your way with her.\" All about the ring, the evil assassins smiled. \"We cannot survive on duty alone!\"\u003c/p\u003e\n\u003cp\u003eThat brought a cheer from the group.\u003c/p\u003e\n\u003cp\u003e\"Go for the mountains this night as well,\" Ghost continued. \"I do not know how many days away this Lady Maupoissant is from Carradoon, but she cannot be allowed to enter the town.\"\u003c/p\u003e\n\u003cp\u003e\"Maupoissant?\" one of the assassins, an older killer with salt and pepper hair, piped in.\u003c/p\u003e\n\u003cp\u003e\"You know the name?\"\u003c/p\u003e\n\u003cp\u003e\"Nearly a decade ago, we killed a wainwright by that name,\" the man admitted, \"a wagon maker and his wife. And we were paid handsomely for the task, I must say.\"\u003c/p\u003e\n\u003cp\u003e\"The name is unusual and she is, by my informant\u0027s words, from Westgate,\" Ghost reasoned. \"There could be a connection.\"\u003c/p\u003e\n\u003cp\u003e\"Good,\" said the man, drawing a dagger and running the flat of the blade slowly along his bony cheek. \"I always like to keep it in the family.\"\u003c/p\u003e\n\u003cp\u003eThe nineteen Night Masks were pleased to see their unpredictable firbolg taskmaster joining in the laughter, the giant\u0027s heartfelt roars smothering their own. They were nervous; the time to kill was drawing near, and adding this \"Lady Maupoissant\" to the victim list was akin to smearing icing on an already delicious cake.\u003c/p\u003e\n\u003cp\u003eProfessionals\u003c/p\u003e\n\u003cp\u003ehat time is it?\" Ivan asked, rolling out of V W j his blankets and giving a profound stretch.\u003c/p\u003e\n\u003cp\u003eis hours past the dawn,\" Danica an-\u003c/p\u003e\n\u003cp\u003eswered sharply, privately berating herself T W for being foolish enough to take the last watch.\u003c/p\u003e\n\u003cp\u003e\"Ye should\u0027ve woked me up,\" Ivan complained. He started to sit, then changed his mind and fell back into the bedroll in a heap.\u003c/p\u003e\n\u003cp\u003e\"I have,\" Danica muttered, though the dwarf was no longer listening. \"Six times!\u003c/p\u003e\n\u003cp\u003e\"But not again,\" the fiery woman whispered. This time she was prepared. She took up two small buckets, filled with the icy cold water of a nearby mountain stream. Stealthily, she slipped up to the dwarves, their bedrolls having merged from their typically wild slumber during the night into a single large tangle. Danica sorted out the mess and moved the blankets aside enough to reveal the backs of hairy necks.\u003c/p\u003e\n\u003cp\u003ePikel\u0027s presented the most problem, since the dwarf wore his beard pulled back over his ears and braided with his long hair (which he had recently redyed forest green) halfway down his back. Gently Danica moved the tousle aside, drawing a semiconscious \"Hee hee,\" from the snoozing dwarf, and lifted one of the buckets.\u003c/p\u003e\n\u003cp\u003eThe next thunderous roars resounding from the camp sent animals for nearly a mile around scurrying for cover. Even a fat black bear, out to catch some morning sunshine, raced through a tangle and up the side of a thick oak, sniffing the air nervously, fearfully.\u003c/p\u003e\n\u003cp\u003eThe dwarves ran about in circles, crashed into each other several times, and threw their blankets into the air.\u003c/p\u003e\n\u003cp\u003e\"Me weapon!\" Ivan cried in distress.\u003c/p\u003e\n\u003cp\u003e\"Oo oi!\" Pikel wholeheartedly agreed, unable to locate his tree-trunk club.\u003c/p\u003e\n\u003cp\u003eIvan canned first, noticing Danica standing next to a tree, her arms folded across her chest and her grin spreading from ear to ear. The dwarf stopped his running altogether and regarded her with dart-throwing eyes.\u003c/p\u003e\n\u003cp\u003eHe should have looked out for his brother instead.\u003c/p\u003e\n\u003cp\u003ePikel hit him broadside, and the two flew away into some brambles. By the time they extricated themselves and had stomped back into the camp, their beards were thrown wildly about and their nightshirts seemed almost furry with burrs.\u003c/p\u003e\n\u003cp\u003e\"Yerself did that to us!\" Ivan shouted accusingly at Danica.\u003c/p\u003e\n\u003cp\u003e\"I wish to be in Carradoon no later than tomorrow,\" the woman replied just as angrily. \"I welcomed your company, but did not know it would mean holding camp until after noon each day! I thought dwarves were industrious!\"\u003c/p\u003e\n\u003cp\u003e\"Oooo\" Pikel moaned, ashamed of his perceived laziness.\u003c/p\u003e\n\u003cp\u003e\"Not our fault,\" Ivan muttered, also on the defensive. \"It\u0027s the ground,\" he blurted. \"Yeah, the ground. Too hard and comfortable for a dwarf to want to get himself up in the morning!\"\u003c/p\u003e\n\u003cp\u003e\"You have forfeited breakfast,\" Danica scolded.\u003c/p\u003e\n\u003cp\u003e\"When halflings shave their feet!\" Ivan roared, and Danica suspected - correctly - that she was overstepping her bounds. Throwing ice-cold water down the backs of sleeping dwarves was one thing, but denying them food was something altogether different, something downright dangerous.\u003c/p\u003e\n\u003cp\u003e\"A quick meal then,\" she conceded, \"then we are off.\"\u003c/p\u003e\n\u003cp\u003eSixteen trout, four tankards of ale (each), half a sack of biscuits and three bowls of berries (each) later, the dwar-ven brothers gathered their belongings and skipped off down the mountain trails behind Danica. Impresk Lake was clearly visible whenever they came to an open ridge, and Carradoon soon came into sight as well, far below.\u003c/p\u003e\n\u003cp\u003eDespite Danica\u0027s desire for haste, the trio took all caution in their trek. The Snowflake Mountains were a dangerous place, even in their southern reaches, where the charges of the Edificant Library dominated the region. With war brewing in the north and battles continuing back to the west, in Shilmista, the companions had to assume that the trails would now be even more dangerous.\u003c/p\u003e\n\u003cp\u003eDanica led the way, bending low to inspect every track, every bent blade of grass. Ivan and Pikel bobbed along behind her, Ivan in his deer-antlered helmet and Pikel wearing a many-dented cooking pot for lack of any true headgear. Even though Danica continually searched the ground as she traveled, the speedy monk had little trouble outpacing the dwarves and forced them to scurry along just to keep up.\u003c/p\u003e\n\u003cp\u003eDanica slowed considerably; Ivan and Pikel nearly ran her down. \"Uh-oh,\" Pikel muttered, seeing Danica\u0027s curious expression.\u003c/p\u003e\n\u003cp\u003e\"What\u0027d ye find?\" Ivan asked quietly, pulling his brother along behind him.\u003c/p\u003e\n\u003cp\u003eDanica shook her head, unsure. \"Someone has passed this way,\" she declared.\u003c/p\u003e\n\u003cp\u003e\"Avery and Rufo,\" Ivan replied.\u003c/p\u003e\n\u003cp\u003e\"More recently,\" Danica said, standing straight again and taking a long, hard look at the nearby brush.\u003c/p\u003e\n\u003cp\u003e\"Coming or going?\" Ivan pressed.\u003c/p\u003e\n\u003cp\u003eDanica shook her head, unable to decide. She was confident that her guess had been correct, but what bothered her was the nature of the tracks, the scratching marks made over the apparent boot prints. If someone had crossed this trail earlier that morning, then they had gone to great lengths to conceal their tracks.\u003c/p\u003e\n\u003cp\u003eIvan looked down at the unremarkable ground and, scratching confusedly at his yellow beard, produced yet another stubborn burr. \"I don\u0027t see tracks,\" he huffed.\u003c/p\u003e\n\u003cp\u003eDanica pointed out a slight depression in the ground, barely visible, then indicated the pattern that made her believe that brush had been scraped over the ground.\u003c/p\u003e\n\u003cp\u003eIvan snorted in disbelief. \"That all ye got to go on?\" he asked loudly, no longer afraid of the volume of his voice.\u003c/p\u003e\n\u003cp\u003eDanica didn\u0027t even try to hush him. She remained confident ofher guess; she could hope only that some ranger, or one of Elbereth\u0027s elven kin, perhaps, was in the region. If not a ranger or an elf, then Danica felt certain that these tracks had been made by someone intent on concealing himself.\u003c/p\u003e\n\u003cp\u003eIn the wilds of the mountains, that rarely boded well for travelers.\u003c/p\u003e\n\u003cp\u003eA few hundred yards down the trail, Danica found further signs of passage. This time even Ivan could not discount the obvious boot print in the soft trail, though half of it had been just as obviously brushed away.\u003c/p\u003e\n\u003cp\u003eThe dwarf put his hands on his hips and looked about, focusing on the crook of a low branch hanging over the trail.\u003c/p\u003e\n\u003cp\u003e\"I seen some rocks aside the trail just a dozen yards back,\" the dwarf began.\u003c/p\u003e\n\u003cp\u003e\"Uh-oh,\" muttered Pikel, suspecting what his brother was getting at.\u003c/p\u003e\n\u003cp\u003e\"Got some big enough trees hanging over the trail,\" Ivan continued, not hearing Pikel\u0027s flustered sigh. He looked at Danica, who seemed not to understand.\u003c/p\u003e\n\u003cp\u003e\"Could set us a trap,\" Ivan spouted. \"Could haul a rock up one of them trees and - \" Pike) slapped him across the back of the head.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve tried that before,\" Danica reasoned from the sour look on Pikel\u0027s face.\u003c/p\u003e\n\u003cp\u003ePikel groaned and Ivan glared at him, but the yellow-bearded dwarf took no retribution against his brother. They had indeed tried that trap before. Although Ivan stubbornly, if with little real conviction, insisted that it had been a success (they had clobbered an ore with the rock), Pikel just as stubbornly insisted that the meager kill had hardly been worth the terrific effort of putting the rock in the tree in the first place.\u003c/p\u003e\n\u003cp\u003eKnowing that this time there would be another witness, Ivan would have conceded the point and gone along without further mention of the trap and Pikel\u0027s assault - it was only a slap, after all - but then, without explanation, Pikel whipped his club up in front of Ivan\u0027s face. To Danica, standing to the side, it seemed clear that Pike! tried to halt the weapon\u0027s momentum short of Ivan, but the club still connected with Ivan\u0027s great nose. It knocked him back several steps and sent a stream of warm blood flowing over the dwarfs hairy lip.\u003c/p\u003e\n\u003cp\u003e\"What\u0027d ye . . .\" Ivan stammered, hardly believing the attack. He took up his double-bladed axe, snarled, and stepped toward his frantically squeaking brother.\u003c/p\u003e\n\u003cp\u003ePikel couldn\u0027t explain the action to either Ivan or Danica, but he did manage to turn his fat club around in time, revealing a heavy dart buried halfway into the hard wood.\u003c/p\u003e\n\u003cp\u003eNow came Ivan\u0027s turn to do his brother a good deed. Looking to the thick bushes past Pikel, to where his warrior instincts immediately told him the dart had come from, he saw a crossbow leveled Pikel\u0027s way.\u003c/p\u003e\n\u003cp\u003eA tall form fell from a branch to land softly behind Danica.\u003c/p\u003e\n\u003cp\u003eIvan\u0027s pointing finger made Pikel turn about.\u003c/p\u003e\n\u003cp\u003e\"Uh-oh\" the green-bearded dwarf squeaked, knowing he had no time to get out of harm\u0027s way.\u003c/p\u003e\n\u003cp\u003eIvan hit him just before the quarrel, though, taking him down in a perfect tackle as the bolt flew harmlessly past. Ivan did not relent. As he rolled, he heaved Pikel right over him, and Pikel understood the tactic, likewise heaving Ivan back over him. Like a rolling boulder the dwarven brothers barreled into the brush, forcefully enough to tangle the two men concealed there.\u003c/p\u003e\n\u003cp\u003eThe Night Mask behind Danica, his sword bared and held high, had no reason to believe that the woman, intent on the spectacle of the dwarves, even knew that she was about to die. His surprise was complete when Danica snapped into a bend at her waist, her leg shooting out behind her, high enough to connect on the man\u0027s chest.\u003c/p\u003e\n\u003cp\u003eHe flew back several feet, slamming into a tree trunk heavily, but managed to regain his dropped sword. More wary, he began backing away defensively, step for step with the dangerous woman\u0027s approach.\u003c/p\u003e\n\u003cp\u003eDanica broke into a run and came in hard and fast, but skidded suddenly to her knees and dipped her head as another form appeared from behind the trunk and launched a shoulder-high swipe at her with a short, slender staff. The weapon banged hard against the tree, spitting flakes of bark.\u003c/p\u003e\n\u003cp\u003eDanica slipped one foot back under her and kicked out with the other, thinking to break this second enemy\u0027s knee. He got his staff down in time to deflect the attack, though, then countered with several sharp and furious thrusts.\u003c/p\u003e\n\u003cp\u003eThe young monk knew at once that she was in trouble. These were not ordinary highwaymen, though their dress seemed ordinary enough. She managed to fall out of the way as the other\u0027s sword flashed at her skull, but took a hit on the hip from the fast-flying staff.\u003c/p\u003e\n\u003cp\u003eThen she was up in a crouch a few feet away from the two men, taking careful measure of their tempered approach, looking for an opening where there seemed to be none.\u003c/p\u003e\n\u003cp\u003eIvan bit down hard, and continued to bite, until he realized from the steady stream of \"Ooooo\u0027s\" that it was Pi-kel\u0027s calf, not an enemy\u0027s, in his mouth.\u003c/p\u003e\n\u003cp\u003eThe dwarf scrambled to gain his footing in the tight quarters, branches and brambles grabbing at him with every move, and the nearest man landing no less than three punches on his already wounded nose.\u003c/p\u003e\n\u003cp\u003eThen Ivan was up, as was Pikel, with weapons ready. Ivan launched a vicious swipe with his axe, but his arm slipped through another thin but tough branch, shortening his reach so that he never got dose to hitting the man.\u003c/p\u003e\n\u003cp\u003ePikel yelped in terror and dove aside as his brother followed through, the wild flying axe nearly connecting. Again, albeit unintentionally, Ivan had saved his brother\u0027s life, for as Pikel leaped aside, another crossbow bolt soared in, cutting the air between the dwarves with a sizzling sound and thudding heavily into the shoulder of the man facing Ivan.\u003c/p\u003e\n\u003cp\u003eBoth brothers paused long enough to took behind them to the crossbowman, who was frantically recocking the weapon. Pikel went back at his attacker, who had finally extricated himself from the brush tangle, and Ivan turned to where his closest enemy had been standing.\u003c/p\u003e\n\u003cp\u003eThe man was not to be seen, and Ivan suspected from the still-shaking bushes that he had been laid out fiat. Not to argue with good fortune, the dwarf howled and bolted back the other way, crunching out of the brambles to find the clear path leading to the crossbowman.\u003c/p\u003e\n\u003cp\u003eThe swordsman was wounded; that was something at least. Danica\u0027s kick apparently had done some damage, for he winced with every circling step he took. Danica had already come to the conclusion that the staff-wieWer was the more formidable of the two, though. His salt-and-pepper hair showed experience, and the perfect balance of his measured strides made her realize that this one had spent his lifetime training in the fighting arts. His staff seemed puny compared to the other\u0027s sword, but in his hands it was a deadly weapon indeed.\u003c/p\u003e\n\u003cp\u003eA sword cut sent the woman low; the staff clipped her shoulder and she had to dive over backward, rolling back to her feet just in time to prevent a killing follow-up attack.\u003c/p\u003e\n\u003cp\u003eDanica had used the roll to her advantage. Crouched in a ball on the way over, the monk had slipped one of her crystal-bladed daggers from her boot sheath.\u003c/p\u003e\n\u003cp\u003eThe swordsman came on again, seeming more confident.\u003c/p\u003e\n\u003cp\u003eDanica planted her right foot out in front of her and pivoted on it, launching her left foot high and wide behind her as she twirled. She knew that her circle-kick attack would have no more effect than to force the swordsman\u0027s blade out wide, and knew, too, that she had left herself vulnerable to the other attacker. She threw her supporting leg out from under her and completed her circuit as she crashed down to the ground, hearing the whiz of the staff as it flew inches above her head.\u003c/p\u003e\n\u003cp\u003eDanica broke her fall with one arm and kept her torso high enough from the ground for her to snap her other arm underneath her, releasing the dagger. Its short flight ended in the swordsman\u0027s belly, and he fell back, eyes wide in disbelief and mouth wide in a silent scream.\u003c/p\u003e\n\u003cp\u003eThe staff-wielder laughed and congratulated Danica for the cunning move, then came on relentlessly.\u003c/p\u003e\n\u003cp\u003ePikel\u0027s attacker, too, wielded a club, but he faced two serious disadvantages. First, Pikel\u0027s club was much larger than his, and, second, he couldn\u0027t possibly hit the thick-skinned and thicker-headed dwarf hard enough with a blunt weapon to do any serious damage. Lightning fast, he smacked Pikel twice on the shoulder and once on the pot helmet, which rang loudly.\u003c/p\u003e\n\u003cp\u003ePikel hardly cared, accepting the three hits for the one he returned. His tree-trunk club caught the man\u0027s exposed side and sent him flying from the brush to roll hard against the base of a tree.\u003c/p\u003e\n\u003cp\u003eThe man\u0027s face could not have reflected a greater terror if he had been tied to a stake in the path of a horse stampede when Pikel came rushing out in pursuit, his pot all the way down over his face, but his club leveled perfectly to squash the man between the tree and its thick end.\u003c/p\u003e\n\u003cp\u003eThe man rolled aside and Pikel slammed in, snapping the young tree down and going headlong over its broken trunk.\u003c/p\u003e\n\u003cp\u003e\"Oo,\" the dwarf grunted as he skidded to a stop along the felled tree\u0027s rough bark. Then came that loud ring again as his stubborn attacker rushed back in and planted a two-hander on the top of his helmet.\u003c/p\u003e\n\u003cp\u003eIvan realized he would not get to the crossbowman before the man had the weapon readied, so he hoisted his axe above his head in both hands and roared, \"Time to die, ye thieving dog!\" as he let the weapon fly.\u003c/p\u003e\n\u003cp\u003eThe man dove over backward, thrusting his crossbow up in front of him as a make-shift shield. The axe took it solidly, tearing it from the man\u0027s hands and carrying it along on its flight until the whole connected with a tree, the crossbow falling in two pieces and the axe burying several inches into the trunk.\u003c/p\u003e\n\u003cp\u003eIvan slowed his charge as the man came back up to his feet, drawing a long, thin sword, and not at all unnerved by the fine throw. In fact, the killer smiled widely at the now unarmed dwarfs approach.\u003c/p\u003e\n\u003cp\u003e\"I could be wrong,\" Ivan admitted quietly, his ferocious charge withering to a halt.\u003c/p\u003e\n\u003cp\u003eDanica punched and punched again, both attacks deflected harmlessly wide by the small staff. Her attacker countered with a straight thrust and Danica threw her forearm up at the last moment to push it out of line with her face. She countered with a snapping kick, but her attacker had his staff back in place quickly enough to slow the blow so that it did no real damage.\u003c/p\u003e\n\u003cp\u003eA groan drew Danica\u0027s attention to the side. There stood the swordsman, his trembling hand at last closed around Danica\u0027s bloodied dagger. The man\u0027s face contorted in obvious agony, but also in obvious rage, and Danica suspected that he would soon be back in the fray. No matter how ineffective he might prove, she feared she could not handle both of these men at once.\u003c/p\u003e\n\u003cp\u003eHer temporary distraction cost her; the staff connected on her side. Danica rolled sidelong with the blow, diminishing its painful sting, and grabbed at her other boot as she went over and came back up to a crouch.\u003c/p\u003e\n\u003cp\u003eThe staff-wielder leaped and spun in a flurry of defensive movements, anticipating another dagger throw. Danica pumped her arm several times, delicately shifting her angle with each forward movement. Each time, her intended victim placed himself in a position to block the throw or dodge aside.\u003c/p\u003e\n\u003cp\u003eThe man was good.\u003c/p\u003e\n\u003cp\u003eDanica carefully aligned herself, pumped her arm once more, and threw. The staff-wielder easily slipped to the side, his expression revealing confusion that this skilled woman would have missed him so cleanly. He understood a moment later, when his companion groaned again, loudly.\u003c/p\u003e\n\u003cp\u003eThe swordsman\u0027s trembling hand slipped free of the golden tiger hilt of the dagger in his belly and inched upward to the silver dragon protruding from his chest. Helplessly, he fell back against a tree and slid down to the ground.\u003c/p\u003e\n\u003cp\u003e\"You and I,\" said the staff-wielder, and he accentuated his point with a furious rush and a blinding, dizzying series of thrusts and swipes.\u003c/p\u003e\n\u003cp\u003ePikel looked mournfully at the tree he had felled, his pause for sorrowful contemplations costing him yet another ringing slam on his pot helmet.\u003c/p\u003e\n\u003cp\u003eThe druidic-minded dwarf felt nothing but a most profound rage welling inside of him. Pikel had always been regarded by those who knew him as among the most even-minded of people, the slowest of the slow to anger. But now he had killed a tree.\u003c/p\u003e\n\u003cp\u003eHe had killed a tree!\u003c/p\u003e\n\u003cp\u003e\"Ooooooo!\" the groan issued out of his trembling Ups, between gnashing, gritted teeth.\u003c/p\u003e\n\u003cp\u003e\"Ooooooo!\" He turned around to face his attacker, who backed off a step at the sheer strength of the dwarfs bared fury.\u003c/p\u003e\n\u003cp\u003e\"Ooooooo!\" Pikel tripped over the tree stump as he charged, diving headlong. His attacker turned to flee, but the sprawling dwarf caught him by the ankle. The man\u0027s club came down hard on PikePs grasping fingers repeatedly, but the enraged dwarf felt no pain.\u003c/p\u003e\n\u003cp\u003ePikel dragged the man in, grabbed him in both hands, and hoisted him into the air. Gaining his feet, the powerful dwarf held the man above his head and looked around curiously, as though he was wondering what to do next.\u003c/p\u003e\n\u003cp\u003eThe club rang again on PikePs cooking pot helmet.\u003c/p\u003e\n\u003cp\u003ePikel decided he had had enough. He impaled the man on the jagged edge of the broken tree stump.\u003c/p\u003e\n\u003cp\u003eIvan whipped off his backpack, fumbling with the straps as his enemy rushed in. The dwarf blocked a sword thrust with the pack, tangling the sword in its straps long enough for Ivan to get out a package, six inches square and carefully wrapped.\u003c/p\u003e\n\u003cp\u003eThe swordsman yanked away and tore the pack from his blade, then looked back to the dwarf curiously.\u003c/p\u003e\n\u003cp\u003eIvan had ripped open the box and removed its contents: a toy he had been making for Cadderly ever since the young priest\u0027s heroics against the evil Barjin.\u003c/p\u003e\n\u003cp\u003eThe black adamantite border of the spindle-disks con-trasted-mesmerizingly with the semiprecious crystal center. The swordsman paused, wondering what purpose these twin disks, joined in their center by a small rod, might possibly serve.\u003c/p\u003e\n\u003cp\u003eIvan fumbled to get his fat finger through the loop in the string wrapping that small rod. He had seen Cadderly use this type of toy a thousand times, had marveled at how the young priest so easily let the disks roll down to the end of their cord, then casually, with a flip of his wrist, sent them spinning back to his waiting hand.\u003c/p\u003e\n\u003cp\u003e\"Ye ever seen one of these?\" Ivan asked the curious swordsman.\u003c/p\u003e\n\u003cp\u003eThe man charged; Ivan flung the disks out at him. The man got his sword in the way to block, then eyed his weapon incredulously, regarding the ample nick the harder adamantite had caused.\u003c/p\u003e\n\u003cp\u003eIvan had no time to gloat over the integrity of the craftsmanship, though. His throw had been strong, but, unlike Cadderly, he had no idea of how to recall the spinning disks. They hung near the end of the string, spinning sidelong.\u003c/p\u003e\n\u003cp\u003e\"Ooooooo!\" PikePs rush from the side turned the swordsman about. He sidestepped the raging dwarf and regained his balance as Pikel swung about, scraping one foot on the ground for leverage to begin yet another furious charge.\u003c/p\u003e\n\u003cp\u003eThis time, the green-bearded dwarf stopped short of passing the man, instead launching a series of furious blows with his heavy club. The swordsman worked hard, but managed to keep out of harm\u0027s way.\u003c/p\u003e\n\u003cp\u003eIvan shoulder-blocked Pikel aside. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-cleric-quintet-night-masks-the-cleric-quintet-3/page-8.html","bookId":2109,"creation":"Oct 5, 2019 5:52:12 PM","modification":"Oct 5, 2019 5:52:12 PM"}
