{"id":16083,"no":9,"title":"CHAPTER IX CAMERON FEELS THE STRAIN","content":"The advance guard of the Edmonton relief expedition arrived at Mackenzie River two days late. Included among its personnel were Dick Kent, Sandy and Toma and two medical men, Drs. Brady and Mattinson. Joy over the safe arrival of the party was shadowed by the news of the destruction of one of the planes and the death of Stewart, the aviator.\n\u003cbr\u003e \n\u003cbr\u003e Inspector Cameron began at once to plan two separate itineraries into the stricken areas. One of the physicians, it was decided, would be sent immediately to the country north of the Mackenzie, from whence Davis had brought first word of the epidemic. Another party was instructed to proceed north and east toward the barren lands, over the selfsame route Corporal Rand had but recently taken.\n\u003cbr\u003e 75\n\u003cbr\u003e \n\u003cbr\u003e It was while these preparations were being carried out that the three boys, Dick, Sandy and Toma, were called into the presence of the mounted police official. Caps in hand, feeling awkward and ill at ease, they listened to the grave and somewhat impatient voice of the inspector.\n\u003cbr\u003e \n\u003cbr\u003e “Can’t tell you how pleased I am. Splendid! You’ve done well. Want to thank each one of you. Suppose you think you’re going home now.”\n\u003cbr\u003e \n\u003cbr\u003e The assertion seemed to require an answer. Sandy twisted his cap into a knot, smiled, cleared his throat and assumed the part of spokesman.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, sir. We are under that impression.”\n\u003cbr\u003e \n\u003cbr\u003e Cameron scowled, running his fingers through his rumpled hair.\n\u003cbr\u003e \n\u003cbr\u003e “Not a bit of it! You’re not! Might as well disillusion you right now. You’re to undertake another errand, equally as important and dangerous.”\n\u003cbr\u003e \n\u003cbr\u003e “What is it?” asked Dick.\n\u003cbr\u003e \n\u003cbr\u003e “You’re to lead the way to the barren lands. Escort to Doctor Brady.”\n\u003cbr\u003e \n\u003cbr\u003e The boys exchanged furtive glances. Cameron continued:\n\u003cbr\u003e \n\u003cbr\u003e “Dick, I’m placing you in charge. You’re the oldest. Sandy and Toma will be your lieutenants. This expedition must not fail. Nothing must happen to it. I’ll hold you all responsible.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, sir,” trembled Dick. “But how do we get there?”\n\u003cbr\u003e 76\n\u003cbr\u003e \n\u003cbr\u003e “There’s no trail. I’ll try and find a guide for you. You proceed northeast, cross the Wapiti, the Little Moose, pass over a height of land known as ‘The Divide,’ enter the barren lands and thus eventually come to the Keechewan Mission, an important Catholic missionary center. It’s a hard trip and you’ll never forget it.”\n\u003cbr\u003e \n\u003cbr\u003e “Are there many people at this mission?” inquired Sandy.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, there’s a sort of village there—a mission-village: flour mill, schools, hospital and the like. There are always several large Indian encampments close by. The plague has found its way there. Scores have died. As far as I know, no other section of the country is in such dire straits.”\n\u003cbr\u003e \n\u003cbr\u003e The inspector paused, scowling again and for a moment seemed to have forgotten that he was not alone.\n\u003cbr\u003e \n\u003cbr\u003e “The epidemic is bad enough,” he resumed, “but to add to the horror of the situation, a revolt has taken place among the Indians. I’ve been compelled to send Corporal Rand up there. You will follow but I doubt if you will overtake him. He’s travelling light, while you will have medicine, supplies, mail——”\n\u003cbr\u003e \n\u003cbr\u003e “Mail!” interrupted Dick in surprise.\n\u003cbr\u003e 77\n\u003cbr\u003e \n\u003cbr\u003e “Yes, mail. All of the mail for the Keechewan Mission comes here and is forwarded, usually through the efforts of the R. N. W. M. P. There will be three large sacks, including one packet of registered letters. Are you willing to undertake this responsibility?”\n\u003cbr\u003e \n\u003cbr\u003e The boys were a little confused and shy. For a time no one spoke.\n\u003cbr\u003e \n\u003cbr\u003e “I asked you a question,” persisted the inspector. “Do you or do you not want to take the mail?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, sir,” said Dick hurriedly, “we’ll be glad to.”\n\u003cbr\u003e \n\u003cbr\u003e “All right. Then that’s settled. I’ve given you an idea of the route. Anything you wish to know?”\n\u003cbr\u003e \n\u003cbr\u003e “It will be necessary to supply us with some sort of transport,” Dick reminded him. “Would you suggest ponies?”\n\u003cbr\u003e \n\u003cbr\u003e Inspector Cameron smiled.\n\u003cbr\u003e \n\u003cbr\u003e “I might suggest ponies did I not know the North as well as I do. The season is growing late. It is now the last week in October. The weather has been wonderful—unusual, but we’re due for a change almost any day now. You’ll have to take both ponies and dogs. Just as soon as the first snowstorm comes, you can turn the ponies loose and proceed with the huskies.”\n\u003cbr\u003e 78\n\u003cbr\u003e \n\u003cbr\u003e A short discussion then took place. Dick could see that the inspector was very anxious to have them start as soon as possible. For the past few weeks the police head had had much to worry him. That was evident. Deep lines showed in his forehead. At times he was subject to fits of brooding, although the safe arrival of the Edmonton party had considerably cheered him.\n\u003cbr\u003e \n\u003cbr\u003e Burdened with so many responsibilities, Cameron revealed his state of mind from time to time, either by his expression or by some chance word he let fall. Naturally, the boys supposed that the inspector’s chief worry had to do with the epidemic. They did not know that one of the things that caused the grizzled veteran of police many hours of apprehension and nights of wakeful, intolerable anxiety was Corporal Rand’s hazardous undertaking. He feared for his subordinate’s safety. The corporal had not been vaccinated. He had been sent to a district which festered with the plague.\n\u003cbr\u003e \n\u003cbr\u003e “Rand has gone up ahead of you,” he told the boys. “When you arrive at the mission, the first thing I want you to do is to look him up. Doctor Brady has my instructions. He’ll vaccinate the corporal if—if——”\n\u003cbr\u003e \n\u003cbr\u003e He broke off suddenly and his eyes sought his desk. Absently he picked up a letter-file and ran through it. Dick observed that his fingers were trembling.\n\u003cbr\u003e 79\n\u003cbr\u003e \n\u003cbr\u003e “If it isn’t too late, Dr. Brady will vaccinate him,” he resumed more calmly. “The thought of his being up there troubles me. Shouldn’t have gone in the first place. Matter of fact, he went against my wishes. Hardly in physical shape. Weak. Been sick a long time with pneumonia. I don’t like it.”\n\u003cbr\u003e \n\u003cbr\u003e Again the police chief became absorbed in his thoughts. The boys stood undecided, then turned and left the room. Outside, where they would not be overheard, Sandy broke forth:\n\u003cbr\u003e \n\u003cbr\u003e “Never saw him just like that before. I’d say he’s losing his grip, Dick. Acts queer, doesn’t he?”\n\u003cbr\u003e \n\u003cbr\u003e “I don’t wonder at it,” Dick came staunchly to the inspector’s rescue. “You must admit his position has been trying enough of late. If I’d been in his place, I’d be a mental wreck by this time.”\n\u003cbr\u003e \n\u003cbr\u003e Soon after the subject was forgotten in the hurry and interest of their departure. All three had been sent to Dr. Brady and were vaccinated. At three o’clock that same afternoon the cavalcade set out. An Indian guide, who professed to know every foot of the route, had been added to their train at the last moment by Inspector Cameron.\n\u003cbr\u003e \n\u003cbr\u003e “I’m not altogether sure about this man,” he had told Dick in strict confidence. “Seems intelligent enough, and I’m sure he’s been over the route many times. My only objection to him is his appearance. But one can’t condemn a man on that score. He’ll probably prove invaluable to you.”\n\u003cbr\u003e \n\u003cbr\u003e Dick glanced at the new recruit and pursed his lips.\n\u003cbr\u003e \n\u003cbr\u003e “Did he volunteer for this service?” he asked.\n\u003cbr\u003e 80\n\u003cbr\u003e \n\u003cbr\u003e “Yes. Seemed anxious to go. Didn’t even want pay for his services. Rather unusual, isn’t it?”\n\u003cbr\u003e \n\u003cbr\u003e “Perhaps he has relatives or friends at Keechewan he’s been worrying about,” surmised Dick.\n\u003cbr\u003e \n\u003cbr\u003e “Of course, that may explain it. Still, I can’t say I like his looks. You’d better watch him.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll be on my guard,” laughed Dick as he leaned over in his saddle to shake hands. “I’ll do my very best, inspector.”\n\u003cbr\u003e \n\u003cbr\u003e “I know you will. Otherwise, I wouldn’t have sent you.”\n\u003cbr\u003e \n\u003cbr\u003e The grim mouth relaxed into a faint smile. Cameron reached up and gripped Dick’s hand.\n\u003cbr\u003e \n\u003cbr\u003e “Good-bye,” he said simply.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1585/47113.html","bookId":1255,"creation":"Aug 2, 2019 7:29:22 AM","modification":"Aug 2, 2019 7:29:22 AM"}
