{"id":80789,"no":20,"title":"Page 20","content":"\u003cp\u003eJill stared in astonishment as wesker suddenly stopped talking and crumpled to the floor and Barry stepped into view, staring down at Wesker\u0027s body with a look of intense hatred, Colt in hand.\u003c/p\u003e\n\u003cp\u003eShe crouched down next to Wesker and pried the Beretta from his fingers, tucking it into her waistband.\u003c/p\u003e\n\u003cp\u003eBarry turned to look at her, his eyes swimming with apology. Jill, I\u0027m so sorry. I never should have believed him.\u003c/p\u003e\n\u003cp\u003eJill stared at him for a moment, thinking about his daughters. Moira was Becky McGee\u0027s age...\u003c/p\u003e\n\u003cp\u003eIt\u0027s okay, she said finally. You came back, that\u0027s what matters.\u003c/p\u003e\n\u003cp\u003eBarry handed her back her weapons, and they both gazed down at Wesker\u0027s sprawled form, still breathing but unconscious. He was out cold.\u003c/p\u003e\n\u003cp\u003eI don\u0027t suppose you have any handcuffs on you?\u003c/p\u003e\n\u003cp\u003eBarry asked.\u003c/p\u003e\n\u003cp\u003eJill shook her head. Maybe we should check out the lab, there\u0027s bound to be some cable or cord we can use. Besides, I\u0027m kind of curious about this \u0027miracle of modern science\u0027 he was talking about...\u003c/p\u003e\n\u003cp\u003eShe turned and found the switch that operated the hydraulic door, noting the biohazard symbol painted across the front. The door slid open and the two of them stepped inside.\u003c/p\u003e\n\u003cp\u003eWow...\u003c/p\u003e\n\u003cp\u003eIt was a huge, high-ceilinged chamber lined with monitoring consoles, cables snaking across the floor and connecting to a whole series of standing glass tubes. There were eight of the tubes lined up in the center of the room, each of them big enough to hold a grown man. They were all empty.\u003c/p\u003e\n\u003cp\u003eBarry reached down and scooped up a handful of cable, digging into his pocket for a knife while Jill walked toward the back, gazing at the technical and medical equipment and stopped, staring, feeling her jaw drop.\u003c/p\u003e\n\u003cp\u003eAgainst the back wall was a much larger tube, at least eight or nine feet tall, hooked up to its own computer console and the thing inside filled it, top to bottom. It was monstrous.\u003c/p\u003e\n\u003cp\u003eJill, I got the cable. I...\u003c/p\u003e\n\u003cp\u003eBarry stopped next to her, his words faltering as he saw the abomination. Silently, they both walked toward it, unable to resist a closer look.\u003c/p\u003e\n\u003cp\u003eIt was tall, but proportionally correct, at least through the broad, muscular torso and long legs; those parts appeared human. One of its arms had been altered into a cluster of massive, dragging claws, hanging past its knees, while the other seemed ordinary, if overly large. There was a thick, bloody tumor protruding from where its heart would be, and Jill realized, staring at the bulbous mass that it was the thing\u0027s heart; it was pulsing slowly, expanding and contracting in slow, rhythmic beats.\u003c/p\u003e\n\u003cp\u003eShe stopped in front of the tube, awed by the abomination. She could see lines of scar tissue snaking across its limbs, surgical scars. It had no sexual organs; they\u0027d been cut away. She looked up at its face and saw that parts of the flesh there had also been removed; the lips were gone, and it seemed to grin broadly at her through the sliced red tissue of its face, all of its teeth exposed.\u003c/p\u003e\n\u003cp\u003eTyrant, Barry said quietly.\u003c/p\u003e\n\u003cp\u003eJill glanced over at him, saw him frowning down at the computer that was hooked to the tube by multiple cables.\u003c/p\u003e\n\u003cp\u003eShe looked back at the Tyrant, feeling nearly overwhelmed by pity and disgust. Whatever it was now, it had once been a man. Umbrella had turned him into a freakish horror.\u003c/p\u003e\n\u003cp\u003eWe can\u0027t leave it like this, she said softly, and Barry nodded.\u003c/p\u003e\n\u003cp\u003eShe joined him at the console, looking down at the myriad switches and buttons. There had to be a switch that would put an end to its life; it deserved that much.\u003c/p\u003e\n\u003cp\u003eThere was a set of six red switches in a row along the bottom and Barry flipped one of them down.\u003c/p\u003e\n\u003cp\u003eNothing seemed to happen. He glanced at her, and she nodded for him to continue. He used the side of his hand to flip all of them.\u003c/p\u003e\n\u003cp\u003eThere was a sudden, dull thump...\u003c/p\u003e\n\u003cp\u003eThey both whirled around, saw the Tyrant pull back its human hand and hit the glass again. Cracks webbed out from the impact, though the glass had to be several inches thick.\u003c/p\u003e\n\u003cp\u003eOh... SHIT!\u003c/p\u003e\n\u003cp\u003eBarry grabbed her arm as the creature drew its bleeding knuckles back for another blow.\u003c/p\u003e\n\u003cp\u003eRun!\u003c/p\u003e\n\u003cp\u003eThey ran, Jill wishing to God that they\u0027d left it alone, panic welling up from deep inside of her. Barry slammed his hand down on the door control and it slid open as behind them, glass shattered.\u003c/p\u003e\n\u003cp\u003eThey stumbled through the door, terrified, Barry hitting the lock and saw that Wesker was gone.\u003c/p\u003e\n\u003cp\u003eWesker stumbled toward the power room, his head pounding, his limbs feeling strangely distant and weak. He felt like he was going to throw up.\u003c/p\u003e\n\u003cp\u003eGoddamn Barry...\u003c/p\u003e\n\u003cp\u003eThey\u0027d taken his gun. He\u0027d come to as they\u0027d walked into the lab and reeled toward the elevator, cursing them both, cursing Umbrella for creating such a screwed up mess, cursing himself for not simply killing the S.T.A.R.S. when he could have.\u003c/p\u003e\n\u003cp\u003eIt\u0027s not over. I\u0027m still in control. This is my game...\u003c/p\u003e\n\u003cp\u003eThe sample case was down in the lab, probably being destroyed right now by one of those idiots.\u003c/p\u003e\n\u003cp\u003eTyrant, too. That magnificent creature, powerless without the adrenaline injections, dead. They\u0027d shoot him in his sleeping heart, he\u0027d die without ever tasting battle...\u003c/p\u003e\n\u003cp\u003eWesker reached the door to the room and leaned against it, struggling to catch his breath. Blood dribbled out of his ears and he shook his head, trying to clear it of the strange fog that had settled into his brain.\u003c/p\u003e\n\u003cp\u003eHe didn\u0027t have the tissue samples, but he could still complete his mission. It was important, very important that he complete his mission. It was about control, and control was his game. ... triggering system, watch out for monkeys...\u003c/p\u003e\n\u003cp\u003eThe Ma2s, he had to be careful. Wesker opened the door and pitched forward, the ground seeming too far away and then too close. The machines were hissing at him, whining and hissing in the hot, oily air. His hand found the railing and he pulled himself toward the back of the room, trying to hurry but finding that his legs weren\u0027t interested.\u003c/p\u003e\n\u003cp\u003eA claw shot down from above and tore into his scalp, yanking away a clump of hair. He felt warm liquid trickle down the back of his neck and stumbled on, the pain in his head sharper now.\u003c/p\u003e\n\u003cp\u003eTook my gun, stupid, stupid assholes took my gun...\u003c/p\u003e\n\u003cp\u003eHe reached the door and had just managed to get it open when something heavy landed on his back, knocking him into the next room. He fell on the cold metal floor and a terrible shriek sounded in his ear.\u003c/p\u003e\n\u003cp\u003eThick talons punctured the skin on his back and Wesker slapped at it, at the grinning, screaming thing that was trying to kill him.\u003c/p\u003e\n\u003cp\u003eHe hit the creature as hard as he could, shoving the heel of his hand into its throat. It leaped away, landing on the mesh wall and clambering back up to the ceiling.\u003c/p\u003e\n\u003cp\u003eWesker pulled himself up and stumbled on, fresh waves of pain and nausea washing over him. The air was too hot, the turbines loud and relentless in their spinning, throbbing frenzy, but he could see the door to the back now, the door that led to the completion of his mission.\u003c/p\u003e\n\u003cp\u003eAll of the S.T.A.R.S., dead, blown into orbit while I escape, fly away a rich man...\u003c/p\u003e\n\u003cp\u003eHe flung the door open and made his way toward the small, glowing screen in the back corner. It was quieter here, cooler. The massive machines that filled the chamber hummed softly at him, their purpose quite different than that of the ones outside. These were the machines that wanted to help him regain his control.\u003c/p\u003e\n\u003cp\u003eThe noise from the open door behind him seemed far away as he reached the glowing screen, his fingers numb as they touched the keyboard beneath.\u003c/p\u003e\n\u003cp\u003eHe found the keys he needed, the code spilling out across the monitor in soft green after only a few mistakes. A sexy, quiet voice informed him that the countdown would begin in thirty seconds. Dizzy, he tried to remember the setting for the timer. The system would trigger automatically in five minutes, but he had to reset it, give himself time to get reoriented and make his way to the outside.\u003c/p\u003e\n\u003cp\u003eBehind him, something screamed.\u003c/p\u003e\n\u003cp\u003eWesker whirled around, confused-and saw four of the mesh-monkeys running at him, lashing out with long, curved hands as they reached him. Terrible pain shot up through his legs and he fell, crashing to the hard steel floor.\u003c/p\u003e\n\u003cp\u003eThis can\u0027t happen.\u003c/p\u003e\n\u003cp\u003eOne of the creatures jumped onto his chest and suddenly Wesker couldn\u0027t breathe, couldn\u0027t even raise his weak arms to push it away. Another tore into his left leg, ripping away a thick chunk of flesh with its hooked claw. The third and fourth screamed in savage glee, dancing around him like dark, vicious children, lifting their claws as they pranced on squat legs.\u003c/p\u003e\n\u003cp\u003eSomehow, there was blood in his eyes, and the world was spinning away, screams and hisses and incredible, searing heat blurring his vision, his mind.\u003c/p\u003e\n\u003cp\u003eTyrant has come.\u003c/p\u003e\n\u003cp\u003eWesker could feel it, could feel the presence of something vast and powerful touching him. Grinning through the pain, he searched for it through the red haze of his failing vision, wanting more than anything to see it slaughter his attackers in a glory of perfect motion, but he could only make out the immense shadow that seemed to flood over him, through him, could only imagine that the powerful, magnificent warrior was reaching down to lift him from his torment...\u003c/p\u003e\n\u003cp\u003eI control let me seeeee...\u003c/p\u003e\n\u003cp\u003eDarkness stole his hopes away, and Wesker thought no more. ... S.T.A.R.S. Alpha team, Bravo, anybody - - you can\u0027t answer, try to signal! I\u0027m running out of fuel, do you read? This is Brad! Repeat-S. T.A.R.S. Alpha team...\u003c/p\u003e\n\u003cp\u003eRebecca hit the button, talking fast. Brad! There\u0027s a heliport at the Spencer estate, you have to get to the heliport! Brad, come in!\u003c/p\u003e\n\u003cp\u003eThere was a high, whining squeal and Rebecca heard what must have been the word copy - but the rest was lost.\u003c/p\u003e\n\u003cp\u003eI copy? or, Do you copy?\u003c/p\u003e\n\u003cp\u003eThere was no way to know. Frustrated and worried, Rebecca held on to the radio tightly, hoping that he\u0027d heard her.\u003c/p\u003e\n\u003cp\u003eSuddenly, a shrill alarm blared into the silent room through some hidden speaker in the ceiling. Rebecca jumped, staring around the cold chamber helplessly.\u003c/p\u003e\n\u003cp\u003eThere was a buzzing click from inside the door that led to the heliport and she hurried over, grabbing the handle and pulling it open. It had unlocked.\u003c/p\u003e\n\u003cp\u003eA cool, female voice began to speak, slowly and clearly over the jangling alarm.\u003c/p\u003e\n\u003cp\u003eThe triggering system has now been activated. All personnel must evacuate immediately or process deactivation. You have five minutes. The triggering system has now been activated...\u003c/p\u003e\n\u003cp\u003eAs the recorded message repeated, Rebecca stood in the open doorway and watched the open ladder shaft, her blood racing, waiting to see Chris emerge from the levels below.\u003c/p\u003e\n\u003cp\u003eHe\u0027d only been gone a few minutes, but their time had just run out. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-umbrella-conspiracy-resident-evil-1/page-20.html","bookId":2456,"creation":"Oct 5, 2019 4:30:07 PM","modification":"Oct 5, 2019 4:30:07 PM"}
