{"id":80792,"no":23,"title":"Page 23","content":"\u003cp\u003eThe four of them were quiet as brad piloted the \u0027copter back toward the city, and though he had a million questions, something about their silence didn\u0027t invite conversation. Chris and Jill were both staring out the hatch window at the spreading fire that had been the estate, their expressions grim.\u003c/p\u003e\n\u003cp\u003eBarry was slumped against the cabin wall, looking down at his hands like he\u0027d never seen them before.\u003c/p\u003e\n\u003cp\u003eThe new girl was quietly moving among them, treating their wounds without saying a word.\u003c/p\u003e\n\u003cp\u003eBrad kept his mouth shut, still feeling crappy about taking off earlier. He\u0027d been through hell since then, flying around in circles and watching the fuel gauge slowly drop. It had been a total nightmare, and he had to take a piss like nobody\u0027s business.\u003c/p\u003e\n\u003cp\u003eAnd then that monster...\u003c/p\u003e\n\u003cp\u003eHe shuddered. Whatever it had been, he was glad it was dead. It had taken all of his nerve not to fly away the second he\u0027d laid eyes on it and as far as he was concerned, he deserved a little consideration for managing to kick the launcher out the door.\u003c/p\u003e\n\u003cp\u003eHe glanced back at the silent foursome, wondering if he should tell them about the weird call he\u0027d gotten over the radio. Right after the rookie had screamed something about a heliport through the static, a clear, solid signal had come in, a male voice calmly giving him the exact coordinates. The guy had been listening in, which was weird, but the fact that he knew the location well enough to give Brad directions was downright spooky.\u003c/p\u003e\n\u003cp\u003eHe frowned, trying to remember the mystery man\u0027s name. Thad? Terrence?\u003c/p\u003e\n\u003cp\u003eTrent. That\u0027s it, he said his name was Trent.\u003c/p\u003e\n\u003cp\u003eBrad decided that it would keep for another day.\u003c/p\u003e\n\u003cp\u003eFor now, he just wanted to go home. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-umbrella-conspiracy-resident-evil-1/page-23.html","bookId":2456,"creation":"Oct 5, 2019 4:30:07 PM","modification":"Oct 5, 2019 4:30:07 PM"}
