{"id":109694,"no":23,"title":"Page 23","content":"\u003cp\u003e24. A Love Story?\u003c/p\u003e\n\u003cp\u003eJODY\u003c/p\u003e\n\u003cp\u003eIt wasn\u0027t the first time she\u0027d crept out of a guy\u0027s apartment in the middle of the night with her shoes in her hand, but it was the first time where the decision had been because she didn\u0027t want to kill the guy. He was so little, so frail, so lonely. She had taken people before who had the black ring in their life aura like Okata\u0027s, and they had thanked her. It had been mercy, relief, the end of pain, yet she couldn\u0027t make herself do it. She\u0027d left him there, not to die alone, although he probably would, and not because he had been so kind to her, saving her, which he had, but because the prints weren\u0027t finished. He was a strange little man, a hermit and a swordsman, and he carried some great pain in him, but above all that, he was an artist, and she couldn\u0027t bear to stop that. So she\u0027d left.\u003c/p\u003e\n\u003cp\u003eNow she was back.\u003c/p\u003e\n\u003cp\u003eHe sheathed his sword and tried to lift her to her feet. Her limbs still felt like they were on fire, and she could move only her right arm on her own. She nodded toward Bella\u0027s pellet weapon. \"Give it to me, Okata.\" She made a grasping motion.\u003c/p\u003e\n\u003cp\u003eHe leaned her in a sitting position against the wrought-iron railing that surrounded the steps to his apartment, then retrieved the weapon and fit it into her hand. Then he held the barrel firmly and said something stern in Japanese.\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m not going to off myself,\" she said, and she smiled.\u003c/p\u003e\n\u003cp\u003eHe let go of the barrel of the gun and she sprayed Bella\u0027s corpse with pellets until the gun stopped firing, then she threw the gun over the rail and motioned for Okata to help her into his apartment. Bella\u0027s body was nothing more than slimy chunks of meat by the time Okata got her through the door. In the morning, when the sun hit it, there would be only a charred stain on the sidewalk with burned gobs of plastic that had been a Kevlar suit, shoes, and sunglasses.\u003c/p\u003e\n\u003cp\u003eOkata helped her to the shower, where he rinsed out her wounds, then dried her off and retrieved the last bit of the pig\u0027s blood, which he\u0027d kept in the refrigerator.\u003c/p\u003e\n\u003cp\u003eJody felt a horrible twinge of guilt. He\u0027d been waiting for her, probably had been outside looking for her when Bella had chased her around the corner.\u003c/p\u003e\n\u003cp\u003eAfter she drank the blood, and her legs had healed enough to hold her weight, she went to his workbench and turned on the light. The last print was there. Not finished, but two of the woodblocks had been finished, the black and the red. There she was, in the shower, her red hair streaming behind her in the water, black bits of ash puddling at her feet.\u003c/p\u003e\n\u003cp\u003eOkata was beside her, looking at the print critically, as if there was something he might have to fix at any second. She bent down and looked back from the angle of the print into his face.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" she said. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" she said.\u003c/p\u003e\n\u003cp\u003eFOO DOG\u003c/p\u003e\n\u003cp\u003eAbby lay on the futon in the loft\u0027s great room. The empty rat cages were stacked in the corner of the room and Foo had unscrewed one of the plywood panels over the windows to let some light in. He\u0027d been monitoring Abby\u0027s vital signs since six in the morning. At least she had vital signs. She hadn\u0027t even started with those. At noon, she opened her eyes.\u003c/p\u003e\n\u003cp\u003e\"Foo, you dick, I\u0027m mortal.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re okay!\" He threw his arms around her.\u003c/p\u003e\n\u003cp\u003eShe pushed him away. \"Where\u0027s Tommy? Where\u0027s the Countess?\"\u003c/p\u003e\n\u003cp\u003e\"Tommy\u0027s in the bedroom. I don\u0027t know where Jody is.\"\u003c/p\u003e\n\u003cp\u003e\"She didn\u0027t call?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Fucksocks! Did you turn Tommy back, too?\"\u003c/p\u003e\n\u003cp\u003e\"No. I started making his serum, but he didn\u0027t want to do anything until they take care of the other vampire. We need to, though, Abby. He won\u0027t live much longer if we don\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"I know. The pirate Rasta guy on the black ship told us. Other vampire? Only one?\"\u003c/p\u003e\n\u003cp\u003e\"Rivera called while you were unconscious. The Animals took one of them down at the Safeway.\"\u003c/p\u003e\n\u003cp\u003e\"Did you tell him to stay off the black ship?\"\u003c/p\u003e\n\u003cp\u003e\"Tommy did.\"\u003c/p\u003e\n\u003cp\u003e\"What about Chet?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"He could be-Hey, where\u0027s my tail?\"\u003c/p\u003e\n\u003cp\u003e\"It sort of fell off when you turned back to human.\"\u003c/p\u003e\n\u003cp\u003e\"Did you save it?\"\u003c/p\u003e\n\u003cp\u003e\"Well, no. I left it on the coffee table and when the sun came up, well, it sort of burned up.\"\u003c/p\u003e\n\u003cp\u003e\"You burned up my tail? That was a part of me.\"\u003c/p\u003e\n\u003cp\u003e\"It was a disgusting part of you.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re such a racist, Foo. I\u0027m glad we broke up.\"\u003c/p\u003e\n\u003cp\u003e\"We did?\"\u003c/p\u003e\n\u003cp\u003e\"We were going to, weren\u0027t we? Wasn\u0027t that what you wanted to talk about? About how I\u0027m way too complex and mysterious for you and you need to return to your traditional science-nerd values and live in the Sunset with your parents, instead of the awesome love lair with your goddess-like vampire girlfriend, who will never do you again, even when you beg, even out of pity, no matter how fly your sexy manga hair is? Isn\u0027t that what you were going to say?\"\u003c/p\u003e\n\u003cp\u003e\"Not in so many words. I\u0027m going to move to Berkeley. It\u0027s hard, Abby-\"\u003c/p\u003e\n\u003cp\u003e\"Well, save your breath, s\u0027il vous pla\u0026amp;icirc;t, I\u0027m over you. I will not be further abused by your toady banalities and whatnot.\"\u003c/p\u003e\n\u003cp\u003e\"Your mom called. She wants you to come home.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, that\u0027s going to happen. Oh, what\u0027s this, monkeys flying out of my tailless butt?\"\u003c/p\u003e\n\u003cp\u003e\"She said they sent your report card. You passed Mr. Snavely\u0027s biology class.\"\u003c/p\u003e\n\u003cp\u003e\"I did?\"\u003c/p\u003e\n\u003cp\u003e\"She said she almost fainted. Jared said it was your extra-credit project that did it. Why didn\u0027t you tell me you took one of the rats to school with you?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I didn\u0027t think it worked out that well. I mean, the rat was already vamped, so when I took him out of the shoe box, he just looked kind of dead. And Mr. Snavely was all, \"\u0027Oh, that\u0027s lovely, Allison, a dead rat.\u0027\" But it was sunny in biology lab, and all of a sudden my rat just spontaneously combusts, and I\u0027m all, \u0027Check it, bitches, spontaneous rodent combustion, it\u0027s the wave of the future.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Well, because he couldn\u0027t figure out how you did it, he passed you.\"\u003c/p\u003e\n\u003cp\u003e\"I am the dark mistress of Biology One-oh-two. Fear me. Rawr!\" she said. Then she kissed him hard, but not as hard as she had when she was a vampire, which was a relief, but then she pushed him away and slapped him.\u003c/p\u003e\n\u003cp\u003e\"Ouch. I didn\u0027t think you were a slut.\"\u003c/p\u003e\n\u003cp\u003e\"I know, that\u0027s was our bittersweet break-up kiss. I will go grieve now until Lord Flood awakes and we resume the search for the Countess. I\u0027m starving. Do you want to go get a sammy and a Starbucks? I have like ten grand in my messenger.\"\u003c/p\u003e\n\u003cp\u003eTHE LOVE LAIR\u003c/p\u003e\n\u003cp\u003eHe awoke at sundown with her face in his mind\u0027s eye and panic running up his spine. He bolted out of the bedroom into the great room, where Abby was hanging up the phone.\u003c/p\u003e\n\u003cp\u003e\"That was the Countess,\" Abby said. \"She\u0027s okay. She\u0027ll be here in a few minutes.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re okay? You\u0027re alive. You have heat.\" He could see the heat coming off her and the healthy life aura around her.\u003c/p\u003e\n\u003cp\u003e\"Yeah, thanks. Foo destroyed my tail.\" She turned and looked to the kitchen. \"The traitorous racist heartbreaking fucktard!\"\u003c/p\u003e\n\u003cp\u003e\"Little harsh,\" Tommy said. \"He saved your life.\"\u003c/p\u003e\n\u003cp\u003e\"Heartbroken. Grieving. Inconsolable. Tail\u0027s gone. Going to have to get totally repierced and tattooed.\"\u003c/p\u003e\n\u003cp\u003e\"But you showered and your eye makeup isn\u0027t all racoony anymore.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks. I like the blood splatters on your pants.\"\u003c/p\u003e\n\u003cp\u003e\"Hi,\" said Foo Dog from the kitchen, where he was filling a syringe with what looked like blood. \"I have your serum ready, whenever you\u0027re ready.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not ready.\"\u003c/p\u003e\n\u003cp\u003e\"You have to, you know.\"\u003c/p\u003e\n\u003cp\u003eThe doorbell buzzed. Tommy keyed the intercom.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s me,\" Jody said.\u003c/p\u003e\n\u003cp\u003eHe buzzed her in and she was at the top of the steps in an instant, then kissing him. He pushed her back and looked at her clothes, shredded at the elbows and knees, stained with blood.\u003c/p\u003e\n\u003cp\u003e\"What happened to you? Where were you?\"\u003c/p\u003e\n\u003cp\u003e\"One of the old vampires? She ambushed me on a roof across from the black ship. That weapon they have did this. It\u0027s horrible. We can\u0027t let them get near us with that thing.\"\u003c/p\u003e\n\u003cp\u003e\"How did you get away?\"\u003c/p\u003e\n\u003cp\u003e\"I was hiding at the bottom of a pool, trying to figure out what to do, when Chet jumped her. I got out of there while Chet was dry-humping her.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Go Chet!\" said Abby.\u003c/p\u003e\n\u003cp\u003e\"Abby!\" Jody ran to Abby and hugged her, kissed her on the forehead. \"I was so worried about you. You\u0027re alive. Really alive.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Foo changed me back. I want to be nosferatu again.\"\u003c/p\u003e\n\u003cp\u003eThey all turned to face Foo, who was still in the kitchen. \"Can\u0027t do it, Abs. You won\u0027t survive a second time. I tried it on the rats. You\u0027re only human.\"\u003c/p\u003e\n\u003cp\u003e\"Doomed,\" Abby said.\u003c/p\u003e\n\u003cp\u003e\"Jody,\" Tommy said, \"what about the vampire who attacked you?\"\u003c/p\u003e\n\u003cp\u003e\"Gone. Destroyed. Someone rescued me just before she killed me. So there\u0027s only one left, right?\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re all gone,\" Tommy said. \"Rivera called. The Animals got the other one. There\u0027s only Elijah on the black ship.\"\u003c/p\u003e\n\u003cp\u003eJody put her hand to his face. \"Tommy, we have to talk.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" he said.\u003c/p\u003e\n\u003cp\u003eFoo Dog said, \"Jody, I have no way of knowing when Tommy might, uh, expire. He could go faster than Abby was going.\"\u003c/p\u003e\n\u003cp\u003e\"Come with me.\" Jody took Tommy\u0027s hand and led him into the bedroom. \"I\u0027ve got to show you something. You two, do not come into this room, do you hear me?\"\u003c/p\u003e\n\u003cp\u003eTOMMY AND JODY\u003c/p\u003e\n\u003cp\u003e\"We can\u0027t make crazy monkey love now, Jody. They\u0027ll hear us, and we usually end up breaking all the furniture.\"\u003c/p\u003e\n\u003cp\u003e\"You learned how to go to mist, when you were with Chet. You said you learned?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, that\u0027s how I got these clothes. They\u0027re stupid, aren\u0027t they?\"\u003c/p\u003e\n\u003cp\u003e\"Tommy, the vampire, the old one, her name was Bella, she told me something. Kiss me. Kiss me and go to mist. Don\u0027t think about it, don\u0027t stop, just melt into the kiss.\"\u003c/p\u003e\n\u003cp\u003eShe kissed him and felt him as he faded from solid, and followed him exactly, until they were a single entity, sharing every secret, every fear, every victory, everything, the very essence of who they were, wrapping around each other, winding through each other as each lived the other\u0027s history, as every experience they had, they had together, with comfort and joy, with abandon and passion, without words or boundaries, and as often happens to two in love, time lost all meaning, and they might have stayed there, like that, forever.\u003c/p\u003e\n\u003cp\u003eWhen they finally fell out of it they were naked, on the bed, giggling like insane children.\u003c/p\u003e\n\u003cp\u003e\"Wow,\" Tommy said first.\u003c/p\u003e\n\u003cp\u003e\"Yeah,\" she said.\u003c/p\u003e\n\u003cp\u003e\"So, Okata saved you?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, he needed to save someone. He had always needed to save someone.\"\u003c/p\u003e\n\u003cp\u003e\"I know. I\u0027m okay with it, you know?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I know,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t do it, Jody. It\u0027s amazing, and I adore you, but I can\u0027t do it.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" she said, because she did. \"This is me now, Tommy. I like this, I like the night, I like the power. I like not being afraid. I was never anything until I was this. I love being this.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" he said. He knew that she had always been cute, but not beautiful. Always a little dissatisfied with who she was, worried about what men, or her mother, or anyone thought of her. But she was beautiful now. Strong. She was exactly what she wanted to be.\u003c/p\u003e\n\u003cp\u003eHe said, \"I need the words, Jody. It\u0027s who I am.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not a vampire. I\u0027m a writer. I came here to be a writer. I want to use gelatinous in a sentence. And not just once, but over and over. On the roof, under the moon, in an elevator, on the washing machine, and when I\u0027m exhausted, I want to lay in my own gelatinous sweat and use gelatinous in a sentence until I pass out.\"\u003c/p\u003e\n\u003cp\u003eJody said, \"I don\u0027t think gelatinous means what you think it means.\"\u003c/p\u003e\n\u003cp\u003e\"It doesn\u0027t matter. It\u0027s what I need to do. I need to write something. I need to write my little Holocaust girl story.\"\u003c/p\u003e\n\u003cp\u003e\"I thought it was a little girl growing up in the segregated South.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, whatever. It\u0027s important.\"\u003c/p\u003e\n\u003cp\u003e\"You know I know this already, right?\"\u003c/p\u003e\n\u003cp\u003e\"I know, but that\u0027s what I\u0027m saying, I need the words. I love you, but I need the words.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" she said. \"Let\u0027s go let Foo change you back into a word guy.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re going to go away?\"\u003c/p\u003e\n\u003cp\u003e\"I have to.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" he said. \"You know, I think that merging might have ruined me.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Because you\u0027re lying there completely naked and I don\u0027t want to sex you up.\"\u003c/p\u003e\n\u003cp\u003e\"Really?\"\u003c/p\u003e\n\u003cp\u003e\"Let me think about it. No, false alarm, I\u0027m okay.\"\u003c/p\u003e\n\u003cp\u003e\"C\u0027mere, writer boy. Let\u0027s break some furniture.\"\u003c/p\u003e\n\u003cp\u003eTHE RAVEN\u003c/p\u003e\n\u003cp\u003e\"Praise Jah\u0027s sweet love for given us a fired-haired snowy biscuit,\" Kona said. \"Welcome, me sweet deadie sistah. Welcome aboard.\"\u003c/p\u003e\n\u003cp\u003e\"Mistress,\" Jody said. \"Sweet deadie mistress.\"\u003c/p\u003e\n\u003cp\u003e\"Troot, mistress. Welcome aboard.\"\u003c/p\u003e\n\u003cp\u003eThe ship was a wonder of technology and luxury. Kona had lent Foo Dog his security bracelet and Foo had gone aboard and reset the security so the ship didn\u0027t kill anyone who set foot on board, then he and Kona had walked her through the ship showing her the thousand different ways it had been set to kill a person. It was an elegant, redundant death trap.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll want to turn the systems back on,\" Foo had said. \"There\u0027s a reason they had this kind of security.\"\u003c/p\u003e\n\u003cp\u003eJody said good-bye and led him off the ship. Now that she had one of his UV lasers in one hand and a number of vacuum blood vials in the other she followed the ersatz Rastaman down to the deepest chamber of the ship, where Foo had not gone. They approached a wide, white, waterproof hatch with a small porthole and a heavy stainless-steel wheel securing it.\u003c/p\u003e\n\u003cp\u003eKona hit a light switch. \"That make just a wee UV, mistress. Make dat dogheart bastid turn solid so he can\u0027t sneak out.\"\u003c/p\u003e\n\u003cp\u003eJody looked in the port and a face hit it with a snarl, leaving bloody spit on the thick glass.\u003c/p\u003e\n\u003cp\u003e\"Well, hello, pumpkin. How have you been?\"\u003c/p\u003e\n\u003cp\u003eThe vampire snarled. It was Elijah, the old vampire who had turned her, turned them all, really, if the legend was true. But he looked like a wild animal now, naked, his fangs bared, snarling at the tiny window.\u003c/p\u003e\n\u003cp\u003e\"Can he hear me?\" Jody asked.\u003c/p\u003e\n\u003cp\u003e\"Oh yeah, he hear. You got to tell him to go to the back of da room, ma. I\u0027n\u0027I can lock him back there with the second door. Like an airlock. Dat\u0027s how we feed dat old buggah.\"\u003c/p\u003e\n\u003cp\u003e\"Go to the back of the room, Elijah. I have something I need you to do.\"\u003c/p\u003e\n\u003cp\u003eThe vampire snarled at her.\u003c/p\u003e\n\u003cp\u003e\"Okey dokey,\" she said, and she put on her sunglasses, placed Foo\u0027s laser against the glass, and promptly blasted Elijah\u0027s right ear into ash.\u003c/p\u003e\n\u003cp\u003eHe roared at her.\u003c/p\u003e\n\u003cp\u003e\"Oh, I know that had to hurt. Hear that high whining sound, Elijah. That\u0027s the laser recharging. Takes about a minute. When it\u0027s done I\u0027m going to burn off your willie unless you get your ancient ass to the back of the cell.\" She smiled.\u003c/p\u003e\n\u003cp\u003e\"Shoots, brah, she a cold heart bitch don\u0027t you know. You outta-shoulda do what she say, yeah?\"\u003c/p\u003e\n\u003cp\u003eThe old vampire backed through the inside door, snarling, and Kona worked the switch, sealing it. Then he opened the heavy outer hatch.\u003c/p\u003e\n\u003cp\u003eJody placed the vacuum vials in the chamber, then said, \"Okay, Elijah, I need you to fill these with that sweet, first-generation vampire blood.\"\u003c/p\u003e\n\u003cp\u003eThey sealed the outer hatch, and Elijah snarled and resisted, but after having his other ear burned off, relented. Twenty minutes later Jody was holding the four vials of Elijah\u0027s blood and Elijah was lapping two quarts of tuna blood out of a stainless-steel bowl.\u003c/p\u003e\n\u003cp\u003e\"He be all right,\" Kona said. \"Dem ear heal up in minutes and he be back in the mystic fo\u0027 weeks.\"\u003c/p\u003e\n\u003cp\u003e\"And how long to get the rest of the art supplies onto the Raven?\" she asked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all on board, mistress.\"\u003c/p\u003e\n\u003cp\u003e\"Then cast off, Cap\u0027n.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, aye, mistress.\"\u003c/p\u003e\n\u003cp\u003eJody turned to Okata, who had stood silently, his eyes wide, watching the whole scene.\u003c/p\u003e\n\u003cp\u003e\"These are for you,\" she said, holding out the vials. \"I\u0027ll help you. I hope you like night scenes. You\u0027re going to have a lot of prints to make. But you\u0027ll have time.\"\u003c/p\u003e\n\u003cp\u003e\"Okay,\" said the swordsman, with a smile.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/bite-me-a-love-story-a-love-story-3/page-23.html","bookId":2044,"creation":"Oct 5, 2019 11:42:03 PM","modification":"Oct 5, 2019 11:42:03 PM"}
