{"id":64680,"no":3,"title":"Page 3","content":"\u003cp\u003e“I’m just talking, Tryst. Just words, my man. Anyway, all of that pussy whipping that’s got you so salty will be worth it when you kick her to the curb and I get a revenge fuck out of her, Nat style.”\u003c/p\u003e\n\u003cp\u003eI had his shirt in my hands, my temper going through the charts with a few sentences out of his asshole mouth.\u003c/p\u003e\n\u003cp\u003e“What the fuck is that supposed to mean?” I asked him through my teeth. “And what the fuck does Nat have to do with anything?”\u003c/p\u003e\n\u003cp\u003e“She fucked me, not a week after you broke it off. Let me do all kinds of messed up shit to her, just to get back at you. Joke was on her. You never found out until now, when you couldn’t give two fucks about who taps that.”\u003c/p\u003e\n\u003cp\u003e“What the fuck is wrong with you?” I was shaking with rage.\u003c/p\u003e\n\u003cp\u003e“Oh, my bad. You still give a shit who gets inside of Nat? Good to know, man.”\u003c/p\u003e\n\u003cp\u003eI shook him like a rag doll. I could feel how everyone had frozen around us, so my voice was quiet when I spoke. “Girlfriends, ex or not, are off-limits, and you fucking know it. It doesn’t matter what goes down, if you ever lay a finger on Danika, I will cut your dick off and fucking feed it to you. Do you understand? I don’t care if it’s ten years from now. You touch her, you’re dead.” I let him go, my fists clenching. I had to get away from him before I lost my mind and someone called the cops.\u003c/p\u003e\n\u003cp\u003eDean was still grinning like the crazy bastard he was. “I got your message loud and clear. Good to see that anger management is working for you. I’ll leave you alone so you can practice your zen and shit.”\u003c/p\u003e\n\u003cp\u003eHe walked away, whistling like nothing had happened.\u003c/p\u003e\n\u003cp\u003e“Crazy fucker,” I muttered to his back. He’d been blatantly baiting me, and still, it had worked. The idea of another man so much as shaking Danika’s hand made me lose my shit, and the idea of Dean, fucking dirtball Dean, having her, made me feel murderous.\u003c/p\u003e\n\u003cp\u003e“Tristan,” a breathless, all too familiar voice called my name softly, gripping my elbow.\u003c/p\u003e\n\u003cp\u003eI turned, giving Natalie an annoyed eyebrow lift in question. The woman was becoming a real nuisance. We’d gone years without so much as bumping into each other, but now that the old man had dumped her, she was everywhere I turned. I didn’t think for a second that it was an accident, and I was beginning to think back on the years of no contact with genuine affection. It was becoming apparent that even though we’d grown up together, we weren’t going to be able to be friends. She was never going to let go of the idea of us getting back together, and there was a no percent chance of that ever happening again.\u003c/p\u003e\n\u003cp\u003e“What do you want?” I asked her, ill-tempered and making no attempts to hide it.\u003c/p\u003e\n\u003cp\u003eShe smiled, unfazed. She was a sly one, and for years I’d mistaken that slyness for intelligence. It wasn’t that. Over time, I’d realized that she was nothing but a dumb bitch. “I had some things I wanted to talk to you about. Can we go somewhere private?”\u003c/p\u003e\n\u003cp\u003eThat was so crazy it was almost amusing. “Fuck no we can’t. My girlfriend hates your guts, on account of you being a fucking bitch to her, and the last thing I’m going to do is piss her off again because of you. If you have something to say to me, you can say it right here. And make it quick.”\u003c/p\u003e\n\u003cp\u003eShe touched my arm, smiling up at me. All I could think was that she wasn’t worth talking to for five seconds if it got Danika mad at me.\u003c/p\u003e\n\u003cp\u003e“Oh, Tryst, remember how it used to be?” Her tone was dreamy. I felt suffocated by it. “Remember the chemistry? We were so hot for each other. I’ve never felt anything like it, not before or since.”\u003c/p\u003e\n\u003cp\u003eI couldn’t help it, I laughed. It was not a happy laugh. I was too sick of her walks down memory lane to indulge her. Just over it. “That’s not how I remember it. I remember how you withheld sex to get your way. And the chemistry was nothing special. Frankly, I get better every night now. World’s better. No comparison.”\u003c/p\u003e\n\u003cp\u003eShe gasped in outrage, but I wasn’t done.\u003c/p\u003e\n\u003cp\u003e“I hope someday you find someone you really care about, Nat, someone you really love. Then you’ll realize that what you and I had was nothing but dumb puppy love.”\u003c/p\u003e\n\u003cp\u003eDANIKA\u003c/p\u003e\n\u003cp\u003eI abruptly stopped dancing as Tristan yelled something at Dean and grabbed his shirtfront.\u003c/p\u003e\n\u003cp\u003eNot again, I thought, cringing. Those two were at each other’s throats every time I turned around. Two men had never seemed less suited to be roommates, but roommates they were. I wasn’t sure how long that could last, but I’d be more relieved than anyone when they parted ways.\u003c/p\u003e\n\u003cp\u003e“What the ever-loving fuck did Dean do now?” Frankie muttered behind me, tugging on my arm.\u003c/p\u003e\n\u003cp\u003e“I should go try to break it up,” I said, the very idea just making me feel exhausted.\u003c/p\u003e\n\u003cp\u003e“No, you shouldn’t. You should come inside with me and let them sort it out.”\u003c/p\u003e\n\u003cp\u003e“I might be the only one that can calm him down,” I explained, but I followed her in.\u003c/p\u003e\n\u003cp\u003e“That is a very temporary solution to a much bigger problem. That man has got to learn not to lose his temper without you as a crutch.”\u003c/p\u003e\n\u003cp\u003eI knew she was right, but I still couldn’t stop worrying, and looking outside every few seconds, trying to gage if the situation was going to spiral out of control.\u003c/p\u003e\n\u003cp\u003eI was beyond relieved when Dean strode through the door, whistling. He even smiled when he saw me, as though the sight of me made him happy, when it never did.\u003c/p\u003e\n\u003cp\u003e“You,” he said, making it sound like an endearment. “I was just looking for you.”\u003c/p\u003e\n\u003cp\u003eThere was no way that was a good thing. The bastard was looking for trouble more than me, I just knew it. I crossed my arms over my chest, glaring at him. “Why? And what did you say to Tristan to get him riled again?”\u003c/p\u003e\n\u003cp\u003e“Let’s not pretend he isn’t always riled, yeah?”\u003c/p\u003e\n\u003cp\u003eI hated that he had a point.\u003c/p\u003e\n\u003cp\u003e“But that out there, that was nothing. He was just having a jealous fit about Nat and me hooking up. You have nothing to worry about, though. I’m sure that doesn’t mean he still has feelings for her. Oh and look,” he pointed out the window.\u003c/p\u003e\n\u003cp\u003eI turned to follow his stare, my body tensed up; my head messed up by what he’d said. I couldn’t shake my suspicion that Tristan still had feelings for that bitch, and what he’d said just validated it.\u003c/p\u003e\n\u003cp\u003eSure enough, Tristan was talking to Natalie, noticeably angry.\u003c/p\u003e\n\u003cp\u003e“I’m sure he’s telling her off for fucking me. But it doesn’t mean he still wants her. It’s totally normal to get pissed off about something that happened years ago with your ex-girlfriend, right?”\u003c/p\u003e\n\u003cp\u003eI hated that he spoke in my language, sarcasm, when everything he said pissed me off.\u003c/p\u003e\n\u003cp\u003e“Just go away, you little shit,” Frankie told him.\u003c/p\u003e\n\u003cp\u003eI was still staring outside at Tristan and Nat, watching how his face transformed as his scowl disappeared and a loud laugh escaped him that made my fists clench. She’d just said something that he thought was funny, and I hated it.\u003c/p\u003e\n\u003cp\u003e“Just remember. I’m always here if you want to make him jealous back.”\u003c/p\u003e\n\u003cp\u003eI ignored Dean completely until he went away, my eyes, every iota of my concentration on the couple speaking, and leaning close together outside. She touched his arm twice. I counted.\u003c/p\u003e\n\u003cp\u003e“I say we just leave. Just get out of here. You in the mood for some In-N-Out? It’s good drinking food.”\u003c/p\u003e\n\u003cp\u003e“Yes.” I turned decisively away from the window, done torturing myself with that. If he wanted to talk to his ex, he could wonder where the hell I’d gone. I didn’t particularly want a burger and I hadn’t had even a sip of alcohol, but that was not the point.\u003c/p\u003e\n\u003cp\u003eHe’d texted me five times by the time we were ten minutes away. I just watched the screen flash, not even reading them at first.\u003c/p\u003e\n\u003cp\u003e“Let’s talk it out, girl,” Frankie drawled, shooting me a sideways eyebrow lift. “You look mad enough to spit.”\u003c/p\u003e\n\u003cp\u003e“I think he still has feelings for her,” just sort of fell out of my mouth. I felt childish and paranoid, but I couldn’t shake the awful way it made me feel to see them talking to each other. “You don’t get jealous enough to fight somebody because they hooked up with someone you broke up with years ago unless you still care about that person, right?”\u003c/p\u003e\n\u003cp\u003eFrankie shook her head, sighing loudly and dramatically. “I don’t know. Those guys do have a rule about that. They don’t hook up with each other’s girlfriends, ex or not.”\u003c/p\u003e\n\u003cp\u003e“Yet they’ve slept up with the same women before. Makes no sense.”\u003c/p\u003e\n\u003cp\u003e“I doesn’t make any sense to me either. That is definitely a guy thing. Somehow calling a chick your girlfriend changes everything.”\u003c/p\u003e\n\u003cp\u003eMy phone dinged with another message, and I had the strong urge to chuck it out the window. “I need to stop going to these stupid parties with him all the time. They’re pure drama.” If I was honest with myself, I was terrified for him to go to one without me. Twatalie seemed to be lurking everywhere, just waiting for her chance.\u003c/p\u003e\n\u003cp\u003e“That’s not a bad idea. You have enough on your plate without dealing with Dean’s instigating ass.”\u003c/p\u003e\n\u003cp\u003e“I could have gotten some studying done tonight, or even just helped Jerry with the boys. Anything would have been better than going out and watching my man get chummy with his ex.”\u003c/p\u003e\n\u003cp\u003e“I know I’ve said it before, but if it helps I’ll say it again; I don’t think there’s a chance in hell he’d ever touch her with a ten foot pole.”\u003c/p\u003e\n\u003cp\u003eIt did help.\u003c/p\u003e\n\u003cp\u003eWe ate burgers and skipped the fries. We’d decided that the fries were the fattening part, and the burgers were just good solid protein.\u003c/p\u003e\n\u003cp\u003eWe were heading back before I checked my texts. I rolled my eyes when I saw that there were thirteen of them. The last one told me all I needed to know about his mood.\u003c/p\u003e\n\u003cp\u003eTristan: Where the fuck did you go?\u003c/p\u003e\n\u003cp\u003eI made a face at my phone for that one, and my reply was short.\u003c/p\u003e\n\u003cp\u003eDanika: Left with Frankie.\u003c/p\u003e\n\u003cp\u003eHis answer was immediate.\u003c/p\u003e\n\u003cp\u003eTristan: Why didn’t you tell me you were leaving?\u003c/p\u003e\n\u003cp\u003eThat was all the invitation I needed to vent.\u003c/p\u003e\n\u003cp\u003eDanika: I would have, but you were busy talking to Nat.\u003c/p\u003e\n\u003cp\u003eMy phone started ringing, and I cringed inwardly before answering.\u003c/p\u003e\n\u003cp\u003e“Hey…” I began.\u003c/p\u003e\n\u003cp\u003e“She fucking walked up to me!” his angry voice was loud enough that I held the phone away from my ear. “I wanted nothing to do with her. I never do. Where are you? I’m coming to get you.”\u003c/p\u003e\n\u003cp\u003e“We’re driving back to the party now.”\u003c/p\u003e\n\u003cp\u003e“We’re ten minutes out!” Frankie called loud enough to be heard on his end.\u003c/p\u003e\n\u003cp\u003e“Are you mad about this bullshit?” Tristan asked, his voice low and mean and just his tone would have had me mad if I wasn’t already.\u003c/p\u003e\n\u003cp\u003e“I don’t know. Are you mad enough about Natalie sleeping with Dean after you broke up to fight him over it?”\u003c/p\u003e\n\u003cp\u003eHe cursed on the other end. “That is not what happened. Dean is just trying to start shit, as usual.”\u003c/p\u003e\n\u003cp\u003e“Answer me this then: Are you upset that they slept together?”\u003c/p\u003e\n\u003cp\u003e“I’m not mad at Natalie. Believe me when I say that I couldn’t care less who she hooks up with. I’m upset with Dean. He’s crossing boundaries we set up fucking years ago, and he’s starting shit between you and me when there’s no call for it, and it’s none of his fucking business.” \u003c/p\u003e","sourceLink":"https://allnovel.net/rock-bottom-tristan-danika-2/page-3.html","bookId":1930,"creation":"Oct 5, 2019 9:55:24 AM","modification":"Oct 5, 2019 9:55:24 AM"}
