{"id":64249,"no":17,"title":"Page 17","content":"\u003cp\u003e\"You did at that.\"\u003c/p\u003e\n\u003cp\u003e\"But,\" he went on, \"there\u0027s an easy way to do that, and it\u0027s done all the time, and not necessarily to defraud an insurance company. All you have to do is get in your car and drive into a bridge abutment. I don\u0027t know what the best guesses are as to percentages, but the conventional wisdom holds that a whole lot of unwitnessed single-car accidents are nothing but suicide, whether preplanned or spontaneous. It\u0027s a foolproof method for killing yourself and being buried with the full rites of the Catholic church, and it would be just as effective in getting double payment from John Hancock and his friends.\"\u003c/p\u003e\n\u003cp\u003eI thought of the earnest lady from the Hemlock Society. \"And for city dwellers who don\u0027t have cars-\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s always the subway. You lose your balance and fall in front of it. Here\u0027s the kicker, though. Say you\u0027re determined to make it look like murder. Unless your name is Ed Hoch or John Dickson Carr, you\u0027re not going to turn it into a fucking locked room murder, are you? Because that\u0027s what this is. The security\u0027s so tight, between the bodyguards and the burglar alarm, nobody can figure out how the hell Will got in there to drop the poison in. It\u0027s so obviously impossible that half the city\u0027s convinced Adrian must have done it himself, which is just what he\u0027s supposed to have attempted to conceal. Does that make any sense to you?\"\u003c/p\u003e\n\u003cp\u003e\"Wherever Adrian is now,\" I said, \"if he needs an attorney, I think he ought to pick a guy named Gruliow.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m right, though, wouldn\u0027t you say? Makes no sense.\"\u003c/p\u003e\n\u003cp\u003e\"I agree.\"\u003c/p\u003e\n\u003cp\u003e\"Well, let me frost the cupcake for you. All his coverage was term insurance, and there wasn\u0027t a single policy with a double-indemnity clause. Case closed.\"\u003c/p\u003e\n\u003cp\u003eHe was convincing, but I wasn\u0027t entirely convinced. I\u0027d seen too many people do too many illogical things to rule out any act by a human being on the grounds that it didn\u0027t make sense.\u003c/p\u003e\n\u003cp\u003eMeanwhile, there was still Will to be considered. Even if Adrian Whitfield had died by his own hand, you had to give Will an assist at the very least. One columnist argued, perhaps facetiously, that the anonymous killer was getting more powerful every time. He\u0027d had to get out there and kill his first three victims all by himself, but all he\u0027d had to do was point a finger at numbers four and five. Once targeted by Will, they were struck down with no effort on his part, Rashid by an enemy within his gates, Whitfield by an even more intimate enemy, the one who lived within his own skin.\u003c/p\u003e\n\u003cp\u003e\"Pretty soon he won\u0027t even have to write letters,\" Denis Hamill concluded. \"He\u0027ll just think his powerful thoughts in private, and the bad guys\u0027ll be dropping like flies.\"\u003c/p\u003e\n\u003cp\u003eFunny, I thought, that we hadn\u0027t heard from him.\u003c/p\u003e\n\u003cp\u003eTuesday morning I was up before Elaine, and I had breakfast on the table when she got out of the shower. \"Great cantaloupe,\" she pronounced. \"Much better than yesterday.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the other half of the one we had yesterday,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Oh,\" she said. \"I guess it\u0027s the preparation.\"\u003c/p\u003e\n\u003cp\u003e\"I put it on a plate,\" I said, \"and I set it in front of you.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, that\u0027s just what you did, you old bear. And nobody could have done it better, either.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all in the wrist.\"\u003c/p\u003e\n\u003cp\u003e\"Must be.\"\u003c/p\u003e\n\u003cp\u003e\"Combined with a sort of Zen approach,\" I said. \"I was concentrating on something else while I just let breakfast happen.\"\u003c/p\u003e\n\u003cp\u003e\"Concentrating on what?\"\u003c/p\u003e\n\u003cp\u003e\"On a dream I can\u0027t remember.\"\u003c/p\u003e\n\u003cp\u003e\"You hardly ever remember your dreams.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" I said, \"but I woke up with the feeling that there was something this dream was trying to tell me, and it seemed to me it was a dream I\u0027d had before. In fact-\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Well, I have the sense of having been dreaming this dream a lot lately.\"\u003c/p\u003e\n\u003cp\u003e\"The same dream.\"\u003c/p\u003e\n\u003cp\u003e\"I think so.\"\u003c/p\u003e\n\u003cp\u003e\"Which you can\u0027t remember.\"\u003c/p\u003e\n\u003cp\u003e\"It had a familiarity to it,\" I said, \"as if I\u0027d been there before. I don\u0027t know if it\u0027s the same dream each time, but I think I keep dreaming about the same person each time. He\u0027s right there, and he\u0027s looking very earnest and trying to tell me some thing, and I wake up and he\u0027s gone.\"\u003c/p\u003e\n\u003cp\u003e\"Like a puff of smoke.\"\u003c/p\u003e\n\u003cp\u003e\"Sort of.\"\u003c/p\u003e\n\u003cp\u003e\"Like your lap when you stand up.\"\u003c/p\u003e\n\u003cp\u003e\"Well…\"\u003c/p\u003e\n\u003cp\u003e\"Who is he?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the problem,\" I said. \"I don\u0027t remember who he is, and no matter how much I try to remember-\"\u003c/p\u003e\n\u003cp\u003e\"Quit trying.\"\u003c/p\u003e\n\u003cp\u003e\"Huh?\"\u003c/p\u003e\n\u003cp\u003eShe rose, moved to stand behind me. She smoothed my hair back with the tips of her fingers. \"There\u0027s nothing to remember,\" she said. \"Just ease up. So don\u0027t try to remember. Just answer the question. Who\u0027d you dream about?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay. Imagine Adrian Whitfield.\"\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t Adrian Whitfield.\"\u003c/p\u003e\n\u003cp\u003e\"Of course it wasn\u0027t. Imagine him anyway.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"Now imagine Vollman.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"The one who killed those kids.\"\u003c/p\u003e\n\u003cp\u003e\"Vollmer.\"\u003c/p\u003e\n\u003cp\u003e\"Fine, Vollmer. Imagine him.\"\u003c/p\u003e\n\u003cp\u003e\"It wasn\u0027t-\"\u003c/p\u003e\n\u003cp\u003e\"I know it wasn\u0027t. Humor me, okay? Imagine him.\"\u003c/p\u003e\n\u003cp\u003e\"All right.\"\u003c/p\u003e\n\u003cp\u003e\"Now imagine Ray Gruliow.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t dream about Ray,\" I said, \"and this isn\u0027t going to work. I appreciate what you\u0027re trying to do-\"\u003c/p\u003e\n\u003cp\u003e\"I know you do.\"\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s not going to work.\"\u003c/p\u003e\n\u003cp\u003e\"I know. Can I ask you a couple of questions?\"\u003c/p\u003e\n\u003cp\u003e\"I suppose so.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s your name?\"\u003c/p\u003e\n\u003cp\u003e\"Matthew Scudder.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s your wife\u0027s name?\"\u003c/p\u003e\n\u003cp\u003e\"Elaine Mardell. Elaine Mardell Scudder.\"\u003c/p\u003e\n\u003cp\u003e\"Do you love her?\"\u003c/p\u003e\n\u003cp\u003e\"Do you have to ask?\"\u003c/p\u003e\n\u003cp\u003e\"Just answer the question. Do you love her?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027d you dream about?\"\u003c/p\u003e\n\u003cp\u003e\"Nice try, but it\u0027s not going to…\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be a son of a bitch.\"\u003c/p\u003e\n\u003cp\u003e\"So? Are you going to tell me?\"\u003c/p\u003e\n\u003cp\u003e\"Pleased with yourself, aren\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Pleased beyond measure, and-now stop that!\"\u003c/p\u003e\n\u003cp\u003e\"I just want to touch it for a minute.\"\u003c/p\u003e\n\u003cp\u003e\"Say the name, will you? Before it slips your mind again.\"\u003c/p\u003e\n\u003cp\u003e\"It won\u0027t,\" I said. \"Now why in the hell would I dream about him?\"\u003c/p\u003e\n\u003cp\u003e\"Fine, keep me in suspense.\"\u003c/p\u003e\n\u003cp\u003e\"Glenn Holtzmann,\" I said. \"How did you do that?\"\u003c/p\u003e\n\u003cp\u003e\"Ve haff vays of making you remember.\"\u003c/p\u003e\n\u003cp\u003e\"So it would seem. Glenn Holtzmann. Why Glenn Holtzmann, for Christ\u0027s sake?\"\u003c/p\u003e\n\u003cp\u003eI was no closer to the answer an hour later when I went downstairs for the papers. Then I forgot Glenn Holtzmann for the time being.\u003c/p\u003e\n\u003cp\u003eThere had been another letter from Will.\u003c/p\u003e\n\u003cp\u003e9\u003c/p\u003e\n\u003cp\u003e\"An Open Letter to the People of New York.\"\u003c/p\u003e\n\u003cp\u003eThat\u0027s how Will headed it. He had addressed and mailed it, like all the others, to Marty McGraw at the Daily News, and they were the ones with the story. They gave it the front-page headline and led with it, under McGraw\u0027s byline. His column, \"Since You Asked…\" ran as a sidebar, and the full text of Will\u0027s letter appeared on the page opposite. It was a long letter for Will, running to just under eight hundred words, which made it just about the same length as McGraw\u0027s column.\u003c/p\u003e\n\u003cp\u003eHe started out by claiming credit (or assuming responsibility) for the murder of Adrian Whitfield. His tone was boastful; he talked at first about the elaborate security set up to protect Whitfield, the burglar alarm, the three shifts of bodyguards, the armor-plated limousine with the bulletproof glass. \"But no man can prevail against the Will of the People,\" he proclaimed. \"No man can run from it. No man can hide from it. Consider Roswell Berry, who fled to Omaha. Consider Julian Rashid, behind his fortified walls in St. Albans. The Will of the People can reach across vast space, it can slip through the stoutest defenses. No man can resist it.\"\u003c/p\u003e\n\u003cp\u003eWhitfield, Will went on, was by no means the worst lawyer in the world. It had simply been his lot to serve as representative of an ineradicable evil in the legal profession, an apparent willingness to do anything, however abhorrent and immoral, in the service of a client. \"We nod in approval when an attorney defends the indefensible, and even tolerate behavior in a client\u0027s interest which would earn the lawyer a horsewhipping were he so to act on his own behalf.\"\u003c/p\u003e\n\u003cp\u003eThen Will launched into an evaluation of the legal system, questioning the value of the jury system. There was nothing startlingly original about any of the points he raised, though he argued them reasonably enough so that you found yourself ready to forget you were reading the words of a serial murderer.\u003c/p\u003e\n\u003cp\u003eHe ended on a personal note. \"I find I\u0027m tired of killing. I am grateful to have been the instrument selected to perform these several acts of social surgery. But there is a heavy toll taken on him who is called upon to do evil in the service of a greater good. I\u0027ll rest now, until the day comes when I\u0027m once again called to act.\"\u003c/p\u003e\n\u003cp\u003eI had a question, and I made half a dozen phone calls trying to get an answer. Eventually I got around to calling the News. I gave my name to the woman who answered and said I\u0027d like to talk to Marty McGraw. She took my number, and within ten minutes the phone rang.\u003c/p\u003e\n\u003cp\u003e\"Marty McGraw,\" he said. \"Matthew Scudder, you\u0027re the detective Whitfield hired, right? I think we might have met once.\"\u003c/p\u003e\n\u003cp\u003e\"Years ago.\"\u003c/p\u003e\n\u003cp\u003e\"Most of my life is years ago. What have you got for me?\"\u003c/p\u003e\n\u003cp\u003e\"A question. Did the letter run verbatim?\"\u003c/p\u003e\n\u003cp\u003e\"Absolutely. Why?\"\u003c/p\u003e\n\u003cp\u003e\"No cuts at all? Nothing held back at the cops\u0027 request?\"\u003c/p\u003e\n\u003cp\u003e\"Now how could I tell you that?\" He sounded aggrieved. \"For all I know, you could be Will yourself.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re absolutely right,\" I said. \"On the other hand, if I were Will, I\u0027d probably know whether or not you cut my copy.\"\u003c/p\u003e\n\u003cp\u003e\"Jesus,\" he said, \"I\u0027d hate to be the one to do something like that. I know how I get when that mutt at the big desk cuts my copy, and I\u0027m not a homicidal maniac.\"\u003c/p\u003e\n\u003cp\u003e\"Well, neither am I. Look, here\u0027s what I\u0027m getting at. As far as I can tell, there\u0027s nothing in the letter to disprove the suicide theory.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s Will\u0027s word on the subject. He says he did it.\"\u003c/p\u003e\n\u003cp\u003e\"And he\u0027s never lied to us in the past.\"\u003c/p\u003e\n\u003cp\u003e\"As far as I know,\" he said, \"he hasn\u0027t. With Roswell Berry in Omaha he refused to confirm or deny, but he was being cute.\"\u003c/p\u003e\n\u003cp\u003e\"He mentioned that Berry\u0027d been stabbed, if I remember correctly.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right, and that was information the police had held back, so that certainly suggested he\u0027d had a hand in it.\"\u003c/p\u003e\n\u003cp\u003e\"Well, is there anything like that in the latest letter? Because I couldn\u0027t spot it. That\u0027s why I wondered if anything had been cut.\"\u003c/p\u003e\n\u003cp\u003e\"No, we ran it verbatim. I wasn\u0027t kidding when I said I\u0027d hate to be the one to cut his copy. I\u0027m already getting more attention than I want from the guy.\"\u003c/p\u003e\n\u003cp\u003e\"I can see where it must have cost you a lot of readers.\"\u003c/p\u003e\n\u003cp\u003eHis laugh was like a terrier\u0027s bark. \"In that respect,\" he admitted, \"it s a fucking godsend. My only regret is he didn\u0027t get this rolling before my recent contract negotiations. Same time, a person gets nervous being Will\u0027s window on the world. I have to figure he\u0027s reading me three times a week. Suppose he doesn\u0027t like what I write? Last thing I want to do is piss off an original thinker like him.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/even-the-wicked-matthew-scudder-13/page-17.html","bookId":2331,"creation":"Oct 5, 2019 9:54:02 AM","modification":"Oct 5, 2019 9:54:02 AM"}
