{"id":97846,"no":25,"title":"Page 25","content":"\u003cp\u003eWhen I awoke the following morning, the sun had crested the mountains surrounding the valley. I really wasn\u0027t on my side of the bed anymore. Hell, I wasn\u0027t on the bed. Half of my body was sprawled across Daemon\u0027s chest. Our legs were tangled together under the comforter.\u003c/p\u003e\n\u003cp\u003eOne of his arms was around my waist like a band of steel. My hand was on his stomach. I could feel his heart beating under my cheek, steady and strong.\u003c/p\u003e\n\u003cp\u003eI lay there, my breath in my throat.\u003c/p\u003e\n\u003cp\u003eThere was something intimate about being wrapped around one another in a bed. Like lovers.\u003c/p\u003e\n\u003cp\u003eA sweet, hot fire washed over my skin, and I squeezed my eyes shut. Every inch of me was hyper-aware of him. Of how my body fit against his, the way his thighs were pressed against mine, the hardness of his stomach under my hand.\u003c/p\u003e\n\u003cp\u003eMy hormones kicked in with the power of a dropkick to the stomach. Heated lightning zipped through my veins. For a moment, I pretended. Not that we weren\u0027t two different species, because I didn\u0027t see him that way, but that we actually liked one another.\u003c/p\u003e\n\u003cp\u003eAnd then he shifted and rolled. I was on my back, and he was still on the move. His face burrowed into the space between my neck and shoulder, nuzzling. Sweet baby Jesus...Warm breath danced over my skin, sending shivers down my body. His arm was heavy against my stomach, his leg between mine, pushing up and up. Scorched air fled my lungs.\u003c/p\u003e\n\u003cp\u003eDaemon murmured in a language I couldn\u0027t understand. Whatever it was, it sounded beautiful and soft. Magical. Unearthly.\u003c/p\u003e\n\u003cp\u003eI could\u0027ve woken him up but for some reason I didn\u0027t. The thrill of him touching me was far stronger than anything else.\u003c/p\u003e\n\u003cp\u003eHis hand was on the edge of the borrowed shirt, his long fingers on the strip of exposed flesh between the hem of the shirt and the band of the worn pajama bottoms. And his hand inched up under the shirt, across my stomach, where it dipped slightly. My pulse went into cardiac territory. The tips of his fingers brushed my ribs. His body moved, his knee pressed against me.\u003c/p\u003e\n\u003cp\u003eI gasped.\u003c/p\u003e\n\u003cp\u003eDaemon stilled. No one moved. The clock on the wall ticked.\u003c/p\u003e\n\u003cp\u003eAnd I cringed.\u003c/p\u003e\n\u003cp\u003eHe lifted his head. Eyes like pools of liquid grass stared at me in confusion. They quickly cleared, though, turning sharp and hard within seconds.\u003c/p\u003e\n\u003cp\u003e\"Good morning?\" I squeaked.\u003c/p\u003e\n\u003cp\u003eUsing his powerful arms, he lifted himself up. His eyes never left mine. Daemon seemed to drag in a deep breath. I wasn\u0027t sure if he let it out. Something passed between us, unspoken and heavy. His eyes narrowed. I had the funny feeling that he was sizing up the situation and somehow I was to blame for his sleepy - albeit really, really nice - fondling.\u003c/p\u003e\n\u003cp\u003eLike any of this was my fault.\u003c/p\u003e\n\u003cp\u003eWithout saying a word, he disappeared above me. The door opened and slammed shut behind him without my even catching a glimpse of him.\u003c/p\u003e\n\u003cp\u003eI stayed there, staring at the ceiling, heart pounding. Cheeks flushed, my body way, way too hot. Not sure of how much time passed, but the door opened again, at normal human speed.\u003c/p\u003e\n\u003cp\u003eDee popped her head in, her eyes wide. \"Did you two...?\"\u003c/p\u003e\n\u003cp\u003eFunny that out of everything that had happened in the last twenty-four hours, that was the first question she asked.\u003c/p\u003e\n\u003cp\u003e\"No,\" I said, barely recognizing my own voice. I cleared my throat. \"I mean, we slept together, but not slept, slept together.\" I rolled over, burying my face into a pillow.\u003c/p\u003e\n\u003cp\u003eIt smelled like him - crisp and warm. Like autumn leaves. I groaned.\u003c/p\u003e\n\u003cp\u003eI was sure that if someone had told me I\u0027d find myself sitting in a room with half a dozen aliens on a Saturday afternoon, I would\u0027ve told them to get off the drugs. Yet, here I was, sitting in a recliner in the Black household, legs tucked under me but ready to run for the door if necessary.\u003c/p\u003e\n\u003cp\u003eDaemon was perched on the arm of the recliner, arms folded over his chest. The very chest I\u0027d woken up on. A flush crept up my throat. We hadn\u0027t spoken. Not a single word, which was okay by me.\u003c/p\u003e\n\u003cp\u003eBut his current position had been duly noted by everyone. Dee looked oddly smug. A deep, unforgiving scowl had settled on Ash\u0027s and Andrew\u0027s faces, but the fact I was here overshadowed any reason why Daemon could be playing guard dog.\u003c/p\u003e\n\u003cp\u003eMr. Garrison had come up short. \"What is she doing here?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s lit up like a freaking disco ball,\" Ash said accusingly. \"I could probably see her from Virginia.\"\u003c/p\u003e\n\u003cp\u003eSomehow, she made the whole glowing thing sound like I was covered in boils instead of light. I glared at her openly.\u003c/p\u003e\n\u003cp\u003e\"She was with me last night when the Arum attacked,\" Daemon responded calmly. \"You know that. Things got a little...explosive. There was no way I could cover what happened.\" Mr. Garrison ran a hand through his brown hair. \"Daemon, of all people, I expected you to know better, to be more careful.\"\u003c/p\u003e\n\u003cp\u003e\"What the hell was I supposed to do exactly? Knock her out before the Arum attacked?\"\u003c/p\u003e\n\u003cp\u003eAsh arched a brow. The look on her face said it wasn\u0027t such a bad idea.\u003c/p\u003e\n\u003cp\u003e\"Katy has known about us since the beginning of school,\" Daemon said. \"And trust me when I say I did everything possible to keep her from knowing.\"\u003c/p\u003e\n\u003cp\u003eOne of the Thompson boys sucked in a sharp breath. \"She\u0027s known this entire time?\u003c/p\u003e\n\u003cp\u003eHow could you allow this, Daemon? All of our lives have been in the hands of some human?\" Dee rolled her eyes. \"Obviously she hasn\u0027t said a word, Andrew. Chill out.\"\u003c/p\u003e\n\u003cp\u003e\"Chill out?\" Andrew\u0027s scowl matched Ash\u0027s perfectly. And now I knew which one was Andrew, I could tell them apart. Andrew had an earring in the left ear. Adam, who was quiet, did not. \"She\u0027s a stupid - \"\u003c/p\u003e\n\u003cp\u003e\"Be careful with what you say next.\" Daemon\u0027s voice was low but carried. \"Because what you don\u0027t know and what you can\u0027t possibly understand will get a bolt of light in your face.\"\u003c/p\u003e\n\u003cp\u003eMy eyes widened, as did pretty much everyone\u0027s in the room. Ash swallowed thickly and turned her cheek, letting her blonde hair cover her face.\u003c/p\u003e\n\u003cp\u003e\"Daemon,\" Mr. Garrison said, stepping forward. \"Threatening one of your own for her?\u003c/p\u003e\n\u003cp\u003eI didn\u0027t expect this from you.\" His shoulders stiffened. \"It\u0027s not like that.\" I took a deep breath. \"I\u0027m not going to tell anyone about you guys. I know the risks to you and to me if I did. You all don\u0027t have anything to worry about.\"\u003c/p\u003e\n\u003cp\u003e\"And who are you for us to trust?\" Mr.\u003c/p\u003e\n\u003cp\u003eGarrison asked, his eyes narrowed on me.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t get me wrong. I\u0027m sure you\u0027re a great girl. You\u0027re smart and you seem to have your head on straight, but this is life or death for us.\u003c/p\u003e\n\u003cp\u003eOur freedom. Trusting a human is not something we can afford.\"\u003c/p\u003e\n\u003cp\u003e\"She saved my life last night,\" Daemon said.\u003c/p\u003e\n\u003cp\u003eAndrew laughed. \"Oh, come on, Daemon.\u003c/p\u003e\n\u003cp\u003eThe Arum must\u0027ve knocked you around. There is no way a human could\u0027ve saved any of our lives.\"\u003c/p\u003e\n\u003cp\u003e\"What is it with you?\" I snapped, unable to stop myself. \"You act like we\u0027re incapable of doing anything. Sure, you guys are whatever, but that doesn\u0027t mean we\u0027re single-celled organisms.\"\u003c/p\u003e\n\u003cp\u003eA choked laugh came from Adam.\u003c/p\u003e\n\u003cp\u003e\"She did save my life.\" Daemon stood, drawing everyone\u0027s attention. \"There were three Arum that attacked, the brethren of one I killed.\u003c/p\u003e\n\u003cp\u003eI was able to destroy one, but the two overpowered me. They had me down and had already begun reaching for my powers. I was a goner.\"\u003c/p\u003e\n\u003cp\u003e\"Daemon,\" Dee said, paling. \"You didn\u0027t tell us any of this.\"\u003c/p\u003e\n\u003cp\u003eMr. Garrison still looked doubtful. \"I don\u0027t see how she could\u0027ve helped. She\u0027s a human.\u003c/p\u003e\n\u003cp\u003eThe Arum are powerful, amoral, and vicious.\u003c/p\u003e\n\u003cp\u003eHow can one girl stand against them?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d given her the obsidian blade I carry and told her to run.\"\u003c/p\u003e\n\u003cp\u003e\"You gave her the blade when you could\u0027ve used it?\" Ash sounded stunned. \"Why?\" Her eyes darted to me. \"You don\u0027t even like her.\"\u003c/p\u003e\n\u003cp\u003e\"That may be the case, but I wasn\u0027t going to let her die because I don\u0027t like her.\" I flinched. Dayum. An ache started in my chest, like a burning coal, even though I didn\u0027t care.\u003c/p\u003e\n\u003cp\u003e\"But you could\u0027ve been hurt,\" Ash protested. Fear thickened her voice. \"You could\u0027ve been killed because you gave your best defense to her.\"\u003c/p\u003e\n\u003cp\u003eDaemon sighed, sitting back down on the arm of the recliner. \"I have other ways to defend myself. She did not. She didn\u0027t run like I told her. Instead she came back and she killed the Arum who was about to end me.\" Reluctant pride shone in my bio teacher\u0027s eyes. \"That is...admirable.\"\u003c/p\u003e\n\u003cp\u003eI rolled my eyes, starting to get a headache.\u003c/p\u003e\n\u003cp\u003e\"It was a hell of a lot more than admirable,\" Dee interjected, staring at me. \"She didn\u0027t have to do that. That has to account for more than being admirable.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s courageous,\" Adam said quietly, staring at the throw rug. \"It is what any of us would\u0027ve done.\"\u003c/p\u003e\n\u003cp\u003e\"But that doesn\u0027t change the fact that she knows about us,\" Andrew shot back, casting his twin a scornful look. \"And we are forbidden from telling any human.\"\u003c/p\u003e\n\u003cp\u003e\"We didn\u0027t tell her,\" Dee said, stirring restlessly. \"It kind of happened.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, like it happened last time.\" Andrew rolled his eyes as he turned to Mr. Garrison.\u003c/p\u003e\n\u003cp\u003e\"This is unbelievable.\"\u003c/p\u003e\n\u003cp\u003eMr. Garrison shook his head. \"After Labor Day weekend, you told me that something occurred but you took care of it.\"\u003c/p\u003e\n\u003cp\u003e\"What happened?\" Ash asked, obvious this was the first she\u0027d heard of anything. \"You\u0027re talking about the first time she was glowing?\" I was like a glowworm, apparently.\u003c/p\u003e\n\u003cp\u003e\"What happened?\" asked Adam, sounding curious.\u003c/p\u003e\n\u003cp\u003e\"I walked out in front of a truck.\" I waited for the inevitable \"duh\" look, which I got.\u003c/p\u003e\n\u003cp\u003eAsh stared at Daemon, her blue eyes growing to the size of saucers. \"You stopped the truck?\"\u003c/p\u003e\n\u003cp\u003eHe nodded.\u003c/p\u003e\n\u003cp\u003eA crestfallen look appeared on her face as she looked away. \"Obviously that couldn\u0027t be explained away. She\u0027s known since then?\" I figured this wasn\u0027t the time to mention that I had my suspicions before then.\u003c/p\u003e\n\u003cp\u003e\"She didn\u0027t freak out,\" Dee said. She listened to us, understood why it\u0027s important, and that\u0027s it. Until last night, what we are hasn\u0027t even been an issue.\"\u003c/p\u003e\n\u003cp\u003e\"But you lied to me - both of you.\" Mr.\u003c/p\u003e\n\u003cp\u003eGarrison leaned against the wall, in a space between their TV and an overstocked bookcase.\u003c/p\u003e\n\u003cp\u003e\"How am I to trust you now?\"\u003c/p\u003e\n\u003cp\u003eA dull, stabbing pain flared behind my eyes.\u003c/p\u003e\n\u003cp\u003e\"Look, I understand the risk. More than any of you in the room,\" Daemon said, rubbing his chest where the Arum had shoved his shadowy hand. \"But what is done is done. We need to move forward.\"\u003c/p\u003e\n\u003cp\u003e\"As in contacting the DOD?\" Andrew asked. \"I\u0027m sure they\u0027d know what to do with her.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to see you try that, Andrew. Really I would, because even after last night, and I\u0027m not yet fully charged, I could still kick your ass.\" Mr. Garrison cleared his throat. \"Daemon, threats aren\u0027t necessary.\"\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t they?\" Daemon asked.\u003c/p\u003e\n\u003cp\u003eA heavy silence fell in the room. I think Adam was on our side, but it was clear that Andrew and Ash weren\u0027t. When Mr. Garrison finally spoke, I had a hard time meeting his gaze.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t think this is wise,\" he said. \"Not with what...with what happened before, but I\u0027m not going to turn you over. Not unless you give me reason to. And maybe you won\u0027t. I don\u0027t know. Humans are such...fickle creatures. What we are, what we can do, has to be protected at all costs. I think you understand that.\" He paused, clearing his throat. \"You\u0027re safe, but we aren\u0027t.\" Andrew and Ash looked less than thrilled by Mr.\u003c/p\u003e\n\u003cp\u003eGarrison\u0027s decision, but they didn\u0027t push it.\u003c/p\u003e\n\u003cp\u003eOther than exchanging looks with one another, they moved on to how to deal with the last Arum.\u003c/p\u003e\n\u003cp\u003e\"He won\u0027t wait. They\u0027re not known for being patient,\" Mr. Garrison said, sitting down on the couch. \"I could contact the other Luxen, but I\u0027m not sure if that would be smart. Where we may be more confident in her, they won\u0027t be.\"\u003c/p\u003e\n\u003cp\u003e\"And there\u0027s the problem that she\u0027s a megawatt light bulb right now,\" Ash added. \"It doesn\u0027t even matter if we don\u0027t say anything.\u003c/p\u003e\n\u003cp\u003eThe moment she goes anywhere in town, they are going to know that something big happened again.\" I scowled at her. \"Well, I don\u0027t know what I\u0027m supposed to do about that.\"\u003c/p\u003e\n\u003cp\u003e\"Any suggestions?\" Daemon said. \"Because the sooner she\u0027s not carrying a trace, the better all of this is going to be.\"\u003c/p\u003e\n\u003cp\u003eYeah, because I bet he was looking forward to babysitting me again.\u003c/p\u003e\n\u003cp\u003e\"Who cares?\" Andrew said, rolling his eyes.\u003c/p\u003e\n\u003cp\u003e\"We have the Arum issue to worry about. He\u0027s gonna see her no matter where we put her. All of us, right now, are in danger. Any of us near her are in danger. We can\u0027t wait around. We have to find the last Arum.\" Dee shook her head. \"If we can get the trace off her, then that will buy us time to find him. Getting rid of the trace should be the first priority.\"\u003c/p\u003e\n\u003cp\u003e\"I say we drive her out to the middle of nowhere and leave her ass there,\" Andrew muttered.\u003c/p\u003e\n\u003cp\u003e\"Thanks,\" I said, rubbing my temples.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re so very helpful with all of this.\" He smiled at me. \"Hey, just offering my suggestions.\"\u003c/p\u003e\n\u003cp\u003e\"Shut up, Andrew,\" Daemon said.\u003c/p\u003e\n\u003cp\u003eAndrew rolled his eyes.\u003c/p\u003e\n\u003cp\u003e\"Once we get the trace off her, she\u0027d be safe,\" Dee insisted and tucked her hair back, face pinched. \"The Arum don\u0027t mess with humans, really. Sarah...she\u0027d been in the wrong place at the wrong time.\" They launched into another discussion about what was more important: locking me up somewhere, which didn\u0027t make sense because my light could be seen through anything, or trying to figure out a way to make the trace fade other than killing me.\u003c/p\u003e\n\u003cp\u003eAnd I seriously think Andrew believed that was a valid consideration. Asshole.\u003c/p\u003e\n\u003cp\u003e\"I have an idea,\" Adam said. Everyone looked at him. \"The light around her is a byproduct of us using our power, right? And our power is concentrated energy. And we get weaker when we use our powers and use more energy.\" Mr. Garrison blinked, his eyes sparking with interest. \"I think I\u0027m following you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not,\" I muttered.\u003c/p\u003e\n\u003cp\u003e\"Our powers fade the more we use them, the more energy we exert.\" Adam turned to Daemon. \"It should work the same with our traces, because the trace is just residual energy we are leaving on someone. We get her to exert her own energy; it should fade what\u0027s around her. Maybe not completely, but get it down to levels that aren\u0027t going to draw every Arum on Earth to us.\" That hardly made any sense to me, but Mr. Garrison was nodding. \"It should work.\" Daemon scratched his chest, his expression doubtful. \"And how are we going to get her to exert energy.\"\u003c/p\u003e\n\u003cp\u003eAndrew grinned from across the room. \"We could take her out to a field and chase her around in our cars. That sounds fun.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, fuc - \"\u003c/p\u003e\n\u003cp\u003eDaemon\u0027s laugh cut me off. \"I don\u0027t think that\u0027s a good idea. Funny, but not a good idea.\u003c/p\u003e\n\u003cp\u003eHumans are fragile.\"\u003c/p\u003e\n\u003cp\u003e\"How about I shove my fragile foot up your ass,\" I said, irritated. My head was pounding, and I didn\u0027t find a single one of them funny. I pushed Daemon off the arm of the chair and stood. \"I\u0027m getting a drink. Let me know when guys come up with anything that won\u0027t potentially kill me in the process.\" Their conversation continued as I hurried from the room. I wasn\u0027t thirsty. I just had to get out of there, away from them. My nerves felt shot.\u003c/p\u003e\n\u003cp\u003eEntering the kitchen, I ran my hands through my hair. Blissful silence eased some of the pounding in my head. I squeezed my eyes shut until small spots danced behind my closed lids.\u003c/p\u003e\n\u003cp\u003e\"I figured you\u0027d be hiding in the kitchen.\" I yelped at the sound of Ash\u0027s quiet voice.\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" she said, leaning against the counter. \"I didn\u0027t mean to scare you.\" Not sure if I believed that. \"Okay.\" Up close, Ash was the kind of beautiful that made me wish I could drop twenty pounds and run to the nearest makeup department. She knew it, too. There was a confidence in the tilt of her chin. \"This must be a lot for you to handle, learning everything and then facing what you did last night.\" I eyed her warily. Even though she wasn\u0027t trying to snap my head off, I wasn\u0027t going to relax. \"It\u0027s been different.\" A faint smile crossed her pouty lips. \"What did that TV show say? \u0027The truth is out there.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"X-Files,\" I told her. \"I\u0027ve wanted to watch Close Encounters of the Third Kind ever since I found out. Seems like the most realistic of all the alien movies.\"\u003c/p\u003e\n\u003cp\u003eAnother small smile and then she looked up, meeting my eyes. \"I\u0027m not going to pretend we\u0027re ever going to be best friends or that I trust you. I don\u0027t. You did dump spaghetti on my head.\" I winced at that, but she went on. \"And yeah, maybe I was being a bitch, but you don\u0027t understand. They are all I have. I\u0027ll do anything to keep them safe.\"\u003c/p\u003e\n\u003cp\u003e\"I would never do anything to put them in danger.\"\u003c/p\u003e\n\u003cp\u003eShe moved closer, and I fought every instinct to back up. I held my ground. \"But you already have. How many times has Daemon intervened on your behalf, run the risk of exposing what we are and what we can do? You being here is putting each of us at risk.\" Anger tore through me like a fire. \"I\u0027m not doing anything. And last night - \"\u003c/p\u003e\n\u003cp\u003e\"Last night you saved Daemon\u0027s life. Great.\u003c/p\u003e\n\u003cp\u003eGood for you.\" She tucked her uber-straight hair behind her ear. \"Of course, Daemon\u0027s life wouldn\u0027t have needed saving if you hadn\u0027t led the Arum straight to him. And what you think you have with Daemon, you don\u0027t.\" Oh, for the love of babies everywhere. \"I don\u0027t think I have anything with Daemon.\"\u003c/p\u003e\n\u003cp\u003e\"You like Daemon, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003eSmirking, I grabbed a water bottle off the counter. \"Not really.\"\u003c/p\u003e\n\u003cp\u003eAsh cocked her head to the side. \"He likes you.\"\u003c/p\u003e\n\u003cp\u003eMy heart didn\u0027t do a stupid little leap in my chest. \"He doesn\u0027t like me. You even said so yourself.\"\u003c/p\u003e\n\u003cp\u003e\"I was wrong.\" She folded her slender arms as she studied me intently. \"He\u0027s curious about you. You\u0027re different. New. Shiny. Boys - even our kind - like shiny new toys.\" I took a long drink of the water. \"Well, this is one toy he has no intention of playing with.\" When he was awake that is. \"And really, the Arum...\"\u003c/p\u003e\n\u003cp\u003e\"The Arum will end up killing him.\" Her tone didn\u0027t change one bit. It remained flat, emotionless. \"Because of you, little human. He will get himself killed protecting you.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/obsidian-lux-1/page-25.html","bookId":2165,"creation":"Oct 5, 2019 6:30:30 PM","modification":"Oct 5, 2019 6:30:30 PM"}
