{"id":35275,"no":27,"title":"CHAPTER XXVII.","content":"A few days after this she told Richard that she wished to begin to make her arrangements for going away for the summer.\n\u003cbr\u003e \n\u003cbr\u003e \"What, so early!\" he exclaimed, with an air of some slight discontent. \"It has been quite cool so far.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I remained too late last year,\" she answered; \"and I want to make up for lost time.\"\n\u003cbr\u003e \n\u003cbr\u003e They were at dinner, and he turned his wineglass about restlessly on the table-cloth.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you getting tired of Washington?\" he asked. \"You seem to be.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am a little tired of everything just now,\" she said; \"even\"—with a ghost of a laugh—\"of the Westoria lands and Senator Planefield.\"\n\u003cbr\u003e \n\u003cbr\u003e He turned his wineglass about again.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh,\" he said, his voice going beyond the borders of petulance, \"it is plain enough to see that you have taken an unreasonable dislike to Planefield!\"\n\u003cbr\u003e \n\u003cbr\u003e \"He is too large and florid, and absorbs too much of one\u0027s attention,\" she replied, coldly.\n\u003cbr\u003e \n\u003cbr\u003e \"He does not always seem to absorb a great deal of yours,\" Richard responded, knitting his delicate dark brows. \"You treated him cavalierly enough last night, when he brought you the roses.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am tired of his roses!\" she exclaimed, with sudden passion. \"They are too big, and red, and heavy. They cost too much money. They fill all the air about me. They weight me down, and I never seem to be rid of them. I won\u0027t have any more! Let him give them to some one else!\" And she threw her bunch of grapes on her plate, and dropped her forehead on her hands with a childish gesture of fatigue and despair.\n\u003cbr\u003e \n\u003cbr\u003e [Pg 369]\n\u003cbr\u003e \n\u003cbr\u003e Richard knit his brows again. He regarded her with a feeling very nearly approaching nervous dread. This would not do, it was plain.\n\u003cbr\u003e \n\u003cbr\u003e \"What is the matter with you?\" he said. \"What has happened? It isn\u0027t like you to be unreasonable, Bertha.\"\n\u003cbr\u003e \n\u003cbr\u003e She made an effort to recover herself, and partly succeeded. She lifted her face and spoke quite gently and deprecatingly.\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" she said. \"I don\u0027t think it is; so you will be all the readier to overlook it, and allow it to me as a luxury. The fact is, Richard, I am not growing any stronger, and\"—\n\u003cbr\u003e \n\u003cbr\u003e \"Do you know,\" he interrupted, \"I don\u0027t understand that. You used to be strong enough.\"\n\u003cbr\u003e \n\u003cbr\u003e \"One has to be very strong to be strong enough,\" she replied, \"and I seem to have fallen a little short of the mark.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But it has been going on rather a long time, hasn\u0027t it?\" he inquired. \"Didn\u0027t it begin last winter?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" she answered, in a low voice, \"it began then.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, you see, that is rather long for a thing of that sort to go on without any special reason.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It has seemed so to me,\" she responded, without any change of tone.\n\u003cbr\u003e \n\u003cbr\u003e \"Haven\u0027t you a pretty good appetite?\" he inquired.\n\u003cbr\u003e \n\u003cbr\u003e She raised her eyes suddenly, and then dropped them again. He had not observed what a dozen other people had seen.\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" she answered.\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t you sleep well?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you thinner? Well, yes,\" giving her a glance of inspection. \"You are thinner. Oh! come, now, this won\u0027t do at all!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am willing to offer any form of apology you like,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"You must get well,\" he answered; \"that is all.\"[Pg 370] And he rose from his seat, went to the mantel for a cigarette, and returned to her side, patting her shoulder encouragingly. \"You would not be tired of Planefield if you were well. You would like him well enough.\"\n\u003cbr\u003e \n\u003cbr\u003e The change which settled on her face was one which had crossed it many a time without his taking note of it. Possibly the edge of susceptibilities so fine and keen as his is more easily dulled than that of sensitiveness less exquisite. She arose herself.\n\u003cbr\u003e \n\u003cbr\u003e \"That offers me an inducement to recover,\" she said. \"I will begin immediately—to-day—this moment. Let me light your cigarette for you.\"\n\u003cbr\u003e \n\u003cbr\u003e After it was done they sauntered into the library together and stood for a moment looking out of the window.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you know,\" she said at length, laying her hand on his sleeve, \"I think even you are not quite yourself. Are you an invalid, too?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I,\" he said. \"Why do you think so?\"\n\u003cbr\u003e \n\u003cbr\u003e \"For a very good reason,\" she answered. \"For the best of reasons. Two or three times lately you have been a trifle out of humor. Are you aware of it? Such, you see, is the disadvantage of being habitually amiable. The slightest variation of your usually angelic demeanor lays you open to the suspicion of bodily ailment. Just now, for instance, at table, when I spoke to you about going away, you were a little—not to put too fine a point upon it—cross.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Was I?\"\n\u003cbr\u003e \n\u003cbr\u003e Her touch upon his sleeve was very soft and kind, and her face had a gentle, playful appeal on it.\n\u003cbr\u003e \n\u003cbr\u003e \"You really were,\" she returned. \"Just a little—and so was I. It was more a matter of voice and manner, of course; but we didn\u0027t appear to our greatest advantage, I am afraid. And we have never done things like that, you know, and it would be rather bad to begin now, wouldn\u0027t it?\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 371]\n\u003cbr\u003e \n\u003cbr\u003e \"It certainly would,\" he replied. \"And it is very nice in you to care about it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It would not be nice in me not to care,\" she said. \"Just for a moment, you know, it actually sounded quite—quite married. It seemed as if we were on the verge of agreeing to differ about—Senator Planefield.\"\n\u003cbr\u003e \n\u003cbr\u003e \"We won\u0027t do it again,\" he said. \"We will agree to make the best of him.\"\n\u003cbr\u003e \n\u003cbr\u003e She hesitated a second.\n\u003cbr\u003e \n\u003cbr\u003e \"I will try not to make the worst,\" she returned. \"There is always a best, I suppose. And so long as you are here to take care of me, I need not—need not be uncomfortable.\"\n\u003cbr\u003e \n\u003cbr\u003e \"About what?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e She hesitated again, and a shade of new color touched her cheek.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t think I am over-fastidious,\" she said, \"but he has a way I don\u0027t like. He is too fulsome. He admires me too much. He pays me too many compliments. I wish he would not do it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh! come, now,\" he said, gayly, \"that is prejudice! It is worse than all the rest. I never heard you complain of your admirers before, or of their compliments.\"\n\u003cbr\u003e \n\u003cbr\u003e She hesitated a moment again. It was not the first time she had encountered this light and graceful obstinacy, and found it more difficult to cope with than words apparently more serious.\n\u003cbr\u003e \n\u003cbr\u003e \"I have never had an admirer of exactly that quality before,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh,\" he said, airily, \"don\u0027t argue from the ground that it is a bad quality!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Has it never struck you,\" she suggested, \"that there is something of the same quality, whether it is good, bad, or indifferent, in all the persons who are connected with the Westoria lands? I have felt once or twice lately, when I have looked around the parlors, as if I must have suddenly emigrated, the atmosphere[Pg 372] was so different. They have actually rather crowded out the rest—those men.\"\n\u003cbr\u003e \n\u003cbr\u003e It was his turn to pause now, and he did so, looking out of the window, evidently ill at ease, and hesitant for the moment.\n\u003cbr\u003e \n\u003cbr\u003e \"My dear child,\" he said, at length, \"there may be truth in what you say; but—I may as well be frank with you—the thing is necessary.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Richard,\" she said, quickly, prompted to the question by a sudden, vague thought, \"what have you to do with the Westoria lands? Why do you care so much about them?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have everything to do with them—and nothing,\" he answered. \"The legal business connected with them, and likely to result from the success of the scheme, will be the making of me, that is all. I haven\u0027t been an immense success so far, you know, and it will make me an immense success and a man of property. Upon my word, a nice little lobbyist you are, to look frightened at the mere shadow of a plot!\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am not a lobbyist,\" she exclaimed. \"I never wanted to be one. That was only a part of the nonsense I have talked all my life. I have talked too much nonsense. I wish—I wish I had been different!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t allow your repentance to be too deep,\" he remarked, dryly. \"You won\u0027t be able to get over it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s too late for repentance; but I shall not be guilty of that particular kind of folly again. It was folly—and it was bad taste\"—\n\u003cbr\u003e \n\u003cbr\u003e \"As I had not observed it, you might have been content to let it rest,\" he interrupted.\n\u003cbr\u003e \n\u003cbr\u003e She checked herself in the reply she was about to make, clasping her hands helplessly.\n\u003cbr\u003e \n\u003cbr\u003e \"O Richard!\" she said; \"we are beginning again!\"\n\u003cbr\u003e \n\u003cbr\u003e \"So we are,\" he responded, coolly; \"we seem to have a tendency in that direction.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And it always happens,\" she said, \"when I speak of Senator Planefield, or of going away.\"\n\u003cbr\u003e \n\u003cbr\u003e [Pg 373]\n\u003cbr\u003e \n\u003cbr\u003e \"You have fallen into the habit of wanting to go away lately,\" he answered. \"You wanted to go to Europe\"—\n\u003cbr\u003e \n\u003cbr\u003e \"I want to go still,\" she interposed, \"very much.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And I wish you to remain here,\" he returned, petulantly. \"What\u0027s the use of a man\u0027s having a wife at the other side of the globe?\"\n\u003cbr\u003e \n\u003cbr\u003e She withdrew a pace and leaned against the side of the window, letting her eyes rest upon him with a little, bitter smile. For the moment she had less care of herself and of him than she had ever had before.\n\u003cbr\u003e \n\u003cbr\u003e \"Ah!\" she said, \"then you keep me here because you love me?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Bertha!\" he exclaimed.\n\u003cbr\u003e \n\u003cbr\u003e Even his equable triviality found a disturbing element in the situation.\n\u003cbr\u003e \n\u003cbr\u003e \"Richard,\" she said, \"go and finish your cigarette out of doors. It will be better for both of us. This has gone far enough.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It has gone too far,\" he answered, nervously. \"It is deucedly uncomfortable, and it isn\u0027t our way to be uncomfortable. Can\u0027t we make it smooth again? Of course we can. It would not be like you to be implacable. I am afraid I was a trifle irritable. The fact is, I have had a great deal of business anxiety lately,—one or two investments have turned out poorly,—and it has weighed on my mind. If the money were mine, you know; but it is yours\"—\n\u003cbr\u003e \n\u003cbr\u003e \"I have never wished you to feel the difference,\" she said.\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" he replied. \"Nothing could have been nicer than your way about it. You might have made me very uncomfortable, if you had been a hard, business-like creature; but, instead of that, you have been charming.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am glad of that,\" she said, and she smiled gently as he put his arm about her, and kissed her cheek.\n\u003cbr\u003e \n\u003cbr\u003e \"You have a right to your caprices,\" he said. \"Go[Pg 374] to your summer haunts of vice and fashion, if you wish to, and I will follow you as soon as I can; but we won\u0027t say any more about Europe, just at present, will we? Perhaps next year.\"\n\u003cbr\u003e \n\u003cbr\u003e And he kissed her again.\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps next year or the year after,\" she repeated, with a queer little smile. \"And—and we will take Senator Planefield with us.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" he answered, \"we will leave him at home to invest the millions derived from the Westoria lands.\"\n\u003cbr\u003e \n\u003cbr\u003e And he went out with a laugh on his lips.\n\u003cbr\u003e \n\u003cbr\u003e A week later Colonel Tredennis heard from Richard that Bertha and the children were going away.\n\u003cbr\u003e \n\u003cbr\u003e \"When?\" asked the colonel. \"That seems rather sudden. I saw Janey two days ago, and did not understand that the time was set for their departure.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is rather sudden,\" said Richard. \"The fact is, they leave Washington this morning. I should be with them now if it were not for a business engagement.\"\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2698/74188.html","bookId":1460,"creation":"Aug 5, 2019 6:17:11 AM","modification":"Aug 5, 2019 6:17:11 AM"}
