{"id":97319,"no":22,"title":"Page 22","content":"\u003cp\u003e\"And the ceremony itself?\"\u003c/p\u003e\n\u003cp\u003e\"I will conduct it.\"\u003c/p\u003e\n\u003cp\u003e\"Will you need assistants, Lord? Artifacts of any kind?\"\u003c/p\u003e\n\u003cp\u003e\"The trappings of ritual?\"\u003c/p\u003e\n\u003cp\u003e\"Any particular thing which I may not...\"\u003c/p\u003e\n\u003cp\u003e\"We will not need much for our little charade.\"\u003c/p\u003e\n\u003cp\u003e\"Lord! I beg of you! Please...\"\u003c/p\u003e\n\u003cp\u003e\"You will stand beside the bride and give her in marriage,\" Leto said. \"We will use the Old Fremen ritual.\"\u003c/p\u003e\n\u003cp\u003e\"We will need water rings then,\" Moneo said.\u003c/p\u003e\n\u003cp\u003e\"Yes! I will use Ghani\u0027s water rings.\"\u003c/p\u003e\n\u003cp\u003e\"And who will attend, Lord?\"\u003c/p\u003e\n\u003cp\u003e\"Only a Fish Speaker guard and the aristocracy.\"\u003c/p\u003e\n\u003cp\u003eMoneo stared at Leto\u0027s face. \"What... what does my Lord mean by `aristocracy\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"You, your family, the household entourage, the courtiers of the Citadel.\"\u003c/p\u003e\n\u003cp\u003e\"My fam...\" Moneo swallowed. \"Do you include Siona?\"\u003c/p\u003e\n\u003cp\u003e\"If she survives the test.\"\u003c/p\u003e\n\u003cp\u003e\"But...\u003c/p\u003e\n\u003cp\u003e\"Is she not family?\"\u003c/p\u003e\n\u003cp\u003e\"Of course, Lord. She is Atreides and...\"\u003c/p\u003e\n\u003cp\u003e\"Then by all means include Siona!\"\u003c/p\u003e\n\u003cp\u003eMoneo brought a tiny memocorder from his pocket, a dull black Ixian artifact whose existence crowded the proscriptions of the Butlerian Jihad. A soft smile touched Leto\u0027s lips. Moneo knew his duties and would now perform them.\u003c/p\u003e\n\u003cp\u003eThe clamor of Duncan Idaho outside the portal grew more strident, but Moneo ignored the sound.\u003c/p\u003e\n\u003cp\u003eMoneo knows the price of his privileges, Leto thought. It is another kind of marriage-the marriage of privilege and duty. It is the aristocrat\u0027s explanation and his excuse.\u003c/p\u003e\n\u003cp\u003eMoneo finished his note taking.\u003c/p\u003e\n\u003cp\u003e\"A few details, Lord,\" Moneo said. \"Will there be some special garb for Hwi?\"\u003c/p\u003e\n\u003cp\u003e\"The stillsuit and robe of a Fremen bride, real ones.\"\u003c/p\u003e\n\u003cp\u003e\"Jewelry or other baubles?\"\u003c/p\u003e\n\u003cp\u003eLeto\u0027s gaze locked on Moneo\u0027s fingers scrabbling over the tiny recorder, seeing there a dissolution.\u003c/p\u003e\n\u003cp\u003eLeadership, courage, a.sense of knowledge and order Moneo has these in abundance. They surround him like a holy aura, but they conceal from all eyes except mine the rot which eats from within. It is inevitable. Were I gone, it would be visible to everyone.\u003c/p\u003e\n\u003cp\u003e\"Lord?\" Moneo pressed. \"Are you woolgathering?\"\u003c/p\u003e\n\u003cp\u003eAhhh! He likes that word!\u003c/p\u003e\n\u003cp\u003e\"That is all,\" Leto said. \"Only the robe, the stillsuit and the water rings.\"\u003c/p\u003e\n\u003cp\u003eMoneo bowed and turned away.\u003c/p\u003e\n\u003cp\u003eHe is looking ahead now, Leto thought, but even this new thing will pass. He will turn toward the past once more. And I had such high hopes for him once. Well... perhaps Siona...\u003c/p\u003e\n\u003cp\u003e- \u003d\u003c/p\u003e\n\u003cp\u003e\"Make no heroes,\" my father said.\u003c/p\u003e\n\u003cp\u003e- The voice of Ghanima,\u003c/p\u003e\n\u003cp\u003eFrom the Oral History\u003c/p\u003e\n\u003cp\u003eJUST BY the way Idaho strode across the small chamber, his loud demands for audience now gratified, Leto could see an important transformation in the ghola. It was a thing repeated so many times that it had become deeply familiar to Leto. The Duncan had not even exchanged words of greeting with the departing Moneo. It all fitted into the pattern. How boring that pattern had become!\u003c/p\u003e\n\u003cp\u003eLeto had a name for this transformation of the Duncans. He called it \"The Since Syndrome.\"\u003c/p\u003e\n\u003cp\u003eThe gholas often nurtured suspicions about the secret things which might have been developed across the centuries of oblivion since they last knew awareness. What had people been doing all that time? Why could they possibly want me, this relic from their past? No ego could overcome such doubts forever-especially in a doubting man.\u003c/p\u003e\n\u003cp\u003eOne of the gholas had accused Leto: \"You\u0027ve put things in my body, things I know nothing about! These things in my body tell you everything I\u0027m doing! You spy on me everywhere!\"\u003c/p\u003e\n\u003cp\u003eAnother had charged him with possessing a \"manipulative machine which makes us want to do whatever you want.\"\u003c/p\u003e\n\u003cp\u003eOnce it started, the Since Syndrome could never be entirely eliminated. It could be checked, even diverted, but the dormant seed might sprout at the slightest provocation.\u003c/p\u003e\n\u003cp\u003eIdaho stopped where Moneo had stood and there was a veiled look of nonspecific suspicions in his eyes, in the set of his shoulders. Leto allowed the situation to simmer, bringing the condition to a head. Idaho locked gazes with him, then\u003c/p\u003e\n\u003cp\u003ebroke away to dart his glances around the room. Leto recognized the manner behind the gaze.\u003c/p\u003e\n\u003cp\u003eThe Duncans never forget!\u003c/p\u003e\n\u003cp\u003eAs he studied the room, using the sightful ways he had been taught centuries before by the Lady Jessica and the Mentat Thufir Hawat, Idaho began to feel a giddy sense of dislocation. He thought the room rejected him, each thing-the soft cushions: big bulbous things in gold, green and a red that was almost purple; the Fremen rugs, each a museum piece, lapping over each other in thick piles around Leto\u0027s pit; the false sunlight of Ixian glowglobes, light which enveloped the Emperor\u0027s face in dry warmth, making the shadows around it deeper and more mysterious; the smell of spice-tea somewhere nearby; and that rich melange odor which radiated from the worm-body.\u003c/p\u003e\n\u003cp\u003eIdaho felt that too much had happened to him too fast since the Tleilaxu had abandoned him to the mercies of Luli and Friend in that featureless prison-cell room.\u003c/p\u003e\n\u003cp\u003eToo much... too much...\u003c/p\u003e\n\u003cp\u003eAm I really here? he wondered. Is this me? What are these thoughts that I think?\u003c/p\u003e\n\u003cp\u003eHe stared at Leto\u0027s quiescent body, the shadowy and enormous mass which lay so silently there on its cart within the pit. The very quietness of that fleshly mass only suggested mysterious energies, terrible energies which might be unleashed in ways nobody could anticipate.\u003c/p\u003e\n\u003cp\u003eIdaho had heard the stories about the fight at the Ixian Embassy, but the Fish Speaker accounts had an aura of miraculous visitation about them which obscured the physical data.\u003c/p\u003e\n\u003cp\u003e\"He flew down from above them and executed a terrible slaughter among the sinners.\"\u003c/p\u003e\n\u003cp\u003e\"How did he do that?\" Idaho had asked.\u003c/p\u003e\n\u003cp\u003e\"He was an angry God,\" his informant had said.\u003c/p\u003e\n\u003cp\u003eAngry, Idaho thought. Was it because of the threat to Hwi? The stories he had heard! None were believable. Hwi wedded to this gross... It was not possible! Not the lovely Hwi, the Hwi of gentle delicacy. He is playing some terrible game, testing us... testing us... There was no honest reality in these times, no peace except in the presence of Hwi. All else was insanity.\u003c/p\u003e\n\u003cp\u003eAs he returned his attention to Leto\u0027s face-that silently waiting Atreides face-the sense of dislocation grew stronger in Idaho. He began to wonder if, by a slight increase in mental effort along some strange new pathway, he might break through ghostly barriers to remember all of the experiences of the other Ghola Idahos.\u003c/p\u003e\n\u003cp\u003eWhat did they think when they entered this room? Did they feel this dislocation, this rejection?\u003c/p\u003e\n\u003cp\u003eJust a little extra effort.\u003c/p\u003e\n\u003cp\u003eHe felt dizzy and wondered if he were going to faint.\u003c/p\u003e\n\u003cp\u003e\"Is something wrong, Duncan?\" It was Leto\u0027s most reasonable and calming tone.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not real,\" Idaho said. \"I don\u0027t belong here.\"\u003c/p\u003e\n\u003cp\u003eLeto chose to misunderstand. \"But my guard tells me you came here of your own accord, that you flew back from the Citadel and demanded an immediate audience.\"\u003c/p\u003e\n\u003cp\u003e\"I mean here, now! In this time!\"\u003c/p\u003e\n\u003cp\u003e\"But I need you.\"\u003c/p\u003e\n\u003cp\u003e\"For what?\"\u003c/p\u003e\n\u003cp\u003e\"Look around you, Duncan. The ways you can help me are so numerous that you could not do them all.\"\u003c/p\u003e\n\u003cp\u003e\"But your women won\u0027t let me fight! Every time I want to go where...\"\u003c/p\u003e\n\u003cp\u003e\"Do you question that you\u0027re more valuable alive than dead?\" Leto made a clucking sound, then: \"Use your wits, Duncan! That\u0027s what I value.\"\u003c/p\u003e\n\u003cp\u003e\"And my sperm. You value that.\"\u003c/p\u003e\n\u003cp\u003e\"Your sperm is your own to put where you wish.\"\u003c/p\u003e\n\u003cp\u003e\"I will not leave a widow and orphans behind me the way...\u003c/p\u003e\n\u003cp\u003e\"Duncan! I\u0027ve said the choice is yours.\"\u003c/p\u003e\n\u003cp\u003eIdaho swallowed, then: \"You\u0027ve committed a crime against us, Leto, against all of us\u003dthe gholas you resurrect without ever asking us if that\u0027s what we want.\"\u003c/p\u003e\n\u003cp\u003eThis was a new turn in Duncan-thinking. Leto peered at Idaho with renewed interest.\u003c/p\u003e\n\u003cp\u003e\"What crime?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I\u0027ve heard you spouting your deep thoughts,\" Idaho accused. He hooked a thumb over his shoulder, pointing at the room\u0027s entrance. \"Did you know you can be heard out there in the anteroom?\"\u003c/p\u003e\n\u003cp\u003e\"When I wish to be heard, yes.\" But only my journals hear it all! \"I would like to know the nature of my crime, though.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a time, Leto, a time when you\u0027re alive. A time when you\u0027re supposed to be alive. It can have a magic, that time, while you\u0027re living it. You know you\u0027re never going to see a time like that again.\"\u003c/p\u003e\n\u003cp\u003eLeto blinked, touched by the Duncan\u0027s distress. The words were evocative.\u003c/p\u003e\n\u003cp\u003eIdaho raised both hands, palms up, to chest-height, a beggar Asking for something he knew he could not receive.\u003c/p\u003e\n\u003cp\u003e\"Then... one day you wake up and you remember dying... and you remember the axlotl tank... and the Tleilaxu nastiness which awakened you... and it\u0027s supposed to start all over again. But it doesn\u0027t. It never does, Leto. That\u0027s a crime!\"\u003c/p\u003e\n\u003cp\u003e\"I have taken away the magic?\"\u003c/p\u003e\n\u003cp\u003e\"Yes!\"\u003c/p\u003e\n\u003cp\u003eIdaho dropped his hands to his sides and clenched them into fists. He felt that he stood alone in the path of a millrace tide which would overwhelm him at his slightest relaxation.\u003c/p\u003e\n\u003cp\u003eAnd what of my time? Leto thought. This, too, will never happen again. But the Duncan would not understand the difference.\u003c/p\u003e\n\u003cp\u003e\"What brought you rushing back from the Citadel?\" Leto asked.\u003c/p\u003e\n\u003cp\u003eIdaho took a deep breath, then: \"Is it true? You\u0027re to be married?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s correct.\"\u003c/p\u003e\n\u003cp\u003e\"To this Hwi Noree, the Ixian Ambassador?\"\u003c/p\u003e\n\u003cp\u003e\"True.\"\u003c/p\u003e\n\u003cp\u003eIdaho darted a quick glance along Leto\u0027s supine length.\u003c/p\u003e\n\u003cp\u003eThey always look for genitalia, Leto thought. Perhaps I should have something made, a gross protuberance to shock them. He choked back the small burst of amusement which threatened to erupt from his throat. Another emotion amplified. Thank you, Hwi. Thank you, lxians.\u003c/p\u003e\n\u003cp\u003eIdaho shook his head. \"But you...\"\u003c/p\u003e\n\u003cp\u003e\"There are strong elements to a marriage other than sex,\" Leto said. \"Will we have children of our flesh? No. But the effects of this union will be profound.\"\u003c/p\u003e\n\u003cp\u003e\"I listened while you were talking to Moneo,\" Idaho said. \"I thought it must be some kind of joke, a...\"\u003c/p\u003e\n\u003cp\u003e\"Careful, Duncan!\"\u003c/p\u003e\n\u003cp\u003e\"Do you love her?\"\u003c/p\u003e\n\u003cp\u003e\"More deeply than any man ever loved a woman.\"\u003c/p\u003e\n\u003cp\u003e\"Well, what about her? Does she...\"\u003c/p\u003e\n\u003cp\u003e\"She feels... a compelling compassion, a need to share with me, to give whatever she can give. It is her nature.\"\u003c/p\u003e\n\u003cp\u003eIdaho suppressed a feeling of revulsion.\u003c/p\u003e\n\u003cp\u003e\"Moneo\u0027s right. They\u0027ll believe the Tleilaxu stories.\"\u003c/p\u003e\n\u003cp\u003e\"That is one of the profound effects.\"\u003c/p\u003e\n\u003cp\u003e\"And you still want me to... to mate with Siona!\"\u003c/p\u003e\n\u003cp\u003e\"You know my wishes. I leave the choice to you.\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s that Nayla woman?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve met Nayla! Good.\"\u003c/p\u003e\n\u003cp\u003e\"She and Siona act like sisters. That big hunk! What\u0027s going on there, Leto?\"\u003c/p\u003e\n\u003cp\u003e\"What would you want to go on? And what does it matter?\" \"I\u0027ve never met such a brute! She reminds me of Beast Rabban. You\u0027d never know she was female if she didn\u0027t...\"\u003c/p\u003e\n\u003cp\u003e\"You have met her before,\" Leto said. \"You knew her as Friend.\"\u003c/p\u003e\n\u003cp\u003eIdaho stared at him in quick silence, the silence of a burrowing creature who senses the hawk.\u003c/p\u003e\n\u003cp\u003e\"Then you trust her,\" Idaho said.\u003c/p\u003e\n\u003cp\u003e\"Trust? What is trust?\"\u003c/p\u003e\n\u003cp\u003eThe moment arrives, Leto thought. He could see it shaping in Idaho\u0027s thoughts.\u003c/p\u003e\n\u003cp\u003e\"Trust is what goes with a pledge of loyalty,\" Idaho said. \"Such as the trust between you and me?\" Leto asked.\u003c/p\u003e\n\u003cp\u003eA bitter smile touched Idaho\u0027s lips. \"So that\u0027s what you\u0027re doing with Hwi Noree? A marriage, a pledge...\"\u003c/p\u003e\n\u003cp\u003e\"Hwi and I already have trust for each other.\"\u003c/p\u003e\n\u003cp\u003e\"Do you trust me, Leto?\"\u003c/p\u003e\n\u003cp\u003e\"If I cannot trust Duncan Idaho, I cannot trust anyone.\"\u003c/p\u003e\n\u003cp\u003e\"And if I can\u0027t trust you?\"\u003c/p\u003e\n\u003cp\u003e\"Then I pity you.\"\u003c/p\u003e\n\u003cp\u003eIdaho took this as almost a physical shock. His eyes were wide with unspoken demands. He wanted to trust. He wanted the magic which would never come again.\u003c/p\u003e\n\u003cp\u003eIdaho indicated his thoughts were taking off in an odd tangent then.\u003c/p\u003e\n\u003cp\u003e\"Can they hear us out in the anteroom?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"No.\" But my journals hear!\u003c/p\u003e\n\u003cp\u003e\"Moneo was furious. Anyone could see it. But he went away like a docile lamb.\"\u003c/p\u003e\n\u003cp\u003e\"Moneo is an aristocrat. He is married to duty, to responsibilities. When he is reminded of these things, his anger vanishes.\"\u003c/p\u003e\n\u003cp\u003e\"So that\u0027s how you control him,\" Idaho said.\u003c/p\u003e\n\u003cp\u003e\"He controls himself,\" Leto said, remembering how Moneo had glanced up from the note-taking, not for reassurances, but to prompt his sense of duty.\u003c/p\u003e\n\u003cp\u003e\"No,\" Idaho said. \"He doesn\u0027t control himself. You do it.\"\u003c/p\u003e\n\u003cp\u003e\"Moneo has locked himself into his past. I did not do that.\"\u003c/p\u003e\n\u003cp\u003e\"But he\u0027s an aristocrat... an Atreides.\"\u003c/p\u003e\n\u003cp\u003eLeto recalled Moneo\u0027s aging features, thinking how inevitable it was that the aristocrat would refuse his final duty-which was to step aside and vanish into history. He would have to be driven aside. And he would be. No aristocrat had ever overcome the demands of change.\u003c/p\u003e\n\u003cp\u003eIdaho was not through. \"Are you an aristocrat, Leto?\"\u003c/p\u003e\n\u003cp\u003eLeto smiled. \"The ultimate aristocrat dies within me.\" And he thought: Privilege becomes arrogance. Arrogance promotes injustice. The seeds of ruin blossom.\u003c/p\u003e\n\u003cp\u003e\"Maybe I will not attend your wedding,\" Idaho said. \"I never thought of myself as an aristocrat.\"\u003c/p\u003e\n\u003cp\u003e\"But you were. You were the aristocrat of the sword.\"\u003c/p\u003e\n\u003cp\u003e\"Paul was better,\" Idaho said.\u003c/p\u003e\n\u003cp\u003eLeto spoke in the voice of Muad\u0027Dib: \"Because you taught me!\" He resumed his normal tones: \"The aristocrat\u0027s unspoken duty-to teach, and sometimes by horrible example.\"\u003c/p\u003e\n\u003cp\u003eAnd he thought: Pride of birth trails out into penury and the weaknesses of interbreeding. The way is opened for pride of wealth and accomplishment. Enter the nouveaux riches, riding to power as the Harkonnens did, on the backs of the ancient regime.\u003c/p\u003e\n\u003cp\u003eThe cycle repeated itself with such persistence that Leto felt anyone should have seen how it must be built into long forgotten survival patterns which the species had outgrown, but never lost.\u003c/p\u003e\n\u003cp\u003eBut no, we still carry the detritus which I must weed out.\u003c/p\u003e\n\u003cp\u003e\"Is there some frontier?\" Idaho asked. \"Is there some frontier where I could go and never again be a part of this?\"\u003c/p\u003e\n\u003cp\u003e\"If there is to be any frontier, you must help me create it,\" Leto said. \"There is now no place to go where others of us cannot follow and find you.\"\u003c/p\u003e\n\u003cp\u003e\"Then you won\u0027t let me go.\"\u003c/p\u003e\n\u003cp\u003e\"Go if you wish. Others of you have tried it. I tell you there is no frontier, no place to hide. Right now, as it has been for a long, long time, humankind is like a single-celled creature, bound together by a dangerous glue.\"\u003c/p\u003e\n\u003cp\u003e\"No new planets? No strange...\"\u003c/p\u003e\n\u003cp\u003e\"Oh, we grow, but we do not separate.\"\u003c/p\u003e\n\u003cp\u003e\"Because you hold us together!\" he accused.\u003c/p\u003e\n\u003cp\u003e\"I do not know if you can understand this, Duncan, but if there is a frontier, any kind of frontier, then what lies behind you cannot be more important than what lies ahead.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the past!\"\u003c/p\u003e\n\u003cp\u003e\"No, Moneo is the past. He is quick to raise the traditional aristocratic barriers against all frontiers. You must understand the power of those barriers. They not only enclose planets and land on those planets, they enclose ideas. They repress change.\"\u003c/p\u003e\n\u003cp\u003e\"You repress change!\"\u003c/p\u003e\n\u003cp\u003eHe will not deviate, Leto thought. One more try.\u003c/p\u003e\n\u003cp\u003e\"The surest sign that an aristocracy exists is the discovery of barriers against change, curtains of iron or steel or stone or of any substance which excludes the new, the different.\"\u003c/p\u003e\n\u003cp\u003e\"I know there must be a frontier somewhere,\" Idaho said. \"You\u0027re hiding it.\"\u003c/p\u003e\n\u003cp\u003e\"I hide nothing of frontiers. I want frontiers! I want surprises!\"\u003c/p\u003e\n\u003cp\u003eThey come right up against it, Leto thought. Then they refuse to enter.\u003c/p\u003e\n\u003cp\u003eTrue to this prediction, Idaho\u0027s thoughts darted off on a new tack. \"Did you really have Face Dancers perform at your betrothal?\"\u003c/p\u003e\n\u003cp\u003eLeto felt a surge of anger, followed immediately by a wry enjoyment of the fact that he could experience the emotion in such depth. He wanted to let it shout at Duncan... but that would solve nothing \"The Face Dancers performed,\" he said.\u003c/p\u003e\n\u003cp\u003e.Why?\"\u003c/p\u003e\n\u003cp\u003e\"I want everyone to share in my happiness.\"\u003c/p\u003e\n\u003cp\u003eIdaho stared at him as though just discovering a repellent insect in his drink. In a flat voice, Idaho said: \"That is the most cynical thing I have ever heard an Atreides say.\"\u003c/p\u003e\n\u003cp\u003e\"But an Atreides said it.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re deliberately trying to put me off! You\u0027re avoiding my question.\"\u003c/p\u003e\n\u003cp\u003eOnce more into the fray, Leto thought. He said: \"The Face Dancers of the Bene Tleilax are a colony organism. Individually, they are mules. This is a choice they made for and by themselves.\"\u003c/p\u003e\n\u003cp\u003eLeto waited, thinking: I must be patient. They have to discover it for themselves. If I say it, they will not believe. Think, Duncan. Think!\u003c/p\u003e\n\u003cp\u003eAfter a long silence, Idaho said: \"I have given you my oath. That is important to me. It is still important. I don\u0027t know what you\u0027re doing or why. I can only say I don\u0027t like what\u0027s happening. There! I\u0027ve said it.\"\u003c/p\u003e\n\u003cp\u003e\"Is that why you returned from the Citadel?\"\u003c/p\u003e\n\u003cp\u003e\"Yes!\"\u003c/p\u003e\n\u003cp\u003e\"Will you go back to the Citadel now?\"\u003c/p\u003e\n\u003cp\u003e\"What other frontier is there?\"\u003c/p\u003e\n\u003cp\u003e\"Very good, Duncan! Your anger knows even when your reason does not. Hwi goes to the Citadel tonight. I will join her there tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"I want to get to know her better,\" Idaho said.\u003c/p\u003e\n\u003cp\u003e\"You will avoid her,\" Leto said. \"That is an order. Hwi is not for you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve always known there were witches,\" Idaho said. \"Your grandmother was one.\"\u003c/p\u003e\n\u003cp\u003eHe turned on his heel and, not asking leave, strode back the way he had come.\u003c/p\u003e\n\u003cp\u003eHow like a little boy he is, Leto thought, watching the stiffness in Idaho\u0027s back. The oldest man in our universe and the youngest-both in one flesh. -\u003d The prophet is not diverted by illusions of past, present and future. The fixity of language determines such linear distinctions. Prophets hold a key to the lock in a language. The mechanical image remains only an image to them. This is not a mechanical universe. The linear progression of events is imposed by the observer. Cause and effect? That\u0027s not it at all. The prophet utters fateful words. You glimpse a thing \"destined to occur.\" But the prophetic instant releases something of infinite portent and power. The universe undergoes a ghostly shift. Thus, the wise prophet conceals actuality behind shimmering labels. The uninitiated then believe the prophetic language is ambiguous. The listener distrusts the prophetic messenger. Instinct tells you how the utterance blunts the power of such words. The best prophets lead you up to the curtain and let you peer through for yourself.\u003c/p\u003e\n\u003cp\u003e- The Stolen Journals LETO ADDRESSED Moneo in the coldest voice he had ever used: \"The Duncan disobeys me.\"\u003c/p\u003e\n\u003cp\u003eThey were in the airy room of golden stone atop the Citadel\u0027s south tower, Leto\u0027s third full day back from the Decennial Festival in Onn. An open portal beside him looked out over the harsh noonday of the Sareer. The wind made a deep humming sound through the opening. It stirred up dust and sand which made Moneo squint. Leto seemed not to notice the irritation. He stared out across the Sareer, where the air was alive with heat movements. The distant flow of dunes suggested a mobility in the landscape which only his eyes observed.\u003c/p\u003e\n\u003cp\u003eMoneo stood immersed in the sour odors of his own fear, knowing that the wind conveyed the message of these odors to Leto\u0027s senses. The arrangements for the wedding, the upset among the Fish Speakers-everything was paradox. It reminded Moneo of something the God Emperor had said in the first days of their association.\u003c/p\u003e\n\u003cp\u003e\"Paradox is a pointer telling you to look beyond it. If paradoxes bother you, that betrays your deep desire for absolutes. The relativist treats a paradox merely as interesting, perhaps amusing or even, dreadful thought, educational. \"\u003c/p\u003e\n\u003cp\u003e\"You do not respond,\" Leto said. He turned from his examination of the Sareer and focused the weight of his attention on Moneo.\u003c/p\u003e\n\u003cp\u003eMoneo could only shrug. How near is the Worm? he wondered. Moneo had noticed that the return to the Citadel from Onn sometimes aroused the Worm. No sign of that awful shift in the God Emperor\u0027s presence had yet betrayed itself, but Moneo sensed it. Could the Worm come without warning?\u003c/p\u003e\n\u003cp\u003e\"Accelerate arrangements for the wedding,\" Leto said. \"Make it as soon as possible.\"\u003c/p\u003e\n\u003cp\u003e\"Before you test Siona?\"\u003c/p\u003e\n\u003cp\u003eLeto was silent for a moment, then: \"No. What will you do about the Duncan,\"\u003c/p\u003e\n\u003cp\u003e\"What would you have me do, Lord?\"\u003c/p\u003e\n\u003cp\u003e\"I told him not to see Noree, to avoid her. I told him it was an order.\"\u003c/p\u003e\n\u003cp\u003e\"She has sympathy for him, Lord. Nothing more.\"\u003c/p\u003e\n\u003cp\u003e\"Why would she have sympathy for him?\"\u003c/p\u003e\n\u003cp\u003e\"He is a ghola. He has no connection to our times, no roots.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/god-emperor-of-dune-dune-chronicles-4/page-22.html","bookId":2156,"creation":"Oct 5, 2019 6:26:28 PM","modification":"Oct 5, 2019 6:26:28 PM"}
