{"id":97323,"no":26,"title":"Page 26","content":"\u003cp\u003e\"You have not!\"\u003c/p\u003e\n\u003cp\u003e\"How far have we come, Siona?\"\u003c/p\u003e\n\u003cp\u003eShe thought about this. \"Thirty kilometers? Twenty?\"\u003c/p\u003e\n\u003cp\u003e\"Farther,\" he said. \"I can move very fast in my own land. Didn\u0027t you feel the wind on your face?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" Sullen. \"So why ask me how far?\"\u003c/p\u003e\n\u003cp\u003e\"Come down and stand where I can see you.\" ..Why?\"\u003c/p\u003e\n\u003cp\u003eGood, he thought. She believes I will abandon her here and speed off faster than she can follow.\u003c/p\u003e\n\u003cp\u003e\"Come down and I\u0027ll explain,\" he said.\u003c/p\u003e\n\u003cp\u003eShe slid off his back and came around to where she could look into his face.\u003c/p\u003e\n\u003cp\u003e\"Time passes swiftly when your senses are full,\" he said.\u003c/p\u003e\n\u003cp\u003e\"We have been out almost four hours. We have come about sixty kilometers.\"\u003c/p\u003e\n\u003cp\u003e\"Why is that important?\"\u003c/p\u003e\n\u003cp\u003e\"Moneo put dried food in the pouch of your robe,\" he said. \"Eat a little and I will tell you.\"\u003c/p\u003e\n\u003cp\u003eShe found a dried cube of protomor in the pouch and chewed on it while she watched him. It was the authentic old Fremen food even to the slight addition of melange.\u003c/p\u003e\n\u003cp\u003e\"You have felt your past,\" he said. \"Now, you must be sensitized to your future, to the Golden Path.\"\u003c/p\u003e\n\u003cp\u003eShe swallowed. \"I don\u0027t believe in your Golden Path.\"\u003c/p\u003e\n\u003cp\u003e\"If you are to live, you will believe in it.\"\u003c/p\u003e\n\u003cp\u003e\"Is that your test? Have faith in the Great God Leto or die?\"\u003c/p\u003e\n\u003cp\u003e\"You need no faith in me whatsoever. I want you to have faith in yourself.\"\u003c/p\u003e\n\u003cp\u003e\"Then why is it important how far we\u0027ve come?\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027ll understand how far you still have to go.\"\u003c/p\u003e\n\u003cp\u003eShe put a hand to her cheek. \"I don\u0027t...\"\u003c/p\u003e\n\u003cp\u003e\"Right where you stand,\" he said, \"you are in the unmistakable midst of Infinity. Look around you at the meaning of Infinity.\"\u003c/p\u003e\n\u003cp\u003eShe glanced left and right at the unbroken desert.\u003c/p\u003e\n\u003cp\u003e\"We are going to walk out of my desert together,\" he said. \"Just the two of us.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t walk,\" she sneered.\u003c/p\u003e\n\u003cp\u003e\"A figure of speech. But you will walk. I assure you of that.\"\u003c/p\u003e\n\u003cp\u003eShe looked in the direction they had come. \"So that\u0027s why you asked me about tracks.\"\u003c/p\u003e\n\u003cp\u003e\"Even if there were tracks, you could not go back. There is nothing at my Little Citadel that you could get to and use for survival.\"\u003c/p\u003e\n\u003cp\u003e\"No water?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing.\"\u003c/p\u003e\n\u003cp\u003eShe found the catchpocket tube at her shoulder, sucked at it and restored it. He noted the care with which she sealed the end, but she did not pull the face flap across her mouth, although Leto had heard her father warning her about this. She wanted her mouth free for talking!\u003c/p\u003e\n\u003cp\u003e\"You\u0027re telling me I can\u0027t run away from you,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Run away if you want.\"\u003c/p\u003e\n\u003cp\u003eShe turned a full circle, examining the wasteland.\u003c/p\u003e\n\u003cp\u003e\"There is a saying about the open land,\" he said, \"that one direction is as good as another. In some ways, that\u0027s still true, but I would not depend on it.\"\u003c/p\u003e\n\u003cp\u003e\"But I\u0027m really free to leave you if I want?\"\u003c/p\u003e\n\u003cp\u003e\"Freedom can be a very lonely estate,\" he said.\u003c/p\u003e\n\u003cp\u003eShe pointed to the steep side of the dune on which they had stopped. \"But I could just go down there and...\"\u003c/p\u003e\n\u003cp\u003e\"Were I you, Siona, I would not go down where you are pointing.\"\u003c/p\u003e\n\u003cp\u003eShe glared at him. \"Why?\"\u003c/p\u003e\n\u003cp\u003e\"On the dune\u0027s steep side, unless you follow the natural curves, the sand may slide down upon you and bury you.\"\u003c/p\u003e\n\u003cp\u003eShe looked down the slope, absorbing this.\u003c/p\u003e\n\u003cp\u003e\"See how beautiful words can be?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe returned her attention to his face. \"Should we be going?\"\u003c/p\u003e\n\u003cp\u003e\"You learn to value leisure out here. And courtesy. There\u0027s no hurry.\"\u003c/p\u003e\n\u003cp\u003e\"But we have no water except the..\u003c/p\u003e\n\u003cp\u003e.\"\u003c/p\u003e\n\u003cp\u003e\"Used wisely, that stillsuit will keep you alive.\"\u003c/p\u003e\n\u003cp\u003e\"But how long will it take us to...\"\u003c/p\u003e\n\u003cp\u003e\"Your impatience alarms me.\"\u003c/p\u003e\n\u003cp\u003e\"But we have only this dried food in my pouch. What will we eat when...\"\u003c/p\u003e\n\u003cp\u003e\"Siona! Have you noticed that you are expressing our situation as mutual. What will we eat? We have no water. Should we be going? How long will it take us?\"\u003c/p\u003e\n\u003cp\u003eHe sensed the dryness of her mouth as she tried to swallow.\u003c/p\u003e\n\u003cp\u003e\"Could it be that we\u0027re interdependent?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe spoke reluctantly. \"I don\u0027t know how to survive out here.\"\u003c/p\u003e\n\u003cp\u003e\"But I do?\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e\"Why should I share such precious knowledge with you?\" he asked.\u003c/p\u003e\n\u003cp\u003eShe shrugged, a pitiful gesture which touched him. How quickly the desert cut away previous attitudes.\u003c/p\u003e\n\u003cp\u003e\"I will share my knowledge with you,\" he-said. \"And you must find something valuable that you can share with me.\"\u003c/p\u003e\n\u003cp\u003eHer gaze traversed his length, paused a moment at the flippers which once were his legs and feet, then came back to his face.\u003c/p\u003e\n\u003cp\u003e\"Agreement bought with threats is no agreement,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I offer you no violence.\"\u003c/p\u003e\n\u003cp\u003e\"There are many kinds of violence,\" she said.\u003c/p\u003e\n\u003cp\u003e\"And I brought you out here where you may die?\"\u003c/p\u003e\n\u003cp\u003e\"Did I have a choice in it?\"\u003c/p\u003e\n\u003cp\u003e\"It is difficult to be born an Atreides,\" he said. \"Believe me, I know.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to do it this way,\" she said.\u003c/p\u003e\n\u003cp\u003e\"And there you are wrong.\"\u003c/p\u003e\n\u003cp\u003eHe turned away from her and set off in a sinusoidal track down the dune. He heard her slipping and stumbling as she followed. Leto stopped well into the dune shadow.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll wait out the day here,\" he said. \"It uses less water to travel by night.\"\u003c/p\u003e\n\u003cp\u003e- \u003d One of the most terrible words in any language is Soldier. The synonyms parade through our history: yogahnee, trooper, hussar, kareebo, cossack, deranzeef, legionnaire, sardaukar, fish speaker... I know them all. They stand there in the ranks of my memory to remind me: Always make sure you have the army with you.\u003c/p\u003e\n\u003cp\u003e- The Stolen Journals IDAHO FOUND Moneo at last in the long underground corridor which connected the Citadel\u0027s eastern and western complexes. Since daybreak two hours before, Idaho had been prowling the Citadel seeking the majordomo and there he was, far off down the corridor, talking to someone concealed in a doorway, but Moneo was recognizable even at this distance by his stance and that inevitable white uniform.\u003c/p\u003e\n\u003cp\u003eThe corridor\u0027s plastone walls were amber here fifty meters below the surface and lighted by glowstrips keyed to the daylight hours. Cool breezes were drawn into these depths by a simple arrangement of free swinging wings which stood like gigantic robed figures on perimeter towers at the surface. Now that the sun had warmed the sands, all of the wings pointed northward for the cool air pouring into the Sareer. Idaho smelled the flinty breeze as he walked.\u003c/p\u003e\n\u003cp\u003eHe knew what this corridor was supposed to represent. It did have some characteristics of an ancient Fremen sietch. The corridor was wide, big enough to take Leto on his cart. The arched ceiling looked like rock. But the twin glowstrips were discord. Idaho had never seen glowstrips before coming to the Citadel; they had been considered impractical in his day, requiring too much energy, too costly to maintain. Glowglobes were simpler and easily replaced. He had come to realize, however, that Leto considered few things impractical.\u003c/p\u003e\n\u003cp\u003eWhat Leto wants, someone provides.\u003c/p\u003e\n\u003cp\u003eThe thought had an ominous feeling as Idaho marched down the corridor toward Moneo.\u003c/p\u003e\n\u003cp\u003eSmall rooms lined the corridor sietch-fashion, no doors, only thin hangings of russet fabric which swayed in the breeze. Idaho knew that this area was mostly quarters for the younger Fish Speakers. He had recognized an assembly chamber with attendant rooms for weapons storage, kitchen, a dining hall, maintenance shops. He had also seen other things behind the inadequate privacy of the hangings, things which fed his rage.\u003c/p\u003e\n\u003cp\u003eMoneo turned at Idaho\u0027s approach. The woman to whom Moneo had been talking retreated and let the hanging drop, but not before Idaho glimpsed an older face with an air of command about it. Idaho did not recognize that particular commander.\u003c/p\u003e\n\u003cp\u003eMoneo nodded as Idaho stopped two paces away.\u003c/p\u003e\n\u003cp\u003e\"The guards say you\u0027ve been looking for me,\" Moneo said.\u003c/p\u003e\n\u003cp\u003e\"Where is he, Moneo?\"\u003c/p\u003e\n\u003cp\u003e\"Where is who?\"\u003c/p\u003e\n\u003cp\u003eMoneo swept his gaze up and down Idaho\u0027s figure, noting the old-fashioned Atreides uniform, black with a red hawk at the breast, the high boots glistening with polish. There was a ritual look about the man.\u003c/p\u003e\n\u003cp\u003eIdaho took a shallow breath and spoke through clenched teeth: \"Don\u0027t you start that game with me!\"\u003c/p\u003e\n\u003cp\u003eMoneo took his attention away from the sheathed knife at Idaho\u0027s waist. It looked like a museum piece with its jeweled handle. Where had Idaho found it?\"\u003c/p\u003e\n\u003cp\u003e\"If you mean the God Emperor...\" Moneo said.\u003c/p\u003e\n\u003cp\u003e\"Where?\"\u003c/p\u003e\n\u003cp\u003eMoneo kept his voice mild. \"Why are you so anxious to die?\"\u003c/p\u003e\n\u003cp\u003e\"They said you were with him.\"\u003c/p\u003e\n\u003cp\u003e\"That was earlier.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll find him, Moneo!\"\u003c/p\u003e\n\u003cp\u003e\"Not right now.\"\u003c/p\u003e\n\u003cp\u003eIdaho put a hand on his knife. \"Do I have to use force to make you talk?\"\u003c/p\u003e\n\u003cp\u003e\"I would not advise that.\"\u003c/p\u003e\n\u003cp\u003e\"Where... is... he?\"\u003c/p\u003e\n\u003cp\u003e\"Since you insist, he is out in the desert with Siona.\"\u003c/p\u003e\n\u003cp\u003e\"With your daughter?\" \"Is there another Siona?\" \"What\u0027re they doing?\" \"She is being tested.\" \"When will they return?\" Moneo shrugged, then: \"Why this unseemly anger, Duncan?\" \"What\u0027s this test of your..\u003c/p\u003e\n\u003cp\u003e.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. Now, why are you so upset?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sick of this place! Fish Speakers!\" He turned his head and spat.\u003c/p\u003e\n\u003cp\u003eMoneo glanced down the corridor behind Idaho, recalling the man\u0027s approach. Knowing the Duncans, it was easy to recognize what had fed his current rage.\u003c/p\u003e\n\u003cp\u003e\"Duncan,\" Moneo said, \"it\u0027s perfectly normal for adolescent females as well as males to have feelings of physical attraction toward members of their own sex. Most of them will grow out of it.\"\u003c/p\u003e\n\u003cp\u003e\"It should be stamped out!\"\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s part of our heritage.\"\u003c/p\u003e\n\u003cp\u003e\"Stamped out! And that\u0027s not..\u003c/p\u003e\n\u003cp\u003e.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, be still. If you try to suppress it, you only increase its power.\"\u003c/p\u003e\n\u003cp\u003eIdaho glared at him. \"And you say you don\u0027t know what\u0027s going on up there with your own daughter!\"\u003c/p\u003e\n\u003cp\u003e\"Siona is being tested, I told you.\"\u003c/p\u003e\n\u003cp\u003e\"And what\u0027s that supposed to mean?\"\u003c/p\u003e\n\u003cp\u003eMoneo put a hand over his eyes and sighed. He lowered the hand, wondering why he put up with this foolish, dangerous, antique human.\u003c/p\u003e\n\u003cp\u003e\"It means that she may die out there.\"\u003c/p\u003e\n\u003cp\u003eIdaho was taken aback, some of his anger cooling. \"How can you allow...\"\u003c/p\u003e\n\u003cp\u003e\"Allow? You think I have a choice?\"\u003c/p\u003e\n\u003cp\u003e\"Every man has a choice!\"\u003c/p\u003e\n\u003cp\u003eA bitter smile flitted across Moneo\u0027s lips. \"How is it that you are so much more foolish than the other Duncans?\"\u003c/p\u003e\n\u003cp\u003e\"Other Duncans!\" Idaho said. \"How did those others die, Moneo?\"\u003c/p\u003e\n\u003cp\u003e\"The way we all die. They ran out of time.\"\u003c/p\u003e\n\u003cp\u003e\"You lie.\" Idaho spoke past gritted teeth, his knuckles white on the knife handle.\u003c/p\u003e\n\u003cp\u003eStill speaking mildly, Moneo said: \"Have a care. There are limits even to what I will take, especially just now.\"\u003c/p\u003e\n\u003cp\u003e\"This place is rotten!\" Idaho said. He gestured with his free hand at the corridor behind him. \"There are some things I\u0027ll never accept!\"\u003c/p\u003e\n\u003cp\u003eMoneo stared down the empty corridor without seeing. \"You must mature, Duncan. You must.\"\u003c/p\u003e\n\u003cp\u003eIdaho\u0027s hand tensed on the knife. \"What does that mean?\"\u003c/p\u003e\n\u003cp\u003e\"These are sensitive times. Anything unsettling to him, anything... must be prevented.\"\u003c/p\u003e\n\u003cp\u003eIdaho held himself on the edge of violence, his anger restrained only by something puzzling in Moneo\u0027s manner. Words had been spoken, though, which could not be ignored.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not some damned immature child you can...\"\u003c/p\u003e\n\u003cp\u003e\"Duncan!\" It was the loudest sound Idaho had ever heard from the mild-mannered Moneo. Surprise stayed Idaho\u0027s hand while Moneo continued: \"If the demands of your flesh are for maturity, but something holds you in adolescence, quite nasty behavior develops. Let go.\"\u003c/p\u003e\n\u003cp\u003e\"Are... you... accusing... me... of.,\u003c/p\u003e\n\u003cp\u003e\"No!\" Moneo gestured at the corridor. \"Oh, I know. what you must\u0027ve seen back there, but it...\"\u003c/p\u003e\n\u003cp\u003e\"Two women in a passionate kiss! You think that\u0027s not...\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not important. Youth explores its potential in many ways.\"\u003c/p\u003e\n\u003cp\u003eIdaho balanced himself on the edge of an explosion, rocking forward on his toes. \"I\u0027m glad to learn about you, Moneo.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, well, I\u0027ve learned about you, several times.\"\u003c/p\u003e\n\u003cp\u003eMoneo watched the effect of these words as they twisted through Idaho, tangling him. The gholas could never avoid a fascination with the others who had preceded them.\u003c/p\u003e\n\u003cp\u003eIdaho spoke in a hoarse whisper: \"What have you learned?\"\u003c/p\u003e\n\u003cp\u003e\"You have taught me valuable things,\" Moneo said. \"All of us try to evolve, but if something blocks us, we can transfer our potential into pain-seeking it or giving it. Adolescents are particularly vulnerable.\"\u003c/p\u003e\n\u003cp\u003eIdaho leaned close to Moneo. \"I\u0027m talking about sex!\"\u003c/p\u003e\n\u003cp\u003e\"Of course you are.\"\u003c/p\u003e\n\u003cp\u003e\"Are you accusing me of adolescent...\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s right.\"\u003c/p\u003e\n\u003cp\u003e\"I should cut your..\u003c/p\u003e\n\u003cp\u003e.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, shut up!\"\u003c/p\u003e\n\u003cp\u003eMoneo\u0027s response did not have the training nuances of Bene Gesserit Voice control, but it had a lifetime of command behind it. Something in Idaho could only obey.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry,\" Moneo said. \"But I\u0027m distracted by the fact that my only daughter...\" He broke off and shrugged.\u003c/p\u003e\n\u003cp\u003eIdaho inhaled two deep breaths. \"You\u0027re crazy, all of you! You say your daughter may be dying and yet you...\"\u003c/p\u003e\n\u003cp\u003e\"You fool!\" Moneo snapped. \"Have you any idea how your petty concerns appear to me! Your stupid questions and your selfish...\" He broke off, shaking his head.\u003c/p\u003e\n\u003cp\u003e\"I make allowances because you have personal problems,\" Idaho said. \"But if you...\"\u003c/p\u003e\n\u003cp\u003e\"Allowances? You make allowances?\" Moneo took a trembling breath. It was too much!\u003c/p\u003e\n\u003cp\u003eIdaho spoke stiffly: \"I can forgive you for...\"\u003c/p\u003e\n\u003cp\u003e\"You! You prattle about sex and forgiving and pain and... you think you and Hwi Noree...\"\u003c/p\u003e\n\u003cp\u003e\"Leave her out of this!\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes. Leave her out. Leave out that pain! You share sex with her and you never think about parting. Tell me, fool, how do you give of yourself in the face of that?\"\u003c/p\u003e\n\u003cp\u003eAbashed, Idaho inhaled deeply. He had not suspected such passion smoldering in the quiet Moneo, but this attack, this could not be...\u003c/p\u003e\n\u003cp\u003e\"You think I\u0027m cruel?\" Moneo demanded. \"I make you think about things you\u0027d rather avoid. Hah! Crueler things have been done to the Lord Leto for no better reason than the cruelty!\"\u003c/p\u003e\n\u003cp\u003e\"You defend him? You...\"\u003c/p\u003e\n\u003cp\u003e\"I know him best!\"\u003c/p\u003e\n\u003cp\u003e\"He uses you!\"\u003c/p\u003e\n\u003cp\u003e\"To what ends?\"\u003c/p\u003e\n\u003cp\u003e\"You tell me!\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s our best hope to perpetuate...\"\u003c/p\u003e\n\u003cp\u003e\"Perverts don\u0027t perpetuate!\"\u003c/p\u003e\n\u003cp\u003eMoneo spoke in a soothing tone, but his words shook Idaho. \"I will tell you this only once. Homosexuals have been among the best warriors in our history, the berserkers of last resort. They were among our best priests and priestesses. Celibacy was no accident in religions. It is also no accident that adolescents make the best soldiers.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s perversion!\"\u003c/p\u003e\n\u003cp\u003e\"Quite right. Military commanders have known about the perverted displacement of sex into pain for thousands upon thousands of centuries.\"\u003c/p\u003e\n\u003cp\u003e\"Is that what the Great Lord Leto\u0027s doing?\"\u003c/p\u003e\n\u003cp\u003eStill mild, Moneo said: \"Violence requires that you inflict pain and suffer it. How much more manageable a military force driven to this by its deepest urgings.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s made a monster out of you, too!\"\u003c/p\u003e\n\u003cp\u003e\"You suggested that he uses me,\" Moneo said. \"I permit this because I know that the price he pays is much greater than what he demands of me.\"\u003c/p\u003e\n\u003cp\u003e\"Even your daughter?\"\u003c/p\u003e\n\u003cp\u003e\"He holds back nothing. Why should I? Ohhh, I think you understand this about the Atreides. The Duncans are always good at that.\"\u003c/p\u003e\n\u003cp\u003e\"The Duncans! Damn you, I won\u0027t be...\"\u003c/p\u003e\n\u003cp\u003e\"You just haven\u0027t the guts to pay the price he\u0027s asking,\" Moneo said.\u003c/p\u003e\n\u003cp\u003eIn one blurred motion, Idaho whipped his knife from its sheath and lunged at Moneo. As fast as he moved, Moneo moved faster-sidestepping, tripping Idaho and propelling him face-down onto the floor. Idaho scrambled forward, rolled and started to leap to his feet, then hesitated, realizing that he had actually tried to attack an Atreides. Moneo was Atreides. Shock held Idaho immobile.\u003c/p\u003e\n\u003cp\u003eMoneo stood unmoving, looking down at him. There was an odd look of sadness on the majordomo\u0027s face.\u003c/p\u003e\n\u003cp\u003e\"If you\u0027re going to kill me, Duncan, you\u0027d best do it in the back by stealth,\" Moneo said. \"You might succeed that way.\"\u003c/p\u003e\n\u003cp\u003eIdaho levered himself to one knee, put a foot flat on the floor, but remained there still clutching his knife. Moneo had moved so quickly and with such grace-so... so casually! Idaho cleared his throat. \"How did you...\"\u003c/p\u003e\n\u003cp\u003e\"He has been breeding us for a long time, Duncan, strengthening many things in us. He has bred us for speed, for intelligence, for self-restraint, for sensitivity. You\u0027re... you\u0027re just an older model.\" -\u003d Do you know what guerrillas often say? They claim that their rebellions are invulnerable to economic warfare because they have no economy, that they are parasitic on those they would overthrow. The fools merely fail to assess the coin in which they must inevitably pay. The pattern is inexorable in its degenerative failures. You see it repeated in the systems of slavery, of welfare states, of caste-ridden religions, of socializing bureaucracies-in any system which creates and maintains dependencies. Too long a parasite and you cannot exist without a host.\u003c/p\u003e\n\u003cp\u003e- The Stolen Journals LETO AND Siona lay all day in the dune-shadows, moving only as the sun moved. He taught her how to protect herself under a blanket of sand in the noontime heat; it never grew too warm at the rock-level between the dunes.\u003c/p\u003e\n\u003cp\u003eIn the afternoon, Siona crept close to Leto for warmth, a warmth he knew he had in excess these days.\u003c/p\u003e\n\u003cp\u003eThey talked sporadically. He told her about the Fremen graces which once had dominated this landscape. She probed for secret knowledge of him.\u003c/p\u003e\n\u003cp\u003eOnce, he said: \"You may find it odd, but out here is where I can be most human.\"\u003c/p\u003e\n\u003cp\u003eHis words failed to make her fully conscious of her human vulnerability and the fact that she might die out here. Even when she was not talking, she did not restore the face flap of her stillsuit.\u003c/p\u003e\n\u003cp\u003eLeto recognized the unconscious motivation behind this failure, but knew the futility of addressing that directly.\u003c/p\u003e\n\u003cp\u003eIn the late afternoon, night\u0027s chill already starting to creep over the land, he began regaling her with songs of the Long Trek which had not been saved in the Oral History. He enjoyed the fact that she liked one of his favorites, \"Liet\u0027s March.\"\u003c/p\u003e\n\u003cp\u003e\"The tune is really ancient,\" he said, \"a pre-space thing of Old Terra.\"\u003c/p\u003e\n\u003cp\u003e\"Would you sing it again?\"\u003c/p\u003e\n\u003cp\u003eHe chose one of his best baritones, a long-dead artist who had filled many a concert hall.\u003c/p\u003e\n\u003cp\u003e\"The wall of past-beyond-recall Hides me from an ancient fall Where all the waters tumble! And plays of sprays Carve caves in clays Beneath a torrent\u0027s rumble.\"\u003c/p\u003e\n\u003cp\u003eWhen he had finished, she was silent for a moment, then: \"That\u0027s an odd song for marching.\"\u003c/p\u003e\n\u003cp\u003e\"They liked it because they could dissect it,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Dissect?\"\u003c/p\u003e\n\u003cp\u003e\"Before our Fremen ancestors came to this planet, night was the time for storytelling, songs and poetry. In the Dune days, though, that was reserved for the false dark, the daytime gloom of the sietch. The night was when they could emerge and move about... just as we do now.\"\u003c/p\u003e\n\u003cp\u003e\"But you said dissect.\"\u003c/p\u003e\n\u003cp\u003e\"What does that song mean?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Oh. It\u0027s... it\u0027s just a song.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/god-emperor-of-dune-dune-chronicles-4/page-26.html","bookId":2156,"creation":"Oct 5, 2019 6:26:28 PM","modification":"Oct 5, 2019 6:26:28 PM"}
