{"id":97304,"no":7,"title":"Page 7","content":"\u003cp\u003e\"You\u0027re not answering my question.\"\u003c/p\u003e\n\u003cp\u003e\"You think them inadequate?\"\u003c/p\u003e\n\u003cp\u003e\"Some of them looked pretty tough, but...\"\u003c/p\u003e\n\u003cp\u003e\"Others were, ahhh, soft with you?\"\u003c/p\u003e\n\u003cp\u003eIdaho blushed.\u003c/p\u003e\n\u003cp\u003eLeto found this a charming reaction. The Duncans were among the few humans of these times who could do this. It was understandable, a product of the Duncans\u0027 early training, their sense of personal honor-very chivalrous.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see why you trust women to protect you,\" Idaho said. The blood slowly receded from his cheeks. He glared at Leto.\u003c/p\u003e\n\u003cp\u003e\"But I have always trusted them as I trust you-with my life.\"\u003c/p\u003e\n\u003cp\u003e\"What do we protect you from?\"\u003c/p\u003e\n\u003cp\u003e\"Moneo and my Fish Speakers will bring you up to date.\"\u003c/p\u003e\n\u003cp\u003eIdaho shifted from one foot to the other, his body swaying in a heartbeat rhythm. He stared around the small room, his eyes not focusing. With the abruptness of sudden decision, he returned his attention to Leto.\u003c/p\u003e\n\u003cp\u003e\"What do I call you?\"\u003c/p\u003e\n\u003cp\u003eIt was the sign of acceptance for which Leto had been waiting. \"Will Lord Leto do?\"\u003c/p\u003e\n\u003cp\u003e\"Yes... m\u0027Lord.\" Idaho stared directly into Leto\u0027s Fremen blue eyes. \"Is it true what your Fish Speakers say-you have... memories of...\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re all here, Duncan.\" Leto spoke it in the voice of his paternal grandfather, then:\u003c/p\u003e\n\u003cp\u003e\"Even the women are here, Duncan.\" It was the voice of Jessica, Leto\u0027s paternal grandmother.\u003c/p\u003e\n\u003cp\u003e\"You knew them well,\" Leto said. \"And they know you.\"\u003c/p\u003e\n\u003cp\u003eIdaho inhaled a slow, trembling breath. \"That will take a little getting used to.\"\u003c/p\u003e\n\u003cp\u003e\"My own initial reaction exactly,\" Leto said.\u003c/p\u003e\n\u003cp\u003eAn explosion of laughter shook Idaho, and Leto thought it more than the weak jest deserved, but he remained silent.\u003c/p\u003e\n\u003cp\u003ePresently, Idaho said: \"Your Fish Speakers were supposed to put me in a good mood, weren\u0027t they\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"Did they succeed?\"\u003c/p\u003e\n\u003cp\u003eIdaho studied Leto\u0027s face, recognizing the distinctive Atreides features.\u003c/p\u003e\n\u003cp\u003e\"You Atreides always did know me too well,\" Idaho said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s better,\" Leto said. \"You\u0027re beginning to accept that I\u0027m not just one Atreides. I\u0027m all of them.\"\u003c/p\u003e\n\u003cp\u003e\"Paul said that once.\"\u003c/p\u003e\n\u003cp\u003e\"So I did!\" As much as the original personality could be conveyed by tone and accent, it was Muad\u0027Dib speaking.\u003c/p\u003e\n\u003cp\u003eIdaho gulped, looked away at the room\u0027s door.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve taken something away from us,\" he said. \"I can feel it. Those women... Moneo...\"\u003c/p\u003e\n\u003cp\u003eUs against you, Leto thought. The Duncans always choose the human side.\u003c/p\u003e\n\u003cp\u003eIdaho returned his attention to Leto\u0027s face. \"What have you given us in exchange?\"\u003c/p\u003e\n\u003cp\u003e\"Throughout the Empire, Leto\u0027s Peace!\"\u003c/p\u003e\n\u003cp\u003e\"And I can see that everyone\u0027s delightfully happy! That\u0027s why you need a personal guard.\"\u003c/p\u003e\n\u003cp\u003eLeto smiled. \"My peace is actually enforced tranquility. Humans have a long history of reacting against tranquility.\"\u003c/p\u003e\n\u003cp\u003e\"So you give us the Fish Speakers.\"\u003c/p\u003e\n\u003cp\u003e\"And a hierarchy you can identify without any mistakes.\"\u003c/p\u003e\n\u003cp\u003e\"A female army,\" Idaho muttered.\u003c/p\u003e\n\u003cp\u003e\"The ultimate male-enticing force,\" Leto said. \"Sex always was a way of subduing the aggressive male.\"\u003c/p\u003e\n\u003cp\u003e\"Is that what they do?\"\u003c/p\u003e\n\u003cp\u003e\"They prevent or ameliorate excesses which could lead to more painful violence.\"\u003c/p\u003e\n\u003cp\u003e\"And you let them believe you\u0027re a god. I don\u0027t think I like this.\"\u003c/p\u003e\n\u003cp\u003e\"The curse of holiness is as offensive to me as it is to you!\"\u003c/p\u003e\n\u003cp\u003eIdaho frowned. It was not the response he had expected.\u003c/p\u003e\n\u003cp\u003e\"What kind of game are you playing, Lord Leto?\"\u003c/p\u003e\n\u003cp\u003e\"A very old one but with new rules.\"\u003c/p\u003e\n\u003cp\u003e\"Your rules!\"\u003c/p\u003e\n\u003cp\u003e\"Would you rather I turned it all back to CHOAM and Landsraad and the Great Houses?\"\u003c/p\u003e\n\u003cp\u003e\"The Tleilaxu say there is no more Landsraad. You don\u0027t allow any real self-rule.\"\u003c/p\u003e\n\u003cp\u003e\"Well then, I could step aside for the Bene Gesserit. Or maybe the Ixians or the Tleilaxu? Would you like me to find another Baron Harkonnen to assume power over the Empire\u0027.\" Say the word, Duncan, and I\u0027ll abdicate!\"\u003c/p\u003e\n\u003cp\u003eUnder this avalanche of meanings, Idaho again shook his head from side to side.\u003c/p\u003e\n\u003cp\u003e\"In the wrong hands,\" Leto said, \"monolithic centralized power is a dangerous and volatile instrument.\"\u003c/p\u003e\n\u003cp\u003e\"And your hands are the right ones?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not certain about my hands, but I will tell you, Duncan, I\u0027m certain about the hands of those who\u0027ve gone before me. I know them.\"\u003c/p\u003e\n\u003cp\u003eIdaho turned his back on Leto.\u003c/p\u003e\n\u003cp\u003eWhat a fascinating, ultimately human gesture, Leto thought. Rejection coupled to acceptance of his vulnerability.\u003c/p\u003e\n\u003cp\u003eLeto spoke to Idaho\u0027s back.\u003c/p\u003e\n\u003cp\u003e\"You object quite rightly that I use people without their full knowledge and consent.\"\u003c/p\u003e\n\u003cp\u003eIdaho turned his profile to Leto, then turned his head to look up at the cowled face, cocking his head forward a bit to peer into the all-blue eyes.\u003c/p\u003e\n\u003cp\u003eHe is studying me, Leto thought, but he has only the face to measure me by.\u003c/p\u003e\n\u003cp\u003eThe Atreides had taught their people to know the subtle signals of face and body, and Idaho was good at it, but the realization could be seen coming over him: he was beyond his depth here.\u003c/p\u003e\n\u003cp\u003eIdaho cleared his throat. \"What\u0027s the worst thing you would ask of me?\"\u003c/p\u003e\n\u003cp\u003eHow like a Duncan! Leto thought. This one was a classic. Idaho would give his loyalty to an Atreides, to the guardian of his oath, but he sent a signal that he would not go beyond the personal limits of his own morality.\u003c/p\u003e\n\u003cp\u003e\"You will be asked to guard me by whatever means necessary, and you will be asked to guard my secret.\"\u003c/p\u003e\n\u003cp\u003e\"What secret?\"\u003c/p\u003e\n\u003cp\u003e\"That I am vulnerable.\"\u003c/p\u003e\n\u003cp\u003e\"That you\u0027re not God?\"\u003c/p\u003e\n\u003cp\u003e\"Not in that ultimate sense.\"\u003c/p\u003e\n\u003cp\u003e\"Your Fish Speakers talk about rebels.\"\u003c/p\u003e\n\u003cp\u003e\"They exist.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"They are young and I have not convinced them that my way is better. It\u0027s very difficult convincing the young of anything. They\u0027re born knowing so much.\"\u003c/p\u003e\n\u003cp\u003e\"I never before heard an Atreides sneer at the young that way.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps it\u0027s because I\u0027m so much older-old compounded by old. And my task gets more difficult with each passing generation.\"\u003c/p\u003e\n\u003cp\u003e\"What is your task?\"\u003c/p\u003e\n\u003cp\u003e\"You will come to understand it as we go along.\"\u003c/p\u003e\n\u003cp\u003e\"What happens if I fail you? Do your women eliminate me?\"\u003c/p\u003e\n\u003cp\u003e\"I try not to burden the Fish Speakers with guilt.\"\u003c/p\u003e\n\u003cp\u003e\"But you would burden me?\"\u003c/p\u003e\n\u003cp\u003e\"If you accept it.\"\u003c/p\u003e\n\u003cp\u003e\"If I find that you\u0027re worse than the Harkonnens, I\u0027ll turn against you.\"\u003c/p\u003e\n\u003cp\u003eHow like a Duncan. They measure all evil against the Harkonnens. How little they know of evil.\u003c/p\u003e\n\u003cp\u003eLeto said: \"The Baron ate whole planets, Duncan. What could be worse than that?\"\u003c/p\u003e\n\u003cp\u003e\"Eating the Empire.\"\u003c/p\u003e\n\u003cp\u003e\"I am pregnant with my Empire. I\u0027ll die giving birth to it.\"\u003c/p\u003e\n\u003cp\u003e\"If I could believe that...\"\u003c/p\u003e\n\u003cp\u003e\"Will you command my Guard?\"\u003c/p\u003e\n\u003cp\u003e\"Why me\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the best.\"\u003c/p\u003e\n\u003cp\u003e\"Dangerous work, I\u0027d imagine. Is that how my predecessors died, doing your dangerous work?\"\u003c/p\u003e\n\u003cp\u003e\"Some of them.\"\u003c/p\u003e\n\u003cp\u003e\"I wish I had the memories of those others!\"\u003c/p\u003e\n\u003cp\u003e\"You couldn\u0027t have and still be the original.\"\u003c/p\u003e\n\u003cp\u003e\"I want to learn about them, though.\"\u003c/p\u003e\n\u003cp\u003e\"You will.\"\u003c/p\u003e\n\u003cp\u003e\"So the Atreides still need a sharp knife?\"\u003c/p\u003e\n\u003cp\u003e\"We have jobs that only a Duncan Idaho can do.\"\u003c/p\u003e\n\u003cp\u003e\"You say... we...\" Idaho swallowed, looked at the door, then at Leto\u0027s face.\u003c/p\u003e\n\u003cp\u003eLeto spoke to him as Muad\u0027Dib would have, but still in the Leto-voice.\u003c/p\u003e\n\u003cp\u003e\"When we climbed to Sietch Tabr for the last time together, you had my loyalty then and I had yours. Nothing of that has really changed.\"\u003c/p\u003e\n\u003cp\u003e\"That was your father.\"\u003c/p\u003e\n\u003cp\u003e\"That was me!\" Paul Muad\u0027Dib\u0027s voice of command coming from Leto\u0027s bulk always shocked the gholas.\u003c/p\u003e\n\u003cp\u003eIdaho whispered: \"All of you... in that one... body...\" He broke off.\u003c/p\u003e\n\u003cp\u003eLeto remained silent. This was the decision moment.\u003c/p\u003e\n\u003cp\u003ePresently, Idaho permitted himself that devil-may-care grin for which he had been so well known. \"Then I will speak to the first Leto and to Paul, the ones who know me best. Use me well, for I did love you.\"\u003c/p\u003e\n\u003cp\u003eLeto closed his eyes. Such words always distressed him. He knew it was love to which he was most vulnerable.\u003c/p\u003e\n\u003cp\u003eMoneo, who had been listening, came to the rescue. He entered and said: \"Lord, shall I take Duncan Idaho to the guards he will command?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" The one word was all that Leto could manage.\u003c/p\u003e\n\u003cp\u003eMoneo took Idaho\u0027s arm and led him away.\u003c/p\u003e\n\u003cp\u003eGood Moneo, Leto thought. So good. He knows me so well, but l despair of his ever understanding me. -\u003d I know the evil of my ancestors because I am those people. The balance is delicate in the extreme. I know that few of you who read my words have ever thought about your ancestors this way. It has not occurred to you that your ancestors were survivors and that the survival itself sometimes involved savage decisions, a kind of wanton brutality which civilized humankind works very hard to suppress. What price will you pay for that suppression? Will you accept your own extinction?\u003c/p\u003e\n\u003cp\u003e- The Stolen Journals AS HE dressed for his first morning of Fish Speaker command, Idaho tried to shake off a nightmare. It had awakened him twice and both times he had gone out on the balcony to stare up at the stars, the dream still roaring in his head.\u003c/p\u003e\n\u003cp\u003eWomen... weaponless women in black armor... rushing at him with the hoarse, mindless shouting of a mob... waving hands moist with red blood... and as they swarmed over him, their mouths opened to display terrible fangs!\u003c/p\u003e\n\u003cp\u003eIn that moment, he awoke.\u003c/p\u003e\n\u003cp\u003eMorning light did little to dispel the effects of the nightmare.\u003c/p\u003e\n\u003cp\u003eThey had provided him with a room in the north tower. The balcony looked out over a vista of dunes to a distant cliff with what appeared to be a mud-but village at its base.\u003c/p\u003e\n\u003cp\u003eIdaho buttoned his tunic as he stared at the scene.\u003c/p\u003e\n\u003cp\u003eWhy does Leto choose only women for his army?\u003c/p\u003e\n\u003cp\u003eSeveral comely Fish Speakers had offered to spend the night with their new commander, but Idaho had rejected them.\u003c/p\u003e\n\u003cp\u003eIt was not like the Atreides to use sex as a persuader!\u003c/p\u003e\n\u003cp\u003eHe looked down at his clothing: a black uniform with golden piping, a red hawk at the left breast. That, at least, was familiar. No insignia of rank.\u003c/p\u003e\n\u003cp\u003e\"They know your face,\" Moneo had said.\u003c/p\u003e\n\u003cp\u003eStrange little man, Moneo.\u003c/p\u003e\n\u003cp\u003eThis thought brought Idaho up short. Reflection told him that Moneo was not little. Very controlled, yes, but no shorter than I am. Moneo appeared drawn into himself, though... collected.\u003c/p\u003e\n\u003cp\u003eIdaho glanced around his room-sybaritic in its attention to comfort-soft cushions, appliances concealed behind panels of brown polished wood. The bath was an ornate display of pastel blue tiles with a combination bath and shower in which at least six people could bathe at the same time. The whole place invited self-indulgence. These were quarters where you could let your senses indulge in remembered pleasures.\u003c/p\u003e\n\u003cp\u003e\"Clever,\" Idaho whispered.\u003c/p\u003e\n\u003cp\u003eA gentle tapping on his door was followed by a female voice saying: \"Commander? Moneo is here.\"\u003c/p\u003e\n\u003cp\u003eIdaho glanced out at the sunburnt colors on the distant cliff.\u003c/p\u003e\n\u003cp\u003e\"Commander?\" The voice was a bit louder.\u003c/p\u003e\n\u003cp\u003e\"Come in,\" Idaho called.\u003c/p\u003e\n\u003cp\u003eMoneo entered, closing the door behind him. He wore tunic and trousers of chalk-white which forced the eyes to concentrate on his face. Moneo glanced once around the room.\u003c/p\u003e\n\u003cp\u003e\"So this is where they put you. Those damned women! I suppose they thought they were being kind, but they ought to know better.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know what I like?\" Idaho demanded. Even as he asked it, he realized it was a foolish question.\u003c/p\u003e\n\u003cp\u003eI\u0027m not the first Duncan Idaho that Moneo has seen.\u003c/p\u003e\n\u003cp\u003eMoneo merely smiled and shrugged.\u003c/p\u003e\n\u003cp\u003e\"I did not mean to offend you, Commander. Will you keep these quarters, then?\"\u003c/p\u003e\n\u003cp\u003e\"I like the view.\"\u003c/p\u003e\n\u003cp\u003e\"But not the furnishings.\" It was a statement.\u003c/p\u003e\n\u003cp\u003e\"Those can be changed,\" Idaho said.\u003c/p\u003e\n\u003cp\u003e\"I will see to it.\"\u003c/p\u003e\n\u003cp\u003e\"I suppose you\u0027re here to explain my duties.\"\u003c/p\u003e\n\u003cp\u003e\"As much as I can. I know how strange everything must appear to you at first. This civilization is profoundly different from the one you knew.\"\u003c/p\u003e\n\u003cp\u003e\"I can see that. How did my... predecessor die?\"\u003c/p\u003e\n\u003cp\u003eMoneo shrugged. It appeared to be his standard gesture, but there was nothing self-effacing about it.\u003c/p\u003e\n\u003cp\u003e\"He was not fast enough to escape the consequences of a decision he had made,\" Moneo said.\u003c/p\u003e\n\u003cp\u003e\"Be specific.\"\u003c/p\u003e\n\u003cp\u003eMoneo sighed. The Duncans were always like this-so demanding.\u003c/p\u003e\n\u003cp\u003e\"The rebellion killed him. Do you wish the details?\"\u003c/p\u003e\n\u003cp\u003e\"Would they be useful to me?\"\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll want a complete briefing on this rebellion today, but first: why are there no men in Leto\u0027s army?\"\u003c/p\u003e\n\u003cp\u003e\"He has you.\"\u003c/p\u003e\n\u003cp\u003e\"You know what I mean.\"\u003c/p\u003e\n\u003cp\u003e\"He has a curious theory about armies. I have discussed it with him on many occasions. But do you not want to breakfast before I explain?\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t we have both at the same time?\"\u003c/p\u003e\n\u003cp\u003eMoneo turned toward the door and called out a single word: \"Now!\"\u003c/p\u003e\n\u003cp\u003eThe effect was immediate and fascinating to Idaho. A troop of young Fish Speakers swarmed into the room. Two of them took a folding table and chairs from behind a panel and placed them on the balcony. Others set the table for two people. More brought food-fresh fruit, hot rolls and a steaming drink which smelled faintly of spice and caffeine. It was all done with a swift and silent efficiency which spoke of long practice. They left as they had come, without a word.\u003c/p\u003e\n\u003cp\u003eIdaho found himself seated across from Moneo at the table within a minute after the start of this curious performance.\u003c/p\u003e\n\u003cp\u003e\"Every morning like that?\" Idaho asked.\u003c/p\u003e\n\u003cp\u003e\"Only if you wish it.\"\u003c/p\u003e\n\u003cp\u003eIdaho sampled the drink: melange-coffee. He recognized the fruit, the soft Caladan melon called paradan.\u003c/p\u003e\n\u003cp\u003eMy favorite.\u003c/p\u003e\n\u003cp\u003e\"You know me pretty well,\" Idaho said.\u003c/p\u003e\n\u003cp\u003eMoneo smiled. \"We\u0027ve had some practice. Now, about your question.\"\u003c/p\u003e\n\u003cp\u003e\"And Leto\u0027s curious theory.\"\u003c/p\u003e\n\u003cp\u003e\"Yes. He says that the all-male army was too dangerous to its civilian support base.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s crazy! Without the army, there would\u0027ve been no...\u003c/p\u003e\n\u003cp\u003e\"I know the argument. But he says that the male army was a survival of the screening function delegated to the nonbreeding males in the prehistoric pack. He says it was a curiously consistent fact that it was always the older males who sent the younger males into battle.\"\u003c/p\u003e\n\u003cp\u003e\"What does that mean, screening function?\"\u003c/p\u003e\n\u003cp\u003e\"The ones who were always out on the dangerous perimeter protecting the core of breeding males, females and the young. The ones who first encountered the predator.\"\u003c/p\u003e\n\u003cp\u003e\"How is that dangerous to the... civilians?\"\u003c/p\u003e\n\u003cp\u003eIdaho took a bite of the melon, found it ripened perfectly.\u003c/p\u003e\n\u003cp\u003e\"The Lord Leto says that when it was denied an external enemy, the all-male army always turned against its own population. Always.\"\u003c/p\u003e\n\u003cp\u003e\"Contending for the females?\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps. He obviously does not believe, however, that it was that simple.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t find this a curious theory.\"\u003c/p\u003e\n\u003cp\u003e\"You have not heard all of it.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s more?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, yes. He says that the all-male army has a strong tendency toward homosexual activities.\"\u003c/p\u003e\n\u003cp\u003eIdaho glared across the table at Moneo. \"I never...\"\u003c/p\u003e\n\u003cp\u003e\"Of course not. He is speaking about sublimation, about deflected energies and all the rest of it.\"\u003c/p\u003e\n\u003cp\u003e\"The rest of what?\" Idaho was prickly with anger at what he saw as an attack on his male self-image.\u003c/p\u003e\n\u003cp\u003e\"Adolescent attitudes, just boys together, jokes designed purely to cause pain, loyalty only to your pack-mates... things of that nature.\"\u003c/p\u003e\n\u003cp\u003eIdaho spoke coldly. \"What\u0027s your opinion?\"\u003c/p\u003e\n\u003cp\u003e\"I remind myself\u003d\" Moneo turned and spoke while looking out at the view\u003d\u0027of something which he has said and which I am sure is true. He is every soldier in human history. He offered to parade for me a series of examples-famous military figures who were frozen in adolescence. I declined the offer. I have read my history with care and have recognized this characteristic for myself.\"\u003c/p\u003e\n\u003cp\u003eMoneo turned and looked directly into Idaho\u0027s eyes.\u003c/p\u003e\n\u003cp\u003e\"Think about it, Commander.\"\u003c/p\u003e\n\u003cp\u003eIdaho prided himself on self-honesty and this hit him. Cults of youth and adolescence preserved in the military? It had the ring of truth. There were examples in his own experience...\u003c/p\u003e\n\u003cp\u003eMoneo nodded. \"The homosexual, latent or otherwise, who maintains that condition for reasons which could be called purely psychological, tends to indulge in pain-causing behavior-seeking it for himself and inflicting it upon others. Lord Leto says this goes back to the testing behavior in the prehistoric pack.\"\u003c/p\u003e\n\u003cp\u003e\"You believe him\u0027?\"\u003c/p\u003e\n\u003cp\u003e\"I do.\"\u003c/p\u003e\n\u003cp\u003eIdaho took a bite of the melon. It had lost its sweet savor. He swallowed and put down his spoon.\u003c/p\u003e\n\u003cp\u003e\"I will have to think about this,\" Idaho said.\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not eating,\" Idaho said.\u003c/p\u003e\n\u003cp\u003e\"I was up before dawn and ate then.\" Moneo gestured at his plate. \"The women continually try to tempt me.\"\u003c/p\u003e\n\u003cp\u003e\"Do they ever succeed?\"\u003c/p\u003e\n\u003cp\u003e\"Occasionally.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right. I find his theory curious. Is there more to it?\"\u003c/p\u003e\n\u003cp\u003e\"Ohhh, he says that when it breaks out of the adolescent homosexual restraints, the male army is essentially rapist. Rape is often murderous and that\u0027s not survival behavior.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/god-emperor-of-dune-dune-chronicles-4/page-7.html","bookId":2156,"creation":"Oct 5, 2019 6:26:28 PM","modification":"Oct 5, 2019 6:26:28 PM"}
