{"id":69779,"no":16,"title":"Page 16","content":"\u003cp\u003eEddie Cantor had starred in half a dozen movies and was arguably one of the most popular comedians in the country. He had appeared on Broadway for Florenz Ziegfeld, and Whoopee! and Roman Scandals had made him a star in the movies. He had his own radio show and it was a huge success.\u003c/p\u003e\n\u003cp\u003eI met Eddie in his large, sprawling house on Roxbury, in Beverly Hills. He was a short, dynamic man who never stopped moving. As he talked, he paced. As he listened, he paced. I almost had the feeling that while we were sitting at lunch, Eddie was mentally pacing.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know if they explained it to you, Sidney, but here\u0027s the situation: RKO has turned down three scripts that my boys prepared.\" \"His boys\" were his radio writers. \"I\u0027m running out of time. I need a script the studio will approve in the next three months or the deal is off. Do you think you can come up with a blockbuster story for me?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d like to try.\"\u003c/p\u003e\n\u003cp\u003e\"Good. You\u0027re going to have to work your ass off to get the script in on time. But when you finish the first draft and the studio approves it, then you\u0027ll have all the time in the world to polish the dialogue, tighten it up, do whatever you want with it. It will be all yours.\"\u003c/p\u003e\n\u003cp\u003e\"That sounds fair,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Meanwhile, we\u0027re under a deadline. We\u0027re going to have to work eight days a week.\"\u003c/p\u003e\n\u003cp\u003eI thought about the pressure of the Broadway shows I had done. \"I\u0027m used to that.\"\u003c/p\u003e\n\u003cp\u003eThe telephone rang and he picked it up. \"This is Eddie Cantor.\"\u003c/p\u003e\n\u003cp\u003eAnd to this day, I have never heard a man say his own name with such pride.\u003c/p\u003e\n\u003cp\u003eWe went to work. We discussed the framework of an idea I had, to star Eddie and Joan Davis. He liked it, and I began to write. I usually worked at his house, starting early in the morning and leaving about seven o\u0027clock in the evening, including Saturdays and Sundays.\u003c/p\u003e\n\u003cp\u003eThe evenings were mine and I relaxed. I met a very attractive girl who seemed to like me and we began to have dinners together. The problem was that she could see me only every other evening.\u003c/p\u003e\n\u003cp\u003eI was curious. \"What do you do on the evenings I don\u0027t see you?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m seeing someone else, Sidney. I like you both very much, but I have to make up my mind.\"\u003c/p\u003e\n\u003cp\u003eWho\u0027s the other man?\u003c/p\u003e\n\u003cp\u003e\"His name is Jose Iturbi. He wants to marry me.\"\u003c/p\u003e\n\u003cp\u003eJose Iturbi was a famous pianist-conductor who gave concerts all over the world, and he had guest-starred in musicals at MGM, Paramount, and Fox. There was no way I could compete with a famous man like Iturbi.\u003c/p\u003e\n\u003cp\u003eShe said to me, \"Jose told me that you\u0027re a Coca-Cola.\"\u003c/p\u003e\n\u003cp\u003eI blinked. \"I\u0027m a what?\"\u003c/p\u003e\n\u003cp\u003e\"A Coca-Cola. He said there are millions of you and only one of him.\"\u003c/p\u003e\n\u003cp\u003eI never saw her again.\u003c/p\u003e\n\u003cp\u003eThree days before Eddie Cantor\u0027s contract with RKO would have expired, I delivered my screenplay. Sammy Weisbord sent it to RKO, and the following day it was approved. Now I could take my time and polish the dialogue and tighten the script. There were a lot of things I wanted to do with it that I had not been able to do because of the time pressure.\u003c/p\u003e\n\u003cp\u003eSammy Weisbord called me. \"Sidney, I\u0027m afraid you\u0027re off the picture.\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t sure I had heard him correctly. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Cantor is bringing in his radio writers to do the polish.\"\u003c/p\u003e\n\u003cp\u003eI thought of all the long days and weekends I had worked. You\u0027re going to have to work your ass off to get the script in on time. But when you finish the first draft and the studio approves it, then you\u0027ll have all the time in the world to polish the dialogue, tighten it up, do whatever you want with it. It will be all yours . . .\u003c/p\u003e\n\u003cp\u003eWelcome to Hollywood.\u003c/p\u003e\n\u003cp\u003eOn September 2, 1945, the Japanese formally surrendered. Richard was on his way home. I could not wait to see him.\u003c/p\u003e\n\u003cp\u003eOn Christmas Eve, Richard\u0027s ship finally docked in San Francisco. We had dinner his first night in Los Angeles. He looked thinner and physically fit. I was eager to hear all that had happened to him. I knew where he had been. New Guinea, Morotai, Leyte, Luzon . . .\u003c/p\u003e\n\u003cp\u003e\"What was it like?\"\u003c/p\u003e\n\u003cp\u003eMy brother looked at me a long time. \"Let\u0027s never discuss this again.\"\u003c/p\u003e\n\u003cp\u003e\"Fair enough. Do you know what you\u0027re going to do now?\"\u003c/p\u003e\n\u003cp\u003e\"Marty Leeb offered me a job. I\u0027m going to take it. I\u0027ll get to spend more time with Mom.\"\u003c/p\u003e\n\u003cp\u003eI was delighted. I knew he and Marty would get along well.\u003c/p\u003e\n\u003cp\u003eSam Weisbord called the next day. \"You have two offers for Suddenly It\u0027s Spring.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s great,\" I said excitedly. \"Who are they from?\"\u003c/p\u003e\n\u003cp\u003e\"One is from Walter Wanger.\" He had produced many prestigious movies, including Stagecoach, Foreign Correspondent, and The Long Voyage Home.\u003c/p\u003e\n\u003cp\u003e\"And the other one?\"\u003c/p\u003e\n\u003cp\u003e\"David Selznick.\"\u003c/p\u003e\n\u003cp\u003eMy heart stopped for a moment. \"David Selznick?\"\u003c/p\u003e\n\u003cp\u003e\"He loves your treatment. Dore Schary is going to co-produce for him. Wanger is offering forty thousand dollars. Selznick is offering thirty-five thousand dollars and each offer includes your writing the screenplay.\"\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t concerned about the money. The idea of working with Selznick was thrilling. Besides, hadn\u0027t he started me in the business? It would be good to get together with my fellow reader again.\u003c/p\u003e\n\u003cp\u003e\"Take the Selznick offer.\"\u003c/p\u003e\n\u003cp\u003eThe following morning I met with David Selznick and Dore Schary. Selznick was a tall, imposing figure, seated behind a huge desk in an ornate, beautifully furnished office. Dore Schary was dark and trim with a visible intelligence. We shook hands.\u003c/p\u003e\n\u003cp\u003eSelznick said, \"Sit down, Sheldon, I\u0027m glad to meet you.\"\u003c/p\u003e\n\u003cp\u003eI thought maybe I could see Mr. Selznick -\u003c/p\u003e\n\u003cp\u003eNo, Mr. Selznick is a busy man.\u003c/p\u003e\n\u003cp\u003e\"I liked your story. It\u0027s excellent. I hope your screenplay turns out as good as your original treatment.\"\u003c/p\u003e\n\u003cp\u003eDore said, \"I\u0027m sure it will be.\"\u003c/p\u003e\n\u003cp\u003eSelznick studied me a moment. \"I heard you had another offer from Wanger. I\u0027m glad you came to me. I talked to your agent. We\u0027ll pay you thirty-five thousand for the original and the screenplay.\"\u003c/p\u003e\n\u003cp\u003eI flashed back to Selznick\u0027s secretary handing me an envelope. There\u0027s ten dollars in there.\u003c/p\u003e\n\u003cp\u003eI started to work that morning. I was given an office at the RKO studios, where we were going to make Suddenly It\u0027s Spring. RKO was an important studio. They were currently shooting It\u0027s a Wonderful Life, The Farmer\u0027s Daughter, and Dick Tracy. In the commissary I saw James Stewart, Robert Mitchum, and Loretta Young, and because I had seen them so often in movies, I felt as though they were old friends. But I didn\u0027t have enough courage to speak to any of them.\u003c/p\u003e\n\u003cp\u003eI was enjoying writing the screenplay. The story involved a playboy, a young girl, and her sister, a judge. The man I had had in mind when I wrote the treatment was Cary Grant, but he was always so busy that I was sure it would be impossible to get him.\u003c/p\u003e\n\u003cp\u003eI thought the screenplay was coming along well. Knowing Selznick\u0027s penchant for hiring writer after writer on the same project, I was flattered that he had not tried to replace me. And then one day, I came across a memo from Selznick to Dore Schary:\u003c/p\u003e\n\u003cp\u003eWhy don\u0027t we fire Sheldon and bring another writer in?\u003c/p\u003e\n\u003cp\u003eTo Dore\u0027s credit, he had never mentioned that to me, and apparently found a way around Selznick\u0027s request.\u003c/p\u003e\n\u003cp\u003eMy moods were still fluctuating. I would go from periods of elation to periods of despondence, with no transition. At the Brown Derby restaurant one evening, a friend was seated with a young woman. He waved me over.\u003c/p\u003e\n\u003cp\u003e\"Sidney, I want you to meet Jane Harding.\"\u003c/p\u003e\n\u003cp\u003eJane was from New York. She was amusing and intelligent, with a restless vitality. I was taken with her immediately. We started dating, and within two months, we were married.\u003c/p\u003e\n\u003cp\u003eThere was no time for a honeymoon. The studio was starting to cast Suddenly It\u0027s Spring and Dore urged me to get my rewrites finished quickly.\u003c/p\u003e\n\u003cp\u003eRegretfully, in less than a month, Jane and I realized we had made a mistake. Our interests and personalities were totally opposite. We spent the next nine months trying in vain to make the marriage work. When we finally decided it was impossible, we agreed to a divorce. The pain was devastating. The day we got the divorce, I went out and got drunk for the first time in my life.\u003c/p\u003e\n\u003cp\u003eIf things were disastrous at home, they were going very well at the studio. I had finished the script.\u003c/p\u003e\n\u003cp\u003eDavid Selznick called me to his office. \"We sent your script to Cary Grant.\"\u003c/p\u003e\n\u003cp\u003e\"Oh? What - what did he say?\"\u003c/p\u003e\n\u003cp\u003eSelznick paused dramatically. \"He\u0027s crazy about it. He\u0027s going to do it.\"\u003c/p\u003e\n\u003cp\u003eI was thrilled. \"That\u0027s fantastic!\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve also signed Shirley Temple and Myrna Loy.\"\u003c/p\u003e\n\u003cp\u003eIt was a perfect cast.\u003c/p\u003e\n\u003cp\u003e\"Irving Reis is going to be the director, and Cary Grant wants to meet you.\"\u003c/p\u003e\n\u003cp\u003eCary Grant was always everybody\u0027s first choice for a comedy. There was no second choice. If you could not get Cary, you dropped down several levels.\u003c/p\u003e\n\u003cp\u003eI liked Cary immediately. Besides being incredibly handsome, he was intelligent, with a quick, inquiring mind. Unlike some of the stars I worked with later, Cary had absolutely no sense of vanity about himself.\u003c/p\u003e\n\u003cp\u003eCary was born Archibald Alexander Leach into a lower-middle-class family, in Bristol, England. He had started in the circus as a stilt walker in Coney Island and broke into vaudeville as a bit player.\u003c/p\u003e\n\u003cp\u003eWhen Archie Leach was nine, his mother was sent to a mental institution. They told Cary that his mother had gone to a seaside resort. He did not see her again until he was in his late twenties.\u003c/p\u003e\n\u003cp\u003eCary Grant was a legend - suave and sophisticated and smooth.\u003c/p\u003e\n\u003cp\u003e\"Everyone wants to be Cary Grant,\" he once said. \"Even I want to be Cary Grant.\"\u003c/p\u003e\n\u003cp\u003eWhen I met Shirley Temple, she was an eighteen-year-old grown-up, and she was a delight. As a child, she had been the biggest star in the motion picture world, her pictures grossing hundreds of millions of dollars. In spite of her fame, she had turned into a normal, attractive young woman.\u003c/p\u003e\n\u003cp\u003eThe cast was rounded out by Myrna Loy, a skilled actress. Myrna had starred in The Thin Man series, The Best Years of Our Lives, Arrowsmith, and dozens of other movies.\u003c/p\u003e\n\u003cp\u003eI was thrilled with the cast. We were almost ready to make the movie.\u003c/p\u003e\n\u003cp\u003eCary and I were having lunch in the studio commissary a week before Suddenly It\u0027s Spring was to start. He said, \"We\u0027re having a problem finding a second male lead. We\u0027ve tested half a dozen people and no one is right. You know who would be perfect for the role?\"\u003c/p\u003e\n\u003cp\u003eI was curious. \"Who?\"\u003c/p\u003e\n\u003cp\u003e\"You. Would you be interested in testing with me?\"\u003c/p\u003e\n\u003cp\u003eI looked at him in surprise. Did I want to be an actor? I had never thought about it. But why not? I could be a writer/movie star. Noel Coward and a few others had done it.\u003c/p\u003e\n\u003cp\u003e\"Are you interested, Sidney?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" I knew how simple acting was. I had written the original story, the screenplay, and the test scene, so I knew every word. All I had to do was say the lines. Anyone could do that.\u003c/p\u003e\n\u003cp\u003eCary got up and telephoned Dore Schary, and when Cary and I finished lunch, we walked back to the set. The test scene was with just Cary and me. It was a simple scene, with only a dozen or so lines.\u003c/p\u003e\n\u003cp\u003eAs I looked at Cary, I wondered what stardom was going to be like for me, because I knew that co-starring in a movie with Cary Grant was going to change my life. I would be getting offers and proposals to star in other movies. I would be internationally famous. From now on, I would have no privacy and no leisure. My life would belong to the public. But I was prepared to make the sacrifice.\u003c/p\u003e\n\u003cp\u003eWe had reached the soundstage. Irving Reis said, \"Quiet on the set, everybody.\"\u003c/p\u003e\n\u003cp\u003eEveryone was suddenly still, watching us.\u003c/p\u003e\n\u003cp\u003eIrving Reis said, \"Camera.\" He turned to us. \"Action.\"\u003c/p\u003e\n\u003cp\u003eCary gave me my cue. I stared at him for a long, long moment while he waited for me to speak. I looked up at what seemed to be millions of people staring down from the catwalk, and suddenly I was back at school, with my play, standing on the stage, laughing hysterically. I panicked and, without a word, I turned and fled from the soundstage.\u003c/p\u003e\n\u003cp\u003eThat was the end of my acting career. Now that the burden of stardom was no longer weighing me down, I could go back to work on my screenplay.\u003c/p\u003e\n\u003cp\u003eDore hired Rudy Vallee to replace me and Suddenly It\u0027s Spring began shooting. Everyone seemed pleased with the way it was going.\u003c/p\u003e\n\u003cp\u003eOne day David Selznick called me into his office. \"I want you to do something for me.\"\u003c/p\u003e\n\u003cp\u003e\"Certainly, David.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s National Brotherhood Week. Every year a different studio makes a short film about bringing all religions together.\"\u003c/p\u003e\n\u003cp\u003eI knew about it. When the short film was over, the lights would come on in the theaters and ushers would walk up and down the aisles, collecting money for the charity.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re doing it this year. I want you to write it.\"\u003c/p\u003e\n\u003cp\u003e\"No problem.\"\u003c/p\u003e\n\u003cp\u003e\"We have half a dozen stars lined up. You\u0027ll write about two minutes for each one.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll get to work on it.\"\u003c/p\u003e\n\u003cp\u003eThe next day I brought in a two-page script I had written for Van Johnson, who was to be photographed first. Selznick read it. \"Good. Take it to Van. He\u0027s in a bungalow on the back lot.\"\u003c/p\u003e\n\u003cp\u003eI carried the two pages over to Van Johnson\u0027s bungalow. When he saw me, he opened the door, and I introduced myself. At that time Van Johnson was one of the biggest stars at MGM.\u003c/p\u003e\n\u003cp\u003e\"Here are your pages,\" I said. \"We\u0027re ready to shoot as soon as you are.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\" He added, ruefully, \"I had a terrible dream last night.\"\u003c/p\u003e\n\u003cp\u003e\"What was that?\"\u003c/p\u003e\n\u003cp\u003e\"I dreamt that this big star coming over from Metro-Goldwyn-Mayer learned his lines, and then they kept changing them, and he panicked. The dream woke me up.\"\u003c/p\u003e\n\u003cp\u003eI laughed. \"Don\u0027t worry. These are your lines.\"\u003c/p\u003e\n\u003cp\u003eHe smiled and glanced down at the pages. \"I\u0027ll be ready in a few minutes.\"\u003c/p\u003e\n\u003cp\u003eI went back to Selznick\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all set,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I have an idea,\" Selznick replied. \"I want you to change Van\u0027s lines.\"\u003c/p\u003e\n\u003cp\u003e\"David, I just left him. He was nervous. He had a nightmare about his lines being changed.\"\u003c/p\u003e\n\u003cp\u003e\"To hell with him. Here\u0027s what I want.\" And he gave me a new direction for the scene. I hurried back to my office, rewrote it, and showed it to Selznick.\u003c/p\u003e\n\u003cp\u003e\"Good,\" he said. \"That\u0027s it.\"\u003c/p\u003e\n\u003cp\u003eI hurried back to Van Johnson\u0027s bungalow. He opened the door.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m ready.\"\u003c/p\u003e\n\u003cp\u003e\"Van, there\u0027s been a slight change. Mr. Selznick thought this would be better.\" I handed him the new pages. He turned pale.\u003c/p\u003e\n\u003cp\u003e\"Sidney, I wasn\u0027t joking about my dream. I really - \"\u003c/p\u003e\n\u003cp\u003e\"Van, it\u0027s only two pages. It\u0027s a cinch.\"\u003c/p\u003e\n\u003cp\u003eHe took a deep breath. \"All right.\"\u003c/p\u003e\n\u003cp\u003eI went back to David Selznick\u0027s office.\u003c/p\u003e\n\u003cp\u003e\"I have another idea,\" he said. \"It would be better if we took this angle with Van . . .\"\u003c/p\u003e\n\u003cp\u003eI was horrified. \"David, he\u0027s already panicky. We can\u0027t keep changing his lines.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s an actor, isn\u0027t he? Let him learn them.\"\u003c/p\u003e\n\u003cp\u003eHe told me what he wanted. Reluctantly, I went back to my office and rewrote the scene.\u003c/p\u003e\n\u003cp\u003eThe hardest part was facing Van Johnson again.\u003c/p\u003e\n\u003cp\u003eI walked up to his bungalow. He started to say something, then looked at my face. \"You didn\u0027t . . .\"\u003c/p\u003e\n\u003cp\u003e\"Van, it\u0027s only two pages. This is the last time.\"\u003c/p\u003e\n\u003cp\u003e\"God damn it. What are you doing to me?\"\u003c/p\u003e\n\u003cp\u003eI finally got him calmed down. \"Come over to the set when you\u0027re ready,\" I told him.\u003c/p\u003e\n\u003cp\u003eI did not go back to David Selznick\u0027s office. The rest of Van\u0027s segment went smoothly.\u003c/p\u003e\n\u003cp\u003eRichard telephoned the next day.\u003c/p\u003e\n\u003cp\u003e\"Bro?\"\u003c/p\u003e\n\u003cp\u003eIt was great to hear his voice. \"How are you doing, Richard?\"\u003c/p\u003e\n\u003cp\u003e\"Whatever I\u0027ve been doing, I have to do for two now. I\u0027m getting married.\"\u003c/p\u003e\n\u003cp\u003eI was thrilled. \"That\u0027s great news! Do I know her?\"\u003c/p\u003e\n\u003cp\u003e\"Yes. Joan Stearns.\" Joan and Richard had gone to school together in Chicago.\u003c/p\u003e\n\u003cp\u003e\"When is the wedding?\"\u003c/p\u003e\n\u003cp\u003e\"In three weeks.\"\u003c/p\u003e\n\u003cp\u003e\"Damn! I have to be out of the country, shooting a segment for this project I\u0027m doing for National Brotherhood Week.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll meet her when you come back. We\u0027ll come for a visit.\"\u003c/p\u003e\n\u003cp\u003eAs promised, Richard and his lovely, upbeat wife arrived in Los Angeles a month later. It was obvious that they were very much in love. We spent a delightful week together, until it was time for them to return to Chicago.\u003c/p\u003e\n\u003cp\u003eThe next morning, when I arrived at my office, my secretary said, \"Mr. Selznick would like to see you.\"\u003c/p\u003e\n\u003cp\u003eHe was waiting for me. \"Sidney, I have some news for you.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m changing the name of the picture. We\u0027re not going to call it Suddenly It\u0027s Spring.\"\u003c/p\u003e\n\u003cp\u003eI was listening. \"What are you going to call it?\"\u003c/p\u003e\n\u003cp\u003e\"The Bachelor and the Bobby-Soxer.\"\u003c/p\u003e\n\u003cp\u003eI looked at him a moment, thinking he was joking. He was serious.\u003c/p\u003e\n\u003cp\u003e\"David, no one is going to pay money to see a picture called The Bachelor and the Bobby-Soxer.\"\u003c/p\u003e\n\u003cp\u003eFortunately, it turned out that I was wrong. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-other-side-of-me/page-16.html","bookId":2371,"creation":"Oct 5, 2019 10:14:27 AM","modification":"Oct 5, 2019 10:14:27 AM"}
