{"id":69792,"no":29,"title":"Page 29","content":"\u003cp\u003eSammy Cahn, a famous lyricist, was once asked, \"Which comes first, the music or the lyrics?\"\u003c/p\u003e\n\u003cp\u003eHis response was, \"Neither. First comes the telephone call.\"\u003c/p\u003e\n\u003cp\u003eThe telephone call came from Joe Pasternak.\u003c/p\u003e\n\u003cp\u003e\"Sidney, MGM just bought Jumbo for me. We want you to write the screenplay. Are you available?\"\u003c/p\u003e\n\u003cp\u003eI was available.\u003c/p\u003e\n\u003cp\u003eBilly Rose\u0027s Jumbo had opened on Broadway in 1935. Billy Rose, one of the top producers on Broadway, was not a man to do things in a small way. He had taken over the huge Hippodrome Theatre at Forty-third Street and had rebuilt it like a circus tent, with the audience looking down at the \"ring.\" Jimmy Durante and Paul Whiteman were in the show, Ben Hecht and Charley MacArthur had written the book, Rodgers and Hart had done the score, and George Abbott had directed. The creme de la creme all the way.\u003c/p\u003e\n\u003cp\u003eWhen the show opened, the reviews were excellent, but there was a catch. The production was so expensive that it was impossible for it to break even, let alone make a profit. It closed after five months.\u003c/p\u003e\n\u003cp\u003eIt had been almost ten years since I was last on the MGM lot. Outwardly, it seemed to me that everything was pretty much the same. I was soon to learn how wrong I was.\u003c/p\u003e\n\u003cp\u003eJoe Pasternak had not changed at all. He still had the same wonderful exuberance.\u003c/p\u003e\n\u003cp\u003e\"I have already signed Doris Day, Martha Raye, and Jimmy Durante. In order to get Doris, I had to make her husband, Marty Melcher, co-producer. Your old friend Chuck Walters is directing.\"\u003c/p\u003e\n\u003cp\u003eThat was good news. I had not seen Chuck since we had worked together on Easter Parade.\u003c/p\u003e\n\u003cp\u003e\"Who is going to play the male lead?\"\u003c/p\u003e\n\u003cp\u003ePasternak hesitated. \"We don\u0027t have anyone yet, but there is an actor playing in Camelot on Broadway who might be right for it.\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s his name?\"\u003c/p\u003e\n\u003cp\u003e\"Richard Burton. I want you to fly back to New York with Walters and take a look at him.\"\u003c/p\u003e\n\u003cp\u003e\"Gladly.\"\u003c/p\u003e\n\u003cp\u003eIt was when I went into the commissary to lunch that day that I received my shock. The same hostess, Pauline, was still working there. We greeted each other, and as she started to seat me at a table, I asked, \"Where\u0027s the writers\u0027 table?\"\u003c/p\u003e\n\u003cp\u003e\"There is no writers\u0027 table.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" I said, \"then we\u0027ll have to start one.\"\u003c/p\u003e\n\u003cp\u003eShe looked at me a moment. \"Mr. Sheldon, I\u0027m afraid you\u0027d be very lonely. You\u0027re the only writer on the lot.\"\u003c/p\u003e\n\u003cp\u003eFrom a hundred fifty writers to, \"You\u0027re the only writer on the lot.\" That\u0027s how much Hollywood had changed in the last ten years.\u003c/p\u003e\n\u003cp\u003eI spent the next few days working on an outline to adapt the story of Jumbo for the screen. On Friday, Charles Walters and I flew back to New York, to see Richard Burton in Camelot.\u003c/p\u003e\n\u003cp\u003eCamelot was a huge production also starring Julie Andrews and Robert Goulet. Moss Hart had directed it. Burton was brilliant in it.\u003c/p\u003e\n\u003cp\u003eThe studio had arranged for Charles Walters and me to have supper with Burton after the show. We were waiting for him when he arrived at Sardi\u0027s. Richard Burton was larger than life - open and gregarious, filled with a hearty Welsh charm. He was well-read, intelligent, and had an eclectic mind. Burton was not a major star, but he was about to become one.\u003c/p\u003e\n\u003cp\u003eSince I had not had time to write down my story outline, I said, \"I have nothing on paper yet, but I would like to tell you the story.\"\u003c/p\u003e\n\u003cp\u003eHe smiled. \"I love stories. Go ahead.\"\u003c/p\u003e\n\u003cp\u003eJumbo was a romantic love story set against the background of a rivalry between two circuses. When I had finished telling Richard Burton the story, he was enthusiastic.\u003c/p\u003e\n\u003cp\u003e\"I love it,\" he said, \"and I\u0027m looking forward to working with Doris Day. Call my agent and tell him to make the deal.\"\u003c/p\u003e\n\u003cp\u003eChuck and I looked at each other. We had gotten our man. Everything was set.\u003c/p\u003e\n\u003cp\u003eThe following morning, we returned to Hollywood. Joe Pasternak told Benny Thau to close the deal for Burton. Thau called Hugh French, Burton\u0027s Hollywood agent, and set up a meeting.\u003c/p\u003e\n\u003cp\u003eWhen they had exchanged greetings, Hugh French said, \"Richard called me. He likes the project a lot. He\u0027s eager to do it.\"\u003c/p\u003e\n\u003cp\u003e\"Good. We\u0027ll draw up the contracts.\"\u003c/p\u003e\n\u003cp\u003e\"For how much?\" Hugh French asked.\u003c/p\u003e\n\u003cp\u003e\"Two hundred thousand dollars. That was the deal on his last picture.\"\u003c/p\u003e\n\u003cp\u003eThe agent said, \"We want two-fifty, Benny.\"\u003c/p\u003e\n\u003cp\u003eThau, who was a tough negotiator, was indignant. \"Why should we give him a raise? He\u0027s not that important. This part is a break for him.\"\u003c/p\u003e\n\u003cp\u003e\"Benny, I have to tell you - he has an offer to do another movie. They\u0027re willing to pay him the two-fifty.\"\u003c/p\u003e\n\u003cp\u003eThau said, stubbornly, \"Fine. Let them pay him. We\u0027ll get someone else.\"\u003c/p\u003e\n\u003cp\u003eAnd so it was that instead of starring in Jumbo, Richard Burton signed to do Cleopatra, met and fell in love with Elizabeth Taylor, and together they created an exciting new Chapter in Hollywood romantic gossip. My theory is that if Thau had paid the extra fifty thousand dollars, Richard Burton would have done Jumbo and married Martha Raye.\u003c/p\u003e\n\u003cp\u003eWe signed Stephen Boyd for the male lead and the picture was ready to roll. The cast was brilliant. Doris Day was perfect for the part of Kitty Wonder. Stephen Boyd was excellent and Martha Raye was a delight. But my favorite was Jimmy Durante.\u003c/p\u003e\n\u003cp\u003eDurante had started as a piano player. He had opened a nightclub and formed an act with two other performers, Jackson and Clayton. An insight into Durante was that when he decided to go solo, he kept his former partners on his payroll. He loved to tell stories about the past and I never heard him say an unkind word about anyone.\u003c/p\u003e\n\u003cp\u003eMy screenplay was approved, and production began. Everything went smoothly during the shooting. When the picture was released, Jumbo was nominated for the Writers Guild Award as the best-written American Musical of the Year.\u003c/p\u003e\n\u003cp\u003eMy agent, Sam Weisbord, called me.\u003c/p\u003e\n\u003cp\u003e\"Sidney, we just sold Patty Duke to ABC.\"\u003c/p\u003e\n\u003cp\u003eI certainly knew that name. At the age of twelve, Patty Duke had gotten the role of Helen Keller in The Miracle Worker, had taken Broadway by storm, and when the movie was made, had received an Oscar.\u003c/p\u003e\n\u003cp\u003eSam continued. \"We already have a time slot. Wednesday nights at eight. We\u0027re calling the program The Patty Duke Show. Everything is all set. But we have a problem.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t understand. If everything is all set, what\u0027s your problem?\"\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t have a show.\"\u003c/p\u003e\n\u003cp\u003eThey had sold it on Patty Duke\u0027s name alone.\u003c/p\u003e\n\u003cp\u003e\"We want you to create a show.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, Sammy,\" I said, \"the answer is no.\"\u003c/p\u003e\n\u003cp\u003eIn the early sixties, people who worked in motion pictures looked down on those who labored in television. When television was in its infancy, the networks had gone to the studios. \"We have a great new form of distribution,\" they said, \"but we don\u0027t know how to create entertainment. Why don\u0027t we become partners?\"\u003c/p\u003e\n\u003cp\u003eThe answer was simple. The studios had their own means of distribution. They were called theaters, and most of the studios owned their own chains. They were not about to get involved with an upstart technology that they considered a passing fad. The studios were so anti-television that they would not even permit their stars to be televised going to a movie premiere.\u003c/p\u003e\n\u003cp\u003eI had been conditioned by that attitude, and I remembered my experience with Desi, so it was natural for me to say, \"Sorry, Sammy. I don\u0027t do television.\"\u003c/p\u003e\n\u003cp\u003eThere was a pause. \"All right. I understand. But as a courtesy, would you have lunch with Patty?\"\u003c/p\u003e\n\u003cp\u003eI saw no harm in that. As a matter of fact, I was curious to meet her.\u003c/p\u003e\n\u003cp\u003eWe arranged to have lunch at the Brown Derby. Patty was accompanied by four agents from the William Morris office. She was then sixteen years old, smaller than I had expected, and very vulnerable. She sat next to me in our booth.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m very happy to meet you, Mr. Sheldon.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m happy to meet you, Miss Duke.\"\u003c/p\u003e\n\u003cp\u003eWe talked during lunch and her shyness seemed to disappear, but her vulnerability remained. She held my hand during lunch, and it became obvious to me that she was hungry for love.\u003c/p\u003e\n\u003cp\u003ePatty had had a terrible background. It was like something out of a Charles Dickens novel. Her mother was psychotic. Her father was a drunk who abandoned the family. At age seven, Patty had moved in with her manager, John Ross, and his wife, Ethel, who were living in an upstairs cold-water flat. Patty had never had a family.\u003c/p\u003e\n\u003cp\u003eBefore The Patty Duke Show, John Ross was a struggling, small-time manager. His clientele had consisted of minor character actors. Among them was a young actor named Ray Duke.\u003c/p\u003e\n\u003cp\u003eOne day, Duke came to Ross and asked him if he would represent his young sister, Anna, who had done no acting up to that time. Ross met the seven-year-old girl and agreed to handle her.\u003c/p\u003e\n\u003cp\u003eA few months later, when Anna\u0027s home life became unbearable, the Rosses agreed to let her move in with them, and promptly changed her name to Patty. The order had come from Ethel Ross, who declared, \"Anna Marie is dead. You are Patty now.\"\u003c/p\u003e\n\u003cp\u003eJohn Ross read that a play called The Miracle Worker was going to be produced on Broadway, and he decided that Patty Duke would be right for the part of Helen Keller, a blind, deaf, and mute girl. He coached Patty for months. When she finally competed against a hundred other girls and won the part, their lives changed completely. The day after the play opened, John Ross\u0027s unknown young client had become an overnight star.\u003c/p\u003e\n\u003cp\u003eRoss began receiving offers for Patty for thousands of dollars a week. Instead of knocking on producers\u0027 doors and begging them to hire his clients, Ross was being wooed by producers, directors, and studio executives. He could not believe his good luck.\u003c/p\u003e\n\u003cp\u003eWhen lunch was over, I realized how taken I was by Patty. I found her irresistible.\u003c/p\u003e\n\u003cp\u003e\"How would you like to come to my house tonight and have dinner with Jorja and me,\" I asked her.\u003c/p\u003e\n\u003cp\u003eShe beamed. \"I\u0027d love to.\"\u003c/p\u003e\n\u003cp\u003eJorja was just as enchanted with Patty as I was. She was bright and vivacious and kept us laughing throughout the evening.\u003c/p\u003e\n\u003cp\u003eAs Jorja and I were talking, we suddenly realized that Patty had left the table. I got up to see where she was. She was in the kitchen, doing the dishes. That clinched it for me.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to write a show for you, Patty.\"\u003c/p\u003e\n\u003cp\u003eI got a big hug and a whispered \"Thank you.\"\u003c/p\u003e\n\u003cp\u003eI decided that if I was going to have my name on a television show, I wanted to be able to control the quality of it. I held my first meeting with the producers.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re delighted that you\u0027re going to do the show, Sidney.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"In addition to being the creator, you\u0027ll be the story editor, and supervise the other writers.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want any other writers.\"\u003c/p\u003e\n\u003cp\u003eThey stared at me. \"What?\"\u003c/p\u003e\n\u003cp\u003e\"If I am going to do this show, I want to write it.\"\u003c/p\u003e\n\u003cp\u003e\"Sidney, that\u0027s impossible. We have an order for thirty-nine shows, one show every week.\"\u003c/p\u003e\n\u003cp\u003e\"I intend to write them all.\"\u003c/p\u003e\n\u003cp\u003eThey looked at each other, horrified. It was only later that I learned why. No one in the history of television had ever written every script for a weekly half-hour comedy show.\u003c/p\u003e\n\u003cp\u003e\"Is this negotiable?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said.\u003c/p\u003e\n\u003cp\u003e\"You have a deal.\"\u003c/p\u003e\n\u003cp\u003eNot until months later did I learn that the day I signed the contract, they had hired four other writers to write scripts, so that when I came to them and said, \"I don\u0027t have a show for next week,\" they could hand me the scripts and say, \"Here you are.\"\u003c/p\u003e\n\u003cp\u003eBecause Patty was underage and California child labor laws were so strict, we decided to shoot the show in New York, where juveniles could work as many hours as their producer wanted them to.\u003c/p\u003e\n\u003cp\u003eJorja, Mary, and I moved back to New York.\u003c/p\u003e\n\u003cp\u003eCreating a television show for Patty Duke was a challenge, because she was so extraordinarily talented that I did not want to waste her abilities. I hit on the solution of having her play two parts - twin sisters: one a bouncy, outgoing, New York girl; and the other her demure sister from Scotland, who had been separated from her at birth.\u003c/p\u003e\n\u003cp\u003eBill Asher was signed on to produce and direct, and he suggested that we make them cousins instead of sisters, to explain them having grown up at a distance from each other. That worked just as well for me.\u003c/p\u003e\n\u003cp\u003eThe Patty Duke Show was produced at an old television studio on Twenty-sixth Street, twelve blocks from the theater where I had worked as an usher and a barker. It was not the best of neighborhoods. One day, a secretary was hired to begin work at nine o\u0027clock. At ten o\u0027clock, a large rat ran over her shoe. At twelve o\u0027clock, she was accosted as she went to lunch, and at one o\u0027clock, she quit.\u003c/p\u003e\n\u003cp\u003eI had already written half a dozen teleplays in advance. Now it was time to start casting. We got lucky.\u003c/p\u003e\n\u003cp\u003eThe studio signed William Schallert to play Patty\u0027s father, Jean Byron to play her mother, Paul O\u0027Keefe for the part of Patty\u0027s brother, and Eddie Applegate to play Patty\u0027s suitor.\u003c/p\u003e\n\u003cp\u003eThe first day of production, Patty started a ritual that went on until the end of the show. Every morning, before shooting began, the entire cast and crew lined up and sang \"Good morning to you. Good morning to you. We\u0027re all in our places with bright shiny faces.\"\u003c/p\u003e\n\u003cp\u003eIt was an interesting sight to see the hard-bitten crew, some unshaven, most in T-shirts, line up to earnestly sing this children\u0027s song. Outwardly, Patty was one of the happiest stars in television. It was not until three years later that I learned the truth.\u003c/p\u003e\n\u003cp\u003eThere was an inherent danger in having an actor play two roles. If the audience could not distinguish which character was performing, the confusion could be fatal. In order to avoid this, we dressed Patty in casual attire and made Cathy\u0027s clothes much more formal. To further insure that there would be no confusion, I gave Patty dialogue and actions suitable for a young, energetic extrovert, while I made Cathy reserved and proper.\u003c/p\u003e\n\u003cp\u003eWhen I saw the first day\u0027s rushes, I knew that all our precautions had been unnecessary. Patty did not depend on the clothes or the dialogue. She became each character.\u003c/p\u003e\n\u003cp\u003eI was having a problem with the network. They had assigned an officious young man whom I\u0027ll call Todd as the liaison for ABC. Every Monday morning he came into my office and his greeting was always the same. \"I read your latest script. It stinks. You\u0027re giving the network a disaster.\"\u003c/p\u003e\n\u003cp\u003eThe last straw came when we were on the scoring stage, recording the music for the first show.\u003c/p\u003e\n\u003cp\u003eThe studio had hired the talented Academy Award-winning arranger and composer Sid Ramin. When the first music take was over, Sid and I were talking at one end of the stage. I looked over and saw Todd hurrying toward us. He stopped in front of Sid and said loudly, \"Your music is the only good thing in this show.\"\u003c/p\u003e\n\u003cp\u003eThat afternoon I put in a call to an executive at the network.\u003c/p\u003e\n\u003cp\u003eBy the following morning, Todd had disappeared from my life. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-other-side-of-me/page-29.html","bookId":2371,"creation":"Oct 5, 2019 10:14:27 AM","modification":"Oct 5, 2019 10:14:27 AM"}
