{"id":73562,"no":33,"title":"Page 33","content":"\u003cp\u003eGone to Ground\u003c/p\u003e\n\u003cp\u003eYou can talk,\" said Jennet, rubbing the bump on her head.\u003c/p\u003e\n\u003cp\u003e\"Of course I can talk,\" said Boy 412.\u003c/p\u003e\n\u003cp\u003e\"But why haven\u0027t you, then? You haven\u0027t ever said anything. Except for your name. I mean, number.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s all we were meant to say if we were captured. Rank and number. Nothing else. So that\u0027s what I did.\"\u003c/p\u003e\n\u003cp\u003e\"You weren\u0027t captured. You were saved!\" Jenna pointed out.\u003c/p\u003e\n\u003cp\u003e\"I know,\" said Boy 412. \"Well, I know that now. I didn\u0027t then.\"\u003c/p\u003e\n\u003cp\u003eJenna found it very strange to be actually having a conversation with Boy 412 after all this time. And even stranger to be having it at the bottom of a pit in complete darkness. \"I wish we had a light,\" said Jenna. \"I keep thinking the Hunter\u0027s going to creep up on us.\" She shivered.\u003c/p\u003e\n\u003cp\u003eBoy 412 reached up inside his hat, drew out his ring and slipped it onto his right index finger. It fitted perfectly. He cupped his other hand around the dragon ring, warming it and willing it to give out its golden glow. The ring responded, and a soft glow spread out from Boy 412\u0027s hands until he could clearly see Jenna looking at him through the darkness. Boy 412 felt very happy. The ring was brighter than ever, and soon it cast a warm circle of light around them as they sat on the sandy floor of the tunnel.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s amazing,\" said Jenna. \"Where did you find it?\"\u003c/p\u003e\n\u003cp\u003e\"Down here,\" said Boy 412.\u003c/p\u003e\n\u003cp\u003e\"What, you just found it? Just now?\"\u003c/p\u003e\n\u003cp\u003e\"No. I found it before.\"\u003c/p\u003e\n\u003cp\u003e\"Before what?\"\u003c/p\u003e\n\u003cp\u003e\"Before - remember when we got lost in the haar?\"\u003c/p\u003e\n\u003cp\u003eJenna nodded.\u003c/p\u003e\n\u003cp\u003e\"Well, I fell down here then. And I thought I was going to be stuck here forever. Until I found the ring. It\u0027s Magyk. It lit up and showed me the way out.\"\u003c/p\u003e\n\u003cp\u003eSo that was what happened, thought Jenna. It made sense now. Boy 412 sitting smugly waiting for them when she and Nicko finally found their way back, frozen and soaked after hours of wandering around looking for him. She had just known he had some kind of secret. And then all that time he had been walking around with the ring and never showing anyone. There was more to Boy 412 than met the eye.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a beautiful ring,\" she said, gazing at the gold dragon curled around Boy 412\u0027s finger. \"Can I hold it?\"\u003c/p\u003e\n\u003cp\u003eA little reluctantly, Boy 412 took off the ring and gave it to Jenna. She cradled it carefully in her hands, but the light began to fade and the darkness drew in around them. Soon the light from the ring had completely died.\u003c/p\u003e\n\u003cp\u003e\"Have you dropped it?\" Boy 412 asked accusingly.\u003c/p\u003e\n\u003cp\u003e\"No,\" said Jenna, \"it\u0027s still here in my hand. But it doesn\u0027t work for me.\"\u003c/p\u003e\n\u003cp\u003e\"Of course it works. It\u0027s a Magyk ring,\" said Boy 412. \"Here, give it back. I\u0027ll show you.\" He took the ring and immediately the tunnel was filled with light. \"See, it\u0027s easy.\"\u003c/p\u003e\n\u003cp\u003e\"Easy for you,\" said Jenna, \"but not for me.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see why,\" said Boy 412, puzzled.\u003c/p\u003e\n\u003cp\u003eBut Jenna had seen why. She had seen it over and over again, growing up in a household of Wizards. And although Jenna knew only too well that she was not Magykal, she could tell who was. \"It\u0027s not the ring that\u0027s Magyk. It\u0027s you,\" she told Boy 412.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not Magyk,\" said Boy 412. He sounded so definite that Jenna didn\u0027t argue.\u003c/p\u003e\n\u003cp\u003e\"Well, whatever you are, you\u0027d better keep hold of the ring,\" she said. \"So how do we get out?\"\u003c/p\u003e\n\u003cp\u003eBoy 412 put the dragon ring on and set off along the tunnel, leading Jenna confidently through the twists and turns that had so confused him before, until at last they arrived at the top of the steps. \"Careful,\" he said. \"I fell down these last time and nearly lost the ring.\"\u003c/p\u003e\n\u003cp\u003eAt the bottom of the steps Jenna stopped. Something had made the hair on the back of her neck stand up. \"I\u0027ve been here before,\" she whispered.\u003c/p\u003e\n\u003cp\u003e\"When?\" asked Boy 412, a bit put out. It was his place.\u003c/p\u003e\n\u003cp\u003e\"In my dreams,\" muttered Jenna. \"I know this place. I used to dream about it in the summer when I was at home. But it was bigger than this...\"\u003c/p\u003e\n\u003cp\u003e\"Come on,\" said Boy 412 briskly.\u003c/p\u003e\n\u003cp\u003e\"I wonder if it is bigger, if there\u0027s an echo.\" Jenna raised her voice as she spoke.\u003c/p\u003e\n\u003cp\u003ethere\u0027s an echo there\u0027s an echo there\u0027s an echo there\u0027s an echo there\u0027s an echo there\u0027s an echo ... sounded all around them.\u003c/p\u003e\n\u003cp\u003e\"Shhh,\" whispered Boy 412. \"He might hear us. Through the ground. They train them to hear like dogs.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"Hunters.\"\u003c/p\u003e\n\u003cp\u003eJenna fell silent. She had forgotten about the Hunter, and now she didn\u0027t want to be reminded.\u003c/p\u003e\n\u003cp\u003e\"There\u0027re pictures all over the walls,\" Jenna whispered to Boy 412, \"and I know I\u0027ve dreamed about them. They look really old. It\u0027s like they\u0027re telling a story.\"\u003c/p\u003e\n\u003cp\u003eBoy 412 hadn\u0027t taken much notice of the pictures before, but now he held his ring up to the smooth marble walls that formed this part of the tunnel. He could see simple, almost primitive shapes in deep blues, reds and yellows showing what seemed to be dragons, a boat being built, then a lighthouse and a shipwreck.\u003c/p\u003e\n\u003cp\u003eJenna pointed to more shapes farther along the wall. \"And these look like plans for a tower or something.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the WizardTower,\" said Boy 412. \"Look at the Pyramid on the top.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know the WizardTower was so old,\" said Jenna, running her finger over the paint and thinking that maybe she was the first person to see the pictures for thousands of years.\u003c/p\u003e\n\u003cp\u003e\"The WizardTower is very old,\" said Boy 412. \"No one knows when it was built.\"\u003c/p\u003e\n\u003cp\u003e\"How do you know?\" asked Jenna, surprised that Boy 412 was so definite.\u003c/p\u003e\n\u003cp\u003eBoy 412 took a deep breath and said in a singsong voice, \"The WizardTower is an AncientMonument. Precious resources are squandered by the ExtraOrdinary Wizard to keep the Tower in its garish state of opulence, resources that could be used for healing the sick or making the Castle a more secure place for all to live. See, I can still remember it. We used to have to recite stuff like that every week in our Know Your Enemy lesson.\"\u003c/p\u003e\n\u003cp\u003e\"Yuck,\" sympathized Jenna. \"Hey, I bet Aunt Zelda would be interested in all this down here,\" she whispered as she followed Boy 412 along the tunnel.\u003c/p\u003e\n\u003cp\u003e\"She knows all about it already,\" said Boy 412, remembering Aunt Zelda\u0027s disappearance from the potion cupboard. \"And I think she knows that I know.\"\u003c/p\u003e\n\u003cp\u003e\"Why? Did she say?\" asked Jenna, wondering how she had missed all this.\u003c/p\u003e\n\u003cp\u003e\"No,\" said Boy 412. \"But she gave me a funny look.\"\u003c/p\u003e\n\u003cp\u003e\"She gives everyone funny looks,\" Jenna pointed out. \"It doesn\u0027t mean she thinks they\u0027ve been down some secret tunnel.\"\u003c/p\u003e\n\u003cp\u003eThey walked on a little farther. The line of pictures had just ended and they had reached some steep steps leading upward. Jenna\u0027s attention was caught by a small rock nestled beside the bottom step. She picked it up and showed it to Boy 412. \"Hey, look at this. Isn\u0027t it lovely?\"\u003c/p\u003e\n\u003cp\u003eJenna was holding a large egg-shaped green stone. It was slippery-smooth as though someone had just polished it, and it shone with a dull sheen in the light of the ring. The green had an iridescent quality to it, like a dragonfly\u0027s wing, and it lay heavily but perfectly balanced in her two cupped hands.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s so smooth,\" said Boy 412, stroking it gently.\u003c/p\u003e\n\u003cp\u003e\"Here, you have it,\" said Jenna impulsively. \"It can be your own pet rock. Like Petroc Trelawney, only bigger. We could ask Dad to get a spell for it when we go back to the Castle.\"\u003c/p\u003e\n\u003cp\u003eBoy 412 took the green rock. He wasn\u0027t sure what to say. No one had ever given him a present before. He put the rock into his secret pocket on the inside of his sheepskin jacket. Then he remembered what Aunt Zelda had said to him when he had brought her some herbs from the garden. \"Thank you,\" he said.\u003c/p\u003e\n\u003cp\u003eSomething in the way he spoke reminded Jenna of Nicko.\u003c/p\u003e\n\u003cp\u003eNicko.\u003c/p\u003e\n\u003cp\u003eNicko and the Hunter.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve got to get back,\" said Jenna anxiously.\u003c/p\u003e\n\u003cp\u003eBoy 412 nodded. He knew they had to go and face whatever may be waiting for them outside. He had just been enjoying feeling safe for a while.\u003c/p\u003e\n\u003cp\u003eBut he knew it couldn\u0027t last. \u003c/p\u003e","sourceLink":"https://allnovel.net/magyk-septimus-heap-1/page-33.html","bookId":2704,"creation":"Oct 5, 2019 10:28:06 AM","modification":"Oct 5, 2019 10:28:06 AM"}
