{"id":73575,"no":46,"title":"Page 46","content":"\u003cp\u003eSeptimus Heap\u003c/p\u003e\n\u003cp\u003eUnnoticed on the chimney pot of Keeper\u0027s Cottage, a storm petrel perched. He had been blown in the night before and had been watching the Apprentice Supper with great interest. And now, he noted with a feeling of fondness, Aunt Zelda was about to do what the petrel had always considered she had a particular gift for.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the perfect night for it,\" Aunt Zelda was saying as she stood on the bridge over the Mott. \"There\u0027s a beautiful full moon, and I\u0027ve never known the Mott to be so still. Can everyone fit on the bridge? Shuffle up a bit, Marcia, and make room for Simon.\"\u003c/p\u003e\n\u003cp\u003eSimon didn\u0027t look as if he wanted to be made room for.\u003c/p\u003e\n\u003cp\u003e\"Oh, don\u0027t bother about me,\" he mumbled. \"Why break the habit of a lifetime?\"\u003c/p\u003e\n\u003cp\u003e\"What did you say, Simon?\" asked Silas.\u003c/p\u003e\n\u003cp\u003e\"Nothing.\"\u003c/p\u003e\n\u003cp\u003e\"Let him be, Silas,\" said Sarah. \"He\u0027s had a tough time recently.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve all had a tough time recently, Sarah. But we don\u0027t go around moaning about it.\"\u003c/p\u003e\n\u003cp\u003eAunt Zelda tapped the handrail of the bridge irritably.\u003c/p\u003e\n\u003cp\u003e\"If everybody has quite finished bickering, I would like to remind you that we are about to try to answer an important question. All right, everybody?\"\u003c/p\u003e\n\u003cp\u003eSilence descended on the group. Along with Aunt Zelda, Boy 412, Sarah, Silas, Marcia, Jenna, Nicko and Simon were all squashed onto the small bridge that went over the Mott. Behind them was the Dragon Boat, her head raised high and arched over them, her deep green eyes staring intently at the reflection of the moon swimming in the still waters of the Mott.\u003c/p\u003e\n\u003cp\u003eIn front of them, pushed back a little to allow the reflection of the moon to be seen, was Molly with Alther sitting in the prow, observing the scene with interest.\u003c/p\u003e\n\u003cp\u003eSimon hung back on the edge of the bridge. He didn\u0027t see what the fuss was about. Who cared where some Young Army brat came from? Especially a Young Army brat who had stolen his lifelong dream from him. Boy 412\u0027s parentage was the last thing Simon cared about, or was ever likely to as far as he could imagine. So, as Aunt Zelda started to call upon the moon, Simon deliberately turned his back.\u003c/p\u003e\n\u003cp\u003e\"Sister Moon, Sister Moon,\" said Aunt Zelda softly, \"Show us, if you will, the family of Boy 412 of the Young Army.\"\u003c/p\u003e\n\u003cp\u003eExactly as before in the duck pond, the reflection of the moon began to grow bigger until a huge round white circle filled the Mott. At first, vague shadows began to appear in the circle; slowly they became more defined until everyone watching saw ... their own reflections.\u003c/p\u003e\n\u003cp\u003eThere was a murmur of disappointment from everyone except Marcia, who had noticed something no one else had, and from Boy 412, whose voice seemed to have stopped working. His heart was pounding somewhere high in his throat, and his legs felt as though they might turn into parsnip puree at any moment. He wished he had never asked to see who he was. He didn\u0027t think he really wanted to know. Suppose his family was horrible? Suppose they were the Young Army, like he had been told? Suppose it was DomDaniel himself? Just as he was about to tell Aunt Zelda that he had changed his mind, that he didn\u0027t care who he was anymore, thank you, Aunt Zelda spoke.\u003c/p\u003e\n\u003cp\u003e\"Things,\" Aunt Zelda reminded everyone on the bridge, \"are not always as they seem. Remember, the moon always shows us the truth. How we see the truth is up to us, not the moon.\"\u003c/p\u003e\n\u003cp\u003eShe turned to Boy 412, who stood beside her. \"Tell me,\" she asked him, \"what would you really like to see?\"\u003c/p\u003e\n\u003cp\u003eThe answer Boy 412 gave was not the one he had expected to give. \"I want to see my mother,\" he whispered.\u003c/p\u003e\n\u003cp\u003e\"Sister Moon, Sister Moon,\" said Aunt Zelda softly, \"show us, if you will, the mother of Boy 412 of the Young Army.\"\u003c/p\u003e\n\u003cp\u003eThe white disk of the moon filled the Mott. Once more, vague shadows began to appear until they saw ... their own reflections, again. There was a collective moan of protest, but it was quickly cut short. Something different was happening. One by one, people were disappearing from the reflection.\u003c/p\u003e\n\u003cp\u003eFirst Boy 412 himself disappeared. Then Simon, Jenna, Nicko and Silas went. Then Marcia\u0027s reflection faded, followed by Aunt Zelda\u0027s.\u003c/p\u003e\n\u003cp\u003eSuddenly Sarah Heap found herself looking at her own reflection in the moon, waiting for it to fade like all the others had done. But it did not fade. It grew stronger and more defined, until Sarah Heap was standing alone in the middle of the white disk of the moon. Everyone could see that it was no longer just a reflection. It was the answer.\u003c/p\u003e\n\u003cp\u003eBoy 412 gazed at the picture of Sarah, transfixed. How could Sarah Heap be his mother? How?\u003c/p\u003e\n\u003cp\u003eSarah raised her eyes from the Mott and looked at Boy 412.\u003c/p\u003e\n\u003cp\u003e\"Septimus?\" she half whispered.\u003c/p\u003e\n\u003cp\u003eThere was something Aunt Zelda wanted to show Sarah.\u003c/p\u003e\n\u003cp\u003e\"Sister Moon, Sister Moon,\" said Aunt Zelda, \"show us, if you will, the seventh son of Sarah and Silas Heap. Show us Septimus Heap.\"\u003c/p\u003e\n\u003cp\u003eSlowly the image of Sarah Heap faded away and was replaced by -\u003c/p\u003e\n\u003cp\u003eBoy 412.\u003c/p\u003e\n\u003cp\u003eThere was a gasp, even from Marcia, who had guessed who Boy 412 was a few minutes earlier. Only she had noticed that her image had disappeared from the reflection of Boy 412\u0027s family.\u003c/p\u003e\n\u003cp\u003e\"Septimus?\" Sarah knelt down beside Boy 412 and looked at him searchingly. Boy 412\u0027s eyes stared into hers, and Sarah said, \"You know, I do believe your eyes are beginning to turn green, just like your father\u0027s. And mine. And your brothers\u0027.\"\u003c/p\u003e\n\u003cp\u003e\"Are they?\" asked Boy 412. \"Really?\"\u003c/p\u003e\n\u003cp\u003eSarah reached out and placed her hand on Septimus\u0027s red hat. \"Would you mind if I took this off?\" she asked.\u003c/p\u003e\n\u003cp\u003eBoy 412 shook his head. That\u0027s what mothers were for. To fiddle about with your hat.\u003c/p\u003e\n\u003cp\u003eGently, Sarah lifted off Boy 412\u0027s hat for the first time since Marcia had crammed it onto his head at Sally Mullin\u0027s bunk-house. Straw-colored tufts of curly hair sprang up as Septimus shook his head like a dog shaking off water and a boy shaking off his old life, his old fears and his old name.\u003c/p\u003e\n\u003cp\u003eHe was becoming who he really was.\u003c/p\u003e\n\u003cp\u003eSeptimus Heap. \u003c/p\u003e","sourceLink":"https://allnovel.net/magyk-septimus-heap-1/page-46.html","bookId":2704,"creation":"Oct 5, 2019 10:28:06 AM","modification":"Oct 5, 2019 10:28:06 AM"}
