{"id":86829,"no":67,"title":"Page 67","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThen Peter cupped her breasts, a flick of his tongue over the sensitized nipples. “Your breasts are as beautiful as your sister’s. Pure honey skin.”\u003c/p\u003e\n\u003cp\u003eFinally, Lucas. His hand trailed over her face, a softer, more thoughtful caress, but then that hand dropped, found her dripping cunt, fingered her until she was growling like a needy cat.\u003c/p\u003e\n\u003cp\u003e“I think we’ll be able to talk Cass into that fantasy I have, don’t you? Particularly since it’s your fantasy as well.”\u003c/p\u003e\n\u003cp\u003eThat sent a spasm through her, particularly when his fingers stroked her clit so knowledgeably. “Yes sir.”\u003c/p\u003e\n\u003cp\u003eA touch of amusement entered his voice, tangled with a good degree of lust. When Lucas got home tonight, she was pretty sure Cass was going to get a good workout. “I’m sure I won’t get that kind of deference when she’s off this web, Ben.”\u003c/p\u003e\n\u003cp\u003e“She still has a punishment coming,” Peter offered, creating a spiral of anxiety in her lower belly. “Maybe that will help her remember to be more respectful. For a day or two.”\u003c/p\u003e\n\u003cp\u003e“You know I have a certain code, Marcie,” Ben said, staying frustratingly out of reach. She licked her lips, remembering the taste of his cock. “About letting my submissive top from the bottom. You need to remember your place is firmly on the bottom, always. Five switches from each of them to drive the lesson home.”\u003c/p\u003e\n\u003cp\u003eDespite the threat, Marcie clung to his voice. She was in high gear, stimulated by all of this, but her emotional hunger was nowhere near sated. She needed him. Would eventually beg if she had to do so.\u003c/p\u003e\n\u003cp\u003eShe remembered how much the switching had hurt from Ben, but how it had made her so hot, knowing she’d given him the right to do it. Now he was offering it to the others as a rite of passage, as part of her initiation. A ball gag was pushed into her mouth with cloth wadding to absorb the saliva. Then it was buckled tightly around her head, as her fingers clutched the ropes. She shook her head several times, trying to shake off the fear, the anticipation of the pain. She needed to do this. Punishment was necessary. Her Master said so.\u003c/p\u003e\n\u003cp\u003eShe yelped as the first one hit. She didn’t know who it was until he was done, alternating between the right and left buttock. “Nice striping,” Peter commented. “Hand it over, Jon.”\u003c/p\u003e\n\u003cp\u003eShe was braced for five more strikes, but not for them being around her breasts. She let out a startled cry as the switch stung the top of her breast, brought down upon both of them from above, since Peter was a tall guy. His large hand curved around her nape, holding her there as he administered four more, at different angles, probably making a crisscross shape of red lines on her distended curves.\u003c/p\u003e\n\u003cp\u003eLucas got her inner thighs, not quite hitting her pussy, but close enough she felt the reverberation through it. She was gasping, holding on to those ropes for dear life. Fire was spreading across her flesh, and then Ben gathered her hair, wrapping it into a tight tail, securing it high on her head, baring her neck for the press of his mouth.\u003c/p\u003e\n\u003cp\u003eShe shuddered, moaned like a dove, needy. She wanted the gag gone. But she was at the mercy of her Master. Then he was removing it from her mouth, answering her prayers.\u003c/p\u003e\n\u003cp\u003e“No more topping. No more misbehaving.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I’ve had that conversation with Dana before.” Peter’s snort sent a ripple of humor through the men.\u003c/p\u003e\n\u003cp\u003eDana misbehaved because she needed to feel her Master’s yoke, its reassurance. That was a part of it for Marcie, but it was more than that also. Sometimes her Master needed her to misbehave, to give him the outlet of punishment, to feed his sadistic side. It gave her as much pleasure as it gave him. So in as demure a voice as she could muster, she managed two words. “Yes, Master.”\u003c/p\u003e\n\u003cp\u003eBen’s snort was quite distinguishable from Peter’s. “Just for that…”\u003c/p\u003e\n\u003cp\u003eShe started out with “No, no, no…” because hell, it hurt so bad, having that switch strike her buttocks, her thighs. The pain was intense, excruciating, because it didn’t take much with a switch. He knew her better than they did, knew how much she could take, what she craved. On ten, she gasped with relief, her legs quivering.\u003c/p\u003e\n\u003cp\u003eThings had gotten quiet again. She could hear Ben’s breath, his shoes tapping as he moved, studying her stretched and tormented body from every angle, she was sure. She ached for him. Her pussy hadn’t stopped dripping yet, and her ass, legs and breasts were on fire.\u003c/p\u003e\n\u003cp\u003e“What do you want, Marcie?”\u003c/p\u003e\n\u003cp\u003e“Whatever my Master desires.”\u003c/p\u003e\n\u003cp\u003e“What do you think he desires?”\u003c/p\u003e\n\u003cp\u003eShe couldn’t help it, her lips curved, even as a few tears ran out from under the mask. “To fuck me. Please, Master.”\u003c/p\u003e\n\u003cp\u003eShe listened to the polished dress shoes move behind her. His fingers touched her ass, worked the dildo so that she spasmed in near climax once more, crying out. Then it was pulled free.\u003c/p\u003e\n\u003cp\u003e“Tell me what you want.”\u003c/p\u003e\n\u003cp\u003e“Your cock, Master. In my ass. Please. If that’s what you want.”\u003c/p\u003e\n\u003cp\u003e“In a moment. We have a late arrival. Someone who takes the topping issue almost as seriously as I do.”\u003c/p\u003e\n\u003cp\u003eA late arrival? There was only one… She hadn’t expected him, not with Savannah pregnant, but then she felt his touch. Matt’s firm hand was as unique as the four others. She recalled his fingers tracing the shell of her ear as they now slid along her spine, up to her nape. As he moved around her, he must have gripped the rope, because her body swayed on the web.\u003c/p\u003e\n\u003cp\u003e“I expect Ben will have to stay on his toes, keeping you in line.” A statement of fact, not really a question, but the Master’s tone was so clear, rippling through her every nerve ending, she knew a response was needed.\u003c/p\u003e\n\u003cp\u003e“Yes sir.”\u003c/p\u003e\n\u003cp\u003eA masculine chuckle. “Lucky man. We’re all lucky in that regard.” She drew in a breath as Matt’s hand caressed her throat, then cupped her cheek in a firm hold. “You won’t push it to the lengths you’ve pushed it before this night though. Will you?”\u003c/p\u003e\n\u003cp\u003eShe was incapable of lying, even to save her tender skin. “Unless my Master needs me to push it, sir.”\u003c/p\u003e\n\u003cp\u003eFive more from Ben, and as she shrieked through the impact, she pressed her face hard into Matt’s large hand, bit down to contain it all. The sound of her flesh being whipped just made it even more intense. Matt didn’t move away, letting her lock her jaw on the calloused mound of his palm. With the other hand, he held her head rigidly still, reinforcing the rope bindings on it, his fingers tangled in her hair. When Ben finished, she was gasping for air. A handkerchief touched her face, Matt taking away her tears.\u003c/p\u003e\n\u003cp\u003e“Do you love him, Marcie?”\u003c/p\u003e\n\u003cp\u003e“More than anything,” she sobbed. “Always. He’s my Master.”\u003c/p\u003e\n\u003cp\u003eMatt brushed his lips against her forehead, both cheeks. “Yes, he is. Make him deserve you, sweet girl. And love him like he deserves.”\u003c/p\u003e\n\u003cp\u003eA reminder of their talk, and a blessing from the patriarch at once. She pressed her lips into his palm once more, soothing where she’d bitten with a shy touch of her tongue. Another chuckle, and he gave her hair a reproving tug. “She’s a handful, Ben. She’s all yours.”\u003c/p\u003e\n\u003cp\u003e“Yes, she is.” There was a silence, in which she imagined Ben and Matt exchanging a look that, like everything tonight, made things right. Balanced. Then she heard Matt moving away.\u003c/p\u003e\n\u003cp\u003eNow it was just her and Ben. Alone.\u003c/p\u003e\n\u003cp\u003eChapter Sixteen\u003c/p\u003e\n\u003cp\u003eAt the blissful sound of his slacks being unbelted, opened, she was already pushing out toward him, her sphincter muscles contracting. He let out a soft oath, his fingers dipping in to caress that rim.\u003c/p\u003e\n\u003cp\u003e“You’re flaring, love. A beautiful red rosebud, begging for my cock.”\u003c/p\u003e\n\u003cp\u003e“Yes, Master.”\u003c/p\u003e\n\u003cp\u003eHe was wearing a condom, a surprise, but it made him nice and slick. He stretched her as she made those animal noises, which became a long cry when he slid in fully, pressing his thighs and pelvis firmly against her abused buttocks.\u003c/p\u003e\n\u003cp\u003e“Whose are you, Marcie?”\u003c/p\u003e\n\u003cp\u003e“Yours, Master. All yours.”\u003c/p\u003e\n\u003cp\u003e“And if I want to fuck your ass all night?”\u003c/p\u003e\n\u003cp\u003e“That’s your right. I belong to you.”\u003c/p\u003e\n\u003cp\u003e“Make you suck my cock until your jaw cramps?”\u003c/p\u003e\n\u003cp\u003e“I belong…to you. Anything.”\u003c/p\u003e\n\u003cp\u003e“Then clutch me with those muscles like I taught you.”\u003c/p\u003e\n\u003cp\u003eShe did, until she was struggling against exhaustion. But she reveled in every thrust, his grunts, the ropes rubbing against her flesh, the constriction around her breasts, her waist, her legs, everywhere she was bound. His pelvis pressing against her ass, making the welts from the switch burn, a reminder of his claim on her. The moist heat of his breath against her neck.\u003c/p\u003e\n\u003cp\u003eThe others might still be watching, they might be gone, but for her there was only him right now. And then she was sure they were gone, because he loosened the blindfold, let it drop.\u003c/p\u003e\n\u003cp\u003eIt was his loft apartment. Whereas the dungeon in the Garden District was full of luxurious pieces with satin polished wood and velvet, this one was a sparsely outfitted torture chamber, intended to be intimidating with its hard dark floors, blackened windows, single-bulb lights hanging from the ceiling. It was separated from the rest of the apartment by a thick curtain of overlapping thick plastic strips, like at a construction site.\u003c/p\u003e\n\u003cp\u003e“I’m glad I didn’t move everything to the Garden District. I like the idea of having this equipment close to work. Particularly if I need to take a particular K\u0026amp;A employee home for lunch and discipline her.”\u003c/p\u003e\n\u003cp\u003e“That employee might decide to work for Tennyson Industries. The pay’s better.”\u003c/p\u003e\n\u003cp\u003eHe chuckled, a dangerous, thrilling sound, his breath on her neck. “Savannah can’t match our benefits. I promise you that.”\u003c/p\u003e\n\u003cp\u003eThere was the sound of the condom being removed. When he came to stand before her, he’d left the slacks open, his erect cock pushing up and out of the fabric. He got up close and personal, so she was staring into those vivid eyes and his cock brushed against her belly through the opening of the ropes. He cupped her face, traced her cheekbone, caught strands of her hair. “My sweet slave,” he murmured.\u003c/p\u003e\n\u003cp\u003eStepping back, he unbuttoned his shirt, shrugged it off, dropped the slacks and shoved off his briefs, got rid of all of it. It was the first time he’d given her that pleasure when she was conscious enough to appreciate it. He was beautiful, every bare, perfect inch. She saw some unexpected scars, high on his thigh, at his abdomen, but they fit the tough, muscled body. The light mat of dark hair arrowed down to his groin and sprinkled his thighs and calves. A virile male animal. If this was Beauty and the Beast, she’d want him to stay the growling, dangerous Beast, never become the cultured, much-too-gentle prince. \u003c/p\u003e","sourceLink":"https://allnovel.net/hostile-takeover-knights-of-the-board-room-5/page-67.html","bookId":1904,"creation":"Oct 5, 2019 5:18:30 PM","modification":"Oct 5, 2019 5:18:30 PM"}
