{"id":3196,"no":100,"title":"Chapter 100","content":"Mr. Okamoto, in his letter to me, recalled theinterrogation as having been \"difficult and memorable. \"Heremembered Piscine Molitor Patel as being \"very thin, verytough, very bright.\"His report, in its essential part, ran as follows:\n\u003cbr\u003e Sole survivor could shed no light on reasons for sinkingof Tsimtsum. Ship appears to have sunk very quickly, whichwould indicate a major hull breach. Important quantity ofdebris would support this theory. But precise reason ofbreach impossible to determine. No major weatherdisturbance reported that day in quadrant. Survivor\u0027sassessment of weather impressionistic and unreliable. Atmost, weather a contributing factor. Cause was perhapsinternal to ship. Survivor believes he heard an explosion,hinting at a major engine problem, possibly the explosion ofa boiler, but this is speculation. Ship twenty-nine years old(Erlandson and Shank Shipyards, Malm?, 1948), refitted in1970. Stress of weather combined with structural fatigue apossibility, but conjecture. No other ship mishap reported inarea on that day, so ship-ship collision unlikely. Collisionwith debris a possibility, but unverifiable. Collision with afloating mine might explain explosion, but seems fanciful,besides highly unlikely as sinking started at stern, which inall likelihood would mean that hull breach was at stern too.\n\u003cbr\u003e Survivor cast doubts on fitness of crew but had nothing tosay about officers. Oika Shipping Company claims all cargoabsolutely licit and not aware of any officer or crewproblems.\n\u003cbr\u003e Cause of sinking impossible to determine from availableevidence. Standard insurance claim procedure for Oika. Nofurther action required. Recommend that case be closed.\n\u003cbr\u003e As an aside, story of sole survivor, Mr. Piscine MolitorPatel, Indian citizen, is an astounding story of courage andendurance in the face of extraordinarily difficult and tragiccircumstances. In the experience of this investigator, hisstory is unparalleled in the history of shipwrecks. Very fewcastaways can claim to have survived so long at sea asMr. Patel, and none in the company of an adult Bengaltiger.\n\u003cbr\u003e \n\u003cbr\u003e \n\u003cstrong\u003eThe End\u003c/strong\u003e\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1841/53449.html","bookId":122,"creation":"Aug 1, 2019 4:25:25 AM","modification":"Aug 1, 2019 4:25:25 AM"}
