{"id":3152,"no":56,"title":"Chapter 56","content":"I must say a word about fear. It is life\u0027s only true opponent.\n\u003cbr\u003e Only fear can defeat life. It is a clever, treacherous adversary,how well I know. It has no decency, respects no law orconvention, shows no mercy. It goes for your weakest spot,which it finds with unerring ease. It begins in your mind,always. One moment you are feeling calm, self-possessed,happy. Then fear, disguised in the garb of mild-mannereddoubt, slips into your mind like a spy. Doubt meets disbeliefand disbelief tries to push it out. But disbelief is a poorlyarmed foot soldier. Doubt does away with it with little trouble.\n\u003cbr\u003e You become anxious. Reason comes to do battle for you. Youare reassured. Reason is fully equipped with the latest weaponstechnology. But, to your amazement, despite superior tactics anda number of undeniable victories, reason is laid low. You feelyourself weakening, wavering. Your anxiety becomes dread.\n\u003cbr\u003e Fear next turns fully to your body, which is already awarethat something terribly wrong is going on. Already your lungshave flown away like a bird and your guts have slithered awaylike a snake. Now your tongue drops dead like an opossum,while your jaw begins to gallop on the spot. Your ears go deaf.\n\u003cbr\u003e Your muscles begin to shiver as if they had malaria and yourknees to shake as though they were dancing. Your heartstrains too hard, while your sphincter relaxes too much. And sowith the rest of your body. Every part of you, in the mannermost suited to it, falls apart. Only your eyes work well. Theyalways pay proper attention to fear.\n\u003cbr\u003e Quickly you make rash decisions. You dismiss your last allies:\n\u003cbr\u003e hope and trust. There, you\u0027ve defeated yourself. Fear, which isbut an impression, has triumphed over you.\n\u003cbr\u003e The matter is difficult to put into words. For fear, real fear,such as shakes you to your foundation, such as you feel whenyou are brought face to face with your mortal end, nestles inyour memory like a gangrene: it seeks to rot everything, eventhe words with which to speak of it. So you must fight hard toexpress it. You must fight hard to shine the light of wordsupon it. Because if you don\u0027t, if your fear becomes a wordlessdarkness that you avoid, perhaps even manage to forget, youopen yourself to further attacks of fear because you never trulyfought the opponent who defeated you.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/1841/53405.html","bookId":122,"creation":"Aug 1, 2019 4:23:29 AM","modification":"Aug 1, 2019 4:23:29 AM"}
