{"id":99789,"no":15,"title":"Page 15","content":"\u003cp\u003eFortunately, Vel plans things down to the millimeter, and he has a private hovercar waiting outside. The back entrance to the jurisprudence center hasn’t been completely overwhelmed, so with Hit and Dina helping to clear a path, we manage to get inside the vehicle with a minimum of trouble. Of course, the press still scream their questions. I try to ignore them, but this one burrows into my brain:\u003c/p\u003e\n\u003cp\u003e“What are you going to do, now that you’ve gotten away with murder?”\u003c/p\u003e\n\u003cp\u003e“Ignore them,” Dina says quietly. “They’re assholes. They have no idea what you did for them. Not really.”\u003c/p\u003e\n\u003cp\u003eIt means a lot to have her support, but I must look terrible if she’s abandoned our normal mode of interaction, which is pure sarcasm. I know prison honed me, leaving me thinner and more muscular. The death toll probably shows in my eyes as well. They will ever remain on my conscience, those six hundred.\u003c/p\u003e\n\u003cp\u003e“I need their names,” I tell Vel. “Could you please pull up a list?”\u003c/p\u003e\n\u003cp\u003e“Are you sure that is wise, Sirantha?”\u003c/p\u003e\n\u003cp\u003e“No, but it’s necessary.”\u003c/p\u003e\n\u003cp\u003eHe complies then. And soon, I’m staring at the long, long roster of people who died because of me. This will be my bedtime reading for turns to come. Hit and Dina exchange a look, like I can’t interpret their silent concern, but neither of them argues with me, a fact for which I’m grateful.\u003c/p\u003e\n\u003cp\u003e“Thanks for standing by me,” I say to both of them.\u003c/p\u003e\n\u003cp\u003eHit nods. “Thanks for protecting me.”\u003c/p\u003e\n\u003cp\u003eReally, it could’ve gone much worse for me if I’d had a less talented barrister. I hope Nola can do as much for Pandora. Speaking of which . . .\u003c/p\u003e\n\u003cp\u003e“Vel, I don’t know where you found Nola, but—”\u003c/p\u003e\n\u003cp\u003e“Chancellor Tarn recommended her,” he interrupts. “And he transferred the funds from his own accounts for me to cover her fees.”\u003c/p\u003e\n\u003cp\u003eHuh. So the Conglomerate prosecuted me, but Tarn paid to get me acquitted. I like him a little better right now. It’s not the credits; I could have afforded to pay for my own defense, but this makes me feel less like they used me and cut me loose when I became inconvenient. I understand why he couldn’t take a public stance supporting my actions, but deep down, he’s an honest man. He knows I did what I had to, no matter how ugly it looks on the outside.\u003c/p\u003e\n\u003cp\u003eI fall quiet, pensive, watching the buildings blur into lines of color as we travel away from the city center. Ocklind is a beautiful city, temperate weather, semitropical beaches. If I hadn’t acted as I did, New Terra might, even now, be swarming with Morgut. I see scenes superimposed from Emry Station. So much blood. I squeeze my eyes shut, but it doesn’t help because these images are memories.\u003c/p\u003e\n\u003cp\u003eVel touches my arm lightly, grounding me, and by the time we land, I have it under control again. The Morgut won’t be landing here. Between the standing Armada, the Ithtorian fleet, and the fact that there’s a shipyard producing more vessels as we speak on Nicu Tertius, the Conglomerate will never let itself be caught off guard again. We will defend our territories to the death . . . and our enemies will have to parlay with us to learn the new secrets of grimspace.\u003c/p\u003e\n\u003cp\u003eThe new training facility is a building comprised of a series of interlocking domes, visually interesting, but I wonder if it’s tough to navigate. The bot puts us down outside, where there are no crowds at all. I don’t delude myself that I will never see the media again, but they haven’t anticipated my movements to this point. It makes for a welcome break from all the shouting.\u003c/p\u003e\n\u003cp\u003e“Comm if you need us,” Dina says.\u003c/p\u003e\n\u003cp\u003eRight. There’s no reason for everyone to come inside; there’s no work for them to do here. Lifting a hand in farewell, I go into the complex and am impressed when they test me for contaminants at the entryway. This is nothing like the Farwan academy where I studied; it has a more ominous feel. But since they converted a former asylum in short order to establish this training program—which is more apropos than they realize—it’s not surprising. Once they determine I carry nothing that will harm the students within, the doors unlock, and I am permitted my first glimpse of the complex.\u003c/p\u003e\n\u003cp\u003eHalls lead out from the main hub in six different directions. Luckily, there’s also a map on the wall, identifying who has offices in the building. I find Argus’s name near the center. He’s been appointed as director, despite his relative lack of experience, by virtue of his crash-course training before I turned myself in. I hope he’s glad to see me.\u003c/p\u003e\n\u003cp\u003eI navigate the corridors alone, trying not to attract attention. A couple of the students give me a second look, then shake their heads, as if to say, Nah, couldn’t be. I’m grateful for the rare anonymity as long as it lasts.\u003c/p\u003e\n\u003cp\u003eArgus answers my knock, wearing a harried look, and an expression of profound relief dawns on his young face. Despite my dark mood, I can’t help but smile. He looks like he’s in over his head.\u003c/p\u003e\n\u003cp\u003e“Oh, thank Mary they didn’t kill you,” he breathes. “Maybe I’ll survive this job after all.”\u003c/p\u003e\n\u003cp\u003eCHAPTER 13\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” I ask.\u003c/p\u003e\n\u003cp\u003eWe’ve stepped into his office, the door closed behind us. He takes a seat at his large desk, and I sit opposite. It’s so funny to see him on the other side of authority, the director of this place. To me, he’ll always be my apprentice jumper; maybe this is similar to having children.\u003c/p\u003e\n\u003cp\u003eA long, frustrated breath escapes him. “I can’t teach it. I can navigate the new signals, but I can’t show anyone else like you showed me. I’ve just been buying time with bullshit exercises to ‘prepare their minds,’ hoping they’d cut you loose. But it’s been so long now that I think they suspect something’s wrong.”\u003c/p\u003e\n\u003cp\u003eFrag me. There might be some truth to the accusation that I held the whole galaxy hostage. If they’d executed me, it would’ve crippled grimspace travel for turns to come. But I can show them all how to read the way the beacons pulse now, just like I did Argus. It will be time-consuming, but it’s doable, and maybe along the way, I’ll come across a jumper who can teach it alongside me. Unfortunately, I know of no test to identify that capacity.\u003c/p\u003e\n\u003cp\u003e“All right,” I say, switching to work mode. “How many jumpers are here for training?”\u003c/p\u003e\n\u003cp\u003e“Over five hundred, but more arrive every day.”\u003c/p\u003e\n\u003cp\u003e“Then strictly speaking, from a facilities standpoint, how many jumpers can jack into a training chair with me at one time?”\u003c/p\u003e\n\u003cp\u003e“No more than five.”\u003c/p\u003e\n\u003cp\u003eI tap the comm. “Dina, are you still in range?”\u003c/p\u003e\n\u003cp\u003e“Dammit,” she replies. “I knew it was too good to be true. I’m not getting a vacation, am I?”\u003c/p\u003e\n\u003cp\u003e“I’d appreciate your help here. I need you to figure out a way to patch twenty training chairs into one nav chair, and all processed through the same console.”\u003c/p\u003e\n\u003cp\u003e“Like I did on the Triumph, times twenty?”\u003c/p\u003e\n\u003cp\u003e“Pretty much.”\u003c/p\u003e\n\u003cp\u003e“You don’t want much, do you?”\u003c/p\u003e\n\u003cp\u003e“I would love you forever if you could swing it.”\u003c/p\u003e\n\u003cp\u003e“You’ll love me forever anyway.” I hear her giving instructions to the drive-bot, then she adds to me, “I’ll be there in fifteen. Need to grab my tools first.”\u003c/p\u003e\n\u003cp\u003e“I would be glad to assist,” Vel adds. “I have some mechanical aptitude.”\u003c/p\u003e\n\u003cp\u003eTo say the least. He knows more about gadgets and gizmos than anyone I’ve ever met, save Dina. And when they work in concert, there’s nothing they can’t accomplish. I’m feeling better about this already.\u003c/p\u003e\n\u003cp\u003e“This is doable?” Argus asks.\u003c/p\u003e\n\u003cp\u003e“Very. Here’s what I need you to do now. Tell the students to take the rest of the day off because tomorrow, they start wrapping up their training.”\u003c/p\u003e\n\u003cp\u003e“Are you sure about that?”\u003c/p\u003e\n\u003cp\u003e“Absolutely. We’ll work through the night to make all the necessary adjustments.” I do a little math in my head. “I can probably do five classes a day, which means it’ll take me a bit less than a week to handle the ones already on hand. I’ll need your help prioritizing by those who arrived first. I trust you took notes?”\u003c/p\u003e\n\u003cp\u003e“Yes, I have plenty of records. I just didn’t know what to do with them after I failed my first attempts to show them the difference.”\u003c/p\u003e\n\u003cp\u003eI laugh softly. “You get high marks for stalling.”\u003c/p\u003e\n\u003cp\u003eHe shrugs. “I really just want to jump.”\u003c/p\u003e\n\u003cp\u003e“You’ll be in demand, don’t worry. There will be shipping companies that’ll pay you a fortune at this point to get their goods moving again.”\u003c/p\u003e\n\u003cp\u003e“I’m ready for a job like that,” Argus says. “Relatively low pressure.”\u003c/p\u003e\n\u003cp\u003e“Had enough of the thrills, chills, and death-defying?”\u003c/p\u003e\n\u003cp\u003eHis young face grows somber. “Esme died in the attack on Venice Minor.”\u003c/p\u003e\n\u003cp\u003eI remember her; she was the young blonde with whom he celebrated his first solo jump. Though I don’t say so aloud, he now knows what it’s like to be a jumper. Death stalks us through our days, taking those we love as if in warning not to forget how great a hold it has on us. Loss rides us from birth to grave, endless shadow cast over the euphoria that burns in grimspace.\u003c/p\u003e\n\u003cp\u003e“I’m sorry,” I say quietly.\u003c/p\u003e\n\u003cp\u003e“It stopped being a game then.” He’s older now. I should’ve noticed at once, but I was focused on sorting the training situation here.\u003c/p\u003e\n\u003cp\u003e“Did you love her?”\u003c/p\u003e\n\u003cp\u003eHe gives the question thoughtful consideration, then shakes his head. “I didn’t bother getting to know her enough to say. I was just having fun.”\u003c/p\u003e\n\u003cp\u003e“And now you’ll never know if it might’ve been something.”\u003c/p\u003e\n\u003cp\u003e“Exactly.”\u003c/p\u003e\n\u003cp\u003e“We all lost people we loved on Venice Minor, and we can only go on as they would’ve wanted. Suffer the aftermath. War is bloody and awful . . . It leaves terrible wreckage to clear away. There are no heroes, only survivors.”\u003c/p\u003e\n\u003cp\u003e“That’s not what they believe on Lachion,” he says. “They sing of great battles and people who died well for their clan.”\u003c/p\u003e\n\u003cp\u003e“Do you still believe that’s true?”\u003c/p\u003e\n\u003cp\u003e“No. After what I’ve seen, I don’t see how it could be good or glorious.”\u003c/p\u003e\n\u003cp\u003eI feel sad for him, as he’s grown too much, and he can never return home. He cannot believe in their stories. But maybe a better life awaits Argus elsewhere, after a long career as a jumper. I can hope for that, even if I do not believe. Navigators like us don’t wind up surrounded by our grandchildren, full of satisfaction at a life well lived. Like most, he will die in the nav chair, unable to speak a farewell to those who love him.\u003c/p\u003e\n\u003cp\u003eA small part of me pricks up in protest. Times, they are changing, and that may alter his end, too. Despite Doc’s death, his gene therapy lives on. Unlike Evie, he wasn’t paranoid about theft, and I know where he backed up his data. We can use his science to save jumpers from burnout. Maybe one day, there will be no dire tales about what happens to navigators who give too much to grimspace.\u003c/p\u003e\n\u003cp\u003eBut first things first. I’ve got to prepare this facility for training in volume, then run the classes. Gene therapy can wait until after there’s FTL movement on the Star Road again. I give Argus a list of things he needs to requisition, and he’s happy to have a job he can do while he’s on the ground. The stress flows away from him as I take charge; I can only imagine how tough it’s been for him to pretend he could do what they demanded of him. \u003c/p\u003e","sourceLink":"https://allnovel.net/aftermath-sirantha-jax-5/page-15.html","bookId":1650,"creation":"Oct 5, 2019 6:47:48 PM","modification":"Oct 5, 2019 6:47:48 PM"}
