{"id":99799,"no":26,"title":"Page 26","content":"\u003cp\u003eWith gestures and sounds, she quiets the Mareq around us; and then the chip has only her voice to process. Which is when the chip provides the first possible Mareq translation, ever.\u003c/p\u003e\n\u003cp\u003e“You come from the sky,” she says. “Above the rains. From the god-place, and you bring my son home.”\u003c/p\u003e\n\u003cp\u003eFrag. How do I answer that with my imperfect chip? But I have to try, so I keep my sentences short and simple.\u003c/p\u003e\n\u003cp\u003e“I come from the stars. Not a god-place. I took your son by mistake, so I brought him home to you. I’m sorry.”\u003c/p\u003e\n\u003cp\u003eMore croaking. My chip kicks in, so long as there’s only one Mareq voice. “Things happen. We don’t always know the reasons. We don’t need to.” I have the feeling what she said might be wiser and more profound, but that’s close enough.\u003c/p\u003e\n\u003cp\u003eI translate for Vel, who has no doubt gotten the gist from her delight in being reunited with Baby-Z2. From what I can tell thus far, the Mareq seem to be a peaceful and philosophical race. If they were otherwise, they’d have attacked us right off, before I could show them what I carried. And wouldn’t that have been a nightmare?\u003c/p\u003e\n\u003cp\u003e“I’m Jax,” I tell her, and the vocalizer makes a noise of my name.\u003c/p\u003e\n\u003cp\u003eShe offers hers back, a different one, which the chip tells me is Dace. I suspect it just combined some random letters, but it doesn’t matter as long as my vocalizer can reproduce the sound. I test it, and it can.\u003c/p\u003e\n\u003cp\u003e“You must stay for the celebration,” she continues.\u003c/p\u003e\n\u003cp\u003eThe other Mareq chime in, croaking in what I take to be agreement. But that bogs my processor down, leaving me to guess what they’re saying. She seems to notice this, and quiets them with anh anh anh noises. The chip suggests she’s saying, Shut it, shut it.\u003c/p\u003e\n\u003cp\u003e“What celebration?” I ask.\u003c/p\u003e\n\u003cp\u003e“Of the miraculous homecoming. We have a story of the son who disappears, then returns to us unchanged. It is said he carries a great destiny.”\u003c/p\u003e\n\u003cp\u003eMaybe so. I’m just glad I’ve turned Baby-Z2 over to his mother. She can look after him from this point on. I didn’t hurt him this time. I didn’t fail him. An astonishing lightness spreads through me, as if I’ve discharged a weight on my soul.\u003c/p\u003e\n\u003cp\u003eI glance at Vel, then bring him up to speed—and Mary, that’s weird, it’s a flip of what we did on Ithiss-Tor. He chose not to have his processor upgraded because we don’t plan to stay long. Only one of us needs to be able to communicate here.\u003c/p\u003e\n\u003cp\u003eThen he nods. Of course we should stay, his expression tells me. He’s right; it would be insulting to drop the kid off and run, and I have plenty of time until Carvati’s team comes up with a workable solution to the La’heng situation. Until I keep that last promise, my life is not my own.\u003c/p\u003e\n\u003cp\u003e“We would be honored,” I reply.\u003c/p\u003e\n\u003cp\u003eIt’s still a little unnerving to hear my vocalizer making those noises. The other Mareq scatter to spread the word of the miraculous return. I hear them telling the story in snippets as they disperse through the settlement.\u003c/p\u003e\n\u003cp\u003e“You have cared well for Zeeka. This mother thanks you.”\u003c/p\u003e\n\u003cp\u003eZeeka? Is it possible he was trying to tell us his name? We never knew why we settled on calling him Baby-Z; it was just right, or the closest we could come. Intrigued, I pose the question to Dace, and she seems delighted.\u003c/p\u003e\n\u003cp\u003e“Yes, all Mareq are born into the world bearing a true name, and they know it in their souls from the time of their coming-forth. He is a strong son indeed to try and tell his name to strangers.”\u003c/p\u003e\n\u003cp\u003eI think she means strangers in the sense that we are superweird, not unknown, though we’re certainly that, too. Vel regards me with curiosity, a welcome distraction from his heavy grief, and I summarize for him with some pleasure.\u003c/p\u003e\n\u003cp\u003e“Remarkable,” he says, when I finish.\u003c/p\u003e\n\u003cp\u003e“Let us take you to a guest shelter.” She leads the way, croaking about preparations.\u003c/p\u003e\n\u003cp\u003eMy chip cuts in and out as we pass other Mareq. I hope over time it learns to compensate, or she will think I’m stupid, unable to process information from more than one source. Otherwise, so far, we’re off to a good start.\u003c/p\u003e\n\u003cp\u003eInside the hut, it’s familiar, similar to the birthing mound where March and I knelt. Compared to the rains outside, it’s relatively snug and dry in here. I appreciate that, as there’s some risk I’ll develop a fungal infection from constantly damp skin—a small price to pay for this buoyancy of spirit, however.\u003c/p\u003e\n\u003cp\u003e“It will be intriguing to see how the Mareq celebrate,” Vel says.\u003c/p\u003e\n\u003cp\u003eI’m glad to see him taking an interest, though not surprised. For him, intellectual pursuits always offer the most distraction. It will be worth a sojourn on Marakeq if it means surcease from the blow he took on Gehenna.\u003c/p\u003e\n\u003cp\u003e“Can you understand them at all?” He downloaded the vocabulary, too, but unless it’s loaded directly onto the chip, there’s some lag time in the learning curve. Which means I might not understand them at all, or at least not as well as I imagine I do. Dace might have invited us to wait in this hut, so we could be cooked and eaten at the feast, but I don’t think so.\u003c/p\u003e\n\u003cp\u003e“Bits of it. If we remain here long enough, I will assimilate the language.”\u003c/p\u003e\n\u003cp\u003e“You’ve had a lot of experience in that.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eNot all of it good. But I don’t say that aloud.\u003c/p\u003e\n\u003cp\u003eExamining the interior, I discover mounded dirt that we can use for sleeping. Soft, green moss grows atop the makeshift mattress, more inviting than you might think. Everything about the Mareq is natural and flows from their world. They exude a certain harmony, and that’s why I think they won’t hurt us, even if I’ve misunderstood about the festival.\u003c/p\u003e\n\u003cp\u003eThere’s nothing to unpack, so we wait. The village hums with activity and what I take for music. A low but also jubilant sound rumbles forth, harmonies intertwining from a lighter instrument. I’m pretty sure that’s what I’m hearing—primitive pipes and flutes, accompanying the Mareq chorus. That’s lovely and unnerving because it’s so other. It sinks in then that I’m on a class-P world without Corp or Conglomerate sanction. There’s no backup here, other than Hit and Dina, no matter what happens.\u003c/p\u003e\n\u003cp\u003e“Try not to worry,” Vel says. “I did not sense harm in them.”\u003c/p\u003e\n\u003cp\u003eHe reads me so damn well . . . and without the benefit of Psi powers. Bittersweet memories of March fight to rise to the forefront, but I push them back. This is not the time; countless mysteries await us in the village. I’ll turn my thoughts to that instead.\u003c/p\u003e\n\u003cp\u003eA short time later, Dace comes to fetch us.\u003c/p\u003e\n\u003cp\u003eCHAPTER 23\u003c/p\u003e\n\u003cp\u003eOverhead, the gauzy sun-star that warms Marakeq twinkles in the dreamy twilight. Full dark never falls here, just this magical grayness. Fog has set in as well, a cold front pushing against the warm rain. Marveling at the biotechture, I follow Dace deeper into the village. There are mounds everywhere, and the glowing lights twinkle brighter against the mist.\u003c/p\u003e\n\u003cp\u003eWe stop in the center; everything is laid out in circular fashion here, rings on rings, forming a larger pattern. Vel glances about with great interest, no doubt his ocular cam recording everything for later scrutiny. Around us, the Mareq celebrate with rhythmic dancing, perfectly in cadence. Each social set appears to have a certain role to play, steps to perform, and they’re all singing. Hatchlings frolic at our feet, splashing in the green-cast water that pools on the ground. One day, Zeeka, the one I stole, will take his place among them. I feel easier knowing that; some of the damage I did has been repaired.\u003c/p\u003e\n\u003cp\u003e“Come,” Dace calls. “Dance!”\u003c/p\u003e\n\u003cp\u003eIt’s somewhat ridiculous, but Vel sets down his pack, and I try to mimic their movements. Their legs bow outward differently than mine or even Vel’s for that matter, so we can’t manage a perfect match. Yet there’s pleasure in the shining curtain of rain. The mottled Mareq hides gleam wet, paler patches making them difficult to spot in the jungle, no doubt. I never thought I’d see the somber bounty hunter dancing, but in all honesty, he’s better than I am. His limbs are closer to the Mareq’s than mine. I can only lumber along in the line, my feet arched outward. Their long, webbed toes bend as mine don’t, adding layers of meaning to the dance.\u003c/p\u003e\n\u003cp\u003eIn some ways, I feel like a cripple here, but there’s no judgment, either. The song swells from so many throats that it begins to sound like one note, endless and beautiful. As I dance, I realize I have tears in my eyes, and I don’t even know why. I’m sliding in the mud, bumping the Mareq ahead of me, and he croaks at me, a friendly sound that the chip attempts to translate:\u003c/p\u003e\n\u003cp\u003e“You’re clumsy. But it can’t be helped. You are who you are.”\u003c/p\u003e\n\u003cp\u003eIt feels like the answer to a question I feared asking, like I’ve been searching every galaxy for this message. You are who you are. The Mareq accept, and it is the loveliest, most desirable thing. They should be trying to stab us, rend us with their primitive weapons, but instead they see our arrival as a gift. They see me not as the one who stole from them but who gave back. I want to protect that innocence from the universe, and I don’t think I can. Not once others learn we’ve made first contact.\u003c/p\u003e\n\u003cp\u003eThat knowledge grieves me.\u003c/p\u003e\n\u003cp\u003eThe party goes on for ages. They offer us food and drink, but after Vel scans it, he shakes his head. “We should decline politely. Toxicity levels indicate it might make us sick.”\u003c/p\u003e\n\u003cp\u003eSwitch to Mareq, I tell the vocalizer.\u003c/p\u003e\n\u003cp\u003e“We’re not hungry, but thank you.”\u003c/p\u003e\n\u003cp\u003eLater, we retire to the hut allotted for our use, exhausted but content with what we’ve seen. In the morning, we can be on our way though I don’t know where we’re going. Maybe we can explore some uncharted beacons between paying out wrongful-death claims.\u003c/p\u003e\n\u003cp\u003eMy comm beeps. “Everything okay, Jax?”\u003c/p\u003e\n\u003cp\u003eThough she’d never admit it now that the war’s over, Dina cares. We bonded on the Dauntless through mutual grief and loneliness. But since that crisis has passed, we’re back to sarcasm and ribbing each other endlessly. I’m more used to that dynamic anyway.\u003c/p\u003e\n\u003cp\u003e“No problems. The Mareq were glad to see Z2. Turns out his name is Zeeka.”\u003c/p\u003e\n\u003cp\u003e“Huh.” By her tone, she’s surprised at how close we came.\u003c/p\u003e\n\u003cp\u003e“We’re going to sleep at the settlement, then return to the ship.”\u003c/p\u003e\n\u003cp\u003e“Where to from there?” Hit asks.\u003c/p\u003e\n\u003cp\u003e“I’m not sure. We’ll talk about it when we get back.”\u003c/p\u003e\n\u003cp\u003eDina disconnects then. Vel pulls two packets out of his pack, and I have to smile. This reminds me of the time we were stranded together in an ice cave on the Teresengi Basin. Like the other time, he gets out a chemical cooker and starts making soup out of freeze-dried ingredients edible and palatable to both of us. Fortunately, there is some overlap between Ithtorian and human physiology, though not enough to permit us to eat all the same things. Oranges, for instance, would kill him.\u003c/p\u003e\n\u003cp\u003e“Hungry?” he asks.\u003c/p\u003e\n\u003cp\u003e“Yeah.” I can’t remember the last time I ate, in fact.\u003c/p\u003e\n\u003cp\u003eA long silence falls as he mixes and stirs. Then he says, “The Mareq have a gift for happiness.”\u003c/p\u003e\n\u003cp\u003eIt’s a blessing I did not expect. Since it’s been that way for as long as I can remember, I expected more punishment and castigation. Instead, there’s only this seamless joy. I could almost stay here, despite the mud and muck and the stink of half-rotten vegetation. Except I can’t. Not me. I always have someplace else I’d rather be, even if I don’t know where that is, yet. \u003c/p\u003e","sourceLink":"https://allnovel.net/aftermath-sirantha-jax-5/page-26.html","bookId":1650,"creation":"Oct 5, 2019 6:47:48 PM","modification":"Oct 5, 2019 6:47:48 PM"}
