{"id":99808,"no":35,"title":"Page 35","content":"\u003cp\u003eAt least there are no Morgut down here.\u003c/p\u003e\n\u003cp\u003eI come back to myself with some effort. That’s the only thing the two occasions have in common—the dark and my irrational response to it.\u003c/p\u003e\n\u003cp\u003eI’m so sorry, Saul.\u003c/p\u003e\n\u003cp\u003eTo distract myself from the guilt, I say, “I don’t suppose you asked the bot if there’s any food around here?”\u003c/p\u003e\n\u003cp\u003e“Of course. And there is not.”\u003c/p\u003e\n\u003cp\u003eThat makes sense, however grim the news. Machines don’t eat. Unfortunately, the diversion doesn’t last long, and my chest tightens painfully. Vel slows his pace and takes my hand. His claws are longer than my fingers and cool to the touch. The skin between the chitin feels rough, leathery, but the underside is thinner and softer. I don’t remember if we’ve ever held hands like this before. His touches have been rare and guarded, but this is more; this is him offering a lifeline in the dark.\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eHe acknowledges my gratitude with a dismissive lift of one shoulder, a very human gesture, one he learned from Adele, I think. But I don’t bring her up because we’re in too scary a place, all the way around, to want to add emotional weight. The tunnel slants downward sharply, becoming more of a slide, and I balk.\u003c/p\u003e\n\u003cp\u003eHe tugs. “I will protect you, Sirantha.”\u003c/p\u003e\n\u003cp\u003eI’m touched, though I know he can’t save me from my own fears: the darkness, the pressure of the stone overhead, or wherever the hell this ends. Though it feels like a bad idea, I follow, because there’s no hope for survival behind us. All of the information in the world won’t keep our bodies alive, and not even my nanites can repair dehydration and starvation. Shit, they have enough work on their hands trying to heal this bite.\u003c/p\u003e\n\u003cp\u003e“Good enough for me. I’m going.” After all, there’s no turning back.\u003c/p\u003e\n\u003cp\u003eAs soon as I hit the top of the ramp, there’s a peculiar lack of friction, as if this surface has been greased, and I can’t control my descent at all. I slide into a fall, careening wildly into the darkness, tearing away from Vel. He calls out, but my speed has already put me ahead of him, and there’s no way he can catch up. Whatever awaits us at the bottom, I’ll face it first.\u003c/p\u003e\n\u003cp\u003eI slam into the wall and then there’s a sharp turn before I spill onto level ground. The impact tears the wound in my side; warm blood trickles down my hip. That’s just what I need, an invitation to any predators lurking. With some effort, I remind myself that there are no Morgut here. We’re Mary knows how far from any known life, and that knowledge allows me to swallow the scream building in my throat.\u003c/p\u003e\n\u003cp\u003e“Vel?” I call.\u003c/p\u003e\n\u003cp\u003eThen I hear the noise of him slipping down after me. I try to scramble to the side, but he hits me full on, knocking me to the ground. Shit. His chitin really packs a punch. I whimper a little, and he rolls away with an apologetic click.\u003c/p\u003e\n\u003cp\u003e“Have I injured you?”\u003c/p\u003e\n\u003cp\u003e“No worse than I was. Where the hell are we?”\u003c/p\u003e\n\u003cp\u003e“Let me scan the area.”\u003c/p\u003e\n\u003cp\u003eThank Mary, we have functional tech again. After trying the primitive lifestyle, I’ve got to say that I prefer modern conveniences. His handheld hums in powering up, then glows; we have to be careful with the charge, so he can’t keep it on constantly. Once it’s gone, who knows when we can juice it up again? There are no charging stations around here, and the solar pack was fried when we went through the gate. I don’t think he was able to replace that in the vault.\u003c/p\u003e\n\u003cp\u003e“It appears to be a system of catacombs.”\u003c/p\u003e\n\u003cp\u003e“Isn’t that where people buried their dead?”\u003c/p\u003e\n\u003cp\u003e“Some cultures,” he admits.\u003c/p\u003e\n\u003cp\u003eLovely. We walked away from a high-tech area for a tomb. I’ve been feeling like we made a mistake ever since we left the jungle, but there’s no fixing it now. Sometimes, you have to push through the terrible stuff in order to find something better. I’ll cling to the hope that’s what we’re doing.\u003c/p\u003e\n\u003cp\u003eCHAPTER 30\u003c/p\u003e\n\u003cp\u003eIt’s miserable down here.\u003c/p\u003e\n\u003cp\u003eThe oppressive weight of stone is bad enough. I feel like I can’t breathe, and the sensation only intensifies as we creep through dark stone passageways filled with bones. Oh, they’re carefully tended and stowed in niches cut into the wall, but that doesn’t help in the least, particularly when I note the distinct lack of humanity in their physiology. They aren’t Mareq. Nothing I’ve ever seen before.\u003c/p\u003e\n\u003cp\u003eRight now, I’m passing through the dead heart of the Maker civilization. Nobody’s been here since they left this world, however long ago that might have been. I can tell the truth of that from the thick dust on the ground.\u003c/p\u003e\n\u003cp\u003eAfter setting his pack down, Vel stops before one of the open tombs, studying the skeletal structure by the faint glow of his torch-tube. I have no words for how alien they are, but they took great care with their dead, as the remains have been arrayed with kingly care.\u003c/p\u003e\n\u003cp\u003e“I do not believe they were bipedal.”\u003c/p\u003e\n\u003cp\u003eI’ve no idea how he discerns that, but I’m not arguing. I just want out of here before exhaustion, hunger, and sheer panic overwhelm me. My pulse pounds in my skull, and each new breath feels as though the oxygen has thinned.\u003c/p\u003e\n\u003cp\u003e“Let’s keep moving,” I say, my voice thready with fear.\u003c/p\u003e\n\u003cp\u003eHe cuts me a sharp look, as if trying to determine what ails me, then turns back to the bones in abject fascination. “We cannot leave just yet,” he says. “Think of what scientists can learn if they can extract a suitable DNA sample.”\u003c/p\u003e\n\u003cp\u003eBefore I can name any one of the hundred reasons I think this is a terrible idea, he reaches into the niche and plucks out a small, curved bone. The response is immediate; beneath our feet, the ground gives way. Desperately, I dive for the far side and catch hold of the stone lip, dangling with one hand as Vel disappears. The torch-tube bounces away into the darkness, leaving me alone with my ragged breathing and the fear of falling.\u003c/p\u003e\n\u003cp\u003eInevitably, I think of Kai—and our last moments together—how I teased him.\u003c/p\u003e\n\u003cp\u003eAre you afraid of falling, baby?\u003c/p\u003e\n\u003cp\u003eNo, I’m afraid of landing.\u003c/p\u003e\n\u003cp\u003eOh, Mary, so am I. Get to solid ground, Jax, and then look for Vel. He can’t be dead. Not Vel. Oh, please, don’t leave me alone.\u003c/p\u003e\n\u003cp\u003eEach movement tears at the wound in my side, but I pull myself up, conscious of fresh blood dripping down my hip. Blindly, I feel for his pack and locate another torch-tube. Our last. I crack it without hesitation and shine it into the pit. At first, I see only the razor-sharp spikes that line the bottom. The Makers hated grave robbers. And then I spot Vel, clinging to the side about halfway down, his claws dug into the soft, crumbling stone.\u003c/p\u003e\n\u003cp\u003e“Sirantha,” he says calmly, “I cannot support my weight in this fashion for long. Already my talons have begun to tear.”\u003c/p\u003e\n\u003cp\u003eThat sounds unimaginably painful. With a shuddering breath, I dig into his pack. I don’t need to be told to look for a means to haul him up before he’s crippled by loss of his claws, then impaled. Even my long-lived, damn-near- indestructible Ithtorian bounty hunter cannot survive that.\u003c/p\u003e\n\u003cp\u003eI must save him.\u003c/p\u003e\n\u003cp\u003eMy hands are shaking, but at least I have something other than my fear of confined spaces to focus on. Now I’m terrified of losing him. I locate a thin, tensile cord that should be long enough to reach him, but I will need to anchor him and pull him up. I loop the rope around my waist and drop it down; once I do that, I inch backward until I can brace my feet solidly. There’s nothing for me to hold on to down here, just stone walls and bones, so I have to be strong enough to bear his weight. No other options—failure isn’t in my vocabulary.\u003c/p\u003e\n\u003cp\u003e“Can you climb?” I ask.\u003c/p\u003e\n\u003cp\u003e“Yes. Don’t move, Sirantha.”\u003c/p\u003e\n\u003cp\u003eWhen he grasps the cord, I stumble forward two steps, and Vel tumbles down farther, terrifyingly close to the spikes. His low curse, clicked in Ithtorian, shames me.\u003c/p\u003e\n\u003cp\u003e“I won’t let you fall,” I promise. “Give me a second.”\u003c/p\u003e\n\u003cp\u003eThe passage is narrow, so I throw my arms open, using the stone to brace. I won’t let go this time. I won’t budge. Slowly, I widen my stance.\u003c/p\u003e\n\u003cp\u003e“Ready?”\u003c/p\u003e\n\u003cp\u003e“Come up.”\u003c/p\u003e\n\u003cp\u003eHe crawls upward, using his claws as well as the cord. I hold steady, despite the unbearable strain. I’m bleeding profusely now, but I don’t shift. Not even a millimeter. When I glimpse the top of his head and his arms above the pit, I lie down on my stomach and slide forward, reaching to pull him up.\u003c/p\u003e\n\u003cp\u003eBy the time I get him on solid ground again, I’m shaking from head to toe. I wrap my arms around him and rest my head against the side of his face. He leans into me, and I feel tremors rocking him, too. Despite his constant composure, he’s not immune to fear. He just puts on a good show to reassure me. Struck by this revelation, I wonder if this misadventure has been as frightening for him as it has me; he just didn’t want to burden me with it. Conversely, the possibility that he’s not utterly self-reliant bolsters me. I can be strong for someone else when the situation calls for it.\u003c/p\u003e\n\u003cp\u003e“How badly are you hurt?” I ask.\u003c/p\u003e\n\u003cp\u003e“I lost a claw.”\u003c/p\u003e\n\u003cp\u003e“Will it grow back?”\u003c/p\u003e\n\u003cp\u003e“No. But when we return to civilization, I can acquire a prosthetic.”\u003c/p\u003e\n\u003cp\u003eWhen, not if. I love him for saying that, even now. I love him, period. And I almost lost him. Shaking sets in. In a different way from March, different, yes, but not less. I love him.\u003c/p\u003e\n\u003cp\u003e“Don’t scare me like that again,” I say.\u003c/p\u003e\n\u003cp\u003e“I will do my best not to.”\u003c/p\u003e\n\u003cp\u003eWith the gaping hole behind us, we must go forward. Since I’d already decided that was the best course, I’m okay with that. I’m just glad I was on Vel’s right when the pit opened up; that allowed me to scramble to the other side, which means we’re not trapped down here.\u003c/p\u003e\n\u003cp\u003e“Will Nu-Skin seal your wound?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Then I’ll treat you now if you patch up my side again.”\u003c/p\u003e\n\u003cp\u003e“Gladly.”\u003c/p\u003e\n\u003cp\u003eThat exchange of care uses up the last of our medical supplies, however. I never thought I’d see him out of necessary goods, but we’ve reached the bottom. If we don’t get out of here soon, we’ll die. That’s not histrionics or me being dramatic. It’s a fact.\u003c/p\u003e\n\u003cp\u003e“I’m thinking maybe we don’t want to touch anything else, if we can help it,” I say with a hint of a smile.\u003c/p\u003e\n\u003cp\u003e“Agreed. But I still have the sample,” Vel adds, as if that validates our near-death experience.\u003c/p\u003e\n\u003cp\u003e“You’ve no idea how relieved I am.” My dry tone elicits a staccato series of clicks from him that I recognize as laughter. And that ability in him—to laugh in the face of certain death—prompts me to speak words I couldn’t have imagined, turns before. “When we get out of here”—I, too, cling to when, not if—“I want you to wear my colors.”\u003c/p\u003e\n\u003cp\u003eI carry his colors on my throat, a beautiful vine-and-thorn pattern he designed himself. He did it on Ithiss-Tor to protect me from repercussions in diplomatic circles. There, I overheard whispers of speculation from his people, wondering whether he had taken me as his partner in every sense. So I have an inkling what my acceptance meant—and what my request will mean to him.\u003c/p\u003e\n\u003cp\u003eI go on, bravely, considering his unresponsive stance. “You said once that we’d discuss it further if we both survived the war.” \u003c/p\u003e","sourceLink":"https://allnovel.net/aftermath-sirantha-jax-5/page-35.html","bookId":1650,"creation":"Oct 5, 2019 6:47:48 PM","modification":"Oct 5, 2019 6:47:48 PM"}
