{"id":99821,"no":48,"title":"Page 48","content":"\u003cp\u003eHis smile flashes bittersweet humor. “At least this time I get to see you go.”\u003c/p\u003e\n\u003cp\u003eFarewell for now, my love. I say it in the silence of my head, but he hears.\u003c/p\u003e\n\u003cp\u003eFor now, he replies. And don’t think I’ll go those eight turns without seeing you. I will come for you. Always.\u003c/p\u003e\n\u003cp\u003eThat sounds like a promise, but one unasked. We can’t be sure what the future holds. I understand if you need to find a . . . partner. Someone to help you raise Sasha. I understand. I do, I do, even if that generous offer threatens to break me.\u003c/p\u003e\n\u003cp\u003eTender warmth streams through me. That’s why I love you. Thank you, Jax. But in him I sense the resolve not to. Sasha doesn’t need anyone else, he thinks, and might only be unsettled. He’ll wait, like he promised. And as Sasha gets older and more secure, he’ll come to La’heng, or I can visit here. It’s not impossible, just . . . hard. But things always are with us. “Always” is a word that carries both magic and despair. I clutch it to my heart like a bladed fan.\u003c/p\u003e\n\u003cp\u003eI run then; I can’t bear anymore. Blindly, I seek the door, navigating his finely furnished living room through a field of tears. The door recognizes me and lets me out, and I weep silently in the lift, which takes me to the ground, unasked. March stays with me, and I feel his pain as well. The anguish amplifies in my head until I know he’s crying, too.\u003c/p\u003e\n\u003cp\u003eNot for me, I tell him. Don’t let Sasha see you sad. We’ll be fine. I’ll comm.\u003c/p\u003e\n\u003cp\u003eMe, too, love.\u003c/p\u003e\n\u003cp\u003eThe tenuous connection breaks as I stop on the first floor. I’m too far away from him now. Too far, too far. Oh, March. Squaring my shoulders, I exit his building and walk backward until I can see his apartment. He’s still on the balcony, watching me go, as he promised. I stop and lift a hand to him, a dark silhouette against the starry sky. He puts his palm up, and I feel the heat of his touch across the distance. I am not the woman to raise a child with him, but I am the one he loves.\u003c/p\u003e\n\u003cp\u003eThere will be a someday.\u003c/p\u003e\n\u003cp\u003eThen I turn and hurry toward the hover-cab stand. I am not born to be an earthbound thing. Even as I step into the cab and it lifts, so does my heart. I believe in a future where all things are possible, promises are kept, and you can, indeed, go home again. And he will be waiting. Always. \u003c/p\u003e","sourceLink":"https://allnovel.net/aftermath-sirantha-jax-5/page-48.html","bookId":1650,"creation":"Oct 5, 2019 6:47:48 PM","modification":"Oct 5, 2019 6:47:48 PM"}
