{"id":34015,"no":11,"title":"CHAPTER XI. A PROPOSED SUPPER-PARTY","content":"Two mornings later, Roger had come down to River Street with a basket of green stuff for Grandma.\n\u003cbr\u003e \n\u003cbr\u003e One result of his wife’s new economy was that he had turned errand-boy. He grumbled a little about it, but Margaretta was inexorable.\n\u003cbr\u003e \n\u003cbr\u003e “You want me to save,” she said. “I’m going to do it. You can just as well run down to River Street before you go to your office, as for me to give a boy ten cents for doing it.”\n\u003cbr\u003e \n\u003cbr\u003e “Ten cents is a paltry sum.”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, but ten tens are not paltry, and if you save ten cents twenty times you have two dollars. Now trot along!” and Roger always trotted, smiling as he went.\n\u003cbr\u003e \n\u003cbr\u003e On this particular morning, Grandma, after gratefully receiving the basket, stood turning over the crisp, green lettuce, the parsley, beets, and lovely[131] flowers with her slender fingers, when Berty appeared fresh and rosy.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, Roger, dear,” she cried, flying to her writing-desk when she saw him, “wait a moment and take a note to the city hall, will you?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, Miss Lobbyist,” said her brother-in-law, good-naturedly.\n\u003cbr\u003e \n\u003cbr\u003e “Why, this is to the Mayor,” he said, in pretended surprise, when she handed him her note.\n\u003cbr\u003e \n\u003cbr\u003e “Yes, why not?” asked Berty, opening her eyes wide.\n\u003cbr\u003e \n\u003cbr\u003e “I thought you had done with him.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, that quarrel,” said Berty, carelessly, “that was two whole days ago. I’ve had two bouquets, and a bag of some new kind of feed for the pigeons from him since then. I’m doing him a favour now. There’s some one coming here to supper to-night that he’d like to meet.”\n\u003cbr\u003e \n\u003cbr\u003e “Who is it?” asked Roger, curiously.\n\u003cbr\u003e \n\u003cbr\u003e “Selina Everest.”\n\u003cbr\u003e \n\u003cbr\u003e “I shouldn’t think he’d be her style,” said the young man, guilelessly.\n\u003cbr\u003e \n\u003cbr\u003e “He isn’t,” sighed Berty, “but he likes her, and I’m bound to give them a chance to meet. I hope she won’t snub him.”\n\u003cbr\u003e \n\u003cbr\u003e “She is too much of a lady to do that,” said Roger.\n\u003cbr\u003e \n\u003cbr\u003e [132]\n\u003cbr\u003e \n\u003cbr\u003e “You’re right,” replied Berty, but she sighed again.\n\u003cbr\u003e \n\u003cbr\u003e Roger’s eyes sparkled. “Grandma,” he said, abruptly turning to her, “it is some time since Margaretta and I have had a meal in your house. Can’t you invite us, too? We both like Selina.”\n\u003cbr\u003e \n\u003cbr\u003e “Certainly, come by all means,” said the little old lady.\n\u003cbr\u003e \n\u003cbr\u003e Berty looked doubtful and did not second the invitation.\n\u003cbr\u003e \n\u003cbr\u003e “What time is supper?” asked Roger.\n\u003cbr\u003e \n\u003cbr\u003e Grandma looked at Berty. “I let her have her own way about the meals. Breakfast is at eight, dinner at twelve—the universal hour on this street—high tea at six, supper is a movable feast—what time to-night, granddaughter?”\n\u003cbr\u003e \n\u003cbr\u003e “Ten,” said Berty, promptly, “but we’ll sit on the veranda first and talk. Some one must keep at the piano all the time, playing dreamy music.”\n\u003cbr\u003e \n\u003cbr\u003e “All right,” said Roger, promptly, “we’ll be here.”\n\u003cbr\u003e \n\u003cbr\u003e Berty followed him to the street door. “You’ll be nice to the Mayor.”\n\u003cbr\u003e \n\u003cbr\u003e “Nice!—I guess so.”\n\u003cbr\u003e \n\u003cbr\u003e “But don’t be too nice—don’t make fun of him.”\n\u003cbr\u003e \n\u003cbr\u003e [133]\n\u003cbr\u003e \n\u003cbr\u003e “Berty!” he said, reproachfully.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, you wouldn’t make fun of him openly,” she said, with sudden wrath, “but I know that look in your eyes,” and with a decided tap on the back she sent him out the front door.\n\u003cbr\u003e \n\u003cbr\u003e Roger, chuckling with delight as he made his way to the iron works, ran into Tom Everest.\n\u003cbr\u003e \n\u003cbr\u003e “What are you laughing at?” asked Tom, with his own eyes shining.\n\u003cbr\u003e \n\u003cbr\u003e “Can’t tell,” said Roger.\n\u003cbr\u003e \n\u003cbr\u003e “I’ll bet it was some joke about Berty,” remarked Tom.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, Berty! Berty!” exclaimed his friend, “all the world is thinking Berty, and dreaming Berty, and seeing Berty. You’re a crank, Everest.”\n\u003cbr\u003e \n\u003cbr\u003e “It was Berty,” said Tom, decidedly. “Come, now, out with it.”\n\u003cbr\u003e \n\u003cbr\u003e “She’s going to have a party to-night,” said Roger, exploding with laughter; “your sister Selina and the Mayor, my wife and I.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m going too,” said Tom, firmly.\n\u003cbr\u003e \n\u003cbr\u003e Roger caught him by the shoulder. “Man, if I find you there to-night, I’ll shoot you.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m going,” said Tom, and he backed into his insurance office, leaving Roger wildly waving his market-basket at him from the street.\n\u003cbr\u003e \n\u003cbr\u003e [134]\n\u003cbr\u003e \n\u003cbr\u003e A few hours later, Roger looked up at his wife as he sat at the lunch-table, and said, “Don’t you want to go to Grandma’s this evening?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, dear, if you do,” she replied, holding out his cup of bouillon for him.\n\u003cbr\u003e \n\u003cbr\u003e At luncheon they were obliged to wait on themselves, and Roger vowed that he liked it.\n\u003cbr\u003e \n\u003cbr\u003e “All right, dear,” he said, as he carefully took the hot bouillon from her, “we’ll go.”\n\u003cbr\u003e \n\u003cbr\u003e “After dinner, I suppose?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “Any one else going?” asked Margaretta.\n\u003cbr\u003e \n\u003cbr\u003e “She expects some others—Selina Everest for one.”\n\u003cbr\u003e \n\u003cbr\u003e “That’s nice,” said Margaretta, emphatically.\n\u003cbr\u003e \n\u003cbr\u003e “And the Mayor,” added Roger.\n\u003cbr\u003e \n\u003cbr\u003e “Oh!” and Margaretta drew a long breath. “I have never met him.”\n\u003cbr\u003e \n\u003cbr\u003e “Don’t you want to?”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, yes,” she said, lingeringly.\n\u003cbr\u003e \n\u003cbr\u003e “Very well. I’ll come home a bit early.”\n\u003cbr\u003e \n\u003cbr\u003e Margaretta, brimming over with satisfaction, gazed affectionately at him. “Roger, you look ten years younger than you did four weeks ago.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ve got the burden of foreboding off my shoulders,”[135] he said, giving them a slight shake as he spoke.\n\u003cbr\u003e \n\u003cbr\u003e “A burden that will never be placed there again, I hope.”\n\u003cbr\u003e \n\u003cbr\u003e Roger smiled, and, looking at her happy face, said, earnestly, “Margaretta, every day of my life I thank God for the good fortune that made you my partner for life.”\n\u003cbr\u003e \n\u003cbr\u003e While Roger was talking to his wife, Berty was having a somewhat excited interview with the Mayor.\n\u003cbr\u003e \n\u003cbr\u003e “Just grabbed ten minutes from lunch-hour,” he said, “to run up and thank you for your invitation for to-night—now what shall I wear? Dress suit?”\n\u003cbr\u003e \n\u003cbr\u003e Berty looked him over. No young girl going to her first ball ever waited a reply with more anxiety than he did.\n\u003cbr\u003e \n\u003cbr\u003e “Let me see,” she said, thoughtfully. “We shall be sitting out-of-doors. I think I would not wear evening dress. Have you got a nice dark suit?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, just got one from the tailor.”\n\u003cbr\u003e \n\u003cbr\u003e “Good—put that on.”\n\u003cbr\u003e \n\u003cbr\u003e “And what kind of a tie?” he asked, feverishly.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, I don’t know—white, I think. That is cool and nice for summer.”\n\u003cbr\u003e \n\u003cbr\u003e [136]\n\u003cbr\u003e \n\u003cbr\u003e “Can’t I wear red?” he asked, anxiously.\n\u003cbr\u003e \n\u003cbr\u003e “Well, yes, a certain shade, but you’d have to be very particular. Why do you wish red?”\n\u003cbr\u003e \n\u003cbr\u003e “I—I—a woman once told me I looked well in red,” he said, sheepishly.\n\u003cbr\u003e \n\u003cbr\u003e Berty surveyed him as an indulgent mother might survey a child.\n\u003cbr\u003e \n\u003cbr\u003e “Very well, wear red. It is a great thing to have something on that you feel at ease in. But, as I say, you must be very particular about the shade. I’ll run up-stairs and get a piece of silk, and do you try to match it,” and she darted away.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Jimson occupied the time while she was gone in walking about the room, nervously mopping his face, and staring out the window at the carriage waiting for him.\n\u003cbr\u003e \n\u003cbr\u003e “Here it is,” exclaimed Berty, running back, “the precise shade. Now do be particular.”\n\u003cbr\u003e \n\u003cbr\u003e “You’re real good,” he replied, gratefully, and, pocketing the scrap, he was hurrying away, when he turned back. “What time shall I come? Can’t I get here before the others?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes, do,” replied Berty, “come about half-past seven.”\n\u003cbr\u003e \n\u003cbr\u003e “All right—thank you,” and he rushed away.\n\u003cbr\u003e \n\u003cbr\u003e Berty followed him to the front door. “Mr. Jimson,”[137] she called, when his hand was on the door-knob.\n\u003cbr\u003e \n\u003cbr\u003e “Hello!” and he turned back.\n\u003cbr\u003e \n\u003cbr\u003e “You won’t be offended with me if I say something?” she replied, hesitatingly.\n\u003cbr\u003e \n\u003cbr\u003e “Not a bit of it.”\n\u003cbr\u003e \n\u003cbr\u003e “Well, if I were you, I wouldn’t talk too much to-night. Dignified reserve impresses women.”\n\u003cbr\u003e \n\u003cbr\u003e “All right,” he said, good-naturedly. “I’m safe enough, if I don’t get rattled. Then I’m apt to make a fool of myself and gabble. Sometimes in making a speech I can’t wind up, even if I see people looking mad enough to kill me.”\n\u003cbr\u003e \n\u003cbr\u003e “Don’t do that!” exclaimed Berty. “Oh, don’t be long-winded. Just sit and watch Miss Everest.”\n\u003cbr\u003e \n\u003cbr\u003e “All right,” said the Mayor, “till this evening!” and he ran down the steps.\n\u003cbr\u003e \n\u003cbr\u003e “Oh, dear,” murmured Berty, as she went up-stairs, “I’m dreadfully in doubt about this party. I wish Margaretta and Roger weren’t coming. The Mayor has been working himself into a state over Miss Everest. If he doesn’t please her he’ll blame me. Oh, dear!”\n\u003cbr\u003e \n\u003cbr\u003e “What’s the matter, granddaughter?” asked a cheery voice.\n\u003cbr\u003e \n\u003cbr\u003e “I’m in trouble, Grandma. The Mayor likes[138] Miss Everest. That’s why I’m asking him here to meet her, but I’m afraid things won’t go right.”\n\u003cbr\u003e \n\u003cbr\u003e “Poor little matchmaker,” said Grandma, soothingly.\n\u003cbr\u003e \n\u003cbr\u003e “Did I do right, Grandma? I would have consulted you before, but I didn’t like to give his secret away.”\n\u003cbr\u003e \n\u003cbr\u003e “You did what a kind heart would prompt you to do. Don’t worry—I will help you with your party.”\n\u003cbr\u003e \n\u003cbr\u003e “Will you?—oh, that is lovely. Everything will go right!” and she threw both arms round her grandmother’s neck.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1690/49758.html","bookId":1167,"creation":"Aug 5, 2019 5:20:47 AM","modification":"Aug 5, 2019 5:20:47 AM"}
