{"id":38309,"no":6,"title":"CHAPTER VI. FOR HIS COUNTRY","content":"\u0026nbsp;Shall I forget on this side of the grave? I promise nothing; you must wait and see. \n\u003cdiv\u003e\n From the train arriving at East Burgen station at eight o\u0027clock that same evening there alighted a youth who seemed suddenly to have taken manhood upon his shoulders. He stood on the platform and pointed out to a porter, who called him Master James, a large Gladstone bag and a new sword-case.\n\u003c/div\u003e \n\u003cdiv\u003e\n Although he could have carried the luggage under one arm and the porter under the other, he carefully refrained from offering to convey anything except his own walking-stick. Such is the force of education. This boy had been brought up to expect service. He was to be served all his life, and so the sword-case had to be left to the porter whom he envied.\n\u003c/div\u003e \n\u003cdiv\u003e\n During the journey down—between the farthest-removed stations—the sword had flashed more than once in the dim light of the carriage lamp. Ah! those first swords! Not Toledo nor Damascus can produce their equal in after years.\n\u003c/div\u003e \n\u003cdiv\u003e\n The porter, honest father of two private soldiers of the line himself, saw it all—at once. He carried the sword-case with an exaggerated reverence and forbore from remark just then. Afterwards, beneath the station-lamp, he looked at the shilling—the first of its kind from that quarter—with a pathetic, meaning smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was Saturday night. The streets of East Burgen were rather crowded, and Jem Agar—with elbows well in and the whip at the regulation angle across old Lasher\u0027s face, who could not help squinting at the pendant thong—shouted to the country-folk in a new voice of mighty deep register.\n\u003c/div\u003e \n\u003cdiv\u003e\n He carried his boyish head stiffly, and had for ever discarded a turn-down collar. At first he kept old Lasher at a respectful distance, asking in a somewhat curt and business-like manner after the stables. Then gradually, as they bowled along the country road in the familiar hush of an April evening, he thawed, and proceeded to vouchsafe to that steady coachman a series of very interesting details of military matters in general and the Indian army in particular.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I\u0027m sure, Mas—sir,” opined Mr. Lasher at length; “if there\u0027s any one as has got into his right rut, so to speak, in this world, it\u0027s you. I always said you was a born soldier.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah—then you\u0027ve heard that I\u0027ve got my commission?” inquired Jem airily, as if he had had many such in bygone years.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh yes, sir! Miss Dora it was that told me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Somehow this caused a little silence.\n\u003c/div\u003e \n\u003cdiv\u003e\n Truth to tell, Dora had lost her rank as the most beautiful and accomplished maiden in Christendom. This situation was at that moment occupied by a young person hight Evelina Louisa Barmond, sister to Billy Barmond of the Hundred and second, a veteran fellow-soldier and comrade who had jumped five feet six at the Sandhurst sports a year before. Miss Evelina Louisa was twenty-four, five years Dora\u0027s senior, and only three years and two months older than Jem Agar himself. He had spoken to her twice, and thought about her in the intervals allowed by such weighty matters as uniform and the new sword, which, however, required almost constant consideration at that time.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said Jem, with exaggerated nonchalance, “I am afraid I should never be fit for anything else.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Whereat Lasher laughed and touched his hat. He made it a rule to salute a joke in that manner, either from a general respect for humour, or looking at it in the light of a mental gratuity offered by his betters.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There\u0027s one thing you can do, Master Jem, sir—leastwise, which you can do as well as any man in the British army,” he said, with pardonable pride, “and that is sit a \u0027orse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thanks to you, Lasher,” Jem was kind enough to say with a flourish of his whip.\n\u003c/div\u003e \n\u003cdiv\u003e\n The dignity was now ebbing fast, and by the time that the clever little cob swung round the gate-post into the avenue of Stagholme, Jem and Lasher were fully re-established on the old familiar footing.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a bright moon overhead, and at the end of the avenue beyond the dip where the lake gleamed mysteriously, the gables and solid towers of Stagholme stood peacefully confessed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jem Agar was firmly convinced that England only contained one Stagholme, and perhaps he was right. Six miles from the nearest station, the great house stands self-sufficient, self-contained. The moat, now dry and cultivated, is still traceable, and requires bridging in two places. Surrounded by vast park-like meadowland, where huge trees guard against cutting wind or prying modern journalistic instinct, the house is only approached by a private road.\n\u003c/div\u003e \n\u003cdiv\u003e\n Inside the gates of this road there is something ancient and feudal in the very scent of the air. The tones of the big bell striking the hour over the wide portico die away over the lands that still belong to Stagholme, despite the vicissitudes through which all ancient families run.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jem, however, whose childhood and youth had been passed amidst companions with names as good as his, had learnt long ago to keep his pride to himself. He was Jem Agar, and the family name seemed somehow to belong exclusively to his father still, although that thorough old sportsman had lain for three years and more beneath the quiet turf of the little churchyard within his own park gates.\n\u003c/div\u003e \n\u003cdiv\u003e\n As he pulled up at the door this was thrown open, and within its frame of light he saw the gracious form of his stepmother waiting to welcome him. Behind her, in the shadow, and amidst the decoration of staghorns, ancient pike and hanger, loomed a tall dark figure startlingly in keeping with the semi-monastic architecture of the house. This was Sister Cecilia. She was always thus—behind Mrs. Agar, with clasped hands and a vaguely approving smile, as if Mrs. Agar conferred a benefit upon suffering humanity by the mere act of existing.\n\u003c/div\u003e \n\u003cdiv\u003e\n A slightly bored expression came into Jem\u0027s patient eyes. It was not that he had very much in common with his stepmother, although he had an honest affection for her; but he instinctively disliked Sister Cecilia and all her works. These latter were of the class termed “good.” That is to say, this lady, the spinster daughter of a former rector in the neighbourhood, considered that the earthly livery of a marvellous black bonnet which was almost a cap, and quite hideous, justified a shameless interference in the most intimate affairs of her neighbours, rich and poor.\n\u003c/div\u003e \n\u003cdiv\u003e\n Under the cover of charity she committed a thousand social sins. She constituted herself mother-confessor to all who were weak enough to confide in her or seek her advice, and in soul she was the most arrant time-server who ever flattered a rich woman.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jem distrusted her soft and “holy” ways, more especially her speech, which had the lofty condescension of the saved towards the damned in prospective. In his calmly commanding way he had, months before, forbidden Dora Glynde to kiss Sister Cecilia, because that ostentatiously virtuous person was in the habit of kissing the maids when she met them; and he maintained that this Christian practice, if very estimable theoretically, was socially an insult either to the mistress or the maid.\n\u003c/div\u003e \n\u003cdiv\u003e\n In view of the important changes in his own life which were about to supervene, that is to say, firstly, his departure for India, and secondly, his coming of age before he could hope to return from that land of promise, he had counted on a quiet evening with his mother. Moreover, he was vaguely conscious of the fact that a right-minded person would have carefully abstained from accepting the most pressing invitation to form a third that evening.\n\u003c/div\u003e \n\u003cdiv\u003e\n In view of this Jem Agar had recourse to the last refuge of the simple. He retired within himself, and, so to speak, shut the door. He had dined with these women before, and knew that the conversation would follow its usual mazy course through a forest of cross-questions upon all subjects, and notably upon those intimate matters which were essentially his own business.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sister Cecilia, good mistaken soul that she was, tried her best. She was lively in a Sunday-school-tea style. She was by turns tender and warlike as occasion seemed to demand; but no scrap or tittle of personal information did she extract from Jem, stiffly on guard behind his high collar. Mrs. Agar was excited and failed utterly to follow the wiser footsteps of her bosom friends. She talked such arrant nonsense about India, the Goorkhas, and matters military, that more than once Jem glanced at the imperturbable servants with misgiving.\n\u003c/div\u003e \n\u003cdiv\u003e\n The next day was Sunday, and after morning service Jem eagerly accepted an invitation to have supper at the Rectory after evening church. Sister Cecilia was staying from Saturday till Monday, which alone was sufficient reason for this young soldier to pass his last evening in Stagholme under another than his own historic roof. With her in the house he knew that the chances of serious conversation were small; for she encouraged such topics as the possibility of sending fresh eggs packed in lime to the Goorkhas of his prospective half-company. So Jem retired within himself, and finally left England without having said many things which should have been said between stepmother and son.\n\u003c/div\u003e \n\u003cdiv\u003e\n At the Rectory he found a very different atmosphere—that air of cheerful intellectuality which comes from the presence of cultivated men and women.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Rector held strong views on the rare virtue of minding one\u0027s own business, and in loyalty to such, deemed it right to refrain from mentioning his opinion as to the wisdom of selecting a native branch of the military service for the heir to Stagholme.\n\u003c/div\u003e \n\u003cdiv\u003e\n The supper passed pleasantly enough in the discussion of general topics all bordering on the great question they had at heart. They were like people seeking for each other in the dark around the edge of a pit—the pit being India. Dora, and Dora alone, laughed and treated matters lightly. Mrs. Glynde blundered several times, and stepping backwards over an abyss of years, called the new soldier “darling” more than once. Twice she required helping out by Dora, and on the second occasion something was said which Jem remembered afterwards with a stolid British memory.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jem,” said the girl, buttering a biscuit with a light hand, “you should write a diary. All great men write diaries which their friends publish afterwards.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not think,” replied Jem, with that contempt for the pen which the possession of a new sword ever justifies, “that writing a diary is much in my line.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, you can never tell till you try. Of course it would not be published straight off. Some literary person would be hired to cross the t\u0027s and dot the i\u0027s.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a little pause. Dora glanced at Jem Agar, and something made him say:\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right. I\u0027ll try.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who knows?” said the Rector, with a smile of indulgent affection. “There may be great literary capacity lying dormant in Jem. The worst of a diary is that one may come to look at it in after years, when one finds a very different story has been written from what one intended to write.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh,” said Dora, lightly skipping over the chasm of gravity, “that is Providence. We must blame Providence for these little contretemps. Some one must be blamed, and Providence obviously does not mind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Jem laughed—somewhat lamely; but still it was a laugh. Supper was despatched somehow—as last meals are. Some of us never forget the flavour of those cups of tea gulped down in the gorgeous steamer-saloon while the stewards get the hand luggage on board. It was a late meal on Sunday evening at the Rectory, and the servants soon followed their betters into the drawing-room for prayers.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then the Rector lighted his last cigarette, and Mrs. Glynde began to show symptoms of a patch of pink in either cheek.\n\u003c/div\u003e \n\u003cdiv\u003e\n At last Jem rose—awkwardly—in the midst of a sally from Dora, who seemed afraid to stop speaking.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Must be going,” he said; and he shook hands with the Rector.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Glynde, with nervous deliberation, kissed him and squeezed his hand jerkily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dora—will open the door for you,” she said, with an apprehensive glance towards her husband, who, however, showed no inclination to move from his chair.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dora not only opened the door, but left it open, and walked with him across the lawn towards the stile. When they reached it there was a little pause. He vaulted over and she quietly followed—without his proffered assistance.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then at last Jem spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don\u0027t seem to care!” he said gruffly—with his new voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, don\u0027t!” she whispered imploringly.\n\u003c/div\u003e \n\u003cdiv\u003e\n And they walked on beneath the murmuring trees where the yellow moonlight stole in and out between the trunks. It was not cheerful. For when Nature joins her sadness to the sad libretto of life she usually breaks a heart or two. Fortunately for us we mostly act our tragedies in the wrong scenery—the scenery that was painted for a comedy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don\u0027t understand it,” said the girl at length.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose it is in order to save money for Arthur.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If I don\u0027t, go,” replied Jem, “it will be a question of letting Stagholme.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Dora knew of the ancient horror of such a necessity, handed down from one Agar to another, like a family tradition. Moreover, women seem to respect men who have some simple creed and hold to it simply. Are they not one of our creeds themselves, though by seeking for rights instead of contenting themselves with privileges, some of them try to make atheists of us?\n\u003c/div\u003e \n\u003cdiv\u003e\n “So,” she said nevertheless, “you are being sacrificed to Arthur!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He answered nothing, but he had forgotten for ever Miss Evelina Louisa Barmond.\n\u003c/div\u003e \n\u003cdiv\u003e\n “When do you go?” asked Dora suddenly, with something in her voice which no one had ever heard before. She was startled at it herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n He waited until the soft old church bell finished striking ten, then he answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-morrow!”\n\u003c/div\u003e \n\u003cdiv\u003e\n They had reached the farthest limit of the wood and stood at the park railing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then—,” she paused, and seemed to collect herself as if for a leap; “then good-bye, Jem!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He took the outstretched hand; his large grasp seemed to swallow it up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good-bye!” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n He climbed the rail without agility, paused for a moment, and the moonlight happened to gleam on his face through the gently waving branches as he looked down at her in dumb distress.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then he turned and walked away across the shimmering grass.\n\u003c/div\u003e \n\u003cdiv\u003e\n A few minutes later Dora re-entered the drawing room. Her father and mother were seated close together, closer than she had seen them for years. Mrs. Glynde was pale, with two scarlet patches.\n\u003c/div\u003e \n\u003cdiv\u003e\n Dora collected her belongings, preparatory to going to bed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Jem,” she said quietly, “is absurdly proud of his new honours. It affects his chin, which has gone up exactly one inch.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Then she went to bed.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2871/79425.html","bookId":1177,"creation":"Aug 5, 2019 10:27:13 AM","modification":"Aug 5, 2019 10:27:13 AM"}
