{"id":16214,"no":1,"title":"INTRODUCTION","content":"\u0026nbsp;It is an honour, but, also, a great responsibility, to introduce through the dangerous medium of a translation one of the most distinguished writers of our time, and, probably, the greatest living master of style, to a new world—the world of childhood. One is conscious that it is as impossible to translate the charm and art of Anatole France as it is to describe in dull, colourless words the exquisite perfume of the rose. \n\u003cdiv\u003e\n Such as this translation is I offer it with diffidence, realising that I have undertaken a difficult task. And yet I venture to do so for I long to make known to English and American children one of the loveliest and noblest of stories—a story overflowing with poetic imagination, wisdom and humour, divine qualities to which the heart of the child is always open as the flower to the dew.\n\u003c/div\u003e \n\u003cdiv\u003e\n I want young children as well as others, older only by accident of years, but whose hearts are always young—which is the eternal youth—to know the greatest French writer of his day, when, by the magic of his pen, he, like them, becomes young, gentle and charming. I want them to learn to love his “Honey-Bee,” newest and sweetest of those darlings of childhood who have come down to us from bygone ages, distant lands and half-forgotten races, but who in their eternal charm appeal to all children since children first heard those wonderful stories or pored over treasured books that awaken the ardent young imagination to love, beauty, romance and goodness.\n\u003c/div\u003e \n\u003cdiv\u003e\n So, too, some day will “Honey-Bee” the golden-haired princess of the dear, good dwarfs, join her enchanting companions, Cinderella, Beauty and the Beast, Red Riding Hood, The Sleeping Beauty, The Frog Prince, Puss in Boots, Aladdin, and all the others of that immortal galaxy whose glorious destiny it has been to be beloved by childhood. May they welcome “Honey-Bee,” youngest of all. And so the Master, supreme when he writes for men and women, will find open to him a new world, purer and more beautiful, in the hearts of English and American children.\n\u003c/div\u003e \n\u003cdiv\u003e\n A. E. L.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3033/83841.html","bookId":1061,"creation":"Aug 2, 2019 7:34:44 AM","modification":"Aug 2, 2019 7:34:44 AM"}
