{"id":111734,"no":5,"title":"Page 5","content":"\u003cp\u003eJames dodged as Poppy lobbed a paper back book athim. \"Poppy\"\u003c/p\u003e\n\u003cp\u003e\"You jerk! You snake! How can you dothis to me? You spoiled, selfish, immature-\"\u003c/p\u003e\n\u003cp\u003e\"Shhh! They\u0027re going to hear you \"Let them! Here I am, and I\u0027ve just found out that I\u0027mgoing to die,and all you can think of is playing a joke on me. A stupid, sickjoke. I can\u0027t believethis. Do youthink that\u0027sfunny?\"She ran out of breath to rave with.,James, who had been making quieting motions withhis hands, now gave up and looked toward the door.\u003c/p\u003e\n\u003cp\u003e\"Here comes the nurse,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Good, and I\u0027m going to ask her to throw you out, \"Poppy said. Her anger had collapsed, leaving her neartears. She had never felt so utterly betrayed andabandoned. \"I hate you, you know,\" she said.\u003c/p\u003e\n\u003cp\u003eThe door opened. It was the nurse with the flowered blouse and green scrub pants. \"Is anything the matter here?\" she said, turning on the light. Thenshe saw James. \"Now, let\u0027ssee; you don\u0027t look like family,\" she said. She was smiling, but her voice hadthe ring of authority about to be enforced.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not, and I want him out of here,\" Poppy said.\u003c/p\u003e\n\u003cp\u003eThe nurse fluffed up Poppy\u0027s pillows, put a gentle hand on her forehead. \"Only family members are allowed to stay overnight,\" she said to James.\u003c/p\u003e\n\u003cp\u003ePoppy stared at the TV and waited for James to go.He didn\u0027t. He walked around the bed to stand by the nurse, who looked up at him while she continuedstraightening Poppy\u0027s blankets. Then her hands slowed and stopped moving.\u003c/p\u003e\n\u003cp\u003ePoppy glanced at her sideways in surprise.\u003c/p\u003e\n\u003cp\u003eThe nurse was just staring at James. Hands limpon the blankets, she gazed at him as if she were mesmerized.\u003c/p\u003e\n\u003cp\u003eAnd James was just staring back. With the lighton, Poppy couldseeJames\u0027s face-and again she had that odd feeling of not recognizing him. He was verypale and almost stern looking, as if he were doing something that required an effort. His jaw was tight and his eyes-his eyes were the color of silver. Real silver, shining in the light.\u003c/p\u003e\n\u003cp\u003eFor some reason, Poppy thought of a starvingpanther.\u003c/p\u003e\n\u003cp\u003e\"So you see there\u0027s nothing wrong here,\" Jamessaid to the nurse, as if continuing a conversation they\u0027d been having.\u003c/p\u003e\n\u003cp\u003eThe nurse blinked once, then looked around theroom as if she\u0027d just awakened from a doze. \"No,no; everything\u0027s fine,\" she said.\" Call me if ...\" She looked briefly distracted again, then murmured, \"If, um, you need anything.\"\u003c/p\u003e\n\u003cp\u003eShe walked out. Poppy watched her, forgetting to breathe. Then, slowly, moving only her eyes, she looked at James.\u003c/p\u003e\n\u003cp\u003e\"I know it\u0027s a cliche,\" James said. \"An overuseddemonstration of power. But it gets the job done.\"\u003c/p\u003e\n\u003cp\u003e\"You set this up with her,\" Poppy said in a bare whisper.\u003c/p\u003e\n\u003cp\u003e\"No.\"\u003c/p\u003e\n\u003cp\u003e\"Or else it\u0027s some kind of psychic trick. The Amazing Whatshisname.\"\u003c/p\u003e\n\u003cp\u003e\"No,\"James said, and sat down on an orange plastic chair.\u003c/p\u003e\n\u003cp\u003e\"Then I\u0027m going crazy. \" For the first time that evening Poppy wasn\u0027t thinking about her illness. She couldn\u0027t think properly about anything; her mindwas a whirling, crashing jumble of confusion. She felt like Dorothy\u0027s house after it had been picked up by the tornado.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not crazy. I probably did this the wrongway; I said I didn\u0027t know how to explain it. Look, I know how hard it is for you to believe. My people arrange it that way; they do everything they can to keep humans not believing. Their lives depend on it.\"\u003c/p\u003e\n\u003cp\u003e\"James, I\u0027m sorry; I just---\" Poppy found that herhands were trembling. She shut her eyes. \"Maybe you\u0027d better just-\"\u003c/p\u003e\n\u003cp\u003e\"Poppy, look at me.I\u0027m telling you the truth. I swear it.\" He stared at her face a moment, then let out a breath. \"Okay. I didn\u0027t want to have to do this, but ...\"\u003c/p\u003e\n\u003cp\u003eHe stood, leaning close to Poppy. She refused toflinch, but she could feel her eyes widening.\u003c/p\u003e\n\u003cp\u003e\"Now, look,\" he said, and his lips skinned backfrom his teeth.\u003c/p\u003e\n\u003cp\u003eA simple action-but the effect was astonishing.Transforming. In that instant he changed from the pale but fairly ordinary James of a moment ago-intosomething Poppy had never seen before. A different species of human being.\u003c/p\u003e\n\u003cp\u003eHis eyes flared silver and his entire face took on a predatory look. But Poppy scarcely noticed that; she was staring at his teeth.\u003c/p\u003e\n\u003cp\u003eNot teeth. Fangs. He had canines like a cat\u0027s. Elongated and curving, ending in delicate, piercing points.\u003c/p\u003e\n\u003cp\u003eThey were nothing like the fake vampire fangs soldat novelty stores. They looked very strong and very sharp and very real.\u003c/p\u003e\n\u003cp\u003ePoppy screamed.\u003c/p\u003e\n\u003cp\u003eJames clapped a hand over her mouth. \"We don\u0027twant that nurse back in here.\"\u003c/p\u003e\n\u003cp\u003eWhen he lifted the hand, Poppy said, \"Oh, myGod; oh, my God....\" ,\u003c/p\u003e\n\u003cp\u003e\"All those times whenyousaid I could read yourmind,\" James said. \"Remember? And the times when I heard things you didn\u0027t hear, or moved faster than you could move?\"\u003c/p\u003e\n\u003cp\u003e\"Oh. my God.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s true, Poppy.\" He picked up the orange chairand twisted one of the metal legs out of shape. He did it easily, gracefully. \"We\u0027re stronger than humans,\" he said. He twisted the leg back and put thechair down.\u003c/p\u003e\n\u003cp\u003e\"We see better in the dark. We\u0027re builtfor hunting.\"\u003c/p\u003e\n\u003cp\u003ePoppy finally managed tocapture an entirethought. \"I don\u0027t care what youcan do,\" she saidshrilly. \"You can\u0027t be a vampire. I\u0027ve known yousince you were five years old. And you\u0027ve gottenolder every year, just like me. Explain that.\"\u003c/p\u003e\n\u003cp\u003e\"Everything you know is wrong.\" When she juststared at him, he sighed again and said, \"Everything you think you know about vampires, you\u0027ve picked up from books or TV. And it\u0027s all written by humans, I\u0027ll guarantee that. Nobody in the Night World wouldbreak the code of secrecy.\"\u003c/p\u003e\n\u003cp\u003e\"The Night World. Where\u0027s the Night World?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not a place. It\u0027s like a secret society-for vampires and witches and werewolves. All the best people. And I\u0027ll explain about it later,\" Jamessaidgrimly. \"For now-look, it\u0027s simple. I\u0027m a vampire because my parents are vampires. I was bornthatway. We\u0027re the lamia.\"\u003c/p\u003e\n\u003cp\u003eAll Poppy could think of was Mr. and Mrs. Rasmussen with their luxury ranch-style house and their gold Mercedes. \"Your parents?\"\u003c/p\u003e\n\u003cp\u003e\"Lamia isjust an old word for vampires, but for usit means the ones who\u0027re born that way,\" James said, ignoring her. \"We\u0027re born and we age like humans-except that we can stop aging whenever we want. We breathe. We walk around in the daylight. We can even eat regular food.\"\u003c/p\u003e\n\u003cp\u003e\"Your parents,\" Poppy said again faintly.\u003c/p\u003e\n\u003cp\u003eHe looked at her. \"Yeah. My parents. Look, why doyou think my mom does interior decorating? Not because they need the money. She meets a lot of peoplethat way, and so does my dad, the society shrink. It only takes a few minutes alone with somebody, andthe human never remembers it afterward.\"\u003c/p\u003e\n\u003cp\u003ePoppy shifted uncomfortably. \"So you, um, drinkpeople\u0027s blood, huh?\" Even after everything she\u0027d seen, she couldn\u0027t say it without half-laughing.\u003c/p\u003e\n\u003cp\u003eJames looked at the laces of his Adidas. \"Yes. Yes,I sure do,\" he said softly. Then he looked up andmet her gaze directly.\u003c/p\u003e\n\u003cp\u003eHis eyes were pure silver.\u003c/p\u003e\n\u003cp\u003ePoppy leaned back against the pile of pillows onher bed. Maybe it was easier to believe him because the\u0026nbsp;\u0026nbsp;unbelievable had already happened to her earliertoday. Reality had already been turned upsidedown-so, honestly, what did one more impossibility matter?\u003c/p\u003e\n\u003cp\u003eI\u0027m going to die and my best friend is a bloodsucking monster, she thought.\u003c/p\u003e\n\u003cp\u003eThe argument was over, and she was out of energy. She and James looked at each other in silence.\u003c/p\u003e\n\u003cp\u003e\"Okay,\" she said finally, and it meant everythingshe\u0027d just realized.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t tell you this just to get it off my chest,\"James said, his voice still muted. \"I said I could save you, remember?\"\u003c/p\u003e\n\u003cp\u003e\"Vaguely.\" Poppy blinked slowly, then said moresharply, \"Save me how?\"\u003c/p\u003e\n\u003cp\u003eHis gaze shifted to empty air. \"The way you\u0027rethinking.\"\u003c/p\u003e\n\u003cp\u003e\"Jamie, Ican\u0027tthink anymore.\"\u003c/p\u003e\n\u003cp\u003eGently, without looking at her, he put a hand on her shin under the blanket. He shook her leg slightly, a gesture of affection. \"I\u0027m gonna turn you into a vampire, kid.\"\u003c/p\u003e\n\u003cp\u003ePoppy put both fists to her face and began to cry.\u003c/p\u003e\n\u003cp\u003e\"Hey.\" He let go of her shin and put an awkwardarm around her, pulling her to sit up. \"Don\u0027t do that. It\u0027s okay. It\u0027s better than the alternative.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re . . .freaking . . .crazy,\" Poppy sobbed.Once the tears had started, they flowed too easily she couldn\u0027t stop them. There was comfort in crying, and -in being held by James. He felt strong and reliable and he smelled good.\u003c/p\u003e\n\u003cp\u003e\"You said you had to be born one,\" she addedblurrily, between sobs.\u003c/p\u003e\n\u003cp\u003e\"No, I didn\u0027t. I said I was born one. There areplenty of the other kind around. Made vampires. There would be more, but there\u0027s a law against justmaking any jerk off the street into one.\"\u003c/p\u003e\n\u003cp\u003e\"But I can\u0027t.I\u0027m just what I am; I\u0027m me. Ican\u0027tbe-like that.\"\u003c/p\u003e\n\u003cp\u003eHe put her gently away so he could look into herface. \"Then you\u0027re going to die. You don\u0027t have any other choice. I checked around-even asked a witch.There\u0027s nothing elseinthe Night World to help you.\u003c/p\u003e\n\u003cp\u003eWhat it comes down to is: Do you want to live ornot?\"\u003c/p\u003e\n\u003cp\u003ePoppy\u0027s mind, which had been swamped in confusion again, suddenly fixed on this question. It was like a flash light beam in a pitch-black room.\u003c/p\u003e\n\u003cp\u003eDid she want to live?\u003c/p\u003e\n\u003cp\u003eOh, God, of courseshe did.\u003c/p\u003e\n\u003cp\u003eUntil today she\u0027d assumed it was her unconditional right to live. She hadn\u0027t even been grateful for the privilege. But now she knew it wasn\u0027t something totake for granted-and she also knew it was some thing she\u0027d fight for.\u003c/p\u003e\n\u003cp\u003eWake up, Poppy! This is the voice of reason calling.He says he can save your life.\u003c/p\u003e\n\u003cp\u003e\"Wait a minute. I\u0027ve got to think,\" Poppy saidtightly to James. Her tears had stopped. She pushed him away completely and stared fiercely at the white hospital blanket.\u003c/p\u003e\n\u003cp\u003eOkay. Okay. Now get your head straight, girl.\u003c/p\u003e\n\u003cp\u003eYou knew James had a secret. So you never imagined it was anything like this, so what? He\u0027s still James.\u003c/p\u003e\n\u003cp\u003eHe may be some godawful undead fiend, buthe still cares about you. And there\u0027s nobody else to help you.\u003c/p\u003e\n\u003cp\u003eShe found herself clutching at James\u0027s hand without looking at him. \"What\u0027s it like?\" she said through clenched teeth.\u003c/p\u003e\n\u003cp\u003eSteady and matter-of-fact, he said, \"It\u0027sdifferent. It\u0027s not something I\u0027d recommend if there was another choice, but ...it\u0027s okay. You\u0027ll be sick while your body\u0027s changing, but afterward you\u0027ll never get any kind of disease again.You\u0027llbestrongandquick-and immortal.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d live forever? But would I be able to stop aging?\"She had visions of herself as an immortal crone.\u003c/p\u003e\n\u003cp\u003eHe grimaced. \"Poppy-you\u0027d stop aging now.That\u0027swhat happens to made vampires. Essentially, you\u0027re\u003c/p\u003e\n\u003cp\u003edying as a mortal. You\u0027ll look dead and be unconscious for a while. And then...you\u0027ll wake up.\"\u003c/p\u003e\n\u003cp\u003e\"I see.\" Sort of like Juliet in the tomb, Poppythought. And then she thought, Oh, God...Momand Phil.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s another thing you should know,\" Jameswas saying. \"A certain percentage of people don\u0027t make it.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t make it?\"\u003c/p\u003e\n\u003cp\u003e\"Through the change. People over twenty almost never do. They don\u0027t everwake up. Their bodies can\u0027t adjust to the new form and they burn out. Teenagersusually live through it, but not always.\"\u003c/p\u003e\n\u003cp\u003eOddly enough, this was comforting to Poppy. Aqualified hope seemed more believable than an absolute one. To live, she would have to take a chance.\u003c/p\u003e\n\u003cp\u003eShe looked at James. \"How do you do it?\"\u003c/p\u003e\n\u003cp\u003e\"The traditional way,\" he said with the ghost of asmile. Then, gravely: \"We exchange blood.\"\u003c/p\u003e\n\u003cp\u003eOh, great, Poppy thought. And I was afraid of asimple shot. Now I\u0027m going to have my blood drawn by fangs. She swallowed and blinked,staring atnothing.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s your choice, Poppy. It\u0027s up to you.\"\u003c/p\u003e\n\u003cp\u003eThere was a long pause, and then she said, \"I want to live, Jamie.\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"It\u0027ll mean going away from here.Leaving your parents. They can\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, I was just realizing that. Sort of like gettinga new identity from the FBI, huh?\"\u003c/p\u003e\n\u003cp\u003e\"More than that. You\u0027ll be living in a new world,the Night World. And it\u0027s a lonely world, full of secrets.\u003c/p\u003e\n\u003cp\u003eBut you\u0027ll be walking around in it, instead oflying in the ground.\" He squeezed her hand. Thenhe said very quietly and seriously, \"Do you want tostart now?\"\u003c/p\u003e\n\u003cp\u003eAll Poppy could think of to do was shut her eyesand brace herself the way she did for an injection.\"I\u0027m ready,\" she said through stiff lips.\u003c/p\u003e\n\u003cp\u003eJames laughed again-this time as if he couldn\u0027thelp it. Then he folded the bed rail down and settled beside her. \"I\u0027m used to people being hypnotized when I do this. It\u0027s weird to have you awake.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah, well, if I scream you can hypnotize me,\"Poppy said, not opening her eyes.\u003c/p\u003e\n\u003cp\u003eRelax, she told herself firmly. No matter how muchit hurts, no matter how awful it is, you can deal with it.\u003c/p\u003e\n\u003cp\u003eYou haveto. Your life depends on it.\u003c/p\u003e\n\u003cp\u003eHer heart was thumping hard enough to shake her body.\u003c/p\u003e\n\u003cp\u003e\"Right here,\" James said, touching her throat with cool fingers as if feeling for a pulse.\u003c/p\u003e\n\u003cp\u003eJust do it, Poppy thought. Get it over with.\u003c/p\u003e\n\u003cp\u003eShe could feel warmth as James leaned close toher, taking her carefully by the shoulders. Every nerve ending in her skin was aware of him. Then she felt cool breath on her throat, and quickly, before she could recoil, a double sting.\u003c/p\u003e\n\u003cp\u003eThose fangs, burying themselves in her flesh. Making two little wounds so he could drink her blood... Now it\u0027s reallygoing to hurt, Poppy thought. Shecouldn\u0027t brace herself anymore. Her life was in the hands of a hunter. She was a rabbit trapped in thecoils of a snake, a mouse under the claws of a cat. She didn\u0027t feel like James\u0027s best friend, she felt like lunch....\u003c/p\u003e\n\u003cp\u003ePoppy, what are you doing? Don\u0027t fight it. It hurts whenyou resist.\u003c/p\u003e\n\u003cp\u003eJames was speaking to her-but the warm mouthon her throat hadn\u0027t moved. The voice was in her head.\u003c/p\u003e\n\u003cp\u003eI\u0027m not resisting, Poppy thought. I\u0027m just ready forit to hurt, that\u0027s all.\u003c/p\u003e\n\u003cp\u003eThere was a burning where his teeth pierced her.She waited for it to get worse-but it didn\u0027t.It changed.\u003c/p\u003e\n\u003cp\u003eOh, Poppy thought.\u003c/p\u003e\n\u003cp\u003eThe feeling of heat was actually pleasant. A sensation of release, of giving.\u003c/p\u003e\n\u003cp\u003eAnd closeness. She and James were getting closerand loser, like two drops of water moving together until they merged.\u003c/p\u003e\n\u003cp\u003eShe could sense James\u0027s mind. His thoughts-andhis feelings. His emotions flowed into her, throughher. Tenderness...concern... caring. A cold black\u003c/p\u003e\n\u003cp\u003erage at the disease that was threatening her. Despair that there was no other way to help her. And long ing-longing to share with her, to make her happy.\u003c/p\u003e\n\u003cp\u003eYes, Poppy thought.\u003c/p\u003e\n\u003cp\u003eA wave of sweetness made her dizzy. She foundherself groping for James\u0027shand, their fingers intertwining.\u003c/p\u003e\n\u003cp\u003eJames,she thought with wonder and joy. Her communication to him a tentative caress.\u003c/p\u003e\n\u003cp\u003ePoppy.She could feel his own surprise and delight.\u003c/p\u003e\n\u003cp\u003eAnd all the time the dreamy pleasure was building.Making Poppy shiver with its intensity.\u003c/p\u003e\n\u003cp\u003eHow could I have been so stupid? Poppy thought. To be afraid of this. It isn\u0027t terrible. It\u0027s.. . . right. She had never been so close to anybody. It was as if they were one being, together, not predator and prey, but partners in a dance. Poppy-and-James.\u003c/p\u003e\n\u003cp\u003eShe could touch his soul.\u003c/p\u003e\n\u003cp\u003eStrangely enough, he was afraid of that. She couldsense it. Poppy,don\u0027t-so many dark things-I don\u0027t want you to see ...\u003c/p\u003e\n\u003cp\u003eDark, yes, Poppy thought. But not dark and terrible. Dark and lonely. Such utter loneliness. A feeling of not belonging in either of the two worlds he knew.Not belonging anywhere. Except ...\u003c/p\u003e\n\u003cp\u003eSuddenly Poppy was seeing an image of herself. Inhis mind she was fragile and graceful, an emeraldeyed spirit of the air. A sylph-with a core of puresteel.\u003c/p\u003e\n\u003cp\u003eI\u0027m not really like that, she thought. I\u0027m not talland beautiful like Jacklyn or Michaela....\u003c/p\u003e\n\u003cp\u003eThe words she heard in answer didn\u0027t seem directed toward her-she had the feeling they were something James was thinking to himself, or remembering from some long-forgotten book.\u003c/p\u003e\n\u003cp\u003eYou don\u0027t love a girl because of beauty. You love her because she sings a song only you can understand....\u003c/p\u003e\n\u003cp\u003eWith the thought came a strong feeling of protectiveness. So this was how James felt about her-she knew at last. As if she were something precious,something to be protected at all costs....\u003c/p\u003e\n\u003cp\u003eAt all costs. No matter what happened to him.Poppy tried to follow the thought deeper into hismind, to find out what it meant. She got an impression of rules-no, laws ...\u003c/p\u003e\n\u003cp\u003ePoppy, it\u0027s bad manners to search somebody\u0027s mind when you\u0027re not invited.The words were tinged with desperation.\u003c/p\u003e\n\u003cp\u003ePoppy pulled back mentally. She hadn\u0027t meant topry. She just wanted to help....\u003c/p\u003e\n\u003cp\u003eI know,James\u0027s thought came to her, and with ita rush of warmth and gratitude. Poppy relaxed and simply enjoyed the feeling of oneness with him.\u003c/p\u003e\n\u003cp\u003eI wish it could last forever, she thought-and justthen it stopped. The warmth at her neck disappeared, and James pulled away, straightening.\u003c/p\u003e\n\u003cp\u003ePoppy made a sound of protest and tried to draghim back. He wouldn\u0027t let her.\u003c/p\u003e\n\u003cp\u003e\"No-there\u0027s something else we have to do,\" hewhispered. But he didn\u0027t do anything else. He just held her, his lips against her forehead. Poppy feltpeaceful and languid.\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t tell me it would be like that,\" she said.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know,\" James said simply. \"It never hasbeen before.\"\u003c/p\u003e\n\u003cp\u003eThey sat together quietly, with James gently stroking her hair.\u003c/p\u003e\n\u003cp\u003eSo strange, Poppy thought. Everything is thesame-but everything\u0027s different. It was as if she\u0027d pulled herself up on dry land after almost drowningin the ocean. The terror that had been pounding inside her all day was gone, and for the first time inher life she felt completely safe.\u003c/p\u003e\n\u003cp\u003eAfter another minute or so James shook his head,rousing himself.\u003c/p\u003e\n\u003cp\u003e\"What else do we have to do?\" Poppy asked.\u003c/p\u003e\n\u003cp\u003eFor an answer, James lifted his own wrist to hismouth. He made a quick jerking motion with hishead, as if tearing a strip of cloth held in his teeth.\u003c/p\u003e\n\u003cp\u003eWhen he lowered the wrist, Poppy saw blood.\u003c/p\u003e\n\u003cp\u003eIt was running in a little stream down his arm. So red it almost didn\u0027t look real.\u003c/p\u003e\n\u003cp\u003ePoppy gulped and shook her head.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not that bad,\" James said softly. \"And you have to do it. Without my blood in you, you won\u0027t become a vampire when you die, you\u0027ll just die.Likeany other human victim.\"\u003c/p\u003e\n\u003cp\u003eAnd I want to live, Poppy thought. All right, then.Shutting her eyes, she allowed James to guide her head to his wrist.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t taste like blood, or at least not like theblood she\u0027d tasted when she bit her tongue or put a cut finger in her mouth. It tasted--strange. Richand potent.\u003c/p\u003e\n\u003cp\u003eLike some magic elixir, Poppy thoughtdizzily.Andonce again she felt the touch of James\u0027s mind. Intoxi cated with the closeness, she kept drinking.\u003c/p\u003e\n\u003cp\u003eThat\u0027s right. You\u0027ve got to take a lot,James told her.But his mental voice was weaker than it had been.\u003c/p\u003e\n\u003cp\u003eInstantly Poppy felt a surge of alarm.\u003c/p\u003e\n\u003cp\u003eBut what will it do to you?\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be all right,\" James said aloud. \"It\u0027s you I\u0027mworried about. If you don\u0027t get enough, you\u0027ll bein danger.\"\u003c/p\u003e\n\u003cp\u003eWell, he was the expert. And Poppy was happy tolet the strange, heady potion keep flowing into her.\u003c/p\u003e\n\u003cp\u003eShe basked in the glow that seemed to be lighting herfrom the inside out. She felt so tranquil, so calm.... And then, without warning, the calm was shattered. A voice broke into it, a voice full of harshsurprise.\u003c/p\u003e\n\u003cp\u003e\"What are you doing?\" the voice said, and Poppylooked up to see Phillip in the doorway. \u003c/p\u003e","sourceLink":"https://allnovel.net/night-world-secret-vampire-night-world-1/page-5.html","bookId":2076,"creation":"Oct 6, 2019 12:34:35 AM","modification":"Oct 6, 2019 12:34:35 AM"}
