{"id":100931,"no":2,"title":"Page 2","content":"\u003cp\u003eThe following morning I ran full throttle to Armstrong Travel, arriving before the agency opened. I heard keys rattling and heels clicking behind me. It was Janice Armstrong, the owner.\u003c/p\u003e\n\u003cp\u003e\"Where is Ruby?\" I asked breathlessly.\u003c/p\u003e\n\u003cp\u003e\"She doesn\u0027t come in on Tuesdays until the afternoon,\" she answered, opening the door.\u003c/p\u003e\n\u003cp\u003e\"The afternoon?\" I groaned.\u003c/p\u003e\n\u003cp\u003e\"By the way,\" she said, moving close, \"do you know anything about Alexander\u0027s butler?\" \"Creepy Man?\" I asked. \"I mean, Jameson?\"\u003c/p\u003e\n\u003cp\u003e\"They were supposed to have a date,\" she confessed, switching on the office lights and adjusting the thermostat.\u003c/p\u003e\n\u003cp\u003e\"How was it?\" I asked naively.\u003c/p\u003e\n\u003cp\u003eJanice put her purse in her top drawer, turned on her computer, and looked at me.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you already know? He didn\u0027t show,\" she said. \"And with a stunner like Ruby he was lucky she even looked in his direction!\"\u003c/p\u003e\n\u003cp\u003e\"Did he say why he canceled?\" I pressed.\u003c/p\u003e\n\u003cp\u003e\"No. I thought Alexander would have told you,\" she said.\u003c/p\u003e\n\u003cp\u003e\"Not directly.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"A good man is hard to find, you know. But you have Alexander.\"\u003c/p\u003e\n\u003cp\u003eI bit my black lip.\u003c/p\u003e\n\u003cp\u003e\"Hey, aren\u0027t you late for school?\" she inquired, looking up at the Armstrong Travel clock.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m always late! Janice, can you give me Ruby\u0027s address?\"\u003c/p\u003e\n\u003cp\u003e\"Why don\u0027t you stop back at the end of the day?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s just that she left her compact--\"\u003c/p\u003e\n\u003cp\u003e\"You can leave it here,\" Janice suggested.\u003c/p\u003e\n\u003cp\u003eThe front door opened and in walked Ruby.\u003c/p\u003e\n\u003cp\u003eI imagined a jaded woman in jeans holding a cigarette and a beer, but even being jilted, Ruby was in style. She was wearing full makeup and a white sweater and matching tight white slacks. \"You\u0027re in early today,\" Janice said.\u003c/p\u003e\n\u003cp\u003e\"I have a lot to catch up on,\" Ruby replied with a sigh. \"What are you doing here?\" she asked, surprised to see me.\u003c/p\u003e\n\u003cp\u003e\"I have something of yours.\"\u003c/p\u003e\n\u003cp\u003e\"If you are here on behalf of Jameson,\" she said, \"you can tell him I\u0027m sorry I had to cancel.\"\u003c/p\u003e\n\u003cp\u003e\"You? But he was--\" I began.\u003c/p\u003e\n\u003cp\u003eRuby settled in at her desk and turned on her computer, accidentally knocking over her cup of pens.\u003c/p\u003e\n\u003cp\u003e\"Darn it!\" she exclaimed, agitated, trying to grab the pens as they fell to the floor.\u003c/p\u003e\n\u003cp\u003eJanice and I raced over to help her pick them up.\u003c/p\u003e\n\u003cp\u003e\"This has never happened before!\" Ruby said angrily. \"Now everyone will know.\"\u003c/p\u003e\n\u003cp\u003e\"I knock things over all the time,\" I comforted.\u003c/p\u003e\n\u003cp\u003e\"No, she means about Jameson,\" Janice whispered to me. \"I got stood up several times before I met my Joe. But I must admit I\u0027m surprised about the butler. It was doubly rude, since we came to the party to support the Sterling family.\" Janice glared at me as if Jameson\u0027s no-show was my fault. \"I feel as though he stood me up, too.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not the biggest deal,\" Ruby said. \"Anyway, he\u0027s more...shall I say, eccentric than I am.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a fool,\" Janice said.\u003c/p\u003e\n\u003cp\u003e\"This really surprises me. He was such a gentleman,\" Ruby lamented. \"And that accent. I guess that\u0027s why I was taken by him.\"\u003c/p\u003e\n\u003cp\u003e\"He likes you, too,\" I said. \"Only--\" Both women looked at me as if I were going to reveal national secrets.\u003c/p\u003e\n\u003cp\u003e\"Only what?\" Janice asked.\u003c/p\u003e\n\u003cp\u003e\"Only...that he should have called.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re darn right! I hope you haven\u0027t told anyone about this,\" Ruby said worriedly. \"In a small town like this, being stood up could ruin my reputation.\"\u003c/p\u003e\n\u003cp\u003e\"You must know something, Raven,\" Janice pried.\u003c/p\u003e\n\u003cp\u003e\"Yes, did Alexander allude to anything?\" Ruby asked.\u003c/p\u003e\n\u003cp\u003eI had to console my former boss. After all, I was the one who caused Jameson to abandon their date. I couldn\u0027t let Ruby take it personally.\u003c/p\u003e\n\u003cp\u003e\"Just that the reason he canceled had nothing to do with you,\" I said evasively.\u003c/p\u003e\n\u003cp\u003e\"I bet he has a girlfriend,\" Ruby speculated. \"I read in Cosmo--\"\u003c/p\u003e\n\u003cp\u003e\"Of course he doesn\u0027t!\" I exclaimed with a laugh. \"But I need to know something as well. Did Jameson have a trip planned?\"\u003c/p\u003e\n\u003cp\u003e\"Do you know something I don\u0027t?\"\u003c/p\u003e\n\u003cp\u003e\"Did he buy any airline tickets? Or come in asking for any road maps?\" I hinted.\u003c/p\u003e\n\u003cp\u003e\"What aren\u0027t you telling us?\"\u003c/p\u003e\n\u003cp\u003eRuby and Janice stared at me hard. I wasn\u0027t about to tell them the truth--that Alexander didn\u0027t reflect in her compact.\u003c/p\u003e\n\u003cp\u003eRuby\u0027s compact! I almost forgot. I began to pull it out from my purse when a man dressed in chinos and a red polo shirt entered the office with a grand bouquet. Distracted, I replaced the compact and zipped up my purse.\u003c/p\u003e\n\u003cp\u003e\"Ruby White?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m Ruby,\" she said, her hand waving in the air like she\u0027d just won the coverall at bingo.\u003c/p\u003e\n\u003cp\u003eHe handed Ruby a bouquet of white roses. She blushed as she took the flowers.\u003c/p\u003e\n\u003cp\u003eFlowers for Ruby? They could have been sent from any number of Dullsvillian suitors.\u003c/p\u003e\n\u003cp\u003e\"What does the card say?\" Janice asked eagerly. \"I wonder if they\u0027re from Kyle the golf pro.\"\u003c/p\u003e\n\u003cp\u003e\" \u0027I\u0027m sorry these had to greet you instead of me,\u0027\" Ruby read. She looked up in astonishment. \"\u0027Fondly, Jameson.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Jameson?\" I asked, suddenly wide-eyed.\u003c/p\u003e\n\u003cp\u003e\"How sweet!\" Janice said, filling a glass vase from the watercooler. \"I told you all along he was wonderful.\"\u003c/p\u003e\n\u003cp\u003e\"Can you believe this?\" Ruby wondered aloud, holding the bouquet close.\u003c/p\u003e\n\u003cp\u003e\"What else does it say?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t that enough?\" Janice said, inhaling the scent and placing the flowers in the vase. \"They\u0027re beautiful!\"\u003c/p\u003e\n\u003cp\u003e\"No info on where the order was placed from?\" I inquired.\u003c/p\u003e\n\u003cp\u003eRuby shook her head, distracted.\u003c/p\u003e\n\u003cp\u003e\"But there has to be--\" I mumbled. I looked out the window and saw the deliveryman stepping into a white van with the words FLOWER POWER spelled out in daisies. I raced out the door as the van began to drive off.\u003c/p\u003e\n\u003cp\u003e\"Wait!\" I called, running hard in my combat boots. \"You forgot something!\"\u003c/p\u003e\n\u003cp\u003eBut it was too late. The van sped around the corner.\u003c/p\u003e\n\u003cp\u003eBreathless and frustrated, I retreated back to the travel agency. I began to open the door when I noticed a piece of paper lying on the sidewalk. It was a Flower Power delivery order. It must have fallen out of the van. I quickly grabbed it, scanning the document for any vital info. The travel agency address was fully disclosed. But the sender\u0027s address was blank. No name. No e-mail. Nothing.\u003c/p\u003e\n\u003cp\u003eThen, hidden in the right-hand corner, I noticed a ten-digit number.\u003c/p\u003e\n\u003cp\u003e\"Can I use your phone, Ruby?\" I asked, running inside. \"I\u0027ll only be a minute.\"\u003c/p\u003e\n\u003cp\u003e\"Of course,\" she said, arranging the roses. At that moment, I could have called Africa and she wouldn\u0027t have cared.\u003c/p\u003e\n\u003cp\u003eThe area code seemed oddly familiar. I racked my brain. It belonged to a town a couple hundred miles away, where my aunt Libby lived.\u003c/p\u003e\n\u003cp\u003eI dialed. Would Alexander\u0027s voice greet me? Ring. Or Creepy Man\u0027s? Ring. Or would it be a dead end? Ring.\u003c/p\u003e\n\u003cp\u003e\"Thank you for calling the Coffin Club,\" a zombie-like voice finally answered. \"Our business hours are nightly from sunset to sunrise. Leave a message--if you dare!\"\u003c/p\u003e\n\u003cp\u003eI let the phone slip from my hand. Ruby was still arranging her flowers.\u003c/p\u003e\n\u003cp\u003e\"Good goth!\" I whispered. \"The Coffin Club!\" \u003c/p\u003e","sourceLink":"https://allnovel.net/kissing-coffins-vampire-kisses-2/page-2.html","bookId":1867,"creation":"Oct 5, 2019 9:51:25 PM","modification":"Oct 5, 2019 9:51:25 PM"}
