{"id":82378,"no":9,"title":"Page 9","content":"\u003cp\u003eAunt Libby and I sat together on a wooden bench outside the Greyhound bus station waiting for the eight o\u0027clock to pull in. There was only one bus each day out of Hipsterville, and it departed just as the sun was setting.\u003c/p\u003e\n\u003cp\u003eI looked forward to returning to Dullsville and hopefully Alexander, but I was sad to leave Aunt Libby. I enjoyed our visit together, and I really admired her. She had followed her dream of being an actress and in the process lived independently, with her own style, tastes, and view of life. She saw me as unique and special, instead of as a freak. And most important, she treated me like I was normal.\u003c/p\u003e\n\u003cp\u003eI\u0027d also miss the excitement of Hipsterville, knowing there was a place like the Coffin Club for goths to hang out and dance, and Hipsterville\u0027s Hot Gothics--a store where I could purchase gothic clothes, spiked jewelry, and body tattoos.\u003c/p\u003e\n\u003cp\u003eLibby put her arm around me, and I leaned my head on her shoulder as the bus pulled in.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to miss you so much, Aunt Libby,\" I said, squeezing her with all my might before I climbed aboard the bus.\u003c/p\u003e\n\u003cp\u003eAs I walked down the aisle, I opened my compact to check the other travelers. After everyone reflected back, even a gothic couple snuggling in back, I chose a seat next to the window. Aunt Libby waved to me as we waited for the bus to leave. I could see in her eyes that she would miss me as much as I\u0027d miss her. She kept waving as the bus drove off. But as soon as the station was out of sight, I breathed a sigh of relief. The nefarious, mysterious, feud-seeking shock-goth Jagger was now behind me. Hopefully, a new plan to contact my handsome Gothic Prince Alexander was before me.\u003c/p\u003e\n\u003cp\u003eThe bus ride back to Dullsville was painfully long. I called Becky from my cell phone, but she was at the movies with Matt. I jotted notes about my encounter with Jagger in my Olivia Outcast journal, but writing gave me motion sickness. I imagined why Jagger was searching for Alexander--maybe it was a feud between the two families over the baroness\u0027s Mansion--but it only made me worry about my boyfriend. I dreamed about reuniting with Alexander, but I also couldn\u0027t stop thinking about the maps Jagger had lying on his floor.\u003c/p\u003e\n\u003cp\u003eIt seemed like an eternity until the bus finally pulled into Dullsville\u0027s bus stop. I even hoped against hope that Alexander would magically be waiting for me, but instead I was greeted by Mom, Dad, Billy Boy, and his nerd-mate Henry.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re leaving already?\" my dad asked after we arrived back home and I dropped my suitcase off in my room. \"We want to hear more about your trip.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t have time for my parents\u0027 well-meaning questions. \"How did you like Aunt Libby? What did you think of her performance in Dracula? Did you like eating tofu sandwiches?\"\u003c/p\u003e\n\u003cp\u003eI wanted to go to the place where I did my best thinking.\u003c/p\u003e\n\u003cp\u003e\"I have to see Alexander!\" I said, shutting the front door behind me. I raced to the Mansion and found the iron gate ajar. Out of breath, I hurried up the long, winding driveway and noticed something peculiar--the front door was also ajar.\u003c/p\u003e\n\u003cp\u003eMaybe he\u0027d seen me from the manor house attic window and followed me back to Dullsville.\u003c/p\u003e\n\u003cp\u003e\"Alexander?\" I called as I walked inside.\u003c/p\u003e\n\u003cp\u003eThe entranceway, living room, and dining room were as I\u0027d last seen them, covered and empty of paintings.\u003c/p\u003e\n\u003cp\u003e\"Alexander?\" I called, walking up the grand staircase. My heart beat wildly with each step.\u003c/p\u003e\n\u003cp\u003eI whisked through the second floor and up Alexander\u0027s attic steps. I reached his bedroom. I could barely breathe. I gently knocked on his door. \"Alexander, it\u0027s me, Raven.\"\u003c/p\u003e\n\u003cp\u003eNo one responded.\u003c/p\u003e\n\u003cp\u003eI turned the knob and opened the door. This room also looked like I\u0027d last seen it, bare except for a few remaining items. But on his unmade bed lay a backpack. He had come back.\u003c/p\u003e\n\u003cp\u003eI picked up the rustic black bag and hugged it. I knew it would be rude to look through the backpack, especially if Alexander suddenly walked into the room. But I couldn\u0027t help it.\u003c/p\u003e\n\u003cp\u003eI set it back on the bed and began to unzip it when I heard a noise coming from the backyard.\u003c/p\u003e\n\u003cp\u003eI looked outside his attic window and saw a candle flickering in the gazebo. A bat was hovering above the roof.\u003c/p\u003e\n\u003cp\u003eI took off, bolting out of his room, down the attic stairs, around the second floor, and down the never-ending staircase.\u003c/p\u003e\n\u003cp\u003eI flew out the front door and raced around to the backyard. \"Alexander!\" I called, and ran into the darkened gazebo, barely able to make out his features in the shadows.\u003c/p\u003e\n\u003cp\u003eThen the candlelight flickered. I saw his eyes first. One green and one blue, before he stepped fully into the moonlight.\u003c/p\u003e\n\u003cp\u003eI tried to run, but it was too late. Jagger\u0027s gaze had already begun to make me dizzy. \u003c/p\u003e","sourceLink":"https://allnovel.net/kissing-coffins-vampire-kisses-2/page-9.html","bookId":1867,"creation":"Oct 5, 2019 4:44:26 PM","modification":"Oct 5, 2019 4:44:26 PM"}
