{"id":6864,"no":3,"title":"3 THE VISITORS","content":"I hastily pocketed Gibarian\u0027s notes and went over to the locker. Work-suits and clothes hadbeen pushed to one side as though someone had hidden himself at the back. On the floor I sawthe corner of an envelope sticking out from a heap of papers and picked it up. It was addressedto me. Dry-mouthed with apprehension, I tore it open; I had to force myself to unfold the noteinside.\n\u003cbr\u003e \n\u003cbr\u003e In his even handwriting, small but perfectly legible, Gibarian had written two lines:\n\u003cbr\u003e \n\u003cbr\u003e Supplement Dir. Solar. Vol 1.: Vot. Separat.\n\u003cbr\u003e \n\u003cbr\u003e Messenger ds aff. F.; Ravintzer: The Little Apocrypha.\n\u003cbr\u003e \n\u003cbr\u003e That was all, not another word. Did these two lines contain some vital piece of information?\n\u003cbr\u003e \n\u003cbr\u003e When had he written them? I told myself that the first thing to do was to consult the libraryindex. I knew the supplement to the first volume of the annual of Solarist studies; or rather,without having read it, I knew of its existence—but was it not a document of purely historicalinterest? As for Ravintzer and The Little Apocrypha, I had never heard of them.\n\u003cbr\u003e \n\u003cbr\u003e What next?\n\u003cbr\u003e \n\u003cbr\u003e I was already a quarter of an hour late for my meeting with Snow. With my back to the door, Ilooked the room over carefully once more. Only then did I notice the bed standing up againstthe wall, half concealed by a large map of Solaris. Something was hanging down behind themap; it was a pocket tape-recorder, and I noted that nine tenths of the tape had been used. Itook the machine out of its case (which I hung back where I had found it) and slipped it intomy pocket.\n\u003cbr\u003e \n\u003cbr\u003e Before leaving, I listened intently with my eyes closed. There was no sound from outside. Iopened the door on to a yawning gulf of darkness—until it occurred to me to remove my darkglasses. The dome was feebly lit by the glowing filaments in the ceiling.\n\u003cbr\u003e \n\u003cbr\u003e A number of corridors spread out in a star-shaped pattern between the four doors of thesleeping quarters and the narrow passage leading to the radio-cabin. Suddenly, looming up inthe opening which led to the communal bathroom, a tall silhouette appeared, barelydistinguishable in the surrounding gloom. I stood stock still, frozen to the spot. A giant Negresswas coming silently towards me with a smooth, rolling gait. I caught a gleam from the whitesof her eyes and heard the soft slapping of her bare feet. She was wearing nothing but a yellowskirt of plaited straw; her enormous breasts swung freely and her black arms were as thick asthighs. Less than a yard separated us as she passed me, but she did not give me so much as aglance. She went on her way, her grass skirt swinging rhythmically, resembling one of thosesteatopygous statues in anthropological museums. She opened Gibarian\u0027s door and on thethreshold her silhouette stood out distinctly against the bright light from inside the room. Thenshe closed the door behind her and I was alone.\n\u003cbr\u003e \n\u003cbr\u003e Terror-stricken, I stared blankly round the big, empty hall. What had happened? What had Iseen? Suddenly, my mind reeled as I recalled Snow\u0027s warnings. Who was this monstrousAphrodite? I took a step, a single pace, in the direction of Gibarian\u0027s room, but I knew perfectlywell that I would not go in.\n\u003cbr\u003e \n\u003cbr\u003e I do not know how long I remained leaning against the cool metal wall, hearing nothing exceptthe distant, monotonous whine of the air-conditioners. Eventually I pulled myself together andmade my way to the radio-cabin. As I pressed down the door handle, I heard a harsh voice:\n\u003cbr\u003e \n\u003cbr\u003e \"Who\u0027s there?\"\"It\u0027s me, Kelvin.\"Snow was seated at a table between a pile of aluminum crates and the transmitter, eating meatconcentrate straight out of a tin. Did he then never leave the place? Dazedly, I watched himchewing until I realized that I, too, was famished. I went to a cupboard, selected the least dustyplate I could find, and sat down opposite Snow. We ate in silence.\n\u003cbr\u003e \n\u003cbr\u003e Snow got up, uncorked a vacuum flask and filled two tumblers with clear, hot soup. Then heput the flask down on the floor; there was no room on the table.\n\u003cbr\u003e \n\u003cbr\u003e \"Have you seen Sartorius?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"No. Where is he?\"\"Upstairs.\"Upstairs: that meant the laboratory. We finished our meal without exchanging another word,Snow dutifully scraping the bottom of his tin. The outer shutter was in place over the windowand reflections from the four ceiling lights gleamed on the laminated surface of the transmitter.\n\u003cbr\u003e \n\u003cbr\u003e Snow had put on a loose black sweater, frayed at the wrists. The taut skin over his cheekboneswas marbled with tiny blood-vessels.\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s the matter?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Nothing, why?\"\"You\u0027re pouring with sweat.\"I wiped my forehead. It was true, I was dripping wet; it must have been reaction, after myunexpected encounter. Snow gave me a questioning glance. Should I tell him? If only he hadtaken me into his confidence…What incomprehensible game was being played here, and whowas whose enemy?\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s hot. I should have expected your air-conditioning to work better than this!\"\"It adjusts itself automatically every hour.\" He looked at me closely. \"Are you sure it\u0027s only theheat?\"I did not answer. He tossed the utensils and the empty tins into the sink, returned to hisarmchair and went on with his interrogation.\n\u003cbr\u003e \n\u003cbr\u003e \"What are your plans?\"\"That depends on you,\" I answered coolly. \"I suppose you have a research programme? A newstimulus, X-rays, that sort of thing…\"He frowned.\n\u003cbr\u003e \n\u003cbr\u003e \"X-rays? Who\u0027s been talking to you about that?\"\"I don\u0027t remember. Someone dropped a hint—on the Prometheus perhaps. Why, have youbegun?\"\"I don\u0027t know the details, it was an idea of Gibarian\u0027s. He and Sartorius set it up together. Iwonder how you could have heard of it.\"I shrugged my shoulders.\n\u003cbr\u003e \n\u003cbr\u003e \"Funny that you shouldn\u0027t know the details. You ought to, since you\u0027re the one who…\"I left the sentence unfinished; Snow said nothing.\n\u003cbr\u003e \n\u003cbr\u003e The whining of the air-conditioners had stopped. The temperature stayed at a bearable level,but a high-pitched drone persisted, like the buzzing of a dying insect.\n\u003cbr\u003e \n\u003cbr\u003e Snow got up from his chair and leaned over the console of the transmitter. He began to pressknobs at random, and to no effect, since he had left the activating switch off. He went onfidgeting with them for a moment, then he remarked:\n\u003cbr\u003e \n\u003cbr\u003e \"There are certain formalities to be dealt with concerning…\"\"Yes?\" I prompted, to his back.\n\u003cbr\u003e \n\u003cbr\u003e He turned round and gave me a hostile look. Involuntarily, I had annoyed him; but ignorant ofthe role he was playing. I could only wait and see. His Adam\u0027s apple rose and fell inside thecollar of his sweater:\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027ve been into Gibarian\u0027s room,\" he blurted out accusingly.\n\u003cbr\u003e \n\u003cbr\u003e I looked at him calmly.\n\u003cbr\u003e \n\u003cbr\u003e \"You have been in there, haven\u0027t you?\"\"If you say so…\"\"Was there anyone there?\"So he had seen her, or, at least, knew of her existence!\n\u003cbr\u003e \n\u003cbr\u003e \"No, no one. Who could there have been?\"\"Why didn\u0027t you let me in, then?\"\"Because I was afraid. I thought of your warnings and when the handle moved, I automaticallyhung on to it. Why didn\u0027t you say it was you? I would have let you in.\"\"I thought it was Sartorius,\" he answered, in a faltering voice.\n\u003cbr\u003e \n\u003cbr\u003e \"And suppose it had been?\"Once again, he parried my question with one of his own.\n\u003cbr\u003e \n\u003cbr\u003e \"What do you think happened in there?\"I hesitated.\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027re the one who should know. Where is he?\"\"Gibarian? In the cold store. We took him there straight away this morning, after we\u0027d foundhim in the locker.\"\"The locker? Was he dead?\"\"His heart was still beating, but he had stopped breathing.\"\"Did you try resuscitation?\"\"No.\"\"Why not?\"\"I didn\u0027t have the chance,\" he mumbled. \"By the time I\u0027d moved him, he was dead.\"Snow picked up a sheet of paper from the fitted desk in the corner and held it out to me.\n\u003cbr\u003e \n\u003cbr\u003e \"I have drafted a post-mortem report. I\u0027m not sorry you\u0027ve seen the room, as a matter of fact.\n\u003cbr\u003e \n\u003cbr\u003e Cause of death—pernostal injection, lethal dose. It\u0027s all here…\"I ran my eyes over the paper, and murmured:\n\u003cbr\u003e \n\u003cbr\u003e \"Suicide? For what reason?\"\"Nervous troubles, depression, call it what you like. You know more about that sort of thingthan I do.\"I was still seated; Snow was standing over me.\n\u003cbr\u003e \n\u003cbr\u003e Looking him in the eye, I said:\n\u003cbr\u003e \n\u003cbr\u003e \"I only know what I\u0027ve seen for myself.\"\"What are you trying to say?\" he asked calmly.\n\u003cbr\u003e \n\u003cbr\u003e \"He injected himself with pernostal and hid in the locker, right? In that case, it\u0027s not a questionof nervous troubles or a fit of depression, but of a very serious paranoid condition.\" Speakingmore and more deliberately and continuing to look him in the eyes, I added: \"What is certain isthat he thought he saw something.\"Snow began fiddling with the transmitter again.\n\u003cbr\u003e \n\u003cbr\u003e After a moment\u0027s silence, I went on.\n\u003cbr\u003e \n\u003cbr\u003e \"Your signature\u0027s here. What about Sartorius\u0027s?\"\"As I told you, he\u0027s in the laboratory. He never shows his face. I suppose he\u0027s…\"\"What?\"\"Locked himself in.\"\"Locked himself in? I see…you mean he\u0027s barricaded himself in?\"\"Possibly.\"\"Snow, there\u0027s someone on the Station. Someone apart from us.\"He had stopped playing with the knobs and was leaning sideways, staring at me.\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027ve seen it!\"\"You warned me. Against what? Against whom? An hallucination?\"\"What did you see?\"\"Shall we say…a human being?\"He remained silent. Turning his back as though to hide his face from me, he tapped the metalplating with his finger-tips. I looked at his hands; there was no longer any trace of bloodbetween the fingers. I had a brief moment of dizziness.\n\u003cbr\u003e \n\u003cbr\u003e In scarcely more than a whisper, as though I were imparting a secret and afraid of beingoverhead, I said:\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s not a mirage, is it? It\u0027s a real person, someone you can touch, someone you can…drawblood from. And what\u0027s more, someone you\u0027ve seen only today.\"\"How do you know?\"He had not moved; his face was still obstinately turned to the wall and I was addressing hisback.\n\u003cbr\u003e \n\u003cbr\u003e \"It was before I arrived, just before I arrived, wasn\u0027t it?\"His whole body contracted, and I could see his panic-stricken expression.\n\u003cbr\u003e \n\u003cbr\u003e \"What about you?\" he said in a strangled voice, \"who are you?\"I thought he was about to attack me. It was not at all the reaction I had expected. The situationwas becoming grotesque. Obviously, he did not believe that I was who I claimed to be. Butwhat could this mean? He was becoming more and more terrified of me. Was he delirious?\n\u003cbr\u003e \n\u003cbr\u003e Could he have been affected by unfiltered gases from the planet\u0027s atmosphere? Anythingseemed possible. And then again, I too had seen this…creature, so what about me?\n\u003cbr\u003e \n\u003cbr\u003e \"Who is she?\" I asked.\n\u003cbr\u003e \n\u003cbr\u003e These words reassured him. For a moment, he looked at me searchingly, as though he was stilldoubtful of me; then he collapsed into his chair and put his head in his hands. Even before heopened his mouth, I knew that he had still not made up his mind to give me a direct answer.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027m worn out,\" he said weakly.\n\u003cbr\u003e \n\u003cbr\u003e \"Who is she?\" I insisted.\n\u003cbr\u003e \n\u003cbr\u003e \"If you don\u0027t know…\"\"Go on, know what?\"\"Nothing.\"\"Listen, Snow! We are isolated, completely cut off. Let\u0027s put our cards on the table. Things areconfused enough as it is. You\u0027ve got to tell me what you know!\"\"What about you?\" he retorted, suspiciously.\n\u003cbr\u003e \n\u003cbr\u003e \"All right, I\u0027ll tell you and then you tell me. Don\u0027t worry, I shan\u0027t think you\u0027re mad.\"\"Mad! Good God!\" He tried to smile. \"But you haven\u0027t understood a thing, not a single thing.\n\u003cbr\u003e \n\u003cbr\u003e He never for one moment thought that he was mad. If he had he would never have done it. Hewould still be alive.\"\"In other words, your report, this business of nervous troubles, is a fabrication.\"\"Of course.\"\"Why not write the truth?\"\"Why?\" he repeated.\n\u003cbr\u003e \n\u003cbr\u003e A long silence followed. It was true that I was still completely in the dark. I had been under theimpression that I had overcome his doubts and that we were going to pool our resources tosolve the enigma. Why, then, was he refusing to talk?\n\u003cbr\u003e \n\u003cbr\u003e \"Where are the robots?\"\"In the store-rooms. We\u0027ve locked them all away; only the reception robots are operational.\"\"Why?\"Once more, he refused to answer.\n\u003cbr\u003e \n\u003cbr\u003e \"You don\u0027t want to talk about it?\"\"I can\u0027t.\"He seemed constantly on the point of unburdening himself, only to pull himself up at the lastmoment. Perhaps I would do better to tackle Sartorius. Then I remembered the letter and, as Ithought of it, realized how important it was.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you intend continuing with the experiments?\"He gave a contemptuous shrug:\n\u003cbr\u003e \n\u003cbr\u003e \"What good would that do?\"\"Oh—in that case, what do you suggest we do?\"He was silent. In the distance, there was a faint noise of bare feet padding over the floor. Themuffled echo of these shuffling steps reverberated eerily among the nickel-plated andlaminated equipment and the tall shafts, furrowed with glass tubes, which encased thecomplicated electronic installations.\n\u003cbr\u003e \n\u003cbr\u003e Unable to control myself any longer, I stood up. As I listened to the approaching footsteps, Iwatched Snow. Behind the drooping lids, his eyes showed no fear. Was he not afraid of her,then?\n\u003cbr\u003e \n\u003cbr\u003e \"Where does she come from?\" I asked.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know.\"The sound of the footsteps faded, then died away.\n\u003cbr\u003e \n\u003cbr\u003e \"Don\u0027t you believe me?\" he said. \"I swear to you that I don\u0027t know.\"In the silence that followed, I opened a locker, pushed the clumsy atmosphere suits aside andfound, as I expected, hanging at the back, the gas pistols used for manoeuvering in space. Itook one out, checked the charge, and slung the harness over my shoulder. It was not strictlyspeaking, a weapon, but it was better than nothing.\n\u003cbr\u003e \n\u003cbr\u003e As I was adjusting a strap, Snow showed his yellow teeth in a mocking grin.\n\u003cbr\u003e \n\u003cbr\u003e \"Good hunting!\" he said.\n\u003cbr\u003e \n\u003cbr\u003e I turned towards the door.\n\u003cbr\u003e \n\u003cbr\u003e \"Thanks.\"He dragged himself out of his chair.\n\u003cbr\u003e \n\u003cbr\u003e \"Kelvin!\"I looked at him. He was no longer smiling. I have never seen such an expression of wearinesson anyone\u0027s face.\n\u003cbr\u003e \n\u003cbr\u003e He mumbled:\n\u003cbr\u003e \n\u003cbr\u003e \"Kelvin, it isn\u0027t that…Really, I…I can\u0027t…\"I waited; his lips moved, but uttered no sound. I turned on my heel and went out.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/kehuan/996/29989.html","bookId":222,"creation":"Aug 1, 2019 7:15:08 AM","modification":"Aug 1, 2019 7:15:08 AM"}
