{"id":82799,"no":23,"title":"Page 23","content":"\u003cp\u003e“What’s going on?” I ask as soon as I walk into the large old barn. The inside is separated into two levels. The top is an old hayloft, and the bottom is an empty space except for an old card table, with a few chairs gathered around it.\u003c/p\u003e\n\u003cp\u003e“Waiting until Asher gets here, then I’ll explain,” Cash says, pacing back and forth, running his hands down the back of his neck.\u003c/p\u003e\n\u003cp\u003e“Do you know what’s going on?” I ask Nico, who’s sitting in one of the chairs watching Cash pace.\u003c/p\u003e\n\u003cp\u003e“No clue.” He shrugs, and I sit in the chair next to him, watching Cash, becoming more concerned by the second. When Asher walks in, Nico and I stand.\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Asher asks, looking at Cash. And for the first time in my life, I watch my normally-happy little brother break down. Cash’s head falls forward as we all gather around him. I put my hand on Cash’s shoulder, and when his eyes come up, he runs his hands down his face.\u003c/p\u003e\n\u003cp\u003e“I fucked up,” Cash says, his voice broken.\u003c/p\u003e\n\u003cp\u003e“Whatever it is, we will figure it out; tell us what’s going on.”\u003c/p\u003e\n\u003cp\u003e“Jules is pregnant. How the fuck am I going to fix that?” he asks, his eyes pleading.\u003c/p\u003e\n\u003cp\u003e“Jesus,” I mumble, running my hands down my face, before looking at all three of my brothers.\u003c/p\u003e\n\u003cp\u003e“I thought you were with Lilly?” Nico asks. I’m sure we’re all wondering. Cash has been all about Lilly since he met her and we got back from Alabama; if he has the weekend off, he spends it with her near her school. He was even thinking about asking her to transfer schools so that she could be closer.\u003c/p\u003e\n\u003cp\u003e“I broke it off with her,” he says, looking away.\u003c/p\u003e\n\u003cp\u003e“Dude, are you sure that she’s even pregnant? Or even if she is, you sure that it’s your kid?” Nico asks for all of us again.\u003c/p\u003e\n\u003cp\u003e“I went to the doctor with her today, and the doctor confirmed that around the time I slept with her is when she had gotten pregnant.”\u003c/p\u003e\n\u003cp\u003e“What the fuck?” Nico looks at me, and I know exactly what he’s thinking.\u003c/p\u003e\n\u003cp\u003e“Did you use protection?” I ask.\u003c/p\u003e\n\u003cp\u003e“Yeah! I\u0027m not stupid.” He groans. “We had been hooking up for a while but we both agreed that’s all it was ever going to be.”\u003c/p\u003e\n\u003cp\u003e“Did you have the condom, or did she?”\u003c/p\u003e\n\u003cp\u003e“Does it fucking matter whose condom we used?”\u003c/p\u003e\n\u003cp\u003e“I fucking told you that Jules was telling people at the bonfire that she wanted to get knocked up. Do you remember that conversation, dumbass?”\u003c/p\u003e\n\u003cp\u003e“I slept with her before you told me that shit!” he roars, throwing the card table across the room. “I haven’t slept with anyone else since I met Lilly.”\u003c/p\u003e\n\u003cp\u003e“Shit,” I whisper.\u003c/p\u003e\n\u003cp\u003e“Calm down,” Asher says, taking a step toward him. “You know that no matter what, we will be here for you, whatever you need.”\u003c/p\u003e\n\u003cp\u003e“I just broke up with my girl.” Cash looks at me, pleading. “I didn’t want her to have to go through this with me, so I called her and broke it off with her over the phone. I didn’t even have the balls to break it off with her in person.”\u003c/p\u003e\n\u003cp\u003e“You didn’t have to do that,” Asher says.\u003c/p\u003e\n\u003cp\u003e“Jules is pregnant with my child. After I saw my son and heard his heartbeat today, I knew what I had to do. I can’t be so selfish as to think that Lilly would want to stick with me through this, knowing that I’m having a child with another woman.” I didn’t like that he was going through this, but I understood why he would feel conflicted about having Lilly in this situation.\u003c/p\u003e\n\u003cp\u003e“Look I understand what you’re going through,” Asher says, rubbing the back of his head. “You’re a good man, Cash. And out of all of us, you wear your heart on your sleeve; you always have. We need to make sure that this is your kid.”\u003c/p\u003e\n\u003cp\u003e“I know he’s mine; I feel it in my gut.”\u003c/p\u003e\n\u003cp\u003e“Okay, so what do you need from us?” Nico asks.\u003c/p\u003e\n\u003cp\u003e“I’m going to tell mom and dad in the morning. I need you guys to be there. Jules has been living with her aunt, and I’m going to have her move in with me so that if she needs anything, I’m close by.”\u003c/p\u003e\n\u003cp\u003e“I don’t think that’s a good idea.” Asher looks at me for back up.\u003c/p\u003e\n\u003cp\u003e“You asked me what I need, and I need your support. I need to know that you got my back.”\u003c/p\u003e\n\u003cp\u003e“We got your back,” we all say in unison. “No matter what happens, you have us,” I tell him. Asher and Nico nod in agreement.\u003c/p\u003e\n\u003cp\u003e“How ‘bout I get the six-pack I have in my truck, and we all have a beer. Dad will be up in an hour to go down to the station; we can just head over there this morning,” Nico says.\u003c/p\u003e\n\u003cp\u003e“Sounds good to me,” I agree, looking at Asher.\u003c/p\u003e\n\u003cp\u003e”Works for me. I fed July before I left the house; my girls should be sleeping for a while.”\u003c/p\u003e\n\u003cp\u003e“I need a couple beers,” Cash says, sitting down in one of the chairs, his elbows to his knees, and his head hung low. I watch Asher and Nico head outside before I walk to where Cash is.\u003c/p\u003e\n\u003cp\u003e“It will be alright,” I tell him, sitting in a chair next to him.\u003c/p\u003e\n\u003cp\u003e“Lilly’s my one,” he whispers so low that I barely hear him. His hands cover his face, and then come to rest over his mouth when our eyes connect.\u003c/p\u003e\n\u003cp\u003e“Fuck,” I say, leaning my head back. I can’t imagine having to give up Liz.\u003c/p\u003e\n\u003cp\u003e“Yeah,” he agrees, before looking at the door and watching Asher walk in with Nico close behind.\u003c/p\u003e\n\u003cp\u003eIt is after ten in the morning when I walk into my house. The house is quiet, so I walk back to the bedroom and can hear the shower in the master bath going. When I open the bathroom door, Liz screams as I step into the steam-filled room, pulling my shirt off over my head.\u003c/p\u003e\n\u003cp\u003e“Trevor?” she asks, wiping some of the fog from the shower door, and holding her chest.\u003c/p\u003e\n\u003cp\u003e“It’s me, babe,” I confirm, pulling off my boots and jeans.\u003c/p\u003e\n\u003cp\u003e“I’m just getting out; do you want me to leave the water on for you?” Liz asks, as I look at her through the fog-covered glass doors of the shower.\u003c/p\u003e\n\u003cp\u003e“You step out of that shower, baby, and I’m going to get you dirty. So I suggest you just stay there.” After the night and morning I had, feeling Cash’s pain over losing the girl that he was falling in love with, I need Liz more than I need my next breath. I need to know that she is here with me, and that she is mine.\u003c/p\u003e\n\u003cp\u003eShe doesn’t say anything, just watches me get undressed. When I open the shower door, she takes a step back, making room for me. I pull her into my arms, and rest my head on top of hers. Her arms wrap tighter around my middle as her body relaxes into mine.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” she asks, leaning her head back to look at me.\u003c/p\u003e\n\u003cp\u003e“Yeah.” Her eyes roam my face.\u003c/p\u003e\n\u003cp\u003e“Is Cash okay?”\u003c/p\u003e\n\u003cp\u003eI let out a deep breath before answering, “He will be.”\u003c/p\u003e\n\u003cp\u003e“Do you want to talk about it?” she asks, but I don’t want to talk right now.\u003c/p\u003e\n\u003cp\u003e“No, I want you on your knees.” She looks startled, but then she licks her lips, sinking to her knees in front of me. I’m surprised by this move on her part; she must know that I need this, desperate to know that she’s mine in every way. My hands go to her hair, holding it away from her face. Running her hands up my thighs, she wraps her small hand around my cock. Her tongue comes out, licking over the head as her hand slides up and down the length. “No teasing; open up.” I tell her, and she takes me all the way in, looking up at me; her eyes are dark with lust, her plump lips stretching around my girth. Her rhythm is perfect; my cock touches the back of her throat every time she takes me all the way in. “You have a hot little mouth, baby,” I tell her, throwing my head back and enjoying the feel of her mouth wrapped around me.\u003c/p\u003e\n\u003cp\u003eHer rhythm picks up, and her mouth and hand move faster. When I look back down at her, her other hand has disappeared between her legs. “Does having my dick in your mouth turn you on?” She moans as I run my hand down her cheek. “Stop touching yourself.” She hesitates and whimpers, before putting her hand on my thigh. I hold her face, watching myself disappear between her lips a few more times before I start to feel that tingle in my spine. “Stop.” I lift her under her arms, standing her up and turning her around. Then I place her hands on the shower wall. My fingers slide over her clit. “You’re soaked; you love sucking me off, don’t you, baby?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she moans, pressing back and trying to get more contact. I lean forward, sinking my teeth into her shoulder at the same time I slam into her. One arm goes around her waist, my free hand goes between her legs, and I play with her clit.\u003c/p\u003e\n\u003cp\u003e“Shit, Trevor!” she yells, her hand reaches behind her, going around to grab onto the muscle of my ass to pull me deeper into her. She leans her head to the side, her mouth seeking mine, and our tongues touch. I’m lost in her.\u003c/p\u003e\n\u003cp\u003e“You’re never leaving me.” I slam into her, punctuating my words. “You’re never getting rid of me. Tell me you want to have my child.”\u003c/p\u003e\n\u003cp\u003e“Yes!” she screams, convulsing around me. Her pussy pulls me in, bringing on my own orgasm. I lay my forehead against her back, trying to catch my breath. I know that it’s fucked up to ask her to have my baby when I know she’s getting ready to have an orgasm; but fuck, I need her tied to me. “Oh my God! What was that?” she laughs.\u003c/p\u003e\n\u003cp\u003e“A moment that will be burned into my brain for the rest of my life.” I lift my head from her back. Her forehead is resting against her arm on the tile wall. I slide out of her slowly; I hate losing the heat of her. I turn her around, kissing her before burying my face in her neck, absorbing her smell.\u003c/p\u003e\n\u003cp\u003e“Are you okay?” she asks softly, hugging me a little tighter.\u003c/p\u003e\n\u003cp\u003e“Yeah, let’s get washed up. I’ll tell you what’s going on while you have some coffee.”\u003c/p\u003e\n\u003cp\u003e“Alright, but give me a second; my legs are still kind of wobbly.”\u003c/p\u003e\n\u003cp\u003eI smile, making her eyes narrow. “Come here. I’ll wash you up.” I spend quite a bit of time washing her, and then eating her out, before I shut off the water and step out of the shower. I hold out a towel for her to wrap up in before I pull one down for me to dry off. Once we’re dressed and in the kitchen, I tell her about Cash and Jules. The more I talk, the more pissed off she becomes.\u003c/p\u003e\n\u003cp\u003e“So that girl from the bonfire wasn’t joking. She seriously wanted to get knocked up by one of you guys?”\u003c/p\u003e\n\u003cp\u003eI shrug. “I don’t know what the hell happened. All I know is that Cash slept with her.”\u003c/p\u003e\n\u003cp\u003e“And he knows it’s his?”\u003c/p\u003e\n\u003cp\u003e“He can’t be sure without a paternity test, but he believes that the timing matches how far along she is.”\u003c/p\u003e\n\u003cp\u003e“That’s crazy. So what, he dumped Lilly and is moving Jules in with him?”\u003c/p\u003e\n\u003cp\u003e“That’s what he says. Tomorrow we’re supposed to help him move her into his house.”\u003c/p\u003e\n\u003cp\u003e“Oh my God.” She covers her mouth. “She’s getting exactly what she wants, and poor Cash is stuck.”\u003c/p\u003e\n\u003cp\u003e“It’s his choice, baby.” I tell her softly. “He doesn’t want his kid growing up without him.”\u003c/p\u003e\n\u003cp\u003e“He can still see his kid, Trevor!” she practically yells. \u003c/p\u003e","sourceLink":"https://allnovel.net/until-trevor-until-2/page-23.html","bookId":2745,"creation":"Oct 5, 2019 4:47:16 PM","modification":"Oct 5, 2019 4:47:16 PM"}
