{"id":82812,"no":36,"title":"Page 36","content":"\u003cp\u003e“You want some help, baby?” Trevor asks, walking up behind me, his arms wrapping around my waist.\u003c/p\u003e\n\u003cp\u003e“No thanks. I’m just about done,” I say, flipping over the last pancake. His mouth goes to my neck; the scruff from his morning stubble scratches against my skin. “You can’t do that right now,” I say quietly. His hands flex on my hips, pulling my ass into his hips.\u003c/p\u003e\n\u003cp\u003e“You smell so good, baby. I just want to eat you.” I bite my lip hard, trying not to moan. “As soon as Hanna’s down, I’m going to eat you, then fuck your tight, wet pussy until you beg me to stop.”\u003c/p\u003e\n\u003cp\u003e“Trevor...”\u003c/p\u003e\n\u003cp\u003e“No, you owe me,” he growls biting my earlobe, pressing his hips into me, before stepping back and going to Hanna while I finish making breakfast.\u003c/p\u003e\n\u003cp\u003e“She’s down.” I jump at the sound of Trevor’s voice. I have been trying to catch up on laundry when he walks in.\u003c/p\u003e\n\u003cp\u003e“Is she okay?”\u003c/p\u003e\n\u003cp\u003e“Yep, lose the shorts.”\u003c/p\u003e\n\u003cp\u003e“Trevor—”\u003c/p\u003e\n\u003cp\u003e“I’m not fucking around, baby. Lose the shorts.” I can feel myself getting wetter every time he speaks. I shimmy out of my jean shorts, and before they even hit the floor, I’m up on top of the washer. Trevor reaches around me. I hear the washer start, then it is shaking under me. He tears my legs apart, shoving his face between my thighs, attacking me, licking, biting, and sucking. His mouth, and the vibrations from the washer, are bringing me closer and closer to an orgasm. “Ride my tongue, baby. Make yourself come.”\u003c/p\u003e\n\u003cp\u003e“Trevor!” I moan loudly, my pussy convulsing, as billions of colors flash behind my eyelids, my whole body buzzing. He stands and tugs me forward, his mouth meeting mine. I can taste myself on him as he eats my mouth the same way he did my pussy. His fingers sliding inside me brings me closer to another orgasm. I tear my mouth away from his, my head falling back. Then my arms are going up. My shirt is gone, and his mouth is latching onto my breast through my bra, before ripping the cup of my bra down, and picking me up off the washer. He turns me around, my chest going to the cold top of the washer; his thighs spread my legs apart, and he thrusts into me.\u003c/p\u003e\n\u003cp\u003e“Fuck yes...I have been wanting this all day.”\u003c/p\u003e\n\u003cp\u003e“Harder.” My hands go to his ass, pulling him into me.\u003c/p\u003e\n\u003cp\u003e“You want it hard, baby?” He starts pounding into me so hard that the washer is rocking with the force, and I have to stand on my tiptoes. “I love your pussy; always so tight and warm, baby.” His teeth bite into my ear, then my neck. “Touch yourself. I want to feel you come around my dick while I’m fucking your tight little pussy.” I whimper. I love his mouth; the things he says are as good as what he does with it. “I feel it. You’re gonna come, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Yesss.” I arched my back as he starts pounding even harder. My toes no longer touching the floor. He bites into my neck, pulling out almost all the way, then slamming so hard into me that the washer bangs into the wall, before his strokes slow and he groans into my neck and pulls me slightly away from the washer. We are both covered in sweat and breathing heavily. I lay my forehead against the washer, enjoying the coolness on my overheated skin.\u003c/p\u003e\n\u003cp\u003e“I needed that,” he says against my neck, making me laugh.\u003c/p\u003e\n\u003cp\u003e“Don’t even act like you didn’t get some last night.”\u003c/p\u003e\n\u003cp\u003e“That was last night.”\u003c/p\u003e\n\u003cp\u003e“You’re crazy,” I tell him, looking over my shoulder.\u003c/p\u003e\n\u003cp\u003e“Love you, baby.” My heart melts. I can’t believe that my happiness only increases over time. I am truly blessed in the relationship that we have.\u003c/p\u003e\n\u003cp\u003e“Love you more,” I whisper, leaning my head back against him.\u003c/p\u003e\n\u003cp\u003e“Impossible.” \u003c/p\u003e","sourceLink":"https://allnovel.net/until-trevor-until-2/page-36.html","bookId":2745,"creation":"Oct 5, 2019 4:47:16 PM","modification":"Oct 5, 2019 4:47:16 PM"}
