{"id":67781,"no":6,"title":"Page 6","content":"\u003cp\u003eSo why was she holding back with Noel? Admittedly, it was still mind-boggling that she was dating him at all—Aria’s crush on Noel in sixth and seventh grades bordered on the embarrassing. Ali used to tease her about it constantly. “It’s probably better you and Noel aren’t dating,” she’d say. “He’s had so many other girlfriends, so much experience. And you’ve had how many boyfriends? Oh right—zero.”\u003c/p\u003e\n\u003cp\u003eSometimes Aria still got a sense that she wasn’t good enough for him—not popular enough, not preppy enough, not the kind of girl who knew which fork to use at dinner or how to maneuver a horse over a jump. She didn’t even know the proper name for those jumps. Then again, sometimes Aria got the sense Noel wasn’t good enough for her—like when they’d toured Iceland together this past summer. He’d insisted on only eating at Burger King and paying for cans of Budweiser with U.S. dollars.\u003c/p\u003e\n\u003cp\u003eShe touched Noel’s rigid back. “I just want it to be special.”\u003c/p\u003e\n\u003cp\u003eHe turned. “You don’t think it’d be special?”\u003c/p\u003e\n\u003cp\u003e“I do, but . . .” Aria shut her eyes. It was so hard to explain.\u003c/p\u003e\n\u003cp\u003eNoel hunched his shoulders defensively. “You’ve been so different lately.”\u003c/p\u003e\n\u003cp\u003eAria frowned. “Since when?”\u003c/p\u003e\n\u003cp\u003e“Since . . . a while, I guess.” Noel slid off the couch and pulled his T-shirt back on. “Is it some other guy? Is there something you’re not telling me?”\u003c/p\u003e\n\u003cp\u003eA chill ran up Aria’s spine. She was keeping secrets from Noel. Of course he knew about Ali, A, and what had happened in the Poconos—the whole world did. But he didn’t know about the unforgivable thing she’d done in Iceland. He didn’t know about Jamaica, either, and he’d even been there when it happened—not there, of course, but sleeping in a nearby room. Would he still want to be with Aria if he knew any of that?\u003c/p\u003e\n\u003cp\u003e“Of course it isn’t another guy.” Aria hugged him from behind. “I just need some more time. Everything’s fine, I promise.”\u003c/p\u003e\n\u003cp\u003e“Well, you better watch out,” Noel said in a slightly more playful voice. “I’m going to find a slutty freshman to satisfy my needs.”\u003c/p\u003e\n\u003cp\u003e“You wouldn’t,” Aria threatened, slapping him lightly.\u003c/p\u003e\n\u003cp\u003eNoel twisted his mouth. “You’re right. All the freshman girls are skanks, anyway.”\u003c/p\u003e\n\u003cp\u003e“Not that that’s ever stopped you.”\u003c/p\u003e\n\u003cp\u003eNoel turned, buried Aria’s head in his armpit, and gave her a noogie. “I hope you count yourself in the skank category, woman!”\u003c/p\u003e\n\u003cp\u003eAria squealed. “Stop!” They fell back to the sofa and started kissing again.\u003c/p\u003e\n\u003cp\u003e“Ahem.”\u003c/p\u003e\n\u003cp\u003eAria shot up and saw her mother standing in the doorway. Ella’s long, black hair was wound on top of her head, and she wore a long, flowing caftan tunic and black leggings. There was a scolding frown on her face. “Hello, Aria,” she said evenly. “Hello, Noel.”\u003c/p\u003e\n\u003cp\u003e“H-hey, Ella,” Aria said, her face reddening. Despite her mom’s liberal attitude about most things, she was still pretty strict about not letting Aria be in the house alone with Noel. Aria hadn’t exactly told Ella she and Noel would be here today. “I-I’m sorry,” she stammered. “We were just . . . talking. I swear.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.” Ella pursed her boysenberry-stained lips knowingly. Then, with a shake of her head, she padded off to the kitchen. “What are you two doing for dinner?” she asked over her shoulder. “I’m making raw turnip ravioli for Thaddeus and me. You’re welcome to stay.”\u003c/p\u003e\n\u003cp\u003eAria glanced at Noel, who emphatically shook his head. Thaddeus was Ella’s boyfriend—they’d met at the art gallery where Ella worked. He was a raw foodist, which meant Ella had become one, too. Aria liked her pasta cooked, thanks very much.\u003c/p\u003e\n\u003cp\u003eThen, Noel’s phone, which was perched on the coffee table, let out a loud foghorn noise.\u003c/p\u003e\n\u003cp\u003eNoel untangled himself from Aria, checked the screen, and scowled. “Shit. I forgot. I have to pick up someone at the airport in an hour.”\u003c/p\u003e\n\u003cp\u003e“Who?” Aria sat up and pulled her cardigan around her shoulders.\u003c/p\u003e\n\u003cp\u003e“Just this loser foreign exchange student who’s coming for the semester. My parents dropped the bomb on me yesterday after the Hastingses’ party. It’s going to be so lame.”\u003c/p\u003e\n\u003cp\u003eAria’s jaw dropped. “Why haven’t you told me yet? Foreign-exchange students are so interesting!” In fifth grade, a girl named Yuki had come on exchange from Japan, staying with Lanie Iler’s family. Most kids thought she was weird, but Aria found Yuki fascinating—she wrote her name in strange characters, folded origami shapes out of her spelling tests, and had the straightest, blackest hair Aria had ever seen.\u003c/p\u003e\n\u003cp\u003eNoel shoved his feet into his ratty driving loafers. “Are you kidding? It’s going to suck. Do you know where he’s from? Finland! He’s probably going to be such a freak, like one of those guys who wears girls’ jeans and plays the recorder.”\u003c/p\u003e\n\u003cp\u003eAria smiled to herself, remembering how Noel had called her Finland the first few weeks after her family had returned from Iceland.\u003c/p\u003e\n\u003cp\u003e“This dude probably is a huge dork.” Noel strode toward the hall.\u003c/p\u003e\n\u003cp\u003e“Do you want company?” Aria called after him as he stomped down the stairs.\u003c/p\u003e\n\u003cp\u003e“Nah.” Noel waved his hand. “I’ll spare you from freak-Finn and his wooden shoes.”\u003c/p\u003e\n\u003cp\u003eThat’s Holland, Aria wanted to say. She quickly pulled on her coat and slipped on her boots. “Seriously. I don’t mind.”\u003c/p\u003e\n\u003cp\u003eNoel chewed on his lip, thinking. “If you insist. But don’t say I didn’t warn you.”\u003c/p\u003e\n\u003cp\u003eThe Philadelphia airport teemed with families hauling suitcases, businessmen running to catch planes, and bedraggled travelers removing their shoes in the security line. The arrivals board said that the plane from Helsinki had just landed. Noel pulled a small cardboard square from his backpack and unfolded it. HUUSKO, it said in large red letters.\u003c/p\u003e\n\u003cp\u003e“That’s his last name,” Noel said wearily, staring at the poster as though it were a decree for his execution. “Doesn’t it sound like a brand of grannie panties? Or maybe some kind of unidentifiable meat spread?”\u003c/p\u003e\n\u003cp\u003eAria giggled. “You’re terrible.”\u003c/p\u003e\n\u003cp\u003eNoel plopped morosely on one of the benches by the security gate and stared at the line of people snaking toward the metal detectors. “This is our senior year, Aria. The only time we’ll have to just chill before college. The last thing I want is some loser hanging on me. I swear my mom did this to torture me.”\u003c/p\u003e\n\u003cp\u003eAria made an mmm of sympathy. Then, she noticed something on the TV hanging overhead. ANNIVERSARY OF ROSEWOOD MURDERESS’S DEATH, said the yellow-lettered headline on the screen.\u003c/p\u003e\n\u003cp\u003eA brunette reporter stood in front of the DiLaurentises’ old house, the wind blowing her hair around her face. “A year ago this Saturday, Alison DiLaurentis, whose killing spree baffled an entire nation, died in a horrific self-ignited fire in the Pocono Mountains,” she announced. “A whole year has passed since the bizarre events, but the town of Rosewood still hasn’t recovered.”\u003c/p\u003e\n\u003cp\u003eImages of Jenna Cavanaugh and Ian Thomas, two of Real Ali’s victims, flashed on the screen. Then there was the seventh-grade portrait of Courtney DiLaurentis—the girl who’d taken the real Ali’s place in sixth grade, the girl whom Real Ali killed during their seventh-grade sleepover. “Many are still puzzled that Ms. DiLaurentis’s body was never found in the rubble. Some have speculated Ms. DiLaurentis survived, but experts have claimed that there’s no possibility of that.”\u003c/p\u003e\n\u003cp\u003eA shiver ran down Aria’s spine.\u003c/p\u003e\n\u003cp\u003eNoel covered Aria’s eyes with his hands. “You shouldn’t watch that.”\u003c/p\u003e\n\u003cp\u003eAria wriggled free. “It’s hard not to.”\u003c/p\u003e\n\u003cp\u003e“Have you been thinking about it much?”\u003c/p\u003e\n\u003cp\u003e“Sort of.”\u003c/p\u003e\n\u003cp\u003e“Do you want to watch the movie together?”\u003c/p\u003e\n\u003cp\u003e“Oh God, no.” Aria groaned. Noel was referring to Pretty Little Killer, a biopic condensing the events of last year into two TV-ready hours. It was beyond tacky.\u003c/p\u003e\n\u003cp\u003eSuddenly, an influx of people flowed through the door from immigration. Many were tall, blond, and pale, surely from the Helsinki flight. Noel grumbled. “Here we go.” He waved the HUUSKO sign.\u003c/p\u003e\n\u003cp\u003eAria peered through the crowd. “What’s his first name, anyway?”\u003c/p\u003e\n\u003cp\u003e“Klaudius?” Noel mumbled. “Something like that.”\u003c/p\u003e\n\u003cp\u003eOlder men lugged suitcases past as they spoke on iPhones. Three lanky girls giggled together. A blond family carrying a towheaded child struggled to open a baby stroller. No one looked like a Klaudius.\u003c/p\u003e\n\u003cp\u003eThen, a voice floated through the crowd of travelers. “Mr. Kahn?”\u003c/p\u003e\n\u003cp\u003eAria and Noel stood on their tiptoes, trying to locate the speaker. Just then, Aria noticed a boy with a drawn, elongated face, fleshy lips, zits on his cheeks and forehead, and an Adam’s apple that protruded at least an inch from his neck. It was Klaudius, all right. He was even carrying a small instrument case that might just be a recorder. Poor Noel.\u003c/p\u003e\n\u003cp\u003e“Mr. Kahn?” the voice called again, but the boy Aria thought was Klaudius hadn’t opened his mouth.\u003c/p\u003e\n\u003cp\u003eThe crowd parted. A figure in a trapper hat, a down jacket, and fur lined boots emerged. “Hallo! It’s you! I am your new exchange! Klaudia Huusko!”\u003c/p\u003e\n\u003cp\u003eKlaudia. Noel’s mouth opened, but no sound came out. Aria stared at the figure in front of them, nearly choking on her gum. Noel’s exchange student certainly wasn’t a tall, gangly, pock-marked, flute-playing boy. Instead, Klaudia was a girl. A blond-haired, blue-eyed, throaty-voiced, large-breasted, tight-jeans-wearing Scandinavian wet dream.\u003c/p\u003e\n\u003cp\u003eAnd she’d be living just down the hall from Noel.\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eMeet the Pennythistles\u003c/p\u003e\n\u003cp\u003e“Spencer.” Mrs. Hastings leaned across the restaurant table. “Don’t touch the bread. It’s rude to start eating before everyone is seated.”\u003c/p\u003e\n\u003cp\u003eSpencer’s fingers released the squishy, buttery piece of ciabatta back into the basket. If she died from starvation before the others got here, it would be her mother’s fault.\u003c/p\u003e\n\u003cp\u003eIt was Sunday night, and Spencer, Melissa, and her mother were sitting at the Goshen Inn, a stuffy restaurant inside an old 1700s house that had allegedly once been a boarding house for redcoat soldiers. Mrs. Hastings kept clucking about how nice the surroundings were, but Spencer thought the restaurant was as gloomy as a funeral home. It was definitely Colonial Philadelphia chic, with lots of Revolutionary War muskets mounted on the wall, three-cornered hats tucked into window boxes, and candles in old-timey glass lanterns on the tables. And because the clientele looked as old as the décor, the room smelled like an unpleasant mix of musty basement, slightly overdone filet mignon, and Vicks VapoRub.\u003c/p\u003e\n\u003cp\u003e“What’s this Nicholas guy do, anyway?” Spencer folded and refolded the cloth napkin on her lap.\u003c/p\u003e\n\u003cp\u003eMrs. Hastings stiffened. “He’s Mr. Pennythistle until further notice.”\u003c/p\u003e\n\u003cp\u003eSpencer snickered. Mr. Pennythistle sounded like the name of a pornographic clown.\u003c/p\u003e\n\u003cp\u003e“I know what he does,” Melissa volunteered. “I didn’t make the connection at the party, but we totally studied him in my entrepreneurs class. He’s the biggest real estate developer in the area. The Donald Trump of the Main Line.” \u003c/p\u003e","sourceLink":"https://allnovel.net/twisted-pretty-little-liars-9/page-6.html","bookId":2677,"creation":"Oct 5, 2019 10:06:59 AM","modification":"Oct 5, 2019 10:06:59 AM"}
