{"id":45309,"no":1,"title":"Chapter 1 A Meeting of Legends","content":"\u003cp\u003ePart 1\u003c/p\u003e\n\u003cp\u003eDu Qi’s hand rested on the table, covered by a large straw hat.\u003c/p\u003e\n\u003cp\u003eIt was his left hand.\u003c/p\u003e\n\u003cp\u003eNo one knew why his hand was under the hat.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eOf course, Du Qi had more than one hand. In his right hand he held a piece of hard bread. His body and the chunk of bread were very similar; dry, cold and hard.\u003c/p\u003e\n\u003cp\u003eHe sat in a restaurant called Heavenly Fragrance.\u003c/p\u003e\n\u003cp\u003eFood and wine were on the table in front of him.\u003c/p\u003e\n\u003cp\u003eHowever, he didn’t touch them, didn’t even take a drink. He only slowly gnawed on the hard piece of bread that he had brought.\u003c/p\u003e\n\u003cp\u003eDu Qi was a cautious person, and he didn’t want anyone to hear that he had been poisoned to death in a restaurant.\u003c/p\u003e\n\u003cp\u003eAccording to his calculations, at least 770 people in Jianghu wanted to kill him. And yet, he still lived. \u0026nbsp;\u003ca href\u003d\"#footnote_1\"\u003e[1]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eIt was evening, before dusk.\u003c/p\u003e\n\u003cp\u003eOutside in the busy streets, a galloping horse appeared. It sped down the street, knocking over people, vendor stalls, and wheelbarrows before stopping in front of the restaurant.\u003c/p\u003e\n\u003cp\u003eThe person on the horse was lean and supple, and had a long sword hanging from his waist. As soon as he saw the sign “Heavenly Fragrance,” he leaped from the saddle, body spinning, and flew up into the restaurant.\u003c/p\u003e\n\u003cp\u003eThe restaurant burst into commotion, but Du Qi remained motionless.\u003c/p\u003e\n\u003cp\u003eWhen the large, sword-bearing man caught sight of him, his muscles visibly tightened; he let out a long breath before striding forward.\u003c/p\u003e\n\u003cp\u003eHe didn’t greet Du Qi. Instead, he leaned forward and lifted up the hat that was on the table, just a bit. He looked underneath for just a moment, and his ruddy face suddenly became pale. “Yes,” he muttered, “it’s you.”\u003c/p\u003e\n\u003cp\u003eDu Qi didn’t move, didn’t even open his mouth.\u003c/p\u003e\n\u003cp\u003eThe man drew his sword, which glinted as he slashed at his left hand.\u003c/p\u003e\n\u003cp\u003eTwo bloody fingers dropped onto the table, a pinky finger and a ring finger.\u003c/p\u003e\n\u003cp\u003eCold sweat dripped like rain down the man’s pale white face, and with a hoarse whisper he said, “Is this enough?”\u003c/p\u003e\n\u003cp\u003eDu Qi didn’t move, didn’t even open his mouth.\u003c/p\u003e\n\u003cp\u003eThe large man gritted his teeth and again raised his sword.\u003c/p\u003e\n\u003cp\u003eThis time, a bloody hand fell onto the table. “Is this enough?” he asked.\u003c/p\u003e\n\u003cp\u003eDu Qi finally looked at him, then nodded his head and said, “Go.”\u003c/p\u003e\n\u003cp\u003eThe man’s face was contorted with pain; nonetheless he let out a long breath and said, “Thank you very much.”\u003c/p\u003e\n\u003cp\u003eWithout another word, he staggered out of the restaurant.\u003c/p\u003e\n\u003cp\u003eThe large man’s movements carried great strength, and his martial arts were clearly very high. How could it possibly be that after merely looking under Du Qi’s hat, he was willing to cut off his own hand and then offer thanks?\u003c/p\u003e\n\u003cp\u003eWhat secret lay under this hat?\u003c/p\u003e\n\u003cp\u003eNo one knew.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eIt was dusk.\u003c/p\u003e\n\u003cp\u003eTwo people hurried into the restaurant. They wore silk outfits and looked like lords of some sort.\u003c/p\u003e\n\u003cp\u003eCatching sight of them, many people in the restaurant stood and bowed, faced filled with reverence.\u003c/p\u003e\n\u003cp\u003eWithin 250 miles, there were few people who didn’t recognize the “Golden Whip, Silver Blade, Duan Clan Elites,” Duan Jie and Duan Ying. Even fewer people would risk being impolite to them.\u003c/p\u003e\n\u003cp\u003eThe Duan brothers didn’t greet anyone, not even Du Qi. They merely approached the table and looked under the hat. Their faces paled.\u003c/p\u003e\n\u003cp\u003eExchanging a glance, they said, “Yes, it’s him.”\u003c/p\u003e\n\u003cp\u003eDuan Jie placed his hands at his sides, bowed and said, “Welcome, sir. Do you have any instructions?”\u003c/p\u003e\n\u003cp\u003eDu Qi didn’t move, didn’t even open his mouth.\u003c/p\u003e\n\u003cp\u003eBecause he didn’t move, the Duan Clan Elites also dared not move, and were forced to stand there awkwardly.\u003c/p\u003e\n\u003cp\u003eTwo more people entered the restaurant. They were “Jinx Sword” Fang Kuan and “Invincible Iron Fist” Tie Zhong Da. Just like the Duan brothers, they lifted up the straw hat and looked under, then immediately bowed and asked “Do you have any instructions?”\u003c/p\u003e\n\u003cp\u003eThere were no instructions, so they too stood silently. With no instructions given, no one would dare leave.\u003c/p\u003e\n\u003cp\u003eThese people were all mighty heroes of the martial world, why, after merely looking under the hat for a moment, would they display such fear and veneration? \u0026nbsp;\u003ca href\u003d\"#footnote_2\"\u003e[2]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eCould it be that underneath the hat was concealed some terrible magic?\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eIt was after dusk.\u003c/p\u003e\n\u003cp\u003eLanterns illuminated the restaurant.\u003c/p\u003e\n\u003cp\u003eThe lantern light shone on the faces of Fang Kuan and the others, which dripped with sweat. Cold sweat.\u003c/p\u003e\n\u003cp\u003eNo instructions had been given by Du Qi, so one might think they would be at ease.\u003c/p\u003e\n\u003cp\u003eBut looking at their expressions, it seemed they expected something terrible to happen at any moment.\u003c/p\u003e\n\u003cp\u003eNight had fallen, and the stars were out.\u003c/p\u003e\n\u003cp\u003eOutside of the restaurant, in the darkness, there suddenly arose the sound of a whistling bamboo flute, piercing and shrill, like the wail of a ghost.\u003c/p\u003e\n\u003cp\u003eThe facial expressions of Fang Kuan and the others changed yet again, their pupils contracting.\u003c/p\u003e\n\u003cp\u003eDu Qi didn’t move. Therefore, they didn’t move.\u003c/p\u003e\n\u003cp\u003eSuddenly, a booming sound erupted from the rooftop, and four holes appeared.\u003c/p\u003e\n\u003cp\u003eFour people floated down, strapping men, each over seven feet tall and bare-chested, their blood-red pants gathered at the ankles and secured at the waist by shining gold belts. Strapped to their belts were strangely-shaped machetes, hilts crafted from shining gold.\u003c/p\u003e\n\u003cp\u003eThese four muscular men landed on the floor as lightly as cotton, and instantly assumed positions guarding the four corners of the restaurant.\u003c/p\u003e\n\u003cp\u003eTheir expressions were nervous, and in their eyes could be seen an indescribable fear.\u003c/p\u003e\n\u003cp\u003eAt the same moment that everyone in the restaurant laid eyes on the men, there suddenly appeared another person.\u003c/p\u003e\n\u003cp\u003eThis man wore a golden crown and a brocaded golden silk robe. His waist was encircled by a golden belt, upon which was hanging a golden machete. His ivory-colored face was as round as the moon.\u003c/p\u003e\n\u003cp\u003eEven though the Duan Clan Elites and Fang Kuan were sharp-eyed martial arts masters, they were unable to see how this person had entered the restaurant, whether it was down from the roof or in through the windows.\u003c/p\u003e\n\u003cp\u003eHowever, they did know who he was.\u003c/p\u003e\n\u003cp\u003eThe South Sea Millionaire, Golden Crown King of the Golden Mountain, Prince Wu Ji.\u003c/p\u003e\n\u003cp\u003eEven if one hadn’t seen him before, a look at his clothing and impressive air should be enough to able to deduce his identity.\u003c/p\u003e\n\u003cp\u003eDu Qi didn’t move, didn’t even look at him.\u003c/p\u003e\n\u003cp\u003ePrince Wu Ji stepped forward, lifted up the hat, and looked underneath. He let out a breath and said, “Yes, it is you.”\u003c/p\u003e\n\u003cp\u003eAt first his expression had been very nervous, but now he wore a comfortable smile. He suddenly unclasped his wide golden belt and from within produced eighteen smooth, sparkling pearls.\u003c/p\u003e\n\u003cp\u003ePrince Wu Ji placed the pearls on the table, surrounded by the belt, and with a smiling bow said, “Is this enough?”\u003c/p\u003e\n\u003cp\u003eDu Qi didn’t move, didn’t even open his mouth.\u003c/p\u003e\n\u003cp\u003eIn the darkness, the sound of the bamboo flute became more and more urgent, nearer and nearer.\u003c/p\u003e\n\u003cp\u003ePrince Wu Ji’s smile seemed forced as he took the golden crown off his head, a crown trimmed with eighteen pieces of verdant jasper.\u003c/p\u003e\n\u003cp\u003eHe placed the crown on the table and said, “Is this enough?”\u003c/p\u003e\n\u003cp\u003eDu Qi didn’t move, didn’t even open his mouth.\u003c/p\u003e\n\u003cp\u003ePrince Wu Ji threw down his golden machete, and urgently barked, “Is this enough?”\u003c/p\u003e\n\u003cp\u003eDu Qi didn’t move.\u003c/p\u003e\n\u003cp\u003eBrow furrowed, Prince Wu Ji said, “What more do you want?”\u003c/p\u003e\n\u003cp\u003eDu Qi suddenly said, “I want the thumb of your right hand!”\u003c/p\u003e\n\u003cp\u003eWith the thumb cut off, the right hand could neither wield a blade nor throw daggers!\u003c/p\u003e\n\u003cp\u003ePrince Wu Ji’s face distorted.\u003c/p\u003e\n\u003cp\u003eThe whistling of the bamboo was even more urgent, even more near; the sound was like needles piercing the ear.\u003c/p\u003e\n\u003cp\u003ePrince Wu Ji gritted his teeth, extended his right hand and stuck out the thumb, then snapped, “Blade!”\u003c/p\u003e\n\u003cp\u003eOne of the strapping, shirtless fellows in the corner drew his blade. There was a flash of gold as it flew across the room and then spun back into the man’s hand.\u003c/p\u003e\n\u003cp\u003eA bloody thumb landed onto the table.\u003c/p\u003e\n\u003cp\u003ePrince Wu Ji’s face was green. “Is this enough?”\u003c/p\u003e\n\u003cp\u003eDu Qi finally nodded his head and looked at him, “What do you want?”\u003c/p\u003e\n\u003cp\u003ePrince Wu Ji said, “I want you to kill someone.”\u003c/p\u003e\n\u003cp\u003e“Kill who?”\u003c/p\u003e\n\u003cp\u003e“The Ghost King.”\u003c/p\u003e\n\u003cp\u003e“Yin Tao?” asked Du Qi.\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eDu Qi said nothing more, and did not move.\u003c/p\u003e\n\u003cp\u003eFang Kuan, Tie Zhong Da, the Duan Clan Elites stood by pale-faced.\u003c/p\u003e\n\u003cp\u003eThe name “Ghost King” Yin Tao was in itself enough to shake their souls.\u003c/p\u003e\n\u003cp\u003eSuddenly the blowing bamboo changed into the sound of a mourning woman, or a blind person playing music in the night.\u003c/p\u003e\n\u003cp\u003eIn a low voice, Prince Wu Ji said, “Extinguish the lamps!”\u003c/p\u003e\n\u003cp\u003eThe restaurant was brightly lit by at least twenty lamps.\u003c/p\u003e\n\u003cp\u003eThe four bare-chested men waved in unison, and a golden light shone as the energy from their blades flew about, extinguishing the lamps in an instant.\u003c/p\u003e\n\u003cp\u003eDarkness filled the restaurant, but suddenly, dozens of lanterns sprang to life outside.\u003c/p\u003e\n\u003cp\u003eThe lamplight was a sickly green color, floating on the wind quietly like foxfire.\u003c/p\u003e\n\u003cp\u003ePrince Wu Ji gasped: “The Ghost King is here!”\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eThe night wind cut sharply and the sickly green lamplight shone on the people present. All of them had terrified, distorted expressions on their face, as if they were souls recently expelled from the depths of hell.\u003c/p\u003e\n\u003cp\u003eWithin the lingering, mournful whistling of the bamboo, there suddenly burst forth a cold, evil laugh. “Correct! I have arrived!”\u003c/p\u003e\n\u003cp\u003eLong haired, with a face like wax, the Ghost King wore a long, white linen robe and was tall and thin like bamboo. He flew into the room and stood there swaying back and forth eerily.\u003c/p\u003e\n\u003cp\u003eHis eyes were a diseased green color, and they flashed as he stared at Prince Wu Ji. With a sinister laugh, he said, “I already told you, you’re dead!”\u003c/p\u003e\n\u003cp\u003ePrince Wu Ji laughed coldly. “Actually, you are dead!”\u003c/p\u003e\n\u003cp\u003e“Me?”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t have come here,” Prince Wu Ji replied. “Now that you have, you’re dead!”\u003c/p\u003e\n\u003cp\u003e“Who here could possibly kill me?”\u003c/p\u003e\n\u003cp\u003e“Not me,” Prince Wu Ji admitted.\u003c/p\u003e\n\u003cp\u003e“Well then? Who?”\u003c/p\u003e\n\u003cp\u003e“Him!”\u003c/p\u003e\n\u003cp\u003e“Him” was Du Qi, of course.\u003c/p\u003e\n\u003cp\u003eDu Qi still hadn’t moved, even his expression hadn’t changed.\u003c/p\u003e\n\u003cp\u003eGhost King Yin Tao’s sickly green eyes stared at him. “You can kill me?”\u003c/p\u003e\n\u003cp\u003eThe answer was simple: “Yes!”\u003c/p\u003e\n\u003cp\u003eYin Tao laughed loudly. “What are you going to kill me with? Don’t tell me you’re going to use that crappy hat!”\u003c/p\u003e\n\u003cp\u003eDu Qi didn’t say a word. He just stretched out his right hand, and slowly lifted up the straw hat.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eWhat was under the hat?\u003c/p\u003e\n\u003cp\u003eThere was nothing under it, except a hand.\u003c/p\u003e\n\u003cp\u003eA left hand.\u003c/p\u003e\n\u003cp\u003eThe hand was long, with seven fingers.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eIt was a rough hand, like a seaside rock that since ancient times has been pounded by the ocean waves.\u003c/p\u003e\n\u003cp\u003eWhen he saw the hand, Ghost King Yin Tao suddenly looked like he himself had seen a ghost. “7 Killers!”\u003c/p\u003e\n\u003cp\u003eDu Qi didn’t move, didn’t open his mouth.\u003c/p\u003e\n\u003cp\u003eYin Tao said, “I didn’t come looking for you. It would be best for you to mind your own business.”\u003c/p\u003e\n\u003cp\u003e“It is my business.”\u003c/p\u003e\n\u003cp\u003e“What do you want?” asked Yin Tao.\u003c/p\u003e\n\u003cp\u003e“For you to leave!” replied Du Qi.\u003c/p\u003e\n\u003cp\u003eYin Tao’s foot twitched. “Fine. Because it\u0027s you, I’ll leave.”\u003c/p\u003e\n\u003cp\u003e“Leave behind your head, then you can go!”\u003c/p\u003e\n\u003cp\u003eYin Tao’s pupil’s contracted. “My head is right here, why don’t you come and take it?\u003c/p\u003e\n\u003cp\u003e“Why don’t you deliver it me?” replied Du Qi.\u003c/p\u003e\n\u003cp\u003eYin Tao laughed a shrill laugh.\u003c/p\u003e\n\u003cp\u003eAs he laughed that shrill laugh, his body flew toward Du Qi like a specter.\u003c/p\u003e\n\u003cp\u003eAhead of his body shot twelve pulsing green flashes of light.\u003c/p\u003e\n\u003cp\u003eDu Qi waved the straw hat, and the green lantern light that previously filled the air suddenly disappeared. At this exact moment, a long, jade-green sword appeared in Yin Tao’s hand, stabbing toward Du Qi.\u003c/p\u003e\n\u003cp\u003eThe sword flew through the air, with bizarre slashing movements, but only the glinting of the green handle was visible, making it impossible to see the exact direction from which the blade stabbed.\u003c/p\u003e\n\u003cp\u003eAnd yet, Du Qi’s hand had already clawed forward.\u003c/p\u003e\n\u003cp\u003eWithin the sickly green shine generated by Ghost King’s attack, there was a long, gray, seven-fingered hand, clawing up.\u003c/p\u003e\n\u003cp\u003eThe sword’s shadow spun, and the hand’s shape changed in kind. The hand attacked, seven moves in a row, and suddenly a “ding” sounded out, whereupon the flashing of the sword disappeared. The sword in Ying Tao’s hand was now half a sword.\u003c/p\u003e\n\u003cp\u003eThe sword light flashed again, heading toward Du Qi’s hand.\u003c/p\u003e\n\u003cp\u003eBut Du Qi had already sent the broken half of the sword flying back; it was embedded deeply in Ying Tao’s throat.\u003c/p\u003e\n\u003cp\u003eThe speed of the sword was indescribable. The movement of the hand was also impossible to see clearly.\u003c/p\u003e\n\u003cp\u003eThe bystanders only heard a miserable gurgling, and the sound of Ying Tao dropping to the ground.\u003c/p\u003e\n\u003cp\u003eThere was no sound, no light.\u003c/p\u003e\n\u003cp\u003eOutside the restaurant, the lanterns were all extinguished, and there was darkness everywhere.\u003c/p\u003e\n\u003cp\u003eA deathly silence, a deathly darkness.\u003c/p\u003e\n\u003cp\u003eEven the sound of breathing was absent.\u003c/p\u003e\n\u003cp\u003eAfter a period of time, Prince Wu Ji’s voice could be heard: “Thank you very much.”\u003c/p\u003e\n\u003cp\u003eDu Qi said, “Leave. And take Ying Tao with you!”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eAfter that, the sounds of footsteps could be heard hurrying down and out of the restaurant.\u003c/p\u003e\n\u003cp\u003eDu Qi’s voice again spoke out, “You four leave, too. Leave your weapons behind.”\u003c/p\u003e\n\u003cp\u003e“Yes!” The four men responded in unison, dropping their weapons onto the table. A whip, two blades, and the Jinx sword.\u003c/p\u003e\n\u003cp\u003e“Remember,” Du Qi said, “next time you bring weapons into my presence, you will die.”\u003c/p\u003e\n\u003cp\u003eNo one spoke a word. The four men left quietly.\u003c/p\u003e\n\u003cp\u003eIt was silent again in the darkness. After a period of time, the light of a lantern sprang forth.\u003c/p\u003e\n\u003cp\u003eThe lantern was in the hand of a person who had previously been drinking alone in the restaurant. All the other customers had departed, he had not.\u003c/p\u003e\n\u003cp\u003eHe appeared to be an amiable, middle-aged man with a friendly smile. He looked at Du Qi. “One hand, seven killers,” he said. “It really lives up to its reputation.”\u003c/p\u003e\n\u003cp\u003eDu Qi ignored him, not even looking at him. Instead, he took the weapons and treasures from the table and placed them into a hemp bag, then slowly made to leave.\u003c/p\u003e\n\u003cp\u003e“Please, stay a bit,” called the middle-aged man.\u003c/p\u003e\n\u003cp\u003eDu Qi turned his head. “Who are you?”\u003c/p\u003e\n\u003cp\u003eIn a humble voice, the man replied, “I am your humble servant, Wu Bu’ke.”\u003c/p\u003e\n\u003cp\u003eDu Qi laughed coldly. “Are you also looking to die today?”\u003c/p\u003e\n\u003cp\u003eWu Bu’ke responded, “I have orders to deliver a message to you.”\u003c/p\u003e\n\u003cp\u003e“What message?”\u003c/p\u003e\n\u003cp\u003e“There’s someone who wants to meet Master Du.”\u003c/p\u003e\n\u003cp\u003eWith an ice-cold voice, Du Qi said, “It doesn’t matter who wants to see me, they should come in person.”\u003c/p\u003e\n\u003cp\u003e“But, this person …”\u003c/p\u003e\n\u003cp\u003e“They can come to see me. You go tell them this, and also tell them the best thing is to come crawling. Otherwise they will leave crawling.”\u003c/p\u003e\n\u003cp\u003eWithout another word, he began walking down the stairs.\u003c/p\u003e\n\u003cp\u003eWu Bu’ke was still smiling. With the same humble voice he said, “I will definitely take Master Du’s message back to Lord Dragon Fifth.” [5]\u003c/p\u003e\n\u003cp\u003eDu Qi suddenly stopped and turned his head again, and there was emotion on his stony face. “Dragon Fifth? The Dragon Fifth from San Xiang?”\u003c/p\u003e\n\u003cp\u003eWu Bu’ke smiled and said, “Is there some other \u0026nbsp;Dragon Fifth?”\u003c/p\u003e\n\u003cp\u003eDu Qi replied, “Where is he?”\u003c/p\u003e\n\u003cp\u003e“He’ll be at the Heavenly Fragrance Pavilion in Hangzhou, on July 15.”\u003c/p\u003e\n\u003cp\u003eDu Qi’s face was covered with a very strange expression, and he suddenly said. “Ok, I’ll be there.”\u003c/p\u003e\n\u003cp\u003ePart 2\u003c/p\u003e\n\u003cp\u003eGongsun Miao’s hands were definitely not on the table.\u003c/p\u003e\n\u003cp\u003eHis hands very rarely left the inside of his sleeves, as he was loath to let others see them.\u003c/p\u003e\n\u003cp\u003eEspecially the right hand.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eGongsun Miao’s voice was not very strong. He looked like an ordinary person, and wore ordinary clothes.\u003c/p\u003e\n\u003cp\u003eThis was intentional, as he didn’t want to attract attention.\u003c/p\u003e\n\u003cp\u003eBut the person sitting across from him was quite opposite; he attracted a lot of attention. The clothing he wore was of the finest quality, clearly custom tailored. The ring on his finger was worth at least a thousand pieces of silver and was made from Han Dynasty jade. His hat was trimmed with pearls the size of lychee [6] fruits.\u003c/p\u003e\n\u003cp\u003eIt wasn’t just his attire that attracted attention. He was extraordinarily thin, with an unusually small head and a large, aquiline nose. As such, his friends called him “Big Nosed Hu.” People who weren’t his friend called him “Big Nosed Dog.”\u003c/p\u003e\n\u003cp\u003eActually, his nose was quite similar to a dog’s, as he had the ability to smell things that the average person couldn’t smell.\u003c/p\u003e\n\u003cp\u003eThis time, he had caught the scent of something rarely seen in the world, a priceless luminescent pearl.\u003c/p\u003e\n\u003cp\u003eHis voice was very low, his mouth nearly touching Gongsun Miao’s ear as he spoke. “You’ve never seen this luminescent pearl, so you can’t imagine how wonderful it is.”\u003c/p\u003e\n\u003cp\u003eGongsun Miao’s lips twisted, “I don’t even want to think about it.”\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu said, “When it’s dark, it doesn’t just glow, it glows brightly! If you have it in a dark room, you don’t even need a lamp.”\u003c/p\u003e\n\u003cp\u003e“I don’t read,” said Gongsun Miao coldly. “And if I did, I would prefer to use a lamp. Oil and candles aren’t exactly expensive.”\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu’s face had a bitter expression as he said, “But if I don’t get my hands on that pearl, I think I’m going to die.”\u003c/p\u003e\n\u003cp\u003e“That’s your issue. If you want it, just go and get it.”\u003c/p\u003e\n\u003cp\u003e“You know I can’t get it,” said Big Nosed Hu bitterly. “The pearl is hidden in an impregnable fortress. Only you could get in. And as for the iron safe it’s stored in, only you could pick the lock. Other than you, there’s no one in the world who could possibly get it.”\u003c/p\u003e\n\u003cp\u003e“No one else?”\u003c/p\u003e\n\u003cp\u003e“We’ve been friends for thirty years, correct?”\u003c/p\u003e\n\u003cp\u003e“Correct.”\u003c/p\u003e\n\u003cp\u003e“Are you really willing to see me dead on the side of the road?”\u003c/p\u003e\n\u003cp\u003e“Of course not.”\u003c/p\u003e\n\u003cp\u003e“Then you definitely have to help me steal the pearl.”\u003c/p\u003e\n\u003cp\u003eGongsun Miao was silent for a while, before suddenly pulling his right hand out from his sleeve. “Have you ever seen my hand?”\u003c/p\u003e\n\u003cp\u003eThere were only two fingers on his hand. The middle, ring, and pinkie fingers had all been cut off.\u003c/p\u003e\n\u003cp\u003eGongsun Miao said, “Do you know how my pinkie finger was cut off?”\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu shook his head.\u003c/p\u003e\n\u003cp\u003eGongsun Miao continued, “Three years ago, I stood in front of my parents and wife and cut it off, a symbol of my vow to never steal again.”\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu waited for him to continue.\u003c/p\u003e\n\u003cp\u003e“But one day, I caught sight of eight beautiful horses carved from white jade. My hands started itching, and that night I couldn’t help but take the eight white jade horses.”\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu said, “I’ve seen those horses before.”\u003c/p\u003e\n\u003cp\u003e“My parents and wife saw them too,” Gongsun Miao responded. “They didn’t say a single word. The next day they began packing all their belongings to leave. They said they would never again have dealings with me.”\u003c/p\u003e\n\u003cp\u003e“So to get them to come back, you cut off your ring finger?”\u003c/p\u003e\n\u003cp\u003eGongsun Miao nodded his head. “At that time, I firmly resolved to never steal again. But …”\u003c/p\u003e\n\u003cp\u003eTwo years after that, he stole again.\u003c/p\u003e\n\u003cp\u003eThat time, what he stole was an enormous lucky Bok Choy statue, carved from a single piece of white jade. After catching sight of it, he thought about it day and night, and couldn’t sleep for several days. In the end, he couldn’t bear it anymore and stole it.\u003c/p\u003e\n\u003cp\u003e“Stealing is a kind of sickness,” Gongsun Miao said bitterly. “Catching it is more frightening than catching smallpox.”\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu poured some wine into Gongsun Miao’s cup.\u003c/p\u003e\n\u003cp\u003eGongsun Miao glumly continued, “My mother’s health was not very good; when she found out that my old sickness had resurfaced, she became so upset that she passed away. My wife was so angry that she bit my middle finger off in one bite and swallowed it, blood and all.”\u003c/p\u003e\n\u003cp\u003e“So that’s why you only have two fingers left on your hand,” said Big Nosed Hu.\u003c/p\u003e\n\u003cp\u003eGongsun Miao let out a long sigh and slowly placed his hand back inside his sleeve.\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu said, “But, even though you only have two fingers on your hand, it’s still more dexterous than all the other five-fingered hands in the world. If you don’t use it ever again, wouldn’t that be a huge shame?”\u003c/p\u003e\n\u003cp\u003e“We’ve been friends for thirty years, and you’ve saved my life before. But I also know that you owe a huge debt to someone, and the creditor demands the pearl as repayment of the debt. He knows that you will come look for me to help you, and told you that if you don’t get the pearl, your life will be forfeit.” He sighed again. “I know all these things, but I still can’t help you.”\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu replied, “You’ve really made up your mind this time, haven’t you?”\u003c/p\u003e\n\u003cp\u003eGongsun Miao nodded. “Other than stealing, I would do anything for you.”\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu suddenly stood up. “Okay,” he said, “let’s go.”\u003c/p\u003e\n\u003cp\u003e“Go where?”\u003c/p\u003e\n\u003cp\u003e“I won’t ask you to steal it. But, there’s no harm in just going to have a look, right?”\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eThe wall was fifty feet tall and five feet thick, and the top was covered with flowering plants.\u003c/p\u003e\n\u003cp\u003eVery few people could surmount this wall. But for Gongsun Miao, it would be easy.\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu said, “You can really get over?”\u003c/p\u003e\n\u003cp\u003e“If it was twenty feet taller,” he replied calmly, “it would still be no problem.”\u003c/p\u003e\n\u003cp\u003e“The pearl is kept inside a room called the ‘Iron Library.’ Other than the people guarding the door, no one else is inside, because it’s assumed that no one can get over the wall.”\u003c/p\u003e\n\u003cp\u003eGongsun Miao couldn’t help from asking: “Are the walls really made from iron?”\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu nodded. “There are windows in the wall, but they are only one foot wide and nine inches tall. At the most, you could stick your head through.”\u003c/p\u003e\n\u003cp\u003eGongsun Miao laughed. “It’s big enough for me.”\u003c/p\u003e\n\u003cp\u003eAfter all, his bone-shifting technique was one of the martial world’s long-lost arts.\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu said, “After getting inside, you would still have to open the iron safe before you could get the luminescent pearl. It’s said that the safe’s lock was personally designed by the Tangram Kid. The only key is kept by the master of the house, and no one knows where he will hide the key from day to day.”\u003c/p\u003e\n\u003cp\u003eGongsun Miao calmly replied, “Just because the lock was created by the Tangram Kid, it doesn’t mean that it can’t be picked.”\u003c/p\u003e\n\u003cp\u003e“You mean you’ve picked it before?”\u003c/p\u003e\n\u003cp\u003e“No. But there isn’t a lock in the world that I can’t pick. This I know.”\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu looked at him and laughed.\u003c/p\u003e\n\u003cp\u003e“You don’t believe me?” asked Gongsun Miao.\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu laughed again. “I believe. I really do believe. I think we need to get out of here.”\u003c/p\u003e\n\u003cp\u003e“Why do we need to go?” It seemed like Gongsun Miao didn’t want to leave.\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu sighed. “Because if you get the impulse, you’ll definitely go in to steal the pearl. If you couldn’t get into the room, or couldn’t pick the lock, you would have to come out empty-handed. It would be a big embarrassment, and it would be my fault.”\u003c/p\u003e\n\u003cp\u003eGongsun Miao laughed coldly. “Trying to goad me into doing it won’t work. I don’t fall for those kinds of tricks.”\u003c/p\u003e\n\u003cp\u003e“I’m not trying to goad you,” said Big Nosed Hu. “I’m just trying to get you to leave.”\u003c/p\u003e\n\u003cp\u003e“Of course I’m going to leave. I’m not going to stand in this dark alley all night am I?”\u003c/p\u003e\n\u003cp\u003eContinuing to laugh coldly, he walked forward a few steps, then suddenly stopped. “You wait here for me. I’ll be back in one hour at the most.”\u003c/p\u003e\n\u003cp\u003eThe words barely out of his mouth, he had already flown twenty feet into the air and landed on the side of the wall. Climbing up like a gecko, he reached the top in a flash, then disappeared.\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu face had a satisfied smirk on it. Old friends always know the weaknesses of old friends.\u003c/p\u003e\n\u003cp\u003eEven though he was pleased with himself, it was still difficult to wait.\u003c/p\u003e\n\u003cp\u003eHe had just begun to feel worried when suddenly from the top of the wall could be seen the flash of a human figure. Gongsun Miao floated down and landed in front of him.\u003c/p\u003e\n\u003cp\u003e“Did you get it?” Big Nosed Hu asked excitedly. He was nervous.\u003c/p\u003e\n\u003cp\u003eGongsun Miao didn’t open his mouth, instead grabbed Big Nosed Hu and ran, making several turns before stopping in the darkness of a small alley.\u003c/p\u003e\n\u003cp\u003e“I knew you wouldn’t be able to get it,” Big Nose Hu sighed.\u003c/p\u003e\n\u003cp\u003eGongsun Miao glared at him and then suddenly opened his mouth. He didn’t spit out a single word, but rather, a very large pearl.\u003c/p\u003e\n\u003cp\u003eA glowing, luminescent pearl.\u003c/p\u003e\n\u003cp\u003eThe light was both soft like moonlight, and glittering like starlight. The entire alley was filled with its brightness.\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu’s face flushed with excitement as he grabbed the pearl and shoved it into his garment. Despite being concealed in his clothing, its light was still visible on their faces.\u003c/p\u003e\n\u003cp\u003eSuddenly, someone laughed in the darkness. “Superb. Gongsun Miao’s hands really are unparalleled.”\u003c/p\u003e\n\u003cp\u003eThe person stepped out of the shadows. He appeared to be an ordinary, middle-aged man, with a happy smile on his face.\u003c/p\u003e\n\u003cp\u003eBig Nosed Hu saw him, and his face changed. He moved forward, the pearl grasped in his two hands. His throat tight, he said, “The item is already in hand. Can my debt be considered paid?”\u003c/p\u003e\n\u003cp\u003eIt turned out this was the creditor, and yet strangely, he didn’t seem anxious to collect his debt. In fact he didn’t even glance at the luminescent pearl.\u003c/p\u003e\n\u003cp\u003eCould it be that what he wanted wasn’t the pearl after all?\u003c/p\u003e\n\u003cp\u003eWhat did he want?\u003c/p\u003e\n\u003cp\u003e“I am Wu Bu’ke,” he said humbly, smiling at Gongsun Miao. “The debt was my only option to have a chance to see Mr. Gongsun’s marvelous hands at work. Actually, the debt is a trifling matter. I neither want nor need it.”\u003c/p\u003e\n\u003cp\u003eGongsun Miao’s face fell. “Then what exactly do you want?”\u003c/p\u003e\n\u003cp\u003eWu Bu’ke said, “I was especially sent here to invite you to go meet someone.”\u003c/p\u003e\n\u003cp\u003e“Unfortunately, I have no desire to see anyone. I’m very shy.”\u003c/p\u003e\n\u003cp\u003eWu Bu’ke laughed. “No one who meets Lord Dragon Fifth needs to feel shy. He never forces anyone do anything difficult, and he never says anything to embarrass anyone.”\u003c/p\u003e\n\u003cp\u003eGongsun Miao had already begun to walk off. He stopped and turned his head. “Lord Dragon Fifth? You mean Dragon Fifth from San Xiang?”\u003c/p\u003e\n\u003cp\u003eWu Bu’ke laughed again. “Don’t tell me there’s another Dragon Fifth in the world?”\u003c/p\u003e\n\u003cp\u003eGongsun Miao’s face had a strange expression. It was hard to tell whether it was amazement, excitement, or dread.\u003c/p\u003e\n\u003cp\u003e“Lord Dragon Fifth wants to meet me?”\u003c/p\u003e\n\u003cp\u003e“Very much so.”\u003c/p\u003e\n\u003cp\u003e“But he is like a divine dragon from heaven. No one knows his whereabouts. How could I possibly find him?”\u003c/p\u003e\n\u003cp\u003e“You don’t need to go looking for him. He’ll be at the Heavenly Fragrance Pavilion in Hangzhou, on July 15.”\u003c/p\u003e\n\u003cp\u003eGongsun Miao didn’t need to consider for even a moment. He immediately said, “Okay, I’ll be there.”\u003c/p\u003e\n\u003cp\u003ePart 3\u003c/p\u003e\n\u003cp\u003eShi Zhong stretched out his hand and picked up a handful of peanuts. \u0026nbsp;\u003ca href\u003d\"#footnote_3\"\u003e[3]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003eWhen other people grabbed a handful of peanuts, they would grab about thirty. When Shi Zhong grabbed a handful, it contained seventy.\u003c/p\u003e\n\u003cp\u003eHis hand was three times larger than the average person’s hand.\u003c/p\u003e\n\u003cp\u003eOn the peanut vendor’s stand was a sign that read: “Five-Spice Peanuts, two coins per handful.”\u003c/p\u003e\n\u003cp\u003eHe threw thirty coins onto the stand and grabbed fifteen handfuls of peanuts. Soon the stand was almost completely empty.\u003c/p\u003e\n\u003cp\u003eThe young girl selling peanuts started to cry.\u003c/p\u003e\n\u003cp\u003eShi Zhong laughed and dumped all the peanuts onto the ground, then strode off.\u003c/p\u003e\n\u003cp\u003eHe didn’t really like to eat peanuts, but he liked making other people cry.\u003c/p\u003e\n\u003cp\u003eHe seemed to be able to cause mischief at any time, unable to allow others to live peacefully.\u003c/p\u003e\n\u003cp\u003eAt the “Mysterious Sublimity Temple” on the top of a nearby mountain, there was an extremely heavy bronze ritual cauldron. It was said that it weighed thousands of pounds, and that dozens of the strongest men around couldn’t think of a method to move it.\u003c/p\u003e\n\u003cp\u003eOne early morning, everyone was shocked to find the giant bronze cauldron in the exact middle of the street.\u003c/p\u003e\n\u003cp\u003eClearly, the cauldron did not move itself.\u003c/p\u003e\n\u003cp\u003eIn the whole world, if there was anyone who could move the cauldron, it had to be Shi Zhong.\u003c/p\u003e\n\u003cp\u003eTherefore, everyone went looking for him.\u003c/p\u003e\n\u003cp\u003eWith such a giant cauldron in the middle of the street, it was impossible for horses and carts to pass through, and business was at a standstill.\u003c/p\u003e\n\u003cp\u003eThe people begged Shi Zhong to take the cauldron back.\u003c/p\u003e\n\u003cp\u003eHe ignored them.\u003c/p\u003e\n\u003cp\u003eOnly after everyone began beseeching with tears did he finally laugh loudly and step out onto the street. Grasping the cauldron with his enormous hands, he let out a loud breath and shouted, “Heave!”\u003c/p\u003e\n\u003cp\u003eHe lifted the enormously heavy cauldron into the air as if it were a feather.\u003c/p\u003e\n\u003cp\u003eAt that exact moment, a voice from the crowd said, “Shi Zhong, Lord Dragon Fifth is looking for you.”\u003c/p\u003e\n\u003cp\u003eShi Zhong immediately flung the cauldron to the ground, and, seemingly oblivious to anything else, walked forward ten steps. Looking around, he said, “Well, where is he?”\u003c/p\u003e\n\u003cp\u003e“He’ll be at the Heavenly Fragrance Pavilion in Hangzhou, on July 15.”\u003c/p\u003e\n\u003cp\u003ePart 4\u003c/p\u003e\n\u003cp\u003eIt was July 15th, and the moon was full.\u003c/p\u003e\n\u003cp\u003eAt the Heavenly Fragrance Pavilion in Hangzhou, it was business as usual. It was almost time for the dinner rush, yet there wasn’t an empty table to be found.\u003c/p\u003e\n\u003cp\u003eBut today was different. Every table was full, both upstairs and downstairs, yet all the customers were strangers; the usual clientele were all refused entry.\u003c/p\u003e\n\u003cp\u003eIn fact, even Heavenly Fragrance’s best customer, Hangzhou City’s renowned Master Ma, couldn’t get a table.\u003c/p\u003e\n\u003cp\u003eMaster Ma’s face was flushed, and he was about to lose his temper. When Master Ma lost his temper, it was definitely not enjoyable.\u003c/p\u003e\n\u003cp\u003eHeavenly Fragrance’s proprietor hurried forward and bowed respectfully with hands clasped. Apologizing profusely, he promised to provide a complimentary meal comprised of the best dishes, as well as 50 fresh hairy crabs, delivered directly to Master Ma’s residence. Then he leaned forward and quietly whispered into Master’s Ma’s ear.\u003c/p\u003e\n\u003cp\u003eMaster Ma’s brow furrowed, and without a word, he spun around and left, followed by his retinue.\u003c/p\u003e\n\u003cp\u003eThe proprietor had just let out a sigh of relief when another group of people arrived. It was the Hangzhou 10,000 Victories Armed Escort Agency’s “10,00 Victories Golden Blade” Zheng Fanggang, accompanied by a group of armed escorts. They wore colorful clothes and rode powerful horses.\u003c/p\u003e\n\u003cp\u003eHead Escort Zhang was not as reasonable as Master Ma. “If all the tables are full, make some people leave.”\u003c/p\u003e\n\u003cp\u003eHe waved his hand dismissively at the proprietor as he prepared to go up the stairs to the second floor.\u003c/p\u003e\n\u003cp\u003eOn the stairs suddenly appeared two people, blocking his way.\u003c/p\u003e\n\u003cp\u003eThey were young men, delicate looking, almost pretty, wearing white stockings. Their hair was pitch black, unadorned by any sort of hat, and very long. Their waists were cinched by thin, silver belts.\u003c/p\u003e\n\u003cp\u003eHow unexpected that people would be willing to block the path of Head Escort Zhang!\u003c/p\u003e\n\u003cp\u003eThe 10,000 Victories Armed Escort Agency’s most highly ranked fighter, “Iron Palm” Sun Ping, was the first to step forward. “Do you want to die?” he snapped.\u003c/p\u003e\n\u003cp\u003eOne of the youths, who wore a green colored robe, smiled and said, “No, we don’t want to die.”\u003c/p\u003e\n\u003cp\u003eSun Ping responded, “If you don’t want to die, then get out of the way so these great masters can enter.”\u003c/p\u003e\n\u003cp\u003e“They cannot enter.”\u003c/p\u003e\n\u003cp\u003e“Do you know who they are?”\u003c/p\u003e\n\u003cp\u003e“No, I don’t.” The green-robed youth continued to smile. “I only know that today, it doesn’t matter if you are a great master, a normal master, or an apprentice, the best thing for you is to stay away.”\u003c/p\u003e\n\u003cp\u003e“And what if the great masters demand to enter?” Sun Ping replied angrily.\u003c/p\u003e\n\u003cp\u003e“If they step one foot onto the stairs,” the young man said calmly, “the living masters will quickly become dead masters.”\u003c/p\u003e\n\u003cp\u003eSun Ping howled and leaped forward, his “iron palm” already stretched out.\u003c/p\u003e\n\u003cp\u003eHis five fingers were flat as they shot forward. His iron sand palm technique was clearly quite exceptional; the hand move extremely fast.\u003c/p\u003e\n\u003cp\u003eIt shot forward, the wind generated by the palm powerful, and sharp as a blade.\u003c/p\u003e\n\u003cp\u003eThe green-robed youth smiled. Suddenly, his hand shot forward as well, chopping at Sun Ping’s wrist.\u003c/p\u003e\n\u003cp\u003eSun Ping had begun making his name at 17 years of age, climbing the ranks from initiate to full escort and winning hundreds of fights in the process. He was no fool. As it turned out, his initial move was a feint! His stance changed as his wrist dropped, and his hand shot toward the green-robed youth’s abdomen.\u003c/p\u003e\n\u003cp\u003eThis was the deadly strike of a killer; he clearly didn’t shy from taking lives.\u003c/p\u003e\n\u003cp\u003eBut the green-robed youth’s move was faster. Almost the same instant that his hand shot forward, his two fingers had already reached Sun Ping’s throat.\u003c/p\u003e\n\u003cp\u003eWith a puffing sound, the two fingers stabbed like swords into the jugular.\u003c/p\u003e\n\u003cp\u003eSun Ping’s eyes bulged, and the muscles in his body convulsed. His body appeared to lose control of itself as tears, mucus, saliva, blood, urine, even fecal matter oozed out from every orifice. He made no miserable sounds as one might expect; he merely collapsed to the ground.\u003c/p\u003e\n\u003cp\u003eThe green-robed youth slowly pulled out a snow-white handkerchief, and carefully wiped the blood from his hand. He didn’t cast a single glace at Sun Ping.\u003c/p\u003e\n\u003cp\u003eThe armed escorts stared blankly, looking about to vomit.\u003c/p\u003e\n\u003cp\u003eThey had all killed before, and had all seen people be killed, but seeing this, their stomachs shrank. A few couldn’t endure, and emptied their stomachs.\u003c/p\u003e\n\u003cp\u003eThe young man slowly folded up the handkerchief. “You still haven’t left yet?” he asked blandly.\u003c/p\u003e\n\u003cp\u003eHis martial arts were frightening, but if they left now, how could the 10,000 Victories Armed Escort Agency ever show their faces in Jianghu again? From amidst the armed escorts, there were already two who were getting ready to leap forward and fight.\u003c/p\u003e\n\u003cp\u003eBefore stepping a foot onto the stairs, they’d already placed one foot in the grave.\u003c/p\u003e\n\u003cp\u003eZheng Fanggang stretched out his hand and blocked their way.\u003c/p\u003e\n\u003cp\u003eHe’d noticed something very peculiar.\u003c/p\u003e\n\u003cp\u003eEven though the restaurant was filled with strangers, there was something they all shared in common.\u003c/p\u003e\n\u003cp\u003eNot a single person wore a hat of any type, and everyone’s hair was tied by a slender, silver-colored ribbon.\u003c/p\u003e\n\u003cp\u003eThere was blood splashed all over the stairs, but not a single customer had turned a head to look.\u003c/p\u003e\n\u003cp\u003eZheng Fanggang’s breathed was forced has he said in a low voice, “Friend, may I ask, what is your honorable name? Where are you from?”\u003c/p\u003e\n\u003cp\u003eThe green-robed youth smiled, “You don’t need to know. Knowing just one thing is enough for you.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003e“Outside the restaurant are the leaders of the Seven Great Sword Schools, and the heads of the Five Great Martial Sects. But even they can only stand outside. If they take a single step inside, they will die.”\u003c/p\u003e\n\u003cp\u003eZheng Fanggang’s face twisted. “Why?”\u003c/p\u003e\n\u003cp\u003e“Because,” replied the green-robed youth, “there’s someone inside who is waiting to treat some guests. Other than those three guests, he doesn’t want to see anyone else.”\u003c/p\u003e\n\u003cp\u003eZheng Fanggang couldn’t help but ask, “Who is this person?”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t need to ask that question. You should be able to figure it out on your own.”\u003c/p\u003e\n\u003cp\u003eZheng Fanggang’s face became pale white. “Don’t tell me it’s … him?” he asked hoarsely.\u003c/p\u003e\n\u003cp\u003eThe young man nodded. “Yes, it is.”\u003c/p\u003e\n\u003cp\u003eZheng Fanggang turned to leave, accompanied by the armed escorts.\u003c/p\u003e\n\u003cp\u003eAs they walked off, one of the escorts quietly asked, “Who is it?”\u003c/p\u003e\n\u003cp\u003eZheng Fanggang didn’t respond at first. He let out a long sigh, and finally said, “He lives among the clouds in heaven, and he is the greatest hero in the world.”\u003c/p\u003e\n\u003cp\u003ePart 5\u003c/p\u003e\n\u003cp\u003eHe sat in the upper floor of the restaurant in an elegant private room, on a wide bench.\u003c/p\u003e\n\u003cp\u003eHis face was pale white, his body thin and haggard, and in his eyes he carried an unspeakable exhaustion.\u003c/p\u003e\n\u003cp\u003eHe appeared to be not only tired, but also physically weak, even sick. Despite the heat of the day, the bench he sat on was covered with a colorful, spotted leopard fur, and his legs were concealed by a blanket of Persian felt. It was impossible to tell what material the felt was made from, but it glowed with a silvery light.\u003c/p\u003e\n\u003cp\u003eHe himself seemed to lack any bit of health or color whatsoever, and in fact appeared to have some sort of chronic illness. It looked as if he was weary of life, and that he had completely lost hope and faith in his own existence.\u003c/p\u003e\n\u003cp\u003eStanding tall and majestic behind him was a man with silver hair and a ruddy face, aged, but seemingly as powerful as a deity. This man was clearly in the winter of his life, yet his body seemed to be filled with the energy of a fierce predatory cat. His eyes shined with a brilliance that could shock a person’s soul, and would prevent most people from even daring to look in them.\u003c/p\u003e\n\u003cp\u003eYet, his attitude toward the sickly young man was extremely respectful. Anyone who witnessed this level of respect would never guess that in former years he had subdued all under heaven, and had stared down his nose in disdain at Jianghu. With his one-hundred pound iron hammer, he’d swept through the southern seven and northern six provinces, and defeated all the greatest of the outlaws. He had become one of the greatest masters of the martial world, had survived a hundred battles without a single defeat. He was the “Lion King” Lan Tianmeng.\u003c/p\u003e\n\u003cp\u003eIn addition, there was another man in the room, robed in green, with white stockings, face expressionless. A middle-aged man with graying temples, he was currently preparing tea for the sickly youth.\u003c/p\u003e\n\u003cp\u003eHis every move was made with extreme precision, as if he was afraid of making the slightest mistake.\u003c/p\u003e\n\u003cp\u003eThe tea that came out of the teapot was scalding hot; he held the teacup with both hands, carefully tasting the tea to check its temperature. He continued to hold the cup until the tea had cooled some.\u003c/p\u003e\n\u003cp\u003eThe sick young man accepted the tea, and carefully took a sip.\u003c/p\u003e\n\u003cp\u003eHis hands were devoid of color, the fingers long and delicate, and it seemed as if even holding a cup of tea was an exertion.\u003c/p\u003e\n\u003cp\u003eAnd yet, he was the greatest hero under the heavens, Dragon Fifth.\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eThere was no one else in the room, and no one entered.\u003c/p\u003e\n\u003cp\u003eDragon Fifth let out a light sigh and said, “I haven’t waited for anyone in at least five or six years.”\u003c/p\u003e\n\u003cp\u003e“Correct,” said Lan Tianmeng.\u003c/p\u003e\n\u003cp\u003e“And yet today I’ve been waiting for over an hour.”\u003c/p\u003e\n\u003cp\u003e“Correct.”\u003c/p\u003e\n\u003cp\u003e“Last time I had to wait, I think it was for Magistrate Qian.”\u003c/p\u003e\n\u003cp\u003e“And he won’t be making anyone wait ever again.”\u003c/p\u003e\n\u003cp\u003eDragon Fifth sighed lightly. “He died very miserably.”\u003c/p\u003e\n\u003cp\u003eNo one would wait for a dead person.\u003c/p\u003e\n\u003cp\u003eLan Tianmeng said, “In the future, no one will wait for Du Qi and the others, either.”\u003c/p\u003e\n\u003cp\u003e“That is a matter for the future.”\u003c/p\u003e\n\u003cp\u003e“For now, they can’t die?”\u003c/p\u003e\n\u003cp\u003e“They can’t.”\u003c/p\u003e\n\u003cp\u003e“You absolutely must use them to handle this matter?”\u003c/p\u003e\n\u003cp\u003eDragon Fifth nodded his head and said no more. It seemed he had decided that too much had been said, that he was too tired. He wasn’t a person of many words.\u003c/p\u003e\n\u003cp\u003eHe was also the type of person that was willing to listen, but did not wish to hear too much. If he wasn’t willing to open his mouth, other people usually shut theirs.\u003c/p\u003e\n\u003cp\u003eThe faint aroma of tea filled the room. Outside was very quiet. Even though there were more than twenty tables filled with people, not one word could be heard.\u003c/p\u003e\n\u003cp\u003eThe recently replaced room curtain, now made of green fabric, suddenly parted, and a waiter entered. He wore a short-sleeved blue jacket and his hair hung down. Clasped in his hands was a lidded, blue and white porcelain vessel.\u003c/p\u003e\n\u003cp\u003eLan Tianmei frowned and said, “Get out of here.”\u003c/p\u003e\n\u003cp\u003eThe waiter didn’t leave. In a humble voice he said, “I’m here to serve some food.”\u003c/p\u003e\n\u003cp\u003e“Who asked you to serve food?” said Lan Tianmei angrily. “The guests aren’t here yet.”\u003c/p\u003e\n\u003cp\u003eThe waiter suddenly laughed, then calmly said, “I’m sorry to say the three guests won’t be coming.”\u003c/p\u003e\n\u003cp\u003eWithin Dragon Fifth’s weary eyes suddenly shone forth an expression as sharp as a blade. He stared at the young man’s face.\u003c/p\u003e\n\u003cp\u003eHis face was round, with a sincere smile, and even though there were wrinkles at the corners of his eyes, his eyes were still young. They carried a youthful innocence and purity.\u003c/p\u003e\n\u003cp\u003eAnyone could see that he was a soft-hearted individual with a good temper, a person who liked to make friends, and who cared for children.\u003c/p\u003e\n\u003cp\u003eAny woman who married a man like this would not suffer at all, and would never have any regrets.\u003c/p\u003e\n\u003cp\u003eDragon Fifth starred at him, and after a while, slowly asked, “You’re saying the guests aren’t coming?”\u003c/p\u003e\n\u003cp\u003eThe waiter nodded. “They definitely won’t be coming.”\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003eThe waiter didn’t respond. Instead, he placed one hand on the blue and white porcelain bowl, set it down carefully on the table, and then slowly lifted off the lid.\u003c/p\u003e\n\u003cp\u003eDragon Fifth’s pupils suddenly shrank, and a strange smile appeared on his lips. “This looks like a great dish,” he said slowly.\u003c/p\u003e\n\u003cp\u003eThe waiter smiled. “It’s not just a great dish, it’s an expensive one.”\u003c/p\u003e\n\u003cp\u003eDragon Fifth had to agree. “Definitely extremely expensive.”\u003c/p\u003e\n\u003cp\u003eThis dish actually couldn’t be eaten. In the bowl was neither mountain pheasant and bear claw soup, nor shark fin soup, nor humpback grouper stew, but instead… three hands.\u003c/p\u003e\n\u003cp\u003eThree human hands!\u003c/p\u003e\n\u003cp\u003e**\u003c/p\u003e\n\u003cp\u003eThe three hands were neatly arrayed within the blue and white porcelain bowl. One very large hand, and two others, a left and a right hand.\u003c/p\u003e\n\u003cp\u003eThe large hand was larger than the average person’s hand by three times. The left hand had two extra fingers, and the right hand was missing three.\u003c/p\u003e\n\u003cp\u003eIn the entire world, there was no dish that could contain any ingredient as expensive as these three hands. Even if the dish was filled with jasper and gold and pearls, it still would be lacking. In fact, no one could truly estimate the value of these three hands.\u003c/p\u003e\n\u003cp\u003eDragon Fifth obviously recognized the three hands. He couldn’t help but quietly sigh, “It appears they really won’t be coming.”\u003c/p\u003e\n\u003cp\u003eThe waiter smiled. “But, I have come.”\u003c/p\u003e\n\u003cp\u003e“You?”\u003c/p\u003e\n\u003cp\u003e“Even though they haven’t come, my coming is the same thing.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003eThe waiter said, “They definitely weren’t friends of yours.”\u003c/p\u003e\n\u003cp\u003e“I don’t have friends,” responded Dragon Fifth, coldly.\u003c/p\u003e\n\u003cp\u003eHis eyelids drooped. He appeared to be very tired and lonely.\u003c/p\u003e\n\u003cp\u003eThe waiter seemed to understand the mood he was in and said, “Well, if you don’t have friends, then you must not have enemies, either.”\u003c/p\u003e\n\u003cp\u003eDragon Fifth looked at him again. “You aren’t stupid.”\u003c/p\u003e\n\u003cp\u003e“If you invited them here, it must be to accomplish some great task.”\u003c/p\u003e\n\u003cp\u003e“You really aren’t stupid!”\u003c/p\u003e\n\u003cp\u003eThe waiter laughed. “So, here I am. Whatever they could do, I can do too.”\u003c/p\u003e\n\u003cp\u003e“What those three could accomplish together, you can accomplish alone?”\u003c/p\u003e\n\u003cp\u003e“I’ve been looking for something to do.”\u003c/p\u003e\n\u003cp\u003e“Splitting light and catching shadows, one hand seven killers.” Dragon Fifth gazed at the left hand in the bowl. “Do you know how many people this hand killed? Do you know how quickly he could kill people?”\u003c/p\u003e\n\u003cp\u003e“No, I don’t.”\u003c/p\u003e\n\u003cp\u003e“The Miracle Hand Thief, nothing can be hidden safely.” Dragon Fifth fixed his gaze on the right hand, which was missing three fingers. “Do you know how many rare treasures this hand stole? Do you know how nimble and dexterous it was?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“The Giant Spirit Palm, power to lift a thousand pounds.” Dragon Fifth glanced again at the third hand. “Do you know how mystically strong this hand was?”\u003c/p\u003e\n\u003cp\u003e“No, I don’t.”\u003c/p\u003e\n\u003cp\u003eDragon Fifth laughed coldly. “You don’t know anything, and yet you think you can accomplish what these three could?”\u003c/p\u003e\n\u003cp\u003e“I only know one thing.”\u003c/p\u003e\n\u003cp\u003e“What’s that?”\u003c/p\u003e\n\u003cp\u003eThe waiter’s calm reply was, “I know that my hands are outside of this bowl, and those three are inside!”\u003c/p\u003e\n\u003cp\u003eDragon Fifth head lifted, and he gazed at the waiter. “Is it because of you that their hands are inside the bowl?”\u003c/p\u003e\n\u003cp\u003eThe waiter laughed again. “If one wants to sell something, they should first provide something for the customer to look at.”\u003c/p\u003e\n\u003cp\u003eDragon Fifth’s eyes shined sharply again. “What do you want to sell?”\u003c/p\u003e\n\u003cp\u003e“Myself.”\u003c/p\u003e\n\u003cp\u003e“Who are you?”\u003c/p\u003e\n\u003cp\u003e“I’m surnamed Liu, as in willow tree.” It was a strange surname. “My given name is Changjie. ‘Chang’ as in long, ‘jie’ as in street.” \u003ca href\u003d\"#footnote_4\"\u003e[4]\u003c/a\u003e\u003c/p\u003e\n\u003cp\u003e“Liu Changjie!” exclaimed Dragon Fifth. “What a strange name.”\u003c/p\u003e\n\u003cp\u003e“Many people have asked me why I picked such a strange name,” said Liu Changjie. “It’s because I like long streets.” He continued, laughing, “I always thought, if I could be a very long street, lined on both sides with willow trees, with all types of shops on either side, then every day, all different types of people would walk on my body; young girls, married women, little kids, even old grandmothers…”\u003c/p\u003e\n\u003cp\u003eHis eyes appeared to be that of a child imagining some fantasy scene, a strange and beautiful fantasy. “Every day I would watch these people strolling happily across my body, chatting under the willow trees, buying things in the shops. Wouldn’t that be such an interesting thing? Much more interesting than being a person.”\u003c/p\u003e\n\u003cp\u003eDragon Fifth laughed.\u003c/p\u003e\n\u003cp\u003eFor the first time a smile fell across his face, and he laughed. “You are a very interesting person.” As soon as the sentence was out of his mouth, his smile disappeared. “Help me kill this very interesting person!”\u003c/p\u003e\n\u003cp\u003eLan Tianmeng had been standing like a rock behind him, but as soon as the word “kill” was spoken, he leapt into action.\u003c/p\u003e\n\u003cp\u003eThe instant his hand stretched out, his entire countenance changed to that of a fierce male lion. Except, he was faster and more nimble than a lion.\u003c/p\u003e\n\u003cp\u003eHis body spun, and he was in front of Liu Changjie, the five fingers of his left hand curled into a claw, striking toward the chest.\u003c/p\u003e\n\u003cp\u003eAnyone could see that this attack could rip apart a person’s chest and tear out their heart and lungs.\u003c/p\u003e\n\u003cp\u003eLiu Changjie sidestepped, avoiding the claw. His movement was ingenious and extremely fast.\u003c/p\u003e\n\u003cp\u003eSurprisingly, Lan Tianmeng had anticipated this evasive maneuver. The five fingers of his right hand straightened, and a “hand blade” chopped down, slicing toward the artery on the right side of Liu Changjie’s neck.\u003c/p\u003e\n\u003cp\u003eThis second move was not only lethal, it had never been evaded by a single enemy.\u003c/p\u003e\n\u003cp\u003eAfter the age of 40, “Lion King” Lan Tianmeng had rarely used this second stance when seeking to kill an enemy.\u003c/p\u003e\n\u003cp\u003eThe power of Liu Changjie’s defensive move was depleted, there was no way for him to exert any more effort defensively, and no way for him to change his movement.\u003c/p\u003e\n\u003cp\u003eThe Lion King was sure he wouldn’t need to use the third stance to complete the kill.\u003c/p\u003e\n\u003cp\u003eHe definitely didn’t need to use the third stance. Because he suddenly noticed that Liu Changjie’s hand was beneath his arm. If he continued to chop down, his arm would definitely strike Liu Changjie’s hand. The elbow joint was soft and brittle, and if Liu Changjie’s finger, hooked like a phoenix eye, struck the elbow, the joint would be shattered.\u003c/p\u003e\n\u003cp\u003eHe would not court that type of danger. His hand stopped in mid-air, and in that exact moment, Liu Changjie dashed out of the room.\u003c/p\u003e\n\u003cp\u003eLan Tianmeng didn’t make a follow-up attack, because Dragon Fifth had already stretched out his hand to prevent him, and said, “Come back in.”\u003c/p\u003e\n\u003cp\u003eWhen Liu Changjie entered the room again, Lan Tianmeng was again standing like a rock behind Dragon Fifth. The green-robed, middle-aged man with white stockings stood in the far corner of the room, not moving a muscle.\u003c/p\u003e\n\u003cp\u003e“You said I’m a very interesting person. This world doesn’t have very many interesting people in it.” Liu Changjie sounded very bitter. “Why do you want to kill me?”\u003c/p\u003e\n\u003cp\u003e“Sometimes I like to tell lies,” said Dragon Fifth, “but I don’t like to be lied to.”\u003c/p\u003e\n\u003cp\u003e“Who lied to you?”\u003c/p\u003e\n\u003cp\u003e“You did!”\u003c/p\u003e\n\u003cp\u003eLiu Changjie laughed. “Sometimes I like to hear lies, but I never tell them.”\u003c/p\u003e\n\u003cp\u003e“The name ‘Liu Changjie,’” said Dragon Fifth. “I’ve never heard it before.”\u003c/p\u003e\n\u003cp\u003e“I’ve never really been a famous person.”\u003c/p\u003e\n\u003cp\u003e“Du Qi, Gongsun Miao, Shi Zhong. They are all famous names, and you defeated them.”\u003c/p\u003e\n\u003cp\u003e“So, you think that I should be famous?”\u003c/p\u003e\n\u003cp\u003e“I think that you are lying.”\u003c/p\u003e\n\u003cp\u003eLiu Changjie laughed. “I’m thirty years old this year. If I was seeking fame, I would be dead on the floor right now.”\u003c/p\u003e\n\u003cp\u003eDragon Fifth gazed at him, and a smiling expression could be seen in his eyes. He understood what Liu Changjie meant.\u003c/p\u003e\n\u003cp\u003eSeeking fame took a lot of hard work; practicing martial arts also took a lot of hard word. Not very many people could do both things at the same time.\u003c/p\u003e\n\u003cp\u003eLiu Changjie did not appear to be an extremely intelligent person, so he could only select one of the two options.\u003c/p\u003e\n\u003cp\u003eHe had chosen to practice martial arts. Therefore, he was not famous, but still alive.\u003c/p\u003e\n\u003cp\u003eHis words were not necessarily easy to understand, but Dragon Fifth understood them, so he lifted a finger and gestured at the chair in front of him. “Sit down.”\u003c/p\u003e\n\u003cp\u003eNot very many people got the chance to sit in front of Dragon Fifth.\u003c/p\u003e\n\u003cp\u003eLiu Changjie didn’t sit down. “Are you getting ready to kill me?”\u003c/p\u003e\n\u003cp\u003eDragon Fifth said, “Interesting people are not common, and useful people even less common. Yet you are both.”\u003c/p\u003e\n\u003cp\u003eLiu Changjie laughed. “So you’re getting ready to buy me?”\u003c/p\u003e\n\u003cp\u003e“You really want to sell yourself?”\u003c/p\u003e\n\u003cp\u003e“I’m not a famous person,” Liu Changjie replied. “And I have nothing else I can sell. But when a person reaches thirty years of age, it’s hard to avoid the desire to enjoy life.”\u003c/p\u003e\n\u003cp\u003e“For people like you, there should be many opportunities to sell yourself, why did you come looking for me?”\u003c/p\u003e\n\u003cp\u003e“Because I’m not stupid. Because the price I want is very high. Because I know you can afford the price. Because …”\u003c/p\u003e\n\u003cp\u003e“These three reasons are enough!” interrupted Dragon Fifth.\u003c/p\u003e\n\u003cp\u003e“But these three reasons aren’t the most important.”\u003c/p\u003e\n\u003cp\u003e“Oh?”\u003c/p\u003e\n\u003cp\u003e“The most important is that I not only want to make a large amount of money, I also want to accomplish something great. If someone wants Du Qi and the others to accomplish some task, that task is obviously very important.”\u003c/p\u003e\n\u003cp\u003eOn Dragon Fifth’s pale white face, there once again appeared a smile. He lifted his hand and said, “Please, sit.”\u003c/p\u003e\n\u003cp\u003eThis time, Liu Changjie sat down.\u003c/p\u003e\n\u003cp\u003eDragon Fifth said, “Bring wine.”\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_1\"\u003e[1] Jianghu literally means “lakes and rivers”, and is the sub-community of China in which Wuxia stories are set. Jianghu is made up mostly of martial artists who are usually congregated in sects, clans, disciplines and various schools of martial arts. It is also inhabited by others such as nobles, thieves, beggars, priests, healers, merchants and craftsmen.\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_2\"\u003e[2] The martial world refers to the community of martial artist within Jianghu\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_3\"\u003e[3] Shi Zhong\u0027s name in chinese is 石重 shí zhòng. The first character means stone or rock, and the second character means heavy, so his name literally could be translated as \"heavy stone.\"\u003c/span\u003e\u003c/p\u003e\n\u003cp\u003e\u003cspan class\u003d\"footnote\" id\u003d\"footnote_4\"\u003e[4] His name 柳长街 could be literally translated as Long Street Liu.\u003c/span\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/7-killers/7k-chapter-7-1\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/7-killers/7k-chapter-7","bookId":1495,"creation":"Sep 10, 2019 12:43:11 AM","modification":"Sep 10, 2019 12:43:11 AM"}
