{"id":72485,"no":40,"title":"Page 40","content":"\u003cp\u003eThe most darling part was when you went to that panic room and went all James Bond to figure out who I was. But guess what, bitches? I’ve been a step ahead of you this whole time. I’ve known where you were. I’ve known where you were going. I call the shots, not you—in ways you can’t even begin to imagine. But don’t worry—you’ll see soon enough. Just open the shed. —A\u003c/p\u003e\n\u003cp\u003eHanna’s head shot up when she finished. “Just open the shed?”\u003c/p\u003e\n\u003cp\u003e“Guys, it’s definitely a trap.” Spencer’s hands trembled.\u003c/p\u003e\n\u003cp\u003e“Maybe it’s dangerous that we’re even here,” Emily whispered.\u003c/p\u003e\n\u003cp\u003e“Girls?” Harrison loomed over them, hands on his hips. “What’s going on?”\u003c/p\u003e\n\u003cp\u003eAria was about to answer, but then her gaze focused on the shed. To her horror, one of the soccer players was jogging toward it. His hand reached out for the doorknob.\u003c/p\u003e\n\u003cp\u003e“Wait!” Aria sprinted for him. “Don’t open that!” Her mind whirled with all the possibilities of what could be inside. Explosives. Wild animals. Ali herself.\u003c/p\u003e\n\u003cp\u003e“Don’t open it!” Aria screamed again. Spencer, Emily, Hanna, and the two officers followed, yelling at the boy as well.\u003c/p\u003e\n\u003cp\u003eBut it was too late—he was already pulling on the handle. The shed door creaked open, the bottom getting caught on the tall grass.\u003c/p\u003e\n\u003cp\u003eCoates pushed the boy aside and tried to shut it again, but then he paused, his face going pale. “Shit,” he whispered.\u003c/p\u003e\n\u003cp\u003eAria peered inside. For the first half second, all she saw was darkness. Then, shapes began to form: balls, sticks, mats, hurdles, goal nets. When she saw the object sitting on a chair in the back of the room, she thought that it was just another piece of sports equipment—a speed bag, maybe, or a blocking sled for Rosewood Day’s less-than-stellar football team.\u003c/p\u003e\n\u003cp\u003eThen an arm appeared. Two feet. A head hung limply on a neck. Aria took a step closer, knowing a split second before seeing his face who it was going to be. She sank to her knees and let out a howl. Hanna gasped. Spencer screamed. Emily took a few big steps back, her mouth frozen in terror. The soccer boy spun around and threw up in the grass. Coates and Harrison shooed the other players away.\u003c/p\u003e\n\u003cp\u003e“Is that . . . ?” Spencer wailed.\u003c/p\u003e\n\u003cp\u003eMercifully, she didn’t say his name. Aria stared at the top of Noel’s head. He was still in his tuxedo jacket, and his arms were pinned behind his back, his ankles tied to the chair. There was a big strip of duct tape over his mouth. His skin was eerily pale, and there were huge gashes on his cheeks, like he’d been badly beaten.\u003c/p\u003e\n\u003cp\u003eIt felt like cymbals were crashing in her head. This isn’t happening. This can’t be happening.\u003c/p\u003e\n\u003cp\u003e“I need an ambulance!” Hanna screamed into her phone. “Do something!” Spencer bellowed to Coates, who was shouting something into his walkie-talkie. But Aria hardly heard them. She lay on the splintered ground of the shed, unable to move any closer to Noel, petrified to see whether he was dead or alive. All she saw, in that moment, were the shiny shoes on his feet. She’d been with him when he bought those shoes. He’d tried on a bunch of pairs in the store, just like a girl. A stylish girl deserves a stylish guy, he’d told her with a wink.\u003c/p\u003e\n\u003cp\u003eHer phone beeped in her ear. Somehow, she had the sense to sit up and look at the screen. Behind her, her friends were scrambling around, trying to make sense of what they were seeing. But as their phones beeped, each of them paused to look at the heartbreaking message on their screens.\u003c/p\u003e\n\u003cp\u003eTwinkle, twinkle, little liars,\u003c/p\u003e\n\u003cp\u003eYour situation has become quite dire.\u003c/p\u003e\n\u003cp\u003eSleuths you’re not; you haven’t solved shit.\u003c/p\u003e\n\u003cp\u003eNoel as A? Not it!\u003c/p\u003e\n\u003cp\u003e—A\u003c/p\u003e\n\u003cp\u003eWhat Happens Next . . .\u003c/p\u003e\n\u003cp\u003eSo the liars finally figured out there are two of us. Took ’em long enough. But they still didn’t get the story right. They were too hung up on investigating Noel to see what’s right under their pert little noses: us. But the noose is tightening and soon they’ll be the ones hanging on by a thread. . . .\u003c/p\u003e\n\u003cp\u003eHanna may have been voted queen of the prom court, but the next court she’s in will be of the criminal variety. Last time we checked, hitting-and-running is still a felony. . . . Once Daddy’s constituents find out, Hanna won’t be the only loser in the Marin family.\u003c/p\u003e\n\u003cp\u003eSpencer went chase-ing conspiracy theories, and entre nous, she got a little too close for comfort. But Spence still has a lot to learn about stalking. Like, it’s not actually sneaking up on us if we see you coming.\u003c/p\u003e\n\u003cp\u003eSo Emily’s pretty little girlfriend is in Bonaire. We can think of a few people who might be interested in that tidbit, starting with Special Agent Jasmine Fuji. Emily better get started on a bucket list of her own—it’s only a matter of time before she and Jordan end up behind bars. Or worse.\u003c/p\u003e\n\u003cp\u003eAnd then there’s Aria. Noel may not be A, but he’s as two faced as they come. What did she expect from a Typical Rosewood? So what will Atypical Aria do? Our money’s on an artistic retreat to Europe. But doesn’t she know all tortured artists die young?\u003c/p\u003e\n\u003cp\u003eTick tock, ladies. Live each moment like it’s your last. Because soon enough, it will be.\u003c/p\u003e\n\u003cp\u003eUntil next time . . .\u003c/p\u003e\n\u003cp\u003e—A \u0026amp; A \u003c/p\u003e","sourceLink":"https://allnovel.net/crushed-pretty-little-liars-13/page-40.html","bookId":2389,"creation":"Oct 5, 2019 10:24:21 AM","modification":"Oct 5, 2019 10:24:21 AM"}
