{"id":70158,"no":12,"title":"Page 12","content":"\u003cp\u003e“Prop yourself on your elbows.”\u003c/p\u003e\n\u003cp\u003eShe looked at Cam across the length of her body.\u003c/p\u003e\n\u003cp\u003eHe curled his hands around her knees and set her feet on the table. In a purposefully drawn-out and sexy move, he teased her sundress up over her thighs and hips until it bunched at her waist.\u003c/p\u003e\n\u003cp\u003eThank God she’d worn decent underwear.\u003c/p\u003e\n\u003cp\u003eCam idly traced the triangle of fabric stretched over her groin. “I wouldn’t have pegged you as the black lace type. But it looks damn good against your snowy white skin.” He urged to her raise her hips, slipped the scrap of lace from her body and tossed it aside. Cam lowered his head and kissed her belly button. He paused at the surgical scar below it.\u003c/p\u003e\n\u003cp\u003ePlease don’t ask. Please don’t ask now.\u003c/p\u003e\n\u003cp\u003e“What’s this from?” His thumb followed the white slash.\u003c/p\u003e\n\u003cp\u003e“Appendix,” she said automatically.\u003c/p\u003e\n\u003cp\u003e“Huh. That’s a weird place for it.” He tickled it with his tongue. “They must do surgery different in the Ukraine, huh?” While he teased her skin with little licks and nipping kisses, he noticed the other dog bite scar on her hip. Next thing she knew, he lovingly placed sweet, healing kisses over every inch. Her heart soared as she melted.\u003c/p\u003e\n\u003cp\u003e“Cam.”\u003c/p\u003e\n\u003cp\u003e“I know, baby, I’m getting there.” The kisses ventured southward, over the blonde hair covering her mound. He stopped to suck the hidden nub at the top of her sex, just once, very gently. Then he used his tongue to separate her pussy lips until the tip of his tongue hit the mouth of her sex. He groaned. “You taste as sweet and hot between your legs as I imagined.”\u003c/p\u003e\n\u003cp\u003eHer entire body trembled.\u003c/p\u003e\n\u003cp\u003e“I’ll let you come fast this first time.” He burrowed his tongue deep into her channel. Once. Twice. Three times. “After that, the wait’ll be longer but the payoff will be sweeter.” His hands slipped under her butt cheeks and he brought her weeping sex to his mouth. “Watch.” Cam lapped. He licked. He sucked. He fucked her with his tongue, lavishing attention on every quivering millimeter of her swollen flesh…except her clitoris.\u003c/p\u003e\n\u003cp\u003eSo much for letting her come soon. Her disgruntled sigh caught his notice.\u003c/p\u003e\n\u003cp\u003e“Something you need, princess?”\u003c/p\u003e\n\u003cp\u003e“To come! You said fast. This isn’t fast, this is torture!”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “Oh, I’m gonna have such a great time teaching you patience.”\u003c/p\u003e\n\u003cp\u003e“Can I learn it later?”\u003c/p\u003e\n\u003cp\u003e“Yep. Now hold tight.” He formed a small circle with his lips and pressed his mouth directly over her clit. He flicked his tongue across it. Let his teeth graze it. Cam closed his eyes as if he were in heaven and started to suck.\u003c/p\u003e\n\u003cp\u003eDomini’s pelvis shot up at the escalating rhythmic pulls of his mouth. The slow hum of sensation beneath the surface of her skin picked up heat and speed. Her hands, her thighs, her teeth clenched hard and then all at once, she detonated.\u003c/p\u003e\n\u003cp\u003eCam steadily sucked through every twist of her hips, every hoarse cry tumbling from her lips. Sweat coated her body, blood pounded in her ears. When the last pulse weakened, Cam nuzzled the inside of her leg. Domini flopped back on the table and tried to catch her breath.\u003c/p\u003e\n\u003cp\u003eBut her respite didn’t last more than fifteen seconds. The heat from Cam’s body radiated above hers. “Domini.”\u003c/p\u003e\n\u003cp\u003eShe pried her eyelids open at the sexy sound of her name rumbling from his throat. The passion in the depths of his eyes sent a shiver through her.\u003c/p\u003e\n\u003cp\u003eHe drawled, “My turn.” He slid her down and flipped her on her belly. “Grab the edge of the table. Like that. Don’t move your hands, your body, anything.” Cam widened her stance. Even as tall as she was, her tiptoes barely touched the floor. She felt a little wanton. A little helpless. More than a little turned on.\u003c/p\u003e\n\u003cp\u003eCam rolled the dress up to her hipbones. “I’ve been thinking about goin’ down on you since the first time I saw you in Dewey’s with a smudge of flour on your cheek.” He traced her moist cleft and he plunged one finger inside. “I wondered how you’d taste. Now every time I look at you I’ll remember the tang of you on my tongue. The smell of your sweet juices on my face.”\u003c/p\u003e\n\u003cp\u003eHer pulse spiked hearing the metallic jangle as he unbuckled his belt.\u003c/p\u003e\n\u003cp\u003e“When you started to come against my mouth? Showing me you’re not shy about grinding that juicy pussy into my face, showing me how much you loved what I was doin’ to you…I damn near came right along with you.”\u003c/p\u003e\n\u003cp\u003eDomini almost came again from his dirty-talking play-by-play.\u003c/p\u003e\n\u003cp\u003eA long zip was followed by the shuffling whisper of his clothing hitting the floor. Then all that hot, male hardness was crowded against her backside.\u003c/p\u003e\n\u003cp\u003eWhen Cam leaned closer to bury his face in her hair, she wished they were naked so she could feel his chest against her back. He didn’t move his body even as she felt tension vibrating within him. “Cam? You okay?”\u003c/p\u003e\n\u003cp\u003eA kiss bussed the top of her ear. “I’m exactly where I’ve wanted to be for too damn long.” He positioned the tip of his cock at her entrance and worked his thick shaft inside to the hilt. Cam pulled all the way out. He eased back in as slowly as he did the first time. Twice more. Without warning his hips flexed hard, rocking her to the core as he rocked the table.\u003c/p\u003e\n\u003cp\u003eCam’s hands were curled around her hips to protect her hipbones from banging into the table edge. He never altered in his pace. And Cam had been right in one respect: this time was all about him. No sweet kisses. No murmured words of encouragement. No loving caresses. Just pure fucking.\u003c/p\u003e\n\u003cp\u003eDomini’s vision wavered. She wanted to wrap her fingers around some part of Cam’s hard body, not the hard table. Even the stroke of his hand on hers would deepen their connection.\u003c/p\u003e\n\u003cp\u003eThere is no deeper connection. It’s just sex.\u003c/p\u003e\n\u003cp\u003eHer body didn’t care about any kind of connection beyond purely physical. A small orgasm pulsed and the contraction sent Cam over the edge, he grunted and bumped his pelvis as his cock emptied, coating her insides with a blast of liquid heat.\u003c/p\u003e\n\u003cp\u003eNeither attempted to move. Their labored breathing was the only sound in the room.\u003c/p\u003e\n\u003cp\u003eFinally, Cam said, “Hang on. I’ll get a towel.” A gush of wetness ran down her leg. She heard him yank his pants up and fumble with the belt. Water ran in the kitchen sink.\u003c/p\u003e\n\u003cp\u003eShe pushed up, unnerved by his rapid retreat. Would he reset the distance between them again? An anxious feeling bloomed, but when she spun around, Cam was right there. Kissing her in that sinful way of his. Gently mopping the stickiness between her thighs.\u003c/p\u003e\n\u003cp\u003e“You said it’d been a while. Are you sore?”\u003c/p\u003e\n\u003cp\u003e“A little.”\u003c/p\u003e\n\u003cp\u003e“Sore enough to keep me from having you again?”\u003c/p\u003e\n\u003cp\u003eImmediately her nipples hardened with interest. “Right now?”\u003c/p\u003e\n\u003cp\u003e“If I could get it up right now, it’d be right now. And then I’d wanna do it again right after that. But I need a little recovery time first.” He smoothed her dress down. “I’m getting old.”\u003c/p\u003e\n\u003cp\u003e“How old are you?”\u003c/p\u003e\n\u003cp\u003e“Between thirty and death,” he deadpanned.\u003c/p\u003e\n\u003cp\u003e“Funny.” She spied her panties on the floor. As she reached for them, Cam’s rough-skinned hand circled her wrist.\u003c/p\u003e\n\u003cp\u003e“Huh-uh. No panties while you’re here today.”\u003c/p\u003e\n\u003cp\u003e“I hope we’re not going horseback riding.”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “Nope.”\u003c/p\u003e\n\u003cp\u003e“If I’m minus an article of clothing, you should be too.”\u003c/p\u003e\n\u003cp\u003eA cool appraisal settled on Cam’s face. “Oh yeah? Like what?”\u003c/p\u003e\n\u003cp\u003e“Ditch your shirt.”\u003c/p\u003e\n\u003cp\u003eCam didn’t budge.\u003c/p\u003e\n\u003cp\u003eChances were good Domini didn’t have the nerve to push him on this issue.\u003c/p\u003e\n\u003cp\u003e“I’m not backing down. Show me your chest.”\u003c/p\u003e\n\u003cp\u003eSecretly pleased to see feistiness lurking beneath her placid demeanor, Cam yanked the tank top over his head.\u003c/p\u003e\n\u003cp\u003eShe whistled.\u003c/p\u003e\n\u003cp\u003eHe blushed, grateful she didn’t focus on the ugly shrapnel marks and gouges marring the skin on his belly. And on his chest. Marks that were all over the goddamn place.\u003c/p\u003e\n\u003cp\u003eThose marks aren’t nearly as ugly as your stump.\u003c/p\u003e\n\u003cp\u003eShe flattened her palms on his chest and kissed his scowling mouth.\u003c/p\u003e\n\u003cp\u003eNaturally his stomach chose that moment to rumble with hunger. “Sorry.”\u003c/p\u003e\n\u003cp\u003e“I’m hungry too. What do you have to eat?”\u003c/p\u003e\n\u003cp\u003e“Not much.”\u003c/p\u003e\n\u003cp\u003e“I’m sure I could figure something out. Mind if I poke around in your kitchen?”\u003c/p\u003e\n\u003cp\u003e“Have at it.”\u003c/p\u003e\n\u003cp\u003eCam stood behind Domini as she surveyed the meager contents of his refrigerator. Milk. Beer. Condiments. Cheese. Lunch meat. Grapes. A half a loaf of wheat bread.\u003c/p\u003e\n\u003cp\u003e“Pretty sad, huh?”\u003c/p\u003e\n\u003cp\u003e“What do you cook?”\u003c/p\u003e\n\u003cp\u003e“I don’t cook.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“Never needed to learn.”\u003c/p\u003e\n\u003cp\u003eShe tossed sandwich fixings on the counter and washed her hands. “Some of us had no choice.”\u003c/p\u003e\n\u003cp\u003e“Is that why you know so much about cooking?”\u003c/p\u003e\n\u003cp\u003e“Yes. Can you get me a knife?”\u003c/p\u003e\n\u003cp\u003eCam rummaged in a drawer and set a dull butcher knife and a bread knife on the counter. “Where did you learn?”\u003c/p\u003e\n\u003cp\u003e“Hands on mostly. The church group that brought me to the U.S. had missionary outreach posts all over the states. We traveled a lot. We’d have to fix three meals a day for the church leaders and members who were out spreading the word.”\u003c/p\u003e\n\u003cp\u003e“How long did you do that?”\u003c/p\u003e\n\u003cp\u003e“Day in, day out for years. Until I realized I could apply for citizenship and escaped.” She gestured to the cupboards. “Will you grab plates?”\u003c/p\u003e\n\u003cp\u003e“Sure.” Cam didn’t ask questions but he knew there was way more to the story than the bits she’d shared.\u003c/p\u003e\n\u003cp\u003eThey sat side by side and ate. His ham and cheese sandwiches never tasted this good, even if he used the same damn ingredients. Might be sappy, but little domestic things like this made him feel cared for, probably because these cozy moments were so rare in his life. He glanced over at her and his glass of milk stopped halfway to his mouth.\u003c/p\u003e\n\u003cp\u003eDomini’s fingers fondled the two fat purple grapes left on her plate. Gauging the tightness and fullness of the globes containing all that sweet juice, she plucked one from the vine and popped it in her mouth. \u003c/p\u003e","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-12.html","bookId":2687,"creation":"Oct 5, 2019 10:15:55 AM","modification":"Oct 5, 2019 10:15:55 AM"}
