{"id":70149,"no":3,"title":"Page 3","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eWhen Keely tucked away yet another hot cowboy’s phone number into her jeans pocket, Chassie said, “You’re so bad.”\u003c/p\u003e\n\u003cp\u003eThe bad girl batted her eyelashes. “Why, whatever do you mean?”\u003c/p\u003e\n\u003cp\u003e“How many men do you have on a string right now?”\u003c/p\u003e\n\u003cp\u003e“That’s rich, coming from a woman who lives with two guys,” Keely shot back.\u003c/p\u003e\n\u003cp\u003e“Ooh. Ouch,” Ramona said with a wince.\u003c/p\u003e\n\u003cp\u003eChassie bumped Keely with her shoulder. “I’m living with three guys if you count my sweet baby Westin. He’s at such a cute stage right now. Trev and Ed are always—”\u003c/p\u003e\n\u003cp\u003e“Can it, Chass. No baby talk tonight. Remember?”\u003c/p\u003e\n\u003cp\u003e“Fine. But most of us here do have babies.”\u003c/p\u003e\n\u003cp\u003e“What about you, Jessie?” Skylar asked. “You and Luke talked about kids?”\u003c/p\u003e\n\u003cp\u003eJessie shrugged. “Off and on. We’re ‘off’ right now. We’ve got some really cute baby llamas. You should bring the girls over to see them.”\u003c/p\u003e\n\u003cp\u003e“Llamas?” Domini repeated.\u003c/p\u003e\n\u003cp\u003e“Jessie was the saving grace for the llamas Chase won in some rodeo last fall. He dumped them off with his folks and expected Charlie and Vi to take care of them.” Libby pointed with her beer bottle. “Good thing your father-in-law didn’t get his way. Quinn said he was pissed you kept them.”\u003c/p\u003e\n\u003cp\u003e“Casper is always pissed off at me about something I’ve done. Or not done.” She frowned, dipping her head toward her drink so her hair obscured her face.\u003c/p\u003e\n\u003cp\u003eAs the time and drinks passed, Domini couldn’t remember when she’d had such a blast. Even India, who rarely set foot in a bar/supper club, was still hanging out two hours later.\u003c/p\u003e\n\u003cp\u003eDomini heard her name and broke her conversation with Jessie to focus on Skylar and India.\u003c/p\u003e\n\u003cp\u003e“Even if you are my sister, and I love your offbeat sense of humor, you can be mean.”\u003c/p\u003e\n\u003cp\u003e“When am I ever mean?” India demanded.\u003c/p\u003e\n\u003cp\u003e“What you did to Kade was mean,” Skylar chided. “Kade actually told people that Domini was a refugee because she was kicked out of Bosnia for political persecution.”\u003c/p\u003e\n\u003cp\u003e“But Kade embellished it, claiming she barely spoke English, so any shit he got for sharing misinformation was well deserved,” India retorted. “And people around here don’t know the difference between Bosnia, the Ukraine and Timbuktu. A foreigner is a foreigner.”\u003c/p\u003e\n\u003cp\u003eHow true that was. Because Domini had shared a house with her friend Nadia, who’d emigrated from Bosnia, everyone assumed they were from the same country. Everyone except for Cam. Cam had pegged Domini’s accent and country of origin right away. Not that it meant anything.\u003c/p\u003e\n\u003cp\u003e“Kade wasn’t the only one India pranked. She told Lettie from the Golden Boot that Domini was a dethroned Russian princess and to never say the word vodka in front of her or she’d burst into tears and go on a bloody rampage.”\u003c/p\u003e\n\u003cp\u003eDomini smiled. That’d been a good one. In fact, that’s why Cam had taken to calling her princess—a nickname that’d stuck even after he’d ferreted out the truth.\u003c/p\u003e\n\u003cp\u003e“That wasn’t as bad as what she told Dewey.” Macie leaned forward. “India swore Domini was a former Soviet spy posing as a chef. And she was in Wyoming hiding from her checkered, murderous past with the Russian mob.”\u003c/p\u003e\n\u003cp\u003eIndia snorted. “Come on, can you blame me? People were gossiping about her. I just made the gossip more…colorful. I added a virtual tattoo to her, if you will.”\u003c/p\u003e\n\u003cp\u003eSkylar groaned. “Does everybody have to be tattooed in your world?”\u003c/p\u003e\n\u003cp\u003e“Yep. It makes the world so much more colorful.”\u003c/p\u003e\n\u003cp\u003e“Has anybody ever guessed the truth?” Jessie asked. “Or does everyone believe you’re a deposed Russian princess who used to be a knife-wielding Soviet spy and who was kicked out of Bosnia?”\u003c/p\u003e\n\u003cp\u003eDomini squirmed at their curious looks and being the rare center of attention. “If they ask I tell them I immigrated to the U.S. from the Ukraine with a church group when I was eighteen, which is the boring truth. So that’s why I didn’t mind when India created a more dynamic…virtual tattoo for me.”\u003c/p\u003e\n\u003cp\u003e“At least I didn’t make up a tale about your past as a hot Ukrainian mail-order bride,” India said.\u003c/p\u003e\n\u003cp\u003eDr. Monroe’s pager went off and she bailed. Then Jessie turned milk pale when a group of women blustered into the restaurant and insisted on departing immediately. Skylar begged off since she had the longest drive. Libby was the next to take her leave.\u003c/p\u003e\n\u003cp\u003eKeely sighed. “Looks like things are winding down. Maybe I should take—” she dug in her pocket for the folded piece of paper, “—Davis up on his offer of a midnight rendezvous. It really sucks goin’ home alone.”\u003c/p\u003e\n\u003cp\u003e“Tell me about it,” Ramona said. “Although, I imagine I go home alone way more nights than you do, little cousin.”\u003c/p\u003e\n\u003cp\u003e“You’d be surprised if you knew how untrue that statement was in the last two years,” Keely said softly. “Especially since I don’t have a place of my own to go home to when I’m in Sundance. I’m pretty sure Dad would disembowel any man he found me havin’ wild monkey sex with in my bedroom.”\u003c/p\u003e\n\u003cp\u003e“I beat you both,” Domini said. “I haven’t gone home with any man since I moved to Sundance and I’ve never had wild monkey sex.”\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eShoot. Maybe she should’ve kept her mouth shut.\u003c/p\u003e\n\u003cp\u003eKeely’s brooding expression vanished. “So nothin’s goin’ on between you and Cam? Not even a fuck buddy type thing?”\u003c/p\u003e\n\u003cp\u003e“Keely!” Macie said.\u003c/p\u003e\n\u003cp\u003e“Ignore her.” AJ added, “We all do.”\u003c/p\u003e\n\u003cp\u003e“No, Domini, I’m serious. Whenever I’m in the diner with Cam, he can’t keep his eyes off you. And you do some serious staring and stammering of your own. So what gives?” She paused thoughtfully. “Does his handicap bother you?”\u003c/p\u003e\n\u003cp\u003e“Keely!” that protest came from Channing.\u003c/p\u003e\n\u003cp\u003eBut Keely ignored her sister-in-law, focusing intently on Domini. “Don’t you think he’s a little bit attractive?”\u003c/p\u003e\n\u003cp\u003eDomini nodded.\u003c/p\u003e\n\u003cp\u003e“So what’s the problem?”\u003c/p\u003e\n\u003cp\u003e“Why don’t you ask him?” Domini said evenly.\u003c/p\u003e\n\u003cp\u003eThe air went still.\u003c/p\u003e\n\u003cp\u003e“Get out. Big, bad, bold, take charge Cam…?”\u003c/p\u003e\n\u003cp\u003e“Runs as hot and cold as the broken pie case when it comes to our comrade Domini,” Macie said wryly.\u003c/p\u003e\n\u003cp\u003eKeely rolled her eyes. “I hoped I’d have a least one brother who wasn’t a complete bonehead when it came to women.”\u003c/p\u003e\n\u003cp\u003eChanning, Macie, AJ and India pelted Keely with snack mix and booed her.\u003c/p\u003e\n\u003cp\u003e“What happened with Cam that he’s shied away from you? ’Cause, honey, you’re gorgeous. And sweet. Plus, you have that sexy, mysterious accent. Hell, you can even cook. You’re like, perfect for him.”\u003c/p\u003e\n\u003cp\u003e“Keely, leave Domini alone,” India warned.\u003c/p\u003e\n\u003cp\u003eBut Keely was undeterred. “If you’re not interested in the down and dirty details, Indy, maybe you oughta conjure an I-just-got-laid virtual tattoo for her,” Keely retorted. “However, I wanna know why she and Cam aren’t knocking combat boots.”\u003c/p\u003e\n\u003cp\u003eThere was no way Domini was avoiding this conversation. Maybe that wasn’t such a bad thing. Despite her embarrassment, she told them how Cam had backtracked after he’d kissed her, apologized and never approached her again.\u003c/p\u003e\n\u003cp\u003eAnother bout of silence lasted a minute and then they all chattered at once.\u003c/p\u003e\n\u003cp\u003e“Cam’s got it bad for sure,” Chassie said.\u003c/p\u003e\n\u003cp\u003e“Uh-huh. No wonder he’s always working out. Working off all that sexual frustration,” AJ said.\u003c/p\u003e\n\u003cp\u003eGinger Paulson cocked her head. “Is that why Cam passed off the cooking lessons he won from you to Buck and Hayden? Because he—”\u003c/p\u003e\n\u003cp\u003e“—cringes at the thought of being alone with me?”\u003c/p\u003e\n\u003cp\u003e“Or a better explanation is he’s scared he won’t be able to keep his hands off you if you’re alone together,” Ginger countered.\u003c/p\u003e\n\u003cp\u003eKeely squinted at India. “Has Cam said anything to Colt about this thing with Domini?”\u003c/p\u003e\n\u003cp\u003e“Are you kidding? Guy talk is sacred. Colt wouldn’t tell me anything, especially when it comes to divulging details about his precious little wounded hero brother, Cameron.”\u003c/p\u003e\n\u003cp\u003eAJ nodded. “Cam isn’t talking to Cord about anything either.”\u003c/p\u003e\n\u003cp\u003e“Or to Colby,” Channing added.\u003c/p\u003e\n\u003cp\u003eWow. Maybe Cam’s rejection had nothing to do with her. Sounds like he steered clear of his family too, which made no sense because his family was great.\u003c/p\u003e\n\u003cp\u003e“Put Carter on the ‘no talking’ list. However, I’m impressed you’ve managed to stay professional around him at the diner, Domini,” Macie said.\u003c/p\u003e\n\u003cp\u003e“Real professional. I want to jump that man every single time he walks through the door,” Domini muttered.\u003c/p\u003e\n\u003cp\u003eRamona grinned. “So do it. Grab him by the hand, drag him upstairs and force him to finish what he started.”\u003c/p\u003e\n\u003cp\u003e“You know, that’s not a bad idea,” Keely mused. “You’re a modern woman. Take control.”\u003c/p\u003e\n\u003cp\u003eDomini understood what these helpful, experienced ladies were saying…in theory. But the truth was, she needed Cam to take charge. That’s what had attracted her to him from the start. His bold, bossy nature.\u003c/p\u003e\n\u003cp\u003eAdvice was bantered about. Keely angled forward and spoke very softly just to Domini. “I’ll bet a million bucks you both want the same thing. Cam is staying away from you in some misguided attempt to protect you—probably from himself. Tell him what you need, Domini, and he’ll move heaven and earth to give it to you.”\u003c/p\u003e\n\u003cp\u003e“And if he doesn’t believe me?” Or want me?\u003c/p\u003e\n\u003cp\u003e“That’s where actions speak louder than words. Never ever underestimate the power of getting naked. Get him alone, strip to nothin’ but skin, and I guarantee he won’t look away, let alone walk away.” Keely scowled at someone over Domini’s shoulder. “Is Cam on duty tonight?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. Why?”\u003c/p\u003e\n\u003cp\u003e“No reason.” Keely pointed to Domini’s empty glass. “You ready for another drink? Something with more kick to it?” \u003c/p\u003e","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-3.html","bookId":2687,"creation":"Oct 5, 2019 10:15:55 AM","modification":"Oct 5, 2019 10:15:55 AM"}
