{"id":70179,"no":33,"title":"Page 33","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe first niggling of fear crept in.\u003c/p\u003e\n\u003cp\u003e“It was a multiple car crash with multiple fatalities. Not so uncommon in Wyoming, sad to say.” Cam briefly ran down what’d happened. As he relayed the information, he seemed to be watching her very closely. Too closely.\u003c/p\u003e\n\u003cp\u003e“Who else was in the accident, Cam?”\u003c/p\u003e\n\u003cp\u003e“Nadia and Rex.”\u003c/p\u003e\n\u003cp\u003eStunned didn’t begin to describe her thoughts. “What? No. You’re mistaken.”\u003c/p\u003e\n\u003cp\u003eCam shook his head. “I’m sorry. It’s been confirmed.”\u003c/p\u003e\n\u003cp\u003e“No. It can’t be. She’ll be here any minute.”\u003c/p\u003e\n\u003cp\u003e“Rex owns a red Taurus, right?”\u003c/p\u003e\n\u003cp\u003e“Lots of people drive red Taurus’s.”\u003c/p\u003e\n\u003cp\u003e“The car was licensed to him.”\u003c/p\u003e\n\u003cp\u003e“So? That doesn’t mean—”\u003c/p\u003e\n\u003cp\u003e“Nadia was out with him tonight, wasn’t she? And she hasn’t come to pick up Anton. And she’s not answering her cell phone. You know that’s not like her.”\u003c/p\u003e\n\u003cp\u003eDomini stared at him, the horror expanding in her chest. The room started to spin. White dots danced in front of her eyes. A din of pain pealed in her brain. Her heart seized as her throat closed. “Oh no. Please no.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“Oh God, I’m going to be sick.”\u003c/p\u003e\n\u003cp\u003eCam placed his hand on the back of her neck and gently shoved her head between her knees. “Breathe. Nice and slow. That’s it.”\u003c/p\u003e\n\u003cp\u003eHer tears plopped on the carpet. She swallowed over and over to keep the bile down. Gagging on her disbelief.\u003c/p\u003e\n\u003cp\u003eAnd through the maelstrom of emotions, Cam’s constant, soothing caresses drifted up and down her back.\u003c/p\u003e\n\u003cp\u003eFinally, she managed to sit up. “This isn’t a bad dream.”\u003c/p\u003e\n\u003cp\u003eThe awful truth filled Cam’s eyes.\u003c/p\u003e\n\u003cp\u003e“Nadia. I can’t believe… How can she be dead? I just saw her a few hours ago.” Domini went straight from a sick feeling to pure panic. She began to hyperventilate through her tears. “I can’t—”\u003c/p\u003e\n\u003cp\u003eCam swore. Then his hands held her head and he was in her face. “Breathe, baby. Come on. Look at me. Focus on me. Just breathe with me. Inhale slowly. Good. Now exhale. That’s it. Three more times.”\u003c/p\u003e\n\u003cp\u003eAfter three long breaths, she started to speak, but he put his thumbs over her mouth.\u003c/p\u003e\n\u003cp\u003e“Huh-uh. We’ll talk when I know you ain’t gonna pass out. Just look in my eyes and breathe with me. That’s all you need to do right now.”\u003c/p\u003e\n\u003cp\u003eDomini let him calm her. It took a while.\u003c/p\u003e\n\u003cp\u003eHe murmured, “Better?”\u003c/p\u003e\n\u003cp\u003eShe nodded. Inhaled once more. “What about Anton? How am I supposed to tell him his mother…is never coming back?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“What will happen to him? Nadia had sole custody. She has no family. Anton has no one…but me.”\u003c/p\u003e\n\u003cp\u003e“As far as I know, in situations like this, Social Services will step in and—”\u003c/p\u003e\n\u003cp\u003e“No!” Domini jumped to her feet. She shot a look at the closed bedroom door where Anton was sleeping. Then she whispered fiercely, “He is not going into foster care. Ever.”\u003c/p\u003e\n\u003cp\u003e“Domini, be reasonable.”\u003c/p\u003e\n\u003cp\u003e“You can’t possibly expect me to be reasonable when I know how bad state care is.”\u003c/p\u003e\n\u003cp\u003eCalmly, Cam said, “Really? How?”\u003c/p\u003e\n\u003cp\u003e“Because my parents died when I was eleven,” she snapped. “With no family, I was shoved into an orphanage.”\u003c/p\u003e\n\u003cp\u003eShock crossed his face, followed by anger. “You were orphaned? Holy hell, Domini, why didn’t you tell me?”\u003c/p\u003e\n\u003cp\u003e“Because I don’t want to be pitied even more than I am.”\u003c/p\u003e\n\u003cp\u003e“You’re not—”\u003c/p\u003e\n\u003cp\u003e“You think I don’t know what people say about me? What they’ve said my whole life? Poor Domini, she’s so quiet she must lack a backbone. Poor Domini, she’s scared of dogs and her own shadow. Poor Domini, she lost her parents and grew up unwanted. Poor Domini, she can’t have—” She stopped mid-rant, cringing for the near slip-up. “I didn’t tell you because I don’t want pity from you.”\u003c/p\u003e\n\u003cp\u003e“Pity is the last goddamn thing I’d ever feel for you.” Cam softened his tone. “Besides, you’re coming up with worst-case scenarios. Foster care here is nothing like what you dealt with living in an orphanage in a foreign country.”\u003c/p\u003e\n\u003cp\u003e“That’s your reasoning? I’m supposed to turn him over to an agency that knows nothing about him? I lived with him for two years, Cam. I’m a much better candidate to take care of him than some random person who’s only fostering kids for the money!”\u003c/p\u003e\n\u003cp\u003e“You’d take him on, just like that?” Cam demanded. “Give up your life as you know it to raise him?”\u003c/p\u003e\n\u003cp\u003e“In a heartbeat.” She stared at him. “Wouldn’t you do the same? For Brock? If he died and left a kid behind, wouldn’t you want to make sure he was taken care of?”\u003c/p\u003e\n\u003cp\u003e“Of course.”\u003c/p\u003e\n\u003cp\u003e“Then you do understand. You know that nothing you or anyone else says will change my mind. Anton belongs with me.”\u003c/p\u003e\n\u003cp\u003e“Sit.”\u003c/p\u003e\n\u003cp\u003eDomini paced as her feet tried to keep up with the jumbled thoughts in her head.\u003c/p\u003e\n\u003cp\u003eHis voice was sharper. “I said sit down. Now.”\u003c/p\u003e\n\u003cp\u003e“Fine.” She perched on the very edge of the cushion, legs bouncing up and down impatiently.\u003c/p\u003e\n\u003cp\u003e“Sheriff Shortbull knows the victims left behind an unattended minor.”\u003c/p\u003e\n\u003cp\u003e“How in the world does he know that?”\u003c/p\u003e\n\u003cp\u003e“Because I told him.”\u003c/p\u003e\n\u003cp\u003eHer mouth dropped open. “Why would you do that to me?”\u003c/p\u003e\n\u003cp\u003e“I didn’t do it to you.”\u003c/p\u003e\n\u003cp\u003e“It feels like it.” God. This was a nightmare. She knew it wasn’t Cam’s fault but she couldn’t stop from lashing out at him.\u003c/p\u003e\n\u003cp\u003e“Wrong. Goddammit. No matter what I feel for you, Domini, I am an officer of the court and I have an obligation to uphold the law. Making Social Services aware of Anton and his situation might not be what you’d do, but it’s what I have to do.”\u003c/p\u003e\n\u003cp\u003eDomini studied Cam like she’d never seen him before. “And I’ll do what I have to do.”\u003c/p\u003e\n\u003cp\u003e“What’s that supposed to mean?”\u003c/p\u003e\n\u003cp\u003e“I’ll take him away before I’ll turn him over.”\u003c/p\u003e\n\u003cp\u003eHe snatched her hands again. “Don’t tell me shit like that because I can’t just ignore it! What you’re talking about is illegal.”\u003c/p\u003e\n\u003cp\u003e“What you’re talking about is unjust.”\u003c/p\u003e\n\u003cp\u003eThey glared at each other, which wasn’t what they needed right now. In the last twenty minutes her whole life had been turned upside down. She began to cry.\u003c/p\u003e\n\u003cp\u003e“Hey.” He brought his knuckles to her cheek and wiped her tears. “Sorry about yelling at you. Just don’t scare me like that. After what I’ve seen tonight I can’t stand the thought of you—” His voice broke.\u003c/p\u003e\n\u003cp\u003eCam had lost a family member tonight and he was trying to keep it together for her. He deserved her sympathy, not her anger. “Cam. I’m sorry. I’m scared. For him. For me…” For us went unsaid.\u003c/p\u003e\n\u003cp\u003e“We’ll get through this. I promise.” He stroked her jawline. “Let’s take it a day at a time, okay? Tomorrow morning you’ll tell Anton about his mom. Get through that first.”\u003c/p\u003e\n\u003cp\u003e“But shouldn’t I tell him tonight?”\u003c/p\u003e\n\u003cp\u003e“No reason to wake the boy to bad news when tonight is probably one of the last nights of sleep he’ll have for a long time.”\u003c/p\u003e\n\u003cp\u003eDomini’s head spun. She just wanted to curl into Cam and let his solid presence surround her and reassure her.\u003c/p\u003e\n\u003cp\u003e“Come here.” He hauled her onto his lap and buried his face in her hair. “I don’t want to fight with you after the day I’ve had and the shitty days in front of me.”\u003c/p\u003e\n\u003cp\u003e“Me either.”\u003c/p\u003e\n\u003cp\u003eSilence stretched as they held each other.\u003c/p\u003e\n\u003cp\u003eShe whispered, “I wish you could stay with me tonight.”\u003c/p\u003e\n\u003cp\u003e“Me too. I promised Brandt I’d wait awhile before I told our family about Luke. It’s been a few hours so I’ve got some calls to make—”\u003c/p\u003e\n\u003cp\u003e“You told me not to wake Anton up to bad news, but you’re going to call your brothers and other family members and do the same thing?”\u003c/p\u003e\n\u003cp\u003eHe sighed. “No. I guess you’re right. It’ll keep.” Cam’s hold locked them together, even as they were mired in their own separate, anguished thoughts.\u003c/p\u003e\n\u003cp\u003eHe cocked his head back to look at her.\u003c/p\u003e\n\u003cp\u003eAnd Domini was lost in a million conflicting emotions when his mouth pressed to hers, helpless to keep the tears from falling when he kissed her so sweetly, like she was the most precious thing on the planet. The kiss lingered, almost as if they knew it’d be a while before they’d get the chance again.\u003c/p\u003e\n\u003cp\u003eCam rested his forehead to hers. “I want to make all the hurt you’ve ever suffered go away. I want to make sure you never hurt again. I want to pull the covers over our heads and wake up to find this was all a bad fucking dream.”\u003c/p\u003e\n\u003cp\u003e“I wish we could.”\u003c/p\u003e\n\u003cp\u003e“The next few days are gonna be pure hell for both of us. Will you keep in touch with me? Promise you won’t do anything rash or crazy like grab Anton and leave in the middle of the night?”\u003c/p\u003e\n\u003cp\u003e“I promise.”\u003c/p\u003e\n\u003cp\u003e“Good. Because I will hunt your ass down and drag it back here if you try it.”\u003c/p\u003e\n\u003cp\u003eChapter Fifteen\u003c/p\u003e\n\u003cp\u003eTelling Anton about Nadia’s death was every bit as horrible as Domini imagined. He repeated words “fault” and “blame” and because his sobbing was incoherent, Domini wasn’t sure if Anton was blaming Rex or Nadia or himself.\u003c/p\u003e\n\u003cp\u003eThe poor boy wept until he passed out from exhaustion. He refused to let go of her hand. What would she do when Social Services came calling and tried to take him away?\u003c/p\u003e\n\u003cp\u003eGrateful as Domini was for the outpouring of support from the crew at Dewey’s, she had no idea what to do next. Did she handle memorial service arrangements for Nadia? Was there a will? Did she pack up Nadia’s house and bring Anton’s stuff here? Did she need to hire a lawyer? Would they give her custody—even temporary—if she wasn’t a blood relative? \u003c/p\u003e","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-33.html","bookId":2687,"creation":"Oct 5, 2019 10:15:55 AM","modification":"Oct 5, 2019 10:15:55 AM"}
