{"id":70185,"no":39,"title":"Page 39","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCam frowned. “You think being confined to this room will make me boring in bed?”\u003c/p\u003e\n\u003cp\u003e“Never.” She lapped at his nipple. Slowly. Thoroughly. “But why don’t you show me something new, Mr. McKay, to allay my new bride jitters.”\u003c/p\u003e\n\u003cp\u003e“Marriage has made you cheeky, Mrs. McKay.”\u003c/p\u003e\n\u003cp\u003eShe smirked. And kept licking as she trailed her fingers down his belly until they circled his erect cock. She jacked him a couple of times, then rolled his balls between her delicate fingertips.\u003c/p\u003e\n\u003cp\u003e“Move down and use your mouth.”\u003c/p\u003e\n\u003cp\u003eDomini inched toward his groin.\u003c/p\u003e\n\u003cp\u003eFor the briefest second he had a flash of panic with Domini being so close to his stump. But she didn’t pay any attention to it. Her eyes were devouring his dick.\u003c/p\u003e\n\u003cp\u003e“Suck it.”\u003c/p\u003e\n\u003cp\u003eImmediately heat and wetness surrounded the head, then the soft tissues of her mouth. She formed a firm seal around his shaft as she pulled him deep.\u003c/p\u003e\n\u003cp\u003e“That’s it. Show me how much you love to drive me crazy with that wicked mouth of yours.”\u003c/p\u003e\n\u003cp\u003eDomini hummed and began the unbroken rhythm he’d taught her.\u003c/p\u003e\n\u003cp\u003eCam withheld a groan. Damn. It felt amazing. But he wanted something more. To teach her a new trick. He clamped his hands around her head, stopping the bobbing motion.\u003c/p\u003e\n\u003cp\u003ePuzzled, she glanced up with half his shaft still in her mouth.\u003c/p\u003e\n\u003cp\u003e“Get the lube in the nightstand drawer and a towel.”\u003c/p\u003e\n\u003cp\u003eShe let her teeth drag along the sensitive underside of his cock as she released him from her mouth. Once the tube of K-Y and a washcloth were in her hand, that puzzled look returned.\u003c/p\u003e\n\u003cp\u003eAfter she was back in position, he said, “Suck my balls.”\u003c/p\u003e\n\u003cp\u003eHer breath teased the taut globes. Then she sucked them, one at a time, until both were resting on her tongue. She sucked experimentally. She sucked perfectly.\u003c/p\u003e\n\u003cp\u003eCam’s pelvis bumped up. “Oh hell, Domini.”\u003c/p\u003e\n\u003cp\u003eThe humming response buzzed up his cock.\u003c/p\u003e\n\u003cp\u003eDamn. If she kept that up he’d shoot, guaranteed. “Stop.”\u003c/p\u003e\n\u003cp\u003eHis balls slipped from her mouth with an audible pop. She licked the length of his shaft, ready to suck him off.\u003c/p\u003e\n\u003cp\u003e“I’ll let you blow me to heaven in a second, but here’s the new part you were wanting to try.”\u003c/p\u003e\n\u003cp\u003eThat caught her attention. “What’s that?”\u003c/p\u003e\n\u003cp\u003e“You’re gonna massage my prostate as you’re sucking me off. You ever done that?”\u003c/p\u003e\n\u003cp\u003eDomini shook her head.\u003c/p\u003e\n\u003cp\u003e“I’ll teach you how I like it, so lube up your finger first and then you’ll spread some lube on the seam of my ass.”\u003c/p\u003e\n\u003cp\u003eA smile curled the corners of her mouth and her eyes glittered. She cracked open the tube and coated her index finger, leaving a very big glob on the tip.\u003c/p\u003e\n\u003cp\u003eCam felt the cool, slick gel on the strip of skin between his balls, and then the gentle circles she rubbed directly on his hole. “Jesus.” He forced his ass to unclench. “Now palm my balls as you’re working the finger inside a little at a time.”\u003c/p\u003e\n\u003cp\u003eHer tongue rimmed the head of his cock as she slowly swirled her finger in his ass.\u003c/p\u003e\n\u003cp\u003eThe burning sensation vanished the second her finger connected with the gland. “Oh fuck. Christ, that’s it. That’s so fucking it.”\u003c/p\u003e\n\u003cp\u003eAs Domini swept her finger back and forth over that magic spot she sucked his cock until the crown bumped the back of her throat.\u003c/p\u003e\n\u003cp\u003eCam figured he’d last about a minute, maybe less. He came with a roar, pumping his hips and Domini made a soft purr as she swallowed every drop of come. Once the throbbing, pulsing orgasm ended, she removed her finger from his ass.\u003c/p\u003e\n\u003cp\u003eHoly fucking Christ. His mind blanked. His whole body shook.\u003c/p\u003e\n\u003cp\u003eDomini kept kissing and licking her way up his torso.\u003c/p\u003e\n\u003cp\u003eHe cracked open his eyes. “Come here.”\u003c/p\u003e\n\u003cp\u003eShe straddled his pelvis.\u003c/p\u003e\n\u003cp\u003e“Huh-uh. Knees on either side of my head and put that pretty pussy on my face.”\u003c/p\u003e\n\u003cp\u003e“You still going with the ‘new’ theme?”\u003c/p\u003e\n\u003cp\u003e“Yep.” He used his heel to drag himself further down the bed. “Hands on the headboard.”\u003c/p\u003e\n\u003cp\u003e“Cam. I don’t know about this—oh!”\u003c/p\u003e\n\u003cp\u003eHe sucked her clitoris and then rubbed his face on her inner thighs. “Mmm. Juicy. You are sopping wet, princess. And lucky for you, I’m parched.” He opened her up with his fingers and burrowed his tongue in as far as he could reach. He speared into her over and over. Until her scent coated his face. Until her taste glazed his lips and coated his tongue and flowed down the back of his throat. He basked in her, bathed in her, and lost himself in bringing her—his wife—pleasure.\u003c/p\u003e\n\u003cp\u003eWhen Domini was grinding her wet sex down and her whimpering moans escalated, he sucked her clit hard and she came all over his face.\u003c/p\u003e\n\u003cp\u003eThen he did it again.\u003c/p\u003e\n\u003cp\u003eAfter her last climax, she collapsed on the bed. After a bit she snuggled into him on his left side, her right knee below his stump, her toes drifting up and down his calf. Domini sighed dreamily and fell asleep in his arms.\u003c/p\u003e\n\u003cp\u003eCam kissed the top of her head and mouthed, “I love you,” before he joined his wife in dreamland.\u003c/p\u003e\n\u003cp\u003eChapter Eighteen\u003c/p\u003e\n\u003cp\u003eGracie started barking. “Sorry, girl, you’re gonna have to go out back for a bit.”\u003c/p\u003e\n\u003cp\u003eShe whined.\u003c/p\u003e\n\u003cp\u003e“At least he doesn’t have a dog he’s bringing to invade your space.”\u003c/p\u003e\n\u003cp\u003eInvade your space. Was that how Cam felt? Domini didn’t want to start the day out on a bad note, so she said nothing and went out to meet Anton.\u003c/p\u003e\n\u003cp\u003eAfter Cord McKay’s pickup parked, Ky jumped out of the passenger side, followed by Anton. The relief on Anton’s face when he saw Domini brought a smile. “Hey guys.”\u003c/p\u003e\n\u003cp\u003eAnton hustled up the steps and hugged her. Hard.\u003c/p\u003e\n\u003cp\u003e“Did you have fun last night?” she asked around the lump in her throat.\u003c/p\u003e\n\u003cp\u003e“It was okay.” The door opened behind them and Gracie was jumping and yipping around Anton.\u003c/p\u003e\n\u003cp\u003eDomini froze. “Cam?”\u003c/p\u003e\n\u003cp\u003e“Gracie! Settle down. Sit.”\u003c/p\u003e\n\u003cp\u003e“Aw, she’s not hurting me,” Anton said, blocking Domini from the dog. He crouched down and stroked her head. “She’s pretty. But Gracie is a kinda weird name.”\u003c/p\u003e\n\u003cp\u003eGracie allowed Anton to pet her.\u003c/p\u003e\n\u003cp\u003eKyler leapt onto the deck beside them. “Ain’t Gracie great? I wish she wasn’t fixed so she and Rascal could have puppies.”\u003c/p\u003e\n\u003cp\u003e“Puppies would be cool.”\u003c/p\u003e\n\u003cp\u003eCord ambled up and smiled. “Congrats to both of you.”\u003c/p\u003e\n\u003cp\u003e“Thanks. Please tell AJ the dinner was so thoughtful and very delicious.”\u003c/p\u003e\n\u003cp\u003e“Will do.” He focused on Cam. “How are you?”\u003c/p\u003e\n\u003cp\u003e“Never better. You?”\u003c/p\u003e\n\u003cp\u003eCord smiled. “I recognize that look.”\u003c/p\u003e\n\u003cp\u003eDomini blushed.\u003c/p\u003e\n\u003cp\u003e“Are you loadin’ up the stuff from Domini’s apartment today?”\u003c/p\u003e\n\u003cp\u003e“Hadn’t thought about it, but I guess I should or else Keely’ll throw it out the window in her desperation to move outta Ma and Dad’s place.”\u003c/p\u003e\n\u003cp\u003e“True. That’s why me’n Colby are offerin’ to drag stuff up and down the stairs for you.”\u003c/p\u003e\n\u003cp\u003eCam’s smile flattened. “Nah, that’s okay, I can get it.”\u003c/p\u003e\n\u003cp\u003e“You sure? It won’t take—”\u003c/p\u003e\n\u003cp\u003e“I said I can handle it,” Cam said tersely.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eCord pushed his hat back and stared daggers at Cam. “Ky, why don’t you show Anton where Cam keeps the four-wheelers.”\u003c/p\u003e\n\u003cp\u003e“Okay.” Ky and Anton rounded the deck toward the garage. Gracie whined on the deck.\u003c/p\u003e\n\u003cp\u003eAnton stopped and looked at Cam. “Can she come with us?”\u003c/p\u003e\n\u003cp\u003e“Sure. Say ‘come’ and pat your leg. But if she jumps up on you, bump her aside with your knee and make her sit. I don’t need her knocking me over.”\u003c/p\u003e\n\u003cp\u003e“Come, Gracie.” Anton slapped his thighs. Gracie took off like a shot, tail wagging.\u003c/p\u003e\n\u003cp\u003eThe air between Cam and Cord was heavy with tension.\u003c/p\u003e\n\u003cp\u003e“Don’t be stubborn, Cam. Us wantin’ to help you ain’t a reflection of your disabilities. There’s no sense in you fightin’ them stairs when you don’t have to.”\u003c/p\u003e\n\u003cp\u003eCam crossed his arms over his chest. “I appreciate the offer.”\u003c/p\u003e\n\u003cp\u003e“But you’re turnin’ it down flat,” Cord said.\u003c/p\u003e\n\u003cp\u003e“Yep.\u003c/p\u003e\n\u003cp\u003e“Goddammit. This is asinine. We all just want—”\u003c/p\u003e\n\u003cp\u003e“To humiliate the cripple?” Cam snapped. “Hell, why don’t you invite Colt, Kade, Buck, Quinn and Ben too? So everyone in the whole fuckin’ family knows that I can’t take care of—”\u003c/p\u003e\n\u003cp\u003e“Cam. Stop.” Domini planted herself in front of him. “Take your brother’s help.”\u003c/p\u003e\n\u003cp\u003eHe scowled. “I don’t need it.”\u003c/p\u003e\n\u003cp\u003e“Yes, you do. And if you don’t take it, I’ll move all the stuff by myself.”\u003c/p\u003e\n\u003cp\u003e“Like hell,” Cam and Cord said simultaneously.\u003c/p\u003e\n\u003cp\u003e“See? You two can agree on something.”\u003c/p\u003e\n\u003cp\u003eCord’s smile was as slow and as lethally sexy as Cam’s. “I am so gonna love sayin’ ‘listen to your wife’ little bro, since you get such a huge fuckin’ chuckle outta sayin’ it to me all the damn time.”\u003c/p\u003e\n\u003cp\u003eCam relaxed. Smirked. “I can’t wait.”\u003c/p\u003e\n\u003cp\u003e“Seriously. Let us help you.”\u003c/p\u003e\n\u003cp\u003e“Fine. As long as it’s only you and Colby. Not Ma and Dad, not anyone else.”\u003c/p\u003e\n\u003cp\u003e“Not a problem.”\u003c/p\u003e\n\u003cp\u003e“There’s not much anyway, maybe one load, I don’t have much,” Domini said. “And Anton’s stuff is still boxed up in the entryway so that’ll be easy.”\u003c/p\u003e\n\u003cp\u003e“Maybe we oughta just go get it done now.” Cord’s look challenged Cam. “Will it piss you off if I suggest you stay here with the boys?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Then I’ll say it.” Domini stood on her tiptoes to whisper, “Stay here and save your strength for tonight because you’re gonna need it, husband.”\u003c/p\u003e\n\u003cp\u003eHe growled.\u003c/p\u003e\n\u003cp\u003e“We won’t be long. And if Anton and Ky get hungry, just feed them mac and cheese.”\u003c/p\u003e\n\u003cp\u003eDomini and Cord returned three hours later. Cord stacked the boxes on the deck and Cam insisted on taking them into the house. Once Cord’s truck was unloaded, he and Ky took off. \u003c/p\u003e","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-39.html","bookId":2687,"creation":"Oct 5, 2019 10:15:55 AM","modification":"Oct 5, 2019 10:15:55 AM"}
