{"id":70188,"no":42,"title":"Page 42","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eJust by happenstance, Cam discovered Domini had hired Ginger to start Anton’s preliminary adoption process paperwork. He’d been waiting in her office and noticed the bill on Domini’s desk. He hadn’t brought it up with her because he hadn’t known what to say. And part of him wanted Domini to explain, of her own volition, not because he forced the issue. Might be a long damn wait.\u003c/p\u003e\n\u003cp\u003eCam sighed and closed his eyes. Allowing himself to drift off. Just for a minute.\u003c/p\u003e\n\u003cp\u003eThe sound of approaching helicopters echoed in the distance. Extraction was here. His two young charges, still green as far as live fire ops went, popped up out of their hiding places. He motioned for them to stay put. But the lead guy misread the hand signal and started across the open field. Keeping low, like he’d been trained, yet Cam was horrified. The kid wasn’t supposed to cross an open field. Ever. Too much shit could go wrong.\u003c/p\u003e\n\u003cp\u003eFrantically, he made the “stay” signal again. Which the rear guy also misread and he followed his buddy through the exposed field.\u003c/p\u003e\n\u003cp\u003eCam wanted to shout and drag those dumb little fuckers out of danger by their ears. But he could only watch helplessly, concealed in his own hiding place, sweating pure fear, praying they got lucky and cleared the field without incident.\u003c/p\u003e\n\u003cp\u003eThe landmine shook the ground and took out the first guy. The second guy ran pell-mell through the smoke and dust, screeching for his partner and setting off another landmine.\u003c/p\u003e\n\u003cp\u003eThe words, your fault, it was all your fault, screaming in his head.\u003c/p\u003e\n\u003cp\u003eWait. The screaming sound was outside his head too.\u003c/p\u003e\n\u003cp\u003eHe looked to the sky as the whistling noise of a surface to air missile hit the helicopter. The explosion distorted reality, creating a ball of orange fire that knocked Cam flat on his ass. Parts rained down on him like metal raindrops. But when he saw the broken helicopter blade flipping end over end toward him like a deadly boomerang, he broke his silence and screamed.\u003c/p\u003e\n\u003cp\u003eAnd kept screaming.\u003c/p\u003e\n\u003cp\u003e“Cam?”\u003c/p\u003e\n\u003cp\u003eHe jackknifed, not knowing where he was. He attempted to roll away and run from danger.\u003c/p\u003e\n\u003cp\u003e“Cam!” Hands slapped his cheeks. Legs pinned him down. “Wake up.”\u003c/p\u003e\n\u003cp\u003eHe blinked in the near darkness until the face belonging to the voice swam into view.\u003c/p\u003e\n\u003cp\u003eDomini.\u003c/p\u003e\n\u003cp\u003e“Domini? What are you doing in…” Shit. He wasn’t in Afghanistan. The force of the old nightmare hit him anew and the shakes started. Sickness roiled in his belly. “Oh fuck.”\u003c/p\u003e\n\u003cp\u003e“Ssh. It’s okay. I’m here. I’ve got you.”\u003c/p\u003e\n\u003cp\u003e“I can’t—”\u003c/p\u003e\n\u003cp\u003e“I know. Lay back.”\u003c/p\u003e\n\u003cp\u003e“I—don’t, no—”\u003c/p\u003e\n\u003cp\u003e“Ssh. I’m here.” Domini cupped his face in her hands. “Look at me. Let me help you.”\u003c/p\u003e\n\u003cp\u003e“Okay,” he whispered. “Don’t go.”\u003c/p\u003e\n\u003cp\u003e“I’m right here, Cam. I’m not going anywhere. I promise. I’m right here.”\u003c/p\u003e\n\u003cp\u003eShe turned him on his side and covered him with the quilt after pressing her body tightly to his. Domini settled her right palm on his chest directly over his heart. She placed her left arm behind his head on the pillow and tenderly stroked his clammy forehead with her cool fingers. She murmured in his ear. He couldn’t tell if her words were Ukrainian or English.\u003c/p\u003e\n\u003cp\u003eIt didn’t matter. Cam closed his eyes and focused on her voice. It soothed him. Her gentle touches, her sporadic sweet kisses, her presence was a healing balm to his soul.\u003c/p\u003e\n\u003cp\u003eDomini nuzzled the back of his neck and stayed with him through every second of his meltdown.\u003c/p\u003e\n\u003cp\u003eHe seemed to regain some semblance of control faster this time than the first night they’d spent together. Might make him a needy bastard…but he just didn’t want her to let go.\u003c/p\u003e\n\u003cp\u003eAnd she didn’t. Domini didn’t ask questions or babble to fill the empty air. Without doubt, if he did decide to spill his guts, she wouldn’t judge him. She accepted him and he felt safe with her. At peace.\u003c/p\u003e\n\u003cp\u003eGoddamn. He loved her so fucking much.\u003c/p\u003e\n\u003cp\u003eShe deserved better than the shitty way he’d treated her when he’d first walked in the door. He rolled to his back and she was still touching him. Still offering him solace. Still acting like she cared. Like she loved him.\u003c/p\u003e\n\u003cp\u003eCam swept her hair behind her ear. His voice was thick with emotion. “You’re beautiful. I’m the luckiest goddamn guy in the world to get to come home to you every night. Thank you for staying with me through that.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome. You better?”\u003c/p\u003e\n\u003cp\u003e“Much, thanks to you.”\u003c/p\u003e\n\u003cp\u003e“I’m glad.” She smiled softly and sweetly stroked his scarred face.\u003c/p\u003e\n\u003cp\u003e“I’m sorry I was such an ass earlier.”\u003c/p\u003e\n\u003cp\u003e“You were an ass.”\u003c/p\u003e\n\u003cp\u003eHe sighed. “I’ll work harder on bein’ less of an ass, okay?”\u003c/p\u003e\n\u003cp\u003e“I appreciate the apology and I forgive you. So, I’ll put the liver and onions I had planned for dinner tomorrow night on hold.”\u003c/p\u003e\n\u003cp\u003eHe smiled.\u003c/p\u003e\n\u003cp\u003eBefore he drifted off, he murmured, “Thank you.”\u003c/p\u003e\n\u003cp\u003e“You’re welcome. Rest, Deputy. I’ve got your back.”\u003c/p\u003e\n\u003cp\u003eWhen Domini reached up and switched on the fan, he didn’t mind a bit.\u003c/p\u003e\n\u003cp\u003eChapter Twenty\u003c/p\u003e\n\u003cp\u003eWeek Six…\u003c/p\u003e\n\u003cp\u003eExhausted. Domini was just plain exhausted.\u003c/p\u003e\n\u003cp\u003eThe fatigue wasn’t from her randy husband keeping her up until the wee hours proving his sexual mastery. No, his big body hadn’t been in bed next to her for the last three weeks.\u003c/p\u003e\n\u003cp\u003eSince Cam had started his month long assignment to third shift—ten pm to six am—she wasn’t sleeping well. Add in the upheaval at Dewey’s after firing Bobby and she’d been working eleven-hour shifts. Naturally, none of her days off coincided with Cam’s days off. It drove her crazy to think she’d seen more of Cam before they’d married.\u003c/p\u003e\n\u003cp\u003eCam was equally frustrated at their lack of time together. He suggested she quit working at Dewey’s, even going so far as to hint he earned enough money to support them and her job wasn’t necessary.\u003c/p\u003e\n\u003cp\u003eNot necessary? Keeping her job was essential, not only for financial reasons, but her own sanity. She was good at her job. Not all women had the burning desire to stay home, bake muffins, iron clothes and pop out kids.\u003c/p\u003e\n\u003cp\u003eLike the last one was even an option.\u003c/p\u003e\n\u003cp\u003eShe’d pointed out they hadn’t discussed the issues before their hurry-up wedding, so it shouldn’t have shocked him they held different perspectives. Add Anton into the mix and it was turning out to be a very messy soup.\u003c/p\u003e\n\u003cp\u003eAnton’s surly behavior had mellowed, but whenever his new reality hit him, he’d become inconsolable. Domini feared she was doing a lousy job mothering Anton, but she couldn’t share her concerns about her lack of parenting skills with Cam. Cam had even less skills than she and it didn’t seem to bother him.\u003c/p\u003e\n\u003cp\u003eGranted, the six-month waiting period to start formal adoption was good in that Cam and Anton needed time to establish some kind of relationship—because right now, they had no relationship. What if it didn’t get better? Would she have to choose between Cam and Anton?\u003c/p\u003e\n\u003cp\u003eIt’d been a rocky start all around.\u003c/p\u003e\n\u003cp\u003eShe mixed the taco seasoning with the ground beef and layered it over the noodles. After sprinkling the casserole with cheese, she slid it in the oven and set the timer.\u003c/p\u003e\n\u003cp\u003eHer arms were elbow deep in dishwater and she was lost in thought when a muscular body pressed against her, the thick forearms braced on either side of the sink.\u003c/p\u003e\n\u003cp\u003e“Mmm, I like you like this. Confined. You can’t really move without splashing yourself. So I can do this—” Cam rubbed his lips on the back of her head, “—and this—” he nosed aside her hair to flick his tongue across her nape, “—and especially this—” he dragged openmouthed kisses up her neck.\u003c/p\u003e\n\u003cp\u003eGoose flesh broke out.\u003c/p\u003e\n\u003cp\u003eCam continued his sensual assault with his heated breath, clever mouth and questing tongue. She closed her eyes, absorbing every sensation, craving this side of her dominant husband.\u003c/p\u003e\n\u003cp\u003e“My wife, my Domini,” he murmured, “I want to fuck you. Just like this. No time for you to think, no time for you to move. I’d drop your pants and drive into you hard.”\u003c/p\u003e\n\u003cp\u003eShe moaned.\u003c/p\u003e\n\u003cp\u003e“Since you like it fast, I’d go slow. So.” Kiss. “Very.” Another kiss. “Very.” Another kiss. “Slow.”\u003c/p\u003e\n\u003cp\u003e“No. Please—”\u003c/p\u003e\n\u003cp\u003e“But I’d let you choose which side of your neck I sink my teeth into. This area makes you squeak,” Cam fastened his mouth to the left dip between her neck and collarbone and sucked.\u003c/p\u003e\n\u003cp\u003eDomini did squeak.\u003c/p\u003e\n\u003cp\u003e“But attention on this side elicits a throaty purr that makes my cock hard as steel.” Cam scraped his teeth up the right side of her nape. “My fingers would stroke that sweet little clit. I’d fist the other hand in your hair so I can angle your neck however I please.” He threaded his fingers through her hair and lightly tugged. “And there’s not a damn thing you can do about it.”\u003c/p\u003e\n\u003cp\u003e“Cam. Please.”\u003c/p\u003e\n\u003cp\u003e“Am I turning you on? Telling you how I plan on taking what’s mine?”\u003c/p\u003e\n\u003cp\u003e“Yes.” She needed him. Needed to feel that rush of pleasure only he could give her.\u003c/p\u003e\n\u003cp\u003eHe growled. His grip increased on her hair. His right hand slid around her hip and stroked between her legs. Then he spread his big hand on her abdomen as he ground his erection into her ass. “Right. Fucking. Now.”\u003c/p\u003e\n\u003cp\u003e“Cam—”\u003c/p\u003e\n\u003cp\u003e“Huh-uh. I make the rules, you follow them.”\u003c/p\u003e\n\u003cp\u003e“We can’t—”\u003c/p\u003e\n\u003cp\u003e“Don’t force me to get rough, Domini.”\u003c/p\u003e\n\u003cp\u003eOh how she’d love that. In private. “Stop.”\u003c/p\u003e\n\u003cp\u003e“You don’t want me to stop.”\u003c/p\u003e\n\u003cp\u003eTrue. Domini spoke firmly through the lust tightening her throat. “Please. Cam, no. Don’t. I’m—”\u003c/p\u003e\n\u003cp\u003e“Leave her alone!” Fast footsteps smacked behind them.\u003c/p\u003e\n\u003cp\u003eShe felt Cam’s entire body stiffen as he was shoved hard into her. The sounds of slapping flesh followed.\u003c/p\u003e\n\u003cp\u003e“Don’t you hurt her!” Whack whack whack. “Don’t you touch her!”\u003c/p\u003e\n\u003cp\u003e“Whoa. Hang on—” \u003c/p\u003e","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-42.html","bookId":2687,"creation":"Oct 5, 2019 10:15:55 AM","modification":"Oct 5, 2019 10:15:55 AM"}
