{"id":70193,"no":47,"title":"Page 47","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eCam made no move to leave the exam room. “Why don’t you wait out front? It’ll just take me a minute.”\u003c/p\u003e\n\u003cp\u003e“Huh-uh. What if you fainted? And hit your head? I am not taking the chance that anything will happen to you.”\u003c/p\u003e\n\u003cp\u003e“Fine.” She dressed quickly. Cam paid the doctor’s bill and escorted her—heck he practically carried her—to his truck. The sun burned her eyes. She slipped on her sunglasses.\u003c/p\u003e\n\u003cp\u003eAbout halfway home, Cam said, “When I heard you’d passed out and were nauseous, I thought…maybe you were pregnant.”\u003c/p\u003e\n\u003cp\u003eDomini froze.\u003c/p\u003e\n\u003cp\u003e“I know we haven’t been married long, but if it’d turned out you were pregnant, I…well, I wouldn’t have minded. Not at all. I just wanted you to know.”\u003c/p\u003e\n\u003cp\u003eShe faced out the window. She had to tell him the truth.\u003c/p\u003e\n\u003cp\u003eAnd if Cam decides to walk away?\u003c/p\u003e\n\u003cp\u003eShe loved him. Now she knew the true meaning of selfishness because she didn’t know if she could let him go.\u003c/p\u003e\n\u003cp\u003eCam tucked Domini in bed, called the station and requested a couple of sick days. He jotted down a grocery list. He paced until it was time to pick up Anton.\u003c/p\u003e\n\u003cp\u003eAt the school, he rested his butt against the passenger side of his pickup and kept his eyes peeled for the boy. Cam whistled and Anton looked his direction. The kid smiled as he hustled toward him. “Hey, Cam.”\u003c/p\u003e\n\u003cp\u003e“Heya, sport.”\u003c/p\u003e\n\u003cp\u003e“I didn’t know you were picking me up today.”\u003c/p\u003e\n\u003cp\u003e“Your lucky day, huh?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh. We doin’ something fun?”\u003c/p\u003e\n\u003cp\u003e“Not really, unless you love grocery shopping.”\u003c/p\u003e\n\u003cp\u003eAnton groaned and hefted himself into the cab.\u003c/p\u003e\n\u003cp\u003e“How was school today?”\u003c/p\u003e\n\u003cp\u003e“Okay.”\u003c/p\u003e\n\u003cp\u003e“Have any homework?”\u003c/p\u003e\n\u003cp\u003e“Nope. Where’s Domini?”\u003c/p\u003e\n\u003cp\u003eCam turned the corner and waved at Mrs. Jackson walking her toy poodles. “She’s at home. She ain’t feeling too good.”\u003c/p\u003e\n\u003cp\u003eAnton was quiet. Too quiet. “Is she gonna have a baby?”\u003c/p\u003e\n\u003cp\u003e“No.” He sent Anton a sideways glance. “What makes you say that?”\u003c/p\u003e\n\u003cp\u003e“People have babies after they get married. I thought maybe now she’s got a baby in her tummy.”\u003c/p\u003e\n\u003cp\u003eI wish. Maybe then Cam could believe she’d stick around. She hadn’t called him today when she’d gotten ill, but she had called him when she had car trouble? That bugged the crap out of him. Add in the fact she wouldn’t share a bank account with him, she insisted on buying all the groceries and Cam wondered if they had a marriage or a business arrangement.\u003c/p\u003e\n\u003cp\u003eIt is a business arrangement. She only married you for Anton. Once she gets him she’ll be gone.\u003c/p\u003e\n\u003cp\u003eCam didn’t believe that. He half believed Domini loved him. But the last thing she needed right now was the added stress of him demanding to know how she felt about him.\u003c/p\u003e\n\u003cp\u003e“Cam?”\u003c/p\u003e\n\u003cp\u003e“Hmm?”\u003c/p\u003e\n\u003cp\u003e“What’s wrong with her?”\u003c/p\u003e\n\u003cp\u003e“She’s tired and it’s making her sick.”\u003c/p\u003e\n\u003cp\u003e“What do we hafta do to make her get better?”\u003c/p\u003e\n\u003cp\u003eCam smiled at Anton’s use of “we” and his offer to take care of the woman who took such good care of both of them. “Make sure she rests and eats right. We’ll be eating a lot of steak. And burgers.”\u003c/p\u003e\n\u003cp\u003e“Who’s cooking?”\u003c/p\u003e\n\u003cp\u003e“Me. Why?”\u003c/p\u003e\n\u003cp\u003eHe blurted, “Because you’re a really bad cook.”\u003c/p\u003e\n\u003cp\u003eCam said nothing.\u003c/p\u003e\n\u003cp\u003eA hint of fear shone in Anton’s eyes. “Are you mad?”\u003c/p\u003e\n\u003cp\u003e“Because you told the truth? Hell no. But you’re right, sport, I’m a shitty cook.” He shot him a look. “Sorry, I’m not supposed to swear in front of you.”\u003c/p\u003e\n\u003cp\u003eThe kid actually rolled his eyes.\u003c/p\u003e\n\u003cp\u003e“So, I’m a bad cook, yet I need to feed my wife…what do you think we oughta do?”\u003c/p\u003e\n\u003cp\u003e“Eat at Dewey’s every day?”\u003c/p\u003e\n\u003cp\u003e“Nope. Try again.”\u003c/p\u003e\n\u003cp\u003e“We could ask Dave to help us. He knows everything about cooking.”\u003c/p\u003e\n\u003cp\u003e“That’s a great idea.”\u003c/p\u003e\n\u003cp\u003eAnton’s face lit up. “Really?”\u003c/p\u003e\n\u003cp\u003e“Yep. We’ve gotta stop at Dewey’s and get Domini’s purse anyway, so we’ll see if Dave can give us some pointers.”\u003c/p\u003e\n\u003cp\u003eArmed with detailed instructions, Cam and Anton picked up several steaks before they headed home. Domini was sitting on the front deck when he pulled up.\u003c/p\u003e\n\u003cp\u003eGracie barked and waited by the truck for Anton. Damn dog was completely smitten with the boy. And Anton had done a one-eighty when it came to Gracie’s behavior. The dog minded Anton better than him sometimes.\u003c/p\u003e\n\u003cp\u003eCam unloaded the grocery bags. Anton hauled them in the house, leaving Cam alone with Domini. He climbed the steps slowly. “You wanna explain what you’re doin’ out of bed, Mrs. McKay?”\u003c/p\u003e\n\u003cp\u003e“I was lonely for my boys. Gracie was antsy so I thought I’d sit out in the fresh air.”\u003c/p\u003e\n\u003cp\u003eMy boys. He leaned down and kissed her. “Getcha ass back in bed, woman. Now.”\u003c/p\u003e\n\u003cp\u003e“I love it when you go all caveman on me, Deputy. Makes me all tingly.”\u003c/p\u003e\n\u003cp\u003eDoes that mean you love me?\u003c/p\u003e\n\u003cp\u003eNot going there. Not now. “I could toss you over my shoulder and drag you inside.”\u003c/p\u003e\n\u003cp\u003e“Will you wear a sexy jungle print loin cloth too?”\u003c/p\u003e\n\u003cp\u003e“You have a filthy mind, woman. That’s why I—”\u003c/p\u003e\n\u003cp\u003eLove you.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eDomini’s eyes narrowed. “That’s why you what?”\u003c/p\u003e\n\u003cp\u003e“That’s why I plan on doing nasty, raunchy, dirty things to you for hours when you’re better. Now get in bed.”\u003c/p\u003e\n\u003cp\u003eAfter Anton finished chores, which the crazy kid seemed to enjoy, they unwrapped the meat and fired up the barbecue. They read through Dave’s instructions—twice—but it didn’t help.\u003c/p\u003e\n\u003cp\u003eBy the time they finished “cooking” the steaks were burned beyond recognition. Both he and Anton stared at the charred chunks of meat. Finally Anton said, “We suck.”\u003c/p\u003e\n\u003cp\u003e“Yep. We seriously suck.”\u003c/p\u003e\n\u003cp\u003e“I don’t think Gracie will even eat it.”\u003c/p\u003e\n\u003cp\u003eGracie whined.\u003c/p\u003e\n\u003cp\u003e“Can I make a suggestion?” Domini said from the doorframe.\u003c/p\u003e\n\u003cp\u003eCam wheeled around. “You’re supposed to be—”\u003c/p\u003e\n\u003cp\u003e“In bed. I know. I’m anemic, not an invalid. You don’t have to wait on me. And I’m thinking it might be best if you don’t try to cook for me either.”\u003c/p\u003e\n\u003cp\u003eCam and Anton exchanged a glum look.\u003c/p\u003e\n\u003cp\u003e“Here’s the deal, how about if I cook and you guys do everything else.” She shook her head at the burned disks. “Was that…steak?”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.”\u003c/p\u003e\n\u003cp\u003e“Choice cut steak.”\u003c/p\u003e\n\u003cp\u003eShe winced. “We definitely cannot afford for you guys to massacre any more meat. Do we have a deal?”\u003c/p\u003e\n\u003cp\u003e“Deal.”\u003c/p\u003e\n\u003cp\u003e“…sparsely…” Anton looked up at Domini. “What does that mean?”\u003c/p\u003e\n\u003cp\u003e“Umm…very little?”\u003c/p\u003e\n\u003cp\u003eShe glanced over at Cam and he nodded.\u003c/p\u003e\n\u003cp\u003e“You don’t know?”\u003c/p\u003e\n\u003cp\u003eShe bumped Anton with her shoulder. “English isn’t my native language, remember? It takes a minute for me to translate.”\u003c/p\u003e\n\u003cp\u003e“So when you’re thinking in your head, are you thinking in Ukrainian? Or in English?”\u003c/p\u003e\n\u003cp\u003e“When I first moved to the U.S. I only thought in Ukrainian. But the longer I’ve been here away from people who speak my language, it’s English that pops into my head first. But there are always words that throw me off. Like sparsely.” She tousled Anton’s hair. “Did your mom speak to you in Bosnian?”\u003c/p\u003e\n\u003cp\u003e“Nope. He didn’t like it.”\u003c/p\u003e\n\u003cp\u003e“It’s about time for bed, sport.”\u003c/p\u003e\n\u003cp\u003e“I know.” Anton jumped off the couch, securing his book under his arm, and lingered in front of Domini. “Are you gonna tuck me in?”\u003c/p\u003e\n\u003cp\u003e“Yes. Then I’m tucking myself in.”\u003c/p\u003e\n\u003cp\u003eAnton opened the front door and Gracie bounced in. Her tail wagged so hard her body swayed as she followed Anton down the hallway to his bedroom.\u003c/p\u003e\n\u003cp\u003e“Sometimes I forget that English isn’t your native tongue,” Cam murmured. “Will you teach our kids to speak Ukrainian?”\u003c/p\u003e\n\u003cp\u003eDomini let her head fall back on the cushion and closed her eyes. “Do you think Anton will ever talk about Rex? Or will he just avoid the issue if we let him?”\u003c/p\u003e\n\u003cp\u003eKind of like she’d sidestepped his question. Cam decided not to push it. “Give him time. I know we all wanna be one big happy family from the get go, but it’ll take us all time to adjust.”\u003c/p\u003e\n\u003cp\u003e“Are you adjusting, Cam? Now that you’ve got a kid and a wife? Do you want us to be a big happy family? When all this chaos you never wanted is destroying the serenity of your haven?”\u003c/p\u003e\n\u003cp\u003eNo, now I’ve got everything I ever wanted.\u003c/p\u003e\n\u003cp\u003eDomini wasn’t the only one who’d mastered the art of deflection. “I’ll double check I shut the grill off while you tuck Anton in.”\u003c/p\u003e\n\u003cp\u003eDomini was already in bed when he returned to their bedroom. Cam stripped, unfastened his prosthesis and slid beneath the covers.\u003c/p\u003e\n\u003cp\u003eImmediately Domini wrapped herself around him. She kissed his biceps. And his collarbones. Her lips skimmed his throat. “Cam?”\u003c/p\u003e\n\u003cp\u003e“Mmm?”\u003c/p\u003e\n\u003cp\u003e“Touch me.”\u003c/p\u003e\n\u003cp\u003e“Domini. Baby, you’re supposed to take it easy.”\u003c/p\u003e\n\u003cp\u003e“So love me nice and easy. And slow. You love to torture me. Take your time with me, Cam.” She sank her teeth into his earlobe. “Please. I need you.”\u003c/p\u003e\n\u003cp\u003eCam was helpless to resist. He didn’t want to resist. He kissed her. Teased her. Showed her with his hands and his mouth and his body how much he loved her.\u003c/p\u003e\n\u003cp\u003eWhen he slid inside her, surrounded by her warmth and softness and strength, he realized she made him a whole man and it didn’t have a damn thing to do with his missing leg. It had everything to do with filling his heart.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Three\u003c/p\u003e\n\u003cp\u003e“We don’t have to go. In fact, I think we oughta stay home. You have been sick.”\u003c/p\u003e\n\u003cp\u003eDomini tied the laces on her tennis shoes. “Not sick, Cam. Anemic. I’m feeling much better after being babied by you guys for the last two days. I want to enjoy the gorgeous day. I’m tired of being cooped up inside.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-47.html","bookId":2687,"creation":"Oct 5, 2019 10:15:55 AM","modification":"Oct 5, 2019 10:15:55 AM"}
