{"id":70194,"no":48,"title":"Page 48","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“There are gonna be a million people there,” Cam warned. “And my family will grill both of us on our marriage, if we’re gonna start havin’ kids—”\u003c/p\u003e\n\u003cp\u003eHer stomach knotted, but she tossed out a breezy, “Maybe they won’t, since we already have a kid.”\u003c/p\u003e\n\u003cp\u003eAnton and Gracie burst into the kitchen. “Is it time to go yet?”\u003c/p\u003e\n\u003cp\u003eDomini gave Cam a we-don’t-want-to-disappoint-Anton look.\u003c/p\u003e\n\u003cp\u003eCam sighed. “Fine. But if you look the slightest bit faint, we’re comin’ home and I’m tyin’ you to the bed for a solid week.”\u003c/p\u003e\n\u003cp\u003eShe stood on tiptoe and kissed his cheek. Her lips slid to his ear and she whispered, “Is that a promise, Deputy?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“Good because I miss that side of you. You’ve been too careful with me lately. You know I won’t break.”\u003c/p\u003e\n\u003cp\u003eHe eased back to look at her face. “Domini, I—”\u003c/p\u003e\n\u003cp\u003e“Are you two gonna suck face or are we going?”\u003c/p\u003e\n\u003cp\u003e“Suck face. Definitely.” Cam teased his mouth over hers and her heart jumped.\u003c/p\u003e\n\u003cp\u003e“Yuck. We’re outta here.” The sliding glass door slammed.\u003c/p\u003e\n\u003cp\u003eDomini stepped back. “We’ll be lucky if any of the doors in this house survive until his teen years.”\u003c/p\u003e\n\u003cp\u003eCam went still.\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Ah. Nothin’. I just can’t imagine Anton a teenager.”\u003c/p\u003e\n\u003cp\u003eThat was weird. Didn’t he expect to be around then?\u003c/p\u003e\n\u003cp\u003eMaybe you won’t be once you tell him the truth.\u003c/p\u003e\n\u003cp\u003e“Do we have everything?”\u003c/p\u003e\n\u003cp\u003e“I guess.” Cam caught her staring at his pants. “What?”\u003c/p\u003e\n\u003cp\u003e“I’ve never seen you wear those.” His baggy dark khaki pants appeared to be made out of shiny, lightweight parachute material, with cargo pockets everywhere and elastic bands at the knees and ankles. “Are they new?”\u003c/p\u003e\n\u003cp\u003eHe snorted. “Hell no, they’re old. I couldn’t face wearing jeans today, sweats are too casual and every other pair of pants is in the hamper, so this is what was left.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry I didn’t have a chance to do laundry this week. I’m slacking on all sorts of wifely duties.”\u003c/p\u003e\n\u003cp\u003eCam tipped her chin up. “I didn’t marry you so you could wash my clothes, Domini.”\u003c/p\u003e\n\u003cp\u003eNo, you married me because you’re selfless, perfect and a good man.\u003c/p\u003e\n\u003cp\u003eHe pecked her on the mouth. “Let’s go before I find another reason to stay.”\u003c/p\u003e\n\u003cp\u003e“Another?”\u003c/p\u003e\n\u003cp\u003e“Tyin’ you to the bed and keepin’ you there all day is mighty tempting.”\u003c/p\u003e\n\u003cp\u003eOutside, Anton was already in the truck bed with Gracie.\u003c/p\u003e\n\u003cp\u003e“Come on, hop in the front,” Domini said.\u003c/p\u003e\n\u003cp\u003e“Aw, do I have to? Everybody rides in the back of pickups with their dogs.”\u003c/p\u003e\n\u003cp\u003e“Everybody except for you.”\u003c/p\u003e\n\u003cp\u003eAnton turned his puppy dog eyes to Cam.\u003c/p\u003e\n\u003cp\u003eCam shrugged. “I don’t see the big deal. It’s only ten miles.”\u003c/p\u003e\n\u003cp\u003e“In the back of a bouncy pickup on a gravel road!”\u003c/p\u003e\n\u003cp\u003e“So he’ll be dusty. He won’t be the only one.”\u003c/p\u003e\n\u003cp\u003e“Ky rides in the back of Cord’s truck all the time,” Anton added.\u003c/p\u003e\n\u003cp\u003e“We all did. We all turned out fine.”\u003c/p\u003e\n\u003cp\u003eShe knew she was outnumbered. And when she really thought about it, they’d been siding together a lot in the last week. “All right. But you stay down. No hanging off the side, I mean it.”\u003c/p\u003e\n\u003cp\u003e“I promise.”\u003c/p\u003e\n\u003cp\u003eDomini couldn’t help but turn round every couple of minutes to check on Anton.\u003c/p\u003e\n\u003cp\u003e“Stop worrying. He’s happier than a pig in shit,” Cam drawled. He plucked up her hand from the middle seat and kissed her knuckles. “Is the honeymoon over? We’ve only been married two months and you’re not sitting close to me in the truck anymore.”\u003c/p\u003e\n\u003cp\u003eShe scooted closer. “Better?”\u003c/p\u003e\n\u003cp\u003e“Much. I’m always better with you by my side.”\u003c/p\u003e\n\u003cp\u003eA sigh of contentment drifted out. She rested her head on Cam’s shoulder. He draped his arm across the back of the seat and lightly stroked the outside of her arm. Sometimes the silences between them were more revealing than words.\u003c/p\u003e\n\u003cp\u003eVehicles crowded the yard at the Carson McKay ranch. Kids and dogs ran everywhere. With all the questions they’d be facing about future kids, she wished she’d talked to Cam before they’d left home.\u003c/p\u003e\n\u003cp\u003eAnton beat on the window. “Can I get out now?”\u003c/p\u003e\n\u003cp\u003e“Go ahead.”\u003c/p\u003e\n\u003cp\u003eSuddenly shy, Domini kept a death grip on Cam’s hand as they wended through the chairs and tables.\u003c/p\u003e\n\u003cp\u003eCarolyn McKay hopped up the instant she saw them.\u003c/p\u003e\n\u003cp\u003eBecause Domini’s schedule and Cam’s schedules hadn’t meshed, they’d missed out on all the McKay family dinners in the last two months, so this was Domini’s first official family function as Cam’s wife.\u003c/p\u003e\n\u003cp\u003e“Cam! Sweetie, it’s good to see you.”\u003c/p\u003e\n\u003cp\u003e“Hey, Ma.”\u003c/p\u003e\n\u003cp\u003eShe hugged him for a long time. Then she hugged Domini. “It’s good to see you too, Domini. I heard you’ve been under the weather.”\u003c/p\u003e\n\u003cp\u003e“She’s anemic, which makes her tired. She’s taking heavy duty iron.”\u003c/p\u003e\n\u003cp\u003e“Oh, you poor thing!” Carolyn said. “What can I do?”\u003c/p\u003e\n\u003cp\u003e“Don’t be upset if we leave early. I have to take her home and get her back in bed.”\u003c/p\u003e\n\u003cp\u003e“Spoken like a true McKay man,” Keely said.\u003c/p\u003e\n\u003cp\u003eDomini blushed.\u003c/p\u003e\n\u003cp\u003e“I hope you’ll stick around for a little while,” Carolyn said. “I hardly get to see you. I’ve thought about doin’ something wild to get myself arrested by you, just so we’d have time to chat.”\u003c/p\u003e\n\u003cp\u003e“Great plan, Ma.”\u003c/p\u003e\n\u003cp\u003e“You are welcome to stop by our house anytime,” Domini offered.\u003c/p\u003e\n\u003cp\u003eCarolyn gave her a puzzled look, almost as if she didn’t believe Domini’s invitation. Not that Domini blamed her. Cam wasn’t known for his hospitality and Carolyn probably assumed Domini was the same way, especially since she and Cam had little to do with his parents since they’d gotten married.\u003c/p\u003e\n\u003cp\u003eA herd of boys, ranging in age from eight to three, barreled up. Domini was happy to see Anton in the thick of things.\u003c/p\u003e\n\u003cp\u003e“Grama, can we please have some cookies? We’re starvin’,” Ky pleaded.\u003c/p\u003e\n\u003cp\u003e“Of course, I can’t have poor starving kids runnin’ around. What would the neighbors think? I left the cookie jar on the back porch.”\u003c/p\u003e\n\u003cp\u003eA chorus of “Thanks!” broke out. Boots thumped, dust kicked up and dogs barked as the group tore off.\u003c/p\u003e\n\u003cp\u003e“Cookies? Before lunch?” Cam mock-chided. “You’re getting soft. You never would’ve let us have cookies that early.”\u003c/p\u003e\n\u003cp\u003e“Grandbabies are different. I can sugar them up and send them home with their parents.” Carolyn strolled off when Kimi McKay shouted for her.\u003c/p\u003e\n\u003cp\u003e“Come on, let’s make the rounds so we can leave right after lunch,” Cam murmured.\u003c/p\u003e\n\u003cp\u003eThe first people they approached were India and Skylar. India swayed with a blanketed bundle tucked against her body. A toddler with auburn ringlets was cocked on Skylar’s hip. Colt stood behind India talking to Kade, who also had a toddler clinging to him. Cam released her hand and moved between his brother and cousin.\u003c/p\u003e\n\u003cp\u003eIndia smiled. “We didn’t know if you guys would make it. Anton is off running with the boys?”\u003c/p\u003e\n\u003cp\u003e“And girl,” Skylar said dryly. “I don’t know why Eliza is so determined to keep up with her boy cousins.”\u003c/p\u003e\n\u003cp\u003e“Because she is a girl, that’s why. I remember it well.” Keely snuck in the group and held her hands out. “Shannie, come with Aunt Keely and we’ll go see what the pack is up to.”\u003c/p\u003e\n\u003cp\u003eShannie practically jumped into Keely’s arms.\u003c/p\u003e\n\u003cp\u003eDomini wasn’t surprised when India and Skylar’s discussion returned to business. “It pisses me off she had to go looking for work at all.”\u003c/p\u003e\n\u003cp\u003e“Carolyn didn’t invite Casper and Joan, did she?”\u003c/p\u003e\n\u003cp\u003e“No. I know she invited Jessie. I don’t know about Tell and Dalton. But if Jessie shows up Brandt will probably be with her. I’m so glad they’re helping each other through this.”\u003c/p\u003e\n\u003cp\u003eDomini didn’t have a clue what they were talking about. Should she ask? If she didn’t would they think she didn’t give a damn about Cam’s family?\u003c/p\u003e\n\u003cp\u003eSkylar must’ve sensed her curiosity. “Sorry. I don’t know if Cam told you about what happened with Jessie after Luke’s funeral?”\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e“Casper kicked Jessie out of the trailer she’d shared with Luke and he told her she had no financial claim on any part of the McKay Ranch and she was on her own.”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Afraid so. Jessie had nowhere to live, no job, no place for her horses or her llamas. Poor girl. Her dad is still chasing the rodeo circuit. Her mom has remarried and is living on the Shoshone reservation with her new husband.”\u003c/p\u003e\n\u003cp\u003e“If she needs a job I could always use extra help at Dewey’s—”\u003c/p\u003e\n\u003cp\u003eSkylar squeezed her arm. “You are such a sweetie, Domini, to offer. I needed to hire someone to replace Nadia, so Jessie is working for me at Sky Blue. Brandt tracked down a rental place outside of Moorcroft with a small pasture so she’s kept her animals.”\u003c/p\u003e\n\u003cp\u003e“That is so awful. I didn’t know.” Domini wondered why Cam hadn’t told her. Wouldn’t that be something you’d tell your spouse?\u003c/p\u003e\n\u003cp\u003eLike you have any right to judge him on keeping secrets.\u003c/p\u003e\n\u003cp\u003e“Cam keeps to himself and generally stays out of family—I mean ranch—business. Anyway, Casper’s behavior caused another big rift with the McKay families. Even Casper’s sons are pissed off at him. So in addition to losing their brother…”\u003c/p\u003e\n\u003cp\u003eHudson fussed and Colt was right there. “I’ll take him.”\u003c/p\u003e\n\u003cp\u003eIndia handed the baby over, but followed Colt to the house anyway.\u003c/p\u003e\n\u003cp\u003eSkylar sighed. “My sister is absolutely smitten with her son. She’s as bad as Chassie was.”\u003c/p\u003e\n\u003cp\u003e“Did someone say my name?” Chassie inquired sweetly behind Skylar. \u003c/p\u003e","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-48.html","bookId":2687,"creation":"Oct 5, 2019 10:15:55 AM","modification":"Oct 5, 2019 10:15:55 AM"}
