{"id":70151,"no":5,"title":"Page 5","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThen they descended on Cam like a pack of hyenas.\u003c/p\u003e\n\u003cp\u003eAJ drilled him in the chest with her finger. “FYI Deputy McKay, I’m a big girl. And if I wanna get shitfaced, I’ll get shitfaced, so back off.”\u003c/p\u003e\n\u003cp\u003e“Don’t you dare call Carter in Canyon River, or so help me, I will ban you for life from Dewey’s,” Macie warned.\u003c/p\u003e\n\u003cp\u003e“Yeah,” Channing chimed in. “If you tattle to Colby before I have a chance to explain, I will call your mother and suggest weekly instead of monthly McKay family dinners.”\u003c/p\u003e\n\u003cp\u003eChassie swayed in front of him. “What they said. Times two, ’cause I got two ornery guys to deal with.”\u003c/p\u003e\n\u003cp\u003eDomini just blinked those exquisite icy blue eyes at him.\u003c/p\u003e\n\u003cp\u003eDamn women sticking together. It’d been easier when Keely was the only woman in the family. Then the McKay boys could band against her.\u003c/p\u003e\n\u003cp\u003eRight. Keely always had the upper hand, she knew it, and she played it well. Now they were outnumbered.\u003c/p\u003e\n\u003cp\u003eCam stalked off, but not before he heard another round of high fives and drunken whoops of victory.\u003c/p\u003e\n\u003cp\u003eNo one pressed charges, no surprise. It didn’t take long to assess the damages. He handed his sister a piece of paper.\u003c/p\u003e\n\u003cp\u003e“What’s this?”\u003c/p\u003e\n\u003cp\u003e“They’re keeping your deposit for the party and you’ve been banned from Twin Pines indefinitely.”\u003c/p\u003e\n\u003cp\u003eKeely shrugged and folded the paper. “The food sucks here anyway. And if Margo and Amanda are regular customers? Then their clientele sucks too.”\u003c/p\u003e\n\u003cp\u003eCam took India aside. “Bein’s you’re sober, can you get the rest of your sisters in drunken arms home? Since I’ve been barred from calling their husbands to pick them up?”\u003c/p\u003e\n\u003cp\u003e“Sure. I’ll take Chass too, since we’re neighbors.” India’s gaze flicked between Cam and Domini. “You’ll make sure if Domini’s walking home she gets there all right?”\u003c/p\u003e\n\u003cp\u003eHe snorted. “Domini ain’t walking home. She’s riding with me when I drop Keely and Ginger off.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“So I have witnesses I didn’t kill my baby sis and dump her body out in the boondocks for her latest stunt.”\u003c/p\u003e\n\u003cp\u003eIndia whistled, directing the women riding in her SUV to the side door. She scorched Cam with a look. “Don’t be stupid, Cameron McKay. You’ve been fucking with her head long enough. Either go for it, or let her go. But it’s selfish to try and have it both ways.” She didn’t wait for a response, but spun on her heel and left.\u003c/p\u003e\n\u003cp\u003eNo explanation necessary. Only one woman had him tied up in knots. His gaze automatically sought her out.\u003c/p\u003e\n\u003cp\u003eDomini was already staring at him.\u003c/p\u003e\n\u003cp\u003eHe crooked his finger at her.\u003c/p\u003e\n\u003cp\u003eShe sauntered over without delay. “Yes?”\u003c/p\u003e\n\u003cp\u003eCam had a hard time breathing when she looked at him like that. Like she’d do anything he asked her. Anything he demanded of her. His gaze roamed over her pretty face, she could be a princess with her regal looks: jutting cheekbones, a high forehead, a thin nose and a delicate jaw. Pale skin, pale eyes, pale hair. Domini should look washed out. She should blend into the background. But she didn’t—she was a beacon of light and beauty in the darkness.\u003c/p\u003e\n\u003cp\u003e“Cam? Can I go now?”\u003c/p\u003e\n\u003cp\u003eHe refocused on her arctic blue eyes. “No. You’re riding with me.”\u003c/p\u003e\n\u003cp\u003e“I can walk home. Unless there’s a law against that?”\u003c/p\u003e\n\u003cp\u003eGod. Her voice alone could bring him to the edge of ecstasy. The measured enunciation, accented with the sexy, husky hint of her native tongue. Did she cry out in English when she came? Or in Ukrainian?\u003c/p\u003e\n\u003cp\u003e“Stop staring at me, Deputy.”\u003c/p\u003e\n\u003cp\u003e“Not a chance. Come on.”\u003c/p\u003e\n\u003cp\u003eKeely and Ginger waited by the door.\u003c/p\u003e\n\u003cp\u003e“Where’s Ramona?”\u003c/p\u003e\n\u003cp\u003e“She caught a ride from a friend.”\u003c/p\u003e\n\u003cp\u003eOutside, Cam opened the rear door of the patrol car. “You two are in the back.”\u003c/p\u003e\n\u003cp\u003eGinger climbed in without objection. Not his mouthy baby sister. Her protest, “Hey! That’s not f—” was lost in the cab as Cam slammed the door.\u003c/p\u003e\n\u003cp\u003eSmiling, he shoved his key in the door lock on the passenger’s side. His belly jumped when Domini placed her hand on his forearm.\u003c/p\u003e\n\u003cp\u003e“I can open my own door.”\u003c/p\u003e\n\u003cp\u003e“Not without a key you can’t. It’s self-locking for security reasons.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eCam glanced at the stubborn slant of her mouth. His gut twisted seeing the bump on her jaw. Without thinking, he cupped her neck, stroking his thumb across the swollen spot. “Next time, stay out of the line of fire, princess.”\u003c/p\u003e\n\u003cp\u003e“Is that a direct order, Deputy?”\u003c/p\u003e\n\u003cp\u003e“Yes.” He lightly swept over the protrusion again, just because he could. “I’m bossy. It’s a habit, I’m afraid.”\u003c/p\u003e\n\u003cp\u003e“That’s what I like about you. How easily you take charge.”\u003c/p\u003e\n\u003cp\u003eHe didn’t look away even when his head screamed retreat and his dick pulsed against his zipper.\u003c/p\u003e\n\u003cp\u003eDomini didn’t look away either. “Does it mean anything? You touching me like this?”\u003c/p\u003e\n\u003cp\u003e“Like what?”\u003c/p\u003e\n\u003cp\u003e“Like you don’t want to stop.”\u003c/p\u003e\n\u003cp\u003eGod help me, I don’t want to stop.\u003c/p\u003e\n\u003cp\u003e“Do you want it to mean something, Domini?”\u003c/p\u003e\n\u003cp\u003e“Yes.” Her lashes fluttered. “Maybe it’s liquid courage allowing me to say this, but do you know how many times I’ve imagined the different ways you’d touch me? Softly. Firmly. Sweetly. Roughly.”\u003c/p\u003e\n\u003cp\u003eCam’s heart beat a million times faster. He wanted to pull her closer and devour her mouth. He wanted to trace her every curve, with meticulous attention to every dip and hollow. He wanted to see her elegant fingers mapping his body with equal curiosity.\u003c/p\u003e\n\u003cp\u003eFour loud smacks on the rear window brought him back to reality. He reluctantly let his hand fall from her face and opened Domini’s door.\u003c/p\u003e\n\u003cp\u003eGinger and Keely gabbed nonstop during the ride. Domini didn’t say a word, choosing to gaze out the window into the darkness, her hands primly folded in her lap, the picture of sweetness. Of innocence. Of perfection. Of total fucking hotness.\u003c/p\u003e\n\u003cp\u003eThat’s what I like about you. How easily you take charge.\u003c/p\u003e\n\u003cp\u003eHe half feared, half hoped she’d been telling the truth.\u003c/p\u003e\n\u003cp\u003e“Turn here,” Ginger said.\u003c/p\u003e\n\u003cp\u003eGinger’s one-level ranch house had a detached garage off to one side and a wheelchair ramp running the perimeter. The sight of that wheelchair ramp caused Cam’s stump to twitch and the word never to echo in his head.\u003c/p\u003e\n\u003cp\u003eKeely said, “Hey. Isn’t that Buck’s rig?”\u003c/p\u003e\n\u003cp\u003e“What? Yes. But he’s supposed to be camping with Hayden.” Ginger yanked on the door handle. “Goddammit let me out!”\u003c/p\u003e\n\u003cp\u003e“Hang on.” Cam shifted his weight, getting out of the vehicle with his bum leg was harder than climbing in. By the time he’d opened the door, Buck met them in front of the patrol car.\u003c/p\u003e\n\u003cp\u003eGinger nearly plowed Buck over. “Where is he? What happened?”\u003c/p\u003e\n\u003cp\u003eBuck set his hands on Ginger’s shoulders. “Whoa there, Red, settle down. Everything is fine. Hayden’s stomach was actin’ up again, so we canned the campin’ trip. No biggie. I gave him some 7-Up and soda crackers. He’s sleeping in his room.”\u003c/p\u003e\n\u003cp\u003e“Then why are you still here?”\u003c/p\u003e\n\u003cp\u003e“Hayden was worried about you. He said you never go out. He made a big ruckus about the never part of it.”\u003c/p\u003e\n\u003cp\u003eShe muttered, “That little tattletale.”\u003c/p\u003e\n\u003cp\u003e“Anyway, I promised him I’d wait until you were home safely.” Buck glanced at the patrol car. “Maybe you oughta tell me why my cousin is bringing you home in a cop car.”\u003c/p\u003e\n\u003cp\u003e“Well, I had a little liquid fun with your cousin’s wives and then there was this bar fight…”\u003c/p\u003e\n\u003cp\u003eBuck squinted. “Is that Keely waving at me through the cage?”\u003c/p\u003e\n\u003cp\u003eCam nodded.\u003c/p\u003e\n\u003cp\u003e“Then that explains everything. Thanks for bringing Red back. I’ll take it from here.” Buck steered Ginger toward the porch. She tried to jerk away from his hold, but he just yanked her flush with his body and spoke in her ear.\u003c/p\u003e\n\u003cp\u003eThe second Cam was back in his patrol car, Keely bombarded him with excuses, explanations, and justifications, until he said, “Enough.”\u003c/p\u003e\n\u003cp\u003eShe sighed despairingly. “Look. I know you’re mad as hell at me right now, Cam.”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“I know I have no right to ask this.”\u003c/p\u003e\n\u003cp\u003e“Nope.”\u003c/p\u003e\n\u003cp\u003e“Just hear me out? Please?”\u003c/p\u003e\n\u003cp\u003e“Fine. You’ve no right to ask me…what?”\u003c/p\u003e\n\u003cp\u003e“For a favor.”\u003c/p\u003e\n\u003cp\u003eHe laughed.\u003c/p\u003e\n\u003cp\u003e“I’m serious.” Keely spoke through the steel cage. “Even though I’m an adult, if I show up drunk, bloody and bruised at Mom and Dad’s, they’ll both have a fit. It’ll be a big ugly scene and I cannot deal with it tonight.”\u003c/p\u003e\n\u003cp\u003e“So what do you expect me to do? Run interference for you, Miz Adult?”\u003c/p\u003e\n\u003cp\u003e“No! Let me stay at your place. Please? Just for one night? I’m so tired I’ll probably crash and I promise I won’t be any trouble—”\u003c/p\u003e\n\u003cp\u003e“Trouble follows you everywhere, so no dice.”\u003c/p\u003e\n\u003cp\u003e“I get that your house is your haven, but Cam, you have an extra bedroom that no one uses. You won’t even know I’m there, I swear.”\u003c/p\u003e\n\u003cp\u003e“Keely—”\u003c/p\u003e\n\u003cp\u003e“Domini, help me out here,” Keely pleaded.\u003c/p\u003e\n\u003cp\u003eDomini faced him. “I think you should listen to her since she is letting you off the hook.”\u003c/p\u003e\n\u003cp\u003e“How is allowing her to crash at my place letting me off the hook?”\u003c/p\u003e\n\u003cp\u003e“If you just dump her off at your parent’s place, they’ll be angry you didn’t come in and explain why Keely is a drunken mess. If you escort her into the house, your parents will still be angry and expect you to explain why she’s a drunken mess. So calling them to say she’s staying with you is the best solution all around.”\u003c/p\u003e\n\u003cp\u003eDamn women sticking together.\u003c/p\u003e\n\u003cp\u003e“See? It makes perfect sense,” Keely said. “Except I’m not that much of a drunken mess.”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003e“Cam? Please? I’ll never ask you for anything ever again.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-5.html","bookId":2687,"creation":"Oct 5, 2019 10:15:55 AM","modification":"Oct 5, 2019 10:15:55 AM"}
