{"id":70198,"no":52,"title":"Page 52","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You in pain now?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“How bad?”\u003c/p\u003e\n\u003cp\u003e“It’s been worse.”\u003c/p\u003e\n\u003cp\u003eDomini rattled off a Russian phrase.\u003c/p\u003e\n\u003cp\u003eHell, she only swore in Russian when she was really pissed. He attempted to remove his stump from her hands. “Let me do this. I…you know my family ain’t ever seen me—”\u003c/p\u003e\n\u003cp\u003e“Vulnerable?” she supplied. “The injured war hero Cameron McKay has a chip on his shoulder the size of his missing leg, when it comes to letting his family see his stump.”\u003c/p\u003e\n\u003cp\u003eCam’s mouth dropped open in shock.\u003c/p\u003e\n\u003cp\u003eBut his wife wasn’t finished. “I can see how you’d hate all the love, support and help they’ve offered you. That has to suck.”\u003c/p\u003e\n\u003cp\u003e“Domini—”\u003c/p\u003e\n\u003cp\u003eShe got right in his face. “I understand that you don’t want to show your stump to the world at large. But these people—” she gestured to the group watching them very closely from afar, “—aren’t the world at large. They care about you. They always have, they always will. What don’t you get about that?”\u003c/p\u003e\n\u003cp\u003e“You sent Keely away,” he pointed out.\u003c/p\u003e\n\u003cp\u003e“I’m not talking about Keely. Besides, if I wouldn’t have told her to back off, you would have.”\u003c/p\u003e\n\u003cp\u003eTrue.\u003c/p\u003e\n\u003cp\u003e“Your inability to let your family see, just once, what the damn war did to you physically, makes you emotionally handicapped, and that is way worse than losing your damn leg.”\u003c/p\u003e\n\u003cp\u003eA hot wave of shame washed over him.\u003c/p\u003e\n\u003cp\u003eWhat could he say? Domini was exactly right. Yet, no one had dared say it to him before now. Ballsy, this soft-spoken woman he married.\u003c/p\u003e\n\u003cp\u003eHe turned his head, but instead of facing away, he looked toward the family members who hadn’t gone far after the directive from his suddenly bossy wife.\u003c/p\u003e\n\u003cp\u003eIn truth, his family never had gone far. They’d rallied around him from the second he’d been back on American soil. Never complained when he’d banned them from the hospital. Understood when he claimed the need for privacy. Had they resigned themselves to the fact he’d never be the man he was?\u003c/p\u003e\n\u003cp\u003eYou aren’t the man you were and maybe that’s not such a bad thing.\u003c/p\u003e\n\u003cp\u003eTalk about a day for epiphanies.\u003c/p\u003e\n\u003cp\u003eDomini touched his face. “You mad at me?”\u003c/p\u003e\n\u003cp\u003eHe kissed the inside of her wrist. “Yeah, I hate that you’re right. So what do I do? Lay here and let them file over and gawk at me like…” I’ve always feared they would?\u003c/p\u003e\n\u003cp\u003eThe pack of dogs chasing a squirrel brought Ky running past. He skidded to a stop. Behind Ky were the rest of his nephews. His whole body stiffened as he braced himself for their stares. And questions. And disgust.\u003c/p\u003e\n\u003cp\u003eKy peered at his stump without apology. “So did it hurt when they chopped it off?”\u003c/p\u003e\n\u003cp\u003e“I don’t remember, but it hurt afterward.”\u003c/p\u003e\n\u003cp\u003eGib asked, “Didja cry?”\u003c/p\u003e\n\u003cp\u003e“Yep.”\u003c/p\u003e\n\u003cp\u003e“I prolly woulda cried too,” he said solemnly.\u003c/p\u003e\n\u003cp\u003eOut of the mouth of babes.\u003c/p\u003e\n\u003cp\u003eThane edged closer to the prosthetic. “Is that a robot leg?”\u003c/p\u003e\n\u003cp\u003e“Sort of.”\u003c/p\u003e\n\u003cp\u003eHis hazel eyes went wide. “Like in Transformers?”\u003c/p\u003e\n\u003cp\u003e“If it was like in Transformers, Uncle Cam could turn his leg into an arm,” Ky chided.\u003c/p\u003e\n\u003cp\u003eBefore Cam answered, Gib said, “Wouldn’t it be cool if he could turn it into a machine gun?”\u003c/p\u003e\n\u003cp\u003e“That’d totally be cool!”\u003c/p\u003e\n\u003cp\u003e“Yeah! Or how about some of them knives?” Thane said, adding a slashing motion.\u003c/p\u003e\n\u003cp\u003eThe boys wandered off, debating the merits on the coolest robotic body parts.\u003c/p\u003e\n\u003cp\u003eCam frowned. That was the extent of it? That was what he’d worried about? Sort of anticlimactic.\u003c/p\u003e\n\u003cp\u003eSoft fingertips gently traced the red marks on his stump. Domini said nothing; she just touched him and he felt it clear down to his soul. He mouthed, “I love you,” and she gave him that special serene smile.\u003c/p\u003e\n\u003cp\u003eFour shadows fell across him. He looked up as Carter, Colby, Cord, and Colt crouched down.\u003c/p\u003e\n\u003cp\u003eA tense minute passed when no one spoke.\u003c/p\u003e\n\u003cp\u003e“Sorry about the boys. They were…curious,” Carter said.\u003c/p\u003e\n\u003cp\u003e“No harm. I can’t say as I blame them. We’da all done the same thing at their ages.”\u003c/p\u003e\n\u003cp\u003e“I’ve said it before, and I’ll say it again, it sucks ass that this happened to you, bro,” Colt said.\u003c/p\u003e\n\u003cp\u003eMurmured agreements.\u003c/p\u003e\n\u003cp\u003eColby poked the fake leg. “How in the hell you walk on this every day is beyond me.”\u003c/p\u003e\n\u003cp\u003e“Obviously I didn’t do such a bang up job of walkin’ on it today.”\u003c/p\u003e\n\u003cp\u003eAnother bout of silence.\u003c/p\u003e\n\u003cp\u003eCord cleared his throat. “I admire the hell outta you for even tryin’.”\u003c/p\u003e\n\u003cp\u003e“We all do,” Carter added. “But as long as you’re a captive audience, we ain’t letting you up until we’ve had our say.”\u003c/p\u003e\n\u003cp\u003eFucking awesome.\u003c/p\u003e\n\u003cp\u003e“Since you came back you’ve forced us to see things in a new light in this family. So it’s ironic you can’t see what’s right in front of you,” Carter said.\u003c/p\u003e\n\u003cp\u003e“Did you think we’d look at you differently just because you’re missing a goddamn leg?” Colby’s eyes bored into him. “Did you honestly fucking believe that we’d somehow see you as…weak?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I did. Look at me. I’m sitting in the fucking skunkweed. I can’t get up by myself. That makes me weak.”\u003c/p\u003e\n\u003cp\u003e“No, that makes you stupid,” Cord fired back.\u003c/p\u003e\n\u003cp\u003e“Picking on the cripple, that’s nice, bro.”\u003c/p\u003e\n\u003cp\u003eDomini didn’t pipe in to defend him. She stayed silent and watchful.\u003c/p\u003e\n\u003cp\u003eColby’s arms were crossed over his chest. “I think what Cord—and all of us are sayin’—is we’re goddamned glad you ain’t dead. If anyone is weak in this family, it’s us, because we haven’t kicked your sorry ass before this. We just let you be. Well, that bullshit is over, little bro, I guarantee it. You’re part of this family whether you’re ranchin’ with us or not. Whether you like it or not. So get used to it. We’re gonna be in your face and in your life like we should’ve been all along.”\u003c/p\u003e\n\u003cp\u003eCam stared at Colt. Then Cord. Then Colby. Then Carter. His embarrassment at how he’d treated his brothers vanished when he understood how goddamn lucky he was to have them. How he had a chance to make this—another thing that’d gone wrong in his life—right.\u003c/p\u003e\n\u003cp\u003e“Don’t you have something to say?” Colt prodded.\u003c/p\u003e\n\u003cp\u003e“You wanna know what sucks worse than ranching?”\u003c/p\u003e\n\u003cp\u003e“Nothing?” Carter offered.\u003c/p\u003e\n\u003cp\u003eChuckles broke out.\u003c/p\u003e\n\u003cp\u003e“No. It was worse having to face Brandt and tell him about Luke. Losing his brother…I never want to go through that. Ever. Jesus.” Cam stopped, afraid he’d start bawling. Domini’s steady grip on his hand encouraged him to go on. “I never realized how hard it must’ve been on you guys, especially in the beginning, when you didn’t know if I was alive or dead. Then I get back here and I’m not the same guy.”\u003c/p\u003e\n\u003cp\u003e“Believe it or not, none of us are the same guy since you left when you were eighteen,” Cord said. “You’d know that if you weren’t bein’ such a reclusive asshole.”\u003c/p\u003e\n\u003cp\u003eCam winced. “I deserve that and more. Christ. I’m sorry.”\u003c/p\u003e\n\u003cp\u003e“We’ve all had our bad moments, that’s for damn sure.” Colt flashed him a challenging grin. “So now that all the touchy-feely crap is over…question is: do you need help up?”\u003c/p\u003e\n\u003cp\u003eSay no. Scream no.\u003c/p\u003e\n\u003cp\u003eCam swallowed his pride and his fear. “Yeah. Since I forgot my crutches, that’d be great.”\u003c/p\u003e\n\u003cp\u003e“See? That wasn’t so hard.”\u003c/p\u003e\n\u003cp\u003eHis brothers carried him to the porch like it was no big deal. He didn’t point out they should’ve carried him to his damn truck so he could go home.\u003c/p\u003e\n\u003cp\u003eAll of a sudden his brothers took off like their boots were on fire. When a sharp gasp sounded, he knew why: his mother stood behind him.\u003c/p\u003e\n\u003cp\u003e“So, is it worse than you thought?” he asked brusquely, fighting the temptation to cover his limb.\u003c/p\u003e\n\u003cp\u003e“No. The worst part was not knowing what it looked like.”\u003c/p\u003e\n\u003cp\u003eCam tipped his head back. Tears rolled from the corners of his mother’s eyes. Shit. “Ma. Don’t—”\u003c/p\u003e\n\u003cp\u003e“Don’t you tell me how to react when I see my boy’s blown-off leg for the first time, don’t even try, Cameron West McKay.”\u003c/p\u003e\n\u003cp\u003eHe bit his tongue, letting her to harangue him because he deserved it.\u003c/p\u003e\n\u003cp\u003e“After they told us you were gonna live through your injuries, I’ll admit after the immediate feeling of relief, I was pissed off at you.”\u003c/p\u003e\n\u003cp\u003e“Caro…” his dad warned.\u003c/p\u003e\n\u003cp\u003eShe waved him off. “I thought if you would’ve stayed here on the ranch, being a cowboy like your brothers, that this wouldn’t have happened to you.\u003c/p\u003e\n\u003cp\u003e“But then I think of poor Dag. And now Luke…and what their families—what our family is going through and how it’s ripping them apart on so many levels. Stupid accidents happen everywhere. All the time. No one is immune. No one is ever really safe.” A small sob escaped. “I realized I can’t protect you any more now than when you were my sweet baby boy who was determined to run before you could even walk.”\u003c/p\u003e\n\u003cp\u003e“Ma.”\u003c/p\u003e\n\u003cp\u003e“But it doesn’t change the fact I hate that you’re embarrassed about your stump. I hate you don’t understand how I see that stump—not as not a flaw, but a miracle.” She reached for Cam’s hand. “You don’t want to hear this, but I’ll say it anyway. When you went missing…” Her voice cracked. “That was the worst week of my life. Or so I thought.”\u003c/p\u003e\n\u003cp\u003eCam frowned.\u003c/p\u003e\n\u003cp\u003e“But in some ways, it’s been harder having you living in Sundance. When you were in the army, you had an excuse for not being here. I could tell myself you would be with us if you could. Now that you live ten miles away and we still don’t see you, I know it’s your choice to stay away. The lie no longer works and that’s what hurts the most.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-52.html","bookId":2687,"creation":"Oct 5, 2019 10:15:55 AM","modification":"Oct 5, 2019 10:15:55 AM"}
