{"id":70153,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBecause you’re a cripple. You’ll never be the man you were.\u003c/p\u003e\n\u003cp\u003eCam gritted his teeth against the voice of that bitter man inside his head, the voice who usually won the argument.\u003c/p\u003e\n\u003cp\u003eNot this time.\u003c/p\u003e\n\u003cp\u003eDomini hadn’t known him before his war injury. She knew him now. She wanted him now. That thought gave him the courage to open the door.\u003c/p\u003e\n\u003cp\u003eThe creak sounded unnaturally loud in the stillness of her apartment. Cam was shocked he’d heard anything above the swift beating of his heart. “Domini?”\u003c/p\u003e\n\u003cp\u003e“I’m here.”\u003c/p\u003e\n\u003cp\u003eHis head whipped around to see her perched on the couch.\u003c/p\u003e\n\u003cp\u003eNaked.\u003c/p\u003e\n\u003cp\u003eHoly fucking shit. She was beautiful. And even better, she was obedient. He grinned and crooked his finger at her.\u003c/p\u003e\n\u003cp\u003eDomini pushed to her feet and sauntered over.\u003c/p\u003e\n\u003cp\u003e“You’re naked.”\u003c/p\u003e\n\u003cp\u003e“You told me to be.”\u003c/p\u003e\n\u003cp\u003eHe traced the line of her jaw down her throat. “What are you thinking right now?”\u003c/p\u003e\n\u003cp\u003e“I can’t believe you’re really here.” The desire darkening her pale blue irises staggered him. “What are you thinking?”\u003c/p\u003e\n\u003cp\u003e“This.” Cam gripped her shoulders and crushed his mouth to hers.\u003c/p\u003e\n\u003cp\u003eThe sweet taste of mint teased his tongue as he dove straight in for a hungry, openmouthed kiss that was eight goddamn months overdue.\u003c/p\u003e\n\u003cp\u003eDomini wound her arms around his waist, kissing him back with greediness only matched by his. Her tongue dueled and retreated as she kissed him from every possible angle. Her fingertips dug into the muscles of his back.\u003c/p\u003e\n\u003cp\u003eAs much as Cam ached to explore every inch of her sinuous body, first with his hands and then with his tongue, he had to demonstrate from the start his take-charge side was his real sexual side.\u003c/p\u003e\n\u003cp\u003eCam’s lips meandered to her chin. He let his mouth skim the curve of her jaw, taking a minute to kiss the welt she’d received at the bar.\u003c/p\u003e\n\u003cp\u003eDomini’s soft moan stirred the air by his ear.\u003c/p\u003e\n\u003cp\u003e“Couch. Now.”\u003c/p\u003e\n\u003cp\u003eShe laced their fingers together, not caring his left pinky was gone as she tugged him to the living room.\u003c/p\u003e\n\u003cp\u003eCam trailed his fingertips across her collarbone, then he took a step back until his right calf hit the bottom of the couch. He’d already removed his gun and stashed it in the car. Next he unclipped the cuff pouch and tossed the handcuffs on the cushion behind him. Almost in slow motion, he pulled the end of the belt out of the first loop and released the buckle.\u003c/p\u003e\n\u003cp\u003eHer gaze never wavered from his crotch.\u003c/p\u003e\n\u003cp\u003eHe unsnapped the button on the waistband of his uniform pants and eased the zipper down. Jesus. He needed relief; his dick had been straining against his pants for an hour. The two halves of fabric separated, exposing his white boxer briefs. He watched her expression change as she caught her first glimpse of his cock.\u003c/p\u003e\n\u003cp\u003eCam kept his pants and briefs high on his upper thighs as he lowered to the couch, but he yanked them down his ass in the back. “Turn around and put your wrists together.” Two quick snaps and the handcuffs were locked behind her back. “Face me.”\u003c/p\u003e\n\u003cp\u003eShe looked amazing completely naked, half bound and fully willing.\u003c/p\u003e\n\u003cp\u003eAnd she’ll look damn good with your cock in her throat.\u003c/p\u003e\n\u003cp\u003e“Just so you know. I received a clean bill of health last month when I was at the VA in Cheyenne. What about you?”\u003c/p\u003e\n\u003cp\u003e“I haven’t…been with anyone since I moved here from Denver a few years back.”\u003c/p\u003e\n\u003cp\u003eHe lifted a brow. “A bunch of real sorry guys around these parts who let a beautiful woman spend her nights alone.”\u003c/p\u003e\n\u003cp\u003e“Do you include yourself on that list, Deputy?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eDomini smiled serenely.\u003c/p\u003e\n\u003cp\u003e“I want your mouth on me. I don’t care if you weren’t the swallowing type before, because now, you are. On your knees.”\u003c/p\u003e\n\u003cp\u003eShe dropped between his thighs and Cam noticed she was careful not to bump his prosthesis. Or was she avoiding touching it entirely?\u003c/p\u003e\n\u003cp\u003eShoving aside his doubts, Cam swept the hair from her flushed face, crushing the silky, fragrant strands in his hand. He wanted an unobstructed view of her mouth working him because he’d fantasized about this for too damn long and he was damn impatient to have it all right fucking now. “Lick the head.”\u003c/p\u003e\n\u003cp\u003eHer tongue darted out and rimmed the tip, lapping at the bead of moisture gathered in the center. She suckled the ruddy head, flicking her rough tongue over the sweet spot.\u003c/p\u003e\n\u003cp\u003eCam hissed. “I like it wet. I wanna feel you sucking me all the way into your hot mouth. Slowly. Make it last.”\u003c/p\u003e\n\u003cp\u003eShe sucked. She licked. She used her teeth. Her tongue. Oh man, that wicked, naughty tongue might break him. She kept her lips tight around his shaft from tip to base. Saliva ran down her chin and neck as she bobbed her head. Over and over. Domini worked Cam over until he could barely see straight and his dick was ready to explode.\u003c/p\u003e\n\u003cp\u003e“You really do get off with me telling you what to do, don’t you?”\u003c/p\u003e\n\u003cp\u003eThe affirmative noise vibrating in the back of her throat settled in his balls, drawing them up tight.\u003c/p\u003e\n\u003cp\u003eHe traced the outline of her upper lip as his cock plunged in and out of that wet, suctioning heat. He lost track of the number of strokes but the buzz began in his balls and zipped up his abdomen. He shoved until her mouth was around the root.\u003c/p\u003e\n\u003cp\u003eDomini gagged.\u003c/p\u003e\n\u003cp\u003e“Breathe through it, baby. Come on. That’s it.”\u003c/p\u003e\n\u003cp\u003eWhen she’d relaxed her throat muscles, he pulled out halfway and rammed in again. Faster, but with shallow thrusts.\u003c/p\u003e\n\u003cp\u003e“Tighten your lips more. Fuck, that’s good. Goddammit, here it comes.” Lost in sensation, he plunged deep and hissed, “Swallow. Now. All of it. Let your throat muscles work me.” Cam kept his grip on her head as his seed pulsed out and she swallowed every spurt.\u003c/p\u003e\n\u003cp\u003eAs he floated back to sanity, the arousing scent of her body drifted up. His hands fell away. His cock slipped from her mouth and he sagged into the couch cushions. Sweating. Breathing hard. Totally spent.\u003c/p\u003e\n\u003cp\u003eBut nowhere near done.\u003c/p\u003e\n\u003cp\u003eChapter Three\u003c/p\u003e\n\u003cp\u003eDomini watched pleasure soften the harsh angles of Cam’s face. She’d fantasized about this moment, but fantasies paled in comparison to the reality of being bound and on her knees before this strong, sexy, demanding man.\u003c/p\u003e\n\u003cp\u003eSurrender created the rush she’d been searching for.\u003c/p\u003e\n\u003cp\u003e“C’mere.” Cam’s big hands curled around her upper arms and he helped her to her feet. “Lemme touch you.”\u003c/p\u003e\n\u003cp\u003ePlease. Yes. Now. Everywhere.\u003c/p\u003e\n\u003cp\u003eHe settled her high on his lap, a knee on either side of his hips.\u003c/p\u003e\n\u003cp\u003eHis cock, still semi-erect, rested against his abdomen. The heat from his groin tempted her to grind hard into that thick shaft.\u003c/p\u003e\n\u003cp\u003e“Domini. Look at me.”\u003c/p\u003e\n\u003cp\u003eHer gaze tracked the line of brass buttons from the bottom of his khaki uniform shirt to his face. His eyes were usually bright blue, but right now, those eyes were dark with lust.\u003c/p\u003e\n\u003cp\u003eDomini’s heart rate accelerated.\u003c/p\u003e\n\u003cp\u003eCam’s hands glided down her arms, behind her back to her wrists. “The cuffs aren’t chafing you?”\u003c/p\u003e\n\u003cp\u003eCuffs? What cuffs? Oh. Right. She was handcuffed. How had she forgotten that?\u003c/p\u003e\n\u003cp\u003eBecause you were immersed in a blissful, sexual haze.\u003c/p\u003e\n\u003cp\u003e“My hands are fine.”\u003c/p\u003e\n\u003cp\u003e“Good to hear. Although, we seemed to’ve lost our momentum,” Cam murmured. His fingers trailed beneath her bound arms. He spread his hands across her naked back and gently urged her forward.\u003c/p\u003e\n\u003cp\u003e“Wait. I’m falling.”\u003c/p\u003e\n\u003cp\u003e“I won’t let you. Trust me.”\u003c/p\u003e\n\u003cp\u003eHe leaned closer, but his lips didn’t seek hers. His mouth zeroed in on her right nipple.\u003c/p\u003e\n\u003cp\u003eShe gasped when his wet tongue flicked the tip. Again and again. She arched and began to rock into him, trying to connect her sex to his.\u003c/p\u003e\n\u003cp\u003eCam lifted his mouth long enough to command, “Stay still.”\u003c/p\u003e\n\u003cp\u003eHow was she was supposed to stay still with the soft suction and heat of his hungry mouth? And the rasp of his five o’clock shadow on her flesh?\u003c/p\u003e\n\u003cp\u003e“You are as perfect everywhere as I imagined.” Cam lightly scraped his teeth over the beaded tip.\u003c/p\u003e\n\u003cp\u003e“You imagined me…naked?”\u003c/p\u003e\n\u003cp\u003eHe tipped his head back. “All the damn time.”\u003c/p\u003e\n\u003cp\u003e“Really?”\u003c/p\u003e\n\u003cp\u003eHis eyebrows drew together. Comprehension dawned. “You didn’t honestly believe I wasn’t attracted to you.”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“Why in the hell would you think that?”\u003c/p\u003e\n\u003cp\u003eBecause I redefine insecure. “Because you left after the one time you kissed me and never attempted to touch me again.”\u003c/p\u003e\n\u003cp\u003e“That wasn’t because I wasn’t attracted to you. That was out of self-preservation.”\u003c/p\u003e\n\u003cp\u003e“Why? Because you thought I might hurt you?”\u003c/p\u003e\n\u003cp\u003e“Not even close. But I ain’t exactly in the mood to talk about it.”\u003c/p\u003e\n\u003cp\u003e“What are you in the mood for?”\u003c/p\u003e\n\u003cp\u003eThen Cam was kissing her fiercely. One hand held her in place by the back of the neck. His other hand skimmed her torso and his fingers slipped straight between her legs.\u003c/p\u003e\n\u003cp\u003eDomini canted her hips, allowing him total access to whatever part he desired, giving him everything without having to ask.\u003c/p\u003e\n\u003cp\u003eCam stroked her pussy with soft exploratory touches. He kissed a path to her ear. “You’re wet. Did you get off havin’ my cock in your mouth?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eHe reconnected their lips as his middle finger swirled in the cream coating the mouth of her sex. He dragged that wet finger up and drew circles around her clit.\u003c/p\u003e\n\u003cp\u003eDomini’s thighs clenched and she suppressed a moan.\u003c/p\u003e\n\u003cp\u003eAs Cam’s mouth languidly moved over hers, he pushed one finger inside her slick channel, then two. He pumped the digits deep, stretching her delicate tissues, while the base of his thumb continually rubbed against her clit.\u003c/p\u003e\n\u003cp\u003eShe’d never felt such urgency, yet didn’t want the probing touches to end. The heat and fullness of his stroking fingers inflamed her as much as his lazy, seductive kisses.\u003c/p\u003e\n\u003cp\u003eCam’s lips broke free and he nuzzled her throat. “Come apart for me, Domini.” More kisses sizzled across her skin as his fingers worked magic inside her. “Tell me what’ll get you there.”\u003c/p\u003e\n\u003cp\u003e“I-I don’t know. Just…don’t stop. Please.” \u003c/p\u003e","sourceLink":"https://allnovel.net/shoulda-been-a-cowboy-rough-riders-7/page-7.html","bookId":2687,"creation":"Oct 5, 2019 10:15:55 AM","modification":"Oct 5, 2019 10:15:55 AM"}
