{"id":82772,"no":12,"title":"Page 12","content":"\u003cp\u003eThe next day after sunset, I bounded over to the Mansion with a renewed sense of delight. I was eager to see the Mansion return to normalor what Dullsvillians called a nightmare. I was proud that Alexander made the decision to be himselfor at least be as real as he could be without putting his true identity in danger. I knew it was an extremely hard choice for him to makebut either way he was going to be in the story. It was ultimately better that he shared the macabre artist that he was rather than an untrue, khaki-clad version of what he thought the town wanted him to be.\u003c/p\u003e\n\u003cp\u003eWhen I arrived atop Benson Hill, the Mansions door was wide open.\u003c/p\u003e\n\u003cp\u003eI entered the foyer to find the Mansion restored to its original disorder. The scent of lit candles and musty air that Id grown to love wafted through the halls. The brand-new crisp white linen covers were gone, exposing the worn Victorian couches. The silver floor lamps had been replaced with dripping candelabras. And the freshly purchased easel and metal desk with blue locker drawers had been taken from the library and the old desk and library books returned.\u003c/p\u003e\n\u003cp\u003eCurious, I bolted up the grand staircase. I peeked into Jamesons room to find his new accent rug at the foot of his bed. When I surveyed Sebastians room, the only thing organized was his shiny new desk.\u003c/p\u003e\n\u003cp\u003eAs I drew closer to the TV room, I heard Alexander and Sebastian talking intently.\u003c/p\u003e\n\u003cp\u003eSo havent you thought about it, man? Sebastian asked. You must have.\u003c/p\u003e\n\u003cp\u003eOf course I have, Alexander answered.\u003c/p\u003e\n\u003cp\u003eIsnt it difficult to resist? She is beautiful.\u003c/p\u003e\n\u003cp\u003eIt isnt easy.\u003c/p\u003e\n\u003cp\u003eWhat were they talking aboutwho were they talking about? I pressed my back flat to the wall and did my best to hear.\u003c/p\u003e\n\u003cp\u003eShe isnt a vampire, Alexander said.\u003c/p\u003e\n\u003cp\u003eBut if she wasman, you could be living the dream. You could sell the bottles in your cellar. Shed quench your thirst for eternity.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThey both laughed.\u003c/p\u003e\n\u003cp\u003eI agree with you that it would be easier if she had been born into our world, Sebastian began. Thats what I think. Then there are no decisionsno conflicts, no pressure.\u003c/p\u003e\n\u003cp\u003eIts enormous. I try my best not to think about it.\u003c/p\u003e\n\u003cp\u003eBut you do\u003c/p\u003e\n\u003cp\u003eOf course I do.\u003c/p\u003e\n\u003cp\u003eI waited with bated breath to finally get a glimpse into Alexanders thoughts. Ones that I knew he was reluctant to tell me about.\u003c/p\u003e\n\u003cp\u003eIf Becky were to go out with me, what would I do? Sebastian pondered. It would be very hard for me not to want to turn her. How do you manage?\u003c/p\u003e\n\u003cp\u003eI waited an eternity for Alexanders response. I pressed my ear closer to the door. I, like Sebastian, was eager to know how Alexander managed.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIts difficult.\u003c/p\u003e\n\u003cp\u003eIf only she were born a vampire, Sebastian said again, then it would be easier.\u003c/p\u003e\n\u003cp\u003eThen she wouldnt be Raven, Alexander lamented.\u003c/p\u003e\n\u003cp\u003eI sighed. But what did Alexander think about turning me? I was dying to know more.\u003c/p\u003e\n\u003cp\u003eSo, Sebastian pressed. Whats keeping you from it?\u003c/p\u003e\n\u003cp\u003eAlexander paused. Not Raven, I heard him say. Not my love for her. Or us being together.\u003c/p\u003e\n\u003cp\u003eI smiled inside and out.\u003c/p\u003e\n\u003cp\u003eI do imagine that moment, Alexander continued. Raven and I together on sacred ground. The first time I laid eyes on her, I knew she was what Id been searching for. What I didnt find with Luna or any girl Id ever known. But I never planned to fall for a mortalthe responsibility of it all. But no one said love is easy.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI tried my best not to scream in delight. Listening to Alexander admit to Sebastian that he truly wanted me in his world was what Id been waiting for.\u003c/p\u003e\n\u003cp\u003eDo you think you ever will? Sebastian asked. Ask her\u003c/p\u003e\n\u003cp\u003eWould Alexander really turn me? I waited for his answer, but all I heard was deafening silence.\u003c/p\u003e\n\u003cp\u003eMiss Raven! I heard a voice say from the shadows.\u003c/p\u003e\n\u003cp\u003eI thought Id jump clear through the Mansions roof.\u003c/p\u003e\n\u003cp\u003eI didnt know you arrived, the Creepy Man said in his thick Romanian accent. You must have snuck in.\u003c/p\u003e\n\u003cp\u003eThe door was wide\u003c/p\u003e\n\u003cp\u003eRaven? Alexander called from the room. Suddenly he was standing before me.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eUh, he stammered. I didnt know you were here. It was obvious he was calculating in his head whether Id heard their conversation.\u003c/p\u003e\n\u003cp\u003eSebastian was sitting with a gaming guitar in his hand.\u003c/p\u003e\n\u003cp\u003eSebastian was just going to show off his guitar talents, Alexander said, changing the subject. Were just missing a gothic rock star.\u003c/p\u003e\n\u003cp\u003eUhyeah, Sebastian said. I could use a singer.\u003c/p\u003e\n\u003cp\u003eThey both looked to me.\u003c/p\u003e\n\u003cp\u003eSure, I said. Just as long as you both have earplugs.\u003c/p\u003e\n\u003cp\u003eThe following day, Alexander closed the coffin lid on Sebastians and my participation in his interview. We were banished from the Mansion, and just to be safely at a distance Sebastian and I met at Dullsvilles fountain until Alexander could join us.\u003c/p\u003e\n\u003cp\u003eIt was odd, to say the least, to be hanging out with Alexanders best friend without Alexander. What were we going to talk about? Would it be strange to be hanging out with a guy who wasnt my boyfriend? The only other guy I was ever alone with, besides the occasional run-in with Trevor, was my snarky little brother.\u003c/p\u003e\n\u003cp\u003eThere was no doubt Sebastian was charming. His mood was playful and his intentions toward me benign.\u003c/p\u003e\n\u003cp\u003eWhat I didnt plan on was anyone seeing us, since there was a soccer game at school and the whole town was going to be there.\u003c/p\u003e\n\u003cp\u003eRaven, I heard a sweet voice call. Are you two on a date?\u003c/p\u003e\n\u003cp\u003eIt was Becky, the last person, besides Trevor, I wanted Sebastian to see.\u003c/p\u003e\n\u003cp\u003eHey, what are you doing here? I asked. I thought youd be at school, cheering for Matt.\u003c/p\u003e\n\u003cp\u003eIm on my way. Wheres Alexander?\u003c/p\u003e\n\u003cp\u003eHe has an interview with the Gazette. So I was being the tour guideonly Sebastians already seen everything in town.\u003c/p\u003e\n\u003cp\u003eI know one thing you havent seen: Our schools winning soccer team. Wanna come?\u003c/p\u003e\n\u003cp\u003eWe cant, I said.\u003c/p\u003e\n\u003cp\u003eHave you ever seen a soccer game? Becky asked naively.\u003c/p\u003e\n\u003cp\u003eYes Sebastian replied.\u003c/p\u003e\n\u003cp\u003eWell, you havent seen Matt play.\u003c/p\u003e\n\u003cp\u003eTrue, he said, but Im not sure thats a good idea. Were supposed to meet Alexander in an hour.\u003c/p\u003e\n\u003cp\u003eEven Sebastian tried to put off my best friend.\u003c/p\u003e\n\u003cp\u003eDont be a stick-in-the-mud. I can bring you back here in time.\u003c/p\u003e\n\u003cp\u003eYou know how I feel about soccer, I said, trying to be diplomatic. And especially going to school when I dont have to.\u003c/p\u003e\n\u003cp\u003eOh, it will be fun. There arent any tombstones, but youre sure to see a killer match.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eBefore I knew it, Becky was playfully leading Sebastian toward her truck. He looked to me for help. He was struggling with her touching him, and he was doing his best not to make eye contact with her.\u003c/p\u003e\n\u003cp\u003eShe opened the passenger door and Sebastian reluctantly began to get in.\u003c/p\u003e\n\u003cp\u003eNoIll sit in the middle, I insisted, squeezing in before Sebastian had the chance to sit down.\u003c/p\u003e\n\u003cp\u003eI didnt want Sebastian to be too close to Becky. Hed tasted her blood. That meant Sebastian felt even more of a draw to Becky than he had originally. I could see him wrestling with his inner vampire.\u003c/p\u003e\n\u003cp\u003eSebastian stared out the window. Becky did her best to engage him in conversation, and he did his best to be polite but remain uninterested.\u003c/p\u003e\n\u003cp\u003eDont leave me alone with her, Sebastian pleaded as he and I sat on the bleachers. Becky was at the refreshment stand while we held a seat for her. Alexander will kill me if he finds out Im seeing her again. You know I didnt plan this.\u003c/p\u003e\n\u003cp\u003eI knowneither did I. We could both get in trouble.\u003c/p\u003e\n\u003cp\u003eBecky returned with some chips and a container holding three drinks. She handed the tray to me, and as I reached for it, she sat down in between us. Sebastian scooted away.\u003c/p\u003e\n\u003cp\u003eHe took out his cell phone and began texting.\u003c/p\u003e\n\u003cp\u003eWant some chips? she asked him.\u003c/p\u003e\n\u003cp\u003eHe fiercely shook his head.\u003c/p\u003e\n\u003cp\u003eWho are you texting?\u003c/p\u003e\n\u003cp\u003eJust some girls, he said.\u003c/p\u003e\n\u003cp\u003eBecky dismissed him and took her drink and chips.\u003c/p\u003e\n\u003cp\u003eThere was a time-out in the game.\u003c/p\u003e\n\u003cp\u003eI received a text again from an unavailable number.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI know where you are\u003c/p\u003e\n\u003cp\u003eWhos texting you? Becky asked. Im here, and Im the only one who you text.\u003c/p\u003e\n\u003cp\u003eIm not sure. I think they have the wrong number.\u003c/p\u003e\n\u003cp\u003eThe soccer snobs returned to the field.\u003c/p\u003e\n\u003cp\u003eHow long is this going to be? Sebastian asked with an obnoxiously audible yawn.\u003c/p\u003e\n\u003cp\u003eWhats wrong with him? Becky whispered to me. Hes acting very strangely.\u003c/p\u003e\n\u003cp\u003eIm not sure.\u003c/p\u003e\n\u003cp\u003eJust then Trevor scored a goal and the fans erupted in cheers. Sebastian rose to see what was going on.\u003c/p\u003e\n\u003cp\u003eWere winning, she said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eSebastian and Becky locked gazes. They both sat down, and he put away his phone.\u003c/p\u003e\n\u003cp\u003eBefore long, Sebastian had lowered his guard. He was into the game, rooting for Matt, and glowing at Becky.\u003c/p\u003e\n\u003cp\u003eHe took out his cell phone and began snapping pictures of the action. Then he focused it on Becky, who began to get caught up in Sebastians enthusiasm. She posed while I sat as inert as a tombstone.\u003c/p\u003e\n\u003cp\u003eCmon, Rave she said, placing her arm around me.\u003c/p\u003e\n\u003cp\u003eYes, Raven, Id like some of you, too, Sebastian suggested.\u003c/p\u003e\n\u003cp\u003eI couldnt even muster a fake smile.\u003c/p\u003e\n\u003cp\u003eNow let me take one of you, Becky said, retrieving her phone.\u003c/p\u003e\n\u003cp\u003eNoI hate being photographed. Sebastian shielded his face with the drink tray.\u003c/p\u003e\n\u003cp\u003eWeird. Alexander does, too, Becky said. Must be something in the water in Romania.\u003c/p\u003e\n\u003cp\u003eMust be, I said.\u003c/p\u003e\n\u003cp\u003eThen how am I going to remember you when you leave? she asked, snatching the tray from him.\u003c/p\u003e\n\u003cp\u003eSebastian froze. His soft, lovelorn eyes melted even more. Beckys comments had pierced his already aching heart.\u003c/p\u003e\n\u003cp\u003eAll right, he said.\u003c/p\u003e\n\u003cp\u003eHe gazed into the camera intently. He smiled adoringly at Becky. She snapped her camera and the flash went off. He winced as if hed been struck by a soccer ball.\u003c/p\u003e\n\u003cp\u003eAre you all right? she asked.\u003c/p\u003e\n\u003cp\u003eI got something in my eye, he said, recovering his composure.\u003c/p\u003e\n\u003cp\u003eShe tucked her phone into her purse and turned her attention back to the game, unaware that she had unwittingly broken his heart. She could never possess his image and he could never possess her love.\u003c/p\u003e\n\u003cp\u003eBecky waved wildly to Matt just as the buzzer went off.\u003c/p\u003e\n\u003cp\u003eFinal quarter, she said.\u003c/p\u003e\n\u003cp\u003eWe have to meet Alexander, I said. We need to go.\u003c/p\u003e\n\u003cp\u003eOff in the distance, a shadowy figure emerged over the horizon and began strolling down the grassy hill toward us.\u003c/p\u003e\n\u003cp\u003eEven from a distance, his presence was intense. A figure like no other. My own breath escaped me and I felt a magnetic and magical connection. For a moment, words eluded me.\u003c/p\u003e\n\u003cp\u003eHandsome, charismatic, and truly alluring. Alexander Sterling, the perfect vampire. \u003c/p\u003e","sourceLink":"https://allnovel.net/love-bites-vampire-kisses-7/page-12.html","bookId":1871,"creation":"Oct 5, 2019 4:46:54 PM","modification":"Oct 5, 2019 4:46:54 PM"}
