{"id":82774,"no":14,"title":"Page 14","content":"\u003cp\u003eI wasnt the only one who read the article on Alexander. In a town the size of Dullsville, small as a Shrinky Dink, any news was news. No one wanted to be left out from any new information or, worse, be the last one to know.\u003c/p\u003e\n\u003cp\u003eA group of cheerleaders was stretching out in the hallway while I waited for Becky outside the restroom. I was exhausted as usual.\u003c/p\u003e\n\u003cp\u003eDid you see the picture of that Mansion guy? the captain asked.\u003c/p\u003e\n\u003cp\u003eHes totally hot, her assistant said, fixing her headband.\u003c/p\u003e\n\u003cp\u003eHes really funny, another said.\u003c/p\u003e\n\u003cp\u003eDid you see how he was ribbing the reporter? He must be really confident to do that.\u003c/p\u003e\n\u003cp\u003eAnd talented. My parents bought one of his pictures at the Art Auction a few months ago, the captain boasted.\u003c/p\u003e\n\u003cp\u003eHot, talented, and funny.\u003c/p\u003e\n\u003cp\u003eHow did she ever land him? her assistant said.\u003c/p\u003e\n\u003cp\u003eThey all glared at me. Just then I received a text.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eFunny article.\u003c/p\u003e\n\u003cp\u003ePicture of a vampire?\u003c/p\u003e\n\u003cp\u003eImpossible.\u003c/p\u003e\n\u003cp\u003eIt was pitch-black when I went to Beckys house to meet her. Her parents werent home and her house was unlocked. I called her name throughout each room, but she didnt answer. I knew she was afraid to go to the barn alone, but perhaps she needed to replace the rake. I found the flashlight resting on the back-porch railing.\u003c/p\u003e\n\u003cp\u003eBecky? Where are you?\u003c/p\u003e\n\u003cp\u003eWhen I finally reached the barn, the metal door was ajar.\u003c/p\u003e\n\u003cp\u003eBecky? Are you in there?\u003c/p\u003e\n\u003cp\u003eI heard some whispering voices and a giggle.\u003c/p\u003e\n\u003cp\u003eBecky? Is that you? Are you okay?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI shined the light on a few bales of hay. On an empty ladder. Then the tractor. It caught Becky, who quickly covered her face.\u003c/p\u003e\n\u003cp\u003eBecky, what are you doing in here? You hate the dark.\u003c/p\u003e\n\u003cp\u003eHer hair was messy and she bore a menacing smirk on her face. I helped her up when I noticed two fresh wounds on her neck.\u003c/p\u003e\n\u003cp\u003eNo! What has Sebastian done to you?\u003c/p\u003e\n\u003cp\u003eWhat are you and Alexander waiting for?\u003c/p\u003e\n\u003cp\u003eNoBecky! What about Matt?\u003c/p\u003e\n\u003cp\u003eHes not a vampire!\u003c/p\u003e\n\u003cp\u003eJust then I heard a beeping sound. I awoke to find Mrs. Hathaway and a classroom full of students staring at me.\u003c/p\u003e\n\u003cp\u003eMiss Madison, she said with a stern voice. Is that a cell phone I heard?\u003c/p\u003e\n\u003cp\u003eNoit was my alarm clock.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe class laughed.\u003c/p\u003e\n\u003cp\u003eI have the authority to confiscate anything that is electronic, other than a calculatorwhich, I might add, you dont need in history class.\u003c/p\u003e\n\u003cp\u003eMrs. Hathaway returned to her lesson, and I quickly checked my message.\u003c/p\u003e\n\u003cp\u003eLets make history together.\u003c/p\u003e\n\u003cp\u003eI glanced up and saw Trevor peering back at me.\u003c/p\u003e\n\u003cp\u003eI shook off my dream, and Mrs. Hathaway stepped out of class.\u003c/p\u003e\n\u003cp\u003eWhat are you doing this weekend, Becky asked, besides sleeping?\u003c/p\u003e\n\u003cp\u003eAlexanders party was fast approaching. I didnt have much time to decorate. I only had one day to gather some gothic and groovy items. Id been so distracted with keeping Sebastian away from Becky that I hadnt had much time to be excited about Onyx and Scarlets arrival or figure out something to wear.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eUhnot sure, I finally answered.\u003c/p\u003e\n\u003cp\u003eWhy dont we all get together?\u003c/p\u003e\n\u003cp\u003eI think Alexander has plans, I said truthfully.\u003c/p\u003e\n\u003cp\u003eDoing what?\u003c/p\u003e\n\u003cp\u003eIm not sure. I just think I heard him say he was doing something. Nothing bigjust hanging in.\u003c/p\u003e\n\u003cp\u003eWe can stay in, toounless you dont want us over.\u003c/p\u003e\n\u003cp\u003eOhits not that. I just hate for you to cancel something dreamy like a movie night when all we are doing is hanging out playing video games.\u003c/p\u003e\n\u003cp\u003eMatt loves gaming. Besides, hes never been inside the Mansion. And I havent either, for that matter. We were only outside for Alexanders Welcome to the Neighborhood party.\u003c/p\u003e\n\u003cp\u003eHow about I get back to you?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI waited for Beckys response.\u003c/p\u003e\n\u003cp\u003eOkay. Text me when you know, she finally said.\u003c/p\u003e\n\u003cp\u003eI felt awful keeping Becky in the dark about Alexanders party. She was my best friendI included her in everything. For that matter, she was the only one Id ever included. If it wasnt for Becky, Id have been totally alone all of my life. This was the thanks she gotbeing excluded from an intimate gathering hosted at the Mansion. But I had to remind myself of the reason I was having the party in the first placeto keep her safe and mortal.\u003c/p\u003e\n\u003cp\u003eI was really shaken by my dream. Imagining Becky as a vampireand how much she enjoyed itjolted me. I liked my best friend just the way she was.\u003c/p\u003e\n\u003cp\u003eBut the dream felt so real. The fact that my best friend became a vampire before I became one haunted me. I was struckby jealousy. No one in this town wanted to be a vampire more than I did. Not Becky, or a Pradabee, or an unsuspecting soccer snob. If anyone was going to be bitten in this town, it was going to be me.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWhen the final bell rang, marking my freedom from the doldrums of Dullsville High, I met Becky at our lockers. Do you mind dropping me off at Annies Antiques? I asked.\u003c/p\u003e\n\u003cp\u003eIll go, too, she said as she loaded her books in her backpack and I unloaded mine into my locker. I have nothing to do this afternoon.\u003c/p\u003e\n\u003cp\u003eI was planning on buying goodies for the party. How could I do that in front of her?\u003c/p\u003e\n\u003cp\u003eAre you sure? I asked. You know how I can dawdle forever. I dont want you to miss doing your homework.\u003c/p\u003e\n\u003cp\u003eIve already finished it during study hall, she said proudly.\u003c/p\u003e\n\u003cp\u003eThen why are you taking home all your books?\u003c/p\u003e\n\u003cp\u003eThe real question is why didnt you take any of yours?\u003c/p\u003e\n\u003cp\u003eBecky was as good a student as she was a friend.\u003c/p\u003e\n\u003cp\u003eI have things on my mind, I said. I planned on doing my homework in the morning.\u003c/p\u003e\n\u003cp\u003eShe shook her head, as my mother had done a thousand times.\u003c/p\u003e\n\u003cp\u003eWe exited the building, got into her truck, and drove the few miles to Annies.\u003c/p\u003e\n\u003cp\u003eAnnies Antiques was one of my favorite haunts. A Victorian-style home was turned into an antiques store, each room filled with knickknacks, furniture, and artwork.\u003c/p\u003e\n\u003cp\u003eAnnie greeted me with a warm hello. She was one of the few store owners who didnt judge me by the way I was dressed, assuming I was going to vandalize or shoplift. The antiques store was also one of the few stops in Dullsville where I regularly bought merchandise.\u003c/p\u003e\n\u003cp\u003eShe wore an oversized leopard-print shirt with a black faux-fur collar and black rayon pants. Two golden retrievers roamed throughout the rooms and slept by Annies stool. What are you looking for today? she asked.\u003c/p\u003e\n\u003cp\u003eNothing in particular. Just browsing.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI got some new things in that might interest you, she said, pointing to a nearby doorway.\u003c/p\u003e\n\u003cp\u003eI strode across the Victorian homes hardwood floors, which were weathered by all the foot traffic and furniture being moved in and out. On a small table covered with black lace fabric were items from Halloweens past.\u003c/p\u003e\n\u003cp\u003eCoveting all the goodies, I gathered as many things as I could hold, as if at any moment there could be a swarm of competitive shoppers.\u003c/p\u003e\n\u003cp\u003eYou could use a shopping cart, Becky said, helping me place the various decorations on the counter.\u003c/p\u003e\n\u003cp\u003eLook at these! Becky presented me with three fake tombstones. You can put them in your room.\u003c/p\u003e\n\u003cp\u003eAbsolutely!\u003c/p\u003e\n\u003cp\u003eI found a box of skeleton lights perfect for hanging by the gazebo.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIm not sure that all the bulbs work, Annie confessed when I brought them to my already rising pile of merchandise.\u003c/p\u003e\n\u003cp\u003eIt doesnt matter, I said, unfazed. They are a must-have.\u003c/p\u003e\n\u003cp\u003eI found some lace place mats, dragon-headed candlesticks, and a ceramic raven.\u003c/p\u003e\n\u003cp\u003eAre you having a party? Annie asked. You could decorate a mansion with all this stuff.\u003c/p\u003e\n\u003cp\u003eBecky gave me a skeptical stare. Yes, what are you going to do with all these things?\u003c/p\u003e\n\u003cp\u003eI handed Annie all the money I had in my wallet. Saving them for a rainy day, I guess.\u003c/p\u003e\n\u003cp\u003eIt might not rain for a while, Annie said. I hope you are able to enjoy them before then.\u003c/p\u003e\n\u003cp\u003eI will.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eBecky gave me a quizzical look as she helped carry the bags and load them into her truck.\u003c/p\u003e\n\u003cp\u003eNeed help taking them into your room? she asked when we arrived at my house.\u003c/p\u003e\n\u003cp\u003eThats okay, I said. I really should do my homework, after all.\u003c/p\u003e\n\u003cp\u003eThats all I needed to say to let Becky know something was up.\u003c/p\u003e\n\u003cp\u003eTheres something youre not telling me, she said.\u003c/p\u003e\n\u003cp\u003eYou know I tell you everythingor at least everything I can share that I dont mind Matt knowing, I said, giving her a friendly dig.\u003c/p\u003e\n\u003cp\u003eFair enough, she said. But Ill find out from you one way or another.\u003c/p\u003e\n\u003cp\u003eWith that, Becky drove off. As I set down my goods on the driveway and unlocked my front door, I still felt a twinge of guilt. Becky had just helped me decorate a party I wasnt even inviting her to attend.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eDusk settled over Dullsville as I anxiously awaited Alexanders arrival at the cemetery.\u003c/p\u003e\n\u003cp\u003eWe were going to share a private moment together before discussing our final plans for the party.\u003c/p\u003e\n\u003cp\u003eIt was unusually late. I realized we might have planned to meet at the Mansion. I had finally decided to head back to the entrance when I got a text. Again, it was from an unavailable number.\u003c/p\u003e\n\u003cp\u003eIm watching you\u003c/p\u003e\n\u003cp\u003eI was sick of Trevor bothering me, and his game was about to end. I pressed the redial button, prepared to chew him out.\u003c/p\u003e\n\u003cp\u003eI heard a ringing coming from behind me but saw no one. I rose and followed the ringing until I made my way up toward the Sterling monument.\u003c/p\u003e\n\u003cp\u003eOut from the darkness emerged Alexander, a cell phone ringing in his hand.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eMy heart stopped. It couldnt be. Alexander had a cell phoneand had been texting me?\u003c/p\u003e\n\u003cp\u003eIt goes against everything you believe in.\u003c/p\u003e\n\u003cp\u003eHe smiled a broad smile.\u003c/p\u003e\n\u003cp\u003eIt was youall along? I asked, still shocked.\u003c/p\u003e\n\u003cp\u003eHe continued to beam.\u003c/p\u003e\n\u003cp\u003eBut you sent me messages during the day, I said, when you were sleeping in your coffin.\u003c/p\u003e\n\u003cp\u003eYoure not the only one who gets insomnia.\u003c/p\u003e\n\u003cp\u003eThe image of Alexander lying in his coffin, thinking of me and texting, melted me.\u003c/p\u003e\n\u003cp\u003eBut what made you do this?\u003c/p\u003e\n\u003cp\u003eIve always wanted to sit next to you in class. Buy your lunch.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWatch you study. You should have all the things a normal girl gets from her boyfriend. And by going out with me\u003c/p\u003e\n\u003cp\u003eIm not normal, though, no matter who I go out with, I said with a laugh. At least these Dullsvillians dont think so.\u003c/p\u003e\n\u003cp\u003eHe put his arm around me. You arent normal to me, either. You are extraordinary.\u003c/p\u003e\n\u003cp\u003eI wrapped my arms around him.\u003c/p\u003e\n\u003cp\u003eYou should have all the good things coming to you, he continued. All the gifts. I dont want you to ever doubt how much I care for you.\u003c/p\u003e\n\u003cp\u003eI took his free hand in mine. But this isnt your thing. Technology. Modern conveniences.\u003c/p\u003e\n\u003cp\u003eIts not about whats my thing, he said with a smile. Its about yours.\u003c/p\u003e\n\u003cp\u003eI hugged Alexander with all my might.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eBut I dont want you to change.\u003c/p\u003e\n\u003cp\u003eIts not about changingits about growing, together, he said, like the wise soul that he was. I wanted to let you knowthat I am with you. Always. Forever. We dont have to be separated by the sun, school, or even the night. Now Im just a click away.\u003c/p\u003e\n\u003cp\u003eI was deeply moved by Alexanders present to me and rewarded my vampire boyfriend with mortal kisses. \u003c/p\u003e","sourceLink":"https://allnovel.net/love-bites-vampire-kisses-7/page-14.html","bookId":1871,"creation":"Oct 5, 2019 4:46:54 PM","modification":"Oct 5, 2019 4:46:54 PM"}
