{"id":82775,"no":15,"title":"Page 15","content":"\u003cp\u003eI spent the following day alone, toiling around in the Mansions backyard while Alexander and Sebastian slept in their respective tombs. No one would be able to help me set up for the party. Thats what I got for wanting to date a vampire.\u003c/p\u003e\n\u003cp\u003eI hung the skeleton lights from the wrought-iron fence and put place mats on a coffin-lid table. I lined the crumbling walkway with votives and floor-length candelabras. The fake tombstones poked out from the dead grass. Sebastian had hooked up his sound system in the gazebo, and I decorated it with plastic bats and blinking skulls.\u003c/p\u003e\n\u003cp\u003eBy the time Alexander and Sebastian awoke, I was beat. The pair was wide-eyed and freshly groomed when they found me crashed out on a sofa in the parlor room.\u003c/p\u003e\n\u003cp\u003eAlexander gently petted my hair and awakened me from my catnap.\u003c/p\u003e\n\u003cp\u003eThe best sight in the world was Alexander. Even blurry, he was smoldering. His deep, dark hair melted over his ears, and his smile was heavenly.\u003c/p\u003e\n\u003cp\u003eYouve really outdone yourself, he said. The backyard looks great!\u003c/p\u003e\n\u003cp\u003eWhat time is it? I perked up in a hurry.\u003c/p\u003e\n\u003cp\u003eThey should be here soon, he said.\u003c/p\u003e\n\u003cp\u003eIm not even dressed! I exclaimed. And I feel like I just got out of gym class.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI leaped up from the sofa and dashed to the upstairs bathroom.\u003c/p\u003e\n\u003cp\u003eI only had twenty minutes to clean up. I washed, dried, primped, powdered. It was something I was used to, as I normally overslept and had to get ready for school in record time.\u003c/p\u003e\n\u003cp\u003eAlso, I was extra speedy because I was anxious for our party to begin, eager to see Onyx and Scarlet, and for Sebastian to fall in love with one of them so my relationship with Becky would return to normal.\u003c/p\u003e\n\u003cp\u003eWhen I finished my fifteen-minute makeover, I descended the outside backstairs as if I were a contestant in a beauty pageant. Only, instead of stilettos, hose, and a white ball gown, I was in rubber lace-up boots, fishnets, and a black slip dress. I spun around in my outfit.\u003c/p\u003e\n\u003cp\u003eBoyyou look hot! Alexander said. He was setting up the fire pit.\u003c/p\u003e\n\u003cp\u003eMake that double hot! Sebastian concurred.\u003c/p\u003e\n\u003cp\u003eSebastian was tinkering with the sound system, making sure his favorite hits were loaded onto his iPod. The three of us talked for a while, but our monsterfest wasnt going as planned. There was no sign of Onyx and Scarlet.\u003c/p\u003e\n\u003cp\u003eAlexander stoked the fire. Sebastian fixed some of the skeleton lights, and I adjusted my suffocating boots.\u003c/p\u003e\n\u003cp\u003eIts been nightfall for over an hour, I finally commented, glancing at my watch. Where are they?\u003c/p\u003e\n\u003cp\u003eMaybe they got lost, Alexander said. Did you give them directions?\u003c/p\u003e\n\u003cp\u003eSeveral times.\u003c/p\u003e\n\u003cp\u003eThen I bet something else came up, Sebastian lamented.\u003c/p\u003e\n\u003cp\u003eI know these girls, I said defiantly. If they said theyd be here\u003c/p\u003e\n\u003cp\u003eIts okay, Raven, Sebastian said. Its really the nicest thing anyone has ever done for me. But we dont have to wait all night. Besides, this is as good a time as any to tell you that Ill be leaving tomorrow.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWhat? I asked.\u003c/p\u003e\n\u003cp\u003eEven Alexander was surprised by his comment. We were having a blast.\u003c/p\u003e\n\u003cp\u003eI knowbut Ive worn out my welcome here.\u003c/p\u003e\n\u003cp\u003eNo, you havent, I told him. Id gotten used to Sebastians presence, and I knew it was good for Alexander to have the company.\u003c/p\u003e\n\u003cp\u003eWhy dont we go inside, he suggested. We can have a little band session to take it off my mind. I think youre on your way to being a lead singer.\u003c/p\u003e\n\u003cp\u003eWe cant give up on our party yet, I tried.\u003c/p\u003e\n\u003cp\u003eEven Alexander was getting a bit fidgety. We havent eaten yet and Im feeling hungry. Well have Jameson make us some drinks.\u003c/p\u003e\n\u003cp\u003eBut you have a bottle out here, I told them.\u003c/p\u003e\n\u003cp\u003eWell save it for something special, Alexander said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eFine. My first party, and it was a disaster.\u003c/p\u003e\n\u003cp\u003eThey headed inside. I remained at the table and sulked for a few moments until I heard a car in the distance. I took off around the side of the grassy Mansion lawn, doing my best to avoid uneven patches of soil. When I reached the driveway, I saw two headlights shining on the street. The streetlamp illuminated a car. When I got closer I noticed a bright white Beetle, the headlights highlighted with black paint, the hood with a dark circle, and vertical white stripes adorning the bumper. It looked like a giant human skull.\u003c/p\u003e\n\u003cp\u003eTheyre here! I exclaimed. Theyre here.\u003c/p\u003e\n\u003cp\u003eI raced down the long driveway as if I were competing for a gold medal.\u003c/p\u003e\n\u003cp\u003eWhen I reached the Mansions gate, exiting the cryptic car were two amazingly stellar party girlsScarlet and Onyx.\u003c/p\u003e\n\u003cp\u003eScarlet wore her curly red hair long with a black bow; she had on a cream-colored velvet dress, black lace gloves, and stilettos.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eOnyx, with her jet black, blade-straight hair, wore a corset top, knee-length skirt, ripped stockings, and wicked witchy boots.\u003c/p\u003e\n\u003cp\u003eWe all screamed like children, and they engulfed me in a tight embrace.\u003c/p\u003e\n\u003cp\u003eWe thought wed never see you again, Scarlet said.\u003c/p\u003e\n\u003cp\u003eI thought so, too, I said.\u003c/p\u003e\n\u003cp\u003eWhen we saw your message, we knew we had to come, Onyx said. No matter what.\u003c/p\u003e\n\u003cp\u003eI love your car! I proclaimed. I could only dream of driving that up to my house in the burbs. I thought I was lucky to have a black bike.\u003c/p\u003e\n\u003cp\u003eI just got it. Isnt it ghoulish? Scarlet grinned.\u003c/p\u003e\n\u003cp\u003eThe two girls linked arms with me and we ascended the steep and winding drive. It was as if we were miniature dolls in comparison to the stately Mansion that loomed above us.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIs this where you live? Onyx asked, aghast.\u003c/p\u003e\n\u003cp\u003eNo, my boyfriend does, I replied.\u003c/p\u003e\n\u003cp\u003eAre his parents out for the weekend? Scarlet wondered, assessing the situation.\u003c/p\u003e\n\u003cp\u003eWellfor a while longer, I said. They live in Romania.\u003c/p\u003e\n\u003cp\u003eHe lives here by himself? Onyx asked. How lonely.\u003c/p\u003e\n\u003cp\u003eHe has a butler.\u003c/p\u003e\n\u003cp\u003eYou go, girl! Scarlet said.\u003c/p\u003e\n\u003cp\u003eHe must be a millionaire, Onyx stated.\u003c/p\u003e\n\u003cp\u003eAlmost, I said.\u003c/p\u003e\n\u003cp\u003eIs hea V? Onyx asked.\u003c/p\u003e\n\u003cp\u003eA what? I wondered aloud.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eA Coffin Club member, Scarlet whispered. You knowone of us\u003c/p\u003e\n\u003cp\u003eOha V. I nodded proudly. And more important, so is his friend.\u003c/p\u003e\n\u003cp\u003eHe has a friend? Scarlet hinted.\u003c/p\u003e\n\u003cp\u003eYes, and hes single and very hot, I replied.\u003c/p\u003e\n\u003cp\u003eLove it! the two girls shrieked.\u003c/p\u003e\n\u003cp\u003eWe never see that Phoenix guy anymore, Scarlet said. We thought maybe youd have hooked up with him.\u003c/p\u003e\n\u003cp\u003eReally? I asked. WellI havent either. But I think youll like Alexander, too.\u003c/p\u003e\n\u003cp\u003eJudging from that Mansion? I like him already, Scarlet declared.\u003c/p\u003e\n\u003cp\u003eAlexander didnt realize that the girls had arrived. The backyard was empty of male vampires. I was slightly miffed at the pair for giving up so easily.\u003c/p\u003e\n\u003cp\u003eWhere is everyone? Scarlet said.\u003c/p\u003e\n\u003cp\u003eThey went inside.\u003c/p\u003e\n\u003cp\u003eI felt awful. Should I leave my guests alone? Or take them inside? I had never hosted a party before and wasnt sure of the etiquette. I knew my mother would know exactly what to do, so I did my best impression of her.\u003c/p\u003e\n\u003cp\u003eWhy dont you two wait here while I get you something to drink, I asked.\u003c/p\u003e\n\u003cp\u003eNostay with us, Onyx said, grasping my wrist. We traveled all this way to see you, so were not letting you out of our sight.\u003c/p\u003e\n\u003cp\u003eYes, Scarlet said. This way we can have some girl time.\u003c/p\u003e\n\u003cp\u003eI wanted the girls to feel the full effects of our haunting happening, but without Alexander and Sebastian it wasnt happening at all.\u003c/p\u003e\n\u003cp\u003eMaybe Alexander would get worried and come find me.\u003c/p\u003e\n\u003cp\u003eWe sat at the tomb-shaped table. A Romanian bottle was chilling on ice, and the twinkling candelabra was still dripping hot wax.\u003c/p\u003e\n\u003cp\u003eSo hows the Coffin Club? I asked. I miss it.\u003c/p\u003e\n\u003cp\u003eIts the best, Onyx said.\u003c/p\u003e\n\u003cp\u003eThere isnt anywhere weve found thats like it, Scarlet added. And since Phoenix usurped Jaggers authority and made the club about us and not him, its been running smoothly. But we havent seen Phoenix at all. Its quite odd.\u003c/p\u003e\n\u003cp\u003eWe thought you might have seen him, Onyx began, since you got on so well with him.\u003c/p\u003e\n\u003cp\u003eI havent seen anybody.\u003c/p\u003e\n\u003cp\u003eNot even Jagger? Onyx asked.\u003c/p\u003e\n\u003cp\u003eNoand for that Im grateful.\u003c/p\u003e\n\u003cp\u003eReally? I think hes kind of hot, Onyx confessed.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eScarlet and I were surprised by her admission of admiration for the alluring, but menacing, vampire.\u003c/p\u003e\n\u003cp\u003eI mean in a lonely sort of way, Onyx continued. I think he might just be misunderstood.\u003c/p\u003e\n\u003cp\u003eSo, Scarlet said. Youre dating a vampire. Then youll become a vampire, too! Scarlet was beside herself with glee.\u003c/p\u003e\n\u003cp\u003eUhwere waiting for the right time, I answered.\u003c/p\u003e\n\u003cp\u003eBut dont you want to be like us? Scarlet asked.\u003c/p\u003e\n\u003cp\u003eOf course, I replied. Its been my lifes dream.\u003c/p\u003e\n\u003cp\u003eThen what are you waiting for\u003c/p\u003e\n\u003cp\u003eIts a big decision, Onyx defended. I dont know that Id turn someone. It is a lot of responsibility.\u003c/p\u003e\n\u003cp\u003eI would! Scarlet said. Its in our blood.\u003c/p\u003e\n\u003cp\u003eTo change someones life forever? Onxy proposed. We were born into this. We didnt have a choice. And for Raven, it would be changing everything about her life as she knows it. It is something that should be thought through really carefully. Not so casual or in the moment, Onyx argued, reassuring me. Its okay, Raven, to take your time.\u003c/p\u003e\n\u003cp\u003eThere is nothing wrong with being a vampire, Scarlet said.\u003c/p\u003e\n\u003cp\u003eI didnt say there was, Onyx retorted. But would you want to be mortalif you found your true love?\u003c/p\u003e\n\u003cp\u003eScarlet thought for a moment. I guess youre right. It is a big decision.\u003c/p\u003e\n\u003cp\u003eI smiled in agreement. It was hardthese two girls took for granted a lifestyle I wanted so badly. They werent becoming vampires because of someone they loved or something they wanted to bethey were vampires because they were born vampires.\u003c/p\u003e\n\u003cp\u003eIt was then I remembered why Id invited them.\u003c/p\u003e\n\u003cp\u003eSpeaking of true love, I began. Ive got a really great guy I want you to meet.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eYes, tell us about Alexanders friend, Onxy said.\u003c/p\u003e\n\u003cp\u003eHes really hot, I repeated. And hes looking for someone special.\u003c/p\u003e\n\u003cp\u003eWere special, Scarlet said.\u003c/p\u003e\n\u003cp\u003eExactly! That was what I was thinking. I scooted close. He was enamored with my best friend, I confided. Only, shes mortal and has a boyfriend. And I dont want anyone in this town being bitten before me, I joked.\u003c/p\u003e\n\u003cp\u003eYes, that wouldnt be fair, Onyx said.\u003c/p\u003e\n\u003cp\u003eId die if some cheerleader showed up to a game with fangs, I told them.\u003c/p\u003e\n\u003cp\u003eThat would be wrong on so many levels! Scarlet snorted.\u003c/p\u003e\n\u003cp\u003eShe wouldnt be deserving, Onyx said. Not like you.\u003c/p\u003e\n\u003cp\u003eSo I thought it would be wonderful if he could meet a nice vampire girl, I went on. And Dullsville is short on those.\u003c/p\u003e\n\u003cp\u003eSo where is this Prince Charming? Scarlet asked.\u003c/p\u003e\n\u003cp\u003eThe faint sound of a guitar wailing screeched from the Mansion.\u003c/p\u003e\n\u003cp\u003eIs that your boyfriend playing? Scarlet asked tentatively.\u003c/p\u003e\n\u003cp\u003eNothats his friend.\u003c/p\u003e\n\u003cp\u003eI hope he kisses better than he plays, she teased.\u003c/p\u003e\n\u003cp\u003eThe three of us laughed.\u003c/p\u003e\n\u003cp\u003eA figure was standing by the window. I knew Alexander would eventually wonder where Id gone.\u003c/p\u003e\n\u003cp\u003eWithin a moment, Alexander and Sebastian were hanging out on the back steps.\u003c/p\u003e\n\u003cp\u003eBoth girls mouths dropped when they saw the handsome pair.\u003c/p\u003e\n\u003cp\u003eWhich is the available one? Onyx asked softly.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI dont carethey are both gorgeous, Scarlet declared. Ravenyou dont mind sharing, do you? she teased.\u003c/p\u003e\n\u003cp\u003eOnyx and Scarlet, this is my boyfriend, Alexander.\u003c/p\u003e\n\u003cp\u003eWowyou are so lucky! Scarlet whispered to me. We should have been hanging out here instead of at the Coffin Club.\u003c/p\u003e\n\u003cp\u003eAlexander blushed and shook both of their hands.\u003c/p\u003e\n\u003cp\u003eSebastian cleared his throat. He was frustrated he wasnt getting any attention.\u003c/p\u003e\n\u003cp\u003eAnd this is Sebastian, I said. As if on cue, both girls held their hands out to him. He took each one and tenderly kissed them. Each girl giggled.\u003c/p\u003e\n\u003cp\u003eI hope thats just a prelude of whats to come, Scarlet said.\u003c/p\u003e\n\u003cp\u003eThe girls broke their gaze with Sebastian and he gave Alexander the thumbs-up sign.\u003c/p\u003e\n\u003cp\u003eWould you like something to drink? I asked.\u003c/p\u003e\n\u003cp\u003eUh. Sure. I guess Ill have a soda.\u003c/p\u003e\n\u003cp\u003eNo, we have the real thing, Sebastian said, pointing to the bottle on the table.\u003c/p\u003e\n\u003cp\u003eTransylvania 1972, Alexander said as Jameson came outside to assist us.\u003c/p\u003e\n\u003cp\u003eI heard that was a good year, Sebastian said.\u003c/p\u003e\n\u003cp\u003eWhy dont you sit here, I encouraged Sebastian, deliberately placing him between the two girls.\u003c/p\u003e\n\u003cp\u003eAlexander stuck a corkscrew in the bottle and turned it slowly. He pried the cork and it easily slipped out.\u003c/p\u003e\n\u003cp\u003eJameson began filling the goblets.\u003c/p\u003e\n\u003cp\u003eIts rare to find something authenticoutside the Coffin Club, Scarlet said. In a bottle, anyway.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWe all laughed.\u003c/p\u003e\n\u003cp\u003eWell, you are in rare company, Sebastian flirted.\u003c/p\u003e\n\u003cp\u003eAs Jameson continued to fill the goblets, Alexander poured me a soda and then himself one.\u003c/p\u003e\n\u003cp\u003eYou can have some, I said. Dont miss this on account of me.\u003c/p\u003e\n\u003cp\u003eBut Alexander politely refused.\u003c/p\u003e\n\u003cp\u003eSebastian held the goblet to his nose and took a deep breath in.\u003c/p\u003e\n\u003cp\u003eUmperfect, Sebastian said. I think its a mixture of A positive and AB negative.\u003c/p\u003e\n\u003cp\u003eWowyou are quite the connoisseur, Onyx praised. I can never tell.\u003c/p\u003e\n\u003cp\u003eHeres to us. Sebastian raised his glass and we all clinked ours together.\u003c/p\u003e\n\u003cp\u003eI watched as the three vampires put the blood-filled goblets to their lips and sipped as if they were consuming a rare vintage wine.\u003c/p\u003e\n\u003cp\u003eThis is delicious, Scarlet said. Very smooth.\u003c/p\u003e\n\u003cp\u003eWe are just happy you joined us, Alexander said. We know you came a long way.\u003c/p\u003e\n\u003cp\u003eIt was worth it, Scarlet said.\u003c/p\u003e\n\u003cp\u003eVery smooth, Onyx added. Yet sweet. Just like you, she said, her eyes locking with Sebastians. Surprised by her remark, she began to giggle and spilled a bit of her drink.\u003c/p\u003e\n\u003cp\u003eI had to remind myself that some Romanians hemoglobin, not fermented grapes, had just dripped on my friend.\u003c/p\u003e\n\u003cp\u003eShe cant hold her blood, Scarlet playfully scolded. I tell her that all the time.\u003c/p\u003e\n\u003cp\u003eI guess I drank it too fast, Onyx said.\u003c/p\u003e\n\u003cp\u003eRed liquid dripped down her neck and began leaking toward the lace border of her neckline.\u003c/p\u003e\n\u003cp\u003eHere, let me, Sebastian said, wiping the spillage with his napkin.\u003c/p\u003e\n\u003cp\u003eThere was a moment between Onyx and Sebastian. He was doting on her as he had Becky. Our plan was already working. I gave Alexander a quick wink.\u003c/p\u003e\n\u003cp\u003eScarlet sensed competition. And though the two girls were best friends, it was obvious Scarlet didnt want to be the one without a vampire. She leaned her elbow onto Sebastians shoulder, her bracelets dangling next to his goatee.\u003c/p\u003e\n\u003cp\u003eShe tapped her fingers against his brown and blond dreadlocks as if they were batting eyelashes, then brushed her plum-colored fingernails along his neck.\u003c/p\u003e\n\u003cp\u003eNo recent marks, she noted.\u003c/p\u003e\n\u003cp\u003eInteresting, Onyx said, almost scorned.\u003c/p\u003e\n\u003cp\u003eAnd you? Sebastian asked Scarlet.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIt isnt polite to ask a girl, is it? she asked coquettishly.\u003c/p\u003e\n\u003cp\u003eWell, I just thought.\u003c/p\u003e\n\u003cp\u003eScarlet displayed her wrist. Two purple marks were embedded on her slight, chalk white arm.\u003c/p\u003e\n\u003cp\u003eBut it didnt really mean anything, she confessed. He wasnt nearly as handsome as you.\u003c/p\u003e\n\u003cp\u003eOr as clever, Onyx added.\u003c/p\u003e\n\u003cp\u003eThe girls were intoxicated by Sebastians charm, and he was relishing the attention.\u003c/p\u003e\n\u003cp\u003eI figured this was mine and Alexanders cue to leave the three single vampires alone.\u003c/p\u003e\n\u003cp\u003eAlexander, I think we left a few snacks in the house, I said.\u003c/p\u003e\n\u003cp\u003eOh yeah, my boyfriend agreed, taking my hint. Ill help you.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eBut before we could rise, Scarlet stopped us. Where is everyone else?\u003c/p\u003e\n\u003cp\u003eOhtheyll be coming later, Sebastian said.\u003c/p\u003e\n\u003cp\u003eYeah. We just wanted it to be us for a little while, I added.\u003c/p\u003e\n\u003cp\u003eThen sit down and enjoy yourselves, Scarlet insisted.\u003c/p\u003e\n\u003cp\u003eAlexander and I returned to our seats. I guess the girls expected a Mansion-size party. I couldnt break the news to them that they were the guest list.\u003c/p\u003e\n\u003cp\u003eHow about we crank up the tunes, Sebastian suggested.\u003c/p\u003e\n\u003cp\u003eYes, we love to dance, Scarlet said.\u003c/p\u003e\n\u003cp\u003eSebastian turned up the music and the five of us rocked as hard as we could.\u003c/p\u003e\n\u003cp\u003eIt looks like youre having a great time, I said to Sebastian as I danced next to him.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI am.\u003c/p\u003e\n\u003cp\u003eDo you think youd like to ask one of them out?\u003c/p\u003e\n\u003cp\u003eI guess. But Sebastians voice wasnt confident. Even though he was having a blast, I sensed Sebastian was still carrying a torch for Becky.\u003c/p\u003e\n\u003cp\u003eThe musics volume suddenly lowered. We stopped to discover Jameson standing by the sound system.\u003c/p\u003e\n\u003cp\u003eComplaints from the neighbors? Alexander asked, concerned.\u003c/p\u003e\n\u003cp\u003eAlexander, Jameson announced, you have some guests.\u003c/p\u003e\n\u003cp\u003eGuests? I asked.\u003c/p\u003e\n\u003cp\u003eAlexander was just as confused.\u003c/p\u003e\n\u003cp\u003eIll only be a moment, he said, excusing himself.\u003c/p\u003e\n\u003cp\u003eI guess theyre here, Scarlet said. Well chat later.\u003c/p\u003e\n\u003cp\u003eI was curious what guests were arriving. Since Onyx, Scarlet, and Sebastian were engaged in conversation, I, too, excused myself.\u003c/p\u003e\n\u003cp\u003eI sped through the kitchen, down the long, haunting hallway, and found Alexander at the front door. I couldnt tell whom he was talking to, so I sneaked up close and peered out.\u003c/p\u003e\n\u003cp\u003eI spotted Beckys truck in the driveway.\u003c/p\u003e\n\u003cp\u003eWhat was she doing here? Was she in trouble?\u003c/p\u003e\n\u003cp\u003eIt was then I noticed Trevors Camaro parked behind the truck.\u003c/p\u003e\n\u003cp\u003eI wedged myself between the entranceway and Alexander to find Matt fuming at the foot of the stoop.\u003c/p\u003e\n\u003cp\u003eWhats going on? I asked. Are you all right?\u003c/p\u003e\n\u003cp\u003eMatt, normally upbeat and smiling, was brandishing a frown. Behind him was Trevor and a team of soccer snobs.\u003c/p\u003e\n\u003cp\u003eWhat are they doing here? I asked Alexander.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eMatt glared at me coldly.\u003c/p\u003e\n\u003cp\u003eIts okay, Alexander said to me.\u003c/p\u003e\n\u003cp\u003eWheres Becky? I asked. Is she all right?\u003c/p\u003e\n\u003cp\u003eI thought you were my friend, Alexander, Matt said sternly.\u003c/p\u003e\n\u003cp\u003eAlexander didnt move. I am, he said calmly. Whats this all about, Matt?\u003c/p\u003e\n\u003cp\u003eYour houseguest.\u003c/p\u003e\n\u003cp\u003eHes out back.\u003c/p\u003e\n\u003cp\u003eWell, he better stay there.\u003c/p\u003e\n\u003cp\u003eIs something wrong? Alexander asked.\u003c/p\u003e\n\u003cp\u003eYou bet. Your best friend has been hitting on my girlfriend, Matt challenged.\u003c/p\u003e\n\u003cp\u003eAlexander shook his head. His best friend had gotten him into a mess. Thats just Sebastians way. He didnt mean any harm.\u003c/p\u003e\n\u003cp\u003eDid you know that after Sebastian met Becky at Hatsys he texted her all night? Matt asked.\u003c/p\u003e\n\u003cp\u003eNot at the time. Im not with him every minute.\u003c/p\u003e\n\u003cp\u003eSebastian sent the flowers to Becky. Not Raven. Did you know that?\u003c/p\u003e\n\u003cp\u003eNoor I would have stopped him.\u003c/p\u003e\n\u003cp\u003eBut you did find out.\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eSo were you going to tell me?\u003c/p\u003e\n\u003cp\u003eThere wasnt a need to. We had it resolved.\u003c/p\u003e\n\u003cp\u003eReally? Did you know he had the nerve to show up at her house?\u003c/p\u003e\n\u003cp\u003eHe did? Alexander said. I thought he bumped into her in town.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAnd all the time you both were laughing and encouraging him, Matt said, annoyed.\u003c/p\u003e\n\u003cp\u003eNow, take it easy. I never laughed, and I most certainly didnt encourage him. It was just the opposite.\u003c/p\u003e\n\u003cp\u003eNow I was mad. It was one thing to accuse me, and now Sebastian, of causing trouble, but quite another to accuse Alexander. You have it wrong, Matt. Alexander\u003c/p\u003e\n\u003cp\u003eIts okay, Raven, Alexander said, trying to calm me down. I understand you might be mad, Matt. But its not as bad as it sounds.\u003c/p\u003e\n\u003cp\u003eAnd to think I included him at Hooligans.\u003c/p\u003e\n\u003cp\u003eYou are misunderstanding what happened.\u003c/p\u003e\n\u003cp\u003eAm I?\u003c/p\u003e\n\u003cp\u003eMatt stepped forward.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI was ready to pounce on anyone who charged at Alexanderthough he was quite capable of defending himself.\u003c/p\u003e\n\u003cp\u003eAlexander held out his arm. Its okay.\u003c/p\u003e\n\u003cp\u003eNow youre having a party, Matt said. Then he fixed on me. And Ravenyou dont invite your best friend?\u003c/p\u003e\n\u003cp\u003eTrevor stood behind Matt, arms folded, smiling gleefully.\u003c/p\u003e\n\u003cp\u003eWhats he doing here? I charged. I thought you werent his shadow anymore.\u003c/p\u003e\n\u003cp\u003eHes the one who told me, Matt said. Seems Trevor is a good friend after all.\u003c/p\u003e\n\u003cp\u003eThe soccer snobs surrounded Alexander. I rushed in, but Alexander held me at bay.\u003c/p\u003e\n\u003cp\u003eI dont think you know who you are dealing with here, I said to the gang of athletes.\u003c/p\u003e\n\u003cp\u003eAlexander appeared concerned for Matts situation, but he wasnt worried about the threat from the others. He was confident in his own power, and I knew he wouldnt use it unless it was to defend me.\u003c/p\u003e\n\u003cp\u003eIs Becky with Sebastian? Alexander asked.\u003c/p\u003e\n\u003cp\u003eNoshes with me, Matt said.\u003c/p\u003e\n\u003cp\u003eThen isnt that your answer? Alexander assured Matt. After all the texts, the flowers, and the visits, shes still with you.\u003c/p\u003e\n\u003cp\u003eMatts anger changed to relief. He even broke a smile.\u003c/p\u003e\n\u003cp\u003eSebastian suddenly appeared beside us. Whats going on?\u003c/p\u003e\n\u003cp\u003eWhen he saw Matt, he knew he must have found out about his feelings for Becky.\u003c/p\u003e\n\u003cp\u003eIm the one you have a beef with, Sebastian said. This isnt about Alexander.\u003c/p\u003e\n\u003cp\u003eI know that now, Matt said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eLets talk calmly, Sebastian urged.\u003c/p\u003e\n\u003cp\u003eI know how you feel about Beckybut Im the one who loves her, Matt suddenly proclaimed.\u003c/p\u003e\n\u003cp\u003eBecky hopped out of the truck. She raced to Matt and clutched him around the waist. Hed declared his love for her in front of everyone. She gazed up at me with an almost thankful smile.\u003c/p\u003e\n\u003cp\u003eI was surprised by Matts sudden passion and proud that he was standing up for Becky. However, I didnt want this conflict to continue.\u003c/p\u003e\n\u003cp\u003eAnd just so you know, Sebastian defended, Alexander ordered me to leave the Mansion.\u003c/p\u003e\n\u003cp\u003eHe did? Matt asked.\u003c/p\u003e\n\u003cp\u003eBut I was the one who wanted to stay in town. Raven and Alexander went out of their way to arrange a party for meto find my own Becky. So they really are better friends to you than you might think.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eMatt was speechless.\u003c/p\u003e\n\u003cp\u003eYeahso you might have Becky, Sebastian began, but I have Raven and Alexander.\u003c/p\u003e\n\u003cp\u003eMatt was stunned. I feel awful, he said.\u003c/p\u003e\n\u003cp\u003eI do, too, Becky added.\u003c/p\u003e\n\u003cp\u003eMatt glared at Trevor. You started this, didnt you? Just like always.\u003c/p\u003e\n\u003cp\u003eBut Trevors attention was on a few cars that had pulled up to the Mansions gate.\u003c/p\u003e\n\u003cp\u003eWithin a few minutes, vehicles began to line the street.\u003c/p\u003e\n\u003cp\u003eStudents came up the driveway and the lawn, decked out in their Saturday-night best and carrying bags of beverages.\u003c/p\u003e\n\u003cp\u003eWhats going on? I asked.\u003c/p\u003e\n\u003cp\u003eYou know how news travels in this town, Trevor said. Everyone likes a party. Not just you guys.\u003c/p\u003e\n\u003cp\u003eWheres the coffin guy? a Pradabee asked.\u003c/p\u003e\n\u003cp\u003eIs that him? another asked, pointing to Alexander. Hes gorgeous!\u003c/p\u003e\n\u003cp\u003eI wonder if he has a dungeon, the Pradabee commented. Or a secret room. I wouldnt mind if he locked me up in one. The pair laughed and followed the others to the backyard.\u003c/p\u003e\n\u003cp\u003eWhat are we going to do? I asked frantically. Call the police?\u003c/p\u003e\n\u003cp\u003eNoits fine. Alexander beamed.\u003c/p\u003e\n\u003cp\u003eAlexander surveyed his uninvited guests and their festive mood.\u003c/p\u003e\n\u003cp\u003eWell, we dont have enough drinks, I said. I mean, the non-Romanian kind.\u003c/p\u003e\n\u003cp\u003eDoesnt seem to matter. Looks like they are bringing their own, Alexander commented.\u003c/p\u003e\n\u003cp\u003eSebastian lit up. Now, this is a real party. This is what were missing by being homeschooled. Look at these girls. Theyre all hot!\u003c/p\u003e\n\u003cp\u003eWe arrived in the backyard to a full-fledged happening. The backyard began to fill up with every teen in town.\u003c/p\u003e\n\u003cp\u003eHeres some liquor, a soccer snob said, holding the unfinished Transylvania 1972.\u003c/p\u003e\n\u003cp\u003eHe lifted it to his lips and leaned back to take a huge swig.\u003c/p\u003e\n\u003cp\u003eNo I yanked it out of his hands. Thats an import! I chastised. I grabbed the goblets and carried them into the house like a seasoned waitress.\u003c/p\u003e\n\u003cp\u003eAs I exited, I met an anxious Jameson in the doorway, examining the expanding party.\u003c/p\u003e\n\u003cp\u003eMiss Raven, what has happened?\u003c/p\u003e\n\u003cp\u003eWe had a few party crashers.\u003c/p\u003e\n\u003cp\u003eA few? More like a hundred. I must go to the basement. I know we have more stock.\u003c/p\u003e\n\u003cp\u003eNot the cellar, Jameson, I said. Its not that kind of party.\u003c/p\u003e\n\u003cp\u003eOf course, I meant in the downstairs pantry. Jameson fretted. Oh, I wish I had time to prepare!\u003c/p\u003e\n\u003cp\u003eId watched plenty of movies. Couples using pieces of furniture and empty bedrooms for makeout sessions while others used the furniture as coasters. I didnt want the Mansion trashed and, more important, Alexanders and Sebastians identity revealed. Dont let anyone in the house, I told Jameson before he started off. If they find Sebastians bed\u003c/p\u003e\n\u003cp\u003eI understand, Miss Raven.\u003c/p\u003e\n\u003cp\u003eJust then two girls came up to the door.\u003c/p\u003e\n\u003cp\u003eWhich way to the bathroom? one asked.\u003c/p\u003e\n\u003cp\u003eThat way, I said, pointing to the street. There is one at the gas station. Or, better yet, I bet theres a golden-seated one at your home.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe girls glowered at me and returned to their boyfriends.\u003c/p\u003e\n\u003cp\u003eIll stand watch as soon as I get back, he said nervously. Jameson wasnt the only one upset. I returned to find my partylike my lifeout of control.\u003c/p\u003e\n\u003cp\u003eCouples were mashing. Some were hanging out by the fire pit. Others were dancing.\u003c/p\u003e\n\u003cp\u003eI spotted Onyx and Scarlet hovering on either side of Trevor. The girls were fawning over his beefy physique.\u003c/p\u003e\n\u003cp\u003eWhere was Sebastian? The girls were supposed to be drooling over him. But none of the vampires seemed interested in the others at this point.\u003c/p\u003e\n\u003cp\u003eI stormed through the crowd and toward the girls. Scarlet pretended to arm-wrestle with Trevor and then turned his wrist to examine it.\u003c/p\u003e\n\u003cp\u003eI saw Scarlets fang catch the light of the fire pit. Onyxs onyx tattooed fang sparkled when she grinned.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eTrevor was in heaven. But if Onyx and Scarlet had their way, he might be somewhere else.\u003c/p\u003e\n\u003cp\u003eScarlet lifted his wrist to her mouth.\u003c/p\u003e\n\u003cp\u003eScarlet! I called. Onyx.\u003c/p\u003e\n\u003cp\u003eNot so fast, Trevor warned, holding Onyx by the waist. They are doing just fine. You arent the only one interested in threesomes.\u003c/p\u003e\n\u003cp\u003eFirst of all, Im not. And second of all, this isnt that kind of party.\u003c/p\u003e\n\u003cp\u003eIs jealousy the only emotion you feel? Trevor charged. Even in front of Monster Boy? he said. But it appears hes already busy, he said, gesturing to a few girls who were talking to Alexander. But dont worry. You can join in with us. I wont tell.\u003c/p\u003e\n\u003cp\u003eI wasnt pleased that my schoolmates were fawning over my boyfriend, but I had more urgent matters to attend to.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eSave it for school.\u003c/p\u003e\n\u003cp\u003eI wrangled the girls away from Trevor and whispered in Onyxs ear. Hes not a V.\u003c/p\u003e\n\u003cp\u003eNot a V? He had overheard me. What does that mean? Virgin?\u003c/p\u003e\n\u003cp\u003eOh, really? Onyx said softly.\u003c/p\u003e\n\u003cp\u003eThey were shocked.\u003c/p\u003e\n\u003cp\u003eFunny, we both sensed he was, Scarlet whispered. Its not the first time weve made a mistake, she said, alluding to me.\u003c/p\u003e\n\u003cp\u003eRemember why I invited you guysfor Sebastian, I urged.\u003c/p\u003e\n\u003cp\u003eBut Scarlet wasnt walking away. She was charmed by Trevor and continued to hold on to his hand.\u003c/p\u003e\n\u003cp\u003eYou can have Sebastian, she said in a low voice to Onyx.\u003c/p\u003e\n\u003cp\u003eShe cant like Trevor, I said. Thats not an option. Remember what we discussed, I warned through gritted teeth. No one gets Dont worry, Raven. Shes just having fun, Onyx said, stopping me. And I plan to do the same. Onyx flipped back her jet black locks and disappeared into the crowd.\u003c/p\u003e\n\u003cp\u003eThis party was getting out of hand. Vampires mixing with unsuspecting mortals. I had to make sure no one was bittenespecially Trevor Mitchell.\u003c/p\u003e\n\u003cp\u003eI looked to Alexander and Sebastian for help. Sebastian was now talking to the girls who were interested in Alexander, and Alexander was entranced by his rocking party.\u003c/p\u003e\n\u003cp\u003eI turned to go back to Trevor and I bumped into Becky.\u003c/p\u003e\n\u003cp\u003eIm so sorry, Raven, she said. Can you forgive me?\u003c/p\u003e\n\u003cp\u003eUh, yesbut I have something else I have to deal with right now.\u003c/p\u003e\n\u003cp\u003ePleaselisten, Becky pleaded. Youre the one who always talks about being in trouble, but Im the one who keeps getting you there. You are my best friend. Now and alwaysand I dont want anything to get in the way of that.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI hated not telling you about the party, I said. I did feel like a sneak. But I had to protect you.\u003c/p\u003e\n\u003cp\u003eI totally understand. You and Alexander are so kind to Sebastianand to me. And look what weve done. We brought Trevor and the entire school to the Mansion. Becky sat on a bench lined with plastic skeletons. Im so ashamed.\u003c/p\u003e\n\u003cp\u003eIts okay, Becky. I gave her a hug. Alexanders having the time of his life. Babes dancing in his backyard. Jocks hanging out. Its an image I never imagined. Its a blessing, really. Hes so isolated being homeschooled, and now hes more popular than Trevor.\u003c/p\u003e\n\u003cp\u003eBecky managed a small grimace. You dont hate me?\u003c/p\u003e\n\u003cp\u003eOf course I dont hate you. Youd have to do a lot worse than bringing Trevor to the Mansion for me to not like you. But speaking of TrevorI have a major issue to address. Can you help me?\u003c/p\u003e\n\u003cp\u003eOf course.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eJust as I began pushing past the crowd to separate an embracing Trevor and Scarlet, all heads turned toward the back stairs.\u003c/p\u003e\n\u003cp\u003eI saw a sight I thought Id never see. I was completely unprepared.\u003c/p\u003e\n\u003cp\u003eDescending down the Mansions back stairs as if a soft halo of light were around her was a gothic fairy girl with candy-pink-colored hair perfectly woven into two braids and wrapped in Wednesday Addamsstyle black bows, wearing an offbeat Alice in Wonderland dress with black-and-white tights and pink combat boots.\u003c/p\u003e\n\u003cp\u003eShe was as beautiful as she was cute, as fragile as she was confident. Her frame was that of a whimsical angel with the wings of a devil. And everyone at the party was spellbound.\u003c/p\u003e\n\u003cp\u003eIt was Luna Maxwell.\u003c/p\u003e\n\u003cp\u003eI hated how beautiful she was. She had perfectly porcelain skin, and her glossy pink lips sparkled like tiny stars. Her presence lit up the crowd. She drew everyones attention like a starlet.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThe crowd was hypnotized. Sebastian was mesmerized. For a moment, even Alexander was transfixed.\u003c/p\u003e\n\u003cp\u003eAnd looming right behind her was her twin brotherJagger, Alexanders former nemesissporting familiar bleached-white hair with bloodred ends, a freakishly frightening Joker T-shirt, and red Doc Martens.\u003c/p\u003e\n\u003cp\u003eOur party had officially spun out of this world.\u003c/p\u003e\n\u003cp\u003eHow was I going to hold all these vampires at bay from mixing with the mortal students of Dullsville? How were we going to keep their Underworldly identity a secret? And if their cover was blown, how was I going to keep Alexander from having to leave Dullsville?\u003c/p\u003e\n\u003cp\u003eMy blood boiled and my flesh flushed. I felt dizzy and queasy. The voices and music became muddled, and everyone suddenly seemed very far away.\u003c/p\u003e\n\u003cp\u003eI was sure I was falling.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eThen the world went black. \u003c/p\u003e","sourceLink":"https://allnovel.net/love-bites-vampire-kisses-7/page-15.html","bookId":1871,"creation":"Oct 5, 2019 4:46:54 PM","modification":"Oct 5, 2019 4:46:54 PM"}
