{"id":82776,"no":16,"title":"Page 16","content":"\u003cp\u003eI opened my eyes to find myself lying flat on the grass. Alexander was kneeling beside me. A large circle of familiar facesBecky, Matt, Onyx, Sebastian, Scarlet, Trevor, Jagger, and Lunawere staring down at me. The stars shimmered and a full moon hovered above them.\u003c/p\u003e\n\u003cp\u003eIt had to be a dream.\u003c/p\u003e\n\u003cp\u003eI closed my eyes again.\u003c/p\u003e\n\u003cp\u003eLets give her some air, I heard a girls voice say.\u003c/p\u003e\n\u003cp\u003eDid you drink too much? another asked.\u003c/p\u003e\n\u003cp\u003eDid she take something?\u003c/p\u003e\n\u003cp\u003eDid she OD? someone else said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eMy mouth was dry. I couldnt form a word in my defense.\u003c/p\u003e\n\u003cp\u003eIll take her to a doctor, Alexander said, alarmed.\u003c/p\u003e\n\u003cp\u003eHere, drink this, Becky said, handing me a soda. Alexander helped me sit up, and I gulped down the bubbly liquid as if I hadnt drunk for days.\u003c/p\u003e\n\u003cp\u003eScarlet held a bag of ice on my head.\u003c/p\u003e\n\u003cp\u003eDid you eat something odd? Becky asked like a ponytailed Florence Nightingale.\u003c/p\u003e\n\u003cp\u003eNoI havent eaten anything, I replied, weakened.\u003c/p\u003e\n\u003cp\u003eThe crowd of well-wishers stopped fussing.\u003c/p\u003e\n\u003cp\u003eWhat? Alexander asked. You havent eaten?\u003c/p\u003e\n\u003cp\u003eI didnt have time. I was decorating for the party all day.\u003c/p\u003e\n\u003cp\u003eNot even breakfast? Scarlet asked.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eThen no wonder you fainted, Becky said.\u003c/p\u003e\n\u003cp\u003eAlexander signaled to Sebastian, who took off for the Mansion.\u003c/p\u003e\n\u003cp\u003eMy boyfriend swept me up in his arms and carried me to the table. He gently let me down in a wrought-iron chair and held my hand while I drank my soda. A few moments later, Jameson pushed a small cart through the crowd of partygoers. The scent of marinated steak was intoxicating to the mortals and euphoric to the vampires.\u003c/p\u003e\n\u003cp\u003eA thick, juicy steak was placed before me. All the vampires, including Alexander, almost salivated.\u003c/p\u003e\n\u003cp\u003eIll do that, Scarlet said as I began to cut into the bloody steak.\u003c/p\u003e\n\u003cp\u003eIts for Raven, Alexander said gently.\u003c/p\u003e\n\u003cp\u003eThe vampires watched with envy as I tore into my meal. As I wolfed down the steak and began to regain my strength, Alexander began to address the next issue we had on our handsbloodsucking party crashers.\u003c/p\u003e\n\u003cp\u003eThe candelabras lit Jaggers menacing ice-green-and-blue eyes. His sister stood behind him, basking in the glow of stares from the male partyers.\u003c/p\u003e\n\u003cp\u003eI dont remember inviting Alexander said.\u003c/p\u003e\n\u003cp\u003eSome girls have looser lips than others, Jagger said.\u003c/p\u003e\n\u003cp\u003eOnyx appeared ashamed.\u003c/p\u003e\n\u003cp\u003ePerhaps its time we mingle, Scarlet said. She led Onyx into the crowd.\u003c/p\u003e\n\u003cp\u003eWe didnt think youd mind, Jagger said to Alexander. Now that we are friends.\u003c/p\u003e\n\u003cp\u003eAlexander was skeptical. Though their feud had ended when Alexander returned Jaggers weakened brother, Valentine, to him, Alexander wasnt expecting his longtime nemesis to instantly replace Sebastian.\u003c/p\u003e\n\u003cp\u003eFriends? Alexander said.\u003c/p\u003e\n\u003cp\u003eYes, Jagger said. One can never have too many, right?\u003c/p\u003e\n\u003cp\u003eI suppose you are right, but\u003c/p\u003e\n\u003cp\u003eThere really is safety in numbers, Jagger urged. Besides, we have so much in common: Romania, vampires, and Raven.\u003c/p\u003e\n\u003cp\u003eRaven? Alexander asked suspiciously.\u003c/p\u003e\n\u003cp\u003eI saw a lot of her recently, Jagger proclaimed, referring to my attendance at the Coffin Club. She fit right in.\u003c/p\u003e\n\u003cp\u003eI heard, Alexander said.\u003c/p\u003e\n\u003cp\u003eNo one knew she was any different. Did she tell you?\u003c/p\u003e\n\u003cp\u003eShe didnt have to.\u003c/p\u003e\n\u003cp\u003eI was hoping to see her there again, Jagger continued. It seemed she got on as well as any of the members there.\u003c/p\u003e\n\u003cp\u003eShe is planning on being here, Alexander said.\u003c/p\u003e\n\u003cp\u003eI was hoping youd come back, Jagger said to me. But since you didnt, this way weve come to you.\u003c/p\u003e\n\u003cp\u003eHow sweet, I retorted.\u003c/p\u003e\n\u003cp\u003eI think well be fast friends, Alexander, Jagger said. Its something Ive always wanted. There is so much we can learn from each other. Jagger gestured to the party. There is safety in numbers. We could use more members and, with your help, perhaps start a club here.\u003c/p\u003e\n\u003cp\u003eOut of the question! Alexander said.\u003c/p\u003e\n\u003cp\u003eNothing you have to decide now, my friend, Jagger said calmly. But imagineIf all these mortals were just like us, then think of what could bewhat we could do. A town in which you dont have to hide out in a Mansion, all alone.\u003c/p\u003e\n\u003cp\u003eI think its time you leave, Alexander demanded.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eBut we just got here, Jagger said. Youre right. Im getting ahead of myself. Im just a visionary, thats all. Nothing you need to commit to this minute. Besides, Jagger continued, we came to party. And Luna was very eager to see Raven.\u003c/p\u003e\n\u003cp\u003eSo how have you been, Raven? she asked, ¨¹ber-polite. Besides lying flat on your back, she whispered in my ear.\u003c/p\u003e\n\u003cp\u003eLuna was still bitter toward me for fooling her into believing I was a vampire. And even more so because Alexander had jilted her at the covenant ceremony back in Romania and he had found happiness with me.\u003c/p\u003e\n\u003cp\u003eHowever, seeing Luna standing here today, glowing like an angel, I couldnt imagine him ever leaving her.\u003c/p\u003e\n\u003cp\u003eAlexander, Luna said in a soft, sexy voice. Its great to see you. She showed off her dress for him. A group of jocks ogled her as she twirled around. Its amazing how much a person can change in just a short time, isnt it? Im sorry for you that things in your life have remained the same.\u003c/p\u003e\n\u003cp\u003eAlexander wasnt pleased with her taunting.\u003c/p\u003e\n\u003cp\u003eYes, doesnt my sister look great? Jagger said. This lifestyle suits her. Shes been dying for it since she was born.\u003c/p\u003e\n\u003cp\u003eIm glad you are so happy, Alexander said. Thats all I ever wanted for you. He turned back to the party.\u003c/p\u003e\n\u003cp\u003eLuna took Alexanders comment as a slap in the face instead of a heartfelt sentiment. She couldnt mask her scorn and turned her venom on me.\u003c/p\u003e\n\u003cp\u003eI see youve managed to fool some other girls, too, she said, referring to Onyx and Scarlet.\u003c/p\u003e\n\u003cp\u003eThey like me for who I am, I said.\u003c/p\u003e\n\u003cp\u003eBut do you like yourself as you are? Or, at the end of the day, do you really wish you were more like me?\u003c/p\u003e\n\u003cp\u003eLuna was right. She had the one thing I didnt haveshe was a vampire.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI have everything youve always wanted, she bragged.\u003c/p\u003e\n\u003cp\u003eExcept Alexander, I snapped back.\u003c/p\u003e\n\u003cp\u003eWell, when you can be here for an eternity, everything is possible. I just need time.\u003c/p\u003e\n\u003cp\u003eI wasnt happy with her insinuation.\u003c/p\u003e\n\u003cp\u003eWhen he sees my potential. Perhaps what he is missing from a relationship with youWho knows what he might do?\u003c/p\u003e\n\u003cp\u003eWith that, she and Jagger joined the other partygoers.\u003c/p\u003e\n\u003cp\u003eAlexander, I said, getting his attention, Luna isnt over you. She still cant be trusted.\u003c/p\u003e\n\u003cp\u003eHer bark is worse than her bite.\u003c/p\u003e\n\u003cp\u003eIm serious. Shes still in love with\u003c/p\u003e\n\u003cp\u003eHey, Sebastian said, suddenly by our side. This party is killer!\u003c/p\u003e\n\u003cp\u003eYou think so? I asked.\u003c/p\u003e\n\u003cp\u003eIts not what I planned. Im even amazed. Alexander beamed.\u003c/p\u003e\n\u003cp\u003eThis mansion is going to be party central, said Sebastian. The girls think you are a rock star, and I dont mind taking your leftovers.\u003c/p\u003e\n\u003cp\u003eI glared at Sebastian.\u003c/p\u003e\n\u003cp\u003eI mean, taking them off your hands so you can be alone with Raven.\u003c/p\u003e\n\u003cp\u003eA band of jocks bumped into the tomb-shaped table, knocking it over. Alexander rushed to help steady it.\u003c/p\u003e\n\u003cp\u003eThere is no reason you need to be cruising this crowd, I told Sebastian. There are two perfect and single girlsthat were just meant for you, I said as the ultimate matchmaker. Onyx or Scarlet.\u003c/p\u003e\n\u003cp\u003eI know, Raven. They are beautiful, but there arent any sparks.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWhat do you mean? You just met them. And now you are totally ignoring them. You need to spend more time with them.\u003c/p\u003e\n\u003cp\u003eIts just something I feelor rather dont feel. And by the way it looks, they dont seem to be bothered.\u003c/p\u003e\n\u003cp\u003eTrevor was talking to Jagger, and Onyx and Scarlet were by their sides.\u003c/p\u003e\n\u003cp\u003eWell, maybe Im not meant to be in love, he said. Maybe Im supposed to just have fun. And is that so bad?\u003c/p\u003e\n\u003cp\u003eI was a major failure at matchmaking.\u003c/p\u003e\n\u003cp\u003eThis was not supposed to happen! I said. None of this was supposed to happen!\u003c/p\u003e\n\u003cp\u003eI ditched Sebastian and was heading toward Alexander when Becky jumped in front of me.\u003c/p\u003e\n\u003cp\u003eWhere have you been? she asked.\u003c/p\u003e\n\u003cp\u003eThis night has gone all wrong, I said frantically.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eNo it hasnt. Look! Everyone is enjoying themselves. You might be having the best party Dullsvilles ever seen.\u003c/p\u003e\n\u003cp\u003eSebastian was supposed to like Scarlet or Onyx and he doesnt like either, I rambled, and to top it off, Scarlet seems to be struck by Trevorgag meand Onyx is smitten by Jagger.\u003c/p\u003e\n\u003cp\u003eIts nice that they came to town for your party.\u003c/p\u003e\n\u003cp\u003eJagger and Luna werent invited. Remember? You werent even invited.\u003c/p\u003e\n\u003cp\u003eBecky laughed. Raven, youve brought the whole town togethereven a neighboring one.\u003c/p\u003e\n\u003cp\u003eBut I didnt want to. Even Jameson is freaking out. He was standing guard outside the kitchen door. I have to do something. I know I took out my phone. Ill call the police. A noise complaint and a few squad cars are enough to drive everyone back to their sprawling estates.\u003c/p\u003e\n\u003cp\u003eBecky stopped me. Raventhen Alexanders party will be a bomb. Look at him. Alexander was joking with the group of jocks as they replaced the items on the table. He was as content and happy as hed been when he was out with Sebastian and me. Wouldnt you rather the party be a hit than have your boyfriend stuck in his attic room forever alone?\u003c/p\u003e\n\u003cp\u003eI weighed my friends thoughts heavily.\u003c/p\u003e\n\u003cp\u003eThen what should I do? I finally asked.\u003c/p\u003e\n\u003cp\u003eHow about have some funlike everyone else? Why should you be the only one moping?\u003c/p\u003e\n\u003cp\u003eBecky didnt understand the severity of the situation. And it wasnt something I could delicately break to her over the sounds of pounding music. However, it was Alexanders mansion, and if Alexander was having a blast, then it wasnt my place to break up the party.\u003c/p\u003e\n\u003cp\u003eAlexander was now hanging out by the fire pit with Matt, Sebastian, and several soccer snobs. I was approaching him when I overheard a few cheerleaders talking to him.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAre you the painter in the article? one asked.\u003c/p\u003e\n\u003cp\u003eUhyes.\u003c/p\u003e\n\u003cp\u003eI like to model, another told him.\u003c/p\u003e\n\u003cp\u003eDo you do nude portraits? the first one asked.\u003c/p\u003e\n\u003cp\u003eThe girls all laughed.\u003c/p\u003e\n\u003cp\u003eI was steaming! My blood began to boil and my whole body raged.\u003c/p\u003e\n\u003cp\u003eThere is only one model I use, Alexander said. And her name is\u003c/p\u003e\n\u003cp\u003eRaven, they said in unison.\u003c/p\u003e\n\u003cp\u003eYes, he said.\u003c/p\u003e\n\u003cp\u003eA warm feeling flooded me.\u003c/p\u003e\n\u003cp\u003ePerhaps you should get to know her, he said. Shes a great girl.\u003c/p\u003e\n\u003cp\u003eThe girls all turned their noses at him and walked away. I snuck up behind my boyfriend and gave him a huge embrace.\u003c/p\u003e\n\u003cp\u003eThere you are, he said. I was just talking about you.\u003c/p\u003e\n\u003cp\u003eYou have groupies, I said. Sebastian was right.\u003c/p\u003e\n\u003cp\u003eNo I dont, he said humbly.\u003c/p\u003e\n\u003cp\u003eHe drew me close and kissed me by the open flames.\u003c/p\u003e\n\u003cp\u003eI never dreamed wed have a hit on our hands, I said.\u003c/p\u003e\n\u003cp\u003eI never did, either, he said.\u003c/p\u003e\n\u003cp\u003eJagger and Onyx and Luna joined us by the fire pit.\u003c/p\u003e\n\u003cp\u003eJagger Maxwell, Sebastian said, a drink in his hand. Its been a while since Ive seen you. This is the last place Id imagine bumping into you.\u003c/p\u003e\n\u003cp\u003eJagger moved in close, out of earshot of the soccer snobs and Matt.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAlexander and I have to make up for lost time. I thought now was as good a time as any to begin our new friendship.\u003c/p\u003e\n\u003cp\u003eAlexander is really picky about who he hangs out with, Sebastian said protectively.\u003c/p\u003e\n\u003cp\u003eIm sure he is.\u003c/p\u003e\n\u003cp\u003eRumor is you havent returned to Romania, Sebastian said.\u003c/p\u003e\n\u003cp\u003eI started a club a few towns over. Ive been talking to Alexander about possibly starting one here.\u003c/p\u003e\n\u003cp\u003eThis town could really use a club, Sebastian said.\u003c/p\u003e\n\u003cp\u003eJaggers blue-and-green eyes lit up. Then you might be the one to help me.\u003c/p\u003e\n\u003cp\u003eI love clubs. And youre rightthis town could be a perfect place to open one.\u003c/p\u003e\n\u003cp\u003eYou dont know what hes really talking about, Alexander warned.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003ePerhaps we can go into business together, Jagger said to Sebastian.\u003c/p\u003e\n\u003cp\u003eMaybe\u003c/p\u003e\n\u003cp\u003eLuna yawned and appeared bored.\u003c/p\u003e\n\u003cp\u003eLuna, Jagger said, seizing the opportunity. I want you to meet Alexanders best friend.\u003c/p\u003e\n\u003cp\u003eAlexanders best friend? she asked, perking up. I dont believe weve met.\u003c/p\u003e\n\u003cp\u003eNo, I think Id remember, Sebastian said, tonguetied.\u003c/p\u003e\n\u003cp\u003eShe grew up on a different time schedule than we did. But now we are all finally the same, Jagger said. Luna, Sebastian might be interested in starting a Coffin Club here.\u003c/p\u003e\n\u003cp\u003eNo hes not, Alexander said. He doesnt know what you are talking about.\u003c/p\u003e\n\u003cp\u003eSebastian was lost in Lunas spell, even though she was somewhat intimidating.\u003c/p\u003e\n\u003cp\u003eAny friend of Alexanders is a friend of mine, right, Alexander? Luna flirted.\u003c/p\u003e\n\u003cp\u003eLets hope so, Sebastian said.\u003c/p\u003e\n\u003cp\u003eSuddenly this party doesnt seem so insipid after all, she commented.\u003c/p\u003e\n\u003cp\u003eI tried to block Sebastian from Luna. I think Jameson needs our help in the kitchen.\u003c/p\u003e\n\u003cp\u003eJameson can find someone else, Luna said, gazing at Sebastian. Its a party, the night is young, and Im out for blood. Would you like to dance, Sebastian? Luna asked.\u003c/p\u003e\n\u003cp\u003eAre you kidding? Sebastian looked as if he would have breathed in garlic if Luna had asked him.\u003c/p\u003e\n\u003cp\u003eSo tell me what it was like growing up with Alexander, Luna said, leading him to the dance floor.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eJagger smiled a mischievous smile. Onyx, would you like to dance?\u003c/p\u003e\n\u003cp\u003eOnyx acted as if shed just been struck by Cupids bow. Of course, she said, and followed Jagger.\u003c/p\u003e\n\u003cp\u003eAlexanderwhat do we do?\u003c/p\u003e\n\u003cp\u003eHow about we dance, too?\u003c/p\u003e\n\u003cp\u003eWhen we arrived on the dance floor, Alexander and I kept a watchful eye on the others. But after a few songs, we got distracted by our own connection.\u003c/p\u003e\n\u003cp\u003eThis was the reason to have a party, Alexander said, kissing me. For us.\u003c/p\u003e\n\u003cp\u003eI was so lost in his eyes. Id gotten so sidetracked that I wasnt allowing myself to enjoy the very thing Id been dreaming about all my life: Alexander Sterling.\u003c/p\u003e\n\u003cp\u003eI still want to be like you, I said. I want to be with you. Forever.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eAlexander pulled me into him and laid a dizzy-making kiss on my lipsso passionate and tender, my knees shook.\u003c/p\u003e\n\u003cp\u003eLuna bore a gaze that blazed through us.\u003c/p\u003e\n\u003cp\u003eBecky and Matt applauded, and we got a few whistles.\u003c/p\u003e\n\u003cp\u003eAlexander and I embraced, and Luna left the dance floor.\u003c/p\u003e\n\u003cp\u003eHow about a slow one? Matt suggested. He fiddled with the sound system until he found a song he liked.\u003c/p\u003e\n\u003cp\u003eThe four of us danced, joined by Dullsvillian student couples.\u003c/p\u003e\n\u003cp\u003eWhen the song was over, I was jolted out of our romantic entanglement.\u003c/p\u003e\n\u003cp\u003eThe Pradabees were with the other Pradabees, and the soccer snobs were mixing it up with the cheerleaders. Trevor was flirting with Scarlet, and Onyx was hanging next to Jagger.\u003c/p\u003e\n\u003cp\u003eWheres Sebastian? I asked.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eHes probably in mortal babe heaven, Alexander said. I appreciate all youve done for him.\u003c/p\u003e\n\u003cp\u003eMe? It was nothing.\u003c/p\u003e\n\u003cp\u003eOne other partygoer was not accounted for. Luna was missing. That could mean only one thing. Trouble.\u003c/p\u003e\n\u003cp\u003eIt was late. Bottles and trash littered the backyard of the Mansion. Alexander and I forced our way through the reveling students. A large crowd had gathered around the gazebo. I pushed through to find Luna, several soccer snobs, and Sebastian sitting in a circle.\u003c/p\u003e\n\u003cp\u003eIn the center, resting on its side, was the empty Transylvania 1972.\u003c/p\u003e\n\u003cp\u003eThe students, unbeknownst to them, were playing a deadly game of spin the bottle.\u003c/p\u003e\n\u003cp\u003eWe have to stop them, I said.\u003c/p\u003e\n\u003cp\u003eThe game seems quite uneven. She must be up to something, Alexander said.\u003c/p\u003e\n\u003cp\u003eThe crowd was hooping and hollering, and several guys had formed a line vying for a seat in the circle.\u003c/p\u003e\n\u003cp\u003eWere waiting our turn, a guy said to me.\u003c/p\u003e\n\u003cp\u003eLuna spun the bottle, and it landed on a soccer snob.\u003c/p\u003e\n\u003cp\u003eOn the cheek, please, she said.\u003c/p\u003e\n\u003cp\u003eAre you kidding? Forget it. He got up and walked away.\u003c/p\u003e\n\u003cp\u003eShe spun again. It landed on another soccer snob. On the cheek, please.\u003c/p\u003e\n\u003cp\u003eHe gently gave her a slobbering kiss on the cheek, to the crowds delight. She made a face and wiped it off with her sleeve.\u003c/p\u003e\n\u003cp\u003eLuna twirled the bottle again. It landed on Sebastian.\u003c/p\u003e\n\u003cp\u003eOn the cheek, I know, he said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eLuna made a deadly stare at Alexander, then gazed at Sebastian. On the neck, please, she said coyly.\u003c/p\u003e\n\u003cp\u003eSebastian was stunned, and the crowd cheered.\u003c/p\u003e\n\u003cp\u003eShe stood up and flipped back one of her pink Wednesday Addams braids to expose her porcelain flesh.\u003c/p\u003e\n\u003cp\u003eLuna put her waify arms around Sebastians waist.\u003c/p\u003e\n\u003cp\u003eWe have to stop this, I said to Alexander. Hes going to bite her!\u003c/p\u003e\n\u003cp\u003eHe better not! Alexander charged forward, but the cheering crowd grew larger, blocking our path to the gazebo.\u003c/p\u003e\n\u003cp\u003eSebastian grinned and began to lean in to Luna.\u003c/p\u003e\n\u003cp\u003eI squeezed myself in between a pair of petite cheerleaders.\u003c/p\u003e\n\u003cp\u003eSebastian smiled, revealing two shiny fangs. Lunas eyes closed and she leaned back with delight.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eNo! I screamed.\u003c/p\u003e\n\u003cp\u003eI jumped between Sebastian and Luna, but at the last moment someone pulled me back.\u003c/p\u003e\n\u003cp\u003eIt was Jagger.\u003c/p\u003e\n\u003cp\u003eWhat are you doing? voices from the crowd yelled at me.\u003c/p\u003e\n\u003cp\u003eAlexander and I were mortified. Sebastian was smiling, and Luna was holding her neck, grinning.\u003c/p\u003e\n\u003cp\u003eShe removed her hand. Tiny drops of blood trickled down her neck.\u003c/p\u003e\n\u003cp\u003eSebastian turned to me and Alexander, his eyes hazy and his fangs red. He wiped his hand over his mouth and pulled Alexander close.\u003c/p\u003e\n\u003cp\u003eI think Im in love, he declared. And this time its for real. \u003c/p\u003e","sourceLink":"https://allnovel.net/love-bites-vampire-kisses-7/page-16.html","bookId":1871,"creation":"Oct 5, 2019 4:46:54 PM","modification":"Oct 5, 2019 4:46:54 PM"}
