{"id":82764,"no":4,"title":"Page 4","content":"\u003cp\u003eAlexander appeared confident and content in the company of our cryptic clique as we entered Hatsys Diner. He hummed Love Me Tender as Elviss voice crooned throughout the fifties-themed restaurant.\u003c/p\u003e\n\u003cp\u003eOnce again our odd threesome was met with glaring eyeballs, but my immortal companions appeared unaware. Sebastian seemed immediately taken with the charm and authenticity of the diner and was intrigued by the juke-boxes. While the vampires picked out a few songs, I found Becky sitting in a red vinyl booth, texting.\u003c/p\u003e\n\u003cp\u003eI plopped down across from her. Wheres Matt? I asked.\u003c/p\u003e\n\u003cp\u003eHe has to study. But he says hello. She held her phone in front of my face. It displayed the words L8TR QT followed by Tel R Hi.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI waved to the phone.\u003c/p\u003e\n\u003cp\u003eAlthough I loved that Alexander was reclusive and shrouded himself in mystery, I did wonder what it would be like if Alexander had a phone and I could receive sweet nothings on my phoneLUV U LOTZ, Cant W8 2 C U, A X R. I had a million girlie texts from Becky and quite a few nagging ones from my mom but nothing close to the love notes Becky was receiving from Matt.\u003c/p\u003e\n\u003cp\u003eSuddenly, Alexander and Sebastian were standing at our booth. Alexanders black hair hung sexily over his deep, dark eyes, his white collar perched up around his neck, and he wore a dark jacket and tight jeans. His Underworldly cohort, Sebastian, stood with his hands in his oversized pockets, sporting sparkling earrings and wildly woolly locks.\u003c/p\u003e\n\u003cp\u003eBecky, I began. This is Sebastian.\u003c/p\u003e\n\u003cp\u003eSebastian and Becky locked eyes. They both froze for a moment that lingered like an extra heartbeat. There seemed to be an electric charge that surged between the two. His pale face flushed ruby red. She giggled without a sound.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eCome sit down, I said, hoping to sever their strange and sudden connection.\u003c/p\u003e\n\u003cp\u003eOh yeah, Sebastian said, as if coming out of a fog. Becky quickly shut her phone.\u003c/p\u003e\n\u003cp\u003eAlexander scooted next to me and placed one hand on my red-and-black-striped tighted knee and the other around my shoulder. He smelled yummy in his lightly scented Drakkar, and my pulse quickened.\u003c/p\u003e\n\u003cp\u003eSebastian inched awkwardly onto the bench next to Becky. The seemingly self-assured guy appeared suddenly shy and smitten. He tucked his hair behind his ear and played with the rings on his fingers.\u003c/p\u003e\n\u003cp\u003eBecky held her purse tightly in her lap like a childs teddy bear and nervously twisted the nylon strap.\u003c/p\u003e\n\u003cp\u003eI hope youre hungry, I said, and handed Sebastian a menu that sat behind the tabletop jukebox.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eYou know I am, he mumbled.\u003c/p\u003e\n\u003cp\u003eSebastian fidgeted in the booth and tapped his fingers against the menu. Becky avoided him by flipping through the jukebox songs.\u003c/p\u003e\n\u003cp\u003eDixie, a familiar waitress, came over. She wore her hair in a black beehive, and her curvy figure was squeezed into her white uniform like a forties pinup girls. When she wasnt reading a tabloid magazine at the soda counter, she was heckling her customers. She had a heart of gold but little patience for the teen clientele.\u003c/p\u003e\n\u003cp\u003eWhatll you have? she asked.\u003c/p\u003e\n\u003cp\u003eSebastian hadnt had time to open his menu; he was too busy perusing Becky. What are you getting? he asked Alexander.\u003c/p\u003e\n\u003cp\u003eThe malts are fabulous, Alexander said.\u003c/p\u003e\n\u003cp\u003eOrder anything youd like, Sebastian, I said.\u003c/p\u003e\n\u003cp\u003eAnything? Or anyone? Sebastian gave a cheeky wink to my best friend.\u003c/p\u003e\n\u003cp\u003eSebastian waited for her response. Embarrassed, Becky blushed and giggled. Sebastian took that as a positive sign and he, too, grinned.\u003c/p\u003e\n\u003cp\u003eAlexander chuckled and I sneered. I was the only one not finding any humor in his comment.\u003c/p\u003e\n\u003cp\u003eFour chocolate malts, four burgers, and two atomic fries, I said to Dixie.\u003c/p\u003e\n\u003cp\u003eSounds good to me, Becky said.\u003c/p\u003e\n\u003cp\u003eHow do you want the burgers cooked? Dixie cracked her gum so loud it sounded like a car backfiring.\u003c/p\u003e\n\u003cp\u003eRare, Sebastian said.\u003c/p\u003e\n\u003cp\u003eAlexander kicked Sebastian underneath the table.\u003c/p\u003e\n\u003cp\u003eRare? Becky asked.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWe dont serve hamburgers rare here. With the tip of her pen she pointed to a small disclaimer on the bottom of the menu. This isnt a five-star restaurant, if you hadnt noticed. You can order your burgers burnt or not burnt.\u003c/p\u003e\n\u003cp\u003eThen four not-burnt burgers, Alexander said with a grin.\u003c/p\u003e\n\u003cp\u003eDixie blew a pink bubble, winked at Alexander, and wiggled toward the kitchen.\u003c/p\u003e\n\u003cp\u003eWe all cracked up, and when our laughter subsided there was an awkward silence.\u003c/p\u003e\n\u003cp\u003eSebastian checked out Becky, which caused her to fiddle with her napkin.\u003c/p\u003e\n\u003cp\u003eAlexander and Sebastian grew up together in Romania, I told her. Just like us, best buds.\u003c/p\u003e\n\u003cp\u003eThats great, Becky said demurely. She wrung the napkin again.\u003c/p\u003e\n\u003cp\u003eSince no one else was talking and I was dying to find out more about Alexander, I figured this was as good a chance as any to steer the conversation in that direction.\u003c/p\u003e\n\u003cp\u003eSo what did you two guys do for fun in Romania? I asked.\u003c/p\u003e\n\u003cp\u003eAlexander shrugged his shoulders. I dont knowwe just hung out.\u003c/p\u003e\n\u003cp\u003eAnd played golf? I asked.\u003c/p\u003e\n\u003cp\u003eNo. Alexander laughed. We did the things kids do\u003c/p\u003e\n\u003cp\u003eYesbut you werent normal kids.\u003c/p\u003e\n\u003cp\u003eBecky appeared puzzled.\u003c/p\u003e\n\u003cp\u003eI mean, since Alexanders grandmother was a baroness, I said, covering my comments.\u003c/p\u003e\n\u003cp\u003eDixie returned with our shakes. Becky hid behind hers and the rest of us began to devour ours.\u003c/p\u003e\n\u003cp\u003eDid you get into trouble? I asked.\u003c/p\u003e\n\u003cp\u003eI did Sebastian said. But Alexander was always there to get me out of it.\u003c/p\u003e\n\u003cp\u003eI nestled into my boyfriend.\u003c/p\u003e\n\u003cp\u003eWhat do you do for fun? Sebastian asked Becky.\u003c/p\u003e\n\u003cp\u003eMe? she asked, surprised the conversation was directed toward her.\u003c/p\u003e\n\u003cp\u003eYes.\u003c/p\u003e\n\u003cp\u003eBecky leered at me as if I were going to answer for her.\u003c/p\u003e\n\u003cp\u003eSebastian waited, but Becky didnt answer. She just played with her straw.\u003c/p\u003e\n\u003cp\u003eWe do girlie things, I answered for her. Talk, gossip, and talk some more.\u003c/p\u003e\n\u003cp\u003eDo you like cemeteries? he asked.\u003c/p\u003e\n\u003cp\u003eMe? She shook her head vehemently.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWas Alexander in his attic room painting like he is now? I asked.\u003c/p\u003e\n\u003cp\u003eUhyes. He always was working on some masterpiece. But he rarely showed me. He kept them hidden in an armoire in his room. Do you paint or draw? he asked Becky.\u003c/p\u003e\n\u003cp\u003eNoIm not an artist.\u003c/p\u003e\n\u003cp\u003eDid you guys go clubbing? I asked Sebastian.\u003c/p\u003e\n\u003cp\u003eSure, sometimes. Do you like to go out, Becky?\u003c/p\u003e\n\u003cp\u003eUhme?\u003c/p\u003e\n\u003cp\u003eAlexander, I said, clearing my throat. I left something in the car. Can we go get it?\u003c/p\u003e\n\u003cp\u003eUhsure, my boyfriend replied.\u003c/p\u003e\n\u003cp\u003eSebastian reached into his back pocket and handed Alexander his keys.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eOnce Alexander and I were outside Hatsys, I stopped.\u003c/p\u003e\n\u003cp\u003eThe car is over there, Alexander said.\u003c/p\u003e\n\u003cp\u003eI didnt forget anything. I wanted to talk to you.\u003c/p\u003e\n\u003cp\u003eAlexander was perplexed. What do you want to talk about?\u003c/p\u003e\n\u003cp\u003eWhat is going on with Sebastian?\u003c/p\u003e\n\u003cp\u003eWhat do you mean?\u003c/p\u003e\n\u003cp\u003eIm trying to have a conversation with him and all he wants to do is talk to Becky.\u003c/p\u003e\n\u003cp\u003eHe doesnt mean anything by it. Hes just being polite.\u003c/p\u003e\n\u003cp\u003eDoes he think we were fixing him up? I asked.\u003c/p\u003e\n\u003cp\u003eI dont think so.\u003c/p\u003e\n\u003cp\u003eWell, he needs to back off. Dont you see the way hes staring at her? Hes hitting on her.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI think you might be overthinking it, Alexander said soothingly.\u003c/p\u003e\n\u003cp\u003eDid he ask me one question? I charged.\u003c/p\u003e\n\u003cp\u003eAlexander paused. Is that what this is about? That hes not paying attention to you? he asked sweetly. He doesnt always have the best manners. I do try to tell him.\u003c/p\u003e\n\u003cp\u003eNoI dont care that he doesnt ask me.\u003c/p\u003e\n\u003cp\u003eBut perhaps it did bother me. Maybe I was getting wrapped up in his attention toward Becky. Maybe I was oversensitive to his advances since they were not directed toward me. I felt like a heel, accusing Alexanders friend of preying on Becky.\u003c/p\u003e\n\u003cp\u003eOkay, okay. I guess Im just being overprotective of Becky, like you are of me.\u003c/p\u003e\n\u003cp\u003eWhen we returned, Sebastian was holding Beckys hand and reading her palm. This is your life lineand this is your love line. He was seductively tracing her lines with his finger. Very strong indeed.\u003c/p\u003e\n\u003cp\u003eSee? I whispered to Alexander.\u003c/p\u003e\n\u003cp\u003eNow Ill show you mine. He scooted closer to her and held out his palm.\u003c/p\u003e\n\u003cp\u003eBecky giggled uncontrollably. She glanced at a long line running through his hand. She had a quizzical look on her face. Wowyour life line seems to go on forever.\u003c/p\u003e\n\u003cp\u003eNow Alexander wasnt pleased with Sebastians flirting.\u003c/p\u003e\n\u003cp\u003eHow about you tell them about the time you drove your Mustang through the cemetery and it almost fell into an empty grave, Alexander prompted his friend, taking charge of the situation.\u003c/p\u003e\n\u003cp\u003eJust then Dixie arrived with a tray full of food. Sebastian tore into his burger while Becky picked at her fries.\u003c/p\u003e\n\u003cp\u003eI could tell she wanted to say something to Sebastian. Normally, Becky was painfully shy, but with Sebastians playful attitude toward her, she was loosening up. What do you and Alexander do all day while we go to school? she asked suddenly.\u003c/p\u003e\n\u003cp\u003eSebastian was pleased with her interest. Sleep.\u003c/p\u003e\n\u003cp\u003eYou sleep all day? I cant imagine not getting up when the sun rises.\u003c/p\u003e\n\u003cp\u003eWell, I stay up all night.\u003c/p\u003e\n\u003cp\u003eLike Raven? She has insomnia. Shed sleep all day and go to school at night if she could.\u003c/p\u003e\n\u003cp\u003eOr not go to school at all, I chimed in.\u003c/p\u003e\n\u003cp\u003eThey laughed, but I was serious.\u003c/p\u003e\n\u003cp\u003eYou are so different from other girls I meet, Sebastian said.\u003c/p\u003e\n\u003cp\u003eBecky slunk down. I knowIve never been to Europe or even New York.\u003c/p\u003e\n\u003cp\u003eNoI mean that as a compliment, he continued.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eBecky lit up. She wasnt used to being paid so much attention by a good-looking stranger.\u003c/p\u003e\n\u003cp\u003eYes, Beckys the greatest, I praised. Not like those other girls in school who are obsessed with everything Gucci. Weve been friends since the third grade.\u003c/p\u003e\n\u003cp\u003eI can see why you like it so much here, Sebastian said to Alexander. The people are really genuine. And cute.\u003c/p\u003e\n\u003cp\u003eBecky turned as red as the bottle of ketchup she was reaching for. She squeezed it over her fries but then left them untouched.\u003c/p\u003e\n\u003cp\u003eSo, Alexander, I said, taking over. Now we know what we do all day. What do you do?\u003c/p\u003e\n\u003cp\u003eAlexander sat up as we waited for his response.\u003c/p\u003e\n\u003cp\u003eI spend it thinking about you, of course.\u003c/p\u003e\n\u003cp\u003eAfter stuffing our faces with burgers and chocolate malts, Alexander gallantly paid Dixie and we headed for the parking lot.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWe escorted Becky to her truck underneath a star-filled night sky.\u003c/p\u003e\n\u003cp\u003eIt was great meeting you, Sebastian. She opened her arms to give him a friendly hug. Alexander cleared his throat when Sebastian squeezed her a bit too long.\u003c/p\u003e\n\u003cp\u003eWhen will I have the pleasure of seeing you again? Sebastian asked. Clearly, Sebastian didnt want our visit to end.\u003c/p\u003e\n\u003cp\u003eBecky twisted her hair and shrugged her shoulders. She gave me a quick hug, hopped into her truck, and rolled down the window.\u003c/p\u003e\n\u003cp\u003eGood night, Raven, she said. Ill talk to you tomorrow. Good night, Alexander.\u003c/p\u003e\n\u003cp\u003eWe watched and waved as Becky drove out of the parking lot and down the street.\u003c/p\u003e\n\u003cp\u003eSo now what do you want to do? I asked. Hang out at the cemetery again?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI guess we should be dropping you off, Alexander said.\u003c/p\u003e\n\u003cp\u003eMe? But the night is so young, I moaned.\u003c/p\u003e\n\u003cp\u003eAlexander put his arm around me and we headed for the Mustang, but Sebastian continued to stare in the direction Becky had just driven.\u003c/p\u003e\n\u003cp\u003eWhats up? Alexander asked him, tripping him out of his trance.\u003c/p\u003e\n\u003cp\u003eSebastian was silent.\u003c/p\u003e\n\u003cp\u003eHello. Are you in there? Alexander prompted again. Is something wrong?\u003c/p\u003e\n\u003cp\u003eI dont know, Sebastian said. Ive never felt like this before.\u003c/p\u003e\n\u003cp\u003eAre you sick? I wondered.\u003c/p\u003e\n\u003cp\u003eI thinkIm in love, Sebastian announced, as if it was just occurring to him.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWith who? I asked. Dixie?\u003c/p\u003e\n\u003cp\u003eI can see why you like it here, dude, he said to Alexander. You found your soul mate, and now Ive found mine.\u003c/p\u003e\n\u003cp\u003eWho are you talking about? Alexander asked.\u003c/p\u003e\n\u003cp\u003eBecky.\u003c/p\u003e\n\u003cp\u003eI laughed. But then I could see that Sebastian was dead serious.\u003c/p\u003e\n\u003cp\u003eShe has a boyfriend, I said.\u003c/p\u003e\n\u003cp\u003eShe does?\u003c/p\u003e\n\u003cp\u003eYes, I said emphatically.\u003c/p\u003e\n\u003cp\u003eOf course she does. Someone as pretty as her. But does that matterin the long run? Sebastian mused.\u003c/p\u003e\n\u003cp\u003eIt matters. Besides, shes not really your type.\u003c/p\u003e\n\u003cp\u003eAB negative? I like all kinds. Sebastian didnt seem to be joking, but Alexander broke a smile.\u003c/p\u003e\n\u003cp\u003eIts not funny, I said. I think its time to go\u003c/p\u003e\n\u003cp\u003eIm not laughing, Sebastian said. It aches in here, he said, pointing to his heart.\u003c/p\u003e\n\u003cp\u003eThats not love, thats indigestion, I said. Hatsys is known for it.\u003c/p\u003e\n\u003cp\u003eI cant shake it.\u003c/p\u003e\n\u003cp\u003eWe can stop at the pharmacy and get you some Rolaids, I offered.\u003c/p\u003e\n\u003cp\u003eSebastian faced me intently. This isnt heartburn. Dont you see?\u003c/p\u003e\n\u003cp\u003eAll right, Alexander said, putting his hands on Sebastians shoulders. Its time we head out.\u003c/p\u003e\n\u003cp\u003eDid you see how into me she was? Sebastian asked. Asking me all sorts of questions?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eShe was just being polite, I told him.\u003c/p\u003e\n\u003cp\u003eI like that. Most girls I meet are into themselves. Can you give me her number?\u003c/p\u003e\n\u003cp\u003eHer number? I asked, alarmed. But she already has a boyfriend!\u003c/p\u003e\n\u003cp\u003eSomething I can overlook. For now.\u003c/p\u003e\n\u003cp\u003eI really dont think\u003c/p\u003e\n\u003cp\u003eOne cannot dodge Cupids arrow, Sebastian proclaimed.\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. Cupid isnt the only one with an arrow. I scowled.\u003c/p\u003e\n\u003cp\u003eAlexander rubbed my neck. Its okay. Hes just playing.\u003c/p\u003e\n\u003cp\u003eWe got into the Mustang, and as Sebastian drove me home, the ghostly duo boisterously sang to tunes blasted from his speakers. I pretended to not be disturbed by Sebastians off-key singing or his sudden proclamation.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eSebastian waited in the car while Alexander escorted me up the front steps.\u003c/p\u003e\n\u003cp\u003eWhy didnt you say anything about Becky? I asked when we reached the door.\u003c/p\u003e\n\u003cp\u003eHes harmless. He falls for girls all the time and whines when they dont fall back. I was surprised he didnt declare his love for you. Alexander fingered my belt loops and drew me to him.\u003c/p\u003e\n\u003cp\u003eYeah, why didnt he? I asked, gazing up at him.\u003c/p\u003e\n\u003cp\u003eIm sure he did, he said, brushing my hair away from my face. He just knows what Id do to him if he did anything about it.\u003c/p\u003e\n\u003cp\u003eYou think hed really like me?\u003c/p\u003e\n\u003cp\u003eFor a moment, I too was as giddy as Becky had been. Not because I liked Sebastian but because I liked the idea of being admired. I spent so much of my life in Dullsville being ostracized, it was exhilarating to know that I might be attractive to the male species, especially when the male species was the vampire kind.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eHow could he miss the most beautiful girl in Dullsvilleor the world, for that matter? Alexander asked. Hed have to be blinder than a bat.\u003c/p\u003e\n\u003cp\u003eMy boyfriend stared at me, his chocolate eyes burning through me. He leaned into me and gave me a five-star kiss. \u003c/p\u003e","sourceLink":"https://allnovel.net/love-bites-vampire-kisses-7/page-4.html","bookId":1871,"creation":"Oct 5, 2019 4:46:54 PM","modification":"Oct 5, 2019 4:46:54 PM"}
