{"id":82766,"no":6,"title":"Page 6","content":"\u003cp\u003eThe students at Dullsville High treated me more oddly than usual the next day when I arrived at school. Apart from the usual shifty glances thrown my way, I heard more whispers and mutterings than normal. I was throwing my coffee in the trash when I felt a person standing behind me.\u003c/p\u003e\n\u003cp\u003eYour secret admirer is not so secret anymore, a male voice said.\u003c/p\u003e\n\u003cp\u003eI tried to ignore the demon in khakis and inch around the trash can, but he blocked my escape. Cornered, I spun around.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eTrevor towered over me. His golden locks were combed perfectly, as if hed just been primped for a photo shoot. I didnt have the energy for one of his trivial confrontations.\u003c/p\u003e\n\u003cp\u003eDo you mind? Littering is illegal, you know. Be my guest and do us all a favor, I said, gesturing toward the can. Throw yourself in.\u003c/p\u003e\n\u003cp\u003eI love it when you talk dirty, he said, not budging. He placed his hand against the wall, blocking my exit.\u003c/p\u003e\n\u003cp\u003eI really dont have time for you today, I said, and slipped underneath his human barricade.\u003c/p\u003e\n\u003cp\u003eTwo-timing your boyfriend takes a lot of time and energy, does it?\u003c/p\u003e\n\u003cp\u003eThis time I stopped and faced him squarely. What are you talking about?\u003c/p\u003e\n\u003cp\u003eWord has it theres a new monster in town and hes leaving gifts in your lockercandy, jewelry, love notes.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI was always amazed at how fast rumors spread throughout Dullsville and how grossly incorrect they could become.\u003c/p\u003e\n\u003cp\u003eNo one is leaving me anything.\u003c/p\u003e\n\u003cp\u003eIs that so? Then what were those flowers doing on Mrs. Hathaways desk?\u003c/p\u003e\n\u003cp\u003eTeacher Appreciation Day.\u003c/p\u003e\n\u003cp\u003eThats not until\u003c/p\u003e\n\u003cp\u003eI was planning ahead.\u003c/p\u003e\n\u003cp\u003eIm not going to even react to your lies. I thought when you ditched your boyfriend, the least you could do was come to me. After all, Im much better-looking.\u003c/p\u003e\n\u003cp\u003eI didnt ditch Alexander!\u003c/p\u003e\n\u003cp\u003eThen he doesnt know? he asked as if he was unraveling a mystery. You are two-timing him.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eYouve wasted enough of my time.\u003c/p\u003e\n\u003cp\u003eOr are you having a monster threesome up there in that filthy mansion? You always seemed the kinky type with your studs and boots. He sidled up to me, so close I could feel his warm breath against my neck.\u003c/p\u003e\n\u003cp\u003eNoyou have it all wrong. I faced him hard. This was one time Id rather have been in class than out in the hallway. I have to go.\u003c/p\u003e\n\u003cp\u003eWell, someone is going to know about you sneaking aroundand it might be Alexander. Trevor thumped me on the head and disappeared into the crowd of students.\u003c/p\u003e\n\u003cp\u003eI wasnt dating Sebastian. There was nothing to hide from Alexanderbut by the way everyone was treating me, the whole school must have believed I was cheating on him. My boyfriend, like any other, would not have been happy about that.\u003c/p\u003e\n\u003cp\u003eAfter school, I was at Beckys waiting for sundown. The time had slipped by as Becky typed away at her computer doing research for an English paper and I ignored my own homework by lying on her bed, rereading The Vampire Lestat.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI think Im almost finished, she said gleefully.\u003c/p\u003e\n\u003cp\u003eWell, I should be going, I said. The sun was slowly sinking; only a few rays still poked out behind the field. I need to tell Alexander that the whole town thinks Im dating Sebastian before it gets back to him.\u003c/p\u003e\n\u003cp\u003eIm sorry things have gotten so far out of hand. If you hadnt stuck up for me\u003c/p\u003e\n\u003cp\u003eThats my job, I said. Im your best friend. I hopped off her bed and grabbed my jacket. I better get my bike.\u003c/p\u003e\n\u003cp\u003eWhen we arrived at her house, Becky and I picked apples from one of her trees for a snack, and Id parked my bike in the barn.\u003c/p\u003e\n\u003cp\u003eBecky peered out her window. Why dont I drive you home instead? she asked with concern. Its totally dark out there.\u003c/p\u003e\n\u003cp\u003eThats okay. I can find my way.\u003c/p\u003e\n\u003cp\u003eBut there arent lights, she said. Even in the barn.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eI\u0027d always protected Beckyat school, in town, in lifebut this was her property and she wasnt normally afraid on her own land.\u003c/p\u003e\n\u003cp\u003eDont worry, I reassured her as I walked down her creaky stairs. I can go by myself. It will just take a minute.\u003c/p\u003e\n\u003cp\u003eThe light switch hasnt been working, and quite frankly its kind of spooky without it, she confessed.\u003c/p\u003e\n\u003cp\u003eIm all about spooky!\u003c/p\u003e\n\u003cp\u003eI\u0027ll drive you home, she insisted.\u003c/p\u003e\n\u003cp\u003eYou dont have to do that. Besides, I love wandering around fields in the dark. Maybe well find a dead body.\u003c/p\u003e\n\u003cp\u003eDont say that!\u003c/p\u003e\n\u003cp\u003eOnce outside, Becky picked up a flashlight from on her back-porch railing. I never get used to coming out here in the dark, she said.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIt was pitch-black except for the tiny light beaming from her flashlight. We had at least fifty yards to walk just to reach the barn. The cool night air made the journey even more chilling.\u003c/p\u003e\n\u003cp\u003eBecky dug her nails into my arm but was doing her best to be brave.\u003c/p\u003e\n\u003cp\u003eI thought Id take her mind off her fears as we traipsed down her gravel road and through the darkness. So are you sure Sebastian hasnt tried to contact you again?\u003c/p\u003e\n\u003cp\u003eNo.\u003c/p\u003e\n\u003cp\u003eNo texts? Or flowers? I hinted.\u003c/p\u003e\n\u003cp\u003eNothing, Becky vowed.\u003c/p\u003e\n\u003cp\u003eYoud tell me\u003c/p\u003e\n\u003cp\u003eOf course I would. You know I cant keep secrets.\u003c/p\u003e\n\u003cp\u003eGood. Perhaps Alexanders and my talk was getting through to him. If you werent going out with Mattwould you like him?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eBut I am going out with Matt.\u003c/p\u003e\n\u003cp\u003eIf you werent, I prodded.\u003c/p\u003e\n\u003cp\u003eBut I am, Raven.\u003c/p\u003e\n\u003cp\u003eYou havent even thought about it?\u003c/p\u003e\n\u003cp\u003eNowhy would I?\u003c/p\u003e\n\u003cp\u003eAs we grew close, a neighbors horse whinnied in the distance.\u003c/p\u003e\n\u003cp\u003eThe old barn smelled like hay and old wood.\u003c/p\u003e\n\u003cp\u003eFor a moment, Becky struggled, but she opened the barn door. It sticks, she said.\u003c/p\u003e\n\u003cp\u003eThe barn was dark as a cave. Becky shined the light inside. Tools hung from the walls like dripping wax.\u003c/p\u003e\n\u003cp\u003eWhat happened to the switch? I asked.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eIt shorted out the other day. My dad didnt have a chance to fix it.\u003c/p\u003e\n\u003cp\u003eWe were blind except for the thin beam from her flashlight. Something felt strangelike we were being watched. I knew that there werent any farm animals kept in the barn. I wasnt sure what else it could be.\u003c/p\u003e\n\u003cp\u003eHurry and get your bike, she said.\u003c/p\u003e\n\u003cp\u003eBecky was still hiding behind me, pointing past the tractor. She clung to me so hard, I couldnt move.\u003c/p\u003e\n\u003cp\u003eJust then we heard a rustling in the rafters.\u003c/p\u003e\n\u003cp\u003eBecky jumped. Ooh! Its a bat. My dad said he saw one the other night. I figured youd want us to catch it for you, but it was too high.\u003c/p\u003e\n\u003cp\u003eIts more than a bat, I surmised.\u003c/p\u003e\n\u003cp\u003eAfter a few moments, the bat disappeared. I sensed someone lurking in the shadows. I took the flashlight and shined it on a bale of hay. Nothing. I shined it again on a workbench. Becky hid behind me, grasping my shirt so tight I could barely breathe.\u003c/p\u003e\n\u003cp\u003eIm scared, Raven. Lets go back.\u003c/p\u003e\n\u003cp\u003eI shined it on the tractor. The light caught the tail edge of blond dreadlocks.\u003c/p\u003e\n\u003cp\u003eSebastian? Becky said, shocked.\u003c/p\u003e\n\u003cp\u003eI turned the light away from the vampire. He approached us in the moonlight, pushing my bike.\u003c/p\u003e\n\u003cp\u003eWhat are you doing here? I asked. Youre supposed to be with Alexander!\u003c/p\u003e\n\u003cp\u003eHe was painting and I wanted to get some air.\u003c/p\u003e\n\u003cp\u003eIn Beckys barn? I charged.\u003c/p\u003e\n\u003cp\u003eI was walking around and I heard some girls talking. I had to investigate. He smiled broadly.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eBecky seemed to buy his excuse, but I knew better.\u003c/p\u003e\n\u003cp\u003eYou scared us to deathwell, at least me, she said. Im so glad its just you.\u003c/p\u003e\n\u003cp\u003eIm sorry, he said. Truly. Id never want to make your heart race. Unless it was for a good reason.\u003c/p\u003e\n\u003cp\u003eFlirting time was over. Youre lucky Beckys father didnt find you. He has a shotgun, I warned.\u003c/p\u003e\n\u003cp\u003eHe rarely uses it, Becky said. You must be tired if you walked all the way from the Mansion. Can we get you a drink?\u003c/p\u003e\n\u003cp\u003eNo I answered for him.\u003c/p\u003e\n\u003cp\u003eSure! he said over me.\u003c/p\u003e\n\u003cp\u003eI took my bike from Sebastian and the three of us headed back to Beckys house. In Sebastians presence, she was no longer afraid and didnt cling to me in any way.\u003c/p\u003e\n\u003cp\u003eBecky offered us fresh lemonade. Becky had the best lemonade Id ever tasted; her mother made it from scratch. Both Sebastian and I gulped it down and asked for seconds.\u003c/p\u003e\n\u003cp\u003eIts time we go, I said.\u003c/p\u003e\n\u003cp\u003eSebastian wasnt ready to go. He wandered around her kitchen, examining every picture and decoration.\u003c/p\u003e\n\u003cp\u003eWhere was Alexander when I needed him? If he had a cell phone, I could text him immediately. Instead, I tried to ring the Mansions line. If Alexander was painting, his music was probably blaring. It was true. The phone rang endlessly.\u003c/p\u003e\n\u003cp\u003eEven Jameson didnt pick up.\u003c/p\u003e\n\u003cp\u003eNo voice mailreally frustrating, Sebastian said.\u003c/p\u003e\n\u003cp\u003eArent you in town to visit Alexander? I asked.\u003c/p\u003e\n\u003cp\u003eWell, yes.\u003c/p\u003e\n\u003cp\u003eThen why arent you two hanging out?\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eWe dont spend every minute together. Were guys.\u003c/p\u003e\n\u003cp\u003eWhen Becky and I got together, we spent every minute in each others company. But guys? Sometimes when Henry was over with Billy, one would be on the computer while the other was playing video games. I often wondered why they got together in the first place.\u003c/p\u003e\n\u003cp\u003eStill, I wasnt crazy about Sebastians behavior. It didnt seem to be bothering Alexander, however, if he was creative enough to paint. And for all I knew, Alexander might have needed the space.\u003c/p\u003e\n\u003cp\u003eWe better be going, I finally said to Sebastian.\u003c/p\u003e\n\u003cp\u003eI can drive you both back if youd like, Becky offered.\u003c/p\u003e\n\u003cp\u003eYou can drop Raven off first, then me, he said.\u003c/p\u003e\n\u003cp\u003eBecky will drop us both off at the Mansion, I instructed. Then we can tell Alexander where weve been.\u003c/p\u003e\n\u003cp\u003eAfter Becky drove us to the Mansion and I placed my bike against the gate, I grasped Sebastian by his sleeve and pulled him toward the front door like a scolded child.\u003c/p\u003e\n\u003cp\u003eSee you tomorrow at Hooligans, Sebastian called back to Becky.\u003c/p\u003e\n\u003cp\u003eWe met Alexander in his room as he was washing out a brush in a small bucket.\u003c/p\u003e\n\u003cp\u003eDid Sebastian let you in? Alexander asked.\u003c/p\u003e\n\u003cp\u003eWell, yes, but\u003c/p\u003e\n\u003cp\u003eDid you go into town? he asked Sebastian. It did me good to get some work done.\u003c/p\u003e\n\u003cp\u003eYes, I had a great time seeing the sights, his best friend answered.\u003c/p\u003e\n\u003cp\u003eAlexander was euphoric from painting. I hated to spoil his mood by telling him where Id found Sebastian.\u003c/p\u003e\n\u003cp\u003eIm really such a lucky guy, Alexander said. My best friend and girlfriend are here and Im almost finished with my new project.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eHe pointed to a covered painting resting on the easel. But this one is for me.\u003c/p\u003e\n\u003cp\u003eSebastian clearly wasnt going to tell Alexander what hed been up to. I strongly suspected that if Alexander found out Sebastian had been lurking in Beckys barn, he might throw Sebastian out of the Mansion. I didnt want to snitch on him, but I wasnt about to keep secrets from Alexander.\u003c/p\u003e\n\u003cp\u003eI had a major dilemma on my hands.\u003c/p\u003e\n\u003cp\u003eI gazed at Alexander, who was relishing his creation and his friends. Alexander was so peaceful, I couldnt bear to tell him Sebastian was stalking Becky or that Trevor was saying I was two-timing him. But then Sebastian surprised me.\u003c/p\u003e\n\u003cp\u003eI happened upon Becky today when she and Raven were together, Sebastian confessed.\u003c/p\u003e\n\u003cp\u003eHappened upon? Alexander inquired.\u003c/p\u003e\n\u003cp\u003eAlexanderIm hooked. I just wanted to see her one more time.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp;\u0026nbsp;\u003c/p\u003e\n\u003cp\u003eHe flew into her barn when Becky and I were getting my bike, I said lightly. Nothing serious.\u003c/p\u003e\n\u003cp\u003eYou cant be sneaking around her house, Alexander reprimanded. Thats immature. And dangerous.\u003c/p\u003e\n\u003cp\u003eSebastian frowned.\u003c/p\u003e\n\u003cp\u003eI was the queen of sneaking in places. I wasnt any better than him.\u003c/p\u003e\n\u003cp\u003eNo more. Ive washed my hands of love. Sebastian seemed to sense that this was upsetting his best friend. Well stay in for the rest of my stay and play Medieval Mayhem. I wont see her anymore. Not now, not ever.\u003c/p\u003e\n\u003cp\u003eBut we are supposed to see her and Matt tomorrow at Hooligans, I said.\u003c/p\u003e\n\u003cp\u003eWell, I suppose one more time wont hurt, will it? Alexander said.\u003c/p\u003e\n\u003cp\u003eSebastians face lit up. Ill have on my game face. \u003c/p\u003e","sourceLink":"https://allnovel.net/love-bites-vampire-kisses-7/page-6.html","bookId":1871,"creation":"Oct 5, 2019 4:46:54 PM","modification":"Oct 5, 2019 4:46:54 PM"}
