{"id":37153,"no":22,"title":"CHAPTER XXII “IT”","content":"After several dances Mrs. Morse proposed that the young people should play a game of some sort.\n\u003cbr\u003e \n\u003cbr\u003e Nobody seemed to know of any particular game to play, until Ruth volunteered to explain to them a new game that had recently made its appearance in Boston.\n\u003cbr\u003e \n\u003cbr\u003e The game was called “It,” and was great fun, Ruth said, if the players would agree to keep their temper.\n\u003cbr\u003e \n\u003cbr\u003e All present willingly agreed to do this.\n\u003cbr\u003e \n\u003cbr\u003e “It’s really only difficult for one,” explained Ruth; “the one who does the guessing must be guaranteed to possess a temper that is positively incapable of being ruffled under any provocation.”\n\u003cbr\u003e \n\u003cbr\u003e Although entirely unfamiliar with the details of Ruth’s game, it suddenly occurred to Patty that here was an excellent chance to test the quality of Lorraine’s reform in the matter of amiability. So she said:\n\u003cbr\u003e \n\u003cbr\u003e “If you want someone good-natured to do your guessing, I propose Lorraine Hamilton.”\n\u003cbr\u003e \n\u003cbr\u003e Lorraine looked up suddenly, caught Patty’s glance, and determined that she would prove herself worthy of the confidence Patty had shown in her.\n\u003cbr\u003e \n\u003cbr\u003e “I’ll do it,” she said, “and I’ll agree not to lose my temper, whatever your game may be.”\n\u003cbr\u003e \n\u003cbr\u003e “You’ll be tempted to,” said Ruth; “I warn you that ‘It’ is a most exasperating and provoking game.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll risk it,” said Lorraine; “what must I do first?”\n\u003cbr\u003e \n\u003cbr\u003e “First, you must leave the room while I explain the game to the others,” said Ruth; “go out in the hall, please, entirely out of hearing, and don’t come back until we send for you.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well,” said Lorraine, gaily; “when you want me you’ll find me sitting on the stairs, with my fingers in my ears.”\n\u003cbr\u003e \n\u003cbr\u003e “Now,” said Ruth, after Lorraine had gone, “we must all sit round in a sort of an oblong circle.”\n\u003cbr\u003e \n\u003cbr\u003e “An ‘oblong circle’ is easily managed,” said Clifford Morse, as he began to arrange chairs around the walls of the long parlour. The other boys helped him, and soon the whole party were sitting in a continuous ring around the room.\n\u003cbr\u003e \n\u003cbr\u003e “The game,” went on Ruth, “is to have Lorraine guess, by asking questions, an object which we’ve all agreed upon. That part of the game is something like ‘Twenty Questions,’ but the difference is, that instead of taking a single object we each of us have in mind our right-hand neighbour. For instance, Patty’s right-hand neighbour, as we sit, is Kenneth Harper, but his right-hand neighbour is Adelaide Hart. So you see, we must each answer Lorraine’s questions truthfully, but in regard to the person who sits at our right-hand; and the answers will seem to her contradictory and confusing.”\n\u003cbr\u003e \n\u003cbr\u003e Patty was quick-witted enough to see at once that these conflicting answers would seem like ridiculing Lorraine’s intelligence, and would certainly be provoking enough to make anyone angry. It was a severe test, but she privately determined that if Lorraine showed signs of irritation, she would explain the game at once, and not allow it to be played to a finish.\n\u003cbr\u003e \n\u003cbr\u003e When everybody thoroughly understood the directions, Clifford went out, and escorted Lorraine back to the parlour.\n\u003cbr\u003e \n\u003cbr\u003e Then Clifford resumed his seat, and Lorraine was left sitting on a piano stool in the middle of the room, so that she might twirl about and face each one in turn.\n\u003cbr\u003e \n\u003cbr\u003e “We have all agreed upon an object,” said Ruth, “which we want you to guess. You may question us each in turn, and you may ask any questions you choose; if your questions can be answered by yes or no, we’re obliged to answer them, but if not, we may do as we choose about it. Now suppose you begin with me, and then go right around toward the right.”\n\u003cbr\u003e \n\u003cbr\u003e “Wait a moment, Lorraine,” said Patty; “before you start remember this: everything we tell you will be the exact truth, although it may not seem so.”\n\u003cbr\u003e \n\u003cbr\u003e “Very well,” said Lorraine, “I’ll begin with Ruth. Does It belong to the animal, vegetable, or mineral kingdom?”\n\u003cbr\u003e \n\u003cbr\u003e “Animal,” answered Ruth.\n\u003cbr\u003e \n\u003cbr\u003e “How large is It?” asked Lorraine of Gertrude Lyons, who sat next to Ruth.\n\u003cbr\u003e \n\u003cbr\u003e “Which way?” said Gertrude, laughing.\n\u003cbr\u003e \n\u003cbr\u003e “Well, how long is It?”\n\u003cbr\u003e \n\u003cbr\u003e “About two yards,” replied Gertrude, mentally measuring the tall boy who sat on her right.\n\u003cbr\u003e \n\u003cbr\u003e “What colour is It?” asked Lorraine next.\n\u003cbr\u003e \n\u003cbr\u003e “Green,” responded Dick Martin, with a side-long glance at the frock of the girl next to him.\n\u003cbr\u003e \n\u003cbr\u003e “Is It all green?”\n\u003cbr\u003e \n\u003cbr\u003e “No,” said the girl in green, “it is mostly black.” This of course was true, as her right-hand neighbour was a boy in black clothes.\n\u003cbr\u003e \n\u003cbr\u003e Lorraine began to look puzzled. “It seems queer,” she said, “that one of you should say it is all green, and another that it is mostly black. But I suppose one of you must be colour-blind.”\n\u003cbr\u003e \n\u003cbr\u003e They all laughed at this, and Lorraine went on: “Where did It come from?”\n\u003cbr\u003e \n\u003cbr\u003e Lorraine asked this question of a boy who sat next to Margaret Lane, who was from Philadelphia.\n\u003cbr\u003e \n\u003cbr\u003e “From Philadelphia,” he replied.\n\u003cbr\u003e \n\u003cbr\u003e “Is It Margaret Lane?” asked Lorraine of Margaret herself.\n\u003cbr\u003e \n\u003cbr\u003e “No,” she replied, laughing.\n\u003cbr\u003e \n\u003cbr\u003e “Is It anything belonging to Margaret Lane?”\n\u003cbr\u003e \n\u003cbr\u003e “No.”\n\u003cbr\u003e \n\u003cbr\u003e “Has It any connection whatever with Margaret Lane?”\n\u003cbr\u003e \n\u003cbr\u003e “None that I know of.”\n\u003cbr\u003e \n\u003cbr\u003e “To whom does It belong?”\n\u003cbr\u003e \n\u003cbr\u003e Lorraine asked this question of a girl who sat next to a young cadet from West Point, so she replied: “To the United States.”\n\u003cbr\u003e \n\u003cbr\u003e “Is It in stripes?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” replied the cadet, after glancing at the striped dress of the girl next to him.\n\u003cbr\u003e \n\u003cbr\u003e “Then It’s the flag!” exclaimed Lorraine, triumphantly.\n\u003cbr\u003e \n\u003cbr\u003e But they all told her she had guessed wrong, and she good-naturedly went on with her queries.\n\u003cbr\u003e \n\u003cbr\u003e “Has It anything to do with the army?”\n\u003cbr\u003e \n\u003cbr\u003e “Nothing, except that It carries arms,” said the waggish boy whom she asked.\n\u003cbr\u003e \n\u003cbr\u003e “Is It a person?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “Is the person in this room?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes.”\n\u003cbr\u003e \n\u003cbr\u003e “Is It a boy or girl?”\n\u003cbr\u003e \n\u003cbr\u003e “A boy.”\n\u003cbr\u003e \n\u003cbr\u003e “What colour hair has It?”\n\u003cbr\u003e \n\u003cbr\u003e “Flaxen,” was the answer, as the boy she asked was seated next to a yellow-haired girl.\n\u003cbr\u003e \n\u003cbr\u003e But Lorraine, having been told it was a boy, looked around the room for a flaxen-haired boy. There was only one present, so she announced triumphantly: “Then It is Ed Fisher!”\n\u003cbr\u003e \n\u003cbr\u003e Again they told her she was wrong, and the burst of laughter at her bewilderment would have greatly offended Lorraine had it not been for her determination to keep her temper.\n\u003cbr\u003e \n\u003cbr\u003e “I’m glad you told me that you’re all telling the truth,” she said, “for I’m sure your stories don’t agree. You said it was a boy, and had flaxen hair, and Ed Fisher is the only one here with yellow hair.”\n\u003cbr\u003e \n\u003cbr\u003e “Go on with your questions,” said Patty.\n\u003cbr\u003e \n\u003cbr\u003e “All right,” said Lorraine, beginning where she had left off; “what colour eyes has It?”\n\u003cbr\u003e \n\u003cbr\u003e “Black.”\n\u003cbr\u003e \n\u003cbr\u003e “Oh, then of course it isn’t Ed Fisher! Now, Patty, I’ve come to you. Is It good-looking?”\n\u003cbr\u003e \n\u003cbr\u003e Kenneth sat on Patty’s right-hand, and with a mischievous twinkle in her eyes Patty replied, “Oh, not very.”\n\u003cbr\u003e \n\u003cbr\u003e They all laughed at this, and Lorraine, passing on to Kenneth, said; “Do you think It is good-looking?”\n\u003cbr\u003e \n\u003cbr\u003e Here was a chance to tease Patty in return, for Adelaide sat on Kenneth’s right hand, and the boy said: “Oh, very beautiful! Quite the best-looking person I know.”\n\u003cbr\u003e \n\u003cbr\u003e Then they all laughed again, and Lorraine grew more and more bewildered. “Is It good-natured?” she asked of Adelaide.\n\u003cbr\u003e \n\u003cbr\u003e Editha sat next to her sister, and so Adelaide said: “No; It is often as cross as a bear.”\n\u003cbr\u003e \n\u003cbr\u003e “Then,” said Lorraine to Editha, “is It myself?”\n\u003cbr\u003e \n\u003cbr\u003e “No, indeed,” replied Editha, “but It is one of your dearest friends.”\n\u003cbr\u003e \n\u003cbr\u003e Clementine sat next, and Lorraine asked her: “Does It go to the Oliphant school?”\n\u003cbr\u003e \n\u003cbr\u003e “No, indeed!” said Clementine, for Roger Farrington was her right-hand neighbour; “It wouldn’t be allowed there!”\n\u003cbr\u003e \n\u003cbr\u003e “Why wouldn’t It be allowed to go to the Oliphant school,” demanded Lorraine of Roger.\n\u003cbr\u003e \n\u003cbr\u003e “Why, It does go there,” said Roger, glancing at Mary Sargent.\n\u003cbr\u003e \n\u003cbr\u003e “Does It, Mary?” went on Lorraine.\n\u003cbr\u003e \n\u003cbr\u003e “No,” said Mary, positively; “I’m sorry to contradict Roger, but, as Clementine says, Miss Oliphant wouldn’t let It come to our school.”\n\u003cbr\u003e \n\u003cbr\u003e “Which am I to believe?” said Lorraine then, to Clifford Morse; “you tell me, Clifford, does It go to our school?”\n\u003cbr\u003e \n\u003cbr\u003e “Yes,” said Clifford, earnestly, “It certainly does!”\n\u003cbr\u003e \n\u003cbr\u003e “Well,” said Lorraine in despair, “I’ll have to give this thing up. I believe you’re speaking the truth, but there seems to be a whole lot of truths. However, I’ll try once more. Is It a boy or a girl?”\n\u003cbr\u003e \n\u003cbr\u003e “It’s a girl,” declared Hilda.\n\u003cbr\u003e \n\u003cbr\u003e “What colour dress does It wear, Flossy?”\n\u003cbr\u003e \n\u003cbr\u003e “Black,” said Flossy, thinking of the boy next to her.\n\u003cbr\u003e \n\u003cbr\u003e “Of course you’re speaking the truth,” said Lorraine, with a comical smile, “but there isn’t a girl in the room with a black dress on. What’s her dress trimmed with, Ed?”\n\u003cbr\u003e \n\u003cbr\u003e The boy looked at Maude Carleton, who sat next to him. Then he said: “It’s dress is trimmed with a sort of feathery, fluffery, white, lacy ruching.”\n\u003cbr\u003e \n\u003cbr\u003e “Why, that’s the trimming on Maude’s dress,” declaimed Lorraine, “but her dress isn’t black. Maude, is It you?”\n\u003cbr\u003e \n\u003cbr\u003e “No,” said Maude, positively.\n\u003cbr\u003e \n\u003cbr\u003e “I give it up,” said Lorraine; “I promised to keep my temper, and I have; I promised to believe you all told me the truth, and I do; but I didn’t promise to guess your old It, and I can’t do it; I give It up.”\n\u003cbr\u003e \n\u003cbr\u003e “You’re a trump, Lorraine,” cried Patty; “anybody else would have been as mad as hops long before this. Now we’ll tell you.”\n\u003cbr\u003e \n\u003cbr\u003e So they explained the game to Lorraine, and she realised how they had each told her the truth, although it didn’t seem so at the time. She was glad she had kept good-natured about it, though it had been more of an effort than anyone had realised.\n\u003cbr\u003e \n\u003cbr\u003e Then other games were played, which were less of a tax on the young people’s ingenuity, and after that supper was served.\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Morse well knew how to provide for young people, and she was quite prepared for the demands of their healthy appetites. Sandwiches and salad disappeared as if by magic; jellies, ices and cake followed, and were thoroughly enjoyed by all.\n\u003cbr\u003e \n\u003cbr\u003e Patty and Ruth, with Lorraine, Hilda and the Hart girls, sat in a little group at one end of the dining-room; while the boys went on foraging expeditions, and returned laden with all sorts of good things.\n\u003cbr\u003e \n\u003cbr\u003e “It’s almost Christmas,” said Clifford Morse; “what are you going to do to-morrow, Patty?”\n\u003cbr\u003e \n\u003cbr\u003e “We’re all going to Vernondale for a couple of days,” said Patty, “and when we come back I want you all to come and see Ruth some afternoon.”\n\u003cbr\u003e \n\u003cbr\u003e “I’m going to Vernondale, too,” said Kenneth; “my aunt has invited me to spend the day; in fact to stay as long as I choose. So if I may, I’ll go on the Fairfield Special to-morrow morning.”\n\u003cbr\u003e \n\u003cbr\u003e “You may, if you’ll be good,” said Patty, “but Grandma doesn’t like bad boys, and Ruth is afraid of them.”\n\u003cbr\u003e \n\u003cbr\u003e “I’ll be so good,” said Kenneth, “that Mrs. Elliott won’t know me; and I’ll promise not to scare Ruth once.”\n\u003cbr\u003e \n\u003cbr\u003e Then the clock struck twelve, and the Cinderella party was over. Everybody started for hats and wraps, and Patty found her father awaiting her.\n\u003cbr\u003e \n\u003cbr\u003e “Well, Chickens,” said Mr. Fairfield, as he bundled the two tired girls into the carriage, “did you have a good time?”\n\u003cbr\u003e \n\u003cbr\u003e “Lovely!” exclaimed Patty; “I’d like to go to a party every night.”\n\u003cbr\u003e \n\u003cbr\u003e “So would I,” said Ruth.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1980/56669.html","bookId":711,"creation":"Aug 5, 2019 7:43:26 AM","modification":"Aug 5, 2019 7:43:26 AM"}
