{"id":96117,"no":12,"title":"Page 12","content":"\u003cp\u003eIt seemed as if it took an hour for Jameson to drive me to the Mansion. I was afraid by the time we reached its gates, dinner would be stone cold.\u003c/p\u003e\n\u003cp\u003eWe parked in front of theMansion, It was quite the celestial sight. Candles flickered inside the house like a festive holiday party.\u003c/p\u003e\n\u003cp\u003eJameson opened the car door for me.\u003c/p\u003e\n\u003cp\u003eI reached the top of the crumbling stairs, and, as if on cue, the front door creaked open. On the other side were the first adult vampires I would ever meet. At first I didn\u0027t see anyone.Then out stepped Alexander, stunning in an oversized blue silk shirt and black jeans.\u003c/p\u003e\n\u003cp\u003e\"Wow! You are beautiful.\" He offered his hand to me and kissed me on the cheek.\u003c/p\u003e\n\u003cp\u003eSomber violin music faintly filled the Mansion.A pewter umbrella stand containing at least half a dozen parasols sat by the front door.\u003c/p\u003e\n\u003cp\u003e\"Miss Raven is here,\" Jameson called to the second floor, and retreated to the kitchen.\u003c/p\u003e\n\u003cp\u003e\"My mom takes forever.\"\u003c/p\u003e\n\u003cp\u003eThe Mansion\u0027s air was unusually chilly, and I was shivering.\u003c/p\u003e\n\u003cp\u003e\"Are you nervous?\"\u003c/p\u003e\n\u003cp\u003e\"Petrified.And cold.\"\u003c/p\u003e\n\u003cp\u003e\"My mom likes the thermostat set to freezing. I\u0027ll fix that.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay-,\" I started to say.\u003c/p\u003e\n\u003cp\u003eBut Alexander had already taken off.\u003c/p\u003e\n\u003cp\u003eA ghoulish and magnetically morbid woman descended the red velvet staircase like an apparition. Her perfectly straight jet black hair, streaked with a vivid violet, cascaded over her bony and beautiful shoulders.\u003c/p\u003e\n\u003cp\u003eShe continued to come down the stairs, with the confidence of Cleopatra but the attire of Elvira. Deep eggplant-hued lipstick and nails were ghastly and gorgeous against her corpse-white skin.\u003c/p\u003e\n\u003cp\u003eStrong black eyeliner intensified her blue catlike eyes, and her long, purple, flirty eyelashes sparkled. A tattoo of a black rose crept out from her dark velvet corset, which shaped her chest like a heart. Her small cinched-in waist was accentuated with a fabric belt and a long, flowing black mermaid skirt. Her frame was petite but curvy in all the important places.\u003c/p\u003e\n\u003cp\u003eI was mesmerized by her beauty.\u003c/p\u003e\n\u003cp\u003eAt the end of the staircase a man appeared out of the shadows. He was tall, with broad shoulders and blazing black and gray shoulder-length hair. He was utterly handsome, as striking as any fifties film star. His dark eyebrows were in sharp contrast to his frost-toned skin. He wore a dark silk suit with a bloodred tie and a matching cape. He had a sharp antique wood walking stick, capped with an ivory skull. Alexander\u0027s father formally took his wife\u0027s hand and led her toward me.\u003c/p\u003e\n\u003cp\u003eI froze. I was standing in front of Alexander\u0027s parents. I didn\u0027t know if I should bow or salute. To me, they were the most normal-looking parents I\u0027d ever seen.\u003c/p\u003e\n\u003cp\u003eMrs. Sterling extended her hand to me. In the most lyrical Romanian accent, she said, \"It is our pleasure to meet you, Raven.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t help but notice the two purple bite marks on her neck.\u003c/p\u003e\n\u003cp\u003eI tried to speak, but I was so in awe. My words stuck in my throat.\u003c/p\u003e\n\u003cp\u003eJust then Alexander returned.\u003c/p\u003e\n\u003cp\u003e\"This is Raven,\" he said proudly,\u003c/p\u003e\n\u003cp\u003e\"We were just introducing ourselves,\" his mother stated.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m so happy to meet you, Mrs. Sterling,\" I finally said.\u003c/p\u003e\n\u003cp\u003eHer hand was cold but firm. \"Call me Cassandra.\"\u003c/p\u003e\n\u003cp\u003e\"And this ismy father, Constantine,\" Alexander said.\u003c/p\u003e\n\u003cp\u003eMr. Sterling extended his hand to me. \"It is lovely to meet you, Raven.\" His voice was deep, causing shivers to flow through my body. His dark eyes were intense and hypnotic.\u003c/p\u003e\n\u003cp\u003e\"You are just as beautiful as Alexander described,\" the dashing seniorSterling complimented. \"And he has exquisite taste.\" He grinned, and the candlelight caught the edge of his icicle-sharp fangs.\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t sure if he meant \"taste\" literally. I was, after all, being greeted by a vampire.\u003c/p\u003e\n\u003cp\u003e\"Alexander has told us so much about you,\" Mrs. Sterling said.\u003c/p\u003e\n\u003cp\u003e\"He has?\"\u003c/p\u003e\n\u003cp\u003e\"Come, we\u0027ll be dining outside tonight. I\u0027m bloodthirsty and starved to the bone.\"\u003c/p\u003e\n\u003cp\u003eWe walked to a side door, where an umbrella was leaning against the wall.\u003c/p\u003e\n\u003cp\u003e\"The moonlight can be so strong.\" Mrs. Sterling opened her umbrella and went down the back stairs. The violin music grew louder.\u003c/p\u003e\n\u003cp\u003eThe backyard was grimly festive. Awaiting us was a grand gothic affair. A long black runner ran along the grass from the bottom of the steps to a morbid dinner party under the stars. Four torches burned, presumably to repel insects (but in this case, more likely, to attract them) several yards away from a long, dark wooden table. On closer inspection, I could see that a coffin lid had been transformed into a dining-room table. Several floor-length candelabras surrounded the table, wax dripping like trickling blood. Alexander offered me a chair and gently pushed it in for me as Mr. Sterling did the same for his wife. Mrs. Sterling sat at the head of the casket and Alexander\u0027s father at the end, while Alexander and I sat at the other sides.\u003c/p\u003e\n\u003cp\u003eI was surprised to see a string trio in the gazebo-two men dressed in tuxedos and a woman in an evening dress- playing ina minor key unmelodious funeral-type music. I didn\u0027t recognize the musicians as being from Dullsville. I had assumed the music was coming from an entertainment center, I had no idea it was being played live.Or rather\u0026amp;#65533; undead.\u003c/p\u003e\n\u003cp\u003eThis was unbelievable. It was as if they had transformed the backyard into a cryptic dining hall- All that was missing was a china cabinet.\u003c/p\u003e\n\u003cp\u003eIf Becky and my parents could see me now, they\u0027d never believe I was at the center of this macabre dinner celebration. If only I could immortalize it with a photograph-but then again, most of the diners wouldn\u0027t come out,\u003c/p\u003e\n\u003cp\u003eJameson quickly tended to Mrs. Sterling. He poured her a glass that appeared to be champagne mixed with blood.\u003c/p\u003e\n\u003cp\u003e\"I like mine bubbly,\" she said with a laugh.\u003c/p\u003e\n\u003cp\u003eJameson approached me with hisUnderworldly concoction. \"I\u0027ll have a Coke,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Of course, Miss Raven.\"\u003c/p\u003e\n\u003cp\u003eThen Jameson attempted to serve Alexander, but my boyfriend covered his glass with his hand. \"I\u0027ll have what Raven is having.\"\u003c/p\u003e\n\u003cp\u003eHe finished by pouring Mr. Sterling a tall glass and, from a neighboring chest, retrieved two sodas.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s toast,\" Mrs. Sterling said, raising her drink. \"To Raven and Alexander-may your friendship last an eternity.\"\u003c/p\u003e\n\u003cp\u003eFriendship?I wondered. Hadn\u0027t Alexander told them we were dating? Or was she just being polite? I gazed at myboyfriend, who seemed distracted. Our glasses clinked underneath the twinkling stars.\u003c/p\u003e\n\u003cp\u003e\"So how did you and Alexander meet exactly? You know men can be so vague when it conies to details.\"\u003c/p\u003e\n\u003cp\u003eI snuck into your house and found him standing behindme,I wanted to say,Or do I count Becky almost running your son over in the road outside the Mansion ?\u003c/p\u003e\n\u003cp\u003e\"Uh...I...\"\u003c/p\u003e\n\u003cp\u003e\"I saw Raven several times before I had the courage to invite her here for dinner,\" Alexander answered for me.\u003c/p\u003e\n\u003cp\u003e\"How romantic,\"Mrs ,Sterling remarked, \"A private dinner date.Mr. Sterling and I met at the cemetery.\"\u003c/p\u003e\n\u003cp\u003e\"Wow- that\u0027s romantic, too,\" I said truthfully.\u003c/p\u003e\n\u003cp\u003e\"We are so happy Alexander has found someone to keep company with,\" she said fondly.\u003c/p\u003e\n\u003cp\u003e\"Mrs. Sterling and I understand that Alexander has told you about our family,\" Mr. Sterling said. \"We\u0027d expect a far different reaction from a girl in your situation and find not only your tolerance but your enthusiasm refreshing.\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know what to say, so I remained silent,\u003c/p\u003e\n\u003cp\u003e\"We find it very intriguing that you have the same passion for certain things that my mother did,\" he continued, gesturing toward his family. It seemed as if he was alluding to the Underworld without actually saying it. \"Alexander shared her interest in painting, while you seem to share her other passion.\"\u003c/p\u003e\n\u003cp\u003eVampires?They waited for my reaction. How was I supposed to respond? I turned to Alexander for help. His normally soulful eyes appeared to be red.\u003c/p\u003e\n\u003cp\u003e\"I think we should talk about something else-,\" Alexander said to his father.\u003c/p\u003e\n\u003cp\u003e\"I must say, it does concern Mrs. Sterling and me,\" Mr. Sterling continued. \"My mother was a very lonely woman isolated in a town very different from her own family. I wouldn\u0027t want you to suffer that Generated by ABC Amber LIT Converter,same fate.\"\u003c/p\u003e\n\u003cp\u003eAlexander was fuming. \"We\u0027ve invited Raven over for dinner, not a dissertation.\"\u003c/p\u003e\n\u003cp\u003e\"Constantine, Alexander\u0027s tight,\" Mrs. Sterling interjected. \"There is plenty of time for such matters.\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s just say we appreciate your acceptance of our lifestyle and leave it at that,\" he said.\u003c/p\u003e\n\u003cp\u003e\"So what do you enjoy doing?\" he asked politely, changing the subject.\u003c/p\u003e\n\u003cp\u003e\"I love to go to the cemetery, watch TV, and listen to music.\"\u003c/p\u003e\n\u003cp\u003e\"How about school?Do you enjoy your studies?\" Mr. Sterling wondered.\u003c/p\u003e\n\u003cp\u003e\"Not much. I\u0027d rather be homeschooled, like Alexander.\"\u003c/p\u003e\n\u003cp\u003e\"Is there a subject you are attracted to?Something that you fancy becoming?\" Mr. Sterling asked.\u003c/p\u003e\n\u003cp\u003eA vampire,I was dying to say.Like all of you. But I didn\u0027t have the guts.\u003c/p\u003e\n\u003cp\u003e\"Raven has plenty of time for questioning,\" Mrs. Sterling said. \"Let her eat.\"\u003c/p\u003e\n\u003cp\u003eJameson came in with a tray of almost too fresh meat. It was about as unappetizing as it could be. I was really too nervous to eat anyway and figured I\u0027d get my calories from the veggies.\u003c/p\u003e\n\u003cp\u003eJameson handed me a special plate-a quarter chicken fully cooked.\u003c/p\u003e\n\u003cp\u003e\"Are you sure you wouldn\u0027t prefer some of ours?\"Mrs. Sterlingasked. \"There is plenty here.\"\u003c/p\u003e\n\u003cp\u003e\"Raven prefers hers well done,\" Alexander responded. \"Be sure to try it this way, It\u0027s very addicting,\" Mrs.Sterling added.\u003c/p\u003e\n\u003cp\u003eIt was then the candlelight caught the wounds of her bite marks.\u003c/p\u003e\n\u003cp\u003eWas being vampires something Alexander\u0027s parents had wanted? Or would they resist bringing me further into the vampire world than I already was?\u003c/p\u003e\n\u003cp\u003eWe retired from the crisp night air of our backyard party to the chilly living room of the Mansion, Jameson brought in our desserts.\u003c/p\u003e\n\u003cp\u003eAbove a small fireplace was a portrait of a dashing gentleman,\u003c/p\u003e\n\u003cp\u003e\"That was my father,\" Mr. Sterling offered, noticing my stares.\u003c/p\u003e\n\u003cp\u003e\"He was very handsome,\" I said.\u003c/p\u003e\n\u003cp\u003eMr. Sterling laughed.\u003c/p\u003e\n\u003cp\u003e\"He would have been pleased to know you thought so.\"\u003c/p\u003e\n\u003cp\u003e\"This Mansion was built in honor of him,\"Mrs ,Sterling began.\"And used to its fullest. It\u0027s been a Generated by ABC Amber LIT Converter,wonderful place for Alexander, too. He has accomplished a lot here.\"\u003c/p\u003e\n\u003cp\u003e\" I\u0027llsay,\" I remarked. \"He has painted so many paintings,You could decorate the Mansion with them,\" I went on.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve seen his artwork?\" Mr. Sterling asked.\u003c/p\u003e\n\u003cp\u003e\"Yes. He won an annual arts fair contest. Didn\u0027t Alexander tell you?\"\u003c/p\u003e\n\u003cp\u003e\"No, we didn\u0027t know that,\" Mr. Sterling said.\u003c/p\u003e\n\u003cp\u003e\"Alexander, you are holding back on us,\" Mrs. Sterling said.\u003c/p\u003e\n\u003cp\u003e\"It was a picture of me,\" I gloated, \"and people said it was dead-on.\"\u003c/p\u003e\n\u003cp\u003e\"Interesting,\" Mr. Sterling said. \"So that is what you\u0027ve been doing with your spare time?\"\u003c/p\u003e\n\u003cp\u003e\"He paints all the time. He\u0027s made dozens. Have you seen them?\"\u003c/p\u003e\n\u003cp\u003eAlexander shook his head and signaled me to cut off this discussion.\u003c/p\u003e\n\u003cp\u003e\"No, Alexander doesn\u0027t share his work with us,\" said Mr. Sterling,\u003c/p\u003e\n\u003cp\u003e\"Well, why don\u0027t we bring some down?\" I offered.\u003c/p\u003e\n\u003cp\u003eSuddenly there was ice in the air.\u003c/p\u003e\n\u003cp\u003e\"Later,\" Alexander said. \"Constantineis a very busy man. He\u0027s too preoccupied with professional artists. I\u0027d rather not waste his time.\"\u003c/p\u003e\n\u003cp\u003eConstantine?Alexander called his father Constantine? \"But-\"\u003c/p\u003e\n\u003cp\u003e\"So,Raven ,\" Mr. Sterling said, changing the subject, \"Tell me about your parents.\"\u003c/p\u003e\n\u003cp\u003e\"They are just like everyone else here in town.\" Then I realized I could be accentuating their mortality. \"But they really like staying up late and they love the night. And my dad likes his steaks really rare. Growing up we watched Dracula movies together. He loves vampires.\"\u003c/p\u003e\n\u003cp\u003eThe three vampires looked straight at me. I had rambled on too far.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve finished my dessert now, Alexander,\" I said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s time I take you home,\" Alexander responded right away.\u003c/p\u003e\n\u003cp\u003eAlexander held my hand as theSterlings accompanied me to the door.\u003c/p\u003e\n\u003cp\u003eThe ghoulish, couple stood statuesque and imposing, yet mannerly.\u003c/p\u003e\n\u003cp\u003e\"It was great to meet you,\" I said sincerely. \"And thanks for dinner.\"\u003c/p\u003e\n\u003cp\u003e\"Please give our regards to your parents,\" Mr. Sterling said, and gave me a polite kiss on the cheek. It Generated by ABC Amber LIT Converter,was enough to make my frozen heart melt.\u003c/p\u003e\n\u003cp\u003e\" Yes, we must meet them,\" Mrs. Sterling said. \"We\u0027ll have Jameson set something up immediately.\"\u003c/p\u003e\n\u003cp\u003eBad idea,I wanted to say. \"I know they\u0027d be honored,\" Iuttered instead.\u003c/p\u003e\n\u003cp\u003e\"What a sweet girl,\"Mrs ,Sterling said. \"I\u0027d like to get to know you better, Raven,\" she remarked before I stepped out the door.\u003c/p\u003e\n\u003cp\u003eMy eyes lit up.\"Absolutely. I\u0027m free any time.\" The sight of Mrs. Sterling and I hanging out at the mall together would be sure to turn the town ofDullsville on its head. We\u0027d probably show up on the local news. \u003c/p\u003e","sourceLink":"https://allnovel.net/royal-blood-vampire-kisses-6/page-12.html","bookId":2145,"creation":"Oct 5, 2019 6:19:17 PM","modification":"Oct 5, 2019 6:19:17 PM"}
