{"id":96107,"no":2,"title":"Page 2","content":"\u003cp\u003eThat night, I was torn as I sat cross-legged on my beanbag chair watching reruns ofTheMunsters , Though I was anxious to finally meet Alexander\u0027s parents, I was sad the black lace curtains were being closed on our independence.\u003c/p\u003e\n\u003cp\u003eI\u0027d never felt more at home than I did hanging out in the Mansion with Alexander over the summer. It was a dream come true to get a taste of the vampire lifestyle.Waking up at sunset, celebrating the Generated by ABC Amber LIT Converter,darkness, living by candlelight. I was certain I could exist that way for an eternity.\u003c/p\u003e\n\u003cp\u003eBut our summer of love was about to end.\u003c/p\u003e\n\u003cp\u003eAlexander was right. Things were about to change. His parents would be arriving shortly, and I\u0027d be returning to school in a few days. No more late nights, no more remodeling the Mansion. Studying would replace painting, and I\u0027d be home with my parents, Alexander with his.\u003c/p\u003e\n\u003cp\u003eI switched off my TV and joined my own odd relatives downstairs in our family room. My mom was foldinglaun -dry, and my dad was filing work papers.Typical suburban parents. The exact opposite, I was sure, of Alexander\u0027s. I wondered what Alexander\u0027s parents were like. Were they ghoulishly great like Herman and Lily Munster? I recalled storiesofDullsvillian sightings of theSterlings when they first moved to town, but I\u0027d never caught a glimpse.\u003c/p\u003e\n\u003cp\u003eI was sure they had to be fantastic-everything my parents were not. Reading theTransylvanian Times instead of Dullsville\u0027sLedger.Changing into bats instead of plaid golf pants.Resting in a coffin instead of a sleigh bed.I bet they were the coolest parents in the world-or Underworld.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m finally going to meet Alexander\u0027s parents!\" I burst out to Becky the next day atHatsy\u0027s Diner. When I slunk into the booth, Becky was flipping through the tabletop jukebox and sippinga strawberry malt. A chocolate one was kindly waiting for me.\u003c/p\u003e\n\u003cp\u003eSince summer began, Becky and I had both spent time with our true loves and not as much with each other. Though I did see her occasionally, we weren\u0027t as glued together as we\u0027d been during past summers. I would have resented our separation if I didn\u0027t have a boyfriend, too. But since we were both guilty of trading lipstick for lip locks, it made it all right. I still missed my best friend and was excited to make up for lost time. I was in desperate need of some girl talk.\u003c/p\u003e\n\u003cp\u003e\"Since I met Alexander, he\u0027s been parent-free. I\u0027m not surehow this will change our relationship\", I explained to Becky.\u003c/p\u003e\n\u003cp\u003e\"Maybe it will make it better.\"\u003c/p\u003e\n\u003cp\u003e\"How?We had the whole run of the Mansion. I\u0027m sure his mother wouldn\u0027t have approved of me being its interior designer.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure they will be just fine.\"\u003c/p\u003e\n\u003cp\u003e\"What if they\u0027re really strict and Alexander can\u0027t go out at night?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t imagine that,\" Becky said. \"He lives for the night!\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll probably have to do family things now.\"\u003c/p\u003e\n\u003cp\u003e\"And chores,\" she added. \"Matt has to constantly cut the grass. I grew up on a farm-obviously I know way more than he does about a lawn mower. But I act dumb as I watch him try to figure out how to put gas in it. Then I jump in and I\u0027m all Bob Vila.\"\u003c/p\u003e\n\u003cp\u003e\"Jameson does the chores. But cutting the grass? I think they add poison to the soil.\" We both laughed. \"Besides, Alexander is responsible. He isn\u0027t like me in that way; he doesn\u0027t need to be nagged.\"\u003c/p\u003e\n\u003cp\u003e\"I think you\u0027re worrying for nothing. I\u0027m sure you\u0027ll all get along,\"\u003c/p\u003e\n\u003cp\u003eI slurped on my chocolate malt and stared off. \"I wonder if Alexander looks like his mother or his father.\"\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t you seen a picture?\"\u003c/p\u003e\n\u003cp\u003eNo. They are vampires!I wanted to say. In fact, the only images I\u0027d seen were a few portraits Alexander had painted.\u003c/p\u003e\n\u003cp\u003eThere were no family albums, no screen savers, no frames the mantel.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s different in person,\" I said instead. \"One thing is certain - I\u0027m sure they are way cooler than my parents.\"\u003c/p\u003e\n\u003cp\u003eSo many things were still new to me-having a boyfriend, discovering he was a vampire, and now meeting his vampireparents. I wondered how I\u0027d fare.\u003c/p\u003e\n\u003cp\u003eI had always prided myself on being the one to give advice to Becky, but this time she was the experienced one.\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t it strange when Matt\u0027s family is around?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Totally.He\u0027s a different person. No PDA. No holding hands. He even sits in his own chair instead of next to me on the sofa.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I\u0027m afraid of.An end to my love life.\" \"You just have to make up for it when they aren\u0027t home. Or save it for school. But Alexander doesn\u0027t go to school...\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t remind me.\"\u003c/p\u003e\n\u003cp\u003e\"So in your case plan more dates at the cemetery.\"\u003c/p\u003e\n\u003cp\u003e\"What was it like when you first met Matt\u0027s parents?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I thought it would be fancy-like meeting them at the country club. Instead I was hanging out in Matt\u0027s family room when his mom came home from work. He said, \u0027Hey, Mom, this is Becky.\u0027 And she said, \u0027Hi, Becky, nice to meet you.\u0027 Then she disappeared. And it was pretty much the same with his father. It was different when Matt came to my house,\" Becky rambled on. \"My mom made him.sit down in the kitchen and she baked him a whole apple pie. I was so embarrassed.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I remember you telling me that. But how did youfeel with Matt\u0027s parents?\"\u003c/p\u003e\n\u003cp\u003e\"I was so nervous. I thought since I don\u0027t live in the \u0027burbsthat they\u0027d view me as this unkempt farm girl. But they are always happy to see me. I\u0027m still waiting for them to give me my walking papers.\"\u003c/p\u003e\n\u003cp\u003eI stopped slurping my malt. I didn\u0027t live in a Mansion. And more important, I wasn\u0027t a vampire. I\u0027d been so focused on how Alexander said things would change. Maybe he was alluding to more than a few pewter vases. Maybe he meantme.\u003c/p\u003e\n\u003cp\u003e\"What if they don\u0027t accept me?\" I blurted out.\u003c/p\u003e\n\u003cp\u003e\"Why wouldn\u0027t they accept you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not like them.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not...\"\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003eI\u0027m not a vampire! I\u0027m a mortal. I\u0027m not even like Luna Maxwell, who came from a vampire family. InRomania , Alexander had an arranged covenant ceremony with her, but since he wasn\u0027t in love with her, he couldn\u0027t go through with it.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not what?\" Becky asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not fromRomania!\"\u003c/p\u003e\n\u003cp\u003e\"Duh,\" she said. \"I think they know that.\"\u003c/p\u003e\n\u003cp\u003e\"But maybe they want their son to date someone from Romania.\"\u003c/p\u003e\n\u003cp\u003e\"Why would they want that when they live here?\"\u003c/p\u003e\n\u003cp\u003eBecause a girl fromRomania would be like them, instead of like ... us, I wanted to say.\u003c/p\u003e\n\u003cp\u003e\"Listen, his grandmother built a mansion here. IfRomania was so great, why would she move to this town?\"\u003c/p\u003e\n\u003cp\u003e\"But his grandmother was a baroness. My grandmother is a retiree.\"\u003c/p\u003e\n\u003cp\u003e\"Alexander doesn\u0027t remind me of the snobby type.In fact, just the opposite. He\u0027s an outsider like...\"\u003c/p\u003e\n\u003cp\u003e\"Me?\"\u003c/p\u003e\n\u003cp\u003e\"Well... us,\" Becky admitted.\u003c/p\u003e\n\u003cp\u003eMaybe Becky was right. But I wasn\u0027t so easily convinced. I wasn\u0027t just from the wrong side of the tracks, I was from a different world.\u003c/p\u003e\n\u003cp\u003eBecky tapped her fork against my malt.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry. Alexander is in love with you. That\u0027s all that matters. When Mr. and Mrs. Sterling see how happy lie is, they\u0027ll be happy, too.\"\u003c/p\u003e\n\u003cp\u003eI smiled at my best friend\u0027s words.\u003c/p\u003e\n\u003cp\u003e\"See, this is why we need to hang out together more,\" I said. \"We can\u0027t let our boyfriends get in the way of our schedules-as hot as they may be.\"\u003c/p\u003e\n\u003cp\u003e\"Well, we\u0027ll get to see each other every day now that school will be starting.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t remind me. Summer is over.\"\u003c/p\u003e\n\u003cp\u003e\"Can you believe we\u0027ll be juniors?\" she asked like she\u0027d won the lottery.\u003c/p\u003e\n\u003cp\u003eBecky was lucky. She had an interest in school. Her best friend and boyfriend were by her side. I would have been excited to go back to school, too, if I were going to be seeing Alexander instead of my lifelong nuisance, Trevor Mitchell. \u003c/p\u003e","sourceLink":"https://allnovel.net/royal-blood-vampire-kisses-6/page-2.html","bookId":2145,"creation":"Oct 5, 2019 6:19:17 PM","modification":"Oct 5, 2019 6:19:17 PM"}
