{"id":96111,"no":6,"title":"Page 6","content":"\u003cp\u003eSchool days and nights passed by painfully slow sans Alexander. I tried to find comfort in Alexander\u0027s handmade bracelet, like a baby does a blanket. The wooden masterpiece remained wrapped around my wrist in the shower and during sleep, but it was no substitute for my boyfriend\u0027s arms.\u003c/p\u003e\n\u003cp\u003eI knew theSterlings hadn\u0027t seen their son for so long; perhaps they wanted him all to themselves. I didn\u0027t know too many things about them, but that much his parents and I had in common.\u003c/p\u003e\n\u003cp\u003eIt was as if I were seeing a mirage when I finally saw Alexander waiting for me at the Mansion\u0027s gate. However, he wasn\u0027t his usual loving self. He appeared distant and preoccupied, staring beyond me and off into the distance.\u003c/p\u003e\n\u003cp\u003e\"Shall we go inside?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"No-my parents are out and I\u0027d like to get some fresh air, too.\"\u003c/p\u003e\n\u003cp\u003eAlexander walked, his hands in his pockets, kicking the leafy branches with his boots. I took Alexander\u0027s arm.\u003c/p\u003e\n\u003cp\u003e\"I thought you\u0027d be glad to see me.\"\u003c/p\u003e\n\u003cp\u003e\"I am.\" He tried to perk up. \"How\u0027s school?\"\u003c/p\u003e\n\u003cp\u003e\"I have this English project and it\u0027s with Trevor. It\u0027s to formulate our ideas about career paths, since we\u0027re supposed to start thinking about college.\"\u003c/p\u003e\n\u003cp\u003e\"Do you know what you\u0027d like to become?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve known for years. But you\u0027ll need to help me a bit -or should I say, \u0027a bite.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not really a career, though...\"\u003c/p\u003e\n\u003cp\u003e\"Is a career that important?\"\u003c/p\u003e\n\u003cp\u003e\"To make money it is.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to worry about that.\"\u003c/p\u003e\n\u003cp\u003e\"Why would you say that?\" he asked, stopping by an old maple tree.\u003c/p\u003e\n\u003cp\u003e\"You live in a mansion.Duh.\"\u003c/p\u003e\n\u003cp\u003e\"You think it\u0027s that easy?\" he snapped. \"That I can justmy whatever I want?\"\u003c/p\u003e\n\u003cp\u003eI was taken aback. \"I didn\u0027t mean to offend you.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have all the money in the world.\"\u003c/p\u003e\n\u003cp\u003e\"I never said you did.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not why... why you like me, is it?\" The confident, content Alexander I\u0027d seen a few days ago was nowhere in sight.\u003c/p\u003e\n\u003cp\u003eSomething was troubling Alexander and I had to get to the root of it.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s wrong? You\u0027ve never acted like this before. You really think I like you because you live in a mansion and have a butler? Besides, I don\u0027t like you-I love you.\"\u003c/p\u003e\n\u003cp\u003eAlexander shook his head. He took my hands and drew me near.\u003c/p\u003e\n\u003cp\u003e\"So many things have changed so quickly. I just have to get things sorted out.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to save the world every day, you know.\"\u003c/p\u003e\n\u003cp\u003e\"We aren\u0027t going to be spending the time together that we once did.\"\u003c/p\u003e\n\u003cp\u003e\"I know. I\u0027m trying to deal with it, too. I get lonely and miss you like crazy. But once your parents settle in, that will change. They\u0027ll get sick of you, like my parents get sick of me.\"\u003c/p\u003e\n\u003cp\u003eAlexander cracked a smile.\u003c/p\u003e\n\u003cp\u003e\"Besides, we have time together now. I\u0027ve been waiting all day to see you. Let\u0027s talk about us.\"\u003c/p\u003e\n\u003cp\u003e\"Or not,\" he said, his bad mood slowly disappearing. \"We can talk later.\"\u003c/p\u003e\n\u003cp\u003eHe leaned against a tree outside the Mansion and kissed me.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s have some fun,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Wasn\u0027tthat fun? I thought it was.\"\u003c/p\u003e\n\u003cp\u003eAlexander led me toEvansPark . He chased me around the jungle gym until I almost fainted from exhaustion. Out of breath, I flopped down on my back and gazed up at the stars.\u003c/p\u003e\n\u003cp\u003e\"I wish every night was like this.\"\u003c/p\u003e\n\u003cp\u003e\"If they were, then we wouldn\u0027t appreciate it.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe so.But I\u0027d like to live this way forever.\"\u003c/p\u003e\n\u003cp\u003e\"On your back staring at the stars?\"\u003c/p\u003e\n\u003cp\u003e\"With you.\" I stroked Alexander\u0027s hair and he playfully kissed me. \"It\u0027s not too late,\" I said.\u003c/p\u003e\n\u003cp\u003e\"For what?\"\u003c/p\u003e\n\u003cp\u003e\"To make me like you.\"\u003c/p\u003e\n\u003cp\u003e\"Why do you have to be like me? Why can\u0027t you be like you?\"\u003c/p\u003e\n\u003cp\u003e\"Fine, have it your way. I\u0027ll be boring and mortal for the rest of my life.\"\u003c/p\u003e\n\u003cp\u003e\"You think that I find you boring because you\u0027re not a vampire?\"\u003c/p\u003e\n\u003cp\u003eI sat up. \"I\u0027m not exciting. I can\u0027t fly and I don\u0027t sleep in a coffin and except for my clothes, I guess I\u0027m pretty normal.\" I hated to admit it even to myself.\u003c/p\u003e\n\u003cp\u003e\"You are far from normal-you are extraordinary. You\u0027re free thinking, spirited, adventurous, and sometimes even dangerous. Not to mention irresistibly sexy!\"\u003c/p\u003e\n\u003cp\u003e\"Flatter me more!\" I said, and gave him a huge hug. \"Imagine if I slept in your coffin every day-not just a few weeks during summer break.\"\u003c/p\u003e\n\u003cp\u003e\"I think about it every time I close the lid,\" I realized it was hard on Alexander, too. But he didn\u0027t complain. He kept his feelings to himself, and he seemed to dwell on the positive, not brood on the negative, like I did. I still had a lot to learn from my vampire-mate, Alexander Sterling. \u003c/p\u003e","sourceLink":"https://allnovel.net/royal-blood-vampire-kisses-6/page-6.html","bookId":2145,"creation":"Oct 5, 2019 6:19:17 PM","modification":"Oct 5, 2019 6:19:17 PM"}
