{"id":25791,"no":2,"title":"CHAPTER I. THE GOLD-SEEKERS.","content":"\u0026nbsp;A dozen men, provided with rockers, were busily engaged in gathering and washing dirt, mingled with gold-dust, on the banks of a small stream in California. It was in the early days, and this party was but one of hundreds who were scattered over the new Eldorado, seeking for the shining metal which throughout the civilized world exercises a sway potent and irresistible. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n I have said there were a dozen men, but this is a mistake. One of the party was a well-grown boy of sixteen, with a good-humored and even handsome face. He was something more than good-humored, however. There was an expression[Pg 10] on his face which spoke of strength and resolution and patient endurance. The readers of \"The Young Adventurer\" will at once recognize in our young hero Tom Nelson, the oldest son of a poor New England farmer, who, finding no prospects at home, had joined the tide of emigrants pouring from all parts of the country to the land of which so many marvelous stories were told. Tom had come to work; and though he doubtless shared to some extent the extravagant anticipations of the great body of Eastern visitors who hoped to make a fortune in a year, he did not expect to succeed without hard toil.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His companions belonged to the same party with whom he had crossed the plains, under the leadership of Phineas Fletcher, a broad-shouldered Illinois farmer, who had his family with him. Next to Tom was Donald Ferguson, a grave Scotchman, and Tom\u0027s special friend; a man of excellent principles, thoroughly reliable, and held in high respect by all though not possessed of popular manners. On the other side was Lawrence Peabody, a young Boston clerk, who had[Pg 11] spent several years behind a dry-goods counter. He was soft and effeminate, with no talent for \"roughing it,\" and wholly unfitted for the hard work which he had undertaken. He was deeply disappointed in his first work at gold-hunting, having come out with the vague idea that he should pick up a big nugget within a short time that would make his fortune and enable him to go home a rich man. The practical side of gold-seeking—this washing particles of dust from the dirt of the river-bed—was in the highest degree unsatisfactory and discouraging. He was not a bad fellow; and his companions, though they laughed at him, were well disposed towards him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Among the rest, mention may be made of John Miles, Henry Scott, and Chapman, owner of a refractory donkey named after King Solomon.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Not far away from the river were the tents occupied by the miners. There was but one house, roughly built of logs. This was occupied by Captain Fletcher and his family. He had not[Pg 12] had the trouble of building it, but had found it ready for occupation, having been constructed by a previous party who had wandered farther down the river in search of richer washings. In fact, it was this building which had decided our party to remain.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There isn\u0027t much difference in places,\" said Fletcher. \"We may as well stay here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then why was it deserted?\" suggested John Miles, dubiously. \"That\u0027s rather against it, isn\u0027t it, captain?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not necessarily, Miles. You\u0027ve been on berrying parties, haven\u0027t you, when at home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Many a time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ve noticed that many of the pickers leave good places, just from love of novelty, and wander about the field, often faring worse than if they remained where they were?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s so, captain.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then let us give this place a try. We\u0027ll make more working steady in a medium place than wandering here, there, and everywhere.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n So the whole party agreed to \"give the place a try.\"[Pg 13]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There had been no brilliant success as yet, but fair luck. In six days Tom had washed out twenty-five dollars\u0027 worth of gold-dust, in spite of awkwardness and inexperience. Others had done better, but poor Lawrence Peabody had barely five dollars\u0027 worth to show. It must be said, however, that he had not averaged more than two or three hours of real labor in every twenty-four. He spent the rest of the time in wandering about aimlessly, or sitting down and watching the labors of his companions, while he enlivened them by pathetic lamentations over his unfortunate position, so far away from Boston and the refining influences of civilization.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A little transcript of a conversation between Tom and himself will throw light upon the characters of both.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is beastly work,\" sighed Peabody, resting from his by no means arduous labors, and looking over to Tom. \"I tell you, it isn\u0027t fit for a gentleman.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is rather hard to keep one\u0027s hands clean, Mr. Peabody,\" said Tom; \"but you mustn\u0027t think[Pg 14] of the present. Think of the time when you will go home, your pockets full of gold.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see any prospect of it, Tom,\" sighed Peabody. \"Here I\u0027ve been hard at work for a week, and I haven\u0027t got over five dollars\u0027 worth of dust.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have five times as much,\" said Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Some people are lucky,\" said Peabody.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You haven\u0027t worked like Tom,\" said the Scotchman, plainly. \"You haven\u0027t averaged over two hours a day, while Tom has worked eight or ten.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have worked till my back was like to break,\" said the young man from Boston. \"I am not accustomed to manual labor, Mr. Ferguson. My friend Tom has worked on a farm, while I have been engaged in mercantile pursuits. Oh, why did I leave Boston!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sure I can\u0027t guess,\" said Ferguson, dryly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never expected anything like this.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What did you expect, if I may be so bold as to inquire?\"[Pg 15]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought I should find the gold in big nuggets worth thousands of dollars apiece. I was always reading in the papers about finding them. I think it\u0027s a great shame to deceive people by such stories. I don\u0027t believe there are any nuggets.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, there are; but they are few and far between,\" said Fletcher. \"A neighbor of mine found one worth three thousand dollars. Altogether he brought home five thousand dollars, and invested it in a farm and saw-mill. He is doing a good business. When he came to California he had nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is what I should like, Captain Fletcher,\" said Tom. \"If I could only manage to carry home five thousand dollars, I could make my father comfortable for life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shouldn\u0027t be satisfied with five thousand dollars,\" said Peabody, whose ideas were lofty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How much would satisfy you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"About fifty thousand,\" said the young Bostonian, his face lighting up at the thought[Pg 16] of so large a sum.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And what would you do with it, if I may make so bold?\" asked Ferguson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I would buy a nice house at the South End, furnish it handsomely, and live in style.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you would marry?\" suggested Tom, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I probably should,\" answered Peabody, gravely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Perhaps you have the lady already selected.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who is she?\" asked John Mills. \"Come, now, Peabody, don\u0027t be bashful.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is the daughter of a Boston merchant.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Does the lady love you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We understand each other,\" answered Peabody, loftily. \"She would marry me, poor as I am, but for her purse-proud, mercenary sire. It will be a happy day when, with my pockets full of gold, I enter his presence and claim his daughter\u0027s hand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish you success, Mr. Peabody,\" said Tom. \"I hope you have no rivals.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, there is one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Are you not afraid of him?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, no; he is a fellow of no style,\" said[Pg 17] Peabody, drawing up his slender form, and looking as stylish as a very dirty shirt, muddy boots, and a soiled suit would allow.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I shall wait awhile before getting married,\" said Tom. \"I am afraid I wouldn\u0027t stand any chance with an heiress, Mr. Peabody. Do you think I can ever be stylish?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Bostonian understood Tom to be in earnest, and told him he thought in time, under proper training, he might become fairly stylish.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The conversation was interrupted by the ringing of a bell from the log-house. Mrs. Fletcher, by an arrangement with the party, prepared their meals, and thus they fared better than most of the early pioneers. Their labor gave them a good appetite, and they were more solicitous about quantity than quality. Slow as he was at his work, there was no one who exhibited greater alacrity at meal-times, than Lawrence Peabody. At such times he was even cheerful.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2973/81885.html","bookId":350,"creation":"Aug 3, 2019 4:28:28 PM","modification":"Aug 3, 2019 4:28:28 PM"}
