{"id":25813,"no":24,"title":"CHAPTER XXIII. A NEW SCHEME.","content":"\u0026nbsp;\"I see no cause for despair,\" replied Ferguson, in the same calm tone. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have not a penny left out of the two thousand dollars I had only an hour since.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I understand all that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am a ruined man,\" said the young man, despondently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t admit that. How old are you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Twenty-one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are well and strong, are you not?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, yes, I have nothing to complain of on that score.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then it appears to me that your loss is not serious. Your capital still remains.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My capital?\" repeated the young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes; your strong arms, your education, your capacity to labor.\"[Pg 216]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I shall have to begin over again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Beginning over again at your age, when, possibly, fifty years of life lie before you, is not such a serious matter. Were I in your situation,—and I am twice as old as you,—I should not thing of despairing. Don\u0027t you think it would be rather foolish for two thousand dollars, which you have been only six months in accumulating, to throw away fifty years, and all that you can make in that time, thereby bringing a life-long grief to your mother and sister?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The calm, logical tone of the Scotchman had its effect.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I see that I was about to add to one piece of folly another far greater,\" said the young man. \"I don\u0027t know who you are, sir, but I heartily thank you and your son for saving my life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is not my son, but my young friend, Thomas Nelson,\" said Ferguson. \"I am not so fortunate as to have a son.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, God bless you both, and good-night!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Excuse my persistency, but may I ask where you are going?\"[Pg 217]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am not going to repeat my folly of just now, if that is what you mean.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I did not suspect you of that; but are you sure of a bed anywhere?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; I have no money to pay for one. I shall walk the streets, or possibly lie down in some quiet place. I was accustomed to roughing it at the mines, and can do it again if necessary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tom and I have a room in which you are welcome to find a shelter. I am sorry that our bed is too narrow to hold another.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you. That will be better than to sleep in the streets. But are you not afraid to make me this offer?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why should I be?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I might rob you during the night.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You might, but you don\u0027t look like one who would so reward confidence.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right. If you had fifty thousand dollars I would not touch a dollar of it. I will accept your offer. How can I repay you for your kindness?\"[Pg 218]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There may be a way. We will talk of that this evening.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Nine o\u0027clock found the three collected in the small room which had been hired by Ferguson for himself and Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"My friend,\" said Ferguson, \"you told us that you found a favorable place for mining up in the Sierras.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, I \u0027struck it rich.\u0027\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I take it for granted that you did not exhaust the wealth of the place?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Far from it. I only dipped into it. There is abundance left.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is this place known to many?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"To only one, so far as I know. He and I worked independently, but were company for each other.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But what induced you to leave so rich a claim?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was tired of working, and wanted to come to the city for a change. You know what a change I have experienced here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you go back and start anew in[Pg 219] the place where you met with your former good fortune?\" asked Ferguson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because I am penniless. I must find something to do here for a while. When I have got together a little fund, sufficient for the purpose, I will go back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would you go back now, if you had the chance?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would I? Certainly I would, for I could make money faster there than here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would you have any objection to let Tom and myself accompany you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not the least. I should be glad of your company. There is gold enough for us all.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then we will start to-morrow, that is, if you and Tom are willing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am ready,\" said Tom, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But I have nothing. I don\u0027t like to be an expense to you,\" objected the young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We will pay your expenses. We shall be more than recompensed by the richness of the mines. We might find something to do here, but both Tom and myself prefer the freedom of the[Pg 220] mining camp, and, if the spot is as rich as you have led us to suspect, we shall make more money there.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Agreed!\" said the young man, promptly. \"Name the hour of starting, and rely upon me to be ready.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ferguson was evidently well pleased with this response. He felt that his new acquaintance would be so far away from the city, and would sooner retrieve his fortunes at the mines. He hoped, too, to find opportunity to strengthen his principles, and guard him against the temptations of the city when he should again visit it. Again, he had reason to think that the arrangement would benefit Tom and himself in a pecuniary way, and the Scotchman was by no means indifferent to that consideration; though, as we have seen, he did not unduly exalt the power or value of money.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom, too, was pleased with the prospect. He was grateful and attached to Ferguson, whom he felt to be a true friend, but he was glad to have another companion nearer his own age. The young man was of a prepossessing exterior, and[Pg 221] when he had shaken off his present disquietude looked as if he might be a cheerful and agreeable companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Since we are to live together, for a time at least, and become fellow-workers,\" said Ferguson, \"we ought to know each other better. I will introduce myself first.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Hereupon Ferguson gave a brief account of himself, which need not be repeated, and then called upon Tom, who followed his example.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now it is my turn,\" said their new acquaintance. \"You don\u0027t even know my name yet, though you have done me such an important service. I have already told you that I am from Ohio. My name is Richard Russell, though my friends generally call me Dick. My father, whom I had the misfortune to lose several years since, was at one time a member of Congress. He left a small property, the income of which is barely sufficient to provide my mother and sister with the comforts of life. I had a fair education, including enough Latin and Greek to fit me for entering college. My mother desired me to enter; but I knew[Pg 222] that she could not keep me there without practicing pinching economy, and I secured a place with a small salary in a business house in Cincinnati. A year since, when the papers were full of the gold discoveries on this coast, I was seized, like so many others, with the golden fever, and arranged to start overland. It would have proved a wise step had I not been so rash a fool as to squander my earnings; for two thousand dollars in six months compare very favorably with twelve dollars a week, which I was earning at home. I might have gone home by the next steamer, and had money enough to carry me through a course of legal study, had I desired. I am out of patience with myself when I think of how I have thrown away my good fortune.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Don\u0027t think too much of the past, which cannot be recalled. Resolve not to repeat your folly, and all may yet be well.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have fully resolved upon that,\" said Russell, earnestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you think you shall study law, if you are again fortunate, Mr. Russell?\" asked Tom.[Pg 223]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If you please don\u0027t call me Mr. Russell, unless you want me to call you Mr. Nelson. Call me Dick.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will,\" said Tom, smiling, \"for I am not ready to be called Mr. Nelson yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now, to answer your question: if I can get two thousand dollars together again, I shall probably study law. Of course I don\u0027t mean to be a miner all my life any more than you. Now, Tom, what are your plans?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I think I should like to be a lawyer, too, but I must earn more than two thousand dollars first.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Two thousand ought to be sufficient to educate you if you are economical.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It would be, but I want to pay off a mortgage on my father\u0027s farm before I begin to lay up money for myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are a good fellow, Tom, and I wish you success.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, Dick. I will succeed if hard work can bring success.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Good-night to you both,\" said Ferguson. \"I[Pg 224] want to sleep well to prepare myself for starting to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In half an hour all three were sleeping soundly.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2973/81907.html","bookId":350,"creation":"Aug 3, 2019 4:28:28 PM","modification":"Aug 3, 2019 4:28:28 PM"}
