{"id":25818,"no":29,"title":"CHAPTER XXVIII. A RICH DEPOSIT.","content":"\u0026nbsp;About the middle of the next forenoon Tom suddenly stopped work. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter, Tom? Are you tired?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, but I feel like exploring a little. Who goes with me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not I,\" answered Ferguson. \"Let well enough alone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll go with you,\" said Russell. \"I should like a holiday. Besides, we may discover something.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027A rolling stone gathers no moss,\u0027\" said Ferguson.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"True, but there\u0027s another proverb: \u0027All work and no play makes Jack a dull boy.\u0027 Tom and I will try a little play.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The two friends sauntered away in an idle mood; yet, combining business with pleasure, they[Pg 258] watched carefully the surface indications, ready to avail themselves of any that were favorable.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a strange life we are leading, Tom,\" said Russell. \"It is free, and independent, and healthful; but I shouldn\u0027t like to live so all my life.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Nor I,\" answered Tom. \"No amount of gold would repay me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Because gold is only valuable for what it will bring. Here it brings nothing.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Except the hope of future ease and comfort,\" suggested Tom.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course; that is what we are working for. We have made a good beginning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Dick. I have almost accomplished what I have had in view ever since I left home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know. You mean paying off your father\u0027s mortgage.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s it. It amounts to twenty-two hundred dollars, and I have but a few hundred dollars more to earn. I would stay here a month or two longer, if my clothes would hold together; but I can\u0027t risk it.\"[Pg 259]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You need rest, at any rate, Tom, leaving clothes out of the question.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke, Tom, without special thought, drove his pick into the ground. It was a lucky inspiration. Some shining particles attracted the attention of Russell.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tom,\" he exclaimed, in excitement, \"do you see that, and that? I believe you\u0027ve struck a bonanza.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Upon that both set to work in earnest. A further investigation showed that Russell was right. Tom, by good luck, had chanced upon a deposit of far greater richness than any they had yet encountered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If it holds out, our fortunes are made, Tom,\" said Russell. \"Go and call Ferguson, and I will remain on guard till you come back.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom stood not on the order of his going, but went at once.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s the matter, Tom?\" asked the Scotchman, as, panting and breathless, Tom stood before him. \"Has anything happened to Russell?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; it\u0027s good news—splendid news, Mr.[Pg 260] Ferguson. We\u0027ve found a place ten times as rich as this. Come at once, and see.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ferguson made preparations to accompany Tom with what seemed to our hero to be provoking deliberation. In truth the Scotchman, with his national caution, was rather skeptical as to Tom\u0027s news, and did not suffer himself to become enthusiastic or excited. Tom had hard work to accommodate his impatient steps to the measured pace of his more sedate companion. When at length they reached the spot they found Russell no less impatient.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thought you would never come,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tom wanted to fly,\" said Ferguson; \"but I am too old for that. Now, what is it you have found?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When he was shown what had been discovered he admitted that it was very promising.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If it holds out, we shall be lucky,\" he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It will hold out,\" said Russell, enthusiastically.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It isn\u0027t well to be too confident,\" said Ferguson, cautiously.[Pg 261]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are very cold-blooded, Mr. Ferguson,\" said Russell, impatiently. \"Won\u0027t anything excite you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What good would it do to become excited?\" returned the Scotchman. \"I am as ready to test the matter as you are, and I shall rejoice if your sanguine expectations are realized. Do not expect too much, however, and you will guard against possible disappointment.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But there was no disappointment awaiting them. They worked steadily for two weeks, with marvelous results. In this time they unearthed six thousand dollars\u0027 worth of gold, which by arrangement they divided equally between them; and still the gold deposit was far from being exhausted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At the end of the fortnight they were visited by a party of capitalists from San Francisco, who were out on an exploring expedition. They recognized the richness of the new discoveries, and after some negotiation offered the three friends ten thousand dollars for their claims. One consideration decided them to accept. It was absolutely necessary for[Pg 262] them to go to the city for clothing and other articles, of which they stood in imperative need. They closed the bargain and started on their return.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2973/81912.html","bookId":350,"creation":"Aug 3, 2019 4:28:28 PM","modification":"Aug 3, 2019 4:28:28 PM"}
