{"id":3032,"no":11,"title":"chapter 11","content":"After bright warm weather came a spell of wet; all May it rained and was cold. The sound of the millwheels and of the rain disposed one to indolence and slumber. The floor trembled, there was a smell of flour, and that, too, induced drowsiness. My wife in a short fur-lined jacket, and in men’s high golosh boots, would make her appearance twice a day, and she always said the same thing:\n\u003cbr\u003e \n\u003cbr\u003e “And this is called summer! Worse than it was in October!”\n\u003cbr\u003e \n\u003cbr\u003e We used to have tea and make the porridge together, or we would sit for hours at a stretch without speaking, waiting for the rain to stop. Once, when Stepan had gone off to the fair, Masha stayed all night at the mill. When we got up we could not tell what time it was, as the rainclouds covered the whole sky; but sleepy cocks were crowing at Dubetchnya, and landrails were calling in the meadows; it was still very, very early. . . . My wife and I went down to the millpond and drew out the net which Stepan had thrown in over night in our presence. A big pike was struggling in it, and a cray-fish was twisting about, clawing upwards with its pincers.\n\u003cbr\u003e \n\u003cbr\u003e “Let them go,” said Masha. “Let them be happy too.”\n\u003cbr\u003e \n\u003cbr\u003e Because we got up so early and afterwards did nothing, that day seemed very long, the longest day in my life. Towards evening Stepan came back and I went home.\n\u003cbr\u003e \n\u003cbr\u003e “Your father came today,” said Masha.\n\u003cbr\u003e \n\u003cbr\u003e “Where is he?” I asked.\n\u003cbr\u003e \n\u003cbr\u003e “He has gone away. I would not see him.”\n\u003cbr\u003e \n\u003cbr\u003e Seeing that I remained standing and silent, that I was sorry for my father, she said:\n\u003cbr\u003e \n\u003cbr\u003e “One must be consistent. I would not see him, and sent word to him not to trouble to come and see us again.”\n\u003cbr\u003e \n\u003cbr\u003e A minute later I was out at the gate and walking to the town to explain things to my father. It was muddy, slippery, cold. For the first time since my marriage I felt suddenly sad, and in my brain exhausted by that long, grey day, there was stirring the thought that perhaps I was not living as I ought. I was worn out; little by little I was overcome by despondency and indolence, I did not want to move or think, and after going on a little I gave it up with a wave of my hand and turned back.\n\u003cbr\u003e \n\u003cbr\u003e The engineer in a leather overcoat with a hood was standing in the middle of the yard.\n\u003cbr\u003e \n\u003cbr\u003e “Where’s the furniture? There used to be lovely furniture in the Empire style: there used to be pictures, there used to be vases, while now you could play ball in it! I bought the place with the furniture. The devil take her!”\n\u003cbr\u003e \n\u003cbr\u003e Moisey, a thin pock-marked fellow of twenty-five, with insolent little eyes, who was in the service of the general’s widow, stood near him crumpling up his cap in his hands; one of his cheeks was bigger than the other, as though he had lain too long on it.\n\u003cbr\u003e \n\u003cbr\u003e “Your honour was graciously pleased to buy the place without the furniture,” he brought out irresolutely; “I remember.”\n\u003cbr\u003e \n\u003cbr\u003e “Hold your tongue!” shouted the engineer; he turned crimson and shook with anger . . . and the echo in the garden loudly repeated his shout.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/mingren/985/29724.html","bookId":118,"creation":"Aug 1, 2019 4:18:26 AM","modification":"Aug 1, 2019 4:18:26 AM"}
