{"id":110137,"no":13,"title":"Page 13","content":"\u003cp\u003eTHIRTEEN\u003c/p\u003e\n\u003cp\u003eA NEST OF VILLAINS\u003c/p\u003e\n\u003cp\u003eEdmund. Edmund would have to be dealt with, forces turned on him, and I fought the urge to find the black-hearted fiend and thread one of my throwing daggers between his ribs, but a plan was already in place, or one of sorts, and I still held the purse with the two remaining puffballs the witches had given me. I swallowed my anger and led Drool into the castle.\u003c/p\u003e\n\u003cp\u003e\"\u0027Lo, Pocket! Is that you, lad?\" A Welsh accent. \"Is the king with you?\"\u003c/p\u003e\n\u003cp\u003eI saw the top of a man\u0027s head sticking through the stocks set in the middle of the courtyard. His hair was dark and long and hung in his face. I approached and bent down to see who it was.\u003c/p\u003e\n\u003cp\u003e\"Kent? You\u0027ve found yourself a cruel collar.\"\u003c/p\u003e\n\u003cp\u003e\"Call me Caius,\" said the old knight. \"Is the king with you?\"\u003c/p\u003e\n\u003cp\u003eThe poor fellow couldn\u0027t even look up.\u003c/p\u003e\n\u003cp\u003e\"Aye. On his way. The men are stabling their horses in the town. How came you to be in the stocks?\"\u003c/p\u003e\n\u003cp\u003e\"I tangled with that whoreson Oswald, Goneril\u0027s steward. Cornwall judged me the offender and had me thrown in the stocks. I\u0027ve been here since last evening.\"\u003c/p\u003e\n\u003cp\u003e\"Drool, fetch some water for this good knight,\" said I. The giant loped off to find a bucket. I walked around behind Kent, patted him lightly on his bottom.\u003c/p\u003e\n\u003cp\u003e\"You know, Kent, er - Caius, you are a very attractive man.\"\u003c/p\u003e\n\u003cp\u003e\"You rascal, Pocket, I\u0027ll not be buggered by you.\"\u003c/p\u003e\n\u003cp\u003eI smacked his bottom again, dust rose from his trousers. \"No, no, no, not me. Not my cup of tea. But Drool, now he\u0027d shag the night if he wasn\u0027t afraid of the dark. And hung like an ox, that one is. I suspect you\u0027ll extrude stools untapered for a fortnight once Drool\u0027s laid the bugger to ya. Supper\u0027ll dump through you like a cherry pit out a church bell.\"\u003c/p\u003e\n\u003cp\u003eDrool was returning now carrying a wooden bucket and a dipper across the courtyard.\u003c/p\u003e\n\u003cp\u003e\"No! Stop!\" shouted Kent. \"Villainy! Violation! Stop these fiends!\"\u003c/p\u003e\n\u003cp\u003eGuards were looking down from the walls. I scooped a dipper of water from the bucket and threw it in Kent\u0027s face to calm him. He sputtered and struggled against the stocks.\u003c/p\u003e\n\u003cp\u003e\"Easy, good Kent, I was just having you on. We\u0027ll get you out of there as soon as the king arrives.\" I held the dipper for the knight and he drank deeply.\u003c/p\u003e\n\u003cp\u003eWhen he finished he gasped, \"Christ\u0027s codpiece, Pocket, why\u0027d you go on like that?\"\u003c/p\u003e\n\u003cp\u003e\"Pure evil incarnate, I reckon.\"\u003c/p\u003e\n\u003cp\u003e\"Well, stop it. It doesn\u0027t suit you.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m working on the fit,\" said I.\u003c/p\u003e\n\u003cp\u003eLear came through the gatehouse seconds later, flanked by Captain Curan and another older knight. \"What\u0027s this?\" asked the king. \"My messenger in stocks! How came this to be? Who put you here, man?\"\u003c/p\u003e\n\u003cp\u003e\"Your daughter and son-in-law, sire,\" said Kent.\u003c/p\u003e\n\u003cp\u003e\"No. By Jupiter\u0027s beard, I say, no,\" said Lear.\u003c/p\u003e\n\u003cp\u003e\"Aye, by St. Cardomon\u0027s scaly feet[35] I say, aye,\" said Kent.\u003c/p\u003e\n\u003cp\u003e\"By the flapping foreskin of Freya, I say, bugger all!\" said Jones.\u003c/p\u003e\n\u003cp\u003eAnd they looked at the puppet, confident on his stick.\u003c/p\u003e\n\u003cp\u003e\"Thought we was swearing by whatever we could come up with,\" said the puppet. \"Do go on.\"\u003c/p\u003e\n\u003cp\u003e\"I say no,\" continued Lear. \"\u0027Tis worse than murder, to treat a messenger of the king so. Where is my daughter?\"\u003c/p\u003e\n\u003cp\u003eThe old king stormed through the inner gate, followed by Captain Curan and a dozen other knights from his train who had come into the castle.\u003c/p\u003e\n\u003cp\u003eDrool sat down in the dirt, splay-legged, his face even with Kent\u0027s, and said, \"So, how\u0027ve you been?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m in the stocks,\" said Kent. \"Locked like this overnight.\"\u003c/p\u003e\n\u003cp\u003eDrool nodded, starting a string of his namesake down his chin. \"So, not so good, then?\"\u003c/p\u003e\n\u003cp\u003e\"Nay, lad,\" said Kent.\u003c/p\u003e\n\u003cp\u003e\"Better now that Pocket is here to save us, innit?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, I\u0027m a rescue in progress. Didn\u0027t see any keys in there when you were getting the water?\"\u003c/p\u003e\n\u003cp\u003e\"No. No keys,\" said Drool. \"They\u0027ve a laundress with smashing knockers works by the well sometimes, but she won\u0027t have a laugh with you. I asked her. Five times.\"\u003c/p\u003e\n\u003cp\u003e\"Drool, you mustn\u0027t just go asking that sort of thing without some prelude,\" said I.\u003c/p\u003e\n\u003cp\u003e\"I said [please],\" said Drool.\u003c/p\u003e\n\u003cp\u003e\"Well done, then, glad you\u0027ve kept your manners in the face of so much villainy.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you, kind sir,\" said Drool in Edmund the bastard\u0027s voice, pitch-perfect, dripping with evil.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s un-bloody-settling,\" said Kent. \"Pocket, think you could see about liberating me? I lost feeling in my hands a good hour ago and it won\u0027t go well for holding a sword if they have to be cut off from gangrene.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, I\u0027ll see to it,\" said I. \"Let Regan vent some venom on her father, then I\u0027ll go see her for the key. She quite fancies me, you know?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve weed on yourself, ain\u0027t ya?\" said Drool, back in his own voice, but with a bit of a Welsh accent, no doubt to comfort the disguised Kent.\u003c/p\u003e\n\u003cp\u003e\"Hours ago, and twice since,\" said Kent.\u003c/p\u003e\n\u003cp\u003e\"I does that sometime in the night, when it\u0027s cold or it\u0027s too far to the privy.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just old and my bladder\u0027s shrunk to the size of a walnut.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve started a war,\" said I, since we seemed to be sharing privacies.\u003c/p\u003e\n\u003cp\u003eKent struggled in the stocks to look at me. \"What\u0027s this? From key - to wee - to, \u0027I\u0027ve started a bloody war,\u0027 without so much as a by-your-leave? I\u0027m bewildered, Pocket.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, which concerns me, as you lot are my army.\"\u003c/p\u003e\n\u003cp\u003e\"Smashing!\" said Drool.\u003c/p\u003e\n\u003cp\u003eThe Earl of Gloucester came himself to release Kent. \"I\u0027m sorry, good man. You know I would not have allowed this, but once Cornwall has set his mind...\"\u003c/p\u003e\n\u003cp\u003e\"I heard you try,\" said Kent. The two had been friends in a former life, but now, Kent, lean and dark-haired, looked younger and more than a measure dangerous, while the weeks had weighed like years on Gloucester. He was near feeble, and struggled with the heavy key to the stocks. I took it from him gently and worked the lock.\u003c/p\u003e\n\u003cp\u003e\"And you, fool, I\u0027ll not have you chiding Edmund for his bastardy.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s no longer a bastard, then? You married his mother. Congratulations, good earl.\"\u003c/p\u003e\n\u003cp\u003e\"No, his mother is long dead. His legitimacy comes from the treachery of my other son, Edgar, who betrayed me.\"\u003c/p\u003e\n\u003cp\u003e\"How so?\" I asked, knowing full well how.\u003c/p\u003e\n\u003cp\u003e\"He planned to take my lands from me and hasten me to the grave.\"\u003c/p\u003e\n\u003cp\u003eThis was not what I had written in the letter. Certainly, the lands would be forfeit, but there had been no mention of murder of the old man. This was Edmund\u0027s doing.\u003c/p\u003e\n\u003cp\u003e\"What have you done to anger our father?\" said Drool, pitch-perfect in Edmund\u0027s voice.\u003c/p\u003e\n\u003cp\u003eWe all turned and stared at the great oaf, the wrong-sized voice coming from his cavernous mouth.\u003c/p\u003e\n\u003cp\u003e\"I have done nothing,\" said Drool in another voice.\u003c/p\u003e\n\u003cp\u003e\"Edgar?\" said Gloucester.\u003c/p\u003e\n\u003cp\u003eIndeed, it was Edgar\u0027s voice. I tensed at what might come next.\u003c/p\u003e\n\u003cp\u003e\"Arm yourself and hide,\" the bastard\u0027s voice said. \"Father has it in his mind that you have committed some offense, and he has ordered guards to seize you.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" said Gloucester. \"What dodgy magic is this?\"\u003c/p\u003e\n\u003cp\u003eThen the bastard\u0027s voice again: \"I have consulted the constellations, and they foretell of our father going mad and hunting you - \"\u003c/p\u003e\n\u003cp\u003eAt that point I clamped my hand over Drool\u0027s mouth.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s nothing, my lord,\" said I. \"The Natural is not right in his mind. Fever, methinks. He mimics voices but not intent. His thoughts are a jumble.\"\u003c/p\u003e\n\u003cp\u003e\"But those were the very voices of my sons,\" said Gloucester.\u003c/p\u003e\n\u003cp\u003e\"Aye, but only in sound. Only in sound. Like a jabbering bird is the great fool. If you have quarters where I might take him - \"\u003c/p\u003e\n\u003cp\u003e\"And the king\u0027s most favored fool, and abused servant,\" added Kent, rubbing at the rash on his wrists left from the stocks.\u003c/p\u003e\n\u003cp\u003eGloucester considered a moment. \"You, good fellow, have been wrongly punished. Goneril\u0027s steward Oswald is less than honorable. And while I find it a mystery, Lear does love his Black Fool. There\u0027s an unused solar in the north tower. It leaks, but it will be out of the wind and close to your master, who will have quarters in the same wing.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, thank you, good lord,\" said I. \"The Natural needs tending. We\u0027ll wrap him in blankets then I\u0027ll run down to the chemist for a leech.\"\u003c/p\u003e\n\u003cp\u003eWe hustled Drool into the tower and Kent closed the heavy door and bolted it. There was one cathedral window with cracked shutters and two arrow loops, all set in alcoves, with tapestries pulled aside and tied to allow in the little light. We could see our breath in the winter air.\u003c/p\u003e\n\u003cp\u003e\"Drop those tapestries,\" said Kent.\u003c/p\u003e\n\u003cp\u003e\"Well, go grab some candles first,\" said I. \"It\u0027ll be dark as Nyx\u0027s[36] bunghole once we pull the tapestries.\"\u003c/p\u003e\n\u003cp\u003eKent left the solar and returned a few minutes later with a heavy iron candelabra with three lit candles. \"A chambermaid is bringing us a brazier of charcoal and some bread and ale,\" said the knight. \"Old Gloucester\u0027s a good sod.\"\u003c/p\u003e\n\u003cp\u003e\"And survivor enough not to speak his mind to the king about his daughters,\" said I.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve learned some,\" said Kent.\u003c/p\u003e\n\u003cp\u003e\"Aye.\" I turned to the Natural, who was playing with the wax dripping off the thick candles. \"Drool, what was it you were saying? That bit with Edmund and Edgar plotting.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know, Pocket. I just says it, I don\u0027t know what\u0027s said. But Lord Edmund beats me when I talk in his voice. I\u0027m an insult to nature and should be punished, says he.\"\u003c/p\u003e\n\u003cp\u003eKent shook his head like a great hound clearing his ears of water. \"What sort of convoluted wickedness have you set in motion, Pocket?\"\u003c/p\u003e\n\u003cp\u003e\"Me? This isn\u0027t my doing, this villainy is authored by that blackguard Edmund. But it will work for our plan. The conversations between Edgar and Edmund lie on the shelves of Drool\u0027s mind like forgotten volumes in a library, we need only prompt the git to open them. Now, to it. Drool, say the words of Edgar when Edmund advises him to hide.\"\u003c/p\u003e\n\u003cp\u003eAnd so we pried events out of Drool\u0027s memory using cues like a cat\u0027s paw,[37] and by the time we had warmed ourselves over the brazier and eaten our bread, we saw the pieces of Edmund\u0027s treachery played out as in the voices of the original players.\u003c/p\u003e\n\u003cp\u003e\"So Edmund wounded himself and claimed that Edgar did it,\" said Kent. \"Why didn\u0027t he simply slay his brother?\"\u003c/p\u003e\n\u003cp\u003e\"He needs to assure his inheritance first, and a knife to the back would have been suspect,\" said I. \"Besides, Edgar is a formidable fighter - I don\u0027t think Edmund would face him.\"\u003c/p\u003e\n\u003cp\u003e\"A traitor and a coward,\" said Kent.\u003c/p\u003e\n\u003cp\u003e\"And those are his assets,\" said I. \"Or we shall use them thus.\" I patted Drool\u0027s shoulder softly. \"Good lad, excellent fool-craft. Now, I need you to see if you can say what I say in the voice of the bastard.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, Pocket, I\u0027ll give it a go.\"\u003c/p\u003e\n\u003cp\u003eI said, \"Oh, my sweet lady Regan, thou art more fair than moonlight, more radiant than the sun, more glorious than all the stars. I must have you or I shall surely die.\"\u003c/p\u003e\n\u003cp\u003eIn a wink Drool repeated my words back to me in the voice of Edmund of Gloucester, the intonation and desperation in the perfect key to unlock Regan\u0027s affections, or so I\u0027d wager.\u003c/p\u003e\n\u003cp\u003e\"Howzat?\" asked the git.\u003c/p\u003e\n\u003cp\u003e\"Excellent,\" said I.\u003c/p\u003e\n\u003cp\u003e\"Uncanny,\" said Kent. \"How is it that Edmund let the Natural live? He must know he bears witness to his treachery.\"\u003c/p\u003e\n\u003cp\u003e\"That is an excellent question. Let\u0027s go ask him, shall we?\"\u003c/p\u003e\n\u003cp\u003eIt occurred to me, as we made our way to Edmund\u0027s quarters, that since I had seen the bastard, the power of my protection, being King Lear, had waned somewhat, while Edmund\u0027s influence, and therefore immunity, had expanded when he became heir to Gloucester. In short, the deterrents to keep the bastard from murdering me had all but evaporated. I had only Kent\u0027s sword and Edmund\u0027s fear of ghostly retribution to protect me. The witches\u0027 pouch of puffballs weighed heavily as a weapon, however.\u003c/p\u003e\n\u003cp\u003eA squire showed me to an antechamber off Castle Gloucester\u0027s great hall.\u003c/p\u003e\n\u003cp\u003e\"His lordship will receive only you, fool,\" said the squire.\u003c/p\u003e\n\u003cp\u003eKent looked ready to bully the boy but I held up a hand to stay him. \"I\u0027ll see that the door is left unlatched, good Caius. If I should call, please enter and dispatch the bastard with lethal vigor.\"\u003c/p\u003e\n\u003cp\u003eI grinned at the spot-faced squire. \"Unlikely,\" said I. \"Edmund holds me in very high esteem and I him. There will be little time between compliments to discuss business.\" I breezed by the young knight and into the chamber where Edmund was alone, sitting at a writing desk.\u003c/p\u003e\n\u003cp\u003eI said, \"Thou scaly scalawag of a corpse-gorged carrion worm, cease your feast on the bodies of your betters and receive the Black Fool before vengeful spirits come to wrench the twisted soul from your body and drag it into the darkest depths of hell for your treachery.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, well spoken, fool,\" said Edmund.\u003c/p\u003e\n\u003cp\u003e\"You think so?\"\u003c/p\u003e\n\u003cp\u003e\"Oh yes, I\u0027m cut to the quick. I may never recover.\"\u003c/p\u003e\n\u003cp\u003e\"Completely impromptu,\" said I. \"With time and polish - well, I could go out and return with a keener edge on it.\"\u003c/p\u003e\n\u003cp\u003e\"Perish the thought,\" said the bastard. \"Take a moment to catch your breath and revel in your rhetorical mastery and achievement.\" He gestured toward a high-backed chair across from him.\u003c/p\u003e\n\u003cp\u003e\"Thank you, I will.\"\u003c/p\u003e\n\u003cp\u003e\"Still tiny, though, I see,\" said the bastard.\u003c/p\u003e\n\u003cp\u003e\"Well, yes, Nature being the recalcitrant twat that she is - \"\u003c/p\u003e\n\u003cp\u003e\"And still weak, I presume?\"\u003c/p\u003e\n\u003cp\u003e\"Not of will.\"\u003c/p\u003e\n\u003cp\u003e\"Of course not, I referred simply to your willowy limbs.\"\u003c/p\u003e\n\u003cp\u003e\"Oh yes, in that case, I\u0027m a bit of a soggy kitten.\"\u003c/p\u003e\n\u003cp\u003e\"Splendid. Here to be murdered then, are you?\"\u003c/p\u003e\n\u003cp\u003e\"Not immediately. Uh, Edmund, if you don\u0027t mind my saying, you\u0027re being off-puttingly pleasant today.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you. I\u0027ve adopted a strategy of pleasantness. It turns out that one can perpetrate all manner of heinous villainy under a cloak of courtesy and good cheer.\" Edmund leaned over the desk now, as if to take me into his most intimate confidence. \"It seems a man will forfeit all sensible self-interest if he finds you affable enough to share your company over a flagon of ale.\"\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re being pleasant?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s unseemly.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003e\"So, you\u0027ve received the dispatch from Goneril?\"\u003c/p\u003e\n\u003cp\u003e\"Oswald gave it to me two days ago.\"\u003c/p\u003e\n\u003cp\u003e\"And?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Evidently the lady fancies me.\"\u003c/p\u003e\n\u003cp\u003e\"And how do you feel about that?\"\u003c/p\u003e\n\u003cp\u003e\"Well, who could blame her, really? Especially now that I\u0027m both pleasant and handsome.\"\u003c/p\u003e\n\u003cp\u003e\"I should have cut your throat when I had the chance,\" said I.\u003c/p\u003e\n\u003cp\u003e\"Ah, well, water under the bridge, isn\u0027t it? Excellent plan, with the letter to discredit my brother Edgar, by the way. Went smashingly. Of course I embellished somewhat. Improvised, if you will.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" said I. \"Implied patricide and the odd self-inflicted wound.\" I nodded toward his bandaged sword arm.\u003c/p\u003e\n\u003cp\u003e\"Oh yes, the Natural talks to you, doesn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003e\"Curious, then. Why is that bloody great oaf still drawing breath, knowing what he does about your plans. Fear of ghosts, is it?\"\u003c/p\u003e\n\u003cp\u003eFor the first time Edmund let his pleasant and insincere grin falter. \"Well, there is that, but also, I quite enjoy beating him. And when I\u0027m not beating him, having him around makes me feel more clever.\"\u003c/p\u003e\n\u003cp\u003e\"You simple bastard, Drool makes anvils feel more clever. How bloody common of you.\"\u003c/p\u003e\n\u003cp\u003eThat did it. Pretense of pleasantness fell when it came to questions of class, evidently. Edmund\u0027s hand dropped below the table and came up with a long fighting dagger. But alas, I was already in the process of swinging down hard with Jones\u0027s stick end and struck the bastard on his bandaged forearm. The blade went spinning in such a way that I was able to kick the hilt as it hit the floor and flip it up into my own waiting weapon hand. (To be fair, that is right or left, whether it was the juggling or the pickpocket training of Belette, I am agile with either hand.)\u003c/p\u003e\n\u003cp\u003eI flipped the blade and held it ready for a throw. \"Sit! You\u0027re exactly a half-turn from hell, Edmund. Do twitch. Please do.\" He\u0027d seen me perform with my knives at court and knew my skill.\u003c/p\u003e\n\u003cp\u003eThe bastard sat, cradling his hurt arm as he did so. Blood was seeping through the bandage.\u003c/p\u003e\n\u003cp\u003eHe spat at me, and missed. \"I\u0027ll have you - \"\u003c/p\u003e\n\u003cp\u003e\"Ah, ah, ah,\" said I, brandishing the blade. \"Pleasant.\"\u003c/p\u003e\n\u003cp\u003eEdmund growled, but stopped as Kent stormed into the room, knocking the door back on its hinges. His sword was drawn and two young squires were drawing theirs as they followed him. Kent turned and smashed the lead squire in the forehead with the hilt of his own weapon, knocking the boy backward off his feet, quite unconscious. Then Kent spun and swept the feet out from under the other with the flat of his sword and the lad landed on his back with an explosion of breath. The old knight drew back to thrust through the squire\u0027s heart.\u003c/p\u003e\n\u003cp\u003e\"Hold!\" said I. \"Don\u0027t kill him!\"\u003c/p\u003e\n\u003cp\u003eKent held and looked up, assessing the situation for the first time.\u003c/p\u003e\n\u003cp\u003e\"I heard a blade clang. I thought the villain was murdering you.\"\u003c/p\u003e\n\u003cp\u003e\"No. He gave me this lovely dragon-hilted dagger as a peace offering.\"\u003c/p\u003e\n\u003cp\u003e\"That is not true,\" said the bastard.\u003c/p\u003e\n\u003cp\u003e\"So,\" said Kent, paying particular attention to my readied weapon, \"you\u0027re murdering the bastard, then?\"\u003c/p\u003e\n\u003cp\u003e\"Merely testing the weapon\u0027s balance, good knight.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, sorry.\"\u003c/p\u003e\n\u003cp\u003e\"No worries. Thank you. I\u0027ll call you if I need you. Take that unconscious one with you, would you?\" I looked at the other, who trembled on the floor. \"Edmund, do instruct your knights to be pleasant toward my ruffian. He is a favorite of the king.\"\u003c/p\u003e\n\u003cp\u003e\"Let him alone,\" grumbled Edmund.\u003c/p\u003e\n\u003cp\u003eKent and the conscious squire dragged the other one out of the chamber and closed the door.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right, this being pleasant is the dog\u0027s bollocks, Edmund.\" I flipped the dagger and caught it by the hilt. When Edmund made as if to move, I flipped it again and caught it by the blade. I raised a suspicious eyebrow at him. \"So, you were saying about how well my plan had worked.\"\u003c/p\u003e\n\u003cp\u003e\"Edgar is branded a traitor. Even now my father\u0027s knights hunt him. I will be lord of Gloucester.\"\u003c/p\u003e\n\u003cp\u003e\"But, really, Edmund, is that enough?\"\u003c/p\u003e\n\u003cp\u003e\"Exactly,\" said the bastard.\u003c/p\u003e\n\u003cp\u003e\"Uh, exactly what?\" Had he already set his sights on Albany\u0027s lands, not even having spoken with Goneril? Now I was doubly unsure of what to do. My own plan to pair the bastard with Goneril and undermine the kingdom was the only thing keeping me from sending the dagger to his throat, and when I thought of the lash marks on poor Drool\u0027s back my hand quivered, wanting to loose the knife to its mark. But what had he set his sights on?\u003c/p\u003e\n\u003cp\u003e\"The spoils of war can be as great as a kingdom,\" said Edmund.\u003c/p\u003e\n\u003cp\u003e\"War?\" How knew he of war? My war.\u003c/p\u003e\n\u003cp\u003e\"Aye, fool. War.\"\u003c/p\u003e\n\u003cp\u003e\"Fuckstockings,\" said I. I let the knife fly and ran out of the room, bells jingling.\u003c/p\u003e\n\u003cp\u003eAs I approached our tower, I heard what sounded like someone torturing an elk in a tempest. I thought that Edmund might have sent an assassin for Drool after all, so I came through the door low, with one of my daggers at the ready.\u003c/p\u003e\n\u003cp\u003eDrool lay on his back on a blanket, a golden-haired woman with a white gown spread around her hips was riding him as if competing in the nitwit steeplechase. I\u0027d seen her before, but never so solid. The two were wailing in ecstasy.\u003c/p\u003e\n\u003cp\u003e\"Drool, what are you doing?\"\u003c/p\u003e\n\u003cp\u003e\"Pretty,\" said Drool, a great joyous, goofy grin on him.\u003c/p\u003e\n\u003cp\u003e\"Aye, she\u0027s a vision, lad, but you\u0027re knobbing a ghost.\"\u003c/p\u003e\n\u003cp\u003e\"No.\" The dim giant paused in his upward thrusting, lifted her by her waist and looked closely at her as if he\u0027d found a flea in his bed.\u003c/p\u003e\n\u003cp\u003e\"Ghost?\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003eDrool tossed her aside and with a long shuddering scream ran to the window and dove through, shattering the shutters as he went. The scream trailed off and ended with a splash.\u003c/p\u003e\n\u003cp\u003eThe ghost pulled her gown down, tossed her hair out of her face, and grinned. \"Water in the moat,\" she said. \"He\u0027ll be fine. Guess I\u0027ll be going away half-cocked, though.\"\u003c/p\u003e\n\u003cp\u003e\"Well, yes, but jolly good of you to take time from chain rattling and delivering portents of bloody doom to shag the beef-brained boy.\"\u003c/p\u003e\n\u003cp\u003e\"Not up for a spirity tumble yourself, then?\" She made as if to lift her gown above her hips again.\u003c/p\u003e\n\u003cp\u003e\"Piss off, wisp, I\u0027ve got to go fish the git out of the moat. He can\u0027t swim.\"\u003c/p\u003e\n\u003cp\u003e\"Not keen on flight, neither, evidently?\"\u003c/p\u003e\n\u003cp\u003eNo time for this. I sheathed my dagger, wheeled on my heel and started out the door.\u003c/p\u003e\n\u003cp\u003e\"Not your war, fool,\" said the ghost.\u003c/p\u003e\n\u003cp\u003eI stopped. Drool was slow at most things, perhaps he would be so at drowning. \"The bastard has his own war?\"\u003c/p\u003e\n\u003cp\u003e\"Aye.\" The ghost nodded, fading back to mist as she moved.\u003c/p\u003e\n\u003cp\u003e\"A fool\u0027s best plan\u003c/p\u003e\n\u003cp\u003ePlays out to chance,\u003c/p\u003e\n\u003cp\u003eBut a bastard\u0027s hope,\u003c/p\u003e\n\u003cp\u003eArrives from France.\"\u003c/p\u003e\n\u003cp\u003e\"Thou loquacious fog, thou nattering mist, thou serpent-tongued steam, for the love of truth, speak straight, and no sodding rhyme.\"\u003c/p\u003e\n\u003cp\u003eBut in that moment she was gone.\u003c/p\u003e\n\u003cp\u003e\"Who are you?\" I shouted to the empty tower.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/fool/page-13.html","bookId":2053,"creation":"Oct 5, 2019 11:53:07 PM","modification":"Oct 5, 2019 11:53:07 PM"}
