{"id":110143,"no":19,"title":"Page 19","content":"\u003cp\u003eNINETEEN\u003c/p\u003e\n\u003cp\u003eSHALL A MADMAN RISE\u003c/p\u003e\n\u003cp\u003eGloucester was wandering around outside the castle, just beyond the drawbridge, coming dangerously close to tumbling into the moat. The storm was still raging and bloody rain streamed down the earl\u0027s face from his empty eye sockets.\u003c/p\u003e\n\u003cp\u003eDrool caught the old man by the back of his cloak and lifted him like he was a kitten. Gloucester struggled and waved about in horror, as if he\u0027d been snatched up by some great bird of prey instead of an enormous nitwit.\u003c/p\u003e\n\u003cp\u003e\"There, there,\" said Drool, trying to calm the old man the way one might try to settle a frightened horse. \"I gots you.\"\u003c/p\u003e\n\u003cp\u003e\"Bring him away from the edge and set him down, Drool,\" said I. \"Lord Gloucester, this is Pocket, Lear\u0027s fool. We\u0027re going to take you to shelter and bandage your wounds. King Lear will be there, too. Just take Drool\u0027s hand.\"\u003c/p\u003e\n\u003cp\u003e\"Get away,\" said the earl. \"Your comforts are in vain. I am lost. My sons are scoundrels, my estate is forfeit. Let me fall in the moat and drown.\"\u003c/p\u003e\n\u003cp\u003eDrool set the old man down and pointed him toward the moat. \"Go on, then, milord.\"\u003c/p\u003e\n\u003cp\u003e\"Grab him, Drool, you wooden-headed ninny!\"\u003c/p\u003e\n\u003cp\u003e\"But he told me to let him drown, and he\u0027s an earl with a castle and the lot, and you\u0027re only a fool, Pocket, so I got to do what he says.\"\u003c/p\u003e\n\u003cp\u003eI strode forth, grabbed Gloucester and led him away from the edge. \"He\u0027s not an earl anymore, lad. He has nothing but his cloak to protect him from the rain, like us.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s got nothing?\" said Drool. \"Can I teach him to juggle so he can be a fool?\"\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s get him to shelter and see that he doesn\u0027t bleed to death first, then you can give him fool lessons.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to make a fool of ye,\" said Drool, clapping the old man on the back. \"That\u0027ll be the dog\u0027s bollocks, won\u0027t it, milord?\"\u003c/p\u003e\n\u003cp\u003e\"Drown me,\" said Gloucester.\u003c/p\u003e\n\u003cp\u003e\"Being a fool is ever so much better than being an earl,\" said Drool, far too cheery for a cold-dismal day of post-maiming. \"You don\u0027t get a castle but you make people laugh and they give you apples and sometimes one of the wenches or the sheeps will have a laugh with you. It\u0027s the mutt\u0027s nuts,[42] it is.\"\u003c/p\u003e\n\u003cp\u003eI stopped and looked at my apprentice. \"You\u0027ve been having a laugh with sheep?\"\u003c/p\u003e\n\u003cp\u003eDrool rolled his eyes toward the slate sky. \"No, I - we have pie sometimes, too, when Bubble makes it. You\u0027ll like Bubble. She\u0027s smashing.\"\u003c/p\u003e\n\u003cp\u003eGloucester seemed to lose all his will then, and let me lead him through the walled town, taking weak, halting steps. As we passed a long, half-timbered building I took to be barracks I heard someone call my name. I looked to see Curan, Lear\u0027s captain, standing under an awning. He waved us over and we stood with our backs hard to the wall to try to escape the rain.\u003c/p\u003e\n\u003cp\u003e\"Is that the Earl of Gloucester?\" asked Curan.\u003c/p\u003e\n\u003cp\u003e\"Aye,\" said I. I told Curan what had transpired inside the castle and out on the heath since I\u0027d last seen him.\u003c/p\u003e\n\u003cp\u003e\"God\u0027s blood, two wars. Cornwall dead. Who is master of our force, now?\"\u003c/p\u003e\n\u003cp\u003e\"Mistress,\" said I. \"Stay with Regan. The plan is as before.\"\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s not. We don\u0027t even know who her enemy is, Albany or France.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, but your action should be the same.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027d give a month\u0027s wages to be behind the blade that slays that bastard Edmund.\"\u003c/p\u003e\n\u003cp\u003eAt the mention of his son, Gloucester started wailing again. \"Drown me! I will suffer no more! Give me your sword that I may run upon it and end my shame and misery!\"\u003c/p\u003e\n\u003cp\u003e\"Sorry,\" I said to Curan. \"He\u0027s been a bit of a weepy little Nancy to be around since they ripped his eyes out.\"\u003c/p\u003e\n\u003cp\u003e\"Well, you might bandage him up. Bring him in. Hunter\u0027s still with us. He\u0027s right handy with a cauterizing iron.\"\u003c/p\u003e\n\u003cp\u003e\"Let me end this suffering,\" wailed Gloucester. \"I can no longer endure the slings and arrows - \"\u003c/p\u003e\n\u003cp\u003e\"My lord Gloucester, would you please, by the fire-charred balls of St. George, shut the fuck up!\"\u003c/p\u003e\n\u003cp\u003e\"Bit harsh, innit?\" said Curan.\u003c/p\u003e\n\u003cp\u003e\"What, I said \u0027please.\u0027\"\u003c/p\u003e\n\u003cp\u003e\"Still.\"\u003c/p\u003e\n\u003cp\u003e\"Sorry, Gloucester, old chap. Most excellent hat.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not wearing a hat,\" said Curan.\u003c/p\u003e\n\u003cp\u003e\"Well, he\u0027s blind, isn\u0027t he? If you hadn\u0027t said anything he might have enjoyed his bloody hat, mightn\u0027t he?\"\u003c/p\u003e\n\u003cp\u003eThe earl started wailing again. \"My sons are villains and I have no hat.\" He made to go on, but Drool clamped his great paw over the old man\u0027s mouth.\u003c/p\u003e\n\u003cp\u003e\"Thanks, lad. Curan, do you have any food?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, Pocket, we can spare as much bread and cheese as you can carry, and one of the men can scare up a flask of wine, too, I\u0027ll wager. His lordship has been most generous in providing us with fare,\" Curan said for the benefit of Gloucester. The old man began struggling against Drool\u0027s grip.\u003c/p\u003e\n\u003cp\u003e\"Oh, Curan, you\u0027ve set him off again. Hurry, if you please. We\u0027ve got to find Lear and head to Dover.\"\u003c/p\u003e\n\u003cp\u003e\"Dover it is, then? You\u0027ll join with France?\"\u003c/p\u003e\n\u003cp\u003e\"Aye, bloody King Jeff, great froggy, monkey-named, woman-stealing ponce that he is.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re fond of him, then?\"\u003c/p\u003e\n\u003cp\u003e\"Oh do piss off, captain. Just see to it that whatever force Regan might send after us doesn\u0027t catch us. Don\u0027t mutiny, just make your way to Dover east, then south. I\u0027ll take Lear south, then east.\"\u003c/p\u003e\n\u003cp\u003e\"Let me come with you, Pocket. The king needs more protection than two fools and a blind man.\"\u003c/p\u003e\n\u003cp\u003e\"The old knight Caius is with the king. You will serve the king best by serving his plan here.\" Not strictly true, but would he have done his duty if he thought his commander a fool? I think not.\u003c/p\u003e\n\u003cp\u003e\"Aye, then, I\u0027ll get your food,\" said Curan.\u003c/p\u003e\n\u003cp\u003eWhen we arrived at the hovel, Tom O\u0027Bedlam stood outside, naked in the rain, barking.\u003c/p\u003e\n\u003cp\u003e\"That barking bloke is naked,\" said Drool, for once not singing praise to St. Obvious, as we were actually traveling with a blind fellow.\u003c/p\u003e\n\u003cp\u003e\"Aye, but the question is, is he naked because he\u0027s barking, or is he barking because he\u0027s naked?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m hungry,\" said Drool, his mind overchallenged.\u003c/p\u003e\n\u003cp\u003e\"Poor Tom is cold and cursed,\" said Tom between barking fits, and for the first time seeing him in daylight and mostly clean, I was taken aback. Without the coat of mud, Tom looked familiar. Very familiar. Tom O\u0027Bedlam was, in fact, Edgar of Gloucester, the earl\u0027s legitimate son.\u003c/p\u003e\n\u003cp\u003e\"Tom, why are you out here?\"\u003c/p\u003e\n\u003cp\u003e\"Poor Tom, that old knight Caius said he had to stand in the rain until he was clean and didn\u0027t stink anymore.\"\u003c/p\u003e\n\u003cp\u003e\"And did he tell you to bark and talk about yourself in the third person?\"\u003c/p\u003e\n\u003cp\u003e\"No, I thought up that bit on my own.\"\u003c/p\u003e\n\u003cp\u003e\"Come inside, Tom. Help Drool with this old fellow.\"\u003c/p\u003e\n\u003cp\u003eTom looked at Gloucester for the first time and his eyes went wide and he sank to his knees. \"By the cruelty of the gods,\" said he. \"He\u0027s blind.\"\u003c/p\u003e\n\u003cp\u003eI put my hand on his shoulder and whispered, \"Be steadfast, Edgar, your father needs your help.\" In that moment a light came into his eye like a spark of sanity returning and he nodded and stood up, taking the earl\u0027s arm. Shall a madman rise to lead the blind.\u003c/p\u003e\n\u003cp\u003e\"Come, good sir,\" said Edgar. \"Tom is mad, but he is not beyond aiding a stranger in distress.\"\u003c/p\u003e\n\u003cp\u003e\"Just let me die!\" said Gloucester, trying to push Edgar away. \"Give me a rope so I may stretch my neck until my breath is gone.\"\u003c/p\u003e\n\u003cp\u003e\"He does that a lot,\" I said.\u003c/p\u003e\n\u003cp\u003eI opened the door, expecting to see Lear and Kent inside, but the hovel was empty, and the fire had died down to embers. \"Tom, where is the king?\"\u003c/p\u003e\n\u003cp\u003e\"He and his knight set out for Dover.\"\u003c/p\u003e\n\u003cp\u003e\"Without me?\"\u003c/p\u003e\n\u003cp\u003e\"The king was mad to be back in the storm. \u0027Twas the old knight said to tell you they were headed for Dover.\"\u003c/p\u003e\n\u003cp\u003e\"Here, here, bring the earl inside.\" I stood aside and let Edgar coax his father into the cabin. \"Drool, throw some wood on the fire. We can stay only long enough to eat and dry out. We must be after the king.\"\u003c/p\u003e\n\u003cp\u003eDrool ducked through the door and spotted Jones sitting on a bench by the fire where I had left him. \"Jones! My friend,\" said the dolt. He picked up the puppet stick and hugged it. Drool is somewhat unclear on the art of ventriloquism, and although I have explained to him that Jones speaks only through me, he has developed an attachment to the puppet.\u003c/p\u003e\n\u003cp\u003e\"Hello, Drool, you great sawdust-brained buffoon. Put me down and stoke the fire,\" said Jones.\u003c/p\u003e\n\u003cp\u003eDrool tucked the puppet stick in his belt and began breaking up kindling with a hatchet by the hearth while I portioned out the bread and cheese that Curan had given us. Edgar did his best to bandage Gloucester\u0027s eyes and the old man settled down enough to eat some cheese and drink a little wine. Unfortunately, the wine and the blood loss, no doubt, took the earl from inconsolable wailing grief to a soul-smothering, sable-colored melancholy.\u003c/p\u003e\n\u003cp\u003e\"My wife died thinking me a whoremonger, my father thought me damned for not following his faith, and my sons are both villains. I thought for a turn that Edmund might have redeemed his bastardy by being good and true, by fighting infidels in the Crusade, but he is more of a traitor than his legitimate brother.\"\u003c/p\u003e\n\u003cp\u003e\"Edgar is no traitor,\" I said to the old man. Even as I said it Edgar held a finger to his lips and signaled for me to speak no further. I nodded to show I knew his will and would not give his identity away. He could be Tom as long as he wished, or for as long as he needed, for all I cared, as long as he put on some bloody trousers. \"Edgar was always true to you, my lord. His treachery was all devised for your eyes by the bastard Edmund. It was two sons\u0027 worth of evil done by one. Edgar may not be the sharpest arrow in the quiver, but he is no traitor.\"\u003c/p\u003e\n\u003cp\u003eEdgar raised an eyebrow to me in question. \"You\u0027ll make no case for your intelligence sitting there naked and shivering when there\u0027s a fire and blankets you can fashion into warm robes, good Tom,\" said I.\u003c/p\u003e\n\u003cp\u003eHe rose from his father\u0027s side and went over to the fire.\u003c/p\u003e\n\u003cp\u003e\"Then it is I who have betrayed Edgar,\" said Gloucester. \"Oh, the gods have seen fit to rain misery down on me for my unsteady heart. I have sent a good son into exile with hounds at his heels and left only the worms as heirs to my only estate: this withered blind body. Oh, we are but soft and squishy bags of mortality rolling in a bin of sharp circumstance, leaking life until we collapse, flaccid, into our own despair.\" The old man began to wave his arms and beat at his brow, whipping himself into a frenzy, causing his bandages to unravel. Drool came over to the old man and wrapped his arms around him to hold him steady.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s all right, milord,\" said Drool. \"You ain\u0027t leakin\u0027 hardly at all.\"\u003c/p\u003e\n\u003cp\u003e\"Let me send this broken house to ruin and rot in death\u0027s eternal cold. Let me shuffle off this mortal coil - my sons betrayed, my king usurped, my estates seized - let me end this torture!\"\u003c/p\u003e\n\u003cp\u003eHe really was making a very good argument.\u003c/p\u003e\n\u003cp\u003eThen the earl grabbed Jones and tore him out of Drool\u0027s belt. \"Give me your sword, good knight!\"\u003c/p\u003e\n\u003cp\u003eEdgar made to stop his father and I threw out an arm to hold him back - a toss of my head stopped Drool from interceding.\u003c/p\u003e\n\u003cp\u003eThe old man stood, put the stick end of Jones under his rib cage, then fell forward onto the dirt floor. The breath shot from his body and he wheezed in pain. My cup of wine had been warming by the fire and I threw it on Gloucester\u0027s chest.\u003c/p\u003e\n\u003cp\u003e\"I am slain,\" croaked the earl, fighting for breath. \"The lifeblood runs from me even now. Bury my body on the hill looking down upon Castle Gloucester. And beg forgiveness of my son Edgar. I have wronged him.\"\u003c/p\u003e\n\u003cp\u003eEdgar again tried to go to his father and I held him back. Drool was covering his mouth, trying not to laugh.\u003c/p\u003e\n\u003cp\u003e\"I grow cold, cold, but at least I take my wrong-doings to my grave.\"\u003c/p\u003e\n\u003cp\u003e\"You know, milord,\" I said. \"The evil that men do lives after them, the good is oft interred with their bones, or so I\u0027ve heard.\"\u003c/p\u003e\n\u003cp\u003e\"Edgar, my boy, wherever you are, forgive me, forgive me!\" The old man rolled on the floor, and seemed somewhat surprised when the sword on which he thought himself impaled fell away. \"Lear, forgive me that I did not serve you better!\"\u003c/p\u003e\n\u003cp\u003e\"Look at that,\" said I. \"You can see his black soul rising from his body.\"\u003c/p\u003e\n\u003cp\u003e\"Where?\" said Drool.\u003c/p\u003e\n\u003cp\u003eA frantic finger to my lips silenced the Natural. \"Oh, great carrion birds are rending poor Gloucester\u0027s soul to tatters! Oh, Fate\u0027s revenge is upon him, he suffers!\"\u003c/p\u003e\n\u003cp\u003e\"I suffer!\" said Gloucester.\u003c/p\u003e\n\u003cp\u003e\"He is bound to the darkest depths of Hades! Never to rise again.\"\u003c/p\u003e\n\u003cp\u003e\"Down the abyss I go. Forever a stranger to light and warmth.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, cold and lonely death has taken him,\" said I. \"And a right shit he was in life, likely he\u0027ll be buggered by a billion barb-dicked devils now.\"\u003c/p\u003e\n\u003cp\u003e\"Cold and lonely Death has me,\" said the earl.\u003c/p\u003e\n\u003cp\u003e\"No, it hasn\u0027t,\" said I.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not dead.\"\u003c/p\u003e\n\u003cp\u003e\"Soon, then. I\u0027ve fallen on this cruel blade and my life runs wet and sticky between my fingers.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve fallen on a puppet,\" said I.\u003c/p\u003e\n\u003cp\u003e\"No, I haven\u0027t. It\u0027s a sword. I took it from that soldier.\"\u003c/p\u003e\n\u003cp\u003e\"You took my puppet stick from my apprentice. You\u0027ve thrown yourself on a puppet.\"\u003c/p\u003e\n\u003cp\u003e\"You knave, Pocket, you\u0027re not trustworthy and would jest at a man even as his life drains. Where is that naked madman who was helping me?\"\u003c/p\u003e\n\u003cp\u003e\"You threw yourself on a puppet,\" said Edgar.\u003c/p\u003e\n\u003cp\u003e\"So I\u0027m not dead?\"\u003c/p\u003e\n\u003cp\u003e\"Correct,\" said I.\u003c/p\u003e\n\u003cp\u003e\"I threw myself on a puppet?\"\u003c/p\u003e\n\u003cp\u003e\"That is what I\u0027ve been saying.\"\u003c/p\u003e\n\u003cp\u003e\"You are a wicked little man, Pocket.\"\u003c/p\u003e\n\u003cp\u003e\"So, milord, how do you feel, now that you\u0027ve returned from the dead.\"\u003c/p\u003e\n\u003cp\u003eThe old man stood up and tasted the wine on his fingers. \"Better,\" said he.\u003c/p\u003e\n\u003cp\u003e\"Good. Then let me present Edgar of Gloucester, the erstwhile naked nutter, who shall see you to Dover and your king.\"\u003c/p\u003e\n\u003cp\u003e\"Hello, Father,\" said Edgar.\u003c/p\u003e\n\u003cp\u003eThey embraced. There was crying and begging for forgiveness and filial snogging and overall the whole business was somewhat nauseating. A moment of quiet sobbing by the two men passed before the earl resumed his wailing.\u003c/p\u003e\n\u003cp\u003e\"Oh, Edgar, I have wronged thee and no forgiveness from you can undo my wretchedness.\"\u003c/p\u003e\n\u003cp\u003e\"Oh for fuck\u0027s sake,\" said I. \"Come, Drool, let us go find Lear and on to Dover and the sanctuary of the bloody fucking French.\"\u003c/p\u003e\n\u003cp\u003e\"But the storm still rages,\" said Edgar.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve been wandering in this storm for days. I\u0027m as wet and cold as I know how to get, and no doubt a fever will descend any hour now and crush my delicate form with heavy heat, but by the rug-munching balls of Sappho, I\u0027ll not spend another hour listening to a blind old nutter wail on about his wrong-doings when there\u0027s a stack of wrongs yet to be done. Carpe diem, Edgar. Carpe diem.\"\u003c/p\u003e\n\u003cp\u003e\"Fish of the day?\" said the rightful heir to the earldom of Gloucester.\u003c/p\u003e\n\u003cp\u003e\"Yes, that\u0027s it. I\u0027m invoking the fish of the bloody day, you git. I liked you better when you were eating frogs and seeing demons and the lot. Drool, leave them half the food and wrap yourself as warm as you can. We\u0027re off to find the king. We\u0027ll see you lot in Dover.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/fool/page-19.html","bookId":2053,"creation":"Oct 5, 2019 11:53:07 PM","modification":"Oct 5, 2019 11:53:07 PM"}
