{"id":110146,"no":22,"title":"Page 22","content":"\u003cp\u003eTWENTY-TWO\u003c/p\u003e\n\u003cp\u003eAT THE WHITE TOWER\u003c/p\u003e\n\u003cp\u003e\"Tosser!\" cried the raven.\u003c/p\u003e\n\u003cp\u003eNo help was he in my stealthy entry to the White Tower. I\u0027d packed my bells with clay, and darkened my face with the same, but no amount of camouflage would help if the raven raised an alarm. I should have had a guard bring him down with a crossbow bolt long before I left the Tower.\u003c/p\u003e\n\u003cp\u003eI lay in a shallow, flat-bottomed skiff I\u0027d borrowed from a ferryman, covered with rags and branches so I might appear just another mass of jetsam floating in the Thames. I paddled with my right hand, and the cold water felt like needles until my arm went numb. Sheets of ice drifted in the water around me. Another good cold night and I might have walked into the Traitor\u0027s Gate, rather than paddled. The river fed the moat, and the moat led under a low arch and through the gate where English nobility had been bringing their family members for hundreds of years on the way to the chopping block.\u003c/p\u003e\n\u003cp\u003eTwo iron-clad gates fit together at the center of the arch, chained in the middle below the waterline, and they moved ever-so-slightly in the current. There was a gap there, at the top, where the gates met. Not so wide that a soldier with weapons could fit through, but a cat, a rat, or a spry and nimble fool on the slim side might easily pass over. And so I did.\u003c/p\u003e\n\u003cp\u003eThere were no guards at the stone steps inside, but twelve feet of water separated me from them, and my skiff would not fit through the gap at the top of the gate where I was perched. A fool was getting wet, there was no way around it. But it seemed to me that the water was shallow, only a foot or two deep. Perhaps I could keep my shoes dry. I took them off and tucked them into my jerkin, then slid down the gate into the cold water.\u003c/p\u003e\n\u003cp\u003eGreat dog-buggering bollocks it was cold. Only to my knees, but cold. And I would have made it undiscovered, methinks, if I hadn\u0027t let slip a rather emphatic whisper of, \"Great dog-buggering bollocks, that\u0027s cold!\" I was met at the top of the stairs by the pointy part of a halberd, leveled malevolently at my chest.\u003c/p\u003e\n\u003cp\u003e\"For fuck\u0027s sake,\" said I. \"Do your worst, but get it done and drag my body inside where it\u0027s warm.\"\u003c/p\u003e\n\u003cp\u003e\"Pocket?\" said the yeoman at the other end of the spear. \"Sir?\"\u003c/p\u003e\n\u003cp\u003e\"Aye,\" said I.\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t seen you for months. What\u0027s that all over your face?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s clay. I\u0027m in disguise.\"\u003c/p\u003e\n\u003cp\u003e\"Oh right. Why don\u0027t you come in and warm up. Must be dreadful cold in your wet stocking feet there.\"\u003c/p\u003e\n\u003cp\u003e\"Good thought, lad,\" said I. It was the young, spot-faced yeoman whom I\u0027d chastised on the wall when Regan and Goneril were first arriving to gain their inheritance. \"Shouldn\u0027t you stay at your post, though? Duty and all that?\"\u003c/p\u003e\n\u003cp\u003eHe led me across the cobbled courtyard, into a servants\u0027 entrance to the main castle and down the stairs into the kitchen.\u003c/p\u003e\n\u003cp\u003e\"Nah, it\u0027s the Traitor\u0027s Gate, innit? Lock on it as big as your head. Ain\u0027t no one coming through there. Not all bad. It\u0027s out of the wind. Not like up on the wall. Y\u0027know the Duchess Regan is living here at the Tower now? I took your advice about not talking about her boffnacity,[43] even with the duke dead and all, can\u0027t be too careful. Although, I caught sight of her in a dressing gown one day she was up on the parapet outside her solar. Fine flanks on that princess, despite the danger of death and all for sayin\u0027 so, sir.\"\u003c/p\u003e\n\u003cp\u003e\"Aye, the lady is fair, and her gadonk as fine as frog fur, lad, but even your steadfast silence will get you hung if you don\u0027t cease with the thinking aloud.\"\u003c/p\u003e\n\u003cp\u003e\"Pocket, you scroungy flea-bitten plague rat!\"\u003c/p\u003e\n\u003cp\u003e\"Bubble! Love!\" said I. \"Thou dragon-breathed wart farm, how art thou?\"\u003c/p\u003e\n\u003cp\u003eThe ox-bottomed cook tried to hide her joy by casting an onion at me, but there was a grin there. \"You\u0027ve not eaten one full plate since you were last in my kitchen, have you?\"\u003c/p\u003e\n\u003cp\u003e\"We heard you was dead,\" said Squeak, a crescent of a smile for me beneath her freckles.\u003c/p\u003e\n\u003cp\u003e\"Feed the pest,\" said Bubble. \"And clean that mess off his face. Rutting with the pigs again, were you, Pocket?\"\u003c/p\u003e\n\u003cp\u003e\"Jealous?\"\u003c/p\u003e\n\u003cp\u003e\"Not bloody likely,\" said Bubble.\u003c/p\u003e\n\u003cp\u003eSqueak sat me down on a stool by the fire and while I warmed my feet she scrubbed the clay from my face and out of my hair, mercilessly battering me with her bosoms as she worked.\u003c/p\u003e\n\u003cp\u003eAh, home sweet home.\u003c/p\u003e\n\u003cp\u003e\"So, has anyone seen Drool?\"\u003c/p\u003e\n\u003cp\u003e\"In the dungeon with the king,\" said Squeak. \"Although the guard ain\u0027t supposed to know it.\" She eyed the young yeoman who stood by.\u003c/p\u003e\n\u003cp\u003e\"I knew that,\" he said.\u003c/p\u003e\n\u003cp\u003e\"What of the king\u0027s men, his knights and guards? In the barracks?\"\u003c/p\u003e\n\u003cp\u003e\"Nah,\" said the yeoman. \"Castle guard was a dog\u0027s breakfast until Captain Curan came down from Gloucester. He\u0027s got a noble-born knight as captain of every watch and the old guard man for man with any new ones. Crashing huge camps of soldiers outside the walls, forces of Cornwall to the west and Albany on the north. They say the Duke of Albany is staying with his men at camp. Won\u0027t come to the Tower.\"\u003c/p\u003e\n\u003cp\u003e\"Wise choice, with so many vipers about the castle. What of the princesses?\" I asked Bubble. Although she seemed never to leave her kitchen, she knew what was going on in every corner of the fortress.\u003c/p\u003e\n\u003cp\u003e\"They ain\u0027t talking,\" said Bubble. \"Taking meals in their old quarters they had when they was girls. Goneril in the east tower of the main keep. Regan in her solar on the outer wall on the south. They\u0027ll come together for the midday meal, but only if that bastard Gloucester is there.\"\u003c/p\u003e\n\u003cp\u003e\"Can you get me to them, Bubble. Unseen?\"\u003c/p\u003e\n\u003cp\u003e\"I could sew you up in a suckling pig and send it over.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, lovely, but I did hope to return undiscovered, and trailing gravy might draw the attention of the castle\u0027s cats and dogs. Regrettably, I\u0027ve had experience with such things.\"\u003c/p\u003e\n\u003cp\u003e\"We can dress you as one of the serving lads, then,\" said Squeak. \"Regan had us bring in boys instead of our usual maids. She likes to taunt and threaten them until they cry.\"\u003c/p\u003e\n\u003cp\u003eI regarded Bubble with steely recrimination. \"Why didn\u0027t you suggest that?\"\u003c/p\u003e\n\u003cp\u003e\"I wanted to see you sewed up in a suckling pig, you oily rascal.\"\u003c/p\u003e\n\u003cp\u003eBubble has struggled with her deep affection for me for years.\u003c/p\u003e\n\u003cp\u003e\"Very well, then,\" said I. \"A serving boy it is.\"\u003c/p\u003e\n\u003cp\u003e\"You know, Pocket,\" said Cordelia, age sixteen. \"Goneril and Regan say that my mother was a sorceress.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I\u0027d heard that, love.\"\u003c/p\u003e\n\u003cp\u003e\"If that\u0027s so, then I\u0027m proud of it. It means she didn\u0027t need some mangy man for her power. She had her own.\"\u003c/p\u003e\n\u003cp\u003e\"Banished then, wasn\u0027t she?\"\u003c/p\u003e\n\u003cp\u003e\"Well, yes, that or drowned, no one will really say. Father forbids me to ask about it. But my point is that a woman should come to her power on her own. Did you know that the wizard Merlin gave up his powers to Vivian in exchange for her favors, and she became a great sorceress and queen, and put Merlin to sleep in a cave for a hundred years for his trouble?\"\u003c/p\u003e\n\u003cp\u003e\"Men are like that, lamb. You give them your favors and next thing you know they\u0027re snoring away like a bear in a cave. Way of the world, it is.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t do that when my sisters gave you their favors.\"\u003c/p\u003e\n\u003cp\u003e\"They did no such thing.\"\u003c/p\u003e\n\u003cp\u003e\"They did, too. Many times. Everyone in the castle knows it.\"\u003c/p\u003e\n\u003cp\u003e\"Vicious rumors.\"\u003c/p\u003e\n\u003cp\u003e\"Fine, then. When you have enjoyed the favors of women, who shall remain nameless, did you fall asleep afterward?\"\u003c/p\u003e\n\u003cp\u003e\"Well, no. But neither did I give up my magical powers or my kingdom.\"\u003c/p\u003e\n\u003cp\u003e\"But you would have, wouldn\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Say, enough talk of sorcerers and such. What say we go down to the chapel and convert back to Christianity? Drool drank all the communion wine and ate all the leftover host when the bishop was ousted, so I\u0027ll wager he\u0027s blessed enough to bring us into the fold without clergy. Burped the body of Christ for a week, he did.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re trying to change the subject.\"\u003c/p\u003e\n\u003cp\u003e\"Curses! Discovered!\" exclaimed the puppet Jones. \"That\u0027ll teach you, you sooty-souled snake. Have him whipped, princess.\"\u003c/p\u003e\n\u003cp\u003eCordelia laughed, liberated Jones from my grasp, and clouted me on the chest with him. Even when she was grown she bore a weakness for puppety conspiracy and Punch-and-Judy justice.\u003c/p\u003e\n\u003cp\u003e\"Now, fool, speak truth - if the truth in you hasn\u0027t died starving from your neglect. Would you give up your powers and your kingdom for a lady\u0027s favor?\"\u003c/p\u003e\n\u003cp\u003e\"That would depend on the lady, wouldn\u0027t it?\"\u003c/p\u003e\n\u003cp\u003e\"Say me, for example?\"\u003c/p\u003e\n\u003cp\u003e\"Vous?\" said I, my eyebrows raised in the manner of the perfectly fucking French.\u003c/p\u003e\n\u003cp\u003e\"Oui,\" said she, in the language of love.\u003c/p\u003e\n\u003cp\u003e\"Not a chance,\" said I. \"I\u0027d be snoring before you had time to declare me your personal deity, which you would, of course. It\u0027s a burden I bear. Deep sleep of the innocent, I\u0027d have. (Or, you know, the deep sleep of the deeply shagged innocent.) I suspect, come morning, you\u0027d have to remind me of your name.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t sleep after my sisters had you, I know it.\"\u003c/p\u003e\n\u003cp\u003e\"Well, threat of violent, post-coital death will keep you on the alert, won\u0027t it?\"\u003c/p\u003e\n\u003cp\u003eShe crawled across the rug until she was close then. \"You are a dreadful liar.\"\u003c/p\u003e\n\u003cp\u003e\"What was your name?\"\u003c/p\u003e\n\u003cp\u003eShe clouted me on the head with Jones and kissed me - quickly, but with feeling. That was the only time.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d have your power and your kingdom, fool.\"\u003c/p\u003e\n\u003cp\u003e\"Give me back my puppet, thou nameless tart.\"\u003c/p\u003e\n\u003cp\u003eRegan\u0027s solar was bigger than I remembered it. A fairly grand, round room, with a fireplace and a dining table. Six of us brought in her supper and set it out on the table. She was all in red, as usual, snowy shoulders and raven hair warmed to the eye by orange firelight.\u003c/p\u003e\n\u003cp\u003e\"Wouldn\u0027t you rather lurk behind the tapestry, Pocket?\"\u003c/p\u003e\n\u003cp\u003eShe waved the others out of the room and closed the door.\u003c/p\u003e\n\u003cp\u003e\"I kept my head down. How did you know it was me?\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t cry when I shouted at you.\"\u003c/p\u003e\n\u003cp\u003e\"Blast, I should have known.\"\u003c/p\u003e\n\u003cp\u003e\"And you were the only serving boy wearing a codpiece.\"\u003c/p\u003e\n\u003cp\u003e\"Can\u0027t hide one\u0027s light under a bushel, can one?\" She was infuriating. Did nothing surprise her? She spoke as if I\u0027d been sent for and she\u0027d been expecting me at any moment. Rather took the joy out of all the stealth and disguise. I was tempted to tell her she\u0027d been duped and Drool-shagged just to see her reaction, but alas, there were still guards who were loyal to her, and I wasn\u0027t sure she wouldn\u0027t have me killed as it was. (I\u0027d left my knives with Bubble in the kitchen, not that they\u0027d help against a platoon of yeomen.) \"So, lady, how goes the mourning?\"\u003c/p\u003e\n\u003cp\u003e\"Surprisingly well. Grief suits me, I think. Grief or war, I\u0027m not sure which. But I\u0027ve had good appetite and my complexion\u0027s been rosy.\" She picked up a hand mirror and regarded herself, then caught my reflection and turned. \"But, Pocket, what are you doing here?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, loyalty to the cause and all. With the French at our bloody doors, thought I\u0027d come back to help defend home and hearth.\" It was probably best we not pursue the reasons why I was there, so I pressed on. \"How goes the war, then?\"\u003c/p\u003e\n\u003cp\u003e\"Complicated. Affairs of state are complicated, Pocket. I wouldn\u0027t expect a fool to understand.\"\u003c/p\u003e\n\u003cp\u003e\"But I\u0027m a royal, now, kitten. Didn\u0027t you know?\"\u003c/p\u003e\n\u003cp\u003eShe put down her mirror and looked as if she might burst out laughing. \"Silly fool. If you could catch nobility by touch you\u0027d have been a knight years ago, wouldn\u0027t you? But alas, you\u0027re still common as cat shit.\"\u003c/p\u003e\n\u003cp\u003e\"Ha! Yes, once. But now, cousin, blue blood runs in my veins. In fact, I\u0027ve a mind to start a war and shag some relatives, which I believe are the prime pastimes of royalty.\"\u003c/p\u003e\n\u003cp\u003e\"Nonsense. And don\u0027t call me cousin.\"\u003c/p\u003e\n\u003cp\u003e\"Shag the country and kill some relatives, then? I\u0027ve been noble less than a week, I don\u0027t have all the protocol memorized yet. Oh, and we are cousins, kitten. Our fathers were brothers.\"\u003c/p\u003e\n\u003cp\u003e\"Impossible.\" Regan nibbled at some dried fruit Bubble had laid out on the tray.\u003c/p\u003e\n\u003cp\u003e\"Lear\u0027s brother Canus raped my mother on a bridge in Yorkshire while Lear held her down. I am the issue of that unpleasant union. Your cousin.\" I bowed. At your bloody service.\u003c/p\u003e\n\u003cp\u003e\"A bastard. I might have known.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, but bastards are vessels of promise, are they not? Or didn\u0027t I watch you slay your lord the duke, to run to the arms of a bastard - who is, I believe, now the Earl of Gloucester. By the way, how goes the romance? Torrid and unsavory, I trust.\"\u003c/p\u003e\n\u003cp\u003eShe sat down then and ran her fingernails through her jet hair as if raking thoughts out of her scalp. \"Oh, I fancy him fine - although he\u0027s been a bit disappointing since that first time. But the intrigue is bloody exhausting, what with Goneril trying to bed Edmund, and he not being able to show me deference for fear of losing Albany\u0027s support, and bloody France invading in the midst of it all. If I\u0027d known all that my husband had to tend to I\u0027d have waited a while before killing him.\"\u003c/p\u003e\n\u003cp\u003e\"There, there, kitten.\" I moved around behind her and rubbed her shoulders. \"Your complexion is rosy and your appetite good, and you are, as always, a veritable feast of shagability. Once you\u0027re queen you can have everyone beheaded and take a long nap.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s just it. It\u0027s not like I can just put on the crown and go sovereigning merrily along - God, St. George, and the whole rotting mess into history. I have to defeat the fucking French, then I\u0027ve got to kill Albany, Goneril, and I suppose I\u0027ll have to find Father and have something heavy fall on him or the people will never accept me.\"\u003c/p\u003e\n\u003cp\u003e\"Good news on that, love. Lear\u0027s in the dungeon. Mad as a hatter, but alive.\"\u003c/p\u003e\n\u003cp\u003e\"He is?\"\u003c/p\u003e\n\u003cp\u003e\"Aye. Edmund just returned from Dover with him. You didn\u0027t know?\"\u003c/p\u003e\n\u003cp\u003e\"Edmund is back?\"\u003c/p\u003e\n\u003cp\u003e\"Not three hours ago. I followed him back.\"\u003c/p\u003e\n\u003cp\u003e\"Bastard! He hasn\u0027t even sent word that he\u0027s returned. I sent a letter to him in Dover.\"\u003c/p\u003e\n\u003cp\u003e\"This letter?\" I took the letter that Oswald had dropped. I\u0027d broken the seal, of course, but she recognized it and snatched it out of my hand.\u003c/p\u003e\n\u003cp\u003e\"How did you get that? I sent that with Goneril\u0027s man, Oswald, to give to Edmund personally.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, well, I sent Oswald to vermin Valhalla before delivery was secured.\"\u003c/p\u003e\n\u003cp\u003e\"You killed him?\"\u003c/p\u003e\n\u003cp\u003e\"I told you, kitten, I\u0027m nobility now - a murderous little cunt like the rest of you. Just as well, too, that letter\u0027s a flitty bit o\u0027 butterfly toss, innit? Don\u0027t you have any advisers to help you with that sort of thing? A chancellor or a chamberlain, a bloody bishop or someone?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve no one. Everyone is at the castle in Cornwall.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, love, let your cousin Pocket help.\"\u003c/p\u003e\n\u003cp\u003e\"Would you?\"\u003c/p\u003e\n\u003cp\u003e\"Of course. First, let\u0027s see to sister.\" I took two of the vials from the purse at my belt. \"This red one is deadly poison. But the blue one is only like a poison, giving the same signs as if one is dead, but they will but sleep one day for each drop they drink. You could put two drops of this in your sister\u0027s wine - say, when you are ready to attack the French - and for two days she would sleep the sleep of the dead while you and Edmund did your will, and without losing the support of Albany in the war.\"\u003c/p\u003e\n\u003cp\u003e\"And the poison?\"\u003c/p\u003e\n\u003cp\u003e\"Well, kitten, the poison may not be needed. You could defeat France, take Edmund for your own, and come to an agreement with your sister and Albany.\"\u003c/p\u003e\n\u003cp\u003e\"I have an agreement with them now. The kingdom is divided as father decreed.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m only saying that you may fight the French, have Edmund, and not have to slay your sister.\"\u003c/p\u003e\n\u003cp\u003e\"And what if we don\u0027t defeat France?\"\u003c/p\u003e\n\u003cp\u003e\"Well, then, you have the poison, don\u0027t you?\"\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s bollocks counseling,\" said Regan.\u003c/p\u003e\n\u003cp\u003e\"Wait, cousin, I haven\u0027t told you the part where you make me Duke of Buckingham yet. I\u0027d like that dodgy old palace, Hyde Park. St. James\u0027s Park, and a monkey.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re daft!\"\u003c/p\u003e\n\u003cp\u003e\"Named Jeff.\"\u003c/p\u003e\n\u003cp\u003e\"Get out!\"\u003c/p\u003e\n\u003cp\u003eI palmed the love letter from the table as I exited.\u003c/p\u003e\n\u003cp\u003eQuickly through the corridors, across the courtyard, and back to the kitchen where I traded my codpiece for a pair of waiter\u0027s breeches. It was one thing to leave Jones and my coxcomb with the ferryman, another to secret my blades away with Bubble, but giving up my codpiece was like losing my spirit.\u003c/p\u003e\n\u003cp\u003e\"I was nearly undone by its enormity,\" said I to Squeak, to whom I handed the portable den of my manly inequity.\u003c/p\u003e\n\u003cp\u003e\"Aye, a family of squirrels could nest in the extra space,\" Squeak observed, dropping a handful of the walnuts she\u0027d been shelling into the empty prick pouch.\u003c/p\u003e\n\u003cp\u003e\"Wonder you didn\u0027t rattle like a dried gourd when you walked,\" said Bubble.\u003c/p\u003e\n\u003cp\u003e\"Fine. Cast aspersions on my manhood if you will, but I\u0027ll not protect you when the French arrive. They\u0027re unnaturally fond of public snogging and they smell of snails and cheese. I will laugh - ha!\u0026nbsp;\u0026nbsp;-\u0026nbsp;\u0026nbsp;as you both are mercilessly cheese-snogged by froggy marauders.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t really sound that bad to me,\" said Squeak.\u003c/p\u003e\n\u003cp\u003e\"Pocket, you\u0027d better be off, lad,\" said Bubble. \"Goneril\u0027s supper is going up now.\"\u003c/p\u003e\n\u003cp\u003e\"Adieu,\" said I, a preview of the Frenchy future of my former friends and soon to be frog-snogged traitorous tarts. \"Adieu.\" I bowed. I feigned fainting with a great wrist-to-brow flourish, and I left.\u003c/p\u003e\n\u003cp\u003e(I admit it, one does like to lubricate his recurrent entrances and exits with a bit of melodrama. Performance is all to the fool.)\u003c/p\u003e\n\u003cp\u003eGoneril\u0027s quarters were less spacious than Regan\u0027s, but luxurious, and there was a fire going. I hadn\u0027t set foot here since she\u0027d left the castle to marry Albany, but upon returning I found I was simultaneously aroused and filled with dread - memories simmering under the lid of consciousness, I suppose. She wore cobalt with gold trim, daringly cut. She must have known Edmund was back. \"Pumpkin!\"\u003c/p\u003e\n\u003cp\u003e\"Pocket? What are you doing here?\" She waved the other servers and a young lady who had been braiding her hair out of the room. \"And why are you dressed in that absurd outfit?\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" said I. \"Poncy breeches. Without my codpiece I feel defenseless.\"\u003c/p\u003e\n\u003cp\u003e\"I think they make you look taller,\" she said.\u003c/p\u003e\n\u003cp\u003eA dilemma. Taller in breeches or stunningly virile in a cod? Both illusions. Each with its advantage. \"Which do you think makes a better impression on the fairer sex, love, tall or hung?\"\u003c/p\u003e\n\u003cp\u003e\"Isn\u0027t your apprentice both?\"\u003c/p\u003e\n\u003cp\u003e\"But he\u0027s - oh - \"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She bit into a winter plum.\u003c/p\u003e\n\u003cp\u003e\"I see,\" said I. \"So, what is it with Edmund? All the black kit?\" What it was, was she was bewitched, was what it was.\u003c/p\u003e\n\u003cp\u003e\"Edmund.\" She sighed. \"I don\u0027t think Edmund loves me.\"\u003c/p\u003e\n\u003cp\u003eAnd I sat down, with all of Goneril\u0027s luncheon repast set before me, and considered cooling my forehead in the tureen of broth. Love? Sodding, bloody, tossing, bloody, sodding, bloody love? Irrelevant, superfluous, bloody, ruddy, rotten, sodding love? What ho? Wherefore? What the fuck? Love?\u003c/p\u003e\n\u003cp\u003e\"Love?\" said I.\u003c/p\u003e\n\u003cp\u003e\"No one has ever loved me,\" said Goneril.\u003c/p\u003e\n\u003cp\u003e\"What about your mother? Surely your mother?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t remember her. Lear had her executed when we were little.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"It was not to be spoken of.\"\u003c/p\u003e\n\u003cp\u003e\"Jesus, then? Comfort in Christ?\"\u003c/p\u003e\n\u003cp\u003e\"What comfort? I\u0027m a duchess, Pocket, a princess, perhaps a queen. You can\u0027t rule in Christ. Are you daft? You have to ask Christ to leave the room. Your very first war or execution and you\u0027re right fucked for forgiveness, aren\u0027t you? There\u0027s Jesusy disapproval and scowling at least and you have to act like you don\u0027t see it.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s infinite in his forgiveness,\" said I. \"It says so somewhere.\"\u003c/p\u003e\n\u003cp\u003e\"As should we all be, it also says. But I don\u0027t believe it. I\u0027ve never forgiven our father for killing our mother and I never shall. I don\u0027t believe, Pocket. There\u0027s no comfort or love there. I don\u0027t believe.\"\u003c/p\u003e\n\u003cp\u003e\"Me, either, lady. So, sod Jesus. Surely Edmund will fall in love with you when you become closer and he\u0027s had a chance to murder your husband. Love needs room to grow, like a rose.\" Or a tumor.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s passionate enough, although never so enthusiastic as that first night in the tower.\"\u003c/p\u003e\n\u003cp\u003e\"Have you introduced him to your - well - special tastes?\"\u003c/p\u003e\n\u003cp\u003e\"Those will not win his heart.\"\u003c/p\u003e\n\u003cp\u003e\"Nonsense, love, a black-hearted prince like Edmund verily starves to have his bum smacked by a fair damsel like yourself. Probably what he\u0027s craving, just too shy to ask.\"\u003c/p\u003e\n\u003cp\u003e\"I think another has caught his eye. I think he fancies my sister.\"\u003c/p\u003e\n\u003cp\u003eNo, that\u0027s his father\u0027s eye she caught, well, speared, really, I thought, but then I thought better. \"Perhaps I can help you resolve the conflict, pumpkin.\" And at that, I produced the red and blue vials from my purse. I explained how one was for death-like sleep, and the other afforded more permanent rest. And as I did so, I cradled the silk purse that still held the last puffball the witches had given me.\u003c/p\u003e\n\u003cp\u003eWhat if I were to use it on Goneril? Bewitch her to love her own husband? Surely Albany would forgive her. He was a noble chap, despite being a noble. And with that, Regan could have that villain Edmund for herself, the conflict between the sisters would be settled, Edmund would be satisfied with his new role as Duke of Cornwall and Earl of Gloucester, and all would be well. Of course there were the issues of France attacking, Lear in the dungeon, and a wise and comely fool whose fate was uncertain...\u003c/p\u003e\n\u003cp\u003e\"Pumpkin,\" said I, \"perhaps if you and Regan came to an understanding. Perhaps if she were put to sleep until her army had done its duty against France. Perhaps mercy - \"\u003c/p\u003e\n\u003cp\u003eAnd that was as far as I got, as the bastard Edmund came through the door at that moment.\u003c/p\u003e\n\u003cp\u003e\"What is this?\" demanded the bastard.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you fucking knock?\" said I. \"Bloody common bastard!\" You\u0027d have thought, now that I, too, was a half-noble bastard, that my disdain for Edmund might have diminished. Strangely, no.\u003c/p\u003e\n\u003cp\u003e\"Guard. Take this worm to the dungeon until I have time to deal with him.\"\u003c/p\u003e\n\u003cp\u003eFour guards, not of the old Tower force, came in and chased me around the solar several times before I was tripped up by the constrained step of my waiter breeches. The lad they\u0027d been made for must have been smaller even than I. They pinned my arms behind me and dragged me out of the room. As I went backward through the door, I called, \"Goneril!\"\u003c/p\u003e\n\u003cp\u003eShe held up her hand and they stopped there and held me.\u003c/p\u003e\n\u003cp\u003e\"You have been loved,\" said I.\u003c/p\u003e\n\u003cp\u003e\"Oh, take him out and beat him,\" said Goneril.\u003c/p\u003e\n\u003cp\u003e\"She jests,\" said I. \"The lady jests.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/fool/page-22.html","bookId":2053,"creation":"Oct 5, 2019 11:53:07 PM","modification":"Oct 5, 2019 11:53:07 PM"}
