{"id":91165,"no":10,"title":"Page 10","content":"\u003cp\u003e\"Why do you approach the city before the light of dawn?\" the Nightkeeper of the North Gate asked the emissary for the merchant caravan that had pulled up outside Luskan\u0027s wall. Jierdan, in his post beside the Nightkeeper, watched with special interest, certain that this troupe had come from Ten-Towns.\u003c/p\u003e\n\u003cp\u003e\"We would not impose upon the regulations of the city if our business were not urgent,\" answered the spokesman. \"We have not rested for two days.\" Another man emerged from the cluster of wagons, a body limp across his shoulders.\u003c/p\u003e\n\u003cp\u003e\"Murdered on the road,\" explained the spokesman. \"And another of the party taken. Catti-brie, daughter of Bruenor Battlehammer himself!\"\u003c/p\u003e\n\u003cp\u003e\"A dwarf-maid?\" Jierdan blurted out, suspecting otherwise, but masking his excitement for fear that it might implicate him.\u003c/p\u003e\n\u003cp\u003e\"Nay, no dwarf. A woman,\" lamented the spokeman. \"Fairest in all the dale, maybe in all the north. The dwarf took her in as an orphaned child and claimed her as his own.\"\u003c/p\u003e\n\u003cp\u003e\"Orcs?\" asked the Nightkeeper, more concerned with potential hazards on the road than with the fate of a single woman.\u003c/p\u003e\n\u003cp\u003e\"This was not the work of orcs,\" replied the spokesman. \"Stealth and cunning took Catti-brie from us and killed the driver. We did not even discover the foul deed until the next morn.\"\u003c/p\u003e\n\u003cp\u003eJierdan needed no further information, not even a more complete description of Catti-brie, to put the pieces together. Her connection to Bruenor explained Entreri\u0027s interest in her. Jierdan looked to the eastern horizon and the first rays of the coming dawn, anxious to be cleared of his duties on the wall so that he could go report his findings to Dendybar. This little piece of news should help to alleviate the mottled wizard\u0027s anger at him for losing the drow\u0027s trail on the docks.\u003c/p\u003e\n\u003cp\u003e\"He has not found them?\" Dendybar hissed at Sydney.\u003c/p\u003e\n\u003cp\u003e\"He has found nothing but a cold trail,\" the younger mage replied. \"If they are on the docks yet, they are well disguised.\"\u003c/p\u003e\n\u003cp\u003eDendybar paused to consider his apprentice\u0027s report. Something was out of place with this scenario. Four distinctive characters simply could not have vanished. \"Have you learned anything of the assassin, then, or of his companion?\"\u003c/p\u003e\n\u003cp\u003e\"The vagabonds in the alleys fear him. Even the ruffians give him a respectfully wide berth.\"\u003c/p\u003e\n\u003cp\u003e\"So our friend is known among the bowel-dwellers,\" Dendybar mused.\u003c/p\u003e\n\u003cp\u003e\"A hired killer, I would guess,\" reasoned Sydney. \"Probably from the south - Waterdeep, perhaps, though we should have heard more of him if that were the case. Perhaps even farther south, from the lands beyond our vision.\"\u003c/p\u003e\n\u003cp\u003e\"Interesting,\" replied Dendybar, trying to formulate some theory to satisfy all the variables. \"And the girl?\"\u003c/p\u003e\n\u003cp\u003eSydney shrugged. \"I do not believe that she follows him willingly, though she has made no move to be free of him. And when you saw him in Morkai\u0027s vision, he was riding alone.\"\u003c/p\u003e\n\u003cp\u003e\"He acquired her,\" came an unexpected reply from the doorway. Jierdan entered the room.\u003c/p\u003e\n\u003cp\u003e\"What? Unannounced?\" sneered Dendybar.\u003c/p\u003e\n\u003cp\u003e\"I have news - it could not wait,\" Jierdan replied boldly.\u003c/p\u003e\n\u003cp\u003e\"Have they left the city?\" Sydney prompted, voicing her suspicions to heighten the anger she read on the mottled wizard\u0027s pallid face. Sydney well understood the dangers and the difficulties of the docks, and almost pitied Jierdan for incurring the wrath of the merciless Dendybar in a situation beyond his control. But Jierdan remained her competition for the mottled wizard\u0027s favor, and she wouldn\u0027t let sympathy stand in the way of her ambitions.\u003c/p\u003e\n\u003cp\u003e\"No,\" Jierdan snapped at her. \"My news does not concern the drow\u0027s party.\" He looked back to Dendybar. \"A caravan arrived in Luskan today - in search of the woman.\"\u003c/p\u003e\n\u003cp\u003e\"Who is she?\" asked Dendybar, suddenly very interested and forgetting his anger at the intrusion.\u003c/p\u003e\n\u003cp\u003e\"The adopted daughter of Bruenor Battlehamer,\" Jierdan replied. \"Cat - \"\u003c/p\u003e\n\u003cp\u003e\"Catti-brie! Of course!\" hissed Dendybar, himself familiar with most of the prominent people in Ten-Towns. \"I should have guessed!\" He turned to Sydney. \"My respect for our mysterious rider grows each day. Find him and bring him back to me!\"\u003c/p\u003e\n\u003cp\u003eSydney nodded, though she feared that Dendybar\u0027s request would prove more difficult than the mottled wizard believed, probably even beyond her skills altogether.\u003c/p\u003e\n\u003cp\u003eShe spent that night, until the early hours of the following morning, searching the alleyways and meeting places of the dockside area. But even using her contacts on the docks and all the magical tricks at her disposal, she found no sign of Entreri and Catti-brie, and no one willing or able to pass along any information that might help her in her search.\u003c/p\u003e\n\u003cp\u003eTired and frustrated, she returned to the Hosttower the next day, passing the corridor to Dendybar\u0027s room, even though he had ordered her to report to him directly upon her return. Sydney was in no mood to listen to the mottled wizard\u0027s ranting about her failure.\u003c/p\u003e\n\u003cp\u003eShe entered her small room, just off the main trunk of the Hosttower on the northern branch, below the rooms of the Master of the North Spire, and bolted the doors, further sealing them against unwelcomed intrusion with a magical spell.\u003c/p\u003e\n\u003cp\u003eShe had barely fallen into her bed when the surface of her coveted scrying mirror began to swirl and glow. \"Damn you, Dendybar,\" she growled, assuming that the disturbance was her master\u0027s doing. Dragging her weary body to the mirror, she stared deeply into it, attuning her mind to the swirl to bring the image clearer. It was not Dendybar that she faced, to her relief, but a wizard from a distant town, a would-be suitor that the passionless Sydney kept dangling by a thread of hope so that she could manipulate him as she needed.\u003c/p\u003e\n\u003cp\u003e\"Greetings, fair Sydney,\" the mage said. \"I pray I did not disturb your sleep, but I have exciting news!\"\u003c/p\u003e\n\u003cp\u003eNormally, Sydney would have tactfully listened to the mage, feigned interest in the story, and politely excused herself from the encounter. But now, with Dendybar\u0027s pressing demands lying squarely across her shoulders, she had no patience for distractions. \"This is not the time!\" she snapped.\u003c/p\u003e\n\u003cp\u003eThe mage, so caught up in his own news, seemed not to notice her definitive tone. \"The most marvelous thing has happened in our town,\" he rambled.\u003c/p\u003e\n\u003cp\u003e\"Harkle!\" Sydney cried to break his babbling momentum.\u003c/p\u003e\n\u003cp\u003eThe mage halted, crestfallen. \"But, Sydney,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Another time,\" she insisted.\u003c/p\u003e\n\u003cp\u003e\"But how often in this day does one actually see and speak with a drow elf?\" Harkle persisted.\u003c/p\u003e\n\u003cp\u003e\"I cannot - \" Sydney stopped short, digesting Harkle\u0027s last words. \"A drow elf?\" she stammered.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Harkle beamed proudly, thrilled that his news had apparently impressed his beloved Sydney. \"Drizzt Do\u0027Urden, by name. He left Longsaddle just two days ago. I would have told you earlier, but the mansion has just been astir about the whole thing!\"\u003c/p\u003e\n\u003cp\u003e\"Tell me more, dear Harkle,\" Sydney purred enticingly. \"Do tell me everything.\"\u003c/p\u003e\n\u003cp\u003e\"I am in need of information.\"\u003c/p\u003e\n\u003cp\u003eWhisper froze at the sound of the unexpected voice, guessing the speaker immediately. She knew that he was in town, and knew, too, that he was the only one who could have slipped through her defenses to get into her secret chambers.\u003c/p\u003e\n\u003cp\u003e\"Information,\" Entreri said again, moving out from the shadows behind a dressing screen.\u003c/p\u003e\n\u003cp\u003eWhisper slid the jar of healing unguent into her pocket and took a good measure of the man. Rumors spoke of him as the deadliest of assassins, and she, all too familiar with killers, knew at once that the rumors rang with truth. She sensed Entreri\u0027s power, and the easy coordination of his movements. \"Men do not come to my room uninvited,\" she warned bravely.\u003c/p\u003e\n\u003cp\u003eEntreri moved to a better vantage point to study the bold woman. He had heard of her as well, a survivor of the rough streets, beautiful and deadly. But apparently Whisper had lost an encounter. Her nose was broken and disjointed, splayed across her cheek.\u003c/p\u003e\n\u003cp\u003eWhisper understood the scrutiny. She squared her shoulders and threw her head back proudly. \"An unfortunate accident,\" she hissed.\u003c/p\u003e\n\u003cp\u003e\"It is not my concern,\" Entreri came back. \"I have come for information.\"\u003c/p\u003e\n\u003cp\u003eWhisper turned away to go about her routine, trying to appear unbothered. \"My price is high,\" she said coolly.\u003c/p\u003e\n\u003cp\u003eShe turned back to Entreri, the intense but frighteningly calm look on his face telling her beyond doubt that her life would be the only reward for cooperation.\u003c/p\u003e\n\u003cp\u003e\"I seek four companions,\" said Entreri. \"A dwarf, a drow, a young man, and a halfling.\"\u003c/p\u003e\n\u003cp\u003eWhisper was unused to such situations. No crossbows supported her now, no bodyguards waited for her signal behind a nearby secret door. She tried to remain calm, but Entreri knew the depth of her fear. She chuckled and pointed to her broken nose. \"I have met your dwarf, and your drow, Artemis Entreri.\" She emphasized his name as she spoke it, hoping that her recognition would put him back on the defensive.\u003c/p\u003e\n\u003cp\u003e\"Where are they?\" Entreri asked, still in control. \"And what did they request of you?\"\u003c/p\u003e\n\u003cp\u003eWhisper shrugged. \"If they remain in Luskan, I do not know where. Most probably they are gone; the dwarf has a map of the northland.\"\u003c/p\u003e\n\u003cp\u003eEntreri considered the words. \"Your reputation speaks more highly of you,\" he said sarcastically. \"You accept such a wound and let them slip through your grasp?\"\u003c/p\u003e\n\u003cp\u003eWhisper\u0027s eyes narrowed in anger. \"I choose my fights carefully,\" she hissed. \"The four are too dangerous for actions of frivolous vengeance. Let them go where they will. I want no business with them again.\"\u003c/p\u003e\n\u003cp\u003eEntreri\u0027s calm visage sagged a bit. He had already been to the Cutlass and heard of Wulfgar\u0027s exploits. And now this. A woman like Whisper was not easily cowed. Perhaps he should indeed re-evaluate the strength of his opponents.\u003c/p\u003e\n\u003cp\u003e\"Fearless is the dwarf,\" Whisper offered, sensing his dismay and taking pleasure in furthering his discomfort. \"And ware the drow, Artemis Entreri,\" she hissed pointedly, attempting to relegate him to a similar level of respect for the companions with the grimness of her tone. \"He walks in shadows that we cannot see, and strikes from the darkness. He conjures a demon in the form of a great cat and - \"\u003c/p\u003e\n\u003cp\u003eEntreri turned and started away, having no intention of allowing Whisper to gain any more of an advantage.\u003c/p\u003e\n\u003cp\u003eReveling in her victory, Whisper couldn\u0027t resist the temptation to throw one final dart. \"Men do not come to my room uninvited,\" she said again. Entreri passed into an adjoining room and Whisper heard the door to the alley close.\u003c/p\u003e\n\u003cp\u003e\"I choose my fights carefully,\" she whispered to the emptiness of the room, regaining a measure of her pride with the threat.\u003c/p\u003e\n\u003cp\u003eShe turned back to a small dressing table and took out the jar of unguent, quite pleased with herself. She examined her wound in the table\u0027s mirror. Not too bad. The salve would erase it as it had erased so many scars from the trials of her profession.\u003c/p\u003e\n\u003cp\u003eShe understood her stupidity when she saw the shadow slip past her reflection in the mirror, and felt the brush of air at her back. Her business allowed no tolerance for errors, and offered no second chance. For the first and last time in her life, Whisper had let her pride rise above her judgment.\u003c/p\u003e\n\u003cp\u003eA final groan escaped her as the jeweled dagger sunk deeply into her back.\u003c/p\u003e\n\u003cp\u003e\"I, too, choose my fights with care,\" Entreri whispered into her ear.\u003c/p\u003e\n\u003cp\u003eThe next morning found Entreri outside a place he did not want to enter: the Hosttower of the Arcane. He knew that he was running out of options. Convinced now that the companions had long since left Luskan, the assassin needed some magical assistance to heat up the trail again. It had taken him nearly two years to sniff out the halfling in Ten-Towns, and his patience was wearing thin.\u003c/p\u003e\n\u003cp\u003eCatti-brie reluctantly but obediently at his side, he approached the structure, and was promptly escorted to Dendybar\u0027s audience hall, where the mottled wizard and Sydney waited to greet him.\u003c/p\u003e\n\u003cp\u003e\"They have left the city,\" Entreri said bluntly, before any exchange of greetings.\u003c/p\u003e\n\u003cp\u003eDendybar smiled to show Entreri that he had the upper hand this time. \"As long as a week ago,\" he replied calmly.\u003c/p\u003e\n\u003cp\u003e\"And you know where they are,\" Entreri reasoned.\u003c/p\u003e\n\u003cp\u003eDendybar nodded, the smile still curling into his hollow cheeks.\u003c/p\u003e\n\u003cp\u003eThe assassin didn\u0027t enjoy the game. He spent a long moment measuring his counterpart, searching for some hint of the wizard\u0027s intentions. Dendybar did likewise, still very much interested in an alliance with the formidable killer - but only on favorable terms.\u003c/p\u003e\n\u003cp\u003e\"The price of the information?\" Entreri asked.\u003c/p\u003e\n\u003cp\u003e\"I do not even know your name,\" was Dendybar\u0027s reply.\u003c/p\u003e\n\u003cp\u003eFair enough, the assassin thought. He bowed low. \"Artemis Entreri,\" he said, confident enough to speak truthfully.\u003c/p\u003e\n\u003cp\u003e\"And why do you seek the companions, carrying the dwarf\u0027s daughter in tow?\" Dendybar pressed, playing his hand out to give the cocky assassin something to worry about.\u003c/p\u003e\n\u003cp\u003e\"That is my own care,\" hissed Entreri, the narrowing of his eyes the only indication that Dendybar\u0027s knowledge had perturbed him.\u003c/p\u003e\n\u003cp\u003e\"It is mine, as well, if we are to be allies in this!\" shouted Dendybar, rising to stand tall and ominous and intimidate Entreri.\u003c/p\u003e\n\u003cp\u003eThe assassin, though, cared little for the wizard\u0027s continuing antics, too engrossed in assessing the value of such an alliance. \"I ask nothing of your business with them,\" Entreri replied at length. \"Tell me only which one of the four it concerns.\"\u003c/p\u003e\n\u003cp\u003eIt was Dendybar\u0027s turn to ponder. He wanted Entreri in his court, if for no other reason than he feared having the assassin working against him. And he liked the notion that he would not have to disclose anything about the artifact that he sought to this very dangerous man. \"The drow has something of mine, or knowledge of where I can find it,\" he said. \"I want it back.\"\u003c/p\u003e\n\u003cp\u003e\"And the halfling is mine,\" Entreri demanded. \"Where are they?\"\u003c/p\u003e\n\u003cp\u003eDendybar motioned to Sydney. \"They have passed through Longsaddle,\" she said. \"And are headed to Silverymoon, more than two weeks to the east.\"\u003c/p\u003e\n\u003cp\u003eThe names were unknown to Catti-brie, but she was glad that her friends had a good lead. She needed time to sort out a plan, though she wondered how effective she could be surrounded by such powerful captors.\u003c/p\u003e\n\u003cp\u003e\"And what do you propose?\" Entreri asked.\u003c/p\u003e\n\u003cp\u003e\"An alliance,\" replied Dendybar.\u003c/p\u003e\n\u003cp\u003e\"But I have the information I need,\" Entreri laughed. \"What do I gain in an alliance with you?\"\u003c/p\u003e\n\u003cp\u003e\"My powers can get you to them, and can aid in defeating them. They are not a weak force. Consider it of mutual benefit.\"\u003c/p\u003e\n\u003cp\u003e\"You and I on the road? You seem more fitted to a book and a desk, wizard.\"\u003c/p\u003e\n\u003cp\u003eDendybar locked an unblinking glare on the arrogant assassin. \"I assure you that I can get wherever I desire more effectively than you ever could imagine,\" he growled. He let go of his anger quickly, though, being more interested in completing business. \"But I shall remain here. Sydney will go in my stead, and Jierdan, the soldier, will be her escort.\"\u003c/p\u003e\n\u003cp\u003eEntreri did not like the idea of traveling with Jierdan, but he decided not to press the point. It might be interesting, and helpful, in sharing the hunt with the Hosttower of the Arcane. He agreed to the terms.\u003c/p\u003e\n\u003cp\u003e\"And what of her?\" Sydney asked, pointing to Catti-brie.\u003c/p\u003e\n\u003cp\u003e\"She goes with me,\" Entreri was quick to answer.\u003c/p\u003e\n\u003cp\u003e\"Of course,\" agreed Dendybar. \"No purpose in wasting such a valuable hostage.\"\u003c/p\u003e\n\u003cp\u003e\"We are three against five,\" Sydney reasoned. \"If things do not work out as easily as the two of you seem to expect, the girl may prove to be our downfall.\"\u003c/p\u003e\n\u003cp\u003e\"She goes!\" demanded Entreri.\u003c/p\u003e\n\u003cp\u003eDendybar had the solution already worked out. He turned a wry smile at Sydney. \"Take Bok,\" he chuckled.\u003c/p\u003e\n\u003cp\u003eSydney\u0027s face drooped, at the suggestion, as though Dendybar\u0027s command had stolen her desire for the hunt.\u003c/p\u003e\n\u003cp\u003eEntreri wasn\u0027t sure if he liked this new development or not.\u003c/p\u003e\n\u003cp\u003eSensing the assassin\u0027s discomfort, Dendybar motioned Sydney to a curtained closet at the side of the room. \"Bok,\" she called softly when she got there, the hint of a tremble in her voice.\u003c/p\u003e\n\u003cp\u003eIt stepped through the curtain. Fully eight feet tall and three wide at the shoulders, the monster strode stiffly to the woman\u0027s side. A huge man, it seemed, and indeed the wizard had used pieces of human bodies for many of its parts. Bok was bigger and more square than any man living, nearly the size of a giant, and had been magically empowered with strength beyond the measures of the natural world.\u003c/p\u003e\n\u003cp\u003e\"A golem,\" Dendybar proudly explained. \"My own creation. Bok could kill us all right now. Even your fell blade would be of little use against it, Artemis Entreri.\"\u003c/p\u003e\n\u003cp\u003eThe assassin wasn\u0027t so convinced, but he could not completely mask his intimidation. Dendybar had obviously tipped the scales of their partnership in his own favor, but Entreri knew that if he backed away from the bargain now he would be aligning the mottled wizard and his minions against him, and in direct competition with him for the dwarf\u0027s party. Furthermore, it would take him weeks, perhaps even months to catch the travelers by normal means and he did not doubt that Dendybar could get there faster.\u003c/p\u003e\n\u003cp\u003eCatti-brie shared the same uncomfortable thoughts. She had no desire to travel with the gruesome monster, but she wondered what carnage she would find when she finally caught up to Bruenor and the others if Entreri decided to break away from the alliance.\u003c/p\u003e\n\u003cp\u003e\"Fear not,\" Dendybar comforted. \"Bok is harmless, incapable of any independent thought, for, you see, Bok has no mind. The golem answers to my commands, or to Sydney\u0027s, and would walk into a fire to be consumed if we merely asked it to do so!\"\u003c/p\u003e\n\u003cp\u003e\"I have business to finish in the city,\" Entreri said, not doubting Dendybar\u0027s words and having little desire to hear any more about the golem. \"When do we depart?\"\u003c/p\u003e\n\u003cp\u003e\"Night would be best,\" reasoned Dendybar. \"Come back to the green outside the Hosttower when the sun is down. We shall meet there and get you on your way.\"\u003c/p\u003e\n\u003cp\u003eAlone in his chamber, save for Bok, Dendybar stroked the golem\u0027s muscled shoulders with deep affection. Bok was his hidden trump, his protection against the resistance of the companions, or the treachery of Artemis Entreri. But Dendybar did not part with the monster easily, for it played a powerful role, as well, in protecting him from would-be successors in the Hosttower. Dendybar had subtly but definitely passed along the warning to other wizards that any of them striking against him would have to deal with Bok, even if Dendybar were dead.\u003c/p\u003e\n\u003cp\u003eBut the road ahead might be long, and the Master of the North Spire could not forsake his duties and expect to hold his title. Especially not with the Archmage just looking for any excuse to be rid of him, understanding the dangers of Dendybar\u0027s outspoken aspirations to the central tower.\u003c/p\u003e\n\u003cp\u003e\"Nothing can stop you, my pet,\" Dendybar told the monster. In truth, he was simply reaffirming his own fears about his choice to send the inexperienced mage in his stead. He didn\u0027t doubt her loyalty, nor Jierdan\u0027s, but Entreri and the heroes from Icewind Dale were not to be taken lightly.\u003c/p\u003e\n\u003cp\u003e\"I have given you the hunting power,\" Dendybar explained, as he tossed the scroll tube and the now-useless parchment to the floor. \"The drow is your purpose and you can now sense his presence from any distance. Find him! Do not return to me without Drizzt Do\u0027Urden!\"\u003c/p\u003e\n\u003cp\u003eA guttural roar issued from Bok\u0027s blue lips, the only sound the unthinking instrument was capable of uttering.\u003c/p\u003e\n\u003cp\u003eEntreri and Catti-brie found the wizard\u0027s party already assembled when they arrived at the Hosttower later that night.\u003c/p\u003e\n\u003cp\u003eJierdan stood alone, off to the side, apparently none too thrilled about partaking in the adventure, but having little choice. The soldier feared the golem, and had no love, or trust, for Entreri. He feared Dendybar more, though, and his uneasiness about the potential dangers on the road did not measure up against the certain dangers he would face at the hands of the mottled wizard if he refused to go.\u003c/p\u003e\n\u003cp\u003eSydney broke away from Bok and Dendybar and walked across the way to meet her companions. \"Greetings,\" she offered, more interested in appeasement now than competition with her formidable partner. \"Dendybar prepares our mounts. The ride to Silverymoon shall be swift indeed!\"\u003c/p\u003e\n\u003cp\u003eEntreri and Catti-brie looked to the mottled wizard. Bok stood beside him, holding an unrolled parchment out in view while Dendybar poured a smoky liquid from a beaker over a white feather and chanted the runes of the spell.\u003c/p\u003e\n\u003cp\u003eA mist grew at the wizard\u0027s feet, swirling and thickening into something with a definite shape. Dendybar left it to its transformation and moved to repeat the ritual a short way off. By the time the first magical horse had appeared, the wizard was creating the fourth and final one.\u003c/p\u003e\n\u003cp\u003eEntreri raised his brow. \"Four?\" he asked Sydney. \"We are now five.\"\u003c/p\u003e\n\u003cp\u003e\"Bok could not ride,\" she replied, amused at the notion. \"It will run.\" She turned and headed back toward Dendybar, leaving Entreri with the thought.\u003c/p\u003e\n\u003cp\u003e\"Of course,\" Entreri muttered to himself, somehow less thrilled than ever about the presence of the unnatural thing.\u003c/p\u003e\n\u003cp\u003eBut Catti-brie had begun to view things a bit differently. Dendybar had obviously sent Bok along more to gain an advantage over Entreri than to ensure victory over her friends. Entreri must have known it, too.\u003c/p\u003e\n\u003cp\u003eWithout realizing it, the wizard had set up just the type of nervous environment that Catti-brie hoped for, a tense situation that she might find a way to exploit.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/streams-of-silver-the-icewind-dale-trilogy-2/page-10.html","bookId":2103,"creation":"Oct 5, 2019 5:47:59 PM","modification":"Oct 5, 2019 5:47:59 PM"}
