{"id":64066,"no":18,"title":"Page 18","content":"\u003cp\u003e\"That must have been twenty years ago.\"\u003c/p\u003e\n\u003cp\u003e\"Close to it.\"\u003c/p\u003e\n\u003cp\u003e\"Were you still on the police force?\"\u003c/p\u003e\n\u003cp\u003e\"No, but I wasn\u0027t long off it. I moved into the neighborhood and drank at the local ginmills, most of them long gone now. On the nights when they were ready to quit before I was, there was always Morrissey\u0027s.\"\u003c/p\u003e\n\u003cp\u003e\"There was something very liberating about a drink after hours,\" he said. \"Lord, I drank more in those days than I do now. Nowadays an extra drink makes me sleepy. Back then it was fuel, I could run all day and night on it.\"\u003c/p\u003e\n\u003cp\u003e\"Is that where you learned to drink Irish?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head. \"You know the old formula for success? \u0027Dress British, think Yiddish?\u0027 Well, it spoils the rhyme, but I\u0027d add \u0027drink Irish\u0027 and \u0027eat Italian\u0027 to that, and I learned both of those principles right here in the Village. I learned to drink Irish at the White Horse and the Lion\u0027s Head and right across the street from here at the Blue Mill. Did you ever get to know the Blue Mill when you were at the Sixth?\"\u003c/p\u003e\n\u003cp\u003eI nodded. \"Food wasn\u0027t great.\"\u003c/p\u003e\n\u003cp\u003e\"No, terrible. Vegetables out of cans, and dented cans at that, but you could get a steak for half what it cost most places and if you had a sharp knife you could even manage to cut it.\" He laughed. \"It was a hell of a good place to sit around with friends and drink until closing time. Now it\u0027s calling itself the Grange, and the food\u0027s much better, and you can\u0027t drop in for a quiet drink because you can\u0027t hear yourself think in there. The customers are all my wife\u0027s age or younger, and Christ they\u0027re a noisy bunch.\"\u003c/p\u003e\n\u003cp\u003e\"They seem to like the noise,\" I said.\u003c/p\u003e\n\u003cp\u003e\"It must do something for them,\" he said, \"but I\u0027ve never been able to figure out what. All it does for me is give me a headache.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m the same way.\"\u003c/p\u003e\n\u003cp\u003e\"Listen to us,\" he said. \"We\u0027re a couple of old farts. You\u0027re a lot younger than I am. You\u0027re fifty-five, right?\"\u003c/p\u003e\n\u003cp\u003e\"I guess it stands out all over me.\"\u003c/p\u003e\n\u003cp\u003eHe looked me in the eye. \"I made it my business to learn a little about you,\" he said. \"That can\u0027t come as a surprise to you. I imagine you did the same.\"\u003c/p\u003e\n\u003cp\u003e\"Your credit rating\u0027s good,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s a load off my mind.\"\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re sixty-four.\"\u003c/p\u003e\n\u003cp\u003e\"I mentioned that a few minutes ago, didn\u0027t I? Not that it comes under the heading of closely held information.\" He leaned back, one arm extended along the back of the sofa. \"I was the second-oldest member of the club of thirty-one. Not counting Homer, that is. That\u0027s Homer Champney, he\u0027s the man who founded our chapter.\"\u003c/p\u003e\n\u003cp\u003e\"So I understand.\"\u003c/p\u003e\n\u003cp\u003e\"I was thirty-two then, working for Legal Aid, thinking about joining the Village Independent Democrats and trying to make a place for myself in politics. Trouble was I found the reform Democrats even more odious than the regulars. The old clubhouse hacks were full of crap, but at least they knew it. The reformers were always such sanctimonious little shits. Who knows, if I could have learned to put up with them I might have turned out to be Ed Koch.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a thought.\"\u003c/p\u003e\n\u003cp\u003e\"Frank DiGiulio was about ten months older than me. I barely knew him but I liked him. Face off an old Roman coin. He died, you know.\"\u003c/p\u003e\n\u003cp\u003e\"Last September.\"\u003c/p\u003e\n\u003cp\u003e\"I saw the obit in the Times. That\u0027s the first page I read these days.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m the same way.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s my definition of middle age. It starts the day you pick up the morning paper and turn to the obituaries. When Frank dropped dead, I thought to myself, Well, Gruliow, you\u0027re walking point.\" He frowned. \"As if it would be my turn next. Instead it was Alan Watson. Decent fellow, very straight, stabbed to death for his watch and wallet. You don\u0027t expect that in Forest Hills.\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027ve evidently had more street crime lately. It was a private security guard who found him, and you don\u0027t hire a private security force if you don\u0027t have to.\"\u003c/p\u003e\n\u003cp\u003e\"Sign of the times,\" he said. \"They\u0027ll have them everywhere soon.\" He looked down into his glass of whiskey and soda. \"I had a call from Felicia Karp,\" he said. \"I didn\u0027t know who she was, and when she told me she was Fred Karp\u0027s widow I was still in the dark. Fred Karp? Who the hell was Fred Karp? A lawyer, a mob guy, a radical? Remember, he was a guy I used to see once a year at dinner, and then three years ago I stopped seeing him because he jumped out his office window. So it took me a minute, and then she went on to say that she\u0027d had a visit from a detective, and this chap had told her there was a possibility her husband hadn\u0027t killed himself after all, that he\u0027d been murdered. And she\u0027d seen my name on a list of some sort of club, and it was the one name on the list she recognized, so she was calling in the hope that I could shed some light on the matter.\"\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"And I did what I could to conceal my own ignorance, which at the time was all-encompassing, and told her I\u0027d see what I could find out. I made the obvious phone calls, and when I felt I\u0027d learned enough about you I called you up myself.\" He smiled engagingly. \"And here you are.\"\u003c/p\u003e\n\u003cp\u003e\"And here I am.\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s your client?\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t tell you that.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not an attorney, you know. It\u0027s not privileged information.\"\u003c/p\u003e\n\u003cp\u003e\"And we\u0027re not in court.\"\u003c/p\u003e\n\u003cp\u003e\"No, of course we\u0027re not. I have to assume your client is one of the other surviving members. Unless you\u0027ve been hired by a widow or some other survivor.\" He watched my face as he spoke. \"You\u0027re not giving anything away,\" he said after a moment.\u003c/p\u003e\n\u003cp\u003e\"My client may be willing for you to know who he is. But I\u0027d have to check with him first.\"\u003c/p\u003e\n\u003cp\u003e\" \u0027He, him.\u0027 Hardly a widow, not with those pronouns. Although I think you might be a subtle man, Matt. Are you?\"\u003c/p\u003e\n\u003cp\u003e\"Not very.\"\u003c/p\u003e\n\u003cp\u003e\"I wonder. Still, it almost has to be a group member, doesn\u0027t it? Who else would know the names of all the other members? Although I suppose some of us may have talked openly about the club with our wives.\" A smile, this one a little darker at the corners. \"Our first wives,\" he said. \"If your first divorce teaches you nothing else, it teaches you discretion.\"\u003c/p\u003e\n\u003cp\u003e\"Does it matter who hired me?\"\u003c/p\u003e\n\u003cp\u003e\"Probably not. I like to know everything about people- jurors, witnesses, the lawyer on the other side. Preparation\u0027s everything, you know. The courtroom thearics may make me a hot ticket on the lecture circuit, but it\u0027s the pretrial prep work that wins the cases. And I like to win cases.\"\u003c/p\u003e\n\u003cp\u003eHe asked if I wanted more Perrier. I said I was fine.\u003c/p\u003e\n\u003cp\u003eHe said, \"Well, what\u0027s your best guess, Matt? Is someone killing us off? Or is that confidential, too?\"\u003c/p\u003e\n\u003cp\u003e\"The club\u0027s had a lot of deaths.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t need a detective to tell me that.\"\u003c/p\u003e\n\u003cp\u003e\"Several murders, several suicides, a few accidents that could have been staged. So it looks as though more than coincidence would have to be involved.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"But it\u0027s impossible. The killer would almost have to be one of you, and there\u0027s no motive, no financial incentive, at least none I\u0027m aware of. Or am I missing something?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" he said. \"There was some talk early on about laying down a case of good Bordeaux for the last man to drink. We decided whoever was left would be too old to enjoy it. Besides, it seemed inappropriate, even frivolous.\"\u003c/p\u003e\n\u003cp\u003e\"So the killer would have to be crazy,\" I said. \"And not just sudden-impulse crazy, because he\u0027d have been at it for years. He\u0027d have to be long-term crazy, and all fourteen of you look to have been leading sane and stable lives.\"\u003c/p\u003e\n\u003cp\u003e\"Ha,\" he said. \"I\u0027ve got two ex-wives who would give you an argument on that point, and I could name a few other people who\u0027d be quick to tell you I\u0027m only eating with one chopstick. Maybe I\u0027m the killer.\"\u003c/p\u003e\n\u003cp\u003e\"Are you?\"\u003c/p\u003e\n\u003cp\u003e\"How\u0027s that again?\"\u003c/p\u003e\n\u003cp\u003e\"Are you the killer? Did you kill Watson and Cloonan and the others?\"\u003c/p\u003e\n\u003cp\u003e\"My God, what a question. No, of course not.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that\u0027s a load off my mind.\"\u003c/p\u003e\n\u003cp\u003e\"Am I a suspect?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t have any suspects.\"\u003c/p\u003e\n\u003cp\u003e\"But did you seriously think-\"\u003c/p\u003e\n\u003cp\u003e\"That you might have done it? No idea. That\u0027s why I asked.\"\u003c/p\u003e\n\u003cp\u003e\"You think I would have told you?\"\u003c/p\u003e\n\u003cp\u003e\"You might have,\" I said. \"Stranger things have happened.\"\u003c/p\u003e\n\u003cp\u003e\"Jesus.\"\u003c/p\u003e\n\u003cp\u003e\"What I was taught to do,\" I said, \"was ask all the questions, including the stupid ones. You never know what somebody\u0027ll decide to tell you.\"\u003c/p\u003e\n\u003cp\u003e\"Interesting. In a trial it\u0027s the exact opposite. There\u0027s a basic principle, you never ask a question of a witness unless you already know the answer.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d think it would be hard to learn anything that way.\"\u003c/p\u003e\n\u003cp\u003e\"Education,\" he said, \"is not the object. I\u0027m going to have another drink. Join me?\"\u003c/p\u003e\n\u003cp\u003eI let him top up my Perrier.\u003c/p\u003e\n\u003cp\u003eI said, \"I\u0027ll tell you this much. I was surprised to see your name on the list of members.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"It seemed to me,\" I said, \"that it was an unusual group for you to join.\"\u003c/p\u003e\n\u003cp\u003eHe snorted. \"I\u0027d say it\u0027s an unusual club for anybody to join. An annual celebration of mortality, for God\u0027s sake. Why would anybody want to sign on for that?\"\u003c/p\u003e\n\u003cp\u003e\"Why did you?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s hard to remember,\" he said. \"I was much younger then, obviously. Undefined personally and professionally. If Karp\u0027s widow- what was her name, Felicia?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"You name a child Felicia and you\u0027re just daring the whole world to call her Fellatio, aren\u0027t you? If Felicia Karp had seen my name on a list in 1961, she wouldn\u0027t have looked at it twice. Unless she thought Gruliow was a typographical error. I ran into that years ago, you know. People thought it must be Grillo.\"\u003c/p\u003e\n\u003cp\u003e\"Now they know the name.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, no question. The name, the face, the hair, the voice, the sardonic wit. Everybody knows Hard-Way Ray Gruliow. Well, it\u0027s what I wanted. And that\u0027s a great curse, you know. \u0027May you get what you want.\u0027 Hell of a thing to wish on a man.\"\u003c/p\u003e\n\u003cp\u003e\"The price of fame,\" I said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not so bad. I get tables in restaurants, I get strangers saying hello to me on the street. There\u0027s a coffee shop on Bleecker Street named a sandwich after me. You go in there and order a Ray Gruliow and they\u0027ll bring you some godforsaken combination of corned beef and raw onion and I don\u0027t know what else.\"\u003c/p\u003e\n\u003cp\u003eHis second drink was darker than the first, and he looked to be making it disappear faster.\u003c/p\u003e\n\u003cp\u003e\"Of course it\u0027s not all corned beef and onions,\" he said. \"Sometimes they break your windows.\"\u003c/p\u003e\n\u003cp\u003eMy eyes went to the front window.\u003c/p\u003e\n\u003cp\u003e\"Replaced,\" he said. \"That\u0027s high-impact plastic. It looks like glass, unless the light hits it just right, but it\u0027s not. It\u0027s supposed to stop bullets. Not high-velocity rounds, concrete won\u0027t stop them, but your run-of-the-mill gunshot ought to be deflected. It was a shotgun last time around, and I\u0027m told shotgun pellets will bounce right off of my new window. Won\u0027t even mar the finish.\"\u003c/p\u003e\n\u003cp\u003e\"They never caught the guy, did they?\"\u003c/p\u003e\n\u003cp\u003eHe cocked his head. \"You don\u0027t really think they knocked themselves out trying, do you? I think the shooter was a cop.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/a-long-line-of-dead-men-matthew-scudder-12/page-18.html","bookId":2330,"creation":"Oct 5, 2019 9:53:24 AM","modification":"Oct 5, 2019 9:53:24 AM"}
