{"id":64055,"no":7,"title":"Page 7","content":"\u003cp\u003e\"You seem dubious.\"\u003c/p\u003e\n\u003cp\u003e\"Well, they\u0027ve been doing this for thirty-two years. Do you really think nobody let something slip in all that time?\" I shrugged. \"Still, the fourteen surviving members would have to be the chief suspects.\"\u003c/p\u003e\n\u003cp\u003e\"But why on earth would one of them want to kill the others?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know.\"\u003c/p\u003e\n\u003cp\u003e\"I mean, if you got sick of the whole thing, couldn\u0027t you just quit? Didn\u0027t anybody ever resign, incidentally?\"\u003c/p\u003e\n\u003cp\u003e\"After two or three years, Homer Champney read the group a letter from one of the members who\u0027d written to explain that he no longer wanted to participate. He\u0027d relocated in California and didn\u0027t see the point in flying three thousand miles each way for a steak dinner. He had written to suggest that they might want to replace him. They all agreed with Champney that it was against the spirit of the thing to take in any replacement members, and somebody- Hildebrand thinks it would have been Champney- was going to write a letter designed to draw him back into the fold.\"\u003c/p\u003e\n\u003cp\u003e\"What happened?\"\u003c/p\u003e\n\u003cp\u003e\"I guess the letter got written, and it seems to have worked. A year later the would-be dropout was back at the dinner table.\"\u003c/p\u003e\n\u003cp\u003e\"Just in time for some fatted calf,\" she said. \"Well, there you go. They wouldn\u0027t let him leave, so he was quietly smoldering with resentment. He\u0027s been getting back at them ever since, killing them off one man at a time.\"\u003c/p\u003e\n\u003cp\u003e\"By God,\" I said. \"I think you\u0027ve cracked the case wide open.\"\u003c/p\u003e\n\u003cp\u003e\"No, huh?\"\u003c/p\u003e\n\u003cp\u003e\"I forget the guy\u0027s name, but I\u0027ve got it written down. He never did miss another meeting, and if he had a resentment he kept it hidden remarkably well. Wayne Fletcher, that was his name. Hildebrand says Fletcher used to joke about the time he tried to quit, that it would have been easier to resign from the Mafia.\"\u003c/p\u003e\n\u003cp\u003e\"Used to?\"\u003c/p\u003e\n\u003cp\u003e\"He died eight or nine years ago, if I remember correctly. I don\u0027t remember the circumstances, but it\u0027s in my notes. It\u0027s hard to keep it all straight. So many men, and so many of them dead.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s so sad,\" she said. \"Don\u0027t you think it\u0027s sad?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Even if nobody\u0027s killing anybody, even if all the deaths are perfectly natural, there\u0027s something absolutely heartbreaking about the idea of this group just dwindling away. I suppose it\u0027s life, but that makes life a pretty sad business.\"\u003c/p\u003e\n\u003cp\u003e\"Well,\" I said, \"who ever said it wasn\u0027t?\"\u003c/p\u003e\n\u003cp\u003eOn the way past the desk we traded greetings with the concierge. We had our individual names on the mailbox and the building\u0027s directory, but as far as the staff was concerned we were Mr. and Mrs. Scudder.\u003c/p\u003e\n\u003cp\u003eELAINE MARDELL, her shop sign says.\u003c/p\u003e\n\u003cp\u003eUpstairs, she made coffee while I went over my notes. Wayne Fletcher had died six years ago, not eight or nine, of complications arising from coronary-bypass surgery. I told Elaine as much when she came into the living room with her tea and my coffee.\u003c/p\u003e\n\u003cp\u003e\"It may have been borderline malpractice,\" I said, \"according to Hildebrand, but it\u0027s a real stretch to call it murder.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s something. The poor man didn\u0027t sign his own death warrant when he let himself be talked into rejoining the group.\"\u003c/p\u003e\n\u003cp\u003e\"Unless someone visited him in the hospital,\" I went on, \"and tampered with his IV.\"\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t even think of that,\" she said. \"Honey, are you going to be able to check out all of this on your own? It sounds as though you\u0027ll have to go in a dozen different directions at once. And how much help can TJ be?\"\u003c/p\u003e\n\u003cp\u003eTJ is a black teenager with no fixed address beyond his beeper number. \"He\u0027s resourceful,\" I reminded Elaine.\u003c/p\u003e\n\u003cp\u003e\"So he says,\" she said, \"and so he is, but somehow I can\u0027t see him interviewing middle-aged businessmen at the Addison Club.\"\u003c/p\u003e\n\u003cp\u003e\"He can do some legwork for me. As far as the rest of it goes, I won\u0027t have to go over all seventeen deaths with a magnifying glass and a pair of tweezers. All I have to do is find out for certain if there\u0027s a pattern of serial murder operating, and be able to support that argument with enough evidence so I can turn it over to the cops and be sure they\u0027ll give it their undivided attention. If I can bring that off, the case will get the benefit of a full-scale official investigation without starting out as a media circus.\"\u003c/p\u003e\n\u003cp\u003e\"God, once the press gets hold of it-\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"Can you imagine what they\u0027d do with it on Inside Edition or Hard Copy? The club would come off sounding like a cult of moon worshipers.\"\u003c/p\u003e\n\u003cp\u003e\"I know.\"\u003c/p\u003e\n\u003cp\u003e\"And Boyd Shipton was a member. That wouldn\u0027t exactly discourage their interest.\"\u003c/p\u003e\n\u003cp\u003e\"No, he\u0027d still be news. And he wasn\u0027t the only prominent member, either. Ray Gruliow is guaranteed front-page news. And Avery Davis is a member.\"\u003c/p\u003e\n\u003cp\u003e\"The real estate developer?\"\u003c/p\u003e\n\u003cp\u003e\"Uh-huh. And two of the dead men were writers, and one of them had some plays produced.\" I looked at my notes. \"Gerard Billings,\" I said.\u003c/p\u003e\n\u003cp\u003e\"He was a playwright?\"\u003c/p\u003e\n\u003cp\u003e\"No, that was Tom Cloonan. Billings is a broadcaster, he does the weather report on Channel Nine.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, Gerry Billings, with the bow ties. Gosh, maybe you can get his autograph.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m just saying he\u0027s in the public eye.\"\u003c/p\u003e\n\u003cp\u003e\"A mote in the public eye,\" she said, \"but I see what you mean.\" She fell silent, and I went back to sifting my notes. After a few minutes she said, \"Why?\"\u003c/p\u003e\n\u003cp\u003e\"Huh?\"\u003c/p\u003e\n\u003cp\u003e\"It just struck me. All these deaths over all those years. It\u0027s not like a disgruntled postal employee showing up on the job with an AK-47. Whoever is doing this must have a reason.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027d think so.\"\u003c/p\u003e\n\u003cp\u003e\"Is there money in it?\"\u003c/p\u003e\n\u003cp\u003e\"So far there\u0027s twenty-five hundred in it for me. If Hildebrand\u0027s check is good, and if I can remember to deposit it.\"\u003c/p\u003e\n\u003cp\u003e\"I meant for the killer.\"\u003c/p\u003e\n\u003cp\u003e\"I figured you did. Well, if he gets a good agent maybe he\u0027ll do all right when they make the miniseries. But if he gets away with it there won\u0027t be a miniseries, so where does that leave him?\"\u003c/p\u003e\n\u003cp\u003e\"High and dry. Don\u0027t you get something for being the last man alive?\"\u003c/p\u003e\n\u003cp\u003e\"You get to start the next chapter,\" I said. \"You get the right to read the names of the dead.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re sure they don\u0027t all leave their money to each other?\"\u003c/p\u003e\n\u003cp\u003e\"Positive.\"\u003c/p\u003e\n\u003cp\u003e\"They don\u0027t each kick in a thousand dollars to start things off, and the money got invested in a small upstate corporation that changed its name to Xerox? No, huh?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid not.\"\u003c/p\u003e\n\u003cp\u003e\"And the whole club isn\u0027t some kind of a tom-tom?\"\u003c/p\u003e\n\u003cp\u003e\"Huh?\"\u003c/p\u003e\n\u003cp\u003e\"Wrong word,\" she said. \"A tom-tom\u0027s a drum. Dammit, what\u0027s the word I want?\"\u003c/p\u003e\n\u003cp\u003e\"Where are you going?\"\u003c/p\u003e\n\u003cp\u003e\"To look it up in the dictionary.\"\u003c/p\u003e\n\u003cp\u003e\"How can you look it up,\" I wondered, \"if you don\u0027t know what it is?\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t answer, and I drank the rest of my coffee and went back to my notes. \"Ha!\" she said, a few minutes later, and I looked up. \"Tontine,\" she said. \"That\u0027s the word. It\u0027s an eponym.\"\u003c/p\u003e\n\u003cp\u003e\"Is that a fact.\"\u003c/p\u003e\n\u003cp\u003eShe gave me a look. \"That means it was named for somebody. Lorenzo Tonti, to be specific. He was a Neapolitan banker who thought it up back in the seventeenth century.\"\u003c/p\u003e\n\u003cp\u003e\"Thought what up?\"\u003c/p\u003e\n\u003cp\u003e\"The tontine, although I don\u0027t suppose he called it that. It was a sort of a cross between life insurance and a lottery. You signed up a batch of subscribers and they each put up a sum of money into a common fund.\"\u003c/p\u003e\n\u003cp\u003e\"And it was winner take all?\"\u003c/p\u003e\n\u003cp\u003e\"Not necessarily. Sometimes it was set up so that the funds were distributed when the survivors were down to five or ten percent of the original number. Others, smaller ones, stayed locked up until there was only one person left alive. People would be enrolled by their parents in early childhood, and if the investments did well they could wind up looking at a fortune. But they couldn\u0027t collect it unless they outlived the other participants.\"\u003c/p\u003e\n\u003cp\u003e\"You got all this from the dictionary?\"\u003c/p\u003e\n\u003cp\u003e\"I got the word from the dictionary,\" she said, \"so I\u0027d know what to look up in the encyclopedia. I knew the word, I just couldn\u0027t think of it. Fifteen or twenty years ago I spent a weekend at an inn in the Berkshires. There was this historical novel on the subject, I think it was even called The Tontine, and somebody had left a copy there and I picked it up. I was only a third of the way through it when it was time to leave, so I stuck it in my bag.\"\u003c/p\u003e\n\u003cp\u003e\"I think God\u0027ll forgive you for that.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s already punished me. I read it all the way through, and do you know what it said on the bottom of the last page?\"\u003c/p\u003e\n\u003cp\u003e\" \u0027Then she awoke and found it had all been a horrible dream.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Worse than that. It said, \u0027End of Volume One.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"And you were never able to find Volume Two.\"\u003c/p\u003e\n\u003cp\u003e\"Never. Not that I made searching for it my life\u0027s work. But I would have liked to know how it all came out. There were times over the years when that\u0027s what kept me from jumping out the window. I\u0027m not talking about the book, I\u0027m talking about life. Wanting to know how it all comes out.\"\u003c/p\u003e\n\u003cp\u003eI said, \"You really look beautiful tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Why, thank you,\" she said. \"What brought that on?\"\u003c/p\u003e\n\u003cp\u003e\"I was just struck by it. Watching the play of emotions on your face. You\u0027re a beautiful woman, but sometimes it all shows- the strength, the softness, everything.\"\u003c/p\u003e\n\u003cp\u003e\"You old bear,\" she said, and sat down on the couch next to me. \"Keep saying sweet things like that and I\u0027ve got a pretty good idea how tonight\u0027s going to turn out.\"\u003c/p\u003e\n\u003cp\u003e\"So have I.\"\u003c/p\u003e\n\u003cp\u003e\"Oh? Give me a kiss, then, and we\u0027ll see if you\u0027re right.\"\u003c/p\u003e\n\u003cp\u003eAfterward, as we were lying side by side, she said, \"You know, when I was saying earlier that the club was a real guy thing, I wasn\u0027t just making war-between-the-sexes jokes. It\u0027s very much a male province, getting together to work out a relationship with mortality. You boys like to look at the big picture.\"\u003c/p\u003e\n\u003cp\u003e\"And girls just want to have fun?\"\u003c/p\u003e\n\u003cp\u003e\"And pick out drapes,\" she said, \"and exchange recipes, and talk about men.\"\u003c/p\u003e\n\u003cp\u003e\"And shoes.\"\u003c/p\u003e\n\u003cp\u003e\"Well, shoes are important. You\u0027re an old bear. What do you know about shoes?\"\u003c/p\u003e\n\u003cp\u003e\"Precious little.\"\u003c/p\u003e\n\u003cp\u003e\"Exactly.\" She yawned. \"I\u0027m making it sound as though women\u0027s concerns are trivial, and I don\u0027t think that for a minute. But I do believe we take shorter views. Can you think of a single female philosopher? Because I can\u0027t.\"\u003c/p\u003e\n\u003cp\u003e\"I wonder why that is.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s probably biological, or anthropological, anyway. When you guys finished hunting and gathering, you could sit around the campfire and think long thoughts. Women didn\u0027t have time for that. We had to be more centered on home and hearth.\" She yawned again. \"I could formulate a theory,\" she said, \"but I\u0027m one of those practical broads, and I\u0027m going to sleep. You work it out, okay?\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t know that I worked anything out, but a few minutes later I said, \"What about Hannah Arendt? And Susan Sontag? Wouldn\u0027t you call them philosophers?\"\u003c/p\u003e\n\u003cp\u003eI didn\u0027t get an answer. Ms. Practicality was sleeping.\u003c/p\u003e\n\u003cp\u003e6 \u003c/p\u003e","sourceLink":"https://allnovel.net/a-long-line-of-dead-men-matthew-scudder-12/page-7.html","bookId":2330,"creation":"Oct 5, 2019 9:53:24 AM","modification":"Oct 5, 2019 9:53:24 AM"}
