{"id":97725,"no":30,"title":"Page 30","content":"\u003cp\u003eWhat is your name? \u0026gt; \u0026lt; Requires Adjustment. But you are an AI. So like the Forerunner ones. \u0026gt; Oh, real y? The Forerunner comment intrigued BB but he’d return to that later. Right now his priority was to keep the Engineer out of their systems until they’d worked out what to do with him. Perhaps just asking him not to tinker with the ship would be enough. The creature was certainly intel igent enough to understand their reluctance.\u003c/p\u003e\n\u003cp\u003e\u0026lt; I am Black-Box. Address me as BB. Do not access the ship’s systems until we ask you. I have some fascinating work for you to do, but first we must take you on a journey. \u0026gt; Requires Adjustment seemed satisfied for the moment. \u0026lt; Good, \u0026gt; he signed. \u0026lt; Good. \u0026gt; “So?” Mal twisted his head as far as he could to see where the tentacles had wound around his backpack. “What was al that about?”\u003c/p\u003e\n\u003cp\u003e“It’s a he and he’s cal ed Requires Adjustment,” BB said, resolving into a tidy box again. “I think I’m going to cal him the Adj. Gives him a quasi- military chumminess, I think.”\u003c/p\u003e\n\u003cp\u003e“Wel , we’re never going to sign wel enough to speak to him direct, so I suppose that makes you his agent,” Vaz said.\u003c/p\u003e\n\u003cp\u003eHe reached out a wary finger to touch Adj as if he’d never seen a Huragok before. These ODSTs had led relatively sheltered lives by ONI’s standards, but in intel igence terms, they were clean; no complicated associations with other ONI officers or senior commanders, or any previous knowledge of the service other than a healthy dread. BB thought that was a smart move. They were just efficient, wil ing, intel igent marines, top- grade raw material for Osman to shape to her own unique needs.\u003c/p\u003e\n\u003cp\u003eAnd you’ll need them when the Admiral finally passes the baton to you, Captain. You really will.\u003c/p\u003e\n\u003cp\u003eThe Adj slithered one tentacle around Mal’s neck and slackened his grip, visibly calmer.\u003c/p\u003e\n\u003cp\u003e“They’re very appealing, aren’t they?” Vaz said.\u003c/p\u003e\n\u003cp\u003e“Wel , you can take him for walks, then.” Mal went over to the armor racks with Adj stil draped around his shoulders and tapped his old helmet to encourage the Engineer to look at a new toy. “Go on, Adj. Look at that nice armor. Lovely armor. Isn’t that fun? Good boy! Do the business.”\u003c/p\u003e\n\u003cp\u003eAdj reached out a tentacle and explored the helmet for a few seconds, then let go of Mal and floated free. BB decided the language barrier wasn’t going to be a major problem. Adj worked over the armor in a flurry of tentacles and cilia, removing components and parking them in his free tentacles while he made adjustments and general y tinkered.\u003c/p\u003e\n\u003cp\u003eOsman had that half-lidded look that said she was pleased. “Parangosky’s going to love this.”\u003c/p\u003e\n\u003cp\u003e“But we need another one,” BB pointed out. How odd to look at Osman through human eyes. “And it’s cruel to keep one on its own, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“Yes, it is,” Naomi said. BB decided to take that at face value.\u003c/p\u003e\n\u003cp\u003eOsman looked over Adj wistful y. “I know I should send him back to HQ, but he real y would be useful on a mission like this. Let’s see what the Admiral’s got to say. Was there any food for him in the ship? They do need nutrients, don’t they?”\u003c/p\u003e\n\u003cp\u003e“If there isn’t, I can formulate an amino acid mix.” BB wanted to search Piety anyway. There was plenty of work to do to her before she was sent on her Marie Celeste-like way. “Come on, Naomi. Housekeeping time.”\u003c/p\u003e\n\u003cp\u003eNaomi climbed back into Piety and dragged the dead Jiralhanae aside to get at the crates. She pried one lid open and rummaged around inside, turning over assorted hand weapons and spare power packs.\u003c/p\u003e\n\u003cp\u003e“BB,” she said, “are you sure this ship was heading toward Sanghelios, not away from it?”\u003c/p\u003e\n\u003cp\u003e“Definitely. Plug me into her nav computer and I’l confirm it. Why do you ask?”\u003c/p\u003e\n\u003cp\u003e“Have you scanned this stuff for tags?”\u003c/p\u003e\n\u003cp\u003eHe hadn’t. The only tags he would check for would be those on the arms supplied to ‘Telcam, and this shipment didn’t fal under that heading.\u003c/p\u003e\n\u003cp\u003e“I’l do that right now,” he said, embarrassed, and activated the signal via her radio. “Oh…”\u003c/p\u003e\n\u003cp\u003eHe got a return. Four, in fact. There were four weapons in this shipment that had been supplied by ONI and handed over to ‘Telcam.\u003c/p\u003e\n\u003cp\u003e“Maybe there’s a simple explanation for this,” Naomi said. “Let’s check Piety’s nav computer.”\u003c/p\u003e\n\u003cp\u003eURBAN STRUCTURE, FORERUNNER DYSON SPHERE, ONYX: LOCAL DATE NOVEMBER 2552.\u003c/p\u003e\n\u003cp\u003eThe Forerunners must have been pretty confident about their engineering skils, because there were no stairs here.\u003c/p\u003e\n\u003cp\u003eMendez stood in the lobby and looked around for an alternative to stepping into a rectangular opening that looked exactly like an elevator. He already had one Spartan missing. He didn’t plan on adding any more.\u003c/p\u003e\n\u003cp\u003eWho’d build a tower block with no goddamn emergency stairs?\u003c/p\u003e\n\u003cp\u003e“Clear right, Chief,” Linda cal ed. She backed out of a smal side lobby, rifle raised, and rejoined the cluster of Spartans watching the main entrance and the doors leading onto the lobby. “I’m not picking up any movement on my HUD. And no EM. Nothing at al . It’s deserted.”\u003c/p\u003e\n\u003cp\u003eThe lobby was built in the same pale gold stone as the towers, completely empty and with no sign of ever having been used or occupied.\u003c/p\u003e\n\u003cp\u003eMendez had cleared plenty of abandoned buildings in his time on colony worlds, kicking doors open and checking room by room for booby traps.\u003c/p\u003e\n\u003cp\u003eThe floors were usual y scattered with the sad debris of normal lives that had been interrupted for one reason or another, even if it was just scraps of paper or broken glass. But he’d never seen anything as sterile as this. There wasn’t a single trace of dust or evidence of wear on anything. The place could have been constructed yesterday, except he’d never seen a new building quite this clean.\u003c/p\u003e\n\u003cp\u003e“Wel , if we want a vantage point,” he said, “we have to get up top somehow.”\u003c/p\u003e\n\u003cp\u003eMendez walked outside again and stood back to count the windows. There were seven openings top to bottom, but he had no way of tel ing if the spacing meant there were a few floors with very high ceilings, or if some floors just didn’t have any natural light. He went back in and paused at the entrance to the elevator.\u003c/p\u003e\n\u003cp\u003eI hope that’s what it is, anyway. Assumptions get you killed.\u003c/p\u003e\n\u003cp\u003e“Come on, Chief.” Fred put one boot on the floor of the elevator cage. “Nobody goes anywhere on their own until we figure out how this maze works. Everyone else—stay put.”\u003c/p\u003e\n\u003cp\u003eMendez stepped in beside Fred. The two of them stood there for a moment, looking around for anything that resembled controls. Maybe it was a gravity lift: there were no signs on the wal s at al , recognizable or otherwise. The ceiling of the elevator cage didn’t give Mendez any clues either, but then his stomach lurched and he realized he was moving. The entrance vanished below them.\u003c/p\u003e\n\u003cp\u003e“Okay, people, going up,” Fred said. “I don’t know what the Chief did, but it worked.”\u003c/p\u003e\n\u003cp\u003e“I just looked up,” Mendez said.\u003c/p\u003e\n\u003cp\u003e“Okay, so maybe it responds to that. Up for up, down for down…”\u003c/p\u003e\n\u003cp\u003e“And stop?”\u003c/p\u003e\n\u003cp\u003eThey were now looking at a blank wal and it was hard to tel if they were stil moving. Mendez shut his eyes for a moment to see if he could detect motion, but he wasn’t sure of it until he saw the opening onto another floor slide slowly past them. Another open floor fol owed, then another.\u003c/p\u003e\n\u003cp\u003e“Wel , that’s two, and I counted seven.”\u003c/p\u003e\n\u003cp\u003e“That’s … three.” The cage rose past another opening. “And four…”\u003c/p\u003e\n\u003cp\u003eLight spread down from the tight seam between the cage and the wal , indicating another floor coming. Mendez reached toward the wal , and the cage slowed to a stop. It leveled out with the fifth floor and waited.\u003c/p\u003e\n\u003cp\u003e“You’ve got a way with elevators, Chief.” Fred stuck his head out to take a look, boots stil inside the cage area. “Very hygienic. No germ-laden buttons.”\u003c/p\u003e\n\u003cp\u003eMendez tried out his newfound mastery and looked up to the ceiling again. The floor began to rise. “Yeah, the more I see, the more I wonder if this is some decontamination facility. It feels like a hospital.”\u003c/p\u003e\n\u003cp\u003e“If you were escaping from the Flood, and this is the first place you end up after you get into the Dyson sphere, that makes sense.”\u003c/p\u003e\n\u003cp\u003eMendez watched floor six go by. He’d expected Kel y to be on the radio by now, passing on Halsey’s questions as the resident Forerunner expert, but she hadn’t cal ed in.\u003c/p\u003e\n\u003cp\u003e“How long do you think this place has been here, Lieutenant?”\u003c/p\u003e\n\u003cp\u003e“In real time or the Dyson time? I’d guess thousands of years.”\u003c/p\u003e\n\u003cp\u003e“I came here twenty-odd years ago,” Mendez said. “We were sitting right on top of this thing al that time and never knew it was here.”\u003c/p\u003e\n\u003cp\u003eHe heard the slight drop-out on Fred’s helmet audio as the lieutenant muted his radio. “Dr. Halsey’s real y upset about that, Chief.”\u003c/p\u003e\n\u003cp\u003e“Yes, she’s already indicated her displeasure to me, sir. But I answer to the chain of command. Not a civilian.”\u003c/p\u003e\n\u003cp\u003e“Understood, Chief.”\u003c/p\u003e\n\u003cp\u003eOfficer or no officer, Fred was like anyone else in the UNSC. A senior NCO like Mendez could put him politely in his place and get away with it.\u003c/p\u003e\n\u003cp\u003eEven admirals trod careful y around old senior chiefs. Halsey would just have to suck it up. Mendez wasn’t on her private staff, and the Spartan project wasn’t her patented property.\u003c/p\u003e\n\u003cp\u003e“Seven,” he said, and the elevator stopped without any gestures from him.\u003c/p\u003e\n\u003cp\u003eThey stepped out onto an empty floor and worked their way around it, overlapping cover. But if this was accommodation or an emergency center of some kind then it certainly wasn’t ready for an influx of refugees. There wasn’t a stick of furniture in the place. However advanced the Forerunners’ technology had been, Mendez was sure they’d stil have needed chairs or beds, however unrecognizable those might now be to a human being. But the place was just a shel . He inhaled, trying to pick up any smel of decay, but if anything had rotted away here then it was long past the decomposition stage.\u003c/p\u003e\n\u003cp\u003e“Good view.” Fred reached the window and leaned on the sil . “There’s some kind of glass in this, not that you can see it.”\u003c/p\u003e\n\u003cp\u003eMendez stood beside him and took his binoculars out of his pack. “You see anything I can’t, Lieutenant?”\u003c/p\u003e\n\u003cp\u003e“Looks like a ghost town,” Fred murmured. “Nothing moving. Nothing on infrared. No active radio channels except ours.” He moved his head back and forth as if he was trying to focus. “Blue Team, everybody got those images?”\u003c/p\u003e\n\u003cp\u003eOlivia responded. “Got it, sir.”\u003c/p\u003e\n\u003cp\u003eAs ghost towns went, it looked pretty good. Below the window, an elegant but apparently dead city stretched as far as Mendez could see. The buildings were a mix of sleek towers, single-story domed structures, and sprawling low-rises that could have been anything from theaters to warehouses. Mendez had no idea if the Forerunners had had that kind of society, but the size of most of the doors was the same as back home.\u003c/p\u003e\n\u003cp\u003eThat told him more about them than he’d first realized.\u003c/p\u003e\n\u003cp\u003eHe tapped his radio. He was fed up waiting for the shoe to drop. “Kel y, everything okay back there?”\u003c/p\u003e\n\u003cp\u003e“Stil no sign of her, Chief.” Kel y must have said something to Halsey because the mike cut out for a moment. “Interesting recon you’ve got going there.”\u003c/p\u003e\n\u003cp\u003e“Empty. Just shel s of buildings.”\u003c/p\u003e\n\u003cp\u003e“Never mind. We’ve got fruit and lizards. A girl can whip up a decent meal from those.”\u003c/p\u003e\n\u003cp\u003e“What’s Halsey doing?”\u003c/p\u003e\n\u003cp\u003e“Running translations on the Forerunner controls. She says it’s just a maintenance area but there’s stil some symbols she’s not sure about.”\u003c/p\u003e\n\u003cp\u003e“I’l trust her not to press any buttons she can’t translate. Mendez out.”\u003c/p\u003e\n\u003cp\u003eFred just looked at him. The visor might as wel not have been there. Mendez avoided the discussion and headed back to the elevator, and the two of them didn’t say another word on the way down.\u003c/p\u003e\n\u003cp\u003eDamn. An elevator’s an elevator wherever it is. I could be back in Sydney avoiding an awkward conversation like this. Not in some slipspace bubble in God knows where.\u003c/p\u003e\n\u003cp\u003eHe stepped out into the lobby and walked over to the doorway to gaze at the deserted street. On the open radio channel, he could hear the Spartans cal ing out cleared rooms, finding nothing. Fred ambled over to stand next to him.\u003c/p\u003e\n\u003cp\u003e“Halsey said this sphere’s about the same diameter as Earth’s orbit. That’s a hel of a big place to recon.”\u003c/p\u003e\n\u003cp\u003e“Maybe, but if there was any civilization here, even one that makes us look like chimps, then we’d pick up something,” Mendez said. “Even if we couldn’t receive up their comms, we’d detect something.”\u003c/p\u003e\n\u003cp\u003e“We might be here a very long time, Chief.”\u003c/p\u003e\n\u003cp\u003e“And you want Mom and Dad to get on.”\u003c/p\u003e\n\u003cp\u003e“Something like that. What changed?”\u003c/p\u003e\n\u003cp\u003e“Me.”\u003c/p\u003e\n\u003cp\u003eOlivia and Linda emerged from the elevator. “Al clear, sir,” Olivia said. “Okay if we go check out the other buildings? Some of them look like storage facilities.”\u003c/p\u003e\n\u003cp\u003e“Go ahead.” Fred nodded toward the door. “We’l be right behind you.”\u003c/p\u003e\n\u003cp\u003eThe two women went off up the road. Fred didn’t seem about to resume the conversation, so Mendez changed the topic.\u003c/p\u003e\n\u003cp\u003e“We ought to pick a spot to set up camp for the night,” he said. “Which might sound crazy when we’ve got a few mil ion square meters of prime accommodation to choose from, but I haven’t seen a faucet around here yet. Somewhere near the river’s our best bet.”\u003c/p\u003e\n\u003cp\u003e“Yeah, where there’s water, there’l be fish and animals.” Fred looked toward the elevator and the sound of voices. “And I’d rather be near the towers.”\u003c/p\u003e\n\u003cp\u003eHe didn’t need to say why. Tom, Mark, and Ash came out of the elevator and shrugged. Fred gestured to the street.\u003c/p\u003e\n\u003cp\u003e“Three hours, max,” he said. “Then we regroup at the tower.”\u003c/p\u003e\n\u003cp\u003eMendez gave the Spartans a few minutes’ start to put some diplomatic distance between them before fol owing with Fred. A crisis was a handy thing. It could stop him from thinking about the slow-burning, intractable problems. Al that mattered right then was finding Lucy and keeping the team alive and fed. Thinking beyond that was asking for trouble. \u003c/p\u003e","sourceLink":"https://allnovel.net/halo-glasslands-halo-8/page-30.html","bookId":1639,"creation":"Oct 5, 2019 6:29:30 PM","modification":"Oct 5, 2019 6:29:30 PM"}
