{"id":75891,"no":41,"title":"Page 41","content":"\u003cp\u003eAuthor: Kirsty Moseley\u003c/p\u003e\n\u003cp\u003eChapter 18\u003c/p\u003e\n\u003cp\u003eThe next morning, after Liam had snuck out of my window, I went to the kitchen to see Jake sitting there chatting to my mom. “Good morning,” I chirped happily.\u003c/p\u003e\n\u003cp\u003eMy mom looked at me a little shocked. “What are you so happy about this morning?” she asked, smiling.\u003c/p\u003e\n\u003cp\u003eI grinned and suppressed a giggle; I couldn’t very well tell her that my hottie of a boyfriend had just given me a very good reason to be smiling before he climbed back out of my window. So instead, I just shrugged. “Why not?” I countered, looking anywhere but Jake. He probably knew the exact reason for my happy, satisfied face. “So, Jake, anything you want to tell me?” I teased, sitting down next to him.\u003c/p\u003e\n\u003cp\u003eHe shook his head, looking confused. “No. Should there be?” he asked, raising an eyebrow suspiciously.\u003c/p\u003e\n\u003cp\u003e“You, crushing on my best friend perhaps?” I suggested, nudging him with my shoulder gently.\u003c/p\u003e\n\u003cp\u003eHe gasped and spilt a spoonful of cereal onto the kitchen counter; he composed himself quickly and smirked at me. “I’m not crushing on your best friend. That’s your job, remember?” he said sarcastically. I couldn’t help but laugh, him being all defensive wasn’t helping his case, if he felt nothing for her then he would have just gone along with it or made some slutty comment.\u003c/p\u003e\n\u003cp\u003e“Yeah OK. Whatever you say, Jake. I’ve got my eye on you. Just don’t hurt her,” I stated, grabbing a bowl and making some cereal.\u003c/p\u003e\n\u003cp\u003eLiam walked through the door, and I would imagine that if my face looked like his, then that’s probably why my mom was asking what I was so happy about. He was grinning from ear to ear. “Morning,” he greeted, giving Jake one of those cheesy fist punches on the way past.\u003c/p\u003e\n\u003cp\u003e“Good morning, Liam. Breakfast?” my mom offered, holding up some bread.\u003c/p\u003e\n\u003cp\u003eHe nodded, smiling gratefully. “Sure, Margaret, that’d be great.” He wrapped his arms around me from behind. “Hey, Angel. I missed you last night,” he purred.\u003c/p\u003e\n\u003cp\u003eI heard my mom ‘aww’ quietly and I tried not to laugh. “Oh you did, huh?” I said, slapping his hand as he moved it down between my legs under the counter.\u003c/p\u003e\n\u003cp\u003eHe laughed and moved to stand next to me. “Absolutely I did. I liked sleeping in with you the other night. Maybe your mom will let me sleep in with you from now on,” he said, looking at my mom hopefully.\u003c/p\u003e\n\u003cp\u003e“Don’t push it, Liam,” she replied, rolling her eyes.\u003c/p\u003e\n\u003cp\u003eHe laughed. “Hey, it was worth a shot!” he stated, brushing my hair behind my ears and looking at her a little sheepishly.\u003c/p\u003e\n\u003cp\u003e“You always were cheeky,” my mom muttered, smiling as she put three slices of toast in front of him.\u003c/p\u003e\n\u003cp\u003e“I was just asking Jake about him crushing on Kate,” I told Liam, wanting to change the subject from my sex life and him sleeping in my bed. I’d spoken to Liam about Jake and Kate last night. He said that he hadn’t noticed anything, but he was going to watch him today for me.\u003c/p\u003e\n\u003cp\u003e“You’re not crushing on a sixteen year old, are you Jake? What the hell kind of eighteen year old would even look at a sixteen year old that way?” Liam asked with fake shock, using Jakes words from a couple of weeks ago.\u003c/p\u003e\n\u003cp\u003eJake glared at him warningly. “Ha ha. You two are hilarious,” he grumbled, shaking his head as he walked off to get dressed.\u003c/p\u003e\n\u003cp\u003eWhen we pulled into the parking lot at school, there was a crowd of people hovering around Johnny’s car. He was standing there awkwardly, looking really uncomfortable while the boys talked to him about his car and the girls flirted shamelessly, trying to get him into the back of it by the looks of it. Jessica, as usual, was at the front.\u003c/p\u003e\n\u003cp\u003e“Wow, we really have some sluts at this school!” I whispered to Liam.\u003c/p\u003e\n\u003cp\u003eHe nodded, looking unimpressed. “Yep.”\u003c/p\u003e\n\u003cp\u003e“Maybe you should go and help him. He looks really uncomfortable,” I suggested, looking at Liam pleadingly.\u003c/p\u003e\n\u003cp\u003eHe sighed and rolled his eyes at me. “Why must you be so damn nice all the time?” he asked, kissing me gently before walking off in the direction of Johnny’s car. I watched him wave his hand in a buzz off gesture, making half of the boys walk off immediately. He threw his arm around Johnny’s shoulder, grinning as he guided him away from the crowd towards the school, while Johnny looked at him gratefully. I smiled to myself; I really did have the most adorable boyfriend in the world.\u003c/p\u003e\n\u003cp\u003eKate skipped over to me. “Where’s your hot ass of a brother?” she asked. Jake cleared his throat behind her. She turned and grinned at him. “Sorry, I should have said, hot ass of a stepbrother,” she corrected, winking at him.\u003c/p\u003e\n\u003cp\u003eHis face dropped slightly but he quickly put on a smirk. “Finally realised I’m not interested but you’re still trying to get in with the family, huh?” he teased.\u003c/p\u003e\n\u003cp\u003eShe laughed. “Something like that. Maybe I’ve just gone off of blonds, or maybe you’ve lost your mojo,” she countered, smirking back at him. I almost choked on my laughter. Jake loved the chase I could tell, he’d never wanted anyone he couldn’t have before and I honestly think he wanted Kate now just because she wasn’t interested. I dragged her in through the doors and spotted Liam and Johnny chatting against his locker.\u003c/p\u003e\n\u003cp\u003e“Hey,” I greeted, smiling as I wrapped my arm around Liam’s waist.\u003c/p\u003e\n\u003cp\u003e“Hey, Amber. How are you today?” Johnny asked politely.\u003c/p\u003e\n\u003cp\u003e“I’m excellent. You?” I asked trying not to laugh as Liam’s hand slipped down the back of my jeans, rubbing his hand over my ass softly.\u003c/p\u003e\n\u003cp\u003e“I’m good.” He nodded in agreement. Kate was smiling at him seductively next to me.\u003c/p\u003e\n\u003cp\u003e“I was just telling Johnny about Ice Hockey,” Liam interjected, squeezing my ass gently. I smiled sweetly at him as I elbowed him in the ribs. Damn pervert boy! He pulled his hand out of my jeans chuckling to himself.\u003c/p\u003e\n\u003cp\u003e“Yeah, I’m going to come to the game on Friday. You think I could sit with you?” Johnny asked, looking at me hopefully.\u003c/p\u003e\n\u003cp\u003e“You can sit with me if you want to,” Kate offered, licking her lips slowly as she looked him over.\u003c/p\u003e\n\u003cp\u003eHe blushed and smiled at her timidly. “Thanks. I’d like that,” he agreed quietly.\u003c/p\u003e\n\u003cp\u003e“Come on then, let’s get to class,” I suggested, rolling my eyes. Those two were so going to get it on, because by the look on Kate’s face she wasn’t stopping until he was hers, and he seemed to like her too. I turned to walk off but stopped as I spotted Jessica walking up to me with a hateful expression on her face. She practically threw a brown envelope into my hands as she glared at me.\u003c/p\u003e\n\u003cp\u003e“I still think you cheated, but people say that it’s only fair that you get the money, so there it is, Emo bitch,” she growled angrily.\u003c/p\u003e\n\u003cp\u003eHoly crap! Did she just give me over four thousand dollars? I actually won the money?\u003c/p\u003e\n\u003cp\u003eKate stepped closer to me. “Jessica, you better back the hell off before I make you,” she spat angrily.\u003c/p\u003e\n\u003cp\u003eI smiled happily. “It’s OK, Kate, there’s no problem. Thanks for this, Jessica,” I said, waving the envelope proudly.\u003c/p\u003e\n\u003cp\u003e“Make sure you don’t lose it,” she stated with a smirk on her face.\u003c/p\u003e\n\u003cp\u003eI had no doubt in my mind that she had some sort of plan that probably involved me dropping this money down a drain or setting fire to it somehow. Suddenly, I had a great idea that would seriously piss her off. I grinned happily as I turned to Liam. I stepped up close to him as I shoved the money down the front of his jeans, pushing my whole hand down there too. Liam grunted and looked at me, shocked.\u003c/p\u003e\n\u003cp\u003e“Look after that for me, boyfriend. I’ll get it out later,” I purred suggestively, as I pulled him down to kiss me. I heard people cheer and clap, guys calling things like ‘oh yeah’ and ‘nice’. I smiled against his lips and pulled back. I glanced over in time to see Jessica storm off in the opposite direction.\u003c/p\u003e\n\u003cp\u003eI burst out laughing; Liam grabbed me and kissed me again, lifting me off of my feet. The bell rang and people started heading off to their classes. I lingered behind with Liam, not wanting to break the kiss. I can’t believe I won four thousand dollars! What the hell can I buy with that?\u003c/p\u003e\n\u003cp\u003eHe put me back down on my feet gently a huge grin on his face. “That was so funny, her face was a picture,” he said, laughing.\u003c/p\u003e\n\u003cp\u003e“Your face was a picture,” I countered, flicking his nose gently.\u003c/p\u003e\n\u003cp\u003e“Yeah well, I wasn’t expecting you to push money into my pants like some kind of stripper.” He grinned and shook his head amused. “So, what are you going to spend your money on then, Angel?” he asked, as he pulled the envelope out of his jeans and handed it to me.\u003c/p\u003e\n\u003cp\u003eI shrugged, grinning. “I have no idea. What shall we buy? It’s half yours.”\u003c/p\u003e\n\u003cp\u003e“I don’t need anything, I already have everything I could ever want right here,” he said, gripping his hands on my ass.\u003c/p\u003e\n\u003cp\u003e“My ass, that’s all you want?” I asked, laughing.\u003c/p\u003e\n\u003cp\u003eHe grinned. “Technically, it’s my ass now, right?” He smirked at me before kissing my neck.\u003c/p\u003e\n\u003cp\u003e“For now,” I teased as I pulled away. I fanned myself with the envelope. “Now that I’ve got what I want, I’m just not sure there’s anything in this relationship for me anymore.”\u003c/p\u003e\n\u003cp\u003eHe laughed and rolled his eyes at me as he wrapped his arm around my waist. “Come on, I’ll walk you to class,” he suggested, leading us down the corridor.\u003c/p\u003e\n\u003cp\u003eI held the envelope out to Liam. “Will you look after this for me? I don’t really trust myself with it, I’ll probably lose it.” I winced at the thought of losing all that money.\u003c/p\u003e\n\u003cp\u003eHe smiled and took it, folding it in half and slipping it into his inside jacket pocket. “And what if I lose it?” he asked.\u003c/p\u003e\n\u003cp\u003eI smiled as we reached my class; I pulled him in close, crushing my body against his. “Then you’ll just have to pay me in kind,” I breathed, pecking his lips and walking off into my class quickly.\u003c/p\u003e\n\u003cp\u003eJessica glared at me as I walked in and sat down next to Kate and Johnny in the seat they had saved for me. Lucky for me, my teacher was late too otherwise my tardiness would have earned me a detention.\u003c/p\u003e\n\u003cp\u003eThe next month passed really quickly. Liam was still the most adorable boyfriend in the world, taking me out on dates and buying me flowers and chocolates. Jake was still overprotective as usual, nothing would ever change there. My mom went back to work but was due home again in two weeks because she had to stay on for some launch of a new product or something. Kate was still flirting her butt off with Johnny - much to Jake’s disgust. Liam told me that he’d spoken to Jake about her, apparently, he didn’t want to be with Kate, he just didn’t like the fact that she was falling all over someone else when she used to be into him. He felt a little left out apparently. So, to rectify the problem he slept with a few extra girls and made himself feel a lot better. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-boy-who-sneaks-in-my-bedroom-window/page-41.html","bookId":1780,"creation":"Oct 5, 2019 10:36:44 AM","modification":"Oct 5, 2019 10:36:44 AM"}
