{"id":20258,"no":23,"title":"CHAPTER XXIII. A DISHONEST BAGGAGE-SMASHER.","content":"\u0026nbsp;On the next Monday morning Robert started for the city. At the moment of parting he began to realize that he had undertaken a difficult task. His life hitherto had been quiet and free from excitement. Now he was about to go out into the great world, and fight his own way. With only two hundred dollars in his pocket he was going in search of a father, who, when last heard from was floating in an open boat on the South Pacific. The probabilities were all against that father\u0027s being still alive. If he were, he had no clew to his present whereabouts. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n All this Robert thought over as he was riding in the cars to the city. He acknowledged that the chances were all against his success, but in spite of all, he had a feeling, for which he could not account, that his father was still living, and that he should find him some day. At any rate, there was something attractive in the idea of going out to unknown lands to meet unknown adventures, and so his momentary depression was succeeded by a return of his old confidence.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Arrived in the city, he took his carpetbag in his hand, and crossing the street, walked at random, not being familiar with the streets, as he had not been in New York but twice before, and that some time since.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t know where to go,\" thought Robert. \"I wish I knew where to find some cheap hotel.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then a boy, in well-ventilated garments and a rimless straw hat, with a blacking box over his shoulder, approached.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shine your boots, mister?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Robert glanced at his shoes, which were rather deficient in polish, and finding that the expense would be only five cents, told him to go ahead.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll give you the bulliest shine you ever had,\" said the ragamuffin.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s right! Go ahead!\" said Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When the boy got through, he cast a speculative glance at the carpetbag.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Smash yer baggage?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What\u0027s that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Carry yer bag.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know of any good, cheap hotel where I can put up?\" asked Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Eu-ro-pean hotel?\" said the urchin, accenting the second syllable.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What kind of a hotel is that?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You take a room, and get your grub where you like.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, that will suit me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll show you one and take yer bag along for two shillings.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All right,\" said our hero. \"Go ahead.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy shouldered the carpetbag and started in advance, Robert following. He found a considerable difference between the crowded streets of New York and the quiet roads of Millville. His spirits rose, and he felt that life was just beginning for him. Brave and bold by temperament, he did not shrink from trying his luck on a broader arena than was afforded by the little village whence he came. Such confidence is felt by many who eventually fail, but Robert was one who combined ability and willingness to work with confidence, and the chances were in favor of his succeeding.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Unused to the city streets, Robert was a little more cautious about crossing than the young Arab who carried his bag. So, at one broad thoroughfare, the latter got safely across, while Robert was still on the other side waiting for a good opportunity to cross in turn. The bootblack, seeing that communication was for the present cut off by a long line of vehicles, was assailed by a sudden temptation. For his services as porter he would receive but twenty-five cents, while here was an opportunity to appropriate the entire bag, which must be far more valuable. He was not naturally a bad boy, but his street education had given him rather loose ideas on the subject of property. Obeying his impulse, then, he started rapidly, bag in hand, up a side street.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hold on, there! Where are you going?\" called out Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He received no answer, but saw the baggage-smasher quickening his pace and dodging round the corner. He attempted to dash across the street, but was compelled to turn back, after being nearly run over.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I wish I could get hold of the young rascal!\" he exclaimed indignantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Who do you mane, Johnny?\" asked a boy at his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A boy has run off with my carpetbag,\" said Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I know him. It\u0027s Jim Malone.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know where I can find him?\" asked Robert, eagerly. \"If you\u0027ll help me get back my bag, I\u0027ll give you a dollar.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll do it then. Come along of me. Here\u0027s a chance to cross.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Following his new guide, Robert dashed across the street at some risk, and found himself safe on the other side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Now where do you think he\u0027s gone?\" demanded Robert.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s likely he\u0027ll go home.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you know where he lives?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No.—Mulberry street.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Has he got any father and mother?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027s got a mother, but the ould woman\u0027s drunk most all the time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then she won\u0027t care about his stealing?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, she\u0027ll think he\u0027s smart.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then we\u0027ll go there. Is it far?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not more than twenty minutes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy was right. Jim steered for home, not being able to open the bag in the street without suspicion. His intention was to appropriate a part of the clothing to his own use, and dispose of the rest to a pawnbroker or second-hand dealer, who, as long as he got a good bargain, would not be too particular about inquiring into the customer\u0027s right to the property. He did not, however, wholly escape suspicion. He was stopped by a policeman, who demanded, \"Whose bag is that, Johnny?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It belongs to a gentleman that wants it carried to the St. Nicholas,\" answered Jim, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Where is the gentleman?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He\u0027s took a car to Wall street on business.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How came he to trust you with the bag? Wasn\u0027t he afraid you\u0027d steal it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, he knows me. I\u0027ve smashed baggage for him more\u0027n once.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n This might be true. At any rate, it was plausible, and the policeman, having no ground of detention, suffered him to go on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Congratulating himself on getting off so well, Jim sped on his way, and arrived in quick time at the miserable room in Mulberry street, which he called home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n His mother lay on a wretched bed in the corner, half stupefied with drink. She lifted up her head as her son entered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What have you there, Jimmy?\" she asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s a bag, mother.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Whose is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s mine now.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And where did ye get it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A boy gave it to me to carry to a chape hotel, so I brought it home. This is a chape hotel, isn\u0027t it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027re a smart boy, an\u0027 I always said it, Jimmy. Let me open it,\" and the old woman, with considerable alacrity, rose to her feet and came to Jim\u0027s side.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll open it myself, mother, that is, I if I had a kay. Haven\u0027t you got one?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have that same. I picked up a bunch of kays in the strate last week.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She fumbled in her pocket, and drew out half a dozen keys of different sizes, attached to a steel ring.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Bully for you, old woman!\" said Jim. \"Give \u0027em here.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me open the bag,\" said Mrs. Malone, persuasively.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, you don\u0027t,\" said her dutiful son. \"\u0027Tain\u0027t none of yours. It\u0027s mine.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The kays is mine,\" said his mother, \"and I\u0027ll kape \u0027em.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Give \u0027em here,\" said Jim, finding a compromise necessary, \"and I\u0027ll give you fifty cents out of what I get.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s the way to talk, darlint,\" said his mother, approvingly. \"You wouldn\u0027t have the heart to chate your ould mother out of her share?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s better I did,\" said Jim; \"you\u0027ll only get drunk on the money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Shure a little drink will do me no harm,\" said Mrs. Malone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile the young Arab had tried key after key until he found one that fitted—the bag flew open, and Robert\u0027s humble stock of clothing lay exposed to view. There was a woolen suit, four shirts, half a dozen collars, some stockings and handkerchiefs. Besides these there was the little Bible which Robert had had given him by his father just before he went on his last voyage. It was the only book our hero had room for, but in the adventurous career upon which he had entered, exposed to perils of the sea and land, he felt that he would need this as his constant guide.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Them shirts\u0027ll fit me,\" said Jim. \"I guess I\u0027ll kape \u0027em, and the close besides.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then where\u0027ll you git the money for me?\" asked his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll sell the handkerchiefs and stockings. I don\u0027t nade them,\" said Jim, whose ideas of full dress fell considerably short of the ordinary standard. \"I won\u0027t nade the collars either.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t nade all the shirts,\" said his mother.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll kape two,\" said Jim. \"It\u0027ll make me look respectable. Maybe I\u0027ll kape two collars, so I can sit up for a gentleman of fashion.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027ll be too proud to walk with your ould mother,\" said Mrs. Malone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Maybe I will,\" said Jim, surveying his mother critically. \"You aint much of a beauty, ould woman.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was a purty gal, once,\" said Mrs. Malone, \"but hard work and bad luck has wore on me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"The whisky\u0027s had something to do with it,\" said Jim. \"Hard work didn\u0027t make your face so red.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is it my own boy talks to me like that?\" said the old woman, wiping her eyes on her dress.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n But her sorrow was quickly succeeded by a different emotion, as the door opened suddenly, and Robert Rushton entered the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2958/81371.html","bookId":431,"creation":"Aug 2, 2019 11:37:03 AM","modification":"Aug 2, 2019 11:37:03 AM"}
