{"id":92260,"no":19,"title":"Page 19","content":"\u003cp\u003eThe French doors to the balcony weren\u0027t exactly repaired, but they were boarded up and once again bore all the trappings necessary to keep away monsters.\u003c/p\u003e\n\u003cp\u003eSince one of New Orleans\u0027 finest had been there, they\u0027d been able to report the incident, and get Barry Larson to the hospital for the care he neededand explain the dead man in the house. Lucien and Ragnor had whisked Mary off, so there was no need to explain how the missing corpse had come back to life at the crime scene. Sean arrived and took over the official end of things, but to Jessica, the night seemed to stretch forever. Nancy and Jeremy remained at Sean and Maggie\u0027s, safe, with Brent Malone and the others.\u003c/p\u003e\n\u003cp\u003eAs he watched the crime-scene team do their work, Bryan felt like an uneasy observer.\u003c/p\u003e\n\u003cp\u003eHe had worked alone for so many years, and he told himself that was a good thing. Look at the way Jessica had been betrayed. And yet he couldn\u0027t help feeling he had lost out in some way, never really trusting anyone since Gregore\u0027s death. He was a warrior, and a warrior\u0027s solitary quest was the destruction of evil. Yet this group had also made that their aim, as unnatural-as impossible as that seemed to him.\u003c/p\u003e\n\u003cp\u003eOnce, so long ago it didn\u0027t seem real anymore, he had known what it felt like to belong. He had fought for a king who had honored him, alongside stalwart comrades. They had worn leather, chain and steel, rather than cotton and denim, Levi\u0027s and Armani, but in a way, they were much the same.\u003c/p\u003e\n\u003cp\u003eHe was quiet, watching the activity all around him, making a few plans of his own.\u003c/p\u003e\n\u003cp\u003eAt least the results of the preliminary investigation were manageable from a PR standpoint. The perp had, obviously, come in through the French doors, and he\u0027d worn gloves. No identifiable prints had been found, and no shoe prints in the garden below. By agreement, Bobby had described the attacker as a tall man who had fled when he\u0027d arrived. Bryan was surprised to see that after his initial shock, the cop dealt with the situation quite well.\u003c/p\u003e\n\u003cp\u003eBryan finally left Jessica\u0027s house, knowing she was safe in the hands of people who cared about her, and went to the hospital in the wake of the ambulance. During the hour he waited until he was allowed to see Barry Larson, he checked on the status of David Hayes. One of the residents lowered his voice as Bryan questioned him, saying, \"I never saw so much blood loss, but I think he\u0027s going to make it. Whoever attacked those cops ripped up the veins in his arm pretty good, though, which still that doesn\u0027t explain...\"\u003c/p\u003e\n\u003cp\u003e\"Explain what?\" Bryan asked.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s convinced he was attacked by a vampire. Twice. The first time by a naked girl in the morgue, then in his room by a man in a doctor\u0027s whites.\"\u003c/p\u003e\n\u003cp\u003e\"So he\u0027s conscious now? Is he allowed visitors?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s up to the cops who gets in,\" the resident said.\u003c/p\u003e\n\u003cp\u003eBryan thanked him. Mendez was on duty and let him past without comment.\u003c/p\u003e\n\u003cp\u003e\"Hey, how are you doing?\" Bryan asked.\u003c/p\u003e\n\u003cp\u003eThe boy looked at him curiously. \"Do I know you?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m a professor,\" Bryan explained. \"I study ancient legends and beliefs-like vampires.\"\u003c/p\u003e\n\u003cp\u003e\"They exist,\" David said gravely.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Bryan said.\u003c/p\u003e\n\u003cp\u003eDavid looked at him, stunned that someone finally believed him.\u003c/p\u003e\n\u003cp\u003eBryan smiled. \"No one else is ever going to believe you. I\u0027d give it up, if you want to become a doctor.\"\u003c/p\u003e\n\u003cp\u003eHayes shook his head. \"You don\u0027t understand. I\u0027m...petrified.\"\u003c/p\u003e\n\u003cp\u003e\"Do everything they tell you and you\u0027ll be fine. The vampire who came after you is done here right now. He\u0027s moved on to his real target. They\u0027re pumping you full of new blood, so hang in there, and grow up to be a great doctor.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s...it?\" David said.\u003c/p\u003e\n\u003cp\u003e\"Well, it won\u0027t hurt you to eat a lot of garlic and keep religious symbols around your house.\"\u003c/p\u003e\n\u003cp\u003e\"Like crosses?\"\u003c/p\u003e\n\u003cp\u003e\"Like whatever you believe in. Face it, whatever supreme power is out there, I\u0027m pretty sure that in the end, what\u0027s going to be most important is how we treat one another while we\u0027re here on earth.\"\u003c/p\u003e\n\u003cp\u003eDavid stared at him blankly.\u003c/p\u003e\n\u003cp\u003e\"You\u0027ve got a real chance, kid. Use it,\" Bryan advised, then got up and headed toward the door.\u003c/p\u003e\n\u003cp\u003e\"Hey, Professor? Are you going to be around? In case...in case I need some help?\"\u003c/p\u003e\n\u003cp\u003e\"Not for a while, actually. But don\u0027t worry. Someone will be watching over you.\"\u003c/p\u003e\n\u003cp\u003eHe went back to Emergency and found out where they had taken Barry Larson, who wasn\u0027t in bad shape, suffering mostly from a concussion. He was amazingly happy as he greeted Bryan.\u003c/p\u003e\n\u003cp\u003e\"I nearly stopped him. I tried, anyway.\"\u003c/p\u003e\n\u003cp\u003e\"Good man,\" Bryan said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve known something was going on at that house. I knew Big Jim knew it, too. No need to worry about me, though. I had my story down. I said I couldn\u0027t remember much, just that a really big guy broke in from the balcony and we tried to stop him.\" His face hardened. \"\u0027Course, Gareth will come out looking like a hero, dying to fight off a burglar, but that\u0027s okay, I guess.\"\u003c/p\u003e\n\u003cp\u003eAfter a few pleasantries, Bryan left. When he got back to Montresse House, Stacey was downstairs with Bobby, who still looked shell-shocked, but at least he was getting some colour back in his face. He looked at Bryan with weary eyes. \"They\u0027re going to need a new maintenance man,\" he said dully.\u003c/p\u003e\n\u003cp\u003e\"Yeah. Where is everyone?\" Sean asked.\u003c/p\u003e\n\u003cp\u003e\"Sean\u0027s been called back in. Niles Goolighan went wacko in his cell, attacked a guard. Most of the others are at Sean\u0027s place. They\u0027re making arrangements.\" He hesitated. \"They decided it\u0027s too dangerous to keep Mary at a house where there are children, so she\u0027ll be staying with a guy named Malone and his wife until it\u0027s all figured out. Jessica\u0027s upstairs,\" he said. \"Resting.\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s not resting. She\u0027s busy blaming herself for everything,\" Stacey contradicted.\u003c/p\u003e\n\u003cp\u003e\"Thanks.\"\u003c/p\u003e\n\u003cp\u003eUpstairs, he found Jessica pacing the floor in her room, which had been put back in some semblance of order. She stood still when he appeared and stared at him, as if holding her breath. Waiting.\u003c/p\u003e\n\u003cp\u003e\"Hey,\" he said softly.\u003c/p\u003e\n\u003cp\u003e\"Oh, God, Bryan!\" She ran across the room to him, and he took her into his arms.\u003c/p\u003e\n\u003cp\u003e\"All these years...Gareth came to me before I ever even moved here. A couple of punks trying to rob the manager of a convenience store, and he...saw me take them down. He told the cops then I\u0027d just had a lucky break, coming up behind one and cracking him on the head with a bottle of wine. I was sure he\u0027d seen the truth, but he was so convincing. A few months later he admitted that he knew what I was, but he said he wasn\u0027t afraid, he only wanted to help me. And he did. Bryan, he was with me for ten years. I left Stacey alone with him. I trusted him.\"\u003c/p\u003e\n\u003cp\u003eHelplessly, he smoothed her hair. \"We all need to have faith in others. And sometimes we make mistakes.\" He hesitated. \"Don\u0027t let it change you. I\u0027m not saying that you don\u0027t have to be careful, but...\" He lifted her chin. \"Don\u0027t forget there is love out there, friendship, loyalty. You\u0027ve got good friends. Big Jim, for one. And I have to admit, I really thought it might be him. And Barry. I\u0027m pretty sure he\u0027s the real thing.\"\u003c/p\u003e\n\u003cp\u003eShe smiled. \"Go figure, huh?\" She shook her head, then let out a deep sigh. \"Sean went back to the station. Niles Goolighan attacked a guard.\"\u003c/p\u003e\n\u003cp\u003e\"The Master intended to leave a mess in his wake, and I\u0027d say he did a damn fine job.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know what you mean.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s moved on. He\u0027s caused all the trouble here that he wanted. Now he wants us to follow him. He never intended to have a full-blown battle here. We\u0027re not on his turf. And we have no choice. Wehave to follow him.\"\u003c/p\u003e\n\u003cp\u003e\"Follow him where?\"\u003c/p\u003e\n\u003cp\u003e\"Where this all started. Sometimes I don\u0027t believe myself it all happened. I don\u0027t believe I was once a man, a knight fighting for a king and a cause, in love with the king\u0027s illegitimate daughter. That\u0027s what he wants, Jessica. He wants to relive that day. We have to return to Scotland.\"\u003c/p\u003e\n\u003cp\u003eShe backed away and stared at him.\u003c/p\u003e\n\u003cp\u003e\"It will be a different battle. But,\" he added slowly, \"the odds won\u0027t be quite as bad as I\u0027d always expected.\"\u003c/p\u003e\n\u003cp\u003e\"Oh?\"\u003c/p\u003e\n\u003cp\u003e\"I suppose thereare a few good vampires out there.\"\u003c/p\u003e\n\u003cp\u003eShe smiled and moved into his arms again.\u003c/p\u003e\n\u003cp\u003e\"You need to get some rest,\" he said.\u003c/p\u003e\n\u003cp\u003e\"We don\u0027t have time.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, we do.\"\u003c/p\u003e\n\u003cp\u003eShe looked up at him. \"A little physical activity always seems to help before a nap.\"\u003c/p\u003e\n\u003cp\u003eHell, he hadn\u0027t been born yesterday. He kissed her, his lips light, infinitely tender.\u003c/p\u003e\n\u003cp\u003eAnd he made love to her. Slowly, savoring every touch, whisper, glance between them. It wasn\u0027t until the end that they both gave way to the absolute passion and desperation of arousal, climaxing together in a bond as sweet as any the far distant past had ever offered.\u003c/p\u003e\n\u003cp\u003eAfterward, she slept.\u003c/p\u003e\n\u003cp\u003eHe rose. Downstairs, he found Bobby and Stacey cuddled together on one of the sofas.\u003c/p\u003e\n\u003cp\u003e\"Jessica?\" Stacey asked.\u003c/p\u003e\n\u003cp\u003e\"Is sleeping,\" Bryan said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d kind of like to go see Sean, then...\" Bobby hesitated, looking disbelievingly at Bryan. \"Stacey\u0027s tried to explain it to me.\"\u003c/p\u003e\n\u003cp\u003eBryan grimaced. \"Bobby, you can get explanations for a lifetime-hell, you can live several lifetimes-and still not really understand.\"\u003c/p\u003e\n\u003cp\u003eBobby nodded. \"I guess everyone needs to get some rest, but then we\u0027ll have to start making plans. And...\" He barely missed a beat, then looked Bryan straight in the eyes. \"We\u0027ll need all the help we can get.\"\u003c/p\u003e\n\u003cp\u003eStacey smiled. \"A major meeting. Here. Tonight. I\u0027ll see to it.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll be here,\" Bobby said. \"I won\u0027t fail again, I promise.\"\u003c/p\u003e\n\u003cp\u003e\"You didn\u0027t fail, Bobby. And next time you\u0027ll be prepared. But nothing is going to happen here. I\u0027m almost sure of it.\"\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t fail again,\" Bobby repeated.\u003c/p\u003e\n\u003cp\u003eStacey curled her fingers around his hand, smiled grimly as she looked at Bryan. \"Wewon\u0027t fail,\" she assured him.\u003c/p\u003e\n\u003cp\u003eBryan shook his head. \"I\u0027m going to need you guys to provide support, and that\u0027s not because I don\u0027t trust you. But you\u0027re only human, like it or not. There\u0027s only so much you can do.\"\u003c/p\u003e\n\u003cp\u003eThey both looked deflated, but Bobby only sighed and told Bryan, \"Yeah. Sure. We\u0027ll make great babysitters.\"\u003c/p\u003e\n\u003cp\u003eBryan found Sean Canady outside the entrance to the cells.\u003c/p\u003e\n\u003cp\u003e\"How did you know I\u0027d be here?\" Sean asked him.\u003c/p\u003e\n\u003cp\u003e\"Hunch,\" Bryan said. \"Will you have trouble getting me in?\"\u003c/p\u003e\n\u003cp\u003e\"Usually I would have to pull some strings and do a lot of paperwork. But today...I don\u0027t think so. Come on.\"\u003c/p\u003e\n\u003cp\u003eBryan followed close behind Sean as they made their way to the holding cell, filling the cop in on his theory about the final battle. Sean assured the guards they passed that he could handle things himself, though he shouldn\u0027t have been going in alone, much less with Bryan; it was totally against policy. But the guards were spooked. They didn\u0027t want anything to do with the entire area where Niles Goolighan was being kept.\u003c/p\u003e\n\u003cp\u003eBryan remained out of sight when they first approached the cell. Goolighan grinned at Sean. The kid was covered in blood, His own? The guard\u0027s?\u003c/p\u003e\n\u003cp\u003e\"Hey, piggy, piggy,\" Goolighan taunted in a singsong voice. \"Come on in. I\u0027ve the power now, and you\u0027re going to die.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a punk, Niles. Always were, always will be,\" Sean said.\u003c/p\u003e\n\u003cp\u003eGoolighan shook his head. \"No. He kept his promise. He came to me.\"\u003c/p\u003e\n\u003cp\u003e\"Who\u0027s that?\" Sean asked, as if he weren\u0027t the least bit interested.\u003c/p\u003e\n\u003cp\u003e\"The Prince of Darkness,\" Goolighan said delightedly.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s not the Prince of Darkness. Just a punk follower-like you, He\u0027s had a little more practice, that\u0027s all, and he isn\u0027t quite as dumb,\" Sean said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not stupid. I\u0027m going to be all-powerful. I\u0027m his ally.\"\u003c/p\u003e\n\u003cp\u003e\"No, Niles, you may have asked him in, but you\u0027re still a punk. Cal talked, by the way. We know all about the Web site, and we know how he gets to you assholes.\"\u003c/p\u003e\n\u003cp\u003eGoolighan didn\u0027t seem to be listening anymore. He was liked a crazed hyena, laughing, chortling. \"I\u0027ll be there. I\u0027ll be at the great battle. Come on in, pig. I\u0027m going to kill you. Then I\u0027ll die and come back and be at the battle when it rages.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll be the best punk there, I bet,\" Sean told him. \"Where will this battle take place?\"\u003c/p\u003e\n\u003cp\u003e\"What do you care? You\u0027ll be dead. Come on, pig. You can\u0027t resist. Get in here and try to kill me.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right. I can\u0027t resist. But humor me, first. Where is it going to be?\"\u003c/p\u003e\n\u003cp\u003eNiles started laughing as if that were the funniest thing he\u0027d ever heard. \"It will be so cool there, in the mists.\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027ll be waiting below the high tor, huh?\"\u003c/p\u003e\n\u003cp\u003eNiles giggled again. \"Not bad, piggy, piggy. It\u0027s the bitch he wants. He\u0027s wanted her all along. Wants to kill her. I think once he wanted to fuck her, but she was like all bitches, wanting someone else. Some piece of highland shite.\" He gave the last the Scottish pronunciation, then went into gales of laughter. \"Ah, laddie.\" he said, doing a creditable Scottish accent, \"he\u0027ll bastion himself in the MacDonnough ruins, that he will. He\u0027ll command the valley and the highlands. And then it will end for those who made his life-and death-a hell.\"\u003c/p\u003e\n\u003cp\u003e\"Great. Thanks,\" Sean said, turning the lock, stepping into the cell.\u003c/p\u003e\n\u003cp\u003eBryan moved up behind him in the blink of an eye, and Niles saw him for the first time. He roared in sudden knowledge and fury.\u003c/p\u003e\n\u003cp\u003eSean stepped back. There was no fight. Not really. Niles was a fool. He attacked Bryan, going straight for him, impaling himself on the small wooden stake Bryan held. He hadn\u0027t even needed to thrust it forward.\u003c/p\u003e\n\u003cp\u003e\"I guess I\u0027m going to have to answer a lot of questions,\" Sean said when it was over. \"But I\u0027ve done it before and, God help me, I\u0027ll probably do it again, somewhere down the line.\"\u003c/p\u003e\n\u003cp\u003eThey both looked at Niles, crumpled on the floor.\u003c/p\u003e\n\u003cp\u003e\"Rest in peace, you sorry punk,\" Sean murmured.\u003c/p\u003e\n\u003cp\u003e\"There was nothing else we could do,\" Bryan told him.\u003c/p\u003e\n\u003cp\u003e\"I know. It\u0027s just such a waste.\" Sean sighed, straightened. \"Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003eThis time they were all at the house on Bourbon Street.\u003c/p\u003e\n\u003cp\u003eThey filled the kitchen, and at first glance they might have been any group of friends; Stacey and Bobby had gone to Sean and Maggie\u0027s to watch the children, but all the rest were there. Sean was explaining what had happened to Niles Goolighan.\u003c/p\u003e\n\u003cp\u003e\"How did you explain killing him in his cell?\" Jessica asked, pouring coffee for herself.\u003c/p\u003e\n\u003cp\u003eSean hesitated for a moment. \"I\u0027ve had to explain far worse,\" he reminded her. \"There wasn\u0027t a soul who didn\u0027t believe he\u0027d attacked me. I said I was damn lucky Bryan had a stake on him.\"\u003c/p\u003e\n\u003cp\u003e\"Astake? \" Jessica said. \"And how did you explain Bryan carrying a stake?\"\u003c/p\u003e\n\u003cp\u003e\"Easy. A prop for his lectures,\" Sean said.\u003c/p\u003e\n\u003cp\u003e\"Somehow,\" Maggie said, \"it will work out. It always does.\"\u003c/p\u003e\n\u003cp\u003eSean smiled. \"Hey, this is N\u0027awleans. We\u0027ve always been what we are, a little decay, a little voodoo, history, jazz...mystery. I had another interesting conversation today, too.\"\u003c/p\u003e\n\u003cp\u003e\"With...?\" Jessica asked.\u003c/p\u003e\n\u003cp\u003e\"Florenscu,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Florenscu?\" Jessica repeated. \"The detective in Transylvania?\"\u003c/p\u003e\n\u003cp\u003e\"The same,\" Sean said. \"I asked him to interview some of the partygoers about a hunch I had. He got back to me immediately, and damned if the information about the party didn\u0027t appear on the \u0027Master\u0027 site about twenty-four hours beforehand. If we\u0027d known to look, I\u0027m sure we would have found the same thing for the party here, even though the Master never meant to attend.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ll find it before the party in Scotland, then,\" Jade said.\u003c/p\u003e\n\u003cp\u003e\"I can already tell you when it will be,\" Bryan told them.\u003c/p\u003e\n\u003cp\u003eThey all looked at him.\u003c/p\u003e\n\u003cp\u003e\"The Demon Moon, an occurrence that falls maybe once in a century. But the way the planets align, it\u0027s not an eclipse, it\u0027s a red moon.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve seen it,\" Maggie whispered.\u003c/p\u003e\n\u003cp\u003e\"As have I,\" Jessica said dryly. \"The Demon Moon, and the MacDonnough castle.\" She shook her head. \"It wasn\u0027t all that well fortified. It wasn\u0027t even that big. There was a wooden fence around the clan homes, and the castle itself was stone, but...\"\u003c/p\u003e\n\u003cp\u003eJade DeVeau walked over to her with a sheaf of pages. \"In the 1400s, the clan came into some money. They built a stone wall around the keep. You can see what remains of the courtyard. During the Jacobite uprisings it was abandoned, taken over by the Crown and forgotten. It\u0027s nothing but ruins now.\"\u003c/p\u003e\n\u003cp\u003eTara walked over and showed Jessica the second page. \"This is the original chapel. There are tombs beneath it. Lots of them. Apparently it was a big family. The catacombs run like tunnels beneath the place. There\u0027s a huge memorial room there. The chapel itself was deconsecrated a long time ago, though.\" She was silent for a few seconds, thinking. \"I can\u0027t be sure, but there have been a number of unexplained disappearances in the area over the years, and I believe the Master has been using it as a base while he regained his strength. I\u0027m willing to bet he\u0027s created an entire army there, and they won\u0027t all be newly made vampires who have no idea how to defend themselves.\" She looked over at Bryan. \"You need to be careful,\" she said softly. \"I gather you have superhuman strength and an ability to heal, but everyone has a weakness.\" She shook her head. \"Frankly, I don\u0027t think you should go.\"\u003c/p\u003e\n\u003cp\u003eBryan walked over and met Tara\u0027s eyes. \"I have to go,\" he said flatly. He looked around at the group. \"I have to go, and you know that. Perhaps it would be best if I go alone.\"\u003c/p\u003e\n\u003cp\u003eTara sighed. \"I knew he\u0027d say that.\"\u003c/p\u003e\n\u003cp\u003e\"No way in hell are you going alone!\" Jessica protested.\u003c/p\u003e\n\u003cp\u003e\"You know,\" Lucien said, \"I\u0027m not underestimating your power, Bryan, but we\u0027re talking about an army. I think more of us than just Jessica should go.\"\u003c/p\u003e\n\u003cp\u003e\"I think this is a battle Bryan and I have to face alone,\" Jessica said.\u003c/p\u003e\n\u003cp\u003eBryan inhaled. \"Frankly, you\u0027re exactly the one who shouldn\u0027t go. I have to destroy him.\"\u003c/p\u003e\n\u003cp\u003e\"Wehave to destroy him,\" Jessica corrected him.\u003c/p\u003e\n\u003cp\u003e\"Jessica, don\u0027t you see? That\u0027s what he wants. Both of us there to be destroyed.\"\u003c/p\u003e\n\u003cp\u003eThey were all startled when the doorbell rang. \"Who is that?\" Sean asked, frowning.\u003c/p\u003e\n\u003cp\u003e\"Want me to go?\" Ragnor asked.\u003c/p\u003e\n\u003cp\u003e\"No, it\u0027s all right,\" Jessica said. \"I\u0027ll get it.\"\u003c/p\u003e\n\u003cp\u003eBryan followed her at a discreet distance. He was startled to see a very distraught woman at the door, then he frowned as he realized he recognized her, then tried to remember from where.\u003c/p\u003e\n\u003cp\u003e\"I knew he was going off the deep end,\" the woman was saying, nearly sobbing. Jessica had a hand on her shoulder, trying to soothe her. \"He\u0027s been gone since last night, but I know he didn\u0027t run away,\" she said. \"This is real. And it\u0027s not a ransom note, it\u0027s...I don\u0027t know what it means, but the police won\u0027t help, and your name is here.... Oh, God, what should I do?\"\u003c/p\u003e\n\u003cp\u003eBryan\u0027s memory clicked. It was Mrs. Peterson, mother of Jacob, the boy who thought he was a vampire. Without Jacob, he might not have been in the right cemetery that night.\u003c/p\u003e\n\u003cp\u003eThe woman had brought Jessica a note hand printed on a torn piece of computer paper.\u003c/p\u003e\n\u003cp\u003e\"Mrs. Peterson, we\u0027ll find Jacob,\" Jessica promised.\u003c/p\u003e\n\u003cp\u003e\"You can find him?\" the woman asked with desperate hope. \"You think he\u0027s alive?\"\u003c/p\u003e\n\u003cp\u003eJessica nodded. \"I\u0027m sure of it.\"\u003c/p\u003e\n\u003cp\u003eShe let out a deep sigh. \"I\u0027ll find your son, Mrs. Peterson. And I\u0027ll bring him back to you. I swear it. Now go home, have a glass of wine, call a friend and leave this to me.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you. The police wouldn\u0027t even take a missing persons report yet-they said teenagers wander off all the time and he hasn\u0027t been gone long enough yet. But this note...it scares me.\"\u003c/p\u003e\n\u003cp\u003eBryan realized someone was standing close behind him. Sean.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll see her home. I can\u0027t leave New Orleans now, anyway,\" Sean said softly. He walked past Bryan, meeting the woman at the door. \"Mrs. Peterson, I\u0027m Lieutenant Canady. I\u0027ll get you home and take down all your information.\"\u003c/p\u003e\n\u003cp\u003eMrs. Peterson, looking so lost and scared, stared numbly at Sean.\u003c/p\u003e\n\u003cp\u003eAs soon as Sean left with her, Bryan strode over to Jessica. \"What does it say?\" he demanded.\u003c/p\u003e\n\u003cp\u003eShe handed him the paper.\u003c/p\u003e\n\u003cp\u003eHe looked down at it. In pen, it saidFor Jessica Fraser . Beneath that three words had been scribbled in what appeared to be blood, one on top of the other, the middle word underlined.\u003c/p\u003e\n\u003cp\u003eIoin\u003c/p\u003e\n\u003cp\u003eIgrainia \u003c/p\u003e","sourceLink":"https://allnovel.net/kiss-of-darkness-alliance-vampires-7/page-19.html","bookId":2290,"creation":"Oct 5, 2019 5:54:40 PM","modification":"Oct 5, 2019 5:54:40 PM"}
