{"id":92245,"no":4,"title":"Page 4","content":"\u003cp\u003eThe dominatrix reached the room. She hadn\u0027t been prepared for this, hadn\u0027t believed...\u003c/p\u003e\n\u003cp\u003eShe threw open the door, her heart thundering with fear, with anticipation. What had been conjecture was now proved to be true.He was there.\u003c/p\u003e\n\u003cp\u003eBut someone else was there, as well. Someone unknown to her, yet she sensed his power.\u003c/p\u003e\n\u003cp\u003eShe straightened, hesitating, knowing she had to make a split-second decision.\u003c/p\u003e\n\u003cp\u003eAnd then she saw the other man more clearly. Not his face, for his hat was drawn too low, but she saw the longbow, the way his head was bent, eyes on his target.\u003c/p\u003e\n\u003cp\u003eShe backed away.\u003c/p\u003e\n\u003cp\u003eWho? What?\u003c/p\u003e\n\u003cp\u003eThen she heard screams coming from below.\u003c/p\u003e\n\u003cp\u003eScreams of shrill, uncanny terror.\u003c/p\u003e\n\u003cp\u003eAll hell had broken loose.\u003c/p\u003e\n\u003cp\u003eIndecision tore at her for a moment.\u003c/p\u003e\n\u003cp\u003eAlone. She shouldn\u0027t have been alone.\u003c/p\u003e\n\u003cp\u003eShe should have seen to it that she had help with her. But she hadn\u0027t really known what would happen here. So shewas alone.\u003c/p\u003e\n\u003cp\u003eWhat to do?\u003c/p\u003e\n\u003cp\u003eWhatever was happening here, there was a force at work to counter evil, while down below...\u003c/p\u003e\n\u003cp\u003eThe screams continued.\u003c/p\u003e\n\u003cp\u003eShe turned and ran.\u003c/p\u003e\n\u003cp\u003eShe could move, Nancy realized. The sound of the shattering glass had somehow freed her.\u003c/p\u003e\n\u003cp\u003eShe stood, screaming-aloud, this time.\u003c/p\u003e\n\u003cp\u003eOn the screen, the arrow was fired. It caught the fanged monster in the shoulder. The creature hissed, then gave an ungodly roar of fury.\u003c/p\u003e\n\u003cp\u003eIt seemed to echo and echo....\u003c/p\u003e\n\u003cp\u003eA hand fell on Nancy\u0027s arm. She looked down and shivered. Not a hand, a talon. She looked again at the woman who had tried to seduce her, who looked even less human than before.\u003c/p\u003e\n\u003cp\u003eHer grip, again, was powerful.\u003c/p\u003e\n\u003cp\u003eChaos broke out. People were rising all around. Some, like her, were screaming...fighting.\u003c/p\u003e\n\u003cp\u003eAnd others-like the woman beside her-were shrieking in fury, attacking.\u003c/p\u003e\n\u003cp\u003eSomething seemed to fly into the room. A shadow, the essence of darkness and speed. As Nancy stood, a continual scream flowing from her lips, the woman was ripped away from her.\u003c/p\u003e\n\u003cp\u003e\"Get out!\" The command was harsh. Male? Female? She couldn\u0027t tell.\u003c/p\u003e\n\u003cp\u003eShe was all too willing to obey, however. She ran for the entry, terror lending her speed.\u003c/p\u003e\n\u003cp\u003eBehind her, someone cried her name. She was afraid to turn, even though she knew it was Mary calling out to her. She was afraid to stop.\u003c/p\u003e\n\u003cp\u003eMary caught up to her, still dressed in the gossamer gown. In the back of Nancy\u0027s mind, she knew it was cold out and that her friend would freeze.\u003c/p\u003e\n\u003cp\u003eTears were streaming down Mary\u0027s cheeks. \"We\u0027ve got to get out.\"\u003c/p\u003e\n\u003cp\u003eSomeone shouted behind them. They heard a cry of savage fury, saw a body go flying across the room and slam against the bar. They heard a snap, the sound of bones breaking.\u003c/p\u003e\n\u003cp\u003eThey stumbled for the door and burst out into the night. Mary stopped dead still. \"Jeremy is still in there.\"\u003c/p\u003e\n\u003cp\u003eShe turned. Nancy grasped her by the shoulders. \"You can\u0027t go back in there.\"\u003c/p\u003e\n\u003cp\u003e\"Jeremy tried to save me,\" Mary said. Her teeth were chattering.\u003c/p\u003e\n\u003cp\u003eSomeone burst through the door behind them, someone they had seen at the bar. He practically shoved them out of the way, then stopped, staring wildly around.\u003c/p\u003e\n\u003cp\u003eHe turned back. He was large and well muscled. His eyes, however, echoed their own terror.\u003c/p\u003e\n\u003cp\u003e\"Got to get away,\" he said in German-accented English. He started to run, then stopped, stripping his jacket from his shoulders, throwing it toward them. Nancy caught the jacket and automatically wrapped it around Mary\u0027s shoulders. The German man continued to stare at them. \"Get away,\" he said tonelessly.\u003c/p\u003e\n\u003cp\u003e\"To where?\" Nancy wailed.\u003c/p\u003e\n\u003cp\u003eBut the man was gone, running blindly toward the forest.\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve got to go, too,\" Nancy said.\u003c/p\u003e\n\u003cp\u003e\"Jeremy,\" Mary repeated.\u003c/p\u003e\n\u003cp\u003eOthers began to burst out the door. Like the man before them, they began racing madly toward the mist-filled forest.\u003c/p\u003e\n\u003cp\u003eNancy dragged her friend in the same direction, though Mary felt like lead. Nancy stared at her and realized that she was in shock. Her eyes were wide; her teeth continued to chatter. She was as pale as ash.\u003c/p\u003e\n\u003cp\u003eNancy knew she had to move for the both of them. She dragged Mary with her, heading toward what looked like a trail.\u003c/p\u003e\n\u003cp\u003eA new sound made itself heard, but what it meant didn\u0027t register in her mind. She just knew they had to get away.\u003c/p\u003e\n\u003cp\u003e\"Come on, come on,\" she pleaded. And then, at last, Mary began to move. Through the mist, Nancy saw the trail more clearly. She staggered toward it.\u003c/p\u003e\n\u003cp\u003eJeremy was in agony the minute consciousness returned. The bursting pain in his head was overwhelming. He tried to open his eyes but couldn\u0027t. He became aware of movement, of shouts, of a fight.\u003c/p\u003e\n\u003cp\u003eHe heard grunts of ferocious determination and raw anger. Something fell, close to him. He forced his lids open. He could see figures...men, flying at one another. Something else landed at his side.\u003c/p\u003e\n\u003cp\u003eEyes open. Steady his head. Ignore the agony.\u003c/p\u003e\n\u003cp\u003eGet to his feet.\u003c/p\u003e\n\u003cp\u003eUsing the wall, he managed to rise. Once he was up, he fought a savage wave of nausea that threatened to cause him to black out again. There was a thud. And then...\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003eHe turned, aware that he needed to flee, but he stumbled. Someone was striding toward him. He screamed, throwing up his arms, too exhausted to fight.\u003c/p\u003e\n\u003cp\u003eHis mind cried out that he should remain standing.\u003c/p\u003e\n\u003cp\u003eBut his body gave out, and he began to fall.\u003c/p\u003e\n\u003cp\u003eNancy found a place under the trees where at least the blast of the wind was blocked. She remained in terror that any minute they would be attacked by a monster, but she knew she couldn\u0027t possibly walk all the way back to the village with Mary. Her friend\u0027s feet were bare. She all but needed to be carried, and Nancy didn\u0027t have the strength for that. She lowered her head, suddenly recognizing the newest sound.\u003c/p\u003e\n\u003cp\u003eSirens. Thank God! There were police, even here, deep in the shrouded forest, in this no man\u0027s land of darkness and mist....\u003c/p\u003e\n\u003cp\u003eThe police would find Jeremy.\u003c/p\u003e\n\u003cp\u003e\"Miss?\"\u003c/p\u003e\n\u003cp\u003eShe froze. The voice had come from behind her. Terror snaked up her spine once again. She couldn\u0027t turn.\u003c/p\u003e\n\u003cp\u003eIt had been a man\u0027s voice, deep, husky. There had been nothing threatening in it, but still...\u003c/p\u003e\n\u003cp\u003e\"Tend to your friend. The police are on the way,\" the voice continued.\u003c/p\u003e\n\u003cp\u003eShe spun around. There was no one there. Wait! On the ground, by the tree.Jeremy . As she stared at him, he groaned.\u003c/p\u003e\n\u003cp\u003eShe raced to his side. He groaned again. She fell to the forest floor, taking his head on her lap. \"Jeremy, you\u0027re alive. Speak to me. Are you hurt? Hang on, the police are coming.\"\u003c/p\u003e\n\u003cp\u003eHe blinked and opened his eyes, staring at her as if he didn\u0027t know her for a minute. The he blinked again and tried to sit up, groaning. \"How did I get here?\" he murmured. He gripped her by the shoulders. \"Mary. Where\u0027s Mary?\"\u003c/p\u003e\n\u003cp\u003eNancy pointed. Mary was seated against another of the sheltering trees, staring straight ahead, her eyes blank even as they were wide open.\u003c/p\u003e\n\u003cp\u003eJeremy stared at Nancy, then touched her cheek, and struggled to rise. He made it halfway and crawled over to Mary.\u003c/p\u003e\n\u003cp\u003e\"Mary?\"\u003c/p\u003e\n\u003cp\u003eShe didn\u0027t seem to see or hear him.\u003c/p\u003e\n\u003cp\u003e\"Oh, Mary,\" he murmured, taking her into his arms. She didn\u0027t protest or respond. After a moment he set her against the tree again and looked at Nancy. \"Help me. I\u0027ve got to make sure the police find us.\"\u003c/p\u003e\n\u003cp\u003eNancy helped him stagger to his feet. \"Stay with Mary,\" he commanded.\u003c/p\u003e\n\u003cp\u003eBlood was trickling down his forehead. Nancy started to say something, then didn\u0027t. What did it matter? They had to have help.\u003c/p\u003e\n\u003cp\u003eIn the silence after Jeremy left, she became aware of the screams of terror, still echoing, audible even over the sirens.\u003c/p\u003e\n\u003cp\u003eA minute later, through the trees, she saw the police vehicles drive up. Suddenly the night was aglow with flashing lights.\u003c/p\u003e\n\u003cp\u003eThe police seemed to be everywhere, helping those who had stumbled outside, those who were injured and those who were in shock.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s going to be okay now, Mary,\" she whispered gently, hugging her friend. She wondered if she should get Mary up, try to force her back toward the house. But as she sat there, shivering, she saw that Jeremy had found help and was bringing the police toward them.\u003c/p\u003e\n\u003cp\u003eShe began to weep.\u003c/p\u003e\n\u003cp\u003eAs she did, she looked up at a sky streaked with black and red....\u003c/p\u003e\n\u003cp\u003eAt a night sky that seemed to bleed.\u003c/p\u003e\n\u003cp\u003eJeremy didn\u0027t go to the police station with some of the others who had been rounded up, screaming and in panic, outside the old castle. He\u0027d been whisked off to the hospital, like Mary, because of the head wound he\u0027d sustained.\u003c/p\u003e\n\u003cp\u003eIt didn\u0027t get him out of having to deal with a police officer.\u003c/p\u003e\n\u003cp\u003eDetective Florenscu sat in a chair by his bed, dark eyes brooding, brow creased with a frown, as he listened to Jeremy\u0027s account of the events.\u003c/p\u003e\n\u003cp\u003eThen he shook his head. Behind him, another officer cleared his throat. Florenscu looked back at his partner, and sighed. \"Mass hysteria,\" he said in English.\u003c/p\u003e\n\u003cp\u003e\"I am not hysterical,\" Jeremy argued. He winced. His head still hurt if he talked too loudly.\u003c/p\u003e\n\u003cp\u003eFlorenscu sighed. \"We searched the place thoroughly. There were no signs of vampires-because vampires do not exist. But even in a small village, there is crime. And here, with so many tourists, men and women of unsavory character are drawn to our streets. Our only chance of finding them is with the help of the victims. Withyour help.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve told you what I saw,\" Jeremy said softly, closing his eyes.\u003c/p\u003e\n\u003cp\u003e\"Please, you must keep trying to remember everything. Tomorrow you can go through books of photos for me.\"\u003c/p\u003e\n\u003cp\u003e\"Ask Mary,\" Jeremy said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid no one can ask your friend anything. She remains in shock. She doesn\u0027t speak, she just stares.\"\u003c/p\u003e\n\u003cp\u003eJeremy roused himself. \"She\u0027ll come out of it. She has to.\"\u003c/p\u003e\n\u003cp\u003eFlorenscu shrugged. \"When she is more stable, we\u0027ll see that your friend gets home to the United States.\"\u003c/p\u003e\n\u003cp\u003e\"Nancy?\" Jeremy whispered.\u003c/p\u003e\n\u003cp\u003e\"She is waiting. You may speak with her now.\" Florenscu rose. \"She says someone brought you out to them in the trees. Who?\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. I wasn\u0027t conscious.\"\u003c/p\u003e\n\u003cp\u003e\"You have no idea?\"\u003c/p\u003e\n\u003cp\u003e\"No.\" Jeremy shook his head. He winced. That wasn\u0027t true.\u003c/p\u003e\n\u003cp\u003e\"The man who fought the vampire,\" he said aloud.\u003c/p\u003e\n\u003cp\u003e\"There are no vampires,\" Florenscu told him. \"My men have recovered a large amount of alcohol and drugs. They are demons enough.\"\u003c/p\u003e\n\u003cp\u003e\"There was a vampire,\" Jeremy said determinedly.\u003c/p\u003e\n\u003cp\u003eFlorenscu sighed wearily. \"This is Transylvania,\" he said with a shrug. \"Everyone wants there to be a vampire.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not lying.\"\u003c/p\u003e\n\u003cp\u003e\"No. You are not lying. You are mistaken. But you are trying to be honest with me. So, tell me, what about this other man?\"\u003c/p\u003e\n\u003cp\u003e\"He stopped the vampire.\"\u003c/p\u003e\n\u003cp\u003e\"With a stake?\"\u003c/p\u003e\n\u003cp\u003eThe weary humor was apparent in Florenscu\u0027s voice.\u003c/p\u003e\n\u003cp\u003e\"With a longbow.\"\u003c/p\u003e\n\u003cp\u003e\"Touched with holy water, I imagine.\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t know. All I know is that he saved my life.\"\u003c/p\u003e\n\u003cp\u003e\"Well, that is good. Let us hope I can find him and get some real answers.\"\u003c/p\u003e\n\u003cp\u003eFlorenscu rose and turned to leave at last, his partner following him. The minute he was gone, Nancy burst in. She rushed to him, all but throwing herself on him, then drawing away quickly. \"I\u0027m so sorry. Did I hurt you?\"\u003c/p\u003e\n\u003cp\u003e\"Hug me whether it hurts or not. You\u0027re warm and alive.\"\u003c/p\u003e\n\u003cp\u003eShe sat down on the side of his bed and looked at him, troubled. \"They don\u0027t believe me. Not a word I say.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a little late, but...well, I did say we shouldn\u0027t go. Have you seen Mary?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" She looked down.\u003c/p\u003e\n\u003cp\u003e\"And?\"\u003c/p\u003e\n\u003cp\u003e\"She just stares straight ahead. But she eats when she\u0027s fed, drinks water. We\u0027ll get her home. The doctor said that she might snap out of it in a day or two or...\"\u003c/p\u003e\n\u003cp\u003e\"Or?\"\u003c/p\u003e\n\u003cp\u003e\"Never,\" Nancy said with a wince.\u003c/p\u003e\n\u003cp\u003eJeremy\u0027s mind reeled in a new kind of agony. Mary. He had failed her. And yet...it was a miracle that they were all still alive.\u003c/p\u003e\n\u003cp\u003eHe shook his head; it hurt, and he warned himself not to try that again. \"If we could find the man in the trench coat.... It was black, like his hat. I never saw his face.\" He stared at Nancy. \"He\u0027ll know. He\u0027s the one who brought me out.\"\u003c/p\u003e\n\u003cp\u003eThere was a soft tapping at the door. They turned simultaneously.\u003c/p\u003e\n\u003cp\u003eJessica Fraser was standing there, her soft blond hair rippling down her back, her immense blue eyes filled with concern. He felt a little flutter in his heart, a stir of appreciation. And he felt like a real kid again, glad an adult had come to help him.\u003c/p\u003e\n\u003cp\u003e\"How are you?\" she asked, entering.\u003c/p\u003e\n\u003cp\u003eJeremy stared at her. \"Grateful to be alive,\" he told her. \"Mary...\"\u003c/p\u003e\n\u003cp\u003e\"I just saw her. We have to have faith.\"\u003c/p\u003e\n\u003cp\u003eShe smiled at them, walking to the bedside, touching his forehead. \"I was due to fly out today,\" Jessica said. \"But the police said your parents wouldn\u0027t be here until tonight or tomorrow morning, so...I wanted to be sure you were all safe before I left.\"\u003c/p\u003e\n\u003cp\u003eJeremy felt a pang. \"You don\u0027t have to stay.\"\u003c/p\u003e\n\u003cp\u003eShe laughed softly. \"Maybe I do. You need looking after. You\u0027re very lucky, you know. There have been similar disturbances in several other places. The authorities believe there\u0027s a dangerous cult growing larger on a daily basis, well financed, with members who are adept at setting up in various countries and luring in victims. What on earth made you do something so stupid?\" she asked.\u003c/p\u003e\n\u003cp\u003eHe looked at Nancy. Nancy looked at him.Mary , they both thought. But Mary was barely alive, and he would never blame her.\u003c/p\u003e\n\u003cp\u003e\"Stupidity,\" he told Jessica. Then his eyes widened. \"You were the one who went to the police, who told them something was up.\"\u003c/p\u003e\n\u003cp\u003e\"The minute I found your note,\" she told him.\u003c/p\u003e\n\u003cp\u003eNancy let out a little sob. \"Thank you.\"\u003c/p\u003e\n\u003cp\u003e\"I was young once, too,\" Jessica said ruefully. \"Jeremy,\" she asked, \"how did you get away?\"\u003c/p\u003e\n\u003cp\u003eHere I go again, he thought. Tell the truth and sound like an idiot? Or lie?\u003c/p\u003e\n\u003cp\u003eHe took a deep breath and opted for the truth.\u003c/p\u003e\n\u003cp\u003e\"There was a man,\" he said simply. He almost laughed. \"There was a good man, and a bad man. Or a good man and a monster, a good man...and something that was pure evil. In the end, I\u0027m pretty sure the good man won. Think the police will ever believe that as a story without insisting I\u0027m the victim of mass hysteria?\"\u003c/p\u003e\n\u003cp\u003e\"You should rest now,\" Jessica told him, not pressing for more.\u003c/p\u003e\n\u003cp\u003e\"Hard to do.\"\u003c/p\u003e\n\u003cp\u003e\"Are you afraid?\"\u003c/p\u003e\n\u003cp\u003e\"You bet.\"\u003c/p\u003e\n\u003cp\u003e\"I can stick around,\" she told Nancy, \"if you want to go back to your hostel and sleep.\"\u003c/p\u003e\n\u003cp\u003eNancy shook her head. \"I can\u0027t go anywhere. I want to stay with Jeremy.\"\u003c/p\u003e\n\u003cp\u003eJessica nodded her understanding. \"I\u0027ll go sit with Mary for a while.\"\u003c/p\u003e\n\u003cp\u003e\"Jessica,\" Jeremy said, then hesitated.\u003c/p\u003e\n\u003cp\u003e\"Yes?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t leave. Please. Stay with her. Don\u0027t leave her alone. Stay with her all night. Please.\"\u003c/p\u003e\n\u003cp\u003e\"I will. I promise. I\u0027ll be right down the hall, so call me if you need anything, if you feel uneasy...or just to talk.\"\u003c/p\u003e\n\u003cp\u003eNancy fell asleep in the chair in his room, and he knew that Mary was just down the hall, and that she wasn\u0027t alone, that Jessica was with her. That seemed important, somehow.\u003c/p\u003e\n\u003cp\u003eEventually he slept, but it was a restless sleep. It was as if he could hear the wind, and the wind was whispering a single word.\u003c/p\u003e\n\u003cp\u003eVampyr.\u003c/p\u003e\n\u003cp\u003eBut vampires weren\u0027t real.\u003c/p\u003e\n\u003cp\u003eYes they were.\u003c/p\u003e\n\u003cp\u003ePanic seized him. He tried to awaken.\u003c/p\u003e\n\u003cp\u003eHe thought that he opened his eyes. He was suddenly certain that a man was standing over him. A man wearing a low-brimmed hat and a railway frock coat.\u003c/p\u003e\n\u003cp\u003eHad the man come to check on him? Had he been to see Mary?\u003c/p\u003e\n\u003cp\u003eBut Jessica was with her.\u003c/p\u003e\n\u003cp\u003eAnd this man wouldn\u0027t hurt Mary. He had saved their lives.\u003c/p\u003e\n\u003cp\u003eHadn\u0027t he?\u003c/p\u003e\n\u003cp\u003eWhen Jeremy looked again, the man was gone and the panic left him. He felt a bizarre sense of safety.\u003c/p\u003e\n\u003cp\u003eHe closed his eyes again, and this time he slept deeply. \u003c/p\u003e","sourceLink":"https://allnovel.net/kiss-of-darkness-alliance-vampires-7/page-4.html","bookId":2290,"creation":"Oct 5, 2019 5:54:40 PM","modification":"Oct 5, 2019 5:54:40 PM"}
