{"id":92249,"no":8,"title":"Page 8","content":"\u003cp\u003eBryan MacAllistair was an excellent lecturer. Not only did he know his subject, but he could be grave, then allow laughter, then drive home the seriousness of a point in a way that a straight diatribe could not.\u003c/p\u003e\n\u003cp\u003eHe was also strikingly handsome, Jessica thought, not for the first time.\u003c/p\u003e\n\u003cp\u003eShe felt a stir of something in her heart; a glimpse of a long-gone memory she couldn\u0027t touch. She shook her head.\u003c/p\u003e\n\u003cp\u003eThe rest of his charm was in his voice, in the grin he offered now and then, even the absent way he pushed back a lock of stray hair falling over his forehead now and then. Watching the man speak, Jessica realized he literally seduced his audience.\u003c/p\u003e\n\u003cp\u003eWhatever they were paying him, he was worth it.\u003c/p\u003e\n\u003cp\u003e\"He came straight to see you, and you were given orders from the mayor\u0027s office to speak to him?\" Jessica whispered to Sean.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s apparently been instrumental in solving occult murders all over the world,\" Sean said. \"You really are suspicious of this guy. Why can\u0027t he be just what he seems?\"\u003c/p\u003e\n\u003cp\u003eJessica stared at MacAllistair again.\u003c/p\u003e\n\u003cp\u003e\"Because.\"\u003c/p\u003e\n\u003cp\u003e\"Because why?\"\u003c/p\u003e\n\u003cp\u003eShe shook her head. \"He\u0027s after something. He\u0027s dangerous. I can feel it.\"\u003c/p\u003e\n\u003cp\u003eSean sighed, shook his head and looked at the stage again. \"We\u0027ll put him to the test,\" he said after a moment, his voice deep and teasingly dramatic. \"We\u0027ll gather all our friends and put him in a room with them. If there\u0027s something...not right about him, he\u0027ll give himself away and we\u0027ll know it. And then we\u0027ll see.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a brilliant idea,\" Jessica said.\u003c/p\u003e\n\u003cp\u003eWhen the lecture was over, the room burst into applause. To her genuine annoyance, he even received a standing ovation.\u003c/p\u003e\n\u003cp\u003eStanding and clapping, Sean looked at her with amusement. \"It\u0027s not like he crept into town anonymously,\" he said with a laugh. \"We\u0027ll put him to the test tonight. How\u0027s that?\"\u003c/p\u003e\n\u003cp\u003e\"What? You\u0027re going to throw an instant party?\"\u003c/p\u003e\n\u003cp\u003e\"A small one. Let\u0027s invite him to my house. Nothing big-just the four of us. I\u0027ll call Maggie. We\u0027ll have coffee and beignets or something.\"\u003c/p\u003e\n\u003cp\u003e\"Okay.\" Jessica agreed.\u003c/p\u003e\n\u003cp\u003e\"He might say no,\" Sean warned.\u003c/p\u003e\n\u003cp\u003eBut the man of the hour didn\u0027t refuse the invitation. It seemed as if they had to wait forever for his throng of admirers to dissipate, but when they were finally able to reach him, Sean did the talking, issuing the invitation.\u003c/p\u003e\n\u003cp\u003eBryan MacAllistair smiled slowly and looked at Jessica. \"Sure.\"\u003c/p\u003e\n\u003cp\u003eShe felt as if they\u0027d thrown down a gauntlet-and he\u0027d picked it up with tremendous amusement.\u003c/p\u003e\n\u003cp\u003eThe house was beautiful, a true old Southern plantation. Maggie was equally beautiful, Bryan thought, the perfect mistress of such a place, with a regal stance, thick hair of vibrant auburn and mystical hazel eyes. She and Sean had three children, two boys and a girl, who were quick to throw their arms around their father and Jessica, and just a shade reticent when they saw him. Then they gravely shook his hand before being sent off to bed.\u003c/p\u003e\n\u003cp\u003eMaggie Canady seemed pleased to have him in her home; she was friendly and gracious, but Bryan knew that she was studying him as curiously as her husband and Jessica did. As suspiciously.\u003c/p\u003e\n\u003cp\u003eNot a problem. They were welcome to be just as suspicious as they chose.\u003c/p\u003e\n\u003cp\u003eHe could wear a smile, and he knew how to be on guard.\u003c/p\u003e\n\u003cp\u003e\"This is quite a house,\" he told Sean, after being shown the downstairs. It was the kind of place that might have been a stop on a tour of historic New Orleans, antebellum, with a graceful staircase, massive foyer and comfortably proportioned side rooms meant for entertainment.\u003c/p\u003e\n\u003cp\u003e\"And you\u0027re wondering how I can afford it on a cop\u0027s salary?\" Sean inquired dryly.\u003c/p\u003e\n\u003cp\u003e\"Actually, I was just admiring it at the moment.\"\u003c/p\u003e\n\u003cp\u003e\"The house has been in Maggie\u0027s family for a couple of centuries,\" Sean told him.\u003c/p\u003e\n\u003cp\u003e\"The house, the kids...your wife is really something.\"\u003c/p\u003e\n\u003cp\u003eThe look on Canady\u0027s face as he smiled was something Bryan envied. Here was a man who didn\u0027t just love his wife but was stillin love with her, as well. \"She\u0027s a miracle worker. She has a shop in the Quarter, too. All back in full gear now, after the storms. We have help around the house, though.\"\u003c/p\u003e\n\u003cp\u003e\"Hey, guys, coffee is on, unless you prefer tea,\" Jessica said, appearing from the kitchen.\u003c/p\u003e\n\u003cp\u003eShe held her head at an angle, smiling as she spoke. Her beauty was delicate and fine, the structure of her face perfect, her blond hair a captivating frame for it. He felt something stirring deep within himself. A memory, a nostalgic longing. But that was the past. Long over and dead. He knew that.\u003c/p\u003e\n\u003cp\u003eStill, she aroused him in a way he hadn\u0027t felt in ages.\u003c/p\u003e\n\u003cp\u003e\"Coffee,\" he said. \"And thanks.\"\u003c/p\u003e\n\u003cp\u003eHe and Sean followed her back into the kitchen. There was a formal dining room, but they gathered around the large table that sat not far from the giant hearth, once used to cook meals for both family and servants. \"I hear the house has been in your family for years,\" he said, addressing Maggie as he took the chair she indicated. \"That\u0027s a gorgeous painting at the top of the stairs. You really resemble your ancestor.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" she murmured. \"Pecan pie? Brownies?\"\u003c/p\u003e\n\u003cp\u003eHe waved a hand. \"Thanks. Just coffee is fine.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the best pecan pie in the world,\" Jessica commented, a subtle smile still curving her lips.\u003c/p\u003e\n\u003cp\u003e\"You made it?\" he asked Maggie.\u003c/p\u003e\n\u003cp\u003e\"I made it,\" Sean announced. \"I can\u0027t tell you how many cops actually watch the cooking channel.\"\u003c/p\u003e\n\u003cp\u003eBryan laughed and accepted a piece of pecan pie.\u003c/p\u003e\n\u003cp\u003e\"How are you doing with my new bathing suit?\" Maggie asked Jessica. \"She\u0027s got a great eye for fashion,\" she went on, turning to Bryan.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve done some sketches. Sorry, I\u0027ve been slow,\" Jessica said.\u003c/p\u003e\n\u003cp\u003e\"No problem, but you should know that I\u0027m thinking of carrying as many as you can make in my shop.\"\u003c/p\u003e\n\u003cp\u003e\"Sounds good,\" Jessica said.\u003c/p\u003e\n\u003cp\u003eThen Maggie suddenly looked sharply at Bryan.\u003c/p\u003e\n\u003cp\u003e\"So you\u0027re a professor?\"\u003c/p\u003e\n\u003cp\u003eHe nodded. \"Yes, I\u0027m lecturing at the university for a few months.\"\u003c/p\u003e\n\u003cp\u003e\"But you went to the station to see Sean. And you\u0027re staying at Jessica\u0027s place. What a coincidence,\" Maggie said, staring at him.\u003c/p\u003e\n\u003cp\u003eHe shrugged, leaning forward slightly, not letting his gaze slip from hers. \"I believe there\u0027s going to be trouble here,\" he said flatly.\u003c/p\u003e\n\u003cp\u003e\"Trouble?\" she arched a brow. \"Are you bringing the trouble?\"\u003c/p\u003e\n\u003cp\u003eHardly a discreet question. He leaned back, grinning. \"No, ma\u0027am. I don\u0027t bring trouble.\"\u003c/p\u003e\n\u003cp\u003e\"But you do follow it?\" Jessica asked softly.\u003c/p\u003e\n\u003cp\u003eHe turned to her. \"I haven\u0027t come here hiding anything,\" he said, as if he knew they all suspected him of having done just that. \"I\u0027ve explained several times-\"\u003c/p\u003e\n\u003cp\u003e\"Not to me,\" Maggie said politely.\u003c/p\u003e\n\u003cp\u003e\"No, nor to me, not really,\" Jessica agreed.\u003c/p\u003e\n\u003cp\u003eHe glanced apologetically at Sean. \"Because of my expertise in ancient beliefs, and the way they\u0027re often twisted in the present, I\u0027ve been able to help the police solve cult-related murders in several countries. A number of them have been associated with parties like the one several local students attended in Romania recently. Rumor has it that New Orleans is the next city on the circuit, that celebrities will show up, that it\u0027s going to be very wild and sexy.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a sex party coming to New Orleans?\" Jessica asked. She looked at Maggie, shrugged and turned to him, speaking dryly. \"What a shock.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a little more than that,\" Bryan said. \"There\u0027s talk of something dangerous. Vampires. Latex and leather.\"\u003c/p\u003e\n\u003cp\u003eJessica stood suddenly. \"More coffee, anyone?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m fine, thanks,\" Maggie murmured.\u003c/p\u003e\n\u003cp\u003e\"So? Such a party is hardly uncommon,\" Sean said.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s a big party this fall at one of the big hotel chains,\" Maggie said. \"I heard some women talking about it the other day in the shop. It\u0027s got a bondage theme. That kind of thing goes on all the time.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s something called the Voodoo Ball this Friday night,\" Jessica added. \"One of my patients is a dancer. She\u0027s part of the entertainment.\"\u003c/p\u003e\n\u003cp\u003e\"You can buy just about any kind of entertainment on Bourbon Street,\" Sean said.\u003c/p\u003e\n\u003cp\u003e\"What went down in Transylvania was hardly your usual party,\" Bryan told them bluntly.\u003c/p\u003e\n\u003cp\u003eSilence.\u003c/p\u003e\n\u003cp\u003e\"These parties are all about thevampyr ,\" he said.\u003c/p\u003e\n\u003cp\u003eJessica\u0027s cup clinked against her saucer.\u003c/p\u003e\n\u003cp\u003e\"Well, people whothink they\u0027re vampires,\" Maggie said after a minute, but her voice sounded strange.\u003c/p\u003e\n\u003cp\u003e\"I think Jessica might be of some help on that subject,\" Bryan said.\u003c/p\u003e\n\u003cp\u003e\"What?\" Jessica demanded, shocked, staring at him.\u003c/p\u003e\n\u003cp\u003eHe smiled. \"Sorry. I meant you talk with young people all the time. And then there are the two who went after you this afternoon.\"\u003c/p\u003e\n\u003cp\u003eShe waved a hand in the air. \"Hey, this is New Orleans. There are flocks of Anne Rice fans all over town. There are-\"\u003c/p\u003e\n\u003cp\u003e\"There are those who play at the fantasy,\" Bryan said.\u003c/p\u003e\n\u003cp\u003e\"Yes, of course,\" Jessica agreed. She seemed annoyed. \"I understand what you\u0027re saying, and it\u0027s true that people\u0027s beliefs, however misguided, can make them dangerous.\"\u003c/p\u003e\n\u003cp\u003e\"You have talked to some of them, right?\"\u003c/p\u003e\n\u003cp\u003e\"Them...?\"\u003c/p\u003e\n\u003cp\u003e\"People who think they\u0027re vampires. The ones who literally practice blood rituals, and the ones who think they\u0027re spiritual vampires, sucking the life force from others.\"\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e\"Then I would think, if something was stirring on the breeze, you\u0027d know.\"\u003c/p\u003e\n\u003cp\u003eJessica shook her head. \"Like I said, there\u0027s always something like that going on around here.\"\u003c/p\u003e\n\u003cp\u003e\"Wouldn\u0027t you know if it was something more serious? Like the situation in Transylvania.\"\u003c/p\u003e\n\u003cp\u003e\"Actually, I think Transylvania might have been some kind of mass hysteria-\" Jessica began.\u003c/p\u003e\n\u003cp\u003e\"A girl almost died. May still be dying,\" Bryan said.\u003c/p\u003e\n\u003cp\u003eMaggie rose abruptly, going for the coffeepot. \"That poor girl isn\u0027t doing any better?\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s holding her own,\" Jessica said. \"A friend of hers, Jeremy, stays with her constantly.\"\u003c/p\u003e\n\u003cp\u003e\"People were meant to die at that party,\" Bryan said. \"I\u0027m sure of it.\"\u003c/p\u003e\n\u003cp\u003eSean leaned forward. \"Okay, so someone is throwing parties where the guests are invited to be the entree by people who are either rich, perverted and sick, and believe that they\u0027re carrying out some ancient ritual, or people who are simply perverted sexual killers, or...\"\u003c/p\u003e\n\u003cp\u003e\"Or?\" Bryan said.\u003c/p\u003e\n\u003cp\u003eSean shrugged. \"Or vampires.\"\u003c/p\u003e\n\u003cp\u003e\"Why would they come here?\" Jessica demanded.\u003c/p\u003e\n\u003cp\u003eBryan stared at her. \"It\u0027s a good place to hide in plain sight. You just said so yourself,\" he told her.\u003c/p\u003e\n\u003cp\u003e\"I didn\u0027t say that,\" Jessica protested.\u003c/p\u003e\n\u003cp\u003e\"Yes, you did. Who would really notice another weirdo walking around in a cape?\"\u003c/p\u003e\n\u003cp\u003e\"He\u0027s got you there,\" Sean pointed out.\u003c/p\u003e\n\u003cp\u003eBryan realized both he and Sean were staring at Jessica thoughtfully. And she knew it.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re both making me really uneasy. You know I have a professional obligation, both legal and moral, to keep my sessions confidential.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but...if you know about something dangerous, you have to let us know,\" Sean said.\u003c/p\u003e\n\u003cp\u003eBryan tried not to show his appreciation for the fact that Sean had used the wordus . At least in this, the cop had accepted him, even if only on a subconscious level.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d never let anything bad happen, not if I could stop it,\" Jessica said. She picked up her cup and a few of the plates on the table. \"It\u0027s getting late. Thanks, Maggie, this was great, especially on the spur of the moment and all.\"\u003c/p\u003e\n\u003cp\u003e\"My pleasure,\" Maggie said. She stood, setting a hand on Jessica\u0027s arm. \"Hey, leave it. I\u0027ll get it.\"\u003c/p\u003e\n\u003cp\u003e\"But-\"\u003c/p\u003e\n\u003cp\u003e\"Tomorrow\u0027s Sunday. A lazy day.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll still wake up with three kids,\" Jessica said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s a few dishes. I\u0027ll whip them into the dishwasher while Sean drives you back into the city.\"\u003c/p\u003e\n\u003cp\u003e\"I brought my car. Sean doesn\u0027t have to go anywhere.\"\u003c/p\u003e\n\u003cp\u003e\"In that case, between the two of us, I think we can pick up a few plates.\"\u003c/p\u003e\n\u003cp\u003e\"All right, then...thanks again.\"\u003c/p\u003e\n\u003cp\u003eBryan stood, reaching out a hand to Maggie. \"A pleasure to meet you. And thanks for the pecan pie.\"\u003c/p\u003e\n\u003cp\u003eMaggie thanked him, carefully freeing her hand. \"My pleasure. I look forward to seeing you again.\"\u003c/p\u003e\n\u003cp\u003eThough the last was said very pleasantly, he wondered if there wasn\u0027t a little bit of a warning in the words, as well.\u003c/p\u003e\n\u003cp\u003eAs he followed Sean, who escorted them to the door, he could hear Maggie and Jessica whispering. He knew damned well they were talking about him, but he pretended not to hear anything.\u003c/p\u003e\n\u003cp\u003eAs they drove, Jessica asked him, \"Do you know New Orleans, then?\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" he said.\u003c/p\u003e\n\u003cp\u003e\"So you\u0027ve been here before?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Before Hurricane Katrina, I take it?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, before Katrina.\"\u003c/p\u003e\n\u003cp\u003eHe looked at her, trying to see her face in the shadows that intermingled with the neon lights of the city.\u003c/p\u003e\n\u003cp\u003eShe looked out the window. \"It\u0027s an incredible place, and it\u0027s doing well now,\" she said, almost angrily.\u003c/p\u003e\n\u003cp\u003eDoing well.Just what did she mean by that? Stores were open, people were working and music was flowing?\u003c/p\u003e\n\u003cp\u003eOr that it was filled with the customary good and bad of humanity, but not something that was...pure evil?\u003c/p\u003e\n\u003cp\u003eAgain he felt the stirring of memory, of a longing that lingered like pain. There was something about her that seemed to arouse not just his senses, but a darkened place deep in his soul.\u003c/p\u003e\n\u003cp\u003eWithout talking, they drove slowly along the streets of the French Quarter, then into her driveway, where they exited the car.\u003c/p\u003e\n\u003cp\u003eHer fingers seemed to have lost coordination as she turned the key in the lock. \"I loved your lecture,\" she said into the silence. \"Not just your material but your delivery.\"\u003c/p\u003e\n\u003cp\u003e\"Thanks. I\u0027ve had a lot of practice,\" he told her.\u003c/p\u003e\n\u003cp\u003eShe nodded. She\u0027d gotten the door open at last.\u003c/p\u003e\n\u003cp\u003eThe house was filled with silence and shadows when they entered. Another awkward moment followed, neither are knowing quite what to say.\u003c/p\u003e\n\u003cp\u003e\"Thanks for the invitation to Sean\u0027s house. It was nice getting to know your friends, and I appreciate Sean\u0027s trust in me.\"\u003c/p\u003e\n\u003cp\u003eShe tipped her head at an angle. \"Youare worthy of trust, I hope?\"\u003c/p\u003e\n\u003cp\u003e\"I swear I am.\"\u003c/p\u003e\n\u003cp\u003eShe faked a yawn. \"Well, good night, then.\"\u003c/p\u003e\n\u003cp\u003e\"Good night.\"\u003c/p\u003e\n\u003cp\u003eThey started up the stairs together. Stopped. \"I\u0027m sorry,\" he said. \"After you.\"\u003c/p\u003e\n\u003cp\u003e\"No, no, you\u0027re the guest here. After you.\"\u003c/p\u003e\n\u003cp\u003eHe laughed then, and caught her hand. \"It is a wide staircase.\"\u003c/p\u003e\n\u003cp\u003eHer lashes fell, and then she looked up at him. Eyes were supposedly the window to the soul, he thought, and she had beautiful eyes. They were filled with passion and strength, and with a strange vulnerability, as well. Where he touched her, his hand seemed to burn, his blood to boil. He felt the strangest longing to tell her, \"I would die for you.\"\u003c/p\u003e\n\u003cp\u003eRidiculous.\u003c/p\u003e\n\u003cp\u003eHis laughter faded. \"Plenty of room for both of us,\" he said, seeking nonchalance, but the words were husky with passion instead.\u003c/p\u003e\n\u003cp\u003e\"Of course,\" she said, easing her hand from his.\u003c/p\u003e\n\u003cp\u003eTheir footfalls matched. They reached the hallway.\u003c/p\u003e\n\u003cp\u003e\"Good night,\" she murmured, but she didn\u0027t move.\u003c/p\u003e\n\u003cp\u003e\"Good night,\" he replied.\u003c/p\u003e\n\u003cp\u003eShe was the one who finally managed to step away.\u003c/p\u003e\n\u003cp\u003e\"Tomorrow,\" he managed lightly, and went into his room.\u003c/p\u003e\n\u003cp\u003e\"Tomorrow,\" she said, and walked past.\u003c/p\u003e\n\u003cp\u003eIn his room, he stripped and headed for the shower, thinking that the old wisdom was right, the fleshwas weak!\u003c/p\u003e\n\u003cp\u003eHe stayed under the water for a long time, waiting for his skin to prune and his sex to shrivel. He thought about Mary, about Jeremy sitting sentinel in her room. The kid had seemed so haunted.\u003c/p\u003e\n\u003cp\u003eOf course he was. If the girl wasn\u0027t getting any better...\u003c/p\u003e\n\u003cp\u003eIt had been a good night. The lecture had gone well, and the aftermath had been better. He needed the cops to trust him, needed Jessica\u0027s insights.\u003c/p\u003e\n\u003cp\u003eIt was closer than he could have imagined just a few days ago. His next steps had to be measured and careful. They required careful thought and planning.\u003c/p\u003e\n\u003cp\u003eBut he couldn\u0027t keep his mind on the days ahead. Instead, he kept seeing her so clearly in his mind\u0027s eye.\u003c/p\u003e\n\u003cp\u003eThose eyes...\u003c/p\u003e\n\u003cp\u003eHe turned off the water. The bathroom was supplied with a terry robe that boasted the words Montresse House on the pocket. He slipped into it and went back into his bedroom.\u003c/p\u003e\n\u003cp\u003eHe tried the television.\u003c/p\u003e\n\u003cp\u003eNo good. He felt as if he were caged. Tense, a rampant pulse beating through his veins. Swearing, he walked to the French doors, opened them.\u003c/p\u003e\n\u003cp\u003eThere was a breeze. That was good. The night was filled with the scent of blooming flowers. Soft. Away from the street, the sounds of the city were muted, the earth seemed still.\u003c/p\u003e\n\u003cp\u003eThe night sky remained red. He walked to the balcony and caught something out of the corner of his eye. He turned.\u003c/p\u003e\n\u003cp\u003eShe was on the balcony, as well. She knew he was there, knew he had come. She was watching him, as still as the darkness.\u003c/p\u003e\n\u003cp\u003eLong moments passed as they stood silently, watching each other in the red light of the strange moon and the bloody shadows it cast. He felt the thunder of his own heart growing louder. Felt the heat of her, as if he moved closer ever when he did not. A dozen inane things to say swept through the periphery of his mind; none came to his lips.\u003c/p\u003e\n\u003cp\u003eIn the end, he was never sure if he walked to her or she to him, but the distance was gone. \u003c/p\u003e","sourceLink":"https://allnovel.net/kiss-of-darkness-alliance-vampires-7/page-8.html","bookId":2290,"creation":"Oct 5, 2019 5:54:40 PM","modification":"Oct 5, 2019 5:54:40 PM"}
