{"id":12834,"no":16,"title":"CHAPTER XVI IN HONOUR","content":"\u0026nbsp;‘He makes no friend who never made a foe.’ \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Conyngham remembered the name of Pleydell well enough, and glanced sharply at Estella, recollecting that the General received the ‘Times’ from London. \u0026nbsp;Before he had time to make an answer, and indeed he had none ready, the General came into the room.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah!’ said Vincente in his sociable manner, ‘I see you know each other already—so an introduction is superfluous. \u0026nbsp;And now we will have Sir John’s story. \u0026nbsp;Be seated, my dear sir. \u0026nbsp;But first—a little refreshment. \u0026nbsp;It is a dusty day—a lemonade?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir John declined, his manner strikingly cold and reserved beside the genial empressement of General Vincente. \u0026nbsp;In truth the two men seemed to belong to opposite poles—the one of cold and the other of heat. \u0026nbsp;Sir John had the chill air of one who had mixed among his fellow men only to see their evil side; for the world is a cold place to those that look on it with a chilling glance. \u0026nbsp;General Vincente, on the other hand, whose life had been passed in strife and warfare, seemed ready to welcome all comers as friends and to hold out the hand of good-fellowship to rich and poor alike.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Conyngham shrugged his shoulders with a queer smile. \u0026nbsp;Here was a quandary requiring a quicker brain than his. \u0026nbsp;He did not even attempt to seek a solution to his difficulties, and the only thought in his mind was a characteristic determination to face them courageously. \u0026nbsp;He drew forward a chair for Sir John Pleydell, his heart stirred with that sense of exhilaration which comes to some in moments of peril.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I will not detain you long,’ began the new-comer, with an air slightly suggestive of the law court, ‘but there are certain details which I am afraid I must inflict upon you, in order that you may fully understand my actions.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The remark was addressed to General Vincente, although the speaker appeared to be demanding Conyngham’s attention in the first instance. \u0026nbsp;The learned gentlemen of the Bar thus often address the jury through the ears of the judge.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n General Vincente had seated himself at the table and was drawing his scented pocket-handkerchief across his moustache reflectively. \u0026nbsp;He was not, it was obvious, keenly interested, although desirous of showing every politeness to the stranger. \u0026nbsp;In truth, such Englishmen as brought their affairs to Spain at this time were not as a rule highly desirable persons or a credit to their country. \u0026nbsp;Estella was sitting near the window, rather behind her father, and Conyngham stood by the fireplace, facing them all.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You perhaps know something of our English politics,’ continued Sir John Pleydell, and the General making a little gesture indicative of a limited but sufficient knowledge, went on to say—‘of the Chartists more particularly?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The General bowed. \u0026nbsp;Estella glanced at Conyngham, who was smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘One cannot call them a party, as I have heard them designated in Spain,’ said Sir John parenthetically. \u0026nbsp;‘They are quite unworthy of so distinguished a name. \u0026nbsp;These Chartists consist of the most ignorant people in the land—the rabble, in fact, headed by a few scheming malcontents: professional agitators who are not above picking the pockets of the poor. \u0026nbsp;Many capitalists and landowners have suffered wrong and loss at the hands of these disturbers of the peace, none—’ \u0026nbsp;He paused and gave a sharp sigh which seemed to catch him unawares, and almost suggested that the man had, after all, or had at one time possessed, a heart. \u0026nbsp;‘None more severely than myself,’ he concluded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The General’s face instantly expressed the utmost concern.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My dear sir,’ he murmured.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘For many years,’ continued Sir John hurriedly, as if resenting anything like sympathy, as all good Britons do, ‘the authorities acted in an irresolute and foolish manner, not daring to put down the disturbances with a firm hand. \u0026nbsp;At length, however, a riot of a more serious character at a town in Wales necessitated the interference of the military. \u0026nbsp;The ringleaders were arrested, and for some time the authorities were in considerable doubt as to what to do to them. \u0026nbsp;I interested myself strongly in the matter—having practised the law in my younger days—and was finally enabled to see my object carried out. \u0026nbsp;These men were arraigned, not as mere brawlers and rioters, but under a charge of high treason—a much more serious affair for them.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He broke off with a harsh laugh, which was only a matter of the voice, for his marble face remained unchanged, and probably had not at any time the power of expressing mirth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The ringleaders of the Newport riots were sentenced to long terms of imprisonment, which served my purpose excellently.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir John Pleydell spoke with that cynical frankness which seems often to follow upon a few years devoted to practice at the Common Law Bar, where men in truth spend their days in dissecting the mental diseases of their fellow creatures, and learn to conclude that a pure and healthy mind is possessed by none. \u0026nbsp;He moved slightly in his chair, and seemed to indicate that he had made his first point.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I hope,’ he said, addressing Conyngham directly, ‘that I am not fatiguing you?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Not at all,’ returned the younger Englishman coolly; ‘I am much interested.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The General was studying the texture of his pocket-handkerchief. \u0026nbsp;Estella’s face had grown cold and set. \u0026nbsp;Her eyes from time to time turned towards Conyngham. \u0026nbsp;Sir John Pleydell was not creating a good impression.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I will now come to the more personal part of my story,’ went on that gifted speaker, ‘and proceed to explain my reason for inflicting it upon you.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He still spoke directly to Conyngham, who bowed his head in silence, with the queer smile still hovering on his lips. \u0026nbsp;Estella saw it and drew a sharp breath. \u0026nbsp;In the course of her short life, which had almost been spent in the midst of warfare, she had seen men in danger more than once, and perhaps recognised that smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I particularly beg your attention,’ explained Sir John to Conyngham, ‘because I understand from General Vincente that you are in reality attached to the staff of General Espartero, and it is to him that I look for help.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir John paused again. \u0026nbsp;He had established another point. \u0026nbsp;One almost expected to see him raise his hand to his shoulder to throw back the silken gown.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Some months ago,’ he went on, ‘these Chartists attacked my house in the North of England, and killed my son.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a short silence, and the General muttered a curt and polite Spanish oath under his breath. \u0026nbsp;But somehow the speaker had failed to make that point, and he hurried on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It was not, technically speaking, a murder; my boy, who had a fine spirit, attacked the rioters, and a clever counsel might have got a verdict for the scoundrel who actually struck the blow. \u0026nbsp;I knew this, and awaited events. \u0026nbsp;I did not even take steps against the man who killed my son—an only son and child. \u0026nbsp;It was not, from a legal point of view, worth while.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He laughed his unpleasant laugh again and presently went on.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Fortune, however, favoured me. \u0026nbsp;The trouble grew worse, and the Newport riots at last aroused the Government. \u0026nbsp;The sentence upon the ringleaders gave me my opportunity. \u0026nbsp;It was worth while to hunt down the murderer of my son when I could ensure him sixteen or twenty years’ penal servitude.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Quite,’ said the General; ‘quite.’ \u0026nbsp;And he smiled. \u0026nbsp;He seemed to fail to realise that Sir John Pleydell was in deadly earnest, and really harboured the implacable spirit of revenge with which he cynically credited himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I traced my man to Gibraltar, and thence he appears to have come north,’ continued Sir John Pleydell. \u0026nbsp;‘He has probably taken service under Espartero—many of our English outlaws wear the Spanish Queen’s uniform. \u0026nbsp;He is, of course, bearing an assumed name; but surely it would be possible to trace him?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, yes,’ answered Conyngham, ‘I think you will be able to find him.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir John’s eyes had for a moment a gleam of life in them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah!’ he said, ‘I am glad to hear you say that. \u0026nbsp;For that is my object in coming to this country; and although I have during the course of my life had many objects of ambition or desire, none of them has so entirely absorbed my attention as this one. \u0026nbsp;Half a dozen men have gone to penal servitude in order that I might succeed in my purpose.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a cold deliberation in this statement which was more cruel than cynicism, for it was sincere. \u0026nbsp;Conyngham looked at Estella. \u0026nbsp;Her face had lost all colour, her eyes were burning—not with the dull light of fear, for the blood that ran in her veins had no taint of that in it—but with anger. \u0026nbsp;She knew who it was that Sir John Pleydell sought. \u0026nbsp;She looked at Conyngham, and his smile of cool intrepidity made her heart leap within her breast. \u0026nbsp;This lover of hers was at all events a brave man—and that which through all the ages reaches the human heart most surely is courage. \u0026nbsp;The coward has no friends.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir John Pleydell had paused, and was seeking something in his pocket. \u0026nbsp;General Vincente preserved his attitude of slightly bored attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I have here,’ went on the baronet, ‘a list of the English officers serving in the army of General Espartero at the time of my quitting England. \u0026nbsp;Perhaps you will, at your leisure, be kind enough to cast your eye over it, and make a note of such men as are personally unknown to you, and may therefore be bearing assumed names.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Conyngham took the paper, and, holding it in his hand, spoke without moving from the mantelpiece against which he leant.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You have not yet made quite clear your object in coming to Spain,’ he said. \u0026nbsp;‘There exists between Spain and England no extradition treaty; and even if such were to come in force I believe that persons guilty of political offences would be exempt from its action. \u0026nbsp;You propose to arraign this man for high treason—a political offence according to the law of many countries.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You speak like a lawyer,’ said Sir John, with a laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You have just informed us,’ retorted Conyngham, ‘that all the English in the Spanish service are miscreants. \u0026nbsp;None know the law so intimately as those who have broken it.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah!’ laughed Sir John again, with a face of stone. \u0026nbsp;‘There are exceptions to all rules—and you, young sir, are an exception to that which I laid down as regards our countrymen in Spain, unless my experience of faces and knowledge of men play me very false. \u0026nbsp;But your contention is a just one. \u0026nbsp;I am not in a position to seek the aid of the Spanish authorities in this matter. \u0026nbsp;I am fully aware of the fact. \u0026nbsp;You surely did not expect me to come to Spain with such a weak case as that?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No,’ answered Conyngham slowly, ‘I did not.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir John Pleydell raised his eyes and looked at his fellow countryman with a dawning interest. \u0026nbsp;The General also looked up, from one face to the other. \u0026nbsp;The atmosphere of the room seemed to have undergone a sudden change, and to be dominated by the personality of these two Englishmen. \u0026nbsp;The one will, strong on the surface, accustomed to assert itself and dominate, seemed suddenly to have found itself faced by another as strong and yet hidden behind an easy smile and indolent manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You are quite right,’ he went on in his cold voice. \u0026nbsp;‘I have a better case than that, and one eminently suited to a country such as Spain, where a long war has reduced law and order to a somewhat low ebb. \u0026nbsp;I at first thought of coming here to await my chance of shooting this man—his name, by the way, is Frederick Conyngham; but circumstances placed a better vengeance within my grasp—one that will last longer.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He paused for a moment to reflect upon this long-drawn-out expiation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I propose to get my man home to England, and let him there stand his trial. \u0026nbsp;The idea is not my own; it has, in fact, been carried out successfully before now. \u0026nbsp;Once in England I shall make it my business to see that he gets twenty years’ penal servitude.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And how do you propose to get him to England?’ asked Conyngham.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh! that is simple enough. \u0026nbsp;Only a matter of paying a couple of such scoundrels as I understand abound in Spain at this moment—a little bribing of officials, a heavy fee to some English ship-captain. \u0026nbsp;I propose, in short, to kidnap Frederick Conyngham. \u0026nbsp;But I do not ask you to help me in that. \u0026nbsp;I only ask you to put me on his track—to help me to find him, in fact. \u0026nbsp;Will you do it?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Certainly,’ said Conyngham, coming forward with a card in his hand. \u0026nbsp;‘You could not have come to a better man.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Sir John Pleydell read the card, and had himself in such control that his face hardly changed. \u0026nbsp;His teeth closed over his lower lip for a second; then he rose. \u0026nbsp;The perspiration stood out on his face—the grey of his eyes seemed to have faded to the colour of ashes. \u0026nbsp;He looked hard at Conyngham, and then, taking up his hat, went to the door with curious, uneven steps. \u0026nbsp;On the threshold he turned.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Your insolence,’ he said breathlessly, ‘is only exceeded by your—daring.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As the door closed behind him there came, from that part of the room where General Vincente sat, a muffled click of steel, as if a sword half out of its scabbard had been sent softly home again.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2872/79464.html","bookId":1166,"creation":"Aug 2, 2019 5:00:55 AM","modification":"Aug 2, 2019 5:00:55 AM"}
