{"id":12824,"no":6,"title":"CHAPTER VI AT RONDA","content":"\u0026nbsp;‘Le plus grand art d’un habile homme est celui de savoir cacher son habileté.’ \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When Conyngham awoke after a night conscientiously spent in that profound slumber which waits on an excellent digestion and a careless heart, he found the prison attendant at his bedside. \u0026nbsp;A less easy-going mind would perhaps have leapt to some nervous conclusion at the sight of this fierce-visaged janitor, who, however, carried nothing more deadly in his hand than a card.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is the Captain-General,’ said he, ‘who calls at this early hour. \u0026nbsp;His Excellency’s letter has been delivered, and the Captain-General scarce waited to swallow his morning chocolate.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Very much to the Captain-General’s credit,’ returned Conyngham rising. \u0026nbsp;‘Cold water,’ he went on, ‘soap, a towel, and my luggage—and then the Captain-General.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The attendant, with an odd smile, procured the necessary articles, and when the Englishman was ready led the way downstairs. \u0026nbsp;He was a solemn man from Galicia, this, where they do not smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n In the patio of the great house, once a monastery, now converted into a barrack for the Guardias Civiles, a small man of fifty years or more stood smoking a cigarette. \u0026nbsp;On perceiving Conyngham he came forward with outstretched hand and a smile which can only be described as angelic. \u0026nbsp;It was a smile at once sympathetic and humorous, veiling his dark eyes between lashes almost closed, parting moustached lips to disclose a row of pearly teeth.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My dear sir,’ said General Vincente in very tolerable English, ‘I am at your feet. \u0026nbsp;That such a mistake should have been made in respect to the bearer of a letter of introduction from my old friend General Watterson—we fought together in Wellington’s day—that such a mistake should have occurred overwhelms me with shame.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He pressed Conyngham’s hand in both of his, which were small and white—looked up into his face, stepped back and broke into a soft laugh. \u0026nbsp;Indeed his voice was admirably suited to a lady’s drawing-room, and suggested nought of the camp or battle field. \u0026nbsp;From the handkerchief which he drew from his sleeve and passed across his white moustache a faint scent floated on the morning air.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Are you General Vincente?’ asked Conyngham.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes—why not?’ \u0026nbsp;And in truth the tone of the Englishman’s voice had betrayed a scepticism which warranted the question.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is very kind of you to come so early. \u0026nbsp;I have been quite comfortable, and they gave me a good supper last night,’ said Conyngham. \u0026nbsp;‘Moreover, the Guardias Civiles are in no way to blame for my arrest. \u0026nbsp;I was in bad company, it seems.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes; your companions were engaged in conveying ammunition to the Carlists; we have wanted to lay our hands upon them for some weeks. \u0026nbsp;They have carried former journeys to a successful termination.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He laughed and shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The guide, Antonio something-or-other, died, as I understand.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well, yes; if you choose to put it that way,’ admitted Conyngham.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The General raised his eyebrows in a gentle grimace expressive of deprecation, with, as it were, a small solution of sympathy, indicated by a moisture of the eye, for the family of Antonio something-or-other in their bereavement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And the other man? \u0026nbsp;Seemed a nice enough fellow . . .’ inquired Conyngham.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The General raised one gloved hand as if to fend off some approaching calamity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘He died this morning—at six o’clock.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Conyngham looked down at this gentle soldier with a dawning light of comprehension. \u0026nbsp;This might after all be the General Vincente whom he had been led to look upon as the fiercest of the Spanish Queen’s adherents.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Of the same complaint?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Of the same complaint,’ answered the General softly. \u0026nbsp;He slipped his hand within Conyngham’s arm, and thus affectionately led him across the patio towards the doorway where sentinels stood at attention. \u0026nbsp;He acknowledged the attitude of his subordinates by a friendly nod; indeed, this rosy-faced warrior seemed to brim over with the milk of human kindness.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The English,’ he said, pressing his companion’s arm, ‘have been too useful to us for me to allow one of them to remain a moment longer in confinement. \u0026nbsp;You say you were comfortable. \u0026nbsp;I hope they gave you a clean towel and all that.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes, thanks,’ answered Conyngham, suppressing a desire to laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘That is well. \u0026nbsp;Ronda is a pleasant place, as you will find. \u0026nbsp;Most interesting—Moorish remains, you understand. \u0026nbsp;I will send my servant for your baggage, and of course my poor house is at your disposal. \u0026nbsp;You will stay with me until we can find some work for you to do. \u0026nbsp;You wish to take service with us, of course?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes,’ answered Conynghamn. \u0026nbsp;‘Rather thought of it—if you will have me.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The General glanced up at his stalwart companion with a measuring eye.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My house,’ he said, in a conversational way, as if only desirous of making matters as pleasant as possible in a life which nature had intended to be peaceful and sunny, and perhaps trifling, but which the wickedness of men had rendered otherwise, ‘my house is, as you would divine, only an official residence, but pleasant enough—pleasant enough. \u0026nbsp;The garden is distinctly tolerable; there are orange trees now in bloom—so sweet of scent.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The street into which they had now emerged was no less martial in appearance than the barrack yard, and while he spoke the General never ceased to dispense his kindly little nod on one side or the other in response to military salutations.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘We have quite a number of soldiers in Ronda at present,’ he said, with an affectionate little pressure of Conyngham’s arm, as if to indicate his appreciation of such protection amid these rough men. \u0026nbsp;‘There is a great talk of some rising in the South—in Andalusia—to support Se?or Cabrera, who continually threatens Madrid. \u0026nbsp;A great soldier, they tell me, this Cabrera, but not—well, not perhaps quite, eh?—a caballero, a gentleman. \u0026nbsp;A pity, is it not?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘A great pity,’ answered Conyngham, taking the opportunity at last afforded him of getting a word in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘One must be prepared,’ went on the General with a good-natured little sigh, ‘for such measures. \u0026nbsp;There are so many mistaken enthusiasts—is it not so? \u0026nbsp;Such men as your countryman, Se?or Flinter. \u0026nbsp;There are so many who are stronger Carlists than Don Carlos himself, eh?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The secret of conversational success is to defer to one’s listener. \u0026nbsp;A clever man imparts information by asking questions, and obtains it without doing so.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘This is my poor house,’ continued the soldier, and as he spoke he beamed on the sentries at the door. \u0026nbsp;‘I am a widower, but God has given me a daughter who is now of an age to rule my household. \u0026nbsp;Estella will endeavour to make you comfortable, and an Englishman—a soldier—will surely overlook some small defects.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He finished with a good-natured laugh. \u0026nbsp;There was no resisting the sunny good-humour of this little officer, or the gladness of his face. \u0026nbsp;His attitude towards the world was one of constant endeavour to make things pleasant, and acquit himself to his best in circumstances far beyond his merits or capabilities. \u0026nbsp;He was one who had had good fortune all his days. \u0026nbsp;Those who have greatness thrust upon them are never much impressed by their burden. \u0026nbsp;And General Vincente had the air of constantly assuring his subordinates that they need not mind him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The house to which he conducted Conyngham stood on the broad main street, immediately opposite a cluster of shops where leather bottles were manufactured and sold. \u0026nbsp;It was a large gloomy house with a patio devoid of fountain and even of the usual orange trees in green boxes.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Through there is the garden—most pleasant and shady,’ said the General, indicating a doorway with the riding-whip he carried.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n A troop of servants awaited them at the foot of the broad Moorish staircase open on one side to the patio and heavily carved in balustrade and cornice. \u0026nbsp;These gentlemen bowed gravely—indeed, they were so numerous that the majority of them must have had nothing to do but cultivate this dignified salutation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The se?orita?’ inquired the General.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The se?orita is in the garden, Excellency,’ answered one with the air of a courtier.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Then let us go there at once,’ said General Vincente, turning to Conyngham, and gripping his arm affectionately.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n They passed through a doorway whither two men had hurried to open the heavy doors, and the scent of violets and mignonette, of orange in bloom, and of a hundred opening buds swept across their faces. \u0026nbsp;The brilliant sunlight almost dazzled eyes that had grown accustomed to the cool shade of the patio, for Ronda is one of the sunniest spots on earth, and here the warmth is rarely oppressive. \u0026nbsp;The garden was Moorish, and running water in aqueducts of marble, yellow with stupendous age, murmured in the shade of tropical plants. \u0026nbsp;A fountain plashed and chattered softly, like the whispering of children. \u0026nbsp;The pathways were paved with a fine white gravel of broken marble. \u0026nbsp;There was no weed amid the flowers. \u0026nbsp;It seemed a paradise to Conyngham, fresh from the grey and mournful northern winter, and no part of this weary, busy world. \u0026nbsp;For here were rest and silence, and that sense of eternity which is only conveyed by the continuous voice of running or falling water. \u0026nbsp;It was hard to believe that this was real and earthly. \u0026nbsp;Conyngham rubbed his eyes and instinctively turned to look at his companion, who was as unreal as his surroundings—a round-faced, chubby little man, with a tender mouth and moist dark eyes looking kindly out upon the world, who called himself General Vincente; and the name was synonymous in all Spain with bloodthirstiness and cruelty, with daring and an unsparing generalship.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Come,’ said he, ‘let us look for Estella.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He led the way along a path winding among almond and peach trees in full bloom, in the shadow of the weird eucalyptus and the feathery pepper tree. \u0026nbsp;Then with a little word of pleasure he hurried forward. \u0026nbsp;Conyngham caught sight of a black dress and a black mantilla, of fair golden hair, and a fan upraised against the rays of the sun.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Estella, here is a guest: Mr. Conyngham, one of the brave Englishmen who remember Spain in her time of trouble.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Conyngham bowed with a greater ceremony than we observe to-day, and stood upright to look upon that which was for him from that moment the fairest face in the world. \u0026nbsp;As, to some men, success or failure seems to come early and in one bound, so, for some, Love lies long in ambush, to shoot at length a single and certain shaft. \u0026nbsp;Conyngham looked at Estella Vincente, his gay blue eyes meeting her dark glance with a frankness which was characteristic, and knew from that instant that his world held no other woman. \u0026nbsp;It came to him as a flash of lightning that left his former life grey and neutral, and yet he was conscious of no surprise, but rather of a feeling of having found something which he had long sought.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The girl acknowledged his salutation with a little inclination of the head and a smile which was only of the lips, for her eyes remained grave and deep. \u0026nbsp;She had all the dignity of carriage famous in Castilian women, though her figure was youthful still, and slight. \u0026nbsp;Her face was a clean-cut oval, with lips that were still and proud, and a delicately aquiline nose.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My daughter speaks English better than I do,’ went on the General in the garrulous voice of an exceedingly domesticated man. \u0026nbsp;‘She has been at school in England—at the suggestion of my dear friend Watterson—with his daughters, in fact.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And must have found it dull and grey enough compared with Spain,’ said Conyngham.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah! \u0026nbsp;Then you like Spain?’ said the General eagerly. \u0026nbsp;‘It is so with all the English. \u0026nbsp;We have something in common, despite the Armada, eh? \u0026nbsp;Something in manner and in appearance, too; is it not so?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He left Conyngham, and walked slowly on with one hand at his daughter’s waist.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I was very happy in England,’ said Estella to Conyngham, who walked at her other side; ‘but happier still to get home to Spain.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her voice was rather low, and Conyngham had an odd sensation of having heard it before.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Why did you leave your home?’ she continued in a leisurely conversational way which seemed natural to the environments.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The question rather startled the Englishman, for the only answer seemed to be that he had quitted England in order to come to Ronda and to her, following the path in life that fate had assigned to him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘We have troubles in England also—political troubles,’ he said, after a pause.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘The Chartists,’ said the General cheerfully. \u0026nbsp;‘We know all about them, for we have the English newspapers. \u0026nbsp;I procure them in order to have reliable news of Spain.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He broke off with a little laugh, and looked towards his daughter.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘In the evening Estella reads them to me. \u0026nbsp;And it was on account of the Chartists that you left England?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Ah, you are a Chartist, Mr. Conyngham.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes,’ admitted the Englishman after a pause, and he glanced at Estella.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2872/79454.html","bookId":1166,"creation":"Aug 2, 2019 5:00:26 AM","modification":"Aug 2, 2019 5:00:26 AM"}
