{"id":12827,"no":9,"title":"CHAPTER IX A WAR OF WIT","content":"\u0026nbsp;‘La discrétion est l’art du mensonge.’ \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Alcalde blew out his cheeks and looked at General Vincente. \u0026nbsp;Se?ora Barenna would with small encouragement have thrown herself into Conyngham’s arms; but she received none whatever, and instead frowned at Julia. \u0026nbsp;Estella was looking haughtily at her father, and would not meet Conyngham’s glance.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I feel sure,’ said General Vincente in his most conciliating manner, ‘that my dear Julia will see the necessity of satisfying the good Alcalde by showing him the letter—with, of course, the consent of my friend Conyngham.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He laughed, and slipped his hand within Conyngham’s arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You see, my dear friend,’ he said in English, ‘these local magnates are a trifle inflated; local magnitude is a little inclined to inflate, eh? \u0026nbsp;Ha! ha! \u0026nbsp;And it is so easy to conciliate them. \u0026nbsp;I always try to do so myself. \u0026nbsp;Peace at any price—that is my motto.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he turned aside to arrange his sword, which dragged on the ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Tell her, my dear Conyngham, to let the old gentleman read the letter.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But it is nothing to do with me, General.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I know that, my friend, as well as you do,’ said Vincente with a sudden change of manner, which gave the Englishman an uncomfortable desire to know what he meant. \u0026nbsp;But General Vincente, in pursuit of that peace which had earned him such a terrible reputation in war, turned to Se?ora Barenna with his most reassuring smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is nothing, my dear I?ez,’ he said. \u0026nbsp;‘In these times of trouble the officials are so suspicious, and our dear Alcalde knows too much. \u0026nbsp;He remembers dear Julia’s little affair with Esteban Larralde, now long since lived down and forgotten. \u0026nbsp;Larralde is, it appears, a malcontent, and on the wrong side of the wall. \u0026nbsp;You need have no uneasiness. \u0026nbsp;Ah! your nerves—yes, I know! \u0026nbsp;A great sufferer—yes, I remember. \u0026nbsp;Patience, dear I?ez, patience!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And he patted her stout white hand affectionately.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Alcalde was taking snuff with a stubborn air of disbelief, glancing the while suspiciously at Conyngham, who had eyes for none but Estella.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Alcalde,’ said General Vincente, ‘the incident is past, as we say in the diplomatic service; a lemonade now?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No, General, the incident is not past, and I will not have a lemonade.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh!’ exclaimed General Vincente in gentle horror.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes, this young lady must give me the letter, or I call in my men.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘But your men could not touch a lady, my dear Alcalde.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You may be the Alcalde of Ronda,’ said Conyngham cheerfully, in continuation of the General’s argument; ‘but if you offer such an insult to Se?orita Barenna, I throw you into the fountain, in the deepest part, where it is wettest, just there by the marble dolphin.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n And Conyngham indicated the exact spot with his riding-whip.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Who is this gentleman?’ asked the Alcalde. \u0026nbsp;The question was in the first place addressed to space and the gods—after a moment the speaker turned to General Vincente.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘A prospective aide-de-camp of General Espartero.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n At the mention of the great name the Mayor of Ronda became beautifully less and half bowed to Conyngham.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I must do my duty,’ he said with the stubbornness of a small mind.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And what do you conceive that to be, my dear Alcalde?’ inquired the General.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘To place the Se?orita Barenna under arrest unless she will hand to me the letter she has in her possession.’ \u0026nbsp;Julia looked at him with a smile. \u0026nbsp;She was a brave woman, playing a dangerous game with consummate courage, and never glanced at Conyngham, who with an effort kept his hand away from the pocket where the letter lay concealed. \u0026nbsp;The manner in which she trusted him unreservedly and entirely was in itself cunning enough, for it appealed to that sense of chivalry which is not yet dead in men.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Place me under arrest, Se?or Alcalde,’ she said indifferently, ‘and when you have satisfied me that you have a right to inspect a lady’s private correspondence I will submit to be searched—but not before.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She made a little signal to Conyngham not to interfere.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Se?ora Barenna took this opportunity of asserting herself and her nerves. \u0026nbsp;She sat heavily down on a stone seat and wept. \u0026nbsp;She could hardly have done better, for she was a countess in her own right, and the sight of high-born tears distinctly unnerved the Alcalde.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Well,’ he said, ‘the se?orita has made her own choice. \u0026nbsp;In these times’ (he glanced nervously at the weeping lady) ‘one must do one’s duty.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘My dear Julia,’ protested the General, ‘you who are so sensible—’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Julia shrugged her shoulders and laughed. \u0026nbsp;She not only trusted Conyngham but relied upon his intelligence. \u0026nbsp;It is as a rule safer to confide in the honesty of one’s neighbour than in his wit; better still, trust in neither. \u0026nbsp;Conyngham, who was quick enough when the moment required it, knew that she was fostering the belief that the letter at that moment in his pocket was in her possession. \u0026nbsp;He suspected also that he and Julia Barenna were playing with life and death. \u0026nbsp;Further, he recognised her and her voice. \u0026nbsp;This was the woman who had showed discrimination and calmness in face of a great danger on the Garonne. \u0026nbsp;Had this Englishman, owning as he did to a strain of Irish blood, turned his back on her and danger at such a moment he would assuredly have proved himself untrue to the annals of that race which has made a mark upon the world that will never be wiped out. \u0026nbsp;He looked at the Alcalde and smiled, whereupon that official turned and made a signal with his hand to a man who, dressed in a quiet uniform, had appeared in the doorway of the house.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘What the deuce we are all trying to do I don’t know,’ reflected Conyngham, who indeed was sufficiently at sea to awake the most dormant suspicions.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Alcalde, now thoroughly aroused, protested his inability to neglect a particle of his duty at this troubled period of Spain’s history, and announced his intention of placing Julia Barenna under surveillance until she handed him the letter she had received from Conyngham.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I am quite prepared,’ he added, ‘to give this caballero the benefit of the doubt, and assume that he has been in this matter the tool of unscrupulous persons. \u0026nbsp;Seeing that he is a friend of General Vincente’s, and has an introduction to his Excellency the Duke of Vittoria, he is without the pale of my jurisdiction.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The Alcalde made Conyngham a profound bow and proceeded to conduct Julia and her indignant mother to their carriage.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘There goes,’ said General Vincente with his most optimistic little chuckle, ‘a young woman whose head will always be endangered by her heart.’ \u0026nbsp;And he nodded towards Julia’s retreating form.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Estella turned and walked away by herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Come,’ said the General to Conyngham, ‘let us sit down. \u0026nbsp;I have news for you. \u0026nbsp;But what a susceptible heart—my dear young friend—what a susceptible heart! \u0026nbsp;Julia is, I admit, a very pretty girl—la beauté du diable, eh! \u0026nbsp;But on so short an acquaintance—rather rapid, rather rapid!’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As he spoke he was searching among some letters which he had produced from his pocket, and at length found an official envelope that had already been opened.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I have here,’ he said, ‘a letter from Madrid. \u0026nbsp;You have only to proceed to the capital, and there I hope a post awaits you. \u0026nbsp;Your duties will at present be of a semi-military character, but later I hope we can show you some fighting. \u0026nbsp;This pestilential Cabrera is not yet quelled, and Morella still holds out. \u0026nbsp;Yes, there will be fighting.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He closed the letter and looked at Conyngham. \u0026nbsp;‘If that is what you want,’ he added.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes, that is what I want.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The General nodded and rose, pausing to brush a few grains of dust from his dapper riding-breeches.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Come,’ he said, ‘I have seen a horse which will suit you at the cavalry quarters in the Calle de Bobadilla. \u0026nbsp;Shall we go and look at him?’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Conyngham expressed his readiness to do as the General proposed.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘When shall I start for Madrid?’ he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, to-morrow morning will be time enough,’ was the reply, uttered in an easy-going, indolent tone, ‘if you are early astir. \u0026nbsp;You see, it is now nearly five o’clock, and you could scarcely be in saddle before sunset.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘No,’ laughed Conyngham, ‘scarcely, considering that I have not yet bought the saddle or the horse.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The General led the way into the house, and Conyngham thought of the letter in his pocket. \u0026nbsp;He had not yet read the address. \u0026nbsp;Julia relied upon him to deliver it, and her conduct towards the Alcalde had the evident object of gaining time for him to do so. \u0026nbsp;She had unhesitatingly thrust herself into a position of danger to screen him and further her own indomitable purpose. \u0026nbsp;He thought of her—still as from a distance at which Estella had placed him—and knew that she not only had a disquieting beauty, but cleverness and courage, which are qualities that outlast beauty and make a woman powerful for ever.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n When he and his companion emerged from the great doorway of the house into the sunlight of the Calle Mayor, a man came forward from the shade of a neighbouring porch. \u0026nbsp;It was Concep?ion Vara, leisurely and dignified, twirling a cigarette between his brown fingers. \u0026nbsp;He saluted the General with one finger to the brim of his shabby felt hat as one great man might salute another. \u0026nbsp;He nodded to Conyngham.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘When does his Excellency take the road again?’ he said. \u0026nbsp;‘I am ready. \u0026nbsp;The Guardia Civil was mistaken this time—the judge said there was no stain on my name.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He shrugged his shoulders and waved away the slight with the magnanimity of one who can forgive and forget.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I take the road to-morrow; but our contract ceased at Ronda. \u0026nbsp;I had no intention of taking you on.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You are not satisfied with me?’ inquired Concep?ion, offering his interlocutor the cigarette he had just made.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Oh, yes.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Buen! \u0026nbsp;We take the road together.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Then there is nothing more to be said?’ inquired Conyngham with a good-natured laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Nothing, except the hour at which your Excellency starts.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Six o’clock,’ put in General Vincente quietly. \u0026nbsp;‘Let me see, your name is Concep?ion Vara.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes, Excellency—of Algeciras.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘It is well. \u0026nbsp;Then serve this gentleman well, or else—’ \u0026nbsp;The General paused, and laughed in his most deprecating manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Concep?ion seemed to understand, for he took off his hat and turned gravely away. \u0026nbsp;The General and Conyngham walked rapidly through the streets of Ronda, than which there are none cleaner in the whole world, and duly bought a great black horse at a price which seemed moderate enough to the Englishman, though the vendor explained that the long war had made horseflesh rise in value. \u0026nbsp;Conyngham, at no time a keen bargainer, hurried the matter to an end, and scarce examined the saddle. \u0026nbsp;He was anxious to get back to the garden of the great house in the Calle Mayor before the cool of evening came to drive Estella indoors.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘You will doubtless wish to pack your portmanteau,’ said the General rather breathlessly, as he hurried along with small steps beside Conyngham.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Yes,’ answered the Englishman ingenuously, ‘yes, of course.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Then I will not detain you,’ said General Vincente. \u0026nbsp;‘I have affairs at headquarters. \u0026nbsp;We meet at dinner, of course.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He waved a little salutation with his whip and took a side turning.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The sun had not set when Conyngham with a beating heart made his way through the house into the garden. \u0026nbsp;He had never been so serious about anything in his life. \u0026nbsp;Indeed, his life seemed only to have begun in that garden. \u0026nbsp;Estella was there. \u0026nbsp;He saw her black dress and mantilla through the trees, and the gleam of her golden hair made his eyes almost fierce for the moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘I am going to-morrow morning,’ he said bluntly when he reached her where she sat in the shade of a mimosa.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She raised her eyes for a moment—deep velvet eyes with something in them that made his heart leap within his breast.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘And I love you, Estella,’ he added. \u0026nbsp;‘You may be offended—you may despise me—you may distrust me. \u0026nbsp;But nothing can alter me. \u0026nbsp;I love you—now and ever.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She drew a deep breath and sat motionless.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘How many women does an Englishman love at once?’ she asked coldly at length.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n ‘Only one, se?orita.’\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He stood looking at her for a moment. \u0026nbsp;Then she rose and walked past him into the house.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2872/79457.html","bookId":1166,"creation":"Aug 2, 2019 5:00:35 AM","modification":"Aug 2, 2019 5:00:35 AM"}
