{"id":22565,"no":23,"title":"XXII POOR TABEAU PAYS THE PRICE","content":"\u0026nbsp;Scalp Camp was christened this camp, of April 25 and 26, at the Agua de Tomaso or Thomas Spring, latitude 35° 13′ 08″, longitude 116° 23′ 28″, on the Old Spanish Trail in the northern part of the San Bernardino Desert, southeastern California. Ahead upon the trail was the camping-spot of the Archilette, where had been made the attack upon the caravan camp. Thither by forced march proceeded the company. \n\u003cdiv\u003e\n The Mexican Fuentes informed that the first stretch awaiting was a dry journey of forty or fifty miles. To avoid the heat of day the company pushed on at once, as the sun was setting. While northeastwardly they travelled, by the warm moonlight were revealed to them many white skeletons of horses and mules, strewn along the way; and this was the sign of a dry jornada. Forty-three miles were put behind ere halt was made, before dawn, at a salty, swampy place, illy fitted to refresh. The moon had sunk; but here also the light of dawn disclosed skeletons of animals which had perished from weakness.\n\u003c/div\u003e \n\u003cdiv\u003e\n On the morning of April 29 they were traversing[277] a singularly silent, blasted country of blackish ridges and twisted, squat, repulsive cactus.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The Archilette is just beyond, se?or capitan,” directed Fuentes.\n\u003c/div\u003e \n\u003cdiv\u003e\n With eyes and ears alert the advance quickened their pace. From a low ridge of bare rocks Fuentes pointed to a spot of brush and greenness in a sandy basin before.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is it,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come, boys!” urged the lieutenant. “Charge it.” And down at a gallop, rifles and carbines ready, they galloped—the lieutenant on his gray Sacramento keeping the front, Kit racing him hard, Godey and Tabeau and Talbot and Jacob, eager Oliver and anxious Fuentes and little Pablo, and all, thudding to overtake.\n\u003c/div\u003e \n\u003cdiv\u003e\n But the spring of the Archilette lay unresponsive, seemingly without life. Only, before a willow lean-to which had been a shelter was the mutilated body of Pablo’s father, the Hernandez, with both legs and one arm missing. He had stood stanch in defence of his wife. Near by, in another willow lean-to, was the body of Santiago Giacome, a powerful frame, also pierced with arrows. The savages long had departed, and they must have borne with them the mother of Pablo and the wife of Fuentes.\n\u003c/div\u003e \n\u003cdiv\u003e\n While the party were sorrowfully regarding, out from the bushes crept a small Mexican lap-dog—suddenly, with glad yelps to leap upon Pablo’s legs and[278] lick his hand. The Hernandez dog he was; and not having been noted by the Indians he had remained in lonely vigil here, at this dreadful place, watching and waiting. How glad he was to see Pablo his young master! Pablo picked him up, and carrying him walked along wailing, distracted:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mi padre! Mi madre! Ay, mi padre y mi madre! (My father! My mother! Oh, my father and my mother!)”\n\u003c/div\u003e \n\u003cdiv\u003e\n Fuentes wrapped his head in his serape, thus to mourn.\n\u003c/div\u003e \n\u003cdiv\u003e\n None in the company wished to stay here, but there was no other camping-spot, and the animals must have water. The lieutenant wrote upon a piece of paper a brief story of the tragedy, and by a cleft stick planted it so that the approaching caravan might know what had befallen their comrades. The Archilette was renamed Hernandez Spring—Agua de Hernandez. It is in extreme Southwestern Nevada.\n\u003c/div\u003e \n\u003cdiv\u003e\n The march was waxing cruelly severe upon the animals. By water and grass were they grudgingly nourished, but by the rocks of the innumerable ridges were their hoofs cut to the quick. Mule and horse dropped daily. When they died by pain and exhaustion, or must be shot, Fuentes the Mexican quickly cut off mane and tail for hair bridles, saddle-girths, etc.\n\u003c/div\u003e \n\u003cdiv\u003e\n Amidst increasing hills, abloom with cacti and acacia, and over a low snowy mountain into another skeleton-strewn dry jornada, of almost sixty miles,[279] rode the Frémont and Carson men. By chewing the acid sour dock, and by sucking at the pulpy bisnaga cactus known to Fuentes the Mexican, they moistened their thirst; until at midnight the California mules, breaking into a run, gave warning of water scented more than a mile before. This was the Rio de los Angeles, or River of the Angels, tributary to the Virgin River which itself flows south into the canyoned Colorado.\n\u003c/div\u003e \n\u003cdiv\u003e\n Upon the bluffy bank of the Rio de los Angeles, to-day styled only the Muddy River, must camp be pitched. At daybreak Indians swarmed down. With the first sight of them, frightened Pablo and his little dog ran to hide in a tent and Fuentes the man exclaimed, in furious Spanish:\n\u003c/div\u003e \n\u003cdiv\u003e\n “There they are! The murderers! The same people who killed at the Archilette! Curses on them!”\n\u003c/div\u003e \n\u003cdiv\u003e\n A bare-footed, bare-skinned, under-sized tribe they were, ill-looking, their hair tied in a knot atop their sharp, restless-eyed faces. Many of them carried hooked sticks, with which they hauled out lizards and other vermin from holes, to cook them and eat them. All the men bore the long, stout desert bow, and wore a quiver bristling with thirty or forty arrows fitted to points of volcanic glass, or obsidian.\n\u003c/div\u003e \n\u003cdiv\u003e\n Every Indian who would enter the lines of the camp was told to leave his bow and arrows outside; but defying the orders an old chief and several companions[280] forced their way in, bow in one hand, two or three arrows ready in the other, and quiver at back.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Vamose! Puk-a-chee! Get out! Outside!” were volleyed at him the cries; and he impudently put his fingers in his ears, as sign that he could not hear.\n\u003c/div\u003e \n\u003cdiv\u003e\n Gazing about the camp, he counted on his fingers the inmates—including a mule that was being shod! He counted twenty-two.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why, there are none of you,” he jeered. “But of us——” and he pointed to the hills and mountains, “there are many, many.” He pointed to the rifles, of which he appeared to think little. “You have those.” He twanged his bow. “We have these!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Up sprang Kit Carson, who had been sitting near. His tanned face was white-hot, his grayish eyes flamed bright blue. The filthy Indian’s contemptuous, ignorant words had stung him to the quick. He was the Kit Carson of the Kiowa fight, at the wagon-train corral on the Santa Fé Trail. Not since then had Oliver witnessed him so angry.\n\u003c/div\u003e \n\u003cdiv\u003e\n He had cocked his rifle; with one hand he clenched it, and the other hand he shook under the Indian’s nose.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t say that, old man!” he bade, in short, stern tone. “Don’t say that, unless you want to die.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He spoke in English; and the old chief recoiled, his eyes darting the venom of a snake’s, as if he understood.\n\u003c/div\u003e \n\u003cdiv\u003e\n Oliver stepped forward, ready to help the man he[281] loved. Through the camp sped the click of gun-locks.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Steady, Kit,” now warned the lieutenant, alarmed. “We’re avoiding trouble, remember. He’s only an ignorant Digger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No Injun, Digger or not, can come into camp whar I am an’ talk that way. We’re boss in this camp; it’s our camp,” declaimed Kit, still angry. “They can insult us from outside, ’cause that air Injun way; but if we once get to letting ’em in, with arms, they’ll massacree us, sure. This ought to be stopped right at the start, captain.” And again he applied himself to the hateful old chief. “Get out! Go!” Pointing, with stamp of foot, while he relaxed not his glare, Kit Carson at that moment looked to Oliver as fancy once had painted him—eight feet tall and four broad.\n\u003c/div\u003e \n\u003cdiv\u003e\n Slightly wilting, but defiant, the old chief and his squad reluctantly slunk away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” commented the lieutenant, when all breathed easier, “that old fellow was nearer his end than he ever will be again until he meets it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Several horses and mules had been left behind, on the trail, to be brought along, later, after they had rested. Thomas Fitzpatrick, who had gone back after them, now reported that they had been killed by the Indians, cut up, and the fragments spread upon the brush, to cure. This evening the lieutenant turned over to some of the Indians another horse, for a feast; but instead of pleasing the tribe it only made those Indians who got none the more insulting.\n\u003c/div\u003e \n\u003cdiv\u003e\n [282]\n\u003c/div\u003e \n\u003cdiv\u003e\n It was the late afternoon of May 9, and the company had travelled twenty-eight miles up the Virgin River from the point where, twenty miles across from the Muddy, they had struck it. Now they were encamped in the northwestern corner of Arizona, at the foot of the Beaver Dam Mountains, and about opposite the stream which here comes into the Virgin. The camp was drowsy, after long and ceaseless vigils. A high wind had died away to merely a faint breeze which scarcely disturbed the summer temperature. Over the mountain ranges to the north rested masses of white cloud, which the sun, about to set, was tinging pink. A strong horse-guard was out with the animals, in charge of Baptiste Tabeau. Two sentries watched the camp, from either end. Most of the members off duty were dozing; but the hour was at hand when the mess fires must be built up. The lieutenant had been asleep, in his lodge, for three hours. The outlines of him could be seen, through the open flaps, and under the raised edges.\n\u003c/div\u003e \n\u003cdiv\u003e\n As Oliver, who was sitting cleaning his rifle, glanced at him again, the lieutenant stirred, as if awake; at that moment Kit Carson, buckskin-clad, wiry little man, came striding quick, rifle, as customary, in hollow of left arm.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You awake, captain?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. What is it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Haven’t seen Tabeau, have you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n [283]\n\u003c/div\u003e \n\u003cdiv\u003e\n “Baptiste?” The lieutenant sat up. “No. He’s on horse-guard, isn’t he?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wall, he rode down the trail, after his lame mule we left at t’other camp a mile below.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hasn’t he come back?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Haven’t seen him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “How long ago?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What!” The lieutenant hastily stood. “Who gave him permission?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t know. He tuk it, I reckon. Knew we needed the mule.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ve been asleep for some time. He may have come into camp.” The lieutenant spied Oliver. “Have you seen Tabeau, boy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The lieutenant joined Kit, outside the lodge.\n\u003c/div\u003e \n\u003cdiv\u003e\n “This must be looked into. He ought not to have done it—he ought to have notified us and have taken a squad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It war only a mile, he said; so I hear,” observed Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A mile is a long way, in Injun country, Kit. Hello! What’s that?” and the lieutenant pointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n The eyes of all persons thus notified leaped to the spot. About a mile below, or down the river, had up-welled into the calm evening air a column of thick white smoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tabeau’s gone,” exclaimed Kit, instantly.[284] “That’s a coup smoke, to tell a scalp’s been taken an’ everybody should look out!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You think it means Tabeau, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Sartin. That’s whar he started for—that cottonwood grove whar the camp war. The smoke’s at the very place.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Take whatever you can get the quickest and go down there at once,” ordered the lieutenant. “If you ride hard you may not be too late.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’ll ride hard, but we’ll be too late, captain,” answered Kit, already striding away.\n\u003c/div\u003e \n\u003cdiv\u003e\n As he passed, he responded to Oliver’s appealing gaze.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That rifle ready?” He must have noticed the cleaning operation.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Get yore hoss an’ come along. See that you don’t lack powder, lead or caps.” And not having paused, Kit Carson continued upon his own way.\n\u003c/div\u003e \n\u003cdiv\u003e\n Quickly spread the word, that Baptiste Tabeau had been “wiped out.” Many more volunteers offered themselves to Kit than he could use. Everybody liked Tabeau; everybody wished to succor him, or to avenge him. However, Kit deemed that a small party, if well-armed, would be enough; so he chose Oliver, and Baptiste Bernier, Charles Townes, Godey, and Thomas Fitzpatrick—mountain-men all.\n\u003c/div\u003e \n\u003cdiv\u003e\n Scarcely a word was spoken, as they galloped forth. The errand was one of sorrow and grim determination.\n\u003c/div\u003e \n\u003cdiv\u003e\n [285]\n\u003c/div\u003e \n\u003cdiv\u003e\n The mile was covered, and the last night’s camping place lay right ahead. Now the high, gloomy ridges bordering the Virgin were closing down, and the camping place appeared sombre. Extending their front the posse rode right in—eye and ear and finger ready; but it was as silent and deserted as had been the Hernandez Spring at the Archilette. Of Baptiste and his horse, and of the lame mule which he had quested, not a trace could be found.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Better ride on down,” suggested Charles Townes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ought to search those cottonwoods, across,” said Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s a risky business, in the dark, when Injuns are better than white men,” remarked Thomas Fitzpatrick, nevertheless urging his horse into the water. Oliver promptly did the same.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know it, Tom,” answered Kit. “But we’ll have to take the risk.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Alexander Godey interrupted. He had been examining for sign, on down the trail.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here,” he called. “I find it! The lame mule, an’ the savages beside him. En avant, camarades! The savages would drive off the mule, an’ Baptiste, he follows.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Godey had read truly. Where he awaited, in the dusk could be descried, imprinted upon the sandy dust, hoof-marks of a hobbling mule, pointing back down the trail, with the bare soles of Indians on either side of them. Moreover, the hoof-marks of a horse,[286] probably Tabeau’s horse, also were to be descried, pointing in the same direction, but printed upon the others—therefore later.\n\u003c/div\u003e \n\u003cdiv\u003e\n So they followed the trail. After about an hour of steady, silent riding, a rustle in some bushes was heard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “S-st!” warned Kit.\n\u003c/div\u003e \n\u003cdiv\u003e\n They halted, short, and peered, and listened, holding breath. Kit and Godey slipped from their horses, to steal forward, noiseless as shadows. Presently they returned, as silently.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s the mule,” reported Kit. “It’s the lame mule, with an arrow in her side, standing thar, to die. They shot her an’ left her till they’d come back.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Anything of Baptiste?” demanded Fitzpatrick.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We found a wet place—wet an’ sticky—in the brush. Too dark to say jest what it air,” stated Kit, succinctly. “But it, an’ the smoke, taken together, strike me as bad. Don’t believe we can do more till daylight. We mout as well go back to camp.”\n\u003c/div\u003e \n\u003cdiv\u003e\n That was agreed; and sorrowfully again they rode up the trail, soon to be guided by the glow of the camp fires.\n\u003c/div\u003e \n\u003cdiv\u003e\n Little doubt could there be as to Baptiste Tabeau’s fate, but of course his disappearance must be probed to a certainty. At day-break the lieutenant himself, with Thomas Fitzpatrick and Kit and Godey and several others (Oliver being assigned to guard duties), departed[287] for the wounded-mule brush, in search of further sign.\n\u003c/div\u003e \n\u003cdiv\u003e\n When they returned, about noon, they brought only the news which had been feared. Daylight had shown the worst: crimson stains and crushed bushes where Baptiste must have been pierced with an arrow; a crimson path for twenty paces, where he had desperately struggled along; a spot where he had fallen; and then the trace where he had been dragged to the river and thrown in. A shred of leather, from his saddle, was found; but all else—horse, gun, clothing—had vanished completely. The Diggers had taken them. Even the wounded mule was gone.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thus, May 9, 1844, perished wilderness-breaker Baptiste Tabeau, Frémont man from St. Louis. The place of his death is on the left bank of the Virgin River in northwestern Arizona. So, in many a lonely spot, sleep the brave; their monument their deeds achieved for others.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3255/89219.html","bookId":599,"creation":"Aug 2, 2019 2:57:20 PM","modification":"Aug 2, 2019 2:57:20 PM"}
