{"id":110708,"no":2,"title":"Page 2","content":"\u003cp\u003e\"But a mental medium,\" said Barrett.\u003c/p\u003e\n\u003cp\u003e\" - and I want that line of approach employed, as well as yours,\" Deutsch went on, as though Barrett hadn\u0027t spoken.\u003c/p\u003e\n\u003cp\u003e\"Fischer\u0027s presence is obvious.\"\u003c/p\u003e\n\u003cp\u003eBarrett nodded. There was no way out of it, he saw. He\u0027d have to bring up one of his own people after the project was under way. \"As to costs - \" he started.\u003c/p\u003e\n\u003cp\u003eThe old man waved him off. \"Take that up with Hanley. You have unlimited funds.\"\u003c/p\u003e\n\u003cp\u003e\"And time?\"\u003c/p\u003e\n\u003cp\u003e\"That you don\u0027t have,\" Deutsch replied. \"I want the answer in a week.\"\u003c/p\u003e\n\u003cp\u003eBarrett looked appalled.\u003c/p\u003e\n\u003cp\u003e\"Take it or leave it!\" the old man snapped, sudden, naked rage in his expression. Barrett knew he had to accede or lose the opportunity - and there was a chance if he could get his machine constructed in time.\u003c/p\u003e\n\u003cp\u003eHe nodded once. \"A week,\" he said.\u003c/p\u003e\n\u003cp\u003e3:50 P.M.\u003c/p\u003e\n\u003cp\u003eAnything else?\" asked Hanley.\u003c/p\u003e\n\u003cp\u003eBarrett reviewed the items in his mind again. A list of all phenomena observed in the Belasco house. Restoration of its electrical system. Installation of telephone service. The swimming pool and steam room made available to him. Barrett had ignored the small man\u0027s frown at the fourth item. A daily swim and steam bath were mandatory for him.\u003c/p\u003e\n\u003cp\u003e\"One more item,\" he said. He tried to sound casual but felt that his excitement showed. \"I need a machine. I have the blueprints for it at my apartment.\"\u003c/p\u003e\n\u003cp\u003e\"How soon will you need it?\" Hanley asked.\u003c/p\u003e\n\u003cp\u003e\"As soon as possible.\"\u003c/p\u003e\n\u003cp\u003e\"Is it large?\"\u003c/p\u003e\n\u003cp\u003eTwelve years, Barrett thought. \"Quite large,\" he said.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s it?\"\u003c/p\u003e\n\u003cp\u003e\"All I can think of at the moment. I haven\u0027t mentioned living facilities, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Enough rooms have been renovated for your use. A couple from Caribou Falls will prepare and deliver your meals.\" Hanley seemed about to smile. \"They\u0027ve refused to sleep in the house.\"\u003c/p\u003e\n\u003cp\u003eBarrett stood. \"It\u0027s just as well. They\u0027d only be in the way.\"\u003c/p\u003e\n\u003cp\u003eHanley walked him toward the library door. Before they reached it, it was opened sharply by a stout man, who glared at Barrett. Although he was forty years younger and a hundred pounds heavier, William Reinhardt Deutsch bore an unmistakable resemblance to his father.\u003c/p\u003e\n\u003cp\u003eHe shut the door. \"I\u0027m warning you right now,\" he said, \"I\u0027m going to block this thing.\"\u003c/p\u003e\n\u003cp\u003eBarrett stared at him.\u003c/p\u003e\n\u003cp\u003e\"The truth,\" Deutsch said. \"This is a waste of time, isn\u0027t it? Put it in writing, and I\u0027ll make you out a check for a thousand dollars right now.\"\u003c/p\u003e\n\u003cp\u003eBarrett tightened. \"I\u0027m afraid - \"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no such thing as the supernatural, is there?\" Deutsch\u0027s neck was reddening.\u003c/p\u003e\n\u003cp\u003e\"Correct,\" said Barrett. Deutsch began to smile in triumph. \"The word is \u0027 supernormal.\u0027 Nature cannot be transcen - \"\u003c/p\u003e\n\u003cp\u003e\"What the hell\u0027s the difference?\" interrupted Deutsch. \"It\u0027s superstition, all of it!\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sorry, but it isn\u0027t.\" Barrett started past him. \"Now, if you\u0027ll excuse me.\"\u003c/p\u003e\n\u003cp\u003eDeutsch caught his arm. \"Now, look, you better drop this thing. I\u0027ll see you never get that money - \"\u003c/p\u003e\n\u003cp\u003eBarrett pulled his arm free. \"Do what you will,\" he said. \"I\u0027ll proceed until I hear otherwise from your father.\"\u003c/p\u003e\n\u003cp\u003eHe closed the door and started down the corridor. In light of present knowledge, his mind addressed Deutsch, anyone who chooses to refer to psychic phenomena as superstition simply isn\u0027t aware of what\u0027s going on in the world. The documentation is immense -\u003c/p\u003e\n\u003cp\u003eBarrett stopped and leaned against the wall. His leg was starting to ache again. For the first time, he allowed himself to recognize what a strain on his condition it might be to spend a week in the Belasco house.\u003c/p\u003e\n\u003cp\u003eWhat if it was really as bad as the two accounts claimed it was?\u003c/p\u003e\n\u003cp\u003e4:37 P.M.\u003c/p\u003e\n\u003cp\u003eThe Rolls-Royce sped along the hi ghway toward Manhattan.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s an awful lot of money.\" Edith still sounded incredulous.\u003c/p\u003e\n\u003cp\u003e\"Not to him,\" said Barrett. \"Especially when you consider that what he\u0027s paying for is an assurance of immortality.\"\u003c/p\u003e\n\u003cp\u003e\"But he must know that you don\u0027t believe - \"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure he does,\" Barrett interrupted. He didn\u0027t want to consider the possibility that Deutsch hadn\u0027t been told. \"He\u0027s not the sort of man who goes into anything without being totally informed.\"\u003c/p\u003e\n\u003cp\u003e\"But a hundred thousand dollars.\"\u003c/p\u003e\n\u003cp\u003eBarrett smiled. \"I can scarcely believe it myself,\" he said. \"If I were like my mother, I\u0027d undoubtedly consider this a miracle from God. The two things I\u0027ve failed to accomplish both supplied at once - an opportunity to prove my theory, and provision for our later years. Really, I could ask no more.\"\u003c/p\u003e\n\u003cp\u003eEdith returned his smile. \"I\u0027m happy for you, Lionel,\" she said. \u003c/p\u003e","sourceLink":"https://allnovel.net/hell-house/page-2.html","bookId":2542,"creation":"Oct 6, 2019 12:04:29 AM","modification":"Oct 6, 2019 12:04:29 AM"}
