{"id":89694,"no":23,"title":"Page 23","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eBeth had cooked—and cooked, and cooked. She had gone for just about every staple known to Southern Louisiana—corn bread, jambalaya, crawfish étouffée, gumbo, turnip greens, pecan pie, bread pudding, shrimp salad and more.\u003c/p\u003e\n\u003cp\u003eIt astounded even Ashley that she could have prepared such a feast so quickly, but then, when the reenactment wasn’t taking place and they weren’t investigating a murder, Beth did run one of the finest restaurants in the area. There was still a crowd for lunch; Jackson, Ashley, Jake, Frazier, Cliff, Beth and herself.\u003c/p\u003e\n\u003cp\u003eShe noted—as she was sure Cliff did—that their guest investigators did not treat him as a suspect; they treated him as one of the family, which, of course, he had always been. Growing up, he’d been the big brother Ashley had never had, even though he was about thirteen years older than her and had been actually managing much of the plantation while she’d still been playing with her dolls and video games.\u003c/p\u003e\n\u003cp\u003eAt the luncheon table, she wasn’t being haunted by an annoying Confederate in full dress uniform. He wasn’t in the dining room. Not at the moment, and Ashley was grateful for that fact. He’d been in the office with her when she’d been giving Jake the list, and he’d been terribly annoying, wanting her to punctuate every detail regarding every man. She kept thinking that Jake would turn around and see him standing there, laugh and tell her that the fellow was an actor hired to torment her.\u003c/p\u003e\n\u003cp\u003eBut Jake didn’t see the man—so she was the scary one after all, suffering from strange delusions about the dead. They were all probably brought on by the murder.\u003c/p\u003e\n\u003cp\u003eDuring the massive meal, they all spoke as casually as possible in the aftermath of a brutal, senseless killing. Jackson and Jake relayed the conversation they’d had down at the police station until Cliff had left them, saying that he had work at the stables.\u003c/p\u003e\n\u003cp\u003eAshley pretended to listen attentively while wondering again if she had imagined that a ghost—looking as real as flesh and blood—had carried on a meeting with her. She looked here and there around the room, wondering if Marshall Donegal would appear in the flesh—or the appearance of flesh!—sweeping off his great plumed hat and setting a booted foot upon a chair, perhaps.\u003c/p\u003e\n\u003cp\u003eBut though he had been a pest in the office, he didn’t show. She was so busy worrying that he would, however, that she barely heard what was being said. She wondered if Frazier had ever seen the man—or even Cliff. After all, one way or another, they were all related.\u003c/p\u003e\n\u003cp\u003eThen one word that Jake uttered brought her to.\u003c/p\u003e\n\u003cp\u003e…diving…\u003c/p\u003e\n\u003cp\u003e“Diving?” she asked.\u003c/p\u003e\n\u003cp\u003e“I believe that the murderer might have thrown his weapon into the Mississippi,” Jake explained. “He’s organized, and intelligent. Such a killer would know that the murder weapon would be searched for immediately, and that he couldn’t be found with it on his person or his property. So if it were me, I’d throw it in the river as quickly as possible. Actually, I think the killer had Charles with him, maybe drove him away after the reenactment and then brought him back here in some kind of a boat. That being the case, he’d have thrown the weapon into the river while he returned to wherever he had come from by boat.”\u003c/p\u003e\n\u003cp\u003e“Unless, of course,” Ashley said, staring back at Jake as if she dared him to agree, “the murderer held Charles drugged on the property. If that was the case, the killer could have taken him into the cemetery, where he bayoneted him to death, and went on to return to his room. The river has a terrific current, too.”\u003c/p\u003e\n\u003cp\u003e“That’s possible, too,” Jake said evenly. “But I think he threw it in the river—the weight of a weapon could have easily caused it to sink.”\u003c/p\u003e\n\u003cp\u003e“I’m not a suspect, am I?” Beth asked.\u003c/p\u003e\n\u003cp\u003eAshley straightened, looking around the table at the three investigators.\u003c/p\u003e\n\u003cp\u003eJake smiled and answered. “No. It’s highly unlikely that you have the strength needed to carry out what was done.”\u003c/p\u003e\n\u003cp\u003e“Thank the Lord!” Beth said.\u003c/p\u003e\n\u003cp\u003e“But Cliff could be guilty,” Frazier said.\u003c/p\u003e\n\u003cp\u003e“We certainly hope not,” Jackson said.\u003c/p\u003e\n\u003cp\u003e“Wait!” Ashley protested. She didn’t believe that Cliff could be guilty, but she didn’t believe that any of the men who had acted like children on the day of the reenactment could possibly be guilty of such a heinous crime. “Who’s going diving? Aren’t they sending out police divers?”\u003c/p\u003e\n\u003cp\u003e“Yes,” Jake said, frowning slightly. “I’m assuming that at this point they’ll be along really soon. But I want first crack, before the water is churned by a team of four or five.”\u003c/p\u003e\n\u003cp\u003e“But—are you authorized?”\u003c/p\u003e\n\u003cp\u003e“We are working co-jurisdiction,” Jackson said, glancing at Frazier. “Adam’s your grandfather’s friend, and Adam has the influence to make a great deal happen.”\u003c/p\u003e\n\u003cp\u003e“Ashley, you know that I know what I’m doing,” Jake told her. “I’m going to get started now.”\u003c/p\u003e\n\u003cp\u003e“I’ll work with you,” she said.\u003c/p\u003e\n\u003cp\u003e“Ashley—” Jake began.\u003c/p\u003e\n\u003cp\u003e“No one should dive alone,” she reminded him primly. “The water is brown—even with lights, vision is limited,” she said. “You need a dive buddy. And it’s my property.”\u003c/p\u003e\n\u003cp\u003e“Ashley,” Frazier said, “my dearest grandchild, my old heart is still ticking. It’s still my property. You two children can fish through the regulators, tanks and masks we keep because of work that has to sometimes be done down by the bayou.”\u003c/p\u003e\n\u003cp\u003eFrazier had spoken lightly, wanting to ease the tension with smiles. He managed the feat.\u003c/p\u003e\n\u003cp\u003e“Grampa!” Ashley protested.\u003c/p\u003e\n\u003cp\u003e“Well, don’t look at me!” Beth said. “Dive in that nasty old muddy water? No, no, dishes look much, much better than diving in the Mississippi!”\u003c/p\u003e\n\u003cp\u003e“I was planning on working with Jake, too,” Jackson said.\u003c/p\u003e\n\u003cp\u003e“That’s fine. But I’m going,” Ashley said firmly.\u003c/p\u003e\n\u003cp\u003e“All right. Let’s get on it,” Jake said.\u003c/p\u003e\n\u003cp\u003eHalf an hour later, the divers were nearly ready. Ashley had opted for a dive suit—she didn’t like everything in the Mississippi touching her bare skin. Jake and Jackson had eschewed the idea of suits and were just in swim trunks, booties, gloves and their masks and regulators.\u003c/p\u003e\n\u003cp\u003eAngela, Beth and Frazier had come down to the embankment near the cemetery while they checked and rechecked their equipment and the flashlights they’d be working with.\u003c/p\u003e\n\u003cp\u003eAngela had watched Jake walk over and over the embankment near the cemetery wall. He found a spot that seemed to satisfy him.\u003c/p\u003e\n\u003cp\u003e“Here,” he said, looking at them all.\u003c/p\u003e\n\u003cp\u003eJackson, apparently, knew what he was talking about. He came over and hunkered down next to Jake, inspecting the ground. He stood after a moment. “Hard to tell, but possible. We’ll go in here. Time for tanks, children,” he said.\u003c/p\u003e\n\u003cp\u003eThe three assisted each other, buckling into the heavy dive tanks. “You’re just walking in, right?” Angela asked. “Seriously, shouldn’t we be waiting for the police? They’ll have metal detectors—”\u003c/p\u003e\n\u003cp\u003eJake lifted a rod he had on a cord at his wrist. “Jackson has one, too,” he told her.\u003c/p\u003e\n\u003cp\u003e“It is one big damned river,” Frazier said. “And then there’s the bayou—”\u003c/p\u003e\n\u003cp\u003e“I don’t think so, sir,” Jake said. “This is how he managed the movement of the body. This is where he’ll have ditched the weapon.”\u003c/p\u003e\n\u003cp\u003eFrazier nodded. He gazed at Ashley, and she knew that he was worried about her. It was only fair; she was worried about him. She blew him a kiss.\u003c/p\u003e\n\u003cp\u003e“I’ll follow the current and watch for you down by the public ramp,” Angela reminded them. “Don’t try to get back—I’ll be there.”\u003c/p\u003e\n\u003cp\u003e“Keep up with us,” Jake warned, catching Ashley’s hand.\u003c/p\u003e\n\u003cp\u003ePride dictated that she draw away, pride and maybe fear that it was too easy to depend on him so swiftly. But she didn’t draw away; they were diving together, and she wasn’t going to be uncooperative.\u003c/p\u003e\n\u003cp\u003eThey eased into the water over the embankment, a difficult task as it was shallow next to the levee and they sank into the mud. She immediately felt the strength of the current, and she knew what Jake was thinking: if the killer had indeed followed this route, he had gone with the current in whatever little boat he had been maneuvering. He wouldn’t have used a motor; a motor might have been heard.\u003c/p\u003e\n\u003cp\u003eThe brown, muddy waters of the Mississippi covered their heads, and they went with the current themselves, using their flippers to thrust them downward. Ten feet, twenty feet, thirty feet…forty feet. She’d been in the water here before, but only ever to clear growth from the seawall or work with their little strip of dock. The water was filled with silt, and everything before her eyes was curtained behind a brown haze. The sun didn’t penetrate deeply.\u003c/p\u003e\n\u003cp\u003eA massive catfish glided by them, taking a look, moving off quickly. They passed over the ruins of a broken-up tugboat. Gar drifted by, and in the few feet she could see ahead, even with her diving light, Ashley saw that a blue suckerfish was watching them avidly. There seemed to be little else of interest. Diving in clear waters was beautiful, but the Mississippi wasn’t clear. It seemed as if the light dimmed quickly, as if the riverbed sucked it up into the mottled brown darkness.\u003c/p\u003e\n\u003cp\u003eShe heard the rhythmic sound of her regulator, air moving in and out of her own lungs. She usually loved that sound. She glanced over to see that Jake was still moving fluidly at her side, inspecting the river bottom as they drifted along, barely using their fins, the current was so strong.\u003c/p\u003e\n\u003cp\u003eShe tried to give her concentration over to the task at hand.\u003c/p\u003e\n\u003cp\u003eShe felt a jerk on her hand; she turned and saw Jake’s blue-green eyes through his mask. He motioned that they needed to go down. His metal detector had come upon something.\u003c/p\u003e\n\u003cp\u003eFighting the current, they shot downward, only to discover car parts that had been in the river long enough to acquire massive growth. She and Jake, with Jackson close behind, started to move onward again.\u003c/p\u003e\n\u003cp\u003eShe wasn’t at all sure how she saw it, but suddenly it seemed that something bright flickered in the glow of her beam. \u003c/p\u003e","sourceLink":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2/page-23.html","bookId":2276,"creation":"Oct 5, 2019 5:38:00 PM","modification":"Oct 5, 2019 5:38:00 PM"}
