{"id":89697,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“I’m here,” Jake assured him. “I’ll get on the computer.”\u003c/p\u003e\n\u003cp\u003eJackson nodded. He looked down at Angela and squeezed her hand, and Jake knew that her assignment was to discover what she felt about the house.\u003c/p\u003e\n\u003cp\u003eFrazier walked over to Ashley. She stood quickly, hugging him. He hugged her silently in return. “I’m for a nap,” he said. “At my age…” He apologized to the others.\u003c/p\u003e\n\u003cp\u003e“I’ll be in my room, too,” Ashley told him.\u003c/p\u003e\n\u003cp\u003e“A nap sounds good to me,” Beth said, yawning. “And then dinner.”\u003c/p\u003e\n\u003cp\u003eAngela laughed. “Oh, my God, after that delicious lunch you prepared! I’m not sure I’ll be able to eat dinner. I’m going to…search the house. Combine a little work with exercise.”\u003c/p\u003e\n\u003cp\u003e“Search for what?” Ashley asked her.\u003c/p\u003e\n\u003cp\u003e“Evidence,” she said softly.\u003c/p\u003e\n\u003cp\u003eAshley shook her head. “But that won’t help us. Every man had access to the house at some point. What evidence could we possibly find that would be evidence? And the cops have been here, too.”\u003c/p\u003e\n\u003cp\u003e“I never really know what I’m looking for,” Angela said. She glanced at Jake. “But it’s good to walk around and think and look, and then you sometimes find what you didn’t know you were looking for. If that makes sense.”\u003c/p\u003e\n\u003cp\u003e“I’ll be in the study,” he assured her. “If you need me.”\u003c/p\u003e\n\u003cp\u003eBeth and Frazier headed for the stairway, arm in arm as they walked up the stairs.\u003c/p\u003e\n\u003cp\u003eAshley lingered until she was alone with Jake. “Cliff didn’t do this,” she said with finality.\u003c/p\u003e\n\u003cp\u003eHe walked over to her, placing his hands on her shoulders. “Ashley, honestly? I don’t think that Cliff did it, either. But it’s not going to hurt to be careful, to be with someone, to keep the doors locked, right?”\u003c/p\u003e\n\u003cp\u003e“I can be careful,” she murmured, bowing her head.\u003c/p\u003e\n\u003cp\u003eHe lifted her chin gently so that she met his eyes again. “Hey,” he told her huskily. “Remember when we first decided we wanted a rock band and we set up out in the stables? The poor horses! Cliff never said anything. He just moved the drum set into the front yard and told us that birds liked music more than horses—especially heavy metal.”\u003c/p\u003e\n\u003cp\u003eShe smiled. “My father let us move the drum set into the old smokehouse.” Her smile faltered. “Jake, my father has never come back from the dead,” she said.\u003c/p\u003e\n\u003cp\u003eHe was puzzled. She wasn’t angry with him, and she wasn’t even turning away from him or trying to escape him.\u003c/p\u003e\n\u003cp\u003e“I never meant to hurt you,” he said.\u003c/p\u003e\n\u003cp\u003e“Well, I probably managed to hurt myself,” she murmured. “You…scared me. You really, really scared me,” she told him. She was silent a moment, looking at him. “But you should know. My father isn’t here.”\u003c/p\u003e\n\u003cp\u003eShe flushed as if she had said more than she had meant to. She backed away from him. “I’m—uh— I’m going to go to my room,” she said.\u003c/p\u003e\n\u003cp\u003e“Into the land of digital reality for me,” he told her and headed off into the study while she walked toward the stairs.\u003c/p\u003e\n\u003cp\u003eThe subtle, almost elusive scent of her perfume lingered, and he had to force himself not call out her name, not to draw her back to him and demand that she understand. Time had done nothing to lessen his feelings for her.\u003c/p\u003e\n\u003cp\u003eHe wanted to hold her; he wanted the truth. He wanted to make the losses and traumas of her life go away. And, that, of course, was impossible.\u003c/p\u003e\n\u003cp\u003eThey could do their best to find the killer. That was what he could do for her, he thought.\u003c/p\u003e\n\u003cp\u003eBut when he sat behind the desk in the study, he didn’t turn to the computer. He sat in the chair, scanning the space around him. “Where are you, damn you?” he whispered aloud. “Emma Donegal, I saw you. You knew something was wrong. You wanted me here. Please, won’t you come and help me now?”\u003c/p\u003e\n\u003cp\u003eAshley headed for her room, still feeling a flush on her cheeks. Well, she was a fool. She’d turned away from Jake Mallory, cutting him from her life as if she had done so with a sharpened blade. What was she expecting now, and what the hell had she been doing, throwing herself at him just because she was scared?\u003c/p\u003e\n\u003cp\u003e“Well, I am scared,” she said and then winced, wanting to nip in the bud the fact that she was talking out loud to herself far too frequently now.\u003c/p\u003e\n\u003cp\u003eShe threw herself down on her bed and closed her eyes. She didn’t see him; she didn’t feel anything at all, but she knew that Marshall Donegal was there.\u003c/p\u003e\n\u003cp\u003e“You have to go away,” she said. “You were trying to make me look like an idiot in the study, and I was a nervous wreck all through lunch, thinking you’d make me do something stupid. If you’re my ancestor, and you love me so much, will you quit tormenting me?”\u003c/p\u003e\n\u003cp\u003eShe felt a shift of weight. He had taken a seat at the foot of the bed. She opened her eyes at last.\u003c/p\u003e\n\u003cp\u003e“If someone comes at me with a weapon, can you protect me?” she demanded, sitting up to stare at him. “Will that ghostly blade save my life? If not— Where is this going?”\u003c/p\u003e\n\u003cp\u003e“Can I protect you? That depends. I am fairly powerful. Being as I am requires concentration and practice, and I was always a disciplined man.”\u003c/p\u003e\n\u003cp\u003e“Right. So you got into a barroom brawl and died before the war really began,” she said dryly.\u003c/p\u003e\n\u003cp\u003eHe seemed to stiffen. “You’re wrong. I didn’t get into the brawl. Peter O’Reilly got into the brawl. I dragged him out of the place before it turned into something right there, though that might have been a mistake. God knows, if we’d brought troops in, the Yankees would have been killed on the spot or hanged for being spies. But I didn’t want murder committed. Hell, I lost my own life because of it.”\u003c/p\u003e\n\u003cp\u003e“O’Reilly?” Ashley asked. “That would have been Charles Osgood’s great-great-great-great-stepgrandfather, right?”\u003c/p\u003e\n\u003cp\u003eMarshall Donegal nodded, rising and walking to look out on the river. He lifted his hands. “I lose track of the generations…but, yes. He wasn’t a bad fellow, just the kind who was quick to anger and to feel an affront. He was eager to ‘whomp those Yanks!’ He survived the war. I saw him here once, when he came to pay his respects to Emma. He was minus his left leg. It made him a different man. Emma was sorry for him, of course. She offered him work. But he went into New Orleans and became a printer.”\u003c/p\u003e\n\u003cp\u003e“Even so, do you think that someone’s ancestor knew this and thought it was a justice that Charles should die since his ancestor brought about the whole thing? Maybe one of the Yankees!” Ashley suggested.\u003c/p\u003e\n\u003cp\u003e“One who perished?” Marshall asked her.\u003c/p\u003e\n\u003cp\u003e“Possibly. I mean, if the rebels more or less caused it all because of Peter O’Reilly, and four of the Yankees died, maybe it was a sick kind of late-blooming vengeance.”\u003c/p\u003e\n\u003cp\u003e“Even I’m aware—perhaps more so than anyone—that the war is long, long over,” Marshall said. “Other wars have raged since, and will rage in the future,” he added sadly.\u003c/p\u003e\n\u003cp\u003e“Yes, but whoever did this has to be sick. You don’t drug a man, hide him for a day and half and then take him and bayonet him to death and hang his body off a tomb’s angel if there isn’t something really wrong in your psychological makeup,” Ashley said flatly.\u003c/p\u003e\n\u003cp\u003e“Why would someone avenge someone after a hundred and fifty years?” Marshall demanded.\u003c/p\u003e\n\u003cp\u003e“I don’t know, but Cliff is a prime suspect because of his family relation,” Ashley said. She frowned and then gasped. “I can’t believe I forgot. We do have that old plantation story about the master who supposedly slept with a slave. Were you involved?”\u003c/p\u003e\n\u003cp\u003eHe was quiet, and he gave her a curious, sad smile. “Not me, and not any plantation master,” he said quietly.\u003c/p\u003e\n\u003cp\u003e“But you know who?”\u003c/p\u003e\n\u003cp\u003e“Haven’t you ever studied the records?” he asked her.\u003c/p\u003e\n\u003cp\u003e“Of course, but the baby who was Cliff’s great-great-whatever just seemed to appear, and he was raised by Harold Boudreaux and grew up after the war on the property.”\u003c/p\u003e\n\u003cp\u003e“After the war. I was dead, remember?”\u003c/p\u003e\n\u003cp\u003e“Yes, but there’s no exact age on what records we do have,” she reminded him. “The records for the slaves on the property were kept at the chapel, and the bible recording all the births disappeared sometime during the war, so the lists we still have don’t have birth dates on them.”\u003c/p\u003e\n\u003cp\u003e“Cliff’s great-great-great-great—I believe—grand-parent wasn’t a Donegal man.”\u003c/p\u003e\n\u003cp\u003e“Then—who?” she asked.\u003c/p\u003e\n\u003cp\u003e“It was Emma,” he told her quietly.\u003c/p\u003e\n\u003cp\u003eWords and numbers seemed to blur Jake’s vision, but he did feel that he was gaining ground.\u003c/p\u003e\n\u003cp\u003eCliff Boudreaux could not be eliminated. Nor could Ramsay Clayton. John Ashton was easy to eliminate. There were pictures of him in New Orleans on the web the day following, and he had gotten an interview on one of the local channels to talk about the history surrounding the city—and to plug his own business. He had been on an evening show that broadcast at seven, and he had been going to give a tour that night that included the broadcaster. It didn’t take long to verify the fact that he had led the tour, as he had said on air. He hadn’t been at the meeting that had taken place approximately when the Enfield rifle and bayonet had most probably disappeared.\u003c/p\u003e\n\u003cp\u003eIn like fashion, verifying their location at the time the drugged-but-still-living form of Charles Osgood had been taken into the cemetery and murdered, he managed to clear the field of all the Yankees except for Justin Binder. Tom Dixon had attended a party with his wife and children in New York that had gone on ’til midnight, and Victor Quibbly had already been in Austin, Texas, on a business matter.\u003c/p\u003e\n\u003cp\u003eHe looked at his remaining list and his notes. Cliff—no one wanted it to be him. Ramsay—had he set up Charles Osgood? Hank Trebly—why? Sugar interests. Toby Keaton—okay, so he owned Beaumont, the Creole plantation next door, but he was never in competition with the Donegal family…or it didn’t appear that it could be so. Griffin Grant—no amount of searching showed exactly where he had been, other than that he had shown up at his office for the usual workaday world on Monday. He hadn’t even taken the day off, as so many had. Three others to look at would be the sutler, John Martin, Justin Binder, who had stayed in New Orleans at a chain hotel, and Dr. Benjamin Austin, who lived in Francisville and had not had office hours after five on the day that Charles had actually been murdered. \u003c/p\u003e","sourceLink":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2/page-26.html","bookId":2276,"creation":"Oct 5, 2019 5:38:00 PM","modification":"Oct 5, 2019 5:38:00 PM"}
