{"id":89698,"no":27,"title":"Page 27","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe sat back for a minute, closing his eyes. They could be way off. Anything could have happened. But he was pretty sure he was on the money, and he knew that Jackson would agree with him. Eliminating the household—Beth, Ashley and Frazier—left those who were closest to the household. He knew Ashley, and if he hadn’t known her, he’d still know that no one could have acted the terror she had shown when he had come upon her. Frazier couldn’t have pulled if off physically. Beth had no interest in the family; she hadn’t even really understood the history behind what was going on, and she didn’t have the strength to manage the feat, either. He’d pulled up everything he could find on her on the computer anyway; she couldn’t have any determination to avenge a long-ago ancestor. Her family hadn’t been anywhere near the United States during the war. So, using logic, it seemed to be down to Griffin Grant, Cliff Boudreaux, Ramsay Clayton, Hank Trebly, Toby Keaton or, less likely but still possible, Dr. Benjamin Austin or the sutler, John Martin. He put the last two at the end of the list. Concentration first—Ramsay Clayton and Cliff Boudreaux.\u003c/p\u003e\n\u003cp\u003eHow in hell to prove that it wasn’t Cliff?\u003c/p\u003e\n\u003cp\u003eHe looked at the phone on the desk and noted that there was a button to call directly to the stables.\u003c/p\u003e\n\u003cp\u003eCliff answered quickly. “Yes?”\u003c/p\u003e\n\u003cp\u003e“Cliff, I’m going to be honest. I want to eliminate you as a suspect. Would you be willing to let a forensics team go over your apartment and car?”\u003c/p\u003e\n\u003cp\u003eThere was silence, dead silence, on the other end.\u003c/p\u003e\n\u003cp\u003eThen Cliff answered him, his voice tight and hard. “Whatever it takes, whatever it takes. Bring it on, my friend.”\u003c/p\u003e\n\u003cp\u003eAs he hung up, his eyes on the desk phone, Jake felt that someone was watching him.\u003c/p\u003e\n\u003cp\u003eHe looked up, and his breath caught in his throat.\u003c/p\u003e\n\u003cp\u003eIt might have been Ashley—Ashley in her attire for the drama they played out at Donegal Plantation.\u003c/p\u003e\n\u003cp\u003eBut it wasn’t.\u003c/p\u003e\n\u003cp\u003eIt was the woman he had seen in Jackson Square in New Orleans before he had even known that he was going to be coming out to Donegal Plantation.\u003c/p\u003e\n\u003cp\u003eEmma. Emma Donegal. He could see the door through her misty form, but he could also see her face clearly. It wasn’t as if he could really hear her voice, and yet he could; it was inside his head.\u003c/p\u003e\n\u003cp\u003e“Come!” she said urgently. “Please, come.”\u003c/p\u003e\n\u003cp\u003eHe forgot about Detective Mack Colby and the call he had intended to make to get Cliff’s apartment searched. He followed the ghost out of the office and through the house.\u003c/p\u003e\n\u003cp\u003eAnd on out to the stables.\u003c/p\u003e\n\u003cp\u003eCliff was there, sweeping hay from the slab of concrete in front of his door. He looked up at Jake with guarded eyes.\u003c/p\u003e\n\u003cp\u003e“Are you doing the search?” Cliff asked him.\u003c/p\u003e\n\u003cp\u003eJake felt about two feet tall. He had known Cliff for years; he could remember many more occasions with the man than what he had mentioned to Ashley. Cliff had patiently corrected him and taught him about riding, horses, shooting and the plantation itself dozens of times throughout the years. They’d gone out in alligator season together, and Cliff had taught him that even if the creatures were predators, they had their place in life. They had to be hunted to control the population, but they didn’t deserve to be tortured because man had unbalanced nature. A clean kill: a good shot between the eyes. That was the way to kill a gator.\u003c/p\u003e\n\u003cp\u003eHe had taught him other things. Things like balancing his weight with that of the horse he was riding, how to sit a jumper and how to calm a horse when they ran into a bear in the woods. He’d taught him how to hunt fowl, and, in return, Jake had taught Cliff how to hold a cue and shoot a break that could nearly clear the table.\u003c/p\u003e\n\u003cp\u003e“No, Cliff, honestly, it’s because I want you cleared. I don’t want anyone who doesn’t know you the way I do not knowing that they can trust you,” Jake said.\u003c/p\u003e\n\u003cp\u003eCliff studied him and then nodded. He leaned on the broom. “You come out to go after Ashley?” he asked. “You ask me, she shouldn’t be out alone right now.”\u003c/p\u003e\n\u003cp\u003eThe ghost of Emma Donegal had disappeared when he’d reached the stables.\u003c/p\u003e\n\u003cp\u003eBut now he knew why he was here.\u003c/p\u003e\n\u003cp\u003e“Where is Ashley?” he asked.\u003c/p\u003e\n\u003cp\u003e“Just ten minutes ago, she came running down and asking me if there was any problem with taking her mare out for a ride. Said she needed to clear her head, and a ride around the property always did that for her. I was going to let her have a few minutes and then take a ride myself. I just don’t feel right about her being alone.”\u003c/p\u003e\n\u003cp\u003e“Hell, no!” Jake said. “What horse can I take?”\u003c/p\u003e\n\u003cp\u003e“If you head to the bayou, you’ll find a concrete marker. That’s where Emma had Harold Boudreaux buried,” Marshall had told Ashley. “But don’t go now, young woman. Show some sense of self-preservation. There’s someone out there bent on hurting Donegal Plantation, and you are the last of the Donegal family.”\u003c/p\u003e\n\u003cp\u003e“Cliff is a Donegal!” she told him.\u003c/p\u003e\n\u003cp\u003e“No, my dear, not really. Emma wasn’t born a Donegal.”\u003c/p\u003e\n\u003cp\u003e“Yes, and I’m not sure exactly what the relationship is, but Cliff’s great-grandfather and a young woman born a Donegal got together in the 1920s, so, yes, he is a Donegal!” she said.\u003c/p\u003e\n\u003cp\u003e“Well, yes, I suppose you’re right on that.”\u003c/p\u003e\n\u003cp\u003eMarshall Donegal had followed her when she went out to the stables, determined on riding. He kept trying to dissuade her while Cliff kept trying to dissuade her.\u003c/p\u003e\n\u003cp\u003eBefore she’d mounted up on Varina, she’d given Cliff a huge hug. “I love you, cousin!” she told him.\u003c/p\u003e\n\u003cp\u003eCliff had looked at her strangely and then shook his head. “Look, Ashley, you don’t have to defend me. I didn’t murder anyone.”\u003c/p\u003e\n\u003cp\u003eShe’d grinned at him. “I never thought you did. I just wanted to say that I love you!”\u003c/p\u003e\n\u003cp\u003eShe hadn’t bothered with a saddle; she had to find out if there was really a stone near the bayou. If so, she wasn’t imagining the ghost. He was really there, telling her things.\u003c/p\u003e\n\u003cp\u003eOr she was imagining the ghost, and he was really suppressed memories in the back of her mind. Whichever. She wasn’t doing well fighting the concept of imagining Marshall Donegal, so she might as well try to use what was happening. And it didn’t look as if she’d be running to Jake for comfort. She’d be business, strictly business, from now on out.\u003c/p\u003e\n\u003cp\u003eShe thought that she had ridden out alone; she should have known better. Marshall Donegal was riding behind her—on a ghost horse, of course. His mount was a beautiful roan, complete with all his Confederate trappings.\u003c/p\u003e\n\u003cp\u003e“Dammit, woman! Let me lead!” he called to her.\u003c/p\u003e\n\u003cp\u003eShe felt something as he and the roan seemed to pass through her. Then she took off through the woods, following him.\u003c/p\u003e\n\u003cp\u003eThey rode for twenty minutes. Then the ghost horse let out a whinny and stopped, and her haunting ancestor slipped from his mount and walked down the trail to a large pine. He tried to rip away the vines and grass and weeds that grew around the base; Ashley saw that the grass moved, but little else happened.\u003c/p\u003e\n\u003cp\u003eShe began the task herself.\u003c/p\u003e\n\u003cp\u003eShe gasped out loud. It was there, a large, flat, stone marker. One word had been crudely etched into it.\u003c/p\u003e\n\u003cp\u003eFRIEND.\u003c/p\u003e\n\u003cp\u003eAshley sat back on her haunches and looked up. Marshall Donegal leaned against the tree, watching her.\u003c/p\u003e\n\u003cp\u003e“Why? Why did Emma bury him out here? There’s a tomb for the slaves—and then the servants—who stayed on to work the plantation,” Ashley said.\u003c/p\u003e\n\u003cp\u003e“Emma was truly a wonder,” he said sadly. “Any rumors you heard about fights between us—or my indiscretions—were stories created because people need stories. We fell in love, and when that first blush of love was gone, we still loved one another deeply. She was a strong woman. She held the place together after I died—with the help of Harold Boudreaux. In 1864, they became lovers. The world would never have accepted it. Even after the war ended, they would have been in grave danger. There was a pecking order for those of mixed blood in New Orleans, you know that. Quadroons were all the rage to become a man’s mistress, and the Quadroon balls were infamous. But after the war, the KKK was started up, and if they had been discovered, Harold most probably would have been burned on a cross, and Emma would have been subject to rape and ridicule. They had to keep their affair entirely secret. So he raised their child as one of his own. Another of the former slaves—a young woman of mixed blood herself—was accepted as the child’s mother.”\u003c/p\u003e\n\u003cp\u003e“Did you mind? Did you hate what happened?” Ashley asked him. “I mean, as a ghost, were you bitter or…can you still hurt?”\u003c/p\u003e\n\u003cp\u003e“My soul can know agony,” he said quietly. “But did I mind this? No. I loved Emma with my whole heart. And a dead man knows that the color of his skin doesn’t mean a damned thing. I admired Harold. I loved what he did for my family, and how he taught and defended my children. No, I didn’t mind. Not this. I just thought you should know. Maybe it can help you in some way.”\u003c/p\u003e\n\u003cp\u003eThey both started at a sound that seemed to come from the woods that led straight to the bayou. Ashley quickly stood up. “Probably a raccoon or even a squirrel,” she said and grimaced. “Maybe even a gator.” She walked toward her mare.\u003c/p\u003e\n\u003cp\u003eIt wasn’t a raccoon, squirrel or gator. As she mounted, she heard the noise from the woods by the bayou again.\u003c/p\u003e\n\u003cp\u003e“Quickly,” Marshall said. “I’ll hold the path!”\u003c/p\u003e\n\u003cp\u003e“But it may be nothing.”\u003c/p\u003e\n\u003cp\u003e“You’re alone out here. Get back to the house! Please!”\u003c/p\u003e\n\u003cp\u003eShe almost laughed and reminded her ghost protector that he was dead.\u003c/p\u003e\n\u003cp\u003eBut she didn’t. She turned to ride, finding the quickest path back to the house and kneeing her mare to a gait that would lead it at all speed through the trails without killing them both.\u003c/p\u003e\n\u003cp\u003eBut as she made her way homeward, something darted into the path in front of her.\u003c/p\u003e\n\u003cp\u003eVarina reared, and she wasn’t as prepared as she should have been. She cursed herself for her carelessness as she felt herself fly into the air.\u003c/p\u003e\n\u003cp\u003eAnd land hard on her rump in the middle of the dirt path.\u003c/p\u003e\n\u003cp\u003eAs she quickly stood, rubbing her injured section, she realized that it had grown late. \u003c/p\u003e","sourceLink":"https://allnovel.net/heart-of-evil-krewe-of-hunters-2/page-27.html","bookId":2276,"creation":"Oct 5, 2019 5:38:00 PM","modification":"Oct 5, 2019 5:38:00 PM"}
