{"id":82840,"no":13,"title":"Page 13","content":"\u003cp\u003eFour months later...\u003c/p\u003e\n\u003cp\u003eRyan sat at the desk in his office when the door opened. Glancing up he saw Mark Charlesworth holding a large vase with a bouquet of flowers wrapped in pale pink cellophane.\u003c/p\u003e\n\u003cp\u003e\"These came for you, Doc.\"\u003c/p\u003e\n\u003cp\u003eRising to his feet, Ryan smiled. \"Who sent them?\"\u003c/p\u003e\n\u003cp\u003e\"Me.\" Kelly moved into the doorway, grinning at her husband.\u003c/p\u003e\n\u003cp\u003eMark placed the flowers on a table and winked at Kelly as he walked out of the vet\u0027s office. Miss Kelly had asked him to carry the vase to Dr. Blackstone, because she did not want to lift anything that was too heavy. The glow in her eyes and her mysterious smile meant that the resident veterinarian was going to receive wonderful news.\u003c/p\u003e\n\u003cp\u003eMark had received a bouquet of flowers from Miss Kelly once he received his test results from his college entrance exam. He had received a combined score of thirteen hundred sixty on the SAT. He was going to college! He would miss Blackstone Farms, but knew he would come back one day - as a veterinarian.\u003c/p\u003e\n\u003cp\u003eKelly watched Ryan watching her. \"Congratulations, Dr. Blackstone.\"\u003c/p\u003e\n\u003cp\u003eHe moved closer, his gaze fixed on her moist lips. \"For what, Mrs. Blackstone.\"\u003c/p\u003e\n\u003cp\u003eReaching for his left hand, she placed it over her flat belly. \"For this.\"\u003c/p\u003e\n\u003cp\u003eHis gaze widened until she saw their black depths. \"Are you sure?\"\u003c/p\u003e\n\u003cp\u003eHer lids lowered. \"As sure as I am that I\u0027ll love you forever.\"\u003c/p\u003e\n\u003cp\u003eGathering Kelly to his chest, he picked her up and swung her around and around until she pleaded with him to stop.\u003c/p\u003e\n\u003cp\u003eThrowing back his head, he shouted, \"Boo-yaw!\"\u003c/p\u003e\n\u003cp\u003eCaught up in his infectious joy, Kelly whispered close to his ear, \"Boo-yaw to you, too.\"\u003c/p\u003e\n\u003cp\u003e\"Now I know you can do better than that with the Blackstone cheer.\"\u003c/p\u003e\n\u003cp\u003eRising her chin, she closed her eyes and shouted \"Boo-yaw!\"\u003c/p\u003e\n\u003cp\u003eRyan lowered his head and kissed her long and deep. They were still locked in a passionate embrace when some of the stable hands came to see what the shouting was all about.\u003c/p\u003e\n\u003cp\u003eThree men crowded in the doorway to find their boss cradling his wife to his chest. Their gazes shifted to the flowers and they backed away, smiling.\u003c/p\u003e\n\u003cp\u003e\"Something tells me that we\u0027re going to have another celebration soon,\" one said quietly.\u003c/p\u003e\n\u003cp\u003eAnd Blackstone Farms had a lot to celebrate. Their jockeys had stood within the chalk markings of the winner\u0027s circle in the last five of the six races they had run.\u003c/p\u003e\n\u003cp\u003eBut the best celebration was still to come - with the birth of another Blackstone come summer. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-long-hot-summer-the-blackstones-of-virgina-1/page-13.html","bookId":1873,"creation":"Oct 5, 2019 4:47:48 PM","modification":"Oct 5, 2019 4:47:48 PM"}
