{"id":82834,"no":7,"title":"Page 7","content":"\u003cp\u003eSean sat on the padded bench at the foot of his father\u0027s bed, watching Ryan loop the length of a dark brown tie into a knot under the collar of a white shirt. \"Do I have to sleep at Grandpa\u0027s tonight?\"\u003c/p\u003e\n\u003cp\u003eRyan caught his son\u0027s reflection in the mirror over a triple dresser. He tightened the tie, then turned to stare at Sean. \"Yes, Sean.\"\u003c/p\u003e\n\u003cp\u003eThe young boy stuck out his lower lip. \"But, Daddy,\" he wailed.\u003c/p\u003e\n\u003cp\u003e\"No whining, Sean. What is it you want?\"\u003c/p\u003e\n\u003cp\u003e\"I want to sleep over with Travis and Trent. They are having a Spider-Man party tonight.\"\u003c/p\u003e\n\u003cp\u003e\"They may be having a party, but were you invited?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Daddy. They invited everybody from school. Even Miss Kelly.\"\u003c/p\u003e\n\u003cp\u003eRyan studied his son\u0027s deeply tanned face and smiled. Sean had talked nonstop about what he did with Miss Kelly and the other kids at school during the time Ryan was in Richmond. He said he could read a lot of words, could count up to one hundred and match shapes and colors.\u003c/p\u003e\n\u003cp\u003e\"Go get your sleeping bag while I call Miss Millie.\"\u003c/p\u003e\n\u003cp\u003eSean jumped off the bench and raced out of the bedroom. Ryan picked up the telephone and dialed the number to the twins\u0027 house. Millicent Smith answered the call after the first ring.\u003c/p\u003e\n\u003cp\u003e\"Hi, Millie. This is Ryan. I\u0027m calling about the Spider-Man sleep over at your place tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Doc, I really need to have my head examined for agreeing to this,\" Millie drawled.\u003c/p\u003e\n\u003cp\u003eHe smiled. \"So, it\u0027s on?\"\u003c/p\u003e\n\u003cp\u003e\"Yeah. Drop Sean off at the dining hall and we\u0027ll bring him back with us.\"\u003c/p\u003e\n\u003cp\u003e\"What time do you want me to pick him up in the morning?\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t bother to pick him up. The kids don\u0027t have school tomorrow, and if the hot weather holds we\u0027ll probably hang out at the pool most of the day.\"\u003c/p\u003e\n\u003cp\u003e\"You know if he gets to be too much for you just bring him back to Sheldon.\"\u003c/p\u003e\n\u003cp\u003e\"Dr. Blackstone, you have the most well-behaved child on the farm. If my boys were half as good as Sean I\u0027d consider myself blessed.\"\u003c/p\u003e\n\u003cp\u003eRyan wanted to tell Millie that she was blessed. She had two bright, healthy sons. A parent couldn\u0027t ask for more than that. \"They\u0027re boys, Millie.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what Jim says. Thanks for letting Sean come.\"\u003c/p\u003e\n\u003cp\u003e\"No problem, Millie.\"\u003c/p\u003e\n\u003cp\u003e\"Bye, Doc.\"\u003c/p\u003e\n\u003cp\u003eRyan rang off, then picked up the jacket to his suit, slipping his arms into the sleeves. He walked out of his bedroom and into Sean\u0027s across the hall. The boy was busy putting out changes of clothes on his bed. He watched as Sean took out socks, briefs, T-shirts and shorts.\u003c/p\u003e\n\u003cp\u003eSean glanced up at his father. \"Is that enough?\"\u003c/p\u003e\n\u003cp\u003eNodding, Ryan smiled. \"Yes.\"\u003c/p\u003e\n\u003cp\u003eSean picked up a backpack and put the clothes inside. After zipping the colorful bag, he hoisted it over one shoulder, then picked up a small duffel bag containing his sleeping bag.\u003c/p\u003e\n\u003cp\u003e\"Are you ready, Champ?\"\u003c/p\u003e\n\u003cp\u003eThe little boy puffed out his narrow chest. \"Yes, Daddy.\"\u003c/p\u003e\n\u003cp\u003eRyan had taught Sean independence early. He had learned to select the clothes he would wear for the next day, laying them out the night before. He had to keep his room clean by picking up his toys and books. He knew he had to brush his teeth twice a day, wash his hands before and after meals, and say his prayers before he went to sleep.\u003c/p\u003e\n\u003cp\u003eRyan cupped the back of his son\u0027s head, leading him down the staircase and out of the house. \"I\u0027m going to drop you off at Grandpa\u0027s.\"\u003c/p\u003e\n\u003cp\u003eSean looked up at Ryan. \"You\u0027re not going to eat with us?\"\u003c/p\u003e\n\u003cp\u003e\"No, Sean. I\u0027m going out to eat.\"\u003c/p\u003e\n\u003cp\u003e\"Who you eating with, Daddy?\"\u003c/p\u003e\n\u003cp\u003e\"Miss Kelly.\" He\u0027d never lied to his son, and he did not want to begin now.\u003c/p\u003e\n\u003cp\u003e\"She\u0027s pretty, Daddy. She\u0027s pretty like a princess.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re right about that, son.\"\u003c/p\u003e\n\u003cp\u003e\"You like her, Daddy?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Sean, I like her.\"\u003c/p\u003e\n\u003cp\u003e\"I like her, too. Isn\u0027t it good we both like her?\"\u003c/p\u003e\n\u003cp\u003e\"Yes it is.\"\u003c/p\u003e\n\u003cp\u003eRyan wanted to tell Sean that what he felt for Kelly went beyond a simple liking. What he wanted was to see her - every day. He wanted to hold her close and feel her feminine heat, inhale her feminine fragrance. He wanted that and so much more.\u003c/p\u003e\n\u003cp\u003eHe led Sean up the steps of the porch to the house where he\u0027d grown up. The inner door stood open, as it did every day until Sheldon closed it to retire for the night. He held the screen door open for Sean.\u003c/p\u003e\n\u003cp\u003e\"Grandpa!\" Sean\u0027s strident voice echoed in the large living room.\u003c/p\u003e\n\u003cp\u003eSheldon came from the direction of his study. It once had been called the family room. A network of lines fanned out around his eyes. He saw Sean\u0027s backpack and sleeping bag.\u003c/p\u003e\n\u003cp\u003e\"Where are you going tonight?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going to eat with you, then I\u0027m sleeping over with Travis and Trent. We are going to have a Spider-Man party.\"\u003c/p\u003e\n\u003cp\u003eSheldon\u0027s head came up and he stared at Ryan, who nodded. \"Good for you.\"\u003c/p\u003e\n\u003cp\u003eSean turned and stared at his father. \"But Daddy\u0027s eating with Miss Kelly.\"\u003c/p\u003e\n\u003cp\u003eSheldon angled his head, grinning. \"Boo-yaw!\"\u003c/p\u003e\n\u003cp\u003e\"Boo-yaw to you, too,\" Ryan mumbled, while trying not to laugh. \"I\u0027ll see you guys tomorrow.\"\u003c/p\u003e\n\u003cp\u003e\"Have fun,\" Sheldon called out.\u003c/p\u003e\n\u003cp\u003e\"Yeah, Daddy. Have fun with Miss Kelly.\"\u003c/p\u003e\n\u003cp\u003eRyan walked out his father\u0027s house head high, and his step lighter than it had been in years. And it had been years since he really looked forward to sharing time with a woman, especially one as sexy as Kelly Andrews.\u003c/p\u003e\n\u003cp\u003eThe week had passed quickly for Kelly and her students. They\u0027d frolicked and splashed in the in-ground kiddie pool before they were served a picnic lunch under a large tent. Everyone napped, then swam again. When the parents came to pick up their sons and daughters later that afternoon all remarked how tanned and healthy they looked.\u003c/p\u003e\n\u003cp\u003eOn Thursday Heather brought a kitten to school to show off her new pet. Miss Buttons had caused a stir when she jumped on the table to press her tiny nose against the fish tank. Kelly had to issue her first mandate: no pets in school.\u003c/p\u003e\n\u003cp\u003eIt was now late Friday afternoon and she lay in the bathtub, eyes closed, and her hair wrapped in a silk scarf. A soft sponge pillow cradled her head. She had just completed her first full week teaching, and had almost forgotten how much energy it took to keep up with preschoolers. The only time they were still and quiet was at naptime.\u003c/p\u003e\n\u003cp\u003eThe doorbell rang and she jumped, opening her eyes. \"He can\u0027t be here!\" she gasped. Ryan had called her earlier that afternoon to inform her he would come by to pick her up at six. Rising quickly, she stepped out of the tub, splashing water onto the tiled floor. She reached for a bath sheet, wrapped it around her wet body, and walked out of the bathroom.\u003c/p\u003e\n\u003cp\u003eShe hadn\u0027t taken half a dozen steps when she saw him. Kelly sucked in her breath. Ryan stood in the middle of her parlor, dressed in an ecru-colored suit that made him look like a GQ cover model. His black hair was neatly brushed off his forehead and his deeply tanned gold-brown skin radiated good health. But it was his eyes - a smoky-gray that pulled her in and refused to let her go.\u003c/p\u003e\n\u003cp\u003e\"Did you know that you left your door open?\"\u003c/p\u003e\n\u003cp\u003eHer eyelids fluttered as she shook her head. She couldn\u0027t remember whether she had closed or locked the door. \"I must be slipping. That never would\u0027ve happened back in New York. By the way, what are you doing here so early?\" Her voice had dropped to a whisper.\u003c/p\u003e\n\u003cp\u003e\"I told you I\u0027d be here at six.\"\u003c/p\u003e\n\u003cp\u003e\"But...but it\u0027s not six.\"\u003c/p\u003e\n\u003cp\u003eExtending his left arm, the face on his timepiece showed beneath the starched cuff of his stark-white shirt. The hands indicated that it was exactly six o\u0027clock.\u003c/p\u003e\n\u003cp\u003eClutching the towel over her breasts, Kelly wrinkled her nose. \"I\u0027m sorry, Ryan. I must have lost track of time.\" She backpedaled, unable to believe she had fallen asleep in the bathtub. \"Please excuse me while I put some clothes on.\"\u003c/p\u003e\n\u003cp\u003eA mysterious smiled curved Ryan\u0027s mouth. \"Please...don\u0027t,\" he said in a quiet voice. \"I happen to like what you\u0027re wearing.\"\u003c/p\u003e\n\u003cp\u003eKelly stared at him. \"I\u0027m not wearing anything.\"\u003c/p\u003e\n\u003cp\u003eHis eyes widened until she saw their sooty centers. \"Exactly.\"\u003c/p\u003e\n\u003cp\u003eHer heart pounded an erratic rhythm as she turned on her heel and rushed into her bedroom, slamming the door behind her. The clothes she had selected to wear lay across the bed.\u003c/p\u003e\n\u003cp\u003eTrying not to think of the man waiting in her parlor, she patted her body dry, moisturized her skin with a perfumed cream, dotted a matching scent at her pulse points, then slipped into her underwear and dress. It took another fifteen minutes to apply a powdered bronzer to the face, feather her eyebrows, apply a coat of mascara to her lashes and outline her mouth with a shimmering red lipstick.\u003c/p\u003e\n\u003cp\u003eShe removed the scarf and pins holding her hairdo. Lowering her head, she brushed her hair forward off the nape of her neck and flipped it back until it settled into layered precision around her face and neck. Taking one last glance at her reflection in the mirror on the door inside the armoire, she slipped into her heels and picked up her evening purse. She walked into the parlor to find Ryan standing where she had left him.\u003c/p\u003e\n\u003cp\u003eIt had taken only three days away from Kelly - only seventy-two hours for Ryan to realize how much he\u0027d missed her. He knew nothing about her other than what he saw, but that was enough for him want her with an emotion that bordered on craving.\u003c/p\u003e\n\u003cp\u003eThere was so much he wanted to share with her, yet he knew it was too soon in their relationship to make his desires known. He wasn\u0027t a boy, hadn\u0027t been one in twenty years, yet his need to share her bed exceeded any he had ever known in his life.\u003c/p\u003e\n\u003cp\u003eHe watched her move closer, unable to take his gaze off her face and slender body that was showcased in a slim black tank dress. He measured each step she took in a pair of black, three-inch, sling strap sandals.\u003c/p\u003e\n\u003cp\u003eMoving closer, he placed his hand on her bared back. Peering over her shoulder he went suddenly still. He wasn\u0027t certain whether the back of the dress - what there was of it, began or ended just inches below the small of her back.\u003c/p\u003e\n\u003cp\u003eHe grimaced at the same time he gritted his teeth. \"Aren\u0027t you going to need a shawl or something for your shoulders?\"\u003c/p\u003e\n\u003cp\u003eA smile trembled over her lips. \"Nope.\u003c/p\u003e\n\u003cp\u003e\"It might get cold.\"\u003c/p\u003e\n\u003cp\u003eShe cut her eyes at him. \"The temperature hit ninety today.\" Curving an arm through his, she smiled sweetly at him. \"I\u0027m sorry I made us late. Let\u0027s go.\"\u003c/p\u003e\n\u003cp\u003e\"If any man looks sideways at you he\u0027s going to get a serious beat-down,\" Ryan mumbled under his breath.\u003c/p\u003e\n\u003cp\u003eKelly frowned at him. \"What did you say about a beat-down?\"\u003c/p\u003e\n\u003cp\u003e\"Nothing,\" he mumbled again, leading her to the door. Taking her keys from her hand, he closed and locked the door. He slipped the keys into the pocket of his trousers.\u003c/p\u003e\n\u003cp\u003eRyan caught a glimpse of Kelly\u0027s bared back, admiring the silkiness of her dark brown skin. A lighter band of color showed beneath the narrow straps on her velvety shoulders. He smiled. It was obvious she had gone swimming with her students.\u003c/p\u003e\n\u003cp\u003eHe opened the door to a low-slung two-seater black convertible sports car, waiting until Kelly was seated and belted in before he removed his jacket and placed it on the narrow space behind the seats. He sat down, put the key in the ignition, and the engine purred to life. Pressing a button he raised the top, adjusted the flow of cooling air coming through the vents, and pulled away from Kelly\u0027s home with a burst of speed.\u003c/p\u003e\n\u003cp\u003eResting her head against the leather headrest, Kelly closed her eyes, enjoying the surge of power propelling the car forward. \"Where are we going?\"\u003c/p\u003e\n\u003cp\u003e\"To an inn in West Virginia.\"\u003c/p\u003e\n\u003cp\u003eShe opened her eyes and stared at Ryan\u0027s profile. \"West Virginia?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s not that far. It\u0027s a quaint little place in the mountains.\"\u003c/p\u003e\n\u003cp\u003e\"Mountains as in Appalachian?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, ma\u0027am.\"\u003c/p\u003e\n\u003cp\u003eThose were the last two words they exchanged until more than an hour later Ryan maneuvered into a parking lot of a hotel and restaurant that had been built into the side of a mountain.\u003c/p\u003e\n\u003cp\u003eA valet opened the driver side door for Ryan, handing him a ticket while Ryan reached for his jacket, putting it on as he came around to assist Kelly. His right arm curved around her waist and he led her to the entrance of the restaurant.\u003c/p\u003e\n\u003cp\u003eKelly felt as if she had stepped back into the nineteenth century when she surveyed the Victorian furnishings. The maitred\u0027 directed them to a table in a corner where a quartet of large painted urns provided a modicum of privacy.\u003c/p\u003e\n\u003cp\u003eRyan ignored the menu and wine listing on the table; he stared at Kelly\u0027s face in the golden glow of flickering candlelight. The nostrils of his aquiline nose flared slightly. \"Did I tell you how beautiful you look tonight?\" Her lids lowered, the demure gesture enchanting him.\u003c/p\u003e\n\u003cp\u003e\"No.\" She glanced up, meeting his heated gaze. \"But you could\u0027ve told me that back at the house.\"\u003c/p\u003e\n\u003cp\u003e\"No, I couldn\u0027t, Kelly.\"\u003c/p\u003e\n\u003cp\u003e\"Why not?\"\u003c/p\u003e\n\u003cp\u003e\"Because I don\u0027t think we would\u0027ve left the house.\"\u003c/p\u003e\n\u003cp\u003eUnconsciously her brow furrowed. \"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"I would\u0027ve asked if you would let me make love to you.\"\u003c/p\u003e\n\u003cp\u003eShe gasped softly. \"Is that what you want to do, Ryan? Make love to me?\"\u003c/p\u003e\n\u003cp\u003eReaching across the table, he captured her hands. \"Yes.\"\u003c/p\u003e\n\u003cp\u003eKelly felt her stomach muscles contract. There was so much passion in the single word that she found it hard to swallow. Her breasts rose and fell heavily, bringing his gaze to linger there.\u003c/p\u003e\n\u003cp\u003eCould she tell him? Did she dare reveal what lay in her heart? That she also wanted him. Had wanted him the first time he\u0027d held her in his arms after she had fallen off the stepladder.\u003c/p\u003e\n\u003cp\u003e\"I do, too,\" she admitted in a voice so soft Ryan found it difficult to believe what he was hearing. \"However, there is a part of me that says becoming physically involved with you will change me, change everything.\"\u003c/p\u003e\n\u003cp\u003eHe tightened his grip on her fingers. \"How, Kelly?\"\u003c/p\u003e\n\u003cp\u003e\"I...I don\u0027t want to forget Simeon. And I know once I sleep with you he will no longer exist for me.\"\u003c/p\u003e\n\u003cp\u003e\"Simeon is your late husband?\" She nodded. \"Do you still love him?\"\u003c/p\u003e\n\u003cp\u003eShe smiled a sad smile. \"I\u0027ll always love him.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing wrong in loving him. But he\u0027s gone. And if he loved you as much as you loved him, then I believe he would want you to be happy.\"\u003c/p\u003e\n\u003cp\u003eMoisture shimmered in her eyes. \"Do you think you can you make me happy, Ryan?\"\u003c/p\u003e\n\u003cp\u003eHe made love to her with his eyes. \"Only you can make that possible.\"\u003c/p\u003e\n\u003cp\u003eKelly shook her head. \"I don\u0027t understand.\"\u003c/p\u003e\n\u003cp\u003e\"Not only do you have to love with your head, but also with your heart. Loving has to be both, not one or the other.\"\u003c/p\u003e\n\u003cp\u003eShe sniffled, and Ryan reached into a pocket and produced a snow-white handkerchief. Moving his chair closer to hers, he held her chin and dabbed her eyes. Resting his forehead against hers, he kissed the end of her nose.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not the only one hurting, princess. I\u0027ve been there, too. I fell in love with a girl I\u0027d met in college. After graduating we went our separate ways, then one day out of the blue she called me. I invited her to the farm and she was caught up in the prerace excitement and parties. Blackstone Farms had entered a horse in the Virginia Gold Cup. Miss Fancy Pants was a twenty-to-one long shot, but we still had a lot of faith in her because she had heart. Our horse won, and that night Pop threw a party to end all parties. Caroline and I celebrated in our own special way, and the next day we announced our engagement.\u003c/p\u003e\n\u003cp\u003e\"We had a September wedding, and by December she discovered she was pregnant. That\u0027s when everything changed. She became depressed and talked about aborting the baby.\" Ryan ignored Kelly\u0027s audible inhalation. \"I was forced to watch her around the clock because I thought she was going to...\" His words trailed off.\u003c/p\u003e\n\u003cp\u003e\"Take her own life,\" Kelly said softly, completing his statement.\u003c/p\u003e\n\u003cp\u003eHe nodded. \"She said she hated me and hated living on the farm. She cried that she was being smothered to death and wanted to go back to Los Angeles. Caroline carried to term, but when she went into labor she made me promise to either give her a divorce or she would kill herself. I know I probably could\u0027ve had her committed, but I agreed on one condition. She could leave, but she could not take my son. I refused to jeopardize his life with a woman who had proven herself to be emotionally unstable.\u003c/p\u003e\n\u003cp\u003e\"I had my lawyer draw up the agreement before she left the hospital. Sean was two months old when she got into her car and drove away. I loved her, Kelly. Loved her enough to let her go so that she could find her happiness.\"\u003c/p\u003e\n\u003cp\u003eKelly laid her head on Ryan\u0027s shoulder. \"You\u0027ve had your share of pain.\"\u003c/p\u003e\n\u003cp\u003eCurving an arm around her bare shoulder, he pulled her closer. \"That\u0027s true, but I\u0027ve learned not to wallow in it. There comes a time for healing.\"\u003c/p\u003e\n\u003cp\u003eKelly knew he was talking about her. She had been wallowing in her pain for two years, accepting it as readily as breathing and sleeping.\u003c/p\u003e\n\u003cp\u003e\"You want me, Ryan, knowing I\u0027m still carrying baggage? Knowing that I\u0027m not ready to offer you what you feel you deserve from a woman?\" She sucked in her breath. \"I haven\u0027t slept with a man in two years, and what I miss most is the intimacy.\" There was a sob in her voice. \"Are you willing to accept me giving you my body without offering my heart?\"\u003c/p\u003e\n\u003cp\u003eRyan eased back, his gaze meeting her tortured one. He did want her, more than any other woman in his past. \"You fascinate me, Kelly,\" he confessed. \"I don\u0027t know whether it is your beauty, spunk or your intelligence. And I have no right to demand or expect you to offer me anything. What I will accept is anything you\u0027re willing to give me.\"\u003c/p\u003e\n\u003cp\u003eHer lids slipped down over her eyes as her lips parted. Ryan angled his head and slanted a kiss on her mouth, silently acknowledging the terms of their agreement. The kiss ended and they exchanged a knowing smile.\u003c/p\u003e\n\u003cp\u003eRyan blew out his breath. \"I don\u0027t know about you, but I could use a drink right about now.\"\u003c/p\u003e\n\u003cp\u003eClosing her eyes, Kelly sighed softly. \"I could use one, too.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-long-hot-summer-the-blackstones-of-virgina-1/page-7.html","bookId":1873,"creation":"Oct 5, 2019 4:47:48 PM","modification":"Oct 5, 2019 4:47:48 PM"}
