{"id":97070,"no":26,"title":"Page 26","content":"\u003cp\u003e26\u003c/p\u003e\n\u003cp\u003eRODRIGO WASN\u0027T A SLOB. The lobby was clean, not a scrap of paper on the desk or in it.\u003c/p\u003e\n\u003cp\u003eNevertheless, the hotel had the air of a haunted place, having been robbed of its vitality and purpose.\u003c/p\u003e\n\u003cp\u003eMammoth kitchen, machines grinding away, countertops clean except for fresh trays littered with fancy china, remnants of lobsters, glasses of milk, fish bones, etc.\u003c/p\u003e\n\u003cp\u003eNo human presence.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you see what that means?\" Oberon said, staring at the plates. \"That\u0027s Taltos food, all white. They very well might be up there.\" He was sloughing off his languor, growing even slightly excited.\u003c/p\u003e\n\u003cp\u003eI checked out the storage room, cases of powdered milk, some split open, powder on the floor, footprints, cans of condensed milk, empties in a pile.\u003c/p\u003e\n\u003cp\u003e\"And explain that to me?\" I asked.\u003c/p\u003e\n\u003cp\u003eHe stared at it, shook his head. \"I can\u0027t,\" he said. \"Unless one of them comes down here in the night and guzzles. It\u0027s a possibility. You starve a Taltos for milk, and it will go after it. But let\u0027s get upstairs, my sisters are here! I know it.\"\u003c/p\u003e\n\u003cp\u003e\"Hold on,\" said Mona, her eyes rimmed in red, her voice still quavering. \"This doesn\u0027t prove a thing.\"\u003c/p\u003e\n\u003cp\u003eThe big central stairway led to the mezzanine floor and into the spacious rooms of what had once been the library. Litter of laptops, bigger computer stations, walls of books, maps, world globes, televisions, huge windows open to the sea. Dust everywhere, or was it sand? The music from above was extremely loud. The place looked uninhabited and untouched.\u003c/p\u003e\n\u003cp\u003e\"This was Heaven here,\" said Oberon, \"you can\u0027t imagine the hours of pleasure I spent in these rooms.\u003c/p\u003e\n\u003cp\u003eSaints Preserve Us, I detest that music. Maybe we should hit the breaker box to shut that off.\"\u003c/p\u003e\n\u003cp\u003e\"Bad idea,\" said Quinn.\u003c/p\u003e\n\u003cp\u003eOberon held his gun with both hands, and he had dropped his disdainful demeanor altogether. He was almost what one would call enthusiastic. But the music was attacking him like a horde of mosquitoes. He shuddered over and over again.\u003c/p\u003e\n\u003cp\u003e\"First thing I\u0027m going to shoot is that speaker system,\" he said.\u003c/p\u003e\n\u003cp\u003eAgain we took the carpeted stairs. Scanning for humans. I caught the scent of one.\u003c/p\u003e\n\u003cp\u003eThe suite was dead center and wide open to the broad iron-railed porch that looked down on the lobby, the emperor himself seated in a huge gold satin-sheeted bed to the right, bleached wood headboard carved with mermaids, talking rapidly into a phone, costume sleek leather pants, purple satin shirt open to reveal a chest of oiled muscles, lustrous short black hair brushed back from a polished brown face with extraordinarily pretty eyes.\u003c/p\u003e\n\u003cp\u003eThick beige carpet, scattered chairs, lamps. Doors open to other rooms.\u003c/p\u003e\n\u003cp\u003eHe clicked off the phone as soon as we entered.\u003c/p\u003e\n\u003cp\u003e\"Oberon, my son, I wasn\u0027t expecting you,\" he said, musical voice barely accented with Spanish, drawing up one knee, eyes moving over the rest of us as he smiled cordially, toenails manicured and buffed to a shine. Extremely amiable manner. \"And who have we here? It must be party time. But let\u0027s introduce ourselves first, shall we?\"\u003c/p\u003e\n\u003cp\u003eHe lifted a small black gadget and the inundation of purring dance music came to an end. The sound of the breeze was born again, sweeping through the great empty wall that fronted on the Caribbean.\u003c/p\u003e\n\u003cp\u003e\"Oh, Rodrigo, I am ever so grateful to you for that,\" sighed Oberon. \"I was looking everywhere for the source of that infernally simpering music.\"\u003c/p\u003e\n\u003cp\u003e\"So that\u0027s why we\u0027re waving that gun around,\" said Rodrigo agreeably. \"And where\u0027s my Mamma, didn\u0027t you bring her up with you? I can\u0027t raise anybody on this island. I\u0027m humiliated. Please, my guests! Be seated! The bar is there-everything you could wish. Miravelle!\" he shouted suddenly. \"I have guests here! Where exactly did you come from? It\u0027s once in a blue moon a boat ties up at my dock. But you\u0027re most welcome. We are very private here, you understand, I can\u0027t invite you to stay-\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t you worry at all about that,\" I said, \"we\u0027ll soon be on our way. Just wanted to connect with Miravelle and Lorkyn.\"\u003c/p\u003e\n\u003cp\u003e\"Is that so?\" he asked skeptically. \"Miravelle!\" he called out again in a short Latin bark.\u003c/p\u003e\n\u003cp\u003eThis time with results.\u003c/p\u003e\n\u003cp\u003eShe entered from the left, the genuine article without doubt, maybe six and a half feet tall, yellow hair, oval face, baby flesh like Oberon, simple black linen sleeveless dress, sandals, round blue eyes, and when she saw Oberon she screamed and ran into his arms. He had only time to shove the gun in his belt before he enfolded her.\u003c/p\u003e\n\u003cp\u003eHe lost all reserve embracing her and running his lips all over her. He pushed her hair back and broke into sobs suddenly as he kissed her.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s it, get back!\" declared Rodrigo from the bed. He clapped his hands imperiously. \"You hear me, both of you, I said get back! Oberon, did you hear what I said?\"\u003c/p\u003e\n\u003cp\u003eBut the two had fallen to kissing and speaking what seemed an alien language in high-pitched whistling words that none of us could understand, astonishing Quinn, though Mona seemed not one bit surprised by it. It was a spectacle.\u003c/p\u003e\n\u003cp\u003eRodrigo was off the bed in an instant. He had the cell phone unfolded and was barking orders in Spanish. Then shaking the phone.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re all dead,\" I said. \"I killed them all.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\" he said, the graciousness gone, his face the picture of rage. He drew his gun out of his belt and leveled it at me. \"You\u0027re being rude to me in my own room,\" he said, \"which I won\u0027t tolerate.\"\u003c/p\u003e\n\u003cp\u003eI sent the power to push the gun out of his hand and far to the right wall. It hit the sheetrock and fell to the floor. His eyes grew large, but he wasn\u0027t humbled by this display of strength. He glared at me, trying to make sense of what he\u0027d just seen, then scoping Mona and Quinn.\u003c/p\u003e\n\u003cp\u003eMeanwhile the two Taltos had settled down somewhat and were watching him. Mona came up beside them. Quinn was beside me.\u003c/p\u003e\n\u003cp\u003eI scanned the hotel. There was another being walking on the floor above, but I didn\u0027t know whether it was Taltos or human.\u003c/p\u003e\n\u003cp\u003e\"All right, what do you want from me?\" Rodrigo said. \"You want money, what? You killed all my men, you did that? For what reason? You want this island, it doesn\u0027t belong to me, take it. I was leaving tonight anyway. I don\u0027t care what you do. Miravelle, get away from him!\"\u003c/p\u003e\n\u003cp\u003eHe was suddenly distracted by a roar and a particular sound which I knew and couldn\u0027t place until he named it:\u003c/p\u003e\n\u003cp\u003e\"The copter! They\u0027re taking off without me!\" He ran to the open balcony. \"Stop them, damn them.\" He want into a Spanish aria of denunciations and execrations.\u003c/p\u003e\n\u003cp\u003eI sent the scan. Two human beings. Male. What good was it to us or the future of this place to have them escape? I held tight to the iron railing of the balcony and I sent the Fire.\u003c/p\u003e\n\u003cp\u003eI didn\u0027t know if the power was viable over such a distance, but no one would know if I failed. My body was rigid with the attempt, the knot inside me burning with all the energy I could feed it, and suddenly the Fire hit the copter with a force that knocked it to one side. I gave every particle of consciousness in me to the heat. The Fire. The copter went up in flames. Then it exploded.\u003c/p\u003e\n\u003cp\u003eIt was plenty far away from us, but everyone in the room cringed from the blast. It lit up the island.\u003c/p\u003e\n\u003cp\u003eRodrigo was speechless.\u003c/p\u003e\n\u003cp\u003eI hung on to the rail, dizzy, sweating all over, and then I backed away, glaring at the spectacle of the huge machine coming down lopsided to the runway. It was slowly incinerated. I was sickened again, to think that I could do that, to think that I had done it. And the feeling of emptiness, of meaninglessness took hold of me. I believed in nothing. I was good for nothing. I ought to die. All that seemed fixed in my mind. I couldn\u0027t move or speak.\u003c/p\u003e\n\u003cp\u003eQuinn took over; I could hear his crisp voice right beside me.\u003c/p\u003e\n\u003cp\u003e\"Well, old man,\" he said to Rodrigo, \"it\u0027s no longer leaving without you. Any more favors you want from us? And now tell me: What did you do with the pair in the penthouse suite, the ones that Miravelle and Oberon call Mother and Father?\"\u003c/p\u003e\n\u003cp\u003eRodrigo turned slowly and looked at me, eyes narrow and vicious, and his mouth twisted with anger. He picked up his little cell phone again, and let loose a barrage of Spanish into it with only one recognizable word: Lorkyn.\u003c/p\u003e\n\u003cp\u003eSteps overhead.\u003c/p\u003e\n\u003cp\u003e\"Hmmm. So she\u0027s alive too,\" said Oberon, from behind him.\u003c/p\u003e\n\u003cp\u003eA light singing voice came from Miravelle:\u003c/p\u003e\n\u003cp\u003e\"Oh, please, please, if you\u0027re here to save us, let us go up to Mother and Father\u0027s room. Let us see them.\u003c/p\u003e\n\u003cp\u003eRodrigo promised they are there, they are on ice, let us go! They are safe and sound on ice. Please, Oberon, please! Before Lorkyn comes.\"\u003c/p\u003e\n\u003cp\u003e\"You imbecile,\" said Rodrigo, his eyes fixed on me, then darting to Mona and Quinn, trying vainly to comprehend what we were, how to play this. He had no gun, but there was a knife in his boot, and he was desperate for the appearance of Lorkyn.\u003c/p\u003e\n\u003cp\u003eAnd Lorkyn satisfied everyone on that score immediately.\u003c/p\u003e\n\u003cp\u003eWe could hear her striding down the steps from the floor above. We could hear her tread on the balcony, and then she appeared in the open doors to the suite.\u003c/p\u003e\n\u003cp\u003eI heard Oberon\u0027s deep despairing sigh before I made sense of what I saw, and Mona let out a bitter laugh.\u003c/p\u003e\n\u003cp\u003eThe creature was the predictable six and a half feet tall, with the predictable baby flesh face and naked arms and legs, but her face was round, not oval, and she had almond-shaped green eyes, extraordinarily pretty, with lashes so thick you\u0027d think they were fake but they weren\u0027t, and a kitten nose, and a sweet mouth, very pink, and a small firm chin. She had Mona\u0027s red hair, brushed back from her shining forehead and apparently clipped on the top of her head, because it appeared to be spilling down behind her.\u003c/p\u003e\n\u003cp\u003eShe wore a leather sleeveless shirt, low-slung belt, miniskirt and high-heel boots, laced up the back.\u003c/p\u003e\n\u003cp\u003eThe shocker? She was armed, not just with a gun in a holster over her shoulder, but with an AK-47 slung over her shoulder as well.\u003c/p\u003e\n\u003cp\u003eShe sized up the situation in an instant. But for insurance Rodrigo let loose with another aria of Spanish in which he told her to kill us all, including Oberon, but to spare Miravelle.\u003c/p\u003e\n\u003cp\u003e\"You move for that gun, precious,\" I said, \"and I\u0027ll burn you to a cinder where you stand.\"\u003c/p\u003e\n\u003cp\u003eOberon was transformed with rage.\u003c/p\u003e\n\u003cp\u003e\"You filthy trash!\" Oberon declared. \"You murderous little traitor to the Secret People!\" He began to shake all over, the tears spilling from his eyes. \"You\u0027re in with them and you let me rot in that room below! You treacherous beast!\" He drew out his gun and aimed it right at her.\u003c/p\u003e\n\u003cp\u003eMona snatched it out of his hand.\u003c/p\u003e\n\u003cp\u003e\"Honey darling,\" she said, shivering all over, \"she\u0027s a specimen now. Rowan Mayfair can decide what to do with her.\"\u003c/p\u003e\n\u003cp\u003e\"Rowan Mayfair?\" asked Lorkyn in a soft ironic voice. \"Rowan Mayfair has found this island?\"\u003c/p\u003e\n\u003cp\u003e\"Shoot them!\" Rodrigo cracked out in English.\u003c/p\u003e\n\u003cp\u003eLorkyn didn\u0027t move. \"And Rowan Mayfair sends Blood Hunters to take us away from here?\" Her voice had a sweetness to it that was entirely physical and had little to do with her intentions. Her facial features were mobile, expressive of emotion. But she dropped her voice to a whisper. \"No wonder Father fell in love with this woman. What amazing resources she commands.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, he never did, he loved Mother!\" cried Miravelle. \"Please don\u0027t say all those old hateful things! We have Oberon free again. We\u0027re together! Rodrigo, you have to let us stay together.\"\u003c/p\u003e\n\u003cp\u003e\"Shoot them!\" screamed Rodrigo. He cursed Lorkyn a thousand times over in Spanish.\u003c/p\u003e\n\u003cp\u003e\"Why not kill this one now?\" Quinn asked pointing to Rodrigo.\u003c/p\u003e\n\u003cp\u003e\"Lorkyn, where are the Mother and the Father?\" I asked. \"Do you know?\"\u003c/p\u003e\n\u003cp\u003e\"Safe on ice,\" she said.\u003c/p\u003e\n\u003cp\u003e\"And where precisely would that be?\" Mona asked with exhausted exasperation.\u003c/p\u003e\n\u003cp\u003e\"I won\u0027t speak to anyone but Rowan Mayfair,\" said Lorkyn.\u003c/p\u003e\n\u003cp\u003e\"Let me see them, please!\" cried Miravelle. \"Oberon, make her unlock the penthouse.\"\u003c/p\u003e\n\u003cp\u003e\"Rodrigo, I don\u0027t think there\u0027s any reason now to keep you alive,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Let me shoot him,\" said Oberon.\u003c/p\u003e\n\u003cp\u003e\"No,\" I said, \"you\u0027d take the gun and shoot Lorkyn.\"\u003c/p\u003e\n\u003cp\u003eRodrigo went mad after a fashion. He tried to jump from the front balcony. I turned his head around on his neck, killing him instantly. I dropped him down to the tiles below. He lay there in a splat of blood.\u003c/p\u003e\n\u003cp\u003eI turned around in time to see Lorkyn shoved back against the wall, her arms out in the form of a crucifix. She\u0027d reached for the gun in her holster and Quinn had done this by pure force. Lorkyn was staring at him. Her calm was impressive.\u003c/p\u003e\n\u003cp\u003eMona was studying her as if trying in vain to understand her.\u003c/p\u003e\n\u003cp\u003eOberon was glaring at Lorkyn, and bitterly weeping. Miravelle clung to him.\u003c/p\u003e\n\u003cp\u003e\"You were in with them all the time,\" Oberon said despairingly. \"What were you, the brains behind Rodrigo\u0027s glory? You with all your intellect and cunning? You could have reached help! You could have gotten us off this island! Damn you for what you did! Why did you do it?\"\u003c/p\u003e\n\u003cp\u003eLorkyn of the kitten face didn\u0027t answer. Her face never lost its softness, its expression of receptivity.\u003c/p\u003e\n\u003cp\u003eI went to her and gently removed her automatic weapon and broke it into pieces. I took the gun and threw it way out over the patio into the sea. She had a knife in her boot. Beautiful knife. I took it and put it in my own boot.\u003c/p\u003e\n\u003cp\u003eShe said nothing to me, her exquisite eyes watching me as patiently as if I was reading her a poem.\u003c/p\u003e\n\u003cp\u003eI scanned but it got me nowhere.\u003c/p\u003e\n\u003cp\u003e\"Take us to the Mother and the Father,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll reveal them to Rowan Mayfair and no one else,\" said Lorkyn.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re in the penthouse on ice!\" said Miravelle. \"Rodrigo always said. On ice. Let\u0027s go. I can lead the way. Rodrigo said that when he came into the penthouse, Father said \u0027Don\u0027t kill us, we can\u0027t do you any harm, keep us on ice and you can sell us to Rowan Mayfair and Mayfair Medical for millions of dollars.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Oh, please,\" said Oberon through his tears, \"Miravelle, darling dear, for once don\u0027t be a perfect idiot! They can\u0027t be in the penthouse on ice. I know where they are. I know where they have to be. If you can keep Lorkyn in custody, I know precisely where to go.\"\u003c/p\u003e\n\u003cp\u003eWe moved as quickly as we could. Quinn had Lorkyn firmly by the arm. Oberon led the way. Down the stairs and down the stairs.\u003c/p\u003e\n\u003cp\u003eOnce again, the giant kitchen.\u003c/p\u003e\n\u003cp\u003eA pair of huge doors. Refrigerator? Freezer? One was laden with locks.\u003c/p\u003e\n\u003cp\u003eI broke them off immediately.\u003c/p\u003e\n\u003cp\u003eAs soon as the white mist cleared I stepped inside and I saw in the light over my shoulder the bodies frozen on the floor.\u003c/p\u003e\n\u003cp\u003eThe tall black-haired man with the white hair above his ears, and the red-haired woman, both with their eyes closed, serene, tender to behold in each other\u0027s arms, white cotton garments, bare feet, angels sleeping together. Covered with frost, as if in the deep claw of intentional winter.\u003c/p\u003e\n\u003cp\u003eScattered end to end on them, but not on their faces, were frozen yet once beautiful flowers.\u003c/p\u003e\n\u003cp\u003eI stood to one side gazing down at them, as the others peered through the door. I gazed at the frozen fluids on the floor, at the discoloration of their skin here and there, at the perfection of their embrace and their utter stillness.\u003c/p\u003e\n\u003cp\u003eMiravelle let out a high-pitched scream: \"Mother. Father.\"\u003c/p\u003e\n\u003cp\u003eOberon sighed and turned away. \"And so down the long centuries he comes to this,\" he murmured, \"at the hands of his own sons and daughters, and she the mother of us all who might have lived a millennium. And who put the flowers here, may I ask? Was it you, Lorkyn, you traitor to everything they believed? It had to be, did it not? You petty deserter. May God forgive you that you made peace with our enemy. Did you lead them here by the hand yourself?\"\u003c/p\u003e\n\u003cp\u003eMona stepped into the lighted rectangle of the door. \"That\u0027s my daughter,\" she whispered. No tears. No sobs.\u003c/p\u003e\n\u003cp\u003eI felt the immense falling off in her of hope, of dreams, of love itself. I saw the bitter acceptance in her face, the deep drifting.\u003c/p\u003e\n\u003cp\u003eMiravelle was crying. \"So he made them hard as ice, that\u0027s what he did,\" she cried. She put her hands to her face and cried and cried.\u003c/p\u003e\n\u003cp\u003eI knelt down beside the pair, and I laid my hand on the man\u0027s head. Frozen solid. If there was a soul in there, I couldn\u0027t feel it. But what did I know? Same with the red-haired woman, so resembling Mona in her fresh Nordic beauty.\u003c/p\u003e\n\u003cp\u003eI walked carefully out of the freezer until I reached the warm air, and I took Mona in my arms. She was shaking all over but her eyes were dry and squinting in the white mist. Then she roused herself as best she could.\u003c/p\u003e\n\u003cp\u003e\"Come on, Miravelle, my dear,\" she said. \"Let\u0027s close the door. Let\u0027s wait for help to come.\"\u003c/p\u003e\n\u003cp\u003e\"But who can help?\" said Miravelle. \"Lorkyn will make us do what she wants us to do. And all the others are gone.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t worry about Lorkyn,\" said Quinn.\u003c/p\u003e\n\u003cp\u003eOberon wiped away his tears disgustedly, and once again he took Miravelle in his arms and embraced her warmly. He reached out his right hand, with its long delicate fingers, and stroked Mona\u0027s bowed head, and drew her close to him.\u003c/p\u003e\n\u003cp\u003eWe closed the freezer door.\u003c/p\u003e\n\u003cp\u003e\"Quinn,\" I said, \"punch in First Street for me, then give me the little phone.\"\u003c/p\u003e\n\u003cp\u003eHe obliged with one-handed dexterity, still keeping Lorkyn prisoner with a left-handed grip.\u003c/p\u003e\n\u003cp\u003eLorkyn\u0027s face was sweet and musing, revealing nothing. Oberon, though he held Miravelle and Mona both, was glaring at Lorkyn with undisguised malice.\u003c/p\u003e\n\u003cp\u003e\"Watch,\" I whispered to Mona.\u003c/p\u003e\n\u003cp\u003eThen I was on the phone:\u003c/p\u003e\n\u003cp\u003e\"Lestat to speak to Rowan about Morrigan.\"\u003c/p\u003e\n\u003cp\u003eHer low husky voice came on the line: \"What have you got for me, Lestat?\"\u003c/p\u003e\n\u003cp\u003eI told her everything. \"How fast can you get here?\"\u003c/p\u003e\n\u003cp\u003eMona took the phone from me. \"Rowan, they could be alive! They could be in suspended animation!\"\u003c/p\u003e\n\u003cp\u003e\"They\u0027re dead,\" said Lorkyn.\u003c/p\u003e\n\u003cp\u003eMona surrendered the phone.\u003c/p\u003e\n\u003cp\u003eRowan asked: \"Will you stay until I get there?\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re creatures of the dark, my beloved,\" I said. \"As mortals are wont to say: Make it snappy.\"\u003c/p\u003e\n\u003cp\u003eIt was two a.m. when the jet landed. It barely made it on the long runway.\u003c/p\u003e\n\u003cp\u003eBy that time, Mona and I-leaving Oberon and Lorkyn in the custody of Quinn-had spent two hours getting rid of every corpse on the island. To the devouring sea we fed the remains even to the grisly remnants of the charred and smoking copter-a grim task, save for the placid overpowering waves of the Caribbean, so quickly forgiving every unclean offering.\u003c/p\u003e\n\u003cp\u003eJust before the plane landed, Mona and I had also discovered Lorkyn\u0027s digs-quite gorgeous, with a\u003c/p\u003e\n\u003cp\u003ecomputer that was indeed hooked up to the outside world, and loaded with information about the Drug Merchants, and bank accounts in a dozen places at least.\u003c/p\u003e\n\u003cp\u003eBut what had astonished both of us was the medical information of all kinds-countless articles downloaded from seemingly respectable sources on every aspect of health care, from studies of diet to neurosurgery and the intricacies of heart bypass operations and the removal of tumors of the brain.\u003c/p\u003e\n\u003cp\u003eIn fact, there was far more medical information than we could conceivably examine.\u003c/p\u003e\n\u003cp\u003eThen we hit the material on Mayfair Medical.\u003c/p\u003e\n\u003cp\u003eAnd it was there, in that strange place, in moments sandwiched between violence and mystery, that I realized how immense the Mayfair Medical project was, how multifaceted and daring and full of promise. I saw the layout of the hospital and laboratories. I saw lists of doctors, lists of units and programs and research teams.\u003c/p\u003e\n\u003cp\u003eIn addition, Lorkyn had downloaded dozens of articles about the Center which had appeared in medical journals.\u003c/p\u003e\n\u003cp\u003eAnd finally we came upon an immense amount of material on Rowan herself-her career, her achievements in research, her personal plans for the Center, her pet projects, her attitudes, her goals.\u003c/p\u003e\n\u003cp\u003eWe couldn\u0027t possibly cover it all.\u003c/p\u003e\n\u003cp\u003eWe decided we had to take the microprocessor with us. No choice really. Had to take Oberon\u0027s as well. No traces of the tragedy would be left for strangers.\u003c/p\u003e\n\u003cp\u003eRowan and Stirling were first off the plane, Rowan in jeans and plain white shirt and Stirling in a tweed suit. Immediately they reacted to the spectacle of the three Taltos, in fact, Rowan appeared to go into a silent shock.\u003c/p\u003e\n\u003cp\u003eI presented Rowan with the microprocessors from the two computers, which she entrusted to an assistant who put them safely on the plane. Lorkyn watched all this with eyes as unreadable as Rowan\u0027s, though they looked much softer, perhaps part of a very sweet mask. She had been absolutely silent all during the wait and she showed no change now.\u003c/p\u003e\n\u003cp\u003eMiravelle was weeping. Oberon, having relieved himself of the bandanna and brushed his hair, looked beyond handsome, and deigned to give Rowan a slight nod of his head.\u003c/p\u003e\n\u003cp\u003eThen Rowan said to Mona:\u003c/p\u003e\n\u003cp\u003e\"Where are the bodies?\"\u003c/p\u003e\n\u003cp\u003eOut of the plane as if on cue came a crew of men in white scrubs, on down the metal stair carrying what looked like a giant sleeping bag. They had other equipment I couldn\u0027t decipher or describe.\u003c/p\u003e\n\u003cp\u003eWe went back to the freezer.\u003c/p\u003e\n\u003cp\u003eAll this time Lorkyn made no protest, though Quinn held her tightly, but she kept her large exquisite eyes on Rowan, except for occasional glances at Oberon who never stopped staring at her with a look of pure venom.\u003c/p\u003e\n\u003cp\u003eRowan stepped cautiously inside the freezer as I\u0027d done before. She examined the bodies minutely. She touched the stains of frozen fluid on the floor. She studied patches of discoloration on their skin. Her hands returned to their heads. Then finally she withdrew and let the team do its work of taking the bodies to the plane.\u003c/p\u003e\n\u003cp\u003eShe looked at Mona:\u003c/p\u003e\n\u003cp\u003e\"They\u0027re dead,\" she said. \"They died a long time ago. Most likely right after they first lay down together here.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps not!\" said Mona desperately. \"Maybe they can survive temperatures that we can\u0027t.\" She looked frail and worn in her black feathered dress, her mouth shuddering.\u003c/p\u003e\n\u003cp\u003e\"They\u0027re gone,\" Rowan said. Her voice was not cruel. It was solemn. She was fighting her own tears and I knew it.\u003c/p\u003e\n\u003cp\u003eMiravelle began to cry again. \"Oh Mother, oh Father. . . .\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s evidence of widespread decay,\" Rowan said. \"The temperature was not consistently maintained. They didn\u0027t suffocate. They fell asleep as people do in the snow. They were probably warm at the end, and they died peacefully.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, that is so lovely,\" said Miravelle with the purest sincerity. \"Don\u0027t you think, Mona? It\u0027s so very pretty. Lorkyn, darling, don\u0027t you think it is very sweet?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, Miravelle, dear,\" said Lorkyn softly. \"Don\u0027t worry anymore about them. Their intent has been fulfilled.\"\u003c/p\u003e\n\u003cp\u003eShe had not spoken in so long that this warmth took me by surprise.\u003c/p\u003e\n\u003cp\u003e\"And what was their intent?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"That Rowan Mayfair know of their fate,\" said Lorkyn calmly. \"That the Secret People not vanish.\"\u003c/p\u003e\n\u003cp\u003eRowan sighed. Her face was indescribably sad.\u003c/p\u003e\n\u003cp\u003eShe opened wide her arms and shepherded us out of the kitchen, a doctor leading us away from a deathbed.\u003c/p\u003e\n\u003cp\u003eWe went out into the warm air, and the landscape seemed peaceful and given over to the rhythm of the waves and the breeze-cleansed by violence and mercilessness.\u003c/p\u003e\n\u003cp\u003eI looked beyond the lighted buildings to the huge mass of hovering jungle. I scanned again for any presence, human or Taltos. The dense growth was too thick with living things for me to detect any one creature.\u003c/p\u003e\n\u003cp\u003eI felt soul sick and empty. At the same time the three Taltos were worrying me in the extreme. What precisely was going to happen to them?\u003c/p\u003e\n\u003cp\u003eThe crew with the frozen bodies ran past us to board the plane, and we made our way slowly to the metal steps on the tarmac.\u003c/p\u003e\n\u003cp\u003e\"Did Father really ask for this, this freezing?\" Oberon wanted to know. He had lost all of his scornful manner. \"Did he go willingly to this death?\" he asked sincerely.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what Rodrigo always said,\" replied Miravelle, who was now in Stirling\u0027s arms, weeping piteously. \"Father had told me to hide from the bad men, so I wasn\u0027t with him. They didn\u0027t find me until the next day. Lorkyn and I were together, hiding in the little house by the tennis courts. We didn\u0027t see what happened. We never saw Father and Mother again.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t want to board this plane as a prisoner,\" said Lorkyn very politely. \"And I\u0027d like to know where I\u0027m going. It\u0027s unclear to me, the source of authority here. Dr. Mayfair, would you please explain?\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re the victim of concern right now, Lorkyn,\" said Rowan in the same mild tone that Lorkyn had used with her.\u003c/p\u003e\n\u003cp\u003eRowan reached into her pants pocket, pulled out a syringe and, as Lorkyn stared in horror and desperately struggled, sank a needle into the arm by which Quinn held her. Lorkyn went down clawing at Quinn and then finally totally collapsed, all hips, knees and spidery hands, kitten face asleep.\u003c/p\u003e\n\u003cp\u003eOberon watched with narrow eyes and a chilling smile.\u003c/p\u003e\n\u003cp\u003e\"You should have slit her throat, Dr. Rowan Mayfair,\" he said, with the rise of one eyebrow. \"As a matter\u003c/p\u003e\n\u003cp\u003eof fact, I think I can break all the bones in her neck if you\u0027ll kindly allow me to try it.\"\u003c/p\u003e\n\u003cp\u003eMiravelle spun around out of Stirling\u0027s loving grip and glared at Oberon: \"No, no, you can\u0027t do such a horrible thing to Lorkyn. It\u0027s not Lorkyn\u0027s fault she\u0027s wise and knowing! Oberon, you can\u0027t do mean things to her, not now.\"\u003c/p\u003e\n\u003cp\u003eMona gave a short bitter laugh. \"Maybe you\u0027ve got your prize specimen, Rowan,\" she said in her frail voice. \"Hook her up to every machine known to science, vivisect her, freeze her in fragments and on slides, make her lactate the marvelous Taltos milk!\"\u003c/p\u003e\n\u003cp\u003eRowan stared so icily at Mona it was difficult to tell if she heard the words. She called for help from inside the plane.\u003c/p\u003e\n\u003cp\u003eThe sleeping Lorkyn was placed on a stretcher with restraints and taken on board as we waited in silence.\u003c/p\u003e\n\u003cp\u003eStirling followed with Miravelle, who was still weeping for Mother and Father. \"If only Father had called Rowan Mayfair when he wanted to. But Mother was so jealous. She knew Father loved Rowan Mayfair. Oh, if only Father had not listened. And now the Secret People are just us three.\"\u003c/p\u003e\n\u003cp\u003eRowan caught those words, glanced at me and then at Mona. Mona registered them too with a dark flashing glance at Rowan. The darkness overcame Rowan.\u003c/p\u003e\n\u003cp\u003eOberon stood quite free, the picture of relaxation, with his weight on one hip, thumbs in his back pockets, studying Rowan in detail, his huge eyes half-mast again and his cheeks still wet from weeping.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t tell me,\" he drawled, his head thrown back, \"you want me to get in that plane too and go back with you to your Center of Medical Marvels.\"\u003c/p\u003e\n\u003cp\u003e\"Where else are you going to go?\" asked Rowan with a coolness that matched his own. \"You\u0027re going to leave Miravelle and Lorkyn?\"\u003c/p\u003e\n\u003cp\u003e\"Rowan\u0027s your kin,\" said Mona, her voice strained and impatient, \"she\u0027s your family, she\u0027ll take care of you, Oberon. If you have an ounce of sense let it override your crushing sarcasm and caustic wit, and get on the plane, and behave yourself. You might just discover you belong to an extremely rich clan of remarkably generous people.\"\u003c/p\u003e\n\u003cp\u003e\"Your optimism touches me,\" he tossed off to Mona. \"Shall we assume that it was devotion to the remarkable generous clan that drove you to run away with a couple of Blood Hunters and allow them to transform you into what you are?\"\u003c/p\u003e\n\u003cp\u003e\"Oberon,\" I said. \"I set you free, did I not?\"\u003c/p\u003e\n\u003cp\u003e\"Here it comes,\" he said, rolling his eyes, \"for the sake of Saint Juan Diego, will I please behave for Rowan Mayfair, the only human being Father ever truly loved, and will I not blind Lorkyn with my thumbs first chance I get, or something even more deliciously cruel?\"\u003c/p\u003e\n\u003cp\u003e\"Precisely,\" I said. \"Cooperate with Rowan in every respect. You have nothing to lose by it. And don\u0027t jump Miravelle and make a baby. Okay? And when you\u0027re tempted to do otherwise, remember Saint Juan Diego.\"\u003c/p\u003e\n\u003cp\u003eOberon gave a short laugh, threw up his hands, then lowered them and turned them out, then went up the metal steps to the open door.\u003c/p\u003e\n\u003cp\u003e\"This must be one hell of a saint,\" said Rowan under her breath.\u003c/p\u003e\n\u003cp\u003e\"On board,\" I said, \"Oberon can tell you all about him.\"\u003c/p\u003e\n\u003cp\u003e\"Wait, I\u0027m forgetting the statue!\" Oberon cried out at the top of the stairs. \"How could I do such a thing?\"\u003c/p\u003e\n\u003cp\u003e\"I promise to bring it to you,\" I said. \"Besides, the Mayfairs will buy you whatever you want. Go on, board.\"\u003c/p\u003e\n\u003cp\u003eHe did as I told him to do, then appeared again:\u003c/p\u003e\n\u003cp\u003e\"But remember, that\u0027s the statue connected to the miracle! You have to get it!\"\u003c/p\u003e\n\u003cp\u003e\"I have no intention of forgetting it,\" I said. He disappeared.\u003c/p\u003e\n\u003cp\u003eNow only Rowan was left, standing there with Mona and Quinn and me.\u003c/p\u003e\n\u003cp\u003e\"Where are you going now?\" asked Rowan.\u003c/p\u003e\n\u003cp\u003e\"Blackwood Farm,\" said Quinn. \"We three, we stick together.\"\u003c/p\u003e\n\u003cp\u003eRowan looked at me. No one has ever looked at me in quite the same way that Rowan does.\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003eShe turned to go, then turned back and put her arms around me, a warm bundle of life entrusted to me. Every barrier inside me collapsed.\u003c/p\u003e\n\u003cp\u003eWe kissed as if no one was there to see it, over and over, until it was a little language of its own, her breasts very hot against my chest, my hands clutching her hips, my eyes closed, my mind mute for once\u003c/p\u003e\n\u003cp\u003eas if my body had driven it back, or so inundated it with sensation that it could not tell me what to do. And at last, she pulled away, and I turned my back. The blood thirst was paralyzing me. The want was paralyzing me. And then there broke loose the love, the pure love.\u003c/p\u003e\n\u003cp\u003eI stood motionless, realizing it for what it was. Pure love. And connecting it suddenly and helplessly with the love I\u0027d felt when I\u0027d kissed Patsy\u0027s phantom at the edge of the swamp: pure love.\u003c/p\u003e\n\u003cp\u003eAnd my mind cast back over the centuries, like the mechanism of conscience determined to ferret out sin, only it searched for moments of pure love. And I knew them, secret, silent, few, splendid. Splendid in their own power, whether the loved one ever knew it or not, splendid to have loved-.\u003c/p\u003e\n\u003cp\u003eFlash on the couple in each other\u0027s arms, Ash and Morrigan, the white mist rising from them. Emblem of pure love.\u003c/p\u003e\n\u003cp\u003eThe awareness dissolved. Quinn moved me away from the roar of the jet engines. We walked off the tarmac.\u003c/p\u003e\n\u003cp\u003eWe were silent in the noise of the departing plane. At last it made its smooth ascent. And was gone into the clouds.\u003c/p\u003e\n\u003cp\u003eThe age-old mystery of the Caribbean unfolded-another tiny island soaked in blood-that this most glorious part of the world should bear witness to so many tales of violence.\u003c/p\u003e\n\u003cp\u003eMona stood looking out to sea. The breeze lifted her full red hair. Her eyes were beyond tears. She was the very picture of mourning.\u003c/p\u003e\n\u003cp\u003eCould she begin now? Really begin, my perfect one?\u003c/p\u003e\n\u003cp\u003eI drew close to her. I didn\u0027t want to intrude on this bereavement. But she reached out with her left arm and brought me in, and let her weight rest against me.\u003c/p\u003e\n\u003cp\u003e\"This was my search,\" she said, eyes faraway, \"this was my dream, my dream that overleapt the Dark Blood-the dream that carried me through all the pain that preceded it.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" I said. \"I understand you.\"\u003c/p\u003e\n\u003cp\u003e\"That I would find my Morrigan,\" she said, \"that I would find them living in happiness, that I would know her again with all her madness and we would talk the long nights away, exchanging kisses, our lives touching and then parting. And now . . . it\u0027s all ruin.\"\u003c/p\u003e\n\u003cp\u003eI waited, out of respect for what she\u0027d said. Then I spoke:\u003c/p\u003e\n\u003cp\u003e\"They did live in happiness for a very long time,\" I said. \"Oberon described it to us. They lived for years as the Secret People.\" I reminded her as best I could of what Oberon had told us.\u003c/p\u003e\n\u003cp\u003eSlowly she yielded to a nod, her eyes on the placid and warm sea. It made no impression upon her. \"They should have let us help!\" she whispered. \"Michael and Rowan would have helped! Oh, the folly of it! To think that Morrigan wouldn\u0027t let him call Rowan. Because she was jealous! Oh, Rowan, Rowan.\"\u003c/p\u003e\n\u003cp\u003eI held my thoughts to myself.\u003c/p\u003e\n\u003cp\u003e\"Come home to Blackwood Farm,\" said Quinn. \"There\u0027s time to mourn and time to know Miravelle and Oberon and even Lorkyn.\"\u003c/p\u003e\n\u003cp\u003eShe shook her head.\u003c/p\u003e\n\u003cp\u003e\"No,\" she said. \"These Taltos are not for me, not now. Miravelle is some pure and lithesome thing without my fire, without her mother\u0027s fire. The link is broken. Morrigan went down in pain. They\u0027ll care for Miravelle. Poor tender creature, salvaged from the ancient one and a mutant birth. I have nothing to give to Miravelle. As for Oberon, he\u0027s too dark for me, and what can I give him? He\u0027ll kill Lorkyn sooner or later, don\u0027t you think? And how will Rowan justify the keeping of Lorkyn? It\u0027s not my concern. It\u0027s not my passion. I want to be with you, you are my people.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t try to decide these things now,\" I said. I felt so sorry for her. And in my heart I felt a burning concern for the tasks that lay ahead of Rowan.\u003c/p\u003e\n\u003cp\u003e\"Maharet\u0027s words are clear.\" She went on in the same torn voice, her eyes never turning to me or to Quinn. \"It was nature taking its course. It was inevitable.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps, perhaps not,\" said Quinn. \"But it is finished.\"\u003c/p\u003e\n\u003cp\u003eI turned, and looked at the distant villa with all its lighted windows. I looked at the broad mass of rocky jungle rising behind the brashly illuminated beach. I scanned. I caught the small beasts of the wild place, the tamarinds, the birds, perhaps a wild boar deep in there. I couldn\u0027t tell.\u003c/p\u003e\n\u003cp\u003eYet I was reluctant to leave. I wasn\u0027t sure why.\u003c/p\u003e\n\u003cp\u003eI wanted to move through the jungles. The jungles I had not searched, and they were thick. Only this was not the time.\u003c/p\u003e\n\u003cp\u003eWe bid the island good-bye. Quinn took Mona in his arms, and they made for the clouds.\u003c/p\u003e\n\u003cp\u003eI went back for the statue of my beloved saint, and was soon on my way to the safe refuge of Blackwood\u003c/p\u003e\n\u003cp\u003eFarm. \u003c/p\u003e","sourceLink":"https://allnovel.net/blood-canticle-the-vampire-chronicles-10/page-26.html","bookId":2596,"creation":"Oct 5, 2019 6:24:56 PM","modification":"Oct 5, 2019 6:24:56 PM"}
