{"id":84924,"no":13,"title":"Page 13","content":"\u003cp\u003e“I know this is probably a stupid question since you’re here tonight, but are you dating anyone? I mean, seriously seeing someone?”\u003c/p\u003e\n\u003cp\u003eI’m taken aback by his question and stare at him stupidly for a second.\u003c/p\u003e\n\u003cp\u003e“Of course not,” I finally manage to say. “If I was, I’m sure he wouldn’t be too happy about the fact that I’m here on a date with you.”\u003c/p\u003e\n\u003cp\u003eEthan grins and seems relieved. “OK. Good. I just wasn’t sure if you were considering this a date or not, or if you just thought we were catching up. I just wanted to check.”\u003c/p\u003e\n\u003cp\u003eI have to laugh. “I actually thought we were just catching up, but Mila insisted it was a date. So I’m glad that’s cleared up.”\u003c/p\u003e\n\u003cp\u003e“Well, you look beautiful and I’m not ready to say good night,” Ethan announces. “Want to go for a walk on the beach? It’s not raining for the first time in days. We should take advantage of it. I can drive us there and you can leave your heels in the car.”\u003c/p\u003e\n\u003cp\u003e“Good plan,” I tell him. “Because there’s no way in hell these heels are getting anywhere near the sand. I had to eat frozen burritos for a month for these.”\u003c/p\u003e\n\u003cp\u003eHe chuckles, not knowing that I eat frozen burritos anyway. As he helps me shrug into my sweater, he dips his head and inhales. “You smell fantastic.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” I murmur. The compliment was nice, but I’m rethinking my decision to extend our date.\u003c/p\u003e\n\u003cp\u003eI can’t help but wonder if there’s something wrong with me because I’m still not attracted to him, even though he’s Mr. Perfect now.\u003c/p\u003e\n\u003cp\u003eI climb into his BMW and he closes my door, a perfect gentleman. We’re at the beach in just a couple of minutes.\u003c/p\u003e\n\u003cp\u003eAs Ethan pulls into a space, I gaze out across the water.\u003c/p\u003e\n\u003cp\u003e“It seems so majestic, doesn’t it?” I ask Ethan softly. “So big. It makes me feel so small.”\u003c/p\u003e\n\u003cp\u003e“I don’t know about that,” he replies as he opens my door. “But it’s definitely windy.”\u003c/p\u003e\n\u003cp\u003eI roll my eyes at his lack of appreciation for the beauty around us and follow him down the narrow path to the shore. Wild grass blows on either side of the hard-packed trail. To our left the water crashes into the shore. To our right the sand dunes roll, rugged and beautiful.\u003c/p\u003e\n\u003cp\u003e“I love it here,” I sigh and I grasp Ethan’s arm.\u003c/p\u003e\n\u003cp\u003eI mean, it’s supposed to be a date. I can touch the guy, right? The wind is chilly and his arm is warm. It’s not a crime to absorb some of his heat.\u003c/p\u003e\n\u003cp\u003eI don’t even let my mind wander to the guy I’d really like to be touching. And I wouldn’t just be touching him to stay warm, either. The mere thought of how I’d like to touch him makes my cheeks flush yet again as in my head, Gabriel winks at me.\u003c/p\u003e\n\u003cp\u003eWhy the hell is he stuck in my head?\u003c/p\u003e\n\u003cp\u003e“I like it here too,” Ethan answers, bringing me back to my present company. “I thought about staying in the city to do my residency but I really just wanted to come home. It was a nice surprise to find you still here. You always seemed destined for something bigger than here, you know?”\u003c/p\u003e\n\u003cp\u003eHe smiles down at me with white teeth a supermodel would be envious of. I really, really, really wish that my heart would flutter or my hormones would react. But they don’t. Nothing. Nada.\u003c/p\u003e\n\u003cp\u003eHell. I’m such a dating failure.\u003c/p\u003e\n\u003cp\u003e“Well, it was definitely hard getting used to being back here. It’s so small.”\u003c/p\u003e\n\u003cp\u003eEthan laughs at that, but thankfully lets the conversation thread go. I’m grateful because his small talk is annoyingly bland.\u003c/p\u003e\n\u003cp\u003eWe continue walking and chatting and I continue holding on to his arm.\u003c/p\u003e\n\u003cp\u003eHe appears to be genuinely interested in all the things I tell him about the Hill, although I can’t say the same for myself about his tales from the clinic. How can someone so gorgeous be so freaking boring?\u003c/p\u003e\n\u003cp\u003e“So, yeah, I was freaked out when I first gave someone a catheter. I mean, seriously. Who really wants to pick up another man’s penis and insert a hose into it? Thank God that’s usually the nurses’ job.” Ethan continues to tell me his medical tales and I continue to tune them out. Because seriously. I don’t want to hear about him playing with another man’s junk.\u003c/p\u003e\n\u003cp\u003eAs I concentrate on not listening, a figure takes shape in the near distance, jogging toward us. Out of idle curiosity, I keep an eye on the jogger as he draws closer and closer, and then almost gasp when I finally realize who it is.\u003c/p\u003e\n\u003cp\u003eGabriel.\u003c/p\u003e\n\u003cp\u003eNo freaking way. It’s like the universe is determined to keep bringing me into his path.\u003c/p\u003e\n\u003cp\u003eMy mouth instantly goes dry as his stormy eyes lock on my face.\u003c/p\u003e\n\u003cp\u003eWe need to finish what we started.\u003c/p\u003e\n\u003cp\u003eI feel my cheeks flush and as they do, he smirks… like he knows exactly what I’m thinking.\u003c/p\u003e\n\u003cp\u003eHe’s shirtless and the muscles in his chest and abdomen flex with every movement. His dark hair is mussed and damp, so it’s obvious he’s been running for a while.\u003c/p\u003e\n\u003cp\u003eSweet Mary. Why is it that an entire evening with Ethan leaves me cold but one freaking glance from this guy sets my blood on fire?\u003c/p\u003e\n\u003cp\u003eThe man is built. His arms are cut, his abs are a rock-hard washboard and he’s got that perfect V running down into the waistband of his shorts. I try to pretend that I don’t notice, but I can tell from his smirk that he knows that I did.\u003c/p\u003e\n\u003cp\u003eI ignore it. Instead I ponder the way he seems so lean and efficient. Every movement is smooth and deliberate. And powerful. I’ve always heard that Special Forces turn their soldiers into trained killers. I don’t know about that, but holy crap, he looks lethal.\u003c/p\u003e\n\u003cp\u003eI can’t seem to look away and as he jogs past, he glances at me sideways.\u003c/p\u003e\n\u003cp\u003eHe also splashes through a tiny pool of water, which splatters Ethan’s pants in muddy droplets.\u003c/p\u003e\n\u003cp\u003e“Hey, dude,” Ethan protests, turning to glare after Gabriel. “Watch what you’re doing.”\u003c/p\u003e\n\u003cp\u003eI’m surprised that Ethan would say anything at all because it was clearly an accident, but I’m equally surprised when Gabriel stops, turns and walks back to us, sweat glistening on his brow. Hell.\u003c/p\u003e\n\u003cp\u003e“What did you say?” he asks incredulously. Apparently he’s surprised too.\u003c/p\u003e\n\u003cp\u003eEthan seems hesitant now that he’s face-to-face with Gabe.\u003c/p\u003e\n\u003cp\u003e“I said watch it,” he says, quieter now. “You got mud on my pants.”\u003c/p\u003e\n\u003cp\u003e“Did I now?” Gabe rolls his eyes. “I apologize. I apologize that you’re a candy-ass who doesn’t like to get dirty.”\u003c/p\u003e\n\u003cp\u003eEthan practically sputters as he steps toward Gabriel and I have no clue what to do.\u003c/p\u003e\n\u003cp\u003e“Whatcha gonna do, candy-ass?” Gabriel taunts him, leaning forward mockingly. “Anything?”\u003c/p\u003e\n\u003cp\u003eGabriel raises an eyebrow, waiting, and I shake my head, disappointed that he would react like this. Disappointed, but not surprised. He did punch a hole in his wall, for God’s sake, then turned around and slammed Jared into a wall. It’s clear what kind of guy he is… someone who has a temper problem. Before I can stop myself, I speak up for Ethan.\u003c/p\u003e\n\u003cp\u003e“What the hell, Gabriel? You splashed mud on him. This is your fault, not his. Why are you being such a dick about it?”\u003c/p\u003e\n\u003cp\u003eThe way he looks at me, with almost an offended expression, makes me wonder… is this overreaction about me? Is he annoyed that Ethan is here with me? His face closes up, though, and I decide that that can’t be right\u003c/p\u003e\n\u003cp\u003e“Come find me if you get tired of having a girl fight your battles,” Gabriel tells Ethan. “And I’ll be happy to buy you another pair of candy-ass pants.”\u003c/p\u003e\n\u003cp\u003eHe starts to walk away, then turns back around, his eyes locking on mine. His dark gaze is intense as he stares into my eyes, then at my mouth.\u003c/p\u003e\n\u003cp\u003eWhat’s he thinking? Why the hell is he acting like what happened the other night was normal? Like any of this is normal?\u003c/p\u003e\n\u003cp\u003eIt’s not normal.\u003c/p\u003e\n\u003cp\u003eDoesn’t he care that I helped him? I took a chance, a risk, by walking a strange man home because I just couldn’t leave him there alone. And now he just wants to pretend that none of it happened.\u003c/p\u003e\n\u003cp\u003eHe just keeps staring at my lips with a gaze that says, It doesn’t matter. None of that matters, Maddy.\u003c/p\u003e\n\u003cp\u003eAnd for a minute it really doesn’t because he’s staring at my mouth like he wants to devour it and that’s all I can think about.\u003c/p\u003e\n\u003cp\u003eSelf-consciously, I drag my teeth across my bottom lip. In reaction, the corner of his tilts up and I get a glimpse of his white teeth, his pink tongue.\u003c/p\u003e\n\u003cp\u003eThe same tongue that has licked and sucked my nipples.\u003c/p\u003e\n\u003cp\u003eMy heart slams in my chest and he smiles, just slightly.\u003c/p\u003e\n\u003cp\u003eHe knows what I’m thinking.\u003c/p\u003e\n\u003cp\u003eI take a breath. He takes a step.\u003c/p\u003e\n\u003cp\u003eHe takes another one, dipping his head toward my ear, close enough that Ethan can’t hear, close enough that his lips graze my cheek.\u003c/p\u003e\n\u003cp\u003e“Think about me, Maddy.”\u003c/p\u003e\n\u003cp\u003eMy heart stops. Before I can respond, he grins cockily and spins around, jogging past us without looking back.\u003c/p\u003e\n\u003cp\u003e“What a dick,” Ethan mutters. “Who is that guy? What did he say to you?”\u003c/p\u003e\n\u003cp\u003e“Jacey’s brother,” I answer, fighting an incredible urge to look over my shoulder, to watch him jog away. “I don’t know why he’s still here. I think he lives in Chicago.”\u003c/p\u003e\n\u003cp\u003eI know he lives in Chicago. But obviously I don’t mention that or how I know that. And I definitely don’t tell him what Gabriel said.\u003c/p\u003e\n\u003cp\u003e“Well, we can hope that he goes home soon,” Ethan grumbles. “We don’t need assholes like that here. This town is too small for that. It’s bad enough that we have Pax Tate.”\u003c/p\u003e\n\u003cp\u003eHis head snaps up as he remembers that Pax is my brother-in-law, as he realizes that he just stuck his foot in his mouth.\u003c/p\u003e\n\u003cp\u003e“God, I’m sorry. I didn’t mean it like that. It’s just that ever since he moved here a few years ago, we all knew to steer clear of him. We knew that if we bumped into him on a bad day, he would be a total asshole.”\u003c/p\u003e\n\u003cp\u003e“What do you care?” I demand. “You were hardly ever home to bump into him. And he’s not an asshole anymore.”\u003c/p\u003e\n\u003cp\u003e“That’s what they say,” Ethan says, seemingly unconvinced. His tone, his words… everything about him right now is annoying me. He has no right to judge Pax. Not by a long shot.\u003c/p\u003e\n\u003cp\u003eAnd yes, Gabriel overreacted. He could’ve kept on jogging and pretended that he didn’t hear Ethan. But Ethan didn’t need to say anything in the first place. So what if he got some water splashed on his pants?\u003c/p\u003e\n\u003cp\u003eHe really is a candy-ass.\u003c/p\u003e\n\u003cp\u003eAnd Gabe so clearly is not.\u003c/p\u003e\n\u003cp\u003eMy mood toward Ethan has definitely been dampened even more than it already was and I remain quiet as he and I walk back to his car.\u003c/p\u003e\n\u003cp\u003eAfter he drives me back to his place, I tell him that I’m tired and that I should really head home rather than come inside for a drink. I can tell he’s disappointed, but he handles it smoothly.\u003c/p\u003e\n\u003cp\u003e“That’s all right, Maddy. I’ve been up since four a.m., so I’m wiped too. But this was fun. We should do it again soon.”\u003c/p\u003e\n\u003cp\u003eThere is an awkward pause as I stand next to my car.\u003c/p\u003e\n\u003cp\u003eI can tell he’s contemplating kissing me and I dread the thought.\u003c/p\u003e\n\u003cp\u003eDon’t, I silently instruct him. But instead of expecting him to read my mind, I solve the problem by raising myself up on my tiptoes and kissing his cheek.\u003c/p\u003e\n\u003cp\u003e“Sure,” I murmur.\u003c/p\u003e\n\u003cp\u003eEthan stares down at me as the top of my car lowers. \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-leave-beautifully-broken-2/page-13.html","bookId":2759,"creation":"Oct 5, 2019 5:03:51 PM","modification":"Oct 5, 2019 5:03:51 PM"}
