{"id":84913,"no":2,"title":"Page 2","content":"\u003cp\u003eAs I watch, he lights up a cigarette and takes a drag, releasing the smoke slowly into the night. His lips are full and masculine and he’s got a cleft in his chin. He’s undeniably sexy. Normally I would stay far away from someone like him, someone sinfully sexy but so… forceful. A guy like that is trouble. That’s for sure.\u003c/p\u003e\n\u003cp\u003eBut I didn’t come to the club tonight to run away.\u003c/p\u003e\n\u003cp\u003eI came here to hook up. To blow off my responsibilities and be reckless for a night. To act my age. To be someone I’m not.\u003c/p\u003e\n\u003cp\u003eI eye the guy again.\u003c/p\u003e\n\u003cp\u003eNormally I would run away from him.\u003c/p\u003e\n\u003cp\u003eBut maybe… just tonight… I won’t.\u003c/p\u003e\n\u003cp\u003eI don’t have to be me tonight. I can be anyone I want to be because he’ll never see me again.\u003c/p\u003e\n\u003cp\u003eJust for tonight.\u003c/p\u003e\n\u003cp\u003eI hesitate, trying to decide what to do.\u003c/p\u003e\n\u003cp\u003eThen, almost as though my feet have a mind of their own, I take a step toward him. And then another.\u003c/p\u003e\n\u003cp\u003eGabriel\u003c/p\u003e\n\u003cp\u003eMy cigarette burns red in the dark as I take a nice long drag. I suck in the city air and the nicotine, then exhale the toxic waste. I know that smokes are bad for me, that they’re shit for my lungs, but I don’t particularly care right now.\u003c/p\u003e\n\u003cp\u003eFrom inside the club, I can feel the bass thumping against the wall, vibrating my spine. Inside, women are mindlessly mashing together on the dance floor in time to those drums, waiting for guys like me to take them home and fuck them.\u003c/p\u003e\n\u003cp\u003eI don’t care about that either. I had to get some fresh air, to get away from the claustrophobic club smoke and sweat before I fucking exploded.\u003c/p\u003e\n\u003cp\u003eIf I were a normal person, I’d be nervous in a dark Chicago alley by myself. I’m not a normal person, though, and the shit I saw in Afghanistan rendered my ability to feel fear impotent.\u003c/p\u003e\n\u003cp\u003eBut not the rest of me.\u003c/p\u003e\n\u003cp\u003eI shift my weight and adjust the boys and my semi-hard dick. I’d have to be inhuman to not be horny after watching the half-dressed drunk girls rub themselves on anyone who might buy them a drink. I should feel bad about that, but I don’t.\u003c/p\u003e\n\u003cp\u003eBefore my tour overseas, I wouldn’t have been caught dead with any of them. But after being overseas for three years, my penis isn’t listening to reason anymore. It knows what I need.\u003c/p\u003e\n\u003cp\u003eI sigh and adjust the constraining crotch of my jeans again, before taking another deep breath, then another. My dick starts to calm down and my claustrophobic feelings begin to fade. Thank God. One of the many things I brought home was claustrophobia, and it’s not even the predictable kind where I’m afraid of small spaces. It’s the random kind that can strike at the strangest times, like in the middle of a crowd.\u003c/p\u003e\n\u003cp\u003eFuck it.\u003c/p\u003e\n\u003cp\u003eI toss down the cigarette and grind it out with my heel, then pull out another, lighting it up. It’s a bad habit I brought back with me, along with a couple tattoos and the tendency to wake up in a cold sweat from crazy-ass nightmares.\u003c/p\u003e\n\u003cp\u003e“You know those will kill you, right?”\u003c/p\u003e\n\u003cp\u003eI startle to attention, my head snapping around to find the soft voice in the dark.\u003c/p\u003e\n\u003cp\u003eA woman steps closer and I can’t believe that I didn’t see her approach.\u003c/p\u003e\n\u003cp\u003eFucking hell.\u003c/p\u003e\n\u003cp\u003eWe’re the only two people in an isolated alley. How could I have missed her? My senses have seriously dulled since I’ve been back stateside. She’s a tall, willowy bombshell, the kind of woman who stands out in a crowd, let alone an abandoned street.\u003c/p\u003e\n\u003cp\u003eBlonde hair falls halfway down her back and wide eyes stare at me. Her full lips are pursed, as though she’s trying to decide if it’s safe to be out here. And it’s not, especially for a woman who looks like she does.\u003c/p\u003e\n\u003cp\u003e“Don’t you know walking alone in a dark Chicago alley is more dangerous than a cigarette?”\u003c/p\u003e\n\u003cp\u003eI gaze at her levelly as I take another drag on my smoke.\u003c/p\u003e\n\u003cp\u003eShe doesn’t look afraid at all as she shrugs.\u003c/p\u003e\n\u003cp\u003e“Either of those things has to be better than being crushed to death in there.”\u003c/p\u003e\n\u003cp\u003eShe gestures toward the closed club door in disdain. I examine her again. She’s wearing the right clothes to be here… tight pink leather pants, a cream-colored halter top, equally tight, and a pair of extremely high glittery heels. As I examine her, I notice that she’s not wearing a bra under her light-colored shirt. Somehow that looks out of place on her, as though she doesn’t fit the slutty clothes.\u003c/p\u003e\n\u003cp\u003eThe problem is, the slutty clothes definitely fit her, in all the right places. My dick lurches back to life as my gaze skims over her curved hips and tight ass.\u003c/p\u003e\n\u003cp\u003e“In that case, want one?” I offer her the pack.\u003c/p\u003e\n\u003cp\u003eShe looks surprised, then chuckles, shaking her head.\u003c/p\u003e\n\u003cp\u003e“No, thanks. I’m already in the alley alone. I think that’s enough of a risk tonight.”\u003c/p\u003e\n\u003cp\u003eI grin back as I tuck the smokes into my pocket. “But you’re not alone now. I’m here.”\u003c/p\u003e\n\u003cp\u003eShe eyes me and I can see now that her eyes are blue.\u003c/p\u003e\n\u003cp\u003e“Somehow,” she says thoughtfully, “I doubt I’m any safer.”\u003c/p\u003e\n\u003cp\u003eI smile. “Somehow, I think you’re right.”\u003c/p\u003e\n\u003cp\u003eThe funny thing is, she doesn’t look worried. In fact, she steps closer and leans against the filthy brick wall beside me. Even under the yellowed dingy streetlight, she looks flawless.\u003c/p\u003e\n\u003cp\u003e“You’re going to get dirty,” I point out. She looks up at me innocently, her blue eyes wide.\u003c/p\u003e\n\u003cp\u003e“I like getting dirty sometimes.”\u003c/p\u003e\n\u003cp\u003eAnd then she grins a wicked grin.\u003c/p\u003e\n\u003cp\u003eI feel like I’ve been sucker-punched as all the air whooshes out of my body. A suggestive grin like that on this runway model is too much for my logical thought processes to overcome. My good sense has apparently been hijacked by my hormones.\u003c/p\u003e\n\u003cp\u003eTossing the smoke down on the sidewalk, I grind the heel of my boot into it. I don’t know what the fuck I’m doing, but I don’t much care at this point. I’m horny and she’s gorgeous. That’s a perfect arrangement if I ever saw one. The air between us practically crackles with sexual attraction.\u003c/p\u003e\n\u003cp\u003eI look down at her and as I do, I let myself lean into her. She’s soft and she smells even softer.\u003c/p\u003e\n\u003cp\u003e“I’m Gabriel.”\u003c/p\u003e\n\u003cp\u003e“I’m Madison,” she answers. She hasn’t looked away from me even once. She’s definitely into me, although God knows why. I’m as different from her as I can be.\u003c/p\u003e\n\u003cp\u003e“Why are you here, Madison?” I ask. “You seem a little out of place.”\u003c/p\u003e\n\u003cp\u003eShe suddenly looks self-conscious. “A friend talked me into coming. She thought I needed a night in the big city. But I really wish I was home instead. I’m tired and these heels hurt.”\u003c/p\u003e\n\u003cp\u003eI smile. Her shoes do look painful as hell. I’ve never understood why women wear shit like that.\u003c/p\u003e\n\u003cp\u003e“So you don’t live here?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head and as she does, her scent seems to envelop us, blocking out the pungent city smells. Her nearness is intoxicating and I brace myself against it so I don’t get sucked in any further.\u003c/p\u003e\n\u003cp\u003e“No. I’m from a little lake town, just an hour or so from here. But it seems like a world away. I’m not much of a big-city girl. Not anymore, anyway.”\u003c/p\u003e\n\u003cp\u003eI actually wouldn’t have guessed that. She’s got that perfectly put-together look that big-city girls have, that perfectly confident attitude.\u003c/p\u003e\n\u003cp\u003eShe nudges me, her slender shoulder bumping mine. “Why are you here? You don’t look like you fit here either. Not here at this club, anyway.”\u003c/p\u003e\n\u003cp\u003eI cock an eyebrow. “Oh?”\u003c/p\u003e\n\u003cp\u003eThe Underground is a trendy Chicago hot spot. And she’s right. I don’t fit in here. I fit in a Humvee in the hills of Afghanistan. Except I don’t. Not anymore.\u003c/p\u003e\n\u003cp\u003eMadison notices my expression and flushes.\u003c/p\u003e\n\u003cp\u003e“No offense. But you’re not wearing skinny jeans and hipster glasses. You seem more like… the football-playing type. Or the outdoors type, maybe.”\u003c/p\u003e\n\u003cp\u003eI smile down at her. “No offense taken. And I am more of the outdoors type.”\u003c/p\u003e\n\u003cp\u003eThe gun-toting soldier type, to be exact, but I don’t say that.\u003c/p\u003e\n\u003cp\u003eMadison looks relieved. “I thought so. So what are you doing in the middle of the city?”\u003c/p\u003e\n\u003cp\u003e“What makes you think I don’t live here? Can’t I enjoy the outdoors but still live in the city? Or am I too uncool for that?” I raise my eyebrow again.\u003c/p\u003e\n\u003cp\u003eShe flushes yet again. “I’m sorry. I guess I just assumed. Where do you live?”\u003c/p\u003e\n\u003cp\u003eI grin. “Here. Just call me a fish out of water.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head and swats at me, but I easily catch her wrist and pull her to me instead. It’s a ballsy move, but I’m feeling cocky. She doesn’t resist, which both pleases and surprises me.\u003c/p\u003e\n\u003cp\u003eShe presses against me, looking into my eyes. She looks expectant and nervous, confident yet hesitant. Her tits are smashed against me, making it hard to form coherent thoughts, hard to examine our differences or even her motives. Her softness is the perfect contrast to my hardness. That’s all I can think about.\u003c/p\u003e\n\u003cp\u003e“To answer your question, I’m here at the club because my little sister thought I should come out and meet someone. To quote her, I’m ‘getting mean as hell and need a piece of ass.’ ”\u003c/p\u003e\n\u003cp\u003eMadison laughs, a low and husky sound.\u003c/p\u003e\n\u003cp\u003e“Do you? Need a piece of ass?”\u003c/p\u003e\n\u003cp\u003eShe sounds anxious. And interested.\u003c/p\u003e\n\u003cp\u003eI hold her gaze.\u003c/p\u003e\n\u003cp\u003e“More than you can imagine.”\u003c/p\u003e\n\u003cp\u003eI slide my hands from her back down to her ass, cupping it, squeezing it.\u003c/p\u003e\n\u003cp\u003e“And I like yours,” I add. I’m being cocky again, but she seems to like it.\u003c/p\u003e\n\u003cp\u003eShe practically purrs as she leans into me even closer, her nose almost touching mine. Her lips hover so close that I can feel them.\u003c/p\u003e\n\u003cp\u003eShe slides her hands down to my ass, gripping it in her fingers.\u003c/p\u003e\n\u003cp\u003e“Yours will do.”\u003c/p\u003e\n\u003cp\u003eThe air hangs heavy between us, charged and electric. Our eyes are locked and we each pause, waiting for the other to make a move.\u003c/p\u003e\n\u003cp\u003eThe anticipation is killing me.\u003c/p\u003e\n\u003cp\u003eI take a breath.\u003c/p\u003e\n\u003cp\u003eThen she takes one.\u003c/p\u003e\n\u003cp\u003eHer lips graze mine and her mouth smells like mint. And then before I can think another agonizing thought, she covers my mouth with her own.\u003c/p\u003e\n\u003cp\u003eFinally.\u003c/p\u003e\n\u003cp\u003eHer tongue slips into my mouth and she tastes like Heaven, like an icy drink of water at the end of a hot day in the desert. Our tongues tangle together and her lips consume mine. I find myself instantly rock-hard and she notices.\u003c/p\u003e\n\u003cp\u003eShe smiles against my lips.\u003c/p\u003e\n\u003cp\u003e“I think you liked that.”\u003c/p\u003e\n\u003cp\u003e“What gave me away?” I ask with a grin, wedging myself even tighter against her.\u003c/p\u003e\n\u003cp\u003eMadison grins back and kisses me again. The second kiss is just as consuming as the first. She seems a little bit desperate, a little bit vulnerable. And a whole lot sexy.\u003c/p\u003e\n\u003cp\u003eShe slides her hands back up my spine, wrapping her arms around my neck. As she does, I run my palms along her sides, feeling the skin of her back beneath my fingers.\u003c/p\u003e\n\u003cp\u003e“Remember when I told you that my feet hurt? I’d like to take my shoes off.”\u003c/p\u003e\n\u003cp\u003eI stare down at her. “So take them off.”\u003c/p\u003e\n\u003cp\u003e“At your place,” she adds.\u003c/p\u003e\n\u003cp\u003eI inhale sharply as I grip her hips even tighter.\u003c/p\u003e\n\u003cp\u003e“You don’t have to say that twice.”\u003c/p\u003e\n\u003cp\u003eAnd she doesn’t. I grab her hand and practically drag her toward the street, hailing a taxi.\u003c/p\u003e\n\u003cp\u003eIn less than a minute we have tumbled into the back seat of a cab and we’re speeding toward my apartment.\u003c/p\u003e\n\u003cp\u003eMadison kisses my neck, tugging at my ear with her teeth as her hands skim my chest. “How far away do you live?” \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-leave-beautifully-broken-2/page-2.html","bookId":2759,"creation":"Oct 5, 2019 5:03:51 PM","modification":"Oct 5, 2019 5:03:51 PM"}
