{"id":84934,"no":23,"title":"Page 23","content":"\u003cp\u003eAround us the rain pours down and the thunder rumbles, the electricity in the sky colliding with our energy. It’s a heady combination and I drop to my knees, taking him into my mouth. He’s huge and hard, and I move my lips up his length, letting him slide in past my teeth, down my throat.\u003c/p\u003e\n\u003cp\u003e“Fuck, Madison,” Gabriel groans, his fingers buried in my hair, guiding my speed. “God, that feels so good.”\u003c/p\u003e\n\u003cp\u003eI slide him in and out for a few minutes more, until he pushes me away, grabbing at my shirt and almost ripping it off. The raging heat from our bodies pressed together pools between my legs.\u003c/p\u003e\n\u003cp\u003e“I want you,” I murmur to him. “Right now.”\u003c/p\u003e\n\u003cp\u003e“I want to ask why you’ve changed your mind,” Gabriel says roughly, dipping his head to trail his lips along my neck. “But it doesn’t matter right now. I want to be inside you, Madison. I’m finally going to fuck you and you’re going to like it.”\u003c/p\u003e\n\u003cp\u003eHe pulls on my hand, urging me back toward the house, but I plant my heels.\u003c/p\u003e\n\u003cp\u003e“Here,” I tell him simply. “Right here, in the rain. I want you right now.”\u003c/p\u003e\n\u003cp\u003eGabriel looks sharply at me, but he doesn’t argue. He simply eases me onto the large stone table behind us. It’s cold and wet, but it doesn’t matter.\u003c/p\u003e\n\u003cp\u003eNothing matters but this.\u003c/p\u003e\n\u003cp\u003eHis body covers mine, rubbing against every inch of me, bringing every nerve ending singing to life. He hovers above me now, just as I’ve imagined him hovering above me, waiting to enter me.\u003c/p\u003e\n\u003cp\u003eReality is even better than my imagination.\u003c/p\u003e\n\u003cp\u003eI grasp at his back as he slides his fingers into me again, my muscles flexing as he moves. Everything around us ceases to matter; the wind, the rain… it all fades away and all that I can see is him.\u003c/p\u003e\n\u003cp\u003e“God, you’re so wet,” he rasps into my ear. “And so fucking tight.”\u003c/p\u003e\n\u003cp\u003eHe fingers me softly, then harder. And then he withdraws his fingers. Before I can protest at his absence, I hear a wrapper crinkle and then he slips into me, hard and full.\u003c/p\u003e\n\u003cp\u003eI gasp, then hold on as he thrusts into me.\u003c/p\u003e\n\u003cp\u003eI needed this so much.\u003c/p\u003e\n\u003cp\u003eI needed him and I didn’t even realize it.\u003c/p\u003e\n\u003cp\u003eMy legs wrap around him, pulling him to me, as close as he can possibly get.\u003c/p\u003e\n\u003cp\u003eIntimate feelings, strange and foreign feelings, threaten to overwhelm me as I clutch him to me, as I absorb his warmth, his vitality, his scent.\u003c/p\u003e\n\u003cp\u003eEverything about this moment is exactly what I need, even if I can’t define what I’m feeling, or why I’m feeling it. All my sadness, all my worry, all my fear culminate and explode in this moment. It makes everything blurry, makes everything happen so fast. I just want to take and take and take… everything he has to give.\u003c/p\u003e\n\u003cp\u003eGabriel reaches between us and, using his thumb, brings me to climax a scant moment later.\u003c/p\u003e\n\u003cp\u003e“God, you’re beautiful,” he tells me raggedly, still thrusting into me, filling me up. His strength is apparent as he moves against me, every muscle flexing with every movement.\u003c/p\u003e\n\u003cp\u003eHe pulls my leg up and over his shoulder, deepening his penetration. I call out, scratching into him, holding tight; and then he shudders with his own release a minute later.\u003c/p\u003e\n\u003cp\u003eHe collapses onto me, holding me close as we recover.\u003c/p\u003e\n\u003cp\u003e“Holy shit,” he finally says, after a few minutes. “That was incredible.”\u003c/p\u003e\n\u003cp\u003eMy chest almost hurts from the feeling of completion that is filling it. I reach out and slide my fingers along Gabe’s jawline, along the stubble that always lingers there and turns me on.\u003c/p\u003e\n\u003cp\u003e“It was,” I agree. “Except for the rain. I didn’t care about it a few minutes ago, but now…” My voice trails off as my teeth start to chatter.\u003c/p\u003e\n\u003cp\u003eGabriel sits up and then stands, pulling me to my feet. He hands me my clothes, then gets dressed himself.\u003c/p\u003e\n\u003cp\u003e“Come on,” he tells me, grabbing my hand and pulling me into the house.\u003c/p\u003e\n\u003cp\u003e“What are we doing?” I ask curiously.\u003c/p\u003e\n\u003cp\u003e“Taking a hot shower. That rain is fucking cold.”\u003c/p\u003e\n\u003cp\u003eWe tumble through the door and I lead him to the bathroom, stopping only to let the shower water get hot. Gabriel turns to me and helps me into the shower, and then lathers up his hands, running them over my back.\u003c/p\u003e\n\u003cp\u003e“You’re so beautiful,” he whispers into my ear. “You have no idea how much I think about you.”\u003c/p\u003e\n\u003cp\u003eHe does? That thought makes my heart race.\u003c/p\u003e\n\u003cp\u003eGabriel drops to his knees and lathers his hands again, paying close attention to my thighs, then to the crevices behind my knees. When his soapy hands slip to the apex of my thighs, I inhale sharply and watch him smile.\u003c/p\u003e\n\u003cp\u003e“Do you like that?” he asks knowingly. He rinses his hand, then slips a finger into me. I nod and another finger slips in. I squeeze my eyes shut.\u003c/p\u003e\n\u003cp\u003e“Open your eyes, Maddy,” he tells me. “I want to see you when I do this.”\u003c/p\u003e\n\u003cp\u003eThe idea of being vulnerable right now while I’m so exposed makes me nervous, but Gabe doesn’t give me the time to think about it. He pushes me back onto the ledge of the shower, and then, while I watch, he detaches the shower nozzle. He rinses away the water, then holds the nozzle between my legs.\u003c/p\u003e\n\u003cp\u003e“What… the… hell…” I murmur in amazement as waves of pleasure ripple through me, buoying me up, teetering me on the edge of another orgasm.\u003c/p\u003e\n\u003cp\u003eI close my eyes again, allowing myself to give in to the pleasure, to the sinfully good sensations stemming from the water hitting me at just the right angle. I’m self-conscious and nervous that Gabe is watching me, but it feels so freaking good that I can’t help but to just let him do it. If I protested, he might stop. And there’s no way I want that.\u003c/p\u003e\n\u003cp\u003e“That’s it, sweetheart,” he murmurs into my neck. “Let yourself go. Relax.”\u003c/p\u003e\n\u003cp\u003eSo I do. I just focus on the building waves of my orgasm. And just when I am grabbing at the shower wall, almost ready to come, Gabriel pulls the shower nozzle away and replaces it with his tongue.\u003c/p\u003e\n\u003cp\u003e“Holy fuck,” I practically scream, as I shudder against him. My legs go weak with the strength of my orgasm and I hold tight to Gabriel so my knees don’t give out.\u003c/p\u003e\n\u003cp\u003eHis face is clouded, his eyes slightly unfocused as he pulls me up and flips me over. I see him reach for his wallet and there is another rustle of foil. Then without another word he slips inside me from behind, thrusting harder and harder.\u003c/p\u003e\n\u003cp\u003eEven though I already came once, the sensations start building again. He wraps his hand around and moves his fingers against me too. I moan, my hands slipping down the wet wall in front of me, my cheek resting against the wall.\u003c/p\u003e\n\u003cp\u003e“Your ass is amazing,” Gabriel murmurs, his lips resting against my shoulders. “Tell me what you want, Madison. Tell me.”\u003c/p\u003e\n\u003cp\u003eI breathe in, then breathe out, slowing down the moment.\u003c/p\u003e\n\u003cp\u003e“I want you to come,” I finally tell him, loving how he fills me up. “I want to know you like it.”\u003c/p\u003e\n\u003cp\u003eHe groans as he thrusts again. “Oh, trust me. I fucking love it.”\u003c/p\u003e\n\u003cp\u003e“So come then,” I tell him. “Show me how much you love it. I want to feel it.”\u003c/p\u003e\n\u003cp\u003eHe moves his hands to my hips now, clutching tightly there, his fingers digging into my skin as he moves. Rhythmically, he moves with me until he finally sucks in a breath and pulses into me. I can feel the heat spreading into the condom and I close my eyes, enjoying it.\u003c/p\u003e\n\u003cp\u003eWe stay that way with the water beating down on us for several minutes, before Gabriel straightens up and rinses us off. We step out of the shower and as I’m drying off, Gabriel looks at me.\u003c/p\u003e\n\u003cp\u003e“I could use some coffee. Can I go make some?”\u003c/p\u003e\n\u003cp\u003eI nod. “Of course. The kitchen is… well, you know where it is. We came in through the kitchen door.”\u003c/p\u003e\n\u003cp\u003eGabriel ducks out and I join him in the kitchen after I’ve gotten dressed. He’s still shirtless, maneuvering about the kitchen with ease. The smell of coffee percolating is already filling the air and I watch as Gabriel finds two cups, filling them both. He sips at one, then dumps sugar and cream in the other, simply assuming that I want it. And he’s right. That’s exactly how I take it.\u003c/p\u003e\n\u003cp\u003eHe sets a cup in front of me and then sits down across from me at the table.\u003c/p\u003e\n\u003cp\u003eThe air between us has cleared, the frenzied sexual tension is gone. The need, however, remains… only it’s quiet now, latent.\u003c/p\u003e\n\u003cp\u003eWaiting.\u003c/p\u003e\n\u003cp\u003eGabe stares at me. “Are you going to tell me what that was all about?”\u003c/p\u003e\n\u003cp\u003eI think about my poor sister, huddled in her bed back at the hospital. I think about the possibility that I could lose her. I think about the fact that I’m always afraid and the only time I’ve not been afraid in as long as I remember was a few minutes ago when I was wrapped in his arms. I think of all of that.\u003c/p\u003e\n\u003cp\u003eAs I do, my eyes well up again, against my will. I hate to cry. And I’ve never been a crier. Until today, apparently.\u003c/p\u003e\n\u003cp\u003e“I’ve just had a bad day,” I manage to say without crying. But my throat is hot and tight, and I know that if I keep talking, I’m going to lose it.\u003c/p\u003e\n\u003cp\u003e“Apparently,” Gabriel replies drily, thoughtfully. “And did I manage to make it better?”\u003c/p\u003e\n\u003cp\u003eI give him a weak smile and then sip at my coffee. I don’t answer because I think he already knows.\u003c/p\u003e\n\u003cp\u003e“Is this decaf?” I ask instead.\u003c/p\u003e\n\u003cp\u003eHe nods. “Yeah. I didn’t know if it’d be hard for you to sleep otherwise.”\u003c/p\u003e\n\u003cp\u003eIt’s surprisingly thoughtful, something that just closes my throat up even more.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I utter, before a tear escapes.\u003c/p\u003e\n\u003cp\u003eGabriel looks at me in alarm. “Madison, I swear to God. Just tell me what is wrong. Seriously.”\u003c/p\u003e\n\u003cp\u003eI sigh and stare at my hands, then slowly look back up at him. Where should I begin? I decide to start with the only thing I can easily explain.\u003c/p\u003e\n\u003cp\u003e“My sister might lose her baby.” The mere words are terrifying and they catch in my throat. “And if she’s not careful, she could die, too.”\u003c/p\u003e\n\u003cp\u003e“Jesus,” Gabriel mutters.\u003c/p\u003e\n\u003cp\u003eI nod shakily. “She and Pax have been through so much and now they have this to deal with. It’s not fair.”\u003c/p\u003e\n\u003cp\u003eGabriel looks at me seriously, his eyes softening.\u003c/p\u003e\n\u003cp\u003e“I’m so sorry,” he says quietly. “I’m not going to tell you all the bullshit about life not being fair. I’m sure you know that already. What I will say is that I’m sure your sister will be OK. She’s strong and I’m sure she’ll do whatever the doctors tell her to do.”\u003c/p\u003e\n\u003cp\u003eI nod limply. “She will. It’s just… you don’t understand. Our parents died when she was a senior in college. I had just graduated. All of a sudden, it was just the two of us and it was so hard. I grew up in a hurry. I had to be the rock in our little family. Everything was always all right because I made it that way… but I can’t fix this for her. It’s out of my hands and I hate it.”\u003c/p\u003e\n\u003cp\u003eMy vision blurs as my eyes well up with hot tears, and one drips onto my thumb.\u003c/p\u003e\n\u003cp\u003eGabriel reaches across the table and wipes my thumb off before enclosing my hand within his. His is large and rough and I imagine it got that way from his being a soldier.\u003c/p\u003e\n\u003cp\u003e“It’s OK to cry,” he tells me. “Even the strongest do it.”\u003c/p\u003e\n\u003cp\u003eI break down at his words, at the soft expression on his hardened face. My head drops to the table and I weep uncontrollably.\u003c/p\u003e\n\u003cp\u003eAt some point Gabriel rounds the table and kneels in front of me, pulling me against his chest. His strong hands pat my back and stroke my arms and I cry until there’s nothing left. \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-leave-beautifully-broken-2/page-23.html","bookId":2759,"creation":"Oct 5, 2019 5:03:51 PM","modification":"Oct 5, 2019 5:03:51 PM"}
