{"id":84944,"no":33,"title":"Page 33","content":"\u003cp\u003eMy head drops into my hands.\u003c/p\u003e\n\u003cp\u003e“Now do you see?” I ask her. My throat is so dry that it’s hard to speak. “Do you see? This is why you can’t sleep with me. This is why you shouldn’t be with me.”\u003c/p\u003e\n\u003cp\u003eShe shakes her head and pulls at me, clutching, and now I’m practically sprawled in her lap. Her breathing is quick and mine is ragged as we try to calm down, as we both try to process it.\u003c/p\u003e\n\u003cp\u003e“Tell me what happened,” she says bluntly. “Tell me the rest. Please. I’m trying to stay calm here, but I’m sort of freaking out. I need to understand.”\u003c/p\u003e\n\u003cp\u003eA flash of the little girl’s face pops into my mind, dark-eyed and terrified. All the bodies, all the blood, the smell of the burning flesh. The smoke.\u003c/p\u003e\n\u003cp\u003eChrist.\u003c/p\u003e\n\u003cp\u003eI squeeze my eyes shut, but it’s all still there. It’s still haunting me and I know it always will.\u003c/p\u003e\n\u003cp\u003eI open my eyes and glance at Maddy. She waits expectantly, one hand against her throat. I gulp.\u003c/p\u003e\n\u003cp\u003e“The night that our Humvee exploded,” I begin roughly. “It was so dusty, dusty as fuck. We could barely see our hands in front of our faces and the darkness didn’t help anything. I was talking to Brand, keeping an eye on the horizon, when a movement caught my eye. Something made the hair on the back of my neck stand up. I knew it was something bad. And it was.”\u003c/p\u003e\n\u003cp\u003eI pause for a second and the silence yawns between us.\u003c/p\u003e\n\u003cp\u003e“What was it?” Maddy whispers, her face pale, hesitant. She doesn’t want to know, but yet she does. She needs to know and I have to tell her. She deserves that much.\u003c/p\u003e\n\u003cp\u003eI want to squeeze my eyes shut, wanting nothing more than to block the memory out, but of course I don’t.\u003c/p\u003e\n\u003cp\u003e“It was a little girl. She was coming out of the shadows. I had to focus to see her face and when I did, I saw how terrified she was. And then I saw why. She had a bomb strapped to her chest.”\u003c/p\u003e\n\u003cp\u003eMaddy gasps, then freezes, her hands stilled on her throat as she waits for me to continue.\u003c/p\u003e\n\u003cp\u003e“If she detonated that bomb, Maddy, I knew it would tear us all apart. I knew that, but I hesitated anyway. I didn’t want to kill a kid.” I pause and swallow hard.\u003c/p\u003e\n\u003cp\u003eI can hear my tongue moving against the side of my teeth because my mouth is so dry.\u003c/p\u003e\n\u003cp\u003e“I watched her for a second—only a second—waiting to see what she would do. I was frozen, Maddy. Every bit of my training was suspended in my mind, because she was just a fucking kid. I saw her little fingers holding the detonator. I saw them shaking. And I knew she didn’t want to push that button.”\u003c/p\u003e\n\u003cp\u003e“What did you do?” Maddy asks woodenly, although I can see in her eyes that she already knows.\u003c/p\u003e\n\u003cp\u003eI swallow, the memories burning me.\u003c/p\u003e\n\u003cp\u003e“I watched her through the sight on my rifle. I yelled out for her to stop. And she looked up at me. Her eyes were begging me. Begging. Black as night and full of fear. Terror. And I knew in that second that she was more afraid of whoever strapped that bomb to her chest than she was afraid of dying. I knew she was going to do it. Her finger twitched and I pulled the trigger.”\u003c/p\u003e\n\u003cp\u003eI squeeze my eyes shut, trying not to visualize my memories, trying not to remember the horrible smell in the air that night.\u003c/p\u003e\n\u003cp\u003eThe blood.\u003c/p\u003e\n\u003cp\u003e“Everything exploded. Everything. I couldn’t see. I couldn’t feel. I couldn’t think. I crawled through the smoke and the dust and when I found Mad Dog, he was dead. His legs were gone and his insides were all lying on the outside, on the ground beside him. There was so much blood. I could taste it in my mouth. I can still taste it in my mouth. Every night, over and over.”\u003c/p\u003e\n\u003cp\u003e“The girl?” Maddy whispers.\u003c/p\u003e\n\u003cp\u003e“The girl… she was in pieces. I found her head. I can’t get the look in her eyes out of my mind. Her eyes were still begging me to help and I couldn’t. I’m never going to get away from it.”\u003c/p\u003e\n\u003cp\u003eMadison stops breathing as she stares at me in horror. “Oh my God. Gabe. Why didn’t you tell me about this? This is… I… it’s horrible. God.”\u003c/p\u003e\n\u003cp\u003eI close my eyes again.\u003c/p\u003e\n\u003cp\u003eWhen I do I see the girl’s face again, frozen in that moment. Dark skin, dark eyes filled with fear as I shot her, right before everything exploded. Right before everything froze, keeping me there with her forever.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eMaddy still looks horrified, but her fingers are moving again, brushing comfortingly against me, soothing me in spite of her horror.\u003c/p\u003e\n\u003cp\u003e“You didn’t kill her, Gabe. Whoever strapped that bomb to her chest did. Not you. You did the only thing you could.”\u003c/p\u003e\n\u003cp\u003e“You didn’t see her face,” I tell her raggedly. “But I did. Right before she exploded, she looked at me and everything froze. It was just her and me. We were connected through the lens of my rifle. She needed my help, but I shot her instead. I’ll see it every night until I die. I can’t forget her face.”\u003c/p\u003e\n\u003cp\u003eMy voice breaks and Maddy’s fingers trail down my face, down my neck, over my back. Her voice spills out in broken whispers, empty words, because she can’t fix me and she knows it. There’s nothing she can say to fix me.\u003c/p\u003e\n\u003cp\u003eI’m the bad thing. And now she knows it.\u003c/p\u003e\n\u003cp\u003e“Gabe, this wasn’t your fault. It wasn’t your fault.” She says it over and over and over. “Gabe… God.”\u003c/p\u003e\n\u003cp\u003e“God didn’t have anything to do with this,” I tell her wearily. “Trust me. He turned his back on that shit a long time ago. And I haven’t told you everything yet.”\u003c/p\u003e\n\u003cp\u003eMadison freezes, stricken, her fingers halting their movement on my back, her breath lingering on her lips in horror. “You haven’t?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “No. I haven’t told you the worst part.”\u003c/p\u003e\n\u003cp\u003eMaddy closes her eyes.\u003c/p\u003e\n\u003cp\u003e“The little girl was a distraction. They bombed my Humvee to distract us from what they really wanted us to see. They wanted us to see it, but not get there in enough time to stop it.”\u003c/p\u003e\n\u003cp\u003eI close my eyes, trying not to see it all again. All the little bodies, all the mothers’ bodies thrown over their children, all the blood. All the death.\u003c/p\u003e\n\u003cp\u003eI swallow.\u003c/p\u003e\n\u003cp\u003eThen swallow again, tasting the horror all over again.\u003c/p\u003e\n\u003cp\u003e“Taliban rebels wanted to intimidate a nearby village into supporting their insurgent movement. When nothing else worked, they rounded up most of the village’s women and children and slaughtered them in front of the village men. They spared the boys… so that they could turn them into insurgents. Everything else was burned.”\u003c/p\u003e\n\u003cp\u003eThe bedroom is as quiet as a grave, the only noise being Maddy’s harsh breaths. Her eyes are wide, her hands are clutched in her lap so tightly that her knuckles are white.\u003c/p\u003e\n\u003cp\u003e“Gabe,” she says limply, but whatever else she was going to say dies on her lips. I stare into her eyes.\u003c/p\u003e\n\u003cp\u003e“I should’ve done my job and shot the little girl, Maddy. I shouldn’t have hesitated. But because I did, hundreds of girls and women died that night. When that bomb went off, it signaled the insurgents that we were close, that it was time to slaughter those people. Letting that bomb go off gave them time to do it before we got to them. If only I’d shot the girl. It would’ve stopped the bomb… stopped the slaughter… stopped everything.”\u003c/p\u003e\n\u003cp\u003eMy voice breaks and my head drops into my hands. My eyes are burning so much that I can’t hold them open anymore.\u003c/p\u003e\n\u003cp\u003e“They burned them, Maddy. They burned the bodies. They even burned the ones who weren’t dead yet. I tasted their bodies in the air. I’ll never forget that taste. Or the smell. Or the sounds of the fathers wailing. I’ve never heard men screaming like that. It was… brutal and inhumane and sadistic. And it was my fault.”\u003c/p\u003e\n\u003cp\u003eI keep my eyes squeezed closed against the terrible memories. The sights, the smells, the sounds. The tiny blood-spattered hands. The burned flesh. The lifeless eyes. The horrible screams.\u003c/p\u003e\n\u003cp\u003e“I’ve never heard men screaming like that,” I repeat limply.\u003c/p\u003e\n\u003cp\u003eI fight the urge to heave, even now, my stomach quaking as it rebels against me.\u003c/p\u003e\n\u003cp\u003eMaddy buries her face into my shoulder, stroking my back.\u003c/p\u003e\n\u003cp\u003e“It wasn’t your fault,” she finally says softly. “You had no way of knowing what was going on, Gabe.”\u003c/p\u003e\n\u003cp\u003eI look at her painfully. “When you asked me if there was any way I could’ve stayed in the Rangers… this is why I couldn’t. You can see now, right? I’m seriously fucked up. I can’t trust myself anymore.”\u003c/p\u003e\n\u003cp\u003eMaddy’s eyes are full of pain as she looks at me helplessly. “Of course you can, Gabe. I trust you.”\u003c/p\u003e\n\u003cp\u003eShe’s so focused on everything I just told her, on how sorry she feels for me, that she has forgotten what I’ve just done to her. I reach out and touch the bruise forming across her throat. She flinches backward, then forces herself to remain still.\u003c/p\u003e\n\u003cp\u003e“I’m a monster, Maddy,” I tell her simply. “It doesn’t matter if I mean to be. I am and that’s enough.”\u003c/p\u003e\n\u003cp\u003e“Don’t say that,” she snaps at me. “You are not. You’re not.”\u003c/p\u003e\n\u003cp\u003eThen why can’t you look me in the eye?\u003c/p\u003e\n\u003cp\u003eI sigh. “Whatever I am, I’m a Ranger, Maddy. I’m trained to kill. And in my sleep, when I relive that night over and over, I’m like a fucking runaway train. It seems so real to me, so fucking real. We can’t know what I’ll do when I think I’m in a life-and-death situation.”\u003c/p\u003e\n\u003cp\u003eThis is why you shouldn’t be with me.\u003c/p\u003e\n\u003cp\u003eShe shakes her head, still not meeting my gaze.\u003c/p\u003e\n\u003cp\u003e“You might’ve been trained to kill, but you were also trained to protect. You’re a protector, Gabe. You were protecting Mad Dog and Brand and the other three Humvees. You were protecting that little girl when you didn’t want to shoot her. You won’t hurt me.”\u003c/p\u003e\n\u003cp\u003e“I already did,” I insist, staring at the bruise on her neck. “And we have no way of knowing if I’ll do it again, Madison.”\u003c/p\u003e\n\u003cp\u003eMy voice is anguished and rough and full of pain.\u003c/p\u003e\n\u003cp\u003e“You won’t,” she says firmly, finally looking me in the eye. The fear is still there, even though she’s trying to ignore it.\u003c/p\u003e\n\u003cp\u003eBecause I taught her that fear is a choice. Fuck.\u003c/p\u003e\n\u003cp\u003e“We can’t know that,” I tell her limply. That’s what I say.\u003c/p\u003e\n\u003cp\u003eYou need to stay far away from me. That’s what I think.\u003c/p\u003e\n\u003cp\u003e“I know it,” she insists, her voice adamant, yet soft and scared. I have to admire her loyalty, even though it’s misplaced in me.\u003c/p\u003e\n\u003cp\u003eI’m suddenly so tired, so very tired. Tired of carrying this weight. Tired of worrying about what I am or what I might do. I’ve already hurt Maddy and that’s the worst possible thing. The only thing I can do now is make sure I never do it again.\u003c/p\u003e\n\u003cp\u003eThe resolve feels good. It gives me something to focus on.\u003c/p\u003e\n\u003cp\u003e“Let’s talk about this in the morning,” I suggest, hating the way those words feel in my mouth. I hate lies. “I want you to rest. This is a lot to take in. And I know your throat must hurt.”\u003c/p\u003e\n\u003cp\u003eI pull her close, lifting her into my arms and holding her on my lap. She’s soft and beautiful and trusting, even as she’s afraid.\u003c/p\u003e\n\u003cp\u003e“You’re not going to stay, are you?” she mumbles. “You’re going to leave just as soon as I’m asleep. You’re never going to stay all night again.” \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-leave-beautifully-broken-2/page-33.html","bookId":2759,"creation":"Oct 5, 2019 5:03:51 PM","modification":"Oct 5, 2019 5:03:51 PM"}
