{"id":84948,"no":38,"title":"Page 38","content":"\u003cp\u003eI squeeze my eyes shut, letting the blackness seep under my eyelids. It would be so easy to let it take the rest of me too.\u003c/p\u003e\n\u003cp\u003e“Tell me that you can stop the nightmares. Tell me that you can save that little girl… that you can save all of those little girls.”\u003c/p\u003e\n\u003cp\u003eBrand’s breath is ragged and rough. “You know I can’t save them. But I can save you, Gabe. Get the fuck off that balcony. We can stop your nightmares.”\u003c/p\u003e\n\u003cp\u003eI’m silent as I open my eyes and stare down, past my feet, past the cars to the ground. It’s a long way down, but it’s there. Brand follows my gaze.\u003c/p\u003e\n\u003cp\u003e“Gabe, I don’t have nightmares much anymore. I swear to Christ. Only once or twice a month. And someday I won’t have any. You just need to get off that ledge and go to therapy like I did. It feels stupid and terrible and dumbass, but it helped me, Gabe. And it will help you. It’s a whole hell of a lot better than this.”\u003c/p\u003e\n\u003cp\u003eBetter than dying.\u003c/p\u003e\n\u003cp\u003eI glance over my shoulder at him. “Because this is the easy way out?”\u003c/p\u003e\n\u003cp\u003eBrand stares at me, his eyes a steely blue, determined. “You said that you’re too much of a pussy to fix it. This is being a pussy, Gabe. Maybe not for some people—because who am I to judge people I don’t know? But I know you. And this is being a pussy for you. Do the hard thing and get your ass off that balcony.”\u003c/p\u003e\n\u003cp\u003eI exhale, long and slow, contemplating.\u003c/p\u003e\n\u003cp\u003eI don’t want to die. If I die, the bad thing wins.\u003c/p\u003e\n\u003cp\u003eFuck that.\u003c/p\u003e\n\u003cp\u003eI take a breath, then grab Brand’s outstretched hand.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-One\u003c/p\u003e\n\u003cp\u003eMadison\u003c/p\u003e\n\u003cp\u003eGabriel isn’t coming back.\u003c/p\u003e\n\u003cp\u003eI know that now. It’s been a week.\u003c/p\u003e\n\u003cp\u003eSeven days.\u003c/p\u003e\n\u003cp\u003eOne hundred and sixty-eight hours.\u003c/p\u003e\n\u003cp\u003eI don’t know where he is and I doubt I’ll ever see him again. It’s a thought that I can’t think about or it will crush me. It still hurts that much.\u003c/p\u003e\n\u003cp\u003eInstead I focus on pretending that I’m fine for Jacey and Tony, Mila and Pax. Today Jacey brings me a cup of hot chocolate. Because hot chocolate obviously fixes everything.\u003c/p\u003e\n\u003cp\u003eCurling up across the table from where I’m rolling flatware into napkins, she glances at me.\u003c/p\u003e\n\u003cp\u003e“I haven’t heard from him either, by the way. He probably knows I’m going to bitch him out for what he did.”\u003c/p\u003e\n\u003cp\u003eI glance up at her. “Can we not talk about it? Seriously. I just don’t want to think about it.”\u003c/p\u003e\n\u003cp\u003e“OK. That’s fine,” Jacey says quickly. “I just didn’t want you to think that I would hide talking to him from you. I wanted you to know that he hasn’t called.”\u003c/p\u003e\n\u003cp\u003eI nod, folding another napkin. “Thanks, Jace. I’m sorry for being bitchy. I just… I’m not myself.”\u003c/p\u003e\n\u003cp\u003e“It’s OK.”\u003c/p\u003e\n\u003cp\u003eWe sit in silence until the door opens, sunlight flashes on the floor and then Jacey’s face lights up.\u003c/p\u003e\n\u003cp\u003e“Brand!”\u003c/p\u003e\n\u003cp\u003eShe jumps up and runs across the room like she hasn’t seen him in a year. I suck in a breath, not sure if I’m ready to face Gabe’s best friend. Seeing him will just punch me in the gut—make me remember Gabriel. As if I’ve forgotten.\u003c/p\u003e\n\u003cp\u003eI don’t turn around, I just keep rolling the silverware, my eyes glued to the task in front of me. But I can hear their low voices and I keep my ears trained in their direction. Brand’s deep voice carries through the restaurant far better than Jacey’s does and I hear it easily.\u003c/p\u003e\n\u003cp\u003e“He’s fine, Jace. He feels guilty, of course, for leaving you… and Madison. But he’s fine. He’s going to get a special kind of therapy, something designed to help victims of PTSD. I went through it back when we first came home. It sucks pretty bad, but it’s effective. He’s going to need your support, though.”\u003c/p\u003e\n\u003cp\u003eI hear the sound of Jacey’s voice, but I can’t hear her words.\u003c/p\u003e\n\u003cp\u003eBrand answers whatever she said.\u003c/p\u003e\n\u003cp\u003e“I knew you’d understand. PTSD is terrible, Jace. It’s something we can’t control and guys like Gabe and me… well, it’s hard to deal with something like that. He needs all the support you can give him. He’s going to be at Walter Reed this week but he wanted me to check in on you, to make sure that Jared’s still leaving you alone.”\u003c/p\u003e\n\u003cp\u003eJacey murmurs something.\u003c/p\u003e\n\u003cp\u003e“What the fuck? Why would you do that, Jacey?”\u003c/p\u003e\n\u003cp\u003eBrand seems annoyed now and I can’t imagine what Jacey said to him.\u003c/p\u003e\n\u003cp\u003e“Whatever. Just don’t lie to us again, Jacey. You can tell Gabriel when he’s out. Don’t tell him while he’s there. His attention shouldn’t be split. He needs to concentrate on CPT, all right?”\u003c/p\u003e\n\u003cp\u003eJacey murmurs again.\u003c/p\u003e\n\u003cp\u003e“Trust me, Jace,” Brand continues. “I’ve been there. I know what it’s like. If Gabe has any hope of taking care of this, he’s got to focus on it one hundred percent. You can support the hell out of him when he comes home.”\u003c/p\u003e\n\u003cp\u003eJacey murmurs and then they’re quiet. I’m just getting ready to glance behind me to see if Brand is leaving when his voice pops up by my ear.\u003c/p\u003e\n\u003cp\u003e“Maddy?”\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eI slowly turn, looking up into Brand’s blue eyes. “Hi, Brand. Good to see you.”\u003c/p\u003e\n\u003cp\u003eBut it’s not. It’s really not. Because he’s here and Gabe’s not. And even though that’s irrational, it’s how I feel.\u003c/p\u003e\n\u003cp\u003e“Hey.” He looks as uncomfortable talking to me as I am listening. “I just wanted to say something, if you don’t mind. Gabriel doesn’t know I’m doing this, but I just wanted you to know that he’s a good guy, Maddy. I know it looks like shit that he left the way he did, but I promise you… he didn’t want to. He got it in his head that you needed protecting. From him. That’s the reason he left.”\u003c/p\u003e\n\u003cp\u003eMy eyes sting as I nod.\u003c/p\u003e\n\u003cp\u003e“I figured,” I tell him. “But that doesn’t take away the fact that he left without saying a word. He hasn’t returned my texts or calls. It’s a shitty thing to do.”\u003c/p\u003e\n\u003cp\u003eBrand nods. “I agree. And so does he. I think he can’t trust himself to talk to you. He thinks that if he does, he’ll just come back.”\u003c/p\u003e\n\u003cp\u003e“And would that be so bad?” Even I hear how thin my voice is.\u003c/p\u003e\n\u003cp\u003eBrand shakes his head. “I don’t think so. But Gabe is dead set on keeping you safe. He misses you like hell, though.”\u003c/p\u003e\n\u003cp\u003eMy eyes fill up with tears now, so I nod and look away.\u003c/p\u003e\n\u003cp\u003e“OK,” I finally manage to say. “Thanks for telling me, Brand.”\u003c/p\u003e\n\u003cp\u003eHe puts his hand on my shoulder for a minute and then he’s gone. After a second, Jacey comes back, staring at me in concern.\u003c/p\u003e\n\u003cp\u003e“Are you OK?” she asks quietly. I nod.\u003c/p\u003e\n\u003cp\u003e“Yeah. Are you?”\u003c/p\u003e\n\u003cp\u003e“Yeah. I’m glad Gabe is getting help. Want to tell me what happened to him that fucked him up so bad?”\u003c/p\u003e\n\u003cp\u003eFor a minute I’m tempted. But after thinking about it for a minute I shake my head.\u003c/p\u003e\n\u003cp\u003e“I can’t. That’s his story to tell.”\u003c/p\u003e\n\u003cp\u003e“I figured you would say that,” Jacey sighs.\u003c/p\u003e\n\u003cp\u003e“What was Brand annoyed with you about?” I ask. “What aren’t you supposed to tell Gabe?”\u003c/p\u003e\n\u003cp\u003eJacey actually looks sheepish. “Um. I lied to Gabe about Jared.”\u003c/p\u003e\n\u003cp\u003eI raise an eyebrow. “You what?”\u003c/p\u003e\n\u003cp\u003e“When Gabe first got here, I told him that Jared was still texting me and shit. I lied. He wasn’t. He stopped bothering me after that first night that Gabe got in his face here at the restaurant.”\u003c/p\u003e\n\u003cp\u003eI stare at her, aghast. “Then why in the world would you lie? The whole point was just to get Jared to leave you alone, right?”\u003c/p\u003e\n\u003cp\u003eJacey stares at her hands on the table. “Yeah. I just… I missed my brother, you know? And I thought he’d stay longer if he thought that Jared was still messing with me. Which he did. And then he started dating you, so he stayed anyway. It all worked out.”\u003c/p\u003e\n\u003cp\u003eI shake my head. “Yeah, except Gabe knocked one of Jared’s teeth out because of your lie.”\u003c/p\u003e\n\u003cp\u003eJacey rolls her eyes. “Trust me, he deserved that. He’s an asshole.”\u003c/p\u003e\n\u003cp\u003e“I know,” I murmur absently. I don’t really care about Jared, to be honest. I don’t care about much at all these days.\u003c/p\u003e\n\u003cp\u003eI lug the full bin of newly wrapped flatware to the sidewall and then I retreat into my office, closing the door behind me. I seriously don’t want to deal with people right now.\u003c/p\u003e\n\u003cp\u003eAfter I work on payroll for a while, I click into my e-mail and what I see there sends my heart into my throat.\u003c/p\u003e\n\u003cp\u003eGabriel’s name in my in-box.\u003c/p\u003e\n\u003cp\u003eI’m barely breathing as I click on the message. I barely breathe as I read the words.\u003c/p\u003e\n\u003cp\u003eDear Madison,\u003c/p\u003e\n\u003cp\u003eI’m sorry. I know you think I’m an asshole and I guess I probably am, even more so than you know. It’s been killing me not to talk to you and I’m sure you probably don’t want to hear from me now.\u003c/p\u003e\n\u003cp\u003eBut I wanted you to know that you were right. It wasn’t fair of me to expect you to face your demons when I was unwilling to face my own.\u003c/p\u003e\n\u003cp\u003eSo I just wanted you to know that I’m facing them now.\u003c/p\u003e\n\u003cp\u003eI hope you’re doing alright and that your throat has healed. You have no idea how much it kills me that I did that to you.\u003c/p\u003e\n\u003cp\u003eI don’t know what else to say except I’m really sorry, Maddy. I really am.\u003c/p\u003e\n\u003cp\u003e—Gabe\u003c/p\u003e\n\u003cp\u003eMy breath seems caught in my throat as I stare at the page, at the words that Gabe has written. He signed it simply with his name. Not “Love, Gabe.” He doesn’t mention love anywhere, actually.\u003c/p\u003e\n\u003cp\u003eHe also doesn’t mention the fact that he left me without a goodbye, without an explanation… without anything. He doesn’t mention how he wouldn’t pick up his phone or answer a text. Or even just give me a courtesy e-mail. Even a fucking breakup e-mail would’ve been better than nothing.\u003c/p\u003e\n\u003cp\u003eBut even now he doesn’t give me an explanation.\u003c/p\u003e\n\u003cp\u003eJust a whole lot of “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eYeah, well, I’m sorry too.\u003c/p\u003e\n\u003cp\u003eI’m sorry that I’m in love with someone who doesn’t love me back.\u003c/p\u003e\n\u003cp\u003eChapter Twenty-Two\u003c/p\u003e\n\u003cp\u003eGabriel\u003c/p\u003e\n\u003cp\u003eAfter I’m assigned a room in Walter Reed, I sit staring at the wall.\u003c/p\u003e\n\u003cp\u003eI want to pick up my phone and call Maddy, but I can’t. She never responded to my e-mail.\u003c/p\u003e\n\u003cp\u003eShe doesn’t want to hear from me, apparently.\u003c/p\u003e\n\u003cp\u003eAs I stare at my phone, I am overwhelmed by frustration, by the idea that I’ve been reduced to this… It pisses me off. And when I look in the mirror that is facing me right now, it pisses me off even more to look at myself.\u003c/p\u003e\n\u003cp\u003eMy anger takes over all of a sudden and I see in a blur of red. My ears roar and I punch the wall next to the mirror as hard as I can. There is a crunch as my knuckles connect with the drywall. That felt surprisingly good.\u003c/p\u003e\n\u003cp\u003eA nurse comes running and pokes her head in the door, eyeing me, then the blood dripping from my hand. She raises an eyebrow.\u003c/p\u003e\n\u003cp\u003e“Everything OK, soldier?”\u003c/p\u003e\n\u003cp\u003eI nod calmly. “Everything’s fine. When’s my first session going to be?”\u003c/p\u003e\n\u003cp\u003e“Just a minute. I’ll get some gauze for your hand.”\u003c/p\u003e\n\u003cp\u003eWhile she’s gone I rinse my hand off in the sink, and I’m toweling it dry when she gets back. She steps into the room with her dark hair wrapped into a bun at the nape of her neck, and spotless nursing scrubs, the perfect picture of efficiency. \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-leave-beautifully-broken-2/page-38.html","bookId":2759,"creation":"Oct 5, 2019 5:03:51 PM","modification":"Oct 5, 2019 5:03:51 PM"}
