{"id":84915,"no":4,"title":"Page 4","content":"\u003cp\u003eMy father.\u003c/p\u003e\n\u003cp\u003eMy heart pounds in my ears and memories from long ago flit through my head. Fists and blood and arguments and fear.\u003c/p\u003e\n\u003cp\u003eBut of course Gabriel isn’t my father. And so I force my breathing to slow and my heart to calm down, even as I balance lightly on the balls of my feet, poised to run if I have to. I swallow as Gabriel looks at me.\u003c/p\u003e\n\u003cp\u003e“I hate this,” he tells me. His cheeks are flushed, his eyes are slightly glazed and his hand is still curled into a fist at his side, his knuckles scraped. I eye it and take a step back, because I know what can happen with a fist.\u003c/p\u003e\n\u003cp\u003e“You hate what?”\u003c/p\u003e\n\u003cp\u003eEmotion fills his eyes, something dark, something pained. “I hate the way it controls me.”\u003c/p\u003e\n\u003cp\u003eI definitely feel panicked now. “What controls you?”\u003c/p\u003e\n\u003cp\u003eBut he doesn’t answer. He just walks into his room and drops onto his bed. He’s calm now, quiet. As though he didn’t just punch a hole in the wall.\u003c/p\u003e\n\u003cp\u003eAs though he didn’t just tell me that something controls him.\u003c/p\u003e\n\u003cp\u003eWhat the fuck is wrong with him?\u003c/p\u003e\n\u003cp\u003eIgnoring my still-racing heart, I bend in front of him. I can do this.\u003c/p\u003e\n\u003cp\u003e“Does your head hurt?” I ask him. When he shakes his head, I look into his eyes. His pupils seem the same size. I heard somewhere that if you have a concussion, it makes the sizes of your pupils uneven.\u003c/p\u003e\n\u003cp\u003ePhysically he seems fine. No bumps, no scrapes, no bruises. I stare down at him uncertainly. He stares back, but it’s like he’s not even seeing me.\u003c/p\u003e\n\u003cp\u003eI sigh, long and loud.\u003c/p\u003e\n\u003cp\u003e“Let’s get your shirt and jeans off, at least,” I finally tell him. “Then I’m going to go.”\u003c/p\u003e\n\u003cp\u003eHe stands up obediently and unbuttons his pants, letting them drop to the floor. When he sits back down, I strip his shirt off over his head, then fold down the covers on his bed.\u003c/p\u003e\n\u003cp\u003eHe immediately drops back into it, curling onto his side and closing his eyes.\u003c/p\u003e\n\u003cp\u003eAs I cover him up, I can’t help but glance at his body. It’s sculpted and cut, and it’s apparent that he works out. A lot. He has the body of a triathlete. Or Olympian. Or Greek god, maybe. He’s got a tattoo on his bicep, a skull wearing a beret over a pair of crossed swords. Words are scrolled above and below it. “Death Before Dishonor.”\u003c/p\u003e\n\u003cp\u003eHmm. Where would he get that? Is he a marine, maybe? He doesn’t have a marine haircut, though.\u003c/p\u003e\n\u003cp\u003eI sigh again. This whole turn of events is so unfortunate. If I was gonna have a one-night stand, this was clearly the guy to do it with. He’s freaking hot.\u003c/p\u003e\n\u003cp\u003eAt this exact moment he moans and thrashes, throwing off the covers as he mutters into his pillow.\u003c/p\u003e\n\u003cp\u003eHe’s also apparently crazy because something controls him. God. Just my luck. I meet a hot guy who hears voices or some shit. Or he hit his head and he’s just delirious.\u003c/p\u003e\n\u003cp\u003eI shake my head as I pick up the covers and pull them back up over him.\u003c/p\u003e\n\u003cp\u003eI take in his clenched jaw and furrowed brow. One part of me wants to call an ambulance to be on the safe side. But another part of me thinks it’s not my place to do that, especially since I don’t know if he needs it. I don’t even know if he has insurance.\u003c/p\u003e\n\u003cp\u003eI honestly just don’t know what to do.\u003c/p\u003e\n\u003cp\u003eFinally I decide that I’ll hang around for a just a little while, to see if he gets any worse.\u003c/p\u003e\n\u003cp\u003eIt’s the least I can do. I wouldn’t feel right otherwise. If he wakes up and acts dangerous, I can be out of here in half a minute.\u003c/p\u003e\n\u003cp\u003eI find the bathroom so that I can pee and it is surprisingly clean for a guy’s bathroom. It’s decorated in various shades of gray, even a gray-tiled floor. There’s no evidence whatsoever of a woman’s touch, so he must be unattached. Or at the very least unmarried. At least he’s not a scumbag like the married guys who troll the clubs for a piece of ass.\u003c/p\u003e\n\u003cp\u003eOut of curiosity I open the medicine cabinet. Q-tips, razor, razor blades, shaving cream, and a bottle of sleeping pills with his name on them. There’s nothing that would suggest that he’s crazy. There’s no psychotropic prescription pills or anything.\u003c/p\u003e\n\u003cp\u003eThat’s good, right?\u003c/p\u003e\n\u003cp\u003eI walk back out into the dining area, looking around with interest. Everything is neat, modern, masculine. On one wall is a mahogany case, as tall as I am. It’s so shallow that it can’t hold much, so it piques my interest. I open it and suck in my breath at the neatly lined-up guns facing me.\u003c/p\u003e\n\u003cp\u003eHoly shit. Is he expecting WWIII? Who in the world would have this many guns? He’s crazy after all. As I’m backing away from it, unreasonably afraid of the guns, a certificate catches my eye. It’s lying on a short stack of paper at the end of the black-and-white granite kitchen counter.\u003c/p\u003e\n\u003cp\u003eI stop and look at it and find that it is actually a diploma, issued a few years ago by the United States Army Ranger School, and it’s got his name on it.\u003c/p\u003e\n\u003cp\u003eGabriel is a Ranger. Or he was one. One or the other. Either way, that explains the amazingly cut body. And the tattoo. And the guns. Thank God. I feel an incredible amount of relief right now… apparently I’m not in the home of a psychopath.\u003c/p\u003e\n\u003cp\u003eUnless he was kicked out for being crazy, which seems like a real possibility at the moment.\u003c/p\u003e\n\u003cp\u003eYikes. I’m suddenly incredibly uncomfortable being here.\u003c/p\u003e\n\u003cp\u003eI walk quickly back down to his bedroom, which is decorated just like the rest of his house—gray tones, dark wood, masculine.\u003c/p\u003e\n\u003cp\u003eHe’s still sleeping and he’s no longer muttering. I stare down at him for a second, watching him breathe.\u003c/p\u003e\n\u003cp\u003eHe seems fine now.\u003c/p\u003e\n\u003cp\u003eFine enough for me to leave him alone without feeling guilty, anyway.\u003c/p\u003e\n\u003cp\u003eBefore I can rethink it I’m out the door, down the stairs and on the street again, breathing in the cool night air. When the doorman waves at me, I walk over to him.\u003c/p\u003e\n\u003cp\u003e“Gabriel isn’t feeling well,” I tell him. “I think he’ll be OK, but maybe someone should check on him later. If you know anyone to call, that would be great.”\u003c/p\u003e\n\u003cp\u003eThe doorman nods and assures me that he’ll take care of it.\u003c/p\u003e\n\u003cp\u003eHis assurance makes me feel slightly better, but I still feel like I’ve been bitch-slapped by tonight. It’s all been so bizarre.\u003c/p\u003e\n\u003cp\u003eBut that’s OK. It’s over now. I just have to make my way back to the club, get my car, and then leave all this weirdness behind me. In a few minutes the crazy hot guy will be a distant memory.\u003c/p\u003e\n\u003cp\u003eGabriel\u003c/p\u003e\n\u003cp\u003eI wake up in a cold sweat.\u003c/p\u003e\n\u003cp\u003eI’m not sure where I am.\u003c/p\u003e\n\u003cp\u003eThis isn’t unusual, so I force my breathing to slow, to regulate. I need to gain my bearings.\u003c/p\u003e\n\u003cp\u003eI glance around, at the gray walls of my stark bedroom, at the white ceiling, at the familiar ceiling fan with the blades that look like large wicker leaves.\u003c/p\u003e\n\u003cp\u003eI’m in my apartment. In my bed. One glance at the clock tells me that four hours have passed since the last time I was conscious.\u003c/p\u003e\n\u003cp\u003eThe problem is, I have no idea how I fucking got here.\u003c/p\u003e\n\u003cp\u003eMy hands are shaky as I reach for the glass of water on my bedside table, swirling the water inside the glass as I force myself to calm, as I try not to remember the nightmare that woke me. I take a gulp and force the blurs of reds and blacks out of my head, even though I know from experience they are unwilling to go.\u003c/p\u003e\n\u003cp\u003eDarkness and blood.\u003c/p\u003e\n\u003cp\u003eThese are two things that will apparently always haunt me. I doubt I’ll ever get a full night’s rest, or that I’ll ever feel comfortable in the dark again.\u003c/p\u003e\n\u003cp\u003eI slump against the pillows, then startle as I remember Madison.\u003c/p\u003e\n\u003cp\u003eThe beautiful girl from the club.\u003c/p\u003e\n\u003cp\u003eWe were on our way here when we were in a car accident. I hold up my hands and look at them, barely able to see them in the dim light streaming through the window. I seem to be fine, nothing on my body hurts, so apparently we weren’t injured. Or I wasn’t, at least.\u003c/p\u003e\n\u003cp\u003eI honestly don’t know about Madison. There’s no possible way I can because I don’t even know how I made it home. I hope she’s all right. But I don’t fucking know. Everything is a black void. All I know for sure is that I’m alone now.\u003c/p\u003e\n\u003cp\u003eI left Madison there, standing next to the twisted, burning wreck of our taxi. Even though I can’t recall much else, I remember the stricken look on her face as she realized that I was leaving.\u003c/p\u003e\n\u003cp\u003eI’m not sure if I’m ashamed of myself or relieved. She was pretty fucking amazing. And pretty fucking hot. But there’s no way she should get mixed up with someone like me, even for only one night. Especially for only one night. I might look normal, but I’m far from it.\u003c/p\u003e\n\u003cp\u003eI think back to Madison’s question in the cab.\u003c/p\u003e\n\u003cp\u003eHow do I know you’re not a crazy person?\u003c/p\u003e\n\u003cp\u003eI almost smile grimly in the dark.\u003c/p\u003e\n\u003cp\u003eI’m not crazy… exactly. The army doctors say I just need time. They call it PTSD. Posttraumatic stress disorder. I call it something else entirely: fucked up.\u003c/p\u003e\n\u003cp\u003eChapter Four\u003c/p\u003e\n\u003cp\u003eMadison\u003c/p\u003e\n\u003cp\u003eI open my bleary eyes, not exactly sure what woke me from my dead sleep.\u003c/p\u003e\n\u003cp\u003eThe lake crashes against the shore outside, but that’s not it. I’m used to that sound since I hear it every night. The rain is slanting against my bedroom windows, but that’s not it either. As I gaze at the ceiling, my phone buzzes, vibrating from my nightstand with a text message.\u003c/p\u003e\n\u003cp\u003eAh, that’s it. Mystery solved.\u003c/p\u003e\n\u003cp\u003eI rub my eyes, glare at the clock (which surely must be wrong because there’s no way it’s that late), then grab the stupid phone.\u003c/p\u003e\n\u003cp\u003eWhere are u? Where did you go last night?\u003c/p\u003e\n\u003cp\u003eStaring at the words, I cringe with guilt.\u003c/p\u003e\n\u003cp\u003eCraaaaaap.\u003c/p\u003e\n\u003cp\u003eJacey. The friend I left at the Underground last night, the friend who just happens to work for me. She’s the best waitress I’ve got, mainly because she’s just the right mix of charm and flirtation. She’s also the best friend I’ve got, mainly because I don’t get close to that many people.\u003c/p\u003e\n\u003cp\u003eI never found her last night and then I completely forgot about her… because I was distracted. My distraction flashes through my head, a vision of Gabriel’s face and muscled body, and my cheeks flush. I quickly put him out of my mind and turn back to my phone.\u003c/p\u003e\n\u003cp\u003eI’m a bad friend, I text her back simply. I’m sorry.\u003c/p\u003e\n\u003cp\u003eWhere did you go????\u003c/p\u003e\n\u003cp\u003eApparently I’m not going to get off that easily. I sigh.\u003c/p\u003e\n\u003cp\u003eRemember when u said I needed to get laid? Well, I almost did. But didn’t. So I came home alone instead. Did you just go home with Peter? I would’ve called, but I knew you wouldn’t hear your phone.\u003c/p\u003e\n\u003cp\u003eGabriel’s face pops unbidden into my head again. The look on his face while we watched that taxi burn was indescribable. Tortured, almost. But that sounds stupid to say.\u003c/p\u003e\n\u003cp\u003eObviously I was in shock too. It’s not every day that you get nailed in an intersection and then your taxi explodes into flames. So of course I was disturbed.\u003c/p\u003e\n\u003cp\u003eBut not to the degree that Gabriel was. For some reason my heart twinges just thinking about it, but I ignore it. I don’t know him and there’s no use wondering what the hell was wrong with him. He’s irrelevant now. I force him out of my thoughts and wait for Jacey to reply.\u003c/p\u003e\n\u003cp\u003eIt only takes her a second.\u003c/p\u003e\n\u003cp\u003eYou should definitely be sorry. I was almost worried. And why didn’t u get some??? Any man would give his left nut to take you home. I’m pretty sure I hate you for that.\u003c/p\u003e\n\u003cp\u003eI have to smile. Jacey wasn’t worried. I’m sure of it. She probably didn’t even realize I was gone until it was time to go home.\u003c/p\u003e\n\u003cp\u003eLong story, I answer. \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-leave-beautifully-broken-2/page-4.html","bookId":2759,"creation":"Oct 5, 2019 5:03:51 PM","modification":"Oct 5, 2019 5:03:51 PM"}
