{"id":84959,"no":49,"title":"Page 49","content":"\u003cp\u003e“What?” I ask curiously. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003eHe looks at me. “Do you remember me telling you that when I was in CPT, I wrote a letter to Ara Sahar’s parents? It was the therapist’s idea and I went along with it. I didn’t really expect much to come out of it because hell—I didn’t even know if her parents were still alive. But the army had it translated into Arabic and they located her parents. They answered me.” He holds up the paper.\u003c/p\u003e\n\u003cp\u003eI can’t read his face, it’s entirely expressionless.\u003c/p\u003e\n\u003cp\u003e“Can I see it?” I ask hesitantly, almost afraid to look.\u003c/p\u003e\n\u003cp\u003eHe nods, handing it to me, and I glance down at the wrinkled letter.\u003c/p\u003e\n\u003cp\u003eDear Lieutenant Vincent,\u003c/p\u003e\n\u003cp\u003eThank you very much for your recent letter.\u003c/p\u003e\n\u003cp\u003eAt first I did not know how to respond because our hearts have been so very broken, into a million tiny pieces. But you are a soldier who came here to help people like me and children like Ara, and so I thought you must surely deserve an answer.\u003c/p\u003e\n\u003cp\u003eEven though putting this pen to this paper hurts my heart, there are several things you should know.\u003c/p\u003e\n\u003cp\u003eYou should know that it wasn’t your fault that my Ara was taken. My country has been torn apart by terrible things, evil things, none of which are your fault or your making. Each day, I would wake, afraid that that day would be the day when something would hurt Ara. Now that it is finally done, I no longer must worry. Nothing can harm her anymore. She’s in Allah’s arms now, safe and warm.\u003c/p\u003e\n\u003cp\u003eYou should know that even in the midst of terrible evil, good flourishes, even still. You are good. You rose above the evil here and fought hard for good. Ara knew that. She used to watch the US soldiers pass and she would say to me, “They’re here to protect us, Mama.” She saw that in you. She saw that in all of you.\u003c/p\u003e\n\u003cp\u003eLieutenant Vincent, you should know that you did not take my daughter from me. Even the evil here did not take her from me because she is not really gone. She is still my daughter and I am still her mama. Love is deathless, you see. And one day, I will be with her again. I will breathe in her hair and her sweet smell and she will smile at me and then I will be whole again. Someday.\u003c/p\u003e\n\u003cp\u003eLieutenant Vincent, you should know that Ara does not blame you. I know that with every breath that is left in me. That is not who my daughter was, that is not who she is. She would wish you nothing but peace. Please do not weep for her. Ara is with angels. I think she is watching over you now, just as you watched over her when you were here. Even if you didn’t know it, or her, you fought for her.\u003c/p\u003e\n\u003cp\u003eShe knew that.\u003c/p\u003e\n\u003cp\u003eLieutenant Vincent, you should know that you cannot hate yourself any longer. It was not your fault. You must forgive yourself.\u003c/p\u003e\n\u003cp\u003eLieutenant Vincent, you should know that I have forgiven you.\u003c/p\u003e\n\u003cp\u003eMay peace be upon you,\u003c/p\u003e\n\u003cp\u003ePashka Sahar\u003c/p\u003e\n\u003cp\u003eMy breath freezes in my throat as tears fall down my cheeks.\u003c/p\u003e\n\u003cp\u003eShe doesn’t blame Gabriel. Even through her veil of overwhelming grief, she has forgiven him.\u003c/p\u003e\n\u003cp\u003eIn my head I picture a little Afghan girl and her grieving mother and all I can do is sit and marvel at Pashka Sahar’s beautiful spirit amid all the ugliness around her. I read her words again and my heart breaks a little bit more with every word.\u003c/p\u003e\n\u003cp\u003e“She forgives you, Gabe,” I tell him softly. “Now you have to forgive yourself. It’s time.”\u003c/p\u003e\n\u003cp\u003eGabe opens his mouth to speak, then closes it and lowers his head onto his arms on the table.\u003c/p\u003e\n\u003cp\u003eThen he weeps.\u003c/p\u003e\n\u003cp\u003eAfter everything we’ve been through, I’ve never seen Gabriel cry.\u003c/p\u003e\n\u003cp\u003eIt breaks my heart and everything from the past few months seems to crash down around us as I pad across the floor and pull him into my arms and onto the floor with me. I cradle him in my lap and let him cry.\u003c/p\u003e\n\u003cp\u003eI know it’s not just the letter that he is crying over. It’s everything. It’s Ara Sahar, it’s Mad Dog, it’s his old life that he has lost, it’s the heavy guilt that he has carried. It’s all of it.\u003c/p\u003e\n\u003cp\u003eIt’s everything that he has never let himself properly grieve for.\u003c/p\u003e\n\u003cp\u003e“Shhhh,” I soothe him, stroking his back. “It’s OK. Let it go, Gabe. Even the strongest cry. A smart person told me that once.”\u003c/p\u003e\n\u003cp\u003eI stroke his strong arms with my fingers, tracing each line and muscle until finally he falls silent and turns over, staring up at me.\u003c/p\u003e\n\u003cp\u003eI dip my head to press my lips against his.\u003c/p\u003e\n\u003cp\u003e“You’re a hero, Gabe,” I tell him. “You really are. You don’t need to carry this anymore. No more guilt, no more sadness. Like Pashka said, you couldn’t have prevented it. Ara wouldn’t want you to carry this burden anymore.”\u003c/p\u003e\n\u003cp\u003eHe flips over and pulls me into his arms.\u003c/p\u003e\n\u003cp\u003e“I love you, Madison Hill,” he tells me. “I’ve never cried before. I should be embarrassed, but I’m not. I love you for not judging my weakness.”\u003c/p\u003e\n\u003cp\u003e“You’re not weak, Gabe,” I answer softly. “You’re far, far from weak. You’re one of the reasons why normal people like me sleep well at night. It’s because we can. You face danger so that we don’t have to. Even little Ara knew that. You think that you’re a bad thing, but you’re not. You protect the rest of us from bad things. You’re badass and lethal and scary, and you’re as far from weak as you can get. You’re a protector, Gabe. My protector.”\u003c/p\u003e\n\u003cp\u003eHe looks stunned, then satisfied. “Thank you,” he says quietly.\u003c/p\u003e\n\u003cp\u003eI nod and we just sit in silence for a while.\u003c/p\u003e\n\u003cp\u003eNothing more really needs to be said. Everything hangs in the air around us, reverent and beautiful and strong. Words aren’t needed for us to feel it.\u003c/p\u003e\n\u003cp\u003eEventually we get off the floor and drink a bottle of wine, quietly enjoying each other’s presence before we finally head to bed.\u003c/p\u003e\n\u003cp\u003eAs we lie in the quiet darkness, emotionally drained and tired, Gabe finally speaks.\u003c/p\u003e\n\u003cp\u003e“Maddy, I’ve been thinking about something. I don’t want to go to Hartford with things as they are.”\u003c/p\u003e\n\u003cp\u003eEvery ounce of my being freezes with his words.\u003c/p\u003e\n\u003cp\u003e“You don’t?” I manage to get out.\u003c/p\u003e\n\u003cp\u003eHe shakes his head. “No. We’ve been through so much shit, Maddy. To hell and back, actually. I don’t want to move to Hartford with you as my girlfriend. I want to move there with you as my wife.”\u003c/p\u003e\n\u003cp\u003eThe world stops again, like it has a hundred times since I met him.\u003c/p\u003e\n\u003cp\u003eI stare at him in the dark, my hand limp on his chest.\u003c/p\u003e\n\u003cp\u003e“You do?” My voice is a whisper.\u003c/p\u003e\n\u003cp\u003e“I do,” he tells me. “Maddy, I know you’re probably scared of marriage because of your parents’. But I can promise you that ours would be as different from theirs as night and day. I will love you every day of my life. Anything that wants to hurt you will have to come through me to do it. Fear is a choice, Maddy. Don’t be afraid of this. Marry me. Please.”\u003c/p\u003e\n\u003cp\u003eMy answer is instant. I don’t even have to think about it.\u003c/p\u003e\n\u003cp\u003e“Yes,” I breathe. “I want to marry you.”\u003c/p\u003e\n\u003cp\u003e“Thank God,” he mutters as he pulls me to him. “I didn’t know how else I was going to convince you if you said no.”\u003c/p\u003e\n\u003cp\u003eI laugh, tracing my fingers along his face, his jaw, his neck.\u003c/p\u003e\n\u003cp\u003e“And you really don’t mind moving to Hartford with me?” I ask, for the fourteenth time this week.\u003c/p\u003e\n\u003cp\u003e“Maddy, I would go anywhere with you.”\u003c/p\u003e\n\u003cp\u003eHis arms tighten around me and I hear the thrumming of his heart, solid and loud. I whisper loud enough that he can hear me over the crash of the lake outside.\u003c/p\u003e\n\u003cp\u003e“Don’t leave me tonight, Gabe. Stay with me all night.”\u003c/p\u003e\n\u003cp\u003eOut of habit he startles at the thought, but then he relaxes and finally nods.\u003c/p\u003e\n\u003cp\u003eA thrill runs through me at his words.\u003c/p\u003e\n\u003cp\u003e“You know what? Maybe it’s time. We can’t get married if we can’t even sleep together, right?”\u003c/p\u003e\n\u003cp\u003eRelief floods through me.\u003c/p\u003e\n\u003cp\u003e“It’s definitely time,” I tell him. I relax, fitting into him perfectly. “But we’re getting married either way.” He chuckles and I drift toward sleep, enjoying the sense of security and love that washes over me in Gabe’s arms.\u003c/p\u003e\n\u003cp\u003eAs sleep overtakes me, I know that I’ll never want to be anywhere else more than I want to be right here with him.\u003c/p\u003e\n\u003cp\u003eNot ever.\u003c/p\u003e\n\u003cp\u003eThe night passes peacefully.\u003c/p\u003e\n\u003cp\u003eWhen I wake in the morning with the sun in my face, I turn to Gabe and find him watching me, his sexy dark eyes thoughtful.\u003c/p\u003e\n\u003cp\u003e“Did you dream?” I ask nervously. He grins, the slow grin that I love, the one that spreads from his lips to his eyes as he shakes his head.\u003c/p\u003e\n\u003cp\u003e“Not one nightmare. I think maybe I’ve kicked that demon’s ass after all.”\u003c/p\u003e\n\u003cp\u003eI reach for him, pulling him to me, enjoying the way his body covers mine. One thing is certainly true, this man is my own personal hero.\u003c/p\u003e\n\u003cp\u003eAs I look into his eyes and see the promises that linger there, I can’t help but think about another truth.\u003c/p\u003e\n\u003cp\u003eFear really is a choice.\u003c/p\u003e\n\u003cp\u003eAnd we both faced ours and won.\u003c/p\u003e\n\u003cp\u003eThere’s nothing to be afraid of anymore.\u003c/p\u003e\n\u003cp\u003eEpilogue\u003c/p\u003e\n\u003cp\u003eOne Year Later\u003c/p\u003e\n\u003cp\u003eArlington, Virginia\u003c/p\u003e\n\u003cp\u003eGabriel\u003c/p\u003e\n\u003cp\u003eThe rows of white headstones seem to go on for miles and miles in the quiet cemetery. But only one matters right now.\u003c/p\u003e\n\u003cp\u003eThe one I’m standing in front of.\u003c/p\u003e\n\u003cp\u003eMarshall Elijah Crane.\u003c/p\u003e\n\u003cp\u003eMad Dog.\u003c/p\u003e\n\u003cp\u003eBrand bends down on one knee, wiping the slight layer of dust from the headstone. Of course it doesn’t say Mad Dog. It spells out his full name and his rank in plain block letters. It doesn’t say anything else about him.\u003c/p\u003e\n\u003cp\u003eIt doesn’t say that he was funny as shit, that he was loyal as hell or that he was scared to die, but faced it with honor anyway.\u003c/p\u003e\n\u003cp\u003eIt doesn’t say any of that.\u003c/p\u003e\n\u003cp\u003e“Hey, dude,” Brand greets him quietly. “How’s it hanging?”\u003c/p\u003e\n\u003cp\u003eI roll my eyes and Madison jabs him in the ribs.\u003c/p\u003e\n\u003cp\u003e“What?” he asks innocently. “I’m not gonna change how I talk to him just because he’s dead.”\u003c/p\u003e\n\u003cp\u003eI hold my hand out to Maddy and she hands me the box.\u003c/p\u003e\n\u003cp\u003e“Why didn’t you tell me what you did?” she asks softly. “Why did you wait until they gave you this medal?”\u003c/p\u003e\n\u003cp\u003e“Don’t feel bad,” Jacey pipes up. “I didn’t know either. I can’t believe he didn’t tell me.”\u003c/p\u003e\n\u003cp\u003eI shake my head. “It wasn’t relevant.”\u003c/p\u003e\n\u003cp\u003eBrand chuckles wryly. “It was relevant to me.”\u003c/p\u003e\n\u003cp\u003eI glance at him and suddenly, instead of seeing him standing tall and proud as he is now, I see him bloody and unconscious. His leg was blown to bits and I had no idea if there was anything else coming for us. I did the only thing I could do.\u003c/p\u003e\n\u003cp\u003eI draped him over my back and I carried him.\u003c/p\u003e\n\u003cp\u003e“Your husband carried me for two miles,” Brand tells Maddy, his voice low. “After the Humvee exploded, Taliban rebels stormed in from the perimeter to kill any survivors. He pulled me out of there and carried me to safety, through the hills and the sand and the smoke. They would’ve killed me if he hadn’t.”\u003c/p\u003e\n\u003cp\u003eMaddy raises an eyebrow and leans into me. “And you never found this important to mention until now? I sounded like an idiot when the Pentagon called to invite you to the awards ceremony. A little heads-up would’ve been nice.”\u003c/p\u003e\n\u003cp\u003eI smile. “I didn’t know they were going to do that. Sorry about that.” \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-leave-beautifully-broken-2/page-49.html","bookId":2759,"creation":"Oct 5, 2019 5:03:51 PM","modification":"Oct 5, 2019 5:03:51 PM"}
