{"id":84916,"no":5,"title":"Page 5","content":"\u003cp\u003eOne beat passes and then she replies.\u003c/p\u003e\n\u003cp\u003eK. My brother never showed up last night, but he’s coming to the Hill tonight to bring me my bday gift. You can meet him then.\u003c/p\u003e\n\u003cp\u003eI smile, which hurts my pounding head. I’m glad she mentioned it. I’d forgotten it was her birthday. Maybe I really am a bad friend.\u003c/p\u003e\n\u003cp\u003eFine, I tell her. You’re not going to let up until I meet him, I know. And I’m bringing you a birthday cupcake.\u003c/p\u003e\n\u003cp\u003eOne pause, then an answer.\u003c/p\u003e\n\u003cp\u003eMy diet doesn’t thank you. But I do!\u003c/p\u003e\n\u003cp\u003eI toss my phone onto the foot of the bed and settle back into my pillow for a second. My head doesn’t hurt because of drinking. I only had one drink last night. It’s pounding because of lack of sleep. I didn’t get in until four thirty a.m. And that’s very unlike me. I glance at the clock again.\u003c/p\u003e\n\u003cp\u003eNine a.m.\u003c/p\u003e\n\u003cp\u003eNormally I would already be at my restaurant, the Hill, by now. But I’m dying from sleep deprivation. If I don’t consume a massive amount of caffeine, I might murder someone later.\u003c/p\u003e\n\u003cp\u003eI throw the covers back on my little double bed, the same one that I had all through high school. I barely spare a glance at the walls covered in old posters and high school news articles. I inherited my childhood home a couple of years ago. One of these days I need to get off my ass and clean this room out.\u003c/p\u003e\n\u003cp\u003eI’m not going to worry about it today, though.\u003c/p\u003e\n\u003cp\u003eToday I just need coffee.\u003c/p\u003e\n\u003cp\u003eI pad down the long hall to the kitchen, where I start the coffee and make a frozen burrito. I sit eating it in my underwear, something I can do since I live alone. My eating habits are shit, which is ironic since I own a restaurant, something else I inherited.\u003c/p\u003e\n\u003cp\u003eAfter two cups of coffee loaded with sugar and cream, I finally feel human again. I take a quick shower, twist my hair into a sloppy bun and throw on a pair of capris, a polo and a sweater before I grab one more cup of coffee on my way out the door.\u003c/p\u003e\n\u003cp\u003eI button my sweater up as I jab at the button that lowers the top on my convertible, my one luxury. Driving with the wind in my hair is the only freedom I really get to experience and since the spring rain has stopped for a minute, I can ride with the top down today.\u003c/p\u003e\n\u003cp\u003eI shift into gear and back out of my driveway, starting down the narrow road that winds along Lake Michigan. It’s a fun little road and I used to love driving it, back before it killed my parents.\u003c/p\u003e\n\u003cp\u003eToday the morning sun is bright and the ground is wet from rain. As the light rebounds from the misty surface of the lake and directly onto the glass of my windshield, I squint while I reach for the volume on my car stereo. The ridged knob slides in my fingers as I crank it up.\u003c/p\u003e\n\u003cp\u003eI almost sigh aloud. That’s better. There’s nothing like coffee and loud music to jar me from sleepiness. I punch at the button to change the satellite radio station as I glance up into the sun.\u003c/p\u003e\n\u003cp\u003eThe light is in my eyes, bright and sharp.\u003c/p\u003e\n\u003cp\u003eI blink, but before I can really refocus, I realize exactly where I am. I’m coming up way too fast on a hairpin curve.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eI gasp and yank on the wheel, spilling hot coffee between my legs as my car veers sharply from the road. Everything seems to happen in slow motion as my car careens into the ditch, skidding sideways at an unnatural angle toward the beach below.\u003c/p\u003e\n\u003cp\u003eI’m almost frozen, blinded by the sun and completely at the mercy of Newton’s laws of motion as my car slides through the mud, the wet grass hitting it in a thumping hiss as the bottom of the hill rushes to meet me.\u003c/p\u003e\n\u003cp\u003eI’m at such an unnatural angle and skidding so fast that I’m afraid for a second that the car is going to roll, but it doesn’t. Instead it slams to an unceremonious stop at the bottom, the wheels halfway buried in the wet sand of the beach. I’m flustered as I try to take deep breaths, yet somehow remain breathless as I sit frozen in shock.\u003c/p\u003e\n\u003cp\u003eHoly shit. What the hell just happened? Was I seriously in my second car accident in as many days?\u003c/p\u003e\n\u003cp\u003eMy hands shake as I look around. I didn’t hit anyone or anything.\u003c/p\u003e\n\u003cp\u003eI’m not hurt.\u003c/p\u003e\n\u003cp\u003eI’m not hurt.\u003c/p\u003e\n\u003cp\u003eI chant this silently to myself as I look around. I’m at the bottom of the incline leading up to the road, in the middle of rocks and grass and sand. I’m so stupid. I’ve driven this road a thousand times. I knew better.\u003c/p\u003e\n\u003cp\u003eEven though my hands are shaking and I can’t breathe, everything’s fine. I’m fine. My car is fine. I’m not my parents. Unlike them, I didn’t die. There is no broken glass or blood. I’m fine.\u003c/p\u003e\n\u003cp\u003eI think.\u003c/p\u003e\n\u003cp\u003eI open the door and step directly down into calf-deep mud.\u003c/p\u003e\n\u003cp\u003eHell. I cringe as I pull my foot back up, glancing at my mud-covered paisley Jimmy Choo wedge. Shoes are my weakness and this one, which had been practically brand-new, is now ruined.\u003c/p\u003e\n\u003cp\u003eEfffffff.\u003c/p\u003e\n\u003cp\u003eAs if that’s not bad enough, I’m surrounded by mud, a result of last night’s thunderstorm. I can’t get out to check my car, but from where I can see, the left front wheel is bent under. I have no idea if it’s even drivable.\u003c/p\u003e\n\u003cp\u003eWith a scowl I press the accelerator and attempt to drive back up the incline, but my car won’t budge. The bent wheel won’t even turn.\u003c/p\u003e\n\u003cp\u003eI’m stuck. Not just stuck, but firmly and completely stuck.\u003c/p\u003e\n\u003cp\u003e“Fuck.”\u003c/p\u003e\n\u003cp\u003eMy head drops to my steering wheel as my fingers reach for my cell phone.\u003c/p\u003e\n\u003cp\u003eWhen my sister comes to my rescue twenty minutes later, she rushes to get to me, picking her way down the wet hill. Her descent isn’t graceful.\u003c/p\u003e\n\u003cp\u003e“I’m fine, Mila. Go back up!” I lean out my window and call out to her. “You’re going to fall and break something, preggo!”\u003c/p\u003e\n\u003cp\u003eShe scowls at me as she walks toward the car, stopping where the mud pools start.\u003c/p\u003e\n\u003cp\u003e“Oh, God. Not you too. Pax will barely let me lift a finger to do anything. You’re a woman. You should know better. I’m pregnant, not an invalid.”\u003c/p\u003e\n\u003cp\u003eI shake my head as I take off my shoes and grab my purse. As carefully as I can, I step from the car, instantly sinking ankle-deep in the mud. I slam my car door closed hard.\u003c/p\u003e\n\u003cp\u003e“Your husband just wants to take care of you,” I remind her grumpily as I slog through the mud toward her.\u003c/p\u003e\n\u003cp\u003eAt seven months pregnant, Mila has that mythical glow about her that few pregnant women actually get. In fact, pregnancy truly agrees with her. She’s always been gorgeous, but now she literally glows. Her long dark hair is lush and shiny, her cheeks pink and flushed, and her skin flawless.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you look so good,” I grumble as I eye her tiny baby bump. “It’s sickening. You’ve barely gained any weight at all.”\u003c/p\u003e\n\u003cp\u003eShe holds out her hand to help me over a rock and laughs.\u003c/p\u003e\n\u003cp\u003e“What? You want me to look hideous?”\u003c/p\u003e\n\u003cp\u003e“Maybe,” I answer with a mock scowl as we carefully make our way to the top of the hill to where Mila’s car awaits. “It’s not fair that you’re prettier than me even while you’re pregnant. Big sisters are always supposed to be hotter. It’s a law of nature. I didn’t make the rules, Mila, but we should definitely follow them. Try to gain a few pounds.”\u003c/p\u003e\n\u003cp\u003eShe laughs again and rolls her eyes as we buckle ourselves in.\u003c/p\u003e\n\u003cp\u003e“You’re crazy, Mad. You’re the model in our family. The only things I have that you don’t are bigger boobs. And you can’t have those.”\u003c/p\u003e\n\u003cp\u003e“Whatever,” I mutter as I flip the visor down and look at myself. “I’m not a model anymore.”\u003c/p\u003e\n\u003cp\u003eI have mud splatters on my forehead. And mud caked almost up to my knees. It drips onto the floor and I sigh.\u003c/p\u003e\n\u003cp\u003e“I’m sorry. You’re going to have to get this thing detailed now,” I tell her apologetically. “I’ll pay for it.”\u003c/p\u003e\n\u003cp\u003e“It’s fine,” she assures me, serious now. “I’m just glad you’re all right. How the hell did this even happen, Maddy? You know how dangerous this road is.”\u003c/p\u003e\n\u003cp\u003eOf course I know.\u003c/p\u003e\n\u003cp\u003eI feel guilty at the worried strain in her voice. I feel guilty that she had to come here, to this particular curve of all places.\u003c/p\u003e\n\u003cp\u003e“I’m OK,” I answer. “I’m sorry, Mi. I didn’t mean to worry you.”\u003c/p\u003e\n\u003cp\u003eShe glances at me. “I know. Just be more careful. I almost had a heart attack.”\u003c/p\u003e\n\u003cp\u003eHer and me both.\u003c/p\u003e\n\u003cp\u003eI lean my head back against my seat, still shaky from sliding down the hill. The aftereffects of the adrenaline rush aren’t being kind to me. My heart is still pounding, my hands and legs still shaking. I stare at the ground from my window and the vehicle is so tall, it’s a long way down.\u003c/p\u003e\n\u003cp\u003e“I still can’t believe Pax made you get this thing,” I chuckle, trying to lighten the mood. “It’s so… not you.” Mila rolls her eyes.\u003c/p\u003e\n\u003cp\u003e“I know. The minute he found out I was pregnant, he went out and bought the safest vehicle he could find. This thing is practically bulletproof. It might actually be a tank in disguise.”\u003c/p\u003e\n\u003cp\u003e“You handle everything so much better than I do,” I tell her. “I would hate being controlled like that.”\u003c/p\u003e\n\u003cp\u003eMila laughs again, shaking her head.\u003c/p\u003e\n\u003cp\u003e“I’m not being controlled. When you’re married, sometimes you have to compromise. And this wasn’t that big of a deal. Yes, my little car got better gas mileage, but it makes Pax happy to think that I’m safer. And besides, I can fit more of my art supplies in here anyway. So there’s an upside.”\u003c/p\u003e\n\u003cp\u003e“You know you don’t have to lug art supplies around anymore,” I tell her, one eyebrow raised. “You don’t have to keep your art shop. Since Pax is taking over his grandpa’s company soon, you’d never have to work again if you didn’t want to.”\u003c/p\u003e\n\u003cp\u003eMila rolls her eyes as she turns onto a city street. The big SUV barely even shudders as she runs over a piece of leftover winter ice.\u003c/p\u003e\n\u003cp\u003e“And you know I’ve got to create art. If I don’t have an outlet for it, I’ll go insane.”\u003c/p\u003e\n\u003cp\u003e“You’re insane already,” I answer. “For agreeing to move to Connecticut.”\u003c/p\u003e\n\u003cp\u003eShe glances at me. “I know. I don’t want to go either. But that’s where Alexander Holdings’ headquarters is at. Pax can’t take over for his grandpa from here. And his grandpa really wants to retire. So it’s something Pax has to do. I’ve got to support that.”\u003c/p\u003e\n\u003cp\u003eI sigh. “Another one of those marriage compromises?”\u003c/p\u003e\n\u003cp\u003eShe nods.\u003c/p\u003e\n\u003cp\u003eI sigh again. “I’ve decided that your marriage isn’t really working for me. You’re going to have to get divorced.”\u003c/p\u003e\n\u003cp\u003eMila bursts out laughing. “Can’t. We have a prenup. I can’t get rich that way.”\u003c/p\u003e\n\u003cp\u003eThis makes me laugh. Mila is the furthest thing from a gold digger I’ve ever seen. And I personally know there wasn’t a prenup.\u003c/p\u003e\n\u003cp\u003eI feel the onset of a tension headache, stemming from my stupid car accident and my stupid lack of sleep. I rub at my forehead before the stupid tension wrinkles become permanent. I scowl because everything is starting to feel stupid this morning.\u003c/p\u003e\n\u003cp\u003eMila notices.\u003c/p\u003e\n\u003cp\u003e“Why are you in such a bad mood?” she asks curiously. “You weren’t hurt. I’m sure you’ve called a tow truck. You’ll have your car back in a bit. No harm, no foul.”\u003c/p\u003e\n\u003cp\u003eI adjust the radio and then settle back into my seat, watching the scenery as Mila turns onto the lakefront drive that houses our restaurant. \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-leave-beautifully-broken-2/page-5.html","bookId":2759,"creation":"Oct 5, 2019 5:03:51 PM","modification":"Oct 5, 2019 5:03:51 PM"}
