{"id":84917,"no":6,"title":"Page 6","content":"\u003cp\u003e“I don’t know,” I admit. “I guess I just woke up on the wrong side of the bed. I didn’t sleep well last night.” I don’t bother telling her why, because she’d just be immediately and insanely interested. She’s been wanting me to go out for months and I don’t want to tell her what a bust it was.\u003c/p\u003e\n\u003cp\u003e“Well, cheer up,” Mila tells me as she pulls into the parking lot of the Hill. “It’s a beautiful day. Life is good.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” I answer grumpily. “Life is good.”\u003c/p\u003e\n\u003cp\u003e“And you’re lucky,” she prompts me. “You could’ve been hurt and you weren’t. You know as well as I do that that road is dangerous.” She’s serious now and I know why. I can practically see the memories in her eyes… of our parents’ twisted car, their funeral, the overwhelming horrible grief.\u003c/p\u003e\n\u003cp\u003eI gulp, then nod.\u003c/p\u003e\n\u003cp\u003e“Yeah, I was lucky. Are you coming in?”\u003c/p\u003e\n\u003cp\u003eShe shakes her head. “Can’t. I’ve got a doctor’s appointment and then I have to get back to my shop. I’ll catch up with you later. I think we’re coming here for dinner.”\u003c/p\u003e\n\u003cp\u003e“ ’K. I’ll save a table for you.”\u003c/p\u003e\n\u003cp\u003e“Perfect. Thanks! Talk to you tonight.”\u003c/p\u003e\n\u003cp\u003eMila waves as she backs the giant black SUV out. I wave back limply. God, I’m going to miss her when she moves. It’s only she and I now. We don’t have any other relatives. Well, we have Pax. So it’s just the three of us.\u003c/p\u003e\n\u003cp\u003eI sigh, but put it out of my mind. They aren’t moving until summer. I’ll worry about it when the time comes.\u003c/p\u003e\n\u003cp\u003eFor now, I head into the little stucco Italian bistro on the shoreline where I’ve spent every waking hour for the past couple of years. The Hill was my parents’ dream, not mine. They worked day and night for years to make it a success and when they died, Mila and I couldn’t bear the thought of closing it.\u003c/p\u003e\n\u003cp\u003eBut I swear to God. Some days, I get so pissed off that I gave up my life for this… that I’m confined to a little lakeside town, living someone else’s dream. There are days when it sucks the lifeblood out of me and I feel so much older than I am.\u003c/p\u003e\n\u003cp\u003eAnd some days I feel so much younger… because I don’t always have the answers to every problem that I face.\u003c/p\u003e\n\u003cp\u003eI have no fricking idea how to run a business. My business degree is a piece of paper. It didn’t prepare me for a business loan, running a staff, or ordering massive amounts of food. But I can never say that out loud, because as a business owner and a big sister, I’m always expected to have answers.\u003c/p\u003e\n\u003cp\u003eThe right ones.\u003c/p\u003e\n\u003cp\u003eNo one needs to know that I really don’t know shit—that I drift along in life without any real answers. No one needs to know that there are times when I seriously hate how things turned out, and that I’m powerless to change it.\u003c/p\u003e\n\u003cp\u003eI sigh and head inside.\u003c/p\u003e\n\u003cp\u003eThe Hill might seem like a prison sometimes, but it’s a prison that pays the bills.\u003c/p\u003e\n\u003cp\u003eOne of the worst things about running a business is all the freaking paperwork and red tape. Sometimes I actually have nightmares that I’m drowning in a sea of paper.\u003c/p\u003e\n\u003cp\u003eToday I barricade myself behind a wall of it, barely lifting my head until Tony, the bartender who has been with our family since my parents opened the place, pokes his unruly head into my office.\u003c/p\u003e\n\u003cp\u003e“Madison, did you get your car all taken care of?”\u003c/p\u003e\n\u003cp\u003eI barely glance up from yesterday’s tickets, which I’m tallying. “Yeah. They’re towing it in and bringing me a loaner to use for the next couple of days.”\u003c/p\u003e\n\u003cp\u003eTony nods. “Good. They’ll get you squared away. For now, though, you’ve got to come eat. I mean it. The dinner rush is going to start soon. You’re going to waste away to nothing and your father will haunt me until the end of time if I don’t take care of you.”\u003c/p\u003e\n\u003cp\u003eI shake my head as I look away from the schedule for next week and into Tony’s concerned face. At forty, he really doesn’t look a day over thirty. But I’ll never tell him that. As a fiery Italian, he has an ego that’s already big enough.\u003c/p\u003e\n\u003cp\u003e“My father wouldn’t be the one haunting you about my eating habits,” I tell him. “It would be my mother. And I don’t think you want to mess with her.”\u003c/p\u003e\n\u003cp\u003eHe laughs and agrees.\u003c/p\u003e\n\u003cp\u003e“For sure. Your mother was a force to be reckoned with. The only one who could really control her was your dad.”\u003c/p\u003e\n\u003cp\u003eI pause for a moment, my fingers frozen on my desk. Tony’s eyes are gleaming with amusement and I know it’s because he has no idea exactly how my father controlled my mother. No one knew.\u003c/p\u003e\n\u003cp\u003eNo one except me and Mila. I swallow hard and smile at Tony, forcing the ugly thoughts out of my head. My parents are dead. There is no reason to think about the past.\u003c/p\u003e\n\u003cp\u003e“I’ll be there in a minute,” I tell him. “I promise.”\u003c/p\u003e\n\u003cp\u003eHe lifts a bushy black eyebrow. “You’d better be. Jacey just clocked in and I made her favorite cherry tarts for her birthday. As far as she’s concerned, it was your idea. You’ve at least got to come have one with her.”\u003c/p\u003e\n\u003cp\u003e“Crap,” I mutter. I look up to meet Tony’s accusing stare. “In my defense, I was going to get her cupcakes on the way to work, but then I almost drove my car into the lake. So I think I get a pass. Don’t judge.”\u003c/p\u003e\n\u003cp\u003eI turn my nose up and he almost grins, but doesn’t because he has a cranky image to uphold.\u003c/p\u003e\n\u003cp\u003eHe turns and saunters away, muttering something about women drivers and whipping me to within an inch of my life if I don’t do what I’m told. I can do nothing but follow him, laughing. He’d never harm a hair on my head and woe to anyone who ever did, because he’d break their kneecaps (mainly because he thinks that’s what an Italian should do).\u003c/p\u003e\n\u003cp\u003eHe leads me to the outdoor patio, which is situated on the beach directly behind the Hill. Stringed lights and lanterns crisscross over our heads, and soon the honeysuckle on the trellises will start to bloom. At night it’s magically romantic out here, particularly with the majestic view of Lake Michigan and the sweet scent of the honeysuckle. Tourists love it and so do I.\u003c/p\u003e\n\u003cp\u003eRight now a tray of Tony’s famous tarts and a birthday card with Jacey’s name on it sit on a table, along with three salads.\u003c/p\u003e\n\u003cp\u003eI turn to him in appreciation. “Thank you, Tony. You know I love you.”\u003c/p\u003e\n\u003cp\u003eHe grins now and wraps a meaty paw around my shoulder, squeezing it.\u003c/p\u003e\n\u003cp\u003e“I know you’re busy,” he tells me gruffly. “It’s not a big deal.”\u003c/p\u003e\n\u003cp\u003eBut it is. He was hired on years ago as the bartender, but since my parents died, he’s helped me in so many different ways. He still tends bar, but he helps me keep everything else in line. He even oversees the cooks and makes special desserts from time to time. I would be lost without him and both of us know it.\u003c/p\u003e\n\u003cp\u003eThe evening breeze is blowing the hair off my face when Jacey bursts through the doors, her brown eyes sparkling in anticipation.\u003c/p\u003e\n\u003cp\u003e“It’s a perfect day to have a birthday,” she announces, and like always, I have to admire her.\u003c/p\u003e\n\u003cp\u003eJacey looks at life with childlike wonderment, something I’ve always loved about her. She can make even the most boring thing fun.\u003c/p\u003e\n\u003cp\u003eWe’ve been friends since we were teenagers. She used to spend the summers here with her grandparents and one day she breezed into the Hill with them for lunch and breezed out with a summer job. She’s been with us every summer since then. She’s fun, she’s carefree, and even though it’s gotten her into trouble from time to time, she’s a refreshing change from the mundane.\u003c/p\u003e\n\u003cp\u003eI cherish that even more now that I am the queen of mundane.\u003c/p\u003e\n\u003cp\u003e“Happy birthday,” I tell her as Tony hands her the card. She grins and opens it, finding a hundred-dollar gift certificate from Tony and me for a massage in town. I mouth Thank you to Tony as Jacey throws her arms around my neck.\u003c/p\u003e\n\u003cp\u003e“Thank you,” she squeals. “You have no idea how stressed out I’ve been. I need this.”\u003c/p\u003e\n\u003cp\u003eShe releases me and hugs Tony, then digs into her tarts, inhaling three of them before she glances at her watch.\u003c/p\u003e\n\u003cp\u003e“We’ve gotta hurry,” she tells us. “We’re booked solid tonight. You’re probably going to have to help out on the floor, Maddy, which is fine because you definitely look comfortable enough. You’re taking business casual to a whole new level.” Jacey looks at my clothes curiously and I sigh.\u003c/p\u003e\n\u003cp\u003e“When don’t I help out on the floor?” I demand. “I’m out there every day. I have the blisters to prove it. And I’m dressed like this because I got all muddy on my way to work and had to change into my gym clothes. ”\u003c/p\u003e\n\u003cp\u003eJacey grins, her eyes sparkling. “Well, with bike shorts and a little bitty T like that, I’m sure the guys will be leaving you big tips. So there’s a plus.”\u003c/p\u003e\n\u003cp\u003eI groan and swat at her before I turn to follow her inside, but Tony snags my elbow and points at my salad.\u003c/p\u003e\n\u003cp\u003e“Eat.”\u003c/p\u003e\n\u003cp\u003eI glance at him and from the look on his face I know it’s useless to argue. I bend and shovel five bites into my mouth.\u003c/p\u003e\n\u003cp\u003e“Good?” I ask with my mouth full as I wipe at it with a napkin.\u003c/p\u003e\n\u003cp\u003eHe gives me a dubious look and I take two more bites before I scoop up my plate.\u003c/p\u003e\n\u003cp\u003e“I’ll eat the rest later,” I promise him. He shakes his head.\u003c/p\u003e\n\u003cp\u003e“No, you won’t,” he sighs. “You’ll go home and eat a frozen burrito.”\u003c/p\u003e\n\u003cp\u003eHe can’t see me grinning as he follows me inside, which is probably a good thing. I absolutely hate being told what to do, which is probably a result of watching my father boss my mother around with his fist for years, but I don’t mind Tony’s fussing.\u003c/p\u003e\n\u003cp\u003eFor all Tony’s gruffness, he’s got a heart of gold, and he tries his hardest to watch out for both Mila and me. He’s the closest thing to family that we have now.\u003c/p\u003e\n\u003cp\u003eAs we walk back into the dining room, we are just in time to meet Mila and Pax coming in the front doors. Pax holds Mila’s elbow as she trips over the doormat.\u003c/p\u003e\n\u003cp\u003eI have to laugh at the stricken expression on his face. I think Pax would pick Mila up and carry her for the next four months if he thought he could get away with it. He’s been more than a little overprotective lately. And as I stare at his tough exterior, it’s so hard to believe that it’s true, but it is.\u003c/p\u003e\n\u003cp\u003eMy brother-in-law is like a rock-hard, tattooed sex god or something. Seriously, the guy exudes sex appeal. My first thought when I first met him was Holy shit, he’s trouble. And he really was.\u003c/p\u003e\n\u003cp\u003ePax grins at me now, his hazel eyes twinkling.\u003c/p\u003e\n\u003cp\u003e“See something you like, Mad?” he teases. And I realize that I’ve been staring. I grin back, not at all chagrined.\u003c/p\u003e\n\u003cp\u003e“Yes, surprisingly enough. I do like you, little brother. Who would’ve thunk it?” Being the protective older sister, I told Mila to stay away from Pax, and of course that made her even more attracted to him. He had that bad-boy thing going on, that cocky attitude and dangerous demeanor that Mila couldn’t resist. Pax’s issues had issues, and he and Mila went through hell and high water together, but they stuck it out.\u003c/p\u003e\n\u003cp\u003ePax shakes his head. “Yeah, it’s hard to believe you ever misjudged this awesomeness.”\u003c/p\u003e\n\u003cp\u003eI roll my eyes and lead them to a table, chatting with them while they get settled. Pax pulls out Mila’s chair and drops her napkin onto her lap for her. \u003c/p\u003e","sourceLink":"https://allnovel.net/if-you-leave-beautifully-broken-2/page-6.html","bookId":2759,"creation":"Oct 5, 2019 5:03:51 PM","modification":"Oct 5, 2019 5:03:51 PM"}
