{"id":63690,"no":26,"title":"Page 26","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe was silent, the sounds of distant traffic and honking the only indication he was still on the line. Then, “Holy shit. Oh, baby girl. That’s bad.”\u003c/p\u003e\n\u003cp\u003eThe compassion in his voice made my throat too tight to speak. I didn’t want to cry any more.\u003c/p\u003e\n\u003cp\u003eThe background noise suddenly muted, as if he’d stepped into someplace quiet. “How is he?” Cary asked.\u003c/p\u003e\n\u003cp\u003e“He’s torn up. God, Cary, it was awful. I think he was crying. And he’s furious with Mom. That’s probably why she’s calling so much.”\u003c/p\u003e\n\u003cp\u003e“What’s he going to do?”\u003c/p\u003e\n\u003cp\u003e“He’s flying out to New York. I don’t know when, but he said he’d be calling when he landed.”\u003c/p\u003e\n\u003cp\u003e“He’s flying out now? Like today?”\u003c/p\u003e\n\u003cp\u003e“I think so,” I said miserably. “I’m not sure how he’s managing to get time off work again so soon.”\u003c/p\u003e\n\u003cp\u003e“I’ll fix up the guest room when I get home, if you haven’t done it already.”\u003c/p\u003e\n\u003cp\u003e“I’ll take care of it. Where are you?”\u003c/p\u003e\n\u003cp\u003e“Catching lunch and a matinee with Tatiana. I had to get out for a while.”\u003c/p\u003e\n\u003cp\u003e“I’m so sorry you’ve been fielding my calls.”\u003c/p\u003e\n\u003cp\u003e“Not a big deal,” he dismissed, in his usual Cary way. “I was more worried than anything. You haven’t been around much lately. I don’t know what you’re doing or who you’re doing. You’re not acting like yourself.”\u003c/p\u003e\n\u003cp\u003eThe note of accusation in his tone deepened my remorse, but there was nothing I could share. “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eHe waited, as if for an explanation, then said something under his breath. “I’ll be home in a couple hours.”\u003c/p\u003e\n\u003cp\u003e“All right. See you then.”\u003c/p\u003e\n\u003cp\u003eI hung up, then called my stepfather.\u003c/p\u003e\n\u003cp\u003e“Eva.”\u003c/p\u003e\n\u003cp\u003e“Hi, Richard.” I dug right in. “Did my dad call Mom?”\u003c/p\u003e\n\u003cp\u003e“Just a moment.” There was silence on the phone for a minute or two, then I heard a door shut. “He did call, yes. It was … unpleasant for your mother. This weekend has been very hard on her. She’s not well, and I’m concerned.”\u003c/p\u003e\n\u003cp\u003e“This is hard on all of us,” I said. “I wanted to let you know that my dad is coming back to New York and I’ll need to spend some quiet time with him.”\u003c/p\u003e\n\u003cp\u003e“You need to talk to Victor about being a little more understanding of what your mother went through. She was on her own, with a traumatized child.”\u003c/p\u003e\n\u003cp\u003e“You need to understand that we’ve got to give him time to come to grips with this,” I shot back. My tone was harsher than I intended, but reflective of my feelings. I was not going to be forced to take sides between my parents. “And I need you to deal with Mom and get her to stop calling me and Cary nonstop. Talk to Dr. Petersen if you have to,” I suggested, referring to my mother’s therapist.\u003c/p\u003e\n\u003cp\u003e“Monica’s on the phone now. I’ll discuss it with her when she’s free.”\u003c/p\u003e\n\u003cp\u003e“Don’t just discuss it. Do something about it. Hide the phones somewhere if that’s what it takes.”\u003c/p\u003e\n\u003cp\u003e“That’s extreme. And unnecessary.”\u003c/p\u003e\n\u003cp\u003e“Not if she doesn’t quit!” My fingers drummed on the coffee table. “You and me, we’re both guilty of tiptoeing around Mom—Oh no, don’t upset Monica!—because we’d rather just give in than deal with her meltdowns. But that’s emotional extortion, Richard, and I’m done paying out.”\u003c/p\u003e\n\u003cp\u003eHe was silent, then, “You’re under a lot of strain right now. And—”\u003c/p\u003e\n\u003cp\u003e“You think?” In my head I was screaming. “Tell Mom I love her and I’ll call when I can. Which won’t be today.”\u003c/p\u003e\n\u003cp\u003e“Clancy and I are available if you need anything,” he said stiffly.\u003c/p\u003e\n\u003cp\u003e“Thank you, Richard. I appreciate that.”\u003c/p\u003e\n\u003cp\u003eI hung up and fought the urge to throw the phone at the wall.\u003c/p\u003e\n\u003cp\u003eI’D managed to calm down enough to go over the Crossroads website before Gideon reappeared from his office. He looked wiped and a bit dazed, which was to be expected, considering. Dealing with my mom when she was upset was a challenge for anyone, and Gideon didn’t have much experience to fall back on.\u003c/p\u003e\n\u003cp\u003e“I warned you,” I said.\u003c/p\u003e\n\u003cp\u003eHe lifted his arms over his head and stretched. “She’ll be all right. I think she’s tougher than she lets on.”\u003c/p\u003e\n\u003cp\u003e“She was stoked to hear from you, wasn’t she?”\u003c/p\u003e\n\u003cp\u003eHe smirked.\u003c/p\u003e\n\u003cp\u003eI rolled my eyes. “She thinks I need a rich man to take care of me and keep me safe.”\u003c/p\u003e\n\u003cp\u003e“You’ve got one.”\u003c/p\u003e\n\u003cp\u003e“I’m going to assume you meant that in a noncaveman way.” I stood. “I have to head out and get ready for my dad’s visit. I’ll need to be home at night for however long he’s here, and it’s probably not wise for you to sneak into my apartment. If he mistakes you for a burglar, it won’t be pretty.”\u003c/p\u003e\n\u003cp\u003e“It’s also disrespectful. I’ll use the time to be seen at the penthouse.”\u003c/p\u003e\n\u003cp\u003e“So we’ve got a plan.” I stood and scrubbed at my face before admiring my new watch. “At least I’ve got a lovely way to count the minutes until we’re together again.”\u003c/p\u003e\n\u003cp\u003eHe came to me, catching me by the nape. His thumb drew tantalizing circles on the back of my neck. “I need to know you’re okay.”\u003c/p\u003e\n\u003cp\u003eI nodded. “I’m tired of Nathan running my life. I’m working toward that fresh start.”\u003c/p\u003e\n\u003cp\u003eI imagined a future in which my mom wasn’t a stalker, my dad was back on solid footing, Cary was happy, Corinne was in another country far away, and Gideon and I weren’t ruled by our pasts.\u003c/p\u003e\n\u003cp\u003eAnd I was finally ready to fight for it.\u003c/p\u003e\n\u003cp\u003e11\u003c/p\u003e\n\u003cp\u003eMONDAY MORNING. TIME to go to work. I hadn’t heard from my dad, so I got ready to head in. I was digging in my closet when a knock came on my bedroom door.\u003c/p\u003e\n\u003cp\u003e“Come in,” I yelled.\u003c/p\u003e\n\u003cp\u003eA minute later, I heard Cary shout back, “Where the hell are you?”\u003c/p\u003e\n\u003cp\u003e“In here.”\u003c/p\u003e\n\u003cp\u003eHis shadow darkened the doorway. “Any word from your dad?”\u003c/p\u003e\n\u003cp\u003eI glanced at him. “Not yet. I sent him a text and didn’t get a reply.”\u003c/p\u003e\n\u003cp\u003e“So he’s still on the plane.”\u003c/p\u003e\n\u003cp\u003e“Or he missed a connection. Who knows?” I scowled at my clothes.\u003c/p\u003e\n\u003cp\u003e“Here.” He came in and stepped around me, pulling a pair of gray linen palazzo pants off the bottom rack and a black lace cap-sleeved shirt.\u003c/p\u003e\n\u003cp\u003e“Thank you.” And because he was close, I hugged him.\u003c/p\u003e\n\u003cp\u003eHis returning hug was so tight it squeezed the air out of me. Startled by his exuberance, I held him for a long while, my cheek over his heart. For the first time in a few days, he was dressed in jeans and a T-shirt, and as usual, he managed to look striking and expensive.\u003c/p\u003e\n\u003cp\u003e“Everything okay?” I asked him.\u003c/p\u003e\n\u003cp\u003e“I miss you, baby girl,” he murmured into my hair.\u003c/p\u003e\n\u003cp\u003e“Just trying to make sure you don’t get sick of me.” I tried to sound like I was teasing, but his tone niggled at me. It lacked all the vivacity I was so used to hearing in it. “I’m taking a cab to work, so I’ve got some time. Why don’t we have a cup of coffee?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” He pulled back and smiled at me, looking boyishly beautiful.\u003c/p\u003e\n\u003cp\u003eTaking my hand, he led me out of the closet. I tossed my clothes on an armchair before we headed out to the kitchen.\u003c/p\u003e\n\u003cp\u003e“Are you going out?” I asked.\u003c/p\u003e\n\u003cp\u003e“I’ve got a shoot today.”\u003c/p\u003e\n\u003cp\u003e“Well, that’s good news!” I headed to the coffeemaker while he went to pull half-and-half out of the fridge. “Sounds like another occasion to dig into the case of Cristal.”\u003c/p\u003e\n\u003cp\u003e“No way,” he scoffed. “Not with everything that’s going on with your dad.”\u003c/p\u003e\n\u003cp\u003e“What else are we going to do? Sit around staring at each other? There’s nothing more that can be done. Nathan is dead and even if he weren’t, what he did to me is long over.” I pushed a steaming mug over to him and filled another. “I’m ready to shove his memory in a cold, dark hole and forget about him.”\u003c/p\u003e\n\u003cp\u003e“Over for you.” He lightened my coffee and slid it back. “It’s still news to your dad. He’ll want to talk about it.”\u003c/p\u003e\n\u003cp\u003e“I am not talking about it with my dad. I’m not talking about it ever.”\u003c/p\u003e\n\u003cp\u003e“He might not go along with that.”\u003c/p\u003e\n\u003cp\u003eI turned and faced him, leaning back into the counter with my mug cradled between my hands. “All he needs is to see me doing okay. This isn’t about him. It’s about me, and I’m surviving. Pretty well, I think.”\u003c/p\u003e\n\u003cp\u003eHe stirred his coffee, a thoughtful look on his face.\u003c/p\u003e\n\u003cp\u003e“Yeah, you are,” he said after a few seconds. “Are you going to tell him about your mystery man?”\u003c/p\u003e\n\u003cp\u003e“He’s not a mystery. I just can’t talk about him, and that has nothing to do with our friendship. I trust you and love you and rely on you like always.”\u003c/p\u003e\n\u003cp\u003eHis green eyes challenged me over the rim of his mug. “Doesn’t seem like it.”\u003c/p\u003e\n\u003cp\u003e“You’re my best friend. When I’m old and gray, you’ll still be my best friend. Not talking about the guy I’m seeing isn’t going to change that.”\u003c/p\u003e\n\u003cp\u003e“How am I not supposed to feel like you don’t trust me? What’s the big deal with this guy that you can’t even give me a name or anything?”\u003c/p\u003e\n\u003cp\u003eI sighed and told him a partial truth. “I don’t know his name.”\u003c/p\u003e\n\u003cp\u003eCary stilled, staring. “You’re shitting me.”\u003c/p\u003e\n\u003cp\u003e“I never asked him what it is.” As evasive answers went, it begged to be challenged. Cary gave me a long look.\u003c/p\u003e\n\u003cp\u003e“And I’m not supposed to be worried?”\u003c/p\u003e\n\u003cp\u003e“Nope. I’m comfortable with the whole thing. We’re both getting what we need and he cares about me.”\u003c/p\u003e\n\u003cp\u003eHe studied me. “What do you call him when you’re coming? You’ve got to be shouting something if he’s any good at it. Which I assume he is, since you obviously aren’t getting to know each other by talking.” \u003c/p\u003e","sourceLink":"https://allnovel.net/entwined-with-you-crossfire-3/page-26.html","bookId":1924,"creation":"Oct 5, 2019 9:52:13 AM","modification":"Oct 5, 2019 9:52:13 AM"}
