{"id":63724,"no":43,"title":"Page 43","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Appreciate the support, man,” Brett said. “We wouldn’t have made it without our fans.”\u003c/p\u003e\n\u003cp\u003e“You wouldn’t have made it if you weren’t so good.” Arnoldo looked at me. “You will have dessert, won’t you? And more wine.”\u003c/p\u003e\n\u003cp\u003eAs Arnoldo settled back in his chair, I realized he intended to fill the role of chaperone. When I glanced at Brett, I could tell from his wry smile that he caught that, too.\u003c/p\u003e\n\u003cp\u003e“So,” Arnoldo began, “tell me how Shawna is doing, Eva.”\u003c/p\u003e\n\u003cp\u003eI sighed inwardly. At least Arnoldo was a babysitter who was fun to look at.\u003c/p\u003e\n\u003cp\u003eBRETT’S hired driver dropped me off at my apartment a little after ten. I invited Brett up, because I couldn’t see any way to avoid it that wasn’t rude. He took in the exterior of the building with some surprise, as well as the night doorman and the front desk.\u003c/p\u003e\n\u003cp\u003e“You must have a smokin’ job,” he said as we walked toward the elevators.\u003c/p\u003e\n\u003cp\u003eThe clicking of heels on marble chased after me. “Eva!”\u003c/p\u003e\n\u003cp\u003eI cringed at the sound of Deanna’s voice. “Reporter alert,” I whispered, before turning around.\u003c/p\u003e\n\u003cp\u003e“That’s a bad thing?” he asked, turning with me.\u003c/p\u003e\n\u003cp\u003e“Hi, Deanna.” I greeted her with a strained smile.\u003c/p\u003e\n\u003cp\u003e“Hello.” Her dark eyes raked Brett from head to toe, and then she thrust her hand at him. “Brett Kline, right? Deanna Johnson.”\u003c/p\u003e\n\u003cp\u003e“A pleasure, Deanna,” he said, turning on the charm.\u003c/p\u003e\n\u003cp\u003e“What can I do for you?” I asked her as they shook hands.\u003c/p\u003e\n\u003cp\u003e“Sorry for interrupting you on your date. I didn’t realize you two were back together until I saw you at the Vidal event earlier.” She smiled at Brett. “I take it there’s no harm done from your altercation with Gideon Cross?”\u003c/p\u003e\n\u003cp\u003eBrett’s brows rose. “You lost me.”\u003c/p\u003e\n\u003cp\u003e“I’d heard you and Cross exchanged a few blows in an argument.”\u003c/p\u003e\n\u003cp\u003e“Someone’s got a big imagination.”\u003c/p\u003e\n\u003cp\u003eHad Gideon talked to him? Or had media training taught Brett the pitfalls to avoid?\u003c/p\u003e\n\u003cp\u003eI hated that Deanna had been nearby earlier, watching me. Or, more accurately, watching Gideon. He was the one she was fixated on. I was just easier to access.\u003c/p\u003e\n\u003cp\u003eHer answering smile was brittle. “Bad source, I guess.”\u003c/p\u003e\n\u003cp\u003e“It happens,” he said easily.\u003c/p\u003e\n\u003cp\u003eShe turned her attention back to me. “I saw Gideon with you today, Eva. My photographer got some great shots of you two. I stopped by to ask you for a statement, but now that I see who you’re with, would you comment on the status of your relationship with Brett?”\u003c/p\u003e\n\u003cp\u003eShe directed the question at me, but Brett stepped in, grinning and flashing that dazzling dimple. “I think ‘Golden’ says it all. We’ve got history and friendship.”\u003c/p\u003e\n\u003cp\u003e“That’s a great quote, thanks.” Deanna eyed me. I eyed her right back. “Okay. I don’t want to hold you up. I appreciate your time.”\u003c/p\u003e\n\u003cp\u003e“Sure.” I caught Brett’s hand and tugged it. “Good night.”\u003c/p\u003e\n\u003cp\u003eI hurried him to the elevators and didn’t relax until the doors closed.\u003c/p\u003e\n\u003cp\u003e“Can I ask why a reporter’s so interested in who you’re dating?”\u003c/p\u003e\n\u003cp\u003eI glanced at him. He was lounging against the handrail, his hands gripping the brass on either side of his hips. The pose was hot and he was undeniably sexy, but my thoughts were with Gideon. I was anxious to be with him and talk to him.\u003c/p\u003e\n\u003cp\u003e“She’s an ex of Gideon’s with a grudge.”\u003c/p\u003e\n\u003cp\u003e“And that doesn’t send up any flags for you?”\u003c/p\u003e\n\u003cp\u003eI shook my head. “Not like you’re probably thinking.”\u003c/p\u003e\n\u003cp\u003eThe elevator arrived on my floor and I led the way to my apartment, hating that I had to walk by Gideon’s to get there. Had he felt like this when he’d spent time with Corinne? Weighted with guilt and worry?\u003c/p\u003e\n\u003cp\u003eI opened the door and was sorry that Cary wasn’t hanging out on the couch. It didn’t even seem like my roommate was home. The lights were off, which was a strong indicator that he was out. He always left lights on in his wake when he was around.\u003c/p\u003e\n\u003cp\u003eHitting the switch, I turned in time to see Brett’s face when the recessed ceiling fixtures lit up the place. I always felt weird when people first realized I had money.\u003c/p\u003e\n\u003cp\u003eHe looked at me with a frown. “I’m rethinking my career choice.”\u003c/p\u003e\n\u003cp\u003e“My job doesn’t pay for this. My stepdad does. For now, anyway.” I went to the kitchen and dropped my purse and bag off on a bar stool.\u003c/p\u003e\n\u003cp\u003e“You and Cross hang in the same circles?”\u003c/p\u003e\n\u003cp\u003e“Sometimes.”\u003c/p\u003e\n\u003cp\u003e“Am I too different for you?”\u003c/p\u003e\n\u003cp\u003eThe question unsettled me, even though it was perfectly valid. “I don’t judge people by their money, Brett. Do you want something to drink?”\u003c/p\u003e\n\u003cp\u003e“Nah, I’m good.”\u003c/p\u003e\n\u003cp\u003eI gestured toward the couch and we settled there.\u003c/p\u003e\n\u003cp\u003e“So, you didn’t like the video,” he said, laying his arm over the back of the sofa.\u003c/p\u003e\n\u003cp\u003e“I didn’t say that!”\u003c/p\u003e\n\u003cp\u003e“Didn’t have to. I saw your face.”\u003c/p\u003e\n\u003cp\u003e“It’s just really … personal.”\u003c/p\u003e\n\u003cp\u003eHis green eyes were hot enough to make me flush. “I haven’t forgotten one thing about you, Eva. The video proves that.”\u003c/p\u003e\n\u003cp\u003e“That’s because there wasn’t a whole lot for you to remember,” I pointed out.\u003c/p\u003e\n\u003cp\u003e“You think I don’t know you, but I bet I’ve seen sides of you Cross never has and never will.”\u003c/p\u003e\n\u003cp\u003e“That’s true in reverse.”\u003c/p\u003e\n\u003cp\u003e“Maybe,” he conceded, his fingers tapping silently into the cushion. “I’m supposed to fly out at the butt-crack of dawn tomorrow, but I’ll catch a later flight. Come with me. We’ve got shows in Seattle and San Francisco over the weekend. You can head back Sunday night.”\u003c/p\u003e\n\u003cp\u003e“I can’t. I have plans.”\u003c/p\u003e\n\u003cp\u003e“The weekend after that we’re in San Diego. Come there.” His fingers slid down my arm. “It’ll be like old times, with twenty thousand extra people.”\u003c/p\u003e\n\u003cp\u003eI blinked. What were the chances that we’d be home at the same time? “I’ve got plans to be in SoCal then. Just me and Cary.”\u003c/p\u003e\n\u003cp\u003e“So we’ll hook up next weekend.”\u003c/p\u003e\n\u003cp\u003e“Meet up,” I corrected, standing when he did. “Are you leaving?”\u003c/p\u003e\n\u003cp\u003eHe stepped closer. “Are you asking me to stay?”\u003c/p\u003e\n\u003cp\u003e“Brett …”\u003c/p\u003e\n\u003cp\u003e“Right.” He gave me a rueful smile and my heart raced a little. “We’ll see each other next weekend.”\u003c/p\u003e\n\u003cp\u003eWe walked together to the door.\u003c/p\u003e\n\u003cp\u003e“Thank you for inviting me along today,” I told him, feeling oddly sorry that he was going so soon.\u003c/p\u003e\n\u003cp\u003e“I’m sorry you didn’t like the video.”\u003c/p\u003e\n\u003cp\u003e“I do like it.” I caught his hand. “I do. You did a great job with it. It’s just weird seeing myself from the outside, you know?”\u003c/p\u003e\n\u003cp\u003e“Yeah, I get it.” He cupped my cheek with his other hand and bent in for a kiss.\u003c/p\u003e\n\u003cp\u003eI turned my head and he nuzzled me instead, the tip of his nose rubbing up and down my cheek. The light scent of his cologne, mingled with the scent of his skin, teased my senses and brought back heated memories. The feel of his body standing so close to mine was achingly familiar.\u003c/p\u003e\n\u003cp\u003eI’d once had a mad crush on him. I had wanted him to feel the same way about me in return and now that he did, it was bittersweet.\u003c/p\u003e\n\u003cp\u003eBrett gripped my upper arms and groaned softly, the sound vibrating through me. “I remember how you feel,” he whispered, his voice deep and husky. “On the inside. I can’t wait to feel it again.”\u003c/p\u003e\n\u003cp\u003eI was breathing too fast. “Thank you for dinner.”\u003c/p\u003e\n\u003cp\u003eHis lips curved against my cheek. “Call me. I’ll call you no matter what, but it’d be nice for you to call me sometime. Okay?”\u003c/p\u003e\n\u003cp\u003eI nodded and had to swallow before speaking. “Okay.”\u003c/p\u003e\n\u003cp\u003eHe was gone a moment later and I was running to my purse for the burner phone. There was no message from Gideon. No missed call or text.\u003c/p\u003e\n\u003cp\u003eGrabbing my keys, I left my apartment and hurried to his, but it was dark and lifeless. I knew the moment I entered that he wasn’t there without having to check the artfully colored glass bowl he emptied his pockets into.\u003c/p\u003e\n\u003cp\u003eFeeling like something was very off, I headed back to my place. I dropped my keys on the counter and went to my room, heading straight for the bathroom and a shower.\u003c/p\u003e\n\u003cp\u003eThe unsettled feeling in my stomach wouldn’t go away, even as I washed the stickiness and grime of the hot afternoon down the drain. I scrubbed shampoo into my scalp and thought over the day, growing angrier by the moment because Gideon was off somewhere doing whatever, instead of being home with me working things out.\u003c/p\u003e\n\u003cp\u003eAnd then I sensed him.\u003c/p\u003e\n\u003cp\u003eRinsing soap out of my eyes, I turned and found him yanking off his tie as he stepped into the room. He looked tired and worn, which troubled me more than anger would have.\u003c/p\u003e\n\u003cp\u003e“Hey,” I greeted him.\u003c/p\u003e\n\u003cp\u003eHe watched me as he stripped with quick, methodical movements. Magnificently naked, he joined me in the shower, walking right into me and pulling me into a tight embrace.\u003c/p\u003e\n\u003cp\u003e“Hey,” I said again, hugging him back. “What’s the matter? Are you upset about the video?”\u003c/p\u003e\n\u003cp\u003e“I hate the video,” he said bluntly. “I should’ve screened the damn thing when I realized the song was about you.”\u003c/p\u003e\n\u003cp\u003e“I’m sorry.”\u003c/p\u003e\n\u003cp\u003eHe pulled back and looked down at me. The mist from the shower was slowly dampening his hair. He was infinitely sexier than Brett. And the way he felt about me—and I felt about him in return—was infinitely deeper. “Corinne called right before the video finished. She was … hysterical. Out of control. It concerned me and I went to see her.”\u003c/p\u003e\n\u003cp\u003eI took a deep breath, fighting off a flare of jealousy. I had no right to feel that way, especially after the time I’d spent with Brett. “How did that go?”\u003c/p\u003e\n\u003cp\u003eHe urged my head back with gentle fingers. “Close your eyes.”\u003c/p\u003e\n\u003cp\u003e“Talk to me, Gideon.”\u003c/p\u003e\n\u003cp\u003e“I will.” As he rinsed the suds from my hair, he said, “I think I figured out what the problem is. She’s been taking antidepressants and they’re not the right prescription for her.” \u003c/p\u003e","sourceLink":"https://allnovel.net/entwined-with-you-crossfire-3/page-43.html","bookId":1924,"creation":"Oct 5, 2019 9:52:13 AM","modification":"Oct 5, 2019 9:52:13 AM"}
