{"id":63745,"no":53,"title":"Page 53","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI coughed and nearly spit out my food.\u003c/p\u003e\n\u003cp\u003e“No one’s lucky enough to find two guys like that in a row,” he drawled. “Not even you. You should’ve had a dry spell or at least a couple of really bad lays first.”\u003c/p\u003e\n\u003cp\u003eI threw my wadded-up straw wrapper at him, which he dodged with a laugh.\u003c/p\u003e\n\u003cp\u003eThen he sobered. “Did you think I would judge you for getting back together with him after he jacked up?”\u003c/p\u003e\n\u003cp\u003e“It’s more complicated than that, Cary. Things were … a mess. There was a lot of pressure. Still is, with that reporter stalking Gideon—”\u003c/p\u003e\n\u003cp\u003e“Stalking him?”\u003c/p\u003e\n\u003cp\u003e“Totally. I just didn’t want …” You exposed. Vulnerable. Open to accusation as an accomplice after the fact. “I just had to let it play out,” I finished lamely.\u003c/p\u003e\n\u003cp\u003eHe let that sink in, then nodded. “And now you’re going to marry him.”\u003c/p\u003e\n\u003cp\u003e“Yes.” I took a drink, needing to loosen the lump in my throat. “But you’re the only one who knows that besides us.”\u003c/p\u003e\n\u003cp\u003e“Finally, a secret you let me in on.” His lips pursed for a few seconds. “And you still want me to live with you.”\u003c/p\u003e\n\u003cp\u003eI leaned forward again, holding out my hand for his. “I know you can do something else, go somewhere else. But I’d rather you didn’t. I’m not ready to be without you yet, married or not.”\u003c/p\u003e\n\u003cp\u003eHe gripped my hand so tightly, my bones pressed together. “Eva—”\u003c/p\u003e\n\u003cp\u003e“Wait,” I said quickly. He was far too serious all of a sudden. I didn’t want him to cut me off before I put everything out there. “Gideon’s penthouse has an adjacent one-bedroom apartment he doesn’t use.”\u003c/p\u003e\n\u003cp\u003e“A one-bedroom apartment. On Fifth Avenue.”\u003c/p\u003e\n\u003cp\u003e“Yeah. Great, right? All yours. Your own space and entrance and view of Central Park. But still connected to me. The best of both worlds.” I rushed on, hoping to say something he’d latch on to. “We’ll stay on the Upper West Side for a bit, while I make changes to the penthouse. Gideon says we can have whatever changes you want made to your apartment done at the same time.”\u003c/p\u003e\n\u003cp\u003e“My apartment.” He stared at me, which made me even more nervous. A man and a woman tried to squeeze between our table and the back of an occupied chair that was pushed too far out into the walkway, but I ignored them.\u003c/p\u003e\n\u003cp\u003e“I’m not talking about a handout,” I assured him. “I’ve been thinking that I’d like to put that money I’ve been sitting on to work. Create a foundation or something to decide how to use it in support of causes and charities we believe in. I need your help. And I’ll pay you for it. Not just for your input, but for your face. I want you to be the foundation’s first spokesperson.”\u003c/p\u003e\n\u003cp\u003eCary’s grip on my hand slackened.\u003c/p\u003e\n\u003cp\u003eAlarmed, I tightened mine. “Cary?”\u003c/p\u003e\n\u003cp\u003eHis shoulders sagged. “Tatiana’s pregnant.”\u003c/p\u003e\n\u003cp\u003e“What?” I felt the blood drain from my face. The little restaurant was hopping, and the shouting of orders behind the counter and the clatter of trays and utensils made it hard to hear, but I’d caught the two words that fell out of Cary’s mouth as if he’d shouted them at me. “Are you kidding?”\u003c/p\u003e\n\u003cp\u003e“I wish.” He pulled his hand away and scooped back the bangs that draped over one eye. “Not that I don’t want a kid. That part’s cool. But … fuck. Not now, you know? And not with her.”\u003c/p\u003e\n\u003cp\u003e“How the hell did she get pregnant?” Cary was religious about protecting himself, knowing damn well he lived a high-risk lifestyle.\u003c/p\u003e\n\u003cp\u003e“Well, I shoved my dick in her and pushed it around—”\u003c/p\u003e\n\u003cp\u003e“Shut up,” I bit out. “You’re careful.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, putting a sock on it isn’t guaranteed protection,” he said wearily, “and Tat doesn’t take the pill because she says it makes her break out and eat too much.”\u003c/p\u003e\n\u003cp\u003e“Jesus.” My eyes stung. “Are you sure it’s yours?”\u003c/p\u003e\n\u003cp\u003eHe snorted. “No, but that doesn’t mean it’s not. She’s six weeks along, so it’s possible.”\u003c/p\u003e\n\u003cp\u003eI had to ask. “Is she going to keep it?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. She’s thinking it over.”\u003c/p\u003e\n\u003cp\u003e“Cary …” I couldn’t hold back the tear that slid down my cheek. My heart was aching for him. “What are you going to do?”\u003c/p\u003e\n\u003cp\u003e“What can I do?” He slumped back in his chair. “It’s her decision.”\u003c/p\u003e\n\u003cp\u003eHis powerlessness had to be killing him. After his mother had given birth to him, unwanted, she’d used abortion as birth control. I knew that haunted him. He’d told me so. “And if she decides to go through with the pregnancy? You’ll have a paternity test done, right?”\u003c/p\u003e\n\u003cp\u003e“God, Eva.” He looked at me with reddened eyes. “I haven’t thought that far ahead yet. What the hell am I supposed to say to Trey? Things are just starting to smooth out between us and I’ve got to hit him with this? He’s going to dump me. It’s over.”\u003c/p\u003e\n\u003cp\u003eSucking in a deep breath, I straightened in my chair. I couldn’t let Cary and Trey fall apart. Now that Gideon and I were good, it was time to fix all the other areas of my life I’d been neglecting. “We’ll take it a step at a time. Figure things out as we go. We’ll get through this.”\u003c/p\u003e\n\u003cp\u003eHe swallowed hard. “I need you.”\u003c/p\u003e\n\u003cp\u003e“I need you, too. We’ll stick together and work it out.” I managed a smile. “I’m not going anywhere and neither are you. Except to San Diego this weekend,” I amended hastily, reminding myself to talk to Gideon about that.\u003c/p\u003e\n\u003cp\u003e“Thank God.” Cary sat forward again. “What I wouldn’t give to shoot hoops at Dr. Travis’s right now.”\u003c/p\u003e\n\u003cp\u003e“Yeah.” I didn’t play basketball, but I knew I could use a one-on-one with Dr. Travis myself.\u003c/p\u003e\n\u003cp\u003eWhat would he say when he learned how far off the rails we’d slid in the few months we’d been in New York? We had spun some big dreams the last time we’d all sat down together. Cary had wanted to star in a Super Bowl ad and I’d wanted to be the one behind the scenes of that ad. Now he was facing the possibility of a baby and I was married to the most complicated man I had ever met.\u003c/p\u003e\n\u003cp\u003e“Dr. Trav’s gonna flip,” Cary muttered, reading my mind.\u003c/p\u003e\n\u003cp\u003eFor some reason, that made us both laugh ’til we cried.\u003c/p\u003e\n\u003cp\u003eWHEN I got back to my desk, I found another small pile of interoffice envelopes. Catching my lower lip between my teeth, I searched each one until I found the one I was hoping for.\u003c/p\u003e\n\u003cp\u003eI CAN THINK OF MANY USES FOR THAT CHAIN,\u003c/p\u003e\n\u003cp\u003eMRS. X.\u003c/p\u003e\n\u003cp\u003eYOU WILL ENJOY THEM ALL IMMENSELY.\u003c/p\u003e\n\u003cp\u003eYOURS,\u003c/p\u003e\n\u003cp\u003eX\u003c/p\u003e\n\u003cp\u003eSome of the dark clouds from lunch floated away.\u003c/p\u003e\n\u003cp\u003eAFTER Cary’s mind-blowing revelation, meeting Giroux after work barely registered on my what-else-could-possibly-go-wrong-next scale.\u003c/p\u003e\n\u003cp\u003eHe was already at the wine bar when I arrived. Dressed in perfectly pressed khakis and white dress shirt rolled up at the sleeves and open at the throat, he looked good. Casual. But that didn’t make him seem more relaxed. The man was strung tight as a bow, vibrating with tension and whatever else was eating at him.\u003c/p\u003e\n\u003cp\u003e“Eva,” he greeted me. With that overt friendliness I hadn’t liked the first time, he kissed me on both cheeks again. “Enchanté.”\u003c/p\u003e\n\u003cp\u003e“Not too blond for you today, I take it?”\u003c/p\u003e\n\u003cp\u003e“Ah.” He gave me a smile that didn’t reach his eyes. “I deserved that.”\u003c/p\u003e\n\u003cp\u003eI joined him at his table by the window and we were served shortly after.\u003c/p\u003e\n\u003cp\u003eThe place had the look of an establishment that had been around a long time. Tin tiles covered the ceiling, while the aged hardwood floors and intricately carved bar suggested the place had been a pub at some point in its history. It had been modernized with chrome fixtures and a wine rack behind the bar that could have been an abstract sculpture.\u003c/p\u003e\n\u003cp\u003eGiroux openly studied me as the server poured our wine. I had no idea what he was looking for, but he was definitely searching for something.\u003c/p\u003e\n\u003cp\u003eAs I took a sip of a lovely shiraz, he settled comfortably in his chair and swirled his wine around in his glass. “You’ve met my wife.”\u003c/p\u003e\n\u003cp\u003e“I have, yes. She’s very beautiful.”\u003c/p\u003e\n\u003cp\u003e“Yes, she is.” His gaze dropped to his wine. “What else did you think of her?”\u003c/p\u003e\n\u003cp\u003e“Why does it matter what I think?”\u003c/p\u003e\n\u003cp\u003eHe looked at me again. “Do you see her as a rival? Or a threat?”\u003c/p\u003e\n\u003cp\u003e“Neither.” I took another drink and noticed a black Bentley SUV easing into a tight spot at the curb just outside the window I sat beside. Angus was behind the wheel and apparently uncaring of the No PARKING sign he was camping out in front of.\u003c/p\u003e\n\u003cp\u003e“You are that certain of Cross?”\u003c/p\u003e\n\u003cp\u003eMy attention returned to Giroux. “Yes. But that doesn’t mean I don’t wish you would pack up your wife and take her back to France with you.”\u003c/p\u003e\n\u003cp\u003eHis mouth quirked on one side in a grim smile. “You are in love with Cross, yes?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003eThat made me smile. “If you think you can figure out what Corinne sees in him by what I see in him, forget it. He and I, we’re … different with each other than we are with other people.”\u003c/p\u003e\n\u003cp\u003e“I saw that. With him.” Giroux took a drink, savoring it before swallowing.\u003c/p\u003e\n\u003cp\u003e“Forgive me, but I don’t know why we’re sitting here. What do you want from me?”\u003c/p\u003e\n\u003cp\u003e“Are you always so direct?”\u003c/p\u003e\n\u003cp\u003e“Yes.” I shrugged. “I get impatient with being confused.”\u003c/p\u003e\n\u003cp\u003e“Then I will be direct as well.” He reached out and caught my left hand. “You have a tan line from a ring. A sizable one, it appears. An engagement ring, perhaps?”\u003c/p\u003e\n\u003cp\u003eI looked at my hand and saw he was right. There was a square-sized spot on my ring finger that was a few shades lighter than the rest of my skin. Unlike my mother, who was pale, I’d inherited my father’s warm skin tone and I tanned easily.\u003c/p\u003e\n\u003cp\u003e“You’re very perceptive. But I would appreciate you keeping your speculations to yourself.” \u003c/p\u003e","sourceLink":"https://allnovel.net/entwined-with-you-crossfire-3/page-53.html","bookId":1924,"creation":"Oct 5, 2019 9:52:13 AM","modification":"Oct 5, 2019 9:52:13 AM"}
