{"id":63751,"no":56,"title":"Page 56","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“How are you?”\u003c/p\u003e\n\u003cp\u003e“I’m good. You?”\u003c/p\u003e\n\u003cp\u003e“Hanging in there. We should get together sometime.” I smiled at a cop who was artfully directing traffic at the hugely complicated intersection on the Brooklyn side. She kept things moving with a whistle between her teeth and fluid hand gestures that had serious sass to them. “We could grab a drink after work or double-date for dinner.”\u003c/p\u003e\n\u003cp\u003e“I’d like that. Are you seeing someone in particular?”\u003c/p\u003e\n\u003cp\u003e“Gideon and I are working things out.”\u003c/p\u003e\n\u003cp\u003e“Gideon Cross? Well, if anyone can hook him, it’d be you.”\u003c/p\u003e\n\u003cp\u003eI laughed and wished I had my ring on. I didn’t wear it around during the day the way Gideon wore his. He didn’t care who knew he was taken or by whom, but I still had everyone in my life to tell. “Thanks for the vote of confidence. What about you? You seeing anyone?”\u003c/p\u003e\n\u003cp\u003e“Lacey and I are dabbling. I like her. She’s a lot of fun.”\u003c/p\u003e\n\u003cp\u003e“That’s great. I’m glad to hear it. Listen, if you talk to her today, can you ask her to let me know how Megumi’s doing? She’s out sick and I just want to make sure she’s all right and doesn’t need anything.”\u003c/p\u003e\n\u003cp\u003e“Sure thing.” The receiver filled with a sudden rush of noise, the unmistakable sound of him stepping outside. “Lacey’s out of town, but she’s supposed to give me a call tonight.”\u003c/p\u003e\n\u003cp\u003e“Thank you. I appreciate it. You’re on the move, so I’ll let you go. Let’s plan on getting together next week and we’ll work out the details in the next couple of days.”\u003c/p\u003e\n\u003cp\u003e“Sounds good. I’m glad you called.”\u003c/p\u003e\n\u003cp\u003eI smiled. “Me, too.”\u003c/p\u003e\n\u003cp\u003eWe hung up and because I felt like reaching out, I sent a text to Shawna and another to Brett. Just quick hellos with smiley faces.\u003c/p\u003e\n\u003cp\u003eWhen I looked up, I caught Clancy looking at me in the rearview mirror.\u003c/p\u003e\n\u003cp\u003e“How’s Mom?” I asked.\u003c/p\u003e\n\u003cp\u003e“She’ll be fine,” he said, in his usual no-nonsense way.\u003c/p\u003e\n\u003cp\u003eI nodded and looked out the window, catching sight of a gleaming steel bus stop shelter displaying Cary’s billboard. “Family is so hard sometimes, you know.”\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003e“You have any brothers or sisters, Clancy?”\u003c/p\u003e\n\u003cp\u003e“One of each.”\u003c/p\u003e\n\u003cp\u003eWhat were they like? Were they tough as nails and deadly like Clancy? Or was he the black sheep? “Are you close, if you don’t mind my asking?”\u003c/p\u003e\n\u003cp\u003e“We’re tight. My sister lives out of state, so I don’t see her much, but we talk on the phone once a week at least. My brother’s in New York, so we catch up more often.”\u003c/p\u003e\n\u003cp\u003e“Cool.” I tried to picture a relaxed Clancy tossing back beers with someone who resembled him, but couldn’t pull it off. “Does he work security, too?”\u003c/p\u003e\n\u003cp\u003e“Not yet.” His mouth did that little lip twitch, almost-smile thing. “He’s with the FBI for now.”\u003c/p\u003e\n\u003cp\u003e“Is your sister in law enforcement?”\u003c/p\u003e\n\u003cp\u003e“She’s in the Marines.”\u003c/p\u003e\n\u003cp\u003e“Whoa. Awesome.”\u003c/p\u003e\n\u003cp\u003e“Yes, she is.”\u003c/p\u003e\n\u003cp\u003eI studied him and his military crew cut. “You were in the service, too, weren’t you?”\u003c/p\u003e\n\u003cp\u003e“I was.” He didn’t volunteer any more than that.\u003c/p\u003e\n\u003cp\u003eWhen I opened my mouth to pry further, we turned a corner and I realized we’d reached the former warehouse where Parker had his studio.\u003c/p\u003e\n\u003cp\u003eI grabbed my gym bag and got out before Clancy could open the door for me. “See you in an hour!”\u003c/p\u003e\n\u003cp\u003e“Knock ’em out, Eva,” he said, watching me until I got inside.\u003c/p\u003e\n\u003cp\u003eThe door had barely closed behind me when I saw a familiar brunette I would’ve rather not seen again. Ever. She stood to the side, just off the training mats, with her arms crossed. She was dressed in black workout pants with a bright blue stripe down the sides that matched her fitted long-sleeve shirt. Her brown curly hair was scraped back into an unforgiving ponytail.\u003c/p\u003e\n\u003cp\u003eShe turned. Cool blue eyes raked me from head to toe.\u003c/p\u003e\n\u003cp\u003eFacing the inevitable, I took a deep breath and approached her. “Detective Graves.”\u003c/p\u003e\n\u003cp\u003e“Eva.” She gave me a curt nod. “Great tan.”\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003e“Cross take you away for the weekend?”\u003c/p\u003e\n\u003cp\u003eNot exactly a casual question. My back went up. “I had some time off.”\u003c/p\u003e\n\u003cp\u003eHer thin mouth quirked on one side. “Still cautious. Good. What does your dad think of Cross?”\u003c/p\u003e\n\u003cp\u003e“I believe my dad trusts my judgment.”\u003c/p\u003e\n\u003cp\u003eGraves nodded. “I’d keep thinking about Nathan Barker’s bracelet if I were you. But then, loose ends make me twitchy.”\u003c/p\u003e\n\u003cp\u003eA shiver of unease ran down my back. The whole thing made me twitchy, but who could I talk to about it? No one but Gideon, and I knew him too well to doubt that he was doing everything in his considerable power to solve that mystery.\u003c/p\u003e\n\u003cp\u003e“I need a sparring partner,” the detective said suddenly. “You’re up.”\u003c/p\u003e\n\u003cp\u003e“Uh, what?” I blinked at her. “Is that … ? Can we … ?”\u003c/p\u003e\n\u003cp\u003e“The case has gone cold, Eva.” She stalked onto the mat and began to stretch. “Hurry up. I don’t have all night.”\u003c/p\u003e\n\u003cp\u003eGRAVES kicked my ass. For such a rail-thin, wiry woman, she packed some strength. She was focused, precise, and ruthless. I actually learned a lot from her over the hour and a half we sparred, most especially never to let down my guard. She was lightning quick and swift to exploit any advantage.\u003c/p\u003e\n\u003cp\u003eWhen I stumbled into my apartment a little after eight, I headed straight to the bathtub. I soaked in vanilla-scented water, surrounded by candles, and hoped Gideon would show up before I pruned.\u003c/p\u003e\n\u003cp\u003eHe ended up coming in just as I was wrapping a towel around me, his damp hair and jeans telling me he’d showered after a visit with his trainer.\u003c/p\u003e\n\u003cp\u003e“Hi, ace.”\u003c/p\u003e\n\u003cp\u003e“Hi, wife.” He came up to me, tugged open my towel, and lowered his head to my breast.\u003c/p\u003e\n\u003cp\u003eMy breath left me when he sucked a nipple into his mouth, drawing rhythmically until it hardened.\u003c/p\u003e\n\u003cp\u003eStraightening, he admired his handiwork. “God, you’re sexy.”\u003c/p\u003e\n\u003cp\u003eI lifted onto my tiptoes and kissed his chin. “How’d things go tonight?”\u003c/p\u003e\n\u003cp\u003eHe looked at me with a wry curve to his lips. “Dr. Petersen congratulated us, then went on about how important couples therapy would be.”\u003c/p\u003e\n\u003cp\u003e“He thinks we got married too soon.”\u003c/p\u003e\n\u003cp\u003eGideon laughed. “He didn’t even want us having sex, Eva.”\u003c/p\u003e\n\u003cp\u003eWrinkling my nose, I resecured my towel and grabbed a comb for my wet hair.\u003c/p\u003e\n\u003cp\u003e“Let me,” he said, taking the comb and leading me to the wide lip of the tub. He urged me to sit.\u003c/p\u003e\n\u003cp\u003eAs he combed my hair, I told him about seeing Detective Graves at my Krav Maga class.\u003c/p\u003e\n\u003cp\u003e“My lawyers tell me the case has been shelved,” Gideon said.\u003c/p\u003e\n\u003cp\u003e“How do you feel about that?”\u003c/p\u003e\n\u003cp\u003e“You’re safe. That’s all that matters.”\u003c/p\u003e\n\u003cp\u003eThere was no inflection in his voice, which told me it mattered to him more than he’d tell me. I knew that somewhere, deep down inside him, Nathan’s murder was haunting him. Because I was haunted by what Gideon had done for me and we were two halves of the same soul.\u003c/p\u003e\n\u003cp\u003eThat was why Gideon had wanted us to get married so badly. I was his safe place. I was the one person who knew every dark, tormented secret he had, and I loved him desperately anyway. And he needed love more than anyone I’d ever met.\u003c/p\u003e\n\u003cp\u003eThere was a vibration against my shoulder and I teased, “Is that a new toy in your pocket, ace?”\u003c/p\u003e\n\u003cp\u003e“Should’ve turned the damn thing off,” he muttered, digging his phone out. He looked at the screen, then answered with a clipped, “Cross.”\u003c/p\u003e\n\u003cp\u003eI heard a woman’s agitated voice coming through the receiver, but I couldn’t make out the words.\u003c/p\u003e\n\u003cp\u003e“When?” After hearing the answer, he asked, “Where? Yes. I’m on my way.”\u003c/p\u003e\n\u003cp\u003eHe hung up and raked a hand through his hair.\u003c/p\u003e\n\u003cp\u003eI stood. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Corinne’s in the hospital. My mother says it’s bad.”\u003c/p\u003e\n\u003cp\u003e“I’ll get dressed. What happened?”\u003c/p\u003e\n\u003cp\u003eGideon looked at me. Goose bumps swept across my skin. I’d never seen him look so … shattered.\u003c/p\u003e\n\u003cp\u003e“Pills,” he said hoarsely. “She swallowed a bottle of pills.”\u003c/p\u003e\n\u003cp\u003eWE took the DB9. While we waited for the attendant to bring the car to us, Gideon called Raúl, telling him to meet us at the hospital to take over the Aston Martin when we arrived.\u003c/p\u003e\n\u003cp\u003eWhen Gideon slid behind the wheel, he drove with tight focus; every turn of the wheel and press of the accelerator was skilled and precise. Enclosed in the small space with him, I knew he’d shut down. Emotionally, he was unreachable. When I placed my hand on his knee to offer comfort and support, he didn’t even twitch. I wasn’t sure he even felt it.\u003c/p\u003e\n\u003cp\u003eRaúl was waiting for us when we pulled up to the emergency room. He opened the door for me, then rounded the hood and took the driver’s seat after Gideon got out. The gleaming car was moved out of the drop-off driveway before we walked through the automatic doors.\u003c/p\u003e\n\u003cp\u003eI took Gideon’s hand, but I wasn’t sure he felt that, either. His attention was riveted on his mother, who stood when we entered the private waiting area we’d been directed to. Elizabeth Vidal barely glanced at me, going straight to her son and hugging him.\u003c/p\u003e\n\u003cp\u003eHe didn’t hug her back. But he also didn’t pull away. His grip on my hand tightened.\u003c/p\u003e\n\u003cp\u003eMrs. Vidal didn’t even acknowledge me. Instead, she turned her back to me and gestured at the couple seated together nearby. They were clearly Corinne’s parents. They’d been talking to Elizabeth when Gideon and I came in, which seemed odd to me since Jean-Fran?ois Giroux was standing alone by the window, looking as much like an outsider as Elizabeth was making me feel.\u003c/p\u003e\n\u003cp\u003eGideon’s hold on my hand slackened as his mother pulled him toward Corinne’s family. Feeling awkward standing in the doorway alone, I went to Jean-Fran?ois.\u003c/p\u003e\n\u003cp\u003eI greeted him softly. “I’m very sorry.”\u003c/p\u003e\n\u003cp\u003eHe looked at me with dead eyes, his face seeming to have aged a decade since we’d met at the wine bar the day before. “What are you doing here?” \u003c/p\u003e","sourceLink":"https://allnovel.net/entwined-with-you-crossfire-3/page-56.html","bookId":1924,"creation":"Oct 5, 2019 9:52:13 AM","modification":"Oct 5, 2019 9:52:13 AM"}
