{"id":88682,"no":15,"title":"Page 15","content":"\u003cp\u003eHe was about to go through security when his cell phone rang. It was Agent Hughes.\u003c/p\u003e\n\u003cp\u003eHe didn’t waste time on pleasantries.\u003c/p\u003e\n\u003cp\u003e“Just got word from Omaha that Willis Cogburn hasn’t been showing up at his apartment. They got inside for a search and found a note in his trash can with the names Sean Goodman and Dr. Ellie Sullivan on it.”\u003c/p\u003e\n\u003cp\u003e“Tell me you’ve got someone on the way to her now,” Max demanded.\u003c/p\u003e\n\u003cp\u003e“I did what I could, but we can’t get anyone to Winston Falls for a couple of days, maybe even a week. Everyone at the nearest field office is tied up with cases, and they’re understaffed. I’ll talk to the locals down there. See if they can watch over her until she leaves.”\u003c/p\u003e\n\u003cp\u003e“They weren’t any help in the past when Ellie’s family needed them. I don’t trust them to do more than send a car by a couple of times a day. I’m guessing they’re a pretty small operation.”\u003c/p\u003e\n\u003cp\u003eHughes’s frustration came through loud and clear. “Look, I’ll find someone. It’s just going to take some time. Dr. Sullivan needs to be warned. I’ll call her and caution her to be careful until we can get her some protection or until we’ve got a handle on where all the players are.”\u003c/p\u003e\n\u003cp\u003eMax immediately thought of the stress Ellie and her family were already feeling from the Patterson threat. “Don’t call her,” he said.\u003c/p\u003e\n\u003cp\u003e“There’s not much choice here. She needs to be warned,” Hughes argued.\u003c/p\u003e\n\u003cp\u003e“I’ll go,” Max blurted.\u003c/p\u003e\n\u003cp\u003e“What?” Hughes asked, surprised. “You can’t go. You have to be back in Honolulu to work on the case there.”\u003c/p\u003e\n\u003cp\u003e“I’ll take personal leave,” Max said. “Just for a week, until Ellie gets back home. Ben’s got our end of the case under control. He can consult with me by phone. I’ll make all the arrangements with the Honolulu office.”\u003c/p\u003e\n\u003cp\u003eHe ended the call before Hughes could say another word.\u003c/p\u003e\n\u003cp\u003eFIFTEEN\u003c/p\u003e\n\u003cp\u003eShe wasn’t happy to see him. In fact, she nearly had heart failure when Max pulled into the driveway. She was painting Annie’s old bedroom on the second floor, and she happened to look out the window just as Max was getting out of his car.\u003c/p\u003e\n\u003cp\u003eShe was so rattled, she dropped the paintbrush. Fortunately, it landed on the tarp she’d put down on the hardwood floors.\u003c/p\u003e\n\u003cp\u003eWhat was he doing here? Had something happened? Of course something had happened, she decided, answering her own question. He wouldn’t be here otherwise.\u003c/p\u003e\n\u003cp\u003eMaybe he found out where Evan Patterson was hiding and wanted to tell her. No, no, if that was true, he would have picked up the phone and called her.\u003c/p\u003e\n\u003cp\u003eOh Lord, her father was home. He was probably sitting on the front porch reading the news on his laptop. He was already stressed out. A federal agent stopping by could send him right over the edge.\u003c/p\u003e\n\u003cp\u003eDressed in a pair of old shorts, a sleeveless blouse spotted with lavender paint, and flip-flops, she dashed down the stairs, flew through the living room, and ran outside. She passed her father without saying a word and came to a screeching halt about a foot in front of Max.\u003c/p\u003e\n\u003cp\u003eShe couldn’t seem to catch her breath, but it wasn’t because she was out of shape. It was because of him. When he saw her, a huge smile spread across his face. That dimple in his cheek could cause foolish women to go weak in the knees. She wasn’t a foolish woman, she reminded herself.\u003c/p\u003e\n\u003cp\u003eHe looked sexy as sin. Damn it.\u003c/p\u003e\n\u003cp\u003eHer greeting wasn’t polite. “What are you doing here?”\u003c/p\u003e\n\u003cp\u003eMax was looking past her. “Is that your father? He looks like he’s going to pass out. Ah…”\u003c/p\u003e\n\u003cp\u003e“Ah, what?” she asked, frowning.\u003c/p\u003e\n\u003cp\u003e“He’s staring at my gun.”\u003c/p\u003e\n\u003cp\u003e“Great,” she whispered. “Just great.”\u003c/p\u003e\n\u003cp\u003e“Meaning?”\u003c/p\u003e\n\u003cp\u003e“I’m so happy you could make it,” she said loud enough for her father to hear. She then leaned up and kissed Max on his cheek.\u003c/p\u003e\n\u003cp\u003eHe couldn’t resist. He pulled her into his arms, told her she had paint in her hair, and kissed her on her mouth. It was quick but amazingly thorough. “That should put some color back in his face,” he said.\u003c/p\u003e\n\u003cp\u003eShe put her arms around his neck and whispered into his ear, “I haven’t told my parents about the shooting in the park… or about Sean Goodman… you know…”\u003c/p\u003e\n\u003cp\u003e“Got it.”\u003c/p\u003e\n\u003cp\u003eSide by side they walked up the porch steps to where her father waited, and Ellie made the introductions.\u003c/p\u003e\n\u003cp\u003e“Dad, this is my friend Max Daniels.”\u003c/p\u003e\n\u003cp\u003e“William Sullivan,” her father said, stepping forward to shake his hand.\u003c/p\u003e\n\u003cp\u003e“It’s good to meet you, sir.”\u003c/p\u003e\n\u003cp\u003eNever one to mince words, William said, “I notice you carry a gun.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir, I do.”\u003c/p\u003e\n\u003cp\u003e“And a badge,” Ellie nervously interjected. “He carries a badge, too. Max is an agent with the FBI.”\u003c/p\u003e\n\u003cp\u003eFrowning intently now, her father asked how the two had met. It was obvious he was suspicious.\u003c/p\u003e\n\u003cp\u003e“The hospital,” she rushed to answer before Max could say a word. “We met in the hospital. His friend needed surgery.” She added nonchalantly, “Routine stuff.”\u003c/p\u003e\n\u003cp\u003eShe was nodding vigorously, even as she tried to calm down. This wasn’t the Inquisition. Why was she so nervous? She knew the answer to that one. She was a frickin’ basket case because Max had astounded her, showing up the way he did.\u003c/p\u003e\n\u003cp\u003eMax could see the worry in her father’s eyes, so he casually took hold of Ellie’s hand and pulled her into his side. “Ellie did the surgery,” he said proudly.\u003c/p\u003e\n\u003cp\u003eShe nodded again. She was beginning to feel like a bobblehead doll. “Yes, I did, and Max and I started seeing each other.”\u003c/p\u003e\n\u003cp\u003eShe felt terrible lying to her father, but she justified her actions by reasoning that her motives were good. If she told him the truth, he would dwell on all the possibilities of what could have happened to her.\u003c/p\u003e\n\u003cp\u003eHer father visibly relaxed. “I’m very happy to meet one of Ellie’s friends. Why don’t we go inside and get something cool to drink. You must be parched.” He motioned for them to go in ahead of him.\u003c/p\u003e\n\u003cp\u003eEllie’s mother came out of the kitchen, wiping her hands on a frilly apron. “William, dinner will be ready in-” She stopped mid-sentence as soon as she saw Max, and her reaction was almost identical to her husband’s when he’d first noticed the gun.\u003c/p\u003e\n\u003cp\u003e“Claire, this is Max Daniels,” William said. “He’s a friend of Ellie’s.”\u003c/p\u003e\n\u003cp\u003e“A friend?”\u003c/p\u003e\n\u003cp\u003e“Yes, Mother,” Ellie said. “A friend.”\u003c/p\u003e\n\u003cp\u003e“Oh,” she said as she nervously patted her hair. Her gaze bounced back and forth between the pair.\u003c/p\u003e\n\u003cp\u003eMax smiled as he took her hand. “It’s a pleasure to meet you.”\u003c/p\u003e\n\u003cp\u003e“My goodness, you’re handsome.” She laughed after making the comment. “You’re staying for dinner, of course.”\u003c/p\u003e\n\u003cp\u003e“I’d love to.”\u003c/p\u003e\n\u003cp\u003eHer mother beamed with pleasure. What had come over her? Ellie wondered.\u003c/p\u003e\n\u003cp\u003e“Why don’t we sit in our hearth room just off the kitchen,” her father suggested.\u003c/p\u003e\n\u003cp\u003eWhere they could grill him, Ellie thought. And she was right. The questions began, one on top of the other.\u003c/p\u003e\n\u003cp\u003eEllie didn’t know whether Max liked sweet tea or not, but the glass was offered, and he accepted. She stood by the kitchen island, watching, and had the most amazing revelation: Max could be charming. And her mother? She was so excited and flustered, she was blushing. Was her behavior because her daughter had finally found another man? That possibility riled. Or was her mother acting strange because Max was so adorable… with her, anyway.\u003c/p\u003e\n\u003cp\u003e“Ellie, why don’t you go upstairs and change before dinner,” her mother suggested.\u003c/p\u003e\n\u003cp\u003e“I’m almost finished painting the room. I just have the trim to do.” And one wall, she silently added. “When is dinner?”\u003c/p\u003e\n\u003cp\u003e“In an hour.”\u003c/p\u003e\n\u003cp\u003e“I’ll help paint,” Max said.\u003c/p\u003e\n\u003cp\u003eEllie was all for that. She couldn’t wait to get him alone and find out why he had come all this way.\u003c/p\u003e\n\u003cp\u003e“No, you’re a guest,” her father said.\u003c/p\u003e\n\u003cp\u003e“He likes to paint,” Ellie rushed to say.\u003c/p\u003e\n\u003cp\u003e“How long will you be staying?” her father asked.\u003c/p\u003e\n\u003cp\u003e“No time at all,” Ellie answered for him.\u003c/p\u003e\n\u003cp\u003eNeither parent paid any attention to her.\u003c/p\u003e\n\u003cp\u003e“William, Max is Ellie’s plus one. He’ll be staying at least until after the wedding. Won’t you, Max?”\u003c/p\u003e\n\u003cp\u003e“He’s my what?” Ellie asked.\u003c/p\u003e\n\u003cp\u003e“Your plus one, dear.”\u003c/p\u003e\n\u003cp\u003e“No, he’s not-”\u003c/p\u003e\n\u003cp\u003e“I’ll be leaving when Ellie leaves,” Max said, and the look he shot her suggested she not argue.\u003c/p\u003e\n\u003cp\u003e“You’ll be flying back with her?”\u003c/p\u003e\n\u003cp\u003e“That’s right.”\u003c/p\u003e\n\u003cp\u003eEllie was shaking her head at Max. Her parents ignored her protest and so did he.\u003c/p\u003e\n\u003cp\u003e“Our daughter couldn’t be in safer hands, with her own FBI agent at her side,” William said. “Have you checked into one of the motels or the hotel yet?” he asked Max.\u003c/p\u003e\n\u003cp\u003e“No, sir, I came directly here.”\u003c/p\u003e\n\u003cp\u003e“Good,” he replied. “You’ll stay in the apartment over the garage. It’s not as bad as it sounds. In fact, it’s very comfortable, isn’t it, Claire?”\u003c/p\u003e\n\u003cp\u003e“Oh yes, it is.”\u003c/p\u003e\n\u003cp\u003e“I’m staying in the apartment,” Ellie said.\u003c/p\u003e\n\u003cp\u003e“Yes, dear, you are,” her mother agreed.\u003c/p\u003e\n\u003cp\u003e“There are two bedrooms,” her father reminded her.\u003c/p\u003e\n\u003cp\u003e“And you’re both adults,” her mother added.\u003c/p\u003e\n\u003cp\u003eEllie was speechless. It was so unlike her father to be lackadaisical about sleeping arrangements. Yes, she was an adult, but until this minute, her father had never treated her as such. And her mother’s attitude was even more shocking. She was always so prim and proper, a true Southern lady, who tended to worry a little too much about what other people would say. She apparently didn’t give a hoot about them now, though.\u003c/p\u003e\n\u003cp\u003e“I’ll admit I’ll sleep easier knowing you’ll be watching out for her,” William said. “Has Ellie mentioned Evan Patterson to you?”\u003c/p\u003e\n\u003cp\u003eMax nodded. “Yes, sir, I know all about him.”\u003c/p\u003e\n\u003cp\u003eHe sighed with relief. “My daughter keeps things inside. I wasn’t sure whether she’d shared her past with you, but I’m very pleased she did. Now you understand why I’m happy you’ll be staying with us.”\u003c/p\u003e\n\u003cp\u003e“Dad, Max didn’t say he could stay-”\u003c/p\u003e\n\u003cp\u003e“I’d love to stay here.”\u003c/p\u003e\n\u003cp\u003e“Good,” William said. “Do you think after dinner we might sit down and talk about Patterson for a minute?”\u003c/p\u003e\n\u003cp\u003e“Of course,” he answered.\u003c/p\u003e\n\u003cp\u003e“I’d love to find out about you two,” her mother said. “How long you’ve been seeing each other and how-”\u003c/p\u003e\n\u003cp\u003e“Later, Mom,” Ellie interrupted. “After dinner you may ask all the questions you want. The paintbrushes are going to dry out. Come on, Max. You offered to paint. Let’s go.”\u003c/p\u003e\n\u003cp\u003eHe followed her upstairs. She was muttering something, but Max couldn’t make out what she was saying. From her tone, he knew she wasn’t happy. Too bad, he thought. He had come all this way to protect her, and by God, that was exactly what he was going to do.\u003c/p\u003e\n\u003cp\u003eConcentrating solely on the job was going to take discipline. The first thought he’d had when he’d arrived at her house and saw her coming down the stairs toward him was that she was safe, and he’d felt a tremendous jolt of relief. The second thought was less professional. He’d wondered if her legs had gotten longer since he’d last seen her. By the time she’d reached him, he’d conjured up all sorts of fantasies about her.\u003c/p\u003e\n\u003cp\u003eEllie led the way into Annie’s bedroom. Max took a step back when he saw the color on the walls.\u003c/p\u003e\n\u003cp\u003eShe waited until he had shut the door behind him and then said, “It’s bad, isn’t it? Of course, it’s bad. You wouldn’t have come here if it was good news. You would have called, right? So it’s bad. Just tell me, Max. How bad?”\u003c/p\u003e\n\u003cp\u003eMax heard her father coming up the stairs. Now wasn’t the time to explain. Ellie was bound to get upset, and from her father’s response to seeing his gun, Max knew he wouldn’t take the news well at all.\u003c/p\u003e\n\u003cp\u003e“Roller or brush?” Max said.\u003c/p\u003e\n\u003cp\u003eShe blinked. “I’m sorry?”\u003c/p\u003e\n\u003cp\u003eHe repeated the question just as her father opened the door and stepped inside, saying, “I’ll use the roller. Why don’t you two paint the trim. How much do you have left to do, Ellie?”\u003c/p\u003e\n\u003cp\u003e“Two windows,” she answered.\u003c/p\u003e\n\u003cp\u003eThe trim was white, the walls an iridescent shade of lavender. Max took one window, Ellie the other. She kept glancing over at him while she tried to think of a way to get her father to leave, but he wasn’t going anywhere. He was in a cheerful and chatty mood, no doubt because her friend was armed.\u003c/p\u003e\n\u003cp\u003eOnce again she felt a pang of guilt. Having her home was a burden for him. She shouldn’t have given in to her mother’s pleas. It would have been so much better for her father if she had stayed away.\u003c/p\u003e\n\u003cp\u003e“You’ll have to see the falls while you’re here. It’s a short hike but worth it, isn’t it, Ellie?” he asked as he poured paint into the roller pan.\u003c/p\u003e\n\u003cp\u003e“Yes, it is,” she replied. “I don’t know that Max will have time-”\u003c/p\u003e\n\u003cp\u003e“Sure he will,” her father argued. “You did say you were going to be here until Ellie leaves, didn’t you, Max?”\u003c/p\u003e\n\u003cp\u003e“I did,” Max answered.\u003c/p\u003e\n\u003cp\u003eEllie glared at him. He winked at her.\u003c/p\u003e\n\u003cp\u003e“How long have you two been seeing each other?” her father asked.\u003c/p\u003e\n\u003cp\u003eDetermined to nip the personal questions in the bud, she said, “Awhile now, Dad. Max, did I tell you that my father has a Ph.D. in mathematics? He’s a dean now at the university. Did I mention that to you?”\u003c/p\u003e\n\u003cp\u003e“Ellie, Max doesn’t want to hear about my achievements. I’ll bet he’s curious about yours.”\u003c/p\u003e\n\u003cp\u003e“I am,” Max said. “What was she like as a child?”\u003c/p\u003e\n\u003cp\u003e“Difficult,” he said, grinning.\u003c/p\u003e\n\u003cp\u003e“I’m not surprised,” Max said.\u003c/p\u003e\n\u003cp\u003e“Hey…,” she began in protest.\u003c/p\u003e\n\u003cp\u003e“And challenging,” her father added. “She kept… amazing us.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003ePausing in his task, William held the roller over the pan while he considered which story to tell.\u003c/p\u003e\n\u003cp\u003e“She was about seven or eight, and there was a visiting professor…”\u003c/p\u003e\n\u003cp\u003e“Oh, Daddy, don’t tell the auditorium story.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-ideal-man-buchanan-renard-9/page-15.html","bookId":1828,"creation":"Oct 5, 2019 5:30:24 PM","modification":"Oct 5, 2019 5:30:24 PM"}
