{"id":88701,"no":34,"title":"Page 34","content":"\u003cp\u003e“I love you,” he said again.\u003c/p\u003e\n\u003cp\u003e“And I love you,” she admitted. “But that doesn’t mean-”\u003c/p\u003e\n\u003cp\u003eHe kissed her again, and she didn’t resist. She wrapped her arm around his neck and leaned into him. Oh, how she had missed him.\u003c/p\u003e\n\u003cp\u003eAnd shed buckets of tears. No, she wasn’t going to go through that again.\u003c/p\u003e\n\u003cp\u003e“I’ve got a surprise for you,” he said as he reached into his pocket. “I’ve been carrying this around for a year now.”\u003c/p\u003e\n\u003cp\u003eIt was an engagement ring. Annie stared into his eyes and saw the torment there.\u003c/p\u003e\n\u003cp\u003e“Annie, I’m so sorry I couldn’t tell you. Will you marry me?”\u003c/p\u003e\n\u003cp\u003e“I have to think about it,” she whispered. “And I’ve got a surprise for you, too.”\u003c/p\u003e\n\u003cp\u003eShe stood, then placed Meghan in his lap. “Meet your daughter.”\u003c/p\u003e\n\u003cp\u003eFORTY – TWO\u003c/p\u003e\n\u003cp\u003eYet another wedding.\u003c/p\u003e\n\u003cp\u003eEllie was thrilled with Annie’s news and hoped that Lucas’s family was as wonderful as Max’s. Simon had been Max’s best man at the wedding, and his other brothers had been groomsmen. She loved all of them, but she had a special bond with their parents. They were such kind, loving people. Simon had saved Max’s life, and his parents had nurtured him.\u003c/p\u003e\n\u003cp\u003eMax’s two-bedroom apartment overlooking the ocean was her home now. Once she was licensed to practice medicine in Hawaii, she went to work at one of the hospitals in the city. Ellie loved watching the weather channel in the dead of winter and laughing every time she heard about another snowstorm in the Midwest. Max remarked that her laughter sounded absolutely ghoulish.\u003c/p\u003e\n\u003cp\u003eThe Wheatleys, like Max’s parents, had already visited. Everyone who came hated to go home. Who could blame them?\u003c/p\u003e\n\u003cp\u003e“We live in paradise,” she whispered to Max late one night. They were in bed and had just made love.\u003c/p\u003e\n\u003cp\u003e“You’re still awake?”\u003c/p\u003e\n\u003cp\u003eShe laughed. “Yes,” she said. “I’ve been thinking about the Landrys. Ben told me they were appealing the verdict.”\u003c/p\u003e\n\u003cp\u003e“On what grounds?” he asked, rolling onto his back. He stacked his hands behind his head and yawned. “That they don’t like life in prison?”\u003c/p\u003e\n\u003cp\u003e“The judge really gave it to them, didn’t he?”\u003c/p\u003e\n\u003cp\u003e“They gave the order to kill you. Life in prison isn’t long enough, as far as I’m concerned.”\u003c/p\u003e\n\u003cp\u003e“What do you think happened to Greg Roper? After he pointed to those photos of Cal and Erika Landry, he vanished. Do you think he’s still alive? Or did they get to him and kill him? I hope he ran and hid from them.”\u003c/p\u003e\n\u003cp\u003e“There’s a good chance he’s still alive,” he said. “Cogburn told us he went to Roper and threatened to kill him and his family if he ever showed his face in St. Louis again. The police still have a missing person’s file active on him, but there’s hope he’ll show up sometime.”\u003c/p\u003e\n\u003cp\u003e“I hope so.” Ellie yawned. She trailed her fingers down Max’s chest and cuddled up against him. “Simon called.”\u003c/p\u003e\n\u003cp\u003e“What’s wrong with him now?”\u003c/p\u003e\n\u003cp\u003e“He thought he found a lump, but by the time he finished describing it to me, he decided it might be a callus.”\u003c/p\u003e\n\u003cp\u003e“He loves having a doctor in the family.”\u003c/p\u003e\n\u003cp\u003eShe adjusted her pillow and closed her eyes. “Don’t forget we’re having dinner with Ben and Addison and little Benjamin this weekend.”\u003c/p\u003e\n\u003cp\u003e“I won’t.”\u003c/p\u003e\n\u003cp\u003eEllie laid her head on Max’s chest, and he stroked her hair. Since they had just made passionate love, he thought she needed to hear how much she pleased him. “Our marriage…” He paused while he searched for the right words to tell her how happy she made him. “Our marriage…”\u003c/p\u003e\n\u003cp\u003eHer deep breathing stopped him.\u003c/p\u003e\n\u003cp\u003eSmiling to himself, he pulled the sheet up over her and whispered, “It’s all good.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-ideal-man-buchanan-renard-9/page-34.html","bookId":1828,"creation":"Oct 5, 2019 5:30:24 PM","modification":"Oct 5, 2019 5:30:24 PM"}
