{"id":88672,"no":5,"title":"Page 5","content":"\u003cp\u003e“Mentioned what?” he asked innocently.\u003c/p\u003e\n\u003cp\u003eBen decided to be blunt. “That she was frickin’ beautiful.” He quickly turned to Ellie to add, “You remind me of my wife. She’s beautiful. At least I think she’s still beautiful.”\u003c/p\u003e\n\u003cp\u003eEllie gave him a quizzical look. “You don’t know?”\u003c/p\u003e\n\u003cp\u003e“Every time I see her, she’s in the bathroom throwing up. But, yeah, I’m sure she’s still beautiful.”\u003c/p\u003e\n\u003cp\u003eShe laughed. “She’s pregnant.”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Yes. Man, it does smell good in here.”\u003c/p\u003e\n\u003cp\u003e“Stir-fry,” she repeated. “There’s plenty left, and it’s still hot. Would you like-”\u003c/p\u003e\n\u003cp\u003eShe didn’t bother to finish her question because both Max and Ben were already in her kitchen. Max looked for plates as Ben sampled a piece of chicken. While they devoured every bit of the stir-fry, Ellie straightened up her living room. Her desk was covered with stacks of papers, and there was another stack on the swivel chair that she needed to go through and decide to either shred or pack for storage. She quickly moved the papers from the chair to form another stack on top of the desk. It looked a bit precarious, but as long as no one bumped the desk, the papers should stay put.\u003c/p\u003e\n\u003cp\u003eThe two agents set their empty plates in the sink and joined her. When they were standing in her living room, the small area seemed even smaller. Ellie went to the sofa and sat down. Ben took the swivel chair and turned it to face her.\u003c/p\u003e\n\u003cp\u003e“Thanks, Ellie,” he said. “The food was great. I didn’t realize how hungry I was.”\u003c/p\u003e\n\u003cp\u003e“I’m glad you enjoyed it,” she replied.\u003c/p\u003e\n\u003cp\u003eMax moved around the room as though he were inspecting it. He seemed uptight, unlike the man she had met earlier who appeared to be so relaxed.\u003c/p\u003e\n\u003cp\u003e“Is there something you need, Agent Daniels?” she asked.\u003c/p\u003e\n\u003cp\u003e“Max,” he reminded her. “No, I just noticed you don’t have anything on your walls.”\u003c/p\u003e\n\u003cp\u003e“No, I don’t.”\u003c/p\u003e\n\u003cp\u003e“How come?”\u003c/p\u003e\n\u003cp\u003e“Everything I like is too expensive, and I don’t want to put up posters. I had enough of those in college.”\u003c/p\u003e\n\u003cp\u003e“So you’re poor,” Ben said.\u003c/p\u003e\n\u003cp\u003eShe laughed. “Yes.”\u003c/p\u003e\n\u003cp\u003e“I thought doctors made a lot of money.” Max made the comment.\u003c/p\u003e\n\u003cp\u003e“Some do,” she agreed. “But, like many of my colleagues, I have substantial student loans.”\u003c/p\u003e\n\u003cp\u003e“Don’t they pay you at that hospital?” Max snapped the question.\u003c/p\u003e\n\u003cp\u003e“Yes, they do.”\u003c/p\u003e\n\u003cp\u003e“Must not be much.”\u003c/p\u003e\n\u003cp\u003e“No, it isn’t.”\u003c/p\u003e\n\u003cp\u003eHe slowly circled her living room, acting like a caged animal searching for a way out. Ellie had the feeling he was angry about something and trying to keep it in check.\u003c/p\u003e\n\u003cp\u003e“What about photos? I know you have family. Don’t you like them?” Max asked, frowning.\u003c/p\u003e\n\u003cp\u003e“I like some of them, and, yes, I do have photos. They’re packed away.”\u003c/p\u003e\n\u003cp\u003e“Why are they packed away?” he demanded.\u003c/p\u003e\n\u003cp\u003e“I’m finished at St. Vincent’s Hospital on Tuesday.”\u003c/p\u003e\n\u003cp\u003eThe rapid-fire questions continued until she began to feel like a suspect, not a witness. Irritated, she started to answer just as rapidly.\u003c/p\u003e\n\u003cp\u003e“Those boxes in the corner by the window have been sitting there a long time. There’s dust on top of them. Why is that?”\u003c/p\u003e\n\u003cp\u003e“I’m a bad housekeeper,” she said with a straight face.\u003c/p\u003e\n\u003cp\u003e“You never unpacked them?” He made the question sound like an accusation.\u003c/p\u003e\n\u003cp\u003e“No, I never did.”\u003c/p\u003e\n\u003cp\u003e“Why not?”\u003c/p\u003e\n\u003cp\u003e“I like to be ready.”\u003c/p\u003e\n\u003cp\u003e“Ready for what?”\u003c/p\u003e\n\u003cp\u003e“Ready to pick up and leave at a moment’s notice,” she snapped back.\u003c/p\u003e\n\u003cp\u003e“Where are you going?”\u003c/p\u003e\n\u003cp\u003eShe shrugged. “I don’t know.”\u003c/p\u003e\n\u003cp\u003eHe stopped pacing and was now standing over her, making her extremely nervous. How could she have ever thought he was relaxed? She was beginning to think she should confess something just to get him to stop interrogating her.\u003c/p\u003e\n\u003cp\u003eBen was watching the exchange, astounded by Max’s aggressive behavior. Had he been alone with his partner, he would have asked him what in God’s name was wrong with him. He was acting as though he were about to pounce on her.\u003c/p\u003e\n\u003cp\u003e“You must have some idea where you’d like to go,” Max challenged.\u003c/p\u003e\n\u003cp\u003e“No, I don’t,” she answered sharply. “Is there any other personal information you need?”\u003c/p\u003e\n\u003cp\u003eSeeing Ellie’s indignation and suddenly realizing he’d sounded as though he were grilling her, he said, “I guess I’m not very good at small talk.”\u003c/p\u003e\n\u003cp\u003eThat was small talk?\u003c/p\u003e\n\u003cp\u003e“No kidding,” Ben drawled.\u003c/p\u003e\n\u003cp\u003eMax could see the scowl deepening on Ellie’s face, and he could almost feel the fire flashing from her eyes. He would have laughed had she not looked so annoyed. When he’d first met her, his opinion of her had been rather indifferent. Of course, he’d noticed that she was a beautiful, sexy woman he would love to take to bed. Nothing unusual about that. But then he’d watched how great she was with Sean Goodman. She was so calm and reassuring as she worked on him. Maybe it was all part of her job, but her kindness seemed genuine. Then, when she went back to the hospital to perform Sean’s surgery, Max’s impression of her expanded. Not only did he want to go to bed with her, he admired her as well. And when she gave him a little attitude in the stairwell and let him see her sense of humor, he realized he actually liked her… and wanted her. Nothing unusual about that.\u003c/p\u003e\n\u003cp\u003eHe saw everything in a different light, however, when he’d checked into her background. Not quite everything, he qualified. He wanted her in bed-that didn’t change-but he was filled with an overwhelming need to protect her. After reading her file, which was only a small portion of what she had gone through, Max felt great empathy for her. She had been powerless back then, with no control over what happened to her. He knew all about that, and that was why he wanted to help as much as he could. Ellie had been through enough. She didn’t need more heartache. And if she testified…\u003c/p\u003e\n\u003cp\u003eMax didn’t respond to Ellie’s question. Instead, he surprised her by sitting down next to her on the sofa. He was so close, if she moved, she’d be glued to him. Ellie was confused. What was he doing? There was a perfectly good overstuffed chair he could have taken, and yet he chose the sofa. What did that mean? Ellie didn’t know how to react. Should she move away? She didn’t want to, but should she? Just as she was questioning his motives, Max took a digital recorder out of his pocket. Oh. Now she understood. He had to sit next to her so that the recorder could pick up the conversation. Bummer.\u003c/p\u003e\n\u003cp\u003e“Ben, are you ready to get started?” Max asked.\u003c/p\u003e\n\u003cp\u003e“Sure,” he replied. “I’m the less experienced agent,” he explained to Ellie. “By eleven months.” He turned in the swivel chair and accidentally knocked the desk, starting an avalanche of papers to the floor.\u003c/p\u003e\n\u003cp\u003eEllie rushed to help pick up. “It’s a mess, I know, but I haven’t had time to go through everything. Most of it can probably be thrown away.”\u003c/p\u003e\n\u003cp\u003e“I’ve got this, Ellie. Go sit.” He scooped up several papers, straightened them, and made a pile against the wall. “They can stay on the floor, right?”\u003c/p\u003e\n\u003cp\u003eShe smiled. “Right.”\u003c/p\u003e\n\u003cp\u003eMax grabbed another stack of papers that was headed to the floor and put a heavy anatomy book on top to keep them from falling again.\u003c/p\u003e\n\u003cp\u003e“What’s this?” Ben held up several sheets that had been stapled together.\u003c/p\u003e\n\u003cp\u003e“What is it?” Max asked.\u003c/p\u003e\n\u003cp\u003e“Restraining order.”\u003c/p\u003e\n\u003cp\u003e“Yeah?” Glancing at Ellie, Max walked around the desk and took the papers from Ben. Just as he expected, they were orders against Evan Patterson. He quickly flipped through them and handed them back to Ben.\u003c/p\u003e\n\u003cp\u003eBen looked over the documents while Ellie remained silent, hoping he wouldn’t read through them.\u003c/p\u003e\n\u003cp\u003e“Who is Evan Patterson?”\u003c/p\u003e\n\u003cp\u003e“Oh, those papers are old,” she said.\u003c/p\u003e\n\u003cp\u003e“Uh-huh,” Ben agreed. “Who is he?”\u003c/p\u003e\n\u003cp\u003eShe had the feeling changing the subject wasn’t going to work. Ben was FBI, which meant he was trained to get people to answer questions, but she wished he’d leave this alone. The subject of Evan Patterson was very difficult for her to talk about or even think about. She wanted the nightmare to stay in the past.\u003c/p\u003e\n\u003cp\u003eEllie settled back on the sofa and pulled a pillow onto her lap. “I went to Sacred Heart High School for two years. He was there.”\u003c/p\u003e\n\u003cp\u003e“Did he leave high school, or did you?” Ben asked, curious.\u003c/p\u003e\n\u003cp\u003e“I was the first to leave… it was a long time ago.”\u003c/p\u003e\n\u003cp\u003eBen glanced at Max, knowing that he had also picked up on Ellie’s reticence.\u003c/p\u003e\n\u003cp\u003e“Where did you go after that?” Ben asked, thinking she had either transferred to another high school or perhaps been homeschooled to get away from Patterson.\u003c/p\u003e\n\u003cp\u003eEllie hesitated before answering. “I was in college.”\u003c/p\u003e\n\u003cp\u003eBen tilted the chair back. He could see her embarrassment.\u003c/p\u003e\n\u003cp\u003e“So you’re smart, huh?”\u003c/p\u003e\n\u003cp\u003eShe smiled. “And poor.”\u003c/p\u003e\n\u003cp\u003e“But real smart?” Ben asked.\u003c/p\u003e\n\u003cp\u003e“Prod,” Max said. “Chief of surgery calls her Prod.” He turned to her. “That’s short for prodigy, isn’t it?”\u003c/p\u003e\n\u003cp\u003eShe didn’t look happy that he had shared that information.\u003c/p\u003e\n\u003cp\u003e“Just one more question. Where’s Evan Patterson now?” Ben asked.\u003c/p\u003e\n\u003cp\u003e“I don’t know. If he was to come back to Winston Falls where my family lives, my father would let me know.” She lifted the pillow and squeezed it to her chest.\u003c/p\u003e\n\u003cp\u003eMax could tell she hated talking about Patterson. That was obvious. “I’ll find out where he is now,” he said.\u003c/p\u003e\n\u003cp\u003eFrowning, she asked, “Why? Why would you do that?”\u003c/p\u003e\n\u003cp\u003eBecause I know what he did to you, he thought. “It will give you a little peace of mind knowing exactly where he is, won’t it?” he asked.\u003c/p\u003e\n\u003cp\u003e“Yes, of course, but…”\u003c/p\u003e\n\u003cp\u003e“But what?”\u003c/p\u003e\n\u003cp\u003e“My father has friends in the FBI. Neither one of them could find Patterson. Why do you think you can? Do you think you’re better at it than they are?”\u003c/p\u003e\n\u003cp\u003eDid she realize she was repeating the same question the chief of surgery had asked her?\u003c/p\u003e\n\u003cp\u003eHe decided to answer in kind. “Absolutely. I am better.”\u003c/p\u003e\n\u003cp\u003eShe suddenly got it. “You’re as arrogant as I am.”\u003c/p\u003e\n\u003cp\u003e“When it comes to the job, yeah, I am.” He continued to stare into her gorgeous eyes as he asked, “Do you want me to find him or not?”\u003c/p\u003e\n\u003cp\u003e“Yes, please, but…” She started to say something more then changed her mind. “Thank you.”\u003c/p\u003e\n\u003cp\u003e“Hold on,” Ben began. “Catch me up. Did Patterson just decide to leave your hometown, or did something happen?”\u003c/p\u003e\n\u003cp\u003eShe sighed. And here she thought the conversation was finished. “Yes, something happened, and he was committed to the Stockton Institute, for a time anyway.”\u003c/p\u003e\n\u003cp\u003e“What’s the Stockton Institute?”\u003c/p\u003e\n\u003cp\u003eMax answered. “A state-run facility for the criminally insane. Patterson attacked her, damn near killed her. Read the reports. That will answer some of your questions.”\u003c/p\u003e\n\u003cp\u003eEllie frowned at Max when she said, “You knew all about Patterson before Ben saw the restraining order, didn’t you?” Before he could answer, she continued, “Of course, you did. My God, it’s only been what? Four? Five hours since we met?”\u003c/p\u003e\n\u003cp\u003e“Longer than that.”\u003c/p\u003e\n\u003cp\u003e“How did you get all that information so quickly?”\u003c/p\u003e\n\u003cp\u003e“It’s in your file.”\u003c/p\u003e\n\u003cp\u003eHer hand went to her throat. “For anyone to read?” She sounded appalled.\u003c/p\u003e\n\u003cp\u003e“No, not for just anyone.” Then, frowning, he asked, “What did you mean, Patterson went to Stockton for a time?”\u003c/p\u003e\n\u003cp\u003e“That wasn’t in the file?” she asked.\u003c/p\u003e\n\u003cp\u003e“No. Now tell me.” He sounded as though he were grilling her again.\u003c/p\u003e\n\u003cp\u003e“Patterson’s family is very wealthy, and they were able to get him transferred to a private facility. And guess what? Eventually he was given weekend passes to go home.”\u003c/p\u003e\n\u003cp\u003e“After he tried to kill you?” Ben asked.\u003c/p\u003e\n\u003cp\u003eOh God, she was going to have to dredge it all up again. She took a deep breath. “After Patterson left me for dead… actually, I was told he thought he had killed me…”\u003c/p\u003e\n\u003cp\u003e“Yes?” Ben urged when she hesitated. His tone was softer this time.\u003c/p\u003e\n\u003cp\u003e“He ran, and the police and FBI couldn’t find him right away. So my father, with the help of the two FBI agents who had become friends, decided I needed to go into hiding.”\u003c/p\u003e\n\u003cp\u003eMax filled in the blanks for Ben. “The son of a bitch had been terrorizing her for over a year. He’d even grabbed her a couple of times, but she was able to get away. He wasn’t going to give up until he killed her.”\u003c/p\u003e\n\u003cp\u003eEllie continued. “As soon as I was ready to leave the hospital, my father drove me here. One of his friends introduced him to a couple, the Wheatleys. They took me in. They’re both teachers and very kind people. They had no children of their own, and they opened their home to me.” For the first time since the topic had come up, she smiled. “They didn’t know what to do with me.”\u003c/p\u003e\n\u003cp\u003eShe didn’t expound, and neither Ben nor Max pressed.\u003c/p\u003e\n\u003cp\u003e“They took good care of me,” she said. “I stayed with them while I finished college and all the way through medical school and part of residency.”\u003c/p\u003e\n\u003cp\u003e“And you’re finishing your residency now,” Ben concluded.\u003c/p\u003e\n\u003cp\u003e“No, I’ve already finished my residency. Now I’m finishing my fellowship in trauma. Are we done talking about Patterson?”\u003c/p\u003e\n\u003cp\u003eBen nodded. “Almost. One last question, and we’ll move on. Just tell me, when did Patterson get released?”\u003c/p\u003e\n\u003cp\u003e“He’s been in and out for the past ten years. About six months ago, my father heard he’d gotten out and vanished. The attorneys were supposed to keep watch, and so were my father’s friends, but none of them were informed of his release. It was by chance that my father heard about him.” She clasped her hands together emphatically and said, “Now I’m done talking about this. You’re here to interview me about the shooting, remember? So why don’t you get to it.”\u003c/p\u003e\n\u003cp\u003eMax nodded to Ben, who pulled his chair closer to the coffee table and said, “Okay, let’s start. Go ahead and turn the recorder on, Max.”\u003c/p\u003e\n\u003cp\u003eBen stated the date, time, location, and the names of the people in the room for the recorder, then asked, “Dr. Sullivan, did you see Agent Sean Goodman get shot?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-ideal-man-buchanan-renard-9/page-5.html","bookId":1828,"creation":"Oct 5, 2019 5:30:24 PM","modification":"Oct 5, 2019 5:30:24 PM"}
