{"id":88675,"no":8,"title":"Page 8","content":"\u003cp\u003e“As this investigation progresses, you might be questioned again, either by the police or by the FBI, especially Agent Hughes. He may try to lead you or even coerce you to remember details you couldn’t recall before. Don’t tell him or anyone else more than you told Ben and me, that you didn’t see the couple well enough to recognize them.”\u003c/p\u003e\n\u003cp\u003eMax had become so serious and his tone so persistent, Ellie wondered why he was telling her this. Her thoughts went back to the conversations they’d had in her apartment.\u003c/p\u003e\n\u003cp\u003e“You haven’t told me much about this case or the people you’ve been chasing. You said their name was Landry, right?”\u003c/p\u003e\n\u003cp\u003e“That’s right.”\u003c/p\u003e\n\u003cp\u003e“And you said you’ve been trying to catch them for a long time.”\u003c/p\u003e\n\u003cp\u003e“When the Landrys moved to Honolulu and started doing business there, Ben and I were brought in. They were arrested, and the case was solid. We had three witnesses, but as I already mentioned, the case never made it to court.”\u003c/p\u003e\n\u003cp\u003e“You didn’t tell me why it didn’t make it to court.”\u003c/p\u003e\n\u003cp\u003e“Two of the witnesses disappeared. We’re still looking for them, but no luck so far.”\u003c/p\u003e\n\u003cp\u003e“What about the third witness?”\u003c/p\u003e\n\u003cp\u003e“Killed in a hit-and-run.”\u003c/p\u003e\n\u003cp\u003eEllie felt a shiver run down her arms.\u003c/p\u003e\n\u003cp\u003eMax let her absorb the information before continuing. “We need eyewitnesses who will testify against them, people who can positively connect them to a crime. But if those eyewitnesses come forward, we’ll have to guarantee their safety. And that’s why, if you have enough information to testify, you’ll probably end up in witness protection.”\u003c/p\u003e\n\u003cp\u003e“Oh no, I won’t,” she replied.\u003c/p\u003e\n\u003cp\u003e“I know how your life was turned upside down by Evan Patterson. You had to leave your home and your family for all those years. If you have to go into witness protection…”\u003c/p\u003e\n\u003cp\u003e“No, I would never allow that to happen. Max, I’ve spent half my life in hiding,” she whispered. “I think I’ve reached my breaking point. Lately, I’ve felt frozen. I can’t seem to make decisions as to where I want to live, and the idea of signing a contract, even for one year, scares me.”\u003c/p\u003e\n\u003cp\u003e“You’re waiting to find out where Patterson is, aren’t you?”\u003c/p\u003e\n\u003cp\u003eTime to admit the truth, she decided. “Yes, I am. Even now he’s controlling my life. I hate that. And now you’re suggesting I might have to hide from the Landrys. Enough,” she snapped. “I’ve really had enough. I told you and Ben that I don’t think I can identify either one of the Landrys. Shouldn’t that keep me safe from them?”\u003c/p\u003e\n\u003cp\u003eHe nodded. “Maybe. Just be careful… and stick to your story.”\u003c/p\u003e\n\u003cp\u003e“I will,” she answered. She studied him for a minute, thinking how thoughtful it was of him to try to protect her; then she asked, “Could you get into trouble for telling me about the other investigation that fell apart and about those witnesses?”\u003c/p\u003e\n\u003cp\u003e“No, I’m not giving away confidential information. You would have to spend a little time on the Internet searching for articles, but you could find out all about that case. It was in the newspapers.”\u003c/p\u003e\n\u003cp\u003e“Do you think those two witnesses who disappeared are still alive?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” he said, shaking his head. “I think they may have gotten spooked when they heard about the hit-and-run, and they took off.”\u003c/p\u003e\n\u003cp\u003eWho could blame them? she thought. She took a breath and said, “Thanks for telling me.”\u003c/p\u003e\n\u003cp\u003e“Just promise you’ll be careful.”\u003c/p\u003e\n\u003cp\u003e“I will.”\u003c/p\u003e\n\u003cp\u003eHe picked up his menu. “Are you ready to order?”\u003c/p\u003e\n\u003cp\u003e“I’m not very hungry.”\u003c/p\u003e\n\u003cp\u003eMax read through the menu, and when he glanced up at Ellie again, she was staring into space, lost in thought, absentmindedly turning her spoon over and over on the table. He should have stuck to his guns and waited until after dinner to tell her about the Landrys, but she’d been too perceptive and forced him to give her the news sooner than he’d planned. Way to go, Daniels, he chided himself. Here he was, sitting across from a gorgeous, sexy woman, and all she could think about was the danger that threatened to uproot her life.\u003c/p\u003e\n\u003cp\u003eDetermined to change her mood, he said, “Tell me something.”\u003c/p\u003e\n\u003cp\u003e“Yes?”\u003c/p\u003e\n\u003cp\u003e“On a scale of one to ten, how’s the date going so far?”\u003c/p\u003e\n\u003cp\u003eSEVEN\u003c/p\u003e\n\u003cp\u003eAs soon as the waiter had taken their orders and left,Max said, “I think every man in here is staring at you.”\u003c/p\u003e\n\u003cp\u003eThe comment surprised her, and she looked around. “You’re exaggerating.”\u003c/p\u003e\n\u003cp\u003eHe wasn’t. Ellie was stunning, and even he, as cynical as he had become, was a bit in awe of her. After spending a short time with her, however, he’d come to realize her appearance didn’t define her.\u003c/p\u003e\n\u003cp\u003eEllie said, “Do you know, when I walked out of ICU and saw you waiting in the hall, I thought you looked so relaxed. I almost envied you.”\u003c/p\u003e\n\u003cp\u003e“I was relaxed.”\u003c/p\u003e\n\u003cp\u003eShe didn’t argue, yet the look she gave him indicated she didn’t believe him.\u003c/p\u003e\n\u003cp\u003e“Okay, I was worried about Goodman,” he admitted. “And I was angry.”\u003c/p\u003e\n\u003cp\u003e“About the shooting.” It was a statement, not a question.\u003c/p\u003e\n\u003cp\u003e“Yes, of course the shooting, but I was also furious that the Landrys got away. We should have had them.” And with what was supposed to be an airtight case this time, he thought.\u003c/p\u003e\n\u003cp\u003e“What did Agent Hughes have to do with the investigation?” To clarify, she said, “You and Ben were talking about him when you were at my apartment.”\u003c/p\u003e\n\u003cp\u003e“Hughes flew down from Omaha to take charge when he heard the Landrys were involved. He’s been chasing them for about four years now.”\u003c/p\u003e\n\u003cp\u003e“You don’t like him much, do you?”\u003c/p\u003e\n\u003cp\u003eHe shrugged. “Our methods are different.”\u003c/p\u003e\n\u003cp\u003eTommy strolled over to their table, refilled their glasses, and handed the pitcher of ice water to a hovering waiter.\u003c/p\u003e\n\u003cp\u003e“Did you tell Max about the golfers yet?” he asked Ellie.\u003c/p\u003e\n\u003cp\u003e“No, I didn’t.”\u003c/p\u003e\n\u003cp\u003e“Come on, it’s a good story. She’s humble,” he told Max. “She won’t tell you how it really went down, but I will.”\u003c/p\u003e\n\u003cp\u003e“What happened?”\u003c/p\u003e\n\u003cp\u003eBoth Tommy and Max turned to her. There was no getting out of it, she knew.\u003c/p\u003e\n\u003cp\u003e“It turns out I have a bit of a temper when I’m pushed,” she began. “I’m not proud of that.”\u003c/p\u003e\n\u003cp\u003e“No, you kept your cool,” Tommy insisted. “It was that jerk you were with who lost his temper. The guy had an ego the size of Nevada.” To Max he said, “And all she did was try not to embarrass him.”\u003c/p\u003e\n\u003cp\u003e“Up to a point,” she interjected.\u003c/p\u003e\n\u003cp\u003e“See, here’s what happened,” Tommy continued. “There were four men, all of them in their fifties, I’m guessing, sitting at a table across my restaurant from where Ellie and the deadhead were sitting. The golfers were a loud bunch but not offensive. They were just having some fun, and they weren’t bothering any of my other customers. They’d had a lot to drink before they got here. Who could blame them? It was a real pisser out there that day, over ninety degrees.” He turned to Ellie. “Are you gonna help me tell it?”\u003c/p\u003e\n\u003cp\u003eShe laughed. “All of them had ordered steaks,” she explained.\u003c/p\u003e\n\u003cp\u003e“Grade A prime. Meat that will melt in your mouth,” Tommy crooned. “I only serve the best.”\u003c/p\u003e\n\u003cp\u003e“I happened to look over just as one of the golfers took a bite of his steak.”\u003c/p\u003e\n\u003cp\u003e“It was a twenty-one-ounce porterhouse,” Tommy interjected. “One of the customers’ favorites.”\u003c/p\u003e\n\u003cp\u003e“The man stuffed a piece the size of a small roast into his mouth. I couldn’t believe it,” she added. “I watched him, hoping he’d keep chewing.”\u003c/p\u003e\n\u003cp\u003e“But he didn’t,” Tommy said, grinning.\u003c/p\u003e\n\u003cp\u003e“I’m guessing it didn’t melt in his mouth,” Max said.\u003c/p\u003e\n\u003cp\u003e“No, it didn’t.” Ellie continued, “He swallowed and, of course, began to choke. He tried to stand, then crashed to the floor.”\u003c/p\u003e\n\u003cp\u003e“I didn’t get to see any of this,” Tommy said. “I was busy in the front, but I heard the guy’s friends shouting for help and yelling that their friend was having a heart attack. I ran over to see for myself, and I saw him on the floor. The guy’s face was getting red.” Turning to Ellie again, he said, “Go ahead, you tell what happened next.” Tommy’s enthusiasm was comical.\u003c/p\u003e\n\u003cp\u003e“My date, Dr. Dwight Parish, said, ‘I’ve got this,’ and ran over to the golfer, whose name I later found out was Chuck,” she said.\u003c/p\u003e\n\u003cp\u003e“Chuck the Choker is what I dubbed him,” Tommy added.\u003c/p\u003e\n\u003cp\u003e“What did you do?” Max asked Ellie.\u003c/p\u003e\n\u003cp\u003e“I started the clock the second Chuck tried to swallow the meat-”\u003c/p\u003e\n\u003cp\u003eHe interrupted. “What do you mean, you started the clock?”\u003c/p\u003e\n\u003cp\u003e“Oxygen deprivation,” she explained. “There was plenty of time, but I always start the clock, which means I note the time down to the second.”\u003c/p\u003e\n\u003cp\u003e“The deadhead announces he’s a doctor,” Tommy said, “and he kneels down beside Chuck and starts pushing his chest, giving him CPR. He, too, believed Chuck was having a heart attack. The jerk acted like he was running a seminar or something, talking to the crowd while he pumped Chuck’s chest.”\u003c/p\u003e\n\u003cp\u003e“Then what happened?” Max wondered.\u003c/p\u003e\n\u003cp\u003e“I tried to explain to Dwight that the man was choking,” Ellie said.\u003c/p\u003e\n\u003cp\u003e“Yeah, she did,” Tommy agreed. “I stood beside her. She was real nice about it, but the deadhead wouldn’t listen, even after she told him she’d seen Chuck try to swallow a hunk of meat. Deadhead was too busy dazzling the crowd to pay attention. And all that pumping didn’t dislodge the meat, did it?”\u003c/p\u003e\n\u003cp\u003e“No, it didn’t,” Ellie said.\u003c/p\u003e\n\u003cp\u003e“And I’m watching, getting real worried. It’s bad for business when a customer dies in your restaurant.”\u003c/p\u003e\n\u003cp\u003eMax had to agree. “Yeah, that would be bad.”\u003c/p\u003e\n\u003cp\u003e“I didn’t know the kid was a doctor then,” he added. “But she was trying to convince deadhead that Chuck wasn’t having a heart problem-”\u003c/p\u003e\n\u003cp\u003e“Had anyone called nine-one-one?”\u003c/p\u003e\n\u003cp\u003e“Oh yeah, of course. So tell him what happened next,” Tommy urged.\u003c/p\u003e\n\u003cp\u003e“I was watching the time,” she said. “And I politely asked Dwight to get out of my way.”\u003c/p\u003e\n\u003cp\u003eMax raised an eyebrow. There was something about the way she made the comment that told him she wasn’t quite telling the truth. “Politely, huh?”\u003c/p\u003e\n\u003cp\u003e“I thought so.”\u003c/p\u003e\n\u003cp\u003e“Before you go on, tell me, what kind of doctor is Dwight?”\u003c/p\u003e\n\u003cp\u003e“He just finished his residency.”\u003c/p\u003e\n\u003cp\u003e“In what field?”\u003c/p\u003e\n\u003cp\u003e“Psychiatry.”\u003c/p\u003e\n\u003cp\u003e“Ah,” he said, smiling.\u003c/p\u003e\n\u003cp\u003e“It’s an important and difficult residency,” she told him. “However, Dwight has a Superman complex and was determined to revive the golfer. If he had had paddles, he would have tried to shock him. I say ‘try’ because I wouldn’t have let him.”\u003c/p\u003e\n\u003cp\u003e“Dwight sounds like a jackass,” he commented.\u003c/p\u003e\n\u003cp\u003eTommy nodded vigorously.\u003c/p\u003e\n\u003cp\u003e“Okay, so go on,” he urged, caught up in the story, but before she could continue, he asked, “Weren’t you a little worried? What if you couldn’t get the meat out?”\u003c/p\u003e\n\u003cp\u003eShe looked astonished, as though she couldn’t understand why he’d ask such a silly question.\u003c/p\u003e\n\u003cp\u003e“There was still plenty of time, and I had a backup plan. Clean steak knife, alcohol. If I had to, I’d open his throat. I wasn’t going to let him die. All of what Tommy and I have told you took less than a minute,” she added. “It sounds like a lot was going on, but it happened really fast. I explained that the man was choking, but Dwight continued to argue that I was wrong, that it was a heart attack. He said he knew the symptoms. He was once again talking more to the crowd than to me, and it was difficult to get a word in.\u003c/p\u003e\n\u003cp\u003e“I’m a trauma surgeon,” she reminded Max. “And we are trained to take charge. We’re… aggressive when we need to be. I tried to explain to Dwight… but he just wouldn’t listen, so I did what I had to do…”\u003c/p\u003e\n\u003cp\u003eTommy finished for her, “She used her foot and knocked Dwight out of the way. He landed halfway across the room.”\u003c/p\u003e\n\u003cp\u003e“Tommy helped me get Chuck upright, then I dislodged the meat and pulled it out of his throat. All the while I’m checking the clock. It was all good,” she said. “I still had plenty of time.”\u003c/p\u003e\n\u003cp\u003e“I wanted to throw the meat at Dwight, but she wouldn’t let me,” Tommy grumbled.\u003c/p\u003e\n\u003cp\u003e“And Chuck?” Max asked.\u003c/p\u003e\n\u003cp\u003e“No worse for the wear,” Tommy said. He stepped aside to let the waiter set plates in front of them. “You kids go ahead and eat your salads now, and I’ll check on your dinners.”\u003c/p\u003e\n\u003cp\u003eAs soon as he left, Max asked, “Did good old Dwight ask you out on another date?”\u003c/p\u003e\n\u003cp\u003e“Like I would go?” She shook her head. “Since I had had my fingers down Chuck’s throat, I went to the ladies’ room to wash my hands, and when I came back to the table, Dwight had taken off.”\u003c/p\u003e\n\u003cp\u003e“What a gentleman.”\u003c/p\u003e\n\u003cp\u003eAs the evening wore on, Max asked questions about her work. It was obvious that she had a real passion for helping people, and he loved the way her eyes lit up when she talked about them.\u003c/p\u003e\n\u003cp\u003e“It must be stressful at times,” he commented.\u003c/p\u003e\n\u003cp\u003e“It is,” she answered. “But what about you? Your job has to be riddled with stress.”\u003c/p\u003e\n\u003cp\u003e“Sometimes,” he admitted. He smiled and added, “And then there are those criminals who all but capture themselves. One of my first cases as an agent I barely had to investigate.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” she asked.\u003c/p\u003e\n\u003cp\u003eHe put down his fork and leaned back in his chair. “It was a robbery of a neighborhood bank, a one-man job. I don’t think the robber had much experience, though. When he walked into the bank with a cap pulled down over his eyes and a gun concealed in his pocket, he found the lobby crowded with customers. He was so nervous, he decided he should wait until they had cleared out before going up to the teller to make his demands. But he didn’t want to look suspicious just milling around the bank doing nothing, so he went to a table with some forms stacked on top.\u003c/p\u003e\n\u003cp\u003e“In the surveillance tapes, you could see him pick up the pen and start writing on one of the forms. He must have been pretty distracted because, after he finally made it to the teller and got away with the cash, he didn’t think to pick up the forms he had been filling out.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-ideal-man-buchanan-renard-9/page-8.html","bookId":1828,"creation":"Oct 5, 2019 5:30:24 PM","modification":"Oct 5, 2019 5:30:24 PM"}
