{"id":88676,"no":9,"title":"Page 9","content":"\u003cp\u003e“What were they?” Ellie asked.\u003c/p\u003e\n\u003cp\u003e“Applications for a job.”\u003c/p\u003e\n\u003cp\u003e“No,” she said incredulously.\u003c/p\u003e\n\u003cp\u003e“Yep,” he said. “He wrote down his name, address… everything we needed to drive to his house and pick him up.”\u003c/p\u003e\n\u003cp\u003e“I can’t believe anyone would be that stupid.”\u003c/p\u003e\n\u003cp\u003eHe nodded agreement. “A friend of mine who’s on the police force in Honolulu told me about a crime he covered where this man went into a convenience store to rob it. He got the money from the cash register and then demanded the clerk hand over a bottle of whiskey, too. Out of habit, the clerk asked to see some form of ID, and…”\u003c/p\u003e\n\u003cp\u003e“He gave him his ID,” she finished.\u003c/p\u003e\n\u003cp\u003e“That’s right.”\u003c/p\u003e\n\u003cp\u003e“Tell me another one,” she pleaded, laughing.\u003c/p\u003e\n\u003cp\u003e“I’ve got a hundred of them, but just one more,” he said. “It’s my favorite. There was this one guy who tried to rob a bank. He carried a grocery bag to use as a mask to conceal his identity. His ingenious plan was to put it over his head, then throw the front door of the bank open and rush in. He’d cut holes in the bag for his eyes but evidently hadn’t tried it out because, when he put it on, the holes lined up with his forehead. On the tape, you see the guy come barging into the bank with a bag over his head, waving his gun and turning in circles, trying to get the tellers to give him the cash. He was threatening a potted plant.”\u003c/p\u003e\n\u003cp\u003eMax liked the way Ellie’s eyes sparkled when she laughed. The waiter appeared with the bill, and he knew it was almost time for them to leave. He was sorry to see the evening end.\u003c/p\u003e\n\u003cp\u003e“Ellie, if Dwight left you here, how did you get home?”\u003c/p\u003e\n\u003cp\u003e“I was going to take a cab, but Tommy’s wife, Mary, was on her way out the door, and she drove me home. She’s not here tonight, or Tommy would have brought her over to our table to introduce her. He’s very proud of her. They’ve been married for almost thirty years.”\u003c/p\u003e\n\u003cp\u003e“That makes them unique.”\u003c/p\u003e\n\u003cp\u003e“You sound cynical.”\u003c/p\u003e\n\u003cp\u003e“When it comes to marriage, I guess I am. I’ve had friends whose happily-ever-after lasted about three years.”\u003c/p\u003e\n\u003cp\u003e“My parents have been married a long time, and they’re not an anomaly.”\u003c/p\u003e\n\u003cp\u003eHe didn’t comment. “Are you ready to go?”\u003c/p\u003e\n\u003cp\u003eHe surprised her by taking her hand as they walked through the restaurant. It wasn’t until they were once again in the car and on their way back to her apartment that she returned to the subject of his cynicism. She wanted to know what had happened to make him so sour.\u003c/p\u003e\n\u003cp\u003e“I take it your parents are divorced?”\u003c/p\u003e\n\u003cp\u003e“No. They’re not. They’ve been married a long time, too.”\u003c/p\u003e\n\u003cp\u003e“But they’re miserable.”\u003c/p\u003e\n\u003cp\u003eHe laughed. “No, they’re happy together.”\u003c/p\u003e\n\u003cp\u003e“Then it’s just you, unless…”\u003c/p\u003e\n\u003cp\u003e“Unless what?”\u003c/p\u003e\n\u003cp\u003e“How many ex-wives do you have?”\u003c/p\u003e\n\u003cp\u003e“None,” he assured her. “I’ve never been married.”\u003c/p\u003e\n\u003cp\u003e“Any long-term relationships?”\u003c/p\u003e\n\u003cp\u003eHe glanced at her. “Define long-term.”\u003c/p\u003e\n\u003cp\u003e“More than three months.”\u003c/p\u003e\n\u003cp\u003eHe had to think about it. “No,” he said. “I like women, Ellie, and the women I take to bed know there isn’t going be a long-term anything.”\u003c/p\u003e\n\u003cp\u003eWas it a different woman every night? She didn’t have the nerve to ask.\u003c/p\u003e\n\u003cp\u003e“What about you?” he asked. “Are you involved with anyone?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“How come?”\u003c/p\u003e\n\u003cp\u003e“No time,” she said. And no desire in a long while… until you came along, she silently added.\u003c/p\u003e\n\u003cp\u003e“That’s an excuse, not a reason,” he told her. “What about friends with benefits… you know… casual sex?”\u003c/p\u003e\n\u003cp\u003eThe question surprised her. “No, so far not interested. Some of my friends have sex with friends, and they tell me it releases a lot of stress. It just seems a little too cold and clinical to me.”\u003c/p\u003e\n\u003cp\u003eThe rest of the ride home was quiet, but she wasn’t uncomfortable with the silence. Ellie kept thinking about her answers to his questions. No sex, no friends with benefits, no involvement… My God, she’d made herself sound like a female eunuch. And a bore.\u003c/p\u003e\n\u003cp\u003eMax parked in front of her building and walked inside with her. He insisted on checking her apartment to make sure it was safe, which Ellie appreciated. It took as long as a hiccup. She waited by her door as he looked around. Soft light from a single lamp illuminated the living room.\u003c/p\u003e\n\u003cp\u003e“Would you like something to drink?” she asked as he walked toward her.\u003c/p\u003e\n\u003cp\u003e“No, I’m good.”\u003c/p\u003e\n\u003cp\u003eHe was inches away. She swallowed and said, “I have to tell you…”\u003c/p\u003e\n\u003cp\u003e“What?” he asked as he planted his hands against the door on either side of her.\u003c/p\u003e\n\u003cp\u003e“I liked the date portion of the evening much better than the serious talk.”\u003c/p\u003e\n\u003cp\u003e“The date portion isn’t over yet.”\u003c/p\u003e\n\u003cp\u003eAnd with that he leaned down and kissed her. His lips on hers felt sweet. It was a soft kiss until her mouth opened under his and she moved into him. She sighed when his tongue swept inside and rubbed against hers. His touch was electrifying.\u003c/p\u003e\n\u003cp\u003eAnd that was only the beginning.\u003c/p\u003e\n\u003cp\u003eHe wrapped his arms around her and pulled her up against him as his mouth slanted over hers again and again.\u003c/p\u003e\n\u003cp\u003e“Damn, you taste good.” His voice was raspy. He kissed the side of her neck and felt her shiver.\u003c/p\u003e\n\u003cp\u003eShe put her arms around his neck and her fingers tugged on his hair to get him to kiss her again. She had wondered what it would feel like to be kissed by him, but no fantasy could match the reality. He overwhelmed her, and it was wonderful. He kissed her again, a hot, wet, openmouthed kiss that made her want much, much more, and when he pulled back she felt dazed.\u003c/p\u003e\n\u003cp\u003e“Do you want me to stay or leave?” he asked.\u003c/p\u003e\n\u003cp\u003eShe kissed the pulse at the base of his neck. “I guess I can try casual,” she whispered, shocked by how ragged her own voice sounded.\u003c/p\u003e\n\u003cp\u003e“Sweetheart, if I stay, it isn’t gonna be casual.”\u003c/p\u003e\n\u003cp\u003eHe tilted her chin up with his thumb, needing to see her eyes and hear her say the words before he started tearing his clothes off and then hers.\u003c/p\u003e\n\u003cp\u003eHis cell phone rang a scant second before Ellie’s phone beeped.\u003c/p\u003e\n\u003cp\u003eMax took a deep breath, then reluctantly pulled away from her to answer the call. Ellie found her phone in her purse and read the text.\u003c/p\u003e\n\u003cp\u003e“I’m on my way,” he said into his phone. He ended the call and looked up to see Ellie opening the door.\u003c/p\u003e\n\u003cp\u003e“There’s been a shooting at the hospital.”\u003c/p\u003e\n\u003cp\u003eAt the same time she said, “I’ve been called in to surgery.”\u003c/p\u003e\n\u003cp\u003eEIGHT\u003c/p\u003e\n\u003cp\u003eEllie thought she should drive herself to the hospital, but Max disagreed. He wasn’t going to let her out of his sight until he knew what in thunder was going on. Ignoring her protests, he grabbed her keys, locked the dead bolts, and pulled her along to his car.\u003c/p\u003e\n\u003cp\u003e“I could be in surgery all night,” she pointed out.\u003c/p\u003e\n\u003cp\u003e“I’ll wait and drive you home.”\u003c/p\u003e\n\u003cp\u003e“But that could be hours…”\u003c/p\u003e\n\u003cp\u003e“I’ll wait.”\u003c/p\u003e\n\u003cp\u003eShe stopped arguing. The set of his jaw indicated he was going to be stubborn. She gave him directions to a shortcut crossing over the highway, and then she called Wendy, the ER nurse, to find out what she was going to be walking into.\u003c/p\u003e\n\u003cp\u003e“It’s another pileup on I-70,” Wendy said. “We’ve got mangled bodies on their way in. Dr. Westfield wants you here now.”\u003c/p\u003e\n\u003cp\u003e“I’m on my way,” she said. “I heard there was a shooting.”\u003c/p\u003e\n\u003cp\u003e“Yes, there was, and right inside the emergency room doors. Gangs are becoming more accommodating. They’re shooting each other right where they know they can get help. Pretty soon they’ll be shooting it out in front of the OR doors. Cuts out the middleman, you know-the ambulance driver, the paramedic. I’m telling you, Ellie, it’s a war zone in the ER now.”\u003c/p\u003e\n\u003cp\u003e“I’ll be there soon.”\u003c/p\u003e\n\u003cp\u003eShe disconnected the call and turned to Max to repeat what Wendy had told her.\u003c/p\u003e\n\u003cp\u003e“It’s a little surprising it hasn’t happened before now,” she said. “Even with security, the number of weapons confiscated from gangs when they’re brought into the hospital is shocking. It was only a matter of time before one of those weapons was overlooked.”\u003c/p\u003e\n\u003cp\u003e“The hospital should spring for more security. Triple it,” he said. “Only way to control it.”\u003c/p\u003e\n\u003cp\u003eShe agreed. “Who called you about the shooting?”\u003c/p\u003e\n\u003cp\u003e“Ben.”\u003c/p\u003e\n\u003cp\u003e“He was at the hospital this late?”\u003c/p\u003e\n\u003cp\u003e“He was heading back to check on Sean when he heard there were shots in the hospital. He should be there by now. We need to find out what’s going on, to make sure Sean wasn’t the target. We’ve got an agent watching out for him.”\u003c/p\u003e\n\u003cp\u003e“Do you think the Landrys would send someone to…”\u003c/p\u003e\n\u003cp\u003e“Better safe than sorry.”\u003c/p\u003e\n\u003cp\u003eMax took the entrance to the hospital on two wheels and screeched to a stop near the emergency room doors.\u003c/p\u003e\n\u003cp\u003e“If you can’t find me on the surgical floor, look in Sean’s room,” he told her.\u003c/p\u003e\n\u003cp\u003eThe emergency room looked like a set for a disaster movie. Each bay was packed. Doctors and nurses rushed from one to the other tending to victims of the highway accident. Mixed in among them were a few gang members, some handcuffed to their gurneys, also waiting to be treated for their wounds. Policemen were stationed around the area.\u003c/p\u003e\n\u003cp\u003eMost of the accident victims were dazed and quiet, but the gang members were not so compliant. Some were screaming for drugs while others shouted obscenities and threats because they weren’t getting priority attention. It was loud and chaotic.\u003c/p\u003e\n\u003cp\u003eBen was waiting just inside the doors. “It’s bedlam in here.”\u003c/p\u003e\n\u003cp\u003eHe was right. They had to shout to be heard.\u003c/p\u003e\n\u003cp\u003eEllie realized she was gripping her phone and didn’t have her purse or a pocket to put it in. Without a thought as to what she was doing, she handed the phone to Max. He already had her keys. He might as well hold her phone, too.\u003c/p\u003e\n\u003cp\u003eMax and Ben stayed right behind her as she made her way around gurneys and supply carts.\u003c/p\u003e\n\u003cp\u003e“How’s Sean?” Max asked immediately.\u003c/p\u003e\n\u003cp\u003e“He’s doing okay. There’s someone with him now.”\u003c/p\u003e\n\u003cp\u003e“What’s the word on the shooting?”\u003c/p\u003e\n\u003cp\u003e“From what I’ve gathered, a rookie cop was watching the ER doors. A guy walked in, and when his jacket fell open, the cop spotted a gun in his pocket. The cop pulled his weapon and told the guy to hand over his gun, but he drew on him. The rookie had no choice but to fire, shot him in the chest. There were enough witnesses to prove it was self-defense. The doctors tried to resuscitate the shooter, but it was too late. The police claim there’s a gang war going on.”\u003c/p\u003e\n\u003cp\u003eEllie heard him. “It seems there always is,” she said.\u003c/p\u003e\n\u003cp\u003e“One of the officers told me there was a real bloodbath tonight at some deserted warehouse. An ambush,” he added. “Two dead, six injured. Most are thinking the shooter was here on a vendetta, but a couple of people I talked to said he didn’t fit the gangbanger profile.”\u003c/p\u003e\n\u003cp\u003e“No ID?” Max asked.\u003c/p\u003e\n\u003cp\u003e“No,” Ben answered. “Probably wouldn’t be a bad idea for us to follow up on this.”\u003c/p\u003e\n\u003cp\u003e“We don’t usually see this crowd until the middle of the night,” Ellie remarked as she pushed a gurney aside so they could pass.\u003c/p\u003e\n\u003cp\u003eMax noticed that she was oblivious to the catcalls and the crude compliments shouted at her from various gurneys. One skinhead yelled something so obscene Max wanted to grab him by the neck, but Ellie didn’t seem the least affected.\u003c/p\u003e\n\u003cp\u003e“Hey, wait up, Ellie,” Ben said. “You passed the elevators.”\u003c/p\u003e\n\u003cp\u003e“We’re taking the stairs,” Max told him.\u003c/p\u003e\n\u003cp\u003e“Okay,” he said, not comprehending why anyone would run up three flights when there were perfectly good elevators just steps away.\u003c/p\u003e\n\u003cp\u003eMax climbed the stairs ahead of them and opened the door on the fourth floor. With a parting nod, Ellie ran to the locker room to change into scrubs. A seventy-year-old man was waiting on the operating table for her. His car had been sandwiched between a semi and a moving van on the highway, and he had suffered a ruptured kidney. It would take her the next few hours to complete the partial nephrectomy.\u003c/p\u003e\n\u003cp\u003eShe didn’t see Max again until almost one in the morning. Just as he had said, he was in Sean’s room. He was sprawled in a chair watching one of the news channels. The sound was so low she didn’t know how he could hear it. Ben was there, too. He was sound asleep in a chair on the other side the bed. There was an agent sitting in a chair outside of Sean’s door.\u003c/p\u003e\n\u003cp\u003eBen woke up when she brushed past him. Startled, he jumped to his feet, realized where he was, and stepped back so Ellie could get to Sean.\u003c/p\u003e\n\u003cp\u003eYawning, he whispered, “Good night,” and quietly left the room.\u003c/p\u003e\n\u003cp\u003eEllie had already changed back into street clothes. Since she was in his room, she decided to check Sean’s incision. She slipped on a pair of gloves and gently pulled the hospital gown down. Sean slept through her inspection. When she turned around, Max was waiting for her by the door. His hair was tousled, and she thought he looked incredibly sexy.\u003c/p\u003e\n\u003cp\u003eCan anyone be too tired for sex? She was dead on her feet, but she still wanted to jump his bones. Good thing he wasn’t a mind reader.\u003c/p\u003e\n\u003cp\u003eAs they walked down the corridor, he commented, “It’s the middle of the night. How come you look so good?”\u003c/p\u003e\n\u003cp\u003eShe had glanced at herself in the mirror when she was changing, and she knew she looked like hell. “You need glasses.”\u003c/p\u003e\n\u003cp\u003eHe smiled. “No, I don’t.”\u003c/p\u003e\n\u003cp\u003eThey took their time descending the stairs. Ellie was used to running everywhere, but she didn’t mind the slow pace. In fact, she fought the urge to lean into him.\u003c/p\u003e\n\u003cp\u003e“So what happens now?” she asked.\u003c/p\u003e\n\u003cp\u003e“I take you home,” he answered.\u003c/p\u003e\n\u003cp\u003e“I mean with the Landry case.”\u003c/p\u003e\n\u003cp\u003e“Tomorrow-or rather, today-after you’ve had some sleep, you’ll need to go to the police station and look at some photos. Agent Hughes will be there.”\u003c/p\u003e\n\u003cp\u003e“And you?”\u003c/p\u003e\n\u003cp\u003e“Ben and I will be doing some paperwork, and then we fly back to Honolulu.”\u003c/p\u003e\n\u003cp\u003eAll thoughts of tearing his clothes off and having mind-blowing sex came to a screeching halt. It would have been an amazing night, she knew, but it would have been just one night. Recreational sex came with a price… especially for her. She wasn’t the sophisticated and experienced sort who could have sex with a man and forget about him the next morning. Max was leaving for good, and she would never see him again, so it would be best if they said their good-byes and went their separate ways. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-ideal-man-buchanan-renard-9/page-9.html","bookId":1828,"creation":"Oct 5, 2019 5:30:24 PM","modification":"Oct 5, 2019 5:30:24 PM"}
