{"id":94985,"no":15,"title":"Page 15","content":"\u003cp\u003eAfter we split up, I sat briefly in my minivan, searching for a psychic hit that wasn\u0027t there. Despite the many abilities I\u0027d been given, a psychic connection to my own kids was not one of them.\u003c/p\u003e\n\u003cp\u003eFor now, I was just a mom with a missing daughter.\u003c/p\u003e\n\u003cp\u003eI had just put the vehicle into gear, mentally going through a list of her friends and where they lived, when my cell phone rang. I gasped and swerved a little and reached for my cell.\u003c/p\u003e\n\u003cp\u003eKingsley Fulcrum.\u003c/p\u003e\n\u003cp\u003eShit.\u003c/p\u003e\n\u003cp\u003eI switched on my Bluetooth. \"Hey.\"\u003c/p\u003e\n\u003cp\u003e\"Sam! I just got your text. Have you found her?\"\u003c/p\u003e\n\u003cp\u003eI had indeed sent him a text, but now I regretted doing so. Kingsley Fulcrum was the last person I wanted to think about now.\u003c/p\u003e\n\u003cp\u003e\"Not yet,\" I said, as I turned right onto Commonwealth. My sister lived closer to downtown than I did. People were everywhere. I scanned the streets.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m coming out now. Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said. \"Don\u0027t come.\"\u003c/p\u003e\n\u003cp\u003e\"What - \"\u003c/p\u003e\n\u003cp\u003e\"I sent you that text an hour ago. Where were you?\"\u003c/p\u003e\n\u003cp\u003eHe paused only briefly, but tellingly. \"I was with a client.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m sure you were, big guy. And don\u0027t worry, we\u0027ve got it handled.\"\u003c/p\u003e\n\u003cp\u003e\"Sam - wait! Are you saying you don\u0027t want my help?\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what I\u0027m saying,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Sam - \"\u003c/p\u003e\n\u003cp\u003eBut I had already clicked off.\u003c/p\u003e\n\u003cp\u003eI sat back and gripped the wheel and wound slowly through downtown Fullerton, knowing that I could have used Kingsley\u0027s help, and knowing that I was allowing the hurt in my own heart to possibly get in the way of such help.\u003c/p\u003e\n\u003cp\u003eBut I just couldn\u0027t see him. Or talk to him.\u003c/p\u003e\n\u003cp\u003eNot now. Perhaps not ever. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-games-vampire-for-hire-6/page-15.html","bookId":2135,"creation":"Oct 5, 2019 6:12:12 PM","modification":"Oct 5, 2019 6:12:12 PM"}
