{"id":95010,"no":40,"title":"Page 40","content":"\u003cp\u003eThe house was gated and beautiful.\u003c/p\u003e\n\u003cp\u003eIt was also difficult to find for anyone who wasn\u0027t an ace private investigator. Andre Fine wasn\u0027t showing up in my basic records searches. No surprise there. Many celebrity-types were hard to find. Often their properties and homes were in the names of their accountants or managers or other family members. In Andre Fine\u0027s case, the home was under a sister\u0027s name. It was a nice precaution to keep people like me from looking them up.\u003c/p\u003e\n\u003cp\u003eExcept most private investigators didn\u0027t have the federal government\u0027s massive resources at their disposal. Or an ex-partner who owed his love life to them.\u003c/p\u003e\n\u003cp\u003eI wasn\u0027t here to interview Andre Fine. I wasn\u0027t here hoping he would see me. I suspected there was one way - and one way only - to get a confession from him.\u003c/p\u003e\n\u003cp\u003eFor now, I waited down the street in my minivan, where I hoped to attract little or no attention. Generally, a woman sitting alone in a minivan on a quiet street attracted little attention. A man in a minivan would warrant a call to the police.\u003c/p\u003e\n\u003cp\u003eSometimes it\u0027s good to be me.\u003c/p\u003e\n\u003cp\u003eOr a woman.\u003c/p\u003e\n\u003cp\u003eAs I waited and watched, I reflected on the fact that tonight was a big night in the Moon household. After all, tonight was the first night that Tammy and Anthony would watch themselves. Without a babysitter.\u003c/p\u003e\n\u003cp\u003eTammy was proving to be surprisingly mature, and Anthony was already stronger than most men. My sister, of course, was on high alert, with her phone nearby. Forty minutes into my surveillance, my text message alert chimed.\u003c/p\u003e\n\u003cp\u003eI glanced at the phone, my heart immediately racing. Was there something wrong at home? If so, why would they text and not call? I grabbed my cell and swiped it on.\u003c/p\u003e\n\u003cp\u003eA single message from Tammy: Ant\u0027s being a jerk.\u003c/p\u003e\n\u003cp\u003eI frowned and dashed off a text: Don\u0027t call him Ant. You know he doesn\u0027t like that. And kindly turn your TV off for one hour.\u003c/p\u003e\n\u003cp\u003eBut why? she wrote back almost instantaneously.\u003c/p\u003e\n\u003cp\u003eFor calling your brother a jerk.\u003c/p\u003e\n\u003cp\u003eBut Mom!!\u003c/p\u003e\n\u003cp\u003eAnother text came through, this one from Anthony\u0027s cell phone: Fanny\u0027s being mean.\u003c/p\u003e\n\u003cp\u003eDon\u0027t call your sister Fanny. No TV for the two of you tonight.\u003c/p\u003e\n\u003cp\u003eNot fair!\u003c/p\u003e\n\u003cp\u003eYou\u0027re mean.\u003c/p\u003e\n\u003cp\u003eThis sucks.\u003c/p\u003e\n\u003cp\u003eAnthony\u0027s feet smell.\u003c/p\u003e\n\u003cp\u003eTammy\u0027s breath smells. So do her armpits.\u003c/p\u003e\n\u003cp\u003eMy armpits do not smell. I\u0027m a girl!\u003c/p\u003e\n\u003cp\u003eHow I got into their loop of name calling, I didn\u0027t know. But they continued like this for the next few minutes...all while I shook my head sadly. Finally, I put a quick call in for my sister, who told me she was on her way over. I checked the time. My kids had watched themselves for all of two hours.\u003c/p\u003e\n\u003cp\u003eAgain, better than nothing.* * *An hour later, a convertible BMW with its top down came up behind me. It was silver and sleek and probably more expensive than my house in Fullerton. Seated in the driver\u0027s seat was none other than Andre Fine. A beautiful blond was in the passenger\u0027s seat next to him. Both were laughing as they drove past me. Neither glanced at me. Just another perfect day in Malibu.\u003c/p\u003e\n\u003cp\u003eHe turned into his driveway, waited a moment for his electric fence to swing open, then continued on, disappearing behind a long row of thick hedges.\u003c/p\u003e\n\u003cp\u003eI waited another half hour, then stepped out of my minivan.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-games-vampire-for-hire-6/page-40.html","bookId":2135,"creation":"Oct 5, 2019 6:12:12 PM","modification":"Oct 5, 2019 6:12:12 PM"}
