{"id":95015,"no":45,"title":"Page 45","content":"\u003cp\u003eOn Wednesday evening at 6:30, Russell Baker and I were jogging at Huntington Beach.\u003c/p\u003e\n\u003cp\u003eHe was shirtless and jaw-droppingly sexy, and it was all I could do not to stare at him as we spoke. Staring at him while we spoke might have led to me running into a trash can. Still, I stole glances, every chance I had. I wondered if it was unethical to lust after my client.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s a wild story, Samantha Moon,\" he said. He always sounded so damn polite when he spoke to me. Too polite. I wanted him to sound...interested. This surprised the hell out of me. A few weeks ago, when he\u0027d first appeared at my house, I had not thought of him as anything other than a client. But watching his fights, watching his skills, seeing the compassion in his heart, and his surprisingly peaceful aura for a fighter, well, something shifted.\u003c/p\u003e\n\u003cp\u003eThat, and the fact that Kingsley had broken my heart all over again.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s more than a theory,\" I said.\u003c/p\u003e\n\u003cp\u003e\"How can you be so sure, Samantha?\" he said easily, smoothly, confidently.\u003c/p\u003e\n\u003cp\u003e\"Call me Sam,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Sure thing, Sam,\" he said and looked at me and winked and something inside me did a sort of flip. My stomach? Or, perhaps, something further down?\u003c/p\u003e\n\u003cp\u003eI considered how much to tell Russell, and decided to keep things fairly sanitized for now. \"Romero hired Andre Fine to deliver the dim mak to his brother.\"\u003c/p\u003e\n\u003cp\u003e\"The dim mak,\" said Russell, shaking his head, \"is only a myth.\"\u003c/p\u003e\n\u003cp\u003e\"Myth or not, Caesar Marquez died two weeks later during your match, from no apparent punch or series of punches from you. Most people I\u0027d spoken to - from the referee to Jacky - don\u0027t think you hit him hard enough to do any real damage.\"\u003c/p\u003e\n\u003cp\u003eRussell shook his head. \"I\u0027m not sure if I should feel relieved or discouraged.\"\u003c/p\u003e\n\u003cp\u003e\"It is what it is,\" I said, hating myself for using such a generic idiom, but I was finding being in Russell\u0027s presence, jogging together at the beach, so damn exciting that I wasn\u0027t thinking straight anyway.\u003c/p\u003e\n\u003cp\u003e\"I suppose so,\" said Russell smoothly. \"Caesar was a tough fighter. It was hard to land anything on the guy.\"\u003c/p\u003e\n\u003cp\u003e\"Could he have been champ?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"Maybe,\" said Russell, and he looked at me and winked again. \"\u0027Course, he woulda had to go through me first.\"\u003c/p\u003e\n\u003cp\u003e\"Of course.\"\u003c/p\u003e\n\u003cp\u003eI smiled. He smiled. His stomach muscles undulated. I somehow just missed running into a blue trash can.\u003c/p\u003e\n\u003cp\u003eRussell said, \"You believe there\u0027s something to the touch of death?\"\u003c/p\u003e\n\u003cp\u003e\"I do.\"\u003c/p\u003e\n\u003cp\u003e\"Why?\"\u003c/p\u003e\n\u003cp\u003e\"The police have gone through Andre Fine\u0027s records. There\u0027s evidence that he\u0027d been paid for many such hits. For someone who wanted to preserve his legacy in fighting, he sure kept a nice paper trail of his illegal dealings.\"\u003c/p\u003e\n\u003cp\u003e\"What exactly do you mean by evidence?\" asked Russell. He breathed easily, smoothly, his elbows relaxed at his sides.\u003c/p\u003e\n\u003cp\u003e\"Investigators found evidence of nine paid hits, totaling hundreds of thousands of dollars. Seven of the targets are dead.\"\u003c/p\u003e\n\u003cp\u003e\"Let me guess,\" said Russell. \"They died of unknown brain trauma.\"\u003c/p\u003e\n\u003cp\u003eI nodded, although I don\u0027t think Russell saw me nod. \"Good guess.\"\u003c/p\u003e\n\u003cp\u003e\"Weird,\" said Russell.\u003c/p\u003e\n\u003cp\u003e\"Weird is right,\" I said.\u003c/p\u003e\n\u003cp\u003e\"So, maybe there\u0027s something to this dim mak.\"\u003c/p\u003e\n\u003cp\u003e\"Maybe,\" I said.\u003c/p\u003e\n\u003cp\u003eRussell looked at me. \"Weren\u0027t you afraid that he might hurt you?\"\u003c/p\u003e\n\u003cp\u003e\"Naw,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I would have protected you,\" he said.\u003c/p\u003e\n\u003cp\u003eAnd for some reason, that bravado seriously warmed my heart. \"That might be the nicest thing anyone\u0027s said to me in a while.\"\u003c/p\u003e\n\u003cp\u003eHe grinned and flashed his perfect teeth. \"Except, why do I get the impression you don\u0027t need any protecting?\"\u003c/p\u003e\n\u003cp\u003e\"Oh, I need some protecting,\" I said.\u003c/p\u003e\n\u003cp\u003eHe slowed down and so did I. He placed his hands on his hips and sucked in some wind, although I got the feeling he wasn\u0027t very tired. By my estimate, we had jogged five miles.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re not breathing hard,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Nope.\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027re an interesting chick, Ms. Moon,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Like I said, call me Sam.\"\u003c/p\u003e\n\u003cp\u003e\"Would you like to get some dinner, Sam?\"\u003c/p\u003e\n\u003cp\u003e\"I thought you would never ask.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-games-vampire-for-hire-6/page-45.html","bookId":2135,"creation":"Oct 5, 2019 6:12:12 PM","modification":"Oct 5, 2019 6:12:12 PM"}
