{"id":94975,"no":5,"title":"Page 5","content":"\u003cp\u003eIt was after hours and I was sitting in Jacky\u0027s office.\u003c/p\u003e\n\u003cp\u003eJacky, if possible, looked even smaller than usual as he sat behind a dented metal desk. He was drinking an orange Gatorade which, I think, was the classic Gatorade. Of course, if I drank Gatorade now, I would heave it up in a glorious orange fountain.\u003c/p\u003e\n\u003cp\u003eJacky, of course, didn\u0027t need to know that, and since I only spent a few hours a week with the guy - and most of that was spent with him yelling at me to keep my hands up - I hadn\u0027t yet developed a telepathic rapport with him.\u003c/p\u003e\n\u003cp\u003eWhich was just as well. I seriously suspected that the old man had suffered some brain damage himself. He\u0027d been a champion back in the day. And in Jacky\u0027s case, \"back in the day\" meant the early fifties in Ireland.\u003c/p\u003e\n\u003cp\u003eJacky had spent the past few decades here in Fullerton. At one point his gym had been a happening place for up-and-coming boxers, with Jacky himself training a handful of champions. That is, until downtown Fullerton had become so trendy that Jacky - perhaps a better businessman than I\u0027d given him credit for - had decided to turn his gym into a women\u0027s self-defense studio.\u003c/p\u003e\n\u003cp\u003eThen again, if I was a spunky old man, I\u0027d rather train cute women, too.\u003c/p\u003e\n\u003cp\u003eAnyway, when Jacky finished off the Gatorade, he wiped the back of his hand across his mouth, dropped the empty bottle into a nearby wastebasket and sat back.\u003c/p\u003e\n\u003cp\u003e\"What did you think of the kid?\" he asked, speaking in an Irish accent so thick that you would think he was only now making his way through Ellis Island.\u003c/p\u003e\n\u003cp\u003e\"I think the kid is deeply troubled,\" I said. \"And I don\u0027t blame him.\"\u003c/p\u003e\n\u003cp\u003eJacky nodded. He seemed uncomfortable in his office. He seemed less himself, somehow. Out there, in the gym, he was larger than life, even though he was only a few inches taller than me. In here, at day\u0027s end, he looked like a shell of himself. He looked tired. Old. But not weak. Never weak. Even in quiet repose, the man looked like he wanted to punch something.\u003c/p\u003e\n\u003cp\u003e\"Russ isn\u0027t the first lad to kill somebody in the ring, and he won\u0027t be the last. And usually it plays with a fighter\u0027s head, so much so that they ain\u0027t ever much the same again.\"\u003c/p\u003e\n\u003cp\u003e\"He feels guilt,\" I said.\u003c/p\u003e\n\u003cp\u003e\"They all do. Except it\u0027s part of the risk we take. Each kid knows that his next fight might be his last.\"\u003c/p\u003e\n\u003cp\u003e\"Then why did you send him to me?\"\u003c/p\u003e\n\u003cp\u003eJacky didn\u0027t answer immediately. Through his closed door, I could hear someone sweeping and whistling. A door slammed somewhere, and I heard two women giggling down a hallway that I knew led to the female locker rooms.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s part of the risk, yes, but something about this one doesn\u0027t smell right.\"\u003c/p\u003e\n\u003cp\u003eI waited. I wanted to hear it from Jacky, someone who had seen tens of thousands of punches thrown in his lifetime. Jacky rubbed his knuckles as he formulated his thoughts. I wondered how difficult it was for Jacky to formulate his thoughts. How much brain damage had the old Irishman suffered?\u003c/p\u003e\n\u003cp\u003eThere had to be some. His aura, which was mostly light blue and ironically serene, appeared bright red around his head. The bright red, I knew, was the body fighting something, perhaps a disease. Or dealing with an injury.\u003c/p\u003e\n\u003cp\u003eThe Irishman rubbed his face and seemed to have lost his train of thought. The reddish aura around his head flared briefly.\u003c/p\u003e\n\u003cp\u003eI said gently, \"You were saying something about this fight not smelling right.\"\u003c/p\u003e\n\u003cp\u003e\"Was I now?\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Which fight?\"\u003c/p\u003e\n\u003cp\u003e\"Baker vs. Marquez.\"\u003c/p\u003e\n\u003cp\u003eHe nodded and rubbed the back of his neck and gritted his teeth. \"It\u0027s hell getting old, Sam.\"\u003c/p\u003e\n\u003cp\u003e\"So I\u0027m told.\"\u003c/p\u003e\n\u003cp\u003e\"And this noggin of mine just ain\u0027t right sometimes.\"\u003c/p\u003e\n\u003cp\u003e\"Mine either.\"\u003c/p\u003e\n\u003cp\u003eHe nodded, but I wasn\u0027t sure he\u0027d heard me. He said, \"Routine fight. No one beating up no one. Judges had Baker up a few rounds, but the truth is, they were only just beginning to feel each other out. No one had taken control yet. It was even as hell.\"\u003c/p\u003e\n\u003cp\u003e\"Were you there?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"At the fight? Hell, no. The wife doesn\u0027t let me anywhere near Vegas these days. She\u0027s afraid I\u0027ll spend our retirement - and then I\u0027ll never get to leave this damn gym.\"\u003c/p\u003e\n\u003cp\u003e\"You love this damn gym,\" I said.\u003c/p\u003e\n\u003cp\u003eHe winked at me, and I saw that there were tears in his eyes. Where the tears came from and why, I didn\u0027t exactly know. \"More than anything,\" he said.\u003c/p\u003e\n\u003cp\u003e\"You watched the fight on TV?\"\u003c/p\u003e\n\u003cp\u003e\"Which fight?\"\u003c/p\u003e\n\u003cp\u003e\"Baker vs. Marquez.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, of course. Russ is a local boy. He trains here sometimes. I showed him my best moves, and he never forgot his roots. Got to love a kid like that.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"Damn shame what happened. He ain\u0027t no killer. They were just boxing. Trading jabs, the occasional straight shot or hook. Nothing landed yet. Nothing really. No reason a kid should be dead.\"\u003c/p\u003e\n\u003cp\u003eJacky fell silent and absently wiped the tears from his eyes. His knuckles were crisscrossed with scar tissue. I imagined Jacky raising hell in the streets of Dublin.\u003c/p\u003e\n\u003cp\u003e\"So, what are you saying, Jacky?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m saying, in one fell swoop, two top contenders have disappeared. One\u0027s dead, and the other might as well be dead. There\u0027s something to that, Sam, something worth looking into.\"\u003c/p\u003e\n\u003cp\u003eI nodded, thinking about that, as Jacky sat back and closed his eyes and rubbed the scar tissue along his knuckles. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-games-vampire-for-hire-6/page-5.html","bookId":2135,"creation":"Oct 5, 2019 6:12:12 PM","modification":"Oct 5, 2019 6:12:12 PM"}
