{"id":94977,"no":7,"title":"Page 7","content":"\u003cp\u003eThe flight to Vegas was of the commercial airline type.\u003c/p\u003e\n\u003cp\u003eAlthough only forty-five minutes from John Wayne Airport in Santa Ana, I had plenty of time to think about Fang and Hanner. How she had found him, I didn\u0027t know. I suspected she had followed me or had someone watch me. That she had gone over my phone records wasn\u0027t out of the realm of possibility, either. Generally, the police needed a damn good reason to scour one\u0027s phone records. She could have made up a reason, or done so secretly, in a way that I wasn\u0027t aware of. Private investigators don\u0027t have such access to phone records. A homicide investigator would.\u003c/p\u003e\n\u003cp\u003eThe plane hit some turbulence, which I ignored. Turbulence didn\u0027t bother me. Nor did the thought of the plane plummeting to Earth in a fireball. I was fairly certain I would have been the one passenger on board to walk away from such a crash. Or fly away.\u003c/p\u003e\n\u003cp\u003eIf Hanner had gone the phone record route, she would have seen the pathetic few times that Danny had called to speak to his own children - and the pathetic short amount of time he had spent talking to them, as well.\u003c/p\u003e\n\u003cp\u003eShe would have also seen the occasional phone call from Eli Roberts, aka Aaron Parker, aka Fang.\u003c/p\u003e\n\u003cp\u003eSome minor research into Eli\u0027s background would have netted a curious result: his background didn\u0027t go very far back. A quick scan of his current background would have resulted in seeing his current employment. From there, all she would have had to do was swing by for a visit...\u003c/p\u003e\n\u003cp\u003eAnd scan his thoughts.\u003c/p\u003e\n\u003cp\u003eShe would have known then who he was. No secrets would have been hidden from her. She would have known his murderous past, and his current desires.\u003c/p\u003e\n\u003cp\u003eBut why?\u003c/p\u003e\n\u003cp\u003eHanner had proven to be helpful in the past, but perhaps she was just covering for her own kind. After all, she had, on more than one occasion, successfully hidden my supernatural activity from the local police. More than helping me, we had drunk blood together. Discussed our kids together. Laughed together. I had found her insightful and knowledgeable, if not a little feral. Whereas I fought to hold onto my humanity - at least what I thought made me human - Hanner clearly embraced her vampiric nature. She was all vampire, through and through, and any vestiges of humanness were long, long gone.\u003c/p\u003e\n\u003cp\u003eAs an immortal, her thoughts were closed to me, so I could only guess what her intentions were. Clearly, she was obsessed with me. If not obsessed, then overly aware. Perhaps she was this way with all local vampires. Or with any vampires with whom she crossed paths. Perhaps she considered all other vampires her enemies.\u003c/p\u003e\n\u003cp\u003eI shook my head at that thought and leaned back in my economy seat. No, if she considered all vampires her enemies, then she wouldn\u0027t have supported a local blood dealer - the actor, Robert Mason - who, in turn, provided blood for many other vampires.\u003c/p\u003e\n\u003cp\u003ePerhaps her interest in me had something more to do with our last conversation, when she had said that I was a rare breed.\u003c/p\u003e\n\u003cp\u003eThat I had special gifts.\u003c/p\u003e\n\u003cp\u003eThat I could do things other vampires couldn\u0027t.\u003c/p\u003e\n\u003cp\u003eOr perhaps her interest in me had something to do with the old vampire who had turned me seven years ago. The old vampire, now dead thanks to Rand the Vampire Hunter. He, of the cute buns.\u003c/p\u003e\n\u003cp\u003eI thought about all of this as the plane landed. A jolting landing. I, myself, landed far smoother, of course. Which reminded me: According to Hanner, I was one of the few vampires who could transform.\u003c/p\u003e\n\u003cp\u003eWhen the plane finally came to a stop, I stood with others, got my bags like the others, and waited in line to shuffle off the plane. Like the others.\u003c/p\u003e\n\u003cp\u003eBut I was not like the others.\u003c/p\u003e\n\u003cp\u003eNo, I was not like them at all. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-games-vampire-for-hire-6/page-7.html","bookId":2135,"creation":"Oct 5, 2019 6:12:12 PM","modification":"Oct 5, 2019 6:12:12 PM"}
