{"id":94978,"no":8,"title":"Page 8","content":"\u003cp\u003eDr. Herbert Sculler looked like a character out of a Tim Burton movie.\u003c/p\u003e\n\u003cp\u003eThe short doctor wore round glasses and a lab coat that looked far too big for him. His face was whiter than my own and he smiled far too often, at least too often for a medical examiner who spent his days around corpses.\u003c/p\u003e\n\u003cp\u003eWe were sitting in his office, which was next to his examining room. There was a man lying on one of the tables, under a sheet, waiting patiently for the doctor\u0027s return.\u003c/p\u003e\n\u003cp\u003eSculler\u0027s office was small. I suspected it was so because he spent the majority of his time in the examining room. There, against the far wall, one, two, three corpses were lined up in plastic bags on shelves.\u003c/p\u003e\n\u003cp\u003eMore interesting was the male spirit standing off to the side of the dead man in the examining room. The spirit crackled with energy, even when standing motionless. So far, it had not taken its eyes off the body under the blanket. From here, I could see two dark holes in the spirit\u0027s chest, which I knew to be bullet wounds. After many months of seeing the dead, I knew that spirits often mirrored their appearance at death.\u003c/p\u003e\n\u003cp\u003eWelcome to my life.\u003c/p\u003e\n\u003cp\u003eThe spirit merely stood there and stared, wavering in and out of existence. Meaning one moment he was a fairly full-formed human-shape; the next, he was nothing more than static electricity. Upon closer inspection, I saw other spirits in the lab, too. In fact, dozens of them. But most were nothing more than faint balls of light.\u003c/p\u003e\n\u003cp\u003e\"Ah, here we go,\" said Dr. Sculler, who was busy clicking away on his computer. \"Caesar Marquez, boxer, age twenty-five, head injury.\"\u003c/p\u003e\n\u003cp\u003e\"You examined him personally?\" I asked.\u003c/p\u003e\n\u003cp\u003eSculler nodded gravely. Cutting dead people open was, after all, serious business. \"Yes, performed it myself.\"\u003c/p\u003e\n\u003cp\u003e\"How long have you been a medical examiner, Dr. Sculler?\"\u003c/p\u003e\n\u003cp\u003e\"Twenty-two years.\"\u003c/p\u003e\n\u003cp\u003e\"How many fatally injured boxers?\"\u003c/p\u003e\n\u003cp\u003e\"Just the one, although I\u0027ve seen my share of brain injuries. Particularly football injuries.\"\u003c/p\u003e\n\u003cp\u003e\"Was Caesar Marquez\u0027s brain similarly injured?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m scanning the autopsy images now, if you would like to look.\"\u003c/p\u003e\n\u003cp\u003e\"I would.\"\u003c/p\u003e\n\u003cp\u003e\"Then come around here.\"\u003c/p\u003e\n\u003cp\u003eI hadn\u0027t worked for the federal government long, but I had seen my share of medical examining rooms and corpses. And these days, death was something to analyze, not to fear. No, never again to fear.\u003c/p\u003e\n\u003cp\u003eThere were dozens of images of a dead man in various stages of examination. The young man, from all appearances, was the same Caesar Marquez I had seen fighting in the YouTube clip.\u003c/p\u003e\n\u003cp\u003eAs I leaned in behind Sculler, he clicked over to a cluster of photographs that focused on the man\u0027s head. A few clicks later and the top half of the skull had been removed. The skin itself had been peeled down over the face. The next image showed, from all appearances, a very healthy brain. Finally, the brain had been removed and was now sitting in a small metal tray.\u003c/p\u003e\n\u003cp\u003eDr. Sculler zoomed in on the freshly-removed brain that had been housed in a perfectly functioning young adult male just a few hours earlier. Sculler pointed to the screen, in particular to a red discoloration along the left temporal lobe.\u003c/p\u003e\n\u003cp\u003e\"Bleeding,\" he said. \"The brain is susceptible to bleeding, especially after trauma. Unlike other body parts, however, when the brain bleeds, it\u0027s a major problem. Bleeding in the brain causes pressure. Pressure can shut down various functions of the brain...and can lead to death. Often quickly.\"\u003c/p\u003e\n\u003cp\u003eI said, \"The official cause of death is epidural hematoma.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\" He pointed to the screen. \"Bleeding between the dura mater and the skull.\"\u003c/p\u003e\n\u003cp\u003e\"A brain hemorrhage.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, but in this case the damage is technically classified as an extra-axial hemorrhage, or an intracranial hemorrhage.\"\u003c/p\u003e\n\u003cp\u003eI nodded, taking this in. More and more it was looking like Russell Baker didn\u0027t have much of a case. \"Did you actually see the fight, doctor?\"\u003c/p\u003e\n\u003cp\u003e\"I did, yes. Later.\"\u003c/p\u003e\n\u003cp\u003e\"And did you see enough to warrant a brain hemorrhage?\"\u003c/p\u003e\n\u003cp\u003eThe good doctor removed his glasses. As he did so, a spirit of an elderly woman materialized behind him in the far corner of the office. The skin on the doctor\u0027s forearms immediately cropped into goose bumps. He shivered slightly, oblivious to the sudden source of cold air. The old woman only partially manifested, hovering on legs that didn\u0027t exist. If the good doctor could see what I was seeing, he would undoubtedly run for the hills.\u003c/p\u003e\n\u003cp\u003eFor now, he only shivered, blissfully unaware of the spirit energy around him. The woman faded just as quickly as she appeared. The hollow look in her eyes would have been haunting, if not so familiar. At least, familiar to me.\u003c/p\u003e\n\u003cp\u003eAfter shivering some more, he said, \"Quite frankly, no.\"\u003c/p\u003e\n\u003cp\u003eI perked up. I just hate taking money from a client and then giving them nothing in return.\u003c/p\u003e\n\u003cp\u003e\"No?\"\u003c/p\u003e\n\u003cp\u003e\"No. But that doesn\u0027t mean that any punch at any point in the fight couldn\u0027t have caused the injury. Very little is understood about brain injuries.\"\u003c/p\u003e\n\u003cp\u003e\"I understand, but is it your professional opinion that you think nothing in the fight warranted death?\"\u003c/p\u003e\n\u003cp\u003e\"Not professional. Personal. Unofficial.\" He paused. \"Officially, he died from a blunt force received during the fight.\"\u003c/p\u003e\n\u003cp\u003e\"Officially, but not likely.\"\u003c/p\u003e\n\u003cp\u003eHe stared at me, and then started nodding. \"Not likely.\"\u003c/p\u003e\n\u003cp\u003e\"How old was the wound?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"It was within the correct time frame. I have no doubt that it happened in and around the time of the fight.\"\u003c/p\u003e\n\u003cp\u003e\"Or possibly before?\" I suggested.\u003c/p\u003e\n\u003cp\u003eThe good doctor shrugged and rubbed his arms. After all, the old lady had reappeared in the far corner of the room.\u003c/p\u003e\n\u003cp\u003e\"Possibly,\" he said. \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-games-vampire-for-hire-6/page-8.html","bookId":2135,"creation":"Oct 5, 2019 6:12:12 PM","modification":"Oct 5, 2019 6:12:12 PM"}
