{"id":94979,"no":9,"title":"Page 9","content":"\u003cp\u003eIt took a few calls, a little waiting, a few more calls, and maybe a little begging to finally meet my next interview.\u003c/p\u003e\n\u003cp\u003eI met Ricardo Cortez at the Hard Rock Hotel\u0027s massive, central bar, where we sat across from each other and nursed our drinks. Mine was white wine. His was a beer. Both of our glasses were small. Around us were the sounds of money being won and lost. Mostly lost.\u003c/p\u003e\n\u003cp\u003e\"You were the referee for the Baker/Marquez fight,\" I said.\u003c/p\u003e\n\u003cp\u003eHe looked down into his beer. I suspected he often looked down into his beer for answers. That I quickly ascertained he was an alcoholic no longer surprised me. That I felt his overwhelming need and addiction to the stuff did surprise me.\u003c/p\u003e\n\u003cp\u003eIt was almost as if I could reach inside his thoughts.\u003c/p\u003e\n\u003cp\u003eAlmost.\u003c/p\u003e\n\u003cp\u003eWeeks ago, Hanner had told me that I could expect to start reading other minds - and not just those closest to me. And not just read.\u003c/p\u003e\n\u003cp\u003eManipulate.\u003c/p\u003e\n\u003cp\u003eJesus.\u003c/p\u003e\n\u003cp\u003eFor now, I didn\u0027t want to think about manipulating another\u0027s mind - hell, it was all I could do to exist comfortably in my own.\u003c/p\u003e\n\u003cp\u003eFinally, Ricardo looked up from his beer. He said, \"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"How long have you been a referee?\"\u003c/p\u003e\n\u003cp\u003e\"Eight years.\"\u003c/p\u003e\n\u003cp\u003e\"Have you ever refereed a bout where a fighter was killed?\"\u003c/p\u003e\n\u003cp\u003eRicardo was a strong-looking Hispanic with what appeared to be the beginning of a tattoo under the right sleeve of his jacket. It looked like a snake tail. In fact, I was certain it was a rattle. We were mostly alone at the bar. Then again, the bar was so expansive that it was hard to tell where it ended and where it started. Nearby, a woman jumped up and down at the nickel slot machine. I think she\u0027d just won a shitload of nickels.\u003c/p\u003e\n\u003cp\u003eRicardo ignored the excited woman. Instead, he lifted his beer to his lips, and while he was guzzling he gestured for the waiter for another. Yeah, he was an alcoholic.\u003c/p\u003e\n\u003cp\u003eWhen he finally pulled away, he said, \"That was my first death.\"\u003c/p\u003e\n\u003cp\u003e\"Hard on you?\"\u003c/p\u003e\n\u003cp\u003e\"What do you think?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m thinking it was a shitty day for everyone.\"\u003c/p\u003e\n\u003cp\u003e\"Yup.\"\u003c/p\u003e\n\u003cp\u003eThe waitress set another beer before him, and Ricardo picked it up instantly.\u003c/p\u003e\n\u003cp\u003eI said, \"Do you blame yourself for his death?\"\u003c/p\u003e\n\u003cp\u003e\"No one else to blame.\"\u003c/p\u003e\n\u003cp\u003e\"What about the guy doing the punching?\"\u003c/p\u003e\n\u003cp\u003eRicardo shook his head. \"It was my job to stop the fight before it gets to that point.\"\u003c/p\u003e\n\u003cp\u003e\"Except it was a fluke punch. Everyone agrees. Most people think the fight was pretty even up to that point.\"\u003c/p\u003e\n\u003cp\u003e\"No, it wasn\u0027t.\"\u003c/p\u003e\n\u003cp\u003eI blinked. This was new information. Investigators loved new information. New information meant that an investigator was onto something. I liked that.\u003c/p\u003e\n\u003cp\u003e\"How so?\" I asked.\u003c/p\u003e\n\u003cp\u003eRicardo rubbed his face and I saw the scarring on his own knuckles. Ah, he had been a fighter himself. In fact, now I could see that his nose had undoubtedly been broken a few times. Probably not a very good fighter. Probably why he went into reffing fights instead of participating in them. Reffing was easier on the nose.\u003c/p\u003e\n\u003cp\u003eWhen he had collected his thoughts and had decided just how much to tell me - and how I knew this was beginning to trouble me - he said, \"Caesar was not all there from the beginning.\"\u003c/p\u003e\n\u003cp\u003e\"What do you mean?\"\u003c/p\u003e\n\u003cp\u003e\"Caesar looked, at least to me, that he\u0027d already gone a round or two. Or maybe even three or four.\"\u003c/p\u003e\n\u003cp\u003e\"Anyone else notice this?\"\u003c/p\u003e\n\u003cp\u003e\"Hard to say. I\u0027m certain someone on his crew would have known.\"\u003c/p\u003e\n\u003cp\u003e\"How could they miss it?\"\u003c/p\u003e\n\u003cp\u003e\"Easy to miss, unless you know what to look for.\"\u003c/p\u003e\n\u003cp\u003e\"And you know what to look for?\" I said.\u003c/p\u003e\n\u003cp\u003e\"Of course. All good refs do. It\u0027s how we keep these guys from beating in each others\u0027 skulls.\"\u003c/p\u003e\n\u003cp\u003e\"What do you look for?\"\u003c/p\u003e\n\u003cp\u003eRicardo was loosening up, forgiving himself, reminding himself that there might be more to this story than he knew. Again, how I knew this snippet of thought from him was seriously beginning to wig me out.\u003c/p\u003e\n\u003cp\u003eHe said, \"If you know a fighter, it\u0027s easier. Then you know their mannerisms. You also know how much punishment they can take.\"\u003c/p\u003e\n\u003cp\u003e\"You ever work a fight with Caesar?\"\u003c/p\u003e\n\u003cp\u003e\"Yup. Two.\"\u003c/p\u003e\n\u003cp\u003e\"And he was different from the get-go.\"\u003c/p\u003e\n\u003cp\u003e\"Right. From the fucking get-go.\"\u003c/p\u003e\n\u003cp\u003e\"What was he doing different?\"\u003c/p\u003e\n\u003cp\u003e\"Dazed. Slower than normal.\"\u003c/p\u003e\n\u003cp\u003e\"Even though most judges scored it even?\"\u003c/p\u003e\n\u003cp\u003e\"I said slower than normal. Caesar Marquez was better than most. I even caught him staggering once or twice back to the corner. Not sure if anyone else had seen it.\"\u003c/p\u003e\n\u003cp\u003e\"What did you think about that?\"\u003c/p\u003e\n\u003cp\u003e\"I thought that something was wrong.\"\u003c/p\u003e\n\u003cp\u003e\"Enough to stop the fight?\"\u003c/p\u003e\n\u003cp\u003eHe shook his head and remembered the beer. He said, \"I should have stopped it if I\u0027d had any balls. I should have at least called called one of the doctors over. But...\"\u003c/p\u003e\n\u003cp\u003e\"But you just weren\u0027t sure.\"\u003c/p\u003e\n\u003cp\u003eHe looked at me funny, as I had read his thoughts. \"Right, I wasn\u0027t sure. There was no reason for his symptoms, after all. The fight had been fairly tame.\"\u003c/p\u003e\n\u003cp\u003e\"But he was in trouble from the beginning.\"\u003c/p\u003e\n\u003cp\u003eRicardo nodded. \"Almost as if...\"\u003c/p\u003e\n\u003cp\u003eHe couldn\u0027t finish the sentence, and so I finished it for him. \"Almost as if he\u0027d been hurt before the fight.\"\u003c/p\u003e\n\u003cp\u003eRicardo looked at me again. \"Bingo.\"\u003c/p\u003e\n\u003cp\u003e\"Hard to blame yourself for something like this.\"\u003c/p\u003e\n\u003cp\u003e\"Hard not to, either. I should have stopped the fight.\"\u003c/p\u003e\n\u003cp\u003e\"You did your best.\"\u003c/p\u003e\n\u003cp\u003eHe shook his head, and kept on shaking his head even as he finished his second beer and held up his hand for a third.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/vampire-games-vampire-for-hire-6/page-9.html","bookId":2135,"creation":"Oct 5, 2019 6:12:12 PM","modification":"Oct 5, 2019 6:12:12 PM"}
