{"id":67735,"no":2,"title":"Page 2","content":"\u003cp\u003eThe king, whose name was Solomon, listened to both their speeches, and at last announced that he had a fair solution.\u003c/p\u003e\n\u003cp\u003e“We will cut the baby in two,” he said, “and that way each of you will have a portion.”\u003c/p\u003e\n\u003cp\u003eThe women agreed that this was just, and so the executioner was brought forward, and with his ax, he sliced the baby cleanly in two.\u003c/p\u003e\n\u003cp\u003eAnd the baby never cried, or so much as made a sound, and the mothers looked on, and afterward, for a thousand years, there was a spot of blood on the palace floor that could never be cleaned or diluted by any substance on earth. . . .\u003c/p\u003e\n\u003cp\u003eI must have been only eight or nine when I read that passage for the first time, but it really struck me. For days I couldn’t get the image of that poor baby out of my head. I kept picturing it split open on the tile floor, like a butterfly pinned behind glass.\u003c/p\u003e\n\u003cp\u003eThat’s what’s so great about the story. It’s real. What I mean is, even if it didn’t actually happen—and there’s debate about the Legends and Grievances section, and whether it’s historically accurate—it shows the world truthfully. I remember feeling just like that baby: torn apart by feeling, split in two, caught between loyalties and desires.\u003c/p\u003e\n\u003cp\u003eThat’s how the diseased world is.\u003c/p\u003e\n\u003cp\u003eThat’s how it was for me, before I was cured.\u003c/p\u003e\n\u003cp\u003eIn exactly twenty-one days, I’ll be married.\u003c/p\u003e\n\u003cp\u003eMy mother looks as though she might cry, and I almost hope that she will. I’ve seen her cry twice in my life: once when she broke her ankle and once last year, when she came outside and found that protesters had climbed the gate, and torn up our lawn, and pried her beautiful car into pieces.\u003c/p\u003e\n\u003cp\u003eIn the end she says only, “You look lovely, Hana.” And then: “It’s a little too big in the waist, though.”\u003c/p\u003e\n\u003cp\u003eMrs. Killegan—Call me Anne, she simpered, the first time we came for a fitting—circles me quietly, pinning and adjusting. She is tall, with faded blond hair and a pinched look, as though over the years she has accidentally ingested various pins and sewing needles. “You’re sure you want to go with the cap sleeves?”\u003c/p\u003e\n\u003cp\u003e“I’m sure,” I say, just as my mom says, “You think they look too young?”\u003c/p\u003e\n\u003cp\u003eMrs. Killegan—Anne—gestures expressively with one long, bony hand. “The whole city will be watching,” she says.\u003c/p\u003e\n\u003cp\u003e“The whole country,” my mother corrects her.\u003c/p\u003e\n\u003cp\u003e“I like the sleeves,” I say, and I almost add, It’s my wedding. But that isn’t true anymore—not since the Incidents in January, and Mayor Hargrove’s death. My wedding belongs to the people now. That’s what everybody has been telling me for weeks. Yesterday we got a phone call from the National News Service, asking whether they could syndicate footage, or send in their own television crew to film the ceremony.\u003c/p\u003e\n\u003cp\u003eNow, more than ever, the country needs its symbols.\u003c/p\u003e\n\u003cp\u003eWe are standing in front of a three-sided mirror; my mother’s frown is reflected from three different angles. “Mrs. Killegan’s right,” she says, touching my elbow. “Let’s see how it looks at three-quarters, okay?”\u003c/p\u003e\n\u003cp\u003eI know better than to argue. Three reflections nod simultaneously; three identical girls with identical ropes of braided blond in three identical white, floor-skimming dresses. Already, I hardly recognize myself. I’ve been transfigured by the dress, by the bright lights in the dressing room. For all my life I have been Hana Tate.\u003c/p\u003e\n\u003cp\u003eBut the girl in the mirror is not Hana Tate. She is Hana Hargrove, soon-to-be wife of the soon-to-be mayor, and a symbol of all that is right about the cured world.\u003c/p\u003e\n\u003cp\u003eA path and a road for everyone.\u003c/p\u003e\n\u003cp\u003e“Let me see what I have in the back,” Mrs. Killegan says. “We’ll slip you into a different style, just so you’ll have a comparison.” She slides across the worn gray carpet and disappears into the storeroom. Through the open door, I see dozens of dresses sheathed in plastic, dangling limply from garment racks.\u003c/p\u003e\n\u003cp\u003eMy mother sighs. We’ve been here for two hours already, and I’m starting to feel like a scarecrow: stuffed and poked and stitched. My mother sits on a faded footstool next to the mirrors, holding her purse primly in her lap so it won’t touch the carpet.\u003c/p\u003e\n\u003cp\u003eMrs. Killegan’s has always been the nicest wedding shop in Portland, but it, too, has clearly felt the lingering effects of the Incidents, and the security crackdowns the government implemented in their aftermath. Money is tighter for practically everybody, and it shows. One of the overhead bulbs is out, and the shop has a musty smell, as though it has not been cleaned recently. On one wall, a pattern of moisture has begun bubbling the wallpaper, and earlier I noticed a large brown stain on one of the striped settees. Mrs. Killegan caught me looking and casually tossed a shawl down to conceal it.\u003c/p\u003e\n\u003cp\u003e“You really do look lovely, Hana,” my mother says.\u003c/p\u003e\n\u003cp\u003e“Thank you,” I say. I know I look lovely. It might sound egotistical, but it’s the truth.\u003c/p\u003e\n\u003cp\u003eThis, too, has changed since my cure. When I was uncured, even though people always told me I was pretty, I never felt it. But after the cure, a wall came down inside me. Now I see that yes, I am quite simply and inarguably beautiful.\u003c/p\u003e\n\u003cp\u003eI also no longer care.\u003c/p\u003e\n\u003cp\u003e“Here we are.” Mrs. Killegan reemerges from the back, holding several plastic-swathed gowns over her arm. I swallow a sigh, but not quickly enough. Mrs. Killegan places a hand on my arm. “Don’t worry, dear,” she says. “We’ll find the perfect dress. That’s what this is all about, isn’t it?”\u003c/p\u003e\n\u003cp\u003eI arrange my face into a smile, and the pretty girl in the mirror arranges her face with me. “Of course,” I say.\u003c/p\u003e\n\u003cp\u003ePerfect dress. Perfect match. A perfect lifetime of happiness.\u003c/p\u003e\n\u003cp\u003ePerfection is a promise, and a reassurance that we are not wrong.\u003c/p\u003e\n\u003cp\u003eMrs. Killegan’s shop is in Old Port, and as we emerge onto the street I inhale the familiar scents of dried seaweed and old wood. The day is bright, but the wind is cold off the bay. Only a few boats are bobbing in the water, mostly fishing vessels or commercial rigs. From a distance, the scat-splattered wood moorings look like reeds growing out of the water.\u003c/p\u003e\n\u003cp\u003eThe street is empty except for two regulators and Tony, our bodyguard. My parents decided to employ security services just after the Incidents, when Fred Hargrove’s father, the mayor, was killed, and it was decided that I should leave college and get married as soon as possible.\u003c/p\u003e\n\u003cp\u003eNow Tony comes everywhere with us. On his days off, he sends his brother, Rick, as a substitute. It took me a month to be able to distinguish between them. They both have thick, short necks and shiny bald heads. Neither of them speaks much, and when they do, they never have anything interesting to say.\u003c/p\u003e\n\u003cp\u003eThat was one of my biggest fears about the cure: that the procedure would switch me off somehow, and inhibit my ability to think. But it’s the opposite. I think more clearly now. In some ways, I even feel things more clearly. I used to feel with a kind of feverishness; I was filled with panic and anxiety and competing desires. There were nights I could hardly sleep, days when I felt like my insides were trying to crawl out of my throat.\u003c/p\u003e\n\u003cp\u003eI was infected. Now the infection has gone.\u003c/p\u003e\n\u003cp\u003eTony has been leaning against the car. I wonder if he has been standing in that position for all three hours we’ve been in Mrs. Killegan’s. He straightens up as we approach, and opens the door for my mother.\u003c/p\u003e\n\u003cp\u003e“Thank you, Tony,” she says. “Was there any trouble?”\u003c/p\u003e\n\u003cp\u003e“No, ma’am.”\u003c/p\u003e\n\u003cp\u003e“Good.” She gets into the backseat, and I slide in after her. We’ve had this car for only two months—a replacement for the one that was vandalized—and just a few days after it arrived, my mom came out of the grocery store to find that someone had keyed the word PIG into the paint. Secretly, I think that my mom’s real motivation for hiring Tony was a desire to protect the new car.\u003c/p\u003e\n\u003cp\u003eAfter Tony shuts the door, the world outside the tinted windows gets tinged a dark blue. He turns the radio to the NNS, the National News Source. The commentators’ voices are familiar and reassuring.\u003c/p\u003e\n\u003cp\u003eI lean my head back and watch the world begin to move. I have lived in Portland all my life and have memories of almost every street and every corner. But these, too, seem distant now, safely submerged in the past. A lifetime ago I used to sit on those picnic benches with Lena, luring seagulls with bread crumbs. We talked about flying. We talked about escape. It was kid stuff, make-believe talk, like believing in unicorns and magic.\u003c/p\u003e\n\u003cp\u003eI never thought she would actually do it.\u003c/p\u003e\n\u003cp\u003eMy stomach cramps. I realize I haven’t eaten since breakfast. I must be hungry.\u003c/p\u003e\n\u003cp\u003e“Busy week,” my mother says.\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003e“And don’t forget, the Post wants to interview you this afternoon.”\u003c/p\u003e\n\u003cp\u003e“I haven’t forgotten.”\u003c/p\u003e\n\u003cp\u003e“Now we just need to find you a dress for Fred’s inauguration, and we’ll be all set. Or did you decide to go with the yellow one we saw in Lava last week?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure yet,” I say.\u003c/p\u003e\n\u003cp\u003e“What do you mean, you’re not sure? The inauguration’s in five days, Hana. Everyone will be looking at you.”\u003c/p\u003e\n\u003cp\u003e“The yellow one, then.”\u003c/p\u003e\n\u003cp\u003e“Of course, I have no idea what I’ll wear. . . .”\u003c/p\u003e\n\u003cp\u003eWe’ve passed into the West End, our old neighborhood. Historically, the West End has been home to many of the higher-ups in the church and the medical field: priests of the Church of the New Order, government officials, doctors and researchers at the labs. That’s no doubt why it was targeted so heavily during the riots following the Incidents.\u003c/p\u003e\n\u003cp\u003eThe riots were quelled quickly; there’s still much debate about whether the riots represented an actual movement or whether they were a result of misdirected anger and the passions we’re trying so hard to eradicate. Still, many families felt that the West End was too close to downtown, too close to some of the more troubled neighborhoods, where many of the sympathizers and resisters are concealed. Many families, like ours, have moved off-peninsula now.\u003c/p\u003e\n\u003cp\u003e“Don’t forget, Hana, we’re supposed to speak with the caterers on Monday.”\u003c/p\u003e\n\u003cp\u003e“I know, I know.”\u003c/p\u003e\n\u003cp\u003eWe take Danforth to Vaughan, our old street. I lean forward slightly, trying to catch a glimpse of our old house, but the Andersons’ evergreen conceals it almost entirely from view, and all I get is a flash of the green-gabled roof.\u003c/p\u003e\n\u003cp\u003eOur house, like the Andersons’ beside it and the Richards’ opposite, is empty and will probably remain so. Still, we see not a single FOR SALE sign. No one can afford to buy. Fred says that the economic freeze will remain in place for at least a few years, until things begin to stabilize. For now, the government needs to reassert control. People need to be reminded of their place.\u003c/p\u003e\n\u003cp\u003eI wonder if the mice are already finding their way into my old room, leaving droppings on the polished wood floors, and whether spiders have started webbing up the corners. Soon the house will look like 37 Brooks, barren, almost chewed-looking, collapsing slowly from termite rot.\u003c/p\u003e\n\u003cp\u003eAnother change: I can think about 37 Brooks now, and Lena, and Alex, without the old strangled feeling.\u003c/p\u003e\n\u003cp\u003e“And I’ll bet you never reviewed the guest list I left in your room?”\u003c/p\u003e\n\u003cp\u003e“I haven’t had time,” I say absently, keeping my eyes on the landscape skating by our window. \u003c/p\u003e","sourceLink":"https://allnovel.net/requiem-delirium-3/page-2.html","bookId":1718,"creation":"Oct 5, 2019 10:06:55 AM","modification":"Oct 5, 2019 10:06:55 AM"}
