{"id":67740,"no":7,"title":"Page 7","content":"\u003cp\u003eI lace up my sneakers and tiptoe to the bedroom door. Last summer, I used to sneak out all the time. There was the forbidden rave in the warehouse behind Otremba’s Paints and the party in Deering Highlands that was raided; there were nights on the beach at Sunset Park and illegal meet-ups with uncured boys, including the time at Back Cove when I let Steven Hilt put a hand on the inside of my bare thigh and time seemed to stop.\u003c/p\u003e\n\u003cp\u003eSteven Hilt: dark eyelashes, neat straight teeth, the smell of pine needles; the drop in my stomach whenever he looked at me.\u003c/p\u003e\n\u003cp\u003eThe memories seem like snapshots from someone else’s life.\u003c/p\u003e\n\u003cp\u003eI ease downstairs in near-total silence. I find the latch on the front door and turn it by minuscule increments, so that the bolt withdraws soundlessly.\u003c/p\u003e\n\u003cp\u003eThe wind is chilly and rustles the holly shrubs that encircle our yard, just inside the iron gate. The shrubs, too, are a feature of WoodCove Farms: For security and protection, the real estate brochures said, and a real measure of privacy.\u003c/p\u003e\n\u003cp\u003eI pause, listening for sounds of passing patrols. Nothing. But they can’t be too far off. WoodCove advertises a twenty-four-hour, seven-day-a-week volunteer guard corps. Still, the community is large, and full of dozens of offshoots and cul-de-sacs. With any luck, I’ll be able to avoid them.\u003c/p\u003e\n\u003cp\u003eDown the front walk, down the flagstone path, to the iron gate. A blur of black bats skirts past the moon, sending shadows skating across the lawn. I shiver. Already, the itch is draining out of me. I think about returning to bed, burrowing under the soft blankets and the pillows scented faintly of detergent; waking up refreshed to a nice big breakfast of scrambled eggs.\u003c/p\u003e\n\u003cp\u003eSomething bangs in the garage. I spin around. The garage door is partially open.\u003c/p\u003e\n\u003cp\u003eMy first thought is of a photographer. One of them has jumped the gate and camped out in the yard. But I quickly dismiss the idea. Mrs. Hargrove has carefully orchestrated all our press opportunities, and so far, I haven’t been an object of attention unless I’m with Fred.\u003c/p\u003e\n\u003cp\u003eMy second thought is gas thief. Recently, because of government-mandated restrictions, especially in the poorer parts of the city, there has been a rash of break-ins throughout Portland. It was especially bad during the winter: Furnaces were drained of oil, and cars of gas; houses were raided and vandalized. In February, there were two hundred burglaries alone, the largest number of crimes since the cure was made mandatory forty years ago.\u003c/p\u003e\n\u003cp\u003eI consider heading inside and waking my dad. But that would mean questions, and explanations.\u003c/p\u003e\n\u003cp\u003eInstead I cross the yard toward the garage, keeping my eye on the half-open door, checking for signs of movement. The grass is coated with dew, which soaks rapidly into my sneakers. I have a prickly, all-over body feeling. Someone is watching me.\u003c/p\u003e\n\u003cp\u003eA twig snaps behind me. I whirl around. A ripple of wind again disturbs the holly. I take a deep breath and turn back to the garage. My heart drums high in my throat, an uncomfortable and unfamiliar feeling. I have not been afraid—really afraid—since the morning of my cure, when I couldn’t even unknot the hospital gown because my hands were shaking so badly.\u003c/p\u003e\n\u003cp\u003e“Hello?” I whisper.\u003c/p\u003e\n\u003cp\u003eAnother rustle. Something—or someone—is definitely in the garage. I stand a few feet outside the door, struck rigid with fear. Stupid. This is stupid. I’ll go into the house and wake Dad. I’ll say I heard a noise, and I’ll deal with questions later.\u003c/p\u003e\n\u003cp\u003eThen, faintly: a mewling sound. A cat’s eyes blink momentarily at me in the open door.\u003c/p\u003e\n\u003cp\u003eI exhale. A stray cat—nothing more. Portland is lousy with them. Dogs, too. People buy them, and then can’t afford or don’t care to keep them, and dump them in the streets. For years they’ve been breeding. I’ve heard there are whole packs of wild dogs that roam around the Highlands.\u003c/p\u003e\n\u003cp\u003eI move forward slowly. The cat watches me. I put my hand on the garage door, ease it open a few more inches.\u003c/p\u003e\n\u003cp\u003e“Come on,” I coo. “Come on out of there.”\u003c/p\u003e\n\u003cp\u003eThe cat bolts back into the garage. It darts past my old bike, knocking against the kickstand. The bike starts to totter, and I spring forward and grab it before it can crash to the ground. The handlebars are dusty; even though it’s practically pitch-dark, I can feel the grime.\u003c/p\u003e\n\u003cp\u003eI keep one hand on the bike, steadying it, and feel for the switch on the wall. I flick on the overhead lights. Immediately, the normalcy of the garage reasserts itself: the car, the trash cans, the lawn mower in the corner; cans of paint and extra tanks of gas stacked neatly in the corner, in a pyramid formation. The cat is crouched among them. At least the cat looks relatively clean—it’s not frothing at the mouth or covered with scabs. Nothing to be afraid of. One more step toward her, and she bolts again; this time shooting around the car and circling past me, out into the yard.\u003c/p\u003e\n\u003cp\u003eAs I lean the bike up against the garage wall, I notice the faded purple scrunchie still looped around one handle. Lena and I used to have identical bicycles, but she teased me that hers was faster. We were always switching bikes by accident, after dumping them down on the grass or the beach. She would hop up on the seat, barely able to reach the pedals, and I’d climb on her bike all scrunched up like a toddler, and we would ride home together, laughing hysterically. One day she bought two scrunchies from her uncle’s convenience store—purple for me, blue for her—and insisted we keep them fixed around the handles, so we could differentiate them.\u003c/p\u003e\n\u003cp\u003eThe scrunchie is now creased with dirt. I haven’t ridden my bike since last summer. This hobby, like Lena, has faded into the past. Why were Lena and I best friends? What did we talk about? We had nothing in common. We didn’t like the same foods or the same music. We didn’t even believe in the same things.\u003c/p\u003e\n\u003cp\u003eAnd then she left, and it broke my heart so completely I could hardly breathe. If I hadn’t been cured, I’m not sure what I would have done.\u003c/p\u003e\n\u003cp\u003eI can admit, now, that I must have loved Lena. Not in an Unnatural way, but my feelings for her must have been a kind of sickness. How can someone have the power to shatter you to dust—and also to make you feel so whole?\u003c/p\u003e\n\u003cp\u003eThe urge to walk has drained away completely. All I want to do is fall into bed.\u003c/p\u003e\n\u003cp\u003eI turn off the lights and close the door to the garage, making sure I hear the latch slide shut.\u003c/p\u003e\n\u003cp\u003eAs I turn back to the house, I see a piece of paper lying on the grass, already spotted with moisture. It wasn’t there a minute ago. Someone has obviously pushed it through the gate while I was in the yard.\u003c/p\u003e\n\u003cp\u003eSomeone was watching me—could be watching me even now.\u003c/p\u003e\n\u003cp\u003eI cross the yard slowly. I see myself reach the flyer. I see myself bend to pick it up.\u003c/p\u003e\n\u003cp\u003eIt is a grainy black-and-white photo that has obviously been reproduced from the original: It shows a man and a woman kissing. The woman in the picture is bent backward, her fingers laced in the man’s hair. He is smiling even as he kisses her.\u003c/p\u003e\n\u003cp\u003eAt the bottom of the flyer are printed the words: THERE ARE MORE OF US THAN YOU THINK.\u003c/p\u003e\n\u003cp\u003eInstinctively, I crumple the flyer in my fist. Fred was right: The resistance is here, nesting among us. They must have access to copiers, to paper, to messengers.\u003c/p\u003e\n\u003cp\u003eA door bangs in the distance, and I jump. Suddenly the night seems alive. I practically sprint to the front porch and completely forget to be quiet as I slip inside the door, triple-locking it behind me. For a moment I stand in the hall, the flyer still balled in my hand, breathing in the familiar smells of furniture polish and Clorox.\u003c/p\u003e\n\u003cp\u003eIn the kitchen, I throw the paper in the trash. Then, thinking better of it, I stuff it into the garbage disposal instead. I’m no longer worried about waking my parents. I just want to get rid of the picture, get rid of the words—a threat, no doubt about it. There are more of us than you think.\u003c/p\u003e\n\u003cp\u003eI wash my hands with hot water and fumble clumsily back to my bedroom. I don’t even bother to undress, just kick off my shoes, take off the baseball hat, and climb under the covers. Even though the heat is humming, I still don’t feel warm.\u003c/p\u003e\n\u003cp\u003eLong, dark fingers are enclosing me. Velvet-gloved hands, soft and perfumed, are wrapping around my throat, and Lena is whispering from somewhere far away—What did you do?—and then, mercifully, the fingers release, the hands drop from around my throat, and I am falling, falling, into a deep and dreamless sleep.\u003c/p\u003e\n\u003cp\u003eLena\u003c/p\u003e\n\u003cp\u003eWhen I open my eyes, the tent is full of hazy green light as the sun is transformed into color by the thin tent walls. The ground beneath me is slightly damp, as it always is in the mornings; the ground exhales dew, shakes off the nighttime freeze. I can hear voices and the clang of metal pots. Julian is gone.\u003c/p\u003e\n\u003cp\u003eI can’t remember how long it has been since I’ve slept so deeply. I don’t even remember dreaming. I wonder whether this is what it is like to be cured, to wake up refreshed and renewed, undisturbed by the long, shadowy fingers that reach for you in sleep.\u003c/p\u003e\n\u003cp\u003eOutside, the air is unexpectedly warm. The woods are full of birdsong. Clouds skate giddily across a pale blue sky. The Wilds are boldly asserting the arrival of spring, like the first proud, puff-chested robins to appear in March.\u003c/p\u003e\n\u003cp\u003eI go down to the small stream where we’ve been drawing our water. Dani has just emerged from bathing and is standing totally naked, toweling off her hair with a T-shirt. Nudity used to shock me, but now I hardly notice it; she could be a dark, water-slicked otter shaking itself in the sun. Still, I head downstream from where she is, stripping off my shirt to splash my face and underarms and dunk my head underwater, gasping a little as I come up. The water is still ice-cold, and I can’t bring myself to submerge.\u003c/p\u003e\n\u003cp\u003eBack at the camp, I see that the body of the old woman has already been removed. Hopefully they’ve found somewhere to bury her. I think of Blue, and how we had to leave her out in the snow while the ice clotted her dark lashes and sealed her eyes shut, and of Miyako, who was burned. Ghosts, shadow-figures in my dreams. I wonder whether I will ever be rid of them.\u003c/p\u003e\n\u003cp\u003e“Morning, sunshine,” says Raven, without looking up from the jacket she is patching. She is holding several needles in her mouth, fanned out between her lips, and she has to speak through them. “Sleep well?” She doesn’t wait for me to answer. “There’s some grub on the fire, so eat up before Dani gets hold of seconds.”\u003c/p\u003e\n\u003cp\u003eThe girl we rescued last night is awake and sitting near Raven, at a short distance from the fire, with a red blanket draped around her shoulders. She is even lovelier than I thought. Her eyes are vivid green, and her skin is luminous and soft-looking.\u003c/p\u003e\n\u003cp\u003e“Hi,” I say as I move between her and the fire. She gives me a shy smile but doesn’t speak, and I feel a rush of sympathy for her. I remember how terrified I was when I escaped into the Wilds and found myself among Raven and Tack and the others. I wonder where she has come from, and what terrible things she has seen.\u003c/p\u003e\n\u003cp\u003eAt the edge of the fire, a dented pot is half-buried in the ash. Inside is a small bit of oatmeal-and-black-bean stew, left over from our dinner last night. It’s charred crunchy and practically tasteless. I spoon some into a tin cup and force myself to eat quickly.\u003c/p\u003e\n\u003cp\u003eAs I’m finishing, Alex stomps his way out of the woods, carrying a plastic jug of water. I glance up instinctively to see whether he will acknowledge me, but as usual he keeps his eyes locked on air over my head.\u003c/p\u003e\n\u003cp\u003eHe passes beyond me and stops by the new girl.\u003c/p\u003e\n\u003cp\u003e“Here,” he says. His voice is gentle, the voice of the old Alex, the Alex of my memories. “I brought you some water. Don’t worry. It’s clean.” \u003c/p\u003e","sourceLink":"https://allnovel.net/requiem-delirium-3/page-7.html","bookId":1718,"creation":"Oct 5, 2019 10:06:55 AM","modification":"Oct 5, 2019 10:06:55 AM"}
