{"id":79522,"no":15,"title":"Page 15","content":"\u003cp\u003eMR. CREPSLEY was every bit as suspicious of Steve as Steve had predicted. Even after I\u0027d told him about the attack and Steve saving my life, he regarded the human with ill-concealed contempt and remained at a distance. \"Blood does not change,\" he growled. \"When I tested Steve Leonard\u0027s blood, it was the taste of pure evil. Time cannot have diluted that.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not evil,\" Steve growled in return. \"You\u0027re the cruel one, making horrible, unfounded accusations. Do you realize how low an opinion I had of myself after you\u0027d dismissed me as a monster? Your ugly rejection almost drove me to evil!\"\u003c/p\u003e\n\u003cp\u003e\"It would not, I think, have been a lengthy drive,\" Mr. Crepsley said smoothly.\u003c/p\u003e\n\u003cp\u003e\"You could have been wrong, Larten,\" Vancha said. The Prince was lying on the couch, feet propped on the TV set, which he\u0027d dragged closer. His skin wasn\u0027t as red as it had been when I last saw him (Vancha was convinced he could train himself to survive sunlight, and often strolled about by day for an hour or so, allowing himself to be badly burnt, building up his body\u0027s defences). I guessed he must have spent the past few months walled-up inside Vampire Mountain.\u003c/p\u003e\n\u003cp\u003e\"I was not wrong,\" Mr. Crepsley insisted. \"I know the taste of evil.\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t bet on that,\" Vancha said, scratching an armpit. A bug fell out and landed on the floor. He guided it away with his right foot. \"Blood\u0027s not as easy to divine as certain vampires think. I\u0027ve found traces of \u0027evil\u0027 blood in several people over the decades, and kept tabs on them. Three went bad, so I killed them. The others led normal lives.\"\u003c/p\u003e\n\u003cp\u003e\"Not all who are born evil commit evil,\" Mr. Crepsley said, \"but I do not believe in taking chances. I cannot trust him.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s stupid,\" I snapped. \"You have to judge people by what they do, not by what you believe they might do. Steve\u0027s my friend. I\u0027ll vouch for him.\"\u003c/p\u003e\n\u003cp\u003e\"Me too,\" Harkat said. \"I was cautious at first, but I\u0027m confident now that... he\u0027s on our side. It\u0027s not just Darren he saved - he also warned him... to ring Debbie and tell her to get out. She\u0027d be dead otherwise.\"\u003c/p\u003e\n\u003cp\u003eMr. Crepsley shook his head stubbornly. \"I say we should test his blood again. Vancha can do it. He will see that I am telling the truth.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s no point,\" Vancha said. \"If you say there are traces of evil in his blood, I\u0027m sure there are. But people can overcome their natural defects. I know nothing of this man, but I know Darren and Harkat, and I place more faith in their judgement than in the quality of Steve\u0027s blood.\"\u003c/p\u003e\n\u003cp\u003eMr. Crepsley muttered something under his breath, but he knew he was outnumbered. \"Very well,\" he said mechanically. \"I will speak no more of it. But I will keep a very close watch on you,\" he warned Steve.\u003c/p\u003e\n\u003cp\u003e\"Watch away,\" Steve sniffed in reply.\u003c/p\u003e\n\u003cp\u003eTo clear the air, I asked Vancha why he\u0027d been absent so long. He said he\u0027d reported to Mika Ver Leth and Paris Skyle and told them about the Vampaneze Lord. He would have left immediately, but he saw how close to death Paris was, and decided to see out the Prince\u0027s last few months beside him.\u003c/p\u003e\n\u003cp\u003e\"He died well,\" Vancha said. \"When he knew he was no longer able to play his part, he slipped away in secret. We found his body a few nights later, locked in a death embrace with a bear.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s horrible!\" Debbie gasped, and everybody in the room smiled at her typical human reaction.\u003c/p\u003e\n\u003cp\u003e\"Trust me,\" I told her, \"there\u0027s no worse way for a vampire to die than in a bed, peacefully. Paris had more than eight hundred years under his belt. I doubt he left this world with any complaints.\"\u003c/p\u003e\n\u003cp\u003e\"Still...\" she said, troubled.\u003c/p\u003e\n\u003cp\u003e\"That\u0027s the vampire way,\" Vancha said, leaning across to give her hand a comforting squeeze. \"I\u0027ll take you aside some night and explain it to you,\" he added, leaving his hand on hers a few seconds longer than necessary.\u003c/p\u003e\n\u003cp\u003eIf Mr. Crepsley was going to keep a close eye on Steve, I was going to keep an even closer one on Vancha! I could see that he fancied Debbie. I didn\u0027t think shed be attracted to the ill-mannered, mud-stained, smelly Prince - but I wouldn\u0027t leave him alone with her to find out!\u003c/p\u003e\n\u003cp\u003e\"Any news of the Vampaneze Lord or Gannen Harst?\" I asked, to distract him.\u003c/p\u003e\n\u003cp\u003e\"No,\" he said. \"I told the Generals that Gannen was my brother and gave them a full description of him, but none had seen him recently.\"\u003c/p\u003e\n\u003cp\u003e\"What of events here?\" Mr. Crepsley asked. \"Has anybody been murdered, apart from Miss Hemlock\u0027s neighbours?\"\u003c/p\u003e\n\u003cp\u003e\"Please,\" Debbie smiled. \"Call me Debbie.\"\u003c/p\u003e\n\u003cp\u003e\"If he won\u0027t, I certainly will,\" Vancha grinned and leant across to pat her hand again. I felt like saying something rude, but constrained myself. Vancha saw me puffing up and winked suggestively.\u003c/p\u003e\n\u003cp\u003eWe told Mr. Crepsley and Vancha how quiet things had been before \u0027Hooky\u0027 attacked me in the alley. \"I don\u0027t like the sound of this Hooky,\" Vancha grumbled. \"I\u0027ve never heard of a hook-handed vampaneze before. By tradition, a vampaneze would rather do without a lost leg or arm than replace it with an artificial limb. It\u0027s strange.\"\u003c/p\u003e\n\u003cp\u003e\"What is stranger is that he has not attacked since,\" Mr. Crepsley said. \"If this vampaneze is in league with those who sent Darrens particulars to Mahler\u0027s, he knows the address of this hotel - so why not attack him here?\"\u003c/p\u003e\n\u003cp\u003e\"You think there might be two bands of vampaneze at work?\" Vancha asked.\u003c/p\u003e\n\u003cp\u003e\"Possibly. Or it could be that the vampaneze are responsible for the murders, while another - perhaps Desmond Tiny - set up Darren at school. Mr. Tiny could also have arranged for the hook-handed vampaneze to cross paths with Darren.\"\u003c/p\u003e\n\u003cp\u003e\"But how did Hooky recognize Darren?\" Harkat asked.\u003c/p\u003e\n\u003cp\u003e\"Maybe by the scent of Darren\u0027s blood,\" Mr. Crepsley said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like this,\" Vancha grumbled. \"Too many \u0027ifs\u0027 and \u0027buts\u0027. Too twisted by far. I say we get out and leave the humans to fend for themselves.\"\u003c/p\u003e\n\u003cp\u003e\"I am inclined to agree with you,\" Mr. Crepsley said. \"It pains me to say it, but perhaps our purposes would be best served by retreat.\"\u003c/p\u003e\n\u003cp\u003e\"Then retreat and be damned!\" Debbie snapped, and we all stared at her as she got to her feet and faced Mr. Crepsley and Vancha, hands bunched into fists, eyes on fire. \"What sort of monsters are you?\" she snarled. \"You talk of people as if we\u0027re inferior beings who don\u0027t matter!\"\u003c/p\u003e\n\u003cp\u003e\"May I remind you, madam,\" Mr. Crepsley replied stiffly, \"that we came here to fight the vampaneze and protect you and your kind?\"\u003c/p\u003e\n\u003cp\u003e\"Should we be grateful?\" she sneered. \"You did what anyone with even a trace of humanity would have done. And before you come back with that \u0027We aren\u0027t human\u0027 crud, you don\u0027t have to be human to be humane!\"\u003c/p\u003e\n\u003cp\u003e\"She\u0027s a fiery wench, isn\u0027t she?\" Vancha remarked to me in a stage-whisper. \"I could easily fall in love with a woman like this.\"\u003c/p\u003e\n\u003cp\u003e\"Fall somewhere else,\" I responded quickly.\u003c/p\u003e\n\u003cp\u003eDebbie paid no attention to our brief bit of interplay. Her eyes were fixed on Mr. Crepsley, who was gazing coolly back at her. \"Would you ask us to stay and sacrifice our lives?\" he said quietly.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m asking nothing,\" she retorted. \"But if you leave and the killing continues, will you be able to live with yourselves? Can you turn a deaf ear to the cries of those who\u0027ll die?\"\u003c/p\u003e\n\u003cp\u003eMr. Crepsley maintained eye contact with Debbie a few beats more, then averted his gaze and muttered softly, \"No.\" Debbie sat, satisfied. \"But we cannot chase shadows indefinitely,\" Mr. Crepsley said. \"Darren, Vancha and I are on a mission, which has been deferred too long already. We must think about moving on.\"\u003c/p\u003e\n\u003cp\u003eHe faced Vancha. \"I suggest we remain one more week, until the end of next weekend. We will do all in our power to engage the vampaneze, but if they continue to evade us, we should concede defeat and withdraw.\"\u003c/p\u003e\n\u003cp\u003eVancha nodded slowly. \"I\u0027d rather get out now, but that\u0027s acceptable. Darren?\"\u003c/p\u003e\n\u003cp\u003e\"A week,\" I agreed, then caught Debbie\u0027s eye and shrugged. \"It\u0027s the best we can do,\" I whispered.\u003c/p\u003e\n\u003cp\u003e\"I can do more,\" Harkat said. \"I am not tied to the mission as you... three are. I will stay beyond the deadline, if matters... are not resolved by then.\"\u003c/p\u003e\n\u003cp\u003e\"Me too,\" Steve said. \"I wont quit until the end.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you,\" Debbie said softly. \"Thank you all.\" Then she grinned weakly at me and said, \"All for one and one for all?\"\u003c/p\u003e\n\u003cp\u003eI grinned back. \"All for one and one for all,\" I agreed, and then everyone in the room repeated it, unbidden, one at a time - although Mr. Crepsley did glance at Steve and grunt ironically when it was his turn to make the vow! \u003c/p\u003e","sourceLink":"https://allnovel.net/allies-of-the-night-the-saga-of-darren-shan-8/page-15.html","bookId":2444,"creation":"Oct 5, 2019 4:18:09 PM","modification":"Oct 5, 2019 4:18:09 PM"}
