{"id":30409,"no":23,"title":"CHAPTER XXII. A MORNING CALL.","content":"\u0026nbsp;Florence Douglas had now been an inmate of Mrs. Armstrong\u0027s household for some months. She avoided making acquaintances, and therefore was often lonely. But she was buoyed up by the thought that Richard Dewey was somewhere in the State, and that the two messengers whom she had sent out would eventually find him. She felt great confidence in Ben, and also in Bradley, who had impressed her as an honest, straightforward man, though illiterate and not at all times superior to temptation. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her hope had been sustained by a letter received from Ben at the time he and Bradley were on the point of starting for the Sierras, where they had information that Dewey was engaged in mining. Then weeks passed, and she heard nothing. She began to feel anxious for the safety of her two[Pg 175] agents, knowing that not alone wild beasts, but lawless men, were to be encountered among the mountains. Should Ben and his companion come to harm, she would be sincerely sorry for their fate, feeling in a measure responsible for it. Still more, Richard Dewey would then be left ignorant of her presence in California, and might return to the East in that ignorance, leaving her friendless and alone more than three thousand miles from her old home.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n How would her heart have been cheered could she have known that at that moment Richard Dewey, with his two faithful friends, was but four days\u0027 journey from the city! So it happens that good fortune is often nearer to us than we imagine, even when our hearts are most anxious.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n While she was trying to look on the bright side one morning, Mrs. Armstrong entered her room. \"Miss Douglas,\" she said, \"there is a gentleman in the parlor who wishes to see you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Her heart gave a great bound. Who could it be but Richard Dewey who would call upon her?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Did he give his name?\" she asked, in agitation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No; he said you would know him.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 176]\"It must be Richard,\" she said to herself; and, controlling her agitation as well as she could, she descended to the parlor. She paused a moment before opening the door to regain her self-possession. Then, with an effort, she turned the knob, and entering the room, found herself face to face with Orton Campbell!\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was so unexpected and so bitter a disappointment that an expression of blank dismay overspread her face, and she sank into the nearest chair without venturing on a single word of greeting.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You didn\u0027t expect to see me, Miss Douglas?\" said Orton, enjoying the effect of his appearance, for he had never deceived himself with the thought that his father\u0027s ward would be glad to see him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time Florence had regained her self-possession, and with it came back scorn for the man whose object in pursuing her she well understood to be love of her fortune, not of herself.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are entirely right, Mr. Campbell,\" she answered. \"You are the last person I expected to see.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 177]\"You don\u0027t appear very glad to see me,\" he continued.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why should I appear so? You know very well that I am not glad to see you,\" said the heiress, frankly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is complimentary,\" said Orton, rather provoked, though he knew very well in advance that such was her feeling.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you didn\u0027t come here for compliments, Mr. Campbell?\" said Florence, coldly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are right: I didn\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I ask if you are in San Francisco on business?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You take things very coolly, I must say, Miss Douglas. Certainly you cannot be ignorant of my motive in coming here at great personal inconvenience.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I hope I have nothing to do with your reason.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You are the sole reason.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sorry to hear it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I came to remonstrate with you on the very unwise step you took in running away from your legal guardian.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 178]\"My legal guardian, as you call him, though I look upon him as such only as far as my property is concerned, rendered the step necessary.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t see how.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"In plain terms, Mr. Orton Campbell, I believe that you and your father entered into a conspiracy to keep my fortune in the family by inducing me to become your wife.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I certainly did ask you to become my wife, but it was not because of your fortune,\" answered the young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Florence\u0027s lip curled. She thoroughly disbelieved his statement. Though she said nothing, it was clear to him from her expression that she put no confidence in his words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You may believe me or not,\" he said, doggedly; \"but why should you think so poorly of yourself as to suppose you have nothing to attract lovers except your money?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I may not be so modest as you suppose, Mr. Campbell. I do believe that I have won the love of a true and noble man. My doubt only related to yourself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 179]\"You mean Richard Dewey, I suppose?\" said Orton Campbell, with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I do mean Richard Dewey,\" answered Florence, with composure.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"By the way, he came to California, I believe.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"And you came here in pursuit of him?\" he added, with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I came here to find him, knowing that in him I had a true friend, while your father\u0027s persecution and your own made me feel the need of one.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Have you found him? Do you know where he is?\" asked Orton Campbell, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I only know he is somewhere at the mines. I have taken steps to find him, and hope eventually to succeed.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Why don\u0027t you advertise?\" asked the young man, with an angry sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Would you advise it?\" asked Miss Douglas, coolly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No,\" muttered Orton, for he feared such a step might prove successful. \"What steps have you taken?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 180]\"I prefer to keep them to myself.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Douglas,\" said Orton Campbell, after a pause, \"all this is very foolish and humiliating. There is only one proper course for you to pursue.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What is it?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Return to New York with me in the next steamer, and place yourself once more under the care of my father, whose protection you never ought to have left.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027Protection\u0027!\" repeated Florence, with bitter emphasis. \"What protection did he give me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"All that was required.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027All that was required\u0027? You know very well that you and he had conspired to put me in a mad-house if I would not agree to enrich you by giving you my hand.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is not true,\" said Orton Campbell, rather confused.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027Not true\u0027? He distinctly threatened to do it as a means of terrifying me into compliance with his and your wishes. It was not until then that I decided to leave your house and seek some place of refuge until time and the law should set me[Pg 181] completely free from your family and their machinations.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is evident, Miss Douglas, that you are under a delusion. Your way of talking is sufficient to show that your mind is affected. Any good physician would need no other proof.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Florence Douglas looked at him with distrust. Was this a threat, or how should she interpret it?\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It is convenient, Mr. Orton Campbell,\" she retorted with spirit, \"to charge with madness those who oppose us. At home I felt afraid of your threats: here I am secure.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He thought that perhaps he had gone too far, since the young lady was independent of him, and it was not certain that he could gain possession of her.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Miss Douglas,\" he said, \"I have already told you that you have taken an unwise step. There is one way to remedy it, and I hope I may be able to induce you to take it. Let me assure you that I have called upon you as a friend, as a warm friend, as one who seeks to be something more than a friend.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 182]\"Well, sir?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Let me urge you to consent to an immediate marriage with me, and to accompany me home on the next steamer. My father will receive you as a daughter, and never allude to your flight.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose I ought to thank you for your disinterested proposal, Mr. Campbell, but I can only tell you that you ask what is entirely out of the question. This is final. Allow me to wish you good-morning.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But, Miss Douglas—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n She did not turn back nor heed these last words, and Orton Campbell found himself alone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He rose slowly from his seat, and an evil look came into his eyes. \"She has not done with me yet,\" he muttered as he left the house.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2954/81238.html","bookId":435,"creation":"Aug 5, 2019 2:18:21 AM","modification":"Aug 5, 2019 2:18:21 AM"}
