{"id":30414,"no":28,"title":"CHAPTER XXVII. A STAR IN THE CLOUD.","content":"\u0026nbsp;Meanwhile, though things looked dark for Florence and favorable for her persecutor, there was one circumstance that threatened failure to the latter\u0027s plans. Orton Campbell was a mean man, and his meanness in this instance worked against him. He had promised his confederate, Jones, a thousand dollars as the price of his information and co-operation, but intended all the while to avoid paying it if it were a possible thing. Of this sum seven hundred dollars were still due, besides an extra sum for the services of Jones in making Florence a captive. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was in regard to these sums that Jones called on Mr. Campbell on the evening succeeding the success of the plot.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Orton Campbell was about to go out when Jones appeared at his hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 211]\"I would like to see you a few minutes, Mr. Orton,\" said the man respectfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You must come some other time, Jones,\" said Campbell, carelessly; \"I\u0027ve got an engagement.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I must see you now, sir,\" said Jones, still respectfully, but in a resolute tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027Must\u0027?\" repeated Orton Campbell, arching his brows. \"You are impertinent.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Call me what you please,\" said Jones, doggedly; \"I\u0027m not to be put off.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What do you mean?\" demanded his employer, angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You know well enough. I want the money you are owing me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You seem to be in a hurry,\" said Campbell, with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t,\" retorted Jones. \"All I ask is that you will keep your promise.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"What promise do you refer to?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027What promise do I refer to?\u0027 You said if I would join you in kidnapping—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Hush!\" said Orton looking around, apprehensive of listeners.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 212]\"The young lady,\" Jones continued, \"you would pay me the seven hundred dollars you owed me, and two hundred dollars extra for my help.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Now, Orton Campbell knew very well that he had made this promise, but the payment of nine hundred dollars he dreaded as much as some of my readers would dread the extraction of half a dozen teeth. He had got all he needed from Jones, and he decided that it would be safe to throw him off. It might be dishonorable, but for that he cared little.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I suppose you have my promise in writing, Jones?\" he said, with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I haven\u0027t, Mr. Campbell.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Then you can\u0027t prove that I owe you anything, I take it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You don\u0027t mean to say, Mr. Orton, you\u0027d cheat a poor man out of his hard-earned money?\" ejaculated Jones, who, in spite of his knowledge of his employer\u0027s character, could hardly believe his ears.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I never intended to give you such an enormous sum for the little you have done for me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 213]\"Didn\u0027t you promise it, sir?\" demanded Jones, exasperated.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Not that I remember,\" answered Campbell, coolly. \"I should have been a fool to promise so large a sum. I paid your expenses out to California and three hundred dollars. That, I take it, is pretty liberal pay for your services for a month.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ll have justice if I live!\" said Jones, furiously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n He looked so threatening that Orton Campbell thought it might be best to placate him, even at the expense of a small extra sum. \"Don\u0027t be a fool, Jones,\" he said. \"You know very well that your demands are beyond all reason. I\u0027ve treated you very liberally already, but I don\u0027t mind doing a little more. I\u0027ll go so far as to give you fifty dollars down, and a further sum of one hundred dollars on my wedding-day if I marry Florence Douglas, if you\u0027ll be content with that.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I won\u0027t be content with it, Orton Campbell,\" said Jones, indignantly; \"I won\u0027t be content with anything less than the full sum you promised me.[Pg 214] You\u0027d better pay me at once, or you may see trouble.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Orton Campbell should have known that it was dangerous to trifle with a man so thoroughly roused as Jones was, but his love of money and dislike to part with it overcame every other consideration, and he said, \"You\u0027ve refused my offer, and I have done with you. You needn\u0027t come near me again.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you mean this?\" asked Jones, slowly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course I do. You have served my purpose, and been paid. I have offered you more, and you have refused it. That ends everything.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I understand you now, Orton Campbell.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Campbell, if you please,\" interrupted Campbell, haughtily.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Mr. Campbell, then; and I am sorry I didn\u0027t know you better before, but it isn\u0027t too late yet.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s enough: you can go.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Jones walked away Campbell asked himself, \"What is the fellow going to do, I wonder? I suppose he will try to annoy me. Never mind: I have saved nine hundred dollars. That will more than cover all the damage he can do me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 215]It was about the same hour that a party of three, dusty and shabby, entered San Francisco, and made their way to a respectable but not prominent hotel.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"We look like three tramps, Ben,\" said Bradley. \"Anywhere but in San Francisco I don\u0027t believe we could get lodged in any respectable hotel, but they\u0027ll know at once that we are from the mines, and may have a good store of gold-dust in spite of our looks.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If my friends at home could see me now,\" said Ben, laughingly, \"they wouldn\u0027t think I had found my trip to California profitable. It would give my friend Sam Sturgis a good deal of pleasure to think that I was a penniless adventurer.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He might be disappointed when he heard that you were worth not far from a thousand dollars, Ben.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"He certainly would be. On the other hand, Uncle Job would be delighted. I wish I could walk into his little cottage and tell him all about it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"When you go home, Ben, you must have more money to carry than you have now. A thousand[Pg 216] dollars are all very well, but they are not quite enough to start business on.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"A year ago I should have felt immensely rich on a thousand dollars,\" said Ben, thoughtfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No doubt; but you are young enough to wait a little longer. After our friend Dewey has seen his young lady and arranged matters we\u0027ll dust back to our friends, the miners who came near giving us a ticket to the next world, and see whether fortune won\u0027t favor us a little more.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Agreed!\" said Ben; \"I shall be ready.—Shall you call on Miss Douglas this evening, Mr. Dewey?\" asked Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Dewey. \"I cannot bear to feel that I am in the same city and refrain from seeing her.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will she know you in your present rig?\" suggested Bradley.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall lose no time in buying a new outfit,\" said Dewey. \"There must be shops where all articles of dress can be obtained ready-made.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I was afraid you were going as you are,\" said Bradley. \"Of course she\u0027d be glad to see you, but[Pg 217] she might be sensitive about her friends; and that wouldn\u0027t be agreeable to you, I\u0027m thinkin\u0027.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I thank you for your kind suggestion, my good friend,\" said Dewey; \"no doubt you are right.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Richard Dewey swallowed a hasty supper, and then sought the clothing shops, where he had no difficulty in procuring a ready-made outfit. So many persons came from the mines in his condition, desiring similar accommodation, that he was not required to go far to secure what he wanted.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Then, having obtained from Ben the proper directions, he took his way to the house of Mrs. Armstrong, which he reached about eight o\u0027clock.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Can I see Miss Florence Douglas?\" he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Armstrong, hearing the request, came herself to the door. She was feeling anxious about the prolonged absence of her young friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"May I ask your name, sir?\" she inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Richard Dewey.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"\u0027Richard Dewey\u0027?\" repeated Mrs. Armstrong, in amazement. \"Why, I thought you were sick in bed!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 218]\"What made you think so?\" asked Dewey, in equal amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Your own note. Miss Douglas, on receiving it, went away at once with the messenger, and has not returned.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I have sent no note, and no messenger has come from me. I don\u0027t understand you,\" said Richard Dewey, bewildered.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n It was soon explained, and the bitter disappointment of Dewey may well be imagined. This feeling was mingled with one of apprehension for the personal safety of the young lady.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"This is indeed alarming,\" he ejaculated. \"Who can have planned such an outrage?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I will tell you, sir,\" said a voice.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Turning quickly, Richard Dewey\u0027s glance rested upon Jones.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2954/81243.html","bookId":435,"creation":"Aug 5, 2019 2:18:21 AM","modification":"Aug 5, 2019 2:18:21 AM"}
