{"id":30420,"no":34,"title":"CHAPTER XXXIII. THE BLOW ABOUT TO FALL","content":"\u0026nbsp;All this happened soon after Ben went away. His uncle did not write him of it, for he knew it would trouble the boy, and it could do no good. \"No, wife,\" he said; \"Ben will have a hard row of his own to hoe. He mustn\u0027t have any part nor lot in our troubles.\" \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s very hard, Job, at our time of life,\" said Mrs. Stanton, despondently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"So it is, wife, but it may turn out for the best, after all. I haven\u0027t given up hope that Mr. Richmond will pay the sum, so that I can take up the mortgage. I\u0027m goin\u0027 to see him about it to-morrow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Uncle Job left his work the next day, and walked five miles to the store of the man who had brought this calamity upon him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027ve come to see you, Mr. Richmond,\" he said,[Pg 261] wiping his forehead with his red cotton handkerchief, \"about that money I\u0027ve had to pay.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh yes,\" said Richmond, with his usual suavity. \"I\u0027m very sorry it happened so.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It seems to me you didn\u0027t treat me just right,\" said poor Job.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Such things will happen, you know, Mr. Stanton.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"But you said it was only a matter of form signin\u0027 the note?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course I so regarded it. I could have sworn I should be ready to pay when the note became due. You see, there was money owing to me that I couldn\u0027t collect.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Didn\u0027t you know that was likely to happen when you tempted me to indorse the note?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It wasn\u0027t likely to happen, but it was possible. My plans miscarried, as any man\u0027s are liable to. If you were more used to business, Uncle Job, you\u0027d see that I hadn\u0027t acted wrong in the matter.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t understand the ways of business men, but I know you\u0027ve done me a grievous wrong, John Richmond,\" said Job Stanton, gravely.[Pg 262] \"I\u0027ve come to ask if you can pay me back a part of that money.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, I can\u0027t do it this morning. I\u0027ve got two payments to make. You don\u0027t look at it in the right light, Uncle Job.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I want my money,\" said the old man. \"When can you give it to me?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Since you push me so hard, I can only say I don\u0027t know,\" said Richmond, dropping his soft tones and looking angry.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Is that all the satisfaction you are goin\u0027 to give me? Don\u0027t you ever mean to pay me that money you\u0027ve made me pay out on your account, mortgaging my house and risking my home?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course I shall pay you some time, but I can\u0027t say exactly when,\" said the trader, brusquely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Will you sign a note for the money at three months or six months, John Richmond?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, I won\u0027t. You\u0027ll have to wait, Uncle Job, till I get ready to pay you; that\u0027s all about it. I may be ready next week, or it may not be till next month. A business-man can\u0027t always foresee how he\u0027ll be situated at any definite time.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 263]With this poor consolation Job Stanton had to rest content. He looked around him and saw every evidence of prosperity. Several customers were in the store, and the two clerks seemed to have as much as they could do. He saw money paid over for purchases in considerable amounts, and he felt that a part of it might be spared as a partial payment to him; but it was of no avail, and he turned sadly away.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n The next week passed, and the next month passed, and Job Stanton waited vainly for a payment on account from John Richmond. He didn\u0027t like to judge the trader harshly, but it did seem as if he was quite indifferent in the matter. Another month passed, and Job made another visit to the store of his prosperous debtor. Richmond wasted few words on him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Uncle Job,\" he said, \"it\u0027s no use your coming over here. I\u0027ll send you the money when I can spare it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Finally, six months passed, the mortgage became due, and Job received a notice from Major Sturgis that he wanted his money.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 264]\"If you can\u0027t raise it,\" said the major, \"I am willing to cancel the note, give you two hundred and fifty dollars, and take a deed of the place.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That is only allowing seven hundred and fifty dollars for it,\" said poor Job.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"It\u0027s all it is worth,\" said the rich man, coldly. \"If you prefer to put it up at auction, I am willing, but you may in that case get less. I\u0027ll give you three days to decide.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was great sorrow in Job Stanton\u0027s house that evening. Six months before he had considered himself well-to-do. Now, at the age of sixty, poverty and destitution stared him in the face.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2954/81249.html","bookId":435,"creation":"Aug 5, 2019 2:18:21 AM","modification":"Aug 5, 2019 2:18:21 AM"}
