{"id":30395,"no":9,"title":"CHAPTER VIII. TURNING THE TABLES.","content":"\u0026nbsp;When the three friends came in view of the cabin, the first sight which attracted their attention was the two mustangs, who stood, in patient enjoyment of the rest they so much needed, just outside. Their unlawful owners, as we know, were engaged inside in searching for gold-dust, without the slightest apprehension or expectation of interference. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s my mustang,\" exclaimed Bradley in a tone of suppressed excitement. \"I never looked to lay eyes on him again, but, thank the Lord! the thief has walked into a trap which I didn\u0027t set for him. We\u0027ll have a reckoning, and that pretty soon.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How do you know it\u0027s your mustang?\" asked Ben.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"There\u0027s a white spot on the left flank. The other one\u0027s yours: I know it by his make, though I can\u0027t lay hold of any sign. Even if I didn\u0027t know him,[Pg 71] his bein\u0027 in company with mine makes it stand to reason that it belongs to you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I shall be glad to have it again,\" said Ben, \"but we may have a tussle for them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I\u0027m ready,\" said Jake Bradley, grimly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n By this time they had come to a halt to consider the situation.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t hear anything,\" said Bradley, listening intently. \"I expect the skunks must be inside. Pray Heaven they haven\u0027t harmed poor Dewey!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then Dewey\u0027s voice was heard, and they were so near that they could distinguish his words.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Well, gentlemen,\" he said, \"how are you getting on? Have you found anything yet?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No, curse it!\" responded Mosely. \"Suppose you give us a hint.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Thank you, but I don\u0027t see how that\u0027s going to benefit me. If you find the money you mean to take it, don\u0027t you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should say so,\" answered Tom Hadley, frankly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Richard Dewey smiled. \"I commend your frankness,\" he said. \"Well, you can\u0027t expect a man to assist in robbing himself, can you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 72]\"You\u0027re mighty cool,\" growled Bill Mosely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"On the contrary, my indignation is very warm, I assure you.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look here, Dewey,\" said Mosely, pausing: \"I\u0027m goin\u0027 to make you a proposition.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Go on.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Of course we shall find this gold-dust of yours, but it\u0027s rather hard and troublesome work; so I\u0027ll tell you what we\u0027ll do. If you\u0027ll tell us where to find it, we\u0027ll leave a third of it for you. That\u0027ll be square, won\u0027t it? One part for me, one for my pard, and one for you? What do you say?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That you are very kind to allow me a third of what belongs wholly to me. But even if I should think this a profitable arrangement to enter into, how am I to feel secure against your carrying off all of the treasure?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You can trust to the honor of a gentleman,\" laid Mr. William Mosely, pompously.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Meaning you?\" asked Dewey, with a laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Meaning me, of course, and when perhaps for myself, perhaps for my pard also—eh, Tom?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should say so, Bill.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 73]\"I\u0027ve heard there\u0027s honor among thieves,\" said Dewey, smiling, \"and this appears to be an illustration of it. Well, gentlemen, I\u0027m sorry to say I don\u0027t feel that confidence in your honor or your word which would justify me in accepting your kind proposal.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you doubt my word?\" blustered Mosely.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I feel no doubt on the subject,\" answered Dewey.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I accept your apology,\" said Mosely; \"it\u0027s lucky you made it. Me and my friend don\u0027t stand no insults. We don\u0027t take no back talk. We\u0027re bad men when we get into a scrimmage—eh, Tom?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I don\u0027t doubt your word in the least,\" said Dewey. \"It gives me pleasure to assent cordially to the description you give of yourselves.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tom Hadley, who was rather obtuse, took this as a compliment, but Mosely was not altogether clear whether Dewey was not chaffing them. \"That sounds all right,\" said he, suspiciously, \"if you mean it.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Oh, set your mind quite at rest on that subject, Bill, if that is your name. You may be sure that I mean everything I say.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 74]\"Then you won\u0027t give us a hint where to dig?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am sorry to disoblige you, but I really couldn\u0027t.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Do you hear that, Ben?\" said Jake Bradley, his mouth distended with a grin. \"Dick\u0027s chaffin\u0027 them scoundrels, and they can\u0027t see it. It looks as if they was huntin\u0027 for the gold-dust. They haven\u0027t found anything yet, and they haven\u0027t hurt Dick, or he wouldn\u0027t talk as cool as he does.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a brief conference, and then the first movement was made by the besieging-party.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Ki Sing, by Bradley\u0027s direction, walked to the entrance of the hut and looked placidly in.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n As Mosely looked up he saw the Chinaman\u0027s face looking like a full moon, and for an instant he was stupefied. He could not conceive how his victim could have escaped from his captivity.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Tom,\" he ejaculated, pointing to the doorway, \"look there!\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should say so!\" ejaculated Tom Hadley, no less surprised than his friend.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did you get here?\" demanded Bill Mosely, addressing the Chinaman.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 75]\"Me walk up hill,\" answered Ki Sing, with a bland smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"How did you get away from the tree? That\u0027s what I mean, you stupid.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Fliend come along—cut stling,\" answered the Chinaman, pronouncing his words in Mongolian fashion.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bill Mosely was startled. So Ki Sing had a friend. Was the friend with him? \"Where is your friend?\" he asked abruptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That my fliend,\" said the crafty Ki Sing, pointing to his master on the pallet in the corner.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes, Ki Sing,\" said Dewey, \"we are friends and will remain so, my good fellow.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Though he did not quite understand why Ben and Jake Bradley did not present themselves, he felt sure that they were close at hand, and that his unwelcome visitors would very soon find it getting hot for them.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Look here, you yellow baboon!\" said Bill Mosely, angrily, \"you know what I mean. This man here didn\u0027t free you from the tree. Anyway, you were a fool to come back. Do you know what I am going to do with you?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 76]Ki Sing shook his head placidly.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am going to tie you hand and foot and roll you down hill. You\u0027d better have stayed where you were.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"No want loll down hillee,\" said the Chinaman, without, however, betraying any fear.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I sha\u0027n\u0027t ask whether you like it or not. But stop! Perhaps you can help us. Do you know where the gold-dust is?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Yes,\" answered Ki Sing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bill Mosely\u0027s face lighted up with pleasure. He thought he saw the way out of his difficulty.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"That\u0027s the very thing!\" he cried, turning to his partner—\"eh, Tom?\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I should say so, Bill.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Just show us where it is, and we won\u0027t do you any harm.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"If my fliend, Dickee Dewee, tell me to, I will,\" said Ki Sing.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Dewey, thus appealed to, said, \"No, Ki Sing; they only want to rob me, and I am not willing to have you show them.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027d better shut up, Dewey,\" said Mosely, in[Pg 77]solently; \"you\u0027re a dead duck, and you\u0027re only gettin\u0027 this foolish heathen into trouble. We\u0027ve got tired of waitin\u0027 \u0027round here, and—\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"I am ready to excuse you any time,\" said Dewey. \"Don\u0027t stay on my account, I beg. In fact, the sooner you leave the better it will please me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Bill Mosely, who didn\u0027t fancy Dewey\u0027s sarcasm, frowned fiercely and turned again to Ki Sing. \"Will you show us or not?\" he demanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"Velly solly,\" said Ki Sing, with a childish smile, \"but Dickee Dewee won\u0027t let me.\"\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n With an oath Mosely sprang to the doorway and tried to clutch the Chinaman, when the latter slid to one side and Jake Bradley confronted him.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \"You\u0027d better begin with me, Bill Mosely,\" he said.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2954/81224.html","bookId":435,"creation":"Aug 5, 2019 2:18:21 AM","modification":"Aug 5, 2019 2:18:21 AM"}
