{"id":87315,"no":13,"title":"Page 13","content":"\u003cp\u003e“I just moved back home a few days ago,” I say. “My mother and I had a pretty shitty year last year, so I moved in with my dad in Austin for a while. I’ve been going to school there, but felt like it was time to come back home. So here I am.”\u003c/p\u003e\n\u003cp\u003eShe squints like she’s trying to scowl at me, but the expression she makes is too adorable to find intimidating. I keep my smile in check, though, because I can tell she’s taking this school thing seriously. “None of that explains why you decided to drop out, rather than just transfer back.”\u003c/p\u003e\n\u003cp\u003eShe’s right, but only because I really don’t know the answer to her question.\u003c/p\u003e\n\u003cp\u003e“I don’t know. To be honest, I’m still trying to decide what I want to do. It’s been a pretty fucked-up year. Not to mention I hate this school. I’m tired of the bullshit and sometimes I think it would be easier to just test out.”\u003c/p\u003e\n\u003cp\u003eShe stops dead in her tracks again and glares at me. “That’s a crap excuse.”\u003c/p\u003e\n\u003cp\u003e“It’s crap that I hate high school?”\u003c/p\u003e\n\u003cp\u003e“No. It’s crap that you’re letting one bad year determine your fate for the rest of your life. You’re nine months away from graduation, so you drop out? It’s just . . . it’s stupid.”\u003c/p\u003e\n\u003cp\u003eShe’s really taking this seriously. I laugh, even though I’m trying really hard not to. “Well, when you put it so eloquently.”\u003c/p\u003e\n\u003cp\u003eShe crosses her arms and huffs. “Laugh all you want. You quitting school is just giving in. You’re proving everyone that’s ever doubted you right.”\u003c/p\u003e\n\u003cp\u003eHer eyes drop to the tattoo on my arm. I’ve never wanted to hide it until this moment, but something about her reading it seems like an invasion of privacy in a way. Maybe because I was so certain yesterday that she was half the reason for the tattoo on my arm. But now that I know she’s not, I really don’t want her asking about it. “You’re gonna drop out and show the world just how hopeless you really are? Way to stick it to ’em.”\u003c/p\u003e\n\u003cp\u003eI look down at the tattoo. She has no idea what the meaning is behind it and I realize that. But her assumption that it means anything other than what it means sort of pisses me off. I don’t want to explain it to her and I certainly don’t want to be judged by someone who seems to be receiving her own fair share of judgments. Rather than stick around and allow her to decipher me even more, I nudge my head toward her house. “You’re here,” I say flatly. I turn around and head toward home without looking back at her. No need to get too detailed with her, anyway, until I find out more about her relationship with Grayson. And in order to do that, I need to hurry up and get back to my house so I can shower and change in time for my first and possibly only day of senior year.\u003c/p\u003e\n\u003cp\u003eThis is a large school, which is why I didn’t expect to actually have a class with her, much less the first one. And with Mr. Mulligan, to top it off.\u003c/p\u003e\n\u003cp\u003eShe didn’t seem too happy to see me, either. And the fact that she just practically ran past me to get out of the classroom doesn’t seem to bode well. I pick up my textbook and make my way out of the classroom. Rather than search for my next class, I head straight to find her, instead.\u003c/p\u003e\n\u003cp\u003eShe’s facing her locker, switching books. I walk up behind her but pause for a moment before speaking to her. I want to give her a chance to get what she needs from her locker, because I’m hoping I’ll be walking her to her next class.\u003c/p\u003e\n\u003cp\u003e“Hey, you,” I say optimistically. There’s a pause.\u003c/p\u003e\n\u003cp\u003e“You came,” she says, her voice cool and composed. She turns around to face me and just seeing her eyes again makes me smile. I lean against the locker next to hers and tilt my head against the cold metal. I eye her outfit for a second, taking in the fact that she somehow looks even better after a shower.\u003c/p\u003e\n\u003cp\u003e“You clean up nice. Although, the sweaty version of you isn’t so bad, either,” I say, smiling at her. I’m trying to ease some of the tension rolling off her, but nothing seems to be working in my favor.\u003c/p\u003e\n\u003cp\u003e“Are you here stalking me or did you actually re-enroll?” she asks.\u003c/p\u003e\n\u003cp\u003eA joke. She made a joke.\u003c/p\u003e\n\u003cp\u003e“Both,” I say, tapping my fingers against the metal. I’m still smiling at her but she won’t maintain eye contact with me for more than two seconds. She shifts her feet and looks nervously around us.\u003c/p\u003e\n\u003cp\u003e“Well, I need to get to class,” she says, her voice monotone. “Welcome back.”\u003c/p\u003e\n\u003cp\u003eShe’s being weird. “You’re being weird.”\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes and turns back to her locker. “I’m just surprised to see you here,” she says unconvincingly.\u003c/p\u003e\n\u003cp\u003e“Nope,” I say. “It’s something else. What’s wrong?”\u003c/p\u003e\n\u003cp\u003eMy persistence seems to be paying off because she sighs and presses her back against the locker and looks up at me. “You want me to be honest?”\u003c/p\u003e\n\u003cp\u003e“That’s all I ever want you to be.”\u003c/p\u003e\n\u003cp\u003eShe purses her lips together. “Fine,” she says. “I don’t want to give you the wrong idea. You flirt and say things like you have intentions with me that I’m not willing to reciprocate. And you’re . . .”\u003c/p\u003e\n\u003cp\u003eShe doesn’t want to give me the wrong idea? Who is this and what the hell did she do with the girl who was blatantly flirting with me last night? I narrow my eyes at her. “I’m what?” I say, challenging her to finish her thought.\u003c/p\u003e\n\u003cp\u003e“You’re . . . intense. Too intense. And moody. And a little bit scary. And there’s the other thing . . . I just don’t want you getting the wrong idea.”\u003c/p\u003e\n\u003cp\u003eAnd there it is. She’s been fed the lies and now I’m left to have to defend myself to the one person I incorrectly assumed might empathize with me.\u003c/p\u003e\n\u003cp\u003e“What other thing?”\u003c/p\u003e\n\u003cp\u003e“You know,” she says, darting her eyes to the floor.\u003c/p\u003e\n\u003cp\u003eI take a step toward her and place my hand against the locker beside her head. “I don’t know, because you’re skirting around whatever issue it is you have with me like you’re too afraid to say it. Just say it.”\u003c/p\u003e\n\u003cp\u003eHer eyes grow wide and I immediately feel guilty for being so harsh with her. It just frustrates me no end that she would feed into their bullshit. The same bullshit that surrounds her.\u003c/p\u003e\n\u003cp\u003e“I heard about what you did,” she blurts out. “I know about the guy you beat up. I know about you being sent to juvi. I know that in the two days I’ve known you, you’ve scared the shit out of me at least three times. And since we’re being honest, I also know that if you’ve been asking around about me, then you’ve probably heard about my reputation, which is more than likely the only reason you’re even making an effort with me. I hate to disappoint you, but I’m not screwing you. I don’t want you thinking anything will happen between us besides what’s already happening. We run together. That’s it.”\u003c/p\u003e\n\u003cp\u003eWow.\u003c/p\u003e\n\u003cp\u003eI was expecting her to hear the rumors about me, but I wasn’t expecting her to think I believe the rumors about her. So that’s why her guard is up? Because she thinks I heard the rumors and now I’m just trying to screw her?\u003c/p\u003e\n\u003cp\u003eI mean, don’t get me wrong. I’m not saying the thought hasn’t crossed my mind. But Jesus, not like that. The fact that she even feels this way only makes me want to hug her. The thought of anyone intentionally trying to get close to her for that sole reason pisses me off. It doesn’t help matters that Grayson is standing next to her now.\u003c/p\u003e\n\u003cp\u003eWhere the hell did he come from? And why the hell does he have his arm around her like he owns her?\u003c/p\u003e\n\u003cp\u003e“Holder,” Grayson says. “Didn’t know you were coming back.”\u003c/p\u003e\n\u003cp\u003eThey’re the first words he’s spoken directly to me since the night before Les died. I’m afraid if I look at him I’ll lose it, so I keep my eyes trained hard on Sky’s. Unfortunately, my eyes can’t seem to stop looking at the hand that’s still gripping her waist. The hand that Sky hasn’t slapped away. The hand that has obviously been around that same waist before. The same hand that used to be around Les.\u003c/p\u003e\n\u003cp\u003eThis entire situation is too ironic. So much so, I crack a smile. Just my luck.\u003c/p\u003e\n\u003cp\u003eI straighten up and keep my eyes locked on the hand around Sky’s waist. “Well, I’m back,” I say. I can’t watch this for another second. That familiar feeling of wanting to rip his fucking hand off has returned tenfold.\u003c/p\u003e\n\u003cp\u003eI walk away and make it a few feet down the hall before I turn around and face Sky again. “Track tryouts are Thursday after school. Go.”\u003c/p\u003e\n\u003cp\u003eI don’t wait for her response. I walk to my locker and exchange books, then head to my next class. I don’t know why, though. I’m pretty sure I won’t be coming back tomorrow.\u003c/p\u003e\n\u003cp\u003e“Hey, dickweed. What’s this sudden infatuation with Sky?” Daniel asks as we make our way toward the cafeteria.\u003c/p\u003e\n\u003cp\u003e“It’s nothing,” I say, attempting to brush it off. “I met her yesterday and was just curious about her. But apparently she’s with Grayson, so . . . whatever.”\u003c/p\u003e\n\u003cp\u003eDaniel raises an eyebrow, but says nothing about the Grayson comment. He pushes through the cafeteria doors and we walk to our table. I take a seat and scan the crowd, searching for her.\u003c/p\u003e\n\u003cp\u003e“You gonna eat today?” he asks.\u003c/p\u003e\n\u003cp\u003eI shake my head. “Nah. I don’t really feel like it.” I lost my appetite this morning as soon as Grayson’s arm went around Sky’s waist.\u003c/p\u003e\n\u003cp\u003eDaniel shrugs and walks away to get himself food. I search the cafeteria a while longer and finally spot her a few tables down, sitting with a guy. He’s not Grayson, though. I scan the crowd for Grayson and find him seated at a table on the opposite end of the cafeteria. They’re not sitting together. Why wouldn’t they sit together if they’re dating? And if they’re not dating, why would he be touching her like he was?\u003c/p\u003e\n\u003cp\u003e“I got you a water,” Daniel says, sliding it across the table to me.\u003c/p\u003e\n\u003cp\u003e“Thanks.”\u003c/p\u003e\n\u003cp\u003eHe sets his tray down and takes a seat across from me. “Why are you being such a cunt nugget?”\u003c/p\u003e\n\u003cp\u003eWater spews out of my mouth and I drop my arms onto the table and laugh, wiping my mouth. “Cunt nugget?”\u003c/p\u003e\n\u003cp\u003eHe nods and pops the lid on his soda. “Something’s off with you. You stared at that girl the entire time I was in line for food. You won’t tell me anything about her. You’ve been on edge since you got here this morning and it has nothing to do with the fact that it’s your first day back at school since . . . well . . . since your last day at school. And you haven’t even commented about how no one seems to give a shit that you’re even here today. Aren’t you a little excited everyone has stopped with the gossip?”\u003c/p\u003e\n\u003cp\u003eI would be excited if I was convinced the gossip had stopped. But it hasn’t stopped, it’s just been shifted in a different direction. I heard Sky’s name mentioned in every single class I’ve had today. Not to mention the shit I’ve seen slapped on her locker in the form of sticky-notes.\u003c/p\u003e\n\u003cp\u003e“They didn’t stop with the gossip, Daniel. They just found someone new to target.”\u003c/p\u003e\n\u003cp\u003eDaniel starts to reply, but he’s cut off by several trays dropping down onto the table. Guys slide into seats and several of them welcome me back, going on about how I made it right in time for football season. That leads into a conversation about practices and Coach Riley, but none of it can hold my attention like she does. I ignore everyone around me and watch her, still trying to figure her out. \u003c/p\u003e","sourceLink":"https://allnovel.net/losing-hope-hopeless-2/page-13.html","bookId":2778,"creation":"Oct 5, 2019 5:21:07 PM","modification":"Oct 5, 2019 5:21:07 PM"}
