{"id":87316,"no":14,"title":"Page 14","content":"\u003cp\u003eI honestly don’t want to impede if she’s dating Grayson. If she’s happy with him, then fine. Good for them. But I’ll be damned if I don’t get to the bottom of what happened to her eye. I need a straight explanation from her before I can let it go. Otherwise, I’ll be going to Grayson to find out what happened to her eye, and I know how that’ll end.\u003c/p\u003e\n\u003cp\u003eThe guy she’s sitting with nods in my direction when he sees me staring at them. I make it a point not to turn away, because I actually want to get her attention. When she looks at me, I nudge my head toward the cafeteria doors, then stand up and walk toward them.\u003c/p\u003e\n\u003cp\u003eI walk out into the hallway, hoping she’ll follow me. I know it’s not my business, but if I expect to make it through the rest of the day without murdering Grayson, I have to know the truth. I walk around the corner for more privacy and lean back against the row of lockers. She walks around the corner and spots me, then comes to a stop.\u003c/p\u003e\n\u003cp\u003e“Are you dating Grayson?” I ask. I keep it short and sweet. She doesn’t seem to like having conversations with me, so I don’t want to force her to do something she doesn’t want to do. I just want the truth so I can justify my next move.\u003c/p\u003e\n\u003cp\u003eShe rolls her eyes and walks to the lockers across from me, leaning against them to face me. “Does it matter?”\u003c/p\u003e\n\u003cp\u003eHmm. It shouldn’t matter, but it does. I have no idea what kind of person she is, but Grayson doesn’t deserve her. So yes, it does matter.\u003c/p\u003e\n\u003cp\u003e“He’s an asshole,” I say.\u003c/p\u003e\n\u003cp\u003e“Sometimes you are, too,” she bites back.\u003c/p\u003e\n\u003cp\u003e“He’s not good for you.”\u003c/p\u003e\n\u003cp\u003eShe laughs and rolls her eyes toward the ceiling, shaking her head. “And you are?”\u003c/p\u003e\n\u003cp\u003eI groan. She’s missing my point completely. I turn around to face the lockers and hit one of them with an open palm, releasing some of the frustration she’s causing me with her stubbornness. When the sound echoes through the hallway I cringe. That came off a little harsher than I meant for it to.\u003c/p\u003e\n\u003cp\u003eBut I am angry and I hate that I’m angry because I shouldn’t even give a shit. Les isn’t around for Grayson to fuck over, so why do I care?\u003c/p\u003e\n\u003cp\u003eBecause I don’t want her with him. That’s why.\u003c/p\u003e\n\u003cp\u003eI turn around and face her again. “Don’t factor me into this. I’m talking about Grayson, not me. You shouldn’t be with him. You have no idea what kind of person he is.”\u003c/p\u003e\n\u003cp\u003eShe rolls her head back against the locker, fed up with me. “Two days, Holder. I’ve known you all of two days,” she says. She kicks off the lockers and walks toward me, eyeing me angrily. “In those two days, I’ve seen five different sides of you, and only one of them has been appealing. The fact that you think you have any right to even voice an opinion about me or my decisions is absurd. It’s ridiculous.”\u003c/p\u003e\n\u003cp\u003eI inhale through my nose and exhale through my clenched teeth, because I’m pissed. Pissed that she’s right. She’s seen me go from hot to cold more than once over these past two days and I haven’t given her a single explanation. She deserves an explanation for my oddly overprotective behavior, so I attempt to give her one.\u003c/p\u003e\n\u003cp\u003eI take a step toward her. “I don’t like him. And when I see things like this?” I bring my fingers up to trace the bruise underneath her eye. “And then see him with his arm around you? Forgive me if I get a little ridiculous.”\u003c/p\u003e\n\u003cp\u003eThe moment my fingers finish tracing the bruise, I fail to remove them from her cheek. Her breath hitches and her eyes grow wider and I can’t help but notice the obvious reaction she has to my touch. I have an overwhelming urge to run my hand through her hair and pull her mouth to mine, but she pulls away from me and takes a step back.\u003c/p\u003e\n\u003cp\u003e“You think I should stay away from Grayson because you’re afraid he has a temper?” She narrows her eyes and tilts her head. “A bit hypocritical, don’t you think?”\u003c/p\u003e\n\u003cp\u003eI keep my eyes locked on hers as I process her comment. She’s comparing me to Grayson?\u003c/p\u003e\n\u003cp\u003eI have to turn away from her so she doesn’t see the disappointment on my face. I grip the back of my neck with both hands, then slowly turn back around to face her, but I keep my eyes trained on the floor.\u003c/p\u003e\n\u003cp\u003e“Did he hit you,” I say with a defeated sigh. I look back up at her and directly into her eyes. “Has he ever hit you?”\u003c/p\u003e\n\u003cp\u003eShe doesn’t flinch or look away. She just shakes her head. “No,” she says softly. “And no. I told you . . . it was an accident.”\u003c/p\u003e\n\u003cp\u003eI can tell by her reaction that she’s telling the truth. He didn’t hit her. He never hit her, and I’m more than relieved. But still confused. If she’s not dating him and he really didn’t hit her, then what’s her connection to him? Does she want to date him? Because I sure as hell don’t want her to.\u003c/p\u003e\n\u003cp\u003eThe bell rings right when I open my mouth to ask her what her relationship is with Grayson. The hallway fills with students and she breaks eye contact with me, then walks back toward the cafeteria.\u003c/p\u003e\n\u003cp\u003eI haven’t seen Daniel again. I also didn’t have another class with Sky, which disappoints me. I don’t know why, though. We can’t seem to have a conversation without it ending in an argument, but that doesn’t stop me from wanting to have another conversation with her.\u003c/p\u003e\n\u003cp\u003eI leave my books in my locker, still not sure if I’ll be back tomorrow. I grab my keys and walk toward the parking lot. I’m several feet from my car when I look up and see Grayson leaning against it. I stop and assess the situation. He’s eyeing me coldly, but he’s alone. Not sure what he wants or why he’s touching my car.\u003c/p\u003e\n\u003cp\u003e“Grayson, whatever it is, I’m not interested. Just let it go.” I’m not in the mood for him right now and he really needs to get the hell off my car.\u003c/p\u003e\n\u003cp\u003e“You know,” he says, pushing off the car with his foot. He folds his arms across his chest and walks toward me. “I really wish I could just let it go, Holder. But for some reason you seem so focused on my business, you really make it impossible for me to let it go.”\u003c/p\u003e\n\u003cp\u003eHe’s within reach of my fist now, which isn’t very smart of him. I keep my eyes locked on his, but watch his hands out of my peripheral vision.\u003c/p\u003e\n\u003cp\u003e“You’ve been back less than a day and you’re already at it again,” he says, stupidly walking even closer to me. “Sky is off-limits to you, Holder. Don’t talk to her. Don’t look at her.” I can’t believe I’m still allowing him to speak. “Don’t go fucking near her. The last thing I need is for another one of my girlfriend’s to kill herself because of you.”\u003c/p\u003e\n\u003cp\u003eI’m in that moment.\u003c/p\u003e\n\u003cp\u003eThe moment when rational thought is drowned out by anger.\u003c/p\u003e\n\u003cp\u003eThe moment when a person’s conscience is stifled by rage.\u003c/p\u003e\n\u003cp\u003eThe moment when the vision of releasing every pent-up feeling I’ve had for thirteen months surfaces, and it actually feels good. His face would feel so good against my fist right now and the thought of it makes me smile as I clench my fists and inhale a breath.\u003c/p\u003e\n\u003cp\u003eBut Grayson quickly becomes an afterthought when I look over his shoulder and see Sky across the parking lot, climbing into her car. She doesn’t even glance around the parking lot to look for Grayson. She just climbs into her car, shuts her door, and leaves.\u003c/p\u003e\n\u003cp\u003eIt’s in that moment that I realize he’s full of shit.\u003c/p\u003e\n\u003cp\u003eThey weren’t sitting together at lunch.\u003c/p\u003e\n\u003cp\u003eShe wasn’t at the party with him Saturday night.\u003c/p\u003e\n\u003cp\u003eShe’s not waiting for him after school.\u003c/p\u003e\n\u003cp\u003eShe’s not even looking for him in the parking lot right now.\u003c/p\u003e\n\u003cp\u003eEverything falls into place as Grayson takes a step back, gauging my reaction, waiting for me to take his bait. Sky doesn’t care about him. That’s why he’s so pissed that I was talking to her in the hallway. She doesn’t give a shit about him and he doesn’t want me to know that.\u003c/p\u003e\n\u003cp\u003eHe’s not worth it, I repeat to myself.\u003c/p\u003e\n\u003cp\u003eI watch as Sky pulls out of the parking lot, then I slowly refocus my gaze on Grayson. I’m oddly calm after coming to this new realization, but his jaw is clenched tighter than his fists. He wants me to fight him. He wants me to get kicked out of school.\u003c/p\u003e\n\u003cp\u003eHe doesn’t deserve to get a single damn thing he wants.\u003c/p\u003e\n\u003cp\u003eI raise my arm. His eyes dart to my hand and he puts his own hands up in defense. I point the clicker toward my car and press the button, unlocking my doors. I silently walk around him and climb into my car, then pull out of the parking lot without giving him the reaction he was hoping for.\u003c/p\u003e\n\u003cp\u003eFuck him. He’s not worth it.\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003eI open the refrigerator door because I’m starving, but I haven’t had anything to eat in over thirteen months. I haven’t taken a single bite of food since Les died and it’s weird that I’m still alive after all this time.\u003c/p\u003e\n\u003cp\u003eIt takes the refrigerator light a second to kick on, even after I have the door open. As soon as the contents of the refrigerator are illuminated, I’m immediately disappointed. Every single shelf is stuffed with Les’s jeans. They’re all folded neatly on the shelves of the refrigerator and it pisses me off because this is where the food should be and I’m fucking hungry.\u003c/p\u003e\n\u003cp\u003eI open one of the crisper drawers, hoping the food is hidden in there, but there’s no food. Just another pair of neatly folded jeans. I shut it and open the other crisper drawer and her jeans are in there, too.\u003c/p\u003e\n\u003cp\u003eHow many fucking pairs of jeans does she need? And why are they in the refrigerator where the food is supposed to be?\u003c/p\u003e\n\u003cp\u003eI close the refrigerator door and open the freezer, but I’m met with the same thing, only this time the jeans are frozen. They’re all in freezer bags labeled “Les’s jeans.” I slam the freezer door shut, irritated, and turn toward the pantry, hoping to find something to eat in there.\u003c/p\u003e\n\u003cp\u003eI walk around the kitchen island and look down.\u003c/p\u003e\n\u003cp\u003eI see her.\u003c/p\u003e\n\u003cp\u003eI squeeze my eyes shut and open them again, but she’s still there.\u003c/p\u003e\n\u003cp\u003eLes is huddled in a fetal position on the kitchen floor, her back pressed up against the pantry door.\u003c/p\u003e\n\u003cp\u003eThis makes no sense.\u003c/p\u003e\n\u003cp\u003eHow is she here?\u003c/p\u003e\n\u003cp\u003eShe’s been dead for thirteen months.\u003c/p\u003e\n\u003cp\u003eI’m hungry.\u003c/p\u003e\n\u003cp\u003e“Dean,” she whispers.\u003c/p\u003e\n\u003cp\u003eHer eyes flick open and I immediately have to reach my hand out in order to steady myself against the island. My body suddenly becomes too heavy to hold up and I take a small step back, right before my legs give out and I fall to my knees in front of her.\u003c/p\u003e\n\u003cp\u003eHer eyes are open wide now and they’re completely gray. No pupil, no irises. Just glossed-over gray eyes that are searching for me, unable to find me.\u003c/p\u003e\n\u003cp\u003e“Dean,” she says again in a hoarse whisper. She blindly reaches her arm out toward me and her fingers feel around in front of her.\u003c/p\u003e\n\u003cp\u003eI want to help her. I want to reach out and grab her hand but I’m too weak to move. Or my body weighs too much. I don’t know what it is that’s stopping me, but I’m only two feet in front of her and I’m doing everything I can to lift my arm and take her hand but it won’t fucking move. The more I struggle to regain control over my movements, the harder it becomes to breathe. She’s crying now, saying my name. My chest tightens and my throat begins to close up and now I can’t even calm her down with words because nothing will come out. I work the muscles in my jaw, but my teeth are clenched tight and my mouth won’t open. \u003c/p\u003e","sourceLink":"https://allnovel.net/losing-hope-hopeless-2/page-14.html","bookId":2778,"creation":"Oct 5, 2019 5:21:07 PM","modification":"Oct 5, 2019 5:21:07 PM"}
