{"id":87317,"no":15,"title":"Page 15","content":"\u003cp\u003eShe’s pulling herself up on her elbow, slowly scooting closer to me. She’s trying to reach out for me but her lifeless eyes can’t find me. She’s crying even harder now.\u003c/p\u003e\n\u003cp\u003e“Help me, Dean,” she says.\u003c/p\u003e\n\u003cp\u003eShe hasn’t called me Dean since we were kids and I don’t know why she’s calling me Dean now. I don’t like it.\u003c/p\u003e\n\u003cp\u003eI squeeze my eyes shut and try to focus on getting my voice to work or my arms to move, but all the concentration in the world can’t help me right now.\u003c/p\u003e\n\u003cp\u003e“Dean, please,” she cries, only this time it’s not her voice. It’s the voice of a child. “Don’t go,” the child begs.\u003c/p\u003e\n\u003cp\u003eI open my eyes and Les is no longer there, but someone else has taken her place. A little girl is sitting with her back pressed against the pantry door and her head is buried in her arms that are wrapped tightly around her legs.\u003c/p\u003e\n\u003cp\u003eHope.\u003c/p\u003e\n\u003cp\u003eI still can’t move or speak or breathe and my chest is growing tighter and tighter with each sob that racks the little girl’s body. All I can do is sit and watch her cry, because I’m physically unable to even turn my head or close my eyes.\u003c/p\u003e\n\u003cp\u003e“Dean,” she says, her voice muffled by her arms and her tears. It’s the first time I’ve heard her say my name since the day she was taken and it knocks out what little breath I had left in me. She slowly lifts her head away from her arms and widens her eyes. They’re solid gray, identical to Les’s. She leans her head back against the pantry door and wipes away a tear with the back of her hand.\u003c/p\u003e\n\u003cp\u003e“You found me,” she whispers.\u003c/p\u003e\n\u003cp\u003eOnly this time, it’s not the voice of the little girl anymore. It’s not even Les’s voice.\u003c/p\u003e\n\u003cp\u003eIt’s Sky’s.\u003c/p\u003e\n\u003cp\u003eChapter Eleven\u003c/p\u003e\n\u003cp\u003eI open my eyes and I’m no longer on the kitchen floor.\u003c/p\u003e\n\u003cp\u003eI’m in my bed.\u003c/p\u003e\n\u003cp\u003eI’m covered in sweat.\u003c/p\u003e\n\u003cp\u003eI’m gasping for air.\u003c/p\u003e\n\u003cp\u003eChapter Twelve\u003c/p\u003e\n\u003cp\u003eI couldn’t go back to sleep last night after the nightmare. I’ve been awake since two in the morning and it’s now after six.\u003c/p\u003e\n\u003cp\u003eI drop down onto the sidewalk when I reach her house. I stretch my legs out in front of me and lean forward, grabbing my shoes while I stretch the muscles in my back. I’ve been tense for days and nothing I do seems to help.\u003c/p\u003e\n\u003cp\u003eBefore I went to sleep last night I had no intention of running with her again today. But I’ve been sitting alone for over four hours, wide awake, and the only thing that even remotely appealed to me was the thought of seeing Sky again.\u003c/p\u003e\n\u003cp\u003eI also had no intention of going back to school today but it seems way more appealing than staying home all day. It’s like I’ve been living minute to minute since the moment I got back from Austin last week. I’m not sure from one moment to the next what I’m doing or where I’ll be or even what frame of mind I’ll be in.\u003c/p\u003e\n\u003cp\u003eI don’t like this instability.\u003c/p\u003e\n\u003cp\u003eI also don’t like that I’m at her house again today, waiting on her to come outside for her morning run. I don’t like that I still feel the need to be around her. I don’t like the fact that I don’t want her to believe the rumors about me. I don’t give a shit when anyone else believes them. Why do I give a shit if she believes them?\u003c/p\u003e\n\u003cp\u003eI shouldn’t. I should just go back home and leave her to believe whatever she wants to believe.\u003c/p\u003e\n\u003cp\u003eI stand up in an attempt to talk myself into leaving, but I just stand here, waiting on her. I know I need to leave and I know I don’t want to be involved with anyone even remotely interested in Grayson, but I can’t do it. I can’t leave because I want to see her again a whole lot more than I want to leave.\u003c/p\u003e\n\u003cp\u003eA noise comes from the side of her house, so I take a few steps to get a look. She’s climbing headfirst out of her window.\u003c/p\u003e\n\u003cp\u003eJust seeing her again, even from a distance, reminds me of why I crave to be around her so much. It’s only been a few days, but since the moment I met her, no matter where I am, I’m constantly wondering about her. My attention is constantly homed in on her like I’m a compass and she’s my North.\u003c/p\u003e\n\u003cp\u003eOnce she’s outside, she pauses and looks up toward the sky, inhaling a deep breath. I take a few hesitant steps toward her. “Do you always climb out your window or were you just hoping to avoid me?”\u003c/p\u003e\n\u003cp\u003eShe spins around, wide-eyed. I try not to let my eyes dip below her neck, but the things I’ve seen her run in are hard not to stare at.\u003c/p\u003e\n\u003cp\u003eKeep looking at her face, Holder. You can do it.\u003c/p\u003e\n\u003cp\u003eShe glances at me, but doesn’t make eye contact. Her eyes lock on my stomach and I’m curious if it’s because she likes that I’m not wearing a shirt or if it’s because she can’t stand me to the point that it’s hard for her to look me in the eyes. “If I was trying to avoid you I would have just stayed in bed.” She walks past me and lowers herself onto the sidewalk.\u003c/p\u003e\n\u003cp\u003eI hate that her voice does things to my body that no other voice could ever do. But I also love it and want her to keep talking, even if she is rude most of the time.\u003c/p\u003e\n\u003cp\u003eI watch as she pushes her legs out in front of her and begins to stretch. She seems fairly calm today, despite the fact that I showed up. I sort of expected her to tell me to go the hell away after how we left things in the hallway yesterday.\u003c/p\u003e\n\u003cp\u003e“I wasn’t sure if you’d show up,” I say, taking a seat on the sidewalk in front of her.\u003c/p\u003e\n\u003cp\u003eShe lifts her head and looks me in the eyes this time. “Why wouldn’t I? I’m not the one with the issues. Besides, neither of us owns the road.”\u003c/p\u003e\n\u003cp\u003eIssues?\u003c/p\u003e\n\u003cp\u003eShe thinks I have issues?\u003c/p\u003e\n\u003cp\u003eI’m not the one feeding into the rumors like she is. I’m also not the one leaving notes on her locker, nor am I one of the many people at school who have treated her like shit. If anything, I’ve been one of the few people to be nice to her.\u003c/p\u003e\n\u003cp\u003eBut she thinks I’m the one with the issues?\u003c/p\u003e\n\u003cp\u003e“Give me your hands,” I say, mirroring her position. “I need to stretch, too.”\u003c/p\u003e\n\u003cp\u003eShe shoots me a curious look, but takes my hands and leans back, pulling me forward.\u003c/p\u003e\n\u003cp\u003e“For the record,” I say, “I wasn’t the one with the issue yesterday.”\u003c/p\u003e\n\u003cp\u003eI can feel her lean back farther, tightening her grip on my wrists. “Are you insinuating I’m the one with the issue?” she asks.\u003c/p\u003e\n\u003cp\u003e“Aren’t you?”\u003c/p\u003e\n\u003cp\u003e“Clarify,” she says. “I don’t like vague.”\u003c/p\u003e\n\u003cp\u003eShe doesn’t like vague.\u003c/p\u003e\n\u003cp\u003eFunny, because I don’t either. I like truth and that’s exactly the point I’m trying to make to this girl. “Sky, if there’s one thing you should know about me, it’s that I don’t do vague. I told you I’ll only ever be honest with you, and to me, vague is the same thing as dishonesty.” I switch positions and pull her forward as I lean back.\u003c/p\u003e\n\u003cp\u003e“That’s a pretty vague answer you just gave me,” she says.\u003c/p\u003e\n\u003cp\u003e“I was never asked a question. I’ve told you before, if you want to know something, just ask. You seem to think you know me, yet you’ve never actually asked me anything yourself.”\u003c/p\u003e\n\u003cp\u003e“I don’t know you,” she snaps.\u003c/p\u003e\n\u003cp\u003eI laugh, because she’s absolutely right. She doesn’t know me at all, but it certainly seems like she’s a quick one to judge.\u003c/p\u003e\n\u003cp\u003eI don’t know why I’m even bothering with her. She obviously doesn’t want me to bother with her. I should just leave and let her think whatever the hell she wants to think.\u003c/p\u003e\n\u003cp\u003eI drop her hands and stand up. “Forget it,” I mutter, turning to walk away. As much as I like being around her, there’s only so much I’m willing to put up with.\u003c/p\u003e\n\u003cp\u003e“Wait,” she says, following after me.\u003c/p\u003e\n\u003cp\u003eI honestly expected her to just let me walk away. Hearing the word “wait” come out of her mouth and knowing she’s following behind me does this thing to my chest that makes it feel alive again and it pisses me off because I don’t want her to have that effect on me. “What did I say?” she asks, catching up to me. “I don’t know you. Why are you getting all pissy with me again?”\u003c/p\u003e\n\u003cp\u003ePissy?\u003c/p\u003e\n\u003cp\u003eHer word-choice makes me want to smile, but the fact that she doesn’t recognize that she’s the one who has been pissy for two days irritates the hell out of me. I stop walking and turn to face her, taking two steps toward her.\u003c/p\u003e\n\u003cp\u003e“I guess after spending time with you over the last few days, I thought I’d get a slightly different reaction from you at school. I’ve given you plenty of opportunity to ask me whatever you want to ask me, but for some reason you want to believe everything you hear, despite the fact that you never heard any of it from me. And coming from someone with her own share of rumors, I figured you’d be a little less judgmental.”\u003c/p\u003e\n\u003cp\u003eHer eyes narrow and she puts her hands on her hips. “So that’s what this is about? You thought the slutty new girl would be sympathetic to the gay-bashing asshole?”\u003c/p\u003e\n\u003cp\u003eI groan out of frustration. I hate hearing her refer to herself like that. “Don’t do that, Sky.”\u003c/p\u003e\n\u003cp\u003eShe takes a step toward me. “Don’t do what? Call you a gay-bashing asshole? Okay. Let’s practice this honesty policy of yours. Did you or did you not beat up that student last year so badly that you spent a year in juvenile detention?”\u003c/p\u003e\n\u003cp\u003eI want to grab her by the shoulders and shake her out of sheer frustration. Why can’t she see that she’s behaving just like everyone else? I know she’s not like them, so I don’t understand her attitude at all. Anyone that can brush off rumors about themselves isn’t the type of person who would spread them. So why the hell is she believing them?\u003c/p\u003e\n\u003cp\u003eI look her hard in the eyes. “When I said don’t do that, I wasn’t referring to you insulting me. I was referring to you insulting yourself.” I close the gap between us and when I do, she takes in a small rush of air and closes her mouth. I lower my voice and confirm the only part of the rumors that are true. “And yes. I beat his ass to within an inch of his life, and if the bastard was standing in front of me right now, I’d do it again.”\u003c/p\u003e\n\u003cp\u003eWe stare at each other in silence. She’s looking at me with a mixture of anger and fear, and I hate that she’s feeling either of those things. She takes a slow step back, putting space between us, but doesn’t break her firm stare.\u003c/p\u003e\n\u003cp\u003e“I don’t want to run with you today,” she says flatly.\u003c/p\u003e\n\u003cp\u003e“I don’t really feel like running with you, either.”\u003c/p\u003e\n\u003cp\u003eI turn around at the same time she does and immediately feel nothing but regret. I didn’t accomplish anything by coming here today. If anything, I just made things worse with her. I shouldn’t have to come out and tell her that the majority of what she thinks she knows about me is false. I shouldn’t have to explain myself to anyone and neither should she.\u003c/p\u003e\n\u003cp\u003eBut I regret that I didn’t explain myself, because I need her to know that I’m not that guy.\u003c/p\u003e\n\u003cp\u003eI just don’t know why I need her to know that.\u003c/p\u003e\n\u003cp\u003eChapter Twelve-and-a-half\u003c/p\u003e\n\u003cp\u003eLes,\u003c/p\u003e\n\u003cp\u003eRemember when we were fourteen and I had a crush on Ava? You hardly knew her but I forced you to become friends with her so she could come to the house and spend the night with you. She was the first girl I ever kissed and we lasted all of two weeks before she started to get on my everlasting nerve. Unfortunately, by the time we broke up, you really did like her. Then I was forced to see her on a recurring basis for an entire year after that until she moved. \u003c/p\u003e","sourceLink":"https://allnovel.net/losing-hope-hopeless-2/page-15.html","bookId":2778,"creation":"Oct 5, 2019 5:21:07 PM","modification":"Oct 5, 2019 5:21:07 PM"}
