{"id":87325,"no":24,"title":"Page 24","content":"\u003cp\u003eI press my lips to her shoulder and push up on my arm. I trail my fingers down her hairline and wipe away the loose strands from her face. She looks absolutely content and it’s the most beautiful, satisfying thing I’ve ever felt.\u003c/p\u003e\n\u003cp\u003e“You’re incredible,” I say, knowing that word is a severe understatement for what she actually is. She smiles at me and inhales a deep breath at the same time I do. I collapse beside her on the bed, needing to get off her immediately. My chest is completely alive right now and the only thing that I know could satisfy me is to be pressed against her again with my mouth on hers. I force the image of it out of my mind and attempt to cool myself off by matching my breathing pattern with hers.\u003c/p\u003e\n\u003cp\u003eAfter silently finding a stable enough point to touch her again, I move my hand closer to hers on the bed and wrap my pinky around hers. The sensation of her pinky in mine feels way too familiar. Way too right. Way too long overdue. I squeeze my eyes shut and attempt to deny my conscience the satisfaction of being right.\u003c/p\u003e\n\u003cp\u003eShe’s Sky. That’s who she is. I only doubt this because of how she feels so familiar. Familiarity is hardly enough to convince me otherwise.\u003c/p\u003e\n\u003cp\u003eI hope my instincts are wrong, because if I’m right, the truth will destroy her.\u003c/p\u003e\n\u003cp\u003ePlease, just let her be Sky.\u003c/p\u003e\n\u003cp\u003eMy fear of being right keeps pushing through and I sit up on the bed, needing to separate myself from her. I need to clear my head of all this craziness. “I have to go,” I say, looking down at her. “I can’t be on this bed with you for another second.”\u003c/p\u003e\n\u003cp\u003eI’m being honest. I can’t be on this bed with her for another second, although I’m sure she thinks it’s for other reasons. Not for the reason I really need to separate myself from her—the fact that I’m terrified my intuition is finally right for once.\u003c/p\u003e\n\u003cp\u003eI stand and pull my shirt over my head and notice that she’s looking at me like I’m rejecting her. I know she probably thought I’d end up kissing her tonight, but she’s got a lot to learn when it comes to doubting my word.\u003c/p\u003e\n\u003cp\u003eI lean in close to her and smile reassuringly. “When I said you weren’t getting kissed tonight, I meant it. But dammit, Sky. I had no idea how fucking difficult you would make it.” I slip my hand behind her neck and lean in to kiss her cheek. When she gasps, it takes everything I have to release my hold and climb off the bed. I watch her as I walk toward the window and pull my phone from my pocket. I send her a quick text, then wink at her, right before I climb outside. I pull the window shut and back a few steps away. As soon as the window is shut, she jumps off her bed and runs out of her bedroom, more than likely to go grab her phone and check her text. Normally, her excitement would more than likely make me laugh. Instead I find myself staring blankly through her bedroom window. My heart feels heavy and my mind even heavier as the pieces of the puzzle slowly begin to fit together, right down to her name.\u003c/p\u003e\n\u003cp\u003e“The sky is always beautiful . . .”\u003c/p\u003e\n\u003cp\u003eThe memory causes me to flinch. I brace my hand against the brick wall and inhale a deep breath. It’s almost laughable, really—the fact that I can sit here and entertain the possibility that this could actually happen after thirteen years. If it were true . . . if she really were her . . . it would ruin her. Which is exactly why I refuse to accept it without tangible proof—something I can actually touch that would confirm it. Without tangible proof, she’ll remain Sky to me.\u003c/p\u003e\n\u003cp\u003eI just want her to be Sky.\u003c/p\u003e\n\u003cp\u003eChapter Fifteen\u003c/p\u003e\n\u003cp\u003eLes,\u003c/p\u003e\n\u003cp\u003eRemember when we were kids and I made everyone stop calling me Dean? I never have told anyone the truth about why I go by Holder, not even you.\u003c/p\u003e\n\u003cp\u003eWe were eight years old and it was the first and only time we ever went to Disneyland. We were waiting in line for one of the roller-coasters and you and Dad were in front of me because you couldn’t ride it by yourself. I was a few inches taller than you and it pissed you off that I was able to ride most of the rides alone and you weren’t.\u003c/p\u003e\n\u003cp\u003eWhen we made it to the front of the line, they put you and Dad on first and I had to wait for the next car to pull in. I was standing there alone, patiently waiting. I turned around to find Mom and she was about a hundred yards away at the exit to the ride, waiting for all of us to finish. I waved at her and she waved back at me. I turned back around when the next car pulled up.\u003c/p\u003e\n\u003cp\u003eThat’s when I heard her.\u003c/p\u003e\n\u003cp\u003eI heard Hope yelling my name. I spun around and stood on my tiptoes, facing the sound of her voice.\u003c/p\u003e\n\u003cp\u003e“Dean!” she yelled. She sounded really far away, but I knew it was her because she said it with that accent of hers. She always dragged out the middle of my name and made it longer than one syllable. I always liked how she said my name, so hearing her yell it, I knew it was her. She must have spotted me and now she was trying to call for me to come help her.\u003c/p\u003e\n\u003cp\u003e“Dean,” she yelled again, only this time she sounded farther away. I could hear the panic in her voice. I began to panic myself, because I knew I’d get in trouble if I lost my place in line. Mom and Dad spent the entire week before we left reminding us to stay by one of them at all times.\u003c/p\u003e\n\u003cp\u003eI glanced over at Mom but she wasn’t looking at me, she was watching you and Dad on the ride. I didn’t know what to do, because she wouldn’t know where I was if I left the line. But as soon as Hope screamed my name again I didn’t care. I had to find her.\u003c/p\u003e\n\u003cp\u003eI started running toward the back of the line—toward the sound of her voice. I was yelling her name, hoping she would hear me and walk toward the sound of my voice.\u003c/p\u003e\n\u003cp\u003eGod, Les. I was so excited. I was terrified and excited and knew that all our prayers had been answered, but it was up to me to hurry up and find her and I was scared I wouldn’t be able to. She was here and I couldn’t get to her fast enough.\u003c/p\u003e\n\u003cp\u003eI had it all planned out in my head. As soon as I found her, I would hug the hell out of her first, then I was going to grab her hands and pull her back to where Mom was standing. We were going to wait by the exit to the ride so when you walked off, she would be the first thing you would see.\u003c/p\u003e\n\u003cp\u003eI knew how happy you were going to be when you saw her. Neither of us had been truly happy in the two years since she was taken and this was our chance. After all, Disneyland is the happiest place on earth, and for the first time, I was starting to believe it.\u003c/p\u003e\n\u003cp\u003e“Hope!” I yelled, cupping my hands around my mouth. I had been running for several minutes, still trying to listen for the sound of her voice. She would yell my name, then I would yell her name, and this went on for what felt like forever until someone grabbed my arm and yanked it, stopping me in my tracks. Mom threw her arms around me and hugged me, but I was trying to get out of her grasp.\u003c/p\u003e\n\u003cp\u003e“Dean, you can’t run off like that!” she said. She was kneeling down, shaking my shoulders, looking me frantically in the eyes. “I thought I lost you.”\u003c/p\u003e\n\u003cp\u003eI pulled away from her and tried to keep running toward Hope, but Mom wouldn’t let go of my shoulders. “Stop it!” she said, confused why I was trying to get away from her.\u003c/p\u003e\n\u003cp\u003eI looked back at her in a panic and shook my head vigorously, trying to catch my breath and find the words. “It’s . . .” I pointed toward the direction I wanted to run. “It’s Hope, Mom! I found Hope! We have to go to her before I lose her again.”\u003c/p\u003e\n\u003cp\u003eSadness instantly reached her eyes and I knew she didn’t believe me. “Dean,” she whispered, shaking her head sympathetically. “Sweetie.”\u003c/p\u003e\n\u003cp\u003eShe felt sorry for me. She didn’t believe me, because this wasn’t the first time I thought I’d found her. But I knew I was right this time. I knew it.\u003c/p\u003e\n\u003cp\u003e“Dean!” Hope cried again. “Where are you?” She was much closer this time and I could tell by the sound of her voice that she was crying now. Mom’s eyes darted toward the voice and I knew she heard her calling for me, too.\u003c/p\u003e\n\u003cp\u003e“We have to find her, Mom,” I pleaded. “It’s her. That’s Hope.”\u003c/p\u003e\n\u003cp\u003eMom looked me in the eyes and I could see the fear in them. She nodded, then grabbed my hand.\u003c/p\u003e\n\u003cp\u003e“Hope?” she yelled, scanning over the crowd. We were both calling her name now and I remember looking up at Mom at one point, watching her while she helped me search. I loved her more than I ever had in that moment, because she actually believed me.\u003c/p\u003e\n\u003cp\u003eWe heard my name called again and it was so much closer this time. Mom looked down at me and her eyes were wide. We both broke out into a run toward the sound of Hope’s voice. We pushed through the crowd and . . . that’s when I saw her. Her back was to us and she was standing all by herself.\u003c/p\u003e\n\u003cp\u003e“Dean!” she yelled again.\u003c/p\u003e\n\u003cp\u003eMom and I were both frozen. We couldn’t believe it. She was standing right in front of us, looking for me. After two years of not knowing who took her or where she was, we had finally found her. I started to walk forward, but I was suddenly shoved aside by a teenage boy rushing toward her. When he reached her, he grabbed her by the arm and spun her around.\u003c/p\u003e\n\u003cp\u003e“Ashley! Thank God!” he said, pulling her to him.\u003c/p\u003e\n\u003cp\u003e“Dean,” she said to the boy, wrapping her arms around his neck. “I got lost.”\u003c/p\u003e\n\u003cp\u003eHe picked her up. “I know, sis. I’m so sorry. You’re okay now.”\u003c/p\u003e\n\u003cp\u003eShe pulled her tear-streaked face away from his chest and she glanced in our direction.\u003c/p\u003e\n\u003cp\u003eShe wasn’t Hope.\u003c/p\u003e\n\u003cp\u003eShe wasn’t Hope at all.\u003c/p\u003e\n\u003cp\u003eAnd I wasn’t the Dean she was looking for.\u003c/p\u003e\n\u003cp\u003eMom squeezed my hand and knelt down in front of me. “I’m so sorry, Dean,” she said. “I thought it was her, too.”\u003c/p\u003e\n\u003cp\u003eA sob broke free from my chest and I cried. I cried so damn hard, Les. Mom wrapped her arms around me and she started crying, too, because I don’t think she knew that an eight-year-old could have his heart crushed like that.\u003c/p\u003e\n\u003cp\u003eBut I was crushed. My heart broke all over again that day.\u003c/p\u003e\n\u003cp\u003eAnd I never wanted to hear the name Dean again.\u003c/p\u003e\n\u003cp\u003eChapter Sixteen\u003c/p\u003e\n\u003cp\u003eI practically skip down the stairs and into the kitchen. It’s the second Monday of school and just thinking about my attitude when I woke up last week as opposed to this morning makes me laugh. I never in a million years imagined I’d be so consumed with the thought of a girl as I have been. Since the second I left her house Saturday night, I’ve done nothing but eat, breathe, and sleep with her on my mind.\u003c/p\u003e\n\u003cp\u003e“So how are you liking Sky?” my mom asks. She’s seated at the kitchen table eating her breakfast and reading the paper. I’m surprised she remembers her name. I only mentioned her once. I shut the refrigerator door and walk to the bar.\u003c/p\u003e\n\u003cp\u003e“She’s great,” I say. “I like her a lot.”\u003c/p\u003e\n\u003cp\u003eMy mom puts down the paper and cocks her head. “She?” she says with an arched eyebrow. I don’t understand her confusion. I just stare at her until she shakes her head and laughs. “Oh, Jesus,” she says. “You’ve got it bad.”\u003c/p\u003e\n\u003cp\u003eStill confused. “What do you mean? You asked how I liked Sky and I answered you.”\u003c/p\u003e\n\u003cp\u003eShe’s laughing even harder now. “I said school, Holder. I asked how you were liking school.”\u003c/p\u003e\n\u003cp\u003eOh.\u003c/p\u003e\n\u003cp\u003eMaybe I do have it bad.\u003c/p\u003e\n\u003cp\u003e“Shut up.” I laugh, embarrassed.\u003c/p\u003e\n\u003cp\u003eShe stops laughing and picks the newspaper up, holding it out in front of her. I grab my drink and my backpack and head toward the door. “Well?” she asks. “How do you like school?” \u003c/p\u003e","sourceLink":"https://allnovel.net/losing-hope-hopeless-2/page-24.html","bookId":2778,"creation":"Oct 5, 2019 5:21:07 PM","modification":"Oct 5, 2019 5:21:07 PM"}
