{"id":99109,"no":22,"title":"Page 22","content":"\u003cp\u003eShe wasn’t really self-conscious anymore of her body, as her husband would spend a lot of time rubbing her belly and speaking to his unborn child. He seemed as excited as her to be having a baby. Some things unplanned turned out pretty great.\u003c/p\u003e\n\u003cp\u003eShe cracked the connecting door quietly and then stopped where she stood in utter dismay. Lucas wasn’t alone in his office. There was some skinny red headed woman wrapped around him and they were locked in a passionate embrace.\u003c/p\u003e\n\u003cp\u003eHer hair was a mess as if they’d already been making love for hours. Her shirt was hanging open, with her skirt hiked up showing her garter. She was stunning in a way that Amy could never hope to be, she thought in agony.\u003c/p\u003e\n\u003cp\u003eThis was the reason he wasn’t coming home to her much anymore. He was having an affair.\u003c/p\u003e\n\u003cp\u003eShe’d doubted he could love her but there had been growth in their relationship or so she’d thought. No matter what else though, she didn’t figure he was the type of man to cheat.\u003c/p\u003e\n\u003cp\u003eThey made love all the time. She thought he was satisfied, more than satisfied even, as their love making always seemed so frenzied, as if they couldn’t get enough of each other. He was always ready to sink deep inside of her and that was something a man couldn’t fake.\u003c/p\u003e\n\u003cp\u003eShe was horrified to think that maybe he was picturing his mistress as he made love to her.\u003c/p\u003e\n\u003cp\u003eMaybe that was how he was always so ready. She knew that she could never compete with someone like the stunning redhead and Amy’s heart was shattering.\u003c/p\u003e\n\u003cp\u003eShe only stood there for a couple of seconds, but it seemed like an eternity. Her whole world broke apart and she didn’t know how she was still standing.\u003c/p\u003e\n\u003cp\u003eAmy closed the door and ran back to the elevator. She could feel the tears streaming down her face as she quickly escaped to her car and sped home. She had her answer. She would never stay with a man who cheated on her. She couldn’t do it.\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003e“What do you think you’re doing Laura?” Lucas spat to the redhead, who he’d dated months before him and Amy had become involved.\u003c/p\u003e\n\u003cp\u003eShe’d walked into his office moments before, with her famous pouting expression, stating they needed to have a talk. He’d told her there was nothing to talk about but she’d come around his desk and sat in front of him, spreading her legs open, so he had no choice but to notice she was wearing nothing underneath her far too short skirt.\u003c/p\u003e\n\u003cp\u003eHe couldn’t believe at one time he had desired her. She was as fake as Amy was real and he wanted her out of his office immediately.\u003c/p\u003e\n\u003cp\u003e“You need to get out. There’s nothing left between us,” he said between clenched teeth as he backed his chair away from her. “You also know I’m a married man now and no longer on the market,” he finished.\u003c/p\u003e\n\u003cp\u003eShe’d just smiled at him with what she thought was a seductive stare and ripped open her shirt to show her ample breasts spilling out of her bra.\u003c/p\u003e\n\u003cp\u003eHe’d stood up to physically escort her from the room, when she wrapped herself around him and locked her lips to his. He was so shocked; he stood there for a few seconds before his hands came up to her waist and pushed her from him.\u003c/p\u003e\n\u003cp\u003e“Baby, you know you want me,” she said sounding falsely hurt. He was done with her games. He marched over to his desk and pushed a single button. “Security, I need you in my office immediately,” he said into the speaker.\u003c/p\u003e\n\u003cp\u003eWithin a minute, two large men came into the room to see the still half naked woman trying to wrap herself around their boss. “Please escort this woman to the outside of the building and never let her in again,” he said tightly, barely able to control his rage.\u003c/p\u003e\n\u003cp\u003e“Yes, Mr. Anderson, right away,” they replied professionally, while each of them took one of her arms and led her away from him.\u003c/p\u003e\n\u003cp\u003eLucas sat back in his chair and then rested his hands on his head. All he could think was thank God his wife wasn’t there to have witnessed that situation. He was sure she would’ve thought he’d invited the woman.\u003c/p\u003e\n\u003cp\u003eShe had good reason to be insecure in their marriage, as he’d been shutting her out lately. He’d pushed her further away with their intimacy reaching such a high level. He sat there as the realization he was in love with Amy washed over him.\u003c/p\u003e\n\u003cp\u003eSuddenly it didn’t feel like a burden at all.\u003c/p\u003e\n\u003cp\u003eHe loved his wife.\u003c/p\u003e\n\u003cp\u003eShe loved him.\u003c/p\u003e\n\u003cp\u003eThey were going to have a child together.\u003c/p\u003e\n\u003cp\u003eSuddenly all he wanted was to go home and wrap her up in his arms and tell her repeatedly how much she meant to him. He was done pushing her out of his life. He started to get up to head for the door, but remembered he had to finish what he was working on. The contract was due that evening and he was almost finished.\u003c/p\u003e\n\u003cp\u003eOne more hour would make no difference, even though it felt like a lifetime. He quickly got back to work so he could be on his way home. He couldn’t keep the smile from his face. He would stop for some roses on the way. He realized he had yet to purchase any for her.\u003c/p\u003e\n\u003cp\u003eAmy couldn’t keep the tears from falling as she drove from the office to her beautiful home. She sat there in the car, staring at the place with a deep sadness, knowing she would never sleep there again in the arms of her husband. How could he have cheated on her? She’d given him her body freely and her love as well.\u003c/p\u003e\n\u003cp\u003eShe pulled herself together enough to walk inside. She slowly climbed the stairs leading to their bedroom and once again a few tears slipped from her eyes. It wouldn’t take her long to pack up; as she wouldn’t take anything she didn’t consider hers exclusively.\u003c/p\u003e\n\u003cp\u003eShe packed up some clothes and baby items and then took the case back to her room. She looked around with one last glance and then took off her wedding ring. She sat at the vanity and wrote her husband a note.\u003c/p\u003e\n\u003cp\u003eShe set her ring on top of the letter, grabbed her suitcases and walked out the door without allowing herself to look back again.\u003c/p\u003e\n\u003cp\u003eShe had no idea where she was heading or what she was going to do when she got there. She just knew she had to get away. She was so afraid if he came through those doors and wrapped his arms around her she would melt and beg him to love her and to not run to the arms of another woman. She’d already given him her heart; she had nothing left to offer him. She had nothing he wanted.\u003c/p\u003e\n\u003cp\u003eAmy drove onto the freeway and started to drive south. After a few hours she was passing through Salem and it didn’t feel far enough away. She was starting to feel a little bit sore though and pulled over at a rest stop to stretch out. She wanted to call up Tom and talk to him but he was at work and she was too afraid that Lucas would overhear the conversation. She would have to call him later because she really needed a friend right then.\u003c/p\u003e\n\u003cp\u003eShe got on the road again and continued driving further south. Suddenly she was in Springfield, which was next to Eugene. She’d always wanted to go there so she took the next exit and ended up downtown.\u003c/p\u003e\n\u003cp\u003eShe pulled off the freeway into the business district and started to look around for a cheap hotel.\u003c/p\u003e\n\u003cp\u003eShe passed the Hilton and shook her head. That was beyond her price range at the moment.\u003c/p\u003e\n\u003cp\u003eFinally she found a little dive of a place and pulled in.\u003c/p\u003e\n\u003cp\u003eShe walked inside, more tired than she could remember being in a very long while. The man behind the counter was leering at her and frightened her a bit with his missing teeth and foul odor.\u003c/p\u003e\n\u003cp\u003e“I would like a room for the night please,” she asked quietly.\u003c/p\u003e\n\u003cp\u003e“Do you have a credit card,” he hacked out at her.\u003c/p\u003e\n\u003cp\u003e“No, I have cash,” she responded not wanting to use her credit card and not trusting the man to have her information.\u003c/p\u003e\n\u003cp\u003e“Well, we normally require a credit card in case you steal anything...” He leered again.\u003c/p\u003e\n\u003cp\u003e“Oh, then I guess I’ll have to find another place,” she stated calmly, even though she felt as if she was going to fall over at any moment.\u003c/p\u003e\n\u003cp\u003e“I guess we can do it on cash this time,” he said a bit desperately. She wasn’t going to stay in the place if there was not a double lock on the door. She didn’t trust the guy at all.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Amy responded and then filled out the necessary paperwork, received her key, grabbed her car and drove to the parking spot in front of her door.\u003c/p\u003e\n\u003cp\u003eShe wearily got out of the rig, grabbed her suitcase and then opened the door. She gasped a little bit at the smell of cigarettes and stale beer. She sighed and stepped inside. She was too scared to even open a window as the neighborhood she was in didn’t seem the safest. She was not going to be Mrs. Anderson anymore and would have to get used to life like it had been before her marriage.\u003c/p\u003e\n\u003cp\u003eShe didn’t really care about the room; she was just so empty from the betrayal of her husband cheating. She’d been in his arms the night before and then he was in the arms of another just a few short hours later. Thank goodness for her exhaustion because she fell into a restless sleep almost immediately.\u003c/p\u003e\n\u003cp\u003e“Well then where the hell did she go,” Lucas shouted to his cook Rosa. He knew it wasn’t her fault Amy was gone but he had no one else to take his fear and anger out on.\u003c/p\u003e\n\u003cp\u003eHe’d come home, anticipating holding his wife in his arms. The roses were clutched to his chest.\u003c/p\u003e\n\u003cp\u003eHe’d opened the door and called out to her. When there was no answer, he hadn’t felt panic yet, just headed up the stairs, where he figured she was taking a nap.\u003c/p\u003e\n\u003cp\u003eShe’d been far more tired lately and he’d been worried about her health as well as that of his son’s. He smiled as he thought about the fact that he called the baby a boy and she called her a girl. Neither of them cared the sex of the baby, as long as he or she was healthy and safe.\u003c/p\u003e\n\u003cp\u003eHe quietly stepped into their bedroom and looked around. He frowned slightly when she wasn’t there but then figured she was in the bathroom. He walked over to the door and she wasn’t in there either.\u003c/p\u003e\n\u003cp\u003eHe was turning to walk back out and ask Rosa where she was, when he happened to glance over and saw her ring sitting on the table above a piece of paper. Instantly he was furious. She’d left him. He felt it. She’d told him she loved him and still walked out. He would drag her back no matter where she’d gone and then take his child from her and then he’d be the one leaving.\u003c/p\u003e\n\u003cp\u003eShe wasn’t going to make him into a fool and leave him standing there alone and vulnerable.\u003c/p\u003e\n\u003cp\u003eShe’d lied to him. She told him she loved him and then she walked out on him. He was sure she had taken all she could get her greedy little hands on in the process. The whole time she’d just played him.\u003c/p\u003e\n\u003cp\u003eHe slowly walked over to the paper and looked down at it, not wanting to know what she’d written but unable to stop himself.\u003c/p\u003e\n\u003cp\u003eLucas,\u003c/p\u003e\n\u003cp\u003eI’m so sorry you weren’t able to love me. I can’t help how much I have fallen in love with you, even though that was never the arrangement between us. I can no longer live here with you, while you are leaving me to be in the arms of another woman. I know you love our child and I will not try to keep her from you but I have to get away for the sake of my own health right now. I will contact you after the baby is born and we can arrange something at that time. I will return the car to you just as soon as I can get things worked out. I’m not trying to take it from you; I just had no other way to leave.\u003c/p\u003e\n\u003cp\u003eAmy\u003c/p\u003e\n\u003cp\u003eHe read the note about ten times, not understanding what was going on. He wasn’t cheating on her. Why would she think he was? He went from anger to confusion in the space of a heartbeat. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-billionaire-wins-the-game-billionaire-bachelors-1/page-22.html","bookId":2006,"creation":"Oct 5, 2019 6:40:12 PM","modification":"Oct 5, 2019 6:40:12 PM"}
