{"id":99096,"no":9,"title":"Page 9","content":"\u003cp\u003eSurprisingly, what he saw in her face was only shock, mixed with gratitude.\u003c/p\u003e\n\u003cp\u003eCould she really not care how much money his family was worth? He was going to find out. He knew if they went to bed she would turn, like all women and try and take him to the cleaners.\u003c/p\u003e\n\u003cp\u003eLittle did she know that many women had tried and none had succeeded. He was sobered by the thought that she could just be the one woman who could bring him to his knees.\u003c/p\u003e\n\u003cp\u003e“Come with me Amy. I’ll show you where you’ll be sleeping the next couple of nights,” he said as he took her arm.\u003c/p\u003e\n\u003cp\u003eEvery time that Lucas touched her, fire shot throughout her body and it felt wonderful, which scared her. She didn’t have time for a man in her life. She knew all he wanted was a cheap affair, after which, she would be discarded.\u003c/p\u003e\n\u003cp\u003eThen where would she be? She would have to quit her job, if he didn’t fire her and she would’ve lost everything. She’d gone long enough without caving in to some arrogant man; she would last a bit longer.\u003c/p\u003e\n\u003cp\u003eShe would just need to teach her body to go along with her mind. Her body seemed to have another idea all together though because she could picture him slowly taking her clothes off and running those extraordinary hands all over her. Then his mouth would follow where his hands had led the way. Her body responded as if he’d already caressed her.\u003c/p\u003e\n\u003cp\u003eShe could feel the desire pooling the more she pictured Lucas’s hands on her. Her nipples were beaded in anticipation of his touch. Her stomach felt as if there were fireflies zipping around in it. The feelings of desire were so strong that she wanted nothing more than to reach out to him.\u003c/p\u003e\n\u003cp\u003eStop, she shouted to herself in an internal battle. You will not fantasize about this man. This is your boss, your very generous boss. You need this job. You need these benefits you’ve just learned about. You don’t need a night of passion. It wouldn’t be worth the loss of everything else.\u003c/p\u003e\n\u003cp\u003eThey arrived at the guest house and she was grateful he couldn’t read minds. The house was set several dozen yards away from the main residence. She loved it at first glance. It was a small cottage surrounded by trees and flowers. There was a stone path leading towards the small covered porch.\u003c/p\u003e\n\u003cp\u003eIt was the kind of place she dreamed of owning someday with her own child. She stood there for a moment, visualizing herself sitting in the old rocking chair with a baby in her arms. For a brief time she let the fantasy continue and Lucas was in the picture next to her, with his arm around them both. It was so perfect she actually sighed aloud.\u003c/p\u003e\n\u003cp\u003eLucas looked at her quizzically. “Come in Amy. I’ll show you where everything is. My parents had the kitchen stocked up so you will have plenty of food. There’s fresh linen on the bed and clean towels. It’s a small place so I don’t think you’ll get lost. Please help yourself to anything in the house. It’s for guests, after all,” he continued but Amy was too busy oooing and awing over the quaintness of the place.\u003c/p\u003e\n\u003cp\u003eIt was perfect. There was a vase with fresh flowers sitting on the small kitchen table. The bathroom had been stocked with a variety of soaps and bath items. There was a huge garden tub she couldn’t wait to dive into and it even had a soft reading light next to it. She was already anticipating herself in there.\u003c/p\u003e\n\u003cp\u003e“I’ll get out of your way now so you can relax,” Lucas said before quickly exiting. She wondered if she’d offended him by not telling him how amazing the place was. She pushed Lucas out of her mind as she began filling the tub with water and fragrance. The scent of the bubble bath was delicate and soothing. Her nerves began to calm instantly.\u003c/p\u003e\n\u003cp\u003eLucas stopped on the front porch and took a deep breath. If he hadn’t walked out right then and there he would’ve thrown her on the bed and made love to her until they were both incapable of walking. He wasn’t going to wait too much longer. He needed to get her out of his system. He had to so his sanity could return to normal. If she hadn’t kept glancing at him with her own smoldering passion then he may have been able to maintain a bit more of his own control. Her face was an open book, which he was sure she didn’t like at all.\u003c/p\u003e\n\u003cp\u003eHe walked back up to the big house to speak with his father for a few moments. “Did you get Amy all settled in?” Joseph asked.\u003c/p\u003e\n\u003cp\u003e“Yes dad, she loves the place,” he said, while striving over to the liquor cabinet. He poured himself a triple shot of bourbon and downed the glass in one gulp. He felt his nerves start to calm a bit as the fire burned down his throat and made his eyes start to water. The pain of the drink was well worth it though, if it could calm his frayed nerves.\u003c/p\u003e\n\u003cp\u003eLucas didn’t see the knowing grin on Joseph’s face. The boy has it bad, Joseph thought. Things were working out far better than he’d even hoped. He’d figured it would take a little bit longer than a few weeks before he saw that misery on his son’s face. He had to turn away to hide the smile from his son.\u003c/p\u003e\n\u003cp\u003e“Where did you find Ms. Harper dad?” Lucas asked.\u003c/p\u003e\n\u003cp\u003e“We had a job fair at her college a few months ago and I got her resume then. I did some research on her and knew that she was perfect for the job. You know it takes someone real special to work for the president of our company,” he answered.\u003c/p\u003e\n\u003cp\u003e“Yes, she’s working out much better than I thought she would. She’s a little mouthy, but I’m sure she’ll settle down the longer she’s there.”\u003c/p\u003e\n\u003cp\u003eThe two of them chatted for an hour about the company and things going on in their lives.\u003c/p\u003e\n\u003cp\u003e“Oh son, Amy forgot to take those papers. Will you run them down to her before you head out for the night?” Joseph asked casually. He’d been hoping his son would have stayed there longer with her in the first place. He may as well get them back alone.\u003c/p\u003e\n\u003cp\u003e“Sure dad. I’ll do it now. I’m getting pretty tired anyway. Tell mom I love her and will see her tomorrow.” He gave his dad a quick hug before heading back towards the cottage.\u003c/p\u003e\n\u003cp\u003eLucas knocked on the door and there was no answer so he checked the doorknob. It was still unlocked. He was going to have to speak to her about that. He stepped in and was about to call out her name when she turned the corner.\u003c/p\u003e\n\u003cp\u003eLucas couldn’t take his eyes off of her. She was standing there with nothing on but a small towel barely covering her body. He could see all the way to the top of her milky white thighs. The top was so low that he could see the swells of her breasts. She was still glistening and wet from her bath.\u003c/p\u003e\n\u003cp\u003eHer smell was drifting over to him. She smelled like some exotic goddess. He could detect some sort of spice, such as cinnamon. It was enough to make him want to take a few bites out of her.\u003c/p\u003e\n\u003cp\u003eOne more inch in either direction and he would be able to see all of her secrets. Lucas didn’t know when he started moving, but suddenly he was in front of her, wrapping his arms around her waist.\u003c/p\u003e\n\u003cp\u003eHe pulled her damp, nearly naked body against his own and suddenly he was devouring her lips.\u003c/p\u003e\n\u003cp\u003eHe felt her stiffen for a moment before she was grabbing him back just as hungrily. He’d never wanted a woman so badly.\u003c/p\u003e\n\u003cp\u003eFor half a second he tried to regain control over his body but when he heard a soft moan escape her lips his control completely snapped. If she would’ve pushed him away, or told him no, he would’ve somehow been able to release her but she was just as hungry for him as he was for her.\u003c/p\u003e\n\u003cp\u003eWith one swift move the towel was gone, letting his hands freely run up and down her body. He caressed her curves from top to bottom. Without breaking away from their kiss he suddenly picked her up and walked into the bedroom. He laid her on the bed, stripping out of his own clothing in record time.\u003c/p\u003e\n\u003cp\u003eHis gaze was drawn down to the perfection of her body, causing his arousal to grow even more, although he didn’t know how that was possible.\u003c/p\u003e\n\u003cp\u003eAmy’s eyes rounded in excitement and awe as she stared at the perfection that was standing in front of her. Not a single flaw was present on him. His body looked like it belonged to a professional athlete instead of a businessman who sat in his office all day. Her gaze traveled down his form and she couldn’t help the gasp that escaped her moistened lips. He was such a large man that a moment of fear consumed her as she wondered how they could possibly fit together.\u003c/p\u003e\n\u003cp\u003eLucas noticed the look in her eyes, feeling fear, because if she changed her mind he would implode. Although taking his clothes off took no longer than a minute, he was already aching to touch her again. He knew after he took her the hunger would diminish. He’d never wanted a woman as much as he wanted her right then. He needed to finish it so that he could purge her from his system and have his life return to normal.\u003c/p\u003e\n\u003cp\u003eHe joined her on the bed, his body covering hers. Together they shared a kiss, before he broke away to move his lips downward. He licked and sucked a path down her neck before slightly nipping at the sensitive skin, causing another moan to escape her lips. They both lost all thoughts and just enjoyed the intense pleasure. She started wiggling under him as her legs spread, inviting him to thrust inside. She was pleading for completion. She needed him to relieve the aching that had overcome her.\u003c/p\u003e\n\u003cp\u003eHe refused to make her his though until he knew she was ready for him. Even though he wasn’t going to last much longer, especially with her moving around beneath him, he would regret it if things ended too quickly. He needed her to feel the same pleasure and satisfaction he was feeling.\u003c/p\u003e\n\u003cp\u003eWhen his hands slid over her aching breasts, with his thumbs tweaking her nipples, her back arched off the bed pressing her body closer to his. She wrapped her hands around his head pulling him back to her, needing his lips on hers. His tongue made love to her mouth and she couldn’t hold out much longer. The pleasure was so intense, it was painful. The more his tongue stroked the contours of her mouth, the more she squirmed. The moans coming out from deep within her throat were snapping the last bit of control he had left.\u003c/p\u003e\n\u003cp\u003eHe ended the kiss to explore the rest of her body, causing her to cry out in frustration. Her intense reactions had him ready to spontaneously combust. He could feel the blood rushing all to one area, his own body begging him to end the torture he was bestowing on them both. He was going to sink deep inside of her and make her his. His and only his!\u003c/p\u003e\n\u003cp\u003eHe tasted the soft silk of her stomach, feeling the quivering beneath his mouth. She was so responsive to his every touch that she was continually sending fire through his own system. As he moved his head lower and ran his tongue along her inner thigh, he felt the tremble that went through her entire body. He’d never been with such a responsive woman before and he was finding it harder than ever to maintain any semblance of control.\u003c/p\u003e\n\u003cp\u003eHis mouth finally tasted her, causing her hips to arch off the bed as she cried out in pleasure. Her moans of pleasure gave him the strength to keep going. He tasted her sweetness, feeling her tremble beneath him. She suddenly tensed up and then her entire body jerked and she cried out as release washed through her. She was shaking beneath him. He flicked his tongue against her moist heat one last time and then slowly made his way back up her body.\u003c/p\u003e\n\u003cp\u003eShe was slightly limp in his arms as he began kissing his way up her stomach. He couldn’t seem to get enough of the taste or scent of her. He felt like he could worship her body for an endless amount of time. He made his way back up to her swollen breasts and gently took one of her tight nipples back into his mouth. She once again started to shake, as her body stirred back to life. He took his time moving from one sensitive peak to the other until he had her crying out for him again. He moved up her neck, sucking on the sensitive skin, feeling her pulse jump beneath his mouth. Then he moved back so that he was lying over her waiting body. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-billionaire-wins-the-game-billionaire-bachelors-1/page-9.html","bookId":2006,"creation":"Oct 5, 2019 6:40:12 PM","modification":"Oct 5, 2019 6:40:12 PM"}
