{"id":23109,"no":1,"title":"CHAPTER I. TWO YOUNG ENEMIES.","content":"\"O LIVER, bring me that ball!\" said Roland Kenyon, in a tone of command.\n\u003cbr\u003e \n\u003cbr\u003e The speaker, a boy of sixteen, stood on the lawn before a handsome country mansion. He had a bat in his hand, and had sent the ball far down the street. He was fashionably dressed, and evidently felt himself a personage of no small consequence.\n\u003cbr\u003e \n\u003cbr\u003e The boy he addressed, Oliver Conrad, was his junior by a year—not so tall, but broader and more thick-set, with a frank, manly face, and an air of independence and self-reliance. He was returning home from school, and carried two books in his hand.\n\u003cbr\u003e \n\u003cbr\u003e Oliver was naturally obliging, but there was something he did not like in the other\u0027s imperious tone, and his pride was touched.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you speaking to me?\" he demanded quietly.\n\u003cbr\u003e \n\u003cbr\u003e \"Of course I am. Is there any other Oliver about?\"\n\u003cbr\u003e \n\u003cbr\u003e \"When you ask a favor, you had better be polite about it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Bother politeness! Go after that ball! Do you hear?\" exclaimed Roland angrily.\n\u003cbr\u003e \n\u003cbr\u003e Oliver eyed him calmly.\n\u003cbr\u003e \n\u003cbr\u003e \"Go for it yourself,\" he retorted. \"I don\u0027t intend to run on your errands.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You don\u0027t?\" exclaimed Roland furiously.\n\u003cbr\u003e \n\u003cbr\u003e \"Didn\u0027t I speak plainly enough? I meant what I said.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Go after that ball this instant!\" shrieked Roland, stamping his foot; \"or I\u0027ll make you!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Suppose you make me do it,\" said Oliver contemptuously, opening the gate, and entering the yard.\n\u003cbr\u003e \n\u003cbr\u003e Roland had worked himself into a passion, and this made him reckless of consequences. He threw the bat in his hand at Oliver, and if the latter had not dodged quickly it would have seriously injured him. At the same time Roland rushed impetuously upon the boy who had offended him by his independence.\n\u003cbr\u003e \n\u003cbr\u003e To say that Oliver kept calm under this aggravated attack would be incorrect. His eyes flashed with anger. He threw his books upon the lawn, and put himself in an instant on guard. A moment, and the two boys were engaged in a close struggle.\n\u003cbr\u003e \n\u003cbr\u003e Roland was taller, and this gave him an advantage; but Oliver was the more sturdy and agile. He clasped Roland around the waist, lifted him off his feet, and laid him, after a brief resistance, on the lawn.\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027d better not attack me again!\" he said, looking with flushed face at his fallen foe.\n\u003cbr\u003e \n\u003cbr\u003e Roland was furious. He sprang to his feet and flung himself upon Oliver, but with so little discretion that the latter, by a well-planted blow, immediately felled him to the ground, and, warned by the second attack, planted his knee on Roland\u0027s breast, thus preventing him from rising.\n\u003cbr\u003e \n\u003cbr\u003e \"Let me up!\" shrieked Roland furiously, struggling desperately but ineffectually.\n\u003cbr\u003e \n\u003cbr\u003e \"Will you let me alone, then?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, I won\u0027t!\" returned Roland, who in his anger lost sight of prudence.\n\u003cbr\u003e \n\u003cbr\u003e \"Then you may lie there till you promise,\" said Oliver composedly.\n\u003cbr\u003e \n\u003cbr\u003e \"Get up, you bully!\" screamed Roland.\n\u003cbr\u003e \n\u003cbr\u003e \"You are the bully. You attacked me, or I should never have touched you,\" said Oliver.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll tell my father,\" said Roland.\n\u003cbr\u003e \n\u003cbr\u003e \"Tell, if you want to,\" said Oliver, his lip curling.\n\u003cbr\u003e \n\u003cbr\u003e \"He\u0027ll have you well beaten.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t think he will.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So you defy him, then?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No; I defy nobody. But I mean to defend myself from violence.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s the matter with you two boys? Oliver, what are you doing?\"\n\u003cbr\u003e \n\u003cbr\u003e The speaker was Mr. Kenyon\u0027s gardener, John Bradford, a sensible man and usually intelligent. Oliver often talked with him, and treated him respectfully, as he deserved. Roland was foolish enough to look down upon him because he was a poor man and occupied a subordinate position.\n\u003cbr\u003e \n\u003cbr\u003e Oliver rose from the ground and let up his adversary.\n\u003cbr\u003e \n\u003cbr\u003e \"We have had a little difficulty, Mr. Bradford,\" he said. \"Roland may tell you if he likes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What is the trouble, Roland?\" enquired the gardener.\n\u003cbr\u003e \n\u003cbr\u003e \"None of your business!\" answered Roland insolently.\n\u003cbr\u003e \n\u003cbr\u003e \"You are very polite,\" said the gardener.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t feel called upon to be polite to my father\u0027s hired man,\" remarked Roland unpleasantly.\n\u003cbr\u003e \n\u003cbr\u003e \"If he won\u0027t answer your question, I will,\" said Oliver. \"Roland commanded me to run and get his ball, and I didn\u0027t choose to do it. He attacked me, and I defended myself. That is all there is about it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, it isn\u0027t all there is about it,\" said Roland passionately. \"You have insulted me, and you are going to be flogged. You may just make up your mind to that.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How have I insulted you?\"\n\u003cbr\u003e \n\u003cbr\u003e \"You threw me down.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Suppose I hadn\u0027t. What would have happened to me?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I would have whipped you if you hadn\u0027t taken me by surprise.\"\n\u003cbr\u003e \n\u003cbr\u003e Oliver shrugged his shoulders.\n\u003cbr\u003e \n\u003cbr\u003e Apparently Roland didn\u0027t propose to renew the fight. Oliver watched him warily, suspecting a sudden attack, but it was not made. Roland turned toward the house, merely discharging this last shaft at his young conqueror:\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027ll get it when my father gets home.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Your ball is in the road,\" said the gardener. \"It will be lost.\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, it won\u0027t. Oliver will have to bring it in yet.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am afraid he means mischief, Oliver,\" said the gardener, turning to our hero as Roland slammed the front door upon entering.\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose he does,\" said Oliver quietly. \"It isn\u0027t the first attempt he has made to order me around.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He is a very disagreeable boy,\" said Bradford.\n\u003cbr\u003e \n\u003cbr\u003e \"He is the most disagreeable boy I know,\" said Oliver. \"I can get along with any of the other boys, except Jim Cameron, his chosen friend. He\u0027s pretty much the same sort of fellow as Roland—only, not being rich, he can\u0027t put on so many airs.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You talk of Roland being rich,\" said the gardener. \"He has no right to be called so.\"\n\u003cbr\u003e \n\u003cbr\u003e \"His father has property, I suppose?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Mr. Kenyon was poor enough when he married your mother. All the property he owns came from her.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is that true, Mr. Bradford?\" asked Oliver thoughtfully.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; didn\u0027t you know it?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have sometimes thought so.\"\n\u003cbr\u003e \n\u003cbr\u003e \"There is no doubt about it. It excited a good deal of talk—your mother\u0027s will.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did she leave all her property to Mr. Kenyon, John?\"\n\u003cbr\u003e \n\u003cbr\u003e \"So he says, and he shows a will that has been admitted to probate.\"\n\u003cbr\u003e \n\u003cbr\u003e Oliver was silent for a moment. Then he spoke:\n\u003cbr\u003e \n\u003cbr\u003e \"If my mother chose to leave all to him, I have not a word to say. She had a right to do as she pleased.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But it seems singular. She loved you as much as any mother loves her son; yet she disinherited you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will not complain of anything she did, Mr. Bradford,\" said Oliver soberly.\n\u003cbr\u003e \n\u003cbr\u003e \"Suppose she didn\u0027t do it, Master Oliver?\"\n\u003cbr\u003e \n\u003cbr\u003e \"What do you mean, Mr. Bradford?\" asked the boy, fixing his eyes upon the gardener\u0027s face.\n\u003cbr\u003e \n\u003cbr\u003e \"I mean that there are some in the village who think there has been foul play—that the will is not genuine.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you think so, Mr. Bradford?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Knowing your mother, and her love for you, I believe there\u0027s been some fraud practised, and that Mr. Kenyon is at the bottom of it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I wish I knew,\" said Oliver. \"It isn\u0027t the money I care about so much, but I don\u0027t like to think that my mother preferred Mr. Kenyon to me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Wait patiently, Oliver; it\u0027ll all come out some day.\"\n\u003cbr\u003e \n\u003cbr\u003e Just then Roland appeared at the front door and called out, in a tone of triumphant malice:\n\u003cbr\u003e \n\u003cbr\u003e \"Come right in, Oliver; my father wants to see you.\"\n\u003cbr\u003e \n\u003cbr\u003e Oliver and the gardener exchanged glances. Then the boy answered:\n\u003cbr\u003e \n\u003cbr\u003e \"You may tell your father I am coming,\" and walked quietly toward the front door.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ve told him all about it,\" said Roland.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you sure you have told your father all?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I have.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That\u0027s all I want. If you have told him all, he must see that I am not to blame.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027ll find out. He\u0027s mad enough.\"\n\u003cbr\u003e \n\u003cbr\u003e Oliver knew enough of his step-father to accept this as probable.\n\u003cbr\u003e \n\u003cbr\u003e \"Now, for it,\" he thought, and followed Roland into his father\u0027s presence.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2088/59208.html","bookId":527,"creation":"Aug 2, 2019 3:23:36 PM","modification":"Aug 2, 2019 3:23:36 PM"}
