{"id":23119,"no":11,"title":"CHAPTER XI. HOW THE LETTER WAS MAILED.","content":"S EVERAL months passed, and Mrs. Kenyon remained in confinement. She was not badly treated, except in being vigilantly guarded, and prevented from making her escape. Dr. Fox always treated her with suavity, but she felt that though covered with velvet his hand was of iron, and that there was little to hope for from him. He never made any objection to her writing letters, but always insisted on their being handed to him.\n\u003cbr\u003e \n\u003cbr\u003e It was not long before she began seriously to doubt whether the letters thus committed to him were really mailed, since no answers came. One day she asked him abruptly:\n\u003cbr\u003e \n\u003cbr\u003e \"Why is it, Dr. Fox, that I get no answers to my letters?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I suppose,\" he answered, \"that your friends are afraid you may be excited, and your recovery retarded, by hearing from them.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Has my—has Mr. Kenyon reported that I am insane?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Undoubtedly.\"\n\u003cbr\u003e \n\u003cbr\u003e \"False and treacherous!\" she exclaimed bitterly. \"Why was I ever mad enough to marry him?\"\n\u003cbr\u003e \n\u003cbr\u003e Dr. Fox shrugged his shoulders.\n\u003cbr\u003e \n\u003cbr\u003e \"Really,\" he said, \"I couldn\u0027t pretend to explain your motives, my dear madam. Women are enigmas.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are my letters regularly mailed, Dr. Fox?\" asked Mrs. Kenyon searchingly.\n\u003cbr\u003e \n\u003cbr\u003e \"How can you ask such a question? Do you not commit them to me?\"\n\u003cbr\u003e \n\u003cbr\u003e \"So does Cleopatra,\" said Mrs. Kenyon, who had fallen into the habit of addressing her room-mate by the name she assumed. \"Do you forward her letters to Mark Antony?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Does she doubt it?\" asked the doctor, bowing to the mad queen.\n\u003cbr\u003e \n\u003cbr\u003e \"No, doctor,\" replied Cleopatra promptly. \"I have the utmost faith in your loyalty, and it shall be rewarded. I have long intended to make you Lord High Baron of the Nile. Let this be the emblem.\"\n\u003cbr\u003e \n\u003cbr\u003e In a dignified manner Cleopatra advanced toward Dr. Fox, and passed a bit of faded ribbon through his button-hole.\n\u003cbr\u003e \n\u003cbr\u003e \"Thanks, your Majesty,\" said the doctor. \"Your confidence is not misplaced. I will keep this among my chief treasures.\"\n\u003cbr\u003e \n\u003cbr\u003e Cleopatra looked pleased, and Mrs. Kenyon impatient and disgusted.\n\u003cbr\u003e \n\u003cbr\u003e \"He deceives me as he does her, without doubt. It is useless to question him further.\"\n\u003cbr\u003e \n\u003cbr\u003e From this time she sedulously watched for an opportunity to write a letter and commit it to other hands than the doctor\u0027s. But, that he might not suspect her design, she also wrote regularly, and placed the letters in his hands.\n\u003cbr\u003e \n\u003cbr\u003e One day the opportunity came. A young man, related to Cleopatra, visited the institution. He understood very well the character of his aunt\u0027s aberration, but was surprised to be told that the quiet lady who bore her company was also crazy.\n\u003cbr\u003e \n\u003cbr\u003e \"What is the nature of her malady?\" he enquired of the doctor. \"Is she ever violent?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, no.\"\n\u003cbr\u003e \n\u003cbr\u003e \"She seems rational enough.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So she is on all points except one.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What is that?\"\n\u003cbr\u003e \n\u003cbr\u003e \"She thinks her husband has confined her here in order to enjoy her property. In point of fact she has no property and no husband.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is curious. Why, then, does she require to be confined?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Probably she will soon be released. She has improved very much since she came here.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am glad my aunt has so quiet a companion.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, they harmonize very well. They have never disagreed.\"\n\u003cbr\u003e \n\u003cbr\u003e During one of Mr. Arthur Holman\u0027s visits Mrs. Kenyon managed to slip into his hands a sealed letter.\n\u003cbr\u003e \n\u003cbr\u003e \"Will you have the kindness,\" she asked quickly, \"to put this into the post-office without informing the doctor?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will,\" he answered readily.\n\u003cbr\u003e \n\u003cbr\u003e \"Poor woman!\" he thought to himself. \"It will gratify her, and her letter will do no harm.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I shall have to be indebted to your kindness for a postage-stamp,\" she said. \"I cannot obtain them here.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, don\u0027t mention it,\" he said.\n\u003cbr\u003e \n\u003cbr\u003e \"You will be sure not to mention this to the doctor?\" said Mrs. Kenyon earnestly.\n\u003cbr\u003e \n\u003cbr\u003e \"On my honor as a gentleman.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I believe you,\" she said quietly.\n\u003cbr\u003e \n\u003cbr\u003e This was the letter, directed to Oliver, which found its way into the hands of Mr. Kenyon, and occasioned him so much uneasiness.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2088/59218.html","bookId":527,"creation":"Aug 2, 2019 3:23:36 PM","modification":"Aug 2, 2019 3:23:36 PM"}
