{"id":23133,"no":25,"title":"CHAPTER XXV. MAKING ARRANGEMENTS.","content":"N ICHOLAS BUNDY went downtown the next morning. Contrary to his usual custom, he did not invite Oliver to accompany him.\n\u003cbr\u003e \n\u003cbr\u003e \"Perhaps you have some places to visit,\" he said. \"If so, take the day to yourself. I shall not need you.\"\n\u003cbr\u003e \n\u003cbr\u003e He proceeded to the office of a well-known broker in the vicinity of Wall Street, and, entering, looked around him. His rusty appearance did not promise a profitable customer, and he had to wait some time before any attention was paid him. Finally a young clerk came to him and enquired carelessly:\n\u003cbr\u003e \n\u003cbr\u003e \"Can we do anything for you this morning?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Are you one of the proprietors?\" asked Nicholas.\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" answered the young man, smiling.\n\u003cbr\u003e \n\u003cbr\u003e \"I should like to see your employer, then.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I can attend to any little commission you may have,\" said the young man pertly.\n\u003cbr\u003e \n\u003cbr\u003e \"Who told you my commission was a little one, young man?\"\n\u003cbr\u003e \n\u003cbr\u003e \"It seems large to him, I suppose,\" thought the clerk, again smiling. \"If it\u0027s only a few hundred dollars――\" he commenced.\n\u003cbr\u003e \n\u003cbr\u003e \"I want to consult your employer about the investment of fifty thousand dollars in gold,\" said Nicholas deliberately.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, I beg your pardon, sir,\" said the young man, his manner entirely altered. \"I will speak to Mr. Hamlin at once.\"\n\u003cbr\u003e \n\u003cbr\u003e Though the broker was engaged with another person he waited upon Nicholas without delay, inviting him to take a seat in his private office.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you desirous of obtaining large interest, Mr. Bundy?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"No, sir; I want something solid, that won\u0027t fly away. I\u0027ve worked for my money and don\u0027t want to lose it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Precisely. Then I can recommend you nothing better than Government bonds. They pay a fair interest and the security is unquestionable.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Government bonds will suit me,\" said the miner. \"You may buy them.\"\n\u003cbr\u003e \n\u003cbr\u003e The purchase was made and Nicholas enquired:\n\u003cbr\u003e \n\u003cbr\u003e \"What shall I do with them? I don\u0027t want to carry them around with me. Is there any place of safety where I can leave them while I am absent on a journey?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir; you want to place them with a safe deposit company. I will give you a note to one that I can recommend.\"\n\u003cbr\u003e \n\u003cbr\u003e This advice seemed good to Mr. Bundy. He presented himself at the office of the company and deposited the bonds, receiving a suitable certificate.\n\u003cbr\u003e \n\u003cbr\u003e \"One thing more,\" he said to himself, \"and my arrangements will be made.\"\n\u003cbr\u003e \n\u003cbr\u003e He visited the office of a lawyer and dictated his will. It was very brief, scarcely ten lines in length. This also he deposited with the safe deposit company.\n\u003cbr\u003e \n\u003cbr\u003e \"Oliver,\" he said, in the evening, \"I\u0027ve got through my business sooner than I expected. Can you start to-morrow?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then we\u0027ll go. We\u0027ll pay our landlady to the end of the month, so that she can\u0027t complain. One thing more, Oliver, I want to tell you. I\u0027ve left the bulk of my property, in bonds, and my will with the Safe Deposit Company, No. ―― Broadway. If anything happens to me you are to go there and call for the will. Whatever there is in it I want you to see carried out.\"\n\u003cbr\u003e \n\u003cbr\u003e \"All right, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e The next day they started for Chicago.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2088/59232.html","bookId":527,"creation":"Aug 2, 2019 3:23:36 PM","modification":"Aug 2, 2019 3:23:36 PM"}
