{"id":23115,"no":7,"title":"CHAPTER VII. ROLAND\u0027S DISCOMFITURE.","content":"O N the way to school Oliver overtook Frank Dudley.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, Oliver, how\u0027s the weather at home?\" asked Frank. \"Cloudy, eh?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No; it\u0027s all clear and serene.\"\n\u003cbr\u003e \n\u003cbr\u003e Frank looked astonished.\n\u003cbr\u003e \n\u003cbr\u003e \"Didn\u0027t Mr. Kenyon blow you up, then?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Not a bit of it. He gave me a five-dollar bill without my asking for it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What\u0027s come over him?\" asked Frank in amazement. \"His mind isn\u0027t getting affected, is it?\"\n\u003cbr\u003e \n\u003cbr\u003e Oliver laughed.\n\u003cbr\u003e \n\u003cbr\u003e \"Not that I know of,\" he said. \"I don\u0027t wonder you ask. I never saw such a change come over a man since yesterday. Then he wanted Roland to flog me. Now he is like an indulgent parent.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s queer, decidedly. I hope, for your sake, it\u0027ll hold out.\"\n\u003cbr\u003e \n\u003cbr\u003e \"So do I. Roland doesn\u0027t seem to fancy it, though. He tried hard to revive the quarrel of yesterday, but without success.\"\n\u003cbr\u003e \n\u003cbr\u003e \"He\u0027s an amiable cub, that Roland.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you speak thus of your future brother-in-law?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Carrie would sooner be an old maid a dozen times over than give any encouragement to such a fellow.\"\n\u003cbr\u003e \n\u003cbr\u003e All of which was pleasant for Oliver to hear.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Kenyon was not through with his surprises.\n\u003cbr\u003e \n\u003cbr\u003e Two weeks before, Roland had a new suit of clothes. Oliver\u0027s envy had been a little excited, because he needed new clothes more than his step-brother, but he was too proud to give expression to his dissatisfaction or to ask for a similar favor. On the way home from school, in company with Frank Dudley, Oliver met Mr. Kenyon.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you just coming home from school, Oliver?\" asked his step-father pleasantly.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I have told Mr. Crimp, the tailor, to measure you for a new suit of clothes. You may as well call in now and be measured.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Thank you, sir,\" said Oliver, in a tone of satisfaction.\n\u003cbr\u003e \n\u003cbr\u003e What boy ever was indifferent to new clothes?\n\u003cbr\u003e \n\u003cbr\u003e \"Have you selected the cloth, sir?\" he asked.\n\u003cbr\u003e \n\u003cbr\u003e \"No; you may make the selection yourself. You need not regard the price. It is best to get a good article.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Kenyon waved his hand, and smiling pleasantly, walked away.\n\u003cbr\u003e \n\u003cbr\u003e \"Look here, Oliver,\" said Frank, \"I begin to think you have misrepresented Mr. Kenyon to me. Such a man as that tyrannical! Why, he looks as if butter wouldn\u0027t melt in his mouth.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know what to make of it myself, Frank. I never saw such a change in a man, If he\u0027ll keep on treating me like this I shall really begin to like him. Will you come to the tailor\u0027s with me?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Willingly. It\u0027ll be the next thing to ordering a suit for myself.\"\n\u003cbr\u003e \n\u003cbr\u003e The tailor\u0027s shop was near by, and the boys entered, with their school-books in their hands.\n\u003cbr\u003e \n\u003cbr\u003e Oliver, with his friend\u0027s approval, selected a piece of expensive cloth, and was measured for a suit. As they left the shop they fell in with Roland, who, cane in hand, was walking leisurely down the main street, cherishing the complacent delusion that he was the object of general admiration.\n\u003cbr\u003e \n\u003cbr\u003e \"Hallo, Frank!\" he said, by way of greeting. To Oliver he did not vouchsafe a word.\n\u003cbr\u003e \n\u003cbr\u003e Frank Dudley nodded.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you out for a walk?\" he added.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Have you been into Crimp\u0027s?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Been ordering new clothes?\" enquired Roland, with interest, for he was rather a dandy, and was as much interested in clothes as a lady.\n\u003cbr\u003e \n\u003cbr\u003e \"I haven\u0027t. Oliver has.\"\n\u003cbr\u003e \n\u003cbr\u003e Roland arched his brows in displeasure.\n\u003cbr\u003e \n\u003cbr\u003e \"Have you ordered a suit of clothes?\" he enquired.\n\u003cbr\u003e \n\u003cbr\u003e \"I have,\" answered Oliver coldly.\n\u003cbr\u003e \n\u003cbr\u003e \"Who authorized you to do it?\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is none of your business,\" said Oliver, justly provoked at the other\u0027s impertinence.\n\u003cbr\u003e \n\u003cbr\u003e \"It is my father\u0027s business,\" said Roland. \"I suppose you expect to pay for them.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The bill won\u0027t be sent to you, at any rate. You may be assured of that. Come on, Frank.\"\n\u003cbr\u003e \n\u003cbr\u003e The two boys walked off, leaving Roland in front of the tailor\u0027s shop.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll go in and see what he\u0027s ordered,\" thought he. \"If it\u0027s without authority I\u0027ll tell my father, and he\u0027ll soon put a spoke in his wheel.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Good-evening, Crimp,\" said he consequentially.\n\u003cbr\u003e \n\u003cbr\u003e Considering the tailor quite beneath him he dispensed with any title.\n\u003cbr\u003e \n\u003cbr\u003e \"Good-evening,\" returned the tailor.\n\u003cbr\u003e \n\u003cbr\u003e \"Oliver has ordered a suit here, hasn\u0027t he?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes; he just ordered it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Will you show me the cloth he selected?\"\n\u003cbr\u003e \n\u003cbr\u003e \"If you wish.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Crimp displayed the cloth. Roland was enough of a judge to see that it was high priced.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s nice cloth. Is it expensive?\"\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s the best I have in stock.\"\n\u003cbr\u003e \n\u003cbr\u003e Roland frowned.\n\u003cbr\u003e \n\u003cbr\u003e \"Is it any better than the suit you made me a short time since?\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is a little dearer.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why didn\u0027t you show me this, then? I wanted the best.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Because it has come in since.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Look here, Crimp,\" said Roland, \"you\u0027d better wait till you hear from my father before you begin on this suit.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Why should I?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t believe he will allow Oliver to have such a high-priced suit.\"\n\u003cbr\u003e \n\u003cbr\u003e Mr. Crimp had had orders from Mr. Kenyon that very afternoon to follow Oliver\u0027s directions implicitly, but he did not choose to say this to Roland. The truth was, he was provoked at the liberty the ill-bred boy took in addressing him without a title, and he didn\u0027t see fit to enlighten him on this point.\n\u003cbr\u003e \n\u003cbr\u003e \"You must excuse me,\" he said. \"Oliver has ordered the suit, and I shall not take such a liberty with him as to question his order.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I rather think my father will have something to say about that,\" said Roland. \"I presume you expect him to pay your bill.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The bill will be paid; I am not afraid of that. Why shouldn\u0027t it be?\"\n\u003cbr\u003e \n\u003cbr\u003e \"You may have to depend on Oliver to pay it himself.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, he has money enough, or ought to have,\" said the tailor significantly. \"His mother left a large property.\"\n\u003cbr\u003e \n\u003cbr\u003e Roland did not like the turn the conversation was taking, and stalked out of the shop.\n\u003cbr\u003e \n\u003cbr\u003e \"Crimp is getting impudent,\" he said to himself. \"If there was another good tailor in the village I would patronize him.\"\n\u003cbr\u003e \n\u003cbr\u003e However, Roland had one other resource, and this consoled him.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll tell my father, and we\u0027ll see if he don\u0027t put a stop to it,\" he thought. \"Oliver will find he can\u0027t do just as he likes. I wish Crimp would make the suit, and then father refuse to pay for it. It would teach him a lesson.\"\n\u003cbr\u003e \n\u003cbr\u003e Roland selected the supper-table for the revelation of what he supposed to be Oliver\u0027s unauthorized conduct.\n\u003cbr\u003e \n\u003cbr\u003e \"I met Oliver coming out of Crimp\u0027s this afternoon,\" he commenced.\n\u003cbr\u003e \n\u003cbr\u003e Oliver did not appear alarmed at this opening. He continued to eat his toast in silence.\n\u003cbr\u003e \n\u003cbr\u003e As no one said anything, Roland continued:\n\u003cbr\u003e \n\u003cbr\u003e \"He had just been ordering a new suit of clothes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did you find any cloth to suit you, Oliver?\" asked Mr. Kenyon.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, sir, I found a very nice piece.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I should think it was nice. It was the dearest in Crimp\u0027s stock!\" said Roland.\n\u003cbr\u003e \n\u003cbr\u003e \"How do you know?\" asked Oliver quickly.\n\u003cbr\u003e \n\u003cbr\u003e \"Crimp told me so.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Then you went in and enquired,\" said Oliver, his lip curling.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, I did.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I am glad you selected a good article, Oliver,\" said Mr. Kenyon quietly. \"It will wear longer.\"\n\u003cbr\u003e \n\u003cbr\u003e Roland stared at his father in open-mouthed amazement. He so fully anticipated getting Oliver into hot water that his father quite disconcerted him.\n\u003cbr\u003e \n\u003cbr\u003e \"His suit is going to be better than mine,\" he grumbled, in a tone of vexation.\n\u003cbr\u003e \n\u003cbr\u003e \"That is your own fault. Why didn\u0027t you select the same cloth?\" asked his father.\n\u003cbr\u003e \n\u003cbr\u003e \"It is some new cloth that has just come in.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You can make it up next time,\" said Mr. Kenyon; \"your suit seems to me to be a very nice one.\"\n\u003cbr\u003e \n\u003cbr\u003e This was all the satisfaction Roland got.\n\u003cbr\u003e \n\u003cbr\u003e The next day he met Mr. Crimp in the street.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, does your father object to Oliver\u0027s order?\" he asked with a smile.\n\u003cbr\u003e \n\u003cbr\u003e Roland was too provoked to notice what he regarded as an impertinent question.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2088/59214.html","bookId":527,"creation":"Aug 2, 2019 3:23:36 PM","modification":"Aug 2, 2019 3:23:36 PM"}
