{"id":23117,"no":9,"title":"CHAPTER IX. OLIVER\u0027S MOTHER.","content":"I T is time to introduce Oliver\u0027s mother, who was suffering such cruel imprisonment within the walls of a mad-house.\n\u003cbr\u003e \n\u003cbr\u003e It was by a subterfuge she had first been induced to enter the asylum of Dr. Fox. Her husband had spoken of it as a boarding-school under the charge of an old friend of his.\n\u003cbr\u003e \n\u003cbr\u003e \"I think, my dear,\" he said, as they dismounted at the gate, \"that you will be interested to look over the institution, and I know it will afford my friend great pleasure to show it to you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I dare say I shall find it interesting,\" she answered, and they entered.\n\u003cbr\u003e \n\u003cbr\u003e Dr. Fox met them at the door. He had received previous notice of their arrival, and a bargain had been struck between Mr. Kenyon and the doctor. A meaning look was exchanged between them which Mrs. Kenyon did not notice.\n\u003cbr\u003e \n\u003cbr\u003e \"I have brought my wife to look over your establishment, doctor,\" said Mr. Kenyon.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t think it is worth looking at,\" said the doctor, \"but I shall be very glad to show it. Will you come upstairs?\"\n\u003cbr\u003e \n\u003cbr\u003e They were moving up the main staircase when a loud scream was heard from above, proceeding from one of the insane inmates.\n\u003cbr\u003e \n\u003cbr\u003e \"What is that?\" asked Mrs. Kenyon, stopping short and turning pale.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Kenyon bit his lip. He feared that his wife would suspect too soon the character of the institution. But Dr. Fox was prepared for the question.\n\u003cbr\u003e \n\u003cbr\u003e \"It is poor Tommy Briggs,\" he said, shrugging his shoulders. \"He is in the sick-ward.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But what is the matter with him?\" asked Mrs. Kenyon, shuddering as another wild shriek was borne to her ears.\n\u003cbr\u003e \n\u003cbr\u003e \"He has fits,\" answered the doctor.\n\u003cbr\u003e \n\u003cbr\u003e \"Ought he to be here, then?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He has them only at intervals, say once a month. To-morrow he will be all right again.\"\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Kenyon accepted this explanation without suspicion.\n\u003cbr\u003e \n\u003cbr\u003e \"How old is he?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e \"Fifteen.\"\n\u003cbr\u003e \n\u003cbr\u003e \"About the age of Oliver,\" she remarked, turning to her husband.\n\u003cbr\u003e \n\u003cbr\u003e \"Or Roland.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What a misfortune it must be to have a boy so afflicted! How I pity his poor mother!\"\n\u003cbr\u003e \n\u003cbr\u003e \"Come up another flight, please,\" said Dr. Fox. \"We will begin our examination there.\"\n\u003cbr\u003e \n\u003cbr\u003e They went up to the next story.\n\u003cbr\u003e \n\u003cbr\u003e Dr. Fox drew a bunch of keys from his pocket, and applying one to the door opened it.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you keep them locked in?\" asked Mrs. Kenyon, surprised.\n\u003cbr\u003e \n\u003cbr\u003e \"This is one of the dormitories,\" answered the doctor, who never lost his self-possession. \"Come in, please.\"\n\u003cbr\u003e \n\u003cbr\u003e It was a large square room. In one corner was a bed, surrounded by curtains. In the opposite corner was another bed—a cot.\n\u003cbr\u003e \n\u003cbr\u003e \"Sit down one moment, Mrs. Kenyon,\" said the doctor. \"I want to call a servant.\"\n\u003cbr\u003e \n\u003cbr\u003e He left the room, and Mr. Kenyon followed him.\n\u003cbr\u003e \n\u003cbr\u003e The two men regarded each other with a complacent smile.\n\u003cbr\u003e \n\u003cbr\u003e \"Well, it\u0027s done,\" said the doctor, rubbing his hands. \"She walked into the trap without any suspicion or fuss.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You\u0027d better lock the door,\" said Mr. Kenyon nervously.\n\u003cbr\u003e \n\u003cbr\u003e The doctor did so.\n\u003cbr\u003e \n\u003cbr\u003e \"Now,\" said he, \"if you will follow me downstairs we will attend to the business part of the matter.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Willingly,\" said Kenyon.\n\u003cbr\u003e \n\u003cbr\u003e The business referred to consisted of the payment of three months\u0027 board in advance.\n\u003cbr\u003e \n\u003cbr\u003e \"Now, Dr. Fox,\" said his new patron, \"you may rely upon punctual payment of your bills. On your part, I depend on your safe custody of my wife as long as her mind remains unsound.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And that will be a long time, I fancy,\" said the doctor, laughing.\n\u003cbr\u003e \n\u003cbr\u003e Mr. Kenyon appreciated the joke, and laughed too.\n\u003cbr\u003e \n\u003cbr\u003e \"I must leave you now,\" he said. \"I hope you won\u0027t have much trouble with her.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, have no anxiety on that score,\" said the doctor nonchalantly. \"I am used to such cases; I know how to manage.\"\n\u003cbr\u003e \n\u003cbr\u003e The two men shook hands, and Mr. Kenyon left the asylum a free man.\n\u003cbr\u003e \n\u003cbr\u003e \"So far, well,\" he said, when he was in the open air. \"At last—at last, I am rich! And I mean to enjoy my wealth!\"\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Kenyon remained in the seat assigned her for two or three minutes. Then she began to wonder why her husband and the doctor did not return.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s strange they leave me here so long,\" she said to herself.\n\u003cbr\u003e \n\u003cbr\u003e Then she rose and went to the door.\n\u003cbr\u003e \n\u003cbr\u003e She tried to open it, but it resisted her efforts.\n\u003cbr\u003e \n\u003cbr\u003e \"What does this mean?\" she asked herself, bewildered.\n\u003cbr\u003e \n\u003cbr\u003e She turned, and was startled by seeing a tall woman, in a long calico robe, in the act of emerging from the curtained bed. The woman had long hair, which, unconfined, descended over her shoulders. Her features wore a strange look, which startled and alarmed Mrs. Kenyon.\n\u003cbr\u003e \n\u003cbr\u003e \"How did you get into my room?\" asked the woman sharply.\n\u003cbr\u003e \n\u003cbr\u003e \"Is this your room?\" asked Mrs. Kenyon, unable to remove her eyes from the strange apparition.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, it is my audience chamber,\" was the reply. \"Why are you here?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I hardly know,\" said Mrs. Kenyon hurriedly. \"I think there must be some mistake. I would go out if I could, but the door is locked.\"\n\u003cbr\u003e \n\u003cbr\u003e \"They always lock it,\" said the other composedly.\n\u003cbr\u003e \n\u003cbr\u003e \"Do you live here?\" asked Mrs. Kenyon nervously.\n\u003cbr\u003e \n\u003cbr\u003e \"Oh, yes, I have lived here for five hundred years, more or less.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What!\" exclaimed Mrs. Kenyon, terror-stricken.\n\u003cbr\u003e \n\u003cbr\u003e \"I said more or less,\" repeated the woman sharply. \"How can I tell within fifty years? Do you know who I am?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You have often heard of me,\" said the other complacently. \"The whole world has heard about me. I am Queen Cleopatra.\"\n\u003cbr\u003e \n\u003cbr\u003e Mrs. Kenyon knew where she was now. She realized it with a heart full of horror. But what could it mean? Could Mr. Kenyon have left her there intentionally? In spite of all she had learned about it she could hardly credit it.\n\u003cbr\u003e \n\u003cbr\u003e \"What place is this, tell me?\" she implored.\n\u003cbr\u003e \n\u003cbr\u003e \"I\u0027ll tell you,\" said the woman, \"but you mustn\u0027t tell,\" she added, with a look of cunning. \"I\u0027ve found it all out. It\u0027s a place where they send crazy people.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Good Heaven!\"\n\u003cbr\u003e \n\u003cbr\u003e \"They are all crazy here—all but me,\" continued Cleopatra, to call her by the name she assumed. \"I am only here for my health,\" she continued. \"That\u0027s what the doctor tells me, though why they should keep me so long I cannot understand. Sometimes I suspect――\"\n\u003cbr\u003e \n\u003cbr\u003e \"In Heaven\u0027s name, what?\"\n\u003cbr\u003e \n\u003cbr\u003e The woman advanced toward Mrs. Kenyon, who shrank from her instinctively, and whispered:\n\u003cbr\u003e \n\u003cbr\u003e \"They want to separate me and Mark Antony,\" she said. \"I am convinced of it, though whether it\u0027s C?sar or my ministers who have done it I can\u0027t tell. What do you think?\" she demanded, fixing her eyes searchingly upon Mrs. Kenyon.\n\u003cbr\u003e \n\u003cbr\u003e \"I don\u0027t know,\" answered Mrs. Kenyon, shrinking away from her.\n\u003cbr\u003e \n\u003cbr\u003e \"You needn\u0027t be afraid of me,\" said Cleopatra, observing the movement. \"I am not crazy, you know. I am perfectly harmless. Are you crazy?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Heaven forbid!\" exclaimed Mrs. Kenyon with a shudder.\n\u003cbr\u003e \n\u003cbr\u003e \"They all say so,\" said Cleopatra shrewdly, \"but they are all crazy except me. Do you hear that?\"\n\u003cbr\u003e \n\u003cbr\u003e There was another wild shriek, proceeding from a room on the same floor.\n\u003cbr\u003e \n\u003cbr\u003e \"Who is it?\" asked Mrs. Kenyon, in alarm.\n\u003cbr\u003e \n\u003cbr\u003e \"It\u0027s crazy Nancy,\" answered Cleopatra. \"She thinks she\u0027s the wife of Henry VIII., and she is always afraid he will have her executed. It\u0027s queer what fancies these people have,\" added Cleopatra, laughing.\n\u003cbr\u003e \n\u003cbr\u003e \"How unconscious she is of her infirmity!\" thought Mrs. Kenyon. \"I hope she\u0027s never violent.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Is there a bell here?\" she asked.\n\u003cbr\u003e \n\u003cbr\u003e \"What for?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I wish to ring for the doctor and my husband.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ho! ho! Do you think they would notice your ringing?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Do you think they mean to leave me here?\" asked Mrs. Kenyon, with a gasp of horror.\n\u003cbr\u003e \n\u003cbr\u003e \"To be sure they do. The doctor told me this morning he was going to give me a nice, agreeable room-mate.\"\n\u003cbr\u003e \n\u003cbr\u003e The full horror of her situation was revealed to the unfortunate woman, and she sank upon the floor in a swoon.\n\u003cbr\u003e \n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/2088/59216.html","bookId":527,"creation":"Aug 2, 2019 3:23:36 PM","modification":"Aug 2, 2019 3:23:36 PM"}
