{"id":2629,"no":1,"title":"Chapter 1","content":"1:1 [hgb]\u0026nbsp; 论 尼 尼 微 的 默 示 ， 就 是 伊 勒 歌 斯 人 那 鸿 所 得 的 默 示 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The burden of Nineveh. The book of the vision of Nahum the Elkoshite. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The word about Nineveh. The book of the vision of Nahum the Elkoshite. \n\u003cbr\u003e1:2 [hgb]\u0026nbsp; 耶 和 华 是 忌 邪 施 报 的 神 。 耶 和 华 施 报 大 有 忿 怒 。 向 他 的 敌 人 施 报 ， 向 他 的 仇 敌 怀 怒 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; God is jealous, and the LORD revengeth; the LORD revengeth, and is furious; the LORD will take vengeance on his adversaries, and he reserveth wrath for his enemies. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is a God who takes care of his honour and gives punishment for wrong; the Lord gives punishment and is angry; the Lord sends punishment on those who are against him, being angry with his haters. \n\u003cbr\u003e1:3 [hgb]\u0026nbsp; 耶 和 华 不 轻 易 发 怒 ， 大 有 能 力 ， 万 不 以 有 罪 的 为 无 罪 。 他 乘 旋 风 和 暴 风 而 来 ， 云 彩 为 他 脚 下 的 尘 土 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD is slow to anger, and great in power, and will not at all acquit the wicked: the LORD hath his way in the whirlwind and in the storm, and the clouds are the dust of his feet. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is slow to get angry and great in power, and will not let the sinner go without punishment: the way of the Lord is in the wind and the storm, and the clouds are the dust of his feet. \n\u003cbr\u003e1:4 [hgb]\u0026nbsp; 他 斥 责 海 ， 使 海 干 了 ， 使 一 切 江 河 干 涸 。 巴 珊 和 迦 密 的 树 林 衰 残 ， 利 巴 嫩 的 花 草 也 衰 残 了 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; He rebuketh the sea, and maketh it dry, and drieth up all the rivers: Bashan languisheth, and Carmel, and the flower of Lebanon languisheth. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; He says sharp words to the sea and makes it dry, drying up all the rivers: Bashan is feeble, and Carmel, and the flower of Lebanon is without strength. \n\u003cbr\u003e1:5 [hgb]\u0026nbsp; 大 山 因 他 震 动 ， 小 山 也 都 消 化 。 大 地 在 他 面 前 突 起 ， 世 界 和 住 在 其 间 的 ， 也 都 如 此 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The mountains quake at him, and the hills melt, and the earth is burned at his presence, yea, the world, and all that dwell therein. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The mountains are shaking because of him, and the hills flowing away; the earth is falling to bits before him, the world and all who are in it. \n\u003cbr\u003e1:6 [hgb]\u0026nbsp; 他 发 忿 恨 ， 谁 能 立 得 住 呢 ？ 他 发 烈 怒 ， 谁 能 当 得 起 呢 ？ 他 的 忿 怒 如 火 倾 倒 ， 磐 石 因 他 崩 裂 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Who can stand before his indignation? and who can abide in the fierceness of his anger? his fury is poured out like fire, and the rocks are thrown down by him. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; Who may keep his place before his wrath? and who may undergo the heat of his passion? his wrath is let loose like fire and the rocks are broken open by him. \n\u003cbr\u003e1:7 [hgb]\u0026nbsp; 耶 和 华 本 为 善 ， 在 患 难 的 日 子 为 人 的 保 障 。 并 且 认 得 那 些 投 靠 他 的 人 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; The LORD is good, a strong hold in the day of trouble; and he knoweth them that trust in him. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord is good, a strong place in the day of trouble; and he has knowledge of those who take him for their safe cover. \n\u003cbr\u003e1:8 [hgb]\u0026nbsp; 但 他 必 以 涨 溢 的 洪 水 淹 没 尼 尼 微 ， 又 驱 逐 仇 敌 进 入 黑 暗 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; But with an overrunning flood he will make an utter end of the place thereof, and darkness shall pursue his enemies. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; But like water overflowing he will take them away; he will put an end to those who come up against him, driving his haters into the dark. \n\u003cbr\u003e1:9 [hgb]\u0026nbsp; 尼 尼 微 人 哪 ， 设 何 谋 攻 击 耶 和 华 呢 ？ 他 必 将 你 们 灭 绝 净 尽 。 灾 难 不 再 兴 起 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; What do ye imagine against the LORD? he will make an utter end: affliction shall not rise up the second time. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; What are you designing against the Lord? he will put an end to it: his haters will not come up again a second time. \n\u003cbr\u003e1:10 [hgb]\u0026nbsp; 你 们 像 丛 杂 的 荆 棘 ， 像 喝 醉 了 的 人 ， 又 如 枯 干 的 碎 秸 全 然 烧 灭 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For while they be folden together as thorns, and while they are drunken as drunkards, they shall be devoured as stubble fully dry. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; For though they are like twisted thorns, and are overcome as with drink, they will come to destruction like stems of grass fully dry. \n\u003cbr\u003e1:11 [hgb]\u0026nbsp; 有 一 人 从 你 那 里 出 来 ， 图 谋 邪 恶 ， 设 恶 计 攻 击 耶 和 华 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; There is one come out of thee, that imagineth evil against the LORD, a wicked counsellor. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; One has gone out from you who is designing evil against the Lord, whose purposes are of no value. \n\u003cbr\u003e1:12 [hgb]\u0026nbsp; 耶 和 华 如 此 说 ， 尼 尼 微 虽 然 势 力 充 足 ， 人 数 繁 多 ， 也 被 剪 除 ， 归 于 无 有 。 犹 大 阿 ， 我 虽 然 使 你 受 苦 ， 却 不 再 使 你 受 苦 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Thus saith the LORD; Though they be quiet, and likewise many, yet thus shall they be cut down, when he shall pass through. Though I have afflicted thee, I will afflict thee no more. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; This is what the Lord has said: The days of my cause against you are ended; they are cut off and past. Though I have sent trouble on you, you will no longer be troubled. \n\u003cbr\u003e1:13 [hgb]\u0026nbsp; 现 在 我 必 从 你 颈 项 上 折 断 他 的 轭 ， 扭 开 他 的 绳 索 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; For now will I break his yoke from off thee, and will burst thy bonds in sunder. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; And now I will let his yoke be broken off you, and your chains be parted. \n\u003cbr\u003e1:14 [hgb]\u0026nbsp; 耶 和 华 已 经 出 令 ， 指 着 尼 尼 微 说 ， 你 名 下 的 人 必 不 留 后 。 我 必 从 你 神 的 庙 中 ， 除 灭 雕 刻 的 偶 像 ， 和 铸 造 的 偶 像 。 我 必 因 你 鄙 陋 ， 使 你 归 于 坟 墓 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; And the LORD hath given a commandment concerning thee, that no more of thy name be sown: out of the house of thy gods will I cut off the graven image and the molten image: I will make thy grave; for thou art vile. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; The Lord has given an order about you, that no more of your name are to be planted: from the house of your gods I will have the pictured and metal images cut off; I will make your last resting-place a place of shame; for you are completely evil. \n\u003cbr\u003e1:15 [hgb]\u0026nbsp; 看 哪 ， 有 报 好 信 传 平 安 之 人 的 脚 登 山 ， 说 ， 犹 大 阿 ， 可 以 守 你 的 节 期 ， 还 你 所 许 的 愿 吧 。 因 为 那 恶 人 不 再 从 你 中 间 经 过 。 他 已 灭 绝 净 尽 了 。\u0026nbsp; \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [kjv]\u0026nbsp; Behold upon the mountains the feet of him that bringeth good tidings, that publisheth peace! O Judah, keep thy solemn feasts, perform thy vows: for the wicked shall no more pass through thee; he is utterly cut off. \n\u003cbr\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; [bbe]\u0026nbsp; See on the mountains the feet of him who comes with good news, giving word of peace! Keep your feasts, O Judah, give effect to your oaths: for the good-for-nothing man will never again go through you; he is completely cut off.  \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/145/2067.html","bookId":110,"creation":"Aug 1, 2019 3:59:47 AM","modification":"Aug 1, 2019 3:59:47 AM"}
