{"id":98064,"no":13,"title":"Page 13","content":"\u003cp\u003e“You?” The second one giggles.\u003c/p\u003e\n\u003cp\u003e“He kept coming back for more, didn’t he? Told me I was the best fuck he’d ever had. Coming from him, I took that as a big compliment. I bet he’d still be good for a go now.”\u003c/p\u003e\n\u003cp\u003e“You think so? From what I hear he’s playing the monogamous card nowadays. Never looks at any other women. He knocked Cherie Walters back the other day and was none too polite about it, from what I heard.”\u003c/p\u003e\n\u003cp\u003e“Yeah, well, Jake never could say no to me. Especially when I was on my knees in his office, sucking him off.”\u003c/p\u003e\n\u003cp\u003eI’m going to throw up.\u003c/p\u003e\n\u003cp\u003e“I knew you were fucking him, but sucking him off in his office? Class!” She laughs.\u003c/p\u003e\n\u003cp\u003e“I turned up to see him one day at his office, wearing only my underwear under my trench, and I sucked his cock while he sat at his desk. Then he fucked me senseless over it.”\u003c/p\u003e\n\u003cp\u003eOh God. I close my eyes and put my head in my hands.\u003c/p\u003e\n\u003cp\u003e“You’re so bad.” The other one giggles.\u003c/p\u003e\n\u003cp\u003e“Maybe I’ll go offer my services to him now if that British twinkie isn’t around.” I hear her slap her lips together and then the click of a purse closing. “I’m sure he’ll be up for a quickie in the back. If not, I might just pay him a visit at the label tomorrow.”\u003c/p\u003e\n\u003cp\u003eHeels click away from me; then I hear the door shut with a bang.\u003c/p\u003e\n\u003cp\u003eMy whole body is shaking. My head prickling. Why didn’t I just burst out there and make my presence known?\u003c/p\u003e\n\u003cp\u003eNow she’s going to go out there and proposition Jake while I’m here like an idiot with my panties around my ankles.\u003c/p\u003e\n\u003cp\u003eHot tears sting my eyes.\u003c/p\u003e\n\u003cp\u003eDon’t cry. Don’t you dare bloody cry, Trudy Bennett, over a couple of nasty bitches.\u003c/p\u003e\n\u003cp\u003eIt’s at times like this I wish Simone were here. I know she would have marched out there and slapped them stupid.\u003c/p\u003e\n\u003cp\u003eNormally I would have said something.\u003c/p\u003e\n\u003cp\u003eBut I know why I didn’t.\u003c/p\u003e\n\u003cp\u003eBecause what could I say? Yes, Jake was a whore of the worst kind, but he’s not like that anymore!\u003c/p\u003e\n\u003cp\u003eThey’d have laughed me out of here.\u003c/p\u003e\n\u003cp\u003eHonestly, part of me fears it’s still in him. That one day soon, I won’t be enough to keep him.\u003c/p\u003e\n\u003cp\u003eForcing back the tears, my face burning with the shame of my cowardice, I finish on the toilet, wash my hands, straighten myself out, and head back into the club.\u003c/p\u003e\n\u003cp\u003eAs I come from the archway, I spot Jake across the room still at the bar. Zane’s nowhere to be seen, and Jake is now talking to a stunning blonde. Legs up to her neck, skirt there to meet them.\u003c/p\u003e\n\u003cp\u003eBile rises in my throat, alongside an intense shot of rage.\u003c/p\u003e\n\u003cp\u003eI’m just about to march over there and give the blonde tramp a move-along speech, when I hear my name called from behind.\u003c/p\u003e\n\u003cp\u003eTurning, I see one of my old journo buddies from the circuit back in the UK, Jefferson Dunn. I’d heard he had come to America to work for a magazine.\u003c/p\u003e\n\u003cp\u003eEven though I’m pissed right now, a smile still crosses my face to see someone from back home.\u003c/p\u003e\n\u003cp\u003e“Jefferson!” I beam.\u003c/p\u003e\n\u003cp\u003e“Trudy Bennett,” he says, smiling. “Look at you. How the hell are you?” He envelops me in a hug. I instantly get a whiff of strong alcohol on him.\u003c/p\u003e\n\u003cp\u003e“I’m good. Great, actually, thanks. How are you?” I say, stepping back from his embrace.\u003c/p\u003e\n\u003cp\u003e“I’m great. All the better for seeing you. I heard you’d moved out here—with Jake Wethers, of all people.”\u003c/p\u003e\n\u003cp\u003e“Yes.” I lift my shoulders lightly, lips remaining in a smile.\u003c/p\u003e\n\u003cp\u003eI really don’t want to talk about Jake right now.\u003c/p\u003e\n\u003cp\u003e“Where is the rock star?” Jefferson asks, looking around. “I’d love to meet him.”\u003c/p\u003e\n\u003cp\u003eNot wanting to point out Jake and the fact that he’s at the bar with a leggy blonde—especially to Jefferson, who’s always on the tout for a story—I say, “Oh, he’s busy right now. Business, you know.”\u003c/p\u003e\n\u003cp\u003e“Sure…you’ll have to introduce me to him later.” He takes a sip of his drink, which looks to be whiskey. “What brings you here tonight?” he asks.\u003c/p\u003e\n\u003cp\u003e“The support act is signed to Jake’s label. What about you?”\u003c/p\u003e\n\u003cp\u003e“Work. I’m doing a piece on Raine.”\u003c/p\u003e\n\u003cp\u003e“Right, cool.” I shift on my feet, distracted.\u003c/p\u003e\n\u003cp\u003eI want to go over to Jake and the blonde, who, from what I can see in my glances over Jefferson’s shoulder, is shamelessly flirting herself all over him, but I don’t want to come off as rude to Jefferson.\u003c/p\u003e\n\u003cp\u003e“If Jake’s busy with business right now, how about I keep you company until he’s done? You want to dance?” He tilts his head in the direction of the dance floor. I see his eyes flicker to my chest.\u003c/p\u003e\n\u003cp\u003eI’m throwing this bloody top in the bin when I get home.\u003c/p\u003e\n\u003cp\u003e“Um…”\u003c/p\u003e\n\u003cp\u003eI really don’t want to dance. I would actually quite like to go home, to be honest.\u003c/p\u003e\n\u003cp\u003eI sneak another glance over Jefferson’s shoulder at Jake. Jake says something to the blonde, and she throws back her head and laughs, putting her hand on his chest.\u003c/p\u003e\n\u003cp\u003eI have a flashback to Paris and the redhead. The redhead Jake kissed in front of me, to get back at me for not breaking up with Will, after he’d begged me to.\u003c/p\u003e\n\u003cp\u003eJealousy sears through me like a red-hot poker. I grit my teeth.\u003c/p\u003e\n\u003cp\u003e“You know what? I would love to dance,” I say to Jefferson through my teeth.\u003c/p\u003e\n\u003cp\u003eScrew Jake and his blonde…and all of his fucking conquests for that matter.\u003c/p\u003e\n\u003cp\u003ePulling out the strap on my clutch, I hang it over my shoulder. Jefferson downs his drink, and, taking his offered hand, I let him lead me through the crowd to the centre of the dance floor.\u003c/p\u003e\n\u003cp\u003eWe start off dancing separately, but it’s not long before Jefferson moves in closer.\u003c/p\u003e\n\u003cp\u003e“You look great tonight,” Jefferson says, leaning in to my ear. “But then, you always do.”\u003c/p\u003e\n\u003cp\u003eI feel his arm go around my waist.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eI stiffen in his embrace.\u003c/p\u003e\n\u003cp\u003eJake won’t be happy if he sees this.\u003c/p\u003e\n\u003cp\u003eIsn’t that the point?\u003c/p\u003e\n\u003cp\u003e“Thanks, you too.” I pull away from him, but I feel his grip on my back tighten, holding me in place, and he starts to dance into me, grinding his hips near mine.\u003c/p\u003e\n\u003cp\u003eUgh.\u003c/p\u003e\n\u003cp\u003eHe’s not even a good dancer.\u003c/p\u003e\n\u003cp\u003eTrying not to cringe at his awkward hip movements, I scrunch my eyes tightly, trying to figure a way out of this.\u003c/p\u003e\n\u003cp\u003eI’m such a bloody idiot at times.\u003c/p\u003e\n\u003cp\u003eI’m on the dance floor with Mr. Bean’s version of Saturday Night Fever, in a lame attempt to make Jake jealous, while Jake is probably none the wiser and off screwing the blonde bitch in the back room, not even giving a toss about me.\u003c/p\u003e\n\u003cp\u003eNow I feel sick, and I just want to go get drunk and kick the crap out of Jake and his whore. I’m just not sure in which order.\u003c/p\u003e\n\u003cp\u003eI’m about to wriggle out of Jefferson’s hold and make my excuses, when I feel him suddenly wrenched away from me.\u003c/p\u003e\n\u003cp\u003eMy eyes shoot open to find a very angry-looking Jake staring down at me, and a very confused Jefferson trying to straighten out his shirt.\u003c/p\u003e\n\u003cp\u003e“What the hell!” Jefferson says, then I see his face change to awe when he realises it’s Jake who just pulled him off me.\u003c/p\u003e\n\u003cp\u003e“I thought you were in the bathroom,” Jake says to me, ignoring Jefferson. He sounds royally pissed off.\u003c/p\u003e\n\u003cp\u003eStanding tall, I say, “I was. Then I decided to come and dance.”\u003c/p\u003e\n\u003cp\u003e“And you didn’t think to come see me first?”\u003c/p\u003e\n\u003cp\u003e“What? I need to ask your permission to dance nowadays?” I narrow my eyes at him. “And anyway, you looked busy.”\u003c/p\u003e\n\u003cp\u003e“I’m never too busy for you. You should know that by now.” There’s no nice in his tone.\u003c/p\u003e\n\u003cp\u003eIt’s at this point Jefferson decides to pipe up.\u003c/p\u003e\n\u003cp\u003e“I meant no disrespect,” Jefferson says. “I’ve known Tru for ages. We knew each other back in London.”\u003c/p\u003e\n\u003cp\u003eJake stiffens. He turns to him and stares down the couple of inches to Jefferson’s face. “You meant no disrespect, but you had your hands all over my girl?”\u003c/p\u003e\n\u003cp\u003eJefferson raises his hands in defence. “We were only dancing.” But the smile on his face says something else entirely.\u003c/p\u003e\n\u003cp\u003eIt makes my body stiffen.\u003c/p\u003e\n\u003cp\u003eJake’s face hardens. I worry for a second that he’s going to do something stupid.\u003c/p\u003e\n\u003cp\u003e“We’re leaving.” Jake grabs my arm and starts to pull me away.\u003c/p\u003e\n\u003cp\u003e“Hey, man, take it easy,” Jefferson puts his hand on Jake’s shoulder.\u003c/p\u003e\n\u003cp\u003eI know instantly he’s done the wrong thing.\u003c/p\u003e\n\u003cp\u003eQuick as lightning, Jake grabs Jefferson’s arm, twisting it back and under, forcing Jefferson to bend under the strain. Then Jake shoves him away, all but tossing him across the dance floor.\u003c/p\u003e\n\u003cp\u003eThe crowd quickly parts, people shifting out of the way, watching as Jefferson lands hard on the dance floor.\u003c/p\u003e\n\u003cp\u003eDave and Ben are beside us in a flash. Ben is quick to get Jefferson off the floor and to his feet.\u003c/p\u003e\n\u003cp\u003e“I was just dancing with her!” Jefferson shouts, clearly not having learned when to stop talking. Then I see a near smile on his face. Like he’s actually trying to antagonise Jake. “She’s an old friend.”\u003c/p\u003e\n\u003cp\u003e“She was a friend,” Jake says, hard and cold, taking a step toward him. “Not anymore. You keep your fuckin’ hands off my girl, and if I ever see you near her again, you won’t be getting up from the floor the next time.”\u003c/p\u003e\n\u003cp\u003eA grin tilts Jefferson’s lips. “Is that a threat?”\u003c/p\u003e\n\u003cp\u003eJake’s jaw clenches, and his fists ball at his sides. “More like a promise.”\u003c/p\u003e\n\u003cp\u003eDave stands between Jake and Jefferson, which I couldn’t be more thankful for.\u003c/p\u003e\n\u003cp\u003e“Go,” Dave urges, pressing his hand against Jake’s arm.\u003c/p\u003e\n\u003cp\u003eI start to back up, wanting out of here.\u003c/p\u003e\n\u003cp\u003eJake takes a step back, moving with me, when Jefferson says loudly, “Call me, Tru.”\u003c/p\u003e\n\u003cp\u003eJake moves so quickly, he’s almost a blur. Luckily, Dave is faster and catches hold of Jake before he can do any damage. I’ve seen what Jake can do when he loses it. And someone like Jake cannot be pummelling guys in clubs.\u003c/p\u003e\n\u003cp\u003eEspecially journalists.\u003c/p\u003e\n\u003cp\u003eNo longer wanting to be party to the scene I’ve caused, I turn, and putting my head down, I start to move quickly, weaving through the crowd, heading for the exit.\u003c/p\u003e\n\u003cp\u003eJake catches up with me near the door.\u003c/p\u003e\n\u003cp\u003eGrabbing my arm, he yanks me back, turning me to him. “Where are you going?” He sounds out of breath and angry.\u003c/p\u003e\n\u003cp\u003e“Home,” I state harshly. I’m still pissed off with him for flirting with the blonde and for what I had to hear in the bathroom. And also for the scene he caused with Jefferson. I know I was wrong to dance with Jefferson for the reason I did, but he didn’t have to react the way he did—making a show of us.\u003c/p\u003e\n\u003cp\u003eI try to pull my arm from his hand, but there’s no give.\u003c/p\u003e\n\u003cp\u003e“What the hell is wrong with you?” Jake states angrily in my face.\u003c/p\u003e\n\u003cp\u003e“Me? What the hell is wrong with you? I was only dancing with him, for crying out loud!”\u003c/p\u003e\n\u003cp\u003e“Dancing?” He lets out a caustic laugh. “It looked like he was getting ready to fuck you right there and then on the dance floor. And you weren’t exactly pushing him off either.”\u003c/p\u003e\n\u003cp\u003e“Screw you, Jake! You can bloody talk with your whores scattered left, right, and centre, in my face all night! Then I’m privy to the absolute displeasure of hearing a conversation about how one of your whores sucked you off in your office. Oh yeah, then you fucked her over your desk!” \u003c/p\u003e","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-13.html","bookId":1999,"creation":"Oct 5, 2019 6:31:55 PM","modification":"Oct 5, 2019 6:31:55 PM"}
