{"id":98066,"no":15,"title":"Page 15","content":"\u003cp\u003eIt’s uncoordinated and desperate. No tenderness. This is hard, starved-for-each-other kissing.\u003c/p\u003e\n\u003cp\u003eMouths slipping over each other’s, Jake’s hand takes hold of my neck. Thumb against my throat, he tilts my head back farther, giving him better access. His tongue is plunging deep into my mouth, practically fucking it, and I love it.\u003c/p\u003e\n\u003cp\u003eI’m all but climbing his body trying to get closer to him. My hands are everywhere.\u003c/p\u003e\n\u003cp\u003eJake’s mouth moves from mine, down my neck, biting and sucking. I moan and grind myself against his erection, wanting him badly.\u003c/p\u003e\n\u003cp\u003eHis hand moves down, tracing the cup of my bra through the sheer fabric of my top.\u003c/p\u003e\n\u003cp\u003eI reach my hand lower, cupping him through his jeans. Jake groans and pushes himself into my hand.\u003c/p\u003e\n\u003cp\u003eI’m just about to open his zipper, when he steps back, breaking contact.\u003c/p\u003e\n\u003cp\u003eMy heart is beating out of my chest and nearly leaps from it when he says, “Lose the clothes, sweetheart, and sit up on the hood.”\u003c/p\u003e\n\u003cp\u003eMy eyes are fixed to his. I’m lost in him totally and completely. We are outside, and Jake wants us to have sex on the hood of his car.\u003c/p\u003e\n\u003cp\u003eHonestly, I can’t wait to sit myself up there.\u003c/p\u003e\n\u003cp\u003eI lose all my inhibitions around Jake. There is nothing I fear doing when I’m with him. Or fearing doing for him.\u003c/p\u003e\n\u003cp\u003eI pull my top over my head, dropping it on the car, then unzip my skirt at the back, pushing it down over my hips.\u003c/p\u003e\n\u003cp\u003eI watch Jake watching me, loving the way his eyes devour every naked inch that I reveal to him.\u003c/p\u003e\n\u003cp\u003eNo one has ever looked at me before the way he does. Like I am the only person in the whole world. That having me—being inside me—is the only thing that will ever matter to him.\u003c/p\u003e\n\u003cp\u003eStepping out of my skirt, I pick it up and drop it on the car.\u003c/p\u003e\n\u003cp\u003eI’m about to kick my shoes off, when Jake says in a rough voice, “Keep the heels on.”\u003c/p\u003e\n\u003cp\u003eI step back, letting my ass meet with the car. I sit up on it, hooking my heels into the bumper, the paintwork warm on my skin from the heat of the engine.\u003c/p\u003e\n\u003cp\u003eNow I’m closer to the car, I can make out the song that has just started to play. “Pour Some Sugar on Me” by Def Leppard.\u003c/p\u003e\n\u003cp\u003eJake obviously registers the song too, because the tilt of his head and the inferred smile he gives practically has me wetting my panties.\u003c/p\u003e\n\u003cp\u003eHoly fuck.\u003c/p\u003e\n\u003cp\u003eJake approaches, removing his T-shirt as he does. He tosses it onto the car and moves past me. My eyes follow him as he leans in through the open window.\u003c/p\u003e\n\u003cp\u003eI hear the music grow louder.\u003c/p\u003e\n\u003cp\u003eThen Jake is back, coming to stand between my legs, he leans against me, chest on chest, reaching over my shoulder, he grabs for something, and then I feel the silky fabric of my top brush over my skin.\u003c/p\u003e\n\u003cp\u003e“Do you trust me?” he murmurs.\u003c/p\u003e\n\u003cp\u003eMy body starts to tremble, knowing where he’s going with this.\u003c/p\u003e\n\u003cp\u003eI nod slowly, my eyes captivated by his.\u003c/p\u003e\n\u003cp\u003eI watch as Jake twists my silk top into a thin strip of fabric. He brings it to rest over my eyes, tying it in a tight knot at the back of my head.\u003c/p\u003e\n\u003cp\u003e“Lie back,” he whispers in my ear.\u003c/p\u003e\n\u003cp\u003eI do as he says, my whole body quaking with nerves and sexual excitement.\u003c/p\u003e\n\u003cp\u003eWe’re out in the open. Dave is at the top of the track, playing guard. I’m blindfolded by my own top, and Jake is about to make love to me on his sexy Aston Martin with “Pour Some Sugar on Me” playing in the background.\u003c/p\u003e\n\u003cp\u003eCould he be any fucking hotter?\u003c/p\u003e\n\u003cp\u003eJake kisses me once on the mouth, and then I feel his body move down mine.\u003c/p\u003e\n\u003cp\u003eAll I can hear is Joe Elliott’s rough vocals in my ear. I feel the heavy drum and electric guitar pumping through the metal of the car, vibrating against my skin, and Jake’s mouth on me.\u003c/p\u003e\n\u003cp\u003eHe frees my swollen breast from my bra and runs his tongue around my nipple, taking my breast into his mouth.\u003c/p\u003e\n\u003cp\u003eI groan, feeling it between my legs via the tethered line to my sex. I push my fingers into his thick hair, winding them into it.\u003c/p\u003e\n\u003cp\u003eJake repeats the motion with my left breast, while his hand caresses the right. He rubs the peak of my nipple between his thumb and forefinger almost to the point of pain. Pleasure pain.\u003c/p\u003e\n\u003cp\u003eIt feels even better in the dark. Feeling, not seeing. And it’s so very fucking hot.\u003c/p\u003e\n\u003cp\u003eJake kisses down my stomach, I feel his tongue and hot breath moving over my highly sensitised skin. He dips his tongue into my navel, and then I feel his fingers tracing the line between my panties and skin.\u003c/p\u003e\n\u003cp\u003e“New ones?” he asks.\u003c/p\u003e\n\u003cp\u003e“No.” I shake my head.\u003c/p\u003e\n\u003cp\u003eJake rips them off, and I swear to God I’m sure I feel his teeth against me when he does.\u003c/p\u003e\n\u003cp\u003eDid he just tear my panties off with his teeth?\u003c/p\u003e\n\u003cp\u003eHoly fucking hotness!\u003c/p\u003e\n\u003cp\u003eI honestly don’t think I’ve ever being as turned on as I am right now.\u003c/p\u003e\n\u003cp\u003eI’m about ready to jump up, tear his clothes off, and shag him senseless, when I feel Jake’s finger touch my sex. My hips jerk in response. Holding me down with one hand spanning my stomach, he moves his finger between my cleft, stroking gently, then up over my throbbing clit.\u003c/p\u003e\n\u003cp\u003e“So wet,” he murmurs.\u003c/p\u003e\n\u003cp\u003eI so absolutely am. And I’m so absolutely desperate for the feel of his tongue on me that I’m getting ready to beg if he doesn’t put it there in the next five seconds.\u003c/p\u003e\n\u003cp\u003eHe removes his finger from me, the loss of momentary contact almost painful.\u003c/p\u003e\n\u003cp\u003eThen I feel his tongue on me, and lights explode behind my eyelids.\u003c/p\u003e\n\u003cp\u003e“Ah,” I moan in absolute pleasure, relaxing into the feel of his mouth on me.\u003c/p\u003e\n\u003cp\u003eI feel Jake’s finger enter me slowly, as his tongue teases and explores. In goes another finger, stretching me, readying me for his huge cock.\u003c/p\u003e\n\u003cp\u003eThis is going to be over very quickly. It’s just so insanely erotic that I can’t even find the will to want to hold off.\u003c/p\u003e\n\u003cp\u003e“Oh God, Jake…I’m gonna…I’m gonna…”\u003c/p\u003e\n\u003cp\u003eMy whole body is trembling. The sensation and rise working higher and higher. Jake’s fingers move harder, in and out, his tongue mercilessly taking me over to complete bliss.\u003c/p\u003e\n\u003cp\u003eMy fingernails scratch over the paintwork as I try to find something to cling to. Sweat mists my skin. My body writhes from the torturous pleasure Jake is giving me.\u003c/p\u003e\n\u003cp\u003e“Come,” he commands.\u003c/p\u003e\n\u003cp\u003eA lick, a stroke, and…\u003c/p\u003e\n\u003cp\u003e“Fuck, Jake!” I scream his name out as the most mind-blowing orgasm tears through my body, literally lifting me up off the car.\u003c/p\u003e\n\u003cp\u003eAfter very long moments of intense, serious pleasure, I drop back down to earth, my limbs gooey, relaxed. The tension of our earlier fight very much forgotten.\u003c/p\u003e\n\u003cp\u003eI hear the zipper on Jake’s pants open.\u003c/p\u003e\n\u003cp\u003eI love that sound.\u003c/p\u003e\n\u003cp\u003eJake moves between my legs, nudging them farther apart with his hips. I can feel the denim of his jeans against my thighs. I love that he hasn’t even waited to take them off. He wants me so badly that the longest he can wait is to get it out of his pants.\u003c/p\u003e\n\u003cp\u003eI feel the head of his cock pressing at my entrance.\u003c/p\u003e\n\u003cp\u003eHe pulls the blindfold off my eyes. Staring down at me with a blazing gaze, teeth gritted, he says, “I’m going in hard, baby. I need to fuck you raw. You ready?”\u003c/p\u003e\n\u003cp\u003eI know he has barely any control right now, I can see it in the clench of his jaw, the dark of his eyes. The only thing on his mind right now is the fighting need to come, fucking me until he’s dry.\u003c/p\u003e\n\u003cp\u003e“I’m so ready,” I breathe.\u003c/p\u003e\n\u003cp\u003eJake slams into me.\u003c/p\u003e\n\u003cp\u003eI cry out at the feel of him filling me, exquisitely stretching me to the extreme like only he can.\u003c/p\u003e\n\u003cp\u003e“Jesus,” he groans, stilling momentarily.\u003c/p\u003e\n\u003cp\u003eHis hands grip my hips, fingers digging into me, and then he starts to move hard and fast, pounding into me over and over.\u003c/p\u003e\n\u003cp\u003eGrunts and groans emit from Jake, the scent of our unrestrained sex flowing into me with every ragged breath I take, driving me closer to the edge of another orgasm.\u003c/p\u003e\n\u003cp\u003eJake drives into me with a deep-seated force, his fingers finding me, spreading me, aiding to drive my second orgasm to the brink.\u003c/p\u003e\n\u003cp\u003e“You’re mine. Say it, Tru.”\u003c/p\u003e\n\u003cp\u003e“I’m yours,” I cry out.\u003c/p\u003e\n\u003cp\u003e“You’ll always be mine,” he growls. “God, you’re just so fuckin’ sexy, so hot…I need…I need…”\u003c/p\u003e\n\u003cp\u003eI know what he needs.\u003c/p\u003e\n\u003cp\u003e“Córrete para mí, cariño!” I say in a commanding tone.\u003c/p\u003e\n\u003cp\u003eJake yells out an expletive, and then I feel him pumping his sweet liquid into me.\u003c/p\u003e\n\u003cp\u003eMy own orgasm takes over, my muscles tensing and contracting around his cock.\u003c/p\u003e\n\u003cp\u003eWhen Jake is empty of everything he has, he leans over me, still inside me, resting his chest heavily against mine. Our slick skin sticking together, he kisses my lips gently.\u003c/p\u003e\n\u003cp\u003e“I’m sorry I was a jealous ass tonight,” he says against my mouth.\u003c/p\u003e\n\u003cp\u003e“Were those orgasms part of the apology?”\u003c/p\u003e\n\u003cp\u003e“Did they work?”\u003c/p\u003e\n\u003cp\u003e“Oh, absolutely.” I smile. “I’m sorry I was jealous too.”\u003c/p\u003e\n\u003cp\u003e“All forgotten, right?”\u003c/p\u003e\n\u003cp\u003e“Right. I guess we make a good pair. A good jealous pair.”\u003c/p\u003e\n\u003cp\u003e“The best jealous pair ever,” he murmurs, squeezing me tight.\u003c/p\u003e\n\u003cp\u003eAfter a moment, Jake eases himself out of me, and I sit myself up, hair ruffled and thoroughly fucked.\u003c/p\u003e\n\u003cp\u003e“So you finally got to do the blindfolding thing.” I grin.\u003c/p\u003e\n\u003cp\u003e“I told you that you were kinky.” He smirks at me.\u003c/p\u003e\n\u003cp\u003e“Me? You were the one fixing me up with it!” I say, throwing his T-shirt at him.\u003c/p\u003e\n\u003cp\u003eHe catches it, laughing, and pulls it on.\u003c/p\u003e\n\u003cp\u003eAs I’m sliding on my own, now severely wrinkled, top, I add, “Saying that, though…I wouldn’t say no to you doing it again. Maybe tying me up one time too.” I bite my lip.\u003c/p\u003e\n\u003cp\u003eJake inhales sharply and his eyes darken like I’ve never before known.\u003c/p\u003e\n\u003cp\u003eHe picks my skirt up and thrusts it into my hand.\u003c/p\u003e\n\u003cp\u003e“Get dressed.” His tone is urgent.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?” I look around, expecting to see someone coming. Maybe Dave.\u003c/p\u003e\n\u003cp\u003e“Nothing’s wrong. Far from it. Sweetheart, you have just given me the green light to tie you up and fuck you. I’ve wanted to do that to you for a very long time. Now I just want to get you back home to our bed, so I can tie you to it and fuck you senseless, again, before you change your mind.”\u003c/p\u003e\n\u003cp\u003eHopping off the bonnet, pulling my skirt on, I zip it up at the back and make my way toward the passenger side.\u003c/p\u003e\n\u003cp\u003eOpening the door, I glance over the car at him. “Don’t worry, baby, I won’t be changing my mind. I’ve wanted you to do it to me for a while now too.”\u003c/p\u003e\n\u003cp\u003e“Why the fuck didn’t you say so before?” He grins, hopping in the car and firing up the engine.\u003c/p\u003e\n\u003cp\u003eJake has us out of there and back home in record time. Before I know it, I’m naked again. My wrists are bound to the bed with one of my silk scarves while Jake makes both our fantasies come true.\u003c/p\u003e\n\u003cp\u003eJAKE…\u003c/p\u003e\n\u003cp\u003eCHAPTER EIGHT\u003c/p\u003e\n\u003cp\u003eI say we wrap it up for today; I don’t think we’re getting any more down.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Denny says through a yawn from behind his drum kit, stretching his arms over his head. “My head’s mashed now.”\u003c/p\u003e\n\u003cp\u003e“Bunch of pussies, you’ve got no fucking stamina,” Tom pipes up, strumming his bass.\u003c/p\u003e\n\u003cp\u003e“You done?” I ask Smith.\u003c/p\u003e\n\u003cp\u003eSmith is the lead guitarist we brought on board as an unofficial replacement for Jonny. Jonny, my best friend and band member, who died in a car accident a year and a half ago. \u003c/p\u003e","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-15.html","bookId":1999,"creation":"Oct 5, 2019 6:31:55 PM","modification":"Oct 5, 2019 6:31:55 PM"}
