{"id":98074,"no":23,"title":"Page 23","content":"\u003cp\u003e“Ms. Bennett, is everything okay?” I see his eyes go to the holdall on my shoulder.\u003c/p\u003e\n\u003cp\u003e“Could you give these to Jake when he gets back, please?” I hold out the keys.\u003c/p\u003e\n\u003cp\u003eHis eyes flicker to them, then back to my face. “Are you sure you don’t want to keep hold of them?”\u003c/p\u003e\n\u003cp\u003e“No.” I shake my head. “I won’t be needing them anymore.”\u003c/p\u003e\n\u003cp\u003eReluctantly, he takes them from me.\u003c/p\u003e\n\u003cp\u003eI start to walk toward the gates, when he says, “If you need driven somewhere, Parker can take you wherever you want to go.” He thumbs back to Parker, the other security guard, who is standing by the door, watching our interaction.\u003c/p\u003e\n\u003cp\u003e“No, it’s okay. Thanks. I’ve got a cab coming.” It’s at that moment the cab rolls up.\u003c/p\u003e\n\u003cp\u003e“Bye, Jackson. Bye, Parker.” I give a small wave.\u003c/p\u003e\n\u003cp\u003eJackson gives me a sad smile as Parker opens the gates, letting me out.\u003c/p\u003e\n\u003cp\u003eWithout a backward glance, I climb into the cab, settling my bags beside me.\u003c/p\u003e\n\u003cp\u003e“Where to?” the driver asks.\u003c/p\u003e\n\u003cp\u003e“LAX, please.”\u003c/p\u003e\n\u003cp\u003eJAKE…\u003c/p\u003e\n\u003cp\u003eCHAPTER ELEVEN\u003c/p\u003e\n\u003cp\u003eI’m pregnant.”\u003c/p\u003e\n\u003cp\u003eTru’s pregnant. With my baby.\u003c/p\u003e\n\u003cp\u003eBut she’s on the pill. How can she be pregnant?\u003c/p\u003e\n\u003cp\u003eJesus fucking Christ. She’s pregnant. With my baby.\u003c/p\u003e\n\u003cp\u003eI can’t be a dad. I’m not dad material.\u003c/p\u003e\n\u003cp\u003eI get a smoke out of the pack and realise my hands are shaking.\u003c/p\u003e\n\u003cp\u003eI clench my hands into fists, trying to ease the tremors. I put a cigarette between my lips, light it, and take a long, slow drag.\u003c/p\u003e\n\u003cp\u003eLowering the window, I blow the smoke out into the night, and stare out at LA.\u003c/p\u003e\n\u003cp\u003eThe last time I was parked here, I was seeing to Tru on the hood of my car, and now I’m here after finding out I’m going to be a dad.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eI know without a doubt that Tru will want the baby. An abortion won’t be an option for her.\u003c/p\u003e\n\u003cp\u003eNow I feel like the worst kind of bastard for even thinking it. Thinking of getting rid of a part of myself and Tru.\u003c/p\u003e\n\u003cp\u003eBut what the fuck do I know about being a dad? Nothing. I know absolutely nothing. I didn’t exactly have the best teacher growing up. I may have had Dale for the last part, and sure, he’s a good guy, but the damage was done by that point. I was well beyond repair by the time Paul was gone.\u003c/p\u003e\n\u003cp\u003eHe fucked me up. And I can’t screw a kid up like he did me. Not my own flesh and blood. I’d never forgive myself.\u003c/p\u003e\n\u003cp\u003eTaking another drag, I rest my elbows on the wheel and put my head in my hands.\u003c/p\u003e\n\u003cp\u003e“You’re a fuckin’ waste of space, Jake…Can’t you ever get anything right?…Take after your mother, you do, fuckin’ useless…I wish you’d never been born, I never wanted saddling with a kid—especially not a whiney little shit like you…You’ll never amount to anything…What the fuck are you crying for? If you don’t stop crying, boy, I’ll give you a fuckin’ reason to cry…”\u003c/p\u003e\n\u003cp\u003eI bang my palms against my forehead, trying to get the sound of his goddamn voice out of my head.\u003c/p\u003e\n\u003cp\u003eHe’s dead, and he’s still here, fucking with me. Still taunting me.\u003c/p\u003e\n\u003cp\u003eI need to drown the dead motherfucker out.\u003c/p\u003e\n\u003cp\u003eI turn the music on, quickly search through to Linkin Park, and press Play on “Numb.” I crank it up loud, until the song bleeds through every sense.\u003c/p\u003e\n\u003cp\u003eI always listen to this song when I need to clear my mind. My drug counsellor said to find something to focus on when I feel like everything is slipping away from me. Music is my life, aside from Tru, so I took to this song.\u003c/p\u003e\n\u003cp\u003eI know this might seem an odd song to calm me, but it works. “Numb” is my comedown song.\u003c/p\u003e\n\u003cp\u003eI can feel my anger and frustrations already beginning to ebb.\u003c/p\u003e\n\u003cp\u003eNumb is exactly how I need to feel right now. I don’t want to think. I don’t want to feel. Because if I do, I’ll be turning this car around and heading in the wrong direction, straight to a dealer.\u003c/p\u003e\n\u003cp\u003eResting back in my seat, I take another long pull on my smoke, flicking the ash out the window.\u003c/p\u003e\n\u003cp\u003eI’m going to be a dad.\u003c/p\u003e\n\u003cp\u003eI don’t know how to be a dad. I want to be…for Tru. I want to be everything right for her. But I don’t know if I can. I’ll fuck it up. I fuck everything up.\u003c/p\u003e\n\u003cp\u003eThe thought of screwing up something as important as having a kid terrifies me beyond words.\u003c/p\u003e\n\u003cp\u003eI can’t be him. I can’t be Paul. And I have been, for a very long time.\u003c/p\u003e\n\u003cp\u003eI would never raise my hand to a woman or a child. Never. But what if we had a kid and something just snapped inside of me and changed me into the bastard he was? It doesn’t take just fists to hurt and break a kid. Words do some serious fucking damage too.\u003c/p\u003e\n\u003cp\u003eI know that all too well.\u003c/p\u003e\n\u003cp\u003eAnd I’m like him in so many ways. Too many ways. What’s to say that I won’t morph into the full shithole of a package that was Paul Wethers once my kid is born?\u003c/p\u003e\n\u003cp\u003eI might be successful professionally, but behind that façade, I’m a whole lot of fucked up and broken. Tru is the glue that holds me together, and look what I just did to her. She is my whole world. She told me she was pregnant and I just walked away from her. I left her all alone.\u003c/p\u003e\n\u003cp\u003eWhat type of man does that? A fucking coward, that’s what.\u003c/p\u003e\n\u003cp\u003eGod, when she told me she was pregnant, she sounded so scared. I could hear it in her voice. Almost like she knew what I’d do. That I’d run away. That I’d fuck up.\u003c/p\u003e\n\u003cp\u003eDidn’t I do that so very fucking spectacularly?\u003c/p\u003e\n\u003cp\u003eIt’s no excuse, but I panicked. When she said she was pregnant, it was like a fuse went in my head and I couldn’t think straight. For the whole ride home, I felt robotic.\u003c/p\u003e\n\u003cp\u003eI couldn’t think or focus on anything.\u003c/p\u003e\n\u003cp\u003eIt was just…Drive the car, Jake.\u003c/p\u003e\n\u003cp\u003eGet home, Jake.\u003c/p\u003e\n\u003cp\u003eI couldn’t get any farther than that. When she got out of the car, I knew she was angry and hurting, but I was frozen to my seat.\u003c/p\u003e\n\u003cp\u003eI was telling myself to get out of the car, to follow her, to talk to her, but I literally couldn’t make my body move.\u003c/p\u003e\n\u003cp\u003eThe next thing I knew, the car was in reverse, and I was spinning it around, driving out of there.\u003c/p\u003e\n\u003cp\u003eI was just so fucking terrified. I’m still terrified.\u003c/p\u003e\n\u003cp\u003eTru is carrying my baby inside of her, and I left them both behind.\u003c/p\u003e\n\u003cp\u003eI walked away.\u003c/p\u003e\n\u003cp\u003eI am him.\u003c/p\u003e\n\u003cp\u003eI’m the legacy he left behind. He got exactly what he wanted. He wanted me just as screwed up—no, more screwed up—than he was.\u003c/p\u003e\n\u003cp\u003eWell, cheers, Dad. You did a top-notch fucking job.\u003c/p\u003e\n\u003cp\u003eTaking one last drag of my smoke, I flick my cigarette butt out the window.\u003c/p\u003e\n\u003cp\u003eI’ll never be good enough for Tru or the baby. But I want to be.\u003c/p\u003e\n\u003cp\u003eI know the baby will be perfect and beautiful, because Tru is. It’ll take after her, because it has to. I don’t want an ounce of my fucked-up-ness in our baby.\u003c/p\u003e\n\u003cp\u003eOur baby.\u003c/p\u003e\n\u003cp\u003eWe’re having a baby. It’s growing inside of her right now. A tiny baby, made from me and Tru. It’ll be so small…so tiny, with a little heart beating in its chest.\u003c/p\u003e\n\u003cp\u003eIt’ll need protecting, keeping safe for its whole life.\u003c/p\u003e\n\u003cp\u003eAnd it’s mine to protect.\u003c/p\u003e\n\u003cp\u003eI’m going to be a dad.\u003c/p\u003e\n\u003cp\u003eOut of nowhere, I feel a tiny lift in my heart at the thought. A tiny flicker of hope buried deep inside my fractured, fucked-up soul.\u003c/p\u003e\n\u003cp\u003eThen the realisation slaps me across the face.\u003c/p\u003e\n\u003cp\u003eI’ve so completely fucked up. She’s never going to forgive me for this.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eI need to go back. I need to talk to her. Beg her to forgive me. Tell her I’ll make it work somehow. I’ll figure something out. I’ll figure out how to be a dad to our baby. I want to be the man she believes I can be. I will do anything for her.\u003c/p\u003e\n\u003cp\u003eI can’t lose Tru. She’s my reason for being. She’s my everything.\u003c/p\u003e\n\u003cp\u003eAnd I want to be the same for our baby.\u003c/p\u003e\n\u003cp\u003eI’m just about to fire up the car when my cell starts to ring.\u003c/p\u003e\n\u003cp\u003eI glance at the screen and see it’s home security.\u003c/p\u003e\n\u003cp\u003eTru.\u003c/p\u003e\n\u003cp\u003eFuck, no.\u003c/p\u003e\n\u003cp\u003e“What’s wrong?”\u003c/p\u003e\n\u003cp\u003e“Mr. Wethers. It’s Jackson. I, um, I just thought you might want to know that Ms. Bennett just left in a cab. She had luggage, and she, um, left her house keys with me to give to you.”\u003c/p\u003e\n\u003cp\u003eMy heart drops through my stomach.\u003c/p\u003e\n\u003cp\u003eGod, no.\u003c/p\u003e\n\u003cp\u003e“You just let her leave?” I say through gritted teeth.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, sir. I tried to talk to her, offered to drive her wherever she was going, but she wouldn’t have it.”\u003c/p\u003e\n\u003cp\u003eThat’s Tru. Stubborn to a fault.\u003c/p\u003e\n\u003cp\u003e“Do you know where she was going?” I ask through my dry mouth.\u003c/p\u003e\n\u003cp\u003e“No, sir.”\u003c/p\u003e\n\u003cp\u003e“Find out.”\u003c/p\u003e\n\u003cp\u003e“How?”\u003c/p\u003e\n\u003cp\u003e“Did you see which cab company it was that picked her up?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Then fuckin’ call them and find out where the driver is taking her! How long ago did she leave?” I drive my hand through my hair.\u003c/p\u003e\n\u003cp\u003e“The cab pulled away less than a minute ago.”\u003c/p\u003e\n\u003cp\u003e“Call them now. Then call me straight back.”\u003c/p\u003e\n\u003cp\u003eI hang up.\u003c/p\u003e\n\u003cp\u003eShe left. I have no one to blame but myself. I have so totally and monumentally screwed everything up.\u003c/p\u003e\n\u003cp\u003eFucking idiot, I’m such a complete and total fucking idiot.\u003c/p\u003e\n\u003cp\u003eI have to make this right. I have to bring her home. Bring them both home.\u003c/p\u003e\n\u003cp\u003eI speed-dial Tru’s cell.\u003c/p\u003e\n\u003cp\u003eIt’s ringing.\u003c/p\u003e\n\u003cp\u003ePick up, baby, please.\u003c/p\u003e\n\u003cp\u003eAfter three rings, it diverts to voice mail.\u003c/p\u003e\n\u003cp\u003eShe cut me off.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eI press redial.\u003c/p\u003e\n\u003cp\u003eVoice mail.\u003c/p\u003e\n\u003cp\u003eFuck. Fuck. Fuck.\u003c/p\u003e\n\u003cp\u003eI wait for the tone to leave a message. “Sweetheart, I’m so sorry. I screwed up, I know, but don’t leave. Call me back, please. We can talk and sort this out. I shouldn’t have left when I did. I shouldn’t have left you like that. I just panicked. I’m not strong like you, baby. It’s no excuse, I know, but please don’t leave.” I exhale. “I just…I love you so fuckin’ much.”\u003c/p\u003e\n\u003cp\u003eI can feel my throat tightening, so I hang the call up before I start crying.\u003c/p\u003e\n\u003cp\u003eI get out another smoke and light it up and sit and stare at my cell.\u003c/p\u003e\n\u003cp\u003eCall me back, baby, please.\u003c/p\u003e\n\u003cp\u003eA minute later, my cell starts to ring, but it’s not her. It’s security.\u003c/p\u003e\n\u003cp\u003e“Where is she going?” I ask in a clipped voice.\u003c/p\u003e\n\u003cp\u003e“LAX, sir.”\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eI slam the car into drive and, spinning it around, I put the pedal to the floor, desperate to get to LAX and stop the only woman I’ve ever loved from leaving me and taking my baby with her.\u003c/p\u003e\n\u003cp\u003eTRU…\u003c/p\u003e\n\u003cp\u003eCHAPTER TWELVE\u003c/p\u003e\n\u003cp\u003eAdele starts to sing in my bag. I rifle through my bag to find my phone.\u003c/p\u003e\n\u003cp\u003eJake.\u003c/p\u003e\n\u003cp\u003eMy heart thumps in my chest as I stare at his name on the screen.\u003c/p\u003e\n\u003cp\u003eHe left me. He just drove away and left me.\u003c/p\u003e\n\u003cp\u003eThe pain, rejection, and humiliation all clusters together and burns straight through my heart.\u003c/p\u003e\n\u003cp\u003eI reject his call and switch off my phone.\u003c/p\u003e\n\u003cp\u003e“How much longer to the airport?” I ask the driver.\u003c/p\u003e\n\u003cp\u003e“About fifteen minutes.”\u003c/p\u003e\n\u003cp\u003eI rest back in my seat. I don’t even know when the next flight back to the UK is. I didn’t plan that far ahead. I didn’t plan this at all.\u003c/p\u003e\n\u003cp\u003eI’ll just have to wait it out at the airport until I can get the next flight out of this godforsaken place.\u003c/p\u003e\n\u003cp\u003eI expected Jake to react badly to the news of my pregnancy. I expected a fight. What I didn’t expect was for him to not say a word the moment I told him, then drive away the instant he got me out of the car. \u003c/p\u003e","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-23.html","bookId":1999,"creation":"Oct 5, 2019 6:31:55 PM","modification":"Oct 5, 2019 6:31:55 PM"}
