{"id":98054,"no":3,"title":"Page 3","content":"\u003cp\u003e“No, I guess you weren’t.” I smile, shaking my head, remembering Jake’s words that night. “But I’m not exactly a pushover either. I wouldn’t have said yes if it wasn’t exactly what I wanted. I love you. I’ve always loved you,” I add, surprised by the tears that fill my eyes.\u003c/p\u003e\n\u003cp\u003e“I love you too, baby.” He takes my face in his hands and kisses me gently on the lips.\u003c/p\u003e\n\u003cp\u003e“So is that a yes?” he asks against my mouth.\u003c/p\u003e\n\u003cp\u003e“It’s a yes.” I grin, happiness bubbling up in me. “Now we have two marriage proposals to tell the kids about one day.”\u003c/p\u003e\n\u003cp\u003eI feel him stiffen up against me. And not in a good way.\u003c/p\u003e\n\u003cp\u003eTilting my head back, I catch something in his eyes that sets unease rolling around my stomach.\u003c/p\u003e\n\u003cp\u003eNot good. Not good at all.\u003c/p\u003e\n\u003cp\u003e“I don’t mean we’ll have kids now, of course,” I hasten to add. “Not for ages. Like, a really, really long time.” Three, four years max.\u003c/p\u003e\n\u003cp\u003eJake remains quiet, continuing to stare at me, his face an unreadable mask. But even in this low light, I can tell the colour has drained a little from his face.\u003c/p\u003e\n\u003cp\u003eAnd now I feel inclined to ask the question, “You do want kids, don’t you?”\u003c/p\u003e\n\u003cp\u003eI do. I couldn’t envision a life not having them.\u003c/p\u003e\n\u003cp\u003eHe clears his throat. “I…um…well, I don’t know.” He shrugs. It’s an awkward, jerky kind of shrug. “I mean, it’s just not something I ever considered. I guess I just never saw kids as part of my future. They’re not an investment I ever considered making.”\u003c/p\u003e\n\u003cp\u003eAn investment? Since when did kids become a commodity?\u003c/p\u003e\n\u003cp\u003eThis really is not good. It’s so far from good, it’s replaced whatever the word for that would be.\u003c/p\u003e\n\u003cp\u003e“Oh,” I say.\u003c/p\u003e\n\u003cp\u003eWhat else can I say? A sudden chill settles over my skin, and it’s got nothing to do with the night air. I take a small step back from him.\u003c/p\u003e\n\u003cp\u003e“Look, Tru.” He lifts his eyes to mine. “You know I didn’t have the best role model growing up.”\u003c/p\u003e\n\u003cp\u003eJake’s dad was an abusive, poor excuse for a man, who went to prison for his treatment of Jake and his mom.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t know the first thing about being a dad,” he continues. “And babies…Christ, they don’t exactly fit into my world, do they? I mean, I wouldn’t have a clue where to start. Music is my thing. You, and music.”\u003c/p\u003e\n\u003cp\u003eI don’t know if it’s the look on my face or my body language or the complete bloody idiot inside of him possessing him to the point of maximum stupidity that prompts him to say, “But, hey, if kids are what you want, then sure, we’ll have kids.” He kisses my forehead. “Whatever you want, sweetheart. It’s no biggie. Come on, let’s eat.”\u003c/p\u003e\n\u003cp\u003eStunned to silence, I let Jake lead me to the table, never actually saying the words I want to say. The ones that are stuck in my throat, choking me to death.\u003c/p\u003e\n\u003cp\u003eIt’s no biggie, he said. No biggie.\u003c/p\u003e\n\u003cp\u003eHe’s right, it’s not big. It’s huge. Fucking ginormous, in fact.\u003c/p\u003e\n\u003cp\u003eAnd right now my heart has dropped straight through that fucking ginormous fact and is hurtling somewhere toward oblivion.\u003c/p\u003e\n\u003cp\u003eYou don’t have a child with someone because it’s what the other person wants, because it will keep them happy. Especially when that something—as big as having children—is something you clearly do not want. You have a child with someone because it’s what you both want, together.\u003c/p\u003e\n\u003cp\u003eIt’s most definitely what I want in the future. Apparently, Jake…not so much.\u003c/p\u003e\n\u003cp\u003eHow did I not know this?\u003c/p\u003e\n\u003cp\u003eA hollow feeling takes up residence in my chest.\u003c/p\u003e\n\u003cp\u003eJake doesn’t want kids. And I do.\u003c/p\u003e\n\u003cp\u003eThis puts us on very different pages.\u003c/p\u003e\n\u003cp\u003eFuck.\u003c/p\u003e\n\u003cp\u003eHow did I go from a second marriage proposal and blissful happiness to a possibly empty future in the space of a few minutes?\u003c/p\u003e\n\u003cp\u003eScrew me and my goddamn big mouth.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWO\u003c/p\u003e\n\u003cp\u003eI wake in the dark to the feeling of my stomach roiling.\u003c/p\u003e\n\u003cp\u003eI’m going to be sick.\u003c/p\u003e\n\u003cp\u003eClamping my hand over my mouth, I scramble out of bed and run for the bathroom.\u003c/p\u003e\n\u003cp\u003eI make it just in time. Tossing up the toilet lid, I throw up.\u003c/p\u003e\n\u003cp\u003eThe next thing I know, Jake is beside me, gathering my hair back from my face as his other hand gently soothes my back.\u003c/p\u003e\n\u003cp\u003eWhen my stomach is empty, Jake reaches over and flushes the toilet while I rest my head on my forearm, sweat trickling from my face and down my neck.\u003c/p\u003e\n\u003cp\u003eJake reaches over and gets a tie for my hair off the sink and puts my hair into a loose ponytail for me.\u003c/p\u003e\n\u003cp\u003eI hear running water and then feel a cool flannel against the back of my neck.\u003c/p\u003e\n\u003cp\u003e“You’re sick?”\u003c/p\u003e\n\u003cp\u003e“I woke up feeling like I was going to throw up. And then I did, obviously…” I trail off.\u003c/p\u003e\n\u003cp\u003eJake puts his hand to my forehead. “You feel really hot.”\u003c/p\u003e\n\u003cp\u003e“Everything here feels hot,” I mumble.\u003c/p\u003e\n\u003cp\u003e“Let’s get you back to bed.” Jake scoops me into his arms and carries me to the bedroom.\u003c/p\u003e\n\u003cp\u003eHe lays me down on the bed. My sweaty skin instantly sticks to the sheets.\u003c/p\u003e\n\u003cp\u003eI feel so uncomfortable and very sick.\u003c/p\u003e\n\u003cp\u003eI hear Jake moving around the bedroom, and then he sits beside me, holding out a glass of water. “Try some water. Just sip it.”\u003c/p\u003e\n\u003cp\u003ePropping myself up on my elbow, I accept the glass from Jake and take slow sips.\u003c/p\u003e\n\u003cp\u003eI’ve only just put the glass down on the bedside cabinet when the wave of nausea hits again.\u003c/p\u003e\n\u003cp\u003e“Sick again,” I gasp, putting my hand over my mouth.\u003c/p\u003e\n\u003cp\u003eI’m back in Jake’s arms in an instant, and he strides to the bathroom, placing me beside the toilet, kneeling beside me, once again rubbing my back as I retch up the water I just drank.\u003c/p\u003e\n\u003cp\u003e“I’m calling for a doctor,” Jake says, once I’ve heaved myself dry.\u003c/p\u003e\n\u003cp\u003eHe disappears for a moment to get his phone, then he’s back beside me. I curl up in his lap on the bathroom floor, listening to him barking orders down the phone as he gently strokes wisps of hair from off my damp face. And I begin to feel worse and worse with each passing moment.\u003c/p\u003e\n\u003cp\u003e“Ugh,” I groan, blinking my blurry eyes against the daylight.\u003c/p\u003e\n\u003cp\u003eRolling over, I find Jake beside me wearing his boxer shorts, propped against the headboard, his laptop on his knee.\u003c/p\u003e\n\u003cp\u003eGlancing at the screen, I see a spreadsheet filled with numbers.\u003c/p\u003e\n\u003cp\u003eMinimising the spreadsheet from my view, he sets his laptop on the bed and scoots down to face me.\u003c/p\u003e\n\u003cp\u003e“How you feeling?” he asks. Lifting a hand to my face, he runs his fingers gently over my cheek, brushing my stray hair back.\u003c/p\u003e\n\u003cp\u003e“Like I spent the whole night throwing up. What time is it?” I croak, rubbing my sore eyes.\u003c/p\u003e\n\u003cp\u003e“One p.m.”\u003c/p\u003e\n\u003cp\u003e“Christ, I slept the whole morning away.”\u003c/p\u003e\n\u003cp\u003e“You needed it.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I guess. I’m so thirsty,” I say, turning my head, looking for the glass of water I’d left on the bedside cabinet.\u003c/p\u003e\n\u003cp\u003e“I got rid of it,” Jake says. “It was warm. I’ll get you something fresh.” Before leaving the bed, he kisses my forehead, then gets up and heads for the minifridge.\u003c/p\u003e\n\u003cp\u003eHe opens a bottle of water. Helping me to sit, he hands the bottle to me.\u003c/p\u003e\n\u003cp\u003eI still feel so weak. My limbs are like jelly. I lean back against the headboard and gratefully gulp the water.\u003c/p\u003e\n\u003cp\u003e“The doctor left you some medication to take once you’d stopped throwing up. You still feel sick?”\u003c/p\u003e\n\u003cp\u003eStill drinking from the bottle, I shake my head.\u003c/p\u003e\n\u003cp\u003eJake grabs a pill bottle from my bedside cabinet, opens it up, shakes two tablets out, and hands them to me.\u003c/p\u003e\n\u003cp\u003eI pop the pills in my mouth and quickly wash them down with water.\u003c/p\u003e\n\u003cp\u003eI gag at the harsh taste the pills leave on my tongue. “I hate taking pills.”\u003c/p\u003e\n\u003cp\u003e“Poor baby,” he soothes.\u003c/p\u003e\n\u003cp\u003e“Remind me never to eat prawns again.” Ugh, just the thought of them turns my stomach.\u003c/p\u003e\n\u003cp\u003eWhen the doctor arrived by seaplane a few hours after I’d started throwing up—dragged from his bed due to Jake’s incessant demands that I be seen by a doctor straightaway—he checked me over and concluded I had a mild case of food poisoning.\u003c/p\u003e\n\u003cp\u003eWe figured it was the prawns. Jake doesn’t like them, and they were the only thing he hadn’t eaten.\u003c/p\u003e\n\u003cp\u003e“Do you want me to have the chef fired?” he asks.\u003c/p\u003e\n\u003cp\u003eIf I thought he was joking, I’d say yes, but knowing Jake as I do, I know he would have the poor guy fired. I don’t want that to happen. It’s not his fault I ate a dodgy prawn.\u003c/p\u003e\n\u003cp\u003e“No.” I smile, and reaching my hand to his face, I rest it against his cheek.\u003c/p\u003e\n\u003cp\u003eClosing his eyes briefly, he presses a kiss to my wrist. “Do you want to try and get some more rest?”\u003c/p\u003e\n\u003cp\u003e“No, what I really want to do is get clean and brush my teeth. I feel skanky.”\u003c/p\u003e\n\u003cp\u003e“Skanky?” He grins, glancing at me through his dark lashes. “Do you just make these words up?”\u003c/p\u003e\n\u003cp\u003e“No.” I stick my tongue out at him. “You’ve just forgotten how to be British.”\u003c/p\u003e\n\u003cp\u003eWith a chuckle, he rises from the bed. “I’ll get the shower ready for you.”\u003c/p\u003e\n\u003cp\u003eJake disappears into the bathroom, leaving me sipping my water.\u003c/p\u003e\n\u003cp\u003eI rest my head against the headboard and close my eyes to the sound of the water turning on in the bathroom.\u003c/p\u003e\n\u003cp\u003eJake doesn’t want children.\u003c/p\u003e\n\u003cp\u003eIt’s like a whisper in my mind, coming from out of nowhere.\u003c/p\u003e\n\u003cp\u003eMy stomach clenches. I can’t think about that now. I’ll think about it later.\u003c/p\u003e\n\u003cp\u003eOne thing it does remind me to do is take my contraceptive pill. A pregnancy is not something I want happening right now. Or ever, as the case may be.\u003c/p\u003e\n\u003cp\u003eReaching down, I grab my bag off the floor and get my pill out.\u003c/p\u003e\n\u003cp\u003eI’m just swallowing it when Jake reappears from the bathroom. Moving across the hardwood floor, he comes over and takes the water bottle from my hand, putting it down.\u003c/p\u003e\n\u003cp\u003e“You ready for your shower?”\u003c/p\u003e\n\u003cp\u003e“Yep.” I slide my jelly legs to the side of the bed to stand, but before I get a chance, Jake picks me up, lifting me into his arms.\u003c/p\u003e\n\u003cp\u003e“I could have walked,” I say, resting my head against his chest.\u003c/p\u003e\n\u003cp\u003e“No point testing out the theory while I’m here to take care of you.”\u003c/p\u003e\n\u003cp\u003eJake steps into the huge double-headed shower and sits me down on the wide ledge at the far side.\u003c/p\u003e\n\u003cp\u003eThe steam from the water soothes me instantly.\u003c/p\u003e\n\u003cp\u003eJake hands me my toothbrush; it’s ready with toothpaste on it. Smiling at his preparation, I start to brush my teeth while he kneels before me and sets about removing my shorts and panties.\u003c/p\u003e\n\u003cp\u003eWhen I’ve finished brushing my teeth, I spit into the running water, rinsing my brush under the shower, and set it on the ledge beside me.\u003c/p\u003e\n\u003cp\u003eStanding, Jake leans down and takes hold of the hem of my vest and eases it up. I lift my heavy arms, allowing him to pull it over my head. He tosses it to the floor outside the shower, along with the rest of my clothes.\u003c/p\u003e\n\u003cp\u003eI see his eyes sweep over my naked body. And I don’t miss the erection he’s sporting when he removes his own shorts. Well, the size of it would be hard to miss.\u003c/p\u003e\n\u003cp\u003eI love that even sick, I can still turn him on.\u003c/p\u003e\n\u003cp\u003e“Even sick and skanky, I can still turn you on.” I smile up at him.\u003c/p\u003e\n\u003cp\u003e“Even sick and skanky,” he murmurs, cupping my face. Leaning down, he presses a soft kiss to my lips.\u003c/p\u003e\n\u003cp\u003eJake reaches for the sponge and shower gel and gently begins washing my skin. \u003c/p\u003e","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-3.html","bookId":1999,"creation":"Oct 5, 2019 6:31:55 PM","modification":"Oct 5, 2019 6:31:55 PM"}
