{"id":98083,"no":32,"title":"Page 32","content":"\u003cp\u003e“I don’t mean onstage,” Stuart says. “That’s the one place you can always guarantee Jake will be okay. I meant with the baby. Jake is one person I never figured for having kids. But that was before you. I thought he was happy when you came back into his life, but this, with your being pregnant, he’s like sickly happy.”\u003c/p\u003e\n\u003cp\u003e“You mean like you are with Josh.” I poke him in the ribs.\u003c/p\u003e\n\u003cp\u003e“Exactly.” He presses a kiss to my head. “Jake’s found his home. And I think…” He looks a little abashed. “Well, I think I might have found mine, chica.”\u003c/p\u003e\n\u003cp\u003eMy heart lifts. “That serious, huh?”\u003c/p\u003e\n\u003cp\u003e“I think so.”\u003c/p\u003e\n\u003cp\u003eI wrap my arms around his waist, hugging him.\u003c/p\u003e\n\u003cp\u003eI cannot wait to meet hot Dr. Josh at Jake’s party. I’m almost as excited about that as I am the party.\u003c/p\u003e\n\u003cp\u003e“You’re wanted, gorgeous.” Stuart lifts his arm from my shoulders, nudging me forward with his hip.\u003c/p\u003e\n\u003cp\u003eI look from Stuart straight ahead, to see Jake walking toward me, grinning, guitar slung around his back, gesturing for me to go to him with his outstretched hand.\u003c/p\u003e\n\u003cp\u003eNo bloody way. Not in a million years am I stepping out onstage in front of two thousand people.\u003c/p\u003e\n\u003cp\u003eI shake my head a firm no.\u003c/p\u003e\n\u003cp\u003eNarrowing those bright blue eyes on mine, he gets a look of determination.\u003c/p\u003e\n\u003cp\u003eI know that look. It’s the one that usually means he gets his own way.\u003c/p\u003e\n\u003cp\u003eRemoving my arms from around Stuart, I take a step back, readying for a quick escape, but Stuart catches the small of my back with his hand and gently pushes me forward, straight into Jake.\u003c/p\u003e\n\u003cp\u003eI give Stuart a “you’re in for it later” look. He starts laughing.\u003c/p\u003e\n\u003cp\u003eJake wraps a firm arm around my waist and steers me onstage.\u003c/p\u003e\n\u003cp\u003e“What are doing?” I hiss into his ear, stumbling on my heels.\u003c/p\u003e\n\u003cp\u003e“Showing off my girl,” he says, smiling down at me.\u003c/p\u003e\n\u003cp\u003eMy whole body is shaking. I daren’t look out at all the people. I can’t believe he’s brought me out here. I’m going to bloody kill him.\u003c/p\u003e\n\u003cp\u003eReaching the mike, Jake addresses the crowd. “I’m sure you all know my girl, Tru.” He gestures to me as some whistles and catcalls come from the audience. My knees start knocking together. “Say hello to LA’s finest, baby.” He looks at me expectantly.\u003c/p\u003e\n\u003cp\u003eSeeing no way out of this, I lift my hand and, like a complete twat, wave to two thousand strangers, mumbling hello into the mike.\u003c/p\u003e\n\u003cp\u003eA round of cheers and whistles comes from the crowd, and my face goes beet red.\u003c/p\u003e\n\u003cp\u003eHe is so fucking dead when I get him home.\u003c/p\u003e\n\u003cp\u003eMoving the mike back to him, Jake says, “We have another new song off the album that we’re going to perform now. Seeing as I wrote the song about my girl, I thought she should be up here the first time I sing it.”\u003c/p\u003e\n\u003cp\u003eMy head snaps around to him.\u003c/p\u003e\n\u003cp\u003eHe wrote a song about me?\u003c/p\u003e\n\u003cp\u003eJake meets my eyes, but I can’t read them.\u003c/p\u003e\n\u003cp\u003eI start to feel a weird sense of discomfort in my chest.\u003c/p\u003e\n\u003cp\u003eHe wrote a song for me because of what I said that night at the piano. Because I hadn’t heard his words for me in any of his other songs.\u003c/p\u003e\n\u003cp\u003eI don’t know whether to kiss him for the thoughtfulness or to cry because he wrote me a song out of pity.\u003c/p\u003e\n\u003cp\u003eOut of my peripheral, I see a couple of roadies bringing a small piano onstage. Jake leads me to the piano and hands off his guitar. The bench is big enough to seat us both, and Jake pulls me down to sit beside him. The good thing is he’s stage-facing, so at least I can hide a little behind his body.\u003c/p\u003e\n\u003cp\u003eI glance up at Denny behind the drum kit, and he gives me a knowing smile.\u003c/p\u003e\n\u003cp\u003eI give him a “you’re dead next after Jake and Stuart” look.\u003c/p\u003e\n\u003cp\u003eDenny chuckles, shaking his head at me.\u003c/p\u003e\n\u003cp\u003eI look back to Jake, just as he leans toward the fixed mike on the piano, and says, in that sexy, throaty voice of his, “Okay, this one is called ‘Everything Is You’…” He slides his eyes to me. “This one is all yours, baby.”\u003c/p\u003e\n\u003cp\u003ePressing down on the keys, Jake starts to play a gentle melody…\u003c/p\u003e\n\u003cp\u003eI saw her there, standing twenty feet away, feeling like we were still an ocean apart,\u003c/p\u003e\n\u003cp\u003eBut there was no turning back, she had to be mine,\u003c/p\u003e\n\u003cp\u003eKnew she’d be mine,\u003c/p\u003e\n\u003cp\u003eI brought her in, chased her for a while, until she broke down,\u003c/p\u003e\n\u003cp\u003eTell me you’re mine, that you’ll always be mine.\u003c/p\u003e\n\u003cp\u003eTake that chance with me,\u003c/p\u003e\n\u003cp\u003eI’ll let you down, I know,\u003c/p\u003e\n\u003cp\u003eBut I’ll fix it too, because everything is you,\u003c/p\u003e\n\u003cp\u003eEverything is you.\u003c/p\u003e\n\u003cp\u003eShe made her way to my bed, already soul deep inside me,\u003c/p\u003e\n\u003cp\u003e“It’s always been you,” I said. “The only one on my mind,”\u003c/p\u003e\n\u003cp\u003eBut still I got wild, I broke the rule,\u003c/p\u003e\n\u003cp\u003eShe left, taking everything with her.\u003c/p\u003e\n\u003cp\u003eTake that chance with me,\u003c/p\u003e\n\u003cp\u003eI’ll let you down, I know,\u003c/p\u003e\n\u003cp\u003eBut I’ll fix it too, because everything is you,\u003c/p\u003e\n\u003cp\u003eEverything is you.\u003c/p\u003e\n\u003cp\u003eLike a beggar I pleaded for my home,\u003c/p\u003e\n\u003cp\u003eWords were the only way I knew how,\u003c/p\u003e\n\u003cp\u003eLighting the sky with pink, she turned back and smiled,\u003c/p\u003e\n\u003cp\u003eI got you, baby, always mine, take me home.\u003c/p\u003e\n\u003cp\u003eEverything is you,\u003c/p\u003e\n\u003cp\u003eNo matter where we are, with you by my side, I can walk these weak white-lined streets blind,\u003c/p\u003e\n\u003cp\u003eYou’re my guide. My everything.\u003c/p\u003e\n\u003cp\u003eNow with that new beating heart inside, you’ve given me eternity,\u003c/p\u003e\n\u003cp\u003eForever is now. And everything is you.\u003c/p\u003e\n\u003cp\u003eIt’s the song he was playing at the piano that night.\u003c/p\u003e\n\u003cp\u003eHe didn’t write it because of what I said. He’d already written it.\u003c/p\u003e\n\u003cp\u003eThat’s why he wouldn’t play it for me that night. He wanted to surprise me.\u003c/p\u003e\n\u003cp\u003eMy eyes have not left him, and his have been on mine for most of the song.\u003c/p\u003e\n\u003cp\u003eMy teeth are biting down on my wobbly lip, eyes heavy with tears. For the whole time, it has felt like there is no one else in the theatre but Jake and me.\u003c/p\u003e\n\u003cp\u003eBut for me, there is no one but him. He is all I see, and all I have seen since I walked into that hotel room all those months ago.\u003c/p\u003e\n\u003cp\u003eThe song has touched me so deeply that, not caring where we are, the instant his fingers leave the keys, I grab his face, pulling him to me, and I kiss him with every fibre of my being.\u003c/p\u003e\n\u003cp\u003eJake’s hand goes around the back of my neck, fingers tangling in my hair, his tongue moving in my mouth, he kisses me back with everything he has.\u003c/p\u003e\n\u003cp\u003eI’m aware of the whistles and cheering around us, but I don’t care. All I care about is Jake. My lovely, sweet, beautiful Jake.\u003c/p\u003e\n\u003cp\u003eComing to, we break from each other, eyes locked, panting, Jake wearing that fuck-hot smile of his. I know exactly what he’s thinking. I also know exactly what he would be doing to me right now if this place were empty.\u003c/p\u003e\n\u003cp\u003e“You wrote me a song,” I whisper.\u003c/p\u003e\n\u003cp\u003eHe nods. “I wrote it a while ago. But I just made some recent changes to it.”\u003c/p\u003e\n\u003cp\u003eThe baby. The line at the end of the song.\u003c/p\u003e\n\u003cp\u003eNow with that new beating heart inside, you’ve given me eternity.\u003c/p\u003e\n\u003cp\u003eMy heart swells with happiness.\u003c/p\u003e\n\u003cp\u003eI never knew happiness existed like I have with Jake. I never, ever want to lose this feeling.\u003c/p\u003e\n\u003cp\u003eTurning to the mike, his voice decadent with sex, he says, “I think she likes the song. What do you guys say?”\u003c/p\u003e\n\u003cp\u003eTilting his head toward me, he grins, eyes alive, and the crowd goes wild.\u003c/p\u003e\n\u003cp\u003eI can’t stop the smile beaming on my face. All I want is for him to play the song again.\u003c/p\u003e\n\u003cp\u003eJake stands and offers me his hand. “Take a bow for your audience, baby.”\u003c/p\u003e\n\u003cp\u003eStanding beside him, I give a little curtsey, and the crowd’s cheers grow louder.\u003c/p\u003e\n\u003cp\u003eI even hear a whistle and cheer come from Tom. I glance at him and see he’s smiling.\u003c/p\u003e\n\u003cp\u003eI knew there was a romantic buried deep inside the man whore.\u003c/p\u003e\n\u003cp\u003eI grin at him, and instead of giving me a sarcastic look or comment like he normally would, he winks and smiles.\u003c/p\u003e\n\u003cp\u003eAs I turn to make my exit from the stage, Jake pulls back on my hand and whispers in my ear, “I meant every word of that song. You know that, right?”\u003c/p\u003e\n\u003cp\u003eLeaning back a fraction, I meet his eyes. “I know.”\u003c/p\u003e\n\u003cp\u003eAnd I do. I really and truly do know the depth of his feelings for me. Any tiny remaining doubt I may have had about Jake’s feelings for me disappeared with that song.\u003c/p\u003e\n\u003cp\u003eHe presses the side of his face to mine, cheek to cheek. I close my eyes, revelling in the feel of him, intoxicated by his special Jake scent.\u003c/p\u003e\n\u003cp\u003e“Straight to the limo after the set, sweetheart,” he murmurs, breath hot on my skin. Tingling sensations ripple down my body. “In it, on it, anywhere and any way I can have you.”\u003c/p\u003e\n\u003cp\u003eStepping back, I say, “The limo it is.” I give him a sexy smile and slink offstage, feeling more confident than I ever knew possible, to wait for my limo-sex date with my gorgeous, sexy Jake.\u003c/p\u003e\n\u003cp\u003eCHAPTER SEVENTEEN\u003c/p\u003e\n\u003cp\u003eYou promise you can’t see anything?”\u003c/p\u003e\n\u003cp\u003e“I can’t believe you’ve blindfolded me,” Jake complains.\u003c/p\u003e\n\u003cp\u003e“Makes a change, huh?” I whisper in his ear.\u003c/p\u003e\n\u003cp\u003eI feel him shiver.\u003c/p\u003e\n\u003cp\u003eSliding my hands down his arms, I slip my hands in his and lead him forward as I take a step back, closer to the door.\u003c/p\u003e\n\u003cp\u003eReleasing a hand, I reach back. Catching the handle, I open the door.\u003c/p\u003e\n\u003cp\u003eI guide him through the doorway.\u003c/p\u003e\n\u003cp\u003e“Okay.” I stand in front of him, taking a deep breath. “I wanted to give you your present before we go out for dinner, because it’s been killing me waiting all day as it is, and I didn’t want to wait any longer.”\u003c/p\u003e\n\u003cp\u003eThat’s only partly true. The other reason I wanted him to have it now is because we’ll be at the surprise party late into the night.\u003c/p\u003e\n\u003cp\u003e“I’m sure I’m going to love it, Tru,” he says.\u003c/p\u003e\n\u003cp\u003eCocking my head to the side, I say, “How do you know?” He can’t have seen it, because I just took it out of hiding and put it in here.\u003c/p\u003e\n\u003cp\u003eI peer close to his face, making sure he can’t see through the blindfold.\u003c/p\u003e\n\u003cp\u003eAs I near, his warm breath blows over my skin, igniting me. He smells so totally divine that I have the urge to kiss him.\u003c/p\u003e\n\u003cp\u003eWithout warning, he grabs my face and kisses me. I melt into him, wrapping my arms around his waist.\u003c/p\u003e\n\u003cp\u003eUnder my lips he says, “I know because I know you. Anything you get me I will love, because it came from you.”\u003c/p\u003e\n\u003cp\u003e“Smooth talker.”\u003c/p\u003e\n\u003cp\u003e“You bet your sweet ass I am. Now can I have my gift?”\u003c/p\u003e\n\u003cp\u003e“Okay, Mr. Impatient,” I say, laughing.\u003c/p\u003e\n\u003cp\u003eI free the blindfold from Jake’s eyes and stand beside him, watching with butterflies as he locks onto his present a few feet away.\u003c/p\u003e\n\u003cp\u003eHe takes a step closer. “Is that…is that my old Strat?” His voice sounds quiet.\u003c/p\u003e\n\u003cp\u003eHe turns to me.\u003c/p\u003e\n\u003cp\u003eI nod.\u003c/p\u003e\n\u003cp\u003e“How?” His mouth is open. “I—I thought it would have been long gone. I mean, after—”\u003c/p\u003e\n\u003cp\u003e“My dad kept it all these years.” I run my tongue over my dry lips. “You know what he’s like. He never could get rid of a guitar.”\u003c/p\u003e\n\u003cp\u003e“I—I…” He looks back at the guitar. Then he turns back to me, and I see the emotion on his face. It takes my breath away. “My mom wouldn’t let me take it…” He starts to tell me the story I already know. “…and everything had already been shipped to New York, and I thought I’d be able to take it on the plane with me, but she said I couldn’t and I had to leave it behind…”\u003c/p\u003e\n\u003cp\u003e“I remember.” I bite my lip. \u003c/p\u003e","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-32.html","bookId":1999,"creation":"Oct 5, 2019 6:31:55 PM","modification":"Oct 5, 2019 6:31:55 PM"}
