{"id":98055,"no":4,"title":"Page 4","content":"\u003cp\u003eThe feel of his hands on me is insanely arousing. I really wish I weren’t sick right now.\u003c/p\u003e\n\u003cp\u003e“This would have been so much easier if this villa had a bath,” I muse, thinking how nice it would have been to sit in a tub together. “But you do make a great nurse.”\u003c/p\u003e\n\u003cp\u003e“This is just an excuse so I can touch you,” he says, his voice sounding hoarse.\u003c/p\u003e\n\u003cp\u003e“You can touch me whenever you want,” I reply, voice serious.\u003c/p\u003e\n\u003cp\u003e“Mine,” he murmurs, sweeping a soapy hand between my legs, cupping my sex.\u003c/p\u003e\n\u003cp\u003eMy body instantly reacts. Desire pools between my legs. My mouth waters at the thought of tasting him. Even sick, I crave him.\u003c/p\u003e\n\u003cp\u003eAfter Jake is done cleaning every part of me, kneeling in front of me, he says, “I need to rinse you off and wash your hair, sweetheart, but these damn shower heads are fixed to the wall. Here, wrap your legs around my waist and put your arms around my neck and hold on tight.”\u003c/p\u003e\n\u003cp\u003eNot wanting to argue, knowing I probably could manage to stand—but honestly just enjoying the attention he’s lavishing on me—I do as he says.\u003c/p\u003e\n\u003cp\u003eJake stands with me wrapped around him like a koala bear and puts us both under the running water.\u003c/p\u003e\n\u003cp\u003eI feel so safe and loved here in his arms.\u003c/p\u003e\n\u003cp\u003eHe reaches for the shampoo bottle and begins washing my hair. The feel of his fingers on my scalp is like pure heaven.\u003c/p\u003e\n\u003cp\u003e“Tilt your head back under the water,” he instructs.\u003c/p\u003e\n\u003cp\u003eI do as told and let the water wash the shampoo away. Without even being asked, Jake applies conditioner to my hair, knowing my thick hair needs it.\u003c/p\u003e\n\u003cp\u003eHe combs the conditioner through my long hair to the ends with his fingers.\u003c/p\u003e\n\u003cp\u003e“I love you, totally and completely,” I say, looking at his perfect face. “Thank you for taking such good care of me.”\u003c/p\u003e\n\u003cp\u003e“No need to thank me, baby. I want to take care of you. I kind of love you totally and completely too, you know.” He gives me one of his trademark beautiful smiles. Not the one for his adoring fans. No, these smiles are reserved for me only. As he is. Mine, and mine alone.\u003c/p\u003e\n\u003cp\u003eHow did I ever get so lucky to get this beautiful man back in my life? He is everything that means perfect to me.\u003c/p\u003e\n\u003cp\u003e“I’m sorry I’m sick, spoiling our holiday,” I say.\u003c/p\u003e\n\u003cp\u003e“Hey.” He chucks my chin with his finger. “It’s not like you asked to be sick. I came here to spend time alone with you, sick or not. That’s what we’re doing, right?”\u003c/p\u003e\n\u003cp\u003e“Right,” I say with a smile. “You know…” I continue softly, adding a touch of seduction to my tone. “If I weren’t sick, I would so absolutely be on my knees right now, taking you in my mouth, sucking this water off you.”\u003c/p\u003e\n\u003cp\u003eI feel Jake tense, his grip on me tightening. “And I would have been so totally on board with that. When you’re better?”\u003c/p\u003e\n\u003cp\u003e“Absolutely.”\u003c/p\u003e\n\u003cp\u003eAfter our shower, Jake wraps me in a soft bath towel and carries me to the bedroom. He dries my skin with tenderness and precision, then dresses me in clean shorts and a vest and puts me back to bed and climbs in beside me.\u003c/p\u003e\n\u003cp\u003eSuddenly exhausted, I shuffle over, resting my head against his hard chest and closing my eyes. Jake’s arms wrap around me. Kissing my damp hair, he whispers, “Sleep, baby.”\u003c/p\u003e\n\u003cp\u003eAnd I do.\u003c/p\u003e\n\u003cp\u003eI wake to the sound of Jake’s hushed, angry voice coming from somewhere nearby.\u003c/p\u003e\n\u003cp\u003e“This is a fuckin’ joke. I can’t believe this even happened. What are we paying these fuckers for? Aren’t they supposed to notice shit like this early? I can’t believe it slipped through.”\u003c/p\u003e\n\u003cp\u003eThen I hear another male voice I don’t recognise.\u003c/p\u003e\n\u003cp\u003e“I know. I thought they were reliable. They’ve worked for us for years. Never missed a thing. I take full responsibility on this, Jake. I was the one who hired them.”\u003c/p\u003e\n\u003cp\u003e“No, it’s not your fault, Zane. It’s the shit who’s been skimming for the past six months. I swear, when I get my hands on that fucker…”\u003c/p\u003e\n\u003cp\u003eGlancing around, I see it’s 7:30 a.m. on the clock. I can’t believe how long I’ve slept.\u003c/p\u003e\n\u003cp\u003eFeeling a whole lot better than yesterday, and wanting to find out what’s making Jake so angry, I climb out of bed and make my way to the living room.\u003c/p\u003e\n\u003cp\u003eI find him sitting at the dinner table, taking a video call on his laptop.\u003c/p\u003e\n\u003cp\u003eHe looks up, his face taut, his eyes piercing blue, but they instantly soften.\u003c/p\u003e\n\u003cp\u003eZane is still talking. “The accountant is still working on getting the exact amount, but he figures it sits around five hundred. When he gets back to me, I’ll call you straightaway.”\u003c/p\u003e\n\u003cp\u003eI see Jake’s jaw tighten. His eyes flicker from mine back to the screen. “Okay. I’ll speak to you later.”\u003c/p\u003e\n\u003cp\u003eJake closes the laptop. “What are you doing out of bed?” he asks in a soft voice. Much softer than the tension lines around his eyes.\u003c/p\u003e\n\u003cp\u003e“I missed you.” Padding across the floor, I walk over to him.\u003c/p\u003e\n\u003cp\u003eHe pushes his chair back, allowing me to climb in his lap. I snuggle my head into his chest. He smells of everything Jake—shower gel, cigarettes, and mint. I never thought I could love such a combination until him. But then I didn’t think I was capable of a lot of things until Jake.\u003c/p\u003e\n\u003cp\u003e“How are you feeling?” he asks.\u003c/p\u003e\n\u003cp\u003e“Better than I did.”\u003c/p\u003e\n\u003cp\u003e“Are you hungry?”\u003c/p\u003e\n\u003cp\u003eI shake my head. The thought of food still makes me want to gag.\u003c/p\u003e\n\u003cp\u003e“Baby”—he presses a kiss to the top of my head, his hot breath blowing through my hair—“it’s been ages since you last ate; you really should try something. How about some toast?”\u003c/p\u003e\n\u003cp\u003eI tilt my head back, looking at his face. “Are you going to bug me until I eat something?”\u003c/p\u003e\n\u003cp\u003e“It’s quite likely.”\u003c/p\u003e\n\u003cp\u003e“Okay,” I say with a sigh. “I’ll try some toast.”\u003c/p\u003e\n\u003cp\u003eJake picks his phone up off the table and calls through to the restaurant.\u003c/p\u003e\n\u003cp\u003eAfter eating breakfast on the terrace, Jake and I go down to the beach for a walk. The food has perked me up a bit.\u003c/p\u003e\n\u003cp\u003eI know he still has the call with Zane on his mind. He was notably quiet over breakfast, and he still is now.\u003c/p\u003e\n\u003cp\u003eI figure it’s something to do with the label. Something is going on there, and I want to know what.\u003c/p\u003e\n\u003cp\u003e“Are you ever going to tell me what that video call was about?”\u003c/p\u003e\n\u003cp\u003eJake’s hand tightens around mine. “It was nothing.”\u003c/p\u003e\n\u003cp\u003e“Jake…,” I push.\u003c/p\u003e\n\u003cp\u003e“Look, it’s nothing big. We’ll talk about it later. You’re only just recovering from food poisoning, and we’re still on vacation.”\u003c/p\u003e\n\u003cp\u003eStopping him, I come around and stand before him, wrapping my arms around his waist.\u003c/p\u003e\n\u003cp\u003eI tilt my head, looking up at him. “Nothing big, right? So why did you sound majorly pissed off when you were taking to that Zane guy?”\u003c/p\u003e\n\u003cp\u003e“I always sound pissed off when talking to the staff,” he says with a grin.\u003c/p\u003e\n\u003cp\u003e“Stop it,” I snap, taking a step back.\u003c/p\u003e\n\u003cp\u003eHis brow furrows. “Stop what?”\u003c/p\u003e\n\u003cp\u003e“Stop shutting me out, Jake. I wish you would just talk to me. Tell me when something is going on. I might actually be able to help.”\u003c/p\u003e\n\u003cp\u003eMoving closer, he rests his arms on my shoulders, running his fingers into my hair. “I’m not trying to shut you out. I just don’t want you worrying about unnecessary things. There’s no point when I have a handle on it.”\u003c/p\u003e\n\u003cp\u003e“I worry more when I don’t know what’s going on. My imagination takes over, and you know how wild that can run.”\u003c/p\u003e\n\u003cp\u003e“I do,” he says tenderly, running his thumb down my cheek.\u003c/p\u003e\n\u003cp\u003e“Look, Jake, I just don’t want…” I let out a sigh. “I just don’t want things getting too hard for you, and for you to then…fall off the wagon, and for us to end up back where we did in Boston.”\u003c/p\u003e\n\u003cp\u003eHis body stiffens. His eyes darken. “It won’t happen again. I already told you that. I’m not losing you again. I can’t.”\u003c/p\u003e\n\u003cp\u003e“I know. And I believe in you, I do. I just know I’d feel a whole lot better if you shared more with me, instead of keeping me out of the loop. I know you’re doing what you think is best for me, but you are what’s best for me—you happy and healthy.”\u003c/p\u003e\n\u003cp\u003eHe leans down, hands holding my face, and presses his forehead against mine, closing his eyes.\u003c/p\u003e\n\u003cp\u003eFor a moment, I stay still, just listening to his deep, contented breaths.\u003c/p\u003e\n\u003cp\u003eSometimes I feel like Jake breathes through me. Because of me. That I’m the air he needs. And I breathe in the knowledge of his contentment within me.\u003c/p\u003e\n\u003cp\u003e“Someone’s been stealing money from the company.”\u003c/p\u003e\n\u003cp\u003e“What!” I lean back from him, air whooshing out of my lungs.\u003c/p\u003e\n\u003cp\u003eJake sighs, then, taking my hand, he encourages me to sit down beside him on the sand.\u003c/p\u003e\n\u003cp\u003e“Someone’s been skimming for the past six months. And it’s not the money, Tru,” he says, exhaling. “I can take the hit for the cash. It’s just the fact that someone has fuckin’ stolen from me. Stolen from what Jonny and I created.” He drags a hand through his hair. “It just feels like they’re pissing on his memory, you know?” He shrugs, then his shoulders hang heavily forward.\u003c/p\u003e\n\u003cp\u003eThe pain in his voice slices through me.\u003c/p\u003e\n\u003cp\u003eI hate that after everything Jake has been through in his life, just when things are getting straight for him, someone does this to him. Anger burns in me, but I hide it. I don’t want him to know it’s affecting me. I want him to keep talking to me.\u003c/p\u003e\n\u003cp\u003e“I know, baby,” I say, taking his hand, trying to ease his pain and frustration. “Do you have any idea who it might be?”\u003c/p\u003e\n\u003cp\u003e“Not yet,” he says with a shake of his head. “We’re keeping this on the down low, not letting the staff know, so we can catch the fucker out. With Zane on the case, it won’t be long before we know. That guy could sniff out shit in a garbage dump.”\u003c/p\u003e\n\u003cp\u003e“Who is Zane?” I ask.\u003c/p\u003e\n\u003cp\u003eHe glances at me, confused. “Zane Fox. He’s the VP at the label.”\u003c/p\u003e\n\u003cp\u003eHow do I not know this? I should know this. I’m soon going to marry this man, and I know so little about his business and the people who work for him. The knowledge makes me feel like crap.\u003c/p\u003e\n\u003cp\u003e“How long has Zane worked for you?” I trace my fingertip over his rough, calloused fingers.\u003c/p\u003e\n\u003cp\u003e“From the start. Jonny and I hired him when we set up the label. This is stinging him as much as it is me.”\u003c/p\u003e\n\u003cp\u003eOkay, mental note. Spend time getting to know Jake’s employees better. Except the one who’s ripping him off. That one I’ll happily kick the shit out of.\u003c/p\u003e\n\u003cp\u003e“You definitely think he’ll be able to get to the bottom of the theft without you there?”\u003c/p\u003e\n\u003cp\u003e“Yes.” He digs a finger into the sand and draws a deep line in it.\u003c/p\u003e\n\u003cp\u003eHe doesn’t sound sure. I don’t think it’s because he lacks confidence in Zane. I think it’s because he feels like he’s somehow failing Jonny by letting this happen in the first place. He’s not there now sorting it because he’s here with me.\u003c/p\u003e\n\u003cp\u003eHe’s been so tied up lately with me, with us, that his mind has been off his business. I know right now his loyalty is torn between me and his company.\u003c/p\u003e\n\u003cp\u003eI hate that more than I can express.\u003c/p\u003e\n\u003cp\u003e“We’re going back to LA,” I say. \u003c/p\u003e","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-4.html","bookId":1999,"creation":"Oct 5, 2019 6:31:55 PM","modification":"Oct 5, 2019 6:31:55 PM"}
