{"id":98097,"no":46,"title":"Page 46","content":"\u003cp\u003e“See, that was quite funny.” Dave chuckles. “You’re getting there.”\u003c/p\u003e\n\u003cp\u003eI touch my head where my scar is. “The only way to get through the bad stuff is to laugh about it, right?”\u003c/p\u003e\n\u003cp\u003e“Right.”\u003c/p\u003e\n\u003cp\u003eI listen as he flicks through the radio stations.\u003c/p\u003e\n\u003cp\u003e“Go back to one,” I tell him.\u003c/p\u003e\n\u003cp\u003eDave jumps back a station, and Jake’s voice fills up the car.\u003c/p\u003e\n\u003cp\u003e“Through It All,” the song he sang for me in Copenhagen, the first night we slept together.\u003c/p\u003e\n\u003cp\u003eI always think of that night as the start of Jake and me, but in truth we started a long time ago. We started the very first moment we laid eyes on each other through our shared garden fence all those years ago.\u003c/p\u003e\n\u003cp\u003eIt just took us a long time to get there.\u003c/p\u003e\n\u003cp\u003eCHAPTER TWENTY-FIVE\u003c/p\u003e\n\u003cp\u003eAs Jake’s song ends, I feel the car come to stop.\u003c/p\u003e\n\u003cp\u003eMy door opens. “You look beautiful.”\u003c/p\u003e\n\u003cp\u003eI can’t help smiling at Jake’s words.\u003c/p\u003e\n\u003cp\u003e“I’d say the same to you, but it’d help if I could see.” I tap my finger against the ever-present blindfold.\u003c/p\u003e\n\u003cp\u003e“Oh, you know me, baby. I always look hot.”\u003c/p\u003e\n\u003cp\u003eI laugh.\u003c/p\u003e\n\u003cp\u003e“Come on.” I feel his hands take hold of mine, and he guides me out of the car.\u003c/p\u003e\n\u003cp\u003eI step out into the warm late-afternoon air. The ground is hard under my feet, but I’m definitely on grass. Jake slips his arm around my waist and guides me on.\u003c/p\u003e\n\u003cp\u003eThe sound of running water hits my ears.\u003c/p\u003e\n\u003cp\u003eI think I know where I am.\u003c/p\u003e\n\u003cp\u003eI bite down on the smile the thought brings so Jake doesn’t know I’ve figured it out. I know how important the actual surprise is to him.\u003c/p\u003e\n\u003cp\u003eAfter less than a minute of walking, Jake stops me. I feel him move behind me and undo the blindfold. I hold my breath in anticipation of whether I’m right or not.\u003c/p\u003e\n\u003cp\u003eHoly shit.\u003c/p\u003e\n\u003cp\u003eMy breath comes out in a rush.\u003c/p\u003e\n\u003cp\u003eYes, I’m at Lumb Falls, but this is…wow. Just bloody wow.\u003c/p\u003e\n\u003cp\u003eNo more than fifty feet before me, on the bank overlooking the falls, is a wooden structure that could only be described as an altar.\u003c/p\u003e\n\u003cp\u003eThere are fairy lights woven around it, intricate with white and pink flowers, dressing it up to beautiful.\u003c/p\u003e\n\u003cp\u003eDozens of lanterns hang from the nearby trees. A couple of rows of chairs are set on both sides, and down the middle is an aisle covered with pink and white rose petals.\u003c/p\u003e\n\u003cp\u003eI turn to Jake, my mouth wide in awe and wonder. “Wha…I…you did all of this?”\u003c/p\u003e\n\u003cp\u003eHis mouth lifts at the corner as he pushes his hands into his jeans pockets. He shrugs lightly. “I want to marry you, Tru.” He takes a step closer to me. My heart starts to thump. “But if I’ve got this all wrong and today’s not that day—that this isn’t how you saw us getting married—then that’s okay, I’ll wait. If you want a big church wedding, then I want that too. I just want you, any way I can have you. But today…well, I at least wanted to try and see if my girl would marry me in our special place. The girl who, twenty-four years ago to the day, stepped into my life with her big brown eyes, her hair in pigtails, sucking on a lollipop as she stared across at me through the garden fence and said, ‘I’m Trudy, you want a lollipop?’”\u003c/p\u003e\n\u003cp\u003eI let out a laugh as tears fill my eyes, realising what today’s date is: August 31. The day Jake and I met.\u003c/p\u003e\n\u003cp\u003e“So have I got this right? Is today that day?” he asks, cupping his hands around my face.\u003c/p\u003e\n\u003cp\u003e“Yes,” I breathe, leaning forward, pressing my lips to his. “Yes, it is.”\u003c/p\u003e\n\u003cp\u003eI touch his face with my hands. My beautiful Jake.\u003c/p\u003e\n\u003cp\u003eI can’t believe he has done all of this without my knowing. I seriously had no clue this was going on at all.\u003c/p\u003e\n\u003cp\u003eExcitement bubbles up inside me.\u003c/p\u003e\n\u003cp\u003eWe’re getting married today!\u003c/p\u003e\n\u003cp\u003eI look down at my jeans and T-shirt, which has a stain on it from where JJ spit up earlier.\u003c/p\u003e\n\u003cp\u003eI’m definitely not dressed to get married.\u003c/p\u003e\n\u003cp\u003eI don’t even know if I’ve got a dress with me that I could get married in. I start doing a quick mental run-through of the things I brought with me.\u003c/p\u003e\n\u003cp\u003eNope, definitely nothing wedding-worthy.\u003c/p\u003e\n\u003cp\u003e“Jake, I love all of this, and I so want to marry you right now.” My lips turn down at the corners. “But I’m not exactly dressed to get married, and I don’t have anything I could wear. I could go to the shops in Manchester and pick up a dress real quick, I suppose, but then—”\u003c/p\u003e\n\u003cp\u003e“Tru, stop talking.” He presses his fingers over my lips. “Do you really think I would bring you here and expect you to get married in jeans?” He lets out a soft laugh as he tilts his head back, looking to the left, past the altar. I follow his gaze, but I can’t see anything beyond the trees.\u003c/p\u003e\n\u003cp\u003e“Through those trees, we’ve set up a place for you to get ready. Everything you’ll need is in there, including Simone, who’s waiting for you. And when you’re ready”—he looks back at me and caresses my cheek with his hand—“I’ll be out here, waiting at the altar for you. Your mum and dad are on their way with JJ. Stuart, Ben, and Dave are already here. Tom, Den, Josh, Smith, Carly, my mom, Dale, and Vicky are all arriving soon.”\u003c/p\u003e\n\u003cp\u003e“Vicky’s coming?” I beam. I haven’t seen her in so long. Jake told me that she came while I was unconscious in the hospital, and we’ve Skyped since I woke up, but it’s not the same as seeing her in person.\u003c/p\u003e\n\u003cp\u003e“She is.”\u003c/p\u003e\n\u003cp\u003eI press my face into his hand. “I can’t believe you did all of this under the radar. How did I not know about all of this?”\u003c/p\u003e\n\u003cp\u003e“It wasn’t easy. You’re nosey as hell.” He rests the tip of his nose against mine. “But I wanted this to be a surprise, and I wanted our wedding private. No press. Just you, me, JJ, and the people we love.”\u003c/p\u003e\n\u003cp\u003e“I love you.”\u003c/p\u003e\n\u003cp\u003e“And I love you. Now go and get your hot ass ready so I can marry it,” he says, giving my behind a gentle slap.\u003c/p\u003e\n\u003cp\u003eHe kisses my lips once, then steers me off in the direction of where Simone is.\u003c/p\u003e\n\u003cp\u003eI walk past the altar, through the trees. In a clearing is a tall camping tent, the kind you can stand up in and fit a small family to sleep. It’s white. Perfect for a wedding.\u003c/p\u003e\n\u003cp\u003eThe door on it is tied open, and I can see Simone inside, sitting on a stool as she tinkers on her phone, by a table filled with what looks to be makeup.\u003c/p\u003e\n\u003cp\u003eShe looks up, and when she sees me, a huge smile appears on her face. She puts her phone down and comes out to meet me.\u003c/p\u003e\n\u003cp\u003e“You’re getting married!” she sings.\u003c/p\u003e\n\u003cp\u003e“Apparently so,” I say with a grin. “How long have you know about this?”\u003c/p\u003e\n\u003cp\u003e“A little while.” She grins sheepishly. “From the minute I moved to LA, Jake’s had me shopping for everything you need. He even asked me to pick out a wedding dress for you.”\u003c/p\u003e\n\u003cp\u003eI can tell from her face that Jake’s asking her meant a lot. It means a lot to me too.\u003c/p\u003e\n\u003cp\u003e“You pick something good for me?” I tease, poking her in the ribs.\u003c/p\u003e\n\u003cp\u003e“Of course.” She gives me a look of mock-offence. “I snuck a look at the dresses you’d highlighted in your wedding magazines that Jake gave me, and I bought the three that had hearts next to them. I know what a geek you are. You only heart things when you really love them. You’ve been doing it for years in our Next catalogue, so I figured I couldn’t go wrong.”\u003c/p\u003e\n\u003cp\u003eI didn’t even know she knew I did that. I hadn’t really registered it as a thing I do.\u003c/p\u003e\n\u003cp\u003e“Very sneaky. I’m impressed.” I grin at her.\u003c/p\u003e\n\u003cp\u003eShe gives a little curtsy. “I have everything in here you’ll need—wedding dresses, of course, shoes, veils, tiaras, makeup…underwear.” She winks. “It’s like your very own personal bridal shop.”\u003c/p\u003e\n\u003cp\u003e“In a tent.”\u003c/p\u003e\n\u003cp\u003eShe meets my eyes and laughs.\u003c/p\u003e\n\u003cp\u003e“I love it, really,” I say, wrapping my arm around her waist. I give her a gentle squeeze.\u003c/p\u003e\n\u003cp\u003eI peer inside the tent, and I can see she really has thought of everything, and it’s all laid out for me. I spy a pale pink dress amidst the flashes of white hanging on a rail. It causes excitement to ripple in my stomach.\u003c/p\u003e\n\u003cp\u003e“You’re still going to be my bridesmaid, right?”\u003c/p\u003e\n\u003cp\u003e“Of course, already got my dress.” She nudges me with her hip, grinning.\u003c/p\u003e\n\u003cp\u003e“Good.”\u003c/p\u003e\n\u003cp\u003e“Come on, then.” She links her arm through mine. “Let’s get you ready to become Mrs. Wethers.”\u003c/p\u003e\n\u003cp\u003eI look at my reflection in the mirror. I’m ready to marry the man I love. But then, I’ve been ready to marry Jake for a very long time.\u003c/p\u003e\n\u003cp\u003eSimone got me ready. She did my makeup, keeping it natural, with soft pink on my eyes, mascara, and gloss on my lips. She left my hair down. Thankfully it was already clean and curly, so she pinned some tiny diamante flowers in, pulling a few strands back from off my face.\u003c/p\u003e\n\u003cp\u003eFor jewellery, I’m wearing my Tiffany locket and earrings, my charm bracelet, my beautiful engagement ring, of course. But most importantly, I’m wearing my friendship bracelet.\u003c/p\u003e\n\u003cp\u003eBut the prizewinner is the dress.\u003c/p\u003e\n\u003cp\u003eI knew right away out of the three which one I was wearing. It was the one I had been leaning toward all along when I was looking at wedding dresses.\u003c/p\u003e\n\u003cp\u003eIt’s a Jenny Packham gown, white and floaty, with a deep V-neck and crystal beading decorating the waist and shoulder and framing the open back. It’s beautiful and the perfect dress to become Mrs. Jake Wethers in.\u003c/p\u003e\n\u003cp\u003eI can’t believe I’m getting married today, here at Lumb Falls. It’s so surreal that I have to keep pinching myself. It’s so incredibly perfect. I can’t believe I didn’t think of getting married here myself.\u003c/p\u003e\n\u003cp\u003eThen Jake is always one step ahead of me, and everyone else. That’s what makes him…him.\u003c/p\u003e\n\u003cp\u003e“Hey, baby girl.”\u003c/p\u003e\n\u003cp\u003eI turn at the sound of my dad’s voice. The voice that can always bring a smile to my lips no matter what—not that I need any help today. “Hey, Daddy.” I smile, turning.\u003c/p\u003e\n\u003cp\u003e“You look…” He takes a step toward me, arms out. “You look beautiful, Tru.” I can see the pride swelling up his eyes.\u003c/p\u003e\n\u003cp\u003e“You look real handsome, Daddy.” I take a step closer to him and brush a piece of lint off his jacket. He’s wearing a dark grey suit, white shirt, and pale pink tie.\u003c/p\u003e\n\u003cp\u003e“Is Mama still crying?” I ask.\u003c/p\u003e\n\u003cp\u003e“Of course.” He smiles.\u003c/p\u003e\n\u003cp\u003eMama came in to see me while I was getting ready, and she kept bursting into tears. Happy tears thankfully. Since the accident, Mama seems to have changed her whole attitude toward Jake. They’ve bonded on some level. And she’s completely besotted with JJ, of course, which helps.\u003c/p\u003e\n\u003cp\u003e“You ready to go out there and get married?”\u003c/p\u003e\n\u003cp\u003e“I am. Just let me get my flowers.” I pick up the small bouquet that Stuart brought me a short while ago. It’s amazing: pale pink roses with two dark pink roses pressed together in the middle. Like they’re meant to represent Jake and me.\u003c/p\u003e\n\u003cp\u003e“How’s Jake doing?” I ask, turning back to him.\u003c/p\u003e\n\u003cp\u003e“He’s good. Surprisingly calm for a man about to get married.”\u003c/p\u003e\n\u003cp\u003e“And JJ?”\u003c/p\u003e\n\u003cp\u003e“Currently asleep on Jake’s shoulder.”\u003c/p\u003e\n\u003cp\u003eI let out a laugh. “Knowing JJ, he’ll probably sleep through the entire wedding. Not that he’d remember it if he was awake.” \u003c/p\u003e","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-46.html","bookId":1999,"creation":"Oct 5, 2019 6:31:55 PM","modification":"Oct 5, 2019 6:31:55 PM"}
