{"id":98057,"no":6,"title":"Page 6","content":"\u003cp\u003eHe shifts his hips, and I can feel that he’s still semihard inside me.\u003c/p\u003e\n\u003cp\u003e“You’re not done?” I push back against him, smiling.\u003c/p\u003e\n\u003cp\u003e“I’ve not even started. I’ve gone two days without being inside you.” His arm comes around my waist. Sliding out of me, he spins me around to face him, yanking me up hard against his body. “I intend to make up on that time and spend the rest of the day inside you, fucking you senseless, until neither of us can walk.”\u003c/p\u003e\n\u003cp\u003e“Is that a promise?”\u003c/p\u003e\n\u003cp\u003e“You bet your sweet ass it is,” he growls as he picks me up and throws me down onto the bed, climbing on top of me.\u003c/p\u003e\n\u003cp\u003eCHAPTER THREE\u003c/p\u003e\n\u003cp\u003eI look down at the lights of LA as the jet heads for LAX.\u003c/p\u003e\n\u003cp\u003eJake is sleeping beside me. I reach over and brush his fallen hair off his forehead. He looks so peaceful. I hate to wake him, but we’ll be coming in to land soon.\u003c/p\u003e\n\u003cp\u003eI glance down at my friendship bracelet on his wrist. Shifting it aside, I see where his skin is lighter underneath, where it’s been hidden from the sun. The same as mine. We never take them off—a promise made to each other to always wear the reminder of our childhood connection—the bracelets I made for us both all those years ago.\u003c/p\u003e\n\u003cp\u003eI can’t believe our holiday is over. The best holiday of my life. Now we’re heading back to reality.\u003c/p\u003e\n\u003cp\u003eWell, Jake’s reality.\u003c/p\u003e\n\u003cp\u003eWhich is so far from any reality I could have ever imagined.\u003c/p\u003e\n\u003cp\u003eAn ordinary girl in a far-from-ordinary world.\u003c/p\u003e\n\u003cp\u003eI wish we could have stayed on the island indefinitely, because I have a feeling that coming back here means things are about to get very real, very quickly.\u003c/p\u003e\n\u003cp\u003eCurving my fingertips around Jake’s ear, I tickle the sensitive skin behind it. The spot that drives him crazy when I kiss him there.\u003c/p\u003e\n\u003cp\u003eHe catches my wrist, surprising me. “Don’t start something you can’t win,” he says with a sexy growl to his voice.\u003c/p\u003e\n\u003cp\u003e“Who says I can’t win?”\u003c/p\u003e\n\u003cp\u003e“Me.”\u003c/p\u003e\n\u003cp\u003e“That right?”\u003c/p\u003e\n\u003cp\u003e“Hmm.” He moves in closer, revealing his stunningly blue eyes. “You forget I know exactly where all of your sensitive spots are, Bennett.”\u003c/p\u003e\n\u003cp\u003eHeat floods me and I squirm. “I thought you were asleep.”\u003c/p\u003e\n\u003cp\u003e“I was until some little minx started tickling me.”\u003c/p\u003e\n\u003cp\u003e“Minx?” I let out a laugh.\u003c/p\u003e\n\u003cp\u003e“Yep, that’s you. A minx. Cunning and flirtatious.”\u003c/p\u003e\n\u003cp\u003e“Flirtatious?” I scoff.\u003c/p\u003e\n\u003cp\u003e“Yep, flirtatious and irresistible.”\u003c/p\u003e\n\u003cp\u003e“Meant for you,” I add.\u003c/p\u003e\n\u003cp\u003e“Fucking right, meant for me.”\u003c/p\u003e\n\u003cp\u003eHis gaze pins me to the seat, possessing me, owning me.\u003c/p\u003e\n\u003cp\u003eHolding back a gulp, I say, “Well, python, we’re home.” A light smile settles on my lips.\u003c/p\u003e\n\u003cp\u003eHome.\u003c/p\u003e\n\u003cp\u003eLA is my home now. It feels strange to say.\u003c/p\u003e\n\u003cp\u003eThe last time I was in LA, the story of Jake’s dad had just broken in the news.\u003c/p\u003e\n\u003cp\u003eI shudder at the memory.\u003c/p\u003e\n\u003cp\u003eJake sits up in his seat, stretching his legs out, his arms go over his head, then one comes down to rest on my shoulder, pulling me to him. “You okay?” he asks.\u003c/p\u003e\n\u003cp\u003e“Yeah, just wishing we’d had longer together on the island.”\u003c/p\u003e\n\u003cp\u003e“Me too,” he murmurs, resting his chin on the top of my head. “We’ll go back there again one day real soon.”\u003c/p\u003e\n\u003cp\u003e“We could take our honeymoon there,” I suggest, optimism filling me, as I look up at him.\u003c/p\u003e\n\u003cp\u003e“That’s a great idea.” He smiles.\u003c/p\u003e\n\u003cp\u003e“Guess I need to start planning our wedding, then…or did you want a long engagement?” I bite my lip.\u003c/p\u003e\n\u003cp\u003e“Fuck no! Baby, we can get married tomorrow if you want. You just say the word and I’ll tell the pilot to take us to Vegas.”\u003c/p\u003e\n\u003cp\u003eI let out a laugh. “My mother would have a seizure if I got married in Vegas, and my dad would kick your ass for taking away his chance to walk his only child down the aisle.”\u003c/p\u003e\n\u003cp\u003e“Point taken. I really don’t want an ass-kicking from Billy.”\u003c/p\u003e\n\u003cp\u003e“Where do you want to get married? Here or the UK?”\u003c/p\u003e\n\u003cp\u003e“I don’t mind.” He shrugs. “I guess it would be easier to get married here because we live here, but honestly the choice is yours. If you want to get married in Manchester, it’s cool with me. You just tell me the time and the place, baby, and I’ll be there.”\u003c/p\u003e\n\u003cp\u003e“Am I to take it you’ll be having absolutely no input in this wedding whatsoever?”\u003c/p\u003e\n\u003cp\u003e“Of course I will,” he says, grinning. “I’ll be organising my bachelor party. No, scrap that. I promised Tom he could do it.”\u003c/p\u003e\n\u003cp\u003eTom is the bassist in TMS, one of Jake’s closest friends, and renowned player. The same as Jake was before we got together, but now he’s with me and that’s all behind him. Thankfully.\u003c/p\u003e\n\u003cp\u003e“Oh God,” I groan. “It’ll be a shagfest, filled with lap dancers and hookers. I’m envisioning Hangover 2 right now.”\u003c/p\u003e\n\u003cp\u003eJake laughs. “Ah, give him some credit, baby. It won’t be that bad.”\u003c/p\u003e\n\u003cp\u003e“If you turn up with a tattoo on your face, telling me you’ve shagged a lady boy, I’m definitely not marrying you.”\u003c/p\u003e\n\u003cp\u003eHe fixes me with a stare. “Sweetheart, if I have to tell you I shagged a lady boy, I’ll be telling you from prison.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“Because I’ll have fuckin’ killed Tom for letting it happen.”\u003c/p\u003e\n\u003cp\u003eWe both start laughing, as the pilot comes on the intercom to tell us to buckle up because we’re coming in to land.\u003c/p\u003e\n\u003cp\u003eDave pulls into the drive outside Jake’s house. I mean our house. I still haven’t gotten used to saying that. And I would never say this to Jake, but it doesn’t feel like my house.\u003c/p\u003e\n\u003cp\u003eBecause, well, I kind of hate his house…okay, maybe hate’s too strong a word.\u003c/p\u003e\n\u003cp\u003eI intensely dislike Jake’s house.\u003c/p\u003e\n\u003cp\u003eDon’t get me wrong, it’s beautiful. Not overly flashy. Modern. It has three bedrooms, three bathrooms, a music studio, and a gym.\u003c/p\u003e\n\u003cp\u003eBut it’s a bachelor pad. And that’s the problem.\u003c/p\u003e\n\u003cp\u003eIt was Jake’s bachelor pad that he brought countless women back to.\u003c/p\u003e\n\u003cp\u003eGod, just thinking about it makes me want to hurl.\u003c/p\u003e\n\u003cp\u003eI’ve never had sex with Jake at his house before. During the short stay we had here between tour dates, sex wasn’t exactly on either of our minds.\u003c/p\u003e\n\u003cp\u003eBut now I live here, and Jake’s going to want to have sex—a lot—and I know I’ll be thinking of the countless other women here before me. In Jake’s house. In his bed.\u003c/p\u003e\n\u003cp\u003eThe bed that I’m going to share with him.\u003c/p\u003e\n\u003cp\u003eI hate that more than I can express.\u003c/p\u003e\n\u003cp\u003eUgh.\u003c/p\u003e\n\u003cp\u003eI know I’m being overly sensitive, and I know Jake has never lived here with a woman before. That counts for something.\u003c/p\u003e\n\u003cp\u003eThis is his home. My home now. I’m going to have to get used to it.\u003c/p\u003e\n\u003cp\u003eHow? I’m not entirely sure, because currently I feel like the memory of his old life lingers like a bad smell when I’m in his house.\u003c/p\u003e\n\u003cp\u003eMy house.\u003c/p\u003e\n\u003cp\u003eCrap.\u003c/p\u003e\n\u003cp\u003eI really need to get used to referring to it as “my house,” otherwise Jake will notice, and I don’t want to upset him. I don’t need to be stirring up any of my issues with his past.\u003c/p\u003e\n\u003cp\u003e“Just drop the cases in the hall and get yourselves home,” Jake says to Dave and Ben, unlocking the front door, letting me in first.\u003c/p\u003e\n\u003cp\u003eI see the light is on in the kitchen, and hoping that one of my favourite people in the world is here, I say good-bye to Dave and Ben and head straight for the kitchen.\u003c/p\u003e\n\u003cp\u003e“Chica!” Stuart beams at me as I enter through the archway. “Aren’t you just a sight for sore eyes? Look at you, all tanned and beautiful. What I wouldn’t give for your colouring.”\u003c/p\u003e\n\u003cp\u003e“The perks of having a Puerto Rican mother.” I walk into his open embrace, planting a kiss on his cheek. “I missed you.”\u003c/p\u003e\n\u003cp\u003e“What? You had time to miss me? You’re telling me the infamous snake over there didn’t keep you busy while you were away?” Stuart nods in Jake’s direction. Jake is leaning against the archway, watching us.\u003c/p\u003e\n\u003cp\u003eHis face looks blank. Sometimes I have a hard time assessing Jake’s mood. It’s only his eyes that have the ability to give him away. Not this time, though.\u003c/p\u003e\n\u003cp\u003e“Oh, he kept me plenty busy.” I share a secret smile in Jake’s direction, one that flickers in his eyes, bringing them to life.\u003c/p\u003e\n\u003cp\u003eI can almost see what he’s thinking, and my cheeks flush at the memories of the many things we got up to on holiday.\u003c/p\u003e\n\u003cp\u003e“But I still found time to miss my favourite guy,” I add, turning back to Stuart.\u003c/p\u003e\n\u003cp\u003e“I thought I was your favourite guy?” Jake says with mock annoyance, coming over, taking a seat at the breakfast bar.\u003c/p\u003e\n\u003cp\u003e“Get in line, man. Hos before bros.” Stuart clamps his arm around my shoulder.\u003c/p\u003e\n\u003cp\u003eI snort, then clamp my hand over my mouth.\u003c/p\u003e\n\u003cp\u003eNot attractive, I know. Snorts just happen sometimes, unexpectedly.\u003c/p\u003e\n\u003cp\u003e“God, I feel like I’m in an episode of One Tree Hill,” Jake complains.\u003c/p\u003e\n\u003cp\u003e“You’re such a moody bastard after a flight.” Stuart waves him away with his hand. “So you guys had a good time?” he asks, directing his question at me.\u003c/p\u003e\n\u003cp\u003e“The best! You’ll have to come next time, Stuart. It’s amazing there, you would love it.”\u003c/p\u003e\n\u003cp\u003e“You want Stuart to come on our honeymoon with us?” Jake raises an eyebrow.\u003c/p\u003e\n\u003cp\u003e“Oh, right, of course. Okay, so the next time after that.” I smile.\u003c/p\u003e\n\u003cp\u003e“It’s that good that it’s going to be the honeymoon destination?” Stuart questions, a glint in his eye.\u003c/p\u003e\n\u003cp\u003e“That good.” I nod, smiling at the memory of the island.\u003c/p\u003e\n\u003cp\u003e“So you guys have set a date?” Stuart releases me and leans up against the counter.\u003c/p\u003e\n\u003cp\u003eTaking off my jacket, I hang it on the back of the stool across from Jake and hop up onto it. “Not yet, but I’m going to start planning tomorrow…well, start figuring out how exactly to plan a wedding and set a date.”\u003c/p\u003e\n\u003cp\u003e“If you need a hand, gorgeous, just let me know,” he offers.\u003c/p\u003e\n\u003cp\u003e“I might just take you up on that. Ooh, you made tea.” I smile, noticing the brewing pot on the side. “Could I love you any more?” I jump down from my stool and nudge Stuart with my hip.\u003c/p\u003e\n\u003cp\u003e“Not too fuckin’ much, I hope,” Jake mutters, reaching over to get a biscuit out of the barrel.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, baby. I love Stuart in a purely platonic way. He’s like the brother I never had.”\u003c/p\u003e\n\u003cp\u003e“Aww, honey, that’s lovely.” Stuart smiles at me, nudging me with his hip.\u003c/p\u003e\n\u003cp\u003e“I thought I was the brother you never had all those years growing up.” Jake’s brow furrows.\u003c/p\u003e\n\u003cp\u003e“Jake, if I had ever looked at you in a brotherly way growing up, then we would never have ended up having sex in our adulthood.”\u003c/p\u003e\n\u003cp\u003e“Shame I didn’t know how you felt back then.” Jake’s face relaxes into a sexy grin. “Just imagine all the things we could have gotten up to in your bedroom instead of doing our homework.”\u003c/p\u003e\n\u003cp\u003eMy eyebrow lifts, and my panties nearly drop of their own accord.\u003c/p\u003e\n\u003cp\u003e“Still here,” Stuart says, cutting into the spell Jake’s put me under. “And I’m suffering from a long dry spell, so please cut out the sex talk. Right, let’s get to the important matter,” Stuart adds, rubbing his hands together. “One of you give me my gift already. I’m dying here!” \u003c/p\u003e","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-6.html","bookId":1999,"creation":"Oct 5, 2019 6:31:55 PM","modification":"Oct 5, 2019 6:31:55 PM"}
