{"id":98060,"no":9,"title":"Page 9","content":"\u003cp\u003eHoly fuck, it’s breathtaking.\u003c/p\u003e\n\u003cp\u003e“Jesus,” I whisper, walking farther in, my eyes glued to the view.\u003c/p\u003e\n\u003cp\u003e“What do think?” Jake asks beside me.\u003c/p\u003e\n\u003cp\u003eClosing my mouth in attempt to form words, I utter, “It’s stunning.”\u003c/p\u003e\n\u003cp\u003e“The view is spectacular at night,” Jake says, moving through the living room toward the window.\u003c/p\u003e\n\u003cp\u003eI follow him, dazed, trying desperately to take in my surroundings. It’s decorated throughout, finished with two huge light grey sofas, a glass table, and modern art hanging on the walls. There’s also an open fireplace—one of those trendy ones with the artificial flames.\u003c/p\u003e\n\u003cp\u003e“The furniture is just for show,” Jake says, as if reading my mind. “You can decorate however you want.”\u003c/p\u003e\n\u003cp\u003e“However we want,” I correct.\u003c/p\u003e\n\u003cp\u003e“Right.” He smiles.\u003c/p\u003e\n\u003cp\u003e“This is one of the best features in this place.” I watch with interest as Jake flips open a little panel on the wall beside the glass. He presses a button and the huge glass wall starts to slide open, disappearing into the far wall, opening the living room onto the patio.\u003c/p\u003e\n\u003cp\u003eMy jaw drops.\u003c/p\u003e\n\u003cp\u003e“Holy fuck,” I whisper, stepping through. “That’s awesome.”\u003c/p\u003e\n\u003cp\u003e“I know, right?” Jake’s grinning like a boy with a new toy.\u003c/p\u003e\n\u003cp\u003eI glance over the huge plush patio area, my eyes locking on the swimming pool. It’s massive. The size of the ones you find at the local swimming baths, but way, way nicer.\u003c/p\u003e\n\u003cp\u003eI move closer and discover it’s an infinity-edge pool.\u003c/p\u003e\n\u003cp\u003eMoving from the pool, I approach the seating area, which is decked out with an L-shaped wicker sofa, padded with thick white cushions and centred around a gorgeous fire pit.\u003c/p\u003e\n\u003cp\u003eI glance out again at LA. “Whereabouts are we?”\u003c/p\u003e\n\u003cp\u003e“In the hills.”\u003c/p\u003e\n\u003cp\u003eMy eyes nearly pop out of my head. “Hollywood Hills?”\u003c/p\u003e\n\u003cp\u003e“The very ones.”\u003c/p\u003e\n\u003cp\u003e“Holy fuck.”\u003c/p\u003e\n\u003cp\u003eI can’t stop saying holy fuck. But really, this is a “holy fuck” moment in my life if ever there was one.\u003c/p\u003e\n\u003cp\u003eI’m in a house in the Hollywood Hills. A ginormous house that Jake wants to buy for us.\u003c/p\u003e\n\u003cp\u003eI may just have a panic attack. Or faint. Or maybe both.\u003c/p\u003e\n\u003cp\u003eFucking fuckety fuck.\u003c/p\u003e\n\u003cp\u003eI don’t know much about property prices, but I’m figuring this one costs a lot more than Jake’s place in Pacific Palisades.\u003c/p\u003e\n\u003cp\u003eI wonder who the neighbours are.\u003c/p\u003e\n\u003cp\u003e“How much is this place going for?”\u003c/p\u003e\n\u003cp\u003eJake leans back against the seating area. He eyes me carefully for a long moment before answering. “Thirty.”\u003c/p\u003e\n\u003cp\u003eI have to steady myself on the table, as I’m guessing he doesn’t mean thirty thousand.\u003c/p\u003e\n\u003cp\u003e“Thirty million dollars!” My voice has reached maximum pitch. I’m expecting to hear glass shatter any moment now.\u003c/p\u003e\n\u003cp\u003eI know Jake has a lot of money, but holy fuck.\u003c/p\u003e\n\u003cp\u003eHoly fuckety fuck!\u003c/p\u003e\n\u003cp\u003e“I know it seems like a lot…okay, it is a lot,” he adds at my pained expression. “But it’s not like I can’t afford it. And I don’t plan on us moving again. I wanted the best place for us, equipped with everything we need for now and for the future. This place is as good as they come.”\u003c/p\u003e\n\u003cp\u003eFuture. Kids? Kids he doesn’t want.\u003c/p\u003e\n\u003cp\u003eSwallowing down on that heart-wrenching thought, I ask, “How many bedrooms?”\u003c/p\u003e\n\u003cp\u003e“Five.”\u003c/p\u003e\n\u003cp\u003e“Five! Jesus Christ, Jake! There should be at least fifty for that price!”\u003c/p\u003e\n\u003cp\u003eSnuffling a laugh, he comes over to me and wraps his arms around my waist, pulling me close.\u003c/p\u003e\n\u003cp\u003e“Baby, there’s plenty enough here for the price, trust me. It’s a gated community. The house itself is surrounded with gates, and that guy you heard before, he’s the security for the house. It’s manned twenty-four hours.”\u003c/p\u003e\n\u003cp\u003e“To keep your legions of female fans out?”\u003c/p\u003e\n\u003cp\u003e“I was thinking more about keeping the legions of admiring men away from my girl.” He squeezes me tight. “It’s a great place, baby. A great neighbourhood. It’s got a huge garden,” he says, nodding to the right. “There’s a two-bed guesthouse in the garden, which is where Stuart will live.”\u003c/p\u003e\n\u003cp\u003e“Stuart’s not going to live with us anymore?” I pout.\u003c/p\u003e\n\u003cp\u003e“Well, we talked, baby, and we decided it was time he move out and get his own place. He’s all grown up, ready to face the world. We have to let him go sometime. We can’t keep him forever.” Jake gives me a grave look, clearly taking the piss.\u003c/p\u003e\n\u003cp\u003e“You’re an idiot.”\u003c/p\u003e\n\u003cp\u003e“Takes one to know one.”\u003c/p\u003e\n\u003cp\u003e“That it does.” I smile warmly.\u003c/p\u003e\n\u003cp\u003eHe rubs his nose against mine, Eskimo-style. “I just thought it would be good to have our privacy, and Stuart gets his too. Also, I no longer have to run the risk of catching him making out with a dude.”\u003c/p\u003e\n\u003cp\u003e“You love it really.”\u003c/p\u003e\n\u003cp\u003e“What? Catching Stuart making out with a guy?”\u003c/p\u003e\n\u003cp\u003ePressing my lips together, suppressing a smile, I nod.\u003c/p\u003e\n\u003cp\u003e“Sweetheart, nothing could kill my hard-on quicker, believe me. I like the person I’m with to be soft and warm.” He runs his fingertips down my bare arm. “I want her made to fit around me.”\u003c/p\u003e\n\u003cp\u003e“Like me?” I scratch my fingernails over the denim covering his pert behind.\u003c/p\u003e\n\u003cp\u003e“Exactly like you.”\u003c/p\u003e\n\u003cp\u003eJake bends his head down to mine and kisses me softly.\u003c/p\u003e\n\u003cp\u003e“Will you miss him?”\u003c/p\u003e\n\u003cp\u003e“Are we still talking about Stuart?”\u003c/p\u003e\n\u003cp\u003e“I’m just worried he’ll think my being here is pushing him out.”\u003c/p\u003e\n\u003cp\u003e“Sweetheart, he works for me, and it’s not like he’s going far.”\u003c/p\u003e\n\u003cp\u003e“I know he works for you, but he’s your friend too. You guys have lived together for such a long time. You’re like Joey and Chandler. Except you’d probably have been Joey, and Chandler was never gay. Oh God, would that make me Monica or Rachel?”\u003c/p\u003e\n\u003cp\u003e“What the fuck are you talking about?” He laughs.\u003c/p\u003e\n\u003cp\u003e“Friends.”\u003c/p\u003e\n\u003cp\u003e“I’m gonna have to watch this show, aren’t I, just so I can figure out what the fuck you’re talking about half the time.”\u003c/p\u003e\n\u003cp\u003e“Yes, Pervy Perverson, you are. Honestly, I have no clue how you haven’t. I’ll buy the first season on Blu-ray and we can watch it together.”\u003c/p\u003e\n\u003cp\u003e“Can’t wait.”\u003c/p\u003e\n\u003cp\u003e“Sarcasm doesn’t suit you, Wethers.”\u003c/p\u003e\n\u003cp\u003e“No, but you wrapped around me does.”\u003c/p\u003e\n\u003cp\u003e“Later,” I say, pushing back from him, grinning. “Because right now you have the rest of this place to show me.”\u003c/p\u003e\n\u003cp\u003eHalf an hour later, the tour of my new home is complete. Jake and I are back in the living room, looking out at LA.\u003c/p\u003e\n\u003cp\u003eI’ve discovered this place has a gym, a cinema room, an office, a wine cellar, a library, and a games room. There’s another guest section that has two rooms, which Jake said he’ll turn into a studio like the one he has at his house. I also discovered this house has the biggest kitchen I have ever seen, complete with a separate utility room, a dining room, and of course the five bedrooms, complete with en suite bathrooms.\u003c/p\u003e\n\u003cp\u003eIt’s so big I actually fear getting lost in here. And I have no clue how the hell I’m going to keep it clean. It’ll be a full-time job in itself.\u003c/p\u003e\n\u003cp\u003eI’ve decided that aside from the living room, my favourite room is the master bedroom. Obvious reasons aside, it has the same breathtaking view of LA as the living room, with the same floor-to-ceiling windows.\u003c/p\u003e\n\u003cp\u003e“So…do you want me to go ahead with the offer on this place?” Jake asks from behind me, resting his face against the side of mine, his arms moving to tighten around my waist.\u003c/p\u003e\n\u003cp\u003eI have a vision of Jake and me standing here like this late at night, his arms wrapped around me, as we stare out at nighttime LA.\u003c/p\u003e\n\u003cp\u003eI feel such an intense wave of contentment that I know unequivocally that I want this house to be our home.\u003c/p\u003e\n\u003cp\u003e“Yes,” I say, unable to keep the happiness from my voice. “I absolutely want you to go ahead with the offer.”\u003c/p\u003e\n\u003cp\u003e“Thank fuck,” he says, his hand slipping inside my top to cup my breast, making me gasp at the contact I’ve been so badly missing these last few days. “So can I make love to you now in our new home?” His breath is hot against my ear.\u003c/p\u003e\n\u003cp\u003eSwallowing, I reply, “Yes,” with a breathy moan.\u003c/p\u003e\n\u003cp\u003eJake spins me around, and my mouth hits his at exactly the same time, with the same hungry need.\u003c/p\u003e\n\u003cp\u003e“I can’t wait,” he growls. “I need to be inside you now.”\u003c/p\u003e\n\u003cp\u003eThe urgency and command in his voice soaks my panties.\u003c/p\u003e\n\u003cp\u003e“I thought you were gonna fuck me blindfolded and in my boots?” I whisper across his lips.\u003c/p\u003e\n\u003cp\u003eHe groans. “Next time, because right now I just need to bury my cock deep inside you.”\u003c/p\u003e\n\u003cp\u003e“Where do you want me?”\u003c/p\u003e\n\u003cp\u003eJake’s eyes hit the couch. My back does a second later. A few more seconds, and I’m shirtless and skirtless, my panties torn off.\u003c/p\u003e\n\u003cp\u003eJake has barely gotten his own pants off before he’s thrusting his insatiable cock inside me.\u003c/p\u003e\n\u003cp\u003e“Eager much?” I breathe, lifting my hips.\u003c/p\u003e\n\u003cp\u003e“Too fucking right I am. Jesus Christ, Tru, I am never going that long without being inside you again.”\u003c/p\u003e\n\u003cp\u003eI know it’s a stupid thing to ask, but I still have to, because this is me. “Why haven’t you been near me?” I ask quietly.\u003c/p\u003e\n\u003cp\u003eHe pauses, staring down at me, a look of confusion on his face. “I was trying to be respectful. I knew how you felt about my house.”\u003c/p\u003e\n\u003cp\u003eI nod, feeling relieved that was his reason why and loving him so much more for it.\u003c/p\u003e\n\u003cp\u003e“It was really damn hard keeping my hands off you, you know. Why do you think I bought this house so quickly?”\u003c/p\u003e\n\u003cp\u003eThe grin he wears makes me giggle and brings me back to the now and the feel of him inside me.\u003c/p\u003e\n\u003cp\u003eTaking hold of my hips, he kneels, lifting my lower half with him, giving him the access he wants to get deeper inside me.\u003c/p\u003e\n\u003cp\u003e“At least I got to wear the boots.” I tap the heels of my ankle boots against his back.\u003c/p\u003e\n\u003cp\u003e“Fuck,” he groans, rocking into me. “You’re gonna be the death of me.”\u003c/p\u003e\n\u003cp\u003e“Maybe we should stop. I don’t want you dying on me.”\u003c/p\u003e\n\u003cp\u003e“No fuckin’ way,” he growls, burying himself deeper inside. “You’re not going anywhere until we’ve both come.”\u003c/p\u003e\n\u003cp\u003e“Yes, sir.”\u003c/p\u003e\n\u003cp\u003e“Say that again in Spanish.”\u003c/p\u003e\n\u003cp\u003e“Sir?”\u003c/p\u003e\n\u003cp\u003e“Yes,” his voice is strained.\u003c/p\u003e\n\u003cp\u003e“Sí, señor,” I whisper. “No me jodas, por favor.”\u003c/p\u003e\n\u003cp\u003e“I fucking love you, Tru, so damned much.”\u003c/p\u003e\n\u003cp\u003eI’m struck by the depth of his need for me, what I can do to him with my words alone, and the total control he takes over my body. And my heart. He owns me. It leaves me breathless.\u003c/p\u003e\n\u003cp\u003e“Te quiero,” I whisper.\u003c/p\u003e\n\u003cp\u003eHe shudders, a deep sound escaping his throat. “Keep talking Spanish to me, sweetheart,” he groans, thrusting harder, in and out of me, chasing his need for orgasm, never forgetting mine as he presses his fingers against my bud and licks his cock against that sweet spot deep inside me.\u003c/p\u003e\n\u003cp\u003eLost in him, wanting to please him, I whisper words of Spanish, heated praise I would never dare say in English, until my orgasm tears through me, pushing Jake over the edge. \u003c/p\u003e","sourceLink":"https://allnovel.net/wethering-the-storm-the-storm-2/page-9.html","bookId":1999,"creation":"Oct 5, 2019 6:31:55 PM","modification":"Oct 5, 2019 6:31:55 PM"}
