{"id":2168,"no":53,"title":"Chapter 53","content":"\u003cp\u003e\u0026nbsp;\u0026nbsp;\u0026nbsp; I AM BE LOV ED and she is mine. Sethe is the one that picked flowers, yellow flowers in theplace before the crouching. Took them away from their green leaves. They are on the quilt nowwhere we sleep. She was about to smile at me when the men without skin came and took us up intothe sunlight with the dead and shoved them into the sea. Sethe went into the sea. She went there.\u003c/p\u003e \n\u003cp\u003e　　They did not push her. She went there. She was getting ready to smile at me and when she saw thedead people pushed into the sea she went also and left me there with no face or hers. Sethe is theface I found and lost in the water under the bridge. When I went in, I saw her face coming to meand it was my face too. I wanted to join. I tried to join, but she went up into the pieces of light atthe top of the water. I lost her again, but I found the house she whispered to me and there she was,smiling at last. It\u0027s good, but I cannot lose her again. All I want to know is why did she go in thewater in the place where we crouched? Why did she do that when she was just about to smile atme? I wanted to join her in the sea but I could not move; I wanted to help her when she waspicking the flowers, but the clouds of gunsmoke blinded me and I lost her. Three times I lost her:\u003c/p\u003e \n\u003cp\u003e　　once with the flowers because of the noisy clouds of smoke; once when she went into the seainstead of smiling at me; once under the bridge when I went in to j oin her and she came towardme but did not smile. She whispered to me, chewed me, and swam away. Now I have found her inthis house. She smiles at me and it is my own face smiling. I will not lose her again. She is mine.\u003c/p\u003e \n\u003cp\u003e　　Tell me the truth. Didn\u0027t you come from the other side? Yes. I was on the other side. You cameback because of me? Yes. You rememory me? Yes. I remember you. You never forgot me? Yourface is mine. Do you forgive me? Will you stay? You safe here now. Where are the men withoutskin? Out there. Way off. Can they get in here? No. They tried that once, but I stopped them. Theywon\u0027t ever come back. One of them was in the house I was in. He hurt me. They can\u0027t hurt us nomore. Where are your earrings? They took them from me. The men without skin took them? Yes. I was going to help you but the clouds got in the way. There\u0027re no clouds here. If they put an ironcircle around your neck I will bite it away. Beloved. I will make you a round basket. You\u0027re back.\u003c/p\u003e \n\u003cp\u003e　　You\u0027re back. Will we smile at me? Can\u0027t you see I\u0027m smiling? I love your face. We played by thecreek. I was there in the water. In the quiet time, we played. The clouds were noisy and in the way.\u003c/p\u003e \n\u003cp\u003e　　When I needed you, you came to be with me. I needed her face to smile. I could only hearbreathing.\u003c/p\u003e \n\u003cp\u003e　　The breathing is gone; only the teeth are left.\u003c/p\u003e \n\u003cp\u003e　　She said you wouldn\u0027t hurt me.\u003c/p\u003e \n\u003cp\u003e　　She hurt me.\u003c/p\u003e \n\u003cp\u003e　　I will protect you.\u003c/p\u003e \n\u003cp\u003e　　I want her face.\u003c/p\u003e \n\u003cp\u003e　　Don\u0027t love her too much.\u003c/p\u003e \n\u003cp\u003e　　I am loving her too much.\u003c/p\u003e \n\u003cp\u003e　　Watch out for her; she can give you dreams.\u003c/p\u003e \n\u003cp\u003e　　She chews and swallows.\u003c/p\u003e \n\u003cp\u003e　　Don\u0027t fall asleep when she braids your hair.\u003c/p\u003e \n\u003cp\u003e　　She is the laugh; I am the laughter.\u003c/p\u003e \n\u003cp\u003e　　I watch the house; I watch the yard.\u003c/p\u003e \n\u003cp\u003e　　She left me.\u003c/p\u003e \n\u003cp\u003e　　Daddy is coming for us.\u003c/p\u003e \n\u003cp\u003e　　A hot thing.\u003c/p\u003e \n\u003cp\u003e　　BelovedYou are my sisterYou are my daughterYou are my face; you are meI have found you again; you have come back to meYou are my BelovedYou are mineYou are mineYou are mineI have your milkI have your smileI will take care of youYou are my face; I am you. Why did you leave me who am you?\u003c/p\u003e \n\u003cp\u003e　　I will never leave you againDon\u0027t ever leave me againYou will never leave me againYou went in the waterI drank your bloodI brought your milkYou forgot to smileI loved youYou hurt meYou came back to meYou left meI waited for youYou are mineYou are mineYou are mine\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/shuangyu/678/3776.html","bookId":82,"creation":"Aug 1, 2019 3:38:46 AM","modification":"Aug 1, 2019 3:38:46 AM"}
