{"id":102340,"no":1,"title":"Page 1","content":"\u003cp\u003eChapter 1\u003c/p\u003e\n\u003cp\u003e“W ho mails out Christmas cards before Thanksgiving?” Cassie Beaumont lamented to her best friend.\u003c/p\u003e\n\u003cp\u003eAngie Barber looked up from her microscope and seemed to take an extra moment to consider what Cassie had just said. “You got a Christmas card? Already?”\u003c/p\u003e\n\u003cp\u003eCassie wheeled her chair back to her station. “Can you believe it?”\u003c/p\u003e\n\u003cp\u003e“Who from?”\u003c/p\u003e\n\u003cp\u003e“An old college friend. You wouldn’t know her.” Cassie shrugged. “Jill married Tom two weeks after we graduated.”\u003c/p\u003e\n\u003cp\u003e“They have children?”\u003c/p\u003e\n\u003cp\u003eCassie caught the wisp of longing in Angie’s voice and answered with a nod. “Two, a boy and a girl, and of course they’re adorable.”\u003c/p\u003e\n\u003cp\u003e“Of course,” Angie echoed.\u003c/p\u003e\n\u003cp\u003eThe Christmas card photo showed the four of them in matching outfits of green and red. The mother and daughter wore full-length green dresses with red-and-green plaid skirts. Father and son had on three-piece suits with vests in the same fabric as the dress skirts. It was too adorable for words.\u003c/p\u003e\n\u003cp\u003e“There was a letter, as well.”\u003c/p\u003e\n\u003cp\u003e“Everything in their lives is perfect, right?” Angie asked.\u003c/p\u003e\n\u003cp\u003e“Perfect in every way,” Cassie grumbled. The unfairness of it all was too much. Jill, who worked as a financial planner, held down a forty-hour-a-week job, kept a meticulous house and still managed to be a terrific wife and mother. Despite all the demands on her time, she’d mailed out her Christmas cards a full month in advance.\u003c/p\u003e\n\u003cp\u003e“Is there a reason the perfect Jill sent her Christmas cards so soon?” Angie asked.\u003c/p\u003e\n\u003cp\u003e“Jill and Tom just moved into a new home and wanted to update family and friends with their address change. Oh, and there was a photo of the house and it was—”\u003c/p\u003e\n\u003cp\u003e“Perfect,” Angie finished for her.\u003c/p\u003e\n\u003cp\u003e“Perfect doesn’t begin to describe it.”\u003c/p\u003e\n\u003cp\u003eAngie watched her closely. “Do I detect a slight note of envy?” she asked.\u003c/p\u003e\n\u003cp\u003e“Slight envy? Me?” Cassie asked, exaggerating the words. “Heavens, no. What you’re hearing is a full-blown case of jealousy. The green-eyed monster is alive and well.” Cassie rolled her chair to the end of a counter filled with an assortment of microscopes, test tubes, slides and other equipment, then stood, hands propped on her hips. “Do you realize how long it’s been since I’ve been on a real date?”\u003c/p\u003e\n\u003cp\u003e“You went out with Greg last week,” Angie reminded her.\u003c/p\u003e\n\u003cp\u003e“Greg isn’t a man,” Cassie blurted out. “I mean, he is, but not in the sense of someone I’m interested in,” she said. “Greg’s…completely unsuitable as marriage material.” She didn’t need to explain that, at thirty-four, the ticking of her biological clock got louder by the year.\u003c/p\u003e\n\u003cp\u003eAngie sighed. “I agree.”\u003c/p\u003e\n\u003cp\u003eHe was eligible in practically every way but he happened to be divorced and in love with his ex-wife. Unfortunately, he hadn’t figured that out yet. The entire date, if it could even be called a date, was spent rehashing the tragedy of his divorce. He went on and on about how much he missed his three kids—and his ex-wife, if the number of times he mentioned her name was any indication. The night had been sheer drudgery for Cassie. It was her first and last date with Greg.\u003c/p\u003e\n\u003cp\u003e“The problem is, we don’t meet many guys here at work,” Angie said. Cassie was well aware of that. Since they were holed up in a lab eight to ten hours a day, working as biochemists for a plastics company, the opportunities to socialize outside the job were limited.\u003c/p\u003e\n\u003cp\u003e“What really hit home,” Cassie said, “after receiving that Christmas card, is how badly I want a family of my own.”\u003c/p\u003e\n\u003cp\u003e“I know.” The longing was back in Angie’s voice, too.\u003c/p\u003e\n\u003cp\u003e“I don’t understand why it’s so hard to meet men. I’m reasonably attractive, right?”\u003c/p\u003e\n\u003cp\u003eAngie nodded enthusiastically. “Yes.”\u003c/p\u003e\n\u003cp\u003e“Thirty-four isn’t so old, is it?”\u003c/p\u003e\n\u003cp\u003e“Not really.”\u003c/p\u003e\n\u003cp\u003eCassie shook her head and wondered why she was still single. She wanted to be married, and she liked to think she had the full package—five-five, dark hair, dark eyes. She was attractive, as Angie had confirmed, and she was smart, with a successful career, an engaging personality (if she did say so herself) and plenty of friends. “I blame my mother for this.”\u003c/p\u003e\n\u003cp\u003e“Your mother?”\u003c/p\u003e\n\u003cp\u003e“I blame my father, too, even if he didn’t stick around all that long.”\u003c/p\u003e\n\u003cp\u003e“Or maybe because he didn’t stick around.”\u003c/p\u003e\n\u003cp\u003e“Yeah, I guess. After the divorce, my mother was so down on marriage, the whole idea terrified me.”\u003c/p\u003e\n\u003cp\u003e“But it doesn’t anymore, does it?”\u003c/p\u003e\n\u003cp\u003e“No. I want a husband and I’d really like children.” She grinned. “The ironic thing is, my mother’s remarried.”\u003c/p\u003e\n\u003cp\u003e“Marriage seems to terrify your brother, too. Shawn should be married by now, don’t you think? He’s older than you are.”\u003c/p\u003e\n\u003cp\u003e“I’m not so sure about Shawn.” Cassie sometimes wondered if Angie might be interested in her brother. There was actually nothing to indicate that, but every once in a while Cassie had this feeling…. “He travels so much that maintaining a long-term relationship would be difficult for him.”\u003c/p\u003e\n\u003cp\u003e“True,” Angie said.\u003c/p\u003e\n\u003cp\u003eShawn was a well-known artist who painted murals all over the country. Brother and sister were close and kept in touch, calling each other two and three times a week. Currently Shawn was in Boca Raton, Florida, painting the side of a building that stood next to the freeway. He’d sent her photos of the mural from his cell phone—an ocean scene, which Cassie knew was his favorite. Whales rising up out of the crashing waves. Dolphins and sea turtles and all kinds of fish frolicked in the sparkling blue water. His murals made headlines wherever he went and huge crowds showed up to watch him paint.\u003c/p\u003e\n\u003cp\u003e“Shawn’s a different case,” Cassie said. In her opinion, that summed up the situation pretty accurately.\u003c/p\u003e\n\u003cp\u003e“But if you were married, I bet he’d show some interest in finding a wife,” Angie commented.\u003c/p\u003e\n\u003cp\u003eCassie had never thought of their family dynamic in those terms. Perhaps, in some obscure way, Shawn was waiting for her to make the leap first. Angie might be right. It wasn’t that Shawn followed her lead—far from it. They’d both been traumatized by the divorce and by their mother’s reaction. Their father, who wanted his kids to call him Pete, had been in and out of their lives. Mostly out and yet…yet he’d had a powerful influence on his children, whom he rarely recognized as such.\u003c/p\u003e\n\u003cp\u003e“Shawn won’t feel marriage is safe until he sees you happily married,” Angie went on to say.\u003c/p\u003e\n\u003cp\u003eCassie scowled at her friend. “What makes you so smart?”\u003c/p\u003e\n\u003cp\u003e“Just an observation,” Angie said. “I may not be correct, but it seems to me that you and Shawn are afraid of love.”\u003c/p\u003e\n\u003cp\u003e“Me afraid of love? Hardly.” Not if the longing in her heart was anything to go by. Like her friend Jill, she wanted it all.\u003c/p\u003e\n\u003cp\u003e“Whenever you meet a man—no matter how perfect he is—you find fault with him,” Angie said.\u003c/p\u003e\n\u003cp\u003eNow, that was categorically untrue. “Not so,” Cassie argued.\u003c/p\u003e\n\u003cp\u003e“Oh, it’s all wine and roses in the beginning, but then it’s over before you even have a chance to really know the guy.”\u003c/p\u003e\n\u003cp\u003e“How can you say that?”\u003c/p\u003e\n\u003cp\u003e“Well, mostly,” Angie told her softly, “I can say it because I’ve seen you do it again and again.”\u003c/p\u003e\n\u003cp\u003e“You’re not talking about me and Jess, are you? The man had no class. He scratched his private parts in public!”\u003c/p\u003e\n\u003cp\u003e“Not Jess.”\u003c/p\u003e\n\u003cp\u003e“Who do you mean, then?”\u003c/p\u003e\n\u003cp\u003e“Rod.”\u003c/p\u003e\n\u003cp\u003eCassie cocked her head. “Rod? Rod who?”\u003c/p\u003e\n\u003cp\u003e“I don’t remember his last name. You went out with him a year ago.”\u003c/p\u003e\n\u003cp\u003e“Not Rod Showers? Good grief, he was so cheap I had to pay for my half of the meal and tip the valet because he refused to do it.”\u003c/p\u003e\n\u003cp\u003e“What about Charles…”\u003c/p\u003e\n\u003cp\u003eCassie got the point quickly enough. “Okay, okay, so I have standards.”\u003c/p\u003e\n\u003cp\u003e“High standards.”\u003c/p\u003e\n\u003cp\u003e“Okay, fine. High standards.” Cassie had made the effort, though. “I’ve tried to meet men.”\u003c/p\u003e\n\u003cp\u003e“We both have.”\u003c/p\u003e\n\u003cp\u003e“I had hopes for that online dating service.” The advertisements had looked so promising. Cassie and Angie had signed up together and then waited expectantly to meet their perfect matches.\u003c/p\u003e\n\u003cp\u003eIt didn’t happen.\u003c/p\u003e\n\u003cp\u003e“I had real hopes for that, too,” Angie returned sadly. “I thought for sure we’d meet really wonderful husbands.”\u003c/p\u003e\n\u003cp\u003eCassie sighed. That had been an expensive venture. Her expectations had been great and her disappointment greater. Angie’s too. In fact, Angie was the one who’d suggested trying the Internet.\u003c/p\u003e\n\u003cp\u003e“The church singles group was a good idea,” she said now.\u003c/p\u003e\n\u003cp\u003e“A great idea,” Cassie concurred, “if there’d been any men involved.” They’d gone there to discover the group consisted of thirty women and two men—both close to retirement age.\u003c/p\u003e\n\u003cp\u003eAngie nodded. “The pickings were few and far between.”\u003c/p\u003e\n\u003cp\u003e“We’ve read all the right books,” Cassie said. “Dating for Dummies. How to Find a Man in Five Easy Lessons. My personal favorite was Lasso Yourself a Husband and Other Ways to Make a Man Notice You.”\u003c/p\u003e\n\u003cp\u003e“The only thing we managed to lasso was a hundred-dollar credit-card bill for all those books.”\u003c/p\u003e\n\u003cp\u003e“Divided two ways,” Cassie reminded her.\u003c/p\u003e\n\u003cp\u003e“They did make for interesting reading.”\u003c/p\u003e\n\u003cp\u003e“They would’ve been a lot more interesting if we’d been able to make any of them work,” Cassie said in acerbic tones.\u003c/p\u003e\n\u003cp\u003e“Yeah…”\u003c/p\u003e\n\u003cp\u003e“We’ve tried everything.”\u003c/p\u003e\n\u003cp\u003e“I’m not giving up,” Angie insisted. “And I won’t let you give up, either.”\u003c/p\u003e\n\u003cp\u003eCassie sighed.\u003c/p\u003e\n\u003cp\u003eShe was close to it. The Christmas card from Jill and Tom was the final straw. For too long she’d been convinced that one day soon, she’d be mailing glossy Christmas cards to all her friends and relatives. She, too, would have a photograph that showed the perfect husband, the perfect children, a boy and a girl, all looking forward to the perfect Christmas. But year after year it was the same. No husband. No children. And each Christmas with her embittered mother more depressing than the one before.\u003c/p\u003e\n\u003cp\u003eThe time had come to step forward and find a man, she decided with new resolve. Maybe she did need to lower her standards. She couldn’t allow another Christmas to pass without—\u003c/p\u003e\n\u003cp\u003e“There’s something, or rather someone, you haven’t tried,” Angie said, cutting into Cassie’s thoughts.\u003c/p\u003e\n\u003cp\u003eCassie perked up. “Oh?”\u003c/p\u003e\n\u003cp\u003eAngie grew strangely quiet.\u003c/p\u003e\n\u003cp\u003eCassie frowned. “Don’t hold out on me now, Angie.”\u003c/p\u003e\n\u003cp\u003e“He’s expensive.”\u003c/p\u003e\n\u003cp\u003e“How expensive? No, wait, don’t tell me.” She paused. “Who is this he?”\u003c/p\u003e\n\u003cp\u003e“A matchmaker.”\u003c/p\u003e\n\u003cp\u003e“A matchmaker,” Cassie repeated slowly. “I didn’t know there was such a thing in this day and age.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-perfect-christmas/page-1.html","bookId":2633,"creation":"Oct 5, 2019 10:16:39 PM","modification":"Oct 5, 2019 10:16:39 PM"}
