{"id":102351,"no":13,"title":"Page 13","content":"\u003cp\u003eCassie nodded, eager to make her escape. As she started for the changing room, Simon appeared beside her.\u003c/p\u003e\n\u003cp\u003eCassie realized she wasn’t going to be able to control her emotions. Tears streamed down her face.\u003c/p\u003e\n\u003cp\u003e“What is it?” he asked. He seemed genuinely concerned.\u003c/p\u003e\n\u003cp\u003e“I was that little girl once,” she said with difficulty. “All I wanted for Christmas was for my daddy to come home.” She covered her mouth with both hands, trying to stifle her sobs.\u003c/p\u003e\n\u003cp\u003eThey reached the doorway that led to the mall interior. Simon held open the door and Cassie slipped into the darkened hallway. Once inside, she leaned against the wall and let the tears flow unrestrained.\u003c/p\u003e\n\u003cp\u003eSimon stood next to her for several minutes, then tentatively placed his arms around her.\u003c/p\u003e\n\u003cp\u003eCassie didn’t care who he was; she needed his comfort. She rested her face against him, sobbing into his expensive wool jacket.\u003c/p\u003e\n\u003cp\u003eHis hold relaxed and, after an awkward moment, he spoke soothingly into her ear. She couldn’t make out what he was saying. It didn’t matter.\u003c/p\u003e\n\u003cp\u003eAs if by instinct, she lifted her head and gazed up at him. He whispered something else, something that sounded like “It wasn’t your fault.” Then his lips, warm and tender, descended on hers.\u003c/p\u003e\n\u003cp\u003eChapter 10\u003c/p\u003e\n\u003cp\u003eSimon says: If you’re the woman he’s looking for, I will find you.\u0026nbsp;S imon’s gentleness consoled her as he held her close. Cassie didn’t want him to ever stop, and he didn’t seem inclined to let her go. Time lost meaning, and Cassie didn’t know how long he held her against him.\u003c/p\u003e\n\u003cp\u003eThen, just when she was least prepared, he seemed to snap to attention, become aware of his surroundings. He dropped his arms and stepped away. His movements were so abrupt that she nearly stumbled. She might have if he hadn’t clasped her shoulders to steady her.\u003c/p\u003e\n\u003cp\u003eSpeechless, she stared up at him, unable to make sense of what had happened in the past few minutes. Under normal conditions, Cassie didn’t give way to emotion, and certainly not in public. But Christmas, that little girl and the memory of losing her own father had struck her hard and there’d been no stopping the barrage of deeply buried feelings. She told herself she was not going to react to that kiss.\u003c/p\u003e\n\u003cp\u003e“I need a cup of coffee,” she murmured. Despite her tears her throat was parched.\u003c/p\u003e\n\u003cp\u003eSimon nodded.\u003c/p\u003e\n\u003cp\u003e“I’ll change clothes and be right back.” She was sure her voice sounded strained and unnatural. She hurried inside the ladies’ room; once the door was closed she leaned against it and covered her face. Her whole body was trembling. Eventually, when she felt composed again, she straightened and began to dress.\u003c/p\u003e\n\u003cp\u003eTo the best of her knowledge, this was the first time she’d ever cried over her father. Peter Beaumont had simply walked out of their lives one day as if it meant nothing. As if they meant nothing. The event had forever marked her and Shawn and their mother, as well. And yet he seemed oblivious to the anguish he’d inflicted on his wife and children. His excuse was that he needed to “find himself.” Apparently he couldn’t manage that and be a husband and father at the same time. His was a solitary path, and it didn’t seem to matter how many hearts he crushed along the way. Cassie made every effort to cast all thoughts of him out of her mind. But he was there, as much as she wanted to deny his existence.\u003c/p\u003e\n\u003cp\u003eWhen Cassie had finished dressing, she left her outfit neatly on a ledge near the sink and wrote Daisy a note explaining why the shoes and tights were in the garbage. Then she brushed her hair and repaired her makeup. Simon was pacing in the hallway outside the door. He stopped when he saw her and even in the dimly lit hallway she could see that he wasn’t quite himself, either.\u003c/p\u003e\n\u003cp\u003eWith his hand at her elbow, he escorted her back into the mall and toward an exit. “There’s a place close by where we can have coffee.” He reached inside his pocket for his car keys. “I’ll drive.”\u003c/p\u003e\n\u003cp\u003eCassie didn’t know what was wrong with the restaurants that were within walking distance. However, she didn’t have the energy to argue, so she just followed him.\u003c/p\u003e\n\u003cp\u003eShe wasn’t surprised to see that he drove a black sedan with a black interior, which was meticulously maintained; she wouldn’t have expected anything less. Simon wasn’t the type of man who’d have hamburger wrappings and stale French fries littering his vehicle.\u003c/p\u003e\n\u003cp\u003eThey didn’t speak; he glanced at her for approval, then flipped on a CD. She recognized the calming strains of a Bach piano concerto. Again, she wasn’t surprised, although she couldn’t have identified the piece. She leaned back, eyes shut, letting the music flow over her. The restaurant wasn’t really all that close, she noted a little later. It was perhaps a fifteen-minute drive along the Tacoma waterfront before he pulled into an exclusive housing development. He turned down several streets, then entered a driveway.\u003c/p\u003e\n\u003cp\u003e“This isn’t a restaurant,” Cassie said.\u003c/p\u003e\n\u003cp\u003e“No, it’s my home.”\u003c/p\u003e\n\u003cp\u003e“Your home?”\u003c/p\u003e\n\u003cp\u003e“I felt we’d both appreciate privacy for this discussion.”\u003c/p\u003e\n\u003cp\u003eHe was probably right.\u003c/p\u003e\n\u003cp\u003eSimon ushered her inside. The house was spotless. It looked like one of those model homes with everything carefully arranged and color-coordinated, not a thing out of place. No Christmas decorations. Nor did she see a single photograph, and that seemed almost unnatural. Surely there were people in his life, people he loved and cared about. Family. Friends. Then again, maybe he preferred to keep his distance from others. Maybe he felt his job required it.\u003c/p\u003e\n\u003cp\u003e“Make yourself comfortable,” he said and gestured toward the sofa. Then he disappeared into the kitchen through a swinging door.\u003c/p\u003e\n\u003cp\u003eCassie looked out over Commencement Bay, although her thoughts still churned and she hardly noticed the beauty before her. She had a distinct feeling that their professional agreement was about to come to an end.\u003c/p\u003e\n\u003cp\u003eOther than one brief interchange—when he asked how she liked her coffee—all was silent.\u003c/p\u003e\n\u003cp\u003eAfter a few minutes, Simon reappeared with two cups of coffee. He handed her one, careful to avoid physical contact, before taking a seat as far away as the room allowed. He stared down at his coffee. “I would like to know what happened back at the mall,” he said after a tense moment.\u003c/p\u003e\n\u003cp\u003e“Okay.” It wasn’t as if they could ignore the episode. “Which part do you want to discuss?”\u003c/p\u003e\n\u003cp\u003e“What were those tears about?”\u003c/p\u003e\n\u003cp\u003eNow Cassie stared into her coffee. “My father,” she began, then shook her head. “The last child in line.”\u003c/p\u003e\n\u003cp\u003e“The little girl who was by herself?”\u003c/p\u003e\n\u003cp\u003e“Yes. She came to Santa because…” The lump in her throat made it necessary to pause and swallow before she could continue. “She didn’t want toys or clothes or gifts, she…she wanted her daddy back.”\u003c/p\u003e\n\u003cp\u003e“Ah.” Simon’s eyes softened with understanding and what looked like sympathy. “She reminded you of yourself at that age. You said as much, didn’t you?”\u003c/p\u003e\n\u003cp\u003eCassie nodded. “My father left during the holidays. So he not only broke our hearts, he made sure Christmas would never be the same.”\u003c/p\u003e\n\u003cp\u003e“He sounds like a real jewel of a human being,” Simon said disdainfully.\u003c/p\u003e\n\u003cp\u003eBut Cassie didn’t wish her father ill. He’d paid for his mistakes; in his late sixties now, he was essentially alone. While she liked to think she’d put all the bitterness behind her, she didn’t really have a relationship with him, nor did she seek one. Every so often, Pete made the effort to contact her, but they had nothing in common, nothing to talk about, nothing to share. The conversation typically lasted a few minutes. Invariably Cassie felt sad afterward.\u003c/p\u003e\n\u003cp\u003e“I don’t want you to assume I’m the kind of woman who breaks into tears at the drop of a hat. I…It was like seeing myself all those years ago. Like feeling pain so raw it tore my heart out.” Her voice quavered and she tried to conceal it by sipping coffee.\u003c/p\u003e\n\u003cp\u003e“Pain and the memory of pain—which often amounts to the same thing—don’t really go away,” Simon said. “That’s why we have to learn to assimilate it.”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003eSimon didn’t say anything else for some time. “I believe it would be best if we…”\u003c/p\u003e\n\u003cp\u003eHe stopped speaking, which made Cassie look at him.\u003c/p\u003e\n\u003cp\u003e“That kiss,” he murmured, shifting his weight.\u003c/p\u003e\n\u003cp\u003eSeeing Simon ill at ease was so unusual she couldn’t help enjoying it, although that was probably unkind of her. At least it was a distraction from her own painful past. “Yes, the kiss.”\u003c/p\u003e\n\u003cp\u003eHe frowned. “I want to assure you I don’t make a habit of kissing my clients.”\u003c/p\u003e\n\u003cp\u003eShe instinctively recognized that as the truth.\u003c/p\u003e\n\u003cp\u003e“Weeping women don’t generally affect me like that, either. I don’t have any excuse and I wish to apologize.”\u003c/p\u003e\n\u003cp\u003eHis gaze held hers and she couldn’t doubt the sincerity of his words. “I was as much at fault as you,” she felt obliged to admit. “I—”\u003c/p\u003e\n\u003cp\u003e“I will refund your money,” he said, cutting her off.\u003c/p\u003e\n\u003cp\u003eIt was what she’d been afraid of. “But why?”\u003c/p\u003e\n\u003cp\u003e“I stepped over the line. This is the only way I can rectify the…incident.”\u003c/p\u003e\n\u003cp\u003eCassie bit her lip. She conceded that the kiss shouldn’t have happened. But that wasn’t a good reason to ruin everything. “Will I still meet John?” she asked, then held her breath, almost afraid of what he’d say. She was practically gasping for air by the time he replied.\u003c/p\u003e\n\u003cp\u003e“Considering that I was the one who initiated the…incident, I feel honor-bound to hold up my part of the bargain.”\u003c/p\u003e\n\u003cp\u003e“If that’s the case, then that kiss just cost you thirty thousand dollars.”\u003c/p\u003e\n\u003cp\u003eHe didn’t look any too pleased with himself, but merely shrugged. “So be it. This was a lesson well learned.”\u003c/p\u003e\n\u003cp\u003e“I don’t feel I can let you do that.” Tempting as it was for Cassie to accept, fair was fair. She hadn’t exactly pushed him away. In fact, she’d welcomed his kiss, welcomed his comfort.\u003c/p\u003e\n\u003cp\u003e“I am not in the habit of arguing with my clients.”\u003c/p\u003e\n\u003cp\u003e“Or with anyone, it seems.”\u003c/p\u003e\n\u003cp\u003eHe blinked as if it took him a moment to comprehend what she’d said. “Or with anyone,” he agreed.\u003c/p\u003e\n\u003cp\u003eShe sighed. “I appreciate the offer, Simon, really I do, but you weren’t the only one who learned a lesson. How about if we both forget it ever happened and just move forward?”\u003c/p\u003e\n\u003cp\u003e“Fine,” he said curtly. “I would like your promise that you’ll never mention our kiss again. Can you do that?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Yes. Of course.”\u003c/p\u003e\n\u003cp\u003e“Good. I’ll undertake to do the same thing.”\u003c/p\u003e\n\u003cp\u003eShe mimed zipping her lips closed. “It’s gone, forgotten, cast into the deepest part of the ocean.” The thought flashed into her mind that the ocean was filled with treasures—treasures no one even knew were there. When it happened, Simon’s kiss had felt like treasure, unexpected and…beautiful.\u003c/p\u003e\n\u003cp\u003e“My plan for the third task is to have you cook Christmas dinner,” he reminded her.\u003c/p\u003e\n\u003cp\u003eCassie raised her hand. “Yes, I wanted to talk to you about that.”\u003c/p\u003e\n\u003cp\u003e“What about it?”\u003c/p\u003e\n\u003cp\u003eShe might as well be blunt. “Like I told you before, I don’t have the best neighbors.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-perfect-christmas/page-13.html","bookId":2633,"creation":"Oct 5, 2019 10:16:39 PM","modification":"Oct 5, 2019 10:16:39 PM"}
