{"id":102347,"no":9,"title":"Page 9","content":"\u003cp\u003e“I wouldn’t be so sure of that,” Angie warned her.\u003c/p\u003e\n\u003cp\u003eChapter 7\u003c/p\u003e\n\u003cp\u003eH er arms loaded down with groceries, Cassie hurried over to the elevator. “Mr. Oliver, hold that door for me!” she cried frantically, trying not to drop the quart of milk dangling from her index finger.\u003c/p\u003e\n\u003cp\u003eMr. Oliver pretended not to hear, and the doors glided shut in her face.\u003c/p\u003e\n\u003cp\u003eCassie ground her teeth in frustration. This wasn’t the first time Mr. Oliver had purposely let the elevator close as she ran toward it. She’d watched him do the same thing with other residents. Obviously it gave him some kind of thrill. She might have imagined it, but Cassie swore she saw a glimmer of sadistic humor in his eyes as the doors slid closed.\u003c/p\u003e\n\u003cp\u003eShe lowered one bag to the floor and pushed the call button. While she waited, she went to collect her newspaper, only to discover the slot was empty—and it wasn’t even Tuesday. Apparently Mrs. Mullinex was now clipping coupons from the Sunday edition, as well.\u003c/p\u003e\n\u003cp\u003ePerhaps it was time to confront the retired schoolteacher.\u003c/p\u003e\n\u003cp\u003eCassie took the elevator up to the fifth floor, brought her groceries to the kitchen, and walked down the hallway to Mrs. Mullinex’s unit. Outside her neighbor’s door, she rang the bell until she heard footsteps on the other side.\u003c/p\u003e\n\u003cp\u003e“Hold your horses,” Mrs. Mullinex called out.\u003c/p\u003e\n\u003cp\u003eShe answered the door, wearing her housecoat and slippers. Her head was covered in pink curlers and wrapped with a bandanna knotted directly above her forehead. It wasn’t a look Cassie saw very often these days—if ever.\u003c/p\u003e\n\u003cp\u003e“Why, Cassie, how nice of you to stop by,” she said pleasantly. “Can I offer you a glass of eggnog?”\u003c/p\u003e\n\u003cp\u003e“Oh, no, thank you.” Cassie made an attempt to be neighborly or at least polite. “Uh, I believe you have my newspaper.”\u003c/p\u003e\n\u003cp\u003eHer neighbor seemed startled, as if the suggestion that she might have taken something not hers was a devastating insult. Mrs. Mullinex raised one hand to her mouth in a gesture of innocence. “Oh, dear, was that your paper?”\u003c/p\u003e\n\u003cp\u003eCassie held out her hand.\u003c/p\u003e\n\u003cp\u003eThe older woman slowly retrieved the thick weekend edition and reluctantly placed it in Cassie’s outstretched hand. “I was wondering, dear, if you wouldn’t mind letting me have the section with the New York Times crossword puzzle.”\u003c/p\u003e\n\u003cp\u003eCassie clutched the paper to her chest.\u003c/p\u003e\n\u003cp\u003e“Only when you’re finished with it, of course.”\u003c/p\u003e\n\u003cp\u003e“I happen to enjoy doing the crossword puzzle, Mrs. Mullinex.”\u003c/p\u003e\n\u003cp\u003e“Oh.”\u003c/p\u003e\n\u003cp\u003eWondering if she’d been a little too inflexible, Cassie returned to her own condo, put away her groceries and made a cup of coffee. She sat down with the paper, prepared to relax. She’d just turned to the middle section, grabbed a pen—doing the crossword puzzle in pen was a matter of pride—when the rap music started next door. The whole room seemed to vibrate. Cassie groaned. There was no question: the fates were conspiring against her.\u003c/p\u003e\n\u003cp\u003eGetting up from her chair, Cassie pounded her fist against the kitchen wall hard enough to rattle her dishes. She had to repeat the pounding twice before the music was lowered to a tolerable level.\u003c/p\u003e\n\u003cp\u003eSettled once more, she rested her feet on the ottoman, crossed her ankles and savored the first sip of coffee when her doorbell rang.\u003c/p\u003e\n\u003cp\u003e“Oh, for the love of heaven,” she muttered, tossing down the pen. If it turned out to be one of her annoying neighbors—whom she’d be having dinner with all too soon, according to Simon—she didn’t know what she’d say.\u003c/p\u003e\n\u003cp\u003eTo her astonishment, it was her brother, toting a five-foot Christmas tree.\u003c/p\u003e\n\u003cp\u003e“Shawn, what are you doing here?” Normally she’d be fortunate to see him twice in four months, and this was his second visit to Seattle in as many weeks.\u003c/p\u003e\n\u003cp\u003e“Are you complaining?”\u003c/p\u003e\n\u003cp\u003e“Of course not!”\u003c/p\u003e\n\u003cp\u003e“I come bearing gifts.” He thrust the Christmas tree into the room.\u003c/p\u003e\n\u003cp\u003e“So I noticed.”\u003c/p\u003e\n\u003cp\u003eShawn grinned. “I thought you could use a bit of Christmas cheer.” He stepped into the condo and leaned the tree against the living room wall. “This also seemed like a good excuse to stop by so you could tell me how everything went yesterday.”\u003c/p\u003e\n\u003cp\u003eHad it only been the day before that she’d stood in the cold, soliciting donations? That didn’t seem possible, and yet Cassie hadn’t stopped thinking about the experience. What remained uppermost in her mind was the time she’d spent with Simon at the coffee shop. He’d been frank, unemotional, honest. She amended that to brutally honest. When she’d met him, she’d considered him rude and arrogant, but since then she’d had a change of heart. Simon, she decided, was simply…direct. He said what he felt and didn’t moderate his opinions in deference to other people’s flimsy egos. She’d never met anyone quite like him.\u003c/p\u003e\n\u003cp\u003e“Well?” Shawn prodded her.\u003c/p\u003e\n\u003cp\u003e“Who do you want to hear about first—Mr. Scrooge, who wasn’t sent by Simon as a test,” she added, “or would you rather I told you about the woman who threw coffee at me because she thought I’d flirted with her husband?”\u003c/p\u003e\n\u003cp\u003eShawn flopped down on the sofa. “Both, and while you’re up, I’ll take a cup of that coffee.”\u003c/p\u003e\n\u003cp\u003e“Sure,” she said, while she got a mug and filled it to the brim. “You won’t believe what he said to me.”\u003c/p\u003e\n\u003cp\u003e“Scrooge?”\u003c/p\u003e\n\u003cp\u003e“No, Simon. I asked if he liked me and he said ‘not particularly.’ What’s so funny is the fact that—”\u003c/p\u003e\n\u003cp\u003e“Funny? You thought this was funny?”\u003c/p\u003e\n\u003cp\u003e“Not at first,” she admitted. “The thing with Simon is that he wasn’t being intentionally rude. He’s the most plainspoken man I’ve ever encountered.”\u003c/p\u003e\n\u003cp\u003e“Sounds like a bore to me.”\u003c/p\u003e\n\u003cp\u003e“I called him a dolt.” She smiled at the memory. “He didn’t much like that.”\u003c/p\u003e\n\u003cp\u003e“So he can dish it out, but he can’t take it?”\u003c/p\u003e\n\u003cp\u003e“Well, he certainly isn’t used to it.”\u003c/p\u003e\n\u003cp\u003eThey chatted for a while, until Shawn eventually said, “I hope you realize that all you’ve done is talk about Simon. I’ve yet to hear a word about anyone else.”\u003c/p\u003e\n\u003cp\u003e“Really?” Caught up in her musing, Cassie hadn’t noticed.\u003c/p\u003e\n\u003cp\u003e“I think you might be falling for him.”\u003c/p\u003e\n\u003cp\u003e“For Simon?” The suggestion was ludicrous. “Oh, hardly! If I’m focusing on him, it’s because he’s the man who holds the key to my happiness. He’s going to introduce me to John—and I have high hopes for John. He’s my perfect—oops, most suitable, which is what Simon calls it—match.”\u003c/p\u003e\n\u003cp\u003e“Just in time for the perfect—or should I say, most suitable—Christmas.”\u003c/p\u003e\n\u003cp\u003eCassie suspected Shawn was mocking her a little, but she was too hopeful and too happy to care.\u003c/p\u003e\n\u003cp\u003eAll at once he grew serious. “Don’t build your expectations too high, Cassie. What if you and this John character don’t really connect?”\u003c/p\u003e\n\u003cp\u003e“But we will. That’s the beauty of it. Simon studied our profiles and concluded that we’re ideal for each other. I think his success lies in the fact that he can be emotionally detached and even clinical. It’s all quite scientific, you know.”\u003c/p\u003e\n\u003cp\u003e“Uh-huh.” Shawn nodded wryly.\u003c/p\u003e\n\u003cp\u003e“Did I mention Simon refuses to talk about himself? That’s probably why he’s so brilliant at this. He doesn’t want to cloud the relationship between him and his clients. His sole focus is on finding the right person for them.”\u003c/p\u003e\n\u003cp\u003e“Seems to me you’ve got him all figured out.”\u003c/p\u003e\n\u003cp\u003e“I think I just might. Now wipe that smirk off your face,” she said. Now that she’d thought seriously about Simon, and she’d been doing that for the past twenty-four hours, it all made a crazy kind of sense.\u003c/p\u003e\n\u003cp\u003eSimon made sense.\u003c/p\u003e\n\u003cp\u003eSimply put, he wasn’t encumbered with the need to please others. His skill at matchmaking was based on his knowledge of psychology, as he claimed, but he obviously had good instincts, too. His success rate was impressive, and if he honestly felt John-the-engineer would make her a good husband, then Cassie didn’t doubt it for an instant.\u003c/p\u003e\n\u003cp\u003e“He’s an engineer,” she murmured.\u003c/p\u003e\n\u003cp\u003e“Simon?”\u003c/p\u003e\n\u003cp\u003e“No, my match. Simon offered me a crumb of information yesterday.”\u003c/p\u003e\n\u003cp\u003e“An engineer,” Shawn echoed. “I guess your kids will be left-brained.”\u003c/p\u003e\n\u003cp\u003e“That’s what Simon said,” she returned excitedly.\u003c/p\u003e\n\u003cp\u003eShawn looked surprised. “You told him about your IQ?”\u003c/p\u003e\n\u003cp\u003e“No, but it was on the questionnaire.” In high school, her high IQ had been an embarrassment rather than an asset. She always used to insist that scoring well on a test didn’t make her any different from everyone else. She still felt that way—although it did get her through two chemistry degrees in four years instead of six.\u003c/p\u003e\n\u003cp\u003e“Mom was always proud of your intelligence,” Shawn reminded her.\u003c/p\u003e\n\u003cp\u003e“It didn’t matter to our father, though, did it?” As a child, Cassie had thought it was her fault their father had left the family. Although it made no sense for a seven-year-old to assume that kind of blame, she had. Later, she’d learned this was fairly typical in situations like this. They’d all been devastated, but she’d unconsciously taken on the role of scapegoat.\u003c/p\u003e\n\u003cp\u003e“Speaking of Dad…”\u003c/p\u003e\n\u003cp\u003eCassie already knew what was coming. “He called you?”\u003c/p\u003e\n\u003cp\u003eShawn nodded.\u003c/p\u003e\n\u003cp\u003e“His yearly sojourn into fatherhood! Lucky you. This year it was your turn to receive the great gift of his phone call. What did he have to say?”\u003c/p\u003e\n\u003cp\u003e“He saw one of my murals and wanted to tell me he was impressed.”\u003c/p\u003e\n\u003cp\u003eCassie shrugged. “That was nice.”\u003c/p\u003e\n\u003cp\u003e“A surprise, actually.”\u003c/p\u003e\n\u003cp\u003eCassie knew how long Shawn had waited for any praise from their father. They rarely discussed him; the subject was still too painful for them both.\u003c/p\u003e\n\u003cp\u003e“Where was he?” The last she’d heard, he was living aboard his sailboat somewhere in the Caribbean.\u003c/p\u003e\n\u003cp\u003e“Hawaii.”\u003c/p\u003e\n\u003cp\u003eCassie chuckled. “Really? Wouldn’t it be amusing if he ran into Mom on the streets of Honolulu?”\u003c/p\u003e\n\u003cp\u003eShawn shook his head. “She’s over him. She forgave him a long time ago.”\u003c/p\u003e\n\u003cp\u003e“Mom’s a better woman than I am.” Talking about their father depressed her. “Can’t we discuss something else? Something more cheerful—like bank foreclosures?”\u003c/p\u003e\n\u003cp\u003eShawn snorted. “Very funny.”\u003c/p\u003e\n\u003cp\u003e“I don’t know why he bothers,” she said.\u003c/p\u003e\n\u003cp\u003e“I thought we weren’t going to discuss Dad.”\u003c/p\u003e\n\u003cp\u003e“Right. Sorry.”\u003c/p\u003e\n\u003cp\u003eShawn drank the last of his coffee and stood. “I’ve gotta go.”\u003c/p\u003e\n\u003cp\u003e“You mean you aren’t going to stay and help me trim the tree?”\u003c/p\u003e\n\u003cp\u003e“Can’t. I’ve got an…appointment.”\u003c/p\u003e\n\u003cp\u003eFrom the gleam in his eyes, this so-called appointment involved a woman. “You’ve got a date.”\u003c/p\u003e\n\u003cp\u003e“I’m not telling.”\u003c/p\u003e\n\u003cp\u003eIt really wasn’t fair. Cassie had to pay tens of thousands of dollars to meet men, and her brother had women falling all over him. It must be those piercing blue eyes of his—plus, of course, the fact that he was talented, rich and eligible. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-perfect-christmas/page-9.html","bookId":2633,"creation":"Oct 5, 2019 10:16:39 PM","modification":"Oct 5, 2019 10:16:39 PM"}
