{"id":71427,"no":48,"title":"Page 48","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eI swallow hard, understanding what she’s saying. “But I could have tried harder.”\u003c/p\u003e\n\u003cp\u003e“And in the end I’m sure I still would have put the needle in my arm,” she says. “And probably went out the window.”\u003c/p\u003e\n\u003cp\u003e“Maybe not though.”\u003c/p\u003e\n\u003cp\u003e“But maybe.” She pauses. “But we’ll never know. And it’s not for you to feel guilty when I can’t even remember you.”\u003c/p\u003e\n\u003cp\u003eI shake my head. She’s still so London and it’s crazy. “I guess so.” I get what she’s saying. I really do. But it’s hard to accept because we’ll never know what might have happened or might not have happened if I’d just gotten her to put the needle down.\u003c/p\u003e\n\u003cp\u003e“I don’t want to talk about me anymore,” she says dismissively. “I’m always talking about myself—with my mom, the doctors, everyone I come across who used to know me. I get so sick of it.”\u003c/p\u003e\n\u003cp\u003e“What do you want to talk about, then?” I ask, leaning back in the seat, feeling a little lighter and at the same time a little sadder because I know this is it. This is how things will always be between us and I can’t change it.\u003c/p\u003e\n\u003cp\u003e“You.” She crosses her legs and stares me down so hard I swear she’s trying to burn a hole in my head.” Tell me, Ethan Gregory, this girl who’s the best you’ve ever had, do you love her?”\u003c/p\u003e\n\u003cp\u003e“Love?” I ask. “You want to talk about love?”\u003c/p\u003e\n\u003cp\u003eShe nods. “I do.”\u003c/p\u003e\n\u003cp\u003eI shrug, feeling uncomfortable under her scrutiny. “What the fuck is love anyway?” Giving your heart to someone completely? Saying here, take it, I’m yours? Letting them love you, hug you, own you? Yell at you and tell you you’re worthless? Hold you and tell you you’re important? What is the definition of love? How can you tell?\u003c/p\u003e\n\u003cp\u003eI open my mouth and decide to just go for it, letting the first answer that pops into my head slip out. “I think I do.” My mind is flying about a million miles an hour with the declaration and it’s hard to process, especially since I just said it for the first time in front of my ex-girlfriend who has amnesia.\u003c/p\u003e\n\u003cp\u003eShe tilts her head to the side, studying me. “Did you love me?”\u003c/p\u003e\n\u003cp\u003eI think about her question, knowing the real answer, but it’s hard to admit it. “I think I did, but in a different way.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“Our love was kind of chaotic and careless and we really didn’t know each other enough to actually completely love each other.” I reach into my pocket and retrieve the bracelet London gave me, the one with our initials intertwined. “But I think in some way or another we did have some kind of love for each other.” I lean over the table, holding my hand out to give her the bracelet.\u003c/p\u003e\n\u003cp\u003e“But not as much as this other girl?” she asks, taking the bracelet from my hand. “What is this?”\u003c/p\u003e\n\u003cp\u003e“You made it for me,” I say, leaning back. “You said it would always help me remember the time we spent together.”\u003c/p\u003e\n\u003cp\u003eShe runs her finger along the leather. “Was I going to break up with you when I gave it to you? Because it kind of sounds like I was.”\u003c/p\u003e\n\u003cp\u003eI shrug and then shake my head. “You could have been thinking about it, but honestly I don’t know. Half the time I never knew what you were thinking.”\u003c/p\u003e\n\u003cp\u003eShe grins as she looks down at the bracelet in her hand. “And now you’ll never know.” Leave it to London to have a sick and twisted sense of humor about the whole thing. But she’s right. I’ll never know what she was thinking, how she really felt, how I really felt, because we never got around to telling each other. I was so afraid of my feelings that I held them in and now the chance to tell her is gone. She’ll never know whether I loved her or not. How much I cared for her. I’ll never know if she felt the same way, whether she loved me so much she’d hang on to me if something happened to me and I was no longer part of her life. I will never know a lot of stuff about our relationship and there’s no changing that. It’s done. Final.\u003c/p\u003e\n\u003cp\u003e“I guess not.” I offer her a small smile.\u003c/p\u003e\n\u003cp\u003eShe continues to stare at the bracelet, looking sadder with each passing moment. Finally she sighs and sets it down on the table. “So tell me something happy,” she says, shifting her mood in the amount of time it takes me to catch my breath. “And not about my past.”\u003c/p\u003e\n\u003cp\u003eI take a deep breath and start telling her about the last few years of my life, which aren’t really happy or sad, just neutral, because I’ve basically been stuck in the same mentality, never moving forward, always thinking about the past. Except in this very moment, I want to be moving forward to the other side of the country to be with some else. By the time we’re done talking, it’s midafternoon. My flight doesn’t leave until the morning, but the idea of waiting until then seems impossible. I need to see Lila now and I need to tell her how I feel so I don’t miss my chance again.\u003c/p\u003e\n\u003cp\u003eChapter Seventeen\u003c/p\u003e\n\u003cp\u003eLila\u003c/p\u003e\n\u003cp\u003e“So I’ve come to the conclusion that I’m becoming a very bad influence on you,” Ella says as she roams through my old room in my parents’ three-story mansion located up in the greener, more luxurious side of town. The ocean rushes toward the shore from outside the window and the sun beams brightly against the pale pink walls.\u003c/p\u003e\n\u003cp\u003e“I guess so.” I open my closet and walk into it, the immense space almost overwhelming because it’s been a long time since I’ve seen it. So many memories overwhelm me, ones filled with loathing from my parents and self-loathing from myself. For a moment, I swear to God the damn walls feel like they’re closing in on me again.\u003c/p\u003e\n\u003cp\u003eI run my fingers along the fabrics of each dress and shirt, remembering what it was like to have an endless amount of clothes, money, anything of material value. I was showered with things, and in return, I was not showered with affection and love. I would trade anything, live on the streets in a soggy wet box, just to have my parents genuinely love me.\u003c/p\u003e\n\u003cp\u003eElla steps up behind me and evaluates my closet. “Are you sure your maid’s not going to tell your mom or dad we snuck in here?”\u003c/p\u003e\n\u003cp\u003eI shrug as I sift through the dresses, the sight of each one making me sick to my stomach, because each one carries a memory of a time I wish I could forget. All the horrible things I’ve done in them, all the horrible things I felt. “I doubt it. She hates my mother and father almost as much as I do. It doesn’t really matter, though.” From the back section, I select a dress that flows to the floor. “I mean, what are they going to do? Kick me out?”\u003c/p\u003e\n\u003cp\u003e“How about make you stay,” she says from behind me. “I know you don’t want to be here.”\u003c/p\u003e\n\u003cp\u003e“I don’t.” I glance over my shoulder at her, forcing a smile. “I guess you’ll just have to owe me for this big time.”\u003c/p\u003e\n\u003cp\u003e“I think that all kind of depends on why you brought me here.” She wanders around, her eyes huge as she takes in the large selection of shoes on the back wall. “Because I’m really confused right now.”\u003c/p\u003e\n\u003cp\u003eI smile at her and then hold the dress out toward her. “We’re here for this.”\u003c/p\u003e\n\u003cp\u003eElla examines the dress with a wary expression on her face. “What is that?”\u003c/p\u003e\n\u003cp\u003e“You’re such a goof sometimes. Seriously.” I push the dress at her. “It’s for you. I thought you could wear it at your wedding.”\u003c/p\u003e\n\u003cp\u003eShe stares at the dress that has a shimmering black silk top, a red ribbon securing the back, and an elegant flowing white bottom bunched together in places by red and black sewn roses. She tentatively reaches out and touches the fabric with a stoic expression as she runs her fingers along one of the black flowers.\u003c/p\u003e\n\u003cp\u003e“Where did you get this?” she asks, touching the silk top.\u003c/p\u003e\n\u003cp\u003e“I wore it one year for… for Halloween,” I say, choking down the images of what I did while wearing the dress. I drank drink after drink that night and chased them down with pills. I’m surprised I didn’t end up in the hospital, although I probably would have been better off, instead of sleeping with two different guys in the same night and then throwing up alone in the bathroom afterward. I almost puke just thinking about it now, thinking about who I was.\u003c/p\u003e\n\u003cp\u003eShe glances up at me. “You wore this for Halloween?”\u003c/p\u003e\n\u003cp\u003eI nod. “But it was actually just a dress I bought from a store and then turned it into a Victorian-style dress.”\u003c/p\u003e\n\u003cp\u003e“I guessed that much.” She lets her arm fall to her side. “But it looks so… unlike anything you would wear.”\u003c/p\u003e\n\u003cp\u003eI laugh, because she’s right, yet at the same time I’m also standing next to her in an old pair of shorts and a band T-shirt I stole form Ethan’s room. “I guess, but it was also Halloween and I was supposed to dress up as something unlike myself.”\u003c/p\u003e\n\u003cp\u003e“That’s true.” Her gaze returns to the dress and she bites back a smile. “Can I try it on?”\u003c/p\u003e\n\u003cp\u003e“Of course.” I hand it to her and head for the door so she can change in the closet. “You’re not offended I gave you an old costume, though, are you?” I ask as I shut the door.\u003c/p\u003e\n\u003cp\u003eShe shakes her head, slipping the dress’s straps off the hanger. “Are you kidding me? It’s, like, the perfect dress, Lila. Seriously.”\u003c/p\u003e\n\u003cp\u003eI smile. “I thought it might be.”\u003c/p\u003e\n\u003cp\u003e“Lila?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eShe offers me a genuine smile and makes me feel good inside, like I did something right. “Thank you.”\u003c/p\u003e\n\u003cp\u003eI return her smile wholeheartedly. “You’re welcome.”\u003c/p\u003e\n\u003cp\u003eI shut the door and sink down on the four-post bed. It still has the same satin white comforter on it that’s trimmed with lace. There are fluffy throw pillows all over it and the same floor-length curtains hang over the French doors. Everything is clean and tidy. Everything looks perfect. When I turned thirteen my mom spent weeks redecorating this room as a birthday present for me. I told her I wanted a pool party with my friends. Hell, I would have taken letting my friends come over and hang out over curtains and pillows that made the room pretty in theory—but it’d always felt so overly empty and unwelcoming. This used to be my life, and even back then I didn’t like it very much, yet I always kept going with it because it was what I was supposed to do. This kind of lifestyle, flourishing on the outside and no substance on the inside, was ingrained into my mind since the day I entered the world. I was pretty much doomed to be just like either my mom or my sister, and I would have probably ended up like one of them eventually, but I got lucky. Lucky because I met Ethan. He saved me not just from an addiction but also from myself. He showed me that I was worth getting clean. I’m worth more than self-destruction and emptiness. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-temptation-of-lila-and-ethan-the-secret-3/page-48.html","bookId":1971,"creation":"Oct 5, 2019 10:20:26 AM","modification":"Oct 5, 2019 10:20:26 AM"}
