{"id":15508,"no":11,"title":"CHAPTER X. ON THE SCENT","content":"\u0026nbsp;It appeared to Stanley, on the way home that morning, that the conversation flagged somewhat. He therefore set to himself the task of reviving it. \n\u003cdiv\u003e\n “Christian,” he began conversationally, “is there any smuggling done now? Real smuggling, I mean.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I think not,” replied Christian. He evidently did not look upon smuggling as a fruitful topic at that moment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why do you ask?” interposed Hilda goodnaturedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I was just wondering,” replied the boy. “It struck me yesterday that our boat had been moved.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But,” suggested Christian, “it should be very easy to see whether it has been dragged over the sand or not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Three strong men could carry it bodily into the water and make no marks whatever on the sand,” argued little Stanley, determined not to be cheated out of his smugglers.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps some one has been out for a row for his own pleasure and enjoyment,” suggested Christian, without thinking much of what he was saying.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then how did he get the padlock open?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Smugglers, I suppose,” said Hilda, smiling down at her small brother, “would be provided with skeleton keys.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course,” replied Stanley in an awestruck tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will tell you what we will do, Stanley,” said Christian. “To-morrow morning we will go and have a bathe; at the same time I will look at the boat and tell you whether it has been moved.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unless,” added Hilda, “a telegram comes today.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Christian laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unless,” he said gravely, “the world comes to an end this evening.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It happened during the precise moments occupied by this conversation, that Mr. Bodery, seated at his table in the little editor\u0027s room, opened the flimsy brown envelope of a telegram. He spread out the pink paper, and Mr. Morgan, seated opposite, raised his head from the closely-written sheets upon which his hand was resting.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is from Vellacott,” said the editor, and after a moment\u0027s thought he read aloud as follows:—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Letter and papers received; believe I have dropped into the clue of the whole affair. Will write particulars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Morgan caressed his heavy moustache with the end of his penholder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That young man,” he said, “goes about the world with his eyes remarkably wide open, ha-ha!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bodery rolled the telegram out flat with his pencil silently.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Stanley Carew was so anxious that the inspection of the boat should not be delayed, that an expedition to the Cove was arranged for the same afternoon. Accordingly the five young people walked across the bleak tableland together. Huge white clouds were rolling up from the south-west, obscuring every now and then the burning sun. A gentle breeze blew gaily across the bleak upland—a very different breath from that which twisted and gnarled the strong Scotch firs in winter-time.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You would not care about climbing down there, I should think,” observed Sidney, when they had reached the Cove. “It is a very different matter getting up.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He was standing, gazing lazily up at the brown cliffs with his straw hat tilted backwards, his hands in his pockets, and his whole person presenting as fair a picture as one could desire of lazy, quiescent strength—a striking contrast to the nervous, wiry townsman at his side.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hardly,” replied Christian, gazing upwards at the dizzy height. “It is rather nasty stuff—slippery in parts and soft.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned and strolled off by Hilda\u0027s side. With a climber\u0027s love of a rocky height he looked upwards as they walked, and she noted the direction of his gaze.\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently they sat on the edge of the boat over which Stanley\u0027s sense of proprietorship had been so grievously outraged.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you know, Christian, or what do you suspect about Signor Bruno?” asked Hilda suddenly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Stanley was running across the sands towards them, and Christian, seeing his approach, avoided the question by a generality.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Wait a little longer,” he said. “Let me have Trevetz\u0027s answer to confirm my suspicions, and then I will tell you. Suspicions are dangerous things to meddle with. In imparting them to other people it is so difficult to remember that they are suspicions and nothing more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n At this moment Stanley arrived and threw himself down breathlessly on the warm sand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Chris!” he exclaimed, “come down here and look at these seams in the boat—the damp is there still.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The boat was clinker-built, and where the planks overlapped a slight appearance of dampness was certainly discernible. Christian lay lazily leaning upon his elbow, sometimes glancing at the boat in obedience to Stanley\u0027s accusatory finger, sometimes looking towards Hilda, whose eyes were turned seawards.\n\u003c/div\u003e \n\u003cdiv\u003e\n Suddenly he caught sight of some words pencilled on the stern-post of the boat, and by the merest chance refrained from calling Stanley\u0027s attention to them. Drawing nearer, he could read them easily enough.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp; \u0026nbsp; \u0026nbsp;Minuit vingt-six.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It certainly looks,” he said rising, “as if the boat had been in the water, but it may be that the dampness is merely owing to heavy dew. The boat wants painting, I think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He knew well enough that little Stanley\u0027s suspicions were correct. There was no doubt that the boat had been afloat quite recently; but Christian knew his duty towards the Beacon and sacrificed his strict sense of truth to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n On the way home he was somewhat pre-occupied—as much, that is to say, as he was in the habit of allowing. The pencil scrawl supplied food enough for conjectural thought. The writing was undoubtedly fresh, and this was the 26th of the month. Some appointment was made for midnight by the words pencilled on the boat, and the journalist determined that he would be there to see. The question was, should he go alone? He watched Sidney Carew walking somewhat heavily along in front of him, and decided that he would not seek aid from that quarter. There was no time to communicate with Mr. Bodery, so the only course open to him was to go by himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n In a vague manner he had connected the Jesuit party with the disturbances in Paris and the importation of the English rifles wherewith the crowd had been armed. The gay capital was at that time in the hands of the most “Provisional” and uncertain Government imaginable, and the home politics of France were completely disorganised. It was just the moment for the Church party to attempt a retrieval of their lost power. The fire-arms had been recognised by the English authorities as some of a pattern lately discarded. They had been stored at Plymouth, awaiting shipment to the colonies, where they were to be served out to the auxiliary forces, when they had been cleverly removed. The robbery was not discovered until the rifles were found in the hands of a Paris mob, still fresh and brutal from the horrors of a long course of military law. Some of the more fiery of the French journals boldly hinted that the English Government had secretly sold the firearms with a view to their ultimate gain by the disorganisation of France.\n\u003c/div\u003e \n\u003cdiv\u003e\n Christian knew as much about affairs in Paris as most men. He was fully aware that in the politics of a disturbed country a deed is either a crime or a heroism according to circumstances, and he was wise enough to await the course of events before thrusting his opinion down the public throat. But now he felt that the crisis had supervened, and unwillingly he recognised that it was not for him to be idle amidst those rapid events.\n\u003c/div\u003e \n\u003cdiv\u003e\n These thoughts occupied his mind as he walked inland from the Cove, and rendered his answers to Stanley\u0027s ceaseless flow of questions upon all conceivable subjects somewhat vague and unreliable. Hilda was walking with them, and divided with Christian the task of supplying her small brother with varied information.\n\u003c/div\u003e \n\u003cdiv\u003e\n As they were approaching the Hall, Christian discerned two figures upon the smooth lawn, evidently coming towards them. At the same moment Stanley perceived them.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see Fred Farrar and Mr. Signor Bruno,” he exclaimed.\n\u003c/div\u003e \n\u003cdiv\u003e\n Christian could not resist glancing over the little fellow\u0027s head towards Hilda, though he knew that it was hardly a fair action. Hilda felt the glance but betrayed no sign. She was looking straight in front of her with no change of colour, no glad smile of welcome for her stalwart lover.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder why she never told me,” thought Christian.\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently he said, in an airy, conversational way: “I did not know Farrar was coming back so—so soon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He knew that by this early return Farrar was missing an important day of the race-meeting he had been attending, but did not think it necessary to remark upon the fact.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” replied Hilda. “He does not like to leave his mother for many days together.” The acutest ears could have detected no lowering of the voice, no tenderness of thought. She was simply stating a fact; but she might have been speaking of Signor Bruno, so cool and unembarrassed was her tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad he is back,” said Christian thoughtlessly. It was a mere stop-gap. The silence was awkward, but he possessed tact enough to have broken it by some better means. Instantly he recognised his mistake, and for a moment he felt as if he were stumbling blindfold through an unknown country. He experienced a sudden sense of vacuity as if his mind were a blank and all words futile. It was now Stanley\u0027s turn to break the silence, and unconsciously he did it very well.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder,” he said speculatively, “whether he has brought any chocolate creams?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Hilda laughed, and the smile was still hovering in her eyes when she greeted the two men. Stanley ran on into the house to open a parcel which Farrar told him was awaiting inspection. It was only natural that Hilda should walk on with the young squire, leaving Bruno and Christian together. The old man lingered obviously, and his companion took the hint readily enough, anticipating some enjoyment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To you, Mr. Vellacott,” said the Italian, with senile geniality, “to you whose life is spent in London this must be very charming, very peaceful, and—very disorganising, I may perhaps add.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Christian looked at his companion with grave attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is very enjoyable,” he replied simply.\n\u003c/div\u003e \n\u003cdiv\u003e\n Signor Bruno mentally trimmed his sails, and started off on another tack.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Our young friends,” he said, indicating with a wave of his expressive hand Hilda and Farrar, “are admirably suited to each other. Both young, both handsome, and both essentially English.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Christian, with a polite display of interest: “and, nevertheless, the Carews were all brought up and educated in France.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah!” observed the old man, stopping to raise the head of a “Souvenir de Malmaison,” of which he inhaled the odour with evident pleasure. The little ejaculation, and its accompanying action, were admirably calculated to leave the hearer in doubt as to whether mere surprise was expressed or polite acquiescence in the statement of a known fact.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” added Christian, deliberately. He also stooped and raised a white rose to his face, thus meeting Signor Bruno upon his own ground. The Italian looked up, and the two men smiled at each other across the rose bush; then they turned and walked on.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You also know France?” hazarded Signor Bruno.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; if I were not an Englishman I should choose to be a Frenchman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now with me,” said Signor Bruno frankly, “it is different. If I were not an Italian (which God forbid!) I think—I think, yes, I am sure, I would by choice have been born an Englishman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah!” observed Christian gravely, and Signor Bruno turned sharply to glance at his face. The young Englishman was gazing straight in front of him earnestly, with no suspicion upon his lips of the incredulous smile which seemed somehow to have lurked there when he last spoke. The Italian turned away dissatisfied, and they walked on a few paces in silence, until he spoke again, reflectively:—\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he said, “there is a quality in the English character which to me is very praiseworthy. It is a certain directness of purpose. You know what you wish to do, and you proceed calmly to do it, without stopping to consider what your neighbours may think of it. Now with the Gallic races—for I take this virtue of straightforwardness as Teutonic—and in my own country especially, men seek to gain their ends by less open means.”\n\u003c/div\u003e \n\u003cdiv\u003e\n They were now walking up a gentle incline to the house, which was built upon the buried ruins of its ancient predecessor, and Signor Bruno was compelled to pause in order to gain breath.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But,” interposed Christian softly, “you are now talking not so much of the people as of the Church.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Again the Italian looked sharply up, and this time he met his companion\u0027s eyes fixed quietly on his face. He shrugged his shoulders deprecatingly and spread out his delicate hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps you are right,” he said, with engaging frankness. “I am afraid you are. But you must excuse a little ill-feeling in a man such as I, with a past such as mine has been, and loving his country as I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am afraid,” continued Christian, “that foreigners find our bluntness very disagreeable and difficult to meet; but I know that they frequently misjudge us on the same account. It is to our benefit, so we cannot complain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “In what way do we misjudge you?” asked Signor Bruno genially. They were almost on the threshold of the drawing-room window, which stood invitingly open, and from which came the sounds of cups and saucers being mated.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You give us credit for less intelligence than we in reality possess,” said Christian with a smile, as he stood aside to let his companion pass in first.\n\u003c/div\u003e \n\u003cdiv\u003e\n Whatever influences may have been at work among those congregated at the Hall during the half-hour or so occupied by afternoon tea, no sign appeared upon the surface. Molly as usual led the chorus of laughter. Hilda smiled her sweet “kittenish” smile. Signor Bruno surpassed himself in the relation of innocent little tales, told with a true southern “verve” and spirit, while Fred Farrar\u0027s genial laugh filled in the interstices reliably. Grave and unobtrusive, Christian moved about among them. He saw when Molly wanted the hot water, and was invariably the first to detect an empty cup. He laughed softly at Signor Bruno\u0027s stories, and occasionally capped them with a better, related in a conciser and equally humorous manner. It was to him that Farrar turned for an encouraging acquiescence when one of his latest Newmarket anecdotes threatened to fall flat, and with it all he found time for an occasional spar with Signor Bruno, just by way of keeping that inquiring gentleman upon his guard.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2876/79590.html","bookId":1162,"creation":"Aug 2, 2019 7:01:54 AM","modification":"Aug 2, 2019 7:01:54 AM"}
