{"id":15514,"no":17,"title":"CHAPTER XVI. FOES","content":"\u0026nbsp;It is only when our feelings are imaginary that we analyse them. When the real thing comes—the thing that only does come to a few of us—we can only feel it, and there is no thought of analysis. Moreover, the action is purely involuntary. We feel strange things—such things as murder—and we cannot help feeling it. We may cringe and shrink; we may toss in our beds when we wake up with such thoughts living, moving, having their being in our brains—but we cannot toss them off. The very attempt to do so is a realisation, and from consciousness we spring to knowledge. We know that in our hearts we are thieves, murderers, slanderers; we know that if we read of such thoughts in a novel we should hold the thinker in all horror; but we are distinctly conscious all the time that these thoughts are our own. This is just the difference existing between artificial feelings and real: the one bears analysis, the other cannot. \n\u003cdiv\u003e\n Hilda Carew could not have defined her feelings on the evening of the arrival of Mr. Bodery and the Vicomte d\u0027Audierne. She was conscious of the little facts of everyday existence. She dressed for dinner with singular care; during that repast she talked and laughed much as usual, but all the while she felt like any one in all the world but Hilda Carew. At certain moments she wondered with a throb of apprehension whether the difference which was so glaringly patent to herself could possibly be hidden from others. She caught strange inflections in her own voice which she knew had never been there before—her own laughter was a new thing to her. And yet she went on through dinner and until bedtime, acting this strange part without break, without fault—a part which had never been rehearsed and never learnt: a part which was utterly artificial and yet totally without art, for it came naturally.\n\u003c/div\u003e \n\u003cdiv\u003e\n And through it all she feared the Vicomte d\u0027Audierne. Mr. Bodery counted for nothing. He made a very good dinner, was genial and even witty in a manner befitting his years and station. Mrs. Carew was fully engaged with her guests, and Molly was on lively terms with the Vicomte; while Sidney, old Sidney—no one counted him. It was only the Vicomte who paused at intervals during his frugal meal, and looked across the table towards the young girl with those deep, impenetrable eyes—shadowless, gleamless, like velvet.\n\u003c/div\u003e \n\u003cdiv\u003e\n When bedtime at length arrived, she was quite glad to get away from that kind, unobtrusive scrutiny of which she alone was aware. She went to her room, and sitting wearily on the bed she realised for the first time in her life the incapacity to think. It is a realisation which usually comes but once or twice in a lifetime, and we are therefore unable to get accustomed to it. She was conscious of intense pressure within her brain, of a hopeless weight upon her heart, but she could define neither. She rose at length, and mechanically went to bed like one in a trance. In the same way she fell asleep.\n\u003c/div\u003e \n\u003cdiv\u003e\n In the meantime Mr. Bodery, Sidney Carew, and the Vicomte d\u0027Audierne were smoking in the little room at the side of the porch. A single lamp with a red shade hung from the ceiling in the centre of this room, hardly giving enough light to read by. There were half-a-dozen deep armchairs, a divan, and two or three small tables—beyond that nothing. Sidney\u0027s father had furnished it thus, with a knowledge and appreciation of Oriental ways. It was not a study, nor a library, nor a den; but merely a smoking-room. Mr. Bodery had lighted an excellent cigar, and through the thin smoke he glanced persistently at the Vicomte d\u0027Audierne. The Vicomte did not return this attention; he glanced at the clock instead. He was thinking of Signor Bruno, but he was too polite and too diplomatic to give way to restlessness.\n\u003c/div\u003e \n\u003cdiv\u003e\n At last Mr. Bodery opened fire from, as it were, a masked battery; for he knew that the Frenchman was ignorant of his connection with one of the leading political papers of the day. It was a duel between sheer skill and confident foreknowledge. When Mr. Bodery spoke, Sidney Carew leant back in his chair and puffed vigorously at his briar pipe.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Things,” said the Englishman, “seem to be very unsettled in France just now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte was engaged in rolling a cigarette, and he finished the delicate operation before looking up with a grave smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he said. “In Paris. But Paris is not France. That fact is hardly realised in England, I think.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What,” inquired Mr. Bodery, with that conversational heaviness of touch which is essentially British, “is the meaning of this disturbance?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Sidney Carew was enveloped in a perfect cloud of smoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n For a moment—and a moment only—the Vicomte\u0027s profound gaze rested on the Englishman\u0027s face. Mr. Bodery was evidently absorbed in the enjoyment of his cigar. The smile that lay on his genial face like a mask was the smile of a consciousness that he was making himself intensely pleasant, and adapting his conversation to his company in a quite phenomenal way.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah!” replied the Frenchman, with a neat little shrug of bewilderment. “Who can tell? Probably there is no meaning in it. There is so often no meaning in the action of a Parisian mob.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Many things without meaning are not without result.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Again the Vicomte looked at Mr. Bodery, and again he was baffled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You only asked me the meaning,” he said lightly. “I am glad you did not inquire after the result; because there I should indeed have been at fault. I always argue to myself that it is useless to trouble one\u0027s brain about results. I leave such matters to the good God. He will probably do just as well without my assistance.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are a philosopher,” said Mr. Bodery, with a pleasant and friendly laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank Heaven—yes! Look at my position. Fancy carrying in France to-day a name that is to be found in the most abridged history. One needs to be a philosopher, Mr. Bodery.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But,” suggested the Englishman, “there may be changes. It may all come right.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte sipped his whisky and water with vicious emphasis.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If it began at once,” he said, “it would never be right in my time. Not as it used to be. And in the meantime we are in the present—in the present France is governed by newspaper men.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Sidney drew in his feet and coughed. Some of his smoke had gone astray.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bodery looked sympathetic.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” he said calmly, “that really seems to be the case.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And newspaper men,” pursued the Vicomte, “what are they? Men of no education, no position, no sense of honour. The great aim of politicians in France to-day is the aggrandisement of themselves.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bodery yawned.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah!” he said, with a glance towards Sidney.\n\u003c/div\u003e \n\u003cdiv\u003e\n Perhaps the Frenchman saw the glance, perhaps he was deceived by the yawn. At all events, he rose and expressed a desire to retire to his room. He was tired, he said, having been travelling all the previous night.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bodery had not yet finished his cigar, so he rose and shook hands without displaying any intention of following the Vicomte\u0027s example.\n\u003c/div\u003e \n\u003cdiv\u003e\n Sidney lighted a candle, one of many standing on a side table, and led the way upstairs. They walked through the long, dimly lighted corridors in silence, and it was only when they had arrived in the room set apart for the Vicomte d\u0027Audierne that this gentleman spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “By the way,” he said, “who is this person—this Mr. Bodery? He was not a friend of your father\u0027s.” Sidney was lighting the tall candles that stood upon the dressing-table, and the combined illumination showed with remarkable distinctness the reflection of his face in the mirror. From whence he stood the Frenchman could see this reflection.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is the friend of a great friend of mine; that is how we know him,” replied Sidney, prizing up the wick of a candle. He was still rising to the occasion—this dull young Briton. Then he turned. “Christian Vellacott,” he said; “you knew his father?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, yes: I knew his father.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Sidney was moving to the door without any hurry, and also without any intention of being deterred.\n\u003c/div\u003e \n\u003cdiv\u003e\n “His father,” continued the Vicomte, winding his watch meditatively, “was brilliant. Has the son inherited any brain?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think so. Good night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n When the door was closed the Vicomte looked at his watch. It was almost midnight.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The Reverend Father Talma will have to wait till to-morrow morning,” he said to himself. “I cannot go to him to-night. It would be too theatrical. That old gentleman is getting too old for his work.”\n\u003c/div\u003e \n\u003cdiv\u003e\n In the meantime, Sidney returned to the little smoking-room at the side of the porch. There he found Mr. Bodery smoking with his usual composure. The younger man forbore asking any questions. He poured out for himself some whisky, and opened a bottle of soda-water with deliberate care and noiselessness.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That man,” said Mr. Bodery at length, “knows nothing about Vellacott.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You think so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am convinced of it. By the way, who is the old gentleman who came to tea this afternoon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Signor Bruno, do you mean?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose so—that super-innocent old man with the white hair who wears window-glass spectacles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are they window-glass?” asked Sidney, with a little laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They struck me as window-glass—quite flat. Who is he—beyond his name, I mean?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is an Italian refugee—lives in the village.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bodery had taken his silver pencil from his waistcoat pocket, and was rolling it backwards and forwards on the table. This was indicative of the fact that the editor of the Beacon was thinking deeply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah! And how long has he been here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only a few weeks.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bodery looked up sharply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is that all?” he inquired, with an eager little laugh.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, my dear sir, Vellacott is right. That old man is at the bottom of it. This Vicomte d\u0027Audierne, what do you know of him?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Personally?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is an old friend of my father\u0027s. In fact, he is a friend of the family. He calls the girls by their Christian names, as you have heard to-night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; I noticed that. And he came here to-day merely on a friendly visit?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is all. Why do you ask?” inquired Sidney, who was getting rather puzzled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know nothing of him personally—except what I have learnt to-day. For my own part, I like him,” answered Mr. Bodery. “He is keen and clever. Moreover, he is a thorough gentleman. But, politically speaking, he is one of the most dangerous men in France. He is a Jesuit, an active Royalist, and a staunch worker for the Church party. I don\u0027t know much about French politics—that is Vellacott\u0027s department. But I know that if he were here, and knew of the Vicomte\u0027s presence in England, he would be very much on the alert.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then,” asked Sidney, “do you connect the presence of the Vicomte here with the absence of Vellacott?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There can be little question about it, directly or indirectly. Indirectly, I should think, unless the Vicomte d\u0027Audierne is a scoundrel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Sidney thought deeply.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He may be,” he admitted.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not,” pursued Mr. Bodery, with a certain easy deliberation, “think that the Vicomte is aware of Vellacott\u0027s existence. That is my opinion.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He asked who you were—if you were a friend of my father\u0027s.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And you said—”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No! I said that you were a friend of a friend, and mentioned Vellacott\u0027s name. He knew his father very well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were you”—asked Mr. Bodery, throwing away the end of his cigar and rising from his deep chair—“were you looking at the Vicomte when you answered the question?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And there was no sign of discomfort—no flicker of the eyelids, for instance?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; nothing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bodery nodded his head in a businesslike way, indicative of the fact that he was engaged in assimilating a good deal of useful information.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is nothing to be done to-night,” he said presently, as he made a movement towards the door, “but to go to bed. To-morrow the Beacon will be published, and the result will probably be rather startling. We shall hear something before to-morrow afternoon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Sidney lighted Mr. Bodery\u0027s candle and shook hands.\n\u003c/div\u003e \n\u003cdiv\u003e\n “By the way,” said the editor, turning back and speaking more lightly, “if any one should inquire—your mother or one of your sisters—you can say that I am not in the least anxious about Vellacott. Good night.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2876/79596.html","bookId":1162,"creation":"Aug 2, 2019 7:02:06 AM","modification":"Aug 2, 2019 7:02:06 AM"}
