{"id":15515,"no":18,"title":"CHAPTER XVII. A RETREAT","content":"\u0026nbsp;It was quite early the next morning when the Vicomte d\u0027Audierne left his room. As he walked along the still corridor and down the stairs it was noticeable that he made absolutely no sound, without, however, indulging in any of those contortions which are peculiar to late arrivals in church. It would seem that Nature had for purposes of her own made his footfall noiseless—if, by the way, Nature can be credited with any purpose whatever in her allotment of human gifts and failings. \n\u003cdiv\u003e\n In the hall he found a stout cook armed for assault upon the front-door step.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Good morning,” he said. “Can you tell me the breakfast-hour? I forgot to inquire last night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nine o\u0027clock, sir,” replied the servant, rather taken aback at the thought of having this visitor dependent upon her for entertainment during the next hour and a half.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah—and it is not yet eight. Never mind. I will go into the garden. I am fond of fruit before breakfast.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He took his hat and lounged away towards the kitchen-garden which lay near the moat.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And now,” he said to himself, looking round him in a searching way, “where is this pestilential village?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The way was not hard to find, and as the church clock struck eight the Vicomte d\u0027Audierne opened the little green gate of the cottage where Signor Bruno was lodging.\n\u003c/div\u003e \n\u003cdiv\u003e\n The old gentleman must have been watching for him; for he opened the door before the Vicomte reached it.\n\u003c/div\u003e \n\u003cdiv\u003e\n He turned and led the way into a little room on the right hand of the narrow passage. A little room intensely typical: china dogs, knitted antimacassars of a brilliant tendency, and horse-hair covered furniture. There was even the usual stuffy odour as if the windows, half-hidden behind muslin curtains and scarlet geraniums, were never opened from one year\u0027s end to another.\n\u003c/div\u003e \n\u003cdiv\u003e\n Signor Bruno closed the door before speaking. Then he turned upon his companion with something very like fury glittering in his eyes.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why did you not come last night?” he asked. “I am left alone to contend against one difficulty on the top of another. Read that!”\n\u003c/div\u003e \n\u003cdiv\u003e\n He drew from his pocket a thin and somewhat crumpled sheet of paper, upon which there were two columns of printed matter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That,” he said, “cost us two thousand francs.” The Vicomte d\u0027Audierne read the printed matter carefully from beginning to end. He had approached the window because the light was bad, and when he finished he looked up for a few minutes, out of the little casement, upon the quiet village scene.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The Beacon,” he said, turning round, “what is that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A leading weekly newspaper.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Published—?\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-day,” snapped Signor Bruno.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte d\u0027Audierne made a little grimace.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who wrote this?” he inquired.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Christian Vellacott, son of the Vellacott, whom you knew in the old days.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah!”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was something in the Vicomte\u0027s expressive voice that made Signor Bruno look at him sharply with some apprehension.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why do you say that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte countered with another question.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is this Mr. Bodery?”\n\u003c/div\u003e \n\u003cdiv\u003e\n He gave a little jerk with his head in the direction of the house he had just left.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I do not know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was told last night that he was a friend of this Christian Vellacott—a protector.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The two Frenchmen looked at each other in silence. Signor Bruno was evidently alarmed—his lips were white and unsteady. There was a smile upon the bird-like face of the younger man, and behind his spectacles his eyes glittered with an excitement in which there was obviously no fear.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know,” he asked in a disagreeably soft manner, “where Christian Vellacott is?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Across the benevolent old face of Signor Bruno here came a very evil smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will do better not to ask me that question,” he replied, “unless you mean to run for it—as I do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte d\u0027Audierne looked at his companion in a curious way.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You had,” he said, “at one time no rival as a man of action—”\n\u003c/div\u003e \n\u003cdiv\u003e\n Signor Bruno shrugged his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am a man of action still.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte folded the proof-sheet carefully, handed it back to his companion, and said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I understand that—there will be no more of these very clever articles?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Bruno nodded his head.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I ask no questions,” continued the other. “It is better so. I shall stay where I am for a few days, unless it grows too hot—unless I think it expedient to vanish.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have courage?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; I have impertinence—that is all. There will be a storm—a newspaper storm. The embassies will be busy; in the English Parliament some pompous fool will ask a question, and be snubbed for his pains. In the Chambre the newspaper men will rant and challenge each other in the corridors; and it will blow over. In the meantime we have got what we want, and we can hide it till we have need of it. Your Reverence and I have met difficulties together before this one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But Signor Bruno was not inclined to fall in with these optimistic views.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not so sure,” he said, “that we have got what we want. There has been no acknowledgment of receipt of the last parcel—in the usual way—the English Standard.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What was the last parcel?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Fifty thousand cartridges.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But they were sent?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; they were despatched in the usual way; but, as I say, they have not been acknowledged. There may have been some difficulty on the other side. Our police are not so easy-going as these coastguard gentlemen.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said the aristocrat, with that semi-bantering lightness of manner which sometimes aggravated, and always puzzled, his colleagues, “we will not give ourselves trouble over that: the matter is out of our hands. Let us rather think of ourselves. Have you money?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—I have sufficient.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is now eight o\u0027clock—this newspaper—this precious Beacon is now casting its light into some dark intellects in London. It will take those intellects two hours to assimilate the information, and one more hour to proceed to action. You have, therefore, three hours in which to make yourself scarce.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have arranged that,” replied the old man calmly. “There is a small French potato-ship lying at Exmouth. In two hours I shall be one of her crew.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is well. And the others?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The others left yesterday afternoon. They cross by this morning\u0027s boat from Southampton to Cherbourg. You see how much I have had to do.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I see also, my friend, how well you have done it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “And now,” said Signor Bruno, ignoring the compliment, “I must go. We will walk away by the back garden across the fields. You must remember that you may have been seen coming here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have thought of that. One old man saw me, but he did not look at me twice. He will not know me again. And your landlady—where is she?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have sent her out on a fool\u0027s errand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As they spoke they left the little cottage by the back door, as Signor Bruno had proposed, through the little garden, and across some low-lying fields. Presently they parted, Signor Bruno turning to the left, while the Vicomte d\u0027Audierne kept to the right.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We shall meet, I suppose,” were the last words of the younger man, “in the Rue St. Gingolphe?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes—in the Rue St. Gingolphe.”\n\u003c/div\u003e \n\u003cdiv\u003e\n For so old a man the pace at which Signor Bruno breasted the hill that lay before him was somewhat remarkable. The Vicomte d\u0027Audierne, on the other hand, was evidently blessed with a greater leisure. He looked at his watch and strolled on through the dew-laden meadows, wrapt in thought as in a cloak that hid the sweet freshness of the flowery hedgerows, that muffled the broken song of the busy birds, that killed the scent of ripening hay. Thus these two singular men parted—and it happened that they were never to meet again. These little things do happen. We meet with gravity; we part with a smile; perhaps we make an appointment; possibly we speak of the pleasure that the meeting seems to promise: and the next meeting is put off; it belongs to the great postponement.\n\u003c/div\u003e \n\u003cdiv\u003e\n Often we part with an indifferent nod, as these two men parted amidst the sylvan peace of English meadow on that summer morning. They belonged to two different stations in life almost as far apart as two social stations could be, even in a republic. They were not, in any sense of the word, friends; they were merely partners, intensely awake, as partners usually are, to each other\u0027s shortcomings.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte d\u0027Audierne probably thought no more of Signor Bruno from the moment that he raised his hat and turned. A few moments later his thoughts were evidently far away.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The son of Vellacott,” he muttered, as he took a cigarette from a neat silver case. “How strange! And yet I am sorry. He might have done something in the world. That article was clever—very clever—curse it! He cannot yet be thirty. But one would expect something from the son of a man like Vellacott.”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was not yet nine o\u0027clock when the Vicomte entered the dining-room by the open window. Only Hilda was there, and she was busy with the old leather post-bag. Among the letters there were several newspapers, and the Vicomte d\u0027Audierne\u0027s expression underwent a slight change on perceiving them. His thin, mobile lips were closely pressed, and his chin—a very short one—was thrust forward. Behind the gentle spectacles his eyes assumed for a moment that singular blinking look which cannot be described in English, for it seemed to change their colour. In his country it would have been called glauque.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah, Hilda!” he said, approaching slowly, “do I see newspapers? I love a newspaper!”\n\u003c/div\u003e \n\u003cdiv\u003e\n She handed him the Times enveloped in a yellow wrapper, upon which was printed her brother\u0027s name and address.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah,” he said lightly, “the Times—estimable, but just a trifle opaque. Is that all?”\n\u003c/div\u003e \n\u003cdiv\u003e\n His eyes were fixed upon two packets she held in her hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “These are Mr. Bodery\u0027s,” she replied, looking at him with some concentration.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And what newspaper does Mr. Bodery read?” asked the Frenchman, holding out his hand.\n\u003c/div\u003e \n\u003cdiv\u003e\n She hesitated for a moment. His position with regard to her was singular, his ascendency over her had never been tried. It was an unknown quantity; but the Vicomte d\u0027Audierne knew his own power.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me look, little girl,” he said quietly in French.\n\u003c/div\u003e \n\u003cdiv\u003e\n She handed him the newspapers, still watching his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The Beacon,” he muttered, reading aloud from the ornamented wrapper, “a weekly journal.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He threw the papers down and returned to the Times, which he unfolded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me, Hilda,” he said, “is Mr. Bodery connected with this weekly journal, the Beacon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Her back was turned towards him. She was hanging up the key of the post-bag on a nail beside the fireplace.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” she replied, without looking round.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Is he the editor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte d\u0027Audierne turned the Times carelessly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Ah!” he muttered, “the phylloxera has appeared again.”\n\u003c/div\u003e \n\u003cdiv\u003e\n For some time he appeared to be absorbed in this piece of news, then he spoke again.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I knew something of a man who writes for that newspaper—the Beacon. I knew his father very well.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte glanced at her.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Christian Vellacott,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We know him also,” she answered, moving towards the bell. He made a step forward as if about to offer to ring the bell for her, but she was too quick.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the butler entered the room, Hilda reminded him of some small omission in setting out the breakfast-table. The item required was in the room, and the man set it upon the table with some decision and a slightly aggrieved cast of countenance.\n\u003c/div\u003e \n\u003cdiv\u003e\n The Vicomte d\u0027Audierne raised his eyes, and then he looked very grave. He was a singular man in many ways, but those who worked with him were aware of one peculiarity which by its prominence cast others into the shade. He possessed a very useful gift rarely given to men—the gift of intuition. It was dangerous to think when the eyes of the Vicomte d\u0027Audierne were upon one\u0027s face. He had a knack of knowing one\u0027s thoughts before they were even formulated. He looked grave—almost distressed—on this occasion, because he knew something of which Hilda herself was ignorant. He knew that she was engaged to be married to one man while she loved another.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2876/79597.html","bookId":1162,"creation":"Aug 2, 2019 7:02:08 AM","modification":"Aug 2, 2019 7:02:08 AM"}
