{"id":96641,"no":12,"title":"Page 12","content":"\u003cp\u003eI think we need a break from everything,\" Brandon said on the phone to me before I went to bed. \"I have just the idea for a little R \u0026amp; R tomorrow.\"\u003c/p\u003e\n\u003cp\u003eI was in great need of rest and relaxation, and it would be wonderful for Brandon and me to have some free time spent together, forgetting all about Ryder, Nash, and the effects of the full moon.\u003c/p\u003e\n\u003cp\u003e\"Pack a swimsuit and sunscreen,\" he said, \"and I\u0027ll pick you up around nine thirty.\"\u003c/p\u003e\n\u003cp\u003eAt nine fifteen, I was anxiously waiting outside my house for Brandon. I wore a bikini under a pair of hiking shorts and a light blue tank top. He pulled into my driveway at nine thirty, a canoe tied to the top of his Jeep. I got into his SUV, and we drove down the twisty and hilly back roads of the Westside. His grandmother had packed sandwiches, fruit, and drinks in a cooler. The windows were rolled down, and the music was turned up. We sang along to our favorite songs as we headed over a two-lane bridge. I gazed out - endless trees and a high river. I was having the best time already. We continued on and passed open fields, farms, and horse stables. We came around a corner to the bank of the river and parked in a gravel parking lot. There were a handful of people already there - and kids running around with oars and life jackets.\u003c/p\u003e\n\u003cp\u003eI felt funny being in my bathing suit in front of Brandon, so I just took off my T-shirt and kept my shorts on. I wasn\u0027t tan yet - and I knew I needn\u0027t be - but I did feel self-conscious. The life jacket was lumpy, making me feel even more unattractive than I felt before.\u003c/p\u003e\n\u003cp\u003e\"You sit in front,\" he said with the confidence of a navy commander.\u003c/p\u003e\n\u003cp\u003eI hopped in, and he pushed the canoe against the sandy embankment and into the river as he jumped in behind me.\u003c/p\u003e\n\u003cp\u003eI paddled a bit while he steered. Our surroundings were beautiful. Within a few minutes we were in the middle of the river, trees and summerhouses lining the sides. There was no sign of normal traffic even though the roads weren\u0027t too far away from us.\u003c/p\u003e\n\u003cp\u003eI leaned back and closed my eyes. The sun\u0027s rays felt amazing against my skin. The smell of the river was fresh from the beginning of spring. In a few months, this same river would be hot and muggy, and mosquitoes would be pecking at us. It was a perfect time to canoe.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d love to do this every day,\" I said. \"Thank you for bringing me! I can\u0027t imagine Ivy on the river.\"\u003c/p\u003e\n\u003cp\u003e\"I can\u0027t, either.\"\u003c/p\u003e\n\u003cp\u003e\"Abby - she\u0027d love it. But we get so busy with school and things, we don\u0027t think of doing fun stuff like this.\"\u003c/p\u003e\n\u003cp\u003e\"Things seem different since I\u0027ve changed. I feel the need to be outside as much as possible. I loved the outdoors before - but now I can\u0027t seem to get enough of it. I almost feel claustrophobic in school or in my room at home. Here you can feel so free.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing out here to bother us.\" Just then I glanced up. I thought I saw red and blond hair peeking out from one of the trees. \"Is that - \"\u003c/p\u003e\n\u003cp\u003eBrandon looked in the direction I had, but the guys were gone.\u003c/p\u003e\n\u003cp\u003e\"What?\"\u003c/p\u003e\n\u003cp\u003e\"I thought I saw Leopold - or Hunter.\"\u003c/p\u003e\n\u003cp\u003e\"They are supposed to be at my house, chopping wood. I offered to pay them, and they accepted. I knew that would keep them busy for a while and help me out at the same time. They can\u0027t be a danger to us now.\"\u003c/p\u003e\n\u003cp\u003e\"I know,\" I said. But did I really? Why couldn\u0027t they be? Were they only dangerous if they were in werewolf form? I didn\u0027t feel like we were so alone anymore.\u003c/p\u003e\n\u003cp\u003eBrandon tried to distract me. \"Cool, there\u0027s a rope swing on that tree. You want to go for a swing?\"\u003c/p\u003e\n\u003cp\u003e\"I couldn\u0027t possibly.\"\u003c/p\u003e\n\u003cp\u003e\"Sure you can. I\u0027ll go, too.\"\u003c/p\u003e\n\u003cp\u003eWe beached the canoe and watched as several kids, one by one, climbed up the tree, then the branch, grabbed the rope, and swung into the water.\u003c/p\u003e\n\u003cp\u003eIt looked like great fun. Only when it was our turn, it wasn\u0027t as easy as it appeared. I grabbed the branch and tried my best to keep my footing. Brandon was right behind me, and he laughed at me as I squealed several times.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m doing my best,\" I said.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re almost there,\" he encouraged.\u003c/p\u003e\n\u003cp\u003eThe water seemed farther away than it had when we were looking up at the rope. The other kids were back in their boats but were watching me.\u003c/p\u003e\n\u003cp\u003e\"You can do it,\" one shouted.\u003c/p\u003e\n\u003cp\u003eI grabbed the rope, and it shook in my hands.\u003c/p\u003e\n\u003cp\u003eIf Brandon wasn\u0027t standing behind me, I would have surely turned around and climbed down. But he smiled as if he was so proud of me, and I didn\u0027t want to disappoint him.\u003c/p\u003e\n\u003cp\u003eI took a deep breath and jumped off the branch. I only knew that I was screaming with delight as I swung in the air, and before I knew it I was smacking my body into the water. It wasn\u0027t an Olympic feat by any stretch of the imagination. I treaded water while I watched Brandon take my place.\u003c/p\u003e\n\u003cp\u003eBrandon waved and quickly swung in after me. He was much more graceful. I swam over to him.\u003c/p\u003e\n\u003cp\u003e\"That was so much fun,\" I said. Then I giggled. \"I was afraid I\u0027d lose my top!\"\u003c/p\u003e\n\u003cp\u003e\"I was kind of hoping you would,\" he teased.\u003c/p\u003e\n\u003cp\u003e\"Get out - \" I toyed with him. I swam away and headed for the embankment.\u003c/p\u003e\n\u003cp\u003eWhen I glanced up, I saw Ryder leaning against a tree.\u003c/p\u003e\n\u003cp\u003eI gasped. I turned to Brandon, who was still swimming toward me.\u003c/p\u003e\n\u003cp\u003e\"Brandon,\" I whispered. But he was still too far away.\u003c/p\u003e\n\u003cp\u003eI turned back to Ryder, who was still standing there. This time he gave me a wink. I cringed inside. I didn\u0027t know what he was up to, but I felt like he was invading our space and good time.\u003c/p\u003e\n\u003cp\u003eAll at once, I felt someone behind me, pinching my sides.\u003c/p\u003e\n\u003cp\u003eI screamed.\u003c/p\u003e\n\u003cp\u003eI turned around to find Brandon laughing.\u003c/p\u003e\n\u003cp\u003e\"Why are you so nervous?\" he said. \"Who did you think it was?\"\u003c/p\u003e\n\u003cp\u003e\"Ryder is over there,\" I whispered to him so he could hear.\u003c/p\u003e\n\u003cp\u003eHe glanced around.\u003c/p\u003e\n\u003cp\u003e\"Where?\"\u003c/p\u003e\n\u003cp\u003e\"By the tree.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see him.\"\u003c/p\u003e\n\u003cp\u003eI turned around casually. Ryder had gone.\u003c/p\u003e\n\u003cp\u003eI headed farther up the embankment and searched as much as I could from where I was.\u003c/p\u003e\n\u003cp\u003e\"He was right over there - \" I said, pointing.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay. Even if they are here - what does it matter?\"\u003c/p\u003e\n\u003cp\u003e\"Haven\u0027t you seen those movies? Someone following people on the river? There are tons of them.\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay,\" he said, pulling me close. \"If he is here, he\u0027s doing exactly what he wants - getting under your skin. The best thing is to ignore him. Have a good time. That\u0027s the best payback.\"\u003c/p\u003e\n\u003cp\u003eI nodded my head. \"You\u0027re right.\"\u003c/p\u003e\n\u003cp\u003eBrandon never asked for anything. And this was one opportunity that he could just be himself. I shouldn\u0027t let anyone get in the way. Even if it was upsetting to me.\u003c/p\u003e\n\u003cp\u003eI did see Ryder again, but I didn\u0027t say anything to Brandon. I kept my cool and talked really loudly about how good of a time I was having.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s okay,\" Brandon whispered. \"I sense him spying on us. But we don\u0027t have to worry about it. This is our time together.\"\u003c/p\u003e\n\u003cp\u003eHe leaned in to me and kissed me long. His luscious lips sent tingles racing along my damp skin.\u003c/p\u003e\n\u003cp\u003eWe ate our sandwiches and cuddled in the canoe. The atmosphere, sounds, and scenery were breathtaking, and being in the wilderness with my now-human but soon-to-be-werewolf boyfriend was magical. I wasn\u0027t going to let another lycan spoil these precious moments anymore.\u003c/p\u003e\n\u003cp\u003eAfter some more relaxing, we stretched out and then packed up our lunches and resumed our trip.\u003c/p\u003e\n\u003cp\u003eAs we made our way down the river, there were a few rapids, and with Brandon\u0027s guidance we made our way through them. It was exhilarating; I felt a rush paddling through them. \"I wish there were more,\" I said.\u003c/p\u003e\n\u003cp\u003eBefore I knew it, we\u0027d come to the pickup point.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s over already?\"\u003c/p\u003e\n\u003cp\u003e\"Next we can do the five-mile trip.\"\u003c/p\u003e\n\u003cp\u003e\"My arms are sore from paddling, I have to admit.\"\u003c/p\u003e\n\u003cp\u003eWe got into the van, and Brandon massaged my arms.\u003c/p\u003e\n\u003cp\u003eI leaned my head on his shoulder as I looked back. I saw Ryder standing at the edge of the embankment - staring up at me. This time I bravely looked back at him and waved. He was lucky the gesture was a polite one.\u003c/p\u003e\n\u003cp\u003eThe full moon was fast approaching, and I knew changes would soon be happening. I was just hoping I wouldn\u0027t be one of those to change. \u003c/p\u003e","sourceLink":"https://allnovel.net/full-moon-kisses-full-moon-3/page-12.html","bookId":2150,"creation":"Oct 5, 2019 6:21:53 PM","modification":"Oct 5, 2019 6:21:53 PM"}
