{"id":96644,"no":15,"title":"Page 15","content":"\u003cp\u003eI was heading outside to walk Champ when I spotted Nash sauntering up my driveway. \"Hey, Celeste,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Oh...hi,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I really have to thank you and Brandon for what you both have done,\" he said. \"You know, he really is like you - generous.\"\u003c/p\u003e\n\u003cp\u003eI half smiled. I was pleased that Nash was so appreciative about Brandon and recognized the wonderful traits I saw.\u003c/p\u003e\n\u003cp\u003e\"But - I\u0027m also sorry. I was so obsessed with becoming cured, I couldn\u0027t see beyond that. What it really meant for you - Brandon - the town. I guess I should have tried to help.\"\u003c/p\u003e\n\u003cp\u003e\"There\u0027s nothing you can do about it now,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Well, at least we know the cure works. No side effects. All we have to do is have Brandon take it,\" he said.\u003c/p\u003e\n\u003cp\u003e\"There are other werewolves in town. I told you. Brandon won\u0027t take the serum.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about? He has to.\"\u003c/p\u003e\n\u003cp\u003e\"You know what I\u0027m talking about. I already told you this. Tonight at the fest. Ryder and his friends are planning to try to convert me.\"\u003c/p\u003e\n\u003cp\u003eNash groaned. \"What did I do? I should have waited like you asked.\"\u003c/p\u003e\n\u003cp\u003e\"I understand why you did that. I\u0027m not sure what I would have done.\"\u003c/p\u003e\n\u003cp\u003e\"I know what you would have done,\" Nash said. \"You would have waited another day just because I asked you to. And because it might have been the right thing to do. That\u0027s who you are. But I\u0027m not like you, am I?\"\u003c/p\u003e\n\u003cp\u003e\"It was a difficult choice,\" I said.\u003c/p\u003e\n\u003cp\u003e\"It was right there in front of me. I didn\u0027t want to be a werewolf. Not even for one more night. That\u0027s all I was thinking about.\"\u003c/p\u003e\n\u003cp\u003e\"I understand.\"\u003c/p\u003e\n\u003cp\u003e\"But I can help you out now. I am still strong and can protect you and Ivy and Abby.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s okay,\" I said. \"We are going to stay at my house tonight. And those guys think we\u0027ll be at the fest, so they\u0027ll never know where we really are.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll come over, too. I\u0027ll be your bodyguard.\"\u003c/p\u003e\n\u003cp\u003e\"You don\u0027t have to do that,\" I said. But it did sound like a good idea to have someone with us.\u003c/p\u003e\n\u003cp\u003e\"I insist. It\u0027s the least I can do.\"\u003c/p\u003e\n\u003cp\u003e\"So Brandon will be a werewolf alone - trying to ward off those guys, and you\u0027ll come to my house and watch movies? No, I\u0027d rather you keep an eye out at the fest, just in case Brandon needs help.\"\u003c/p\u003e\n\u003cp\u003e\"Are you sure?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, and maybe you could bring Jake and Dylan, too. We might need the extra muscle.\" \"I am still so surprised you aren\u0027t going to the festival tonight,\" my mom said when she got home from work. I was straightening up the family room and double-checking that we had enough snacks for the evening.\u003c/p\u003e\n\u003cp\u003e\"We\u0027re not into werewolves,\" I told her.\u003c/p\u003e\n\u003cp\u003e\"But they\u0027ll be showing movies, and people will be dressing up in costumes. I would think you\u0027d want to do it, if only to see everyone in town. Besides, when we took you and your sister last time it came around, you loved it.\"\u003c/p\u003e\n\u003cp\u003e\"I was seven,\" I said, putting a stack of movies next to the TV. But the truth was, I did love it then, and I knew I would have loved it this time, too. If I didn\u0027t think we were in serious danger, I would be having the time of my life. Not only would I be hanging out with my friends, watching scary werewolf movies and eating such treats as bloodred licorice and French-fried fangs, but Brandon would be able to be in front of everyone in his lycan form and they\u0027d just think he was dressing for the festival. I did feel awful missing the best event in this town in ten years. I\u0027d have to wait until I was twenty-seven to attend the next one. However, I knew I was doing the right thing.\u003c/p\u003e\n\u003cp\u003eIt was after eight. Ivy and Abby still hadn\u0027t shown up. I was starting to get worried. Had Ryder already gotten to them? I texted Ivy.\u003c/p\u003e\n\u003cp\u003eI waited a few minutes until she texted back.\u003c/p\u003e\n\u003cp\u003eWith Jake at the fest. Sorry. We just got here. He wanted to enter the contest. PDHM.Please Don\u0027t Hate Me? My best friends stood me up - and now I was going to be all alone. I\u0027m sure I\u0027d be safe at home - but what if I wasn\u0027t?\u003c/p\u003e\n\u003cp\u003eI had to go now, too. Fuming, I rushed to put on my Red Riding Hood outfit from Halloween. Who knew, but it might also protect me from Ryder finding me. I grabbed my purse and keys and jumped into my car and headed straight for the Werewolf Festival.\u003c/p\u003e\n\u003cp\u003eThere was a lot of traffic as I approached downtown - the location of the festival. Everything was decorated with balloons, and I could already see werewolves of all shapes and sizes walking up and down the street.\u003c/p\u003e\n\u003cp\u003eThe last time I attended the fest, I was seven, and I remembered sitting out on the lawn with my family. Even Juliette enjoyed it. But now I was approaching the fest on my own, trying to find my own real werewolf. All kinds of werewolves roamed the street - masked ones, painted ones, cartoon ones.\u003c/p\u003e\n\u003cp\u003eFood and souvenir vendors lined the street, and a huge white tent was in the middle park area. The main street was closed to traffic, but I could see from where I was that all spaces in view were occupied. If I couldn\u0027t find a parking place, I\u0027d be stuck driving around all night and wouldn\u0027t be able to catch up to my friends.\u003c/p\u003e\n\u003cp\u003eI called Brandon as I sat in traffic.\u003c/p\u003e\n\u003cp\u003e\"Where are you?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m at the fest. Are you having fun with your friends?\"\u003c/p\u003e\n\u003cp\u003e\"What friends? They stood me up. They are here somewhere.\"\u003c/p\u003e\n\u003cp\u003e\"Here?\" he asked. \"Where are you?\"\u003c/p\u003e\n\u003cp\u003e\"Trying to find a parking space.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m by Sixth Street. There are some empty lots.\"\u003c/p\u003e\n\u003cp\u003eI passed a guy who was parking and drove toward Sixth Street. I saw Brandon on the corner, pointing to a vacant space.\u003c/p\u003e\n\u003cp\u003eI pulled in, and Brandon kindly gave the lot owner money.\u003c/p\u003e\n\u003cp\u003eI took a moment to catch my breath. Brandon was standing in the lot, barefoot and shirtless, his chest heaving like he\u0027d run a race. His hair was wildly long and untamed. I ran up to him and kissed him.\u003c/p\u003e\n\u003cp\u003e\"What happened to your plans?\" he asked when we drew apart.\u003c/p\u003e\n\u003cp\u003e\"They didn\u0027t come,\" I said, disappointed. \"So I\u0027m here.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I guess we tried,\" he said. \"I\u0027ll just have to keep an eye out for you. You promise not to leave my side?\"\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t want to be anywhere else,\" I said.\u003c/p\u003e\n\u003cp\u003eWe walked a few blocks to the entrance of the festival.\u003c/p\u003e\n\u003cp\u003eI called Ivy, but she didn\u0027t answer.\u003c/p\u003e\n\u003cp\u003eThen I called Abby. She didn\u0027t answer her phone, either.\u003c/p\u003e\n\u003cp\u003e\"How am I going to find them?\" I asked.\u003c/p\u003e\n\u003cp\u003eThe whole town was out for the festival.\u003c/p\u003e\n\u003cp\u003eIt really was a splendid event, if I hadn\u0027t been so distracted by everything.\u003c/p\u003e\n\u003cp\u003e\"Do you know where Ryder is?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I tried to get him to meet me - so we could go together. But he ditched me, too.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027ve both been stood up tonight,\" I said.\u003c/p\u003e\n\u003cp\u003e\"I\u0027d much rather be with you,\" he said. \"Under the full moonlight. It really agrees with you. You are so beautiful.\"\u003c/p\u003e\n\u003cp\u003eI couldn\u0027t help but blush and leaned into him, giving him a tight squeeze.\u003c/p\u003e\n\u003cp\u003eJust then we heard screaming.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s that?\" I asked.\u003c/p\u003e\n\u003cp\u003eFear shot through me. All I could think of was Ivy and Abby being attacked by Ryder and his friends.\u003c/p\u003e\n\u003cp\u003eWe raced in the direction of the scream and when we arrived, we saw that it was only a few girls riding a mini - roller coaster.\u003c/p\u003e\n\u003cp\u003e\"I guess I\u0027m a bit jumpy,\" I said.\u003c/p\u003e\n\u003cp\u003eI heard someone call my name from behind me.\u003c/p\u003e\n\u003cp\u003e\"Celeste!\"\u003c/p\u003e\n\u003cp\u003eI turned around. It was Ivy, Abby, Dylan, and Jake. Dylan and Jake were dressed haphazardly as werewolves, with drawn-on beards and plastic fangs. And Ivy and Abby both were pretty as damsels in distress, with torn outfits.\u003c/p\u003e\n\u003cp\u003e\"We are so sorry,\" Ivy said.\u003c/p\u003e\n\u003cp\u003e\"Will you forgive us?\" Abby asked.\u003c/p\u003e\n\u003cp\u003eI was angry. How could I not be? But I had other things to worry about now.\u003c/p\u003e\n\u003cp\u003e\"Finally, we are all here,\" I said. \"We need to stick together. There is safety in numbers.\"\u003c/p\u003e\n\u003cp\u003e\"Afraid a werewolf will get us?\" Ivy asked, giggling.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" I said truthfully.\u003c/p\u003e\n\u003cp\u003e\"Well, Brandon can save us,\" Abby said. \"He\u0027s always doing that - and tonight he even looks like a werewolf.\"\u003c/p\u003e\n\u003cp\u003e\"The costume contest is going to be in an hour,\" Abby said. \"How about having some fun until then?!\"\u003c/p\u003e\n\u003cp\u003eWe all headed for the rides, where we bought tickets and rode the Octopus, the Scrambler, and finally the Ferris wheel. When Brandon and I were at the top, the ride stopped to let another group on. We looked around from our bird\u0027s-eye view to see if we could spot any real werewolves.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t see them,\" I said.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s hard when everyone looks like werewolves.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s what they were counting on,\" I said.\u003c/p\u003e\n\u003cp\u003eAs the Ferris wheel started up again, an announcement came over the loudspeaker calling all contestants to the stage to enter the werewolf costume contest.\u003c/p\u003e\n\u003cp\u003eWe all headed over. One by one, the boys filled out the entry forms and took their places onstage. So did Ryder\u0027s crew.\u003c/p\u003e\n\u003cp\u003eMany people participated. The contestants walked across the stage in front of the howling crowd.\u003c/p\u003e\n\u003cp\u003eThe two judges were local radio celebrities who made notes as they examined the contestants.\u003c/p\u003e\n\u003cp\u003eAfter several rounds of eliminations, five contestants were chosen to stand onstage: Ryder, Leopold, Hunter, Nash, and Brandon.\u003c/p\u003e\n\u003cp\u003eNo one knew that four of the five were really werewolves - and the fifth used to be one.\u003c/p\u003e\n\u003cp\u003eThe emcee pulled at Hunter\u0027s red beard. \"This seems real,\" he said. \"Did you grow this just for the contest?\"\u003c/p\u003e\n\u003cp\u003eThe crowd laughed.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Hunter said. \"And the fangs, too.\" He grinned, flashing his wolf fangs. The emcee stepped back.\u003c/p\u003e\n\u003cp\u003e\"Wow - those look real. I think there\u0027s a wolf out there tonight that is missing some teeth.\"\u003c/p\u003e\n\u003cp\u003eThe crowd laughed again.\u003c/p\u003e\n\u003cp\u003e\"The four runners-up will win fifty dollars each,\" the emcee continued. \"And our grand-prize winner will take home one hundred.\u003c/p\u003e\n\u003cp\u003e\"And now, for our grand-prize winner, the Legend\u0027s Run werewolf for the evening goes to...Nash Hamilton!\"\u003c/p\u003e\n\u003cp\u003eIvy, Abby, Jake, and Dylan cheered with delight at Nash\u0027s victory. I couldn\u0027t believe the irony. Nash was the winner? The only one who wasn\u0027t a werewolf? I had to crack up inside. It was really so odd that the real werewolves weren\u0027t recognized as such. And it appeared Nash was really excited by his victory, as he threw his hands in the air, while Leopold and Hunter seemed disappointed and scoffed as they left the stage. I watched Ryder glare at Brandon as they walked backstage. Within a moment, the real werewolves disappeared.\u003c/p\u003e\n\u003cp\u003eBrandon eventually found us standing in the waiting area. When Nash joined us, Ivy and Abby congratulated him on his prize.\u003c/p\u003e\n\u003cp\u003e\"Where is Ryder?\" I asked.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t know. He slipped out,\" Nash said.\u003c/p\u003e\n\u003cp\u003e\"That means he could be anywhere.\" I was concerned.\u003c/p\u003e\n\u003cp\u003e\"I know.\" Nash shook his head in frustration. \"I should have kept my eye on him.\"\u003c/p\u003e\n\u003cp\u003e\"We\u0027re going to the candy stand,\" Ivy said.\u003c/p\u003e\n\u003cp\u003e\"And we\u0027re going to the movie,\" Abby said. \"We can all meet up in fifteen minutes.\"\u003c/p\u003e\n\u003cp\u003e\"No,\" I said, \"we have to stay together.\"\u003c/p\u003e\n\u003cp\u003eBut my friends and their boyfriends were already heading off in separate directions.\u003c/p\u003e\n\u003cp\u003e\"What do we do now?\" I asked Brandon.\u003c/p\u003e\n\u003cp\u003eHe looked around as if he was longing to have fun like everyone else.\u003c/p\u003e\n\u003cp\u003e\"We should be able to enjoy this,\" I told him. \"But instead...\"\u003c/p\u003e\n\u003cp\u003e\"Well, why can\u0027t we? As long as you are next to me, nothing can happen to you.\"\u003c/p\u003e\n\u003cp\u003eHe grabbed my hand tightly.\u003c/p\u003e\n\u003cp\u003e\"Let\u0027s at least enjoy some of the fest,\" he said.\u003c/p\u003e\n\u003cp\u003eHe led me to the games while I glanced around, thinking at any moment Ryder would be stalking me.\u003c/p\u003e\n\u003cp\u003eBrandon and I played some of the games and soon we were lost in our own world, laughing, talking, and winning a prize.\u003c/p\u003e\n\u003cp\u003e\"Pick one out from the top row,\" the carnival operator said to Brandon.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s for you,\" he told me. \"Pick out whichever one you want.\"\u003c/p\u003e\n\u003cp\u003eStuffed bears in every color lined the wall. \"I\u0027d like that one,\" I said, pointing to a cute pink one.\u003c/p\u003e\n\u003cp\u003eThe carnival operator pulled the teddy down and handed it to me. I squeezed it with all my might, then gave my handsome boyfriend a squeeze, too.\u003c/p\u003e\n\u003cp\u003e\"I love it,\" I said.\u003c/p\u003e\n\u003cp\u003eWhen we released our embrace, I turned around and bumped into someone.\u003c/p\u003e\n\u003cp\u003e\"Excuse me,\" I said.\u003c/p\u003e\n\u003cp\u003e\"Excuse me.\" The voice was deep and calm. I looked up. It was Ryder.\u003c/p\u003e\n\u003cp\u003eHe took my hand. \"I was hoping I would bump into you tonight.\" His wolf fangs caught the moonlight.\u003c/p\u003e\n\u003cp\u003eI pulled back my hand, but he didn\u0027t let go. Ryder\u0027s short, spiky hair was long and wavy. He had a thin layer of dark facial hair, and his eyes were intensely gray.\u003c/p\u003e\n\u003cp\u003eI was afraid he was going to try to bite me.\u003c/p\u003e\n\u003cp\u003e\"Hey - \" Brandon said, moving toward Ryder. \"Let her go.\"\u003c/p\u003e\n\u003cp\u003eRyder caressed my hand before releasing it. \"I guess no one believes we are werewolves,\" he said.\u003c/p\u003e\n\u003cp\u003eI backed away, and Brandon stood between us.\u003c/p\u003e\n\u003cp\u003e\"I saw your friends earlier,\" Ryder said. \"We are going to meet up later. Maybe you can join us, too. I was hoping we could all be one happy family.\"\u003c/p\u003e\n\u003cp\u003e\"My friends wouldn\u0027t meet you,\" I shot back. \"Are you crazy?\"\u003c/p\u003e\n\u003cp\u003e\"Like a fox. Or should I say wolf?\"\u003c/p\u003e\n\u003cp\u003e\"We can end this conversation now,\" Brandon said.\u003c/p\u003e\n\u003cp\u003e\"You\u0027d like to pay me back for what I did at the championship game?\" Ryder asked. \"In front of all these people? Go ahead.\" He put his arms out as if he was going to let Brandon hit him. \"Give me your best shot.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m not talking about the past. I\u0027m talking about you leaving her alone.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s not going to happen,\" Ryder said.\u003c/p\u003e\n\u003cp\u003eJust then we heard screaming, and this time it wasn\u0027t coming from the roller coaster. It was coming from behind us. Immediately people were dashing for cover.\u003c/p\u003e\n\u003cp\u003eI turned back and saw several sets of gray eyes at about the height of a dog. Then I noticed their shiny white coats.\u003c/p\u003e\n\u003cp\u003e\"Wolves!\" people yelled. \"There are real wolves!\"\u003c/p\u003e\n\u003cp\u003eCouples and children raced for shelter. I froze as the pack of wolves walked toward us. When they reached us, they stood around Brandon as if he were the leader of their pack.\u003c/p\u003e\n\u003cp\u003eRyder stared at Brandon and the wolves in shock.\u003c/p\u003e\n\u003cp\u003e\"What are you, some freak?\" he asked.\u003c/p\u003e\n\u003cp\u003e\"Yes, I am,\" Brandon said.\u003c/p\u003e\n\u003cp\u003eThe wolves began to growl at Ryder.\u003c/p\u003e\n\u003cp\u003e\"I told you to leave my friends alone,\" Brandon warned.\u003c/p\u003e\n\u003cp\u003e\"They are hanging out with that guy - \" I heard someone say.\u003c/p\u003e\n\u003cp\u003e\"Maybe they are his.\"\u003c/p\u003e\n\u003cp\u003e\"Those are wild animals,\" another said.\u003c/p\u003e\n\u003cp\u003e\"It could be a trick. Maybe he\u0027s their trainer,\" a male\u0027s voice said.\u003c/p\u003e\n\u003cp\u003e\"What\u0027s going on?\" Ivy asked as she and Abby walked up to us.\u003c/p\u003e\n\u003cp\u003eI stared at my friends and then looked back at Ryder.\u003c/p\u003e\n\u003cp\u003e\"There\u0027s something not right about you,\" Ryder said to Brandon. \"Call off those animals.\"\u003c/p\u003e\n\u003cp\u003e\"I need a reason to.\"\u003c/p\u003e\n\u003cp\u003e\"My bite is worse,\" Ryder said, flashing his fangs.\u003c/p\u003e\n\u003cp\u003e\"I wouldn\u0027t count on it.\" Brandon flashed his fangs back.\u003c/p\u003e\n\u003cp\u003eRyder shook his head in disbelief. \"It can\u0027t be - \" he said.\u003c/p\u003e\n\u003cp\u003e\"It can,\" Brandon told him. \"And no one will be the wiser,\" he said. \"It\u0027s a perfect night for this. Everyone will think it\u0027s part of an act. That was my plan.\"\u003c/p\u003e\n\u003cp\u003eThe wolves growled again.\u003c/p\u003e\n\u003cp\u003e\"Call them off,\" Ryder said.\u003c/p\u003e\n\u003cp\u003eNash appeared. He paused when he saw the wolves and Ryder.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a werewolf, too!\" Ryder said. \"The judges even thought so.\"\u003c/p\u003e\n\u003cp\u003eSuddenly Nash straightened up confidently. It was as if Ryder\u0027s words gave him the strength he needed to step up to the situation.\u003c/p\u003e\n\u003cp\u003eNash bravely moved to stand next to Brandon.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Nash said, \"and what are you going to do about it?\"\u003c/p\u003e\n\u003cp\u003eRyder seemed to quake in the presence of Brandon, Nash, and the wolves.\u003c/p\u003e\n\u003cp\u003eThe crowd of onlookers grew curious as security was now on the scene.\u003c/p\u003e\n\u003cp\u003eRyder glared at me - first with fierceness, then at the last moment with a lonely and vulnerable look.\u003c/p\u003e\n\u003cp\u003eHe took off, and within a few seconds Brandon whistled and the wolves howled. Then they ran into the woods.\u003c/p\u003e\n\u003cp\u003eBrandon slapped Nash on the back. Several people started clapping, and many others joined in.\u003c/p\u003e\n\u003cp\u003e\"Wow - that was cool,\" one said. \"I\u0027ve never seen wolves up close.\"\u003c/p\u003e\n\u003cp\u003e\"They were wild - but they seemed as tame as our dog,\" another commented.\u003c/p\u003e\n\u003cp\u003e\"Well, that was so freaky,\" Ivy said. \"I\u0027m getting tired of wild animals hanging out with us.\"\u003c/p\u003e\n\u003cp\u003e\"You meant the wolves or that Ryder guy?\" Abby said with a laugh.\u003c/p\u003e\n\u003cp\u003e\"I can assure you they are gone for the night,\" Brandon said. \"All of them.\"\u003c/p\u003e\n\u003cp\u003eNash beamed and proudly bumped fists with Brandon.\u003c/p\u003e\n\u003cp\u003e\"Now, how about winning you girls some more prizes at the game area?\" Brandon said.\u003c/p\u003e\n\u003cp\u003eWe all wandered over to the booths filled with stuffed animals for those who could puncture a balloon with a dart, knock over a pyramid of milk bottles with a baseball, or toss a ring over the neck of a liter bottle.\u003c/p\u003e\n\u003cp\u003eWe girls smiled as we left the fest with stuffed animals in our hands and hugged good-bye after our eventful evening.\u003c/p\u003e\n\u003cp\u003eBrandon followed me home in his car and came into my house, making sure I was safe and settled in.\u003c/p\u003e\n\u003cp\u003e\"Well, we foiled their big plan,\" I said when we sat on the couch in the living room.\u003c/p\u003e\n\u003cp\u003e\"With Nash\u0027s help,\" Brandon added.\u003c/p\u003e\n\u003cp\u003eWe started to watch Night of the Werewolf.\u003c/p\u003e\n\u003cp\u003e\"I think I\u0027ve had enough werewolves for one evening,\" I said, taking out the DVD and switching to a romantic comedy.\u003c/p\u003e\n\u003cp\u003eBrandon stroked my hair as I leaned against him and started to doze off.\u003c/p\u003e\n\u003cp\u003eWhen I awoke, he was gone and I was holding a stuffed bear instead of him. \u003c/p\u003e","sourceLink":"https://allnovel.net/full-moon-kisses-full-moon-3/page-15.html","bookId":2150,"creation":"Oct 5, 2019 6:21:53 PM","modification":"Oct 5, 2019 6:21:53 PM"}
