{"id":111377,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe propped her fists on her hips. “For the ten shillings I’m paying you, it had better manifest, and right this instant.”\u003c/p\u003e\n\u003cp\u003e“There must rowan or witchbane planted nearby.” The old man glanced around at the neat flower beds. “I fear I am powerless here.”\u003c/p\u003e\n\u003cp\u003e“You dodgy charlatan. If I wanted to be gypped, I’d have hired a Rom.” She pointed to the gate. “Piss off.”\u003c/p\u003e\n\u003cp\u003e“But ye’ve not paid me—” The old man stopped and yelped as the birthday gel bit his hand. “Bloody little savage!”\u003c/p\u003e\n\u003cp\u003eHe swung his stick at her head, but I grabbed it before he could hit her.\u003c/p\u003e\n\u003cp\u003e“You’re a bad man,” I said, and broke the stick in two. “Go away.”\u003c/p\u003e\n\u003cp\u003eHis eyes showed whites all the way around as he pointed a trembling finger at me. “It’s her,” he croaked. “She’s done it, she has.”\u003c/p\u003e\n\u003cp\u003e“Kit?”\u003c/p\u003e\n\u003cp\u003eI looked up at Doyle’s concerned face and realized for the first time just how much I liked it. “Sorry.” The last thing I needed was to go sweet on a cop. “Before Deidre’s mum threw out the old tosser, he called me something. Something nasty. Do you remember what it was?”\u003c/p\u003e\n\u003cp\u003e“I must have missed that part of the tea.” He smiled a little. “Why do you care what a drunken old bully said?”\u003c/p\u003e\n\u003cp\u003e“Because someone called me the same thing today.”\u003c/p\u003e\n\u003cp\u003eThe inspector wasn’t looking me in the eye anymore.\u003c/p\u003e\n\u003cp\u003e“‘Elshy,’” I said. “And I still don’t know what it means. Do you?”\u003c/p\u003e\n\u003cp\u003eHe shook his head.\u003c/p\u003e\n\u003cp\u003eLike all cops, Tommy Doyle knew how to lie. Most defenders of the truth usually did. I decided not to press the issue—for now. “So why have you come to call on Disenchanted \u0026amp; Company, Inspector?”\u003c/p\u003e\n\u003cp\u003e“I’m assigned to the Hill,” he said. “We received a report of a disturbance at Walsh’s Folly yesterday.”\u003c/p\u003e\n\u003cp\u003e“How terrible.” I meant his assignment, not the disturbance.\u003c/p\u003e\n\u003cp\u003e“A young woman imposed herself on one of the wealthier families.” He leaned against my wall. “Apparently she claimed some sort of connection and had to be ordered off the premises.”\u003c/p\u003e\n\u003cp\u003e“What cheek.” The butler had reported me, I guessed. Nolan had no cause, and Diana wouldn’t risk it. “I do hope you find her.”\u003c/p\u003e\n\u003cp\u003e“The lass in question called herself Kittredge.” His mouth stretched and curled. “Do you have a sister I don’t know about?”\u003c/p\u003e\n\u003cp\u003e“As far as I know, I’m the only female Kittredge in the city.” I peered down at the random notes I had scrawled on my blotter. “How odd. I called on Lady Diana Walsh yesterday, at her invitation. I had tea with her and her delightful family before I departed, and that is all. Perhaps there’s been some terrible misunderstanding.”\u003c/p\u003e\n\u003cp\u003e“Lady Walsh will verify your visit?” After my nod he demanded, “Did you go there to extort money from the lady?”\u003c/p\u003e\n\u003cp\u003e“Not at all.” What had that creaky old winge reported, that I was a blackmailer? “I make my money honestly, Inspector. Ask anyone.” I thought of Gert. “Except old witches. They’re not too fond of me.”\u003c/p\u003e\n\u003cp\u003e“You called on a family of means with whom you have no connection. You are unmarried, and you went alone. You know how that looks.” His blue eyes searched my face. “Who hired you, and why?”\u003c/p\u003e\n\u003cp\u003e“I am not employed by the Walshes or anyone on the Hill,” I said truthfully. “As for the ton’s rules of behavior, they do not include women who work for their living.” Now it was my turn to attack. “I didn’t think the Yard gave credence to servants’ gossip. So how does it work, Inspector? Do you run about chasing down every tittle-tattle you hear, or only the really juicy ones?”\u003c/p\u003e\n\u003cp\u003eTwo flags of color rosied the jut of his cheekbones, giving him an unexpectedly boyish look. “Why don’t you tell me the real reason you called on the lady?”\u003c/p\u003e\n\u003cp\u003e“If you don’t believe what I’ve told you, ask her,” I suggested, feeling a little pang in my heart. He’d been a lovely boy, and he was a fetching man, but he was only a few steps above a beater. “I’m sure they’d pass her a note from you, as long as it’s got a Yard seal and has been sprayed for nits. Not like you’re a nobber, right?”\u003c/p\u003e\n\u003cp\u003eDoyle shook his head. “You shame your mother with that mouth, Kit.”\u003c/p\u003e\n\u003cp\u003e“And you’ve covered the Doyle name with glory?” I leaned forward. “What would my dear old uncle Arthur, rest his spirit, think of his grandson, Tommy the copper?”\u003c/p\u003e\n\u003cp\u003eI’d hope that would provoke him enough to send him on his way. Instead, he grinned. “Grandda would have loved seeing me earn my shield, you brat, and you know it.”\u003c/p\u003e\n\u003cp\u003eHis grandfather had come from royal blood, the highest of high posh, the truest of the blue, but the old gent had been inordinately fond of Toriana’s vast working classes, especially those who protected the innocent.\u003c/p\u003e\n\u003cp\u003e“Aye . . . you’re right. He’d have been proud of you, Tommy.” So was I, and in that moment I wished we were two other people. As we were, we’d never have a chance.\u003c/p\u003e\n\u003cp\u003eHe gave me a speculative look. “Why did you leave Middleway for Rumsen? You’ve no people here, Kit.”\u003c/p\u003e\n\u003cp\u003e“No one there, either.” I wasn’t going to tell him how horrible it had been, living in the house where my parents had died, sick with grief, unable to think. How the vultures had barely waited until Mum and Da were in the pyre before coming for me. “As you see, I’m doing all right.”\u003c/p\u003e\n\u003cp\u003e“Very well.” He retrieved his longcoat. “After your mother was sent from the queensland to Toriana, my grandfather made her his ward. She enjoyed his unwavering affection, his protection . . . and confided in him her most guarded secrets.”\u003c/p\u003e\n\u003cp\u003eOld Arthur must have let something slip; he would never have told anyone, not even his own blood. “You needn’t hint, Doyle. I know my mother was a nameless bastard.”\u003c/p\u003e\n\u003cp\u003e“Is that all you know?” Before I could reply, he said, “You’ve worked on the Hill in the past, so you know what you’re tempting. Walsh will do whatever he must to protect his wife’s reputation. But first, he’ll go excavating.”\u003c/p\u003e\n\u003cp\u003eI shrugged. “Let him.”\u003c/p\u003e\n\u003cp\u003e“Walsh belongs to the Tillers,” he continued, referring to the grandest of not-so-secret secret societies for men in Rumsen. “He won’t just dig, Kit. If he can’t find what he wants, he’ll plant it.” He took out a card, wrote something on the back, and handed it to me. “Directions to Mum and Da’s place. I know they’d love you to call.”\u003c/p\u003e\n\u003cp\u003e“How kind of you to say.” I took it, and after a small hesitation gave him one of my own. “Should you ever find yourself in need of my professional services, my rates are quite reasonable.”\u003c/p\u003e\n\u003cp\u003e“I think ten years policing have disenchanted me nicely.” But he pocketed the card. “You’ll stay off the Hill, then?”\u003c/p\u003e\n\u003cp\u003e“I have no plans to return,” I said honestly.\u003c/p\u003e\n\u003cp\u003eHe touched his brim. “Then good day, Miss Kittredge.”\u003c/p\u003e\n\u003cp\u003e“Inspector.” I bobbed with the same courtesy.\u003c/p\u003e\n\u003cp\u003eChapter Six\u003c/p\u003e\n\u003cp\u003eThe gurgling sound of my BrewsMaid roused me from the last minutes of my uncomfortable night sleeping on the office settee. I might have rolled over and tried for another restless hour or two, if not for the tasks that awaited me.\u003c/p\u003e\n\u003cp\u003eTom Doyle could have done a lot more than simply ask questions on behalf of Nolan Walsh. Last night he could have hauled me in for questioning, or even tossed me in a cell to be held under suspicion. I appreciated his restraint; I also heeded his warning about Lady Diana’s husband.\u003c/p\u003e\n\u003cp\u003eToo many odd things had been happening too fast. I’d met the ghost of a grandfather I’d never known existed. Doyle had been sent to question me and then had hinted he knew more about my mother than I did. Even Dredmore had made a point to warn me off Walsh while nattering on about his dark and dire forces, whatever that meant.\u003c/p\u003e\n\u003cp\u003eI’d never investigated myself or my family, but it seemed a prudent time to remedy that. I’d start by going down to the City Archives, where I could search the Hall of Records.\u003c/p\u003e\n\u003cp\u003eBefore I left the office, I retreated into my private lavatory, where I kept several changes of clothes. In going into the realm of men I had two options: donning my gray switch, some face paint, and my blacks to project the appearance of a widow lady, which would be costly, or stripping myself down to the skin and donning my bucks. Since Walsh might be having me watched, and I never cared to hand out bribes unless they were absolutely necessary, I decided to go native.\u003c/p\u003e\n\u003cp\u003eErasing every aspect of my gender didn’t take much time. I sprayed my face, arms, hands, ankles, and feet with bronzen, which darkened my tanned skin to a copper brown. Making my brow fringe stand on end and stay that way required the careful application of axle grease mixed with a bit of flour. I could do nothing about the color of my eyes, but enough native women had been captured and released along with their too-dark children during the settlement that tribal people with light eyes were not uncommon now.\u003c/p\u003e\n\u003cp\u003eFinally I stuffed my crotch with a stocking-covered sausage, a trick Rina had picked up from her clients and had passed along to me. “If you’re ever wondering if the bulge your beau sports is real,” she had advised, “introduce him to a hungry dog.”\u003c/p\u003e\n\u003cp\u003eMy garments were fashioned out of scraped hides sewn together with leather lacings and decorated modestly with native beadwork. Out of respect for the real natives, I didn’t wear any feathers in my hair or on my person; those were reserved for braves who had bloodied themselves in war. They were also sported by the only natives I truly despised, the shamans, who claimed to have the sight.\u003c/p\u003e\n\u003cp\u003eNative magic was every bit as phony as the kind performed by Rumsen’s resident magefolk, but far more dangerous. The city practitioners faked their spells out of greed, in order to swindle their victims; the shamans used their false conjuring to control their entire tribe, to whom magic was like a religion.\u003c/p\u003e\n\u003cp\u003eThe only drawback to going native was the lack of transport; I couldn’t take the trolley or hail a cab, and natives were not permitted to own carris or coaches. Instead I hired a pleasant mare from a public stable and rode on horseback to City Hall. There I had to ride past a native stablehand, but he must not have looked too closely at me, for he made only the terse, sidewise jerk of the head that served as a wordless greeting among the tribes. \u003c/p\u003e","sourceLink":"https://allnovel.net/her-ladyship-s-curse/page-10.html","bookId":1590,"creation":"Oct 6, 2019 12:22:50 AM","modification":"Oct 6, 2019 12:22:50 AM"}
