{"id":101226,"no":30,"title":"Page 30","content":"\u003cp\u003eRoar’s eyes blazed with intensity, but he said nothing.\u003c/p\u003e\n\u003cp\u003e“I don’t blame you,” Perry said. “Stop acting like I do, because I don’t.”\u003c/p\u003e\n\u003cp\u003e“When I showed up at the cave, you couldn’t even stand to look at me.”\u003c/p\u003e\n\u003cp\u003e“That’s in your head.”\u003c/p\u003e\n\u003cp\u003e“It’s not. You’re hardly subtle.” Roar waved a hand. “About anything.”\u003c/p\u003e\n\u003cp\u003e“You vain bastard. I wasn’t avoiding you. You just sulk whenever you’re not the center of attention.”\u003c/p\u003e\n\u003cp\u003eRoar lifted his shoulders. “Maybe that’s true, but you were acting like Liv never existed. I was on my own.”\u003c/p\u003e\n\u003cp\u003e“Which was a disaster. You’re miserable on your own. And stupid. Turning back in the Komodo was the dumbest thing you’ve ever done. Without question.”\u003c/p\u003e\n\u003cp\u003eRoar smiled. “You’re making this so easy, Perry.” A laugh burbled out of him, but it didn’t taper off. What started as a chuckle gained momentum, growing in volume.\u003c/p\u003e\n\u003cp\u003eRoar’s laugh was wicked and high-pitched, resembling the cackle of a wild turkey. It was one of the funniest sounds Perry had ever heard; he was powerless against it. Soon they were both howling, standing in the middle of a place that was, and wasn’t, home.\u003c/p\u003e\n\u003cp\u003eBy the time they settled down and took the trail back to the cave, Perry’s ribs ached.\u003c/p\u003e\n\u003cp\u003e“Why were we laughing?”\u003c/p\u003e\n\u003cp\u003eRoar gestured to the south, where Aether funnels scored down to the earth. “Because of that. Because the world is ending.”\u003c/p\u003e\n\u003cp\u003e“That shouldn’t be funny.”\u003c/p\u003e\n\u003cp\u003eApparently it was, because it got them started again.\u003c/p\u003e\n\u003cp\u003ePerry had no idea if he’d expressed half of what he’d intended. He knew he’d been selfish, leaving Roar to deal with Liv’s death alone. He hadn’t let himself accept that she was gone, so he’d failed his friend, and himself, but he meant to change that. He was terrible at falling—Roar was right about that—but nothing ever kept him down.\u003c/p\u003e\n\u003cp\u003eAs they walked back to the cave, a piece of him that had been broken felt whole again. Nothing looked the same or smelled the same, and maybe the world was ending, but he and Roar would walk to that end side by side.\u003c/p\u003e\n\u003cp\u003eWhen they arrived, they found the main cavern empty, everyone already gone to sleep. Perry left Roar and headed for his tent, half-asleep himself.\u003c/p\u003e\n\u003cp\u003eReef and Marron intercepted him on the way.\u003c/p\u003e\n\u003cp\u003e“A few words?” Reef said.\u003c/p\u003e\n\u003cp\u003e“Sure,” Perry said. “A few.” He was so tired; every time he blinked he felt like he dreamed.\u003c/p\u003e\n\u003cp\u003e“Did you and Roar talk?” Marron asked.\u003c/p\u003e\n\u003cp\u003ePerry nodded. “Just did.”\u003c/p\u003e\n\u003cp\u003eMarron smiled. “Good.”\u003c/p\u003e\n\u003cp\u003e“He’s selfish and arrogant,” said Reef.\u003c/p\u003e\n\u003cp\u003e“But he’s good for Perry, Reef,” Marron said.\u003c/p\u003e\n\u003cp\u003eReef grunted—as enthusiastic as he’d ever sounded about Roar.\u003c/p\u003e\n\u003cp\u003eMarron reached into a satchel. “I forgot to give this back to you earlier.” He removed the Blood Lord chain, handing it over.\u003c/p\u003e\n\u003cp\u003e“Thank you,” Perry said, pulling it on. The weight of the metal around his neck was more familiar than comfortable. He wondered if it would ever be both.\u003c/p\u003e\n\u003cp\u003eMarron and Reef exchanged a look, and then Reef drew a noisy breath, pushing back his braids. “You brought us both into the Tides, Perry. Neither one of us would be here if you hadn’t let us into your tribe.”\u003c/p\u003e\n\u003cp\u003e“That’s right,” Marron said. “You offered us shelter when we needed it most. When you couldn’t afford to, you helped us.”\u003c/p\u003e\n\u003cp\u003ePerry had never felt like he’d done either of them a favor. It had always felt the other way around.\u003c/p\u003e\n\u003cp\u003e“Between my group from Delphi and Reef’s Six, we’re fifty-three people,” said Marron. “Fifty-three who’ll willingly stay behind. We won’t take the place of your tribe on those Hovers.”\u003c/p\u003e\n\u003cp\u003eReef nodded. “There’s no way forward that isn’t through pain and hardship, Peregrine. You must see that. It’s your task as Blood Lord to do what’s best for the whole—for as many of your tribe as you can help—not what’s easiest.”\u003c/p\u003e\n\u003cp\u003e“We’d like you to just consider what we’re saying,” Marron said. “That’s all we ask.”\u003c/p\u003e\n\u003cp\u003ePerry pretended to think for a few seconds. “It’s a noble offer. . . . Did either of you think I’d accept it?”\u003c/p\u003e\n\u003cp\u003eReef and Marron exchanged a look, the answer plain on their faces.\u003c/p\u003e\n\u003cp\u003ePerry grinned. “Well, you were right.” Clapping them on the shoulders, he bid them good night.\u003c/p\u003e\n\u003cp\u003eIn his tent, Perry found Cinder asleep next to Talon. Flea was rolled into a ball under Cinder’s arm.\u003c/p\u003e\n\u003cp\u003ePerry knelt and scratched his coarse fur. The dog angled his head up, his tail padding against the blankets. He loved to be scratched in the soft slope between his wide-set eyes.\u003c/p\u003e\n\u003cp\u003ePerry’s gaze moved to Talon and Cinder. The boys had fallen in together like they’d known each other since birth. He owed that to Willow.\u003c/p\u003e\n\u003cp\u003e“And you too, fleabag,” he said.\u003c/p\u003e\n\u003cp\u003eCinder’s eyes blinked open. Perry smiled, too happy to see him there to feel sorry for waking him. “How’d you get him away from Willow?” he asked, nodding to Flea.\u003c/p\u003e\n\u003cp\u003eLying on his side, Cinder gave a one-shouldered shrug. “I didn’t do anything. He just came back with me.”\u003c/p\u003e\n\u003cp\u003e“Willow was fine with that?”\u003c/p\u003e\n\u003cp\u003eThe corner of Cinder’s mouth pulled up. “Sorta. She told Flea he could stay with me this one time only, since I just got back.”\u003c/p\u003e\n\u003cp\u003e“Generous of her, actually.”\u003c/p\u003e\n\u003cp\u003e“Yeah,” Cinder said. “I know.” His smile widened. “She’s still cursing. You thought she’d stop when I got here, but she hasn’t.”\u003c/p\u003e\n\u003cp\u003e“We already knew that Willow is unstoppable.”\u003c/p\u003e\n\u003cp\u003e“I know,” Cinder said again. “She is.”\u003c/p\u003e\n\u003cp\u003eAs the moment settled between them, Perry looked from Cinder to Talon, and his vision began to blur. These boys—only one of them his blood relative, but both of them family—replenished him. They gave him confidence and purpose. Wearing the chain made sense when he looked at them, when he thought of them with Willow and Clara, whooping as they leaped from a platform into the darkness. They were the future, and they were so good.\u003c/p\u003e\n\u003cp\u003ePerry pushed a bit of small talk past his lips, buying a moment to compose himself. “So, how are you doing?”\u003c/p\u003e\n\u003cp\u003e“I’m tired.”\u003c/p\u003e\n\u003cp\u003ePerry waited, knowing there was more.\u003c/p\u003e\n\u003cp\u003e“And I’m scared,” Cinder said. “Are we going to the Still Blue?”\u003c/p\u003e\n\u003cp\u003e“I don’t know . . . maybe.”\u003c/p\u003e\n\u003cp\u003e“If we do, I’ll have to get us through.”\u003c/p\u003e\n\u003cp\u003eReef’s words echoed in Perry’s mind. There is no way forward that isn’t through pain. He shook his head, pushing them away.\u003c/p\u003e\n\u003cp\u003e“Whatever happens, Cinder, I swear to you, I won’t leave your side.”\u003c/p\u003e\n\u003cp\u003eCinder didn’t say anything, but Perry scented the easing of anxiety from his temper. That seemed to be all he needed to surrender to sleep. In seconds, Cinder’s eyes fluttered closed.\u003c/p\u003e\n\u003cp\u003ePerry stayed a moment longer, soaking in the quiet. Flea began to whimper, his legs twitching as he dreamed about chasing something. Perry wondered if it was the Still Blue.\u003c/p\u003e\n\u003cp\u003eHe stood, moving to the trunks containing the remnants of his family’s belongings. Talon’s falcon carvings. Vale’s ledger. One of Mila’s painted bowls, which he and Liv had cracked while wrestling and then fixed unsuccessfully. These things might never go anywhere, he realized now.\u003c/p\u003e\n\u003cp\u003eHe stepped out of his boots and was unbuckling his belt when Aria slipped into the tent. “Hey,” he said, going still.\u003c/p\u003e\n\u003cp\u003e“Hi.” She glanced at Cinder and Talon, smiling when she saw Flea, but her temper brimmed with anxiousness. He felt it coil inside his chest, stealing away the peaceful, tired feeling he’d felt a second ago.\u003c/p\u003e\n\u003cp\u003eHe didn’t know what to do next. He didn’t know whether to pull off his belt. It seemed like a bigger decision than it should have been. Belt off was normal for him at the end of the day, but he didn’t want her to think he assumed something would happen between them.\u003c/p\u003e\n\u003cp\u003eEven though he wanted it to. Badly.\u003c/p\u003e\n\u003cp\u003eHe was being an idiot. She trusted him. He knew that. He’d only make this more awkward by dressing again.\u003c/p\u003e\n\u003cp\u003eHe pulled off his belt and placed it on the trunk. “I went out with Roar,” he said to fill the silence.\u003c/p\u003e\n\u003cp\u003e“How was it?”\u003c/p\u003e\n\u003cp\u003e“Really good. Thank you.”\u003c/p\u003e\n\u003cp\u003e“I’m glad.”\u003c/p\u003e\n\u003cp\u003eHer smile was genuine, but faint. Something was on her mind. Her gaze flicked to the empty bed and then to the tent flap.\u003c/p\u003e\n\u003cp\u003eHe spoke quickly, worried that she might leave. “It’s a little crowded, but I’m glad you’re here. If you decide you want to stay. I’m glad you’re here even if you don’t want to stay. Either is fine. Anything you want is perfect.”\u003c/p\u003e\n\u003cp\u003eHe scratched his chin, shutting himself up. Perfect? He’d never used that word until she’d appeared in his life. “How are your friends? Caleb and Jupiter?”\u003c/p\u003e\n\u003cp\u003e“I saw them earlier,” Aria said quietly. “I yelled at them.”\u003c/p\u003e\n\u003cp\u003e“You . . . yelled at them?”\u003c/p\u003e\n\u003cp\u003eShe nodded. “Maybe it wasn’t yelling. But I raised my voice.”\u003c/p\u003e\n\u003cp\u003eHe finally understood her temper. Her anxiousness wasn’t directed at him; she was worried about her friends. “Did they deserve it?”\u003c/p\u003e\n\u003cp\u003e“Yes. No. In a way. They’ve been keeping themselves separate. Did you know that?”\u003c/p\u003e\n\u003cp\u003e“Molly mentioned it.”\u003c/p\u003e\n\u003cp\u003e“I couldn’t stay with them, so I left. I spent the afternoon in the Battle Room trying to figure out why they’re back there.” She sucked on her bottom lip, the smooth skin between her dark eyebrows wrinkling with worry. “I just expected them to be further along, and I don’t know how to change the way they think. I want to help, but I don’t see how I can.”\u003c/p\u003e\n\u003cp\u003eA hundred thoughts flooded his mind, but they all came down to one: being a leader wasn’t easy. It had to be earned, and that only happened over time. He’d spent the winter and spring learning that with the Tides. Aria was just beginning to learn it now.\u003c/p\u003e\n\u003cp\u003e“You know I’m here,” he said. “I’ll do whatever I can.”\u003c/p\u003e\n\u003cp\u003e“Will you come see them with me tomorrow? Maybe if we talk to them together it’ll help.”\u003c/p\u003e\n\u003cp\u003e“Done.”\u003c/p\u003e\n\u003cp\u003eAria smiled, then her gaze traveled to his waist. “Perry, did you know your pants are falling down?”\u003c/p\u003e\n\u003cp\u003e“Yeah.” He didn’t have to look; he could feel them sliding down his hips. “I, uh . . . I took my belt off to make you feel comfortable.”\u003c/p\u003e\n\u003cp\u003e“You took your belt off to make me feel comfortable?”\u003c/p\u003e\n\u003cp\u003eHe nodded, trying to hold back a laugh. “I worked it out in my head that this would be more natural.”\u003c/p\u003e\n\u003cp\u003e“Your pants falling down is natural?”\u003c/p\u003e\n\u003cp\u003eHe grinned. “Yeah. If they fall any further, it’s going be very natural.”\u003c/p\u003e\n\u003cp\u003eShe laughed, her gray eyes shining as she shook her head. “So nice of you to think of me.”\u003c/p\u003e\n\u003cp\u003e“Always do.”\u003c/p\u003e\n\u003cp\u003eA blush crept over her cheeks as they stared at each other, one second giving to another. Her temper filled the small space, beckoning him closer. \u003c/p\u003e","sourceLink":"https://allnovel.net/into-the-still-blue-under-the-never-sky-3/page-30.html","bookId":1659,"creation":"Oct 5, 2019 9:59:56 PM","modification":"Oct 5, 2019 9:59:56 PM"}
