{"id":101207,"no":9,"title":"Page 9","content":"\u003cp\u003eHe looked back, still walking, and pressed a hand to his heart.\u003c/p\u003e\n\u003cp\u003eIn the cockpit, Soren had put on his Smarteye.\u003c/p\u003e\n\u003cp\u003e“I brought it out of Reverie,” he said. “Thought it might come in handy.”\u003c/p\u003e\n\u003cp\u003eShe leaned against the threshold and pursed her lips, disliking his choice of words.\u003c/p\u003e\n\u003cp\u003eIf something handy was useful, what did that mean for her, with her lame hand?\u003c/p\u003e\n\u003cp\u003eSoren mistook her expression, thinking she objected to his use of the Smarteye. “I don’t need it or anything. But I can work ten times faster with it.”\u003c/p\u003e\n\u003cp\u003e“I know,” she said, dropping into the other seat. “It’s fine. Use whatever you have to.”\u003c/p\u003e\n\u003cp\u003eAria watched him for a while. Soren alternated between periods of inward focus when he was working through the Smarteye and bursts of frantic swiping at the commands on the Belswan’s controls. He was completely different when he had a task in front of him, a puzzle to solve.\u003c/p\u003e\n\u003cp\u003eShe stared through the windshield at the trees tossing back and forth as anxiety began to build inside her. There were dangers in those woods. Bands of violent drifters. Aether storms that struck suddenly. She couldn’t get the image of Perry with his hand over his heart out of her mind.\u003c/p\u003e\n\u003cp\u003eRestless, she left the cockpit and rummaged in the rear storage room for field meals—prepackaged rations. Aria took spaghetti for herself and Jupiter, and tossed a meatloaf pack to Soren.\u003c/p\u003e\n\u003cp\u003eShe sat at the top of the ramp, where she’d be able to see Perry, Roar, and Brooke when they returned. The trees shifted, their branches swaying and creaking as the wind rose.\u003c/p\u003e\n\u003cp\u003e“These woods look so strange,” Jupiter said, joining her.\u003c/p\u003e\n\u003cp\u003e“That’s because they’re real.”\u003c/p\u003e\n\u003cp\u003eJupiter flicked his head to the side, tossed his shaggy hair out of his face. “Right . . . that makes sense.”\u003c/p\u003e\n\u003cp\u003eAs they fell into silence, she found herself straining to see into the darkened woods. Why hadn’t they come back yet?\u003c/p\u003e\n\u003cp\u003eShe ate slowly, though her stomach rumbled. The pain in her arm had intensified, leaving her a little nauseous, and eating with her left hand took longer. The food, which only tasted slightly better than dirt, didn’t help matters.\u003c/p\u003e\n\u003cp\u003eJupiter finished before she did and found two twigs to use as drumsticks. “So, are you still singing?” he asked as he tapped a rhythm against the ramp.\u003c/p\u003e\n\u003cp\u003e“Not very much. I’ve been a little preoccupied.”\u003c/p\u003e\n\u003cp\u003eAria recognized the beat of the song “Winged Hearts Collide”—Roar’s favorite by the Tilted Green Bottles—but she had no urge to sing. The metallic clatter rattled in her ears. She felt like those twigs were banging against her brain, and now she couldn’t stop thinking about Roar and worrying about him.\u003c/p\u003e\n\u003cp\u003e“That’s too bad. Your voice is the best.”\u003c/p\u003e\n\u003cp\u003e“Thanks, Jup.”\u003c/p\u003e\n\u003cp\u003eJupiter broke rhythm, pausing to rub his eye as though looking for the Smarteye that was no longer there. “You think Rune is all right? Caleb and the rest of everyone?”\u003c/p\u003e\n\u003cp\u003eShe nodded, thinking of Molly. “They’re in good hands.”\u003c/p\u003e\n\u003cp\u003eAria heard herself and winced. Was every stupid expression about stupid hands?\u003c/p\u003e\n\u003cp\u003e“You know, Beethoven?” Jupiter said. “He was deaf— mostly deaf or something—and he had to hear through percussion and conductivity and stuff. I just keep thinking about him, you know? If he was able to do that, then I should be able to figure this out.”\u003c/p\u003e\n\u003cp\u003e“Figure what out?”\u003c/p\u003e\n\u003cp\u003e“Not having the Realms anymore. I keep trying to fraction. I keep thinking my Smarteye is malfunctioning, and it’s kind of like I’ve gone deaf. Like there’s this huge missing piece. Then I remember this is all we have. Real is all that’s left.”\u003c/p\u003e\n\u003cp\u003e“It’ll get easier.”\u003c/p\u003e\n\u003cp\u003eJupiter stopped drumming. “Sorry. I didn’t mean to complain or sound ungrateful or anything.”\u003c/p\u003e\n\u003cp\u003e“Ungrateful?”\u003c/p\u003e\n\u003cp\u003e“You saved my life.”\u003c/p\u003e\n\u003cp\u003e“You didn’t sound ungrateful. And you don’t owe me anything. You don’t have to act a certain way.”\u003c/p\u003e\n\u003cp\u003eAnxiety bled through her words. She’d meant to reassure him, but it sounded like she was scolding him. She looked down, hiding her grimace, and caught movement at the edge of her vision.\u003c/p\u003e\n\u003cp\u003eThe fingers of her injured hand were twitching. She’d had no idea.\u003c/p\u003e\n\u003cp\u003eShe tried to make a fist, hoping this meant she was healing. Instead of her fingers curling, they stopped moving. Her hand wasn’t even part of her.\u003c/p\u003e\n\u003cp\u003eTears blurred her vision, and she didn’t think.\u003c/p\u003e\n\u003cp\u003eShe jumped up and ran down the ramp, plunging into the night.\u003c/p\u003e\n\u003cp\u003e10\u003c/p\u003e\n\u003cp\u003ePEREGRINE\u003c/p\u003e\n\u003cp\u003ePerry had almost reached the Belswan when he spotted Aria running toward him.\u003c/p\u003e\n\u003cp\u003eIn an instant he had his bow off his shoulder, an arrow nocked and ready, as he scanned the woods for an attack. For fire. Dwellers. Anything.\u003c/p\u003e\n\u003cp\u003e“What is it?” he asked as she ran up.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” she said, breathless, her pupils dilated, her temper frantic. She held her arm against her stomach. “Nothing.”\u003c/p\u003e\n\u003cp\u003eHer gaze darted past the trees. Over the rocky ground. Everywhere except at him.\u003c/p\u003e\n\u003cp\u003ePerry pulled his bow back over his shoulder and slipped the arrow back into his quiver. He let out his breath, his fear seeping out of him. “What’s going on?”\u003c/p\u003e\n\u003cp\u003eShe shook her head. “I said nothing. Just forget it.”\u003c/p\u003e\n\u003cp\u003e“You’re not telling me the truth.”\u003c/p\u003e\n\u003cp\u003eHer eyes snapped up. “Maybe not, Perry, but what about you? You won’t talk about Liv. You won’t talk about Roar or about us. You say what happened in the past doesn’t matter, but it does to me. By not talking, you’re keeping yourself from me. How is that any worse than lying?”\u003c/p\u003e\n\u003cp\u003eHe nodded, finally understanding. He could fix this. They could.\u003c/p\u003e\n\u003cp\u003eShe blinked at him, shocked. “Are you . . . are you smiling?”\u003c/p\u003e\n\u003cp\u003eHer eyes began to fill, so he hurried to explain. “I’m smiling because I’m relieved, Aria. A minute ago I thought your life was in danger, but you’re safe. You’re right here, and we’re together. That feels a lot better than me worrying about you, or missing you because you’re hundreds of miles away.”\u003c/p\u003e\n\u003cp\u003e“Just because we’re together doesn’t mean everything is fine.”\u003c/p\u003e\n\u003cp\u003eHe couldn’t agree with that. Being with her was all he needed. They’d work out all the rest. But he saw that it was different for her. “Then tell me how to make it right. That’s all I want to do.”\u003c/p\u003e\n\u003cp\u003e“You have to talk to me. We have to tell each other the little things, the bad things. Maybe they’ll hurt for a while, but at least they won’t become big things. If we don’t, we’re just going to keep hurting each other. And I don’t want to do that anymore.”\u003c/p\u003e\n\u003cp\u003e“All right. I swear to you, from now on I’ll talk. You’ll get tired of hearing my voice. But I think you should be the one to start.” He wasn’t the one with tears in his eyes.\u003c/p\u003e\n\u003cp\u003e“Right now?”\u003c/p\u003e\n\u003cp\u003e“Brooke and Roar aren’t back yet. We have some time.”\u003c/p\u003e\n\u003cp\u003eAria shook her head. “I don’t know where to start. It was one thing at first, but now it feels like everything.” The wind swelled, blowing her hair into her face. She pushed it away. “We haven’t fixed anything, Perry. Reverie is gone. We had to leave all those people behind, and you had to leave your house, and I liked that house. I wanted to sleep with you in the loft and watch the Aether through the crack in the roof—how you told me you loved to do? We never had a chance to do that. We won’t ever be able to.”\u003c/p\u003e\n\u003cp\u003eShe lifted her injured hand. “And there’s this. I was just figuring out how to fight; now it doesn’t work. I couldn’t buckle the belt in the Hover. I can’t even tie my hair back.” She tucked the arm to her side again. “Cinder is a prisoner. Liv is gone. Roar is . . . I don’t know . . . I don’t know how to help him. I don’t know what’s happened to the two of you—and then there’s you. I hurt you when I left, and I’m so scared that I damaged us—”\u003c/p\u003e\n\u003cp\u003e“You didn’t.”\u003c/p\u003e\n\u003cp\u003e“Then why won’t you talk about it?”\u003c/p\u003e\n\u003cp\u003ePressure built inside his chest, quickening his pulse. It was the same trapped feeling he got inside the cave, and it reminded him of how he’d felt when he’d walked into Vale’s room and found her missing. He’d carried that pressure around until the moment she’d come back.\u003c/p\u003e\n\u003cp\u003e“I want to forget it happened. I need to, Aria. You were poisoned right in front of me. You almost died. For a while there . . . I thought you’d really left me.”\u003c/p\u003e\n\u003cp\u003e“I left for you, Perry.”\u003c/p\u003e\n\u003cp\u003e“I know. I know that now. It hurt both of us, but we got through it. And we’re not damaged because of it. We’re stronger.”\u003c/p\u003e\n\u003cp\u003e“We are?”\u003c/p\u003e\n\u003cp\u003e“Sure. Look at us. We’re surviving our first fight . . . or second.”\u003c/p\u003e\n\u003cp\u003eAria rolled her eyes. “This isn’t a fight and neither was yesterday.”\u003c/p\u003e\n\u003cp\u003eHe smiled. “Now you’re scaring me.”\u003c/p\u003e\n\u003cp\u003eShe laughed. It was a sparkling sound. A burst of brightness in the quiet of the woods. For the first time since he’d seen her running toward him, he relaxed.\u003c/p\u003e\n\u003cp\u003eAria still held her hand against her stomach. He wanted to take it and kiss each one of her fingers, but he didn’t want to chance making her feel worse about her injury.\u003c/p\u003e\n\u003cp\u003eHe stepped around her.\u003c/p\u003e\n\u003cp\u003e“Perry, what are you—”\u003c/p\u003e\n\u003cp\u003eHe held her shoulders, keeping her from turning. “Trust me.”\u003c/p\u003e\n\u003cp\u003eHe swept her hair behind her shoulders, feeling her tense in surprise. Then he combed it back with his fingers. He loved her hair. Black as onyx, steeped in her violet scent. Heavy as a blanket in his hands.\u003c/p\u003e\n\u003cp\u003eReaching up, he tugged off the leather strap he’d used to pull his own knots back earlier, and tied her hair at the base of her neck.\u003c/p\u003e\n\u003cp\u003e“Is that what you wanted?” he asked.\u003c/p\u003e\n\u003cp\u003e“It’s, um . . . much better.”\u003c/p\u003e\n\u003cp\u003eBending, he kissed the smooth skin just beneath her ear. “How’s this?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. . . . Try again?”\u003c/p\u003e\n\u003cp\u003eHe smiled and wrapped his arms around her, gathering her close. Ahead of them, the lights from inside the Hover filtered through the trees—her world, blending with his. “You really want me to talk?”\u003c/p\u003e\n\u003cp\u003eAria leaned back, letting him take her weight. “Yes.”\u003c/p\u003e\n\u003cp\u003e“You’re going to hear a lot about my favorite subject.”\u003c/p\u003e\n\u003cp\u003e“Hunting?”\u003c/p\u003e\n\u003cp\u003eHe laughed. “No.” He slid his hands to her hips, feeling muscle and solid bone, and then back up, over the curve of her waist. “Not hunting.” Every part of her drove him mad, and he told her so, whispering in her ear as she rested against him.\u003c/p\u003e\n\u003cp\u003eWhen she turned sharply to the woods, he knew she’d heard Roar and Brooke. It was time to go back, but he held on, keeping her there just a little longer.\u003c/p\u003e\n\u003cp\u003e“What brought you out here, Aria?” he asked.\u003c/p\u003e\n\u003cp\u003eShe looked up, right into his eyes. “I needed to find you.”\u003c/p\u003e\n\u003cp\u003e“I know,” he said. “The second I left you, I felt the same way.”\u003c/p\u003e\n\u003cp\u003eThey returned to the cargo hold to listen to Soren’s assessment.\u003c/p\u003e\n\u003cp\u003ePerry sat with Aria, Brooke, and Jupiter, while Roar stood off in the shadows again. \u003c/p\u003e","sourceLink":"https://allnovel.net/into-the-still-blue-under-the-never-sky-3/page-9.html","bookId":1659,"creation":"Oct 5, 2019 9:59:56 PM","modification":"Oct 5, 2019 9:59:56 PM"}
