{"id":73942,"no":25,"title":"Page 25","content":"\u003cp\u003e“Of course,” she said, reaching for one of the sample cups. “What would you like a sample of?”\u003c/p\u003e\n\u003cp\u003e“Nothing,” he said. “Just the cup.”\u003c/p\u003e\n\u003cp\u003eChristina glanced at me, and I trained my eyes on Travis to keep from laughing, which would be mean. If I looked closely, I could see lots of “me”s in his jacket-shirt-thingy. Or rather, fragments of me, broken up by the crinkles in the foil.\u003c/p\u003e\n\u003cp\u003e“The eggnog latte is good,” Christina suggested. “It’s our seasonal special.”\u003c/p\u003e\n\u003cp\u003e“Just the cup,” Travis repeated. He shifted in agitation. “I just want the cup!”\u003c/p\u003e\n\u003cp\u003e“Fine, fine.” She handed him the cup.\u003c/p\u003e\n\u003cp\u003eI pulled my gaze away from the “me”s, which were mesmerizing.\u003c/p\u003e\n\u003cp\u003e“I can’t believe you’re dressed like that, especially today,” I said. “Please tell me you’ve got a sweater on under that tinfoil.”\u003c/p\u003e\n\u003cp\u003e“What tinfoil?” he said.\u003c/p\u003e\n\u003cp\u003e“Ha-ha,” I said. “For real, Travis, aren’t you cold?”\u003c/p\u003e\n\u003cp\u003e“I’m not. Are you?”\u003c/p\u003e\n\u003cp\u003e“Um, nooo. Why would I be cold?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. Why would you?”\u003c/p\u003e\n\u003cp\u003eI half laughed. Then stopped. Travis regarded me from beneath his craggy brows.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t,” I said, flustered. “I’m not. I’m totally, completely comfortable, temperature-wise.”\u003c/p\u003e\n\u003cp\u003e“‘Temperature-wise,’” he scoffed. “It’s always about you, isn’t it?”\u003c/p\u003e\n\u003cp\u003e“What?! I’m not . . . talking about me! I’m just telling you that I’m not cold!”\u003c/p\u003e\n\u003cp\u003eThe intensity of his gaze made me feel itchy.\u003c/p\u003e\n\u003cp\u003e“Okay, maybe I’m talking about me this very second,” I said. “But it’s not always about me.”\u003c/p\u003e\n\u003cp\u003e“Some things never change,” he said scornfully. He strode off with his doll-size cup, but at the door, he turned for one last parting shot. “And don’t bother asking for a tow. I’m off duty!”\u003c/p\u003e\n\u003cp\u003e“Well,” I said. He’d actually hurt my feelings, but I didn’t want to let on. “That was interesting.”\u003c/p\u003e\n\u003cp\u003e“I don’t think I’ve ever heard Travis deny anyone a tow before,” Christina said. “Seriously, I think you’re the first.”\u003c/p\u003e\n\u003cp\u003e“Please don’t sound so impressed,” I said faintly.\u003c/p\u003e\n\u003cp\u003eShe laughed, which was what I wanted. But as she refilled the napkin container, Travis’s words came back to me: It’s always about you, isn’t it?\u003c/p\u003e\n\u003cp\u003eIt was disconcertingly similar to what Dorrie said to me last night: Have you truly looked inside yourself? Do you even know what you need to change?\u003c/p\u003e\n\u003cp\u003eOr something like that.\u003c/p\u003e\n\u003cp\u003e“Hey, um, Christina . . . ?”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“Is there something wrong with me?”\u003c/p\u003e\n\u003cp\u003eShe glanced up from the napkins. “Addie, Travis is nuts.”\u003c/p\u003e\n\u003cp\u003e“I know. But that doesn’t mean everything he says is nuts, necessarily.”\u003c/p\u003e\n\u003cp\u003e“Addie.”\u003c/p\u003e\n\u003cp\u003e“Christina.”\u003c/p\u003e\n\u003cp\u003e“Just tell me the truth: Am I a good person? Or am I, like, too self-absorbed?”\u003c/p\u003e\n\u003cp\u003eShe considered. “Does it have to be either/or?”\u003c/p\u003e\n\u003cp\u003e“Ouch.” I drew my hand to my heart and staggered back.\u003c/p\u003e\n\u003cp\u003eShe grinned, thinking I was being Funny Addie. And I was, I guess. But I also had the strangest fear that the universe was trying to tell me something. I felt as if I were teetering on the edge of a great chasm, only the chasm was in myself. I didn’t want to look down.\u003c/p\u003e\n\u003cp\u003e“Look lively,” Christina told me. “Here come the seniors.”\u003c/p\u003e\n\u003cp\u003eSure enough, the Silver Sneakers van had pulled up outside Starbucks, and the driver was carefully helping his load of senior citizens navigate the sidewalk. They resembled a line of well-bundled bugs.\u003c/p\u003e\n\u003cp\u003e“Hi, Claire,” Christina said as the first of the seniors jingled through the door.\u003c/p\u003e\n\u003cp\u003e“Nippy, nippy!” Claire said, slipping off her colorful hat.\u003c/p\u003e\n\u003cp\u003eBurt made his way straight to the counter and ordered a shot in the dark, and Miles, shuffling in behind him, called out, “You sure your ticker can handle it, old man?”\u003c/p\u003e\n\u003cp\u003eBurt thumped his chest. “Keeps me young. That’s why the ladies love me. Right, Miss Addie?”\u003c/p\u003e\n\u003cp\u003e“Absolutely,” I said, putting the universe on hold as I grabbed a cup and handed it to Christina. Burt had the biggest ears I’d ever seen (maybe because he’d had eighty-odd years to grow them?), and I wondered what the ladies thought of them.\u003c/p\u003e\n\u003cp\u003eAs the line grew, Christina and I fell into our crunch-time roles. I took orders and manned the register while she worked her magic with the steamer.\u003c/p\u003e\n\u003cp\u003e“Grande latte!” I called.\u003c/p\u003e\n\u003cp\u003e“Grande latte,” she repeated.\u003c/p\u003e\n\u003cp\u003e“Venti soy toffee nut mocha single shot no whip!”\u003c/p\u003e\n\u003cp\u003e“Venti soy toffee nut mocha single shot no whip.”\u003c/p\u003e\n\u003cp\u003eIt was a dance. It pulled me out of myself. The chasm still gaped within me, but I had to tell it, Sorry, caz, no time.\u003c/p\u003e\n\u003cp\u003eThe last of the seniors was Mayzie, with her gray braids and a beatific smile. Mayzie was a retired folklore professor, and she dressed all hippy-dippy in battered jeans, an oversize striped sweater, and a half dozen beaded bracelets. I loved that about her, that she dressed more like a teenager than an old lady. I mean, I didn’t want to see her in super-low-rise Sevens and a thong, but I thought it was cool that she did her own thing.\u003c/p\u003e\n\u003cp\u003eNo one was waiting behind her, so I rested my hands on the counter and allowed myself a breath of air.\u003c/p\u003e\n\u003cp\u003e“Hey, Mayzie,” I said. “How you doing today?”\u003c/p\u003e\n\u003cp\u003e“I’m terrific, hon,” she said. Today she was wearing purple jingle bell earrings, and they tinkled when she tilted her head. “Ooo, I like your hair.”\u003c/p\u003e\n\u003cp\u003e“You don’t think I look like a plucked chicken?”\u003c/p\u003e\n\u003cp\u003e“Not at all,” she said. “It suits you. It’s spunky.”\u003c/p\u003e\n\u003cp\u003e“I don’t know about that,” I said.\u003c/p\u003e\n\u003cp\u003e“Well, I do. You’ve been moping around for too long, Addie. I’ve been watching. It’s time you grew into your next self.”\u003c/p\u003e\n\u003cp\u003eThere it was again, the prickling sense of standing on a precipice.\u003c/p\u003e\n\u003cp\u003eMayzie leaned closer. “We are all flawed, my dear. Every one of us. And believe me, we’ve all made mistakes.”\u003c/p\u003e\n\u003cp\u003eHeat rushed to my face. Were my mistakes so public that even my customers knew? Did the Silver Sneakers gang discuss my hookup with Charlie over bingo?\u003c/p\u003e\n\u003cp\u003e“You’ve just got to take a good hard look at yourself, change what needs to be changed, and move on, pet.”\u003c/p\u003e\n\u003cp\u003eI blinked at her dumbly.\u003c/p\u003e\n\u003cp\u003eShe lowered her voice. “And if you’re wondering why I get to tell you this, it’s because I’ve decided to pursue a new profession: Christmas angel.”\u003c/p\u003e\n\u003cp\u003eShe waited for my reaction, her eyes bright. It was strange that she would bring up the whole “angel” thing after I’d talked about angels with Dorrie and Tegan last night, and for a teeny-tiny fraction of a second I actually wondered if she was my angel, here to save me.\u003c/p\u003e\n\u003cp\u003eThen cold, hard reality thudded back down, and I hated myself for being such a fool. Mayzie was no angel; today was just the Day of the Nut Jobs. Apparently, everyone had eaten too much fruitcake.\u003c/p\u003e\n\u003cp\u003e“Don’t you have to be dead to be an angel?” I said.\u003c/p\u003e\n\u003cp\u003e“Now, Addie,” she scolded. “Do I look dead to you?”\u003c/p\u003e\n\u003cp\u003eI looked at Christina to see if she was catching this, but Christina was over by the exit, putting a new bag in the trash can.\u003c/p\u003e\n\u003cp\u003eMayzie took my lack of response as permission to continue. “It’s a program called Angels Among Us,” she said. “I don’t have to get a degree or anything.”\u003c/p\u003e\n\u003cp\u003e“There’s not really a program called that,” I said.\u003c/p\u003e\n\u003cp\u003e“Oh, yes, yes. It’s offered at Gracetown’s Center for the Heavenly Arts.”\u003c/p\u003e\n\u003cp\u003e“Gracetown doesn’t have a Center for the Heavenly Arts,” I said.\u003c/p\u003e\n\u003cp\u003e“I sometimes get lonely,” she confided. “Not that the Silver Sneakers aren’t wonderful. But sometimes they’re a bit”—she dropped her voice to a whisper—“well, boring.”\u003c/p\u003e\n\u003cp\u003e“Ohhh,” I whispered back.\u003c/p\u003e\n\u003cp\u003e“I thought becoming an angel might be a nice way to connect with others,” she said. “Anyway, to get my wings, I just have to spread the magic of Christmas.”\u003c/p\u003e\n\u003cp\u003eI snorted. “Well, I don’t believe in the magic of Christ-mas.”\u003c/p\u003e\n\u003cp\u003e“Sure you do, or I wouldn’t be here.”\u003c/p\u003e\n\u003cp\u003eI drew back, feeling somehow as if I’d been tricked. Because how was I supposed to respond to that? I shook myself and tried another tactic. “But . . . Christmas is over.”\u003c/p\u003e\n\u003cp\u003e“Oh, no, Christmas is never over, unless you want it to be.” She leaned on the counter and propped her chin on her palm. “Christmas is a state of mind.”\u003c/p\u003e\n\u003cp\u003eHer gaze dropped below the level of the counter. “Goodness gracious,” she said.\u003c/p\u003e\n\u003cp\u003eI looked down. “What?”\u003c/p\u003e\n\u003cp\u003eThe top corner of the folded-up sticky note was sticking out of my jeans pocket, and Mayzie reached across the counter and plucked it free. The gesture was so unexpected, I just stood there and let her.\u003c/p\u003e\n\u003cp\u003e“‘Do not forget the pig,’” Mayzie said after unfolding the note. She tilted her head and peered at me like a little bird.\u003c/p\u003e\n\u003cp\u003e“Oh crud,” I said.\u003c/p\u003e\n\u003cp\u003e“What pig are you not supposed to forget?”\u003c/p\u003e\n\u003cp\u003e“Uh”—my mind was jittery—“it’s for my friend, Tegan. What drink can I get started for you?” My fingers itched to untie my apron strings so I could go on break.\u003c/p\u003e\n\u003cp\u003e“Hmm,” Mayzie said. She tapped her chin.\u003c/p\u003e\n\u003cp\u003eI tapped my foot.\u003c/p\u003e\n\u003cp\u003e“You know,” she said, “sometimes when we forget to do things for others, like this Tegan, it’s because we’re too wrapped up in our own problems.”\u003c/p\u003e\n\u003cp\u003e“Yes,” I said vigorously, hoping to dissuade further discussion. “You want your usual almond mocha?”\u003c/p\u003e\n\u003cp\u003e“When actually, what we need to forget is ourselves.”\u003c/p\u003e\n\u003cp\u003e“Yes again. I hear ya. Single shot?”\u003c/p\u003e\n\u003cp\u003eShe smiled as if I amused her. “Single shot, yes, but let’s mix it up this time. Change is healthy, right?”\u003c/p\u003e\n\u003cp\u003e“If you say so. So what’ll it be?”\u003c/p\u003e\n\u003cp\u003e“A toffee nut mocha, please, in a to-go cup. I think I’ll take in some air before Tanner comes back for us.”\u003c/p\u003e\n\u003cp\u003eI relayed Mayzie’s order to Christina, who had slipped back behind the counter. She whipped it up and slid it over.\u003c/p\u003e\n\u003cp\u003e“Keep what I said in mind,” Mayzie said.\u003c/p\u003e\n\u003cp\u003e“I’m pretty sure I will,” I said.\u003c/p\u003e\n\u003cp\u003eShe giggled merrily, as if we were in cahoots. “Bye, now,” she called. “See you soon!”\u003c/p\u003e\n\u003cp\u003eAs soon as she was gone, I tore off my apron.\u003c/p\u003e\n\u003cp\u003e“I’m going on break,” I told Christina.\u003c/p\u003e\n\u003cp\u003eShe handed me the steamer. “Rinse this out for me, and you’re officially free to go.”\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003eI set the steamer in the sink and twisted the faucet. As I waited impatiently for it to fill, I turned and leaned against the sink’s edge. I drummed my fingers against its metal rim.\u003c/p\u003e\n\u003cp\u003e“Mayzie says I need to forget myself,” I said. “What do you think that means?”\u003c/p\u003e\n\u003cp\u003e“Don’t ask me,” Christina said. Her back was to me as she blew out the steam wand, and I watched the puff of steam rise above her shoulders.\u003c/p\u003e\n\u003cp\u003e“And my friend Dorrie—you know Dorrie—she kind of said the same thing,” I mused. “She said I always have to make things be about me.”\u003c/p\u003e\n\u003cp\u003e“Well, I won’t argue with you there.”\u003c/p\u003e\n\u003cp\u003e“Ha ha,” I said. I grew uncertain. “You’re kidding, right?”\u003c/p\u003e\n\u003cp\u003eChristina looked over her shoulder and grinned. Her eyes widened in dismay, and she gestured furiously. “Addie, the . . . the . . . ”\u003c/p\u003e\n\u003cp\u003eI twisted around to see a sheet of water spill over the edge of the sink. I jumped back, yelping, “Ahhh!”\u003c/p\u003e\n\u003cp\u003e“Turn it off!” Christina said.\u003c/p\u003e\n\u003cp\u003eI fumbled with the faucet, but water continued to pour into and over the sink.\u003c/p\u003e\n\u003cp\u003e“It’s not working!”\u003c/p\u003e\n\u003cp\u003eShe pushed me aside. “Get a rag!”\u003c/p\u003e\n\u003cp\u003eI dashed to the back room, grabbed a rag, and dashed back. Christina was still twisting the faucet, and water was still pouring onto the floor.\u003c/p\u003e\n\u003cp\u003e“See?” I said.\u003c/p\u003e\n\u003cp\u003eShe glared.\u003c/p\u003e\n\u003cp\u003eI wormed in and pressed the rag to the sink’s edge. A second later it was soaked, and I had a flashback to the time I was four and couldn’t turn the bathtub off.\u003c/p\u003e\n\u003cp\u003e“Crap, crap, crap,” Christina said. She gave up on turning the water off and applied pressure to the spurting faucet. It squirted past her fingers in an umbrella-shaped arch. “I have no idea what to do!”\u003c/p\u003e\n\u003cp\u003e“Oh, God. Okay, um”—I scanned the store—“John!”\u003c/p\u003e\n\u003cp\u003eAll three Johns looked up from their corner table. They saw what was happening and hurried over.\u003c/p\u003e\n\u003cp\u003e“Can we come behind the counter?” John Number Two asked, because Christina was hard-core about customers not coming behind the counter. Starbucks policy.\u003c/p\u003e\n\u003cp\u003e“Of course!” Christina cried. She blinked as the water sprayed her shirt and face.\u003c/p\u003e\n\u003cp\u003eThe Johns took charge. Johns One and Two came to the sink, while John Number Three loped toward the back room.\u003c/p\u003e\n\u003cp\u003e“Move aside, ladies,” John Number One said.\u003c/p\u003e\n\u003cp\u003eWe did. Christina’s apron was soaked, as was her shirt. And her face. And her hair.\u003c/p\u003e\n\u003cp\u003eI pulled a stack of napkins from the dispenser. “Here.”\u003c/p\u003e\n\u003cp\u003eShe took them wordlessly.\u003c/p\u003e\n\u003cp\u003e“Um . . . are you mad?”\u003c/p\u003e\n\u003cp\u003eShe didn’t respond.\u003c/p\u003e\n\u003cp\u003eJohn Number One hunkered down by the wall and did studly things with the pipes. His Tar Heels cap bobbed as he moved.\u003c/p\u003e\n\u003cp\u003e“I didn’t do anything, I swear,” I said.\u003c/p\u003e\n\u003cp\u003eChristina’s eyebrows rose to her hairline.\u003c/p\u003e\n\u003cp\u003e“Well, fine, I forgot to turn the water off. But that shouldn’t have caused the whole system to break down.”\u003c/p\u003e\n\u003cp\u003e“Musta been the storm,” John Number Two said. “Probably burst one of the outside pipes.” \u003c/p\u003e","sourceLink":"https://allnovel.net/let-it-snow/page-25.html","bookId":2708,"creation":"Oct 5, 2019 10:29:40 AM","modification":"Oct 5, 2019 10:29:40 AM"}
