{"id":73944,"no":27,"title":"Page 27","content":"\u003cp\u003e“Damn,” Nathan said.\u003c/p\u003e\n\u003cp\u003eI flipped it over again, looking for the name of who rebought Tegan’s pig.\u003c/p\u003e\n\u003cp\u003e“Bob gets in new animals all the time,” Nathan said defensively. “They show up and I, you know, adopt them out. Because it’s a pet store.”\u003c/p\u003e\n\u003cp\u003e“Nathan, I need you to tell me who you sold him to,” I told him.\u003c/p\u003e\n\u003cp\u003e“I can’t. That’s private information.”\u003c/p\u003e\n\u003cp\u003e“Yes, but it’s Tegan’s pig.”\u003c/p\u003e\n\u003cp\u003e“Um, we’ll give her a refund, I guess.”\u003c/p\u003e\n\u003cp\u003eTechnically, it was Dorrie and I who should get the refund, but I didn’t mention that. I didn’t care about the refund.\u003c/p\u003e\n\u003cp\u003e“Just tell me who you sold him to, and I’ll go explain the situation.”\u003c/p\u003e\n\u003cp\u003eHe shifted, looking incredibly uncomfortable.\u003c/p\u003e\n\u003cp\u003e“You do have the person’s name, right? Who bought him?”\u003c/p\u003e\n\u003cp\u003e“No,” he said. His eyes darted to the open drawer of the cash register, where I saw the tail end of a white credit-card slip.\u003c/p\u003e\n\u003cp\u003e“Even if I did know, there’s nothing I could do,” he continued. “I can’t reveal the details of customer transactions. But I don’t know the lady’s name anyway, so, um . . . yeah.”\u003c/p\u003e\n\u003cp\u003e“It’s okay. I understand. And . . . I do believe you about not seeing the note.”\u003c/p\u003e\n\u003cp\u003e“You do?” he said. His expression was bewildered.\u003c/p\u003e\n\u003cp\u003e“I do,” I said truthfully. I turned to leave, and as I did, I hooked the toe of my boot under the Doggie de Lite display rack and tugged. The rack toppled, and cellophane bags tumbled to the floor, bursting open and spilling dog treats everywhere.\u003c/p\u003e\n\u003cp\u003e“Oh, no!” I cried.\u003c/p\u003e\n\u003cp\u003e“Aw, crap,” Nathan said. He came around from behind the counter, knelt, and started piling up the bags that were still intact.\u003c/p\u003e\n\u003cp\u003e“I am so sorry,” I said. As he fished for a stray dog cookie, I leaned over the counter and plucked the white receipt. I shoved it into my pocket. “You must hate me even more now, huh?”\u003c/p\u003e\n\u003cp\u003eHe paused, straightening up and propping one hand on his knee. He did a weird thing with his lips, as if he were going through some sort of struggle.\u003c/p\u003e\n\u003cp\u003e“I don’t hate you,” he said at last.\u003c/p\u003e\n\u003cp\u003e“You don’t?”\u003c/p\u003e\n\u003cp\u003e“I just don’t think you realize, sometimes, how you affect people. And I’m not just talking about me.”\u003c/p\u003e\n\u003cp\u003e“Then . . . who are you talking about?” I was very aware of the receipt in my pocket, but I couldn’t walk away from a comment like that.\u003c/p\u003e\n\u003cp\u003e“Forget it.”\u003c/p\u003e\n\u003cp\u003e“No way. Tell me.”\u003c/p\u003e\n\u003cp\u003eHe sighed. “I don’t want this to go to your head, but you’re not always annoying.”\u003c/p\u003e\n\u003cp\u003eGee, thanks, I wanted to say. But I held my tongue.\u003c/p\u003e\n\u003cp\u003e“You’ve got this . . . light about you,” he said, turning red. “You make people feel special, like maybe there’s a light in them, too. But then if you never call them, or if you, you know, kiss some asshole behind their back . . . ”\u003c/p\u003e\n\u003cp\u003eMy vision blurred, and not just because Nathan was suddenly saying things that instead of being rude were dangerously close to sweet. I stared at the floor.\u003c/p\u003e\n\u003cp\u003e“It’s just cruel, Addie. It’s really cold.” He gestured at a bag of Doggy de Lites by my boot. “Pass me that, will you?”\u003c/p\u003e\n\u003cp\u003eI bent down and picked it up.\u003c/p\u003e\n\u003cp\u003e“I don’t mean to be cold,” I said awkwardly. I handed him the Doggy de Lites. “And I’m not trying to make excuses.” I swallowed, surprised by how much I needed to say this to someone who was Jeb’s friend and not mine. “But sometimes I need someone to shine a little light on me, too.”\u003c/p\u003e\n\u003cp\u003eThe muscles of Nathan’s face didn’t move. He let my comment hover between us, just long enough for regret to start pressing in.\u003c/p\u003e\n\u003cp\u003eThen he grunted. “Jeb’s not exactly the most demonstrative guy,” he acknowledged.\u003c/p\u003e\n\u003cp\u003e“You think?”\u003c/p\u003e\n\u003cp\u003e“But get a grip. When it comes to you, he’s totally whupped.”\u003c/p\u003e\n\u003cp\u003e“Was whupped,” I said. “Not anymore.” I felt a tear, and then another, make its way down my cheek, and I felt like a fool. “Yeah. I’m going now.”\u003c/p\u003e\n\u003cp\u003e“Hey, Addie,” Nathan said.\u003c/p\u003e\n\u003cp\u003eI turned.\u003c/p\u003e\n\u003cp\u003e“If we get another teacup pig, I’ll call you.”\u003c/p\u003e\n\u003cp\u003eI looked past his acne and his Star Trek shirt and saw just plain Nathan, who, as it turned out, wasn’t always annoying, either.\u003c/p\u003e\n\u003cp\u003e“Thanks,” I said.\u003c/p\u003e\n\u003cp\u003eChapter Thirteen\u003c/p\u003e\n\u003cp\u003eAs soon as I was ten feet away from the pet store, I fished out the pilfered receipt. On the “item” line, Nathan had scrawled, pig. Where the credit-card info was printed, it said, Constance Billingsley.\u003c/p\u003e\n\u003cp\u003eI swiped away my tears with the back of my hand and took a steadying breath. Then I sent a psychic message to Gabriel: Don’t worry, little guy. I’ll get you to Tegan, where you belong.\u003c/p\u003e\n\u003cp\u003eFirst, I called Christina.\u003c/p\u003e\n\u003cp\u003e“Where are you?” she said. “Your break ended five minutes ago.”\u003c/p\u003e\n\u003cp\u003e“About that,” I said. “I’m having a bit of an emergency, and before you ask, no, this is not an Addie moment. This particular emergency is about Tegan. I have to do something for her.”\u003c/p\u003e\n\u003cp\u003e“What do you have to do?”\u003c/p\u003e\n\u003cp\u003e“Uh, something important. Something life-or-death, although don’t worry, no one’s actually going to die.” I paused. “Except me, if I don’t get it done.”\u003c/p\u003e\n\u003cp\u003e“Addie,” Christina said. Her tone that suggested I pulled this kind of crap all the time, which I did not.\u003c/p\u003e\n\u003cp\u003e“Christina, I’m not fooling around, and I’m not being dramatic just to be dramatic. I swear.”\u003c/p\u003e\n\u003cp\u003e“Well, Joyce just clocked in,” she said grudgingly, “so I suppose the two of us can cover things.”\u003c/p\u003e\n\u003cp\u003e“Thank you, thank you, thank you! I’ll be back in the quickest jiffy possible.” I started to hang up, but Christina’s tinny voice said, “Wait—hold on!”\u003c/p\u003e\n\u003cp\u003eI raised the phone back to my ear, antsy to be on my way. “What?”\u003c/p\u003e\n\u003cp\u003e“Your friend with the dreads is here.”\u003c/p\u003e\n\u003cp\u003e“Brenna? Ugh. Not my friend.” I had a horrible thought. “She’s not with anyone, is she?”\u003c/p\u003e\n\u003cp\u003e“She’s not with Jeb, if that’s what you’re asking.”\u003c/p\u003e\n\u003cp\u003e“Thank God. Then why are you telling me?”\u003c/p\u003e\n\u003cp\u003e“Just thought you’d be interested. Oh, and your dad came by. He said to tell you he took the Explorer.”\u003c/p\u003e\n\u003cp\u003e“He . . . what?!” My gaze flew to the north end of the parking lot. There was a rectangle of smushed snow where I’d parked the Explorer. “Why? Why in the world did he take my car?”\u003c/p\u003e\n\u003cp\u003e“Your car?”\u003c/p\u003e\n\u003cp\u003e“His car, whatever. What was he thinking?”\u003c/p\u003e\n\u003cp\u003e“No idea. Why, do you need it for your thing?”\u003c/p\u003e\n\u003cp\u003e“Yes, I need it for my thing. And now I have no clue how I’m going to—” I broke off, because ranting to Christina wouldn’t help.\u003c/p\u003e\n\u003cp\u003e“Never mind, I’ll figure it out,” I said. “Bye.”\u003c/p\u003e\n\u003cp\u003eI hit the end button, then called my voice mail.\u003c/p\u003e\n\u003cp\u003e“You have three new messages,” the recording said.\u003c/p\u003e\n\u003cp\u003eThree? I thought. I’d only heard my phone ring once—although I guess things got kind of loud when the Doggy de Lites came crashing down.\u003c/p\u003e\n\u003cp\u003e“Addie, it’s Dad,” Dad said on message number one.\u003c/p\u003e\n\u003cp\u003e“Yes, Dad, I know,” I said under my breath.\u003c/p\u003e\n\u003cp\u003e“I rode into town with Phil, because your mom needs some groceries. I’m taking the Explorer, so don’t worry if you look out and see that it’s gone. I’ll swing by to pick you up at two.”\u003c/p\u003e\n\u003cp\u003e“Nooooo!” I cried.\u003c/p\u003e\n\u003cp\u003e“Next message,” my phone informed me. I bit my lip, praying that it was Dad saying, “Ha-ha, just kidding. I didn’t take the Explorer; I just moved it. Ha-ha!”\u003c/p\u003e\n\u003cp\u003eIt wasn’t Dad. It was Tegan.\u003c/p\u003e\n\u003cp\u003e“Hola, Addikins!” she said. “Do you have Gabriel? Do ya, do ya, do ya? I cannot wait to see him. I found a heat lamp down in the basement—remember that year my dad was trying to grow those tomatoes?—and I set it up so Gabriel will stay warm in his little bed. Oh, and while I was down there, I found my old American Girl stuff, including a Barcalounger that is just the right size for him. And a backpack with a star on it, though I’m not sure he’ll need a backpack. But you never know, right? Okay, um, call me. Call me as soon as you can. The snowplow is two streets over, so if I don’t hear from you, I’ll just head on over to Starbucks, ’kay? Bye!”\u003c/p\u003e\n\u003cp\u003eMy stomach sank all the way to my toes, and I stood there dumbly as my voice mail announced the final message. It was Tegan again. “Oh, and Addie?” she said. “Thank you. Thank you so much.”\u003c/p\u003e\n\u003cp\u003eWell, that made me feel better.\u003c/p\u003e\n\u003cp\u003eI shut my phone, cursing myself for not going to Pet World at the crack of nine like I’d planned. But rather than whimper pathetically, I had to deal with it. The old me would have stood here feeling sorry for myself until I got frostbite and my toes fell off, and good luck finding strappy heels to wear on New Year’s Eve then, buster. Not that I had anywhere to go wearing strappy heels. But whatever.\u003c/p\u003e\n\u003cp\u003eThe new me, however, was not a whimperer.\u003c/p\u003e\n\u003cp\u003eSo. Where could I get a last-minute pig-rescue car?\u003c/p\u003e\n\u003cp\u003eChapter Fourteen\u003c/p\u003e\n\u003cp\u003eChristina? Not an option. She got dropped off this morning by her boyfriend, per usual. Joyce, the barista whose shift just started, was also without car. Joyce walked to work no matter what the weather was like and wore one of those personal pedometers to measure how many steps she took.\u003c/p\u003e\n\u003cp\u003eHmm, hmm, hmm. Not Dorrie and not Tegan, because (a) their street was still being plowed (hopefully), and (b) no way was I going to tell them why I needed said car.\u003c/p\u003e\n\u003cp\u003eNot Brenna, heaven forbid. If I asked her to take me to the south end of town, she’d drive north just to spite me. And she’d blast her reggae-emo-fusion crap, which sounded like drugged-out ghouls.\u003c/p\u003e\n\u003cp\u003eWhich left only one person. One evil, charming, too-handsome-for-his-own-good person. I kicked a whump of snow, because he was the last person in the world I ever wanted to call, ever ever ever.\u003c/p\u003e\n\u003cp\u003eWell, guess what? I told myself. You’re going to have to suck it up for the sake of Tegan. Either that, or say bye-bye to Gabriel forever.\u003c/p\u003e\n\u003cp\u003eI flipped opened my phone, scrolled through my contacts, and jabbed CALL. I clenched my toes inside my boots as I counted rings. One ringie-dingie, two ringie-dingies, three ringie—\u003c/p\u003e\n\u003cp\u003e“Yo, mama!” Charlie said when he picked up. “S’up?”\u003c/p\u003e\n\u003cp\u003e“It’s Addie,” I said. “I need a ride, and I’m only asking because I have absolutely no other choice. I’m outside Pet World. Come pick me up.”\u003c/p\u003e\n\u003cp\u003e“Someone’s bossy this morning,” Charlie said. I could practically hear him waggle his eyebrows. “I like it.”\u003c/p\u003e\n\u003cp\u003e“Whatever. Just come get me, will you?”\u003c/p\u003e\n\u003cp\u003eHe lowered his voice. “What’ll you give me in return?”\u003c/p\u003e\n\u003cp\u003e“A free chai,” I said flatly.\u003c/p\u003e\n\u003cp\u003e“Venti?”\u003c/p\u003e\n\u003cp\u003eI tightened my jaw, because the way he said it, even “venti” sounded lewd.\u003c/p\u003e\n\u003cp\u003e“Fine, a venti chai. Have you left yet?”\u003c/p\u003e\n\u003cp\u003eHe chuckled. “Hold on, babe. I’m still in my skivvies. My venti skivvies, and not because I’m fat, but because I’m”—ridiculous, loaded pause—“venti.”\u003c/p\u003e\n\u003cp\u003e“Just get over here,” I said. I started to hang up, then thought of one last thing. “Oh—and bring a phone book.”\u003c/p\u003e\n\u003cp\u003eI hung up, did a shake-it-off shudder, and despised myself all over again for fooling around with such a skeeze. Yes, he was hot—in theory—and once upon a time, I suppose, I’d even found him funny.\u003c/p\u003e\n\u003cp\u003eBut he wasn’t Jeb.\u003c/p\u003e\n\u003cp\u003eDorrie had summed up the difference between them one night at a party. Not the party, but just a normal, pre-breakup party. Dorrie and I were slouching on a sofa, rating a bunch of guys according to their strengths and weaknesses. When we got to Charlie, Dorrie let out a sigh.\u003c/p\u003e\n\u003cp\u003e“The problem with Charlie,” she said, “is that he’s too charming, and he knows it. He knows he can have any girl in the grade—”\u003c/p\u003e\n\u003cp\u003e“Not me,” I interjected, balancing my drink on my knee.\u003c/p\u003e\n\u003cp\u003e“—so he sails through life like a typical trust-fund baby.”\u003c/p\u003e\n\u003cp\u003e“Charlie has a trust fund? I didn’t know that.”\u003c/p\u003e\n\u003cp\u003e“But what that means, sadly, is that he has no depth. He’s never had to work for anything in his life.”\u003c/p\u003e\n\u003cp\u003e“I wish I didn’t have to work for anything,” I said wistfully. “I wish I had a trust fund.”\u003c/p\u003e\n\u003cp\u003e“No, you don’t,” Dorrie said. “Are you even listening?” She took my drink, and I made a sound of protest.\u003c/p\u003e\n\u003cp\u003e“Take Jeb, for instance,” Dorrie said. “Jeb is going to grow up to be the kind of man who spends his Saturdays teaching his little boy to ride a bike.”\u003c/p\u003e\n\u003cp\u003e“Or little girl,” I said. “Or twins! Maybe we’ll have twins!”\u003c/p\u003e\n\u003cp\u003e“Charlie, on the other hand, will be off playing golf while his kid kills people on his Xbox. Charlie will be dashing and debonair, and he’ll buy his kid all kinds of crap, but he’ll never actually be there.”\u003c/p\u003e\n\u003cp\u003e“That is so sad,” I said. I reclaimed my drink and took a long sip. “Does that mean his kid will never learn to ride a bike?”\u003c/p\u003e\n\u003cp\u003e“Not unless Jeb goes over and teaches him,” Dorrie said.\u003c/p\u003e\n\u003cp\u003eWe sat. For several minutes, we watched the guys play pool. Charlie’s ball hit its mark, and Charlie pulled his fist in by his side.\u003c/p\u003e\n\u003cp\u003e“That’s what I’m talking about!” he crowed. “Ice, baby!”\u003c/p\u003e\n\u003cp\u003eJeb looked across the room at me, and his lips twitched. I felt warm and happy, because the message in his eyes was, You’re mine and I’m yours. And thank you for not using expressions like “Ice, baby.”\u003c/p\u003e\n\u003cp\u003eA twitch of the lips and a loving look . . . what I wouldn’t give to have that back. Instead, I threw it all away for the guy who was rumbling into the parking lot this very second in his ridiculous gray Hummer. \u003c/p\u003e","sourceLink":"https://allnovel.net/let-it-snow/page-27.html","bookId":2708,"creation":"Oct 5, 2019 10:29:40 AM","modification":"Oct 5, 2019 10:29:40 AM"}
