{"id":73947,"no":30,"title":"Page 30","content":"\u003cp\u003e“Wait!” I said. I released Jeb long enough to grab a snowflake mug from the shelf, which I handed to Tegan. “For Gabriel.”\u003c/p\u003e\n\u003cp\u003e“If the regional manager stops in, I’m fired,” Christina said hopelessly. “Pigs are not part of Starbucks policy.”\u003c/p\u003e\n\u003cp\u003e“Here you go, sweetie,” Tegan said, tilting Gabriel so that he slipped into the mug. He scrabbled a bit, then seemed to realize the mug was just his size and made a decent house, actually. He sat on his haunches and oinked, and every one of us gave a collective awwww. Even Christina.\u003c/p\u003e\n\u003cp\u003e“Excellent,” Dorrie said. “Now come on, we better go before Christina plotzes.”\u003c/p\u003e\n\u003cp\u003eI grinned at Jeb, who grinned back. His gaze shifted to my hair, and his eyebrows went up.\u003c/p\u003e\n\u003cp\u003e“Hey,” he said. “You changed your hair.”\u003c/p\u003e\n\u003cp\u003e“Oh, yeah,” I said. It seemed like a lifetime ago. That blonde-haired boo-hoo-hoo girl who spent Christmas feeling sorry for herself, was that really me?\u003c/p\u003e\n\u003cp\u003e“Looks nice,” he said. He rubbed a lock between his thumb and forefinger. His knuckles slid down, grazing my cheek.\u003c/p\u003e\n\u003cp\u003e“Addie, I want you,” he whispered, and heat flamed to my face. Did he honestly just say that? That he wanted me, right here in Starbucks?\u003c/p\u003e\n\u003cp\u003eThen I realized what he meant. He was responding to my e-mail, the part where I said, If you want me, I’m yours.\u003c/p\u003e\n\u003cp\u003eMy cheeks stayed warm, and I was glad no one in the store had ESP, because that was a classically self-absorbed misinterpretation. But even if they did have ESP—and how would I know, anyway?—it was certainly no crisis.\u003c/p\u003e\n\u003cp\u003eI rose on my toes and wrapped my arms around Jeb’s neck.\u003c/p\u003e\n\u003cp\u003e“I’m going to kiss you now,” I warned him, since I knew how he felt about being mushy in public.\u003c/p\u003e\n\u003cp\u003e“No,” he said, gently but firmly. “I’m going to kiss you.”\u003c/p\u003e\n\u003cp\u003eHis lips touched mine, and a ringing filled my head, sweet and silver and pure. It was probably the bell on the door, jingling as Dorrie and Tegan went out. But I was far too busy to check.\u003c/p\u003e","sourceLink":"https://allnovel.net/let-it-snow/page-30.html","bookId":2708,"creation":"Oct 5, 2019 10:29:40 AM","modification":"Oct 5, 2019 10:29:40 AM"}
