{"id":80141,"no":10,"title":"Page 10","content":"\u003cp\u003ePat gives me the eye. “What do you think?”\u003c/p\u003e\n\u003cp\u003eI shake my head. “That little pot-smoking pig! You know, he threatened to put me and Lil in jail for insulting an officer.”\u003c/p\u003e\n\u003cp\u003e“Dummy. But wait. What was going on?”\u003c/p\u003e\n\u003cp\u003eI sigh and turn down the heat. I don’t even know where to begin. “You remember that girl I brought to Ricky’s basement on Halloween night?”\u003c/p\u003e\n\u003cp\u003e“The one who helped herself to one of my beers and then didn’t drink a damn sip?”\u003c/p\u003e\n\u003cp\u003e“Oh, shut up. I gave you money for both of us. Anyway, yes. That girl. She . . . she basically disappeared.”\u003c/p\u003e\n\u003cp\u003ePat shrugs. “Not surprised. She was weird.”\u003c/p\u003e\n\u003cp\u003e“She wasn’t weird.” But even as I say it, I know I’m lying. Mary was weird. I love the girl to death, but she wasn’t exactly normal.\u003c/p\u003e\n\u003cp\u003e“She was too. Okay, not ‘weird’ as in ‘freaky.’ But . . . she seemed like she’d never been to a party before.”\u003c/p\u003e\n\u003cp\u003e“She probably hadn’t. She’s very sheltered.”\u003c/p\u003e\n\u003cp\u003eI pull two pieces of steak out of the pan and put them in Shep’s food bowl. He loves steak. But he barely sniffs them. He doesn’t have much of an appetite these days, poor old dog.\u003c/p\u003e\n\u003cp\u003ePat says, “You say ‘sheltered.’ I say ‘freaky.’?”\u003c/p\u003e\n\u003cp\u003eI’m about to slap him upside the head, when my cell phone rings. The name on the screen surprises the shit out of me.\u003c/p\u003e\n\u003cp\u003eLind.\u003c/p\u003e\n\u003cp\u003eI haven’t talked to the boy since Rennie’s New Year’s Eve party. I hope he doesn’t want to ask me anything about the shit Rennie was screaming at him about Reeve and Lillia. If Alex wants that scoop, he ain’t getting it from me.\u003c/p\u003e\n\u003cp\u003eBut I pick up anyway. I’ll always pick up the phone for Alex.\u003c/p\u003e\n\u003cp\u003eTentatively I say, “Hello?”\u003c/p\u003e\n\u003cp\u003e“Kat! Dude! I got in! Well, not exactly in, exactly, but I’m close. I mean, they didn’t reject me!”\u003c/p\u003e\n\u003cp\u003eI hold the phone a few inches away from my ear. “Fool, what are you talking about?”\u003c/p\u003e\n\u003cp\u003e“USC! I applied to their songwriting program, and they e-mailed and asked me to send in a demo! They call it a remote audition.”\u003c/p\u003e\n\u003cp\u003e“Wait. For real? You sent in an application after all?” The last I’d heard, Alex had been too chickenshit to apply to a music school. He was going to either Michigan, because of his dad’s connections there, or maybe Boston College.\u003c/p\u003e\n\u003cp\u003e“What can I say, Kat? You’re pretty persuasive. So will you help me figure out which songs I should send them? Which ones are good, which ones suck? I want your honest opinions.”\u003c/p\u003e\n\u003cp\u003eIt’s a tempting proposition. I’ve always wanted to hear Alex’s music. I mean, there were those few songs or poems or whatever in that notebook we stole from his car back in September, but I bet there’s more. I could just say yes right now, but I want to draw this out. I’m not above fishing for a compliment or two. I’ve been so down in the dumps lately.\u003c/p\u003e\n\u003cp\u003e“Why would you care what I think?”\u003c/p\u003e\n\u003cp\u003e“Because you know music. You’ve seen so many bands play. You know what’s good and what’s not. There’s no way this is happening for me unless I have your help.”\u003c/p\u003e\n\u003cp\u003e“All right, sure. I’ll try.”\u003c/p\u003e\n\u003cp\u003e“Awesome. Oh, wait up. I’m a self-absorbed dick. Have you heard anything from Oberlin?”\u003c/p\u003e\n\u003cp\u003eI would tell Alex the truth, that I got pushed into the general pool, but I can’t. Not with Pat here. He and my dad still think I’m already accepted. “Hey, Al, I got to go. I’ll talk to you at school, okay?”\u003c/p\u003e\n\u003cp\u003eI end the call as Pat pushes that last perfectly cut red onion into a bowl. Then he holds up his hand. “Taco time?”\u003c/p\u003e\n\u003cp\u003eI slap it back. “You know it.” And for a second I think, if I don’t get into Oberlin, it will suck, but it won’t be the worst thing in the world.\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp; *\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eLater that night I’m in my bedroom, working my way through a box of old CDs that I haven’t listened to in years. I’m pulling aside ones I think will be up Alex’s alley, mostly stuff I was into freshman year.\u003c/p\u003e\n\u003cp\u003eListening to this old music is like being in a time machine. I remember each CD I bought from Kim at Paul’s Boutique. I concentrate on finding songs I think he’d do well to emulate—kind of folksy guitar stuff but with an edge.\u003c/p\u003e\n\u003cp\u003eI’m leaning back, eyes closed, listening to a song, when there’s a knock at my door. I say come in, expecting to see Pat, but it’s not him. It’s Lillia. And she looks upset.\u003c/p\u003e\n\u003cp\u003e“Lil. What happened? What’s wrong?”\u003c/p\u003e\n\u003cp\u003eShe starts pacing around my room, literally wringing her hands like a lady in a Victorian novel. “Paige just caught me and Reeve hugging. And she basically told me off.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eLillia flops down onto my bed and curls into a ball. “I promise you, we’ve barely said two words to each other since Rennie died. We were both over there today by accident, and then, when Paige left the room, he told me that he got into a prep school for his postgrad year, so he can have another shot with college recruiters, and then the next second we’re hugging each other.”\u003c/p\u003e\n\u003cp\u003eI roll my eyes. “So what? You guys hugged. Big deal.” Trust Lil to turn a piddly hug into some soap-opera drama.\u003c/p\u003e\n\u003cp\u003e“It wasn’t just a hug, okay? It’s never just a hug with us. Like on New Year’s Eve, when we were in his truck.” Lil shivers. “We get near each other and we lose our heads.”\u003c/p\u003e\n\u003cp\u003eI lean forward in my chair. Now she’s getting to the good stuff. “Did you two have sex that night?”\u003c/p\u003e\n\u003cp\u003e“No! No, nothing like that. But it was probably the most intense make-out session of my life.”\u003c/p\u003e\n\u003cp\u003eA wistfulness crosses her face for just a second, and then it disappears, and my heart drops. Damn. I’m happy that Lillia’s gotten past what happened to her last summer with those college f**ko ra**sts, enough to have a fun night letting loose with a guy. But it sucks that it happened with someone she can’t actually be with.\u003c/p\u003e\n\u003cp\u003e“If Paige hadn’t walked in . . . I’m scared of what could have happened.” Lil closes her eyes and shakes her head. “I mean, we were in Rennie’s kitchen! How could I do something like that?”\u003c/p\u003e\n\u003cp\u003eI hold up my hand. “Say no more. I know exactly what this is.”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“My sophomore year I was hooking up with this dude from the motocross circuit. I’d only ever see him on Pat’s race days. He was a lot older than me. Like, I think he may have been twenty.”\u003c/p\u003e\n\u003cp\u003e“Eww!” \u003c/p\u003e","sourceLink":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3/page-10.html","bookId":2728,"creation":"Oct 5, 2019 4:24:16 PM","modification":"Oct 5, 2019 4:24:16 PM"}
