{"id":80160,"no":29,"title":"Page 29","content":"\u003cp\u003eAlex isn’t hearing me. He keeps his eyes on the computer screen. “I’m not going to Boston. If I don’t get into USC, then I’ll go to Michigan. I want to be as far away as possible.”\u003c/p\u003e\n\u003cp\u003eI get it. He might not be singing about Lillia, but Alex is still hurting. But he’s being a bit dramatic with this whole I’m-running-away shtick. I ignore it and grab my bag. “All righty, dude. I better bounce. I was supposed to be at Lillia’s house hours ago.”\u003c/p\u003e\n\u003cp\u003e“Have fun,” he says sarcastically.\u003c/p\u003e\n\u003cp\u003eI should just go, but I can’t help it. “Dude, don’t be like that.”\u003c/p\u003e\n\u003cp\u003e“Be like what?”\u003c/p\u003e\n\u003cp\u003e“Look,” I say. “I know you probably feel like a dummy for sending those flowers on Valentine’s Day, but I still think it was a good move.”\u003c/p\u003e\n\u003cp\u003eAlex laughs dryly. “Yeah. I’m glad to know that I wasted my whole high school experience on people who don’t give a shit about me.”\u003c/p\u003e\n\u003cp\u003eI dig out my keys. I know Lil is trying to wait for the right time to talk to Alex, when he’s cooled down some. Unfortunately, he’s still white-hot. So instead I ask, “Has Reeve apologized?”\u003c/p\u003e\n\u003cp\u003eHe gives me a look like I’m crazy. “Reeve doesn’t say ‘sorry.’ It’s not in his vocabulary.”\u003c/p\u003e\n\u003cp\u003e“Right.” That I can believe.\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp; *\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eI’m at Lillia’s house, and there’s a movie on their big-ass TV, but we’re not really watching it. Lillia goes into the kitchen and comes back with chips and salsa and hummus. “I got your favorite kind of hummus,” she sings out.\u003c/p\u003e\n\u003cp\u003e“Thanks, Lil,” I say, and I grab a handful of chips.\u003c/p\u003e\n\u003cp\u003eNadia comes wandering into the living room in leggings and a cheering hoodie. She sees me lying on the couch but doesn’t say anything. “What up, Nadi,” I say.\u003c/p\u003e\n\u003cp\u003eNadia doesn’t answer me. She glares at Lil and snarks, “I didn’t know you were having friends over. I was going to invite people over.”\u003c/p\u003e\n\u003cp\u003e“Go ahead. We can hang up in my room.”\u003c/p\u003e\n\u003cp\u003e“Just forget it.”\u003c/p\u003e\n\u003cp\u003e“Easy, little girl,” I say. “That’s your big sister you’re talking to.”\u003c/p\u003e\n\u003cp\u003eNadia rolls her eyes. If this were at school and not, say, Lillia’s living room, I’d knock Nadia on her ass. But I’m a guest here, so I just help myself to another delicious chip.\u003c/p\u003e\n\u003cp\u003eTurning to Lil, she asks, “Are there any tortilla chips left?”\u003c/p\u003e\n\u003cp\u003eLillia shakes her head. “No, but there are pita chips.”\u003c/p\u003e\n\u003cp\u003eNadia makes a huffy sound. Eyeing our Oranginas, she says, “Did you drink all the Orangina too?”\u003c/p\u003e\n\u003cp\u003e“I hope so,” I say, taking a big swig. I can’t help myself.\u003c/p\u003e\n\u003cp\u003eLillia elbows me. “I think there’s one left.”\u003c/p\u003e\n\u003cp\u003eNadia shuffles into the kitchen, and I hear her rustling around in the fridge. “I don’t see it!”\u003c/p\u003e\n\u003cp\u003e“Look behind the deli meats,” Lillia calls back. Nadia doesn’t answer. “Did you find it?”\u003c/p\u003e\n\u003cp\u003e“No.” Nadia comes back into the living room with a Diet Coke and a bag of pita chips. She snatches the hummus and stalks up to her room.\u003c/p\u003e\n\u003cp\u003eI’m glad I don’t have a little sister. Pat can be a pain in the ass, but damn. As soon as she’s gone, I say, “Yo, why’s Nadia being such a bitch baby?”\u003c/p\u003e\n\u003cp\u003e“Sorry about that. It’s not you. It’s me.”\u003c/p\u003e\n\u003cp\u003e“You gotta get her in line,” I say, shaking my head. “Whup some ass if need be.”\u003c/p\u003e\n\u003cp\u003e“She’s still mad about the whole Reeve thing. She thinks it’s a betrayal of Rennie.” Quickly Lillia adds, “Which I know it is. Trust me, I know.”\u003c/p\u003e\n\u003cp\u003eI want to say that it’s a betrayal of Mary, too, but I keep that thought to myself because I’m here to make her feel better, not worse.\u003c/p\u003e\n\u003cp\u003e“So how is Alex? How are his songs? When will he hear something back from USC?”\u003c/p\u003e\n\u003cp\u003e“Um, which one of those do you want me to answer first?”\u003c/p\u003e\n\u003cp\u003e“Sorry. It’s just been a while since we’ve talked.”\u003c/p\u003e\n\u003cp\u003e“I know you’re trying to give him time, Lil, but I’m starting to think that time ain’t doing you any favors.”\u003c/p\u003e\n\u003cp\u003e“Ugh.” Lillia chews on her bottom lip. “Do you think I’m crazy for going through all this just to be with Reeve?”\u003c/p\u003e\n\u003cp\u003e“Look, I’m not saying I understand it.” I shudder, because God, Reeve can be such a dick. “But it’s your bag. I’m not gonna judge you for it.”\u003c/p\u003e\n\u003cp\u003eLillia presses her foot up against mine and looks at me with big, grateful eyes. “I promise you, Kat, he’s not what you think he is.”\u003c/p\u003e\n\u003cp\u003eI snort. “How so?”\u003c/p\u003e\n\u003cp\u003eHer face goes all dreamy and soft, which makes me regret asking. Tipping her head back against the couch, she says, “He looks at me like I’m the only girl in the world.”\u003c/p\u003e\n\u003cp\u003eI roll my eyes. “Eww. Forget I asked.”\u003c/p\u003e\n\u003cp\u003e“Kat! Just listen for a minute. Please? I never get to talk about him like this.”\u003c/p\u003e\n\u003cp\u003e“Fine, I’ll listen. For a minute.”\u003c/p\u003e\n\u003cp\u003eLillia looks around, then leans in close to me and whispers, “He’s an amazing kisser.”\u003c/p\u003e\n\u003cp\u003eI pick at my cuticles. “How far have you guys gone, anyway?”\u003c/p\u003e\n\u003cp\u003eShe covers her mouth and giggles like crazy.\u003c/p\u003e\n\u003cp\u003e“I’ve heard the boy has skills,” I say.\u003c/p\u003e\n\u003cp\u003eLil’s cheeks go pink. “We haven’t had sex or anything.” Then she whispers, “But . . . I think I maybe want to.”\u003c/p\u003e\n\u003cp\u003eI let out a whoop. “You hussy!”\u003c/p\u003e\n\u003cp\u003eLillia swats at me, but I block her hand with a pillow. Then, suddenly, her face gets serious. “You’ve had sex with a lot of guys, right?”\u003c/p\u003e\n\u003cp\u003eI cut my eyes at her. “A few! Not a lot.”\u003c/p\u003e\n\u003cp\u003e“Right, sorry, sorry,” she says. She ducks her head, and her hair falls across her face. Worriedly she asks, “Do you think that Reeve minds? I mean, that we haven’t done it yet?”\u003c/p\u003e\n\u003cp\u003e“Nah. It’s like you said, the boy’s crazy about you. Any idiot can see that. He might get blue balls, but whatever, he can just jack off, no big deal.” Lillia makes a face at me. “What? I’m just being honest. There’s no rush, Lil.”\u003c/p\u003e\n\u003cp\u003e“I just wish Reeve was my first time and not that other guy.”\u003c/p\u003e\n\u003cp\u003eI grab her foot. Hard, because this shit is serious. I ain’t playing. “That other guy doesn’t count. You never said yes to that other guy, so he doesn’t count. Your first time is whoever you say it is. You got me?”\u003c/p\u003e\n\u003cp\u003eShe nods.\u003c/p\u003e\n\u003cp\u003eThe front door opens, and Lillia’s mom steps inside, wearing an ivory coat with a funnel neck, and studded black leather gloves. She looks like Jackie O but with some edge. She drops her black bag onto the entranceway table and slips out of her heels. “Girls, sorry I’m so late!” she calls out. \u003c/p\u003e","sourceLink":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3/page-29.html","bookId":2728,"creation":"Oct 5, 2019 4:24:16 PM","modification":"Oct 5, 2019 4:24:16 PM"}
