{"id":80170,"no":41,"title":"Page 41","content":"\u003cp\u003eReeve doesn’t see it coming, even though I’m there, kneeling on one of the diving platforms. Even though I got the idea from his very own dream.\u003c/p\u003e\n\u003cp\u003eHe takes off his towel. After a few arm circles and knee jumps to get warm, he hops into the water at the shallow end. He pulls a pair of swim goggles down over his eyes, sucks in a deep breath, and begins swimming a long straight lap, right toward me. I lean over the water and wait for him to come up and take a breath. His last. When he does, I’ll be the final face he sees. And then we’ll both be free.\u003c/p\u003e\n\u003cp\u003eTo become visible a ghost must vibrate at the specific life frequency of the intended witness.\u003c/p\u003e\n\u003cp\u003eI close my eyes and use everything, every last drop of power, to set myself in sync with Reeve. A low buzz turns into the crystal-clear beat of his heart pumping him through the water in my empty shell. The in-and-out and in-and-out of his breath fills my atrophied lungs as he rotates his head from the surface to underwater. The bursts of blood coursing through his veins feel like thousands of electrical pulses waking up my numb extremities.\u003c/p\u003e\n\u003cp\u003eReeve swims closer and closer. A few feet out from the wall, he sucks in a big last breath and takes the final stretch underwater. He starts rising back up to the surface, and I reveal myself like I read in Aunt Bette’s book. We lock eyes before he hits the air. His face contorts.\u003c/p\u003e\n\u003cp\u003eGood-bye, Reeve.\u003c/p\u003e\n\u003cp\u003eI leap into the water and wrap my arms and legs around his body. Reeve flails and thrashes, but I squeeze him like a vise and sink him down, down, down to the dark bottom of the pool.\u003c/p\u003e\n\u003cp\u003eHe’s fighting me so hard, it doesn’t take long for him to run out of gas. His hum quiets, quiets, quiets.\u003c/p\u003e\n\u003cp\u003eIt’s almost over. I’m so glad it’s almost over.\u003c/p\u003e\n\u003cp\u003eAnd then, a shock of white before things come in flashes.\u003c/p\u003e\n\u003cp\u003eHis mother’s face.\u003c/p\u003e\n\u003cp\u003eBrothers throwing him up to the sky.\u003c/p\u003e\n\u003cp\u003eA hug from an old woman.\u003c/p\u003e\n\u003cp\u003eA dog snarling and snapping at his hand.\u003c/p\u003e\n\u003cp\u003eRunning and sliding on wet cement.\u003c/p\u003e\n\u003cp\u003eHis dad, drunk and swinging his fists.\u003c/p\u003e\n\u003cp\u003eThis is Reeve’s life, flashing before his eyes. And because we’re in sync, I can see it along with him. Every bit of this mystery boy is unfolding for me like a movie of a billion different frames.\u003c/p\u003e\n\u003cp\u003eBaseball home run.\u003c/p\u003e\n\u003cp\u003eHiding under a bed.\u003c/p\u003e\n\u003cp\u003eWalking into the Montessori lunchroom.\u003c/p\u003e\n\u003cp\u003eA flash of me, soaking wet on the ferry, bawling my eyes out.\u003c/p\u003e\n\u003cp\u003eReeve running home, sobbing.\u003c/p\u003e\n\u003cp\u003eAt the ferry the next day, looking for me.\u003c/p\u003e\n\u003cp\u003eOur teacher, breaking the news.\u003c/p\u003e\n\u003cp\u003eReeve vomiting in the boys’ bathroom.\u003c/p\u003e\n\u003cp\u003eReeve inconsolable, my pocketknife in his hands.\u003c/p\u003e\n\u003cp\u003eOpening the blade, staring at it.\u003c/p\u003e\n\u003cp\u003eIt’s starting to hurt now. Feeling every emotion Reeve’s ever felt, all at once.\u003c/p\u003e\n\u003cp\u003eAt the Jar Island lighthouse. Climbing his way up to the peak.\u003c/p\u003e\n\u003cp\u003eScreaming he’s sorry into the wind.\u003c/p\u003e\n\u003cp\u003eStaring over the edge.\u003c/p\u003e\n\u003cp\u003eNever in my wildest dreams did I think my death affected Reeve that way. Enough to make him do something so drastic, as drastic as I did. He did care. His skin burns in my grip, crazy hot. I fight the urge to let him go.\u003c/p\u003e\n\u003cp\u003eA park ranger grabbing him, pulling him down.\u003c/p\u003e\n\u003cp\u003eThe show slows along with Reeve’s heartbeat. He’s dying in my arms. Almost done, I tell myself, because it’s stinging me like fire to hold on. Keep going. It’s almost over. The last image, brighter than bright:\u003c/p\u003e\n\u003cp\u003eLillia Cho.\u003c/p\u003e\n\u003cp\u003eI can’t bear it. I can’t bear it for another second. I drop him.\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp; *\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eWhen I open my eyes, I’m back at my house. Lying on the floor. My cheeks are wet. I’m crying.\u003c/p\u003e\n\u003cp\u003eI couldn’t do it. After all this time, after all he’s done to me, I couldn’t do it. Through his eyes I saw everything. I felt everything. Pain. Joy. Despair. Regret. Everything. All the things I’ve forgotten how to feel.\u003c/p\u003e\n\u003cp\u003eLove.\u003c/p\u003e\n\u003cp\u003eI know now that I’ll never be able to kill Reeve. That’s why I haven’t done it already, when I’ve had so many chances. I’ve been holding back. I’m never going to be able to kill him.\u003c/p\u003e\n\u003cp\u003eBut he still has to pay for what he did. Otherwise I’ll never be free. But if not me . . .\u003c/p\u003e\n\u003cp\u003eAnd then I remember.\u003c/p\u003e\n\u003cp\u003eReeve was the one who tormented me into doing the unthinkable. Taking my own life. He’s got to be the one to do it. There’s no other way.\u003c/p\u003e\n\u003cp\u003eChapter Thirty-Seven\u003c/p\u003e\n\u003cp\u003eLILLIA\u003c/p\u003e\n\u003cp\u003eI PUSH THROUGH THE POOL door, and the first thing I notice is how quiet it is. How eerily quiet. Then I let out a scream that bounces off every wall. Reeve’s body is floating in the center of the pool, facedown.\u003c/p\u003e\n\u003cp\u003eOh my God, oh my God, oh my God.\u003c/p\u003e\n\u003cp\u003e“Help! Somebody help!” I scream. Then I jump into the pool, thrash over to him, and drag him to the side.\u003c/p\u003e\n\u003cp\u003eAs soon as the air hits his face, Reeve takes a guttural, bubbling breath. His skin is white. I try to hoist him out of the water, but he’s too heavy, plus I am crying my eyes out. I’m just holding on to the edge of the pool, trying to keep us both afloat.\u003c/p\u003e\n\u003cp\u003eHe takes another breath, and then another, and the color in his face slowly returns. He looks at me and starts coughing and wheezing and trying to get air into his lungs. He launches into a coughing fit. I push myself out of the water and drag him up with all my might. He helps hoist himself up, but he barely has any strength. He sits bent over, his legs dangling in the water, trying to get a good breath.\u003c/p\u003e\n\u003cp\u003eI scramble to my feet and run over to the bleachers, grab his towel, and drape it over his shoulders. He’s shaking; he won’t stop shaking. “I’m fine, I’m fine. I just—need a minute—to catch—my breath.”\u003c/p\u003e\n\u003cp\u003eI let out a choked sob and sink down beside him on the ground. I thought he was dead. “Oh my God,” I say, and then I’m crying so hard, I can’t see.\u003c/p\u003e\n\u003cp\u003e“Cho, don’t cry,” he begs. “I’m okay. I’m fine.”\u003c/p\u003e\n\u003cp\u003eThrough my tears I ask him, “Wh-what happened?”\u003c/p\u003e\n\u003cp\u003eDazedly he says, “I don’t know. I—I must have passed out in the water.”\u003c/p\u003e\n\u003cp\u003eI wrap his towel tighter around his shoulders. Last night’s dream comes into focus. I remember Reeve in the water. Mary.\u003c/p\u003e\n\u003cp\u003eI dreamed that this would happen.\u003c/p\u003e\n\u003cp\u003eMy eyes dart around the room. I can’t shake this feeling of unease. I rise to my feet; my legs feel weak and unsteady. “Can you stand up?”\u003c/p\u003e\n\u003cp\u003e“You’re soaking wet,” he says, touching my heavy sweatshirt hem.\u003c/p\u003e\n\u003cp\u003eI help him to his feet. I collect my shoes, his gym bag, my towel. We go out to the parking lot and climb into his truck, and Reeve looks at me and says, “Why don’t you get changed first? You’re freezing. Do you have any dry clothes?” He starts rummaging around in the back for my towel. \u003c/p\u003e","sourceLink":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3/page-41.html","bookId":2728,"creation":"Oct 5, 2019 4:24:16 PM","modification":"Oct 5, 2019 4:24:16 PM"}
