{"id":80180,"no":52,"title":"Page 52","content":"\u003cp\u003ePat shoots straight up. The left side of his mouth glistens with drool. “What? Kat, what?”\u003c/p\u003e\n\u003cp\u003e“Why didn’t you tell me that I got a letter from Oberlin!” It’s postmarked March 31, but it’s practically the middle of April.\u003c/p\u003e\n\u003cp\u003ePat rubs his eyes, hard. “What? I told you about that.”\u003c/p\u003e\n\u003cp\u003e“No, you didn’t!” I scream.\u003c/p\u003e\n\u003cp\u003eDad clicks up the volume. “Kat, relax. It’s probably some dorm information.”\u003c/p\u003e\n\u003cp\u003eWhoops. I forgot all about the fact that I never told Pat or my dad that I haven’t actually been accepted into Oberlin yet. “Never mind,” I say, and I go back to the kitchen and sit down at the table with the envelope.\u003c/p\u003e\n\u003cp\u003eI squeeze my eyes shut, trying to black everything out as I slide my finger along the envelope seal. But I don’t see blackness. I see my mother.\u003c/p\u003e\n\u003cp\u003eDear Katherine,\u003c/p\u003e\n\u003cp\u003eOberlin is delighted to welcome you . . .\u003c/p\u003e\n\u003cp\u003eI’m in. I’m f**king in.\u003c/p\u003e\n\u003cp\u003eI walk back to the den to apologize to Pat. I was a bitch. But he’s back asleep, and Dad’s nodding off himself.\u003c/p\u003e\n\u003cp\u003eThis is how it’ll be next year. The two of them here, without me.\u003c/p\u003e\n\u003cp\u003eI start to cry. I’ve spent years dreaming about getting off this island, but I don’t know if I really understood what it will take to do it. What am I going to do without these guys?\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp; *\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eI’m out walking Shep through the piney forest when I hear what sounds like loud music. I follow it and find Reeve’s truck parked in a clearing. There’s no road leading to this spot, just a dirt bike trail. He’s shaking his head back and forth, windows rolled up, the music of his radio blasting. He tips a bottle to his lips.\u003c/p\u003e\n\u003cp\u003ePoor dude. Day drinking is not a good sign. Day drinking by yourself in the woods is a very, very bad sign.\u003c/p\u003e\n\u003cp\u003eI approach slowly. I don’t want to give the kid a heart attack. I cut a diagonal through the woods so he can see me through his windshield.\u003c/p\u003e\n\u003cp\u003eAnd that’s when I see Mary, sitting in the passenger seat next to him. Her head is turned, and she’s watching him like she’s a hungry lion and he’s a bloody piece of meat.\u003c/p\u003e\n\u003cp\u003eWhat the hell?\u003c/p\u003e\n\u003cp\u003eShep starts going absolutely nutso. The dog’s so old, he barely has the energy to wag his tail, but suddenly he’s yanking me forward so hard I have to use both hands to hold on to his leash. I let him pull me toward the truck. Over his barks I call Mary’s name.\u003c/p\u003e\n\u003cp\u003eReeve keeps his eyes closed. I don’t think he can hear me over the blaring music. But Mary hears me. She suddenly turns her head and meets my eyes. I’m up to the truck now, my hand on the door handle. And just as I pull it open, she disappears.\u003c/p\u003e\n\u003cp\u003eI swear to God, she just f**king disappears!\u003c/p\u003e\n\u003cp\u003eShep lets out one more bark. And then he quiets down and sits next to my feet.\u003c/p\u003e\n\u003cp\u003eReeve’s eyes fly open, startled. He quickly shuts off his radio.\u003c/p\u003e\n\u003cp\u003e“Jeez, Kat!”\u003c/p\u003e\n\u003cp\u003eI stare at him. Did he not just see Mary sitting freaking next to him? “What? What the hell is going on?” I look all around me, over my shoulders.\u003c/p\u003e\n\u003cp\u003e“Nothing. I’m just trying to be alone.”\u003c/p\u003e\n\u003cp\u003eAlone?\u003c/p\u003e\n\u003cp\u003eBut Mary . . .\u003c/p\u003e\n\u003cp\u003eMaybe I’m dreaming? I’ve had so many weird dreams about her lately.\u003c/p\u003e\n\u003cp\u003eReeve cracks open a new beer, tips it to his lips, and chugs it down in about four gulps.\u003c/p\u003e\n\u003cp\u003e“Reeve.” Damn. What the hell is going on here? Shep is amped up, sniffing around and growling. I let Shep up into the truck, climb in, and lock the door. “I . . . need to talk to you.”\u003c/p\u003e\n\u003cp\u003eReeve gives me a sour look. “Dude, I just want to drink. I don’t want to talk.”\u003c/p\u003e\n\u003cp\u003e“You’ve got to stop this. I mean, come on. You’re destroying yourself!”\u003c/p\u003e\n\u003cp\u003eI figure he’ll call me out for being dramatic, but instead he says, “There’s nothing left to destroy. It’s over.” Reeve throws his empty bottle into the woods, and it shatters off a tree. He pops open another beer, turns to me, and says bitterly, “All thanks to Alex. He’s obsessed with her. That’s why he ratted me out.”\u003c/p\u003e\n\u003cp\u003eReeve lifts the bottle to his lips, but this time I grab his arm and stop him. “For cheating on Lillia?”\u003c/p\u003e\n\u003cp\u003eReeve stares at me. “What? I never cheated on Lillia. Are you crazy? He’s the one who told everyone about what happened in seventh grade.” He looks up at me, waiting for me to say something. “I know you’ve heard about how I bullied that girl until she freaking killed herself, so don’t pretend like you don’t know what I’m talking about.”\u003c/p\u003e\n\u003cp\u003eI can hear my heart pounding. “Who cares what those dummies say? Rennie made up lies about me for freaking years, remember? Yeah, it was shitty what you did, but it’s not like the girl died. It was a suicide attempt.”\u003c/p\u003e\n\u003cp\u003e“She did die.”\u003c/p\u003e\n\u003cp\u003e“No, she didn’t.”\u003c/p\u003e\n\u003cp\u003eReeve punches the steering wheel. “I don’t know why you’re arguing with me about this, Kat! I’m telling you she died, okay! She freaking died because I was an ass**le! I can’t blame everyone at school for thinking I’m a big piece of shit, because I clearly am.”\u003c/p\u003e\n\u003cp\u003eI can barely breathe.\u003c/p\u003e\n\u003cp\u003e“What was this girl’s name?”\u003c/p\u003e\n\u003cp\u003e“Elizabeth Zane.” He chokes on the words. “I used to call her Big Easy.” He looks at me and blinks a few times as his eyes fill with tears. “Get it? Big E-Z. Aren’t I so f**king clever?”\u003c/p\u003e\n\u003cp\u003eHoly shit. There’s no way. No f**king way. “What did she look like?”\u003c/p\u003e\n\u003cp\u003e“Blond hair. Heavy.”\u003c/p\u003e\n\u003cp\u003eThat sounds like Mary, back before she lost the weight. And she did say Reeve used to call her Big Easy.\u003c/p\u003e\n\u003cp\u003e“Are you sure she’s dead?” I whisper. “I mean, are you one hundred percent positive?”\u003c/p\u003e\n\u003cp\u003eReeve looks at me like I’ve lost my mind.\u003c/p\u003e\n\u003cp\u003eMaybe I have. Mary is . . . dead?\u003c/p\u003e\n\u003cp\u003eNo. I mean, that’s impossible.\u003c/p\u003e\n\u003cp\u003eBut then I think about the occult books I took from Mary’s house. A bunch of them were dog-eared on the pages that talked about communicating with spirits, spirits who think they are still alive.\u003c/p\u003e\n\u003cp\u003eI can’t see; I can’t hear; I can’t breathe. I feel for the door handle and tumble out of the truck.\u003c/p\u003e\n\u003cp\u003e“Wait, where are you going?” Reeve asks.\u003c/p\u003e\n\u003cp\u003e“I—I—I need a ride. And you’re too drunk to drive me.” I walk around to Reeve’s side and pull him out of the driver’s seat.\u003c/p\u003e\n\u003cp\u003e“What? Come on, dude.”\u003c/p\u003e\n\u003cp\u003eHe’s got a few more beers left in the truck. I dump them all out and say, “Just shut up and pass out.”\u003c/p\u003e\n\u003cp\u003eThere’s only one person who can tell me, for sure, what the hell is going on with Mary. I take out my phone and look up directions to Greenbriar Sanitarium. \u003c/p\u003e","sourceLink":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3/page-52.html","bookId":2728,"creation":"Oct 5, 2019 4:24:16 PM","modification":"Oct 5, 2019 4:24:16 PM"}
