{"id":80182,"no":54,"title":"Page 54","content":"\u003cp\u003eMy knees buckle. “Mary’s really dead?”\u003c/p\u003e\n\u003cp\u003eBut before Aunt Bette can answer me, a voice calls out my name. “Kat! Kat, what the hell? How long are you going to make me wait out there?”\u003c/p\u003e\n\u003cp\u003eAunt Bette turns her head. It takes a second for her to drop her hold on me and lunge at Reeve, snarling like a wild animal. Before she can get to him, a bunch of people restrain Aunt Bette. She’s not making any sense. She’s foaming at the mouth. And Reeve, he’s as white as a ghost.\u003c/p\u003e\n\u003cp\u003eI grab his hand, and together we run down the hallway.\u003c/p\u003e\n\u003cp\u003e“What the hell was that all about?” He’s still drunk. I can tell.\u003c/p\u003e\n\u003cp\u003e“Family business,” I pant.\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp; *\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eAfter I drop Reeve off at his house, I walk Shep home then jump into my car and head over to the Jar Island cemetery. It’s dusk, and the groundskeeper will be locking the gates soon, but I make zigzags down the lines of gravestones until I find it. The Zane obelisk.\u003c/p\u003e\n\u003cp\u003eI crouch down and touch the cold marble slab.\u003c/p\u003e\n\u003cp\u003eELIZABETH MARY DONOVAN ZANE\u003c/p\u003e\n\u003cp\u003eI glance around. Is she here right now, watching me?\u003c/p\u003e\n\u003cp\u003eI take out my phone, snap a photo of the grave, and send it to Lillia along with a text.\u003c/p\u003e\n\u003cp\u003eI’ll be outside your house in ten minutes.\u003c/p\u003e\n\u003cp\u003eChapter Fifty-Four\u003c/p\u003e\n\u003cp\u003eMARY\u003c/p\u003e\n\u003cp\u003eI’M IN REEVE’S ROOM WHEN he comes stumbling home. I watch from behind a curtain as Kat parks his truck in the driveway, helps him up the stairs, and then runs down the street with her dog.\u003c/p\u003e\n\u003cp\u003eShe knows my secret. I didn’t mean for her to see me. Even though it was only for a second, it made me feel . . . naked. Exposed.\u003c/p\u003e\n\u003cp\u003eBut it doesn’t matter.\u003c/p\u003e\n\u003cp\u003eReeve comes in and passes out cold on his bed. I put my hand to his forehead, enter his dream.\u003c/p\u003e\n\u003cp\u003eHe’s already at the lighthouse. He’s there, ready to jump.\u003c/p\u003e\n\u003cp\u003eI see that, and then I lift my hand. I let him have a bad dream all on his own. And when he wakes up, that’s when it will happen. I can feel it.\u003c/p\u003e\n\u003cp\u003eChapter Fifty-Five\u003c/p\u003e\n\u003cp\u003eLILLIA\u003c/p\u003e\n\u003cp\u003eWE’RE OVER AT ALEX’S WATCHING a movie—Ash, Derek, PJ, and the junior girl he’s been dating. We hang out here a lot lately. I don’t think any of us want to risk getting into it with Reeve somewhere in public. We’re all avoiding him. Alex fell asleep thirty minutes into the movie, his head on my shoulder. I’ve tried to hold as still for him as I can.\u003c/p\u003e\n\u003cp\u003eMy phone buzzes with a text from Kat. Maybe I can convince her to come over. It’s an action movie that PJ picked, and it’s not like she needs to see the beginning to be able to follow along. I see the picture, and I feel my heart stop.\u003c/p\u003e\n\u003cp\u003eI write back, I’ll be out front at Alex’s.\u003c/p\u003e\n\u003cp\u003eI slide away from him. As I do, he opens his eyes and smiles up at me. “Where are you going?”\u003c/p\u003e\n\u003cp\u003eI whisper, “I’m going to the house to make popcorn,” and fluff up a pillow for him to put under his head.\u003c/p\u003e\n\u003cp\u003e“Mmm. Popcorn.” Alex closes his eyes and immediately falls back to sleep.\u003c/p\u003e\n\u003cp\u003e“Make enough for all of us!” Derek yells.\u003c/p\u003e\n\u003cp\u003eI grab my bag and my car keys and slip out the door.\u003c/p\u003e\n\u003cp\u003eI’m on the curb when Kat pulls up.\u003c/p\u003e\n\u003cp\u003e“Get in.” Kat glances around her. “We don’t have much time.”\u003c/p\u003e\n\u003cp\u003eThere’s a stack of old books in the passenger seat. I climb inside and put the books on my lap.\u003c/p\u003e\n\u003cp\u003e“I saw her, Lillia. She was in Reeve’s car . . . haunting him. And then she f**king disappeared.” Kat forces a swallow. “You didn’t break up with Reeve because he cheated on you, did you? Mary made you do it. Just like before.” My mouth is dry. I want to tell her, but I’m afraid. “The secret’s out, Lil. And she knows that I know!”\u003c/p\u003e\n\u003cp\u003eFor a split second I think about denying it, even now, even with all that Kat knows. That’s how scared I am of Mary, of what she can do. But then I look at Kat, and I can’t even try. “I’m sorry. I thought it would be safer for you if I left you out of it. And . . . I couldn’t risk anybody else finding out, not with Reeve’s life at stake.”\u003c/p\u003e\n\u003cp\u003e“It still is. I saw Mary in his truck today, basically torturing him, trying to get into his head. I called her name, and she straight-up disappeared.”\u003c/p\u003e\n\u003cp\u003eI gasp. “Could Reeve see her?”\u003c/p\u003e\n\u003cp\u003e“No. But I think he could feel her next to him. Or hear her voice. I’m not sure, but she’s definitely getting to him. Think of how crazy he’s been acting lately, drinking twenty-four seven, not sleeping.” Kat fumbles in her pocket for cigarettes but comes up empty. “After that I went to the mental hospital where her aunt Bette’s been locked up. Yo, it was crazy. She kept asking me if Mary had hurt anybody. I had Reeve in the car because he’d passed out and I didn’t have time to drop him off. He came in looking for me, and she went ballistic.”\u003c/p\u003e\n\u003cp\u003eI feel my bottom lip quiver. “God, are we really talking about this? That ghosts are real?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I mean, yeah. This is insane, but . . .” Kat drags her fingers through her hair. “What’s that quote? Once you eliminate the impossible, whatever’s left, no matter how improbable, must be the truth. So it must be true.”\u003c/p\u003e\n\u003cp\u003e“Why can we see her?”\u003c/p\u003e\n\u003cp\u003e“I’ve been thinking about this, about the day we first met her. She came back for revenge, right? And you and I both wanted revenge too, so maybe that’s the connection. Maybe she needed us to help her finish whatever it is she’s here to do. Whatever it is, it’s got to do with Reeve.” Kat lets out a long sigh. “Now that we both know her secret, I don’t think we have much time.”\u003c/p\u003e\n\u003cp\u003eMy whole body starts to shake. “Is there a way that I could somehow convince Reeve to leave Jar Island and never come back? I can’t tell him the truth, because Mary will kill him for sure.”\u003c/p\u003e\n\u003cp\u003e“Kill? She said ‘kill’?” I nod, and Kat shakes her head. “That sounds batshit crazy. Did we know her at all? She was so sweet. She was like a little kid. I can’t even believe it.” Kat grabs one of the books from my lap. “I found these in the Dumpster outside Mary’s house. Her aunt used them on her. They have spells in them. Protection spells.”\u003c/p\u003e\n\u003cp\u003eI wipe my eyes with my sleeve. Kat flips the book to the page she’s looking for. In the margins there are notes written in pencil.\u003c/p\u003e\n\u003cp\u003e—Arrowhead root sold at Nature’s Bounty in Canobie Bluffs.\u003c/p\u003e\n\u003cp\u003e—First spell attempted October 1st, lasted 3 days.\u003c/p\u003e\n\u003cp\u003e—Second spell October 7th (doubled ginger powder), lasted 5 days.\u003c/p\u003e\n\u003cp\u003e—Research possible anger diluents?\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e","sourceLink":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3/page-54.html","bookId":2728,"creation":"Oct 5, 2019 4:24:16 PM","modification":"Oct 5, 2019 4:24:16 PM"}
