{"id":80184,"no":56,"title":"Page 56","content":"\u003cp\u003e“I’ll figure something out. We can’t f**k around, Lil. Who knows how far Mary’s going to take this! Come up with something good. Be outside in five!”\u003c/p\u003e\n\u003cp\u003eChapter Fifty-Seven\u003c/p\u003e\n\u003cp\u003eLILLIA\u003c/p\u003e\n\u003cp\u003eI OPEN THE JEWELRY BOX on my dresser and take out Reeve’s necklace. I hold it in the palm of my hand. I couldn’t bring myself to give it back to him after we broke up.\u003c/p\u003e\n\u003cp\u003eI’ll never be able to separate Reeve from Rennie’s dying, and Mary, and all of it. There hasn’t been a time in our relationship that wasn’t weighed down with secrets and lies and pain. And the longer I hold on to him, the longer I’ll be haunted by the what-ifs and the what-could-have-beens. It’s too late for that. We don’t have a future. But if I do this, if I set him free forever, he will.\u003c/p\u003e\n\u003cp\u003e*\u0026nbsp; *\u0026nbsp; *\u003c/p\u003e\n\u003cp\u003eAfter Kat makes sure my house is safe, we head to Mary’s. Kat goes through the plan with me, and then we ride in silence. We’re both too scared to talk.\u003c/p\u003e\n\u003cp\u003eTo comfort myself I reach into Kat’s backseat and pet Shep. He’s coming along as protection. Kat figured out that animals sense ghosts, so he’ll be our lookout. When she said that, I realized what must have happened that day at the stables with Phantom. Mary had to have been there.\u003c/p\u003e\n\u003cp\u003eShe could have killed me.\u003c/p\u003e\n\u003cp\u003eI still have trouble believing that Mary, my friend Mary, would ever hurt me. But I can’t think like that. She has become something else. She’s not the girl I met on the first day of school.\u003c/p\u003e\n\u003cp\u003eWe park the car, and I let Shep out of the backseat. He sniffs around in the grass and then sits down and tries to give me his paw.\u003c/p\u003e\n\u003cp\u003e“Good sign,” Kat says. She turns to face the house. “Come on. Let’s get this over with.”\u003c/p\u003e\n\u003cp\u003eIt has to work. We have to contain her. With prom two weeks away, I can’t shake the feeling that Mary’s just lying low, waiting to make a big move. Like the homecoming dance, only way, way worse. What if more people get hurt because of us? I couldn’t live with myself.\u003c/p\u003e\n\u003cp\u003eI have to force myself to move, to put one foot in front of the other and walk toward this dilapidated old house and not away from it. As we walk up the front steps with Shep at our heels, Kat quips, “God, I need a cigarette. Quitting smoking during a freaking ghost exorcism was a dumb-ass move on my part.” Her hand shakes as she turns the knob of the front door. “Here we go.”\u003c/p\u003e\n\u003cp\u003eWe step inside, and the house is dark and empty. And freezing cold, which feels impossible for May. I wish I’d brought a jacket.\u003c/p\u003e\n\u003cp\u003e“Is cold a thing mentioned in the books?” I whisper.\u003c/p\u003e\n\u003cp\u003eKat whispers back, “I don’t know. I didn’t have time to read everything.”\u003c/p\u003e\n\u003cp\u003eShep sniffs around, and I turn on the flashlight on my phone and hold it out so we can see. We stay huddled together, taking tiny steps. Then we hear something creak, and we both shriek. It’s just Shep tripping over a raised floorboard. I clutch her arm tighter.\u003c/p\u003e\n\u003cp\u003e“Lil, I’m gonna go upstairs and do the—”\u003c/p\u003e\n\u003cp\u003e“Shh!” I mouth, Mary could be here.\u003c/p\u003e\n\u003cp\u003eKat nods and rummages around in her book bag. She takes out a container of sea salt. It’s already almost empty, and I have a sick feeling we won’t have enough. Next, a roll of twine. She lifts her eyes toward the staircase, and I give the thumbs-up.\u003c/p\u003e\n\u003cp\u003eAnd then we get to it. We go from door to door in the house, starting with the second floor, wrapping each doorknob six times with twine and then putting a line of salt before each threshold.\u003c/p\u003e\n\u003cp\u003eWhen we reach Mary’s bedroom, her door is open and the room is pitch-black.\u003c/p\u003e\n\u003cp\u003eIf Mary is already in there, would she come out and talk to us? Would I be able to see her like always?\u003c/p\u003e\n\u003cp\u003eSuddenly I feel prickles go up my spine. Someone’s here. Watching me. I can feel it. The spell’s working. It’s called her home.\u003c/p\u003e\n\u003cp\u003e“Lil,” Kat hisses. She has her length of twine ready. I reach out, wrap my hand around the doorknob, and start to slowly pull the door closed. Shep starts growling, low and long, and I freeze. “Keep going!”\u003c/p\u003e\n\u003cp\u003eI close it fast, and Kat winds the string while I throw down the salt.\u003c/p\u003e\n\u003cp\u003eKat looks up at me and smiles.\u003c/p\u003e\n\u003cp\u003eAnd then the bedroom door starts to quiver and shake, like someone on the inside is trying to rip it off the hinges. Shep lunges forward, teeth bared, fur standing up on end.\u003c/p\u003e\n\u003cp\u003e“Oh my God!”\u003c/p\u003e\n\u003cp\u003e“Come on!”\u003c/p\u003e\n\u003cp\u003eEach door we pass starts to do the same, as if there is a spirit behind each one. Or maybe Mary’s just everywhere.\u003c/p\u003e\n\u003cp\u003eKat goes down the stairs, and I follow after her, shaking salt on each one. Kat has one of the books open in her hand, and she starts to chant. But I can barely hear what she’s saying. Shep’s barking like crazy now, deep and throaty, as if he were a pit bull. The doors upstairs sound like they’re going to break open any second.\u003c/p\u003e\n\u003cp\u003eThe temperature is even colder than before, like it’s the dead of winter. Our breaths come out in little white clouds.\u003c/p\u003e\n\u003cp\u003eKat takes out her Oberlin acceptance letter. “Give me your thing!” she screams. I fish the necklace out of my pocket and drop it into her hand.\u003c/p\u003e\n\u003cp\u003eI watch as tiny cracks begin to break along the walls. They’re like spiderwebs. Pieces of plaster chip and fall onto the floor. Mary’s in the walls, in the ceiling. The floorboards start to buckle up and snap one by one, like toothpicks.\u003c/p\u003e\n\u003cp\u003eKat lights the corner of her letter on fire with her Zippo, and the whole thing goes up in a flash.\u003c/p\u003e\n\u003cp\u003eI swear I see someone streak past me, from the living room to the kitchen. Shep breaks free from Kat’s hand on his leash. “Shep! Shep!”\u003c/p\u003e\n\u003cp\u003eKat lunges to grab his leash, but it slips through her hands. He only gets a few feet away from us before the floor splinters violently. A board snaps in half and slices him straight through his belly like a wooden sword. He makes a sickening cry, and the sound goes right through me.\u003c/p\u003e\n\u003cp\u003eOh no. No. Kat falls to her knees and lets out a moan. She picks him up in her arms and sobs. “Sheppy. Sheppy, I’m so sorry.”\u003c/p\u003e\n\u003cp\u003eI go to her. Tears blind my eyes. “Kat, we have to go.”\u003c/p\u003e\n\u003cp\u003eShe’s crying too hard to get up. Her sobs rack her body; they fill the whole house. They’re all I hear. I pull on her arm. “Kat, please,” I cry. “We have to go.” She lets me pull her up. We pick Shep’s body up together and then we run for the door.\u003c/p\u003e\n\u003cp\u003eKat has my necklace dangling in her hand. I grab it, hang it on the front doorknob, and pull the door closed.\u003c/p\u003e\n\u003cp\u003eAnd just like that, it’s quiet.\u003c/p\u003e\n\u003cp\u003eWe run as fast as we can to Kat’s car. We put Shep in the backseat, and Kat sits back there with him, her head bent close to his, tears falling onto his coat. She has blood on her shirt, blood on her arms. So do I. \u003c/p\u003e","sourceLink":"https://allnovel.net/ashes-to-ashes-burn-for-burn-3/page-56.html","bookId":2728,"creation":"Oct 5, 2019 4:24:16 PM","modification":"Oct 5, 2019 4:24:16 PM"}
