{"id":106018,"no":40,"title":"Page 40","content":"\u003cp\u003eChen watched it with both alarm and genuine pity. He had never seen a functioning robot before--unless he believed Sinter--though he had once secretly visited the ancient, defunct machine kept by the Mycogenians.\u003c/p\u003e\n\u003cp\u003e“Now, I demand that you hand over control of the trial of Hari Seldon to the Commission of General Security,” Sinter said. He was getting ahead of himself.\u003c/p\u003e\n\u003cp\u003e“I don’t see why,” Chen said calmly, turning away from the ghastly machine.\u003c/p\u003e\n\u003cp\u003e“This robot once served as his wife,” Sinter said.\u003c/p\u003e\n\u003cp\u003eThe Emperor could not take his eyes off it. They gleamed with obvious speculation.\u003c/p\u003e\n\u003cp\u003e“The Tiger Woman, Dors Venabili!” Sinter said. “Suspected to be a robot decades ago--but somehow, never investigated thoroughly. Seldon is an essential part of the robotic conspiracy. He is a stooge of the Eternals.”\u003c/p\u003e\n\u003cp\u003e“Yes, well, he is on trial,” Chen said softly, his eyes heavy-lidded. “You can question him yourself and claim jurisdiction over his fate.”\u003c/p\u003e\n\u003cp\u003eSinter’s nostrils flared as he observed this infuriatingly calm performance. “I fully intend to,” he said. A little dignity born of honest triumph crept into his voice.\u003c/p\u003e\n\u003cp\u003e“Have you proof of all these connections?” Chen asked.\u003c/p\u003e\n\u003cp\u003e“Do I need more proof than what I already have? A record of an impossible meeting between a dead man and a man thousands of years old...A robot when robots are no longer supposed to function, and a human-shaped one at that! I have all I need, Chen, and you know it.” Sinter’s voice rose to a grating tenor.\u003c/p\u003e\n\u003cp\u003e“All right,” Chen said. “Play your cards. Question Seldon, if you wish. But we will follow the rules. That is all we have left in this Empire. Honor and dignity have long since fled.” He looked at Klayus. “I have ever been your faithful servant, Your Highness. I hope Sinter serves you with as much devotion.”\u003c/p\u003e\n\u003cp\u003eKlayus nodded gravely, but there was a twinkle of delight in his eye.\u003c/p\u003e\n\u003cp\u003eChen turned and departed with his servants. Behind him, in the long, broad chamber of the former old Hall of Merit, Sinter began to laugh, and the laugh turned into a bray.\u003c/p\u003e\n\u003cp\u003eMors Planch hung his head, wishing he were already dead.\u003c/p\u003e\n\u003cp\u003eOn his way through the huge sculptured doors, back to his palace vehicle parked by the official thoroughfare, Linge Chen allowed himself a brief smile. From that point on, however, his face was like a wax effigy, pale and drawn, simulating defeat.\u003c/p\u003e\n\u003cp\u003e54.\u003c/p\u003e\n\u003cp\u003eThe guards returned to Hari’s cell in the morning. He sat on the edge of the cot, as he had every morning since the visit from the old tiktok, unwilling to sleep any more than was necessary. He had already dressed and performed his ablutions, and his white hair was combed back with a small pin holding it in place, forming the little scholar’s knot, a meritocratic style he had shunned until now. But if Hari stood for any particular class, after years in academe and his brief stint as First Minister, it was the meritocrats. Like them, I have never had any children--adopted Raych, nurtured him and my grandchildren, but never any children of my own...Dors...\u003c/p\u003e\n\u003cp\u003eHe blocked that line of thought.\u003c/p\u003e\n\u003cp\u003eWith his trial, meritocrats across the Galaxy would see whether science and the joy of inquiry could be tolerated in a declining Empire. Other classes as well might have some interest in the proceedings, even though they were closed; word would leak out. Hari had become quite well-known, if not infamous.\u003c/p\u003e\n\u003cp\u003eThe guards entered with practiced deference and stood before him.\u003c/p\u003e\n\u003cp\u003e“Your advocate waits outside to accompany you to the judicial chambers of the Commission.”\u003c/p\u003e\n\u003cp\u003e“Yes, of course,” Hari said. “Let’s go.”\u003c/p\u003e\n\u003cp\u003eSedjar Boon met Hari in the corridor. “Something’s up,” he whispered to Hari. “The structure of the trial may be changed.”\u003c/p\u003e\n\u003cp\u003eThis confused Hari. “I don’t understand,” he said softly, eyeing the guards on either side. A third guard walked behind them, and three steps behind that guard, three more. He was being protected with some thoroughness considering they were already supposed to be in a completely secure facility.\u003c/p\u003e\n\u003cp\u003e“The trial was originally scheduled to take less than a week,” Boon said. “But the Emperor’s office of judicial oversight has rescheduled and reserved the chamber for three weeks.”\u003c/p\u003e\n\u003cp\u003e“How do you know?”\u003c/p\u003e\n\u003cp\u003e“I’ve seen the writ from the Commission of General Security.”\u003c/p\u003e\n\u003cp\u003e“What’s that?” Hari asked, looking up with surprise.\u003c/p\u003e\n\u003cp\u003e“Farad Sinter has been given his own Commission, a new branch under the Emperor’s budget. Linge Chen is fighting to keep them out of the trial--claiming gross irrelevancies--but it looks like Sinter will be allowed to question you at some point.”\u003c/p\u003e\n\u003cp\u003e“Oh,” Hari said. “I presume someone or other will allow me a chance to speak, in between all the Commission heavyweights.”\u003c/p\u003e\n\u003cp\u003e“You’re the star,” Boon said. “As well, at the request of General Security, you and Gaal Dornick will be tried together. The others will be released.”\u003c/p\u003e\n\u003cp\u003e“Oh,” Hari said coolly, though this surprised him even more.\u003c/p\u003e\n\u003cp\u003e“Gaal Dornick has been formally charged,” Boon mused. “But he’s a small fish--why did they choose him in particular?”\u003c/p\u003e\n\u003cp\u003e“I don’t know,” Hari said. “I presume because he was the latest to join our group. Perhaps they assume he will be the least loyal and the most willing to talk.”\u003c/p\u003e\n\u003cp\u003eThey arrived at the lift. Four minutes later, having ascended a kilometer to the Hall of Justice, in the Imperial Courts Building, they stood at the high, intricately worked bronze doors of Courtroom Seven, First District, Imperial Sector, devoted the past eighteen years to hearings called by the Commission of Public Safety.\u003c/p\u003e\n\u003cp\u003eThe doors swung open at their approach. Within, the beautiful wooden benches and plush baronial boxes arrayed along the theatrically sloping aisles were empty. The guards urged them politely down the broad blue-and-red carpeted center aisle, across the front of the courtyard, into the small side conference room. The door closed behind Hari and Boon.\u003c/p\u003e\n\u003cp\u003eAlready seated in the Crib of the Accused was Gaal Dornick.\u003c/p\u003e\n\u003cp\u003eHari took his seat beside him.\u003c/p\u003e\n\u003cp\u003e“This is an honor,” Gaal said in a trembling voice.\u003c/p\u003e\n\u003cp\u003eHari patted his arm.\u003c/p\u003e\n\u003cp\u003eThe sitting judges of the Commission of Public Safety, five in all, entered through the opposite door. Linge Chen entered then and sat in the center.\u003c/p\u003e\n\u003cp\u003eThe court proctor entered last, her duties an ancient formality. She was a short, willowy woman with small blue eyes and short-cut red hair. She strode to the Table of Charges, examined the documents there, shook her head sadly at some and nodded solemnly at others, then approached the five Commissioners.\u003c/p\u003e\n\u003cp\u003e“I declare these papers of indictment to have been properly drawn and formally and correctly entered into the List of Charges of the Imperial Hall of Justice on the administrative Capital World of Trantor in the year of the Empire 12067. Be aware, all concerned, that the eyes of posterity witness these proceedings, and that all such proceedings will be duly logged and, within a thousand years, presented for public scrutiny, as required by the ancient codes to which all Imperial courts referring to any constitution and any particular set of laws must adhere. Hey nas nam niquas per sen liquin.”\u003c/p\u003e\n\u003cp\u003eNobody knew what the last phrase meant; it was an obscure dialect affected by the nobles who convened the Council of Po over twelve thousand years ago. Nothing else was known about the Council of Po, except that a constitution long since ignored had once been drafted there.\u003c/p\u003e\n\u003cp\u003eHari sniffed and turned his eyes to the Commission.\u003c/p\u003e\n\u003cp\u003eLinge Chen leaned forward slightly, acknowledging the proctor’s statement, then leaned back. He did not look at Hari or anyone else in the courtroom. His regal bearing, Hari decided, would do credit to a clothing-store mannequin.\u003c/p\u003e\n\u003cp\u003e“Let these proceedings begin,” the Chief Commissioner said in a quiet voice, delicately melodious, sibilants emphasized ever so aristocratically.\u003c/p\u003e\n\u003cp\u003eHari settled in with a barely audible sigh.\u003c/p\u003e\n\u003cp\u003e55.\u003c/p\u003e\n\u003cp\u003eKlia had never been more frightened. She stood in the old dusty long chamber, listening to the murmurs from the group at the opposite end. Brann stood three paces away, his back stiff and shoulders hunched, as if he, too, were waiting for an ax to fall.\u003c/p\u003e\n\u003cp\u003eFinally Kallusin broke away from the group and approached them. “Come meet your benefactor,” he said to them.\u003c/p\u003e\n\u003cp\u003eKlia shook her head and stared at the group with wide eyes.\u003c/p\u003e\n\u003cp\u003e“They won’t bite,” Kallusin said with a slight smile. “They’re robots.”\u003c/p\u003e\n\u003cp\u003e“So are you,” Klia said. “How can you look so human? How can you smile?” She shot her questions at Kallusin like accusations.\u003c/p\u003e\n\u003cp\u003e“I was made to look human, and to mimic in my poor way both wit and style,” he replied. “There were real artists in those days. But there’s one who’s even more of a work of art than I am, and another who is older than either of us.”\u003c/p\u003e\n\u003cp\u003e“Plussix,” she said with a shudder.\u003c/p\u003e\n\u003cp\u003eBrann stepped to one side and shoved between her and Kallusin. Klia looked up at his bulk with questioning eyes. Are they all robots? Is everyone on Trantor a robot--but me? Or am lone, too?\u003c/p\u003e\n\u003cp\u003e“We have to get used to all this,” Brann said. “It won’t do anybody any good if you force us.”\u003c/p\u003e\n\u003cp\u003e“Of course not,” Kallusin said, and his smile faded, to be replaced by an alert blankness that was neither kindly nor threatening. He turned to Klia. “It’s very important that you understand. You could help us avert a major catastrophe--a human catastrophe.”\u003c/p\u003e\n\u003cp\u003e“Robots used to be servants,” she said. “Like tiktoks before I was born.”\u003c/p\u003e\n\u003cp\u003e“Yes,” Kallusin said.\u003c/p\u003e\n\u003cp\u003e“How can they be in charge of anything?”\u003c/p\u003e\n\u003cp\u003e“Because humans rejected us, long ago, but not before a very bad problem arose among us.”\u003c/p\u003e\n\u003cp\u003e“Who--robots? A problem among the robots?” Brann asked.\u003c/p\u003e\n\u003cp\u003e“Plussix will explain. There can be no better testimony than from Plussix. He was functioning at the time.”\u003c/p\u003e\n\u003cp\u003e“Did he...go wrong?” Klia asked. “Is he an Eternal?”\u003c/p\u003e\n\u003cp\u003e“Let him explain,” Kallusin said patiently, and urged her to walk forward, toward the others.\u003c/p\u003e\n\u003cp\u003eKlia noticed the man they had rescued in the Agora of Vendors. He looked over his shoulder at them and gave her a smile. He seemed friendly enough; his face was so unattractive she wondered why anyone could have ever made a robot like him.\u003c/p\u003e\n\u003cp\u003eTo fool us. To walk among us undetected.\u003c/p\u003e\n\u003cp\u003eShe shivered again and wrapped her arms around herself. This room was what the woman on the cart had been looking for--this room, and the robots inside it.\u003c/p\u003e\n\u003cp\u003eShe and Brann were the only humans here.\u003c/p\u003e\n\u003cp\u003e“All right,” she said, and drew herself together. They did not want to kill her, not yet. And they weren’t threatening her to make her do what they wanted. Not yet. Robots seemed to be more subtle and patient than most of the humans she had known.\u003c/p\u003e\n\u003cp\u003eShe looked up at Brann. “Are you human?” she asked him.\u003c/p\u003e\n\u003cp\u003e“You know I am,” he said.\u003c/p\u003e\n\u003cp\u003e“Let’s do it, then. Let’s go hear what the machines have to say.”\u003c/p\u003e\n\u003cp\u003ePlussix had not appeared to her in his actual shape for obvious reasons. He--it--was the only robot that looked like a robot, and a rather interesting look it was--steel with a lovely silvery-satin finish, and glowing green eyes. His limbs were slender and graceful, their joints marked by barely perceptible fine lines that could themselves orient in different directions--fluid and adaptable. \u003c/p\u003e","sourceLink":"https://allnovel.net/foundation-and-chaos-second-foundation-trilogy-2/page-40.html","bookId":1536,"creation":"Oct 5, 2019 10:51:58 PM","modification":"Oct 5, 2019 10:51:58 PM"}
