{"id":57233,"no":125,"title":"Book 5 Chapter 28","content":"\u003cp\u003e\u003cstrong\u003eB5C28: Cha Po’s death\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eAt the moment, the atmosphere inside the main hall is very oppressive. Hou Fei and Cha Hong are confronting each other. It seems they can fight anytime now.\u003c/p\u003e\n\u003cp\u003eCha Hong is secretly surprised: “This monkey is unexpectedly so strong. He should be a match for ordinary Dongxu stage experts, but if he really fights me, he’ll stand no chance.” He is very confident.\u003c/p\u003e\n\u003cp\u003e“Cave master, I came here to be a guardian, and not to be insulted. That Sang Mo fella dug his own grave by offending me. If he hadn’t offended me, why would I have killed him?”\u003c/p\u003e\n\u003cp\u003eHou Fei’s voice resounds through the hall.\u003c/p\u003e\n\u003cp\u003e“Oh, he offended you?” Cha Hong ponders for a while. “Guardian Hou Fei, well, this rule is indeed somewhat problematic. If he threatened or offended you, it’ll be unfair if instead of punishing him you have to suppress your anger due to this rule.”\u003c/p\u003e\n\u003cp\u003eRight after these words are said, the atmosphere in the hall is no longer as tense as it was a moment ago.\u003c/p\u003e\n\u003cp\u003eHearing Cha Hong say so, Qin Yu secretly relaxes a bit.\u003c/p\u003e\n\u003cp\u003e“All right, for the moment, this matter is put on hold. I’ll examine it carefully later.” Cha Hong then turns to Qin Yu, saying: “Guardian Liu Xing, the 3 guardians Bai Yin, Ran Lan and Mu Xu are already dead, but you unexpectedly said that Bai Yin and Ran Lan had collaborated with the black eagle?”\u003c/p\u003e\n\u003cp\u003e“That’s indeed what happened, cave master.”\u003c/p\u003e\n\u003cp\u003eQin Yu’s face looks pale, but he still says with a cough.\u003c/p\u003e\n\u003cp\u003eAs soon as Cha Hong scans Qin Yu’s wound with his holy sense, he is secretly astonished. After being told by Cha Po, he already thought that Qin Yu’s injury was very serious, but he never thought that it would be this serious. He even wonders how Qin Yu can still stand with such a severe wound.\u003c/p\u003e\n\u003cp\u003eQin Yu, however, feels frustrated inwardly.\u003c/p\u003e\n\u003cp\u003e“Meteoric Tear, your healing ability is too strong. After I rested in my house for just a short time, the wound had already almost healed so I had no choice but to injure myself again.” Qin Yu’s wound of course was caused by himself.\u003c/p\u003e\n\u003cp\u003eHis wound was indeed shockingly serious.\u003c/p\u003e\n\u003cp\u003eHowever, because the Meteoric Tear’s healing ability is too strong, after he rested in his courtyard house for some time, more than half of the wound had already healed. Therefore, he had to tear it open again.\u003c/p\u003e\n\u003cp\u003e“Your injury is indeed very serious, guardian Liu Xing. It’s not that I don’t believe you, but guardian Bai Yin has served the Blood-red Cave for many years and he’s never shown any disloyalty before. This time … I really can’t believe it.” Cha Hong says in a seemingly sincere manner: “How about this? Can you describe the fighting process again, guardian Liu Xing?”\u003c/p\u003e\n\u003cp\u003eQin Yu slightly gasps for breath and says: “Cave master, I and 4 other guardians went out to hunt for that black eagle together. When we ran into it, we began to attack it according to our plan, but Bai Yin suddenly sneakily attacked guardian Mu Xu.”\u003c/p\u003e\n\u003cp\u003eWhen the other Xiuyaoists in the hall hear this, their hearts cannot help but skip a beat.\u003c/p\u003e\n\u003cp\u003eMiddle Yuanying stage Bai Yin sneakily attacking a completely defenseless Mu Xu, the result of this is easy to imagine.\u003c/p\u003e\n\u003cp\u003e“Guardian Mu Xu died instantly. Guardian Zhuang Zhong was on high alert so when seeing this scene he noticed that Ran Lan was also attacking him. Guardian Zhuang Zhong then fought guardian Ran Lan and in the end killed him. Meanwhile, I attacked guardian Bai Yin. Using the Thunder Talisman that my master had bestowed on me, I killed Bai Yin immediately.”\u003c/p\u003e\n\u003cp\u003eQin Yu has told a lie without batting an eyelid.\u003c/p\u003e\n\u003cp\u003eThe Thunder Talisman is no ordinary talisman. Talismans and seals are also divided into classes. Generally, only expert talisman or seal makers who have reached extremely high levels in power can create this Thunder Talisman.\u003c/p\u003e\n\u003cp\u003e“Thunder Talisman!”\u003c/p\u003e\n\u003cp\u003eTeng Bi, who has been keeping his eyes shut on one side, suddenly opens his eyes, looking completely astonished.\u003c/p\u003e\n\u003cp\u003eQin Yu, however, secretly laughs. He does not have any Thunder Talismans and has only read about how to make this kind of talisman and its power in some Xiuzhen books. This formidable kind of talisman is extremely difficult to make and its materials are also extremely difficult to obtain.\u003c/p\u003e\n\u003cp\u003e“Guardian Liu Xing, your master is really powerful.” Cha Hong praises then says: “Most probably afterwards you fought the black eagle and scared it off despite getting seriously injured.”\u003c/p\u003e\n\u003cp\u003eQin Yu nods his head.\u003c/p\u003e\n\u003cp\u003eFrom beginning to end, guardian Zhuang Zhong does not say anything, but his expression looks somewhat unpleasant.\u003c/p\u003e\n\u003cp\u003eThe remaining guardians have always thought that Zhuang Zhong is a very nice fellow. He has treated every one of them very well and therefore is extremely popular.\u003c/p\u003e\n\u003cp\u003e“Guardian Zhuang Zhong, was the course of events the same as what guardian Liu Xing said?” Cha Hong looks at Zhuang Zhong and asks. Qin Yu and the others also look at him. It is impossible to confirm based on Qin Yu’s account alone. Zhuang Zhong’s account is also very important.\u003c/p\u003e\n\u003cp\u003eZhuang Zhong lets out a sigh: “Alas, cave master, my heart is in a lot of pain.”\u003c/p\u003e\n\u003cp\u003eEveryone present begins to guess what is going to happen if Zhuang Zhong refutes Qin Yu’s words.\u003c/p\u003e\n\u003cp\u003e“Everybody knows that there’s a very good relationship between Bai Yin, Ran Lan, Mu Xu and me.” His answer is beside the point. The other guardians all nod their heads. They all know about Bai Yin’s gang of four. Zhuang Zhong continues: “Bai Yin was a bit of a hypocrite but he treated us pretty well. Ran Lan was bitter and cruel but he was also fairly loyal.”\u003c/p\u003e\n\u003cp\u003eThe other guardians, however, secretly curse.\u003c/p\u003e\n\u003cp\u003eLoyal?\u003c/p\u003e\n\u003cp\u003eWho does not know about Ran Lan’s cunningness and ruthlessness? Bai Yin was even more adept at toadying and was extremely hypocritical. Therefore, after Qin Yu said that they were in league with the black eagle, some of the guardians in the hall believed him at once.\u003c/p\u003e\n\u003cp\u003e“But, I never thought that the 2 of them would collaborate with the black eagle to kill me, Mu Xu and guardian Liu Xing. I think they wanted our yuanyings and jindan and guardian Liu Xing’s high-grade holy weapon.”\u003c/p\u003e\n\u003cp\u003eZhuang Zhong sighs: “Who could have thought that they were so greedy. From beginning to end, they didn’t tell me anything.”\u003c/p\u003e\n\u003cp\u003eThe 3 black turtle brothers, the 2 snake women and the others all secretly sneer.\u003c/p\u003e\n\u003cp\u003eTell an honest fellow like you?\u003c/p\u003e\n\u003cp\u003eAt the same time, they look at Qin Yu in amazement. They never thought that he has a high-grade holy weapon. Even though he used the black flying sword to fight Sang Mo before, it is very difficult to evaluate flying swords based on appearance alone.\u003c/p\u003e\n\u003cp\u003eCha Hong also says with a sigh: “Don’t be upset, guardian Zhuang Zhong. They are unworthy of your grief.”\u003c/p\u003e\n\u003cp\u003e“Alright, now the matter has practically been cleared up. Bai Yin and Ran Lan coveted the other guardians’ yuanyings, jindan and holy weapon so they collaborated with the black eagle, thinking that nobody would know about this. Not even death can expiate their crime. Cha Po, give guardian Liu Xing Ran Lan’s yuanying. Guardian Liu Xing has been seriously injured. After refining this yuanying, he will probably improve a bit in power. This is the compensation for his injury.”\u003c/p\u003e\n\u003cp\u003eHearing Cha Hong say so, Cha Po reaches out a hand. Ran Lan’s yuanying appears on his hand.\u003c/p\u003e\n\u003cp\u003eThe other guardians, however, pay no attention to it.\u003c/p\u003e\n\u003cp\u003eNot many Xiuyaoists absorb yuanyings because, firstly, other yuanyings’ energies are different from their own energies. Absorbing others’ energies will defile the energies inside their bodies, which will be harmful to them in the future.\u003c/p\u003e\n\u003cp\u003eMoreover, a practitioner who refines and absorbs a yuanying in the right way can only obtain 10% of its energy.\u003c/p\u003e\n\u003cp\u003eMost of the other guardians are at the early Yuanying stage so they do not really care about absorbing the yuanying of someone of this power level. Even if they only absorbed its essence, their power would improve by just 10% at most.\u003c/p\u003e\n\u003cp\u003e“Guardian Liu Xing, take it. This is a gesture of goodwill from my big brother.” Cha Po hands over the yuanying but his mind is suspicious of Qin Yu: “Humph, let me see if you’ll dare to refine and absorb this yuanying. They say Xiuxianists can’t absorb yuanyings. In just a while, everything will become clear because of this yuanying.”\u003c/p\u003e\n\u003cp\u003e“Thank you, cave master!”\u003c/p\u003e\n\u003cp\u003eQin Yu immediately receives Ran Lan’s yuanying.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eIn the secret room of the Blood-red Cave, there are only Cha Hong and Cha Po at the moment.\u003c/p\u003e\n\u003cp\u003e“Big brother, why didn’t you tell that guardian Liu Xing to refine the yuanying in the main hall so that we could see with our own eyes? Humph, if he didn’t dare to refine it, or if his energy misbehaved badly after the absorption, that would mean he’s the Xiuxianist!”\u003c/p\u003e\n\u003cp\u003eCha Po has always been suspicious of Qin Yu’s identity.\u003c/p\u003e\n\u003cp\u003eCha Hong gives an indifferent smile. He does not want to confront Qin Yu for the moment.\u003c/p\u003e\n\u003cp\u003eThe reason for this is that the black jade case is going to be opened within several months. To him, no matters can be as important as the black jade case.\u003c/p\u003e\n\u003cp\u003e“2nd brother, listen. In the next half year, you mustn’t provoke Liu Xing and Hou Fei. Just pretend that you trust them and consider them friends. No matter what happens, you have to wait for a half year. I want the Blood-red Cave to be stable in this half year!” Cha Hong says solemnly.\u003c/p\u003e\n\u003cp\u003eHearing his big brother say in such a serious manner, Cha Po immediately nods.\u003c/p\u003e\n\u003cp\u003e“All right, 2nd brother, you can leave. Don’t disturb me during this period of time. I want to finish my practice without a break.” Cha Hong says smilingly.\u003c/p\u003e\n\u003cp\u003eWith his eyes brightening, Cha Po says: “Big brother, could it be you’re going to make a breakthrough within a half year?” He simply does not know about the black jade case so after hearing Cha Hong say that no accidents are allowed to happen in the next half year he thinks that his big brother is about to make a breakthrough.\u003c/p\u003e\n\u003cp\u003eCha Hong gives a smile and nods.\u003c/p\u003e\n\u003cp\u003eIndeed he is going to make a breakthrough in power soon. But it is going to take him from 2 to 3 years instead of a half year.\u003c/p\u003e\n\u003cp\u003eDo not think that he has only been spending his own energy to drain the energy of the black jade case’s Dust Removing restrictive spell. While using his energy, he has also been absorbing the holy energy in nature to practice. His yuanying has been gradually improving for the past 100 years and Cha Hong has already reached the peak of the early Dongxu stage.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eQin Yu’s injury has healed completely in less than a half day.\u003c/p\u003e\n\u003cp\u003e“Fei Fei, I’m going to do closed-door training for some time. Don’t let anyone disturb me during this period of time unless something serious happens.” Qin Yu entrusts the task of guarding to Hou Fei on one side of him.\u003c/p\u003e\n\u003cp\u003eHou Fei says with a smile: “Don’t worry, big brother. This time we got the 4 yuanyings of Bai Yin, Ran Lan, Mu Xu and Sang Mo. But I’ve already reached the middle Yuanying stage so it’s basically useless for me to absorb them. They aren’t even very useful to Xiao Hei either. So, they can only be given to you.”\u003c/p\u003e\n\u003cp\u003eA faint smile appears on Qin Yu’s face.\u003c/p\u003e\n\u003cp\u003e“There’s no hurry to refine them. Of the 4 yuanyings, I only need Bai Yin’s. It’s totally enough for me already. Let’s put the other yuanyings away for the moment.” It is not necessarily a good thing to refine as many yuanyings as possible. When the refiner’s power reaches a certain level, he should stop.\u003c/p\u003e\n\u003cp\u003eNow Qin Yu wants to reach the 2nd of the 6 stage of the Stellar Transformations, the Meteor stage.\u003c/p\u003e\n\u003cp\u003e“All right, big brother. I’m going to help you by guarding outside. No one will be able to disturb you.” Hou Fei leaves while laughing kaka. Qin Yu immediately goes into his own bedroom and sits down with legs crossed on the bed. His mind starts to recall the contents of the Stellar Transformations.\u003c/p\u003e\n\u003cp\u003eThe Stellar Transformations is divided into 6 stages, Nebula, Meteor, Core, Planet, Dujie and Star. The Nebula stage is about consolidating the foundation so its offense is not strong at all. However, once the practitioner reaches the Meteor stage, his offense will begin to increase by leaps and bounds.\u003c/p\u003e\n\u003cp\u003eIn the past, when Lei Wei was still at the middle Dujie stage, he was able to single-handedly kill a Dacheng stage Xiuzhenist, several loose immortals and several tens Dujie stage and Kongming stage Xiuzhenists. Afterwards, he overcame 8 of the 9 thunderbolts of the 9-From-9th Heaven Tribulation before unwillingly failing to withstand the 9th thunderbolt in the end.\u003c/p\u003e\n\u003cp\u003eHis power was shockingly strong.\u003c/p\u003e\n\u003cp\u003eLei Wei was definitely a humanoid divine beast, or even something stronger. However, Qin Yu is currently not so formidable like that because he has only reached the foundation-strengthening stage, Nebula.\u003c/p\u003e\n\u003cp\u003e“To reach the Meteor stage, I have to combine a very great number of silvery grains into a golden particle of essence. It will become a core inside my body -- a Meteor.” Qin Yu gives a faint smile. The gap between the late Nebula stage and the early Meteor stage is really too big.\u003c/p\u003e\n\u003cp\u003eThe Meteor stage focuses on speed, condensation and instantaneous explosiveness!\u003c/p\u003e\n\u003cp\u003eAt the moment, Qin Yu’s stellar energy is still in its most common form. By the time he reaches the Meteor stage, a myriad of silvery grains will have already been refined down to a single golden particle of essence called a Meteor. Energy will come out from the Meteor in the form of thin threads that looks like rays of light.\u003c/p\u003e\n\u003cp\u003eTheir thinness also represents a high level of energy condensation.\u003c/p\u003e\n\u003cp\u003eHis offensive force will be focused on one point so it will be extraordinarily powerful. The golden stellar energy will also fuse with his body so he will progress at least 10 times faster than he is at the moment, or maybe even more.\u003c/p\u003e\n\u003cp\u003e“Theoretically, at the Nebula stage, a practitioner of the Stellar Transformations should stay in a certain place to practice. Only when he has reached the Meteor stage can he wander around and fight other Xiuzhenists!”\u003c/p\u003e\n\u003cp\u003eAs soon as Qin Yu remembers the descriptions of the Meteor stage and the later stages in the Stellar Transformations, he cannot help feeling himself burning with excitement. Now he is weaker than Xiao Hei and Hou Fei, but this will change once he reaches the early Meteor stage.\u003c/p\u003e\n\u003cp\u003e“Alright, let’s start practicing.”\u003c/p\u003e\n\u003cp\u003eQin Yu closes his eyes.\u003c/p\u003e\n\u003cp\u003eHowever, at this moment, the noise of an explosion reaches him from inside the Blood-red Cave. Afterwards, the cave is in turmoil. All the guarding Xiuyaoists begin to run in all directions.\u003c/p\u003e\n\u003cp\u003e“Guardian Hou Fei, vice master has been killed by a mysterious figure. That mysterious figure has disappeared. Please chase and capture the killer quickly.”\u003c/p\u003e\n\u003cp\u003eA guard runs up to the side of Hou Fei and says respectfully. Hou Fei’s face changes color. He says: “You can leave first.” He then runs towards Qin Yu’s room at once. But Qin Yu has already come out of the room. He also heard clearly what that guard said just now.\u003c/p\u003e\n\u003cp\u003e“Big brother?” Hou Fei looks at Qin Yu.\u003c/p\u003e\n\u003cp\u003eQin Yu feels that the current situation is somewhat bad. Cha Po, the cave’s vice master, has unexpectedly been killed at this time. However, the wound on his stomach has healed completely and he cannot let anyone discover this.\u003c/p\u003e\n\u003cp\u003e“Fei Fei, no matter what happens, if someone comes to find me, just tell them I am doing closed-door training and can’t be disturbed. I feel that the situation has already become a little chaotic. I must quickly improve my power.” He immediately says to Hou Fei.\u003c/p\u003e\n\u003cp\u003eHou Fei nods then sits down in the courtyard of Qin Yu’s house at once. He will not let anybody disturb Qin Yu.\u003c/p\u003e\n\u003cp\u003eDisregarding everything, Qin Yu goes back into his room.\u003c/p\u003e\n\u003cp\u003eAt this crucial moment, the most important thing to do is improve his power! Once he reaches the Meteor stage, his hands will no longer be tied as they are now.\u003c/p\u003e\n\u003cp\u003eMeanwhile, an extremely furious deep voice resounds through the Blood-red Cave.\u003c/p\u003e\n\u003cp\u003e“Listen up, 5000 guards and 11 guardians. From now on, keep a close watch everywhere. Nobody is allowed to enter the Blood-red Cave. Whoever violates this rule must be killed!” All of the guards and guardians immediately become much more alert. The looks in their eyes become even fiercer as well.\u003c/p\u003e\n\u003cp\u003eEnd of b5c28.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-5-chapter-27\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-5-chapter-29\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/stellar-transformations/st-book-5-chapter-28","bookId":1510,"creation":"Sep 10, 2019 6:01:27 AM","modification":"Sep 10, 2019 6:01:27 AM"}
