{"id":57277,"no":169,"title":"Book 8, Chapter 6","content":"\u003cp\u003e\u003cstrong\u003eB8C6: Kill\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eQin De, Qin Feng, Qin Zheng and Fengyuzi are dumbfounded as they hear those words.\u003c/p\u003e\n\u003cp\u003eTower master?\u003c/p\u003e\n\u003cp\u003eWho is tower master?\u003c/p\u003e\n\u003cp\u003eBoth Fengyuzi and Qin De can see how distinctive this large group of Xiuzhenists in front of them is because these Xiuzhenists are wearing very similar clothes, just like an army of mortals.\u003c/p\u003e\n\u003cp\u003eAn army of Xiuzhenists?\u003c/p\u003e\n\u003cp\u003eAt least Fengyuzi never saw such a group of Xiuzhenists when he was still in his Pure Sword school.\u003c/p\u003e\n\u003cp\u003e“Xiuyaoists, they are Xiuyaoists!” Fengyuzi’s face changes color madly. He says to Qin De, Qin Feng, Qin Zheng and Qin Yu via holy sense communication without delay: “As far as armies of Xiuzhenists are concerned, I’ve only heard that the Penglai Immortal Region has a guard army made up entirely of Xiuzhenists. Maybe the Purple Flame Devilish Dungeon also has one. But this group of Xiuyaoists comes from the greatest power, the underwater Xiuyao world. This tower master must be the leader of a big underwater power that can match the Penglai Immortal Region!”\u003c/p\u003e\n\u003cp\u003eQin De, Qin Feng and Qin Zheng are astonished.\u003c/p\u003e\n\u003cp\u003eThey have heard Fengyuzi talk about the Penglai Immortal Region. It is the center for Xiuxianists in the boundless overseas Xiuzhen world. But now, this so-called tower master is even the leader of a big underwater Xiuyaoist power on par with the Penglai Immortal Region. What kind of figure is this?\u003c/p\u003e\n\u003cp\u003e“Don’t just stand here in a daze, Yu’er. That tower master must be around. This large army of Xiuyaoists just knelt down in this direction of us so we should step aside quickly. If that tower master gets angry, that will be a huge disaster.” Qin De holds Qin Yu with a grab, wanting to pull him to one side.\u003c/p\u003e\n\u003cp\u003eQin Feng, Qin Zheng and Fengyuzi even look up and around but they simply cannot find that so-called ‘tower master.’\u003c/p\u003e\n\u003cp\u003eFengyuzi suddenly says via holy sense communication: “Let’s go quickly. Don’t look. What kind of figure do you think that tower master is? They must be 10 or even 100 times stronger than the headmaster of my Pure Sword school. How can we possibly detect this kind of expert with our power? Let’s go quickly before that tower master gets angry. Quickly step aside.”\u003c/p\u003e\n\u003cp\u003e“Yu’er, there’s no need to take revenge hurriedly. Now the most important thing you have to do is leave with me.” Qin De says while paying attention to his surroundings.\u003c/p\u003e\n\u003cp\u003eTerrified.\u003c/p\u003e\n\u003cp\u003eQin De, Fengyuzi, a mortal emperor like Qin Zheng and a mortal general like Qin Feng are all very terrified at the moment.\u003c/p\u003e\n\u003cp\u003eOn the Qian Long continent, where a Jindan stage Xiuzhenist is already considered Shangxian, such a large army of Xiuyaoists is really extremely fearsome. Not only are they numerous, totaling 10,000 in number, their clothes and flying swords are so standardized! They are obviously an army.\u003c/p\u003e\n\u003cp\u003eDeploying Xiuzhenists as troops, how can ordinary Xiuzhen schools possibly do something so impressive?\u003c/p\u003e\n\u003cp\u003eWhen it comes to Xiuxianists, only the legendary Penglai Immortal Region is capable of such a thing. This large army of Xiuyaoists obviously belongs to a superpower in the underwater Xiuyao world, which according to legend is the greatest force. What kind of figure is the leader of such an army?\u003c/p\u003e\n\u003cp\u003eWith just a word, they can drown the world in blood! With just a lift of their hand, they can cause storms!\u003c/p\u003e\n\u003cp\u003eHow can Qin De, Qin Zheng, Qin Feng and Fengyuzi possibly not be frightened and terrified by such a VIP and such a tower master?\u003c/p\u003e\n\u003cp\u003e“Let’s go quickly. Quit thinking about revenge. Now it’s time to leave here quickly.” Qin De is so anxious that he attempts to drag Qin Yu to run away directly. However, no matter how hard he tries, Qin Yu remains motionless.\u003c/p\u003e\n\u003cp\u003e“Xiao Yu.”\u003c/p\u003e\n\u003cp\u003eQin Zheng, Qin Feng, and Fengyuzi also pull Qin Yu hurriedly. At the moment they are all very frightened.\u003c/p\u003e\n\u003cp\u003e“Father, all of you just wait here. I’ll definitely destroy the thug who cut off your arms and killed my master to get revenge. Very soon, I’ll be back very soon.” Qin Yu looks at his father. The look in his eyes is firm like a huge rock.\u003c/p\u003e\n\u003cp\u003e“Xiao Yu!”\u003c/p\u003e\n\u003cp\u003eQin De is extremely worried, as are Qin Zheng, Qin Feng and Fengyuzi.\u003c/p\u003e\n\u003cp\u003eQin Yu suddenly turns around and looks at the army.\u003c/p\u003e\n\u003cp\u003e“Attention, guardians Yan Rui, Liang Tan, Wu Yan and Xu Dong!”\u003c/p\u003e\n\u003cp\u003eQin Yu’s grim, ice-cold voice rises.\u003c/p\u003e\n\u003cp\u003e“Take the 10,000 guards to the Ming dynasty’s capital, but you can’t go forwards alone ahead of the guards. As for the location of the Ming dynasty’s capital …” Qin Yu casts an ice-cold glance at the 4 guardians, “You only need to follow my aura as you go!”\u003c/p\u003e\n\u003cp\u003eNow the 4 guardians can also feel Qin Yu’s towering killing intent. They say very respectfully: “Yes, tower master!”\u003c/p\u003e\n\u003cp\u003e“Start!”\u003c/p\u003e\n\u003cp\u003eQin Yu gives an order.\u003c/p\u003e\n\u003cp\u003eAfterwards, he alone soars into the sky like a golden beam of light and rushes towards the Ming dynasty extremely fast. His speed has reached a frightening level. However, at this moment, 2 black silhouettes which are unexpectedly not much slower than Qin Yu shoot out from inside the capital and rush towards the Ming dynasty after him.\u003c/p\u003e\n\u003cp\u003eThe 4 guardians immediately fly up, as do the 10 company leaders and 100 squad leaders. They lead the 10,000 guards heading straight for the Ming dynasty extremely fast, blotting out the sky in the process. Every Xiuyaoist is riding a flying sword.\u003c/p\u003e\n\u003cp\u003eThe sounds similar to those caused by a rain of arrows are heard again as this large army of Xiuyaoists charges towards the Ming dynasty at a very high speed through the sky!\u003c/p\u003e\n\u003cp\u003eHowever, Qin De, Qin Feng, Qin Zheng and Fengyuzi seem to have been petrified.\u003c/p\u003e\n\u003cp\u003eThey are dumbfounded.\u003c/p\u003e\n\u003cp\u003eOr to be exact, their minds are blanks. For the moment, it is simply impossible for them to regain composure.\u003c/p\u003e\n\u003cp\u003eAfter a long time, Qin De is the first to wake up. He looks at Qin Zheng, Qin Feng and Fengyuzi. He finds what just happened hard to believe and is somewhat afraid of accepting it, just like when a beggar suddenly obtains a massive fortune: “Zheng’er, Feng’er, brother Feng, just now … they, they said that …”\u003c/p\u003e\n\u003cp\u003eAs the Qin emperor, Qin Zheng can be considered tough-minded, but at the moment his head is still spinning.\u003c/p\u003e\n\u003cp\u003e“It seems, it seems Xiao Yu is … is that … tower master.” When saying these words, he still finds them somewhat unbelievable and feels as if he is dreaming.\u003c/p\u003e\n\u003cp\u003eThe same thing is happening to Qin De, Fengyuzi and Qin Feng.\u003c/p\u003e\n\u003cp\u003eThe leader of an underwater Xiuyaoist superpower comparable to the headquarters of Xiuxianists, the Penglai Immortal Region, is not someone Jindan stage Xiuzhenists like Qin De and Fengyuzi and a mortal emperor like Qin Zheng can compare with in status.\u003c/p\u003e\n\u003cp\u003eThe gap is too great.\u003c/p\u003e\n\u003cp\u003eOne is an emperor of mortals and the other is like an emperor of Xiuyaoists, but the Xiuyao emperor can annihilate the mortal world just by casually dispatching between a dozen and 20 Xiuyaoists. They are so far from each other like the sky and the ground.\u003c/p\u003e\n\u003cp\u003e“It seems Xiao Yu is that tower master.”\u003c/p\u003e\n\u003cp\u003eFengyuzi feels his heart beating at the fastest rate it ever has since he became a Xiuzhenist. The pounding of his heart resounds in his ears unceasingly like thunder.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eKilling intent!\u003c/p\u003e\n\u003cp\u003eTowering killing intent!\u003c/p\u003e\n\u003cp\u003eJust by closing his eyes, Qin Yu can recall the images of his father and Uncle Feng lacking an arm just now. At the same time, he can clearly recall strict Master Zhao Yunxing, who taught him how to train externally in the past and was the first to lead him into the path of practice.\u003c/p\u003e\n\u003cp\u003eHe cannot believe that strict, meticulous Master Zhao Yunxing is dead! He also cannot believe both his father and amiable Uncle Feng got an arm cut off.\u003c/p\u003e\n\u003cp\u003e“Chaoyang school’s junior master! Ming dynasty’s Shangxian!”\u003c/p\u003e\n\u003cp\u003eThe look in Qin Yu’s eyes is fierce and sharp like the flash of a sword that is unsheathed. It is terrifying.\u003c/p\u003e\n\u003cp\u003eThe 2 black silhouettes flying after Qin Yu are none other than Xiao Hei and Hou Fei. They immediately flew out of the capital when they heard the voices of that army from the Stellar Tower. Seeing Qin Yu’s unprecedented killing intent, they have said nothing.\u003c/p\u003e\n\u003cp\u003eAll they have been doing is go behind him.\u003c/p\u003e\n\u003cp\u003eIf Qin Yu wants to kill gods, they will kill gods with him. If Qin Yu wants to destroy devils, they will destroy devils with him.\u003c/p\u003e\n\u003cp\u003eBrotherhood means not abandoning your friends at the most crucial moments.\u003c/p\u003e\n\u003cp\u003eOne golden beam of light in the front and 2 black beams of light in the back are shooting extremely fast towards the Ming dynasty. Their towering killing intent is sent out in all directions from the sky wherever they go. Even some Xiantian experts on the ground are horrified by it.\u003c/p\u003e\n\u003cp\u003eIn just a while,\u003c/p\u003e\n\u003cp\u003eThe sounds similar to those of an endless rain of arrows terrify the guards of quite a few cities. As they look up, they only see countless indistinct blurs flash across the sky in an instant.\u003c/p\u003e\n\u003cp\u003eDuring this one night,\u003c/p\u003e\n\u003cp\u003eThe Xiantian experts, the few Xiuzhenists and the guards of those cities on the straight line connecting the Qin dynasty’s capital with the Ming dynasty’s capital are all so frightened that their hearts tremble.\u003c/p\u003e\n\u003cp\u003eThey can feel that --\u003c/p\u003e\n\u003cp\u003eSomething big is going to get real!\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAzure Dragon, Teng Shan and 2 guardians under them are wantonly enjoying fine wine in a courtyard.\u003c/p\u003e\n\u003cp\u003eAll of a sudden --\u003c/p\u003e\n\u003cp\u003e“What strong killing intent.” Azure Dragon stops the flagon in his hand and slightly shuts his eyes. In an instant, he tells Teng Shan and the other 2 laughingly: “A good play is about to start. Want to go with me to take a look?”\u003c/p\u003e\n\u003cp\u003e“How could we dare to disobey your order, Overlord?” Teng Shan says smilingly.\u003c/p\u003e\n\u003cp\u003eImmediately, there is no one left in the manor.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eThe capital of the Ming dynasty,\u003c/p\u003e\n\u003cp\u003eQin Yu is flying across it directly in the sky. He turns his head around to take a look at that living compound in the distance outside the capital. He can feel clearly that there are quite a lot of Xiuxianists in there, but he comes here this time to find the Ming dynasty’s Shangxian and that Chaoyang school’s junior master who severed his father’s arm and killed his master!\u003c/p\u003e\n\u003cp\u003eThe imperial palace!\u003c/p\u003e\n\u003cp\u003eQin Yu stands in midair above it. His holy sense covers the entire palace in an instant. Given the current range of his holy sense, he can certainly do this with ease. However, there are only 2 weak Xiuxianists in the palace.\u003c/p\u003e\n\u003cp\u003eLike a speeding arrow!\u003c/p\u003e\n\u003cp\u003eQin Yu shoots straight towards the imperial resting house then stands outside it. In the dark of the night, his flapping black robe and towering killing intent scare the guards of this house stiff. They do not even dare to make a sound.\u003c/p\u003e\n\u003cp\u003eHe reaches out his right hand --\u003c/p\u003e\n\u003cp\u003e“Ah, ah ~~”\u003c/p\u003e\n\u003cp\u003eA middle-aged man dressed in golden pajamas slowly flies out from the resting house while sounding like he is being choked at the throat by someone. That man’s face is swelling, red and full of terror. His feet are stepping about nonstop. It looks like he is being strangled.\u003c/p\u003e\n\u003cp\u003eQin Yu pulls back his right hand. The middle-aged man immediately falls on the ground.\u003c/p\u003e\n\u003cp\u003e“You, who are you?” Zhu Yan points at Qin Yu and says in a terrified manner.\u003c/p\u003e\n\u003cp\u003eNow Qin Yu basically has no time, and he is in no mood to waste time on this Zhu Yan either: “Listen up. Where are the Shangxian of your Ming dynasty? Where’s that Chaoyang school’s junior master? What’s his name? If you talk rubbish, you’ll die!”\u003c/p\u003e\n\u003cp\u003eZhu Yan’s whole body cannot help trembling.\u003c/p\u003e\n\u003cp\u003eHe has absolutely no doubt that the man in front of him can kill him. Even though he has seen so many Xiuxianists, he has never seen someone with such terrifying killing intent.\u003c/p\u003e\n\u003cp\u003e“There are only, only 2 Shangxian remaining in the imperial palace. The other 3 Shangxian have gone to that Realm of Immortals.” Cold sweat keeps oozing out on Zhu Yan’s forehead but he still says: “Realm of Immortals, Realm of Immortals is that living compound outside the city. There are several thousand Xiuxianists in there. Chaoyang school’s junior master, Chaoyang school’s junior master is also in there. He’s called Dongfang Yu, Dongfang Yu!”\u003c/p\u003e\n\u003cp\u003eTerrified, Zhu Yan finally tells Qin Yu everything.\u003c/p\u003e\n\u003cp\u003e“Very good!”\u003c/p\u003e\n\u003cp\u003eQin Yu’s body soars into the sky. He is so fast that he immediately causes a sonic boom and a shock wave. Zhu Yan and the guards around him are sent flying in an instant. The roof of the building nearest him is even flipped over.\u003c/p\u003e\n\u003cp\u003eXiao Hei and Hou Fei are standing in midair, looking at that imperial resting house.\u003c/p\u003e\n\u003cp\u003e“I’ve never seen big brother so furious.” Xiao Hei says in a low and deep voice.\u003c/p\u003e\n\u003cp\u003eHou Fei’s eyes flash with fierceness: “When someone so good-natured like big brother gets so angry, something serious must have happened. Let’s go, mixed hairy bird. I want to see who are so bold. I’ll turn them into minced meat with a blow of my stick.”\u003c/p\u003e\n\u003cp\u003eHou Fei holds his black stick in his hand. He is boiling with killing intent.\u003c/p\u003e\n\u003cp\u003eAmong the 3 brothers, he is the most violent.\u003c/p\u003e\n\u003cp\u003e“Go.”\u003c/p\u003e\n\u003cp\u003eHei Yu seems to have no killing intent at all, but Hou Fei knows that frosty Hei Yu is even more ruthless than he is when it comes to killing. Moreover, Hei Yu’s killing techniques are even stranger and crueler than his.\u003c/p\u003e\n\u003cp\u003eOutside the so-called Realm of Immortals outside the capital,\u003c/p\u003e\n\u003cp\u003eQin Yu stands in midair. His eyes flash with coldness.\u003c/p\u003e\n\u003cp\u003e“Chaoyang school, Dongfang Yu, come out to die!”\u003c/p\u003e\n\u003cp\u003eHis powerful voice resounds through the entire living compound. Even the people in the Ming dynasty’s capital can hear it clearly. All of the powerful families and high-ranking officials in the capital are terrified. Even everybody the Ming dynasty’s imperial palace is extremely frightened too.\u003c/p\u003e\n\u003cp\u003e“Who’s so arrogant?”\u003c/p\u003e\n\u003cp\u003e“You just dug your own grave!”\u003c/p\u003e\n\u003cp\u003e“Dare to mess with my Chaoyang school? Who are you?”\u003c/p\u003e\n\u003cp\u003e…\u003c/p\u003e\n\u003cp\u003eA clamor of voices is heard. Various silhouettes then fly up on their swords. In an instant, there are already several hundred silhouettes in the sky, but many other Xiuxianists keep flying out from their respective dwelling places. Obviously these Xiuxianists are enraged by the fact that the enemy has come to their front door so arrogantly.\u003c/p\u003e\n\u003cp\u003eQin Yu’s eyes flash with killing intent.\u003c/p\u003e\n\u003cp\u003eBecause he is furious, he will not mind killing all of the Xiuxianists!\u003c/p\u003e\n\u003cp\u003e“Dongfang Yu of the Chaoyang school comes out to die!” His voice rises again.\u003c/p\u003e\n\u003cp\u003eAll of those Xiuxianists rage. In their eyes, this fellow in midair before them is too arrogant. They immediately curse him, causing a clamor of voices.\u003c/p\u003e\n\u003cp\u003e“Dongfang Yu dies, or all of you … die!”\u003c/p\u003e\n\u003cp\u003eQin Yu’s last word contains his stellar energy. As soon as it is said, there seems to be an explosion. A terrifying force then blasts straight towards the Xiuxianists in front of him in the shape of a fan. It unexpectedly silences more than 1000 Xiuxianists in an instant.\u003c/p\u003e\n\u003cp\u003eThere is only killing intent in Qin Yu’s eyes. His master was killed and his father and Uncle Feng both got an arm cut off so naturally he has become crazily furious.\u003c/p\u003e\n\u003cp\u003eIf the Xiuxianists before him do not know how to behave, what will be waiting for them is … death!\u003c/p\u003e\n\u003cp\u003eEnd of b8c6.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-8-chapter-5\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-8-chapter-7\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/stellar-transformations/st-book-8-chapter-6","bookId":1510,"creation":"Sep 10, 2019 6:01:27 AM","modification":"Sep 10, 2019 6:01:27 AM"}
