{"id":57344,"no":236,"title":"Book 10 Chapter 41","content":"\u003cp\u003e\u003cstrong\u003eB10C41: The Extreme Ice Realm\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eThe extreme coldness has caused the ocean water within several li of Qin Yu to start to freeze. Various white masses of cold air are floating around him. In his mind, he knows very well how vast the Chaotic Astral Ocean is. But as it happened, the moment he reached this place, those hidden experts blocked his way with this area of ice.\u003c/p\u003e\n\u003cp\u003eClearly those experts, who are hiding in the dark, should be aiming at him.\u003c/p\u003e\n\u003cp\u003e“Inky, you fly a bit farther away. The enemies should be very strong, but even though they are formidable, I’m still confident of protecting myself. If you stay here, you will make things difficult for me.” Qin Yu immediately tells the ink qilin through holy sense communication.\u003c/p\u003e\n\u003cp\u003e“Master, only very few in the Chaotic Astral Ocean will dare to disrespect the Devil Peng Island. If you encounter any dangers, you’ll only need to take the Devil Peng Card out. I believe the opponents will no longer dare to provoke you afterwards.” The ink qilin advises with good intentions. Qin Yu gives an indifferent smile.\u003c/p\u003e\n\u003cp\u003eIf he took the Devil Peng Card out upon encountering a small problem, he would be a bit too cowardly.\u003c/p\u003e\n\u003cp\u003e“You move back to the distance first.” He orders.\u003c/p\u003e\n\u003cp\u003eThe ink qilin also knows that this place is dangerous: “Yes, master. You have to be careful too.” Right afterwards, he flies away several hundred li then watches from the distance.\u003c/p\u003e\n\u003cp\u003eBoom!\u003c/p\u003e\n\u003cp\u003eThe frozen water surface explodes and a figure appears.\u003c/p\u003e\n\u003cp\u003eThis is a large man with a robust body and a head full of wild silvery hair, which looks like the head of a lion. His white armor makes his perfect muscles stand out even more. But his eyes are staring at Qin Yu with a calm, ice-cold look.\u003c/p\u003e\n\u003cp\u003e“Oh, a Xiuzhenist who hasn’t even reached the Dacheng stage like you was unexpectedly able to run deep into the Chaotic Astral Ocean. Looks like there should be quite a lot of treasures on your body, right?” The large man with the lion-mane-like hair says smilingly.\u003c/p\u003e\n\u003cp\u003eIn the past Qin Yu killed ferobeasts near the border of the Chaotic Astral Ocean, but then he ran to the Devil Peng Island with Lian Chong. Even though he has been flying away from the island for more than a half month, he is still in the central area of the Chaotic Astral Ocean. Generally, it is impossible for someone who lacks power to reach such a deep place as this.\u003c/p\u003e\n\u003cp\u003eBecause Qin Yu was able to reach this place safely as a pre-Dacheng-stage Xiuzhenist, it is normal for this large man to conclude that he has treasures.\u003c/p\u003e\n\u003cp\u003e“Why do you ask me so?” Qin Yu asks in reply with an indifferent smile.\u003c/p\u003e\n\u003cp\u003e“Us 3 brothers like treasures, so we intend to ... rob you of them.” The large man with the lion-mane-like hair opens his mouth into a grin, revealing his snow-white teeth.\u003c/p\u003e\n\u003cp\u003e3 whizzing noises are then heard as 3 projectiles are shot at Qin Yu extremely fast from different directions. One of them is shot out from a hand of the large man in front of him. The other two should be shot out from his 2 brothers’ hands.\u003c/p\u003e\n\u003cp\u003eAfterimages;\u003c/p\u003e\n\u003cp\u003eA body stronger than the body of a Dacheng-stage divine beast and his stellar energy allow Qin Yu to have terrifying speed.\u003c/p\u003e\n\u003cp\u003eAfter making dashes and creating several afterimages, Qin Yu stands still. Now there are some blood spills on both his face and chest.\u003c/p\u003e\n\u003cp\u003e“So fast.” He narrows his eyes.\u003c/p\u003e\n\u003cp\u003eBut for his strong resilience, by now he would have already suffered serious injuries. Those 3 projectiles were much faster than ordinary flying swords and their offenses were terrifying powerful. Qin Yu suspects that ... they can be on the same level as his middle-grade immortal weapons.\u003c/p\u003e\n\u003cp\u003eMiddle-grade immortal weapons?\u003c/p\u003e\n\u003cp\u003e“How is this possible? Generally, perhaps not even 11th tribulation loose immortals have middle-grade immortal weapons. In my estimation, this man is just about at the Dacheng stage.” Qin Yu can feel the aura of the man before him. “But how could his offensive weapon be so strong? Even though my body is so tough, I basically wasn’t able to withstand its frightening penetrative force.”\u003c/p\u003e\n\u003cp\u003eStrong penetrative force,\u003c/p\u003e\n\u003cp\u003eFast speed,\u003c/p\u003e\n\u003cp\u003eAstonishing sensitivity,\u003c/p\u003e\n\u003cp\u003eThese are the main characteristics of the 3 mysterious men’s weapons.\u003c/p\u003e\n\u003cp\u003e“You really got some skill. I didn’t expect you to be able to ward off a joint attack by us 3 brothers.” That robust man bursts out laughing. “Too bad, it was merely a warm-up. Now we’ll let you know what is called -- an inescapable net!”\u003c/p\u003e\n\u003cp\u003eQin Yu’s eyes glitter.\u003c/p\u003e\n\u003cp\u003e“You haven’t gone all out, but how could I have gone all out?” He is not scared in the least.\u003c/p\u003e\n\u003cp\u003e“Ha-ha ... it’s really gutsy of you to dare to say such big words. Though us 3 brothers are only at the Dacheng stage, when we join forces, even an 8th tribulation loose practitioner will be no match for us, let alone a puny Dujie-stage Xiuzhenist like you.” That robust man says confidently.\u003c/p\u003e\n\u003cp\u003eQin Yu is struck by a thought: “You’re a divine beast?”\u003c/p\u003e\n\u003cp\u003e“Smart.” The robust man says with a nod.\u003c/p\u003e\n\u003cp\u003eEven a low-class divine beast of the Dacheng stage is comparable to an ordinary 5th tribulation loose practitioner. Because this robust man alone can match a 5th tribulation loose practitioner in power, he and his 2 brothers combined can rival a 7th tribulation loose practitioner. In addition, they have had lucky encounters ... and so a common 8th tribulation loose practitioner will be finished if running into them.\u003c/p\u003e\n\u003cp\u003eThis is also the reason why them 3 brothers have been able to roam and live in the Chaotic Astral Ocean comfortably.\u003c/p\u003e\n\u003cp\u003e“2nd brother, 3rd brother, let’s roll.” The robust man says indifferently.\u003c/p\u003e\n\u003cp\u003eThis time Qin Yu sees those weapons clearly.\u003c/p\u003e\n\u003cp\u003eThey are 3 awls that look like 3 sword blades, which are attacking while spinning nonstop. The terrifying penetrative forces of their tips are even mangling the air. No wonder not even Qin Yu’s body was able to withstand those 3 projectiles.\u003c/p\u003e\n\u003cp\u003eCurve, straight line, circle...\u003c/p\u003e\n\u003cp\u003eThe 3 projectiles are not fast at all in the beginning, but they reach frightening speeds in just a while. Even the air seems to be maneuvered. Qin Yu’s whole body momentarily turns into ten something afterimages while dodging nonstop.\u003c/p\u003e\n\u003cp\u003eEven though he is fast, he is not as fast as these 3 special projectiles.\u003c/p\u003e\n\u003cp\u003eThe robust man and his 2 brothers were only able to obtain the projectiles through good luck. They are even faster than Qin Yu’s middle-grade immortal sword. Qin Yu’s reactions are very quick but he still suffers puncture wounds at times. He can only try his best to keep his vital parts from getting hit.\u003c/p\u003e\n\u003cp\u003eAs long as the vital parts are not damaged, given his recovery ability, his wounds can heal completely in the blink of an eye.\u003c/p\u003e\n\u003cp\u003e“If not for my recovery ability, perhaps I would’ve been killed long ago. When these 3 projectiles join forces, even Dacheng-stage divine beast will probably be killed in an instant.” For the first time Qin Yu has a bit of a headache, but his body is still dodging extremely fast simultaneously.\u003c/p\u003e\n\u003cp\u003eHe has a headache.\u003c/p\u003e\n\u003cp\u003eThose 3 Dacheng-stage divine beasts have an even bigger headache.\u003c/p\u003e\n\u003cp\u003e“Big brother, even though our Sword Blade Awls are just low-grade immortal weapons, when we use them, they should be as powerful as middle-grade immortal weapons. Why haven’t we been able to injure this Dujie-stage brat now?” A voice rises in the robust large man’s mind.\u003c/p\u003e\n\u003cp\u003e“Big brother, I saw this brat get injured with my own eyes. Why is he still unharmed now?” Another voice rises.\u003c/p\u003e\n\u003cp\u003eThis robust man ponders then says through his holy sense: “In my opinion, this brat’s got a treasure on his body and it allows him to heal his injuries quickly with its powerful life force. Plus ... him being so fast should have to do with the profundity of his technique.”\u003c/p\u003e\n\u003cp\u003e“A treasure that can restore things?”\u003c/p\u003e\n\u003cp\u003eBoth the 2nd and the 3rd brothers are shocked.\u003c/p\u003e\n\u003cp\u003eThey certainly understand the implications of a treasure of this kind. If they have this treasure, their chance of getting killed will be nearly minimized. All of a sudden, the 3 brothers feel tempted by the treasure.\u003c/p\u003e\n\u003cp\u003e“Get into formation!”\u003c/p\u003e\n\u003cp\u003eThe robust man clenches his teeth and says via holy sense communication.\u003c/p\u003e\n\u003cp\u003e“The Extreme Ice Realm?” The 2nd and the 3rd brothers ask in reply almost simultaneously.\u003c/p\u003e\n\u003cp\u003e“Yes, this time we can’t think too much.” The robust man’s eyes flash with a cold light.\u003c/p\u003e\n\u003cp\u003e“Alright, if we can obtain that treasure, even spending more than half of our power will mean nothing.” The 2nd brother says in agreement.\u003c/p\u003e\n\u003cp\u003eWhen the 3 brothers execute their special skill, they will have to use a great amount of energy. But in the Chaotic Astral Ocean, very few will spend more than half of their own energy unless they are in serious danger. After all, it is exceptionally dangerous to do so.\u003c/p\u003e\n\u003cp\u003eBut because Qin Yu has a treasure with such an amazing ability for restoration on his body, the 3 brothers have become ruthless.\u003c/p\u003e\n\u003cp\u003e.....\u003c/p\u003e\n\u003cp\u003e“What’s going on?” Qin Yu’s body stops.\u003c/p\u003e\n\u003cp\u003eThis is because the 3 projectiles have flown back into the hands of 3 large men. Now the other 2 hidden large men have shown up too. These 2 men look almost the same as the first man, as they also have lion-mane-like silver hair and are clad in white armor.\u003c/p\u003e\n\u003cp\u003eThe 3 brothers start to surround Qin Yu with each of them in a different direction.\u003c/p\u003e\n\u003cp\u003e“Brat, this is going to be the 2nd time us 3 brothers have used the Extreme Ice Realm formation since reaching the Dacheng stage. Last time our target was an 8th tribulation loose practitioner and he ended up dead while we weren’t hurt in the least.” The eldest of the 3 brothers says with an indifferent smile.\u003c/p\u003e\n\u003cp\u003e“To show you our respect, we’ll let you know before you die that I’m Shi Xin, my 2nd brother is Shi Bing and my 3rd brother is Shi Zhan.” The big brother Shi Xin introduces themselves to Qin Yu. “Before you die, you should also introduce yourself to us so that we can know the name of such a genius as you.”\u003c/p\u003e\n\u003cp\u003eA genius;\u003c/p\u003e\n\u003cp\u003eIn the eyes of the 3 divine beasts, Qin Yu certainly deserves to be called a genius.\u003c/p\u003e\n\u003cp\u003eNot even a 6th tribulation loose immortal can resist the attack of the 3 Sword Blade Awls but Qin Yu has suffered no injuries at all. A pre-Dacheng-stage brat who could hold his own against their weapons naturally can be considered a genius.\u003c/p\u003e\n\u003cp\u003e“I’m Qin Yu, but I told you my name only because … I’ve decided to capture you 3 and make you holy beasts that my 2 brothers and I will mount.” Qin Yu suddenly bursts out laughing. At the moment he is wondering about the true forms of these 3 divine beasts.\u003c/p\u003e\n\u003cp\u003eThe 3 Shi brothers’ faces harden instantly.\u003c/p\u003e\n\u003cp\u003e“Holy beasts?” A faint cold smile appears on the corners of Shi Xin’s mouth. “Want to capture us and make us your holy beasts? Looks like you’re dreaming.”\u003c/p\u003e\n\u003cp\u003e“We’ll know if I’m dreaming or not after fighting each other.” Qin Yu looks as if he has a well-thought-out plan.\u003c/p\u003e\n\u003cp\u003eShi Xin’s true form is an extreme ice lion. Extreme ice lions and fiery rocky lions are of the same class but, in general, most fiery rocky lions are innately irascible and combative whereas extreme ice lions are exceptionally calm despite being combative. Seeing Qin Yu so composed, Shi Xin becomes cautious inwardly.\u003c/p\u003e\n\u003cp\u003e“You said you got 2 brothers. Where are they now?” He asks in reply.\u003c/p\u003e\n\u003cp\u003eBecause Qin Yu is so strong, his 2 brothers should not be much weaker than him. If Qin Yu and his 2 brothers join forces, even though they are 3 divine beasts, will they be able to resist them?\u003c/p\u003e\n\u003cp\u003e“Don’t worry and don’t be scared. My 2 brothers are still some distance away from here. It’ll probably take them a good while to arrive.” Qin Yu says smilingly. Xiao Hei and Fei Fei started out before he did. Perhaps there is still some time before they reunite.\u003c/p\u003e\n\u003cp\u003eShi Xin feels a bit more assured in his heart.\u003c/p\u003e\n\u003cp\u003e“Extreme Ice Realm! Set up the formation!”\u003c/p\u003e\n\u003cp\u003eHe shouts coldly and even lets Qin Yu hear his voice on purpose.\u003c/p\u003e\n\u003cp\u003eQin Yu immediately becomes careful inside and pays close attention to his surroundings. Other people set up formations in very complex ways but these 3 divine beasts set up their formation in an exceptionally strange and simple manner. The 3 Shi brothers only turn their face upwards and roar.\u003c/p\u003e\n\u003cp\u003eTheir roars resound through the sky. Meanwhile, various bluish white beams of light shoot out from inside their bodies. Those bluish white beams of light then begin to flash around nonstop. In just a while, a huge spherical area is formed and the edge of this area is full of those bluish white cold currents.\u003c/p\u003e\n\u003cp\u003eMysteriously complex talismanic seals are moving on the smooth edge, which is giving off a terrifying aura. This large formation seems to have engulfed a whole area, creating an isolated field. The temperature inside this field is frighteningly low.\u003c/p\u003e\n\u003cp\u003e“So cold.” Qin Yu’s entire body even quivers. With brightening eyes, he observes this so-called Extreme Ice Realm carefully.\u003c/p\u003e\n\u003cp\u003eShi Xin, Shi Bing and Shi Zhan are standing in the Extreme Ice Realm, their faces filled with enjoyment. Their true forms are extreme ice lions so they like the conditions in the Extreme Ice Realm the most. This kind of environment coupled with the Mystic Eyeballs inside their bodies can allow them to have an offense twice as good as normal.\u003c/p\u003e\n\u003cp\u003e“The 3 of you definitely can’t set up this formation by yourselves.” Qin Yu says firmly while looking at the 3 Shi brothers before him.\u003c/p\u003e\n\u003cp\u003eThe formidability of this Extreme Ice Realm can be noticed with just a simple observation. Such a cold environment, such profound talismanic seals and such an extremely terrifying aura … Qin Yu simply does not believe that Dacheng-stage divine beasts can set it up.\u003c/p\u003e\n\u003cp\u003e“You’re smart.” Shi Xin says with a smile. “This formation comes with the Mystic Eyeballs. In the past, us 3 brothers discovered a precious place in the Chaotic Astral Ocean and obtained the Sword Blade Awls and the Mystic Eyeballs. After swallowing the Mystic Eyeballs, we can form the Extreme Ice Realm formation just by slightly activating them.”\u003c/p\u003e\n\u003cp\u003eThe 3 Shi brothers only need to spend their energy to activate this formation because the formation is maintained with the energy of the Mystic Eyeballs.\u003c/p\u003e\n\u003cp\u003eEven so, Shi Xin and his brothers still have to use quite a lot of energy for the activation.\u003c/p\u003e\n\u003cp\u003e“I forgot to tell you that the Mystic Eyeballs not only can set up the Extreme Ice Realm, they also give us the Extreme Ice Armor. Given your power, you definitely can’t break our defense. In addition, our offense is greatly improved in this environment while your power is reduced. You … will die for sure.”\u003c/p\u003e\n\u003cp\u003eShi Xin says confidently.\u003c/p\u003e\n\u003cp\u003eAt the same time, he makes a swaying movement with his body, turning into a huge lion that is 5 to 6 m long and 2 to 3 m tall. This lion has a single horn and is covered in snow-white hair from head to toe. This is none other than a divine beast -- extreme ice lion. A bluish white light then shines on the stomach of the extreme ice lion. In an instant, the bluish white light forms a hard silvery suit of armor on the surface of the lion’s body.\u003c/p\u003e\n\u003cp\u003eBeing completely white, the extreme ice lion looks so majestic.\u003c/p\u003e\n\u003cp\u003e“The Mystic Eyeballs? One of them seems to be the treasure that sent out the bluish white light from the stomach of this divine beast. Is the white armor formed by this Mystic Eyeball … really very strong?” Qin Yu simply does not believe that he cannot break the opponent’s defense.\u003c/p\u003e\n\u003cp\u003eAt the same time, 2 other extreme ice lions have also appeared in the other 2 directions.\u003c/p\u003e\n\u003cp\u003eEnd of b10c41.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-10-chapter-40\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-10-chapter-42\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/stellar-transformations/st-book-10-chapter-41","bookId":1510,"creation":"Sep 10, 2019 6:01:28 AM","modification":"Sep 10, 2019 6:01:28 AM"}
