{"id":57362,"no":254,"title":"Book 11 Chapter 11","content":"\u003cp\u003e\u003cstrong\u003eB11C11 Join Hands!\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eWith his dexterous body, Qin Yu weaves in between the corridors of a Pavilion, with continuous attacks coming down near him at the same time, suddenly the Pavilion crumbles, destroying the corridors, disturbing the space. Reverend Ming Shan achieved his goal, under such conditions Qin Yu would not be able to run away.\u003c/p\u003e\n\u003cp\u003e“Brother Ming Shan, we cannot go on like this. We have already destroyed three schools, I think heavenly flames fiend is doing this intentionally, if this goes on … many schools will become hostile to our Qingxu Temple.” A 10th tribulation loose immortal said worryingly.\u003c/p\u003e\n\u003cp\u003eHow can Reverend Ming Shan want to destroy other schools?\u003c/p\u003e\n\u003cp\u003eBut that tricky heavenly flames fiend is perhaps too scary.\u003c/p\u003e\n\u003cp\u003eWhen you get near, your body gets crushed by the weight of a mountain and when your body gets a little used to the weight, the weight suddenly disappears. However, it comes back in the blink of an eye … even if you’re the most powerful master, there’s no way to keep up the accuracy of your movements with the weight suddenly appearing and disappearing.\u003c/p\u003e\n\u003cp\u003eWant to go near and catch the Heavenly Flames Fiend?\u003c/p\u003e\n\u003cp\u003eIt’s not possible!\u003c/p\u003e\n\u003cp\u003eAttack from afar? That is one method, but the heavenly flame fiend has already taken many of their attacks, but it seem like there’s no effect. Reverend Ming Shan never would have imagined that Qin Yu possess a body with a recovery rate at the point of terror.\u003c/p\u003e\n\u003cp\u003e“Hey, are you five tired? But to tell the truth, you call me Heavenly Flames Fiend, I feel this name … is a bit unpleasant. The titles you guys give are too old fashion. ”Qin Yu called from afar.\u003c/p\u003e\n\u003cp\u003e“How dare you!”\u003c/p\u003e\n\u003cp\u003eReverend Ming Shan and the 4 loose immortals are furious, being chased by the 5 of them and he still had the leisure to joke, how could they not be angry?\u003c/p\u003e\n\u003cp\u003e“Haha. Catch me if you can, Haha … ” Qin Yu’s laughter resounds throughout the mountains. Qin Yu’s body becomes a black light as he flies across the sky, followed by 5 red lights, 1 in front, 4 behind.\u003c/p\u003e\n\u003cp\u003eReverend Ming Shan and the other are faster than Qin Yu, but not a single one of them went near Qin Yu to attack.\u003c/p\u003e\n\u003cp\u003eGoing near this unusual heavenly flames fiend, do you think your life’s too long? (TL: meaning one will be hurrying to their death going near QinYu)\u003c/p\u003e\n\u003cp\u003e“Oh, there is a school 5,000 Li away South-East, this will be the fourth school. You five keep pursuing me. Our goal is to destroy 100 schools this time. You guys already took down three, still a long way off.”\u003c/p\u003e\n\u003cp\u003eIn a graceful curve, Qin Yu flies toward the school.\u003c/p\u003e\n\u003cp\u003e“Senior (师兄), that school belongs to a buddy I met in the Chaotic Astral Ocean “Reverend LianXu”. Reverend LianXu is an eccentric person. He also did not participate in the gathering this time, if we destroy his school, things may get a bit worse.” Loose immortal MeiJi said worryingly.\u003c/p\u003e\n\u003cp\u003eReverence Ming Shan furrowed his brows, but he was already chasing after.\u003c/p\u003e\n\u003cp\u003e“Reverend LianXu is a 10th tribulation loose immortal, I heard he got a treasure from the Chaotic Astral Ocean. Is it true?” Reverend Ming Shan asked.\u003c/p\u003e\n\u003cp\u003eLoose immortal MeiJi replies: “It’s true, Reverend LianXu may be a 10th tribulation loose immortal, but he has a peculiar weapon(法宝). It was discovered from a shipwreck in the Chaotic Astral Ocean, his strength is not below yours.”\u003c/p\u003e\n\u003cp\u003eReverend Ming Shan became a little frustrated\u003c/p\u003e\n\u003cp\u003e“Let’s let Reverend Ming Liang decide.” Ming Shan immediately contacts Reverend Ming Liang.\u003c/p\u003e\n\u003cp\u003eDestroying half of any normal school, Reverend Ming Shan doesn’t care, but this school has the backing of a powerful Reverend LianXu. If offended, Qingxu Temple won’t be scared, but it would still be very problematic.\u003c/p\u003e\n\u003cp\u003eAt the battlefield with loose immortals on one side and loose devils on the other, both sides are taking a break currently, only masters like Reverend Ming Liang and Wukongxue are at the mountain top.\u003c/p\u003e\n\u003cp\u003eReverend Ming Liang turned his hand over and took out the transmitter (发射机).\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003eHe saw the series of messages Reverend Ming Shan sent, Reverend Ming Liang was shocked then grew angry, it was the first time for Reverend Ming Liang to have so much killing intent. Reverend Ming Shan sent him 4 messages in total!\u003c/p\u003e\n\u003cp\u003eQingxu Mountain was burned; it became a piece of scorched earth. Not a single grass left.\u003c/p\u003e\n\u003cp\u003eThe mountain below the holy land “Heavenly Palace” has been all burned, Heavenly Palace has sunken into a mountain crevice.\u003c/p\u003e\n\u003cp\u003e99% of Qingxu Temple’s disciples are dead, even if you add the regular disciple who luckily escaped into the Ten Development Illusionary Formation, there are only about 200.\u003c/p\u003e\n\u003cp\u003eNow Reverend Ming Shan is forced to destroy schools one after another.\u003c/p\u003e\n\u003cp\u003eDestroying other schools, that creates a very big enmity. But if Reverend Ming Shan didn’t disrupt the space, what would we do if the heavenly flames fiend escapes?\u003c/p\u003e\n\u003cp\u003eCan we let him escape?\u003c/p\u003e\n\u003cp\u003e“Junior (师弟), nothing else matters, just don’t let heavenly flames fiend get away! I’m aware of this Reverend LianXu, if his school gets a bit destroyed then it can’t be helped. Worst case scenario, I’ll personally go and have a small chat with him.” Reverend Ming Liang said.\u003c/p\u003e\n\u003cp\u003e“Remember; don’t let him get away no matter what, if he doesn’t die, when I reach the Immortal World, I won’t be able to look my Qingxu Temple’s seniors in the face.”\u003c/p\u003e\n\u003cp\u003eLooking at the whole Mortal World.\u003c/p\u003e\n\u003cp\u003eWithin the loose immortals, there is nobody that Reverend Ming Liang fears. This strange tempered Reverend LianXu may have some power, but in face of Reverend Ming Liang, he shouldn’t be much trouble.\u003c/p\u003e\n\u003cp\u003eAfter he sent an order to his juniors, Reverend Ming Liang starts to grow anxious.\u003c/p\u003e\n\u003cp\u003eHis juniors chased the culprit for so long and still have not caught him, if this goes on, they will be forced to destroy schools one after another. Destroy a few schools; Reverend Ming Liang is not afraid. Destroy dozens, he can still handle.\u003c/p\u003e\n\u003cp\u003eBut destroy hundreds? Even if he’s more powerful, he would be completely surrounded.\u003c/p\u003e\n\u003cp\u003eIt’s too difficult to fight that number!\u003c/p\u003e\n\u003cp\u003e“Ming Liang, what happened, you don’t look too good, have you caught the Heavenly Flame Fiend?” Wukongxue questioned at Reverend Ming Liang’s darkening face.\u003c/p\u003e\n\u003cp\u003eReverend Ming Liang didn’t say anything but glanced at Wukongxue.\u003c/p\u003e\n\u003cp\u003eSuddenly…\u003c/p\u003e\n\u003cp\u003eReverend Ming Liang’s mind clicked: “This Wukongxue doesn’t care about the life or death of the TengLong Continent, he might not care but Dame LianYue does, not to mention that Heavenly flame Fiend ruined Dame LianYue’s school. Their enmity is also great.\u003c/p\u003e\n\u003cp\u003eReverend Ming Liang didn’t say anything, just send a message to Dame LianYue using holy sense.\u003c/p\u003e\n\u003cp\u003e“LianYue, I know your Yinyue Palace was destroyed by Heavenly Flames Fiend, my Qingxu Temple was also burned clean by him.” Reverend Ming Liang came out with his own tragedy. He admitted for their common enemy.\u003c/p\u003e\n\u003cp\u003eDame LianYue glanced at Reverend Ming Liang and reply via devil sense (魔识): “Oh, why are you bringing this up?”\u003c/p\u003e\n\u003cp\u003eReverend Ming Liang felt a bit of hope.\u003c/p\u003e\n\u003cp\u003e“LianYue, this Heavenly Flames Fiend has some strange powers, not even Wukongxue was able to catch him that day, which shows how capable his ability to escape is. Currently my juniors are currently chasing after him, although they have not caught him, they are following behind him. I think… if both our sides join together, we’ll catch him for sure.” Reverend Ming Liang proposed.\u003c/p\u003e\n\u003cp\u003eDame LianYue thought for a moment.\u003c/p\u003e\n\u003cp\u003e“You’re suggesting for our two sides to cooperate? We both have killed so many, can we still cooperate?” Dame LianYue has a bit of doubt.\u003c/p\u003e\n\u003cp\u003eReverend Ming Liang continued: “I know for our two sides to cooperate is unrealistic. But I’ll say it now; we’re only cooperating on the issue of “catching Heavenly Flames Fiend”. After he is caught, then we’ll decide if we still want to fight. How about it?”\u003c/p\u003e\n\u003cp\u003eDame LianYue starts to think.\u003c/p\u003e\n\u003cp\u003e“That Wukongxue isn’t from your Yinyue Palace; he doesn’t care about your vengeance. But you’re the number 1 of Yinyue Palace. Yinyue Palace has been destroyed and lots of disciples have been killed. If you don’t kill Heavenly Flames Fiend for revenge, how would you face your school’s seniors when you reach the Devil World.\u003c/p\u003e\n\u003cp\u003eDame LianYue’s heart flutters.\u003c/p\u003e\n\u003cp\u003eHeavenly Flames Fiend, how could she not hate him to the core.\u003c/p\u003e\n\u003cp\u003e“Last time, he burned Yinyue Palace, this time he burned Qingxu temple. Both Devil and Immortal Faction’s number 1 schools are burnt; I think he must be satisfied. If he gets away this time, he might not show up again, missed this and there may never be a chance for revenge again.” Reverend Ming Liang’s last phrase shook Dame LianYue awake.\u003c/p\u003e\n\u003cp\u003eRight.\u003c/p\u003e\n\u003cp\u003eThe 2 big schools of Immortal and Devil Faction have been burned; this mysterious ‘Heavenly Flames Fiend’ could be satisfied and go into hiding. When he escapes, how would she face her Yinyue school’s seniors?\u003c/p\u003e\n\u003cp\u003e“Okay, I agree.” Dame LianYue said via devil sense, “but we’re only cooperating on catching Heavenly Flames Fiend.”\u003c/p\u003e\n\u003cp\u003e“That’s only natural.”\u003c/p\u003e\n\u003cp\u003eReverend Ming Liang smirked; finally… he opens his mouth to talk.\u003c/p\u003e\n\u003cp\u003eJust then he was using holy sense to communicate secretly, now he can discuss this openly.\u003c/p\u003e\n\u003cp\u003e“Wukongxue. Isn’t that Heavenly Flames Fiend’s ability to escape is quite formidable?” Reverend Ming Liang asks jokingly.\u003c/p\u003e\n\u003cp\u003eWukongxue remembers all of that time and nods, “that Heavenly Flames Fiend took one of my attacks and abruptly disappeared, not even my devil sense was able to find him. Not to mention the space was disturbed at the time, I still have no idea how he was able to escape.” Reverend Ming Liang comments: “Now that Heavenly Flames Fiend burned my Qingxu Temple, he is being hunted by my junior Ming Shan. My junior has not caught him yet, but is following closely behind, I think… our two sides should cooperate and catch him first.”\u003c/p\u003e\n\u003cp\u003eThe corner of Wukongxue‘s mouth raise into a little ironic smile and was about to say something when Dame LianYue interrupted.\u003c/p\u003e\n\u003cp\u003e“Okay.” Dame LianYue’s eyes flashed with hatred, said in an angry tone “that Heavenly Flames Fiend destroyed my Yinyue Palace and killed 99% of the disciples. I, LianYue, and him are absolutely irreconcilable, unless I catch this Heavenly Flames Fiend, I would not be able to face my school’s seniors.”\u003c/p\u003e\n\u003cp\u003eDame LianYue added: “Ming Liang, you listen here, I am only agreeing to cooperate in the issue of catching Heavenly Flames Fiend.”\u003c/p\u003e\n\u003cp\u003e“Of course, of course.” Reverend Ming Liang smiles and nods.\u003c/p\u003e\n\u003cp\u003e“Wukongxue Daren (大人), this Heavenly Flames Fiend and my Yinyue Palace have an enmity, I have agreed to cooperate with Ming Liang, Wukongxue Daren won’t mind right?”\u003c/p\u003e\n\u003cp\u003eAlthough Wukongxue is a little angry, Dame LianYue’s position within the devil contingent is not below his.\u003c/p\u003e\n\u003cp\u003eEven though Wukongxue’s strength is powerful, he is one person by himself. While Dame LianYue is the leader of Yinyue Palace and the Devil Emperor also personally ordered Dame LianYue to manage any problems related to the Heaven-Sundering Diagrams, so of course her position is high.\u003c/p\u003e\n\u003cp\u003eAnd Wukongxue want to kill that Heavenly Flames Fiend too.\u003c/p\u003e\n\u003cp\u003e“Of course I don’t mind, Reverend Ming Liang, if the two of us join hands, pretty sure that Heavenly Flames Fiend is as good as dead.” Wukongxue smiles at Reverend Ming Liang, “Oh, it seems like… this may be the first time the two of us join hands.”\u003c/p\u003e\n\u003cp\u003eReverend Ming Liang nods: “Indeed it’s the first time.”\u003c/p\u003e\n\u003cp\u003eNow that the top ranks of both sides reached an agreement, they issued a ceasefire for the moment. At the same time, led by the two great masters Reverend Ming Liang and Wukongxue, Dame LianYue, Fire Devil, Reverend LanBing, XueYuYang and supplemented by a camp of masters moved out together.\u003c/p\u003e\n\u003cp\u003eBoth side’s camp sent out their strongest masters, they are putting all they got on one hit.\u003c/p\u003e\n\u003cp\u003e…..\u003c/p\u003e\n\u003cp\u003eIn a snow covered plain, there is one black light followed five white lights one by one.\u003c/p\u003e\n\u003cp\u003eNow Qin Yu has already flown millions of Li, destroyed more than 30 schools, within the 30 schools, there was the school of one of the five loose immortals that’s after Qin Yu.\u003c/p\u003e\n\u003cp\u003eReverend Ming Shan has agreed to offer many kinds of treasure as an apology to that loose immortal.\u003c/p\u003e\n\u003cp\u003e“Heavenly Flames Fiend, stop running away!” Not only is it Reverend Ming Shan, but the 4 other loose immortals are getting furious.\u003c/p\u003e\n\u003cp\u003eChasing all this way, the 4 loose immortals destroyed quite a few schools, even accidentally killing a few Xiuxianists. Even all the schools Qin Yu chose were Xiuxianists schools; they have noticed he was doing it intentionally.\u003c/p\u003e\n\u003cp\u003e“HaHa. Catch me if you can, what use is yelling?” Qin Yu’s laughter sounded, however he stopped laughing halfway through.\u003c/p\u003e\n\u003cp\u003e“Laugh again, Heavenly Flames Fiend, laugh again.”\u003c/p\u003e\n\u003cp\u003eA familiar evil voice sounded.\u003c/p\u003e\n\u003cp\u003eA large blood cloud floats in the sky, bloody gases disperse about, the blood cloud rapidly collapsed together and formed a blood red robe, devil faction’s number 1 master Wukongxue stands midair, smiling coldly at Qin Yu. He looks at him like a lamb waiting for slaughter.\u003c/p\u003e\n\u003cp\u003e“So you’re the Heavenly Flames Fiend.” another voice coldly sounded.\u003c/p\u003e\n\u003cp\u003eWith a moonlight white robe, a pair of deep peaceful eyes, the imposing manner around him is concentrated to the peak; he and Wukongxue are both extremes of the opposite ends. One is wild, one is calm; one carries a violent and arrogant air, one carries calm and collected air.\u003c/p\u003e\n\u003cp\u003eThis is Immortal Faction’s number 1, Reverend Ming Liang, he looked at Qin Yu with a never before seen killing intent.\u003c/p\u003e\n\u003cp\u003eAlmost at the same time, shadows appear one after another.\u003c/p\u003e\n\u003cp\u003eThe seductive noble Dame LianYue, the savage mannered WuHei, and Fire Devil with his blaze-like passion. The elegant Reverend LanBing, the cool looking XueYuYang, and Reverend ChiYang steaming with killing intent,\u003c/p\u003e\n\u003cp\u003eLoose immortals and loose devils on both sides have gathered at the same place, in this place filled with ice and snow, everyone’s attention are all focused on one person. The mysterious person that dared to burn Devil and Immortal faction’s number 1 school… Heavenly Flames Fiend.\u003c/p\u003e\n\u003cp\u003e[These chapters were originally translated by jchen at stcon, and he retains all rights to these chapters. We have tried to but been unable to contact him. For ease of reading and to help centralize the community, his . jchen, if you see this and come back and have any objections, please let us know and we will take it down and/or work with you on how you want to handle it!]\u003c/p\u003e\n\u003cp\u003eEnd of B11C11\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-11-chapter-10\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-11-chapter-12\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/stellar-transformations/st-book-11-chapter-11","bookId":1510,"creation":"Sep 10, 2019 6:01:28 AM","modification":"Sep 10, 2019 6:01:28 AM"}
