{"id":57376,"no":268,"title":"Book 11 Chapter 25: Man Qian (translated by James of","content":"\u003cp\u003eStellar Transformations Book 11 Chapter 25: Man Qian (translated by James of \u003ca href\u003d\"http://www.pegasusfarts.com\"\u003epegasusfarts.com\u003c/a\u003e)\u003c/p\u003e\n\u003cp\u003eThe three brothers, Qin Yu, Hou Fei and Hei Yu, flew across the ocean wearing black robes. Behind them are the four divine beasts, Ink Qilin, Shi Xin, Shi Bing and Shi Zhan, in human form.\u003c/p\u003e\n\u003cp\u003eAhead, the Qian Long continent is already in sight.\u003c/p\u003e\n\u003cp\u003eIn a moment, Qin Yu and his company will be arriving in the mainland of Qian Long continent. (TL: It says three brothers but I felt that company would be better)\u003c/p\u003e\n\u003cp\u003eSince the auctioning of the Heaven-Sundering Diagram was taken care of, Qin Yu decided to return to Qian Long continent to visit his relatives before his 9-in-9 heavenly tribulation. As his 9-in-9 heavenly tribulation date closes in, even Qin Yu began to feel the pressure.\u003c/p\u003e\n\u003cp\u003eA smile appeared on Qin Yu’s face as the wind blew by.\u003c/p\u003e\n\u003cp\u003eAhead is the capital of the Qin dynasty.\u003c/p\u003e\n\u003cp\u003eSince the previous capital had been destroyed, the capital of the Qin dynasty was moved directly east to its biggest city, Flame City. In regards to prosperity, Flame City was comparable to the previous capital and it was also renamed the capital of Qin.\u003c/p\u003e\n\u003cp\u003eQin Yu, Hou Fei, Hei Yu and the four human form divine beasts arrived at the capital. (TL: I am so tempted to just write Qin Yu and co.)\u003c/p\u003e\n\u003cp\u003eWalking on the streets of the capital were people of all occupations and status. There were beautiful women, sons of wealthy families, sophisticated men, peddlers and lovely kids. Qin Yu enjoys this peaceful and serene scene. He enjoys this feeling.” (TL: This just sounds like bad English to me.)\u003c/p\u003e\n\u003cp\u003e(TL: This paragraph took me forever since it was so hard to try to keep the original feeling of describing people Qin Yu sees or changing it to just summarizing that there are tons of different people he saw and he was happy about that)\u003c/p\u003e\n\u003cp\u003eSeeing Qin Yu, Hou Fei and Hei Yu in black robes paired with the aura they gave off was causing people around to feel that the trio must be high status. Even the four divine beast servants were giving off auras. One can only imagine the how high the owner’s status must be.\u003c/p\u003e\n\u003cp\u003e“Big bro, there’s still about 2 months till your 9-in-9 heavenly tribulation. Where exactly would you be taking it?” Hou Fei inquires via holy sense after scanning the surrounding scenery.\u003c/p\u003e\n\u003cp\u003eQin Yu thought for a moment and replies via holy sense “Worry not, when the time comes finding a random island south of Qianlong continent would do the job.”\u003c/p\u003e\n\u003cp\u003eQin Yu didn’t really care about where he’ll be taking the tribulation.\u003c/p\u003e\n\u003cp\u003eCurrently free of worry, Qin Yu gave thought of walking the streets checking out the lives of regular people.\u003c/p\u003e\n\u003cp\u003e“Big bro, are we going to the palace now?” Hei Yu inquires softly.\u003c/p\u003e\n\u003cp\u003eQin Yu shakes his head while smiling. “No need to rush, news of my return have only been passed to the Stellar Tower. Father and big brother are only getting ready to leave Stellar Tower. I suspect they are still not used to being in Stellar Tower. Fortunately, it should be fine for them to leave now seeing as the Immortal Emissary arrived at the Mortal Realm; I highly doubt anyone would dare come to Qian Long continent to cause trouble.” Says Qin Yu via holy sense.\u003c/p\u003e\n\u003cp\u003eThere was one thing Qin Yu did not mention.\u003c/p\u003e\n\u003cp\u003eWho, without anything to do, would come to Qianlong continent for his relatives and cause trouble? Not to mention Qin Yu himself is here. With his Qing Yu Immortal Mansion, Qin Yu can guarantee that no one can hurt his loved ones. Whoever dares come Qin Yu would most certainly not be merciful.\u003c/p\u003e\n\u003cp\u003e“Let’s stop talking about other things. My father and brothers have yet to return. There’s a restaurant in front of us. Let’s go have a drink and then talk. While the wines of Qing Yu Immortal Mansion are great, they are still incomparable to the Mortal wines.”\u003c/p\u003e\n\u003cp\u003eThroughout, the three brothers have been conversing via holy sense since some things aren’t suitable for Mortals to hear.\u003c/p\u003e\n\u003cp\u003eThe three began to head toward the restaurant. Immediately following, the four divine beasts also entered the restaurant.\u003c/p\u003e\n\u003cp\u003e“Brother Yang, who is the wine-god that you spoke of?”\u003c/p\u003e\n\u003cp\u003e“It’s that dark burly man sitting on the southeast corner table. He have been drinking for three hours since this morning. During this time, he drank 10 whole jars of fire knife wine with tens of dishes of beef.”\u003c/p\u003e\n\u003cp\u003e“What a burly man, he must be more than two heads taller than me. What did you just say? By 10 big jars, you mean those big jars? Is his stomach a bottomless pit?”\u003c/p\u003e\n\u003cp\u003e\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u003c/p\u003e\n\u003cp\u003eUpon entering the restaurant, Qin Yu have heard a funny thing.\u003c/p\u003e\n\u003cp\u003eIt seems that there is a man who can really drink in this restaurant. In addition to that, he has drank 10 big jars of fire knife wine, a sort of wine that causes regular burly men to faint after 3 bowls. But this dark, burly man actually drank ten big jars!\u003c/p\u003e\n\u003cp\u003eNot regular jars, but big jars that restaurants use to keep wine in. One such jar is 20 jin and ten such jars is 200 jin. For common folks, this most certainly is horrifying.\u003c/p\u003e\n\u003cp\u003eQin Yu and his brothers randomly picked a table and sat down. The four divine beasts also picked a table and sat.\u003c/p\u003e\n\u003cp\u003e10 jars of fire knife wine?\u003c/p\u003e\n\u003cp\u003eFor people like Qin Yu, not to mention 10 jars, even 100 jars is nothing.\u003c/p\u003e\n\u003cp\u003e“Manager, bring us three brothers 10 big jars of fire knife wine.” Hou Fei said while laughing loudly.\u003c/p\u003e\n\u003cp\u003eAll the people on the first floor of the restaurant all looked over at Hou Fei and his brothers.\u003c/p\u003e\n\u003cp\u003eAt this moment, a smiling, middle-aged fat man came by and said: “Customers, I suspect that this is the first time you three will drink fire knife wine. Not to mention a big jar, even a small jar could knock a man out.”\u003c/p\u003e\n\u003cp\u003e“Skip the bullshit. Are you afraid that we don’t have the money? When I said bring it, you bring it.” A gold ingot appears on Hou Fei’s hand.\u003c/p\u003e\n\u003cp\u003eA gold ingot worth 10 liang. (TL: liang \u003d currency)\u003c/p\u003e\n\u003cp\u003eWhile fire knife wine is very strong, it is not a high end wine. ‘White Jade Springs’ and ‘Bamboo Fragrance’ and other wines are much more expensive. For just 10 big jars of fire knife wine, 10 liang is enough.\u003c/p\u003e\n\u003cp\u003e10 liang worth of gold is enough to buy all the fire knife wine in the whole restaurant.\u003c/p\u003e\n\u003cp\u003eThe fat manager’s eyes shined and said while happily laughing: “Customers must be rich; the money is of course enough.”\u003c/p\u003e\n\u003cp\u003e“The money is enough, yet you are still not bringing the wine?!” Hou Fei is now impatient.\u003c/p\u003e\n\u003cp\u003e“Right, right. Waiter go get the wine.” The fat manager said with his face fat trembling. He thinks “Drink, drink till you pass out. Acting high and mighty. Do you think 10 big jars of fire knife wine is something that people can just drink?”\u003c/p\u003e\n\u003cp\u003eUpon thinking of this, the fat manager sneaked a glanced at the dark, burly man.\u003c/p\u003e\n\u003cp\u003eThis dark, burly man has started drinking the 11th big jar of wine. Drinking for so long, this guy has yet to even leave the table.\u003c/p\u003e\n\u003cp\u003e“Is this even human?” The fat manager ponders in his heart but his face is full of smile as he returns to the counter.\u003c/p\u003e\n\u003cp\u003e“Manager, bring us four brothers 10 big jars of fire knife wine too.” Shi Zhan shouted.\u003c/p\u003e\n\u003cp\u003eCurrently, the four divine beasts also want to indulge on some wine.\u003c/p\u003e\n\u003cp\u003eBut this one shout have stunned the whole restaurant.\u003c/p\u003e\n\u003cp\u003eAll the guests focused their eyes towards Shi Zhan’s table.\u003c/p\u003e\n\u003cp\u003e“What the heck is with it today? So many people coming asking for 10 big jars of fire knife wine right away. What, can they really drink that?!”\u003c/p\u003e\n\u003cp\u003e“That black burly man have real skills. As for the two groups that came afterward, they must be impulsive.”\u003c/p\u003e\n\u003cp\u003e\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u003c/p\u003e\n\u003cp\u003eThe whole restaurant started getting rowdy.\u003c/p\u003e\n\u003cp\u003eThe fat manager ran over unsteadily: “Dear customers, we must apologize we did not expect that so many people would want fire knife wine today. We have only 9 big jars of fire knife wine left in stock. “\u003c/p\u003e\n\u003cp\u003eEven the fat manager can’t do anything about that.\u003c/p\u003e\n\u003cp\u003eUsually, being able to sell 10 big jars of wine in a day was already good. But today, these three tables each wanted 10 big jars of wine.\u003c/p\u003e\n\u003cp\u003e“No more?” Shi Zhan is startled.\u003c/p\u003e\n\u003cp\u003e“Only nine big jars are left. Dear customers, please enjoy the nine jars first. I will have the waiter go get 10 more big jars worth. I believe nine jars would give him enough time to purchase more wine.” The manager is also rather pitiful.\u003c/p\u003e\n\u003cp\u003eShi Zhan looked at his brothers and gave a nod.\u003c/p\u003e\n\u003cp\u003eHou Fei just laughed without saying anything.\u003c/p\u003e\n\u003cp\u003e“Fei Fei, Xiao Hei, drink.” Qin Yu raised his bowl.\u003c/p\u003e\n\u003cp\u003eThe three brothers toasted and easily drank their wine in one gulp.\u003c/p\u003e\n\u003cp\u003eAs the bowl of fire knife wine entered the body, the three felt very comfortable.\u003c/p\u003e\n\u003cp\u003e\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u003c/p\u003e\n\u003cp\u003eCurrently, the first floor of the restaurant is fully packed. Most of the tables are filled with people who paid attention to the tables of Qin Yu, Shi Xin, and the dark, burly dude. (TL: raw mentioned that the people are eating slowly while paying attention to the 3 tables)\u003c/p\u003e\n\u003cp\u003eThey really wanted to know if there really are so many strong drinkers.\u003c/p\u003e\n\u003cp\u003eAs time went by…\u003c/p\u003e\n\u003cp\u003eAll the people in the restaurant are surprised.\u003c/p\u003e\n\u003cp\u003e“Those three brothers are too awesome. They are just sitting there drinking, chatting, and laughing. They’re drinking those wine like water. Not long, eight jars of wine was already gone and the three seemed completely fine.”\u003c/p\u003e\n\u003cp\u003e“Those four are also very awesome. Nine big jars of wine; almost all gone.”\u003c/p\u003e\n\u003cp\u003e\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u003c/p\u003e\n\u003cp\u003eAll the people in the restaurant are gossiping. They know that it is rude to gossip loudly so they are doing it softly. Everyone was gossiping because they all know that having so many drinking experts appear at once is amazing.\u003c/p\u003e\n\u003cp\u003eEven if they aren’t drunk, how could their stomachs handle it?\u003c/p\u003e\n\u003cp\u003eEven sweats appeared on the forehead of the manager.\u003c/p\u003e\n\u003cp\u003eThose four people have almost finished with their 9 jars of wine but the waiter still hasn’t come back yet.\u003c/p\u003e\n\u003cp\u003e“Manager, where’s the wine? Didn’t you said that when we finish, the waiter would be back with more wine?” Shi Zhan asks with a frown.\u003c/p\u003e\n\u003cp\u003eThe fat manager busily replied: “Please wait a while, the waiter will be back right away.”\u003c/p\u003e\n\u003cp\u003eThis fat manager has encountered various people and just by the aura of these people, he knew that he could not afford to displease them. Not to mention their drinking ability. None of them are ordinary. He dared not displease any of them.\u003c/p\u003e\n\u003cp\u003eA while later….\u003c/p\u003e\n\u003cp\u003e“Manager, give me 10 more big jars. This wine is pretty good.” Hou Fei shouted.\u003c/p\u003e\n\u003cp\u003e“Customer, please wait a moment.” The fat manager greeted smilingly but in his heart: “Curses, this damn waiter still hasn’t come back after such a long time. If I anger these people, they might even destroy my restaurant.”\u003c/p\u003e\n\u003cp\u003eHis guess was very accurate. Any of these eight people that are drinking could totally destroy his restaurant with the wave of a hand.\u003c/p\u003e\n\u003cp\u003eSuddenly…\u003c/p\u003e\n\u003cp\u003eThe fat manager’s eyes shined and heart relieved as he noticed the figure of the waiter in the distance: “Customers, the waiter has returned. The wine will be arriving immediately.” The fat manager immediately orders the servants within the restaurant to get the wine.\u003c/p\u003e\n\u003cp\u003eThe drinking session from noon till night and then from night till the next morning.\u003c/p\u003e\n\u003cp\u003eQin Yu and his brothers at a table, the four divine beasts at a table, and the dark, burly man at a table.\u003c/p\u003e\n\u003cp\u003eThese three tables continued drinking. Even at night, the manager could only close the door of the restaurant and allow the three tables to continue their drinking session.\u003c/p\u003e\n\u003cp\u003eQin Yu and his brothers and the four divine beasts could chat with each another. But the dark, burly man was alone. From the beginning till the end, he didn’t speak a word.\u003c/p\u003e\n\u003cp\u003eMorning, the sun\u0027s rays shone through the door of the restaurant.\u003c/p\u003e\n\u003cp\u003e“Great, who would’ve expected that one could drink such good wine in the Mortal Realm.” That dark burly dude stood up, fully satiated.\u003c/p\u003e\n\u003cp\u003eThere was already many customers in the restaurant, most of them knowing how much wine this dark burly dude drank.\u003c/p\u003e\n\u003cp\u003eA whole 40 big jars worth!\u003c/p\u003e\n\u003cp\u003eAs for the other two tables, one drank 60 jars and the other drank 70 jars.\u003c/p\u003e\n\u003cp\u003eWhat terrifying people!\u003c/p\u003e\n\u003cp\u003e“Sure enough, he wasn’t a Mortal.” Qin Yu flashed a smile and proceeded to check the dark, burly dude with his holy sense. Qin Yu’s eyes lit up: “Is he a loose devil, loose demon or a loose immortal?”\u003c/p\u003e\n\u003cp\u003eIn the Qian Long continent, Qin Yu rarely used his holy sense. Just now he used it. Qin Yu realized that he could not detect the dark, burly man’s power level.\u003c/p\u003e\n\u003cp\u003eThe dark, burly man walked toward Qin Yu’s table.\u003c/p\u003e\n\u003cp\u003eQin Yu didn’t notice it before but when the burly man is right in front of him, he noticed that the burly dude is terrifying: “Like being crushed by a mountain, such a thick aura. Must be an expert as strong as Zong Jue.”\u003c/p\u003e\n\u003cp\u003e“Kid, you’re very pleasing to my eyes.” The dark, burly man looks at Hou Fei with a smile.\u003c/p\u003e\n\u003cp\u003e“Me?” Hou Fei shockingly points at himself.\u003c/p\u003e\n\u003cp\u003eThe dark burly dude smilingly nodded. “I’m Man Qian, you can call me big brother Man Qian.”\u003c/p\u003e\n\u003cp\u003eQin Yu noticed something at the moment – this Man Qian’s pupils turned out to be purple.\u003c/p\u003e\n\u003cp\u003e\"Brother, hell, I only have one brother. What makes you think you could be my big brother?\" Hou Fei clearly didn’t care.\u003c/p\u003e\n\u003cp\u003eA light flashed across Man Qian’s purple pupils. His smile completely disappeared. His face turned cold right away.\u003c/p\u003e\n\u003cp\u003eEnd of Book 11 Chapter 25\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-11-chapter-24\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-11-chapter-26\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/stellar-transformations/st-book-11-chapter-25","bookId":1510,"creation":"Sep 10, 2019 6:01:28 AM","modification":"Sep 10, 2019 6:01:28 AM"}
