{"id":57380,"no":272,"title":"Book 11 Chapter 29: Life after the Tribulation","content":"\u003cp\u003eStellar Transformations Book 11 Chapter 29: Life after the Tribulation\u003c/p\u003e\n\u003cp\u003eOn a nameless island in the boundless seas, there is in fact someone undergoing the 9-in-9 heavenly tribulation.\u003c/p\u003e\n\u003cp\u003eCrashing waves have ground the reef into a spherical shape.\u003c/p\u003e\n\u003cp\u003eHou Fei, Hei Yu, Shi Xin, Shi Bing, and Shi Zhan are standing together, looking at Qin Yu from a distance, their faces appear to be full of worry.\u003c/p\u003e\n\u003cp\u003eSeeing Qin Yu take out the Sword Immortal puppet, Hei Yu and Hou Fei’s worried appearances seem to slightly relax.\u003c/p\u003e\n\u003cp\u003eGradually, the strong winds became calm once more. Originally, large waves were roaring, but now, they too became calm once more. An invisible pressure descended on to the entire sea. In this moment, Hou Fei and the others could only feel that the entire world seemed to have become silent. There is only an extreme silence along with an extreme pressure.\u003c/p\u003e\n\u003cp\u003eThe pressure appeared to be constantly increasing, the tribulation cloud unceasingly whirled in the sky, and simultaneously, it gradually decreased in size.\u003c/p\u003e\n\u003cp\u003eAfter a long time…\u003c/p\u003e\n\u003cp\u003e“Why has the final heavenly tribulation lightning bolt not come down yet?” Hou Fei says while looking at the unceasingly storming core of the tribulation cloud with hatred.\u003c/p\u003e\n\u003cp\u003eHei Yu is completely silent, his eyes are filled with worry.\u003c/p\u003e\n\u003cp\u003e“Monkey, the power of this final tribulation lightning bolt is something never before seen in history.” Hei Yu says slowly.\u003c/p\u003e\n\u003cp\u003e\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u003c/p\u003e\n\u003cp\u003eQin Yu’s eyes glisten with radiance, his body has completely recovered to the point that he is now at his absolute tip-top shape. Furthermore, the Sword Immortal puppet was covering the top if his head. Even if the heavenly tribulation lightning were to strike down, no matter what, the first to suffer the strike would be the Sword Immortal puppet. Even if all of the Sword Immortal puppet’s energy is consumed, Qin Yu wouldn’t think too much about it.\u003c/p\u003e\n\u003cp\u003e“Hmph, it’s still storming in the core? I actually just want to see exactly how powerful this final heavenly tribulation lightning bolt is.” Qin Yu’s gaze is like ice cold blades, shooting directly into the tribulation cloud in the sky.\u003c/p\u003e\n\u003cp\u003eAll of a sudden--\u003c/p\u003e\n\u003cp\u003eIn this split second, in Qin Yu’s eyes, it seemed as if the world had become distorted and time had flown by.\u003c/p\u003e\n\u003cp\u003e“Big Brother Qin Yu.”\u003c/p\u003e\n\u003cp\u003eA nonchalantly smiling Li’er is standing in front of Qin Yu and looking at him, “Big Brother Qin Yu, I have returned. With Uncle Lan’s help, I have finally convinced my father. He finally agreed with me. He has agreed to let us be together and for me to marry you.”\u003c/p\u003e\n\u003cp\u003eSeeing this act… Hearing this voice…\u003c/p\u003e\n\u003cp\u003eHis ice cold spirit shatters with a “Peng” sound.\u003c/p\u003e\n\u003cp\u003e“Was that the land of fantasies?” Qin Yu’s heart is filled with hope that it wasn’t the land of fantasies. “There’s a possibility that it isn’t the land of fantasies… even if it is… seeing Li’er again is truly an extravagant and pleasurable experience.”\u003c/p\u003e\n\u003cp\u003eAll of a sudden--\u003c/p\u003e\n\u003cp\u003eA feeling of dizziness completely engulfs Qin Yu’s mind.\u003c/p\u003e\n\u003cp\u003e“The 9th heavenly tribulation lightning bolt. It might have an attack that is similar to a bewitching...” Qin Yu only just now thought of this possibility. At first, he was in a completely muddleheaded state.\u003c/p\u003e\n\u003cp\u003e“Boom!”\u003c/p\u003e\n\u003cp\u003eThis ferocious strike was similar to the heavens falling and the earth churning. That tribulation cloud has now transformed into a powerful lightning snake, ferociously striking down. Moving up and then down, it directly strikes the body of the Sword Immortal puppet that is in the space above Qin Yu. Like a piece of scrap metal, the Sword Immortal puppet is struck down and smashes into Qin Yu’s head.\u003c/p\u003e\n\u003cp\u003eThe Sword Immortal puppet is much like an Immortal weapon. By itself, it naturally is incapable of doing anything, only with Qin Yu’s control could it do anything.\u003c/p\u003e\n\u003cp\u003eBut currently, Qin Yu is in a muddleheaded state. Inside of the Sword Immortal puppet’s Multiplying Elemental Holy Formation, there is one piece of top grade elemental holy ore. Without Qin Yu’s control, the Sword Immortal puppet naturally could not put up any resistance.\u003c/p\u003e\n\u003cp\u003e\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u003c/p\u003e\n\u003cp\u003eSeeing the Sword Immortal puppet smash into Qin Yu’s head like a piece of scrap metal, Hou Fei and Hei Yu’s facial colors change.\u003c/p\u003e\n\u003cp\u003e“Crap!” Hou Fei’s facial color has drastically changed. “Big brother is currently in some sort of muddleheaded state, naturally he cannot control the Sword Immortal puppet.”\u003c/p\u003e\n\u003cp\u003e“Big Brother!”\u003c/p\u003e\n\u003cp\u003eHei Yu’s first reaction was to try and contact Qin Yu with his holy sense. Even though he tries to contact Qin Yu with his holy sense, it is unsuccessful as he is unable to illicit even the slightest reaction from Qin Yu.\u003c/p\u003e\n\u003cp\u003eSeeing the Sword Immortal puppet smash into Qin Yu’s head, Hei Yu, Hou Fei, and the others continue to reach out to Qin Yu with their holy sense, but they are still incapable of waking Qin Yu. Still, the 9th tribulation lightning bolt struck the body of the Sword Immortal puppet. Even though none of the Sword Immortal puppet’s energy is consumed, it is still as incomparably durable as always.\u003c/p\u003e\n\u003cp\u003eThe tribulation lightning bolt scatters, and in a flash, it strikes onto Qin Yu’s body.\u003c/p\u003e\n\u003cp\u003eSimultaneously, the purple fire dragon and a dark, black whirlwind closely follow the tribulation lightning bolt flying downwards. Lightning engulfs Qin Yu.\u003c/p\u003e\n\u003cp\u003eIn this moment, Hou Fei, Hei Yu, and the others all could no longer see Qin Yu as he has already been entirely engulfed by the purple fire dragon, dark, black whirlwind, and the tribulation lightning. He has become a cocoon radiating all kinds of different colored lights.\u003c/p\u003e\n\u003cp\u003e“Big Brother!”\u003c/p\u003e\n\u003cp\u003eHou Fei and Hei Yu in that split second begin to shiver all over. Their eyes are filled with fear.\u003c/p\u003e\n\u003cp\u003e\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u003c/p\u003e\n\u003cp\u003e“What’s happened to me? What exactly happened!?”\u003c/p\u003e\n\u003cp\u003eIn this muddleheaded state, Qin Yu’s mental processing capabilities have drastically slowed. It’s as if he’s lost his memories, struggling to recall anything. It is in this moment that an ice-cold, clear stream wraps around Qin Yu’s spirit.\u003c/p\u003e\n\u003cp\u003eQin Yu wakes up in this moment!\u003c/p\u003e\n\u003cp\u003e“I’m still undergoing the tribulation!”\u003c/p\u003e\n\u003cp\u003eQin Yu’s first reaction is to try and open his eyes, however he discovers that he is simply incapable of controlling his own eyes. Moreover, his eyes have long ago been turned into nothing but ashes.\u003c/p\u003e\n\u003cp\u003e“Holy sense!\u003c/p\u003e\n\u003cp\u003eQin Yu’s holy sense immediately sweeps the surroundings.\u003c/p\u003e\n\u003cp\u003eEven though he has been prepared for this situation, in his current state, in this very moment, he is nonetheless, extremely alarmed.\u003c/p\u003e\n\u003cp\u003eThe skin on his body had already been turned to ashes by the tribulation lightning at an earlier time. Even his flesh and muscle have been become a charred black color. At the same time, within his body, his elemental life force is still unceasingly growing new, blood-red muscle and flesh. However, the instant it is formed, thunder, lightning, and purple Heavenly Flame burn it into a charred black color, much like how coal looks.\u003c/p\u003e\n\u003cp\u003eSimultaneously, a terrifying dark, black whirlwind is currently unceasingly eating away at parts of his body.\u003c/p\u003e\n\u003cp\u003eEven though he has the lightning fast recovery of his elemental life force, almost half of his body has already been eaten away. Currently Qin Yu’s soul is fused with the nucleus of the sun that is in his Dantian. Additionally, the Meteoric Tear is currently continuously circulating, emitting many green dots of light that increase the recovery speed of the body.\u003c/p\u003e\n\u003cp\u003eTribulation lightning, Heavenly Flame, and a dark, black whirlwind are all continually causing destruction.\u003c/p\u003e\n\u003cp\u003eAdditionally, the elemental life force is currently persistently recovering the body and the Meteoric Tear is also working its hardest to radiate the green radiance.\u003c/p\u003e\n\u003cp\u003eEven with all this, the speed of recovery could not keep up with the speed of destruction.\u003c/p\u003e\n\u003cp\u003eBased on logic, tribulation lightning, Heavenly Flame, and the dark, black whirlwind could destroy a body with effort equivalent to the effort needed to blink. However, Qin Yu also relies on his elemental life force and the Meteoric Tear endlessly contending against the destructive force, his body is currently only slowly being destroyed. And now, it has already been destroyed by over half.\u003c/p\u003e\n\u003cp\u003eAnd for the Sword Immortal puppet that lacks a controller, it falls to the side like a piece of scrap metal without the slightest degree of usefulness.\u003c/p\u003e\n\u003cp\u003e“Sword Immortal puppet!”\u003c/p\u003e\n\u003cp\u003eQin Yu exerts his mental control.\u003c/p\u003e\n\u003cp\u003eAt once, the Sword Immortal puppet’s eyes are filled with color, and in a flash, its right hand grabs the sword hilt on its back--\u003c/p\u003e\n\u003cp\u003eAt this moment, a terrifying sword aura appears.\u003c/p\u003e\n\u003cp\u003e“Lord of Black Flame’s Ring!”\u003c/p\u003e\n\u003cp\u003e\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u0026gt;\u003c/p\u003e\n\u003cp\u003eA terrifying sword aura encases every inch of Qin Yu’s skin, protecting him from the tribulation lightning, the Heavenly Flame, and the tribulation wind. And for the tribulation lightning, the Heavenly Flame, and the tribulation wind that had already entered Qin Yu’s body, without any replenishment from the external forces, after a brief period of time, they are completely exhausted.\u003c/p\u003e\n\u003cp\u003e“Hu~~~”\u003c/p\u003e\n\u003cp\u003eWithin the time that it takes for one breath, the originally dilapidated body is now completely recovered to its original form, as if it was never damaged in the first place.\u003c/p\u003e\n\u003cp\u003eBeing worn down by the Heaven-Sundering sword aura, the energies of the tribulation lightning, the Heavenly Flame, and the tribulation wind eventually are eventually completely exhausted and no longer dangerous.\u003c/p\u003e\n\u003cp\u003eThe protective sword aura dissipates. Qin Yu returns the Sword Immortal puppet to his body.\u003c/p\u003e\n\u003cp\u003e“Is it over?”\u003c/p\u003e\n\u003cp\u003eQin Yu quietly mutters to himself.\u003c/p\u003e\n\u003cp\u003eSmelling the faintly fishy smelling atmosphere, feeling the splendor of the wind brushing his skin, and hearing the sound of waves gently beating on the reef, Qin Yu raises his head towards the sky.\u003c/p\u003e\n\u003cp\u003eThe sky is a rich blue color. The clouds drift on the horizon towards the east in accordance to the wind which is gently blowing in that direction.\u003c/p\u003e\n\u003cp\u003e“I’ve succeeded.” Qin Yu takes a deep breath. His heart is full of excitement.\u003c/p\u003e\n\u003cp\u003eFor Qin Yu, when he remembers the final attack from just a moment ago, there is still a lingering fear.\u003c/p\u003e\n\u003cp\u003e“If I woke up even just a little bit later, it’s very likely that in that amount of time, my entire body would have been destroyed, including the planet within my Dantian.”\u003c/p\u003e\n\u003cp\u003eIf the recovery speed of my elemental life force and Meteoric Tear were any slower, I would also have died.\u003c/p\u003e\n\u003cp\u003e“Haha, I already knew that big brother would succeed!” Hou Fei says this while happily laughing out. In a flash, Hou Fei’s figure appears in front of Qin Yu. In Hou Fei’s eyes, there is in fact an incomparable sense of excitement.\u003c/p\u003e\n\u003cp\u003eHei Yu is looking at Qin Yu. His eyes possess a sense of excitement that is hard to withhold.\u003c/p\u003e\n\u003cp\u003e“Hairy-mixed bird, just look at yourself. Haha, I’ve said it before. To big brother, this 9-in-9 heavenly tribulation is nothing more than a fart. It did not even manage to damage big brother’s hair.” Hou Fei says while happily laughing.\u003c/p\u003e\n\u003cp\u003eHei Yu calms down a bit, looks at Hou Fei, and then coldly says, “Oh? Just a moment ago, right after the 9th tribulation lightning struck down, it looked as if a certain monkey was about to cry.”\u003c/p\u003e\n\u003cp\u003e“Who, who, who was about to cry?” Hou Fei says hurriedly.\u003c/p\u003e\n\u003cp\u003eHei Yu, instead of replying, says no more. The faint raising of the corners of his mouth indicates that Hei Yu is currently silently laughing to himself. This makes Hou Fei even angrier.\u003c/p\u003e\n\u003cp\u003e“Alright, enough messing around.” Qin Yu smiles and puts his hands on the shoulders of his two brothers, “Fei Fei, Xiao Hei, to speak the truth, just a moment ago, I just almost met my end. During my 9th tribulation, besides the attacks from the Heavenly Flame and the Trance-inducing Hypnosis, that tribulation lightning’s power was extraordinarily terrifying. Also… This heavenly tribulation of mine also had that strange tribulation wind. That dark, black whirlwind’s power was relatively more powerful than the Heavenly Flame.”\u003c/p\u003e\n\u003cp\u003eAs soon as Qin Yu recalls the dark, black whirlwind, his heart trembles.\u003c/p\u003e\n\u003cp\u003eThat whirlwind possessed astonishing destructive capabilities. Even with the toughness of his body, it was quickly eaten away. Luckily for him, he had his elemental life force unceasingly recovering his body.\u003c/p\u003e\n\u003cp\u003e“Dark, Black Whirlwind?” Hou Fei furrows his brow.\u003c/p\u003e\n\u003cp\u003eAfter a brief silence, he says, “Could it be…? Black Besieging Wind?”\u003c/p\u003e\n\u003cp\u003e“Black Besieging Wind?” Qin Yu is puzzled.\u003c/p\u003e\n\u003cp\u003eHei Yu nods and says, “Amongst my hereditary memories, there are many different types of this wind. The Black Besieging Wind is one of the relatively more powerful types of wind. Within suitable places in the Demon Realm and Devil Realm, this type of wind exists as a solid ore. In general, people who confront the Black Besieging Wind are all reduced to ashes.\u003c/p\u003e\n\u003cp\u003eQin Yu nods to himself.\u003c/p\u003e\n\u003cp\u003eIn terms of toughness and durability, his body was absolutely not inferior to a top grade holy weapon. However, his body was still so easily destroyed. Maybe even low-grade Immortal weapons would be unable to resist against this type of Black Besieging Wind.\u003c/p\u003e\n\u003cp\u003eHou Fei happily laughs and says, “Big brother, this Black Besieging Wind is in fact considered a treasure by inhabitants of the Ascended Realm.”\u003c/p\u003e\n\u003cp\u003e“Treasure?” Qin Yu is puzzled, “Could it be that this Black Besieging Wind can also be gathered for one’s personal use?”\u003c/p\u003e\n\u003cp\u003eHou Fei shakes his head, smiles, and says, “No, Black Besieging Wind is really hard to procure for one’s own use. However, in general, if a place has Black Besieging Wind, it will also have extremely good ores. Those ores can all be used in the forging of Demon weapons.\u003c/p\u003e\n\u003cp\u003eQin Yu now understands.\u003c/p\u003e\n\u003cp\u003e“Haha, correct, under the constant attacks of Black Besieging Wind, ordinary rocks will have already been reduced to dust. The ores that are capable of existing in that environment, which one could possibly be inferior? Even without refinement and forging, the hardness of those ores is not inferior to that of low-grade Immortal weapons. If they were to be forged, their power would become even greater.”\u003c/p\u003e\n\u003cp\u003eHei Yu nods and says, “Indeed, that is how it is. It is very easy to extract many of those ores in places that are under the constant attacks from Black Besieging Wind. Naturally, there is no need for selectivity because those are capable of existing alongside the Black Besieging Wind, none of them are inferior ores.”\u003c/p\u003e\n\u003cp\u003eBoth Hei Yu and Hou Fei possess hereditary memories. These hereditary memories aren’t just simple mystical powers, they also contain information from all walks of life and more.\u003c/p\u003e\n\u003cp\u003eFor the Black Besieging Wind to unexpectedly appear during my 9-in-9 heavenly tribulation, heaven truly thinks highly of me.” Qin Yu shakes head and forces a smiles, “But still, just now, to directly emit so much sword aura to create a protective cover, a lot of my top grade elemental holy ore’s energy was consumed. That really sucks.”\u003c/p\u003e\n\u003cp\u003eQin Yu makes a sweep with his holy sense\u003c/p\u003e\n\u003cp\u003eAfter the incident on Qing Xu Mountain, the Sword Immortal puppet’s top grade elemental holy ore only had 80% of its energy remaining. Just now, to protect Qin Yu, another 20% of its energy was consumed. Now, only 60% of the energy remains. This 60% is only enough to fully use the Heaven-Sundering Sword Art’s 8th move and nothing more.\u003c/p\u003e\n\u003cp\u003e“60% energy remaining, in addition to Zong Jue and Uncle Lan’s fame for his fighting prowess should more or less be capable of firmly shocking those Ascended Realm Emissaries.”\u003c/p\u003e\n\u003cp\u003eQin Yu ponders to himself.\u003c/p\u003e\n\u003cp\u003eHaving passed the 9-in-9 heavenly tribulation, Qin Yu’s thoughts are now fully focused on the auction being held after two months.\u003c/p\u003e\n\u003cp\u003eTo Qin Yu, this auction is of the utmost importance. After all, top grade elemental ore is what Qin Yu currently desires the most. For every top grade elemental ore obtained, Qin Yu’s hand would become much more powerful. (TL Note: “Hand,” like in card games.)\u003c/p\u003e\n\u003cp\u003e“Big brother, you must have also entered late stage Dujie, right? After becoming late stage Dujie, what is the training technique for the Stellar Transformations like?” Hou Fei’s voice rouses Qin Yu who was in the midst of thinking.\u003c/p\u003e\n\u003cp\u003e“Late stage Dujie?”\u003c/p\u003e\n\u003cp\u003eQin Yu pauses and immediately uses his holy sense to carefully inspect his internal state. After succeeding in passing the tribulation, he has yet to carefully inspect what his current condition is.\u003c/p\u003e\n\u003cp\u003eWithin his Dantian, the volume of the nucleus of the sun within the green planet has already largely increased. Precisely speaking, the volume of the nucleus of the sun is now occupying nearly half of the green planet’s volume.\u003c/p\u003e\n\u003cp\u003eQin Yu clearly understands, once the entirety of the green planet becomes the sun’s nucleus, he would then enter the star stage.\u003c/p\u003e\n\u003cp\u003eHaving passed the 9-in-9 heavenly tribulation, Qin Yu’s body, through the closely fought battle between the “tribulation lightning, tribulation wind, and Heavenly Flame tribulation” and his “elemental life force and Meteoric tear”, every time his body was being destroyed, it would be born anew. This experience was the same as undergoing innumerable amounts of training. His physical body’s degree of toughness and durability have greatly improved.\u003c/p\u003e\n\u003cp\u003e“Are there any significant changes?” Hou Fei also inquires.\u003c/p\u003e\n\u003cp\u003e“There aren’t any significant changes, but my body’s degree of toughness and durability have increased by a significant amount.” Qin Yu smiles and says, “Alright, Fei Fei, Xiao Hei, let’s hurry over to Golden Wood Island and use the Ancient Teleportation Formation to get to Snow Fish Island. The day of the Heaven-Sundering Diagram’s auction is not far.”\u003c/p\u003e\n\u003cp\u003e“Auctioning the Heaven-Sundering Diagram?” Hou Fei evilly laughs and says, “Good, let each and every one of those Ascended Realm Emissaries compete with each other. Whoever has the most top grade elemental holy ore, we will give the diagram to that person.”\u003c/p\u003e\n\u003cp\u003eHou Fei and Hei Yu both know the secret of the Sword Immortal puppet and they also know that it uses top grade elemental holy ore to supply its energy. As long as there is more top grade elemental holy ore, the Sword Immortal puppet’s attack power will increase.\u003c/p\u003e\n\u003cp\u003e“Correct, once we secure the top grade elemental holy ores, we’ll deal with them using the strengthened Sword Immortal puppet.” Qin Yu smiles, “Alright, let’s depart.”\u003c/p\u003e\n\u003cp\u003eQin Yu is the first to transform into a stream of light, flying towards the south. After, Hou Fei, Hei Yu, and the others followed Qin Yu, flying south at an extremely fast speed.\u003c/p\u003e\n\u003cp\u003eEnd of Book 11 Chapter 29\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-11-chapter-28\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-11-chapter-30\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/stellar-transformations/st-book-11-chapter-29","bookId":1510,"creation":"Sep 10, 2019 6:01:28 AM","modification":"Sep 10, 2019 6:01:28 AM"}
