{"id":57412,"no":304,"title":"Book 11 Chapter 61: The Transfer","content":"\u003cp\u003e\u003cstrong\u003eStellar Transformations Book 11 Chapter 61: The Transfer\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eQin Yu held the small green tower in his left hand, feeling at a loss. He didn’t know how to use this ‘Jiang Lan’s Realm’.\u003c/p\u003e\n\u003cp\u003e“How do you use this? What do you mean by ‘fully use’ this ‘Jiang Lan’s Realm’?” Qin Yu inquired persistently.\u003c/p\u003e\n\u003cp\u003e“Do not be so hasty, first apply a Blood Contract with it.” Uncle Lan revealed a knowing smile.\u003c/p\u003e\n\u003cp\u003eQin Yu blushed with embarrassment and looked at Uncle Lan, he was a little too jittery. He even forgot about applying the Blood Contract, which everyone knew about when trying to identify an item. But, Uncle Lan knew Qin Yu was very nervous at this moment.\u003c/p\u003e\n\u003cp\u003e‘Drip!’\u003c/p\u003e\n\u003cp\u003eA drop of scarlet blood rolled from Qin Yu’s finger onto the surface of the small green tower. In a second, that drop of blood vanished from sight like a drop of water in a vast desert. In the same place where the drop was absorbed, that spot of the tower had turned pink, the colour started to converge towards the tower’s centre. It looked like a drop of liquid ink dropped into a beaker of clear water. Once it gathered at the centre, it rose, like a comet in the night sky, to the peak of the tower. When it finished gathering at the peak, the spire tip had evidently changed to red in colour.\u003c/p\u003e\n\u003cp\u003eHe closed his eyes to focus. Within Qin Yu’s heart, he could sense the natural aura of this small green tower.\u003c/p\u003e\n\u003cp\u003eA short moment later ––––––\u003c/p\u003e\n\u003cp\u003e“There are three spatial pockets!” Qin Yu suddenly opened his eyes, turned to look at Uncle Lan in stark surprise, “Uncle Lan, this ‘Jiang Lan’s Realm’ is a spatial storage Divine item? But, there are also three individual spatial pockets inside!?”\u003c/p\u003e\n\u003cp\u003eUncle Lan smiled knowingly and spoke: “Yes, this item is indeed a Storage Division Divine item. The three spatial storage pockets are near-infinitely large.”\u003c/p\u003e\n\u003cp\u003eUncle Lan may have had answer quite mildly, but his explanation paralyzed Qin Yu. Qin Yu was feeling dumbfounded and at a loss for words.\u003c/p\u003e\n\u003cp\u003eAfter the Blood Contract, Qin Yu could also confirm and acquire information about this ‘Jiang Lan’s Realm’. It’s right, the tower contained three different spatial pockets.\u003c/p\u003e\n\u003cp\u003eIn the first spatial pocket, the time was distorted inside and was slower than the time in the world outside by a ratio of ten to one. So if a decade was spent in this chamber, then outside it – in the outside world, has only passed one year. And, this chamber was filled with rich energy, of about ten times higher than the outside world\u003c/p\u003e\n\u003cp\u003eIn the second spatial pocket, the time was also slower at a ratio of a hundred to one. So if a century was spent in this chamber, then outside it – in the outside world, has only passed one year. And, the energy was a hundred times higher than in the outside world.\u003c/p\u003e\n\u003cp\u003eIn the third spatial pocket, time was at a ratio of a thousand to one. One millenium inside was equal to one year outside, and the energy inside was a thousand higher than outside as well.\u003c/p\u003e\n\u003cp\u003eWhoa, this Divine item even controls the time within it. How could Qin Yu not be shocked?\u003c/p\u003e\n\u003cp\u003e“Xiao Yu, there is a catch to the energy within this tower. It is not naturally formed within, it is actually absorbed from the outside world.” Uncle Lan explained, “For example, when you are in the Mortal Plane, you can absorb Harmonized Spiritual energy. Similarly, when you are in the Immortal, Devil and Demon Realms, you can absorb Holy Elemental Energy…..”\u003c/p\u003e\n\u003cp\u003e[TN: Harmonized energy is the same as the old holy energy]\u003c/p\u003e\n\u003cp\u003eQin Yu nodded.\u003c/p\u003e\n\u003cp\u003eHow can there be limitless energy within these three near-infinitely large chambers? Then where does that energy come from? It must be from the outside world. Qin Yu already guessed this was so.\u003c/p\u003e\n\u003cp\u003e“Well then, try out the first chamber. Try opening it.” Uncle Lan revealed a small smile.\u003c/p\u003e\n\u003cp\u003e“Okay.” The young man began to channel his stellar energy from his Solar Core at the centre of dantian – an infinitely large space with concentrated energies. He aimed his pure energy to the gateway of the first chamber. After a short time, pure and hot energy surged forth from his body…..\u003c/p\u003e\n\u003cp\u003eHowever over time, he turned to look at Uncle Lan, his face wore a disappointed expression.\u003c/p\u003e\n\u003cp\u003e“Lad, to be able to open the first chamber, your personal power must be at least at Level 5-borderline-to Level 6 Golden Immortals’.” Uncle Lan instructed.\u003c/p\u003e\n\u003cp\u003eQin Yu felt slightly shaken.\u003c/p\u003e\n\u003cp\u003e“As for the second and the third chambers, you will know how much power you need once you reached the previous chamber’s requirement. Pay attention; only when you can completely open all three chambers, and only at that time, are you eligible to see Li’er.” Uncle said solemnly, his face was hard without a shred of sympathy.\u003c/p\u003e\n\u003cp\u003eFrom Uncle Lan’s expression, Qin Yu could feel an enormous pressure on his shoulders. An unprecedentedly large pressure.\u003c/p\u003e\n\u003cp\u003eFor the first chamber to be opened, he needed at least the power of a Golden Immortal at Level 5 to 6. Obviously, the second chamber was going to need far more power, and……what about the third chamber? ––––– How much power does he need for the third chamber? Qin Yu felt like he was wading through an endless swarm, and his heart had sunk down a bottomless pool with little light.\u003c/p\u003e\n\u003cp\u003e“Uncle Lan, tell me, how many years will I have to wait? How many years….?” Qin Yu uttered a slightly stifled desperate plea.\u003c/p\u003e\n\u003cp\u003eUncle Lan hushed Qin Yu to stop his questions that was about to bubble to the surface, and sighed: “Don’t be so anxious. How many years you have to wait will depend on you. Depend on how quickly you train. Naturally, if you train slowly, the time you have to wait will be much longer…!”\u003c/p\u003e\n\u003cp\u003eQin Yu could not help a hint of bitterness surface from his throbbing heart.\u003c/p\u003e\n\u003cp\u003e“Xiao Yu, lad, your Chosen Path is quite peculiar. I suggest that you………continue down this Path, it would be best if you do not dabble in those ordinary Immortal, Devil and Demon Paths.” Uncle Lan felt he owed his dear companion some advice.\u003c/p\u003e\n\u003cp\u003eThe young man’s heart thumped a little louder, he gazed at Uncle Lan in puzzlement.\u003c/p\u003e\n\u003cp\u003e“At the right time, lad, you will understand. I cannot even imagine how powerful your Path will amount to, and what unfathomable depth your strength will be. For a new Practitioner Path and an unimaginable training method, your defensive and offensive capabilities will differ from others. Also you know about other people’s capabilities, while they don’t know yours. In the future, this will be advantageous to you over your opponents.” Uncle Lan sincerely.\u003c/p\u003e\n\u003cp\u003eQin Yu’s eyes lit up with understanding.\u003c/p\u003e\n\u003cp\u003e“Alright, Xiao Yu, you must put all your effort into training, but you must not be too hasty. Haste makes waste. Mortal’s time has little meaning to my family. As long as you don’t give up, I can guarantee you that no one can force Li’er to marry. Don’t give up.” Uncle Lan spoke softly, his voice barely a whisper. But, to Qin Yu, it was crystal clear like wind chimes breaking the ever-present silence. They echoed within Qin Yu’s soul endlessly, giving him inexplicable energy and fuelled his resolve.\u003c/p\u003e\n\u003cp\u003eHe was so absorbed in the moment, that he wasn’t aware that the ninth floor of the Nine Heavens was experiencing minor tremors.\u003c/p\u003e\n\u003cp\u003e“Xiao Yu…..That is all I have to say. It is time for me to leave now.” Uncle Lan’s facial expression softened and he smiled kindly at Qin Yu, “Remember, believe in yourself, steel your resolve. Don’t let others sway you from your true path. As long as you live your life without regrets, be true to yourself, be true to your beliefs, and that will be more than enough.”\u003c/p\u003e\n\u003cp\u003eQin Yu faced Uncle Lan; his back ram-rod straight and his feet shoulder-length apart, his eyes aflame will steel and resolve within them.\u003c/p\u003e\n\u003cp\u003eUncle Lan smiled happily and looked with satisfaction into Qin Yu’s eyes. Uncle Lan’s figure slowly fades into the surroundings, soon became a hazy blur, and finally vanished. Now, only a young man stood within the ninth floor of the Nine Heavens.\u003c/p\u003e\n\u003cp\u003e“Li’er.”\u003c/p\u003e\n\u003cp\u003eQin Yu reminiscent his time with Li’er; he remembered that wholesome feeling of contentment, and that feeling of bliss when the two of them held each other in the others’ embrace. It was as if the world around the two had momentarily disappeared, even time became stagnant, and felt as if the universe was completely focused at the couple.\u003c/p\u003e\n\u003cp\u003eHe would not forget the short years he had spent with Li’er, and the times where he stood with her.\u003c/p\u003e\n\u003cp\u003e“Nothing can stop me. None.”\u003c/p\u003e\n\u003cp\u003eThe young man lifted his head skyward towards the illusionary night sky painted on the ceiling of the Nine Heavens’ ninth floor. It was as if his vision pierced through the fabric of reality through the void, through the Immortal, Devil and Demon Realms, and directly into that Secret Region…….that mysterious place.\u003c/p\u003e\n\u003cp\u003eAnd at that special place, a certain young woman gaze shifted downwards. She quietly and longingly gazed below. It was as if the two gazes met at the mid-point and intertwined like lovers.\u003c/p\u003e\n\u003cp\u003e…….\u003c/p\u003e\n\u003cp\u003eGolden Woods Island.\u003c/p\u003e\n\u003cp\u003eA young man’s body appeared from thin air a few metres from the beach front. Qin Yu had been transported out of Ni Yang’s Realm. Even before Qin Yu arrival, two individuals – Man Gan and Zong Jue, stood a fair distance away, obviously waiting for him. The two of them wanted to see the one who came first and the same one who entered the ninth floor.\u003c/p\u003e\n\u003cp\u003e“Ha ha, Brother Qin Yu, it really was you who came first.” Man Gan laughed loudly with a trace of self-mocking, whilst walking over where Qin Yu had just appeared.\u003c/p\u003e\n\u003cp\u003eWhen Qin Yu glanced on the two approaching, he instantly knew that he spent the most time within the ninth floor. Facing these two, Qin Yu smiled immediately and said: “Brother Man Gan and Senior Zong Jue. It was thanks to my martial Uncle that I was able to become first. By the way, gentlemen, do you know where is my martial Uncle?”\u003c/p\u003e\n\u003cp\u003eAs soon as he said that, he glanced at all four: north, south, east and west, directions.\u003c/p\u003e\n\u003cp\u003eZong Jue follow his gaze, and said: “I thought as much. You are only at the Dacheng Stage, it must have been Lan Feng who helped you survive that test. Since any of the rooms’ power was, at least, more than ten levels beyond you. I had just then scouted around here, but I didn’t see Brother Lan Feng.”\u003c/p\u003e\n\u003cp\u003e“Zong Jue. You can stop looking now.” A familiar voice sounded nearby. It had the same nonchalant and indifferent tone.\u003c/p\u003e\n\u003cp\u003eZong Jue and Man Gan looked towards where the voice originated from, and watched Sword Immortal Lan Feng fly down from above.\u003c/p\u003e\n\u003cp\u003e“Younger martial Uncle.” Qin Yu’s face lit up.\u003c/p\u003e\n\u003cp\u003eThe smiling Sword Immortal Lan Feng said: “Nephew Yu, since you became first this time, you must have gotten quite a bit of treasure? Choose of Divine item and a few Top Grade Immortal items, for yourself…..”\u003c/p\u003e\n\u003cp\u003eAt this, both, Man Gan and Zong Jue, pair of eyes’ lit up with a hint of greed.\u003c/p\u003e\n\u003cp\u003eQin Yu smiled to show his gratitude, but then shook his head: “No need, martial Uncle, you must know that I have nearly reached the cultivation of the Dacheng Stage where I can ascend soon. When I ascend, I will most likely only be at the lowest layer of the Immortal Realms. If I possess even one Divine item, I would most likely be hunted to extinction.”\u003c/p\u003e\n\u003cp\u003e“Hmmm…..” Lan Feng replied with hesitation.\u003c/p\u003e\n\u003cp\u003e“Martial Uncle, don’t worry, I only require one piece of Top Grade Immortal item and that is a Battle Robe. Please take everything else.” With an over-exaggerated wave, numerous treasures appeared between the two martial companions. Amongst them was many Top Grade Immortal items and even included the Divine scroll – Painting of the Lost God.\u003c/p\u003e\n\u003cp\u003eMan Gan’s gaze instantly focused on that Painting.\u003c/p\u003e\n\u003cp\u003eQin Yu was already aware of their stares, but only did so to reduce unnecessary trouble later on. With the two as his witness, others would also know soon enough, and this will help convince all that these treasures are not on his person.\u003c/p\u003e\n\u003cp\u003eLan Feng smiled knowingly and received all the items.\u003c/p\u003e\n\u003cp\u003eWhen Lan Feng received these items, naturally, they were transferred to Qin Yu’s Jade Immortal Mansion. While he received each item, he applied the Blood Contract. In reality, that drop of blood was actually Qin Yu’s blood.\u003c/p\u003e\n\u003cp\u003eLike a boomerang, all the items have once again returned to their original owner.\u003c/p\u003e\n\u003cp\u003eBut of course…….Man Gan and Zong Jue does not know that nor can they determine it.\u003c/p\u003e\n\u003cp\u003e“Xiao Yu, do you want to go back with me? Come with me to see Martial Brother?” Lan Feng said.\u003c/p\u003e\n\u003cp\u003eQin Yu shook his head regretfully and replied: “No, it has been a long time, and I want to go back to see my family. After that, I will go to see Uncle Lan later.”\u003c/p\u003e\n\u003cp\u003e“Good. That is good.” Lan Feng nodded, and turned to face the other two, “Brother Man Gan and Brother Zong Jue, I presume you have also obtained Divine items. And from my opinion, they should be quite good.”\u003c/p\u003e\n\u003cp\u003eMan Gan laughed openly: “That’s right, Ha ha……..Emperor Ni Yang wasn’t acclaimed to be the Emperor with the most Divine items for no reason. He must have had over 10 pieces altogether. In the eighth and seventh floors both had Defense Division Divine equipment, it truly was an incredible sight.”\u003c/p\u003e\n\u003cp\u003eNaturally, for Emperor Ni Yang to act, he would come marching in his best.\u003c/p\u003e\n\u003cp\u003eIn the seventh and the eighth floors, the Divine items was in the Defense Division, but the ninth floor would definitely have the best. Including the Atlas of Ten Thousand Beast in the first floor, all of these Divine items weren’t normal Divine items either.\u003c/p\u003e\n\u003cp\u003e“Both pieces were Defense Division Divine items?” Lan Feng asked, slightly surprised.\u003c/p\u003e\n\u003cp\u003eMan Gan and Zong Jue nodded lightly, and the former replied in a sour tone: “Haah, if I could use Divine items to exchange for your Painting of the Lost God item, let alone one piece of Defense Division Divine item, even with two I would willing.”\u003c/p\u003e\n\u003cp\u003e“Ha ha……two defense division Divine items for the Painting. Brother Man Gan, do you not think that I did not know about the true abilities of the Painting of the Lost God?” Lan Feng teased.\u003c/p\u003e\n\u003cp\u003eMan Gan uttered a dry and awkward laugh.\u003c/p\u003e\n\u003cp\u003eActually, Lan Feng (Qin Yu) did not know about the true effects of the Painting of the Lost God, but simply based on its rank as the top treasure in all the Immortal, Devil and Demon Realms, he could determine its value.\u003c/p\u003e\n\u003cp\u003e“Alright, it’s time I go back to see Martial Uncle. With his help, we can arrange these treasures.” Lan Feng smiled briefly, and nodded a farewell at Qin Yu. Then his body vanished from sight.\u003c/p\u003e\n\u003cp\u003eMan Gan stared at the spot where Lan Feng disappeared from, and with a start, he came back to himself and exclaimed: “An individual like Lan Feng is already so strong. What stage of power is his martial uncle at? Qin Yu, do you know?”\u003c/p\u003e\n\u003cp\u003e“About Uncle Lan’s capabilities, even I do not know.” Qin Yu shook his head.\u003c/p\u003e\n\u003cp\u003eZong Jue recalled the Black Scimitar given to him by Senior Lan…..who could casually give out a prized weapon with the toughness comparable to Low Grade Divine items. Senior Lan had to be an extraordinary person.\u003c/p\u003e\n\u003cp\u003e“Senior Lan was incredibly powerful, he was at least a Level 7 or 8 Golden Immortal. While his martial brother Senior Lan…….should be at least at the Mystic Immortal Emperor Stage.” Zong Jue muse aloud.\u003c/p\u003e\n\u003cp\u003eMan Gan fell into a stunned state.\u003c/p\u003e\n\u003cp\u003e“The Mortal Plane had such a powerful expert?” Man Gan was confused, but witnessing Lan Feng’s power, he could no longer deny it.\u003c/p\u003e\n\u003cp\u003eMan Gan shook his head from side to side repeatedly and sighed. To be able to acquire a Defense Divine equipment this time was already fortunate.\u003c/p\u003e\n\u003cp\u003e“Zong Jue and Brother Qin Yu, I will not stay here in this Mortal Plane any longer. Here is where we part.” Man Gan said his farewell to the other two.\u003c/p\u003e\n\u003cp\u003eQin Yu was still quite curious how Man Gan would return to the Demon Realm.\u003c/p\u003e\n\u003cp\u003e“Brother Man Gan, coming to the Mortal Plane seem very difficult, how about going…..”\u003c/p\u003e\n\u003cp\u003e“Going back is not too difficult, but much easier than coming here.” Man Gan took out five small crystals with a flip of his hand. Except the colours of the crystals were different, Man Gan then placed these crystals on the ground around his body, such that they encircled him.\u003c/p\u003e\n\u003cp\u003eWhile he did, with another hand he retrieved five more paper charms and stuck them each crystal.\u003c/p\u003e\n\u003cp\u003e’Sizzle, sizzle’ When the charms touched the crystals, vapour rose like dropping water on embers. Explosive energy burst forth from these five crystals, then each crystal formed ley lines linking the crystals next to it. In the end the five crystals formed a circular array around Man Gan.\u003c/p\u003e\n\u003cp\u003e“Brother Qin Yu and Zong Jue, farewell. When you ascend to the Immortal Planes, you can come find me in the Demon Realm.” Man Gan smiled through the soft light of the array.\u003c/p\u003e\n\u003cp\u003e“Farewell.”\u003c/p\u003e\n\u003cp\u003eQin Yu and Zong Jue was still a little surprised by the scene, but managed to give a farewell.\u003c/p\u003e\n\u003cp\u003e“Peng!” The five crystals exploded, a terrifyingly powerful wave of energy surged from the formation. That dominating wave of energy made Qin Yu recall that thin black man – Wu Lan, from the third floor of the Nine Heavens.\u003c/p\u003e\n\u003cp\u003eIn the space above Man Gan, another channel appeared and shot alarming energy down. It connected with the formation, then –––––––\u003c/p\u003e\n\u003cp\u003e“schuuuu.”\u003c/p\u003e\n\u003cp\u003eAround Man Gan was a floating battle robe, then in the same moment, he was gone, into the upper tunnel.\u003c/p\u003e\n\u003cp\u003eIn a short while, the space where the array had been was quiet again, the five crystals were reduced to powder. Qin Yu and Zong Jue finally came back to themselves since witnessing that spectacle.\u003c/p\u003e\n\u003cp\u003e“Senior Zong, you will probably go back to the Chaotic Astral Ocean, and I to my own home. We shall part here as well.” Qin Yu said\u003c/p\u003e\n\u003cp\u003e“Eh, upon acquiring this Divine item, I felt I’ve finally about to break through. In approximately ten years, I will ascend to the Demon Realm. In these ten years, if you have the time, come visit me. Well then, farewell.” Zong Jue laughed.\u003c/p\u003e\n\u003cp\u003eWhen Qin Yu heard that Zong Jue, who was a 12th Tribulations Loose Demon, was about to break through to a Level 1 Demon King, he had to congratulate Zong Jue.\u003c/p\u003e\n\u003cp\u003eThen the two parted at Golden Woods Island, each going their separate ways.\u003c/p\u003e\n\u003cp\u003e~End of Chapter 61~\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-11-chapter-60\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-11-chapter-62\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/stellar-transformations/st-book-11-chapter-61","bookId":1510,"creation":"Sep 10, 2019 6:01:28 AM","modification":"Sep 10, 2019 6:01:28 AM"}
