{"id":57185,"no":77,"title":"Book 4 Chapter 7","content":"\u003cp\u003e\u003cstrong\u003eB4C7: Going home\u003c/strong\u003e\u003c/p\u003e\n\u003cp\u003eQin Yu is struck by a thought. He immediately makes that gaseous energy go back into his body. It was created by him via practice so he can control it with ease.\u003c/p\u003e\n\u003cp\u003eSuddenly --\u003c/p\u003e\n\u003cp\u003eA hint of ecstasy appears on his face, an extreme ecstasy.\u003c/p\u003e\n\u003cp\u003eA moment ago, when that idea sprang to his mind and he made that gaseous purple energy return to his body, the purple energy naturally came back inside him according to his thoughts. In the beginning he concentrated all of his purple energy in his dantian so this time he also moved the gaseous purple energy back into the dantian.\u003c/p\u003e\n\u003cp\u003eThe centrifugal force in Qin Yu’s strange dantian caused this purple energy to rotate about then spread out again.\u003c/p\u003e\n\u003cp\u003eA cycle!\u003c/p\u003e\n\u003cp\u003eA nearly perfect cycle!\u003c/p\u003e\n\u003cp\u003eA nebular maelstrom appears in his dantian. The purple energy inside his body continuously goes into it, rotates about by the effect of the centrifugal force then spreads out again according to the spin of the nebula.\u003c/p\u003e\n\u003cp\u003eThe energy goes outside through his flesh and bones from the dantian then enter the dantian again by going through the flesh and bones.\u003c/p\u003e\n\u003cp\u003eIt is a perfect cycle.\u003c/p\u003e\n\u003cp\u003eBecause his dantian automatically generates the centrifugal force, a nebular maelstrom has been created in it.\u003c/p\u003e\n\u003cp\u003e“Ha-ha, Heaven is helping me. My strange dantian isn’t a bad thing. Instead … instead it’s extremely good.” Qin Yu suddenly opens his eyes. They have been filled with ecstasy. At the moment he basically does not have to worry about the control of the energy inside his body.\u003c/p\u003e\n\u003cp\u003eNow he is extremely excited.\u003c/p\u003e\n\u003cp\u003e“Nebula, this nebula’s rotation is near perfect, even better than the rotation that Master figured out. Ha-ha … this, this is really …” Qin Yu is so excited that he is inarticulate. Anyone who knows the contents of the Stellar Transformations would understand the significance of having a nebula whose rotation is even closer to the Way of Nature than described in the book.\u003c/p\u003e\n\u003cp\u003eQin Yu takes a deep breath to calm down then sits down with legs crossed and starts to focus on practicing.\u003c/p\u003e\n\u003cp\u003eEven though he can automatically practice without control, if he concentrates on practicing like this, he will progress even faster.\u003c/p\u003e\n\u003cp\u003eThe gaseous purple energy spread out of Qin Yu’s body fills the area within 3 m of him. This purple cloud rotates unceasingly. It looks as if his whole body is enveloped in a purple cloud. This purple cloud absorbs stellar energy in nature then rushes into his flesh and bones.\u003c/p\u003e\n\u003cp\u003eWhen the stellar energy of the cloud pierces through the muscles and bones, part of it gets absorbed. At the same time, the flesh and bones are refined. Then this stellar-energy-charged cloud returns to the dantian. When it rushes through the nebular maelstrom in the dantian, most of its energy is gobbled up. The purple cloud then spreads out again.\u003c/p\u003e\n\u003cp\u003eIn every cycle, Qin Yu absorbs the stellar energy to refine his mucles and bones and makes the energy in the nebula become even more powerful.\u003c/p\u003e\n\u003cp\u003eCycle after cycle, Qin Yu totally immerses himself in that wonderful feeling. Gradually, after an indeterminately long duration, the purple cloud slowly gets lighter and lighter in color. But its energy has become even more and more refined. Qin Yu has been practicing wholeheartedly for a whole month.\u003c/p\u003e\n\u003cp\u003eAfter a more than a month,\u003c/p\u003e\n\u003cp\u003eNow there is an indistinct light-colored cloud in Qin Yu’s vicinity, which continuously absorbs stellar energy. After being refined by stellar energy throughout this over a month period, Qin Yu’s body has become even more similar to jade or diamond.\u003c/p\u003e\n\u003cp\u003eIn his dantian,\u003c/p\u003e\n\u003cp\u003eThere is a perfect nebula. This nebula is made up by various silvery grains. These silvery grains spread throughout the dantian. They are the essense of the vast amount of stellar energy that has been absorbed by Qin Yu, and also his source of energy.\u003c/p\u003e\n\u003cp\u003eBy contrast, in the center of the nebula, there is a light blue flame.\u003c/p\u003e\n\u003cp\u003eQin Yu, who has been sitting with legs crossed, suddenly open his eyes and stops practicing. The silvery energy flows into his body in an instant. The nebula, affected by the force of the dantian, is still slowly spining, only that it is merely refining its energy.\u003c/p\u003e\n\u003cp\u003e“A light blue flame, indeed, by practicing the Stellar Transformations I’ve obtained the Stellar Flame. It’s pretty stronger than the Samadhi Flame.” Qin Yu suddenly stands up.\u003c/p\u003e\n\u003cp\u003eAll Xiuzhenists have a flame in their bodies. Generally, Xiuxianists call it the Samadhi Flame, Xiumoists call it the Devilish Flame and Xiuyaoists call it the Demonic Flame. However, because the Stellar Transformations is not Xiuxian, Xiumo or Xiuyao, the flame inside the body of the practitioner is called the Stellar Flame.\u003c/p\u003e\n\u003cp\u003eQin Yu goes to the entrance of the Training Hall. It opens automatically at once.\u003c/p\u003e\n\u003cp\u003eA black silhouette instantly appears beside him lightly like a cloud. It is none other than Xiao Hei. For the last over 1 month, Xiao Hei has been all by himself and has been worried about Qin Yu. He was wondering why Qin Yu’s closed-door training session had been going on for over a month. Only now can he put his own mind at rest after seeing Qin Yu go out.\u003c/p\u003e\n\u003cp\u003e“Big brother,” Xiao Hei’s eyes have a hint of delight.\u003c/p\u003e\n\u003cp\u003eQin Yu says smilingly: “Xiao Hei, follow me.”\u003c/p\u003e\n\u003cp\u003e“To where?” Xiao Hei asks doubtfully. Qin Yu says nothing and immediately goes in another direction. Xiao Hei goes after him. Qin Yu heads directly for the Weapon Forging Chamber on the 1st floor of Lei Mountain House.\u003c/p\u003e\n\u003cp\u003eThe door of the Weapon Forging Chamber automatically opens.\u003c/p\u003e\n\u003cp\u003e“Big brother, you want to forge weapons?” Now Xiao Hei totally understands.\u003c/p\u003e\n\u003cp\u003eQin Yu says with a smile: “Yes, when I found the In-rock Flaming iron chunk, Uncle Feng’s Samadhi flame wasn’t powerful enough so he was only able to make middle-grade holy weapons. Actually, In-rock Flaming iron can be used to forge high-grade holy weapons. I also have some high-class crystals so I can merge them with each other and reforge my Flaming Gloves and Flaming Sword once.”\u003c/p\u003e\n\u003cp\u003e“High-class crystals? Big brother, you’ve got high-class crystals?” Xiao Hei’s pleasantly surprised voice rises in Qin Yu’s mind.\u003c/p\u003e\n\u003cp\u003eQin Yu slightly nods then says with a smile: “What’s the matter? Do you want some too?”\u003c/p\u003e\n\u003cp\u003eXiao Hei nods repeatedly and says via his holy sense: “In my hereditary memories there is a forging method using the Demonic Flame. Too bad I don’t have any good crystals. That storeroom’s top-class crystals can only be seen. I don’t know where you got these high-class crystals from?”\u003c/p\u003e\n\u003cp\u003e“Alright, how many chunks do you want?” With a thought, he knows everything about the crystals in the Menghuan ring.\u003c/p\u003e\n\u003cp\u003eIn this spatial ring there are many middle-class crystals and some high-class crystals. Even though the number of high-class crystals is not large, there are still 10-odd of them and each one is relatively big, about the size of the In-rock Flaming iron chunk.\u003c/p\u003e\n\u003cp\u003e“One is enough. Big brother, can you let me choose? I want one whose nature contains electricity,” says Xiao Hei.\u003c/p\u003e\n\u003cp\u003eQin Yu makes a wave of a hand. 10-odd chunks of high-class crystals instantly appear in the Weapon Forging Chamber. Xiao Hei’s interest is quickly caught by a blue crystal. He immediately pulls it over to him using telekinesis then unexpectedly swallows it at one stroke.\u003c/p\u003e\n\u003cp\u003e“Big brother, you stay here to forge your weapons, I’ll find some place to forge mine.” Xiao Hei says laughingly via his holy sense.\u003c/p\u003e\n\u003cp\u003eQin Yu nods then picks out 2 chunks of high-class crystals, one golden and the other shiny black. After being refined by the Stellar Flame, the Flaming Gloves and Flaming Sword have become too small for him because many of their impurities have been removed.\u003c/p\u003e\n\u003cp\u003eMoreover, the fire nature of In-rock Flaming iron is not very good. When merged with the 2 metal-natured and darkness-natured crystals, the Flaming Gloves and Flaming Sword will become much harder and their radiance will dim. They will even be capable of absorption.\u003c/p\u003e\n\u003cp\u003e“Master already set up so many formations in the Weapon Forging Chamber. It’ll be much easier for me to forge weapons.” Qin Yu points with a hand while smiling. The Flaming Sword and Flaming Gloves instantly fly to the immediate area above the Weapon-Forging 8 Diagrams Furnace from his body.\u003c/p\u003e\n\u003cp\u003eAt the same time, a light blue flame flies out from inside his body then floats into the 8 Diagrams Furnace. In an instant, the furnace is set ablaze.\u003c/p\u003e\n\u003cp\u003e“Heavenly Gate, 8 Diagrams, Orthodox!”\u003c/p\u003e\n\u003cp\u003eQin Yu’s hand shoots out several indistinct light silvery streams of stellar energy into the several small holes of the 8 Diagrams Furnace. In an instant, the 8-Diagrams Furnace brightens and radiates various rays of light, forming a mysterious written talisman. The temperature of the light blue flame suddenly rises --\u003c/p\u003e\n\u003cp\u003eQin Yu gives a smile. The Stellar Flame has 2 forms. Through controlling the formation, he can turn it into the Ultra-yang Flame or the Ultra-yin Flame.\u003c/p\u003e\n\u003cp\u003e“Chi chi ~~~” At the moment, the Stellar Flame is in its Ultra-yang form. In a short while, the Flaming Gloves and Flaming Sword have been melted. At the same time, their impurities have also been continuously burnt out. Naturally, their sizes have shrunk a lot. Qin Yu points with a hand and the 2 chunks of high-class crystals also fly into the furnace.\u003c/p\u003e\n\u003cp\u003eAgain the Ultra-yang Flame melts these 2 chunks of high-class crystals. When it has burnt up all their impurities, the crystals have become 4 or 5 times smaller.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eQin Yu remembers that the most basic forging method of the Stellar Transformations book is to use the Ultra-yang Flame to melt the materials and remove their impurities then to use the Ultra-yin Flame to mold them into objects. Even though this is the simplest method, it muddles him up, mostly because controlling the strength and timing of the flame is extremely difficult.\u003c/p\u003e\n\u003cp\u003e“Earthly Gate, 8 Diagrams, Reverse!”\u003c/p\u003e\n\u003cp\u003eAfter several light silvery streams of stellar energy are shot into the several holes of the furnace, the 8-Diagrams Furnace radiates a different light. In an instant, the temperature of the Stellar Flame seems to have dropped sharply. Now it looks ice-blue from the outside.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eAfter forging for a long time, the Flaming Gloves and Flaming Sword are finally formed again. Qin Yu only carves 2 formations into them, one being offensive and the other being defensive.\u003c/p\u003e\n\u003cp\u003eHe saw these 2 formations in a secret book in the study.\u003c/p\u003e\n\u003cp\u003e“I’ve got too little knowledge of the Art of Formation. According to that secret book, formidable experts can carve 9 offensive formations into a flying sword without a break, forming a cycle that is extremely powerful.” Qin Yu thinks to himself. If Fengyuzi knew what Qin Yu is thinking, he would probably feel ashamed to death.\u003c/p\u003e\n\u003cp\u003eThe Xiuzhen secret books Qin Yu has read are some top-class secret books in the Xiuzhen world collected by Lei Wei in the past. The 2 formations he just carved into his weapons both are extremely profound and secret.\u003c/p\u003e\n\u003cp\u003eWhen Fengyuzi forged these weapons for Qin Yu, he only set up a very crude offensive formation on them.\u003c/p\u003e\n\u003cp\u003eThe Flaming Gloves and Flaming Sword are floating before Qin Yu.\u003c/p\u003e\n\u003cp\u003eNow these weapons have become dark golden, and have also become high-grade holy weapons. The Flaming Sword is about the same size as a common flying sword. Because it can be used both as a short sword and as a flying sword, it is extremely handy.\u003c/p\u003e\n\u003cp\u003e.....\u003c/p\u003e\n\u003cp\u003e7 months have passed. Tomorrow is the day the Qin clan has decided to go to war on. In a military base near the Black Water mountain range, the 4 marshals, Qin De and Qin Zheng have gathered together.\u003c/p\u003e\n\u003cp\u003eQin De and Qin Zheng are dressed in brocade clothes while the 4 marshals -- Qin Feng, Jiang Tao, Fu Bing and Fan Yu -- are wearing battledress.\u003c/p\u003e\n\u003cp\u003e“Gentlemen, my Qin clan has been preparing for several hundred years for the eruption tomorrow. The 1st battle will be fought by you. Lei Xue County of the 4 Western region counties must be taken in 1 battle.” Qin De says emphatically while staring at the 4 marshals.\u003c/p\u003e\n\u003cp\u003eMarshal Fan Yu is the only woman among the 4 marshals. She also has another identity -- the leader of the Black Water mountain range bandits.\u003c/p\u003e\n\u003cp\u003e“Don’t worry, Your Highness. The Black Water mountain range has been saving for several hundred years only for this one day. As soon as an order is given, 300,000 troops will attack Lei Xue County directly,” says Marshal Fan Yu firmly. They have been occupying the Black Water mountain range for several hundred years to wait for this day.\u003c/p\u003e\n\u003cp\u003eThey have told people on the ouside that they have 200,000 bandits but in fact it is 300,000.\u003c/p\u003e\n\u003cp\u003e“There’s no need to hurry, Marshal Fan Yu. This battle must be won so I’ll let the other 3 marshals to advance together with you. 300,000 troops of the Qin clan and 300,000 Black Water troops amount to 600,000. They will win the 1st battle like a dike-bursting flood.” Qin De’s eyes glitter.\u003c/p\u003e\n\u003cp\u003eQin Feng says: “Don’t worry, father. That Lei Xue County only has 200,000 troops and they are even stationed in the cities so it will be very easy for us to attack. We only have to keep a watchful eye on the Mu clan of the 3 Southern region counties because Lei Xue County is next to the Mu clan.”\u003c/p\u003e\n\u003cp\u003e“Marshal Qin Feng, we have 600,000 troops. Those 3 Southern region counties only have 600,000 troops and they have to defend those 3 counties so they won’t pose a threat to us.” Marshal Jiang Tao says smilingly.\u003c/p\u003e\n\u003cp\u003eQin Zheng on one side says with a smile: “Marshals, my father has made this arrangement also to issue a threat to the 3 Southern region counties and the 4 Western region counties. With an army group of 600,000 troops, it will be very difficult for those 2 forces to defeat you.”\u003c/p\u003e\n\u003cp\u003e“All right, I’m going to depend on you for the 1st battle.” Qin De says with a loud laugh.\u003c/p\u003e\n\u003cp\u003eThe 4 marshals are also full of confidence. These top military figures then start to discuss with each other in a relaxed manner.\u003c/p\u003e\n\u003cp\u003e“Oh, Marshal Qin Feng seems to have reached the late phase of the Xiantian level. Marshal Qin Feng, you’re not 28 yet, aren’t you?” With brightening eyes, Marshal Jiang Tao says in amazement.\u003c/p\u003e\n\u003cp\u003eQin Feng nods smilingly.\u003c/p\u003e\n\u003cp\u003e“Marshal Qin Feng is indeed very formidable. You’ve reached the late phase of the Xiantian level before turning 28. Among young men on the Qian Long continent, perhaps you’re the leader.” Fu Bing says with a smile. Fan Yu on one side also stares at Qin Feng with brightening eyes.\u003c/p\u003e\n\u003cp\u003e“Leader?” Qin Feng shakes his head with a forced smile.\u003c/p\u003e\n\u003cp\u003eQin De and Qin Zheng heave a sigh. Qin Zheng says while looking at the marshals: “My 3rd brother reached the Xiantian level in external practice at the age of 18. Moreover, he even reached the peak of the Xiantian level. Even the famous Conqueror of West Chu was far inferior to him!”\u003c/p\u003e\n\u003cp\u003eAt the moment Qin Zheng is indignant.\u003c/p\u003e\n\u003cp\u003eHis 3rd brother was a genius. It is unfair that he died so young and, even worse, died as a total unknown.\u003c/p\u003e\n\u003cp\u003e“External practice? The peak of the Xiantian level? 18 years old?” The marshals’ eyes pop out of their heads. It is common knowledge that no one on the Qian Long continent has ever reached the Xiantian level through external practice so naturally they find it hard to believe that an 18 year old young man reached such a level.\u003c/p\u003e\n\u003cp\u003e“Where is 3rd Prince?” Fan Yu asks curiously.\u003c/p\u003e\n\u003cp\u003e“To save me, Yu’er continuously killed 5 peak-Xiantian experts then perished together with Shangxian Wu Xing of the Xiang clan!” says Qin De. As soon as these marshals hear that, they all take a cold breath and look at each other speechlessly.\u003c/p\u003e\n\u003cp\u003e……\u003c/p\u003e\n\u003cp\u003eIn the Wilderness,\u003c/p\u003e\n\u003cp\u003e“Xiao Hei, get ready. We’ll go back at once.” Standing outside Lei Mountain House, Qin Yu shouts loudly to Xiao Hei. Then he mumbles to himself: “It’s been 7 months. I wonder how father and brothers are doing. Perhaps they still don’t know I’m living.”\u003c/p\u003e\n\u003cp\u003eThinking about this, Qin Yu becomes even more eager to go home.\u003c/p\u003e\n\u003cp\u003eHaving reached the Nebula stage of the Stellar Transformations and forged 2 high-class holy weapons, he already has enough power to go back through the Wilderness and, therefore, is impatient to go back.\u003c/p\u003e\n\u003cp\u003eEnd of b4c7.\u003c/p\u003e\n\u003cp\u003e\u003c/p\u003e\n\u003chr\u003e\n\u003cp\u003e\u003c/p\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-4-chapter-6\" class\u003d\"chapter-nav\"\u003e Previous Chapter \u003c/a\u003e \n\u003ca href\u003d\"/novel/stellar-transformations/st-book-4-chapter-8\" class\u003d\"chapter-nav\"\u003e Next Chapter \u003c/a\u003e","sourceLink":"https://www.wuxiaworld.com/novel/stellar-transformations/st-book-4-chapter-7","bookId":1510,"creation":"Sep 10, 2019 6:01:27 AM","modification":"Sep 10, 2019 6:01:27 AM"}
