{"id":21987,"no":32,"title":"CHAPTER XXXII. EL PALO QUEMADO.","content":"The adventurer as we said, left the palace, the Plaza Mayor was deserted, the popular effervescence had calmed down as rapidly as it had risen: by the entreaties of certain influential persons, the troops had returned to their quarters: the leperos and other citizens equally respectable, who formed the majority of the insurgent mob, seeing that decidedly there was nothing to be done, and that the victims whom they coveted were effectually escaping from them, after a few cries and yells raised as a consolation, dispersed in their turn, and returned to the more or less ill-famed dens, always open in the low quarters of the city, and where they were sure of finding a shelter.\n\u003cbr\u003e \n\u003cbr\u003e López alone remained firm at his post. The adventurer had ordered him to wait for him at the palace gate, and he did so. Still, as the night was dark, and the most profound obscurity had succeeded the radiant illumination of the evening, he waited with his hand on his weapons, with ears and eyes on the watch, lest, in spite of the vicinity of the palace, he might be surprised and robbed by some night prowler, who would not have been sorry of the windfall if the peon had not thus kept good guard. When López saw the palace gate opened, he understood that it could only be his master who thus came out alone, and he went up to him.\n\u003cbr\u003e \n\u003cbr\u003e \"Anything new?\" the adventurer asked, as he put his foot in the stirrup.\n\u003cbr\u003e \n\u003cbr\u003e \"Not much,\" he answered.\n\u003cbr\u003e \n\u003cbr\u003e \"Are you sure?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Pretty well; still, now that I reflect, I fancy I just now saw someone I know leaving the palace.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Ah! Was it long ago?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, a quarter of an hour or twenty minutes at the most; but I am afraid I was mistaken, for he wore a costume so different from that in which I knew him, and then I had but such a slight opportunity of looking at him.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well! Whom did you fancy you recognized?\"\n\u003cbr\u003e \n\u003cbr\u003e \"You will not believe me if I tell you it was don Antonio de Cacerbar, my old patient.\"\n\u003cbr\u003e \n\u003cbr\u003e \"On the contrary, for I also saw him in the palace.\"\n\u003cbr\u003e \n\u003cbr\u003e \"?Ah demonio! In that case I regret that I did not listen to his conversation.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What conversation—when, with whom? Speak or choke: come, will you explain yourself?\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will do so, mi amo: when he left the palace there were still some groups on the plaza; a man quitted one of these groups and approached don Antonio.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Did you recognize the man?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, no, for he had a broad brimmed Vienna hat pulled down over his eyes, was wrapped up to the nose in a large cloak, and moreover, it was not much lighter than at this moment.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Come to facts,\" the adventurer exclaimed impatiently.\n\u003cbr\u003e \n\u003cbr\u003e \"These two men began conversing in a low voice.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And did you hear nothing?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, only a few unconnected words, that was all.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Repeat them, at any rate.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Willingly: \u0027So he was there,\u0027 one of them said. I did not hear the other\u0027s answer. \u0027Bah! He would not dare,\u0027 the first continued: then they talked so low that I could not hear anything; the first said presently, \u0027We must go:\u0027 \u0027It is very late,\u0027 the other objected. I only heard the two words—\u0027Palo Quemado\u0027: then, after exchanging a few whispered words, they separated; the first at once disappeared under the portales: as for don Antonio, he turned to the right as if intending to go to the Paseo de Bucareli; but he will have stopped at some house, for it is not probable that at such an hour he should dream of walking alone at a place of that description.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That we will very soon find out,\" the adventurer remarked as he mounted; \"give me my reins and follow me: the horses are not tired?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No, they are quite fresh,\" López said, as he handed the adventurer a double-barrelled gun, a brace of revolvers, and a machete; \"by your orders I went to the corral, where I left our tired horses, I saddled Mono and Zopilote, now here, and returned to wait for you.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You have done well—let us be off.\"\n\u003cbr\u003e \n\u003cbr\u003e They rode away, crossed the deserted square, and after a few turnings, made doubtless with the intention of throwing out any spies who might be watching their movements, they at length went in the direction of Bucareli. In Mexico, after nightfall it is forbidden for anyone to ride along the streets, unless he holds a special permission very difficult to obtain; the adventurer, however, seemed to trouble himself very slightly about this prohibition, and indeed his boldness was perfectly justified by the apparent indifference of the celadores, a good number of whom they met on their passage, and who allowed them to gallop as they pleased, without venturing the slightest protest.\n\u003cbr\u003e \n\u003cbr\u003e When the two riders found themselves sufficiently distant from the palace no longer to fear pursuit, each drew a black half mask from his pocket, and put it on his face; this precaution taken against any idlers who might recognize them in spite of the darkness, they resumed their ride. They soon reached the entrance of the Paseo de Bucareli; the adventurer stopped, and after striving to sound the gloom with a piercing glance, he gave a shrill and prolonged whistle. At once a shadow emerged from a gateway, where it was perfectly concealed, and advanced into the middle of the road; on reaching it, this shadow, or this man halted, and waited without saying a word.\n\u003cbr\u003e \n\u003cbr\u003e \"Has anyone passed here during the last three-quarters of an hour?\" the adventurer said.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes, and no,\" the stranger answered laconically.\n\u003cbr\u003e \n\u003cbr\u003e \"Explain yourself.\"\n\u003cbr\u003e \n\u003cbr\u003e \"A man came, stopped before the house there on your right, and rapped his hands twice; at the end of a moment a door opened, a peon came out leading a horse by the bridle, and holding a cloak lined with red under his arm.\"\n\u003cbr\u003e \n\u003cbr\u003e \"How did you see that on this dark night?\"\n\u003cbr\u003e \n\u003cbr\u003e \"The peon carried a lanthorn; the man to whom I allude reproached him for his imprudence, smashed the lanthorn under his heel, and then threw the cloak over his shoulders.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What dress did this man wear?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That of a cavalry general officer.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, what next?\"\n\u003cbr\u003e \n\u003cbr\u003e \"He handed his plumed hat to the peon; the latter entered the house, from which he came out a moment after with a Vienna hat, pistols, and a gun; he put spurs on the officer, who seized the weapons, mounted his horse, and departed.\"\n\u003cbr\u003e \n\u003cbr\u003e \"In what direction?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That of the Plaza Mayor.\"\n\u003cbr\u003e \n\u003cbr\u003e \"And the peon?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Re-entered the house.\"\n\u003cbr\u003e \n\u003cbr\u003e \"You are sure you were not seen by either?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Quite.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That will do: watch—good-bye.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Adieu!\" and he returned to his dark post.\n\u003cbr\u003e \n\u003cbr\u003e The adventurer and his peon turned round; they soon found themselves again on the Plaza Mayor, but crossed it without stopping. Don Jaime seemed to know what directions he should follow, for he galloped without hesitation through the streets; he soon reached the garita of San Antonio, which he passed without stopping: some market gardeners were already beginning to enter the city. On arriving about six hundred paces from the garita, at a spot forming a square, the centre of which is occupied by a stone cross, and from which six wide but badly kept roads radiate, the adventurer halted again, and as on the first occasion, gave a shrill whistle. At the same instant, a man lying at the foot of the cross, rose and stood motionless before him.\n\u003cbr\u003e \n\u003cbr\u003e \"A man has passed here,\" don Jaime said, \"mounted on a skewbald horse, and wearing a hat with a gold golilla?\"\n\u003cbr\u003e \n\u003cbr\u003e \"The man has passed,\" the stranger answered.\n\u003cbr\u003e \n\u003cbr\u003e \"How long ago?\"\n\u003cbr\u003e \n\u003cbr\u003e \"An hour.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Was he alone?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Yes.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Which direction did he take?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That,\" the stranger answered, stretching out his arm toward the second road on the left.\n\u003cbr\u003e \n\u003cbr\u003e \"That will do.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Shall I follow?\"\n\u003cbr\u003e \n\u003cbr\u003e \"Where is your horse?\"\n\u003cbr\u003e \n\u003cbr\u003e \"In a corral near the garita.\"\n\u003cbr\u003e \n\u003cbr\u003e \"It is too far, I have no time to wait; farewell, watch.\"\n\u003cbr\u003e \n\u003cbr\u003e \"I will watch.\"\n\u003cbr\u003e \n\u003cbr\u003e And he lay down again at the foot of the cross.\n\u003cbr\u003e \n\u003cbr\u003e The two horsemen resumed their journey.\n\u003cbr\u003e \n\u003cbr\u003e \"He is really going to the Palo Quemado,\" the adventurer muttered; \"we shall find him there.\"\n\u003cbr\u003e \n\u003cbr\u003e \"That is probable,\" López said with the utmost coolness.\n\u003cbr\u003e \n\u003cbr\u003e \"It is strange that I did not guess that sooner, for it is easy enough.\"\n\u003cbr\u003e \n\u003cbr\u003e They galloped for about an hour without exchanging a syllable; at length they perceived a short distance from them a dark mass, whose black outline stood out from the less dense obscurity of the surrounding country.\n\u003cbr\u003e \n\u003cbr\u003e \"Here is the Palo Quemado,\" don Jaime said.\n\u003cbr\u003e \n\u003cbr\u003e \"Yes,\" was all that López answered.\n\u003cbr\u003e \n\u003cbr\u003e They advanced a few paces, and then stopped. All at once a dog began barking furiously.\n\u003cbr\u003e \n\u003cbr\u003e \"?Demonio!\" don Jaime exclaimed; \"We must pass, or that accursed animal will betray us.\"\n\u003cbr\u003e \n\u003cbr\u003e They spurred their horses, and darted past at full speed. At the end of a few minutes the dog, whose barking had changed into hoarse growls, was quite silent. The horsemen stopped, and don Jaime dismounted.\n\u003cbr\u003e \n\u003cbr\u003e \"Hide the horses somewhere in the vicinity,\" he said, \"and wait for me.\"\n\u003cbr\u003e \n\u003cbr\u003e López made no answer, the worthy man was not given to talking, and did not care to lavish his words unnecessarily. The adventurer, after inspecting his weapons with the great care so as to be sure, in the probable event of his being obliged to use them, that they would not fail him, lay down on the ground like an Indian of the savannahs, and by an undulating, slow, and almost insensible movement, approached the rancho of the Palo Quemado.\n\u003cbr\u003e \n\u003cbr\u003e When he was only a short distance from the rancho he saw what he had not noticed before, that some ten or a dozen horses were tied up in front of the house, and that several men were lying on the ground asleep near them. An individual, armed with a long lance, was standing motionless before the door, a sentinel, doubtless, posted there to watch over the general safety.\n\u003cbr\u003e \n\u003cbr\u003e The adventurer stopped, the situation was a difficult one; the individuals, whoever they might be assembled in the rancho, had neglected no precautions in the event of an attempt being made to surprise them. Still, the greater the difficulties appeared, the more did the adventurer comprehend the importance of the secret he wished to surprise; hence, his hesitation was short, and he resolved, however great the risks he might run, to learn who were the members of this clandestine meeting, and for what motive they were assembled. The reader is sufficiently acquainted with the adventurer, whom we have introduced to him under so many names, to guess that now his resolution was formed to push on, he would not hesitate to do so.\n\u003cbr\u003e \n\u003cbr\u003e This was really what happened: he merely redoubled his prudence and precautions, advancing inch by inch as it were, and crawling along the ground with the silent elasticity of a reptile. Instead of proceeding directly to the rancho he went round it, in order to assure himself that, with the exception of the sentry at the door, he had no fear of being discovered by any watchman concealed at the rear of the building. As the adventurer had foreseen, the rancho was only guarded in front. He rose and examined the neighbourhood as far as the darkness permitted it. A rather large corral, enclosed by a quickset hedge, joined the house: this corral appeared deserted. Don Jaime sought an opening through which he could step into the interior; after groping for a few minutes he discovered one wide enough to admit his passing. He went in.\n\u003cbr\u003e \n\u003cbr\u003e Now the difficulties were slighter to approach the house; by the hedge he in a few instants almost reached the wall. What astonished him was not having been scented and tracked by the dog which had previously announced his approach so noisily.\n\u003cbr\u003e \n\u003cbr\u003e This is what had happened: disturbed by the barking of the dog, and fearing lest it should reveal by its noise their suspicious presence to the Indians, who at this hour were proceeding to the city for the purpose of selling their wares, the strangers collected in the rancho, trusting in their sentinel to watch over their safety, ordered the ranchero to call the animal into the house, and chain it sufficiently far away that its barking might not be heard outside should it set off again.\n\u003cbr\u003e \n\u003cbr\u003e This excessive prudence on the part of the temporary guests of the rancho permitted the adventurer to approach, not only without being discovered, but also without arousing suspicions. Although he was ignorant of this fact, don Jaime profited by it, thanking Providence in his heart for freeing him from so troublesome a watcher. While attentively examining the wall along which he was moving, he came to a door, which, by some inconceivable negligence, had been left ajar, and yielded to the slight push he gave it. This door opened on a very dark passage, but a slight ray of light which filtered through the badly-joined crack of a door revealed to don Jaime the spot where, in all probability, the strangers were assembled.\n\u003cbr\u003e \n\u003cbr\u003e The adventurer stealthily approached, placed his eye to the crevice, and looked. Three men, folded in thick cloaks, were seated round a table covered with bottles and glasses, in a rather large room, as far as might be judged, and only lighted by one candle placed on a corner of the table. An animated conversation was going on between the three guests, who smoked, drank, and talked like men who feel sure of not being overheard, and, consequently, of having nothing to fear. These three men the adventurer at once recognized: the first was don Felipe Neri Irzabal, the guerillero colonel, the second, don Melchior de la Cruz, and the third, don Antonio de Cacerbar.\n\u003cbr\u003e \n\u003cbr\u003e \"At last,\" the adventurer muttered, with a quiver of joy, \"I am about to know everything.\"\n\u003cbr\u003e \n\u003cbr\u003e And he listened attentively. Don Felipe, who was speaking, seemed to be in an advanced state of intoxication; still, though his speech was thick, he did not wander as yet, but, like all half-drunken people, he was beginning to stray into abstruse arguments, and seemed to be supporting with indomitable doggedness a condition which he wished to impose on his two hearers, and to which they would not consent.\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" he repeated, incessantly, \"it is useless to press me, se?ores, I will not give you the letter you ask of me. I am an honest man, and have only one word, ?voto a brios!\" and at each sentence he struck the table with his fist.\n\u003cbr\u003e \n\u003cbr\u003e \"But,\" don Melchior remarked, \"if you insist on keeping this letter, though you have orders to deliver it to us, it will be impossible for us to carry out the mission with which we are entrusted.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What credit,\" don Antonio added, \"will be given us by the persons with whom we wish to come to an understanding, if we have nothing to prove to them that we are duly authorized to do so?\"\n\u003cbr\u003e \n\u003cbr\u003e \"That does not concern me—each for himself in this world. I am an honest man, and must guard my interests as you do yours.\"\n\u003cbr\u003e \n\u003cbr\u003e \"What you are saying is absurd,\" don Antonio exclaimed, impatiently; \"we risk our heads in this affair.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Possibly, my dear sir; everybody does as he pleases. I am an honest man, I go straight before me. You will not have the letter unless you give me what I ask; give and give, that is all I know. Why did you not warn the general of today\u0027s affair, in accordance with your agreement with him?\"\n\u003cbr\u003e \n\u003cbr\u003e \"We have proved to you that it was impossible, as the sortie was unexpectedly resolved on.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Good, that! You will settle as you can with the General-in-Chief—I wash my hands of it.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Enough of this nonsense,\" don Antonio said, drily; \"will you, or will you not, deliver to this caballero or myself the letter which the President intrusted to you for us?\"\n\u003cbr\u003e \n\u003cbr\u003e \"No,\" don Felipe answered, bluntly, \"unless you give me an order for ten thousand piastres. It is really giving it away, but I am an honest man.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Hum!\" the adventurer muttered to himself, \"An autograph of se?or Benito Juárez is really precious. I would not bargain if he offered it to me.\"\n\u003cbr\u003e \n\u003cbr\u003e \"But,\" don Melchior exclaimed, \"you will commit a scandalous robbery in acting thus.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Well, what then?\" don Felipe said, cynically. \"I rob, you betray, we are well matched, that is all.\"\n\u003cbr\u003e \n\u003cbr\u003e At this insult, so brutally hurled in their teeth, the two men rose.\n\u003cbr\u003e \n\u003cbr\u003e \"Let us go,\" said don Melchior, \"this man is a brute, who will listen to nothing.\"\n\u003cbr\u003e \n\u003cbr\u003e \"The most simple plan is to go to the General-in-Chief,\" don Antonio added, \"he will do us justice, and avenge us on this wretched drunkard.\"\n\u003cbr\u003e \n\u003cbr\u003e \"Go! Go, my dear sirs,\" the guerillero said, with a grin, \"and luck go with you! I keep the letter—perhaps I shall find a purchaser. I am an honest man.\"\n\u003cbr\u003e \n\u003cbr\u003e At this menace the two men exchanged a glance, while laying their hands on their weapons, but after a hesitation, no longer than a lightning flash, they disdainfully left the room. A few minutes after the rapid gallop of several horses could be heard outside.\n\u003cbr\u003e \n\u003cbr\u003e \"They are gone,\" the guerillero muttered, as he poured out a tumbler of mezcal, which he swallowed at a draught: \"they are decamping, on my word, as if the fiend were carrying them off! They are furious. Stuff! I don\u0027t care, I have kept the letter.\"\n\u003cbr\u003e \n\u003cbr\u003e While speaking thus to himself, the guerillero replaced his tumbler on the table. Suddenly he started; a man wrapped up to the eyes in the folds of a thick cloak was standing in front of him. This man held in either hand a revolver, the barrels of which were pointed at the guerillero\u0027s chest. The latter gave a sudden start of terror at this sight, which he was far from expecting.\n\u003cbr\u003e \n\u003cbr\u003e \"Hilloah!\" he exclaimed, in a voice which trembled from emotion and terror, \"Who is this demon, and what does he want? Why, hang it! I have fallen into a wasp\u0027s nest.\"\n\u003cbr\u003e \n\u003cbr\u003e Terror had sobered him; he tried to rise and fly.\n\u003cbr\u003e \n\u003cbr\u003e \"One word, one gesture,\" the stranger said, in a hollow, menacing voice, \"and I blow out your brains.\" The guerillero fell heavily back on the stool he had been sitting on.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1773/51699.html","bookId":1112,"creation":"Aug 2, 2019 2:30:22 PM","modification":"Aug 2, 2019 2:30:22 PM"}
