{"id":42095,"no":1,"title":"PREFACE","content":"\u0026nbsp;Sir Thomas Browne said that Eve was “edified out of the rib of Adam.” This little book was edified (for the most part) out of the ribs of two friendly newspapers, The New York Evening Post and The Philadelphia Evening Public Ledger. To them, and to The Bookman, Everybody\u0027s, and The Publishers\u0027 Weekly, I am grateful for permission to reprint. \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Tristram Shandy said, “When a man is hemm\u0027d in by two indecorums, and must commit one of \u0027em let him chuse which he will, the world will blame him.” Now it is one indecorum to let this collection of small sketches go out (as they do) unrevised and just as they assaulted the defenceless reader of the daily prints; and the other indecorum would be to take fragments of this kind too gravely, and attempt by more careful disposition of their pallid members to arrange them into some appearance of painless decease. As Gilbert Chesterton said (I wish I could say, on a similar occasion): “Their vices are too vital to be improved with a blue pencil, or with anything I can think of, except dynamite.”[Pg viii]\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n These sketches gave me pain to write; they will give the judicious patron pain to read; therefore we are quits. I think, as I look over their slattern paragraphs, of that most tragic hour—it falls about 4 p. m. in the office of an evening newspaper—when the unhappy compiler tries to round up the broodings of the day and still get home in time for supper. And yet perhaps the will-to-live is in them, for are they not a naked exhibit of the antics a man will commit in order to earn a living? In extenuation it may be pleaded that none of them are so long that they may not be mitigated by an accompanying pipe of tobacco.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n THE AUTHOR.\n\u003c/div\u003e \n\u003cdiv\u003e\n \u0026nbsp;\n\u003c/div\u003e \n\u003cdiv\u003e\n Roslyn, Long Island,\n\u003c/div\u003e \n\u003cdiv\u003e\n July, 1920.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/3205/87574.html","bookId":758,"creation":"Aug 11, 2019 5:46:47 AM","modification":"Aug 11, 2019 5:46:47 AM"}
