{"id":107276,"no":15,"title":"Page 15","content":"\u003cp\u003eIf, from a distance of seven thousand parsecs, the fall of Kalgan to the armies of the Mule had produced reverberations that had excited the curiosity of an old Trader, the apprehension of a dogged captain, and the annoyance of a meticulous mayor - to those on Kalgan itself, it produced nothing and excited no one. It is the invariable lesson to humanity that distance in time, and in space as well, lends focus. It is not recorded, incidentally, that the lesson has ever been permanently learned.\u003c/p\u003e\n\u003cp\u003eKalgan was - Kalgan. It alone of all that quadrant of the Galaxy seemed not to know that the Empire had fallen, that the Stannells no longer ruled, that greatness had departed, and peace had disappeared.\u003c/p\u003e\n\u003cp\u003eKalgan was the luxury world. With the edifice of mankind crumbling, it maintained its integrity as a producer of pleasure, a buyer of gold and a seller of leisure.\u003c/p\u003e\n\u003cp\u003eIt escaped the harsher vicissitudes of history, for what conqueror would destroy or even seriously damage a world so full of the ready cash that would buy immunity.\u003c/p\u003e\n\u003cp\u003eYet even Kalgan had finally become the headquarters of a warlord and its softness had been tempered to the exigencies of war.\u003c/p\u003e\n\u003cp\u003eIts tamed jungles, its mildly modeled shores, and its garishly glamorous cities echoed to the march of imported mercenaries and impressed citizens. The worlds of its province had been armed and its money invested in battleships rather than bribes for the first time in its history. Its ruler proved beyond doubt that he was determined to defend what was his and eager to seize what was others. He was a great one of the Galaxy, a war and peace maker, a builder of Empire, an establisher of dynasty.\u003c/p\u003e\n\u003cp\u003eAnd an unknown with a ridiculous nickname had taken him - and his arms - and his budding Empire - and had not even fought a battle.\u003c/p\u003e\n\u003cp\u003eSo Kalgan was as before, and its uniformed citizens hurried back to their older life, while the foreign professionals of war merged easily into the newer bands that descended.\u003c/p\u003e\n\u003cp\u003eAgain as always, there were the elaborate luxury hunts for the cultivated animal life of the jungles that never took human life; and the speedster bird-chases in the air above, that was fatal only to the Great Birds.\u003c/p\u003e\n\u003cp\u003eIn the cities, the escapers of the Galaxy could take their varieties of pleasure to suit their purse, from the ethereal sky-palaces of spectacle and fantasy that opened their doors to the masses at the jingle of half a credit, to the unmarked, unnoted haunts to which only those of great wealth were of the cognoscenti.\u003c/p\u003e\n\u003cp\u003eTo the vast flood, Toran and Bayta added not even a trickle. They registered their ship in the huge common hangar on the East Peninsula, and gravitated to that compromise of the middle-classes, the Inland Sea-where the pleasures were yet legal, and even respectable, and the crowds not yet beyond endurance.\u003c/p\u003e\n\u003cp\u003eBayta wore dark glasses against the light, and a thin, white robe against the heat. Warm-tinted arms, scarcely the goldener for the sun, clasped her knees to her, and she stared with firm, abstracted gaze at the length of her husband\u0027s outstretched body - almost shimmering in the brilliance of white sun-splendor.\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t overdo it,\" she had said at first, but Toran was of a dying-red star, Despite three years of the Foundation, sunlight was a luxury, and for four days now his skin, treated beforehand for ray resistance, had not felt the harshness of clothing, except for the brief shorts.\u003c/p\u003e\n\u003cp\u003eBayta huddled close to him on the sand and they spoke in whispers.\u003c/p\u003e\n\u003cp\u003eToran\u0027s voice was gloomy, as it drifted upwards from a relaxed face, \"No, I admit we\u0027re nowhere. But where is he? Who is he? This mad world says nothing of him. Perhaps he doesn\u0027t exist.\"\u003c/p\u003e\n\u003cp\u003e\"He exists,\" replied Bayta, with lips that didn\u0027t move. \"He\u0027s clever, that\u0027s all. And your uncle is right. He\u0027s a man we could use - if there\u0027s time.\"\u003c/p\u003e\n\u003cp\u003eA short pause. Toran whispered, \"Know what I\u0027ve been doing, Bay? I\u0027m just daydreaming myself into a sun-stupor. Things figure themselves out so neatly - so sweetly.\" His voice nearly trailed off, then returned, \"Remember the way Dr. Amann talked back at college, Bay. The Foundation can never lose, but that does not mean the rulers of the Foundation can\u0027t. Didn\u0027t the real history of the Foundation begin when Salvor Hardin kicked out the Encyclopedists and took over the planet Terminus as the first mayor? And then in the next century, didn\u0027t Hober Mallow gain power by methods almost as drastic? That\u0027s twice the rulers were defeated, so it can be done. So why not by us?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the oldest argument in the books. Torie. What a waste of good reverie.\"\u003c/p\u003e\n\u003cp\u003e\"Is it? Follow it out. What\u0027s Haven? Isn\u0027t it part of the Foundation? If we become top dog, it\u0027s still the Foundation winning, and only the current rulers losing.\"\u003c/p\u003e\n\u003cp\u003e\"Lots of difference between \u0027we can\u0027 and \u0027we will.\u0027 You\u0027re just jabbering.\"\u003c/p\u003e\n\u003cp\u003eToran squirmed. \"Nuts, Bay, you\u0027re just in one of your sour, green moods. What do you want to spoil my fun for? I\u0027ll just go to sleep if you don\u0027t mind.\"\u003c/p\u003e\n\u003cp\u003eBut Bayta was craning her head, and suddenly - quite a non sequitur - she giggled, and removed her glasses to look down the beach with only her palm shading her eyes.\u003c/p\u003e\n\u003cp\u003eToran looked up, then lifted and twisted his shoulders to follow her glance.\u003c/p\u003e\n\u003cp\u003eApparently, she was watching a spindly figure, feet in air, who teetered on his hands for the amusement of a haphazard crowd. It was one of the swarming acrobatic beggars of the shore, whose supple joints bent and snapped for the sake of the thrown coins.\u003c/p\u003e\n\u003cp\u003eA beach guard was motioning him on his way and with a surprising one-handed balance, the clown brought a thumb to his nose in an upside-down gesture. The guard advanced threateningly and reeled backward with a foot in his stomach. The clown righted himself without interrupting the motion of the initial kick and was away, while the frothing guard was held off by a thoroughly unsympathetic crowd.\u003c/p\u003e\n\u003cp\u003eThe clown made his way raggedly down the beach. He brushed past many, hesitated often, stopped nowhere. The original crowd had dispersed. The guard had departed.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a queer fellow,\" said Bayta, with amusement, and Toran agreed indifferently. The clown was close enough now to be seen clearly. His thin face drew together in front into a nose of generous planes and fleshy tip that seemed all but prehensile. His long, lean limbs and spidery body, accentuated by his costume, moved easily and with grace, but with just a suggestion of having been thrown together at random.\u003c/p\u003e\n\u003cp\u003eTo look was to smile.\u003c/p\u003e\n\u003cp\u003eThe clown seemed suddenly aware of their regard, for he stopped after he had passed, and, with a sharp turn, approached. His large, brown eyes fastened upon Bayta.\u003c/p\u003e\n\u003cp\u003eShe found herself disconcerted.\u003c/p\u003e\n\u003cp\u003eThe clown smiled, but it only saddened his beaked face, and when he spoke it was with the soft, elaborate phrasing of the Central Sectors.\u003c/p\u003e\n\u003cp\u003e\"Were I to use the wits the good Spirits gave me,\" he said, \"then I would say this lady can not exist - for what sane man would hold a dream to be reality. Yet rather would I not be sane and lend belief to charmed, enchanted eyes.\"\u003c/p\u003e\n\u003cp\u003eBayta\u0027s own eyes opened wide. She said, \"Wow!\"\u003c/p\u003e\n\u003cp\u003eToran laughed, \"Oh, you enchantress. Go ahead, Bay, that deserves a five-credit piece. Let him have it.\"\u003c/p\u003e\n\u003cp\u003eBut the clown was forward with a jump. \"No, my lady, mistake me not. I spoke for money not at all, but for bright eyes and sweet face.\"\u003c/p\u003e\n\u003cp\u003e\"Well, thanks,\" then, to Toran, \"Golly, you think the sun\u0027s in his eyes?\"\u003c/p\u003e\n\u003cp\u003e\"Yet not alone for eyes and face,\" babbled the clown, as his words hurled past each other in heightened frenzy, \"but also for a mind, clear and sturdy - and kind as well.\"\u003c/p\u003e\n\u003cp\u003eToran rose to his feet, reached for the white robe he had crooked his arm about for four days, and slipped into it.\u003c/p\u003e\n\u003cp\u003e\"Now, bud,\" he said, \"suppose you tell me what you want, and stop annoying the lady.\"\u003c/p\u003e\n\u003cp\u003eThe clown fell back a frightened step, his meager body cringing. \"Now, sure I meant no harm. I am a stranger here, and it\u0027s been said I am of addled wits; yet there is something in a face that I can read. Behind this lady\u0027s fairness, there is a heart that\u0027s kind, and that would help me in my trouble for all I speak so boldly.\"\u003c/p\u003e\n\u003cp\u003e\"Will five credits cure your trouble?\" said Toran, dryly, and held out the coin.\u003c/p\u003e\n\u003cp\u003eBut the clown did not move to take it, and Bayta said, \"Let me talk to him, Torie,\" She added swiftly, and in an undertone, \"There\u0027s no use being annoyed at his silly way of talking. That\u0027s just his dialect; and our speech is probably as strange to him.\"\u003c/p\u003e\n\u003cp\u003eShe said, \"What is your trouble? You\u0027re not worried about the guard, are you? He won\u0027t bother you.\"\u003c/p\u003e\n\u003cp\u003e\"Oh, no, not he. He\u0027s but a windlet that blows the dust about my ankles. There is another that I flee, and he is a storm that sweeps the worlds aside and throws them plunging at each other. A week ago, I ran away, have slept in city streets, and hid in city crowds. I\u0027ve looked in many faces for help in need. I find it here.\" He repeated the last phrase in softer, anxious tones, and his large eyes were troubled, \"I find it here.\"\u003c/p\u003e\n\u003cp\u003e\"Now,\" said Bayta, reasonably, \"I would like to help, but really, friend, I\u0027m no protection against a world-sweeping storm. To be truthful about it, I could use-\"\u003c/p\u003e\n\u003cp\u003eThere was an uplifted, powerful voice that bore down upon them.\u003c/p\u003e\n\u003cp\u003e\"Now, then, you mud-spawned rascal-\"\u003c/p\u003e\n\u003cp\u003eIt was the beach guard, with a fire-red face, and snarling mouth, that approached at a run. He pointed with his low-power stun pistol.\u003c/p\u003e\n\u003cp\u003e\"Hold him, you two. Don\u0027t let him get away.\" His heavy hand fell upon the clown\u0027s thin shoulder, so that a whimper was squeezed out of him.\u003c/p\u003e\n\u003cp\u003eToran said, \"What\u0027s he done?\"\u003c/p\u003e\n\u003cp\u003e\"What\u0027s he done? What\u0027s he done? Well, now, that\u0027s good!\" The guard reached inside the dangling pocket attached to his belt, and removed a purple handkerchief, with which he mopped his bare neck. He said with relish. \"I\u0027ll tell you what he\u0027s done. He\u0027s run away. The word\u0027s all over Kalgan and I would have recognized him before this if he had been on his feet instead of on his hawkface top.\" And he rattled his prey in a fierce good humor.\u003c/p\u003e\n\u003cp\u003eBayta said with a smile, \"Now where did he escape from, sir?\"\u003c/p\u003e\n\u003cp\u003eThe guard raised his voice. A crowd was gathering, popeyed and jabbering, and with the increase of audience, the guard\u0027s sense of importance increased in direct ratio.\u003c/p\u003e\n\u003cp\u003e\"Where did he escape from?\" he declaimed in high sarcasm. \"Why, I suppose you\u0027ve heard of the Mule, now.\"\u003c/p\u003e\n\u003cp\u003eAll jabbering stopped, and Bayta felt a sudden iciness trickle down into her stomach. The clown had eyes only for her-he still quivered in the guard\u0027s brawny grasp.\u003c/p\u003e\n\u003cp\u003e\"And who,\" continued the guard heavily, \"would this infernal ragged piece be, but his lordship\u0027s own court fool who\u0027s run away.\" He jarred his captive with a massive shake, \"Do you admit it, fool?\"\u003c/p\u003e\n\u003cp\u003eThere was only white fear for answer, and the soundless sibilance of Bayta\u0027s voice close to Toran\u0027s ear.\u003c/p\u003e\n\u003cp\u003eToran stepped forward to the guard in friendly fashion, \"Now, my man, suppose you take your hand away for just a while. This entertainer you hold has been dancing for us and has not yet danced out his fee.\"\u003c/p\u003e\n\u003cp\u003e\"Here!\" The guard\u0027s voice rose in sudden concern. \"There\u0027s a reward-\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll have it, if you can prove he\u0027s the man you want. Suppose you withdraw till then. You know that you\u0027re interfering with a guest, which could be serious for you.\"\u003c/p\u003e\n\u003cp\u003e\"But you\u0027re interfering with his lordship and that will be serious for you.\" He shook the clown once again. \"Return the man\u0027s fee, carrion.\"\u003c/p\u003e\n\u003cp\u003eToran\u0027s hand moved quickly and the guard\u0027s stun pistol was wrenched away with half a finger nearly following it. The guard howled his pain and rage. Toran shoved him violently aside, and the clown, unhanded, scuttled behind him.\u003c/p\u003e\n\u003cp\u003eThe crowd, whose fringes were now lost to the eye, paid little attention to the latest development. There was among them a craning of necks, and a centrifugal motion as if many had decided to increase their distance from the center of activity.\u003c/p\u003e\n\u003cp\u003eThen there was a bustle, and a rough order in the distance. A corridor formed itself and two men strode through, electric whips in careless readiness. Upon each purple blouse was designed an angular shaft of lightning with a splitting planet underneath.\u003c/p\u003e\n\u003cp\u003eA dark giant, in lieutenant\u0027s uniform, followed them; dark of skin, and hair, and scowl.\u003c/p\u003e\n\u003cp\u003eThe dark man spoke with the dangerous softness that meant he had little need of shouting to enforce his whims. He said, \"Are you the man who notified us?\"\u003c/p\u003e\n\u003cp\u003eThe guard was still holding his wrenched hand, and with a pain-distorted face mumbled, \"I claim the reward, your mightiness, and I accuse that man-\"\u003c/p\u003e\n\u003cp\u003e\"You\u0027ll get your reward,\" said the lieutenant, without looking at him. He motioned curtly to his men, \"Take him.\"\u003c/p\u003e\n\u003cp\u003eToran felt the clown tearing at his robe with a maddened grip.\u003c/p\u003e\n\u003cp\u003eHe raised his voice and kept it from shaking, \"I\u0027m sorry, lieutenant; this man is mine.\"\u003c/p\u003e\n\u003cp\u003eThe soldiers took the statement without blinking. One raised his whip casually, but the lieutenant\u0027s snapped order brought it down.\u003c/p\u003e\n\u003cp\u003eHis dark mightiness swung forward and planted his square body before Toran, \"Who are you?\"\u003c/p\u003e\n\u003cp\u003eAnd the answer rang out, \"A citizen of the Foundation.\"\u003c/p\u003e\n\u003cp\u003eIt worked-with the crowd, at any rate. The pent-up silence broke into an intense hum. The Mule\u0027s name might excite fear, but it was, after all, a new name and scarcely stuck as deeply in the vitals as the old one of the Foundation - that had destroyed the Empire - and the fear of which ruled a quadrant of the Galaxy with ruthless despotism.\u003c/p\u003e\n\u003cp\u003eThe lieutenant kept face. He said, \"Are you aware of the identity of the man behind you?\"\u003c/p\u003e\n\u003cp\u003e\"I have been told he\u0027s a runaway from the court of your leader, but my only sure knowledge is that he is a friend of mine. You\u0027ll need firm proof of his identity to take him.\"\u003c/p\u003e\n\u003cp\u003eThere were high-pitched sighs from the crowd, but the lieutenant let it pass. \"Have you your papers of Foundation citizenship with you?\"\u003c/p\u003e\n\u003cp\u003e\"At my ship.\"\u003c/p\u003e\n\u003cp\u003e\"You realize that your actions are illegal? I can have you shot.\"\u003c/p\u003e\n\u003cp\u003e\"Undoubtedly. But then you would have shot a Foundation citizen and it is quite likely that your body would be sent to the Foundation - quartered - as part compensation. It\u0027s been done by other warlords.\"\u003c/p\u003e\n\u003cp\u003eThe lieutenant wet his lips. The statement was true.\u003c/p\u003e\n\u003cp\u003eHe said, \"Your name?\"\u003c/p\u003e\n\u003cp\u003eToran followed up his advantage, \"I will answer further questions at my ship. You can get the cell number at the Hangar; it is registered under the name \u0027Bayta\u0027.\"\u003c/p\u003e\n\u003cp\u003e\"You won\u0027t give up the runaway?\"\u003c/p\u003e\n\u003cp\u003e\"To the Mule, perhaps. Send your master!\"\u003c/p\u003e\n\u003cp\u003eThe conversation had degenerated to a whisper and the lieutenant turned sharply away.\u003c/p\u003e\n\u003cp\u003e\"Disperse the crowd!\" he said to his men, with suppressed ferocity.\u003c/p\u003e\n\u003cp\u003eThe electric whips rose and fell. There were shrieks and a vast surge of separation and flight.\u003c/p\u003e\n\u003cp\u003eToran interrupted his reverie only once on their way back to the Hangar. He said, almost to himself, \"Galaxy, Bay, what a time I had! I was so scared-\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" she said, with a voice that still shook, and eyes that still showed something akin to worship, \"it was quite out of character.\"\u003c/p\u003e\n\u003cp\u003e\"Well, I still don\u0027t know what happened. I just got up there with a stun pistol that I wasn\u0027t even sure I knew how to use, and talked back to him. I don\u0027t know why I did it.\"\u003c/p\u003e\n\u003cp\u003eHe looked across the aisle of the short-run air vessel that was carrying them out of the beach area, to the seat on which the Mule\u0027s clown scrunched up in sleep, and added distastefully, \"It was the hardest thing I\u0027ve ever done.\"\u003c/p\u003e\n\u003cp\u003eThe lieutenant stood respectfully before the colonel of the garrison, and the colonel looked at him and said, \"Well done. Your part\u0027s over now.\"\u003c/p\u003e\n\u003cp\u003eBut the lieutenant did not retire immediately. He said darkly, \"The Mule has lost face before a mob, sir. It will be necessary to undertake disciplinary action to restore proper atmosphere of respect.\"\u003c/p\u003e\n\u003cp\u003e\"Those measures have already been taken.\"\u003c/p\u003e\n\u003cp\u003eThe lieutenant half turned, then, almost with resentment, \"I\u0027m willing to agree, sir, that orders are orders, but standing before that man with his stun pistol and swallowing his insolence whole, was the hardest thing I\u0027ve ever done.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/foundation-and-empire-foundation-2/page-15.html","bookId":2018,"creation":"Oct 5, 2019 11:06:30 PM","modification":"Oct 5, 2019 11:06:30 PM"}
