{"id":92410,"no":10,"title":"Page 10","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e\"You made it back.\"\u003c/p\u003e\n\u003cp\u003eI nod. His expression is breaking my heart. He looks weak.\u003c/p\u003e\n\u003cp\u003eHe reaches a hand to mine and squeezes, \"I was worried.\"\u003c/p\u003e\n\u003cp\u003e\"I can take care of myself.\" I don’t even let the bizarre day I\u0027ve had cross my mind. It\u0027s not the moment to stress him out.\u003c/p\u003e\n\u003cp\u003e\"I don’t doubt that. You scare me.\"\u003c/p\u003e\n\u003cp\u003eI laugh. I can\u0027t even help myself. He\u0027s huge and no doubt strong, stronger than he knows. Stronger than me. I try not to think about the young girls in the truck. I am a coward.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m going back to watching.\" Anna is gone suddenly and we are alone. I feel funny about it.\u003c/p\u003e\n\u003cp\u003eHe pulls me up on the couch, \"Come lay with me.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s the first human contact I\u0027ve had in a while. Watching TV with my granny is the closest thing to a snuggle I\u0027ve ever had. I don’t know what to do. I go limp. He laughs.\u003c/p\u003e\n\u003cp\u003eHe pulls me alongside him on the couch. His arm is burning hot. It feels amazing. He wraps his arm around me. I shiver from the heat.\u003c/p\u003e\n\u003cp\u003e\"Tell me a story Emma.\"\u003c/p\u003e\n\u003cp\u003eI pause, I don’t have any. I want to tell him something fun about my childhood but it basically looks just like my life now. Well with more showering.\u003c/p\u003e\n\u003cp\u003e\"I went to the town once a long time ago. The infection was newer then. I ran through the woods and broke the branches to make a path for myself to find the farmhouse again. Just like my dad taught me. I was excited when I saw the gates. I was so stupid. I thought being with other survivors would be better for me. I went in and begged for food from a lady. She laughed at me.\"\u003c/p\u003e\n\u003cp\u003eI feel my air getting trapped in my throat. The shame filling me is my punishment. I deserve it.\u003c/p\u003e\n\u003cp\u003e\"I went out her door and sat in the narrow alley near the back of the houses. I was hidden by a bunch of old buckets and garbage. The lady and her daughter were walking around the back with bags of stuff. Some men came. They started tearing at them. They stripped them and hurt them.\"\u003c/p\u003e\n\u003cp\u003eI choke slightly on my next sentence, \"I ran into the store and stole as much food as I could carry. I ran and gorged myself in the back of her store. I could still hear her screaming and I did nothing. I ate.\"\u003c/p\u003e\n\u003cp\u003eHe squeezes me and kisses the top of my forehead. I stare into his black t-shirt that’s soaked with sweat.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re kind of bad at story telling. I sort of wanted to go to sleep. Now I think I\u0027ll never sleep again.\"\u003c/p\u003e\n\u003cp\u003eI laugh. I laugh with him. It kills the moment of suffering I deserve.\u003c/p\u003e\n\u003cp\u003eHe kisses my forehead again, \"Do you have anything lighter? I don’t want that to be the last thing I think about when I die.\"\u003c/p\u003e\n\u003cp\u003eI laugh again, but this time I want to cry. He\u0027s dying. I know this. Instead of me leaving him, he\u0027s leaving me and it hurts.\u003c/p\u003e\n\u003cp\u003e\"I have one memory of my mother. She was in the hospital bed. I was two years old. She looked like me, dark blonde hair and green eyes but she was really pretty. Her lips always looked like she was pushing them out.\"\u003c/p\u003e\n\u003cp\u003e\"Duck lips.\"\u003c/p\u003e\n\u003cp\u003eI frown, \"What?\"\u003c/p\u003e\n\u003cp\u003eHe laughs, \"They were called duck lips back then.\"\u003c/p\u003e\n\u003cp\u003e\"Oh. Well she had those. She was in the bed and she let me climb up with her. I sat on her lap and we watched TV. It was a cartoon about dragons and some little Mexican kids.\"\u003c/p\u003e\n\u003cp\u003e\"Dragon Tails. I loved that show. LOVE IT.\" He speaks in a high pitch voice.\u003c/p\u003e\n\u003cp\u003eIt makes me smile. He remembers things so clearly.\u003c/p\u003e\n\u003cp\u003eHe nudges me, \"What happened then?\"\u003c/p\u003e\n\u003cp\u003eI shake my head, \"Nothing. We just sat in the sun on her bed. I remember how soft her nightie was and she let me eat her pudding.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah okay that is another bad example of story telling.\"\u003c/p\u003e\n\u003cp\u003eI want to defend myself, but I know it will only make him feel sorry for me.\u003c/p\u003e\n\u003cp\u003eHe smiles, \"Once when I was six, me and Will went and played down by the river behind our house. Our mom was really strict about it and never let us go down there. We figured \u0027cause Will was old enough to baby-sit we were good. We brought boats we made out of newspaper. We went to the edge of the river and pushed the boats in. They floated perfectly until mine flipped over. I reached for it before it got too far away and of course fell in. Will grabbed me before I got pulled away. I would have drowned for sure. We ran back to the house but we were too long getting home and mom was there already. We snuck in the back yard. I thought we were dead, but Will grabbed the hose from the side of the house and sprayed me. Mom came out the back door at that moment. So she walks to the backyard to see Will hosing and me screaming. He got grounded for a week for being a bully. He was the best brother ever.\"\u003c/p\u003e\n\u003cp\u003eA weird feeling overtakes the other feelings I have. I am jealous that I don’t have a single story like that one.\u003c/p\u003e\n\u003cp\u003eI look into his eyes and feel lost. I feel like I\u0027m part of them.\u003c/p\u003e\n\u003cp\u003eHe smirks, \"That is a story, jackass.\"\u003c/p\u003e\n\u003cp\u003eI frown at him.\u003c/p\u003e\n\u003cp\u003eHe lifts my chin and presses his warm lips to mine.\u003c/p\u003e\n\u003cp\u003eI love it.\u003c/p\u003e\n\u003cp\u003eI love him.\u003c/p\u003e\n\u003cp\u003eHis warmth rushes through me. His lips part mine. His tongue caresses my lips softly.\u003c/p\u003e\n\u003cp\u003eHe pulls back, but I want more. I watch him pull away.\u003c/p\u003e\n\u003cp\u003eHe smiles, \"You\u0027re supposed to close your eyes Emma.\"\u003c/p\u003e\n\u003cp\u003eI blush, \"I liked that.\"\u003c/p\u003e\n\u003cp\u003eHe laughs, \"It was on my list of things to do before I die.\"\u003c/p\u003e\n\u003cp\u003eHis words sting.\u003c/p\u003e\n\u003cp\u003eI snarl at him, \"You haven’t ever kissed a girl before?\"\u003c/p\u003e\n\u003cp\u003eHe shakes his head, \"Not a girl I really like.\"\u003c/p\u003e\n\u003cp\u003eI blush harder, \"Your fever is making you crazy.\"\u003c/p\u003e\n\u003cp\u003e\"Good.\" He pulls me back and kisses me until I\u0027m dizzy.\u003c/p\u003e\n\u003cp\u003eChapter Nine\u003c/p\u003e\n\u003cp\u003eThe sunlight coming in the window blinds me, as I wake up disoriented. I shiver from the cold breeze that’s coming from down the hall. I notice I am laying on Jake still. I smile thinking about the night before, but stop when I notice his shirt is soaked in cold sweat. His skin is clammy and cold.\u003c/p\u003e\n\u003cp\u003eTears stream down my cheeks, \"No. No.\" I push on him. His body compresses against my push, but he doesn’t stir.\u003c/p\u003e\n\u003cp\u003e\"Emma what is it?\" Anna comes running in the room.\u003c/p\u003e\n\u003cp\u003eJake sputters and snorts. He rolls over on the couch knocking me off and onto the floor. I start to laugh, \"He\u0027s alive. I thought… He\u0027s cold. Oh my god he\u0027s alive. His fever broke. He\u0027s going to live.\" I jump up and grab the next vial of medication.\u003c/p\u003e\n\u003cp\u003eAnna rushes to his side and feels his face, \"Oh frig, I was scared. I thought for sure he was gonners.\" She hugs me when I come back. She smells like Leo and I smirk. We traded sleeping partners for the night.\u003c/p\u003e\n\u003cp\u003eI hug her back, but notice the difference in our bodies. She is melded into me, squeezing me where as I am rigid.\u003c/p\u003e\n\u003cp\u003eWe give him his next shot and pull the bandages off his leg. The red lines have receded but the wound still looks red and angry. I know we aren’t out of the danger zone, but I feel good knowing that we are one step closer.\u003c/p\u003e\n\u003cp\u003eHe sleeps the entire day and Anna and I hang out. We take turns keeping watch and playing with Leo. I can see his affinity for her is getting stronger. I know even I feel different. I am getting closer to Anna and Jake.\u003c/p\u003e\n\u003cp\u003e\"Em what are we having for dinner?\"\u003c/p\u003e\n\u003cp\u003eI shrug down at her from the window of the barn, \"I can go kill a bird.\"\u003c/p\u003e\n\u003cp\u003eShe nods, \"Alright. I\u0027ll start the fire.\"\u003c/p\u003e\n\u003cp\u003eWe seal up the house completely and cook in the bunker. It\u0027s gross and sweaty with a fire down there, but it makes perfect sense. No smell escapes out into the wind.\u003c/p\u003e\n\u003cp\u003eI climb down with my bow and quiver and head across the grass. I slip into the forest, but instead of finding a tree to climb I freeze. I smell them before I see or hear them. I slide back up against the tree and wait to figure out where the smell is coming from.\u003c/p\u003e\n\u003cp\u003e\"It was rude of you to leave without the escort we offered.\"\u003c/p\u003e\n\u003cp\u003eI turn to the voice but something smacks me in the forehead and everything goes black.\u003c/p\u003e\n\u003cp\u003exxxx\u003c/p\u003e\n\u003cp\u003e\"Wake up.\"\u003c/p\u003e\n\u003cp\u003ePain overwhelms me as I open one of my eyes. I see bars in front of my face.\u003c/p\u003e\n\u003cp\u003e\"Please wake up.\"\u003c/p\u003e\n\u003cp\u003eIn the muted firelight I see a small girl poking me with a stick. It\u0027s made a small bleed on my arm, but that’s not where the pain is coming from. I close my eyes tightly and then open them again. It\u0027s dark. Firelight licks across the dark metal bars of my cage. I turn to small girl. \"Where are we?\"\u003c/p\u003e\n\u003cp\u003e\"The others have us.\" She says.\u003c/p\u003e\n\u003cp\u003eMy stomach falls into my bowels. My heartbeat and breath quicken. I push the door to the cage with my foot. My boots are gone.\u003c/p\u003e\n\u003cp\u003e\"Where are we specifically?\"\u003c/p\u003e\n\u003cp\u003eThe girl frowns at me, \"What?\"\u003c/p\u003e\n\u003cp\u003e\"Our location.\"\u003c/p\u003e\n\u003cp\u003eShe shrugs. She is young and filthy. She makes me think about Anna, which makes me panic. I wonder if they knew Anna and Jake were there. I see my bow and quiver leaning against the tree near me.\u003c/p\u003e\n\u003cp\u003e\"There she is.\"\u003c/p\u003e\n\u003cp\u003eI look up at the filthy scumbag who had chased me to the town. He is grinning again. He seems very proud of himself.\u003c/p\u003e\n\u003cp\u003e\"You are a pretty girl. What\u0027s your name I bet it\u0027s something pretty like Jessica or Stephanie or Grace?\"\u003c/p\u003e\n\u003cp\u003eI lick my lips and put a finger to the source of my pain. He winces as I touch the red sticky spot, \"Sorry \u0027bout that. I had to surprise you. Bet it hurts doesn’t it.\"\u003c/p\u003e\n\u003cp\u003eHe kneels on the ground in front of my cage, \"Wanna tell me about how you got outta that town?\"\u003c/p\u003e\n\u003cp\u003eI gulp.\u003c/p\u003e\n\u003cp\u003eHe rattles the cage suddenly and starts laughing at my horrified expression. \"Jesus you aren’t mute are you? I like it when you girls scream.\" He points to the little girl next to me, \"I guess we can make her scream for you.\"\u003c/p\u003e\n\u003cp\u003eShe shies away from the bars and curls into a small ball. I want him dead. Right now.\u003c/p\u003e\n\u003cp\u003eHe points at me again, \"You\u0027re going to fetch us a good price. I know it.\"\u003c/p\u003e\n\u003cp\u003eFear rocks me. I don’t have a plan. That’s one of my rules. My plans where capture was a possibility have never included a cage. I always thought the girls were grabbed and dragged to trucks.\u003c/p\u003e\n\u003cp\u003eHe walks back to the fire and howls into the night air. I watch as he unzips his pants and pees on the fire.\u003c/p\u003e\n\u003cp\u003e\"Jesus Christ John that’s disgusting. You fucker.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/born-born-1/page-10.html","bookId":1604,"creation":"Oct 5, 2019 5:56:02 PM","modification":"Oct 5, 2019 5:56:02 PM"}
