{"id":92411,"no":11,"title":"Page 11","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eThe hot steam rises from the fire, polluting the air around it. A large group of men start to bitch and complain.\u003c/p\u003e\n\u003cp\u003eI look at the little girl who has a disgusted look on her face, \"I don’t know about you but I don’t want that inside of me.\"\u003c/p\u003e\n\u003cp\u003eI gasp at her language.\u003c/p\u003e\n\u003cp\u003eShe grins at me, \"Name\u0027s Meg.\"\u003c/p\u003e\n\u003cp\u003eShe is a savage. \"Emma but everyone calls me Em.\"\u003c/p\u003e\n\u003cp\u003eI look around for Anna and Jake. I don’t see them anywhere.\u003c/p\u003e\n\u003cp\u003e\"How old are you Meg?\" I ask softly.\u003c/p\u003e\n\u003cp\u003eShe spits on the ground outside of her bars, \"Fifteen.\"\u003c/p\u003e\n\u003cp\u003eShe is malnourished. She will be made to work the farms. She won\u0027t be a breeder.\u003c/p\u003e\n\u003cp\u003eI won\u0027t let either of us end up that way.\u003c/p\u003e\n\u003cp\u003eI see a small silver thing on the ground. I look at her, \"Poke that stick this way again.\"\u003c/p\u003e\n\u003cp\u003eShe slips her skinny arm through the bars and passes it to me.\u003c/p\u003e\n\u003cp\u003eI look back at the men. They are getting drunk and the fire is starting to dim.\u003c/p\u003e\n\u003cp\u003eI flick at the silver thing and drag it back to me with several small movements. It\u0027s an old rusty nail with a silver tip. I reach my fingers through the bars and grab it.\u003c/p\u003e\n\u003cp\u003e\"How old are you?\" She asks watching the men.\u003c/p\u003e\n\u003cp\u003e\"Nineteen, almost twenty.\"\u003c/p\u003e\n\u003cp\u003e\"You look older.\"\u003c/p\u003e\n\u003cp\u003eI want to frown at her, but the nail in my hands feels too amazing to bother. I pass her the nail, \"Pick your lock.\"\u003c/p\u003e\n\u003cp\u003eShe eyes it smiling, \"Wow you\u0027re good.\" She reaches her hands through the bars. She makes a funny face and I hear the clunk of the lock. She picks locks faster than I do. I\u0027ve only ever picked a couple.\u003c/p\u003e\n\u003cp\u003e\"Stay in the cage with the lock open.\"\u003c/p\u003e\n\u003cp\u003eShe nods, \"Momma says we have to do whatever it takes to not be a breeder. I will die before I go there.\"\u003c/p\u003e\n\u003cp\u003eHer words remind me of the girl in the back of the truck who screamed. I feel sick. I am even more determined to save her.\u003c/p\u003e\n\u003cp\u003eThe rusty nail clanks in the lock.\u003c/p\u003e\n\u003cp\u003e\"Want me to do it?\"\u003c/p\u003e\n\u003cp\u003eI give her a look, \"They’ll notice your tiny arm slipping through to my cage.\"\u003c/p\u003e\n\u003cp\u003eI fumble with it again.\u003c/p\u003e\n\u003cp\u003e\"Dipshit is coming back.\" I pull my arm in and sit on the nail.\u003c/p\u003e\n\u003cp\u003eHe grins at me, \"I think I wanna taste the merchandise before I give it away.\"\u003c/p\u003e\n\u003cp\u003eHe pulls a key out of his pants and licks his lips. He gets down on the ground in front of my cage and sticks the key in.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re gonna like this.\"\u003c/p\u003e\n\u003cp\u003eI feel like throwing up.\u003c/p\u003e\n\u003cp\u003eHe opens the door and reaches in lightning fast. His huge hand grabs my thin wrist and clamps down. He drags me from the cage. I kick at him but he\u0027s really strong. He pins me to the ground on my stomach. He pulls my hair and whispers into my ears, \"Scream and I slit your throat.\"\u003c/p\u003e\n\u003cp\u003eHe lets go of my hair with force and shoves my face into the pine needles and dirt. I cough and choke. My eyes flicker at the young girl. She looks terrified.\u003c/p\u003e\n\u003cp\u003e\"Don’t do this in front of her.\" I beg.\u003c/p\u003e\n\u003cp\u003eHe shoves my face in the pine needles again, \"She needs educating. Where you two are going, you\u0027ll both be needing to know how to make a man happy. Think of me as your teacher.\"\u003c/p\u003e\n\u003cp\u003eI feel him grind himself against me. I throw up. I can\u0027t stop myself. I don’t have anything in my stomach but bile fills my mouth. I spit it to the side of my face, fearful he will rub my face in it.\u003c/p\u003e\n\u003cp\u003eHe pulls my pants down. I feel his hands on my underwear. I want to scream and fight but my hands are pinned. If I scream he will kill me. I make a snap decision that death would be better than this. I open my mouth to scream as he puts all his weight on me and covers my mouth.\u003c/p\u003e\n\u003cp\u003e\"Shhh Em. Don\u0027t scream. We need to go now. Before they find him.\"\u003c/p\u003e\n\u003cp\u003eTears spring from my eyes as I look back and see his open eyes still staring at me. The rusty nail sticks out only a little bit from his head, next to his eye. Blood trickles down his face.\u003c/p\u003e\n\u003cp\u003eShe heaves him off of me quietly. The fire is only twenty feet from us and I can see that the group of men has dwindled. They must have gone to sleep. I push myself up and grab my pants. I see my knife in his boot. I take it. I hold it tightly. I want to stab it into him.\u003c/p\u003e\n\u003cp\u003eShe grabs my hand and points to the woods.\u003c/p\u003e\n\u003cp\u003eWe walk hunched over. I grab my bow and quiver and follow her into the forest. We run fast, even though we are bare foot. I recognize the forest after a few moments. Even in the dark I know where we are.\u003c/p\u003e\n\u003cp\u003e\"Oh shit.\"\u003c/p\u003e\n\u003cp\u003eI stop, hearing her speak. I\u0027m ready for the worst and instead it\u0027s the best. I see yellow eyes glowing in the dark. I drop to my knees, ignoring the branch that cuts my knee. His paws are around my neck within seconds. His warm breath is in my hair.\u003c/p\u003e\n\u003cp\u003eI cry. He holds me like a mother would a child and I feel soothed.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s yours?\"\u003c/p\u003e\n\u003cp\u003eI nod through the tears, \"Leo.\"\u003c/p\u003e\n\u003cp\u003eHe pats his ears, \"He\u0027s a big dog.\"\u003c/p\u003e\n\u003cp\u003eI smile, \"He\u0027s a wolf. A timber wolf.\"\u003c/p\u003e\n\u003cp\u003e\"Well we better get moving before they find us.\"\u003c/p\u003e\n\u003cp\u003eI stand and run toward the farmhouse. I know it\u0027s through the woods and not far. We can hide there until they\u0027re gone. My brain can\u0027t seem to make my own survival important. I need to know if Jake and Anna are safe.\u003c/p\u003e\n\u003cp\u003eThe dark shadow of the farmhouse looks like an outline in the open field. I run faster.\u003c/p\u003e\n\u003cp\u003eMeg runs as fast as I do. Her footsteps are a whisper in the grass beside me. I burst through the door. The house is dark and silent.\u003c/p\u003e\n\u003cp\u003e\"Anna, Jake?\" The living room is empty. The blankets are gone. I don’t know where to go. I don’t know where they would go. I run down the basement steps into the bunker. Nothing is there, just my panting breath.\u003c/p\u003e\n\u003cp\u003eI run back up the stairs, \"We need to go hide. They\u0027re gone. They might be looking for me.\"\u003c/p\u003e\n\u003cp\u003e\"Who?\"\u003c/p\u003e\n\u003cp\u003e\"My friends.\" The words feel funny in my mouth.\u003c/p\u003e\n\u003cp\u003eI grab her sweaty fingers in the dark and pull her back out to the barn. We slip inside the dark of the barn. I drop to my knees in the hay and feel for the hatch. It has hay glued to the top of it. It\u0027s impossible to find even in the bright of the day. I only found it because it was open when I arrived.\u003c/p\u003e\n\u003cp\u003eI groan lifting the hatch and whisper, \"Hurry climb down here.\"\u003c/p\u003e\n\u003cp\u003eLeo jumps down into the hole like he has before, many a time. Meg feels for me in the dark and then the hatch. I climb down after her and pull the huge hatch back over the hole.\u003c/p\u003e\n\u003cp\u003eI feel in the silence for the stools. I sit and suddenly the pain in my feet is overwhelming. I know they’ve been cut.\u003c/p\u003e\n\u003cp\u003e\"Did your feet get cut?\"\u003c/p\u003e\n\u003cp\u003eMeg is closer than I think, her whisper is right in my face, \"No. Momma makes us walk and run in the woods barefoot all the time. They always take the shoes.\"\u003c/p\u003e\n\u003cp\u003e\"Smart.\"\u003c/p\u003e\n\u003cp\u003e\"Yeah momma was a warden at a maximum security prison before. She says she knows all the worst things people can do and she knows why they do it.\"\u003c/p\u003e\n\u003cp\u003eI shiver at the thought.\u003c/p\u003e\n\u003cp\u003eWe don\u0027t hear voices or noises. Eventually I fall asleep on the wooden floor against the warm fur of Leo. Meg sleeps against me. She touches me and tries to hold me in her sleep.\u003c/p\u003e\n\u003cp\u003eMy feet pound too hard for me to get a good nights sleep.\u003c/p\u003e\n\u003cp\u003eChapter Ten\u003c/p\u003e\n\u003cp\u003e\"It\u0027s been five days Em. He walks to the same spot and makes weird noises. I have a hunting hound. He does the same thing when he wants me to follow him. We need to get following him in the woods.\"\u003c/p\u003e\n\u003cp\u003eShe has not stopped talking for five days. Momma this and Momma that. I don’t know what to do to make her be quiet. She doesn’t take my silence as a hint.\u003c/p\u003e\n\u003cp\u003e\"Yup that there wolf is trying to tell us the way to go to find them. Are your feet better?\"\u003c/p\u003e\n\u003cp\u003eI look at the cuts on the bottoms and nod, \"They have scabs.\"\u003c/p\u003e\n\u003cp\u003eI rub salve into the bottoms of my feet and pull my thick socks over the scabs. I pull on the boots I had stored in the farmhouse bunker ages ago.\u003c/p\u003e\n\u003cp\u003e\"For a survival expert you\u0027d think he woulda told you about thickening the soles of your feet. I can walk across coals with mine.\" She lifts a foot showing off her padded feet. I want to grimace at the filthy things but I know she\u0027s right.\u003c/p\u003e\n\u003cp\u003eShe throws a huge bone for Leo. He runs and gets it and chews it in the field, \"Not so sharp is he? My hound brings it back.\"\u003c/p\u003e\n\u003cp\u003eI look at the bone and grimace, \"Is it a human bone?\"\u003c/p\u003e\n\u003cp\u003eShe shrugs, \"Does it matter?\"\u003c/p\u003e\n\u003cp\u003eLeo picks up the long thin bone and walks toward the same spot in the field he has for five days. He whines.\u003c/p\u003e\n\u003cp\u003e\"Okay let\u0027s follow him then.\" I sling on my backpack. I look back at the farmhouse. I\u0027ve left a note in the bunker under the barn. Anna knows it\u0027s my favorite hiding place. My heart hurts. I don’t look behind me. I don’t run through the field. Leo trots along like real dog. He doesn’t wait at the meeting tree.\u003c/p\u003e\n\u003cp\u003eNothing is the same.\u003c/p\u003e\n\u003cp\u003eI opened the cabin door and suddenly my life feels lost. I knew I would regret opening the stupid door and helping her. I never imagined the regret would be being separated from them.\u003c/p\u003e\n\u003cp\u003eMy heart hurts when I think about the kiss I shared with Jake. My stomach hurts when I think about Anna being taken.\u003c/p\u003e\n\u003cp\u003eLeo picks up the pace as we enter the woods. I reach out and brush my fingers along the meeting tree. Instead of going the way home to the cabin he cuts a hard left and we climb a different hill.\u003c/p\u003e\n\u003cp\u003e\"So then when I was eleven she says that she wants to try to go to the city. So we get all dressed up and I mean bathed and spiffy. We walk all the way to the city but they don’t just let us in. We have to go through a bunch of tests and other nonsense. The city was brand new. It looked like nothing I\u0027ve ever seen. Anyway they come to us in the bright white clothes and make me take all my brand new clean clothes off. They burned them. Momma was mad as a wet hen. Aunty Lisa failed the diabetes test they gave us and so if we wanted to go into the city we would have to leave her behind. No diabetes in the city. Momma said they could shove that up their behinds. So we left the city. My aunty Heather got grabbed there. Momma thinks because she tested healthy they told the bad ones to take her to the breeder farms. They drove up in their trucks and held guns on us. They dragged her into the truck. She screamed and reached for us. Momma never moved. She just watched. I never seen aunty Heather again.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/born-born-1/page-11.html","bookId":1604,"creation":"Oct 5, 2019 5:56:02 PM","modification":"Oct 5, 2019 5:56:02 PM"}
