{"id":92407,"no":7,"title":"Page 7","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eShe pouts, \"Can we make me a bow maybe?\"\u003c/p\u003e\n\u003cp\u003eI nod excitedly. We haven’t had much to talk about.\u003c/p\u003e\n\u003cp\u003eI take the bow and arrow. I pull back and sight in the dying man. His body trembles slightly. His skin has chew marks. The infected will eat anything.\u003c/p\u003e\n\u003cp\u003e\"Hold it steady, sight in what you want to shoot and then take a deep breath.\" I exhale and release the arrow. We are close enough that it makes a slicing sound as it enters his temple. \"Always exhale when you release.\" I grimace as I see the arrow sticking out of his bleeding head.\u003c/p\u003e\n\u003cp\u003e\"Wow.\"\u003c/p\u003e\n\u003cp\u003eI nod, \"Yeah it took a lot of practice.\"\u003c/p\u003e\n\u003cp\u003e\"Sweet fucking god.\"\u003c/p\u003e\n\u003cp\u003eI turn. \"What?\"\u003c/p\u003e\n\u003cp\u003eJake is standing behind us, \"You guys do realize that\u0027s a person you just shot. These were all people.\"\u003c/p\u003e\n\u003cp\u003eAnna scoffs, \"They\u0027re infected Jake. They\u0027re not like you or me or even the city people.\"\u003c/p\u003e\n\u003cp\u003eI frown, \"City people?\"\u003c/p\u003e\n\u003cp\u003eJake looks down at the grass.\u003c/p\u003e\n\u003cp\u003eAnna looks at me, \"We saw it. We went close enough to see it.\"\u003c/p\u003e\n\u003cp\u003e\"Electricity? Running water?\"\u003c/p\u003e\n\u003cp\u003eShe nods, \"Everything. No cars but a subway and houses and pretty big buildings. It\u0027s on the edge of the desert.\"\u003c/p\u003e\n\u003cp\u003eI feel sickened by asking the question but I ask anyway, \"What about the farms?\"\u003c/p\u003e\n\u003cp\u003eShe shivers, \"Up and running still. I think the babies go to the city after they\u0027re born.\"\u003c/p\u003e\n\u003cp\u003eJake sighs and runs a hand through his hair. He appears to be bothered by the conversation.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s military.\"\u003c/p\u003e\n\u003cp\u003e\"What?\" I look at Anna who is pointing at the dead man with the arrow sticking out of his temple.\u003c/p\u003e\n\u003cp\u003eI look at his boots and shake my head, \"We need to be far away. Now.\"\u003c/p\u003e\n\u003cp\u003eWe don’t talk. We leave the arrows sticking out of the faces of the people on the ground. I never take the arrows from the infected. We walk across the small field and into the forest on the other side.\u003c/p\u003e\n\u003cp\u003eI watch Leo the entire walk. It stops me from watching Jake. Leo is the best warning system. Jake is a distraction.\u003c/p\u003e\n\u003cp\u003eChapter Six\u003c/p\u003e\n\u003cp\u003eThe farmhouse sits quiet, just like I hoped it would. I\u0027ve never come back to it so quickly. It serves our purpose the best though. It has the longest, most off the beaten track, driveway of the four and it\u0027s the closest to my cabin.\u003c/p\u003e\n\u003cp\u003eWe peel off our soaking wet clothes. My wound burns from the cold river water and the exertion of wading through the river for such a long ways.\u003c/p\u003e\n\u003cp\u003eI have done it before, but it\u0027s not my favorite way to get to the house. I\u0027ve been followed before. I don’t know if we were followed today but I can\u0027t chance it.\u003c/p\u003e\n\u003cp\u003eI can\u0027t help but steal a glance at Jake as he pulls his wet shirt off and drops his jeans on the floor. His wound is bright purple. The brand new scar that\u0027s the developing is lumpy and ugly.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s bigger than I thought it would be.\"\u003c/p\u003e\n\u003cp\u003eI look up at him smiling at me, staring.\u003c/p\u003e\n\u003cp\u003eI pull my pants off and notice for the first time he has drawings of dinner rolls on his boxers.\u003c/p\u003e\n\u003cp\u003eI raise an eyebrow.\u003c/p\u003e\n\u003cp\u003eHe laughs, \"Buttered buns.\"\u003c/p\u003e\n\u003cp\u003e\"I don’t get it.\"\u003c/p\u003e\n\u003cp\u003e\"That\u0027s because you were nine when the world went crazy.\"\u003c/p\u003e\n\u003cp\u003eI feel my face blushing, realizing it\u0027s obviously something filthy, \"You were only eleven.\" I say out of spite.\u003c/p\u003e\n\u003cp\u003eHe laughs, \"I was but my older brother was sixteen. So that makes me more like fifteen when it happened.\"\u003c/p\u003e\n\u003cp\u003eI stop smiling, but he doesn’t stop talking.\u003c/p\u003e\n\u003cp\u003e\"Will was a bad kid. Our dad used to get so mad at him. He had a magazine collection that could shock a whore.\"\u003c/p\u003e\n\u003cp\u003eI flinch at the word. I know what it means and I know how it works but I\u0027ve never physically heard anyone say it. The conversation feels wrong suddenly.\u003c/p\u003e\n\u003cp\u003e\"One time he was dating this girl Angela and he…\"\u003c/p\u003e\n\u003cp\u003e\"Jake.\"\u003c/p\u003e\n\u003cp\u003eI look back at Anna who is making a distasteful face, \"Dirty Will stories in your underwear is creepy dude.\"\u003c/p\u003e\n\u003cp\u003eI smile. Jake blushes. He looks at me through his bangs and my heart feels like it\u0027s too big for my chest.\u003c/p\u003e\n\u003cp\u003e\"Where is your brother?\" I don’t want to ask but I know I have to.\u003c/p\u003e\n\u003cp\u003eAnna answers from behind me, \"We hope dead.\"\u003c/p\u003e\n\u003cp\u003eI nod. I leave it at that. I know that feeling.\u003c/p\u003e\n\u003cp\u003eJake\u0027s face is haunted. I swear I see guilt but I leave it.\u003c/p\u003e\n\u003cp\u003eI feel weird being in the house with other people, not just because it\u0027s one of my havens but also because I am never with other people. Ever.\u003c/p\u003e\n\u003cp\u003eMy leg aches. I know I won\u0027t sleep. I look at Anna, \"You guys sleep first. Me and Leo will take first watch.\"\u003c/p\u003e\n\u003cp\u003eJake frowns, \"Why don’t we all just sleep. There is no way anyone followed us Emma.\"\u003c/p\u003e\n\u003cp\u003eI want to slap him, it is irrational, but his survival skills leave a lot to be desired.\u003c/p\u003e\n\u003cp\u003eInstead I turn and walk away, Anna has it.\u003c/p\u003e\n\u003cp\u003e\"Dude we will take watch here every night. It just feels safe here, that doesn’t mean it is.\"\u003c/p\u003e\n\u003cp\u003e\"Fine. Whatever.\"\u003c/p\u003e\n\u003cp\u003eI pull the knife that I stole from the dead military guy out of my boot and rub it down with the bleach I pulled out from under the sink. I wipe the blade down and my fingers. I pour water from my bottle over my fingers and the blade. I hate that I touched something of someone else\u0027s.\u003c/p\u003e\n\u003cp\u003eI catch Jake watching me.\u003c/p\u003e\n\u003cp\u003eI ignore him. I ignore my heart\u0027s desire to flutter every time he glances at me.\u003c/p\u003e\n\u003cp\u003eI will leave him. It\u0027s in my nature.\u003c/p\u003e\n\u003cp\u003eInstead I look at Leo, who has positioned himself in front of the back door and curled into a ball.\u003c/p\u003e\n\u003cp\u003e\"So much for helping, hey boy.\"\u003c/p\u003e\n\u003cp\u003eHe opens one yellow eye and closes it again.\u003c/p\u003e\n\u003cp\u003eI take my new knife, my bow and quiver and my bottle of water to the door. I rub Leo\u0027s head once and head out into the night quietly. I stealth across the gravel silently.\u003c/p\u003e\n\u003cp\u003eI open the barn door and slip inside. The darkness of the barn is frightening, but I grip the handle of the blade for strength. I climb the stairs, feeling like something will grab my feet any second and drag me down into the hay. I will finally hear my greatest fear, my own ripping and tearing.\u003c/p\u003e\n\u003cp\u003eI climb into the hayloft and sit in the open window. The dark night is silent. I don’t like silence. I like the sounds of animals telling me I am safe. I open my ears and close my mind against the sounds that haunt me.\u003c/p\u003e\n\u003cp\u003eI hear them suddenly.\u003c/p\u003e\n\u003cp\u003eThe night creatures that will warn me of any intruders fill my ears. There is a cricket, a single cricket out in the field. I hear a bat off in the woods south of the farm. Something snorts behind the barn in a way that makes me smile.\u003c/p\u003e\n\u003cp\u003eWhatever it is, it\u0027s rooting. The signs of life fill me with a mistaken and misguided hope. I know the reality of it all. I am not fooled by the warm and fuzzy feelings.\u003c/p\u003e\n\u003cp\u003eI know we are lost, all of humanity is.\u003c/p\u003e\n\u003cp\u003eI know what we have done to each other. We are no longer human. Our humanity is lost. The animals have bested us in behavior and survival.\u003c/p\u003e\n\u003cp\u003eThe door to the house slips open. Anna crosses the driveway carefully.\u003c/p\u003e\n\u003cp\u003eA smile crosses my lips, she is a survivor.\u003c/p\u003e\n\u003cp\u003e\"His leg is infected.\"\u003c/p\u003e\n\u003cp\u003eHer whispered words cut me. I know what we must do but I\u0027m not prepared to do it.\u003c/p\u003e\n\u003cp\u003eShe sees my face in the dull moonlight, \"I know. I feel the same way.\"\u003c/p\u003e\n\u003cp\u003e\"The medicines are all expired.\"\u003c/p\u003e\n\u003cp\u003e\"We have to go for him. His fever has returned. The red lines have started. My dad warned me about the red lines.\"\u003c/p\u003e\n\u003cp\u003eMy eyes leave the deserted yard and fix on hers. They glisten in the moonlight.\u003c/p\u003e\n\u003cp\u003e\"I will go alone.\"\u003c/p\u003e\n\u003cp\u003eThe glistening spot in the dark lowered, \"I can\u0027t ask that of you.\"\u003c/p\u003e\n\u003cp\u003e\"He can\u0027t travel.\"\u003c/p\u003e\n\u003cp\u003e\"But I can\u0027t ask that of you. He is my burden.\"\u003c/p\u003e\n\u003cp\u003eI laugh softly into the cool night air, \"He really is isn’t he? How is he so clueless?\"\u003c/p\u003e\n\u003cp\u003eHer lips curl into a grim smile the darkness can\u0027t hide from me, \"He worshipped our brother. They joked and laughed while dad tried to teach us how to survive. Dad always called them the grasshoppers who played all summer.\"\u003c/p\u003e\n\u003cp\u003eThe reference makes me flinch, as my granny\u0027s face flashes across my mind.\u003c/p\u003e\n\u003cp\u003e\"When dad died Will took care of us, but he wasn\u0027t a survivor. It wasn’t his fault. Dad let them play.\" I can hear the tears filling her face, \"When Will got taken I was eleven. Jake has tried but he\u0027s, well he\u0027s a moron.\"\u003c/p\u003e\n\u003cp\u003eI look back out into the yard, \"He\u0027s amazing Anna. He\u0027s still full of the things we\u0027ve all lost. He smiles and laughs and sings. I heard him humming the other day and I almost shot him myself and then I realized I haven’t hummed since I was nine years old.\" My skin shivers when I think about spying on him humming. I couldn’t take my eyes off of him.\u003c/p\u003e\n\u003cp\u003e\"He\u0027s a goof. We will travel together Em.\"\u003c/p\u003e\n\u003cp\u003eI look back harshly, \"He will die if we make him travel. Those red lines are blood poisoning and once they reach his heart he\u0027s dead. I will go and you will stay and keep him safe.\"\u003c/p\u003e\n\u003cp\u003eI am risking my life for him. I feel like I am back at the cabin door and she is knocking. I am going to regret this decision.\u003c/p\u003e\n\u003cp\u003e\"I\u0027ll leave tonight. You will have to keep Leo with you. He can help you.\"\u003c/p\u003e\n\u003cp\u003eHer voice is small, \"I can\u0027t ask this of you.\"\u003c/p\u003e\n\u003cp\u003eIt\u0027s my turn to smile bitterly, \"Guess you\u0027ll have to trust me.\"\u003c/p\u003e\n\u003cp\u003eI stare out into the night, it\u0027s peaceful and quiet. It scares me more than anything suddenly.\u003c/p\u003e\n\u003cp\u003eI feel my jaw tense, \"If I\u0027m not back in three days you\u0027ll have to cut the leg off and clot it. Don\u0027t give him liquor before you cut it off, it thins the blood and he will bleed out. Clotting is done with a hot iron. You press it against the stump where the leg bleeds to seal the veins.\"\u003c/p\u003e\n\u003cp\u003eI don\u0027t look at her. I can\u0027t. \"The red lines means he has a week at the most. He will need tons of soup and water and rest. He can fight it somewhat with those things.\" I stand, \"I\u0027ll leave tonight.\"\u003c/p\u003e\n\u003cp\u003eMy leg aches at the thought of leaving.\u003c/p\u003e\n\u003cp\u003eThe barn feels less scary with her in it and I realize my whole life feels that way.\u003c/p\u003e\n\u003cp\u003eChapter Seven\u003c/p\u003e\n\u003cp\u003eI don\u0027t look back. I know he\u0027s watching me. I can\u0027t bear to see the look on his face. His eyes will haunt me forever. I\u0027ve never left him before. He\u0027s always part of whatever I undertake. He waits in the woods while I raid houses, but he\u0027s there. This is the first time I turn my back on him and I don’t know if I will be back. \u003c/p\u003e","sourceLink":"https://allnovel.net/born-born-1/page-7.html","bookId":1604,"creation":"Oct 5, 2019 5:56:02 PM","modification":"Oct 5, 2019 5:56:02 PM"}
