{"id":64192,"no":31,"title":"Page 31","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eNot letting go, he met her eyes. Her look of dumbfounded wonderment was so endearing, a little laugh escaped him. “Sweet Beth. I would like to care for you someday. If you wished it.”\u003c/p\u003e\n\u003cp\u003eThe door swung open, and they sprang apart.\u003c/p\u003e\n\u003cp\u003eHer father scowled at him. “Time for you to leave.”\u003c/p\u003e\n\u003cp\u003eAidan gritted his teeth. One day he’d have his own cottage, and he’d sit with Elspeth by the fire for as long as he cared to.\u003c/p\u003e\n\u003cp\u003e“But he just got here,” Elspeth said, and the plea in her voice firmed Aidan’s resolve. “He’s helping me with my accounts.”\u003c/p\u003e\n\u003cp\u003e“We’re off to see a businessman who knows accounts better even than you, girl.” Farquharson grabbed her shawl from a peg and strode to her, gesturing impatiently. “Up, up you go. I’ve a message from the greatest knit merchant in all Aberdeen.”\u003c/p\u003e\n\u003cp\u003eAidan curled his fingers into his knees, determined not to leap from his seat to coerce a more respectful tone from the old man’s mouth.\u003c/p\u003e\n\u003cp\u003eShe stood warily. “What are you talking about?”\u003c/p\u003e\n\u003cp\u003e“I’m talking about none other than Dougal Fraser, and he’s a fancy to meet you.”\u003c/p\u003e\n\u003cp\u003eAidan’s feet shuffled abruptly beneath him, his body very nearly springing to throttle the man’s throat before he could think better of it. He’d seen the name Dougal Fraser before, on a slip of paper given to him by an Aberdeen hired man.\u003c/p\u003e\n\u003cp\u003eThe movement had drawn her father’s eyes, and while he spoke to his daughter, he continued to glare at Aidan. “Fraser asked if you were promised to anyone. I’m happy to tell him you’re not.”\u003c/p\u003e\n\u003cp\u003eShe flinched back. “But he’s an old man.”\u003c/p\u003e\n\u003cp\u003eAidan shot her a look. What did Elspeth know of Fraser?\u003c/p\u003e\n\u003cp\u003eHer father stepped close, tossing the shawl haphazardly around her shoulders. “What do you know of Lord Fraser?”\u003c/p\u003e\n\u003cp\u003e“I … I’ve heard of him,” she said, adjusting herself. “I simply assumed.”\u003c/p\u003e\n\u003cp\u003e“Well, he said some things, put me in mind of an alliance of sorts. Our brains run along the same track. Both business-minded men, you know.”\u003c/p\u003e\n\u003cp\u003e“What sort of alliance?” Aidan demanded in a hard voice. But he didn’t need to hear her father spell it out to know: the man wanted to marry Elspeth. The need to protect her, to possess her, seethed in his belly.\u003c/p\u003e\n\u003cp\u003eFarquharson ignored him, his face splitting into a grin that mocked Aidan. “I’m assuming he wants to see you to ask for your hand, fool girl. He spoke of the potential of this very farm.” He nudged her. “I told you sheep was a grand idea. Lord Fraser thinks our wool production—regular and high quality—would be just the thing for his business.”\u003c/p\u003e\n\u003cp\u003eAidan managed to calm himself enough to speak. “Fraser’s business is thriving, and on a much grander scale. I don’t believe he’d have an honest interest in a farm this size.”\u003c/p\u003e\n\u003cp\u003e“A farm this size,” her father mimicked, glaring at him. “And what have you got, boy? Nothing, that’s what.” He crossed his arms, puffing with pride. “If you must know, Fraser said he’s been long without a woman. He heard my Elspeth was fine.”\u003c/p\u003e\n\u003cp\u003eLong without a woman. Fury roiled hot in his belly. She was more than a mere commodity—she was precious.\u003c/p\u003e\n\u003cp\u003e“But I don’t love him.” She cast a quick and plaintive glance at Aidan. There was a message in her eyes that he dared not hope was true—that her affections might already be claimed, and by him.\u003c/p\u003e\n\u003cp\u003e“Love? Girl, you don’t have two farthings to rub together. Why do you want love when you can be a lady?”\u003c/p\u003e\n\u003cp\u003eAidan bolted to his feet. “Elspeth is a lady. She doesn’t need a rich old husband to prove that to the world.”\u003c/p\u003e\n\u003cp\u003eHer father scoffed. “Well, now she’ll be set up like one. And for the rest of her days.”\u003c/p\u003e\n\u003cp\u003e“Set you up is more like it,” Aidan said, his voice dangerously low.\u003c/p\u003e\n\u003cp\u003eSneering, her father looked him up and down like a piece of rubbish. “What business is it of yours?”\u003c/p\u003e\n\u003cp\u003eAidan scowled silently back, thinking the man was right. It wasn’t his business. Would that it were. Would that Elspeth were his responsibility—he’d care for her better than the wealthiest of merchants could.\u003c/p\u003e\n\u003cp\u003e“Aye, that’s right,” her father mumbled triumphantly.\u003c/p\u003e\n\u003cp\u003eAidan stepped forward, and Elspeth stopped him with an outstretched arm. “But we’re getting by, Da. The farm is starting to turn around. I don’t need to marry when I’m happy and needed here.”\u003c/p\u003e\n\u003cp\u003e“You need to make house, respectable-like. Have a place of your own, a few bairns.” He walked to the door, gesturing for her to follow, as though she should start that very moment. “A man like Fraser will do much for our respectability.”\u003c/p\u003e\n\u003cp\u003eElspeth held her ground and didn’t follow. “I’m perfectly respectable.”\u003c/p\u003e\n\u003cp\u003e“Aye,” her father said with a shrug, “that’s as may be, but our coffers aren’t so.”\u003c/p\u003e\n\u003cp\u003eAidan watched as her confusion turned to anger, and a matching fury blazed in his chest. If only he had hard proof, rather than a hunch and a crumpled receipt from his hired man. “Anyone but him,” he said, trying to keep his voice level. “Think twice about this. This Fraser is a stranger. And … I think he’s tied up in a dangerous game.”\u003c/p\u003e\n\u003cp\u003eElspeth gasped. “Who is he? I must know. I’ve been desperate to know.”\u003c/p\u003e\n\u003cp\u003eHer eager response gave Aidan pause. The question wasn’t what did he know, rather what did she?\u003c/p\u003e\n\u003cp\u003eIgnoring his daughter, the old man glared at Aidan, demanding, “How do you know aught about him?”\u003c/p\u003e\n\u003cp\u003eHow to explain that it was just a hunch? “I simply … know.”\u003c/p\u003e\n\u003cp\u003eHer father laughed. “You simply … know? His dangerous games? Here’s a dangerous game,” he said, growing serious. “You sitting unchaperoned with my daughter. I see how you look at her. You just don’t want another man to have her.”\u003c/p\u003e\n\u003cp\u003e“That might be true. But trust me when I tell you, Fraser isn’t what he seems.” Even a vague link between this merchant and the man with the black pearl was too much. “I have reason to believe he’s tied to the pirate who kidnapped me as a child.”\u003c/p\u003e\n\u003cp\u003eElspeth drew in a sharp breath.\u003c/p\u003e\n\u003cp\u003e“Pish!” Her father scoffed. “What nonsense. You were just a child. An … an …”\u003c/p\u003e\n\u003cp\u003eAidan felt Elspeth sidle close behind to give his arm a quick, convulsive squeeze. “An urchin?” he finished, his voice dangerously calm.\u003c/p\u003e\n\u003cp\u003eHer father only sneered. “Aye. Your accusation is tripe. All of it, tripe.”\u003c/p\u003e\n\u003cp\u003eElspeth stepped forward. “We have proof.”\u003c/p\u003e\n\u003cp\u003eAidan shot her a speaking look. She’d seen his papers that day. He didn’t know what she’d read, but he’d rather she told him before getting her father involved. “I’ll find proof,” he said definitively, cutting her off.\u003c/p\u003e\n\u003cp\u003eHer father’s placid expression spoke volumes about just whom he did and did not deem trustworthy. “You won’t find any proof, because I ken a respectable man when I see one.”\u003c/p\u003e\n\u003cp\u003eAidan didn’t care about the slight. He cared that this daft old man, who equated a pricey waistcoat with respectability, was going to sacrifice his only child for financial gain.\u003c/p\u003e\n\u003cp\u003eHe stepped into the older man’s face. “So you’re simply going to throw your daughter to a stranger?”\u003c/p\u003e\n\u003cp\u003e“Aidan,” Elspeth whispered, “don’t fash yourself. I’m sure Da and I will discuss this.”\u003c/p\u003e\n\u003cp\u003eHe heard the plea in her voice, but couldn’t help it. A great weight was pressing upon his chest. Fury, frustration, disbelief all crushing down, making his lungs tight.\u003c/p\u003e\n\u003cp\u003e“You see? I’m not throwing her. All Elspeth has always wanted was to help out her family.” Her father gave her a careless wink. “Isn’t that right, girl?”\u003c/p\u003e\n\u003cp\u003e“Oh, and you know so well what she wants?” Aidan clenched his fists, wishing for an outlet for his rage.\u003c/p\u003e\n\u003cp\u003e“Aidan, please.” Elspeth placed a gentle hand at his back, and his tensed muscles flinched at her touch.\u003c/p\u003e\n\u003cp\u003eHe’d treasured those tender hands, and now they were being stolen from him. Like everything else in his life he’d ever cherished. “You’re the only family she has,” he said, stabbing a finger toward her father. His jaws were clenched, each breath a labor now. “And by now you should know better how to take care of your own self, old man.”\u003c/p\u003e\n\u003cp\u003e“I care for myself and for her,” her father said, indignant. “Have all these long years, and all by myself, too.”\u003c/p\u003e\n\u003cp\u003eDisbelief and outrage roiled in Aidan’s belly. “You call what you do taking care of her?”\u003c/p\u003e\n\u003cp\u003e“She’s been well tended. She has what she needs. The lass even has her own room.”\u003c/p\u003e\n\u003cp\u003e“Truly?” Aidan exploded. “And that’s proof that you know her heart?”\u003c/p\u003e\n\u003cp\u003e“What do you know of her heart?” her father snapped. “What can you know of anything? You’re naught but an indentured, fresh off the boat. Of course your head is turned by the first skirt you see,” he said, waving a dis-missive hand in Elspeth’s direction.\u003c/p\u003e\n\u003cp\u003eAidan’s vision turned red and black. He sprang at the man, punching him squarely on the chin.\u003c/p\u003e\n\u003cp\u003e“No!” Elspeth shrieked as her da fell hard to the ground.\u003c/p\u003e\n\u003cp\u003eHer father rubbed his face, working his mouth open and closed. “Damn you. You’ll pay for this.”\u003c/p\u003e\n\u003cp\u003eElspeth’s eyes were wide with shock, and Aidan stared at her, wallowing in his own shame and frustration. Perhaps her father was right. Perhaps he was, and ever would be, nothing more than another man’s servant. Perhaps he’d never be good enough for something—for someone—so fine. “I’m sorry, Beth,” he said, his voice hoarse with feeling. “But you deserve more than that. You are more than that.”\u003c/p\u003e\n\u003cp\u003eEyes narrowing, he turned to glare at her father. “You don’t understand Elspeth. You may think you do. But really you’re not worthy to call her your daughter.”\u003c/p\u003e\n\u003cp\u003eRubbing his hand, Aidan stormed from the cottage.\u003c/p\u003e\n\u003cp\u003eChapter 21\u003c/p\u003e\n\u003cp\u003eHe’d lost his head. He’d punched Elspeth’s father. \u003c/p\u003e","sourceLink":"https://allnovel.net/devil-s-own-clan-macalpin-2/page-31.html","bookId":2657,"creation":"Oct 5, 2019 9:53:43 AM","modification":"Oct 5, 2019 9:53:43 AM"}
