{"id":64167,"no":6,"title":"Page 6","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“You cleared the way, you did. For your own slave trade.” The man looked around, his dim face looking muddled. “But what do you need with slaves out here? Seems you’d rather put that boat of yours to better use. For fishing, like. Less risky.” The man smiled amiably, revealing a mouthful of decaying teeth.\u003c/p\u003e\n\u003cp\u003e“You overstep.” Aidan fought the urge to clout the fellow. Pretending to start his own slaving trade was a tenuous enough ruse; the last thing he required was the unsolicited counsel of hired dock men. “My business is precisely that. Mine. Now continue.”\u003c/p\u003e\n\u003cp\u003e“Well, you nabbed the smuggler, but he weren’t the boss, see. There’s another, a fancy broker type. Him’s who ordered the slaves. And there’s another too—a freebooter like—and him’s your man doing the physical work. Sailing the ship, seeing the bodies to and fro.”\u003c/p\u003e\n\u003cp\u003eThe bodies. Aidan had been just such a body. A tenyear-old one.\u003c/p\u003e\n\u003cp\u003eHe channeled his rage toward the hired man. “So there are two men outstanding. I don’t suppose it occurred to you to get their names? Or to come bearing any useful information beyond him’s this and him’s that?”\u003c/p\u003e\n\u003cp\u003eThe man opened his mouth and snapped it shut again. He gave a tight shake to his head. “I tried, sir.”\u003c/p\u003e\n\u003cp\u003e“I thought as much.” Aidan dug in his sporran and tossed him a shilling. “A bob for now. A full crown if you\u003c/p\u003e\n\u003cp\u003ecome back with names.”\u003c/p\u003e\n\u003cp\u003eThe hired man’s face twitched.\u003c/p\u003e\n\u003cp\u003eAidan stepped closer to the man in a show of dominance. “If you’re disappointed with the pay, consider it motivation. To return with actual information. As it stands, this meeting was dangerously close to a waste of my time.”\u003c/p\u003e\n\u003cp\u003eThe man looked at his feet, dejected. “As you say.”\u003c/p\u003e\n\u003cp\u003e“Then why do you still stand before me?”\u003c/p\u003e\n\u003cp\u003eWith a nod, his hired man turned and jogged back the way they’d come.\u003c/p\u003e\n\u003cp\u003eIf he wanted information, he’d just have to go back to Aberdeen himself to look for it. He suspected he held clues already, but damned if he was able to read well enough to find out. It was a complication he needed to remedy, and fast.\u003c/p\u003e\n\u003cp\u003eHe couldn’t fail now. He’d been fine-tuning his plan for years: he’d act the part of a wealthy businessman starting his own slave trade and hope he presented competition enough to rouse the man with the pearl earring from whatever rock he hid beneath.\u003c/p\u003e\n\u003cp\u003eHim, a slaver. The thought was absurd. But lies spilled easily enough from his lips. He wondered grimly, who was Aidan really? His true identity had been stolen from him thirteen years past. If anything, Aidan was the thing that felt foreign. He’d spent his childhood simply called “boy,” and then, when his body far surpassed what one could reasonably consider a boy, that’d evolved into “Scot.” He’d been pretending ever since, the past thirteen years naught but lies and half-truths.\u003c/p\u003e\n\u003cp\u003eThe first of his many lies had been to his purported master. The man—Nash was his name—had been a simpleton. His was an old Barbadian family, what islanders referred to as “Bims.” A few years older than Aidan, Nash had been born into a plantation fortune. “Sweet\u003c/p\u003e\n\u003cp\u003emoney,” he’d call it, his “sweet sugar money. White gold.”\u003c/p\u003e\n\u003cp\u003eAmassed from the labors of stolen souls.\u003c/p\u003e\n\u003cp\u003eAidan sneered, remembering. It’d been simple enough, ingratiating himself with the man. Nash had been eager to speak of Mother Country, and Aidan had dredged as many of his father’s war stories from his memory as he could. His master had lapped up every word, like a starved and stupid pup.\u003c/p\u003e\n\u003cp\u003eAnd then he simply bided his time, slowly working out his plan, dreaming of escape. For years, he waited.\u003c/p\u003e\n\u003cp\u003eUntil one day he realized how much his half-wit mas-ter had grown to trust him. When he learned Nash was planning a sail to Aberdeen, it didn’t take long to convince him that Aidan could be trusted as part of the crew.\u003c/p\u003e\n\u003cp\u003eA few favors, some thrown fists, and several promises later, Aidan found himself captaining a pretty sloop and her three crewmen out of Bajan Harbor, with the imbecile Nash left hog-tied at the dock. As the idyllic crescent of white sand faded into gray sea, the swell of freedom in his chest had been sweeter than any sugarcane.\u003c/p\u003e\n\u003cp\u003eAnd then came Aidan’s second lie, to his crew: that his sole purpose was to make his fortune in the slave trade.\u003c/p\u003e\n\u003cp\u003eHe’d regretted the telling of it, but there was no other choice. He had one goal, and one goal only. Not friendship, nor camaraderie. It was to track, to find, and to kill the man who’d abducted him. To do so, he needed to infiltrate the smuggling network.\u003c/p\u003e\n\u003cp\u003eIt would be an impossible task, tracking down the ghost who’d haunted him all these years. But revenge was all Aidan wanted, vengeance all he was.\u003c/p\u003e\n\u003cp\u003eHe’d hide out in Dunnottar, using spies, coin, and his own wits and muscle to guide him. He had only two clues to his enemy’s identity. Knowing the man had been in Aberdeen, thirteen long years ago. And a single black pearl.\u003c/p\u003e\n\u003cp\u003eThe hunt was on.\u003c/p\u003e\n\u003cp\u003eThe hunt was off—if every soul in Aberdeenshire knew what he was about.\u003c/p\u003e\n\u003cp\u003e“I told you, told all of you, to keep my identity close.” Aidan shifted his glare from Anya to Elspeth. He was seated at the great slab of wood that was the dining table, simmering with rage. “And now you go and bring this stranger into our home?”\u003c/p\u003e\n\u003cp\u003e“Elspeth is no stranger.” Anya kept her chin held high. “I trust her more than I trust my own … my own …”\u003c/p\u003e\n\u003cp\u003e“Your own sister?” Aidan rolled his eyes, his temper abating. “That girl Bridget has trilled about my homecoming to whoever might chance to look her way.”\u003c/p\u003e\n\u003cp\u003e“That girl Bridget is your sister. And we’ve told her she needs to be more … circumspect. But I still don’t understand why. Are you in trouble? Are you in hiding?”\u003c/p\u003e\n\u003cp\u003e“No.” He tossed back the last of a tankard of ale. He wasn’t hiding—he just didn’t want folk to uncover the truth of his goals. He studied Anya’s friend, doubtful this mouse of a girl would be able to help him. He glared at her, to make his meaning clear. “I don’t wish every villager from here to Aberdeen to hear about my return.”\u003c/p\u003e\n\u003cp\u003e“Elspeth will keep your secret,” Anya told him in a calming voice. “The MacAlpins lost you once. We’ll not lose you again. Until you decide to tell us why you insist on such secrecy, we shall all respect your wishes.”\u003c/p\u003e\n\u003cp\u003eElspeth nodded. Nobody knew better than she how to keep a secret. She had no doubt he had a good one too. She was certain Aidan was embroiled in some private scheme. A thrilling plot, involving mystery and intrigue.\u003c/p\u003e\n\u003cp\u003eAidan was furious, and she secretly rejoiced. Because he wasn’t angry at the thought of reading, or her, or of reading with her. It was simply that he wished to be discreet. Clearly, he only wanted to keep his identity a secret so as not to bring danger upon his family. Or to the friends of his family. That meant her. Ergo, he wanted to keep her safe too. She shivered.\u003c/p\u003e\n\u003cp\u003eHe tore a hunk from a loaf of bread and pinned her with that blue gaze. “You’ll keep your mouth shut, aye?”\u003c/p\u003e\n\u003cp\u003eElspeth’s voice was breathy when she replied, “I shall be the very picture of obsession.” She blanched. “Discretion. I… I … I shall be the very picture of discretion.”\u003c/p\u003e\n\u003cp\u003eHe gave her a peculiar look. Her heart pounded, and she was certain it was pumping twenty shades of red into her cheeks.\u003c/p\u003e\n\u003cp\u003eShe assured herself it could’ve been worse. She might have accidentally misspoken something more embarrassing. Possession, for instance, or affection. Or, God for-fend, erection.\u003c/p\u003e\n\u003cp\u003eThe thought made her squeak.\u003c/p\u003e\n\u003cp\u003eNot taking his eyes from Elspeth, Aidan posed a question to his sister. “You’re certain this chit has the wits to teach me?”\u003c/p\u003e\n\u003cp\u003eHis tone broke her spell. “Indeed,” both women said in unison.\u003c/p\u003e\n\u003cp\u003eAnya was bristling. “Elspeth is the smartest girl you’ll ever meet. She knows Latin and French.”\u003c/p\u003e\n\u003cp\u003e“I just need English,” he said over a mouthful of bread.\u003c/p\u003e\n\u003cp\u003eElspeth watched, hypnotized, as he swept crumbs from the table into his hand, and then popped them in his mouth.\u003c/p\u003e\n\u003cp\u003e“She’s quite proficient in that as well,” Anya said. “She even does her father’s accounting.”\u003c/p\u003e\n\u003cp\u003e“That’s more a comment on her father than on her.” He looked at her, speculating. “Tell me, girl.”\u003c/p\u003e\n\u003cp\u003e“Her name is Elspeth.” Anya’s tone was steady and calm.\u003c/p\u003e\n\u003cp\u003e“Tell me, Elspeth. Are you to speak to me when you teach, or will my sister have to translate?” A smile, a true smile, cracked his face.\u003c/p\u003e\n\u003cp\u003eThe sight of it made Elspeth’s heart soar. She spoke slowly and carefully in her response. Just in case. “Indeed, sir. I am perfectly capable of speaking for myself.”\u003c/p\u003e\n\u003cp\u003eAidan tilted his face, considering her. Never before had a man considered her like that. Never had one so handsome ever so much as looked her way.\u003c/p\u003e\n\u003cp\u003eHer chest tightened, and she forced it to rise and fall. No good came of fainting from lack of breath.\u003c/p\u003e\n\u003cp\u003eAnya cleared her throat. “It’s settled, then?”\u003c/p\u003e\n\u003cp\u003e“It’s settled.” His eyes were hooded and intense, and Elspeth thought he might just be able to see through her clear into the next room. “She can begin our lessons tomorrow.”\u003c/p\u003e\n\u003cp\u003eChapter 5\u003c/p\u003e\n\u003cp\u003eElspeth stood in the doorway on the following day, mustering her courage. Aidan was sitting alone at the dining table. He hadn’t yet realized she was there, and she seized the opportunity to study him, letting her eyes roam his broad shoulders, that roguish tangle of hair.\u003c/p\u003e\n\u003cp\u003eSomething held his attention. She angled her head to see. It was a scrap of paper.\u003c/p\u003e\n\u003cp\u003eHer heart fell. Was he reading? Her services wouldn’t be needed after all.\u003c/p\u003e\n\u003cp\u003eBut then she saw how his eyes flicked to and fro, rather than scanning as though reading lines on a page. A smile spread on her face, wide, like he’d just paid her a compliment rather than simply offer proof of his illiteracy.\u003c/p\u003e\n\u003cp\u003eShe lifted a foot to walk, then put it back down again, wondering how to approach him, what to say. Good day, Master MacAlpin. Good morning. Hello, Aidan. Or perhaps she should simply clear her throat.\u003c/p\u003e\n\u003cp\u003eIn the end, she blurted, “What’s that?” \u003c/p\u003e","sourceLink":"https://allnovel.net/devil-s-own-clan-macalpin-2/page-6.html","bookId":2657,"creation":"Oct 5, 2019 9:53:42 AM","modification":"Oct 5, 2019 9:53:42 AM"}
