{"id":95505,"no":21,"title":"Page 21","content":"\u003cp\u003eDREAMS AND MEMORIES\u003c/p\u003e\n\u003cp\u003eHe went looking for her,\" Jarlaxle said to Kimmuriel when the pair met up the next day in a shaded glen near the appointed rendezvous with the dragon sisters. Not far away, Entreri and Athrogate sat about a tumble of boulders in the middle of a rocky lea.\u003c/p\u003e\n\u003cp\u003eKimmuriel had joined them, intending to prevent the conversation from veering toward Calihye. Jarlaxle, as if reading his mind, had led with a reference to the wretched human woman.\u003c/p\u003e\n\u003cp\u003e\"It is typical of humans, is it not?\" the psionicist answered. \"To throw a lover through a glass window, then seek her out in remorse? Our way is much more straightforward and honest, I think. No drow matron would expel a male and let him live.\"\u003c/p\u003e\n\u003cp\u003e\"With notable exception.\"\u003c/p\u003e\n\u003cp\u003e\"Notable,\" Kimmuriel agreed. \"Of course, in the instance to which you refer, Matron Baenre had little choice in the matter. Is it true that the Secondboy of House Baenre was the one commanded to rid the House of the cursed Jarlaxle, who lay on the altar without a mark despite the repeated stabbing of the mighty matron mother herself?\"\u003c/p\u003e\n\u003cp\u003e\"You know the tale,\" Jarlaxle replied.\u003c/p\u003e\n\u003cp\u003e\"Yes, but I would like to hear it as often as you would deign to tell it. To see your mother\u0027s face twisted in exquisite frustration and horror when her blade would not bite into the infant! And then to see her expression of the sheerest terror, and that of Triel as well, when Secondboy Doquaio whisked you from the slab! He must have looked much like that bloody creature in Artemis\u0027s room when the infant Jarlaxle unwittingly released the captured energy into him.\"\u003c/p\u003e\n\u003cp\u003eKimmuriel took hope at Jarlaxle\u0027s chuckle, an indication, perhaps, that he had deflected the conversation from Calihye.\u003c/p\u003e\n\u003cp\u003e\"And of course, then Jarlaxle was no longer the third son, and no longer a fitting sacrifice,\" he rambled on.\u003c/p\u003e\n\u003cp\u003e\"I haven\u0027t seen Kimmuriel bantering this much since you wagged your hands in trying to alleviate a cramp in your forearm,\" Jarlaxle said, and the psionicist\u0027s lips went tight.\u003c/p\u003e\n\u003cp\u003e\"She was gone from the alley,\" Jarlaxle said. \"She didn\u0027t crawl far, for the blood trail ended - and rather abruptly, and right near a place where the blood had pooled. She was sitting there, against the wall, of course, before she was taken away.\"\u003c/p\u003e\n\u003cp\u003e\"Lady Calihye has made powerful enemies, and powerful friends,\" said Kimmuriel. \"Perhaps it is a good thing that Artemis Entreri is leaving the realm, and quickly.\"\u003c/p\u003e\n\u003cp\u003e\"And she has made friends of convenience,\" Jarlaxle remarked, staring his associate right in the eye. \"Who will turn on her, no doubt, at the slightest hint of betrayal.\"\u003c/p\u003e\n\u003cp\u003eKimmuriel didn\u0027t deny it.\u003c/p\u003e\n\u003cp\u003e\"This place is worth the trouble of Bregan D\u0027aerthe,\" Jarlaxle went on. \"There is much to be found here, such as the bloodstone, a mineral we cannot easily procure in the Underdark. With Knellict serving our... your cause, you will find easy access to it and other valuables.\"\u003c/p\u003e\n\u003cp\u003e\"You have explained it all, many times.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle clapped Kimmuriel on the shoulder, and the stiff psionicist just stared at him with awkward curiosity. Kimmuriel did intend to use Calihye and Knellict to create a network in the Bloodstone Lands, but in truth it was more for the preservation of Jarlaxle\u0027s reputation than for any monetary gains or increase of power the psionicist expected to make. Jarlaxle\u0027s reputation couldn\u0027t withstand another disaster like the one in Calimport, so close on the heels of that debacle, Kimmuriel believed, and the last thing he wanted was for Bregan D\u0027aerthe to turn away from Jarlaxle. For Jarlaxle would one day return to Menzoberranzan and resume his mantle of leadership. Bregan D\u0027aerthe needed that in order to keep Matron Mother Triel Baenre at proper distance and in proper humor, and more than that, Kimmuriel needed it. His pursuits of the purely intellectual were not served well by the responsibilities of maintaining Jarlaxle\u0027s band. He longed for the day when Jarlaxle returned and he could turn his attention more fully to the illithids and the mysteries of their expansive mental powers.\u003c/p\u003e\n\u003cp\u003eAnd turn his attention away from the concerns of the mercenary band, and away from protecting the increasingly renegade Jarlaxle.\u003c/p\u003e\n\u003cp\u003e\"I know that you doubt,\" Jarlaxle said, again as if reading his mind, which the psionicist knew to be impossible. Kimmuriel was far too mentally shielded for any such intrusions. \"And I am glad that you do, for else who would force me to question my every twist and turn?\"\u003c/p\u003e\n\u003cp\u003e\"Your own common sense?\"\u003c/p\u003e\n\u003cp\u003eJarlaxle laughed aloud. \"My vision is correct,\" he insisted.\u003c/p\u003e\n\u003cp\u003e\"Menzoberranzan demands our attention at all times.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle nodded. \"But the day will come when the contacts we - the contacts you secure on the surface will prove invaluable to the matron mothers.\"\u003c/p\u003e\n\u003cp\u003e\"What do you know?\"\u003c/p\u003e\n\u003cp\u003e\"I know that the world is in flux,\" said Jarlaxle. \"Entreri and I were attacked by a Netherese shade, and he made it quite clear that he was not alone. If the shadows fall across the World Above, the matron mothers will not wish to remain oblivious.\u003c/p\u003e\n\u003cp\u003e\"Furthermore, my friend, there is growing here on the surface a following of Eilistraee. Drizzt Do\u0027Urden is hardly unique among surface drow, and he is finding more acceptance among the surface dwellers.\"\u003c/p\u003e\n\u003cp\u003e\"Your former House - \"\u003c/p\u003e\n\u003cp\u003e\"I was never of their House,\" Jarlaxle corrected.\u003c/p\u003e\n\u003cp\u003e\"House Baenre,\" said Kimmuriel, \"will not go against Drizzt again, nor would they find any followers if they so decided. There are even priestesses postulating that Drizzt is secretly in the favor of Lolth.\"\u003c/p\u003e\n\u003cp\u003e\"They said the same of me after the failed sacrifice.\"\u003c/p\u003e\n\u003cp\u003e\"The evidence was strong.\"\u003c/p\u003e\n\u003cp\u003e\"And I have never bended knee for the spider bitch. Nor has Drizzt Do\u0027Urden. I am certain that if he learned that he was in Lady Lolth\u0027s favor, it would torment him more than a festering wound ever could.\"\u003c/p\u003e\n\u003cp\u003e\"More the reason for the goddess to so favor him, then.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle merely shrugged at the inescapable logic. Such was the irony of following a deity dedicated to chaos.\u003c/p\u003e\n\u003cp\u003e\"But I do not speak of Drizzt in any case,\" said Jarlaxle. \"I find it unlikely that the Spider Queen will tolerate the worshipers of Eilistraee much longer, and when that day of reckoning befalls the dancing fools, their judgment may well be served by the Houses of Menzoberranzan. Bregan D\u0027aerthe will prove invaluable at that time, of course.\"\u003c/p\u003e\n\u003cp\u003e\"Even if it is centuries hence.\"\u003c/p\u003e\n\u003cp\u003e\"Patience has sustained me,\" said Jarlaxle. \"And our endeavors will be profitable in the meantime. In human parlance, that is known as a win-win.\"\u003c/p\u003e\n\u003cp\u003e\"Humans often think they are winning until the moment they are thrown through the glass window.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle surrendered with another laugh and with the full understanding, Kimmuriel knew, that Bregan D\u0027aerthe would indeed exploit the contacts made here in this rugged land of Damara and Vaasa.\u003c/p\u003e\n\u003cp\u003eKimmuriel looked past Jarlaxle to the open field and nodded, and the other drow turned around.\u003c/p\u003e\n\u003cp\u003e\"Your dragons approach,\" said Kimmuriel.\u003c/p\u003e\n\u003cp\u003eJarlaxle turned back to him and extended his hand. \"Then farewell.\"\u003c/p\u003e\n\u003cp\u003eKimmuriel didn\u0027t shake the hand, and so Jarlaxle moved it to his belt pouch to show his lieutenant that he was carrying the item, as they had agreed. Kimmuriel nodded at that, and one hand came out from under his dark robes, bearing a small coffer that held three small vials.\u003c/p\u003e\n\u003cp\u003eJarlaxle\u0027s eyes gleamed when he viewed them. \"I have opened his heart, and now I will open his mind,\" he said.\u003c/p\u003e\n\u003cp\u003e\"For reasons that no sane drow could ever fathom.\"\u003c/p\u003e\n\u003cp\u003e\"Sane is boring.\"\u003c/p\u003e\n\u003cp\u003eKimmuriel snorted derisively as Jarlaxle took the potions. \"His mother, his childhood... these are the questions that will open Entreri\u0027s mind to you,\" the psionicist said, and as he retracted the empty coffer, he brought forth his other hand from under the folds of his robes, bearing Idalia\u0027s flute.\u003c/p\u003e\n\u003cp\u003e\"The residual memories lingering within the flute showed you this?\" asked Jarlaxle.\u003c/p\u003e\n\u003cp\u003e\"You asked me to inspect it, and so I did. You asked me for the potions, and so they are yours.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle, smiling widely, took the flute.\u003c/p\u003e\n\u003cp\u003e\"And now we are gone, Jarlaxle,\" said Kimmuriel. \"I\u0027ll not heed your call again until our next arranged meeting.\"\u003c/p\u003e\n\u003cp\u003e\"A long time hence.\"\u003c/p\u003e\n\u003cp\u003e\"Rightly so - I\u0027ve grown far too weary of this blinding surface world, and spent not enough energy heeding the needs of Bregan D\u0027aerthe in Menzoberranzan. It is a city of chaos and constant change, and my former master taught me well that Bregan D\u0027aerthe must change with it, or before it, even.\"\u003c/p\u003e\n\u003cp\u003e\"Your former master was brilliant, I am told.\"\u003c/p\u003e\n\u003cp\u003e\"So he often says.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle had rarely laughed as much in the presence of the dry-witted psionicist. \"I am certain that I will find the band well tended when I return to Menzoberranzan,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Of course. And when will that be?\"\u003c/p\u003e\n\u003cp\u003eJarlaxle glanced back toward Entreri, who stood with Athrogate before Ilnezhara and Tazmikella. \"A human\u0027s lifetime, perhaps.\"\u003c/p\u003e\n\u003cp\u003e\"Or the remainder of this one\u0027s?\"\u003c/p\u003e\n\u003cp\u003e\"Or that. But recall that he was infused with the stuff of shadow. It could be a longer time than you believe.\" He looked back at Kimmuriel and offered a wink. \"But I will indeed return.\"\u003c/p\u003e\n\u003cp\u003e\"Don\u0027t bring the dwarf.\"\u003c/p\u003e\n\u003cp\u003eYet another burst of laughter escaped Jarlaxle\u0027s lips, and Kimmuriel tightened his expression even more. Jarlaxle seemed almost giddy to him, and it was not a sight he enjoyed.\u003c/p\u003e\n\u003cp\u003e\"Why, Kimmuriel, you lack imagination!\" Jarlaxle declared dramatically. \"Do you not see that Athrogate would be a fine gift for my sister, whichever one rules House Baenre, when I return?\"\u003c/p\u003e\n\u003cp\u003eKimmuriel didn\u0027t smile at all, and at that, Jarlaxle only laughed even louder.\u003c/p\u003e\n\u003cp\u003e\"Well, I ain\u0027t much for wizard teleportin\u0027,\" Athrogate was grumbling when Jarlaxle joined the foursome at the boulder tumble in the small field. The dwarf blew a stray strand of black hair from his mouth and crossed his burly arms over his chest. For added effect, he stomped one foot, which set his morningstar heads bouncing at the ends of their respective chains, one over each shoulder as the weapons were crossed on his back. \"Knew a halfling once joined a mage such. A skinny old wizard in need of a crutch. And his eyes weren\u0027t so good to the price o\u0027 their bones, for he shot a bit low and landed both in the stones! Bwahaha!\"\u003c/p\u003e\n\u003cp\u003eAthrogate snapped off his knee-slapping laughter almost as soon as it began, re-crossed his arms and returned a scowl at Jarlaxle. \"And I\u0027m meanin\u0027 in the stones.\"\u003c/p\u003e\n\u003cp\u003eThe drow looked to Entreri, who just stood there shaking his head and showing no interest in tipping the dwarf off to the reality of their impending journey. He turned to the dragon sisters, who seemed quite amused by it all.\u003c/p\u003e\n\u003cp\u003e\"You think they have come to teleport us?\" Jarlaxle asked. \"You forget your flight across the tavern\u0027s common room.\"\u003c/p\u003e\n\u003cp\u003e\"Ain\u0027t forgetting nothing,\" said the dwarf. \"Wizard tricks... bah! They ain\u0027t to throw us across the damn sea. Though hell of a landing that might be!\"\u003c/p\u003e\n\u003cp\u003e\"Wizard?\" the oblivious Entreri asked, for he had not witnessed the flying dwarf. \"You think they mean to teleport us?\"\u003c/p\u003e\n\u003cp\u003e\"Well they ain\u0027t about to carry me, with skinny girl arms and skinny girl knees! Bwahaha!\"\u003c/p\u003e\n\u003cp\u003e\"Well maybe instead they\u0027ll tie you to a tree,\" rhymed Entreri, drawing curious, surprised stares from all the others. \"Bend it to the ground and let it fly free. Launching you high to the clouds in the sky, and when you come falling we all hope you\u0027ll die.\"\u003c/p\u003e\n\u003cp\u003eAthrogate\u0027s lips moved as he digested the words by repeating them, and Entreri, his brow furrowed, for he was far from joking, wisely moved a hand to his sword hilt as if expecting the dwarf to launch himself forward.\u003c/p\u003e\n\u003cp\u003eBut Athrogate exploded into laughter instead of into action. \"Bwahaha! Hey, I\u0027m stealin\u0027 that!\"\u003c/p\u003e\n\u003cp\u003e\"An appropriate price,\" Ilnezhara said. \"Can we be on with this? I\u0027ve a shop to attend in the morning.\"\u003c/p\u003e\n\u003cp\u003e\"Of course, milady,\" Jarlaxle said with one of his characteristic, hat-sweeping bows. \"But we must prepare our oblivious friend - \"\u003c/p\u003e\n\u003cp\u003e\"No, I don\u0027t think we shall,\" said Ilnezhara, and her voice changed abruptly in timbre and volume, cutting Jarlaxle short and sending Athrogate\u0027s jaw to his chest.\u003c/p\u003e\n\u003cp\u003e\"I care not what he might say, and less that he runs away!\" Ilnezhara roared, and the boulders shook from the strength of her voice.\u003c/p\u003e\n\u003cp\u003eHer jaws elongated, as if the sheer power of the words had pulled it forward, and a pair of copper-colored horns prodded through her golden hair and stretched upward. As she half-turned, a heavy tail thumped onto the ground and began to lengthen, as her torso stretched and twisted, bones popping into place.\u003c/p\u003e\n\u003cp\u003e\"You thought we\u0027d ride in a wagon,\" Entreri teased the mercifully speechless dwarf. \"But instead we\u0027re flying a...\" He paused and waved his hand to prompt the poet dwarf. \"Yes, as I expected,\" Entreri remarked when no words came forth.\u003c/p\u003e\n\u003cp\u003e\"Uh-uh,\" said Athrogate, his hands out in front of him and waving, and he began backing away.\u003c/p\u003e\n\u003cp\u003eHardly noticed at the side, Jarlaxle produced a thin wand and pointed it at Entreri, then Athrogate, then himself, each time speaking the command word to enact its magic.\u003c/p\u003e\n\u003cp\u003e\"Ah, but to soar to the clouds!\" Jarlaxle said, and he moved around Ilnezhara. \"May I mount you, good lady?\" he teased, and Ilnezhara, her transformation continuing, her body elongating, roared in reply. Jarlaxle scrambled astride her scaly back just before two great leathery wings erupted from behind her shoulders, snapping out mightily to their full extension.\u003c/p\u003e\n\u003cp\u003e\"Dragon,\" Athrogate muttered.\u003c/p\u003e\n\u003cp\u003e\"You missed the cue, sorry,\" Entreri said to him, his voice mirthless though he enjoyed the spectacle of a befuddled Athrogate.\u003c/p\u003e\n\u003cp\u003e\"Dragon,\" sputtered Athrogate. \"It\u0027s a dragon. She\u0027s a wyrm... a dragon... a dragon.\"\u003c/p\u003e\n\u003cp\u003e\"May I eat the dwarf?\" Ilnezhara asked Jarlaxle as soon as her transformation was complete. She stood on four legs, a mighty copper dragon. \"I will need sustenance for the journey.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle leaned forward and whispered into her ear, and her serpentine neck snapped her head out toward Athrogate, who blanched and nearly fainted. Ilnezhara hit him with a burst of her windy breath, a magical cone of \"heavy\" air. Suddenly Athrogate seemed to be moving much more slowly, and he turned as if running through deep mud.\u003c/p\u003e\n\u003cp\u003eBut Ilnezhara had no such bonds on her, and she reared and leaped forward, a single snapping beat of her wings lifting her and her rider drow from the ground. They shot past Entreri, who fell away, and Tazmikella, who seemed to take pleasure in the sudden buffet of wind.\u003c/p\u003e\n\u003cp\u003eAthrogate dived aside - or was beginning to - when Ilnezhara passed over him, and her claw grabbed him hard and yanked him along. In a blink of the stunned and terrified dwarf\u0027s eye, he found himself fifty feet off the ground and climbing fast.\u003c/p\u003e\n\u003cp\u003e\"I will miss you, Artemis Entreri,\" Tazmikella said when the two were alone on the field. \"I grew fond of you, though I never came to trust you.\" She gave a little grin as her face started to twist and distort. \"Perhaps there is something to this element of danger that my sister so enjoys.\"\u003c/p\u003e\n\u003cp\u003eEntreri wanted to remind her that she was a dragon, but it occurred to him that insulting such a creature might not be the smartest thing he ever did. As Tazmikella moved more fully into her transformation, he slipped around her side and onto her back, thinking to emulate Jarlaxle instead of Athrogate.\u003c/p\u003e\n\u003cp\u003eIn a few moments, they were airborne, the wind whipping around them, the world spinning below in a dizzying blur. Entreri and Athrogate didn\u0027t know it, but Jarlaxle\u0027s use of the wand saved them from the killing bite of the winter wind. As the dragons climbed higher into the cold sky, the trio of lesser creatures would have frozen to death had it not been for the protective enchantment.\u003c/p\u003e\n\u003cp\u003eArtemis Entreri didn\u0027t notice any of that. His cape buffeted out behind him and the world below moved past at dizzying speed. Shortly into the flight, he could see the northern shore of the Moonsea.\u003c/p\u003e\n\u003cp\u003eStill the dragons climbed, so that any observers on the ground would think them nothing more than a bird. A short while later, to Entreri\u0027s surprise, they went out over the sea, and the sisters executed a right turn, veering west-southwest. They flew through the night and landed on a small island just before the break of dawn.\u003c/p\u003e\n\u003cp\u003eEntreri scrambled down from Tazmikella.\u003c/p\u003e\n\u003cp\u003e\"Rest,\" the dragon instructed. \"We will be up again at nightfall, to finish crossing the sea. We will set you down north of Cormyr, and there your road is your own.\"\u003c/p\u003e\n\u003cp\u003eEntreri noted the approach of Jarlaxle and Athrogate - mostly from the sputtering and grumbling of the obviously thoroughly shaken dwarf.\u003c/p\u003e\n\u003cp\u003e\"Ought to hit \u0027em both,\" he mumbled. \"Treatin\u0027 a dwarf like that. Just ain\u0027t polite.\"\u003c/p\u003e\n\u003cp\u003eEntreri could only hope that his threat was more than mere words. The spectacle of Tazmikella\u0027s giant maw closing over Athrogate was one the assassin surely would enjoy, but he let the pleasant image go and kept his attention on the dragon.\u003c/p\u003e\n\u003cp\u003e\"I have coin,\" he said. \"Some, at least.\" He gave a look to Jarlaxle. \"I would ask that you take me farther along that course, to the southwest.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle came up beside him then, and offered him a curious glance. \"Cormyr is a fine diversion,\" he said.\u003c/p\u003e\n\u003cp\u003e\"I wish you well there, in that case,\" said Entreri, and Jarlaxle backed a step and blinked as if he had been slapped. \"I\u0027ve neither the time nor the desire.\"\u003c/p\u003e\n\u003cp\u003e\"How far would you wish to go?\" Tazmikella asked, keeping her dragon voice as quiet as she could so that it did not carry across the open water.\u003c/p\u003e\n\u003cp\u003e\"As far as you will take me. My road is to Memnon, on the southern Sword Coast.\"\u003c/p\u003e\n\u003cp\u003e\"That is a long way,\" remarked Ilnezhara.\u003c/p\u003e\n\u003cp\u003eEntreri looked to Jarlaxle. \"Whatever my share is, give it to them.\"\u003c/p\u003e\n\u003cp\u003e\"Share of what?\" the drow replied. \"We lost.\"\u003c/p\u003e\n\u003cp\u003eEntreri narrowed his eyes.\u003c/p\u003e\n\u003cp\u003e\"I can arrange some payment,\" Jarlaxle said to the dragons. \"How much will you require? Or perhaps there are other things for which you would barter. We can discuss it later.\"\u003c/p\u003e\n\u003cp\u003eThe dragons exchanged wary looks, which struck Entreri as very strange, since they were, after all, dragons.\u003c/p\u003e\n\u003cp\u003eExcept at that moment, Ilnezhara reverted to her human form, and bade her sister to do likewise. \"In case the island has visitors,\" the blond-haired woman explained, though Tazmikella\u0027s look as she came out of her natural form showed that she understood Ilnezhara\u0027s ulterior motives all too well, particularly when Ilnezhara shot Jarlaxle a rather lewd wink.\u003c/p\u003e\n\u003cp\u003e\"That, too, of course,\" said Jarlaxle. \"Though I feel as if I should pay you even more.\"\u003c/p\u003e\n\u003cp\u003e\"You should,\" said Ilnezhara.\u003c/p\u003e\n\u003cp\u003eEntreri\u0027s sigh showed that he had heard about enough of that nonsense. \"Will you fly me?\"\u003c/p\u003e\n\u003cp\u003e\"Not all the way to Memnon, no,\" Tazmikella replied. \"I\u0027ve made enemies in the southern deserts that I do not wish to encounter. But we will see how far the winds will carry us.\"\u003c/p\u003e\n\u003cp\u003e\"And what of you?\" Ilnezhara asked Jarlaxle.\u003c/p\u003e\n\u003cp\u003e\"And meself?\" Athrogate asked hopefully.\u003c/p\u003e\n\u003cp\u003eJarlaxle and the dragon looked at the dwarf.\u003c/p\u003e\n\u003cp\u003e\"Well, ye taked me from the place I\u0027ve known as home for many a year,\" Athrogate protested. \"Ye can\u0027t be expecting me to just swim to Cormyr, now can ye?\"\u003c/p\u003e\n\u003cp\u003e\"We will stay together, we three,\" Jarlaxle answered both the dragon and the dwarf. \"I would be grateful if you would fly me in the wake of your sister and Artemis.\"\u003c/p\u003e\n\u003cp\u003eIf he was trying to gauge the reaction of the surprising Entreri as he declared his intentions, the drow was sorely disappointed, for Entreri, who simply did not care, had already started away.\u003c/p\u003e\n\u003cp\u003eIlnezhara grabbed Jarlaxle by the hand and pulled him along. \"Come and show me your gratitude,\" she bade him.\u003c/p\u003e\n\u003cp\u003eJarlaxle followed without complaint, but he kept looking back at Entreri, who sat with his back against a rock, staring out at the dark and empty waters to the west.\u003c/p\u003e\n\u003cp\u003e\"I remain surprised that you would provide such information,\" Ilnezhara said to Jarlaxle around noon the next day, when she awoke beside him. \"Why would you trust me with such information after I sided with King Gareth against you? Or is it that you wish harm to befall this Kimmuriel creature and your former associates?\"\u003c/p\u003e\n\u003cp\u003e\"You will not see Kimmuriel, nor any of my Underdark brethren,\" a sleepy Jarlaxle replied. He yawned and stretched, and considered his surroundings. Waves lapped rhythmically at the rocky shores of the small island, drowned out intermittently by Athrogate\u0027s snoring. \"They will work from the shadows below.\"\u003c/p\u003e\n\u003cp\u003e\"Then why tell me?\"\u003c/p\u003e\n\u003cp\u003e\"They pose no threat to King Gareth,\" said Jarlaxle. \"And now I know your loyalty there. Indeed, Kimmuriel will force Knellict to behave himself, so consider the efforts of Bregan D\u0027aerthe to be a welcomed leash on the Citadel of Assassins. And an opportunity for you and your sister. Items we consider commonplace and cheap in Menzoberranzan will no doubt interest you greatly for your collections, and will bring a fine price on the surface. Similarly, you can barter goods that hold little value here but will light the red eyes of matron mothers in the city of drow.\"\u003c/p\u003e\n\u003cp\u003e\"Bregan D\u0027aerthe is a merchant operation, then?\"\u003c/p\u003e\n\u003cp\u003e\"First, foremost, and whenever the choice is before us.\"\u003c/p\u003e\n\u003cp\u003eIlnezhara slowly nodded, though her expression remained doubtful. \"We will watch them carefully.\"\u003c/p\u003e\n\u003cp\u003e\"You will never see them,\" said Jarlaxle, and he pulled himself to his feet and gathered his clothing. \"Kimmuriel is not skilled in the ways of polite society. Ever has that been my role, and of course your beloved King Gareth is too small a man to understand the worth of my company. Now, if you will excuse me, good lady. The day grows long already and I must go and speak with my associate.\" He finished with a bow, and pulled on his shirt.\u003c/p\u003e\n\u003cp\u003e\"He surprised you with his request,\" Ilnezhara said as Jarlaxle started away. The drow paused and glanced back.\u003c/p\u003e\n\u003cp\u003e\"Or are you simply not used to him leading?\" Ilnezhara teased.\u003c/p\u003e\n\u003cp\u003eJarlaxle grinned, shrugged, and walked off. He spotted Entreri, dozing against the same rock, shaded from the rising sun and with the western waters before him.\u003c/p\u003e\n\u003cp\u003eThe drow looked all around, then quickly quaffed one of the potions Kimmuriel had given him. He waited a moment for the magic to settle in, then focused his attention on Entreri, considering the questions he might ask to spur the man\u0027s thoughts.\u003c/p\u003e\n\u003cp\u003eJarlaxle blinked in surprise, for Entreri\u0027s thoughts began to crystallize in his intruding mind. The potions facilitated mind-reading, and as images of a great seaport began to flit through his thoughts, Jarlaxle realized that Entreri was already there, in Memnon, the city of his birth.\u003c/p\u003e\n\u003cp\u003eSo clear were those images that Jarlaxle could almost smell the salty air, and hear the seabirds. Entreri\u0027s dream - was it a dream or a memory, the drow wondered - showed him a plain-looking woman, one who might have once been somewhat attractive, though the soil and dust, and hard living had taken a great toll on her. Her few remaining teeth were crooked and yellow, and her eyes, perhaps once shining black orbs, showed the listlessness of despair, the empty and weary eyes of a person who had suffered prolonged poverty. The world had broken that once-pretty woman.\u003c/p\u003e\n\u003cp\u003eJarlaxle felt a tenderness emanating from Entreri as the man\u0027s dream lingered on her.\u003c/p\u003e\n\u003cp\u003eThen a cart, a priest, a young boy\u0027s screams...\u003c/p\u003e\n\u003cp\u003eJarlaxle fell back a step as a wave of rage rolled out from Entreri to nearly overwhelm him. Such anger! Passionate, feral outrage!\u003c/p\u003e\n\u003cp\u003eHe saw the woman again, receding into the dust, and sensed that he was on a cart rolling away from her. The tenderness was gone, replaced by a sense of betrayal that filled Jarlaxle with trepidation.\u003c/p\u003e\n\u003cp\u003eThe drow came out of it, shaken, a short while later. He stood staring at Entreri, and he knew that what he had seen when he had insinuated himself into the assassin\u0027s dreams were indeed memories.\u003c/p\u003e\n\u003cp\u003e\"Your mother,\" the drow whispered under his breath as he considered the image of the black-haired, black-eyed woman.\u003c/p\u003e\n\u003cp\u003eThe drow snorted at the irony. Perhaps the kinship he felt toward Artemis Entreri was more rooted in common experiences than he had consciously known. \u003c/p\u003e","sourceLink":"https://allnovel.net/road-of-the-patriarch-the-sellswords-3/page-21.html","bookId":2139,"creation":"Oct 5, 2019 6:15:12 PM","modification":"Oct 5, 2019 6:15:12 PM"}
