{"id":95511,"no":27,"title":"Page 27","content":"\u003cp\u003eThe commotion behind him did little to take Entreri\u0027s gaze from the city below him. He stood on the jag of rock at the paupers\u0027 graveyard, staring down at the plume of smoke that hung lazily over the ruins of the Protector\u0027s House.\u003c/p\u003e\n\u003cp\u003eHis vengeance had been sated, obviously so, but there was little left in the man. Finally he turned back to Jarlaxle, who had opened his portable hole against another stone, and stood with Athrogate beside him, staring into the darkness.\u003c/p\u003e\n\u003cp\u003e\"Well, ye might as well be coming here,\" the dwarf recited. \"Afore I find me way in there. In that case, yerself should fear, me pulling ye out by the tip o\u0027 yer ears!\"\u003c/p\u003e\n\u003cp\u003eEntreri rubbed a hand over his weary face, and moved down from the perch as Devout Gositek, his face all bruised, crawled out of the hole.\u003c/p\u003e\n\u003cp\u003e\"I am not afraid to die,\" he said, trembling so badly he seemed as if he was about to soil himself.\u003c/p\u003e\n\u003cp\u003eJarlaxle turned deferentially to Entreri.\u003c/p\u003e\n\u003cp\u003e\"Then get out of here,\" the assassin said.\u003c/p\u003e\n\u003cp\u003eGositek\u0027s jaw dropped open.\u003c/p\u003e\n\u003cp\u003e\"Generous,\" Jarlaxle remarked.\u003c/p\u003e\n\u003cp\u003e\"Surprised,\" said Athrogate.\u003c/p\u003e\n\u003cp\u003eGositek looked at the elf and dwarf, then scrambled for the stair. But Entreri intercepted him, and with frightening strength yanked him aside and ran him to the very edge of the hundred-foot drop.\u003c/p\u003e\n\u003cp\u003e\"No, please!\" the priest who was not afraid to die desperately pleaded.\u003c/p\u003e\n\u003cp\u003e\"If you wish to remain alive, then look down there,\" Entreri growled in his ear. \"Mark well the destruction of the Protector\u0027s House. You will rebuild it - you and your fellow priests?\"\u003c/p\u003e\n\u003cp\u003eWhen Gositek didn\u0027t immediately answer, Entreri shifted him forward, almost off the ledge.\u003c/p\u003e\n\u003cp\u003eThe terrified man yelped and blurted, \"Yes!\"\u003c/p\u003e\n\u003cp\u003eEntreri tugged him back. \"And you will never forget their names again,\" he instructed. \"Any of them. And you and your brethren will come up here, every day, and pray for the souls of those who have gone before.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, yes, yes,\" Gositek stammered.\u003c/p\u003e\n\u003cp\u003e\"Do you understand me?\" Entreri roared, shaking him near the edge again.\u003c/p\u003e\n\u003cp\u003e\"I do! We will!\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t believe you,\" Entreri said, and the man began to cry.\u003c/p\u003e\n\u003cp\u003eEntreri threw him back from the cliff and to the ground. \"Remember that view,\" he warned. \"For if you forget your promise, you will see it again, with smoke once more rising from the ruins of your rebuilt temple. And on that next occasion, I will throw you from the cliff.\"\u003c/p\u003e\n\u003cp\u003eThe man nodded stupidly as he crawled away. Finally, near the edge of the graveyard, he managed to put his feet under him, and he scrambled down the long stair.\u003c/p\u003e\n\u003cp\u003eEntreri moved to the top of that stair and watched him run away.\u003c/p\u003e\n\u003cp\u003e\"Are you satisfied now, my friend?\" Jarlaxle asked.\u003c/p\u003e\n\u003cp\u003eEntreri put his head down and forced himself to remain calm then turned around, his expression revealing his emptiness.\u003c/p\u003e\n\u003cp\u003eJarlaxle offered a shrug. \"It is often the way,\" he said. \"We\u0027ve all demons needing to be put to rest, but the experience is not as rewardi - \"\u003c/p\u003e\n\u003cp\u003e\"Shut up,\" Entreri interrupted.\u003c/p\u003e\n\u003cp\u003eAthrogate laughed.\u003c/p\u003e\n\u003cp\u003e\"We must be gone from this place,\" Jarlaxle said.\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t care where you go,\" Entreri answered. He reached into his pouch and pulled forth Idalia\u0027s flute, which he had broken into two pieces. He locked stares with the drow and tossed it to Jarlaxle\u0027s feet.\u003c/p\u003e\n\u003cp\u003eJarlaxle gave a helpless chuckle, but there was no real mirth in it. Finally breaking Entreri\u0027s imposing stare, he bent and retrieved the flute. \"A valuable item,\" he said.\u003c/p\u003e\n\u003cp\u003e\"Cursed,\" came Entreri\u0027s reply.\u003c/p\u003e\n\u003cp\u003e\"Ah, Artemis,\" said the drow. \"I understand your wounds and your anger, but in the end, you will see that this was all for the best.\"\u003c/p\u003e\n\u003cp\u003e\"You might be right, but that changes little.\"\u003c/p\u003e\n\u003cp\u003e\"How so?\" asked the drow.\u003c/p\u003e\n\u003cp\u003eEntreri pulled his pack around. He fished out the obsidian figurine and dropped it to the ground, calling forth his nightmare mount. As the creature materialized, Entreri pulled forth another object and sent it spinning at Jarlaxle.\u003c/p\u003e\n\u003cp\u003eA black, small-brimmed hat.\u003c/p\u003e\n\u003cp\u003e\"I am finished with you,\" Entreri said. \"Your road is your own, and I care not if it takes you to the gates of the Nine Hells.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle caught the hat and rolled it over in his slender hands. \"But Artemis, be reasonable.\"\u003c/p\u003e\n\u003cp\u003e\"I have never been more so,\" Entreri replied, and he put one foot in a stirrup and hoisted himself astride the tall black horse. \"Farewell, Jarlaxle. Or fare ill. It matters not to me.\"\u003c/p\u003e\n\u003cp\u003e\"But I am your muse.\"\u003c/p\u003e\n\u003cp\u003e\"I don\u0027t like the songs you inspire.\"\u003c/p\u003e\n\u003cp\u003eEntreri turned his mount around, stepping to the stair.\u003c/p\u003e\n\u003cp\u003e\"Where will you go?\"\u003c/p\u003e\n\u003cp\u003eThe assassin paused and looked back sourly.\u003c/p\u003e\n\u003cp\u003e\"I can find out, in any case,\" Jarlaxle reminded him.\u003c/p\u003e\n\u003cp\u003e\"To Calimport,\" Entreri answered, and he gave a helpless laugh at the truth of the drow\u0027s statement - and Jarlaxle took heart in that, at least. \"To Dwahvel, and to a place I might call home.\"\u003c/p\u003e\n\u003cp\u003e\"Ah, Mistress Tiggerwillies!\" Jarlaxle said with sudden animation. \"And will you seek to regain your status among the streets of that fair city?\"\u003c/p\u003e\n\u003cp\u003eEntreri chortled and nodded toward the distant plume of smoke. \"Artemis Entreri is dead,\" he said. \"He died in the Protector\u0027s House in Memnon, chasing ghosts.\"\u003c/p\u003e\n\u003cp\u003eHe turned his horse away, down the stairs and out of sight.\u003c/p\u003e\n\u003cp\u003e\"Might that we should follow him,\" Athrogate said to Jarlaxle. \"He\u0027ll be getting\u0027 hisself into trouble, no doubt. It\u0027s the way his blood\u0027s flowing.\"\u003c/p\u003e\n\u003cp\u003eBut Jarlaxle, staring at the empty stair, shook his head with every word. \"No,\" he said. \"And no. I suspect that Artemis Entreri really is dead, my friend.\"\u003c/p\u003e\n\u003cp\u003e\"Looked living to me.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle laughed, not willing to explain it, and not expecting that Athrogate, who had his own emotional barriers defining him, would begin to understand.\u003c/p\u003e\n\u003cp\u003eBut Athrogate remarked, \"Ah, he died the way meself died when them orcs come to Felbarr.\"\u003c/p\u003e\n\u003cp\u003e\"More than three centuries ago?\" Jarlaxle asked.\u003c/p\u003e\n\u003cp\u003e\"Three and a half, elf.\"\u003c/p\u003e\n\u003cp\u003e\"And yet you look so young.\"\u003c/p\u003e\n\u003cp\u003e\"Might be that livin\u0027 long\u0027s a curse more than a blessing.\"\u003c/p\u003e\n\u003cp\u003e\"A curse imposed by...?\"\u003c/p\u003e\n\u003cp\u003e\"Ever twist the bum hairs of a wizard, elf?\"\u003c/p\u003e\n\u003cp\u003eJarlaxle rolled his eyes and laughed.\u003c/p\u003e\n\u003cp\u003e\" \u0027Ill-argued and ill-met, he telled me. A pox on me bones for not payin\u0027 me debt. To grab the sun and not let it set, ye\u0027ll not die young, and ye\u0027ll never forget. \"\u003c/p\u003e\n\u003cp\u003e\"That was his curse?\"\u003c/p\u003e\n\u003cp\u003e\"And after three hunnerd years, I\u0027m tellin\u0027 ye it worked.\"\u003c/p\u003e\n\u003cp\u003eJarlaxle nodded and considered the tale for a short while. Then, on a sudden impulse, he reached over and plopped the hat atop the dwarf\u0027s hairy head.\u003c/p\u003e\n\u003cp\u003e\"Hey, now!\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Jarlaxle said, nodding with admiration. \"It suits you well.\"\u003c/p\u003e\n\u003cp\u003eAs he spoke, the drow dropped a hand into his pouch, feeling the broken pieces of Idalia\u0027s flute and wondering how much it would cost him to get it repaired.\u003c/p\u003e\n\u003cp\u003eHe winced just a bit, because he realized that Athrogate couldn\u0027t likely blow a note.\u003c/p\u003e\n\u003cp\u003eBut he looked back to the empty stair, where Artemis Entreri had gone, and he reminded himself that sometimes you just had to play the hand you were dealt. \u003c/p\u003e","sourceLink":"https://allnovel.net/road-of-the-patriarch-the-sellswords-3/page-27.html","bookId":2139,"creation":"Oct 5, 2019 6:15:12 PM","modification":"Oct 5, 2019 6:15:12 PM"}
