{"id":72296,"no":39,"title":"Page 39","content":"\u003cp\u003eCecily buries her face against Jenna’s arm and closes her eyes. I close my eyes too. We’re in the Gatherers’ van all over again, recoiling into the darkness, wanting to disappear in the safety of one another.\u003c/p\u003e\n\u003cp\u003e“The attendants said you’ve been turning them away,” Linden says. “At least let me send someone up with fresh bedsheets.”\u003c/p\u003e\n\u003cp\u003e“No,” Cecily murmurs. “Don’t send anyone. Tell them all to leave her alone.”\u003c/p\u003e\n\u003cp\u003e“Can’t I do anything?” he says.\u003c/p\u003e\n\u003cp\u003e“No,” I say.\u003c/p\u003e\n\u003cp\u003e“No,” Cecily echoes.\u003c/p\u003e\n\u003cp\u003eI can feel our husband standing in the doorway. The closeness of his wives frightens him, as if one dying wife could be the death of all three.\u003c/p\u003e\n\u003cp\u003eEventually he leaves without another word.\u003c/p\u003e\n\u003cp\u003eJenna mutters a word I can’t understand. I think it’s a name. I think she’s looking for her sisters.\u003c/p\u003e\n\u003cp\u003e“It’s not safe for you here,” she says. I don’t know if she’s talking to her sisters, or to us.\u003c/p\u003e\n\u003cp\u003eChapter 23\u003c/p\u003e\n\u003cp\u003eJenna was right. She leaves before I do. We lose her on January 1, in the early hours before the sun comes up. It’s just Cecily and me at her side, and after days of living in her bed, all that was left was for us to talk to her for a while as her eyes fluttered open and shut. We wanted her to know she wasn’t alone. For all our months together as sister wives, I should have had something meaningful to say to her, but in the end I could only bring myself to talk about the weather as I watched her die.\u003c/p\u003e\n\u003cp\u003eAnd now she’s gone. Her eyes are still open, but they’ve taken on a deeper shade of gray. Hollow. Like a machine that’s been unplugged. I lower her eyelids with my thumb and index finger, and then I kiss her forehead.\u003c/p\u003e\n\u003cp\u003eShe’s still warm. Her body still looks like it’s about to draw a breath.\u003c/p\u003e\n\u003cp\u003eCecily stands and begins to pace. She touches her forehead, her chest. “I don’t understand,” she says. “It happened so fast.”\u003c/p\u003e\n\u003cp\u003eI think of how happy she was when Rose died, how she immediately asserted herself as the one willing to bear Linden’s child. They’ve already talked about having more.\u003c/p\u003e\n\u003cp\u003e“Housemaster Vaughn should have been able to prolong—”\u003c/p\u003e\n\u003cp\u003e“Don’t mention his name,” I say fiercely, but I don’t know why I’m getting upset with her. I haven’t been able to stand the sight of her since Jenna became sick, and I’m not sure why that is. But now isn’t the time to dwell on it.\u003c/p\u003e\n\u003cp\u003eI tuck Jenna’s long hair behind her ears and try to comprehend her stillness. She’s like a wax figure, when only a minute ago she was a human being. Cecily gets into the bed with her and buries her face in Jenna’s neck and says her name. Jenna, Jenna, Jenna. Over and over, like it will do any good.\u003c/p\u003e\n\u003cp\u003eIt isn’t long before Vaughn comes to check on Jenna’s vitals. He doesn’t even have to approach the bed. He can see in Cecily’s tears, in my distant gaze out the window, that our sister wife is gone. He says it’s a pity but when he checked on her last night he knew she wouldn’t be long for this world.\u003c/p\u003e\n\u003cp\u003eWhen the attendants and their gurney come for Jenna’s body, Cecily is still holding on. But she’s too dis-traught to protest when Jenna’s hand is pulled from her grasp. “Be brave,” is all Cecily says.\u003c/p\u003e\n\u003cp\u003eI hear her a short while later. She’s in the sitting room, playing an angry Bach in D minor. The keys are like the footsteps of death storming down the hall.\u003c/p\u003e\n\u003cp\u003eI listen to it as I lie on my bedroom floor, too bereft even to move toward my bed. I imagine this great music pouring out of Cecily’s small body, notes hovering around her in reds and blacks, like a dark genie awoken from its slumber.\u003c/p\u003e\n\u003cp\u003eI wait for her music to stop. I wait for her to appear in my doorway, teary-eyed, asking if she can lie beside me for a while the way she always does when she’s upset.\u003c/p\u003e\n\u003cp\u003eBut she doesn’t come. Instead my doorway is filled with her angry, fearless song.\u003c/p\u003e\n\u003cp\u003eBe brave, it seems to say.\u003c/p\u003e\n\u003cp\u003eI want to be away from here. I want to escape now. I can’t stand to be in this mansion, with Vaughn doing who knows what to my sister wife’s body while the rest of us are expected to eat our dinner and drink our tea. Cecily carries Bowen around like he’s her little rag doll, and the two of them are red from crying. He’s the most discontent baby on the planet. Probably means he’s intuitive.\u003c/p\u003e\n\u003cp\u003eWithin hours Vaughn gives us the ashes to scatter, and Cecily clings to the urn. She asks if it would be all right for her to keep Jenna’s ashes on a shelf in her room.\u003c/p\u003e\n\u003cp\u003eIt will make her feel better. I say that’s fine by me, and quietly I resent her ignorance.\u003c/p\u003e\n\u003cp\u003eIn bed that night I hear a soft knock at the door, but I don’t answer. Partly because I don’t want to see anyone, but mostly because I am a million miles from earth. I have been lying in the dark for what seems like forever, listening to the distant sobs of a girl who has possessed my skin. I am floating in space.\u003c/p\u003e\n\u003cp\u003eWhen I do phase back to my senses, the wailing sounds coming from me are terrible and inhuman.\u003c/p\u003e\n\u003cp\u003eThe door opens, filling my bedroom with light, and I curl away from it, just like I did in the van. I feel all at once how heavy my body is, how raw my throat is from all the screaming. My vision is blurry and wet.\u003c/p\u003e\n\u003cp\u003e“Rhine?” Linden says. His voice is barely familiar. I don’t want to see him, and I try to tell him to go away, but when I open my mouth, there are only these unintelligible sounds. He sits on the edge of the bed and rubs my back. I try to shrug him away, but I don’t have the strength.\u003c/p\u003e\n\u003cp\u003e“Sweetheart, you’re scaring me. I’ve never seen you like this.”\u003c/p\u003e\n\u003cp\u003eThat’s right. I’m Rhine, the orphan who trained to be his bride, who is happy to be here. Maybe in his mind I should even be happy because one dead sister wife means more of his time can be devoted to me. But I was always more of a sister wife than an actual wife. I can’t imagine being in this marriage with him alone.\u003c/p\u003e\n\u003cp\u003e“What can I do for you?” He kneels by the bed, pushes the hair from my face. I stare at him through a mess of tears. Set me free, I think. Send me back to last year. Give Jenna her sisters back.\u003c/p\u003e\n\u003cp\u003eI just shake my head. I cover my face with my fists, but he moves them away, and I don’t put up any kind of a fight.\u003c/p\u003e\n\u003cp\u003e“It’s a new year now,” he says softly. “There’s a party tomorrow night. Would you like that?”\u003c/p\u003e\n\u003cp\u003e“No,” I choke out.\u003c/p\u003e\n\u003cp\u003e“Yes, you would,” he says. “Deirdre is already working hard on your dress, and Adair is even helping her.”\u003c/p\u003e\n\u003cp\u003eAdair. What’s to become of him now that Jenna is gone? He worked for her, and her alone. Though, there wasn’t much to do—Jenna was so self-sufficient, and she rarely had any cause to wear new clothes. Maybe it makes him feel useful to help with my dress. I can’t just throw it back in Adair’s face. I swallow a lump in my throat and nod assent.\u003c/p\u003e\n\u003cp\u003e“There. That’s better,” Linden says. But I can see in his eyes that he knows I’m in pain. Maybe as much pain as he felt when he lost Rose. When she died, he threw things, screamed for all of us to go away. So doesn’t he understand that I want to be alone too?\u003c/p\u003e\n\u003cp\u003eBut he’s not having it. “Move over,” he says softly, and lifts up the blankets and climbs into the bed with me.\u003c/p\u003e\n\u003cp\u003eWhen he pulls me to his chest, I don’t know if it’s meant to comfort me or him. But I crumple in his arms and succumb again quickly to tears. I try to float into outer space, to disappear from this miserable world for a while, but all night I’m kept firmly in place by his fragile bones.\u003c/p\u003e\n\u003cp\u003eEven as I phase in and out of a restless sleep, I feel him there, holding me with more strength than I thought he had.\u003c/p\u003e\n\u003cp\u003eAs I expected, Deirdre and Adair parade into my room the following afternoon with a stunning dress.\u003c/p\u003e\n\u003cp\u003eIn Manhattan there’s not much cause to attend a New Year’s celebration. It’s an occasion reserved mostly for first generations who have the wealth and longevity to celebrate. It’s also an opportunity for orphans to break into unattended houses in more well-to-do areas. Rowan and I would spend the first nights of the new year ramping up security and making sure the gun was loaded. It’s also something of a free-for-all for Gatherers. There are all those drunk, gorgeous, motherless girls who dance and sell sparklers in the park. Rowan won’t even let me leave the house to go to work, it’s so unsafe.\u003c/p\u003e\n\u003cp\u003eRowan. I worry about how he’s doing, alone in that house with only the rats to help him keep watch.\u003c/p\u003e\n\u003cp\u003eThe first generation attendants buff and wax me to a shine, and then Deirdre goes to work on my makeup while Adair winds my hair around a curling iron. It’s always curls. “They open up your eyes,” Adair says dreamily. Deirdre coats my lips with red and tells me to blot.\u003c/p\u003e\n\u003cp\u003eCecily comes in for a while and sits on the divan to watch. Vaughn has taken Bowen off somewhere to draw his blood or analyze his DNA, or whatever it is he’s doing to that poor child in the name of an antidote, and Cecily seems lost without the baby to care for. Over the course of several months I watched her go from a giggling teenage bride to a swollen stomach, and I could have never imagined that she’d be any kind of mother.\u003c/p\u003e\n\u003cp\u003eAnd now, suddenly, it seems she doesn’t know how to be anything else.\u003c/p\u003e\n\u003cp\u003e“Do her makeup,” I tell Adair, who is busying himself by inspecting my dress, which is already perfect. “Don’t you think she would look nice in purples?” I have no idea what I’m talking about, I just can’t stand to see Cecily looking so sad.\u003c/p\u003e\n\u003cp\u003e“Earth tones,” Deirdre cries, while she pins fake baby’s breath to my hair clip. “With that hair and those eyes?\u003c/p\u003e\n\u003cp\u003eYou need browns and greens for sure.” She winks at me in the mirror.\u003c/p\u003e\n\u003cp\u003eI make room for Cecily on the ottoman, and we sit back-to-back while the domestics make us sparkle. Cecily threatens to hurt Adair if he stabs her in the eye with the mascara wand, but she relaxes a little when she realizes he knows what he’s doing. And then it’s kind of nice.\u003c/p\u003e\n\u003cp\u003eLike we’re really sisters, and like there isn’t the promise of an early death hanging over us.\u003c/p\u003e\n\u003cp\u003e“What do you think the party will be like?” Cecily asks me, blotting her lipstick into a tissue Adair holds out for her.\u003c/p\u003e\n\u003cp\u003e“Nothing fancy,” I say, still not wanting to entice her with something she won’t get to see. Maybe once I’m gone, Linden will take her out. She would love the chocolate fountains, and something tells me she would like the attention of the House Governors and architects kissing her hand and telling her how pretty she looks. “It’s just a bunch of rich drunks all dressed up, talking business.”\u003c/p\u003e\n\u003cp\u003e“Will you bring me some éclairs?” she asks.\u003c/p\u003e\n\u003cp\u003e“If they have them, sure.”\u003c/p\u003e\n\u003cp\u003eShe takes my hand, and it’s small and warm. A child’s hand. She was so eager to abandon her youth, in this world that has stolen the luxury of time, and I wonder who she would have been if only she could have had more years to live. When I’m gone, will she assume first wife? Will she embrace womanhood entirely? I feel like I’ve failed her somehow. It was hard enough to watch Jenna slip away, and here I am planning to leave the sister wife I have left. I worry about how she’ll handle losing me. \u003c/p\u003e","sourceLink":"https://allnovel.net/wither-the-chemical-garden-1/page-39.html","bookId":1761,"creation":"Oct 5, 2019 10:23:41 AM","modification":"Oct 5, 2019 10:23:41 AM"}
