{"id":72302,"no":45,"title":"Page 45","content":"\u003cp\u003e“Come on,” I say, and pull him along the sidewalk. Fat grains of salt crinkle under our shoes. At least a dozen people pass us, one or two nodding hello, most ignoring us completely. We are just two people in wool coats, on our way home.\u003c/p\u003e\n\u003cp\u003eWe make it to the harbor, and it is different up close from how it looked in the limo. It’s more vibrant. We can really smell the salt, hear the tide turning, the gentle knocking of boats against the dock. I’m eager to get going, to find a boat worth stealing before we’re discovered, but I see the awe on Gabriel’s face and I allow him this moment. This bewildered joy.\u003c/p\u003e\n\u003cp\u003e“Is it anything like you remember?” I say.\u003c/p\u003e\n\u003cp\u003e“I—” His voice catches. “I thought I remembered the ocean, but I didn’t remember it at all.”\u003c/p\u003e\n\u003cp\u003eI sidle up against him, and he puts his arm around me and gives an excited squeeze.\u003c/p\u003e\n\u003cp\u003e“Think you can steer us out of this place on one of those boats?” I say.\u003c/p\u003e\n\u003cp\u003e“Oh, absolutely.”\u003c/p\u003e\n\u003cp\u003e“You sure?” I say.\u003c/p\u003e\n\u003cp\u003e“Well, if I’m wrong, I guess we die.”\u003c/p\u003e\n\u003cp\u003eI laugh a little. “Fine by me,” I say.\u003c/p\u003e\n\u003cp\u003eThere isn’t much time to be particular. I let Gabriel choose the boat because he’s the expert. He’s only ever seen pictures, and most of these models are much newer than the ones you can read about in Linden’s library, but his expertise is still greater than mine. We settle on a small fishing boat with an indoor steering panel—I’m not sure of the technical name, and Gabriel has no time to explain—but it will protect us from the cold winds.\u003c/p\u003e\n\u003cp\u003eIt’s surprisingly easy to untie the rope, to cast ourselves off. And even if Gabriel isn’t familiar with these newer models, he’s impressively deft. I try to help, but I only make it worse, and eventually he tells me to just be the lookout. That much I can do.\u003c/p\u003e\n\u003cp\u003eAnd then we’re moving.\u003c/p\u003e\n\u003cp\u003eGabriel works the steering unit, looking so serious and important, such a contrast to the uncertain little attendant pushing lunch carts around on the wives’ floor. He watches the horizon, and his eyes are blue like the water, and I know he’s right where he’s meant to be. Maybe his parents were sailors. Or maybe a hundred years ago, when people were natural and free, his ances-tors looked just this way.\u003c/p\u003e\n\u003cp\u003eWe’re finally free, and I have so much to tell him.\u003c/p\u003e\n\u003cp\u003eJenna. Cecily. And I know he must have things he wants to tell me, too. But for now those things can wait. I stand at a distance, admiring, letting him have his moment. I let his capable hands steer us into the forever, over sunken continents, until Florida disappears. Just disappears, as though swallowed.\u003c/p\u003e\n\u003cp\u003eMaybe, I think, we’ll end up on the beach Deirdre’s father painted. Maybe we’ll touch real starfish that we can hold in our hands, that don’t fall right through our grasp. Either way we’ll have to find a shore somewhere.\u003c/p\u003e\n\u003cp\u003eWe’ll have to stop and ask for directions to Manhattan; only, when we stop, it will be in a place where nobody knows us, where I’m not Linden Ashby’s bride and he’s not an attendant, and nobody has ever heard of Vaughn Ashby or his sprawling mansion. We’re traveling up the coastline, and the wind has picked up.\u003c/p\u003e\n\u003cp\u003eGabriel puts his arm around me, and I rest my hand on his, feeling the sturdy resistance of the steering wheel.\u003c/p\u003e\n\u003cp\u003e“Look,” he says in my ear.\u003c/p\u003e\n\u003cp\u003eIn the distance I see a lighthouse. The light washes over us and continues on its rotation. This time, I don’t know where the light will guide us. \u003c/p\u003e","sourceLink":"https://allnovel.net/wither-the-chemical-garden-1/page-45.html","bookId":1761,"creation":"Oct 5, 2019 10:23:41 AM","modification":"Oct 5, 2019 10:23:41 AM"}
