{"id":40893,"no":2,"title":"CHAPTER II THE FACE IN THE LIGHT","content":"\u0026nbsp;After a while I turned in my walk. It was time to get back to the ball-room if I would not appear to slight the honour shown me in the invitation. I had rather lost my bearings in the wooded walk, and in returning had the choice of three paths without knowing which one to take. I chose that which seemed to lead directly towards the distant music, and walked on quickly. It soon appeared that it was not the path I had come by. It led me much deeper into the wood than I had been before; still, the music seemed to grow nearer, and I flattered myself it might be a short cut. Hurrying on, I suddenly came upon a clearing in the wood. In the middle of this stood a small building—Duke Johann’s chapel, of which my companions had spoken. A quaint little edifice built, so far as the fitful light showed me, in a highly ornate style of Moorish architecture. \n\u003cdiv\u003e\n It was still lighted up dimly; a ray fell across the path at some little distance in front of me, evidently from one of the side windows. Neither the place, although it was romantic enough, nor the light particularly interested me. But as I went round towards the opposite side of the clearing, I was arrested by a curious sight.\n\u003c/div\u003e \n\u003cdiv\u003e\n The stream of light which I have spoken of became suddenly interrupted, then diffused and broken up, then it swept from side to side. I stopped and watched [Pg 12]it for a few seconds, then my eye followed the movement to its cause.\n\u003c/div\u003e \n\u003cdiv\u003e\n Just outside the window, half blocking the light and dispersing it, was a man’s head. The body I could not see, as it was naturally in the deep shadow. But the face! It was peering into the chapel eagerly, its expression, illuminated into strong relief by the light which streamed upon it from the little window, was one I can hardly describe, but shall never forget. Perhaps I can best give an idea of it by likening it to the look of hungry ferocious expectation in the eyes of a tiger which has got to within striking distance of its quarry. The sight was so extraordinary that I must have stood for several seconds hardly drawing my breath, and looking at it half fascinated. Then something told me it would be better to walk on, taking no further notice. After all, I had a perfect right as a guest to be in the wood, and——. In the dark shadow of a buttress near the window there was a quick movement, but quite independent of the peering man. Next instant a form crossed the band of light; another man had come out of the darkness and accosted me.\n\u003c/div\u003e \n\u003cdiv\u003e\n His first words were rough and brusque. “What are you doing here?” Then, noticing his mistake, and concluding probably by my appearance that I was a gentleman, and one of the royal guests, he abruptly changed his tone and manner.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pardon! You are waiting here for some one, mein Herr, or wish to return to the palace?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was taking the liberty of smoking a cigar,” I answered, as politely as I felt inclined.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here? In the wood?” The question was put sharply, with a certain stern incredulity and insistence strangely at variance with the man’s look. I scarcely knew whether to resent or laugh at it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not till this minute,” I replied, deeming it easiest [Pg 13]to be straightforward in that land of ceremonies and red tape. “I have been smoking outside the wood, and took this path back to the palace. Why? Is it forbidden?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The man gave a shrug, but never relaxed his fixed gaze on my face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Under certain circumstances. You have not been to this spot till this moment, you say?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You were not here just now; three, four minutes ago?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am not used to have my word doubted, sir,” I returned, getting a little out of patience.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pardon.” He changed his tone again, reverting to its first bluffness. “You are English. I may ask your name?”\n\u003c/div\u003e \n\u003cdiv\u003e\n I told him, adding, “I presume you have a right to ask it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pardon,” he said again, but his manner was still offensive. “You have been here alone?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. I have been smoking with three friends who hold official positions here. They have gone in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pardon, sir,”—he spoke in English now—“we are obliged to be circumspect here; you in England may not comprehend our necessity. Excuse me if I ask a few questions, in no spirit of idle curiosity, I assure you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n I nodded and waited.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Those gentlemen, your friends they left you here in the wood?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “On the path outside it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have not been in this wood before now to-night?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have seen your friends since you parted from them down there?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n [Pg 14]\n\u003c/div\u003e \n\u003cdiv\u003e\n “No? Why did you walk this way?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Really, sir,” I answered, getting somewhat exasperated, “I don’t know why I should submit to this cross-examination.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He laughed, showing a set of cruel teeth. “Because you are an Englishman it is incomprehensible. May one inquire without offence your object in walking this way when the path to the palace is outside the wood?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If you must know, I took this path by mistake. I trust I have not transgressed any rule of your Court etiquette——”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, no, no, no,” he broke in. “You say you did not speak with your friends again?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No. Is there any offence in that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n I put the question in a bantering tone, and was rather surprised that he took it seriously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That I cannot tell. All depends on the subject of conversation. Let me see, Herren Szalay, Von Lindheim, and D’Urban; not so?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes. Is there anything more you wish to know?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “At present, nothing. I thank you. Let me offer you my apologies and a piece of advice.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Be careful of your words. You are not in England here. Our master, the Herr Chancellor, has no—patience with chatterers. Good-night. That is your way.”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/duanpian/2943/80861.html","bookId":1076,"creation":"Aug 11, 2019 4:49:52 AM","modification":"Aug 11, 2019 4:49:52 AM"}
