{"id":18913,"no":10,"title":"CHAPTER X. THE FATE OF A BULLY.","content":"\u0026nbsp;The next day, Herbert Ross reappeared at school. As we know, it had been his intention not to go back unless Dr. Euclid would dismiss Andy from the post of janitor. \n\u003cdiv\u003e\n Now, however, he and his father saw a way of getting even with our hero, by the help of Mr. Starr, and the note which he had placed in the lawyer’s hands for collection.\n\u003c/div\u003e \n\u003cdiv\u003e\n The prospect of distressing the family of his poor schoolmate was exceedingly pleasant to Herbert, who from time to time cast glances of triumph at Andy, which the latter well understood. But, with the means at hand to foil his ungenerous foe, Andy, too, could afford to be in good spirits, and his face showed that he was so.\n\u003c/div\u003e \n\u003cdiv\u003e\n This puzzled Herbert not a little. He had expected that Andy would be cast down, and was annoyed because he seemed so far from despondent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course they can’t pay the note,” thought{60} Herbert, with momentary apprehension. “But of course they can’t! I don’t suppose they have got ten dollars in the house. I mean to go round when the sheriff seizes the furniture. Andy won’t look quite so happy then, I am thinking!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert recited his Latin lesson as poorly as usual—perhaps even more so, for his mind had been occupied with other things—and Dr. Euclid, who never flattered or condoned the shortcomings of a pupil on account of his social position, sharply reprimanded him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Herbert Ross,” he said, “how do you expect to get into college if you recite so disgracefully?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The lesson was hard,” said Herbert, coolly, shrugging his shoulders.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hard, was it?” retorted the doctor. “There are some of your classmates who succeeded in learning it. Andrew Gordon, did you find the lesson very hard?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” answered Andy, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert looked at his successful classmate with a sneer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can’t expect to compete with a janitor!” he said, slowly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then,” said the doctor, provoked, “the sooner you obtain the position of a janitor the better, if that is going to improve the character of your recitations!”{61}\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wouldn’t accept such a position!” said Herbert, coloring with anger.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are not likely to have one offered you,” said the doctor. “A boy who neglects his lessons is not likely to discharge well the duties of any position.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert bit his lips in annoyance, but he did not dare to say anything more, for he saw, by the ominous flashing of Dr. Euclid’s eyes, that he was in no mood to suffer impertinence.\n\u003c/div\u003e \n\u003cdiv\u003e\n He began to regret that he had been induced to return to school. He felt that it was very reprehensible in Dr. Euclid to treat the son of his most important patron with so little deference, or, indeed, respect.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But never mind!” thought Herbert. “I will soon have my revenge. Father has given Mrs. Gordon a week’s grace, and then she will have to pay the note or lose her furniture.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Two days later an incident occurred which incensed Herbert still more against Andy, and, as usual, the fault was Herbert’s.\n\u003c/div\u003e \n\u003cdiv\u003e\n The young aristocrat was a natural bully. Like most bullies he was deficient in courage, and preferred to cope with a boy smaller than himself. For this reason he was both hated and feared by the young boys of the village, as he seldom lost an opportunity to annoy and tease them.{62}\n\u003c/div\u003e \n\u003cdiv\u003e\n On Saturday there was no session of the Hamilton Academy. Teacher and scholars enjoyed a season of rest which was welcome to both.\n\u003c/div\u003e \n\u003cdiv\u003e\n After getting through a late breakfast, Herbert Ross took his hat, and sauntered through the village in search of something to amuse him or while away his time. Though he was glad to stay at home from school, he found Saturday rather a dull day.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a young clerk with whom he used sometimes to play billiards in the evening, but during the day it was difficult to find anyone who was not employed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish father would move to New York or Philadelphia,” thought Herbert, yawning. “Hamilton is a dull hole, and there’s absolutely nothing to do. If we lived in a city, there wouldn’t be any difficulty in finding company and enjoying myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n There was a vacant field, unfenced, near the engine house, which was used as a sort of common by the village boys, and in the course of his walk Herbert Ross came to it.\n\u003c/div\u003e \n\u003cdiv\u003e\n Two boys of ten were playing marbles in one corner of the field. Their names were Harry Parker and John Grant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll have some fun with them,” thought Herbert.{63}\n\u003c/div\u003e \n\u003cdiv\u003e\n He stood watching the boys for a minute or two, then, stooping suddenly, seized the marbles with which they were playing.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Give me those marbles, Herbert Ross,” cried Johnny Grant.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What’ll you give to get them back?” asked Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s mean to break up our game,” said Harry.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here, then, come and get them,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry approached, and extended his hand to receive the marbles, but Herbert, with a taunting laugh, drew back his own hands, and put them into his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n Johnny had a spirit of his own, though he was a small boy, and he doubled up his small fists, and said, angrily:\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have no business to keep our marbles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you going to do about it?” demanded Herbert, provokingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know what I’d do if I was as big as you,” said Johnny, hotly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, what would you do, you little bantam?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’d give you a licking and make you cry.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hear the small boy talk!” said Herbert, bursting into a laugh.{64}\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s because we are small boys that you interfere with us,” said Harry. “You don’t dare to take one of your size.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look here, you little rascal, you are getting impudent,” said Herbert, who was sensitive to an imputation that he knew to be well founded. “If you ain’t careful, I’ll do something worse than take your marbles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What will you do?” asked Johnny, spiritedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What will I do? Come here and I’ll show you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Johnny, in no way frightened, approached, and Herbert, seizing him by the collar, tripped him up, depositing him upon the ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s the way I punish impudence,” said Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n There had been a witness to his cowardly act.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you doing there, Herbert Ross?” demanded Andy, who had just come up.\n\u003c/div\u003e \n\u003cdiv\u003e\n “None of your business!” retorted Herbert; but he looked disturbed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Harry, what has he been doing to you?” asked Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n Harry and Johnny both told their story.\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy turned to Herbert, with eyes full of contempt.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ought to be ashamed of yourself, Herbert{65} Ross, to tease little boys. Give them back their marbles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will give them back when I get ready,” said Herbert, doggedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Give them up now, or you will be sorry for it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mind your business!” retorted Herbert, and turned to walk away.\n\u003c/div\u003e \n\u003cdiv\u003e\n Before he well knew what was going to happen, the young bully found himself lying on his back, in the very spot where he had deposited Johnny a minute before, with Andy bending over him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let me up, you brute!” he screamed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I will, when you have given up the marbles.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert struggled, but in the end was obliged to surrender the marbles.\n\u003c/div\u003e \n\u003cdiv\u003e\n As he rose from the ground he shook his fist at Andy, and shouted, with passion:\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ll repent this, Andrew Gordon! You’ll be a beggar inside of a week, and in State’s prison before the year’s out!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you for your good wishes!” said Andy, coolly. “I’ll take the risk of both.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As Herbert slunk home discomfited, he felt that he hated Andy Gordon more than any one in the world, and vowed to be revenged.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2952/81154.html","bookId":462,"creation":"Aug 2, 2019 10:35:44 AM","modification":"Aug 2, 2019 10:35:44 AM"}
