{"id":18914,"no":11,"title":"CHAPTER XI. ANDY IS ENGAGED FOR POLICE DUTY.","content":"\u0026nbsp;“I wonder how it is,” said Andy to himself, as he walked home, “that I am always getting into a quarrel with Herbert Ross? I don’t think it’s my fault. I couldn’t stand by and see those two little boys imposed upon without interfering. I suppose Herbert is angrier with me than ever, and that he will report this to his father, and get him to proceed against us at once. No matter; we shall be prepared to see him.” \n\u003cdiv\u003e\n Andy was more than ever thankful that the all-important receipt was in his mother’s possession. Whatever the lawyer might say, he believed that he was intending to punish them in the interest of his son.\n\u003c/div\u003e \n\u003cdiv\u003e\n In one respect, however, Andy made a mistake. Herbert did not report this last difficulty at home.\n\u003c/div\u003e \n\u003cdiv\u003e\n He was aware that he had not figured to advantage in his treatment of the two little boys, and any investigation of the matter would reveal this fact.\n\u003c/div\u003e \n\u003cdiv\u003e\n It would not be long now before he would have the satisfaction of seeing Andy and his mother in serious trouble, and, though impatient,{67} he decided to wait for that. Then the triumph would be his.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Andy reached home, he found that his mother had callers.\n\u003c/div\u003e \n\u003cdiv\u003e\n In a lonely situation, about a quarter of a mile beyond the farmhouse of Mr. Joshua Starr, lived two maiden ladies—Susan and Sally Peabody—both over fifty years of age.\n\u003c/div\u003e \n\u003cdiv\u003e\n Their father had died thirty years before, leaving them a cottage, with an acre of land, and some twelve thousand dollars in stocks and bonds.\n\u003c/div\u003e \n\u003cdiv\u003e\n Living economically, this sum had materially increased, and they were considered in the village rich ladies, as, indeed, they were, since their income amounted to more than twice their expenditures, and they were laying up probably five hundred dollars annually.\n\u003c/div\u003e \n\u003cdiv\u003e\n They were very good and kind, simple-hearted old ladies, and very much respected in the village.\n\u003c/div\u003e \n\u003cdiv\u003e\n The elder of these ladies, Miss Sally Peabody, Andy found in his mother’s plain sitting-room.\n\u003c/div\u003e \n\u003cdiv\u003e\n As he entered, he heard Miss Peabody say:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to borrow your Andy to-night, Mrs. Gordon, if you have no objection.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Gordon supposed that her visitor had{68} some work which she wished Andy to do, and as the latter was always glad of a job, she answered:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am sure, Miss Sally, that Andy will be glad to do anything that you require.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t want him to do anything,” answered Miss Peabody. “I want him to sleep at our house to-night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Gordon looked a little puzzled, but Miss Sally went on to explain.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You see, Mrs. Gordon, we had a sum of five hundred dollars paid in unexpectedly this morning, and we can’t get it to the bank till Monday. Now, it makes my sister nervous to think of having such a sum of money in the house. I was reading in the papers of a burglar entering a house at night in Thebes—the next village—and it might happen to us. I don’t know what we should do, as we have no man in the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Andy isn’t a man,” said Mrs. Gordon, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, he isn’t a man, but he is a good stout boy, and we should feel safer if he were in the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What an uncommonly sensible old lady Miss Peabody is!” thought Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n He felt proud of his presence being supposed to be a safeguard against housebreakers.{69}\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll go, Miss Peabody,” he said, promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “But, Andy,” said his mother, “you could do no good.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know about that, mother,” said Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You would be no match for a bold, bad man, and I don’t like to think of your being in danger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, you’re a woman, mother, and don’t understand!” answered Andy, good-humoredly. “I can scare a burglar away if he tries to get in.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t suppose, really, that there is any danger of the house being entered,” said Miss Peabody; “but still we shall feel safer with Andy in the house.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why don’t you engage a man, Miss Sally?” asked the widow.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The very man we engaged might rob us of the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But you might engage some one whom you knew.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five hundred dollars would be a great temptation to one who was generally honest. No, Mrs. Gordon, I would much rather have Andy. If you will let him stay at our house to-night and to-morrow night, I will pay him for his trouble.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I wouldn’t ask anything for it, Miss Peabody!” said Andy.{70}\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I should insist on paying you all the same, Andy. My sister and I make it a rule never to ask a service of any one without paying for it. With our income as large as it is, we should think ourselves mean if we acted otherwise.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are very different from your neighbor, Mr. Starr,” said Mrs. Gordon.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am really afraid that Mr. Starr is too fond of money,” said Miss Sally, mildly. “I don’t want to be too severe upon him, but I am afraid he is a little too close.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “A little too close!” replied Andy. “He is the meanest man I ever met.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you not a little too severe, Andy?” asked the spinster.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not a bit. He is trying to make mother pay a note over twice.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I can hardly believe such a thing.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I will tell you all about it,” said Andy, and he gave an account of the matter.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And do you think you will have to pay it?” asked Miss Peabody, in a tone of sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Gordon was about to explain why they would be spared the necessity, but a warning look from Andy prevented her.\n\u003c/div\u003e \n\u003cdiv\u003e\n Miss Peabody, with all her virtues, was fond{71} of talking, and Andy’s plan of confounding his adversary would be spoiled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t think we shall have to pay it,” Andy hastened to say. “We have a plan, but we don’t like to speak of it just yet, for fear Mr. Starr will hear of it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “If he really insists on his demand,” said Miss Sally, “perhaps sister Susan and I can help you. How large is the note?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “With interest it would amount to over a hundred dollars—perhaps thirty dollars more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We might advance the money, and you could give us a note.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are very kind, Miss Sally,” said Mrs. Gordon, gratefully; and she paused and looked at Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We shall not pay it at all if we can help it, Miss Peabody,” said Andy, “for we don’t believe in rewarding Mr. Starr’s dishonesty; but, if we find ourselves obliged to do so, we shall remember your kind offer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are a true friend, Miss Sally,” said the widow. “We could give no security, except our furniture. We might give you a bill of sale of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “As if I would take it, Mrs. Gordon! No, we have every confidence in your honesty, and even if you could not repay it, Andy would some day be able to.”{72}\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I would do it, too, Miss Peabody,” said Andy, stoutly. “But I don’t believe we shall need to ask you for the money.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It would be a pity to have to pay the note over again. I am really surprised at Mr. Starr,” said Miss Sally, who never used strong language in commenting upon the moral delinquencies of her neighbors.\n\u003c/div\u003e \n\u003cdiv\u003e\n “When do you want Andy to come over?” asked Mrs. Gordon.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We should be glad to have him come to supper. It will seem pleasant to us to have company. Susan and I get tired sometimes of only seeing one another’s faces.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Very well, Miss Peabody, I will be on hand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose there is no fear of your having to fight burglars,” said Mrs. Gordon. “No burglary has been known here for years.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I suppose not,” answered Andy. “I shan’t have any chance to show off my bravery.”\n\u003c/div\u003e \n\u003cdiv\u003e\n He might have come to a different opinion if he had seen the villainous-looking tramp, who, skulking near the house, had heard, through the open window, the first and most important part of the conversation.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2952/81155.html","bookId":462,"creation":"Aug 2, 2019 10:35:44 AM","modification":"Aug 2, 2019 10:35:44 AM"}
