{"id":18920,"no":17,"title":"CHAPTER XVII. PREPARING FOR A JOURNEY.","content":"\u0026nbsp;Cranston was six miles away—too far to walk. The Misses Peabody did not keep a horse. Indeed, one would have been of very little use to them, for both were timid, and neither would have been willing to drive. \n\u003cdiv\u003e\n “You are not afraid to drive to Cranston, Andy?” said Miss Sally.{108}\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; what should I be afraid of?” asked our hero.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are not timid about horses, then?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy laughed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should think not,” he replied. “I only wish mother could afford to keep a horse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think they are terrible creatures. They are so strong, and sometimes they are so contrary,” said Miss Susan, with a shudder.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you should use the whip on them, Miss Susan.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wouldn’t dare to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, I’m not afraid. I only wish I were in Add Bean’s place. He is driving around every day with his father’s horse.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The boy referred to—Addison Bean, called Add, for short—was one of Andy’s schoolmates at the academy, and was quite as fond of driving as Andy himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder if we couldn’t engage Mr. Bean’s horse and carriage? Will you see?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; it is a good one, and I should like to drive it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy called at Mr. Bean’s and succeeded in his errand. The horse was to be ready for him at nine o’clock.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What are you going to Cranston for, Andy?” asked Mr. Bean.\n\u003c/div\u003e \n\u003cdiv\u003e\n “To the bank, for the Peabody girls.”{109}\n\u003c/div\u003e \n\u003cdiv\u003e\n That’s what all the villagers call them, in spite of their age.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then I suppose you will carry money with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Don’t let anybody know your errand, then.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think there is any danger?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is always danger when a man is supposed to be carrying money. A boy is still more in danger.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t tell anybody my errand.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You haven’t seen anything of that burglar you scalded the other night?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to have been near at the time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish you had,” said Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bean was a deputy sheriff, and a strong, powerful man, who had more than once been called upon to arrest noted criminals.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Bean gave Andy another suggestion, which proved of value to him. What it was, the reader will ascertain in due time.\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy got into the carriage—a buggy—and drove round to the house of the maiden ladies. He fastened the horse at the fence, and, opening the gate, went in.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you got the money ready, Miss Peabody?” he asked, addressing Miss Susan.{110}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Here it is, Andy—four hundred and fifty dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But I thought,” said Andy, in surprise, “that there were five hundred dollars?”\n\u003c/div\u003e \n\u003cdiv\u003e\n The two sisters looked at each other significantly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We have another use for fifty dollars,” said Miss Sally.\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right!” said Andy, who did not suppose that this was a matter with which he had anything to do.\n\u003c/div\u003e \n\u003cdiv\u003e\n “In fact,” she continued, “we are going to give it to you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Going to give me fifty dollars?” Andy exclaimed, in amazement.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n And here Miss Susan spoke.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We feel that it is due to you on account of the bravery you showed the other night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thank you very much!” said Andy, quite overwhelmed at this munificence; “but it is altogether too much for me to receive.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We are the judges of that. You can make good use of the money, or your mother can, and we shan’t miss it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy knew that both these statements were quite true, and he thankfully accepted the generous gift. It was arranged that he should call and get it on his return from the bank.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2952/81161.html","bookId":462,"creation":"Aug 2, 2019 10:35:44 AM","modification":"Aug 2, 2019 10:35:44 AM"}
