{"id":18921,"no":18,"title":"CHAPTER XVIII. THE RIDE TO CRANSTON.","content":"\u0026nbsp;Andy set out on his trip in high spirits. It was a fine morning. The air was pleasant and bracing, and the sun shed a flood of glory over the landscape. \n\u003cdiv\u003e\n Andy enjoyed school and school studies, but nevertheless it did seem to him that there was more pleasure in riding over the hills to Cranston than in poring over the pages of Virgil in Dr. Euclid’s classroom.\n\u003c/div\u003e \n\u003cdiv\u003e\n Then again, it was a rare pleasure for him to have the guidance of a horse. His mother had never been able to keep one, and though now and then he got a chance to ride with a neighbor, it occurred but seldom. Sometimes his friend and schoolmate, Add Bean, took him in, but was generally reluctant to yield the reins, being fond of driving himself.\n\u003c/div\u003e \n\u003cdiv\u003e\n There was another cause for his high spirits. The handsome present which he had just received he looked upon as a veritable windfall. Fifty dollars in his mother’s economical establishment would go a good way. It would enable them to buy some necessary articles which otherwise must be dispensed with. For instance, Andy himself needed a{112} new suit very much, but he had not troubled his mother with asking for one, because he didn’t know where the money was to come from to buy it.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the money contained in his father’s wallet arrived, he was somewhat encouraged, but now with this fresh supply there was no doubt that he would feel justified in spending a part for the needed suit.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder what has become of the burglar?” thought Andy, as he rode smoothly along the road. “Wouldn’t he like to know where I am going, and on what errand? He would find it easier to master me here than he did the other night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Scarcely had this thought passed through his mind when he was hailed by a stranger whom he had just passed on the road.\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a young man, slender and well dressed, with a ready smile and a set of dazzling white teeth. He would be considered good looking, but his face was not one to inspire confidence in a thoughtful observer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My young friend, are you going to Cranston?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes,” answered Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “So am I. Is it far?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “About five miles from here.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy had already gone a mile on his way.{113}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Five miles! Whew! that is a distance. I say, haven’t you got room for one more?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Ordinarily Andy would have been entirely willing to take in a passenger, being naturally sociable and obliging, but now he was made cautious by the nature of his errand and the knowledge of the large sum of money which he was carrying. He halted his horse and looked perplexed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come, be obliging,” said the stranger, with affected frankness.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You are a stranger,” said Andy, hesitatingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well, suppose I am. I haven’t got the smallpox or any other contagious disorder,” laughed the young man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wasn’t thinking of that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Come, you don’t mind making a little money. I’ll give you a dollar if you’ll give me a ride.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It isn’t worth a dollar,” said Andy, honestly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I don’t insist upon paying so much! If you’ll take me for fifty cents, all the better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I might as well,” thought Andy. “Of course, he can know nothing of my errand, and it’s an easy way to earn fifty cents. I don’t want to be too cowardly.” “Well,” he said, after a pause, “I’ll take you. Jump in!”{114}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Enough said,” returned the other.\n\u003c/div\u003e \n\u003cdiv\u003e\n And he lost no time in availing himself of the invitation.\n\u003c/div\u003e \n\u003cdiv\u003e\n They talked together on indifferent topics till Andy reached the lonely part of the road already referred to, when a sudden change came over his companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Now to business!” he said, in a quick, stern voice. “Give me that money you have in your pocket, and be quick about it!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Turning hastily, Andy confronted a pistol in the hands of his companion. It was held within six inches of his head, and might well have startled an older person than Andy.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2952/81162.html","bookId":462,"creation":"Aug 2, 2019 10:35:44 AM","modification":"Aug 2, 2019 10:35:44 AM"}
