{"id":18923,"no":20,"title":"CHAPTER XX. PERKINS, THE DETECTIVE.","content":"\u0026nbsp;After parting with his troublesome traveling companion, Andy lost no time in continuing on his way to the Cranston Bank, where he had the satisfaction of depositing the four hundred and fifty dollars which had been intrusted to him. \n\u003cdiv\u003e\n “I am glad to get rid of the money,” said Andy, breathing a deep sigh of relief as he received back the bank-book.\n\u003c/div\u003e \n\u003cdiv\u003e\n “People are not usually glad to get rid of money,” said the receiving teller.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is too much responsibility about it,” said Andy. “Twice I have had a narrow escape from robbery.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Were you the boy that proved more than a match for a burglar, Saturday night?” asked the teller, with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you heard of it, then?” asked Andy, in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes! Such news travels fast. We have every reason for informing ourselves of the movements of lawbreakers and burglars. You are a plucky boy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Thank you!” said Andy, modestly. “I don’t know about that.”{123}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not many boys would have stood a midnight siege as well as you did.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was in more danger this morning,” said Andy, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “How?” asked the teller and the other employees of the bank, who had heard Andy’s statement, and came up to hear what he had to say.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was stopped by a highwayman this morning, on my way from Hamilton.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t say so! Was it the same one?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; it was a younger man. I suppose you haven’t heard of that?” he added, smiling.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; we shall get our information from the chief actor in the adventure. How was it?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy told his story, and the narration increased the high opinion which the bank officials already had begun to entertain of his courage and shrewdness.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That was a capital idea—having a decoy wallet with you,” said Mr. Smith, the receiving teller.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It was not my idea, though,” said Andy, modestly. “It was Mr. Bean who recommended it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “The fellow must have been disappointed when he saw what he had captured,” suggested the paying teller.{124}\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose he was,” responded Andy, with a laugh, “but I didn’t wait to find out. I gave the horse the whip, and left the place as fast as he could carry me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you not afraid the man may lie in wait for you on your way home?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought of that, but I have left the money here. It wouldn’t do him any good to take the bank-book.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true, but he may wish to be revenged upon you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is so, but there is no help for it. There is no other road to take, and I must chance it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy took the matter lightly, but it occurred to the bank officials that he stood in danger of being seriously injured.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You ought not to go back alone,” said the paying teller.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where shall I find company.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Just then a man entered the bank, and presented a check.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The very man!” said the receiving teller. “He will go with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy looked at the newcomer, and was led to doubt whether such a man would be of much service to him. He was a short, slender man, of thirty-five, very quiet in his manner, with hair inclined to be red.{125}\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy knew many of the citizens of Cranston, but never remembered meeting with this man.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mr. Perkins,” said the paying teller, “you heard of the attempted burglary at Hamilton on Saturday night?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes; that is partly what I came to this neighborhood about,” answered Mr. Perkins, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You see that boy?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is the boy who defended the house and foiled the burglar.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Perkins dropped his air of quiet. His eyes and features betrayed a strong feeling of interest as he turned to Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My young friend,” he said, “you are the very person I most wished to see. Will you answer me a few questions?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir, with pleasure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What was the appearance of the man who attempted to enter the house where the money was kept?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy gave, as nearly as he could, a description of Hogan and his peculiarities.\n\u003c/div\u003e \n\u003cdiv\u003e\n Perkins listened attentively, nodding from time to time with a satisfied expression.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I know the man,” he said. “I didn’t think he was in this part of the country, but I{126} am glad to hear that he is so near. I think I can put a spoke in his wheel.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who is it?” asked the paying teller.\n\u003c/div\u003e \n\u003cdiv\u003e\n “A man with more than one name. He is best known as Mike Hogan, though I am not sure whether this is his real name or not.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wonder if the other man is one of his friends?” said Andy, musingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “The other man?” repeated Mr. Perkins, inquiringly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, the man that tried to rob me this morning.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “This is something new to me,” returned the detective. “Was an attempt made upon you this morning?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, sir.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Tell me about it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Of course, Andy gave for the second time an account of his morning’s adventure.\n\u003c/div\u003e \n\u003cdiv\u003e\n The detective listened with the closest attention.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Unquestionably the two men are in league together,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you any idea who the younger man is?” asked the teller.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; it may be any one of half a dozen. The description will fit quite a number of my acquaintances. My theory is that Hogan was near at hand when the attack was made, and{127} that he instigated it. I presume that it was from him that the younger man learned that you were likely to come this way with the money in your possession.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t think of that,” said Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course not. You know nothing of the ways of these gentry. The less you are compelled to know of them, the better for you. When are you going back?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am ready now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “We thought the boy might be stopped again,” said Mr. Smith.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It is altogether likely,” said Mr. Perkins, quietly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And we recommended him not to go alone, as of course he would be no match for a man.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He has proved himself a match in two instances,” said Perkins, with a glance of approval at our hero. “Still, he might not always be so lucky. However, he won’t be abliged to go back alone, as I will ask a seat in his carriage.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I shall be very glad to have you come, sir,” said Andy, politely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you wait fifteen minutes?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, yes, sir!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am staying at the hotel. I need to go there for a short time.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “All right, sir.”{128}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stay here, and I will join you very shortly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n The hotel was just across the street. Andy whiled away the time in the house, but he did not have to wait long.\n\u003c/div\u003e \n\u003cdiv\u003e\n A lady, neatly attired in an alpaca dress, entered from the street, and coming up to our hero, said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Are you ready?”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy stared at her in surprise.\n\u003c/div\u003e \n\u003cdiv\u003e\n She raised a green veil, and with some difficulty he recognized the features of Perkins, the detective.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They won’t be afraid of a woman,” said Perkins, with a meaning smile. “Come along!”\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2952/81164.html","bookId":462,"creation":"Aug 2, 2019 10:35:44 AM","modification":"Aug 2, 2019 10:35:44 AM"}
