{"id":18924,"no":21,"title":"CHAPTER XXI. MIKE HOGAN’S CAPTURE.","content":"\u0026nbsp;The sudden transformation of Perkins into a woman struck Andy with amazement. He knew nothing about detectives and their ways, and could not understand how the change had been effected so rapidly. Perkins enjoyed the boy’s astonishment. \n\u003cdiv\u003e\n “I see you are surprised at my appearance,” he remarked, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, ma’am—I mean, sir.”{129}\n\u003c/div\u003e \n\u003cdiv\u003e\n “I assure you that I am a man,” continued the detective, noticing his confusion.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I was wondering where you got a dress to fit you so well,” Andy ventured to say.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I brought it with me!” said Perkins, composedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you often dress up as a woman?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Not often; but sometimes, as in the present instance, it seems desirable. You see, our friends of the highway wouldn’t be very apt to show themselves, if they should see a man with you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know,” said Andy, doubtfully. “Both of them together would be more than a match for us.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You think so?” returned the detective. “I see you haven’t a very high opinion of my abilities or physical strength.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Hogan, as you call him, looks like a very strong man,” said Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “And I don’t, eh?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Well,” said Andy, not willing to give offense, “he is a good deal larger than you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That is true. But a man’s strength isn’t always in proportion to his size. Give me your hand, please.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy did so, though he did not quite understand the detective’s object in making the request.\n\u003c/div\u003e \n\u003cdiv\u003e\n Perkins’ hands were incased in tight-fitting{130} kid gloves, and were small for a man. What was Andy’s surprise, then, to find his fingers in an ironlike grip that positively pained him. Perkins smiled as he felt Andy wince under the pressure.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You’ve got the strongest hand of any lady I ever met,” said Andy, with a smile.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Suppose I get a grip on Mike Hogan?” suggested Perkins.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think he would find it hard to get away.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He is the man I want. The other is of little consequence, compared with Hogan. If I can take but one, I shall hold on to the older villain.”\n\u003c/div\u003e \n\u003cdiv\u003e\n As they traveled over the road, Perkins entertained his young companion with scraps of personal adventure, borrowed from his ten years’ experience as a detective. He closed by instructing Andy how to act if they should encounter the men whom they sought.\n\u003c/div\u003e \n\u003cdiv\u003e\n Meanwhile, Hogan and the young man he called Bill, had stationed themselves near the road, in the shelter of some underbrush. Of the two, Hogan was the more excited and eager. His companion, under the impression that there was no money to be got from Andy, did not feel much interested in the matter. True, Andy had played a trick upon him, but, although provoked, he rather applauded the boy’s smartness.\n\u003c/div\u003e \n\u003cdiv\u003e\n With Mike Hogan it was different. He had{131} suffered physical pain at Andy’s hands, besides losing, through his brave defense, the large sum which would otherwise unquestionably have fallen into his hands, and it was natural that he should thirst for revenge.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should like to wring the boy’s neck,” he muttered, as they lay together in concealment.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It might not be altogether safe to kill him,” suggested Bill, who shrank from murder, and feared that Hogan’s temper might involve them in serious trouble.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, I won’t kill him!” growled Hogan. “I wouldn’t mind doing it, but for the law; but I don’t want my neck stretched.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That wouldn’t pay, Hogan, as you say.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t kill him, but I’ll give him something to remember me by.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s all right; but don’t go too far.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t do any worse by him that he did by me, I tell you. Are you sure there is no other road, Bill, by which he can come back? I should feel like a fool if he went another way, while we were lying in wait for him.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No danger, Hogan. I found out about that before I started.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Presently their waiting was rewarded. The sound of carriage wheels was heard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Look out and see who it is, Bill,” said Hogan.\n\u003c/div\u003e \n\u003cdiv\u003e\n Bill peered through the leaves, looking cautiously up the road.{132}\n\u003c/div\u003e \n\u003cdiv\u003e\n “It’s the boy,” he reported to his chief; “but he is not alone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Confusion!” muttered Mike Hogan, disappointed. “Who is with him?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Only a woman.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why didn’t you say so before, you fool?” exclaimed Hogan, with an air of relief. “That won’t make any difference.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “She’ll scream!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Let her scream. No harm shall come to her. As for the boy, I’ll attend to his case.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you want me to do, Hogan?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Stop the horse, and I’ll attend to the passengers.”\n\u003c/div\u003e \n\u003cdiv\u003e\n By direction of Perkins, Andy drove a little slower when he came to the lonely part of the road.\n\u003c/div\u003e \n\u003cdiv\u003e\n “We’ll give the gentleman a chance to stop us, my boy,” said the detective.\n\u003c/div\u003e \n\u003cdiv\u003e\n The slow speed satisfied Hogan and his companion that Andy did not apprehend any attack, and that he would be all the more surprised and disconcerted when confronted by them.\n\u003c/div\u003e \n\u003cdiv\u003e\n According to the plan they had agreed upon, Bill jumped from the covert, and, dashing across the road, seized the horse by the head, while Mike Hogan, big and burly, with a menacing air, approached the wagon.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you know me, young bantam?” he demanded, grimly.{133}\n\u003c/div\u003e \n\u003cdiv\u003e\n “I think I’ve seen you before,” said Andy, not seeming so much frightened as the thief expected.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, curse you! and I’ve seen you. You played a scurvy trick upon me Saturday night.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I couldn’t help it,” said Andy. “I didn’t want to hurt you, but you drove me to it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So, so! Well, it was unlucky for you, for I’m going to take pay out of your hide.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What do you mean?” asked Andy, appearing disturbed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am going to give you the worst thrashing you ever received.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Pray don’t!” entreated Andy. “Don’t you see I have a lady here? Let me carry her home first.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you think I am a fool? Get down, I say!”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then help the lady down first. She won’t dare to stay in the carriage alone.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mike Hogan had taken very little notice of the lady. At this request, he turned to her.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Get down, ma’am, if you want to,” he said. “I’ve got a score to settle with this young whelp.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Perkins took his hand lightly, and leaped to the ground.\n\u003c/div\u003e \n\u003cdiv\u003e\n The next moment he felt an iron grip at his collar, while the supposed lady held a revolver to his head.{134}\n\u003c/div\u003e \n\u003cdiv\u003e\n “What does this mean?” he exclaimed, in utter amazement, recoiling from his fair companion.\n\u003c/div\u003e \n\u003cdiv\u003e\n With his unoccupied hand the detective threw back the veil which concealed his face.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Mike Hogan,” he said, “I’ve caught you at last.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who are you?” gasped the tramp and burglar.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am Perkins, the detective!”\n\u003c/div\u003e \n\u003cdiv\u003e\n It was a name that Mike Hogan knew well, though Andy had never heard of it. He started to tear himself away, but the iron grip was not disturbed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Surrender, or it will be all over with you,” exclaimed Perkins, sternly.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mike Hogan turned for help to his companion, but at the dreaded name Bill had escaped into the woods.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I surrender,” said the tramp, doggedly.\n\u003c/div\u003e \n\u003cdiv\u003e\n With Andy’s help, handcuffs were put on the captive, and he was hoisted into the back part of the buggy. The horse’s head was turned, and Andy drove back to Cranston, where there was a jail.\n\u003c/div\u003e \n\u003cdiv\u003e\n I may as well add here that Hogan was duly tried, and sentenced to a term of years in the State’s prison.\n\u003c/div\u003e \n\u003cdiv\u003e\n Thus it happened that Andy was considerably later than he anticipated when he reached Hamilton on his return. During his absence{135} his mother had received a letter which was of considerable importance.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2952/81165.html","bookId":462,"creation":"Aug 2, 2019 10:35:44 AM","modification":"Aug 2, 2019 10:35:44 AM"}
