{"id":18937,"no":34,"title":"CHAPTER XXXIV. WHAT MR. DODGE DID IN JEFFERSON.","content":"\u0026nbsp;Andy had no previous intimation that he would be called upon to drive Mr. Dodge over to Jefferson, but he was very glad to do so. \n\u003cdiv\u003e\n When they were fairly started, Mr. Dodge said:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Henry, probably Mr. and Mrs. Brackett will cross-examine you on our return, to learn where I went and what I did. They are very curious on that subject—so much so that Mr. Brackett offered to drive me over himself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I won’t tell them,” said Andy, very promptly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You might find it a little awkward to refuse,” said the old man, “and for this reason I will not tell you precisely.”{201}\n\u003c/div\u003e \n\u003cdiv\u003e\n “That will be the best way,” answered Andy, who was not troubled by idle curiosity.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I will only say that the business I have to do will help prepare the way for our departure.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am glad of that, sir, for I don’t much enjoy being in Mr. Brackett’s employment.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It will soon be over, Henry, and I will take care that you lose nothing by what you are doing in my behalf.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t want to be paid for that, Uncle Simon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you heard from your mother since you came here?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir; I have not dared to write, for fear the letter might be seen by Mr. Brackett or his wife.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You shall have an opportunity of writing from Jefferson. We will drive directly to the hotel and put up our team. You can write your letter in the hotel while I am out attending to my business.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy was very glad of this permission, for he knew that his mother would feel anxious till she had heard of his safe arrival.\n\u003c/div\u003e \n\u003cdiv\u003e\n When the team was disposed of, Andy entered the hotel office.\n\u003c/div\u003e \n\u003cdiv\u003e\n Jefferson was the shire town of the county, and was therefore at times the resort of a considerable number of visitors. For this reason it required and possessed a very commodious hotel.{202}\n\u003c/div\u003e \n\u003cdiv\u003e\n At the desk Andy saw a pleasant-looking boy of about his own age, whose name, as he afterward learned, was George Tierney. The boy looked social and friendly, and he addressed him.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can you let me have a sheet of paper and an envelope?” he asked.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Certainly,” said George, briskly. “Do you want to write a letter?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I should like to do so.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You will find a table and ink in there,” said George, pointing to a small room leading from the office. “Of course you will want a postage stamp.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, I would like one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n George produced one, and Andy paid for it. Then our hero, who had thought of a plan for carrying on a correspondence with his mother, asked:\n\u003c/div\u003e \n\u003cdiv\u003e\n “Would you be willing to do me a favor?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course I would,” said George, pleasantly—“that is, unless you want to borrow a thousand dollars,” he added, with a laugh. “I could not oblige you there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It isn’t anything of that kind. I want to know if I may have a letter directed to me in your care?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course; but why don’t you have it sent to where you live?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “There is an objection which I can’t mention just now.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where do you live?”{203}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Over at Cato. I am working for Mr. Brackett, a farmer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n George whistled.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I thought so when I saw you with Mr. Dodge,” he said. “I worked there once myself.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You did? How long did you stay?” inquired Andy, with interest.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I stood it a week,” laughed George, “and then left. I came here, where I have an excellent place. Mr. Jones, the landlord, treats me tiptop.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I should think you’d like it a good deal better.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Can’t you get a better place?” asked George, in a tone of sympathy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I am willing to stay for the present,” said Andy. “Mr. Dodge is kind to me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, he is a kind man. If Brackett had been as good, I would have stayed longer, though I only got fifty cents a week. Did you ever hear of such mean pay?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s what I get myself,” answered Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You won’t get rich on it very soon.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I don’t expect to.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy went into the adjoining room and wrote his letter. He had finished it, and given it to George Tierney to mail, when Mr. Dodge returned.\n\u003c/div\u003e \n\u003cdiv\u003e\n Though the old gentleman did not mention the nature of the business in which he had been{204} engaged, we may state that he had been to the office of the lawyer with whom he had for years been on friendly and confidential terms, and there executed a will, which gave his entire property, invested in stocks and bonds, to his niece, Mrs. Gordon, in trust for Andy, to become the property of our hero when he should have attained his majority. He named the lawyer as his executor.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There,” he said, when the document was duly signed and attested, “that takes a burden from my mind.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What would the Bracketts say if they knew what you have done this day?” said the lawyer, smiling; for between him and his client there were no secrets.\n\u003c/div\u003e \n\u003cdiv\u003e\n “They have no right to feel disappointed,” said the old man, “for I have acted very generously by them. I gave them half of all I had, and I didn’t wait till my death to do it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “You have dealt a good deal more generously by them than I would have done,” said the lawyer, emphatically.\n\u003c/div\u003e \n\u003cdiv\u003e\n “If it were to do over again, I would act differently; but what is done can’t be undone. Perhaps it is all for the best.”\n\u003c/div\u003e \n\u003cdiv\u003e\n On the way home Mr. Dodge seemed to be in unusually good spirits. As he had said to the lawyer, he felt that a burden had been lifted from his mind. He had made his will and provided that his property should go where he{205} wished it to go, and felt no further anxiety on that point.\n\u003c/div\u003e \n\u003cdiv\u003e\n But if he felt no anxiety, Mr. and Mrs. Brackett did.\n\u003c/div\u003e \n\u003cdiv\u003e\n They felt that something was in the wind. Mr. Dodge must have some object in going to Jefferson and refusing the company of his son-in-law, and even of dear Tommy.\n\u003c/div\u003e \n\u003cdiv\u003e\n They waited impatiently for the return of the team, and were on the alert when it drove into the yard.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you have a pleasant ride, father?” asked Brackett.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, Jeremiah, thank you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you attend to all your business, or will you want the horse another day?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t say I went on business,” said the old man, shrewdly. “I may want the horse another day. Here is your money, Jeremiah.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Brackett extended his hand with alacrity, and took the proffered two dollars and a half, which he put in his pocket.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You can have it any time, father,” he said. “I’m always ready to oblige you.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Dodge went into the house, leaving Andy in the hands of his son-in-law.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did father call round much over in Jefferson, Henry?” asked Mr. Brackett, with an assumption of careless indifference.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, sir,” answered Andy, demurely.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where did he go?” pursued Brackett, in{206} the same tone, but with an expression of restrained eagerness.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He drove right to the hotel,” answered Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but after that?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He put up the horse there, and left me there.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He did!” ejaculated Brackett, disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did he leave the hotel?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Yes, but he didn’t tell me where he went.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Brackett looked hard at Andy, to see if he were keeping anything back, but our hero’s manner was perfectly honest and sincere, and he was forced to conclude that the boy knew nothing more than himself of Mr. Dodge’s errand.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I didn’t think father was so sharp,” said Brackett to his wife. “He wouldn’t let the boy know where he went.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But Mr. Brackett had his curiosity satisfied, after all. One of his neighbors had been over to Jefferson the same afternoon, and reported to the farmer that he had seen Mr. Dodge coming out of the office of Mr. Brief, the lawyer.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What was he doing there?” thought Brackett, perplexed. “Did he make a will? That’s what I would like to know.”\n\u003c/div\u003e \n\u003cdiv\u003e\n But that was a question more easily asked than answered.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2952/81178.html","bookId":462,"creation":"Aug 2, 2019 10:35:44 AM","modification":"Aug 2, 2019 10:35:44 AM"}
