{"id":18944,"no":41,"title":"CHAPTER XLI. ANDY’S SECRET IS DISCOVERED.","content":"\u0026nbsp;Mr. Brackett stared at his brother-in-law in ludicrous dismay, while his wife fairly gasped for breath. \n\u003cdiv\u003e\n Here was a revelation, indeed. Their important{241} secret had been discovered, and neither knew what to say.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mrs. Brackett was the first to recover her wits.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who told you we had any money in the savings bank, George?” she demanded.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Nobody.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He only guessed it. He doesn’t know,” she thought. “I can deceive him yet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I wish we had money in the bank,” she said; “but farming is a poor business. It doesn’t pay, and all that Jeremiah and I have been able to do has been to make both ends meet.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Lucinda, I admire your ready invention—or, shall I say, your ready forgetfulness of facts?” said her brother, with a provoking smile; “but you ought not to try it on me. You must remember that I have been around the world a little; I have a slight knowledge of men, and women, too. You have five hundred dollars in the savings bank, and you know it; and, what’s more, I know it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Who told you?” demanded his sister, desperately.\n\u003c/div\u003e \n\u003cdiv\u003e\n A smile passed over her brother’s features, as he fixed his eyes on his sister’s agitated countenance, and answered, simply:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have seen the book.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Have you dared to go to my bureau drawer?” exclaimed Mrs. Brackett, angrily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “There it comes out!” said White, laughing. “No, I have not been to your bureau drawer.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then, how could you see my bank book?”{242}\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then it seems you have one, Lucinda. So I thought.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I have a small account in the bank, I admit,” said Mrs. Brackett. “But it’s only a few dollars.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Didn’t I tell you I had seen the book? Why do you try to deceive me?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then you have been to my bureau.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It isn’t in your bureau.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Then where is it? Have you got it with you?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No,” assured White, unblushingly. “But I know where it is.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Where is it?” asked his sister, nervously.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I must tell you the story, and then you will understand how I came to find out about your deposit. That boy of yours, Henry Miller, I distrusted as soon as I saw him. I couldn’t place him, but I was convinced I had seen him somewhere, and that his character was bad.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just what I always thought!” ejaculated Mrs. Brackett, profoundly gratified at hearing something to Andy’s discredit.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Your instinct was quite correct, my esteemed sister. Well, this afternoon, being left alone in the house, I thought I would search Henry’s room, being influenced chiefly by missing a small amount of money a day or two since.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Did you find it in the boy’s room?” asked Lucinda, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No; he was too shrewd to leave money around. The young rascal has a long head, and, I must admit, is unusually smart. I didn’t find any money, but on opening the{243} drawer of his dressing table, tucked away in a corner, I saw a savings-bank book. I thought it was his, but on examining it I discovered your name. Of course I opened it, and that is the way I found how much money you had.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “But what could the boy want with the book?” asked Brackett.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He intended to forge an order and draw some of the money as soon as he went to Jefferson.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “He was to go there to-morrow with father,” ejaculated Mrs. Brackett.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Just so! He’s in with the old man, and no wonder. Do you know who he is?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I don’t know anything beyond his name,” said Brackett.\n\u003c/div\u003e \n\u003cdiv\u003e\n “You don’t know that!” said White, triumphantly. “His name is not Henry Miller at all.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What is it, George?” asked Mrs. Brackett, eagerly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Prepare to be astonished. You have been harboring a traitor in your house. His name is Andy Gordon, and his mother is the niece of your father-in-law!”\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. and Mrs. Brackett stared at each other in consternation.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2952/81185.html","bookId":462,"creation":"Aug 2, 2019 10:35:44 AM","modification":"Aug 2, 2019 10:35:44 AM"}
