{"id":18908,"no":5,"title":"CHAPTER V. A MESSENGER OF BAD TIDINGS.","content":"\u0026nbsp;The next day was Friday—the last day of the school week. Andy went to school as usual, wondering how Herbert would treat him after their little difficulty of the day before; not that he cared particularly, but he felt some curiosity on the subject. \n\u003cdiv\u003e\n But Herbert was absent. We know that his father had agreed to take him away from school, but this was not suspected by Andy, nor, indeed, by Dr. Euclid, notwithstanding the threat of Mr. Ross.\n\u003c/div\u003e \n\u003cdiv\u003e\n The doctor could hardly believe the lawyer would be so foolish as to deprive his son of school privileges merely on account of a boyish difficulty with one of his fellow students.\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert was often absent for a single day.{31} Sometimes he had a convenient headache in the morning, when he felt indisposed to go, and neither his father nor mother interfered with him on such occasions.\n\u003c/div\u003e \n\u003cdiv\u003e\n Mr. Ross left his son quite independent, as long as Herbert did not contravene his own plans, and Mrs. Ross was foolishly indulgent.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I suppose Herbert is sulking at home,” thought Andy. “Well, he can do it, if he wants to. I shan’t allow him to interfere with my work, even if he is a rich man’s son and I am only a janitor.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy felt gratified at Dr. Euclid’s evident approval of his conduct. The principal was strict, but just, and thus gained the respect of all his students.\n\u003c/div\u003e \n\u003cdiv\u003e\n There is nothing boys more strongly resent than injustice and undeserved reproof, and no teacher who expects to retain his influence will permit himself to indulge in either.\n\u003c/div\u003e \n\u003cdiv\u003e\n It is hardly necessary to say that Squire Ross had communicated to Herbert the business which Mr. Starr had intrusted to him, and that Herbert was very much pleased to hear it.\n\u003c/div\u003e \n\u003cdiv\u003e\n “That’s good!” he said, emphatically. “Won’t you let me go with you when you call on the Gordons?”{32}\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, Herbert. I can’t do that.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “What harm will it do?” pleaded Herbert, disappointed.\n\u003c/div\u003e \n\u003cdiv\u003e\n “It wouldn’t look well, and the neighbors would be sure to criticise.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “It won’t make any difference if they do. You are a rich man, and can laugh at them.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Still, I don’t want to become unpopular. I think of running for office by and by. I stand a good chance of being nominated for State senator next fall, and it won’t do to give people a chance to talk against me.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why don’t you run for member of Congress, pa?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “So I may, in good time. The State senatorship would be a good stepping-stone to it.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “When are you going to call on Mrs. Gordon?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “To-night, probably.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I hope Andrew will be at home. It will make him feel blue.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert carefully abstained from calling our hero Andy, as everyone else did. He was afraid this familiarity would be interpreted into an admission of his social equality, and this he was far from being willing to concede.\n\u003c/div\u003e \n\u003cdiv\u003e\n When Herbert stayed home from school on{33} an ordinary week day, he found it rather hard to pass the time, having no companions to play with, and not being especially fond of reading.\n\u003c/div\u003e \n\u003cdiv\u003e\n It struck him that it might be a very good idea to be sauntering along the road between the academy and the Widow Gordon’s, and, intercepting Andy, give him a hint that something disagreeable awaited him.\n\u003c/div\u003e \n\u003cdiv\u003e\n He proceeded to carry this plan into effect, and so it happened that Andy encountered Herbert, as he supposed, by accident.\n\u003c/div\u003e \n\u003cdiv\u003e\n Now Andy was not a boy to bear malice, and he accordingly accosted Herbert in his usual pleasant tone.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why weren’t you at school to-day, Herbert?” he asked. “Were you sick?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I’m well enough,” answered the young aristocrat.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Got up late, I suppose?” said Andy.\n\u003c/div\u003e \n\u003cdiv\u003e\n “No, I didn’t. I don’t think I shall go to the academy any more.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Why not?” inquired Andy, considerably surprised.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dr. Euclid’s an old fogy.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Dr. Euclid is an excellent teacher,” said Andy, warmly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “He don’t know how to treat a gentleman,” said Herbert.{34}\n\u003c/div\u003e \n\u003cdiv\u003e\n “How do you make that out?”\n\u003c/div\u003e \n\u003cdiv\u003e\n “I’ll tell you. He ought to have given you a thrashing for insulting me,” said Herbert, darting a look of anger and hostility at his schoolfellow.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Oh, that’s what you mean!” said Andy, laughing. “I don’t think that would be treating a gentleman properly.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you mean yourself?” demanded Herbert.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Of course.”\n\u003c/div\u003e \n\u003cdiv\u003e\n “Do you call yourself a gentleman?”\n\u003c/div\u003e \n\u003cdiv\u003e\n This was asked with such insulting emphasis that Andy, good-natured as he was, flushed with indignation.\n\u003c/div\u003e \n\u003cdiv\u003e\n Still he answered, calmly:\n\u003c/div\u003e \n\u003cdiv\u003e\n “I mean to behave like a gentleman, and, as long as I do that, I call myself one.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Herbert laughed scornfully.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Perhaps when you are living in the poorhouse you will call yourself a gentleman,” he said.\n\u003c/div\u003e \n\u003cdiv\u003e\n “What have I got to do with the poorhouse?” Andy asked, looking Herbert steadily in the eye.\n\u003c/div\u003e \n\u003cdiv\u003e\n “I refer you to my father,” said Herbert, mockingly.\n\u003c/div\u003e \n\u003cdiv\u003e\n “Explain yourself, or perhaps I may not treat you like a gentleman,” said Andy, in a{35} tone which caused Herbert to draw back involuntarily.\n\u003c/div\u003e \n\u003cdiv\u003e\n “My father has gone to see your mother on business,” said Herbert. “If you care to know what sort of business, you had better go home and find out.”\n\u003c/div\u003e \n\u003cdiv\u003e\n Andy was taken by surprise. He could not conceive what business the lawyer could have with his mother, but he was oppressed by a presentiment of evil. He left Herbert and hurried home.\n\u003c/div\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/ertong/2952/81149.html","bookId":462,"creation":"Aug 2, 2019 10:35:44 AM","modification":"Aug 2, 2019 10:35:44 AM"}
