{"id":83711,"no":44,"title":"Page 44","content":"\u003cp\u003e“Aren’t you? How’s the bimbo your father married? You once loved her.”\u003c/p\u003e\n\u003cp\u003eI wasn’t her. I wasn’t my mother. I blinked and stared at Aires’ tombstone, half hoping he’d tell me she was wrong. What did this mean? What did this mean about me? And Ashley? And my father?\u003c/p\u003e\n\u003cp\u003e“Let’s not discuss bad things,” she said. “I’ve been on my medication for two years and I’m never coming off. Besides, I came here to catch up on the present, not rehash the past. I’ve got a fantastic job and a beautiful loft apartment. Echo? Echo, where are you going?”\u003c/p\u003e\n\u003cp\u003eFrom over my shoulder, I looked at the woman who gave birth to me. She’d never once said she was sorry. “I’m going home.”\u003c/p\u003e\n\u003cp\u003eNOAH\u003c/p\u003e\n\u003cp\u003eWater trickled from my parents’ fountain. Children laughed and yelled from the playground behind the neighborhood. Frank had told me to take the day off. I didn’t need a day off. I needed to work. I needed the money. I didn’t need so much damn time on my hands.\u003c/p\u003e\n\u003cp\u003eI brought Echo here once. Either to impress her or seduce her, or maybe I brought her here to prove to myself I was someone worth loving. Who the hell knew, for all the good it did.\u003c/p\u003e\n\u003cp\u003eMy mind had wrestled with the same question since Tuesday. How could I help her? I drew nothing but blanks. So much for those damn problem-solving skills Mrs. Collins said I was so good at.\u003c/p\u003e\n\u003cp\u003e“Noah!”\u003c/p\u003e\n\u003cp\u003eI whipped my head at the sound of Jacob’s voice and my heart squeezed in my chest. Wide-eyed, I stood just in time for the blond-haired midget to tackle me in a hug. “Noah! Noah! It’s you! It’s really you!”\u003c/p\u003e\n\u003cp\u003eWrapping my arms around him, I quickly scanned the area. Joe slowly walked across the street, his hands shoved in his pockets, shoulders slumped forward. Carrie held the hand of a struggling Tyler. He extended his other hand toward me.\u003c/p\u003e\n\u003cp\u003e“Noah,” said Joe.\u003c/p\u003e\n\u003cp\u003e“Joe.”\u003c/p\u003e\n\u003cp\u003eJacob faced Joe, but kept his arm around me. “You did this, didn’t you?” He glanced excitedly at me. “He does things like this all the time. He tells us that he’s taking us to the store and then does something great like get ice cream. Except this time he said we were going to the fountain and he gave us you.”\u003c/p\u003e\n\u003cp\u003eThe faith and love that radiated from Jacob tore at my heart.\u003c/p\u003e\n\u003cp\u003e“Didn’t you, Dad?”\u003c/p\u003e\n\u003cp\u003eMy muscles tensed and I held tighter to Jacob. Dad.\u003c/p\u003e\n\u003cp\u003eJoe’s eyebrows furrowed together. “Jacob, I had no idea …”\u003c/p\u003e\n\u003cp\u003e“That I’d be early,” I cut in. Joe eyed me warily, but didn’t contradict me. Maybe if I played nice, he’d let me see them for a few seconds. “But I don’t have much time, bro.”\u003c/p\u003e\n\u003cp\u003eJacob’s smile fell. “Did you know that our mom and dad built these houses?”\u003c/p\u003e\n\u003cp\u003eI blinked. Our mom and dad. “Yeah. I was about your age then. I helped Dad put up every single porch swing.”\u003c/p\u003e\n\u003cp\u003eMom’s smile returned on Jacob’s face. “That must have been cool.”\u003c/p\u003e\n\u003cp\u003e“Yeah, it was.”\u003c/p\u003e\n\u003cp\u003eJoe gestured for Carrie to join us. A flash of worry covered her face before she slowly walked over. Like a fish, Tyler slipped out of her grasp and ran headfirst into my leg.\u003c/p\u003e\n\u003cp\u003e“Hey, bro.”\u003c/p\u003e\n\u003cp\u003eTyler responded with a dazzling smile. No bruises. No staples. Just happiness. I mussed the hair on his head.\u003c/p\u003e\n\u003cp\u003e“Hey, Mom,” said Jacob, “did you know that Noah helped our mom and dad build these houses?”\u003c/p\u003e\n\u003cp\u003eThe smile on her face seemed forced. “Did he?”\u003c/p\u003e\n\u003cp\u003e“Yep, because Noah is awesome.”\u003c/p\u003e\n\u003cp\u003eHer lips turned down, but she shoved them back up.\u003c/p\u003e\n\u003cp\u003e“Wanna come play with us?” Jacob asked me.\u003c/p\u003e\n\u003cp\u003eTyler attached himself to my leg and propped both of his feet on top of mine. I cleared my throat. “I’ve got to get to work later and I need to eat before that.” Even though I didn’t work today and even if I did, I cooked food for a living.\u003c/p\u003e\n\u003cp\u003e“Eat wis us,” said Tyler.\u003c/p\u003e\n\u003cp\u003eHe spoke to me. My youngest brother uttered his first words to me since the day of my parents’ funeral. I stared helplessly at Carrie and Joe. I was trying to do the right thing here. The exact opposite of what I wanted and my brothers were tearing out my heart.\u003c/p\u003e\n\u003cp\u003e“Come home and have lunch with us,” blurted out Carrie.\u003c/p\u003e\n\u003cp\u003eJoe touched her arm and spoke soothingly. “Are you sure?”\u003c/p\u003e\n\u003cp\u003eCarrie turned to him. “You were right, Joe.”\u003c/p\u003e\n\u003cp\u003e“Noah, would you like to follow us home and have lunch with your brothers?” asked Joe.\u003c/p\u003e\n\u003cp\u003e“Yes!” Jacob pumped his fist. “Wait until you see my room and my bike.”\u003c/p\u003e\n\u003cp\u003eTyler still hung on my leg. “Yes, sir.”\u003c/p\u003e\n\u003cp\u003eI FORCED DOWN THE ham-and-cheese sandwich, chips and iced tea, even though sitting here on the back patio at Carrie and Joe’s made me nervous as hell. Part of me waited for the cops to show so Carrie could point at me and say I broke some sort of court order. To cover my ass, I called Mrs. Collins on the way here to tell her about lunch. She reminded me three times to watch my language.\u003c/p\u003e\n\u003cp\u003e“Come on, Noah, come see my room.” Jacob tugged on my hand and I glanced at Carrie and Joe for permission. Joe nodded.\u003c/p\u003e\n\u003cp\u003eThis was the grandest house I had ever seen. The house may have been Victorian-era style, but the entire inside rocked out in contemporary. Granite kitchen counters, stainless steel appliances, hardwood floors throughout the first floor and a foyer the size of Dale’s basement.\u003c/p\u003e\n\u003cp\u003eJacob rattled on about school and basketball while we walked up the massive staircase. “Tyler’s room is across from mine and Mom and Dad’s is right down the hall. We have two guest bedrooms. Two! Mom and Dad said that if I keep working with my counselor and go another month without nightmares then I can have friends over for a slumber party. I can’t wait….”\u003c/p\u003e\n\u003cp\u003eHe led me into a large room and I stopped in the doorway. It was like entering the grade-school version of Pimp My Room. A wooden bunk bed lined the wall. The bottom bunk was a full-size mattress and a slide attached to the top bunk. Jacob had his own television and toys. Toys were everywhere.\u003c/p\u003e\n\u003cp\u003eA picture frame on Jacob’s dresser caught my eye and made it impossible to breathe. Jacob continued to talk, but I tuned him out as I picked up the frame. I rushed out the words, unsure I could say them without my voice breaking. “Do you know who this is?”\u003c/p\u003e\n\u003cp\u003eJacob looked at the picture and then returned to the Bat Cave on the floor. “Yeah. That’s our mom and dad.” He said it so casually, like everyone had a picture of them.\u003c/p\u003e\n\u003cp\u003eI sat on the bed and ran a trembling hand over my face. My mom and dad. This was a fucking picture of my parents and they looked … happy. I sucked in a breath, but it sounded more like a sob.\u003c/p\u003e\n\u003cp\u003e“Jacob?” said Carrie. “Dessert is on the table.”\u003c/p\u003e\n\u003cp\u003eJacob jumped up and then hesitated. “You coming?”\u003c/p\u003e\n\u003cp\u003eI blinked rapidly. “Yeah, in a sec.” I kept my eyes locked on the picture.\u003c/p\u003e\n\u003cp\u003eMy brother hurried out the door and I tried hard to shove down the pressure building on my chest. Men don’t cry. My parents. Men don’t cry. Fuck. Men don’t cry. I wiped at my eyes. I missed my parents.\u003c/p\u003e\n\u003cp\u003e“Are you okay?”\u003c/p\u003e\n\u003cp\u003eMy head shot up; I’d been unaware that Carrie remained in the room. “Yeah. Sorry.” I motioned with the frame before putting it back on the dresser. “Where did you get this?”\u003c/p\u003e\n\u003cp\u003e“Joe contacted Habitat for Humanity and asked if they had pictures of your parents. We felt it was important to keep them a part of the boys’ lives.”\u003c/p\u003e\n\u003cp\u003eI took a deep, shaky breath and faced her. “But not me.”\u003c/p\u003e\n\u003cp\u003eCarrie immediately looked down. “Please don’t take my boys away from me. They’re my whole world and … and I can’t live without them.”\u003c/p\u003e\n\u003cp\u003eJoe walked into the room and placed his arm around her waist. “Carrie.”\u003c/p\u003e\n\u003cp\u003eShe shook like a damn leaf in a hurricane. “We’ll give them everything. Everything. Whatever they want. I swear to you, they’re happy here and I love them. I love them so much my heart hurts.”\u003c/p\u003e\n\u003cp\u003eI tried to reach for the anger that had propelled me forward over the past couple of months, but I only found confusion. “They’re my brothers and you’ve kept them from me. What did you expect me to do?”\u003c/p\u003e\n\u003cp\u003eCarrie began to sob. Joe pulled her into his chest and rubbed her back. “We were scared they’d choose you over us. That we’d lose them. Now, we stand to lose them regardless.”\u003c/p\u003e\n\u003cp\u003eJoe whispered something into Carrie’s ear. She nodded and left the room. He scratched the back of his head. “Thank you for what you did for Jacob. You transformed this entire family.”\u003c/p\u003e\n\u003cp\u003eFamily. Why didn’t he use razor blades and rip me open that way? “You have a nice way of showing your appreciation.”\u003c/p\u003e\n\u003cp\u003e“And we were wrong about that.” Joe knelt by some Legos on the floor and absently dropped them, one at a time, back into the container. “All Carrie ever wanted was children. We tried for years, but Carrie has a medical condition. She had surgery to try to correct it, but it created scar tissue.”\u003c/p\u003e\n\u003cp\u003eUnfortunately, I understood scar tissue.\u003c/p\u003e\n\u003cp\u003e“After she came to terms with the fact that we’d never hold our own natural-born child, we decided on adoption. We met Keesha through a friend and she convinced us to look into foster care. We attended classes, but never really planned on doing it until we met your brothers. Against everything we learned and were told, Carrie and I fell in love with them.”\u003c/p\u003e\n\u003cp\u003eHe continued to plunk one Lego piece on top of another. “After a few months, we decided to adopt. We had to prove to the court that no one else had claim to them, which we thought would be easy, but it turns out that your mother had living relatives.”\u003c/p\u003e\n\u003cp\u003eMy eyes narrowed. “Mom and Dad were only children. Mom’s parents died her first year of college. Grandma and Papa died six months apart from each other when I was ten.”\u003c/p\u003e\n\u003cp\u003e“Actually, your maternal grandmother is still alive, as well as your mother’s brothers and sisters. She ran away from home to go to college. According to our findings, your mother had a … less than tolerable upbringing.”\u003c/p\u003e\n\u003cp\u003eBesides to turn my world upside down and confuse me more … “Why are you telling me this?” And why hadn’t my mom told me herself?\u003c/p\u003e\n\u003cp\u003eJoe shrugged. “In case you want to know that you still have living blood relatives. And to make you understand that we spent two years negotiating and fighting to keep your brothers from a place your mom ran away from. We won, only to be faced with our greatest challenge … you.”\u003c/p\u003e\n\u003cp\u003eJust when I thought my life couldn’t be more fucked up, Joe found a way to do it. He stood and assessed me—the way Isaiah did when he decided whether or not he was going to take a swing. “We’ve been wrong in how we’ve handled you and your relationship with your brothers. In our defense, you had just hit your foster father when we first took on your brothers. The system labeled you emotionally unstable and we were concerned about your influence on the boys, especially when we saw you bouncing around to several different foster homes. At first, we kept the boys away from you in order to protect them.”\u003c/p\u003e\n\u003cp\u003e“And after the system began to figure out I wasn’t the problem?”\u003c/p\u003e\n\u003cp\u003e“Then you scared us.” He stared at me and after a second continued, “When you announced your plans to seek adoption, I had people dig deep to find information on you, to use against you in court.” \u003c/p\u003e","sourceLink":"https://allnovel.net/pushing-the-limits-pushing-the-limits-1/page-44.html","bookId":2752,"creation":"Oct 5, 2019 4:54:34 PM","modification":"Oct 5, 2019 4:54:34 PM"}
