{"id":107206,"no":2,"title":"Page 2","content":"\u003cp\u003eLouvre Museum, Paris 10:46 P. M.\u003c/p\u003e\n\u003cp\u003eRenowned curator Jacques Sauniere staggered through the vaulted archway of the museum\u0027s Grand Gallery. He lunged for the nearest painting he could see, a Caravaggio. Grabbing the gilded frame, the seventy-six-year-old man heaved the masterpiece toward himself until it tore from the wall and Sauniere collapsed backward in a heap beneath the canvas.\u003c/p\u003e\n\u003cp\u003eAs he had anticipated, a thundering iron gate fell nearby, barricading the entrance to the suite. The parquet floor shook. Far off, an alarm began to ring.\u003c/p\u003e\n\u003cp\u003eThe curator lay a moment, gasping for breath, taking stock. I am still alive.He crawled out from under the canvas and scanned the cavernous space for someplace to hide.\u003c/p\u003e\n\u003cp\u003eA voice spoke, chillingly close. \"Do not move.\"\u003c/p\u003e\n\u003cp\u003eOn his hands and knees, the curator froze, turning his head slowly.\u003c/p\u003e\n\u003cp\u003eOnly fifteen feet away, outside the sealed gate, the mountainous silhouette of his attacker stared through the iron bars. He was broad and tall, with ghost-pale skin and thinning white hair. His irises were pink with dark red pupils. The albino drew a pistol from his coat and aimed the barrel through the bars, directly at the curator. \"You should not have run.\" His accent was not easy to place. \"Now tell me where it is.\"\u003c/p\u003e\n\u003cp\u003e\"I told you already,\" the curator stammered, kneeling defenseless on the floor of the gallery. \"I have no idea what you are talking about!\"\u003c/p\u003e\n\u003cp\u003e\"You are lying.\" The man stared at him, perfectly immobile except for the glint in his ghostly eyes. \"You and your brethren possess something that is not yours.\"\u003c/p\u003e\n\u003cp\u003eThe curator felt a surge of adrenaline. How could he possibly know this?\u003c/p\u003e\n\u003cp\u003e\"Tonight the rightful guardians will be restored. Tell me where it is hidden, and you will live.\" The man leveled his gun at the curator\u0027s head. \"Is it a secret you will die for?\"\u003c/p\u003e\n\u003cp\u003eSauniere could not breathe.\u003c/p\u003e\n\u003cp\u003eThe man tilted his head, peering down the barrel of his gun.\u003c/p\u003e\n\u003cp\u003eSauniere held up his hands in defense. \"Wait,\" he said slowly. \"I will tell you what you need to know.\" The curator spoke his next words carefully. The lie he told was one he had rehearsed many times... each time praying he would never have to use it.\u003c/p\u003e\n\u003cp\u003eWhen the curator had finished speaking, his assailant smiled smugly. \"Yes. This is exactly what the others told me.\"\u003c/p\u003e\n\u003cp\u003eSauniere recoiled. The others?\u003c/p\u003e\n\u003cp\u003e\"I found them, too,\" the huge man taunted. \"All three of them. They confirmed what you have just said.\"\u003c/p\u003e\n\u003cp\u003eIt cannot be! The curator\u0027s true identity, along with the identities of his three senechaux, was almost as sacred as the ancient secret they protected. Sauniere now realized his senechaux, following strict procedure, had told the same lie before their own deaths. It was part of the protocol.\u003c/p\u003e\n\u003cp\u003eThe attacker aimed his gun again. \"When you are gone, I will be the only one who knows the truth.\"\u003c/p\u003e\n\u003cp\u003eThe truth.In an instant, the curator grasped the true horror of the situation. If I die, the truth will be lost forever.Instinctively, he tried to scramble for cover.\u003c/p\u003e\n\u003cp\u003eThe gun roared, and the curator felt a searing heat as the bullet lodged in his stomach. He fell forward... struggling against the pain. Slowly, Sauniere rolled over and stared back through the bars at his attacker.\u003c/p\u003e\n\u003cp\u003eThe man was now taking dead aim at Sauniere\u0027s head.\u003c/p\u003e\n\u003cp\u003eSauniere closed his eyes, his thoughts a swirling tempest of fear and regret. The click of an empty chamber echoed through the corridor. The curator\u0027s eyes flew open.\u003c/p\u003e\n\u003cp\u003eThe man glanced down at his weapon, looking almost amused. He reached for a second clip, but then seemed to reconsider, smirking calmly at Sauniere\u0027s gut. \"My work here is done.\"\u003c/p\u003e\n\u003cp\u003eThe curator looked down and saw the bullet hole in his white linen shirt. It was framed by a small circle of blood a few inches below his breastbone. My stomach.Almost cruelly, the bullet had missed his heart. As a veteran of la Guerre d\u0027Algerie, the curator had witnessed this horribly drawn-out death before. For fifteen minutes, he would survive as his stomach acids seeped into his chest cavity, slowly poisoning him from within.\u003c/p\u003e\n\u003cp\u003e\"Pain is good, monsieur,\" the man said. Then he was gone. Alone now, Jacques Sauniere turned his gaze again to the iron gate. He was trapped, and the doors could not be reopened for at least twenty minutes. By the time anyone got to him, he would be dead. Even so, the fear that now gripped him was a fear far greater than that of his own death.\u003c/p\u003e\n\u003cp\u003eI must pass on the secret.\u003c/p\u003e\n\u003cp\u003eStaggering to his feet, he pictured his three murdered brethren. He thought of the generations who had come before them... of the mission with which they had all been entrusted.\u003c/p\u003e\n\u003cp\u003eAn unbroken chain of knowledge.\u003c/p\u003e\n\u003cp\u003eSuddenly, now, despite all the precautions... despite all the fail-safes... Jacques Sauniere was the only remaining link, the sole guardian of one of the most powerful secrets ever kept.\u003c/p\u003e\n\u003cp\u003eShivering, he pulled himself to his feet.\u003c/p\u003e\n\u003cp\u003eI must find some way... .\u003c/p\u003e\n\u003cp\u003eHe was trapped inside the Grand Gallery, and there existed only one person on earth to whom he could pass the torch. Sauniere gazed up at the walls of his opulent prison. A collection of the world\u0027s most famous paintings seemed to smile down on him like old friends.\u003c/p\u003e\n\u003cp\u003eWincing in pain, he summoned all of his faculties and strength. The desperate task before him, he knew, would require every remaining second of his life. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-da-vinci-code-robert-langdon-2/page-2.html","bookId":2227,"creation":"Oct 5, 2019 11:05:49 PM","modification":"Oct 5, 2019 11:05:49 PM"}
