{"id":107209,"no":5,"title":"Page 5","content":"\u003cp\u003eCHAPTER 7\u003c/p\u003e\n\u003cp\u003eThe modest dwelling within the Church of Saint-Sulpice was located on the second floor of the church itself, to the left of the choir balcony. A two-room suite with a stone floor and minimal furnishings, it had been home to Sister Sandrine Bieil for over a decade. The nearby convent washer formal residence, if anyone asked, but she preferred the quiet of the church and had made herself quite comfortable upstairs with a bed, phone, and hot plate.\u003c/p\u003e\n\u003cp\u003eAs the church\u0027s conservatrice d\u0027affaires, Sister Sandrine was responsible for overseeing all nonreligious aspects of church operations - general maintenance, hiring support staff and guides, securing the building after hours, and ordering supplies like communion wine and wafers.\u003c/p\u003e\n\u003cp\u003eTonight, asleep in her small bed, she awoke to the shrill of her telephone. Tiredly, she lifted the receiver.\u003c/p\u003e\n\u003cp\u003e\"Soeur Sandrine. Eglise Saint-Sulpice.\"\u003c/p\u003e\n\u003cp\u003e\"Hello, Sister,\" the man said in French.\u003c/p\u003e\n\u003cp\u003eSister Sandrine sat up. What time is it? Although she recognized her boss\u0027s voice, in fifteen years she had never been awoken by him. The abbe was a deeply pious man who went home to bed immediately after mass.\u003c/p\u003e\n\u003cp\u003e\"I apologize if I have awoken you, Sister,\" the abbe said, his own voice sounding groggy and on edge. \"I have a favor to ask of you. I just received a call from an influential American bishop.\u003c/p\u003e\n\u003cp\u003ePerhaps you know him? Manuel Aringarosa?\"\u003c/p\u003e\n\u003cp\u003e\"The head of Opus Dei?\" Of course I know of him.Who in the Church doesn\u0027t? Aringarosa\u0027s conservative prelature had grown powerful in recent years. Their ascension to grace was jump-started in 1982 when Pope John Paul II unexpectedly elevated them to a\" personal prelature of the Pope,\" officially sanctioning all of their practices. Suspiciously, Opus Dei\u0027s elevation occurred the same year the wealthy sect allegedly had transferred almost one billion dollars into the Vatican\u0027s Institute for Religious Works - commonly known as the Vatican Bank - bailing it out of an embarrassing bankruptcy. In a second maneuver that raised eyebrows, the Pope placed the founder of Opus Dei on the\" fast track\" for sainthood, accelerating an often century-long waiting period for canonization to a mere twenty years. Sister Sandrine could not help but feel that Opus Dei\u0027s good standing in Rome was suspect, but one did not argue with the Holy See.\u003c/p\u003e\n\u003cp\u003e\"Bishop Aringarosa called to ask me a favor,\" the abbe told her, his voice nervous. \"One of his numeraries is in Paris tonight...\"\u003c/p\u003e\n\u003cp\u003eAs Sister Sandrine listened to the odd request, she felt a deepening confusion. \"I\u0027m sorry, you say this visiting Opus Dei numerary cannot wait until morning?\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027m afraid not. His plane leaves very early. He has always dreamed of seeing Saint-Sulpice.\"\u003c/p\u003e\n\u003cp\u003e\"But the church is far more interesting by day. The sun\u0027s rays through the oculus, the graduated shadows on the gnomon, this is what makes Saint-Sulpice unique.\"\u003c/p\u003e\n\u003cp\u003e\"Sister, I agree, and yet I would consider it a personal favor if you could let him in tonight. He can be there at... say one o\u0027clock? That\u0027s in twenty minutes.\"\u003c/p\u003e\n\u003cp\u003eSister Sandrine frowned. \"Of course. It would be my pleasure.\" The abbe thanked her and hung up. Puzzled, Sister Sandrine remained a moment in the warmth of her bed, trying to shake off the cobwebs of sleep. Her sixty-year-old body did not awake as fast as it used to, although tonight\u0027s phone call had certainly roused her senses. Opus Dei had always made her uneasy. Beyond the prelature\u0027s adherence to the arcane ritual of corporal mortification, their views on women were medieval at best. She had been shocked to learn that female numeraries were forced to clean the men\u0027s residence halls for no pay while the men were at mass; women slept on hardwood floors, while the men had straw mats; and women were forced to endure additional requirements of corporal mortification... all as added penance for original sin. It seemed Eve\u0027s bite from the apple of knowledge was a debt women were doomed to pay for eternity. Sadly, while most of the Catholic Church was gradually moving in the right direction with respect to women\u0027s rights, Opus Dei threatened to reverse the progress. Even so, Sister Sandrine had her orders.\u003c/p\u003e\n\u003cp\u003eSwinging her legs off the bed, she stood slowly, chilled by the cold stone on the soles of her bare feet. As the chill rose through her flesh, she felt an unexpected apprehension.\u003c/p\u003e\n\u003cp\u003eWomen\u0027s intuition?\u003c/p\u003e\n\u003cp\u003eA follower of God, Sister Sandrine had learned to find peace in the calming voices of her own soul. Tonight, however, those voices were as silent as the empty church around her.\u003c/p\u003e\n\u003cp\u003eCHAPTER 8\u003c/p\u003e\n\u003cp\u003eLangdon couldn\u0027t tear his eyes from the glowing purple text scrawled across the parquet floor. Jacques Sauniere\u0027s final communication seemed as unlikely a departing message as any Langdon could imagine.\u003c/p\u003e\n\u003cp\u003eThe message read:\u003c/p\u003e\n\u003cp\u003e13-3-2-21-1-1-8-5\u003c/p\u003e\n\u003cp\u003eO, Draconian devil!\u003c/p\u003e\n\u003cp\u003eOh, lame saint!\u003c/p\u003e\n\u003cp\u003eAlthough Langdon had not the slightest idea what it meant, he did understand Fache\u0027s instinct that the pentacle had something to do with devil worship.\u003c/p\u003e\n\u003cp\u003eO, Draconian devil!\u003c/p\u003e\n\u003cp\u003eSauniere had left a literal reference to the devil. Equally as bizarre was the series of numbers. \"Part of it looks like a numeric cipher.\"\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Fache said. \"Our cryptographers are already working on it. We believe these numbers maybe the key to who killed him. Maybe a telephone exchange or some kind of social identification. Do the numbers have any symbolic meaning to you?\"\u003c/p\u003e\n\u003cp\u003eLangdon looked again at the digits, sensing it would take him hours to extract any symbolic meaning. If Sauniere had even intended any.To Langdon, the numbers looked totally random. He was accustomed to symbolic progressions that made some semblance of sense, but everything here - the pentacle, the text, the numbers - seemed disparate at the most fundamental level.\u003c/p\u003e\n\u003cp\u003e\"You alleged earlier,\" Fache said,\" that Sauniere\u0027s actions here were all in an effort to send some sort of message... goddess worship or something in that vein? How does this message fit in?\"\u003c/p\u003e\n\u003cp\u003eLangdon knew the question was rhetorical. This bizarre communique obviously did not fit Langdon\u0027s scenario of goddess worship at all.\u003c/p\u003e\n\u003cp\u003eO, Draconian devil? Oh, lame saint?\u003c/p\u003e\n\u003cp\u003eFache said, \"This text appears to be an accusation of some sort. Wouldn\u0027t you agree?\"\u003c/p\u003e\n\u003cp\u003eLangdon tried to imagine the curator\u0027s final minutes trapped alone in the Grand Gallery, knowing he was about to die. It seemed logical. \"An accusation against his murderer makes sense, I suppose.\"\u003c/p\u003e\n\u003cp\u003e\"My job, of course, is to put a name to that person. Let me ask you this, Mr. Langdon. To your eye, beyond the numbers, what about this message is most strange?\"\u003c/p\u003e\n\u003cp\u003eMost strange? A dying man had barricaded himself in the gallery, drawn a pentacle on himself, and scrawled a mysterious accusation on the floor. What about the scenario wasn\u0027t strange?\u003c/p\u003e\n\u003cp\u003e\"The word \u0027Draconian\u0027?\" he ventured, offering the first thing that came to mind. Langdon was fairly certain that a reference to Draco - the ruthless seventh-century B. C. politician - was an unlikely dying thought. \" \u0027Draconian devil\u0027 seems an odd choice of vocabulary.\"\u003c/p\u003e\n\u003cp\u003e\"Draconian?\" Fache\u0027s tone came with a tinge of impatience now. \"Sauniere\u0027s choice of vocabulary hardly seems the primary issue here.\"\u003c/p\u003e\n\u003cp\u003eLangdon wasn\u0027t sure what issue Fache had in mind, but he was starting to suspect that Draco and Fache would have gotten along well.\u003c/p\u003e\n\u003cp\u003e\"Sauniere was a Frenchman,\" Fache said flatly. \"He lived in Paris. And yet he chose to write this message...\"\u003c/p\u003e\n\u003cp\u003e\"In English,\" Langdon said, now realizing the captain\u0027s meaning. Fache nodded. \"Precisement.Any idea why?\" Langdon knew Sauniere spoke impeccable English, and yet the reason he had chosen English as the language in which to write his final words escaped Langdon. He shrugged.\u003c/p\u003e\n\u003cp\u003eFache motioned back to the pentacle on Sauniere\u0027s abdomen. \"Nothing to do with devil worship? Are you still certain?\"\u003c/p\u003e\n\u003cp\u003eLangdon was certain of nothing anymore. \"The symbology and text don\u0027t seem to coincide. I\u0027m sorry I can\u0027t be of more help.\"\u003c/p\u003e\n\u003cp\u003e\"Perhaps this will clarify.\" Fache backed away from the body and raised the black light again, letting the beam spread out in a wider angle. \"And now?\"\u003c/p\u003e\n\u003cp\u003eTo Langdon\u0027s amazement, a rudimentary circle glowed around the curator\u0027s body. Sauniere had apparently lay down and swung the pen around himself in several long arcs, essentially inscribing himself inside a circle.\u003c/p\u003e\n\u003cp\u003eIn a flash, the meaning became clear.\u003c/p\u003e\n\u003cp\u003e\"The Vitruvian Man,\"Langdon gasped. Sauniere had created a life-sized replica of Leonardo Da Vinci\u0027s most famous sketch.\u003c/p\u003e\n\u003cp\u003eConsidered the most anatomically correct drawing of its day, Da Vinci\u0027s The Vitruvian Man had become a modern-day icon of culture, appearing on posters, mouse pads, and T-shirts around the world. The celebrated sketch consisted of a perfect circle in which was inscribed a nude male... his arms and legs outstretched in a naked spread eagle.\u003c/p\u003e\n\u003cp\u003eDa Vinci.Langdon felt a shiver of amazement. The clarity of Sauniere\u0027s intentions could not be denied. In his final moments of life, the curator had stripped off his clothing and arranged his body in a clear image of Leonardo Da Vinci\u0027s VitruvianMan.\u003c/p\u003e\n\u003cp\u003eThe circle had been the missing critical element. A feminine symbol of protection, the circle around the naked man\u0027s body completed Da Vinci\u0027s intended message - male and female harmony. The question now, though, was why Sauniere would imitate a famous drawing.\u003c/p\u003e\n\u003cp\u003e\"Mr. Langdon,\" Fache said,\" certainly a man like yourself is aware that Leonardo Da Vinci had a tendency toward the darker arts.\"\u003c/p\u003e\n\u003cp\u003eLangdon was surprised by Fache\u0027s knowledge of Da Vinci, and it certainly went a long way toward explaining the captain\u0027s suspicions about devil worship. Da Vinci had always been an awkward subject for historians, especially in the Christian tradition. Despite the visionary\u0027s genius, he was a flamboyant homosexual and worshipper of Nature\u0027s divine order, both of which placed him in a perpetual state of sin against God. Moreover, the artist\u0027s eerie eccentricities projected an admittedly demonic aura: Da Vinci exhumed corpses to study human anatomy; he kept mysterious journals in illegible reverse handwriting; he believed he possessed the alchemic power to turn lead into gold and even cheat God by creating an elixir to postpone death; and his inventions included horrific, never-before-imagined weapons of war and torture.\u003c/p\u003e\n\u003cp\u003eMisunderstanding breeds distrust, Langdon thought.\u003c/p\u003e\n\u003cp\u003eEven Da Vinci\u0027s enormous output of breathtaking Christian art only furthered the artist\u0027s reputation for spiritual hypocrisy. Accepting hundreds of lucrative Vatican commissions, Da Vinci painted Christian themes not as an expression of his own beliefs but rather as a commercial venture - a means of funding a lavish lifestyle. Unfortunately, Da Vinci was a prankster who often amused himself by quietly gnawing at the hand that fed him. He incorporated in many of his Christian paintings hidden symbolism that was anything but Christian - tributes to his own beliefs and a subtle thumbing of his nose at the Church. Langdon had even given a lecture once at the National Gallery in London entitled:\" The Secret Life of Leonardo: Pagan Symbolism in Christian Art.\"\u003c/p\u003e\n\u003cp\u003e\"I understand your concerns,\" Langdon now said, \"but Da Vinci never really practiced any dark arts. He was an exceptionally spiritual man, albeit one in constant conflict with the Church.\" As Langdon said this, an odd thought popped into his mind. He glanced down at the message on the floor again. O, Draconian devil! Oh, lame saint!\u003c/p\u003e\n\u003cp\u003e\"Yes?\" Fache said.\u003c/p\u003e\n\u003cp\u003eLangdon weighed his words carefully. \"I was just thinking that Sauniere shared a lot of spiritual ideologies with Da Vinci, including a concern over the Church\u0027s elimination of the sacred feminine from modern religion. Maybe, by imitating a famous Da Vinci drawing, Sauniere was simply echoing some of their shared frustrations with the modern Church\u0027s demonization of the goddess.\"\u003c/p\u003e\n\u003cp\u003eFache\u0027s eyes hardened. \"You think Sauniere is calling the Church a lame saint and a Draconian devil?\"\u003c/p\u003e\n\u003cp\u003eLangdon had to admit it seemed far-fetched, and yet the pentacle seemed to endorse the idea on some level. \"All I am saying is that Mr. Sauniere dedicated his life to studying the history of the goddess, and nothing has done more to erase that history than the Catholic Church. It seems reasonable that Sauniere might have chosen to express his disappointment in his final good-bye.\"\u003c/p\u003e\n\u003cp\u003e\"Disappointment?\" Fache demanded, sounding hostile now. \"This message sounds more enragedthan disappointed, wouldn\u0027t you say?\"\u003c/p\u003e\n\u003cp\u003eLangdon was reaching the end of his patience. \"Captain, you asked for my instincts as to what Sauniere is trying to say here, and that\u0027s what I\u0027m giving you.\"\u003c/p\u003e\n\u003cp\u003e\"That this is an indictment of the Church?\" Fache\u0027s jaw tightened as he spoke through clenched teeth. \"Mr. Langdon, I have seen a lot of death in my work, and let me tell you something. When a man is murdered by another man, I do not believe his final thoughts are to write an obscure spiritual statement that no one will understand. I believe he is thinking of one thing only.\" Fache\u0027s whispery voice sliced the air. \"La vengeance.I believe Sauniere wrote this note to tell us who killed him.\" Langdon stared. \"But that makes no sense whatsoever.\" \"No?\" \"No,\" he fired back, tired and frustrated. \"You told me Sauniere was attacked in his office by someone he had apparently invited in.\"\u003c/p\u003e\n\u003cp\u003e\"Yes.\"\u003c/p\u003e\n\u003cp\u003e\"So it seems reasonable to conclude that the curator knew his attacker.\" Fache nodded. \"Go on.\" \"So if Sauniere knew the person who killed him, what kind of indictment is this?\" He pointed at the floor. \"Numeric codes? Lame saints? Draconian devils? Pentacles on his stomach? It\u0027s all too cryptic.\"\u003c/p\u003e\n\u003cp\u003eFache frowned as if the idea had never occurred to him. \"You have a point.\"\u003c/p\u003e\n\u003cp\u003e\"Considering the circumstances,\" Langdon said,\" I would assume that if Sauniere wanted to tell you who killed him, he would have written down somebody\u0027s name.\"\u003c/p\u003e\n\u003cp\u003eAs Langdon spoke those words, a smug smile crossed Fache\u0027s lips for the first time all night. \"Precisement,\"Fache said. \"Precisement.\"\u003c/p\u003e\n\u003cp\u003eI am witnessing the work of a master, mused Lieutenant Collet as he tweaked his audio gear and listened to Fache\u0027s voice coming through the headphones. The agent superieur knew it was moments like these that had lifted the captain to the pinnacle of French law enforcement.\u003c/p\u003e\n\u003cp\u003eFache will do what no one else dares.\u003c/p\u003e\n\u003cp\u003eThe delicate art of cajoler was a lost skill in modern law enforcement, one that required exceptional poise under pressure. Few men possessed the necessary sangfroid for this kind of operation, but Fache seemed born for it. His restraint and patience bordered on the robotic.\u003c/p\u003e\n\u003cp\u003eFache\u0027s sole emotion this evening seemed to be one of intense resolve, as if this arrest were somehow personal to him. Fache\u0027s briefing of his agents an hour ago had been unusually succinct and assured. I know who murdered Jacques Sauniere, Fache had said. You know what to do.No mistakes tonight.\u003c/p\u003e\n\u003cp\u003eAnd so far, no mistakes had been made.\u003c/p\u003e\n\u003cp\u003eCollet was not yet privy to the evidence that had cemented Fache\u0027s certainty of their suspect\u0027s guilt, but he knew better than to question the instincts of the Bull. Fache\u0027s intuition seemed almost supernatural at times. God whispers in his ear, one agent had insisted after a particularly impressive display of Fache\u0027s sixth sense. Collet had to admit, if there was a God, Bezu Fache would be on His A-list. The captain attended mass and confession with zealous regularity - far more than the requisite holiday attendance fulfilled by other officials in the name of good public relations. When the Pope visited Paris a few years back, Fache had used all his muscle to obtain the honor of an audience. A photo of Fache with the Pope now hung in his office. The Papal Bull, the agents secretly called it.\u003c/p\u003e\n\u003cp\u003eCollet found it ironic that one of Fache\u0027s rare popular public stances in recent years had been his outspoken reaction to the Catholic pedophilia scandal. These priests should be hanged twice! Fache had declared. Once for their crimes against children.And once for shaming the good name of theCatholic Church.Collet had the odd sense it was the latter that angered Fache more.\u003c/p\u003e\n\u003cp\u003eTurning now to his laptop computer, Collet attended to the other half of his responsibilities here tonight - the GPS tracking system. The image onscreen revealed a detailed floor plan of the Denon Wing, a structural schematic uploaded from the Louvre Security Office. Letting his eyes trace the maze of galleries and hallways, Collet found what he was looking for. Deep in the heart of the Grand Gallery blinked a tiny red dot. La marque.\u003c/p\u003e\n\u003cp\u003eFache was keeping his prey on a very tight leash tonight. Wisely so. Robert Langdon had proven himself one cool customer.\u003c/p\u003e\n\u003cp\u003eCHAPTER 9\u003c/p\u003e\n\u003cp\u003eTo ensure his conversation with Mr. Langdon would not be interrupted, Bezu Fache had turned off his cellular phone. Unfortunately, it was an expensive model equipped with a two-way radio feature, which, contrary to his orders, was now being used by one of his agents to page him.\u003c/p\u003e\n\u003cp\u003e\"Capitaine?\" The phone crackled like a walkie-talkie.\u003c/p\u003e\n\u003cp\u003eFache felt his teeth clench in rage. He could imagine nothing important enough that Collet would interrupt this surveillance cachee - especially at this critical juncture.\u003c/p\u003e\n\u003cp\u003eHe gave Langdon a calm look of apology. \"One moment please.\" He pulled the phone from his belt and pressed the radio transmission button. \"Oui?\"\u003c/p\u003e\n\u003cp\u003e\"Capitaine, un agent du Departement de Cryptographie est arrive.\"\u003c/p\u003e\n\u003cp\u003eFache\u0027s anger stalled momentarily. A cryptographer? Despite the lousy timing, this was probably good news. Fache, after finding Sauniere\u0027s cryptic text on the floor, had uploaded photographs of the entire crime scene to the Cryptography Department in hopes someone there could tell him what the hell Sauniere was trying to say. If a code breaker had now arrived, it most likely meant someone had decrypted Sauniere\u0027s message.\u003c/p\u003e\n\u003cp\u003e\"I\u0027m busy at the moment,\" Fache radioed back, leaving no doubt in his tone that a line had been crossed. \"Ask the cryptographer to wait at the command post. I\u0027ll speak to him when I\u0027m done.\"\u003c/p\u003e\n\u003cp\u003e\"Her,\"the voice corrected. \"It\u0027s Agent Neveu.\"\u003c/p\u003e\n\u003cp\u003eFache was becoming less amused with this call every passing moment. Sophie Neveu was one of DCPJ\u0027s biggest mistakes. A young Parisian dechiffreuse who had studied cryptography in England at the Royal Holloway, Sophie Neveu had been foisted on Fache two years ago as part of the ministry\u0027s attempt to incorporate more women into the police force. The ministry\u0027s ongoing foray into political correctness, Fache argued, was weakening the department. Women not only lacked the physicality necessary for police work, but their mere presence posed a dangerous distraction to the men in the field. As Fache had feared, Sophie Neveu was proving far more distracting than most.\u003c/p\u003e\n\u003cp\u003eAt thirty-two years old, she had a dogged determination that bordered on obstinate. Her eager espousal of Britain\u0027s new cryptologic methodology continually exasperated the veteran French cryptographers above her. And by far the most troubling to Fache was the inescapable universal truth that in an office of middle-aged men, an attractive young woman always drew eyes away from the work at hand.\u003c/p\u003e\n\u003cp\u003eThe man on the radio said,\" Agent Neveu insisted on speaking to you immediately, Captain. I tried to stop her, but she\u0027s on her way into the gallery.\"\u003c/p\u003e\n\u003cp\u003eFache recoiled in disbelief. \"Unacceptable! I made it very clear - \"\u003c/p\u003e\n\u003cp\u003eFor a moment, Robert Langdon thought Bezu Fache was suffering a stroke. The captain was mid- sentence when his jaw stopped moving and his eyes bulged. His blistering gaze seemed fixated on something over Langdon\u0027s shoulder. Before Langdon could turn to see what it was, he heard a woman\u0027s voice chime out behind him.\u003c/p\u003e\n\u003cp\u003e\"Excusez-moi, messieurs.\"\u003c/p\u003e\n\u003cp\u003eLangdon turned to see a young woman approaching. She was moving down the corridor toward them with long, fluid strides... a haunting certainty to her gait. Dressed casually in a knee-length, cream-colored Irish sweater over black leggings, she was attractive and looked to be about thirty. Her thick burgundy hair fell unstyled to her shoulders, framing the warmth of her face. Unlike the waifish, cookie-cutter blondes that adorned Harvard dorm room walls, this woman was healthy with an unembellished beauty and genuineness that radiated a striking personal confidence.\u003c/p\u003e\n\u003cp\u003eTo Langdon\u0027s surprise, the woman walked directly up to him and extended a polite hand.\" Monsieur Langdon, I am Agent Neveu from DCPJ\u0027s Cryptology Department.\" Her words curved richly around her muted Anglo-Franco accent. \"It is a pleasure to meet you.\"\u003c/p\u003e\n\u003cp\u003eLangdon took her soft palm in his and felt himself momentarily fixed in her strong gaze. Her eyes were olive-green - incisive and clear.\u003c/p\u003e\n\u003cp\u003eFache drew a seething inhalation, clearly preparing to launch into a reprimand.\u003c/p\u003e\n\u003cp\u003e\"Captain,\" she said, turning quickly and beating him to the punch, \"please excuse the interruption, but - \"\u003c/p\u003e\n\u003cp\u003e\"Ce n\u0027est pas le moment!\" Fache sputtered.\u003c/p\u003e\n\u003cp\u003e\"I tried to phone you.\" Sophie continued in English, as if out of courtesy to Langdon. \"But your cell phone was turned off.\"\u003c/p\u003e\n\u003cp\u003e\"I turned it off for a reason,\" Fache hissed. \"I am speaking to Mr. Langdon.\" \"I\u0027ve deciphered the numeric code,\" she said flatly. Langdon felt a pulse of excitement. She broke the code?\u003c/p\u003e\n\u003cp\u003eFache looked uncertain how to respond.\u003c/p\u003e\n\u003cp\u003e\"Before I explain,\" Sophie said,\" I have an urgent message for Mr. Langdon.\" Fache\u0027s expression turned to one of deepening concern. \"For Mr. Langdon?\" She nodded, turning back to Langdon. \"You need to contact the U. S. Embassy, Mr. Langdon. They have a message for you from the States.\"\u003c/p\u003e\n\u003cp\u003eLangdon reacted with surprise, his excitement over the code giving way to a sudden ripple of concern. A message from the States? He tried to imagine who could be trying to reach him. Only a few of his colleagues knew he was in Paris.\u003c/p\u003e\n\u003cp\u003eFache\u0027s broad jaw had tightened with the news. \"The U. S. Embassy?\" he demanded, sounding suspicious. \"How would they know to find Mr. Langdon here?\"\u003c/p\u003e\n\u003cp\u003eSophie shrugged. \"Apparently they called Mr. Langdon\u0027s hotel, and the concierge told them Mr. Langdon had been collected by a DCPJ agent.\"\u003c/p\u003e\n\u003cp\u003eFache looked troubled. \"And the embassy contacted DCPJ Cryptography?\"\u003c/p\u003e\n\u003cp\u003e\"No, sir,\" Sophie said, her voice firm. \"When I called the DCPJ switchboard in an attempt to contact you, they had a message waiting for Mr. Langdon and asked me to pass it along if I got through to you.\"\u003c/p\u003e\n\u003cp\u003eFache\u0027s brow furrowed in apparent confusion. He opened his mouth to speak, but Sophie had already turned back to Langdon.\u003c/p\u003e\n\u003cp\u003e\"Mr. Langdon,\" she declared, pulling a small slip of paper from her pocket,\" this is the number for your embassy\u0027s messaging service. They asked that you phone in as soon as possible.\" She handed him the paper with an intent gaze. \"While I explain the code to Captain Fache, you need to make this call.\"\u003c/p\u003e\n\u003cp\u003eLangdon studied the slip. It had a Paris phone number and extension on it. \"Thank you,\" he said, feeling worried now. \"Where do I find a phone?\"\u003c/p\u003e\n\u003cp\u003eSophie began to pull a cell phone from her sweater pocket, but Fache waved her off. He now looked like Mount Vesuvius about to erupt. Without taking his eyes off Sophie, he produced his own cell phone and held it out. \"This line is secure, Mr. Langdon. You may use it.\"\u003c/p\u003e\n\u003cp\u003eLangdon felt mystified by Fache\u0027s anger with the young woman. Feeling uneasy, he accepted the captain\u0027s phone. Fache immediately marched Sophie several steps away and began chastising her in hushed tones. Disliking the captain more and more, Langdon turned away from the odd confrontation and switched on the cell phone. Checking the slip of paper Sophie had given him, Langdon dialed the number.\u003c/p\u003e\n\u003cp\u003eThe line began to ring.\u003c/p\u003e\n\u003cp\u003eOne ring... two rings... three rings... Finally the call connected. Langdon expected to hear an embassy operator, but he found himself instead listening to an answering machine. Oddly, the voice on the tape was familiar. It was that of Sophie Neveu.\u003c/p\u003e\n\u003cp\u003e\"Bonjour, vous etes bien chez Sophie Neveu,\" the woman\u0027s voice said. \"Je suis absenle pour le moment, mais...\"\u003c/p\u003e\n\u003cp\u003eConfused, Langdon turned back toward Sophie. \"I\u0027m sorry, Ms. Neveu? I think you may have given me - \"\u003c/p\u003e\n\u003cp\u003e\"No, that\u0027s the right number,\" Sophie interjected quickly, as if anticipating Langdon\u0027s confusion.\" The embassy has an automated message system. You have to dial an access code to pick up your messages.\"\u003c/p\u003e\n\u003cp\u003eLangdon stared. \"But - \"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the three-digit code on the paper I gave you.\"\u003c/p\u003e\n\u003cp\u003eLangdon opened his mouth to explain the bizarre error, but Sophie flashed him a silencing glare that lasted only an instant. Her green eyes sent a crystal-clear message.\u003c/p\u003e\n\u003cp\u003eDon\u0027t ask questions. Just do it.\u003c/p\u003e\n\u003cp\u003eBewildered, Langdon punched in the extension on the slip of paper: 454.\u003c/p\u003e\n\u003cp\u003eSophie\u0027s outgoing message immediately cut off, and Langdon heard an electronic voice announce in French: \"You have one new message.\" Apparently, 454 was Sophie\u0027s remote access code for picking up her messages while away from home.\u003c/p\u003e\n\u003cp\u003eI\u0027m picking up this woman\u0027s messages?\u003c/p\u003e\n\u003cp\u003eLangdon could hear the tape rewinding now. Finally, it stopped, and the machine engaged. Langdon listened as the message began to play. Again, the voice on the line was Sophie\u0027s.\u003c/p\u003e\n\u003cp\u003e\"Mr. Langdon,\" the message began in a fearful whisper. \"Do not react to this message. Just listen calmly. You are in danger right now. Follow my directions very closely.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/the-da-vinci-code-robert-langdon-2/page-5.html","bookId":2227,"creation":"Oct 5, 2019 11:05:49 PM","modification":"Oct 5, 2019 11:05:49 PM"}
