{"id":73408,"no":35,"title":"Page 35","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003eHe lifted her hand and kissed the inside of her wrist. Her pulse hammered. He couldn’t keep his hands off her, had to be touching her, had to know she was near and she wouldn’t float away like a dream.\u003c/p\u003e\n\u003cp\u003e“I didn’t mean to be gone so long. I’m sorry.”\u003c/p\u003e\n\u003cp\u003eHer lashes lowered, casting shadows over her cheeks. “You don’t owe me an explanation.”\u003c/p\u003e\n\u003cp\u003e“Yeah. I do. We’re in what I like to call an exclusive give-and-take relationship. That implies certain rights. You have a right to know where I am and what I’m doing, just like I have a right to know about you.”\u003c/p\u003e\n\u003cp\u003eWhite teeth nibbled on her bottom lip. “All right. Where were you?”\u003c/p\u003e\n\u003cp\u003e“With Estap,” he admitted, expecting an explosive reaction.\u003c/p\u003e\n\u003cp\u003e“What!” Her mouth fell open, and her gaze snapped to his. “What did he want? What did he say to you? Did he hurt you? That dirty piece of—”\u003c/p\u003e\n\u003cp\u003e“He wanted me to interview an infected human,” Jaxon said, fighting a grin, “but that human died while I was in flight. And Estap said a lot of shit, most of which I ignored.”\u003c/p\u003e\n\u003cp\u003e“Oh, my God. You pissed him off. That’s why he called me.” A statement, not a question.\u003c/p\u003e\n\u003cp\u003eJaxon nodded.\u003c/p\u003e\n\u003cp\u003eHer lips edged into a slow smile, though there was panic in her eyes. “I wish I could have been there. Did you punch him? Tell me you punched him. Lie if you have to, but tell me!”\u003c/p\u003e\n\u003cp\u003eExcitement had blended with her panic, radiating from her, and Jaxon just couldn’t resist a moment longer. He had to hold her in his arms. He unbuckled her and tugged her into his lap. She had to straddle him to fit into the small alcove his big body and the seat provided.\u003c/p\u003e\n\u003cp\u003eHis cock jumped in response, reaching for her, wanting to be inside her.\u003c/p\u003e\n\u003cp\u003e“Can anyone see us?” she gasped out as she settled against him.\u003c/p\u003e\n\u003cp\u003e“Tinted windows. And yeah, I punched him.”\u003c/p\u003e\n\u003cp\u003eMoaning, she closed her eyes in ecstasy. She gripped his shoulders, her strawberry tresses falling like a curtain around them. “Tell me more.”\u003c/p\u003e\n\u003cp\u003e“His lip busted and two of his teeth fell out. Blood poured, and he cried like a baby.”\u003c/p\u003e\n\u003cp\u003e“God, that’s the sexiest thing I’ve ever heard.” Mishka arched against Jaxon’s swollen shaft, pressing hard before flitting away. Both of them groaned at the intense surge of pleasure. “More.”\u003c/p\u003e\n\u003cp\u003eJaxon palmed her breasts. Her nipples were so pearled they stabbed at his palms. “I kicked him in the stomach.”\u003c/p\u003e\n\u003cp\u003eUp and down she moved against him, rubbing…tantalizing. “I’m so wet.”\u003c/p\u003e\n\u003cp\u003e“You want to come?”\u003c/p\u003e\n\u003cp\u003e“Yes. Please.”\u003c/p\u003e\n\u003cp\u003eHe unsnapped her pants and delved a hand past her panties, right to her very center. Hot and wet, just as she’d claimed. He hissed in a breath. She cried out his name, practically ripped open his jeans, and wrapped her fingers around his cock.\u003c/p\u003e\n\u003cp\u003eTheir lips met in a heated clash, tongues thrusting, bodies undulating. She tasted so sweet, like passion and eternity. He pumped two fingers inside her as she rode his shaft with her hand, up and down, up and down.\u003c/p\u003e\n\u003cp\u003eMore, he needed more.\u003c/p\u003e\n\u003cp\u003eHe pulled from the kiss and bent his head, sucking one of her nipples through her shirt. Her inner walls squeezed at him, encouraging him to do more, take more. Another finger slid inside her, and his thumb circled her clit.\u003c/p\u003e\n\u003cp\u003e“I want this inside me,” she gasped, working the head of his penis. Round and round.\u003c/p\u003e\n\u003cp\u003e“Shit,” he managed to get out. “Don’t stop.”\u003c/p\u003e\n\u003cp\u003e“Want to make love,” she pouted.\u003c/p\u003e\n\u003cp\u003e“Here?”\u003c/p\u003e\n\u003cp\u003e“Here.”\u003c/p\u003e\n\u003cp\u003eHe had her pants on the floorboard one second later, and his dick inside her two seconds later. Besides Mishka, he’d never taken a woman without a condom. Just like before, her heat and wetness proved to be paradise. And yet, never had something been more erotic, more satisfying. This was home.\u003c/p\u003e\n\u003cp\u003eThe car turned a corner and they shifted to the side, but he never stopped pumping deep, hard, fast. She undulated against him, nipped and bit at his face, jerked at his hair, completely lost in her desire.\u003c/p\u003e\n\u003cp\u003eWhen their orgasms hit, they hit with the strength and force of his thrusts. Jaxon reclaimed her lips, swallowing her screams as he shot inside her, over and over again. Until he was empty, his strength depleted.\u003c/p\u003e\n\u003cp\u003eShe slumped against him, and he realized their hearts were racing in sync.\u003c/p\u003e\n\u003cp\u003eWhat could have been a minute or an eternity later, the car eased to a stop. Cursing under his breath, panting, he glanced out the window. They’d reached their destination. “We’re here.”\u003c/p\u003e\n\u003cp\u003eMishka’s head lifted, and she gifted him with a luminous, satisfied smile. He wanted to curse again when she pulled away from him, but he didn’t. They were on a time crunch. Instead, he tugged his shirt off and used it to clean them both up. As she shimmied back into her pants, he righted his own.\u003c/p\u003e\n\u003cp\u003eTonight, I’ll linger over her, he vowed.\u003c/p\u003e\n\u003cp\u003e“Where are we?” she asked.\u003c/p\u003e\n\u003cp\u003e“My house.”\u003c/p\u003e\n\u003cp\u003eEyes wide, she faced him. “Really? You brought me to your home?”\u003c/p\u003e\n\u003cp\u003eShe asked as if she didn’t deserve to be there. “Of course.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“That’s the surprise.” He commanded the car door to open and it obeyed. Out he climbed before lifting Mishka to the ground beside him. Up, up, up she gazed.\u003c/p\u003e\n\u003cp\u003e“Wow. The pictures didn’t do it justice.”\u003c/p\u003e\n\u003cp\u003eHe looked the house over, trying to see it through her eyes. Tall and winding, the four-story mansion boasted red brick, pristine and well kept. The lawn was manicured and green, the trees scattered throughout real. There were no other houses in sight, since he owned the surrounding hundred acres.\u003c/p\u003e\n\u003cp\u003e“It’s a family home. My grandfather gave it to me.”\u003c/p\u003e\n\u003cp\u003e“I love it.”\u003c/p\u003e\n\u003cp\u003eHe was glad, since he planned to move her in as soon as possible. “Come on.” He looped an arm over her shoulder and ushered her up the steps, past the porch, and through the French double doors, which opened the moment the sensors registered his identity.\u003c/p\u003e\n\u003cp\u003eThe entryway boasted intricately carved beige walls, with red velvet vanity chairs positioned around a cherrywood half-table. Four columns led to the wide, winding staircase. To the left and right, swirling gold and black carpet formed a path into the front and rear drawing rooms, both of which led into never-used formal dining rooms.\u003c/p\u003e\n\u003cp\u003eMishka ground her feet into the wood floor, trying to slow him down. “Hold on. I’m looking.”\u003c/p\u003e\n\u003cp\u003eHe brought his stride to a casual gait. She eyed the crystal chandelier and the portraits of his family hanging throughout.\u003c/p\u003e\n\u003cp\u003eHer brow furrowed. “There are none of you.”\u003c/p\u003e\n\u003cp\u003e“No. My mother has the ones of me as a kid, and I haven’t had any done since moving out on my own. Like I really want to look at my ugly mug every morning.”\u003c/p\u003e\n\u003cp\u003e“That’s ridiculous. You’re not ugly.”\u003c/p\u003e\n\u003cp\u003e“You sound like my mom.”\u003c/p\u003e\n\u003cp\u003e“Fuck that,” she muttered.\u003c/p\u003e\n\u003cp\u003eHe barked out a laugh. “Okay, now you sound like my woman.”\u003c/p\u003e\n\u003cp\u003eA rosy blush colored her cheeks. “Much better.”\u003c/p\u003e\n\u003cp\u003eFinally he managed to get her up the polished steps and past the square center hall. He bypassed the second-floor drawing room where he kept his poker table and virtual game center.\u003c/p\u003e\n\u003cp\u003eWhen they hit the third floor, where most of the bedrooms were, he stopped, nervousness blooming inside him.\u003c/p\u003e\n\u003cp\u003eConcerned, Mishka peered up at him. “What’s wrong?”\u003c/p\u003e\n\u003cp\u003eHe cupped her cheeks, and her palms settled over his bare chest. “Before I show you what I brought you here to show you, I want you to know it’s going to be okay. You have nothing to fear.”\u003c/p\u003e\n\u003cp\u003eHer eyes widened. “Jaxon, what’s going on?”\u003c/p\u003e\n\u003cp\u003e“I would never do anything to hurt or endanger you.” Now or never. “You know that, right?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003eHe swallowed—now or never—and led her into the last room on the right. He stopped. A queen-sized bed occupied the center of the room. Two men wearing lab coats stood beside it, studying several monitors that beeped and flashed.\u003c/p\u003e\n\u003cp\u003e“Oh my God. Is that…is that…?” Slowly Mishka walked forward, until she stood at the edge of the bed. “How? What?” She covered her mouth with a shaky hand. “Jaxon, you shouldn’t have done this. His men will come after you.”\u003c/p\u003e\n\u003cp\u003eJaxon approached her. She didn’t turn to look at him, her gaze glued on the unconscious Estap. The senator’s face was swollen and discolored from the beating Jaxon had given him. His naked body was covered only by a white sheet, and there were electrodes placed over every pulse point.\u003c/p\u003e\n\u003cp\u003eJaxon motioned to the doctors to leave, and they strode from the room without protest. “I killed the two guards who escorted me, and I made damn sure it looked like I’d boarded my plane home. No one knew I was there at the time of his disappearance.”\u003c/p\u003e\n\u003cp\u003e“Why aren’t news stations screaming about him?”\u003c/p\u003e\n\u003cp\u003e“I forced him to call his wife before I took him. He told her he was going away for a few weeks. As for other government officials, they can look for him, but they’ll never find him.”\u003c/p\u003e\n\u003cp\u003e“My God, Jaxon.” The words were barely audible, yet he managed to catch the trepidation in them. “Give me your knife.” That time she’d sounded hard, determined. She didn’t wait for his permission. She grabbed the blade at his waist and swirled it by the hilt. “We’ll kill him and destroy any evidence linking the two of you together. We’ll—”\u003c/p\u003e\n\u003cp\u003e“No.” He latched onto her arm.\u003c/p\u003e\n\u003cp\u003eShe’d already raised the knife, but her attention whipped to him, eyes narrowed. “You don’t have to do anything. I’ll do it. I won’t have you imprisoned or sentenced to death.”\u003c/p\u003e\n\u003cp\u003e“Killing him will kill you.”\u003c/p\u003e\n\u003cp\u003eA moment passed before his words sunk in and her fury and fear turned to confusion. “Explain.”\u003c/p\u003e\n\u003cp\u003e“The control chip is inside him. Without his living, beating heart, it will fade to nothing. You will fade to nothing.”\u003c/p\u003e\n\u003cp\u003eAs he spoke, her skin drained of color. He hated telling her this and causing her worry, but she deserved to know the truth.\u003c/p\u003e\n\u003cp\u003e“I should have known. That bastard!” She ripped free of Jaxon’s hold, dropped the blade as if she didn’t dare hold it a second more, and punched the unconscious man in the face. Cartilage snapped and blood oozed from his nose.\u003c/p\u003e\n\u003cp\u003eJaxon jerked her backward, pinning her arms at her sides. She struggled against him, and it took all of his strength to hold her in place. She would have escaped, he suspected, if she hadn’t been concerned about hurting him. “We need him alive, sweetheart. For the time being, at least. I’m afraid taking it out of him will cause it to shut down.”\u003c/p\u003e\n\u003cp\u003eGradually she stilled. She was panting with the effort required to control her emotions.\u003c/p\u003e\n\u003cp\u003e“I’ve got men searching the world for the best surgeons. We’re going to bring them here and they’re going to operate on you and remove the chip. Estap will never be able to control you again, I swear it. And once the chip is gone, you can kill him however you wish.”\u003c/p\u003e\n\u003cp\u003eShe turned in his arms and buried her face in the hollow of his neck. Tremors slid down her spine. “Surgery will kill me. The chip is now a part of me, another organ needed to function.”\u003c/p\u003e\n\u003cp\u003e“Your creators told you that, yes?”\u003c/p\u003e\n\u003cp\u003eShe nodded.\u003c/p\u003e\n\u003cp\u003e“Well, I think they lied. They wouldn’t want you to remove it, so they had to scare you about taking it out.”\u003c/p\u003e\n\u003cp\u003eNow she shook her head. “That’s almost too good to believe. I mean, all my life I’ve lived in fear of the chip and its removal. Not only because I was told I would die without it but because, at times, it was my only friend. My savior.”\u003c/p\u003e\n\u003cp\u003e“I’m your friend now, sweetheart.”\u003c/p\u003e\n\u003cp\u003e“Yes. You are.” Pause. “How did you get him?” she asked, voice shaky.\u003c/p\u003e\n\u003cp\u003e“I watched him for a day, then snuck back into his office. After I’d roughed him up a bit, I dragged him through his own secret tunnels. I had him on my private jet that very night.”\u003c/p\u003e\n\u003cp\u003e“Jaxon,” she said, and warm breath fanned his chest. “You shouldn’t have done this. You risked your life for mine.”\u003c/p\u003e\n\u003cp\u003e“And I’d do it again.”\u003c/p\u003e\n\u003cp\u003e“You shouldn’t have done it the first time. What if I die during surgery? I hate to bring that up again, but you would have risked you life for nothing.”\u003c/p\u003e\n\u003cp\u003e“You are not going to die!” Just the thought sent him into a tailspin of panic. “There’s nothing I wouldn’t do for you. Nothing. For a slightest chance to set you free, I’d do anything.”\u003c/p\u003e\n\u003cp\u003eShe was shaking her head before he got out the last word. “Don’t talk like that. If anything happened to you, I don’t know what I’d do.”\u003c/p\u003e\n\u003cp\u003eHe kissed the top of her head. “Nothing’s going to happen to me. I’m invincible.”\u003c/p\u003e\n\u003cp\u003eHer arms tightened around him. “Dallas says you’re going to die because of me.”\u003c/p\u003e\n\u003cp\u003e“Dallas is a moron.” He leaned down and kissed her temple this time. “Sweetheart, I finally found something worth living for. No way in hell I’d allow myself to be killed now.”\u003c/p\u003e\n\u003cp\u003eHer gaze lifted to his. “No way I’d allow you to be killed.”\u003c/p\u003e\n\u003cp\u003eThere was an unholy, determined edge to her voice that increased his nervousness. Before he could question her about what she was planning, however, his cell phone rang, startling him.\u003c/p\u003e\n\u003cp\u003eFrowning, he withdrew it from his pocket and held it to his ear. “This is Tremain.”\u003c/p\u003e\n\u003cp\u003e“Nolan’s on the move,” Eden said.\u003c/p\u003e\n\u003cp\u003eJaxon stiffened.\u003c/p\u003e\n\u003cp\u003eMishka’s eyes widened as if she’d heard every word.\u003c/p\u003e\n\u003cp\u003e“Seriously, he’s been homebound nearly the whole time you’ve been gone. Now you return, and suddenly he’s running. Coincidence?” Eden pushed out a breath. “He’s invisible, so you won’t be able to see him. I’m sending his signal to your phone, so you will be able to follow him, at least. Give me two minutes.” \u003c/p\u003e","sourceLink":"https://allnovel.net/savor-me-slowly-alien-huntress-3/page-35.html","bookId":1768,"creation":"Oct 5, 2019 10:27:30 AM","modification":"Oct 5, 2019 10:27:30 AM"}
