{"id":73413,"no":40,"title":"Page 40","content":"\u003cp\u003e\u003c/p\u003e\n\u003cp\u003e“Mia, fall back,” he commanded, and she obeyed instantly.\u003c/p\u003e\n\u003cp\u003eHe squeezed the trigger. A blue beam erupted. The Schön suddenly materialized, rooted in place. He was on his stomach, legs obviously pushing forward, hands reaching for the elevator doors. His beautiful face was contorted with fury.\u003c/p\u003e\n\u003cp\u003eBriefly closing his eyes, Jaxon sagged against the floor. Done. It was done. He’d been thrown all over that apartment, slapped at, punched, kicked, and bitten, but he was alive.\u003c/p\u003e\n\u003cp\u003e“It’s over,” he said. “All nine are stunned.”\u003c/p\u003e\n\u003cp\u003e“Sure?” Mishka asked.\u003c/p\u003e\n\u003cp\u003e“Sure.”\u003c/p\u003e\n\u003cp\u003eThe black faded from her eyes, returning the hazel he so adored. She blinked rapidly before focusing on him, looking him over, searching for injuries. When she found none, she slowly grinned. He returned the grin with one of his own. Desperate to hold his woman, he rose and marched forward. He’d doctor her up, gather her in his arms, and never let go.\u003c/p\u003e\n\u003cp\u003e“Not another step.”\u003c/p\u003e\n\u003cp\u003eJaxon halted, stomach tightening, grin falling away. “Mia. What are you doing?”\u003c/p\u003e\n\u003cp\u003e“What you obviously can’t.” A scowling Mia stood in front of the elevators, pyre-gun aimed at Miskha’s head.\u003c/p\u003e\n\u003cp\u003e“Don’t move,” he told Mishka. He held up his free hand, palms out. In his other, he still clutched his gun. His insides clenched, twisted with sickness. He was shaking. “Put the gun down, Mia. The Schön are taken care of. For now, we’ve won. It’s time to clean up and go.”\u003c/p\u003e\n\u003cp\u003e“She has to die.”\u003c/p\u003e\n\u003cp\u003eAs his fingers tightened on his weapon, his gaze flicked to Mishka. She’d remained in place as he’d told her to. A ray of emotions played across her lovely face: concern, hope, dread, agony, confusion.\u003c/p\u003e\n\u003cp\u003eThere was a knife a few inches from her knee. He gave it a pointed glance in a silent bid for her to pick it up. Whether she understood his command or not, she did not obey.\u003c/p\u003e\n\u003cp\u003e“Mia, please,” he said. “Don’t do this.”\u003c/p\u003e\n\u003cp\u003e“I have to. You can’t see past her pretty face to the monster inside.” Her arm was steady, her expression cold.\u003c/p\u003e\n\u003cp\u003eEvery drop of moisture in his mouth dried up. He licked his lips, dropped to his knees. “Put the gun down. I’m begging you. Put it down.”\u003c/p\u003e\n\u003cp\u003e“Maybe this is for the best. Don’t beg for me,” Mishka told him brokenly.\u003c/p\u003e\n\u003cp\u003e“Get up,” Mia screamed. Now her arm trembled. “Don’t you dare beg! Not for her. Get up!”\u003c/p\u003e\n\u003cp\u003e“Don’t do this,” he continued. “Please don’t do it. God, no. I love her.”\u003c/p\u003e\n\u003cp\u003e“She’s going to kill you. If I let her live, she’ll kill you. I can’t let that happen. You’re my friend, the brother of my heart.”\u003c/p\u003e\n\u003cp\u003e“She won’t hurt me. As you can see, she didn’t work with the Schön. She helped us.”\u003c/p\u003e\n\u003cp\u003e“This time. This time she helped. What about next time?”\u003c/p\u003e\n\u003cp\u003eStubborn as she was, Mia wouldn’t listen to him. The realization hit him, and he aimed, arm lashing up. For him, there was no other choice. But Eden and Lucius were on him seconds later, pinning him down before he could get off a single shot.\u003c/p\u003e\n\u003cp\u003e“Don’t make me hurt you,” Lucius said. “They said this might happen, but buddy, you don’t aim at agents.”\u003c/p\u003e\n\u003cp\u003eBucking, shouting curses, Jaxon managed to maintain a firm grip on the gun. “Don’t hurt her, Mia. She’s mine. I love her.”\u003c/p\u003e\n\u003cp\u003eNever had Jaxon experienced such panic. His own friends were conspiring against him. They refused to trust him, saw only what they wanted to see. “She’s not going to hurt me. Let her go. We’ll talk. I’ll explain. Please!”\u003c/p\u003e\n\u003cp\u003e“I saw it,” Dallas said from the corner. “I saw her shoot you. Her hair was brown then, but this is it. Has to be.”\u003c/p\u003e\n\u003cp\u003e“Wrong!” His muscles strained as he fought. Eden and Lucius proved stronger, though, as he’d already lost a lot of blood. He’d been in such a hurry to defeat the Schön and get to Mishka, he hadn’t stayed in place and simply fired his gun. He’d barreled his way through the room, been thrown into glass and walls. Several of his ribs were broken, he knew that, and two of his fingers. “She’s innocent.”\u003c/p\u003e\n\u003cp\u003eFrom the corner of his eye, he saw Dallas clutch his bleeding side. “Hold him down, damn it,” the agent gritted out.\u003c/p\u003e\n\u003cp\u003e“I’ll kill every one of you if you don’t let him go,” Mishka’s cold voice proclaimed.\u003c/p\u003e\n\u003cp\u003e“Why don’t you help,” Lucius growled to Dallas, ignoring both Jaxon and Mishka.\u003c/p\u003e\n\u003cp\u003e“Mia,” Dallas barked, “do it!”\u003c/p\u003e\n\u003cp\u003e“No!” Jaxon screamed. “No!”\u003c/p\u003e\n\u003cp\u003e“Let. Him. Go,” Mishka said. Now there was so much fury in her voice, it was like a separate entity in the hallway. “You’re hurting him.”\u003c/p\u003e\n\u003cp\u003eHe didn’t care about himself. Only her. He was nothing without her. Had nothing, wanted nothing.\u003c/p\u003e\n\u003cp\u003eAn eternity stretched.\u003c/p\u003e\n\u003cp\u003e“I can’t do it,” Mia finally growled, disgusted with herself. “I can’t.”\u003c/p\u003e\n\u003cp\u003e“This is what I saw.” Dallas limped forward. “This is when she aims. We have to kill her now.”\u003c/p\u003e\n\u003cp\u003eHorror filling him, Jaxon watched as his friend lifted a pyre-gun. He wanted this to be a dream, a nightmare he’d awaken from at any moment. But he knew it wasn’t. Knew time would be his enemy or his greatest friend.\u003c/p\u003e\n\u003cp\u003eHe worked a leg free and brought it forward, then kicked Lucius in the head. The agent grunted as he sailed backward. Infuriated, Eden raised a fist. Jaxon rolled away, already lifting his gun to the biggest threat: Dallas.\u003c/p\u003e\n\u003cp\u003e“No!” Mia shouted, switching her aim to Jaxon.\u003c/p\u003e\n\u003cp\u003eFinally Mishka dove for the knife.\u003c/p\u003e\n\u003cp\u003eThe next few seconds seemed to pass in agonizing slowness. Mishka tossed the knife at Mia, and it sank into the hand clutching the weapon. Mia gasped and dropped the gun, but not before squeezing off a single shot. Amber fire blazed past Jaxon’s head, singeing the hairs on his right side.\u003c/p\u003e\n\u003cp\u003eNever ceasing her fluid movements, Mishka grabbed the fallen gun and fired at Dallas.\u003c/p\u003e\n\u003cp\u003eDallas and Jaxon fired, too, one right after the other. Dallas at Mishka. Jaxon at Dallas. As Jaxon dove forward and twisted, taking the beam meant for Mishka, the blue beam he’d squeezed off slammed into Dallas and froze him in place, leaving him motionless but conscious of everything happening around him.\u003c/p\u003e\n\u003cp\u003eWhen the amber beam slammed into his shoulder, he grunted. Mishka screamed in concern.\u003c/p\u003e\n\u003cp\u003eJust like that, it was over. Finally.\u003c/p\u003e\n\u003cp\u003eThough both of his shoulders were blistered and burning, Jaxon turned to the two agents left standing. He didn’t drop the gun. “Touch the girl and I’ll kill you.”\u003c/p\u003e\n\u003cp\u003e“We’re going to gather the Schön,” Eden said calmly. “All right?”\u003c/p\u003e\n\u003cp\u003eHe backed up, keeping the gun high. The agents slowly stood, keeping their empty hands in sight. He was panting, losing focus. Dizzy. Still he kept moving. A blue stun beam erupted behind him, its light illuminating everything for a split second.\u003c/p\u003e\n\u003cp\u003e“Mishka?”\u003c/p\u003e\n\u003cp\u003e“I’m okay.” She was at his side in the next instant, arms wrapping around him. Tremors moved through her. “Took care of Mia. Now let’s take care of you.”\u003c/p\u003e\n\u003cp\u003eFinally he dropped his arm, relieved, happy and sad. The weapon clattered to the ground. He looked at his woman, saw tears streaking down her cheeks. “Don’t cry,” he said softly.\u003c/p\u003e\n\u003cp\u003e“Told you. I don’t cry. I leak.”\u003c/p\u003e\n\u003cp\u003e“I love you.”\u003c/p\u003e\n\u003cp\u003e“I love you, too.” She buried her face in the hollow of his neck. “I was so scared. Mia almost convinced me to give you up so you wouldn’t lose your friends, but they shot at you, so now I’m forcing you to give them up! Either that or I’ll kill them.”\u003c/p\u003e\n\u003cp\u003e“Don’t ever leave me, and I’ll be a satisfied man.”\u003c/p\u003e\n\u003cp\u003e“Never.”\u003c/p\u003e\n\u003cp\u003eHe chuckled, squeezed her with the last of his strength. “Sweetheart?”\u003c/p\u003e\n\u003cp\u003e“Yes?” She looked up at him, tenderness softening her dirty features.\u003c/p\u003e\n\u003cp\u003e“Catch me.” His entire world blackened.\u003c/p\u003e\n\u003cp\u003eDallas was immobilized by stun. Stupid alien blood. Months ago, stun would not have worked on him. Now he’d have to learn to avoid it. What disturbed him most, however, was that he was responsible for shooting his friend. All along, it was me. Me. Should have known. Should have guessed.\u003c/p\u003e\n\u003cp\u003eHorror slithered through him, nearly choking him. Le’Ace hadn’t been the one he’d seen in his vision, hurting Jaxon. Dallas had been. He’d been the mysterious stranger standing in the corner. Maybe because he’d become a stranger to himself. He wanted to curse, to rail.\u003c/p\u003e\n\u003cp\u003eHe’d been the one to fire the killing shot. All because he hadn’t trusted his friend.\u003c/p\u003e\n\u003cp\u003eThat was what the vision had hoped to show him, he now realized, ashamed of himself. If he’d trusted Jaxon, Jaxon wouldn’t have been shot. Mia might not have tried to kill the girl, and all would have been well. Was it too late?\u003c/p\u003e\n\u003cp\u003eHe watched as Le’Ace gently laid Jaxon on the floor and began ripping at his clothes, studying his body for injuries. There was love and concern on her face, as well as absolute determination.\u003c/p\u003e\n\u003cp\u003eShe wasn’t Jaxon’s killer; she was his savior.\u003c/p\u003e\n\u003cp\u003eI almost destroyed that. Still might, if Jaxon failed to recover. What kind of friend am I? Dallas had managed to change pieces of the vision. How?\u003c/p\u003e\n\u003cp\u003eKyrin had once predicted that Dallas’s life would be changed forever if he tried to save Jaxon. Dallas had thought Jaxon worth the chance. Still did. And yet, deep inside, Dallas knew this wasn’t the end for him. Knew this wasn’t what Kyrin had meant. Something more was going to happen. What, he could only wait and see. Maybe next time he’d get it right. The thought offered no comfort.\u003c/p\u003e\n\u003cp\u003eCHAPTER 28\u003c/p\u003e\n\u003cp\u003eBackup had arrived long ago and carted Jaxon to emergency surgery to repair the damage the pyre-guns had inflicted. As Mishka waited, she stitched her own wounds like she’d had to do a thousand times before. Paced. No one tried to talk to her, though the lobby filled with people. Jack, his boss. A few other agents.\u003c/p\u003e\n\u003cp\u003eShe probably looked capable of murder.\u003c/p\u003e\n\u003cp\u003eFinally, through the windows in the double doors, she saw Jaxon’s bed being wheeled to a room. She was pushing past the doctors and nurses, at his side and finally calming mere seconds later.\u003c/p\u003e\n\u003cp\u003e“Hey,” Jaxon said when he saw her. His lips lifted in a slow smile. His eyes were glazed from drugs and his voice scratchy, his shoulders wrapped in gauze, but she’d never been happier to see him.\u003c/p\u003e\n\u003cp\u003e“Hey, yourself.” Her voice shook so badly the words were almost imperceptible.\u003c/p\u003e\n\u003cp\u003ePeople buzzed around them, checking his monitors and pretending she wasn’t there. “How you feeling?” she asked. Thankfully, her voice was smoother this time.\u003c/p\u003e\n\u003cp\u003e“Mortified. I passed out in front of my girlfriend.”\u003c/p\u003e\n\u003cp\u003e“Fiancée,” she corrected.\u003c/p\u003e\n\u003cp\u003eA pause. His eyes lit with inner fire. “Really?”\u003c/p\u003e\n\u003cp\u003e“Really. You’re not getting rid of me. Ever.”\u003c/p\u003e\n\u003cp\u003e“And the chip?”\u003c/p\u003e\n\u003cp\u003e“Like you said, we’ll find the best surgeons and have it removed. I love you too much to die on the table.”\u003c/p\u003e\n\u003cp\u003eHis eyelids closed, that smile lingering on his lips. “Get up here.”\u003c/p\u003e\n\u003cp\u003eShe didn’t ask for permission from the doctors, simply crawled up beside him and rested her head on his stomach, away from his injuries. One of his arms banded around her, his IV tubes rubbing cold against her skin.\u003c/p\u003e\n\u003cp\u003e“Schön?” he asked tiredly.\u003c/p\u003e\n\u003cp\u003e“Dead. Except for Nolan. He’s in isolation. Eden came in an hour ago and told me they have the book that was in his apartment, as well as his ring. It was a decoder. The book chronicles everything he told us about that queen. There are pictures, drawings, so we’ll know her when she arrives, at least.”\u003c/p\u003e\n\u003cp\u003e“Still coming?”\u003c/p\u003e\n\u003cp\u003eMishka nodded. “Nolan can, apparently, sense her. He says she’s getting closer.”\u003c/p\u003e\n\u003cp\u003eJaxon fell asleep a moment later, his head lolling to the side, his chest rising and falling evenly. Content just to be near him, Mishka stayed where she was.\u003c/p\u003e\n\u003cp\u003eShe must have fallen asleep, too, because sometime during the night, she opened her eyes and Mia was there, standing beside the bed. She’d bandaged her hand and showered.\u003c/p\u003e\n\u003cp\u003e“Touch him and die,” Mishka said. “I will not tell you again.”\u003c/p\u003e\n\u003cp\u003eDallas limped through the doorway and stopped beside Mia. His features were drawn tight, his eyes flat. He did not look like the upbeat, vivacious agent she’d once read about, nor the sarcastic agent she’d met all those days ago. He was the man Jaxon had once tried to be: unemotional, unruffled.\u003c/p\u003e\n\u003cp\u003eHe and Mia shared a look and then said in unison, “I’m sorry.”\u003c/p\u003e\n\u003cp\u003eThey shared another looked and sighed. They sounded gruff but sincere.\u003c/p\u003e\n\u003cp\u003e“Here it is, flat out,” Mia said. “I’m not apologizing for failing to trust you. Considering everything that happened and that goddamn list, which I still don’t understand, by the way, that was a good decision on my part.”\u003c/p\u003e\n\u003cp\u003e“Identify weaknesses so you can eliminate them.” She stared pointedly. “Isn’t that standard agency procedure?”\u003c/p\u003e\n\u003cp\u003eMia’s mouth fell open. She closed it with a snap and glared at Mishka. “Fine. That’s great. Smart, even. But like I was saying, I’m not apologizing for that.” A pause, most of her aggression melting. “I’m apologizing because you love him, I saw it every time you looked at him, and I wanted to rip him away from you. Tit for tat, you could say.”\u003c/p\u003e\n\u003cp\u003e“My reasons for apologizing were a bit different, but whatever.” Dallas shrugged. “I shot at you.”\u003c/p\u003e\n\u003cp\u003eMishka relaxed, but only slightly. “It’s fine,” she said, obviously surprising them. She’d done worse. How could she blame them for these minor occurrences? “All of it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/savor-me-slowly-alien-huntress-3/page-40.html","bookId":1768,"creation":"Oct 5, 2019 10:27:30 AM","modification":"Oct 5, 2019 10:27:30 AM"}
