{"id":73022,"no":15,"title":"Page 15","content":"\u003cp\u003eHis confidence was well-founded. Within minutes, he’d broken through her resolve and was kissing her senseless. And Charlotte hadn’t raised a single objection.\u003c/p\u003e\n\u003cp\u003eIt was too late. Too late to walk away from him. Too late to go back to the way her life had been before Jason. She was trapped by her own weakness and would continue to be until Jason discovered the truth for himself.\u003c/p\u003e\n\u003cp\u003eCarrie arrived home soon afterward, full of tales about the twins and Kelsey. Seconds later, it seemed, she was in her room and on the phone. Her thoughts heavy, Charlotte appreciated the privacy.\u003c/p\u003e\n\u003cp\u003eIt wasn’t as though this was the first time Jason had kissed her. The impact he had on her senses wasn’t startling or new. The man had the uncanny knack of stirring awake the part of her she’d thought had died the day Tom asked for a divorce.\u003c/p\u003e\n\u003cp\u003eShe felt reborn, alive with hope. And yet she was more frightened than she’d ever been before. Everything was different with Jason. In his arms she experienced an excitement she’d never even known was possible. His tenderness, the loving gentle way in which he touched her, had given her cause to wonder, for the first time, if what Tom had said was true.\u003c/p\u003e\n\u003cp\u003eWhat if it wasn’t? Could that be possible? With Jason she felt none of the dread she’d felt when Tom had kissed her. His lovemaking had always been so hurried, so raw, as if he were in a rush to complete the act so he could turn away from her. She couldn’t imagine Jason being anything but compassionate and tender.\u003c/p\u003e\n\u003cp\u003eBut what if all the things Tom had said were true? Her heart slowed with uneasiness. Jason Manning was an attractive, sensual man. A passionate man. And he’d expect—no, he’d need—a passionate woman.\u003c/p\u003e\n\u003cp\u003eThinking of her years with Tom conjured up such ugly images in her mind. His taunts echoed like the constant sound of waves in a seashell, never stopping, never fading, always there to remind her of what a failure she was.\u003c/p\u003e\n\u003cp\u003eAt ten, Charlotte turned out the lights, made sure Carrie was off the phone and went to bed. She should’ve guessed that sleep would escape her that night.\u003c/p\u003e\n\u003cp\u003eYou’re perfect, Jason had said.\u003c/p\u003e\n\u003cp\u003eOnly she wasn’t—Tom had made certain she knew as much. The need to weep welled up within her, tightening her throat.\u003c/p\u003e\n\u003cp\u003eShe had loved Tom. She’d hated him.\u003c/p\u003e\n\u003cp\u003eHe had stripped her of her pride when he left.\u003c/p\u003e\n\u003cp\u003eHer life had ended that day. Yet, in other ways, her life had begun.\u003c/p\u003e\n\u003cp\u003eShe’d known for weeks, months, that Tom was involved with another woman, and she’d said nothing because she was afraid. Because she feared life alone. Because she was willing to do whatever she could to save her marriage, even if that meant denying the truth. So she’d chosen to believe his lies.\u003c/p\u003e\n\u003cp\u003eWhen he’d forced her to face reality, he’d come at her in anger and guilt…and hate. She hadn’t cried. Not a single tear, not even when the divorce was decreed final. It wasn’t until years later that she gave herself permission to grieve for the marriage, the fantasy she’d built in her mind of what might have been.\u003c/p\u003e\n\u003cp\u003eIn the beginning she’d been too numb with shock, too dazed by that last horrible scene, to experience any emotion. Gradually, as time passed, Charlotte began to feel again, a little at a time. It was like an anesthetic wearing off. As the years went by, as the numbness faded, she had to deal with the pain. A throbbing, savage pain.\u003c/p\u003e\n\u003cp\u003eHer grief came in waves. Regret struck first, reminding her of all the might-have-beens; one fantasy led to another. By now they would’ve had more children, she’d told herself. Tom would be established in his career and she’d be living the life she’d been cheated of as a child.\u003c/p\u003e\n\u003cp\u003eAnger followed regret. How could she have given her heart to a man who’d ravaged her self-respect? How could she have loved him when he’d treated her so poorly? But love him she had, so much that she still ached at losing the life she’d dreamed they’d share.\u003c/p\u003e\n\u003cp\u003eBut mostly, as the years went on, Charlotte felt an overwhelming sense of guilt. She knew it was unreasonable. After all, it was Tom who’d cheated on her, Tom who’d walked out on his family, abandoned his wife and child. It was Tom who’d forsaken their vows. Yet she was the one who accepted responsibility.\u003c/p\u003e\n\u003cp\u003eSometimes the guilt was so overpowering, Charlotte found it intolerable. If she’d been a better wife, Tom wouldn’t have sought another woman. He’d said so himself. If she’d been more enticing, more sexual, more attractive, more satisfying, he wouldn’t have done it. She was too thin, too flat, too cold. The list was endless.\u003c/p\u003e\n\u003cp\u003eAfter years of telling herself that Tom had used her inadequacies as an excuse for adultery, years of struggling to repair her self-esteem, Charlotte gave up. Surrendered. She bought it all. The reassurances she tried to offer herself were empty. Null and void.\u003c/p\u003e\n\u003cp\u003eEverything Tom had said was true. She was a failure as a woman. A failure as a wife. No man would ever be satisfied with her. Not for long. Tom hadn’t been and Jason wouldn’t be, either. She might as well accept that now and stop fighting the inevitable.\u003c/p\u003e\n\u003cp\u003eThe doorbell chimed just as Jason finished reading the latest issue of one of the veterinary periodicals he subscribed to.\u003c/p\u003e\n\u003cp\u003e“Yeah?” he said, opening the door, half expecting one of his tenants.\u003c/p\u003e\n\u003cp\u003e“Hi,” Carrie said, striding purposefully into his apartment. “Have you got a minute to talk?”\u003c/p\u003e\n\u003cp\u003e“Sure.” Jason led the way into the living room and sat down. Carrie started to pace in front of his television, hands behind her back. Walking in his apartment was dangerous with the week’s worth of newspapers spread across the carpet.\u003c/p\u003e\n\u003cp\u003e“Is it Higgins?” he prompted, when she didn’t speak right away.\u003c/p\u003e\n\u003cp\u003eShe shook her head, eyes lighting up. “Higgins is doing great. He’s eating and everything. I think he likes it with Mom and me.”\u003c/p\u003e\n\u003cp\u003e“I’m sure he does.” They’d lavished the dog with love and attention from the moment Jason had carried him into their apartment on Monday afternoon. One would’ve thought the mutt was some kind of hero. In a way he was, Jason decided. If it hadn’t been for the dog, Jason didn’t know how long it would have taken him and Charlotte to connect.\u003c/p\u003e\n\u003cp\u003e“What can I do for you?”\u003c/p\u003e\n\u003cp\u003e“It’s Mom,” Carrie said.\u003c/p\u003e\n\u003cp\u003e“What about your mother?” He saw that tears had pooled in Carrie’s eyes, and she wasn’t trying to hide the fact. Like most men, Jason was uncomfortable when a woman started to cry. No matter what the cause, he felt personally responsible. And he felt an overpowering urge to do whatever he could to rectify the problem.\u003c/p\u003e\n\u003cp\u003eHe certainly felt that way with Charlotte—even more so. She’d look at him with her beautiful blue eyes and the instant he saw the slightest hint of tears, he’d be putty in her hands. He was putty in her hands, anyway, tears or not, but that was because it was Charlotte.\u003c/p\u003e\n\u003cp\u003e“My mother’s ruining my life,” Carrie was saying.\u003c/p\u003e\n\u003cp\u003eJason was no psychiatrist, but he wasn’t completely obtuse. “Does this have something to do with that dance?”\u003c/p\u003e\n\u003cp\u003eCarrie nodded. “There’s this boy…his name’s Brad. He’s the cutest boy in class and the star of the track team. Every girl in school’s crazy about him and he asked me. Me,” she emphasized again, bringing her hand to her heart. “He asked me to the ninth-grade dance. When I talked to Mom, she said I could go, but when I said Brad’s father was picking us up and…and driving us there, she went totally weird on me.”\u003c/p\u003e\n\u003cp\u003e“I’m sure your mother has a good reason for feeling the way she does.”\u003c/p\u003e\n\u003cp\u003e“She won’t even talk about it.”\u003c/p\u003e\n\u003cp\u003e“Carrie, listen. I’d like to help, but this is between you and your mother. I can’t interfere with a parenting decision.”\u003c/p\u003e\n\u003cp\u003eCarrie nodded, her throat working as she struggled not to cry. “I don’t expect you to interfere…I was hoping that you’d help me—tell me what to say to make Mom understand how old-fashioned she’s being. I haven’t said anything to Brad about my mom not wanting me to be in the same car as him and his dad and…and the dance is next Friday night. There isn’t much time left.”\u003c/p\u003e\n\u003cp\u003eJason rubbed the side of his face. “What’s your mother’s primary objection?”\u003c/p\u003e\n\u003cp\u003e“She thinks driving with him makes it a real date. And I’m not allowed to date until next year.”\u003c/p\u003e\n\u003cp\u003e“I see. What if she drove you and Brad to the dance?”\u003c/p\u003e\n\u003cp\u003e“That won’t work, either…. Everyone will think I asked him and…it might be silly, but I want Suzie Jennings to know otherwise.” She wiped her eyes and took a moment to regain her composure.\u003c/p\u003e\n\u003cp\u003e“How about if Brad’s dad drops you off and your mother picks the two of you up after the dance?”\u003c/p\u003e\n\u003cp\u003eCarrie dropped her hands to her side. “Picks us up?” she repeated thoughtfully.\u003c/p\u003e\n\u003cp\u003e“It wouldn’t be considered a date then, would it? The two of you obviously need to be driven to and from the dance and this would simply be a means of transporting you.”\u003c/p\u003e\n\u003cp\u003e“There’s a party at Amanda Emerich’s house right afterward, but it’s directly across the street from the school and everyone’s invited.”\u003c/p\u003e\n\u003cp\u003e“I have an even better idea,” Jason said enthusiastically. At Carrie’s blank stare, he explained. “How about if your mother offered to chaperone the dance?”\u003c/p\u003e\n\u003cp\u003eJudging by the look Carrie gave him, she didn’t share his enthusiasm. “That wouldn’t work because she’d need a date. Chaperones at our school dances are always couples.”\u003c/p\u003e\n\u003cp\u003e“I’ll go with her,” Jason said casually. As soon as he made the suggestion, he wanted to jerk it back. Him dancing? The last dance he’d attended had been his sister’s engagement party. He’d rented a tuxedo and been miserable most of the night. Before then, his only other experience on the dance floor had been as a high-school junior. He didn’t know how to dance then and he hadn’t learned since.\u003c/p\u003e\n\u003cp\u003e“You’d do that?” Carrie asked, her voice rising. For the first time since she’d entered his home, her eyes sparkled with hope.\u003c/p\u003e\n\u003cp\u003e“Ah…” Oh, what the heck, he’d do it if it would help the kid. “Sure,” he answered. “I’d volunteer to be a chaperone.”\u003c/p\u003e\n\u003cp\u003eCarrie let out a cry of glee and raced across the room to throw her arms around his neck.\u003c/p\u003e\n\u003cp\u003e“Your mother might not be willing—”\u003c/p\u003e\n\u003cp\u003e“She will,” Carrie said confidently. “Mom’s crazy about you.”\u003c/p\u003e\n\u003cp\u003e“Yes, but will she be crazy about the idea of Brad’s dad driving you there and the two of us taking you home?”\u003c/p\u003e\n\u003cp\u003eCarrie mulled that over for a moment. “Of course she will,” she said, revealing no doubt. “Why shouldn’t she be? It’s a wonderful compromise. We’ll both be satisfied…. I mean, this plan isn’t perfect—no one wants their mother chaperoning a school dance—but it’ll work because Mom’s going to agree when she knows you suggested it.”\u003c/p\u003e\n\u003cp\u003eJason was suffering from second thoughts when he rang Charlotte’s doorbell an hour later. Carrie had devised a plan for approaching Charlotte with his idea. At the appropriate point, he was to suggest the two of them chaperone the dance and make it sound like a spur-of-the-moment idea. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-15.html","bookId":1982,"creation":"Oct 5, 2019 10:26:50 AM","modification":"Oct 5, 2019 10:26:50 AM"}
