{"id":73028,"no":21,"title":"Page 21","content":"\u003cp\u003eThere was a message from his mother when he returned to his apartment. His mind was heavy with everything he’d learned about Charlotte’s marriage and he contemplated waiting to return his mother’s call, but she’d sounded so excited.\u003c/p\u003e\n\u003cp\u003eSighing, he reached for the phone. His mother answered on the first ring.\u003c/p\u003e\n\u003cp\u003e“Jason, I’m so glad you called! I have so much to tell you. I talked to Taylor and Christy and they’ve both agreed to come.”\u003c/p\u003e\n\u003cp\u003e“Come?”\u003c/p\u003e\n\u003cp\u003e“You can’t imagine what a day I’ve had,” his mother continued, her voice animated. “I called Barbara Johnson, you remember Barbara, my friend who owns the floral shop, don’t you? We went to high school together a thousand years ago.”\u003c/p\u003e\n\u003cp\u003e“Mom…”\u003c/p\u003e\n\u003cp\u003e“Let me finish.” With barely a pause to breathe, she went on, “Barbara was the one who got things started. She suggested we contact the yacht club right away and book a date for the reception. They’re booked at least a year in advance. A year, I told myself. I know you, Jason, and when you’re ready to do something, you don’t want to wait an entire year. Barbara was right. The earliest date was August the year after next. I can tell you, I was shocked. I had no idea we’d need to book the reception so early.”\u003c/p\u003e\n\u003cp\u003e“Reception? What reception?” Jason was starting to get a frightening premonition.\u003c/p\u003e\n\u003cp\u003eHis mother ignored his question. “That’s when I learned there’d been a cancellation in July. This July! I couldn’t believe our luck. Naturally I booked it that very instant. Then I contacted the caterers and, as luck would have it, they agreed to do the dinner, although it’s only three weeks’ notice. Three weeks, Jason. Three weeks. It sounds crazy to even attempt something of this magnitude, but we’re going to pull it off without a hitch.”\u003c/p\u003e\n\u003cp\u003eJason’s vague premonition was beginning to solidify. “Mom, what are you talking about?” he asked with growing anxiety.\u003c/p\u003e\n\u003cp\u003eOnce again his mother disregarded his question. “That’s when I phoned Taylor and Christy. They both called back to say they’re coming. They’ve already made their plane reservations. Russ is coming, and Mandy, too. Remember Mandy, Russ’s sister? She’s in college now, you know.”\u003c/p\u003e\n\u003cp\u003e“Coming? To what, Mother?” Jason demanded.\u003c/p\u003e\n\u003cp\u003e“Why, Jason, I’ve spent the day making the arrangements for your wedding to Charlotte. What else would I be talking about, for heaven’s sake?”\u003c/p\u003e\n\u003cp\u003eTen\u003c/p\u003e\n\u003cp\u003e“Mother, have you gone stark, raving mad?” Jason had difficulty keeping a rein on his anger. “How can you set a wedding date and hire caterers when I haven’t even mentioned it to Charlotte? This is insane.” He rubbed his face, wondering if he’d imagined this entire fiasco.\u003c/p\u003e\n\u003cp\u003e“Your father warned me you’d be angry, but, Jason, I know you. Once you and Charlotte decide to marry, you won’t want to wait two years.”\u003c/p\u003e\n\u003cp\u003e“Mom, I don’t suppose it dawned on you that there are other places we could have a wedding reception—if we were actually having one. The yacht club isn’t the only venue in this town.”\u003c/p\u003e\n\u003cp\u003e“Frankly, no, it didn’t occur to me,” his mother returned calmly. “Since we’re just going to have one formal wedding in this family, we’re doing it up big, and the yacht club’s the best alternative.”\u003c/p\u003e\n\u003cp\u003eJason could see he was losing ground. “Let me talk to Dad.”\u003c/p\u003e\n\u003cp\u003e“But, Jason—”\u003c/p\u003e\n\u003cp\u003e“Mother!”\u003c/p\u003e\n\u003cp\u003e“All right, just a minute.”\u003c/p\u003e\n\u003cp\u003eThat minute seemed to take an hour. By the time he had his father on the line, Jason was as angry as he’d ever been. The instant he heard Eric pick up the receiver, he shouted, “Has Mother gone crazy? Have you? How could you let things go this far?”\u003c/p\u003e\n\u003cp\u003eHis father chuckled, apparently amused, something Jason most definitely wasn’t. “I agree with you,” his father said breezily, “your mother has gone a little crazy.”\u003c/p\u003e\n\u003cp\u003e“Dad, listen, I know you and Mom mean well, but I refuse to let you run my life. Scheduling the reception, talking to florists, I can’t believe you’d allow Mom to do all this without talking to me first.”\u003c/p\u003e\n\u003cp\u003e“Don’t forget, she’s involved Taylor and Christy, as well. That’s when I thought she’d stepped over the line. You haven’t even asked Charlotte to marry you, and Elizabeth’s got your sisters choosing bridesmaids’ dresses. By the way, I don’t suppose she told you about the honeymoon? Two weeks in Hawaii—it’s our wedding gift to you.”\u003c/p\u003e\n\u003cp\u003eJason clenched his fist at his side and closed his eyes, trying to calm himself. It didn’t work. The situation was absurd. And he was beginning to see that his father was in on this nonsense. “Two weeks in Hawaii…Taylor and Christy choosing bridesmaids’ dresses. You’ve both gone off the deep end.”\u003c/p\u003e\n\u003cp\u003e“To your mother’s credit, she didn’t intend for this to happen. It just did. I know you’re upset now, and to be honest, I don’t blame you, but once you get used to the idea, it doesn’t sound so ludicrous.”\u003c/p\u003e\n\u003cp\u003eGet used to the idea, Jason mused. He felt like he was in the middle of a nightmare. “You honestly think I should agree to this…this outrageousness?” He could barely speak.\u003c/p\u003e\n\u003cp\u003e“Answer me this. Are you in love with Charlotte?”\u003c/p\u003e\n\u003cp\u003e“Yes.” That much was a given—he’d already told his parents so.\u003c/p\u003e\n\u003cp\u003e“Do you intend to ask her to marry you?”\u003c/p\u003e\n\u003cp\u003eHis dad knew the answer to that, too. “Yes…eventually, in my own time and my own way.”\u003c/p\u003e\n\u003cp\u003e“If you’re planning to marry the girl anyway, then what’s the problem?”\u003c/p\u003e\n\u003cp\u003e“I wasn’t going to do it in three weeks!”\u003c/p\u003e\n\u003cp\u003e“Three weeks, three months, what’s the difference?”\u003c/p\u003e\n\u003cp\u003eJason couldn’t believe it. His father was talking pure craziness.\u003c/p\u003e\n\u003cp\u003e“I realize your mother and I went about this wrong, but after what happened with your brothers and sisters, all I ask is that you cut us a little slack.”\u003c/p\u003e\n\u003cp\u003e“A little slack,” he snorted. “Marriage is a serious step. A man doesn’t make that kind of decision one minute and march up the aisle the next.”\u003c/p\u003e\n\u003cp\u003e“I used to feel that way myself, but it’s pretty much what happened with Taylor and Russ, as well as Christy and Cody. They made up their minds, then went right ahead and did it.”\u003c/p\u003e\n\u003cp\u003e“All right, all right,” Jason muttered, willing to concede the point. Their weddings were spontaneous, to say the least. Same for Rich and Paul.\u003c/p\u003e\n\u003cp\u003e“I agree, marriage is a serious step,” his father went on calmly, “but if you’re in love with Charlotte and intend to marry her anyway, I don’t see the harm in your mother getting the ball rolling.”\u003c/p\u003e\n\u003cp\u003eThe ball rolling. She’d started an avalanche. “Don’t you think Mom’s just a tad premature?”\u003c/p\u003e\n\u003cp\u003e“Perhaps,” his father agreed amicably enough. “But you can’t really blame her for that. She got caught up in the excitement of the moment. Once she talked to the yacht club, everything sort of fell into place. It makes sense once you analyze it. You’ve been a bachelor a long time, Jason. If you’re as serious about marrying Charlotte as you claim, my advice is, just do it. If you wait, you might talk yourself out of it.”\u003c/p\u003e\n\u003cp\u003e“Do it,” Jason echoed. “You make marriage sound like taking up an exercise program.” He could see he wasn’t going to make any more headway with his father than he had his mother.\u003c/p\u003e\n\u003cp\u003e“Think about it, all right? That’s all I ask.”\u003c/p\u003e\n\u003cp\u003e“Aren’t you forgetting something?”\u003c/p\u003e\n\u003cp\u003e“What?”\u003c/p\u003e\n\u003cp\u003e“Charlotte might say no.”\u003c/p\u003e\n\u003cp\u003eHis father laughed. “Charlotte’s as much in love with you as you are with her. She’ll marry you in a New York minute and we both know it.”\u003c/p\u003e\n\u003cp\u003e“But, Dad…”\u003c/p\u003e\n\u003cp\u003e“Just think about it overnight. That’s all your mother and I are asking. If you decide you’d rather not go through with this, then phone us in the morning and we’ll put a stop to everything.”\u003c/p\u003e\n\u003cp\u003e“I don’t need to sleep on this,” Jason argued. “I can tell you right now that I’m not going to agree. I’ve never heard anything more absurd in my life. A wedding in a few weeks! I was thinking more along the lines of two or three years!”\u003c/p\u003e\n\u003cp\u003eA heavy silence followed his words. “Then you must not be as much in love as your mother and I assumed. Give us a call in the morning,” his father said and hung up the phone.\u003c/p\u003e\n\u003cp\u003eJason was too furious to stand still. He paced his living room, jerked his baseball cap off his head and slapped it against his thigh. He tried to smooth out the crease in the bill, realized he couldn’t and tossed the hat on top of the television.\u003c/p\u003e\n\u003cp\u003eEarlier that evening, he’d been talking to Charlotte about this very thing—people manipulating and controlling others. Well, he wasn’t about to fall prey to it now. Especially not with his parents.\u003c/p\u003e\n\u003cp\u003eIf he allowed his mother to schedule his wedding, there was no telling where she’d stop. The next thing he knew she’d be meddling in all his personal affairs. She’d be deciding when it was time for him and Charlotte to have a family.\u003c/p\u003e\n\u003cp\u003eHe drew in a deep, calming breath to clear his head.\u003c/p\u003e\n\u003cp\u003eHis assessment of his mother was unfair, he told himself a few minutes later. His parents hadn’t interfered in his brothers’ or sisters’ marriages. From what he understood, they’d suggested Leah and Paul get married, but that was common sense. Leah and Paul should have seen it themselves. He knew his parents had debated long and hard about confronting them and had done so reluctantly, after much soul-searching.\u003c/p\u003e\n\u003cp\u003eBut arranging his marriage to Charlotte was an entirely different matter. They’d stepped over the boundary there—although…although he did understand how easy it must have been to get caught up in the heat of the moment. Getting the date at the yacht club had set everything in motion, and before either of his parents were aware of it, they’d planned the whole wedding.\u003c/p\u003e\n\u003cp\u003eAs he recalled from his dinner conversation the day before, Jason had told his mother that Charlotte would welcome her assistance in planning the wedding. She’d done a bit more than suggest what type of flowers to use in the bridal bouquet, however.\u003c/p\u003e\n\u003cp\u003eNo, it was out of the question.\u003c/p\u003e\n\u003cp\u003eJason flatly refused to be a pawn. When he was ready to marry Charlotte he’d…\u003c/p\u003e\n\u003cp\u003eMarried. He and Charlotte.\u003c/p\u003e\n\u003cp\u003eHe needed at least a year just to get used to the idea. A man his age didn’t surrender his freedom without plenty of serious thought.\u003c/p\u003e\n\u003cp\u003eThen he remembered the phenomenon of holding Charlotte in his arms, of loving her, and the simple pleasure he found in spending time with her. He tried to imagine what his life would be like without her and discovered he couldn’t. So his belief that he wasn’t ready flew out the window.\u003c/p\u003e\n\u003cp\u003eBut marriage, he told himself, would take away his freedom. He’d never watch another game on TV again without feeling guilty—a wife would make sure of that. Women nagged and controlled, didn’t they?\u003c/p\u003e\n\u003cp\u003eCharlotte was a woman, but she wasn’t like the others he’d known. She’d been controlled and manipulated herself; she’d fought against it. Jason couldn’t in all honesty believe she’d try the same tactics on him. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-21.html","bookId":1982,"creation":"Oct 5, 2019 10:26:50 AM","modification":"Oct 5, 2019 10:26:50 AM"}
