{"id":73029,"no":22,"title":"Page 22","content":"\u003cp\u003eOnce again his argument wouldn’t hold.\u003c/p\u003e\n\u003cp\u003eAll right, maybe there were more things to consider besides his freedom. But here, too, he was losing ground. He’d found freedom in Charlotte, freedom to be himself, freedom to look toward the future.\u003c/p\u003e\n\u003cp\u003eCharlotte wanted children.\u003c/p\u003e\n\u003cp\u003eAnother contentious issue. Children. Carrie had said as much the day she’d stopped by his office to bribe him to take out her mother. If he married Charlotte, he might as well accept that a year or so down the road they’d have a baby.\u003c/p\u003e\n\u003cp\u003eSo? Wasn’t that what he wanted?\u003c/p\u003e\n\u003cp\u003eHe hadn’t thought much about a family until recently. He vividly remembered the sensations that had overwhelmed him the first time he’d seen Charlotte holding Jeremy. Watching her play with his brother’s son had left him breathless. Of course, being hit by a fast-moving Frisbee might have contributed to that.\u003c/p\u003e\n\u003cp\u003eOkay, so he wanted children. A man didn’t marry a woman without giving the prospect some consideration. Since he was well past thirty, and fast approaching forty, he should start thinking along those lines soon. Charlotte was nearly thirty-six herself, and he knew it was safer for a woman to give birth before the age of forty.\u003c/p\u003e\n\u003cp\u003eWhich meant he had to throw out his idea of waiting two or three years to get married. If he was serious, and he was, they should do it soon.\u003c/p\u003e\n\u003cp\u003eBut three weeks was too soon….\u003c/p\u003e\n\u003cp\u003eHe’d sleep on it, Jason decided, take his father’s advice and give this whole wedding business some thought. But he could say right now, that on general principles alone, he was against it.\u003c/p\u003e\n\u003cp\u003eAn hour later, after tossing and turning and wreaking havoc with his bedsheets, Jason knew. Knew it from the way he couldn’t keep his hands from clenching. Knew it from the way his stomach tensed.\u003c/p\u003e\n\u003cp\u003eHe was going to marry Charlotte Weston. The wedding was already scheduled.\u003c/p\u003e\n\u003cp\u003eCharlotte didn’t know what was wrong with him. Jason had fidgeted all through dinner, although dinner had been his idea. He’d called her early that morning, before she’d left for work, and invited her out.\u003c/p\u003e\n\u003cp\u003eThe invitation had sounded offhand, spur of the moment. Or that was how he’d apparently intended it to sound. But Charlotte wasn’t fooled. His voice had tensed as though he wasn’t sure she’d say yes—which was ridiculous. Surely he knew how crazy she was about him. Yet, when she assured him she’d be happy to join him for dinner, he hadn’t seemed the least bit relieved.\u003c/p\u003e\n\u003cp\u003eShe’d suggested Mr. Tamales, but he’d disagreed. Instead he’d chosen a fancy seafood restaurant near the harbor. She’d been looking forward to chicken enchiladas, but certainly wasn’t disappointed with her shrimp Louis.\u003c/p\u003e\n\u003cp\u003eCharlotte could have sworn, however, that Jason hadn’t eaten more than three bites of his wine-sautéed scallops. “Jason,” she said after a long silence. “Is something bothering you?”\u003c/p\u003e\n\u003cp\u003e“No,” he replied abruptly.\u003c/p\u003e\n\u003cp\u003e“You haven’t said a word in the last five minutes. Aren’t you feeling well?”\u003c/p\u003e\n\u003cp\u003e“My stomach’s in knots.” His reply was quick and short-tempered. He reached for his water glass, emptying ice chips into his mouth, then chewed on them fiercely.\u003c/p\u003e\n\u003cp\u003e“Do you want to leave?”\u003c/p\u003e\n\u003cp\u003eHis eyes met hers and for an all-too-brief moment the tension eased from around his mouth. “Not yet.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she said, wondering at his strange mood.\u003c/p\u003e\n\u003cp\u003e“How did everything go with your boss?” he asked, seeming to want to change the subject.\u003c/p\u003e\n\u003cp\u003eShe’d already told him, but apparently he hadn’t been paying attention. “He’s angry, especially since two other people also gave their notice when they learned I wasn’t changing my mind.”\u003c/p\u003e\n\u003cp\u003e“Did he try to make staying worth your while?”\u003c/p\u003e\n\u003cp\u003eCharlotte nodded. “He offered me and the others a raise.” Mr. Ward had called all three of them into his office, smugly claimed he was willing to overlook this small mutiny and offered them each a raise if they’d withdraw their resignations.\u003c/p\u003e\n\u003cp\u003e“You didn’t take his bride—I mean bribe—did you?”\u003c/p\u003e\n\u003cp\u003e“No.” Charlotte was still basking in the satisfaction she’d felt when she told Mr. Ward she wasn’t interested in withdrawing her notice. Cheryl and Janice hadn’t changed their minds, either. Mr. Ward had been stunned, but she knew that would soon pass.\u003c/p\u003e\n\u003cp\u003eBefore the end of the two weeks, he’d try every manipulative tactic in the book. When she didn’t give in, he’d try anger, his least effective tool.\u003c/p\u003e\n\u003cp\u003eShe was through with a boss who was so angry and unreasonable. Through with guilt and regret and abuse. She already had a line on another job, although she would’ve enjoyed taking the summer off.\u003c/p\u003e\n\u003cp\u003eUnfortunately, she couldn’t afford it. As it was, she only had two months’ budget in her savings account, and it had taken her a year to accumulate that much. She called it her “attitude money.” It was a whole lot easier to walk away from her position at the agency, knowing she had some cash to fall back on if she didn’t get a job right away.\u003c/p\u003e\n\u003cp\u003e“How about dessert?” Jason suggested after the waitress had taken their dinner dishes away.\u003c/p\u003e\n\u003cp\u003eShe shook her head. “No, thanks. I’m stuffed.”\u003c/p\u003e\n\u003cp\u003eHe looked disappointed at her response.\u003c/p\u003e\n\u003cp\u003e“You go ahead, though,” she urged.\u003c/p\u003e\n\u003cp\u003eJason immediately rejected the idea, proving her initial impression wrong. But if he wasn’t craving dessert, what did he want? He seemed restless, yet obviously wasn’t inclined to leave.\u003c/p\u003e\n\u003cp\u003eWhatever was bothering Jason wasn’t trivial, Charlotte realized. Jason Manning wasn’t a man easily unnerved. She wondered if it was something she’d done, something she’d said. She didn’t know what to make of his behavior. Throughout dinner, she’d considered various explanations, none of which seemed all that logical.\u003c/p\u003e\n\u003cp\u003eThe silence between them lingered as they sipped their after-dinner coffee. From the moment he’d picked her up, she’d been surprised that Jason was wearing a suit, the same attractive gray one he’d had on the night of the dance. His brother’s suit. She knew very well that he didn’t dress formally unless it was some important occasion. His entire wardrobe consisted of jeans and T-shirts.\u003c/p\u003e\n\u003cp\u003eHe hated wearing a suit. Five minutes after they’d arrived at the dance, he’d loosened his tie, and had completely discarded it by the end of the evening. Why he’d worn one this evening remained a mystery.\u003c/p\u003e\n\u003cp\u003eCharlotte frowned, trying to analyze what was wrong. Waiting for Jason to tell her was making her nervous. He looked miserable, which made her increasingly miserable.\u003c/p\u003e\n\u003cp\u003eShe felt close to Jason, closer than she’d felt to any man since Tom. She hadn’t meant that to happen, and she didn’t think Jason had, either. Their relationship had grown steadily more intense in the past weeks. She’d fallen in love—it was that simple—and thought he had, too.\u003c/p\u003e\n\u003cp\u003eBut perhaps falling in love wasn’t what Jason wanted. Perhaps he was trying to find a way to tell her they were in too deep, that he wanted out.\u003c/p\u003e\n\u003cp\u003eIt made sense.\u003c/p\u003e\n\u003cp\u003eThe fancy dinner, the hesitation and even regret. The fact that his eyes kept avoiding hers. The silence. That was the worst. The awkward silence, as though he couldn’t bear to speak those final words.\u003c/p\u003e\n\u003cp\u003e“I’m ready to leave, if you are,” she said with false enthusiasm.\u003c/p\u003e\n\u003cp\u003eHe looked over at her, his expression uncertain. Perhaps he planned to tell her in the restaurant, in order to avoid a scene. She’d heard that was a popular tactic. All Charlotte wanted to do was leave, before she made a fool of herself by breaking into tears.\u003c/p\u003e\n\u003cp\u003eHe was going to break up with her; she was sure of it. A hundred explanations crowded her mind. They’d gotten too close, too fast. It wasn’t as if she was…unencumbered. True, she was single, but she had a child, and if a man was going to get serious with a woman, he’d prefer that she didn’t bring along excess baggage. That was common knowledge. She’d heard it often enough from friends and acquaintances.\u003c/p\u003e\n\u003cp\u003eJason’s parents might have disapproved of her, too. It wasn’t as if she came from a fine, upstanding family. His mother had asked her a number of questions Saturday morning about her parents and grandparents. Charlotte had found it difficult to explain that she had no idea where her father was, or even if he was still alive. Neither of the elder Mannings had seemed to disapprove of her openly. If anything, they’d been warm and gracious. But although they might have accepted her, even liked her, they might also think she was the wrong kind of woman for their son.\u003c/p\u003e\n\u003cp\u003eJason paid the bill while Charlotte excused herself for a visit to the ladies’ room, hoping to regain her composure.\u003c/p\u003e\n\u003cp\u003eHe was waiting for her by the door when she returned.\u003c/p\u003e\n\u003cp\u003eSilence accompanied them into the parking lot.\u003c/p\u003e\n\u003cp\u003eJason opened her door. By the time he’d walked around the front of his car, Charlotte’s hold on her poise was tenuous. When he glanced in her direction, though, she managed a smile. Her pride demanded it.\u003c/p\u003e\n\u003cp\u003eCharlotte expected Jason to drive her directly to the apartment, since he hadn’t been able to break the news to her at the restaurant. At least when he delivered the blow, it would be in the comfort of familiar surroundings.\u003c/p\u003e\n\u003cp\u003eBut he drove to a deserted stretch of beach, then pulled off the road, climbed out of the car and came around to her side.\u003c/p\u003e\n\u003cp\u003e“It’s late,” she said, frowning at her watch. “I should be getting home. Carrie’s by herself.”\u003c/p\u003e\n\u003cp\u003e“In a minute.” He wore a pensive frown, the same expression she’d seen all evening.\u003c/p\u003e\n\u003cp\u003eShe gazed past him to the shoreline. Small breakers rolled onto the sand, their motion soothing. Charlotte wasn’t soothed, however, and she looked away to the wide expanse of darkening sky. The scent of the sea hung in the air.\u003c/p\u003e\n\u003cp\u003e“Just say it,” she muttered. Her patience had evaporated and she couldn’t bear the painful silence anymore.\u003c/p\u003e\n\u003cp\u003e“You know?”\u003c/p\u003e\n\u003cp\u003e“Of course I know.” She walked onto the sand, removed her shoes and purposefully forged ahead, stopping at a thick log that was charred at one end.\u003c/p\u003e\n\u003cp\u003eSwallowing a mouthful of self-pity, she looked over her shoulder to discover that Jason had followed her onto the beach. She almost wished he’d driven away, left her behind. It would’ve been easier that way.\u003c/p\u003e\n\u003cp\u003eHer legs didn’t feel as if they’d support her much longer, so she sat on the log and stared sightlessly out at the horizon, waiting for him to begin his litany of excuses and stumbling explanations.\u003c/p\u003e\n\u003cp\u003e“Charlotte…I’m not very good at this sort of thing.”\u003c/p\u003e\n\u003cp\u003e“Who is? Listen, it’s been great.” She strove to sound flippant and knew she’d failed. She lowered her gaze to her hands, forcing herself to continue. “I’ll always be grateful for this time with you.” Tears rolled down her cheeks and she brushed them aside, not daring to look at Jason. “But as we both know, all good things must come to an end….”\u003c/p\u003e\n\u003cp\u003eJason said nothing. Not one word, and that made everything even more difficult.\u003c/p\u003e\n\u003cp\u003eHis hands were buried in his pants pockets and when she glanced up at his face, she saw that his jaw was tightly clenched. She didn’t understand his anger, not when she’d made it so easy for him.\u003c/p\u003e\n\u003cp\u003e“So you had me sit through that whole miserable dinner,” he said with barely controlled antagonism. “Did you enjoy watching me squirm?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-22.html","bookId":1982,"creation":"Oct 5, 2019 10:26:50 AM","modification":"Oct 5, 2019 10:26:50 AM"}
