{"id":73041,"no":34,"title":"Page 34","content":"\u003cp\u003eShe nodded. “Hours ago.”\u003c/p\u003e\n\u003cp\u003e“Me, too.”\u003c/p\u003e\n\u003cp\u003e“If you’re ready, we can be on our way.” All he had to do now was stop staring at her….\u003c/p\u003e\n\u003cp\u003eA few minutes later, the valet took his ticket for his rental car, and they waited for him to drive the luxury sedan to the back of the hotel. When the car arrived, the young man opened the car door and helped Summer inside. James was almost jealous to have been denied the privilege.\u003c/p\u003e\n\u003cp\u003eThey drove out of Las Vegas in companionable silence. James had studied the map so he knew which freeway to take.\u003c/p\u003e\n\u003cp\u003e“Do you ever think about her?” Summer asked.\u003c/p\u003e\n\u003cp\u003eJames had no idea what she was talking about. “Who?”\u003c/p\u003e\n\u003cp\u003eShe laughed. “That’s answer enough. Christy. Your ex-fiancée.”\u003c/p\u003e\n\u003cp\u003e“Ah yes, Christy.” James mulled over Summer’s question. “Sometimes. Generally when I’m feeling especially lonely or when I see a couple with kids. That’s when I wonder what Christy’s and my children would have looked like.\u003c/p\u003e\n\u003cp\u003e“Do you still think about Brett?” he asked.\u003c/p\u003e\n\u003cp\u003eShe lifted one shoulder in a halfhearted shrug. “Sometimes. It’s different with me, though.”\u003c/p\u003e\n\u003cp\u003e“Different?”\u003c/p\u003e\n\u003cp\u003e“From what you told me about Christy, she went to Montana to help her sister and met someone there.”\u003c/p\u003e\n\u003cp\u003e“She would’ve broken the engagement right away, but it seemed like a heartless thing to do over the phone.” Despite everything James felt a need to defend her. “When she did get back, her mother had arranged for a huge engagement party and I was extremely busy with an important lawsuit. I never blamed Christy for not telling me about Cody right away. She had her reasons.”\u003c/p\u003e\n\u003cp\u003e“I blame her,” Summer said stiffly. “It was a rotten thing to do.”\u003c/p\u003e\n\u003cp\u003e“You blame Brett, too, don’t you?” This was what their conversation was really about, James suspected. Something had happened recently that had hurt her all over again.\u003c/p\u003e\n\u003cp\u003e“Right before I left,” she said in a small voice, “a friend called to tell me Brett and his wife are expecting a baby.”\u003c/p\u003e\n\u003cp\u003e“A friend?” James wondered about that. There seemed to be a certain type of person who delighted in being the first to deliver bad news.\u003c/p\u003e\n\u003cp\u003e“I’m going to be twenty-eight next month,” she told him.\u003c/p\u003e\n\u003cp\u003eHe smiled. “From the way you said that, one would think you’re ready to apply for your retirement benefits.”\u003c/p\u003e\n\u003cp\u003eSummer smiled back. “I suppose I sound ridiculous.”\u003c/p\u003e\n\u003cp\u003e“No, you sound hurt. It’s only natural, but that pain will fade in time, as well, especially if you meet someone else and get involved in another relationship.”\u003c/p\u003e\n\u003cp\u003e“You didn’t.”\u003c/p\u003e\n\u003cp\u003eJames couldn’t argue. “It wasn’t because I’d dedicated myself to loving Christy for the rest of my life. To be fair, I’m not sure why I never got involved again. It’s not like I made the decision not to.”\u003c/p\u003e\n\u003cp\u003e“Do you date?”\u003c/p\u003e\n\u003cp\u003e“Occasionally.” A few months ago, two women had let him know that they’d welcome his attentions. James was flattered and he did enjoy a night out now and then, but he could never seem to dredge up much enthusiasm for either woman.\u003c/p\u003e\n\u003cp\u003e“What about you?” he asked, then mentally kicked himself. The answer was obvious. Someone like Summer had a long line of men waiting to ask her out.\u003c/p\u003e\n\u003cp\u003e“I don’t date all that often,” Summer surprised him by saying. “It’s funny, when Brett and I first broke up I saw a different man every night. Within a month I was sick of it, sick of pretending I didn’t care, sick of telling everyone about all the fun I was having.”\u003c/p\u003e\n\u003cp\u003e“And now?”\u003c/p\u003e\n\u003cp\u003e“I haven’t been out all month. December is crazy, anyway, with Christmas and family obligations and everything else. In November, I went to a dinner party with a member of the cast, but it was as friends, and it was more a favor to Steve than anything.”\u003c/p\u003e\n\u003cp\u003eSilly as it seemed, James was offended that she didn’t count their dinner the night before as a date. He certainly had. Their time together had been the highlight of the year for him.\u003c/p\u003e\n\u003cp\u003e“My parents want me married,” she murmured thoughtfully. “They hinted at it over Christmas.”\u003c/p\u003e\n\u003cp\u003eNow, that was something James could identify with. “My father’s a longtime widower and I don’t have any siblings. He’s been hounding me for years to marry, but his real interest lies in grandchildren.”\u003c/p\u003e\n\u003cp\u003e“I’m not willing to marry just anyone,” she insisted.\u003c/p\u003e\n\u003cp\u003e“I feel the same way.”\u003c/p\u003e\n\u003cp\u003eThey glanced at each other and then immediately looked away. Silence again filled the car. James didn’t know what Summer was thinking, but he knew where his thoughts were taking him and it spelled trouble.\u003c/p\u003e\n\u003cp\u003eAs they neared the outskirts of Boulder City, James mentioned some of the local facts he’d read. “This is the only city in Nevada that doesn’t allow gambling.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“It was built for the men who worked on the construction of the dam. I’d guess it has something to do with making sure the workers wouldn’t squander their hard-earned cash on the gaming tables. If that happened, their families would see none of it.”\u003c/p\u003e\n\u003cp\u003e“I wonder if it helped,” Summer mused aloud.\u003c/p\u003e\n\u003cp\u003eThe next hour and a half was spent driving over Hoover Dam. They didn’t take the tour. The day was windy, and James was afraid Summer’s sweater wouldn’t be enough protection against the cold.\u003c/p\u003e\n\u003cp\u003eOnce they were back on the Nevada side, they stopped long enough for pictures. James felt the wind as he took several scenic photos of the dam with the digital camera he’d bought last year.\u003c/p\u003e\n\u003cp\u003eFar more of his shots were aimed at Summer. She was a natural ham and struck a variety of poses for him. He wanted a keepsake of his time with her.\u003c/p\u003e\n\u003cp\u003eJames asked another tourist to get a picture of the two of them together. He placed his arm around her shoulder and smiled into the camera.\u003c/p\u003e\n\u003cp\u003e“Can you send them to me?” she asked, rubbing her arms in an effort to warm herself.\u003c/p\u003e\n\u003cp\u003e“Of course,” James agreed, pleased that she’d asked.\u003c/p\u003e\n\u003cp\u003eHe turned up the heater when they returned to the car. He noticed that Summer’s eyes were drooping about ten miles outside Boulder City. He located a classical-music station on the radio, and the soft strains of Mozart lulled her to sleep.\u003c/p\u003e\n\u003cp\u003eShe woke when they were on the Las Vegas freeway. Startled, she sat up and looked around. “Wow, I must be stimulating company,” she said, and smiled.\u003c/p\u003e\n\u003cp\u003e“I’m accustomed to quiet. Don’t worry about it.”\u003c/p\u003e\n\u003cp\u003e“James,” she began, then yawned, covering her mouth. “What do you think of women who ask men out on dates?”\u003c/p\u003e\n\u003cp\u003e“What do I think?” He repeated her question, never having given the subject much thought. “Well, it seems fine in theory but I can’t really say since it’s never happened to me.”\u003c/p\u003e\n\u003cp\u003e“Do you view them as aggressive?”\u003c/p\u003e\n\u003cp\u003e“Not necessarily. I know women invite men out all the time these days.”\u003c/p\u003e\n\u003cp\u003eShe smiled, and her eyes fairly danced with excitement. “I’m glad to hear you say so, because I bought two tickets to a magic show. It’s this evening at one of the other downtown hotels. I’d enjoy it very much if you went with me.”\u003c/p\u003e\n\u003cp\u003eJames had walked into that one with his eyes wide-open. “A magic show,” he murmured with pleasure. He hadn’t even dropped her off at the hotel yet and already he was looking for an excuse to see her again.\u003c/p\u003e\n\u003cp\u003e“It’s the late show, as it happens, which doesn’t start until eleven. You’ll come with me, won’t you?”\u003c/p\u003e\n\u003cp\u003e“Of course,” he said. If he wasn’t driving, James would have pumped his fist in the air.\u003c/p\u003e\n\u003cp\u003eAlthough she’d spent nearly the entire day with James, including lunch and a light dinner on the road, Summer counted the hours until they met for the magic show. She was dressing when the phone rang.\u003c/p\u003e\n\u003cp\u003e“Hello,” she said, thinking it could only be James. Her heart began to beat faster.\u003c/p\u003e\n\u003cp\u003e“Summer, it’s Julie.”\u003c/p\u003e\n\u003cp\u003e“Julie!” Summer had tried to call her friend earlier that evening, but she hadn’t answered either her cell or the apartment phone. “Happy New Year!”\u003c/p\u003e\n\u003cp\u003e“Same to you. How’s it going with the distinguished attorney?”\u003c/p\u003e\n\u003cp\u003eSummer sank onto the edge of the bed. “Really well. By the way, he’s a superior court judge now.”\u003c/p\u003e\n\u003cp\u003e“Wow. That’s great. So you’re getting along well,” her friend echoed in knowing tones. “Do you still see him as a father figure?”\u003c/p\u003e\n\u003cp\u003e“No way,” Summer said, and laughed. “There’s less than ten years between us.”\u003c/p\u003e\n\u003cp\u003e“So.” Her friend’s voice fell. “Tell me what’s been happening.”\u003c/p\u003e\n\u003cp\u003e“Well.” Summer wasn’t sure where to start, then decided to plunge right in. “He kissed me last night, and Julie, it was incredible. I don’t ever remember feeling like this in my life.”\u003c/p\u003e\n\u003cp\u003e“So you’d say there’s electricity between you?”\u003c/p\u003e\n\u003cp\u003eThat was putting it mildly. Hoover Dam should produce that much electricity. “You could put it that way.”\u003c/p\u003e\n\u003cp\u003e“This is just great!”\u003c/p\u003e\n\u003cp\u003e“We went to see Hoover Dam this morning, and tonight we’re going to a magic show.”\u003c/p\u003e\n\u003cp\u003e“This sounds promising.”\u003c/p\u003e\n\u003cp\u003eThat was how it felt to Summer, as well. “James invited me to drive to Red Rock Canyon with him tomorrow to feed the burros.”\u003c/p\u003e\n\u003cp\u003e“Are you?”\u003c/p\u003e\n\u003cp\u003e“Of course.” It had never occurred to Summer to refuse. She didn’t care if he asked her to study goat dung; she would gladly have gone along just to be with him.\u003c/p\u003e\n\u003cp\u003e“Julie…”\u003c/p\u003e\n\u003cp\u003e“Yeah?”\u003c/p\u003e\n\u003cp\u003e“Would you laugh at me if I told you I’m falling in love with this guy?”\u003c/p\u003e\n\u003cp\u003e“Nope. I’ve seen it coming for months. You pored over his letters, and for days after you got one, it was James this and James that. I’m not the least bit surprised. This guy must really be something.”\u003c/p\u003e\n\u003cp\u003eSummer’s heart sank as she confronted the facts. “He’s a judge, Julie. A superior court judge. I’m an actress. We’re too different. I live in Anaheim and he’s in Seattle. Oh, it’s fine here in Vegas, but once we leave, everything will go back to the way it was before.”\u003c/p\u003e\n\u003cp\u003e“You don’t want that?”\u003c/p\u003e\n\u003cp\u003e“No,” Summer admitted after some hesitation.\u003c/p\u003e\n\u003cp\u003e“Then you need to ask yourself exactly what it is you do want,” Julie said.\u003c/p\u003e\n\u003cp\u003eHer roommate’s words rang in her mind all through the magician’s performance. Summer sat beside James and was far more aware of him than the talented performer onstage. There was magic in the air, all right. It sizzled and sparked, but it didn’t have a thing to do with what was happening onstage.\u003c/p\u003e\n\u003cp\u003eAfter the show, James escorted her to his car, which was parked in a lot outside the casino.\u003c/p\u003e\n\u003cp\u003e“You’ve been quiet this evening,” James commented.\u003c/p\u003e\n\u003cp\u003e“I talked to my roommate earlier,” she told him when he slid into the driver’s seat.\u003c/p\u003e\n\u003cp\u003e“Does it have something to do with Brett?”\u003c/p\u003e\n\u003cp\u003e“No,” she said, shaking her head for emphasis. When James inserted the key to start the car, she placed her hand on his forearm to stop him. “James,” she said softly, “I know this is an unusual request, and I’m sorry if it embarrasses you, but would you mind kissing me again?” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-34.html","bookId":1982,"creation":"Oct 5, 2019 10:26:50 AM","modification":"Oct 5, 2019 10:26:50 AM"}
