{"id":73045,"no":38,"title":"Page 38","content":"\u003cp\u003e“Not lobster? It isn’t every day one becomes engaged. I think we should celebrate, don’t you?”\u003c/p\u003e\n\u003cp\u003eSomehow she managed a nod.\u003c/p\u003e\n\u003cp\u003eThe waiter came, and James ordered for them both, requesting lobster and champagne. Their server nodded approvingly and disappeared. A moment later he returned with a champagne bottle for James’s inspection.\u003c/p\u003e\n\u003cp\u003e“We’ll need to see about an engagement ring,” James said as though they were discussing something as mundane as the weather. “I imagine Las Vegas has quite a few good jewelers.”\u003c/p\u003e\n\u003cp\u003eThe waiter opened the champagne bottle with a loud pop and poured a small amount into the fluted glass for James to sample. He tasted it and nodded. Soon both their glasses were filled.\u003c/p\u003e\n\u003cp\u003eSummer breathed easier once they were alone. “James,” she whispered, leaning forward. “Are you sure you want to marry me?”\u003c/p\u003e\n\u003cp\u003eHe leaned toward her, too, and a grin slowly formed. “Yes.”\u003c/p\u003e\n\u003cp\u003e“All at once I’m not convinced I’m the right person for you.”\u003c/p\u003e\n\u003cp\u003e“Shouldn’t I be the one to decide that?”\u003c/p\u003e\n\u003cp\u003e“Yes, but…I’d hate to think we’re reacting to circumstances that wouldn’t repeat themselves in a hundred years.”\u003c/p\u003e\n\u003cp\u003e“Then we’ll have a long engagement. We’ll both be positive before we take that final step.”\u003c/p\u003e\n\u003cp\u003e“All right.” Summer felt only mildly reassured.\u003c/p\u003e\n\u003cp\u003e“We’ll continue to see each other on a regular basis,” James told her.\u003c/p\u003e\n\u003cp\u003e“Yes…we’ll need that.” She didn’t like the idea of being apart so much, but that couldn’t be helped.\u003c/p\u003e\n\u003cp\u003e“I wouldn’t want the engagement to be too long,” Summer said. “I dated Brett for five years, and we were unofficially and then officially engaged almost that whole time. We both know where that ended up.”\u003c/p\u003e\n\u003cp\u003e“Do you wish you’d married him?”\u003c/p\u003e\n\u003cp\u003e“No,” she answered emphatically. “I don’t have a single regret. I know you’d never do the things Brett did.”\u003c/p\u003e\n\u003cp\u003eJames’s eyes brightened with intensity. “It isn’t in me to hurt you.”\u003c/p\u003e\n\u003cp\u003e“And I’d never knowingly hurt you,” she promised.\u003c/p\u003e\n\u003cp\u003e“In light of what happened between Christy and me, I’m not fond of long engagements, either.”\u003c/p\u003e\n\u003cp\u003e“Do you regret not marrying her sooner? That way she would’ve gone to visit her sister as a married woman.”\u003c/p\u003e\n\u003cp\u003e“I’ve thought about that,” James said. “Christy would never have allowed anything to develop between her and Cody if we’d been married. Getting involved with him behind my back was almost more than she could bear.”\u003c/p\u003e\n\u003cp\u003e“I see.” Summer figured she could read the writing on the wall. “You wish you’d married her, don’t you?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eHis quick response surprised her. “Why not?”\u003c/p\u003e\n\u003cp\u003e“Christy Manning didn’t love me as much as I loved her. I’m sure she would have done her best to be a good wife, and we probably would have grown close over the years, but she would’ve married me for the wrong reasons.”\u003c/p\u003e\n\u003cp\u003e“The wrong reasons? What reasons?”\u003c/p\u003e\n\u003cp\u003e“She was trying to make her parents happy.”\u003c/p\u003e\n\u003cp\u003e“Okay,” Summer said slowly, still feeling her way carefully around the subject. “So neither of us wants a long engagement. How long is long? A year?”\u003c/p\u003e\n\u003cp\u003e“That’s too long,” James said with feeling.\u003c/p\u003e\n\u003cp\u003e“Six months?”\u003c/p\u003e\n\u003cp\u003eHe hesitated. “That’ll make it June.”\u003c/p\u003e\n\u003cp\u003e“June’s a nice month,” Summer said without any real enthusiasm. “Will you want me to live with you in Seattle?”\u003c/p\u003e\n\u003cp\u003e“Yes. Is that going to be possible?”\u003c/p\u003e\n\u003cp\u003e“Of course.” She nodded vigorously.\u003c/p\u003e\n\u003cp\u003e“What about your career?”\u003c/p\u003e\n\u003cp\u003eShe lifted one shoulder. “To tell you the truth, I was getting a little tired of playing Belle anyway. From what I understand, theater in Seattle is thriving. There wouldn’t be any problem with me being your wife and an actress, would there? You being a judge and all.”\u003c/p\u003e\n\u003cp\u003e“None that I can think of.”\u003c/p\u003e\n\u003cp\u003e“Good.” Summer picked up her fork and ran her fingers along the smooth tines. “My current contract expires in April.”\u003c/p\u003e\n\u003cp\u003e“April,” James said. “Can you arrange a wedding on such short notice?”\u003c/p\u003e\n\u003cp\u003e“You bet I can,” she said, grinning. “Oh, James, I can’t believe this is happening.”\u003c/p\u003e\n\u003cp\u003e“To be honest, neither can I,” he admitted.\u003c/p\u003e\n\u003cp\u003eSummer had never seen him smile as brightly.\u003c/p\u003e\n\u003cp\u003eThe waiter brought their dinner, and James looked at the man who was a complete stranger and said, “The young lady and I have just become engaged.”\u003c/p\u003e\n\u003cp\u003eTheir server smiled broadly. “Congratulations.”\u003c/p\u003e\n\u003cp\u003e“Thank you.”\u003c/p\u003e\n\u003cp\u003eSummer would have added her thanks, but James had shocked her speechless. He wasn’t joking; he really meant to follow through with their wedding and he was excited about it. Excited enough to announce their plans to a stranger.\u003c/p\u003e\n\u003cp\u003e“This hotel has an excellent wedding chapel,” the waiter continued. “I gather that more than one celebrity has been married in our chapel.”\u003c/p\u003e\n\u003cp\u003e“Right here in the hotel?” James asked.\u003c/p\u003e\n\u003cp\u003e“Many of the larger hotels provide wedding services for their guests.”\u003c/p\u003e\n\u003cp\u003e“Don’t arrangements have to be made weeks in advance?”\u003c/p\u003e\n\u003cp\u003e“Not always,” the waiter explained. “A lot of people don’t decide which chapel to use until after they arrive. Apparently you can get married with a few hours’ notice—if the chapel’s available, of course.”\u003c/p\u003e\n\u003cp\u003e“Of course,” James murmured.\u003c/p\u003e\n\u003cp\u003eA look came over him, one she’d seen before. “Our wedding will be in April,” she said hastily.\u003c/p\u003e\n\u003cp\u003e“My very best to both of you.” The waiter refilled their flutes with champagne.\u003c/p\u003e\n\u003cp\u003e“James,” Summer said after the server had left their table, “is something wrong?”\u003c/p\u003e\n\u003cp\u003e“Nothing. What makes you ask?”\u003c/p\u003e\n\u003cp\u003e“You’re wearing an odd look.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?”\u003c/p\u003e\n\u003cp\u003e“It’s a look that says you’re not sure you like what you’re thinking. Or hearing or seeing. The same one you got when I said we had company in Red Rock Canyon the other day.”\u003c/p\u003e\n\u003cp\u003e“In this case, it’s what I’m thinking,” he muttered\u003c/p\u003e\n\u003cp\u003e“You want to call off the wedding?” She should’ve realized that when James said he wanted to marry her, it was too good to be true. This had to be the shortest engagement in history.\u003c/p\u003e\n\u003cp\u003e“I don’t know where you get the idea that I’m looking for a way out when I’m thinking exactly the opposite. I can only assume impulsive thoughts must be transmitted from one brain to another.” He drew in a deep breath and seemed to hold it for a long time. “Would you be willing to marry me now?”\u003c/p\u003e\n\u003cp\u003e“Now? You mean tomorrow?”\u003c/p\u003e\n\u003cp\u003e“Yes. Then we’ll repeat the ceremony later with family and friends in April.”\u003c/p\u003e\n\u003cp\u003eSpeechlessness happened rarely with Summer, and yet James had managed to cause it twice in the same evening. Her mouth dropped open, but no words came out.\u003c/p\u003e\n\u003cp\u003e“Summer, have I utterly shocked you?”\u003c/p\u003e\n\u003cp\u003e“Yes,” she admitted in a squeaky voice.\u003c/p\u003e\n\u003cp\u003eJames grinned. “I’ll admit this is the first impulsive thought I’ve entertained in years. If you can propose marriage at the drop of a hat, then I should be able to come up with something equally thrilling.”\u003c/p\u003e\n\u003cp\u003eSummer knew she was going to cry now. She could feel the tears welling up in her eyes. She used her linen napkin to dab them away.\u003c/p\u003e\n\u003cp\u003e“Just remember when we tell the children about this night. You’re the one who proposed to me.”\u003c/p\u003e\n\u003cp\u003e“Children.” Summer blew her nose. “Oh, James, I’m looking forward to being a mother.”\u003c/p\u003e\n\u003cp\u003e“Then you agree to my plan?”\u003c/p\u003e\n\u003cp\u003e“Married twice?” Everything was going too fast for her. “I’d want Julie here as my maid of honor.”\u003c/p\u003e\n\u003cp\u003e“Of course. We’ll phone her as soon as we’re finished dinner. I’ll be happy to pay for her airfare.”\u003c/p\u003e\n\u003cp\u003eThe tears were back, filling her eyes. These were tears of happiness and relief; she loved him so much. “James, we’re doing the right thing, aren’t we?”\u003c/p\u003e\n\u003cp\u003eHe didn’t hesitate. “Yes. It’s what we both want.”\u003c/p\u003e\n\u003cp\u003e“You love me?” He’d never said the words.\u003c/p\u003e\n\u003cp\u003eHis look softened. “Very much.”\u003c/p\u003e\n\u003cp\u003eHer mind whirled with everything they’d need to do. “I’ll have to tell my parents. You didn’t intend to keep our marriage a secret from our families, did you?”\u003c/p\u003e\n\u003cp\u003e“No. I’ll call my father, as well.”\u003c/p\u003e\n\u003cp\u003eAlready Summer could hear her mother’s arguments “They’re going to think we’re crazy.”\u003c/p\u003e\n\u003cp\u003eJames grinned again. “Probably.”\u003c/p\u003e\n\u003cp\u003e“What should we do first?” Summer asked as they left the restaurant after dinner.\u003c/p\u003e\n\u003cp\u003e“I suppose we should find an available wedding chapel.”\u003c/p\u003e\n\u003cp\u003e“Shouldn’t we contact our families before we do that?” This was the part Summer dreaded most, and she wanted it over with as quickly as possible.\u003c/p\u003e\n\u003cp\u003e“But if we have the chapel booked, we’ll be able to tell them the time and place,” James said.\u003c/p\u003e\n\u003cp\u003e“Oh, yes.” Trust him to be so logical even when he was acting impulsive.\u003c/p\u003e\n\u003cp\u003e“The ring.” James snapped his fingers. “I almost forgot.”\u003c/p\u003e\n\u003cp\u003e“Don’t look so concerned. We can pick something out later. A plain gold band is perfect for now. In April we can exchange those for a diamond if you want.”\u003c/p\u003e\n\u003cp\u003e“I’d like you to have my mother’s ring.”\u003c/p\u003e\n\u003cp\u003e“I’d be honored to wear it,” she said quietly.\u003c/p\u003e\n\u003cp\u003eHe kissed her, and Summer blinked in surprise. It was the first time he’d ever initiated a kiss in public.\u003c/p\u003e\n\u003cp\u003eSince the waiter had mentioned the wedding chapel at this particular hotel, they tried there first. Summer hadn’t expected it to be so easy, but booking their wedding took only a few minutes. The hotel would see to everything, from obtaining the license to the music and flowers. They’d be getting married at seven the next night.\u003c/p\u003e\n\u003cp\u003e“If I’d known it was this simple,” James said as they walked back to the Four Queens, “I might have suggested it sooner.”\u003c/p\u003e\n\u003cp\u003eSummer pressed her head against his shoulder. They stopped at a crosswalk and waited for the red light.\u003c/p\u003e\n\u003cp\u003e“I wish you’d kiss me again,” she breathed close to his ear.\u003c/p\u003e\n\u003cp\u003eHis gaze found her lips, and he cleared his throat. “I don’t think that would be a good idea.”\u003c/p\u003e\n\u003cp\u003e“I suppose you’re right,” she murmured, but disappointment underscored her words.\u003c/p\u003e\n\u003cp\u003e“You can call your family from my room.”\u003c/p\u003e\n\u003cp\u003e“Okay,” she said, but her mind wasn’t on making the dreaded phone call as much as it was on being alone with James.\u003c/p\u003e\n\u003cp\u003eHis thoughts must have been the same because their pace quickened as they hurried across the street and into the hotel.\u003c/p\u003e\n\u003cp\u003eThe elevator ride seemed to take an eternity. As if James couldn’t keep himself from touching her in some way, he reached out and brushed a stray curl from her cheek. His knuckle grazed her skin. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-38.html","bookId":1982,"creation":"Oct 5, 2019 10:26:50 AM","modification":"Oct 5, 2019 10:26:50 AM"}
