{"id":73050,"no":43,"title":"Page 43","content":"\u003cp\u003eSummer arrived at her gate and walked over to the window. James could see her plane and knew it wouldn’t be more than a few moments before the boarding call was announced.\u003c/p\u003e\n\u003cp\u003e“I’m sorry, sweetheart.” He rested his hands on her shoulders and closed his eyes.\u003c/p\u003e\n\u003cp\u003e“Me, too.”\u003c/p\u003e\n\u003cp\u003eHe frowned. She’d done nothing wrong. “For what?”\u003c/p\u003e\n\u003cp\u003e“Oh, James,” she whispered brokenly, slipping her arms around his waist. “I’m going to be so lost without you.”\u003c/p\u003e\n\u003cp\u003e“It’s going to be hard.” He wasn’t willing to pretend otherwise. “I’ll phone as often as I can.”\u003c/p\u003e\n\u003cp\u003e“Do you have my work schedule?” she asked.\u003c/p\u003e\n\u003cp\u003e“Yes. Do you have everything you need?” They’d gone over the details a dozen times.\u003c/p\u003e\n\u003cp\u003e“No. I need you, James.”\u003c/p\u003e\n\u003cp\u003eHis hold on her tightened. He wondered if they were afraid they’d lose the magic. Afraid that once they returned to their respective lives, everything would change.\u003c/p\u003e\n\u003cp\u003eHer flight number was announced, and James tensed. It wouldn’t be long before he saw her, he promised himself. He’d try for a week, two at the most. A few minutes later her row was called.\u003c/p\u003e\n\u003cp\u003e“That’s you,” he said reluctantly.\u003c/p\u003e\n\u003cp\u003e“I know.”\u003c/p\u003e\n\u003cp\u003eBut neither of them made a move to break apart.\u003c/p\u003e\n\u003cp\u003eSummer was the last one to board the plane, and James had to tear through the airport in order to catch his own flight. If anyone had suggested even ten days ago that the dignified James Wilkens would race through an airport so he could spend a few extra minutes with a woman, he would have scoffed. He wasn’t scoffing now.\u003c/p\u003e\n\u003cp\u003eHe arrived in the nick of time and collapsed into his seat, his heart racing.\u003c/p\u003e\n\u003cp\u003eBetween dashing through airports and hours spent making love, Summer would be the death of him yet. He smiled as he snapped his seat belt into place. If he was to die that very moment, he’d leave this earth a happy man.\u003c/p\u003e\n\u003cp\u003eJames’s house had never seemed so empty. By the time he got home, it was dark and shadowy. His first mistake had been stopping at the office on his way back from the airport. After he arrived in Seattle, he’d spent what remained of the day working through the memos, briefs and case histories. No one else was in, so he was able to accomplish quite a bit, catching up on some of his backlog. He’d do anything he had to so he could arrange time away as soon as possible.\u003c/p\u003e\n\u003cp\u003eSummer was never far from his thoughts.\u003c/p\u003e\n\u003cp\u003eOnce he reached his house, suitcase in hand, he was exhausted. He switched on the light in the kitchen, put down his bags and set his briefcase on the walnut table in the breakfast nook.\u003c/p\u003e\n\u003cp\u003eHe hadn’t eaten since that morning, and a look inside the refrigerator reminded him he’d been away all week. He’d need to order out or microwave something from the freezer.\u003c/p\u003e\n\u003cp\u003eDeciding against both, he heated a can of soup, ate, then showered. He’d showered that morning, but Summer had been in the stall with him and neither one had seemed particularly concerned about washing.\u003c/p\u003e\n\u003cp\u003eJames stood in front of the mirror in the steamy bathroom and wiped off some of the condensation, then stared at his reflection. He didn’t look all that different from the man he’d been a week ago. But he was different.\u003c/p\u003e\n\u003cp\u003eUnable to delay talking to Summer, he dressed quickly and headed for his book-lined den.\u003c/p\u003e\n\u003cp\u003eHaving memorized her apartment and cell phone numbers, James called her at home.\u003c/p\u003e\n\u003cp\u003eSummer answered on the first ring. “Hello.”\u003c/p\u003e\n\u003cp\u003e“Hello, darling.”\u003c/p\u003e\n\u003cp\u003e“James!”\u003c/p\u003e\n\u003cp\u003e“I would’ve called sooner, but I went to the office. I needed to clear off my desk.”\u003c/p\u003e\n\u003cp\u003e“Did you check your calendar?”\u003c/p\u003e\n\u003cp\u003e“First thing. I can fly down on a Saturday morning in two weeks, but I’ll need to be back Sunday afternoon. That doesn’t give us much time.”\u003c/p\u003e\n\u003cp\u003e“No,” she agreed, “but we’ll make the most of it.” Her relief was evident. “I was afraid once you looked at your schedule you’d find it impossible to get away.”\u003c/p\u003e\n\u003cp\u003e“I don’t care what it takes, I’ll be in California in two weeks.”\u003c/p\u003e\n\u003cp\u003e“Wonderful. I traded weekends with a friend so I can come to you in February. My mother’s already started to plan the wedding. She’s left a message with the secretary at the Moose Hall. It’s a very nice building.”\u003c/p\u003e\n\u003cp\u003e“Your mother’s enjoying every minute of this, isn’t she?”\u003c/p\u003e\n\u003cp\u003eSummer laughed. “Yes. But the one who surprises me most is my dad. I don’t know what you said or did, but my dad thinks you walk on water.”\u003c/p\u003e\n\u003cp\u003eIt was his turn to laugh.\u003c/p\u003e\n\u003cp\u003eThen they were both silent. They’d spent nearly every minute of the previous week together. They’d discussed everything there was to discuss. Yet neither was willing to break the connection.\u003c/p\u003e\n\u003cp\u003eAn hour later they were still on the phone. They hadn’t spoken more than a few words between whispered promises and deep sighs. They’d shared a few secrets and memories, some of them very private. Very intimate…\u003c/p\u003e\n\u003cp\u003eIn their next conversation, he’d let Summer know he couldn’t handle much more of that.\u003c/p\u003e\n\u003cp\u003e“I’ve gotten together with a group of businessmen and spread the word,” Ralph Southworth was saying.\u003c/p\u003e\n\u003cp\u003eJames sat in his office, gazing into the distance. As always, his thoughts were fifteen hundred miles to the south with Summer. He barely heard his campaign manager. In eight days he’d be with his wife. The last six had been the purest form of torture.\u003c/p\u003e\n\u003cp\u003eHe lived for the times he could phone her. Because she performed in the last show of the night, he couldn’t reach her until after ten, and more often than not they spoke until past midnight.\u003c/p\u003e\n\u003cp\u003e“There’s a dinner party this Friday night at the Morrisons’,” Ralph announced.\u003c/p\u003e\n\u003cp\u003eJames didn’t comment.\u003c/p\u003e\n\u003cp\u003e“You’re going, aren’t you?”\u003c/p\u003e\n\u003cp\u003e“You mean to the Morrisons’?”\u003c/p\u003e\n\u003cp\u003eRalph Southworth looked at him oddly. “Who else do you think I mean?”\u003c/p\u003e\n\u003cp\u003eJames shrugged. Ralph was a good man, a bit abrasive at times, but sincere and hardworking. According to people James trusted, Ralph Southworth was the best man for the job of getting James elected to the superior court.\u003c/p\u003e\n\u003cp\u003e“What’s with you lately, James?” Ralph asked abruptly. He pulled out a chair and sat down across from James’s desk.\u003c/p\u003e\n\u003cp\u003eRalph was nothing if not direct. “What makes you ask?”\u003c/p\u003e\n\u003cp\u003e“Something’s not right. Ever since you got back from vacation, you haven’t been the same.”\u003c/p\u003e\n\u003cp\u003eJames considered telling Ralph the truth. Part of him was eager to share the news of his marriage. Marrying Summer was nothing to be ashamed of—the opposite, in fact—but arrangements for the second ceremony were already being made. If he was willing to face the truth, James would have to admit he wasn’t keen on explaining his sudden marriage, especially to the man who’d frowned on his vacation in Vegas. He preferred to leave things as they were and invite Ralph to the wedding in April. So far, he’d told no one about Summer and for the time being even left his wedding band at home.\u003c/p\u003e\n\u003cp\u003e“Have you ever been in love?” he asked, unable to resist.\u003c/p\u003e\n\u003cp\u003eRalph shook his head adamantly. “Never, and proud of it.”\u003c/p\u003e\n\u003cp\u003eJames’s eyebrows shot to his hairline. “I see.”\u003c/p\u003e\n\u003cp\u003e“Women have ruined more than one good man. Don’t be a fool, James. Don’t do anything stupid at this point. Unless it’s with someone who can help you politically, of course. Now, if you told me you were seeing Mary Horton…”\u003c/p\u003e\n\u003cp\u003e“Who?”\u003c/p\u003e\n\u003cp\u003e“Mary Horton—never mind, she’s not your type. All I can say is that if you’re going to fall for someone now, just make sure it’s a woman who can help you politically.”\u003c/p\u003e\n\u003cp\u003e“She can’t.”\u003c/p\u003e\n\u003cp\u003eRalph tossed his hands in the air. “Somehow, I knew you were going to say that. Listen. Keep your head screwed on tight and your pants zipped up. The last thing we need now is a scandal, understand?”\u003c/p\u003e\n\u003cp\u003e“Of course. Summer’s not like—”\u003c/p\u003e\n\u003cp\u003e“Her name is Summer?” Ralph rolled his eyes expressively. “James, listen to me. You’ve asked me to run your campaign, and I’m glad to do it, but I’m telling you right now, getting involved with a woman named Summer is asking for trouble.”\u003c/p\u003e\n\u003cp\u003e“Don’t you think you’re being unfair?”\u003c/p\u003e\n\u003cp\u003e“No. Where’d you meet her?”\u003c/p\u003e\n\u003cp\u003e“Vegas.”\u003c/p\u003e\n\u003cp\u003eRalph’s mouth thinned. “Don’t tell me she’s a show girl,” he muttered.\u003c/p\u003e\n\u003cp\u003e“No—but she’s an actress.”\u003c/p\u003e\n\u003cp\u003eA muscle leapt in his friend’s jaw. “Don’t say anything more. Not a single word. I’ve got high blood pressure and don’t want to know any more than you’ve already told me.”\u003c/p\u003e\n\u003cp\u003e“Summer has nothing to do with you,” James said, finding it difficult to quell his irritation. Ralph made Summer sound like…like a mistake.\u003c/p\u003e\n\u003cp\u003e“Don’t you remember a certain congressman who got involved with a stripper a few years back?”\u003c/p\u003e\n\u003cp\u003e“Summer isn’t a stripper!”\u003c/p\u003e\n\u003cp\u003e“It ruined him, James. Ruined him. I don’t want the same thing to happen to you.”\u003c/p\u003e\n\u003cp\u003e“It won’t. Furthermore, I won’t have you speaking about her in those terms.” In light of Ralph’s reaction, James didn’t think now was the time to announce they were already married. “If you must know, I intend to marry her.”\u003c/p\u003e\n\u003cp\u003e“Great. Do it after the election.”\u003c/p\u003e\n\u003cp\u003e“We’ve decided on April.”\u003c/p\u003e\n\u003cp\u003e“April!” Ralph barked. “That’s much too soon. Listen, you’re paying me big money to run this campaign. You want my advice, you’ve got it. What difference would a few months make?” He paused, waiting for James’s response. “Will you do that one thing?”\u003c/p\u003e\n\u003cp\u003e“I don’t know.”\u003c/p\u003e\n\u003cp\u003e“Are you afraid you’ll lose her?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003e“Then put off the wedding until after the election. Is that so much to ask?”\u003c/p\u003e\n\u003cp\u003e“I’m not sure which is worse,” Julie said, applying bright red polish to her toenails, “this year or last.”\u003c/p\u003e\n\u003cp\u003e“What do you mean?” Summer asked.\u003c/p\u003e\n\u003cp\u003e“You.” She swirled the brush in the red paint and started with the little toe on her left foot. “Last year, after you broke up with Brett, you moped around the apartment for months.”\u003c/p\u003e\n\u003cp\u003eSummer laughed. “This year isn’t much better, is it?”\u003c/p\u003e\n\u003cp\u003e“Not that I can see. Listen, I understand how much you miss James. The guy’s hot. No wonder you fell for him. If the situation was reversed, you can bet I’d be just as miserable. The thing is, you won’t be apart for long. April’s right around the corner.”\u003c/p\u003e\n\u003cp\u003eSummer folded her arms and leaned against the back of the sofa. “I didn’t know it was possible to love someone as much as I love James.”\u003c/p\u003e\n\u003cp\u003e“If the number of times he calls you is any indication, I’d say he feels the same about you.”\u003c/p\u003e\n\u003cp\u003e“He works so hard.” Summer knew that many of James’s late-night calls came from his office. She also knew he was putting in extra-long hours in order to free up time he could spend with her. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-43.html","bookId":1982,"creation":"Oct 5, 2019 10:26:50 AM","modification":"Oct 5, 2019 10:26:50 AM"}
