{"id":73055,"no":48,"title":"Page 48","content":"\u003cp\u003e“Good evening to you, too,” James said evenly.\u003c/p\u003e\n\u003cp\u003eRalph rammed all ten fingers through his hair. “Don’t you listen to your messages? I’ve left no fewer than five, and you haven’t bothered to return one.”\u003c/p\u003e\n\u003cp\u003e“Sit down,” James said calmly. “Do you want a drink?”\u003c/p\u003e\n\u003cp\u003eRalph’s eyes narrowed as he studied James’s face. “Am I going to need it?”\u003c/p\u003e\n\u003cp\u003e“That depends.” James pointed to the recliner by the large brick fireplace. He’d tell Ralph the truth because it was necessary and, knowing his campaign manager’s feelings about Summer, he suspected Ralph would need a stiff drink. “Make yourself at home.”\u003c/p\u003e\n\u003cp\u003eInstead, Ralph followed him into the kitchen. “I got no less than ten phone calls this afternoon asking about your black eye. You can’t show up and then say nothing about it.”\u003c/p\u003e\n\u003cp\u003e“I can’t?” This was news to James, since he’d done exactly that. “I thought you were here to discuss business.”\u003c/p\u003e\n\u003cp\u003e“I am.” Ralph frowned when James brought an unopened bottle of top-shelf bourbon out of a cabinet. “So I’m going to need that.”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“I met with the League of Women Voters and I’ve arranged for you to speak at their luncheon in July. It’s a real coup, James, and I hope you appreciate my efforts.”\u003c/p\u003e\n\u003cp\u003e“Yes,” he murmured. “Thanks.”\u003c/p\u003e\n\u003cp\u003e“Now tell me about the eye. And the bruises.”\u003c/p\u003e\n\u003cp\u003e“All right,” James said, adding two ice cubes to the glass. He half filled it with bourbon and handed it to his friend. “I got hit in the face with a fist more than once.”\u003c/p\u003e\n\u003cp\u003e“Whose fist?”\u003c/p\u003e\n\u003cp\u003e“Some beach bum by the name of Brett. I don’t remember his last name if I ever heard it.”\u003c/p\u003e\n\u003cp\u003eRalph swallowed his first sip of liquor. “Does the beach bum have anything to do with the woman you mentioned?”\u003c/p\u003e\n\u003cp\u003e“Yeah.”\u003c/p\u003e\n\u003cp\u003eThe two men stared across the kitchen at each other.\u003c/p\u003e\n\u003cp\u003e“Were the police called?” Ralph demanded.\u003c/p\u003e\n\u003cp\u003eIt took James a moment to own up to the truth. “Yes.”\u003c/p\u003e\n\u003cp\u003eRalph slammed his hand against the counter. “I should’ve known! James, what did I tell you? A woman’s nothing but trouble. Mark my words, if you get involved any further with Spring…”\u003c/p\u003e\n\u003cp\u003e“Summer!”\u003c/p\u003e\n\u003cp\u003e“Whatever. It doesn’t matter, because her name spells just one thing. Trouble. You’ve worked all your life for this opportunity. This is your one shot at the bench. We both know it. You asked me to manage your campaign and I agreed, but I thought it would be a team effort. The two of us.”\u003c/p\u003e\n\u003cp\u003e“It is.” James wanted to hold on to his seat on the bench more than he’d ever wanted anything—other than to marry Summer. He also felt he was the best man for the position. To get this close and lose it all would be agonizing.\u003c/p\u003e\n\u003cp\u003e“Then why,” Ralph asked, palms out, “are you sabotaging your own campaign?”\u003c/p\u003e\n\u003cp\u003e“I’m not doing it on purpose.”\u003c/p\u003e\n\u003cp\u003e“Stay away from this woman!”\u003c/p\u003e\n\u003cp\u003e“Ralph, I can’t. I won’t.”\u003c/p\u003e\n\u003cp\u003eRalph rubbed his face with both hands, clearly frustrated.\u003c/p\u003e\n\u003cp\u003e“Summer’s in California, but I plan on bringing her to Seattle as soon as I can arrange it. Probably April.”\u003c/p\u003e\n\u003cp\u003e“Tell me you’re joking.”\u003c/p\u003e\n\u003cp\u003e“I’m not.” James figured he should admit the truth now and be done with it. “We’re married.”\u003c/p\u003e\n\u003cp\u003e“What?” Ralph pulled out a chair and sank into it. “When?”\u003c/p\u003e\n\u003cp\u003e“Over New Year’s.”\u003c/p\u003e\n\u003cp\u003e“Why?”\u003c/p\u003e\n\u003cp\u003e“It was just…one of those things. We fell in love and got married. We were hoping for a more elaborate ceremony later, but I can see that’s going to be a problem.”\u003c/p\u003e\n\u003cp\u003e“You want to know what’s the real problem, James? It’s the marriage. Why didn’t you tell me right away?”\u003c/p\u003e\n\u003cp\u003e“I should have,” James said, sorry now that he hadn’t. “But when you told me you’d never been in love, I didn’t think there was much of a chance you’d understand.”\u003c/p\u003e\n\u003cp\u003e“What you’ve done is jeopardize your entire campaign.”\u003c/p\u003e\n\u003cp\u003eSomehow he doubted that. “Aren’t you overreacting?”\u003c/p\u003e\n\u003cp\u003e“Time will tell, won’t it?” Ralph asked smugly.\u003c/p\u003e\n\u003cp\u003eJames decided to ignore that. “If anything, Summer will be an asset. She’s lovely and she’s good at connecting with people. Unfortunately her contract with Disney doesn’t expire until April.”\u003c/p\u003e\n\u003cp\u003e“That’s right,” Ralph said sarcastically. “I forgot, she’s a showgirl.”\u003c/p\u003e\n\u003cp\u003e“A singer and an actress and a very talented one at that,” James boasted.\u003c/p\u003e\n\u003cp\u003e“An actress, a showgirl, it’s all the same.”\u003c/p\u003e\n\u003cp\u003e“Once she’s finished with her contract, I want her to move in with me.”\u003c/p\u003e\n\u003cp\u003e“Here in Seattle?” Ralph made it sound like a world-class disaster.\u003c/p\u003e\n\u003cp\u003e“A wife belongs with her husband.”\u003c/p\u003e\n\u003cp\u003e“What about the beach bum?”\u003c/p\u003e\n\u003cp\u003eJames frowned. “We don’t have to worry about him. He’s gone for good.”\u003c/p\u003e\n\u003cp\u003e“I certainly hope so. And while we’re making out a wish list, let’s add a couple of other things. Let’s wish that your worthy opponent doesn’t find out about this little skirmish between you and Summer’s previous lover-boy. And let’s make a great big wish that he doesn’t learn that the police were called and a report filed.”\u003c/p\u003e\n\u003cp\u003e“He won’t,” James said confidently, far more confidently than he felt.\u003c/p\u003e\n\u003cp\u003e“I hope you’re right,” Ralph said, and downed what was left of his bourbon in one gulp. The glass hit the counter when he put it down. “Now tell me, what kind of damage did you do to the beach bum?”\u003c/p\u003e\n\u003cp\u003e“You didn’t tell him, did you?” Julie said when Summer set the telephone receiver back in place.\u003c/p\u003e\n\u003cp\u003e“No.” She sighed reluctantly. She rested her hand protectively on her stomach.\u003c/p\u003e\n\u003cp\u003e“A man has the right to know he’s going to be a father,” Julie said righteously. She bit into an apple as she tucked her feet beneath her on the sofa.\u003c/p\u003e\n\u003cp\u003eSummer closed her eyes. Even the smell of food or the sound of someone eating made her sick to her stomach. In the past two months she’d seen parts of toilets that weren’t meant to be examined at such close range. She hadn’t kept down a single breakfast in weeks. The day before, she’d wondered why she even bothered to eat. Dumping it directly into the toilet would save time and trouble.\u003c/p\u003e\n\u003cp\u003e“How long do you think James is going to fall for this lie about having the flu?”\u003c/p\u003e\n\u003cp\u003eIt had been more than a month since she’d last seen him, and in that time Summer had lost ten pounds. Her clothes hung on her, and she was as pale as death. She seemed to spend more time at the doctor’s office than she did at her own apartment. Her biggest fear was that being so ill meant there was something wrong with the baby, although the doctor had attempted to reassure her on that score.\u003c/p\u003e\n\u003cp\u003e“Why haven’t you told him?” Julie wanted to know.\u003c/p\u003e\n\u003cp\u003e“I just can’t do it over the phone.” Besides, she remembered James mentioning that a pregnancy now would be a mistake. Well, she hadn’t gotten this way by herself!\u003c/p\u003e\n\u003cp\u003eShe knew exactly when it had happened, too. There was only the one time they hadn’t used protection.\u003c/p\u003e\n\u003cp\u003e“When are you going to see him again?”\u003c/p\u003e\n\u003cp\u003eSummer shook her head. “I don’t know.”\u003c/p\u003e\n\u003cp\u003e“You talk on the phone every night. He sends you gifts. I can’t think of anyone else who got six dozen red roses for Valentine’s Day.”\u003c/p\u003e\n\u003cp\u003e“He’s extravagant….”\u003c/p\u003e\n\u003cp\u003e“Extravagant with everything but his time.”\u003c/p\u003e\n\u003cp\u003e“He’s so busy, Julie. I never realized how much there was to being a judge, and he really cares about the people he works with. Not only the people who stand before him, but the attorneys and his staff, too. Then there’s the election….”\u003c/p\u003e\n\u003cp\u003e“So, go to him. He’s just as unhappy without you.”\u003c/p\u003e\n\u003cp\u003e“I’ve got three weeks left on my contract, and—”\u003c/p\u003e\n\u003cp\u003e“Do you really suppose no one’s figured out that you’re pregnant? Think about it, Summer. You came back from Vegas all happy and in love, and two weeks later you’re heaving your guts out after every meal. No one expects you to perform when you feel this crummy.”\u003c/p\u003e\n\u003cp\u003e“But…”\u003c/p\u003e\n\u003cp\u003e“Do everyone a favor and—” Julie stopped when there was a knock at the door. “Is anyone coming over tonight?”\u003c/p\u003e\n\u003cp\u003e“No.” Summer laid her head back against the sofa and drew in several deep breaths, hoping that would ease her nausea.\u003c/p\u003e\n\u003cp\u003e“It’s for you,” Julie said, looking over her shoulder as soon as she’d opened the door. “It’s Walter Wilkens.”\u003c/p\u003e\n\u003cp\u003eSummer threw aside the blanket and scurried off the sofa, anxious to see her father-in-law. “Walter?” What could he possibly be doing here? “Come inside, please.”\u003c/p\u003e\n\u003cp\u003eThe refined, older gentleman stepped into the apartment. “Summer?” He gazed at her, his expression concerned. “James said you’d been ill with the flu, but my dear…”\u003c/p\u003e\n\u003cp\u003e“She looks dreadful,” Julie finished for him. Her roommate took another noisy bite of her apple. “I’m Julie. We met at the wedding. Summer’s roommate and best friend.”\u003c/p\u003e\n\u003cp\u003eWalter bowed slightly. “Hello, Julie. It’s nice to see you again.”\u003c/p\u003e\n\u003cp\u003e“Sit down, please,” Summer said, motioning toward the only chair in the house without blankets or clean laundry stacked on it.\u003c/p\u003e\n\u003cp\u003e“Would you like something to drink?” Julie asked.\u003c/p\u003e\n\u003cp\u003e“No…no, thank you.” He cleared his throat. “Summer, my dear.” He frowned. “Have you been to a doctor?”\u003c/p\u003e\n\u003cp\u003e“Yup,” Julie answered, chewing on her apple. “Three times this week, right, Summer?”\u003c/p\u003e\n\u003cp\u003e“Julie,” she snapped.\u003c/p\u003e\n\u003cp\u003e“Are you going to tell him or not?”\u003c/p\u003e\n\u003cp\u003eSummer tossed the tangled curls over her shoulder and groaned inwardly. “I don’t have much choice now, do I?” She met Walter’s eyes and realized her lower lip was trembling. She was suddenly afraid she might burst into tears. Her emotions had been like a seesaw, veering from one extreme to another.\u003c/p\u003e\n\u003cp\u003e“Summer, what is it?” Walter prodded.\u003c/p\u003e\n\u003cp\u003e“I’m pregnant,” she whispered. She smiled happily all the while tears streamed down her cheeks.\u003c/p\u003e\n\u003cp\u003eWalter bolted out of his chair. “Hot damn!”\u003c/p\u003e\n\u003cp\u003e“Other than me, you’re the first person she’s told,” Julie felt obliged to inform him. “Not even her own family knows, although her mother would take one look at her and guess.”\u003c/p\u003e\n\u003cp\u003e“James doesn’t know?”\u003c/p\u003e\n\u003cp\u003e“Nope.” Again it was Julie who answered.\u003c/p\u003e\n\u003cp\u003e“And why not?”\u003c/p\u003e\n\u003cp\u003e“A woman doesn’t tell her husband that sort of thing over the phone,” Summer insisted. “Or by e-mail.” She needed to see his face, to gauge James’s reaction so she’d know what he was really thinking.\u003c/p\u003e\n\u003cp\u003e“She’s been sicker than a dog.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-48.html","bookId":1982,"creation":"Oct 5, 2019 10:26:50 AM","modification":"Oct 5, 2019 10:26:50 AM"}
