{"id":73063,"no":56,"title":"Page 56","content":"\u003cp\u003eBaffled, he wandered back downstairs. He scouted out the kitchen and the other rooms. The last place he looked was in his den. There he found an envelope propped against the base of the lamp.\u003c/p\u003e\n\u003cp\u003eJames tore open the letter. It was brief and it made no sense. All he understood was that she’d left him. He had no idea why, other than that she seemed to think she was doing what was best for him.\u003c/p\u003e\n\u003cp\u003eHe immediately called her cell. No answer.\u003c/p\u003e\n\u003cp\u003eA sick feeling attacked his stomach. He sat numbly at his desk for what could’ve been minutes or hours; he’d lost track of time. The next thing he knew, the doorbell chimed. He didn’t get up to answer. A moment later the door opened on its own and his father came into the house.\u003c/p\u003e\n\u003cp\u003e“You might’ve let me in,” he grumbled, setting one huge teddy bear in the chair across from James. “I’ll be right back.” He returned a couple of minutes later with the second bear.\u003c/p\u003e\n\u003cp\u003e“How’d you get in?” James asked, his voice devoid of emotion.\u003c/p\u003e\n\u003cp\u003e“You gave me a key, remember?”\u003c/p\u003e\n\u003cp\u003eHe didn’t.\u003c/p\u003e\n\u003cp\u003e“What’s going on around here?” Walter asked. “Where’s my daughter-in-law who’s giving me twin grandkids?”\u003c/p\u003e\n\u003cp\u003e“Apparently Summer has decided to leave me. She’s gone.”\u003c/p\u003e\n\u003cp\u003eTwelve\u003c/p\u003e\n\u003cp\u003e“Gone?” Walter protested. “What do you mean, gone?”\u003c/p\u003e\n\u003cp\u003e“Gone, Dad,” James said bitterly, “as in packed-a-suitcase-and-walked-out-the-door gone.”\u003c/p\u003e\n\u003cp\u003eHis father quickly sat down. “But…why?”\u003c/p\u003e\n\u003cp\u003eJames couldn’t answer that; silently he handed Walter the brief letter Summer had left him.\u003c/p\u003e\n\u003cp\u003eWalter read it, then raised questioning eyes to James. “What’s this supposed to mean?”\u003c/p\u003e\n\u003cp\u003e“Your guess is as good as mine.”\u003c/p\u003e\n\u003cp\u003e“You must’ve said something,” Walter insisted. “Think, boy, think.”\u003c/p\u003e\n\u003cp\u003e“I’ve done nothing but think, and none of this makes sense. I thought at first that she was upset about the twins. I realize now that whatever it is has been worrying her for some time.”\u003c/p\u003e\n\u003cp\u003e“What could it be?”\u003c/p\u003e\n\u003cp\u003e“I don’t know. I’d hoped she’d tell me.”\u003c/p\u003e\n\u003cp\u003e“You mean to say you didn’t ask?”\u003c/p\u003e\n\u003cp\u003e“No.”\u003c/p\u003e\n\u003cp\u003eWalter glared at him in disbelief. “That’s the first thing I learned after I married your mother. She never told me a thing that I didn’t have to pry out of her with a crowbar. It’s a man’s duty, a husband’s lot in life. When you didn’t ask, Summer must’ve assumed you didn’t care. She probably figures you don’t love her.”\u003c/p\u003e\n\u003cp\u003eIn spite of his heavy heart, James smiled. “Trust me, Dad, Summer has no fear of speaking her mind, and as for my loving her, she couldn’t have doubted that for an instant.”\u003c/p\u003e\n\u003cp\u003e“She loves you.” Walter’s words were more statement than question.\u003c/p\u003e\n\u003cp\u003e“Yes,” James said. He felt secure in her love. Or he had until now.\u003c/p\u003e\n\u003cp\u003e“Where would she go?”\u003c/p\u003e\n\u003cp\u003eThis was the same question he’d been debating from the moment he discovered her letter. He shrugged. “No idea.”\u003c/p\u003e\n\u003cp\u003e“Have you tried her cell?”\u003c/p\u003e\n\u003cp\u003e“Of course,” he snapped. “She turned it off.”\u003c/p\u003e\n\u003cp\u003e“Did you contact her parents?”\u003c/p\u003e\n\u003cp\u003eHe would have, but it wouldn’t help. James rubbed his face, tired to the very marrow of his bones. “They’re traveling across the Southwest in their motor home. Half the time they don’t have cell phone coverage.”\u003c/p\u003e\n\u003cp\u003e“What about friends she’s made since the move?”\u003c/p\u003e\n\u003cp\u003e“They’re more acquaintances than friends. She’s planning to volunteer at the library, but she’s only mentioned the children’s librarian in passing.”\u003c/p\u003e\n\u003cp\u003e“I see.” Walter frowned. “What about the Mannings?”\u003c/p\u003e\n\u003cp\u003e“She went over to talk to Elizabeth earlier this afternoon. Elizabeth phoned me and said Summer started to cry and then left in a hurry.”\u003c/p\u003e\n\u003cp\u003eWalter’s look was thoughtful. “Sounds as if she was trying to reach out for help.”\u003c/p\u003e\n\u003cp\u003e“The only other person I can think of is her former roommate, Julie. I’ll call her now.”\u003c/p\u003e\n\u003cp\u003e“Julie, of course,” his father said as if he should’ve thought of her himself.\u003c/p\u003e\n\u003cp\u003eJames looked up the number and spoke to Julie’s new roommate for several minutes.\u003c/p\u003e\n\u003cp\u003e“Julie’s contract with Disney was up at the same time as Summer’s,” he said as he hung up. “Now that I think about it, Summer did say something about Julie being on tour with a musical group.”\u003c/p\u003e\n\u003cp\u003e“So she’d be staying in hotels. Unlikely Summer would go to her.”\u003c/p\u003e\n\u003cp\u003eJames closed his eyes. His wife had walked out on him into a cold, friendless world.\u003c/p\u003e\n\u003cp\u003e“What about her brother?”\u003c/p\u003e\n\u003cp\u003eAfter another quick call, James shook his head. “Adam and Denise haven’t heard from her. All I did was scare them,” he said grimly.\u003c/p\u003e\n\u003cp\u003e“Did you check the airlines?”\u003c/p\u003e\n\u003cp\u003e“Where would she go?” James asked, losing his patience.\u003c/p\u003e\n\u003cp\u003e“I don’t know,” Walter admitted reluctantly. He began pacing.\u003c/p\u003e\n\u003cp\u003eHis movements soon irritated James. “For heaven’s sake, will you kindly sit down?”\u003c/p\u003e\n\u003cp\u003e“I can’t sit here and do nothing.”\u003c/p\u003e\n\u003cp\u003e“Yes, you can and you will,” James insisted, making a decision. “I’ll take the car and drive around, see if I can find her. You stay here by the phone in case she calls or we hear something.”\u003c/p\u003e\n\u003cp\u003e“Okay. Check in with me every half hour.”\u003c/p\u003e\n\u003cp\u003eJames nodded. As he climbed into the car, he felt as if he was setting out on a journey without a map. Essentially he was, he thought as he drove through the narrow neighborhood streets. Try as he might, he couldn’t figure out where she’d go. He tried to put himself in her shoes. Alone in a strange city with few friends.\u003c/p\u003e\n\u003cp\u003eThe only thing he could do was ask God to guide him.\u003c/p\u003e\n\u003cp\u003eThe wind blew off Puget Sound and buffeted Summer as she stood at the end of the pier. The waterfront was one of her favorite places in all of Seattle. Not knowing where else to instruct the taxi to take her, she’d had the driver bring her here.\u003c/p\u003e\n\u003cp\u003eShe loved to shop at the Pike Place Market. Every Saturday morning James came down to the waterfront with her, and they bought fresh fruit and vegetables for the week. He’d been wonderfully patient while she browsed in the tourist shops that stretched along the waterfront. Some of their happiest moments in Seattle had been spent on this very pier.\u003c/p\u003e\n\u003cp\u003eHow she hated to leave this city. It was as if everything in her was fighting to keep her in Seattle. Her husband was here, her home, her very life.\u003c/p\u003e\n\u003cp\u003eThe instant she’d walked into James’s large house, she’d experienced a powerful sense of homecoming. She’d never said anything to her husband—he might think her reaction was silly—but Summer felt that his house had always been meant for them together.\u003c/p\u003e\n\u003cp\u003eShe’d like to think that somewhere in James’s subconscious he’d known he was going to fall in love and marry. The house had been his preparation for her entry into his life.\u003c/p\u003e\n\u003cp\u003eTears blinded her eyes. She didn’t want to focus on her unhappiness, so she turned her attention to the water. The pull of the tide fascinated her. The dark, murky waters of Elliott Bay glistened in the lights overhead. A green-and-white ferry chugged into the terminal.\u003c/p\u003e\n\u003cp\u003eSummer closed her eyes, willing herself to walk away. Except that she didn’t know where she’d go. One thing was certain; she couldn’t spend the night standing at the end of the pier. She’d need to find herself a hotel. In the morning her head would be clearer and she could make some decisions.\u003c/p\u003e\n\u003cp\u003eShe was about to reach for her suitcase when she sensed someone approaching. Not wanting company, even the nonintrusive sort, Summer turned away from the railing. She kept her eyes lowered, but that didn’t prevent her from recognizing James.\u003c/p\u003e\n\u003cp\u003eHe sauntered to the railing several feet from where she stood. Wordlessly he stared into the distance.\u003c/p\u003e\n\u003cp\u003eSummer wasn’t sure what she should do. She couldn’t very well walk away from him now. It had been difficult enough the first time. She didn’t have the strength to do it again.\u003c/p\u003e\n\u003cp\u003e“How’d…how’d you find me?” she asked.\u003c/p\u003e\n\u003cp\u003eHe continued to stare into the distance. “Lucky guess,” he finally said in cool tones.\u003c/p\u003e\n\u003cp\u003eSummer doubted that James felt lucky being married to her just then. He was furious with her. More furious than she’d ever seen him.\u003c/p\u003e\n\u003cp\u003eShe wanted to explain that she was a detriment to his career, but couldn’t force the words through her parched throat.\u003c/p\u003e\n\u003cp\u003eThe tears that had flowed most of the day returned. She brushed them away with her fingertips.\u003c/p\u003e\n\u003cp\u003e“Was I such a bad husband?” he demanded in the same chilling tone.\u003c/p\u003e\n\u003cp\u003e“No,” she whispered.\u003c/p\u003e\n\u003cp\u003e“Did I do something so terrible you can’t forgive me for?”\u003c/p\u003e\n\u003cp\u003eSobbing, she shook her head.\u003c/p\u003e\n\u003cp\u003e“You’ve fallen out of love with me,” he suggested next.\u003c/p\u003e\n\u003cp\u003e“Don’t be ridiculous,” she cried. If she’d loved him any more than she already did, her heart couldn’t have stood it.\u003c/p\u003e\n\u003cp\u003e“Then tell me why you walked out on me.”\u003c/p\u003e\n\u003cp\u003e“My letter…”\u003c/p\u003e\n\u003cp\u003e“…explained nothing.”\u003c/p\u003e\n\u003cp\u003e“I…I…” She was trembling so much she couldn’t speak.\u003c/p\u003e\n\u003cp\u003eJames walked over to her and reached for her suitcase. “We’re going back to the house and we’re going to talk about this. Then, if you’re still set on leaving, I’ll drive you to the airport myself. Understand?”\u003c/p\u003e\n\u003cp\u003eAll she could manage was a weak nod.\u003c/p\u003e\n\u003cp\u003eThankfully, he’d parked the car close by. Summer felt disoriented. Maybe she shouldn’t be this happy that James had found her, but she was. Even if he was angry with her, she was grateful he was taking her home.\u003c/p\u003e\n\u003cp\u003eJames opened the car door for her and set her suitcase in the backseat. He didn’t speak so much as a single word on the drive home.\u003c/p\u003e\n\u003cp\u003eWhen they pulled into the driveway, Summer saw Walter’s car.\u003c/p\u003e\n\u003cp\u003e“Your father’s here?”\u003c/p\u003e\n\u003cp\u003eJames didn’t answer her. Nor did he need to. Walter was already out the door.\u003c/p\u003e\n\u003cp\u003e“Where’d you find her?” he asked, bolting toward them.\u003c/p\u003e\n\u003cp\u003e“The waterfront.”\u003c/p\u003e\n\u003cp\u003e“Sit down, sit down,” her father-in-law murmured, guiding Summer inside and into a chair. She felt she was about to collapse and must have looked it, too.\u003c/p\u003e\n\u003cp\u003e“Now what the hell is this all about?” James said roughly.\u003c/p\u003e\n\u003cp\u003e“You can’t talk to her like that,” Walter chastised. “Can’t you see the poor girl’s had the worst day of her life?” He turned to Summer, smiling gently. “Now what the hell is this all about?”\u003c/p\u003e\n\u003cp\u003eSummer looked from one man to the other. “Would it be all right if I spoke to James alone?” she asked her father-in-law. She couldn’t deal with both of them at the same time.\u003c/p\u003e\n\u003cp\u003eIt looked for a moment as if Walter wasn’t going to leave. “I suppose,” he agreed with reluctance. “I’ll be in the other room.”\u003c/p\u003e\n\u003cp\u003e“Walter,” Summer said, stopping him on his way out the door. “I take it the two teddy bears are your doing.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-manning-grooms-those-manning-men-0/page-56.html","bookId":1982,"creation":"Oct 5, 2019 10:26:50 AM","modification":"Oct 5, 2019 10:26:50 AM"}
