{"id":35846,"no":259,"title":"Part 4 Book 11 Chapter 4 The Child is amazed at the Old Man","content":"\u003cp\u003eIn the meantime, in the Marche Saint-Jean, where the post had already been disarmed, Gavroche had just \"effected a junction\" with a band led by Enjolras, Courfeyrac, Combeferre, and Feuilly. They were armed after a fashion. Bahorel and Jean Prouvaire had found them and swelled the group. Enjolras had a double-barrelled hunting-gun, Combeferre the gun of a National Guard bearing the number of his legion, and in his belt, two pistols which his unbuttoned coat allowed to be seen, Jean Prouvaire an old cavalry musket, Bahorel a rifle; Courfeyrac was brandishing an unsheathed sword-cane. Feuilly, with a naked sword in his hand, marched at their head shouting: \"Long live Poland!\"\u003c/p\u003e \n\u003cp\u003eThey reached the Quai Morland. Cravatless, hatless, breathless, soaked by the rain, with lightning in their eyes. Gavroche accosted them calmly:--\u003c/p\u003e \n\u003cp\u003e\"Where are we going?\"\u003c/p\u003e \n\u003cp\u003e\"Come along,\" said Courfeyrac.\u003c/p\u003e \n\u003cp\u003eBehind Feuilly marched, or rather bounded, Bahorel, who was like a fish in water in a riot. He wore a scarlet waistcoat, and indulged in the sort of words which break everything. His waistcoat astounded a passer-by, who cried in bewilderment:--\u003c/p\u003e \n\u003cp\u003e\"Here are the reds!\"\u003c/p\u003e \n\u003cp\u003e\"The reds, the reds!\" retorted Bahorel. \"A queer kind of fear, bourgeois. For my part I don\u0027t tremble before a poppy, the little red hat inspires me with no alarm. Take my advice, bourgeois, let\u0027s leave fear of the red to horned cattle.\"\u003c/p\u003e \n\u003cp\u003eHe caught sight of a corner of the wall on which was placarded the most peaceable sheet of paper in the world, a permission to eat eggs, a Lenten admonition addressed by the Archbishop of Paris to his \"flock.\" \u003c/p\u003e \n\u003cp\u003eBahorel exclaimed:--\u003c/p\u003e \n\u003cp\u003e\"`Flock\u0027; a polite way of saying geese.\"\u003c/p\u003e \n\u003cp\u003eAnd he tore the charge from the nail. This conquered Gavroche. From that instant Gavroche set himself to study Bahorel. \u003c/p\u003e \n\u003cp\u003e\"Bahorel,\" observed Enjolras, \"you are wrong. You should have let that charge alone, he is not the person with whom we have to deal, you are wasting your wrath to no purpose. Take care of your supply. One does not fire out of the ranks with the soul any more than with a gun.\"\u003c/p\u003e \n\u003cp\u003e\"Each one in his own fashion, Enjolras,\" retorted Bahorel. \"This bishop\u0027s prose shocks me; I want to eat eggs without being permitted. Your style is the hot and cold; I am amusing myself. Besides, I\u0027m not wasting myself, I\u0027m getting a start; and if I tore down that charge, Hercle! \u0027twas only to whet my appetite.\"\u003c/p\u003e \n\u003cp\u003eThis word, Hercle, struck Gavroche. He sought all occasions for learning, and that tearer-down of posters possessed his esteem. He inquired of him:--\u003c/p\u003e \n\u003cp\u003e\"What does Hercle mean?\"\u003c/p\u003e \n\u003cp\u003eBahorel answered:--\u003c/p\u003e \n\u003cp\u003e\"It means cursed name of a dog, in Latin.\"\u003c/p\u003e \n\u003cp\u003eHere Bahorel recognized at a window a pale young man with a black beard who was watching them as they passed, probably a Friend of the A B C. He shouted to him:--\u003c/p\u003e \n\u003cp\u003e\"Quick, cartridges, para bellum.\"\u003c/p\u003e \n\u003cp\u003e\"A fine man! that\u0027s true,\" said Gavroche, who now understood Latin.\u003c/p\u003e \n\u003cp\u003eA tumultuous retinue accompanied them,--students, artists, young men affiliated to the Cougourde of Aix, artisans, longshoremen, armed with clubs and bayonets; some, like Combeferre, with pistols thrust into their trousers.\u003c/p\u003e \n\u003cp\u003eAn old man, who appeared to be extremely aged, was walking in the band.\u003c/p\u003e \n\u003cp\u003eHe had no arms, and he made great haste, so that he might not be left behind, although he had a thoughtful air. \u003c/p\u003e \n\u003cp\u003eGavroche caught sight of him:--\u003c/p\u003e \n\u003cp\u003e\"Keksekca?\" said he to Courfeyrac.\u003c/p\u003e \n\u003cp\u003e\"He\u0027s an old duffer.\"\u003c/p\u003e \n\u003cp\u003eIt was M. Mabeuf.\u003c/p\u003e  \n\u003cp\u003e①当时波兰正全国起义，争取独立。\u003c/p\u003e \n\u003cp\u003e“我们去什么地方？”\u003c/p\u003e \n\u003cp\u003e“跟着我们走。”古费拉克说。\u003c/p\u003e \n\u003cp\u003e巴阿雷走在弗以伊的后面，象急流中的一条鱼，蹦蹦跳跳。他穿了一件鲜红的坎肩，说话全没忌讳。他那坎肩惊动了一个过路人，那人丧了胆似的大声说：\u003c/p\u003e \n\u003cp\u003e“红党来了！”\u003c/p\u003e \n\u003cp\u003e“红党，红党！”巴阿雷反击说，“怕得可笑，资产阶级。至于我，我在虞美人跟前一点也不发抖，小红帽①也不会引起我恐怖。资产阶级，相信我，把怕红病留给那些生角的动物②去害吧。”\u003c/p\u003e \n\u003cp\u003e他瞧见墙角上贴着一张布告，那是一张世界上最不碍事的纸，巴黎大主教准许在封斋节期间吃蛋类的文告，是给他的那些“羔羊”们看的。\u003c/p\u003e \n\u003cp\u003e巴阿雷大声说：\u003c/p\u003e \n\u003cp\u003e“羔羊，猪崽的文雅称号。”\u003c/p\u003e \n\u003cp\u003e他顺手把那文告从墙上撕下来。这一行动征服了伽弗洛什。从这时起，伽弗洛什开始注意巴阿雷了。\u003c/p\u003e \n\u003cp\u003e“巴阿雷，”安灼拉指出，“你不该这样。那布告，不动它也可以。我们今天的事不是针对它的，你把你的火气花得太不值得了。留点力气吧。不到时候不浪费力量，无论是人的精力还是枪的火力。”\u003c/p\u003e \n\u003cp\u003e“各人的脾胃不同，安灼拉，”巴阿雷反驳说，“主教的那篇文章叫我生气，我吃鸡蛋不用别人准许。你的性格是内热外冷的，我呢，爱图个痛快。我并没有消耗力量，我正来劲呢，我撕那布告，以赫拉克勒斯的名义③！正是要开开胃。” \u003c/p\u003e \n\u003cp\u003e①小红帽是十七世纪法国作家贝洛写的一篇童话《小红帽》里的主角。\u003c/p\u003e \n\u003cp\u003e②头生角犹如说戴绿帽子。生角的动物也指牛，牛见了红色就激怒。\u003c/p\u003e \n\u003cp\u003e③赫拉克勒斯，希腊神话里的英雄，曾完成十二项艰巨的工作。\u003c/p\u003e \n\u003cp\u003e赫拉克勒斯这个词引起了伽弗洛什的注意。他素来喜欢随时寻找机会来丰富自己的知识，加以那位布告撕毁者是值得钦佩的。他问他说：\u003c/p\u003e \n\u003cp\u003e“赫拉克勒斯是什么意思？”\u003c/p\u003e \n\u003cp\u003e巴阿雷回答说：\u003c/p\u003e \n\u003cp\u003e“那是拉丁语里的该死。”\u003c/p\u003e \n\u003cp\u003e在这里，巴阿雷认出一个白净脸黑胡须的年轻小伙子在一个窗口望着他们走过，那也许是ABC社的一个朋友吧。他向他喊道：\u003c/p\u003e \n\u003cp\u003e“快，枪弹！para　bellum。”\u003c/p\u003e \n\u003cp\u003e“美男子！确是。”伽弗洛什说。他现在懂拉丁语了①。 \u003c/p\u003e \n\u003cp\u003e①Para　be11um，准备战斗，bellum（战斗）和法语bel　homme（美男子）发音相同。\u003c/p\u003e \n\u003cp\u003e一长列喧闹的人伴随着他们，大学生、艺术家、艾克斯苦古尔德社的社员们、工人、码头工人，有的拿着棍棒，有的拿着刺刀，有几个和公白飞一样，裤腰里插着手枪。夹在这一群人里往前走的还有一个老人，一个显得很老的老人。他什么武器也没有。他那神气仿佛是在想着什么，但却仍奋力前进，唯恐落在人后。伽弗洛什发现了他。\u003c/p\u003e \n\u003cp\u003e“这是什么？”他问公白飞。\u003c/p\u003e \n\u003cp\u003e“是个老人。”\u003c/p\u003e \n\u003cp\u003e这是马白夫先生。\u003c/p\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/75/4396.html","bookId":542,"creation":"Aug 5, 2019 6:46:57 AM","modification":"Aug 5, 2019 6:46:57 AM"}
