{"id":44570,"no":66,"title":"Chapter II.","content":"Of Comets and Shooting Fires, and Those which Resemble Beams.\n\u003cbr\u003e \n\u003cbr\u003e Some of the Pythagoreans say, that a comet is one of those stars which do not always appear, but after they have run through their determined course, they then rise and are visible to us. Others, that it is the reflection of our sight upon the sun, which gives the resemblance of comets much after the same manner as images are reflected in mirrors. Anaxagoras and Democritus, that two or more stars being in conjunction by their united light make a comet. Aristotle, that it is a fiery coalition of dry exhalations. Strato, that it is the light of the star darting through a thick cloud that hath invested it; this is seen in light shining through lanterns. Heraclides, native of Pontus, that it is a lofty cloud inflamed by a sublime fire. The like causes he assigns to the bearded comet, to those circles that are seen about the sun or stars, or those meteors which resemble pillars or beams, and all others which are of this kind. This way unanimously go all the Peripatetics, holding that these meteors, being formed by the clouds, do differ according to their various configurations. Epigenes, that a comet arises from a rising of spirit or wind, mixed with an earthy substance and set on fire. Boethus, that it is a phantasy presented to us by fiery air. Diogenes, that comets are stars. Anaxagoras, that those styled shooting stars descend from the aether like sparks, and therefore are soon extinguished. Metrodorus, that it is a forcible illapse of the sun upon clouds which makes them to sparkle as fire. Xenophanes, that all such fiery meteors are nothing else but the conglomeration of the enfired clouds, and the flashing motions of them.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1337/40281.html","bookId":1469,"creation":"Aug 11, 2019 7:51:42 AM","modification":"Aug 11, 2019 7:51:42 AM"}
