{"id":44598,"no":94,"title":"Chapter XII.","content":"What is the Difference Between Imagination [Greek Omitted], The Imaginable [GREEK OMITTED], Fancy [GREEK OMITTED], and Phantom [Greek Omitted]?\n\u003cbr\u003e \n\u003cbr\u003e Chrysippus affirms, these four are different one from another. Imagination is that passion raised in the soul which discovers itself and that which was the efficient of it; to use example, after the eye hath looked upon a thing that is white, the sight of which produceth in the mind a certain impression, this gives us reason to conclude that the object of this impression is white, which affecteth us. So with touching and smelling Phantasy or imagination is denominated from [Greek omitted] which denotes light; for as light discovers itself and all other things which it illuminates, so this imagination discovers itself and that which is the cause of it. The imaginable is the efficient cause of imagination; as anything that is white, or anything that is cold, or everything that may make an impression upon the imagination. Fancy is a vain impulse upon the mind of man, proceeding from nothing which is really conceivable; this is experienced in those that whirl about their idle hand and fight with shadows; for to the imagination there is always some real imaginable thing presented, which is the efficient cause of it; but to the fancy nothing. A phantom is that to which we are brought by such a fanciful and vain attraction; this is to be seen in melancholy and distracted persons. Of this sort was Orestes in the tragedy, pronouncing these words:\n\u003cbr\u003e \n\u003cbr\u003e Mother, these maids with horror me affright;\n\u003cbr\u003e Oh bring them not, I pray, into my sight!\n\u003cbr\u003e They’re smeared with blood, and cruel, dragon-like,\n\u003cbr\u003e Skipping about with deadly fury strike.\n\u003cbr\u003e \n\u003cbr\u003e These rave as frantic persons, they see nothing, and yet imagine they see. Thence Electra thus returns to him:\n\u003cbr\u003e \n\u003cbr\u003e 0 wretched man, securely sleep in bed;\n\u003cbr\u003e Nothing thou seest, thy fancy’s vainly led.\n\u003cbr\u003e (Euripides, “Orestes”, 255.)\n\u003cbr\u003e \n\u003cbr\u003e After the same manner Theoclymenus in Homer.\n\u003cbr type\u003d\"_moz\"\u003e \n\u003cbr\u003e\n\u003cbr\u003e","sourceLink":"http://novel.tingroom.com/jingdian/1337/40309.html","bookId":1469,"creation":"Aug 11, 2019 7:51:42 AM","modification":"Aug 11, 2019 7:51:42 AM"}
