{"id":109150,"no":26,"title":"Page 26","content":"\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp;\u003c/p\u003e\n\u003cp\u003e\"Now you know how it\u0027s done?\"Elena asked Meredith. \"You put the key in the keyhole and say where you want to go.\u003c/p\u003e\n\u003cp\u003eThen open the door and go through. That\u0027s it.\"\u003c/p\u003e\n\u003cp\u003e\"You three go first,\"Stefan added. \"And quick.\"\u003c/p\u003e\n\u003cp\u003e\"I\u0027l turn the key,\"Meredith told Matt. \"You take care of Mrs. Flowers.\"\u003c/p\u003e\n\u003cp\u003eJust then Elena thought of something that she didn\u0027t want to say aloud, only to Stefan. But she and he were physical y so close, she knew he would pick it up. Saber! she thought to Stefan. We can\u0027t leave him to these malach!\u003c/p\u003e\n\u003cp\u003eWe won\u0027t, she heard Stefan\u0027s voice in her head say. I showed him the way to Matt\u0027s house, and told him to go there and take Talon and protect the people who will be coming.\u003c/p\u003e\n\u003cp\u003eAt the same time Matt was saying, \"Oh, my God! Saber! He saved my life - I can\u0027t just leave him.\"\u003c/p\u003e\n\u003cp\u003e\"Already taken care of,\"Stefan reassured him and Elena patted him on the back. \"He\u0027l be at your house in a little while, and if you go somewhere else he\u0027l track you.\"\u003c/p\u003e\n\u003cp\u003eElena turned her pats into gentle pushes. \"Be good!\"\u003c/p\u003e\n\u003cp\u003e\"Matt Honeycutt\u0027s bedroom in Fel \u0027s Church,\"Meredith said, thrusting the key at the door handle, and opening the door.\u003c/p\u003e\n\u003cp\u003eShe and Mrs. Flowers and Matt al stepped forward. The door shut.\u003c/p\u003e\n\u003cp\u003eStefan turned to Elena. \"I\u0027m going first,\"he said flatly. \"But I\u0027m holding on to you. I\u0027m not going to let you go.\"\u003c/p\u003e\n\u003cp\u003e\"Never let me go, never let me go,\"Elena whispered in an imitation of Misao\u0027s \"Have nightmares.\"Then she had a thought.\u003c/p\u003e\n\u003cp\u003e\"Slave bracelets!\"\u003c/p\u003e\n\u003cp\u003e\"What?\"Stefan said. Then, \"Oh, I remember, you told me. But what are they supposed to look like?\"\u003c/p\u003e\n\u003cp\u003e\"Like any two bracelets, matching if possible.\"Elena was scrambling around the back of the room, where furniture was piled up, opening drawers, closing them. \"Come on, bracelets! Come on! This house is supposed to have everything!\"\u003c/p\u003e\n\u003cp\u003e\"What about these things you wear in your hair?\"Stefan asked. Elena looked back and he tossed her a bag of soft cotton ponytail holders.\u003c/p\u003e\n\u003cp\u003e\"You\u0027re a genius! They won\u0027t even hurt my wrists. And here are two white ones so they\u0027l match!\"Elena said happily.\u003c/p\u003e\n\u003cp\u003eThey arranged themselves in front of the door, with Stefan to Elena\u0027s left so he could see what was out there before they stepped in. He also had a firm grip on Elena\u0027s left arm.\u003c/p\u003e\n\u003cp\u003e\"Wherever our friend Bonnie McCul ough is,\"Stefan said, and thrust the key into the lockless door handle, turning it. Then, after giving Elena the key, he gingerly opened the door.\u003c/p\u003e\n\u003cp\u003eElena wasn\u0027t sure what she was expecting. A blaze of light maybe, as they traveled through dimensions. Some kind of spiraling tunnel, or shooting stars. At least a feeling of motion.\u003c/p\u003e\n\u003cp\u003eWhat she got was steam. It soaked through her T-shirt and dampened her hair.\u003c/p\u003e\n\u003cp\u003eAnd then she got noise.\u003c/p\u003e\n\u003cp\u003e\"Elena! Eleeeeeeeeeeeeeeena! You\u0027re here! \"\u003c/p\u003e\n\u003cp\u003eElena recognized the voice but couldn\u0027t locate the screamer in the steam.\u003c/p\u003e\n\u003cp\u003eThen she saw an immense bathtub made of tiles of malachite, and a frightened-looking girl tending a charcoal fire at the bath\u0027s foot, while two other young attendants holding scrubbing brushes and pumice stones cowered against the other wal .\u003c/p\u003e\n\u003cp\u003eAnd in the bath was Bonnie! It was obvious that the tub was very deep, because Bonnie wasn\u0027t able to touch bottom in the middle but she was half-leaping out of the water like a foam-covered dolphin over and over to attract attention.\u003c/p\u003e\n\u003cp\u003e\"There you are,\"gasped Elena. She dropped to her knees on a thick, soft blue rug. Bonnie made a spectacular leap and just for a moment Elena could feel a smal soapy, sudsy body in her arms.\u003c/p\u003e\n\u003cp\u003eThen Bonnie went down again and came up laughing.\u003c/p\u003e\n\u003cp\u003e\"And is that Stefan? It\u0027s Stefan! Stefan, hello! Helloooo! \"\u003c/p\u003e\n\u003cp\u003eStefan glanced back, as if trying to assess the suds situation. He seemed satisfied with it, turned slightly, and waved.\u003c/p\u003e\n\u003cp\u003e\"Hey, Bonnie?\"he asked, voice muffled by the sounds of continual splashing. \"Where are we?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Lady Ulma\u0027s house! You\u0027re safe - you\u0027re al safe!\"She turned a smal hopeful face to Elena. \"Where\u0027s Meredith?\"\u003c/p\u003e\n\u003cp\u003eElena shook her head, thinking of al the things about Meredith that Bonnie didn\u0027t know yet. Well, she decided, this wasn\u0027t the time to mention them. \"She had to stay behind, to protect Fel \u0027s Church.\"\u003c/p\u003e\n\u003cp\u003e\"Oh,\"Bonnie looked down, troubled. \"Stillbad, is it?\"\u003c/p\u003e\n\u003cp\u003e\"You wouldn\u0027t believe it. Real y; it\u0027s - indescribable. That\u0027s where Matt and Mrs. Flowers and Meredith are. I\u0027m sorry.\"\u003c/p\u003e\n\u003cp\u003e\"No, I\u0027m just so glad to see you! Oh my God, but you\u0027re hurt.\"She was looking at the smal tooth wounds on Elena\u0027s arm, and the blood on her torn T-shirt. \"I\u0027l get out and - hey, no, you get in! There\u0027s plenty of room; plenty of hot water, and... plenty of clothes! Lady Ulma even designed some for us, for \u0027when we came back\u0027!\"\u003c/p\u003e\n\u003cp\u003eElena, smiling reassuringly at the bath girls, was already stripping as fast as she could. The tub, which was big enough for six to swim in, looked too luxurious to miss and, she reasoned, it made sense to be clean when you greeted your hostess.\u003c/p\u003e\n\u003cp\u003e\"Go have fun,\"she shouted to Stefan. \"Is Damon here?\"she added in a whispered aside to Bonnie, who nodded.\u003c/p\u003e\n\u003cp\u003e\"Damon\u0027s here, too,\"Elena caroled. \"If you find Lady Ulma, tel her Elena\u0027s coming, but she\u0027s getting washed up first.\"She didn\u0027t actual y dive into the pearl pink steaming water, but she got onto the second step down and let herself slide from there.\u003c/p\u003e\n\u003cp\u003eInstantly, she was immersed in delicious heat that seeped straight into her body, pul ing some magic string that relaxed al her muscles at once. Perfumes suffused the air. She flung her wet hair back and saw Bonnie laughing at her.\u003c/p\u003e\n\u003cp\u003e\"So you got out of your hole and you\u0027ve been here wal owing in luxury while we\u0027ve been worried sick?\"Elena couldn\u0027t help but hear the way her voice went up at the end, making it a question.\u003c/p\u003e\n\u003cp\u003e\"No, I got picked up by some people, and - \"Bonnie broke off. \"Well...the first few days were tough, but never mind.\u003c/p\u003e\n\u003cp\u003eThank God we got to Lady Ulma\u0027s in the end. Want a bath brush? Some soap that smel s just like roses?\"\u003c/p\u003e\n\u003cp\u003eElena was looking at Bonnie with slightly narrowed eyes.\u003c/p\u003e\n\u003cp\u003eShe knew that Bonnie would do just about anything for Damon. That included covering up for him. Delicately, al the while enjoying the brushes and unguents and many kinds of soaps laid out on a shelf for easy reach, she began an inquisition.\u003c/p\u003e\n\u003cp\u003eStefan got out of the steamy room before he was soaking wet. Bonnie was safe and Elena was happy. He found he had stepped into another room, in which were a number of couches made of some soft spongy material. For drying?\u003c/p\u003e\n\u003cp\u003eMassage? Who knew?\u003c/p\u003e\n\u003cp\u003eThe next room he entered had gas lanterns that were turned high enough to rival electrical light. Here were three more couches - he had no idea what for - a ful -length silvered-glass mirror, and smal er mirrors in front of chairs. Obviously a place for makeup and beautifying.\u003c/p\u003e\n\u003cp\u003eThis last room opened onto a hal way. Stefan stepped out and hesitated, spreading delicate tendrils of Power in different directions, hoping to find Damon before Damon noticed his presence in the estate. The Master Key had proved that it could overcome the fact that he hadn\u0027t been invited here. That meant that maybe he could...\u003c/p\u003e\n\u003cp\u003eAt that moment he got a hit, and withdrew his probe immediately, startled. He stared down the long corridor. He could actual y see Damon, pacing in the room at the end, talking to someone Stefan couldn\u0027t see behind the door.\u003c/p\u003e\n\u003cp\u003eStefan crept very quietly down the hal way, stalking. He made it to the door without his brother even noticing, and there he saw that the person Damon was talking to was a woman wearing what looked like buckskin breeches and shirt, who had weathered skin, and a general aura of being more at home outside civilization than inside it. Damon was saying,\u003c/p\u003e\n\u003cp\u003e\"Make sure there are enough warm clothes for the girl. She\u0027s not exactly hardy, you know - \"\u003c/p\u003e\n\u003cp\u003e\"Then where are you taking her - and why?\"Stefan asked, leaning against the doorjamb.\u003c/p\u003e\n\u003cp\u003eHe had the good fortune to once - just this once - take Damon unaware. His brother glanced up, and then jerked like a startled cat. It was priceless to watch Damon scrambling for a mask until he decided on the fa?ade of absent amiability. Stefan guessed that no one had ever put so much effort into walking over to a desk chair, sitting down, and forcing himself to lounge.\u003c/p\u003e\n\u003cp\u003e\"Well, well! Little brother! You dropped in for a visit! How...\u003c/p\u003e\n\u003cp\u003enice. What a pity, though, that I\u0027m practical y running out the door on a journey, and there\u0027s no room for you.\"\u003c/p\u003e\n\u003cp\u003eAt this point the weather-beaten woman who had been taking notes - and who had risen when Stefan entered the room - spoke up. \"Oh, no, my lord. The thurgs won\u0027t mind the extra weight of this gentleman. They probably won\u0027t notice it.\u003c/p\u003e\n\u003cp\u003eIf his baggage can be ready by tomorrow you can start out in the early morning just as you planned.\"\u003c/p\u003e\n\u003cp\u003eDamon gave her his best \"shut up or die\"glare. She shut up.\u003c/p\u003e\n\u003cp\u003eThrough clenched teeth, Damon managed to say, \"This is Pelat. She\u0027s the coordinator of our little expedition. Hel o, Pelat. Good-bye, Pelat. You may go.\"\u003c/p\u003e\n\u003cp\u003e\"As you wish, my lord.\"\u003c/p\u003e\n\u003cp\u003ePelat bowed and left.\u003c/p\u003e\n\u003cp\u003e\"Aren\u0027t you taking this \u0027my lord\u0027thing a bit too seriously?\"Stefan asked. \"And what is that costume you\u0027re wearing?\"\u003c/p\u003e\n\u003cp\u003e\"It\u0027s the uniform of the captain of the guard of Madame le Princess Jessalyn D\u0027Aubigne,\"Damon said coldly.\u003c/p\u003e\n\u003cp\u003e\"You got a job?\"\u003c/p\u003e\n\u003cp\u003e\"It was a position.\"Damon bared his teeth. \"And it\u0027s none of your business.\"\u003c/p\u003e\n\u003cp\u003e\"Got your canines back, too, I see.\"\u003c/p\u003e\n\u003cp\u003e\"And that\u0027s none of your business either. But if you want me to knock you out and trample over your undead body, I\u0027l be delighted to oblige.\"\u003c/p\u003e\n\u003cp\u003eSomething was wrong, Stefan thought. Damon should be through the taunting phase and be actual y trampling on him by now. It only made sense if...\u003c/p\u003e\n\u003cp\u003e\"I\u0027ve already spoken to Bonnie,\"he said. And so he had, to ask where he was. But to a guilty mind, apparent foreknowledge often worked wonders.\u003c/p\u003e\n\u003cp\u003eAnd Damon hastily said exactly what Stefan hoped he wouldn\u0027t. \"I can explain!\"\u003c/p\u003e\n\u003cp\u003e\"Oh, God,\"Stefan said.\u003c/p\u003e\n\u003cp\u003e\"If she\u0027d just done as I told her - \"\u003c/p\u003e\n\u003cp\u003e\"While you were off becoming a princess\u0027s captain of the guard? And she was - where?\"\u003c/p\u003e\n\u003cp\u003e\"She was safe, at least! But, no, she had to go out into the street and then to that shop - \"\u003c/p\u003e\n\u003cp\u003e\"Shocking! She actual y walked in the street?\"\u003c/p\u003e\n\u003cp\u003eDamon ground his teeth. \"You don\u0027t know how it is around here - or how the slave trade works. Every day - \"\u003c/p\u003e\n\u003cp\u003eStefan slammed both hands on the desk, now truly angry.\u003c/p\u003e\n\u003cp\u003e\"She was picked up by slavers? While you were sleazing around with a princess?\"\u003c/p\u003e\n\u003cp\u003e\"Princess Jessalyn does not sleaze,\"Damon replied icily.\u003c/p\u003e\n\u003cp\u003e\"Nor do I. And anyway it al turned out to be a good thing because now we know where the Seven Kitsune Treasures are.\"\u003c/p\u003e\n\u003cp\u003e\"What treasures? And who cares about treasures when there\u0027s a town being destroyed by kitsune?\"\u003c/p\u003e\n\u003cp\u003eDamon opened his mouth, shut it, then looked narrowly at Stefan. \"You said that you\u0027d talked to Bonnie about al this.\"\u003c/p\u003e\n\u003cp\u003e\"I did talk to Bonnie,\"Stefan said flatly. \"I said hel o.\"\u003c/p\u003e\n\u003cp\u003eDamon\u0027s dark eyes flared. For a moment Stefan thought he was going to snarl or start a fight. But then, through clenched teeth, he said, \"It\u0027s al for the damned town, don\u0027t you see that? Those treasures include the largest star bal ever to be fil ed with Power. And that Power may be enough to save Fel \u0027s Church. At least to stop its total annihilation. Maybe to even clear out every malach that exists and destroy Shinichi and Misao with a single blow. Is that noble enough for you, little brother? Is it reason enough?\"\u003c/p\u003e\n\u003cp\u003e\"But taking Bonnie - \"\u003c/p\u003e\n\u003cp\u003e\"You stay with her here if you like! Spend your lives here! I might mention that without her I would never have been able to set up an expedition, and that she\u0027s determined to go.\u003c/p\u003e\n\u003cp\u003eBesides, we\u0027re not coming back this way. There has to be an easier route from the Gatehouse to Earth. We wouldn\u0027t survive coming back, so you\u0027d better hope like hel that there is one.\"\u003c/p\u003e\n\u003cp\u003eStefan was surprised. He had never heard his brother speak with such passion about anything that involved humans. He was about to reply, when behind him there came a scream of pure, unadulterated rage. It was frightening - and worrying, too, because Stefan would recognize that voice anywhere, anytime. It was Elena\u0027s. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-return-midnight-the-vampire-diaries-3/page-26.html","bookId":2037,"creation":"Oct 5, 2019 11:32:33 PM","modification":"Oct 5, 2019 11:32:33 PM"}
