{"id":109167,"no":44,"title":"Page 44","content":"\u003cp\u003eOn the smal est moon of the Nether World fine ash was fal ing. It fel on two already ash-covered bodies. It fel on ash-choked water. It blocked the sunlight so that an endless midnight covered the moon\u0027s ash-coated surface.\u003c/p\u003e\n\u003cp\u003eAnd something else fel . In the smal est imaginable droplets, an opalescent fluid fel , colors swirling as if to try and make up for the ugliness of the ashes. They were tiny drops, but there were tril ions upon tril ions of them, fal ing endlessly, concentrated over the spot where they had once been part of the largest container of raw Power in three dimensions.\u003c/p\u003e\n\u003cp\u003eThere was a body on the ground on this spot - not quite a corpse. The body had no heartbeat; it did not breathe, and there was no brain activity. But somewhere in it there was a slow pulsing, that quickened very slightly as the tiny drops of Power fel upon it.\u003c/p\u003e\n\u003cp\u003eThe pulsing was made up of nothing but a memory. The memory of a girl with dark blue eyes and golden hair and a smal face with wide brown eyes. And the taste: the taste of two maidens\u0027tears. Elena. Bonnie.\u003c/p\u003e\n\u003cp\u003ePutting the two of them together they formed what was not exactly a thought, not exactly a picture. But to someone who only understood words, it might be translated: They are wiating for me. If I can figure out who I am.\u003c/p\u003e\n\u003cp\u003eAnd that sparked a fierce determination.\u003c/p\u003e\n\u003cp\u003eAfter what seemed like centuries but was only a few hours, something moved in the ash. A fist clenched.\u003c/p\u003e\n\u003cp\u003eAnd something stirred in the brain, a self-revelation. A name.\u003c/p\u003e\n\u003cp\u003eDamon.\u003c/p\u003e\n\u003cp\u003e\u0026nbsp;\u0026nbsp; \u0026nbsp; \u003c/p\u003e","sourceLink":"https://allnovel.net/the-return-midnight-the-vampire-diaries-3/page-44.html","bookId":2037,"creation":"Oct 5, 2019 11:32:33 PM","modification":"Oct 5, 2019 11:32:33 PM"}
