{"id":109081,"no":101,"title":"Page 101","content":"\u003cp\u003e“But I told you, Prince Humperdinck, after he captured him, gave orders for all to hear that the man in black was to be returned safely to his ship. Everyone in Florin knows this to be so.”\u003c/p\u003e\n\u003cp\u003e“(a) Prince Humperdinck had some plans to kill his fiancée and hired us to carry them out but (b) the man in black ruined Prince Humperdinck’s plans; however, eventually, (c) Prince Humperdinck managed to capture the man in black, and, as everybody in all Florin City also knows, Prince Humperdinck has a terrible temper, so, therefore, (d) if a man has a terrible temper, what could be more fun than losing it against the very fellow who spoiled your plans to kill your fiancée?” They had reached the Thieves Quarter wall now. Inigo jumped on Fezzik’s shoulders and Fezzik started to climb. “Conclusion (1),” Inigo continued, not missing a beat, “since the Prince is in Florin City taking out his temper on the man in black, the man in black must also be in Florin City. Conclusion (2), the man in black must not be too happy with his present situation. Conclusion (3), I am in Florin City and need a planner to avenge my father, while he is in Florin City and needs a rescuer to salvage his future, and when people have equal needs of each other, conclusion (4 and final) deals are made.”\u003c/p\u003e\n\u003cp\u003eFezzik reached the top of the wall and started carefully climbing down the other side. “I understand everything,” he said.\u003c/p\u003e\n\u003cp\u003e“You understand nothing, but it really doesn’t matter, since what you mean is, you’re glad to see me, just as I’m glad to see you because no more loneliness.”\u003c/p\u003e\n\u003cp\u003e“That’s what I mean,” said Fezzik.\u003c/p\u003e\n\u003cp\u003eIt was dusk when they began their search blindly through all of Florin City. Dusk, a day before the wedding. Count Rugen was about to begin his nightly experiments at that dusk, gathering up his notebooks from his room, filled with all his jottings. Five levels underground, behind high castle walls, locked and chained and silent, Westley waited beside the Machine. In a way, he still looked like Westley, except, of course, that he had been broken. Twenty years of his life had been sucked away. Twenty were left. Pain was anticipation. Soon the Count would come again. Against any wishes he had left, Westley went on crying.\u003c/p\u003e\n\u003cp\u003eIt was dusk when Buttercup went to see the Prince. She knocked loudly, waited, knocked again. She could hear him shouting inside, and if it had not been so important, she would never have knocked the third time, but she did, and the door was yanked open, and the look of anger on his face immediately changed to the sweetest smile. “Beloved,” he said. “Come in. A moment more is all I need.” And he turned back to Yellin. “Look at her, Yellin. My bride-to-be. Has any man ever been so blessed?”\u003c/p\u003e\n\u003cp\u003eYellin shook his head.\u003c/p\u003e\n\u003cp\u003e“Am I wrong, do you think, to go to any lengths, then, to protect her?”\u003c/p\u003e\n\u003cp\u003eYellin shook his head again. The Prince was driving him crazy with his stories of the Guilder infiltration. Yellin had every spy he’d ever used working day and night and not one of them had come up with anything about Guilder. And yet the Prince insisted. Inwardly, Yellin sighed. It was beyond him; he was simply an enforcer, not a prince. In fact, the only remotely disturbing news he’d heard since he’d closed the Thieves Quarter that morning was within the hour, when someone told him of a rumor that the ship of the Dread Pirate Roberts had perhaps been seen sailing all the way into Florin Channel itself. But such a thing, Yellin knew from long experience, was, simply, rumor.\u003c/p\u003e\n\u003cp\u003e“I’ll tell you, they are everywhere, these Guilders,” the Prince went on. “And since you seem unable to stop them, I wish to change some plans. All the gates have been sealed to my castle except the front one, yes?”\u003c/p\u003e\n\u003cp\u003e“Yes. And twenty men guard it.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-101.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
