{"id":109082,"no":103,"title":"Page 103","content":"\u003cp\u003eMy father started to close the book.\u003c/p\u003e\n\u003cp\u003e‘I’m not fighting; please, don’t close it.’\u003c/p\u003e\n\u003cp\u003e‘It is not for that,’ he said, and then he looked at me for a long time. ‘Billy,’ he said (he almost never called me that; I loved it when he did; anybody else I hated it, but when the barber did it, I don’t know, I just melted), ‘Billy, do you trust me?’\u003c/p\u003e\n\u003cp\u003e‘What is that? Of course I do.’\u003c/p\u003e\n\u003cp\u003e‘Billy, you got pneumonia; you’re taking this book very serious, I know, because we already fought once about it.’\u003c/p\u003e\n\u003cp\u003e‘I’m not fighting any more—’\u003c/p\u003e\n\u003cp\u003e‘Listen to me—I never lied to you yet, did I? Okay. Trust me. I don’t want to read you the rest of this chapter and I want you to say it’s all right.’\u003c/p\u003e\n\u003cp\u003e‘Why? What happens in the rest of this chapter?’\u003c/p\u003e\n\u003cp\u003e‘If I tell you, I could accomplish the same by reading. Just say okay.’\u003c/p\u003e\n\u003cp\u003eI can’t say that until I know what happens.’\u003c/p\u003e\n\u003cp\u003e‘But—’\u003c/p\u003e\n\u003cp\u003e‘Tell me what happens and I’ll tell you if it’s okay and I promise if I don’t want to hear it, you can skip on to Inigo.’\u003c/p\u003e\n\u003cp\u003e‘But won’t do me this favor?’\u003c/p\u003e\n\u003cp\u003eI’ll sneak out of bed when you’re asleep; I don’t care where you hide the book, I’ll find it and I’ll read the rest of the chapter myself, so you might as well tell me.’\u003c/p\u003e\n\u003cp\u003e‘Billy, please?’\u003c/p\u003e\n\u003cp\u003eI gotcha; you might as well admit it.’\u003c/p\u003e\n\u003cp\u003eMy father sighed this terrible sound.\u003c/p\u003e\n\u003cp\u003eI knew I had him beaten then.\u003c/p\u003e\n\u003cp\u003e‘Westley dies,’ my father said.\u003c/p\u003e\n\u003cp\u003eI said, ‘What do you mean, “Westley dies”? You mean dies?’\u003c/p\u003e\n\u003cp\u003eMy father nodded. ‘Prince Humperdinck kills him.’\u003c/p\u003e\n\u003cp\u003e‘He’s only faking though, right?’\u003c/p\u003e\n\u003cp\u003eMy father shook his head, closed the book all the way.\u003c/p\u003e\n\u003cp\u003e‘Aw shit,’ I said and I started to cry.\u003c/p\u003e\n\u003cp\u003e‘I’m sorry,’ my father said. I’ll leave you alone,’ and he left me.\u003c/p\u003e\n\u003cp\u003e‘Who gets Humperdinck?’ I screamed after him.\u003c/p\u003e\n\u003cp\u003eHe stopped in the hall. I don’t understand.’\u003c/p\u003e\n\u003cp\u003e‘Who kills Prince Humperdinck? At the end, somebody’s got to get him. Is it Fezzik? Who?’\u003c/p\u003e\n\u003cp\u003e‘Nobody kills him. He lives.’\u003c/p\u003e\n\u003cp\u003e‘You mean he wins, Daddy? Jesus, what did you read me this thing for?’ and I buried my head in my pillow and I never cried like that again, not once to this day. I could feel almost my heart emptying into my pillow. I guess the most amazing thing about crying though is that when you’re in it, you think it’ll go on forever but it never really lasts half what you think. Not in terms of real time. In terms of real emotions, it’s worse than you think, but not by the clock. When my father came back, it couldn’t have been even an hour later.\u003c/p\u003e\n\u003cp\u003e‘So,’ he said, ‘shall we go on tonight or not?’\u003c/p\u003e\n\u003cp\u003e‘Shoot,’ I told him. Eyes dry, no catch in throat, nothing. ‘Fire when ready.’\u003c/p\u003e\n\u003cp\u003e‘With Inigo?’\u003c/p\u003e\n\u003cp\u003e‘Let’s hear the murder,’ I said. I knew I wasn’t about to bawl again. Like Buttercup’s, my heart was now a secret garden and the walls were very high.\u003c/p\u003e\n\u003cp\u003eHumperdinck screamed toward her then, ripping at her autumn hair, yanking her from her feet and down the long curving corridor to her room, where he tore that door open and threw her inside and locked her there and started running for the underground entrance to the Zoo of Death and down he plunged, giant stride after giant stride, and when he threw the door of the fifth-level cage open, even Count Rugen was startled at the purity of whatever the emotion was that was reflected in the Prince’s eyes. The Prince moved to Westley. “She loves you,” the Prince cried. “She loves you still and you love her, so think of that—think of this too: in all this world, you might have been happy, genuinely happy. Not one couple in a century has that chance, not really, no matter what the storybooks say, but you could have had it, and so, I would think, no one will ever suffer a loss as great as you” and with that he grabbed the dial and pushed it all the way forward and the Count cried, “Not to twenty!” but by then it was too late; the death scream had started. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-103.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
