{"id":109093,"no":116,"title":"Page 116","content":"\u003cp\u003e“All the drowners I returned—”\u003c/p\u003e\n\u003cp\u003e“Chance—”\u003c/p\u003e\n\u003cp\u003e“Valerie, we’ve been married eighty years; how can you do this to me?”\u003c/p\u003e\n\u003cp\u003e“Because true love is expiring and you haven’t got the decency to tell why you won’t help—well I do, and I say this, Prince Humperdinck was right to fire you—”\u003c/p\u003e\n\u003cp\u003e“Don’t say that name in my hut, Valerie—you made a pledge to me you’d never breathe that name—”\u003c/p\u003e\n\u003cp\u003e“Prince Humperdinck, Prince Humperdinck, Prince Humperdinck—at least he knows a phony when he sees one—”\u003c/p\u003e\n\u003cp\u003eMax fled toward the trap door, his hands going to his ears.\u003c/p\u003e\n\u003cp\u003e“But this is his fiancée’s true love,” Inigo said then. “If you bring him back to life, he will stop Prince Humperdinck’s marriage—”\u003c/p\u003e\n\u003cp\u003eMax’s hands left his ears. “This corpse here—he comes back to life, Prince Humperdinck suffers?”\u003c/p\u003e\n\u003cp\u003e“Humiliations galore,” Inigo said.\u003c/p\u003e\n\u003cp\u003e“Now that’s what I call a worth-while reason,” Miracle Max said. “Give me the sixty-five; I’m on the case.” He knelt beside Westley. “Hmmm,” he said.\u003c/p\u003e\n\u003cp\u003e“What?” Valerie said. She knew that tone.\u003c/p\u003e\n\u003cp\u003e“While you were doing all that talking, he’s slipped from sort of to mostly dead.”\u003c/p\u003e\n\u003cp\u003eValerie tapped Westley in a couple of places. “Stiffening,” she said. “You’ll have to work around that.”\u003c/p\u003e\n\u003cp\u003eMax did a few taps himself. “Do you suppose the oracle’s still up?”\u003c/p\u003e\n\u003cp\u003eValerie looked at the clock. “I don’t think so, it’s almost one. Besides, I don’t trust her all that much any more.”\u003c/p\u003e\n\u003cp\u003eMax nodded. “I know, but it would have been nice to have a little advance hint on whether this is gonna work or not.” He rubbed his eyes. “I’m tired going in; I wish I’d known in advance about the job; I’d have napped this afternoon.” He shrugged.\u003c/p\u003e\n\u003cp\u003e“Can’t be helped, down is down. Get me my Encyclopedia of Spells and the Hex Appendix.”\u003c/p\u003e\n\u003cp\u003e“I thought you knew all about this kind of thing,” Inigo said, starting to get upset himself now.\u003c/p\u003e\n\u003cp\u003e“I’m out of practice, retired; it’s been three years, you can’t mess around with these resurrection recipes; one little ingredient wrong, the whole thing blows up in your face.”\u003c/p\u003e\n\u003cp\u003e“Here’s the hex book and your glasses,” Valerie puffed, coming up the basement ladder. As Max began thumbing through, she turned to Inigo and Fezzik, who were hovering. “You can help,” she said.\u003c/p\u003e\n\u003cp\u003e“Anything,” Fezzik said.\u003c/p\u003e\n\u003cp\u003e“Tell us whatever’s useful. How long do we have for the miracle? If we work it—”\u003c/p\u003e\n\u003cp\u003e“When we work it,” Max said from his hex book. His voice was growing stronger.\u003c/p\u003e\n\u003cp\u003e“When we work it,” Valerie went on, “how long does it have to maintain full efficiency? Just exactly what’s going to be done?”\u003c/p\u003e\n\u003cp\u003e“Well, that’s hard to predict,” Inigo said, “since the first thing we have to do is storm the castle, and you never can be really sure how those things work out.”\u003c/p\u003e\n\u003cp\u003e“An hour pill should be about right,” Valerie said. “Either it’s going to be plenty or you’ll both be dead, so why not say an hour?”\u003c/p\u003e\n\u003cp\u003e“We’ll all three be fighting,” Inigo corrected. “And then once we’ve stormed the castle we have to stop the wedding, steal the Princess and make our escape, allowing space somewhere in there for me to duel Count Rugen.”\u003c/p\u003e\n\u003cp\u003eVisibly Valerie’s energy drained. She sat wearily down. “Max,” she said, tapping his shoulder. “No good.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-116.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
