{"id":109096,"no":119,"title":"Page 119","content":"\u003cp\u003e“They?” Yellin said, though he knew the answer.\u003c/p\u003e\n\u003cp\u003e“The Guilderians, of course.”\u003c/p\u003e\n\u003cp\u003e“But the wall where you suggest is the highest wall surrounding all of Florin Castle—it is fifty feet high at that point—so that would seem the least likely point of attack.” He was trying desperately to keep himself under control.\u003c/p\u003e\n\u003cp\u003e“All the more reason why they should choose this spot; besides, the world knows that the Guilderians are unsurpassed as climbers.”\u003c/p\u003e\n\u003cp\u003eYellin had never heard that. He had always thought the Swiss were the ones who were unsurpassed as climbers. “Highness,” he said, in one last attempt, “I have not yet, from a single spy, heard a single word about a single plot against the Princess.”\u003c/p\u003e\n\u003cp\u003e“I have it on unimpeachable authority that there will be an attempt made to strangle the Princess this very night.”\u003c/p\u003e\n\u003cp\u003e“In that case,” Yellin said, and he dropped to one knee and held out the envelope, “I must resign.” It was a difficult decision—the Yellins had headed enforcement in Florin for generations, and they took their work more than seriously. “I am not doing a capable job, sire; please forgive me and believe me when I say that my failures were those of the body and mind and not of the heart.”\u003c/p\u003e\n\u003cp\u003ePrince Humperdinck found himself, quite suddenly, in a genuine pickle, for once the war was finished, he needed someone to stay in Guilder and run it, since he couldn’t be in two places at once, and the only men he trusted were Yellin and the Count, and the Count would never take the job, being obsessed, as he was these days, with finishing his stupid Pain Primer. “I do not accept your resignation, you are doing a capable job, there is no plot, I shall slaughter the Queen myself this very evening, you shall run Guilder for me after the war, now get back on your feet.”\u003c/p\u003e\n\u003cp\u003eYellin didn’t know what to say. “Thank you” seemed so inadequate, but it was all he could come up with.\u003c/p\u003e\n\u003cp\u003e“Once the wedding is done with I shall send her here to make ready while I shall, with boots carefully procured in advance, make tracks leading from the wall to the bedroom and returning then from the bedroom to the wall. Since you are in charge of law enforcement, I expect you will not take long to verify my fears that the prints could only be made by the boots of Guilderian soldiers. Once we have that, we’ll need a royal proclamation or two, my father can resign as being unfit for battle, and you, dear Yellin, will soon be living in Guilder Castle.”\u003c/p\u003e\n\u003cp\u003eYellin knew a dismissal speech when he heard one. “I leave with no thought in my heart but to serve you.”\u003c/p\u003e\n\u003cp\u003e“Thank you,” Humperdinck said, pleased, because, after all, loyalty was one thing you couldn’t buy. And in that mood, he said to Yellin by the door, “And, oh, if you see the albino, tell him he may stand in the back for my wedding; it’s quite all right with me.”\u003c/p\u003e\n\u003cp\u003e“I will, Highness,” Yellin said, adding, “but I don’t know where my cousin is—I went looking for him less than an hour ago and he was nowhere to be found.”\u003c/p\u003e\n\u003cp\u003eThe Prince understood important news when he heard it because he wasn’t the greatest hunter in the world for nothing and, even more, because if there was one thing you could say about the albino it was that he was always to be found. “My God, you don’t suppose there is a plot, do you? It’s a perfect time; the country celebrates; if Guilder were about to be five hundred years old, I know I’d attack them.”\u003c/p\u003e\n\u003cp\u003e“I will rush to the gate and fight, to the death if necessary,” Yellin said.\u003c/p\u003e\n\u003cp\u003e“Good man,” the Prince called after him. If there was an attack, it would come at the busiest time, during the wedding, so he would have to move that up. State affairs went slowly, but, still, he had authority. Six o’clock was out. He would be married no later than half past five or know the reason why. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-119.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
