{"id":109104,"no":127,"title":"Page 127","content":"\u003cp\u003ePrince Humperdinck dove for his weapons, and a sword flashed in his thick hands. “To the death,” he said, advancing.\u003c/p\u003e\n\u003cp\u003eWestley gave a soft shake of his head. “No,” he corrected. “To the pain.”\u003c/p\u003e\n\u003cp\u003eIt was an odd phrase, and for the moment it brought the Prince up short. Besides, why was the fellow just lying there? Where was the trap? “I don’t think I quite understand that.”\u003c/p\u003e\n\u003cp\u003eWestley lay without moving but he was smiling more deeply now. “I’ll be only too delighted to explain.” It was 5:50 now. Twenty-five minutes of safety left. (There were five. He did not know that. How could he know that?) Slowly, carefully, he began to talk…\u003c/p\u003e\n\u003cp\u003eInigo was talking too. It was still 5:42 when he whispered, “I’m… sorry… Father…”\u003c/p\u003e\n\u003cp\u003eCount Rugen heard the words but nothing really connected until he saw the sword still held in Inigo’s hand. “You’re that little Spanish brat I taught a lesson to,” he said, coming closer now, examining the scars. “It’s simply incredible. Have you been chasing me all these years only to fail now? I think that’s the worst thing I ever heard of; how marvelous.”\u003c/p\u003e\n\u003cp\u003eInigo could say nothing. The blood fauceted from his stomach.\u003c/p\u003e\n\u003cp\u003eCount Rugen drew his sword.\u003c/p\u003e\n\u003cp\u003e“…sorry, Father… I’m sorry…”\u003c/p\u003e\n\u003cp\u003e‘I DON’t WANT YOUR “SORRY”! MY NAME IS DOMINGO MONTOYA AND I DIED FOR THAT SWORD AND YOU CAN KEEP YOUR “SORRY.” IF YOU WERE GOING TO FAIL, WHY DIDN’t YOU DIE YEARS AGO AND LET ME REST IN PEACE?’ And then MacPherson was after him too—“Spaniards! I never should have tried to teach a Spaniard; they’re dumb, they forget, what do you do with a wound? How many times did I teach you—what do you do with a wound?”\u003c/p\u003e\n\u003cp\u003e“Cover it…” Inigo said, and he pulled the knife from his body and stuffed his left fist into the bleeding.\u003c/p\u003e\n\u003cp\u003eInigo’s eyes began to focus again, not well, not perfectly, but enough to see the Count’s blade as it approached his heart, and Inigo couldn’t do much with the attack, parry it vaguely, push the point of the blade into his left shoulder where it did no unendurable harm.\u003c/p\u003e\n\u003cp\u003eCount Rugen was a bit surprised that his point had been deflected, but there was nothing wrong with piercing a helpless man’s shoulder. There was no hurry when you had him.\u003c/p\u003e\n\u003cp\u003eMacPherson was screaming again—“Spaniards! Give me a Polack anytime; at least the Polacks remember to use the wall when they have one; only the Spaniards would forget to use a wall—”\u003c/p\u003e\n\u003cp\u003eSlowly, inch by inch, Inigo forced his body up the wall, using his legs just for pushing, letting the wall do all the supporting that was necessary.\u003c/p\u003e\n\u003cp\u003eCount Rugen struck again, but for any number of reasons, most probably because he hadn’t expected the other man’s movement, he missed the heart and had to be content with driving his blade through the Spaniard’s left arm.\u003c/p\u003e\n\u003cp\u003eInigo didn’t mind. He didn’t even feel it. His right arm was where his interest lay, and he squeezed the handle and there was strength in his hand, enough to flick out at the enemy, and Count Rugen hadn’t expected that either, so he gave a little involuntary cry and took a step back to reassess the situation.\u003c/p\u003e\n\u003cp\u003ePower was flowing up from Inigo’s heart to his right shoulder and down from his shoulder to his fingers and then into the great six-fingered sword and he pushed off from the wall then, with a whispered, “…hello… my name is… Inigo Montoya; you killed… my father; prepare to die.”\u003c/p\u003e\n\u003cp\u003eAnd they crossed swords.\u003c/p\u003e\n\u003cp\u003eThe Count went for the quick kill, the inverse Bonetti.\u003c/p\u003e\n\u003cp\u003eNo chance.\u003c/p\u003e\n\u003cp\u003e“Hello… my name is Inigo Montoya; you killed my father… prepare to die…” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-127.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
