{"id":109105,"no":128,"title":"Page 128","content":"\u003cp\u003eAgain they crossed, and the Count moved into a Morozzo defense, because the blood was still streaming.\u003c/p\u003e\n\u003cp\u003eInigo shoved his fist deeper into himself. “Hello, my name is Inigo Montoya; you killed my father; prepare to die.”\u003c/p\u003e\n\u003cp\u003eThe Count retreated around the billiard table.\u003c/p\u003e\n\u003cp\u003eInigo slipped in his own blood.\u003c/p\u003e\n\u003cp\u003eThe Count continued to retreat, waiting, waiting.\u003c/p\u003e\n\u003cp\u003e“Hello, my name is Inigo Montoya; you killed my father; prepare to die.” He dug with his fist and he didn’t want to think what he was touching and pushing and holding into place but for the first time he felt able to try a move, so the six-fingered sword flashed forward—\u003c/p\u003e\n\u003cp\u003e—and there was a cut down one side of Count Rugen’s cheek—\u003c/p\u003e\n\u003cp\u003e—another flash—\u003c/p\u003e\n\u003cp\u003e—another cut, parallel, bleeding—\u003c/p\u003e\n\u003cp\u003e“Hello, my name is Inigo Montoya; you killed my father; prepare to die.”\u003c/p\u003e\n\u003cp\u003e“Stop saying that!” The Count was beginning to experience a decline of nerve.\u003c/p\u003e\n\u003cp\u003eInigo drove for the Count’s left shoulder, as the Count had wounded his. Then he went through the Count’s left arm, at the same spot the Count had penetrated his. “Hello.” Stronger now.\u003c/p\u003e\n\u003cp\u003e“Hello! HELLO. MY NAME IS INIGO MONTOYA. YOU KILLED MY FATHER. PREPARE TO DIE!”\u003c/p\u003e\n\u003cp\u003e“No—”\u003c/p\u003e\n\u003cp\u003e“Offer me money—”\u003c/p\u003e\n\u003cp\u003e“Everything,” the Count said.\u003c/p\u003e\n\u003cp\u003e“Power too. Promise me that.”\u003c/p\u003e\n\u003cp\u003e“All I have and more. Please.”\u003c/p\u003e\n\u003cp\u003e“Offer me anything I ask for.”\u003c/p\u003e\n\u003cp\u003e“Yes. Yes. Say it.”\u003c/p\u003e\n\u003cp\u003e“I WANT DOMINGO MONTOYA, YOU SON OF A BITCH,” and the six-fingered sword flashed again.\u003c/p\u003e\n\u003cp\u003eThe Count screamed.\u003c/p\u003e\n\u003cp\u003e“That was just to the left of your heart.” Inigo struck again.\u003c/p\u003e\n\u003cp\u003eAnother scream.\u003c/p\u003e\n\u003cp\u003e“That was below your heart. Can you guess what I’m doing?”\u003c/p\u003e\n\u003cp\u003e“Cutting my heart out.”\u003c/p\u003e\n\u003cp\u003e“You took mine when I was ten; I want yours now. We are lovers of justice, you and I—what could be more just than that?”\u003c/p\u003e\n\u003cp\u003eThe Count screamed one final time then fell dead of fear.\u003c/p\u003e\n\u003cp\u003eInigo looked down at him. The Count’s frozen face was petrified and ashen and the blood still poured down the parallel cuts. His eyes bulged wide, full of horror and pain. It was glorious. If you like that kind of thing.\u003c/p\u003e\n\u003cp\u003eInigo loved it.\u003c/p\u003e\n\u003cp\u003eIt was 5:50 when he staggered from the room, heading he knew not where or for how long, but hoping only that whoever had been guiding him lately would not desert him now…\u003c/p\u003e\n\u003cp\u003e“I’m going to tell you something once and then whether you die or not is strictly up to you,” Westley said, lying pleasantly on the bed. Across the room, the Prince held the sword high. “What I’m going to tell you is this: drop your sword, and if you do, then I will leave with this baggage here”—he glanced at Buttercup—“and you will be tied up but not fatally, and will soon be free to go about your business. And if you choose to fight, well, then, we will not both leave alive.”\u003c/p\u003e\n\u003cp\u003e“I expect to breathe a while,” the Prince said. “I think you are bluffing—you have been prisoner for months and I myself killed you less than a day ago, so I doubt that you have much might left in your arm.”\u003c/p\u003e\n\u003cp\u003e“Possibly true,” Westley agreed, “and when the moment comes, remember that: I might indeed be bluffing. I could, in fact, be lying right here because I lack the strength to stand. All that, weigh carefully.”\u003c/p\u003e\n\u003cp\u003e“You are only alive now because you said ‘to the pain.’ I want that phrase explained.”\u003c/p\u003e\n\u003cp\u003e“My pleasure.” It was 5:52 now. Three minutes left. He thought he had eighteen. He took a long pause, then started speaking. “Surely, you must have guessed I am no ordinary sailor. I am, in fact, Roberts himself.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-128.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
