{"id":109009,"no":20,"title":"Page 20","content":"\u003cp\u003e“Bring him to me.”\u003c/p\u003e\n\u003cp\u003e“He is not dressed properly for such an occasion,” Buttercup’s mother said.\u003c/p\u003e\n\u003cp\u003e“I have seen bare chests before,” the Countess replied. Then she called out: “You!” and pointed at the farm boy. “Come here.” Her fingers snapped on “here.”\u003c/p\u003e\n\u003cp\u003eThe farm boy did as he was told.\u003c/p\u003e\n\u003cp\u003eAnd when he was close, the Countess left the carriage.\u003c/p\u003e\n\u003cp\u003eWhen he was a few paces behind Buttercup, he stopped, head properly bowed. He was ashamed of his attire, worn boots and torn blue jeans (blue jeans were invented considerably before most people suppose), and his hands were tight together in almost a gesture of supplication.\u003c/p\u003e\n\u003cp\u003e“Have you a name, farm boy?”\u003c/p\u003e\n\u003cp\u003e“Westley, Countess.”\u003c/p\u003e\n\u003cp\u003e“Well, Westley, perhaps you can help us with our problem.” She crossed to him. The fabric of her gown grazed his skin. “We are all of us here passionately interested in the subject of cows. We are practically reaching the point of frenzy, such is our curiosity. Why, do you suppose, Westley, that the cows of this particular farm are the finest in all Florin. What do you do to them?”\u003c/p\u003e\n\u003cp\u003e“I just feed them, Countess.”\u003c/p\u003e\n\u003cp\u003e“Well then, there it is, the mystery is solved, the secret out; we can all rest. Clearly, the magic is in Westley’s feeding. Show me how you do it, would you, Westley?”\u003c/p\u003e\n\u003cp\u003e“Feed the cows for you, Countess?”\u003c/p\u003e\n\u003cp\u003e“Bright lad.”\u003c/p\u003e\n\u003cp\u003e“When?”\u003c/p\u003e\n\u003cp\u003e“Now will be soon enough,” and she held out her arm to him. “Lead me, Westley.”\u003c/p\u003e\n\u003cp\u003eWestley had no choice but to take her arm. Gently. “It’s behind the house, madam; it’s terribly muddy back there. Your gown will be ruined.”\u003c/p\u003e\n\u003cp\u003e“I wear them only once, Westley, and I burn to see you in action.”\u003c/p\u003e\n\u003cp\u003eSo off they went to the cowshed.\u003c/p\u003e\n\u003cp\u003eThroughout all this, the Count kept watching Buttercup.\u003c/p\u003e\n\u003cp\u003e“I’ll help you,” Buttercup called after Westley.\u003c/p\u003e\n\u003cp\u003e“Perhaps I’d best see just how he does it,” the Count decided.\u003c/p\u003e\n\u003cp\u003e“Strange things are happening,” Buttercup’s parents said, and off they went too, bringing up the rear of the cow-feeding trip, watching the Count, who was watching their daughter, who was watching the Countess.\u003c/p\u003e\n\u003cp\u003eWho was watching Westley.\u003c/p\u003e\n\u003cp\u003e“I couldn’t see what he did that was so special,” Buttercup’s father said. “He just fed them.” This was after dinner now, and the family was alone again.\u003c/p\u003e\n\u003cp\u003e“They must like him personally. I had a cat once that only bloomed when I fed him. Maybe it’s the same kind of thing.” Buttercup’s mother scraped the stew leavings into a bowl. “Here,” she said to her daughter. “Westley’s waiting by the back door; take him his dinner.”\u003c/p\u003e\n\u003cp\u003eButtercup carried the bowl, opened the back door.\u003c/p\u003e\n\u003cp\u003e“Take it,” she said.\u003c/p\u003e\n\u003cp\u003eHe nodded, accepted, started off to his tree stump to eat.\u003c/p\u003e\n\u003cp\u003e“I didn’t excuse you, Farm Boy,” Buttercup began. He stopped, turned back to her. “I don’t like what you’re doing with Horse. What you’re not doing with Horse is more to the point. I want him cleaned. Tonight. I want his hoofs varnished. Tonight. I want his tail plaited and his ears massaged. This very evening. I want his stables spotless. Now. I want him glistening, and if it takes you all night, it takes you all night.”\u003c/p\u003e\n\u003cp\u003e“As you wish.”\u003c/p\u003e\n\u003cp\u003eShe slammed the door and let him eat in darkness.\u003c/p\u003e\n\u003cp\u003e“I thought Horse had been looking very well, actually,” her father said.\u003c/p\u003e\n\u003cp\u003eButtercup said nothing.\u003c/p\u003e\n\u003cp\u003e“You yourself said so yesterday,” her mother reminded her. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-20.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
