{"id":109023,"no":35,"title":"Page 35","content":"\u003cp\u003e“The reason people think you’re so stupid,” the Sicilian said, “is because you are so stupid. It has nothing to do with your drooling.”\u003c/p\u003e\n\u003cp\u003eThere came the sound of a flapping of sail. “Watch your heads,” the Spaniard cautioned, and then the boat was moving. “The people of Florin will not take her death well, I shouldn’t think. She has become beloved.”\u003c/p\u003e\n\u003cp\u003e“There will be war,” the Sicilian agreed. “We have been paid to start it. It’s a fine line of work to be expert in. If we do this perfectly, there will be a continual demand for our services.”\u003c/p\u003e\n\u003cp\u003e“Well I don’t like it all that much,” the Spaniard said. “Frankly, I wish you had refused.”\u003c/p\u003e\n\u003cp\u003e“The offer was too high.”\u003c/p\u003e\n\u003cp\u003e“I don’t like killing a girl,” the Spaniard said.\u003c/p\u003e\n\u003cp\u003e“God does it all the time; if it doesn’t bother Him, don’t let it worry you.”\u003c/p\u003e\n\u003cp\u003eThrough all this, Buttercup had not moved.\u003c/p\u003e\n\u003cp\u003eThe Spaniard said, “Let’s just tell her we’re taking her away for ransom.”\u003c/p\u003e\n\u003cp\u003eThe Turk agreed. “She’s so beautiful and she’d go all crazy if she knew.”\u003c/p\u003e\n\u003cp\u003e“She knows already,” the Sicilian said. “She’s been awake for every word of this.”\u003c/p\u003e\n\u003cp\u003eButtercup lay under the blanket, not moving. How could he have known that, she wondered.\u003c/p\u003e\n\u003cp\u003e“How can you be sure?” the Spaniard asked.\u003c/p\u003e\n\u003cp\u003e“The Sicilian senses all,” the Sicilian said.\u003c/p\u003e\n\u003cp\u003eConceited, Buttercup thought.\u003c/p\u003e\n\u003cp\u003e“Yes, very conceited,” the Sicilian said.\u003c/p\u003e\n\u003cp\u003eHe must be a mind reader, Buttercup thought.\u003c/p\u003e\n\u003cp\u003e“Are you giving it full sail?” the Sicilian said.\u003c/p\u003e\n\u003cp\u003e“As much as is safe,” the Spaniard answered from the tiller.\u003c/p\u003e\n\u003cp\u003e“We have an hour on them, so no risks yet. It will take her horse perhaps twenty-seven minutes to reach the castle, a few minutes more for them to figure out what happened and, since we left an obvious trail, they should be after us within an hour. We should reach the Cliffs in fifteen minutes more and, with any luck at all, the Guilder frontier at dawn, when she dies. Her body should be quite warm when the Prince reaches her mutilated form. I only wish we could stay for his grief—it should be Homeric.”\u003c/p\u003e\n\u003cp\u003eWhy does he let me know his plans, Buttercup wondered.\u003c/p\u003e\n\u003cp\u003e“You are going back to sleep now, my lady,” the Spaniard said, and his fingers suddenly were touching her temple, her shoulder, her neck, and she was unconscious again…\u003c/p\u003e\n\u003cp\u003eButtercup did not know how long she was out, but they were still in the boat when she blinked, the blanket shielding her. And this time, without daring to think—the Sicilian would have known it somehow—she threw the blanket aside and dove deep into Florin Channel.\u003c/p\u003e\n\u003cp\u003eShe stayed under for as long as she dared and then surfaced, starting to swim across the moonless water with every ounce of strength remaining to her. Behind her in the darkness there were cries.\u003c/p\u003e\n\u003cp\u003e“Go in, go in!” from the Sicilian.\u003c/p\u003e\n\u003cp\u003e“I only dog paddle” from the Turk.\u003c/p\u003e\n\u003cp\u003e“You’re better than I am” from the Spaniard.\u003c/p\u003e\n\u003cp\u003eButtercup continued to leave them behind her. Her arms ached from effort but she gave them no rest. Her legs kicked and her heart pounded.\u003c/p\u003e\n\u003cp\u003e“I can hear her kicking,” the Sicilian said. “Veer left.”\u003c/p\u003e\n\u003cp\u003eButtercup went into her breast stroke, silently swimming away.\u003c/p\u003e\n\u003cp\u003e“Where is she?” shrieked the Sicilian.\u003c/p\u003e\n\u003cp\u003e“The sharks will get her, don’t worry,” cautioned the Spaniard.\u003c/p\u003e\n\u003cp\u003eOh dear, I wish you hadn’t mentioned that, thought Buttercup.\u003c/p\u003e\n\u003cp\u003e“Princess,” the Sicilian called, “do you know what happens to sharks when they smell blood in the water? They go mad. There is no controlling their wildness. They rip and shred and chew and devour, and I’m in a boat, Princess, and there isn’t any blood in the water now, so we’re both quite safe, but there is a knife in my hand, my lady, and if you don’t come back I’ll cut my arms and I’ll cut my legs and I’ll catch the blood in a cup and I’ll fling it as far as I can and sharks can smell blood in the water for miles and you won’t be beautiful for long.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-35.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
