{"id":109026,"no":38,"title":"Page 38","content":"\u003cp\u003e“It is the angle we’re looking from and nothing more,” said the Sicilian.\u003c/p\u003e\n\u003cp\u003eButtercup could not take her eyes from the great black sail. Surely the three men she was with frightened her. But somehow, for reasons she could never begin to explain, the man in black frightened her more.\u003c/p\u003e\n\u003cp\u003e“All right, look sharp,” the Sicilian said then, just a drop of edginess in his voice.\u003c/p\u003e\n\u003cp\u003eThe Cliffs of Insanity were very close now.\u003c/p\u003e\n\u003cp\u003eThe Spaniard maneuvered the craft expertly, which was not easy, and the waves were rolling in toward the rocks now and the spray was blinding. Buttercup shielded her eyes and put her head straight back, staring up into the darkness toward the top, which seemed shrouded and out of reach.\u003c/p\u003e\n\u003cp\u003eThen the humpback bounded forward, and as the ship reached the cliff face, he jumped up and suddenly there was a rope in his hand.\u003c/p\u003e\n\u003cp\u003eButtercup stared in silent astonishment. The rope, thick and strong, seemed to travel all the way up the Cliffs. As she watched, the Sicilian pulled at the rope again and again and it held firm. It was attached to something at the top—a giant rock, a towering tree, something.\u003c/p\u003e\n\u003cp\u003e“Fast now,” the Sicilian ordered. “If he is following us, which of course is not within the realm of human experience, but if he is, we’ve got to reach the top and cut the rope off before he can climb up after us.”\u003c/p\u003e\n\u003cp\u003e“Climb?” Buttercup said. “I would never be able to—”\u003c/p\u003e\n\u003cp\u003e“Hush!” the Sicilian ordered her. “Get ready!” he ordered the Spaniard. “Sink it,” he ordered the Turk.\u003c/p\u003e\n\u003cp\u003eAnd then everyone got busy. The Spaniard took a rope, tied Buttercup’s hands and feet. The Turk raised a great leg and stomped down at the center of the boat, which gave way immediately and began to sink. Then the Turk went to the rope and took it in his hands.\u003c/p\u003e\n\u003cp\u003e“Load me,” the Turk said.\u003c/p\u003e\n\u003cp\u003eThe Spaniard lifted Buttercup and draped her body around the Turk’s shoulders. Then he tied himself to the Turk’s waist. Then the Sicilian hopped, clung to the Turk’s neck.\u003c/p\u003e\n\u003cp\u003e“All aboard,” the Sicilian said. (This was before trains, but the expression comes originally from carpenters loading lumber, and this was well after carpenters.)\u003c/p\u003e\n\u003cp\u003eWith that the Turk began to climb. It was at least a thousand feet and he was carrying the three, but he was not worried. When it came to power, nothing worried him. When it came to reading, he got knots in the middle of his stomach, and when it came to writing, he broke out in a cold sweat, and when addition was mentioned or, worse, long division, he always changed the subject right away.\u003c/p\u003e\n\u003cp\u003eBut strength had never been his enemy. He could take the kick of a horse on his chest and not fall backward. He could take a hundred-pound flour sack between his legs and scissor it open without thinking. He had once held an elephant aloft using only the muscles in his back.\u003c/p\u003e\n\u003cp\u003eBut his real might lay in his arms. There had never, not in a thousand years, been arms to match Fezzik’s. (For that was his name.) The arms were not only Gargantuan and totally obedient and surprisingly quick, but they were also, and this is why he never worried, tireless. If you gave him an ax and told him to chop down a forest, his legs might give out from having to support so much weight for so long, or the ax might shatter from the punishment of killing so many trees, but Fezzik’s arms would be as fresh tomorrow as today.\u003c/p\u003e\n\u003cp\u003eAnd so, even with the Sicilian on his neck and the Princess around his shoulders and the Spaniard at his waist, Fezzik did not feel in the least bit put upon. He was actually quite happy, because it was only when he was requested to use his might that he felt he wasn’t a bother to everybody.\u003c/p\u003e\n\u003cp\u003eUp he climbed, arm over arm, arm over arm, two hundred feet now above the water, eight hundred feet now to go. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-38.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
