{"id":109033,"no":46,"title":"Page 46","content":"\u003cp\u003e“I’ll take the sword,” the nobleman said. “I didn’t say I wouldn’t take it. I only said I would pay what it was worth.”\u003c/p\u003e\n\u003cp\u003eDomingo whirled back, eyes bright. “You quibbled. You haggled. Art was involved and you saw only money. Beauty was here for the taking and you saw only your fat purse. You have lost nothing; there is no more reason for your remaining here. Please go.”\u003c/p\u003e\n\u003cp\u003e“The sword,” the noble said.\u003c/p\u003e\n\u003cp\u003e“The sword belongs to my son,” Domingo said. “I give it to him now. It is forever his. Good-by.”\u003c/p\u003e\n\u003cp\u003e“You’re a peasant and a fool and I want my sword.”\u003c/p\u003e\n\u003cp\u003e“You’re an enemy of art and I pity your ignorance,” Domingo said.\u003c/p\u003e\n\u003cp\u003eThey were the last words he ever uttered.\u003c/p\u003e\n\u003cp\u003eThe noble killed him then, with no warning; a flash of the nobleman’s sword and Domingo’s heart was torn to pieces.\u003c/p\u003e\n\u003cp\u003eInigo screamed. He could not believe it; it had not happened. He screamed again. His father was fine; soon they would have tea. He could not stop screaming.\u003c/p\u003e\n\u003cp\u003eThe village heard. Twenty men were at the door. The nobleman pushed his way through them. “That man attacked me. See? He holds a sword. He attacked me and I defended myself. Now move from my way.”\u003c/p\u003e\n\u003cp\u003eIt was lies, of course, and everyone knew it. But he was a noble so what was there to do? They parted, and the nobleman mounted his horse.\u003c/p\u003e\n\u003cp\u003e“Coward!”\u003c/p\u003e\n\u003cp\u003eThe nobleman whirled.\u003c/p\u003e\n\u003cp\u003e“Pig!”\u003c/p\u003e\n\u003cp\u003eAgain the crowd parted.\u003c/p\u003e\n\u003cp\u003eInigo stood there, holding the six-fingered sword, repeating his words: “Coward. Pig. Killer.”\u003c/p\u003e\n\u003cp\u003e“Someone tend the babe before he oversteps himself,” the noble said to the crowd.\u003c/p\u003e\n\u003cp\u003eInigo ran forward then, standing in front of the nobleman’s horse, blocking the nobleman’s path. He raised the six-fingered sword with both his hands and cried, “I, Inigo Montoya, do challenge you, coward, pig, killer, ass, fool, to battle.”\u003c/p\u003e\n\u003cp\u003e“Get him out of my way. Move the infant.”\u003c/p\u003e\n\u003cp\u003e“The infant is ten and he stays,” Inigo said.\u003c/p\u003e\n\u003cp\u003e“Enough of your family is dead for one day; be content,” said the noble.\u003c/p\u003e\n\u003cp\u003e“When you beg me for your breath, then I shall be contented. Now dismount!”\u003c/p\u003e\n\u003cp\u003eThe nobleman dismounted.\u003c/p\u003e\n\u003cp\u003e“Draw your sword.”\u003c/p\u003e\n\u003cp\u003eThe nobleman unsheathed his killing weapon.\u003c/p\u003e\n\u003cp\u003e“I dedicate your death to my father,” Inigo said. “Begin.”\u003c/p\u003e\n\u003cp\u003eThey began.\u003c/p\u003e\n\u003cp\u003eIt was no match, of course. Inigo was disarmed in less than a minute. But for the first fifteen seconds or so, the noble was uneasy. During those fifteen seconds, strange thoughts crossed his mind. For even at the age of ten, Inigo’s genius was there.\u003c/p\u003e\n\u003cp\u003eDisarmed, Inigo stood very straight. He said not a word, begged nothing.\u003c/p\u003e\n\u003cp\u003e“I’m not going to kill you,” the nobleman said. “Because you have talent and you’re brave. But you’re also lacking in manners, and that’s going to get you in trouble if you’re not careful. So I shall help you as you go through life, by leaving you with a reminder that bad manners are to be avoided.” And with that his blade flashed. Two times.\u003c/p\u003e\n\u003cp\u003eAnd Inigo’s face began to bleed. Two rivers of blood poured from his forehead to his chin, one crossing each cheek. Everyone watching knew it then: the boy was scarred for life.\u003c/p\u003e\n\u003cp\u003eInigo would not fall. The world went white behind his eyes but he would not go to ground. The blood continued to pour. The nobleman replaced his sword, remounted, rode on.\u003c/p\u003e\n\u003cp\u003eIt was only then that Inigo allowed the darkness to claim him.\u003c/p\u003e\n\u003cp\u003eHe awoke to Yeste’s face.\u003c/p\u003e\n\u003cp\u003e“I was beaten,” Inigo whispered. “I failed him.”\u003c/p\u003e\n\u003cp\u003eYeste could only say, “Sleep.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-46.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
