{"id":109034,"no":47,"title":"Page 47","content":"\u003cp\u003eInigo slept. The bleeding stopped after a day and the pain stopped after a week. They buried Domingo, and for the first and last time Inigo left Arabella. His face bandaged, he rode in Yeste’s carriage to Madrid, where he lived in Yeste’s house, obeyed Yeste’s commands. After a month, the bandages were removed, but the scars were still deep red. Eventually, they softened some, but they always remained the chief features of Inigo’s face: the giant parallel scars running one on each side, from temple to chin. For two years, Yeste cared for him.\u003c/p\u003e\n\u003cp\u003eThen one morning, Inigo was gone. In his place were three words: “I must learn” on a note pinned to his pillow.\u003c/p\u003e\n\u003cp\u003eLearn? Learn what? What existed beyond Madrid that the child had to commit to memory? Yeste shrugged and sighed. It was beyond him. There was no understanding children any more. Everything was changing too fast and the young were different. Beyond him, beyond him, life was beyond him, the world was beyond him, you name it, it was beyond him. He was a fat man who made swords. That much he knew.\u003c/p\u003e\n\u003cp\u003eSo he made more swords and he grew fatter and the years went by. As his figure spread, so did his fame. From all across the world they came, begging him for weapons, so he doubled his prices because he didn’t want to work too hard any more, he was getting old, but when he doubled his prices, when the news spread from duke to prince to king, they only wanted him the more desperately. Now the wait was two years for a sword and the line-up of royalty was unending and Yeste was growing tired, so he doubled his prices again, and when that didn’t stop them, he decided to triple his already doubled and redoubled prices and besides that, all work had to be paid for in jewels in advance and the wait was up to three years, but nothing would stop them. They had to have swords by Yeste or nothing, and even though the work on the finest was nowhere what it once was (Domingo, after all, no longer could save him) the silly rich men didn’t notice. All they wanted was his weapons and they fell over each other with jewels for him.\u003c/p\u003e\n\u003cp\u003eYeste grew very rich.\u003c/p\u003e\n\u003cp\u003eAnd very heavy.\u003c/p\u003e\n\u003cp\u003eEvery part of his body sagged. He had the only fat thumbs in Madrid. Dressing took an hour, breakfast the same, everything went slowly.\u003c/p\u003e\n\u003cp\u003eBut he could still make swords. And people still craved them. “I’m sorry,” he said to the young Spaniard who entered his shop one particular morning. “The wait is up to four years and even I am embarrassed to mention the price. Have your weapon made by another.”\u003c/p\u003e\n\u003cp\u003e“I have my weapon,” the Spaniard said.\u003c/p\u003e\n\u003cp\u003eAnd he threw the six-fingered sword across Yeste’s workbench.\u003c/p\u003e\n\u003cp\u003eSuch embraces.\u003c/p\u003e\n\u003cp\u003e“Never leave again,” Yeste said. “I eat too much when I’m lonely.”\u003c/p\u003e\n\u003cp\u003e“I cannot stay,” Inigo told him. “I’m only here to ask you one question. As you know, I have spent the last ten years learning. Now I have come for you to tell me if I’m ready.”\u003c/p\u003e\n\u003cp\u003e“Ready? For what? What in the world have you been learning?”\u003c/p\u003e\n\u003cp\u003e“The sword.”\u003c/p\u003e\n\u003cp\u003e“Madness,” said Yeste. “You have spent ten entire years just learning to fence?”\u003c/p\u003e\n\u003cp\u003e“No, not just learning to fence,” Inigo answered. “I did many other things as well.”\u003c/p\u003e\n\u003cp\u003e“Tell me.”\u003c/p\u003e\n\u003cp\u003e“Well,” Inigo began, “ten years is what? About thirty-six hundred days. And that’s about—I figured this out once, so I remember pretty well—about eighty-six thousand hours. Well, I always made it a point to get four hours sleep per night. That’s fourteen thousand hours right there, leaving me perhaps seventy-two thousand hours to account for.”\u003c/p\u003e\n\u003cp\u003e“You slept. I’m with you. What else?”\u003c/p\u003e\n\u003cp\u003e“Well, I squeezed rocks.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-47.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
