{"id":109035,"no":48,"title":"Page 48","content":"\u003cp\u003e“I’m sorry, my hearing sometimes fails me; it sounded like you said you squeezed rocks.”\u003c/p\u003e\n\u003cp\u003e“To make my wrists strong. So I could control the sword. Rocks like apples. That size. I would squeeze them in each hand for perhaps two hours a day. And I would spend another two hours a day in skipping and dodging and moving quickly, so that my feet would be able to get me into position to deliver properly the thrust of the sword. That’s another fourteen thousand hours. I’m down to fifty-eight thousand now. Well, I always sprinted two hours each day as fast as I could, so my legs, as well as being quick, would also be strong. And that gets me down to about fifty thousand hours.”\u003c/p\u003e\n\u003cp\u003eYeste examined the young man before him. Blade thin, six feet in height, straight as a sapling, bright eyed, taut; even motionless he seemed whippet quick. “And these last fifty thousand hours? These have been spent studying the sword?”\u003c/p\u003e\n\u003cp\u003eInigo nodded.\u003c/p\u003e\n\u003cp\u003e“Where?”\u003c/p\u003e\n\u003cp\u003e“Wherever I could find a master. Venice, Bruges, Budapest.”\u003c/p\u003e\n\u003cp\u003e“I could have taught you here?”\u003c/p\u003e\n\u003cp\u003e“True. But you care for me. You would not have been ruthless. You would have said, ‘Excellent parry, Inigo, now that’s enough for one day; let’s have supper.’”\u003c/p\u003e\n\u003cp\u003e“That does sound like me,” Yeste admitted. “But why was it so important? Why was it worth so much of your life?”\u003c/p\u003e\n\u003cp\u003e“Because I could not fail him again.”\u003c/p\u003e\n\u003cp\u003e“Fail who?”\u003c/p\u003e\n\u003cp\u003e“My father. I have spent all these years preparing to find the six-fingered man and kill him in a duel. But he is a master, Yeste. He said as much and I saw the way his sword flew at Domingo. I must not lose that duel when I find him, so now I have come to you. You know swords and swordsmen. You must not lie. Am I ready? If you say I am, I will seek him through the world. If you say no, I will spend another ten years and another ten after that, if that is needed.”\u003c/p\u003e\n\u003cp\u003eSo they went to Yeste’s courtyard. It was late morning. Hot. Yeste put his body in a chair and the chair in the shade. Inigo stood waiting in the sunshine. “We need not test desire and we know you have sufficient motive to deliver the death blow,” Yeste said. “Therefore we need only probe your knowledge and speed and stamina. We need no enemy for this. The enemy is always in the mind. Visualize him.”\u003c/p\u003e\n\u003cp\u003eInigo drew his sword.\u003c/p\u003e\n\u003cp\u003e“The six-fingered man taunts you,” Yeste called. “Do what you can.”\u003c/p\u003e\n\u003cp\u003eInigo began to leap around the courtyard, the great blade flashing.\u003c/p\u003e\n\u003cp\u003e“He uses the Agrippa defense,” Yeste shouted.\u003c/p\u003e\n\u003cp\u003eImmediately, Inigo shifted position, increased the speed of his sword.\u003c/p\u003e\n\u003cp\u003e“Now he surprises you with Bonetti’s attack.”\u003c/p\u003e\n\u003cp\u003eBut Inigo was not surprised for long. Again his feet shifted; he moved his body a different way. Perspiration was pouring down his thin frame now and the great blade was blinding. Yeste continued to shout. Inigo continued to shift. The blade never stopped.\u003c/p\u003e\n\u003cp\u003eAt three in the afternoon, Yeste said, “Enough. I am exhausted from the watching.”\u003c/p\u003e\n\u003cp\u003eInigo sheathed the six-fingered sword and waited.\u003c/p\u003e\n\u003cp\u003e“You wish to know if I feel you are ready to duel to the death a man ruthless enough to kill your father, rich enough to buy protection, older and more experienced, an acknowledged master.”\u003c/p\u003e\n\u003cp\u003eInigo nodded.\u003c/p\u003e\n\u003cp\u003e“I’ll tell you the truth, and it’s up to you to live with it. First, there has never been a master as young as you. Thirty years at least before that rank has yet been reached, and you are barely twenty-two. Well, the truth is you are an impetuous boy driven by madness and you are not now and you will never be a master.”\u003c/p\u003e\n\u003cp\u003e“Thank you for your honesty,” Inigo said. “I must tell you I had hoped for better news. I find it very hard to speak just now, so if you’ll please excuse me, I’ll be on my—” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-48.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
