{"id":109036,"no":49,"title":"Page 49","content":"\u003cp\u003e“I had not finished,” Yeste said.\u003c/p\u003e\n\u003cp\u003e“What else is there to say?”\u003c/p\u003e\n\u003cp\u003e“I loved your father very dearly, that you know, but this you did not know: when we were very young, not yet twenty, we saw, with our own eyes, an exhibition by the Corsican Wizard, Bastia.”\u003c/p\u003e\n\u003cp\u003e“I know of no wizards.”\u003c/p\u003e\n\u003cp\u003e“It is the rank beyond master in swordsmanship,” Yeste said. “Bastia was the last man so designated. Long before your birth, he died at sea. There have been no wizards since, and you would never in this world have beaten him. But I tell you this: he would never in this world have beaten you.”\u003c/p\u003e\n\u003cp\u003eInigo stood silent for a long time. “I am ready then.”\u003c/p\u003e\n\u003cp\u003e“I would not enjoy being the six-fingered man” was all Yeste replied.\u003c/p\u003e\n\u003cp\u003eThe next morning, Inigo began the track-down. He had it all carefully prepared in his mind. He would find the six-fingered man. He would go up to him. He would say simply, “Hello, my name is Inigo Montoya, you killed my father, prepare to die,” and then, oh then, the duel.\u003c/p\u003e\n\u003cp\u003eIt was a lovely plan really. Simple, direct. No frills. In the beginning, Inigo had all kinds of wild vengeance notions, but gradually, simplicity had seemed the better way. Originally, he had all kinds of little plays worked out in his mind—the enemy would weep and beg, the enemy would cringe and cry, the enemy would bribe and slobber and act in every way unmanly. But eventually, these too gave way in his mind to simplicity: the enemy would simply say, “Oh, yes, I remember killing him; I’ll be only too delighted to kill you too.”\u003c/p\u003e\n\u003cp\u003eInigo had only one problem: he could not find the enemy.\u003c/p\u003e\n\u003cp\u003eIt never occurred to him there would be the least difficulty. After all, how many noblemen were there with six fingers on their right hands? Surely, it would be the talk of whatever his vicinity happened to be. A few questions: “Pardon, I’m not crazy, but have you seen any six-fingered noblemen lately?” and surely, sooner or later, there would be an answering “yes.”\u003c/p\u003e\n\u003cp\u003eBut it didn’t come sooner.\u003c/p\u003e\n\u003cp\u003eAnd later wasn’t the kind of thing you wanted to hold your breath for either.\u003c/p\u003e\n\u003cp\u003eThe first month wasn’t all that discouraging. Inigo criss-crossed Spain and Portugal. The second month he moved to France and spent the rest of the year there. The year following that was his Italian year, and then came Germany and the whole of Switzerland.\u003c/p\u003e\n\u003cp\u003eIt was only after five solid years of failure that he began to worry. By then he had seen all of the Balkans and most of Scandinavia and had visited the Florinese and the natives of Guilder and into Mother Russia and down step by step around the entire Mediterranean.\u003c/p\u003e\n\u003cp\u003eBy then he knew what had happened: ten years learning was ten years too long; too much had been allowed to happen. The six-fingered man was probably crusading in Asia. Or getting rich in America. Or a hermit in the East Indies. Or… or…\u003c/p\u003e\n\u003cp\u003eDead?\u003c/p\u003e\n\u003cp\u003eInigo, at the age of twenty-seven, began having a few extra glasses of wine at night, to help him get to sleep. At twenty-eight, he was having a few extra glasses to help him digest his lunch. At twenty-nine, the wine was essential to wake him in the morning. His world was collapsing around him. Not only was he living in daily failure, something almost as dreadful was beginning to happen:\u003c/p\u003e\n\u003cp\u003eFencing was beginning to bore him.\u003c/p\u003e\n\u003cp\u003eHe was simply too good. He would make his living during his travels by finding the local champion wherever he happened to be, and they would duel, and Inigo would disarm him and accept whatever they happened to bet. And with his winnings he would pay for his food and his lodging and his wine.\u003c/p\u003e\n\u003cp\u003eBut the local champions were nothing. Even in the big cities, the local experts were nothing. Even in the capital cities, the local masters were nothing. There was no competition, nothing to help him keep an edge. His life began to seem pointless, his quest pointless, everything, everything, without reason. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-49.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
