{"id":108996,"no":6,"title":"Page 6","content":"\u003cp\u003e“Princess. By S. Morgenstern. It’s a kids’ classic. Tell him I’ll quiz him on it when I’m back next week and that he doesn’t have to like it or anything, but if he doesn’t, tell him I’ll kill myself. Give him that message exactly please; I wouldn’t want to apply any extra pressure or anything.”\u003c/p\u003e\n\u003cp\u003e“Kiss me, my fool.”\u003c/p\u003e\n\u003cp\u003e“Mmmm-wah.”\u003c/p\u003e\n\u003cp\u003e“No starlets now.” This was always her sign-off line when I was alone and on the loose in sunny California.\u003c/p\u003e\n\u003cp\u003e“They’re extinct, dummy.” That was mine. We hung up.\u003c/p\u003e\n\u003cp\u003eNow the next afternoon, it so happened, from somewhere, there actually appeared a living, sun-tanned, breathing-deeply starlet. I’m lolling by the pool and she moves by in a bikini and she is gorgeous. I’m free for the afternoon, I don’t know a soul, so I start playing a game about how can I approach this girl so she won’t laugh out loud. I never do anything, but ogling is great exercise and I am a major-league girl watcher. I can’t come up with any approach that connects with reality, so I start to swim my laps. I swim a quarter-mile a day because I have a bad disc at the base of my spine.\u003c/p\u003e\n\u003cp\u003eUp and back, up and back, eighteen laps, and when I’m done, I’m hanging on in the deep end, panting away, and over swims this starlet. She hangs on the ledge in the deep end too, maybe all of six inches away, hair all wet and glistening and the body’s under water but you know it’s there and she says (this happened now), “Pardon me, but aren’t you the William Goldman who wrote Boys and Girls Together? That’s, like, my favorite book in all the world.”\u003c/p\u003e\n\u003cp\u003eI clutch the ledge and nod; I don’t remember what I said exactly. (Lie: I remember exactly what I said, except it’s too goonlike to put it down; ye gods, I’m forty years old. “Goldman, yes Goldman, I’m Goldman.” It came out like all in one word, so there’s no telling what language she thought I was responding in.)\u003c/p\u003e\n\u003cp\u003e“I’m Sandy Sterling,” she said. “Hi.”\u003c/p\u003e\n\u003cp\u003e“Hi, Sandy Sterling,” I got out, which was pretty suave, suave for me anyway; I’d say it again if the same situation came up.\u003c/p\u003e\n\u003cp\u003eThen my name was paged. “The Zanucks won’t leave me alone,” I say, and she breaks out laughing and I hurry to the phone thinking was it really all that clever, and by the time I get there I decide yes it was, and into the receiver I say that, “Clever.” Not “hello.” Not “Bill Goldman.” “Clever” is what I say.\u003c/p\u003e\n\u003cp\u003e“Did you say ‘clever,’ Willy?” It’s Helen.\u003c/p\u003e\n\u003cp\u003e“I’m in a story conference, Helen, and we’re speaking tonight at suppertime. Why are you calling at lunch for?”\u003c/p\u003e\n\u003cp\u003e“Hostile, hostile.”\u003c/p\u003e\n\u003cp\u003eNever argue with your wife about hostility when she’s a certified Freudian. “It’s just they’re driving me crazy with stupid notions in this story conference. What’s up?”\u003c/p\u003e\n\u003cp\u003e“Nothing, probably, except the Morgenstern’s out of print. I’ve checked with Doubleday’s too. You sounded kind of like it might be important so I’m just letting you know Jason will have to be satisfied with his very fitting ten-speed machine.”\u003c/p\u003e\n\u003cp\u003e“Not important,” I said. Sandy Sterling was smiling. From the deep end. Straight at me. “Thanks though anyway.” I was about to hang up, then I said, “Well, as long as you’ve gone this far, call Argosy on Fifty-ninth Street. They specialize in out-of-print stuff.”\u003c/p\u003e\n\u003cp\u003e“Argosy. Fifty-ninth. Got it. Talk to you at supper.” She hung up.\u003c/p\u003e\n\u003cp\u003eWithout saying “No starlets now.” Every call she ends with that and now she doesn’t. Could I have given it away by something in my tone? Helen’s very spooky about that, being a shrink and all. Guilt, like pudding, began bubbling on the back burner. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-6.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
