{"id":109071,"no":90,"title":"Page 90","content":"\u003cp\u003e“I’ll do what I can, sweet lady, but first it might help if I knew just a bit about him. Is he really so wonderful, this Westley of yours?”\u003c/p\u003e\n\u003cp\u003e“Not so much wonderful as perfect,” she replied. “Kind of flawless. More or less magnificent. Without blemish. Rather on the ideal side.” She looked at the Prince. “Am I being helpful?”\u003c/p\u003e\n\u003cp\u003e“I think emotions are clouding your objectivity just a bit. Do you actually think that there is nothing the fellow can’t do?”\u003c/p\u003e\n\u003cp\u003eButtercup thought for a while. “It’s not so much that there’s nothing he can’t do; it’s more that he can do it all better than anybody else can do it.”\u003c/p\u003e\n\u003cp\u003eThe Prince chuckled and smiled. “In other words, for example, you mean if he wanted to hunt, he could outhunt, again for example, someone such as myself.”\u003c/p\u003e\n\u003cp\u003e“Oh, I would think if he wanted to, he could, quite easily, but he happens not to like hunting, at least to my knowledge, though maybe he does; I don’t know. I never knew he was so interested in mountain climbing but he scaled the Cliffs of Insanity under most adverse conditions, and everyone agrees that that is not the easiest thing in the world to accomplish.”\u003c/p\u003e\n\u003cp\u003e“Well, why don’t we just begin our letter with ‘Divine Westley,’ and appeal to his sense of modesty,” the Prince suggested.\u003c/p\u003e\n\u003cp\u003eButtercup began to write, stopped. “Does ‘divine’ begin de or di?”\u003c/p\u003e\n\u003cp\u003e“Di, I believe, amazing creature,” the Prince replied, smiling gently as Buttercup commenced the letter. They composed it in four hours, and many many times she said, “I could never get through this without you” and the Prince was always most modest, asking little helpful personal questions about Westley as often as was possible without drawing attention to it, and in this way, well before dawn, she told him, smiling as she remembered, of Westley’s early fears of Spinning Ticks.\u003c/p\u003e\n\u003cp\u003eAnd that night, in the fifth-level cage, the Prince asked, as he was to always ask, “Tell me the name of the man in Guilder who hired you to kidnap the Princess and I promise you immediate freedom” and Westley replied, as he was always to reply, “No one, no one; I was alone” and the Count, who had spent the day getting the Spinners ready, placed them carefully on Westley’s skin and Westley closed his eyes and begged and pleaded and after an hour or so the Prince and Count left, the albino remaining behind with the chore of burning the Spinners and then pulling them free from Westley, lest they accidentally poison him, and on the way up the underground stairs to ground level the Prince said, just for conversation’s sake, “Much better, don’t you think?”\u003c/p\u003e\n\u003cp\u003eThe Count, oddly, said nothing.\u003c/p\u003e\n\u003cp\u003eWhich was vaguely irritating to Humperdinck because, to tell the absolute truth, torture was never all that high on his scale of passions, and he would just as soon have disposed of Westley right then.\u003c/p\u003e\n\u003cp\u003eIf only Buttercup would admit that he, Humperdinck, was the better man.\u003c/p\u003e\n\u003cp\u003eBut she would not! She simply would not! All she ever talked about was Westley. All she ever asked about was news of Westley. Days went by, weeks went by, party after party went by, and all Florin was moved by the spectacle of their great hunting Prince at last so clearly and wonderfully in love, but when they were alone, all she ever said was, “I wonder where could Westley be? What could be taking him so long? How can I live until he comes?”\u003c/p\u003e\n\u003cp\u003eMaddening. So each night, the Count’s discomforts, which made Westley writhe and twist, were really sort of all right. The Prince would manage an hour or so of spectating before he and the Count would leave, the Count still oddly silent. And down below, tending the wounds, the albino would whisper: “Tell them. Please. They will only add to your suffering.”\u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-90.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
