{"id":109074,"no":94,"title":"Page 94","content":"\u003cp\u003eWestley found the whole thing fascinating. He made a little groan.\u003c/p\u003e\n\u003cp\u003e“I think pain is the most underrated emotion available to us,” the Count said. “The Serpent, to my interpretation, was pain. Pain has been with us always, and it always irritates me when people say ‘as important as life and death’ because the proper phrase, to my mind, should be, ‘as important as pain and death.’” The Count fell silent for a time then, as he began and completed a series of complex adjustments. “One of my theories,” he said somewhat later, “is that pain involves anticipation. Nothing original, I admit, but I’m going to demonstrate to you what I mean: I will not, underline not, use the Machine on you this evening. I could. It’s ready and tested. But instead I will simply erect it and leave it beside you, for you to stare at the next twenty-four hours, wondering just what it is and how it works and can it really be as dreadful as all that.” He tightened some things here, loosened some more over there, tugged and patted and shaped.\u003c/p\u003e\n\u003cp\u003eThe Machine looked so silly Westley was tempted to giggle. Instead, he groaned again.\u003c/p\u003e\n\u003cp\u003e“I’ll leave you to your imagination, then,” the Count said, and he looked at Westley. “But I want you to know one thing before tomorrow night happens to you, and I mean it: you are the strongest, the most brilliant and brave, the most altogether worthy creature it has ever been my privilege to meet, and I feel almost sad that, for the purposes of my book and future pain scholars, I must destroy you.”\u003c/p\u003e\n\u003cp\u003e“Thank… you…” Westley breathed softly.\u003c/p\u003e\n\u003cp\u003eThe Count went to the cage door and said over his shoulder, “And you can stop all your performing about how weak and beaten you are; you haven’t fooled me for a month. You’re practically as strong now as on the day you entered the Fire Swamp. I know your secret, if that’s any consolation to you.”\u003c/p\u003e\n\u003cp\u003e“…secret?” Hushed, strained.\u003c/p\u003e\n\u003cp\u003e“You’ve been taking your brain away,” the Count cried. “You haven’t felt the least discomfort in all these months. You raise your eyes and drop your eyelids and then you’re off, probably with—I don’t know—her, most likely. Good night now. Try and sleep. I doubt you’ll be able to. Anticipation, remember?” With a wave, he mounted the underground stairs.\u003c/p\u003e\n\u003cp\u003eWestley could feel the sudden pressure of his heart.\u003c/p\u003e\n\u003cp\u003eSoon the albino came, knelt by Westley’s ear. Whispered: “I’ve been watching you all these days. You deserve better than what’s coming. I’m needed. No one else feeds the beasts as I do. I’m safe. They won’t hurt me. I’ll kill you if you’d like. That would foil them. I’ve got some good poison. I beg you. I’ve seen the Machine. I was there when the wild dog screamed. Please let me kill you. You’ll thank me, I swear.”\u003c/p\u003e\n\u003cp\u003e“I must live.”\u003c/p\u003e\n\u003cp\u003eWhispered: “But—”\u003c/p\u003e\n\u003cp\u003eInterruption: “They will not reach me. I am all right. I am fine. I am alive, and I will stay that way.” He said the words loud, and he said them with passion. But for the first time in a long time, there was terror…\u003c/p\u003e\n\u003cp\u003e“Well, could you sleep?” the Count asked the next night upon his arrival in the cage.\u003c/p\u003e\n\u003cp\u003e“Quite honestly, no,” Westley replied in his normal voice.\u003c/p\u003e\n\u003cp\u003e“I’m glad you’re being honest with me; I’ll be honest with you; no more charades between us,” the Count said, putting down a number of notebooks and quill pens and ink bottles. “I must carefully track your reactions,” he explained.\u003c/p\u003e\n\u003cp\u003e“In the name of science?”\u003c/p\u003e\n\u003cp\u003eThe Count nodded. “If my experiments are valid, my name will last beyond my body. It’s immortality I’m after, to be quite honest.” He adjusted a few knobs on the Machine. “I suppose you’re naturally curious as to how this works.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-94.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
