{"id":109075,"no":95,"title":"Page 95","content":"\u003cp\u003e“I have spent the night pondering and I know no more than when I started. It appears to be a great conglomeration of soft rimmed cups of infinitely varied sizes, together with a wheel and a dial and a lever, and what it does is beyond me.”\u003c/p\u003e\n\u003cp\u003e“Also glue,” added the Count, pointing to a small tub of thick stuff. “To keep the cups attached.” And with that, he set to work, taking cup after cup, touching the soft rims with glue, and setting them against Westley’s skin. “Eventually I’ll have to put one on your tongue too,” the Count said, “but I’ll save that for last in case you have any questions.”\u003c/p\u003e\n\u003cp\u003e“This certainly isn’t the easiest thing to get set up, is it?”\u003c/p\u003e\n\u003cp\u003e“I’ll be able to fix that in later models,” the Count said; “at least those are my present plans,” and he kept right on putting cup after cup on Westley’s skin until every inch of exposed surface was covered. “So much for the outside,” the Count said then. “This next is a bit more delicate; try not to move.”\u003c/p\u003e\n\u003cp\u003e“I’m chained hand, head and foot,” Westley said. “How much movement do you think I’m capable of?”\u003c/p\u003e\n\u003cp\u003e“Are you really as brave as you sound, or are you a little frightened? The truth, please. This is for posterity, remember.”\u003c/p\u003e\n\u003cp\u003e“I’m a little frightened,” Westley replied.\u003c/p\u003e\n\u003cp\u003eThe Count jotted that down, along with the time. Then he got down to the fine work, and soon there were tiny tiny soft rimmed cups on the insides of Westley’s nostrils, against his eardrums, under his eyelids, above and below his tongue, and before the Count arose, Westley was covered inside and out with the things. “Now all I do,” the Count said very loudly, hoping Westley could hear, “is get the wheel going to its fastest spin so that I have more than enough power to operate. And the dial can be set from one to twenty and, this being the first time, I will set it at the lowest setting, which is one. And then all I need do is push the lever forward, and we should, if I haven’t gummed it up, be in full operation.”\u003c/p\u003e\n\u003cp\u003eBut Westley, as the lever moved, took his brain away, and when the Machine began, Westley was stroking her autumn-colored hair and touching her skin of wintry cream and—and—and then his world exploded—because the cups, the cups were everywhere, and before, they had punished his body but left his brain, only not the Machine; the Machine reached everywhere—his eyes were not his to control and his ears could not hear her gentle loving whisper and his brain slid away, slid far from love into the deep fault of despair, hit hard, fell again, down through the house of agony into the county of pain. Inside and out, Westley’s world was ripping apart and he could do nothing but crack along with it.\u003c/p\u003e\n\u003cp\u003eThe Count turned off the Machine then, and as he picked up his notebooks he said, “As you no doubt know, the concept of the suction pump is centuries old—well, basically, that’s all this is, except instead of water, I’m sucking life; I’ve just sucked away one year of your life. Later I’ll set the dial higher, certainly to two or three, perhaps even to five. Theoretically, five should be five times more severe than what you’ve just endured, so please be specific in your answers. Tell me now, honestly: how do you feel?”\u003c/p\u003e\n\u003cp\u003eIn humiliation, and suffering, and frustration, and anger, and anguish so great it was dizzying, Westley cried like a baby.\u003c/p\u003e\n\u003cp\u003e“Interesting,” said the Count, and carefully noted it down.\u003c/p\u003e\n\u003cp\u003eIt took Yellin a week to get his enforcers together in sufficient number, together with an adequate brute squad. And so, five days before the wedding, he stood at the head of his company awaiting the speech of the Prince. This was in the castle courtyard, and when the Prince appeared, the Count was, as usual, with him, although, not as usual, the Count seemed preoccupied. Which, of course, he was, though Yellin had no way of knowing that. The Count had sucked ten years from Westley this past week, and, with the life of sixty-five that was average for a Florinese male, the victim had approximately thirty years remaining, assuming he was about twenty-five when they started experimenting. But how best to go about dividing that? The Count was simply in a quandary. So many possibilities, but which would prove, scientifically, most interesting? The Count sighed; life was never easy. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-95.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
