{"id":109079,"no":99,"title":"Page 99","content":"\u003cp\u003e“Shhh, you’ll be fine now,” Fezzik said, cutting another piece of meat, putting it into Inigo’s mouth.\u003c/p\u003e\n\u003cp\u003eInigo chewed it carefully down. “First you appearing so suddenly and then, on top of that, the business of Vizzini. It was too much for me.”\u003c/p\u003e\n\u003cp\u003e“It would have been too much for anybody; just rest.” Fezzik began to cut another piece of meat.\u003c/p\u003e\n\u003cp\u003e“I feel such a baby, so helpless,” Inigo said, taking the next bite, chewing away.\u003c/p\u003e\n\u003cp\u003e“You’ll be as strong as ever by sundown,” Fezzik promised, getting the next piece of meat ready. “The six-fingered man is named Count Rugen and he’s here right now in Florin City.”\u003c/p\u003e\n\u003cp\u003e“Interesting,” Inigo managed this time before he fainted again.\u003c/p\u003e\n\u003cp\u003eFezzik stood over the still figure. “Well it is so good to see you,” he said, “and it’s been such a long time and I’ve just got so much news.”\u003c/p\u003e\n\u003cp\u003eInigo only lay there.\u003c/p\u003e\n\u003cp\u003eFezzik hurried to Falkbridge’s tub and plugged it up and after a lot of work he got it filled with steaming water and then he dunked Inigo in, holding him down with one hand, holding Inigo’s mouth shut with the other, and when the brandy began to sweat from the Spaniard’s body, Fezzik emptied the tub and filled it again, with icy water this time, and back he plunged Inigo, and when that water began to warm a bit back he filled the tub with steaming stuff and back went Inigo and now the brandy was really oozing from his pores and that was how it went, hour after hour, hot to icy cold to steaming hot and then some tea and then some toast and then some steaming hot again and more icy cold and then a nap and then more toast and less tea but the longest steamer yet and this time there wasn’t much brandy left inside and one final icy cold and then a two-hour sleep until by midafternoon, they sat downstairs in Falkbridge’s kitchen, and now, at last, for the first time in ninety days, Inigo’s eyes were almost bright. His hands did shake, but not all that noticeably, and perhaps the Inigo of before the brandy would have bested this fellow now in sixty minutes of solid fencing. But not too many other masters in the world would have survived for five.\u003c/p\u003e\n\u003cp\u003e“Tell me briefly now: while I’ve been here with the brandy, you have been where?”\u003c/p\u003e\n\u003cp\u003e“Well, I spent some time in a fishing village and then I wandered a bit, and then a few weeks ago I found myself in Guilder and the talk there was of the coming wedding and perhaps a coming war and I remembered Buttercup when I carried her up the Cliffs of Insanity; she was so pretty and soft and I had never been so near perfume before that I thought it might be nice to see her wedding celebrations, so I came here, but my money was gone, and then they were forming a brute squad and needed giants and I went to apply and they beat me with clubs to see if I was strong enough and when the clubs broke they decided I was. I’ve been a Brute First Class all this past week; it’s very good pay.”\u003c/p\u003e\n\u003cp\u003eInigo nodded. “All right, again, and this time please be brief, from the beginning: the man in black. Did he get by you?”\u003c/p\u003e\n\u003cp\u003e“Yes. Fairly too. Strength against strength. I was too slow and out of practice.”\u003c/p\u003e\n\u003cp\u003e“Then it was he that killed Vizzini?”\u003c/p\u003e\n\u003cp\u003e“That is my belief.”\u003c/p\u003e\n\u003cp\u003e“Did he use his sword or his strength?”\u003c/p\u003e\n\u003cp\u003eFezzik tried to remember. “There weren’t any sword wounds and Vizzini didn’t seem broken. There were just these two goblets and Vizzini dead. Poison is my guess.”\u003c/p\u003e\n\u003cp\u003e“Why would Vizzini take poison?”\u003c/p\u003e\n\u003cp\u003eFezzik hadn’t the least idea.\u003c/p\u003e\n\u003cp\u003e“But he was definitely dead?”\u003c/p\u003e\n\u003cp\u003eFezzik was positive.\u003c/p\u003e\n\u003cp\u003eInigo began to pace the kitchen, his movements quick and sharp, the way his movements were before. “All right, Vizzini is dead, enough of that. Tell me briefly where the six-fingered Rugen is so I may kill him.” \u003c/p\u003e","sourceLink":"https://allnovel.net/the-princess-bride/page-99.html","bookId":1559,"creation":"Oct 5, 2019 11:31:14 PM","modification":"Oct 5, 2019 11:31:14 PM"}
