{"id":68787,"no":22,"title":"Page 22","content":"\u003cp\u003eITwas over. It was about to begin. limbo awaited. limbo and the rescue of this world. Fredda Leving smiled as she leaned in over Caliban and snapped the replacement eye into place. It powered up, glowing with the same intense blue of its mate. \"There we are,\" she said. \"Now then, let\u0027s get a look at that banged-up arm of yours.\"\u003c/p\u003e\n\u003cp\u003e\"Thank you for your help, Dr. Leving. You put yourself in a most grave situation on my behalf. I have the feeling of owing you a great debt.\"\u003c/p\u003e\n\u003cp\u003e\"Do you indeed?\" she said with a laugh. \"That\u0027s most interesting. It would seem to me that you have already integrated your own Third law of self-preservation. Perhaps that sense of debt marks the beginning of your integration of a Second law. I wonder what it will be.\" She took his arm and guided him to hold it out straight. She used a small tool that hummed quietly, and the outer carapace of his arm opened up. \"Not too bad,\" she said absently, taking a look at his damaged arm mechanism. \"While we are waiting for that Second law to kick in, I can suggest what you might do to pay that debt.\"\u003c/p\u003e\n\u003cp\u003e\"What would that be?\"\u003c/p\u003e\n\u003cp\u003eShe looked at him, into those burning blue eyes. \"Come with me,\" she said. \"Come to limbo. This city is no place for you. I doubt you will ever feel comfortable and safe here.\"\u003c/p\u003e\n\u003cp\u003eCaliban considered that point. \"No, that is true. I doubt I could ever be happy in Hades. But what shall I do in limbo? What use shall I be?\"\u003c/p\u003e\n\u003cp\u003eFredda laughed again. \"Yes, you are quite definitely developing a sense of duty outside the self. I will be fascinated to see what happens next.\" But then her voice turned serious. \"You will be of great use in Limbo, Caliban. You have a first-rate mind and a unique point of view. Three Law robot, New Law robot, Settler, Spacer-we all have our blind spots. You\u0027ll be able to see things in ways no one else can.\u003c/p\u003e\n\u003cp\u003e\"Come join us, Caliban. Go with me to the city of Limbo on the island of Purgatory and help us keep this planet from going to hell.\"\u003c/p\u003e\n\u003cp\u003eCaliban the robot looked into the eyes of his creator and nodded his agreement. \"Dr. Leving,\" he said, \"I can think of no better place for me to be.\"\u003c/p\u003e","sourceLink":"https://allnovel.net/caliban-isaac-asimov-s-caliban-1/page-22.html","bookId":1728,"creation":"Oct 5, 2019 10:10:55 AM","modification":"Oct 5, 2019 10:10:55 AM"}
