{"id":68773,"no":8,"title":"Page 8","content":"\u003cp\u003eAN hour after the discovery of the blaster, the crime scene robots found the Settler woman cringing in the doorway of a nearby building. She was hysterical, so far gone that even the sight of arobot frightened her.\u003c/p\u003e\n\u003cp\u003eOr perhaps, Alvar reflected, under the circumstances, the woman had reason to fear robots. Alvar ordered the woman brought to his aircar. He met her there, escorted her inside the car, and sat her down in its calm and quiet privacy. There would be enough time later to worry about arresting her and charging her. Right now he needed information, and a person in her condition would almost certainly react better to kindness than bullying. Though, of course, bullying would remain an option he could fall back on later. He brought her some water and sat down with her. Damned nuisance that Donald couldn\u0027t be present for this interrogation, but this was clearly no time to expose this woman to any more robots. Donald could monitor the conversation, and that would have to be good enough.\u003c/p\u003e\n\u003cp\u003e\"All right,\" Alvar Kresh said, his voice low and gentle. \" All right. You\u0027re a Settler, aren\u0027t you? What is your name?\"\u003c/p\u003e\n\u003cp\u003e\"Santee Timitz,\" she said in a low, quavering voice. \"I work in the general agronomy section in Settlertown.\"\u003c/p\u003e\n\u003cp\u003e\"All right, fine,\" Kresh said. He had to be careful how he played this one. She was in a cooperative mood, so terrified by whatever she had seen that she was willing to tell him anything. Such moods were remarkably fragile things. \"What I want to know is what, exactly, happened. What were you doing in that warehouse?\"\u003c/p\u003e\n\u003cp\u003e\"Ro-ro-robot ba-ba-\"\u003c/p\u003e\n\u003cp\u003e\"Robot bashing,\" Kresh finished for her. \"That\u0027s what we thought, but it\u0027s good to know for certain. All right, then, that\u0027s a serious crime, you know that. You\u0027re in a lot of trouble right now, Timitz. But maybe it doesn\u0027t have to be so bad for you if you\u0027ll cooperate with-\"\u003c/p\u003e\n\u003cp\u003e\"I-I can\u0027t inform on my friends,\" she interrupted, looking up at him, her eyes swollen and full of tears.\u003c/p\u003e\n\u003cp\u003eKresh reached out and took her by the hand. \"No one\u0027s asking you to,\" he said.Not yet, anyway, he thought.Maybe there won\u0027t even be any need to ask. Just having yourname is a better lead than we\u0027ve ever had. \"But what I am going to ask you is what went wrong down there. Things got out of control, that\u0027s obvious. How? Did your friends set fire to the building to hide the evidence?\" Kresh no longer believed that idea, but it might be no bad thing to make her think otherwise.\u003c/p\u003e\n\u003cp\u003e\"No!\" Timitz cried out. \"We would never-no, no, that\u0027s not what happened.\"\u003c/p\u003e\n\u003cp\u003e\"Then how did the building burn down?\"\u003c/p\u003e\n\u003cp\u003e\"It was the robot,\" Timitz blurted out. \"Reybon was baiting the robot. He tried to trick it into killing itself, and then it turned away, and Reybon ordered it to stop but it didn\u0027t and-\"\u003c/p\u003e\n\u003cp\u003e\"Wait a second. The robot refused adirect order?\" Kresh asked. He was pleased to have Timitz blurt out the name \"Reybon,\" and would have been content to let her go on burbling out as much incriminating information as she wanted, but not when something that impossible was going past.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Timitz said. She looked Kresh in the eye, and he could see the light of caution suddenly appear in her face. \"It\u0027s hard to say exactly what happened-it all went by so fast. Rey-um, ah, the man who was baiting the robot. He said stop, and told the robot it was an order, and the robot kept going.\"\u003c/p\u003e\n\u003cp\u003e\"And then what happened?\"\u003c/p\u003e\n\u003cp\u003e\"He-the man who was there-pulled his blaster on the robot and ordered it to stop again.\"\u003c/p\u003e\n\u003cp\u003e\"And did the robot stop?\"\u003c/p\u003e\n\u003cp\u003e\"No, sir. He didn\u0027t,\" Timitz said, her voice getting excited again. \"It grabbed the blaster and crushed it and threw it away. The blaster shorted out and sparks flew everywhere. That\u0027s what started the fire. Then Reybon reached for the robot, and the robot shoved him away, really hard. Then the robot turned and left. The fire started to spread, and then everyone panicked and ran.\"\u003c/p\u003e\n\u003cp\u003e\"Wait a second,\" Kresh said, unwilling to believe what he was hearing, even as he had been unwilling to believe the evidence in the warehouse, and the evidence back at the robot lab last night. \" Arobot set that fire, with people in the building? Arobot refused an order, and attacked a human being, and left several human beings behind in a burning building?\"\u003c/p\u003e\n\u003cp\u003eSantee Timitz looked up into Kresh\u0027 s face, her eyes full of tears, her face a transparent mask of fear. \"Yes, yes, that\u0027 s what happened,\" she said. \"I know all about the rules and how robots aren\u0027t supposed to be able to do that, but it happened,\" she said, her voice teetering back on the edge of full hysteria. \"It happened! It happened! It\u0027s all true! That robot went crazy in there!\"\u003c/p\u003e\n\u003cp\u003eKresh stood up, paced up and down the length of the aircar\u0027s main cabin. At last he stopped, standing over Timitz. \"I want to make sure I have this straight. You \u0027re saying that a robot deliberately refused an order, then took a weapon from a man, started a fire, threw a man down, and left a warehouse full of people in imminent danger of being Burned alive? That he didn\u0027t turn back, or try and help, or attempt to rescue anyone?\"\u003c/p\u003e\n\u003cp\u003e\"Yes, I was there! I saw it!\" Timitz said, her voice half-panicked. \"Reybon got out, we all got out, no one was killed-but the robot didn\u0027t try to help us. It just walked away, calm as could be.\"\u003c/p\u003e\n\u003cp\u003eKresh stared down at her. He desperately wanted to press on, but he was skilled enough to know when to back off. If he pushed her now on this line of questioning, she would think he doubted her-as indeed he did. But then she would get defensive, belligerent. Right at the moment she was too far gone to be telling him anything but the truth. Anger would focus her. Better to keep her off balance, before she started to collect herself and started to shade her story. Time to shift gears, gather information on some other point while her feat made her easy to bully.\u003c/p\u003e\n\u003cp\u003e\"And so your friends all piled into their aircar, including the one the robot had attacked, and you got left behind,\" Alvar said. \"Was that by\u0027 accident?\" He was careful to put just the right amount of doubt in his voice, to hint just slightly that he had some reason to think it might have been deliberate. Perhaps the tactic would not bear fruit now, but later, brooding in her cell, the fear of immediate danger replaced by the knowledge of certain trouble to come-oh, that tiny suggestion might well gnaw at her heart, make her that much more ready to betray the ones who had, deliberately or not, left her to the wolves. Kresh was a patient man when it came to his suspects. He planned ahead when he played with their minds. \"Maybe they were mad at you for some reason.\"\u003c/p\u003e\n\u003cp\u003e\"No, no, they would never do that,\" Timitz said, a bit too forcibly for the statement to be altogether convincing. \"It was an accident, I\u0027m sure of it.\"\u003c/p\u003e\n\u003cp\u003e\"All right, if you say so. And then what happened?\"\u003c/p\u003e\n\u003cp\u003e\"I ran until I couldn\u0027t anymore. I was so scared I couldn\u0027t think straight. I found a doorway to hide in and catch my breath. Then the fire brigade came, and there were lights and robots and people everywhere. I didn\u0027t dare move. And then your robots caught me.\" Timitz, drained of all emotion, looked up at the Sheriff. Kresh stared into that wan little face. Robot basher, vandal, criminal, drunk, Settler. She was all those things, and those were all things he hated. But this woman had been through the terrors of hell tonight. All the nightmare robots of the imagination that the Settlers used to frighten naughty children must have come to life for this poor little fool. Almost reluctantly he found pity in his heart for the woman. At last he sighed and turned away, looked toward the wall and not toward her. He could bully her all night and not get any more than he had. Time to let it go.\u003c/p\u003e\n\u003cp\u003e\"One last question,\" he said in a gentle voice, still carefully considering the featureless wall. \"The robot. What did it look like?\"\u003c/p\u003e\n\u003cp\u003e\"Tall,\" she said in a voice still edged with fear. \"It was red, with blue eyes. About two meters tall, very powerfully built. It said its name was Caliban.\"\u003c/p\u003e\n\u003cp\u003e\"He told you his name?\" Kresh said, startled. Why in the name of all devils would a robot keen on attack tell anyone its name?\u003c/p\u003e\n\u003cp\u003eNo, wait, the robot could have given a false name. Yes, the robot could have lied. Alvar realized that he had been assuming a robot would always tell the truth-but why assumethat about a robot who left human beings to die?\u003c/p\u003e\n\u003cp\u003eBut that name, Caliban. There was something about that name.\u003c/p\u003e\n\u003cp\u003eNever mind. Worry about it later. \"You people talked to him?\" he asked, looking back at her, wanting to be sure he had it straight.\u003c/p\u003e\n\u003cp\u003e\"Yes,\" Timitz said with. a look of renewed alarm. \"Didn\u0027t I say so? I thought I did.\"\u003c/p\u003e\n\u003cp\u003eKresh shook his head in bewilderment, but then he let it go. Nothing about this made sense. \"We\u0027re going to move you to another car. It\u0027s going take you someplace you can rest for a while. Later on, you and I are going to have a lot to talk about,\" he said.\u003c/p\u003e\n\u003cp\u003e\"YOU got all that, I assume,\" Kresh said, sitting in the copilot\u0027s seat of the aircar, staring off at the distant skyline, the proud but weary towers of Hades glittering in the darkness. He was damned tired, and perfectly content to let Donald do the flying.\u003c/p\u003e\n\u003cp\u003e\"Yes, sir, I did,\" Donald said. \"The intercom sight and sound relay from the aircar was quite clear, though the camera angle was a bit awkward.\"\u003c/p\u003e\n\u003cp\u003e\"I was afraid of that,\" Kresh said. \"But were you able to get enough to judge if she was telling the truth?\"\u003c/p\u003e\n\u003cp\u003e\"From all that I could see and hear-yes. She believed what she said. Her manner was quite sincere. Her vocal patterns indicated stress consistent with a truthful report, and her pupil dilation and body language were likewise consistent. There are of course cases of persons who have been trained to lie with their entire body, as it were, especially under emotional stress. They can orchestrate all their normally autonomic responses to appear sincere, though in a normal person, those responses would betray an attempt to lie.\"\u003c/p\u003e\n\u003cp\u003e\"And if she were a Settler agent, part of a team sent in with the express purpose of destabilizing our society, she would certainly have been trained just that way. IfI were the controller sending in a team to stage a robot attack, I might have set it up the way this one seemed to happen. So things appeared just the way they do now.\"\u003c/p\u003e\n\u003cp\u003e\"Sir, if I might bring up a point-if eventswere as they seemed, then things would also appear as they did.\"\u003c/p\u003e\n\u003cp\u003e\"What are you talking about?\"\u003c/p\u003e\n\u003cp\u003e\"With all respect, you are still working on the flat assumption that no true robot could have done this, that the Settlers are staging these attacks to alarm us. This is a most difficult concept to confront, and I do so most reluctantly, but I believe that we have no choice. But Madame Welton was right: We are obliged to at least consider the simplest explanation, which is that a robot appears to be attacking humans-because that is precisely what is happening.\"\u003c/p\u003e\n\u003cp\u003eThe aircar flew on in silence for a moment.\u003c/p\u003e\n\u003cp\u003eAt last Kresh spoke. \"One of the things I have always admired about you, Donald, is your ability to snap my head clean off without my so much as feeling it. You are right, of course. I must accept the fact that the events could be real. I will have to think on all this tonight.\"\u003c/p\u003e\n\u003cp\u003e\"Sir, one other thing. The name \u0027Caliban.\u0027 \"\u003c/p\u003e\n\u003cp\u003e\"Yes, it struck me as familiar somehow. What of it?\"\u003c/p\u003e\n\u003cp\u003e\"You no doubt recall it from the time you first ordered Fredda Leving to build me. She keeps a list of names of characters from an ancient storyteller named Shakespeare. She has always named robots built under her personal direction after those characters.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, that\u0027s right. I picked your name off that list.\"\u003c/p\u003e\n\u003cp\u003e\"Precisely, sir. The name \u0027Caliban\u0027 is from the same source.\"\u003c/p\u003e\n\u003cp\u003e\"Which makes it all but certain that Caliban, the robot tonight, has to be the robot who left those footprints at Leving Labs.\"\u003c/p\u003e\n\u003cp\u003e\"All but certain, sir? I would think there could be no question.\"\u003c/p\u003e\n\u003cp\u003e\"A lot of people would have to know where Leving gets her robot names. A group that wanted to discredit her would name robots from the same list. That sounds unlikely, I agree, but this whole case seems unlikely. I think it would be wise if we try not to make unwarranted assumptions.\"\u003c/p\u003e\n\u003cp\u003e\"Yes, sir. In any event, we are nearly home.\"\u003c/p\u003e\n\u003cp\u003eThe aircar settled in for a landing on the roof of Kresh\u0027s home, and he breathed a sigh of relief. It had been a devil of a long day. A long two days rolled into one. Praise be that it was finally time to rest. He climbed out of his aircar, out onto the rooftop landing pad. He paused at the bottom of the aircar\u0027s ramp to breathe in the cool desert air, and then headed into his house, taking the powerlift down instead of the stairs, and that was a measure of his exhaustion. Lifts were for old men.\u003c/p\u003e\n\u003cp\u003eBut old was just what he felt himself to be tonight.\u003c/p\u003e\n\u003cp\u003eHe was too tired to fight when Donald urged him to take a long hot shower before collapsing into bed, and as usual Donald was right. The needle jets of steaming hot water melted the tension out of his body, cooked the knots out of his muscles. Kresh let the hot-air jets dry him and let Donald put a nightshirt over his head. At last Kresh collapsed into bed. He was asleep before his head hit the pillow.\u003c/p\u003e\n\u003cp\u003eAnd awake again before he was even sure that he had been asleep.\u003c/p\u003e\n\u003cp\u003eDonald was leaning over him, giving him a gentle, tentative nudge on the shoulder. \"Sir, sir,\" he was saying.\u003c/p\u003e\n\u003cp\u003eAlvar wanted to protest, to argue, the way he would if a human had awakened him, but then his mind went through the sort of mental calculation that became second nature after one lived around robots long enough. Donald knew how much Alvar needed sleep, and would not awaken him unless something urgent came up-or something that Donald knew Alvar Kresh would regard as important enough to wake up for. Therefore, the fact that he was awake meant that something big had broken.\u003c/p\u003e\n\u003cp\u003eHe sat up in bed, swung his legs around to the floor, and stood up. Donald backed off to give him room. \"What is it, Donald?\" Alvar asked.\u003c/p\u003e\n\u003cp\u003e\"It\u0027s Fredda Leving, sir.\"\u003c/p\u003e\n\u003cp\u003eAlvar looked at Donald sharply and felt his heart suddenly thundering against his rib cage. \"Yes, yes,\" he said impatiently. \"What about her?\"It could only be one of two things, he told himself.Either she had died unexpectedly, or else\u003c/p\u003e\n\u003cp\u003e\"Word has just come from the hospital, sir. She\u0027s regained consciousness.\" \u003c/p\u003e","sourceLink":"https://allnovel.net/caliban-isaac-asimov-s-caliban-1/page-8.html","bookId":1728,"creation":"Oct 5, 2019 10:10:55 AM","modification":"Oct 5, 2019 10:10:55 AM"}
