{"id":63522,"no":12,"title":"Page 12","content":"\u003cp\u003eThe communicator on my hip buzzes with static. I swiped it before sneaking out of the aid-worker hut. My plan is simple, the best I can do under such circumstances. Get to Hannu and his Cêpan, tell them what’s happening and use the communicator to monitor my people’s movements. Hopefully, with Hannu’s knowledge of the jungle, we’ll be able to stay one step ahead of the soon-to-be-arriving strike team. It won’t be easy—because of the remote location, my father has authorized a larger unit than normal, including a piken—but I know how my people think, how they attack. I can do this.\u003c/p\u003e\n\u003cp\u003eAll I have to do is get to Hannu first. A task this thick jungle isn’t making very easy.\u003c/p\u003e\n\u003cp\u003eWhen the jungle begins to thin out before me, moonlight shining through the canopy overhead, I know that I’m close. I can hear rushing water in the distance, the river coursing through the nearby ravine.\u003c/p\u003e\n\u003cp\u003eAnd then I see it. A single, solidly built hut. The jungle around it has been painstakingly cleared, leaving a flat expanse that’s littered with angular mahogany equipment. As my eyes adjust, I realize the objects are some kind of homemade obstacle course. So Hannu does more training than just pickup basketball games in the village. That’s good. He’ll need to be agile for what’s to come.\u003c/p\u003e\n\u003cp\u003eI approach the hut cautiously. The last thing I need is to spook Hannu and his Cêpan. If he’s anything like Conrad Hoyle, Hannu’s Cêpan might emerge from that hut with guns blazing.\u003c/p\u003e\n\u003cp\u003eI stop, stiffening, the hair on the back of my neck rising. Footsteps are crashing through the jungle behind me. I break out in a cold sweat despite the African heat.\u003c/p\u003e\n\u003cp\u003eI turn to see Ivan emerging from the jungle. In the moonlight, I see a trickle of sweat roll down his cheek, his face contorted in a humorless smile.\u003c/p\u003e\n\u003cp\u003e“Clever Adamus,” he sneers, “thought you’d get away with this.”\u003c/p\u003e\n\u003cp\u003eHe’s on to me.\u003c/p\u003e\n\u003cp\u003e“With what?” I ask, stalling.\u003c/p\u003e\n\u003cp\u003eI glance over my shoulder at the hut. There’s no movement inside, the sounds Ivan and I are making drowned out by the jungle. I’ll stop Ivan if I have to, but I hope it won’t come to that. Maybe I can still talk my way out of this.\u003c/p\u003e\n\u003cp\u003eI walk back towards the edge of the clearing, standing inches away from Ivan.\u003c/p\u003e\n\u003cp\u003e“Get out of here, Ivan,” I say, trying to sound as intimidating as possible.\u003c/p\u003e\n\u003cp\u003eHe snorts, disbelieving. “What? And let you try to steal all the glory? You’ll probably freeze up again.”\u003c/p\u003e\n\u003cp\u003eAnd then I realize what dim-witted Ivan thinks I’m doing out here. He doesn’t think I’ve come to warn Hannu; such treason isn’t even a possibility to him. Ivan thinks I’ve come to capture or kill Hannu myself, just like he assumed I did with Number Two.\u003c/p\u003e\n\u003cp\u003e“You didn’t even bring any weapons,” Ivan observes mockingly. “Are you going to talk the Loric to death?”\u003c/p\u003e\n\u003cp\u003eHe’s right. I came unarmed, hoping it would help convince Hannu to trust me. Also, I never intended to actually fight my people, only evade them. I hoped that violence could be avoided.\u003c/p\u003e\n\u003cp\u003eWith speed that surprises Ivan, I snake my hand forward and rip the dagger off his belt. His jaw drops when I hurl the weapon into the jungle.\u003c/p\u003e\n\u003cp\u003e“Adamus,” he exclaims, sounding hurt, like a kid who’s had his favorite toy broken. “What the hell? You better help me look for that.”\u003c/p\u003e\n\u003cp\u003eI grab Ivan by the front of his shirt and put my face in his. He’s surprised again, not used to being manhandled. I stare into his eyes, trying to reach him. I know it’s crazy, but Ivan used to be my best friend, despite everything. I have to believe that he’ll still listen to me.\u003c/p\u003e\n\u003cp\u003e“Why do this?” I ask. “Killing them won’t heal our planet. It won’t lead to Mogadorian progress. It’ll only lead to more killing. More life wasted. Is that what you want?”\u003c/p\u003e\n\u003cp\u003e“What the hell are you talking about, Adamus?”\u003c/p\u003e\n\u003cp\u003eHe stares at me, dumbfounded. I shake him.\u003c/p\u003e\n\u003cp\u003e“We don’t always get along,” I continue, “but you’re like a brother to me. You trust me, don’t you?”\u003c/p\u003e\n\u003cp\u003eMutely, Ivan nods his head.\u003c/p\u003e\n\u003cp\u003e“Then trust me when I tell you that everything we’ve been told is wrong,” I say desperately. “Our cause is unjust, Ivan. We can change that. You can help me work towards—toward real Mogadorian progress.”\u003c/p\u003e\n\u003cp\u003eI can see him trying to make sense of my words, confusion on his face. He looks away from me, over my shoulder, to the hut where Hannu and his Cêpan sleep. For a moment I allow myself to think that I’ve gotten through to him.\u003c/p\u003e\n\u003cp\u003eThen he shoves me away. He’s finally realized what I’m up to, and it disgusts him.\u003c/p\u003e\n\u003cp\u003e“I always knew you were weak, Adamus,” hisses Ivan, “but not a traitor too.”\u003c/p\u003e\n\u003cp\u003eThat settles it.\u003c/p\u003e\n\u003cp\u003eI unclip the communicator from my belt and slam it into the side of Ivan’s face.\u003c/p\u003e\n\u003cp\u003eCHAPTER 25\u003c/p\u003e\n\u003cp\u003eI had hoped the blow would knock Ivan out. I should’ve known better.\u003c/p\u003e\n\u003cp\u003eIvan is back on his feet before I can create some distance between us. He doesn’t even register the trickle of blood from the cut I made above his eyebrow. That dead look I’ve seen in his eyes during a dozen training sessions comes on, and he’s barreling towards me.\u003c/p\u003e\n\u003cp\u003eIvan drives his shoulder into my stomach and lifts me, hurling me into a tree. The air explodes out of my lungs in a wet cough. Ivan grabs a handful of my hair and slams my head into the tree. Stars flash across my vision; I struggle to stay conscious.\u003c/p\u003e\n\u003cp\u003eDesperately, I kick at Ivan, my shin connecting solidly with his groin. He doubles over, retching, and drops me.\u003c/p\u003e\n\u003cp\u003eI stumble backward, into the jungle, shaking the cobwebs out of my head. Ivan is on me again before I have a chance to regroup, delivering a two-punch combination to my chest, followed by an uppercut that sends me tumbling over a fallen tree trunk. I scuttle backwards on my hands, running my tongue over the gap where my tooth used to be.\u003c/p\u003e\n\u003cp\u003e“You can do better than that,” says One, sitting cross-legged on the tree trunk.\u003c/p\u003e\n\u003cp\u003e“Shut up,” I mutter.\u003c/p\u003e\n\u003cp\u003eIvan leaps onto the tree trunk, standing above me. He points over his shoulder, a wild look in his eyes.\u003c/p\u003e\n\u003cp\u003e“You want to fight me for them?” he snarls. “For some Loric trash? You’re choosing them over us?”\u003c/p\u003e\n\u003cp\u003e“Yes.”\u003c/p\u003e\n\u003cp\u003e“Then you can die with them!”\u003c/p\u003e\n\u003cp\u003eIvan jumps off the log, intending to stomp my face. I roll away at the last moment, kicking him in the side of the knee as he lands. I hear something snap inside Ivan’s leg, and he howls with pain.\u003c/p\u003e\n\u003cp\u003eI scramble to my feet. Center myself, regain my balance. Ivan lunges towards me, now limping slightly, but this time I’m ready for him. I deflect his punches—all straight ahead, angrily telegraphed—using his own momentum and speed against him. It’s something I never tried in our sparring sessions, but it’s exactly what Hilde had been teaching Number One.\u003c/p\u003e\n\u003cp\u003eIvan comes at me again, frustrated, his blows more furious than ever. I duck under them and when he’s off balance, drive the heel of my hand into his nose. His feet go out from under him.\u003c/p\u003e\n\u003cp\u003eI step down on Ivan’s throat, thinking of Number Two and the way he stepped on her neck. Out of the corner of my eye, I think I see a flicker of light coming from the direction of Hannu’s hut. But maybe it’s just my imagination.\u003c/p\u003e\n\u003cp\u003e“Not so easy when someone hits back, huh?” I say.\u003c/p\u003e\n\u003cp\u003eIvan shoves my foot away, but I catch his wrist in both of my hands. He pulls me to the ground and tries to climb on top of me. He punches wildly at me with his free hand, but I’m in control. I whip my legs up and slip one leg under his chin, the other behind his head, then pull down on his head with both of my hands, choking him.\u003c/p\u003e\n\u003cp\u003eIt takes a full minute for Ivan to lose consciousness, punching me in the ribs the whole time with decreasing force. When it’s over, I shove his body away, lying on my back. I’m hurting all over, but I’m alive.\u003c/p\u003e\n\u003cp\u003eAround me, the jungle has grown eerily quiet.\u003c/p\u003e\n\u003cp\u003eBut then I hear the hiss of orders broadcast across the half-broken communicator discarded in the dirt a few feet away, and I know what’s coming.\u003c/p\u003e\n\u003cp\u003eI’m too late.\u003c/p\u003e\n\u003cp\u003eCHAPTER 26\u003c/p\u003e\n\u003cp\u003eI manage to get to my feet and stagger towards the hut. I notice shadows lurking in the jungle around me, the scouts maintaining a perimeter.\u003c/p\u003e\n\u003cp\u003eIn the hut’s doorway, the crumpled body of a fifty-year-old man bleeds from a vicious sword wound. Hannu’s Cêpan. Dead like the other Cêpans. Which means they must have discovered the boy is Number Three.\u003c/p\u003e\n\u003cp\u003eI feel like sinking to my knees, like giving up. I’ve thrown my entire life away tonight—I can never go home again; they’ll know me as a traitor. I’ll be spending the rest of my life running and hiding, hunted, just like the Garde. And for what? I didn’t even manage to help Hannu. I was too late, took too long fighting with Ivan. I’ve accomplished nothing.\u003c/p\u003e\n\u003cp\u003eSuddenly the back wall of the hut explodes outward, splinters cascading in all directions. There is Hannu, alive, running—and running fast. Faster than humanly possible. He takes off before my people have a chance to close in, speeding towards the ravine.\u003c/p\u003e\n\u003cp\u003eThere’s still a chance.\u003c/p\u003e\n\u003cp\u003eThere’s no way that I can keep up with Hannu, but I run as fast as my body will allow, breath whistling painfully through my lungs. There are other pursuers nearby; I can hear them crashing through the jungle. Even with all the other scents in the jungle, I can still smell the acidic tang of piken breath as one charges towards the ravine. If I can only find a way to get to Hannu first, maybe I can still help him.\u003c/p\u003e\n\u003cp\u003eThe sound of rushing water grows louder. I don’t know how Hannu plans to cross the ravine. Maybe he’s strong enough to jump it. Maybe he knows some secret way down. It doesn’t matter, as long as he gets away. If he does, there is hope.\u003c/p\u003e\n\u003cp\u003eI see Hannu’s silhouette nearing the edge of the ravine, maybe thirty yards from where I’m standing. There is a piken close on his heels. I’m afraid for him—he doesn’t have anywhere to go—but when Hannu reaches the edge of the ravine he jumps, landing safely on the other side. It’s a jump I could never make, and neither can the piken.\u003c/p\u003e\n\u003cp\u003eHe’s safe.\u003c/p\u003e\n\u003cp\u003eExcept: My father is waiting for him on the other side of the ravine. There is nothing more Hannu can do. The General grabs the boy and lifts him easily. He cuts a striking image, like a Mogadorian hero culled right from the Great Book.\u003c/p\u003e\n\u003cp\u003eHe hesitates for a moment, observing his prize, then tears what I know is the pendant from Hannu’s neck and stuffs it into his cloak.\u003c/p\u003e\n\u003cp\u003eThere’s no way across the ravine. I can only watch as my father laughs, then pulls his sword from its scabbard. Its glowing shaft pierces the night before he plunges it through Hannu’s chest and then drops him callously to the ground. He’s dead.\u003c/p\u003e\n\u003cp\u003eOne is screaming inside my head. Or is that me?\u003c/p\u003e\n\u003cp\u003eThe General stares across the ravine. For a moment, our eyes lock.\u003c/p\u003e\n\u003cp\u003eI hear haggard footsteps approaching me from behind. I know what they mean, but I don’t turn to face them.\u003c/p\u003e\n\u003cp\u003eMy brief rebellion is at an end.\u003c/p\u003e\n\u003cp\u003e“Good-bye, Adamus,” hisses Ivan as he slams both his hands into my back, shoving me over the edge of the ravine, towards the rocks and water below.\u003c/p\u003e\n\u003cp\u003eCHAPTER 27\u003c/p\u003e\n\u003cp\u003eThe sun is warm on my face, in wonderful contrast to the cool saltiness of the ocean breeze. I relax back on my elbows and close my eyes. I turn my face up towards the sun, soaking in the California rays. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-fallen-legacies-lorien-legacies-the-lost-files-3/page-12.html","bookId":1681,"creation":"Oct 5, 2019 9:51:28 AM","modification":"Oct 5, 2019 9:51:28 AM"}
