{"id":63523,"no":13,"title":"Page 13","content":"\u003cp\u003eWhen I open my eyes, One is sitting on the sand next to me. She is so beautiful. Her blond hair is loose, brushing lightly across her bare shoulders. This is wonderful. Such a pleasant sensation. I can’t ever remember feeling so content.\u003c/p\u003e\n\u003cp\u003eWhy does she look so stricken?\u003c/p\u003e\n\u003cp\u003e“Adam,” she says, “you have to wake up.”\u003c/p\u003e\n\u003cp\u003e“Wake up from what?” I ask, feeling not a care in the world.\u003c/p\u003e\n\u003cp\u003eI reach out and take her hand. One doesn’t pull away; she just stares into my eyes with a pleading look.\u003c/p\u003e\n\u003cp\u003e“You have to wake up,” she repeats.\u003c/p\u003e\n\u003cp\u003eI feel a sudden chill. Somehow, my body is in two places at once. The other place is wet and cold. Painful. My body is tossed across rocks, buffeted endlessly by a forceful current. I can feel that some of my bones are broken, sharp pains slicing up and down my body.\u003c/p\u003e\n\u003cp\u003eI push that reality aside. I try to focus on California.\u003c/p\u003e\n\u003cp\u003e“Please, wake up,” One pleads.\u003c/p\u003e\n\u003cp\u003e“But it’s so nice here.”\u003c/p\u003e\n\u003cp\u003e“If you stay here, you’ll die.”\u003c/p\u003e\n\u003cp\u003eWhen I open my mouth to respond, muddy river water spills out. I gasp for breath, choking, struggling. The current is strong, pulling me downward.\u003c/p\u003e\n\u003cp\u003eBut that doesn’t make sense. I’m on a beach in California. All the pain is somewhere else, happening to someone else. One looks so sad and desperate, I have to turn away.\u003c/p\u003e\n\u003cp\u003eThe sun is just beginning to set over the ocean, the sky turning orange and purple. Soon it will be dark, and I’ll be able to rest.\u003c/p\u003e\n\u003cp\u003e“Wake up and fight,” begs One. “Please, Adam.”\u003c/p\u003e\n\u003cp\u003eI don’t know if I can. \u003c/p\u003e","sourceLink":"https://allnovel.net/the-fallen-legacies-lorien-legacies-the-lost-files-3/page-13.html","bookId":1681,"creation":"Oct 5, 2019 9:51:28 AM","modification":"Oct 5, 2019 9:51:28 AM"}
